{"asin": "B000ZK695U", "description": "White Knight Chronicles International Editionis a Japanese RPG (role-playing game) which allows players to explore an expansive and exciting world of turn-based combat, adventure and comradery A PlayStation 3 exclusive, it was created by noted Japanese RPG game developer Level-5 and features both single player and online multiplayer action, the awesome power to assume the shape of the White Knight, the ability to build a persistent online town/lobby, communication via online blogs, message boards and quest logs, voice chat and beautiful game environments..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Unleash the power of the White Knight.View larger.Character customization options.View larger.An accessible turn-based battle system.View larger.Exciting RPG action with 4-player online support.View larger.StoryThe story ofWhite Knight Chroniclesis set in the fictional Kingdom of Balandor and follows the adventures of a boy named Leonard who realizes his role in a drama started thousands of years in the past. Working in the proximity of the palace, Leonard stumbles on a plot to kidnap the enigmatic Princess Cisna. As he helps her escape he also becomes aware of his connection to a transformative power which allows him to take on the ancient shape, and harness the devastating power of the White Knight. Yet there are other elements at work here as well, including the forces of an evil wizard with powers that stretch back to the same ancient times which produced the White Knight. With the help of his friends and the power of the White Knight, these are the forces that Leonard will have to face in his quests.GameplayWhite Knight Chroniclesis a Japanese RPG (JRPG) centered around a turn-based battle system in a local single player story-driven campaign that is supported by online multiplayer functionality. Gameplay questing occurs from a third-person perspective and follows Leonard and up to three other AI companions, which can include the customizable character that players assume in multiplayer mode. Once quest members are assembled, players utilize the strengths of the overall group as a whole, and are able to switch between characters at will. Combat being turn-based, players must be able to cue up and control the actions of each character in quick sequence for each combat scenario faced. The game facilitates this via the Function Palette, located in its Battle Preparation menu, allowing players to prepare in advance a series of commands for each character to carry out. These can involve magic or weapons use and can be merged into combos. Multiple palettes can be saved, making it possible to optimize actions for specific types of enemies, and making for quick changing of commands. As with any RPG, throughout quests players accumulate experience which allows their character to level up, purchase items and abilities and generally grow stronger with an eye towards besting the increasingly challenging creatures, bosses and situations faced.Online MultiplayerAlong with a compelling single player campaign,White Knight Chroniclesalso contains an exciting online multiplayer component. Within this, up to four players can engage in more than 50 multiplayer quests, with each player creating their own unique customizable character which can be leveled up in a combined group effort, and take advantage of created items and new skills. Although unique to the online game mode, which is designed for multiplayer action, these quests can also be played alone if players wish. In addition to this functionality available in the online multiplayer mode also includes a variety of ways to interact with the widerWhite Knight Chroniclescommunity on the PlayStation 3 platform. Included in this is town building through the Georama functionality, which allows players to construct a town to their own specifications that can be populated offline with characters from throughout the single player campaign and then taken online where it serves as a base for quests hosted by players, as well as a persistent online location that other players can visit and buy items your town's population has for sale. The game also offers an online interface known as GeoNet that allows players to communicate with others via blogs, forums, quest logs and voice chat functionality, as well as post snapshots from their journeys using the Crystal Camera in-game tool.Key Game FeaturesWhite Knight Transformation- During single player combat players can transform into the giant White Knight, gaining the ability to challenge large enemies as well as troops of soldiers throughout the adventure.The Customizable Avatar Character- Using a wide array of sliders and customization options, players are able to create a unique character that can join the adventure in single player mode as well as online.Combo Battle System- Engage in an accessible, active turn-based battle system that caters to players of all levels allowing both default attack settings and a system for for maximum damage.JRPG (Japanese RPG) Action for PS3- Experience true JRPG action on PS3 that incorporates a variety of online gameplay elements.Beautiful Environments- Players traverse through 13 stages, as well as visit up to six towns/villages to visit and purchase items at shops or interact with NPCs. Stages include lush fields, open desert, vast wastelands, tunnels, and ruins.Multiple Playable Characters- Six playable characters are available, with up to three controllable characters on the screen at the same time.Build Special Weapons and Items- Combine different weapons and items to create a huge variety of weapons.Quests Galore- Engage in 50+ unique online side quests in which players can gain special items along with unique weapons and armor.Town Building- Build an online village for your character where you can invite friends to complete quests online and purchase unique items and gear.GeoNet- Through the online component, players have the ability to write their own blogs, communicate with other players via voice chat and more.Take Snapshots with Crystal Camera- With Crystal Camera functionality players can take pictures during their journeys which can be shared with other players via their GeoNet page.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51uqj9ce5CL._SY300_.jpg", "related": {"also_bought": ["B004WL4LOY", "B002I0J4AM", "B0021TVYCG", "B0016C3260", "B002BXJ9VA", "B002BRYHY0", "B007A7UJ4S", "B00B67ZTUW", "B007IFMEYK", "0744013240", "B003O6JIVE", "0744011914", "B000K9OR4Q", "B003O6G1L4", "B0047TLIBU", "B005185SDA", "B002BRZ79E", "B00BJH11FQ", "B00576U7W8", "B008CP6MA2", "B000HCJD68", "B005VBVQDI", "B001D7T2VC", "B000FQ2DTA", "B002I0J6KU", "B002I0K2J4", "B007XYBUBE", "B00B59MXGY", "B0058VI2LA", "B001C4C4KW", "B002BRZ744", "B003VMWR14", "B005TH6BD4", "B002AB7TX8", "B008SBZD5U", "B001CBW18U", "B008XMSR6G", "B001CRQY1E", "B004P7VGF2", "B003S2MXQG", "B0016GC9D8", "B00104KCF8", "B002DC8GKO", "B0044SA734", "B0056WJA6M", "B003O6HAS2", "B004TMGZ9K", "B00BY0G0YU", "B003FBL85M", "B004A87506", "B00J6DLPLK", "B009PJH47Y", "B0022TNO7I", "B004NRN5EO", "B004L9YS22", "B001YHX4B0", "B0057PERNE", "B001NX6GBK", "B002I0JNFI", "B00946FSIA", "B000UW1YBW", "B007V9QKH0", "B003O6KWZK", "B00D87TCN8", "B005DVAB0A", "B004EW948E", "B007TYC8MI", "B00170823O", "B002I0J5FG", "B000P8WOMO", "B003O6E2TM", "B00DV16N6U", "B0050SX9VO", "B008CP6Q6M", "B00KWEHBAG", "B0081B1O5A", "B003DLQTYY", "B002I0J8FI", "B008CP6RWU", "B003L8DXOI", "B004FUI84G", "B00G6S2SE6", "B00319DX4M", "B003O6E3QY", "B002I0J45C", "B00KWFCU4M", "B002EE1P2W", "B000ME07W0", "B0050SXAIG", "B003O6HLOK", "B0050SX2MK", "B004HVKA9O", "B005GM3XVA", "B003O6EDSM", "B000QW9D14", "B000G7X5Q8", "B003ZFVD4O", "B00K2O4O6U", "B001CMJAP6"], "bought_together": ["B004WL4LOY", "B002I0J4AM"], "buy_after_viewing": ["B0016C3260", "B002I0J4AM", "B004WL4LOY", "B00B67ZTUW"]}, "salesRank": {"Video Games": 3280}, "categories": [["Video Games", "PlayStation 3", "Games"]]}