{"asin": "B004M8SSTG", "description": "The Philips GoGear ViBE 4GB MP3 Player offers Philips FullSound for a richer music experience and Songbird for limitless musical exploration and easy synchronization. Portable and sturdy, this 4GB MP3 player is perfect for on-the-go entertainment. Soft rubber earbuds stay in place and provide a comfy experience, while a soft, smooth finish provides easy handling. The Vibe also features an FM radio with up to 20 preset stations, a 1.8-inch full color screen, and a Smart Shuffle option that lets you listen to the music you like the most first.GoGear ViBE 4GBAt a Glance:Compact 4 GB MP3 video player with 1.8-inch full color screenFullSound technology for CD-quality music without any distortionFM radio with room for 20 preset stationsSoft rubber earbuds for comfortable listening90-day warrantyThe Vibe uses Philips' FullSound technology so you can experience CD music without any distortion.View larger.A rubber cap encapsulates each earbud and gently adjusts to the shape and size of your ear to stay in place.FullSound for Richer, Fuller AudioThe Vibe uses Philips' FullSound technology so you can experience near-CD quality music without any distortion. Based on an audio post-processing algorithm, FullSound combines Philips' expertise in music reproduction with the power of the latest generation Digital Signal Processor (DSP). The result is fuller bass with more depth and impact, boosted voice and instrument clarity, and rich detail.Songbird: One Program to Discover, Play, and SyncThe Vibe comes with access to Songbird, a simple, easy-to-use program that lets you discover and play all your media, and sync it seamlessly with your MP3 player. Its intuitive and powerful music management features let you discover new artists and music styles directly in the program through music and media stores, services, and websites. Play your own library and media from the Internet and seamlessly sync all of it from your PC to your MP3 player.Full Color Screen and User-Friendly InterfaceThe Vibe has a 1.8-inch full color screen that allows you to navigate easily within the control menu or music files, or flip through your photo collection while enjoying music on the go. Dedicated volume controls, a keypad lock feature, a superscroll option, and a battery charging indicator right on the user interface make for easy operation. FastCharge lets you quickly charge the built-in battery, and provides 90-minutes of playback on just five minutes of charging, and the soft, rubberized finish provides easy comfort and durability.Soft Rubber EarbudsSoft rubber earbuds let you enjoy your music in comfort. A rubber cap encapsulates each earbud and gently adjusts to the shape and size of your ear to stay in place. It provides a soft cushion that makes listening through uncomfortable headphones a thing of the past.FM Radio with RDS and PresetsRDS (Radio Data System) is a communications protocol standard that allows digital information to be transmitted over FM radio broadcasts. RDS-enabled FM radio receivers can display useful information that includes station identity, program details, and song title and artist. With this feature, you can store a desired station as a preset channel on your Vibe player. You can store up to 20 preset radio stations and quickly access your favorite stations without having to tune the frequencies.Audible.Com Access for More Entertainment OptionsBeyond music and video entertainment, the Vibe lets you enjoy digital audiobooks, magazines, radio shows, stand-up comedy, and more available for download at Audible.com. Enjoy books in the car, at the gym, or around the house. At Audible.com you can browse and sample over 75,000 selections, including the latest best sellers and timeless classics.Warranty InformationThe Vibe is backed by a limited 90-day warranty.What's in the BoxGoGear Vibe Player, earbuds, and Quick Start guide.GoGear MP3 Video PlayersGoGear VibeGoGear AriazGoGear MuseCapacity4 GB8 GB8 GB16 GB8 GB16 GBHighlightsFullSoundFullSoundFullSoundFM radio with RDS and 20 presetsFM radio with RDS and 20 presetsFM radio with RDS and 20 presetsSoft rubber earbud headphonesSoft rubber earbud headphonesSound-isolation headphonesLossless codec support (FLAC &amp; APE) AudibleLossless codec support (FLAC &amp; APE) AudibleLossless codec support (FLAC &amp; APE) Audible1.8-inch full-color display2.4-inch full-color display3.2-inch HVGA color display24 hour music or 4 hour video playback36 hour music or 5 hour video playback24 hour audio or 5 hour video playback-Voice recordingVoice recordingPhilips SongbirdPhilips SongbirdPhilips SongbirdFolder viewFolder viewFolder viewAlbum art displayAlbum art displayAlbum art display&nbsp;&nbsp;Surround for movies&nbsp;&nbsp;HDMI video out, up to 720p&nbsp;&nbsp;Touch Screen", "title": "Philips SA3VBE04K/37 GoGear Vibe 4 GB MP3 Player", "price": 64.99, "imUrl": "http://ecx.images-amazon.com/images/I/31Y25cX4eJL._SX300_.jpg", "related": {"also_bought": ["B003C0Z01E", "B001UAPHXY", "B00IKMMA9Y", "B007B5TOZY", "B0050GNIW6", "B0002887Z0", "B0045DT3A6", "B002I006XG", "B007B5TO4A", "B001N84M0W", "B00ECRRB8G", "B0045DR8VW", "B002MAPT7U"], "buy_after_viewing": ["B007B5TOZY", "B002MAPT7U", "B002MAPS6W", "B003C0Z01E"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}