{"asin": "B000HCT12O", "description": "Amazon.com Product DescriptionWorld&acute;s most advanced mouse.Smarter, faster, and fully-loaded, the MX Revolution gives you powerful new controls that will streamline the way you work. Logitech&acute;s innovative MicroGear Precision Scroll Wheel lets you fly through long documents at hyperspeed, or switch to precise click-to-click scrolling for navigating lists, slides, and image collections. Toggle between open documents with the convenient Quick-Flip thumb wheel, or search the Web by highlighting a word or phrase and pressing the Search button.New, revolutionary, hyper-fast scroll wheelA new concept in PC navigation, the MicroGear Precision Scroll Wheel operates in two distinct modes, allowing you to scroll faster and with more precision than ever before:&nbsp;Free-spin mode&nbsp;for hyper-fast, nearly frictionless scrolling.&nbsp;&nbsp;With a single flick, the machined alloy wheel spins for up to seven seconds, scrolling hundreds of pages or thousands of rows.&nbsp; Fly through long documents and instantly stop wherever you want.&nbsp;Click-to-click mode&nbsp;for detailed navigation.&nbsp; An ultra-precise ratchet-scrolling mechanism allows users to move line-by-line&nbsp;through&nbsp;complex spreadsheets,&nbsp;step through slideshows, or travel small vertical distances in documents or Web pages.&nbsp;&nbsp;&nbsp;Hyper-fast scrollingFly through long documents at hyperspeed. Shift to precise click-to-click scrolling, to navigate lists, slides, and image collections.&nbsp;SmartShift technologyMX Revolution detects your current application and automatically applies the scrolling mode that best fits the task at hand.&nbsp;Document quick-flipMove effortlessly between documents. Cut and paste between applications, compare documents, or check e-mail.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Touch to searchHighlight a word or phrase and press the search button to instantly display results from your favorite search engine.&nbsp;Rechargeable Li-ion batteryNever worry about replacing batteries. A four-stage battery level meter lets you know when to recharge.&nbsp;Cordless LaserFull-speed USB wireless technology and state-of-the-art laser engine deliver absolute precision and control.&nbsp;&nbsp;System RequirementsPCWindows XPWindows Vista (requires Internet connection)Available USB portCD-ROM driveMacMac OSX 10.2.8+Available USB portCD-ROM driveInternet connectionPackage ContentsLogitech MX Revolution Cordless Laser MouseRecharging stationAC power cordUSB micro-receiverLogitech SetPoint software CDUser's&nbsp;guide3-year limited warranty", "title": "Logitech MX Revolution Cordless Laser Mouse (Black)", "price": 294.49, "imUrl": "http://ecx.images-amazon.com/images/I/41WFDVCYB2L._SY300_.jpg", "related": {"also_bought": ["B000J43HJ8", "B002HWRJBM", "B003VAGXWK", "B004OG94VW", "B000HCRVUS", "B0011FQUQG", "B002HWRJBC", "B0041EOB42"], "bought_together": ["B000J43HJ8", "B002HWRJBM"], "buy_after_viewing": ["B002HWRJBM", "B003NR57BY", "B00BFOEY3Y", "B003TG75EG"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Mice"]]}