{"asin": "B0002TPFTA", "related": {"also_bought": ["B000BCC0LO", "B00077INZU", "B0007OGTGS", "B0000AZK72", "B003X7TRWO", "B00008AWL3", "B000VDPBXM", "B003X7TRWE", "B0019804U8", "B006GTDAE2", "B009SPWJ98", "B005H4CDF4", "B003EE12EC", "B001DW8J5C", "B0000BVYT3", "B00006L4XB", "B004XXMUCQ", "B0092KZBCQ", "B001D1UTC4", "B00J2LIF2S", "B000BC7QMM", "B00407VXKU", "B00H09BOXQ", "B0000AZK4F", "B007ZT2KKM", "B00A1UOD8Y", "B004UBUJZG", "B000LIFB7S", "B001CY0P7G", "B004HIN800", "B0041W55YE", "B000XJJN60", "B00077IG3O", "B005SHQ644", "B000E891P8", "B0002I7288", "B00315VPL4", "B0000AZK4D", "B0092KZBD0", "B001OZFCI0", "B00008AWL4", "B001769K3O", "B00006RVPW", "B00G9BNBDW", "B003VANO7C", "B001QUA6R0", "B009V17BYC", "B0049KV52E", "B008X3JHJQ", "B003Y24DEU", "B000N99BBC", "B008CWW6VY", "B008CR07OM", "B001S2PJO6", "B004VUOAPG", "B005A96XMK", "B002G1YPHA", "B00006B834", "B00AWRUGSW", "B007HIMJS4", "B0066DV06I", "B00004SYO5", "B005EORRBW", "B000FBK3QK", "B004SUO1S0", "B00006B83A", "B00C2DL96W", "B00BS92DCK", "B000Z80ICM", "B003K1NFY4", "B000XJNOXI", "B0092TG310", "B00ITUKH92", "B00A6B4O7S", "B00461G3MS", "B001LDKO60", "B00FJRS6FU", "B001Q7X0Z8", "B001QUA6RA", "B00C2DLRV4", "B0002CWPW2", "B00G9BN2UE", "B002RYTI7I", "B00C2CA3N8", "B00B5L9P36", "B003NREDC8", "B001EVGIYG", "B002MZW5JU", "B001985SWW", "B000DZRY9C", "B00D78QCYK", "B004KABG1I", "B00DB9WCR6", "B00C4U030G", "B00E6LID0S", "B006IKHLJE", "B003CFATNI", "B003M5BIII", "B0001FTVD6"], "bought_together": ["B0007OGTGS", "B00077INZU"], "buy_after_viewing": ["B003BU0EKW", "B0002CWPW2", "B0092KZBD0", "B004SUO1S0"]}, "title": "D-Link 24-Port Rackmountable Gigabit Switch DGS-1024D", "price": 142.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31wi7ZhIDrL._SX300_.jpg", "brand": "D-Link", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Switches"]], "description": "The first of the Green Ethernet products the DGS-1024D provides 3 key benefits to end users through its cutting edge innovative  technologyReduces power consumption & creates less heatExtended product lifeReduces Operating CostsPower Savings by Number of Connected Ports and Link StatusComputers do not require Internet access all the time; neither do switches utilize all ports at all times. When a computer or network equipment is shutdown, switches often remain on and continue to consume considerable amount of power. With Green Ethernet technology, D-Link switches can automatically detect link status and reduce power usage of ports that are idle. Computers or any connecting parties set to standby mode (not power off), however, will not provide significant power savings.Power Savings by Cable LengthThe Green Ethernet switches have the ability to analyze the length of any Ethernet cable connected to them for adjustment of power usage accordingly. Shorter lengths require less power.Overall Power Savings Per DayFor a traditional switch, power consumption remains constant even when the ports are not in use. In a standard workday scenario where PCs are used for 10 hours a day and powered off 14 hours a day, and connected to the switch using 20 meter cables, D-Link's Green Ethernet can save up to 25%* power used for each system.Note: Switch uses switching power adapter. The cable length which PCs are connected to switch is 20m cables.Get the blazing speed of Gigabit Ethernet with the D-Link GigaExpress DGS-1024D, an 24-port 10/100/1000Mbps Gigabit Switch that delivers power, performance, and reliability in one cost-effective, space-saving design. Increase the speed of your network server and backbone connections, or make Gigabit to the desktop a reality.Power users in the office, workgroup, or creative production environment can now move large, bandwidth-intensive files faster. Transfer graphics, CGI, CAD, or multimedia files across the network instantly. The versatile and compact 1RU height design of the DGS-1024D enables the device to be rackmounted in a standard 19 inch rack, while conserving valuable rack space.Power-PackedIt features a non-blocking switching architecture that filters and forwards packets at full wire-speed for maximum throughput. An 8K MAC address table provides scalability for even the largest networks. Address learning and aging, 802.3x Flow Control for full-duplex mode, and back pressure flow control for half-duplex mode alleviates traffic congestion and ensures reliable data transmission.Designed using industry standards, it is compatible with virtually all 10, 100, and 1000Mbps Ethernet devices and other vendor equipment. The D-Link DGS-1024D 10/100/1000 Mbps Gigabit Switch protects your existing network investments while providing you with a straightforward migration path to faster Gigabit speeds.Easy to useThe auto features of this gigabit switch make installation plug and play and hassle-free. No configuring is required. Auto MDI/MDI-X crossover on all ports eliminate the need for crossover cables or uplink ports. Auto-negotiation on each port senses the link speed of a network device (either 10, 100, or 1000 Mbps) and intelligently adjusts for compatibility and optimal performance.It also features diagnostic LEDs which display status and activity, allowing you to quickly detect and correct problems on the network. Every port also supports a cable diagnostic feature that helps to detect cable related problems.* Power savings may vary depending on products used. Maximum power savings when compared to a D-Link conventional switch. Uses up to 45% less energy when connected devices are powered down and up to 25% less energy when connected devices are used 10 hours and powered down 14 hours over a 24-hour period, when connected via 20 meter Ethernet cables.Green Ethernet features available on hardware version C1 or later."}