{"asin": "B001F51G1Q", "description": "From the ManufacturerThe Easy-To-Use Remote that Replaces All OthersHow many remotes are on your coffee table? Wouldn't it be easier to just have one? Logitech Harmony 510 advanced universal remote simplifies your home entertainment, replacing up to five remotes with one--reducing clutter and complexity in your living room. One-touch, activity-based control turns on the right devices in the right order--getting you to your entertainment easier and faster than any other remote. And the interactive LCD with Help function makes it easy for everyone in the family to use. Supporting more than 225,000 devices from 5,000+ brands, you can be confident the Harmony remote can control whatever entertainment devices* you have today or buy tomorrow.* Devices with IR (infrared) capability.Key FeaturesOne-Touch, Activity-Based ControlOne press turns on the right devices in the right order. Powers on your TV, DVD player, and stereo receiver; sets all your inputs; and even, for example, starts your movie.Guided, Online SetupSimply connect Harmony to your computer and the online software guides you through the entire setup.Control up to 5 Devices for 5,000+ BrandsSay goodbye to your TV, DVD, cable, and stereo remotes. Harmony works with more than 225,000 devices from 5,000+ brands--and the list grows every day.Interactive LCD with Help FunctionHarmony makes it simple. For everyone. It will even ask you questions to make sure you're watching and listening to the entertainment you want, exactly the way you want itGet the Logitech Harmony Adapter for PLAYSTATION 3. Finally, control movies on your PS3 &mdash; drama free.Wish you could control all your movies, music, games and entertainment gear &mdash; including your PLAYSTATION 3 &mdash; with one remote? Wish granted.Add one touch PS3 control to any Harmony remote with the new Logitech Harmony Adapter for PLAYSTATION 3. Now your entire entertainment system and every PS3 command is at your fingertips. Want to watch a DVD or Blue-ray Disc movie? Play a game? Turn the console on or off? Easy. Just press one button on the remote to experience instant entertainment gratification.Which Harmony Is Right for You?Want to find out what other Logitech Harmony Advanced Universal Remotes fit or support your audio &amp; video setups at home? See Harmony Remotes Comparison Chart or product pages below.&nbsp;View Logitech Harmony Product Comparison ChartLogitech Harmony 550Throw away the cheat sheet for all those remotes and get intuitive, one-touch control over all your home entertainment components. Just choose the activity that you want and go.Logitech Harmony 670Enjoy total command of your home entertainment -- with one-touch controls for easily choosing any entertainment activity and support for all the functions of your DVR.Logitech Harmony OneThe color touch screen and sculpted buttons, featuring an intuitive layout and backlighting, give you easy, one-touch access to your home entertainment -- even in the dark.Logitech Harmony 890With RF support (up to 100 feet) and easy, one-touch controls, you're ready to hide all of your AV components and keep that sleek, clean look in your home theater.Logitech Harmony 1000With easy, one-touch control for your AV components, a color touch screen, and a sleek brushed aluminum design, the Harmony 1000 fits naturally in any living room.Logitech Harmony RF Wireless ExtenderComplement your flat-screen lifestyle with the RF Wireless Extender, which works with the Harmony 1000 or 890 remote to help keep all your components out of sight.What's in the BoxPackage ContentsHarmony 510 Advanced Universal RemoteUSB cable4 AAA batteryInstallation CDInstallation guide1-year limited hardware warrantySystem RequirementsPC with Windows Vista, Windows XP or Macintosh computer with Mac OS X (10.3 or above)1 available USB portCD-ROM driveInternet access", "title": "Logitech Harmony 510 Advanced Universal Remote Control (Discontinued by Manufacturer)", "price": 67.99, "imUrl": "http://ecx.images-amazon.com/images/I/41w3VcP8-YL._SY300_.jpg", "related": {"also_viewed": ["B004OVECU0", "B000EUGX70", "B002IC0YLS", "B000BDG3HU", "B003JSLP54", "B00093IIRA", "B000IMSK8Y", "B004OVECUA", "B00J7KM5X4", "B000GD3J3G", "B000CCXCYC", "B003IZFCFW", "B0038OMEQI", "B000CS1TLE", "B00IAKLM54", "B00BQ5RYI4", "B005FO43OU", "B005O81U9S", "B009EIUH6G", "B004U605FK", "B002IC0YL8", "B00119T6NQ", "B001M5U5AC", "B004UKRRD4", "B00I54C0GA", "B00BQ5RY1G", "B001KC08AE", "B0003QER8C", "B001KC08A4", "B000II6YEA", "B003AM8S3G", "B003DNS88W", "B000FL9E6K", "B003UVVGHW", "B0003QER82", "B001HKLA60", "B002N1J7DU", "B000623HE8", "B0033WSTYQ", "B00267S7XW", "B009VJUEJS", "B001HA51Z6", "B00EXPIY60", "B00182F1SU", "B007FIPSXE", "B004HB2X3U", "B000VAXSFS", "B00385XUG0", "B005O81U8Y", "B00KOLNVAQ", "B00066FHHO", "B003YKB3OA", "B0003QER5U", "B00AP61HYM", "B001G6LTL6", "B002JW7BN6"], "buy_after_viewing": ["B004OVECU0", "B000EUGX70", "B00BQ5RYI4", "B00BQ5RYI4", "B002IC0YLS"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Remote Controls", "TV Remote Controls"]]}