{"asin": "B000MPIX3E", "description": "Secure your iPod or MP3 player in place while you drive. Flexible arm adjusts to hold player firmly no matter how bumpy the roads.Secure your iPod or MP3 player in place while you drive.Flexible arm keeps your iPod in view and within easy reach.FeaturesFlexible arm keeps your iPod in view and within easy reach.Works with most most iPods and MP3 players, including the iPhone--even when in a case.Universal mount designed to fit all cars; installs in seconds.Oversized suction cup is strong enough for even the roughest roads.One-button quick release lets you grab your iPod and go.Adjustable feet prevent your iPod from falling when released.Includes super-strong adhesive pads for alternative mounting locations.Auxiliary-in cable included to play music directly through your car stereo.WarrantyThe car mount for iPods and MP3 players is backed by the Kensington two-year warranty.Notice to drivers in California and Minnesota:State law prohibits drivers in California and Minnesota from mounting items on car windows that may obstruct the driver's view. In California and Minnesota--or where other state or local laws may prohibit drivers from mounting items on the windshield--drivers should mount the holder on the dashboard or other location. Kensington does not take any responsibility for any fines, penalties, or damages that may be incurred as a result of disregarding state or local laws. (See California Vehicle Code Section 26708(a); Minnesota Statutes 2005, Section 169.71.)What's in the BoxCar mount, adhesive pads for mounting, auxiliary-in cable, and user's manual.", "title": "Kensington Car Mount for iPod; iPhone 1G, 3G; and MP3 Players (Black)", "price": 24.49, "imUrl": "http://ecx.images-amazon.com/images/I/318ZVJ3%2B-jL._SY300_.jpg", "related": {"also_viewed": ["B003SE6LD0", "B007FHX9OK", "B00D901B4W", "B0075PZGTS", "B001G7PIDA", "B00BAQKRHY", "B00CB6X6Y8", "B00I0DL2OC", "B004G1L52Q", "B009GSI0MM", "B00I58VAZS", "B008IOQ3K6", "B0031U1ATQ", "B00EA3PCFQ", "B00C0TISZI", "B00G3ZI0UI", "B004KPLS7K", "B00I5URYME", "B00B1RU5E2", "B007FH716W", "B00HMDYH2U"], "buy_after_viewing": ["B003SE6LD0", "B007FHX9OK", "B00D901B4W", "B003Y3BEV4"]}, "categories": [["Electronics", "Car & Vehicle Electronics", "Vehicle Electronics Accessories", "Audio & Video Accessories", "Audio Car Mounts"]]}