{"asin": "B0006I5I58", "description": "A stunning and exquisitely realized masterpiece that delivers a gaming experience unlike any that we've seen before, Stranger's Wrath rekindles the artistic allure of Oddworld's previous works, and is truly visionary in its delivery of gameplay. Once you set foot in this imaginative world, you won't want to leave it.Players assume the identity of the Stranger; a drifter turned bounty hunter that hides a secret that requires a specific, yet unrevealed, surgical procedure costing twenty grand. With each criminal that you bring to justice, you'll inch closer to this goal &#x96; a goal that leads to a shocking twist in the game. I gasped when I found out exactly what the Stranger was hiding.Leading up to this point, the majority of your time is spent chasing down wanted criminals. By communicating with villagers via a streamlined Gamespeak system, players will learn the location of their targets, among other amusing things. The new Gamespeak interface is not as complex as it has been in previous Oddworld titles &#x96; it now requires just one button press &#x96; but it is just as humorous. I was often in tears over some of the things that were being said between Stranger and the inhabitants of this crazy world.As remarkable as the presentation is, the true star of this title is gameplay. I was blown away by the game's ability to seamlessly transition between frenzied FPS and harrowing third-person platforming. Oddworld has also created a highly innovative ammo system. Not only are you using wildlife as \"live\" ammo, you actually have to scour your surroundings and hunt for more munitions. The ammo that you unload produces a variety of results. Firing a Bolamite at a foe will tie them up in sticky webbing. Stunkz scent will make anyone near it gag. Boombats explode. And the Chippunk is just so darn cute that enemies will go to any length to squish it. Boss fights are demanding of different strategies, and even the way that the health system is managed is a complete departure from what we are accustomed to, as you shake off damage like a wet dog does water. All told, the gameplay package is creative, fun, and the perfect fit for an Oddworld game.If you are of the belief that you've seen everything that video games have to offer, getting to know the Stranger will make you realize that we haven't even begun to scratch the surface of what can be done in game development.Concept:Oddworld just got odder&#x85;but in a very pleasing wayGraphics:There's a little draw in, but it doesn't take away from the magnificence of the vistas and the creatures that inhabit the landSound:You'll be hard-pressed to find better character voices in a game. The soundtrack is also a perfect fit, and hearing your ammo take jabs at you is just flat out funnyPlayability:Excels in both first- and third-person. The original ideas that are applied to boss fights, ammo, and healing are mighty impressiveEntertainment:Genuine and completely satisfying, this is an adventure that everyone has to takeReplay:Moderately HighRated:9 out of 10Editor:Andrew ReinerIssue:February 20052nd Opinion:There are few series as truly memorable as Oddworld. That's why I'm so overjoyed that this dramatic departure in gameplay style still manages to hold on to the incredible appeal of the franchise. Uproarious hilarity mixes with not so subtle social commentary amid a gorgeous backdrop of artistic beauty. The new action and combat is stellar, offering the smoothest combination of third- and first-person gaming that I've encountered. Everything melds into an experience that feels totally genuine and involving. Funny, challenging, and curiously powerful, Stranger's Wrath is a game of impressive quality and meticulously crafted fun.Rated:9 out of 10Editor:Matt MillerSubscribe to Game Informer", "price": 33.46, "imUrl": "http://ecx.images-amazon.com/images/I/61RYWV8MEGL._SY300_.jpg", "related": {"also_bought": ["B00005NZ1K", "B0007PIEAQ", "B001ELWMHI", "B00000JHPN", "B0006ZJPSC", "B00019HNN2", "B00006LU9C", "B00002STJO", "B00009ZVHR", "B00005NZ1G", "B00006LELH", "B0001UEHP8", "B00009YFU3", "B00097IA88", "B00008KTNW", "B00020BV0Q", "B0006SST9U", "B0001CNRQQ", "B0002SQ0BS", "B0000C7GH4", "B0002CHIZ6", "B00006IJIW", "B00008J7NZ", "B00005V5LO", "B0001KUE7S", "B00007E1OB", "B000B2YR74", "B00006JZQZ", "B0009351RK", "B0007OGDHS", "B00005RKO7", "B0000AI1KC", "B001I020CW", "B00008G75X", "B00005Y404", "B00019AZA0", "B000095ZH0", "B0009VQANQ", "B00020BV1A", "B00129I75I", "B000FW6MFK", "B0001Y73YQ", "B00009M7Q8", "B00005RCQ5", "B0009O7HUS", "B002K8Y23G", "B00006409Z", "B0009UC68U", "B00005Q8M4", "B0002IZICK", "B00006LEMQ", "B00009ZVHU", "B0007P8FN2", "B00005OWBL", "B0009Z3IV4", "B0000A92KZ", "B000067DPM", "B00009W5WB", "B000A0IBLK", "B0001I9YFS", "B00006JC3S", "B00005R6YX", "B004AGYHUE", "B000E61G4O", "B00006JN5J", "B0002ILS10", "B000088KH4", "B0001ADAMO", "B00004TC6E", "B00009KO3S", "B00000K1VE", "B0009IN2J4", "B0002HDSZU", "B00001X50M", "B00019AZAK", "B00000I1BF", "B00002SVWG", "B0000C6FJ3", "B00004YUWA", "B0002B90SA", "B00000DMAR", "B000083JTP", "B000CBVC0Y", "0761550046", "B00012TIW8", "B0000A09EN", "B000038ABO", "B0007OSLOG", "B00065HIR2", "B0000C6EDL", "B0007PLKZW", "B00008H2IU", "B000K6TOK6", "B0002EJ852", "B00005BZCH", "B00009XS68", "B0007PLKYS", "B00067AVSS", "B00078W0BM"], "bought_together": ["B00005NZ1K"], "buy_after_viewing": ["B00005NZ1K", "B0001UEHP8", "B00000JHPN", "B00005NZ1G"]}, "salesRank": {"Video Games": 6961}, "categories": [["Video Games", "More Systems", "Xbox", "Games"]]}