{"asin": "B00009WAUK", "description": "You can almost hear the collective drooling of RPG and Game Boy fans worldwide. As the inaugural Nintendo/Square reunion title,Final Fantasy Tactics Advancehas a lot to live up to--and it does, spectacularly!The long heralded Final Fantasy series has enjoyed a number of spin-offs and sequels. Using the familiar character types and classes of the Final Fantasy series, but with a wholly original storyline,Final Fantasy Tactics Advancecreates an immersive world of strategic combat and conquest.Snow JobWhile most fantasy games favor romantic landscapes,Final Fantasy Tactics Advanceslyly starts out in a plain-vanilla suburb. Players assume the role of young Marche Radiuju in the humble burg of St. Ivalice.A snowball fight introduces the characters and sets the groundwork for future battles. After a brief (but chilly) skirmish, Marche heads home to visit his younger brother.Marche MadnessSoon after, Marche's friends drop by to show him an ancient book of mysterious origins. After failing to translate the text properly, Marche's friends leave for the evening. After a wistful slumber, Marche awakens and realizes he isn't in Ivalice anymore... or is he?Alone in a foreign land, Marche quickly comes under the care of a helpful creature known as a Moogle. It doesn't take much to convince Marche to adopt a lucrative career as a mercenary.Gangs of IvaliceA quick stop at the town inn introduces Marche to his new gang. A motley crew at best, your associates include low-level monks, mages, archers, and soldiers. The only hope you have of finding your way home is to turn your ragtag group of misfits into a finely tuned fighting force.Begin your tour of duty by chatting up the local barkeep. He'll clue you in to interesting news bits, rumors, and job opportunities. Due to your severe lack of experience, early quests are little more than errands.As you gain experience and reputation, your job options grow as well as the rewards. You can also send one of your crew members on side missions for extra swag. You cannot use these members in your regular quests until they return from their mission.Rules of EngagementWhether your quest is to fetch rare herbs or escort the local nobleman, you can always expect bad company. The battlefield is set up from an isometric 3D viewpoint, allowing clear view of every character in play.At the start of a match, you must choose which members of your gang you wish to take into battle with you. You have a clear view of the enemies before choosing, so try to match your lineup to your opposition.Final Fantasy Tactics Advanceintroduces an innovative law system to the series. During every battle, an impartial judge decrees specific rules, such as banning poison attacks or physical attacks. The judges' unpredictability requires players to keep a well-rounded group of characters at all times.Technically, you can break the combat laws, but it is generally not recommended. Even if you win the battle, any of your characters who breaks a law is whisked away to prison. They can only be released after paying a hefty fine.Fantasy FightingThe battlefield is set up like a 3D chessboard, with elevations and terrain types. In each turn, a character can move a specific number of spaces and perform a single action, such as attack or using an item.Most strategy games employ either real-time or turn-based action.Final Fantasy Tactics Advanceemploys a speed-based system that is somewhere in-between.Characters still take turns to move and perform actions, but these are based on each character's individual speed ratings. Nimble characters like rogues and ninjas are usually the first characters to go and can usually move farther than other characters. The downside is that faster characters typically lack strong armor and health stats.Subtle details such as terrain type and attack proximity can have a direct affect on your ability to hit an enemy. Attacking an enemy from behind or the side will yield much higher hit percentages than head-on attacks.Job FairWhat you do off the battlefield is arguably more important than what you do on it. Thanks to a stable economy, your characters can usually change job classes once they gain enough experience.Need a little more magic in your life? Try turning one of your grunts into a mage. There are more than 30 different job classes available, each with its own strengths and weaknesses.Even in far-off fantasy lands, commercialism is a way of life. You'll be amazed at how quickly you'll end up spending your hard-earned greenbacks on shiny new stuff. Weapons and armor serve not only to boost your stats, but also grant special abilities to specific character types and species.While one sword might grant tremendous attack points, a seemingly lesser sword may give its wielder access to a special attack that can tip the scales in your favor. Thanks to the law system, one should never get too attached to a single piece of equipment.Face ValueGorgeous character illustrations and 2D sprites harken back to Square's 16-bit glory days. Each of the shops, inns, towns, and fields is superbly detailed, with subtle background animations.Final Fantasy Tactics Advancemaintains the series' stellar rep for technically and visually brilliant summon attacks.Uniquely,Final Fantasy Tactics Advancefeatures three separate display settings, depending on whether you're playing on the Game Boy Advance, Game Boy Advance SP, or the Game Boy Player. Each setting offers different levels of brightness, contrast, and saturation to appease even the most fickle of gamers.The only thing that can rival the on-screen wonders is the audio candy. It is no surprise why Square Enix's soundtracks are the most sought-after in the video game community.Lasting PowerNeedless to say, there are hours upon hours of gameplay packed into this tiny little cartridge. Square Enix has done a tremendous job in creating an easily accessible yet incredibly deep gameplay experience. Plug into one of the finest strategy RPG experiences ever created withFinal Fantasy Tactics Advance.", "price": 116.43, "imUrl": "http://ecx.images-amazon.com/images/I/51yZcsELkCL._SY300_.jpg", "related": {"also_bought": ["B001A01FD0", "B00005OARM", "B00005MDZZ", "B000BI3SIC", "B00030GS8A", "B00006LELB", "1930206364", "B0007ZSHOY", "B0000A09EP", "B0000BX8M6", "B00008YMZV", "B000HE9LEK", "B000LY4IDK", "B00030GS80", "B00008KU9Z", "B00006M3R6", "B00068O278", "B000060NQ1", "B00009WAUO", "B000GABOTU", "B00012BSJ4", "B00006FWTW", "B0009XEC02", "B000VBB69M", "B000SSQPU8", "B00005ATSM", "B00005ATSN", "B00009WAUM", "B000087PM3", "B000070IW6", "B0002TB4CW", "B001O1PAMC", "B00005UK88", "B00005B8G1", "B000090W86", "B000AX224Y", "B000FW57CE", "B00008URUF", "B00022GIYI", "B00FPWTTOQ", "B000B5MV6A", "B00005MI42", "B0000A9Y11", "B000CQP58E", "B0001ZZNME", "B000046S40", "B00005MDZY", "B000B5MV60", "B00AYBVB44", "B00184219U", "B00161E5JE", "B00L3LQ1FI", "B00KVMHSUM", "B0000631WO", "B000QJ1NS8", "B00009KO3B", "B0000657SN", "B000CNESHQ", "B00005B8G3", "B000066TS4", "B000087H7T", "B0000E5U6M", "B00005B8FZ", "B00009WAV4", "B00092A72A", "B0008JILTA", "B0019R361I", "B00008KUA3", "B001TOMR6Q", "B00005MO5G", "B002JEUDX4", "B000I1SCMO", "B00007B9MY", "B00009WAUN", "9882106463", "B00007B77H", "0744010292", "B0007D4MW2", "B00B8SAB8O", "B00002ST28", "B00024W1R4", "B003O8EDUS", "B00005B8IX"], "bought_together": ["B001A01FD0"], "buy_after_viewing": ["B001A01FD0", "B00005OARM", "B000BI3SIC", "B00008KU9Z"]}, "salesRank": {"Video Games": 6316}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "More Systems", "Game Boy Advance", "Games"]]}