{"asin": "B000HCQK0A", "description": "Pacific City is overridden; crime controls the streets. Three powerful gangs have taken the once-great metropolis hostage, and the police have proven powerless in their efforts to regain control. Only the Agency's deploying genetically enhanced agents of justice can provide citizens with some sense of hope. With an open-ended \"sandbox\" environment, players are free to explore the city and decide on the best tactics for each breathtaking scenario. Brace yourself. Justice is coming to Pacific City.Next generation gaming has never been this open!Three crime syndicates vie for control of the city.View larger.Innumerable routes to objectives are available.View larger.Your collection of weaponry increases rapidly.View larger.Next-gen visuals pop off the screen!View larger.A next-gen visual and gameplay styleCrackdownpushes the action-driving hybrid genre into the next generation with the first ever truly 3-D playground. Gamers will level up their Agent's strength, agility, firearms, explosives, and driving skills while scaling the fully vertical world. Enforce justice by any means necessary in Pacific City, a crime-ridden urban center primed to explode and ready for you to explore. Enter an interactive world where anything can be used as a weapon as you clean up the streets the only way you know how. Your way. Developed by Scotland's Real Time Worlds exclusively for Microsoft Game Studios and the Xbox 360 console,Crackdownis the brainchild of Dave Jones, the creative genius behind many innovative game titles such asGrand Theft AutoandLemmings.Harnessing the amazing power of Xbox 360,Crackdownplayers enforce justice against the backdrop of a crime-ridden metropolis that is massive in scale and meticulous in detail. The game's unique presentation employs a highly stylized rendering technique that turns it into a living, breathing graphical novel. You play the role of an enforcer for the city's \"Agency,\" a law enforcement entity looking to take back neighborhoods and lives from three large crime syndicates. You are part of the new generation of crime fighters- an entirely new breed of genetically superior super-cops, designed to use the enemies' tactics against them.Multiplayer mayhemFrom the initial conception,Crackdownhas been built to feature a dynamic and engaging co-op experience for double the action, carnage, and intensity. Never before has a game allowed two players to simultaneously explore and interact with an open-ended game environment. Will you work together to find new ways of detonating your impressive stash of explosives? Or will you race each other to the next batch of collectible ability orbs? The choice is always yours!An impressive number of weapons and objects are also at your disposal. Low on ammo? Never a problem. Thanks to an amazing amount of props and a deep physics system, you can use whatever you get your hands on as a weapon: Trash cans, vehicles, even people. Set the scene for mass destruction with a game that remembers your actions better than you do. Gather vehicles to assemble barricades, build epic piles of explosives, push it to the limit.Crackdowncan take it.A sandbox full of opportunitiesFor the first time ever, every inch of an urban playground has been designed for you to explore and exploit. Use any route necessary as you take down the crime syndicates, going under, around, or through the environment however you choose. While previous \"sandbox\"-style titles have allowed you to merely walk or drive around the environment,Crackdownencourages players to find new routes to and from destinations. Often times, scaling a building or traveling beneath the surface will present new and unexpected challenges to the player- or provide an even more deadly option for the enemy.Get the job done, no matter what it takes. Any strategy or tactic is acceptable, so long as you re-claim the streets. Unleash the awesome powers of your agent, developing his full genetic potential, becoming faster and stronger, learning bone-crushing moves, using outrageous weapons, and defying certain death at every turn.", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/61GDKDqAUZL._SY300_.jpg", "related": {"also_bought": ["B002BRZ8BQ", "B000B6ML1Y", "B000C427NM", "B000OLSJLC", "B000FRS9II", "B000F3AADE", "B000ZK9QD2", "B000R0SS3Y", "B002DC8GKE", "B0016NRS28", "B003H0CC2O", "B000P8WOMO", "B003WY86NE", "B000H94PVO", "B000B6ML0U", "B000GPVUOY", "B001A4MTGS", "B002I0H79C", "B003O6E7AG", "B002I0HAC6", "B000QW9D14", "B004FUL9YW", "B0030GBU32", "B000BLM5PG", "B000R0RHA4", "B000G7PMXC", "B0076ZPYPI", "B0050SY9WC", "B000KLNLV4", "B0010AYJXI", "B00354NAYG", "B001D25M1Q", "B001HWB68K", "B000ZJVDA2", "B007UMD1EI", "B000G75AXY", "B000FRU0NU", "B000WQWPOQ", "B002I0JGDM", "B000ZKDOV2", "B000A0EFJW", "B0013RATNM", "B003P9C6QY", "B002BSA20M", "B001UWGDC6", "B000SQ5LQ4", "B000HX1P72", "B0042VX73U", "B00319DX4W", "B0050SY4DG", "B001L18RIE", "B000B6ML28", "B001ASJIRM", "B001ASJISG", "B0009SQFHA", "B002BRZ852", "B000ZK9QFK", "B005J5K9EI", "B004UDLRMS", "B0023CBY4E", "B00C3MK9BS", "B000RHZ9JI", "B0014ULQB2", "B002EE5ROO", "B004PAGJOC", "B003O6CA64", "B000WEQL02", "B002GN8HU4", "B001D7T2VM", "B000B6ML0A", "B004QEV0MI", "B000R0SR9E", "B000OCXK6A", "B000UKZ20S", "B002W5GI9I", "B000FRVAD4", "B001YI0Z2U", "B0016NRS8M", "B00ICWO1XA", "B0050SYY5E", "B0050SYV70", "B007ZQJN1Y", "B0058VI0SU", "B0050SYX8W", "B0016NUZFU", "B000O5FUQ0", "B000WSE2WM", "B000FLZEXM", "B0016B8Q6M", "B000ZK698C", "B003S2MXRA", "B000CQNWH0", "B002DC8GEK", "B004L9WGDA", "B004JSDQPU", "B001NX4DUQ", "B0022TNO7S", "B004ML7WOK", "B000XJNTPG", "B00432O4VM"], "bought_together": ["B002BRZ8BQ"], "buy_after_viewing": ["B002BRZ8BQ", "B0050SYILE", "B000ZKDOV2", "B00BMFIXT2"]}, "salesRank": {"Video Games": 5132}, "categories": [["Video Games", "Xbox 360", "Games"]]}