{"asin": "B000R3BN4M", "description": "Before he waged war on the gods...he was forced to serve themThe third game in theGod of Warfranchise,God of War: Chains of Olympusfor PlayStation Portable is a prequel to the first two games in the series published for PlayStation 2, and true the high standards ofGod of WarandGod of War II, not only does it equal the efforts of its predecessors, in some ways it may even surpass them.Explore Kratos' story from the beginningKratos on the shores of Attica.View larger.The Blades of Chaos in action.View larger.Beautiful in-game environments.View larger.Mythological boss battles.View larger.Kratos? StoryTheGod of Warfranchise tells the tragic and violent story of the warrior Kratos and his dealings with the gods. The ancient world would eventually both praise and damn the infamous ?Ghost of Sparta? as the mortal who slayed a god, but long before his battle with Ares, Kratos sought absolution from his past sins by pledging himself as a champion to the gods. These brutal crusades in the name of Olympus became legendary, but would have far-reaching consequences. InChains of OlympusKratos is pushed to the edge as he is ordered by the gods to journey to the very depths of the underworld after the world plunges into darkness. There he must face the most feared creatures of Greek mythology and is forced to choose between his own personal redemption and saving the ancient world from certain destruction. It is a choice that will shake the immortals from their perches on Mt. Olympus.God of War'sEpic Gameplay Comes to the PSPPlayStation Portable has always been head and shoulders above its competitors in the handheld market when it comes to processing power, and inGod of War: Chains of Olympusthe PSP platform may just have reached its highest level to date. Packed with features like dramatic camera angles, epic set pieces, cinematic cut scenes, stirring audio and seamless fast action gameplay, formerly only available on console platformsChains of Olympusbinds players to the game?s epic adventure, regardless where they are when they join in the action.Combat Moves, Both Old and NewNearly as defining as the name of Kratos itself, the trademark sweeping attack moves of the ?Ghost of Sparta? using his weapon of choice the ?Blades of Chaos,? epitomizes allGod of Wargames andChains of Olympusis no exception.Although overall the PSP has fewer buttons than the PlayStation 2 controller, developer Ready at Dawn Studios has managed to incorporate nearly all of the attack moves and combination moves from previous games in the series into this new project. This continuity in gameplay not only provides a seamless intro into the game for veteran players, but a gentle learning curve for players new to the series. Add to this new brutal combat moves and an additional upgradable weapon and you have a combat system that will engage players at all levels.Exploration and Puzzle SolvingFrom the bright gates of Attica to the darkest dungeons of Tartarus, Kratos? journey and your own will take you through the dark and brutal world of Greek mythology. Here not only will your skill with the Blades of Chaos be tested, but your wits as well.As you explore the dangers of the ancient world, players must be prepared to use their navigational skills as they press on through labyrinths of challenging puzzles. Some may be simple tests at manipulating the game?s environment to your advantage, while others much more difficult also requiring precision timing of moves, but each will be different and test you in new ways.An Evolution in Franchise HistoryMore than just a missing piece in the history of theGod of Warfranchise,Chains of Olympusalso serves as an evolutionary link between the origins of theGod of Warfranchise and its future. Originally developed for PlayStation 2, the future of the franchise is slated to make its arrival on PlayStation 3 in the form of the highly anticipatedGod of War IIIin the not too distant future. Not only is PlayStation Portable designed to work in unison with PlayStation 3 in many ways, but both long-time fans and newcomers to the series who choose to watch and playChains of Olympuscarefully may very well pick up clues as to the direction the franchise will be heading in withGod of War III.Regardless, whether you find yourself playing for the current chapter in Kratos? saga or preparing yourself for the battles to come on the PlayStation 3,God of War: Chains of Olympusis a must have title for any current owner of a PSP or those considering getting in the handheld game with one.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51x7abOLiHL._SY300_.jpg", "related": {"also_bought": ["B003L51GW2", "B002BS47WG", "B001KMRN0M", "B002BS47TE", "B0009WPZPY", "B0029ZUPYK", "B001COTC3E", "B000FYZS6M", "B000ASBKHE", "B000HKIPGE", "B0007TS24U", "B000N0WBJ0", "B000G79XQO", "B000E0OCR8", "B000059TMB", "B000UKQGA8", "B001GXI4LM", "B001TOQ8T8", "B0007V804U", "B002F87WEW", "B000R37S00", "B002BSC57U", "B0007V46JI", "B002I0GZ5Y", "B0007TFLLM", "B000HASW0I", "B003V3O4A0", "B0009XBXQ8", "B001HWF1OA", "B0050JN84Q", "B001TILU88", "B000E0OCQY", "B002DGNLFK", "B0014X7SQ6", "B002EQFXZA", "B000G79VKC", "B002CZ3SEQ", "B000H1R0D2", "B000F1YHW6", "B002EZH7T6", "B006JKARNU", "B0009350CQ", "B007M6W36Y", "B000F2DE8S", "B0015A8RQ8", "B0050JN7ZG", "B00168PFFK", "B000SSPH3E", "B002GEJYZA", "B0007VDF2C", "B00113X7YQ", "B000NPTOTK", "B00005A4X6", "B000AAZC08", "B00005A53C", "B007ZH9OFI", "B0009VRSS2", "B001N2EVPE", "B0007U0GUW", "B002SD94AY", "B000HNJ5WE", "B000GA75SY", "B0028A8PZM", "B00006FSLC", "B002I0GXWO", "B000A0XSOU", "B004F171W0", "B002P69VAC", "B000LEFKXC", "B000UHD85C", "B001TIFML4", "B0045U4U52", "B000HKMG14", "B000AM8RQM", "B00127VDWY", "B000FG65EY", "B002TK3GH8", "B0045SE9XC", "B004OP65CY", "B00005B5RQ", "B001TD6SN0", "B0010EF0UK", "B000CSUL18", "B000Q6ZLKM", "B0010YOQJG", "B008277M2M", "B004Z4ZJGC", "B00189JQS4", "B0019C6KAC", "B0028A8POI", "B001CB9VSS", "B003YVK5T8", "B0007UDYTW", "B000CBCVEK", "B002KQJNOQ", "B0000A3ZZF", "B003VMWR14", "B000FG65F8", "B000HKP7TW", "B000CBCVEA"], "bought_together": ["B003L51GW2", "B001KMRN0M"], "buy_after_viewing": ["B003L51GW2", "B002BS47WG", "B000ASBKHE", "B002BSC57U"]}, "salesRank": {"Video Games": 2314}, "categories": [["Video Games", "Sony PSP", "Games"]]}