{"asin": "B000BKJZ9Q", "description": "What if one device could help you navigate anywhere in the U.S. andCanada, while offering travel tips, storing your favorite tunes and photos, providing translation assistance, and more? That device is here, and it's not much bigger than a deck of cards. The Garmin n&uuml;vi 350 is set to revolutionize what we expect from a GPS navigation device, or from any device for that matter.Which n&uuml;vi is Best for You?:Click hereto see a quick, simple comparison of features for all Garmin nuvi GPS navigatorsThe n&uuml;vi 350 is a portable GPS navigator, traveler's reference, and digital entertainment system, all in one.View product demo (requires Flash).A simple touchscreen interface and voice guidance allow you to keep your eyes on the road.View larger.Listen to an audio book or an MP3 while you're on the road.View larger.DesignWith a total weight of 5.1 ounces and slim measurements of 3.87 x 2.91 x 0.87 inches (WxHxD), the n&uuml;vi 350 is just right for the pocket or purse. A bright, 64,000-color display dominates the front of the device and a resolution of 320 x 240 pixels means that there's plenty of room for displaying map data and other elements of the device's interface. An SD memory card slot is provided for expansion software, such as a points of interest database, media files and electronic guides (see below). The flip-up antenna includes an MCX-type connector for connecting the unit to an external GPS antenna. Meanwhile, a powerful built-in speaker resides on the back of device. A built-in lithium ion battery will give you for to eight hours of battery life, depending on use. In addition to an AC charger, the unit also ships with a 12-volt power adapter for vehicle charging, as well as a windshield suction cup mount.Fortunately, Garmin has made it easy to interface with the n&uuml;vi 350's 700 megabytes of onboard memory, thanks to \"plug-and-play\" USB mass storage support. Just plug the device into your computer's USB port and you've got instantaneous access to all the audio books, music, photos, supplemental maps and other data on the n&uuml;vi 350's internal and SD card memory.NavigationThe n&uuml;vi 350 is first and foremost a personal GPS device. Wherever you go -- in your car or on foot-- the device offers extremely accurate position data, thanks to a high-sensitivity integrated GPS receiver by SiRF and WAAS-enabled, 12-satellite reception. Combined with detailed maps of the U.S., Canada and Puerto Rico the n&uuml;vi 350 provides automatic routing, turn-by-turn voice directions, and touchscreen control-- making it easy to find your way anywhere. Plus, the unique \"text-to-speech\" feature calls out turns by street name, and you can choose from either 2D or 3D mapping perspectives when you're viewing your route on the display. Additionally, the n&uuml;vi 350 is compatible with Garmin's GTM 10 FM TMC traffic receiver*, which allows users to avoid traffic tie-ups by simply pushing a button that will calculate a new route.As mentioned, the n&uuml;vi 350 comes packed with mapping data for North America, but you can can also load up your custom points of interest. Set up proximity alerts for school zones, safety cameras, and more using Garmin's free POI (points of interest) loader program (available from garmin.com).Important note about map updates:Due to our high volume of sales, almost every Garmin portable GPS navigator sold by Amazon.com will come with the most recent map version. If you ever do need a map update, you can purchase one from Amazon.com at ourGarmin Store.The device automatically calculates the fastest route and provides voice-prompted turn-by-turn directions along the way.Tools for the JourneyNavigation is just part of the journey, and the n&uuml;vi 350 is one of the first devices to recognize that. The built-in \"Travel Kit\" offers an MP3 player, an audio book player from Audible.com, a jpeg-format picture viewer, a world travel clock with time zones, a currency converter, a measurement converter, and a calculator.In addition to the included travel tools, additional software add-ons are available, such as the Garmin Language Guide, with data provided by Oxford University Press. This software suite contains a multilingual word bank, phrase bank, and five bilingual dictionaries. The multilingual word bank and phrase bank supports nine languages and dialects, including American English, British English, French, German, Italian, Brazilian Portuguese, European Portuguese, European Spanish, and Latin American Spanish. Now you can look up and translate more than 17,000 words or 20,000 phrases per language -- right in the palm of your hand. Through the unit's text-to-speech interface, users can get a spoken pronunciation of each entry in the word bank, along with gender and part of speech information.Another useful add-on software package, the Garmin Travel Guide, is loaded with information provided by Marco Polo. These guides put in-depth travel information such as reviews and recommendations for restaurants, tourist attractions, and more at your fingertips. The software allows you to navigate to an address or search points of interest-- places like hotels, restaurants, shopping, and tourist attractions. The n&uuml;vi 350 automatically calculates the fastest route and provides voice-prompted turn-by-turn directions along the way. The unit also audibly announces the name of upcoming streets-- letting you keep your eyes on the road while navigating through busy traffic and tricky roadways. And if you stray off course, the n&uuml;vi 350 automatically calculates the quickest way to get back on track.*Traffic services available only in select cities where RDS-TMC coverage exists. Requires the GTM 10 FM TMC traffic receiver and subscription fee to enable traffic capability.What's in the Boxn&uuml;vi 350, Preloaded City Navigator NT for North America and Puerto Rico, Vehicle suction cup mount, AC charger, Vehicle power cable, Dashboard disc, USB cable, Carrying case, Quick reference guideWhich n&uuml;vi is Best for You?Note: All n&uuml;vis come with detailed NAVTEQ maps containing more than 6 million pre-loaded point of interest locations.", "title": "Garmin nuvi 350 3.5-Inch Portable GPS Navigator (Discontinued by Manufacturer)", "price": 159.99, "imUrl": "http://ecx.images-amazon.com/images/I/51FAMKYWE7L._SY300_.jpg", "related": {"also_bought": ["B001FL7QSW", "B00HQDJL72", "B004S5MY5W", "B000U0S304", "B000MAV14W", "B00B0L1GVU", "B00C20FV78", "B000F7857S", "B000OH63MI", "B002OL2MUY", "B009G1T7BW", "B000ZKUR1W", "B002IUG14O", "B003N2POXK"], "buy_after_viewing": ["B0057OCDQS", "B0057ODG6Y", "B004I5BUSO", "B002OL2MU4"]}, "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]]}