{"asin": "B000FII8KQ", "description": "Raise your fists and get ready to fight to the brutal finish. The battle comes alive with bone-jarring realism as you pummel your opponent and do your utmost to inflict maximum damage. Your fists are fast and your grip is strong, but will it be enough to help you dominate in the ultimate King of Iron Fist Tournament?Stunning GraphicsView larger.Bone Jarring PunchesView larger.Fight Online with FriendsView larger.SynopsisThe storied fighting franchise returns for another bout in Tekken 6. Select from an impressive roster of fighters, each with a signature set of deadly techniques, and unleash your most powerful and lightning-fast moves and combos to overcome your opponent. Customize your character to achieve unique advantages, and battle mano a mano as the King of Iron Fist Tournament comes to life around you in stunning high definition.Key Game Features:Select from among the largest character roster in the Tekken series, including familiar faces as well as brand-new fightersEmploy each character's unique techniques, moves and attack combinations to powerful effectExperience an array of gameplay modes, new features and new environments that heighten the fighting intensitySavor the realism of bone-jarring punches and gut-wrenching grapples as the fight comes to life around you in dazzling HDTake the fight online to engage in classic match-ups or compete for ultimate world dominationThe Story Continues:Following his victory in the previous tournament, Jin Kazama has taken charge of the Mishima Zaibatsu and now possesses tyrannical ambitions. Using his resources within the organization to become a global superpower, he severs the Mishima Zaibatsu's national ties and openly declares war against all nations. This action plunges the world into a chaotic spiral, with war erupting around the globe and even amidst the space colonies orbiting the planet. Kazuya Mishima, is aware of this and finds Jin's interference in his own plans for global domination to be a nuisance. Now in charge of G Corporation (which was put under his command following a violent fury against the company's heads), Kazuya is seen as the only force who could oppose Jin and places a bounty on Jin's head for anyone who can capture him. Jin's response is to announce The King of Iron Fist Tournament 6 in order to battle Kazuya and crush G Corporation.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/61OafPN3xGL._SY300_.jpg", "related": {"also_bought": ["B006ZTHFPS", "B002I0K6Q8", "B0017ZIIK6", "B006KYYOSO", "B0053OMTVQ", "B002I0K2EO", "B000ZK7ZMQ", "B0012N5MIO", "B006JKARN0", "B003O6KWZK", "B0050SWSQQ", "B0050SXLQC", "B002I0J5NI", "B008CP6MA2", "B002TDIEEK", "B0050SWZHS", "B002MED6EO", "B007H45AZ2", "B0088I7L76", "B000FPOJOS", "B0015AARJI", "B003R7H5TC", "B000HKP88C", "B00D4AK17A", "B007TYC8MI", "B003IEBO9Q", "B008MO6AQO", "B004X56PWK", "B002ZJNWWC", "B000IONGWW", "B004CVQUOI", "B0022TNO7I", "B003O6ECOM", "B0012N94WO", "B00BMFIXKQ", "B002I0J82G", "B004Z4ZKL6", "B007XYBUBE", "B003O6CBIG", "B007M6W3A0", "B00CD90R72", "B00CTKHZH0", "B005C7R950", "B009GZX49Y", "B0050SXKU4", "B000ZK9QCS", "B007YZ5QOO", "B007SRM5U6", "B0050SXFKE", "B00503E9FY", "B008XWCX6Q", "B0050SXVK8", "B00198AZ98", "B008E6ZXTA", "B004UDB9SA", "B002ELCV00", "B007MM9E2E", "B002BRZ744", "B002I0K4QU", "B00A750QIE", "B002NN7AKU", "B00C710AQO", "B001NX6GBK", "B0038MUCPK", "B00B59L9T6", "B0050SXX88", "B000MAFXU0", "B003VWGBCU", "B004M8M30G", "B004FUI84G", "B007CM0K86", "B001TORSHO", "B0050SXGU8", "B002DY9KHU", "B00D9IM0B2", "B008OQTR3S", "B002GJRQSC", "B000MUW98O", "B003HFC22Y", "B0045U01OG", "B00ENWZAHO", "B0085L2T0A", "B001CPBLLE", "B002I0K6DG", "B00CMC6HCY", "B0053BSOD6", "B001C4DKG4", "B002GJRQRS", "B003171CEW", "B0053BQU4G", "B0074LJ3CE", "B00269DX5W", "B00DWXV1B4", "B00EFFVZP0", "B00IA2NYT4", "B002I0J51U", "B002I0H2G0", "B00CRL9TU2", "B005UI9BT8", "B00BGA9V2Q"], "bought_together": ["B006ZTHFPS"], "buy_after_viewing": ["B006KYYOSO", "B006ZTHFPS", "B003O6CBIG", "B000ZK7ZMQ"]}, "salesRank": {"Video Games": 1667}, "categories": [["Video Games", "PlayStation 3", "Games"]]}