{"asin": "B00003OPES", "description": "The year is 2052 and the world is a dangerous and chaotic place. Terrorists operate openly, killing thousands; drugs, disease, and pollution kill even more. The world's economics are close to collapse, and the gap between the insanely wealthy and the desperately poor has grown to the size of the Grand Canyon. Worst of all, an ages-old conspiracy bent on world domination has decided that the time is right to emerge from the shadows and take control. No one believes the conspiracy exists--no one but you.In this thrilling role-playing adventure, you play the part of J.C. Denton, a powerful, nanotechnologically augmented antiterrorist agent. It's up to you to stop the conspirators from achieving their goals. But this world is full of lies and betrayal, a world where nothing is as it seems and entire nations can seemingly be turned against you at the push of a button. To succeed, you must travel the globe in a quest for knowledge, develop your character's nanotech augmentations and strengths as you see fit, build a network of allies to assist you, and determine when stealth and strategy are more important than action. And each time you think you've got the mystery solved, the game figured out, there's another, deeper mystery to be unraveled. You will never know whom to trust, who your friends are, who's in the conspiracy, and who's innocent. Maybe no one is.", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/51S2NX5DECL._SY300_.jpg", "related": {"also_bought": ["B002I0HKRQ", "B0011EA24I", "B00001KUII", "B00002EPZ2", "B0000CNUUP", "B00000K4AX", "B00009WDLD", "B001AH8YSW", "B001V9PTVE", "B001VJ4DHK", "B00002R28C", "B00006IR62", "B000PS2XES", "B00004KDF9", "B0001X5YN4", "B0000A1VER", "B000FGA1US", "B00004NS0Z", "B00140P9BA", "B00002SUOV", "B002I0JA7E", "B00001IVRD", "B002I0JIQW", "B000G77X34", "B00027CXEM", "B000UU5T7E", "B002I0KOSI", "B005G4CXPK", "B00006J3H0", "B00001YVIB", "B00007M9SI"], "bought_together": ["B002I0HKRQ"], "buy_after_viewing": ["B002I0HKRQ", "B002XTYK9S", "B002I0JA7E", "B005C2D2H4"]}, "salesRank": {"Video Games": 20801}, "categories": [["Video Games", "PC", "Games"]]}