{"asin": "B0023CC0M4", "description": "A single player action/adventure game,Mini Ninjasputs a new spin on the video game favorite, ninja action genre. A kid-friendly game featuring no killing and an engrossing storyline, which players explore via six playable ninja characters, players take on the role of Hiro and the fellow members of his improbable ninja clan as they face an ancient evil that has returned to impose itself on the world. Each ninja utilizes authentic ninja weapons and moves, and possesses his/her own individual skill set, including mysterious \"kuji magic\" abilities..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Authentic ninja weapons &amp; moves.View larger.Kuji magic abilities.View larger.Huge boss battle.View larger.StoryInMini Ninjasthe main character is the small ninja, Hiro. Although he has shown great promise, Hiro is the last ninja that anyone would expect to save the world, yet that is exactly what he is called to do when an evil samurai warlord hatches a plan bent on total world domination. In this plan the evil lord attempts to recapture the dominion he held prior to previously being cast out by creating an army of samurai slaves out of innocent animals. In the process of doing this he also upsets the natural balance of the the world, causing catastrophic storms. This the mini ninjas can not stand for. Armed with authentic ninja weapons and powerful spells, Hiro must rescue the fellow ninjas of his clan who the warlord has captured and then lead them on an exciting journey to battle the magical army of twisted Samurai.GameplayInMini Ninjasplayers have their choice of six playable ninja characters, although as the game begins you will be limited to the main character, Hiro, and his comrade, the slow, but strong un-ninja like Futo. As part of the revealing of the storyline, players are tasked with searching out Hiro's fellow ninjas, who at the beginning of the game were sent out to investigate troubles in the land, but never returned. They were captured by the evil warlord. As Hiro and Futo set each of these free, they in turn become playable characters. Each of the six playable characters has unique abilities, and utilizes a variety of ninja-specific weapons, items and moves, as well as \"Kuji Magic,\" which each--especially Hiro--can use to help them against enemies. These uses include classic mana-like blasts, but also more surprising and powerful forms such as the ability to take animal form in time of need.A New Kind of NinjaMini Ninjasis an action adventure game with a fresh take on the ninja fascination that has long been part of video games culture. Designed to be kid-friendly, although the game utilzes realistic ninja weapons and moves, there is no actual killing. Because the evil ninjas and other enemies that players face are actually animals captured by the evil warlord, when they are defeated they revert back to their original animal forms, correcting the imbalance that the plans of the samurai warlord have caused, and ensuring game suitability for all ages of players.Key Game Features6 playable Mini Ninjas, each with his own unique strengths and abilities.Authentic ninja weapons and moves.Kuji magic spells that help you control animals, enemies and the powers of nature.Versatile ninja hats that can be used as vehicles and shields.Huge boss battles.No killing &ndash; when an enemy is defeated, it&rsquo;s transformed into its original animal form.Beautiful, distinctive and original art-stylization.", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/51Jd8zE0fIL._SY300_.jpg", "related": {"also_bought": ["B003XJ35GG", "B005187540", "B0050SX3KG", "B002BRZ7JE", "B0050SXYIC", "B00JQHU9RC", "B00GY4OAIE", "B0037UCT7C", "B006ZPAYD2", "B008CP6RWU", "B00337KBUQ", "B006Y76JNU", "B004X56PWK", "B0036KRP5E", "B00104KJ4C", "B004OQNZY4", "B00B98HBTA", "B008BT2FEQ", "B002ELCUUG", "B000ZK9QC8", "B003LPCCSY", "B000R39GGE", "B007MZUFUG", "B004RIACMW", "B0088MVOUC", "B0038MUCPK", "B001PKHRSC", "B001PKHRXC", "B0050SX00Y", "B005EYG6I2", "B002BUEH2Y", "B0050SXUT0", "B005EW65ZS", "B0082SIBN0", "B001NQ7GH0", "B005EZ5GYQ", "B007XYBUBE", "B008J16AH4", "B00275A7LI", "B007MM9E2E", "B00CSLIYTI", "B005EW61MA", "B002I0J632", "B00ECOBFCC", "B003O6E620", "B005T5OBWY", "B003YF51RA", "B0035FYXSC", "B003S2MXNE", "B002I0K5RS", "B004M8M30G", "B00242KD8G", "B00CMD752O", "B0050SXU3Q", "B00DV16N6U", "B003S2OO40", "B00170823O", "B00AJGVIBA", "B004L5SJ58", "B004Q4PEFW", "B002E1R1TG", "B000QAUGH6", "B003O6HAS2", "0307465527", "B00G9DFMDW", "B001NJ28SO", "B0050SWNZW", "B002WDL516", "B0053BQJVA", "B000UC5ML0", "B000NJFMFQ", "B004LM37FI", "B003O680RM", "B001811BTO", "B00FRESXSA", "B002EZH804", "B00BXTKJ94", "B00CBVHIA6", "B0050SXI6K", "B001ASJIS6", "B0054INKOG", "B004I90F0E", "B002I0J4AM", "B003O6E2TM", "B000ZK7ZK8", "B0052VPC5U", "B007A7UJ4S", "B003BE6OYS", "B00149ND28", "B0017ZIIK6", "B00EPFEUKM"], "bought_together": ["B003XJ35GG", "B004X56PWK"], "buy_after_viewing": ["B005187540", "B0038MUCPK", "B0050SX00Y", "B00BXTKJ94"]}, "salesRank": {"Video Games": 16038}, "categories": [["Video Games", "Kids & Family", "PlayStation 3", "Games"], ["Video Games", "PlayStation 3", "Games"]]}