{"asin": "B000UZCR56", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Modems"]], "description": "Introducing the new AirPort Extreme Base Station, the perfect wireless solution for home, school, and business. As it blankets your space with a blazing-fast, secure wireless network, it opens up a world of possibilities for home entertainment, backups, printing, and more.With the new AirPort Extreme Base Station, you and up to 50 of your friends, colleagues, or family members can enjoy a robust wireless network offering up to five times the performance and up to twice the range of networks created with the earlier 802.11g standard.Easy as a Mac.Setting up a network should be as easy as setting up a Mac. And it is--if you&rsquo;re using a new AirPort Extreme, which features a completely redesigned setup utility. Just take the AirPort Extreme out of the box. Plug it in. Install the software, and in five minutes or less, you&rsquo;re good to go.Surf the web, chat, send email, or exchange photos from any computer or from your iPhone. Print or access a shared hard drive--wirelessly. Set limits for when your kids can access the Internet. Secure your network with a firewall and strong encryption. Even use AirPort Extreme as the perfect companion to Apple TV.Superfast, supercompatible.The AirPort Extreme Base Station features 802.11n,2 the next-generation high-speed wireless technology included with most shipping Mac computers and some newer PCs with compatible cards. The AirPort Extreme is also Wi-Fi Certified to work with the 802.11a, 802.11b, and 802.11g wireless standards--which means the systems you&rsquo;re already using will work seamlessly with the new base station.Elegantly simple.Just 6.5 inches square and 1.3 inches tall, the new AirPort Extreme features a simple, elegant design that will fit almost anywhere--your desk, a table, a bookshelf, or any flat surface.What's in the box:Airport Extreme Base Station, AirPort Utility for Mac and Windows, AirPort Disk Utility for Mac and Windows, 802.11n Enabler for Mac, Bonjour for Windows, power cord, printed and electronic documentation.", "title": "Apple AirPort Extreme Base Station MB053LL/A [OLD VERSION]", "price": 189.95, "salesRank": {"Electronics": 6224}, "imUrl": "http://ecx.images-amazon.com/images/I/21ow7WV-8VL._SX300_.jpg", "related": {"also_bought": ["B008ALA2RC", "B002TLTG9E", "B0002GDIII", "B00DB9WCR6", "B003FPD3IS", "B000BQYM0W", "B00AAQ3JE8"], "bought_together": ["B008ALA2RC"], "buy_after_viewing": ["B00DB9WCR6", "B008ALA2RC", "B001UE8LRY", "B002TLTG9E"]}}