{"asin": "B00794RDVY", "related": {"also_bought": ["B00CQJUT9U", "B00JFSOXTC", "B005KN1YV6", "B00E98O7GC", "B001FWYGJS", "B003MTTJOY", "B000084F80", "B000HLZXH2", "B008IFXQFU", "B001EVGIYG", "B00DJUU0KS", "B00A3NCC5K", "B00IIVH2AE", "B0051TPJKG", "B0063GKG6I", "B00C4PLQAM", "B000V0DY7U", "B008KVUAGU", "B004UBU8IE", "B00GAKX34E", "B00DUGZFA6", "B000FNFSPY", "B0081F2Z40", "B00393KNVQ", "B00H33SFJU", "B0006NGZK0", "B00FDUHDAC", "B00416Q5KI", "B00CXLCMGY", "B0097LG9U8", "B00837ZGRY", "B00C9TECFO", "B00DR0PDNE", "B00D6OHHEE", "B00HPMCO6O"], "bought_together": ["B00E98O7GC", "B001FWYGJS"], "buy_after_viewing": ["B00E98O7GC", "B00JFSOXTC", "B00C4PLQAM", "B0077BB3VA"]}, "title": "Edimax EW-7438RPn V2 300Mbps 802.11/b/g/n Universal Wi-Fi Range Extender, Repeater, Wireless Bridge, Access Point, Wall Plug design, Smart LED Signal Indicator, Easy iQSetup by Smartphone, No CD Required", "price": 21.95, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31jhfy1gfNL._SY300_.jpg", "brand": "Edimax", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Repeaters"]], "description": "From the manufacturer:The Edimax EW-7438RPn V2 N300 Universal  Smart Wi-Fi Extender is a Wi-Fi extender with built-in power adapter in a  compact design which can be plugged directly into an electrical outlet.  Convenient placement allows you to double the signal coverage of your  Wi-Fi network for better Wi-Fi quality in homes with many rooms or  multiple floors. Featuring smart iQ Setup, installation is quick and  easy and the EW-7438RPn V2 features 3-in-1 Wi-Fi extender, access point  or bridge operating modes. Just configure the mode you need for your  network environment. Additionally, it complies with wireless 802.11b/g/n  standards and provides data transmission rates of up to 300Mbps. With  the Edimax EW-7438RPn V2, you can enjoy high-speed wireless networking  throughout your home without additional cabling.Eliminate Wi-Fi Dead ZonesExtend  Wi-Fi coverage to dead zones which your existing Wi-Fi signal can&rsquo;t  reach. Plug the extender directly into an electrical outlet and the  Edimax EW-7438RPn V2 can easily double the signal coverage of your Wi-Fi  network for better Wi-Fi quality in homes with many rooms or multiple  floors.Works With Any Wireless RouterUniversal compatibility and easy web-based iQ Setup for quick and easy installation.Smart 3-in-1 Extender, Access Point And BridgeThe  EW-7438RPn V2 can work as Wi-Fi extender, access point or wireless  bridge. Just configure the mode you need for your network environment  using the smart iQ Setup wizard and enjoy surfing the web.Wireless 802.11n Standard (Data Rates Up To 300Mbps)802.11n  technology is built into the EW-7438RPn V2 to broaden its wireless  coverage and eliminate dead spots within wireless range. The EW-7438RPn  V2 is also backward compatible with wireless 802.11b/g/n standards and  can reach data transmission rates of up to 300Mbps when connected to  wireless 802.11n devices."}