{"asin": "B002UKSZUU", "categories": [["Electronics", "Accessories & Supplies"]], "description": "Spin-Clean Record Washer System Starter Kit The Least Expensive Record Cleaning Machine We've Ever Offered The Spin-Clean gets records clean, is easy to use and doesn't cost a fortune. Spin-Clean also takes the effort out of cleaning records, the brushes scrub both sides of the record simultaneously, rollers in the tank keep records safe from damage and the fluid pulls dirt off the record and down to the bottom of the tank. Quick, easy and reasonably priced, now there's no reason not to clean every record in your collection. The Record Washer System is available two ways, as a Starter Kit and as a Complete System Kit. \"Meet my new best friend, the Spin Clean Record Washing System. The results speak for themselves-less noise means more resolved music. Cleaner surfaces means a gain in perceived dynamic range. Spin Clean just announced a new MK II version. No doubt a great device made even better!\" - Neil Gader, The Absolute Sound \"It's cheap and it really, really works...I cleaned some dirty, fingerprint-encrusted records, and when I removed them from the vat, all dirt and fingerprints were gone... not everyone wants to spend hundreds of bucks on a vacuum machine, and the Spin-Clean got the job done!\" - Michael Fremer, Stereophile Spin-Clean comes with everything needed to get started: Record Washer 4 Oz Wash Fluid (Cleans up to 400 records!) 1 pair of Washer Brushes 1 pair of Washer Rollers 1 pair of Drying Cloths Easy To Follow Instructions (printed in the lid, so you can't lose them!) How To Use Spin-Clean Simply mix a few capfulls of Spin-Clean Wash Fluid solution with water in the tank. Rotate the record slowly through the solution as the record brushes on either side scrub the record clean. Remove the record, place on a drying cloth and wipe dry with another drying cloth. 15 Reasons To Buy A Spin-Clean Record Washing System Spin-Clean is the only record washing system on the market that is a \"bath type\" complete", "title": "SPIN-CLEAN - STARTER KIT RECORD WASHER SYSTEM Mk2", "price": 79.99, "imUrl": "http://ecx.images-amazon.com/images/I/51tIhDTsASL._SY300_.jpg", "brand": "SPIN CLEAN", "related": {"also_bought": ["B003U7ZY9M", "B003K1FTFM", "B0006VMBHI", "B001LQSFKY", "B00006I5SD", "B003K1UZLK", "B000RA7IZS", "B002S1CJ2Q", "B007XTE6YW", "B00B1V2FA0", "B00B1WRFV8", "B003L9HDHU", "B003NG2WIG", "B00B1VB0G0", "B001A9ST2G", "B003O586Z4", "B00006I5SB", "B008AZY5JY", "B00E7MVP3S", "B003K1L7QW", "B00K7FX5EG", "B00D8DYQM4", "B005KR15HU", "B004MJ0OEW", "B003EH1FH8", "B000V4URJ4", "B0048XFL18", "B00DVQFECE", "B004MG9YYQ", "B004MM5YIU", "B001716LMM", "B000RA4HXE", "B000KMZKTO", "B000V4OSMQ", "B0055J0CRC", "B000V4I2D2", "B000RA6IJK", "B00B1UML82", "B00BSP48HC", "B003DX0S2Q", "B003L0C5HC", "B000003N7F", "B00CMRW2XW", "B0097CY4NQ", "B001719IXG", "B000002ADT", "B0002D036Q", "B00BD60BI6", "B000AJR482", "B00CTSY8C2", "B004JO79RK", "B0009LAYSI", "B006W3VHPQ", "B00B1WFFTW", "B0000DHVOJ", "B008M9OOJ4", "B000I1YLG0", "B003XX91V0", "B0019H58GY", "B0033SHDSS", "B000246SZK", "B00006HO3L", "B00B2AURQO", "B000YEK1AQ", "B000V4NC6O", "B00GA9COMM", "B006VX1W5M", "B002E2M3KM", "B001707XIO", "B001GVJ9XG", "B002TD4GME", "B007A0CYCK", "B0080D9WJY", "B00IXHBL7I", "B004TUX1C6", "B004NRVUMI", "B0096QYWZI", "B00BSP498K", "B00175Z7P0", "B00AR0VCXW", "B009I760FA", "B008OAMD26", "B001REZMG0", "B000RL2208", "B00DHOLLSG", "B00IXHBS6M", "B0033AGPEY", "B000000I2N", "B000O1APF0", "B00005YW4H", "B003DY5Q4K", "B0079OA0UU", "B001FES0IE", "B007R9B0UQ", "B0041KVZ1I", "B000BBGCCI", "B001MM797M", "B0000669JL"], "bought_together": ["B0006VMBHI", "B001LQSFKY"], "buy_after_viewing": ["B0006VMBHI", "B0045ZEU52", "B000KMZKTO", "B001LQSFKY"]}}