{"asin": "B006WQBZ96", "categories": [["Beauty", "Skin Care", "Face", "Creams & Moisturizers", "Day Creams"]], "description": "Anti-sagging + anti-age spot hydrating moisturizer. Rebuilds skin's substance with soy seed proteins. Why is Age Perfect right for me? Starting with menopause, skin loses up to 30% of its own substance due to hormonal changes, reducing skin's underlying cushion and support skin experiences significant changes such as deep dryness, sagging due to a loss of resilience, and an increase in the appearance of age spots. The Innovation: Soy Seed Proteins stimulate the synthesis of natural fibers found in younger skin (based on increased collagen production during in-vitro testing on soy seed proteins). L'Oreal Research has developed a breakthrough complex containing Soy Seed Proteins to help menopausal and post-menopausal skin rebuild its own substance. Intensive Action: Anti-Sagging Action: With Soy Seed Proteins to help skin rebuild its own substance to improve elasticity for more toned, supple and resilient skin. Anti-Age Spot Action: With a Beta Hydroxy Acid (BHA) complex to help reduce the appearance of age spots, while Broad Spectrum SPF15 Sunscreen helps protect skin from future sun damage. Deep Hydration: Provides 24-hour hydration and soothes increased dryness seen in menopausal and post-menopausal skin. See Visible Results: Day after day, skin becomes more resilient and radiant while its youthful cushion is restored. Immediately: 94% saw more hydrated skin (based on consumer evaluations). In 4 Weeks: 85% saw firmer skin (based on consumer evaluations). Smoothes and reduces the appearance of surface wrinkles and fine lines (based on consumer evaluations). In 8 Weeks: Age spots were visibly reduced (based on consumer evaluations). Formula Essentials: UVA/UVB SPF 15 Sunscreen; Non-greasy; Dermatologist tested; Non-comedogenic.", "title": "L'Oreal Paris, Age Perfect Day Cream for Mature Skin with Soy Seed Proteins, SPF 15, 2.5-Ounce", "price": 54.25, "salesRank": {"Health & Personal Care": 238102}, "imUrl": "http://ecx.images-amazon.com/images/I/51ufM8LVVLL._SY300_.jpg", "related": {"also_bought": ["B006WQBZCS", "B006WQC0BI", "B004YWRYUY", "B001EUS8G8", "B0055S4BZ2", "B00EIMH78E", "B002JDUMFO", "B005H1541C", "B006WQC022", "B0047F9622", "B00D8FK9F0", "B0072CV0UI", "B0075HE6B0"], "also_viewed": ["B006WQC0BI", "B004YWRYUY", "B00EIMH78E", "B006WQBZCS", "B0055S4CRY", "B0072CV0UI", "B002PBHQP4", "B002JDUMFO", "B006WQC022", "B00LDY8TU0", "B006WQC0N6", "B005H1541C", "B00ECU0A18", "B0055S4BZ2", "B0075HE6B0", "B00D8F8B5A", "B00BI1MQ7U", "B008EKY8VK", "B00D8FK9F0", "B0089MUX80", "B001DO3CVG", "B005H1525A", "B00C9EKOHY", "B0047F9622", "B00E5IMJL6", "B000KONYD6", "B0047F71SS", "B00C2WMLFG", "B00EN2T3XG", "B00HZK1IOK", "B000KOHRX4", "B0055S4DCI", "B0084FDSN4", "B00EZWRTYO", "B00AQX87M4", "B00CER15NI", "B00139Y6D4", "B0088W887Y", "B0014ZWHZQ", "B008CT12G2", "B005F5J5KQ", "B00DQSVXLI", "B004EFABJC", "B00BFBMSS0", "B000KOLXBQ", "B00D5ETV08", "B00ANL99NK", "B0047F708O", "B0088W8RMU", "B0039LMTBA", "B004AS6GGU", "B00H83298S", "B000XVTYYY", "B00JQVU8LK", "B0047F70B6"], "bought_together": ["B006WQBZCS"]}}