{"asin": "B001NPEB5Q", "description": "Automatically back up and protect your digital memories, centralize your media and content for sharing with friends and family, and enjoy your digital media while at home or away with the HP EX485 MediaSmart Home Server. Based on the Microsoft Windows Home Server platform, this sleek, quiet server is ideal if you have multiple PCs on a home network, or want the flexibility to enjoy your digital experiences from anywhere over the Internet. And it's easy to set up--just plug it in, connect it to your wireless router (sold separately), and load the software onto your PCs and Macs.The HP EX485 makes backing up your home's PCs and streaming media a breeze, and it comes with 750 GB of storage.Centralize your iTunes music libraries on the MediaSmart Server for playback to any networked Mac or PC running iTunes. The HP Media Collector conveniently schedules the MediaSmart Server to copy and centralize digital files and libraries from networked PCs. The pre-installed HP Photo Publisher software enables you to easily upload photos to Facebook, Flickr, Picasa Web Albums and Snapfish. and the MediaSmart Server provides peace of mind with effortless backups of your Windows-based PCs via the Windows Home Server backup feature and Macs running Leopard using Apple Time Machine software.The EX485 MediaSmart comes with 750 GB of storage right out of the box and four drive bays that allow you to add optional off-the-shelf SATA I or II hard drives--up to a maximum capacity of 9 TB (terabytes). Additionally, the MediaSmart includes four USB 2.0 ports and one eSATA port for connecting an attached external hard drive, and it provides capabilities for offsite backup via automatic upload to Amazon's S3 service.The sleek, streamlined micro-tower design is perfect for use in the home office or the living room, with perforated steel exterior panels that provide cool, quiet operation. A Sleep Mode conserves energy and saves you money in more ways than one. The built-in sleep mode consumes only 1W of power, and the server can take on many of your PC's responsibilities, enabling you to turn off your individual computers to further save energy and money.Software FeaturesOperating System: Powered by Windows Home Server, a new software solution from Microsoft for storing, accessing, sharing and automatically protecting digital files.HP Control Center: The HP MediaSmart software that sits on top of the Windows Home Server software making access to tasks easier. Users with administrative access privileges can access the Windows Home Server Console from the HP Control Center.Windows Home Server Console: Software accessed from the HP Control Center to manage your HP MediaSmart Server. Software includes setting up shared folders, assigning user access privileges and customizing backups.File Sharing and Storage: Effortlessly centralize your files and access them from any PC and or Mac on your home network.PC Hard Drive Disk Backup: Once the HP MediaSmart Server software is installed on a home PC, the Windows Home Server backup software automatically starts backing up the PCs hard disk drive image every night. You can customize the number and frequency of backups kept.Mac Backup: Back up your Macs to the MediaSmart Server using Apple's Time Machine software.Shared Folder Duplication: Designate folders that will be copied automatically onto multiple hard drives for an additional layer of redundant protection. Folder duplication replaces traditional RAID-style redundancy.Individual File Restore: If you accidentally delete a file on your PC, you can browse versions of the PC hard drive backup image on the HP MediaSmart Server to find the file and copy it to your PC.PC Hard Drive Disk Restore: In the event of a PC hard drive failure, the included HP PC Restore disc is all you need to restore a hard drive image from the HP MediaSmart Server. Theres no need to locate your original operating system disc.HP Media Collector: Conveniently schedules the server to copy and centralize your Windows PC media files and libraries (including iTunes and playlists).Remote Access: Upon installation, you can set up a personal web address to be used for remote access and by visitors. Using your personal web address, you can remotely access shared folders and files on the HP MediaSmart Server from any Internet-connected computer.In-Home and Remote Media Streaming: Extend your digital media experiences by conveniently streaming photos, music and videos to your TVs, through gaming consoles such as Xbox 360 or PlayStation3, and computer's within your home. Remotely stream music and photos from your server to any Internet-connected computer for access while you are away.HP Photo Publisher: Easily publish your photos to Snapfish, Facebook, Flickr, and Picasa Web Albums using an Internet-connected computer.HP Photo Viewer: Quickly share photos and albums stored on the Server with friends and family.Server for iTunes: Centralize your iTunes music libraries and playlists on the server for playback to any PC or Mac running iTunes on your home network.Satisfy all your backup and media storage needs with four internal hard drive bays, four USB 2.0 ports, one eSATA port, and access to Amazon S3 online backup.Easy Storage Expansion: Add an internal or external hard drive to the HP MediaSmart Server, indicate that you want to add the disk in the Windows Home Server Console, and the HP MediaSmart Server storage grows. No need to power down the unit or manage drive letters for multiple hard drives.Server Anti-Virus Protection: Server side anti-virus trial offer from McAfee for increased protection of your HP MediaSmart Server. Run quick scans of specific folders or deep scans across your entire home server.Server Backup: Protect your digital memories from fire/flood/natural disaster... backup your server shared folders to an external hard disk drive, and/or an online backup to Amazon S3.Server Recovery: The included Server Recovery Disc can be used to recover all data and restore folders or, to reset the server in case the server operating system disk becomes corrupt.Additional Software Add-Ins: Extend the functionality of your server through available software add-ins to enable expanded functionality, server personalization and/or entertainment.Users: Up to 10 user accounts can access the HP MediaSmart Server. In addition, a predefined Guest account can be enabled.PC Operating System SupportAutomatic backup of computers running Microsoft Windows Vista (32 & 64 bit), XP Home (SP2), XP Professional (SP2), Media Center Edition 2004 (SP2) or later, and Macs running ApplesTime Machine.File sharing for computers running Microsoft Windows Vista (32 & 64 bit), XP Home (SP2) or XP Professional (SP2), Media Center Edition 2004 (SP2) or later, Mac OS X, or Linux.Remote access to computers running Microsoft Windows XP Professional (SP2), Media Center Edition 2005 (SP2), or Vista Ultimate.Hardware SpecificationsInternal Hard Drive(s): One 750 GB drive (SATA, 7200 RPM)Internal Expansion: Four hard drive bays (additional off the shelf SATA I or II hard drives can be added; no tools required)External Expansion: Four USB 2.0 ports (1 front, 3 back); one eSATA port (back)Processor: Intel Celeron 2.0 GHZ 64-bit ProcessorMemory: 2 GB of DDR2 DRAM (800 MHz)Network Support: 10/100/1000 (Gigabit) RJ45 Ethernet; supports both wired and wireless PCs (via a wireless router).Power: Internal universal power supplyDimensions: 5.5 x 9.8 x 9.2 inches (WxHxD)What's in the BoxHP EX485 MediaSmart Home Server, power cable, Ethernet cable (RJ45), PC restore disc, server recovery disc, software installation disc, printed documentation. The MediaSmart Server is backed by a one-year limited warranty and dedicated software technical support both online and by phone.", "title": "HP EX485 MediaSmart Home Server", "price": 98.95, "imUrl": "http://ecx.images-amazon.com/images/I/51ijc8kLv5L._SY300_.jpg", "related": {"also_viewed": ["B005KKJPCO", "B00307EL8M", "B007JLDTRY", "B0050TVAWS", "B001AHLODY", "B00AKWUZ58", "B00DDXS936", "B00FE29IWK", "B00F6EK9J2", "B00GAIBC0I", "B00G4JZ2T0", "B004UBU3SY", "B003X26VV4", "B00BNI4CVG", "B009XOVKEY", "B003KTN672", "B00GJYNLKM", "B00IU0R23K", "B00DW1W6N8", "B00DW1UNS8", "B00DDXSKTY", "B0085RO8U8", "B005INAIOW", "B00CRB9CK4", "B00FJF4S22", "B00I2P82CS", "B006C6E318", "B00EJ3H95I", "B00G4JZ30S", "B00FJF4UAW", "B00DW1VJVI", "B00BNI4EYG", "B00BNI4DR4", "B00FE2G79C", "B00G4JZ42A", "B005TJLU24", "B008U69LC4", "B007JLE84C", "B00G4JZ2WC", "B005INAIRY", "B00EVVGAD0", "B00BO0MG02", "B0040NPGP2", "B00I2P56FE", "B0047WHUMS", "B00I2P53NY", "B00B5Q7B78", "B0096YOQTM", "B00DR7END8"], "buy_after_viewing": ["B008JJLZ7G", "B00EHBERSE", "B0088PUEPK", "B00EVVGAC6"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "Network Attached Storage"]]}