{"asin": "B0041D8G4O", "categories": [["Electronics", "Camera & Photo", "Lenses", "Camera Lenses", "Compact System Camera Lenses"]], "description": "The Composer with Tilt Transformer is the newest addition to the Lensbaby Creative Effects camera products line-up for Panasonic Lumix G Micro System and Olympus PEN digital cameras.Two products in one, the Composer with Tilt Transformer allows photographers to mount any Nikon mount lens to their Micro Four Thirds interchangeable lens digital camera (a separate model will also be available for Sony Alpha NEX cameras) and tilt up to an unprecedented 12.9 degrees, delivering photos that have a slice of focus through the image, bordered by a soft blur.The Tilt Transformer provides the foundation for the Composer Front Focus. When used together, they become the Composer with Tilt Transformer, for use on Micro Four Thirds or Sony Alpha NEX cameras. This provides photographers with access to the limitless creativity offered by the Lensbaby Optic Swap system.The Lensbaby Composer is a manual focus lens based on a ball and socket configuration that delivers smooth selective focus and other creative photography looks with unparalleled ease. Photographers can simply tilt the lens to a desired angle and then focus with a manual focusing ring. The Composer stays in the desired bent position without requiring a locking mechanism.The Composer with Tilt  Transformer is compatible with the Lensbaby Optic Swap System* and ships  with a Double Glass Optic installed. Additional optics can be swapped  in and out, providing photographers with a wide range of creative  effects including: Single Glass, Plastic, Pinhole/Zone Plate, Soft  Focus, as well as  Fisheye**, Sweet 35** and Edge 80**.*Includes an  optical adapter that allows Lensbaby Double Glass, Single Glass,  Plastic, Pinhole/Zone Plate and Soft Focus optics to focus to infinity  when used with the Micro 4/3rds Composer. As Micro 4/3rds cameras do not  have an internal mirror, the lens is closer to the sensor than with SLR  cameras, requiring this optical adapter.**With the Fisheye, Sweet  35 and Edge 80 Optics, attach the Lensbaby Macro Convertors as an  extension tube to maintain focal length. The Lensbaby Macro Convertors  will be sold separately.Tilt Transformer Specs and FeaturesCompatible with Panasonic Lumix G Micro Series and Olympus PEN cameras.The Tilt Transformer is compatible with any Nikon mount lens.When used with a Nikon mount lens, produces a slice of focus through the image instead of the classic Lensbaby Sweet Spot of focus.Width of focus slice is dependent upon aperture--f/1.4 will produce a very thin slice of focus with abundant blur, while f/22 will produce a very wide slice of focus with just a tiny bit of blur. Extreme tilt at a very bright aperture will make that slice appear even thinner.Tilts up to 12.9 degrees offering up to twice the tilt range as typical tilt-shift lensesOffers the unique optical feature of more extreme blur falling off of a very thin slice of selective focus, as compared to the usual slice of focus width and focus fall-off of a typical tilt-shift lensBuilt-in mechanism allows Nikon G lenses to function properly at all apertures. Nikon G lenses do not have an aperture ring on the lens itself. This mechanism allows the aperture to open and close by manually rotating the lens itself.High quality metal swivel ball for smooth, fluid tiltEasy grip, metal locking ring controls ease of adjusting tiltAll metal, precision constructionComposer Focus Front Specs and FeaturesAll of the Tilt Transformer Specs and Features, plus the following:Ships with the Double Glass Optic and optical adapter installed which includes: f/1.8, f/2.8, f/4, f/5.6, f/8, f/13, f/22Supports the Lensbaby Optic Swap System, allowing photographers to swap out the Double Glass Optic and swap in Single Glass, Plastic, Pinhole/Zone PlateOptical adapter reduces actual focal length of above lenses to ~40mm (~80mm effective focal length)With an extension tube to maintain proper focus and image quality, the Soft Focus, and Fisheye become compatible and the Double Glass Optic and swap in Single Glass, Plastic, Pinhole/Zone Plate become ~50mm telephoto lenses (~100mm effective focal length)Focus Type: ManualAperture Type: Interchangeable levitating aperture disksMinimum Focus: approximately 12in. (30 cm) / Maximum Focus: Infinity (and beyond)Recommended Accessories for use with the Tilt TransformerAny Nikon mount lensHow Does it Work?Recommended Lensbaby Accessories for use with the Composer Focus FrontLensbaby Double Glass Optic*Lensbaby Single Glass Optic*Lensbaby Plastic Optic*Lensbaby Pinhole/Zone Plate Optic*Lensbaby Soft Focus Optic (LBOSOFT)**Lensbaby Fisheye Optic (LBOFE)**Lensbaby Creative Aperture Kit (LBCAK)Lensbaby Creative Aperture Kit Blanks (LBDAK)Lensbaby 0.42 Super Wide Accessory Lens (AWA42)Lensbaby Step-Up/Shade (LBASTEP)Lensbaby Macro Kit (RAMACK)*Includes an optical adaptor that allows Lensbaby Double Glass, Single Glass, Plastic and Pinhole/Zone Plate optics to focus to infinity when used with the Micro 4/3rds Composer. As Micro 4/3rds cameras do not have an internal mirror, the lens is closer to the sensor than with SLR cameras, requiring this optical adaptor.**With the Fisheye and Soft Focus Optics, attach an extension tube to maintain focal length. This extension tube will be sold separately.Sample image taken with a Nikon 25mm lens.Box ContentsComposer with Tilt TransformerOptical AdapterMicrofiber clothUser guide", "title": "Lensbaby Composer for Micro Four Thirds Digital Cameras with Tilt Transformer", "price": 7.97, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/4131hmSNtML._SY300_.jpg", "related": {"also_bought": ["B001GCUCCC", "B005TOU804", "B00CI3R53W", "B004DOUOI2", "B0096WDK0K"], "buy_after_viewing": ["B0054EPPZM", "B009DL0LOW", "B0043VE29C", "B003VNKNF0"]}}