{"asin": "B0011FQURK", "description": "Trying to enjoy film, TV, gaming, and music on your PC? Tired of mediocre PC   audio? The Logitech Z Cinema Advanced Surround Sound System accurately   reproduces dialogue, film soundtracks, explosive gaming audio, and subtle ambient   sound.SRS&reg; TruSurround HD&trade; delivers an immersive surround-sound experience with just   two satellite speakers and a subwoofer.&nbsp;PerformanceSurround sound without rear speakers: Experience surround   sound with only two satellite speakers and subwoofer. SRS&reg; TruSurround HD&trade; puts   you in the middle of a broad sweet spot, creating an immersive sound experience.   Dialog enhancement in the center channel ensures clear and intelligible voice   reproduction.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;High-performance audio: Unique tri-amplification design and   digital crossover EQ provide greater accuracy and a more natural, balanced   response. Two-way satellite speakers deliver incredible frequency response,   detail and clarity. An 8-inch long-throw subwoofer with flared bass port gives   you powerful, distortion-free bass.Pure digital fidelity: USB transports both audio and data   for simple, hassle-free installation and true 24-bit digital quality audio.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ConvenienceMultiple input and output options: Includes a headphone   jack for private listening and an input jack for connecting an MP3 player or   other audio sources.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Powerful Media Center remote control: An advanced remote   turns your PC into an entertainment center. Take full control of Windows&reg; Media   Center and easily manage digital media&mdash;including Internet radio and   playlists&mdash;with your other media applications.&nbsp;System RequirementsWindows&reg; XP Media Center Edition, Windows Vista&reg; Home Premium Edition, or   Windows Vista&reg; Ultimate EditionUSB portCD-ROM drive256 MB RAM20 MB available hard disk spaceTechnical SpecificationsTotal power: 180 watts RMSSubwoofer: 110 watts RMS (into 4 ohms, @   45Hz)Midwoofer: 26 watts RMS x 2 (into 4 ohms, @ 335Hz)Tweeter: 9   watts RMS x 2 (into 16 ohms, @ 17.4khz)Speaker dimensions: (H x W x D, mm)Satellites: 250.4 mm x 115 mm x   112.4 mmSubwoofer: 292.4 mm x 290.6 mm x 413.9 mmNote: Windows&reg; Media Center required for full functionality.Package ContentsSpeakers: 2 satellites, 1 subwooferWireless remote control (batteries included)Cables (each 6-foot): USB cable, AC power cableCD-ROM with Logitech&reg; Z Cin&eacute;ma softwareUser&rsquo;s guide2-year limited hardware warranty", "title": "Logitech Z Cin&eacute;ma Advanced Surround Sound System--2.1 Speakers", "price": 118.99, "imUrl": "http://ecx.images-amazon.com/images/I/41W0rKfrBGL._SY300_.jpg", "related": {"also_viewed": ["B003VAHYTG", "B000AM6QHO", "B0002SQ2P2", "B0002SQ0AE", "B000AM6QHE", "B004M18O60", "B0002WPSBC", "B008X1BVH4", "B002IJ95ZM", "B0002WPSCG", "B009T9YW02", "B0025VKUR0", "B00031S4KO", "B000JJM8XE", "B002VK7L04", "B000062VUO", "B004H0MQYW", "B00B40CYL8", "B00BJE3WEW", "B003UPJXIC", "B00K5NYNWS", "B009T9YU4K", "B003VAK1FA", "B001F51G0W", "B00HA26HVW", "B002BA5JLW", "B002FU5QMK", "B000IE8Z4Q", "B004CCINMY", "B009P8O3II", "B00GNHPFRW", "B00EVWXAEQ", "B00C5OSGTQ", "B001S10DDO", "B0000C20V3", "B0039NM530", "B0029Z9UNW", "B00BPBFAQW", "B0085VB8GQ", "B0030ZLZ5G", "B0074LEP9K", "B0039NM52Q", "B0027VT6V4", "B007TSRCZM", "B0042F3K9W", "B001S14DYO", "B00B3ZNMYC", "B00064X4QM", "B00556TKRI", "B00EVWX8R0", "B002FU5QM0", "B0068R2IOU"], "buy_after_viewing": ["B003VAHYTG", "B00HA26HVW", "B003VAK1FA", "B000062VUO"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]]}