{"asin": "B0038KY38Y", "description": "Great video and voice foryour travels.ProductInformationThe Creative Live! Cam Notebook Pro VF0400 is a pact and sleekwebcam that captures stills of up to 1.3 megapixels. &nbsp;With abuilt-in microphone and a 800 x 600 video resolution you can startvideo conversations with anyone right away without any hassle.&nbsp;The 240&#xB0; swivel design lets you capture stills upright nomatter how you mount or twist the Live! Cam. &nbsp;Add fun to yourvideo chat with voice and doodling effects from the includedsoftware&nbsp;enhance your instant messenging experience andprotect kids with parental controls all with this pact webcam.Product Highlights Enjoy Smooth Vibrant Video - Look yourbest even in dim light as Live! View technology automatically selectsthe ideal camera settings for lighting and brightness. Voice Chat Without Headset Wires -Adding voice munications to your video IM is easy with thehigh-quality built-in microphone. Add Cool Video and Voice Effects -Choose your background doodle directly on your video or change yourvoice to keep your friends entertained. &nbsp;Advanced Video FXincludes exciting backdrops face morphs and more. Keep Your Kids Safe - Simply set apassword to keep your children from using the camera when you aren'taroundProduct Features Rotates and auto-flips for an upright image at almost anyviewing angle PowerGrip fits easily onto almost any notebook PC andflat panel display Creative Live! Cam Suite lets you organize photos andcreate fun photo calendars Works with Windows Live Messenger Skype Yahoo! Messengerand AOL Instant Messenger Use with a SightSpeed plan to turn your PC into a videophone and make multi-party phone (SightSpeed plan not included) Create videos quickly and easily with muveeNow's videoediting technologyNote: &nbsp;1.3 megapixel photo and 800 x 600 videointerpolated from native VGA sensorIncludes Live! Cam Notebook Pro (USB) Travel Case Quick Start Guide Installation software CD containing: Creative Live! C", "title": "Creative Live! Cam Notebook Pro - VF0400", "price": 21.83, "imUrl": "http://ecx.images-amazon.com/images/I/31GxA6VBQNL._SX300_.jpg", "related": {"also_viewed": ["B004431UBM", "B0092QJRPC", "B004FHO5Y6", "B004YW7WCY", "B005HZQQWO", "B003LVZO8S", "B004WO8HQ4", "B00AFSNALS", "B008ZVRAQS", "B00F34L85O", "B0040X3EG0", "B000RZNI4S", "B003M2YT96", "B0067MK1TU", "B004CYLARC", "B000TGAVSQ", "B000RYB1IY", "B000VUVI5K", "B000GLKK6C", "B004HKAIBA", "B006JH8T3S"], "buy_after_viewing": ["B004431UBM", "B0092QJRPC", "B004CYLARC", "B004FHO5Y6"]}, "categories": [["Electronics", "Computers & Accessories", "Webcams"]]}