{"asin": "B0014CIBWC", "description": "Introducing Dash Express, the first two-way Internet-connected GPS navigation system. Dash delivers traffic and destination information in exciting new ways, and offers a wide range of new capabilities available from the car that makes a typical GPS practically obsolete. Dash is the smartest way to get from A to B, and find everything in between.OverviewDash Express provides current and truly accurate traffic dataDash Express leverages the most comprehensive traffic solution ever&#x97;the innovative Dash Driver Network&#x97;to provide the most accurate and current traffic information available.Learn moreLive Internet content in your carUnlike other GPS devices that can only access content from a static, pre-loaded database, Dash gives you the most current, locally relevant information by using the power of the Internet, including Yahoo!&reg; Local search and other websites you know and trust.Learn moreSo advanced, it's always up to dateDash Express automatically downloads the latest software, features, maps, and traffic data to the device. Why drive around with an obsolete GPS device when you can have Dash?Learn morePlan ahead and personalize from your PCUse Send2Car to send any address from the Web or e-mail directly to your device in seconds. You can even use the MyDash website to find or create new search lists and categories, and send them right to your device.Learn moreWhat the press is saying\"This is the most drool-worthy device since the iPhone.\"O&#x92;Reilly Radar (10.19.2007)\"Dash: One GPS Device to Rule Them All\"Wired (10.19.2007)\"The most advanced attempt at dynamic content is currently being made by Dash\"New York Times (10.24.2007)\"Dash is, in our opinion, the pioneer in 2nd generation GPS navigation systems.\"Navigadget (1.17.2008)\"After a hands-on session with the Dash Express, it's looking like getting traffic right could be just the tip of the iceberg for this powerful navigator.\"GPS Magazine (1.8.2008)\"Dash goes to the next level and raises the bar for all GPS navigation systems. Now the static and limited points of interests (POI) seem so yesterday.\"Ubergizmo (10.19.2007)TruTraffic: The most comprehensive traffic resource availableDash Express has the smartest, most advanced traffic solution available&#x97;the innovative Dash Driver Network. Combined with comprehensive historical and sensor-based traffic information, the Network provides users with the most detailed, accurate and current traffic picture available today.The Dash Driver Network DifferenceDash approaches traffic in an entirely different way &#x97; by collecting it from other people driving real commute routes, during real commute times. Each Dash Express anonymously and automatically sends its position and speed back to servers at the Dash Network Operations Center. The Dash servers then update all other Dash devices in the area with current road speeds. That way, members of the Network always have the best, most up-to-date traffic available.Dash devices receive traffic info from road sensors, commercial fleets and other sources through our partnership with Inrix, the premier traffic flow data provider in the U.S. However, even the first Dash devices in an area get traffic data that's superior to other GPS devices, as Dash uses these initial cars to calibrate the sensor data. This lets Dash assign it a high (straight line) or medium (dotted line) confidence rating, giving you all the information you need at a glance. The larger our network grows, the better traffic information becomes.In addition, Dash frequently updates each Dash device with the most comprehensivehistoricaltraffic database in the industry &#x97; a combination of third party and Dash driver data. Dash knows how fast every road segment you drive historically moves during each of 672 separate 15-minute time periods during the week.Dash Express users will begin to see the benefits of the Dash Driver Network with only a few devices in a given market. And every additional device in the area just makes the Network better. It takes a surprisingly small number of drivers in a major city for Dash to provide live up-to-the-minute data for most roads during commute hours.The Dash Driver Network also allows us to provide coverage on nearly 2 million miles of US road, and offers the only source of traffic flow data for surface streets.All of this adds up to the best traffic data in the industry. The kind of timely data you need to make good driving decisions, as well as accurately estimate and track your arrival time once you&#x92;ve selected your route.Dash Express Interface", "title": "Dash Express Two-Way Internet-Connected Portable GPS Navigator", "price": 196.95, "imUrl": "http://ecx.images-amazon.com/images/I/511EqN0MYmL._SY300_.jpg", "related": {"also_viewed": ["B00H46RS58", "B00440DVBM", "B003OPCL7I", "B0010G5K80", "B009TBUWO0", "B005KHF2DI", "B00C72HTBW", "B008XIJLZQ", "B004PEN59U", "B000NNQ0XA", "B001BJAJ64", "B001TEXPV2", "B001U8D346", "B009YG89S6", "B008XGY3Y2", "B0084L0B8I", "B00E6MFD9Q", "B00CMS5OIG", "B003M0LVYE", "B000K9Q528", "B00DE9Q9UE", "B00160GOR6", "B00DBD682W", "B005LMWPYG", "B001P3O3MC", "B005PP38AY", "B000N20RPS", "B00BV21WC6", "B000Q3BJTW", "B00197C9AM", "B00FO4M8CU", "B001Q0Y66C", "B004UDSOV0", "B001TI5NH2", "B0006GK9ZY", "B008588UXS", "B005N130Y4", "B001E2DTV0", "B007X5J7X6", "B001G6152O", "B002G74US8", "B00721D41M", "B000NUQWIQ", "B00EA03WGU", "B00FA4VC94", "B0089DP7OY", "B000I5NFBS", "B007F5H66E", "B002KDYZG0", "B003XOZN7A", "B00J9Z35MW", "B00DGHW0NY", "B00B30K05Q", "B00GOOC356", "B005BH13Y4", "B001N2MUD4", "B000643DVS"], "buy_after_viewing": ["B0057OCDQS", "B005DIBHA6", "B0057ODG6Y", "B002OL2MU4"]}, "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS"]]}