{"asin": "B00C4Q61Z6", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]], "description": "A boombox in the palm of your hand-quality sound goes mobile.Cutting edge, cutting power.This little stereo packs the state-of-the-art Bluetooth 4.0 standard. What's the upside? Smarter sleep and wake modes won't waste your power. So, no matter how long your device has been paired (a day? a week? a month? ), this little powerhouse will keep your tunes rolling for 8 to 10 hours on a single charge.The smaller the better.Compact, light, and featuring a stylish, round-drum profile, the Anker Portable Bluetooth Speaker slips easily into your bag. Avoid the dead weight of a traditional stereo, while still enjoying quality sound performance wherever you are.Double the sound.No need to keep your music to yourself. At two times the volume of the iPhone 5's internal speaker, this mini stereo pumps out enough volume for a small party. Fill the room with full, clear sound to freely share your tunes, or just enjoy the ambiance yourself-without the hassle of headphones.Pure and simple.Easily connect to any Bluetooth-enabled device, or just plug into the 3.5mm audio jack to start playing your media. We kept the controls simple too, either use the 6 built-in buttons or simply your smart device's own controls-a touch of the finger is all it takes.Get to know us.We created Anker with a single goal in mind: to make the smart life easier. That means starting with affordable, high-quality gear and ending with a commitment to 100% user satisfaction. After all, we're customers too.", "title": "Anker&reg; Portable Bluetooth 4.0 Speaker (fully backward compatible) Mini Speaker with 3.5mm Aux Port, Enhanced Bass Boost, Built in Mic Speaker System, 10 Hours Playtime", "price": 29.99, "salesRank": {"Cell Phones & Accessories": 4518}, "imUrl": "http://ecx.images-amazon.com/images/I/41%2BcYdR6IcL._SY300_.jpg", "related": {"also_bought": ["B00GZC35YK", "B00E12FJK4", "B00IKMJ9B6", "B00GX9A06Q", "B008I646WG", "B00E174RTS", "B006ZN4U34", "B00KBMRNQG", "B00D856NOG", "B00EF1OGOG", "B00B8L36A6", "B00EI8SS4U", "B00GTGETFG", "B0043ZWJHU", "B00IBDOB5I", "B00K4VQZCM", "B009USAJCC", "B00DMWV3EU", "B00D5T3QK4", "B00DLZOG2E", "B00DVH62J2", "B00D82O68Y", "B005NGLTZQ", "B007Q45EF4", "B00F3T0DKK", "B00B0TXEEY", "B009ZIILLI", "B004QXUR46", "B00CIRGHQO", "B00JIVZ6MY", "B009APBYQA", "B00DBPU8KS", "B00HG1L334", "B00D5VAYRU", "B00CEZBKTO", "B00HA6ACW8", "B005X1Y7I2", "B00FYQKMRG", "B005NF5NTK", "B00BKW2410", "B00A0ABQLM", "B00004WLJ9", "B00870ZHCQ", "B00EB8KMGE", "B00HIZYCM2", "B00DR8LA6U", "B00CEZJT2E", "B00006HTLJ", "B00J8ZJCUW", "B00E5HXJEI", "B000067RC4"], "bought_together": ["B00IKMJ9B6"], "buy_after_viewing": ["B00GZC35YK", "B00FJILVDS", "B00GX9A06Q", "B00F5NE2KG"]}}