{"asin": "B000OEV88K", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]], "description": "No   more fussing with messy wires,&nbsp;The   MDR-RF925RK wireless headphones system gives you the freedom to travel up to   150 feet from your sound source while delivering stereo quality sound,&nbsp;This system includes Ni-MH rechargeable   batteries -&nbsp;900MHz RF wireless   transmission and headphones with a 40mm driver for deep bass. An auto tuning   feature conveniently scans up and down the band to automatically tune in   channels. The MDR-RF925RK wireless headphones system enables an easy   connection to a wide variety of sound sources. Package Contents -&nbsp;MDRRF925RK Wireless Headphone Rechargeable   Ni-MH Battery Pack, Stereo connecting cable Cord Length (Approx.) : 39 3/8   in. (1.0 m) .&nbsp;Connectivity Technology   -&nbsp;Wireless,&nbsp;Wireless Technology -&nbsp;RF,&nbsp;Wireless Operating Distance -&nbsp;150 ft,&nbsp;Sound Mode -&nbsp;Stereo,&nbsp;Minimum Frequency Response -&nbsp;20   Hz,&nbsp;Maximum Frequency Response -&nbsp;20 kHz,&nbsp;Battery Information -&nbsp;Maximum   Battery Run Time -&nbsp;18 Hour,&nbsp;Earpiece Design -&nbsp;Over-the-head,&nbsp;Earpiece Type -&nbsp;Binaural,&nbsp;Earpiece Controls -&nbsp;Volume,&nbsp;Driver Type -&nbsp;Neodymium,&nbsp;Driver Size -&nbsp;1,&nbsp;57\",&nbsp;Physical Characteristics: Form Factor - Ear-cup. Limited warranty 3   months for parts and 3 months for labor.What&rsquo;s in the box :Sony MDR-RF925RK Wireless RF Stereo Headphones, Transmitter, Power Adapter, Rechargeable Battery Pack and Limited 90-Day Warranty Parts &amp; Labor.", "title": "Sony MDRRF925RK Wireless Headphone (Discontinued by Manufacturer)", "price": 97.93, "imUrl": "http://ecx.images-amazon.com/images/I/41RXud3KGRL._SY300_.jpg", "brand": "Sony", "related": {"also_bought": ["B006UPSAQK", "B002MPV2XU", "B004UZVDTI", "B009A6CZYO", "B00GYATOS4", "B000I23TTE", "B0083J7EM2", "B000PCEFXQ", "B00AZGEEEW", "B009A6CZ26", "0515154725", "B0001FTVEK"], "bought_together": ["B006UPSAQK", "B000I23TTE"], "buy_after_viewing": ["B009A6CZYO", "B0001FTVEK", "B009A6CZ26", "B000I23TTE"]}}