{"asin": "B0006Q7FFG", "description": "Amazon.com Product Description The distinctive white ear buds that come with 3G, 4G, and 5G iPods meet the audio needs of many listeners, but some don't like the fit, and still others think the buds' sound is too tinny and weak. Griffin addresses these concerns with its EarJams, a pair of snap-on plastic ear funnels designed to boost and improve the iPod's audio performance. The Jams attach directly to the ear buds and use their cone shape to focus the sound within the ear. The Jams also come with three pairs of soft rubber ear pads--large, medium, and small, depending on the size of your ear canal--and a protective carrying case. It's important to note that the EarJams don't fit the buds that came with 1G and 2G iPods.EarJams come with included carrying case to protect your spare earpads and your Earbuds.Features and PerformanceEvery music fan has a different opinion on what constitutes quality sound. To some, it's expressive, clear high ranges, while others prefer big, booming bass. If you consider yourself a bass believer, the EarJams are right up your alley. The funnels create much deeper tones, turning formerly bright-sounding songs into thumping affairs. The Jams also boost the volume by around 15 to 25 percent, pleasing listeners who think the traditional iPod ear buds are too slight.The real question, though, is whether this bass monsoon actually improves the music. And the answer, again, is in the ear of the beholder. There's no question that the Jams sacrifice the high- and mid-range frequencies to improve the low-end performance. A once crisp-sounding acoustic guitar sounds a bit muddled through the Jams, while vocals that formerly soared end up stooping instead. On the other hand, the Jams can also take a flat-sounding hip-hop track and give it some serious punch. Listeners may be best served by using the EarJams on an album-by-album basis, as some songs are clearly improved by the added wallop, while others just create a thud.One huge area of improvement is the way the EarJams fit within the ears. Once listeners determine which ear pads fit the best, the Jams nestle securely within the ear canals and won't come out until pulled. Contrast that with the default ear buds, which sit loosely in the ear and can easily tumble out while jogging or walking, or even during a quick turn of the head. The pads are also washable in case they get a bit waxy.A final bonus comes in the form of the zippered carrying case, which holds the ear buds, EarJams, and all of the pads in its padded pouch. The main compartment opens to reveal two mesh pockets and a third zippered pocket.--Rivers JanssenProsSignificantly boosts the bass performance of your iPodIncreases volume output of ear budsMultiple sizes of ear pads ensure comfortable, secure fitHandy carrying case protects buds and EarJamsConsHigh- and mid-range frequencies don't sound as goodWhat's in the BoxTwo snap-on EarJams, two small ear pads, two medium-sized ear pads, two large ear pads, padded carrying case.iPod CompatibilityiPod nano 1G,iPod nano 2G,iPod mini,iPod 3G,iPod 4G (Clickwheel),iPod Color,iPod 5G/5.5G Video,iPod Shuffle 1G,iPod Shuffle 2G", "title": "Griffin Technology 4039-EJAM EarJam Earbud Sound Enhancing Covers (Discontinued by Manufacturer)", "price": 9.99, "imUrl": "http://ecx.images-amazon.com/images/I/31HDeI5UAaL._SY300_.jpg", "related": {"also_viewed": ["B001GPCBPU", "B00G9AU6KE", "B003T90WY8", "B00CO86V3Q", "B003BOQU1U", "B00FGDRXTC", "B00HL9ZPWQ", "B003ZWQMA2", "B0097BEG1C", "B007C5S3AU", "B003EM8008"], "buy_after_viewing": ["B001GPCBPU", "B00G9AU6KE", "B003LLPZFK", "B003T90WY8"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]]}