{"asin": "B00CELZD8C", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]], "description": "The Sabrent Receiver lets you wirelessly connect a Bluetooth-enabled device, such as a smartphone or MP3 player, to a stereo or stand-alone speaker. Now you can enjoy your music wirelessly. Changing you standard speakers to Bluetooth-enabled speakers, you can easily control the content without the need for any cable connection.Play the Music of Your iPhone/iPod touch Wirelessly Through Your Home StereoEnjoy the convenience of a wireless connection while listening to your favorite tunes. With the innovative Bluetooth Music Receiver, you can appreciate the superior sound of your home speakers while controlling your playlist from the comfort of your sofa. Say goodbye to the hassle of cables, docks, and cradles, and play your iPhone or iPod touch wirelessly through your stereo. With Bluetooth 2.1 technology, you'll get reliable, high-quality sound.Simple and Easy Wireless Set-UpGetting started with the Bluetooth Music Receiver is easy. The Receiver itself connects to your home stereo or speakers using the included 3.5mm-to-3.5mm cable. You can then pair your Bluetooth-enabled device with the Receiver wirelessly from across the room in your sofa or favorite chair. The Receiver stays connected up to 33 feet away, giving you plenty of freedom to move about as you choose.Low Profile, Elegant DesignThe discreet and elegant design of the Receiver will complement any home stereo system. Its small, unobtrusive footprint fits easily next to your stereo or speakers.What's in the BoxBluetooth audio receiver , 3.5mm Audio cable , User manual", "title": "Sabrent Bluetooth Wireless Adapter for Home Stereo, Portable Speakers, Headphones And any other 3.5mm Audio input Device (BT-AUDIO)", "price": 30.69, "imUrl": "http://ecx.images-amazon.com/images/I/41YHGnXMfaL._SX300_.jpg", "brand": "Sabrent", "related": {"also_bought": ["B00C2M72A0", "B00C2N3DTI", "B00E4NI59C", "B00BJPRI1Y", "B00DE4MI2M", "B002DYIZ2Q", "B00AF22NTY", "B00ABNLEWO", "B00DQIST6A", "B00ANWWSEQ", "B00ANWWSE6", "B00EDCF0MY", "B00CPGYNV4", "B00713RSE0", "B003CJQ69A", "B009OBCAW2", "B008UG6GCC", "B007Q45EF4", "B00AEWTSWU", "B0049P6OTI", "B000067RBT", "B00C2NJ39W", "B004JKD0U4", "B000DZTAQW", "B005EIGDZO", "B000LWARKK", "B0085IZUJ0"], "bought_together": ["B00CPGYNV4"], "buy_after_viewing": ["B009OBCAW2", "B00DLZOG2E", "B00E3FHXYO", "B004VM1T5S"]}}