{"asin": "B000BFO4OC", "description": "Experience the world's first smart mouse. TheLogitech. MX 610 Laser Cordless Mouseredefines performance with ultra-precise laser tracking on more surfaces and interference-free 2.4 GHz digital cordless technology. As the world's first smart mouse, it extends battery life by syncing with your PC; it sleeps, wakes up, and shuts down when your PC does. The MX 610 also detects and eliminates wireless interference and alerts you when the batteries are low.Easy to configure, e-mail and IM buttons light up when you receive new messages from selected friends and associates. Adjust volume directly from your mouse, while speed-browsing on the Web with Forward/Back buttons. The Tilt Wheel Plus Zoom is perfect for viewing digital photos and spreadsheets. The MX 610 comes with a 5-year warranty and full product support.Features2.4 GHz cordless--5X greater rangeAutomatically detects and eliminates wireless interference for a level of reliability that conventional 27MHz can't match. The ultra-compact receiver plugs directly into a USB port, eliminating clutter.Auto turn-offExtend battery life with the automatic on/off feature. Mouse automatically turns on when your PC turns on, sleeps when your PC sleeps, and turns off when your PC is off. Battery indicator alerts you when batteries are low.Email and IM notification buttonsInstant, one-touch access to email and messages. Buttons light up so you can see when new messages arrive from selected friends, even if you&acute;re not in front of your PC. Easy to switch on or off and configure.Performance Laser-TrackingState-of-the-art laser technology for unmatched precision and control. Works flawlessly on surfaces where optical mice can't go.Tilt Wheel Plus ZooomThe perfect tool for viewing digital photos and spreadsheets. Instantly zoom in and out; scroll horizontally or vertically.Forward, Back and Volume controlsThe MX 610 puts volume and mute controls at your fingertips. Use the forward/back buttons to quickly browse web sites and large documents, or customize the controls to fit your style.System RequirementsIBM or compatible PCWindows 98, 2000, Me, XPUSB or PS/2 portCD-ROM drivePackage ContentsLogitech&reg; MX 610 Laser Cordless Mouse2.4GHz Micro-ReceiverCD with Logitech&reg; SetPoint softwareInstallation GuideUSB-to-PS/2 adapterTwo AA batteriesFive-year limited warranty", "title": "Logitech MX 610 Cordless Laser Mouse (931350-0403)", "price": 67.99, "imUrl": "http://ecx.images-amazon.com/images/I/414N3DFBHAL._SY300_.jpg", "related": {"also_viewed": ["B002HWRJBM", "B003NR57BY", "B003TG75EG", "B000EXRSWG", "B000QJ3DZE", "B0002UM0JW", "B003VAM32E", "B001DJ64C0", "B00DR8LB4Q", "B003I4FHNA", "B000HCT12O", "B000BFNT2A", "B00E4MQODC", "B005KSAOKI", "B0034XRDUA", "B000AY5Y5W", "B00BFOEY3Y", "B006H4IORE", "B0082D5660", "B000HCRVUS", "B000K2CQGE", "B00I14395A", "B003WQ2UUW", "B0046ZN8P4", "B002B3YCQM", "B006JRIDHK", "B005KSAO6C", "B0011FQUQG", "B003EUPCZG", "B005KSAHZU", "B002HWRJBC", "B005KSAJXK", "B005KSAG3S", "B0014TJSMM", "B001DJ9GOS", "B007PJ4Q4A", "B00F9B1QK8", "B007XZX2K0", "B00BIFNTMC", "B00DR8L7M2", "B000A6NUUQ", "B00DPC015E", "B003I4FHNK", "B00ACC0P0Q", "B009ZPS3WS", "B00EO2ECUY", "B005EWB3AU", "B000TKHGL2", "B0036E8V08", "B0093H4VSS", "B00BCEK2LA", "B00G5T8DJ0", "B0058TDROE", "B000T8CWFE", "B006T0ODG2", "B004HYGU18", "B00IAM78WS", "B00EWEHI5K"], "buy_after_viewing": ["B002HWRJBM", "B003NR57BY", "B00E4MQODC", "B003TG75EG"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Mice"]]}