{"asin": "B005QFH86S", "description": "This kit includes: MilitaryShield for your device, installation card, application solution, micro-fiber cloth, detailed instructions manual & ArmorSuit Lifetime Replacement Warranty.ArmorSuit-MilitaryShield is extremely transparent and formulated against UV for anti-yellowing, in order to protect your device. ArmorSuit-MilitaryShield is made from the same protection film material used to protect military aircrafts, helicopters and space shuttles. MilitaryShield also equipped with \"self-healing\" technology to further extend the protection. The self-healing technology will eliminate minor scratches on the film over period of time. Our MilitaryShield has also been precisely cut to provide perfect fitting invisibly protect your device. You can relax and stop worrying about permanent scratches on your device because our MilitaryShield provides you a peace of mind to keep your device away from any scratches. ArmorSuit MilitaryShield features corrosion and moisture protection, it prevent moisture from migrating through film to attack underlying substrates. It also provides erosion and impact protection, it protect paint, plastics, metals and composites from sand, rock, rain, and debris damage. Also protects against general wear, rubbing, chaffing, abrading, scraping, etc.How to Remove the MilitaryShield:If you ever need to remove the ArmorSuit MilitaryShield, JUST PEEL IT OFF with your bare hands, it comes off clean and leaves NO sticky residue.*Made in the USA*", "title": "ArmorSuit MilitaryShield Screen Protector Shield with Lifetime Replacements Fits Amazon Kindle Fire Tablet", "price": 11.95, "imUrl": "http://ecx.images-amazon.com/images/I/516hLCcUqqL._SY300_.jpg", "related": {"also_bought": ["B004Y8Y24Y", "B0053VZUW4", "B00849E1CM", "B004RDWVUS", "B00FQ1O2IE", "B006GWO5WK", "B007TYUUPK", "B00DV56J9W", "B004QQTXXY", "B008EO263I", "B00G3J8EZ0", "B00540OK66", "B0072ZJVC4", "B005QBK5V2", "B0053VK1J6", "B00E9HVL7G", "B00BMIG4CC", "B00656U0NK", "B0083Q04TA", "B005QBK63Y", "B008SYWFNA", "B0079R8KO0", "B0082JI56W", "B005KDYBIO", "B006GWO5NE", "B005QJR346", "B007A5BM5U", "B007X9QIXO", "B00E8NPRTO", "B008M20QUC", "B005V78U2M", "B006TOPR72", "B0064R6G4W", "B00757FQ96", "B0058PCJYC", "B0074EFFOG", "B009D4D4BQ", "B006RO5Q8O", "B0096UH6DY", "B006N1WN50", "B00AFKC6KC", "B005QBK61Q", "B00E5T4MR4", "B006GLG6K0", "B0074EJ7B8", "B0089PZ0JO", "B000A7B3W2", "B00C5W16B8", "B008GFRDL0", "B0064C0PBM", "B005BUXRUO", "B008THTOKS"], "bought_together": ["B006GWO5WK"], "buy_after_viewing": ["B00BWYQ9YE", "B00IMU39IK", "B00BHJRYYS", "B00G3J8EZ0"]}, "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Screen Protectors"]]}