{"asin": "B002GJRQQY", "description": "Beautiful, compelling, and at times unforgiving, Demon's Souls is the hardcore RPG experience PS3 owners have been waiting for since the platform's launch. Revolutionary online features define your adventure like never before, presenting seamless interconnectivity that serves in every instance to enhance the single-player game. Unprecedented in its depth and subtlety, peerless in its relentlessly challenging gameplay, Demon's Souls is the ultimate action RPG. The game features:A hardcore RPG challengeIn this brutal land, death is inevitable, but not final. Combining the best features of an action game and RPG, you'll slice, smash, shoot, and cast magic against some of the most horrible, vicious enemies ever encountered. Are you strong enough to face up to the impossible and win.Ground-breaking online capabilities.Network features go far beyond any previous RPG, allowing players to leave hints for each other, replay death scenes, cooperatively revive dead players, or invade and wreak havoc in another's game. Not merely an add-on feature, multiplayer options are vast, and uniquely focused on changing and intensifying the single player experience.Freeform and flexibleThe open-ended structure of the game means that there is no single path, but rather a wealth of options. Set your own pace and progress as you like. Build exactly the character you want by creating a detailed avatar, nurturing the right stats, and customizing your skills and equipment.", "price": 408.73, "imUrl": "http://ecx.images-amazon.com/images/I/51MiC%2BNIuUL._SY300_.jpg", "related": {"also_bought": ["0744015472", "B00542ZQJO", "3869930527", "B00KVQ78B2", "1926778898", "B00F6YD2FK", "B00KVRK39A", "B00KBD4SJA", "B009IF0G9S", "B001NX6GBK", "B00DYAQHTQ", "074401493X", "B00G2HSX86", "B00F6YD2AK", "B00CTKHXFO", "B00BY0G0YU", "B00G2HSXL8", "B002ATY7JE", "B00FDQQD52", "B004NRN5EO", "B00DBLBMBQ", "B00B59L9T6", "B007V9QKH0", "B003O6EDSM", "B0047TLIBU", "B004P7VGF2", "B00024W1TM", "B00B59MXGY", "B003XX4462", "B000FQ2D5E", "B003O680RM", "B004NRN5DU"], "bought_together": ["B00542ZQJO"], "buy_after_viewing": ["B004NRN5EO", "0744015472", "B006YDPU48", "B00F6YD2FK"]}, "salesRank": {"Video Games": 13215}, "categories": [["Video Games", "PlayStation 3", "Games"]]}