{"asin": "B00026D13A", "description": "Imagine you could make any movie you wanted to. Imagine you could pluck someone from obscurity and make him or her the hottest star in Tinseltown. Imagine that you had control of an entire movie studio, competing with others to create a string of box office smashes. Imagine being able to use your judgement alone, deciding whether success lies with epic action pictures or lots of low budget, hammy 'B' movies.Will the stars you've so lovingly groomed develop monstrous egos - refusing to accept that they are now too old to play the romantic leads that made them famous? You can help, but there are only so many times you can send them to fat farms and plastic surgeons.Will you watch your movies being shot or do you want to direct the action yourself? Will you decide to innovate and introduce the talkies, color or digital sound before any of your rivals? Or will you let the other studios make the investments, leaving you to jump on the bandwagon if the new technology becomes popular?Many of the things you've ever read or heard about Hollywood are right here inThe Movies- from stars having affairs and hitting the bottle to teams of genius filmmakers creating the box office hit of the year. Movie mogul, talent spotter or film director. You can be one or you can be all three. That's the magic ofThe Movies.", "price": 49.98, "imUrl": "http://ecx.images-amazon.com/images/I/51TV7S65QEL._SY300_.jpg", "related": {"also_bought": ["B000FTHEPU", "B0007GBBHI", "B000B659FE", "B000G6IP5A", "B0001D7NYC", "B001IK58A8", "B001BZ2F56", "B0012DPHKW", "B00029QOQS", "B001DOMCQC", "B000KQQUMQ", "B00004T77P", "0761544453", "B000PS1HNQ", "B002OPZTHI", "B000094FR7", "B000X1CR5M", "B001GGO1FW", "B000XJ4UVS", "B00EFRN2IQ", "B0057VO40E", "B0050SX7BQ", "B0002L88HE", "B00BGGIWZM", "B00CTKHYEE", "B0000C0YW2", "B0026EGO3A", "B000FN7K2S", "B001UIG6M2", "B004FYKWZU", "B006WQR3V0"], "buy_after_viewing": ["B000B659FE", "B0007GBBHI", "B001IK58A8", "B000HKGD4A"]}, "salesRank": {"Video Games": 4335}, "categories": [["Video Games", "PC", "Games"]]}