{"asin": "B002O3W2OI", "description": "NETGEAR Stora is an ideal network storage solution for your home's shared media and data. Extremely easy to set up and operate, this network attached storage device lets you and your family share music, movies, photos, and more from one centralized network location. With the NETGEAR Stora, you can even access your files and music over the Internet while you're away from home.With NETGEAR Stora you can:Centralize all your digital media in a single, secure location.Share music and photos with selected friends and family.Watch movies streaming from home on any Internet-connected device.Stream music to your iPhone or other Web-enabled phone.Easily share your photos and movies with your favorite social networking site.Store your media and data in one location that everyone on your network can access.View larger.Access All Your Media in One PlaceNETGEAR Stora lets you store all your music, photos, videos, and data in one centralized location that everyone on your home network can access. Instead of each computer in your home having separate media libraries, each computer--whether it's a PC or Mac--can access, share, and stream multimedia content directly from Stora.And Stora doesn't only connect computers on your network. Sony PlayStation3, Microsoft XBox360, and even digital picture frames can access the media you put on your Stora.NETGEAR Stora MS2110 comes with 1 TB of storage space, which is enough to hold 125 DVDs, 77,500 photos, or 20,000 songs. (Based on 8 GB ripped movies, 3.2 megapixel 2048 x 1536 jpeg images, or 5 MB .mp3 songs.)Connects to your Network, Not Just to One ComputerTo set up the Stora with your home network, simply connect the device to your router with the included Ethernet cable, plug the unit into an available power outlet, and run the included set up disk. Stora automatically shows up on your computer as a network drive and configures remote Internet access.The included backup software for Mac and PC systems can be installed at the same time.For wired networks, the Stora has a Gigabit Ethernet port, which means you can get fast network speeds and outstanding network streaming performance of up to 250 Mbps. You can be sure the music and videos you stream will be smooth and clear, even when multiple users are accessing them simultaneously.Access Your Files Over the InternetThe NETGEAR Stora not only lets everyone on your home network access your media, it also lets you share and access files over the Internet. You can share music with selected friends and family, stream movies from home to any Internet-connected device, and even stream music to your iPhone.Easy Facebook Integration and Video StreamingStora seamlessly integrates with Facebook, Flickr&trade;, Picasa&trade; and other popular Web sites. This gives you the option of seamlessly and securely transferring videos, pictures and more to your accounts.Organizing and sharing your media with friends and family is easy. (Click on either screenshot for a larger view.)It can also stream your audio, video and photos to digital media players that support UPNP AV and Windows Media Connect, as well as any devices that are DLNA certified including your PS3 or Xbox360. And an iTunes&reg;, server is included too, so your private music collection is accessible from any network player or location -- even a mobile phone!(Click on any number for a larger view)1. You can add a new disk on the fly without tools.2. Connect external devices with the USB port.3. Gigabit Ethernet offers outstanding performance.USB Port to Add External DevicesStora also has a USB 2.0 port that allows you to connect and share external devices such as a USB printer or external hard drives or flash drives for either adding content directly to the Stora or backing up your content.Add an Extra Drive for Data ProtectionEasily protect the data on your Stora by adding a second hard drive. Stora supports mirroring, which means that when you add a second hard drive, the Stora will automatically keep all the contents of the first drive backed up on the second drive. If one drive fails, your data will still be accessible on the second drive, giving you peace of mind.Stora accommodates 3.5-inch SATA drives from most manufacturers, so you can simply add the new disk on the fly, without tools, and the Stora takes care of the rest.The NETGEAR Stora measures a compact 5.9 x 6.9 x 5.7 inches (WxHxD), so you can easily fit it on your desk or conveniently tuck it away.What's in the BoxNETGEAR Stora storage device, power adapter, power cable, Ethernet cable, quick installation guide, warranty card, and resource CD.NOTE: a free 30 day trial of the optional Premium Service subscription is included. Premium Services enable mobile phone support and integration with online services beyond Facebook.Access your data from your home network as well as over the Internet.Related NETGEAR ProductsNETGEAR EVA2000 Digital Entertainer LivePlay movies, video, music and photos from Stora directly to your TV without a computer.Enjoy Hulu, YouTube, and other Web sites directly on your TV.&nbsp;NETGEAR WNDR3700 Dual Band Wireless-N Gigabit RouterTop-of-the line router, ideal for serious gamers, videophiles, and anyone demanding high performanceDual-band Wireless-N operates simultaneously on 2.4 and 5.0 GHz frequencies for highest throughput speed and performanceReal throughput of 350 Mbps wirelessly streams movies and music from Stora to your home computersNETGEAR EVA9150 Digital Entertainer ElitePlays your digital media from Stora on your HDTVStreams Internet content, such as YouTube, directly to your HDTV500 GB hard drive for extra storage of your digital music, photos and video&nbsp;NETGEAR WNR2000 Wireless-N RouterWireless-N performance for ultra-fast speed and performanceIdeal for streaming videos and other high-bandwidth multi-media filesBackwards compatible with older Wireless-G devicesPush 'N' Connect for easy set-up processNETGEAR XAVB1004 Home Theater Internet Connection KitConverts your home wiring into a high-speed networkTurns standard outlets into high-speed, entertainment-grade Internet connections for up to 4 devicesIdeal for connecting Stora, HDTVs, Blu-ray players, and game consoles to your home network&nbsp;NETGEAR RND2110 ReadyNAS Duo 1 TB Network Attached StorageA step up from Stora, this award-winning network attached storage device offers more RAID options, rsync, software Add-Ons and expert storage networking choices1 TB of storage with one available drive bayOptional ReadyNAS Vault offsite archive option", "title": "NETGEAR Stora 2-Bay 1 TB (1 x 1 TB) Network Attached Storage MS2110", "price": 129.0, "imUrl": "http://ecx.images-amazon.com/images/I/31DsknaoVOL._SX300_.jpg", "related": {"also_viewed": ["B004UBU3SY", "B008DWAGPG", "B00DW1UNS8", "B007JLDTRY", "B0040NPGP2", "B001W6Q6FY", "B00BNI4A90", "B003CJTQPQ", "B00CO0DE0W", "B00DIO9M1S", "B00BXAVDLQ", "B00BNI4BE4", "B00B5Q79EI", "B0048TWIX6", "B00BNI4AWM", "B005TJLU24", "B00G9X5N18", "B005EJLFNI", "B00CO0DH6S", "B00BNI4CVG", "B00GJYNLKM", "B00365MF5E", "B00G9X5NFO", "B00CRB9CK4", "B00B5Q7B78", "B003NVMG6Y", "B00DW1VJVI", "B002WRIBN2", "B00B5Q7AC4", "B00I2P53NY", "B0048L62I6", "B003STVG80", "B005PVXH18", "B0013G04AQ", "B0063E3ZPO", "B00365MF54", "B004JHXWDC", "B00439GMJ2", "B0093NUFVE", "B001OC5J9U", "B00I2P82CS", "B00CO0DH6I", "B001MVIH24", "B00BNI4D9W", "B00CO0DDZS", "B00G4JZ2T0", "B008HNRD4I", "B00FY6RW2Y", "B005PVXI0S", "B003X26VV4", "B00FY6DV3S", "B00DIO9N8A", "B00ARB5FPM"], "bought_together": ["B008I647MA"], "buy_after_viewing": ["B004UBU3SY", "B008JJLZ7G", "B008DWAGPG", "B00DW1UNS8"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "Network Attached Storage"]]}