{"asin": "B002DW92IE", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Cassette Player Adapters"]], "description": "Music on the RoadTraveling with music is a great way to make a long car trip go by quick, but radio stations do not always play your favorites. Taking along CDs allows you to play what you want, but fumbling through discs while you drive is not safe and carrying a large number of discs can be awkward. Carrying personal media devices such as an iPod are a great way to take your music with you, but these devices are meant for a single user with headphones, how do your friends hear what is being played?Driving Tunes for EveryoneWith the Monster iCarPlay Cassette 800, all of the music stored on your iPod, iPhone, Android phone, or MP3 player is just a click away. Simply connect the cable into your player's headphone jack, pop the cassette adaptor into your car's cassette player and all of your music is now playing through car's audio system. Enjoy your music and share with the whole car for the entire trip...Special Monster FeaturesSince cassette decks in cars are not always laid out in the same manner, the iCarPlay Cassette 800's cable can be moved from one end of the cassette to the other. This allows for hassle free operation, no matter how your car's cassette deck is laid out.", "title": "Monster iCarPlay Cassette Adapter 800 for iPod and iPhone -3 feet", "price": 14.39, "imUrl": "http://ecx.images-amazon.com/images/I/416l-B3lMPL._SX300_.jpg", "brand": "Monster", "related": {"also_bought": ["B00C9A2YP8", "B006SU0SX0", "B005T3ZI6E", "B007FHX9OK", "B0007R4LI8", "B00JNJPS4W", "B0093CHZ8G", "B0006G10V6", "B0044FUQJW", "B000WU9LCQ", "B002E9HHZQ", "B001U83TWW", "B00EV5I8JA", "B00622AG6S", "B001F9DJOO", "B009SYZ8OC", "B00B17BE6K", "B004HMBK5G", "B009QTLTOM", "B00GB8XIZO", "B00GHUHMUS", "B00GLPG03Y", "B0042B9U8Q", "B00006IBFA", "B006C5DGZS", "B0096WYG8U", "B004LTEUDO", "B006HCS7AK", "B00007FGU7", "B00CRGNOQW", "B00B8MMZY8", "B00K04C216", "B00FK6G59O", "B000K2U3JG", "B004MDXS0U", "B009NLTW60", "B00D901B4W", "B0097BEFYA", "B00G5VQIMM", "B002IAFC7Q", "B0088U6OZY", "B00B3OA7R8"], "bought_together": ["B006SU0SX0", "B007FHX9OK"], "buy_after_viewing": ["B0007R4LI8", "B000BUN79K", "B00KLZMZGQ", "B004V71MXW"]}}