{"asin": "B00C0R5YFW", "categories": [["Electronics", "Television & Video", "Streaming Media Players"]], "description": "The Sungale Smart TV Box  is more than just an internet streaming box that is found with other  products like the Roku, Google Chromecast TV and Apple TV. With a  full-function 1.6GHz dual core processor, Sungale Smart TV Box will  become your TV set as a state-of-the-art online media center, allowing  you to watch 100's of your favorite TV channels' content from ABC, FOX,  CBS, NBC, TNT, TBS and so on. Certainly, Sungale Smart TV Box also give  you video-Hubs such as Netflix, YouTube, Crackle, Vudu, Hulu Plus, &hellip;,  the video-Hub space of Smart TV Box is open, you can add any video-hubs  you like.  The best part is FREE, Smart TV Box do not like its  competitors to force the users to register to provide their secret  personal financial information,  NO CREDIT CARD INFORMATION and NO  HIDDEN FEES!  Still you need cable or satellite?More outstanding feature  is that Smart TV Box convert your TV set into a full-fledged smart TV,  you can use browser, access Facebook, Twitter, Instagram and any social  media, preloaded XBMC allow you build your own media center, go to  Google Play Store to download apps, support Mira-cast to play your cell  phone content on your TV, enjoy various audio, video and photo, listen  15K+ internet radio stations over all the world, review news from  preloaded top 10 news hubs, play various game, learn with your kids  together,&hellip;, even you can have free video chat with friends and family  anywhere in the world with an additional webcam.  Comparing with Samsung  smart TV or any other brand smart TV, you will find Sungale Smart TV  Box is the most valuable TV box.  It beats all other TV box, Smart TV  box, Multimedia box, Multimedia TV box, XBMC, Streaming box, Internet TV  box, Apple TV, Google TV, Streaming tv box, Online tv box, Online  media, Media center box,  Internet media center box, Online media center  box.", "title": "Sungale STB370 Smart TV Box", "price": 98.0, "imUrl": "http://ecx.images-amazon.com/images/I/51VgdATqdSL._SX300_.jpg", "brand": "Sungale", "related": {"also_viewed": ["B007WT9UYE", "B00F4SEOIW", "B007NJ6S9S", "B00G6BC57S", "B00IXQTFDQ", "B00I0O5QNY", "B00HR11DKQ", "B00BG5CBRS", "B007HIAXI2", "B00KAU8W14", "B00HA4ORMQ", "B00DQ5SADA", "B009VXUFLG", "B0079LGGZ6", "B00IBUKLPA", "B00EO8X91Q", "B00CM0O4N0", "B00GSC44ZQ", "B00CH643A8", "B004OVEYTO", "B00H4IOXEK", "B00G0KE7OE", "B00EAGUXA2", "B00JJDN81W", "B00ENZNY56", "B0042RA8C2", "B00CTEV9SW", "B00JYCE1PU", "B00HVFLKD8", "B00HPQZ2OG", "B00GTH1S8G", "B00IIHB8B2", "B00HTFAVKS", "B008BFXOZE", "B00EE07QGI", "B00GR30SW4", "B00BMLQPG4", "B00DBPU8KS", "B0092U3TKC", "B005KFHVES", "B00FYXEWQ6", "B00L403O94", "B00G2J9LF8", "B00LBIOQFA", "B00BGGDVOO", "B007I5JT4S", "B00LDKJNF4", "B00AXXOBEU", "B008BDBPTS", "B00CGYLLFG", "B00EYO241Q", "B00GEGFVPS", "B00J3QHYX8", "B00DD3ZJY8", "B00JE24WZE", "B00C2DH5WY"], "buy_after_viewing": ["B00BGGDVOO", "B003L1ZYYM", "B00CH643A8", "B00CX5P8FC"]}}