{"asin": "B000P0PF9G", "categories": [["Electronics", "Car & Vehicle Electronics", "Car Electronics", "Car Audio", "Speakers", "Coaxial Speakers"]], "description": "Turn up your vehicle's audio performance with the db651, a 6-1/2-inch coax speaker designed to drop into a variety of applications in no time at all. Advanced materials reduce component weight while offering rock solid reliability, advanced looks and ultra high performance. Borrowing technology from Polk Audio's flagship SR Series, the db Series offers exceptional value for the price.Turn up your vehicle's audio performance with the db651.Click to enlarge.Durable Butyl Rubber Surround won't fall apart under the stress of extreme temperatures, sunlight or time, for years of great Polk sound.Swivel Mount Tweeter allows precise aiming of sound.db651 FeaturesThe db651 come with 6-3/4 inch adaptor rings for easy fit in VWs, Audis, BWMs and other European cars.Dynamic Balance Driver Technology for pure, distortion free sound.Polymer/Mica Composite Cones are stiff yet lightweight for big sound and little distortion.Klippel Optimized Components for consistent, distortion-free sound.Marine Certified means the db651 is built tough to withstand the harshest environments on the water.Low-mass 2-Layer Kapton Voice Coil Kapton has a high melting temperature, ensuring reliability and high power handling.Swivel Mount Tweeter allows precise aiming of sound.Wheel-inspired style combines with rugged durability in the db grille.Polk Audio's db SeriesPolk Audio's entire db line of coaxial and component speakers has been redesigned and re-engineered with superior looks and even better sound. Polk has added three new sizes to cover a broader range of vehicle applications. And they've done all that at prices that make high performance affordable to everyone! The db Series works well in OEM factory systems, as well as with high-powered aftermarket head units and component power amps. The db Series delivers classic Polk Audio performance and durability like never before.This is how you turn up the style.The look is about more than performance. It's about making every detail count, from the wiring harness under the hood to the fit and finish of your loudspeaker installs. Even before you fire them up, the db Series delivers. ABS wheel-inspired grilles make a muscular statement about your entire audio system and say you're ready to unleash some real sound. Hidden wire channels give your system a clean, professional look. Now if you'd prefer to be more subtle about your audio system (although why would you?), db makes a comfortable stealth installation and will mount easily behind factory grilles.The db Series fits. Yes, it's just that simple.The last thing Polk wants is to sell you a great speaker that doesn't fit. Our new multi-hole mounting pattern and shallow-depth magnet design have created our highest vehicle application ratio for easy drop-in installations in just about any car on the road (and probably some that should have been taken off the road years ago). Tweeters in the component models can be flush & surface-swivel mounted using the supplied hardware. With db, we've made sure you have maximum install flexibility.High Efficiency DesignIt means less amplifier power is needed for more audio output. Meaning better sound and more volume using less power. The bottom line is db Loudspeakers will definitely blow you and your friends away, whether they're driven by aftermarket head units or factory installed electronics.Marine CertifiedMarine Certified means your db loudspeakers will perform reliably on the water as well as they do on land. So Polk attacked every db speaker with a series of punishing real world and accelerated weathering lab tests to see if they could take what some pretty nasty marine and automotive environments could dish out. Polk exposed dbs to hundreds of hours of salt fog, intense ultraviolet light and extreme temperatures from -40 degrees to 185 degrees F (-40 degrees to 85 degrees C). They performed as well after the tests as before (they didn't look so good). No wonder Correct Craft builds Polk Audio speakers into their award-winning Nautiques ski and wakeboarding boats, and Bullet uses Polk db speakers in their marine \"tower\" speaker enclosures.What's in the Boxdb651 Speakers (pair), Grilles, Installation Hardware, Owner's Manual", "title": "Polk Audio DB651 6.5-Inch Coaxial Speakers", "price": 63.09, "imUrl": "http://ecx.images-amazon.com/images/I/31-fNN85soL.jpg", "brand": "Polk Audio", "related": {"also_bought": ["B000P0R6LQ", "B000P0R6KW", "B000P0PF8C", "B000P0R6HA", "B000P0NJPS", "B004T163SY", "B000P0PF9Q", "B000P0LRUM", "B0002BEPJY", "B0002BBP7Y", "B007ZDCGVG", "B000NWCIE6", "B000P0PF78", "B0050I6KII", "B000P0R6GQ", "B0007WTEVM", "B007ZQ5ZTS", "B0039Z3SRA", "B00IK0MGYK", "B000P0NJOO", "B000NWEJWA", "B004T0WFVE", "B0002BEQWK", "B0002BEUZ8", "B00B43LKV0", "B003VVYL46", "B00BU2M29O", "B00IF9G03Y", "B0016GT6OI", "B007AQ2WXU", "B00BCOHDW6", "B000O8SQNG", "B000FKP7TY", "B000P0PF96", "B007T0NM2M", "B000P0PFA0", "B0016GV218", "B000RN62GQ", "B00020CAUG", "B007ZQGZWO", "B009ETWO0W", "B003MPW2Z6", "B001U4ZZPK", "B0038FNIBW", "B00029X1LO", "B0015A8Q7S", "B0002BG6QY", "B001Q3M0QC", "B000NWG3S8", "B000N5T0T4", "B001U5XKL0", "B0002BETHC", "B000NWG3RO", "B0012Z58HW", "B00JJXBBSY", "B0013N0UCQ", "B0016GT6M0", "B00EEO4WD4", "B00BF6HYBG", "B007B87RIC", "B006ZZUF68", "B0002BEX8W", "B006Y44DAY", "B0085CAYZ6", "B00020CATC", "B001AO1WR0", "B003GSLE4O", "B0002BEQN4", "B000N5YCQU", "B0016GV1UU", "B00CFX58YI", "B00E1BRITU", "B000MCLVZO", "B00B4PJC9K", "B001EAWS3W", "B0016GX21G", "B000N5UW8M", "B00HX2Q8KO", "B0047XQN4I", "B0085OJCOI", "B00D7XNQHG", "B003KEGS90", "B00GN5K63M", "B0071I0ZMC", "B007AQ2W2Q", "B003E4769C", "B0002BEQJ8", "B0007TJDFW", "B007AQ2V3Q", "B00JEC0YFQ", "B0039YWT80", "B00IF9FHV0", "B000SBLM1C", "B00CNUFGN6", "B003HH9FIQ", "B001ANXP26", "B000N3S83K", "B00CQBY174", "B00DJ6789S"], "bought_together": ["B000P0R6LQ", "B000P0R6KW"], "buy_after_viewing": ["B000P0NJPS", "B003KN2TF8", "B000P0R6LQ", "B000BPD330"]}}