{"asin": "B004I43MJU", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "Advanced 3MOS SystemAdvanced 3MOS System The Advanced 3MOS System records beautifully natural images with powerful colors and detailed rendering in both bright and dark scenes. The Noise Reduction technology that goes to work when shooting in dim lighting has evolved even further in 2011 models, allowing them to reduce noise by approximately 45% compared to previous Panasonic models.* The Advanced 3MOS System, which is comprised of the 3MOS Sensor that captures images without color loss, the Leica Dicomar Lens that excels with its large, bright aperture, and the Crystal Engine PRO that increases image resolution, produces colorful, bright, beautiful images in Full-HD quality.* Compared with the HDC-SD700, HDC-TM700, and HDC-HS700.3MOS SensorAdvanced 3MOS SystemThe 900 Series and SD800 employ the 3MOS Sensor, with its three-sensor configuration. This provides a resolution of 7.59 million effective motion image pixels (2.53 million x 3). The 3MOS Sensor splits the light information captured by the lens into the three primary colors - red, green and blue - and processes each color with its own individual sensor. This reduces light loss compared to the 1MOS sensor, and renders colors, details and gradation all with intricate detail and natural beauty. This superb color reproduction maximizes the inherent quality of Full-HD progressive images.The three primary colors of red, green and blue are each processed by a separate sensor to achieve truly rich color reproduction.Leica Dicomar LensLEICA DicomarThe 900 Series and SD800 use Leica Dicomar lenses, which are renowned for their ability to render sharp images and excellent shading. They also suppress ghosting, flare, and distortion at the image edges. Even in strong sunlight, these superb lenses maintain high contrast and resolution. A bright new F1.5-F2.8 lens with a 46mm filter diameter has been created for the 900 Series and SD800. Efficient light collection allows the new lens to capture bright, clear images even in dim lighting or at high shutter speeds. This high-end lens brings out all the beauty of Full-HD images.", "title": "Panasonic HDC-TM900K 3D Camcorder with 32GB Internal Flash Memory (Black)", "price": 990.34, "salesRank": {"Camera &amp; Photo": 5712}, "imUrl": "http://ecx.images-amazon.com/images/I/41OZNdIeSML._SY300_.jpg", "related": {"also_viewed": ["B00AW54Z7C", "B004OWWJX6", "B0072B5E2Y", "B004I43MJA", "B00HPZKQWA", "B003XREDVE", "B007JFCTCG", "B00AW54Z4K", "B004HW7E3I", "B00HPZKQJS", "B004HW7E2O", "B00AR95EO6", "B00AWZFHG0", "B00C3R14J4", "B004I43MJ0", "B0072B5E7E", "B006ZN0664", "B004TO2EWA", "B00AWZFIUU", "B00HNJWVNK", "B00AW54Z2M", "B00HNJWV1W", "B00AZD3YE6", "B004L21CVY", "B006UMMPGE", "B006K54ZNC", "B00HNJWVKI", "B00AWZFJ22", "B00AR95ENW", "B004V4YGRY", "B006UMMPMI", "B006AR5ZQ6", "B00AR95EVE", "B00322OP3Q", "B004I43MHW", "B0031RGL1G", "B004HW7E0Q", "B002I9S9PE", "B00AR95ESC", "B003QHXZTC", "B000LO92EK", "B006K5507M", "B001OI2Z2I", "B00AW54YWS", "B00HNJWVIA", "B003XPHU48", "B00HLDFTRS", "B006K54ZX2", "B001OI2YNS", "B001DKELYC", "B0072B5E4M", "B0067HTBTG"], "bought_together": ["B003VNKNF0"], "buy_after_viewing": ["B006ZN0664", "B00AW54Z7C", "B00AW54Z7C", "B003VNKNF0", "B004OWWJX6"]}}