{"asin": "B000IZDN60", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Hubs"]], "description": "Connecting USB devices to your Mac or PC is easier than ever with the Cables To Go 7 Port USB 2.0 Hub. Featuring a slim, portable design, this hub gives you seven USB 2.0 ports that let you connect an additional keyboard, mouse, MP3 player, and more. Take the hub with you wherever you go to significantly expand your desktop or laptop's capabilities.7 Port USB 2.0 HubAt a Glance:7-port USB 2.0 hub for adding devices to your computer.Overcurrent protection; self-power mode.Hard-mountable metal base can be secured onto desk.The hub easily slides into and out of the metal base that can be secured onto a desk.Expanded USB Connectivity to Meet Your NeedsWhether you're adding a new keyboard, mouse, or external hard drive to your computer, the Cables To Go 7 Port USB 2.0 Hub ensures that you'll be able to make the connection. With the hub, you don't have to pick and choose which items you keep connected to your computer. Keep your scanner, printer, or web cam connected at all times, and then use the Cables To Go 7 Port USB 2.0 Hub to charge your camera, digital music player, or other gadget.The hub can be self-powered from the USB port, and it features built-in over-current protection for peace of mind when connecting your equipment. Each port is fully plug-and-play for quick and easy connections, and the unit can be combined with additional hubs to support as many as127 devices.Hard-Mountable Design Keeps Hub Securely on DeskThe hub features a strong metal base that can be hard mounted to your desk. This keeps the hub in place even when you have multiple accessories attached to it. The hub itself easily detaches from the base for travel convenience.Compatible with Mac and PCThe 7 Port USB 2.0 Hub is compatible with both PC and Mac operating systems, and it comes with a six-foot USB cable. The hub connects to a standard AC wall outlet with the included adapter.The Cables To Go 7 Port USB 2.0 hub is backed by a one-year limited warranty.What's in the BoxCables To Go 7 Port USB 2.0 Hub, six-foot. USB 2.0 cable, AC power adapter, and installation manual.", "title": "Cables To Go 7 Port USB 2.0 Hub", "price": 30.99, "salesRank": {"Electronics": 46284}, "imUrl": "http://ecx.images-amazon.com/images/I/314GGP6YDSL._SX300_.jpg", "related": {"also_viewed": ["B00483WRZ6", "B007ETKAHI", "B000EVEH6I", "B000KUQ8FG", "B000TTTJ36", "B001IWOB4U", "B00ECTYKWO", "B0007RB280", "B0027EEB7A", "B008ZGKWQI", "B003SWEIH8", "B00DQFGJR4", "B00006B7DA", "B0006TIA8Y", "B000Q8UAWY", "B005NGQWL2", "B000A4AW8Q", "B003Z4G3I6", "B000ESN9GA", "B00008VFAF", "B003M0NURK", "B007WTHGL8", "B00GGYU8TC", "B00BWF5U0M", "B00E6GX4BG", "B00HVOTR5C", "B00IZ8N0E2", "B00IU6R2AW", "B00K8AB1MI", "B005AS337Y", "B004OBZ088", "B00B7FOQCK", "B00IJ331WY", "B00JEPIOOQ", "B00FR795WA", "B001DBF07S", "B001DBF07I", "B00D7P6176", "B005HKIDF2", "B00ELPSEVW", "B00AYQ433U", "B00EV5GZ5E", "B00GUEFS5C", "B00CJSNEA4", "B0009IIE4W", "B00DKOVVR4", "B00DQFGH80", "B000SAB34O", "B007B5OWRY", "B00A6288II", "B00475WJEY", "B002NU5O6K", "B002FFZGCU", "B00EYXZI4M", "B00GTLUMA2", "B00L232HJG", "B005A0B3FG"], "buy_after_viewing": ["B00483WRZ6", "B00BWF5U0M", "B003M0NURK", "B007ETKAHI"]}}