{"asin": "B0019UGCLG", "related": {"also_bought": ["B002JIN1IE", "B001CB2FYU", "B002JIN1IO", "B003IT72LK", "B0019UGCMU", "B001CB2G08", "B003IT72LU", "B0038RM5K0", "B001H30Y3C", "B004JKBVBY", "B006QNNQ5G", "B001R29Q96", "B003VS9RG6", "B001APNVTQ", "B008GVVTPU", "B008GVVUFE", "B004JKBVAA", "B001CBB9TC", "B008GVXKUW", "B006C4CGIW", "B00BQ94JF6", "B009CN8X3C", "B0083CYMHO", "B001ZSDC1A", "B0090EC5NC", "B001RIYUJQ", "B00DE5TKRW", "B00590GH8K", "B008GVXL1A", "B006C4HK2O", "B0035WTCUO", "B0002CZVBE", "B004ZBLKC2", "B003I86C94", "B00550AWWQ", "B00791R1BO", "B008NAXAR4", "B00695OFE2", "B005O08KH6", "B003VSE2XY"], "bought_together": ["B002JIN1IE", "B001CB2FYU"], "buy_after_viewing": ["B002JIN1IO", "B004U7JYXS", "B0000C73CQ", "B002JIN1IE"]}, "title": "Polaroid CZA-20011B PoGo Instant Mobile Printer (Black)", "price": 109.95, "salesRank": {"Electronics": 4834}, "imUrl": "http://ecx.images-amazon.com/images/I/31G5YNK-a8L._SX300_.jpg", "brand": "Summit Technology Group", "categories": [["Electronics", "Computers & Accessories", "Laptop & Netbook Computer Accessories", "Batteries"]], "description": "Polaroid has reinvented instant photography for the digital age with the Polaroid PoGo Instant Mobile Printer. Sleek, stylish, and easy to use, the Polaroid PoGo Instant Mobile Printer lets you share photos whether you are on vacation or just hanging out with your friends. Bring Polaroid magic from your camera cell phone or digital camera with ZINK Zero Ink Printing Technology from ZINK Imaging. Mobile and easy-to-use, the Polaroid PoGo Instant Mobile Printer provides a new, innovative way to share digital photos directly from your camera cell phone or digital camera, instantly. The Polaroid Way.Print and share2 x 3-inch borderless color images in under a minute.As mobile as you arePocket-size, sleek, stylish design.Instant magicPrints without ink using ZINK Zero Ink Printing Technology from ZINK Imaging.How it works: Polaroid magic for your digital camera or camera phoneCamera PhoneThe Polaroid PoGo Digital Instant Mobile Photo Printer is the easiest way to print photos from a camera phone. Wirelessly transfer images from a Bluetooth-enabled camera phone to the Mobile Printer and print instantly. Using the built-in OBEX (object exchange profile) Bluetooth in the phone and the printer, connecting and printing becomes instant.Digital CameraInstantly printing images from a digital camera is as easy as connecting the USB cable to the PictBridge-enabled camera and printer. Once connected, follow the PictBridge screen on the camera display. Simply select what image to send to the printer and within 60 seconds, the print is ready to be shared.ZINK Technology: A radically new way to print -- instantlyZINK stands for Zero Ink - a new and simpler approach to printing where high quality, colorful, durable and affordable prints are magically created -- all without a drop of ink. The ZINK Technology, invented by ZINK Imaging, encompasses both the ZINK Paper and the intelligence embedded in every ZINK-enabled device. Over 100 patents and patents pending were generated in the development of this breakthrough technology.The heart of this new \"ZINK\" category of printing is the ZINK Paper. The patented ZINK Paper is an advanced composite material with embedded yellow, magenta and cyan dye crystals, activated with 200 million heat pulses, in 30 seconds, in a single pass. With 100 billion crystals in a 2 x 3-inch print, the paper is 100-percent inkless. A ZINK-enabled printer uses heat to activate and colorize these crystals. Because there is no ink, every ZINK-enabled device has the unique benefits of being small, simple and elegant.Polaroid is leveraging the ZINK Technology to bring a new family of digital instant products to the marketplace. The Polaroid Digital Instant Mobile Photo Printer is the first ZINK-enabled device available.Compatability: Is your cell phone compatible?While the Polaroid PoGo Instant Mobile Printer is compatible with most cell phones, some phones are not.Find out if your cell phone is compatible."}