{"asin": "B000VXYV6K", "related": {"also_bought": ["B000FPCDRS", "B001AHAU5M", "B001AH7I98", "B000HSAK3C", "B000BQSLFY", "B001B2R5U4", "B000H5QDVI", "B000HHSC2O", "B00BPQEOMS", "B0042XAP2Y", "B00BPQEQQC", "B000BO0Y1K", "B000FK0334", "B00BIDYPQI", "B00BG9A8D8", "B005MNJFVA", "B0042XAP38", "B00BGBU2LY", "B005MNJOA2", "B000NOWRYK", "B000BO4QGY", "B0079GH2JK", "B0046ECYRS", "B00GBVCFJ6", "B000HHO9EE", "B00BIDYPRC", "B000IK0ML4", "B0002YTO2Y", "B00536X0AS", "B00EQEY1UG", "B00BPQEOJQ", "B000HHJIWW", "B000HHO3ZY", "B000SE6DP4", "B000GF0WX4", "B000QWPWDM", "B00846NTRI", "B00771WQIY", "B000071NUS", "B0002DK91U", "B002MHFXS8"], "also_viewed": ["B0000AVVPU", "B000HHO9EE", "B001AH7I98", "B000LP8CHM", "B0042XAP38", "B007NCJZ04", "B0042XAP2Y", "B0079GHC86", "B0079GHC8Q", "B00099FAK2", "B002ZFC088", "B00J4966V0", "B00536X0AS", "B002GQDUBW", "B000FPCDRS", "B004ES0AWW", "B001AHAU5M", "B0071D0LA8", "B0001ZWZ8O", "B000JCJG36", "B00AZA1ZWC", "B007Y47XLO", "B001JP7G2A", "B000BO0Y1K", "B0055L8RRC", "B00HFODTYI", "B000TZ8SFU", "B005UUT8X0", "B00D9U8MBW", "B005MNJOA2", "B0001ZWZ9I", "B00BPQE130", "B002BB0AHO", "B00EYZQ7J0", "B000BQSLFY", "B008M14YU6", "B005HC32N8", "B00GHYMFAG", "B0006V8L18", "B007RKKTNO", "B00BPQEQQC", "B000GF1O4K", "B003P443C4", "B005HC32EC", "B00ETAIE0A", "B000A76ZYS", "B004LTXSY6", "B003WNCSQ6", "B00D73RCAI", "B0040BCBZC", "B0050BP054", "B000HHOHFK", "B00GGS4Q8M", "B00L7DRL8S", "B00062F6NI", "B000BWZB74", "B000FJX7U6", "B00GSF5T6G", "B00HQOO7LG"], "bought_together": ["B000FPCDRS"]}, "title": "Havahart SS-750RPX AC-Powered Electric Fence Kit for Pets and Small Animals 1-Mile Range", "price": 40.0, "salesRank": {"Patio, Lawn & Garden": 5884}, "imUrl": "http://ecx.images-amazon.com/images/I/414N81SFp4L._SX300_.jpg", "brand": "Havahart", "categories": [["Patio, Lawn & Garden", "Pest Control"]], "description": "Whether you want to keep pets in or small, unwanted animals out, the Havahart Electric Fence Kit is the perfect solution. The Electric Fence Kit can also be used to deter a pet's bad habits. The fence's mild shock delivers a correction without harm, quickly teaching them where they're not supposed to go. Or, use the fence to protect flowers, shrubbery, gardens, and trash from unwanted intruders.SS-750RPX AC-Powered Electric Fence Kit for Pets and Small Animals One-Mile RangeAt a Glance:Keep pets in and unwanted small animals outTrain your pets with a harmless, mild electric shock correctionEnergizer powers an electric fence of up to 1 mileKit comes complete with everything you needOne-year limited warrantyThis kit offers a safe way to train your pets and protect your gardens from unwanted critters.View larger.Keep Pets in and Unwanted Small Animals OutThe Havahart Electric Fence Kit is perfect for containing your pets, and for training them to stay out of certain areas. The electric fence delivers a mild shock that won't hurt your pet while providing correction to teach them where the off-limit parts of the yard are. The same fence will also keep unwanted small animals out, protecting your flowers, shrubbery, gardens, and trash. Please note that the fence is designed for dogs 15 pounds or more, and over 6 months old.Provides Up to 1 Mile of FencingThis kit comes with everything you need to power up to 1 mile of electric fencing. It includes an energizer, ten 23-inch PVC fence poles, a 22-inch ground rod, 50 cotter pins for fastening the wire, a ground clamp, and two extra fuses. The kit also includes 100 feet of aluminum wire, and additional wire can easily be added.The Havahart Electric Fence Kit is backed by a manufacturer's one-year limited warranty.What's in the BoxEnergizer, 10 fence poles, ground rod, 50 cotter pins, ground clamp, 2 extra fuses, 100 feet of aluminum wire, and instructions."}