{"asin": "B0032XJDJ6", "description": "Experience film and television in spectacular high-definition clarity on your PC with the Samsung Blu-Ray Internal SATA Drive with Lightscribe SH-B083L/RSBP. This high-capacity Blu-Ray drive not only plays Blu-Ray discs, but it also records to CDs and DVDs, allowing you to capture your favorite TV show or home video footage with high-quality results. The included Cyberlink BD Software Suite helps you burn discs, create slideshows, and more. And with Lightscribe, you also get disc labeling for quick and easy identification. Move beyond low-resolution entertainment and enjoy a rich, cinematic experience with the B083L.Blu-Ray Internal SATA Drive with Lightscribe SH-B083L/RSBP (Black)At a glance:Spectacular Blu-Ray HD on your computerWatch standard DVDs in HDGet the most out of Blu-Ray with the BD AdvisorRecord your favorite TV shows and copy your home videos to DVDIncludes Cyberlink BD Software SuiteDrive plays Blu-Ray and records to DVD and CD.See the difference in picture quality when watching DVDs with the B083L.View larger.Movies in Blu-Ray and Brilliant HDWith the B083L, you can enjoy an intense cinematic experience right in your living room. The drive maximizes Blue-Ray resolution, and even gives your DVDs a high-definition edge that is difficult to achieve with most standard DVD players.Using Samsung's Up-Scale technology, the drive transforms your old DVD collection into vibrant high-resolution movies, improving your entertainment experience. You'll instantly upgrade your entire video collection and enjoy a cinematic boost without having to purchase any new DVDs.Convert Videos to DVD; Record TV ShowsIt's easy to convert your favorite videos into DVDs. Simply connect your DV or HDV camcorder to your computer, and burn your videos onto disc in the format you prefer: mpg, mp4, or avi. And to capture your favorite television shows, just match a TV tuner card with your PC and burn shows to DVD.Sporting a sleek, compact design, the B083L Blu-Ray Drive features a mirror-style front door and blue light LED. And it operates with less noise and power than most other drives.Cyberlink BD Software SuiteIncluded with the B083L is a generous software suite featuring PowerDVD 8, Power Producer 5, Media Show 4, and much more. The software guides you through the process of burning discs, organizing videos, creating photo slideshows, and virtually anything else you want to do with your collection of movies, television, and photos.Additionally, the BD Advisor online tool helps you understand all the basics of interactive Blu-Ray technology so you'll stay up-to-date with the latest innovations. Test your computer system and check for upgrades, all through the user-friendly BD Advisor.What's in the BoxSamsung Blu-Ray Internal SATA Drive with Lightscribe SH-B083L/RSBP (Black) and Cyberlink BD Software Suite (includes PowerDVD 8, Power Producer 5, Media Show 4, Power 2 Go 6, Instant Burn 5, Label Print 2, and BD Advisor 2).Features a mirror-style front door and blue light LED; quiet and energy-efficient for less environmental impact.", "title": "Samsung Blu-Ray Internal SATA Drive with Lightscribe SH-B083L/BSBP (Black)", "price": 61.5, "imUrl": "http://ecx.images-amazon.com/images/I/41PbSGri%2BgL._SX300_.jpg", "related": {"also_bought": ["B006EWUO22", "B006VAD2C6", "B0026ZPFCK", "B0088PUEPK", "B004CRSM4I", "B009GUXU52"], "buy_after_viewing": ["B004SUO068", "B007YWMCA8", "B0088PUEPK", "B007VPGL5U"]}, "categories": [["Electronics", "Computers & Accessories", "Computer Components", "Internal Optical Drives", "Internal DVD Drives"]]}