{"asin": "B0001G6U48", "description": "Canon raises the stakes for professional photography with its EF 28-300mm USM ultra-high magnification zoom lens with image stabilization. This handy, compact zoom lens offers versatility, easy subject selection, and the highest optical performance in its class. The 11x zoom range covering everything from wide-angle to telephoto, and you can focus in on subjects as close as 2.3 feet. A powerful ring-type USM drive provides silent. Featuring a dust- and moisture-proof \"white lens,\" it is designed to appeal to professional EOS photographers looking to reduce lens changes and the number of lenses they need to carry.Image StabilizationThe lens incorporates Canon's Image Stabilization (IS) technology, compensating for approximately three stops without any perceptible increase in image blur when shooting static subjects or panning. This increases the range of circumstances in which hand-held photography is possible, limiting the need to carry a tripod.Fast Auto-FocusThe inner focusing ring-type ultrasonic motor (USM) converts ultrasonic vibrational energy into rotational force to deliver high-speed, high-precision, super efficient and virtually noiseless auto focusing, with good holding torque for rapid response, accurate stopping. Full-time manual override without damage to the autofocus mechanism is featured. Minimum focusing distance is just 0.7m throughout the entire zoom range.Ready for Digital PhotographyThe lens shape and coatings have been optimized to suppress ghosting and flaring, making this lens ideal for use with digital cameras that are more susceptible to reflections off the recording media than are film cameras.Precision OpticsThis lens features 22 elements in 16 groups for low distortion, high corner-to-corner resolution throughout the entire zoom range. As with all EF lenses, aperture is controlled with an EMD (electromagnetic diaphragm) for fast, quiet, highly precise control and incorporates a circular aperture diaphragm for beautifully pleasing background blur, from full aperture to two stops down.The use of 3 Ultra-low Dispersion (UD) glass elements effectively curtails the residual chromatic aberrations that can plague lesser quality long lenses, while aspherical elements correct various kinds of aberration that occur during zooming to give the lens the unsurpassed clarity and resolving power that are the hallmark of professional L-series lenses.Environmental protectionThe EF 28-300mm f/3.5-5.6L IS USM features a rugged dust-proof and drip-proof construction, designed for professional photographers working in harsh environments under a wide range of operating temperatures and humidities.", "title": "Canon EF 28-300mm f/3.5-5.6L IS USM Lens", "brand": "Canon", "imUrl": "http://ecx.images-amazon.com/images/I/41EGM75Z99L._SX300_.jpg", "related": {"also_bought": ["B0007NIB6U", "B00004ZCJM", "B0000BZLBQ", "B001KELVS0", "B0027JM35M", "B007FGYZFI", "B000NP46K2", "B0000BZLAC", "B007FH1FZ0", "B00004ZCI3", "B0040X4PV8", "B007FH1KX2", "B0040X4OZU", "B0033PRWSW", "B007FGZ1V0", "B000I1YIDQ", "B004OVE188", "B007M4FFKW", "B00007GQLS", "B0093HGF32", "B0040X4PUE", "B005Y3T1AI", "B000EW9Y4M", "B0076BNK30", "B00004ZCK0", "B004OR15LI", "B009B0MZ8U", "B00009XVA3", "B00009R9EO", "B0009K7CZC", "B007FH1KAU", "B00004ZCL2", "B007C0VHVM", "B002NEFL8W", "B007C0VHTE", "B00004ZCJD", "B00DMS0GTC", "B00D6XW62I", "B005HWC6PI", "B0040X4PQI", "B0039VYN1Y", "B002NEGTSI", "B000BH5OW6", "B006G5ZVA2", "B00A2BWBNQ", "B007BXD66E", "1285084535", "B004QDN2ZC", "B007FEFQDA", "B004861IX0", "B007109ZA8", "B002P370AI", "B0049H89F8", "B00ETB8BD4", "B004S8GUZO", "B00009R6WO", "B007NDL56A", "B009EM694G", "B004861KAQ", "B0000BZL8H", "B00009R6VZ", "B009YTVFAW", "B000A1SWOA", "B0049XGNKK", "B002L60TTI", "B00FAYL1YU", "B001G5ZTLS", "B0000BZLAD", "1285434625", "B00B30N7AQ", "B001CCAISE", "B007FH1LJU", "B002NO7PWC", "B00009R6WY", "B003Z6R33I", "B0000CBBNM", "B00A8E0R0G", "B00AA48DVO", "B004AH10K8", "B0037NX6JY", "B002NEGTTW", "B0010HA6A6", "B0000BZL9J", "B00009R6WT", "B006C0J8ZU", "B007SXJ26A", "B0000BZL83", "B0042UQFFI", "B000V5P94Q", "B000AZ57M6", "B003Y30334", "B005LFT3UW", "B0002E3WKO", "B00009XVDB", "B002WR7VSS", "B001ASU1QO", "B007NDL54C", "B002N5NRSC", "1118169115"], "bought_together": ["B00004ZCJM"], "buy_after_viewing": ["B0000BZLBQ", "B0033PRWSW", "B001KELVS0", "B00004ZCJM"]}, "categories": [["Electronics", "Camera & Photo", "Lenses", "Camera Lenses", "Digital Camera Lenses"]]}