{"asin": "B00002STFD", "description": "There was a moment when I first began playing Shadows of the Empire when I actually believed I was a living, breathing participant in the Star Wars universe. The game's glorious first level (in which you take the controls of a snowspeeder in a gallant attempt to destroy evil Imperial Walkers, droids, and other machines on the ice planet of Hoth), is a flawlessly executed piece of video gaming: clear mission objectives, silky smooth controls, outstanding graphics, fantastic sound effects, and a true sensation of flight. I stared at the screen in awe as I made my first approach toward an Imperial Walker. Laser fire screamed past my ship as I angled to connect a tow cable to a Walker and wrap it tightly around its legs. And then it happened: The lumbering monstrosity seized up, its legs buckled, and the beast crashed to the ground in a huge fireball. I felt like jumping out of my chair and shouting to the world: \"Yes! Yes! This is what video games should be! This is what I've been waiting for!\"Unfortunately, the remaining nine levels never even come close to matching the quality of the first. And perhaps it is the game's stunning first level that makes the rest of Shadows of the Empire such a letdown.On the Star Wars timeline, Shadows of the Empire takes place during and after the events of The Empire Strikes Back. You play the role of Dash Rendar, a mercenary for hire who decides to take up the cause of the Rebellion. In a storyline that is never particularly engaging (due in large part to the rendering of the plot with still-life pictures and lines of text oddly reminiscent of the 16-bit gaming era), Dash finds himself knee-deep in the search for the frozen Han Solo, and in the company of Luke Skywalker and Princess Leia. Dash's ultimate mission is to unseat the Dark Prince Xizor, who is determined to murder Luke. While playing Shadows of the Empire, you control Dash as he struggles through ten levels of play, which encompass piloting a snowspeeder, doing battle in the Outrider (a ship resembling the Millennium Falcon), cruising on a speederbike, and running on foot through several levels of Doom-style, first-person shooting.On the surface, Shadows of the Empire looks like a sure winner. But the game simply doesn't deliver the goods. It is difficult to control Dash's movements. The Nintendo's analog controller, so well-suited to Mario 64, does not perform well for the many levels of first-person action. Because it's difficult to move in a straight line, you constantly have to worry about falling off ledges or small platforms. Combine this faulty movement feature with the game's aggravating save system (like other LucasArts games, save points are few and far between), and losing a life from walking off a cliff becomes especially frustrating.The camera angles are also a nagging problem. Four fixed views are available, though none of them is fully satisfying. The first-person view offers the best gameplay, but it limits your field of view; the second-person behind view offers a better view, but Dash's body squarely blocks your line of sight; the view from above has limited utility; and the view from in front of Dash is a throwaway. Finally, beating the game's several bosses ranges from difficult to nearly impossible, thanks in large part to the game's auto-save system. Being forced to begin a level from the beginning when a boss brings you down can turn the game into a tiresome chore.In all fairness, Shadows of the Empire certainly excels in some areas. The game's ambiance is often remarkable; at times you truly feel you are lurking in the bowels of the Empire's darkest corners. Confronting lifelike Stormtroopers is a treat. The graphics, while at times oddly sterile (monotone gray hallways and endless sand-colored canyons abound), are still generally convincing. Many of the sound effects, such as ships' engines, laser fire, and explosions, are perfect. Moreover, the gameplay is varied - few games offer flying, driving, swimming, and first-person shooting all in one package.If Shadows of the Empire had lived up to its first inspiring level, it would certainly have been in the running for game of the year. As it stands, the control, camera angles, and frustrating save feature keep it from reaching its full potential. Programming for the Nintendo 64 is reportedly a daunting challenge, and perfecting the use of a true 3-D environment and analog controller will certainly take some time. Hopefully, the next Star Wars title for the Nintendo 64 will come closer to what Shadows of the Empire aspires to be. --John Broady--Copyright &copy;1999 GameSpot Inc. All rights reserved. Reproduction  in whole or in part in any form or medium without express written permission of GameSpot is prohibited. GameSpot and the GameSpot logo are trademarks of GameSpot Inc.--GameSpot Review", "price": 189.99, "imUrl": "http://ecx.images-amazon.com/images/I/51EFb9F6sRL._SX300_.jpg", "related": {"also_bought": ["B00000DMB2", "B00000J2OO", "B00000DMAT", "B00000ID61", "B00002STGL", "B00000DMB5", "B00002STI2", "B000031KJT", "B00002STH0", "B00000F1GM", "B00002STEZ", "B000056FLI", "B00002DHEV", "B0015OG4G4", "B00001TZYA", "B00002STGN", "B00000DMAX", "B00005M8TL", "B00004UG9B", "B00001QES1", "B00004S9AA", "B00000INR2", "B00003OTI3", "B00000I1BB", "B00000ID60", "B00000DMAO", "B00000J2W7", "B005GTNBGK", "B00000JQ0V", "B00002STH5", "B005GTND0E", "B00002STFH", "B000Y0CHX4", "B000031KJM", "B000038A6U", "B00000DMAQ", "B000PJHAD6", "B00000K2G7", "B00002STFP", "B00002STGU", "B00004S9A7", "B00004TUF1", "B00000I1BE", "B002TK1PX0", "B000QHOHHE", "B00000DMB9", "B000021Y2Z", "B000YOCGUO", "B003UI5GLC", "B00004WLMA", "B00004U1QY", "B005GTNC8W", "B000021Y30", "B00000IFRI", "B0009Y808Q", "B00001X5C3", "B00004R9IB", "B00002STGQ", "B003ZU0PHU", "B00002970G", "B00004U1R2", "B00002STHX", "B00005ME6D", "B00001WRJO", "B00001QERY", "B00004SWLT", "B00002STFN", "B000038A7C", "B000J3O194", "B005DI7N7W", "B00001TZYB", "B009MRZAUC", "B00000F1GS", "B00000K2GI", "B000F9JFXE", "B00004THPG", "B00001OX4T", "B00004U1R3", "B000JVM256", "B00004TN2T", "B00003E4EB", "B00000K1AF", "B00005C4IE", "B00004U1R1", "B00002STF6", "B00001P4VO", "B00002STYC", "B00005AW1W", "B00000IKCG"], "bought_together": ["B00000DMAT"], "buy_after_viewing": ["B00000DMB2", "B00000DMAT", "B00000F1GM", "B002TK1PX0"]}, "salesRank": {"Video Games": 2174}, "categories": [["Video Games", "More Systems", "Nintendo 64", "Games"]]}