{"asin": "B003WOLM62", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "This, That and Everything! HD CommunicationShare your movies over the webUpload your favorite movies. It's a snap!Easy Web Uploading. (HD Write PE 1.0 Embedded Software*)Upload your movies onto YouTube, Facebook or anywhere you want. As soon as you plug the TA1's built-in USB terminal into a PC, the embedded HD Writer PE 1.0 application launches automatically. With operation this easy, you can instantly share your movies with the world.* For Windows OSIntuitive operation makes it easy. No confusion here!Simple OperationJust press the Rec button to record. Then press the Play button to see what you've got. Operation is easy because each button has a single function. So you can enjoy shooting as soon as you pick up your new camera.Ideal for Mac and PC Users.iFrame ModeThe TA1 lets you record movies with iFrame. When using iMovie, the iFrame video data in your camera is the same format as the one you'll be using to edit, so importing is fast and file sizes are small. You'll be able to edit and upload movies to the internet and portable devices right away. Iframe is based on standards, so it works with compatible PC andMac applications, such as Apple iMovie and PC applications.USB is built-in for direct connection.Built-in USBThe TA1's built-in USB terminal means that there's no need to carry around a cord and an adaptor. And you can charge the battery by simply plugging the USB terminal into a PC.* Do not use any other USB extension cord except the supplied one. (Operation is not guaranteed with any other USB extension cord.)Connect the TA1 to a PC and...It's a web camera!Works with SkypeThe TA1 is compatible with Skype, the video call program. Talk face to face with faraway family and friends. Go ahead, try some visual communication with the TA1.*The use of a high-performance CPU is recommended for video conferencing with high-quality images.Easy Functions for Versatile Shooting.Take it everywhere you go. It's snapshot easy!Compact sizeEven with its compact size and super mobility, the TA1 lets you shoot full-HD movies and photos. Just slip it into a pocket or hang it from your wrist. It goes wherever you go. Perfect for capturing everyday fun.Save your memories, in all their beauty.Full-HD (1,920 x 1,080) RecordingRecord high-quality full-HD (1920 x 1080/30p) movies with this handy little compact. Save those fun moments forever in beautiful HD images.*Full-HD video with 1920 x 1080 pixels\" in Panasonic's home-use HD mobile camera refers to video recordings with 1920 pixels in the horizontal direction and 1080 pixels in the vertical direction.Fight hand-shake to record crisp, clear images.E.I.S. (Electrical Image Stabilization)The E.I.S. (Electrical Image Stabilization) system helps to correct the kind of hand-shake blurring that often happens with compact cameras. Record all the images you want, whether you're shooting while walking, or taking self portraits, without having to worry about blurring.Get Creative!Effect functionGive the image some warmth with Sepia mode, make it extra cool with Monochrome mode, or capture beautiful skin tones with Soft Skin mode. Match your shooting to your mood and subject.Save thoes precious moments.Still Picture RecordingThe TA1 lets you save a smile from someone special, or capture the beauty of flowers bathed in sunshine. You can save memories like these in high-quality images with 8-megapixel resolution.**Records 8-megapixel still images with 5 million effective pixels.Cut out special moments from your movies.*Still Image CaptureYou can cut out and save a still image by simply pressing the Still Picture button right when the desired image appears on the TA1's LCD monitor. This ensures that you'll never miss that perfect shot again.*Still images cannot be cut out while shooting a video.*The size of the cutout still image is the same as that of the video image.Dark scene? No problem.LED Light for Shooting in Dim LocationsThe built-in LED lets you capture bright, crisp images even in dark situations, like indoors or during nighttime events.**The LED light does not go on when operating in Web cam mode.", "title": "Panasonic TA-1 Ultrathin HD Pocket Camcorder Enabled with Skype and iFrame (Dark Grey)", "price": 17.12, "salesRank": {"Camera &amp; Photo": 6901}, "imUrl": "http://ecx.images-amazon.com/images/I/31hfRNyW7pL._SY300_.jpg", "related": {"also_viewed": ["B006KDQFLY", "B0043D4V8M", "B002HOPUPC", "B0043CVH2Q", "B004FLL5AE", "B00AW54ZF4", "B0040702HA", "B0040702IE", "B0072619RI", "B0030MITDK", "B006L6ZU84", "B00AW54ZGS", "B005G81E9M", "B0031RGKVC", "B00BF9HZT4", "B004FLL5BI", "B0023B14U4", "B005G81EAQ", "B009GLINO4", "B001QWKI8K", "B004SNCWJW", "B004FLL5AO", "B003WOLOLU", "B004H8FNBC", "B006K551LM", "B004GKLW84", "B00514DXAE", "B0044DEEJC", "B0043CWU22", "B006P8C1Y4", "B003VTZE4Y", "B0030MITLW", "B00843ESYY", "B0040702HU", "B001O94GNS", "B001LK8P14", "B004AP9FSE", "B002S53CK0", "B008MOWPI6", "B0031RGKV2", "B001BO7R00", "B004FLL5B8", "B007261A6I", "B005JXADRS", "B002HOQ08S", "B005LESQLA", "B004TS0G80", "B00B4ADQME", "B003DZ122O", "B0040702IO", "B003Z6QHSK", "B002JPJII4", "B0023B14TK"], "buy_after_viewing": ["B003VNKNF0", "B00B7ID99I", "B004AND0QO", "B0045DT2CK"]}}