{"asin": "B002BZFSYA", "categories": [["Electronics", "Car & Vehicle Electronics", "Car Electronics", "Car Audio", "Speakers", "Coaxial Speakers"]], "description": "Infinity's 6-1/2-inch 6032cf is a two-way loudspeaker with Plus One woofer cone and edge-driven textile dome tweeter, and offers an ideal--and simple--upgrade to your factory drivers. Infinity's Unipivot tweeter can be pointed toward listeners even when the speaker is mounted off-axis, for a an optimized stereo image.The Infinity Reference SeriesInfinity's Reference Series has been engineered to deliver best-in-class performance for those looking to replace or upgrade their factory speakers. Features like Infinity's Plus One (patent pending) woofer cones and edge-driven-dome tweeters have helped position Infinity Reference as the number-one line of automotive loudspeakers for the past six years straight.An ideal upgrade to your factory drivers.Infinity 6032cf FeaturesPlus One woofer conesThis patent pending technology deliver a cone with more surface area than competing models of the same size. The result is increased bass output and higher efficiency.True Four OhmsAll Reference speakers feature two ohm voice coils. Original factory-installed speaker wiring in many cars is 18-22 gauge. This wire, and heating in the voice coil when power is applied, increase the impedance \"seen\" by the amplifier or head unit. The impedance of Reference Speakers has been adjusted to compensate for this increase and can be safely driven by any head unit.Edge-driven textile dome tweetersThese are not commonly used w-domes, but fully-edge-driven domes like those found in better home audio speakers. The benefit is increased power handling and reduced distortion at high output levels. This technology also allows for better integration with the mid/woofer.UnipivotInfinity's Unipivot (patent no. 6,002,780) allows the tweeter to be pointed at the listener's location even when the speaker is mounted off axis. This optimizes the stereo image and ensures a more uniform response.Tweeter level adjustmentThe 6032cf also features a tweeter level adjustment located on the front of the speaker and can be set at the reference level of 0dB. If the speakers are located low in the doors or if you are looking for a brighter sound, set the tweeter at +3dBRubber surroundsThis material provides optimum cone-edge suspension and absorbs distortions that may travel up the cone edge, adding stronger low-end.Infinity 6032cf SpecificationsPower Handling, RMS:60 WattsPower Handling, Peak:180 WattsSensitivity (2.83V @ 1m):93dBFrequency Response:53Hz - 21kHzImpedance:2 OhmsMounting Depth:2-1/16 inches (52 mm)About InfinityInfinity was founded in 1968 on a unique blend of technology, performance, and design. Today, Infinity offers three tiers of automotive speakers comparable to the best home-audio components. Infinity Kappa Perfect, Kappa, and Reference Series speakers deliver performance that rivals the best the competition has to offer.What's in the BoxInfinity Reference 6032cf 6.5-Inch 180-Watt Two-Way Loudspeaker (pair), Installation Hardware, User ManualInfinity Reference Series Multi-element OptionsMulti-elements are clearly the easiest way to upgrade your system. They consist of an integrated tweeter and midrange/woofer. These speakers are designed to fit right into your factory locations with few, if any modifications. Infinity offers two extremely compelling lines of multi-element loudspeakers. Our Reference Series represents perhaps the best value of any premium brand in its price range, and our Kappa Series multi-elements are simply spectacular. These speakers have won numerous awards for their incredible audiophile-grade performance.Infinity Reference 3032cf 3.5-Inch 75-Watt Two-Way LoudspeakerInfinity Reference 4032cf 4-Inch 105-Watt Two-Way LoudspeakerInfinity Reference 5032cf 5.25-Inch 135-Watt Two-Way LoudspeakerInfinity Reference 6032cf 6.5-Inch 180-Watt Two-Way LoudspeakerInfinity Reference 6432cf 4 x 6-Inch 120-Watt Two-Way LoudspeakerInfinity Reference 6832cf 6 x 8/5 x 7-Inch 180-Watt Two-Way LoudspeakerInfinity Reference 9632cf 6x9-Inch 300-Watt Two-Way LoudspeakerInfinity Reference 9633cf 6 x 9-Inch 300-Watt 3-Way Loudspeaker", "title": "Infinity Reference 6032cf 6.5-Inch 180-Watt High-Performance 2-Way Speakers (Pair)", "price": 49.0, "imUrl": "http://ecx.images-amazon.com/images/I/51A8MA8-4zL._SX300_.jpg", "brand": "Infinity", "related": {"also_bought": ["B002CMUL30", "B002CIU78I", "B002BS5YAA", "B0029QI7KI", "B002BZE36E", "B002A98OMA", "B0093X7HX8", "B002C8AFEE", "B002CMUKZY", "B0007WTEVM", "B002BYV7Y6", "B007SNI68U", "B0002BBP7Y", "B0002BEPJY", "B000NWEJWA", "B0039Z3SRA", "B000NWCIE6", "B0028ARP1W", "B007ZQGZWO", "B0002BEUZ8", "B0015A8Q7S", "B000Q69P40", "B0028AYIXK", "B000FKP7TY", "B001TDKJUI", "B0072XTFI6", "B002GHBUFY", "B000RNS2UA", "B00029X1O6", "B0002BEQWK", "B000Q8AMC2", "B0038FNIBW", "B0019G2HA0", "B000NWCIEG", "B0002VM8RU", "B0007WRQH6", "B000TD900O", "B004T0WFVE", "B0002BF0DE", "B0091UW7F6", "B00BF6HWF4", "B00B4PJC9K", "B00F6X1ZPK", "B00DGJEUO4", "B004309LTE", "B0050I6KII", "B0028AVGEO", "B0080FDDOC", "B00FP3IKW2", "B00CCIK9CW", "B0007TJDFW", "B00H5A8OBK", "B00020CB2S", "B0007WW65I", "B00B43LKV0", "B005VFXNS0", "B003KN2TGM", "B0068XYNH4", "B00E0EW3ZW", "B004S4XNEO", "B0017LFSXU", "B000LNBLTK", "B007ZQVKYM", "B003KN2TF8", "B000NWG3S8", "B0002BEQN4", "B000P0LRUM", "B003TUNRGM", "B003GSLE4O", "B0002QYSA0", "B007JV7F4W", "B0016GV1UU", "B0002BG6QY", "B0002BEX8W", "B00BHSTUO6", "B005HQ4T6I", "B00IG8E02W", "B00BF6HYAW", "B0007WTE08", "B00GN5K5WO", "B00B7IR426", "B00FB45SRU", "B00BHSTUPK", "B00020CATC", "B007ZDCGVG", "B005IY3BI6", "B002O91BEY", "B0002EXFJW", "B0089NLY0K", "B00B7YBE9E", "B000SBLM1C", "B000063TJY", "B000EIQMHS", "B00EEO4WD4", "B000K52CY2", "B006WVX9R2", "B00ARSNT7Q", "B008KNZ2S4", "B0013N0UCQ"], "bought_together": ["B002CMUL30", "B0029QI7KI"], "buy_after_viewing": ["B0019G2HA0", "B003KN2TF8", "B00A0LZHYS", "B002C8AFEE"]}}