{"asin": "B002SKKQZO", "description": "Grado headphones can reproduce as natural a soundstage from stereo recordings and provide as much listening pleasure as a good pair of speakers do. Grado headphones are free of room effects and placement problems, and they minimize any interference from external noise. They also offer portability and the ability to listen without worrying about the neighbors. With Grado headphones, you will hear recordings with greater clarity and with deeper bass than others! Beyond Grado's critically acclaimed Reference Series and the General Statement, the Professional Series PS1000 takes the best qualities of past Grado technology and merges it into one headphone that's a vital affirmation of music's presence in the present.Grado's Professional Series PS1000 is a hybrid of wood and metal extends the Grado sound to levels never before achieved. This is truly the best headphone Grado has ever produced. Throughout the audio spectrum, the Grado PS1000 delivers definitive highs, tight midrange, and rich bass. The concept of a hybrid metal/wooden headphone delivers that neutral tonality that no transducer could approach. This step up from the Grado GS1000 is so significant that audio enthusiasts are ready to sell all their headphones to own just the PS1000.The Grado PS1000 features voice-coils that are wound from ultra-high purity, long crystal (UHPLC) oxygen free copper. The copper is slowly drawn through the die in extremely small increments and is annealed following each drawing operation. Ultra-high conductivity copper yields the clearest transmission and lowest coloration possible. The sound of UHPLC copper is smoother, cleaner and more dynamic. Each headphone driver is made to Grado's high standards, then pair-matched for exact imaging. These headphones also utilize UHPLC copper in the connecting cable.The diaphragm is made of a low mass polymer, carefully formed to broaden resonant modes to reduce their amplitu", "title": "Grado PS1000 Professional Series Stereo Headphone (Discontinued by Manufacturer)", "price": 119.95, "imUrl": "http://ecx.images-amazon.com/images/I/41GzNqk3xrL._SY300_.jpg", "related": {"also_viewed": ["B001OTZ8DA", "B001BIQROS", "B0030T0QBG", "B000J1N3HW", "B0073XY5LC", "B0006GCCWW", "B005W1BXC6", "B00076VEG6", "B0006DPMUO", "B000TDZOXG", "B004C3DUFS", "B003NSBKT6", "B005N8W27I", "B0006GCCN6", "B000MVEC10", "B0055P9K38", "B004W1S0BY", "B00BF9G34M", "B0031RD3YY", "B0006DPMU4", "B004C04P46", "B00L1LXOWS", "B00B448GB6", "B0070U8KSM", "B00JFHTN1Q", "B005S3EIOS", "B00018MSNI", "B00L1NTJAW", "B007Q2O6KK", "B00D4DAREY", "B000PGAPR2", "B005W1DSU6", "B0026P4670", "B00858I560", "B007ZSYHYU", "B00H0IFE74", "B006H3MJT4", "B00KYTNU9U", "B0013D3BPE", "B00ILFB8MK", "B000F8OEDQ", "B004YSHA5W", "B00IAKEORC", "B007G8UMP2", "B00IWVRGE2", "B000056ULH", "B00890YNBK", "B0073A4FM4", "B00004SY4H", "B000KN0YEY", "B00A8LZ5GU"], "buy_after_viewing": ["B000ULAP4U", "B001OTZ8DA", "B00BW4RWH2", "B001DK1ZVO"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]]}