{"asin": "B0035LBRJO", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Compact System Cameras"]], "description": "The new Olympus PEN E-PL1 is truly greater than the sum of its parts, with a surprisingly small camera body packed with technology normally found in bigger, bulkier and heavier professional Digital Single Lens Reflex (DSLR) cameras and High-Definition (HD) camcorders. This third-generation PEN is built for shutterbugs who always wanted better pictures and considered a DSLR, but were intimidated by the bulky size and complex interface. The new camera's simple design and easy interface enable photographers to easily create amazing images never dreamt possible.The E-PL1 equals an affordable and powerfully simple all-in-one package that travels with you to capture life in the high quality that your memories deserve.Easily Pen Your Story with a Brand-New PENThis third generation of the Olympus PEN series combines powerful features in an easy-to-use package that will make capturing your life more fun. The new direct record button makes taking videos easier than ever and the new Live Guide functionality makes it simple to learn photography techniques without requiring the skills of a pro shooter.New Direct Button for HD MoviesRecording HD movies with the E-PL1 is simple, thanks to an easy-to-reach red \"direct button\" (red record button) on the back of the camera body. If you're about to snap a photo and you realize a video would capture the spirit of the scene even better, simply press the record button and instantly you're capturing videos! Easily toggle back and forth between capturing stills and videos by using your index finger to press the shutter button or your thumb to press the red record button. Having the ability to shoot still images and videos opens up a world of imaging possibilities.New Live Guide Sets the Scene Before You ShootThe E-PL1's new Live Guide interface simplifies great photography and gets the results you desire at the touch of a button. Want more vivid or muted color in your shot? Want warmer or cooler color? Want a brighter or darker subject, or a sharper or softer background? Or maybe you want to capture the fast-moving action of your subject with a little artistic blur, or perhaps freeze the action? Simply select Live Guide and press the up and down arrows on the back of the camera to slide through numerous photographic effects. Make adjustments and watch the LCD as the effects are made live before the image is captured! Don't worry about learning technical things like f-stops, shutter speed and white balance; jump right in by composing, adjusting exposure and more before the shot is taken.Seeing the results before snapping the image ensures you are getting the shots you want, and it will change the way you photograph. Shooting Tips are also included with Live Guide, so you can leave the manual at home.Automate EverythingLive Guide is just the start of automated technologies on the E-PL1 designed to free you up to focus on your subjects instead of focusing on your camera's settings.Intelligent Auto Mode identifies the ideal setting19 Scene-Select Modes: From portraits to sunset shots, the E-PL1 is equipped with 19 Scene-Select modes for effortless picture taking, including Fireworks, Sunset, Children, Macro and Panorama, to name a few. Capturing beautiful portraits is easy with the ePortrait Mode that enables you to smooth your subject's complexion.Intelligent Auto (iAuto) Mode: When you don't want to use the scene-select modes, the iAuto mode automatically identifies what you're shooting and adjusts settings for you to capture the best result depending on the situation.Face Detection: Reduce the chance of blurred subjects in images by recognizing up to eight faces, tracking them within the image area, and automatically focusing and optimizing exposure for sharp portraits.In-Camera Panorama: Capture three images and stitch them together to create one amazing, seamless panoramic picture. Or use the included OLYMPUS [ib] software to stitch up to 10 images together for the ultimate panorama.iEnhance: With this mode the warm yellow and orange colors of a sunset are heightened to a dramatically lifelike color that's truer to what you see with the naked eye. iEnhance can be used in any mode, and automatically engages when using iAuto to enrich color in any subject.Share: Just connect the camera to an HDTV with an optional HDMI cable and use your TV remote to control playback functions and navigate the camera's menus from the comfort of your personal front-row seat. The E-PL1 records to SDHC (Class 6 recommended) media cards that can be plugged directly into many devices and accommodate large files, including videos.New Powerfully Simple Pop-Up FlashThe E-PL1 is the first camera in the Olympus PEN series with a built-in pop-up flash that makes it easy to illuminate low-light subjects, reduce red-eye and fill in dark areas. The camera is also compatible with a range of optional external flashes, including the Olympus FL-36R and FL-50R, which can be controlled wirelessly by the E-PL1 so you can dynamically control lighting as your photography skills grow.Pro-Quality ImagesHow do professional photographers capture the stunning images you see in the pages of glossy magazines and coffee-table books? Talent matters, of course, but you also need the right equipment. Rest assured that the E-PL1 has everything you need to produce vibrant, professional-quality images: a large image sensor, in-body Image Stabilization, Imager Autofocus, the proven Olympus Dust Reduction System and the TruePic V Image Processor.Standard point-and-shoot sensor vs. the PEN E-PL1 sensorBig Sensor, Not a Big BodyAt the heart of the E-PL1 is a large-size image sensor that's the same sensor as the one inside the Olympus E-30 and E-620 DSLR models. The only difference between this sensor and what the pros use is that this big sensor is inside the much smaller body of the E-PL1. This high-performance 12.3-megapixel Live MOS image sensor (eight times larger than the average point-and-shoot camera sensor) delivers excellent dynamic range, accurate color fidelity, and a state-of-the-art amplifier circuit to reduce noise and capture fine image details in both highlight and shadow areas.Stabilize All of Your LensesInstead of selling more expensive lenses that have image stabilization inside them, Olympus takes a different approach by having image stabilization built right into the body of the E-PL1. This means that any lens (Micro Four Thirds, Four Thirds and any third-party lens) attached to the E-PL1 will deliver blur-free images thanks to three modes of In-body Image Stabilization that automatically compensate for camera shake, including in low-light situations or when shooting without a tripod. Since the PEN cameras are the world's smallest interchangeable-lens cameras with image stabilization built inside the body, you can take the E-PL1 with you and capture great images, and it won't weigh you down.Track Your Subjects Wherever They RoamThe E-PL1's Continuous Autofocus (C-AF) Tracking and Autofocus (AF) Target Registration locks your subject into focus and constantly adjusts focus and brightness whether you or your subject is moving. With this mode, a simple push of the shutter release enables you to keep moving subjects in focus--tracking them from left to right and from front to back--within the frame, automatically ensuring that even active subjects, like kids playing sports, are captured clearly.The E-PL1's Imager Autofocus in Live View enables you to compose, focus and capture the shot quickly and easily without ever taking your eyes off the camera's large, 2.7-inch full-color, high-contrast HyperCrystal LCD for an easy, seamless viewing experience when shooting still images or videos. The LCD also provides a wide viewing angle of 176 degrees, which ensures that images can be composed from even the most obscure angles.This Camera Leaves Others in the DustIf you're just starting out with a camera that has interchangeable lenses, you don't have to worry about dust spots on your sensor ruining the perfect image every time you change lenses. Spend more time shooting with the E-PL1 and less time worrying about dust with the proven Olympus Dust Reduction System that produces spot-free photos with the exclusive Supersonic Wave Filter, a patented ultrasonic technology that vibrates to remove dust and other particles from the front of the image sensor, capturing them on a special adhesive membrane every time the camera is turned on.True-to-Life ColorThe E-PL1's Live MOS image sensor is complemented by Olympus' TruePic V Image Processor, which produces clear and colorful photos using all the pixel information for each image to provide the best digital images possible. The image processor is noted for accurate natural color, true-to-life flesh tones, brilliant blue skies and precise tonal expression; it also lowers image noise in photos shot at higher ISO settings (ISO 100 to ISO 3200), enabling great results in low-light situations.Easily Expand Your Creative Horizons With Built-in EffectsExpress yourself with in-camera creative features. Professional images are rarely unedited images. Video and still image pros use computer-editing software to render their images with effects that set their shots apart from the pack. Olympus appreciates that you may not have hours to spend retouching your images at the computer, so the E-PL1 incorporates editing effects inside the camera to save you time. Whether you apply in-camera creative effects while shooting an image, or apply them later to images captured without the effects, all are inside the E-PL1, so you can achieve dramatic results on the go without a computer or editing software.The E-PL1 has six in-camera Art Filters, including a new filter called Gentle Sepia. This filter gives your images and videos a soft, warm sepia cast similar to historical images from the early days of photography. The sepia tones are softer and the blacks are a true black, unlike traditional sepia images. The new filter joins Pop Art, Soft Focus, Pin Hole, Grainy Film and Diorama (the filter that makes everything look as small as the E-PL1).With the E-PL1's Multiple Exposure function available for still image capture, you are free to tell a visual story your way. The image capture options enable you to shoot one shot, then another and combine them in real time, or capture both shots separately and combine them within the camera later. Take a shot of your significant other, and overlay your self-portrait on top to figure out what your kids will look like. If you have kids already, overlay your kid's face on top of a shot of his or her favorite cartoon character for laughs. Your ability to manipulate space and time makes this new creative multimedia device a veritable time machine.You often can achieve greater photographic expression by framing a scene in a unique way. The E-PL1 provides four aspect ratios that serve as masks to frame your image to the desired proportions, including the standard 4:3 aspect ratio that is suited to an 8 x 10-inch enlargement; the 16:9 aspect ratio that will display beautifully on a widescreen television; and other popular aspect ratios, such as 3:2 and 6:6. The Multi-Aspect Shooting further expresses your creative vision when combined with in-camera Art Filters and Multiple Exposures.With the E-PL1, you have your own living library of still images, HD video and audio to remix at your command. In playback mode, you can seamlessly mix stills and movies inside the camera to create a multimedia slideshow, and dub in one of three built-in dramatic background music options to provide a soundtrack for your cinematic creation. With so many creative options, there's no limit to what you can create. Choose whether or not you want to play back just pictures, just movies or a combination; also control playing back the whole movie or just a clip.Open System Easily Grows with Your AbilityWith a basic point-and-shoot camera, you get one lens built into the camera. One lens, that's it. And it's likely a small lens, which doesn't allow a lot of light through to hit the image sensor. So, you may have a difficult time in low-light conditions. And without the option of adding more lenses, you're limited to what that one point-and-shoot lens can do. The E-PL1 solves these issues by accepting a variety of lenses to maximize its functionality. Whether shooting still images or HD video, you can add everything from an extreme wide-angle fisheye lens to a super-telephoto lens for a wide range of expressive options.The M. Zuiko Digital Micro Four Thirds lenses are designed to be more compact and portable like the E-PL1. Choose from the ED 14-42mm f3.5/5.6 zoom lens (28-84mm equivalent in 35mm cameras) sold with the E-PL1, the ED 17mm f2.8 lens (34mm equivalent), the new super wide-angle zoom ED 9-18mm f4.0-5.6 lens (18-36mm equivalent) or the high-power wide to telephoto zoom ED 14-150mm f4.0-5.6 lens (28-300mm equivalent).If you want to have even more options, the MMF-2 Four Thirds System Lens Adapter makes the E-PL1 compatible with all Olympus Zuiko Digital Specific lenses and other Four Thirds System lenses from Sigma, Panasonic and Leica. Olympus OM film-based lenses can be attached to the E-PL1 with the MF-2 OM Lens Adapter, and there are third-party adapters developed for lenses from most other manufacturers.Software &amp; Accessory Options When You're ReadyThe E-PL1 incorporates an accessory port for connecting the optional VF-2 live-finder, a detachable electronic viewfinder, or the new optional SEMA-1 external microphone adapter set (which includes the EMA-1 adapter, the ME-51S stereo microphone and a cord) for those who want to capture enhanced audio with any microphone that has a 3.5mm plug. These optional accessories easily slide into the camera's accessory port and hot shoe.Photographers who wish to hold the E-PL1 up to their eye rather than use the LCD will appreciate that the optional VF-2, which provides 1.15x magnification and a 100 percent field of view with sharp resolution, brightness and contrast. The viewfinder refreshes quickly to minimize image ghosting on fast-moving subjects. It also rotates up to 90 degrees to enable photographers to look down into it, which is useful when shooting subjects from challenging angles. The built-in diopter adjustment and high magnification offer easy viewing with and without glasses.The E-PL1 offers OLYMPUS [ib] software that includes photography workflow, browsing, editing and unique photo-organizing functions. You can organize your photos by person with automatic face-recognition technology, by location with a Geotagging function or by event. You can easily view photos on an HDTV or on the camera's LCD with the Photo Surfing or Slideshow functions. The name [ib] stands for image bridging, image browsing and image brightening. The software will be available for Windows operating systems only.Underwater Housing for Aquatic AdventuresThe new camera's compact design makes it the perfect companion for all of your dive trips. The PT-EP01 underwater case has been specially customized for the Olympus E-PL1 and is waterproof to a depth of 40 meters (approximately 130 feet). With its durable, high-quality polycarbonate construction, this Olympus housing protects the camera from water while also cushioning it from knocks and bumps on land. The housing enables viewing from either the camera's LCD screen or an optional electronic viewfinder. The flash connectors allow optional use of up to two UFL-2 underwater flash units via fiber optic cable. A nonremovable front lens port accommodates multiple Micro Four Thirds lenses.New Exterior Design, Same PEN DNAThe E-PL1 streamlines the Olympus Micro Four Thirds PEN series form. Thanks to its compact size (4.51\" W x 2.84\" H x 1.63\" D excluding protrusions) and light 10.4-ounce body, the E-PL1 won't weigh you down when you're on the go.", "title": "Olympus PEN E-PL1 12.3MP Live MOS Micro Four Thirds Interchangeable Lens Digital Camera with 14-42mm f/3.5-5.6 Zuiko Digital Zoom Lens (Black)", "price": 441.99, "salesRank": {"Camera &amp; Photo": 2246}, "imUrl": "http://ecx.images-amazon.com/images/I/41KBEsiKeVL._SX300_.jpg", "related": {"also_bought": ["B00479TG3C", "B001FA0AM2", "0470879505", "B003VXI8UC", "B002CGSYNU", "B004EC1YY6", "B0046WLBNS", "B003VNKNEQ", "B005T6V4LE", "B003JVTOA4", "B003VNKNF0", "B004EG0IIK", "B0010C2HSA", "B0035LBRNA", "B004W4EPTM", "B003A4GZUC", "B0066J6EOU", "B005FQSXFI", "B004SDZ03M", "B005VDWFQI", "B003DQVG06", "B006XXVGQK", "B001PKY2J4", "B009DL0LOW", "B002TSWTAA", "B0037VVWBK", "B001QWCW48", "B0055UFJ88", "B004IK8F32", "B003Y2WUJ0", "B0054EPPZM", "B002U4QP9O", "B003OXAFAK", "B003150B6O", "B0068Q8CPA", "B000PGCBZG", "B003EAVULQ", "B005IBSU4O", "B004DKVRDM", "B001ISKNKA", "B003EAVUMK", "B002DQTDTI", "B002CGSYNK", "B0031XYRDO", "B002IKLJVE", "B0087AV8VU", "B00I19TVU2", "B003EAS5SW", "B002CGSYNA", "B0032MVQJM", "B0043VE29C", "B003G49V70", "B00111Y292", "B003Y2XN9G", "B0051GXA7I", "B00276BLJO", "B005FDH1UO", "B003GRB4EK", "B003VNKNEG", "B003GRHI4K", "B001O882JI", "B000Q639S8", "B0045J2LVS", "1600596711", "B0053IZEN2", "B002WE4HE2", "B008VHFNK6", "B004R739ZA", "B007HST6G2", "B003EAXT5G", "B002CGSYOO", "B003P3MCXW", "B005KJH8WO", "B003MDWG68", "B003ZC8WQE", "B002G12OBO", "B0037FLUYU", "B0058PL9QG", "B001W1BSM0", "B007M54E08", "B005DNLF08"], "buy_after_viewing": ["B002CGSYNU", "B003VNKNF0", "B004EC1YY6", "B0066J6EOU"]}}