{"asin": "B005MTMFHU", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Canon SX40 HSZoom to Infinite PossibilitiesThe PowerShot SX40 HS is a versatile compact point-and-shoot camera that easily captures amazing photos and videos.The Canon HS SYSTEM boosts low-light performance with the new Canon DIGIC 5 Image Processor and a high-sensitivity 12.1 Megapixel CMOS sensor. This advanced Canon technology delivers stunning image quality with reduced noise and blur. Colors are more vibrant and white balance is true-to-life. The 35x Optical Zoom offers incredible reach and range, allowing you to shoot any scene, near or far. The Optical Image Stabilizer helps images come out steady and clear, and a 24mm ultra Wide-Angle lens makes it easy to take pictures of large groups of people, tall buildings, expansive landscapes and much more. The camera also features a 2.7-inch Vari-angle LCD for great shooting flexibility. Packed with an array of powerful technologies, the PowerShot SX40 HS is a convenient digital camera capable of brilliant image capture.&nbsp;Extreme 35x Wide-Angle Optical Zoom and 24mm LensThe PowerShot SX40 HS is equipped with a Genuine Canon 35x Zoom lens that provides the telephoto power to bring your distant subjects incredibly close. It also features a useful zoom range that begins at 24mm wide-angle and extends to 840mm telephoto (35mm equivalent). The 24mm ultra Wide-Angle allows you to create shots with dramatic perspective and makes it easy to shoot sweeping landscapes, large groups of people and tall buildings.This superb lens delivers outstanding optical performance throughout its zoom range. It&rsquo;s advanced design employs UD glass, double-sided aspherical glass-molded and ultra-high-refraction-index glass lens elements to effectively suppress chromatic aberration while maintaining a remarkably compact size. The camera uses a VCM (Voice Coil Motor) for high-speed, quiet, energy-efficient lens movement with precise control.Optical Image StabilizerHandheld shooting can often lead to camera shake, making photos and videos blurry. Canon&rsquo;s Optical Image Stabilizer is a sophisticated system that uses lens-shift technology to correct for unwanted camera movement. It makes handheld photography more practical, providing excellent image quality in many difficult shooting situations: outdoors at dusk, inside without a flash, and even at the telephoto end of the zoom range without a tripod. For photos, it enables shooting at slower shutter speeds, accommodating more low-light shooting situations than ever before without having to boost ISO sensitivity. With camera shake and vibration reduced, you get a sharper, steadier image. And because it is an optical system, there is none of the image degradation typical with electronic image stabilizers.Canon DIGIC 5 Image ProcessorThe latest-generation Canon DIGIC 5 Image Processor brings phenomenal increases in processing speed and power.&nbsp; Improved chip architecture and algorithms deliver greatly expanded functionality with further refinement in image quality.Improved noise reduction produces clearer images when shooting in low light at high ISO speeds. Enhanced i-Contrast performance adjusts differences between light and dark areas to achieve even more natural-looking results.The faster processing speed also results in faster continuous shooting capability while maintaining full image quality. The DIGIC 5 Image Processor also makes possible a new, highly advanced automatic white balance system. Whereas conventional white balance makes an overall adjustment based on a single type of light source, the new Canon Multi-Area White Balance analyzes several areas of the image to determine whether different adjustments are needed, for example, for the main subject and the background.Noise ReductionConventional Image Processor", "title": "Canon SX40 HS 12.1MP Digital Camera with 35x Wide Angle Optical Image Stabilized Zoom and 2.7-Inch Vari-Angle Wide LCD", "price": 344.0, "imUrl": "http://ecx.images-amazon.com/images/I/5140MRhTY5L._SY300_.jpg", "brand": "Canon", "related": {"also_bought": ["B005WXQO3W", "B00658AS6M", "B0039BPG1A", "B008FQNE9A", "B003VNKNEQ", "B0065MMKTG", "B0037TA83K", "B005WXI3H2", "B003VNKNF0", "B0046C8BWM", "B00CV9MIEE", "B0083WGXTO", "B008FQCSX8", "B0053V5N58", "B0064T1D3O", "B0065MMK8W", "B006YYPMC2", "B0065880YO", "B0066WEGEC", "B00857H1VG", "B004RAQVY8", "B004L7X5KU", "B004F3OYQ4", "B005WZF0UI", "B0056MHRMG", "1935763067", "B00FWFPHH4", "B006ZCCH76", "B0057G2TH4", "B00DVPG9JW", "B0064T93O0", "B002HZY5F2", "B005UP8O1C", "B004DKSC7G", "B00CV9M2JU", "B009OGHYNW", "B005NIVXDM", "B0064Q4GEA", "B006IW86E6", "B00DWIAVWY", "B006586YG0", "B009TDI0K6", "B0062AYFWG", "B00740Y910", "B005ERKVC6", "B005WXI31S", "B0049AWVO0", "B00494QFBG", "B005C4Z4CI", "B006JQTHJ4", "B00857IL1A", "B00B09K6OU", "B005QD36TI", "B00BUUV3I2", "B004H8FNEE", "B0082RRL5A", "B009D8DHOG", "B004PJJU30", "B0046CA2P6", "B00AAGBJGI", "B00CLCH0SA", "B005ERKVDU", "B003VNKNEG", "B00DNET8HG", "B000AQF4JG", "B005NIXY52", "B004XIB9T6", "B0073HSHJY", "B00480RKHY", "B003P3MCXW", "B003KQPVBE", "B004MLF4ZO", "B00330O2U8", "B002WE4HE2", "B00004WCGF", "B0037FLUYU", "B001T9N120", "B00B7ID99I", "B008IR7RKI", "B009TDGJJK", "B007X5AGXG", "B002P3KY7E", "B007BJHETS", "B0011UNMIK", "B007M54E08", "B0073HSH8U", "B004Q3C98S", "B009B0MZ1M", "B00908BMVE", "B007M51J3I", "B005I6DVC0", "B006FKS8TO", "B00812K4V4", "B007M51J42", "B00004ZCJK"], "bought_together": ["B0039BPG1A", "B003VNKNF0"], "buy_after_viewing": ["B003VNKNF0", "B009B0MZ1M", "B0039BPG1A", "B0065MMKTG"]}}