{"asin": "B000ZKA0KA", "description": "This template creates an A+ review that contains an opening paragraph, followed by three columns that cotain a left column for logo and images, a center column for lists and features, and a right column for images that can be clicked through. The last part of the template is a paragraph for more text if necessary.Intro Paragraph (Need at least 250 characters here)Get Ready for Online CombatFollowing its success as the number one online PlayStation 2 franchise,SOCOM: U.S. Navy SEALsbreaches onto the PlayStation 3 (PS3) computer entertainment system in high-definition this holiday season.SOCOM Confrontationdelivers the ultimate next-generation online combat experience made possible by the power of PS3.SOCOM Confrontationfocuses on online play and the global community and clans that support it. With support for Tournaments, Clan ladders, Leader Boards and more, this latest title in the multi-million unit selling franchise is exactly whatSOCOM fanshave been clamoring for. Additionally, players will be able to modify their appearance through facial and physical customization.A global-scale experience,SOCOM Confrontationgives players the opportunity to battle against the best and brightest from the U.S., Europe and Asia.SOCOM Confrontationdeploys with five new North African themed maps, including a 32-player version of \"Crossroads.\" Additional themed packs forSOCOM Confrontationwill be made available for download via the PlayStation Store.Left ColumnLogo Image (Assumes a logo of 200ppx)Headset Image (Assumes a logo of 200ppx)Center ColumnKey FeaturesIntense online combat experience with up to 32 players delivered in High DefinitionSeven highly detailed maps, including the most popular SOCOM map of all time: \"Crossroads\"New engine built for PS3 with advanced physics, lighting and ballistics including penetration modelingPlay as one of five special forces units: U.S. Navy SEALs, British S.A.S, German KSK, Spanish UOE, and the French 1er RPIMaUnrivaled Community Features with increased clan & ladder supportTournaments available at the regional, national and global levelsAdvanced player matching enables players to form teams with their friends or join an online gamePlayers will be able to modify their appearance through facial and physical customizationIntegration with SOCOM.com: Stat tracking, clan management tools, My SOCOM pages and moreRight ColumnImage 1SOCOM comes to the PS3View larger imageImage 2Online Combat for Up to 32 PlayersView larger imageImage 3Set Your Sights on SOCOMView larger imageMore TextIncludes Official Bluetooth Headset for the PlayStation 3 systemHeadset Features:Designed and optimized specifically for gaming useCompact, sleek and ergonomic design fits comfortably on either earEasily accessible Mute button makes it gamer-friendlyThe included charging cradle allows for convenient charging and storage of the headsetCompatible with any PlayStation 3 system game which supports headset functionalityBluetooth 2.0 compliant. Compatible with devices with Bluetooth 1.1 or higher specificationSupports Bluetooth headset and hands-free profiles for compatibility with most Bluetooth enabled cell phones and audio devices30 feet (~10 meter) operating range", "price": 59.99, "imUrl": "http://ecx.images-amazon.com/images/I/51aNTgAlqVL._SY300_.jpg", "related": {"also_bought": ["B002ELCV00", "B002I0J5JW", "B0037LVW9M", "B003URSUSE", "B002ZJNWWC", "B0050SWZHS", "B002I0K622", "B003O6KWZK", "B00503E9FY", "B0086V5V8G"], "bought_together": ["B002ELCV00"], "buy_after_viewing": ["B002ELCV00", "B0037LVW9M", "B0050SWZHS", "B002ZJNWWC"]}, "salesRank": {"Video Games": 25275}, "categories": [["Video Games", "PlayStation 3", "Games"]]}