{"asin": "B007ZT4N5C", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "TV Accessories & Parts", "TV Ceiling & Wall Mounts"]], "description": "Installation and Viewing Versatility With 0-20 degrees of tilt, this mount offers more flexibility than competitive models, making it easier to achieve the correct viewing angle. The evenly spaced holes in the mounting plate allow for successful installation in a variety of stud spacing&#x2019;s, regardless of your homes age, or construction type. All necessary mounting hardware and instructions are included. Feats of Strength Constructed from 100% high-grade steel, the 85015 will provide years of reliable performance. Designed to work with LCD and Plasma TV&#x2019;s up to 60&#x201D; and LED TV&#x2019;s up to 65&#x201D;, this mount is versatile enough to cover a wide range of TV sizes and conforms to VESA standards.The wall plate is designed to work with a variety of stud configurations. VESA compliant mounting options provide peace of mind that this unit will work with a variety of TVs up to 60&quot; and 132 lbs. UL Listed Not all mounts are created equal. ZAX UL listed mounts have been tested to UL&#x2019;s rigorous safety standards to ensure that they meet or exceed all rated specifications. For over 100 years, the UL logo has provided consumers with confidence and peace of mind. UL is a global independent safety company and their standards are among the toughest in the industry. About VESA The Flat Display Mounting Interface (FDMI), also known as VESA Mounting Interface Standard (MIS) or colloquially as VESA mount, is a family of standards defined by the Video Electronics Standards Association for mounting flat panel monitors, TVs, and other displays. What's in the Box Your ZAXTM tilting mount package will include all the necessary mounting hardware, a built-in level, and a detailed manual for an accurate installation every time.", "title": "Zax Mounts, 32&quot;-60&quot; Tilting TV Mount", "price": 22.93, "imUrl": "http://ecx.images-amazon.com/images/I/41AgJoo7r1L._SY300_.jpg", "brand": "Zax TV Mounts", "related": {"also_viewed": ["B00A7WDYYU", "B0019D6H2M", "B00AY98USQ", "B001L6EPCQ", "B001TIG36C", "B000NMFCIA", "B001OCY3RY", "B003U46SWC", "B000J3HTQG", "B00909IWUC", "B0012S4APK", "B002YUVPK8", "B001GTTEBK", "B006DTXDMO", "B003HB6XPU", "B002YV4WJS", "B00DIF2BO2", "B00BT0RT8Q", "B002TZ4CRG", "B003WUBL0S", "B00JDVVL82", "B00AU4Z74A", "B00DCEON1S", "B008OXS2SM", "B001UP0C8O", "B001SMOZPA", "B0051BJ6HG", "B001FSA8PS", "B003GRW1KQ", "B00HFYMS5Y", "B007I16U3U", "B001GTT0VO", "0972683275", "B002MYQTEI", "B000WXH1Z2", "B0081F2Z40"], "bought_together": ["B00870ZHCQ"]}}