{"asin": "B000KJQ1DG", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Camera Bundles"]], "description": "Manufacturer DescriptionGreat pictures used to require complicated and cumbersome equipment along with years of experience. Not any more. The D40 is compact, lightweight and designed specifically for ease of use, yet contains all the top-quality, high-performance technologies that you expect from a Nikon digital SLR. And with world-famous Nikkor lenses, you know you have the sharpest and most reliable optical performance available. All in a camera light enough to carry with you everywhere. Beautiful photography has never been easier.Nikon D40 HighlightsExtraordinary Nikon image qualityThe D40's high-resolution image quality is made possible by Nikon's high-performance 6.1 megapixel Nikon DX format CCD imaging sensor and exclusive Nikon image processing engine which assures stunning sharpness and color.Easy operation with intuitive controlsIntuitive controls make the D40 point-and-shoot simple, enabling even first-time SLR users to capture beautiful memories perfectly.Nikon's smallest digital SLR everAt just over 16 ounces, the beautifully styled and compact D40 makes high-performance digital SLR photography easier and more convenient than ever.The D40 is capable of shooting 2.5 frames per secondFast startup with instant shutter response: Fast startup combined with super-fast shutter response and rapid-action shooting at up to 2.5 frames per second makes it easy to freeze special moments instantly.Includes 3x 18-55mm f/3.5-5.6G ED II AF-S DX Zoom-Nikkor lensDesigned exclusively for use with Nikon DX-format digital SLRs, this ultra-compact 3x zoom offers Nikkor sharpness and versatility in a wide variety of shooting situations.Shoot at up to 2.5 frames per secondThe D40 can fire continuously at a speed of up to 2.5 frames per second, capturing high-quality action sequences of children in sporting activities such as soccer, baseball and much more.2.5-inch color LCD monitor with 3 colorful display optionsPlayback images are easy to see, and function menus are easier to use with a larger and brighter color LCD monitor. The large 2.5-inch LCD monitor enables image preview at up to 19 times magnification and has large type fonts and easy-to-view menus as well as three all-new display options: Classic, Graphic and Wallpaper.High-performance 6.1-megapixel Nikon DX format CCD imaging sensorNikon's DX format CCD image sensor delivers vivid color and sharp detail, great for making beautifully detailed enlargements of 16 x 20 inches and beyond. High resolution also provides room for creative cropping.In-camera editing functions include red-eye removalIn-camera image editingHighly versatile in-camera editing features include Nikon D-Lighting, Red-Eye Correction, Image Trimming, Image Overlay, Monochrome (Black and White, Sepia and Cyanotype) along with Skylight, Warm Tone and Color Balance filter effects. These features provide greater creative freedom without the need for a computer, for those who prefer to send pictures directly to a printer.New advanced HELP menu system with Assist ImagesThe D40's newly introduced \"assist images\" help you select the appropriate settings for many camera features by showing an example image typical of that setting as well as an advanced HELP Menu for the current item selected. The D40's Question Mark icon (?) indicates that help is available for the currently selected item; just press the help button beside the LCD monitor to see a context sensitive help page.Fast, accurate 3-area AutofocusThe D40's advanced 3-area AF system and the refined algorithms inherited from more advanced Nikon digital SLR cameras deliver fast, efficient and precise autofocus. AF refinements deliver greater precision with fast, more consistent subject acquisition and improved focus tracking for consistently sharper pictures.Enjoy easy in-camera optimizationImage Optimization OptionsThe D40's Image Optimize setting lets photographers adjust color, contrast and sharpening as well as other image settings according to the type of scene or output desired. Settings include: Normal, Softer, Vivid, More Vivid, Portrait, Custom and Black and White, each of which are automatically adjusted based on sophisticated Nikon algorithms or user-selected settings for optimum results.Built-in Speedlight with i-TTL automatic flash controlNikon's innovative i-TTL flash control evaluates flash exposure with incredible precision to achieve better automatic flash balance and deliver outstanding results. The built-in Speedlight is always at the ready and brings beautiful exposures in darkened conditions as well as adding sparkle for fill flash in outdoor situations for enhanced twilight shots or an added impact to daylight images.Bright, accurate SLR viewfinderA large viewfinder makes composition easier, and overall viewfinder brightness makes focusing in low-light photography possible. Its bright and sharp viewfinder, with 0.8x magnification, ensures precise composition.Automatic exposure with 8 Digital-Vari Program ModesEight Digital Vari-Program Modes include: Auto Flash-OFF, Portrait, Landscape, Child, Sports, Close Up or Night Portrait, each of which adjusts automatically for optimal results under varied conditions.Nikon 3D Color Matrix Metering IIThe D40's 3D Color Matrix Metering II evaluates each scene for brightness, color, contrast, size and position of shadows and highlights, selected focus area and camera-to-subject distance, comparing that information against an onboard database of more than 30,000 actual photographic scenes.", "title": "Nikon D40 6.1MP Digital SLR Camera Kit with 18-55mm f/3.5-5.6G ED II AF-S DX Zoom-Nikkor Lens", "price": 399.99, "salesRank": {"Camera &amp; Photo": 1403}, "imUrl": "http://ecx.images-amazon.com/images/I/5161FDA5N3L._SX300_.jpg", "related": {"also_bought": ["B004KU827O", "0470239468", "0470171480", "B00CV9MITY", "B001GEJPSW", "B0012OGF6Q", "B002VSM7LE", "B001KPHKIE", "B000NOEDGK", "B000O161X0", "B007H37D62", "B003E6YED6", "B00CV9M3GW", "B000NG67E4", "B00006I5J7", "B0016AQ930", "B0009HN57Y", "B000LWJ1ES", "B003XEOJU2", "B004LTF5RO", "B0061MRHZW", "1934148091", "B001ENOZY4", "B008JRXH92", "B000KWGS9K", "B004DEKH84", "B002BLJARK", "B00004ZCJG", "B0002EMY9Y", "B000ZMCILW", "B001YQ74FI", "B000A2TEWS", "B00414O79Q", "B0039BPG1A", "B002DW96M6", "B000BY52NU", "B003CMYVU8", "B000KLZGGW", "B006NPNEDQ", "B0009GZANC", "B003L1ZYZ6", "B003HMRRKE", "B003L89SU6", "B00005Y3OM", "B003USS5JC", "B003VNKNEQ"], "bought_together": ["B004KU827O"], "buy_after_viewing": ["B003VNKNF0", "B000LWJ1ES", "B004KU827O", "B003ZYF3LO"]}}