{"asin": "B00113JSCG", "description": "There?s something strange and frightening happening in the middle of New York City?s Central Park; something whispered to have been intentionally kept secret; something that players are compelled to explore inAlone in the Dark.Known today as a safe haven for New Yorkers yearning for relief from the stresses of their chaotic metropolis, history records that Central Park was built on a useless swamp, yet as the New York City skyline hurtled towards the sky over the last 150 years, making the city the most expensive real estate in the world, the park has remained untouched. Why? Civic pride? Perhaps, but the recent strange happenings in and around the park are casting doubt on that, doubts that require investigating.The return of an iconic seriesParanormal PI Edward Carnby.View larger.Stunningly spooky views of NYC.View larger.The odd wildlife of Central Park.View larger.A whole new inventory system.View larger.Enter Edward Carnby, Paranormal InvestigatorDespite the title,Alone in the Darkis actually the fifth game in a series that dates back to 1992 and centers around the experiences of Edward \"the reptile\" Carnby. A paranormal investigator by trade, Carnby is looking for answers to the strange events and horrific creatures reported in and around the park, but gets more than he bargained for when all the mysteries and terrors of the park spill out over the course of one apocalyptic night. It?s the player?s task to avoid the new frightening dangers of the park as you search for the answers to what these supernatural occurrences mean and why they are happening.Gameplay Based on Full Player ImmersionPacked full of action and vivid in its realismAlone in the Darkgoes to the extreme to keep players engaged and immersed by plunging them into the heart of the action in real-time at every turn and challenging them to survive using full movement control. The goal here is to allow players to do or at least feel that they can do more or less whatever is possible in real life, within the game.Need to avoid a blast of steam or an eruption of fire that has shot up in your path? You can simply side-step it or you can handle the obstacle with a little more panache by using the environment around you, for example by swinging around it using reachable pipes or wires. In another situation you may be challenged by attacking monsters. No problem. You can take the path of least resistance, again by side-stepping them or placing an obstacle between yourself and them, but if you are feeling like taking out a little aggression you can pick up a board, chair, box, etc. and have at it. Nearly anything that you come across that would be usable in real life is usable in game and can be wielded in several different ways.In addition, game developer Eden Studios has done away with a few in-game conventions in favor of real life upgrades. Instead of old-fashioned health barsAlone in the Darkuses realistic body damage and physiological effects to show players how much damage has been done to Carnby by the new dangerous nightlife of Central Park. Basically this means if Carnby has been taking a licking he?s going to be a little bloody. Monsters use sensory perception of all kinds to find their victims, so players need to keep aware of Carnby?s physical state, as well as the impact he has on his surroundings. Also gone are traditional inventory systems that take players out of the game while you switch or check items in your possession, replaced by an in-game inventory system where items are carried in the folds of Carnby?s trench coat. This allows you to stay in the action the whole time. Sticking with the realism theme, the number of items that Carnby can carry is limited, but since ingenuity is built into the system, items can be combined or their uses altered, mostly with tape, so players can adjust as challenges arise.TV Style Intensity That Keeps You HookedBuilt around a unique television style episodic narrative game structure, the storyline ofAlone in the Darkis split into a number of distinct 30-40 minute episodes, doled out one at a time as you play. This new way to progress through the storyline ensures that players can enjoy the game regardless of the amount of time they have available without ever feeling lost. Each time a saved game is launched, the episode will begin with a video summary of the previous episode to quickly re-immerse the player in the story, removing the need to remember where you were or what you were doing at the end of your last play session. In addition, every episode will also close with a nail-biting, cliff-hanger ending to rattle players? nerves. And when you choose to leave the game, a video teaser of the next episode will play to leave players always wanting more.Vivid Photographic RenderingEven on a bad day, and this will be a bad one, Central Park and New York City are something to see. With Game developer Eden?s proprietary Twilight technology and rendering engine, players can expect to see everything from the City?s famous landmarks to the manifestations of the evil that have been festering in Central Park come to life as if you were there. This lavishly detailed game world takes advantage of highly realistic and advanced cinematographic effects including depth of field, camera focus, numerous light sources, moisture, reflections and High Dynamic Range effects.Whether it?s the innovative game play, the unique episodic game structure, the advanced physics or the return of a ground-breaking protagonist recast in the modern era,Alone in the Darkholds something for players willing to take on the mysteries and dangers at the heart of Central Park.", "price": 9.5, "imUrl": "http://ecx.images-amazon.com/images/I/51ly8UrzkzL._SY300_.jpg", "related": {"also_bought": ["B000KLNLV4", "B000OLSJLC", "B0023CBY4E", "B002DC8GKE", "B0030GBUCS", "B0016NRS28", "B0010AYJXI", "B000F3AADE", "B000P8WOMO", "B001NJ6AWO", "B000VNS9D6", "B002I0HAC6", "B001D25M1Q", "B003WY86NE", "B004UDLRMS", "B000R0SS3Y", "B001ASJISG", "B000G75AXY", "B000NJH6YG", "B000O5DS32", "B000R0RHA4", "B00319DX4W", "B000SH3XD6", "B001SBUBJU", "B000XJNTPG", "B0043B5SLI", "B000QW9D14", "B000G7YRHO", "B000LXIO6I"], "bought_together": ["B000OLSJLC", "B000KLNLV4"], "buy_after_viewing": ["B0010AYJXI", "B0023CBY4E"]}, "salesRank": {"Video Games": 17994}, "categories": [["Video Games", "Xbox 360"]]}