{"asin": "B0009RKL6M", "related": {"also_bought": ["B0009RKL5S", "B0007YFQH6", "B00005137P", "B002S4027C", "B0009RKL6C", "B000067S60", "B0019X20R8", "B001RUEYTK", "B000067VBM", "B000067SRA", "B000EUFJXE", "B000TG6WVG", "B0007Z6RAU", "B008S7YS0U", "B000YTRUP0", "B0009WU65I", "B00006B7U9", "B00A1W44PO", "B0009RKL62", "B0009MZ9UA", "B000075UZ7", "B00005110B", "B00006B8G8", "B0002MJDSG", "B0001MKU48", "B000086EYG", "B0096DC7Z8", "B00BLB4L7K", "B000HCNZI0", "B00016UVHU", "B000A213HC", "B001T6K7G6", "B0009MX5R4", "B00J2PQZEY", "B0000DZFVK", "B00FB349R6", "B0074BPFW6", "B0040NOWY8", "B00029U1DK", "B008M1B3R8", "B009DZIEBK", "B003ZDNZT2", "B00081A2KY", "B003I4FHNK", "B0038JECKY", "B0006HVMUY", "B000B0NC2W"], "bought_together": ["B0019X20R8"], "buy_after_viewing": ["B00081A2KY", "B00A1W44PO", "B002S4027C", "B009DZIEBK"]}, "title": "TDK 16X DVD-R 50 Pack Spindle", "price": 14.74, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/514LWAShgaL._SX300_.jpg", "brand": "TDK", "categories": [["Electronics", "Accessories & Supplies", "Blank Media", "DVD-R Discs"]], "description": "From preserving family memories to protecting important data, TDK 4.7GB DVD-R media offers the widest compatibility with computer drives and home DVD players.  Ideal for general purpose recording, a single TDK DVD-R has ample capacity for thousands of digital photos, up to six hours of video and behemoth mission-critical data files.  Each DVD-R disc can be fully recorded once.  As DVD recording speeds have increased, the importance of using name brand, quality media has become paramount.  When a DVD-R is recorded at high speeds, the fast RPM's of the recording process require an advanced, ultra-sensitive recording material capable of compensating for the abbreviated exposure to the drive laser.  Specially formulated with a rapid phase-change recording layer, TDK DEV-R media products maximize the data transfer rate while minimizing the potential for errors.  The discs have been thoroughly tested and verified to outperform other media brands, which may rely on slow-reacting, error-prone phase-change materials.  TDK AVIST metallic alloys change between crystalline and amorphous states in response to the heat generated by a laster for phase-change recording.  The differences in relectivity exhibited by the alloy in its cystalline and amorphous states are read as data.  TDK AVIST alloys are designed for the most precise laser response, resulting in perfect data marks and superior recording and playback performance."}