{"asin": "B002SH43MO", "description": "One glance at the LaCie Starck 1TB USB 2.0 Desktop Hard Drive and you know it's special. A collaboration between LaCie and world-renowned designer Philippe Starck, this external hard drive is the perfect union of form and function. Featuring a sturdy aluminum casing and an intelligent, touch-sensitive surface, the LaCie Starck is a dependable and elegant addition to any workspace.LaCie Starck 1TB USB 2.0 Desktop External Hard DriveAt a Glance:Stunning design by Phillipe Starck.1 TB of disk space.Touch sensitive surface launches applications.USB 2.0 interface.The stylish organic design by Phillipe Starck features a glowing LED on the front and a USB port on the back.Backup software for both PC and Mac is included.View larger.1 TB of Space in a Smart, Elegant DesignFamed designer Philippe Starck gave the LaCie Starck a sleek, organic design that will turn heads. The drive features a thick aluminum exterior that gives the drive a unique look while also providing resistance to shock and overheating. An LED on the front of the drive glows in the form of Starck's signature symbol and changes color to indicate drive activity.And with 1 TB of disk space, there's plenty of space for all your photos, music, movies, and more.Customizable Touch-Sensitive SurfaceThe LaCie Starck's most striking feature is a touch-sensitive surface on the front panel of the drive. The surface can be customized to open the application of your choice in response to light tapping or firm touches. The touch-sensitive surface is both easy to use and helps you get work done quickly.USB 2.0 Interface for Universal CompatibilityThe LaCie Starck connects via a USB 2.0 interface that is compatible with virtually all computers. It is compatible with both PC and Mac operating systems, including Windows 7 and Mac OS X 10.6, and supports data speeds of up to 480Mbits/s. And with USB Boost, you'll experience up to 33% faster speeds.Easy-to-Use Backup Software IncludedLaCie's easy-to-use backup software is included for both PC and Mac, making it easy to protect files on your computer and avoid accidental data loss. Scheduled automatic backups mean you won't worry about forgetting to back up your latest files. And for Mac users, the drive is compatible with Apple's Time Machine backup software.The LaCie Starck Desktop Hard Drive is backed by a two-year limited warranty.What's in the BoxLaCie Starck Desktop Hard Drive, USB 2.0 cable, external power supply, and Quick Install Guide.", "title": "LaCie Starck 1 TB USB 2.0 Desktop External Hard Drive 301888KUA", "price": 279.99, "imUrl": "http://ecx.images-amazon.com/images/I/41LaLc0iABL._SX300_.jpg", "related": {"also_viewed": ["B00AX9ZAHG", "B0058VIXBY", "B0010YWPZ8", "B008SA63Y6", "B008SA69L8", "B00AJJIUKO", "B0042KFLIU", "B00A3U8AHW", "B0058VIWTM", "B00A3U8JV4", "B009HQHPB0", "B002QEBMCI", "B00AK9ZTNY", "B0055Q2VS8", "B009GXI3QU", "B0050SI9W8", "B005C2BNJI", "B00DM5EVBY", "B00F0JXE04", "B007A1FXUO", "B00FU4X9B8", "B0042KFLJE", "B005CG8X1A", "B00EAS8AA0", "B00E055H5O", "B005MNGQ6C", "B005HMKKH4", "B00H4YGR48", "B00CGUMSZC", "B00CO1I2DU", "B00CO1I2FS", "B00EAS89AG", "B00E83X9P8", "B00834SJS0", "B00E3RH61W"], "buy_after_viewing": ["B00AX9ZAHG", "B0078T11QS", "B0042KFLJE", "B0055Q2VS8"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]]}