{"asin": "B0030MIU16", "related": {"also_viewed": ["B0056HNTAU", "B00FWDXZIO", "B00J3TWQ8I", "B003OBZLDS", "B000MURAU6", "B000MUQ3NG", "B00368CDH6", "B0044UHMOO", "B008MW6Y12", "B003VTZE76", "B00DYQQSSK", "B0016NOTOI", "B00J4E8KI2", "B001T9N9JU", "B000N29KOW", "B0013A12H6", "B002IT3242", "B00442VXCO", "B00DYQZ4Z8", "B0043554TK", "B00J61XZUG", "B008FC8FPC", "B007B4UKOE", "B001QXDWNW", "B0016NJ7EK", "B00438AR9Y", "B001FN14RE", "B008738A0E", "B005ER3RZE", "B0043EV1XY", "B008FC8FJ8", "B000J6E2WW", "B0013A7XHY", "B005GDSEW2", "B008R3875C", "B0030MIUAC", "B003VTZE7G", "B00D8JX296", "B001U363PM", "B009A13IB8", "B0041686QY", "B0038M2RDA", "B001FMXWA2", "B008MDOTUE", "B00906DNHC", "B007UU354G", "B000MURAT2", "B005GXFH5O", "B00906DNSG", "B00J6CGCMS"], "bought_together": ["B0021L9BKQ"], "buy_after_viewing": ["B0056HNTAU", "B00FWDXZIO", "B008MW6Y12", "B00DYQQSSK"]}, "title": "Kodak Pulse 7-Inch Wi-Fi Digital Frame with Custom e-Mail Address for Immediate Sharing", "price": 219.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/51soY%2BYDTqL._SY300_.jpg", "brand": "Kodak", "categories": [["Electronics", "Camera & Photo", "Lighting & Studio", "Photo Studio", "Storage & Presentation Materials", "Digital Picture Frames"]], "description": "Product DescriptionGet pictures from anyone, anywhere. Automatically.The Kodak PULSE Digital Frame wirelessly receives an endless stream of pictures from the most popular online places. Your ultimate photo collection, right in your home and at your fingertips.New photos you took this weekend. A sweet shot your sister captured on her smartphone. Fresh pictures your friends just posted to Facebook. With the new Kodak PULSE Digital Frame, they&rsquo;re automatically uploaded and ready for you to enjoy. It wirelessly receives an endless stream of pictures from all the people in your life, constantly refreshing your photo collection. And with a tap of its touchscreen you can send a comment and let everybody know just how much you enjoyed their photos. The PULSE Digital Frame gives you a two-way connection to family and friends.Makes a great gift!Staying connected with family and friends is always in season. Keep Mom up to date with everything you&rsquo;ve been up to (well, maybe not everything!) or send pictures of the kids as they grow to the grandparents. No matter where your friendsa and family are, you can share your pictures directly to the Kodak PULSE digital frame.The activation code on the box easily lets you set up the frame for someone else&mdash;no need to unpack the frame. Then just wrap it up and give the gift of pictures!Sharing Features-Socially connected, endlessly refreshed\\Sharing PicturesE-mail pictures from a computer or mobile phone to your PULSE Digital Frame using a custom e-mail addressUse the Share button1to share pictures on Facebook and Kodak Gallery SitesManage Pictures- Stay up to date and get the pictures you want when you want themChoose pictures from your computer to add to the PULSE Digital Frame&mdash;easy to drag and drop or visit www.kodakpulse.com is your online control center to remotely manage your frame where you can&nbsp;Choose Facebook and Kodak Gallery users and albums to displayCreate picture playlists to choose right from the touchscreen and set up transition times and slideshow stylesEasily manage frames for friends or family, or even a businessComment on a picture&mdash;directly from the frame! The Quick Comment button allows you to communicate with picture senders directly&mdash;no need to log on to Facebook or send an email from your computer.Choose from twelve (12) popular messages. The Quick Comment feature will send the message in the same manner in which it was delivered to the PULSE Digital FrameThe PULSE Digital Frame automatically alerts you as soon as you get new pictures from friends and familyFrame FeaturesHigh-quality touchscreen- Control your pictures with a touchPause the slideshow, glide through pictures, set slideshow styles and moreBuilt-in Wi-Fi- Wirelessly add pictures from your collection or receive pictures from friends and family&nbsp;512 MB internal memory-&nbsp;Stores up to 4000 picturesAs pictures arrive, they are automatically resized and stored on the frameEasily manage the pictures at your www.kodakpulse.com accountEasy to set up- no subscription requiredHassle-free setup in just 3 steps. There&rsquo;s no software to install&mdash;just follow the on-screen instructions:Plug in and touch &ldquo;start&rdquo;Choose your wireless networkGo to www.kodakpulse.com to enter your activation code&nbsp;No additional fees for emailing or receiving picturesEnergy minded- ENERGY STAR&reg; qualifiedBuilt-in activity sensor turns the frame on when you&rsquo;re nearby and conserves energy when you&rsquo;re notWhat&rsquo;s in the box?KODAK PULSE Digital FramePower adapter and plugQuick Start Guide1All KODAK Cameras manufactured in 2011 or later."}