{"asin": "B001CRQYBO", "description": "Wolfensteinis a supernatural/science fiction first-person shooter, based on the video game series developed by Id Software that has been a favorite of 2D and 3D gamers across multiple game iterations and platforms since the early 1980s. In this new take, players battle the Nazi's dark obsession with the occult through epic action and harrowing shooter combat. Filled with ferocious enemies, movie-quality action scenes, unique gameplay environments, an impressive array of weapons and compelling multiplayer gameplay options, it is truly a fitting new chapter in the history of this classic gaming franchise..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Battle conventional enemies.View larger.And the supernatural.View larger.Collect and wield 'Veil Powers.'View larger.Explore multiplayer modes.View larger.StoryThe storyline ofWolfensteinpicks up where the events ofReturn to Castle Wolfensteinleft off. You play B.J. Blazkowicz, a highly decorated member of the Office of Secret Actions (OSA). You are sent on a special mission into the heart of the Third Reich to investigate evidence of the Nazi's possession of a new and mysterious power. But while behind enemy lines, you discover they have done much more than develop a new weapon. The Nazis are attempting to harness the supernatural power of an enormous energy source called 'Black Sun' which resides in a parallel dimension called 'The Veil.' Their goal is to use what they find to create supernatural weapons and soldiers of war-ending magnitude. Yours is to stop that from happening by any mean necessary.GameplayEven though the game obviously features loads of Nazi enemies,Wolfensteinis not so much a World War II game, as a game centered around \"dark science\" and \"Supernatural Science fiction.\" In it players move between the the parallel dimension of the Veil and that of our own as they command an enormous arsenal of conventional weapons or unleash the Nazi's own dark powers and perverted science against them with supernatural weapons and Veil-enhanced firepower.One of the major strengths ofWolfensteinis that it allows you to choose the way you want to play. Although as in previous games in the series B.J. Is a one man wrecking crew, he also works with a local resistance group. This means that players have the choice to follow the standard missions as they are revealed, take on requests from the resistance to explore the gameplay area and investigate the Nazi experiments, or to tackle the whole endeavor in multiplayer mode.Veil PowerA huge part ofWolfenstein'ssci-fi identification comes via gameplay that relies on the accumulation and use of a number of 'Veil Powers'. These powers though supernatural in origin, are used in large part by B.J. To magnify the effectiveness of his conventional weaponry and tactics. A sampling of these powers include: 'Mire,' which allows you to slow down time around B.J. So that he can take out enemies and obstructions such as machine gun nests, without the risk of taking severe damage; 'Veil Sight,' a sort of supernatural night vision that helps you see enemies in the dark; and 'Veil Shield,' which absorbs bullet fire and can be used as a battering ram in some circumstances. As with all the weapons in the game, all Veil Powers can be upgraded and indeed must be in some cases to proceed through the game.A notable caveat that comes along with the mastery of Veil Powers is that they do not necessarily guarantee overall success. As the game proceeds, the Nazis become aware of B.J. And his understanding and use of these powers and in response distribute 'Veil Inhibitors,' devices that negate the use of these Veil-powered abilities within range of them. This opens up a puzzle-solving aspect withinWolfensteinthat require players to explore the environments around them to find the inhibitors and destroy them in order to proceed.Key FeaturesAmazing Enemies- You never know what ferocious enemies the Nazis will throw at you next as they bring their dark fantasies to life.Epic Combat Moments- Experience movie-like epic action sequences as you fight to prevent the Nazis from unleashing the power of the Black Sun, a war-ending weapon of supernatural mass destruction.Unique Environments- Explore the mysteries of The Veil, a world between our reality and the occult underworld that offers you combat advantages but also new supernatural threats.Impressive Firepower- Go to battle with a diverse collection of Allied, Axis and experimental Nazi weapons. Earn gold by working with the resistance fighters, purchase upgrades in the black market, and customize your personal arsenal.Classic Wolfenstein Multiplayer with an Occult Twist- Revisit the heart-pounding and award winning class and objective based multiplayer ofReturn to Castle Wolfenstein; now with occult-enhanced firepower.WeaponsWolfensteinfeatures a wide array of Allied, Axis and supernatural Nazi weapons. All of these can be upgraded using treasure in the form of gold, military intelligence and mystical tomes found throughout the game via the in-game black market. This escalation of firepower is important in order to match the growing power of mini-bosses and bosses faced with each successive game level.", "price": 90.48, "imUrl": "http://ecx.images-amazon.com/images/I/51W0-ybmSfL._SY300_.jpg", "related": {"also_bought": ["B000087L4G", "B008E6ZXRM", "B007V2LMAM", "B00CPKUV7K", "B001UWGDC6", "B0009S4UOK", "B00354NAYG", "B002I0HAC6", "B00149ILCK", "B000C427NM", "0744011582", "B00163LW7A", "B000O5FUQ0", "B000H94PVO", "B00KAED6RU", "B000R0SR9E", "B003GSZ9ZE", "B001RTCOWK", "B000CQNWH0", "B002BSA1MQ", "B00DHF39L2", "B00KSQHX1K", "B000XJO7A2", "B00G6MW5CC", "B003P9C6QY", "B001BC948U", "B000O5DS32", "B001L18RIE", "B003H0CC2O", "B0050SY77E", "B000F3AADE", "B000KGD1GO", "B002V16T0Q", "B005C2D2MO", "B000WSE2WM", "B0056WJA76", "B001E7MMNQ", "B00C3MK9BS", "B003Q53VZC", "B0050SY9WC", "B001ASJIRM", "B001NX4DUQ", "B0014ULQB2", "B000TI836G", "B000CBVC0Y", "B000HKGIOA", "B002I0JA7E", "B008AEE02M", "B000HX1P72", "B00K31MN6U", "B00KF7BEFS", "B0050SYY5E", "B000087L4E", "B00BU3WWOS", "B000SQ5LQ4", "B000R0RHA4", "B001D7T2VM", "B0050SYV70", "B0022TNO7S", "B00149MEWI", "B000QCU9I0", "B00319DX4W", "B000PE0HBS", "B0050SY5BM", "B001AWIP68", "B000XJS00K", "B004NRN5DU", "B004ML7WOK", "B003O6N2TI", "B000V1OUV8", "B002SRSQ72", "B000XYUVAC", "B000FRU0NU", "B001REZLY8", "B003FBL85W", "B00JDOX2PE", "B005THAX5Q", "B005VBVQAG", "B005J5K9EI", "B0086V5V9A", "B002GPPPS4", "B000O5K3TO", "B003O6EB70", "B000R0SS3Y", "B005FDUSTA", "B000R0PLK2", "B002I0H2AG", "B0050SYWVA", "B000ZK9QD2", "B00F4GSAYI", "B000MKA60W", "B0016BVYA2", "B0044SA70M", "B001A4MTGS", "B004FUL9YW", "B002I0H79C", "B002EE5ROO", "B0056WJA30", "B004FSE52C", "B0009SQFHA"], "bought_together": ["B008E6ZXRM", "B007V2LMAM"], "buy_after_viewing": ["B00CPKUV7K", "B00DHF39L2", "B00DHF39KS", "B008E6ZXRM"]}, "salesRank": {"Video Games": 2625}, "categories": [["Video Games", "Xbox 360", "Games"]]}