{"asin": "B0002A6CQ4", "description": "The walking dead have incoherently moaned, clumsily shuffled their feet, and affectionately given us crater-sized hickeys in every Resident Evil game to date. The animated corpses that put this series on the map and redefined video game horror as a whole are now buried six feet under the soil at Capcom's Production Studio 4. It may be difficult to envision a Resident Evil game without flesh-eating zombies, but Capcom is showing us that there are far more terrifying things that go bump in the night. Nothing can truly prepare you for the unspeakable horrors that will hunt you until your last breath is given. It's been a long time coming, but Resident Evil is back, and it is better and bloodier than ever before.This game is such a departure from the series' heritage that the only familiarity gamers will have with it is through protagonist Leon S. Kennedy, who was first introduced as a greenhorn police officer that spent his first day on the job handling the outbreak in Resident Evil 2. Attracted to madness like teenage girls are to Camp Crystal Lake, Kennedy once again finds himself knee-deep in unspeakable horror. Rather than having maggot-infested zombies gnawing at his neck, crazed villagers are the order of the day. Unlike the slow-witted, slow-moving dead, these adversaries are very intelligent, extremely agile, and not afraid to use weapons. They also like to attack in packs. Picture if you will a group of six murderous souls with beady red eyes glowing under the moonlight running at you with lit dynamite, ducking out of the way of your shots, and calling out for others nearby to lend a hand in your death. This is a new kind of scare that far surpasses the suspense and jump-out-of-your-seat shock moments that fueled the previous chapters in the series. As you'll soon learn, there are few things scarier than a middle-aged housewife that sprints at you with a blood-soaked axe raised into the air, belting out a bloodcurdling scream.To counteract the intelligence and sheer brutality of these new foes, Capcom has completely reworked the combat system. In the past, we blindly fired into areas we couldn't see and ran past enemies to preserve ammo. This time around, everything that so much as raises a finger at you must die&nbsp;&#8211; preferably by a nicely placed headshot. A remarkable new targeting system allows this feat to be handled with the utmost precision. On this note, I've never seen so many heads explode in my life. The new over-the-shoulder perspective coupled with a beautifully crafted laser sight makes for a lethal and satisfying combat experience. Additionally, players can now interact with their surroundings in a handful of clever ways, such as knocking down ladders and pushing dressers in front of doors. The Resident Evil games were always criticized for being too clumsy in gameplay. With Resident Evil 4, however, I can't envision it playing any better.I also like how the game pushes players to scour every inch of the environments. Rare treasures that are unearthed can be traded in to a vendor for cash. With enough funds you can buy new weapons and items, as well as upgrade all of your armaments. Inventory space is still limited, but it's finally done in a way that makes sense. You now manage a physical space. If a new gun doesn't fit in your case, try moving things around to make room for it.Recently, developers have been talking about the need to blend story cinematics with gameplay. Capcom has accomplished just this, and it's captured in way that will make you wish that every game that you play utilized this innovative system. For instance, if a character in a sequence comes at you with a knife, you have to press the L and R buttons at the precise moment to dodge the attack, otherwise the scene will end with blood gushing from your neck. The interaction that you have at your hands is unprecedented, and you'll be doing things you didn't even think were possible in games.There are no flaws in Resident Evil 4. It is the greatest horror game to date. I never thought that a game, or movie for that matter, could deliver pulse-pounding action in such an awe-inspiring way.Concept:A brilliant new direction for survival horror that focuses on gunplay and truly cinematic momentsGraphics:A sickening level of detail accompanies every little object, animation, and effect. It looks too good to be trueSound:Great voice acting, stress-inducing music, and disturbing sound effects combine to create the perfect atmospherePlayability:The controls are fashioned beautifully, boss fights are ingenious, and the popping of heads is immensely rewardingEntertainment:Hard to put down even after you've beaten it twiceReplay:Moderately HighRated:10 out of 10Editor:Andrew ReinerIssue:March 20052nd Opinion:Some games are simply destined to become milestones in gaming history, and Resident Evil 4 is one of them. Even those who have never picked up one of the previous titles and swear that they hate the slow-paced crawl of survival horror games simply must play it. Capcom has managed to create a game that is a complete reinvention of the series &#8211; even the entire genre &#8211; without losing anything that Resident Evil fans expect. Perfectly balancing elements of horror, subtlety, and wit with explosive action and over-the-top thrills, playing RE 4 feels like living one of the most epic films you've ever seen. Gorgeous to look at, a dream to control, and filled with some of the most exciting moments you've experienced in a game, Resident Evil 4 is stellar on every level. It goes without saying that it's the best in the series, the best survival horror game yet, and simply one of the best games ever made.Rated:10 out of 10Editor:Jeremy ZossSubscribe to Game Informer--Amazon.com", "price": 132.73, "imUrl": "http://ecx.images-amazon.com/images/I/51GXYSKK0GL._SY300_.jpg", "related": {"also_bought": ["B0000657SP", "B00006LELI", "B00006IJJK", "B00007KQC5", "B00007KQC4", "B00008H2IS", "B00005Q8M4", "B00009KO3S", "B00009WAVA", "B00005QDPZ", "B00005QEFD", "B00012D0SG", "B0009Z3I0K", "B0002ILS1U", "B00005Q8M0", "B00006IJJI", "B00006FWTX", "B000ARPXU0", "9861019731", "B000066JRN", "B00008KTWH", "B0000C6EDJ", "B00005QEFF", "B0009UBR3A", "B000084318", "B000A15K0Y", "B00009PS22", "B000L9NPGG", "B0000A09EN", "B00095KU5G", "B00009PS24", "B00009WAUD", "B00005Q8LY", "B0009XEC0M", "B00006599U", "B00008DHLV", "B00005ULXN", "B0007D4MUE", "B00006LU9B", "B0000A0834", "0744003466", "B004CHLNWQ", "B00006AVB1", "B00005Q8LG", "B00009VE6B", "B0002CHIWO", "B00006599P", "B00006HBTW", "B00009XS6Q", "B0001OK7VW", "B00009X3V2", "B00005Q8LR", "B00006JZDV", "B000B8J7JQ", "B00005BOSF", "B00006966U", "B00009WAUH", "B000620PSY", "B0000A1OG4", "B00008G8IA", "B0000E5U6I", "B0002ILS1K", "B0009351P2", "B000ZEX9OU", "B00006FDLO", "B0002ILS24", "B000641ZC2", "B0002A6CPK", "B002L8W5V6", "B0009PM8V0", "B0001OK7V2", "B000EHPQMG", "B000095ZHA", "B0017KIBAI", "B00009YEKA", "B000646MLQ", "B000083JTS", "B0002WYUB6", "B0001B167O", "B0002IQOPU", "B00005ME6N", "B0009XEC0C", "B000070IWB", "B000ARJI88", "B000ARW4RU", "B00000K2G7", "B00009WAUF", "B0002Y5180", "B0000DI6BB", "B0006DNMYW", "B0001I9YIK", "B00005QDQ1", "B00000I1BY", "B0000E5U6K", "B00006JN5O", "B002L93F0A", "B0000VSH40", "B000AOEU2K"], "bought_together": ["B00006IJJK"], "buy_after_viewing": ["B0000657SP", "B000B69E9G", "B00006IJJK", "B00006LELI"]}, "salesRank": {"Video Games": 3005}, "categories": [["Video Games", "More Systems", "GameCube", "Games"]]}