{"asin": "B004D267RG", "related": {"also_bought": ["B005P0IP3O", "B00GMP5KPW", "B005P0ION0", "B004D2C4G4", "B00J4ROC4A", "B004D2DQ6G", "B004D5ZZXK", "B004D2C50Y", "B00JE78L0Q", "B005M2KZQU", "B00J9D93FM", "B00E4MNB4M", "B00JJEFWPQ", "B004HJB5U4", "B005M2L49W", "B0088W8XJM", "B00GMP5KBQ", "B004D2821K", "B00J89RVBA", "B00JJDIH9A", "B00HRQRL5W", "B00JE18VQ6"], "also_viewed": ["B004D2C50Y", "B005P0ION0", "B005P0IP3O", "B004D2C4G4", "B00JE78L0Q", "B00J4ROC4A", "B004D5ZZXK", "B00J89RVBA", "B004D2DQ6G", "B00GMP5KPW", "B00J9D93FM", "B00L9G1ST6", "B0088W81DU", "B00FC8RKN0", "B00JTH505U", "B000VP9BWW", "B005M2ERQ4", "B00HFKPNOQ", "B00LXL5Q3G", "B0088W8XJM", "B005CYJETW", "B00E4MT3TO", "B00KT1K3RU", "B004HJB5U4", "B005M2KZQU", "B00JAOPRZU", "B005CYK040", "B0072CR46M", "B001VGJ2L0", "B0036QQWAC", "B0015AA1L2", "B005M2NZO4", "B00J8K36WC", "B00GMP5JO4", "B005GMY8FA", "B00IP9LWV4", "B000GCY224", "B0072CV490", "B00AVWJROM", "B005J4B2MW", "B00C3Q0I6K", "B00E4MNB4M", "B0088W3A9U", "B005M2KHFO", "B004D8GTQY", "B003TXZSU2", "B0016BHMD0", "B00JNZ8000", "B000QA7HNC", "B006X1KW1W", "B0081E6YY8", "B00IP99KX6", "B005CYJGY0", "B004IM0KYM", "B005M2IHME"], "bought_together": ["B005P0IP3O", "B005P0ION0"]}, "title": "Aveeno Living Color Preserving Shampoo for Medium-Thick Hair, 10.5 Ounce (Pack of 2)", "price": 16.89, "salesRank": {"Beauty": 22902}, "imUrl": "http://ecx.images-amazon.com/images/I/31-w42UGoUL._SY300_.jpg", "brand": "Aveeno", "categories": [["Beauty", "Hair Care", "Hair Color", "Color Refreshers"]], "description": "This shampoo is specially formulated for medium-thick hair, with ACTIVE NATURALS color-fortifying lupine botanicals, and is formulated to protect your hair to help extend the life of your color.Protect Vibrant Color and Shine for Up to 40 Washes*AVEENO LIVING COLOR Color Preserving Shampoo for Medium-Thick Hair is designed for the unique needs of color-treated, medium-thick hair. This rich-lathering shampoo breathes new life into your color by revealing vibrant shine with each wash, while perfectly balanced cleansers carefully lift away impurities to enhance color clarity. The ACTIVE NATURALS formula features the power of color-fortifying lupine botanicals, scientifically shown to smooth the cuticle, helping to lock in color for long-lasting, healthy brilliance for vibrant color that comes to life wash after wash.LIVING COLORAVEENO harnesses the power of ACTIVE NATURALS in two revolutionary hair care collections. For color-treated hair, the LIVING COLOR Collection with ACTIVE NATURALS Lupine Botanicals keeps color vibrant for up to 40 washes.* And for damaged hair, the NOURISH+ Collection with ACTIVE NATURALS Wheat Complex brings hair to life in just three washes.The Natural Benefits of Lupine BotanicalsThe ACTIVE NATURALS Lupine formulas help prevent color from fading for up to 40 washes.*LIVING COLOR Color Preserving Shampoo for Medium-Thick HairAt a Glance:Rich-lathering shampoo breathes new life into your colorACTIVE NATURALS formula features the power of color-fortifying lupine botanicals, scientifically shown to smooth the cuticlePerfectly balanced cleansers carefully lift away impuritiesProtects vibrant color and shine for up to 40 washes*The Science of Lupine BotanicalsUsed for medicinal purposes throughout history, the lupine seed has an unusually high protein content that fortifies the hair shaft. When applied, phytonutrients coat and smooth the cuticle, helping to strengthen the hair and seal in color.ACTIVE NATURALS Lupine BotanicalsThe LIVING COLOR ACTIVE NATURALS Lupine shampoos carefully lift away impurities to enhance color clarity. The conditioners infuse moisture and help seal in color, while reducing breakage for soft, manageable hair. And the LIVING COLOR Preserving Shine Glaze features a creamy rinse-out formula that protects and revives your hair's lustrous sheen.AVEENORecommended by dermatologists for over 60 years, AVEENO combines the best of nature and science to reveal the natural beauty of your skin. AVEENO uses select natural ingredients because of their advanced benefits; we call these ACTIVE NATURALS, natural ingredients uniquely formulated to deliver visible results.What's in the BoxAVEENO LIVING COLOR Color Preserving Shampoo for Medium-Thick Hair.* LIVING COLOR Shampoo + Conditioner in a wash study vs. waterTry the complete LIVING COLOR line that contains natural lupine botanicals and is specially formulated to protect your hair to help extend the life of your color:ShampooLIVING COLOR Color Preserving Shampoo for Fine HairThis shampoo is specially formulated for fine hair, with ACTIVE NATURALS color-fortifying lupine botanicals, and is specially formulated to protect your hair to help extend the life of your color.LIVING COLOR Color Preserving Shampoo for Medium-Thick HairThis shampoo is specially formulated for medium-thick hair, with ACTIVE NATURALS color-fortifying lupine botanicals, and is formulated to protect your hair to help extend the life of your color.ConditionLIVING COLOR Color Preserving Conditioner for Fine HairThis lightweight conditioner is specially formulated for fine hair, with ACTIVE NATURALS color-fortifying lupine botanicals, and is formulated to protect your hair to help extend the life of your color.LIVING COLOR Color Preserving Conditioner for Medium-Thick HairThis rich and silky conditioner is specially formulated for medium-thick hair, with ACTIVE NATURALS color-fortifying lupine botanicals, and is formulated to protect your hair to help extend the life of your color.TreatLIVING COLOR Color Preserving Shine GlazeThis creamy, rinse-out formula, withACTIVE NATURALS color-fortifying lupine botanicals, is designed to help keep and revive the lustrous shine your hair has after it is first colored.Trademark Information:AVEENO&reg;LIVING COLOR&trade;ACTIVE NATURALS&reg;"}