{"asin": "B000TT4GBG", "description": "Tap into your Rock &amp; Roll fantasy as you pick your axe, form a band and tour for fame and fortune, all while sticking the rock credo of learning your instrument as you go inRock Band.For those about to rock!Jam solo if that's your thing.View larger.Or try multiplayer action.View larger.Step to the mic.View larger.Or go Bonzo on the skins!View larger.Developed by Harmonix, creators of the blockbusterGuitar Herofranchise,Rock Bandis an all-new platform for gamers ready to take on the challenges of the Rock &amp; Roll lifestyle. Instruments available to players are guitar, bass, drums or vocals as they hit the road as either an aspiring superstar solo act, or for the first time in game genre history take on the true collaborative and challenging nature of music as they form a band and jam together in multiplayer action from home or around the world. Either way players will need to master their stage presence through the various game modes and polish their rock chops via the unrivaledRock Bandsong list if they hope to make it out of the garage, into the clubs and finally on to the main stage.*Rock BandSpecial Edition for Xbox 360 includes: guitar, mic, drum kit peripherals plus software.Extensive Game Modes.Rock Banddelivers four music games in one - challenging rockers to master lead guitar, bass guitar, drums and vocals through the five separate game modes.Tutorial Mode: Master the basics! No need for experience. Pick your weapon of choice and ascend from beginner to rock god.Practice Mode: Perfect your tune! Breakdown any part of any song at your preferred speed before hitting the main stage.Quickplay Mode: Instant fix of fun! Jump into any unlocked song for some quick jam time either on your own or with other players.Solo Tour Mode: Take it on the road! Pack up your instrument of choice and set out on the open road for a fun and challenging single player career.Band World Tour Mode: Conquer the world! The journey to rock stardom takes you from small town bars to world-renowned venues. Earn fame and fortune along the way to secure rock star necessities.A Song List That Goes to Eleven!Built on unprecedented deals with top record labels and music publishers, the mix of remastered originals and covers that make up the epicRock Bandsong list puts players in the shoes of legendary artists from day one. And with the promise of additional downloadable songs and albums you are sure to be rockin&#146; for some time to come. In addition to the 45 tracks listed below,Rock Bandwill also feature 13 songs ranging from a variety of established bands to up-and-coming independent artists that can be unlocked as you play through the game. Track list includes:Rolling Stones \"Gimme Shelter\"Aerosmith \"Train Kept a Rollin'\"The Who \"Won't Get Fooled Again\"Boston \"Foreplay/Long Time\"Mountain \"Mississippi Queen\"The Police \"Next to You\"David Bowie \"Suffragette City\"Black Sabbath \"Paranoid\"Blue Oyster Cult \"Don't Fear the Reaper\"The Ramones \"Blitzkrieg Bop\"Deep Purple \"Highway Star\"KISS \"Detroit Rock City\"Molly Hatchet \"Flirtin' With Disaster\"The Outlaws \"Green Grass & High Tides\"Sweet \"Ballroom Blitz\"Rush \"Tom Sawyer\"Bon Jovi \"Wanted Dead or Alive\"The Clash \"Should I Stay or Should I Go\"Faith No More \"Epic\"R.E.M. \"Orange Crush\"Iron Maiden \"Run to the Hills\"*Foo Fighters \"Learn to Fly\"Metallica \"Enter Sandman\"Nirvana \"In Bloom\"Stone Temple Pilots \"Vasoline\"Weezer \"Say It Ain't So\"Smashing Pumpkins \"Cherub Rock\"Radiohead \"Creep\"Beastie Boys \"Sabotage\"Hole \"Celebrity Skin\"Garbage \"I Think I'm Paranoid\"Soundgarden \"Black Hole Sun\"The Hives \"Main Offender\"Queens of the Stone Age \"Go With the Flow\"The Strokes \"Reptilia\"Jet \"Are You Gonna Be My Girl\"OK Go \"Here It Goes Again\"Nine Inch Nails \"The Hand That Feeds\"Pixies \"Wave of Mutilation\"Yeah Yeah Yeahs \"Maps\"Red Hot Chili Peppers \"Dani California\"Coheed & Cambria \"Welcome Home\"Fallout Boy \"Dead on Arrival\"The Killers \"When You Were Young\"New Pornographers \"Electric Version\"", "price": 24.95, "imUrl": "http://ecx.images-amazon.com/images/I/41lvXMDWuBL._SX300_.jpg", "related": {"also_bought": ["B003RS8HG6", "B001BX6JUA", "B001TOQ8JS", "B003RS19N4", "B002M2N9OI", "B002AO7DAY", "B0040J1REA", "B003RRTWSE", "B001F04T8I", "B001ZE3G7O", "B001TOMR5C", "B0039RFIQM", "B003RS1AIS", "B0028ZJ4ZW", "B002DZJPVK", "B003RRTXYW", "B003VWGBG6", "B001KAN1VO", "B002EWD09A", "B00263ABOE", "B0017HQDUG", "B003JETPHS", "B0046RMJRU", "B000TGDHW8", "B001UWN0EA", "B0040J1RIQ", "B001ABP95E", "B000TG531G", "B006603V4U", "B0029Y05EG", "B003O6EE4U"], "buy_after_viewing": ["B003RS8HG6", "B001BX6JUA", "B001BX4U5G", "B003JETPHS"]}, "salesRank": {"Video Games": 15362}, "categories": [["Video Games", "Xbox 360", "Games"]]}