{"asin": "B000GP845M", "categories": [["Electronics", "Computers & Accessories", "Webcams"]], "description": "Amazon.com Product Description Video communication made easy. QuickCam Communicate STX takes your video communications to the next level. Clearer video with&nbsp; 640 x 480 VGA quality and RightLight technology provides improved image clarity even in low light, and your calls are always echo-free with the integrated microphone and RightSound technology.Enjoy free, high quality video calls with synchronized audiovia Skype&mdash;full-screen&nbsp;with&nbsp;Windows Live Messenger.Make live video calls to friends and family!Enjoy two-way, real-time video calls with integrated audio&mdash;the perfect way to stay in touch with&nbsp;friends and family.&nbsp;&nbsp;&nbsp;Works with these applications (not all services available in all areas):Features:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;VGA video sensor with RightLight technologySharper images and video performance even&nbsp;in dim lighting.&nbsp;Integrated&nbsp;Microphone with RightSound technologyLogitech's exclusive RightSound technology ensures your voice comes through clearly and echo-free.&nbsp;Switched privacy shade&nbsp;Makes launching, muting and closing video sessions easy.Free&nbsp;HP Photosmart Essentials software&nbsp;- Edit and print your photos (web download required).Set-up is in 3 quick steps -Logitech software walks you through the process.Snapshot button&nbsp;-Taking stills is fast and easy.Flexible clip&nbsp;- Attaches to&nbsp;any monitor or notebook,&nbsp;and stands on a&nbsp;tabletop.System Requirements:Pentium II 500, Celeron, Athlon processor or higherMicrosoft Windows 98SE, 2000, Me or XPAvailable USB 1.1 or USB 2.0 portWindows compatible soundcard and speakers16-bit color display adapterCD-ROM drive200 MB free hard drive space64 MB RAM minimumHardware:Sensor: High quality VGAVideo Capture: Up to 640 x 480 pixelsStill Image Capture: 1.3 mexapixels (interpolated)Video File Type: AVIStill Image File Types: BMP, JPEGFrame Rate: Up to 30 frames per second (with recommended system)Field of View: 42 degrees horizontalOptics: Fixed focusUSB 2.0 and 1.1 compliantCable length: 6 ft. USB cableApplications for WindowsLive video calls with free trial of Logitech VideoCall for broadbandLive video integrated with MSN MessengerLive video on AIM/AOL Instant MessengerWorks with Yahoo! MessengerWorks with Windows Messenger (XP only)Includes Logitech QuickCam software for capturing stills and videosWeb camming softwarePackage Contents:Logitech QuickCam Communicate STX camera6 ft. USB cableRound desktop baseAdjustable monitor clipInstallation CD, including user guideQuick-start guideBundled software2-year warranty", "title": "Logitech QuickCam Communicate STX", "price": 63.95, "imUrl": "http://ecx.images-amazon.com/images/I/41V1QA0D7RL._SY300_.jpg", "brand": "Logitech", "related": {"also_viewed": ["B003LVZO8S", "B004FHO5Y6", "B0016JMS90", "B0007NIJBC", "B00519B4YG", "B00K11RI6W", "B002GP7ZTQ", "B0043PIZYG", "B003LVZO88", "B002GP7ZTG", "B000NB2GF8", "B002ACQDEI", "B0092QJRPC", "B000RZSHQM", "B008GWPC1Q", "B003JZC7AE", "B002GP7ZT6", "B000BDH2XY", "B004HK757U", "B003VANOAO", "B000BBYH8O", "B002NTC9YQ", "B0017IB07G", "B004WO8HQ4", "B0017ICW4G", "B0015TJNEY", "B0015BWO5W", "B002DW0VT8", "B000RZQZM0", "B004FK04M0", "B008ZVRAQS", "B004431UBM", "B000UY1OMY", "B005E3U5X0", "B004YW7WCY", "B002UT36UU", "B004FLJ4YI", "B009E47ZDI", "B0040QE98Y", "B003SDDR8I", "B000GE9XQ2", "B004U29BL8", "B001SLPUXW", "B004HKAIBU", "B000VCTHM4", "B000EVM5DK", "B0019WF4FE", "B00IJE0ISS", "B00006HMPK", "B004CYLARC", "B002WIZ2DS", "B004TMN4BC", "B000AMPXN2", "B005BZNEKM", "B005FYEKRK", "B0096KSBB0", "B003NE5IOI", "B000I8K6EY"], "buy_after_viewing": ["B003LVZO8S", "B004FHO5Y6", "B0016JMS90", "B004WO8HQ4"]}}