{"asin": "B000FQBWAG", "description": "In the grand and classic racing tradition ofExcitebike, get ready for a big-air experience like no other! Players rocket their trucks across dynamically changing terrain in this nitrous-injected, high-flying racer for speed junkies. Showing the Wii Remote controller's versatility, players tilt the controller on its side to turn it into a wireless steering wheel!The Wii's 4x4 title goes off-road and flies high!Use the Wii remote to control your rig in mid-air.View larger.Multiple racing modes allow for different types of challenges.View larger.Rigs of all shapes and designs are featured.View larger.Steer by using the Wii remote like a wheel!View larger.Arcade excitement, arcade feelExcite Truckdoesn't hide the fact that it's an arcade racer. You won't be modifying your rig with aftermarket parts or racing to win the heart of some flag-waving girl. You will, however, go fast- very fast. It would be easy to stay on the dirt path that defines the race track, but if you plan on truly winning inExcite Truck, you have to go off road and in the air. Your true success in each race is based on a star system. The more stars you get by performing stunts, drifts and more, the better your rank.Netting lots of stars is not for the feint of heart. You'll need to cruise through fields of trees, launch yourself high in the air, hang on around curves for dear life and smash the daylights out of other trucks. All this and you still want to finish the race in first place.Turbo originalityAs with the game's spiritual predecessor, the NES classicExcitebike, you can turbo to your heart's content, but if you push the envelope too far, your rig will overheat, causing you to stall until it cools down. If you smash into a tree, go to far into the water or come face-to-face with a rock known as a mountain, you'll need to mash the 2 Button to right your truck and get back on the road.The Wii-unique aspect ofExcite Truckis the way you hold the Remote. Instead of its traditional vertical configuration, you hold it in a horizontal fashion, like the center bar of a steering wheel. You move the remote in the same fashion that you would a car steering wheel, tilting your right hand up if you want to turn left and your left hand up if you want to go right. When your truck goes airborne, its front end will lean toward the ground if you tilt the Remote away from you, and if you tilt the Remote toward to, your truck's front end will point up, allowing you to catch a little more air. If you catch enough air, you can try to pull off a 720 and, if you're daring enough, a 1080. The more midair spins you can perform, the more stars you earn. Plus, remember tilting your arms while playingExcitebiketo try to make your character land a huge jump? Now that move will actually affect the game inExcite Truck.\"Raze\" the trackThe game features a Dynamic Terrain power-up. When you drive over this symbol, the road ahead changes, sometimes it plows upward to give you an extra hill to jump off. Other times, the terrain can sink, sometimes exposing water that can cool off an overheating engine. If you time the Dynamic Terrain activation just right, you can earn stars by sending racers out in front of you for an unexpected flight.Excite Truck'stracks also contain POW power-ups. This gives you clutch invincibility as you dare to go off the road and into the woods for a star-flooded tree run.Excite Trucklets you customize the in-game music you race to. Download an MP3 to an SD card and exploreExcite Truck'ssound options to hear the tunes you want. The speed of the game is one thing, going fast to tunes that get you pumped up makes the game a pulse-pounding experience.", "price": 49.99, "imUrl": "http://ecx.images-amazon.com/images/I/51fD8FaZMNL._SY300_.jpg", "related": {"also_bought": ["B001TOMQVM", "B004EDJNU2", "B000JHO4CY", "B0013EF17O", "B000TP2V30", "B001AZ7ROQ", "B000JV78XC", "B002BH3N2W", "B000S1MMG6", "B003VKLA9Q", "B000FQ9QVI", "B000YDIYFG", "B003ZHMMEM", "B005EIIBKY", "B006L1FAK2", "B001LX4BMS", "B002EE7OKE", "B002FG9MWE", "B0017WHQ34", "B0029TKMK8", "B001FEO74U", "B005GM3RI4", "B000RHZJJS", "B005EYG6EQ", "B000SH3XBS", "B001C58T46", "B000GUQJQ8", "B000GEDN5E", "B001TOQ8K2", "B000RWV17M", "B000X44XTM", "B002I0IIPY", "B000QJLQCQ", "B00149IL9I", "B00182QCXI", "B000NNDN1M", "B002BUQFXS", "B001TERJD2", "B0058CA4S8", "B003LDKIQ4", "B000NKRJAG", "B000WWNRHY", "B000P297ES", "B000HGMGWC", "B001GIUWX0", "B002BSA388", "B003ZCH7DI", "B002BUSSTM", "B004WLRQ2S", "B000WINB56", "B001TOQ8KW", "B001DO3NEW", "B001B1W3KM", "B005FYJA52", "B002FUI4NI", "B008171AZ8", "B0013E9HP6", "B000IFRPLE", "B003O6DZSQ", "B005GM3MX4", "B0012N94P6", "B000B6ML28", "B002I08VDI", "B0039XZGXG", "B000TU1IH0", "B0094X28J0", "B000GHLBUA", "B0002CHIWO", "B0056C2LIG", "B003WOFXEY", "B000SFK0LG", "B004WLRR0E", "B0037US4IA", "B000R39IW6", "B001CM0PR8", "B002BRZ9G0", "B000FQ9YB0", "B002I0GEXM", "B002BS47L2", "B0094X2066", "B002HT643Y", "B000R3BNDI", "B001REZLX4"], "bought_together": ["B001TOMQVM", "B002BH3N2W"], "buy_after_viewing": ["B001TOMQVM", "B004EDJNU2", "B001GIUWX0", "B002BH3N2W"]}, "salesRank": {"Video Games": 13914}, "categories": [["Video Games", "Kids & Family", "Wii", "Games"], ["Video Games", "Wii", "Games"]]}