{"asin": "B000I661J0", "categories": [["Electronics", "Television & Video", "Streaming Media Players"]], "description": "Unrivaled DVRNo other box comes close. Get the very-top-of-the-line sound, highest-quality picture, and the Emmy award-winning TiVo service all in one incredible digital cable*-ready box. A subscription to TiVo service is required for this DVR to function.Provides Access to Your Digital Cable ProgrammingAdd high-quality entertainment to your home theater without adding clutter. Receive your premium digital cable channels in their full native HD format with CableCARD decoders (available from your cable provider). The TiVo Series3 HD Digital Media Recorder is also compatible with analog cable and over-the-air digital HD (ATSC). Provides an all-digital connection to your high-end display: HDMI for video, SP/DIF for audio.A True Home Theater Device, THX-certifiedIt's not home theater without THX&#xAE;-certification. The TiVo Series3 HD box maintains all of the sharpness and detail found in the original broadcast-both in sound and picture-so you get the complete high-definition experience as it was intended.Unbelievably LiberatingOnly the TiVo service offers advanced, easy-to-use features that make it effortless to enjoy your favorite entertainment any time.Brilliantly IntuitiveThe high-quality, front panel display shows what's being recorded, even when the TV is off. Uses OLED (organic light-emitting diode) technology.Supreme Handling with the New TiVo Series3 Digital Media Recorder RemoteSleek, glossy, black with silver trim, the new TiVo remote control is backlit for your viewing pleasure and it's a learning remote so it's super-easy to configure to your TV. Includes ASPECT control button.Additional TiVo Series3 HD Digital Media Recorder FeaturesCableCARD&#x99; technology to access your HD digital cable channelsSupports digital cable, analog cable, and ATSC terrestrial over-the-air digitalFull 1080i output over component or HDMIExtremely quiet box", "title": "TiVo TCD648250B Series3 HD Digital Media Recorder (2008 Model)", "price": 169.99, "salesRank": {"Electronics": 34673}, "imUrl": "http://ecx.images-amazon.com/images/I/410BFKEEG7L._SX300_.jpg", "related": {"also_viewed": ["B00EEOSZK0", "B000RZDBM2", "B000ER5G58", "B0036OR910", "B0036OR91A", "B006L8TX94", "B005TI1ILS", "B007JPCL88", "B000ER1G3E", "B00BUCLVZU", "B00E8HIN78", "B008RWHC0E", "B00EHHPPM0", "B000ER5G6C", "B0036F0JPC", "B008RHTXLA", "B004XIB9UA", "B002Z1JCP6", "B009D90JFA", "B00BF2M21C", "B00I6L0WSU", "B00DYYKA04", "B004HKIB6E", "B00E8HGWIK", "B00GGVPKKC", "B007FEEO3S", "B005FPT38A", "B0042AG9V8", "B00JGZQ17Q", "B0002A0206", "B006IMFT32", "B00EYO241Q", "B0050R1BCE", "B004HO58SO", "1592001114", "B0066O1DI2", "B0018LX0DY", "B009WROL6G", "B0038JECKY", "B0036OR924", "B00JQOQCD0", "B00I2ZBD1U", "B003H3A2NM", "B000XQTDR2", "B00G037DQ0", "B003MVZ60S", "B00BFIJQ10", "B00G037DQU"], "buy_after_viewing": ["B00EEOSZK0", "B000RZDBM2", "B003MVZ60S", "B00BUCLVZU"]}}