{"asin": "B00ASLSQHK", "description": "Reader usually works right out of box but sometimes you will need more information to get it working. Here is some Important and helpful tips:Does not work with iPhones, iTouch, stick pro duo, Flash drives, HC SD cards, PNY, Sony Memory CardsOnly designed to recognize JPEG files. DOES NOT WORK FOR VIDEOSWorks with SD Cards (under 24gb), Micro SD Cards and USB PlugsMake sure the USB drive is formatted as FAT32 - Create a folder in the root of the USB drive called DCIM - Make sure the file names of the pics are exactly 8 alphanumeric characters long plus a supported extension - File names must be letters and numbers ONLY - Make sure all pics end in the .jpg extension (NOT .jpeg) - (if attempting to transfer videos Make sure the videos are of a supported type: .mp4, .m4v and maybe .mov. This may work but generally videos are NOT compatible) - Folders inside the DCIM folder can be used if they are 8 alphanumeric characters long - The USB drive must use 20mA or LESS power or it will not work. - You can get USB drives that use more than 20mA of power to work by using a wall powered USB hubThe filenames MUST start with at least DSC and be only eight characters total without any spaces. Using all caps or all lower case for \"dsc\" or \".jpg\" did not matter. The other 5 characters after the DSC did not matter, but you could not use a space. Example: DSCNNuge.JPG; dscnNuge.jpg; dscnnuge.JPG; DSC0nuge.jpg would all work.SHARKK:SHARKK Lifestyle Brands offers consumer accessory solutions across many different categories such as Tablet and phone cases, Keyboards, Batteries, Speakers, Wallets,  Cufflinks, Money clips, Collar stays, and more.When purchasing a SHARKK product you can expect quality in both the material and performance of the items backed by amazing customer service and support.", "title": "SHARKK LIGHTNING 8 PIN 3 in 1 SD Card Reader Camera Kit Connects Cameras, USB, &amp; Memory Cards To The New Apple iPad AIR / iPad Mini Retina / iPad 4 (4th Gen) With Retina Display / iPad Mini / iPad Mini 2 / iPad 5", "price": 43.37, "imUrl": "http://ecx.images-amazon.com/images/I/315jSeqVOEL._SX300_.jpg", "related": {"also_bought": ["B0068RKK18", "B00HYQ4XGK", "B004TLH7C0", "B008LYU2K0", "B009WHV3I0", "B00EL94Z4I", "B003K1EYM6", "B009WHV3BM", "B00GR1I242", "B006Q7JPQ6", "B00GBG3PTU", "B00HK3JVXM", "B00GGBXRDY", "B00J8S5JJ2", "B0095R71FG", "B0093EXOCK", "B009WQOS1U", "B002VPE1Q6", "B00G7HMXUK", "B009W9JP06", "B00G5N0ZZQ", "B008MOHLVC", "B00G3D4YXW", "B005ONMDYE", "B00746WEUC", "B00G2XRVNS", "B00IK05RV4", "B00G2BX616", "B009XJX952", "B009QQMEEY", "B00B7MRUD0", "B00HEU1JGI", "B008THTWIW", "B004QHPYT0", "B00CK9DARO", "B00G9TIR9W", "B00FC2KPBA", "B001TKTHFY", "B00GMXOCBM", "B00CB7T52O", "B00G2Y5YIG", "B004M5KYGY", "B00FO0PLXW", "B00CS43I4Q", "B00FPRHUHY", "B006GH8VI4", "B00G6H1MIK", "B00CVED3UC", "B003VNKNF0", "B002EQ9NEM", "B00A4LAZMS", "B00IBDOB5I", "B00G6C6140", "B00EQ1LOF4", "B006T9B6R2", "B00EET7UHE", "B008RDI0TU", "B00B7E1D7W", "B0096M8VR2", "B007JRB0SS", "B0091DF9CG", "B004WYA852", "B000BYCON6", "B00G3TUL4C", "B00BNPS3XW", "B00D856NOG", "B00BC0KXCW", "B00G4SA1FG", "B007JRB0RE", "B00B3OA7R8", "B00EOIWKU2", "B00013BL18", "B007M51J42", "B00HNFPZF0", "B001CUF958", "B002451AB2", "B00A8OWGT6", "B00B15JZQS"], "buy_after_viewing": ["B009WHV3BM", "B009WHV3I0", "B00GMXOCBM", "B00J8S5JJ2"]}, "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories"]]}