{"asin": "B000H12IAC", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Keyboard & Mouse Combos"]], "description": "Amazon.com Product Description Now you can transition between work and fun with unprecedented ease and comfort. This ultra-thin entertainment desktop set with a rechargeable mouse delivers top-notch performance with virtually no interference--from up to 30 feet away.Rechargeable mouse2.4 GHz Bluetooth technologyWindows Start buttonUltra-thin comfort curve designBattery status indicatorNavigation padWindows Live buttonGive yourself room to move; wireless mouse and keyboard products let you work without worrying about tangled wires. The Microsoft Wireless Entertainment Desktop 7000 features 2.4 GHz Bluetooth connectivity with First Connect technology that makes it easy to connect wirelessly right out of the box. The desktop set includes a rechargeable mouse and keyboard with battery status indicators that flash when batteries need recharging.Mouse FeaturesThe mouse's 4-way scrolling feature takes advantage of Microsoft's Tilt Wheel technology, letting you scroll four ways for greater efficiency and comfort. Meanwhile, the Instant Viewer function allows you to click the scroll wheel button to instantly display your open windows. Then you just point and click to select the window you want. Another feature, the Magnifier, lets you point and click to enlarge and edit details on your screen.Keyboard FeaturesThe keyboard features an ultra-thin, ergonomist-approved \"Comfort Curve\" design that allows you to place your hands naturally and work comfortably using the distinctive quiet touch keys. This sleek design also reduces clutter on your desk, fits on your lap and complements your flat screen monitor. Meanwhile, an integrated navigation pad with cursor control makes it easy to command your PC from your lap or the comfort of your sofa.Use the Media Center Start Button to gain one touch access to Windows Media Center, or press the Windows Start Button to launch your Start menu and search your PC or the Web if you have Windows Vista installed. The Windows Live Call Button accesses your Windows Live Messenger buddy list, while the Windows Gadgets Button gives you one-touch access to gadgets such as weather information, news updates, traffic maps and slide shows of online photo albums. Plus, when you're playing music or videos media controls on the keyboard allow you to easily navigate to your next or previous track. Or use the media controls to play, pause and control volume. Lastly, the \"My Favorites\" hot key makes it easy to access the folders, files, and Web pages you use most.What's in the BoxMicrosoft Wireless Entertainment Desktop 7000 keyboard and mouse, rechargeable batteries, software CD-ROM, and Microsoft Mini Bluetooth Transceiver.", "title": "Microsoft Wireless Entertainment Desktop 7000 (Silver)", "price": 199.98, "imUrl": "http://ecx.images-amazon.com/images/I/419P3XJT3EL._SX300_.jpg", "brand": "Microsoft", "related": {"also_viewed": ["B002JCSCYS", "B000Q6UZBM", "B000MAFPVW", "B001B8EUEW", "B001B8EOMU", "B000H14IDC", "B0012OKAP8", "B007BPKHJ6", "B005HU0LX4", "B0036E8V08", "B004HVW0ZQ", "B00CYX54C0", "B003VAHYNC", "B00CYX53QW", "B005CMQIVG", "B000KA7PD0", "B005NIFB7G", "B000TKHGL2", "B0011FCV8W", "B000J43HJ8", "B008OEHS04", "B00DI79YUE", "B002NP8XJ0", "B001P9XHDM", "B0011FQUQG", "B00I14395A", "B000A6PPOK", "B0002CE0XY", "B002MMY4WY", "B0002CE0XO", "B00CIZPXRU", "B00CYX26BC", "B000CR1V5O", "B002R5AO20", "B00EQ32YPG", "B004SUO1QM", "B000GAMMBO", "B00501T8XY", "B004XLA1R4", "B002VR6A9K", "B004SUIM4E", "B000RPVGJ2", "B001S4OTS6", "B005770DJE", "B001DJ9GOS", "B004W8JBFG", "B003VAGXWK", "B00D68ZVY8", "B006GMLD7A", "B000TUK47U", "B0000642RX", "B0076KQRXG", "B0025ZH43O", "B000HCUTU2", "B004OBAJCA"], "buy_after_viewing": ["B002JCSCYS", "B00CYX54C0", "B000Q6UZBM", "B00CYX53QW"]}}