{"asin": "B006T7QRN2", "related": {"also_bought": ["B005CRHM5C", "B004EC20Y4", "B00B0N2BZ8", "B0039BPG1A", "B003VNKNF0", "B006FP9REO", "B00DELK2O6", "B00CV9MIEE", "B000GGCHUO", "B006W07FYG", "B00AE9UH3W", "B0040Z484U", "B00603RU9A", "B00C0T03HE", "B00DELJT1S", "B0000BZL7S", "B006JPMT0Y", "B00004ZCJJ", "B006V4JY0Q", "B002HZY5F2", "B002O1AH5Q", "B005ERKVC6", "B006O143QQ", "B004JMZPJG", "B00004ZCEF", "B0051GHOFC", "B004NZB37W", "B00CV9M2JU", "B004Q3C98S", "B00B0N2LDU", "B00COVYFB8", "B00603RTDW", "B000WM8LN4", "B004NROYVM", "B002DW96M6", "B00CV9MITY", "B00ATM1MGA", "B009VPQLLM", "B000KZ9916", "B005BTKQTA", "B001FA09ZA", "B00CF5OHZ2", "B00009R6KK", "B00AA48E90", "B0095F5AG0", "1937986047", "B001TZUS98", "B006W07GU4", "B0095F5AFQ", "B007SXJ2DS", "B003VNKNEQ", "B00H2BLW4S", "B004KU0RJK", "B005FDWE4C", "B004MME6A2", "B00EIA4VNA", "B004ZGM4SQ", "B00CY5XX44", "B000KL7K0M", "B003G4G6VY", "B006W3ZY6E", "B006WG12H6", "B000KZ70JE", "B00009R6K1", "B008UYSGWM", "B003658PH6", "B007S02ETU", "B0078K16IK", "B00445VDQW", "B007ADFTUG", "B00FEY24HO", "B007M54E1M", "B00B7ID99I", "B009F6X2GE", "B00DGEOG52", "B008MB71IS", "B00H2BG9BY", "B00FPKDPF2", "B000UXDHOI", "B008UYYQOO", "B007SQB896", "B007E3KZK6", "B00DQHYQVI", "B00FB463E2", "B006W07J2Y", "B007M54E08", "B00DQI1CXM", "B0084G3FKE", "B007RN5WTM", "B004N623WK", "B008CVHLT2", "B0024FB486", "B002L7FOX8", "B00I44EUBO", "B00B7ID97A", "B00HGE3C5I", "B004XIB9T6"], "bought_together": ["B003VNKNF0", "B0039BPG1A"], "buy_after_viewing": ["B003VNKNF0", "B00ATM1MGA", "B0039BPG1A", "B00HGE3C5I"]}, "title": "Fujifilm X-S1 12MP EXR CMOS Digital Camera with Fujinon F2.8 to F5.6 Telephoto Lens and Ultra-Smooth 26x Manual Zoom (24-624mm)", "price": 329.99, "salesRank": {"Camera &amp; Photo": 621}, "imUrl": "http://ecx.images-amazon.com/images/I/51nAvsSJtTL._SY300_.jpg", "brand": "Fujifilm", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The FUJIFILM X-S1 is a premium, high performance DSLR-styled long-zoom camera, built with careful craftsmanship for the  sophisticated consumer and enthusiast photographer who are looking for maximum photographic performance &ndash; and true picture quality &ndash; with a versatile long-zoom lens housed in a  durable, lightweight body.The all-new FUJIFILM X-S1, made in Japan, is the latest addition to the premium FUJIFILM X-series that includes the X100 and X10. The X-S1 features a large 2/3&rdquo; 12 megapixel EXR  CMOS sensor and a newly-developed, bright all glass and high-definition FUJINON F2.8 Wide-Angle to F5.6 telephoto lens with an ultra-smooth 26x manual zoom (24-624mm). The  FUJINON lens consists of 17 glass lens elements in 12 groups, to offer amazing clarity and high resolution through the entire image. The new FUJINON lens has a metal cam design  that delivers smooth, precise zoom control, and an O-ring that is injected with a specially blended grease similar to what is found in high definition broadcast television  lenses.The X-S1 is the ideal &ldquo;all-in-one&rdquo; camera because it offers all of the benefits of a DSLR system in a single camera and lens body. The X-S1 is designed to exceed expectations in  all photographic situations, and is especially well-suited for nature photography thanks to its impressive wide angle, long zoom and super macro capabilities all from a single  lens.The EXR processor delivers an extremely fast auto focus while minimizing shutter lag and supports high speed continuous shooting of approximately 7 frames per second (fps) at  full resolution. The premium long zoom X-S1 has a wide, 1.4 million dot electronic viewfinder (EVF) that is exceptionally bright and clear, and it includes a heads-up sensor  that automatically switches between the viewfinder and the LCD screen when the camera is raised to the user&rsquo;s eye to compose an image. The viewfinder uses two glass lenses and  one non-spherical lens to capture realistic lighting and display true-to-life images. The X-S1 has a large 3.0&rdquo; titling LCD display with a Monitor Sunlight Mode that allows  users to review their images in bright sunlight.The well-balanced X-S1 also features an enhanced, full-body, rubberized grain texture coating that adds superior grip, a hot shoe mount to add additional accessories, full 1080p  HD movie capture and milled mode and adjustment dials for exceptional feel and functionality.The FUJIFILM X-S1 features Fujifilm&rsquo;s Intelligent Digital Zoom which effectively doubles the telephoto capabilities and provides up to an amazing 52x total zoom, and a Super  Macro Mode that captures images as close as 1cm.Fujifilm X-S1 HighlightsImages Worthy of the X-Series DesignationThe FUJIFILM X-S1 features the same large 2/3-inch 12MP EXR-CMOS sensor as the FUJIFILM X10 to ensure high quality images regardless of the lighting conditions. The unique EXR- CMOS technology, pioneered by Fujifilm, allows the user to switch between three modes depending on the lighting conditions &ndash; or leave the camera to make its own choice in the  EXR Auto Mode.Switching between the modes changes the performance of the sensor. The High Resolution option is perfect in bright conditions or when the very best picture quality is the  primary aim. Wide Dynamic Range mode can be used in scenes of high contrast when the user wants to get details in both shadow and highlight areas of an image, while the High  Sensitivity &amp; Low Noise option should be selected for optimum results in low light conditions.Coupled to the EXR-CMOS sensor is the high speed EXR processor, which offers a minimal shutter lag of just 0.01 seconds and a high speed continuous shooting capability of 7fps  at full resolution (Large JPEG) or 10fps at six megapixel resolution (Medium JPEG).Extraordinary versatilityAt the heart of the FUJIFILM X-S1 is the FUJINON 26x optical precision zoom lens that offers a focal range of 24-624mm with its bright and fast f/2.8 maximum aperture at the  wide-angle zoom setting.The X-S1 FUJINON lens delivers images with superb edge-to-edge sharpness and amazing clarity. The lens construction is of the highest standard, featuring metal cams for smooth  zoom control and fast, precise framing.The FUJIFILM X-S1 is also ideally suited for capturing subjects close up. In standard Macro mode, the zoom focuses as close as 7cm, but by selecting Super Macro Mode, users can  focus as close as 1cm for frame-filling close-up images. Furthermore, the lens&rsquo; aperture is made up of nine blades for excellent \"bokeh\" effect photography.Full Manual Controls for Maximum FlexibilityPhotographers who prefer full manual controls will enjoy the flexibility of the X-S1 with its full range of conventional shooting functions (program/shutter-priority/ aperture- priority/manual). The extensive external controls give the more advanced photographer direct access to virtually every control they will need for uninterrupted shooting, and the specially  designed chassis includes dedicated command buttons for quick and easy key functions such as ISO, white balance, focus and metering.The large command dial, manual focus ring, twist and zoom lens barrel, bright, clear electronic viewfinder, high quality tilting LCD screen and deep hand grip ensures the camera  handles well. Additionally, the X-S1 provides four auto bracketing options, eight Film Simulation and white balance functions and Raw file shooting capabilities.For simplicity, the X-S1 automatically assesses the subject and then selects the relevant scene mode for the perfect result, automatically switching the EXR-CMOS sensor  accordingly. Not only does it determine the type of scene being photographed, it can also calculate whether an image contains a person, features backlighting or has any subject  movement. ISO settings are adjusted by the Auto ISO mode, which selects the optimum setting between ISO 100 and 3200. Those after more ISO flexibility can manually select up to  ISO 12800 (Small JPEG format only).HD Movie Capture and High Speed MoviesThe FUJIFILM X-S1 captures full 1080p High Definition (1920 x 1080 pixels) movie with stereo sound at 30fps, which is saved in the H.264 format profile compression for smaller  file sizes without sacrificing quality. With a mini-HDMI output connector, it is easy to connect and view images on your HDTV (HDMI cable not included). Versatility is further  increased thanks to the High Speed Movie options, which include capture at an incredible 320fps. With features like this, even the fastest moving subjects can be captured and  watched in slow motion.RAW / RAW+JPEG ShootingThe X-S1 has the ability to shoot both a RAW and JPEG shot simultaneously. RAW is for ultimate quality shots via post processing, JPEG is for great quality with no need for  further post-production work.Motion Panorama 360&deg;The FUJIFILM X-S1 delivers exquisite panoramas by allowing its sensor to extend the sweep range to 360&#x2DA; (shots can also be taken vertically). Combined with high quality Fujifilm  printing, sweeping and impressive scenes can be taken, showing fine detail, low noise and high resolution at 180&deg;, 240&#x2DA; or full 360&#x2DA; panoramic ranges.Clear Viewing and Reviewing for Ideal ResultsThe FUJIFILM X-S1 offers a powerful combination of a high quality electronic viewfinder and a tilting LCD screen to ensure composing and viewing images is quick and simple,  regardless of the lighting conditions.The 0.47-inch electronic viewfinder (EVF) features 1.4 million pixel resolution for superb image clarity and has a wide viewing area of 26 degrees for better image framing. The  bright EVF makes it easy to check settings or adjust focus manually.The large, tilting 3&rdquo; LCD features 460,000 pixel resolution making it easy for users to scroll through menus, assess exposure accuracy and view images. The LCD also offers a  useful Sunlight mode that allows for easy viewing in even the brightest locations.FUJIFILM X-S1 key featuresLarge 2/3-inch 12 MP EXR-CMOS sensorHigh quality FUJINON 26x optical precision zoom 24-624mm (35mm  equivalent) with Intelligent Digital Zoom boosting focal range up to 52x and Optical Image StabilizationSuperb build quality and finish with rubberized coating and metal dialsUp to 10fps continuous shootingLarge tilting 3&rdquo; 460,000 pixel resolution LCD screen with Sunlight modeLarge EVF with 1.4 million pixel resolution and 26 degree viewing angleFull 1080p HD movie with stereo soundSuper Macro focusing as close as 1cmRaw and jpeg shootingFilm simulation modesProgram / Shutter-Priority / Aperture-Priority / Manual modesLithium Ion rechargeable battery providing up to 500 shots per charge360&deg; Motion Panorama mode"}