{"asin": "B002VA56I8", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "\"This is the best sports cam I've ever used.\" Gizmodo's Best Gadgets, 2009The World's Highest Performance Wearable 1080p HD Video &amp; 5MP Photo CameraFull HD Video, 3 Flavors- The HD Helmet HERO offers three different HD resolutions, giving you three filming modes to capture the best angles for any given activity: 1080p (127&ordm; angle @ 30 fps, 16:9 aspect ratio), 960p (170&ordm; angle @ 30 fps, 4:3 aspect ratio), and 720p (170&ordm; angle @ 30 OR 60 fps, 16:9 aspect ratio).5MP Photos, Automatically- Shoot hands-free, 5 megapixel photos automatically at 2 / 5 / 10 / 30 / and 60 second intervals until the batteries die or the SD card is full (2.5 hours). Or set it to single shot, triple shot, or self timer for more traditional photo taking.Audio Excellence- We&rsquo;ve invested more in the HD HERO camera's sound system than most companies spend on their entire camera development. You&rsquo;ll only be hearing the sounds of your sport, not the howl of the wind. How? Obsessive audio engineering and an understanding that good sound is as important as good video.Shockproof &amp; Waterproof to 180' (60m)- Proven in heavy surf from Hawaii to Tahiti, Southern Mexico to Northern California, HD HERO cameras can handle it thanks their highly engineered polycarbonate exoskeletal housing. Ready for action ranging from scuba diving to dirt track racing, and tough enough to take a spin across the asphalt, GoPros are built to take a beating &amp; keep filming. Replacement lens kits &amp; housings are available, so there&rsquo;s little worry while going for glory - even while diving with sharks.Rechargeable Lithium-Ion Battery, Built-in Warmer- The rechargeable 1100mAh lithium-ion battery (included) lasts for 2.5 hours of constant recording. It can be recharged to 80% capacity in just 2 hours when plugged into a computer&rsquo;s USB port, or in 1 hour when plugged into a USB compatible wall or car charger. Camera can also be used while charging, and features an integrated battery heating system for keeping your battery warm in winter activities.Shoot 8+ hrs of HD Video with 32GB SD Card- Media saved to SD card, up to 32GB capacity (SDHC). Average recording times using a 32GB card: 1080p @ 30fps = 4h 21m, 960p @ 30fps = 5h 26m, 720p @ 60fps = 4h 21m, 720p @ 30fps = 8h 09m, WVGA @ 60fps = 8h 09m.Editor's Choice Award - Video Camera Category, Backpacker Magazine, April 2009What's Included: A Complete HD Helmet Camera Mounting SystemIncluded are mounts for attaching the camera to 2 curved, solid helmets, two flat surfaces such as snowboard or vehicle hood, a head strap allowing you to wear the camera like a headlamp, and a lace-through strap-mount designed for vented helmets. Waterproof camera housing, cables, &amp; battery also included. SD card sold separately.1 HD HERO Camera-- The HD HERO camera is compatible with all other GoPro HERO camera mounting accessories, so it's very easy to expand the functionality of your camera to also suction cup to vehicles, clamp to bike handlebars and seat posts, mount to surfboards, and even be worn on the wrist or chest.1 Shockpoof &amp; Waterproof Camera Housing-- Waterproof to 180' (60m) &amp; semi-indestructible polycarbonate camera housing protects your HD HERO &amp; your footage from the elements &amp; any unforseen tumbles or crashes, while also attaching to various mounting locations via a quick-release clip. Change mount locations with ease, and charge it without fear.1 Rechargeable Lithium-Ion Battery-- Comes with an 80% charge out of the box, ready to go! Provides approx. 2.5hrs of record on a full charge.USB, HDTV, &amp; Composite Video+Audio Out Cables-- All the cables you need to download &amp; output photos, video &amp; audio are included: 1 USB cable to download raw .mp4 files to your computer, 1 component video (HDTV) cable, and 1 composite video + audio out cable. Each has a port on side of camera as shown.1 Head-Strap Mount-- For times when a helmet isn't necessary, but you still want the perspective of a first-person head cam, the GoPro head-strap mount hooks you up. Just slip it over your head or knit cap, and adjust to fit.6 Different Helmet Mounts + Extra Quick-Release Buckle-- The HD Helmet HERO empowers you to rig multiple surfaces with mounts and quickly move the camera between filming locations depending on your chosen activity. 2 curved adhesive mounts for solid helmets, 2 flat adhesive mounts for boards, walls, or car hoods, 1 three-way pivot arm for dialing in the right angle, &amp; 1 strap-mount for vented helmets used in cycling &amp; mountain biking.", "title": "GoPro HD Helmet Hero", "price": 299.99, "salesRank": {"Camera &amp; Photo": 3376}, "imUrl": "http://ecx.images-amazon.com/images/I/51KWTr0n4JL._SY300_.jpg", "related": {"also_bought": ["B001C9P5TO", "B005NC8BF6", "B001DEUWDC", "B0037T6O6A", "B004M187ZI", "B0025UEQQW", "B0055J2XQK", "B003U6Y1OC", "B00CV9MHYU", "B005WY3TI4", "B005WY3TMA", "B002PAX9QU", "B0014F5WIA", "B004Q3C98S", "B007J4BOWI"], "buy_after_viewing": ["B00GXKTEUI", "B009QZH6JS", "B00F3F0GLU", "B00F3F0EIU"]}}