{"asin": "B001D0IWDS", "description": "Don't just straighten your hair. Make it look salon beautiful everyday with the HP4669/05 Thermal Creations Straightener from TRESemm&eacute; Philips. Designed in Europe, this styling product combines salon expertise with technological innovation. It heats up to 210 degrees Fahrenheit within 30 seconds, and gives you long-lasting, professional results in the simplest, most user-friendly way..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; }Get salon quality results in your own home with TRESemm&eacute; Philips.View larger.Shiny, Straight StylesThe Thermal Creations Straightener helps create superbly shiny, straight styles for women with short to medium-length hair. It also allows you to focus on smaller sections of longer hair, giving you the freedom to create your own unique look. Nano-diamond technology offers advanced even heat distribution at a professional styling temperature of 420 degrees Fahrenheit. And the ultra-smooth, one-inch thick nano-diamond ceramic plates reduce friction and provide effortless gliding so every strand is straight, sleek, and sporting a healthy sheen.Even heat distribution eliminates damaging hotspots.2-inch Nano-Diamond Ceramic plates enable smooth gliding and produce shiny hair.Up to 420 degree professional high heat for long-lasting results.EHD+ Technology StraightenersA high level of heat--vital to creating smooth, straight strands--can be hard on hair, especially when it's concentrated too long in one area. That's why Thermal Creations Straightener offers optimal even heat distribution (EHD+) at high temperatures without damaging hotspots. The intensity of heat instantly straightens even stubborn curls and waves, so you can quickly glide the straightener through without leaving behind frazzled hair.Smart Contact PlatesThe Thermal Creations Straightener features smart contact plates that do their job without over-drying hair. They maintain maximum contact and provide a smooth, cushioned glide from root to tip. This process allows for more manageability, and sleeker results in less time. There's also a nine-foot professional swivel cord so you can reach every strand, even in the back, and a variable heat setting with digital temperature control up to 420 degrees, which makes it a snap to find the right level of heat for your hair type and style.Easy-to-UseAlthough the Thermal Creations Straightener is designed to give you salon-quality results, you don't have to be a salon professional to use it. This handy tool is a cinch to operate, and you never have to guess when it's done heating up, thanks to the convenient \"Ready-to-Use\" indicator.There's also a hanging loop for space-saving storage that helps prevent tangling of the cord, and a handle storage lock. And you'll never have to worry that you forgot to turn it off after use; the Thermal Creations Straightener automatically shuts itself off after one hour.One-Inch Plates for Limitless StylesThe Thermal Creations Straightener offers limitless styling options--from straightening every strand, to smoothing out sections that frame the face. It's also great for adding contrast to an up-do. Additionally, one-inch plates give you the freedom to style your short to medium-length hair quickly and easily, without worrying about finer or thinner pieces falling out.The Thermal Creations Straightener is backed by a two-year warranty.What's in the BoxStraightener, one heat-resistant storage pouch, and one two-ounce bottle of TRESemm&eacute; Thermal Creations Heat Tamer Spray.TRESemm&eacute; Philips HP4669/05 Thermal Creations Straightener", "title": "TRESemme Philips HP4669/05 Thermal Creations Straightener, 1&quot;", "imUrl": "http://ecx.images-amazon.com/images/I/31uVGd3ApxL._SX300_.jpg", "salesRank": {"Beauty": 302096}, "categories": [["Beauty", "Hair Care", "Styling Tools", "Irons", "Flattening Irons"]]}