{"asin": "B00CXCCH1I", "description": "With its first new major sports league partnership in over a decade, EA SPORTS presentsEA SPORTS UFC. The next-generation of fighting has been built exclusively for the PlayStation 4 and XBOX ONE by the team behind the critically-acclaimed Fight Night franchise.Powered by EA SPORTS IGNITE technology,EA SPORTS UFCbrings the action, emotion and intensity inside the Octagon to life in ways that were never before possible. The next-generation of True Player Motion not only showcases the diverse, powerful and fluid of attacks of elite mixed martial artists through Precision Movement, Dynamic Striking and Strategic Submission Battles, but also brings the combatants to life with Full Body Deformation and Real-Time Exertion. The simulation of Human Intelligence takes leaps forward with the strategic and adaptive MMAi system and is expressed through the most realistic characters ever created in a sports game.Feel the Fight &ndash; Gameplay FeaturesStep into the Octagon with the most realistic take on fighting ever achieved. Powered by EA SPORTS IGNITE technology, every fighter, strike, takedown and submission will make you feel the fight.&bull;MMAi&ndash; A mixed martial artist&rsquo;s mind is as important as his heart. Every licensed fighter in the game will have changing goals and fight plans, based on their real-life tendencies and each fight situation. Stop their Plan A, and they will adapt to Plan B or C. Down on the scorecards, look for the AI to end the fight with a knockout or a submission. A smarter opponent equals a more challenging and unpredictable fight.&bull;Full Body Deformation&ndash; Until now, simulation of physical contact between fighters was limited to bodies that barely made contact with each other; as a result, they looked and behaved like action figures made of plastic rather than elite athletes. The team that revolutionized sports by bringing authentic physics to the Fight Night franchise changes the game again with an all-new, full-body deformation system that moves and displaces the fighter&rsquo;s flesh in real time. For the first time, the strength of every submission and power of every strike will truly make an impression.&bull;Real-Time Exertion&ndash; A UFC bout is one of the most physically demanding sports on the planet requiring mixed martial artists to give it their all with every movement. Real-Time Exertion brings each moment of that action to life in your gameplay experience. Through real-time vein popping, skin discoloration, muscle flex, as well as signs of fatigue setting in through the course of each round, you will witness the effort it takes to be one of the best fighters in the world.&bull;Fighter Likeness and Facial Animations&ndash; EA SPORTS UFC will set a new bar for character likeness and emotion in gaming. For the first time in an EA SPORTS game, every single licensed athlete in the game has been created from high resolution 3D head and body scans to deliver revolutionary character likeness and authenticity. Powered by EA SPORTS IGNITE, new facial animation technology delivers more expression, emotion and will communicate greater sense of awareness and intelligence in the Octagon.&bull;Precision Movement&ndash; MMA is a sport of inches, where every step counts and every movement matters.  Powered by EA SPORTS IGNITE, the Precision Movement locomotion system grounds the fighters, eliminating unrealistic slipping and sliding across the canvas. More realistic physics-driven movement delivers more realistic action as the overall transfer of energy from the ground up delivers more impactful and believable strikes and takedowns.&bull; Dynamic Striking&ndash; A mixed martial artist uses the environment to his advantage and for the first time in a UFC game, you can too. A dynamic environment allows you to pull off jaw-dropping moves using the Octagon, including roundhouse kicks, superman punches and much more. Combine those abilities with the best striking technology in the industry and that one perfect strike could change the fight.&bull;Strategic Submission Battles&ndash; To own the belt, you have to be dominant on your feet and on the mat.  EA SPORTS UFC re-invents the ground game to create a battle for position and control that captures the strategy of a submission battle. Like the real sport, in EA SPORTS UFC fighters will work through multiple stages as they work to advance or escape from a fight-ending submission.&bull;Real Damage&ndash; Every fighter knows that one good shot can ruin your day.  EA SPORTS UFC introduces a non-linear damage system which can result in big damage coming from a single strike. The system produces a greater variety of cuts and contusions that is true-to-life and has never been possible in a simulation fighting game.", "price": 59.99, "imUrl": "http://ecx.images-amazon.com/images/I/510xZgGRSnL._SY300_.jpg", "related": {"also_bought": ["B00BI83EVU", "B00BGA9X9W", "B00BGA9WK2", "B00CXCCI8A", "B00D3RBZHY", "B00DBRM3G8", "B00GG4BBUM", "B00D4WTO1M", "B00BMFIXOW", "B00G6MW540", "B00FJWNSU8", "B00DS0MQUQ", "B00HD4R5YU", "B00HGLLRV2", "B00BGAA3S2", "B00DUARBTA", "B00CYS5DU8", "B00ENFVJJO", "B00DHF39KS", "B00BGA9YZK", "B00CYS5GEQ", "B00IMVRVC4", "B00GZ1GUSY", "B00C27SCC2", "B00D8S4GRY", "B00IGI3G3G", "B00DCBDNW6", "B00EW6QT76", "B00H5V9S6E", "B00BGAA0SU", "B00I0574EW", "B00JUFSH9M", "B00HHUSNPU", "B00BGAA29M", "B008I62B4Q", "B00J226358", "B00K1JBLO4", "B00C7103C0", "B00ECOAX9I", "B00HVBPRUO", "B00JK00S0S", "B00KEME28K", "B00FJWNSXK", "B00GLSGCKW", "B006ZTHF62", "B0050SXKU4", "B0053BSOD6", "B00KQV9TNC", "B002I0H09Y", "B00GFMMWZI", "B00DCDZP7A", "B00L3KU0S8", "B0050SW93S", "B007MM9E2E", "B00I9UVY30", "B006ZTHFPS", "B00FMNNQAQ", "B00CD90R7M", "B00FMNNQCY", "B008CP6MA2", "B004UDB9SA", "B007BJNR6C", "B00IIB2K4C", "B0050SW8OS", "B00KVJ14X2", "B0074LJ3CE", "B00GOOSV98", "B00GHIPFDG", "B003NSLGW2", "B00B7XCDCM", "B0088MVP3S", "B00GHJ6X8G", "B00JQHU9RC", "B00EFFVZP0", "B0050SWR6M", "B00EADTVL2", "B00J48MUS4", "B00K586O7K", "B00FM5IY38", "B00KPY1GJA", "B00BMFIXKQ", "B003O6KWZK", "B00GY4OAMU", "B00AY1CT3G", "B00CMC6HCY", "B00KVP78FE", "B00FJWNSS0", "B0050SWYTC", "B00DC7G2W8", "B00EI4V3X2", "B00FRESXSA", "B00K31C478", "B00KBZHSV8", "B00D7QXAY2", "B00CEGPXM8", "B0022TNO7I", "B00D4AK17A", "B00ITSX192"], "bought_together": ["B00BGA9WK2", "B00BGA9X9W"], "buy_after_viewing": ["B00BGA9WK2", "B00CXCCI8A", "B00GG4BBUM", "B00DBRM3G8"]}, "salesRank": {"Video Games": 102}, "categories": [["Video Games", "PlayStation 4", "Games"]]}