{"asin": "B005E9NDUG", "description": "The EP600 G2-WLAN is a premium digital media player designed to easily play videos, music or photos from USB drives of any size. With its fast Gigabit LAN network connectivity and built-in 802.11n WLAN wireless networking, the EP600 G2-WLAN can play streamed media content over the home network or from Internet sources. Whether playing heart warming home videos in the comfort of a living room or rendering a jaw dropping 3D blockbuster movie experience in a home theater, the EP600 G2-WLAN is an exceptionally versatile choice for all media playback needs.Next-Gen PowerfulThe EP600 G2-WLAN incorporates the powerful Realtek RTD1186 processor with fast DDR2 memory for stunning video quality and fluid playback at up to 1080p full HD resolution. It easily handles demanding formats such as full BD ISO files, including playback of all popular 3D video formats over HDMI. The EP600 G2-WLAN's built-in Gigabit LAN smoothly streams any supported media format, while its 802.11n WLAN enables convenient wireless media streaming. For unmatched storage capacity, the EP600 G2-WLAN includes support for hard drives larger than 2TB.A Universal Media PlayerThe EP600 G2-WLAN provides flawless playback for all of today's popular media file formats up to 1080p - no more guessing whether a video you just got is supported!- Video Files - BDMV, BD-ISO, MKV, MOV, WMV, TS, M2TS, MTS, FLV, AVI, DVD-ISO, VOB, M2P, MP4, MPG, DAT, ASF, TP TRP, SWF- Video Codecs - H.264/AVC, MPEG1/2/4, DivX/Xvid, VC-1, and RMVB- Audio Formats - DTS/DTS-HD MA, Dolby AC3/True-HD, LPCM, ADPCM, FLAC, APE, LC-AAC, HE-AAC, MP3, OGG, WAM, WAV- Image Formats - JPG, GIF, PNG, BMP, and TIFWhat's Included:- EP600 G2-WLAN Player- IR Remote Control- 110-240V AC Adapter- SATA Cable- User's Manual", "title": "Micca EP600 G2-WLAN 1080P 3D Digital Media Player with 802.11n WLAN, Gigabit LAN Network, 7.1 HD-Audio (Realtek 1186)", "price": 39.95, "imUrl": "http://ecx.images-amazon.com/images/I/415F0zcBzgL._SY300_.jpg", "related": {"also_bought": ["B008CBQSKU", "B002XVBAKI", "B008NO9RRM", "B008I64126", "B0002L5R78", "B0069MGRG4", "B00BVUNZUU", "B0085JBI6S", "B000N99BBC", "B005T3GRLY", "B005KOZNBW", "B005KFHVES", "B00834SJU8", "B005UA3I72", "B002P6W8E8", "B006U3O566", "B001QUA6RA", "B00F3F38O2", "B00B99JU4S", "B005HMKKH4", "B0052SCU8U", "B00829THLE", "B00E3RH61W", "B00316263Y", "B0019EHU8G", "B008JJLW4M", "B00BFFQN3M", "B0049SCB2Y", "B009QZH6JS", "B005DKZTMG", "B000WX9DWG", "B004Z0S6WK", "B003X7TRWO", "B00A20KIXW", "B004VFJ9MK", "B000CR1FGE", "B0061RJSWC", "B00APP6694", "B00EHBEUZO", "B002N2EHVQ", "B00E055H5O", "B008JJLZ7G"], "buy_after_viewing": ["B008NO9RRM", "B002XVBAKI", "B00CHDSPSM", "B005KOZNBW"]}, "categories": [["Electronics", "Television & Video", "Streaming Media Players"]]}