{"asin": "B001G5ZTN6", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "It&rsquo;s so easy to capture the magic of every moment when SD880 IS Digital ELPH comes along for the ride. There&rsquo;s a terrific sense of creative options for your photographic sense with a wide range of shooting modes and a wide-angle 28mm lens--all because your camera sees the world without limits. Of course, it&rsquo;s a stylish point of view from a camera that merges up-to-the-moment performance with the art of impeccable design.PowerShot SD880IS HighlightsSlick 10.0-megapixel camera expands the Digital ELPH line to allow greater creative freedomWith the PowerShot SD880 IS Digital ELPH camera&rsquo;s 10.0 megapixels of imaging power, you&rsquo;ve got a passport to unsurpassed image quality and versatility. Go ahead, enlarge pictures bigger than ever before without worrying about the image quality. And look forward to much more creative flexibility when you&rsquo;re cropping and printing. The SD880 IS Digital ELPH may be ultra-slim and sculpture-sleek, but its focus is on the power of visual impact.4x optical zoom with Optical Image Stabilizer plus a 28mm wide-angle lensWhen it&rsquo;s time to take a closer look, the PowerShot SD880 IS Digital ELPH features a 4x Optical Zoom and advanced Optical Image Stabilizer, greatly minimizing camera shake and maximizing the brilliance of every detail. And Canon&rsquo;s precision 28mm wide-angle lens lets you capture more in every frame, so everyone fits in a family gathering shot.Large high-quality 3.0-inch PureColor LCD IIThe PowerShot SD880 IS Digital ELPH gives you a large 3.0-inch LCD screen for excellent control when framing your shots. Canon&rsquo;s PureColor LCD II offers spectacular color, resolution and contrast even when viewed at an angle. The screen is highly durable and easy to see in any light with a scratch-resistant, antireflective coating. It also features Night Display for easy viewing in low light--a perfect feature for gathering friends and family around to see your images.New DIGIC 4 Image Processor improves Face Detection, adds Servo AF, Face Detection Self-Timer and Intelligent Contrast CorrectionDIGIC 4 Image ProcessorCanon&rsquo;s proprietary DIGIC Image Processors have long set its cameras apart from the competition, and the new DIGIC 4 sets the bar even higher. Faster, more accurate noise reduction delivers better image quality, even at high ISO speeds.iSAPS Technologyis an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the advanced DIGIC 4 Image Processor to improve focus speed and accuracy, as well as exposure and white balance.A newFace Self-Timerautomatically detects an increase in the number of faces and makes the appropriate adjustments. For instance, to include photographer&rsquo;s face in a group shot, there&rsquo;s no need to rush in. Just put the camera on a stand or tripod, and specify Face Self-Timer, and the camera will wait for the photographer&rsquo;s face to get on-camera before it takes the shot. Motion Detection now tracks moving subjects in a much larger range, and the new Servo AF retains focus on a moving subject after the shutter button is pressed halfway -- allowing you to wait for the perfect shot without refocusing. Also, Face Detection and Motion Detection are markedly improved.Intelligent Contrast CorrectionDIGIC 4 also makes possible the new i-Contrast (Intelligent Contrast Correction) system, which controls the compensation level in pixel units to brighten dark areas while leaving bright areas unchanged for better images where the main subject is dark, and more natural transition. The PowerShot SD880 IS Digital ELPH can even use i-Contrast in playback mode to adjust images that were shot without the setting activated.Red-eye Correctionprovides three options for removing red-eye from subjects in flash pictures.1) The Red-eye Correction during shooting actually identifies and corrects red-eye in human subjects as pictures are taken.2) The SD880 IS Digital ELPH can be set to automatically detect and correct red-eye during image playback.3) You can manually locate any red eyes in a scene during image playback on the LCD screen, and command the camera to remove them.Life doesn&rsquo;t give you second chances to capture special times. That&rsquo;s why the SD880 IS Digital ELPH features ISO 1600 and High ISO Auto settings that reduce the effects of camera shake and sharpen subjects in low-light situations, giving you greater shooting flexibility. ISO can be expanded to 3200 when you select ISO 3200 Special Scene mode.A wide range of shooting modes to capture anythingNow you&rsquo;re free to concentrate on what really counts--your subject. All you have to do is turn to the setting that best matches the scene you&rsquo;re viewing through the lens. The PowerShot SD880 IS Digital ELPH does the rest. It chooses the perfect exposure, aperture and flash. You&rsquo;ve got Special Scenes Modes to handle a wide range of common shooting situations--effortlessly.With 19 Shooting Modes including 16 Special Scene Modes, you&rsquo;re ready for whatever shot comes your way.Print/Share Button for easy direct printing and downloadingThe PowerShot SD880 IS Digital ELPH's Print/Share button makes direct printing easier than ever. Simply connect the SD880 IS Digital ELPH to a Canon PIXMA Photo Printer or SELPHY Compact Photo Printer or any PictBridge compatible photo printer, press the lighted Print/Share button and print! Also use the Print/Share button to transfer images to a computer (Windows and Macintosh). Print your own ID photos in up to 28 different sizes or use the Movie Print function to output multiple stills from a recorded movie on a single sheet with a Canon SELPHY Compact Photo Printer.What's in the BoxPowerShot SD880IS Digital ELPH bodyWrist Strap WS-DC7SD Memory Card SDC-32MBattery Pack NB-5LBattery Charger CB-2LXAV Cable AVC-DC400Interface Cable IFC-400PCU (USB)Solution Disk", "title": "Canon PowerShot SD880IS 10MP Digital Camera with 4x Wide Angle Optical Image Stabilized Zoom (Silver)", "price": 299.0, "salesRank": {"Camera &amp; Photo": 5262}, "imUrl": "http://ecx.images-amazon.com/images/I/415kZtKwwcL._SX300_.jpg", "related": {"also_viewed": ["B001SER47O", "B0012YSSRK", "B0035FZJKI", "B0040702HK", "B0011ZK6OS", "B001SER47Y", "B001SER46K", "B003P8QLTI", "0596801440", "B0035FZJKS", "B0035FZJJ4", "B000Q30420", "B001BZDVDG", "B001SER492", "B0012YC7AE", "B0075T7NW2", "B000NK6J6Q", "B001SER48I", "B0035FZJLM", "B0075SUFSC", "B000NK8EWI", "B00HLDFNKQ", "B0011ZCDKS", "B000V1VG2O", "B001V7KS5I", "B008006BZA", "B003ZSHNGS", "B001G5ZTOU", "B0007WK8KS", "B00I58LZRG", "193647493X", "B001AK1DOG", "B006UMM1AY", "B000E5SGI4", "B00DMS0GTC", "B001C71IEM", "B004J3V8UU", "B004J3ZXGU", "B00009ND90", "B001RNP8MO", "B0011ZK6PC", "B0035FZJL2", "B00I0B66B8", "B0035FZJJE", "B00ADSSCQI", "B005HRQPN2", "B006UMM1UO", "B007XZE5X8", "B005II5OLY", "B000NK5Z8Y", "B004J3ZV62", "B003ZSHNF4", "B0052LH4F6", "0615207839", "B006UMM2AI"], "buy_after_viewing": ["B003VNKNEQ", "B003VNKNF0", "B00AWYN0ME", "B007BJHETS"]}}