{"asin": "B0028AD7BE", "categories": [["Electronics", "Home Audio", "Stereo Components", "Receivers & Amplifiers", "Component Receivers"]], "description": "From the ManufacturerOnkyo HT-RC160 7.2-Channel Receiver: Superb Versatility and Performance from an Affordable A/V CenterpieceIn these testing economic times, you can trust Onkyo to deliver maximum bang for your hard-earned buck. With the new HT-RC160, you have a multi-talented 7.2-channel receiver that offers the latest connecting, upscaling, and decoding technology on a bedrock of obsessively fine-tuned Onkyo amplification. Five HDMI 1.3a inputs enable clean, one-cable connection of multiple high-def sources, including Blu-ray Disc, gaming consoles, and set-top boxes. As well as handling native 1080p and upscaled 1080i video, HDMI 1.3a can also carry the HD audio of DTS-HD Master Audio&trade; and Dolby&reg; TrueHD. The HT-RC160 even includes Dolby&rsquo;s latest technology, Dolby&reg; Pro Logic&reg; IIz, which adds \"front height\" channels to bring a spacious new vertical dimension to the sound stage. Along with intelligent Audyssey equalization and Faroudja deinterlacing technologies, the HT-RC160 gives you a ton of connectivity options, so you can incorporate HD Radio&trade;, iPod&reg;, and more.Advanced Video and Audio Performance from Onkyo.caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }How Does the HTRC160 Compare to Other Onkyo Receivers?The Onkyo HTRC160 is similar to the popular Onkyo TX-SR607 and has almost all of the same features. However, the HTRC160 trades a different styling on the volume knob, one less HDMI input, 10 fewer watts per channel, and lack of satellite radio support for a more affordable package and is perfect as an entry-level high-end receiver.1080p Video and High-Def Surround Sound via HDMI 1.3aIncorporating HDMI version 1.3a, along with advanced processing capabilities, the HT-RC160 makes for a powerful A/V control center. Up to five components can be connected via HDMI, including Blu-ray Disc players, gaming consoles, and set-top boxes. The HT-RC160 can receive and switch high-def media, such as HD broadcasts and Blu-ray Discs, and send a pure digital output to your HDTV. What&rsquo;s more, all multichannel audio&mdash;from bit-for-bit streams to standard Dolby Digital&mdash;can be input via HDMI for processing on the HT-RC160. HDMI version 1.3a enables CEC (Consumer Electronics Control) and offers greater bandwidth to deal with higher resolutions, 36-bit Deep Color&trade;, and high frame rates. HDMI version 1.3a supports Deep Color&trade;, x.v.Color&trade;, LipSync, Dolby TrueHD, DTS-HD Master Audio, DVD-Audio, Super Audio CD, Multichannel PCM, and CEC.", "title": "Onkyo HT-RC160 7.2-Channel A/V Surround Home Theater Receiver (Discontinued by Manufacturer)", "price": 399.95, "salesRank": {"Electronics": 90906}, "imUrl": "http://ecx.images-amazon.com/images/I/41m5FqV-LBL._SX300_.jpg", "related": {"also_viewed": ["B0077V88W2", "B008CXTX5U", "B00HN1S44I", "B00CLXO14K", "B0077V88VI", "B007JOO4YS", "B00BLGUKEI", "B004O0TRD8", "B0077V8930", "B00BLGUKDE", "B004UR486G", "B0077V88YU", "B00BLGUKBQ", "B00548SKH8", "B00505F01E", "B00BHC7ZT4", "B00IQ0SDVY", "B00EE18O7W", "B00BHC7ZTE", "B00IQ0SE22", "B007JOO4XE", "B009HB2USI", "B00IK4DUB4", "B00B7X2OTY", "B00B981F4M", "B0054N9RQQ", "B00JPJ33MO", "B002C73WRW", "B00B981F1U", "B007R8U5QW", "B00CAAQHBE", "B007JF85VU", "B00KFQG6C0", "B00BKXCKRC", "B000GU78Z4", "B007JF861O", "B00B981F38", "B00FBV006C", "B00B7X2OW6", "B00829USIU", "B007R8U5R6"], "buy_after_viewing": ["B0077V88W2", "B00B981F1U", "B00BLGUKDE", "B0077V8930"]}}