{"asin": "B000R0SS3Y", "description": "This template creates an A+ review that contains an opening paragraph, followed by three columns that contain a left column for logo and images, a center column for lists and features, and a right column for images that can be clicked through. The last part of the template is a paragraph for more text if necessary.Intro Paragraph (Need at least 250 characters here)Step into the world ofToo HumanAs the cybernetic god Baldur, you are thrust into the midst of an ongoing battle that threatens the existence of mankind. An ancient machine presence has forced the god's hand. In the first part of a trilogy, Baldur is charged with defending humanity from an onslaught of monstrous war machines bent on the eradication of human life.InToo Human, players experience a nonstop barrage of action powered by the integration of melee and ranged firearms combat and fueled by breathtaking visuals enabled by the Xbox 360. Battles unfold in awesome scale as players engage with vast numbers of enemies.Left ColumnLogo Image (Assumes a logo of 200ppx)Center ColumnKey FeaturesThe birth of an icon-Fight as the powerful cybernetic god Baldur battling his way through enemy armies to become one of gaming's renowned iconic heroes. From weaponry and armor to combat techniques and combos, you can fully customize Baldur to become the best possible hero.Epic beginning to a captivating trilogy-Begin the saga of Baldur in the first chapter of an exciting three-part narrative in the tradition of classic trilogies such asStar WarsandLord of the Rings.Explosive melee and firearms combat-It will take more than brawn and raw strength to supplant the machine hordes. Utilize a sophisticated blend of seamless melee and firearms combat to vanquish foes near and far. Witness the fluid grace of heroes and enemies in battle as enacted by the motion-capture group F.A.S.T. Feel each punishing blow through advanced visual effects made possible through the horsepower of Xbox 360.Advanced cinematic presentation-Characters and environments come to life with unparalleled visual fidelity. Experience the full excitement of combat through a dynamically driven presentation system that portrays the combat with cinematic quality. Survive pulse-pounding battles against hundreds of on-screen enemies set against the vast landscape of theToo Humanworld. A sweeping orchestral score sets the mood for heartbreak, anger and bloodlust as each tune encapsulates you within the immersive gaming environment.New level of accessibility through intuitive combat-Perform Baldur's elaborate and complex combat maneuvers through the press of a button and chain together hundreds of rapid-fire attacks and combos with ease. Through the use of an intuitive combat system,Too Humandelivers gameplay that is easy to learn and rewarding to master.Too Humanintroduces combinations of weapons combat on a level that leaves players in awe.Shared experience-Conquer the world ofToo Humanalone or with friends through advanced, two-player online co-op gameplay through the Xbox Live service.Modern take on a classic story-Too Humanchronicles the ongoing struggle between cybernetic gods, giant machines and mortal men on a massive scale never before seen. Play the role of a cybernetic god charged with protecting the human race against a relentless onslaught of machines.Right ColumnImage 1Baldur's dashView larger imageImage 2Experience large, epic battlesView larger imageImage 3Multiple ways to attackView larger image", "price": 17.25, "imUrl": "http://ecx.images-amazon.com/images/I/51hVNoSjkdL._SY300_.jpg", "related": {"also_bought": ["B000H94PVO", "B000HCQK0A", "B002W5GI9I", "B000FLZEXM", "B000KLNLV4", "B000QW9D14", "B004MXQ3DY", "B001D25M1Q", "B00149NCYW", "B000ZK9QFK", "B000C427NM", "B000R0RHA4", "B000G75AXY", "B001CMJAP6", "B000B6ML1Y", "B000ZJVDA2", "B002BRZ8BQ", "B003S2MXRA", "B001UWGDC6", "B000FRVAD4", "B0016NRS28", "B001D7T2VM", "B000FRS9II", "B00319DX4W", "B0016NRS8M", "B000WCN7G0", "B001ASJISG", "B008XMSRKC", "B000P8WOMO", "B004FUL9YW", "B000WCN8IW", "B001LGFPSY", "B002C0VNVG", "B000FUG5WC", "B0028A6V7Q", "B0015HZLVA", "B002BRUTT2", "B003O6E7AG", "B000WQWPOQ", "B000SH3XD6", "B000XJNTPG", "B004EW7LSY", "B0023CBY4E", "B0056WJA30", "B000MTF054", "B0010AYJXI", "B004L9WGDA", "B000R0SR9E", "B002DC8GKE", "B000B6ML0A", "B000NJH6YG", "B000F3AADE", "B002I0JA7E", "B007IFMFYE", "B000O5FUQ0", "B001KWFBG0", "B0050SY9WC", "B001SBUBJU", "B001HWB68K", "B000HX1P72", "B000ZK9QD2", "B002I0JGDM", "B000XJO7A2", "B002Q21X7Y", "B003P9C6QY", "B0009SQFHA", "B001IKHVTE", "B001NX4DUQ", "B0044SA70M", "B003FBL85W", "B002GPPPS4", "B006GHA8EE", "B002DC8GEK", "B003O6HGHM", "B002I0H79C", "B0054INKZK", "B003GSZ9ZE", "B0030GBU32", "B000WSE2WM", "B001YI0Z2U", "B002I0HAC6", "B000GPVUOY", "B00113JSCG", "B004A88W8K", "B002BRZ8FW", "B00354NAYG", "B001CRQYBO", "B000RHZ9JI", "B000UUFQZE", "B003O6E9EK", "B001A4MTGS", "B000G82KU4", "B00163LW7A", "B000BLM5PG", "B000OCXK6A", "B000HKGIOA", "B004MXM7WU", "B002V16T0Q"], "bought_together": ["B004MXQ3DY"], "buy_after_viewing": ["B0050SY9WC", "B002W5GI9I", "B000HCQK0A", "B004FUL9YW"]}, "salesRank": {"Video Games": 3127}, "categories": [["Video Games", "Xbox 360", "Games"]]}