{"asin": "B0056HNTAU", "categories": [["Electronics", "Camera & Photo", "Lighting & Studio", "Photo Studio", "Storage & Presentation Materials", "Digital Picture Frames"]], "description": "Easy to configure, effortless to use, with powerful features.The Pix-Star PXT510WR02 FotoConnect XD is the biggest and best in the family of easy-to-use Wi-Fi &amp; email photo frames from Pix-Star. With the ability to receive and send photo-mails directly from the frame, a computer becomes unnecessary. No monthly fee is required.Configuring the Pix-Star frame's Wi-Fi connection is quick and easy and can be done using a few buttons on the compact remote control. Turn on the frame and ensure it is located within reach of the network you want to connect to. The Wi-Fi network configuration is automatically detected and all you need to know is the network password if your Wi-Fi network is encrypted. There is absolutely no software to install. Once configured the frame works without the need for a computer.It displays beautiful 800 x 600 resolution photos on a big 10.4-inch screen. Enjoy the best shots of your family in full screen, full resolution.&nbsp;Sharing, Receiving and Sending photos has never been so easy!Pix-Star invented the concept of \"the frame with an email address\" several years ago. Since then it has been the easiest way to share pictures with your family directly from the frame. You can visit www.pix-star.com to register your frame within minutes. Choose a personalized email address for the frame and you are ready to send, receive, share and enjoy pictures on your Pix-Star!Anyone who knows the frame's email address can send pictures directly to your frame as an email attachment or from their own Pix-Star frame. Are you worried about spam or unwanted pictures coming to your inbox? Pix-Star is the ONLY Wi-Fi frame with a built-in spam blocker so you are protected from unsolicited pictures.You can send pictures to the frame by email using a computer, but you can also send pictures from your phone right after taking them. This is the perfect sharing companion when you are on-the-go.No Touchscreen means No Fingerprints to Wipe Off.The frame's software interface has been designed to allow for easier navigation even when you have thousands of photos stored on your frame. It allows you to organize your pictures so you can display only your external web albums, only your local albums, or a 'Play All' feature, which groups all your photos in the same slide show.Slide shows can be configured to play photos in 'normal' or 'random' mode. Transition time can be adjusted and you can select between many transition effects. You can also rotate pictures or copy them to the frame's local memory using an SD card or USB stick (with auto resize).As soon as photos are added to your frame, they are automatically resized into an 800 x 600 format to fit perfectly in the 10.4-inch high quality display. The LCD screen will present your best shots in a 4:3 aspect ratio and photos will be rotated to their proper orientation automatically.An icon is displayed on the screen to inform you when a new photo is received. You can also tell the frame to automatically accept incoming photo-mails. Grandma won't need to learn new skills or touch anything to see your photos!You can instantly share your photos for free with friends and family who appear in your contact lists. Customize your contact lists directly on your frame or from your account at www.pix-star.com. Send pictures to your friends, to their Pix-Star frames, or to any email address, so others can see what you see. Connecting with distant friends and family through the magic of pictures has never been easier or faster.Access your pictures from the largest selection of online picture storage providers.Pix-Star offers superb and comprehensive support for the largest number of online picture storage providers.By default, Pix-Star displays pictures from its 1 GB internal memory, which can store up to 10,000 pictures (may vary depending on picture type). These can be added via email, SD card or USB stick, but the frame can also display online albums from Facebook, Picasa, Flickr, Windows Live, Smugmug, Photobucket, Shutterfly, MobileMe, Phanfar, Koffeephoto and more. You can also access pictures from Photo RSS feeds. All you need to change is the \"source\" of the pictures, which can be done in the frame's menu, or if you prefer, from your online account.Pix-Star syncs with more online albums than any other frame!UPnP-DLNA support allows easy access to pictures stored on your local computer and local networkPix-Star has always been about accessing pictures wirelessly from different sources.In addition to accessing your pictures stored in online web albums, you can now use your Pix-Star to display photos stored on your local network, on your PC (Windows 7 and above), Macintosh or any compatible NAS server. You no longer need to copy or transfer pictures to the frame: you can easily browse through your Pix-Star menu, find your device in the list, click PLAY and your photos will begin to display in streaming mode.Environmentally responsibleWith a power consumption of less than 7 W. Moreover, thanks to its Eco-mode feature, you don't have to unplug your frame before going to sleep or worry about wasting energy. From the frame's settings you can schedule the times when your frame will automatically turn on and off. Emails will still be received even when your frame is off for the night or weekend.The frame can also easily fit on a table or hangs on a wall.Product SpecificationsDisplay size: 10.4-inches (26.4 cm)Display type/backlight: LCD/LEDDisplay brightness/contrast: 300/500Dimensions (mm): 260x198x27Display area (mm): 211x158Display resolution/pixels: 800x600/RGBAspect ratio: 4:3Image file format: JPEG, JPG, BMP, PNG, GIFMemory: 1 GBCard support: SD, SDHC, MMCUSB portPackage ContentsPix-Star Digital Photo FrameRemote ControlAC Power CordGetting Started Guide", "title": "Pix-Star PXT510WR02 10.4 Inch FotoConnect XD Digital Picture Frame with Wi-Fi, Email, UPnP-Black", "price": 189.0, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/51LzbYhpNbL._SY300_.jpg", "related": {"also_bought": ["B0021L9BKQ", "B002G12OBO", "B00AKO7XOW", "B00J3TWQ8I", "B007JRB0RE", "B007JRB0SS", "B00FWDXZIO", "B007MY6DT4", "B00CTKKB1C", "B00A77OKL6", "0312553684", "B001B6ECYM", "B00DDMJ332", "B00DYQQSSK", "B0031B5CEE", "B000AV5LZ8", "B001TR0742", "B006X8TYQ4", "B00DFFT77E", "B000XPWXK2", "B003KMWATY"], "bought_together": ["B0021L9BKQ"], "buy_after_viewing": ["B00J3TWQ8I", "B00DYQQSSK", "B00FWDXZIO", "B00DYQZ4Z8"]}}