{"asin": "B001415EMI", "description": "Manufacturer's Description--March 24, 2008 Samsung's 550 Series is a perfect&nbsp; way to step up to Full HD 1080presolution. A fast 5 ms response rate produces smooth-motion scenes for sports and action movies, and a dynamic contrast ratio of 30,000:1 makes for deep blacks and crisp lines (15,000:1 in 32-inch and 37-inch models).&nbsp; Superb connectivity and networking&nbsp; with a USB port and 3 HDMI 1.3 ports with Consumer Electronics Control (CEC) means these HDTVs play well with all of your other electronics. Easily enjoy MPEG and JPEG files stored on external devices by connecting through the side-mounted USB 2.0, turn your LCD into a full-scale home viewing gallery, or connect your MP3 player for a dynamic audio experience.Key FeaturesNew-- 30,000:1 dynamic contrast ratio: up from 15,000:1 on 2007 models (15,000 on 32-inch and 37-inch models) (Learn more)New-- Fast 5ms response time:down from 8ms on 2007 models thanks to a new high-speed liquid crystalFull 1080p HD(Learn more)178-degree viewing anglefrom all four axes with Super Patterned Vertical Alignment (Learn more)3 HDMI 1.3 ports: Simplay compliant (Learn more)USB 2.0 port:connect devices directly to your HDTV--view JPEG photos or MPEG movies or easily listen to your MP3 player through your HDTV's audio system or your home theater systemDNIe Digital Natural Image Engineimproves the picture by enhancing the contrast, detail, and white balance (Learn more)Hidden speakers with SRS TruSurround XT audio(Learn more)Wide Color Enhancertechnology and Cold Cathode Fluorescent Lamp (CCFL) offer a wider color range (Learn more)Picture-in-Picture (PIP)enables convenient simultaneous viewing of TV programs and video or PC sourcesV-Chipsystem allows blocking of rated TV and movie programs determined by the parent to contain objectionable content.Trilingualon-screen displays in English, Spanish or French.Variable sleep timerto turn the TV off in varying time intervals.Auto wall mount compatible:3-dimensional operation via TV&rsquo;s remote control; no external IR receiver required.Swivel standincluded1 year parts and 1 year labor warranty(90 days parts and labor for commercial use), with in-home service, backed by Samsung toll-free supportStep Up FeaturesSeries 6:50,000:1 dynamic contrast ratio, AutoMotion Plus 120Hz image interpolation for smoother motion, 4ms response time, Transparent and Opaque Color (TOC) bezel, Clear Panel, Ethernet port with Infolink free RSS feeds, 4 HDMI 1.3 ports, Sports and Game modes, Compatible with Samsung's Home Digital Media Adapter for playback and navigation of Internet and stored PC multimediaSeries 7:Internal flash memory (1GB) with pre-loaded interactive content such as cooking recipes, children's entertainment, HD artwork and more, Integrated woofer for an enhanced audio experience, DLNA-Compatible: for better interoperability with electronics, computers and mobile devices from many different manufacturersStep Up FeaturesSeries 6:50,000:1 dynamic contrast ratio, AutoMotion Plus 120Hz image interpolation for smoother motion, 4ms response time, Transparent and Opaque Color (TOC) bezel, Clear Panel, Ethernet port with Infolink free RSS feeds, 4 HDMI 1.3 ports, Sports and Game modes, Compatible with Samsung's Home Digital Media Adapter for playback and navigation of Internet and stored PC multimediaSeries 7:Internal flash memory (1GB) with pre-loaded interactive content such as cooking recipes, children's entertainment, HD artwork and more, Integrated woofer for an enhanced audio experience, DLNA-Compatible: for better interoperability with electronics, computers and mobile devices from many different manufacturersSeries 8:super-slim 1.9-inch thick profileWhat size TV should you get?Learn MoreFull HD 1080PFull HD, or 1080p, contains 1.5 times more scanning lines than conventional HD TVs. More scanning lines mean more pixels, more details and a better picture. The new Samsung LCD TV with resolution that is approximately 2 times greater than conventional HDTVs, creating the most perfect picture imaginable.Samsung&rsquo;s 1080p panel uses a new high-speed liquid crystal to cut response time to 4ms. The fast response time, coupled with Samsung&rsquo;s Auto Motion Plus 120Hz motion blur reduction technology dramatically reduces motion blur and judder.30,000:1 Dynamic Contrast Ratio/500 nit Brightness30,000:1 Dynamic Contrast Ratio will give you a picture better than you ever thought possible, with whiter whites, blacker blacks and a nearly infinite subtlety of gradations in between. As two of the most important determining factors in overall picture quality, contrast and brightness levels achieve new heights in this latest generation LCD panel. Samsung&rsquo;s new LCD TV&rsquo;s give the most stunning realistic picture quality ever.Digital Natural Image EngineDNIe The Samsung Digital Natural Image engine. This exclusive Samsung technology dramatically improves the picture by enhancing the contrast, detail, white balance and reduces.Wide Color Enhancer/Cold Cathode Fluorescent LampThe NTSC (National Television Systems Committee) has established the color standards all TVs in America try to meet. And typical LCD TVs only meet about 72% of this standard. Samsung LCD HDTVs use Cold Cathode Fluorescent Lamp back lights to give you 92% coverage of the NTSC standard, ensuring truer, more breathlessly vivid colors.Samsung&rsquo;s exclusive Wide Color Enhancer technology delivers more brilliant colors, even in bright areas of the picture where blues and greens are washed out on conventional screens. The system displays wider color reproduction, showing you truer colors &ndash; the fresh green of spring foliage, the intense blue of the summer sky.ConnectivityTo make the Series 6 a true entertainment hub for any home, Samsung has incorporated advanced HD connectivity and networking capabilities that expand the HDTV&rsquo;s functionality. A wide variety of multimedia devices can be connected to the set through any one of the four Simplay compliant HDMI 1.3 inputs (including one on the side), and the handy HDMI-CEC feature lets you control all your CEC-enabled peripherals using just one remote.Connect HD digital devices like disc players, game consoles, and satellite dish components into the 2 rear connections and use the side-mounted input for cameras, camcorders, and laptops. HDMI is the best performing interface for displaying an HD source on an HDTV.Once connected, users can easily access device menus and manage and display content through the newly redesigned Wheel Key Remote control and the HDTV&rsquo;s sophisticated content management interface.All Connections3 HDMI (High-Definition Multimedia Interface) version 1.3: (2 rear/1 side)Component video: 2 rear (Y, Pb, Pr)Composite inputs: 1 rear (shared with component) / 1 sideS-Video: 1 sidePC input: 1 rearWiselink (USB 2.0)RF antenna inputsHeadphone jack: sideSuper Patterned Vertical AlignmentSamsung&rsquo;s Super Patterned Vertical Alignment (SPVA) panel provides a 178-degree viewing angle from all four axesAudio FeaturesTruSurround is a patented SRS technology that solves the problem of playing 5.1 multichannel content over two speakers. TruSurround delivers a compelling, virtual surround sound experience through any two-speaker playback system, including internal television speakers and headphones. It is fully compatible with all multichannel formats up to 5.1 channels. High-quality virtual surround sound can be experienced with just the two hidden, downward-firing side-mounted 2.2-channel dome speakers built into the TV.SRS TruSurround XT technology delivers an amazing, simulated 3D effect with clear dialog and powerful bass.TruSurround XT audio also adds three audio enhancement technologies to produce an amazingly immersive sound experience.Dialog Clarity brings movie dialog into Focus during the playback of any surround-encoded material to make speech much clearer and crisper.TruBass creates incredible deep rich bass allowing a person to perceive significantly deeper, richer low bass tones that are far beyond the physical low frequency capabilities of the speaker itself.The SRS WOW feature widens the sound stage by processing standard two-channel stereo material as well as multi-channel encoded material for a dramatic improvement in the playback of any stereo audio over a two-speaker system.Stereo broadcast reception is offered for MTS and SAP with 181-channel capacity. A sound leveler keeps audio volume consistent during channel changing.Which Size HDTV is Right for My Room?With standard-definition TVs, the rule used to be that viewers would feel comfortable watching a set from a distance of 3 to 6 times the screen size in inches. With HDTV, the resolution is so much better that you can sit closer to a larger TV without noticing the pixels. So with HDTVs, the rule tends to be you can sit anywhere from 1.5 to 3 times the screen size (in inches) for the best experience.If you know the size of the room you have already, where you want to sit, and where your new HDTV should go once you get it, you can figure out the size HDTV you should get.Minimum size = Viewing distance/3Maximum size=Viewing distance/1.5", "title": "Samsung LN52A550 52-Inch 1080p LCD HDTV", "price": 5.09, "imUrl": "http://ecx.images-amazon.com/images/I/515S%2BqosBIL._SX300_.jpg", "related": {"also_viewed": ["B0074FH14C", "B00BCGRYY6", "B00I2MPHM4", "B00EBNAVQ0", "B007BG47BE", "B0074FGW5G", "B009LG6B1G", "B00752NJMC", "B0074FGLUM", "B0078LSTRK", "B00I94IRIQ", "B00I0S6YWM", "B004NB0NNG", "B00BD8TMIO", "B00BB9OPUA", "B00EBNA732", "B0076LY17E", "B00GKKI4JI", "B0096YOQE2", "B0077Y4TA4", "B00BB9OPR8", "B00EBNADB8", "B00EA650XM", "B00I94IPTW", "B00BCPGNF8", "B00BCGRLUI", "B00DQHZXOC", "B00A9HDXOY", "B00BCGRZ22", "B00EE0Y7WY", "B00JJNA10I", "B00BCGRLU8", "B00ISIFZNI", "B00BCPGYZM", "B00E67CX4E", "B00ID2HGK4", "B00BCGRQ7Q", "B00CI3BP06", "B00BB9ORWQ", "B00II6VVV0", "B009H8JOZS", "B00BB9ORS0", "B00BD8TOTG", "B00DV51DTS"], "buy_after_viewing": ["B00870ZHCQ", "B00DR0PDNE", "B001GTT0VO", "B003L1ZYYM"]}, "categories": [["Electronics", "Television & Video", "Televisions", "LCD TVs"]]}