{"asin": "B00006GSNX", "description": "Forget aboutSuper Mario Sunshine--this is the real superstar platform action game of the season. Featuring a pair of wacky robots in a quest to save the universe,Ratchet and Clankmay offer the same old basic platform scenario--run around, elude or destroy enemies, jump, and negotiate treacherously dynamic environments--but it has a number of things going for it that place it among the best titles ever in this genre.The feature that will strike you first is the terrific art direction. Set in a science fiction future, the game has a beautifully executed retro cartoon look (think old Warner Bros.). The attention lavished on every detail, from architecture to character design, makes for a world that feels complete and real. This extends to the cutscenes, which feature a variety of colorful characters given vivid life with excellent voice acting. Then there is the sheer size and level of interactivity of the environments. For me, a particularly stunning moment was when my character was knocked off a skyscraper, but instead of perishing, landed on a ledge and was able to seamlessly navigate to a whole separate section of the game. Another moment of truth came when I aimed my blaster at one of the vehicles whizzing by in the sky. These vehicles were just pretty wallpaper, I thought, but no, the thing blew up. In fact, nearly everything you see is destructible or responsive in some way: you can jump up trees, scuttle over walkways, smash boxes, and climb up ledges. And the control scheme is just complex enough to keep things interesting with multiple weapons and the like, without being bogged down by too many features.While the routine of finding and destroying enemy robots may get tedious after a while,Ratchet and Clankkeeps things interesting with the many metamorphoses of Clank (who takes on forms that surprise even himself), cool weapons like the Glove of Doom (which unleashes armies of tiny Clanks), and shifting first-robot, third-robot points of view.If this game doesn't become the bestselling platform action game of the year, it will prove that nostalgia for old characters, marketing hype, and brand loyalty really are more important than quality.--David Stoesz", "price": 42.0, "imUrl": "http://ecx.images-amazon.com/images/I/51d-KKQMCXL._SY300_.jpg", "related": {"also_bought": ["B000099T2E", "B00020LZBG", "B0009I6S0Y", "B00127VDVK", "B00005R5PO", "B0000690ZE", "B000099T1Y", "B00020LZAM", "B00004TNB0", "B001VLFCVE", "B0009F3E1I", "B000066TS5", "B0002XL3BA", "B000TLU67W", "B001MW91IW", "9629971372", "B002DGG9KY", "B00004YRQA", "B00004YRQ9", "B0000C7GHG", "B00005TNI6", "B000056C34", "B000G6SPHI", "B0002Y2XXQ", "B00000I1BF", "B0009I6S0O", "B0009A4EVM", "B00008URUA", "B000034DC2", "B00005NCCI", "B000E991PC", "B0013JHKU0", "B000UC5ML0", "B001G3B0HC", "B0002RQ3ES", "B00097CYZS", "B00006F2ZP", "B0009O7HVM", "B00006JC4A", "B00009WAVI", "B000F5IH2I", "B00009ZVHY", "B00000I1BR", "B00005V6B9", "B0013KW1B2", "B004S3KB6S", "B00009ZVHW", "B00005NUJ3", "B00000I1BQ", "B00000IZS1", "B0032GTMEE", "B0000AHRPM", "B000KCX9M4", "B00005NN5G", "B000GACEHQ", "B0045L3SNQ", "B0009SQF0C", "B00004U4R9", "B00005ML10", "B00005NCCR", "B0002IQCSY", "B002BWS5QG", "B00000DMAR", "B00009VE6D", "B0002B90OO", "B0000A0MDV", "B00005V6BP", "B0006ZJPR8", "B0015ACX3Q", "B0002EJ8FC", "B00005Q8IR", "B0000AHOOJ", "B00020LZAW", "B000A5K5MI", "B0002RQ3I4", "B0002CNUN0", "B00007KQE9", "B000B69E9G", "B0000B0MNH", "B00006GSNZ", "B00001X50M", "B002KIK8FW", "B0000TSRA6", "B0001ADAME", "B0001NE48U", "B00004U8QX", "B000FUUD8O", "B0000A082Y", "B0001I9YHG", "B00004YUWA", "B0015MMN6G", "B0009A4EV2", "B000069D39", "B000930DIM", "B009S4JTTC", "B0001CJCG0", "B0002IQC8E", "B00005J536", "B000IZAQD8", "B0001VGFK2"], "bought_together": ["B000099T2E", "B00020LZBG"], "buy_after_viewing": ["B000099T2E", "B00020LZBG", "B0009I6S0Y", "B0050SXI6K"]}, "salesRank": {"Video Games": 3250}, "categories": [["Video Games", "More Systems", "PlayStation 2"]]}