{"asin": "B001NJ6AWO", "description": "InTerminator: Salvation, you are John Connor, a soldier in this post-apocalyptic world, and it's up to you to lead your squad of loyal fighters in a desperate battle for survival against the superior forces of Skynet and its deadly Terminators. Use the environment and objects in it to provide cover and protection as the T-600 and T-7T shoot relentlessly at you and your squad from all angles and the lethal Aerostat blasts you from above..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Fully destructible cover system.View larger.AI and human co-op support.View larger.Extensive list of weapons and vehicles.View larger.StoryTerminator: Salvationis a prequel to the events of the major motion picture of the same name. It is two years after Judgment Day--the date that the Terminator mythology assigns to the nuclear event that the machines will rain down on planet Earth--and what's left of humanity is caught in a life and death struggle against that same machine intelligence that sprung to life from the former defense super computer known as Skynet. Yet things are not quite what the the earlier chapters in the Terminator saga had predicted for these days. Although over the last two years human survivors of the catastrophe have prepared and organized themselves for the ongoing battle with the machines, John Connor, the character that the player assumes, has yet to emerge as the legendary hero he was foretold to be, and time is running out. In its early nuclear strikes against humanity, Skynet damaged part of itself. It has spent the last two years rebuilding its strength as well in order to complete its mission of the extermination of the human race. Now is the time to strike back at the machines. Now is the time for you and John Connor to take command.Gameplay and Co-op SupportAction inTerminator: Salvationis from a third-person perspective and relies heavily on the use of cover. Correspondingly players will be able to lock on to cover, dive or slide from one cover point to the next and fire weapons without exposing themselves to return fire, but this doesn't mean that combat is easy. Cover is fully destructible in the game, meaning that your mechanical enemies will attempt to take that advantage away from you if they recognize that you are dug in. They will also make every attempt to flank your position. These two points are important becauseTerminator: Salvationforces you to take care of yourself in its single player campaign by not featuring a health regeneration system between checkpoints (health is fully restored at the end of survived levels). But health can be regenerated during combat via an AI or human teammate anytime when playing in the game's local co-op mode. The ability to team up in co-op mode is also a major aspect of gameplay in that it allows players to turn the tables on terminator units by flanking them and attacking their less heavily armored sides rather than head on. Both single player and co-op modes also feature access to vehicles which can be battled from as well.Key FeaturesTerminator Mythology- Set two years prior to the upcoming Terminator Salvation film, play as John Connor for the first time and continue the epic fiction of the Terminator mythology.Intelligent Robotic Enemies- Unrelenting and incredibly resilient iconic enemies from the Terminator franchise fight to the bitter end on land and in the sky.Destructible Cover Gameplay- Advanced cover mechanics allows you to use the destructible environment as protection and strategically navigate through enemy entrenched territory. The cover mechanic's multifaceted design changes the way \"cover\" gameplay is executed.Diverse Weaponry- Utilize a wide array of advanced weapons including shotguns, fully automatic machine guns, huge mounted weaponry, grenades, rocket-launchers, and even a plasma-firing Skynet tank.Rugged Vehicle Battles- Pursue, attack, or evade enemies through post-apocalyptic environments on foot or inside rugged armored vehicles in extremely kinetic and extensive cinematic gun battles.2-Player Local Co-op Mode- Battle through post-Judgment Day LA with a friend in local co-op play.Xbox LIVE Achievements- Collect Xbox LIVE achievements and add to your gamerscore.", "price": 10.49, "imUrl": "http://ecx.images-amazon.com/images/I/512CZGxHHdL._SY300_.jpg", "related": {"also_bought": ["B000B7Q4BQ", "B000YSJRFC", "B000E260LM", "B000B90GD6", "B000B7Q4CA", "B000VNS9D6", "B00009P9IT", "B000S1MMEI", "B005EZ5GXW", "B000Q4UJ8S", "B0030GBUCS", "B003S2L6DC", "B0009WPZMC", "B002E1R1RI", "B001SHA0W2", "B001TOQ8MU", "B001PKHRVE", "B0009WPZNQ", "B00021KEOE", "B002WDL5L6", "B000MK54X6", "B007ZQJN1Y", "B001RXB4SG", "B000X2TZY2", "B005THAX5Q", "B000GPVUOY", "B000CRSBLQ", "B004BD1DWG", "B00114XU4W", "B000EXZALC", "B0023CBY4E", "B000G75AXY", "B00113JSCG", "B000OCXK6A", "B000O5FUQ0", "B004UDLRMS", "B005VKRGXS", "B002DC8GKE", "B003NSECXC", "B000R0SRY4", "B000M4M7AU", "B004RIACPY", "B000SH3XD6", "B0009S4UOA", "B00C7RVNY6", "B000LXIO6I", "B002CZ3N3C", "B004ML7WOK", "B001SBUBJU", "B000H94PVO", "B003O6E7AG", "B0030MOTNE", "B000WSE2WM", "B002EZOQVI", "B002DC8GEK", "B000HCKZ38", "B000R0RHA4", "B001D25M1Q", "B001EYUTU2", "B000P0QJD2", "B001URRGZ4", "B000O5DS32", "B000R0URCE", "B001DYXGUI", "B003O6N2TI", "B002HWUUDG", "B006Y76I86", "B000C427NM", "B00BU3ZLJQ", "B004LLVW42", "B001AWIOYG", "B000067DPB", "B004H0J5S2", "B000XJS00K", "B000GV4JQE", "B001UWGDC6", "B001FB55HQ", "B0043QSR5C", "B000UUFQZE", "B000B6ML28", "B003P9C6QY", "B000A0EFJW", "B000PE0HBS", "B004MXQ3DY", "B00022EE6M", "B003Q53VZC", "B000MK4G1M", "B001CBW19Y", "B004MXP600", "B003S2MXRA", "B003C1I0CO", "B002I0HAC6", "B000ZK9QFK", "B0050SYY5E", "B003ZS2PWK", "B00JFAC0HC", "B005EZ5GZK", "B000HCQK0A", "B004VMXAWS"], "bought_together": ["B00BU3ZLJQ"], "buy_after_viewing": ["B001TOQ8MU", "B002DC8GKE", "B007ZQJN1Y", "B002E1R1RI"]}, "salesRank": {"Video Games": 3910}, "categories": [["Video Games", "Xbox 360", "Games"]]}