{"asin": "B0001G112O", "description": "Canon's EOS-1D Mark II (successor to the original EOS-1D) is the ultimate professional digital SLR. Nearly doubling its predecessor's resolution to 8.2 megapixels, it also offers an improved shooting buffer for continuous shooting 8.5 frames per second at full resolution--making it the world's fastest digital SLR (as of January, 2004). It also features a faster DIGIC II imaging engine, a rugged yet lightweight weather-resistant magnesium alloy construction, capability for custom and personal presets, and dual storage slots for CompactFlash and Secure Digital cards.Optics and ResolutionCanon's newly developed single-plate CMOS sensor with 8-channel reading technology delivers exceptional image quality, with approximately 8.2 million effective pixels (8.5 million total pixels) and a generous 28.7 x 19.1mm image size. The sensor's 3:2 aspect ratio is the same as in 35mm cameras, and the sensor's large size realizes an effective angle of view that's just 1.3 times the focal length indicated on Canon EF lenses. It features 3504 x 2336, 3104 x 2072, 2544 x 1696, and 1728 x 1152 pixel resolution settings.A new on-chip noise elimination circuit eradicates fixed pattern and random noise. A low-pass filter placed in front of the sensor reduces false color and moire effects, while the infrared filter suppresses red fringing caused by sensor reflections and fog.RAW processingNew Digital Photo Professional image processing software is provided for high-speed processing of lossless RAW files. It enables real-time display and immediate application of adjustments to images and includes a wide array of RAW, TIFF, or JPEG image editing functions, which give control over variables such as white balance, dynamic range, exposure compensation and color tone. It supports sRGB, Adobe RGB, and Wide Gamut RGB color spaces.Digic II Imaging ProcessorCanon's newly developed, state-of-the-art DIGIC II imaging engine achieves super high speed processing that results in continuous shooting of 8.2-megapixel images at 8.5 fps in maximum bursts of 40 (JPEG format) or 20 (RAW format) shots. By handling larger volumes of image data, DIGIC II also contributes to lower power consumption: up to about 1,200 shots can be taken on a full battery at 20 degrees C, or around 800 shots at 0 degrees C.More FeaturesThe new 230,000-pixel, 2.0-inch color TFT LCD offers nearly twice the resolution of monitors on other EOS digital models, nearly 100% coverage of JPEG images, and a new bolder typeface that simplifies reading of text menus. Photos displayed on the LCD monitor can be magnified from 1.5X to 10X in 15 increments, allowing you to check the focus and exposure of images with high precision.You can easily tailor the EOS-1D MARK II to meet your own specialized needs:21 Custom Functions with 67 settings include the removal of the ISO speed extension setting to the ISO speed extension menu, the addition of new E-TTL averaged autoflash metering, and the inclusion of AI Servo continuous shooting, which was previously a Personal Function.25 Personal Functions can be installed in the camera at any time, via driver software, to meet high-level customization needs. New features include the ability to append data for data verification and the ability to apply the Quick Control Dial's ON/OFF switch to the Main Dial to prevent accidental changes to settings when shooting remotely with EOS Capture.Other features include:Images can be recorded in the JPEG image format, the RAW image format, or both formats simultaneously.Seven Color Matrix settings are provided for JPEG and RAW images, including five factory presets that were previously available and two new settings that allow independent user adjustment of color space, color saturation, and color tone within a prescribed range.ISO speeds are selectable in 1/3 increments (100-1600) and may be set as low as 50 or as high as 3200 through the ISO extension menu.It offers 10 selectable white balance modes and a new WB Compensation function, which allows adjustment of blue/amber and magenta/green biases in +/-9 steps, as well as combined use of light-balancing (LB) and color-correction (CC) equivalent digital color filters.Canon's improved Evaluative Through-The-Lens (E-TTL) Autoflash system offers new averaged metering in addition to the evaluative metering available on other EOS models.Designed as a serious tool for professionals, the EOS-1D MARK II offers rigid magnesium alloy in the chassis and external covers (top, front, rear and memory card slot cover).Lens CompatibilityCanon's lineup of professional EF lenses--including over 50 models ranging from 14mm ultra-wide-angle to 1,200mm super-telephoto--are compatible with the new EOS-1D Mark II (except the EF-S line). Canon's sophisticated electronic lens mount technology communicates with the camera as soon as the lens is mounted to transfer information about the lens, such as its type, f-number and focal length, thus enabling faster, more precise control from the camera.EF lenses offer professional capabilities that meet wide-ranging needs, including such features as an Ultrasonic Motor that silently drives the autofocus mechanism with very high precision, an Image Stabilizer that automatically compensates for camera shake via microcomputer, advanced aspherical optics, fluorite lenses, Ultra Low Dispersion (UD) lenses, and Super UD lenses.Storage and TransferThe EOS-1D Mark II offers support for both CompactFlash Type I and II (making it MicroDrive compatible) and Secure Digital (SD) memory cards. Images can be recorded on a CompactFlash card or SD memory card alone; on both cards at the same time as a safeguard against losing important data; or on both cards, one at a time, to maximize storage capacity. It connects to PCs and Macs via FireWire (also referred to as IEEE1394, or i.Link) and USB 1.1 (which activates PictBridge printing capabilities).Power and SizeThe camera is powered by a rechargeable NiMH (nickel metal hydride) battery pack (NP-E3, included); it also requires one CR2025 for date and time settings. It measures 6.1 x 6.2 x 3.1 inches and weighs 43 ounces (camera body only without batteries; battery adds 11.8 ounces).What's in the BoxThis package includes the EOS-1D Mark II digital SLR camera body, rechargeable NiMH battery (NP-E3), AC adapter (DCK-E1), CR2025 battery, and USB and FireWire (IEEE1394) cables. The CD-ROM includes EOS Viewer Utility software for faster image preview, and Digital Photo Professional software for high-speed processing and handling of RAW images. It is compatible with over 60 Canon EF lenses (excluding EF-S lens) and the entire Canon EX series Speedlite flash range.", "title": "Canon EOS-1D Mark II 8.2MP Digital SLR Camera (Body Only)", "imUrl": "http://ecx.images-amazon.com/images/I/51HHu4bTbAL._SX300_.jpg", "related": {"also_bought": ["B00BUK3YXO", "B0007CIWZG", "1579906192", "B001FO4QHI", "B00508ZURU", "B00006I53S", "B00007E7JU", "B00005K47X", "B00B93TXQ4", "B000NP1C5O"], "buy_after_viewing": ["B00007E7JU", "B00BUK3YXO", "B009B0MZG2", "B007M54E1M"]}, "salesRank": {"Camera &amp; Photo": 8190}, "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]]}