{"asin": "B004Q8GYES", "related": {"also_bought": ["B0012BYBG0", "B005OLRDFK", "B00BSUH0D6", "B0010IKAWE", "B000NAPPY8", "B00LCSLHPG", "B00L3T1GO6", "B00IGLA8DY", "B00CQ7ZXX4", "B00FFXZZG6", "B00FFY00P6", "B009YWQX88", "B00FFXZZL6", "B00FFXZZV6", "B004RRGKWY", "B004GEVHDK", "B0039OVDJ6", "B006YQ4SWU", "B006VHMD0Q", "B003N4PN3Y", "B00I2NZEBC", "B00EIBSUCW", "B00CUEJIO8", "B00GD2897K", "B00CO58KY2", "B000O2R3UO", "B0036QL8ZG", "B0047BCRYK", "B00BNH7IJU", "B00C2WEK7I", "B001F51PWG", "B005GDAZ9W", "B002X09I76", "B0091JV52I", "B00B4BJWAI", "B00AZJ0AW4", "B001U2RQY0", "B002IT3KD0", "B0046MK34G", "B004EHMXF0", "B0094A4KCQ", "B001F51PVW", "B00467Z9CC", "B00166FZBG", "B0088W8MI4", "B00H2MR390", "B000J40FV6", "B00CTOPENS", "B00BC1PUFG", "B00GSE01IS", "B005M31I4C", "B0049T1VFQ", "B0078K3VOW", "B0045KNJIQ", "B001EWF2SI", "B000TDBJHQ", "B008EKUAG2", "B00EIBT418", "B00D3NPJ4S", "B005M34XOY", "B00HJRN9NW", "B000AA5VD6", "B009QTDYYA", "B00028NGEC", "B0051TPBCC", "B002PHLWN0", "B00264NW7G", "B003CP15G8", "B004D2DR0Q", "B003URLWI4", "096625757X", "B000EPA4FW", "B002L26HO8", "B005QB24LQ", "B0046MGLC4", "B002UQAUGG", "B0067H6MC0", "B0029ZYO24", "B00K2O1GHK", "B004PA01D2", "B005OLQJGE", "B00CME22DK", "B0081E6THU", "B007JZ7MVE", "B007U1SS7O", "B00JJDIH9A", "B004CDTCOQ", "B003S1JSWY", "B003TUYLAS", "B000MIR7TM", "B002MVOIHQ", "B00G7TUBPM", "B001EN14CA", "B007MS4XOW"], "also_viewed": ["B00LCSLHPG", "B00L3T1GO6", "B005OLRDFK", "B0012BYBG0", "B0010IKAWE", "B00BSUH0D6", "B000V2J3ZK", "B003N4PN3Y", "B000NAPPY8", "B00HJRN9NW", "B00LD8P2XS", "B006HT0AK8", "B000MANVXG", "B004V0SZNO", "B000V2DLJO", "B009ND81NS", "B000ENU8PK", "B00HEBIDDO", "B00GU57Q5G", "B00CYA5E1O", "B005AR8TPG", "B00EZWRY80", "B004AC6UMG", "B004RRGKWY", "B001SERK9G", "B00KM6ZH00", "B00DQ5R8XI", "B009GIOVLQ", "B00FDNPK4U", "B00GGZRC22", "B00BWNJQJA", "B00DQ5G848", "B00G88E9DC", "B00G4ZUXIO", "B000V2J3ZA", "B00GGXFJ7O", "B004NJ8WFO", "B001KYRW8S", "B006U1WT66", "B005M2NY4K", "B00EQ4FK9W", "B00D5Z5OBM", "B007VOJJ8C", "B008PDUMS4", "B00FRJKBFI", "B004LE0YW0", "B0041VQMJ2", "B004JK28GG", "B00KAC5NTQ", "B00CPWRV08", "B00EWH6KYC", "B00757D08U", "B00GV25KVK", "B00L3T1KT2", "B00IGLA8DY", "B00H3QZ7RK"], "bought_together": ["B0012BYBG0"]}, "title": "Neutrogena Wave Sonic Power Cleanser with 14 Foaming Pads", "price": 11.86, "salesRank": {"Beauty": 5639}, "imUrl": "http://ecx.images-amazon.com/images/I/518IwW61g6L._SY300_.jpg", "brand": "Neutrogena", "categories": [["Beauty", "Skin Care", "Face", "Cleansers"]], "description": "NEUTROGENA WAVE Sonic is a cleanser that goes where no cleanser has gone before. Its breakthrough spinning action offers deeper clean, gentle exfoliation, and massage in one easy step. Choose between two speeds: one for gentle, daily use and one for deep cleansing. The WAVE Sonic is clinically proven to clean up to 50 times better than manual cleansing -- for noticeable results every day. It is even as effective as the \"sonic skin\" cleansing system.WAVE SonicAt a Glance:Clinically proven to clean skin up to 50x better than manual cleansing for noticeable results every day*Offers deeper clean, gentle exfoliation, and massage in one easy stepTwo speeds: one for gentle daily use and one for deep cleansingComes with 14 disposable foaming padsWater-resistantHayden Panettiere goes Sonic.Step 1Step 2Step 3Comes with 14 disposable foaming pads.The Gentle Spin that Cleans Up to 50 Times Better*When it comes to getting softer, cleaner skin, NEUTROGENA WAVE Sonic gives you results you can see right away. The WAVE Sonic spins to lift away impurities, whirl away dirt, and deliver a noticeable improvement you're guaranteed to see.The gentle spinning action of the NEUTROGENA WAVE Sonic is clinically proven to clean skin up to 50 times better* than manual cleansing for noticeable results every day.Tested by dermatologists, the NEUTROGENA WAVE Sonic is also proven to be gentle enough for daily use. And since it has two speeds, you have even more control. Choose between a gentle speed that's perfect for daily cleansing and a second, faster speed for more invigorating, deep cleansing.How to Use Your WAVETo use the WAVE Sonic, simply attach a disposable pad to the attachment head, and hold it under running water to activate the foaming pad. Turn on the power-cleanser by pressing the power button. Choose your cleansing speed--either gentle daily cleansing or deep cleansing--then gently massage over your face, making sure to avoid your delicate eye area.You can use NEUTROGENA WAVE Sonic if you have acne-prone skin. Always  make sure to check with your dermatologist is you have sensitive skin or  severe acne.Water-Resistant with Disposable Foaming PadsThe NEUTROGENA WAVE cleansing pads are single-use and disposable, so you should use a new one every time you use the WAVE Sonic to wash your face. The starter kit comes with 14 disposable foaming pads. When you run out, you can buy NEUTROGENA WAVE refills, which include 30 pads. Take your pick from Deep Clean Foaming or Gentle Exfoliating Pads, exclusively designed to meet your skincare needs.The WAVE Sonic is also water-resistant, so you can use it at your sink and in the shower. You are ready to start cleansing as soon as you purchase the starter kit. It comes packaged with two AA non-rechargeable batteries.What's in the BoxNEUTROGENA WAVE Sonic with attachment head, 14 pads, and 2 AA batteries.* Removal of stubborn waterproof foundation vs. the leading cleanser.OriginalSonicGentle Exfoliating PadsFoaming PadsGentle vibrations leave skin softer after just 1 use.Two cleansing speeds. Gentle spinning action cleans skin up to 50x better.*Gentle microbeads are embedded in each Deep Clean Gentle Exfoliating Refill Pad for unbelievably smooth skin.The tingly, cool foam in the Foaming Pad refills helpclean your skin 10x deeperthan traditional cleansing.* Removal of stubborn waterproof foundation vs. the leading cleanser.Trademark Information:NEUTROGENA WAVE&reg;"}