{"asin": "B003O6H7X0", "description": "GOLDENEYE IS BACK. GET YOUR FRIENDS.The GoldenEye story comes to life once again with an updated single player storyline featuring Daniel Craig as Bond and written by Bruce Feirstein, the screenwriter for the original movie. Surprise enemies covertly or engage in a full on firefight and use Bond's latest gadget to uncover intel in augmented reality as you relive all the classic GoldenEye movie moments. Infiltrate the dam and destroy the facility; chase Ourumov in the tank through the streets of St. Petersburgh; and investigate the secret jungle base.Key Game FeaturesBRINGING MULTIPLAYER BACK TO ITS ROOTS.&ndash; Splitscreen returns to the first person shooter in GoldenEye &ndash; 4 players in the same room, on the same screen. The extensive variety of characters, game modes and weapons lets you customize the perfect experience from over 500 split screen game combinations40 unique characters:Play as your favorite Bond characters and villains, including 8 classic characters &ndash; Oddjob, Jaws, Scaramanga, Baron Samedi, Dr. No, Rosa Klebb, Red Grant, and Blofeld17 special game modifiers:Mix and match to create a unique gaming experience every time you play. Put a twist on standard game types with special modes like Paintball, Melee Only and You Only Live TwiceA vast arsenal of weapons and gadgets:Eliminate adversaries with Bond's signature P99 and an assortment of automatic and sniper rifles, or ensure a surprise attack with proximity minesOnline multiplayer:GoldenEye also features online multiplayer for up to 8 players designed for seasoned FPS online gamers with unique modes and a robust XP system for unlockables and achievementsNintendo DS&trade; FeaturesDeep, Customizable Multiplayer Experience:Play WiFi with up to 6 players on 8 exciting multiplayer maps. Compete in challenging game modes like Golden Gun mode and customize your game match with unique game modifiers and a variety of classic weaponsRich Single Player Experience:Unlock unique puzzles and collectables through 18 levels of story mode. Replay all your favorite levels and challenge your friends in the Time Trials mode.Unique NDS Mechanics:Engaging and intuitive interactions for the Nintendo DS. Smash open doors, access encrypted keypads and crack enemy databases.", "price": 69.32, "imUrl": "http://ecx.images-amazon.com/images/I/41whkAEoV%2BL._SY300_.jpg", "related": {"also_bought": ["B001AWFIPO", "B000X2RKOO", "B003WOFXEY", "B003N3HEU0", "B00503E9UO", "B001TOMR0C", "B000P46NKC", "B002I08CJG", "B0020H46D8", "B002I0GCD4", "B00113T0VA", "B000FQ9R4E", "B001HKPUKC", "B0024MJ8XC", "B002TLTBN0", "B00B47WVLE", "B001GIUWX0", "B002EE5SAC", "B0030F1DQC", "B004JKZUJI", "B000RF7164", "B001AWIP7M", "B003XDRIYC", "B0037M2SOY", "B002BRZ9G0", "B003YC4D9A", "B000G7T7JC", "B003ZHMMEM", "B000FQ9QVI", "B001ET07O0", "B001TOMQVC", "B001LY0QJ4", "B000P297F2", "B000FQBPDU", "B004L5SJ5I", "B00117PPME", "B000RHXD1O", "B001HB7K6I", "B001AZFSGU", "B004WLRQMI", "B0019SY1D4", "B000NDFFFE", "B0037US4IA", "B0050SVFB0", "B000Z9A95M", "B001PO2BJI", "B002BSA388", "B00006JN5O", "B003GB4UXI", "B005FYJA52", "B0050SVGU0", "B000FQBPCQ", "B0031QBXJW", "B00163ROMC", "B002EE7OKE", "B000W5Y49G", "B006QRNKOO", "B0038N9WWI", "B0094X28J0", "B000MF51L6", "B0094X1ZXU", "B0009VXBAQ", "B000WQ1UME", "B0017Q4DGI", "B000X25GW2", "B007CSF3GO", "B0030GBU8W", "B002BSC4ZS", "B004C34D2M", "B003VJOC4W", "B002I0GEXM", "B002BSC4RQ", "B00269DXXO", "B0029CSOC8", "B003ANMB6A", "B003KZJB2U", "B000FQ9YB0", "B004LM36HW", "B0009XSMNA", "B000R3BNE2", "B002BH3N2W", "B002BRYXOO", "B000JHO4CY", "B000G7VUWO", "B003YLWJLA", "B000MUSG4U", "B000OOCLWW", "B0094X2066", "B00B0UVDQO", "B00429YACY", "B001U2BMF4", "B003ZCH7DI", "B00009X3V2", "B00269DXR0", "B002I0IJ6M", "B000OFSBL6", "B000NNDN1M", "B000SFK0T8", "B0040ZTFWK"], "bought_together": ["B001GIUWX0"], "buy_after_viewing": ["B003WOFXEY", "B000P46NKC", "B002I0GCD4", "B000FQ9R4E"]}, "salesRank": {"Video Games": 3697}, "categories": [["Video Games", "Wii", "Games"]]}