{"asin": "B002DUCMQU", "description": "From the ManufacturerEnjoy exceptional image quality and clear conversations with the affordable Logitech 1.3 MP Webcam C500. The glass lens, true 1.3-megapixel sensor, light-correcting RightLight Technology, and built-in microphone make video calls look and sound so real, it's like being in the same room with far-away family and friends. And with included Logitech Vid video-calling software, being there is finally fast, free and easy.Be there for the moments that matter in true-to-life video calling clarity.Your life is crazy busy. You'd love to see far-flung family and friends more often. Yet, there's never enough vacation time or money to go around. Problem solved. With the Logitech 1.3 MP Webcam C500 and included Logitech Vid video-calling software, it's fast, free and easy to &quot;be there&quot; in person. The video and sound experience is so true-to-life, it's like being in the same room with the people you care about most. In just one click, you can be there for your grandchild's birthday, the graduate's big day or to open holiday presents together, from across the country or the world. Thanks to Logitech, high quality video calling is dramatically simplified. So now, there's nothing to keep you from sharing the moments that matter.Now crisp, clear video calling is also fast, free and easy.Included with yourwebcamVideo calls have always offered the promise of connection to your distant friends and family. But for many of us, getting the hardware and 3rd party software to work has been a challenge. Isn't it about time for an all-in-one webcam and software solution designed to make video calling easy for everyone? Wait no more. Your Logitech webcam comes with new Logitech Vid, the easiest video-calling application ever. Vid one-click-to-call software works seamlessly, right out of the box, with any new or existing Logitech webcam. So you can just relax and enjoy sharp, clear video conversations without hassles. And it's also free for anyone you call, no matter what webcam they use.Easy set up", "title": "Logitech Webcam C500 with 1.3MP Video and  Built-in Microphone [Retail Packaging]", "price": 31.58, "imUrl": "http://ecx.images-amazon.com/images/I/41Ua8ayxa%2BL._SY300_.jpg", "related": {"also_bought": ["B002GP7ZTG", "B002GP7ZT6", "B002GP7ZTQ", "B009H0XQPA", "B000UXZQ42", "B008I646WG"], "buy_after_viewing": ["B003LVZO8S", "B004FHO5Y6", "B004WO8HQ4", "B003JZC7AE"]}, "categories": [["Electronics", "Computers & Accessories", "Webcams"]]}