{"asin": "B0012L1QOA", "related": {"also_bought": ["B00B2MLR3Y", "B00AWUXTV0", "B0007OGTGS", "B00AY0GJ2E", "B004XXMUCQ", "B0024NU9GQ", "B005H4CDF4", "B005EORRBW", "B001PS9E5I", "B004GHMU60", "B00CXU1NHY", "B000FI9VU2", "B00CXTK90W", "B0006ZIC1S", "B007WXOS7Y", "B00006RVPW", "B00GAIMXR4", "B0044GH27U", "B00006MJFL", "B00077INZU", "B0006ZIESE", "B00BGTPQO4", "B0049KV52E", "B00E46Y8ZE", "B001DW8J5C", "B00CYSYYU8", "B004GHMU5G", "B00939KFOU", "B00DJERLFG", "B005SHQ644", "B00BIPI9XQ", "B00006B834", "B002R7JPGE", "B0000BVYT3", "B0089QB1SC", "B004UBPCPI", "B000QYEN1W", "B0049AVWAO", "B007Q87KP2", "B008JJLW4M", "B009V17BYC", "B007I59CN6", "B006GTDAE2", "B0050AMJSG", "B0002CWPW2", "B008JJLZ7G", "B009TPDDFG", "B003KPHYBA", "B0041ORN6U", "B004HIN800", "B004KABG1I", "B001VSR9SG", "B008FITUZK", "B00D8NC2YI", "B00BGIXOHQ", "B004EFLMAE", "B004GHMU5Q", "B00C2CBBAM", "B00BGTPPSQ", "B008JJLXO6", "B000N99BBC", "B008B8CVTQ", "B005SYQBN8", "B000067RTO", "B00C2B3T6C", "B001CY0P7G", "B00BS92DCK", "B000MJ31TG", "B004EFHN66", "B009SPNLUE", "B001QUA6RA", "B003EE12EC", "B008ALA6DW", "B009SPWJ98", "B0002DV0G8", "B0019804U8", "B007Q8JGWM", "B00BQ8RHMO", "B004OA721C", "B0002TPFTA", "B002DV4JTM", "B005T3GRN2", "B008LTBJFW"], "bought_together": ["B00B2MLR3Y"], "buy_after_viewing": ["B005SYQBN8", "B006DEBYTI", "B007B60SCG", "B004XXMUCQ"]}, "title": "Peplink Balance 30 Multi-WAN Gigabit Router", "price": 379.0, "salesRank": {"Electronics": 11829}, "imUrl": "http://ecx.images-amazon.com/images/I/31txedcaSML._SX300_.jpg", "brand": "Peplink", "categories": [["Electronics", "Computers & Accessories", "Routers"]], "description": "Smarter Router. Faster Internet. The Peplink Balance features up to 7 advanced load balancing algorithms that distribute network traffic among all connected links for faster, more responsive networking. When you want more speed, just add more links using DSL, Cable, Satellite, and 3G/4G/LTE connections, all balanced and optimized with our outbound traffic manager and DSL/Cable Optimization Technology. You get blazing quick performance that scales on demand and automatically adapts to even the heaviest network traffic. Load Balancing and Automatic Health Checks Keep You Open for Business. Get the most out of your Internet connectivity investment and keep network traffic moving smoothly at all times with Peplink Internet link load balancing. Pep link's intelligent load-balancing algorithms automatically analyze network activity and efficiently distribute traffic, preventing slowdowns and productivity losses. Our Automatic Failover and Health Check technology continually monitors DNS, ping, and HTTP response on all connected links, rerouting traffic around dead links to ensure seamless connectivity. Easy Outbound Policy Management Helps You Stick to Your Mission. Simplify outbound policy management, even with multiple WANs, using drag-and-drop rule priorities, per-application policies, routing by protocol, custom device rules, and domain-specific policies. No other router gives you this level of control, and it's easy to ensure that your most important traffic always gets VIP treatment. Our Web Admin Interface, CLI, and In Control Suit Every Management Style. Manage your Balance your way. The Balance's built-in Web Admin Interface features drag-and-drop simplicity, Configuration Wizards, and extensive help to make management a breeze. For command-line fans and legacy users, there's our new CLI interface, and remote users can manage multiple Balance units from anywhere with In Control cloud-based management."}