{"asin": "B002FRIEAE", "description": "Unleash Your Inner Rockstar. Play on Guitar or Expand to a Band.Another Saturday night. Another chance to flex your Star Power.Your band members are all there. The house lights are low. And you can practically hear the whistles and cheers from the sold-out crowd, as fans grow impatient waiting for you to take the stage.You've been here before. But this time is different. The bar is set higher. There's more at stake. And the butterflies in your belly are real. Suddenly, this doesn't feel like a game anymore.Then you step into the spotlight. You nail that first riff. And you're lost in the music. Your fingering is spot-on. Your timing, flawless. When it's your turn to take center-stage, it's you and your Logitech Wireless Guitar Controller. Because you're not playing, you're unleashing your inner rockstar.Key FeaturesAuthentic materialsThis guitar controller's body is solid. Its neck is real wood. The frets and tuning peg handles are metal. And the fingerboard is rosewood.Realistic size and weightNo plastic toy guitar, this guitar controller is designed to look&#8212;and feel&#8212;like the real deal.&nbsp;Adjustable whammy barPlay fast and loose or keep it stiff. You can adjust the tension on the whammy bar to suit your style.&nbsp;The hottest hardwareThe Touch Sensitive Neck Slider is color-coded to correspond with the fret buttons, and there's an easy-to-reach Star Power button just below the strum bar, so you can rock all the latestGuitar Herofeatures. (Games sold separately.)Xbox 360 compatibilitySetup is a cinch. The controller uses Xbox 360 wireless technology. Just press the Xbox 360 Guide button and the controller connects to the console faster than a fret-burning lick.&nbsp;Virtually silent controlsThe Strum Bar is quiet as a whisper, and the fret buttons don't &ldquo;clickety-clack.&rdquo; You'll hear more music and less controller.&nbsp;Wireless range of up to 30 feetStep forward for your big solo. Drop back when it's your friend's turn to shine. You're not tethered to your console, so you're free to go where the music moves you.Suggested games for the Logitech Wireless Guitar Controller for Xbox 360:Works with Guitar Hero Games for Xbox 360What's in the BoxPackage ContentsLogitech Wireless Guitar ControllerGuitar Controller StrapQuick-start guide2 AA batteries1-year limited hardware warranty* Game sold separatelySystem RequirementsMicrosoft Xbox 360 game console", "price": 13.79, "imUrl": "http://ecx.images-amazon.com/images/I/31zGjZQDPiL._SX300_.jpg", "related": {"also_viewed": ["B0017HQDUG", "B000NUIYK0", "B001Q9XT8E", "B003814IYW", "B003RRTXYW", "B0040J1RIQ", "B000MRNUB2", "B000TG531G", "B002TQYEK0", "B0029Y05EG", "B001ABLHJG", "B000XYJ4PU", "B003N65DFA", "B003NSLFXM", "B0014BSNAS", "B0040J1RJ0", "B004OYXD7K", "B002N42SDS", "B001NDLC9Q", "B001ABN82A", "B000TGDHW8", "B0028N13GC", "B001D0ITA4", "B001ABP95E", "B000TSX3UC", "B000TTITLO", "B003RS1A7Y", "B0046BNTY8", "B00473WX2O", "B0028ZJ4O8", "B000TT4GBG", "B001UWN0EA", "B000BU8YA2", "B004QSXOMS", "B003RS8HG6", "B002C8P6IE", "B00381BKIY", "B001JE5NQM", "B004XDCJ4A", "B003N65DSM", "B004QSY97W", "B0014BUGLW", "B001BXAC3U", "B003N5ZXU6", "B003RRTWSE", "B000TT2D2A", "B001PKHRTQ", "B000TT2D0M", "B001TOMQUS", "B0016HF8DA"], "buy_after_viewing": ["B000TGDHW8", "B0017HQDUG", "B001Q9XT8E", "B000NUIYK0"]}, "salesRank": {"Video Games": 30644}, "categories": [["Video Games", "More Systems", "Xbox", "Hardware", "Accessories"], ["Video Games", "Xbox 360", "Accessories", "Controllers", "Guitars"]]}