{"asin": "B002C744K6", "description": "Amazon.com has certified this product is Frustration Free. A Frustration-Free Package is easy-to-open and comes without hard plastic \"clamshell\" casings, plastic bindings, and wire ties. It's designed to be opened without the use of a box cutter or knife and will protect your product just as well as traditional packaging during shipping. Products with Frustration-Free Packaging can frequently be shipped in their own boxes, without the need for an additional shipping box.Learn moreabout Frustration-Free Packaging.Featuring a precision unibody enclosure crafted from a single block of aluminum, the MacBook Pro is thinner and lighter than its predecessor as well as stronger and more durable. But Apple didn't stop innovating with the body's design. The MacBook Pro also includes a new 15-inch, LED-backlit glass display (instead of an LCD panel) as well as a glass trackpad that doesn't include a button (for larger tracking area) that features Apple's Multi-Touch technology.The 15-inch unibody MacBook Pro (seelarger version).This 15-inch MacBook Pro (model MC118LL/A) also now includes Apple's innovative built-in notebook battery for up to 7 hours of wireless productivity on a single charge without adding thickness, weight or cost. Using Adaptive Charging and advanced chemistry first introduced with the 17-inch MacBook Pro the built-in battery delivers up to 1000 recharges before it reaches 80 percent of its original capacity--nearly three times the lifespan of conventional batteries.Under the hood, the MacBook Pro is powered by a powerful 2.53 GHz Intel Core 2 Duo processor (with 3 MB L2 cache and 1066 MHz front-side bus), which runs applications faster and more efficiently as well as helps to reduce power requirements and save on battery life. And video is powered by the NVIDIA GeForce 9400M integrated graphics processor, which provides an outstanding everyday graphics experience with up to a 5x performance boost.Other hardware features include a 250 GB hard drive, 4 GB of installed RAM (which can be upgraded to 8 GB), an 8x combo Superdrive (for burning dual-layer DVDs as well as CDs), built-in Gigabit Ethernet for high-speed networking, Bluetooth 2.1+EDR (Enhanced Data Rate), FireWire 800 port, Mini DisplayPort video output (for DVI and VGA connections), and a Secure Digital card slot for easy access to digital photos and audio stored on SD and MMC memory cards.It comes pre-loaded with Apple's Mac OS X 10.6 Snow Leopard operating system--an operating system custom-designed for the advanced technology inside--and it also comes with the iLife '09 suite of applications, including iPhoto, iMovie, Garageband, and iTunes.The Unibody MacBook Pro DesignTraditionally notebooks are made from multiple parts. With the MacBook Pro all of those parts with just one part--the breakthrough unibody enclosure. Every MacBook Pro starts its life as a single block of aluminum, which is precisely machined into the basic unibody design. Another pass and the unibody takes shape. Another, and the integrated keyboard emerges. When you pick up a new MacBook Pro, you immediately notice the entire enclosure is thinner and lighter. And it feels strong and durable--perfect for life inside (and outside) your briefcase or backpack.Off-the-shelf lithium-ion cells come in fixed, cylindrical shapes. The 15-inch MacBook Pro is powered by custom-made, ultrathin lithium-polymer batteries.The standard aluminum electro-static trackpad has been replaced with a new glass Multi-Touch trackpad, which provides 40 percent more tracking area than before. Use two fingers to scroll up and down a page. Pinch to zoom in and out. Rotate an image with your fingertips. Swipe with three fingers to flip through your photo libraries. Swipe with four fingers to show your desktop, view all open windows, or switch applications. The entire trackpad surface is also a button, allowing you to both track and click virtually anywhere on the trackpad. And you can easily enable multiple virtual buttons in software, such as right-clicking.The keyboard has also been improved, with the rigid aluminum keyboard webbing cut precisely to hold the keys, which are curved to perfectly fit fingers. And it's illuminated, so when you're in low-light settings, such as airplanes or conference rooms, you can always see what you're typing.The 15-inch display is made of edge-to-edge, uninterrupted glass for a smooth, seamless surface and features LED backlighting for brilliant instant-on performance that uses up to 30 percent less energy than its predecessor. The ultra-thin displays provide crisp images and vivid colors which are ideal for viewing photos and moviesLong-Lasting BatteryThe 15-inch MacBook Pro now includes a newly engineered lithium-polymer battery that that lasts up to 7 hours on a single charge thanks to advanced chemistry, intelligent monitoring of the system and battery, and Adaptive Charging technology. The battery is built right into the computer, eliminating the space-consuming mechanisms and housings that standard removable batteries require. This non-removable battery also provides a longer battery lifespan of up to 1000 recharges--meaning fewer depleted batteries and less waste, which is better for the environment.Giving it a lifespan of up to 1000 recharges required breakthroughs in battery technology. Apple electro-chemists developed advanced chemistry that maintains the battery's charging capabilities longer than ever. And while most notebooks wear down their batteries by charging them at a constant rate, the 15-inch MacBook Pro takes a different approach. Using an Apple-developed technology called Adaptive Charging, a microchip on the battery constantly communicates with the computer to determine the optimal way to charge its cells, adjusting the current up and down depending on a variety of conditions. Combined, these advancements offer a dramatic improvement in battery lifespan: more than three times the lifespan of typical notebook batteries--up to five years.Intel Core 2 Duo ProcessorExperience improved energy efficiency, expanded wireless connectivity, and amazing battery life with the 2.53 GHz Intel Core 2 Duo processor, which has a super-fast 1066 MHz front-side bus (FSB), and an large 3 MB L2 cache. (An L2, or secondary, cache temporarily stores data; and a larger L2 cache can help speed up your system's performance. The FSB carries data between the CPU and RAM, and a faster front-side bus will deliver better overall performance.)The hafnium-infused circuitry--which reduces electrical current leakage in transistors--conserves even more energy, giving you more time away from the wall outlet. With 3 MB of shared L2 cache, data and instructions can be kept close to the two processor cores, greatly increasing performance and allowing the entire system to work more efficiently. And, because the processor cores share the L2 cache, either can use the entire amount if the other happens to be idle.Video Processing &amp; OutputThe MacBook Pro delivers both powerful graphics performance and long battery life via the NVIDIA GeForce 9400M integrated graphics processor, which provides an outstanding everyday graphics experience with up to a 5x performance boost. Power your way through the latest 3D games--including Call of Duty and Quake--and enjoy improved graphics performance with iWork '09, iLife '09, and everything you do in Mac OS X. The power-saving NVIDIA integrated graphics processor also keeps you up and running throughout the day, with up to 7 hours of battery life.The MacBook Pro includes a next generation Mini DisplayPort, which delivers a pure digital signal that can drive up to a 30-inch widescreen display. The Mini DisplayPort is ultra-compact at just 10 percent the size of a full DVI connector, and is compatible with Apple's 24-inch Cinema Display. Adapters are also available for using VGA, DVI/HDMI and Dual-Link DVI displaysHard Drive and MemoryThe 250 GB Serial-ATA (SATA) hard drive (5400 RPM) quickens the pace with a higher speed transfer of data--akin to USB 2.0. The 4 GB of PC3-8500 DDR2 RAM (two SO-DIMMs of 1024 MB) has an industry-leading 1066 MHz speed, and the RAM capacity can be increased to 8 GB.Wireless ConnectivityThe built-in 802.11n wireless networking provides up to five times the performance and twice the range of 802.11g, but it's also backward-compatible with 802.11a/b/g routers, enabling you to communicate with the a wide variety of Wi-Fi resources. It works seamlessly with the new AirPort Extreme with 802.11n. Use the built-in Bluetooth wireless technology to connect to your PDA or cell phone, synchronize addresses, or download pictures from your cell phone. You can also use a wireless headset for iChat audio chats and VoIP calls as well as quickly share files with a colleague.Video Conferencing with Built-in iSightArtfully placed in the glass display is an iSight camera, which enables easy video conferencing as well as allows you to snap pictures of yourself and create video podcasts. Using the iChat AV application, video conferencing is integrated into your iChat buddy list, so initiating a video conference is a breeze. iChat also lets you hold audio chats with up to 10 people and provides high-quality audio compression and full-duplex sound so conversation can flow naturally. For video podcasting, you can record a short clip using the iSight camera, then use iWeb to create a video blog entry or post your GarageBand-recorded podcast.Other FeaturesTwo USB 2.0 ports (up to 480 Mbps), one FireWire 800 (up to 800 Mbps), SD card slotMini DisplayPort compatible with DVI, VGA, and dual-link DVI connectors (all optional)Dual display and video mirroring: Simultaneously supports full native resolution on the built-in display and up to 2560 by 1600 pixels on an external display, both at millions of colors8x slot-loading SuperDrive with the following write speeds: 8x DVD&plusmn;R; 4x DVD&plusmn;R DL (double layer); 4x DVD&plusmn;RW; 24x CD-R; 10x CD-RWBuilt-in full-size backlit keyboard with 78 (U.S.) or 79 (ISO) keys, including 12 function keys and 4 arrow keys (inverted \"T\" arrangement)Internal omnidirectional microphone and built-in speakersCombined optical digital output/headphone out (minijack)Combined optical digital input/audio line in (minijack)Kensington lock slotMeasures 14.35 x 9.82 x 0.95 inches (WxDxH) and weighs 5.5 pounds (including battery)Environmental ConsiderationsApple has worked hard to eliminate many of the toxins that are a common part of computer manufacturing. Apple engineers removed the majority of brominated flame retardants (BFRs) and polyvinyl chloride (PVC) from circuit boards, internal cables, connectors, insulators, adhesives, and more in the MacBook Pro.Because Apple makes both the hardware and the software for the MacBook, they're designed to work together to produce a smarter product that uses less electricity. For instance, to reduce energy consumption, the hard drive spins down automatically when inactive. MacBook Air also decides which processor--CPU or GPU--is best suited to efficiently perform a task. The LED-backlit display in the MacBook Pro is another feature that plays an important part in conserving energy, consuming 30 percent less power than conventional LCD displays. And the display is designed to dim when you enter a darkened room.The MacBook Pro meets the stringent low power requirements set by the EPA, giving it ENERGY STAR certification. MacBook also meets the latest efficiency requirements of ENERGY STAR Version 5.0 Specification for Computers before its July 2009 effective date.The MacBook Pro has also earned the highest rating of EPEAT Gold. The Electronic Product Environmental Assessment Tool, or EPEAT, evaluates the environmental impact of a product based on how recyclable it is, how much energy it uses, and how it's designed and manufactured.Pre-Loaded with Mac OS X Snow Leopard and iLife '09Every Mac comes with Mac OS X Snow Leopard, the world's most advanced operating system, and iLife, Apple's innovative suite of applications for managing photos, making movies and creating and learning to play music. Snow Leopard builds on a decade of OS X innovation and success with hundreds of refinements, new core technologies and out of the box support for Microsoft Exchange. iLife features iPhoto, to easily organize and manage photos; iMovie with powerful easy-to-use new features such as Precision Editor, video stabilization and advanced drag and drop; and GarageBand which introduces a whole new way to help you learn to play piano and guitar.Installed softwareMac OS X v10.6 Snow Leopard (includes Time Machine, Quick Look, Spaces, Spotlight, Dashboard, Mail, iChat, Safari, Address Book, QuickTime, iCal, DVD Player, Photo Booth, Front Row, Xcode Developer Tools)iLife '09 (includes iPhoto, iMovie, GarageBand, iWeb, iDVD)What's in the BoxMacBook Pro, display cleaning cloth, 60W MagSafe Power Adapter, AC wall plug, power cord, install/restore DVDs, printed and electronic documentation", "title": "Apple MacBook Pro MC118LL/A 15.4-Inch Laptop", "imUrl": "http://ecx.images-amazon.com/images/I/41Cxmc27C7L._SX300_.jpg", "related": {"also_bought": ["B005SNSNI0", "B007N4BX1Q", "B005SNXIHG", "B00G2DN3QM", "B006T0BWV6", "B002TLTGM6", "B005JL5046", "B008BT3EH8", "B0017J7T7A", "B00359EXWE", "B002QQ8H8I", "B009DOOVUY", "B009L4NLES"], "buy_after_viewing": ["B0074703CM", "B001P05NKG", "B002QQ8H8I", "B002C7489S"]}, "categories": [["Electronics", "Computers & Accessories", "Laptops"]]}