{"asin": "B001TUYQT6", "description": "The XRS 9960G provides total protection and peace of mind with Super-Xtreme Range Superheterodyne Technology, detecting all 15 radar/laser bands with its super-fast lock-on detection circuitry. The unit provides extra detection range and the best possible advance warning to even the fastest of POP mode radar guns. It comes with a GPS Locator and Lifetime Subscription to AURA Database to alert you to verified Speed and Red Light Camera locations, dangerous intersections, and reported Speed Trap locations for entire United States and Canada. Other features include Cobra exclusive full-color ExtremeBright DataGrafix II Display, an 8-point electronic compass, Voice Alert, car battery voltage display/low car battery warning and much more.Total protection and peace of mind with Super-Xtreme Range Superheterodyne Technology.System Ready PromptNotifies the user that the radar detector has correctly completed a self-test and is ready.Spectre I UndetectableProvides complete immunity to Spectre I radar detector-detectors.Car Battery Voltage Display/Low Car Battery WarningProvides approximate voltage of your car's battery and also alerts user whenever car battery voltage falls below 11.9 volts.IntelliViewPicture-in-picture shows radar/laser alerts simultaneously with GPS locator based alerts.15-Band DetectionDetects 7 radar, 6 laser and 2 safety signals. Radar signals include X Band, K Band, Ka Superwide, Ku Band, VG-2, Spectre I and Spectre IV+. Laser signals include LTI 20-20, Ultra Lyte, ProLaser, ProLaser III, Stalker LIDAR and Speedlaser. Safety signals include Safety Alert and Strobe Alert.Spectre Alert I/IV+Alerts user when they are under surveillance of Spectre I/IV+ radar detector-detectors.Frequency Display ModeSuper-fast CPU determines the frequency of the Ka radar and laser gun frequencies in nano seconds.IntelliMute ProRelative speed sensing auto shutdown feature will render your detector undetectable by currently available radar detector-detectors.View controls, indicators, connections and display.Click to enlarge.GPS Locator and Lifetime subscription included.Click to enlarge.1.5\" OLED display provides enhanced data display in easy-to-read vivid colors.Includes bracket for easy windshield mounting.AURA Camera & Driving Database (included)GPS-based technology warns the driver of fixed speed and red light cameras, speed traps and dangerous intersections across North America. The AURA database is updated daily and provides the industry's most complete and accurate coverage and reliability. GPS Locator and Lifetime subscription included.IntelliScopeThis Patent-Pending Techonology provides information about the direction of Location Based Alerts relative to your moving vehicle using Global Positioning System.Programmable Up to 1,000 Location AlertsAdd up to 1,000 location-based alerts of your choice.VG-2 UndetectableProvides complete immunity to VG-2 radar detector-detectors.S-XRS Maximum Performance TechnologyNew and improved Super-Xtreme Range Superheterodyne (S-XRS) detection technology, with its super-fast radar lock-on detection circuitry, provides maximum detection range and best possible advance warning to even the fastest of POP mode radar guns.Full Color ExtremeBright DataGrafix II Display1.5\" OLED display provides enhanced data display in easy-to-read vivid colors. Also allows user to select from 5 different color schemes to match dash illumination (Full Color, Blue, Orange, Green and Red).POP Mode Radar Gun DetectionDetects the latest POP Mode Radar Gun (Super-fast Instant-On Mode)Ku Band DetectionDetects Ku Band Radar Gun currently being used in Europe. Be prepared for future introduction in the U.S.LaserEyeProvides 360-degree detection of laser signals.Voice AlertWarns driver with specific voice annunciation of the signal being detected.VG-2 AlertAlerts the user when they are under surveillance of VG-2 radar detector-detectors.Strobe AlertA Cobra exclusive, works with tens of thousands of emergency vehicles currently equipped with traffic light controlling strobe emitters. Provides advance warning of the presence and/or approach of emergency vehicles.Safety AlertWarns drivers of the presence and/or approaching emergency vehicles, railroad crossing, and road hazard locations equipped with Cobra's exclusive Safety Alert transmitters.Auto MuteAutomatically mutes the alert tone for enhanced driver convenience.IntelliMuteRelative-speed-sensing Auto Mute system that virtually elminates false alerts.IntelliShield False Signal Rejection3-Level City Mode offers the best false signal rejection in both urban and rural areas.Digital Signal Strength MeterProvides the driver with relative proximity to the target using 5-level digital signal strength meter.SmartPowerAutomatically shuts off power to the unit when ignition is turned off.City/Highway ModesAllows the user to select operating mode, reducing the frequency of falsing in densely polulated urban areas.Dim ModeAllows the user to dim the radar detector display enhancing night driving visibility.EasySet Programming MenuUser-friendly mode selection/setting with visual guidance.Stay Set Electronic MemoryElectronically remembers radar detector settings for an indefinite period of time even with the power removed.Digital SpeedometerProvides accurate, current vehicle speed using Global Positioning System.Latitude/Longitude InformationProvides accurate latitude/longitude information using Global Positioning System.8-Point GPS CompassProvides accurate, 8-point directional reading using Global Positioning System.8-Point Electronic CompassAutomatically provides an accurate electronic direction heading.What's in the BoxXRS 9955 Detector Unit; RDA GPSL55 GPS Locator and Lifetime Subscription to AURA Database for Verified Speed and Red Light Camera locations, dangerous intersections, and reported Speed Trap locations for entire United States and Canada; Mini-USB to USB Type-A Adapter Cable for database updates; Coiled 12V DC Power Cord; Windshield Mounting Bracket with suction cups; Instruction manual", "title": "Cobra XRS 9960G Voice Alert 15-Band Radar/Laser Detector with 1.5-Inch Full-Color Display, GPS Locator, and Red Light/Speed Features", "price": 249.0, "imUrl": "http://ecx.images-amazon.com/images/I/41AS1iXcwNL._SY300_.jpg", "related": {"also_bought": ["B001DSIMAI", "B000FED6NO", "B004AMBW1U", "B0063N82OO", "B0036UMQX0", "B0003NN81M", "B001ODDBSU"], "buy_after_viewing": ["B0036UMQX0", "B001TE5V0U", "B008AT6BZQ", "B001DSIMAI"]}, "categories": [["Electronics", "Car & Vehicle Electronics", "Vehicle Electronics Accessories", "Radar Detectors"]]}