{"asin": "B004H8FND0", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Sony DSC-H70With 30x optical zoom, incredible low light performance, full 1080x60p HD movie capabilities, and innovative features like, hi-speed linear auto focus, 3D image capabilities, and backlight correction to catch even the smallest details in high contrast shots, the Sony DSC-HX100V will renew your passion for photography.Sony DSC-HX100V Feature Highlights16.1 Megapixel Back-illuminated &ldquo;Exmor R&rdquo; CMOS Image SensorThe DSC-HX100V features a 16.2 megapixel &ldquo;Exmor R&rdquo; CMOS image sensor that brings out the full resolving power of the camera&rsquo;s Carl Zeiss Vario-Sonar lens to deliver extremely fast speed, high resolution, and stunning low-light sensitivity with improved image clarity and drastically reduced grain. In addition, the combined &ldquo;Exmor R&rdquo; CMOS sensor and BIONZ image processor delivers extremely fast 10fps, Anti Motion Blur, Hand-held Twilight and 1080i movie modes.6Carl Zeiss Vario-Sonar T Lens with 27mm equivalent wide angle lens and 30x Optical ZoomThe high-performance Carl Zeiss Vario-Sonar T lens with 30x optical zoom lens brings distant subjects closer for video recording as well as for outdoor, sports, and travel photos, and Close Focus shoots close-ups up within a &frac12;-inch&nbsp; of the subject. A 27mm equivalent wide-angle lens allows you to take wider shots of the scene or group in crowded spaces.3.0-inch XtraFine LCD &nbsp;&nbsp;&nbsp;3.0-inch XtraFine LCD with TruBlack technology gives you deeper blacks and more color in your display, all while being thinner than most LCDs.Full HD 1080/60p&nbsp;&nbsp;&nbsp;Record crystal clear movies at the highest resolution available with capabilities for 60p in 1080 Full HD. This provides stunning, fast motion video with less distortion for playback on your Blu-ray Disc players, Sony PlayStation3 systems and compatible PCs and HDTVs.", "title": "Sony Cyber-Shot DSC-HX100V 16.2 MP Exmor R CMOS Digital Still Camera with Carl Zeiss Vario-Tessar 30x Optical Zoom Lens and Full HD 1080 Video", "price": 398.0, "salesRank": {"Camera &amp; Photo": 2062}, "imUrl": "http://ecx.images-amazon.com/images/I/41zGjABjW6L._SY300_.jpg", "related": {"also_bought": ["B00564GFFE", "B0039BPG1A", "B0056AQRKG", "B00564BZHW", "B003VNKNEQ", "B0037T3634", "B00792JI2I", "B0053WIWX2", "B006K551TO", "B005DNM4EY", "B003VNKNF0", "B004P5Y1OW", "B004K7HDSG", "B00CV9MJFW", "B007HRTZVO", "B000ME8R22", "B00336G7MI", "B007XGKPMC", "B0065NIDYQ"], "buy_after_viewing": ["B0039BPG1A", "B00B7ID99I", "B00BEHRQB4", "B00564GFFE"]}}