{"asin": "B0011F19CG", "description": "Overview:On the Desk or On the GoExperience comfort and performance with the Microsoft&#xAE; Wireless Laser Mouse 6000. This mouse combines 2.4 GHz wireless freedom and the precision of High Definition Laser Technology with the portability of a snap-in transceiver.Features:&nbsp;&nbsp;&nbsp;Snap-in TransceiverPlug in the snap-in receiver when you&#x92;re ready to work, then snap it into your mouse when you travel, preserving battery life.&nbsp;2.4 GHz Wireless FreedomConfident wireless connection with up to 30-foot range, even in crowded wireless environments.&nbsp;High Definition Laser TechnologyMore responsive at 1000dpi, more precise at 6000 FPS and 85 MOPS, and smoother tracking.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Flip 3D ButtonDisplays dynamic 3D overlay of all open applications.&nbsp;MagnifierJust point and press the Magnifier button to enlarge and edit details.&nbsp;4-Way ScrollingScroll side to side as well as up and down..&nbsp;Additional Features:Extended Battery Life -Many users average more than six months of battery life. A battery status indicator tells you when your battery is running low.Ergonomic Design -Point and click in comfort&#x97;ergonomic design helps you work longer without discomfort.5-Button Mouse- Get quick access to the media, programs, and files you use most often with customizable buttons.&nbsp;&nbsp;System Requirements:Windows Vista&#xAE;/Windows XP/2000 (with SP4 or higher)100 MBMac OS X v10.2.x-10.5x30 MBPowered USB portCD drive2 AA alkaline batteries (included)&nbsp;&nbsp;", "title": "Microsoft Wireless Laser Mouse 6000 V2.0 Mac/Windows USB", "price": 199.99, "imUrl": "http://ecx.images-amazon.com/images/I/41-cr3%2BDlzL._SX300_.jpg", "related": {"also_bought": ["B001B8EUEW", "B003AU0FLQ", "B004SUIM4E", "B001B8EOMU", "B00427TAIK", "B000A6PPOK", "B00CYX26BC", "B006LPF3LY", "B0092N4M1E"], "bought_together": ["B001B8EUEW"], "buy_after_viewing": ["B002DPUUL4", "B003NR57BY", "B002HWRJBM", "B00D68ZVY8"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Mice"]]}