{"asin": "B000067O5G", "related": {"also_bought": ["B005NFG2O0", "B00BNR74EY", "B006OZEIKS", "B0090ZXW7E", "B000R4FPEK", "B00134BZP6", "B005NFG33A", "B00EL8NII8", "B00BIDDBRC", "B001H5QKOW", "B004ZHT89S", "B000R4HAO8", "B001D4GGQY", "B00028ONIA", "B003V112QG", "B000XVI4WC", "B006OZEIQM", "B008OHNZI0", "B003V12XFU", "B009A5206S", "B004W2T332", "B00ASC3PJ8", "B007B5P6S8", "B00879EZJI", "B00FYYOWVU", "B002TS795K", "B00ENFVLAQ", "B000A6PPOK", "B002RRPDA6", "B0000CEPC8", "B00004Z5RA", "B008ALADKI", "B00DBV28TG", "B003VANO7C", "B009K916ZK", "B00099XMC0", "B001BGJAVM"], "buy_after_viewing": ["B005NFG2O0", "B006OZEIKS"]}, "title": "3M Privacy Filter for 13.3 Inch Standard Laptop PF13.3", "price": 39.98, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31Vr0fqs4hL._SY300_.jpg", "brand": "3M", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Monitor Accessories", "Screen Filters"]], "description": "From the Manufacturer3M&trade; Privacy Filters for laptops and netbooks are the perfect fit for people who want to keep their private data out of sight. They share the same patented microlouver technology used in 3M&trade;Frameless LCDand FramedLCD Filters, blocking the view of curious onlookers without diminishing yours. So you can enjoy peace of mind using your laptop or netbook in close quarters or high traffic areas. Plus, easy-on, easy-off 3M&trade; Privacy Filters are the convenient way to create a barrier between your fragile LCD screen and inevitable scuffs and scratches. And like the stylish new3M&trade; GOLD Privacy Filters, they don&rsquo;t rely on blurring or distorting images to guard your privacy. So they go a long way in protecting your eyes. Simply size up your screen and scroll the model list above. Then confidently take your digital life with you, wherever life takes you. Even better, all 3M Privacy Filters are backed by a one-year warranty.To ensure proper fit,measure the viewable height and widthof your laptop screen. (Do not include the screen frame in your measurement.) Then, choose the filter size that matches your exact measurements, or slightly smaller.Measure Twice. Order Once.Even if you have a pretty good idea what screen size and aspect ratio your laptop or netbook boasts, it&rsquo;s best to pull out the ruler. By ordering the 3M&trade; Privacy Filter that is a perfect fit for your widescreen or standard laptop or netbook, you&rsquo;ll save time and money by avoiding the hassle of returns and exchanges. See the measuring instructions diagram to determine your perfect fit from the model list above.It's a matter of perspective.Whether it&rsquo;s staying compliant for work or keeping family photos to yourself, privacy is central to everything you do. 3M&trade; Privacy Filters create a 30-degree cone of vision so on-screen data is visible only to those directly in front of your screen.Microlouver technology exclusive to 3M&trade; Privacy Filters and Films creates an invisible 60-degree &ldquo;safe area&rdquo; where on-screen data is visible only to those directly in front of the monitor&mdash;without blurring or distorting.Fear no train commute, plane seat, park bench, cubicle farm or coffee house. No matter where you are or what digital device you have, 3M&trade; Privacy Filters prevent others from crowding your personal space or perusing your digital life.Covering all the angles.Your laptop or netbook screen is an open window to your personal and business affairs. But what about yourmobile deviceordesktop? Whether you login at work or home, in a bustling coffee shop or busy airport, 3M Privacy Filters and Films are designed to deliver peace of mind in any setting.A deeper understanding.How do 3M&trade; Privacy Filters protect your on-screen information while making it privy to your eyes only? Patented 3M&trade; Advanced Light Control Film (ALCF) technology contains closely spaced black microlouvers positioned to 1-degree precision, with over a dozen louvers per millimeter evenly distributed across the screen. It&rsquo;s a mini Venetian blind with no strings attached.Microlouvers just one-fifth the width of a human hair simulate tiny Venetian blinds to shield out curious glances toward your screen while directing onscreen data to the user&rsquo;s viewing area.Easy-on, easy-off attachment system makes 3M&trade; Privacy Filters the perfect fit for laptop and netbook users on the go.Scuff happens.Today's laptop and netbook screens are brighter and easier to view. But fragile LCD surfaces are easier to scratch, scuff, smudge or damage, making it difficult to view your data. And repairs can be costly and time-consuming. 3M&trade; Privacy Filters provide your laptop or netbook extra protection against everyday use the moment you place it on your screen. Have a mobile device with a screen worth protecting? Check out3M&trade; Mobile Privacy Films."}