{"asin": "B002LITT6U", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Your camera says a lot about you--and according to Canon&rsquo;s new PowerShot SD940 IS, you&rsquo;re into hot design and cool technology. Emerging from your jeans pocket or purse like a sleek little jewel, the PowerShot SD940 IS makes a statement before you even take a picture. And the new menu ensures easy access to all its advanced Canon technology, where 12 megapixels, improved Smart AUTO Mode and 720p HD movies are just the beginning.PowerShot SD940 Highlights4x optical zoom in actionNever leave home without this sleek polished cameraIt&rsquo;s so easy to have the PowerShot SD940 IS on hand wherever you go. Sized to fit anywhere from your jeans pocket to your smallest handbag, you&rsquo;ll never miss another photo op. All those imitators out there can&rsquo;t begin to capture the design icon status of a Canon ELPH. New for the PowerShot SD940 IS: smooth lines and brilliant simplicity are rendered in four memorable metallics.12.1-megapixel resolution, a 28mm Wide-Angle Lens with 4x optical zoom and Canon&rsquo;s Optical Image StabilizerCanon&rsquo;s commitment to innovation defines the excitement of the PowerShot SD940 IS. 12.1-egapixel resolution is more than a number, it&rsquo;s your cutting-edge link to the outstanding clarity and quality you&rsquo;ve always wanted in your images. Think bold and big, because razor-sharp oversized prints are a breeze. Get the picture? It&rsquo;s absolutely brilliant.The PowerShot SD940 IS has a 4x optical zoom lens that makes it easy to get the inspiring, emotive close-ups that will make your images lasting keepsakes. This magnificent lens gives you the power to shoot distant subjects with razor-sharp precision and stunning lifelike color. So you can brilliantly capture a closer shot of a landscape, or a child&rsquo;s big smile.The PowerShot SD940 IS is equipped with Canon&rsquo;s acclaimed Optical Image Stabilizer Technology that automatically detects and corrects camera shake--one of the leading causes of fuzzy or blurred shots. Even when zoomed in, you can get the steady, crisp, brilliant images you&rsquo;ll be proud to shoot and share. And Canon&rsquo;s Optical Image Stabilizer Technology is so convenient to use. It functions perfectly with or without a flash.720p HD movie shooting capability plus HDMI outputThe PowerShot SD940 IS lets you record video in beautiful high definition (1,280 x 720 pixels). The camera also makes it easy to enjoy HD movies (and still photos) on your HDTV with a mini-HDMI connector for direct connection to a high-definition monitor or TV. You&rsquo;ll enjoy the HD experience with no degradation of image or audio in the signal, plus the ability to display up to 130 thumbnails at once.Large, crisp 2.7-inch PureColor System LCD with wide viewing angleThe PowerShot SD940 IS gives you a large 2.7-inch PureColor System LCD screen for excellent control when framing your shots. Canon&rsquo;s PureColor System LCD offers spectacular color, resolution and contrast even when viewed at an angle. The screen is highly durable and easy to see in any light with a scratch-resistant, anti-reflective coating. It also features Night Display for easy viewing in low light--a perfect feature for gathering friends and family around to see your images.Improved Smart AUTO Mode intelligently selects the proper settingsJust set the Canon PowerShot SD940 IS to Smart AUTO and you&rsquo;re ready for maximum enjoyment from your picture taking every time. It&rsquo;s a relaxing and satisfying way to shoot because you can completely concentrate on your subject, knowing that the camera has the technical details covered. Advanced Canon technology intelligently analyzes your situation and shooting conditions. Then it automatically selects an appropriate setting from 22 specially defined settings. So whether you&rsquo;re photographing flowers, a captivating sunset or your friends at the park, you can be confident that you&rsquo;re getting dramatic, memorable images. Even if your subject is moving, Canon&rsquo;s advanced detection technologies capture the action as it happens.Shooting ModesAdvanced presets for the best possible photos under certain conditions. With 20 Shooting Modes, you&rsquo;re ready for whatever shot comes your way.Easy to use with built in hints and tipsPowerShot SD940 IS lets you focus on the fun and creativity of photography by making your shooting experience easy and intuitive. While you&rsquo;re shooting, you&rsquo;ll see helpful hints and informative tips for each function right on the PureColor System LCD monitor. Shooting information is in plain language--no advanced photographic knowledge required. And Canon has even made it easier to search for images on your computer by including the shooting date in the folder name.What's in the BoxPowerShot SD940 IS BodyLithium-ion Battery Pack NB-4LBattery Charger CB-2LVWrist Strap WS-DC7Digital Camera Solution CD-ROMUSB Interface Cable IFC-400PCUAV Cable AVC-DC400", "title": "Canon PowerShot SD940IS 12.1MP Digital Camera with 4x Wide Angle Optical Image Stabilized Zoom and 2.7-inch LCD (Black)", "price": 17.12, "salesRank": {"Camera &amp; Photo": 4320}, "imUrl": "http://ecx.images-amazon.com/images/I/410B-uj%2BmcL._SX300_.jpg", "related": {"also_viewed": ["B0035FZJKI", "B001SER47Y", "B0035FZJJ4", "B00I58LZ80", "B004J3V8UU", "B00HLDFNKQ", "B0075SUJ4W", "B006UMM1AY", "B00AWYN0BU", "B004J41T7Q", "B00I58LZRG", "B0035FZJKS", "B0035FZJLM", "B00B5HE3UU", "B005II5OLY", "B003ZSHNG8", "B0075SUJBA", "B002LITT3S", "B0075SUJQK", "B00EFILNV8", "B0035FZJIA", "B005MTME3U", "B0075SUK14", "B00065L5SU", "B0035FZJL2", "B001SER46K", "B00B5HE32I", "B0075SUG8Q", "B00AWYN0ME", "B0075SUHQC", "B0075T7NW2", "B002LITT5Q", "B00HLDFPA4", "B001SER49M", "B00B5HE3AK", "B006UMM1UO", "B00AWYN182", "B006UMM1J0", "B004J3Y9ME", "B0035FZJJE", "B003L77Y5S", "B004J3X5VA", "B00B5HE3YG", "B0011ZK6OS", "B004J3V828", "B006K553QA", "B00B5HE3IW", "B009B0MYSQ", "B0035FZJM6", "B004HW73SO", "B000NK6J6Q", "B006UMM1PO", "B00HLDFQU8", "B00I58LPYO", "B004J3V7RO", "B00I58M192"], "buy_after_viewing": ["B003VNKNF0", "B003VNKNEQ", "B00B5HE3UU", "B007BJHETS"]}}