{"asin": "B003B20F5E", "description": "Introducing the Linksys AE1000 High-Performance Wireless-N AdapterWirelessly connect your Windows laptop or desktop computer with the incredible performance of Wireless-N. The Linksys AE1000 High-Performance Wireless-N Adapter plugs into your PC's USB port and a step-by-step setup wizard will have your computer connected wirelessly in minutes. Industrial-strength encryption helps keep your communications and information private. Easily upgrade your PCs and wired devices with this High Performance Wireless-N USB Adapter.The Linksys AE1000 Adapter provides a reliable wireless connection to non-wireless desktop and laptop PC computers.&nbsp;In addition to this Wireless-N Adapter, the Linksys E-Series includes theE1000,E2000, andE3000Wireless-N routers. Check out acomparison chartof these three models. Additionally, the E-Series offers the customizable,Linux-based E2100Lrouter.Key FeaturesCisco Connect screenshots (seelarger image).Provide Wireless-N capability to your Windows desktop computers and laptops.Enjoy the flexibility of selectable dual-band Wireless-N--connect to either a 2.4 GHz or 5 GHz wireless network.Set up your Adapter in a few easy steps with the included software's simple setup wizard.Use the included USB extension cable and Adapter base to place your Adapter in a convenient location and improve wireless connectivity--ideal for hard-to-reach USB ports.Keep Wi-Fi freeloaders and Internet threats at bay with customizable security settings, including WPA/WPA2 Personal and WPA/WPA2 Enterprise.The AE1000 Adapter withincluded stand.Flexible ConnectivityThe AE1000's Wireless-N dual-band capability offers the flexibility to connect your wired devices wirelessly in either the 2.4 GHz or 5 GHz radio bands. The Adapter comes with a USB extension cable and base, allowing you to place your Adapter in a convenient location and to improve wireless connectivity, making it ideal for hard-to-reach USB ports. The Linksys AE1000 also works with Wireless-G, -B and -A networks.Quick to InstallSet up your Adapter in a few simple steps. Just insert the Linksys AE1000 CD; a step-by-step setup wizard makes it easy to get connected and to configure to your network's settings. Soon you'll be sharing your home's Internet connection with your family's other computers and devices and experiencing the incredible performance of Wireless-N.State-of-the-Art SecurityConnect to Linksys and other wireless routers using advanced WPA/WPA2 wireless security that helps protect your data and privacy.Other Linksys ProductsLinksys E1000Enjoy the benefits of Wireless-N in your home--ideal for wireless Internet usage and home office productivity.Connect your computers, wireless printers, smartphones, and other wireless devices at up to 300 Mbps of transfer speed.Use four Fast Ethernet (10/100 Mbps) ports to directly connect wired devices.Linksys E2000Connect your computers, gaming consoles, Internet-enabled HDTVs and Blu-ray players, and other wireless devices at up to 300 Mbps of transfer speeds.Use four Gigabit Ethernet (10/100/1000 Mbps) ports for faster file sharing with other Gigabit-enabled devices, including computers, hard drives, and servers.Utilize selectable dual-band (2.4 GHz or 5 GHz) to avoid interference on your network, allowing for smoother file transfers and media streaming.Linksys E2100LUtilize the built-in Linux operating system to use additional customization options.Enjoy the benefits of advanced Wireless-N technology--connect your computers, gaming consoles, and other wireless devices at up to 300 Mbps of transfer speeds.Use four Fast Ethernet (10/100 Mbps) ports to directly connect wired devices.Stream video and media content via a built-in UPnP AV media server to an Xbox 360, PS3, or other compatible device.Includes detachable antennas.Linksys E3000Connect your computers, gaming consoles, Internet-enabled HDTVs and Blu-ray players, and other wireless devices at up to 300 Mbps of transfer speeds.Enjoy the benefits of simultaneous dual-band (2.4 GHz and 5 GHz), including smoother HD video streaming, wireless gaming and file transfers.Stream video and media content via a built-in UPnP AV media server to an Xbox 360, PS3, or other compatible device.Use four Gigabit Ethernet (10/100/1000 Mbps) ports for faster file sharing with other Gigabit-enabled devices, including computers, hard drives, and servers.", "title": "Cisco-Linksys AE1000 High-Performance Wireless-N Adapter", "price": 23.98, "imUrl": "http://ecx.images-amazon.com/images/I/41SJJBB4OEL._SX300_.jpg", "related": {"also_bought": ["B0011E324K", "B004K1EZDS", "B001NLV4TQ", "B00BWT1IFE", "B007ZLGXA8", "B0054YQO5C", "B0054YQOM0", "B004T9RR6I", "B00AOBXK9S", "B00127OVHI", "B0009ZBRS0", "B004T9RR4A", "B00461G3MS", "B002RM08RE"], "buy_after_viewing": ["B007ZLGXA8", "B0054YQO5C", "B00A3VFIM6", "B006CQR7CK"]}, "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Network Adapters", "USB Network Adapters"]]}