{"asin": "B000WM2YS2", "description": "The DLO Jam Jacket with earbud management is a superior no-slip silicone case that adds a grippable layer of protection to your iPod touch. But grip is just the beginning--this high-quality, lint-free silicone case features a raised texture, corner bumpers, and integrated Earbud Management, and includes a free screen protector--all in one package!Get a Grip, and Tame Your EarbudsIt's a Wrap!Tired of dealing with tangled cords and dangling earbuds? The Earbud Management System on the back of the Jam Jacket allows you to neatly wrap the cord behind your iPod and safely stow your iPod earbuds while not in use. When it's time to jam, unwind only as much as you need--the handy side-notches will hold the cord in place, keeping the excess cable wrapped and out of your way.Total Protection + AccessJam Jacket protects your iPod touch body while the included DLO Surface Shield adds an invisible layer of protection to your multi-touch display. And unlike some cases out there, the Jam Jacket provides an opening for the ambient light sensor--meaning this case won't interfere with your iPod functionality like others that obscure the sensor. The Jam Jacket also features access to the iPod dock connector, so you can use your favorite charger or car accessory while your tunes stay protected.Go ahead, slip the Jam Jacket onto your iPod touch for grippable protection and headphone management in one unique case.What's in the BoxBlack Jam Jacket for iPod touch.", "title": "DLO Jam Jacket Case with Cord Management and Surface Shields for iPod touch 1G (Black)", "price": 6.95, "imUrl": "http://ecx.images-amazon.com/images/I/5198Hl2L5yL._SY300_.jpg", "related": {"also_viewed": ["B000WLXO9Q", "B00117H0AO", "B000VXT1AQ", "B008BR4L2W", "B00AULINY4", "B000S37Q0Q", "B003UES8D4"], "buy_after_viewing": ["B001GHQUR8", "B000VXVHUS", "B000XHS4SK", "B006I0FO48"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Cases"]]}