{"asin": "B0012N3ZXS", "description": "Street Fighter IVbrings the legendary fighting series back to its roots by taking the beloved fighting moves and techniques of the originalStreet Fighter II, and infusing them with Capcom's latest advancements in next generation technology. The result is a truly extraordinary experience destined to reintroduce players, both familiar with theStreet Fighterseries and those coming to the game for the first time, to the time-honored art of virtual martial arts.The old rivalries continue.View larger.Plenty of bosses to battle.View larger.New faces to reckon with.View larger.New Ultra Combo angles.View larger.What Was Old is New AgainKnowing a good thing when they see it, Capcom has gone to great lengths to ensure that everything that made the legendaryStreet Fighter IIa hit in the arcades, living rooms and dormitories across the globe all those years ago has been brought back inStreet Fighter IV, and this naturally starts with the characters. Fans of the franchise, as well as the fighting genre in general, will be happy to know that whether you prefer to stick with the superior abilities of top tier characters or explore the ins and outs of mid to lower level combatants, when it comes time to pick your fighter there is a wide array of choices. Also, not only will players be able to play as and against their favorite classic characters, such as Ryu, Ken, Chun-Li, Guile, Zangief, Blanka, Sagat, etc., they will also be able to take on new characters. Just a few of these include:AbelThis young French amnesiac comes from a mixed martial arts and mercenary background and is dedicated to chasing down the remnants of Shadaloo.Crimson ViperThis tough and beautiful agent assumes a businesslike demeanor, ignoring all emotion and obligation to her fellow man. She wears a high-tech suit filled with deadly gadgetry..El FuerteThis fighter divides his time between perfecting his Lucha Libre skills and his cooking abilities, yet surprisingly his indomitable spirit is a match for even the legendary Red Cyclone.RufusThis portly fighter has declared himself America's greatest fighter and uses his own brand of Kung Fu in his decidedly one-sided rivalry with Ken for top dog in the States.In addition, characters and environments are rendered in stylized 3D, while the game is played in the classicStreet Fighter2D perspective with additional 3D camera flourishes. Six-button controls for the game return, with a host of new special moves and features integrated into the gameplay system.Street Fighter IVbrings a brand new fighting game to fans the world over.Key Game Features:3D environments and characters.Traditional \"2D\"Street Fightersix-button gameplay.ClassicStreet Fightercharacters re-imagined for a new generation of gamers, including the original cast ofStreet Fighter II.New brawlers: female super-spy Crimson Viper, lucha libre wrestler El Fuerte, mixed martial artist Abel and more.New special moves that go beyond anyStreet Fighterfan's wildest imagination, including Focus Attacks, Super Combos, and the revenge-fueled Ultra Combo system.Amazing locations never seen before in aStreet Fightergame.New gameplay elements provide challenges for both newcomers as well as the most seasonedStreet Fighterpro.New Combat Features: Focus Attacks and Ultra CombosAlthoughStreet Fighter IVis designed to draw heavily from past game features in its franchise history, it does offer some stunning new gameplay options. The first of these are Focus Attacks. These moves allow players to absorb the energy from an attack and quickly counter with their own. Used properly, Focus Attacks allow for tremendous flexibility during combat and are the end result of efforts by the game's development team to evolve combat away from the rigid memorization of set combination patterns, giving players the freedom to be creative against opponents. The other new combat feature are new powered up moves called Ultra Combos. Like standard combos their purpose is to unleash maximum damage on an opponent, but unlike the combos of old, when performed correctly these long strings of punches, kicks and moves result in changes to the in-game camera angle and quick cinematics which illustrate the strength of your skills like never before. Taken together, these two new features heraldStreet Fighter IVas the new king of the fighter genre and a force to be reckoned with for years to come.", "price": 7.21, "imUrl": "http://ecx.images-amazon.com/images/I/51iAJYACUxL._SY300_.jpg", "related": {"also_bought": ["B003IE9V28", "B0017ZDGWG", "B006ZTHGCK", "B002TDIEE0", "B002I0J998", "B001PB9J14", "B003O6CACS", "B003O6G6RI", "B000ZKDOVW", "B001D7T2XA", "B003ZSP0WW", "B000FRU1UM", "B000FRVCAA", "B005C7R8I8", "B000PIPUN4", "B000ZK9QD2", "B004X56OU8", "B001G3AZS2", "B002I0H79C", "B000TI836G", "B000ZK696O", "B006KYYP06", "B002BCXALQ", "B0050SY4DG", "B000B6ML28", "B001ASJISG", "B003Q53VZC", "B000CRSBLQ", "B000FRU0NU", "B003R783IY", "B000ZK6950", "B002I0JAVK", "B002MED6F8", "B000UKZ20S", "B0017HPE7E", "B001TOMQTY", "B003IMGC2C", "B004UDLRMS", "B000FRS9II", "B003O6N266", "B0050SYX8W", "B005DVAB1Y", "B001E8VB3C", "B0088I7KYU", "B0025UOZEA", "B00354NAYG", "B001QXNBJM", "B0053BSNZU", "B008277M0Y", "B003O6G5TW", "B0043B5SKE", "B000XUPBEW", "B007B7BI8S", "B001AZFSG0", "B000WSE2WM", "B00BURPOZ8", "B004GWWW5Y", "B000TG530M", "B006MQH644", "B007M6W38W", "B007SRM5MO", "B0050SYAQ2", "B000P46NMK", "B0054IN5RI", "B005GSBLXQ", "B002I0JGDM", "B002BSA2LQ", "B0042YM9GI", "B0053OMR5Y", "B006VB2UNM", "B000X25GX6", "B002DC8GKE", "B0085L2T14", "B00D9EPI38", "B003C1I0CO", "B001989B4S", "B001JICM12", "B001TOQ8J8", "B002DC8GMM", "B004I5EE46", "B007MJSZDQ", "B002GPPPS4", "B004Z4ZJZS", "B002I0JBVY", "B000A0EFJW", "B000G5R8JA", "B00273Z9WM", "B006ZPAYGE", "B003O6E986", "B0050SYCJM", "B001UU1WTC", "B001KWFBG0", "B000MK4G1M", "B001B0BB3S", "B000GPVUOY", "B00FJWNSWQ", "B00BU3ZLJQ", "B0030GBUCS", "B0030CV356", "B005YR1VP2"], "bought_together": ["B006ZTHGCK", "B0017ZDGWG"], "buy_after_viewing": ["B003O6CACS", "B002TDIEE0", "B006ZTHGCK", "B0017ZDGWG"]}, "salesRank": {"Video Games": 2769}, "categories": [["Video Games", "Xbox 360", "Games"]]}