{"asin": "B0021L9HKK", "description": "Automatically back up and protect your digital memories, centralize your media and content for sharing with friends and family, and enjoy your digital media while at home or away with the HP LX195 MediaSmart Home Server. The LX195 is the first HP MediaSmart to be powered by the efficient Intel Atom processor, which helps use less energy and save you money on your electrical bills. A Sleep Mode conserves energy and saves you money in more ways than one. The built-in sleep mode consumes only 3W of power, and the server can take on many of your PC's responsibilities, enabling you to turn off your individual computers to further save energy and money.Enjoy both worry-free backup of all of your home's PCs (including Macs) as well as easy music, video and photo streaming.The HP LX195 includes 640 GB of internal storage and expansion using USB external hard drives via the four USB 2.0 ports.The sleek, slim micro-tower design is perfect for use in the home office or the living room, and it has a compact footprint of just 4 by 8 inches. The LX195 includes a single internal hard drive with 640 GB of storage, and you can expand your storage capabilities via optional external USB drives, which can connect via the four USB 2.0 ports on the back of the device. Other features include 1 GB of RAM, and ultra-fast Gigabit Ethernet networking (10/100/1000). And it's easy to set up--just plug it in, connect it to your wireless router (sold separately), and load the software onto your PCs and Macs.Managing Your Digital LifestyleWith the increasing amount of digital content that you work with on a daily basis as well as growing digital media libraries, a homer server can both share files to computers on your network as well as back up critical files from those computers. Here are just a few things that the HP LX195 MediaSmart can do for you:Automatic BackupAutomatically manage daily backup, virus protection, media collection, and power management, all behind the scenes.Automatically back up multiple computers, whether running Windows (via Microsoft Windows Home Server Backup) or Mac (via Apple Time Machine).Store up to 168,000 photos, 147,000 songs or 405 hours of video on the installed 640 GB hard drive.Get additional protection by backing up your server to an on-line back-up service like Amazon S3.Designed for Digital MediaAccess your media anywhere with an Internet-connected computer.Stream music and photos to any computer, while you're at home or away.Stream to your stereos and TVs through a gaming console like the Xbox 360 or PlayStation3.Publish photos to photo-sharing and social networking Web sites--Snapfish, Flickr, Picasa, and even Facebook--via any Internet-connected computer, or share directly from your server.Share music libraries for play throughout your home.Easy Setup, Scheduling, and SupportSet up fast: just plug it in, connect it to your wireless router (sold separately), and load the software on your PCs and Macs.Schedule the server to copy and centralize Windows PC media files and libraries (including iTunes and playlists).Expand your capacity by adding external hard drives via four USB ports on the back.Warranty and support: one-year limited; get help toll-free, 24 x 7, or via email in as little time as an hour.Software FeaturesHP Control Center.The HP MediaSmart software that sits on top of the Windows Home Server software making access to tasks easier. Users with administrative access privileges can access the Windows Home Server Console from the HP Control Center.Windows Home Server Console.Software accessed from the HP Control Center to manage your HP MediaSmart Server. Software includes setting up shared folders, assigning user access privileges and customizing backups.File Sharing and Storage.Effortlessly centralize your files and access them from any PC and or Mac on your home network. Set Read/Write, Read Only or No Access privileges for each user. Access privileges are set at the shared folder level. In addition, you control the remote access privilege for each user.PC Hard Drive Disk Backup.Once the HP MediaSmart Server software is installed on a home PC, the Windows Home Server backup software automatically starts backing up the PC's hard disk drive image every night. You can customize the number and frequency of backups kept. You can also make incremental backups, where only changes are backed up after the initial large backup.Mac Backup.Back up your Macs to the MediaSmart Server using Apple's Time Machine software.Shared Folder Duplication.Folder duplication requires permanently adding an external hard disk drive to one of the USB 2.0 ports on the back of the product. Designated folders can be copied automatically onto an external hard disk drive for an additional layer of redundant protection.HP Media Collector.Conveniently schedules the server to copy and centralize your Windows PC media files and libraries (including iTunes and playlists).Remote Access.Upon installation, you can set up a personal web address to be used for remote access and by visitors. Using your personal web address, you can remotely access shared folders and files on the HP MediaSmart Server from any Internet-connected computer. Remotely run applications on computers on your home network through the HP MediaSmart Server from an Internet-connected computer using your personal web address.In-Home and Remote Media Streaming.Extend your digital media experiences by conveniently streaming photos, music and videos to your TVs, through gaming consoles such as Xbox 360 or PlayStation3, and computer's within your home. Remotely stream music and photos from your server to any Internet-connected computer for access while you are away.HP Photo Publisher.Easily publish your photos to Snapfish, Facebook, Flickr, and Picasa Web Albums using an Internet-connected computerHP Photo Viewer.Quickly share photos and albums stored on the Server with friends and family.Server for iTunes.Centralize your iTunes music libraries and playlists on the server for playback to any PC or Mac running iTunes on your home network.Easy Storage Expansion.Add up to four external hard drives to the HP MediaSmart Server, indicate that you want to add the disk in the Windows Home Server Console, and the HP MediaSmart Server storage grows. No need to power down the unit or manage drive letters for multiple hard drives.Server Anti-Virus Protection.Server side anti-virus trial offer from McAfee for increased protection of your HP MediaSmart Server. Run quick scans of specific folders or deep scans across your entire home server.Server Backup.Users.Up to 10 user accounts can access the HP MediaSmart Server. In addition, a predefined Guest account can be enabled.PC Operating System Support:Automatic backup of computers running Microsoft Windows Vista (32 & 64 bit), XP Home (SP2), XP Professional (SP2), Media Center Edition 2004 (SP2) or later, and Macs running Apple'sTime Machine.File sharing for computers running Microsoft Windows Vista (32 & 64 bit), XP Home (SP2) or XP Professional (SP2), Media Center Edition 2004 (SP2) or later, Mac OS X, or Linux.Remote access to computers running Microsoft Windows XP Professional (SP2), Media Center Edition 2005 (SP2), or Vista Ultimate.Hardware FeaturesProcessor: 1.6 HGz Intel Atom 230Memory: 1 GB of DDR2 RAMInternal Storage: 640 GB hard disk drive (SATA, 7200 RPM)Internal Expansion: noneExternal Expansion: 4 USB 2.0Network Support: 10/100/1000 (Gigabit) RJ45 Ethernet; supports both wired and wireless PCs (via a wireless router).Dimensions: 3.9 x 8.2 x 8 inches (WxHxD)What's in the BoxThis package includes the HP LX195 MediaSmart Server, power adapter and cable, Ethernet cable, software installation disc, PC restore disc, server recovery disc, and printed setup and user guides. The MediaSmart Server is backed by a one-year limited warranty and dedicated software technical support both online and by phone.", "title": "HP LX195 MediaSmart Home Server", "price": 265.17, "imUrl": "http://ecx.images-amazon.com/images/I/41wGoWkMPhL._SY300_.jpg", "related": {"also_viewed": ["B005KKJPCO", "B00FE29IWK", "B00IU0R23K", "B00307EL8M", "B007JLDTRY", "B00DDXS936", "B00AKWUZ58", "B007HDA224", "B00FE2G79C", "B00F6EK9J2", "B0050TVAWS", "B004UBU3SY", "B00GJYNLKM", "B0053GBB5Y", "B00FF1VDLY", "B005TJLU24", "B003X26VV4", "B006OD3M84", "B001AHLODY", "B00DW1W6N8", "B00DDXSKTY", "B00D02ASI4", "B002WRIBN2", "B00GAIBC0I", "B00CO0DIQ2", "B00EJ3H95I", "B009XOVKEY", "B00FRSP780", "B00FJF4S22", "B00JKM0EBE", "B00CRB9CK4", "B005INAKGI", "B00DW1VJVI", "B004UC4HCG", "B00JKM0A36", "B00JKM0ES2", "B00FJF4UAW"], "buy_after_viewing": ["B00F6EK9J2", "B0050TVAWS", "B00EVVGAFI", "B00EVVGAD0"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "Network Attached Storage"]]}