{"asin": "B0031U1ATQ", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Connectors & Adapters"]], "description": "Have you tried using a phone connecting cable in your car  for your MP3 player or SmartPhone and been bothered by a \"hum\" that accompanies  the sound?&nbsp; The best way to avoid that  bothersome humming is to connect directly into your car's AUX port so you get  pure sound without interference from the car's electrical system.&nbsp; The Kensington Noise Reducing Car Audio AUX  Cable lets you do that easily and efficiently.The direct AUX connection and noise reducing technology of  the Kensington AUX Audio Cable combine to deliver clear, clean sound through  your car's stereo.&nbsp; The 4 foot long,  3.5mm audio cable is braided for long term durability and to keep it from  tangling.&nbsp; The cable plugs into your  car's AUX port and into the headphone jack of your portable device.&nbsp; And you're in business.&nbsp; The only humming you'll hear will be your  own!Note: Your car must be equipped with an auxiliary port (most  newer models are) and your device must come with a 3.5 mm headset jack.FeaturesReduces hum from your car's electrical systemProvides a direct connection to your car's AUX (auxiliary) port for   pure soundCable braiding for strength, durability and limited tangle4-ft long, 3.5mm audio cableLearn more about our other iPhone mounts and cradles in our Cross Reference Guide", "title": "Kensington Noise Reducing Car Audio AUX Cable for MP3 or SmartPhone, including iPhone 4S", "price": 16.06, "imUrl": "http://ecx.images-amazon.com/images/I/31MCrv4jHeL._SY300_.jpg", "brand": "Kensington", "related": {"also_bought": ["B001EAQTRI", "B00007FGUF", "B004Y9XB22", "B003N3G7PS", "B004C87WQ6", "B009NLTW60", "B003SX0O34", "B001AR4NC8", "B008SFSIXU", "B0007V5X4U", "B008736UWO", "B004HJ35F2", "B003J9MYMQ", "B000I963FE", "B004KPLS7K", "B00CIZ2238", "B0031U1ATG", "B0045JHJDS", "B001QBG614", "B004CLYJ2I", "B00DTVU5L6", "B00D82O68Y", "B000E9U9GC", "B0038MA11U", "B0016LE80K", "B00ANDHBNS", "B009OBCAW2", "B001OXZ1IS", "B008U1MOM8", "B003LPKETS", "B00511PS3C", "B0044DEDC0", "B009VDSQ5S", "B003CK70VC", "B005NLQAHS", "B008AGQMQC", "B008UHLFRC", "B0002UQAXY", "B00GJFGE3W", "B00IVPU7AO", "B00D901B4W", "B003NREDC8", "B00E1UWA4O", "B00GTGETFG", "B001TH7GUK", "B003EE12EC"], "bought_together": ["B001EAQTRI", "B009NLTW60"], "buy_after_viewing": ["B001EAQTRI", "B0031U1ATG", "B004LTEUDO", "B009NLTW60"]}}