{"asin": "B00004RA3E", "related": {"also_bought": ["B00004R9UN", "B00004R9UM", "B000A27OY8", "B0030GEXUO", "B006GZ22JU", "B000K2S9FQ", "B00HXCPC6K", "B004JMZH08", "B000NJO3TC", "B0012QLVRM", "B00004S1RY", "B00004SD6Y", "B000GIO0NY", "B000NIFC7K", "B00002N68C", "B00EOMCLXE", "B000BX4SOK", "B000EM2SSG", "B001JTS6UC", "B004EPXIA6", "B000087R4E", "B00004SD74", "B00I2F51SG", "B000BWY49A", "B00004XSF7", "B0030MIHAU", "B00004R9TL", "B00GO3MMJY", "B00002N66H", "B001JIO7PQ", "B0000BYDKO", "B004OSVF44", "B000NCWP44", "B000E28UQU", "B0000950Q2", "B00395I60E", "B00602J27E", "B00002ND64", "B004A82W0E", "B002SD8UOA", "B00028QF9U", "B0037AOVTQ", "B000WEOQV8", "B000IKK0OI", "B004INGS8S", "B00166TT3G"], "also_viewed": ["B00002N691", "B0045VL1OO", "B002ZVOLY8", "B004H4X6OM", "B006FALDOG", "B0007ZK5V2", "B004S6HR1M", "B00004R9UL", "B0013M2MBE", "B00004RA3F", "B00080OECC", "B00004R9UK", "B00C1WP5KK", "B0096SILMG", "B000NHTH0O", "B006FALDSW", "B007P523NA", "B001DZJYJO", "B003CJTWFA", "B001TAFUHS", "B003CJTWFK", "B000139Q56", "B00004R9UM", "B0072CTQWC", "B001SARMI4", "B0072CTQVS", "B000RGZA8Y", "B002VED4JC", "B0076SOGW2", "B00004R9UN", "B00008IHSK", "B0001YGT7S", "B002ZVOLXE", "B0072CTQYU", "B00DH57BSE", "B0095I73PS", "B00JKBZFQY", "B0052WIRMO", "B000N9AV5M", "B003CJTWFU", "B00095L49C", "B00005AKZE", "B003ADIUCO", "B0078KWAL2", "B0046RD62C", "B002VED4K6", "B00IWKBJNW", "B0029TLUOA"], "bought_together": ["B00004R9UM", "B00004R9UN"]}, "title": "Scotts 2000-20 20-Inch Classic Push Reel Lawn Mower", "price": 135.0, "salesRank": {"Patio, Lawn & Garden": 917}, "imUrl": "http://ecx.images-amazon.com/images/I/41YQ80T1RVL._SX300_.jpg", "brand": "Scotts", "categories": [["Patio, Lawn & Garden", "Lawn Mowers & Outdoor Power Tools", "Lawn Mowers & Tractors", "Walk-Behind Lawn Mowers"]], "description": "Light, maneuverable, economical. The Scotts 2000-20 Classic Push Reel Lawnmower handles thick turf with ease and provides a quiet, pollution-free solution for any lawn. The mower's dual tracking wheels and ultra-sharp steel blades ensure easy, accurate cutting and efficient operation. Powered by you, the mower has a wide cutting path and quick-snap height adjusters that ensure effortless operation and keep you in complete control of your grass height..caption {font-family: Verdana, Helvetica neue, Arial, serif;font-size: 10px;font-weight: bold;font-style: italic;}ul.indent {list-style: inside disc;text-indent: 20px;}img.withlink {border:1px black solid;}a.nodecoration {text-decoration: none}A wide cutting path, quick adjustment, and dual tracking wheels make mowing easy.View larger.and Easy to AssembleWith the Scotts 2000-20 Classic Push Reel Lawnmower, you not only save yourself the expense of purchasing gasoline, but you also decrease your carbon footprint by eliminating the pollution created by a gas mower. Powered by you, this mower has no complicated engine components to deal with and assembles with no tools required, so you can be ready to cut the grass within minutes of receiving your new lawnmower.Wider Cutting Width Reduces Time and EffortThe Scotts 2000-20 Classic Push Reel Lawnmower features a wider-than-average 20-inch cutting width that reduces time and effort on your part. A wide 20-inch cutting path will reduce the number of passes required to cut your lawn, so you will get the job done more quickly and more efficiently.Quick-Snap Height Adjusters Mean Easy Custom ControlGet complete control over the height of your lawn. The easy-to-use quick-snap height adjusters provide fingertip control over your blade height for precision cuts. Adjustable from one to three inches, they easily fit into nine different height slots and stay securely locked in place thanks to quick-snap technology.Precision Blade Technology and Ball Bearing ReelThe five-spider, five-blade reel features five heat-treated steel blades for accurate cuts every time. Designed with smooth ball bearings, the blades spin efficiently as you push the mower. Each blade slices through grass with extreme precision, leaving behind fine mulch, which is essential for a healthy lawn. The five-blade cutting action is designed to provide precision performance over the life of the mower, and its tough, heavy-duty steel design is built to last.Dual Wheel Tracking for ManeuverabilityThe Scotts Classic Push Reel Lawnmower features two 10-inch composite wheels with radial tires plus two six-inch tracking wheels for added maneuverability. This innovative dual wheel tracking technology eliminates drag and makes it easier to push the Scotts 2000-20 mower over even the toughest terrain. The loop-style handle with foam grip provides added comfort during operation and also enhances the mower's maneuverability.The Scotts 2000-20 20-Inch Classic Push Reel Lawnmower weighs approximately 34 pounds (shipping weight) and is backed by a two-year warranty.What's in the BoxScotts 2000-20 Classic Push Reel Lawnmower, handle, and composite wheels."}