{"asin": "B001H9NR2Q", "description": "TomTOm ONE 125Maufacturer's Description--October 12, 2008Just like the ONE 130, the TomTom ONE 125 has a nifty fold-out mount right into the device. No more trying to figure out where to stash that big, clunky mount in your car -- just pop it off, fold it up and carry the whole thing in your pocket. Of course, the ONE 125 also features the plug and play ease of use, rock-solid navigation, and sleek designs we've come to expect from TomTom.Key Features and BenefitsEasy to Useright out of the box (Learn more)Clear Directionsfrom the sensitive touchscreen display with turn by turn spoken directionsLatest Map Guaranteemeans if a new map is released within 30 days of purchase, you can download it for free from TomTom HOME (Learn more)TomTom Map Sharelets you instantly modify street names, street direction and POIs on your own device and benefit from others' corrections (Learn more)\"Help Me!\" Emergency Menugives one-touch access to local emergency providers such as police, fire stations and hospitalsPreloaded Complete Mapsof the US with TeleAtlas dataEasyPort mountis foldable and slim for easy portabilityPOI iconseasily find gas stations, restaurants, hotelsand more along your route. Customize by adding yourown points of interestTomTom HOMEfree software is a landing page for your TomTom on your computer that ensures that your TomTom is alwaysup-to-date and access additional featuresQuickGPSfixspeeds up the time it takes to fix your GPS position to help you drive off more quickly.Traffic-Capablewith optional RDS-TMC traffic receiver accessorykeeps you up-to-date on traffic events to minimizepotential delaysDaily Fuel Prices, available as an optional service, finds the lowest pricedgas on your routeLearn MoreEasy To UseClear and easy screen interfaceInstant route re-calculation if you deviate from the planned route.Buy a TomTom device and it works straight out of the box: Just plug it in and a few taps of the touchscreen later, you're on your way with clear, turn by turn spoken directions complementing. TomTom's easy-to-use interface has been extensively tested by by independent assessors in the field and at TomTom&rsquo;s unique User Experience LabsPreloaded MapsComes preinstalled with complete maps of the United StatesHelp When You Need ItExtensive safety features including &lsquo;Help Me&rsquo; menu for, to give drivers direct access to emergency services and roadside assistance.Icon-driven menu systemEmergency menu gives you fast direct access to emergency numbers and direction to the nearest assistanceNew--SmallMount, Big Speaker.The integrated EasyPort Mount means you never have to figure out where to stow a mount in your car, and you never leave a sign for potential thieves that there might be a tempting electronic prize under your seat. The entire unit, mount and all, is small enough to fit into a shirt pocket, so just fold it up and go!It comes with mounting discs for both windshield and dashboard.A large speaker gives you the best audio quality, eliminating distortions so you hear your instructions loud &amp; clear.TomTom MapShare -- Maps Served Fresh DailyWith TomTom Map Share you can update your map directly on your device as and when you spot road changes, and download daily updates from millions of Map Share users worldwide via your computer.Enabling Map Share gives you:instantly improved maps every day on your TomTom deviceentry into the world&rsquo;s largest navigation communitythe ability to share improvements daily with other TomTom usersfull control over improvements that are uploaded and downloadedthe best and most accurate maps available &ndash; always.Map Share changes you can make instantly:Block / unblock streetReverse traffic directionEdit street nameAdd missing Points of InterestEdit Points of Interest.Report other errorWhen joining the Map Share community you can select various 'levels of trust'.You might decide to only receive improvements that have been verified by TomTom or changes that have been submitted by tructed sources, by many , or by some people.Map GuaranteeDue to Amazon's high volume of sales and frequency of inventory turnover, just about every portable GPS navigator sold by Amazon.com will come with the most recent map version.TomTom however, goes one better. Because TomTom regularly releases new maps, there's always a small chance that a newer map has been released since the production of your TomTom. With TomTom&rsquo;s latest map guarantee, if the map preloaded on your device is not the latest version, you can download it FREE at TomTom HOME. Thisno longer requires the map check code.Checking in TomTom HOME is easy:Make sure you have the latest version of TomTom HOME installed on your computerConnect your device to your computerIn the 'File' menu click 'Use Latest Map Guarantee'.NOTE: if this option is not shown your device has the latest map.You can check as many times as you like within30 daysfrom the date you first use your TomTom device.New--Send Addresses Directly from Google Maps or MapquestSearch for the location you want.Pick \"Send to GPS\".Itching to try out a new restaurant, or setting off on a road trip to locate the best donuts on the west coast? Now, it's easy to search for locations on Google Maps or Mapquest, then transfer the addresses directly to your TomTom.Install TomTom HOME on your computerHook up your TomTom to the computer via its USB portSearch for the location you want. Click theClick theSendlink in the info window for the address. That will bring up a popup \"Send to\" form.Pick GPS, then pick TomTom and hit the \"Send\" button.&nbsp;The address will instantly transfer to your TomTom device, The point will be saved as one of your favorites, and you can navigate to it or view it on a map just like with any other favorite.TomTom HOMEHOME is TomTom's free software program that gives you access to a huge array of services as well as the global community of TomTom users. It is the only tool you need to manage, update and personalize your TomTom to enjoy a premium navigation experience: buy and install maps, make back-ups, download free software updates, shop and much more.Stay up-to-date&ndash; always get the latest TomTom software and updates.Personalize&ndash; Add new points of Interest, routes, voices, colour schemes and more.Enhance&ndash; buy maps, subscribe to traffic and safety camera information services (optional).QuickGPSfixStarting up can seem like a slow business, particularly if you&rsquo;re in a hurry, because the GPS receiver needs to know exactly where each GPS satellite is to calculate your location. But satellites only broadcast their positions once every 30 seconds. So if any of their signals are interrupted, for example by passing high buildings, the whole position-fixing process has to repeat itself again and again until the perfect fix is achieved.&nbsp; QuickGPSfix takes a smarter approach.QuickGPSfix can speed up the time it takes to fix your GPS position by downloading the latest satellite data via an Internet connection. Just connect your TomTom device to your computer and TomTom HOME automatically downloads &lsquo;QuickGPSfix&rsquo; &ndash; a special GPS data file that helps your TomTom fix your position quicker, even when the GPS signal is weak or partially blocked.This unique free service helps you fix your position and get navigating faster than ever.On the road or no access to TomTom HOME?Get the same &lsquo;QuickGPSfix&rsquo; data by simply connecting to any TomTom PLUS service, using a wireless data connection. As soon as a connection is established, the &lsquo;QuickGPSfix&rsquo; data is automatically updated.Note:QuickGPSfix data has limited validity. So to keep on getting a faster position-fix, re-connect your device at least once a week.To minimise the amount of data sent over your wireless data connection, this automatic update is only carried out if the data on your device is over 5 days old. The associated data usage of this service is less than 10 Kb per connection. Please contact your mobile service provider to determine the exact costs. To disable this automatic update, just select &lsquo;Disable Auto QuickGPSfix&rsquo; on your TomTom device.Fun Extras to Personalize Your TomTomNew smart &amp; fun extras to personalize users&rsquo; devicesRecording driving instructions in your own voiceBuy fun voices from TomTomSelect a favorite car icon on the screenLoad, store and preview photos from your digital camera.Enjoy music with the built-in MP3 player (earphones connector available via an optional SD card)TomTom TrafficWith an RDS-TMC Traffic Receiver accessory, you can get traffic information from the RDS-TMC Traffic service, which is delivered over unused FM radio channels.Traffic information is fully integrated into the TomTom navigation experience.&nbsp;The RDS-TMC receiver accessory comes with a 1-year free subscription to the TMC traffic serviceWith some TomTom models, an RDS-TMC Traffic Receiver is included in the box. This is indicated by the addition of \"T\" or \"Traffic\" to the model name. An example is \"ONE Traffic\"..Key featuresReal-time traffic information across the US, using the most accurate and up-to-date sources.Detailed incident reports, delay times estimated, alternative routes proposed and if enabled automatic rerouting.Accurate real-time warnings about dangerous road conditions ahead (fog, snow, ice and so on) anywhere in Europe, Australia and the US. (TomTom application version 6.0 or higher)Clear on-screen animated or spoken traffic alerts as and when you want them.Smart push technology which minimizes the amount of data needed to update traffic information on your deviceSmart subscription &ndash; when you buy new maps, the Traffic service automatically becomes available in those countries too.Supported LanguagesThe user interface/application comes in the following languages:CatalanLatvianCzechLithuanianDanishNorwegianDutchPolishEstonianPortugueseFinnishSlovakianFlemishSpanishFrenchSwedishGermanTurkishHungarianUK EnglishItalianUS EnglishSpoken navigation instructions come in the following languages:AustralianJapaneseBrazilian PortugueseLatin American SpanishBulgarianLatvianCatalanLithuanianChinese MandarinMalaysianChinese CantoneseNorwegianCroatianPolishCzechPortugueseDanishRomanianDutchRussianEstonianSerbianFinnishSlovenianFlemishSpanishFrenchSwedishGermanThaiGreekTurkishHungarianUK EnglishItalianUS EnglishAbout TomTomTomTom NV is the world&rsquo;s largest navigation solution provider, developing products with an emphasis on innovation, quality, ease of use and value. TomTom's products include all-in-one navigation devices which enable customers to navigate right out of the box; including the award-winning TomTom GO family, the TomTom ONE range and the TomTom RIDER (for motorcycles). TomTom also provides navigation software products which integrate with third party devices; the TomTom NAVIGATOR software for PDA&rsquo;s and smartphones. TomTom WORK combines industry leading communication and smart navigation technology with leading edge tracking and tracing expertise. TomTom&rsquo;s products are sold through a network of leading retailers in 25 countries and online. TomTom was founded in 1991 in Amsterdam and has offices in Europe, North America and Asia Pacific.", "title": "TomTom ONE 125 3.5-Inch Portable GPS Navigator", "price": 89.9, "imUrl": "http://ecx.images-amazon.com/images/I/51mrIBNFe7L._SX300_.jpg", "related": {"also_viewed": ["B007M52QR6", "B0014GXCBI", "B000U9WVW6", "B004W1GQ92", "B001H9O72K", "B000H866BM", "B002OL2NT4", "B001VEJEGK", "B001LK6XHM", "B001VEJEG0", "B000PCBVA6", "B003EG0200", "B007M52EXM", "B000A5T7AO", "B001U0O7QC", "B004MYFTEW", "B002Z3KRHG", "B007M52QEE", "B004J4VYG2", "B00E0CEDFW", "B007M4Z7GO", "B001U0O7QW", "B00BHSTWOY", "B0007LJHVA", "B003FSTAFK", "B00AJXMWP4", "B003B3P2CY", "B004MYFTFG", "B00HVUEGVQ", "B0037BVSCI", "B004J4VYGM", "B004MYFTE2", "B0057ODOCA", "B0057OCDQS", "B0057ODG6Y", "B003B3P2CO", "B004MYFTF6", "B00AXZY42W", "B004MYFTFQ", "B00BHADL3U", "B00A7LULA6", "B003CYKYUC", "B003FSTAGY", "B00HPPWOEI", "B0015F1L7A", "B003ZX8B0U", "B00AXZWG8Q", "B003DQVW00"], "bought_together": ["B0037BVSCI"], "buy_after_viewing": ["B007M52QR6", "B0057OCDQS", "B00AXZWG8Q", "B0014GXCBI"]}, "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]]}