{"asin": "B00002STH5", "description": "It's taken a while to get here, but Nintendo's 64-bit update to the old SNES classic, F-Zero, is here. F-Zero X is a stunning achievement in that it's truly the first racing game that runs at a brisk 60 frames per second, even in multiplayer. In fact, more than anything else, it is this feature that is F-Zero X's claim to fame. Does the rest of the game stack up? Well, it depends on what you're looking for.Instead of trying to compare it to its 16-bit counterpart, we'll dissect F-Zero X purely on its own merits. After all, the bar has been raised for racing games in general over the past few years. So what does the game have to offer? Well, first of all, forget any kind of simulation aspects. This is twitch gaming at its best. Although you can tinker with the basics, like acceleration and speed, that's about all you get to do. Everything else is just about driving. Playing like a Wipeout without weapons (which was like playing F-Zero with weapons), F-Zero X's only added enhancements are the inclusion of dash plates located at various points around the track. When you run over one of these plates, you get a severe speed boost that doesn't cost you any energy (after the second lap, you get boost power that you can use at any time, but it takes away some of your energy), enabling you to blast past some of your opponents. However, they too can use these plates.That's not to say that you can't dispose of your opponents though. By using the Z-button or the right shoulder button you can either crash into your opponent making his energy meter drop, causing him to explode if his meter is low enough. Or, you can try to shove him off the track if there is no barrier keeping you in. A number of play modes are available, including practice, death race, time attack, and vs. battle. However, the majority of the racing will be done in the grand prix mode, where the cup levels await. Each cup increases in difficulty, naturally, but with each additional level conquered, more and more racers are made available to you, adding replay incentive. If you make it to the final secret cup, you'll uncover a random track generator that offers you a fresh challenge every time.So what's the problem with F-Zero X? For starters, with up to 30 different racers onscreen at any given point, some sacrifices had to be made in order to keep the insane frame rate so high. Polygon counts on the vehicles are very low, giving them a particularly uninspiring look. The track detail is also very limited, giving the track a spartan feel to it. In its defense, the tracks are cleverly designed, especially the twisty corkscrew tracks that speed by at a blazing pace. One feature that's lacking is a first-person view. If speed was truly supposed to be on display here, a cockpit view would definitely have helped, but alas, there is none to be found. Control is pretty good, although the analog stick can be kind of touchy in places, leading to a few inadvertent fender benders. The sound effects are very good and actually add to the feeling of speed in the game. Unfortunately, the music can be pretty annoying in a cheesy synthesized-metal kind of way and doesn't really add much to the whole experience.As a game, F-Zero X is certainly thorough in its execution; unfortunately, there just seems to be very little in the game to keep you coming back. Sure, Nintendo incorporated all those funky characters to give it... um... character, but the game erases all that good stuff with its overwhelming blandness. Yes, the game can be fun in multiplayer, being supersonic and all that, but the game just lacks those certain intangibles that make a good game great. Practically flawless from a technical standpoint, the biggest thing missing from F-Zero X is that it lacks a soul. It's yet another stunning update to the legendary Nintendo catalog, but it's games like this that make you wonder: Where's Metroid 64 or Donkey Kong 64? Back to the drawing board it seems. --James Mielke--Copyright &copy;1999 GameSpot Inc. All rights reserved. Reproduction  in whole or in part in any form or medium without express written permission of GameSpot is prohibited. GameSpot and the GameSpot logo are trademarks of GameSpot Inc.--GameSpot Review", "price": 319.98, "imUrl": "http://ecx.images-amazon.com/images/I/51aIIe7OfAL._SX300_.jpg", "related": {"also_bought": ["B00000ID61", "B00002STH0", "B00000DMAO", "B00002STI2", "B00002SVFQ", "B00000J2OO", "B00000J2W7", "B00004R9IB", "B00002STFH", "B00000F1GM", "B00002STEZ", "B00000DMAQ", "B00000DMAX", "B00001QES1", "B0015OG4G4", "B00004U1QY", "B00002DHEV", "B00000K1AF", "B00000INR2", "B00004U1R3", "B00004S9AA", "B0009Y808Q", "B000PJHAD6", "B000046Q7Q", "B000021Y2Z", "B000JVM256", "B00005M8TL", "B005DI7N7W", "B00004WLMA", "B00000I1BE", "B00000IFRI", "B00002SVFV", "B005GTNBGK", "B009MRZAUC", "B005GTND0E", "B000031KJM", "B00004U1QX", "B00004S9A7", "B000Y0CHX4", "B00002STGE", "B005GTNC8W", "B00001OX4T", "B00005AQRH", "B00003OTI3", "B00000ID60", "B00005ME6D", "B000050FAE", "B00004SWLT", "B00005AW1W", "B00004U4QP", "B000058BCU", "B002TK1PX0", "B000H29ZPM", "B000046S41", "B00AAIDNTW", "B00002STXN", "B00L3LQ1FI", "B00000K1XU", "B00002970G", "B00002STF6", "B00004U1R1", "B0000206H5", "B00000K39K", "B000YOCGUO", "B00000DMB9"], "bought_together": ["B00002STH0"], "buy_after_viewing": ["B00002SVFQ", "B002TK1PX0", "B00000DMAO", "B00000J2OO"]}, "salesRank": {"Video Games": 3857}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "More Systems", "Nintendo 64", "Games"]]}