{"asin": "B007Z92SS6", "description": "Perfect portability, perfect usability: The Aspire&reg; One AO725 Netbook is less than 1\" slim and under 3 lbs., yet this thin &amp; light PC has dual-core AMD accelerated processing and the power of Genuine Windows&reg; 7 Home Premium.  A 11.6\" HD display, full-size keyboard and superb connectivity provide ease of use to go with its stunning Volcano Black chassis and CineCrystal&trade; HD widescreen display, backed by ATI Radeon&trade; graphics.  Up to 5.5 hours of battery life keep you connected and enjoying your media on the go.  Travel light yet get full performance from the great-looking Acer Aspire&reg; One AO725 Netbook.Key Features11.6\" HD Widescreen CineCrystal&trade; LED-backlit DisplayAMD Dual-Core C-60 Accelerated Processor 1.0GHzwith TurboCORE Technology up to 1.33GHzGenuine Windows&reg; 7 Home Premium320GB Hard Drive2GB DDR3 MemoryATI Radeon&trade; HD 6290 Graphicswith 256MB of dedicated system memory802.11b/g/n Wi-Fi CERTIFIED&trade;Built-in 0.3 Megapixel HD WebcamTwo built-in stereo speakers2- USB 2.0 Ports1- USB 3.0 Port1- HDMI&trade; PortFull-size Acer FineTip KeyboardMulti-Gesture Touchpad4-cell Li-ion Battery2.65 lbs.| 1.2 kg(system unit only)Learn MoreDual-Core Performance &amp; Sensational HD ExperiencesThe Aspire One is compact yet powerful with Genuine Windows&reg; 7 Home Premium and the AMD Dual-Core Processor C-60 with HD Internet Technology combine to enrich what you see, share and create, making your digital life all the more vibrant.  Enjoy fast web browsing, online HD entertainment and experience smooth and vivid video playback&mdash;all with responsive and energy-efficient performance.The AO725 delivers great HD experiences thanks to ATI Radeon&trade; HD 6290 graphics with 256MB of dedicated memory. Plus, the 16:9 aspect ratio of the 11.6&rdquo; HD widescreen CineCrystal&trade; LED-backlit display makes everything onscreen look truly cinematic.HDMI&trade; output lets you use a single cable to bring HD content and high-quality audio from your netbook to a large display or big-screen HDTV.  Share your favorite HD entertainment with family and friends.Not only can you see everything better on the Acer Aspire AO725; you can see everyone. Enjoy face-to-face conversations with family and friends in high-definition video chats with the integrated HD Webcam and digital Microphone.Stylish Mobile DesignThe new look of the Acer&reg; Aspire One AO725 is sure to turn heads with its glossy Volcano Black cover, comfortable feel and sensational visual appeal. Yet there's real power inside!Less than 1\" slim and under 3 lbs., this thin &amp; light netbook is easy to carry while you're on the go.  Its 4-cell battery fits flush into the chassis, further streamlining the netbook's look and providing up to 5.5 hours of cord-free battery life on a single charge!Though compact, our Aspire One AO725 provides more-than-netbook comfort for easy use while mobile. The 100% standard-size keyboard has bigger keys for more accurate typing, and the Multigesture Touchpad puts scrolling, rotating images, zooming and browsing at your fingertips.Everywhere Connectivity &amp; Great ProductivityNew USB 3.0 is fast: You can transfer a 250GB movie in a mere 70 seconds. That's because USB 3.0 works up to 10 times faster than older USB 2.0&mdash;and, with USB 3.0, you can charge your USB devices when your laptop is asleep, hibernating or even off!With both 802.11b/g/n wireless and 10/100 Fast Ethernet LAN connectivity available, it's simple and quick to jump on the Internet and access email, browse the web, connect to your social networks and more! Wherever you are, your world is there with you.Evernote makes it easy to remember things big and small from your everyday life using your computer, phone, tablet and the web.Genuine Windows&reg; 7 Home Premium makes the things you do every day easier. With Office Starter 2010, you can experience new ways to deliver your best work! Buy Microsoft&reg; Office 2010 to activate a full-featured Office suite preloaded on this PC.", "title": "Acer Aspire One AO725-0899 11.6&quot; Netbook (AMD Dual Core Processor, 2GB RAM, 320GB Hard Drive, Windows 7 HP 64 bits) Volcano Black", "price": 349.0, "imUrl": "http://ecx.images-amazon.com/images/I/41c5TqQ9FgL._SX300_.jpg", "related": {"also_bought": ["B001KB21KA", "B004NY9UV4", "B002I01TT6", "B003WCAX5A", "B002NOFMCC", "B003WCAX28", "B002T45WXU", "B003WCEKCM", "B005T63BEM", "B007Y91RAC", "B003PNFIKG", "B006ITMC7Q", "B005J2E2US", "B008FERIQC", "B002YU83YO", "B002TO40MO", "B002RAD5KI", "B001UDVUNW", "B005KQ0S8S", "B001N89NCO", "B00553IPD6", "B002XN3OL4", "B006EWUP4Y", "B008D9HZ62", "B009EVZ8TY", "B003LA15Q4"], "buy_after_viewing": ["B00CU2K6MS", "B00AAIC5S2", "B00FNPD1VW", "B0092IBD8Y"]}, "categories": [["Electronics", "Computers & Accessories"]]}