{"asin": "B001U0OFKU", "description": "An innovative, tiny desktop that's a great choice for home computing tasks and creating a digital media hub, Apple's Mac mini fits everything that makes a Mac a Mac inside an elegant 2-inch-tall, 6.5-inch square. Just add your own keyboard, mouse, and display. It's been upgraded with a faster 2.0 GHz Intel Core 2 Duo processor as well as a boost in video processing power from the NVIDIA GeForce 9400M integrated graphics chip. The Mac mini also now includes a FireWire 800 port as well as dual video outputs--a Mini DisplayPort and a Mini-DVI port.With a more powerful system architecture, Mac mini is faster than ever.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Continuing Apple's commitment to the environment, the Mac mini exceeds current Energy Star 4.0 requirements by consuming less than 13 watts when idle 45 percent less power than the previous generation. It's also made from highly recyclable aluminum, uses PVC-free internal components and cables, contains no brominated flame retardants, and even features smaller packaging.Inside its 2-inch-tall, 6.5-inch-square anodized aluminum enclosure, the Mac mini houses the fast Intel Core 2 Duo processor.This model of the Mac mini also includes a 120 GB hard drive, 1 GB of RAM (4 GB max), a slot-loading 8x SuperDrive with double-layer support, Draft-N Wi-Fi networking (802.11b/g/n), Gigabit wired networking, Bluetooth 2.1 + EDR connectivity, and optical digital audio input/outputs. It comes pre-loaded with Apple's Mac OS X 10.6 Snow Leopard operating system--an operating system custom-designed for the advanced technology inside--and it also comes with the iLife '09 suite of applications, including iPhoto, iMovie, Garageband, and iTunes.Intel Core 2 Duo ProcessorExperience improved energy efficiency and improved multitasking with the 2.0 GHz Intel Core 2 Duo processor, which also offers an ultra-fast 1066 MHz front-side bus (FSB) and a large 3 MB L2 cache. (An L2, or secondary, cache temporarily stores data; and a larger L2 cache can help speed up your system's performance. The FSB carries data between the CPU and RAM, and a faster front-side bus will deliver better overall performance.)The new hafnium-infused circuitry--which reduces electrical current leakage in transistors--conserves even more energy, giving you more time away from the wall outlet. With a substantial 3 MB of shared L2 cache, data and instructions can be kept close to the two processor cores, greatly increasing performance and allowing the entire system to work more efficiently. And, because the processor cores share the L2 cache, either can use the entire amount if the other happens to be idle.Hard Drive and MemoryThe 120 GB Serial-ATA (SATA) hard drive (5400 RPM) quickens the pace with a higher speed transfer of data--akin to FireWire and USB 2.0. The 1 GB of DDR3 RAM (two SO-DIMMs of 512 MB) have an industry leading 1066 MHz speed, and the RAM capacity can be increased to 4 GB.Wireless ConnectivityThe built-in 802.11n wireless networking provides up to five times the performance and twice the range of 802.11g, but it's also backward-compatible with 802.11a/b/g routers, enabling you to communicate with the a wide variety of Wi-Fi resources. It works seamlessly with the new AirPort Extreme with 802.11n. Use the built-in Bluetooth wireless technology to connect to your PDA or cell phone, synchronize addresses, or download pictures from your cell phone. You can also use a wireless headset for iChat audio chats and VoIP calls as well as quickly share files with a colleague.Graphics ProcessorThe Mac mini now features the NVIDIA GeForce 9400M integrated graphics processor for up to five times better graphics performance than its predecessor, and its dual display support can drive two Apple or third-party displays with Mini DisplayPort or DVI connections. The NVIDIA GeForce 9400M shares 128 MB of DDR3 SDRAM with main memory. You'll notice the difference when you work with high-resolution photos and high-definition video, where graphics-intensive features in iPhoto and iMovie are smoother. And 3D game play--from Spore to Call of Duty--is faster and more responsive.Other FeaturesFive USB 2.0 ports (up to 480 Mbps)One FireWire 800 port (up to 800 Mbps)10/100/1000BASE-T Gigabit Ethernet (RJ-45 connector)Video output: Mini DisplayPort and Mini-DVI (adapters for DVI and VGA output included)Extended desktop and video mirroring: Simultaneously supports up to 1920 by 1200 pixels on a DVI or VGA display; up to 2560 by 1600 pixels on a dual-link DVI display using Mini DisplayPort to Dual-Link DVI Adapter (sold separately)AirPort Extreme Wi-Fi wireless  networking (based on 802.11n draft specification); IEEE 802.11a/b/g compatibleBluetooth 2.1 + EDR (Enhanced Data Rate)Combined optical digital audio input/audio line in (minijack)Combined optical digital audio output/headphone out (minijack)Built-in speakerSlot-loading SuperDrive with double-layer support (DVD&plusmn;R DL/DVD&plusmn;RW/CD-RW): Writes DVD+R DL and DVD-R DL discs at up to 6x speed, writes DVD-R and DVD+R discs at up to 8x speed, writes DVD-RW discs at up to 6x speed, writes DVD+RW discs at up to 8x speed, Slot-load optical drive reads DVDs at up to 8x speed, writes CD-R and CD-RW discs at up to 24x speed, reads CDs at up to 24x speedKensington cable lock slotDimensions: 6.5 x 6.5 x 2 inches (WxDxH)Weight: 2.9 poundsThe Greenest Mac mini YetThe energy-efficient hardware components in the new Mac mini work hand in hand with Mac OS X to create a system that can dynamically adjust power consumption to reduce the energy used overall. The new Mac mini uses an advanced power management system leveraged from technology that makes the most of battery life in Apple's MacBook family. This allows Mac mini to use dramatically less electricity--up to 45 percent less power at idle than its predecessor. And it makes Mac mini the most energy-efficient desktop computer (based on energy efficiency categories and products listed within the EPA ENERGY STAR 4.0 database as of February 2009).Apple has worked hard to eliminate many of the toxins that are a common part of computer manufacturing. Apple engineers removed brominated flame retardants (BFRs) and polyvinyl chloride (PVC) from circuit boards, internal cables, connectors, insulators, adhesives, and more in Mac mini. And the Mac mini uses a combination of highly recyclable aluminum and polycarbonate to create its incredibly compact enclosure--making it one of the most material-efficient desktop computers available.The Mac mini meets the stringent low power requirements set by the EPA, giving it ENERGY STAR certification. In addition, Mac mini meets the latest efficiency requirements of ENERGY STAR Version 5.0 Specification for Computers before its July 2009 effective date. It has also earned the highest rating of EPEAT Gold. The Electronic Product Environmental Assessment Tool, or EPEAT, evaluates the environmental impact of a product based on how recyclable it is, how much energy it uses, and how it's designed and manufactured.Pre-Loaded with Mac OS X Snow Leopard and iLife '09Every Mac comes with Mac OS X Snow Leopard, the world's most advanced operating system, and iLife, Apple's innovative suite of applications for managing photos, making movies and creating and learning to play music. Snow Leopard builds on a decade of OS X innovation and success with hundreds of refinements, new core technologies and out of the box support for Microsoft Exchange. iLife features iPhoto, to easily organize and manage photos; iMovie with powerful easy-to-use new features such as Precision Editor, video stabilization and advanced drag and drop; and GarageBand which introduces a whole new way to help you learn to play piano and guitar.Installed softwareMac OS X v10.6 Snow Leopard (includes Time Machine, Quick Look, Spaces, Spotlight, Dashboard, Mail, iChat, Safari, Address Book, QuickTime, iCal, DVD Player, Photo Booth, Front Row, Xcode Developer Tools)iLife '09 (includes iPhoto, iMovie, GarageBand, iWeb, iDVD)What's in the BoxMac mini, Mini-DVI to DVI adapter, power adapter and cord, install/restore DVDs, printed and electronic documentation", "title": "Apple Mac mini MB463LL/A Desktop", "price": 594.0, "imUrl": "http://ecx.images-amazon.com/images/I/31WxSCMAJoL._SX300_.jpg", "related": {"also_bought": ["B002ACM5MM", "B001OY3TJ0", "B00011KHTM", "B002HU39BS", "B0013FK9U2", "B005DLDO4U", "B003OC6LWM", "B005DLDTAE", "B008FMBLVM"], "buy_after_viewing": ["B007476KRY", "B008LTBJFW", "B005DLDO4U", "B00DBV28TG"]}, "categories": [["Electronics", "Computers & Accessories", "Desktops"]]}