{"asin": "B0011FCV8W", "description": "From the ManufacturerOverview:Ergonomic Comfort in a Wireless, Rechargeable MouseStep up to the Microsoft&reg; Wireless Laser Mouse 7000. This advanced right-handed rechargeable mouse brings you 2.4 GHz wireless technology, High Definition Laser, and dynamic productivity features&mdash;wrapped in a striking design.Features:&nbsp;&nbsp;&nbsp;RechargeableStatus indicator flashes when the mouse needs charging. Just drop it onto the horizontal charging station to activate charging.&nbsp;2.4 GHz Wireless FreedomConfident wireless connection with up to 30-foot range, even in crowded wireless environments.&nbsp;High Definition Laser TechnologyMore responsive at 1000dpi, more precise at 6000 FPS and 85 MOPS, and smoother tracking.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Flip 3D ButtonDisplays dynamic 3D overlay of all open applications.&nbsp;MagnifierJust point and press the Magnifier button to enlarge and edit details.&nbsp;4-Way ScrollingScroll side to side as well as up and down..&nbsp;Additional Features:Ergonomic Design -Point and click in comfort&mdash;ergonomic design helps you work longer without discomfort.5-Button Mouse- Get quick access to the media, programs, and files you use most often with customizable buttons.&nbsp;&nbsp;System Requirements:Windows Vista&reg;/Windows XP/2000 (with SP4 or higher)100 MBMac OS X v10.2.x-10.5x30 MBPowered USB portCD drive1 rechargeable AAA NiMH battery (included)&nbsp;&nbsp;", "title": "Microsoft Wireless  Rechargeable Laser Mouse 7000 Mac/Windows", "price": 67.99, "imUrl": "http://ecx.images-amazon.com/images/I/41grYAquQ-L._SY300_.jpg", "related": {"also_bought": ["B001B8EUEW", "B000Q6UZBM", "B000A6PPOK", "B0021ZG61E", "B001F7AP1Q", "B000RPVGJ2", "B004SUIM4E", "B00005NIMJ", "B002HWRJBM", "B000KA7PD0", "B000J43HJ8", "B008XB0JNG", "B004MF11MU", "B00006B9CR", "B0039O2SEA", "B002JCSCYS", "B00A1702Z0", "B001F42MKG", "B004JO16KG", "B003TG75EG", "B0017D5Z40", "B003VAHYNC", "B002DPUUL4", "B00000JRRD"], "buy_after_viewing": ["B002HWRJBM", "B003NR57BY", "B00D68ZVY8", "B002DPUUL4"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Mice"]]}