{"asin": "B001NEK2GE", "related": {"also_bought": ["B0086UK7IQ", "B00BFOEY3Y", "B00BCEK2M4", "B00IRHE892", "B0086UK7I6", "B00E4MQODC", "B00DY1HTU6", "B003VANOFY", "B00B1N07QM", "B00BCEK2LU", "B00IKMJA3S", "B001NXDBI6", "B00EOPT5ZS", "B00CJD4HD2", "B00009OY9U", "B0036WTBFY", "B002YERS32", "B00FNKMVUO", "B0071JXE0G", "B009C98NPY", "B000UEZ36W", "B0042Y2F76", "B00CQ35C1Q", "B005L38QHA", "B00BBUCCKO", "B001O5CCQK", "B00BFOEY4I", "B007CA5FX8", "B00D8T886S", "B000OZC98C", "B0043T7FXE", "B00IG3GSQ8", "B00HNF0KF0", "B00E8CF268", "B00B5QLS4A", "B009F7G0AI", "B00GU8W5AE", "B0041RR0TW", "B00KPRWAX8", "B000O77KKC", "B002UBPBTC", "B00BCEK2LK", "B008LT5MFA", "B00E3667XQ", "B004NNUEWY", "B005FKT70O", "B00IDG3IDO", "B006W3ZXEW", "B003WOL4VK", "B004G603E2", "B006I2H084", "B003VAHYQY", "B00DY1HTTM", "B00EHBKUTE", "B00E3W19MO", "B00AQMUE30", "B004XH55QK", "B00BCXF6MG", "B008EQYRRY", "B005DKZTMG", "B0017R5EQK", "B00K2MASE4", "B009WA2NKY", "B004AM5RAM", "B0095D1CM8", "B005O65JXI", "B00A0HZMGA", "B004L9KLT6", "B00ARD5410", "B00AEWTSWU", "B001NT9TK4", "B000LB7G00", "B004QRKWLA", "B001TH7GUU", "B00IEZGWI2", "B00AAS888S", "B00IKDETOC", "B009VV56TY", "B00CO8TBQ0", "B002OO18NS", "B005BZNDOO", "B00AFGQ3Q4", "B000OGX5AM", "B0033Z2BAQ", "B000FBK3QK", "B0092ML0OC", "B00E6GX4BG", "B009ZN03AA", "B00CPKUV9I", "B00I0D81OG", "B00HLUZXAY", "B00CAUTK0E", "B007ZLGXA8", "B00BWF5U0M", "B00J8E93G6", "B003ZUXXWO", "B00B2HH7G0", "B00E88ZGNG", "B0027VT6V4"], "bought_together": ["B0086UK7IQ", "B00IKMJA3S"], "buy_after_viewing": ["B00E4MQODC", "B00B1N07QM", "B0086UK7IQ", "B00GU8W5AE"]}, "title": "Logitech G13 Programmable Gameboard with LCD Display", "price": 66.36, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41Ld7oHhk8L._SY300_.jpg", "brand": "Logitech", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Input Devices", "Numeric Keypads"]], "description": "Game-Changing Comfort and ControlWhether you&rsquo;re rescuing hostages, on a quest with your guild, or saving humanity, you don&rsquo;t want to worry about hand fatigue or hitting the wrong key. Introducing the Logitech G13 advanced gameboard--a hybrid gaming keyboard designed to complement your Logitech gaming keyboard and mouse--giving you game-changing comfort and control on a Mac computer or a PC.&nbsp;Unlike other gameboards that focus only on programmability, the G13 advanced gameboard incorporates the principles of our award-winning Comfort Wave design. So whether you&rsquo;re getting into World of Warcraft or walking into your next LAN party, the G13 gameboard gives you a powerful advantage over those forced to work with less. Change your game and play with the best.Winner of CES 2009 Best of Innovations AwardKey FeaturesNaturally Contoured DesignDelivering increased comfort during long sessions, the iconic contoured design complements the natural shape of your hand and fingers, while the smooth, concave home-row keys make it easy to locate buttons by touch.Onboard MemoryA handy solution for the laptop gamer, the G13 gameboard includes onboard memory, letting you program up to five ready-to-play profiles and take them with you to your next LAN party. The G13 gameboard also offers pre-configured settings for many popular games, including World of Warcraft: Burning Crusade, Lord of the Rings Online: Shadows of Angmar, Call of Duty 4: Modern Warfare, and many others.Customizable BacklightingBacklit keys will help you easily locate the right key in low-light conditions or lights-out play. And you can select from hundreds of available backlight colors, so your gameboard looks just the way you want it.25 Programmable KeysWith three game modes, 25 programmable keys, and a programmable analog stick, the G13 gameboard offers up to 87 ways for you to control your game (software installation required). And you can set up custom button-profiles for each one of your favorite titles. You can even create macros on the fly without having to pause your game.High-Visibility GamePanel LCDAnd for another tactical advantage, the 160-by-43-pixel GamePanel LCD shows live game stats, system info, and even messages from other players.Suggested games for the Logitech G13 Advanced Gameboard:World of Warcraft: Wrath of the Lich KingWarhammer Online: Age of ReckoningAge of Conan: Hyborian AdventuresThe Lord of the Rings Online: Mines of MoriaLeft 4 DeadCall of Duty: World at WarCrysis WarheadFallout 3Brothers in Arms: Hell's HighwayCommand and Conquer: Red Alert 3Check out the G-SERIESfrom Logitech:Logitech G51 Surround Sound Speaker SystemBring your games to life with 360-degree surround sound--for amazing audio clarity that lets you hear your enemies sneaking up behind you.Logitech G25 Racing WheelWith simulator-grade force feedback, 900-degree of wheel rotation, and a true six-speed stick, this high-performance racing wheel lets you feel every inch of the road for maximum control.Logitech G15 Gaming KeyboardGet an edge over the competition with unprecedented communication and control, thanks to programmable G-keys and an integrated LCD that displays key game information.&nbsp;Logitech G11 Gaming KeyboardThe G11 Gaming Keyboard features 18 programmable G-keys that let you create useful macros on the fly--and then play them back with just one, time-saving keystroke.Logitech G9 Laser MouseWith interchangeable grips, customizable weights, and adjustable mouse settings that are stored in onboard memory, the G9 Laser Mouse lets you personalize your entire gaming experience.Logitech G7 Cordless Laser MouseFeaturing blazingly fast wireless technology and a high-resolution 2000 dpi laser engine for extreme precision, the G7 mouse gives you wireless freedom without sacrificing performance.What's in the BoxPackage ContentsLogitech G13 Advanced GameboardQuick-start guideSoftware CD1-year limited hardware warrantySystem RequirementsWindows XP and Windows VistaMac OS X 10.4 and later"}