{"asin": "B001EO6QR2", "description": "SP72 Smartparts 7-Inch Digital Picture FrameThe SP72 digital picture frame offers a classic design with its real wood framing.  The dark chocolate color of the wood mixed with the custom designed matting can compliment any room or office.7-Inch Display ScreenThe seven-inch screen shows-off your pictures with the same crisp quality that you receive from high-quality prints.  The full color display offers vibrant, bright colors that provide optimum contrast, allowing you to view your pictures in their natural state.  Your memories will be displayed exactly as they were when your pictures were taken.Three Easy StepsDisplaying pictures on the digital frame takes three easy steps.  Simply remove the memory card from your camera, insert the card into the frame and view your photos.  There is no need to upload and edit your pictures on a computer.SlideshowOnce the memory card is inserted into the frame, pictures are automatically displayed as a slideshow.  The speed of the slide show is automatic.  Photos will remain on the screen for about 5 to 20 seconds, depending on the size of the files.  Larger files will take longer to load.Viewing ModesPictures can easily be rotated by pressing the rotate button which allows photos to be turned to their correct position for proper viewing.  The mode button allows you to adjust how your pictures will be displayed on the screen.Normal view:pictures fit on the display screen without any stretching or cropping.  Photos that are smaller than the size of the screen will be displayed with black bars on the edges.Crop View:,pictures will be enlarged to fill the screen without stretching them.  For pictures that do not match the size of the screen, the top and bottom will not be visible.Picture FilesThis digital photo frame is compatible with JPEG files.  The JPEG format is in accordance with the camera industry standards and the frame is designed to display photos with the same industry standards.  Most digital cameras will save pictures in this format by default.  Pictures that are not in JPEG format, such as web, scanned or RAW images, cannot be displayed on the digital photo frame.  However, these images can be converted to the JPEG format for the digital photo frame using specific computer applications.Memory CardsSecure Digital - SDMultimedia Card - MMCxD cardMemory Stick MSOptiPix ProOptiPix Pro is designed to help you find, optimize and transfer pictures to your frame.  The software, residing on your computer, will guide you through 3 easy steps.  Optipix Pro will help you:View your vertical photos the right waySharpen your photosFind and transfer photos to your frameFit more pictures on your frameOptiPix Pro does not alter the originals but instead it will create copies that will be optimized and transferred to your frame.  You can store up to 2,000 pictures to your frame using OptiPix Pro.  The software&#x92;s installation file is preloaded on the frame.  You simply register your frame on Smartparts website and you can start using the OptiPix Pro software.More than a FrameUse your frame to get the message out.  With Smartparts exclusive OptiPix Pro software for Windows, it&#x92;s easy to convert and transfer PowerPoint slides, PDF files, and most picture and graphic files directly to your digital frame.Technical SpecificationsBrightness: 220 cd/m^2Contrast: 400:1Resolution: 480x234Vertical Viewing Angle: 45/55Horizontal Viewing Angle: 65/65What&#x92;s in the BoxDigital picture frame, removable picture stand and AC power adapter", "title": "Smartparts SP72 7-Inch Digital Picture Wood Frame with Beige Matting (Espresso)", "price": 47.04, "imUrl": "http://ecx.images-amazon.com/images/I/41cslnNoGUL._SX300_.jpg", "related": {"also_viewed": ["B003K0HISY", "B005GXFH5O", "B00906DNSG", "B008FC8FJ8", "B0078OVG0O", "B006P1QRFU", "B00442VXCO", "B00180KAX8", "B00FGHA3TK", "B00D8JX296", "B008MW6Y12", "B001T9N9JU", "B003307BYW", "B00874CAWW", "B0036MDUO2", "B00906DNHC", "B008FC8FPC", "B004QDRIMU", "B0058GAEAW", "B00368CDH6", "B00FWDXZIO", "B000KNP62Y", "B002FJQFIK", "B000UU2VJI", "B00AFJUZQU", "B00368CDGC", "B00HW54W28", "B00DSRD2K2", "B001FN14RE", "B004Y9HKH4", "B000R99INO", "B005P99KWU", "B008R3875C", "B00A25LF8E", "B00C1TOC34", "B0019GOQJA", "B001M5PZXO", "B00DYQZ4Z8", "B000VK7LBA", "B00EA209FA", "B001W82TK8", "B00AWUFCKG", "B00IA7R9YU", "B00GUBPBK2", "B009A13IB8", "B00CIVL8R8", "B000MRLMTE", "B0027VT6SM", "B0036MDUL0", "B007UU354G", "B004RO9L50", "B00GOFZ94W", "B002IT3242", "B001KZ1N96", "B003VTZE76", "B0036TGGS2"], "buy_after_viewing": ["B003K0HISY", "B007JRB0TC", "B005GXFH5O", "B000VUVA62"]}, "categories": [["Electronics", "Camera & Photo", "Lighting & Studio", "Photo Studio", "Storage & Presentation Materials", "Digital Picture Frames"]]}