{"asin": "B002ONSRA6", "categories": [["Electronics", "Television & Video", "DVD Players & Recorders"]], "description": "High definition in compact form. With a width of just 360mm, the DV-220V-K is a compact addition to any home entertainment system. Its advanced upscaling adds a new dimension to your DVDs by elevating sharpness, colour and contrast to create 1080p levels of detail. A 1.4x quick scan mode increases convenience in searching scenes or re-viewing disc sections. Fitted with a high-quality 108 MHz/12-bit digital to analogue converter, the DV-220V-K offers dynamic and extremely sensitive video. A front USB port will allow you to play back your music, videos and high resolution photos. You can even rip your favourite CDs directly to MP3 files on a USB memory device. The Sound Retriever will enhance your compressed music files to such a degree that the richness of the uncompressed original is approached.. Plays DVD-Video, SVCD, VCD, CD CD-R/-RW DVD-R/-RW (VR mode, CPRM) DVD-R/-RW, DVD+R/+RW, DVR-R DL (Video mode) DivX, MP3, WMA and JPEG . Terminals 1 x HDMI (1080p upscaling), 1 x USB (front), 1 x Coaxial out, 1 x Video out, 1 x Audio out, 1 x Component out. KURO LINK (+) Yes . Put simply, KURO LINK means that you are able to control basic functions of compatible Pioneer Audio/Visual devices* (such as your Blu-ray player, amplifier or DVD recorder), with your KURO flat-screen TV remote control.", "title": "PIONEER DV-220V-K 1080p HDMI UPSCALING REGION FREE DVD PLAYER w/ USB Input", "price": 89.95, "salesRank": {"Electronics": 33738}, "imUrl": "http://ecx.images-amazon.com/images/I/31WyAteZxlL._SY300_.jpg", "related": {"also_viewed": ["B002CO6GUK", "B004BI6MVS", "B00D0EP68Y", "B00BFEF9N8", "B00GSZ5ISK", "B0012KHNZW", "B0045PKK60", "B008PB8XN2", "B00FF9SVWA", "B0065907GC", "B00CYMJXYG", "B00264GMOG", "B000ART9V4", "B005I5LNH6", "B00GXTUTN0", "B001IBHUU8", "B00AUHIJ06", "B00G3HA1O4", "B002KQ2FDW", "B004G8HXXO", "B00HM9TIS2", "B004QIPKNY", "B00BN9CH26", "B007BYLO4E", "B004SBHSZ2", "B007F9XHAY", "B003ANVQWU", "B00BKUMN9U", "B009AHQ8C8", "B004612IWM", "B00GR9CP88", "B0046W556M", "B00AUHM7C2", "B00GPFM106", "B005625SJK", "B00BQ3EGPU", "B00IHJ1LU4", "B007F9XHBI", "B00ICDAAX4", "B0038JECKY", "B00G4TTQQK", "B00AWKC0JM"], "buy_after_viewing": ["B002CO6GUK", "B004BI6MVS", "B0002L5R78", "B00D0EP68Y"]}}