{"asin": "B000089GN4", "description": "The closed, dynamic, supra-aural PX 200 mini headphones are an ideal choice for mobile audio sources. Their excellent isolation lets you enjoy music without being disturbed or disturbing others. Folded and packed into their rugged transport case, these headphones will accompany you anywhere. The PX 200 was awarded the International CES \"Design & Engineering Showcase Honors\" for 2003.Features:Dynamic stereo mini headphonesFold and flip: registered design allows the ear cups to be turned through 90 degrees and fold the headphones closed (headphones will lock in open and closed positions)Fits into the shirt pocket: rugged transport case with cord take-up (145 x 75 x 27 mm)Excellent sound quality for mobile audio sourcesHigh-resolution sound due to Sennheiser \"Duofol\" diaphragms with spiral embossingCrisp and fast bass response due to system \"twin damping\" with 80 ppi polyurethane and special perforated elementsEasily replaceable ear pads and headband padding (ear cups and headband can be replaced by your dealer)Lightweight: only 65 g without cableBass tube for powerful, punchy bassSpecifications:Nominal impedance: 32 OhmsJack plug: 3.5 mm stereoTransducer principle (Headphones): dynamic, closedEar coupling: supraauralCable length: 1.4 mWeight (w/o cable): 60 gFrequency response (headphones): 10 to 21,000 HzSound pressure level (SPL): 115 dB (SPL)THD, total harmonic distortion: 0.1 percent", "title": "Sennheiser PX200 Collapsible High-Performance Closed Headphones (Black)", "price": 62.63, "imUrl": "http://ecx.images-amazon.com/images/I/41uqAtebqAL._SY300_.jpg", "related": {"also_viewed": ["B002VPDOHS", "B002VPDOH8", "B003WV7890", "B008JEOCCG", "B00BUL4VVM", "B003WV8PKG", "B00375MWE2", "B0028N78C0", "B002VPDOI2", "B005SNPTRS", "B002SSO06M", "B005LBQ7BY", "B0091TA5EW", "B005N8W1EW", "B004444O50", "B00001P4ZH", "B003V9RWEO", "B002B4KM1A", "B003VIXT38", "B002SSHVEU", "B0006B486K", "B00009LI55", "B000TDZOXG", "B005N8W214", "B003LPTAYI", "B00009ZSYG", "B00198BY48", "B005N8W16U", "B000065BPB", "B0055P9K38", "B008P8EXRU", "B009QV14MC", "B005N8W1H4", "B004JRYLG4", "B002DGTGNG", "B006QR8W6K", "B003VJ08U4", "B008P8EWI0", "B004KCJJ4M", "B009A6CZYE", "B00BWUHHYE", "B00006JILE", "B0072V72DI", "B000KN0YEY", "B0040IPM2E", "B001UE6HZM", "B001RNO92Y", "B000OQUMKI", "B004RKQMCY", "B00I5401KC", "B00931SFZO", "B005N8W1MO", "B004FEEY9A", "B004QMH8KI"], "buy_after_viewing": ["B002VPDOHS", "B002VPDOH8", "B003WV7890", "B00BUL4VVM"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Headsets & Microphones"]]}