{"asin": "B000IM9542", "description": "The latest in SanDisk's audio line, the Sansa c250 2GB MP3 Player provides everything you need to play music, enjoy photos, and listen to FM radio. This affordable device also includes a bright color screen, on-the-fly voice and radio recording, a microSD slot for memory expansion, and an intuitive, easy-to-use interface.The Sansa c240 can hold 16 hours of CD-quality MP3 tracks on its 1 GB memory.Easily transfer music to your device in Windows.Import several image formats to your device.Full-Featured MP3 PlayerThe SanDisk Sansa c250 will play MP3, WMA, WAV, and protected WMA DRM (digital rights management) music files. Enjoy the album art on the compact color screen, along with track information via ID3 tag support. The Sansa c250 MP3 player has two gigabytes of built-in flash memory, which allows you to store up to 500 songs (32 hours of playback) in 128 kpbs MP3 format, or up to 1,000 songs (64 hours of playback) in 64 kbps WMA format. Additional capacity can be added via the microSD slot. It also supports subscription music stores, for easy purchase and downloading of new music to your player. Finally, you can adjust the sound to your preference using the digital equalizer's five presets: normal, rock, jazz, classic, pop, and one customizable user setting.Take Your Photos With YouUse the c250's color screen to share slideshows of  photo thumbnails with your friends. The device supports JPEG, TIFF, PNG, BMP, and GIF files, which are easily converted using the included Sansa Media Converter software.Portable FM RadioEnjoy programming in a more traditional way with the built-in digital FM radio. Keep your favorite stations stored in the twenty programmable presets, and cycle between them with ease. Record FM radio on the fly, saving your favorite programs for later.Voice RecordingHave a thought you need to get down before it evades you? Use the built-in microphone to record voice memos. Capture interviews, classes, presentations, short notes to yourself, or anything else you might feel inspired to record for later listening.Easy TransferThe c250 uses a high-speed USB 2.0 connection for fast file transfers from your computer. Once connected to your computer, the device is detected by your operating system and appears as additional drive. Simply drag and drop your music files to the device and you're ready to go. Alternately, you may use Windows Media Player or other music software to manage your files. Requires Windows XP and Windows Media Player 10 or later.Time to PlayThe included rechargeable lithium-ion battery allows for hours of music before needing a recharge, and is removable--buy a spare for a long road trip or other situation away from power outlets.What's in the BoxSansa c250 digital audio player, Earphones, USB Cable, Quick Start Guide, Lanyard, and 1 lithium ion battery.", "title": "Sandisk Sansa&reg; ExpressTM MP3 Player 2GB", "price": 34.99, "imUrl": "http://ecx.images-amazon.com/images/I/41Q97A7J12L._SX300_.jpg", "related": {"also_viewed": ["B002MAPT7U", "B001NZ981S", "B000OS8TWO", "B000MD40N8", "B000IM5GBS", "B000RN1RXO", "B0015L0T68", "B000BP50AY", "B000RN62LG", "B000BONJXU", "B000BP8AY2", "B005FVNGRS", "B00BTLN5OC", "B0041G62R4", "B000ETXOC8", "B000ETVKHE", "B00BJNHGRM", "B001KN9YXU", "B00D1ZXVDY", "B00CE3YJCQ", "B00HCMZ19Y", "B002MAPS6W", "B000EUCMWK", "B0041G62TW", "B000U2LEGM", "B005FVNH04", "B000VIHFZ4", "B0015L451I", "B00HCMZ2SE", "B002MAPRYU", "B005FVNGZA", "B005FVNGS2", "B005FVNGRI", "B007B5TQQG", "B0035PBHRM", "B00BG13P9K", "B009K6ULV8", "B0001F22R8", "B000ETTFRG", "B0013GJIBC", "B005FVNGZK", "B0076HNNHM", "B000RMZMQS", "B002MAPSC6", "B00400TGEC", "B00066EK36", "B002MAPSQM", "B00AF40U5G", "B007BGGEOC", "B00ATXPHU6", "B0035PBHU4", "B007B5TO4A", "B0041G62VU", "B00176SYZE"], "buy_after_viewing": ["B002MAPT7U", "B001NZ981S", "B000OS8TWO", "B009QZH7BU"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}