{"asin": "B001E27DLM", "description": "After 13 long years, the role playing game of the ages finally returns with Chrono Trigger for the Nintendo DS. This chapter begins when a newly developed teleportation device malfunctions, and young Crono must journey through time to rescue a mysterious girl from an intricate web of past and present perils. Enhanced with Nintendo DS's dual-screen presentation, stylus controls, and a host of great new features, this classic tale returns to a modern, portable platform..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }After 13 long years, the role playing game of the ages finally returns with Chrono Trigger for the Nintendo DS.View larger.Gameplay is enhanced with Nintendo DS's dual-screen, stylus controls, and a host of great new features.View larger.And so the Story Goes. . .Through a chance encounter amid the festivities of Guardia's Millenial Fair in Leene Square, the young hero, Crono, meets an adventurous girl named Marle. The two decide to explore the fair together and soon find themselves at an exhibition of the Telepod -- the latest invention by Crono's long-time friend, Lucca.Marle, fearless and brimming with curiosity, volunteers to assist in a demo. However, an unanticipated malfunction sends her hurtling through a rift in the dimensions. Taking hold of the girls pendant just before she's whisked away,Explore the past -- Prehistory, Antiquity, and the Middle Ages -- Present, Future, and even the End of Time.View larger.This game utilizes a revised version of the groundbreaking Active Time Battle (ATB) System.View larger.Crono bravely follows in pursuit, but the world into which he emerges is one of four centuries ago. In Chrono Trigger prepare yourself to journey into the forgotten past, distant future, and even to the very End of Time.The Worlds of Past, Present and FutureIn Chrono Trigger you'll journey back to Prehistory (65,000,000 B.C.) where humans and reptiles battle to wipe each other from existence. Antiquity (12,000 B.C.) is an age where the world is divided between people whose continent is buried in snow, and the magical kingdom of Zeal, a highly advanced civilization. The Middle Ages (600 A.D.) is an era of swords and sorcery, a dark time when the armies of Fiendlord rule over the land.The Present (1000 A.D.) is the time period in which Crono, Lucca and Marle live. It is a bright and peaceful age. However, in the Future (2300 A.D.), an era of despair has taken hold with rogue machines ruling the world. After the day of the apocalypse in 1999 A.D., the prosperous civilization of humanity crumbled and the remaining people struggle to stay alive. And, finally, there remains the End of Time -- a place with no era to call its own. This confluence of time's streams transcends spatiotemporal boundaries. It is here at the gravitational center for all temporal flotsam that Spekkio -- the Master of War -- serves as your guide on time's treacherous roads.Battle Systems and gameplayThis game utilizes a revised version of the groundbreaking Active Time Battle (ATB) System. Chrono Trigger features exhilarating combat in which the clock is constantly ticking. Characters must first wait as the ATB gauges charge, and then perform an action. This makes strategic timing a crucial element in your battle plan. In addition to standard attacks, each character has an array of special Tech skills and powerful combos known as Dual and Triple Techs. Cooperate with other characters to unleash over 50 unique and devastating moves!Chrono Trigger utilizes great story-telling, interesting characters, action-packed gameplay, and the unique controls of the Nintendo DS to deliver a fun and well-rounded role-playing game on a portable platform.", "price": 61.28, "imUrl": "http://ecx.images-amazon.com/images/I/51iThGjmvKL._SX300_.jpg", "related": {"also_bought": ["B00184219U", "B004CVWETI", "B000GABOTU", "B0009Z3K9E", "B001NJMMHG", "B002I0EH6I", "B001TOMR6Q", "B003FBL86Q", "B00GV4V8XC", "B00136MBHA", "B000GIXIPK", "B001A01FD0", "B001CU4EJ0", "B00GANWVJE", "B000B69E96", "B000UZVL58", "B00AKIPBNS", "B0009XEC02", "B004K6LQAS", "B001AF1NVY", "B003IOGPAO", "B003O6E800", "B002TDIEDG", "B000FRV2UK", "B000GABTVS", "B000QTD05W", "B002I08WVY", "B002I0GKIQ", "B001O1PAMC", "B006OI3CTS", "B003O6E7DI", "B001TOQ8WU", "B00KWFCU4M", "B002I094AC", "B000CI83LI", "B000B8J7K0", "B000Q6J51S", "B007CSF3GO", "B000SSQPU8", "B001TOQ8UW", "B00KVRK39A", "B000BI3SIC", "B001TD6SK8", "B001P1ZE68", "B003S55EX2", "B00I5LMSE2", "B0012NWBH4", "B001HB7K6I", "B0054J1LBO", "B001C58T5U", "B000HE9LL8", "B00KWFY04A", "B00E1A1SP6", "B001H8Y7DA", "B0006TO2HM", "B003UI518A", "B000LY4IDK", "B002BS4834", "B0050SVOXE", "B0006B0O9U", "B000SSPH3E", "B000HE9LEK", "B009B1D7JK", "B000JLL3UQ", "B000U5W3IW", "B002AU0HZQ", "B0009K7ESC", "B00B7ELWAU", "B0053BCO00", "B000Q6ZLMA", "B007R4X3AG", "B005C2QSDY", "B002I092MM", "B0007ZSHOY", "B002I08UPC", "B002E6XY6U", "B0050SVKRY", "B002I09286", "B000SSPI4C", "B002EE7OKE", "B00KWIYPZG", "B0052WG9II", "B003O8EDUS", "B008HPAXZ2", "B0050SVOHA", "B00KWEHBAG", "B0053B66KE", "B00BQI3UQG", "B000IONGU4", "B002DC8GWW", "B008ZXBYJU"], "bought_together": ["B00GV4V8XC"], "buy_after_viewing": ["B001TOMR6Q", "B00GV4V8XC", "B002I0EH6I", "B00AKIPBNS"]}, "salesRank": {"Video Games": 1173}, "categories": [["Video Games", "Kids & Family", "Nintendo DS", "Games"], ["Video Games", "Nintendo DS", "Games"]]}