{"asin": "B000HNJ6U0", "categories": [["Electronics", "Television & Video", "Streaming Media Players"]], "description": "From the ManufacturerWatch, Record, Edit, EnjoyEyeTV Hybrid is powered by award-winning EyeTV 2 software:Watch analog as well as free over-the-air digital TV on your Mac.Browse EyeTV menus in Full Screen mode.Record hours of your favorite TV shows directly on your hard drive and edit out unwanted content.Find TV shows using the built-in program guide (USA only).Export clips and entire episodes to your video-capable iPod.Connect game consoles and enjoy virtually no latency game play.It&rsquo;s the ideal solution for someone who wants both an analog and digital TV solution for the Mac in one small USB stick.Special FeaturesTwo-In-One TV for Your MacEyeTV Hybrid does the work of two EyeTV hardware products for the price of one. It delivers free over-the-air digital TV to your Mac via antenna, as well as analog TV via antenna and standard cable. In \"Analog Mode\", EyeTV Hybrid enables you to watch analog TV (NTSC) on your Mac via antenna and standard cable. EyeTV Hybrid also comes with a break-out cable for composite video and S-Video; use it to connect a set top box to receive premium channels, digital cable or satellite (in standard definition). Do you plan to use EyeTV Hybrid with a Dual PowerPC G5 or an Intel Core Duo processor? Then enjoy watching 720p or 1080i HDTV (MPEG-2) in addition to the other digital television standards.&nbsp;Made for the MacWith its classic matte aluminum finish and surprisingly small size for such a versatile product, the EyeTV Hybrid is a perfect complement to the Mac. It features a USB 2.0 interface for the streaming of superior quality, uncompressed TV content to your Mac. It is USB powered and therefore requires no external power supply, and contains a full-size coaxial plug.&nbsp;Connect Game Consoles to Your MacConnect your game console and enjoy an excellent live play experience--EyeTV Hybrid&rsquo;s uncompressed analog video signals appear on the screen with virtually no latency.&nbsp;Navigate with an Apple RemoteTired of remote controls scattered around the living room? So are we. If your Mac came with an Apple Remote, you can use it to navigate EyeTV&rsquo;s Full Screen Menu. The Full Screen Menu will certainly work with an EyeTV IR remote control as well.&nbsp;Superb Quality Digital TV RecordingsEyeTV Hybrid records digital TV in one quality setting, Lossless. The digital stream is recorded unaltered, and so you&rsquo;re getting full quality digital content as encoded by the broadcaster. EyeTV supports multilingual programming and Dolby Digital sound. Analog TV can be recorded via EyeTV 2&rsquo;s software encoder, and the quality depends on the Mac&rsquo;s processor power.", "title": "Elgato EyeTV Hybrid (NTSC)", "price": 170.99, "salesRank": {"Electronics": 84578}, "imUrl": "http://ecx.images-amazon.com/images/I/41OTJtkPFlL._SY300_.jpg", "related": {"also_viewed": ["B003MVYTBU", "B004HO58SO", "B001DEYVXO", "B0039UOTW8", "B00JKG73I2", "B001PBM4RA", "B00A0BXBTG", "B004Y3DE2U", "B002UOUQ08", "B001LQEEEA", "B006PU81QE", "B000PBTENS", "B0029U2YSA", "B002U6KT8U", "B00GY0UB54", "B00GY0UB6I", "B00G9ETHF0", "B007QCIBX8", "B009GUR2U6", "B00198MYB0", "B003NUDZVA", "B001DERXV6", "B007W6GOPA", "B0021AEPTY", "B005LMWPNM", "B00180PZHY", "B00B1C04XE", "B00BRFRZGE", "B00AGV7T6Q", "B00AHWFQ0A", "B001KEQ54U", "B00CM2V0EY", "B002RSLSHW", "B00BF2M21C", "B004HKIB6E", "B0007LBMR2", "B003WSQTWU", "B0018LX0DY", "B007JPOX8O", "B001F8LIKM", "B007FEEO3S", "B00FVV5RCY", "B009U7WZCA", "B003GX4PR2", "B00JGZQ17Q", "B00I2ZBD1U"], "buy_after_viewing": ["B003MVYTBU", "B004HO58SO", "B0029U2YSA", "B001DEYVXO"]}}