{"asin": "B000GVTX6U", "description": "Create a wired network in your home using the D-Link Ethernet Broadband Router. Connect this Wired Router to a broadband modem and share your high-speed Internet access, check email, share files, and enjoy online gaming. This Wired Router provides four 10/100 Ethernet ports to connect up to four Ethernet-enabled PCs or network devices. Switching capabilities have been integrated into this device to efficiently manage your network traffic. It includes a built-in firewall for safeguarding your network from hackers and malicious attacks. Parental control features are also included to monitor Internet usage and block inappropriate content. The Quick Router Setup Wizard is provided to help you set up your network in minutes.  For creating a simple wired network for your home, the easy-to-use D-Link Ethernet Broadband Router gets the job done.Features and BenefitsThe Quick Router Setup Wizard makes it easy to install and useFour ethernet ports allow for simple networkingA built-in Cable Tester Utility is included to help you diagnose and troubleshoot physical cable problems.Ideal if you&#x92;re creating your home or small business networkFirewall features include Network Address Translation (NAT), MAC Filtering, Website Filtering and Scheduling", "title": "D-Link EBR-2310 Ethernet Broadband Router", "price": 99.99, "imUrl": "http://ecx.images-amazon.com/images/I/41IIiMiMTSL._SX300_.jpg", "related": {"also_bought": ["B00403NC7G", "B00000JDF5", "B00006I5XC", "B00000J1V5", "B003CFATSS", "B003X7TRWE", "B003X7TRWO", "B003WOWB5S", "B000BCC0LO", "B0006NMRVQ", "B008BGXZU2", "B00006B9H9", "B00008VFAF", "B0002TPFTA", "B00DSUTVYK", "B00461E7JE", "B0000ZI1FG", "B004CSIG1G", "B0002I7288", "B003D3MFHM", "B003NREDC8", "B0007T27H8", "B004HN81SE", "B006YLVD50", "B00461G3MS", "B00002EQCW", "B007B60SCG", "B0000BVYT3", "B0001BVXI6", "B008ZVRAQS", "B000LIFB7S", "B003XMAD22", "B000FBK3QK", "B00005LLY4", "B001KB6Z2U", "B003SANWI6", "B000M2TAN4", "B00H09BOXQ", "B005DB6GJ0"], "bought_together": ["B00000JDF5", "B00000J1V5"], "buy_after_viewing": ["B007B60SCG", "B003CFATSS", "B00006I5XC", "B002OMX0XQ"]}, "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Switches"]]}