{"asin": "B001OI2YNS", "description": "From the ManufacturerCanon has a well-known and highly-regarded reputation for optical excellence, advanced image processing, superb performance and technological innovation, built on our legendary photographic and broadcast television lenses. Based on that experience, we bring the latest in high definition camcorders. The Canon VIXIA HF S10 Dual Flash Memory camcorder is one such exampleThe VIXIA HF S10 delivers brilliant video and photos through a new Canon exclusive 8.59-megapixel CMOS image sensor and the latest version of our advanced image processor, DIGIC DV III. It combines lightweight, compact size and the ease and convenience of Flash Memory. This technology, the same used in advanced laptop computers, MP3 players, PDAs and cell phones, allows the VIXIA HF S10 to record to both its large 32GB internal memory, for up to 12 hours of crisp, high definition video, as well as to a removable SDHC card. You have extended available recording space and more flexibility in file transfer and playback.What's more, the VIXIA HF S10 allows you to record at up to 24Mbps, the highest bit rate in AVCHD format, for the highest quality image. The VIXIA HF S10's Canon Exclusive features - such as the Genuine Canon 10x HD video lens, sophisticated Genuine Canon Face Detection capability, SuperRange Optical Image Stabilization and a host of new control and creative options - makes our Flash Memory camcorder unmistakably Canon.Canon VIXIA HFS10 HighlightsDual Flash Memory: 32GB Internal Flash Drive &amp; SDHC card slotDual Flash MemoryWhat makes the VIXIA HF S10 stand out in the category of Flash Memory camcorders is its Dual Memory capability. You can capture video on both the camcorder's internal 32GB Flash Memory as well as directly to an SDHC Memory Card.Video recorded to the internal Flash drive can also be copied onto a memory card which can then be inserted into your computer or HDTV's card reader slot for immediate viewing.You can also use higher capacity memory cards to further increase the video storage of your VIXIA HF S10.The advantages of Flash Memory go beyond the added recording time. You'll also appreciate the quick response time, because it doesn't have to wait for moving parts. Press the record button and your VIXIA HF S10 starts recording video faster than you've ever seen before. In addition, you'll have faster access to your recorded scenes as well.Another plus is the VIXIA HF S10's low power consumption rate, allowing your battery to last longer. It's just what you need so you don't miss that pivotal play on the field or the moment when they say \"I do.\"While we certainly hope you keep your VIXIA HF S10 securely in your hand while shooting, if it happens to slip, or you accidentally knock it against something, you'll be happy to know that Flash Memory makes your camcorder more shock resistant than other recording storage systems. It also minimizes the chance of data loss due to damage to your recording media or the moving parts found in other camcorders.* 1920 x 1080 movie recording requires a Class 4 or higher memory card. For other recording formats, a Class 2 or higher card is recommended. Also, movie recording requires cards with 128MB of memory or more. Cards made by Toshiba, SanDisk or Matsushita are recommended. No particular restrictions apply for still images.Genuine Canon 10x HD Video LensFor over 70 years Canon has been producing exceptional photographic lenses that are synonymous with unsurpassed optical performance. Because of Genuine Canon Optics, every Canon broadcast lens, digital camera and camcorder assures brilliant optical quality - and the VIXIA HF S10 is no exception.The VIXIA HF S10 comes with an outstanding High Definition video lens - a Genuine Canon 10x HD Video Lens. It's the lens you need to record long shots of your child on the soccer field, wide shots of beautiful landscapes, and everything in-between. And because it comes with four zoom speeds, three pre-set and one variable, you always get smooth, steady, professional-looking zoom shots.Super Spectra Coating technology results in images with minimal flare and ghosting. Plus, the lens' aspheric design reduces aberration and increases resolution, ensuring crisp, sharp video and enhancing the HD image quality. Additionally, a gradation neutral density (ND) system gives you better exposures in bright shooting situations.A built-in 1.7x Digital Tele-converter provides an extended telephoto range, while still retaining the renowned Canon image quality. In addition, for those times when you need to get a particular shot from a very long distance, this flexible lens also has a 200x digital zoom.Canon Exclusive: 1/2.6-inch, 8.59-megapixel Full HD CMOS Image SensorThe VIXIA HF S10 captures 1920 x 1080 High Definition video through its Canon designed and manufactured 1/2.6-inch, 8.59-megapixel HD CMOS image sensor, similar to the CMOS image sensors in Canon's EOS Series Digital SLR cameras.The VIXIA HF S10's powerful CMOS image sensor provides high color resolution and advanced color reproduction for brilliant results. It is also unique in featuring Canon's proprietary noise reduction technologies for crisp, sharp images. Low noise technology also means that even in dimly lit scenes, the signal from each pixel is as pure as possible, with minimal noise or other aberrations. It's the ideal sensor for HD.The VIXIA HF S10 uses an RGB Primary Color Filter with Bayer Placement Pattern that separates light into red, green and blue color components. This results in vibrant images with deep, rich, accurate color and natural-looking tones similar to what you'd obtain from 3CCD camcorders. In addition, the Bayer Placement Pattern delivers sharp, high definition images with true-to-life color reproduction. As an added benefit, the CMOS sensor provides outstanding image capture in low light conditions.Canon Exclusive: DIGIC DV III Image ProcessorDIGIC DV III is Canon's most advanced HD image processor ever, helping to deliver enhanced image quality, true color production for both video and photos, and a sophisticated noise reduction system for exceptional low-light performance. It is also the high-speed engine which powers a variety of Canon technologies including the 8.0 Megapixel photo capture, 6.0 Megapixel Simultaneous Photo Recording, Advanced Auto Exposure system and Genuine Canon Face Detection.Plus, the Canon DIGIC DV III Image Processor allows continuous shooting of digital photos with the VIXIA HF S10. You can also enjoy faster processing of your images to your memory card (1.4x normal card; 2.5x Hi Speed card). In addition, it helps lower power consumption for longer battery life.1920 x 1080 Full HD RecordingThe Canon VIXIA HF S10 not only captures images in Full HD, but records and outputs at 1920 x 1080* as well, so you get Full HD from lens to screen. Your memories are preserved in stunning clarity, and ready for playback on your HDTV. With the advanced codec in the VIXIA HF S10, you can also record at the highest AVCHD bitrate of 24Mbps.***A Class 4 or higher SDHC memory card is required. For other recording formats, a Class 2 or higher card is recommended. Also, movie recording requires cards with 128MB of memory or more. Cards made by Toshiba, SanDisk or Matsushita are recommended. No particular restrictions apply for still images.**DVD media containing AVCHD footage should only be used in AVCHD compatible players otherwise the DVD player may fail to eject the media and may erase its contents without warning.24Mbps RecordingThe 24Mbps recording capability of the VIXIA HF S10 gives you the highest quality AVCHD video possible. You'll see enhanced detail, finer gradations of tones and improved reproduction of moving subjects. Video shot by the VIXIA HF S10 of fast-moving sporting events, multi-color butterflies on a variegated leaf or the shading of a brilliant sunset will be remarkable.Canon Exclusive: SuperRange Optical Image StabilizationThe high-resolution images of High Definition video demand a steady hand. It's easier to get those clear, steady images with the VIXIA HF S10, thanks to Canon's innovative SuperRange Optical Image Stabilization. It combines gyro- and image-sensors to give image stabilization through a wider range of camera motions. Some image stabilization systems correct one type of camera motion or vibration better than another. But Canon's SuperRange OIS corrects for a wide range of camcorder motion: the fast vibration you'd experience while recording from a moving car; the medium-speed motion of hand-held recording; and the slower motion of body sway. No matter what you're recording and how you're recording it, the VIXIA HF S10's stabilization design corrects camcorder shake instantly. SuperRange OIS also delivers steady images when shooting at long focal lengths.SuperRange OIS in action.In addition, optical stabilization keeps your shot steady without a loss in image quality - something that can't be said for electronic image stabilization. And image stabilization isn't just for video; you can even use it for taking sharper, clearer digital photographs with your VIXIA HF S10. Thanks to Canon's expertise, it's easy to eliminate one of the telltale signs of amateur video and photography.Canon Exclusive: Instant AF (Auto Focus)Another critical objective when shooting in High Definition is achieving a very sharp focus. The VIXIA HF S10 camcorder features Canon's revolutionary Instant AF focusing system which offers a dramatic improvement in auto focus speed and accuracy (compared to traditional auto focus systems). The Instant AF feature uses an external sensor, in combination with Canon's auto focus system, to help significantly decrease the time it takes to find focus, even in low light conditions. This system achieves focus instantaneously, reducing focus \"hunting.\" The benefits of Instant AF are especially seen in high brightness and night shooting situations. With Instant AF, it's possible to capture fast, accurate focusing, even when following a moving subject.And because a properly focused subject is more critical than ever with HD, the VIXIA HF S10 also features Focus Assist. This helps in capturing your subject in razor sharp focus. It works by providing a 2x magnification of your subject (when you start recording, this assistance is automatically cancelled). This is a feature normally found in professional broadcast-quality cameras. Another sophisticated control available on the VIXIA HF S10 is color peaking, which enhances the edges of your subject to aid in focusing.Canon Exclusive: Genuine Canon Face DetectionThe same high quality Face Detection technology used in Canon digital cameras is now available in Canon High Definition camcorders. Up to 35 faces can be detected automatically, and 9 detection frames can be displayed at one time. Genuine Canon Face Detection ensures razor-sharp focus and natural, accurate exposure of the chosen subjects.The system is in fact so intelligent that it will recognize faces that are turned downwards or sideways. In addition, a specific face may be selected as the main subject for continuous tracking. This feature can be used to search for clips featuring that specific subject's face. In search and playback, use of the Face Index will display frames with the chosen face as a thumbnail in each shot in which it appears. The selected face can be linked as a time line to further identify footage containing that subject.Advanced Auto Exposure SystemThe VIXIA HF S10 has an Advanced AE System inspired by Canon's EOS DSLR cameras. It's designed to provide the most accurate exposure settings in a wide variety of lighting conditions. This enhanced Auto Exposure system, together with Face Detection and DIGIC DV III captures an expanded dynamic range, optimizing brightness to avoid overexposure, while still preserving important shadow detail.24p Cinema Mode24p Cinema Mode enables all aspiring moviemakers to achieve a professional \"film-look.\" You can change the camcorder's frame capture rate to 24p (recorded at 60i), which provides the appearance of the same frame rate as movie film. In addition, you can use the VIXIA HF S10's CINEMA setting, which changes the color and tonal characteristics, evoking the look and feel of a movie shown in a theater. For added flexibility, these settings can be used together or independently.Normal mode vs. Cinema mode30p Progressive ModeThis is a sophisticated tool for which you would otherwise have to look to professional video cameras in order to have at your command. In addition to the standard interlaced video frame rate of 60i, you may choose to set the VIXIA HF S10 to capture video in 30p (30 progressive frames, recorded to 60i), which is particularly useful for footage to be used on the Internet. In addition, this setting gives enhanced quality to still images captured after recording. It's also excellent for action shots and sports.60i vs. 30pBuilt-in 8.0-megapixel Digital CameraThe VIXIA HF S10 is not only a superb camcorder but also a brilliant 8.0-megapixel digital camera delivering stunning quality still photos. With many advanced photo features rivaling other state-of-the-art digital cameras and recording to an SDHC memory card, you get the best in both video and photos. An example? The VIXIA HF S10 boasts Simultaneous Photo Shooting, allowing you to capture crisp 6.0-megapixel photos and video at the same time.The same Canon exclusive CMOS image sensor that ensures sharp, vivid HD video also gives you brilliant digital photographs. Like the CMOS image sensors in Canon's EOS Series digital SLR cameras, the VIXIA HF S10's image sensor results in outstanding digital photographs. It gives an impressive resolution of 8.0 megapixels for sharp, crisp still images.Canon DIGIC DV III Image ProcessorCanon's exclusive DIGIC DV III Image Processor features improved continuous shooting of digital photographs with the VIXIA HF S10. You can also enjoy faster processing of your images to your memory card (1.4x normal card; 2.5x Hi Speed card).Focus FeaturesAuto Intelligent Auto Focus (AiAF) ensures sharp images and gives creative flexibility. Even when your subject isn't in the center of the frame, the VIXIA HF S10's 9 Point AiAF will automatically select from 9 metering frames on the screen to help bring images into sharp focus.Auto Exposure ModesLike any good digital still camera, the VIXIA HF S10 lets you choose from a range of exposure modes. Auto mode automatically sets the exposure, letting you concentrate on your subject. AV (aperture priority) mode lets you control depth of field by letting you choose the aperture. TV (shutter priority) mode lets you select the shutter speed for sharp, action shots. In P (program) mode, the camcorder adjusts camera settings automatically.Program AE ModeYour life happens everywhere, so the VIXIA HF S10 gives you settings that automatically result in the best exposure settings for different conditions and different subjects.Portrait mode ensures shallow depth of field for a pleasing background in your shots of friends and family. Sports mode stops the action with faster shutter speeds. Night mode is designed to give you great shots after the sun goes down. Snow and Beach modes compensate for bright surroundings and give you the proper exposure on your subject. Sunset mode results in vibrant, well-exposed colors for one of the toughest subjects to capture properly. Use Spotlight mode when your child is on stage and in the spotlight - literally - and you want to make sure the exposure is right for them. And, Fireworks mode records brilliant images of another tough subject - the holiday fireworks display.Simultaneous Photo RecordingWith the VIXIA HF S10, you can record HD video and capture a 6.0-megapixel photo to a memory card - simultaneously. Simply press the photo button and you've got an e-mail ready digital photo to share with friends and family.Histogram DisplayFor the advanced digital photographer, the VIXIA HF S10 comes with a Histogram Display - a feature found in Canon's line of digital SLR cameras. The display allows you to see the brightness information of your still images, so you can adjust your exposures as you shoot.Level and Grid MarkersWith the Level Marker feature, it's easy to keep your camera level for more professional-looking photographs. Line up any horizontal lines in your shot - such as the horizon - to the marker and you can be sure your camcorder is level.The VIXIA HF S10's Grid Marker feature lets you compose your shot accurately, according to the grid in your viewfinder. You can even choose from two different colors for the grid. This ensures that you see the grid, no matter what the background color of your shot is.Still Capture from Flash MemoryThe versatile VIXIA HF S10 even lets you capture a still image from an already recorded movie. While playing the movie in your camcorder, simply press the photo button to capture a 1920 x 1080 still image onto an SDHC card or to Built-in Memory. Additionally, the VIXIA HF S10 allows you to capture 30 photos from one second of video. Now, better photos filled with action and expressions are easy to grab, print, post and share.Built-in FlashYour VIXIA HF S10's built-in flash lets you capture superb photos indoors and in low light conditions. The VIXIA HF S10 also features red-eye reduction.Share Your PhotosYour VIXIA HF S10 comes with features that make it simple to share your still photos.Print/SharePrint/Share ButtonPrint/Share turns your VIXIA HF S10 into a photo lab in the palm of your hand. Simply connect your camcorder directly to select Canon printers or any PictBridge-compatible printer with the supplied USB cable. Then, with a simple touch of the Print/Share button, print directly from your VIXIA HF S10 without going through a computer.Print/Share also makes it easy to transfer your still images to your computer. Simply connect your VIXIA HF S10 and your computer, press the Print/Share button and your photos are downloaded to your computer.DVD Burner CompatibleYou can also easily burn DVDs of your still photos taken with your VIXIA HF S10 as it is compatible with Canon's DW-100 DVD Burner*. A one-cable connection is all it takes to send the files across and with the click of a few buttons your videos will be burned to an AVCHD disc for play in a compatible DVD player.*Discs recorded in 24Mbps cannot be played back using the DW-100.Superb Shooting ControlDual ShotCapture video and photos without switching modes, which both saves you time and helps you to avoid the chance of a missed shot.Professional Shooting Assist FunctionsThe VIXIA HF S10 provides you with an exceptional level of control. At your fingertips will be the same type of creative control tools the pros use to deliver the best results possible.Enhanced zebra pattern (70 percent, 100 percent) indicates blown out or high brightness areas to help you set the proper exposure.Color peaking displays the edges of your subject in color (red, blue, yellow) - to aid in manual focusing.Color bars with Test Tone.Gain control function is selectable from 0, 6, 12, and 18 dB and Auto. Lowering the dB value can ensure that dark scenes can be shot with the correct level of darkness. A higher gain setting can provide extra brightness for dark scenes.100-percent area display gives you a complete view in the LCD of the scene being shot. No need to worry that areas in the margins are being left out.The VIXIA HF S10 features a Custom Key and Custom Dial to provide quick and easy access to commonly used functions. Choose from:Exposure Lock (On/Off)Focus (Auto/Manual)Assist FunctionsMicrophone Level Control (Auto/Manual)Automatic Gain Control Limits (On/Off)Variable Zoom Speed ControlAnother sure sign of amateur video is the unsteady zoom shot. But with the VIXIA HF S10's zoom control, you simply select one of the four zoom speeds (three pre-set, one variable) for smooth, steady, professional-looking zooms.Level and Grid MarkersWith the Level Marker feature, it's easy to keep your camera level for more professional-looking video. Line up any horizontal lines in your shot - such as the horizon - to the marker and you can be sure your camcorder is level.The VIXIA HF S10's Grid Marker feature lets you compose your shot accurately, according to the grid on your LCD screen. You can even choose from two different colors for the grid. This ensures that you see the grid, no matter what the background color of your shot is.Quick StartNever miss a quickly unfolding shot again. When the VIXIA HF S10 is in Camera Mode and the LCD panel is closed, it is placed in standby mode. When the action starts, open the LCD panel and you'll begin recording in less than one second. You'll also help extend your battery life as compared to leaving the camcorder in regular recording mode.Pre-recordThe Pre-record feature places your VIXIA HF S10 in a stand-by \"pre-roll\" mode. When you press the shooting button while in Pre-record, the VIXIA HF S10 automatically records 3 seconds of the action which occurred prior to your pressing of the button. With Pre-record, it will be easier than ever to capture the moment when the bat hits the ball at the start of that home run.Pre-record modeLow Light PerformanceSome of the most magical shots are taken at the end of the day or long after the sun has set. You won't miss any of them, thanks to the VIXIA HF S10's mini video light. The light lets you shoot subjects in color, in low light, up to 4.9 feet away. So, whether it's a shot of a sleeping baby, or a group of friends on a candle-lit terrace at night, the VIXIA HF S10 captures all the moments you want to record.Manual Audio Level ControlTo make your videos sound as good as they look, the VIXIA HF S10 offers a built-in audio meter and manual audio level adjustment. You'll be able to tell at a glance if the sound you're hearing is being recorded the way you want it and a simple control allows you to change the audio level if it's not.Improved Menu User InterfaceFor greater ease of use, the VIXIA HF S10 features a revised control button with cross movement action. It's an intuitive design enabling you to push up, down, left or right to choose the menu option you wish.DVD Burner CompatibleYou can also easily burn DVDs of the video shot with your VIXIA HF S10 as it is compatible with Canon's DW-100 DVD Burner. A one-cable connection is all it takes to send the files across and with the click of a few buttons; your videos will be burned to an AVCHD disc for play in a compatible DVD player.Canon Exclusive: 2.7-inch Multi-Angle Vivid Widescreen LCDThe 2.7-inch Multi-Angle Vivid Widescreen LCD on the VIXIA HF S10 lets you see more of what your camcorder is recording. Using a hard coat Anti-Reflection surface and improved color reproduction, the scene in the viewfinder is a more accurate indication of what you're capturing in the camcorder. An added benefit of this Canon Exclusive is the wider range of viewing angle possible with this new LCD screen. With less glare and deeper contrasts, groups of people can gather around it and see the image displayed more clearly than ever before.Mini Advanced Accessory Shoe TerminalAnother pro-level feature of the VIXIA HF S10 is the Mini Advanced Accessory Shoe on the camcorder. At about half the size of Canon's Advanced Accessory shoe, this feature allows you to attach available Canon optional accessories, such as the VL-5 accessory video light or DM-100 directional stereo microphone. Using the proper accessories can greatly enhance the production values of the video you shoot.Video Snapshot ModeThe Video Snapshot Mode of the VIXIA HF S10 will let you shoot short movie clips in the same way you've shot snapshots with your still camera. Simply capture a series of 4-second video clips, blend in one of 10 supplied music tracks, or your favorite background music, and create an entertaining movie that will hold everyone's attention. It's the perfect way to document your vacation or a family milestone.Intelligent Lithium-ion BatteryThe Intelligent Lithium-ion battery which powers the VIXIA HF S10 is a major advance. It not only more accurately tracks remaining battery life, it also gives a display in minutes remaining. It will allow you to better plan your shooting, so you won't be caught out with a battery that suddenly goes from \"half\" to \"empty.\" It is especially useful thanks to the long recording time capability of the VIXIA HF S10 - you'll be able to take full advantage of it and not miss any of the action you want to capture.HDMI TerminalWith the VIXIA HF S10, sharing your High Definition video on your HD television is easier than ever. Only a single cable connects your camcorder to your TV for the highest quality playback (video and audio). The newest version of HDMI (version 1.3) adds support for x.v. Color, an expanded color space which closely matches the range of the human eye. This enables richer, more accurate color to be displayed on today's latest HDTVs. Additionally, the VIXIA HF S10 supports CEC (Consumer Electronics Control). This allows multiple HDMI devices connected to your HDTV to be controlled by one remote control for simple operation.Microphone Terminal with Manual Audio Level ControlThe VIXIA HF S10 allows you to enhance the quality of your audio by using the optional accessory Canon DM-100 Directional Stereo Microphone (which attaches to the Mini Advanced Accessory Shoe) to capture better sound and headphones to monitor the audio as you hear it. You can also attach an external microphone through the 3.5mm microphone terminal. Manual control of audio levels also lets you set the exact balance you need for the situation. Your videos will sound as good as they look.Includes Pixela ImageMixer 3SE Video Editing SoftwareThe Canon VIXIA HF S10 High Definition Camcorder is bundled with a powerful software suite, Pixela ImageMixer 3SE*. You can easily perform a variety of functions, including AVCHD Editing in which you can trim, reorder, and combine scenes, as well as add music, titles, and transitions. This software also allows you to play your AVCHD movies on your computer and will also let you share copies of your movie with friends and family through Flash Memory to hard drive copying. Transfer and store your movie onto your computer's hard drive with the software and easily convert your High Definition video to Standard Definition video as well.This software will also assist you in converting video to the optimum resolution for transmission over the Internet.With the PIXELA ImageMixer 3SE Disc, you can burn your edited video onto either full size AVCHD DVDs which play in AVCHD compatible Blu-ray disc players for the full home theater experience or onto Standard Definition DVDs. And to complement the VIXIA HF S10's Video Snapshot feature, a music CD containing royalty-free soundtracks is also provided.*The bundled application is compatible with Windows XP and Windows Vista.Additional FeaturesThe Built-in Electronic Lens Cover means you never have to go looking for your lens cover again. Turn your camcorder on and the lens cover automatically opens. Turn it off, and the cover closes.USB 2.0 Hi-Speed Terminal for ultra-fast transfer of movies and photos.Compatible Optional Accessories available including the Wide Converter WD-H58, Tele Converter TL-H58, Video Flash Light VFL-2 and High Capacity Battery Pack BP-827.Wireless Remote Control lets you operate your VIXIA HF S10 from a distance, so you don't have to be left out of the picture.1 Year Parts and Labor Limited Warranty provides protection long after other manufacturers' warranties expire.What's in the BoxVIXIA HF S10 CamcorderBattery Pack BP-807Compact Power Adapter CA-570Wireless Controller WL-D88Component Cable CTC-100/SStereo Video Cable STV-250NUSB Interface Cable IFC-400PCUDigital Video Solution DiskPixela ImageMixer 3SE Video Editing SoftwareMusic CD", "title": "Canon VIXIA HFS10 HD Dual Flash Memory w/32GB Internal Memory &amp; 10x Optical Zoom - 2009 MODEL", "imUrl": "http://ecx.images-amazon.com/images/I/41Jn2aSsE1L._SX300_.jpg", "related": {"also_viewed": ["B001OI2YZQ", "B00322OP3Q", "B001OI2Z2I", "B004HW7E3I", "B004HW7E0Q", "B001OI2YTC", "B004HW7E2O", "B001DTV95C", "B00AWZFHG0", "B001DTTCQA", "B00322OP40", "B00322OP54", "B00123WDR2", "B00HLDFSQK", "B006UMMPMI", "B006UMMPGE", "B006UMMP2I", "B00AR95ENW", "B00AWZFJ22", "B00C3R14J4", "B00AW54Z7C", "B00AR95EVE", "B006K5507M", "B00HLDFTRS", "B00AWZFIUU", "B00AR95FRM", "B00123XZNI", "B006K55018", "B00114PN1U", "B00322ON8I", "B00HNJWVKI", "B00HPZKQJS", "B00006FXHQ", "B00114162K", "B004HW7DY8", "B00AR95ESC", "B00HNJWV1W", "B004HW7E6K", "B00HLDFT6Y", "B000BQ79W0", "B006K54ZX2", "B004THA2OE", "B0049VMMZ2", "B00AW54Z4K", "B0072B5E7Y", "B00HNJWWL6", "B0000507JI", "B00AR95FPO", "B004H8FN8A", "B00HPZKQ7U"], "buy_after_viewing": ["B003VNKNF0", "B004THA2OE", "B0049VMMZ2", "B001OI2YZQ"]}, "salesRank": {"Camera &amp; Photo": 9635}, "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]]}