{"asin": "B000S11K5U", "description": "Amazon.com Product Description In the U.S., German-based Navigon may be the biggest name in gps you'venever heard. Navigon has long been a major provider of navigation software to automotive manufacturers for in-dash gps navigation devices, but only recently did they introduce portable navigation devices under their own name. What they offer up, however, demonstrates immediately that this is a company that knows navigation inside and out.More about NavigonNavigon...James NavigonThe first thing you notice about the Navigon 7100 GPS Navigator is, well, the Navigon 7100 GPS Navigator. It'sbeautiful.It's the kind of device you'd expect an international spy to have in their rocket car. It's less than an inch thick, and its shiny black casing will go well with just about any car interior. Paying the same attention to every detail, Navigon's included car mount raises the bar even higher, with a design that is not only easy to use, but echoes the 7100's in a way that makes device and accessory become one, adding a touch of style and elegance to any vehicle's interior.The Navigon 7100 offers a premium navigation experience in a sleek package.View larger.Intuitive, animated menus offer predictive text input, helping you select your destination quickly.View larger.The lane assistant provides guidance to the optimal lane for your route.View larger.The reality view guides you with photo-realistic 3D images of junctions.View larger.Packed with FeaturesWhen you stop ogling the outside and really start using the 7100, what you notice is that Navigon has decided to avoid media support and instead has focused on navigation-based features. This means the 7100 is packed, offering an array of features that are, at the time of this writing, unmatched at this price point. It provides you with turn-by-turn directions, including actual road names via text-to-speech. It includes built-in Bluetooth technology that enables hands-free mobile phone integration, which not only increases driver safety, but is fast becoming a necessity as states pass laws against talking on a cell phone hand set while driving. It warns you when you are exceeding the speed limit. It offers 2D and 3D map views with incredibly precise road visualizations (more on that below). Its Navteq data contains millions Points of Interest (POIs) such as restaurants, hotels, golf courses, gas stations, banks, etc.Reality View and Lane AssistantThe 7100 has two features that are a great help in negotiating unfamiliar or complicated road systems. Lane Assistant recommends the best lane for you to be in relative to the proposed route, so you won't find yourself trying to move over three lanes when the freeway splits.Reality view guides you with photo-realistic 3D images of junctions, complete with actual sign text and exit ramp guidance. This makes translating what the navigator is telling you to what you see on the road instantaneous.Free Traffic for LifeThis is a biggie. The Navigon 7100 comes is the first GPS device to offer subscription-free, real-time traffic information via the integrated traffic receiver with no additional fees or setup for the life of the product. Be advised on traffic flow and incidents, as well as the best alternate routes. The traffic info starts working as soon as you get the 7100 out of the box.Zagat Ratings and Branded Icons for POIsAll of Navigon's gps navigators offer Zagat ratings and reviews for their POIs, so while this device may not get you a beer, it can tell you where to find the best one. Branded icons displayed on your map make it easier to navigate to a familiar location of your choice.Superior Software and HardwareThe features and functions of the Navigon 7100 are controlled via intuitive, easy-to-use animated menus that use predictive text input to quickly and easily select your city, state and address. Maps and menus appear on its extra-large and elegant, high-contrast 4.3-inch, full-color touch-screen display with an easy-to-read 16:9 aspect ratio for an exceptional view of the road. The Navigon 7100 includes a powerful Samsung 400 MHz processor, a fully integrated SiRF Star III GPS chip, 64 MBs of both RAM and ROM built in, and a rechargeable 1,200 mAh lithium ion battery that is rated for 4.5 hours of continuous use. All this is housed in an ultra-thin, sleek piano black housing that weighs only seven ounces, and measures just 5.1 x 3.5 x 0.9 inches (W x H x D). The Navigon 7100 even comes pre-loaded with complete maps of the U.S. and Canada, providing you with superbly accurate, seamless door-to-door directions wherever your vehicular travels might take you.Note that the 7100 runs on the Microsoft Windows CD Net 5.0 operating system. A PC is required to use additional map data, and in such cases users require Windows 2000, ME, XP or higher, as well as a CD ROM drive and a USB port. An SD/MMC card reader is recommended as the 7100 not only uses SD cards, but also comes with a 2 GB SD card in the package.What's in the BoxThe Navigon 7100 preloaded with North American maps, 2 GB SD card, car charger, wall charger, car mount, USB cable, CD and user manual on DVD, quick installation guide, and warranty information.About NavigonNAVIGON has been a leader ofGPSnavigation since 1991, and has a long history of industry innovations. NAVIGON created the world's first dynamic personalGPSproduct in 1996, launched the industry's first navigation software for thePocket PCin 2000, and unveiled the first Traffic Message Channel-based (TMC) avoidance feature on mobile navigation product in 2002.NAVIGON has helped revolutionize how consumers get from place to place with software products for practically any navigation-ready hardware. Personal navigation devices (PND), smartphones, and in-dash navigation systems directed by NAVIGON's award-winning MobileNavigator (MN) software delivers reliable information on millions of destinations in an intuitive, easy to use format. NAVIGON is a valued partner to the automotive industry, and in 2006 strengthened its category competency by acquiring NAVTEQ's navigation software business.NAVIGON is a privately-held software company based in Hamburg, Germany, with NAVIGON USA headquarters in Chicago, IL.", "title": "Navigon 7100 4.3-Inch Portable GPS Navigator", "price": 119.99, "imUrl": "http://ecx.images-amazon.com/images/I/51p7HXw4SwL._SY300_.jpg", "related": {"also_viewed": ["B001EJN9OA", "B000W6EUOE", "B00HK6CPVY", "B00BIZ0EY8", "B003ZHVBQM", "B00AXZY42W", "B0057ODOCA", "B007PPYXOC", "B005DIBH6A", "B00C9W1LT6", "B007M52QR6", "B00EE2CKWQ", "B005DIBH4M", "B004MYFTFG", "B007M4Z7GO", "B0015EWMX8", "B003FSTAG4", "B004MYFTFQ", "B005X4QCAA", "B0057OCDQS", "B00BHSTWOY", "B005DIBHA6", "B00AXZWG8Q", "B0057OCS9A", "B0057ODG6Y", "B003CYKYU2", "B001OAUP3W", "B00AY7NSTY", "B002ACBNXO", "B0066IUPS2", "B00AXX0I7Y", "B0050VEH1M", "B005DIBHCE", "B00HLYAI4Q", "B0008G1RSU", "B002OL2NT4", "B00AJXMWP4", "B002771V48", "B00A5ZFSZM", "B005HH35EY", "B00GD7DCW2", "B002GYVRXW", "B003FSTAFK", "B0014GBX64"], "buy_after_viewing": ["B005DIBHCE", "B00AXX0I88", "B00AXZWG8Q", "B001EJN9OA"]}, "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS"]]}