{"asin": "B0018YHZHI", "categories": [["Electronics", "Computers & Accessories", "Data Storage", "USB Flash Drives"]], "description": "Store, transport and access your PowerPoint presentations, photos and important work or school documents.  The HP v100w Flash Drive features a sleek and stylish black or white glossy design.  It provides easy access to your information in an affordable, convenient device.  Available in 1GB, 2GB and & 4GB capacities.Use it for work, for school and/or  for personal files.The HP v100w provides simple storage for files, photos and documents.The HP v100w USB Flash Drive (1GB, 2GB, 4GB)Read speed: Up to 16MB/sec.Write speed: 1GB = up to 4MB/sec.Write speed: 2GB & 4GB = up to 8MB/sec.Product OverviewPlug and play:the drive's USB connector fits in the USB port of your laptop or desktop PCDrag and dropan image, audio file, or data file, then plug into another PC's USB port and drag/drop again (at a transfer rate of 480 Mbps for USB 2.0 in burst mode)Carry it in your pocket;it's that smallGet peace of mindwith the two-year limited warrantyGet answersto product questions 24 x 7, toll-free, or via e-mail in as little time as an hour&mdash;at www.hp.com/go/totalcareProduct SpecificationsWeight:7.85 gSize:8.6mmH x       17.5mmW x 62.6mmLStorage Capacities:1GB, 2GB, 4GBOperating Voltage:4.4-5.25 VDCSystem Compatibility:Windows 2000, Windows XP,       Windows Vista; Mac OS: 10.5 aboveWarranty:2 years from the date of purchaseWhat&rsquo;s in the BoxJust the HP v100w USB Flash Drive in the capacity of your choice.* Please note: For Flash Media Devices, 1 megabyte = 1 million bytes; 1 gigabyte = 1 billion bytes. Actual usable capacity may vary. Some of the listed capacity is used for formatting and other functions, and thus is not available for data storage.** 1X = 150KB/second*** Number of photos may vary by camera setting and camera manufacturer.**** Actual number of songs may vary based on file format, compression settings, and song length.", "title": "HP v100w 4 GB USB 2.0 Flash Drive P-FD4GBHP100-EF", "price": 8.93, "imUrl": "http://ecx.images-amazon.com/images/I/4183bAQaucL._SY300_.jpg", "brand": "HP", "related": {"also_viewed": ["B001QVN9Y6", "B001O92JFK", "B001O96KSC"], "bought_together": ["B0043554TK"], "buy_after_viewing": ["B004TS1J18", "B007JR532M", "B0041Q38NU", "B007JR531I"]}}