{"asin": "B002BRYIJY", "description": "StoryNothing is as it seems in Square Enix's latest Action-RPG game, set in a crumbling world plagued by disease and dark, unrecognizable creatures. Players assume the role of the unyielding protagonist, NIER, resolute in his quest to discover a cure for his daughter, who is infected with the Black Scrawl virus. With powerful allies and a mysterious book, NIER encounters things that will confound even the mightiest of warriors.Battle to discover the truth about theBlack Scrawl, Nier's daughter...and himself.Unleash brutal combat moves along withdevastating combo attacks.Call on a remarkable array of stylishand powerful spells.With NIER, experience seamless in-battle cinematics and explore hauntingly familiar lands, intense action-packed battles, and storytelling like only Square Enix can do.FeaturesThe Next RPG from Square Enix:NIER, the newest franchise from RPG masters Square Enix, delivers unique and memorable characters, intense action-packed battles, explosive magic and storytelling like only Square Enix can.Unbelievable Story Twists and Reveals:Immerse in an amazingly intricate storyline set in a world plagued by human anguish, buried secrets and a ravaging disease. With plot twists hiding around every corner, NIER's story needs to be seen to be believed.RPG Gameplay Injected With Action-Packed Combat:Battle ferocious and mysterious enemies by combining proven RPG-style gameplay, such as magic, character development and faithful allies, with action-focused explosive swordplay and combat.Powerful Magical Abilities:When his sword isn't enough, Nier can call on a remarkable array of stylish and powerful spells to augment his combat moves and overcome adversaries. As players progress, upgraded spells will help defeat ever-more-deadly enemies.Brutal Combat Moves:Face off against evil creatures and unleash brutal combat moves along with devastating combo attacks. Unlock an arsenal of devastating weapons, each with its own design and attack style.Formidable Allies:Travel with a dynamic party of allies and do battle against monstrous giants as a powerful and united party.A Dynamic and Stunning World:Travel across an unforgettable world filled with dynamic landscapes featuring the hauntingly familiar remains of modern society.Product DescriptionJump into the title role of the unyielding Nier as he begins his desperate quest to discover a cure for his daughter, Yonah, who is stricken with the deadly Black Scrawl disease. Armed with powerful magic as well as mighty swords, Nier will battle alongside formidable allies against waves of dark enemies and giant bosses to discover the truth about the disease, his daughter...and himself.", "price": 39.99, "imUrl": "http://ecx.images-amazon.com/images/I/61jut9gKTaL._SY300_.jpg", "related": {"also_bought": ["B00J6DLPLK", "B00KVRK39A", "B002BRYHY0", "B0001A86EG", "B00KBD4SJA", "B0054INKOG", "B000CSUKY6", "B0016C3260", "B000UW1YBW", "B00K85X1TE", "B003O6HLOK", "B002I0J4AM", "B00B59MXGY", "B00KWFCU4M", "0804163448", "B001YHX4B0", "B00319DX4M", "B00KWF803C", "B001CRQY1E", "B00K6ZNX3K", "B00KWEHBAG", "B00IZ9T9QE", "B00K85X1W6", "B002AB7TX8", "B00KGFKGF8", "B004WL4LOY", "B007PNBU0Y", "B004LVO474", "B007IFMEYK", "B00KWJ4JW4", "B0030GBSUC", "B004HVKABW", "B00JQI471A", "B004P7VGF2", "B00BAWXCRU", "B003PHLT8W", "B00D87TCN8", "B00I3DOZ8O", "B00BY0G0YU", "B00KM66W54", "B00GOOSTJ0", "B00BJH11D8", "B003QX4F7C", "B00KWFY04A", "1616554827", "B002I0K7ZI", "B007A7UJ4S", "B00B67ZTUW", "B00H51BJ0C", "B00432O50W", "B00ANGVX9I", "B000ZJVDA2", "B002I0J45C", "B00I5LMSBK", "B00E8RVOFG", "B00GV4V8YQ", "0744012201", "B005VBVQDI", "B00GV4V8XC", "B00946FSIA", "B007V9QKH0", "B00H45K6KS", "B00DC7G1WE", "0804162980", "B004NRN5EO", "B003O6JIVE", "B00JSSP35W", "B002I0K2J4", "B00KS7UF96", "B00DVPMVIU", "B007FMSDUK", "B00KWIYPZG", "B0044SA734", "B00JXDJSD0", "B002I0J5FG", "0744015472", "B00DJ42BUQ", "B001UWGCW2", "B00JSSP35C", "B00K5UZMJO", "B00IA2O1DM", "B007B7BHJ8", "B00K5UZMGM", "B0045ZIEPY", "B001QTW2GY", "B00CTKHXFO", "B00H51BJBG", "B008SBZD5U", "B005TH6BD4", "074401543X", "B00KVMHSUM", "B00JUFT3HW", "B00KWIYS3K", "B0039QLEE8", "0804162867", "B00BJH11FQ"], "buy_after_viewing": ["B00J6DLPLK", "B0016C3260", "B002BRYHY0", "B002I0J4AM"]}, "salesRank": {"Video Games": 4273}, "categories": [["Video Games", "PlayStation 3", "Games"]]}