{"asin": "B00310PJM0", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Keyboard & Mouse Combos"]], "description": "Save space and avoid cord clutter! Verbatim's Wireless Slim Keyboard  Mouse features a space-saving design with low-profile keys that provide a crisp, responsive feel when typing. The sleek piano black finish on this ultra-slim keyboard offers a modern look that fits your workspace. With 2.4GHz wireless communications, there are no annoying delays in what you type versus what you see on screen. Music lovers can enjoy a media console that lets you control your favorite tunes directly from the keyboard. Great for saving space, this keyboard's slim design and wireless mouse help create a pristine desktop.FeaturesDesign- Ultra slim, this thin-profile keyboard and mouse enhance your digital lifestyle.2.4 GHz Wireless- Enjoy the latest in reliable hassle-free wireless technology.Media Console- Play, Pause... control your tunes from the convenient Media Console.Low Profile Keys- Quiet, soft-touch keys provide a crisp, responsive feel when typing.Slim Receiver- Connect and forget with the slim design of the wireless receiver.Warranty- One year limited warranty. Verbatim manufactures our products to meet strict quality standards. We stand behind the quality of our products and offer some of the strongest warranties in the industry.About VerbatimVerbatim provides technology you can trust-we've done so for over 40 years. Our products include an impressive selection of removable storage and computer peripherals, featuring a wide range of highly acclaimed CD, DVD and Blu-ray media products. Verbatim also offers an array of lightning fast desktop and portable hard drives, USB flash drives, memory cards, stylish, feature-rich mice and keyboards and a broad range of replacement laser toner cartridges. Buy Verbatim and you get innovation, security and reliability-and that means peace of mind.Tips for Getting StartedUsing your new Wireless Slim Keyboard and Mouse is easy:1. Insert (2) AAA batteries into the keyboard and (2) AA batteries into the mouse.2. Plug receiver into USB port3. Install software and complete introduction.Now you're ready to use your new keyboard and mouse.What's in the BoxKeyboard, Mouse, Receiver, 2x AA Batteries, 2x AAA Batteries, Software CD, Quick Start Guide", "title": "Verbatim Wireless Slim Keyboard and Mouse, Black 96983", "price": 40.75, "imUrl": "http://ecx.images-amazon.com/images/I/412v17RxpFL._SY300_.jpg", "brand": "Verbatim", "related": {"also_bought": ["B000BC8USQ", "B00BP5KOPA", "B005HNHRA6", "B003VANO7C", "B009K1PYFG", "B005BZNDS0", "B005BZNDOO"], "bought_together": ["B005BZNDS0", "B00BP5KOPA"], "buy_after_viewing": ["B005HNHRA6", "B00BP5KOPA", "B003VANO7C", "B00EQ32YPG"]}}