{"asin": "B001TK3ACA", "description": "Enjoy full-spectrum stereo music and take your calls wirelessly with the Plantronics BackBeat 906 Bluetooth headphones set, which includes the Plantronics 903/R US Bluetooth headphones plus a Bluetooth adapter.  With the included Bluetooth adapter, these ultra-comfortable wireless headphones let you stream rich stereo music from your iPod, iPhone or other music device, while smart dual-mic AudioIQ voice technology offers exceptional clarity for your cell calls. And with a quick tap of the headphone's OpenMic button, you can immediately hear what's going on around you without removing the headphones.The included Bluetooth adapter lets you use the BackBeat with iPods and other MP3 players without built-in Bluetooth.View larger.Wireless Freedom to Listen to Music and Talk on the PhoneWhether you are working or playing, walking or running, the BackBeat 906 lets you take your calls and stream and control your music via a convenient wireless Bluetooth connection. It connects to your stereo Bluetooth-enabled mobile phones and MP3 players to give you a rich, clear wireless music and cell phone experience. For music players like the iPod that don't have built-in Bluetooth, simply connect the included Bluetooth adapter into the 3.5 mm jack to experience the same exceptional sound wirelessly.(If you plan to use the headphones exclusively with Bluetooth-enabled devices and don't need the Bluetooth adapter, check out theBackBeat 903, which offers all the great features of the BackBeat 906 but doesn't include the adapter.)Outstanding Audio and Call QualityThanks to the Altec Lansing sound technology, dual 14 mm speakers and bass-boost feature, you can enjoy your music in full-spectrum stereo for a rich audio experience. And when it's time to make or take a call, the headphones feature dual-mic AudioIQ, an advanced digital signal processing technology that dramatically improves the audio levels on both ends of your call, giving you superb call clarity and performance. So whether you're listening to your tunes or taking an important call, the BackBeat 906 has you covered.Control Your Music RemotelyThe headphones feature an easy-to-access set of dedicated controls that give you full control of your music and call functions, including play/pause, bass boost, call mute, and volume and track control (for devices supporting the AVRCP Bluetooth profile).Bluetooth makes for easy wireless connections and AudioIQ ensures great call quality.Adjustable Design for All-Day ComfortDesigned for comfortable, all-day wear, the BackBeat 906 features contoured earbuds that are made of flexible material that comfortably conform to the shape of your ear. The headphones weigh just 1.2 ounces and offer telescoping and swiveling adjustments for a personalized and secure fit. And for further convenience, the soft neckband folds for easy storage in a pocket, purse, or bag.Rechargeable Battery Offers Long Listening and Talk TimeThe rechargeable battery delivers up to seven hours of talk/music playback time and has a standby time of up to eight days. It takes just three hours to fully charge the headphones.Keep an Ear Open to the World Around YouThe BackBeat 906 is also equipped with OpenMic technology, an ingenious feature that lets you hear all the happenings around you without taking off your headphones. By simply pressing a button, the microphone will pick up outside sound and feed it through the speakers, so you can fully engage in a conversation or simply listen to your surroundings.The Plantronics BackBeat 906 is backed by a one-year limited warranty.What's in the BoxBluetooth headphones, 3.5mm Bluetooth adaptor, AC charger.", "title": "Plantronics BackBeat 906 Stereo Bluetooth Headphones Set [Retail Packaging]", "price": 47.99, "imUrl": "http://ecx.images-amazon.com/images/I/41OFTI12v1L._SY300_.jpg", "related": {"also_viewed": ["B00AFGP5MM", "B00428N9OK", "B001TK3AC0", "B00G4EEYDA", "B00KJLMBSO", "B00KJLMBQQ", "B000NKCO5Q", "B00DIOALPE", "B0046W2MKY", "B00AN5GBR8", "B00DIOAM4Y", "B007MC6WGK", "B009M27MB2", "B005FVNHBI", "B004QITD5U", "B008MUY48E", "B008JH6HJE", "B00DIOALYA", "B00DV9O0GC", "B00AIRUOI8", "B0041DECI8", "B0095P2F1S", "B00E5HXJEI", "B00ISRUFXY", "B004X2IHN8", "B0089V4ZGM", "B006B9GRM4", "B00FS7BSSS", "B00ED53MTY", "B00HAV75GE", "B00858I5OC", "B00I16BXOC", "B005MLPQGK", "B00EVNVR2W", "B00DDCHIM0", "B00DIOALWC", "B000J3G2CS", "B005LISQ0W", "B00858I53S", "B00JX5Q53O", "B009S4FKTA", "B00560YMPI", "B0092MD7CK", "B004T0CEBK", "B00ISRUFSY", "B008DKCVQU", "B00FAYFDYE", "B00HHGT0Y2", "B00I6YR6E0", "B00DNJORL8", "B004QWOSLK", "B006Q2K7HC", "B00GYI91G6", "B00IL7B2YM", "B00JA5JYR6", "B00B6ZGSVI"], "buy_after_viewing": ["B00AFGP5MM", "B00428N9OK", "B00DIOAM4Y", "B0041DECI8"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]]}