{"asin": "B0030GBU2I", "description": "Embark on an adventure to an exotic land and unleash your legendary moves on enemies as the acclaimed Prince of Persia: Sands of Time story line makes its return. Unfolding with the mystery and powerful narrative that have become classic elements in this series, Prince of Persia: The Forgotten Sands challenges you to unleash powerful offensive attacks and destroy your enemies. Race against time in an unforgiving world as you experience the return of the vaunted Prince of Persia..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; text-align:center;} ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } img.withlink {border:1px #777777 solid;}Stunning visuals.View larger.Cinematic storyline.View larger.Confront the danger.View larger.Battle against enemies determined to take you down.View larger.SynopsisJourney to a land of legendary combat and mysterious circumstances in this new installment to the Prince of Persia: Sands of Time franchise. Prepare yourself for impossible battles and know that you will come face to face with death as you engage in deadly combat. Experience many of your favorite elements from the original series as well as new gameplay innovations. The mystery and magic of the old-as-time fight between good and evil comes to life with all its rewards and consequences in Prince of Persia: The Forgotten Sands.Features:Latest installment in the&nbsp;Prince of Persia: Sands of Time story lineEncounter enemies determined to take you downConfront the danger that lurks around you in a land of mystery and intrigueUnleash powerful offensive battle measures against opposing forcesFace off against well-matched enemies in battles of deadly significance", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51ptmTC8k%2BL._SY300_.jpg", "related": {"also_bought": ["B001ASJIS6", "B0012N746W", "B005DVAB0A", "B002I0J5JW", "B001D7T2VC", "B00319DX4M", "B009GZX49Y", "B004BCZLQ6", "B006JKAS16", "B007SRM5U6", "B004UDB9SA", "B004EQCCI4", "B003C1I06U", "B0055202HE", "B0047TLIBU", "B000UW21A0", "B003O6HLOK", "B003O6ECOM", "B0030F1DOO", "B00320JAWY", "B003O680RM", "B0012N5MIO", "B002EZH804", "B003O6G1L4", "B008CP6Q6M", "B000IONGWW", "B0050SX3KG", "030746881X", "B002DC8GKO", "B000JLIXI6", "B000WS97QI", "B000FQ2DTA"], "bought_together": ["B001ASJIS6"], "buy_after_viewing": ["B001ASJIS6", "B009GZX49Y", "B008CP6RWU"]}, "salesRank": {"Video Games": 7147}, "categories": [["Video Games", "PlayStation 3", "Games"]]}