{"asin": "B0018YXM3Y", "description": "Call the shots in epic battles all over the world and expand your realm of influence throughout the tumultuous eighteenth century with Empire: Total War for your PC. Set against the bold intellectual landscape of the Enlightenment, this extension of the Total War franchise brings you out of the middle ages and into a realm where guns, gunpowder, and naval warfare have a dramatic influence on the face of combat..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; } img.withlink {border:1px #777777 solid;}Realistic landscapes and weather add drama to your campaigns.View larger.Dynamic, 3D naval warfare expands the combat zone.View larger.For the first time, North America is open as a field of battle.View larger.Ships boast destructible sails.View larger.Historic Factions, Expanded Horizons, and an Updated Campaign MapTotal War's detailed, turn-based battle system has received some serious upgrades that will have an impact on both seasoned commanders and newly minted combatants. The UI has been streamlined, and the systems for handling trade and diplomacy have been updated. You have improved advisors at your disposal, and realistic espionage techniques can be carried out using agents.Empire puts a variety of major political factions into your hands, including France, Spain, Great Britain, Sweden, the United Provinces in northern Europe, Prussia, the Ottoman Empire, and Russia. Detailed strategic elements come into play, whether you're fighting in the heart of Europe, warding off Mamluk horsemen in the middle east, or working to capture the wealth of India. Beyond all this, for the first time in Total War history, the continent of North America is an open field of play that portrays the unique strategic problems encountered by the founding fathers during the revolutionary war.Dynamic 3D Naval Battles and Forces of NatureTotal War's signature 3D battle scenes are paired with a new graphics engine and improved technology, allowing war and conquest to take on an even more realistic feel. Advanced landscape and flora systems add both realism and depth to the world stage, while dynamic weather consistently threatens to throw a wrench in your attack plans.Whether you're coordinating platoon firing or supporting a defensive square formation, the musket and the cannon take center stage as newly developed implements of war. And they're not just for use on land. Real-time naval battle set on dramatic seascapes help shape the balance of power and determine the scope of your Empire, and they're rendered in the same impressive 3D as battles on land. You may find yourself directing a vast fleet through intricate maneuvers, controlling the helm of a single tall ship, or grappling to the enemy's boat and dictating the course of hand-to-hand combat on deck.New Multiplayer ActionAdditional updates to the Total War model include a multiplayer component that provides player rankings for competitive commanders, leagues and ladders, and a selection of entirely new modes of game play.", "price": 10.0, "imUrl": "http://ecx.images-amazon.com/images/I/51OSimuo6EL._SY300_.jpg", "related": {"also_bought": ["B002M78NM6", "B000YQ639M", "B00AQ2BLI2", "B000E2D3LC", "B002RD6MV4", "B000FUONLM", "B001HL3Q70", "B00BQZ5EWW", "B000PIRVQI", "B000FJSIUA", "B0002MPT6Q", "B004DDIYP8", "B001QZGVEC", "B006JSXVA8", "B003OZOAKY", "B004CZZZXQ", "B006ZPAYJ6", "B005M0KSIM", "B0000CFU9U", "B0041G5SD8", "B00BZOBE78", "B005IOJ6US", "B0067G555G", "B00GPH7Y8S", "B003F40MUQ", "B00022Q0RI", "B000U850P2", "B000SOYG8U", "B0038TT8QM", "B003DU7AW0", "B001DF1AM8", "B003BJ09QM", "B002SKDIKE", "B00BY0G7IE", "B0007LWMRG", "B00125UHJ6", "B000J18SR2", "B00GPH7W6W", "B0002UEDPG", "B006NU6M5S", "B00001LDCK", "B000P5BSUQ", "B00BQZ5F6C", "B001CWXAP2", "B002GJMGNM", "B008IYCVK2", "B001NJ296A", "B007FTE2VW", "B007C72F2U", "B008H0CM42", "B0020KY02M", "B00005N9A7", "B0007GBBHI", "B000ZMYZWC", "B000AOIES6", "B002XNW6T0", "B000VWWKRI", "B001BBS8B0", "B005OM6CGU", "B002CUWS7O", "B000EDPQMU", "B004JQK2E0", "B000BNKSVC", "B002AK6U8E", "B000FU4PME", "B00004ZB2I", "0700026657", "B002PAIPQO", "B005FYK2PO", "B00GD774N0", "B000Q56VHK", "B00GPH7W26", "B0095C0I4W", "B00273Y7V6", "B000PWWL64", "B00005V9QE", "B000DZH8ZC", "B000Q8UPKQ", "B0093GL8Z8", "B000U92L8A", "B00E8G5H0K", "B000WMEEAI", "B000PS2XES", "B00026D14Y", "B00004TTHT", "B00001IVRD", "B000MNI5Q6", "B0047THYWC", "B0006TNCHS", "B00D7CGFC0", "B001RQWJ2S", "B000BCICQ6", "B00A8306C6", "B003GSZAOY", "B001AZFSDI", "B000X25GX6", "B003FHAVLI"], "bought_together": ["B000YQ639M", "B00AQ2BLI2"], "buy_after_viewing": ["B0041G5SD8", "B000YQ639M", "B000E2D3LC", "B00AQ2BLI2"]}, "salesRank": {"Video Games": 3305}, "categories": [["Video Games", "PC", "Games"]]}