{"asin": "B000V4VGBM", "description": "Amazon.com Product Description Magellan Triton reinvents handheld GPS. Amazingly easy to use, Triton 500 is perfect for the first-time GPS user. And the full-color display, SD-card compatibility, enhanced features, fast signal acquisition, reliable signal lock and precision positioning make Triton 500 an excellent choice for the advanced navigator.The next-generation handheld GPS for precision outdoor navigation.Click to enlarge.Simple menus, instant access buttons, intuitive scroll pad and crystal clear graphics let you navigate with ease.Click to enlarge.See your direction of travel, distance and position of destination, heading, bearing, speed and more on the beautiful graphic compass screen.Click to enlarge.Ready to guide you on any adventure.Click to enlarge.The smartly designed interface with simple menus and intuitive button and scroll pad control make navigation fun and effortless. The full-color crystal clear display shows all your maps and navigation information in brilliant, easy-to-view graphics. Instantly see all your maps, locations and saved tracks and waypoints with just a click or two. Unlike other complicated devices that require you to scroll through page after page, Triton 500 gets you to the information you want with a few keystrokes.SD-card compatibility maximizes your navigation capability. Add an unlimited amount of marine cartography and topographic maps navigate all your outdoor, boating. Plus, Triton is the first handheld GPS to offer compatibility with National Geographic TOPO! State series and Weekend Explorer 3D maps. These highly detailed nation-wide topographic maps based on USGS 1:24.000 series quads, offer seamless scalability, multi-layer overlays and much more.Exclusive VantagePoint software enables easy management of maps, user generated content, updates and upgrades on your PC. View saved routes and tracks. Customize them for future trips or create new ones.Triton is designed for precision navigation, offering the fastest GPS positioning acquisition in the industry with the SiRFstarIII chipset. An integrated high-sensitivity antenna provides reliable signal reception even in heavy cloud cover, canyons or deep woods. Built-in signal augmentation reception (WAAS/EGNOS) provides 3-meter accuracy.Rugged and waterproof, your Triton 500 is built to withstand intense use, accidental impact and immersion in one meter of water for up to 30 minutes (IPX-7). It's ready to guide you on any adventure.The advanced features are also easy to use. View the elevation profile for the trail ahead (or any route) or even the track you just traveled. See the precise time of sunrise/sunset any day of the year. Get a calculation of the best hunting and fishing time. And much more.Triton is built on the experience of hundreds of thousands of GPS users and nearly 20 years of precision positioning technology from Magellan: the first name in navigation.Magellan Triton 500 FeaturesAmazing ease-of-useReinventing handheld GPS, simple menus, instant access buttons, intuitive scroll pad and crystal clear graphics let you navigate without the need for a Ph.D.3-axis electronic compassClearly see your direction no matter how you hold your GPS, even when standing stillSee your direction of travel, distance and position of destination, heading, bearing, speed and more on the beautiful graphic compass screen.BarometerSensitive barometric pressure readings offer advance notice of changing weather and assists in providing accurate elevationFull-color 2.2\" displayThe large display shows maps, simple menus, navigation screens and other data in brilliant color.SD-card compatibilityAn invaluable feature enables you to use an unlimited amount of map data for topographic and marine navigation.Add detailed mapsUpload optional marine cartography, topographic maps, and more, including the highly-detailed and feature-packed National Geographic TOPO! State series and Weekend Explorer 3D maps to your own SD cards.Built-in mapsBasemap of the 48 contiguous United States, Alaska, and Canada (major highways, city centers, bodies of water and more) plus worldwide geographic boundaries.Access exclusive VantagePoint softwareLets you easily manage user generated content, updates and upgrades on your PC. View saved routes and tracks. Customize them for future trips or create new ones.3-meter accuracySiRFstarIII chipset and integrated multidirectional antennae offer superior GPS accuracy using the Wide Area Augmentation System (WAAS).What's in the BoxTriton 500 GPS receiver, Quick reference guide, manual on CD-ROM", "title": "Magellan Triton 500 Waterproof Hiking GPS", "price": 189.99, "imUrl": "http://ecx.images-amazon.com/images/I/51Sj5aOrpbL._SY300_.jpg", "related": {"also_viewed": ["B00542NVDW", "B004JU0E2G", "B000V4TMWC", "B006ZGB58Y", "B003CYKYVQ", "B002G1YPIE", "B002G1YPIO", "B003Y5H17I", "B00542NV32", "B002MHH9DA", "B00542NVS2", "B00313JX4W", "B0062NEHOO", "B000064184", "B000V4PXSY", "B003XU78OU", "B00313JX56", "B003IHV6XW", "B000BGVYYE", "B000058BCQ", "B00AXUXRUC", "B0029LDDPM", "B00128HHZA", "B007QS4YG0", "B0029LL5IY", "B003IHV6Z0", "B0055NQWZO", "B003IHV6YG", "B002QBSYOA", "B003XU78PE", "B0055NQXB2", "B00HS4EBQA", "B00B2F4O86", "B000V4S6YM", "B00AXUXRVG", "B000066TPO", "B000OEZSXQ", "B002EOSQII", "B00029TN9S", "B00192GL10", "B000PDR1LS", "B000PDR230", "B000PDR27G", "B007QS4YFG", "B007QS4YGK", "B007QS4YF6", "B0047ZG1LQ"], "bought_together": ["B000V4TO2A", "B000V4PZ2S"], "buy_after_viewing": ["B00542NVDW", "B000V4PZ2S", "B003IHV6Z0", "B004JU0E2G"]}, "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]]}