{"asin": "B000L475L2", "description": "MacBook is perfectly designed for your mobile lifestyle--with Intel Core 2 Duo processors, 1 GB of memory, and larger hard drives in all models. There's also a slew of innovative features, including a built-in iSight camera for video chatting on the go, iLife '06, Front Row, a glossy 13-inch widescreen display, and even dual-display support.MacBooks come with an Apple remote.Better bang-to-buck ratioThe most advanced and affordable Mac notebook ever gives you a blazingly fast mobile architecture in a beautiful design that costs less than slower, clunkier models. It's like getting a sports car for the price of a scooter. Talk about performance--MacBook is powered by an Intel Core 2 Duo processor with speeds revving up to 2.0 GHz. And all models pack a performance-enhancing 4 MB of shared L2 cache.Pack more punchIn bright white or sleek black, MacBook supports up to 2 GB of memory and plenty of storage. That's not all. MacBook keeps you untethered courtesy of built-in Bluetooth and AirPort Extreme 802.11n Wi-Fi offering up to five times the performance and up to twice the range as the previous generation. An 8x double-layer-burning SuperDrive--standard equipment on the 2.16 GHz models--not only lets you burn DVDs faster but lets you burn capacious double-layer media.The magnetically connected MagSafe power adapter breaks cleanly away, without damage to either the cord or the MacBook, if you trip over the cord.Friends for iLifeEvery MacBook comes with iLife '06--an amazing suite of applications that make it easy to live the digital life. Use iPhoto to share entire high-res photo albums with anyone who's got an email address. Record your own songs and podcasts with GarageBand. Break into indie filmmaking with iMovie HD and iDVD. Then take all the stuff you made on your MacBook and share it on the web in one click with iWeb. Just turn on your MacBook and you're halfway there.iLife comes with iPhotos, which makes sharing photos faster, simpler, and cooler than ever before.All smilesLook closely. See that little lens in the display bezel? That's the built-in iSight camera. Use it to video chat simply by opening iChat AV and clicking a buddy icon (or three). Or fire up Photo Booth and take a few snapshots with the iSight, play around with 16 fun effects, then admire your handiwork. That little camera lets you create web-ready videos, too. Just open up iMovie and start the action. From there, iWeb makes it one-click easy to get your talking head on the web. Looks like fun.Take it on tourMacBook also features Front Row, so you can navigate your movies, music, photos, and more at the touch of the included Apple Remote--no matter where you roam. Give an impromptu vacation photo slideshow in your favorite caf&#xE9;. Screen your latest iMovie creation on the train. Watch a DVD in bed. MacBook and Front Row give you the best seat in the house (or out of it).Positively brilliantThanks to a 13.3-inch glossy widescreen display, MacBook provides the perfect combination of pixels and portability. Photos feel crisper. Movies play vividly. Even daily tasks like surfing the web and checking email take on a whole new sheen.Hit the hot spotsThe built-in wireless capability of MacBook puts the \"world\" back in \"World Wide Web\". If there's a wireless hot spot nearby, you can get online. No need to waste valuable surfing time configuring your computer. Just open it up. MacBook automatically detects wireless networks within range and asks nicely if you'd like to join any of them. That's it. Catch up on your blog, share this weekend's trip as a Photocast, or just chat with your friends. Anytime, anywhere.", "title": "Apple MacBook MB062LL/A 13.3&quot; Notebook PC (2.16 GHz Intel Core 2 Duo Processor, 1 GB RAM, 120 GB Hard Drive, 8x SuperDrive) White", "imUrl": "http://ecx.images-amazon.com/images/I/41J7r75FfrL._SX300_.jpg", "related": {"also_viewed": ["B004FK3QWK", "B002QQ8EKO", "B002C7489S", "B00578N1JM", "B0013FLU96", "B0000U9H40", "B001CGHH98"], "buy_after_viewing": ["B004FK3QWK", "B003V0NXBO", "B004NELCLU", "B005I19YHG"]}, "categories": [["Electronics", "Computers & Accessories", "Laptops"]]}