{"asin": "B00021EE4U", "description": "The latest version of the venerable Tamron 90mm Macro, this lens is widely used by naturalists and other pros who need top imaging performance plus a longer lens-to-subject (working) distance to enable easier lighting and access to skittish subjects. Improved resolution, chromatic correction, and coatings make it a superb choice for full-frame or APS-C format SLRs. Tamron introduces a new version of the famous 90mm macro lens for film and digital photography. Tamron's 90mm macro lens, often referred to as \"the portrait macro\" and loved by photographers all over the world, is now reborn as a Di lens that is perfect for use with both film and digital cameras.Easier lighting and access to skittish subjectsSP AF90mm F/2.8 Di FeaturesPortrait macro shotDIDigitally Integrated Design (DI), is a designation Tamron puts on lenses featuring optical systems designed to meet the performance characteristics of digital SLR cameras.Super Performance (SP) for Discriminating ShootersTamron SP (Super Performance) series is a line of ultra-high-performance lenses designed and manufactured to the exacting specifications demanded by professionals and others who require the highest possible image quality. In creating SP lenses Tamron&rsquo;s optical designers put their foremost priority on achieving superior performance parameters&mdash;they are all designed to a higher standard with little regard for cost constraints. As a result, Tamron lenses bearing the SP designation feature impressive and innovative designs that have established an enviable reputation for excellence among those knowledgeable photographers that demand the very best.Auto-focus/Manual-focus (AF/MF) Switch Mechanism on the Focus RingThe ability to switch quickly between auto-focus (AF) and manual-focus (MF) is a great asset in many types of shooting, especially sports and nature photography. This is easily accomplished with Tamron&rsquo;s ingenious AF/MF system. By simply sliding the focus ring back and forth between the two positions you can select either the AF or MF focusing position. In manual-focus mode Tamron lenses provide smooth, precise manual focusing by turning their wide, well-textured focusing rings.Quicly switch between auto-focus (AF) and manual-focus (MF)", "title": "Tamron AF 90mm f/2.8 Di SP AF/MF 1:1 Macro Lens for Nikon Digital SLR Cameras", "price": 399.99, "imUrl": "http://ecx.images-amazon.com/images/I/41dX9aJJbgL._SX300_.jpg", "related": {"also_bought": ["B00004ZCJH", "B00AEEDRFM", "B00064XR64", "B005KJZGYQ", "B0031AQ302", "B00009R6K1", "B0095ZKUD8", "B00007EDZG", "B0000BZL4X", "B00004ZCC1", "B009SJ7UWU", "B001955P8W", "B00FXYT12G", "B0045TYDNC", "B001S2PPT0", "B0042X9L6A", "B001542X64", "B007RZB3KM", "B00F5JV4NS", "B001KNDZHQ", "B00I44F5LS", "B00005LEN4", "0881928909", "B00A35X8ZG", "B0042X9LC4", "B005TCJJ9M", "B0012UUP02", "B0045KGZOG", "B001G4NBSC", "B00004X10B", "B002L6BXYI", "B000JG88JU", "B0012GDOQS", "B00005LE72", "B006TAP096", "B003LYF5P2", "B003XDU2Y0", "B00603RYG4", "B005FRI50K", "B004Y1AYAC", "B0050YG3CU", "B0096TO2M8", "B007ORX8ME", "B001FB6PJI", "B007NCCIJY", "B001ET5U92", "B00156OZ68", "B0007U00XK", "B000A40M22", "B00CXM03D2", "B0013A1XDY", "B003L1ZYZ6", "B007VGGIB6", "B008XW7T8I", "B0015MHY6K", "B000KZ70JE", "B003TYDBYQ", "B009DJ1OFY", "B00004ZCI3", "B0014Z5XMK", "B0069R7FFQ", "B00BXA7N6A", "B000T95Q1U", "B004YW79F4", "B00017LSPI", "B003Y30334", "B001A472LA", "B0002J2TLC", "B000JLM50I", "B002ZIMEMW", "B00004ZCB5", "B0080JH3YE", "B003Y5T464", "B001F6TXME", "B008RBD2YA", "B00795A63A", "B003YH9DZE", "B002VPE1WK", "B00BI9X7UC", "B0076AYNXM", "B000A1SZ2Y", "B00004ZCJK", "B00004ZCJJ", "B0083WYEHC", "B003ZSHNCC", "B001GCVA0U", "B007NDL56A", "B005K1Y4I8", "B000BYCKUI", "B000HJPK2C", "B009DJ1THW", "B0049H89F8", "B00906D9YE", "B00AXZZ034", "B0056MPWZU", "B002DW99H8", "B006T4UUN8", "B00796I546", "B0048IW030", "B005ODKGLG"], "buy_after_viewing": ["B000CMNL52", "B000EOSHGQ", "B0048IW030", "B00AEEDRFM"]}, "categories": [["Electronics", "Camera & Photo", "Lenses", "Camera Lenses", "Digital Camera Lenses"]]}