{"asin": "B000KLNLUK", "description": "A new kind of weapon for a new kind of hero.Dark Sectoris a third-person Action/Shooter that thrusts players into a sci-fi flavored nightmare scenario set in the post Cold War era. Playing in the role of Hayden Tenno, an unscrupulous covert operative sent on an assassination mission into Lasria &#150; a fictional Eastern European city on the brink of ruin and rumored to be contaminated by a mysterious and frightening plague, Hayden takes out his mark, but before he can escape is attacked by an unknown enemy. Not killed outright as expected, he is instead infected with the virus that is causing the plague.New weapons, a new heroHayden Tenno and his glaive.View larger.Hone your skill with the glaive.View larger.Take on enemies the old-fashioned way.View larger.Duel-wield glaive &amp; gun.View larger.The Technocyte Virus and Hayden&#146;s EvolutionJust as with the other victims swarming the street of Lasria, the Technocyte Virus imbues Hayden with powerful, inhuman abilities. These abilities are not static and as they progress they cause severe, accelerated pain; pain that eventually drives their hosts insane, turning them quite literally into monsters of superhuman power. Hayden possesses an unexpected resistance to this maddening pain, but his body is not spared the mutations caused by the virus. The first of these are metal armor that grows from his body and a three bladed, throwable weapon called a \"glaive\" which explodes from his right arm and can regenerate if lost. But these are only the beginning. Eventually players may also gain the power of limited invisibility, the use of a bulletproof shield and an assortment of deadly melee attacks.As Hayden slashes his way through the mutants overrunning Lasria he stumbles upon a plot by a rogue operative and his private army of henchmen to harness the power of the strongest of these mutants for some dark purpose. No longer entirely human, but not a mindless mutant Hayden must make a decision whether to use his own new powers to stop this plot or look the other way. But regardless of his choice, he has become the target of both the blind rage of his fellow mutants and a shadowy paramilitary group that seeks to control them.Weapons: Glaive, Guns and the Black MarketDark Sectoris far from the traditional third-person shooter. The glaive is the game&#146;s signature weapon and as players gain experience they will come to see that it is not only a stylish weapon, but also much more versatile than the traditional firepower available in-game. It is of course deadly as a slashing weapon and can be thrown great distances, but as Hayden&#146;s powers evolve the glaive can be used in unexpected ways, ranging from siphoning and focusing elemental features like fire and freezing cold on enemies, to opening doors and retrieving items from inaccessible areas. But this doesn&#146;t mean that players can shun the conventional weapons scattered throughout the game, quite the opposite.To be successful players must successfully journey underground to the game&#146;s &#145;black market&#146; where they can purchase new weapons with scavenged rubles and also upgrade their existing weapons. Some of these upgrades include increasing a weapon&#146;s firing rate, larger ammo clips, the ability to fire two simultaneous rounds and a &#145;puncture ability&#146; that allows you to shoot through any enemy to hit another standing behind him. Finding the entrances to the black market are important because firearms in the game are biologically sensitive to mutant powers and unless altered to ignore the existence of altered DNA are useless to the mutated Hayden.Gameplay Modes and FeaturesNot only doesDark Sectorcontains a deep singleplayer story mode, but in addition it features multiplayer functionality allowing players to harness Hayden Tenno&#146;s mutant powers in two different ways, both in awesome 10-person online multiplayer combat. The two modes include:Infection Mode: Think of this as &#145;tackle the guy with the glaive.&#146; In this timed mode one player assumes the role of a fully-powered Hayden Tenno, complete with shield, invisibility and melee capabilities, while the other nine play as human operatives trying to kill him and take his place. The player in the role of Hayden receives a single point for each kill made, while the soldier that takes him down gets 2, plus the right to wield the glaive in the next go around. Players making assists in the slaying of Hayden receive one point as well. The player with the most points at the end of the round wins.Epidemic Mode: In this team-based mode, with a set number of rounds per match, two teams, each made up of one Hayden and a group of soldiers, battle to kill the other team&#146;s Hayden. A single point is awarded to each team per kill of the opposing Hayden. Each Hayden begins at full strength and the team with the most points at the end of the round wins.Other features available in both multiplayer modes include voice chat and global leaderboards.The Birth of a SuperheroWhether in singleplayer or multiplayer modes the developers ofDark Sectorhave endeavored to link every action of the player to the mutant evolution of Hayden Tenno. This means that as players progress through the game defeating bosses as well standard enemies they increase Hayden&#146;s mutant abilities and advance his disease. It&#146;s a catch-22 that with every victory Hayden becomes less human, but one that the game&#146;s storyline relishes as the one-time hitman slowly and unsurely morphs into a hero.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51zGzyB741L._SY300_.jpg", "related": {"also_bought": ["B00170823O", "B000K9OR4Q", "B000R3CIV4", "B000ZK7ZOY", "B002DC8GKO", "B001ASJIS6", "B00319DX4M", "B00104KCF8", "B002BRZ744", "B000SQ5LQE", "B000K9OP2A", "B000QAVV6G", "B001D7T2VC", "B004UDB9SA", "B000HCJD68", "B000WS97QI", "B007UM599S", "B000N4MSAS", "B003O6G1L4", "B000HGOHWO", "B003DLQTYY", "B005185SDA", "B002I0K6DG", "B00139RPNC", "B000FPOJOS", "B00320JAWY", "B0030GBU2I", "B002EZH804", "B002BXJ9VA", "B004L5SJ58", "B000ZK7ZOE", "B001C4DKG4", "B0012NAPNQ", "B001COV1CY"], "bought_together": ["B00170823O", "B000K9OR4Q"], "buy_after_viewing": ["B005185SDA", "B00170823O"]}, "salesRank": {"Video Games": 5860}, "categories": [["Video Games", "PlayStation 3", "Games"]]}