{"asin": "B00007KDVK", "related": {"also_bought": ["B0027Q4HXG", "B003CH77YK", "B0009FV7J4", "B00008I9K8", "B00C537BJI", "B003CH3V0Y", "B002BSN5TC", "B00006B7CG", "B000COOMLW", "B003CHANJG", "B004Y6SS5U", "B00C53GXWO", "B0002AFU4E", "B002K4BUS0", "B00005NWV1", "B001QWW0D6", "B0018LIOIA", "B001SGY3A8", "B000BI23V0", "B005JB0H3U", "B0036DDXUM", "B0026K9KLC", "B000FFLYI2", "B0026K5SVS", "B008AQQABY", "B008BZBMO4", "B000ARMP88", "B001MRVGYY", "B000VRZ7PA", "B0006ZU9GY", "B006CQR7CK", "B00066IO2O", "B00461G3MS", "B002V15VHI", "B000RMPP5G", "B001QWQ78A", "B008IFXQFU", "B003MTTJOY", "B005OPYH7I", "B001MQ4P6G", "B000MUTAGS", "B004LT8MN8", "B0002VAQR4", "B0079XWMEI", "B0065SMVVW", "B00E9MD700", "B00DBA6SNY", "B00006B8E3", "B001MQ4Q06", "B001OORMVQ", "B00C9TECFO", "B000W8UIZW"], "bought_together": ["B0027Q4HXG", "B003CH77YK"], "buy_after_viewing": ["B008IFXQFU", "B000FFLYI2", "B0027Q4HXG", "B000ADKTRG"]}, "title": "Cisco-Linksys WPC54G Wireless-G Notebook Adapter", "price": 1.69, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/4100TY8AYKL._SX300_.jpg", "brand": "Linksys", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Network Adapters", "Laptop Network Adapters"]], "description": "Amazon.com Product DescriptionEarly Adopters Pick, January 2003. The first high-speed wireless networking PC card for laptops to use the 802.11g standard, which is four times faster than the current standard (802.11b) and backwards compatible.The new Wireless-G notebook adapter (PC Card adapter) from Linksys has both the 802.11b and newer 802.11g standards built in, so you can connect your notebook to existing 802.11b infrastructure and also the new, fast Wireless-G networks. The included setup wizard walks you through configuring the adapter to your network's settings, step by step. Then just slide the adapter into your notebook's PC Card slot and enjoy network access with your notebook computer, while retaining true mobility.Wireless-G is the 54 Mbps wireless networking standard that's almost five times faster than the widely deployed Wireless-B (802.11b) products that are found in homes, businesses, and public wireless hotspots around the country. But since they share the same 2.4 GHz radio band, Wireless-G devices also work with existing 11 Mbps Wireless-B equipment.Once you're connected, you can keep in touch with your e-mail, access the Internet, and share files and other resources such as printers and network storage with other computers on the network, wherever you wander. At home, you can surf the Web or use instant messaging to chat with friends while sitting out on the patio.You'll also be able to connect to any of the growing number of public wireless hotspots springing up in coffee shops, airport lounges, hotels, and convention centers. And as those hotspots upgrade to the new high-speed Wireless-G standard, you'll be ready to take advantage of the increased speeds.Get connected to current standard 802.11b networks today, and be prepared for the future with the Wireless-G notebook adapter from Linksys.See acomparison diagramof the different wireless technologies.Wireless networks are rapidly becoming more popular and coming down in price. Since they don't require cables, you can use the devices anywhere in an office or home, even out on the patio. There's no need to roll out an Ethernet network cable to each room of a house; you can network anywhere--without wires. Outside the home, wireless networking is available in hotspots at coffee shops, businesses, and airports--great when you're on the road and need to get some work done. For convenience, wireless networking is the answer.Which Wireless Standard Is Right for Me?Now that you've decided to create a wireless network, the next step is to figure out which wireless standard to use.Basically, a standard is a set of specifications for a device. All devices that follow a specific standard share operating characteristics, such as the radio frequency used and maximum data transfer speed.For wireless networking, there are three standards to choose from at this time:802.11b802.11a802.11gTo learn about the differences between the standards and select the right one for your network,click herefor an easy-to-understand chart."}