{"asin": "B0009O7HVW", "description": "X-Men Legends II: Rise of Apocalypse--sequel to the best-selling X-Men game ever--introduces the epic storyline of an uneasy alliance between the X-Men and the hated Brotherhood in a fight to reclaim Earth from Apocalypse's grasp. Impressive gameplay enhancements include more than double the superpowers and customization capabilities, the debut of several new playable characters, over 100 diverse types of enemies, and a breathtaking range of exotic and real-world environments--from the Madri Temple to Egypt. For fans loyal or new,X-Men Legends II: Rise of Apocalypsedelivers a bigger, deeper, and more epic action/RPG experience.Features:From hated foes to united force: Experience the amazing saga of X-Men and Brotherhood rivals bonded by a common enemy. Create, customize, and control a punishing team of four powerful Mutants, selecting from 16 playable characters--many playable for the first time. Choose from your favorite X-Men characters--including Wolverine, Bishop, Cyclops, Nightcrawler, and Storm--and Brotherhood Mutants--such as Magneto, Toad, and Juggernaut. Instantly switch between team members mid-fight to take full advantage of their unique abilities. Combine their powers for even more bruising combo attacks.Unique superpowers and customization capabilities: Each of the 16 playable characters has 10 individualized superpowers at your command, including awesome fighting, melee, or ranged attacks and devastating extreme powers. Instantly upgrade and customize your characters' levels and powers on-the-fly with just the touch of a button so you never have to leave the action. Empower your character with a huge array of completely unique equipment items. Switch costumes between Ultimate, Astonishing, and other styles. Upgrade attributes such as Strike, Ability, and Focus.Intense online and offline multiplayer action:X-Men Legends II: Rise of Apocalypse'sonline multiplayer enables up to four players to engage in an exciting story-based co-op mode and enjoy exclusive online content. Both online and traditional offline multiplayer modes feature dynamic joining that lets your friends jump into the action at any time. Six multiplayer skirmish modes offer head-to-head \"versus\" action, side-by-side battles against enemies, and more.Open-ended storyline and choices: Immerse yourself in an all-new, flexible storyline with compelling gameplay and theatrical-quality FMV created by Academy Award nominee Blur Studios. Take advantage of over 70 free-roaming zones to regroup, begin new missions, complete unfinished missions, gather information, and stock up on equipment. Get creative using your super powers to solve challenging puzzles. Every time you turn a corner, unexpected surprises keep you on the edge. In addition, new difficulty settings allow you to play at your skill level. As you improve, revisit levels using tougher difficulty settings for increased replayability.Amazing array of enemies and environments: Demolish over 100 different types of enemies, from hordes of Apocalypse's henchmen to Lady Deathstrike and Apocalypse's 4 Horsemen. Fully destructible locales are more expansive, requiring even more exploration and containing many hidden items to uncover. Visit X-Men locales like the Weapon X facility and the Infinite Factory plus intriguing spots around the globe such as Egypt and the South Pole. Everywhere you go, discover hidden equipment and paths.", "price": 19.27, "imUrl": "http://ecx.images-amazon.com/images/I/51TWHBR0VTL._SY300_.jpg", "related": {"also_bought": ["B0001I9YHG", "B000G7YX4G", "B001UWGAQA", "B0009H7UJI", "B0009351PM", "B00006LELS", "B000GA75TI", "B0009JB4IY", "0744006325", "B000EXZAKI", "B0000B0MNH", "B00115CNMG", "B001UW9ZW6", "B0009PETYO", "B004MXM7WU", "B00066LGEM", "B0007OSLAA", "B00008DHLD", "0744004365", "B0000C7GHG", "B000TLU67W", "B000TGQLYE", "B0009XBWY6", "9629971372", "B0001NE48U", "B00004YRQA", "B001MW91IW", "B000GDJJQ2", "B00004YRQ9", "B00005U8TQ", "B00009MVJ7", "B00004U5VI", "B00005Q8IR", "B000B69E9G", "B00009VE6D", "B001CLG6SG", "B0009O7HVM", "B00008I800", "B0002B90OE", "B00020BV2E", "B0013KW1B2", "B0007PLKZM", "B0007CGBDG", "B0000CDZBC", "B000G6SPHI", "B003ESHRL0", "B000UH6GEM", "B001QIVEVO", "B0009I6S0O", "B0002XL3BA", "B0009Z3K9O", "B001PKHRUK", "B00BQR6PAA", "B0000TSRA6", "B0013JHKU0", "B000088KH9", "B0000AHOOK", "B000GPVUQ2", "B000FMRY7A", "B0009Z3K7Q", "B00020V5B6", "B001QIVEVE", "B000189K3E", "B000F5IH2I", "B0002IQD1U", "B002DYKPF6", "B00006FWUU", "B00K7IPGS6", "B000F3AACA", "B00006GSNZ", "B0002RQ3JI", "B001811BTO", "B000G77X34", "B000066TS5", "B0007RDM5Q", "B00005TNI6", "B0009A4EVM", "B00019HNNC", "B0001I9YFS", "B002DYKPFQ", "B00067MX98", "B000935256", "B0011BE3KA", "B000099T2G", "B00026RFI2", "B000066RKC", "B001814QDW", "B0012418OU", "B0001AVZ5I", "B0009O7HX0", "B00004U5VF", "B00005NH6B", "B000095ZH6", "B00114XU60", "B0036EH3XY", "B000FUUD8O", "B0015MMN6G", "B000TYQL1O", "B0000A30R8"], "buy_after_viewing": ["B0001I9YHG", "B000G7YX4G", "B0001I9YIK", "B0009351PM"]}, "salesRank": {"Video Games": 4448}, "categories": [["Video Games", "More Systems", "PlayStation 2"]]}