{"asin": "B001TS6WWC", "related": {"also_bought": ["B0009PUQ8M", "B0010YZ4GA", "B002HU086C", "B00LM57S3E", "B00168XMD2", "B000HJ7CLY", "B00JXNRLMU", "B00F3M5D2K", "B000EH0NLK", "B0009PUR86", "B00005OU9D", "B006JH1NB8", "B00E09BERU", "B001TSCDBQ", "B002IVAL1C", "B006JH1KSE", "B00DVA5MXQ", "B0055DX9JQ", "B00F4E7N1G", "B00339913W", "B00CGQXFUS", "B00BYDEVNO", "B0009PUQUA", "B00807TNB2", "B00GVK7YT8", "B000O71L6Q", "B00AU6AVLW", "B000P9F1EQ", "B000LC84PK", "B00GVJDI8A", "B00CHHU3Q0", "B00AU6GEUE", "B000HBGSMQ", "B0000B15HP", "B00CGQE7GE", "B00168YEK2", "B00EHKPBRG", "B0009PUQXC", "B00F9KKMT0", "B001Y8PT5I", "B005GHMT06", "B00363WZSS", "B000PZZ258", "B00CGQE8UE", "B000F6UJ6E", "B005VMG5S8", "B009UC76VA", "B007PAP7OC", "B00019H602", "B00CHBXL2O", "B000HBIL9O", "B00ICUJBDC", "B00CHC0AJK", "B000P9ISSC", "B00EZ6L7DO", "B001U9CWP6", "B00COE8QIS", "B00CHNGD0E", "B000E3XNC0", "B000E24HKS", "B0018S4XIS", "B00363RUII", "B00004RA98", "B00GVL5EI0", "B008DCYDH8", "B000M7RRU2", "B00GPEKBPE", "B00CGQE3JU", "B004E4AVPW", "B001NGF5CI", "B0009PUTCU", "B004E4GBFG", "B000A6V8FU", "B00DGQZ0CS", "B00CHHQAMG", "B001DC5HG6", "B0053R2MEW", "B004PPTBLU", "B002PB2HPS", "B00BPWDMOS", "B004D3A064", "B0009PUQ50", "B0009PUPSS", "B00168YEQ6", "B00177BQJE", "B005G0XFEM", "B000HBMFRS", "B004D8MZ6C", "B00GVJM0A2", "B0068REHQC", "B002PAWK7O", "B007HI23PI", "B004M0YY0G", "B000J084KY", "B0075D2J2C", "B000FIDZLI", "B00ATSHMIQ", "B00CHHQBCA", "B0035RQLIA", "B0006VORDY"], "also_viewed": ["B001TSCF96", "B003QUT9OE", "B002PB2HPS", "B00HZ4KI4C", "B00BZ4PYLK", "B002PB0DZO", "B00C37OWQG", "B000W7BHJY", "B004E4AW1K", "B003R7PU6W", "B004E4ERIY", "B00EHKP1AI", "B00C37OFWW", "B00BQ43A60", "B00DGSWHNQ", "B004THETNE", "B006GJ8Q7S", "B005DS5XIS", "B002PAWK7O", "B00F5X1XRQ", "B00BA06BRU", "B00EHKOV86", "B00EHKOU9Q", "B005T442LA", "B004TMODZS", "B00BQ3SZ7U", "B007OJW7QU", "B00C37NS8E", "B00EULC1WK", "B00CS7HOZM", "B00I558X10", "B00BZ4PPD2", "B00BPZCIL8", "B00IZ2VONC", "B00E0BYK8S", "B00KABTBAO", "B00A8E2M40", "B00CGNDOFM", "B00D0DKRAW", "B00A8E2KEM", "B005T4137G", "B001O5L2ES", "B0064XF6UQ", "B008KRNTSU", "B00EHKOZFU", "B00BZ4PLVS", "B00DVZFK9M", "B00D7AUQY0", "B00C37PINW", "B005T40KUW", "B003C4Z7W2", "B00F20HCKE", "B00C37PGK2", "B00KO1U1HM", "B0052QMZXC", "B001CWGG8U", "B007FLCRHQ", "B003ASVBDY"], "bought_together": ["B0009PUQ8M", "B002HU086C"]}, "title": "Coleman WeatherMaster Screened 6 Tent", "price": 140.53, "salesRank": {"Sports &amp; Outdoors": 779}, "imUrl": "http://ecx.images-amazon.com/images/I/41NQB9Ld-CL._SY300_.jpg", "brand": "Coleman", "categories": [["Sports & Outdoors", "Outdoor Gear", "Camping & Hiking", "Tents", "Family Camping Tents"]], "description": "A patent-pending hinged door provides easy entry and exit, and a touch of at-home convenience.The Coleman WeatherMaster 6 Tent has two rooms and plenty of space for the entire family. Up to six campers can sleep easily inside thanks to the 17-by-nine (W x D) footprint and 6 ft. 10 in. center height. Two doors&#xFFFD;including a patent-pending hinged front door&#xFFFD;offer easy in-and-out. An additional floor-less screened room provides extra ventilation on warm days, a great place for meals and gathering, rain or shine, and protected storage space.Coleman's Comfort System allows excellent ventilation control via Variflow adjustable airflow, a vented Cool-Air privacy Port, privacy vent window, and all-mesh ceiling. A convenient electrical access port lets you run a cord from your device in the tent to an outside power source, while an interior gear pocket helps you keep things organized.Setup is quick and simple thanks two color-coded poles and continuous pole sleeves, shock-corded fiberglass poles, an exclusive pin-and-ring design, and InstaClip attachments. Straightforward instructions are sewn into the convenient carry bag, and separate stake and pole bags are also included.Coleman's WeatherTec SystemThis proprietary series of interworking features keeps the weather where it belongs&#xFFFD;outside the tent&#xFFFD;at all times.Leak-free Seams:In addition to fully-taped rainfly seams, the rainfly covers doors and windows, and incorporates easy-to-use Velcro frame attachmentsWeather-resistant Fabric:Coated polyester fabric combined with anti-wicking thread, webbing, and zippers are designed to keep you dryProtected Seams:Inverted floor seams dramatically increase weather resistance by hiding needle holes inside the tent, away from the elementsWaterproof Floors:Welding technology strengthens the tent floor and eliminates needle holesZipper Protection:Zipper cuff adds protection from the elements to the doorWind Strong Frame:Engineered to be a stronger, more wind-responsive frame by using redesigned poles and guy-out triangles to anchor tents and increase performanceSpecifications75-denier polyester taffeta fly68-denier polyester mesh inner tent1,000-denier polyethylene floor19-millimeter steel polesThe Coleman Limited WarrantyColeman has been in business for more than 100 years, and continues to produce high-quality, affordable tents, lanterns, table-top stoves, and more. All Coleman products have a warranty against defects in material and workmanship, and the WeatherMaster 6 Tent includes a limited one-year manufacturer's warranty.About Coleman Outdoor ProductsMore than 100 years ago, an entrepreneurial young man named W.C. Coleman had an idea for manufacturing better lanterns in Wichita, Kansas. A century later, Coleman's current catalog features a wide-ranging array of products that make spending time outside a pleasure. The company crafts coolers that keep food and drinks cold for days, airbeds that are comfortable and won't deflate during the night, a complete line of bright and long-lasting LED lights, powerful portable grills that cook with an authentic open-grill flame, and more."}