{"asin": "B004HO58L6", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Z90The FinePix Z90 digital camera is the latest addition to Fujifilm's sleek and stylish range of Z-series compact cameras, and features a large 3-inch resistive touch-screen LCD, a 14-megapixel CCD sensor, with a FUJINON 5x wide angle refractive optical zoom lens (28mm equivalent) for added range and flexibility. The FinePix Z90's impressive features also include one-touch 720p HD movie capture, an intuitive Dual Direction GUI that allows for easy navigating, and \"tap and shoot\" capabilities for images and videos. The Z90 also has tagging with automatic upload functions to YouTube and Facebook.Fujifilm FinePix Z90 HighlightsChic DesignThe FinePix Z90 features a slim metal chassis and a chic horizontal sliding lens barrier that makes it ultra-portable. It is available in a choice of five stylish colors: matte black, red, blue, pink and purple.Easy Web UploadsSharing photos online has become an everyday activity for many people, so Fujifilm includes the Facebook/YouTube Automatic Upload feature that makes for quicker and easier modes of posting photos/videos on social networking sites. This feature allows users to identify and tag a photo for Facebook or YouTube upload. Once the camera is connected to a PC and MyFinePix Studio software is launched, all marked photos or movies will upload directly to Facebook or YouTube at the press of a button.HD CapabilityWith 720p HD movie capture, the FinePix Z90 captures vivid images that can be played back in beautiful detail on your HDTV. In addition, the FinePix Z90's one-touch movie button makes it simple to create your own movie clips, with sequential capture, letting you start and stop in a single movie clip. The Movie Edit feature allows users to add personalized finishing touches to footage with in-camera editing, and the camera also lets users add special effects to their photos including color tones, contrasts and brightness changes, Diagonal Crop, Collage and Face Mosaic. With the optional HD Player accessory kit, with wireless remote control (HDMI cable not included), families can gather around their home HDTV to enjoy amazingly detailed stills and high resolution movie playback.Additional FeaturesTap and Shoot: Provides the ability for one touch focus and shooting for easy photo taking. After the user taps the focal point of choice for the shooting scene on the LCD display, the camera automatically sets the appropriate focus and functions, and then releases the shutter for optimal one touch picture taking.Digital Image Stabilization: Digital Image Stabilization reduces image blur automatically and offers creative adaptability and excellent picture quality.Scene Recognition Auto (SR AUTO): This mode intelligently detects the scene-type and shooting conditions and optimizes the camera settings accordingly.Face Detection and Automatic Red-eye Removal: To provide perfectly exposed and focused portrait shots, the FinePix Z90 is fitted with Fujifilm's latest Face Detection technology which is able to track up to 10 faces simultaneously, at almost any angle to the camera. The system instantly corrects red-eye and then saves both the original and the corrected image file automatically.i-Flash Intelligent Flash: Offers a flash control system which efficiently controls the level of flash for a given exposure to produce beautifully balanced flash illumination across the foreground and background. Gone are the ugly washout shots where the subject is blasted with light and the background dark and unexposed.Motion Panorama Mode: Automatically stitches up to three shots to create a panoramic picturePlayback Capabilities: Offers a variety of playback features for easy and immediate sharing such as the widescreen LCD in HD, slide show, sort, edit and search features, plus Dual Image Display that splits the screen in various ways to view multiple images at once.", "title": "Fujifilm FinePix Z90 14 MP Digital Camera with Fujinon 5x Wide Angle Optical Zoom Lens and 3-Inch Touch-Screen LCD (Black)", "price": 6.13, "salesRank": {"Camera &amp; Photo": 4463}, "imUrl": "http://ecx.images-amazon.com/images/I/51XbxKQqtBL._SY300_.jpg", "related": {"also_bought": ["B001V9KG0I", "B003VNKNEG", "B001N4LC4A", "B0045DPCNI", "B001OBYPQ4", "B0045DR7UE", "B002KID8K4", "B003VNKNEQ", "B0041PJAA6", "B005HNF01O", "B003D8OSV8", "B004IRTL74", "B004ZH6QY8", "B0027E5YTY", "B001R23JNK"], "buy_after_viewing": ["B003D8OSV8", "B003VNKNEQ", "B004VTQ5FA", "B004L1BL0M"]}}