{"asin": "B002LVUQYQ", "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]], "description": "Get real-time content on the go with n&uuml;vi 1690. From fuel prices to Google&trade; Local Search, you'll be the first to know with Garmin n&uuml;Link!&trade; services&sup1;. The 1690 also includes preloaded maps, Lane Assist with junction view, hands-free calling and ecoRoute&trade; &mdash; making it one smart navigator.Travel Like a Local with Garmin n&uuml;Link! ServicesWith Garmin n&uuml;Link! services, you receive accurate real-time information delivered wirelessly to your n&uuml;vi 1690. In the U.S., each n&uuml;vi 1690 comes with a free 2-year n&uuml;Link! subscription. After the 2-year period ends, subscriptions cost $60 a year &mdash; that's only $5 a month! With n&uuml;Link! services, you'll get Google&trade; Local Search to find local POIs and traffic services that deliver alerts for delays and road construction then automatically guide you around them in the shortest time. Need fuel? Find up-to-date fuel prices near your location for regular, mid-grade, premium or diesel. Other convenient services included in the subscription: Ciao!&trade; friend finder, weather, movie times, local events, Send to GPS, flight status, currency converter, White Pages and myGarmin&trade;.An ultra-thin GPS navigator with great Garmin features like CityXplorer and ecoRoute.&nbsp;Know the Lane Before It&rsquo;s Too LateNo more guessing which lane you need to be in to make an upcoming turn. Lane Assist with junction view guides you to the correct lane for an approaching turn or exit, making unfamiliar intersections and exits easy to navigate. It realistically displays road signs and junctions on your route along with arrows that indicate the proper lane for navigation. Lane Assist with junction view is available in select metropolitan cities.Get Turn-by-turn Directionsn&uuml;vi 1690's intuitive interface greets you with 2 simple options: \"Where To?\" and \"View Map.\" Touch the color screen to easily look up addresses and services and get voice-prompted, turn-by-turn directions that speak street names to your destination. It comes preloaded with detailed City Navigator&reg; NT street maps, nearly 6 million POIs, 2-D or 3-D maps and speed limits for most major roads in the U.S. and Europe. Its digital elevation maps show you shaded contours at higher zoom levels, giving you a big picture of the surrounding terrain. And with HotFix&reg; satellite prediction, n&uuml;vi calculates your position faster to get you there quicker.Make Hands-free CallsFor hands-free calling, n&uuml;vi 1690 integrates Bluetooth&reg; wireless technology with a built-in microphone and speaker. Just pair it with your compatible Bluetooth phone and talk hands-free through the 1690 while staying focused on the road. Simply dial numbers with n&uuml;vi's touchscreen keypad to make a call. To answer calls, just tap the screen and speak. Enjoy convenient 1-touch dialing for contacts and POIs.Select Fuel-efficient Routesn&uuml;vi 1690 saves you gas and money with ecoRoute &mdash; a green feature that calculates the most fuel-efficient route, tracks fuel usage and more. With ecoRoute, you have a &ldquo;less fuel&rdquo; option as a routing preference. When selected, n&uuml;vi will determine if a more fuel efficient route exists based upon road speed data and vehicle acceleration data for a given route.Route Planningn&uuml;vi 1690 includes advanced navigation features to take the worry out of traveling. With route planning you can save 10 routes, specify via points and preview simulated turns on the 1690's wide screen. In addition, n&uuml;vi 1690 automatically sorts multiple destinations to provide an efficient route for errands, deliveries or sales calls. It also displays speed limits for highways and Interstates. A trip log provides an electronic breadcrumb trail of up to 10,000 points, so you can see where you've been on the map.See MoreWith n&uuml;vi 1690's widescreen display, you'll always get the big picture. View map detail, driving directions, photos and more in bright, brilliant color. Its sunlight-readable, 4.3\" (10.92 cm) display is easy to read from any direction.Announces the name of exits and streets so you never have to take your eyes off the road.Click to enlarge.Lane assist guides you to the correct lane for an approaching turn or exit, making unfamiliar intersections and exits easy to navigate.Click to enlarge.Junction View gives you a photo-realistic screen that shows you both the road detail as well as the signs as you will see them on the road.Click to enlarge.Enjoy access to Garmin's n&uuml;Link! services like weather forecasts, flight status, white pages, and more.Click to enlarge.Go Beyond NavigationNavigation is just the beginning. \"Where Am I?\" emergency locator finds the closest hospitals, police stations, fuel stations, nearest address and intersections. n&uuml;vi 1690 helps you remember where you parked by automatically marking your position when you remove it from your car. It also includes travel tools, such as JPEG picture viewer, world travel clock with time zones, currency converter, measurement converter and calculator. Photo navigation lets you download pictures from Garmin Connect&trade; Photos. The 1690 features Garmin Lock&trade;, an anti-theft feature, and is compatible with Garmin Garage&trade; where you can download free vehicles and voices. Enhance your travel experience with optional plug-in microSD&trade; cards.Google&trade;Local SearchAccess up-to-date information for the local area using the power of Internet-enabled local search and navigate directly from the search results.Real-time TrafficGarmin n&uuml;Link! services provide current traffic data for your route so your n&uuml;vi 1690 can automatically optimize a route for the shortest time. Just drive and let n&uuml;vi 1690 do all the work.Gas PricesIs your fuel tank getting a little low? Garmin n&uuml;Link! services show you where you can find the best prices for any grade of fuel in your area. Just tap the screen and go to your chosen station.Ciao!&trade;What are your friends up to? Ciao! integrates multiple third party location-centric social network applications, such as GyPSii, with more networks expected to be added in the future.Local EventsWhat&rsquo;s going on in town? Search for local events, concerts, theater performances, sports, art and navigate there with ease.myGarmin&trade;Your n&uuml;vi 1690 will receive alerts for available updates automatically.ConverterQuickly and conveniently convert up-to-date currency evaluations, measurements, distances, speed and temperature.Flight StatusQuick access to flight departure/arrival times and gate information from airports around the world with the closest major airports displayed first.White PagesForget someone's address? Find it using White Pages and navigate there. Search by name or phone number &mdash; faster and more convenient than a phone book.Send to GPSBuild a list of destinations online then send them wirelessly to your n&uuml;vi 1690.Movie TimesWanna catch a flick? Just tap Movie Times and you can find an area movie theater quickly and easily.WeatherWhat&rsquo;s the weather forecast? Tap the Weather icon to get current and 5-day forecasts tailored for major cities around the world.What's in the Boxn&uuml;vi 1690, Free 2-year data subscription to Garmin n&uuml;Link!&trade; services in the U.S., Preloaded City Navigator&reg; NT North America (U.S. and Canada), Vehicle suction cup mount, Vehicle power cable, USB cable, and Quick start manualCompare all Garmin n&uuml;visClick the button below to compare by series, user type, and features.Visit Garmin.com athttps://www8.garmin.com/support/download.jspto get the latest firmware updates for your n&uuml;vi to keep it current and performing at its best.&sup1;Two-year data subscription to n&uuml;Link! services included with purchase of n&uuml;vi 1690 while offer lasts. n&uuml;Link! services only available in select coverage areas. See the n&uuml;Link! coverage map for coverage details. n&uuml;Link! Traffic services are available in select areas. See the n&uuml;Link! traffic coverage map for included areas. What's in the Box n&uuml;vi 1490T, Preloaded City Navigator NT for North America, Lifetime traffic, FM traffic receiver with vehicle power cable, Vehicle suction cup mount, USB cable, Dashboard disc, Quick start manual", "title": "Garmin nuvi 1690 4.3-Inch Portable Bluetooth Navigator with Google Local Search &amp; Real-Time Traffic Alerts", "price": 321.59, "imUrl": "http://ecx.images-amazon.com/images/I/51M8DrYf5BL._SX300_.jpg", "brand": "Garmin", "related": {"also_bought": ["B004AJ9P44", "B00269VU0W", "B0050JJU3E", "B0037JE8VS", "B002OL2MU4", "B003DSCU72", "B005EM89F2", "B003ZX8B1E", "B003WYS3FK", "B004HPUI42"], "bought_together": ["B002OL2MU4"], "buy_after_viewing": ["B00AXX0I88", "B002OL2MU4", "B005DIBHA6", "B0057OCDQS"]}}