{"asin": "B0007QU6WY", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Memory Cards", "CompactFlash Cards"]], "description": "The SanDisk Ultra CompactFlash Memory Card gives you outstanding performance so you get more out of your digital camera. Ideal for use with professional SLRs, video cameras, and other devices that feature CompactFlash card slots, the SanDisk Ultra CompactFlash Memory Card comes in capacities up to 16 GB, so you can keep shooting without worrying about running out of space.SanDisk Ultra CompactFlash2GB Memory CardAt a Glance:Provides 2 GB of data storage for digital and video camera useWorks with devices that feature CompactFlash card slotsOutstanding read/write speed of up to 15 MB/sBacked by a lifetime limited warrantyFast read/write speeds for ideal performance and less wait-time between shots.View larger.SanDisk Ultra CompactFlash Memory CardsEnough Capacity for Any AdventureWith digital cameras and camcorders taking higher-quality photos and videos, there is a greater need for storage space to store these high-resolution files. SanDisk Ultra CompactFlash Memory Cards come in capacities up to 16 GB1, allowing you to keep shooting photos and videos without worrying about running out of space or wasting time to review and delete photos in-camera to free up space. The Ultra CompactFlash cards can be used with any device that features a CompactFlash card slot or supports the CompactFlash format, and serve as easy, reliable storage for on-the-go use.Fast Performance with Speeds up to 30 MB/sSanDisk Ultra CompactFlash Memory Cards feature fast read/write speeds of up to 30 MB/s (up to 15 MB/s for the 2 GB card) to give you faster shot-to-shot performance and less waiting between shots. Whether you are shooting video or taking photographs of action and sports, the SanDisk Ultra CompactFlash card will keep up.About SanDiskSanDisk Corporation is a Silicon Valley-based S&amp;P 500 and Fortune 500 company. It is a global leader in flash memory cards--from research, manufacturing, and product design to consumer branding and retail distribution. SanDisk holds more than 1,700 U.S. patents and more than 1,100 foreign patents.SanDisk pioneered the CompactFlash card format and co-invented the SD format. SanDisk has the rights to manufacture and sell every major flash memory card format.The SanDisk Ultra CompactFlash Memory Card is backed by a lifetime limited warranty.What's in the BoxSanDisk Ultra CompactFlash Memory Card (2 GB) and jewel case.Photo CapacityCapacity12 MP JPEG(3 MB+)14 MB+RAW File16 GB4,0009604 GB1,0002402 GB500120&nbsp;or&nbsp;Video CapacityCapacityHD2Video (1280x720x30fps)&nbsp;16 GB3 hours, 15 minutes4 GB43 minutes2 GB21 minutes&nbsp;&nbsp;&nbsp;11 gigabyte (GB) = 1 billion bytes. Some capacity not available for data storage.2HD (1280x720x30fps) and 3D video support may vary based upon host device, file size, resolution, compression, bit rate, content and other factors. See www.sandisk.com/HDUp to stated speed, based on SanDisk internal testing. Performance may be lower depending up on host device. 1 megabyte (MB) = 1 million bytes. X =150KB/sec.Ten-year warranty in regions not recognizing lifetime limited warranty.+Approximations: results vary based on file size, resolution, bit rate, content host device, pre-loaded files and other factors.", "title": "SanDisk Ultra CompactFlash 2 GB Memory Card 15MB/s SDCFH-002G-U46", "price": 49.63, "imUrl": "http://ecx.images-amazon.com/images/I/41IWji1FJtL._SX300_.jpg", "brand": "SDKSK9", "related": {"also_bought": ["B0001CNMFM", "B000VY2BC0", "B0009M069Y", "B0030UL7IG", "B00109Y2DQ", "B00065ANYW", "B000ZO0GBO", "B006G5ZVA2", "B004UC9HSA", "B002P5KOXG", "B00006B9QM", "B000P5AJXI"], "bought_together": ["B0001CNMFM"], "buy_after_viewing": ["B0001CNMFM", "B00065ANYW", "B004UC9HSA", "B00065ANY2"]}}