{"asin": "B0047T7PTO", "categories": [["Electronics", "Computers & Accessories", "Data Storage", "Network Attached Storage"]], "description": "ConnectConnect up to 4 USB storage drives and immediately access all of the files on your network. Manage, view or play content on any computer on your home network or outside the home using any computer with internet access.ShareUnlimited File Sharing:Share your files with friends, family, co-workers using file albums.Social Network Sharing:Upload your photos directly to Facebook and other Social Media sites.Photo Albums:Create and share access to photo albums using email links sent automatically by MediaShare.Access &#38; Manage AnywhereComputer Access:Upload and download files from any location inside or outside the home.Anytime Mobile Access:Access your files through an iPhone, iPad or other mobile devices. View Microsoft Office files, read PDF documents, enjoy photos or play music remotely all with ease. Premium subscription not required.StreamDigital Media Players:Stream your files to any DLNA / uPnP device such as PS3, Xbox360 or other similar digital media players.iTunes&#8482; &#38; Sonos&#8482; :Enjoy playing your music directly to iTunes clients or Sonos&#8482; wireless audio systems from any USB drive connected to MediaShare Mini.Media Player:Use the included media player capabilities of MediaShare to view photos or play music and videos on your computer whether you are at home or in a caf&eacute;.Additional FeaturesMediaShare ApplicationManage all of your content with ease using MediaShare&rsquo;s innovative and easy to use management tool. Access locally or remotely through any computer web browser.Network PrintingConnect a USB printer and enable network printing on a home network. (Scan, Fax, Copy or any additional non-printing functionality is not supported).Save &#38; ProtectNetwork Backup: Use network backup software solutions such as Windows Backup to save files directly to drives connected to MediaShare Mini.HardwareHigh Speed Processor: High Speed, High Performance processor for better video streaming and improved data transfer.Design: Compact, sleek aluminum enclosure that fits in the palm of your hand.4 x USB Ports: Connect up to 4 USB storage devices or USB printer to make network accessible.", "title": "Verbatim MediaShare Mini Home Network Storage, Silver 97329", "price": 65.06, "imUrl": "http://ecx.images-amazon.com/images/I/31LJXsfdvRL._SY300_.jpg", "brand": "Verbatim", "related": {"also_viewed": ["B00CRW1CRO", "B0037NYKW6", "B0098Z2C9A", "B005C31H34", "B005TJLU24", "B001OC5J9U", "B005IULTI4", "B00BXAVDLQ", "B00DIO9M1S", "B005XDGJB8", "B00594BR4A", "B004UBU3SY", "B000JOZAQG", "B00004SB96", "B00DIO9N8A", "B0001FSCZO", "B00DW1UNS8", "B007JLDTRY", "B002WRIBN2", "B003IT6YFU", "B0036SDJ3I", "B004IYJWVC", "B00B3TDTTQ", "B00CZ0P0PS", "B00G23HHXM", "B005GM1Q1O", "B00CO0DE0W", "B00597E938", "B0040NPGP2", "B006I5MKZY", "B008RLHQ7E", "B00776V3DI", "B00439GMJ2", "B00B2AS8CE", "B0093NUFVE", "B005PVXH18", "B00EVVGAFI", "B005PVXI0S", "B00JKM0A36", "B008DWAGPG", "B0030BEV7E", "B007KWLXRK", "B00IDA3L9G", "B00ARB5FPM", "B00EVVGAD0", "B00429N16A", "B00D4DAG1S", "B00JKM0EBE", "B00GJYNLKM", "B00C0RCNPG", "B00CRB9CK4", "B001M5V0YC", "B004TDY924", "B00B5Q7AII", "B004JHXWDC", "B003SU4BXQ", "B00EVVGAC6"], "bought_together": ["B006Y5UV4A"], "buy_after_viewing": ["B00EVVGAFI", "B006I5MKZY", "B00CZ0P0PS", "B00EVVGAD0"]}}