{"asin": "B00004U55E", "description": "It's been nearly 10 years sinceWolfenstein 3Dforever  popularized the first-person shooter, and at long last everyone's favorite Nazi  killer, B.J. Blazkowicz, is back inReturn to Castle Wolfenstein. Set  during World War II,Return to Castle Wolfensteinfinds the Nazis  dabbling in the black arts in an effort to create an army of supersoldiers.  Naturally, Blazkowicz is the only thing standing in the Nazis' way, so he's set  behind enemy lines in an effort to end the madness.On the surface, the single-player game seems like pure gold--after all, everyone  loves killing Nazis. But the story jumps all over the place, the enemy AI is  less than impressive, and most gamers will be able to finish the game in a mere  10 to 15 hours. The single-player game falls short of the standards set by  titles such asHalf-LifeandNo One Lives Forever.In fact, the best thing aboutReturn to Castle Wolfensteinis its  team-based multiplayer mode. Each multiplayer adventure features Axis vs. Allies, and  both sides offer four character classes: engineer (removes obstacles), medic  (heals and revives teammates), lieutenant (calls in air strikes and replenishes  ammo), and soldier (only class able to use sniper rifles, flamethrowers, and  other unusual weapons). The game includes only eight multiplayer maps, but they  are all perfectly designed, and in order to be successful teams have to work  together. The result is a great gaming experience that fans ofCounter-Strikeor the Day of Defeat mode forHalf-Lifewill really  appreciate.Graphically,Return to Castle Wolfensteinlooks amazing. It uses the  powerfulQuake IIIengine to great effect, and the character models,  explosions, and lighting effects are all perfectly done. Alas, pretty graphics  and a great multiplayer game don't quite make up for an exceptionally average  single-player experience.--William HarmsPros:Amazing graphicsGreat level design (including secret passages)Awesome multiplayer modeCons:Lackluster AISingle-player game is very short", "price": 51.0, "imUrl": "http://ecx.images-amazon.com/images/I/51NZ3WDF9GL._SY300_.jpg", "related": {"also_bought": ["B00006C2HA", "B00CPKUV9I", "B00005RV92", "B001CLYL1K", "B0002IBEJQ", "B00004ZASP", "B001E6DG6Y", "B0000A1VER", "B008E6ZXA4", "B000087L4E", "B009ZMETKG"], "bought_together": ["B00006C2HA"], "buy_after_viewing": ["B00CPKUV9I", "B0007ZCZGA", "B0000TA6IW", "B000087L4G"]}, "salesRank": {"Video Games": 29369}, "categories": [["Video Games", "PC", "Games"]]}