{"asin": "B000246USU", "categories": [["Electronics", "Car & Vehicle Electronics", "Vehicle Electronics Accessories", "Radar Detectors"]], "description": "Amazon.com Product Description Whether the threat is in North America or abroad, the Beltronics Vector 995 radar detector keeps you driving safely. As the industry leader in technology and innovation, the V995 accurately detects all US radar and laser bands (X, K, Ka) as well as the UK favorite-Ku. All bands are detected at the furthest possible distance including the newest \"POP\" mode Ka-band threat. With clear voice alerts, you can keep your eyes on the road, not the detector. And when it does alert, the mute button is right in easy reach on the included SmartPlug power cord. No need to leave the detector behind while traveling--we include the hard sided protective carrying case so the detector goes where you go.The flagship of the Vector series.Click to enlarge.Includes Smart Plug with easy-access mute/volume button.Click to enlarge.Easily install with quick-release windshield mount.Superior DetectionThe Vector 995 includes full X, K, SuperWide Ka, Ku and Safety Warning System radar capability, laser detection, patented Mute and AutoMute features, audible and visual band alerts, and all the performance you'd expect from Beltronics.Digital signal processing (DSP) technology and multiple laser sensors give you long-range performance, and greatly reduce the number of false alarms. On top of that, the Vector 995 is invisible to VG-2 radar detector detectors, keeping you one step ahead. It also features Highway/City sensitivity settings to tailor performance to your needs.Easy to UseThe rugged Vector 995 gives you control right at your fingertips. Patented Mute and AutoMute technology allows you to quickly silence alerts. Advanced programming lets you customize several features, and all controls are easily accessible on top of the device.Installation is also a snap: use the quick release Windshield QuickMount to attach it to your vehicle's windshield, and remove it in a snap. Don't want to leave it in your vehicle? No problem, Beltronics includes a travel case to keep it secure while you're on foot.AutoScan ModeThe V995's AutoScan mode provides long-range warning, with minimum false alarms. In this mode, the V995's internal computer continuously analyzes all incoming signals and intelligently filters out false alarms.Voice AlertsThe V995 provides digital voice announcements of radar and laser bands detected. If Safety Radar (SWS) is turned on, a safety radar message will also be announced.Smart Plug IncludedOnce you are notified to a threat, Beltronics' SmartPlug makes it easy to temporarily silence your radar detector with a handy mute button.Ultra-Bright LED DisplayDon't miss a visual alert with the 995's 280-LED alphanumeric display. Exclusive threat display tracks and displays multiple radar signals, including signal strength. You can also view Safety Warning System (SWS) messages about upcoming hazards, construction and more.Enjoy three different brightness settings or operate in dark mode if you'd prefer only audio alerts.Total Tracking LaserUnlike Radar signals, which are highly reflective, Laser signals have very poor reflective characteristics. Many of today's Laser detectors do not have the high sensitivity necessary to detect Laser within a large \"field of view.\" The Vector 995 incorporates Beltronics' best laser detection, which uses twin laser ports to detect energy far outside the main laser beam--including off-axis signals--providing a 360-degree field of view. The alerts provided by your unit are the same whether signals are received from the front or rear.How Safety Radar WorksSafety Warning System (SWS) a modified K-band radar signal to alert users of Highway Construction or Maintenance, Highway Hazard Zone Advisories, Weather Related Hazards, Travel Information/Convenience, and Fast/Slow Moving Vehicles. The SWS safety radar system has 64 possible messages (60 currently allocated), all of which can be displayed on your Vector 995.What's in the BoxBeltronics V995 Vector Radar/laser Detector, carrying case, coiled power cord, quick release windshield mount, owner's manual", "title": "Beltronics Vector V995 Radar Detector", "price": 241.58, "imUrl": "http://ecx.images-amazon.com/images/I/41FPe1VgfZL._SX300_.jpg", "brand": "Beltronics", "related": {"also_bought": ["B0003NN83U", "B002GEBRAK", "B0003NN81M", "B003XQCJZM", "B0063N7HZE", "B00D3NXM2Y", "B004C2C1UO", "B002J47Q3O", "B001DSIMAI", "B006G1PHLY", "B0009SCMKY", "B00AG8EMG4", "B001ODDBSU", "B002CUK9S4", "B0017VA7EU", "B003DNSJPE", "B006074LT8", "B000F8XGJO", "B001U2DPUE", "B00B4E9764", "0321767837", "B004JPD8ZG", "B0003NN83K"], "bought_together": ["B0003NN83U"], "buy_after_viewing": ["B0009SCMKY", "B004C2C1UO", "B005IQGNCU", "B001F0RPGG"]}}