{"asin": "B004W697ES", "description": "Why do I need this?The iProp will bring an end to tired arms, sore necks, and strained eyes that are the result of using your tablet.  Whether you're watching a movie in bed, browsing on the couch, or playing games on your trip, the iProp will replace your tired arms and hold your device where it's comfortable for you, so you can focus on the important stuff (the screen!).Why should I choose the iProp?The iProp is carefully designed and constructed of high grade materials to uniquely compliment the high-end design of your tablet device.   It's light and portable at only 8 oz, and the unique non-slip, soft-to-the-touch silicone shelf provides the perfect amount of stability, without obstructing the tablet screen.Important features:Easily adjust the angle of your tablet.  Can be used in portrait or landscape mode.  Mesh bag conforms to any surface, providing the freedom to enjoy your tablet computer on both flat surfaces, such as tables and benches, right through to soft and uneven surfaces such as sofas or the bed.  Small size is easily portable as a comfortable travel stand.Compatibility:Works with any tablet thinner than 18 mm, including the iPad, iPad 2, new iPad 3, Motorola Xoom, Samsung Galaxy Tab, Acer Iconia, HTC Flyer, Amazon E-Readers and Tablets, Sony Tablet S, Blackberry Playbook, Samsung Galaxy Note, Barnes and Nobles Nook tablets, HP Touchpad, NATPC, Le Pan, ASUS Tranformer EEE Pad, ASUS Transformer Prime, Sony Tablet S, and many more.", "title": "iPad Bed &amp; Lap Stand by iProp; Bean Bag Universal Tablet Holder for iPad 1/2/3/4, Mini, Air, Android and Windows Tablets, eReaders (Black)", "price": 24.99, "imUrl": "http://ecx.images-amazon.com/images/I/41b3jcbPQcL._SY300_.jpg", "related": {"also_bought": ["B004TLH7C0", "B008DKCQUG", "B00CGUCBVI", "B005MKH1XC", "B005HM2L4O", "B00AN9LVAQ", "B001U365XM", "B00FZM92UW", "B00D856NOG", "B006ZN1C8U", "B007TNW61C", "B003IGNUL4", "B006ZN1CA8", "B00FZM93L0", "B00ANAHMVC", "B006ZT4VA0", "B002VPE1Q6", "B00H34FFC4", "B007I6FS10", "B00IWA1MNE", "B0059KTEBC", "084311827X", "B002U729UA", "B00B5RGAWY", "B00CB7T52O", "B00FXOFNVY", "B008MOHLVC"], "bought_together": ["B004TLH7C0", "B00D856NOG"], "buy_after_viewing": ["B005MKH1XC", "B005HM2L4O", "B005HM0SNA", "B00ANAHMVC"]}, "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Cases & Sleeves", "Cases"]]}