{"asin": "B0067PLM5E", "categories": [["Electronics", "Computers & Accessories", "Tablets"]], "description": "Paired for PerfectionBreaking free from the normal constraints of a device through constant innovation, the ASUS Eee Pad Transformer Prime is the perfect example of what a tablet should be. The feature that gives the Eee Pad Transformer Prime its name, the mobile docking station, gives a whole new meaning to the term Paired for Perfection.The new Eee Pad Transformer Prime is mind-blowingly slim and light weight and with a beautiful metallic spun finished design. In fact, it is the slimmest tablet on the market yet, only 0.33\" thin and 1.29lbs light. You can easily carry it with you no matter where you go.Key Features10.1-inch WXGA Super IPS+ capacitive pressure-sensing multi touch display made with Corning&reg;Gorilla&reg;Glassfor brilliant HD entertainment and intuitive navigation. 178&deg; viewing angle (1280 x 800)Ultra-slim and light (.33\" thin and 1.29lbs light)with metallic spun finish designPowered by NVIDIA&reg;Tegra&reg;3 Quad-core CPUfor excellent multitasking, 1080p HD video output playback and 3D games for SUPERB performance (Learn more)1.2MP front camera and 8MP auto-focus rear camerawith flash, back-illuminated CMOS sensor, and large aperture design to clearly capture every moment. (Learn more)Android&trade;3.2 Honeycomb (Upgradable to Android&trade; 4.0 Ice Cream Sandwich) OSwith Adobe&reg;Flash&reg;support and over 500,000 downloadable applications on the Android&trade;Market.1(Learn more)Optional Docking station with Full QWERTY keyboardadds additional 6 hours of battery life, to instantly turn the Eee Pad Transformer Prime into PC mode with up to 18 hours of battery life.2Learn MoreView largerPerformance & ProductivityBeing the first tablet that is powered by the world's first Quad-core processor NVIDIA&reg;Tegra&reg;3, the Eee Pad Transformer Prime browses the web and outputs 1080p HD video at blazing speeds. The snappier response time and better multi-tasking performance make the Eee Pad Transformer Prime a true mobile entertainment powerhouse.The feature that gives the Eee Pad Transformer Prime its name, the mobile docking station, gives a whole new meaning to the term versatility. The innovative design not only seamlessly provides the user with a keyboard, touchpad and expandability options, but also increases battery life to 18 hours for all day computing & productivity.2Stunning Visuals & SoundEquipped with the Super IPS + panel that's protected by Corning&reg;Gorilla&reg;Glass with 178&deg; ultra-viewing angle, the Eee Pad Transformer Prime's screen brightness has also been enhanced to make it easier than ever to read outside in the sun. 8MP rear camera with flash, back-illuminated CMOS sensor and large aperture design ensures that every precious moment is being captured while 1.2MP front camera allows for vivid video conferencing.The Eee Pad Transformer Prime houses an updated audio solution offering sound unheard of from any other tablet, powered by SonicMaster technology, one of the industry's renowned codecs for crisp and acoustically accurate audio.Connectivity & ExpandabilityStay connected while you're on the move with the Eee Pad Transformer Prime that comes with MicroSD Card Reader, Micro HDMI port and unlimited free web storage space for a year for easy sharing & expandability.2With Android&trade;3.2 Honeycomb (Upgradable to Android&trade;4.0 Ice Cream Sandwich) OS with Adobe&reg;Flash&reg;support and over 500,000 downloadable applications on the Android&trade;Market, entertainment is just a finger swipe away.1The convenient ASUS Launcher also allows users to launch software, manage content, access online services and connect devices with a few simple taps.MyNetAllows users to easily stream digital media wirelessly within home network devices with the Eee Pad Transformer Prime. Play HD videos or music on any home network devices such as the HDTV monitor or desktop PCs for an even better experience from the Eee Pad Transformer Prime.3MyLibraryConsolidates downloaded books, magazines and newspapers in to one easy to browse profile that syncs with Google Bookstore and ASUS @Vibe.MyCloudMyCloud is a total cloud solution, providing access to digital content such as music, videos and files from the cloud anywhere, anytime. Users can even use MyCloud to remotely access and control any PC or Mac system and access applications or files to extend the versatility of the Eee Pad Transformer Prime experience.View largerRelax, ASUS Has You CoveredRanked as the #1 most reliable PC brand by 3 independent sources4, readers and editors alike choose ASUS as their trusted notebook and netbook. We tirelessly strive to exceed expectations of quality to ensure you an unmatched peace of mind every time you turn on your Eee Pad Transformer Prime.We also back our commitment with the industry's most comprehensive warranty.1 year North America warrantyFree one-way standard shipping24/7 tech supportWhat's in the BoxASUS EeePad Transformer Prime TF201-B1 TabletUser manualPower adaptor with USB to 40 pin connectorWarranty cardSpecificationsDisplay10.1-inch WXGA Super IPS+ capacitive multi touch display built withCorning&reg;Gorilla&reg;Glass; 178&deg; viewing angle(1280 x 800)Operating SystemAndroid 3.2 Honeycomb Platform (Upgradeable to Android&trade;4.0 Ice Cream SandwichChipsetNVIDIA&reg;Tegra&reg;3 mobile processor | with Quad Core CPUMemory1GB DDR2Wireless802.11b/g/nBluetoothBluetooth v2.1 + EDRStorage32GB eMMC FlashCamera1.2 megapixel (Front); 8.0 Megapixel (Rear)SpeakersBuilt-in Stereo Speakers with SonicMaster TechnologyCard ReaderMicro SD Card ReaderInput / Output1 x Micro HDMI, 2-in-1 audio jack (head phone/mic-in jack), internal micBattery Pack25 W/h Li-polymer battery (up to 12 hours)2Dimensions10.35\" x 7.12\" x 0.33\" (W x D x H)Weight1.29lbsColorAmethyst Gray and Champagne Gold&copy; 2011 ASUS Computer International. All Rights Reserved. ASUS is a registered trademark of ASUSTeK Computer. All specifications and terms are subject to change without notice. Please check with your supplier for exact offers on selected models. Products may not be available in all markets. Product may not be exactly as shown in photos. All trademarks are registered to their respective companies. ASUS shall not be liable for technical or editorial errors or omissions contained herein.1Upgradable to Android&trade;4.0 Ice Cream Sandwich. Android is a trademark of Google Inc.Adobe&reg;Flash&reg;update required from Android Market.2Actual battery life varies with usage. Battery life tested under power saving mode, playing 720p video playback, Brightness: 60nits, default volume with headphones. Operation lifetime subject to product model, normal usage conditions and configurations.3Compatible with DLNA Certified devices only.4Rated number 1 Windows-based PC maker in PCMag.com's Service & Reliability Report 2010. Rated number 1 PC brand according to SquareTrade, the leading direct-to-consumer warranty company (for more information visit http://www.squaretrade.com/pages/laptop-reliability-1109/ ). Rated number 1 reliable PC maker in Q2 2010's RESCUECOM report http://www.rescuecom.com/2010-2nd-Quarter-Computer-Reliability-Report.html.Check Out Other Great ASUS ProductsASUS Transformer PortfolioProtect your Eee Pad Transformer with the ASUS Portfolio cover designed to fit the tablet perfectly. The portfolio also has a fold-able cover that turns into a keyboard stand or a reader stand, making it convenient to use your Eee Pad comfortably for hours-on-end.Eee Pad Transformer Docking KeyboardIt is meant to be together. Add a docking keyboard to your Transformer tablet and get up to an amazing 16 hours of battery life. With 2x USB ports, an 4-in-1 card reader, the expansion possibilities are almost limitless. Its full QWERTY keyboard and a row of shortcut keys means you can get what you want done, faster, more efficient.ASUS Index Sleeve - BlackWhen docked, your Eee Pad Transformer is not just a tablet, it is also a very capable notebook style PC. Don't leave home without a sleeve protecting your Transformer. Check out this water-repellant textured leather sleeve with an soft sued interior.ASUS Index Sleeve &ndash; PinkWhen docked, your Eee Pad Transformer is not just a tablet, it is also a very capable notebook style PC. Don't leave home without a sleeve protecting your Transformer. Check out this water-repellant textured leather sleeve with an soft sued interior.", "title": "ASUS Transformer Prime TF201-B1-GR Eee Pad 10.1-Inch 32GB Tablet (Amethyst Gray)", "price": 399.98, "imUrl": "http://ecx.images-amazon.com/images/I/41L5X%2BEZ7RL._SY300_.jpg", "brand": "Asus", "related": {"also_bought": ["B00685ZDB2", "B0062OKDIC", "B006QFZ2QA", "B0072XQILS", "B006TOPR72", "B008FH1R0W", "B006ULQPTI", "B006QG47YW", "B0079O2C60", "B005PAINXQ", "B00AHC5RRC", "B006GM57MC", "B006PWGESY", "B004U78J1G", "B006PWGEVQ", "B007C1KGH2", "B004M5QPBM", "B006NVLDKG", "B007CAZWC2", "B006C64C6E", "B006LSCCPG", "B008F4NL04", "B0083P0AIG", "B008B0WUPO", "B0062OKE22", "B004M5QPHG", "B005XOPCBK", "B007AGY7X8", "B008G2GBN4", "B004M5OYRY", "B007LI2QJW", "B007P4YAPK", "B007GJR7GS", "B004M5QPFI", "B008D1RMGI", "B00C8T7F2M", "B00CFIDQZG", "B007QUHFGY", "B004U78JT8", "B0083OZV5E", "B007LI1UOE", "B007Q4VP9I", "B0075CFZ7O", "B004XZL980", "B008DWG5HE", "B007K94I2U", "B009HK30V0", "B004ZMICYA", "B008OMGT9W", "B003UH0Z9Q", "B007BTTGM6", "B004U78628", "B008B0XQ02", "B0088V3ZVO", "B007SHJIP6", "B006OS7230", "B0072XQI2W", "B008TO3PSS", "B007Q4WMSG", "B005ORQ350", "B0082CPCR4", "B008F4NL0O", "B00BCPIFC2", "B006WU9YMW", "B008F4NL18", "B000WBIN88", "B0060QHQ3M", "B0089RLGEA", "B00CBYXJ1U", "B0087DXLOO", "B006OGMGVA", "B00FNF7PSC", "B007KFXIDE", "B008CBUW02", "B0098O9TB0", "B004GYVPGE", "B00DB3SH2G", "B00ACGMKCI", "B006AR1QAA", "B007Q4W47A"], "bought_together": ["B0062OKDIC"]}}