{"asin": "B00GIY960C", "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Cases & Sleeves", "Sleeves"]], "description": "What is it?This is one of the simplest and most professional looking cases for your eReader.  The deep dark brown gives an elegant look and feel while the simplicity of this case is unrivaled.  There's nothing super-fancy about it  - it's just a basic synthetic leather sleeve with a premium look and feel.  The synthetic leather has just enough cushion to protect your Kindle Paperwhite but still remains a super thin solution for protecting your device while you throw it into your briefcase, backpack, or in with your stack of books.How it works:The Kindle is held into the case simply by friction - so no need to worry about breaking any buckles, snaps, or clasps.Who should buy this?If you enjoy using your Kindle without a case but still want to protect it when not in use - or find you remove your Kindle from it's case often, this is the case for you.  If you are looking for a complicated product that does all sorts of fancy stands and flips, don't buy this. If you want a simple, beautiful sleeve for your eReader, this is the case for you.  It's elegant and professional, yet incredibly easy to get your tablet in and out, frustration free.Compatibility:This sleeve is designed to be compatible with the Kindle Paperwhite, however it may fit other similarly sized eReaders.  The dimensions of the opening are 179 x 128 mm.  The Kindle Paperwhite is 169 x 117 x 9.1 mm, so if your tablet or eReader is close to that it may fit as well.", "title": "Synthetic Leather Kindle Paperwhite Sleeve by Dockem; Slim, Simple, and Professional Executive Case - Soft Microfiber Felt Lined Dark Brown Basic Synthetic Leather Protective Tablet Pouch Cover", "price": 9.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41zPZJNeAlL._SY300_.jpg", "related": {"also_bought": ["B00GCCJ0YC", "B00JG8GOWU", "B00KKDITJQ", "B00IISTKTI", "B009GU8KSO", "B007HCCNJU", "B00BGIQS1A", "B00JG8LDC6", "B009WAB256", "B00H9XFUVK", "B00GMRBZBS", "B00EYW9DSU", "B009WACR46", "B009GU8TVC", "B00IN0VE0O", "B00DQGII1I", "B00H1OR9RK", "B005X0JTP4", "B005HU0LX4", "B004JWA70I", "B00CP82E18", "B00CTTJRTU", "B00C107KSW", "B00B394K8K", "B009S2CWX4", "B00G8ZFP24", "B00FG38L16", "B00HA02RGS", "B00CXADBRY", "B003P2UMS0", "B000E7ZLHQ", "B00EYNN0UG", "B00EHDNAOE", "B006ZT4VA0", "B0000CD0HX", "B004F3MQIM", "B00GTGETFG", "B001M0MN16", "B00AAJOZN4"], "bought_together": ["B00BGIQS1A", "B007HCCNJU"], "buy_after_viewing": ["B00KKDITJQ", "B00JG8GOWU", "B00EYW9DSU", "B00BGIQS1A"]}}