{"asin": "B002JCSV6M", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]], "description": "The rugged D300S' hallmarks include versatility, speed, agility and exceptional image quality. Versatility is its 12.3-megapixel, DX-format CMOS image sensor, with Nikon EXPEED image processing that captures stunning low-noise stills and extraordinary 24 fps, 720p HD video with sound. Speed is split-second startup and continuous shooting at up to 7 fps-8 fps with the optional MB-D10 grip, which also extends shooting capacity and makes shooting more comfortable. Accurate image review, Live View shooting and Menus come alive on a 3-inch tempered glass-protected, 920k-dot LCD monitor, while image quality is bolstered by a 51-area AF system and Nikon's 1,005-pixel RGB exposure sensor, in concert with the newly accelerated Scene Recognition System technology that increases exposure and AF accuracy, improves white balance detection, and more. Photographers have preferences, and the D300S offers choices--including Picture Control, Center-Weighted and Spot Metering, user-assignable CompactFlash and SD card slots and an external stereo microphone input. Included is Nikon ViewNX software--ready to process rich 14-bit NEF (RAW) or JPEG files. For more editing power, optional Capture NX 2, with U-Point technology, safeguards image quality and speeds workflow. The D300S' pro-level performance, paired with world-famous Nikkor lenses, was engineered to exceed the expectations of demanding photographers.Nikon D300s Highlights12.3-megapixel DX-format CMOS Image SensorDelivers stunning high resolution, low-noise images with striking detail and tonal gradation.Continuous Shooting up to 7 fpsHigh speed shooting and fast response is essential to versatile performance in a wide variety of shooting disciplines.Nikon EXPEED Image ProcessingDrives breathtakingly rich image fidelity, low noise and fast image processing.D-Movie HD VideoCapture cinematic 24 fps, 720p HD movie clips, enhanced by Nikkor interchangeable lens quality and versatility&mdash;featuring stereo Mic input and AF3-inch Super-density 920,000-dot VGA LCD MonitorEvery monitor is factory-calibrated to assure accurate color for critical still image review and Live View or D-Movie shooting.One-button Live ViewHandheld and Tripod Live View modes, activated with one button, for challenging studio and remote shooting conditions.Low Noise ISO Sensitivity from 200 to 3200Additional expanded ISO settings of Lo-1 (ISO 100 equivalent) and Hi-1 (ISO 6400 equivalent) extend versatility to match shooting requirements.Fast, Accurate 51-point AutofocusFeatures 4 Dynamic AF modes including 3D Focus Tracking for precise autofocus and razor sharp images.Dual memory card slots (CF and SD)Assign card functions from a variety of storage options, optimizing available memory and file handling.1,005-Pixel 3D Color Matrix Metering IINikon's unique RGB metering is the only sensor that also evaluates color information when determining exposures with remarkable accuracy.Scene Recognition SystemReferencing an onboard image database and teamed with RGB metering, SRS enables even more sophisticated determination of exposures and auto white balance, along with faster, more accurate autofocus.Dynamic Integrated Dust Reduction SystemUltrasonic process combats the accumulation of dust in front of the image sensor, safeguarding image quality.Nikon's Active D-LightingOptimizes shadow and highlight detail in real time--selectable values and 5-frame ADL bracketing offer complete control.Picture ControlSelect from 4 preset image capture preferences (Standard, Neutral, Vivid and Monochrome, plus 9 user-customizable settings) controlling Sharpening, Contrast, Brightness, Saturation and Hue.In-Camera Image EditingExclusive in-camera image editing, featuring Edit move, D-Lighting, Image Overlay, Monochrome, NEF (RAW) processing and more.Rugged and DurableThe strength and precision of magnesium-alloy construction with advanced dust and moisture countermeasures is teamed with a shutter mechanism test to beyond 150,000 cycles for real-world reliability.100% Viewfinder AccuracyVirtual Horizon Graphic Level IndicatorUp to 950 shots per EN-EL3e battery chargeShoot as many 2,950 shots with the body's EN-EL3e battery installed and the optional MB-D10 Multi-Power Battery Pack with an EN-EL4a Rechargeable Li-ion Battery.*Based on CIPA standards/guidelines", "title": "Nikon D300S 12.3MP DX-Format CMOS Digital SLR Camera with 3.0-Inch LCD (Body Only)", "brand": "Nikon", "salesRank": {"Camera &amp; Photo": 5048}, "imUrl": "http://ecx.images-amazon.com/images/I/512SIid8XkL._SY300_.jpg", "related": {"also_bought": ["B000VDF5RO", "B000BYCKU8", "B001T9N0RQ", "B001EO6W8K", "B002JCSV8A", "B0058OGZIY", "B000VDF5VK", "1933952644", "B0013A1XDE", "B0042X9L6A", "B005DIYQA4", "B0050YG3CU", "0470521279", "B00CV9MMUE", "B00CV9MNH6", "B005LZSRLI", "B00065F86U", "B000VDCT3C", "B008B14VAK", "B003G40EGC", "B000GBERAM", "B001VO83A8", "B002NO8PTY", "B003ZSHNEA", "B00017LTFC", "B000144I2Q", "B001S2PPT0", "B005PCDSBQ", "B00D5NLVBQ", "B002I05VQI", "B000ZMCILW", "0470571535", "B0009PEU3Y", "B00099C2M6", "B007DBJ438", "B00FOTF8M2", "B0013A1XDY", "B001BTG3OQ", "B0049VZ4XE", "B001G9WAF2", "B003Y0631I", "B0026FCKC8", "B00015GYU4", "B008K83ZH4", "B00005LEN4", "B0002EMY9Y", "B005C50H2Y", "B000HJPK2C", "B000144I30", "B0012GDOQS", "B003HC8VA4", "B005IGVXO8", "B004TEUDOQ", "B00004ZCJM", "B0049U477Y", "B002O3MVYO", "B001GCVA0U", "B007FEFQDA", "1435456319", "B002JCSV8U", "B002LVUIXU", "B001ET5U92", "B00005LE6Z", "B008B14TQ6", "B00005Y3OM", "B002VGWFF4", "B0001CNMFM", "B0042X9LC4", "B007BZRXJ8", "B00004ZCJL", "B00DUQN57Q", "B000BY52NU", "B004XY65WQ", "B0015MHY6K", "B00004ZCJK", "B000BY52NK", "B003ZSHNCC", "B006O7158O", "B009IKC60K", "B0093HGDVG", "B004Y1AYAC", "B005EP26J4", "B00017LSPI", "B0093HGF32", "B000LWJ1ES", "B00BXA7N6A", "B007M54E1M", "B0009HN57E", "B003TYDBYQ", "B0000BZLBQ", "B0045KGZOG", "B009TCD8V8", "B000BYCKUI", "B0093HGD2K"], "bought_together": ["B000BYCKU8"], "buy_after_viewing": ["B000VJX7DW", "B001S2PPT0", "B003VNKNF0", "B004Y1AYAC"]}}