{"asin": "B003FMUMSA", "description": "The Philips SPA5210B/27 Notebook SoundBar is a compact, high-performance speaker that attaches to the top of your notebook computer screen. With the SoundBar, you can enjoy your favorite videos and music in full stereo. The speaker works with both PCs and Macs, and its lightweight, space-saving design makes it ideal for travel. Just slip it into the included carrying pouch and experience enhanced audio, wherever you go.Other notebook accessories you might like:Philips Notebook headsetPhilips Notebook SleeveDual integrated clips attach directly to the top of your notebook screen.View larger.The lightweight SoundBar greatly enhances the sound of built-in notebook speakers.View larger.The USB cable wraps neatly in the slot around the speaker.View larger.Enhances the Sound of your Notebook ComputerHear your favorite music and videos in full stereo sound with the innovative Philips SPA5210B/27 Notebook SoundBar. Whether it is attached to the top of your open notebook screen or used as a stand-alone speaker, the lightweight SoundBar greatly enhances the sound of built-in notebook speakers.Attaches to Notebook ScreenThe SoundBar features a sleek, stylish design that complements the look of any notebook. Instead of taking up valuable space on your desk or workspace, the speaker has dual integrated clips that attach directly to the top of your notebook screen.Compact Design Ideal for TravelLightweight and compact, the SoundBar is designed for travel. The USB cable wraps neatly in the slot around the speaker, rather than dangling loose. And the speaker comes with a handy carrying pouch, making it easy to take the speaker along, wherever you go.Convenience of Plug and PlayWith the convenience of plug and play, your notebook will automatically recognize the SoundBar as a removable USB mass storage device. Simply connect the speaker to an available USB port and you're ready to hear exceptional audio--no batteries or adapters required.Compatible with Mac and PCThe SoundBar Works with Windows 98, SE ME 2000, XP, Vista, and higher; MAC OS X and higher.Philips has certified the SoundBar as a \"green product.\" This means the speaker's performance is at least 10-percent better than that of similar products offered by Philips' main competitors on selected sustainability issues, such as energy efficiency, product weight, and life-cycle management.About PhilipsPhilips has a brand promise of \"sense and simplicity\" that encapsulates their commitment to understanding and catering to the desires and needs of consumers and customers. By putting end users front and center, Philips creates innovative products that are designed around people's needs and aspirations, and are both advanced and easy to use. With 60,000 registered patents, Philips is a global leader in innovation, and receives numerous international design awards every year.The Philips SPA5210B/27 Notebook SoundBar is backed by a one-year limited warranty.What's in the BoxPhilips SPA5210B/27 Notebook SoundBar, carrying pouch, and Quick Installation Guide.Notebook and Multimedia SpeakersNotebook CushionSpeakerNotebook SoundBarNotebook USB SpeakersMultimedia Speakers 2.0Multimedia Speakers 2.0Multimedia Speakers 2.0Multimedia Speakers 2.0Multimedia Speakers 2.1Multimedia Speakers 2.1Frequency response100-18,000 Hz&nbsp;&nbsp;&nbsp;100-18,000 Hz85-20,0000 Hz62-20,000 Hz at 10 dB Hz&nbsp;35 - 20,000 HzBass enhancement&nbsp;Bass reflexBass BoostBass reflex&nbsp;Analog Bass Boost, Bass reflexDynamic Bass BoostBass reflexAnalog Bass Boost, Bass reflexWatts&nbsp;&nbsp;&nbsp;10 W&nbsp;10 W40 W44 W20 WSpeaker Drivers&nbsp;&nbsp;2\"2\"x2\"&nbsp;2\"x3\"3/4\" tweeter, 3\"2.5\"2.5\"Subwoofer&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10 W5 WAudio Input&nbsp;&nbsp;3.5-mm stereo3.5-mm stereo3.5-mm stereo3.5-mm stereo3.5-mm stereo3.5-mm stereo3.5-mm stereoPlug and PlayUSB 2.0USB 2.0USB 2.0&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;", "title": "Philips SPA5210B/27 Notebook SoundBar", "price": 24.99, "imUrl": "http://ecx.images-amazon.com/images/I/41gXI3WL0YL._SX300_.jpg", "related": {"also_viewed": ["B006WPR60O", "B007R9RUPU", "B0043TB7OC", "B003VAK1I2", "B000UY1MB2", "B009WNBDJS", "B0036VO6IC", "B003JTHMRS", "B005EWB37S", "B000BF0XDI", "B000KIQ15U", "B004Z24L2W", "B0068472IK", "B00GOPDCJ6", "B005FE72Q6", "B003FMUMSU", "B00DQMJE7E", "B003VAHYXW", "B004ZEZGE2", "B007Z7PXTY", "B004QPKSQQ", "B004ROKASC", "B0028N6YH0", "B006580BB4", "B009XGH2HG", "B008D2IHES", "B0014KQCWK", "B0031H39N4", "B005KP5RKI", "B00ISANLQ4", "B009AS901I", "B0043ZWJHU", "B0057153KY", "B00CPTHW46", "B005LW42MY", "B003N9PJDI", "B008M76T1M", "B007B5WHTE", "B00HPQ0H0K", "B004X28I0A", "B00EZ46NUS", "B003WQ2T5S", "B00GHY5F3K", "B00CD1PTF0", "B001S14DYO", "B0025VKUPW", "B00EZ9XKCM", "B003CP0OT2", "B00AERGEW2", "B008KP4MQU", "B00BLCLURI", "B0042F3K9W", "B0027VT6V4", "B0049P6OTI", "B00EHZYWGM", "B00D5Q75RC", "B00B17C5KO"], "buy_after_viewing": ["B006WPR60O", "B007R9RUPU", "B0043TB7OC", "B003VAK1I2"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]]}