{"asin": "B00BAOX6EC", "related": {"also_bought": ["B00IKMHR3S", "B00BAOX6C4", "B00B1M98N6", "B001CQTLJM", "B007Q45EF4", "B00BI4JX2I", "B00FRZSBQI", "B004UAG77G", "B009DQJ8X2", "B00BLCLURI", "B006E0QAFY", "B0000AI0N1"], "bought_together": ["B00IKMHR3S"], "buy_after_viewing": ["B00BLCLURI", "B00BLCLURI", "B00ES2BQ7M", "B00D6OHHEE", "B00I2SI7DO"]}, "title": "Panasonic SC-NE1 Compact Wireless Speaker System with Bluetooth", "price": 99.99, "salesRank": {"Electronics": 8317}, "imUrl": "http://ecx.images-amazon.com/images/I/412PJAS5DBL._SX300_.jpg", "brand": "Panasonic", "categories": [["Electronics", "Home Audio", "Stereo Components", "Speakers", "Speaker Systems"]], "description": "Stream and share music stored on your mobile device, wirelesslyLets you enjoy your music in a whole new way, an innovative Music Streaming App that gives you more control. Supports all streaming technology (DLNA, AirPlay, Bluetooth Wireless) .Doesn't need a LAN network to operate, it can stream music from any Bluetooth Wireless Technology-compatible digital device!Bluetooth Re-Master Ensures Crystal-Clear SoundYou won't have to worry about lost or muffled signals ruining your sound, because the SC-NE1 automatically compensates for lost audio signals during Bluetooth wireless transmission. You'll always get high quality music, played on a world-class Panasonic speaker.Powerful Sound from a Compact SpeakerEquipped with a 2-Way Speaker System that boasts a 3-1/8\" Long Stroke Woofer with a Nanosized Bamboo Cone and 1\" Tweeter.  Gives you rich and robust sound, from crystal-clear treble to deep, pulsating bass.3-D Aero Stream Port Gives You Deep Bass with Less DistortionUses an innovative Aero Stream Port to produce dynamic bass with minimal distortion. Its unique 3-dimensional structure and rounded corners provide smoother and steadier airflow. Ensures you get a rich deep sound without the rumbling distortion that detracts from your sonic experience.Nanosized Bamboo Cone Speaker Provides Fresher, Clearer TonesEquipped with a bamboo cone speaker which provides greater sonic clarity while minimizing distortion.Pure Direct Sound System Reduces NoiseComes with noise-canceling technology. Using digital signal processing, it reduces the scattering so your sound is clean and pure, with significantly less distortion."}