{"asin": "B000JLIXIG", "description": "In Resistance: Fall of Man, US and British forces band together in a last-ditch effort to save England from a horric scourge -- the Chimera. This parasitic species infects other life forms with a virus that rapidly mutates victims into new Chimera. In mere decades this race has ripped apart populations across Asia and Europe and by 1951 has landed on the shores of England. You play the part of US a Army Ranger, fighting alongside a group of British resistance soldiers to free the country from the Chimera and to halt their spread across the globe.PLAYSTATION 3's killer app has arrived.Wield human or Chimeran weapons.View larger.Chimera come in a variety of terrifying shapes and sizes.View larger.The environments are incredibly detailed and lifelike.View larger.Enemies will flank you if you're careless about picking them off.View larger.The Chimera warsWar is everywhere and everything in Resistance. An alien race began toying with the planet just after Word War I and in mere decades, the Chimera &#x2568; a species of unknown origin propagating a virus that converts other life forms into more Chimera &#x2568; has overrun Russia and all of Europe. Humanity&#x2552;s hope for survival is slim, and the tide of the battle rests on the shoulders of U.S. Army Ranger, Sgt. Nathan Hale.The Chimera didn't plan to take this protracted war lying down, however, and amassed their forces in Russia. Once Russia was captured, they quickly erected a wall around the former country, rebuking all efforts at communication or contact. While the world waited and wondered what other terrors might spill from the wall, England prepares for and falls to a major Chimera invasion in 1951.The United States comes to aid their English allies, but all does not go as planned. The next three days will see some of the most intense fighting the war has known thus far, and it's up to you to end the Chimera threat before the plague of defeat can encircle the globe.Next-generation gameplay and styleThe gameplay of Resistance is classic First Person Shooter. Insomniac Games has combined its passion for creating exotic weapons and vehicles with a proprietary physics system to create unique human and alien weaponry. Many of the weapons of the game are era-appropriate, such as pistols and grenades. Other weapons, such as the Chimeran Auger, are of alien design. Due to the differences in the ways that the various weapons handle, great care must be taken when entering an area infested with Chimera with their own weaponry. In addition to the obvious array of weapons, players can use melee attacks and jump to avoid attack.Special game actions, called \"Skill Tasks,\" are worth set number of points that can be spent to unlock new content in the game. A Skill Task may be something as simple as killing a number of enemies in a short period of time or as involved as locating a hidden area in the single player campaign. The mystery of the tasks, however, is that they aren't actually revealed until you have completed the task. This makes for a great reply incentive, as you will be mowing down Chimera and be suddenly rewarded with task points, often when you least expect the reward.Obviously, presentation is one of the areas in which Resistance shines. The frame rate is silky-smooth, and never seems to get bogged down when there is a large number of Chimera or teammates on screen. Animations are believable, the locations are detailed, and the voice acting is top-notch. Explosions are especially impressive, sending shrapnel and smoke in all directions. If you're looking for a game to impress your friends with graphically, look no further. Resistance is the type of game that makes you feel confident about the future of the PLAYSTATION 3.Track stats and more onlineResistance also boasts an impressive 40 player online multiplayer mode. It's not uncommon to find large-scale battles with both intricate strategy and simple \"run and gun\" play styles. Created and managed jointly by Insomniac Games and Sony Computer Entertainment, MyResistance.net is the official online community destination for Resistance: Fall of Man. At MyResistance.net, players can view their multiplayer stats in near-real time, participate in forums with other fans, download unlockable content and more.", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/61t5W98uPQL._SY300_.jpg", "related": {"also_bought": ["B0012N3T3Y", "B003O6E67A", "B000FQBF1M", "B000ZK7ZOE", "B002I0K6DG", "B000UW21A0", "B00354NANC", "B001C4DKG4", "B001NJS8TM", "B000SQ5LQE", "B002ELCV00", "B004EQCCI4", "B002ZJNWWC", "B003P9FRGA", "B000FQ2D5E", "B001UWGCW2", "B002NN7AKU", "B001JKTC9A", "B000JLIYLC", "B002I0J5YW", "B0012N94WO", "B001QXNBNI", "B008E6ZXTA", "B008PQU3E4", "B005185SDA", "B008CP6RUW", "B003H0CBYS", "B002I0F5I2", "B000X1TC0U", "B005YR308S", "B000ZK9QCS", "B00269QLH4", "B001COV1CY", "B00576U7W8", "B005C2D1YI", "B000RHZ9G6", "B008CP6MA2", "B000O5FUKQ", "B000WJFZEA", "B0055202HE", "B002I0J82G", "B003O6KWZK", "B00503E9FY", "B005GM3XVA", "B0037LVW9M", "B000WMEEBM", "B000NGP1R8", "B002BRZ6UE", "B0050SXLQC", "B000TG72TM", "B001AWBYNE", "B007CM0K86", "B00320JAWY", "B00319DX4M", "B002BRZ744", "B004FYJFNA", "B00309XHD0", "B001NIP3EG", "B003Q55YCU", "B002DC8GKO", "B007TYC8MI", "B000HGOHWO", "B001TOMQOY", "B0050SWZHS", "B000UC5ML0", "B0050SXGU8", "B008CP6Q6M", "B0022TNO7I", "B000V1OUVI", "B000K9OR4Q", "B001NX6GBK", "B000UU7VUC", "B004PAGJNS", "B002I0JBL4", "B00269DX5W", "B001B1W3GG", "B000GA73O0", "B000HKP88C", "B002EE1P2W", "B001CRM3YQ", "B0050SX9VO", "B001SGZL2W", "B004EW948E", "B003JVCA9Q", "B0012N5MIO", "B0050SXEM8", "B0085CA8QG", "B0050SXX88", "B003GT8IL0", "B0036FDHT2", "B002I0GX88", "B0056WJA6C", "B004UDB9SA", "B00170823O", "B004918C4M", "B002I0J5FG", "B0023CBZ70", "B002I0K5NC", "B001AWDFUY", "B000XJLQ24"], "bought_together": ["B0012N3T3Y", "B003O6E67A"], "buy_after_viewing": ["B003O6E67A", "B0012N3T3Y", "B009JBFF9C", "B002I0K6DG"]}, "salesRank": {"Video Games": 3207}, "categories": [["Video Games", "PlayStation 3", "Games"]]}