{"asin": "B002N65P7W", "categories": [["Electronics", "Camera & Photo", "Accessories", "Lens Accessories"]], "description": "Always be in the shot with the Vivitar RC-200-RC - 40D wireless shutter release for Canon EOS 50D, EOS 5D Mark II, EOS 7D . This multi-function wireless remote allows the selection of either a 2 second shutter delay, or instant shutter release. With multi-exposure, you can take consecutive photos with ease. Long exposure mode will keep the shutter open for as long as you want, allowing for increased creativity in your photos. The shutter release can operate at ranges up to 100 meters. It features a switch to change between focusing operation and shutter release. With the Vivitar RC-200 Wireless Remote Shutter Release, you no longer have to worry about blurred photos, since you are not in physical contact with the camera. It's a great way to expand the functionality of your camera, and your technique. Features include: Instant Release: Press shutter once and take immediate pictures, Multi Exposure: Press shutter one time and camera will take 5 consecutive photos, or hold down for continuous shutter release,2 Second Release: Gives you the extra time you need to get into the perfect picture position, Long Exposure: Set camera to bulb mode and hold shutter release for 3 seconds. The shutter will now be open, press once more to take the picture. Wireless Remote Operates Up To 100 Meters. Switch for Focus Operation and Shutter Release. Frequency: 355 MHz . Code: 16,000,000 Combination Codes . Status Display: 2x Color LEDs . Power Requirements: Transmitter 12V/23A / Receiver 3V CR2 (Included) . What's Included: Wireless Transmitter, Shutter Release Cable, Hot Shoe Receiver , Wrist Strap , Metal Clasp. Compatible with: Canon 1V/3/1D/1DS/1DS Mark II/1DS Mark III/1D Mark II/1D Mark III/1D Mark IV/10D/20D/30D/40D/50D/5DMkII/7D/EOS5D.", "title": "Wireless Shutter Release for Canon 50D", "price": 34.99, "imUrl": "http://ecx.images-amazon.com/images/I/41w0ZpP3PuL._SY300_.jpg", "brand": "Vivitar", "related": {"also_bought": ["B001G9TYHE", "B000BNY64C", "B003MACYGS", "B0001GMIOE", "B001IMPVEE", "B005LT7CE2", "B002K42W50", "B005EVPZJQ", "0470455594", "B0014YZH9A", "B001CCAISE", "B005DECJBQ", "B000CLNHXY", "B00004ZCI3", "B000U92PHW", "B00007B4DM", "B0093HGF32", "B003CIBC36", "B0076DKLA8", "B003Y60DZO", "B00013MSUQ", "B00009XVCZ", "B00009MK5M", "B000YZGCIU", "B002N694A6"], "bought_together": ["B001G9TYHE", "B000BNY64C"], "buy_after_viewing": ["B0049HCSM8", "B001G9TYHE", "B005LZRUX4", "B00FU34H8S"]}}