{"asin": "B000EGELP0", "description": "Brain Age DS Brain Age: Train Your Brain in Minutes a Day for Nintendo DS is a fun, rewarding form of entertainment everyone can enjoy, as it helps players flex their mental muscles. Brain Age is inspired by the research of Professor Ryuta Kawashima, a prominent Japanese neuroscientist. His studies evaluated the impact of performing certain reading and mathematic exercises to help stimulate the brain. Brain Age presents quick mental activities that help keep your DS brain in shape. Activities include quickly solving simple math problems, counting people going in and out of a house simultaneously, drawing pictures on the Touch Screen, reading classic literature out loud, and more. You can also play sudoku, the number puzzle game which has become an extremely popular feature in U.S. newspapers. On your first day of exercise, you will take a series of tests and get a score that determines how old your brain is. This number is called your \"DS Brain Age\". By performing daily exercises just minutes a day over weeks and months, the better you will get at the exercises and the lower your DS Brain Age will become. We all know as we grow older our bodies change and it becomes important to regularly exercise to maintain health and fitness. Our brain is no different. \"Use it or lose it,\" as the adage goes. New research indicates mental acuity may be strengthened, like muscles, with brain exercises. Dr. Elizabeth Zelinski, dean and executive director of University of Southern California s Leonard Davis School of Gerontology, says games like Brain Age can help keep older generations of Americans minds active. \"Americans can do a great deal to maintain and even improve their mental abilities,\" Zelinski explains. \"Aging is about taking on new challenges for our minds. Nintendo s Brain Age is a great way to do that.\" That is where Brain Age comes in. The Brain Age exercises are designed to stimulate your brain. Solving simple math and logic problems quickly, and reading aloud, have", "price": 9.99, "imUrl": "http://ecx.images-amazon.com/images/I/51F5ENBJK0L._SX300_.jpg", "related": {"also_bought": ["B000QUYHIK", "B000EGELQ4", "B000TTZMCS", "B000T6Z73U", "B0098F1Y3K", "B000ME25P2", "B002TDIENG", "B002DOC93C", "B001LNYM90", "B001GT18H8", "B000VBIGJU", "B000U5TVGY", "B000ERVMI8", "B000SQ5LOQ", "B000FW64ZS", "B000V6I7TE", "B000FUWCRY", "B003YHJJW6", "B002EE5RD0", "B0009YDS10", "B0050SVMCC", "B001P1ZE68", "B000HKKQ3Y", "B001F62U4M", "B001D5DQJ8", "B000I10PY2", "B0029X90NO", "B003UVA4KC", "B00B2Q8RM4", "B005GDED6S", "B002AU0HZQ", "B003S2OO04", "B008YAGTDU", "B000A2R54M", "B003S2L66Y", "B000U5W3IW", "B003V63V2O", "B0036KRP72", "B000NUBY0C", "B001IK577C", "B000BIZR72", "B000FO4KO8", "B001AZ7RH8", "B003MUO5BU", "B000I10PYC", "B002I0GU2M", "B003P9BIAY", "B003KMJ9N4", "B000TZI2FQ", "B0019C6KC0", "B001290A3U", "B0009UBR3K", "B002B1TDV8", "B000SQ5LOG", "B000VXJEW6", "B008QLUSPM", "B000Y3PE7C", "B002KJCVYW", "B000HE9LL8", "B00B5U3588", "B000E9TBRK", "B0033BJS8S", "B001AZ7RHI", "B000X25GWW", "B0006B0O9U", "B000HEB3U0", "B000ZH55MG", "B0027ADDAA", "B0018SRLGE", "B001FEO71S", "B000U34SZA", "B005J3J5E0", "B0033BJSDI", "B000QJLQB2", "B000MNOYVQ", "B000HE7KZC", "B002WDL53O", "B000HKGMKK", "B0045YKOXK", "B000FJS4YA", "B0013HE5V4", "B002I0EPBA", "B002HJ9UWQ", "B007PX6MFM", "B008SBODGU", "B002F9005O", "B00438XXRM", "B000UCMI4Y", "B003BMJKI2", "B000P2XJ92", "B0009YDS0Q", "B001M6AHHW", "B0016BVY8O", "B001SICHU4", "B007PX6M9S", "B00005NECC", "B000FRV2UK"], "bought_together": ["B000QUYHIK", "B000EGELQ4"], "buy_after_viewing": ["B0098F1Y3K", "B000QUYHIK", "B000EGELQ4", "B000A2R54M"]}, "salesRank": {"Video Games": 4567}, "categories": [["Video Games", "Kids & Family", "Nintendo DS", "Games"], ["Video Games", "Nintendo DS", "Games"]]}