{"asin": "B0002JUH3O", "description": "Portability meets capability in Garmin's pocket-sized Quest portable automotive global-positioning system. The easy-to-use device is loaded with the high-end navigation features from Garmin's most popular GPS navigators. Use it in multiple vehicles or simply slip it in your pocket for handy street-level directions when you're navigating on foot.Navigation page.View larger.Detail map at 500-foot zoom.View larger.Trip information page.View larger.The Garmin Quest Navigator is a pocket-sized device loaded with GPS navigational features.View larger.Smaller than a standard television remote, the Quest provides ample screen viewing area but won't demand a lot of room on the dashboard or in the briefcase. The device sports a bright, 256-color, high-resolution TFT display that is easy to read even in bright sunlight. The device is easy to use; just make certain your antenna is unobstructed and you'll be ready to navigate. Whether you're on foot or in your car, position the antenna to be parallel with the surface of the road so it can have the best view of the sky. This flip-up antenna design allows you to maximize your reception.Once the Quest has established a satellite fix, it will display the Ready to Navigate message. You can either set a destination or use the handy Find Menu to pick a destination, such as a restaurant, gas station, or other nearby attractions. With your destination selected, you'll love Quest's automatic routing with turn-by-turn directions and voice guidance to get you where you're going. And the built-in high-speed processor means fast, automatic off-route and detour recalculations, so you'll be sure to get where you're going even if you make a wrong turn or meet unexpected road construction.A USB data connection ensures fast map downloads from Garmin's entire line of MapSource CDs. The unit ships with fully unlocked MapSource City Select CD, providing full coverage of the entire United States, Canada, and Puerto Rico, including more than five million points of interest like gas stations, ATMs, hotels, restaurants, and attractions. With 115 MB of internal memory, this small-but-powerful GPS navigator has plenty of built-in map storage, and the unit's internal rechargeable lithium-ion battery provides up to 20 hours of use between charges. The unique antenna folds flush with the unit when not in use, and you can connect an optional external antenna as well.For weekend warriors using the unit on a camping or fishing trip, the Quest is waterproof and fully compatible with the entire line of MapSource outdoor cartography, including U.S. Topo, 24K Topo, Recreational Lakes with Fishing Hot Spots, and BlueChart.What's in the BoxQuest with flip-up GPS antenna, Americas Autoroute basemap, MapSource City Select North America CD with full coverage and full unlock, PC/USB cable, A/C power adapter, external speaker with 12-volt adapter cable, vehicle suction cup mount, quick reference guide, and owner's manual.", "title": "Garmin Quest Pocket-sized Navigation System", "price": 79.99, "imUrl": "http://ecx.images-amazon.com/images/I/51S5A83PDML._SY300_.jpg", "related": {"also_viewed": ["B00BHADL3U", "B002G1YPIE", "B008M59RUO", "B000066TPO", "B0050SNCPC", "B000058BCQ", "B00542NV32", "B002EOULAE", "B00HVUEGVQ", "B00HPPWOEI", "B00542NVDW", "B002G1YPIO", "B002QBSYOA", "B0050SNCN4", "B00HV3OD1G", "B000A5T7AO", "B006ZGB58Y", "B000V4TMWC", "B00B2F4O86", "B000058BCO", "B000064184", "B0062NEHOO", "B000BGVYYE", "B003CYKYVQ", "B000CSOXTO", "B003IHV6XW", "B002EOSQII", "B00542NVS2", "B001F7BL0U", "B00029TN9S", "B000PDR230", "B008VWNBBE", "B00007MIKM", "B000PDR27G", "B00003OPEU", "B0029LDDPM", "B003IHV6Z0", "B000CSSHG4", "B00D45DNJI", "B005DIBHA6", "B004JU0E2G", "B00HU7F6PA", "B00005OLY8", "B000OEZSXQ", "B00H8PLGQC", "B0086V5X8Y", "B00C94G8NI", "B00EEJWT2K", "B00J8DVEYG"], "buy_after_viewing": ["B0057ODG6Y", "B00AXX0I88", "B00542NVDW", "B00313JX4W"]}, "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]]}