{"asin": "B0001G6U52", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Amazon.com Product Description  Put the power of advanced photography in your hands with the Canon PowerShot S1 IS ultra-zoom digital camera. With its super-long Zoom, amazing stability and true Movie Mode, the PowerShot S1 IS brings a new dimension to the PowerShot line. Equipped with a host of top-quality features, this stylishly compact camera lets you create stills and movies like you've never done before.10x Optical 38-380mm Zoom with exclusive Optical Image StabilizerClose, closer, closest: the high-speed Zoom Motor moves you in at top speed in near silence. So the high-resolution, super long 10x Optical 38-380mm Zoom Lens (35mm equivalent) with Canon&rsquo;s exclusive optical Image Stabilizer can let you capture the action with an intensity you've never seen before. Canon's shift-type optical Image Stabilizer (IS) technology, which significantly reduces the effects of camera shake--an important feature for high-magnification lenses. Tiny movement detection gyros and a correcting lens element counteract the effects of lens shake to deliver sharper final images. The resulting compensation is the equivalent of between 2 and 3 extra stops, which means the camera can be used at slower shutter speeds without a tripod without any detectable increase in image blur.", "title": "Canon PowerShot S1 IS 3.2 MP Digital Camera with 10x Image Stabilized Optical Zoom", "price": 47.67, "salesRank": {"Camera &amp; Photo": 11787}, "imUrl": "http://ecx.images-amazon.com/images/I/5110YADX63L._SY300_.jpg", "related": {"also_viewed": ["B0009GZSSO", "B003KJM05Q", "B00I01AX3A", "B003E47FUM", "B001O1GEU4", "B009KDXHBC", "B0084292EG", "B007Z36HWU", "B000Q3043Y", "B004LB4SAM", "B008C3A1V0", "B000EMWBV0", "B004FJ8II8", "B004LB4SBG", "B00001QEMF", "B003IHVEU2", "B003VTZE1M", "B0075T7NW2", "B003E47FUW", "B0084IKKX2", "B005I6DVC0", "B008N9DRPA", "B00DRG0AKY", "B002KV30A4", "B00630J2CI", "B00EAY1O66", "B000P6R3DQ", "B0071IJ20I", "B00555CSN2", "B002LITT3S", "B003B437GG", "B00EFILR6E", "B0011E870E", "B001G5ZTZO", "B003LPQ2B2", "B0073HSIY8", "B003E47FT8", "B004LODKYY", "B0011ZK6ZM", "B005PZ1BR6"], "buy_after_viewing": ["B0009GZSSO", "B003VTZE1M", "B007BJHETS", "B008L24488"]}}