{"asin": "B000UU7ZPS", "description": "Garmin's n&uuml;vi 260 combines the thinprofile and attractive price point of other n&uuml;vi 200-series GPS with directions in real street names. As with all n&uuml;vis, you get Garmin reliability, the fast satellite lock of a high-sensitivity integrated receiver, a slim, pocket-sized navigator with a gorgeous display, detailed NAVTEQ maps that lets you search by name for more than 6 million points of interest like stores, restaurants or hospitals, and an easy, intuitive interface.Which n&uuml;vi is Best for You?:Click hereto see a quick, simple comparison of features for all Garmin nuvi GPS navigators.Then&uuml;vi260 comes preloaded with maps for U.S., Hawaii, and Puerto Rico, and features an ultra-slim design.Text-To-SpeechThe text-to-speech feature of the n&uuml;vi 260 means that device automatically calls out street names (saying \"turn right on Main Street\" instead of \"turn right in 200 feet.\"). This feature lets drivers keep their eyes on the road while navigating through busy traffic and tricky roadways.Smart, Powerful DesignThe n&uuml;vi 260W is built with a high-sensitivity GPS receiver for extreme accuracy, as well as an SD card slot for storing your media and additional navigation tools, and a USB interface for loading data. All this is wrapped up in a package that measures 4.8 x 2.9 x 0.8 inches (W x H x D) and weighs just 6.6 ounces. The n&uuml;vi display is touchscreen-enabled, making it a cinch to control the device with your fingertips. A rechargeable lithium-ion battery provides up to five hours of battery life depending on use.Garmin LockGarmin's patent pending theft prevention system that disables the unit from performing any functions until the user types in a specific 4-digit PIN or takes the unit to a predetermined secure locationNavigate with EaseThe n&uuml;vi 260 comes ready to go right out of the box with preloaded City Navigator NT street maps, including a hefty POI database with hotels, restaurants, fuel, ATMs and more. Simply touch the color screen to enter a destination, and n&uuml;vi takes you there with 2D or 3D maps and turn-by-turn voice directions. In addition, the n&uuml;vi 260 accepts custom points of interest (POIs), such as school zones and safety cameras and lets you set proximity alerts to warn you of upcoming POIs.Important note about map updates:Due to our high volume of sales, almost every Garmin portable GPS navigator sold by Amazon.com will come with the most recent map version. If you ever do need a map update, you can purchase one from Amazon.com at ourGarmin Store.Easy To Use InterfaceGarmin's interface is a key to their success and one of the things that makes their devices such a pleasure to use. Simple controls and sub-screens make it easy to enter or search for destinations and get data about your trip.Beyond NavigationNavigation is just the beginning. n&uuml;vi 260 features travel tools including JPEG picture viewer, world travel clock with time zones, currency converter, measurement converter, calculator and more. It also comes with Garmin Lock, an anti-theft feature, and configurable vehicle icons that let you select car-shaped graphics to show your location on the map.This device is compatible with optional content plug-ins available via SD card, such as theGarmin Travel GuidesandGarmin SaversGuideprovide detailed data for attractions and information on nearby merchants offering discounts, so you can customize n&uuml;vi for your travel needs.Garmin has also added the ability for customers to add custom points of interest (POI&rsquo;s) from third parties such as school zones and safety cameras.Browse your stored pictures with an easy-to-use JPEG viewer.n&uuml;vi 260W accepts custom points of interest (POIs).View larger.Trick Your GPS RideCustom vehicle icons let you ride in style, at least inside your GPS.See more icon optionLike all n&uuml;vis, the 260 supports configurable vehicle icons. These fun, customized car-shaped icons come in a variety of colors to add a personal touch to your vehicle's position on the map.What's in the Boxn&uuml;vi 260, preloaded City Navigator NT for the continental U.S., Hawaii, and Puerto Rico, Alaska, and Canada, vehicle suction cup mount, vehicle power cable, dashboard disk, and set up and go guide.Note:Like most USB Mass Storage Devices, the n&uuml;vi is not compatible with Windows 95, Windows 98 or Windows Me.Which n&uuml;vi is Best for You?Note: All n&uuml;vis come with detailed NAVTEQ maps containing more than 6 million pre-loaded point of interest locations.", "title": "Garmin n&uuml;vi 260 3.5-Inch Portable GPS Navigator (Discontinued by Manufacturer)", "price": 79.99, "imUrl": "http://ecx.images-amazon.com/images/I/51N5xZ7m6EL._SX300_.jpg", "related": {"also_bought": ["B0029EYRVS", "B002IUG14O", "B0097I53RG", "B001M09MUG", "B0011ULQNI", "B009ABO2N6", "B001QKZ3OQ", "B000NVZE5M", "B003CJ6IMA", "B000NW12C0", "B001U0O7RG", "B000LRMS66", "B0015EWMX8", "B00176BDD4"], "buy_after_viewing": ["B0057ODG6Y", "B002IUG14O", "B0057OCDQS", "B0057ODOCA"]}, "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]]}