{"asin": "B00795A63A", "categories": [["Electronics", "Camera & Photo"]], "description": "Handy pocket-sized reference cards contain everything you need to know while out shooting with your Nikon Digital SLR camera, allowing you to head straight out to shoot rather than studying the manual or taking classes. Learn what is causing the bad results in your shots and how to solve the problems!- Sturdy plastic cards are weatherproof and rip-proof- Cards are on a ring for easy flipping back and forth- Colored cards to easily find each topic- Eliminates the need to carry a manual or how-to book- Easy to read, concise, helpful information!Covers all the topics you need while out shooting! This includes camera functions and menus, exposure, the histogram, photography basics, equipment, and more. Also includes a guide to troubleshooting and then fixing common problems with photos - such as blurry or overexposed images.Use the included metal clip to attach to your camera bag or anything else with a loop for easy access. Specific color and size of clips and cards may vary.Each shooting situation is on its own card for easy reference and includes recommended camera settings, equipment, tips and more. Some of the environments and settings covered are sports, sunny days, night, low light, sunrise and sunset, portraits, macro, interior, HDR (High Dynamic Range), and special situations such as fireworks and lightning photography.All the information is presented in helpful, easy to read text! Thousands of happy photographers have already benefited from this product.Designed to work with all modern Nikon DSLR cameras:Nikon D3300, Nikon D3200, Nikon D3100, D3000Nikon D5300, Nikon D5200, D5100, D5000Nikon D7100, Nikon D7000Nikon D610, Nikon D600Nikon D800, D800f, D700, D4, D3S, D3X, D90, D80, D60, D40, D300S, D300, D200 & more!", "title": "Nikon DSLR Photography Nikon Camera Tip Cards / Cheat Sheets Manual / Guide for D3200, D3100, D3000, D5200, D5100, D5000, D7100, D7000, Nikon D600, D90, D300S, D300, D60, D80, D40, D200 &amp; More", "price": 18.95, "salesRank": {"Camera &amp; Photo": 105}, "imUrl": "http://ecx.images-amazon.com/images/I/51ymOxQ2InL._SX300_.jpg", "related": {"also_bought": ["B0069R7FFQ", "B005197472", "1118446836", "B008GSHBVO", "B008MLAT78", "B00F5JV4NS", "B00906D9GM", "B00CZCDWWO", "B005K1Y4I8", "B0047QRA2E", "B005UG3KS8", "B008PASLAI", "B008UQ7OFK", "B00BQ70CBI", "B00C629F3I", "B003Y0631I", "B007VGGIB6", "B008OKNUJ6", "B003VZ7GEY", "B00A7AY360", "B0092ZUJMI", "B00A03LSYE", "B00906D9YE", "B0080JH3YE", "1118530470", "B00HMP1PCS", "B005HZZ2N8", "B0051G9ZTK", "B00H84WRK2", "B002P9HXMW", "193753832X", "0321864433", "1285171306", "B003ZSHNCC", "B002VPE1WK", "1285763114", "B00573YYWA", "B00H8Z40C4", "1285424603", "1118118197", "B00CX1O92O", "B00CFSSJL2", "B00007EDZG", "B00I6TC6XG", "0321913124", "B002P9FOUU", "B001F6TXME", "B006NPNEDQ", "B00BQQUCD2", "B004MDF060", "B008MBDRTK", "B00A9YWB4K", "B004TS1DUU", "1118530462", "B00CJAP1YE", "B00CCKE4J4", "B004N71QU4", "B0082RT1OE", "B008EQRVSG", "B00DOZUL1Q", "B00BJ3NGFS", "B0083WY9RW", "B00006JN3G", "B00AY7ZRS4", "B00004ZCJG", "B00DMFWMME", "1118004728", "B000PTFDYO", "B0048IW030", "B00ELSCTFG", "B001S2PPT0", "B002VGWFF4", "B00G9G76PQ", "1934148644", "B0012X43P2", "B0007M6GI6", "B000KZ70JE", "B005EP36NY", "B0045KGZOG", "B005GVJ5B8", "B004X7U5N8", "B00I226142", "B00004ZCAU", "0133854426", "B006WSQUVM", "0470578947", "B003Y5T464", "B004Y1AYAC", "B00BUK29V2", "B007NDL56A", "B0052Z9HZ2", "1285759877", "B00BL8DZ84", "B005TCJJ9M", "B0006Z61EI", "B00J4TU5K8", "B004DEKH84"], "bought_together": ["B0069R7FFQ"], "buy_after_viewing": ["B00F5JV4NS", "B00906D9YE", "B008GSHBVO", "B0069R7FFQ"]}}