{"asin": "B0043DKBTK", "related": {"also_bought": ["B003MQWN40", "B003OBUJIK", "B000DZH9H4", "B0029U0X24", "143545944X", "B0049WBZEK", "B0029U0X1A", "B00004ZCJH", "B005K8AUMK", "1118176847", "B003VNKNF0"], "bought_together": ["B003VNKNF0"], "buy_after_viewing": ["B00B7ID99I", "B003MQWN40", "B003OBUJIK", "B0029U0X24"]}, "title": "Sony a55 DSLR Camera with 18-55mm zoom lens", "price": 799.0, "salesRank": {"Camera &amp; Photo": 7499}, "imUrl": "http://ecx.images-amazon.com/images/I/51FzdbHTt4L._SY300_.jpg", "brand": "Sony", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]], "description": "Change the way you shoot pictures with Sony's new Translucent Mirror Technology DSLR camera. The SLT-A55V Alpha DSLR camera features professional-grade continuous shooting at 10 fps and visibly faster, more accurate focus in Live View and HD Movie modes. Compose your shots on either the LCD monitor or electronic viewfinder with 100% framing accuracy. Advanced features including Auto HDR, Sweep Panorama and 15-point Auto Focus make it dramatically easier to get the best shot.Sony Alpha a55 HighlightsUnprecedented Image CaptureUnlike other DSLRs that can either shoot or focus with the speed and precision of Phase Detection AF, the SLT-A55V is the world's first DSLR that can do both simultaneously1. Featuring an unprecedented Translucent Mirror, the a55V DSLR camera is able to feed both the image sensor and the Phase Detection at the same time.&nbsp;Professional Class Shooting SpeedsBy transforming the fundamental way DSLR cameras work, you'll experience best-in-class speed3, up to 10 fps continuous shooting at full 16.2MP resolution with exposure fixed at the first frame. This is made possible by a Translucent Mirror that always stays in place. You also get standard continuous shooting at up to 6 fps.Astonishing HD Video CaptureExperience a revolutionary breakthrough in video capture when shooting fast-moving subjects. The a55V is the world's first camera with the precision of Phase Detection auto focus (AF) for HD Movies1. Translucent Mirror Technology not only enables full-time phase-detection AF for photos, it also delivers the same speed and precision for Full HD movies.Spectacular Resolution and DetailFeaturing a large 16.2-megapixel Exmor APS HD CMOS sensor, you'll achieve beautiful image quality during both still-photo and movie shooting. Rich tonal gradation and highlight/shadow detail are assured by the BIONZ image processing engine which supports high-speed continuous shooting, advanced digital compositing, and Full HD movie recording.Advanced Still Shooting FeaturesExpand your creativity with advanced imaging features including built-in Auto HDR, which captures more scene contrast by combining the best highlight detail from one shot and the best shadow detail into one unbelievable shot. Map your journey via an integrated GPS receiver, or use 3D Sweep Panorama Mode to automatically capture expansive landscapes.Versatile Shooting OptionsUse both the LCD monitor and Electronic Viewfinder to compose your shots. An all-electronic design enables a wide range of shooting information to be displayed in the finder and on the LCD monitor. Both provide a what-you-see-is-what-you-get preview of white balance, focus, depth of field, exposure and 100% framing accuracy, plus on-screen displays.What's in the BoxAlpha A55 digital SLR bodyShoulder StrapCD-ROMBattery Charger (BC-VW1)Body CapRechargable Battery (NP-FW50)USB Cable"}