{"asin": "B001CMJAP6", "description": "The Last Remnant for the Xbox 360 is the first role-playing game in a new series from Square Enix. This game delivers breathtaking visuals only possible on next-generation platforms, a mysterious storyline full of powerful artifacts, and a massive battlefield where you'll be surrounded by countless foes and friends alike..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Join Rush and David as they battle the Conqueror's Army and search for Irina.View larger.Castanea, the Conqueror, and Roeas lead the enemy's search for the RemnantsView larger.Orders in battle are given in a command-select style.View larger.Morale plays a role in a unions ability to inflict damage.View larger.The Story UnfoldsIn ancient times mysterious artifacts, referred to as Remnants, were discovered all over the world. People used these objects for their awesome powers -- a choice that eventually caused a rift in the world's balance. A thousands years later, the story of The Last Remnant begins.Rush Sykes and his sister Irina are children of scientists researching the esoteric Remnants. One day, Irina is kidnapped right before Rush's eyes. Determined to rescue his sister, Rush joins forces with David Nassau, the marquis of a small city-state called Athlum. Together they are determined to pursue the criminals and save Irina from her strange captors.Meanwhile, the world is thrust into confusion as ruling powers bicker over dividing the Remnants' powers. Soon a mysterious man appears calling himself the Conqueror. His presences escalates tensions as everyone eagerly attempts to answer the question: Into whose hands will the power of the Remnants fall? Before he knows it, Rush becomes wrapped up in this international power struggle and realizes that he is somehow connected to the enigmatic Conqueror.Allies and EnemiesBefore her kidnapping, Rush Sykes lived a peaceful life with his 14-year-old sister, Irina Sykes. Irina is a cheerful, resilient girl who stays upbeat even during the toughest of times. Some mysterious power seems to rest within here, but she herself has no understanding of what it is or what it can do. David Nassau, the 19-year-old who rules over the state of Athlum, spends his days working towards better his homeland. Although he decides to join Rush on his quest to rescue Irina, his motives are his own. Emma Honeywell, the matriarch of the Honeywells clan, Plagus, Blocter, and Torgal round out the allies.The man known only as the Conqueror and his minions are eager to seize the Remnants throughout the lands. His origin is shrouded in mystery, but it appears that something strange and elusive connects this villain to Rush. Enamored with the Conqueror, Roeas has declared her eternal allegiance to him and acts as the ambassador of the Conqueror's Army. Although beautiful in form and voice, Roeas is sadistic and menacing on the battlefield. Originating from a large-bodied species with pronounced fighting abilities, Castanea is Roeas right-hand-man. He rarely speaks or expresses himself, so it is difficult to decipher his thoughts -- although Roeas seems to understand him easily. In addition, the strongest fighters in the Conqueror's army are referred to as The Seven. The Seven lead their own troops and report to Roeas and Castanea.Combat Systems: Morale, Battle Unions, and DeadlockBattles are fought between multiple friendly and enemy unions -- groups of up to five characters who fight together. Players give commands to unions as a whole, who then carry out the actions. Orders in battle are given in a command-select style that is familiar to most role playing gamers. However, The Last Remnant commands are not delivered with standard terms, such as \"Item\" or \"Magic.\" Instead, players control unions with specialized commands, such as \"Slam 'em with status ailments!\" or \"Do area attacks from afar!\" Available commands change depending on the current battle situation or the distance and positions of friendly and hostile unions.The Last Remnant adds a Morale component to the gameplay. Players can check current morale via the gauge across the top of the screen. The higher the morale, the more damage is dealt and less damage is taken by friendly unions, and vice-versa. When friendly and enemy unions go toe-to-toe and engage in melee combat, they enter a state called Deadlock. Once in Deadlock, the two unions must fight each other until one union has been completely destroyed.Enemy monsters roam the land where they can be avoided or engaged at will. When battle is initiated, the scene changes to a specialized battle map where friend and foe can fight it out. Horizontal lined icons labeled A, B, C, etc. represent the on-field battle unions. Players choose which hostile union they wish to attack on this screen. The Last Remnant offers a wide variety of commands that focus on dealing damage or executing defensive maneuvers. Knowing which commands are most suitable for each situation is the key to winning battles.The Last Remnant delivers breathtaking visuals, a mysterious storyline full of powerful artifacts, and a massive battlefield.", "price": 65.87, "imUrl": "http://ecx.images-amazon.com/images/I/51bnJ5%2B3pFL._SY300_.jpg", "related": {"also_bought": ["B00149NCYW", "B000ZJVDA2", "B001LGFPSY", "B0028A6V7Q", "B000QW9D14", "B0015HZLVA", "B000PC4FYK", "B002W5GI9I", "B000FLZEXM", "0744010764", "B000FUG5WC", "B002BRWUA8", "B002BRUTT2", "0804163448", "B00ICWO1XA", "B000WCN7G0", "B004JHJHCC", "B002C0VNVG", "B000HGMH12", "B00122OBH8", "B001CMIUYS", "B000ICV996", "B003O6E9EK", "B000R0SS3Y", "B0043B5SLI", "B003KT0ACG", "0744010365", "B00319DX4W", "B0013TLQH8", "B003O6EBRA", "B0016NRS8M", "B004Q4CZY0", "B00KWJ4JW4", "B003O6G6G4", "B000MTF054", "B00K85X1W6", "B003FBL85W", "0761558802", "B002I0JGDM", "B000P8WOMO", "B0030GBU32", "B000G0JD9I", "B006GHA8EE", "B000ZK695U", "B002I0J4AM", "B0047TG2R0", "B002BRYHY0", "B00KWIYPZG", "B00KWFCU4M", "B000FRVAD4", "B004Q4EQ4M", "B0058VI0SU", "B00D87TCN8", "B001IK1BJ0", "B0044SA70M", "B001CRQY1E", "B00BY0G0YU", "B00K5UZMJO", "B004NRN5DU", "B0016C3260", "B00ANGVX9I", "B001CBW18K", "074401543X", "B00J22636W", "B000HCQK0A", "B00KAEIS6O", "B00K5UZMGM", "B002Q21X7Y", "B001YI0Z2U", "B00J6DLPLK", "B004WL4LOY", "B007PNBU0Y", "B001IKHVTE", "B00KVRK39A", "B001NX4DUQ", "B00K2O4O6U", "B00432O4VM", "B0019VMEN0", "B002GPPPS4", "B001P2PW3M", "B002BRZ8BQ", "B00946FSJ4", "B00J2G4Z6I", "B00KVVO63U", "B008H0CMKG", "B007FMSH4W", "B007CSF3GO", "B004A88W8K", "B00B59MXDM", "0804162867", "B003E6VK5Q", "B003O6E7AG", "B00G6S2SE6", "B004H0J5S2", "B00B2QL2Y4", "B0009SQFHA", "B0016NUZFU", "B003O6HGHM", "B001EOQV9U", "0804162972"], "bought_together": ["B00149NCYW", "B000QW9D14"], "buy_after_viewing": ["B000ZJVDA2", "B0015HZLVA", "B001LGFPSY", "B00149NCYW"]}, "salesRank": {"Video Games": 6620}, "categories": [["Video Games", "Xbox 360", "Games"]]}