{"asin": "B0061R1XI4", "related": {"also_bought": ["B007SBGBDO", "B00HK8V0YK", "B004OA758C", "B004OA6VU0", "B00DVWWV0Q", "B0062P7ISY", "B00E6G8IF8", "B003UHYDYO", "B004OA74B0", "B004OA6XAI", "B006IWGGL6", "B004OA6X4Y", "B0011UXSHK", "B004KPGPXW", "B000FNFSPY", "B00DVWYRCQ", "B007P8DLR4", "B004UW0EMS", "B002AMW2ZC", "B00FUQ6KTY", "B0098B5GN8", "B001LQG28G", "B000784H4K", "B009IRGQPO", "B00A1ZTZOG", "B0083J7N78", "B000N99BBC", "B00007M1TZ", "B000JE9LD4"], "bought_together": ["B004OA758C"], "buy_after_viewing": ["B0062P7ISY", "B00DVWWV0Q", "B00DVWYRCQ", "B006IWGGL6"]}, "title": "magicJack Plus", "price": 48.81, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31CKfikBArL._SY300_.jpg", "brand": "magicJack", "categories": [["Electronics", "Portable Audio & Video", "Digital Voice Recorders"]], "description": "magicJackTM Plus can be used with or without a computer - it&#x2019;s the customer&#x2019;s choice. Each magicJackTM Plus comes with an Ethernet (internet) cable and a Power Adapter.  You can, of course, still directly plug the magicJackTM Plus into a computer&#x2019;s USB port. A USB extension cord is included with each magicJackTM Plus. This option is especially useful or individuals who travel with their magicJackTM Plus.  In addition to offering free local and long distance phone service throughout the United States and Canada (including Puerto Rico and the U.S. Virgin Islands) that will stay on at all times, customer&#x2019;s existing phone numbers can now be transferred or &#x201C;ported&#x201D; to their magicJackTM Plus. Please note that there is a $19.95 charge to transfer/port a phone number and it&#x2019;s $9.95 per year thereafter. Porting is only available in the U.S. only for now.  Of course, each magicJackTM Plus includes a free new phone number so customers who do not wish to transfer or port their existing phone number may select a new one.  magicJackTM Plus, like magicJackTM, includes free: Voice Mail, Call Waiting, Caller ID, Call Forwarding, Directory Assistance and emergency 911service."}