{"asin": "B00114LG7U", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "From the leaders in the imaging industry, the Canon FS-series are the next-generation Flash Memory format camcorders for shooting great video and photos. Flash memory format delivers delivering optimal image quality, quick response time, flexible media exchange, and extended recording times all in a compact and lightweight body. The FS100 provides outstanding features such as 48x Advanced Zoom an SDHC card slot for your once-in-a-lifetime memories.Canon FS100 Highlights1/6-inch, 1.07-megapixel CCD image sensorWhether you&rsquo;re shooting video or photos, you will benefit from the camcorder&rsquo;s razor-sharp CCD image sensor.48x optical zoom in actionGenuine Canon 48x Advanced ZoomCapture the action from even farther away when using Canon&rsquo;s exclusive Advanced Zoom. By utilizing Genuine Canon Optics and the DIGIC DV II Image Processor, Canon has developed a new way to extend beyond the optical zoom, both wide and telephoto, while continuing to maintain optimal image quality. With Canon&rsquo;s Advanced Zoom, you can now enjoy stunning video from any distance.Image stabilizerShoot rock-steady video -- even when you&rsquo;re at maximum telephoto without a tripod. It is even effective while panning or zooming.DIGIC DV II image processorDIGIC DV II is the next generation of Canon's exclusive DIGIC DV signal processing technology. Even though video and still images have different color requirements, DIGIC DV II digital signal processing ensures optimal image quality for both video and still images. Thanks to DIGIC DV II image processing, the FS100 produces video with improved color reproduction -- especially in skin tones, and dark and light scenes. It also uses a hybrid noise reduction system that employs two types of noise reduction -- for images that are crystal clear.Quick StartInstead of powering off your camcorder between shots, simply press the Quick Start button to put the camcorder in stand-by mode. Quick Start considerably reduces the power consumption of the battery and allows the user to return to recording mode in less than a second, so you&rsquo;ll never miss another special moment.Widescreen HR recordingThe FS100 records true widescreen for picture perfect video. Canon&rsquo;s image processing system uses the entire width of the image sensor, capturing a big picture in true 16:9 widescreen so no one and nothing is left unseen. And Canon camcorders take advantage of more pixels to give you amazing quality.2.7-inch widescreen LCDA widescreen LCD lets you see exactly what your camcorder is recording, and what your TV will display later. Display widescreen video on a standard television as well.JoystickThe joystick makes using the camcorder easier than ever. Extra buttons have been eliminated, allowing you to control playback, focusing, exposure, and menu options from one convenient place.Level and Grid MarkersIt's easy to keep your FS100 level for more professional-looking video. Simply press the Level Shot Control button, and a horizontal marker appears in your viewfinder. Line up any horizontal lines in your shot to the marker and you know your camcorder is level. Also, the Grid marker is very convenient for setting up the special balance in your shots. Since background colors vary, you can select from two line colors to make the lines easily visible.Intelligent Lithium-ion batteryThe remaining battery time is now indicated down to the minute, so you will never have to guess the recording time available.Smooth zoom controlWant to shoot like the pros? Three fixed zoom speeds allow you to produce smooth video that will be enjoyable for everyone to watch.Level Shot and Grid MarkersIt's easy to keep your FS100 level for more professional-looking video. Simply press the Level Shot Control button, and a horizontal marker appears in your viewfinder. Then line up any horizontal lines in your shot to the marker and you know your camcorder is level. The Grid marker is also very convenient for setting up the special balance in your shots. And since background colors vary, you can select from two line colors to make the lines easily visible.Built-in electronic lens coverA built-in electronic lens cover means no dangling lens cover to lose.Still image recordingCapture stunning photos in 4:3 aspect ratio to an SDHC card.USB 2.0 Hi-Speed terminalThe FS100 features a USB 2.0 Hi-Speed terminal which allows for ultra-fast transfer of movies and photos. Additionally, it can connect directly to any PictBridge compatible printer.Advanced Photo FeaturesA variety of features allow you to capture great photos.9 Point AiAFBring off-center subjects into sharp focus.Image EffectsChoose from the following effects to add a creative flare to your photos: Vivid, Neutral, Low-Sharpening, and Soft Skin Detail.Drive ModesSpecial Scene ModesA wide selection of automatic exposure modes makes it easy to capture great video or photos under any condition. Choose from: Portrait, Sports, Night, Snow, Beach, Sunset, Spotlight, or Fireworks.Microphone terminalThe FS100 features a microphone terminal for attaching an external microphone.One-touch power buttonPower your camcorder with a touch of a button just like a digital camera.Canon DVD burner compatibleTake care or those precious moments shot with your FS100 by backing up your footage on the new Canon DW100 DVD burner. This simple and easy to use burner eliminates the need for a PC but still guarantees the assurance of knowing your memories are preserved to an AVCHD disc.9 selectable languagesEnglish, Spanish, French, Italian, German, Russian, Simplified Chinese, Traditional Chinese, JapaneseRecording times", "title": "Canon FS100 Flash Memory Camcorder with 48x Advanced Zoom (Silver)", "price": 299.0, "salesRank": {"Camera &amp; Photo": 6911}, "imUrl": "http://ecx.images-amazon.com/images/I/41KhvH-9skL._SX300_.jpg", "related": {"also_viewed": ["B00322ON1K", "B001OI2VXG", "B005LS0ADS", "B0032UWTQI", "B001OI2Z2I", "B00114162K", "B004HW7E7E", "B00114LG7K", "B00322ON1U", "B006UMMP2I", "B005LRZFDY", "B004HW7EGA", "B00AWZFJ22", "B001OI2YTC", "B00AR95H0W", "B00BB4UKOK", "B004HW7E92", "B007261BNU", "B004HW7E3I", "B00114PN1U", "B001DTTCQA", "B004HO596K", "B004H8FN9E", "B001OQC0KC", "B00AR95H7U", "B001OI2YZQ", "B0031RGKXU", "B001PY41YQ", "B00322ON8S", "B002A8C7C4", "B00322ON88", "B006NT43IW", "B004HW7E6K", "B00HLDFTRS", "B004H8FNB2", "B00127Y984", "B00322ON1A", "B006UMMP8C", "B00BB4ULZI", "B000U8HBRW", "B0031RGL0C", "B00E5LT0Z6", "B00322ON8I", "B001QWEZ4S", "B000M3ILF6", "B00HNJWWK2"], "buy_after_viewing": ["B003VNKNF0", "B002A8C7C4", "B003IQ52HO", "B008B0XC3S"]}}