{"asin": "B001LYPNFQ", "categories": [["Electronics", "Computers & Accessories", "Monitors"]], "description": "ASIN:  B001LYPNFQThe VW266H features a 25.5-inch 1920x1200 LCD screen that supersedes Full HD 1080p resolution. Its extra large resolution and ASUS Trace Free 2ms response time makes it ideal for immersing yourself in the latest games with the sharpest details and clarity, even for fast motion action video playback.With a wide array of inputs such as HDMI, Component Video, DVI-D, and built-in stereo speakers, you can attach your gaming consoles, DVD player, Blu-ray player, or PC for instant High Definition enjoyment.Features such as ASUS' exclusive Splendid Video Intelligence Technology, ASCR (ASUS Smart Contrast Ratio) Technology, and Aspect Control, optimize your visual experience for all user-scenarios, environments and inputs.ASUS VW266H LCD monitor presents you with stunning High Definition visual quality with exceptional features. Give your eyes a treat today with the ASUS VW266H!Key Features25.5-inch 1920x1200 widescreen with 2ms quick response timeHDMI/DVI-D/Component/VGA inputs  accept a wide variety of HD media sourcesPC audio input with S/PDIF output and built-in 2x3W speakers for instant multimedia gratificationASUS Trace Free 2ms Technology for seamless motion graphicsDCDi (Directional Correlation De-interlacing) Technology up-scales and enhances low-resolution inputSplendid Video Intelligence Technology optimizes images and video with 5 preset modes and 3 skin-tone presets20,000:1 contrast ratio with ASUS Smart Contrast Ratio Technology (ASCR)Learn MoreHigh Definition Gaming, Cinematics, and Better ProductivityView largerASUS VW266H features a 25.5-inch 16:10 widescreen display with an 1920x1200 resolution that enables 1080p Full HD playback and beyond. The extra large resolution makes working with large documents and spreadsheet easy and convenient.The VW266H also comes with the ASUS Trace Free 2ms (grey-to-grey) response time that lets you get into fast paced games and action movies without blur. With Trace Free, you will have the most fluid and razor-sharp motion graphics.The ASUS Smart Contrast Ratio Technology (ASCR) also boosts the contrast ratio to a dynamic 20,000:1 for even deeper dark tones and brighter light tones. With ASCR, you can enjoy enhanced image intensity with precision and clarity for an even more engaging experience with movies, games, and imaging.Plug-and... Rock on!View largerVH266H offers a wide variety of input options. It offers HDMI, DVI-D, VGA (15-pin), Component (YPbPr) input, PC audio input, S/PDIF audio output and earphone jack all in one monitor. With its versatility, it is ready to be the ultimate entertainment monitor for DVD players, Blu-ray Disc players, gaming consoles, and more.  HDMI input ready, VW266H provides life-like images so you can enjoy stunning details and High Definition clarity. With the simplicity of HDMI and convenience of VW266H&rsquo;s built-in stereo speakers, it&rsquo;s as easy as plug-and-play for instant multimedia gratification.Also onboard is a digital SPDIF audio output to connect to your home audio system for a complete desktop entertainment experience.The ASUS VW266H is a versatile High Definition display ready to handle virtually all of your multimedia needs.Delivers Vibrant Images with Exceptional FeaturesView largerThe VW266H is loaded with various image enhancing features to bring out the best from every video source.DCDi Technology improves the quality of low-resolution video by de-interlacing the images and eliminating jagged edges along diagonal lines. This technology is often used in high-end LCD and plasma TV sets. The ASUS VK266H and VW266H LCD monitors both incorporate DCDi technology to enable razor-sharp display and superb clarity.Aspect Control function allows users to select a preferred display mode between Full and 4:3 modes for true-to-life gaming or movie watching without any quality degredation or image distortion.Intelligent Image Enhancement with ASUS Splendid Video Intelligence TechnologyView largerASUS Splendid Video Intelligence Technologyadopts a color engine to detect activation and usage of video applications. It will then automatically optimize image quality with intelligent color, brightness, contrast and sharpness corrections for the best visual results.The Splendid offers 5 video modes designed forscenery,theater,gaming,night view, andstandard imagesscenarios.Splendid also provides 3 skin tones of yellowish, natural and reddish to produce realistic visuals of the human objects in your videos.You can see optimized images on screen and select between the five modes via a hotkey quickly at your will.Sleek and User-friendly Design for Modern D&eacute;cor and Ease-of-UseASUS designed glossy piano-black frame design creates a classy look for the VW266H.Built-in stereo speakers enable audio enjoyment together with true-to-life HD visual.Convenient key controls for easy set-up in the multi-language OSD.Cable manager helps you to manage tangling cables and wires and put them out of sight.VESA Wall Mount compatible (100 x 100 mm), helps you minimize its footprint and fit into your home or office d&eacute;cor.25&deg; (forward 5&deg;, backwards 20&deg;) Tilting Angle for a more ergonomic and comfortable viewing experience.KENSINGTON security lock for security in public environment.ASUS Innovation and QualityASUS, maker of the world&rsquo;s bestselling and most award winning motherboards, is a leading company in the new digital era, with a broad product portfolio that also includes notebooks, netbooks, multimedia, graphics cards, displays, desktop PCs, servers, wireless solutions, mobile phones and networking devices.Driven by innovation and committed to quality, ASUS designs and manufactures products that perfectly meet the needs of today's digital home, office and person. ASUS won 3,268 awards in 2009, and is widely credited with revolutionizing the PC industry with the Eee PC.WarrantyASUS 3 Years LCD Monitor Warranty + 3 Years Panel WarrantyASUS VW266H's come with ASUS 3 years LCD monitor warranty for its casing and panel. Accessories and cables come with 1 year warranty.Within 3 years, if more than 3 bright dots and/or 5 dark dots are found, ASUS will replace the panel under the warranty.A bright dot is a white defective dot that is over 1/2 of the whole sub-pixel under BLACK pattern.A dark dot is a black defective dot that is over 1/2 of the whole sub-pixel under any pattern.Please visitSupport.ASUS.comfor more details on ASUS LCD monitor warranty policy.What's in the BoxASUS VW266H LCD MonitorDVI CableVGA CableAudio CablePower CordQuick Starter GuideSupport CDWarranty Information CardsSpecificationsPanel Size:25.5-inch Wide ScreenTrue Resolution:1920x1200 (16:10)Pixel Pitch:0.287mmBrightness(Max):300 cd/m2Contrast Ratio (Max):20000:1 (ASCR)Display Color:16.7MViewing Angle (CR&gt;=10):170&deg;(H)/160&deg;(V)Response Time:2 msVideo Features:Trace Free Technology, SPLENDID Video Intelligence Technology, SPLENDID Video Preset Modes (5 modes), Skin-Tone Selection (3 mode), HDCP support, Color Temperature Selection (5 modes)Audio Features:Stereo Speakers 3Wx2 stereo RMSConvenient Hotkey:SPLENDID Video Preset Mode Selection, Auto. Adjustment, Brightness Adjustment, Volume AdjustmentAV Video Input:: HDMIVideo Input:: Component (YPbPr) / HDMIAudio Output:: SPDIF (through 3.5mm Mini-jack)PC Video Input:: DVI-D/D-SubPC Audio Input:3.5mm Mini-jackAnalog Signal Frequency:28~83kHz(H)/ 50~85 Hz(V)Digital Signal Frequency:28 ~ 83KHz(H)/50 ~ 85 Hz(V)Power Consumption:Power Consumption &lt; 60 W, Power Saving Mode &lt; 2 WChassis Colors:BlackTilt:+20&deg;~ -5&deg;VESA Wall Mounting:100x100mmSecurity:Kensington lockPhys.Dimension (WxHxD):23.6 x 18.19 x 9.06 inchesNet Weight (estimated):17.42 lbsRegulation Approval:UL/cUL, CB, CE, FCC, CCC, BSMI, Gost-R, C-Tick, VCCI, PSB, J-MOSS, RoHS, WEEE, WHQLAll specifications are subject to change without notice.Color and bundled software versions are subject to change without notice.Brand and product names mentioned are trademarks of their respective companies.Product may not be exactly as shown in photos.Check Out Other ASUS Notebook Computers and AccessoriesASUS VE276Q 27-inch LCD Monitor (Eyefinity Ready)Be blown away with VE276Q's glorious 27-inch display. ATI Eyefinity-ready with its DisplayPort input and ultra-thin frame, VE276Q is ready to be put into a 3 or 6 monitor configuration for the ultimate in gaming and simulation experience.ASUS VG236H 3D Monitor (with NVIDIA 3D Vision Kit)Enter the 3rd dimension with 3D-ready VG236H monitor. Hook up the VG236H to an NVIDIA graphics card powered PC and play in stereoscopic 3D, right at home.ASUS RT-N16 Wireless N Router (with 2x USB)Featuring FTP server and BT downloader for your USB HDD, the RT-N16 wireless N router is a powerhouse that is also Tomato firmware compatible.ASUS Slim External Blu-ray/DVD Combo DriveWatch Blu-ray movies on your notebook or desktop with the slim, external Blu-ray combo drive. It can also read and write CDs and DVDs", "title": "ASUS VW266H 25.5-Inch Widescreen LCD Monitor - Black", "price": 164.99, "salesRank": {"Computers & Accessories": 2046}, "imUrl": "http://ecx.images-amazon.com/images/I/41t-JMRrqpL._SX300_.jpg", "related": {"also_viewed": ["B0043T7FHK", "B00JH3DTLS", "B00CIZZ0QO", "B004ZMH65Q", "B007ZS3O62", "B00CCY8AJU", "B00B3329WA", "B0043T34RK", "B004EFUOY4", "B0058UUR6E", "B003UT2C4U", "B0098Y77OG", "B009HNEBLK", "B00GMGHCVG", "B005BZNDHQ", "B00AVYNS7M", "B00EZSUVHK", "B00B332A9C", "B005BZNDS0", "B00535CD5C", "B00B17C5KO", "B00IKDFL4O", "B008DWITHI", "B00EZSUWFG", "B008DWH00K", "B008ABP0W4", "B00C99MUHQ", "B004IJZNHO", "B00JM99DIU", "B00DX64DCY", "B007RG2QNY", "B00KWHMQYO", "B00B1IAL7W", "B00CCILAIO", "B001LYWBOM", "B0099XBO5E", "B00ANKMNXO", "B005JN9310", "B004J6BIJ8", "B00JPK046Q", "B007HSKSMI", "B00CS6ILY6", "B00CMKOVPQ", "B00D601UC8", "B00B2HH7G0", "B008B7T7DU", "B00G5AEZOQ", "B00CLZ04VW"], "buy_after_viewing": ["B0043T7FHK", "B0058UUR6E", "B005BZNDS0", "B003L1ZYYM"]}}