{"asin": "B00006GSNY", "description": "TheRainbow Sixgame franchise gets its name from the Tom Clancy novel of the same name; both the game and the book detail the exploits of an elite international counter-terrorism unit codenamed Rainbow (\"Six\" is tactical lingo for \"leader\"). Rainbow Six pioneered a genre known as \"squad-based tactical combat,\" and eschews fast pacing and exotic weapons in favor of methodical gameplay and realistic combat--a single bullet can take down a target. InRaven Shield, the third game in the franchise, the men and women of Rainbow return to thwart the plans of an evil madman out to recover hidden Nazi loot. This barebones plot is merely a tool to link the objective-based missions that are the meat and potatoes of the game.A standard mission will start you off with a situational briefing and overview of your objectives. After the briefing you'll pick your team of up to eight operatives in as many as three different fire teams, and then outfit them with a wide variety of realistic weaponry. You can choose to map out a mission plan for you and your AI-driven teammates, or you can just drop into the mission and figure things out on the fly. Speaking of AI, this is one of the areas of the game that deserves the most criticism. Despite a largely improved AI that will show enemies using great teamwork or even running away in fear, there are still moments when nearby opponents will walk directly into weapons fire, or even ignore nearby gunplay.Raven Shieldallows for cooperative and competitive online play, but unfortunately there's no mechanism that allows you to play cooperatively with friends through missions in a linear order with the storyline intact. This missing feature aside, cooperative play is still a great feature, and a refreshing break from standard deathmatch play.There are several significant improvements inRaven Shield, most notably the use of the Unreal graphics engine. It's vastly superior to previous games and provides crisp, clean graphics that are beautiful enough to help suspend disbelief--a feat that's typically more difficult for games with modern settings. Moreover, the inclusion of the Karma \"ragdoll\" physics engine typically models realistic collapsing animations for fallen enemies, though occasionally there are problems with oddly angled body parts. New controls inRaven Shieldsuch as incremental door-opening and fluid movement controls allow for much stealthier (and thus more fun) movement around the map.Rainbow Six 3: Raven Shieldis both a hoot and a holler to play, and I highly recommend it to anymore, but especially for anyone who favors realism in games and is tired of fast-paced but mind-numbing first person shooters.--Jon \"Safety Monkey\" GroverPros:Squad-based tactical combat a refreshing change from standard FPS fareNew Unreal engine cranks out terrific graphicsLots of cool new features like fluid door-opening and fluid movementThere is something undeniably fun about yelling \"Tango down!\" in multiplayerCons:Rag doll physics are sometimes painfully unrealisticNormally great AI is sometimes inexplicably awfulCooperative mode doesn't include the planning mode, linear progression, or story offered in single player", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/518H9HMV38L._SY300_.jpg", "related": {"also_bought": ["B00008Z0IB", "B0007CQH3U", "B0002WSM24", "B00002STNQ", "B003GSZAOY", "B0014ZR4S6", "B000BKBZXU", "B0006SL93I", "B000EDVRUA", "B00002STNR", "B00005WF9V", "B000ANCVLI", "B00004U1P5", "B0016Q0H6O", "B00000DMAH", "B000KFZ1Z4", "B001L8HAFI", "B00007LVCH", "B000HJQY0Y"], "bought_together": ["B00008Z0IB", "B0007CQH3U"], "buy_after_viewing": ["B000ANCVLI", "B0014ZR4S6", "B0011UH17I", "B00002STNQ"]}, "salesRank": {"Video Games": 20718}, "categories": [["Video Games", "PC", "Games"]]}