{"asin": "B000PDR1LS", "description": "Neither deep foliage, nor canyons faze the rugged eTrex Vista HCx. Its high-sensitivity receiver holds a GPS signal in the toughest environments. Similar to the Vista Cx, this handheld navigator also has a bright color screen, barometric altimeter, electronic compass, microSD card slot and automatic routing for wherever adventure takes you.Neither deep foliage, nor canyons faze the rugged eTrex Vista HCx.Crisp 256-color, sunlight-readable display makes it easy to distinguish map details.Perfect for geocaching.Lock Onto the Great OutdoorsEnjoy Clear ReceptionWith a high-sensitivity, WAAS-enabled GPS receiver, the unit locates your position quickly and precisely and maintains its GPS location even in heavy cover. The advantage is clear: whether you're traipsing through thick woods or strolling near tall buildings and trees, you can count on the Vista HCx to help you find your way when you need it the most.Get Your BearingsThe Vista HCx also includes a built-in electronic compass that provides bearing information even when you're standing still, along with a barometric altimeter that tracks changes in pressure to pinpoint your precise altitude. You can even use the altimeter to plot barometric pressure over time, which can help you keep an eye on changing weather conditions.Expand Your MemoryAdding maps to the Vista HCx is easier than ever thanks to the device's microSD card slot, which accepts cards preloaded with MapSource data for your land and sea excursions. Just insert a MapSource card with detailed street maps, and the Vista HCx will provide turn-by-turn directions to your destination. Plus, the card slot is located inside the waterproof battery compartment, so you needn't worry about it getting wet.Intuitive ControlBesides appreciating its small size, users will also be happy with the Vista HCx's unique button layout, with five buttons located on either side of the unit. The benefits of this design are twofold: First, the Vista HCx is a breeze to operate with just one hand, and, second, with the buttons on both sides of the unit, the bulk of the front is dedicated to the 256-color, sunlight-readable TFT display. This makes it easy to distinguish map details regardless of the time of day.Comprehensive BasemapThe Vista HCx basemap, meanwhile, contains lakes, rivers, cities, interstates, national and state highways, railroads, and coastlines--in short, a host of helpful details for your outdoor adventures.Additional FeaturesOther details include an IPX7 waterproof housing, 1,000 waypoints with names and graphic symbols, a built-in patch antenna, a USB interface, a hunt/fish calendar, sun and moon information, and a geocaching mode. The Vista HCx, which runs for up to 25 hours on a pair of AA batteries (not included), measures 2.2 by 4.2 by 1.2 inches (W x H x D) and is backed by a one-year warranty.What's in the BoxeTrex Vista HCx, basemap, MapSource Trip & Waypoint Manager software, USB cable, wrist strap, quick start guide, user's manual.", "title": "eTrex Vista HCx Portable Navigator", "price": 279.99, "imUrl": "http://ecx.images-amazon.com/images/I/51iH8OrWyWL._SY300_.jpg", "related": {"also_bought": ["B00004VX39", "B00542NVS2", "9982120808", "B002MIT5ZE", "B00542NV32", "B00004VX15", "B0029LL5IY", "B000PDR27G", "B0025UHKNS", "B000CSP000", "B000CCYZHK", "B001OMGVII", "B002KO5XVU", "B005IGVY92", "B003ZX8B0U", "B0002WSL7A", "B001OMGVLK"], "bought_together": ["B00004VX39", "B002MIT5ZE"], "buy_after_viewing": ["B00542NVDW", "B00542NVS2", "B00004VX39", "B002MIT5ZE"]}, "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]]}