{"asin": "B001COTC3E", "description": "The third game in Sony'sResistancefranchise, and designed exclusively for PlayStation Portable,Resistance: Retributionis a third-person perspective shooter that continues the story of humanity's battle against the alien-like Chimera and the biological terror they threaten the world with. Set in an alternate Earth history, circa 1951, the game takes place between the events of PlayStation 3 blockbustersResistance: Fall of ManandResistance 2. In this game world, although WWII never happened, mass destruction on a worldwide scale remains humanity's fate, and retribution against and eventual conquest of the Chimera are the player's goals.Grayson in 'infected mode'.View larger.Take on enemies large &amp; small.View larger.Advanced targeting options.View larger.Wield weapons of all kinds.View larger.New Story, New Anti-heroResistance: Retributionfollows the story of former British Marine, James Grayson. A veteran of the struggle against the Chimera in Britain following their conquest of the European continent, he did not escape those battles unwounded. Months prior to his entrance into the game, while leading an attack on a Chimera conversion facility--locations where humans are changed into monstrous slaves serving the Chimera--he was forced to kill his own brother in order to keep him from turning into one of these abominations. Following this Grayson goes on a vendetta to destroy every conversion center he can find, eventually even deserting his unit to fulfill his lust for revenge, a crime which he would be locked up for. Unfortunately, for all his compulsion, success and sacrifice Grayson learns that his efforts have been futile. In Western Europe the Chimera have evolved a new method of converting humans, one about which nearly nothing is known. Aware of his experience with the Chimera, the European resistance--the Maquis--enlist Grayson's help, and he joins Cartwright and Parker in Operation Overstrike, and so the war to retake the European continent and the game begins.Advanced Targeting and Cover SystemWith easy access to a weapons inventory, reloading commands, intel and player movement options, gameplay inResistance: Retributionis easy to pick up and generally similar to many third-person shooters on the PSP platform, but two things also make it a stand out, its advanced targeting and cover system. Unlike many other games that limit players to manual firing,Resistance: Retributiongives players the option of aim assist. Accessible quickly through the options menu, this allows players the choice of automatically locking on to the closest enemy target, to target manually or toggle between the two. Similarly, unlike other games that require you to push a button to lock you to a piece of game environment to be used as cover, here that is automatic. Just walk up to to a wall or ledge and Grayson will duck behind it automatically and will stay ducked even as he creeps from side to side. And since aim assist is constantly active you are also able to time your fire and weapon switching from the safety of cover.Key Game Features:A stand alone third person action shooter created exclusively for the PSP that continues theResistancesaga in Europe.An advanced third-person targeting system designed specifically for the PSP provides an unparalleled portable shooter experience.Intense eight player multiplayer gameplay with five game modes including Team Deathmatch, Capture the Flag, Containment and Assimilation available via ad-hoc and infrastructure.With Resistance Connect, you can plug your PSP into your PS3 withResistance 2and unlock additional features and content.WithResistance: RetributionPlus, experience the game in a brand new way by using your DUALSHOCK 3 wireless controller.Developed by the critically acclaimed Bend Studio using their 3rd generation PSP game engine.Over 10 different types of enemies, including Chimera fromResistance 2andResistance: Fall of Man&ndash; including the Titan, Slipskull, Hybrids and Leapers &ndash; and all new enemies like the Hag and Cloven.Game ModesOne of the things that setsResistance: Retributionapart from other shooters on the PSP is the variety of ways to play. Along with a compelling singleplayer campaign it also comes packed with multiplayer options that wirelessly support up to eight players in both ad hoc and infrastructure configurations. Along with familiar modes such as Team Deathmatch and Capture the Flag, players will also enjoy two modes called Containment and Assimilation. In addition, players who have a PS3 and a copy ofResistance 2will also have access to two additional modes, \"Infected Mode\" and \"Resistance Retribution Plus\" via the\"ResistanceConnect\" game feature. To accessResistanceConnect, players simply load their copies ofResistance: RetributionandResistance 2, then connect your PSP system to your PS3. Once you&rsquo;re connected,Resistance: Retributionbecomes \"infected.\"Infected ModeInfected Mode provides an alternate story withinResistance: Retribution. While in prison for desertion, James Grayson is recruited by Specter Lieutenant David LaSalle (fromResistance 2) and is infected with a mutated version of the Chimera virus, a different version of the virus than the virus that infects Nathan Hale. While playing in Infected Mode, Grayson wears a SRPA uniform and now has glowing Chimera eyes. Grayson now has regenerative health and can breathe underwater. The HE .44 Magnum fromResistance 2, which fires explosive rounds that can be triggered remotely becomes available as a weapon. An entirely new class of intelligence also becomes available that is hidden throughout the levels. Collecting all of the \"infected\" intel will unlock anotherResistance 2weapon, Plasma Grenades. In addition, thanks to your new Chimera DNA you will have access to areas of the game previously unavailable, as well as experience new AI interactions with the characters you meet through out the game play.Resistance: Retribution PlusResistance: RetributionPlus allows you to play the game using your PS3's DUALSHOCK 3 controller, while adding dual analog stick controls and rumble support. Simply activate this feature throughResistance 2, and then play the game on your PSP screen or through your televisions using the available video out function. This mode increases the challenge level and disables aim assist, allowing you to experience the game in an entirely new way.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51hgmAyHCNL._SY300_.jpg", "related": {"also_bought": ["B000HNJ5WE", "B002BS47TE", "B003L51GW2", "B000R3BN4M", "B000UKQGA8", "B000059TMB", "B000HKIPGE", "B000E0OCQY", "B002BS47WG", "B0007V804U", "B000HASW0I", "B0007TFLLM", "B001KMRN0M", "B00005A4X6", "B00005A53C", "B0045U4U52", "B0029ZUPYK", "B000R37S00", "B003V3O4A0", "B00113X7YQ", "B0007TS24U", "B002CZ3SEQ", "B006JKARNU", "B0009350CQ", "B000E0OCR8", "B000AAZC08", "B002F87WEW", "B0014X7SQ6", "B000GA75SY", "B0009WPZPY", "B000FVM49Y", "B0050JN7ZG", "B000G79XQO", "B002EQFXZA", "B00127VDWY", "B000N0WBJ0", "B0037M2TDY", "B000Q6ZLKM", "B002BSC57U", "B000ASBKHE", "B0050JN84Q", "B00006FSLC", "B0009XBXQ8", "B000G79VKC", "B000HKMG14", "B002DGNLFK", "B001HWF1OA", "B000SSPH3E", "B0000A3ZZF", "B001TOQ8T8", "B0009VRSS2", "B000IFRPLO", "B000FYZS6M", "B0015A8RQ8", "B002KQJNOQ", "B000TPTCSC", "B00005B5RQ", "B002I0GZ5Y", "B000FG65EY", "B0009Z3LGQ", "B003VMWR14", "B000A0XSOU", "B000R37S78", "B00168PFFK", "B00083HJ5I", "B002I0GXWO", "B001GXI4LM", "B000UHD85C", "B000F1YHW6", "B001TIFML4", "B000NPOGWK", "B0007UDYTW", "B000X2BAPY", "B0000503QB", "B000H1R0D2", "B000NPTOTK", "B001F513VO", "B001TILU88", "B001CB9VSS", "B001TD6SN0", "B0007UDYUQ", "B000BNMOFU", "B003WTR2QQ", "B0007V46J8", "B0050SW93S", "B0016QCCG2", "B002SD94AY", "B001CM62UM", "B000UVZWYS", "B000QTD05M", "B00356GVRW", "B000FZ1YV4", "B000BNH1MQ", "B000H0SGV8", "B0007VDF2C", "B004LLRYOY", "B000UZH7P6", "B000FG65F8", "B000VIUNZI", "B000R39IKI"], "bought_together": ["B003L51GW2", "B001KMRN0M"], "buy_after_viewing": ["B003L51GW2", "B002BS47TE", "B000R3BN4M", "B001KMRN0M"]}, "salesRank": {"Video Games": 13174}, "categories": [["Video Games", "Sony PSP", "Games"]]}