{"asin": "B000W6O08A", "description": "Carry your files everywhere in style with the Iomega eGo 250 GB Portable USB Hard Drive. This stylish and compact silver portable drive features the patent-pending DropGuard feature, which gives it the durability to withstand the hazards of everyday travel. Small enough to fit into a briefcase or purse, the eGo will quickly become an indispensable travel accessory.The eGo is ultra stylish and easily transportable with a bus-powered design.View larger.Choose your favorite eGo from a variety of colors.View larger.Stylish, Portable DesignThe eGo drive is extremely sleek and stylish, with a swooping, silver design. It is ultra portable, with its small size and bus-powered functionality that eliminates the need for an external power supply. And with its DropGuard feature, which protects the drive from accidental damage caused by drops of up to 51 inches, you won&#x92;t have to worry about damaging it while on the road.Play Your Digital Media AnywhereWith 250 GB of storage capacity, the eGo can hold up to 1,000,000 photos, over 4,625 hours of music, or 375 hours of video. The drive features a USB 2.0 connection for fast transfer rates and is compatible with both PCs and Macs with USB ports.The drive includes a license for the award-winning EMC Retrospect Express software, which provides fast backups and added protection for your data. The software features a powerful interface that allows you to schedule either a single or complete system backup, personalize your backup schedule and location, back up open files, back up without logging in, encrypt files, and obtain backup verification. With EMC Retrospect Express, you'll never have to worry about losing your data again.  And, with the built in integration of Mozy Home Online Back up software you're always safe against theft or destruction of your data.  MozyHome offers a simple, secure online backup service to store your critical data offsite.The Iomega eGo Portable USB Hard Drive is backed by a one-year warranty.What's in the BoxIomega eGo portable hard drive, USB cable, FireWire cable, HTML user manual and help files, EMC Retrospect Express backup software, and quick install guide.Small and stylish, the eGo easily goes wherever you go.", "title": "Iomega 34261 eGo USB 2.0 250GB Rugged Portable Hard Drive (Silver)", "imUrl": "http://ecx.images-amazon.com/images/I/31Vg0Y5C7VL._SY300_.jpg", "related": {"also_viewed": ["B001C5AJLM", "B0053ORUS8", "B00EY5APPC"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]]}