{"asin": "B001IZYV3S", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]], "description": "Get the most out of your digital audio with the Altec Lansing FX2020 Expressionist Classic Speakers. Made for computers and digital audio players, these compact and powerful stereo speakers fill the room with big sound. The speakers' unique design gives them a distinctive look and a small footprint, which means you'll have plenty of space on your desk or coffee table for your other peripherals.The small, attractive speakers provide satisfying full-spectrum audio.View larger.Controls are located directly on the speaker and an AUX IN jack lets you connect portable CD and MP3 players.Perfect for PCs and PortablesAn included 3.5-milimeter audio cable makes the FX2020 Expressionist speakers easy to add to any computer or digital music player that has an audio output. You can even use the speakers with your CD player or personal DVD player for sound that everyone can enjoy. An added auxiliary input makes it easy to connect a peripheral device without having to unplug the Expressionist Classic speakers from your computer.Small Size that Packs Big SoundEach speaker measures just 5.0 x 5.0 x 6.5 inches (HxWxD), but don't let the compact size fool you--these speakers deliver big sound. The three-inch drivers are precision engineered to deliver full-spectrum audio, so your music and soundtracks will have real-life sound. Backing up each speaker are 7.5 watts of continuous power, so you'll be able to clearly hear everything and still have plenty of room left on your volume knob.A Unique Look to Complement Your SystemEvery element of these speakers is designed to serve a purpose and to look good doing its job. The speakers have a sleek frame, with round, black cabinets that house the drivers. Encasing each speaker is a clear, square panel that also acts as a support. The final look is elegant without being overstated, so the Expressionist Classic speakers blend in well wherever you decide to use them. And since they are compact, they'll leave plenty of room on your desk, workspace, or in your entertainment center for all of your other gadgets.Easy-Access Controls for Quick AdjustmentsOnce you've added the Expressionist Classic speakers to your laptop or desktop system, you can control everything from the convenient power and volume buttons located right on the speakers. Power down the speakers when you need a little quiet for work, or crank up the volume when it's time to unwind.The FX2020 Expressionist Classic speakers draw power from any home outlet. An AC power adapter is included.The FX2020 speaker system is covered by a one-year limited warranty.What's in the BoxAltec Lansing FX2020 Expressionist Classic speaker system, 3.5-milimeter audio cable, power adapter, user's guide, and quick-connect guide", "title": "Altec Lansing FX2020 Expressionist Classic Speakers for PC and MP3 Players (Black)", "price": 37.99, "imUrl": "http://ecx.images-amazon.com/images/I/41j6SkZH1eL._SY300_.jpg", "brand": "Altec Lansing", "related": {"also_viewed": ["B0025VKUPW", "B0025VKUQQ", "B00F8HRSN2", "B001IWOBA4", "B004TMTRPY", "B0025VKUR0", "B0025VKUQG", "B009XGH2HG", "B0038W0NEU", "B007ZWIEJK", "B0051U7D0E", "B008Y5GHCI", "B00ESKS9L0", "B00F8HRTCC", "B00FW3KZNM", "B00113PUJQ", "B002TLSTGA", "B0043ZWJHU", "B00BZ7MATG", "B003XE3X8Q", "B0028N6YH0", "B004ULOZPQ", "B002FU5QMA", "B00CXLK1X0", "B00F8HRU2G", "B0062S88OY", "B0050JS1QG", "B00BZ7MALY", "B006KZ0R1Q", "B0097OUESI", "B007GF9N96", "B008X1BVH4", "B002FU5QLQ", "B008F2YEN4", "B0041QBAIA", "B00EZ9XKCM", "B005FE72Q6", "B001ELK2NY", "B007GEE2S4", "B001RNOHDU", "B00HPQ0H0K", "B009P8KTPE", "B00006B9W3", "B0060BBD40", "B0027VT6V4", "B0044946TO", "B0042F3K9W", "B0079N8Y0Y", "B0007XU370", "B004N31D9W"], "buy_after_viewing": ["B0025VKUPW", "B0027VT6V4", "B0025VKUQQ", "B00F8HRSN2"]}}