{"asin": "B0018KTCIM", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "From the ManufacturerYou won&rsquo;t miss any of life&rsquo;s special moments with this compact, lightweight camcorder. The Samsung SC-HMX20C has an amazing built-in 8 GB of flash memory for 90 minutes of recording time. Plus, with the 2.7-inch touch screen LCD and a convenient swivel handgrip, you&rsquo;ll easily capture odd-angle shots like baby&rsquo;s first steps. Full HD recording with 1080p delivers breathtaking images and brilliant resolution.Samsung SC-HMX20 Highlights2.7-inch LCD display2.7-inch touch screenYou&rsquo;ll never miss a shot with the 2.7-inch touch screen LCD display. Catch more of the action and guarantee that the entire image is recorded.Twice the memory optionsPlay videos quickly and easily using internal and external memory. The external memory slot accepts both high capacity SD and MMC. The SC-HMX20C has 8 GB of built-in flash memory and 90 minutes of recording time so you never miss anything.Capture images farther than the eye can seeWith its high quality 10x optical zoom and 100x digital zoom lens you can get close to the action from a safe distance. And for those ultra long distance shots, the 100x digital zoom will let you see it all in perfect detail.4 mega pixel still cameraWatch your images come to life! A 4 megapixel still camera which will create a crisp, crystal-clear picture that is more lifelike than ever before.USB 2.0 portThe USB port lets you easily upload your movie clips and JPEG still images to your PC.HDMI (High-Definition Multimedia Interface)Transfer hi-definition video and audio from your camcorder to your TV, home theater, or other digital AV components. Simply connect your camcorder to your home theater system with a single cable for high-quality picture and sound.Special Offer: Buy this Samsung Camcorder and Receive 1 Year Free Membership With PhanfareUpload, share, archive, and display your HD videos shot with the Samsung HMX20, with a one year free subscription to the Phanfare video sharing site. Once you receive your new Samsung HMX20, go to www.phanfare.com/Samsung, and sign-up. To access your one year free membership (valued at $55.00), simply add the serial number of your HMX20 to the serial number field in the Phanfare sign-up section.Phanfare Benefits:Upload, organize and share photos and videos on the webDownload the Phanfare application for your iPhone or email photos and videos from your cell phoneBlazing fast uploads mean that your albums will be ready to be shared within momentsAlways have your cherished memories safely and securely stored on an external applicationWith the security and privacy of Phanfare, only you select who can view your videosOnline screensavers and downloadable slideshowsYour photos and videos are beautifully presented on Phanfare with no advertisementsDownload the Phanfare Media Server and see your photos on your TVShare albums on Facebook or embed photos and videos in your blogYour family and friends will love to look at your photos and videos in Phanfare's amazing, full-screen slideshowsThis offer is valid until May 9, 2009.", "title": "Samsung SC-HMX20C 8GB High Definition Camcorder with 10x Optical Zoom", "price": 5.39, "salesRank": {"Camera &amp; Photo": 16761}, "imUrl": "http://ecx.images-amazon.com/images/I/410pe3pv6vL._SX300_.jpg", "related": {"also_viewed": ["B006UMMP2I", "B006UMMP8C", "B00CCUYSPY", "B00BB4UKOK", "B000MAQSD6", "B00HLDFTRS", "B007261BNU", "B00AR95H7U", "B0032UWTQI", "B00AR95H4S", "B003DZ1224", "B00AR95H0W", "B00HNJWWK2", "B00CQ9T00E", "B00AR95FP4", "B00BB4ULZI", "B007ROW3KM", "B004H8FNB2", "B00BOVP4E6", "B004HO596K", "B00HNJWVKI", "B008X3NGHU", "B00HLDFU6I", "B0072B5E4M", "B006K5507M", "B00HUESJJI", "B00HXE4H28", "B001OI2Z2I", "B00155WX90", "B006K551HQ", "B00AR95ENW", "B00HPZKQJS", "B006NT43IW", "B00AW54Z2M", "B00AR95FRM", "B00HLDFSQK", "B008X3NGR0", "B002OEBNJC", "B004I43MGS", "B005LS0ADS", "B0072B5CNU", "B001OQC0KC", "B009GLINO4", "B00AWZFJ22", "B00AW54YWS", "B00AWZFHG0", "B004EYSMSK", "B0043D4V8M", "B003DZ122E"], "buy_after_viewing": ["B003DSCXD8", "B002OEBNJC", "B003VNKNF0", "B004WKY7OY"]}}