{"asin": "B007C0Y8NQ", "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Cases & Sleeves", "Cases"]], "description": "Targus Versavu Keyboard Case for The new iPad&reg;Versavu&trade;Keyboard Case for iPad&reg;3 and iPad&reg;with Retina DisplayControl Beyond the ScreenThe Versavu Keyboard case isn't your typical iPad case. Balancing the flexibility of patent pending 360&deg; rotating technology with the practicality of a QWERTY, low-profile Bluetooth&reg; keyboard, you'll be able to do more than you ever thought possible. Whether you use your iPad for watching movies, surfing the Web, blogging or emailing, the Versavu Keyboard Case is sure to deliver everyday convenience. A high-quality textured exterior will also provide durability and peace of mind for even the most active iPad enthusiast.&nbsp;Full QWERTY KeyboardLooking for the ultimate typing experience on an iPad? The built-in keyboard gives you optimum typing control beyond the iPad's on-screen keyboard. This case boasts an integrated QWERTY, low-profile Bluetooth&reg; keyboard that provides tactile feedback and helps improve typing accuracy and speed - all while maintaining a quiet typing experience. Users will be able to comfortably and efficiently write emails, blog posts, or leave comments on social networks. The keyboard can even be charged inside of the case for an easy-to-sync, cable-free user experience.&nbsp;Optimum typing controlType comfortablyLaptop-style key technologyAll Access, All the TimeThe Versavu Keyboard Case features open access to the charging ports, which allows you to charge your iPad and the keyboard while they're in the case. Additionally, this keyboard is equipped with a rechargeable battery with up to 90 hours of battery life for an uninterrupted experience when you need to stay mobile for extended periods of time. There's even a precision-cut camera hole that prevents shadowing when taking pictures with your iPad for clear, unobstructed images.&nbsp;Charge iPad inside the caseKeyboard charging accessPrecision-cut camera openingForm-fitting and ProtectiveThe Versavu Keyboard Case was built with a custom fit cradle to keep your iPad nice and snug while in use and in transit. With the durable exterior and a soft-lined interior, your iPad will also be protected from scratches and dust. The built-in keyboard is also recessed to prevent it from touching or rubbing against your iPad. Deep grooves also keep the iPad stable whether viewing in landscape or portrait mode.&nbsp;Durable exteriorSoft-lined interiorForm-fitting design&nbsp;&nbsp;Details, DetailsThe sophisticated style of the patent-pending 360&deg; rotating stand frames the Apple&reg; logo and features clever stylus storage. The port hole cut-out that frames the Apple logo also provides the 360&deg; rotating technology that allows the iPad to rotate in all directions. Access to all iPad ports isn't a problem either - the design allows you to have access without having to remove your iPad from the case.&nbsp;360&deg; rotating standBuilt-in stylus holderApple&reg; logo shows through", "title": "Targus Versavu Rotating Keyboard Case and Stand for iPad 3 and 4, Black (THZ17101US)", "price": 39.0, "imUrl": "http://ecx.images-amazon.com/images/I/41lmMCfEJpL._SY300_.jpg", "brand": "Targus", "related": {"also_bought": ["B00DEAVYKI", "B003ZSHKIY", "B002BBJMO6", "B003D8GAA0", "B005DEW4BQ", "B0054JE60W", "B009W9AEOM", "B007N9HV0S", "B004TLH7C0", "B009W9JG78", "B008UHKTCY", "B009W9APU0", "B005L38XOG", "B009W9ID0E", "B0059KTEBC", "B004WYA852", "B0056VO7H0", "B00EXPSEFQ", "B009W8YQ6K", "B00B7MR1P2", "B0076POASA", "B0057J284A", "B00GEC8IBG", "B00BWHILCY", "B009W9BYQ4", "B004RDWVUS", "B007N9HTZU", "B00G3JT3N2", "B007IV7KRU", "B005Y1CYSQ", "B008UHK3KM", "B00EZ9XHSO", "B00DIFLP3K", "B00AI3RRAA", "B007C0Y8PY", "B00A83I8G2", "B009W9BQMQ", "B0053NBLFW", "B00DPN3XZ8", "B001AALJ1I", "B004N62HZI", "B004HN81SE", "B00B15JZQS", "B005HMO6A6", "B003CKC8W8"], "bought_together": ["B002BBJMO6"], "buy_after_viewing": ["B005HMO6A6", "B0091DF9CG", "B005Y1CYSQ", "B0076POASA"]}}