{"asin": "B0011N180Q", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "For carefree shooting and consistently great pictures. An impressively high, 8-megapixel count delivers pictures with true-to-life color and pleasing details. What's more, it means images can be significantly enlarged, and still look absolutely stunning.Coolpix L18 HighlightsNew Anti-shake AEAnti-shake AE helps you take great pictures free of complicated operation by automatically increasing shutter speed and raising the ISO setting to compensate for camera shake and subject movement.Expansive 3.0-inch LCD monitorA huge, bright LCD monitor makes it a cinch to compose shots and play them back anywhere, ensuring clear viewing, even in direct sunlight.AA-size batteries for carefree shooting anywhereCompatibility with AA-size batteries, which are widely available around the world, means carefree shooting virtually anywhere without worrying about recharging or running out of power.Easy auto modeEasy auto mode makes photography even easier by taking control of settings, so you simply turn on the camera and shoot freely.Coolpix Premium FeaturesCoolpix in-camera technologies give you the edge when it comes to taking beautiful pictures more easily and with greater enjoyment. Included are innovative functions that increase shooting opportunities in a broader range of situations, help to optimize images, and add a new dimension of fun to sharing those results.VR image stabilizationNikon Coolpix cameras offer an array of VR technologies that produce blur-free images when shooting in unsteady conditions or at slower shutter speeds. Selected models are equipped with one of two types of Optical VR, Lens Shift VR, which delivers sharp and steady images effective for shooting and faster framing with the LCD, or Image Sensor Shift VR, which moves the image sensor to accurately compensate for camera shake. Other models offer Electronic VR which applies movement data to image processing to turn blurred images into beautifully clear results.Better pictures in lower lightSelected Coolpix models offer ISO capability beyond the range of conventional digital compacts. An exciting advantage that greatly increases photographic possibilities, high ISO capability delivers excellent exposure in challenging conditions, broadens the scope of possible subjects and allows scenes to be captured beautifully without compromising natural light.Face-priority AFAvailable only with Nikon Coolpix cameras, the clever Face-priority AF function helps ensure satisfyingly crisp portraits no matter where the subject is in the shot. By automatically detecting people's faces in the frame, the photographer is free to press the shutter for sharp portraits with focus exactly where it's wanted.D-LightingOnly Nikon delivers the advantage of D-Lighting, a unique technology with the ability to rescue underexposed images or shots taken with excessive backlight. Accessible in Playback mode, this innovative feature automatically creates a copy of the image, adding light and detail added where necessary, while leaving correctly-exposed areas untouched. As a result, images are significantly improved in a manner that is much more natural looking.In-camera red-eye fixCoolpix cameras offer refined red-eye reduction capability that surpasses other digital compacts. First, a series of pre-flashes stimulate the subject&#x92;s pupils, causing them to constrict. The camera then analyzes the captured image for the remaining presence of red eyes, automatically correcting them in-camera before saving the image to memory.", "title": "Nikon Coolpix L18 8MP Digital Camera with 3x Optical Zoom (Ruby Red)", "price": 7.33, "salesRank": {"Camera &amp; Photo": 8904}, "imUrl": "http://ecx.images-amazon.com/images/I/41V45QiscrL._SX300_.jpg", "related": {"also_viewed": ["B004MB9UMM", "B00B7N9CB2", "B00GEQEB6S", "B001PK8FG0", "B00HQ4W3EO", "B002BWWRCE", "B00H079RLE", "B0034XIL60", "B0073HSK0K", "B003VTZE1W", "B00AWYMXZY", "B00ECGX9TW", "B0073HSIY8", "B008N9DRPA", "B0073HSKAA", "B00BOZCWGA", "B001O1GEU4", "B00B7N9CIK", "B000P6I4XO", "B003HMRD26", "B003VTZE1M", "B005IGVY92", "B00B7N9COY", "B00AQ2BUWY", "B0034XFG1S", "B004J3YCGM", "B003VTZE2G", "B000VKUZD6", "B005AKS4DA", "B005I6DVC0", "B004M8SVEI", "B00BOZCUG2", "B00CX52MVA", "B006UMM1AY", "B00HQ4W58I", "B003VTZE26", "B003JV5LUG", "B004MB8302", "B008L24488", "B0073HSJGU", "B00ECGX9NS", "B00HNJWUC2", "B001C20816", "B00EFILSOU", "B00EFILR6E", "B00HQ4W3X0", "B00I8BIC9E", "B00B5HE2MO", "B00908BQCY", "B00B5HE1SY"], "buy_after_viewing": ["B000P1O73A", "B004MB9UMM", "B00B5HE2UG", "B003VTZE1M"]}}