{"asin": "B000UY1OMY", "categories": [["Electronics", "Computers & Accessories", "Webcams"]], "description": "From the ManufacturerExperience the ultimate in video-calling freedom, clarity and simplicity. QuickCam Orbit AF features motorized tracking that follows your every move, keeping you right in the middle of the picture. Enjoy sharper, smoother high-clarity video with premium Carl Zeiss optics, AutoFocus and the true 2-megaxpixel sensor. RightLight2 Technology automatically corrects for poor lighting, even dim or harsh light. The integrated premium microphone with RightSound Technology cancels background noise for crystal-clear conversations. Logitech Video Effects like animated avatars add fun to your video conversations. And with included Logitech Vid software, clear and crisp video calling is finally fast, free and easy.Be there to share moving moments with the height ofvideo-calling freedom.Video picture? Perfect. Sound? Perfect. Lighting? Well, you get the idea. QuickCam Orbit AF gives you the ultimate in video-calling clarity and freedom. Feel free to show sis your new dance steps, and the motorized lens will follow your every move. Lean in to give mom a birthday kiss, and Autofocus keeps you looking razor-sharp. Make a late-night video call to friends in Frankfurt. Automatic light correction adjusts your image so they see you in the perfect light&#8212;even if you're in a dimly lit room. QuickCam Orbit AF does all the work. So, you're free to chat without distractions. And with included Logitech Vid video calling software, now you can &ldquo;be there&rdquo; with faraway family and friends in just one click.Now crisp, clear video calling is also fast, free and easy.Included with your webcamVideo calls have always offered the promise of connection to your distant friends and family. But for many of us, getting the hardware and 3rd party software to work has been a challenge. Isn't it about time for an all-in-one webcam and software solution designed to make video calling easy for everyone? Wait no more. Your Logitech webcam comes with new Logitech Vid, the easiest video-calling application ever. Vid one-click-to-call software works seamlessly, right out of the box, with any new or existing Logitech webcam. So you can just relax and enjoy sharp, clear video conversations without hassles. And it's also free for anyone you call, no matter what webcam they use.Easy set upLogitech video calling software lets you install and call in half the time.Vid keeps things simple from the start. It's set up when your webcam is. So you're ready to call right away. In fact, you can set up Vid in half the steps it takes with major instant-messaging services. When you make a call, Vid connects you to friends using their email addresses. No screen names, extra accounts to create, or third-party software to download. And Vid works whether you're using a PC or a Mac computer, a stand-alone webcam or a built-in one.Fast ConnectionsOne-click calling without extra steps and hassles.Other free software offers video calling as another hard-to-find feature in a long list of features. Vid presents a simple, intuitive interface where every element is designed to help you make a video call the moment your webcam is ready. Each of your contacts is represented by a thumbnail picture. Simply click the picture of the person you want to contact and Vid starts your video call. Click. Chat. Simple as that.Free for allInvite and add friends using their email address. It's free and that simple.Vid software is free with your new or existing Logitech webcam. It's also free for everyone you invite to connect with you, regardless of what webcam they have. Want to add a friend to your call list? Simply choose &ldquo;Add a friend&rdquo; to send them an email invitation and software link. Once they sign up, you're both set for free one-clickcalling&#8212;no strings attached.Crystal-clear video chatsCrisp, clear, full-screen viewing powered by the Logitech SightSpeed network.All of this simplicity is powered by the Logitech SightSpeed network, a groundbreaking framework designed specifically for video calling. It's also how Logitech Vid can deliver such crisp, clear video and audio without compromises or complications. See how real video calling can be with Logitech Vid and QuickCam Orbit AF.Key FeaturesLogitech webcams&#8212;a better video calling experience by designFrom the moment you make your first video call, you'll see why Logitech is the top choice of webcam users worldwide. Logitech designs every webcam from the ground up to give you dramatically clearer video and sound than other webcams at the same price. It's not just about features like lens quality, sensor resolution and software. It's how the sum of the parts adds up to a better video calling experience for you.Motorized lens and intelligent face tracking keep you moving freely and center-screenMove freely and the motorized tracking lens keeps you in the picture9\" eye-level stand raises the webcam to the perfect video-calling heightAll of this simplicity is powered by the Logitech SightSpeed network, a groundbreaking framework designed specifically for video calling. It's also how Logitech Vid can deliver such crisp, clear video and audio without compromises or complications. See how real video calling can be with QuickCam Orbit AF and Vid.Ultra-smooth AutoFocus with Carl Zeiss optics for razor-sharp video calls1.3MP Resolution webcam2.0MP Logitech AutofocusNo fuzzy images or compromises. Get more video clarity and detail with a complete package of top-of-the-line features. It starts with Carl Zeiss optics, the leading lens choice of professional videographers. The high-precision glass lens captures your image in vivid detail. And the ultra-smooth AutoFocus keeps you looking sharp&#8212;even in extreme close ups.High-resolution 2-megapixel sensor for unmatched image quality1.3MP Resolution webcam2.0MP Logitech High-Definition VideoExperience higher quality video calls that look so real, it's like you're in the same room with faraway family and friends. The full 2-megapixel sensor captures far more image detail than standard 1.3-megapixel webcams. It means your video image is astonishingly crisp, clear and true-to-life&#8212;even when your face is full screen. The same goes for your digital photos, software enhanced up to a breathtaking 8-megapixels.RightLight2 Technology never leaves you in the darkDim lightBack lightRightLight2Get ready to hear your video callers say, &#8220;You look great.&#8221; Designed with RightLight2 Technology, the webcam automatically detects and corrects for poor lighting. So you always look your best on camera. Harsh direct light? Dim back light? Gone. The webcam instantly adjusts and balances brightness and contrast for shadow-free video calls that look as natural as you.Built-in microphone with RightSound Technology for clear, echo-free chatsHearing is believing. The premium integrated mic keeps your conversations crystal clear--even if you're speaking from the other side of the room. RightSound Technology also cancels distracting background noise and the &#8220;voice, voice, voice&#8221; echoes that occur with some webcam brands. Whether you use the built-in mic, or add a headset for more privacy, your every word is clearly heard.Logitech Video Effects bring out your inner personalityFun FiltersFace AccessoriesAnimated AvatarsTake your video calls to a new level of fun with included Logitech Video Effects software. Personalize your appearance with hundreds of realistic effects. Transform yourself into animated avatar characters that mirror your movements in real time. Talk and your avatar talks. Smile and your avatar smiles. Add Face Accessories like quirky hats and glasses to your live-action image. Or use Fun Filters to turn your image artsy, neon or creepy as a ghost.Works with all instant messaging programs for hassle-free callingAll you need for video calling is the webcam, a high-speed Internet connection and any instant messaging software. We recommend Logitech Vid video calling software. You can also download other IM programs online. Unlike some brands, QuickCam Orbit AF works with all instant messaging programs-yours and whomever you call, so getting connected is hassle-free.Use QuickCam Orbit AF and free video-calling applications to visit far-flung family and friends in razor-sharp high quality video.Which Webcam Is Right For You?GoodBetterBestVideo QualityPhoto QualityOpticsCorrects for Poor LightingAutofocusBuilt-in MicHD Video Recording in 720pQuickCam Orbit AF2.0 MP 1600 x 1200 pixels8.0 MPCarl Zeiss with motorized trackingwith echo and noise reductionwith 16x9 Widescreen supportLogitech Webcam Pro 90002.0 MP 1600 x 1200 pixels8.0 MPCarl Zeiss ultra-wide anglewith echo and noise reductionwith 16x9 Widescreen supportLogitech 2 MP Webcam C6002.0 MP 1600 x 1200 pixels8.0 MPHigh QualityGlasswith echo and noise reductionwith 16x9 Widescreen supportLogitech 1.3 MP Webcam C5001.3 MP 1280 x 1024 pixels5.0 MPGlasswith echo and noise reductionLogitech Webcam C250Enhanced VGA640 x 480 pixels1.3 MPPlasticwith echo and noise reductionBrowse For More Logitech ProductsEnhance your video calling experience with great Logitech accessories.", "title": "Logitech QuickCam Orbit AF", "price": 349.99, "imUrl": "http://ecx.images-amazon.com/images/I/411xr0%2B3T-L._SY300_.jpg", "brand": "Logitech", "related": {"also_bought": ["B0083I7Y8W", "B000BBAKSA", "B002VG39BI", "B000BL28M6", "B0082PZ1BS", "B001TH7GUU", "B006JH8T3S", "B001TGTDFM", "B00I4701O6", "B0000DBMKK", "B0027JBLV4", "B006MI6M7E", "B0027JIIKQ", "B003NUIK4M", "B003M2YT96", "B000RZQZM0", "B00CRJWW2G", "B0041W55YE", "B007R73BI2", "B004YW7WCY", "B000TTIP40", "B003VANO7C", "B000RC167C", "B0096KSBB0", "B000HEC5D4", "B004AGX4YO", "B000165O18", "B007ED7R1G", "B00002EQCW", "B0000BVYT3", "B0080CE5M4", "B00C2B81K6", "B00E0G2M6U", "B002HWRJBM", "B0007OGTGS", "B0019804U8", "B004ABO7QI", "B005H3I38Q", "B009SPWJ98", "B000Z80ICM", "B000VZCCYG"], "bought_together": ["B001TH7GUU", "B006JH8T3S"], "buy_after_viewing": ["B004WO8HQ4", "B006JH8T3S", "B004YW7WCY", "B003LVZO8S"]}}