{"asin": "B008YZ8UOQ", "description": "NOTE: The Strapback case only fits Kinde Fire HD 7 (Previous Generation 2012) Tablet. It will NOT fit Kinde Fire HDX or Kinde Fire HD 7 2 Gen Version.Meet the Poetic SlimBook Leather folio case for the New Amazon Kindle Fire HD 7 Tablet - so slim, you'll forget you had a case on your Amazon Kindle Fire HD 7\" Tablet! Enjoy the elegant, smooth texture of the SlimBook, with this finely grained leather like material. Integrated durable panels allow you to not only protect your Amazon Kindle Fire HD 7 Tablet's precious screen, but also position your screen in a horizontal . Less is more with this thin protective folio case - the SlimBook by Smart ShopPoetic warrants the Poetic Brand of Products against defects in material or workmanship for a period3 (three) Yearsfrom the original date of purchase of the product by a consumer through an authorized Poetic dealer. Poetic does not warrant, and is not responsible for, any smart phone, tablet or other device made by any manufacturer other than Poetic. If a defect arises in the materials or workmanship warranted by Poetic, Poetic will replace that unit as long as it falls within the warranty constraints.The Poetic name, logo, all product names, customer graphics, trademarks and service marks appearing on the Poetic website unless otherwise noted, are service marks, trademarks (whether registered or not) and/or trade dress of Poetic brand.", "title": "Poetic Slimbook Case for Amazon Kindle Fire HD 7&quot; Black(Automatically Wakes and Puts the Amazon Kindle Fire HD 7&quot; Tablet to Sleep)(Intergrated HandStrap)(Has Open Slot for Charger Port)(Business Card Holder is Plus)(3 Year Manufacturer Warranty From Poetic)", "price": 4.95, "imUrl": "http://ecx.images-amazon.com/images/I/51KmKIJ88xL._SY300_.jpg", "related": {"also_bought": ["B008SYWFNA", "B0096T2N3I", "B00679A3W8", "B006GWO5WK", "B0098OCKDE", "B009G4M20M", "B005USRBVI", "B008THTOKS", "B00C5W16B8", "B00EX9J9SI", "B009O6XFDU", "B00FJ8JC3O", "B009BEXTC2", "B0098O8VK0", "B009724OAY", "B00FX70YRE", "B009724NGO", "B00FGF0LV2", "B0096T9B8S", "B006DKETGC", "B0096T9BIS", "B00AFKC6KC", "B0064R6G4W", "B009BI3MCA", "B0096T9ACU", "B00A47AFSG", "B00BWYQ9YE", "B00FJ8JGIA", "B009IHEFWK", "B0096T9BV0"], "bought_together": ["B008SYWFNA", "B006GWO5WK"], "buy_after_viewing": ["B00C5W16B8", "B0096T2N3I", "B00BWYQ9YE", "B00EX9J9SI"]}, "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Cases & Sleeves", "Cases"]]}