{"asin": "B000IVDIL4", "categories": [["Electronics", "Television & Video", "Streaming Media Players"]], "description": "Amazon.com Product Description The first generation Slingbox was a big step forward for so-called \"place shifting\" technology, a device that allowed you to view incoming TV signals on any TV computer in your home, or on any Internet-connected PC around the world. Sling Media is now introducing the successors to this groundbreaking product. Now there are three Slingboxes to choose from, each with features that make it easier than ever to bring your TV and other media with you wherever you roam. Choose from the Slingbox Tuner, AV, and Pro models depending on your entertainment needs.Compare Slingbox models.The Slingbox Pro offers Component HD, S-video, coax, and composite video connections.Slingbox ProThe Slingbox Pro ensures that you can watch all of your favorite home theater entertainment anywhere you go, with the ability to watch and control up to three standard definition and one high definition video (via component connection) devices. Using an Internet connected computer or compatible mobile phone (with purchase of SlingPlayer Mobile software), you can watch and control your home TV, DVR, basic cable, digital cable box, or satellite receiver anywhere around your home or around the globe. With a Slingbox Pro you will never be separated from your favorite TV shows, sports broadcasts, breaking news stories, digital video recordings, or video on demand.The Slingbox Pro also includes the free Slingbox Finder service to locate a Slingbox from any network location, in or out of the home.How it WorksSlingbox Pro is a small device that connects to your cable box to redirect the TV signal to the computer of your choice--providing high quality video, no matter the distance, so long as there is a high-speed Internet connection. This technology also allows you to access and control your TV from anywhere--and your TV doesn't even have to be on.You can enjoy signals from a digital cable box, DVR, satellite receiver, or DVD player on any computer at home, on the Internet, or on a compatible mobile phone. One of the video sources can be an HD component device.SlingMedia's patent pending SlingStream technology delivers the smoothest and best video quality possible. SlingStream delivers up to a 400 percent video quality improvement over the original Slingbox. SlingStream is powered by a programmable engine that is capable of running the latest video compression algorithms. SlingStream dynamically adjusts to changes in network conditions, video content, and Internet bandwidth.At Home, At Work, or on the GoAt home, Now you can watch TV in whatever room in the house you choose. Say goodbye to the days of having to watch your child's favorite DVD over and over again. Now you can watch your soaps in the laundry room. You can watch your fix-it shows in the garage. Or you can watch your cooking shows in the kitchen. You'll never get stuck having to watch shows you don't want to now that you're in charge of what's on, when it's on, and where it's on.Now that you can access your TV wherever you have your computer, the clock won't be the only thing worth watching at work. You can watch your news and business channels to stay updated. You can catch the big game while tending to business. Or, you can watch your favorite shows during your downtime. In any event, work will never just be business as usual.With the SlingBox you can travel to another country and actually understand the programs. You can visit the in-laws and not get stuck watching The Weather Channel.You can change channels and control your TV on your computer just as if you were in your living room. The AV and Pro models add remote control options for your home theater devices. Smartphone support is available with purchase of SlingPlayer Mobile software.Ready for VistaSlingPlayer software is compatible with the Windows Vista operating system. Future Vista-specific enhancements are expected in early 2007.What's in the BoxSlingbox Pro, SlingPlayer CD-ROM, AC adapter (100-240V 50-60Hz), ethernet cable, stereo audio cable, RF/coax cable, composite AV cable, S-video cable, remote control IR cable, and quick start guide.", "title": "Sling Media Slingbox PRO (SB200-100)", "price": 273.99, "salesRank": {"Electronics": 42397}, "imUrl": "http://ecx.images-amazon.com/images/I/3151DHVGEHL._SX300_.jpg", "related": {"also_viewed": ["B009FU8BTI", "B001EZRJZE", "B009FU8BR0", "B000VXKD8K", "B000IVDTSG", "B000AMLXHW", "B000J56H5I", "B000HBEKJE", "B004M189OM", "B00LIP10KK", "B0089L4TL8", "B000R3K488", "B004JOQSEA", "B000VXD2S8", "B003597DYE", "B002AVXDWE", "B001Z5140O", "B000YQ6DIS", "B005LMWPNM", "B00AEC9VM2", "B005KY3XN2", "B008H7MFKQ", "B00COJ8FPC", "B000CS7RYM", "B00BLUYPO0", "B0039BYJ4A", "B005KOZNBW", "B008TVSLVC", "B008RWHC0E", "B004HKIB6E", "B005FPT38A", "B004HO58SO", "B000X2L97S", "B00BUCLVZU", "B000BGOWIE", "B005E99A8K", "B0096KLQN0", "B00H9IJ1VU", "B0092U3TKC", "B00EYO241Q", "B00EEOSZK0", "B001ID829O", "B006R9O2PC", "B00GY0UB6I", "B00JXFM75Y", "B00BF2M21C", "B00CGYLLFG", "B006WB27G6", "B00GGVPKKC", "B005L9ZZ32", "B00DBPU8KS", "B002PQ4XWI", "B000I62XHY"], "buy_after_viewing": ["B009FU8BTI", "B001EZRJZE", "B009FU8BR0", "B000VXKD8K"]}}