{"asin": "B002L6HDPG", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]], "description": "iPod nano now has a built-in video camera that lets you spontaneously shoot video wherever you are. And that's just the beginning. It has a dramatic, polished anodized aluminum finish and a larger screen. The new Genius Mixes feature acts as your personal DJ, automatically searching your iTunes library, then making mixes you'll love. Take iPod nano anywhere and the new Pedometer counts your steps. Also making its debut: a built-in FM radio with two amazing features--iTunes Tagging and Live Pause. So the world's most popular music player now has more to play with.The world's most popular music player now has more to play with.Click to enlarge.nano Shoots VideoVideo a-Go-GoiPod nano now has a built-in video camera that lets you record fun as it happens. Then share it with friends on the Internet. It's the video camera that's small enough to take with you everywhere.Video Recording--a Whole New Way to nanoA quick scroll through the menu takes you to the video camera. Then you're ready to record video in portrait or landscape--perfect for emailing or posting on Facebook or MobileMe. A built-in mic lets you capture audio, too. And when you play back your video on iPod nano, you'll hear the recorded audio with it. All of which means your indispensable music player is now your indispensable video camera.Special Effects Department IncludedFifteen fun video effects let you add a little Hollywood to your video. Just scroll through, choose the effect you want--such as film grain or motion blur--and start recording. When you're done, sync iPod nano to your computer and iPhoto (or your favorite photo software) opens. Then email your miniblockbuster or post on YouTube or Facebook.Sync, Share, and Put More You in YouTubeConnect iPod nano to your Mac, and iPhoto opens and syncs all the video you shot on iPod nano to your computer. It's just as easy on a PC when you use your favorite photo software. On a Mac, you can browse and edit your videos in iPhoto, too. The video file sizes are perfect for sharing on YouTube or emailing to friends.Design Makes Rock More GlamiPod nano now has a polished anodized aluminum finish in nine electrifying colors. And a larger 2.2-inch color display for your viewing pleasure.Up to 2,000 songs, 8 hours of video, or 7,000 photos in your pocket.Click to enlarge.Ultra-portable at 3.6 x 1.5 x 0.24 inches and just 1.28 ounces.Click to enlarge.Available in an array of electrifying colors.Click to enlarge.iPod nano now has a built-in video camera that lets you spontaneously shoot video wherever you are.Click to enlarge.This Is GeniusControl your Genius. Or leave it to its own devices. Either way, Genius explores your library and finds songs that go great together.Genius PlaylistsSay you have one song you really love and want to hear other tracks that go great with it. A few clicks on iPod nano, and Genius uses that song to find other songs in your library and makes a Genius playlist for you. You can listen to the playlist right away, save it for later, or even refresh and give it another go. Count on Genius to create combinations you wouldn't have thought of yourself.Genius MixesNow there's another great way to get a customized set of songs on iPod nano--have Genius do all the work. Introducing Genius Mixes. All you do is sync your iPod nano to iTunes, and Genius automatically searches your library and finds songs that sound great together to create up to 12 Genius Mixes. These mixes are like channels programmed entirely with your music. It's a great way to rediscover songs you haven't listened to in forever, and some you even forgot you had.Go with the Cover FlowView your album art in Cover Flow for a faster way to find the song you want to hear. Or just press and hold the center button to flip the album cover art over so you can see the songs. When you find the right song, press the center button to add it to your on-the-go playlist.Shake to Shuffle Your MusicHear songs in a totally random way. Just turn on Shake to Shuffle, then give iPod nano a shake and it shuffles to a different song in your music library. You never know what iPod nano will spin for you next.Don't Just Listen to the Radio, Pause it and Tag it, TooThe new FM tuner lets you see the names of songs and artists. And two amazing features--iTunes Tagging and Live Pause--make listening to the radio nothing like listening to the radio.FM Radio--it Gives You Yet Another Way to RockThere's always something great on the FM dial. And now the FM tuner lets you hear your favorite morning shows on your commute and discover new music while you work out. It even shows you what and who you're listening to.1With Live Pause, You'll Never Miss a BeatSay you need to take a quick break from listening to your favorite radio station. iPod nano lets you pause it with a click. Another click and you're listening to your station again. You can even rewind as far back as 15 minutes, then fast-forward to catch up to the live broadcast.iTunes Tagging--the New-Fashioned Way to Discover MusicIt's quite a dilemma: You're listening to the radio and you hear a song you like, but when you go to iTunes, you can't remember the name or even who sings it. Enter iTunes Tagging. Now, you can use the Click Wheel on iPod nano to tag the song. iTunes creates a list of all your tagged songs so you can easily preview or purchase them when you sync iPod nano to iTunes.VoiceOver--the Talk of the Music WorldVoiceOver tells you the title and artist of the songs you listen to. And does it so seamlessly, you'll be surprised at how brilliant it is.Let's Talk VoiceOverWhat if you're listening to a song and want to know the title or the artist? Just use the Click Wheel or the controls on the optional Apple Earphones with Remote and Mic and VoiceOver tells you the song name and who's performing it without interrupting your music. So you're never distracted from your ride or run by looking down at your screen.The nano now includes an FM radio with iTunes Tagging and Live Pause functions.Capture a thought, a reminder, a class lecture, or any audio recording you want with Voice Memos.The new Pedometer counts every step you take. Or add Nike+ shoes and a Nike + iPod Sport Kit for the perfect workout partner.How it WorksYou'll notice how smoothly and easily VoiceOver works. A lot of thought went into creating an iPod nano that not only talks, but says the right things. It all begins with iTunes and its seamless integration with iPod nano. First, iTunes reads your song information, then uses the VoiceOver Kit to generate the announcements for the songs, artists, and playlists. Just sync your iPod nano to your computer and it really speaks to you.It Speaks Multiple LanguagesYour music library has songs from all over the world--a love song from France, a bolero from Spain, a pop tune from Japan. Luckily, VoiceOver speaks fluent song.iTunes selects the language and best voice for your song titles and artist names. It looks at song data, like the title, artist, and album information, then applies intelligent algorithms to choose the right language. For example, iTunes recognizes the song \"Ya Viene el Sol&#xFFFD; by Ozomatli as a Spanish song, so your iPod nano will automatically speak that song title and artist in Spanish. If you prefer to hear that information spoken in another language, you can change the designated VoiceOver language for that song in iTunes.Hit the Ground Running--Or WalkingWith the Nike + iPod Sport Kit (sold separately) and a built-in pedometer to help keep you motivated and track your fitness progress, iPod nano makes working out less routine.Step it up with the New PedometerYou take your iPod nano with you everywhere. Why not use it to stay fit? iPod nano now doubles as a Pedometer. It uses the built-in accelerometer to keep track of your steps and help you meet your fitness goals. You can create a daily step goal or set it to Always On so it counts all the steps you take, all the time. Which makes iPod nano the ideal exercise partner.Rock and RunYour shoes and your iPod nano team up to maximize your run. See the minutes tick by. Watch the miles unfold. Hear real-time voice feedback. All to your favorite music, including your chosen Power Song--that one song that always gets you through the home stretch.Rock the GymTake Nike + iPod to the gym and minute by minute, mile by mile, you're motivated by more than music. Connect your iPod nano to a Nike + iPod compatible cardio machine. Record your pace, time, and distance as you work out. With iPod nano, every trip to the gym becomes a new challenge.SyncWhen you're finished, connect your iPod nano to your Mac or PC. iTunes automatically sends your workout data to nikeplus.com. Every workout and every run is there, ready for you to review. Get pumped for your next run with recommended challenges, custom training programs, and maps of new routes to try. Or share motivation with runners across the world.Note to Self: Voice Memos Are HereThe built-in mic lets you capture a thought, a reminder, a class lecture, or any audio recording you want with Voice Memos.iTunes: Your Greatest HitsIt's even easier to organize, browse, grow, and share your digital music and video collection with the new iTunes. And now you can save items with a wish list and enjoy iTunes extras--bonus features on select albums and movies--like lyrics, photos, interviews, and behind-the-scenes media.What's in the BoxApple iPod nano 8 GB Black (5th Generation), Earphones, USB 2.0 cable, Dock adapter, Quick Start guide", "title": "Apple iPod nano 8 GB 5th Generation (Black)  (Discontinued by Manufacturer)", "price": 144.99, "imUrl": "http://ecx.images-amazon.com/images/I/41Lu8SfrcpL._SY300_.jpg", "brand": "Apple", "related": {"also_bought": ["B002SRQLM4", "B002PIHQ8O", "B002L6HDOC", "B002NZVCRA", "B002L6HDR4", "B003176HVU", "B002L6HDSI", "B002USXJWG", "B002L6HDQA", "B002XFJI6M", "B00IKMMEIQ", "B002OUCS04", "B001FA1NCI", "B002L6HDRY", "B002Q5XFCM", "B003UBFAKQ", "B002L6HDTC", "B002XFM2ZQ", "B002RSU80U", "B00AV2KRO6", "B001FA1NIC", "B002OU8YNO", "B00ADP25GY", "B001FA1NCS", "B002S0O7IG", "B002L6HDRE", "B002N8A14M", "B002OK5RMA", "B002L6HEAU", "B002VRFKN2", "B002RX7RN6", "B000A3WS84", "B000A3WS16", "B002L6HDT2", "B001F7AHOG", "B0037T36D4", "B001FA1ND2", "B002L6HECS"], "bought_together": ["B002SRQLM4", "B002NZVCRA"], "buy_after_viewing": ["B002L6HDOC", "B0097BEE9Q", "B002L6HDR4", "B001FA1NCI"]}}