{"asin": "B0038YGQTO", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Hubs"]], "description": "Medialink 4-Port High Speed USB 2.0 Hub*Top-Loading USB Port For Quick And Easy Access*Allows Addition Of Up To 4 Additional USB Devices*Well Spaced Ports To Avoid Crowding*Compatible With All Operating Systems Incl. Windows XP/Vista/7 And Mac OS XThis Medialink USB Hub provides Plug-and-Play simplicity for all of your USB peripherals such as USB Flash Memory Drives, USB Card Readers, iPod Docks, Printers, Cameras, Scanners and many other everyday USB peripherals (NO PERIPHERALS INCLUDED WITH THIS HUB).Convenient Port Layout- The top-loading port provides vertical access which is great for your more portable devices such as USB flash drives.- This hub spaces out the 4 ports so that everything fits nicely and easily unlike inline hubs where ports can be crowded.External Power Supply Included (not required for most devices)This Hub will provide up to 450mA to each USB port eliminating the need for a power supply for most USB peripherals. While most USB devices do not require additional power, some power hungry devices like external hard drives that do not have their own on board power will require use of the included external power supply.Compatibility- Backwards compatible with USB 1.0 devices and is compatible with all computers that have a USB 1.0 or 2.0 port- Compatible with all Operating Systems including Windows XP/Vista/7 and Mac OS XCharging- This is a standard USB 2.0 hub that requires a host computer to be attached and powered on in order to charge devices at the USB 2.0 max 500mA.- Due to the constraints of the USB 2.0 standard, this hub, like all USB 2.0 hubs,will not chargeyour USB devices that require more than 500mA such as an iPad.WarrantyMedialink products are backed by a Limited 1-Year Warranty.", "title": "Medialink 4-Port Powered USB 2.0 Hub with External Power Supply", "price": 17.95, "salesRank": {"Electronics": 53210}, "imUrl": "http://ecx.images-amazon.com/images/I/41YDkX8X69L._SY300_.jpg", "related": {"also_bought": ["B003MTTJOY", "B001TH7GUU", "B009SQQF9C"], "buy_after_viewing": ["B003Z4G3I6", "B005P2BY5I", "B00483WRZ6", "B000NB05MO"]}}