{"asin": "B001N85NMI", "description": "From the Cataloger The NETGEAR MoCA Coax-Ethernet Adapter Kit turns your existing coaxial cable outlets into high-speed Ethernet network connections, making them perfect for hooking up your HDTV, Blu-ray Disc player, DVR, or your favorite gaming console to your home network and the Internet. The MoCA integrates seamlessly with your existing HDTV setup and supports high-bandwidth applications for fast, continuous HD video streams..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The NETGEAR MoCA Coax-Ethernet Adapter Kit:Turns any coaxial outlet into a high-speed Ethernet network connectionSupports the highest bandwidth applications like HD videoOffers transfer speeds as high as 270 MbpsProvides data encryption for air-tight securityThe compact MoCA offers transfer speeds of up to 270 Mbps.View larger.Simple setups let you use existing coaxial cable outlets for high speed networking.View larger.Blazing-Fast PerformanceWith transfer speeds of up to 270 Mbps, the MoCA ensures that you won't be curtailed by slow loading and data transfers. The MoCA 's Advanced Quality of Service (QoS) supports uninterrupted HD video, gaming, and high-speed networking for easy integration with your HDTV or gaming system. Downloading HD-quality movies directly to your HDTV has never been faster, or easier.Quick and Easy InstallationInstalling the MoCA Coax-Ethernet Adapter Kit is as quick and easy as it gets. It features an easy plug-and-play design that installs within seconds of taking it out of the box: simply plug the unit directly into your existing coaxial cable outlet. It will work with DSL broadband, cable broadband, and your existing cable TV service, or in homes already wired for cable where the coax isn't in use. (The MoCA is not compatible with satellite television installations, such as DIRECTV or DISH Network.) Compatible with wired or wireless routers, the MoCA turns any coaxial outlet into a high-speed network connection in a matter of minutes.Supports a Wide Variety of ApplicationsUse the MoCA to connect an XBox 360, PlayStation 3, Blu-ray player, Apple TV, VUDU box, TiVo, Slingbox, DVR, NETGEAR ReadyNAS storage, or desktop or notebook computer to your home network. NETGEAR AV Series components are built to handle the high-performance needs of HD video, gaming, streaming music, and high-speed Internet connectivity.Air-Tight Privacy and SecuritySecurity and privacy is always an issue when dealing with a networking setup, but not with the MoCA. Thanks to NETGEAR's integrated data encryption feature that ensures your private information is safe from hackers, your network will be completely secure and private.Each MoCA Coax-Ethernet Adapter measures 1.0 x 6.75 x 4.38 inches (WxHxD) and weighs 0.62 pounds. It is backed by a one-year limited warranty.What's in the BoxTwo MoCA Coax-Ethernet Adapters (MCA1001), two RG-6 Coax cables with F-type connectors (1 meter/3.28 ft), two Ethernet cables (1.5 meters/4.92 ft), two power adapters, installation guide, setup CD, and warranty/support information card.", "title": "NETGEAR MCAB1001 MoCA Coax-Ethernet Adapter Kit (Black)", "price": 399.99, "imUrl": "http://ecx.images-amazon.com/images/I/31dva0aCjHL._SX300_.jpg", "related": {"also_viewed": ["B008EQ4BQG", "B008C1JC4O", "B00FF8ZRR8", "B00CZ6WC3A", "B001XUQOHE", "B004XOMJ6C", "B0088MB1TQ", "B0024FAQL2", "B00B89EU1W", "B009AGCLVG", "B00DC8IEE6", "B004XOMJ76", "B00AMCKN80", "B00FKTMWDE", "B00BFF9GG8", "B00684E0UI", "B002FB684E", "B000Q5Y9KG", "B00DVK1ITI", "B00C96Q0OI", "B004JKUMW8", "B00G5RDZTU", "B004HAOWLW", "B0041INCYI", "B004JKT3VY", "B004XOMJ6W", "B005DIQ2OC", "B00558UJTO", "B00KO5KHSQ", "B00IBPLI48", "B00D7GF6NA", "B0081FLFQE", "B00EPGHHSS", "B001RJMBZU", "B00KY8L5TS", "B004JKSIY2", "B0018BQR84", "B00AWRUICG", "B0014L4ZKK", "B00GJ7Y7MU", "B005GCSZD6", "B00KXR4E7A", "B007ILFFS6", "B00ARJN5WE", "B00DVK7IZ6", "B00I0MKIDO", "B002V75U7I", "B00BUCLVZU", "B00D7GF658", "B008R3LOM0", "B00ERXBV9K", "B005111SFO", "B004PA9PBQ", "B006V72AHC", "B005XUNWZ2", "B00HFW2EZK", "B00BPYEH1I", "B005PZCID2", "B00556LI1E"], "buy_after_viewing": ["B008EQ4BQG", "B008C1JC4O", "B00DC8IEE6", "B0018BQR84"]}, "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Network Adapters", "Powerline Network Adapters"]]}