{"asin": "B003IHV6XW", "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]], "description": "The newly designed GPSMAP 62 handheld navigator features a 2.6\" sunlight-readable 65K color screen that supports BirdsEye Satellite imagery (subscription required) and Custom Maps. Rugged and waterproof, GPSMAP 62 features a quad helix antenna for unparalleled reception and sleek new design.Rugged and waterproof, GPSMAP 62 features a quad helix antenna for unparalleled reception and sleek new design.Built-in worldwide basemap with shaded relief.The perfect companion for all your outdoor pursuits.Download geocaches and details straight to your unit.Beloved by Hunters, Hikers, and Geocachers of All AgesExploreGPSMAP 62 comes with built-in worldwide basemap with shaded relief, so you can navigate anywhere with ease. With photo navigation, you can download pictures from Garmin Connect Photos and navigate to them.Keep Your FixWith its quad helix antenna and high-sensitivity, WAAS-enabled GPS receiver and HotFix satellite prediction, GPSMAP 62 locates your position quickly and precisely and maintains its GPS location even in heavy cover and deep canyons. The advantage is clear--whether you're in deep woods or just near tall buildings and trees, you can count on GPSMAP 62 to help you find your way when you need it the most.Add MapsAdding more maps is easy with Garmin's wide array of detailed topographic, marine and road maps. With 1.7G of onboard memory, you can conveniently download 24K and 100K topo maps and hit the trail, download BlueChart g2 for a great day on the water or City Navigator NT map data for turn-by-turn routing on roads (see maps tab for compatible maps).GPSMAP 62 also supports BirdsEye Satellite Imagery (subscription required), that lets you download satellite images to your device and integrate them with your maps. In addition, the 62 is compatible with Custom Maps, free software that transforms paper and electronic maps into downloadable maps for your device.Get ConnectedYou've been busy exploring and now you want to store and analyze your activities. With a simple connection to your computer and to the Internet, you can get a detailed analysis of your activities and send tracks to your outdoor device using Garmin Connect. This one-stop site offers an activity table and allows you to view your activities on a map using Google Earth. Explore other routes uploaded by millions of Garmin Connect users and share your experiences on Twitter and Facebook. Getting started is easy, so get out there, explore, and share.Find FunGPSMAP 62 supports geocaching GPX files for downloading geocaches and details straight to your unit. By going paperless, you're not only helping the environment but also improving efficiency. GPSMAP 62 stores and displays key information, including location, terrain, difficulty, hints and descriptions, which means no more manually entering coordinates and paper print outs! Simply upload the GPX file to your unit and start hunting for caches. Slim and lightweight, 62 is the perfect companion for all your outdoor pursuits.What's in the BoxGPSMAP 62, Wrist Strap, USB Cable, Quick Start Manual", "title": "Garmin GPSMAP 62 Handheld GPS Navigator", "price": 249.99, "imUrl": "http://ecx.images-amazon.com/images/I/41JXVDzLnnL._SY300_.jpg", "brand": "Garmin", "related": {"also_bought": ["B005CSZ6MM", "B005F28KKU", "B003TZBE94", "B005C95B3U", "B000SMVQK8", "B004EZ7C2Q", "B001DDG8I6", "B002I05VRM", "B00F4J5NPO", "B004GVZEM8", "B002MIT5ZE", "B00INXARCM", "B0000996BA", "B00542NV32", "B001ULDAL4", "B00542NVDW", "B002I05VS6", "B00AXUXRVG", "B0043GW86G", "B001RYFYYK", "B00INXAJ0W", "B001DG206C", "B00FM8F3R0", "B006KRSE4G", "B002I03UVQ", "B0057OCS9A", "B0016H1RYE", "B006JXY0CQ", "B003I86PIM", "B00542NVS2", "B000196C2A", "B0016O0G26", "B003VKXIR8", "B002PHRDO2", "B00FY3ZQA2", "B002G1YPIO", "B001J5MQ20", "B0058GWR8O", "B00004VX39", "B00I01JQJM", "B0096I0VXI", "B000V9JNVC", "B007HIMJS4", "B00F3F0GLU", "B0075JMYIA", "B0058W1I38"], "bought_together": ["B005CSZ6MM", "B000SMVQK8"], "buy_after_viewing": ["B00542NVDW", "B000SMVQK8", "B005CSZ6MM", "B00F4J5NPO"]}}