{"asin": "B002MUYP3E", "description": "A keyboard designed to fit your space and your lifeDesigned to fit your space&#8212;and your life&#8212;the compact Logitech Wireless Keyboard K340 frees up space on your desk without requiring you to compromise on comfort. It's got a space-saving design with full-size layout, up to three years of battery life, and reliable wireless connection.Different setups. Different locations. One tiny Logitech Unifying receiver.The Logitech Unifying receiver is part of a new family of products that brings you wireless freedom and convenience without the hassle of multiple receivers. It's easy to pair up to six Unifying compatible devices, all to the same tiny receiver that never needs to leave your laptop. Now it's even more convenient to move around and work at the office, at home or on the road.Create The Combo That Works For You.See other products that work with Logitech Unifying receiver.Key FeaturesMore out of your batteriesYou'll get up to three years of battery life, practically eliminating the need to change batteries. An indicator light helps you keep an eye on your charge level.Plug it. Forget it. Add to it.This keyboard includes the Logitech Unifying receiver. The tiny wireless receiver stays in your notebook, so there's no need to unplug it when you move around. Plus, you can easily add a compatible mouse or number pad&#8212;without the hassle of multiple USB receivers.Reliable and convenientYou get the reliability of a cord plus cordless convenience and freedom, which translates into fast data transmission, virtually no delays or dropouts, and 128-bit AES encryption.Low profile with quiet, responsive keysThe low profile shifts your hands and wrists toward a more neutral position to help you type comfortably with quiet, responsive keys that feel great and barely make a sound.Which Logitech keyboard and mouse combo is right for you?GoodBetter&nbsp;BestUltradiNovo Keyboardfor NotebooksIlluminatedKeyboardWireless KeyboardK350Wireless KeyboardK340Compact KeyboardK300&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Product InformationKeyboardWirelessCordedWirelessWirelessCordedIntegrated Number PadConnection FeaturesUSB Support&nbsp;Wireless ProtocolAdvanced 2.4 GHzN/AAdvanced 2.4 GHzAdvanced 2.4 GHzN/AWireless Security128-Bit AES EncryptionN/A128-Bit AES Encryption128-Bit AES EncryptionN/AKeyboard DesignEnhanced Comfort&nbsp;&nbsp;&nbsp;&nbsp;Ultra-Thin Profile&nbsp;&nbsp;&nbsp;Palm RestIntegratedIntegratedIntegrated Cushion&nbsp;IntegratedBacklighting&nbsp;&nbsp;&nbsp;&nbsp;Adjustable Height/Angles&nbsp;&nbsp;Operational and Navigational ControlsEnhanced F-KeysLaunch Calculator Key&nbsp;&nbsp;Search Web&nbsp;Communication ControlsLaunch E-Mail&nbsp;Launch Web Browser&nbsp;&nbsp;Launch IM / VOIP&nbsp;&nbsp;System SupportCertified for Windows VistaWindows XPMac OS X&nbsp;&nbsp;&nbsp;Create The Combo That Works For YouLogitech has a range of products that you can connect via a single, tiny receiver you leave plugged in to your notebook. Plug it. Forget it. Add to it. Now you can create your perfect laptop workstation, wherever you work.", "title": "Logitech Wireless Keyboard K340", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51aOTwQaN-L._SX300_.jpg", "related": {"also_bought": ["B00325ME7W", "B002HWRJBC", "B003NR57BY", "B003TG75EG", "B002OGMNT4", "B003I4FHNA"], "buy_after_viewing": ["B007PJ4PN2", "B003VANO7C", "B003NR57BY", "B00BP5KOPA"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Keyboards"]]}