{"asin": "B001B8CU8U", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Keyboard & Mouse Combos"]], "description": "Overview:Sit back and enjoy fast, easy access to all your favorite digital pictures,  music, videos&#x97;and more&#x97;with this sleek, ultra-thin quiet touch keyboard. The  companion wireless mouse delivers ergonomic comfort and advanced productivity  with Microsoft&#xAE; High Definition Optical Technology, Flip 3D button, and  Magnifier.Features:&nbsp;&nbsp;&nbsp;Flip 3D KeyPress this key to display a 3D overlay of all open windows and cycle through them.&nbsp;Hot KeysOne-touch access to Windows Media&#xAE; Player, e-mail, Home, calculator, My Documents, instant messaging, and photos.&nbsp;High Definition Optical TechnologyMore responsive, more precise, smoother tracking.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;MagnifierEnlarge screen detail.&nbsp;Two-Way Scroll WheelFor faster on-screen navigation.&nbsp;Extended Battery LifeAverage 6+ months of battery life.&nbsp;Additional Features:Windows Start Button:Simply press to launch your Start menu. If you have Windows Vista installed, search your PC or the Web right from there.Media Center:Control your media activities with the touch of a button.\"My Favorites\" Keys:Customize these 5 keys to instantly bring up the photos, folders, files, and Web pages you use most. Simply push and hold to set.Enhanced F Keys:Perform common commands from your keyboard.Spill-Resistant:Integrated water channels drain the liquid away.Quiet Touch Keys:Quiet, responsive, thin-profile keys.Wireless:Less clutter on your desktop.Gadgets:One-touch access to weather, stock quotes, and more.&nbsp;&nbsp;System Requirements:Windows Vista&#xAE; or Windows&#xAE; XP100 MB hard drive spaceor Mac OS X v10.2x&#x96;10.5x30 MB hard drive spaceWindows-compatible speakers or headphonesUSBCD-ROM drive4 AA alkaline batteries (included)&nbsp;&nbsp;", "title": "Microsoft Wireless Media Desktop 1000 (Black)", "price": 39.5, "imUrl": "http://ecx.images-amazon.com/images/I/31JvUA7Q2nL._SY300_.jpg", "brand": "Microsoft", "related": {"also_bought": ["B003SVSJ1K", "B002EDLQRW", "B00CO8TBNS", "B002DPUUL4", "B0006FUHSE", "B004EFUOY4", "B000Q6UZBM", "B009YCASUW", "B001S4OTS6"], "bought_together": ["B0019804U8"], "buy_after_viewing": ["B001S4OTS6", "B003VANO7C", "B004SUO1QM", "B004SUO1R6"]}}