{"asin": "B002M3SOBU", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]], "description": "iPod touch is a great iPod, a great pocket computer, and a great portable game player. Listen to a mix of songs automatically put together by the new Genius Mixes feature. Watch a movie. Surf the web. Download countless apps. (Click hereto jump down the page and learn all about apps.) View rich HTML email. Find your location and get directions with Google Maps. Discover games and apps you're sure to love with new Genius recommendations for apps. And since iPod touch now comes with the latest 3.1 software already installed, you can start using fun, convenient features right out of the box.View an interactive demo on the iPod touch(opens a new window).iPod touch is a great iPod, a great pocket computer, and a great portable game player.Click to enlarge.Genius Mixes creates multiple mixes you'll love.Give iPod touch a shake to shuffle to a different song in your music library.Next-Level Fun: The New iPod touchMusicFlick through your albums. Listen to a unique mix created just for you. Or watch the video for your favorite song. With iPod touch, it's more than just hearing your music.Cover FlowWhat a song does for your ears, Cover Flow on iPod touch does for your eyes and fingers. It's a virtual party for the senses. Turn iPod touch on its side and glide through your music by album art with the flick of your finger. Tap an album cover to flip it over and display a track list. Tap again to start the music.Genius MixesNow the Genius feature is even more powerful. Introducing Genius Mixes. All you do is sync iPod touch to iTunes, and Genius automatically searches your library to find songs that sound great together. Then it creates multiple mixes you'll love. These mixes are like channels programmed entirely with your music.Genius PlaylistsSay you're listening to a song you really like and want to hear other tracks that go great with it. The Genius feature finds other songs on your iPod touch that sound great with the one you were listening to and makes a Genius playlist for you. Listen to the playlist right away, save it for later, or even refresh it and give it another go. Count on Genius to create a mix you wouldn't have thought of yourself.Shake to ShuffleShake things up a bit. Musically speaking, that is. The next time you're listening to your tunes, turn on Shake to Shuffle, then give iPod touch a shake to shuffle to a different song in your music library.iTunesFill your iPod touch with songs and music videos from your iTunes library on your computer. Or buy and download new music on your iPod touch when you access iTunes over Wi-Fi. Songs you purchase on iPod touch transfer to your Mac or PC the next time you connect iPod touch to your computer.BluetoothLook, no cables. iPod touch includes the iPhone 3.1 software, so you can pair Bluetooth stereo headphones with it. Keep your iPod in your bag or charging on your desk across the room and still listen to your music.Carry hours of video with you and watch it on the crisp 3.5-inch color widescreen display.With iTunes on your iPod touch and a Wi-Fi connection, you can buy movies and TV shows on the fly.Movies + TV showsA feature film. A video podcast. Your favorite TV show. Now appearing on a subway train or a plane near you.Widescreen ViewingCarry hours of video with you and watch it on the crisp 3.5-inch color widescreen display. Shop the iTunes Store and choose from thousands of movies, TV shows, and video podcasts to load up your iPod touch. From Hollywood blockbusters to independent favorites, there's something for everyone. Download and watch movies with a few taps. Prefer TV shows? Get a single episode or an entire season's worth all at once.Onscreen ControlsWhile watching your video, tap the display to bring up the onscreen controls. You can play or pause, view by chapter, and adjust the volume. You can also use the volume controls on the left side of iPod touch. Want to switch between widescreen and full screen? Simply tap the display twice.iTunesNeed some entertainment for your next flight or road trip? With iTunes on your iPod touch and a Wi-Fi connection, you can buy movies and TV shows on the fly. You can also rent movies, in case you're not sure if that flick is a keeper. And of course, you can purchase movies and TV shows on your Mac or PC, then sync them to your iPod touch.App StoreShop the App Store and discover over 75,000 apps that let you do even more with your iPod touch. Browse apps in categories from games to lifestyle, social networking to education, and more.Discover apps in categories from games to lifestyle, social networking to education, and more.The built-in Wi-Fi capability in iPod touch gives you access to the iTunes Store anywhere, anytime.Browse AppsShop the App Store a number of ways. Tap Featured and get a list of new apps and to see what's hot. Peruse by category. Check out the Top 25 apps. Or if you know exactly what app you're looking for, find it by doing a quick search.Amazon-Related AppsHave Amazon at your fingertips with these applications:Amazon Mobile: Buy millions of products from the palm of your handKindle: Read Kindle books on your iPhone or iPod touchGenius Recommendations for AppsThere are tens of thousands of apps in the App Store, with more added every day. A new feature of iPod touch makes finding cool new apps even easier. It's Genius for apps, and it works just like Genius for your music. Tap the Genius icon and get recommendations for apps that you might like based on apps you and others have downloaded.Download AppsWhen you find an app you want, buy and download it wirelessly to your iPod touch from anywhere over Wi-Fi, and start using it right away.Update AppsiPod touch tells you whenever an app update is available, so you'll always have the latest versions of your favorite apps.iTunesDiscover and download new music, movies, TV shows, and audiobooks with iTunes on your iPod touch.Shop Anytime, AnywhereThe built-in Wi-Fi capability in iPod touch gives you access to the iTunes Store, where you can choose from millions of high- quality iTunes Plus songs and thousands of movies, TV shows, audiobooks, and free podcasts and iTunes U lectures. Browse New Releases, Top Tens, and Genres. Or find exactly what you're looking for by typing in a quick search. Play a preview of any song or video, then tap once to buy it. Not sure if that movie is worth owning? Just rent it. Everything you buy on iPod touch is the same price you pay on the iTunes Store on your computer.Sync with iTunesWhen you connect iPod touch to your computer, the music, movies, TV shows, audiobooks, and podcasts you downloaded on the go sync to your iTunes library on your Mac or PC. If you've partially downloaded something on iPod touch, your computer completes the download automatically.PhotosWith storage for up to 90,000 of your favorite photos, iPod touch lets you flick through and share all those remember-that-day moments.Share PhotosShow thousands of photos from the palm of your hand. Flick to scroll through thumbnails. Tap to view full screen. Play slideshows, complete with music and transitions. Email a photo to a friend or share it in a MobileMe Gallery.With storage for up to 90,000 of your favorite photos, iPod touch lets you flick through and share all those remember-that-day moments.Save PhotosIf you receive a great image in an email, save it to your photo library on iPod touch. Once there, it acts just like any other photo. You can set it as your wallpaper, share it on the web, or pass it on.Sync PhotosiPod touch uses iTunes to sync photos you have in iPhoto on a Mac or in Adobe Photoshop Elements and Adobe Photoshop Album on a PC. Just choose which photos or albums to sync to your iPod touch, then you can look at them--and share them--anywhere you go.Home ScreenMaybe you want Maps as the first app in the second row. Or Mail down in the Dock. Whatever the arrangement, make iPod touch your own with customized Home screens.Customize Your Home ScreenArrange the icons on your Home screen any way you want right on iPod touch or from your computer using iTunes 9. Move an app one row up, two apps over, or even to another Home screen. Create up to 11 Home screens for quick access to the games and applications you download from the App Store and to your Safari web clips.Home ButtonNo matter where you are on iPod touch, one press of the Home button at the bottom of iPod touch takes you to the main Home screen. You can also take a shortcut from any Home screen back to your main Home screen by pressing the Home button.Search the entire contents of your iPod touch, all from one place.iPod touch features Safari, the most advanced web browser ever on a portable device.Spotlight SearchLooking for something? Search the entire contents of your iPod touch, all from one place. On your main Home screen, just swipe to the right to bring up Spotlight. Once you start typing, Spotlight begins searching all of your music, videos, contacts, email, calendars, notes, and even your audiobooks and podcasts.Add Apps and Web ClipsWhenever you download an application from the App Store, a new icon appears on your Home screen. And if you check the same websites every day, just create web clips. They appear on your Home screen, and you can access the sites directly with a single tap.SafariiPod touch features Safari, the most advanced web browser ever on a portable device. See the web in your hands the same way you see it on a computer. All you need is a Wi-Fi connection.Browse AnywhereiPod touch is the only iPod with built-in wireless access to the web. Whenever you're connected via Wi-Fi, you can access your favorite websites to read news, check scores, pay bills, and go shopping. And if you're using the new 32 GB or 64 GB iPod touch, you'll notice that web pages load even faster than before.Search the WebiPod touch syncs your bookmarks from your PC or Mac, so you can access your favorite sites quickly. It has Google and Yahoo! search built in, so it's easy to find what you're looking for on the web.Web ClipsIf you check a website frequently--a favorite newspaper, blog, or sports site--why not create a Home screen icon, or web clip, for it? Make web clips with Safari, and your favorite sites are always just a tap away.ZoomGet a closer look at any web page by zooming in and out with a tap or a pinch of the Multi-Touch display. View websites in portrait or landscape. Rotate iPod touch 90 degrees and the web page rotates, too.mail on iPod touch looks and works just like email on your computer.With Maps and a Wi-Fi connection, you can get directions, find local businesses, and check traffic.MailEmail on iPod touch looks and works just like email on your computer. And it works with the email accounts you already have.View Messages and AttachmentsiPod touch supports rich HTML email, so images and photos appear alongside text. And you see email attachments in their original formats, not stripped-down versions. Rotate, zoom, and pan in more than a dozen standard file and image formats, including PDF; Microsoft Word, Excel, and PowerPoint; and iWork.Access All Your AccountsAccess your email from popular providers--including MobileMe, Google Gmail, Microsoft Exchange, Yahoo! Mail, and AOL--and most industry-standard IMAP and POP mail systems.Compose InstantlyiPod touch recognizes email addresses in different applications. If you run across an email address on a web page or a map listing, for example, just tap it and iPod touch opens a new message and addresses it for you.Type SmartWith its built-in dictionary,* the intelligent iPod touch keyboard predicts and suggests words as you type, making it fast and easy to write email. And when you rotate iPod touch on its side, the keyboard instantly switches from portrait to landscape for larger keys and more room to type.Search Your InboxNo need to scroll through message after message in your inbox looking for the right one. A quick downward flick brings up a search field that lets you find email by sender, recipient, subject, or all headers.MapsFind your way and a place to eat. With Maps and a Wi-Fi connection, you can get directions, find local businesses, and check traffic.Find YourselfiPod touch finds your location using known Wi-Fi hotspots. It also finds points of interest by keyword: Search for \"coffee\" and iPod touch shows you cafes nearby.Get DirectionsJust type in an address and get directions from wherever you are. Choose the method of transportation--car, public transit, or on foot--and view a list of turn-by-turn directions. See a highlighted map route with estimated travel time. You can also mark specific locations and find the best route between them.Explore and share your favorite YouTube clips.Track your workouts, set goals, and challenge friends with Nike+.Click to enlarge.Switch Map ViewsJust like Google Maps on your computer, Maps on iPod touch lets you switch between views of Google map data, satellite images, and a hybrid of both. Multi-Touch makes the difference. Tap to zoom, pan, and change your view on the move.See TrafficMaps on iPod touch shows you live traffic information, indicating traffic speed along your route in easy-to-read green, red, and yellow highlights.YouTubeSkateboarding moves gone wrong. Hilarious commercials from another country. Whatever the video, iPod touch has your YouTube addiction covered.Share from AnywhereEmail your favorite videos to your favorite people. Tap Share on any YouTube video detail page and iPod touch creates an email with the video link already in it.Search YouTubeExplore Featured, Most Viewed, Most Recent, and Top Rated videos. Or search for the video you want using a keyword search. Once you find what you're looking for, bookmark it to watch later.Nike + iPod CompatibilityRock out your workout. iPod touch has built-in support for Nike + iPod. It's music and motivation rolled into one.Tune Your RuniPod touch includes built-in Nike + iPod support. Just slip the Nike + iPod Sensor (available separately) into your Nike+ shoe and start your run. The sensor communicates wirelessly with your iPod touch, tracking your time, distance, and calories burned. It even gives you voice feedback on your progress.Tune Your Cardio WorkoutThis feature also works with new cardio equipment available in many fitness centers. Just look for Nike + iPod compatible treadmills, ellipticals, stair steppers, and stationary bikes.Sync with nikeplus.comWhen you get back to your computer, sync your iPod touch with iTunes and transfer your exercise data to nikeplus.com, where you can track your workouts, set goals, and challenge friends.Play the latest head-to-head games with a friend--whether your friend is sitting next to you or across the country.Want more room to type? Rotate iPod touch to landscape to use a larger keyboard in Mail, Notes, and Safari.Download movies, TV shows, music videos, and audiobooks over Wi-Fi from the iTunes Store on iPod touch.More FeaturesiPod touch comes with the latest software already installed. And you also get convenient apps including Contacts, Calendar, Notes, Stocks, and Weather.iPhone 3.1 Software FeaturesGenius MixesThis new feature acts as your personal DJ, searching your iTunes library to find songs that go great together, then organizing them into mixes you'll love. All automatically.Genius Recommendations for AppsWith thousands of apps in the App Store, how do you find cool new ones? Let Genius help. It looks at the apps you're using and recommends others you might like.Peer-to-Peer GamingPlay the latest head-to-head games with a friend--whether your friend is sitting next to you or across the country.Buy Movies, TV Shows, and Audiobooks via Wi-FiDownload movies, TV shows, music videos, and audiobooks over Wi-Fi from the iTunes Store on iPod touch.Landscape KeyboardWant more room to type? Rotate iPod touch to landscape to use a larger keyboard in Mail, Notes, and Safari.Cut, Copy &amp; PasteCut, copy, and paste words and photos, even between applications. Copy and paste images and content from the web, too.Spotlight SearchFind what you're looking for across your iPod touch, all from one convenient place. Spotlight searches all your contacts, email, calendars, and notes, as well as your music and video.Automatic Wi-Fi LoginLog in to a Wi-Fi hotspot and iPod touch remembers your user name and password the next time you connect.AccessibilityThe new iPod touch comes with standard accessibility features that help people with disabilities experience the fun of iPod touch.Stereo BluetoothEnjoy music and other audio wirelessly. Pair your iPod touch with compatible Bluetooth stereo headphones.Shake to ShuffleJust give your iPod touch a shake, and it shuffles to a different song in your music library. You'll always be surprised by what you hear.Parental ControlsDecide what music, videos, and apps your kids can access.Stocks on iPod touch shows you performance information for any stock you choose.Check worldwide weather at home or away.Pioneering hardware technology built into iPod touch is how you're able to flick, tap, and pinch.iPod touch also includes these useful apps:CalendarCalendar works with Yahoo!, Google, Microsoft Outlook, iCal, MobileMe, and Microsoft Exchange ActiveSync for enterprise. Add events. Set reminder alerts. Subscribe to calendars for things such as national holidays and sports schedules.ContactsPut names, email addresses, phone numbers, and more at your fingertips. Sync contacts on your Mac or PC to iPod touch using iTunes. Add new contacts on the go with a tap.NotesForget the pen and paper. Use Notes on iPod touch to write yourself a quick note and keep important information on hand. A built-in email function lets you send notes to yourself or others.StocksStocks on iPod touch shows you performance information for any stock you choose. When you want more details about a stock's performance, tap the Y! for instant access to Yahoo! Finance.WeatherCheck worldwide weather at home or away. Add the cities you want, then flick back and forth to get six-day forecasts for each. Tap the Y! to open a Yahoo! city guide that shows you what's happening, rain or shine.CalculatorCalculator on iPod touch does double duty. In portrait mode, you can use Calculator for simple calculations. Rotate iPod touch to landscape, and it becomes a sophisticated scientific calculator.iPod touch TechnologyPioneering hardware technology built into iPod touch is how you're able to flick, tap, and pinch. It's what makes that racing game feel so real. It's why you're able to tweet what you just overheard in the cafe. And it's the reason iPod touch is the most amazing iPod you'll ever own.Multi-TouchThe Multi-Touch display layers a protective shield over a capacitive panel that senses your touch using electrical fields. It then transmits that information to the LCD screen below it. So you can glide through albums with Cover Flow, flick through photos and enlarge them with a pinch, zoom in and out on a section of a web page, and control game elements precisely.AccelerometerThe accelerometer inside iPod touch allows it to detect when you rotate iPod touch from portrait to landscape, then automatically changes the contents of the display. The accelerometer really shines when you play games, because it immerses you in the action. It's perfect for racing games, where your entire iPod touch acts as a steering wheel, and for tap-and-tilt games such as Rolando, in which your movements control the action.WirelessiPod touch has built-in support for 802.11b/g wireless technology. That means you can get online anywhere there's Wi-Fi. Send email from a coffee shop. Surf the web at the airport. Shop for games from your couch. Browse, buy, and download music and more from the iTunes Store. iPod touch locates nearby wireless hotspots, including protected networks. If you've never used a particular network, Wireless Icon it asks you to enter a password the first time, and it remembers the password from then on. So the next time you're within range, it connects automatically.BluetoothBluetooth is a form of wireless technology that lets you use devices without the hassle of cables or wires. What does that mean for iPod touch? It means you can use iPod touch with Bluetooth headphones and listen to your music no matter where in the room your iPod touch is. So lounge on your bed, while your iPod touch charges on your desk. Bluetooth on iPod touch is also great for peer-to-peer gaming.DesigniPod touch is as remarkable outside as it is inside. Holding one is all the proof you need. With its curved design, iPod touch is a mere 8.5 mm thin. Its optical glass front and polished stainless steel back feel sleek and smooth in your hand. Turn it on, and instantly you're impressed by the brilliant 3.5-inch display. iPod touch is the perfect combination of stunning design and revolutionary technology--the total, beautiful package.Read Kindle books on your iPod touch.Read Kindle Books on the iPod touchNo Kindle required.Get the best reading experience available on your iPhone or iPod touch.Access your Kindle books even if you don't have your Kindle with you.Automatically synchronizes your last page read between devices with Amazon Whispersync.Adjust the text size, add bookmarks, and view the annotations you created on your Kindle.Don't have a Kindle?Get yours here.Shop for Books on the Kindle Store on Your iPod touchBuy a book from the Kindle Store, optimized for Safari, on your iPod touch or iPhone and get it auto-delivered wirelessly.Search and browse more than400,000 books, including more than 103 of 112New York Timesbestsellers.FindNew York Timesbestsellers and new releases for $9.99, unless marked otherwise.Get free book samples; read the first chapter for free before you decide to buy.Books you purchase also can be read on a Kindle.Kindle newspapers, magazines, and blogs are not currently available on the iPod touch or iPhone.Kindle for iPhone is currently available for customers in Argentina, Australia, Austria, Belgium, Brazil, Canada, Chile, Colombia, Costa Rica, Croatia, Czech Republic, Denmark, Dominican Rep., Ecuador, El Salvador, Estonia, Finland, France, Germany, Greece, Guatemala, Honduras, Hong Kong, Hungary, India, Ireland, Israel, Italy, Jamaica, Japan, South Korea, Latvia, Lithuania, Luxembourg, Malta, Republic of, Mexico, Moldova, Republic Of, Netherlands, New Zealand, Nicaragua, Norway, Panama, Paraguay, Peru, Philippines, Poland, Portugal, Romania, Russia, Slovakia, Slovenia, South Africa, Spain, Sri Lanka, Sweden, Switzerland, Taiwan, Thailand, United Kingdom, United States, Uruguay, Venezuela, and VietnamWhat's in the BoxApple iPod touch 8 GB (2nd Generation--with iPhone OS 3.1 Software Installed) [NEWEST MODEL], standard Apple Earphones, USB 2.0 cable, Dock adapter, Quick Start guide", "title": "Apple iPod touch 8 GB 2nd Generation (Discontinued by Manufacturer)", "price": 199.25, "imUrl": "http://ecx.images-amazon.com/images/I/41WgyV%2ByOLL._SX300_.jpg", "brand": "Apple", "related": {"also_bought": ["B002QCIHSM", "B001J85BS8", "B001FA1NZK", "B007Z0FKNU", "B007Z0GFWU", "B007Z0FKX0", "B00517CEUQ", "B007Z0GFPM", "B00DQG65HW", "B001FA1O0O", "B001JP8T9Y", "B007Z0GFK2", "B0089V5HDW", "B004E41R5A", "B0056XAX1W", "B00JG7MZTC", "B000X22HJW", "B00C3XCNFW", "B00IKMMFYE", "B0012JCYPC", "B0070JR4Q2", "B0012JCZYM", "B009FDTYTQ", "B007AQVGH8", "B005GS3C2O", "B002M3SOC4", "B00862OF1E", "B002FP9PLI", "B001L80VPO", "B0088XNZQW", "B0097BEFI6", "B003L18Z8E", "B00517E1O8", "B001FA1NZU", "B008XF706G", "B00862OEOM", "B003SX0NG2", "B00365F6G4", "B004NW39OK", "B008BR4L2W", "B0097BEF0O", "B00365F6EG", "B0033BU0F8", "B0047DVWLW", "B0097BEF7M"], "bought_together": ["B001J85BS8", "B002QCIHSM"], "buy_after_viewing": ["B001FA1NZK", "B001FA1O0O", "B0097BEFI6", "B005GS3C2O"]}}