{"asin": "B003DNS882", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Remote Controls", "TV Remote Controls"]], "description": "Compatible with more than 650 devices, the Philips Universal 3-in-1 remote control (SRP2003) lets you control your TVs, DVD players, DVRs, and cable/satellite devices with a single remote. Featuring the new, easy SimpleSetup feature and large buttons, this universal remote takes the headache out of using complex remotes, making it easy to navigate your entertainment system. All of the codes you'll need to operate multiple devices can be found in the included user manual as well as on the dedicated Philips universal remote control website.Universal remote control 3-in-1 for TV/DVD/CBL (SRP2003)At a glance:Compatible with 650+ devicesSimpleSetup feature for quick and easy setupControl TVs, DVD players, cable boxes, and moreLarge buttons are easy to readFind access codes for brands at Philips URC websiteControl multiple TVs, DVD players, and cable devices in minutes with Philips' SimpleSetup.View larger.Innovative SimpleSetupThe innovative Philips Universal 3-in-1 remote control is designed to be fast and easy. In fact, setup may not even be necessary; your devices may automatically respond to the remote. If your devices are unresponsive, you can simply input the four-digit code that corresponds to your device.According to Philips' research, more than 92 percent of users rated the remote's SimpleSetup feature as \"good\" or \"very good.\" In a few minutes or less, you'll be able to control your TVs, DVD players, DVRs, and cable/satellite devices.Compatible with More than 650 DevicesReplace the many remote controls you have lying around your house with this Universal remote. Over 650 devices are compatible with the remote, including TVs, DVD players, SAT devices, CABLE devices, DVDR-HDD combos, Blu-Ray players, DTVs, and DVR devices.Ergonomic Design Features Large ButtonsThe Philips Universal remote replaces the gridlock of numbers and buttons commonly featured in other remotes with larger buttons that are easy to locate and read. The comfortable, lightweight feel of the remote makes it easier to handle.Online Universal Remote Control Support ServicesAll the access codes for your main devices are easy to find in the included instruction manual or on the dedicated Philips URC website.The Philips Universal 3-in-1 remote control requires two \"AAA\" batteries (sold separately), and is backed by a one-year limited warranty.About PhilipsPhilips has a brand promise of \"sense and simplicity\" that encapsulates their commitment to understanding and catering to the desires and needs of consumers and customers. By putting end users front and center, Philips creates innovative products that are designed around people's needs and aspirations, and are both advanced and easy to use. With 60,000 registered patents, Philips is a global leader in innovation, and receives numerous international design awards every year.What's in the BoxPhilips SRP2003 Universal remote control 3-in-1 TV/DVD/CBL and user manual.", "title": "Philips SRP2003/27 Universal 3 In 1 Remote Control for TV and DVD with XL Buttons", "price": 12.11, "imUrl": "http://ecx.images-amazon.com/images/I/31GSVSdAUaL._SY300_.jpg", "brand": "Philips", "related": {"also_bought": ["B0056C7SWK", "B003DNS88C", "B004PYKM1Y", "B007TAMHRI", "B007TAMIAO", "B001IAX4WM", "B002YJ5U9Q", "B00385XUF6", "B0039MJ4R6", "B008KVUAGU", "B00422KWU0", "B000HKGK8Y", "B007F9XHBI", "B00GOILYB6"], "bought_together": ["B007TAMIAO"], "buy_after_viewing": ["B003DNS88C", "B007TAMIAO", "B004PYKM1Y", "B007TAMHRI"]}}