{"asin": "B004MKNJ84", "description": "Using a tripod helps improve the results you get from your camera by holding it much more steady than you can yourself, making photos sharper and allowing you to concentrate more on catching the right scene at the right moment.By using your camera's self-timer and a tripod, you can even get into some of your pictures yourself too.When it comes to video, a tripod is even more essential: it eliminates the distracting shakiness that hand-held video often has and it keeps the picture straight.Overall, a tripod helps you get the best out of your compact camera, by giving you the flexibility to use camera settings (like low ISO, for example) that produce better quality images, and holding the camera still for longer exposures in low light, producing shake-free photos and video that really capture the colors and atmosphere.The MKC3-H01 Photo-Movie Kit is a Compact Series tripod with a built-in head designed for both taking photos and shooting video. The ''grip''-style head has a Photo/Movie switch on the side; when the Photo setting is selected, the head allows you to rotate the camera between landscape and portrait positions and then lock it in place before taking a photo.In Movie setting, the camera is locked in landscape orientation but free to rotate left-right, so you can use the grip handle to move the camera smoothly when filming subjects in motion, or to take in wide views without losing horizontal level. Compact Series tripods have quick release camera plates so you can attach and detach your camera in seconds. The plate has an universal tripod mount for every camera (a screw thread on the underside).Compact Series tripods also have ergonomic lever leg locks, so opening and closing the tripod is fast.The Compact Series was designed to be an ideal first tripod: easy to use; quick to attach, detach, extend and fold; ultra-portable when closed yet practical and tall when open, they're among the most compact full-size tripods available; strong and secure enough to support anything from small point-and-shoots and compact camcorders up to entry-level DSLRs with kit lenses. iPhones and other camera phones can be supported too (check your camera has a tripod thread on the underside, or that you have a tripod thread adapter for your phone).Technical Specs:Attaches byUniversal camera attachmentCenter ColumnRapidColumn Cross Sectionthree-facetedColumn Tube Diameter22 mmFront Tilt0&#xB0; / +90&#xB0; head tiltLateral Tilt-90&#xB0; / +90&#xB0; head tiltPanoramic Rotation360&#xB0;Leg Angles21&#xB0;Leg Cross SectionOvalMaximum Height154 cm &#x2022; 60.6 inMinimum Height44.5 cm &#x2022; 52.8 inClosed Length46 cm &#x2022; 18.1 inWeight1.15 kg &#x2022; 2.5 lbLoad Capacity1.5 kg &#x2022; 3.3 lbLeg Sections5 numberMaterialAluminumPlate Type785PL", "title": "Manfrotto MKC3-H01 Compact Photo-Movie Kit (Black)", "price": 11.9, "imUrl": "http://ecx.images-amazon.com/images/I/31oQvWHR10L._SY300_.jpg", "related": {"also_bought": ["B000L484VW", "B0010CEWDI", "B001HBIZ3K", "B00D76RNLS", "B002HJ9PTO", "B004TJ6JH6", "B000VVZ0K8", "B00F7NSWTG", "B0080JH3YE", "B00CAE8PM4", "B00BCEJ0E0", "B002ZIMEMW", "B004BOZKQK", "B007NDL54C", "B005NJCF7E", "B003QKBVYK", "B00BHN05H2", "B00007EDZG", "B00BIK04ZM", "B00GQDORA4", "B003HNS6S0", "B00C7J5ZC0", "B001EXVQJQ", "B0048IW030", "B007NDL56A", "B00IV4EHVU", "B0017U0BRE", "B000KZALSG", "B002VPE1WK", "B004LEAYXY", "B004MKNJCU", "B00H0KD9M4", "B004TA6Y8O", "B00004ZCAU", "B002LVUIXA", "B002W3IXZW", "B00EN0Y8S8", "B00DMS0GTC", "B002KDQPWM", "B0002JETWE", "B00005K47X", "B0049XGNKK", "B0049WBZEK", "B004XNLR16", "B00HTWF7MS", "B0047FHOWG", "B00007E7JU", "B004L35FCK", "B00FG709H6", "B007M54E1M", "B00004ZCEQ", "B008H4JLTC", "B0037NX6JY", "B001S2PPT0", "B00EEA960W", "B00093ESSI", "B00AKHJSTW", "B0053V5MF4", "B007ORXEIW", "B000Y021NA", "B0088VQEV2", "B0049VMMZ2", "B004XIB9T6", "B0059BH85K", "B002NEFL8W", "B0076EHMRW", "B0096SZNPE", "B000YA33DC", "B0043VE29C", "B00CHNREYS", "B00AI6D710", "B006ITEP7Q", "B00BXA7N6A", "B004JMZPK0", "B001QWBM62", "B00FP1BQ1Q", "B00G9G76PQ", "B007SXJ26A", "B003VNKNF0", "B005DFP6M4", "B00B7ID9CU", "B005Z4ROIW", "B007ZB58Z4", "B005UFZ7F8", "B004KVJ3OE", "B000O7AW98", "B000BQ79W0", "B004Q3C98S", "B00449NU3W", "B0000BZL68", "B003WO7MZC", "B00CRY250U", "B005UF3G2Y", "B007LTH1X2", "B005IQRMN4", "B009TL1YMY", "B0036AYTWG", "B0034WR19Y", "B00HIKBW1G"], "buy_after_viewing": ["B000L484VW", "B00EOWYNDK", "B001D60LG8", "B007S02F8K"]}, "categories": [["Electronics", "Camera & Photo", "Tripods & Monopods", "Complete Tripods"]]}