{"asin": "B001CF2TYC", "description": "Amazon.com Product Description When only the fastest wireless connection will do, the Belkin N+ USB adapter has you covered. This adapter lets you connect your desktop or notebook computer to a Wireless-N network, letting you take advantage of the protocol's ultra-fast and reliable wireless connection. With Wireless-N performance, downloading large files, streaming HD video, playing online games, and making clear Internet phone calls without hiccups or slow-ups will never be a problem again..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The Belkin N+ USB Adapter:Supports latest 802.11n Draft 2.0 technology for speed up to 300 Mbps.Uses smart MIMO antenna technology for extended range.Offers Wi-Fi Protected Setup with just a button push.Is backwards compatible with older wireless networks.Connect your desktop or notebook to a network wirelessly at speeds up to 300 Mbps.View larger.Note: This Wireless-N adapter requires a Wireless-N Router, such as theBelkin N+ Router(sold separately).Compatible with 802.11n Draft 2.0 for Incredible PerformanceUsing the latest 802.11n Draft 2.0 technology, the N+ USB adapter will give you outstanding range thanks to the protocol's smart MIMO (multiple-input and multiple-output) technology. Offering speeds of up to 300 Mbps, Wireless-N will give even the heaviest of Internet users something to smile about as they stream video, make VoIP calls, and download large music files without a hiccup.Backwards Compatibility for Ultra ConvenienceThe N+ USB adapter is backwards compatible with all Wireless-G and 802.11b networks and devices, which means that by carrying this adapter with your notebook, you'll be able to get a wireless connection wherever there is a wireless network, regardless of the type. And if you already invested in existing wireless peripherals, you won't need to replace them.Elegant, Simple DesignThe adapter features a slim, sleek, glossy-black design and offers two connection options: you can either plug the adapter directly into your computer -- a useful option for travelers who want to travel light -- or you can use the included stand, which can help optimize your signal by letting you place it for the best reception. The adapter also features two integrated LEDs for \"wireless\" and \"security,\" letting you know your network status at a glance.One-Button SecurityWith Wi-Fi Protected Setup, connecting your computer to a secure network is just a button-push away. The adapter also supports WPA/WPA2 and 64-bit and 128-bit WEP encryption, so you can be certain you're protected from hackers and snoopers.What's in the BoxN+ Wireless USB Adapter with desktop stand, installation software CD, quick installation guide, user manual on CD-ROM.There's enough bandwidth for video and music streaming, gaming, and other network heavy applications.", "title": "Belkin F5D8055 Wireless N+300Mbps USB Adapter (Black)", "price": 24.99, "imUrl": "http://ecx.images-amazon.com/images/I/31Pcc77q5OL._SY300_.jpg", "related": {"also_viewed": ["B004N625BY", "B003B20F5E", "B000RMRU5Y", "B004N625BO", "B007ZLGXA8", "B0026IBI1O", "B002CI5WII", "B005X9Y0YU", "B00127OVHI", "B003G2Z1M6", "B003B41XYO", "B0002HA7FY", "B004N625B4", "B0036R9XRU", "B0054YQOM0", "B00HC01KMS", "B002UVNW5W", "B00J0N0Y18", "B006V72AE0", "B00A3VFIM6", "B0054YQO5C", "B002RM08RE", "B005SAKW9G", "B00JBJ6VG8", "B0010T8X54", "B008HO9D7M", "B004ZEZC0U", "B007ZWL1ZE", "B00CL58IJC", "B002VJL0OI", "B000R5LWRI", "B002SZEOLG", "B005HO1UHQ", "B00BVRQEKG", "B00416Q5KI", "B001498LIO", "B004VDR37K", "B000W8UIZW", "B006CQR7CK", "B0088TKTY2", "B0011E324K", "B004QS4OF4", "B001CEYYFK", "B006V72AHW", "B006JWMOOI", "B004N625BE", "B00DTZYHX4", "B00278E45K", "B00DJUU0KS", "B003MTTJOY", "B00E5PIPQ2", "B003CJTNL8", "B008IFXQFU", "B004RU8RM2", "B00BTWJAAE", "B00DZXAWBG", "B00BKFYJX8", "B000085BD8", "B000ZNYQEI"], "buy_after_viewing": ["B004N625BY", "B002RM08RE", "B00416Q5KI", "B000W8UIZW"]}, "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Network Adapters", "USB Network Adapters"]]}