{"asin": "B002I0EH6I", "description": "Dragon Quest IX: Sentinels of the Starry Skiesis an action RPG designed specifically for handheld play on the DSi. The ninth game in the beloved JapaneseDragon Questseries, like its predecessorsSentinels of the Starry Skiesfeatures third-person oriented turn-based battles and a deep combo/multiplier system. In addition to this the game possess powerful new features including multiplayer and online functionality, extensive customization options, new play modes and a means to share content with other players.caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Turn-based, combo-driven combat.View larger.4-player multi-card game support.View larger.Extensive customization options.View larger.Dramatic, yet seamless cutscenes.View larger.An Epic Adventure that Everyone Can JoinDragon Quest IX: Sentinels of the Starry Skieslets players enjoy an adventure that is entirely their own, yet can be shared with others anywhere, anytime. Players begin their adventure as an angel-like guardian. In order to achieve a heavenly design players are sent to the world of mortals to retrieve the magical fruits of a sacred tree. These fruit have the power to grant wishes, but are also perilous, containing the unexpected power to transform those who eat of them into monsters. Together with up to three friends players must battle those transformed beings, and in the process improve their angelic skills and regain the heavenly fruit in order to gain their heavenly reward.CustomizationPlayers can create their own heroes, deciding how they would like their face, hair and clothing to look. As the story unfolds, players become stronger, smarter and more powerful, and can create custom companions to join their group as well. Players will also have fun discovering more than 900 pieces of clothing, armor, weapons and other items that will provide them with a unique appearance and special abilities. Even occupations can be customized and changed at any time. Players can take on one of a dozen different jobs with varying strengths, weaknesses, spells and skills.BattleFast-paced turn-based battles unfold as players decide what to do and then view cinematic action scenes. This format rewards careful thinking and strategy over quick reflexes. The more foes players defeat, the stronger their characters become. In the lead up to conflicts, talking with different characters will unfold the story and point players toward their next mission. All quests come with a reward, which might be anything from a rare item to a new, unlocked occupation.Tag ModeDragon Quest IX: Sentinels of the Starry Skiesincludes the interactive Tag Mode that allows players to keep the game active even while their Nintendo DS system is stored in their pocket, purse or backpack. When two players come within range of one another, Tag Mode enables them to wirelessly--and automatically--exchange character information, customized greetings and treasure maps. These treasure maps allow players to find otherwise inaccessible dungeons called grottoes featuring special boss monsters and even rare items.Social Play AspectsOne of the most enticing things aboutSentinels of the Starry Skiesare its many social aspects built into its gameplay. First, you need never be alone. Special multiplayer modes let players share their adventure with others, allowing up to four players to team up via a local wireless connection and experience the fun of tackling challenging monsters and dungeons cooperatively with their own characters. Players can even leave the game active in their backpacks, pockets or purses and still interact with other players via an interactive Tag Mode. In addition, information about players' characters can be wirelessly transmitted to others. Also the game contains treasure maps that allow players to find otherwise inaccessible special dungeons called grottoes, which can contain rare items or enemies. In Tag mode, treasure maps and customized greetings can be exchanged automatically by players who come within range of one another. Finally, players with wireless broadband Internet access can visit an online shop to find new items or download additional quests. The selection of items changes daily. Some downloadable quests will continue the main storyline of the game, while others offer standalone missions or quests themed to a particular time of year.Key Game FeaturesHandheld action RPG action where players engage in epic quests in undiscovered lands filled with dangerous monsters and untold storiesConnect locally with up to three friends in cooperative gameplay modesCustomization allowing you to create your own hero, either male or female, changing your hair, face, body style and equipping them from a selection of over 1,000 in-game items including weapons, shields, armor and accessoriesWireless features that allow access to changing exclusive items and questsIn-game treasure maps that reveal otherwise inaccessible special dungeons called grottoes, which can contain rare items or enemiesGameplay with differing stories and missions depending on NPCs encountered", "price": 34.99, "imUrl": "http://ecx.images-amazon.com/images/I/612UgIt7FLL._SX300_.jpg", "related": {"also_bought": ["B002I0GKIQ", "B001TOMR6Q", "B001NJMMHG", "B001AF1NVY", "B004CVWETI", "B00184219U", "B0050SVP4W", "B001E27DLM", "B000GABOTU", "B00136MBHA", "0744012384", "B001H8Y7DA", "B00GV4V8XC", "B001A01FD0", "B001CU4EJ0", "B003FBL86Q", "B0009Z3K9E", "B000SSQPU8", "B000GIXIPK", "B00KVRK39A", "B00171NYHM", "B002I08WVY", "B003S55EX2", "B003O6E7DI", "B000SSNCYU", "B003UI518A", "B002DC8GWW", "B00AKIPBNS", "B000B69E96", "B0009A4EV2", "B0010YOQIM", "B0054J1LBO", "B00KWIYPZG", "B002AU0HZQ", "B002EWD02C", "B002EE7OKE", "B00GANWVJE", "B0012NWBH4", "B00KWFCU4M", "B000GA8UAQ", "B003UI518U", "B002I09286", "B003IOGPAO", "B002TDIEDG", "B00DZIX39E", "B000FRV2UK", "B005C2QSDY", "B001P1ZE68", "B001NJRR7G", "B002DY9KKM", "B001TOQ8WU", "B009B1D7JK", "B000WMEEC6", "B003O8EDUS", "B00BAWXD88", "B001TOQ8UW", "B001TD6SK8", "B0050SVOXE", "B004K6LQAS", "B003YVK5T8", "B000Q6J51S", "B00K848IH0", "B001G9F9JQ", "B000JLL3UQ", "B001O1PAMC", "B00KWFY04A", "B003O6E800", "B000HE9LL8", "B000FW64OY", "B00KI2OZ9M", "B007RUY1NS", "B00KWEHBAG", "B000IOM45C", "B0009XEC02", "B007CSF3GO", "B001V135P4", "B001HB7K6I", "B009LEIUY4", "B00I5LMSE2", "B000FW4OHS", "B002EE5RKI", "B0050SVOHA", "B001FS8BDE", "B000U5W3IW", "B0006TO2HM", "B000R39IKI", "B001C58T5U", "B000NVKZ06", "B0050SVNP8", "B0053BCMAC", "B000035XQ6", "B002I094AC", "B0033BJSDI"], "bought_together": ["B001TOMR6Q"], "buy_after_viewing": ["B001TOMR6Q", "B001E27DLM", "B004CVWETI", "B003O6E800"]}, "salesRank": {"Video Games": 1335}, "categories": [["Video Games", "Kids & Family", "Nintendo DS", "Games"], ["Video Games", "Nintendo DS", "Games"]]}