{"asin": "B002I529AY", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]], "description": "Portable and plenty loud, the iK501 cranks your iPod/iPhone sound through a square-shaped reflex subwoofer and a pair of five-inch woofers and silk-dome tweeters. It's all powered by a powerful internal amplifier with digital signal processing for one of the richest, best-sounding docking systems available.More of a rocking station than a docking station.Click to enlarge.A six-inch square subwoofer carries the low-end.Full-featured card remote included.Kicker SubwooferPatent-pending, 6-inch square reflex subwoofer delivers a dynamic bass response with the kind of intensity you've come to expect from KICKER.Full-Range Sound5-inch woofers and 3/4-inch tweeters fill your room with premium full-range sound quality.Wireless RemoteDig deeper into DSP with the thin infrared remote, fully featured to fine-tune the iPod or iPhone's music and video content. It helps to navigate with ease through the iK501 system menu, adjusting bass, treble, and aux-in options, as well as through the iPod or iPhone's menus and sub-menus. Skip forward and back, fast-forward and back, play and pause, volume, mute, and power on/off selections have their own buttons too.Rotary Control KnobThe rotary knob manually serves as the power and selection push button, and controller for bass, treble, auxiliary-input options, or standby mode. Standby will continue to charge the iPod or iPhone even when the system is powered down. In the dark, the knob is back-lit in blue and the display LCD screen continues to steer the user easily through the menu.Auxiliary InputThe 1/8-inch auxiliary stereo input allows you to connect additional media sources for richer, louder sound. Hook up MP3 or CD players, desktop and laptop computers, satellite radio, or anything else you want to amplify.RCA OutputsRCA stereo outputs allow for even more audio hookup, and a composite video output allows you to pass video from your iPod to a TV or monitor.iPod/iPhone DockThe dock works with all iPod models, including the iPod touch and any featuring a click wheel. It is also \"Works with iPhone\" certified.Carry HandleThe convenient carry handle maximizes portability.What's in the BoxiK501, Two-Foot Auxiliary Cable, AC Power Cord, Power Supply, User's Manual", "title": "Kicker iK501 Digital Stereo System for iPhone and iPod (Black)", "price": 109.98, "imUrl": "http://ecx.images-amazon.com/images/I/41pHJ82MMpL._SX300_.jpg", "brand": "Kicker", "related": {"also_bought": ["B004BJLXAM", "B009C7HGE0", "B00FHDZ3GG", "B001AM4512", "B002E9HHZQ", "1901983994", "1591587549", "1591585716", "1591583586", "B005TZHLYO", "B000GI0SZS", "1895525101", "B000BR67JA", "0963800116", "B000RKIRXU", "B0034PH2D6", "B0040UBU3W", "B004Q9VI7K", "B00ASVCY46"], "bought_together": ["B009C7HGE0", "B009A5EIWC"], "buy_after_viewing": ["B00FHDZ3GG", "B00GOZ9GTG", "B00C5RQ8WK", "B003VANOI6"]}}