{"asin": "B0014ULQB2", "description": "Set 50 years after the climactic events of the originalRed Faction,Red Faction: Guerrillais a third-person shooter that allows players to take the role of an insurgent fighter with the newly reestablished Red Faction guerilla movement on Mars as they battle for liberation from the oppressive Earth Defense Force.Red Faction: Guerrillaredefines the limits of destruction-based gameplay with a huge open-world, fast-paced guerilla-style combat, 16-player online multiplayer and true physics-based destruction..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Do maximum tactical damage.View larger.Utilize hit &amp; run guerilla tactics.View larger.Weapons high-tech and low.View larger.Land and air vehicles.View larger.The StoryIn the year 2075, the Earth Defense Force (EDF) received a distress signal from a small mining facility on the surface of Mars. A group of rebels calling themselves the Red Faction had overthrown the ruthless Ultor Corporation after years of oppression. The EDF responded by launching a fleet of warships to Mars to aid the miners, bring Ultor to justice and restore order to the Martian colonies. In order to ensure safety and security for the newly liberated colonists, the EDF set up command posts and bases across the planet. Initially, under the EDF's rule, the people of Mars prospered: colonists established homesteads, built towns and independent mining operations and began to stake and work their mining claims. But the more things change on Mars, the more they stay the same.The troubles began with colonists being driven from their homes and mining claims by greedy, Earth-based corporations. Then came a 50 year turn of events that saw the EDF adopting the heavy-handed tactics that it once stood against. Yet in doing so it also instilled a deep-seated resentment among the miners and settlers of the Martian colonies. One of these new Martians is miner Alec Mason, whose dream of a new life carved out of the course Martian soil was crushed in the face of EDF-ordered curfews, detention centers, beatings, mass arrests and personal tragedy. But as powerful as the EDF is, there is resistance. Mason and a small group of revolutionaries have banded together, taken up the Red Faction name and pledged to again bring about a free Mars. And though their enemy has changed, their battle cry remains unchanged: \"Better Red than Dead.\"Key Game Features:Join the Revolution- When the citizens of Mars can no longer bear the injustice of an oppressive regime, the fate of the planet lies in the hands of Alex Mason and the Red Faction.Open World Guerilla Warfare- You decide who, when, where and how to battle. Utilize guerilla tactics, improvised weaponry, and modified vehicles to lead insurgent attacks on EDF targets. Launch attacks based on your own gameplay style, take on missions in any order you choose, or engage in destructive activities to weaken the EDF&rsquo;s grip on Mars.Geo-Mod Technology 2.0- Use destruction to your tactical advantage, setting ambushes or chain reaction explosions to attack enemy strongholds and permanently modify the game environment. Leverage fully-dynamic physics-based destruction to improvise on the fly: blow holes in a wall or floor to set an ambush or escape, take out a staircase to stop your pursuers, or drive vehicles through blown out walls.Evolving &amp; Emergent Gameplay- Carve your path through an ever changing landscape as you improvise your combat tactics &ndash; mixing gameplay styles, vehicles, weapons and explosives to defeat the EDF.Epic Sci-fi Setting- Explore the huge, unforgiving Martian landscape, from the desolate mining outpost of Parker to the gleaming EDF capital city of Eos; then tear through the fully destructible open-world environments swarming with EDF forces, Red Faction resistance fighters, and the downtrodden settlers caught in the crossfire.Multiplayer Combat- There is no place to hide when you put your guerilla warfare skills to the test in a variety of highly destructive 2-16 person online multiplayer combat modes.Xbox LIVE Support- Build your Xbox 360 gamer score, achievements collection and leaderboard placement through full Xbox LIVE support.Guerilla WarfareYou don't stand a chance against the EDF using standard military tactics. The only recourse when the few stand against the many is the use of hit and run tactics. Learn the routes of the patrols and quickest ways in and out of EDF strongholds. By studying these things you can instinctively know when to attack, and when to wait for a better opportunity.Ambushes are also useful in thinning EDF ranks. Remote charges and proximity mines are your best friend when preparing an ambush. A few well-placed charges on the structural supports of a bridge can do wonders for stopping a convoy dead in its tracks. Above all else, remember this: guerilla tactics are not about fighting fair, they are about winning.", "price": 82.98, "imUrl": "http://ecx.images-amazon.com/images/I/51SBio-uAnL._SY300_.jpg", "related": {"also_bought": ["B000QCU9I0", "B001L18RIE", "B00319DX4W", "B001D25M1Q", "B000KLNLV4", "B000G75AXY", "B004FUL9YW", "B000WSE2WM", "B00KQ2YBU2", "B0016NRS28", "B000X25GX6", "B000R0RHA4", "B002I0HAC6", "B002DC8GEK", "B000A0EFJW", "B000O5DS32", "B000OCXK6A", "B000F3AADE", "B000R0URCE", "B002DC8GKE", "B000LXIO6I", "B000O5FUQ0", "B00KSN7OGC", "B0037LTTRO", "B0023CBY4E"], "bought_together": ["B000QCU9I0"], "buy_after_viewing": ["B000QCU9I0"]}, "salesRank": {"Video Games": 5618}, "categories": [["Video Games", "Xbox 360"]]}