{"asin": "B001DKBNMA", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Network Adapters", "USB Network Adapters"]], "description": "Offering the ultimate in simplified Wi-Fi installation, Medialink's 54Mbps Wireless G USB Adapter works with any manufacturer's 802.11B or 802.11G wi-fi router and offers a simplified one click installation. Insert the CD, click \"install software\" and the utility will auto-detect your operating system and install the appropriate drivers. Simply plug in your adapter and enjoy the convenience of your wifi network. Surprisingly, many wifi adapters on the market are not Microsoft WHQL certified to ensure trouble-free compatibility with Microsoft's operating systems. To provide our customers with ultimate confidence in our products, all Medialink adapters are Microsoft WHQL certified. In addition, this adapter features internationally recognized standards-based security features including WPA/WPA2, IEEE802.1X as well as 64/128/152-bit WEP for the ultimate in sucurity. MAC filtering is also available. With these enhanced security features, you can feel confident that you have state of the art wifi security options.. This USB adapter includes a Medialink Wireless Client Utility to auto-detect available wireless networks for quick connection. The utility also conveniently allows you to create and save detailed connectivity profiles for different accessed networks. The Medialink Wireless Client Utility also provides a number of tools to display current diagnostics and status information so that you can easily diagnose and resolve connection problems. Offering excellent wireless performance and network security, the Medialink 54Mbps Wireless G USB Adapter is an excellent choice for adding wireless connectivity to your desktop or notebook PC. CD includes drivers for Windows 2000, XP, Vista 32-Bit, Vista 64-Bit.", "title": "Medialink - Wireless G USB Adapter - 802.11g - 54Mbps - 2.4ghz - Windows 2000 / XP / Vista 32-Bit / Vista 64-Bit / Windows 7 Compatible", "price": 24.99, "imUrl": "http://ecx.images-amazon.com/images/I/412xdPQjIUL._SY300_.jpg", "brand": "Medialink", "related": {"also_viewed": ["B00A3VFIM6", "B002RM08RE", "B00EQT0YK2", "B0044YU60M", "B004UGPCMQ", "B00A3YN0Z0", "B00HA1CMEE", "B005P05E3S", "B009NKDQ2W", "B007N6TWF8", "B00JBJ6VG8", "B00B8ATBM4", "B0088TKTY2", "B004MODQOC", "B000W8UIZW", "B00DWHK40Y", "B002UVNW5W", "B004LTE5JI", "B00COOG2T8", "B004GF8TIK", "B00I52V9QO", "B001MZXUI6", "B00IJHI698", "B006NTN55E", "B007ZWL1ZE", "B007TV88F2", "B008IFXQFU", "B00DH101WQ", "B004LT2C5W", "B00DTZYHX4", "B002YLAUU8", "B00C6MNP52", "B00416Q5KI"], "buy_after_viewing": ["B00A3VFIM6", "B002RM08RE", "B008IFXQFU", "B00EQT0YK2"]}}