{"asin": "B002VX0GJY", "description": "SANOXY 802.11g/n USB WiFi Wireless Lan AdapterInterface USB 2.0Standards IEEE 802.11b/g/nData Transfer Rates 11/54/135/150MbpsChipset RealtekFrequency Band 2.4GHz ISM (Industrial Scientific Medical) BandAntenna Type on board AntennaWireless Range Indoor/Outdoor(100/300Meters)Transmit Power 17dbmFrequency Range 2.4 - 2.485GHzNetwork Configuration Ad-Hoc (Peer-to-Peer), InfrastructureDimensions 10mm L x 8mm W x 3mm HAt 5 times faster than traditional Wireless-G (802.11b) networks, Wireless-N networks allow for high speed data transfers, online gaming, and lightning fast downloads. The Wireless-N USB 2.0 Adapter gives you access to all the high-speed features of Wireless-N networks on older and newer computers. Its simple and easy setup means you'll be surfing the internet, downloading movies, and e-mail in no time.Supports Ad Hoc and Infrastructure modesSANOXY is trademarked brand. Exclusively marketed by authorized resellers on amazon to ensure product warrantySANOXY offers variety of consumer technology solutions such as cables & adapters, computer networking devices, and Touch Screen Smart Phone Accessories, Presentation and Stylus PensSANOXY brand has been awarded trademarks by the United States Patent and Trademark Office. SANOXY has a duty and a right to inform the market of our patent and trademark rights, and SANOXY does not hesitate to enforce its rights when necessary.", "title": "SANOXY 150Mbps Wireless 802.11 USB WiFi Adapter for Windows 2000, XP 32/64-bit, Vista 32/64-bit, Linux and MAC OS X", "price": 9.99, "imUrl": "http://ecx.images-amazon.com/images/I/416WLDm5SCL._SY300_.jpg", "related": {"also_bought": ["B003M6FDS8", "B000SEQGT2", "B003Y6UNI6", "B002OV1VJW", "B002FRFB5U", "B009LVVTSQ"], "bought_together": ["B003M6FDS8"], "buy_after_viewing": ["B008IFXQFU", "B003MTTJOY", "B00DTZYHX4", "B00416Q5KI"]}, "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Network Adapters", "USB Network Adapters"]]}