{"asin": "B0041G5XFQ", "description": "HD-enhanced Entertainment with NVIDIA Optimus TechnologyWith more HD content available now than ever before, you need a netbook that can keep up with the pace. The Eee PC 1215N has both the performance and mobility to meet the call. It features the new Intel Atom D525 dual-core processor, Next-Generation NVIDIA ION graphics, and a stunning 12.1-inch HD display to give you all the power needed for on-the-go HD enjoyment. And with NVIDIA Optimus Technology, the Eee PC 1215N intelligently switches between NVIDIA ION graphics and embedded graphics to optimize battery life without compromising performance. Add in the LED-backlit display and ASUS Super Hybrid Engine, you can stay unplugged up to 7 hours between charges.1Along with long-lasting mobility, it has a compact, scratch-resistant design that fits nicely in carrying cases and backpacks &ndash; ideal for both long trips or day-to-day errands.The Eee PC 1215N is also one of the select few with HDMI connectivity. So when you feel like super-sizing your HD movies, simply connect to an HDTV and enjoy Full 1080p HD visuals and up to 8 channel sound. What's more, you get a total of 750GB of hybrid storage &ndash; 500GB of ASUS WebStorage2and a spacious 250GB hard drive &ndash; to store, share, and back up your music, videos, and other valuable data. The Eee PC 1215N comes with full-size chiclet keyboard, stereo speakers, high-speed wireless N, 2GB of DDR2 memory, and Windows 7 Home Premium.Awards ReceivedEditor's Choice &ndash;Laptop Magazine9 out of 10 &ndash;Maximum PC92%, Must Have Best Features Award &ndash;Tweak Town4 out 5 editor's rating &ndash;PCMag.com4 out of 5 stars &ndash;CNET editor's ratingKey Features12.1-inch LED-backlit HD displayfor HD-quality visuals wherever, whenever (Learn more)Intel Atom D525 dual-core processorfor energy-efficient multitasking (Learn more)Next-Generation NVIDIA ION graphicsfor a premium mobile HD experience(Learn more)NVIDIA Optimus Technologyinstantly switches between powerful NVIDIA and energy-efficient Intel graphics to save battery life without compromising performance (Learn more)ASUS Super Hybrid Enginemaximizes battery life up to 7 hours between charges1(Learn more)HDMI connectivityfor streaming Full HD video and digital sound to HDTVs and compatible external displays (Learn more)High-speed wireless Nfor unplugged surfing (Learn more)750GB Hybrid Storage:250GB hard drive plus 500GB ASUS WebStorage2(Learn more)Learn MorePower with Enhanced Battery LifeView largerEquipped with the Intel Atom D525 dual-core processor, the Eee PC 1215N delivers more efficient power than its predecessor. Plus, the ASUS Super Hybrid Engine lets you instantly switch between power profiles that optimize the system for your task at hand.Now with NVIDIA Optimus Technology, the Eee PC 1215N intelligently switches between NVIDIA ION graphics and Intel embedded graphics to give you the most battery life without compromising performance.Immersive MultimediaView largerThe Eee PC 1215N boasts a 12.1-inch LED-backlit HD display, stereo speakers, and HDMI connectivity so you can enjoy movies, videos, and photos in amazing HD quality. With display resolution up to 1366 x 768, you'll experience crisp, true-to-life visuals while streaming content on-the-go. Plus, the LED-backlit screen saves energy for longer battery life and delivers brighter, better visuals than display without it. HDMI ready, the Eee PC 1215N connects easily to HDTVs and compatible external displays to stream 1080p HD video with 8-channel audio.With Next-Generation NVIDIA ION graphics, the Eee PC 1215N is your own personal mini-HD entertainment center &ndash; delivering full 1080p HD playback capability via HDMI. NVIDIA CUDA technology further boosts the Eee PC 1215N's visual content and casual gaming by accelerating graphic-intensive tasks such as light video editing and encoding.Comfort On-the-GoView largerThe Eee PC 1215N has more surface area for a wider, more comfortable palm rest. The ergonomic chiclet keyboard is full-size, with concave keys that direct your finger to the center of the surface.Weighing less than 3.5 lbs (with battery), the thin and light Eee PC 1215N is compact so you can use it on a plane or any tight space with room to spare. The multi-touch trackpad lets you easily zoom in and out to view photos or read documents simply by sliding two fingertips together or apart.Your Portable Internet CompanionView largerNot only does the Eee PC 1215N have a 250GB hard drive, it also comes with 500GB of complementary ASUS WebStorage, for a total of 750GB of storage capacity.2ASUS WebStorage makes it easy for users to share media with friends and family via a simple drag and drop online interface so you can back up data and access it anywhere online.Connect, communicate, and explore online with features that transform your wireless world. High-speed wireless N connectivity is six times faster than 802.11b/g, for snappy Web surfing between your favorite sites and quicker video streaming. The integrated webcam with lens cover and microphone lets you Skype face-to-face with friends, family, and colleagues in crisp, clear quality.Relax, ASUS Has You CoveredRanked as the#1 most reliable PC brandby 3 independent sources,3readers and editors alike choose ASUS as their trusted notebook and netbook. We tirelessly strive to exceed expectations of quality to ensure you an unmatched peace of mind every time you start your PC.We also back our commitment with the industry's most comprehensive warranty.1 Year ASUS Global Warranty4Offers a level of coverage that would add hundreds of dollars to the price of competing netbooks:1 year global warranty6 month battery warranty24/7 tech supportFree 1-way standard shippingWhat's in the BoxEee PC 1215NPower AdapterUser ManualWarranty CardSpecificationsOperating System:Windows 7 Home PremiumDisplay:12.1-inch LED-Backlit WXGA display (1366 x 768)CPU:Intel Atom D525 dual-core processor (1.8 GHz)GPU:Next-Generation NVIDIA ION graphics with NVIDIA Optimus TechnologyWireless Data Network:WLAN 802.11b/g/n (@ 2.4GHz)Memory:2GB DDR3, 1 x SODIMM slot (expandable to 4GB)Storage:250GB 5400RPm hard drive + 500GB ASUS WebStorage2Camera:0.3 megapixel &nbsp;with security lens coverAudio:Hi-definition stereo speakers, high-definition audio CODEC, MicrophoneStorage Cards:2-in-1 MMC, SD(SDHC) flash card slotInput / Output:1 x VGA port (D-sub 15-pin for external monitor), 1 x HDMI, 3 x USB 2.0 ports, 1 x LAN RJ-45, 2 x audio jacks (Headphone &amp; Mic-in)Battery Pack:6 cell battery (up to 7 hours2)Dimensions:11.54 (W) x 8.11 (D) x 1.06~ 1.30 (H) inchesWeight:3.22 lbsColor:Silver, BlackAll specifications and terms are subject to change without notice. Please check with your supplier for exact offers on selected models. Products may not be available in all markets. Product may not be exactly as shown in images.1Operation lifetime subject to product model, normal usage conditions and configurations. The estimated maximum battery life in Windows 7 is measured with MobileMark 2007 in reader mode.2Complimentary one-year 500GB ASUS WebStorage trial. Please visit www.asuswebstorage.com for more details.3Rated number 1 Windows-based PC maker in PCMag.com's Service &amp; Reliability Report 2009. Rate number 1 PC brand according to SquareTrade, the leading direct-to-consumer warranty company (for more information visit http://www.squaretrade.com/pages/laptop-reliability-1109/ ). Rated number 1 reliable PC maker in Spring 2009's RESCUECOM report http://www.rescuecom.com/RESCUECOM269.html4ASUS reserves the right to exclude certain SKUs; check with your retailer to confirm coverage of specific models. Valid for notebooks purchased in the US and Canada only. For complete details, please visit: usa.asus.com/event/ASUS360.Check Out Other Great ASUS ProductsASUS External Blu-ray Combo Drive (SBC-06D1S-U)Add an external Blu-ray combo drive to your 1215N and enjoy the latest in HD entertainment. This ultra-slim external combo drive is easy to carry and does not require any external power sources. (Powers off the USB ports on your PC)ASUS External DVD Writer (SDRW-08D2S-U)Add a stylish external DVD re/writer to your Eee PC 1215N. This ultra-slim, diamond-cut design external drive is easy to carry and does not require any external power sources. (Powers off the USB ports on your PC)ASUS WiCast Wireless Full HD Video Transmission KitTurn your PC into the ultimate wireless media center. Display Full HD on your big screen wirelessly with up to 30 ft of range via HDMI plug-and-play with the ASUS WiCast kit.ASUS MS238H LED-Backlit LCD MonitorEnjoy Full HD on a brilliant and bright LED-backlit 23-inch LCD monitor wrapped in a razor-slim design. Its HDMI input allows for simple Plug-and-Play with your 1215N and delivers visuals with sharpness never before seen.ASUS RT-N13U Wireless N Router (with USB)Upgrade your network to faster performance and broader range with this EZ to setup wireless N router. You can even share an all-in-one printer with the peers in your network.", "title": "ASUS Eee PC Seashell 1215N-PU17-BK 12.1-Inch Netbook with 6 Hours of Battery Life - Black", "price": 17.0, "imUrl": "http://ecx.images-amazon.com/images/I/41JJYM20sBL._SX300_.jpg", "related": {"also_viewed": ["B00BQH8QTI", "B00IVLHJ2M", "B00FFJ0HUE"], "buy_after_viewing": ["B004SQWY4W", "B007H5WXRY", "B004NVUCH8", "B004W3WB26"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories"]]}