{"asin": "B000EXS1BS", "description": "The Garmin n&uuml;vi 360 GPS Navigator and Personal Travel Assistant isa GPS navigator, personal translator, multi-media entertainer and tour guide all wrapped into one. In addition to all the advanced features of the Garmin n&uuml;vi 350 -- including automatic routing, turn-by-turn voice directions, an MP3 player and audio book player, JPEG picture viewer, and much more -- this pocket-sized personal travel assistant comes with hands-free Bluetooth wireless technology, making it the hands-down go-anywhere travel companion.Which n&uuml;vi is Best for You?:Click hereto see a quick, simple comparison of features for all Garmin nuvi GPS navigatorsThe n&uuml;vi 360 comes with hands-free bluetooth wireles technology.See side view.Browse your stored pictures with an easy-to-use JPEG viewer.The device sports a handy MP3 player, letting you play songs stored on SD memory cards.Make Hands-Free CallsThe n&uuml;vi 360 integrates wireless technology with a microphone and speaker that lets you make hands-free mobile phone calls using your compatible Bluetooth-enabled phone. Simply dial numbers with the n&uuml;vi's touch screen keypad to place a call, and to answer calls, just tap the screen and speak directly into its built-in microphone.In addition, you can easily look-up and dial numbers from your personalized phone book or from your phone's call history log. Don't know the phone number for your destination? Simply find and dial it from n&uuml;vi's database of more than six million points of interest -- including hotels, restaurants, stores, and attractions.Navigation and Entertainment with EaseFor starters, the n&uuml;vi 360 includes a high-sensitivity integrated GPS receiver that offers exceptional performance and reception. The unit's flip-up antenna includes an MCX-type connector for optional external GPS antenna connection. Preloaded software features maps of Europe or North America, and it includes automatic routing, 2D or 3D map perspective, turn-by-turn voice directions that speak street names, and a fingertip touch screen interface -- making navigation as easy as it gets.But navigation is just the beginning. Like the n&uuml;vi 350, the n&uuml;vi 360 also includes many entertainment and travel tools including an MP3 player, audio book player, JPEG picture viewer, travel alarm, and currency converters.The n&uuml;vi 360 features a bright, 2.8 x 2.1-inch TFT display with white backlight for easy readability. At 3.87 x 2.91 x 0.87-inches (WxHxD) and just 5.1 ounces, the unit is small enough to be placed on the dashboard with the included suction mount, or into your pocket for easy transportability. The unit also features Garmin Lock -- an advanced anti-theft feature that disables the unit from performing any functions until you type in a specific four-digit PIN or take the unit to a predetermined location. A built-in lithium ion battery will give you up to eight hours of power, and an included 12/24 volt adapter cable will let you run the navigator off your vehicle's power. An AC battery charger is also included.A built-in Travel Kit that includes sample MP3s and audio books will get you started with entertainment, and with the unit's SD memory card expansion slot you can add optional software, such as language and travel guides. A USB port is also included for loading and updating data.What's in the BoxGamin n&uuml;vi 360, Preloaded City Navigator NT North America or Europe (full coverage), vehicle suction cup mount, AC charger, 12/24 volt adapter cable, dashboard disk, USB interface cable, carrying case, owner's manual, and quick reference guide.Which n&uuml;vi is Best for You?Note: All n&uuml;vis come with detailed NAVTEQ maps containing more than 6 million pre-loaded point of interest locations.", "title": "Garmin n&uuml;vi 360 3.5-Inch Bluetooth Portable GPS Navigator with Text-To-Speech", "price": 79.99, "imUrl": "http://ecx.images-amazon.com/images/I/51ZB7D2RGSL._SX300_.jpg", "related": {"also_viewed": ["B00C9W1LT6", "B0015F1L7A", "B0011ULQNI", "B00BIZ0EY8", "B000OH63MI", "B002ACBNXO", "B00EE2CKWQ", "B001ELJ9P6", "B00GRS8NYO", "B00HK6CPVY", "B000NVZE5M", "B001U0O7RQ", "B0057ODOCA", "B00AD5EOAO", "B00DW14I66", "B001U0O7QC", "B00HLYAI4Q", "B0057ODG6Y", "B000PCBVA6", "B002Y3IAVC", "B00AY7NSTY", "B001ELJ9QK", "B0015EWMX8", "B00JB3P9K8", "B0007LJHVA", "B00AXZY42W", "B001U0O7QW", "B001U0O7T4", "B003WNOOFE", "B0057OCS9A", "B0057OCDQS"], "buy_after_viewing": ["B0057ODG6Y", "B0057ODOCA", "B0057OCDQS", "B002OL2MU4"]}, "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS"]]}