{"asin": "B003EYVP12", "description": "Experience premium high-definition TV with the SWV3474S/27 6-Foot High-Speed Swivel HDMI Cable. This uniquely designed cable features connectors that swivel 180 degrees in two directions for easy installation in hard-to-reach places. Additionally, the cable is constructed with quality materials, including 24-karat gold-plated connectors and a high-purity copper conductor for an optimized, reliable signal. And because it supports video resolutions of 4 x 1080p and beyond--as well as all 3-D formats--this high-speed HDMI cable will not only provide outstanding connections today, but it will also work dependably with the technologies of tomorrow.6-Foot High-SpeedSwivel HDMI CableRecommended For:Connecting HDTVs, DVD players, cable boxes, satellite boxes, and gaming consolesTechnical Specs:Connector Type: HDMI with swivel headLength: 6 feetConnector Plating: GoldJacket: PVCSupports 4 x 1080+ Resolutions and 3-D FormatsThis high-speed swivel HDMI cable from Philips supports video resolutions of 4 x 1080p and beyond, enabling your display to rival digital cinema systems used in movie theaters. In addition, it works with all 3-D formats, allowing for true 3-D home theater and gaming applications.Sends Data Upstream without Requiring a Separate ConnectionFor even greater versatility, this HDMI cable also features an Audio Return Channel (ARC), which allows an HDMI-connected TV to send audio data upstream to an A/V receiver or surround audio controller, increasing flexibility and eliminating the need for a separate S/PDIF connection.TVs have always been able to receive multi-channel audio through an HDMI cable, but in order to send content upstream from the TV back to an audio system, a separate connection has been needed. Audio Return Channel eliminates the need for this separate connection, because it allows your TV to both  send and receive audio via HDMI, upstream and downstream.Smart Swivel Design for Hard-to-Reach SpacesIdeal for small and hard-to-reach places, this HDMI cable has a clever swiveling design. Each connector pivots and twists 180 degrees to let you find the best angle for joining the cable to your device. Instead of forcing a standard cable to bend, which can result in a weak joint and bad connection, you can use the High-Speed Swivel HDMI Cable wherever you need it and still maintain your signal quality.Optimized Signal and Reliable Transfers for Premium Picture and SoundIntelligently designed and built with high-quality materials, the Philips 6-Foot High-Speed Swivel HDMI Cable delivers premium picture and sound quality. Pure 24-karat gold-plated connectors optimize the signal, and a high-purity copper conductor ensures reliable signal transfer. To protect against signal loss and EM/RF interference, the cable is constructed with copper-braid-reinforced aluminum shielding.Flexible PVC Jacket and Non-Slip Grip Simplify InstallationA flexible PVC jacket protects the cable's delicate core and also simplifies installation. Additionally, non-slip ergonomic ends make connecting your components a breeze.About Philips: Sense and SimplicityPhilips is committed to understanding and meeting the needs and desires of its customers. This is why Philips creates cutting-edge products that are user friendly. With 60,000 registered patents, Philips is a global leader in innovation, receiving numerous international design awards every year.What's in the Box6-foot high-speed swivel HDMI cable.", "title": "Philips SWV3474S/27 Swivel High Speed HDMI Cable (6 feet)", "price": 5.49, "imUrl": "http://ecx.images-amazon.com/images/I/31ofSjSBvXL._SX300_.jpg", "related": {"also_viewed": ["B003EYVOYU"], "buy_after_viewing": ["B004PW3DKS", "B002LJNKNM", "B004LU1U2M", "B0068M36PA"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Cables & Interconnects", "Video Cables", "HDMI Cables"]]}