{"asin": "B000JLP5UK", "related": {"also_bought": ["B0053EK6VQ", "B00073MP9O", "B0000996BA", "B000CSP000", "B000CSOXTO", "B0045DR7RM", "B0018BM0U8", "B0017JQCKK", "B003I86PJG", "B001QBJXH8", "B000MD40N8", "B003SWA8MW", "B00005B8M1", "B00134WZFU", "B000PDR27G", "B0055QEI8O", "B003I86PIM", "B000HCGAFK", "B001C79R3Q", "B00004VX39", "B00400CELE", "B000N3LL02", "B00505L21Q", "B0049U3ZYA", "B004QYM55O", "B000TFJGEW", "B000FBKN24", "B000SMVQK8", "B000VOU91U", "B001C0DJL4", "B00L2ON00U", "B00200K1TS", "B001BLV78Q", "B00LZ8IND2", "B000H3CKG2"], "bought_together": ["B00073MP9O"], "buy_after_viewing": ["B000HCGAFK", "B000PC62O6", "B009QZH7BU", "B0053EK6VQ"]}, "title": "SanDisk Micro Secure Digital 2 GB Memory Card (SDSDQ-2048-A10M) Retail Package", "price": 7.19, "salesRank": {"Cell Phones & Accessories": 79192}, "imUrl": "http://ecx.images-amazon.com/images/I/41jsHhVMXLL._SX300_.jpg", "brand": "SanDisk", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Memory Cards", "Micro SD Cards"]], "description": "From the ManufacturerSanDisk&reg; microSDHC&trade; 2GB Memory CardYour phone goes everywhere you do, so put it to good use. With a SanDisk&reg; microSDHC&trade; memory card, you can fit more on your phone and move it between devices with ease. Videos, tunes, pics, ring tones, games, data&#8212;it all fits, with room for more.So wake up your phone&trade; with:More tunes&#8212; up to 250 songs with you everywhere you goMore photos&#8212; over 1,200 shots of whatever you wantMore videos and movies&#8212; up to 3.5 hours worth&#8212;great for your next flight from Chicago to CharlotteMore games&#8212; enough games to keep your thumbs toned11 megabyte (MB) = 1 million bytes. 1 gigabyte (GB) = 1 billion bytes. Some of the listed capacity is used for formatting and other functions, and thus is not available for data storage.2Number of MP3s. Approximation based on 4-minute MP3 songs at 128 Kbps.3JPEG images. Approximation based on 5MP camera. Actual number of photos may vary based on phone model, resolution and compression.4Length in hours. Approximation for MPEG-4 video at 1.5Mbps. Actual time may vary based on resolution and compression.5Memory space for e-mail or games. Actual map data size varies by the country and region. Check with GPS Navigation map data provider for actual memory space required.&copy; 2009 SanDisk Corporation. All rights reserved. Other brand names mentioned herein are for identification purposes only and may be trademarks of their respective owners.Choose SanDisk, the minds behind flash memoryAs the pioneers of flash memory, SanDisk is known all over the planet. Wherever people take pictures, listen to music, use cell phones&#8212;or do much of anything at all with digital devices&#8212;they&#8217;re likely to be using a SanDisk memory card. That&#8217;s because, after 20 years in the business, SanDisk is still making some of the most trusted memory products anywhere."}