{"asin": "B00000DMB3", "description": "The Legend of Zelda: Ocarina of Timemay be the greatest single-player video game ever created in any genre. It's that good. Those new to Nintendo's enormously popularZeldaseries will be glad to know this game stands completely on its own. Our hero, Link, starts the game as a young boy living in a magical forest village populated by elf-like children. But there is evil lurking in the world. Strange monsters are appearing, and the land is changing. It's up to Link to discover why, defeat the monsters, and stop the evil at its source.The game world's ever-changing environment looks like a fairy tale come to life. Majestic waterfalls, towering castles, and magical forests are a feast for the eyes and ears. Rivers flow, rain falls, the sun and moon rise and set. There's even an erupting volcano! Exploring this world is half the fun of the game. Along the way, you learn musical tunes that you can play on the flute-like Ocarina, a magical device that helps you teleport, alter the weather, even control time itself.Character interaction is important to gather clues. The fairy princesses, singing frogs, and dragons you'll meet can be cute, humorous, or somewhat terrifying. Sprinkled liberally throughout the game are hundreds of secret treasures and enjoyable minigames (one of which, the fishing game, would almost be worth buying by itself). Game controls are easy to learn. There's even an elaborate fight training course built right into the game. Controlling the hero quickly becomes instinctive, and you can concentrate on saving the world. To win the game, you'll have to use not only Link's sword, but your mind as well. This game's challenging and inventive puzzles really make you think. In fact, to keep from getting stuck, it's worth spending a few bucks on anofficial player's guide. WithThe Legend of Zelda: Ocarina of Time, Nintendo has come up with an all-consuming adventure title that will provide days of engrossing gameplay.--Eric FredricksonPros:Best single-player video gameFreedom to explore a rich, complex worldHelpful fairy guide gives hintsCharming, humorous, lighthearted, yet challengingCons:Some puzzles can be frustratingOnly one saved game per player--don't save when you're stuck!Much more fun with Rumble Pack", "price": 39.99, "imUrl": "http://ecx.images-amazon.com/images/I/51manK99HfL._SX300_.jpg", "related": {"also_bought": ["B00000F1GM", "B00002DHEV", "B00004U1R1", "B00002STEZ", "B00000INR2", "B00000DMAX", "B00005M8TL", "B00000ID61", "B00000DMAQ", "B00000J2W7", "B005GTNBGK", "B000Y0CHX4", "B000PJHAD6", "B000YOCGUO", "B002TK1PX0", "B0015OG4G4", "B00004S9AA", "B000F9JFXE", "B00002STFH", "B00000IFRI", "B000JVM256", "B003UI5GLC", "B00003OTI3", "B005GTNC8W", "B005DI7N7W", "B00002STH0", "B00004R9IB", "B005GTND0E", "B00004S9A7", "B000031KJM", "B000058BCU", "B00005AW1W", "B00000J2OO", "B00004U1R3", "B000046Q7Q", "B000QHOHHE", "B00004R9I4", "B00002STXN", "B00004SWLT", "B00004U1QY", "B00001OX4T", "B00004SVXW", "B00000ID60", "B002TK5I6K", "B00003E4EB", "B00002STI2", "B00002STXG", "B0046CZX78", "B00004SVYE", "B000038A6U", "B00004ZCRS", "B000YT1VMS", "0761509208", "B00002STXQ", "B00856304Y", "B00000DMB9", "B00000K1AF", "B00004WLMA", "B007SJMEHI", "B00002SUZ5", "B00000K4E1", "B00000JHPD", "B0013KR3QA", "B002J44BXW", "B000021Y2Z", "B00001QES1", "B00000K2G9", "B000084318", "B00001ZWP8", "B00002STH5", "B000RJOAP0"], "buy_after_viewing": ["B003O6E800", "B00000F1GM", "B00002DHEV", "B002TK1PX0"]}, "salesRank": {"Video Games": 944}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "More Systems", "Nintendo 64", "Games"]]}