{"asin": "B001FPBZBC", "description": "The Xbox 360 Arcade System gives you immediate access to the Next-Gen power of high-definition video, DVD movie playback, digital music, photos, online connectivity and of course the great gameplay that Xbox 360 is renowned for, while ensuring that you retain the flexibility to choose additional features to customize your system to your specific needs.Xbox 360 Arcade bundle with included accessoriesUnder the Hood of Xbox 360Xbox 360 is much smaller than its predecessor--it measures approximately 3.3 by 12.2 by 10.2 inches and weighs 7.7 lbs. It's powered by custom IBM PowerPC-based CPU with three symmetrical cores each running at 3.2 GHz. It also carries a custom ATI graphics processor with 10 MB of embedded DRAM. This is powerful enough to draw 500 million triangles per second. In other words, it makes for great looking games on standard TVs, and even better looking ones on HDTV sets thanks to built-in support for HDTV (720p/1080i/1080p) resolutions.The unit has a 12x dual-layer DVD-ROM drive, which plays both the game media and progressive-scan DVD movies right out of the box. For game-save and media storage, Xbox 360 Arcade System users can choose to stick with the Memory Unit included with the bundle, or upgrade to either the detachable20GB hard driveor the120 GB hard drive(both sold separately). Along with storing files, the hard drive will make the Xbox 360 backward-compatible with a large part of the existing Xbox game library.Control your GameplayThe Xbox 360 Arcade System comes with oneXbox 360 Wireless Controllerwith rumble. Xbox 360 uses a refined button layout for its controllers. Back and Start buttons sit at the center of the controller and between them is a new Xbox Guide button, which instantly takes the user to the Xbox 360 user \"Dashboard\" interface. From there, they can check for friends online, access personal digital content like photos songs, and more. The black and white buttons of the first Xbox controllers have been replaced with new shoulder buttons placed above the left and right triggers. The Xbox 360 can accommodate up to four wireless controllers and has three USB 2.0 slots to use for wired controllers or for streaming your digital media from digital cameras, MP3 players, and any Windows XP-based PC. Microsoft has also created a video-conferencing camera, sold separately, that will work with the system.The Media ExperienceAll Xbox 360 titles can be played in either standard or high-definition resolution in 16:9 widescreen, with anti-aliasing for smoother graphics. Game designers will be able to take advantage of the system's multi-channel surround sound. The Xbox 360's digital media allows users to supplement any game's music from tracks in their own personal library. Five titles are bundled on a single disc included with the Xbox 360 Arcade System. These are:Feeding FrenzyLuxor 2Boom Boom RocketPac-Man Championship EditionUnoGo LIVEXbox 360's built-in Ethernet port allows users to connect their system to the Xbox LIVE service via their broadband connection. Utilize the free Xbox LIVE Silver Membership included with your console or upgrade to aGold Membershipto create a Gamertag and gamer card to express your online identity, chat live with voice chat (separately sold headset required), and connect to Xbox LIVE Marketplace to download free and premium expansions, maps, game demos, movies, TV shows and other digital content. The separately sold wireless network adapter supports the common 802.11a, -b, and -g standards.What's in the boxXbox 360 console (without hard drive)256 MB Memory UnitWireless controllerXbox LIVE Silver membershipStandard (Composite) AV cable5 Arcade LIVE titles (included on disc):Feeding Frenzy,Luxor 2,Boom Boom Rocket,Pac-Man Championship Edition,UnoSega Superstars TennisGame", "price": 261.95, "imUrl": "http://ecx.images-amazon.com/images/I/51mEtQedVmL._SX300_.jpg", "related": {"also_viewed": ["B001NCDAV0", "B000V761SM", "B00309S9YW", "B001F7AAFW", "B000PD0HQE", "B000U9XBUM", "B00GZ9ESEE", "B00EZFVPBE", "B009759F5A", "B00FATRKOK", "B0078J2HPM", "B003O6JKLC", "B00ACILQS0", "B00GIUCV12", "B0096KENEO", "B001E3VKC4", "B003O6JJKY", "B00IU3MSF4", "B005VBVRGY", "B00BBU8VFY", "B000RZXR0S", "B00D9EPI38", "B005YR1VP2", "B003O6JLZ2", "B006OV7O8U", "B00FATRKWM", "B0096KEMUY", "B0043KI082", "B00ABSVKOG", "B009VS8G80", "B0050SY300", "B002RTO6DO", "B003O6EE4U", "B00CSLIYU2", "B000B6MLUA"], "buy_after_viewing": ["B00FATRKOK", "B00BU3ZLJQ", "B003ZSP0WW", "B003O6JKLC"]}, "salesRank": {"Video Games": 24931}, "categories": [["Video Games", "Xbox 360", "Consoles"]]}