{"asin": "B0000TSRA6", "description": "The virus has spread online, and Resident Evil's gameplay has never been so infectious. Fighting for life with three human-controlled characters at your side definitely adds an element of unfamiliarity to the survival horror mix, but make no mistake, this is still Resident Evil. Whether you find yourself jumping out of your seat as a zombie crashes through a window, marveling at the action in the cutscenes, or complaining about the stiffness of control and awkwardly placed camera angles, this is just another trip to Raccoon City. Only this time, you're with friends.I really have to hand it to Capcom for making teamwork the cornerstone of gameplay. In every room that you reach, this game hammers home the message that you have to stick together and work as a group. When jumping from one rooftop to another, you may misjudge the distance and fall short. Thankfully, a teammate can pull you up.Even before the game commences, you'll find yourself coordinating tactics with your soon-to-be companions at the character selection screen. In a similar vein to an RPG, each of the eight playable characters that you can select brings completely different abilities to the table that you must factor in. Do you bring a lock-picker? Someone with extra inventory spots? Or rely on firepower with a weapons expert?Unlike the other games in the series, zombies can pass from room to room and are often found in packs. Taking this newfound hunting prowess into account, Capcom has implemented a handful of new techniques that players can use to survive. You can slide under beds, hide in lockers, and even repel a zombie attack by forcing their head away from your neck with enough breathing room to raise your pistol and shoot them directly between the eyes. You'll even find strategy in the reloading of weapons. For instance, a box of shells takes more time to load than a clip. As annoying as it is to watch your character get munched because he couldn't load the rounds quick enough, I really like this aspect. It makes you keep an eye on every little detail.Where Outbreak excels in engrossing multiplayer and creative gameplay, the overall design of the game is very odd. Rather than creating one lengthy quest that players can really sink their teeth into, Capcom opted to break up the game into five separate scenarios that are roughly 45 minutes each. If you die, you'll turn into a zombie for a brief extent (and yes, you can attack your teammates if you like), then will be dropped out of the game. Sadly, you can't re-spawn. You either have to wait for your friends to finish up, or find another game to enter. While scripted controller commands are offered, it doesn't support voice chat at all or keyboard functionality in-game. Someone's head should roll for this!All told, this is a surprisingly enjoyable online venture that showcases some amazing gameplay concepts, yet a lack of foresight in the delivery of multiplayer.Concept:A highly creative, yet slightly flawed approach to multiplayer survival horrorGraphics:Not as lavish as the recent GameCube releases, yet impressive nonethelessSound:Great ambiance, but it sure would be nice to communicate with other players. Where's the voice chat?!Playability:Familiar RE controls with innovative teammate techniques and newfound environment interactionEntertainment:Entertaining, yet lacking all the elements that would keep you hookedReplay:Moderately LowRated:7.5 out of 10Editor:Andrew ReinerIssue:May 20042nd Opinion:Why isn't there voice chat in Resident Evil: Outbreak? For the love of all that is holy, I want to give this game a good score for its thoughtful level design, nice graphics, intense gameplay, and smart mission structure&nbsp;&#8211; but that missing headset support throws the whole experience out of whack. These levels are fast-paced and frantic, almost like an FPS, and what you want is to make some sort of strategy. This just isn't possible with the canned commands available, as \"You two check out the locker room and we're going to search the owner's office. Meet back here and we'll go up to the 3rd floor,\" weirdly isn't mapped to the right analog stick. So, this game gets the backhanded compliment of being \"high concept\" like Crystal Chronicles and Steel Battalion, for example. My ideal setup is playing this game with four friends, four TVs, and four PS2s all in the same room. Get this setup, and the game is a real gem.Rated:8 out of 10Editor:Lisa MasonSubscribe to Game Informer--Game Informer Review", "price": 115.12, "imUrl": "http://ecx.images-amazon.com/images/I/51VHEJ8VN3L._SY300_.jpg", "related": {"also_bought": ["B0007L8GPI", "B00005ME6N", "B00009KO3N", "B000B69E9G", "B00000I1BY", "B00004WMVL", "B000034DMG", "B00006LELI", "B0019LMXAY", "B0011BE3KA", "B00000K1VA", "0744003458", "B0009351R0", "B0001Y7404", "B00008DHNL", "B00020LZAW", "B0000657SP", "B0033T1UWW", "B00005ME6O", "B001MW91IW", "B00000I1BJ", "B00007KQC5", "B00269DXR0", "0744004799", "B000G6SPHI", "B0000A09EM", "B00004YRQA", "B000P297F2", "B00007LV7Y", "B0007PLKZM", "B000TLU67W", "B00005NCCR", "B0009Z3HXI", "B0009EHQVI", "B00005BW7M", "B000XPJ026", "B0001NBNGG", "B0001ADAME", "B00000K1VE", "B0020H46D8", "B00019AZBO", "B0002RQ3ES", "B0002XL3BA", "B001CLG6SG", "B000GPVUQ2", "B001UIG6M2", "B00001XDUB", "B000NIJ35W", "B00097CYZS", "B00007KQC4", "B004UDB9SA", "9629971372", "B000YYR3D4", "B000TYQL1O", "B0009R1TGS", "B0009SQF0C", "B0002B90OE", "B00269DXXO", "B000069D39", "B00004YRQ9", "B00005V9NH", "B0000A8VBZ", "B000CBCVFE", "B002CZ7FW2", "B000038ABO", "B00069FK00", "B00000K10U", "B002Z7BE24", "B0001VGFK2", "0671785117", "B00B59L9T6", "B00005ML10", "B0000A92KX", "B00005TNI6", "B000069BD9", "B0009O7HVM", "B0013KW1B2", "B0009Z3HYW", "B000930DLO", "B00001X50M", "B0000C7GHG", "B0009I6S0O", "B0000664JF", "B00004XOM1", "B0000696CZ", "B0007SL1ZI", "B000099T2H", "B0001A86EG", "B000F5IH2I", "0671024418", "B004S3KB6S", "B00005ML0X", "B000CQ75VY", "B000E49SGE", "B000095ZH6", "B0045L3SNQ", "B000FIVC2W", "B0000B0MNH", "B0009VQANG"], "bought_together": ["B0007L8GPI", "B00005ME6N"], "buy_after_viewing": ["B000B69E9G", "B00005ME6N", "B0007L8GPI", "9629971372"]}, "salesRank": {"Video Games": 5617}, "categories": [["Video Games", "More Systems", "PlayStation 2", "Games"]]}