{"asin": "B001E96JBK", "description": "The Belkin Mini Bluetooth Laptop Adapter (F8T016) simply plugs into an open USB port on your computer to deliver full access to Bluetooth wireless technology. With the push of a button, it pairs your mouse and keyboard to your computer and communicates with Bluetooth-enabled devices including headsets, printers, and phones, freeing up USB ports for other devices, and freeing you from the hassle of corded connections.Mini Bluetooth Laptop AdapterAt a Glance:Compact design stays plugged into your laptopBluetooth v2.1 + EDR for easier synchronization, reduced power consumption, and improved securityData transfer rates up to 3Mbps30-foot rangeBacked by a lifetime warrantyConnect a wide variety of Bluetooth-enabled electronic devices to your laptop wirelessly.View larger.The micro design stays plugged into your laptop.Compatible with a Wide Variety of Bluetooth-Enabled DevicesIdeal for travel or for simplifying your home-office setup, the Belkin Mini Bluetooth Laptop Adapter lets you connect a wide variety of Bluetooth-enabled electronic devices to your laptop wirelessly, eliminating plugging and unplugging and traveling with a space-consuming tangle of cords.After plugging the Mini Bluetooth Adapter into your computer and setting it up, you'll find that it is compatible with almost any Bluetooth-enabled device, delivering connections at speeds of up to 3Mbps. This makes synchronizing data on your computer and phone, transferring files between computers, sending files to printers or fax machines, and synching with your headset for internet calls both wireless and hassle-free.Optimal Connectivity with Bluetooth v2.1 + EDR TechnologyThe Mini Bluetooth Adapter uses Bluetooth v2.1 + EDR technology to provide optimal performance. This protocol offers easier synchronization for faster setups, along with reduced power consumption for longer battery life in devices like laptop mice and headsets. And you also get improved security when compared with earlier Bluetooth technologies and alternate wireless protocols.Lets You Connect More DevicesOne of the biggest benefits of Bluetooth technology is the ability to connect several devices to a single open port on your laptop. With the Mini Bluetooth Adapter, one open USB port is enough to connect several essential Bluetooth-enabled devices, so no bulky Hub is required.Slim, Smart Design Delivers a 30-Foot RangeThe Mini Bluetooth Adapter's low-profile design is unobtrusive, and allows you to keep it connected to your laptop for quick and easy Bluetooth connections anytime, anywhere. For added convenience, the adapter works at a range of up to 30 feet, so you needn't worry about moving around or missing out on local signals.System Requirements and Warranty InformationThe Mini Bluetooth Adapter works with a broad range of systems. For PC Users, it supports use with Windows 98, 2000, ME, XP, or Vista. For Mac Users, it supports OS 9 to OS 10.The Belkin Mini Bluetooth Laptop Adapter is backed by a lifetime warranty.What's in the BoxMini Bluetooth Laptop Adapter (class 2) and installation CD-ROM.Belkin Bluetooth AdapterF8T016Bluetooth 2.1YesPC CompatibilityOne available USB port and running Windows 98, 2000, Me, XP, or VistaMac CompatibilityOne available USB port and running Mac OS X v10.2 or higher", "title": "Belkin F8T016 Mini Bluetooth Laptop Adapter", "price": 12.99, "imUrl": "http://ecx.images-amazon.com/images/I/41t7jHCStRL._SY300_.jpg", "related": {"also_viewed": ["B007Q45EF4", "B005Z5HT2M", "B007GFX0PY", "B00AY1K50U", "B007MKMJGO", "B0002K6RK0", "B00I02DG9M", "B00F25Z0FS", "B009ZIILLI", "B00B2HVAT0", "B001EBE1LI", "B00DJ83070", "B00EW3WS9M", "B002SBF108", "B003VX3S3Y", "B003765X38", "B00H8O8CMO", "B000N1ONKO", "B008BC1U4O", "B0041UJVI2", "B00DDH4TYA", "B000YA1XU2", "B00GMFYM8I", "B002AQSTXM", "B00IN2S018", "B00H0DNUB6", "B004LNXO28", "B006ZZKPY0", "B007ZT2AXE", "B00EOTR9P2", "B0089OJHBW", "B003KU4DOG", "B000E7UN5G", "B003ULJU2A", "B00006HYM3", "B001D8CCYK", "B0093HNIBO", "B003VWU79I", "B009HN63QQ", "B005TWE6B8", "B00AKO7XOW", "B00EW3WQ9E", "B000H9XDCG", "B008YFD5G4", "B007GMPZ0A", "B0047T79VS", "B005DLDO4U", "B0048U3FMS", "B003XIJ3MW", "B003MTTJOY", "B00ANDHBNS", "B002TPFNXS", "B009WNR13U", "B00762YNMG"], "buy_after_viewing": ["B007Q45EF4", "B005Z5HT2M", "B007GFX0PY", "B004LNXO28"]}, "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Network Adapters", "USB Network Adapters"]]}