{"asin": "B0039RNGNY", "categories": [["Electronics", "Television & Video", "Televisions", "LCD TVs"]], "description": "A great way to get into high-definition entertainment, the affordable 32-inch LG 32LD350 LCD HDTV offers a 720p HD resolution, multiple AV Modes to optimize the picture depending on what you're watching (Cinema, Sports, or Games), and a 50,000:1 contrast ratio for excellent rendering of colors and deep blacks. Other features include a 4ms (millisecond) response time, stereo speakers with 14 watts of power and Dolby Digital decoding, and three HDMI inputs.Key Features50,000:1 Dynamic Contrast RatioNo more worrying about dark scenes or dull colors. The dynamic contrast ratio of 50,000:1 delivers more stunning colors and deeper blacks than you can imagine.Picture WizardGet easy self-calibration with on-screen reference points for key picture quality elements such as black level, color, tint, sharpness and backlight levels. Take the guesswork out of picture adjustments with this simple-to-use feature. It's not actually magic, but it will sure seem that way.AV ModeSports, movies and video games are best enjoyed with customized settings. With AV Mode, you can easily select from one of three picture modes for \"Cinema\", Sports\" or \"Games\" to enjoy an optimized picture and sound experience.24P Real CinemaStay in for the theater. Enjoy a true cinema-like experience in your own home with movies the way they are meant to be seen. LG's Real Cinema technology precisely displays 24p source frames on your screen, the same as on a movie screen. If you love movies, you'll love Real Cinema.Clear Voice IIGet audio the way it was meant to be heard. Clear Voice II enhances and amplifies the frequency range of the human voice to help keep dialogue audible when background noise swells.Infinite SoundWhat's a great picture without great sounds to match? Infinite Sound delivers an amazing listening experience with deep, rich bass to make the most of your entertainment.Dolby DigitalDolby Digital lets you experience compelling 5.1-channel surround sound. And you can trust that you'll get the same great Dolby Digital audio quality no matter what you're watching--a DVD or Blu-Ray Disc, TV programming or downloaded content. Best of all, you can be confident that you'll hear the audio exactly as it was intended, because Dolby Digital is also used to create the soundtracks for movies and games.ISFccc Calibration ReadyLG's ISFccc Ready HDTVs contain the detailed standards necessary for professional calibration of brightness, contrast, tint, sharpness, color levels and much more to meet local lighting conditions for both day and nighttime viewing. Settings are added to preset modes for easy access from your LG remote.HDMI V.1.3 with Deep ColorMake installation of any enabled device a snap. Get 10.2Gbps of bandwidth for deeper colors and more to take advantage of the best Full HD experience. HDMI V.1.3 connectivity lets you prepare yourself for tomorrow's technology today.SimpLinkHaving a hard time keeping track of your remotes? With SimpLink, all your LG devices can be controlled with just one remote.Smart Energy SavingWith LG's Smart Energy Saving Features, you can conserve money and energy.Key SpecificationsScreen size:32-inch class (31.5 inches diagonal)Resolution:1366 x 768 (720p HD)Dynamic contrast ratio:50,000:1Viewing angle:178 degrees horizontal/verticalResponse time:4msBuilt-in tuner:ATSC/NTSC/Clear QAMAudio output:14 watts (7W x 2)Speaker system:1-way, 2 speakersDolby Digital decoder:YesSurround system:Infinite SoundInput labeling:YesSwivel stand:&plusmn;20 degreesVESA compliance:200mm x 100mmWarranty:1 year parts and laborConnectionsHDMI (version 1.3, HDCP):1 rear, 1 sideComponent:1 rearComposite A/V:1 rearRF:1 rearPC input (15-pin, D-Sub):1 rearPC audio input:1 rearDigital audio output:1 optical, rearUSB:1 side (service only)Headphone out:1 sideRS-232c input:1 rearDimensionsTV without stand: 31.5 x 20 x 2.9 inches (WxHxD); 18.1 poundsTV with stand: 31.5 x 22.2 x 8.1 inches (WxHxD); 20.3 poundsWhat size TV should you get?LG 2010 HDTV ComparisonHEADING row - SeriesSeries:LD350LD450LD520LD550LD650LE5300LE5400LE8500LX6500PJ350PK550PK750HEADING row - ModelsModels:22-inch26-inch32-inch32-inch37-inch42-inch47-inch32-inch42-inch47-inch55-inch32-inch42-inch46-inch52-inch47-inch55-inch22-inch26-inch32-inch37-inch32-inch42-inch47-inch55-inch47-inch55-inch47-inch55-inch42-inch50-inch50-inch60-inch50-inch60-inchspec row PanelSPECPanel typeLD350LCDLD450LCDLD520LCDLD550LCDLD650LCDLE5300LED LCDLE5400LED LCDLE8500LED LCDLX65003D LEDPJ350PlasmaPK550PlasmaPK750Plasmaspec row 3DSPECLED Local DimmingLD350--LD450--LD520--LD550--LD650--LE5300--LE5400--LE8500LX6500PJ350--PK550--PK750--spec row 3DSPEC3D ReadyLD350--LD450--LD520--LD550--LD650--LE5300--LE5400--LE8500--LX6500PJ350--PK550--PK750--spec row ResolutionSPECResolutionLD350720pLD4501080pLD5201080pLD5501080pLD6501080pLE53001080pLE54001080pLE85001080pLX65001080pPJ350720pPK5501080pPK7501080pspec row ContrastSPECContrast ratioLD35050k:1dynamicLD450100k:1dynamicLD520100k:1dynamicLD550150k:1dynamicLD650200k:1dynamicLE53003mil:1dynamicLE54004mil:1dynamicLE85009mil:1dynamicLX65008mil:1dynamicPJ3503mil:1dynamicPK5503mil:1dynamicPK7503mil:1dynamicspec row ResponseSPECRefresh rateLD35060HzLD45060HzLD520120HzLD550120HzLD650240HzLE530060HzLE5400120HzLE8500120HzLX6500240HzPJ350600HzPK550600HzPK750600Hzspec row RefreshSPECResponse timeLD3505msLD4504msLD5202.4LD5502.4LD6502LE53002.4msLE54002.6msLE85001msLX65002msPJ350--PK550--PK750--spec row NetcastSPECNetcast EntertainmentLD350--LD450--LD520--LD550LD650LE5300--LE5400LE8500LX6500PJ350--PK550--PK750spec row HDMISPECHDMI inputLD3502LD4502LD5203LD5504LD6504LE53004LE54004LE85004LX65004PJ3503PK5503PK7504spec row ComponentSPECComponent input(Y, PB, PR)LD3501LD4501LD5201LD5502LD6502LE53002LE54003LE85003LX65003PJ3502PK5502PK7502spec row CompositeSPECComposite inputLD3501LD4502LD5202LD5502LD6502LE53002LE54002LE85002LX65002PJ3502PK5502PK7502spec row PCSPECPC inputLD350LD450LD520LD550LD650LE5300LE5400LE8500LX6500PJ350PK550PK750spec row USB portSPECUSB portLD3501LD4501LD5201LD5502LD6502LE53001LE54002LE85002LX65002PJ3501PK5501PK7502spec row MPEG/JPEGSPECMP3 and JPEGplaybackLD350--LD450LD520LD550LD650LE5300LE5400LE8500LX6500PJ350PK550PK750spec rowSPECDivX videoplaybackLD350--LD450--LD520--LD550LD650LE5300LE5400LE8500LX6500PJ350--PK550--PK750spec row EthernetSPECEthernetLD350--LD450--LD520--LD550LD650LE5300--LE5400LE8500LX6500PJ350--PK550--PK750spec row WirelessSPECWireless 1080p ReadyLD350--LD450--LD520--LD550LD650LE5300--LE5400LE8500LX6500PJ350--PK550--PK750spec row Energy StarSPECEnergy StarLD350--LD450--LD520--LD550--LD650--LE5300LE5400LE8500LX6500PJ350--PK550--PK750--Series:LD350 LCDLD450 LCDLD520 LCDLD550 LCDLD650 LCDLE5300 LEDLE5400 LEDLE8500 LEDLX65003D LEDPJ350 PlasmaPK550 PlasmaPK750 PlasmaLearn MoreCOMMENT: ==========================================Which Size HDTV is Right for My Room?With standard-definition TVs, the rule used to be that viewers would feel comfortable watching a set from a distance of 3 to 6 times the screen size in inches. With HDTV, the resolution is so much better that you can sit closer to a larger TV without noticing the pixels. So with HDTVs, the rule tends to be you can sit anywhere from 1.5 to 3 times the screen size (in inches) for the best experience.If you know the size of the room you have already, where you want to sit, and where your new HDTV should go once you get it, you can figure out the size HDTV you should get.Minimum size = Viewing distance/3Maximum size=Viewing distance/1.5", "title": "LG 32LD350 32-Inch 1080i/720p 60 Hz LCD HDTV (2010 Model)", "price": 247.99, "salesRank": {"Electronics": 30293}, "imUrl": "http://ecx.images-amazon.com/images/I/41Rc%2BU%2BapUL._SY300_.jpg", "related": {"also_viewed": ["B00BB0ZTMM", "B00BB0ZTM2", "B0074WVSL2", "B004VRJ3EW", "B006ZH0J30", "B00JG3VJ9I", "B0078LSTWU", "B0071O4ETQ", "B00I0S72JQ", "B00BB0ZTJA", "B005JK00XS", "B0037KLELE", "B007PXV310", "B00723QKVQ", "B004EBUZPQ", "B00IGXEAQI", "B00F9YYOR2", "B00BCGRXD8", "B00KVLEM7K", "B00BCGRX9M", "B00BB0ZTO0", "B00BXF7JAA", "B00IZBQ460", "B00IL7C8O0", "B0071O4EZK", "B00BB0ZTLI", "B0074FGNJ6", "B00HOG6GK6", "B005RQMP5K", "B00752RAZY", "B004UAG3HA", "B00A7BGMSQ", "B00CNR1F9I"], "buy_after_viewing": ["B00BB0ZTMM", "B00BB0ZTMM", "B00BB0ZTM2", "B00BB0ZTM2", "B0078LSTWU", "B0071O4ETQ"]}}