{"asin": "B000P6J67C", "description": "Feature-packed and amazingly versatile, Motorola's T9500XLR 2-way radios blur the line between professional and consumer models. With an astounding maximum range of 25 miles, weather alerts, digital privacy codes, hands-free transmission, and more, these little yellow wonders pack a lot under the hood. But how do they perform in the real world? To find out, we put the radios to the test in the urban jungle.DesignCompact and easy to hold, the T9500XLR's are also rugged and up to the task of any outdoor adventure. While they aren't completely waterproof, the ports and buttons have rubberized covers for keeping the elements out. The controls are relatively simple to figure out, and after a brief glance at the user's manual, you'll be up and running. The antenna on the radios is rather large--necessary for boosting range, but it might be stretch to tuck one into a small coat or pants pocket.The all-important transmit button is easy to depress and hold. Pressing on the top portion of the button places the radio in \"Power Boost\" mode, which maximizes the transmission range. You'll save battery by using the lower power mode when talking to parties that you know are closeby. The radios are powered by included NiMH battery packs, which are rechargeable (a charger comes with the radios, too). You can also opt to use old fashioned AA batteries (three of them per radio) if you're on an extended expedition without AC power.FeaturesThe T9500XLR supports up to 22 channels across the GMRS and FRS spectrum. GMRS channels offer high range and power for longer distance communication. There are also 121 interference elimination codes, also known as privacy codes. Codes 39-121 are digital, and they offer superior interference blocking when both radios are set to the same code. There's also an additional noise filter that filters out unwanted transmissions from other radios, something that's especially useful in places where there is a lot of radio traffic, such as a ski resort.You can also take advantage of the T9500XLR's unique \"iVox\" feature, which allows you to transmit without pressing a button. The radio detects the sound of your voice and automatically sends the transmission. No other accessories or headsets are required. You can also use the traditional \"Vox\" mode which does require a headset. The \"VibraCall Alert\" vibrates the radio when you receive a transmission--great for use in noisy environments, or when you want to keep things discreet.The radio can even scan its 22 channels for transmissions from other parties. Not only is this fun and often entertaining, it also also allows you to scan for members of your party who may have changed channels inadvertantly. Another handy feature is NOAA weather reception, which lets you listen to weather reports and bulletins right on your radio.Real World TestingMotorola claims a 25-mile range for the T9500XLR, but they add that this is really only attainable under ideal conditions, such as transmitting from the top of a mountain down into a wide open valley. Moto says a range of 10 miles is more feasible in day-to-day use, while two miles is the maximum range in dense urban areas.In downtown Seattle, that turned out to be pretty much true. Reception was good throughout the urban core, but when one tester ventured beyond that magical 2-mile radius reception started to fade. The radios did a good job filtering out unwanted transmissions, thanks to the privacy codes, and the number of available channels. Finding an unused channel in a busy city is a challenge, though. When in range, transmissions were clear and distortion-free.All in all, the T9500XLR is a top-notch radio with features one would expect on a product twice or three times the price. It earns our praise as a top performer for those who need the most out of a two way radio.ProsExcellent rangeGood interference eliminationRuggedConsA bit big for small pocketsWhat's in the Box2 T9500XLR radios, 2 battery packs, charging stand, black faceplates, AC adapter, 2 belt clips, and user's manual.", "title": "Motorola T9500XLR 25-Mile 2-Way Radio Pair", "price": 54.95, "imUrl": "http://ecx.images-amazon.com/images/I/31WXHpvuX3L._SY300_.jpg", "related": {"also_viewed": ["B001UE6MJ8", "B001WMFYH4", "B007UKVO3U", "B001UE6MIO", "B000WY8JRU", "B0072LAAA0", "B007FELOZO", "B001UE6MIY", "B0014DOFN0", "B007B5ZR4G", "B00000JD34", "B004PGM9PO", "B0072LAAM8", "B001UE6MJI", "B000O60S9S", "B0035PMH1W", "B00365E1H4", "B00FKJ3TR2", "B00L7EOX6U", "B0058W1I38", "B00CW8YACW", "B0014C0IAK", "B001WM73P0", "B00592CPB6", "B007B5ZNV8", "B008F57ICU", "B00CHHE0KA", "B007B5ZGTM", "B000OYJ62U", "B000BJ5S20", "B007B5ZKGG", "B00006JHZ0", "B007B5ZMGE", "B00BKV3ALE", "B009MAKWC0", "B0000AUFKI", "B00592CUBG", "B007B5ZHTG", "B0090UMDD8", "B000065DQ2", "B0091IMFF0", "B000Y31J26", "B002AAH8NU", "B007HE7G4K", "B00942OFVU", "B00EQV1I0K", "B00K68EWD2", "B004H2EQAC", "B004NYB68E", "B00CAXB37O", "B007BJC8SK", "B00F8VYK1G", "B007O441IC", "B00GZS2DSI", "B00C9DO4BC", "B007B5ZPGG", "B004NYB684", "B0082B9JNI", "B008B3VNL8"], "buy_after_viewing": ["B001UE6MJ8", "B001WMFYH4", "B007UKVO3U", "B001UE6MIO"]}, "categories": [["Electronics", "Portable Audio & Video", "CB & Two-Way Radios", "Two-Way Radios"]]}