{"asin": "B001HB7K6I", "description": "The creators of the acclaimed PlayStation 2 hit,Odin Sphere, return with the single player, action RPG,Muramasa: The Demon Blade. Steeped in the ancient mythology of Japan,Muramasa: The Demon Bladetells a tale of possessed souls, forgotten pasts and unimaginable destinies. A Wii exclusive, filled with expertly hand animated graphics and gameplay that transitions seamlessly between player-controlled elements and story sequences it is an adventure only to be experienced on the Wii..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Over-the-to katana battles.View larger.Sword-specific attacks.View larger.Beautiful play environments.View larger.Enemies large and small.View larger.StoryThis adventure unfolds during feudal Japan's Genroku era, a volatile time marked by warring factions and grave civil unrest under the shogun Tsunayoshi Tokugawa. The power-hungry shogun yearns to collect an array of legendary swords, but these blades carry a terrible curse-each one thirsting for blood the moment it's drawn. Those who wield these blades slowly become homicidal, and are destined to a tragic and untimely death.Two Heroes are thrust into this treacherous climate-Kisuke, a brave young lad who's lost his memory, and Momohime, a lithe female ronin possessed by a dark spirit. They must venture across the dangerous countryside, in a race to collect the swords before the vile shogun can reach them. Watch as the destinies of those drawn to these cursed blades unfolds, as dragon and demon gods from the underworld appear to challenge those who wield them. Who will you encounter? Friend or foe? Find out inMuramasa: The Demon Blade.Playable CharactersInMuramasa: The Demon Bladeplayers have their choice of two playable characters: the renegade ninja, Kisuke, and the princess turned kunoichi, Momohine. These are their stories.KisukeA ninja with no memory and hounded by a dark unknown past, Kisuke inexplicably finds himself a fugitive, chased for a crime he doesn't remember. He only knows that he must find a certain \"katana\" and that despite his best intentions, battle seems to follow wherever he goes.MomohimeDescribed by her subjects as \"beautiful as a flower and pure as snow,\" Momohime is a princess of Narukami. But when a dark spirit visits her castle Momohime's idyllic life is changed forever. Forced against her will, she leaves behind everything she knows in a quest for the cursed demon swords.GameplayInMuramasa: The Demon Bladeplayers are given the choice to take on the role of either Kisuke or Momohime as they set off in different directions with the goal of collecting as many katana (swords) as possible. Swords are categorized in groupings defined by the weapon's levels of power and agility. Each Katana also is imbued with a specific attack technique that players will utilize in the different, progessively more difficult game modes. Modes include: Unmatched Mode, designed for character leveling; Carnage Mode, an advanced action mode; and Insane Death Mode, which as its name implies is a very advanced mode and is only available to players who have cleared Carnage Mode.Key Game FeaturesA unique action RPG, from the makers ofOdin Sphere, with a story pulled from Japanese mythology.Entrancing 2D animation with the look of beautiful hand-drawn watercolor painting.Playable characters including a male ninja or female kunoichi, both possessing a wide variety of ninja skills necessary for progression through the levels in not only side-scrolling fashion, but vertical progression elements as well.Controller support for both the Wii Remote and the Nintendo Classic Controller.Three progressively more difficult game modes: Unmatched Mode, Carnage Mode and Insane Death Mode.A large variety of play environments featuring optional challenge stages and mini-games throughout.", "price": 49.99, "imUrl": "http://ecx.images-amazon.com/images/I/61Nbi3z6bTL._SY300_.jpg", "related": {"also_bought": ["B002EE7OKE", "B000Z9A95M", "B007CSF3GO", "B0019SY1D4", "B001TOMR0C", "B002E6XY6U", "B002BRZ9AG", "B000X25GW2", "B002EE5SAC", "B00B2QL2Y4", "B001COVME6", "B000IONGU4", "B002BSC4ZS", "B003JD7QYI", "B002FG9MWE", "B002BRYXOO", "B007RNWUC4", "B003ZCH7DI", "B000P297ES", "B002DC8GWC", "B001TOMQVC", "B001HB7KAO", "B000FQBPDU", "B001C58T46", "B000P46NKC", "B002BSA388", "B001ET07O0", "B007V9QKH0", "B0058CA4S8", "B006L1FAK2", "B0015HZLVK", "B0017WHQ34", "B003ZHMMEM", "B001J2SEY2", "B002I0IIPY", "B002ATY7JE", "B00269DXR0", "B009EWHKAI", "B002I08CSW", "B0050SVH18", "B002CZ3SLO", "B0020H46D8", "B001PBDBNQ", "B002BSC54I", "B001TKK3NE", "B001CU4EMW", "B001P5HM64", "B002BHSPXO", "B00269DXXO", "B005FYJA52", "B002TLTBN0", "B00009KO3S", "B001CU4EJ0", "B00KWFY04A", "B002BSC4RQ", "B001EN3YV4", "B00136MBHA", "B001HKPUKC", "B0050SVFB0", "B002BVQNPW", "B001TOQ8K2", "B001E27DLM", "B00149IL9I", "B00GV4V8XC", "B007IFMEYK", "B000WCQWR6", "B005EIIBKY", "B0009Z3K9E", "B008GFZV6Y", "B001NCARPW", "B003GB4UXI", "B000FQ9R4E", "B003IOGPAO", "B0037US4IA", "B0011GD54K", "B009CLBY0I", "B000GIXIPK", "B0016OVBG6", "B003M31RN6", "B004WLRQMI", "B00KVRK39A", "B000Q7RNT8", "B000P297F2", "B000W5Y49G", "B0016C3260", "B008MO6B1S", "B004P7VGF2", "B0042A1B84", "B0058VI0G2", "B001C6GVI6", "B007A7UJ4S", "B003VR5PPY", "B000NNDN1M", "B0050SVGW8", "B00G2GD6TS", "B000FQBPCQ", "B00BORFD9Q", "B0094X1ZXU", "B000JV78XC", "B0089X37NW"], "bought_together": ["B002EE7OKE", "B007CSF3GO"], "buy_after_viewing": ["B007CSF3GO", "B002EE7OKE", "B000Z9A95M", "B002E6XY6U"]}, "salesRank": {"Video Games": 3690}, "categories": [["Video Games", "Wii", "Games"]]}