{"asin": "B000V1VG5G", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Given the success of Canon's highly acclaimed G Series, it's no surprise that ambitious photographers have been eagerly anticipating the next model in its evolution. The wait has paid off handsomely with the introduction of the PowerShot G9. In image quality and functionality, the G9 stands above the competition with 12.1 megapixels of resolution, 6x optical zoom with Optical Image Stabilizer, and RAW mode for the ultimate in creative control. Sophisticated design and high-quality construction complement the technology and make the G9 a camera to be reckoned with.Big Impact in a Compact PackageThe PowerShot powerhouse: A class-leading 12.1-megapixel digital camera with unique Canon DIGIC III Image Processor, 6x optical zoom, and Optical Image Stabilizer.12.1-megapixel resolution gives you plenty of rich, deep detail to work with. Blow up images to poster size, or enlarge and crop any section without fear of pixilation.With DIGIC III, your images boast superior quality, the camera operates at top efficiency and battery life is enhanced. What's more, DIGIC III enables Canon's Face Detection Technology and red-eye correction to give you better, more true-to-life people shots. Simply press the Shutter Button halfway down, and the camera automatically pinpoints the faces in the scene and chooses the ideal focus point. The camera controls exposure settings and flash to keep every face looking bright and natural. Red eyes can be corrected during playback.iSAPS Technology is an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the fast DIGIC III Image Processor to improve focus speed and accuracy, as well as exposure and white balance.The camera is equipped with a long 6x optical zoom. Canon's own Optical Image Stabilizer Technology keeps images steady and blur-free all through the zoom range--even in low light--by detecting motion and generating a corrective signal. Because it is an optical system, more corrective movement is allowed and there is no degradation of image quality.Creative Power in Your ControlFull range of shooting and recording modes including JPEG + RAW for the ultimate in creative control.The PowerShot G9's RAW mode lets you shoot images without JPEG compression. It gives you clearer images and complete creative control in editing. RAW images are transferred directly to the computer where they can then be edited using image adjustment software or a processing application to adjust your images as you please. The camera can also be set to allow the simultaneous recording of both RAW and JPEG images while shooting.25 Shooting Modes, Including 9 Special Scene ModesShooting ModesAdvanced presets for the best possible photos under certain conditions.AutoThe camera chooses all the settings so you can concentrate on your subject.P ProgramAccess advanced exposure compensation features while shooting mostly automatically.Av Aperture-priorityYou define the aperture to either isolate your subject or have clarity throughout the entire picture, and the camera will choose the corresponding shutter speed.Tv Shutter-priorityYou select the shutter speed to stop or blur action, and the camera finds the appropriate aperture. With slow exposure times, Canon's noise reduction system activates to ensure low image noise.ManualThe ultimate in creative control, you set both aperture and shutter speed manually.C CustomDefine and store your own settings to achieve the effects you prefer.Stitch AssistBuild awe-inspiring panoramas by neatly aligning sequential images.MovieShoot in High Resolution (1024 x 768 at 15 fps), VGA (640 x 480 at 30 fps/30 fps LP), QVGA (320 x 240 at 30 fps) for up to 1 hour or 4GB, QQVGA (160 x 120 at 15 fps) for up to 3 minutes or Time Lapse (640 x 480 at 1 second/2 second intervals) for up to 2 hours.Special Scene ModesPortraitThe camera sets a large aperture, focusing the subject and artistically blurring the background to make your subject \"pop.\"LandscapeFor front to back sharpness, the camera sets a small aperture.Night SceneFor impressive sunset or nightlife shots, the camera properly exposes the background and uses slow-sync flash for the subject.SportsEnsure highly accurate autofocusing when shooting fast-moving subjects.FoliageCapture brilliant shots of autumn foliage, greenery and blossoms.SnowShoot clear snow scenes without darkened subjects or an unnatural bluish tint.BeachGet clear shots of people at a sunny beach without darkened faces.FireworksGrab brilliant images of skyrocketing fireworks.AquariumAchieve proper flash-free exposure and natural hues at indoor aquariums.UnderwaterCapture underwater images with reduced backscatter effect. (Note: Optional waterproof case WP-DC21 required for shooting any underwater images. Waterproof case not included--must be purchased separately.)ISO 3200Expands the user's ability to shoot in dark settings without using the flash.IndoorReduce blur and improve color accuracy when shooting handheld indoors.Kids and PetsReduced focusing time freezes fast-moving subjects, so you won't miss those special shots.Night SnapshotGet natural-looking pictures with brighter backgrounds and subjects lit by flash.Color AccentChoose to retain a single color in your image while other colors turn monochrome.Color SwapSelect a color and replace it with a color you specify for special effects.A View That's a Pure PleasureOptical viewfinder plus large high-quality 3.0-inch PureColor LCD II screen for bright, accurate color with greater viewing from a wider angle and with an anti-glare, anti-scratch coating.The PowerShot G9 gives you an extra-large 3.0-inch LCD screen for excellent control when framing your shots. But size is only part of the story. Canon's PureColor LCD II offers more spectacular color, resolution, and contrast even at an angle (compared to PureColor LCD). The screen is highly durable and easy to see in any light with a scratch-resistant, anti-reflective coating. It is a perfect feature for gathering friends and family around to see your images.3.0-Inch LCD ScreenCanon technology maximizes quality and performance.Genuine Canon Face Detection Technology sets the focus, exposure, and flash automatically, leaving you free to compose a group, capture an unguarded moment, or coax the perfect smile. Plus the new Face Selector Button lets you select the primary face.DIGIC III features Face Detection technologies, giving the you best possible results in any shooting situation. Face Detection AF/AE sets the focus point and exposure for the faces of your subjects. Face Detection FE adjusts the flash to correctly illuminate your subject to provide the best balance between your subject and the overall scene, eliminating the common problems of over- and underexposed faces.And new Face Selector AF enables you to lock on and follow a specific face. The selected subject is tracked wherever the face moves in the frame.The PowerShot G9 features ISO 1600 and High ISO Auto settings that reduce the effects of camera shake and sharpen subjects in low-light situations, giving you greater shooting flexibility.Red-eye correction detects and corrects red-eye during playback. In unusual cases where red-eye is not automatically detected, it can easily be corrected manually during playback mode.The Creative Freedom You've WantedCompatible with a wide range of accessories including EOS Speedlites, Canon supplementary lenses, and a waterproof case.The PowerShot G9 is compatible with many shooting accessories, not only wide and teleconverter lenses, a waterproof case, and High-Power Flash designed for all of the PowerShot models, but also Speedlite EX series that is compatible with all EOS series SLR cameras. (Shooting accessories are not included; they must be purchased separately.) Attach a Speedlite 580EX II to the hot shoe, then you can set and control the flash on the \"Flash Control\" menu in the camera. With the 580EX II, the G9 is able to have extra functions such as autoflash metering, FE lock, and Flash exposure compensation. Canon's Speedlite Transmitter ST-E2 enables you to have multiple slave flashes and wireless control. A waterproof case is also available for your underwater shooting.The Complete Print SolutionPrint/Share Button for easy direct printing and downloading, plus ID Photo Print and Movie Print with select PIXMA Photo Printers, CP, and SELPHY Compact Photo Printers.The PowerShot G9's Print/Share button makes direct printing easier than ever. Simply connect the G9 to a Canon CP, SELPHY, or PIXMA Photo Printer or any PictBridge compatible photo printer, press the lighted Print/Share button, and print! Also use the Print/Share button to transfer images to a computer (Windows and Macintosh).Print your own ID photos in 28 different sizes or use the Movie Print function to output multiple stills from a recorded movie on a single sheet with a Canon SELPHY Compact Photo Printer.What's in the box:Canon PowerShot G9 digital camera, lithium battery pack NB-2LH, battery charger CB-2LW, MMC Plus card MMC-32MH, neck strap NS-DC6, Digital Camera Solution CD-ROM, USB interface cable IFC-400PCU, AV cable AVC-DC300", "title": "Canon PowerShot G9 12.1MP Digital Camera with 6x Optical Image Stabilized Zoom", "price": 499.0, "salesRank": {"Camera &amp; Photo": 2422}, "imUrl": "http://ecx.images-amazon.com/images/I/41iE1uDGhXL._SX300_.jpg", "related": {"also_bought": ["B00301I6QQ", "B003CLOSNY", "B0084BDBIU", "B00CPSBEYQ", "1928873820", "B0041RSPRS", "B002LITT56", "B000B64AVS", "B000HATNI8", "B001CBKJGG", "B006GWZCDG"], "buy_after_viewing": ["B00301I6QQ", "B003VNKNF0", "B002IEVVE0", "B002LITT56"]}}