{"asin": "B002I636XM", "description": "The Altec Lansing inMotion Classic is a \"Works with iPhone\" and \"Made for iPod\" certified portable stereo system that includes a digital FM radio. Altec Lansing created the first portable iPod speaker and continues to push the standard with the inMotion Classic, with special attention given to its portability, audio performance and iPhone compatibility.The inMotion Classic Offers:iPhone and iPod compatibilityLightweight and compact size for travelRechargeable batteryPowerful, crystal-clear soundFM radio tunerFull featured remote controlThe iMotion Classic is \"Works with iPhone\" certified and includes a full-navigation remote that lets you browse your iPhone's playlist.View larger.A high-contrast LCD display lets you view your song details from afar.View larger.Innovative handle gives you the portability you need and doubles as a kick stand.View larger.A New Standard in Portable AudioThe versatile inMotion Classic is designed for extreme portability, letting you take your music anywhere. Compact and lightweight, the inMotion Classic folds to the size of a small, flat book to pack away.The innovative handle is more than just a handle and serves three important roles: to swing up for grab-and-go transport, to swing back as a stand to securely kickback the speaker system, and to swing under in a \"stowed\" position. This stowed position electronically prohibits the system from turning ON and draining the on-board rechargeable Lithium-ion battery.Satisfying Stereo SoundNaturally, you'll want to bring your tunes on the road only if they sound good. The inMotion Classic delivers. It features Altec Lansing's Audio Alignment&trade; craftsmanship that precisely balances the key audio components -- the drivers, the enclosure and the electronics. This sonic balance is especially important for great audio in a compact system.Expanded Sound Stage technology enhances the stereo listening experience by widening the sound field at the touch of a button. Custom-built, dual three-inch neodymium drivers throw out rich, crystal-clear audio with the quality that Altec Lansing fans have come to expect.Digital FM TunerThe inMotion Classic's digital FM radio tuner provides another entertainment source. The beauty of the FM radio is that it makes the inMotion Classic a valuable audio asset at all times, even when your iPhone or iPod is not handy. The four FM station presets let you keep your favorite radio stations ready to play.iPhone CompatibleThe \"Works with iPhone\" certification means that the inMotion Classic is engineered to be immune from GSM signals, therefore preventing the speakers from picking up that pesky interference buzz from the iPhone or other mobile devices. The music pauses and resumes play before and after taking a voice call without ever switching the iPhone to airplane mode. This lets you experience pure audio, and nothing more!Full-navigation Remote ControlThe inMotion Classic offers the most full-featured remote control in its class. In addition to the standard controls, the remote provides full menu navigation for your iPhone or iPod, allowing you to browse artists, songs and playlists directly from the remote. The high-contrast LCD display on the inMotion Classic always tells you the song details from afar.The inMotion Classic is covered by a one-year limited warranty.What's in the BoxinMotion Classic stereo speaker system, remote control, AC power adapter, Apple universal well inserts, and quick connect instructions.", "title": "Altec Lansing iMT620 inMotion Classic Portable iPod Dock with Rechargeable Battery and FM Tuner", "price": 69.0, "imUrl": "http://ecx.images-amazon.com/images/I/417x7dJAOzL._SX300_.jpg", "related": {"also_bought": ["B0058NW6TW", "B008DUJEIS", "B004LTEUDO", "B0038W0N8G", "B00E3HVNTI", "B001F7AHOG", "B005UNFRU0", "B0062W0XD4", "B002H9LNGW", "B0033T8CZK"], "bought_together": ["B004LTEUDO"], "buy_after_viewing": ["B0038W0N8G", "B003VANOI6", "B004TS2AOS", "B009CWRVH2"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}