{"asin": "B000UY6M2G", "description": "If you're looking for a single device that prints, faxes, copies, and scans, the HP Photosmart C7280 All-in-One Printer, Scanner, and Copier is your answer. The printer has a built-in 2.4-inch display you can use to easily print photos without a PC: Simply put your memory card into the memory card slot (compatible with Secure Digital/MultiMediaCard, CompactFlash, Memory Stick, Memory Stick Duo, xD-Picture Card), preview it on the display, and print. Enhancing your photos and removing red eye is as simple as pushing the HP Red-eye Removal button.The HP Photosmart C7280 produces lab-quality, fade-resistant photo prints by using a six-ink color system for accurate color reproduction. Photos will always print on the correct side of the paper with the right quality settings because of HP Auto Sense technology. And coupled with HP Advanced Photo Paper, the C6280 is sure to produce photos that are smudge and smear-resistant right from the printer. Print speed is outstanding as well, at up to 34 ppm black and 33 ppm color. For those looking to save paper, an included duplexer lets you print on both sides of the paper. Sharing the printer with everyone on your network is simple with both built-in wireless and Ethernet connectivity.The fax functionality is performed by a 33.6 Kbps modem at speeds up to three seconds per page. The built-in memory can hold up to 90 pages and the fax is capable of color faxing, delayed sending, and auto-redialing with a maximum of 48 broadcasting locations. The scanner uses a Contact Image Scanner (CIS) for scans at up to 4800 dpi optical resolution with a scan size of up to 8.6 by 11.7 inches. The copier supports pages up to this size as well and you can make up to 50 copies in one pass. Color copies are supported and there are settings for enlarging and reducing from 50 to 400 percent. HP Photosmart C7280 supports Windows 2000, Windows ME, Windows XP Home and Professional, and Windows Vista as well as Mac OS X 10.3.9 and 10.4.x. It is backed by a 1-year warranty.What's in the BoxPhotosmart C7280 all-in-one, power cord, phone cord, 02 black ink cartridge, 02 cyan ink cartridge, 02 magenta ink cartridge, 02 yellow ink cartridge, 02 light cyan ink cartridge, 02 light magenta ink cartridge, set up guide, user's guide, paper sample pack, installer CD, and two-sided printing accessory.", "title": "HP Photosmart C7280 All-in-One Printer", "price": 11.4, "imUrl": "http://ecx.images-amazon.com/images/I/41BFwZGkOyL._SY300_.jpg", "related": {"also_bought": ["B001S6EWIQ", "B0030U9OTK", "B000UX67DG", "B002GWVZIQ", "B002GWVZI6", "B007THM9R4", "B000GWPTLC"], "buy_after_viewing": ["B0030U9OTK", "B007YW4X2I", "B000UX67DG", "B000UX67DG", "B001S6EWIQ"]}, "categories": [["Office Products", "Office Electronics"]]}