{"asin": "B0036RFGKS", "description": "The NETGEAR Powerline AV+ 200 Adapter Kit XAVB2501 includes everything you need to extend a high-speed network connection to any power outlet, letting you connect HDTVs, Blu-ray players, DVRs, PCs, game consoles, and more. The Powerline AV+ 200 also provides the added convenience of an extra outlet with built-in noise filtering, so you'll enjoy an even better home theater experience. You won't have to worry about weak wireless signals or unsightly cables running through your home anymore.Powerline AV+ 200 Adapter Kitfeatures:Two Powerline AV+ 200 Adapters let you create a network port anywhere you have a power outletUp to 200 Mbps data speedsExtra outlet with noise filteringPlug and play installationSimple, push-button securityThe Powerline AV+ 200 Adapter provides an additional outlet with noise filtering.Connect devices anywhere in your home to your network with the Powerline AV+ 200.View larger.Plug-and-Play SimplicityThe Powerline AV+ 200 Adapter Kit includes two Powerline AV+ 200 adapters, which makes setting up a connection a snap. Simply plug one of the adapters into an available electrical outlet near your router and connect it to your router with an included Ethernet cable. Then plug the second adapter into any electrical outlet that's located near the device you want to network. Connect your device into the adapter and it will be connected to your network. It's as simple as that.You can easily create more network connections in your home by simply purchasing and installing additionalPowerline AV+ 200 XAV2501 adapters. The Powerline AV+ 200 is also compatible with all HomePlug AV products.Fast Network Connection for Streaming HD MediaThe Powerline AV+ 200 offers network connection speeds of up to 200 MBps, making it the ideal solution for network-intensive tasks such as making Internet phone calls, streaming HD video, playing online games, and transferring large files. The fast network speeds make the Powerline AV+ 200 great for devices such as the Slingbox, Xbox 360, Playstation 3, networked televisions, and more.And for added convenience, the Powerline AV+ 200 also features three different colored LEDs that give information on Power, Network Status, and Ethernet connections.Easy, Push-Button Security for Enhanced SafetyYou won't have to worry about hackers snooping in your private data when you're using the Powerline AV+ 200. By simply pushing a button, you'll enable an encrypted connection that keeps your sensitive information secure from prying eyes.Extra Noise-Filtered Power OutletEach Powerline AV+ 200 Adapter not only provides an Ethernet connection for Internet, but also has a power outlet to replace the one that it uses, so it won't use up your last outlet. Not only that, the Powerline AV+ 200 Adapter adds noise-filtering to the outlet. With a reduction in noise from other electronic devices, you'll get better performance in your home theater, such as cleaner sound and a clearer picture.The Powerline AV+ 200 Adapter Kit is a NETGEAR Green product, so you know you're getting a product. The Powerline AV+ 200 adapters automatically power down when not connected or not in use to conserve energy. The LEDs can be disabled to further save energy, and the packaging is manufactured with at least 95-percent recycled materials.Each adapter measures 5.43 x 2.56 x 1.57 inches (WxHxD) and is backed by a one-year warranty.What's in the BoxTwo Powerline AV+ 200 Adapters (XAV2501), two 2 meter Ethernet cables, setup CD and documentation.Install a Powerline adapter wherever you need a network connection.Related NETGEAR Products to the Powerline AV+ 200 Adapter KitNETGEAR Powerline AV+ 200 Adapter (XAV2501)Extends a high speed Internet connection to any power outlet (2 units required)Ideal for connecting HDTVs, Blu-ray players, DVRs, PCs, and game consoles to your home network and the InternetUp to 200 Mbps data speedsExtra outlet with noise filtering&nbsp;NETGEAR RangeMax Dual Band Wireless-N Gigabit Router (WNDR3700)Dual-band Wireless-N router provides outstanding speed and performance for serious gamers, enthusiasts, and small businessesSimultaneous operation on 2.4 GHz and 5.0 GHz frequencies for combined 600 Mbps speedPowerful 680 MHz 32-bit processorNETGEAR Powerline AV 200 Adapter (XAV2001)Converts your home electric wiring into a high-speed networkTurns a standard power outlet into a high-speed, entertainment-grade Internet connection.Ideal for connecting HDTVs, Blu-ray players, and game consoles to your home network&nbsp;NETGEAR RangeMax Wireless-N Gigabit Router with USB (WNR3500L)802.11n certified technology with Gigabit Ports for faster wired and wireless performanceReadyShare provides fast and easy shared access to an external USB storage deviceOpen-source community website and development Partner program with downloadable applications, user guide, forums and blogsNETGEAR Powerline AV Adapter with Ethernet Switch (XAV1004)Ideal way to add high-speed network connections to your home without rewiringConverts standard electrical outlets into high-speed network connectionsConnects up to 4 devicesPerfect for connecting HDTVs, Blu-ray players, and game consoles to your home network&nbsp;NETGEAR Wireless-N Router (WNR2000)Provides blazing fast Wireless-N networksBackwards compatible with older Wireless-G networksAutomatically configures your router for virtually all ISP connections", "title": "NETGEAR Powerline AV+ 200 Adapter Kit XAVB2501", "price": 45.95, "imUrl": "http://ecx.images-amazon.com/images/I/41Urnwwxz5L._SX300_.jpg", "related": {"also_viewed": ["B006OOKT3Y", "B0036R9YA6", "B009WG6JJO", "B007ILFFS6", "B007ZT1PAI", "B0036RH2U0", "B009WG6JF8", "B009WG6K66", "B0081FLFQE", "B0046SQ8VW", "B009WG6LLA", "B00AWRUICG", "B004PA9PBQ", "B00AWRUIY4", "B001AGM2VI", "B00IBPLI48", "B00EPGHHSS", "B00D4SOF3S", "B004DVEW8I", "B00AOGZ80C", "B002J9G5XG", "B0087O6AQE", "B00HSQAIQU", "B00I0MKIDO", "B00CX7Q3XQ", "B003VWY0VY", "B009ZRBXMI", "B001AZUTCS", "B002FB684E", "B006JG5S6U", "B00871SR68", "B005XUNWZ2", "B00CUD1M66", "B00B7DG8WS", "B00ARJN5WE", "B004YW7W1A", "B006L6X7PM", "B00F0RC97A", "B00DQN3R80", "B009WG6JMG", "B008LTPEXU", "B00AOGZ7S0", "B00LEFYTMK", "B0061308MA", "B00CD0JSMG", "B00EPGHH8I", "B00I6EY1JI", "B00FF8ZRPU", "B004D9V8C8", "B006JG5S6K", "B005GCSZD6", "B00D7GF6NA", "B00D7GF4XC", "B00535BR0Y", "B00ARJN5TC", "B00884WH74", "B00I0MKIB6", "B002IKKF5K"], "buy_after_viewing": ["B006OOKT3Y", "B0036R9YA6", "B009WG6JJO", "B007ILFFS6"]}, "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Network Adapters", "Powerline Network Adapters"]]}