{"asin": "B0011Z44UA", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The 9.1-megapixel Panasonic DMC-TZ5 packs a 28mm wide-angle, 10x optical zoom Leica DC lens in a compact design, ideal for the active photographer who needs a versatile camera.  By combining a 28mm wide-angle lens, which lets you capture a wider-framed shot when compared to a traditional 35mm camera, with the TZ-Series 10x optical zoom, you're empowered to take expanded shots, both wide and far.  Panasonic's Intelligent Auto technologies are also expanded, with new Intelligent Exposure and Digital Red-eye Correction.With the addition of Intelligent Exposure and Digital Red-eye Correction, Panasonic&#x92;s Advanced Intelligent Auto mode consists of seven intuitive technologies, all which are specifically designed to help make photo-taking an enjoyable and seamless process unnoticed by the consumer -- helping them to take clear photos. When in Advanced Intelligent Auto mode, the following technologies all operate automatically; no settings need to be manually changed.Also new to the TZ5 is the Venus Engine IV, Panasonic&#x92;s new high-performance image processing LSI.  The Venus Engine IV produces higher-quality pictures than its predecessor, the Venus Engine III, by using a more advanced signal processing system.  The new Venus Engine IV also improves noise reduction, elevates the detection accuracy and corrective effects in both Mega O.I.S. and Intelligent ISO and reduces the shutter release time lag.  Both models also incorporate Intelligent LCD, which detects the lighting condition and controls the brightness level of the LCD in 11 fine steps, to offer optimal clarity in any situation, whether dark or light; indoors or outdoors.  With a newly developed 460,000-dot high resolution in the TZ5&#x92;s 3.0-inch LCD, photos can be easily viewed on the display, regardless of the shooting environment.The TZ5 is also capable of recording 720p high-definition motion pictures, and because of its support of SD memory cards, is easily compatible with Panasonic Viera plasma HDTVs that have an integrated SD memory card slot, so viewing photos is simple.   Also, with the newly added HD component output capability, users can also connect the TZ5 to an HDTV and watch a slideshow complete with mood-appropriate music, choosing from natural, slow, urban and swing.Lumix DMC-TZ5A HighlightsIntelligent ExposureWith this new feature, photos will no longer be under- or over-exposed.  Instead, the TZ5 instantly analyzes the framed image and adjusts the brightness in areas that are too dark because of dim lighting, backlighting or the use of the flash. The camera will automatically adjust the brightness accordingly.Digital Red-eye CorrectionThis feature helps to eliminate the red-eye problem that sometimes results when taking flash shots at the night.  Incorporated into the built-in flash, the camera emits a small preliminary flash before the main flash, detects red-eye and will digitally correct it.Mega O.I.S.Gyrosensors detect hand-shake and the lens system shifts to compensate, helping to prevent hand-shake from creating a blurry image.Intelligent ISOWith Intelligent ISO, the TZ5 can determine if the photo subject is moving and change the ISO setting and shutter speed accordingly, thus giving a blur-free photo.Intelligent Scene SelectorIntelligent Scene Selector senses the ambient conditions, recognizes the shooting environment and will automatically select the appropriate scene mode from: Scenery, Portrait, Macro, Night Portrait or Night Scenery mode.  This intuitive technology, helps you use the most common scene modes that are built into the camera, but often go unused, without making any manual adjustments.Face DetectionPanasonic&#x92;s Face Detection detects faces anywhere in the frame and automatically chooses the optimal focus and exposure settings so portraits come out clear and crisp.  Detecting up to 15 faces, Panasonic&#x92;s Face Detection can even track a face if the subject is moving.Continuous AFThe Continuous AF (auto focus) system maintains focus on the subject even without pressing a shutter button halfway, thus minimizing the AF time.", "title": "Panasonic Lumix DMC-TZ5S 9MP Digital Camera with 10x Wide Angle MEGA Optical Image Stabilized Zoom (Silver)", "price": 299.0, "salesRank": {"Camera &amp; Photo": 8596}, "imUrl": "http://ecx.images-amazon.com/images/I/412jwlEX6wL._SX300_.jpg", "related": {"also_viewed": ["B003960FFM", "B0019GV4MM", "B003966MRM", "B00728ZBC0", "B007CLW404", "B00395WIXA", "B004KKZ0HY", "B00728ZBA2", "B00728ZAHG", "B004NBZ8DQ", "B00ATE7W7G", "B00814CAS2", "B001QFZMCO", "B00ATE7SZM", "B00728Z8TG", "B006ZAHMPA", "B006ZAHNMW", "B004KKZ0HE", "B00BEHQKPM", "B00ATE7TIS", "B00395YA90", "B008MB70TI", "B00ATE7WFS", "B008MB719C", "B00BEHQKPC", "B00HZDAUOQ", "B006ZAHN8Q", "B006T7QVJM", "B000TM7GD8", "B001O1GEU4", "B006ZAHN4K", "B00B7FNGIK", "B0075SUHGC", "B003WJR69O", "B000P6I4XO", "B004KKZ0HO", "B003VTZE1M", "B00B46XLTG", "B0075SUKBO", "B00CPPRO3Y", "B00B5MUJ58", "B006ZAHNW2", "B002LITT56", "B00HV6KL6Y"], "buy_after_viewing": ["B00728ZBA2", "B003VNKNEQ", "B003VNKNF0", "B003F7DWH8"]}}