{"asin": "B002BRZ9G0", "description": "Developers at Nintendo have dreamed of creating a simultaneous multiplayerSuper Mario Bros.game for decades. The Wii console finally makes that dream come true for everyone withNew Super Mario Bros. Wii.Supporting 2-4 players in side-scrolling co-op and competitive platforming action, and featuring a mix of fan favorites and new characters, new powerups and various input options via the Wii Remote, it is destined to become an instant classic in one of the most beloved game franchises of all-time..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Co-op/competitive simultaneous multiplayer.View larger.Classic environments with a twist.View larger.Wacky new powerupsView larger.GameplayNew Super Mario Bros. Wii, like all the previous releases in theSuper Mario Bros.franchise is a side-scrolling platforming game where players collect coins as they attempt to make their way through progressively more difficult game levels using their ability to time jumps over obstacles and avoid a slew of enemies. But although the game contain several well-deserved nods to previous games in the series in the form of iconic characters like Mario, Luigi and two Toads, as well as familiar enemies, sound effects and levels, it is not simply another trip downMario Bros.memory lane. Taking advantage of the flexibility and power of the Wii and Wii Remote,New Super Mario Bros. Wiimanages to preserve the retro experience that fans love about the series, while adding new game features. Notable additions among these include, expansive play levels and new powerups and characters, but by far the most important, and in fact game-defining new feature is simultaneous multiplayer.A Franchise First: Simultaneous MultiplayerSince the very firstSuper Mario Bros.game took the world by storm in the late 1980s gamers anxious to get into the action have patiently and impatiently waited their turn as the infamous 'player 2.' Those days are no more. InNew Super Mario Bros. Wiiplayers can now navigate the side-scrolling worlds alone as before or invite up to three others to join them at the same time, on the same level, at any point in the game for competitive and cooperative multiplayer fun. With the multiplayer mode, the newest installment of the most popular video game franchise is designed to bring yet another type of family entertainment into living rooms and engage groups of friends in fast-pacedSuper Mario Bros.fun.Controller Choices Via the Wii RemoteIn another nod to the series' Nintendo Entertainment System (NES) roots, the Wii Remote controller used withNew Super Mario Bros. Wiiis held sideways, allowing for easy, classic inputs using the D-pad to direct playable characters, the 1 button to jump and 2 button to spit out projectiles like snowballs and fireballs. In addition, players can access powerups with their choice of either the push of a button, or by shaking the Wii remote, again demonstrating the perfect merging of classic gameplay and modern game design which isNew Super Mario Bros. Wii.Key Game FeaturesNew Super Mario Bros. Wiioffers a combination of cooperation and competition. Players can pick each other up to save them from danger or toss them into it.Supports 2-4 players in multiplayer mode.Mario, Luigi and two Toads are all playable characters, while many others from the Mushroom Kingdom make appearances throughout the game. Players can even ride different Yoshi characters and use their tongues to swallow enemies &ndash; or their fellow players.In some areas, players use the motion abilities of the Wii Remote controller. The first player to reach a seesaw might make it tilt to help his or her character reach a higher platform &ndash; and then tilt it incorrectly just to mess with other players.New items include the propeller suit, which will shoot players high into the sky with just a shake of the Wii Remote and Mario&rsquo;s new ability to transform into Penguin Mario.At the end of each stage during the simultaneous multiplayer mode, players are ranked based on their score, the coins collected and the number of enemies defeated.", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/51Bs4LPWpaL._SY300_.jpg", "related": {"also_bought": ["B001GIUWX0", "B003ZHMMEM", "B001PO2BJI", "B005FYJA52", "B002D2Y3IS", "B0017Q4DGI", "B002BSA388", "B004IK24MU", "B004M8K9AW", "B002672Z80", "B002BH3N2W", "B00DWXV074", "B0009VXBAQ", "B004W1IX1G", "B000QD7BBM", "B003LDKIUA", "B00D7UHT0E", "B0013E9HP6", "B002MGPAKU", "B004C34D2M", "B0094X28J0", "B004WLRR4K", "B00F2ENJY8", "B00AJZNUUI", "B004N3FGHC", "B00LP1Y41Y", "B000FQ9QVI", "B000IMWK2G", "B006AN894U", "B0094X2066", "B0013OL0BK", "B000R3BNDI", "B0086V5UF0", "B003ZCH7DI", "B003YC4D9A", "B0053BG26C", "B0013B30SY", "B00AFYAUYW", "B005EHQJ2C", "B002B7E3B2", "B002GEKIOG", "B00BXGY9SY", "B004JKZUJI", "B003Q5J4NU", "B000XJNTNS", "B000LSJKAM", "B000RL8G1W", "B0053OMQIC", "B004BWTO4G", "B0017HIIWW", "B006QRNKOO", "B002I0IIPY", "B00A431N4K", "B0038MUCWS", "B009M72E5Q", "B003OQ4B1Q", "B0088I8M10", "B0050SVGU0", "B005EW68X2", "B0094X1ZXU", "B000IONGVI", "B006ZPAYB4", "B0056C2LIG", "B00DLL8P98", "B00DWXV2EU", "B003OZZJGS", "B0026IUSXI", "B0041TD3O6", "B003T8BWR0", "B004MNDCTC", "B001AZ7ROQ", "B004C35JUC", "B00FLYZ7NU", "B0039XZGXG", "B000NNDN1M", "B008E6ZYCQ", "B003DSAT0C", "B0050SVFB0", "B0081AWU4A", "B003YLWJLA", "B000GUQJQ8", "B003X1R29K", "B008GFZV6Y", "B00A2WP4UC", "B003WOFXEY", "B00503E9UO", "B0042VV5DY", "B003O6DZSQ", "B0051873RE", "0307465926", "B00ER8HHDO", "B000R3BNE2", "B00CQ7CIMS", "B0045FEE3A"], "bought_together": ["B001GIUWX0", "B001PO2BJI"], "buy_after_viewing": ["B001GIUWX0", "B005FYJA52", "B001PO2BJI", "B004W1IX1G"]}, "salesRank": {"Video Games": 53}, "categories": [["Video Games", "Kids & Family", "Wii", "Games"], ["Video Games", "Wii", "Games"]]}