{"asin": "B00025O7LQ", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Mice"]], "description": "The Kensington Mouse-In-A-Box Optical 2 USB/PS2 Mouse offers the perfect combination of comfort and simplicity.The Kensington Mouse-in-a-Box Optical 2 features two mouse buttons and a scroll wheel to speed through long documents or Web pages, and has been ergonomically designed to be comfortable for both right- and left-handed users. The speed and pinpoint accuracy of Kensington's high precision optical sensor technology allows it to respond to even your fastest movements with accurate tracking and unmatched acceleration guidance, with the added benefit of no required cleaning. This Kensington optical mouse connects via USB/PS2 and is guaranteed to work right out of the box on both PCs and Macs, with long-lasting reliability that is backed by a five-year manufacturer's warranty and free technical support.The Kensington Mouse-in-a-Box Optical 2 has a six-foot cord, and comes in a stylish silver body. The Kensington Mouse-in-a-Box Optical 2 requires a PC with Windows 98, Me, 2000, or XP with USB port, a PC with Windows 95, 98, Me, NT, 2000, or XP with PS/2 compatible mouse port, or a Macintosh with a USB port running OS X or later.", "title": "Kensington K72213USA Mouse-in-a-Box Optical 2 USB Mouse (PC/Mac) (72213)", "price": 17.99, "imUrl": "http://ecx.images-amazon.com/images/I/31cTZi8%2BFiL._SY300_.jpg", "brand": "Kensington", "related": {"also_viewed": ["B002ZIN9DU", "B004NBZA84", "B00EQ94566", "B0044XTXJI", "B007CLWN5A", "B003B4BBFK", "B004P1IU5C", "B0000ACOBI", "B001715BIC", "B003L62T7W", "B009ZPS3WS", "B002TLTH7K", "B00383FO4I", "B005EJH6RW", "B00DR8LA60", "B0055QL1DO", "B003COC7IY", "B000CQ0NCW", "B004NBZAAW", "B0007Z1M50", "B005J7Y9C4", "B002FYL7PG", "B00902BFGC", "B00CAJO474", "B00G5T1Z5Y", "B00009KH63", "B006MBP7T0", "B000H51GA6", "B002B3YCQM", "B0039VO02G", "B00B55I9MA", "B004P1IU52", "B001MTE32O", "B000068MQ6", "B001WAK6II", "B00H2UXYA4", "B007X3VEVG", "B00ESJPSWY", "B005CPGHAA", "B0035ERKYW", "B002TLTGM6", "B003NR57BY", "B005HQ5138", "B0082D5660", "B0097D1XUW"], "buy_after_viewing": ["B002ZIN9DU", "B004NBZA84", "B00EQ94566", "B005DLDTAE"]}}