{"asin": "B000E63LME", "related": {"also_bought": ["B000E682D2", "B005Q8BIK2", "B00181U5A0", "B000E682EG", "B000E65OJC", "B000E65OK6", "B000E65OII", "B000E63LBU", "B000E63LEW", "B000E63L7O", "B000E682NW", "B000E67206", "B000E671W0", "B000CQID92", "B000E65OF6", "B000E65OJM", "B005Q8BL9A", "B007V2L8SS", "B000GG0BNE", "B000E672C4", "B000E63LDS", "B001FFEU1E", "B00GEG40KA", "B000GG5PQ2", "B003E24WJQ", "B000E682DC", "B000F4H5H2", "B0099VR7S4", "B001EQ4ORY", "B00CRAU3LM", "B003UL8S32", "B009L47BR6", "B007V2L8VU", "B005Q8BIAC", "B0046KMEYK", "B000E6727O", "B0099WPOJ2", "B000E63LQU", "B00D5DVJ1S", "B0000CELU7", "B0052P1YOO", "B005Q8BL72", "B00028OZGU", "B000E671X4", "B004XN8RWI", "B000FB1XGY", "B000E682LY", "B0017LG0QE", "B001OI5VTW", "B000E63L6U", "B008YD8232", "B000E671Z2", "B000GLZQBQ", "B000E63LLU", "B0042IMPTU", "B00060N5OW", "B003VTLR5Y", "B000E672AG", "B0001N47YG", "B009LIK0FW", "B000E63L8S", "B000S4DAF0", "B003D4F2US", "B000E6727Y", "B0000DI145", "B0012BUK1A", "B004S0DZ8W", "B007M8FRU6", "B0032ZB03G", "B00B2206X6", "B00451SGZ6", "B002YJC990", "B000GG0BPM", "B00394VLL6", "B00BGN8PLG", "B001G2F5R4", "B006F63M8U", "B000E65OKQ", "B0040ZOVEC", "B000YG64DW", "B00E19WJ64", "B00CHHKBLM", "B007M8FRV0", "B0076OK56M", "B001MOP88W", "B002HQGFJK", "B000EMD1QO", "B000EMK4CS", "B000E63LMO", "B00F2P9CYI", "B004I05VDY", "B00016ATBS", "B0009F3SAK", "B000U0MTMW", "B000E6LBXK", "B00CP5R2EU", "B001V65KA2", "B000F4H5GI", "B000FMMTHU"], "also_viewed": ["B005Q8BIK2", "B000E682D2", "B000E65OJM", "B00181U5A0", "B000GG5PQ2", "B005Q8BL9A", "B000E63LEW", "B000CQID92", "B003UL8S32", "B000E65OJC", "B000E65OK6", "B000E682NW", "B000E63LBU", "B003CK0VVI", "B009L47BR6", "B009LIK0FW", "B001EQ4ORY", "B0017LG0QE", "B0099WPOJ2", "B005Q8BL6I", "B00GEG40KA", "B0001LO36K", "B004E3EKD2", "B000E63LDS", "B0000CELU7", "B001EQ4MPI", "B004XN8RWI", "B000E63L7O", "B000F4H5H2", "B000E682EG", "B000E65OII", "B005Q8BL72", "B000E63L6U", "B004UZWHPC", "B000FB1XGY", "B000E65OF6", "B000S4DAF0", "B000E63LQU", "B00KB9DEDU", "B000E67206", "B004UWZ090", "B000E671W0", "B000E682DC", "B000E671Z2", "B007V2L8SS", "B00CQ7UXCU", "B005Q8BIAC", "B00CRAU3LM", "B00D5DVJ1S", "B00099XN06", "B000E671X4", "B001A3OADO", "B000S6CCJ8", "B0046KMEYK", "B000E65OKQ", "B0099VR7S4", "B007V2L8VK", "B000GG0BNE", "B000E63LOM", "B003CNUB74"], "bought_together": ["B000E682D2", "B000GG0BNE"]}, "title": "Celestial Seasonings Fruit Tea Sampler (5 Flavors), 18-Count Tea Bags (Pack of 6)", "price": 25.55, "salesRank": {"Grocery & Gourmet Food": 4616}, "imUrl": "http://ecx.images-amazon.com/images/I/51kVOy%2BrxcL._SX300_.jpg", "brand": "Celestial Seasonings", "categories": [["Grocery & Gourmet Food"]], "description": "In 1969, 19-year-old Mo Siegel and his friend Wyck Hay found a bountiful harvest of wild herbs growing around Boulder, Colorado. With friends and wives helping, they picked the herbs and produced 500 pounds of their first blend, called MO's 36 Herb Tea. It was packaged in hand-sewn muslin bags and sold to a local health food store. Hay's brother, John, joined the partnership in 1971. The entrepreneurs set up shop in an old barn outside of Boulder, and they expanded their market to stores throughout Colorado, New Mexico, and the East Coast. The partners also began buying herbs rather than picking everything themselves, and the dream of a national herb tea company slowly began to materialize. This dream was reinforced when Red Zinger Herb Tea was introduced in January 1972 and was an immediate sensation. It remains one of the best-selling Celestial teas.The company continued to grow and revolutionize the tea industry. Herb teas had previously been perceived as only of medicinal significance, but Celestial Seasonings introduced herb teas as flavorful, healthy beverages, virtually creating the modern tea industry. Celestial Seasonings solidified its sources for obtaining ingredients, such as hibiscus flowers and chamomile, by working closely with herb farmers from the Pacific Northwest to the exotic Far East. This forward thinking attracted the attention of food industry giant Kraft, Inc., which bought Celestial Seasonings in 1984. Kraft's guidance brought Celestial Seasonings to the attention of new consumers, further strengthening its lead in the herb tea industry while also introducing a gourmet line of traditional, or black, teas. In September 1988, Kraft sold Celestial Seasonings back to its management, returning the tea company to independent ownership. The company remains headquartered in Boulder, in the corporate facility on Sleepytime Drive.The company, in 1991, experienced the exciting return of its original founder and leader, Mo Siegel, as chairman and chief executive officer. Since then, the company has expanded upon its herbal expertise bringing to market successful lines of Green, Wellness, Organic, and Chai teas. In 2000, Celestial joined forces with the Hain Food Group, maker of many top-selling natural foods brands. Today, serving more than 1.2 billion cups of tea per year, Celestial Seasonings is the largest herb tea manufacturer in North America and is expanding internationally at a rapid rate. Assured of Celestial Seasonings leadership position in the herb tea industry, Mo retired in September 2002 to fulfill another dream: to finish hiking the last set of 14,000-foot Colorado mountains he has yet to climb.Celestial Seasonings' Mission:To create and sell healthful, naturally oriented products that nurture people's bodies and uplift their souls. Their products must be:superior in qualityof good valuebeautifully artisticphilosophically inspiringIn their own words: \"Our role is to play an active part in making this world a better place by unselfishly serving the public. We can have a significant impact on making people's lives happier and healthier through their use of our products.\""}