{"asin": "B003554BP2", "related": {"also_bought": ["B005VAORH6", "B00906E03I", "B003RRY8ZG", "B001S2RCXW", "B005VAORJO", "B000ANOY7M", "B005VAORIA", "B000VEMNRS", "B003554BPW", "B000UXZQ42", "B00IAKTHFQ", "B00083Y0T6", "B003HHWXPS", "B006GTD8YE", "B005IXU8RE", "B0001V3AVY", "B005EJH6RW", "B003H4QPJQ", "B001SEQN3K", "B000J4WPW8", "B002YHV7MC", "B003NREDC8", "B0006HX518", "B009H0XQPA", "B00006B7RM", "B003B4BBFK", "B00004Z7FQ", "B00BBD7NFU", "B00F9EKLOW", "B005K22JQ6", "B0015BYS74", "B0098Y77U0", "B00G6T8EK2", "B00004Z5LR", "B006JH8T3S", "B00C0NWBFC", "B0014CDTH4", "B007PJ4Q4A", "B007P8DKZ2", "B00023CJI6", "B001DBIT08", "B005H3I38Q", "B000GGTSVU", "B005DKZTNK", "145573733X", "B000136P8W", "B004AIJE9G", "B00D69U1B0", "B007SHJIO2", "B000A6PPOK", "B0045JTAC6", "B001TGTDFM", "B00BP5KOPA", "B00007M1TZ", "B000I4RMOU", "B001TH7T2U", "B00023DRLO", "B002PY7P4I", "B005CWSKSK", "B004SUO1R6", "B0000AI0N1", "B008MR36FE", "B00006IFKU", "B002DPUUL4", "B0000AZK4F", "B0027JBLV4", "B003VANO7C", "B003VAGXZC", "B000SAF07K", "B00D601UC8", "B003YFHCKY", "B004TS1J18"], "bought_together": ["B005VAORH6"], "buy_after_viewing": ["B005VAORH6", "B00906E03I", "B003RRY8ZG", "B006GTD8YE"]}, "title": "Plantronics .Audio 476, DSP, PC Headset", "price": 19.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31NHqHR7siL._SY300_.jpg", "brand": "Plantronics", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Headsets & Microphones", "PC Headsets"]], "description": "The ideal choice for your on-the-go audio needs, the Plantronics Audio 476 DSP folding PC Headset offers a crisp, digitally enhanced audio experience. Whether you're listening to music, watching video, or making internet phone calls, you'll enjoy taking in the .Audio 476's rich stereo sound. And with a noise-canceling microphone plus wideband echo cancellation technology, your calls will be clear and natural sounding on both ends. The .Audio 476 also offers a comfortable lightweight fit, convenient inline controls, and plug-and-play USB setup.The .Audio 476 DSPFolding PC HeadsetAt a GlanceLightweight, folding design for comfort and portabilityCaptures the full voice range for natural sounding callsWideband acoustic echo cancellation and noise-cancelling micAcoustically tuned digital equalizers for rich, 24-bit stereo soundEasy USB plug-and-play setupInstallation is easy, just plug in the USB connection and you're ready to go.DSP Technology Offers Clear Calls and Natural SoundExperience exceptional call quality when you use the .Audio 476 to make VoIP (voice internet protocol) calls using Skype or other Internet phone services. Whether you're on the phone with friends or clients, they'll appreciate how clear you sound, thanks to DSP (digital signal processing) technology. This multifaceted technology improves both outgoing and incoming audio for crisp, natural conversation.DSP technology captures the full voice range and stabilizes the spoken voice by amplifying or minimizing certain frequency ranges. This ensures a more natural-sounding conversation and reduces listening fatigue for the person on the other end of your call.Wideband Echo Cancellation and Noise-Cancelling MicrophoneSound professional no matter where you're calling from. The .Audio 476 uses a two-step approach to remove distracting background noise and improve voice clarity. First, a noise-cancelling microphone minimizes the distractions typically found in a busy home, office, or travel stop. Second, DSP enhances the performance of the noise-canceling microphone by blocking out low-frequency noise for clearer conversations.A central part of this improved sound is DSP's wideband acoustic echo cancellation, which diminishes feedback and reduces speaker-to-microphone echo (a common problem that can affect VoIP calls).Rich Stereo Sound with Noise Reduction to Prevent DistortionWhen listening to your favorite band or catching up on games and movies, enjoy an enhanced listening experience that includes rich, 24-bit hi-fi stereo sound provided by the .Audio 476's acoustically tuned digital equalizers.DSP technology also works to prevent the creation of artificial noise or distortion, allowing the .Audio 476 to offer smooth volume transitions that preserve high audio quality.Folding Design for Comfort and ConvenienceDesigned to fold for easy storage in your laptop bag, the .Audio 476 is a compact addition to your portable setup. Its lightweight construction and soft foam ear pads combine to make it comfortable enough for all-day wear, while inline controls offer quick, easy access to mic mute and volume control.Simple Plug-and-Play SetupSetup is simple: just plug the headset into your computer's USB port and you're good to go. There's no software to install, no configuration, and no hassles.The Plantronics .Audio 476 DSP PC USB Headset is backed by a one-year warranty.What's in the Box.Audio 476 DSP PC USB HeadsetThe .Audio 476 is designed to fold for easy storage in a laptop bag.View larger."}