{"asin": "B00C4034IE", "description": "ARCTIC P402BT is Bluetooth v2.1 compatible wireless stereo pro DJ-style headphones with an integrated microphone. It can be paired with the most popular Bluetooth-enabled devices such as portable music players (MP3), Smart Phones as well as computers using VoIP applications. Balanced linearity produced true sound reproduction for different genre of music. Integrated 850mAh rechargeable battery provides over 30 hours of continuous play time and over 300 hours of standby power, giving you plenty of time to enjoy your favorite music tracks or movie titles without bothering with tangled wire. ARCTIC P402BT features a hidden microphone that has no problem in picking up your voice in normal conversational volume during a phone call. P402BT intelligently alerts you with a ring tone when there is an incoming phone call; put the music on hold while you answer the call and resume playing exactly where you left off once the call ended. It is extremely easy to operate P402BT: pairing with Bluetooth-enabled device takes minutes to accomplish. The intuitive user control allows you to skip forward, backward or pick up a phone call with a simple push of a button. Ultra-soft cushion are designed for extended wearing comfort that do not pin down your ears and are suitable even for people wearing glasses. Large ear cups covered your ear completely and effectively cancel out most of the background noise. You can enjoy true stereo music for hours comfortably at home, at work or on the road. ARCTIC P402BT comes with a 2-year limited warranty. Please contact Arctic for service at arctic.us@arctic.ac.", "title": "ARCTIC P402BT Bluetooth Stereo Over-Ear Headphones, Integrated Mic, A2DP/AVRCP, 30-Hr Playback - Black", "price": 59.95, "imUrl": "http://ecx.images-amazon.com/images/I/41ybDUeWvSL._SY300_.jpg", "related": {"also_viewed": ["B00AVZO9A6", "B00DU6RY6O", "B007K4TN02", "B00J95SC5M", "B00ACPR3AS", "B00ETH7ERM", "B00ELMFGDY", "B00DQXR3A8", "B00AIY86G8", "B00I4C5QQE", "B00HWTANLS", "B00HTPHK5W", "B00AGH81M6", "B00HMRDKO2", "B00BKPU27U", "B004Y4XVOK", "B00HWSN9SI", "B009923WIW", "B00HWTAPF2", "B00H1XKDK6", "B00KBOVAEK", "B00CZ54VVM", "B00B2G2GSU", "B004D4R9VC", "B00EP7B7XS", "B008OUL1OC", "B00D8RVND0", "B00DOP3NPW", "B0095EL84E", "B00JX81XQK", "B00ELMFHI8", "B00B3ZB9A6", "B00E0GRRR4", "B00BFO14W8", "B00H1XKC2U", "B00EL2HDQC", "B00HX0RTTU", "B00AIY86J0", "B00AJHCJQC", "B00BN0N0A8", "B00H1FCUBY", "B0070UKBO8", "B00GO79UD6", "B00JVB5NCO", "B00AMTSALU", "B00HWSNB8G", "B00GFV3N66", "B008EOXXFI", "B00H1XKC1Q", "B006BUN8NO", "B00EL2HDNU", "B009S4KHES", "B00HWT8I24", "B00HLXX3BM", "B00CAJOW9E", "B007SP2CO2"], "bought_together": ["B009ZIILLI"], "buy_after_viewing": ["B00HTPHK5W", "B00AVZO9A6", "B00CZ54VVM", "B008OUL1OC"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]]}