{"asin": "B006FLENJC", "description": "PixelFlash&reg; Invincible Connection&trade; USB 3.0 SD, SDHC, SDXC, MicroSD Memory Card Reader and\nAdapter SuperSpeedInvincible Connection&trade;Our premium 15 micron gold plated connectors guarantee 10,000+ interactions with your valuable memory cards. Most competing products use inferior plastic connectors with 1-5 microns of plating, leaving their readers with a lifespan of 100-1,000 insertions.DualTest Safe Guard System&trade;Our readers are tested twice, once at the PCB level and again after each unit is completed and fully assembled.Capacity For CreativityShooters looking for lightweight portability and extended capacity found their solution with\nSuperSpeed or MicroSD SDHC and SDXC cards. It's why we designed our PixelFlash USB 3.0\nSuperSpeed SD Memory Card Reader to make transfers quick and secure. With read speeds up\nto 500 MB/s and transfers up to a smoldering 5GB/s, our USB 3.0 SuperSpeed SD Card Reader\ncan move your images and video in a fraction of the time. Our card reader gets busy with the\nbusy work, so you spend less time staring at a progress bar and more time in the field.Pocket PowerNot using USB 3.0? Not a problem. PixelFlash SuperSpeed USB SuperSpeed SD MicroSD\nReaders are not only backwards compatible with USB 2.0 interfaces, but transfer significantly\nfaster than other USB 2.0 readers. There are packs of gum smaller than this reader, so you get\nthe portability that matches its extended capacity and blazing speed. Throw one in the bag or\nkeep it loaded in your pocket for what is essentially the smallest, fastest external hard drive you\ncan carry.Leadership MaterialPixelFlash is an American technology company with a singular focus: quality. We create digital\nmedia technology to enable faster, easier work at a better value. Our mission is simple; making\nhardware that's the #1 choice of award-winning professionals.", "title": "PixelFlash Invincible Connection USB 3.0 SD, SDHC, SDXC, MicroSD (HC/XC) Memory Card Reader and Adapter SuperSpeed", "price": 6.17, "imUrl": "http://ecx.images-amazon.com/images/I/41kbodGH3gL._SX300_.jpg", "related": {"also_bought": ["B005IMFX2K", "B007WTAJTO", "B004TXW2CS", "B006T9B6R2", "B009JD9XSO", "B002HGFKR8", "B0062EUE54", "B009QZH6JS", "B003Y8DIRC", "B007XZM6VG", "B00820ZVYU", "B005VFG06W", "B004WKRU7U", "B007PFQ0PC", "B005SPQ8XK", "B0037ECAQ8", "B009D79VH4", "B009QZH7BU", "B004Q3C98S", "B007NDL56A"], "buy_after_viewing": ["B009D79VH4", "B006T9B6R2", "B007PFQ0PC", "B0046TJG1U"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Memory Card Readers"]]}