{"asin": "B0052D38UO", "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS", "Trucking GPS"]], "description": "Introducing the exclusive extra-large 7&rdquo; GPS navigation device from Magellan. This easy-to-read GPS navigation device is perfectly at home in your car, yet designed for large vehicles such as SUVs, trucks and RVs. The panoramic, high-resolution 7&rdquo; WVGA screen makes viewing your map while driving quick and easy! This ultra-clear vibrant display lets you see where you are on your route with four times the detail found in a standard sized GPS device. The included Heavy Duty Extension Mount is extremely versatile and allows you to adjust the position of the RoadMate 9055 into the perfect viewing position in SUVs, trucks or RVs with deep dashboards.Nobody likes to be stuck in traffic. Enjoy subscription-free, lifetime traffic alerts at any time! The RoadMate 9055 provides you real-time traffic alerts and alternate routing to avoid delays while driving. Magellan has teamed up with the most trusted name in roadside assistance - AAA - to help should you find yourself broken down. The RoadMate 9055 comes with a specialized location screen that, with just a touch of a button, displays your location so you can direct help to you. The AAA roadside assistance phone number also is displayed.&nbsp;&nbsp;&nbsp;The Magellan RoadMate 9055 brings the best features of GPS navigators together with size and versatility.&nbsp; Its advanced features make it stand out from the rest. Plus, with preloaded maps of the 50 United States, Canada, and Puerto Rico, it is perfect for everyday commuting as well as traveling across country.&nbsp;FeaturesLarge, High-Resolution, 7&rdquo; ScreenThe expansive 7\" hi-resolution WVGA screen makes viewing your map easier.Bluetooth EnabledThe Bluetooth connection turns your GPS device into a hands-free speaker phone.&nbsp;&nbsp;&nbsp;Lifetime Traffic AlertsReal-time, subscription-free traffic updates, sent directly to your GPS unit, gives you up-to-date information on what is happening&nbsp; ahead.Audio/Video InputA/V input plays external video or back-up cameras.Exclusive OneTouch Favorites MenuEasily bookmark favorite destinations and searches with personalized bookmarks so you can find them anywhere you travel.Exclusive AAA TourBook GuideNo membership required. The Magellan-exclusive built-in AAA TourBook&reg; guide provides ratings and descriptions on AAA approved places to stay, play, dine, and save.Exclusive AAA Roadside AssistanceIf you should experience a breakdown, with the touch of a button, your location is displayed, enabling you to direct help to come assist you. The AAA roadside assistance phone number also is displayed.&nbsp;&nbsp;&nbsp;Highway Lane AssistRealistic highway signs point you in the right direction, when approaching interchanges and exits. Helps you choose the correct lane.QuickSpellEnter destinations with only a few touches. QuickSpell quickly narrows addresses and locations, making destination entry easy.Spoken Street Name GuidanceHear street names and directions for a clear understanding of when to make the next turn while you keep your eyes on the road.6 Million Points of Interest (POI)Make it easy to find gas stations, restaurants, ATMs, coffee shops, and much more.Highway Exit POI&nbsp;Find gas stations, hotels, restaurants, rest areas, and more upcoming along your route.Multi-Destination RoutingPlan your entire afternoon or driving trip with all your stops in one route. Lists in either order you want or for best efficiency.Premium MapsTravel the United States, Puerto Rico, and Canada with all the maps you need, pre-loaded on your device.What's In the BoxMagellan RoadMate 9055 GPS receiver; pre-loaded maps of United States, Canada, and Puerto Rico; extension windshield mount; vehicle power adapter; USB cable; and user handbook.", "title": "Magellan RoadMate 9055-LM GPS navigator", "price": 229.95, "imUrl": "http://ecx.images-amazon.com/images/I/51-xCF25nEL._SX300_.jpg", "brand": "Magellan", "related": {"also_bought": ["B005DSPLBC", "B004DF1E9E", "B003Z4TPPO", "B002YLO8Z6", "B002SNB420", "B005HJAB30", "B004J2P1FO", "B007TSESFO", "B005HH35EY", "B007RFI81Y", "B00AXV6H9E", "B0036AZA6A", "B0044KQHGS"], "bought_together": ["B005DSPLBC", "B004DF1E9E"], "buy_after_viewing": ["B005HH35EY", "B007TSESFO", "B003ZHVBQM", "B004I5BUSO"]}}