{"asin": "B005DIBFYE", "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS"]], "description": "Thanks to Garmin Guidance 3.0, FREE lifetime traffic&sup1; and map&sup2;  updates, advanced lane guidance and much more, n&uuml;vi 3490LMT provides the  most comprehensive navigation capabilities available. Andat just 9 mm,  it&rsquo;s also our thinnest navigator yet.Navigate by Touch or by VoiceWith its innovative speech recognition, you can control n&uuml;vi 3490LMT  with your voice &mdash; allowing you to keep both hands on the wheel. Simply  wake up n&uuml;vi with a customizable voice command and begin speaking menu  options that are clearly displayed on the screen. When you&rsquo;re stopped,  you can still control the n&uuml;vi using its 4.3-inch (10.92-cm) glass  touchscreen.Garmin Guidance 3.0allows you to quickly look up addresses and services and be guided to  your destination with voice-prompted, turn-by-turn directions that speak  street names. It comes preloaded with maps that feature 3-D landmarks  and terrain for North America. It also comes preloaded with more than 8  million points of interest (POIs) and offers the ability to add your  own.Avoid Traffic Tie-upsWith FREE lifetime traffic updates from Digital 3D Traffic,  our most extensive traffic avoidance system, n&uuml;vi 3490LMT can help you  avoid delays. Digital 3D Traffic provides updates every 30 seconds over  the HD Radio broadcasting system, so you can easily reroute around  congestion and arrive on time.Enjoy FREE Lifetime Map UpdatesWith FREE lifetime map updates, you always have the most up-to-date  maps, POIs and navigation information available at your fingertips. Map  updates are available for download up to 4 times a year with no  subscription or update fees and no expiration dates.Know the Lane Before It&rsquo;s Too LateNow there&rsquo;s no more guessing which lane you need to be in to make anupcoming turn. Available in select metropolitan areas, photoReal&nbsp; junction view makes unfamiliar intersections and exits easy to navigate.  When you approach an exit or interchange, n&uuml;vi 3490LMT will enter split  screen mode and show you a realistic depiction of junctions on your  route, complete with road signs and arrows that indicate the proper lane  for navigation. Bird's Eye junction view also is included for a  top-down look at upcoming interchanges.Go Beyond NavigationPoint-to-point navigation is just the beginning. n&uuml;vi 3490LMT features a microSD&trade; card slot so you can store and use detailedcityXplorer&trade;maps or download custom voices and vehicles for free from theGarmin GarageIt also comes with a powered mount that charges while you drive while  dual-orientation functionality lets you hold n&uuml;vi vertically or  horizontally for added convenience driving or walking. And for added  convenience and safety, built-in Bluetooth&reg; connectivity lets you make  and take hands-free calls and texts.n&uuml;vi 3490LMT&rsquo;s  \"Where Am I?\" emergency locator provides your exact  latitude and longitude coordinates, the nearest address andintersection, and the closest hospitals, police stations and more. And  Enhanced Exit Services tells you what services you&rsquo;re approaching on the  highway.What's in the Box:n&uuml;vi 3490LMTPreloaded City Navigator&reg; NT North America (U.S., Canada and Mexico)Lifetime maps&sup1; and traffic&sup2; (indicated by \"LMT\" after model number on the box)Digital 3D traffic receiver with vehicle power cable (vehicle power cable is traffic receiver)Quick release powered mount&sup3;USB cableQuick start manual&sup1;FREE lifetime traffic updates may not be transferred to another  person or another Garmin product. Lifetime traffic extends for the  useful life of your Garmin traffic receiver (as long as you own a  compatible Garmin GPS) or as long as Garmin receives traffic data from  its traffic supplier, whichever is shorter. Traffic content not  available for all areas. Seetraffic coverage areasandProgram License Agreementfor complete terms and conditions.&sup2;FREE lifetime map updates entitle you to receive up to 4 map  data updates per year, when and as such updates are made available on  the Garmin website, for this specific Garmin product only until this  product&rsquo;s useful life expires or Garmin no longer receives map data from  its third party supplier, whichever is shorter. The updates you receive  will be updates to the same geographic map data originally included  with your Garmin product when originally purchased. Garmin may terminate  your lifetime map updates at any time if you violate any of the terms  of the End User License Agreement accompanying your n&uuml;vi product.", "title": "Garmin n&uuml;vi 3490LMT 4.3-Inch Portable GPS Navigator with Lifetime Maps and Traffic (Discontinued by Manufacturer)", "price": 144.95, "imUrl": "http://ecx.images-amazon.com/images/I/41MrEPAB0bL._SX300_.jpg", "brand": "Garmin", "related": {"also_bought": ["B003N6UINC", "B00EDT9DQG", "B003NEPHAI", "B002VPE21A", "B002OL2MU4", "B00INXAY9S", "B008VVVCPW", "B005HN1UI6", "B00INXAIDK", "B007RMAS1K", "B009537IPI", "B002I05VRC", "B00BCPYPVC", "B003VKXI14", "B009KB8H82", "B00INXADT4", "B00INXAKTC", "B0035JL4V2", "B007VOOS1U", "B00BB2NMJC", "B005W7MN0G", "B000AKX15G", "B001XUQPJQ", "B001S2RCWI", "B00B5TELRI", "B00BGKQHQ4", "B005W7OBT2", "B00HSJN6H0", "B004I5BUSO", "B005HN1UIG", "B003CLYMSU", "B00CRQUKQ4", "B0015A6YN6", "B000BS2V44", "B000LRMS66", "B004HYGEOQ", "B00200K1TS", "B00JZ935TA", "B00BXQ0370", "B0086CTL5Y", "B006SOLITY", "B0085EG6OW", "B00IA2RXUU", "B003RQBKLC", "B000BM8RFM", "B000BPSW7C", "B009QZH7BU"], "bought_together": ["B002OL2MU4"], "buy_after_viewing": ["B00AXX0I88", "B002OL2MU4", "B005DIBHA6", "B004I5BUSO"]}}