{"asin": "B000II6YEA", "description": "From the ManufacturerHarmony 1000: The Power User's Universal RemoteThe essential center of your entertainment system. Say &quot;Goodbye&quot; to the wasted time and endless frustration of multiple remotes controlling multiple devices, and say hello to one single, easy-to-use device with a cool new shape. The Harmony 1000 remote control, with its engaging and logical interface, simplifies even the most complex programming functions. Logitech's patented Smart State technology&reg; makes it possible to seamlessly control up to 15 separate components with just one touch. Programming your HDTV? The Harmony 1000's color display makes it easy to control even the aspect ratio and sound modes. And, you can do it all without direct line-of-sight, since the Harmony sends both infrared (IR) and radio frequency (RF).1. Easy to set up:Just connect your Harmony remote to your computer and the Web wizard walks you step-by-step through a simple set up. Enter in your model numbers for your components, then answer a few easy questions about how you &quot;Watch TV&quot; or &quot;Watch a DVD&quot; You'll be controlling even the most complex system without any of the hassles of elaborate macro-programming.2. Easy to use:The Harmony Remote is the world's only remote with Smart State Technology&reg; activity control. Just press one of the Activity buttons, such as &quot;Watch TV&quot; or &quot;Listen to Music,&quot; and your Harmony Remote automatically sets up your entertainment system, without you ever having to program a &quot;macro.&quot;3. Easy to get help:With the Harmony remote, you don't have to know anything about your entertainment system to operate it. No sound? No picture? No problem! There's even a handy &quot;HELP&quot; button to guide you through simple troubleshooting and get you back in control.4.&nbsp;Never out of date:&nbsp;The Harmony Remote device database is constantly updated with new components and fine-tuned settings.&nbsp; Simply connect it to your computer using its USB interface, and your remote is updated automatically!&nbsp;See It For YourselfTake a product tour[Flash]Learn how easy it is to get a Harmony remote to work with devices that make up your home entertainment system. By selecting this link, you can take a product tour of the device's capabilities, as well as seeing just how easy it is to set up the Harmony 1000 for your particular home system.Features&nbsp;&nbsp;One-touch activity controlsSimply touch one icon and the Harmony remote will power on all the necessary components.&nbsp;Easy-to-use 3.5&rdquo; touch screenLarge, color icons and backlit buttons&nbsp;ensure an entirely new level of ease and functionality.&nbsp;Computer-based set-upSimply connect the Harmony 1000 to your computer, and the wizard guides you through the entire set-up process.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;RechargeableNo need to worry about&nbsp;power with the rechargeable Lithium-ion battery. The handy recharging stand ensures that the unit is always powered up and easy to find.&nbsp;World's largest A/V control databaseYour Harmony 1000 will control everything from HDTVs to PVR/DVRs, from laser discs to VCRs&mdash;even lighting controls! Logitech's online database now includes 4500+ brands and 150,000+ IR devices &mdash; and the list is growing every day.&nbsp;Control of devices through cabinets, walls, and floorsWith a wireless range of 100 feet, the Harmony&nbsp;RF Wireless Extender (sold separately) allows control of devices&nbsp;without a line of sight.Get the Logitech Harmony Adapter for PLAYSTATION 3. Finally, control movies on your PS3 &mdash; drama free.Wish you could control all your movies, music, games and entertainment gear &mdash; including your PLAYSTATION 3 &mdash; with one remote? Wish granted.Add one touch PS3 control to any Harmony remote with the new Logitech Harmony Adapter for PLAYSTATION 3. Now your entire entertainment system and every PS3 command is at your fingertips. Want to watch a DVD or Blue-ray Disc movie? Play a game? Turn the console on or off? Easy. Just press one button on the remote to experience instant entertainment gratification.System RequirementsFor Windows&reg; systems:Microsoft Windows 2000, ME, or XP, USB port, CD-ROM drive, Internet access.For Macintosh&reg; systems:Mac OS X 10.3 or later, USB port, CD-ROM drive, Internet access.What's In The BoxLogitech&reg; Harmony&reg; 1000 remote control, charging station, USB cable, AC Adapter, Lithium-ion battery, Installation CD, Installation guide, 1-year warranty.", "title": "Logitech Harmony 1000 Advanced Universal Remote (Silver) (Discontinued by Manufacturer)", "price": 321.73, "imUrl": "http://ecx.images-amazon.com/images/I/51Un8N9oGwL._SY300_.jpg", "related": {"also_bought": ["B000ILIHTC", "B003LZ4LBK", "B001M5U5AC", "B002TJ00FU", "B00267S7XW", "B000JJYJMM", "B00FHQH97O", "B00E4JEDWE", "B005H3AU1Y", "B000J43HJ8", "B00023KG40", "B002ZG98NC", "B005EZTUMU"], "bought_together": ["B000ILIHTC", "B00267S7XW"], "buy_after_viewing": ["B004OVECU0", "B003LZ4LBK", "B00BQ5RYI4", "B00BQ5RYI4", "B001M5U5AC"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Remote Controls", "TV Remote Controls"]]}