{"asin": "B000CRFI8A", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Network Adapters", "USB Network Adapters"]], "description": "Amazon.com Product Description Are you tired of running wires through your house to keep your computers networked and connected to the Internet? Have you recently purchased a wireless data card only to discover that you have to open up your computer to install it? Don't worry, help has arrived. With the Linksys WUSB54GC Compact Wireless-G USB Adapter, you won't need power drills or screwdrivers to connect to the Web anymore.The Linksys WUSB54GC Compact Wireless-G USB Adapter converts a USB port into a 54 Mbps Wi-Fi connection.All you'll need is an available USB slot. You simply plug the adapter into your USB port, and immediately you'll be connected to your wireless network. It can't get much simpler than this.By incorporating USB 2.0 and Wireless-G protocols, the Linksys WUSB54GC can immediately begin delivering data rates up to 54 Mbps (five times as fast as 802.11b) without the trouble of running wires or opening up the case of your desktop computer. To install the adapter, you simply plug it into any available USB port. (It's compatible with both USB 1.1 and 2.0 ports, but 2.0 will yield the fastest speeds.) You can plug it directly into your PC, or you can use the included USB extension cord to put the adapter anywhere you'd like, up to five feet away.Because the adapter gets its power through the USB connection, no power cord is necessary. The included setup wizard walks you through configuring the adapter to your wireless network settings, step by step. The Linksys WUSB54GC lets you put your computer almost anywhere in the building, as long as you have a wireless signal to connect to.Once you're connected, you can keep in touch via e-mail, access the Internet, use instant messaging to chat with friends, and share files and other resources such as printers and hard disk storage space with other computers on the network. You'll also be able to connect with any of the growing number of public hotspots springing up in coffee shops, airport lounges, hotels, and convention centers.The new push-button setup feature makes it easy to configure your wireless devices. Just push the button on the access point and on your other enabled wireless device to automatically create a safe connection, protected by the industrial-strength security of Wireless Protected Access (WPA) and 128-bit encryption. This means that your data stays secure.What's in the BoxWUSB54GC USB adapter, USB extension cable, setup wizard CD-ROM, user's guide on CD-ROM, and quick installation guide.", "title": "Cisco-Linksys WUSB54GC Compact Wireless-G USB Adapter", "price": 23.88, "imUrl": "http://ecx.images-amazon.com/images/I/31XNW87T0ML._SX300_.jpg", "brand": "Linksys", "related": {"also_bought": ["B0002HA7FY", "1849515581", "B0054YQOM0", "B00009X6PH", "B0009N544A", "B000HS3O2G", "B0054YQO5C", "B003O3C1OS"], "bought_together": ["B0002HA7FY"], "buy_after_viewing": ["B0054YQOM0", "B002SZEOLG", "B007ZLGXA8", "B000W8UIZW"]}}