{"asin": "B0006OH4WC", "description": "j/fit Foam Roller Comparisonj/fit Foam Roller ComparisonBasicHalf RoundSuper High DensityHigh Density Half RoundHigh Density EVATextured High Density EVADeluxe Myo Body RollerTypeBasic low density extruded foam. 100% medical grade foam made in the USABasic low density extruded&nbsp;foamBlack High Density injection molded foam beads. 100% medical grade foamBlack High Density injection molded foam beadsBlue closed cell heat molded EVA foamGreen closed cell heat molded EVA foam with honeycomb texturedDark Grey closed cell heat molded EVA foam with massaging bumpsFeelMedium density and feelMedium density and feelVery FirmVery FirmFirm Core with slightly softer exteriorFirm core with a slighly softer exterior. Best overall feel for all body typesFirm feel with finger size bumps for deeper massageUser TypeBest for beginner or lightweight, single user. Produces less pressure and less painElderly or persons with limited strength or muscle toneModerate to heavier weight user with some rolling experience or users with desire for very firm feelModerate to heavier weight persons with limited strength and balance issues and elderly users with little muscle toneAll user types that prefer more pressure than the Basic but less firmness than the Super High Density. Will withstand the heaviest weight individual and multiple users in a professional settingSame user as the High Density EVA, but better for individuals that wish to have a slight texture to the roller. Honeycomb texture adds a little traction for a slower roll and a slight massaging effectThe myo roller will help assist in a deeper myofascial release. Small knobs on the roller will get deeper into the tissue and help work out stubborn knots and tightnessDurabilityMediumMediumHighHighCommercial-GradeHighHighUsed ForLimit soreness and tightness by increasing blood flow and flexibility. When used often and correctly, the foam roller can help athletes avoid many sport-related injuries. Increase flexibility or range of motion, relieve muscle and joint pain.Helps increase balance and stabilization while standing on roller. Lying on the foam will help relieve tension in tight areas. Will not roll out from underneath.Very firm roller should be used by individuals already using rolling techniques. Works well for larger or heavily muscled athletes Firmness puts more pressure on tight areas.Helps proprioception after knee and ankle injury. Helps increase balance and stabilization while standing on roller. Will not roll out from underneath. Lying on foam will help relieve tension in tight areas.36\"- Great for pilates practice, and placing roller parallel to spine to help create proper alignment and opening up tense shoulders and upper body.&nbsp;&nbsp;24\"- Best used for rolling the back and easier to manipulate than the longer rollers.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;18\"- Often used by runners to help alleviate tightness in the IT band, calf muscles,and hamstrings.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;12\"- Perfect for travel. Allows you to work smaller regions or isolate certain muscle groups.The slight texture on this roller allows for better traction and will not slip as easily as other foam rollers. The honeycomb texture also gives a slight massaging effect for better overall feel. Foam roller gives temporary relief of the appearance of cellulite.Applies more direct pressure to knotty areas to give a more intense stretch. The combination of the finger nodules and firm surface provide a great deep tissue massage. It also allows a better surface for applying targeted pressure on specific&nbsp;knotted&nbsp;areas which helps facilitate a myofascial release.", "title": "j/fit High Density EVA Roller", "imUrl": "http://ecx.images-amazon.com/images/I/31GfiMP%2BvKL._SX300_.jpg", "related": {"also_bought": ["1569759251", "0984372490", "B00B8MHAE8", "0984372423", "B00065X222", "0984372431", "B008DQCDRQ", "B00APDFOSA", "B00CBNDNOO", "0977977900", "B0002J58HY", "B00ICUVZQ8", "B00GTLOUDM", "B00HTBPQ2A", "B00H2Q6HJ8", "B000VDTEDA", "B0055QGHJC", "B0065PJXLQ", "B0054MQUHQ", "B000W09NYM", "B004JBT2FU", "B00ESA8JY2", "B001ANL2WQ", "B00JGJRJ64", "B000PRMCJU", "B0062YQN4U", "B008NEFDKC", "B00HLC5T7E", "B00JBJAQ7I", "B00AQ4F19K", "B006JANLIS", "B00DOBUZ66", "B00AHO1U4O", "B004X83FZM", "B004NYEEYW", "B002QEY6NK", "B00E4YWE9S", "B008SDJNPY", "B001G0N70I", "B001E3DMXY", "B0007IS6ZG", "0987650416", "7245456313", "B001G6I72A", "B00BXAM6BW", "B00DEBRRSA", "B0008KLAB0", "0761128689", "B00A3Q46LA", "B000QIOJ58", "B000O5MYIC", "B003170FMW", "B0026I2SBS", "B00BWGWG0S", "B00BOM2JNY", "B00FIUITDM", "B002MGD15Q", "B0029NYQRY"], "also_viewed": ["B0026I2SBS", "B00ARJR796", "B00C4INZHG", "B008DQCDRQ", "B00APDFOSA", "B00IZC5DKW", "B00BI6G3VK", "B00D62V828", "B0008KLAB0", "B00H2Q6HJ8", "B00B8MHAE8", "B0055QGHJC", "B00BI748PM", "B00CC3TUSG", "B00FXHSLRE", "B00DMTPKAG", "B00FQRUJPS", "B00DU3DF1A", "B00DL7BH0Q", "B00ESA8JY2", "B002ONUM0E", "B00H2Q6HU2", "B00JS9O4B0", "B0026I0TYG", "B00DMTBH58", "B00IVQFD8O", "B00GDGKGIQ", "B00AR1PNSQ", "B00HTBPQ2A", "B00HLC5T7E", "B001ANL2WQ", "B00IWWGFVQ", "B00AFRS5W8", "B00IXYPQR2", "B000HLLREA", "B002C9MSAC", "B00DNH6KNI", "B009SERB10", "B001FXYYIU", "B003RP3VZQ", "B004JOENI8", "B001MPU106", "B00LPOD05M", "B00ED3GIV0", "B00EQ1TVBS", "B006TFKKYQ", "1569759251", "B00IWWGHVE", "B000AS4BPC", "B001Q5TUP4", "B00ASGEKQG", "B00KAEJ3W2", "B00A8O6Q7Y", "B0052Y30L0", "B00068449E", "B008NEFDKC", "B001FXX02Q", "B0043X2E7W"], "bought_together": ["1569759251", "B00065X222"]}, "salesRank": {"Sports &amp; Outdoors": 892}, "categories": [["Sports & Outdoors", "Exercise & Fitness", "Balance Trainers", "Foam Rollers"]]}