{"asin": "B00CGWNK2U", "categories": [["Electronics", "Computers & Accessories", "Laptop & Netbook Computer Accessories", "Bags & Cases", "Backpacks"]], "description": "Targus Bex Backpack15.6\" Bex BackpackFor the Young, Mobile ProfessionalWhat we carry is just as important as what we wear. Form is important, but function is just as critical. The Bex Backpack is designed specifically for the professional woman on-the-go who is looking for a bag with sophisticated style and sporty finishes. This lightweight backpack offers a dedicated laptop compartment as well as a spacious and colorful main compartment to maximize versatility. From the home to the office and everywhere in between, be ready to take on whatever comes your way.Store Your Digital LifeLooking  for a bag that can handle your active digital lifestyle? This roomy backpack  features a discreet padded laptop compartment that protects your 15.6-inch laptop as well as gives you quick and easy access without having to open the  entire bag. A large, colorful main compartment makes the Bex incredibly  versatile and is perfect for storing books, binders, or just a change of  clothes for the gym. And let's not forget the little things&mdash;there's a zippered  front compartment that&rsquo;s perfect for storing an assortment accessories such as  pens, business cards, flash drives, and more. You can even carry your iPad&reg;,  tablet or eReader safely thanks to its own dedicated pocket. The spacious main  compartment features a drawstring closure and clasping hood, making it easy to  add or remove your gear and keep it secure. The hood's expandable snaps easily  pop open when your bag is full so that it still closes securely over the main  compartment.open, spacious main compartmentstore your tablet and mobile must-haves15.6-inch laptop comartmentStyle Meets DurabilityThe  Bex Backpack has been built to last. The bag features durable material that's  lightweight and soft to the touch. Its exterior is also water-resistant to help  keep moisture away from documents and sensitive electronics stored inside. When  you're in a hurry, utilize the two easy-access side pockets for water bottles, a  smartphone or other small accessories. Color accents and stitch patterns on the  exterior of the bag add color and panache.easy-access  pocketsside water bottle pocketscolorful accentsCarry in ComfortThe  Bex is designed to keep you organized, no matter what your day has in store.  Because its laptop compartment is out of the way, there's no laptop separators  commonly found in other laptop bags. This give you the freedom to use the Bex  like a regular backpack for that quick trip to the gym. Plus, the Bex  Backpack comes with the Targus Limited Lifetime Warranty,  which  provides you with the assurance that your backpack will be repaired or replaced  should anything go wrong with its structure.discreet padded laptop compartment is out of the wayadjustable shoulder strapslimited lifetime warranty", "title": "Targus Bex Backpack for 16-Inch Laptops with Dedicated Tablet Compartment, Drawstring Closure and Hood (TSB781US)", "price": 35.96, "imUrl": "http://ecx.images-amazon.com/images/I/41uFFlFUgPL._SY300_.jpg", "brand": "Targus", "related": {"also_viewed": ["B006NNWZSI", "B00CGWNKVQ", "B00BZC0LLA", "B0077AOALQ", "B00CGWNCGE", "B00C6RL9AU", "B004UBU42Y", "B0029L9YHI", "B0001H27PS", "B007TIYYNU", "B00024ENVG", "B0081U0628", "B008SKMVHY", "B0021AFMPK", "B004UBULPO", "B0057V9HPQ", "B005YQY5TM", "B004YIFKRM", "B001GT4AA0", "B002LF2PQO", "B00BW0QCBS", "B001OC5JKY", "B005YQY3AS", "B004Z5363O", "B004AM624C", "B007GNN0AG", "B001586UI2", "B00HXAV7KM", "B00IOHKIKS", "B00BW0QC72", "B003WU6KFO", "B00EEBS9O0", "B001BHQSCK", "B00507NAYQ", "B00CLFSOS2", "B00007LTAI", "B00EKG4GCS", "B007GNN0HE", "B000EZYKMA", "B002J9HBSE", "B003WUBM3O", "B00BMJRLM8", "B00005T3H5", "B002WOD824", "B004VD7IXE", "B007RAP5XI", "B00EEBS25Q", "B003VAK8H6", "B00EP5EV1U", "B00GX9AMWS", "B00BHDX6XM", "B008RY6W1C", "B0055YB5IC", "B007FQNLVM", "B00EKG4OU2", "B00BPNJVW4", "B000X4SRPS", "B0024IGH3A"], "buy_after_viewing": ["B006NNWZSI", "B003WUBM3O", "B008HY60AA", "B000H94PDW"]}}