{"asin": "B003ZUXVQM", "description": "The Magellan RoadMate 3030-LM offers all the extras, an exclusive ultra-wide 4.7-inch touch screen (17% larger than the standard 4.3-inch screen), free lifetime map updates, highway lane assist, OneTouch favorites and Built-in AAA TourBook. The item also includes a USB cable.Get free map updates! The RoadMate 3030-LM includes free map updates for the life of the navigator. Never again worry about finding the restaurant in a new part of town or locating the new parking garage. You will always have the latest available maps.Personalize your travel experience with the OneTouch menu of your favorite places and searches. Bookmark your favorite coffee shop, restaurant, gas station, or bank to find the nearest location, anywhere you travel!Premium built-in maps of the United States, Canada, and Puerto Rico make this perfect for travel across the country or everyday commuting.Perfect for road trips or just finding new places in town! Travel in style with the Magellan RoadMate 3030-LM, an easy-to-use premium navigator packed with features!RoadMate 3030-LM FeaturesExclusive OneTouch Favorites MenuEasily bookmark favorite destinations and searches with personalized bookmarks so you can find them anywhere you travel. Find your favorite caf&eacute; or restaurant in any city with a single touch.Free Lifetime Map UpdatesReceive up to four map updates per year, for the life of the GPS navigator. No extra cost!Lifetime Maps entitles you to receive up to four (4) map data updates per year, for the life of the GPS receiver or until Magellan no longer receives relevant map data. Visit MagellanGPS.com for complete details.Exclusive AAA TourBook GuideNo membership required&hellip; The Magellan-exclusive built-in AAA TourBook guide provides ratings and descriptions on AAA approved places to stay, play, dine, and save.Highway Lane AssistRealistic highway signs point you in the right direction, when approaching interchanges and exits, to ensure that you&rsquo;ll choose the correct lane.4.7-Inch Touch ScreenThe extra-large 4.7-inch touch screen is ideal for any vehicle at 17% larger than a standard 4.3-inch product.6 Million Points of Interest (POI)Gas stations, restaurants, hotels, ATMs, and millions of other destinations are searchable from the huge POI database.Highway Exit POI SearchSearch for gas stations, restaurants, hotels, and more near upcoming highway exits.QuickSpell with SmartCity SearchEnter destinations with only a few touches. QuickSpell quickly narrows addresses and locations, making destination entry easy.Multi-destination RoutingPlan a trip with multiple stops in the order you want or will optimize it for the most efficient route.Spoken Street Name GuidanceHear street names and directions for a clear understanding of when to make the next turn while you keep your eyes on the road.&nbsp;Premium MapsTravel the United States, Puerto Rico, and Canada with all the maps you need, pre-loaded on your device.What's in the BoxMagellan RoadMate 3030-LM GPS Receiver; Preloaded Maps of the United States, Canada, and Puerto Rico; Windshield Mount; Vehicle Power Adapter; User Manualand and includes a USB cable.", "title": "Magellan RoadMate 3030LM 4.7-Inch Portable GPS Navigator (Lifetime Map Updates Included)", "price": 169.99, "imUrl": "http://ecx.images-amazon.com/images/I/51POx5RRFaL._SY300_.jpg", "related": {"also_bought": ["B0037N6W0O", "B0049PVE84", "B002IKKFIC", "B002IKKFJ6", "B002I007IA", "B00BB2NLVQ", "B009OMOK7O", "B001EPX7N2", "B006YX90RQ", "B002AUJHLG", "B004I5BUSO", "B00BAO9ZLA", "B003ZHVBQM"], "bought_together": ["B0037N6W0O", "B002IKKFIC"], "buy_after_viewing": ["B003ZHVBQM", "B004I5BUSO", "B0057OCDQS", "B0037N6W0O"]}, "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS", "Trucking GPS"]]}