{"asin": "B0007TJ5AK", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "With a host of new features and a unique \"perpetual curve\" contoured design, the brushed stainless steel titanium grey 7.1-megapixel PowerShot SD500 continues the PowerShot tradition of pushing compact camera design into new territories.Driven by the same DIGIC II image processing architecture that propels Canon's EOS-1 pro-series digital SLR cameras, the camera features a 3.0x optical zoom, large 2.0-inch LCD, high-quality VGA video clips at 30 frames per second up to the capacity of the memory card, high-speed USB 2.0 connection, 'My Color' in-camera color editing, and a Print/Share button for easy PictBridge direct printing and fast file uploads. Its 7.1-megapixel sensor allows detailed enlargements up to 15 x 20 inches.New DesignWhile still referencing original PowerShot designer Yasushi Shiotani's 'box and circle' concept, the PowerShot SD500 design represents a departure from the traditional rectangular PowerShot. The silky finish and distinctive curves are designed to feel great in the hand, while rounded contours exaggerate an already slender body, 8% lighter than the previous top-of-range PowerShot SD500.The large 2.0-inch LCD screen features a QuickBright function that takes the screen temporarily to maximum brightness for improved visibility when shooting outdoors. A Night Display option improves LCD visibility for composition and framing in low light conditions. A sophisticated mode dial replaces the mode switch of previous models.Blistering PerformanceTrusted by professional photographers and agencies such as Getty Images for its outstanding image rendering ability, DIGIC II assures superb image quality through improved colour gradation and white balance accuracy.DIGIC II also delivers instant 0.8 second start-up time, uninterrupted 2.0 frame per second shooting until the memory card fills, and the new USB 2.0 high-speed interface for fast uploads. Processing power also supports a new high-speed image playback function, image jump function (with search facility) during in-camera review, fast image rotation, and increased card writing speed. Auto focus speed is 55% faster than its predecessor, thanks to a more compact, redesigned 37-111mm zoom lens and its new rear focusing system, combined with DIGIC II processing.Shooting FeaturesTo increase shoot-and-share enjoyment, a Hold function now allows users to extend indefinitely the display of a newly shot image, and to delete it immediately if necessary without the requirement to switch to replay mode. The camera returns to shooting immediately when the shutter button is pressed again. A new My Colors menu gives users pre-capture control over image colors in stills and movies. Nine sophisticated color-editing features include Color Accent, which gives users the ability to convert all but one chosen color of an image to monochrome. Other My Colors functions allow favorite colors to be made more vivid and colors to be swapped--a feature designed for creative or fun purposes as well as practical applications, such as product design or interior decoration planning. Users can choose to save 2 copies of the image--with and without an effect applied.For maximum versatility and ease of use, the PowerShot SD500 has a total of 13 shooting modes. These include Auto, Manual (allowing more experienced or adventurous users to take control of settings such as white balance, exposure compensation and shutter speed, which extend from 15 seconds to 1/2000 second), and stitch assist for creating panoramas. 9 Special Scene modes include portrait, snow, and beach modes for simple set-up in popular shooting situations. A new more powerful flash features 6 modes and has a range of up to 4.8 meters at ISO Auto.New movie featuresThe PowerShot SD500 incorporates a number of new advanced video features. Digital zoom is now available while shooting video and users can record up to one minute at 60 frames per second (fps) for smooth in-camera slow motion playback. Control over slow motion improves with more sensitive, five speed level adjustment, while white balance and exposure adjusts automatically when zooming during video capture. For recording clips suitable for email attachment, a &#x91;Compact' mode provides for recording up to 3 minutes of 15 fps, 160 x 120 resolution files.ErgonomicsDespite successfully decreasing the size of the viewfinder, Canon's engineers have maintained a 16mm eye relief, perfect for prescription eyeglass wearers. The Intelligent Orientation Sensor not only rotates automatically images taken with the camera held vertically, it also improves auto white balance, auto focus and auto exposure by helping the Camera's iSAPS 'built-in photographer's assistant' to take into account likely positions of sky and foreground.Extending CreativityAn optional waterproof case allows users to capture exciting marine life stills and video down to 40 meters. The case includes a diffusion plate to counter the 'snow' effect produced by particles suspended in the water, and a double glass lens to prevent fogging. Optional buoyancy compensation weights prevent the camera from pulling to the surface during scuba or skin diving. A new optional High Power Flash accessory, the HF-DC1, further extends the options for night and indoor shooting. With a guide number of 18 (ISO 100, meters), the slave flash automatically fires in-sync with the camera's in-built flash, ignoring any pre-flash. It can be adjusted to three power output settings based on the aperture value of the camera. The unit attaches to the camera with a supplied bracket that maintains the ability to mount both camera and flash on a tripod.Print and ShareFor photo prints without first uploading to a computer, the PowerShot SD500 supports full PictBridge functionality. When coupled with DIGIC II compact photo printers such as Canon's new Compact Photo Printer Selphy CP600, the camera/printer combination is capable of producing borderless photo prints in just 63 seconds. Wide (100 x 200mm) format landscape printing is also supported with these printers, images being automatically cropped to fit the wide format direct from the camera. Functions such as ID photo print, N-Up (Multi-image) printing, and movie clip series printing are also supported. One-touch upload is available via the print/share button and now supports direct transfer to both Windows and Mac platforms.Software and access to Canon iMAGE Gateway Software supplied includes ZoomBrowser EX (Windows) and ImageBrowser (Mac) for viewing, managing, and archiving images. Other software includes PhotoStitch and PhotoRecord, plus photo manipulation software ArcSoft PhotoStudio. Drivers include TWAIN (Windows 98/2000) and WIA (Windows Me). Picture Transfer Protocol (PTP) support allows the camera to connect to any Windows XP (SP1-2) and Mac OS X (v10.1.5-10.3) system without the requirement for a driver installation.Camera ownership entitles the purchaser to register for 100MB storage space on the Canon iMAGE Gateway, an online gallery where images and movies can be stored in albums and shared to selected friends and family. New My Camera functions (such as shutter sounds and start up images) can also be downloaded to the camera from Canon iMAGE Gateway.", "title": "Canon Powershot SD500 7.1MP Digital Elph Camera with 3x Optical Zoom", "price": 9.99, "salesRank": {"Camera &amp; Photo": 9291}, "imUrl": "http://ecx.images-amazon.com/images/I/51EP4NBXSCL._SY300_.jpg", "related": {"also_viewed": ["B000NK8EWI", "B001SER492", "B000NK6J6Q", "B00BERFUAS", "B001SER48S", "B000AYKUUQ", "B000EN0K94", "B000AYGDIO", "B0050051QI", "B000ENPDSW", "B0011ZCDKS", "B00I58M192", "B0075SUJ4W", "B006UMM15O", "B002CVTU10", "B00I58LZRG", "B000EMWBT2", "B00HLDFNKQ", "B00B5HE3YG", "B0000BV1LG", "B0001G6U5W", "B00HLDFPA4", "B000Q30420", "B006UMM1J0", "B0075SUHQC", "B00IA9LMNW", "B000NK6INU", "B002LITT3S", "B0001656FW", "B000EVLS4C", "B004M8SVFM", "B0007TJ5OG", "B001SER47O", "B000NK3H4S", "B000V1VG4W", "B001SER46A", "B000NK3NBA", "B004HW73S4", "B006K554Z0", "B0073HSHJY", "B00AWYN0BU", "B004J3ZV62", "B00B5HE3AK", "B005II5OLY", "B003WJR69E", "B0090SLJ1C", "B00DCY2E4Q", "B00CDIK48U", "B000HARTYI", "B000N49WPW", "B0076W0LNQ", "B000AYJDD6", "B0075SUJBA", "B004J3VAYO", "B0011ZK6PC"], "buy_after_viewing": ["B0001656FW", "B009B0MYSQ", "B000FGNM6I", "B00B5HE3UU"]}}