{"asin": "B002AR5XIK", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories"]], "description": "Music on the RoadTraveling with music is a great way to make a long trip go by quick, but radio stations do not always play your favorites. Taking along CDs allows you to play what you want, but fumbling through discs while you drive is not safe, and carrying a larrge number of discs can be awkward. Carrying personal media devices such as an iPod is a great way to take your music with you, but these devices are meant for a single user with headphones, how will your friends hear what is being played?Driving Tunes for EveryoneMany of today's automobiles have an aux input on the front of the stock audio system, these can also be found on many aftermarket systems as well. Utilizing this connection to play your favorite music from your iPod, iPhone, Android phone, or MP3 player is a great way to listen to your music.The iCable 800 is specifically designed to take advantage of the convenient 1/8\" jack on your car's audio system. Unlike cassette or FM adaptors which can induce noise, the direct connection of the iCable 800 provides the best sound quality for all of your music.To enhance your enjoyment, the iCable 800 features XLN (Extra Low Noise) construction, outside RF and EM noise combined with a solid connection ensure the best sound and experience possible.. your music will sound crisp and clear...Convenient OperationWith a thin design the iCable 800 provides hassle-free connection and will not interfere with your driving as bulky cables designed for home systems do. Connection from your iPod or other MP3 players is quick, easy, and hassle-free.So go ahead, get in, start'er up, crack up the tunes, and crusie on down the road....", "title": "Monster iCable 800 MP3 Player to Auxiliary Input Cord (3 Feet)", "price": 9.95, "imUrl": "http://ecx.images-amazon.com/images/I/31aUuIbkRtL._SY300_.jpg", "brand": "Monster", "related": {"also_bought": ["B008EQTI1E", "B006DU6NN4", "B008DOAPKU", "B000068IH5", "B002E9HHYM", "B000V8WO1O", "B00CHR46JA", "B000Y99KSU", "B000A6V7MY", "B007G4O5IG", "B008MF40AQ", "B008DOA9HO", "B005HH32Q0", "B00004Z5IE", "B000V7ETRM", "B008LCYIHK", "B0080Q0HUE", "B0097BEFYA", "B004YEBK66", "B003CK70VC", "B002CA19W4", "B007QIXSVM", "B002DW92IE", "B009SYZ8OC", "B008LCYIIO", "B00HG1L334", "B00K4DTTLY", "B008BQ1Y8M", "B007TD1WIK", "B00G5K3B46", "B00CJLEHPM", "B00FYNSCGW", "B00BCOHYNO", "B0081ZBNI4", "B006SU0SX0", "B00ACCQMXK", "B003VGUGBS", "B000NPT5YE", "B00B2A1OD4", "B00H1YPYLS", "B004LTEUDO", "B00566E8DI"], "bought_together": ["B008EQTI1E"], "buy_after_viewing": ["B004LTEUDO", "B00HG1L334", "B003CK70VC", "B008LCYII4"]}}