{"asin": "B0000A1G05", "related": {"also_bought": ["B00004ZCJK", "B0010CDWIY", "B00004ZCFQ", "B009B0MZ8U", "B0040JHVCC", "B00007E7JU", "B0049XGNKK", "B00DMS0GTC", "B00603S04E", "B001KELVS0", "B001G5ZTLS", "B002ZIMEMW", "B007SXJ13E", "B0013DG08E", "B0000BZL8H", "B001CCAISE", "B00BW6LW7G", "B0079M711S", "B00007GQLU", "B00009XVCZ", "B004TJ6JH6", "B002WE4H8I", "B000053HH5", "B001KN766W", "B007FGYZFI", "B00JQ4HZPO", "B00603RZ9K", "B006Y0YZZ6", "B00FP1BQ1Q", "B00BCEJ0E0", "B0080JH3YE", "B00DZ0SMY8", "B003TYDBYQ", "B002K3Z3E8", "B00AW6HB7C", "B00603RV9O", "B00I4A75P6", "B00BXA7N6A", "B0059AK8HQ", "B00004ZCJI", "B001UE6N88", "B0014Z3XMC", "B007M54E1M", "B002VPE1WK", "B00GUQJZCW", "B0009R3IJY", "B0083WYE0E", "B005AY9278", "B00005K47X", "B002NEGTTW", "B00AWRE6CY", "B00006I53W", "B0041MY32Y", "B0007Y794O", "B009IY72OQ", "B000EXR0SI", "B00603RW48", "B00DQXJM6Q", "B00004ZCJM", "B0045JAJR6", "B00CF5OGP8", "B00004ZCJG", "B00004ZCFZ", "B00FSG1INY", "B003Y30334", "B0002Y5WZM", "B001196MG0", "B003YH9DZ4", "B002SWIOOM", "B005DEHVC8", "B00246XB1S", "B003UOIMAS", "B00139W0XM", "B004GITBSE", "B0081SS5C8", "B004AZ38Z0", "B0029LH3TE", "B004LEAYXY", "B007NMMUZQ", "B00DCY29G4", "B00APL85ZG", "B001E4LC6C", "B0062C4KQU", "B007NDL56A", "B00A34GQEC", "B00D5Z7HB2", "B004VTAVLE", "B003VSGQPG", "B008M23DW0", "B000CLNHXY", "B00AD7YI2Q", "B005IQRMN4", "B00FKGCJIU", "B00E3K94T6", "B000BTCJNG", "B00A2WTNZE", "B00009XV3M", "B0053NWFFM"], "bought_together": ["B00004ZCJK", "B00004ZCFQ"], "buy_after_viewing": ["B00007E7JU", "B00004ZCJK", "B002LVUIXA", "B004LEAYXY"]}, "title": "Tamron AF 28-75mm f/2.8 SP XR Di LD Aspherical (IF) for Canon Digital SLR Cameras (Model A09E)", "price": 499.0, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41Kltt3ceCL._SX300_.jpg", "brand": "Tamron", "categories": [["Electronics", "Camera & Photo", "Lenses", "Camera Lenses", "Digital Camera Lenses"]], "description": "This ground-breaking high-speed mid-range zoom is prized by pros and serious shooters for its fast F/2.8 constant aperture, evenness of illumination, and its outstanding imaging performance, and by all photographers for its compact size and reasonable weight that make it feel like an ordinary standard zoom. These admirable characteristics have been achieved by the use of special XR and LD glass, the efficient use of aspherical elements, and non-rotating internal-focus (IF) design. This remarkable zoom lens also focuses down to 0.33m (13&rdquo;) (1:3.9 magnification) at all focal lengths for satisfying close-up performance and is compatible with APS-C and full-frame-format SLRs. Not surprisingly it is widely acclaimed as a classic.SP70-300mm F/4-5.6 Di VC\" src=\"http://g-ecx.images-amazon.com/images/G/01/ce/844/AF28-70mm_high_speed_zoom/Center1.jpg\" border=\"0\">Worlds smallest & lightest lensThe most compact and lightest in the history of fast zoom lenses. Thanks to the revolutionary downsizing \"XR\" technology employed by Tamron in the development of high-power zoom lenses such as the 28-200mm and 28-300mm, the dramatic compactness that makes this lens the world's smallest and lightest is achieved. Its compactness makes it look and feel like an ordinary standard zoom lens, yet the versatility that a fast constant maximum aperture offers will definitely reshape your photographic horizons.SP AF28-75mm F/2.8 XR Di FeaturesDigitally Integrated (DI) Lenses for the Best Imaging PerformanceDi (Digitally Integrated Design) is a Tamron designation that applies to lenses that have been optimized for digital capture using advanced multi-coating techniques and optical designs that assure excellent image quality across the entire picture field. Because of these characteristics, Di lenses provide outstanding performance on cameras with full-frame and APS-C format sensors as well as on 35mm film.Low Dispersion (LD) Glass for Greater Lens SharpnessLow Dispersion (LD) glass reduces chromatic aberrationLow dispersion (LD) glass elements in a lens help reduce chromatic aberration; the tendency of light of different colors to come to different points of focus at the image plane. Chromatic aberration reduces the sharpness of an image, but glass with an extremely lowdispersion index, has less of a tendency to separate (defract) a ray of light into a rainbow of colors. This characteristic allows the lens designer to effectively compensate for chromatic aberration at the center of the field (on axis), a particular problem at long focal lengths (the telephoto end of the zoom range), and for lateral chromatic aberration (towards the edges of the field) that often occurs at short focal lengths (the wide-angle end of the zoom range.)Super Performance (SP) for Discriminating ShootersTamron SP (Super Performance) series is a line of ultra-high-performance lenses designed and manufactured to the exacting specifications demanded by professionals and others who require the highest possible image quality. In creating SP lenses Tamron&rsquo;s optical designers put their foremost priority on achieving superior performance parameters&mdash;they are all designed to a higher standard with little regard for cost constraints. As a result, Tamron lenses bearing the SP designation feature impressive and innovative designs that have established an enviable reputation for excellence among those knowledgeable photographers that demand the very best.Extra Refractive Index Glass (XR)Special glass for better performance and more compact lens designsExtra Refractive Index (XR) glass can bend light rays at steeper angles, thereby decreasing the physical length of the lens while enhancing imaging performance by minimizing optical aberrations. This has allowed Tamron to develop a line of shorter, smaller-diameter, lighter lenses without sacrificing lens speed, and actually upgrading image quality compared to older designs. XR glass is costlier than conventional glass but it yields enhanced optical power distribution, making possible many of the outstanding and innovative lens designs that bear the XR designation. XR glass, with its superior light-bending power, makes it possible to design a short-barrel lens with the same light-gathering ability (aperture value) as a long-barrel lens&mdash;even with a smaller lens diameter. By using this principle Tamron has been able to shorten the length of the entire optical system and produce lighter, more compact lenses of the same speed, and also to provide greater zoom ranges in lenses that are much more convenient to carry by hand.Internal Focusing (IF) SystemInternal focusing provides numerous practical benefits to photographers including a non-rotating front filter ring that facilitates the positioning of polarizing and graduated filters, and more predictable handling because the lens length does not change during focusing. Even more important, Tamron&rsquo;s Internal Focusing (IF) system provides a much closer minimum focusing distance (MFD) throughout its entire focusing range. In addition, IF improves optical performance by minimizing illumination loss at the corners of the image field, and helps to suppress other aberrations that become more troublesome at different focusing positions.Aspherical Lens Elements (ASL)Aspherical Lens ElementTamron uses several hybrid Aspherical lens elements in many lenses bearing the Aspherical designation. These innovative optics allow us to achieve the ultimate in image quality, and at the same time produce lenses that offer remarkable zoom ranges in extraordinarily compact packages. By perfecting theses cutting-edge advances for series production, Tamron has advanced the state of optical design, and virtually eliminated spherical aberration and image distortion from the high-power-zoom series.Through the effective application of Hybrid Aspherical Technology, one lens element can take the place of multiple elements without compromising performance. This is what allows us to produce remarkably compact long-range lenses that deliver a uniformly high level of image quality at all focal lengths and apertures.Zoom Lock (ZL)Another original Tamron mechanical engineering concept is the Zoom Lock (ZL), a simple convenience feature that prevents undesired extension of the lens barrel when carrying the camera/lens unit on a neck strap."}