{"asin": "B009VK26J8", "description": "SummaryOur superior KAVAJ Berlin iPad mini 2 case is super sleek and thin, wrapping your iPad mini in our gorgeous soft, supple, rich genuine black leather.&nbsp;The interior of this Berlin case is made of a lovely velvety flannel material, protecting your iPad mini from scratches and dust. Your iPad mini is secured inside our gorgeous case, with zero wiggle or movement. The narrow interior frame shows off your iPad mini color, and we&rsquo;ve even built in magnets so your iPad mini can &ldquo;wake up&rdquo; when you open the case.The Berlin provides two angles: laying down and slightly angled for interaction and typing, and standing nearly upright for watching movies. All buttons and ports are accessible and unobstructed.The KAVAJ Berlin &ndash; sleek and stylish insurance for your iPad mini investment.HighlightsGorgeous, ultra-soft, rich leather for total iPad mini protectionElegant, sleek and thinOur magnet technology takes advantage of your iPad mini&rsquo;s wake-up featureAll ports, buttons and sensors are accessible100% genuine, soft sexy leatherMaterials:Exterior: Genuine leather in blackInterior: Velvety flannelIncluded in delivery:1 x KAVAJ \"Berlin\" case for the new iPad mini 2 and iPad mini (iPad mini not included)Compatible with all iPad mini 2 and iPad mini", "title": "KAVAJ leather case cover &quot;Berlin&quot; for the new Apple iPad mini 2 (Retina Display) and iPad mini black - genuine leather with stand-up feature", "price": 44.9, "imUrl": "http://ecx.images-amazon.com/images/I/31D4nDRFJjL._SX300_.jpg", "related": {"also_bought": ["B0099S7N0Y", "B00G335C3S", "B007IFVSPG", "B009QQMEEY", "B0099S7MJG", "B00G335DGY", "B00GQDAFKA", "B008THTWIW", "B00GNKRFEA", "B00GQDBZUY", "B00F4SU6FM", "B009TENKAA", "B009VK26TI", "B00A2LSWA2", "B007IFVTFU", "B0099S7PIY", "B009LVPYDM", "B00GQDCE72", "B00IHU52Y4", "B008QXY3NI", "B00GQDBS7O", "B00A23FXZ2", "B00BT8KZCU", "B00HSSG1Z0", "B00AA25WEC", "B00A7O9ZDC", "B007I5JT4S", "B00DN6NXGQ", "B00G0MP05W", "B00INMB23Q", "B00G3J8EZ0", "B009UOIAEU", "B004M5KYEG", "B00AOK54MA", "B00FZ4IG66", "B00746W5EM", "B00HJB66WY", "B005UVNE9S", "B00DM8R866", "B00CKG61WI", "B00B3OA7R8", "B004GUS4XK", "B00AQ664H6"], "bought_together": ["B009QQMEEY"], "buy_after_viewing": ["B00G335C3S", "B009UZ3TF4", "B009QQMEEY", "B007IFVSPG"]}, "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Cases & Sleeves", "Cases"]]}