{"asin": "B001SER46K", "related": {"also_viewed": ["B0035FZJKI", "B001SER47Y", "B001SER4D8", "B001SER47O", "B0035FZJJ4", "B001G5ZTN6", "B00065L5SU", "B004J3V8UU", "B001SER46A", "B002LITT5Q", "B005II5OLY", "B000V1VG2O", "B002L80QQW", "B004J3V828", "B000NK6J6Q", "B0036STI56", "B000Q30420", "B0075T7NW2", "B006UMM1PO", "B006UMM1UO", "B004J41T7Q", "B001SER48S", "B00AWYN0BU", "B0032JRRWU", "B00I58LZRG", "B00005JAD9", "B0026O3J5Q", "B000NK8EWI", "B002LITT6U", "B00B5HE3YG", "B006UMM1AY", "B0032JRRWK", "B0007VPFI4", "B003ZSHNF4", "B00HLDFPA4", "B005MTMEKI", "B00HLDFNKQ", "B001G5ZTZO", "B004HW73QQ", "B00HLDFQU8", "B00B5HE3UU", "B0032JRRXE", "B00AWYN182", "B0075SUJQK", "B0032JRRXO", "B00AQDGCIA", "B004J3V7RO", "B0035FZJIA", "B003F3ZFVS", "B004J3VAYO", "B0075SUEOM", "B001SER49M", "B0075SUK6O", "B00B5HE32I", "B0032JRRX4"], "bought_together": ["B0026O3J5Q", "B003OUJA8Q"], "buy_after_viewing": ["B0036STI56", "B003OUJA8Q", "B0026O3J5Q", "B00065L5TE"]}, "title": "Canon PowerShot SD960IS 12.1 MP Digital Camera with 4x Wide Angle Optical Image Stabilized Zoom and 2.8-inch LCD (Silver)", "price": 278.84, "salesRank": {"Camera &amp; Photo": 6250}, "imUrl": "http://ecx.images-amazon.com/images/I/41FqDBdaznL._SX300_.jpg", "brand": "Canon", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Immediate gratification is the pulse of today, and the PowerShot SD960 IS Digital ELPH with its streamlined appeal wastes no time reminding you: \"Here&rsquo;s a camera unlike any other.\"  But it&rsquo;s the excitement of ongoing discovery--the way this camera captures the vibrant spontaneity of the world before you--that defines the lasting rewards of the PowerShot SD960 IS Digital ELPH, and the new level of pictures and HD movies that await you. Immediate satisfaction. Day-after-day delight. What could be better?PowerShot SD960 IS Highlights12.1-megapixel resolution, 4x optical zoom lens with Optical Image StabilizerCanon&rsquo;s commitment to innovation defines the excitement of the PowerShot SD960 IS Digital ELPH.  12.1-megapixel resolution is more than a number, it&rsquo;s your cutting-edge link to the outstanding clarity and quality you&rsquo;ve always wanted in your images. Think bold and big, because razor-sharp, oversized prints are a breeze. And think way beyond the typical picture format thanks to the 28mm wide-angle lens with 4x optical zoom. Get the picture? It&rsquo;s absolutely brilliant.The PowerShot SD960 IS Digital ELPH is equipped with Canon&rsquo;s acclaimed Optical Image Stabilizer Technology that automatically detects and corrects camera shake--one of the leading causes of fuzzy or blurred shots. Even when zoomed in, you can get the steady, crisp, brilliant images you&rsquo;ll be proud to shoot and share. And Canon&rsquo;s Optical Image Stabilizer Technology is so convenient to use. It functions perfectly with or without a flash.HD movie shooting capability plus HDMI outputThe PowerShot SD960 IS Digital ELPH lets you record video in beautiful high definition (1280 x 720 pixels). The camera also makes it easy to enjoy HD movies (and still photos) on your HDTV with a mini-HDMI connector for direct connection to a high-definition monitor. You&rsquo;ll enjoy the HD experience with no degradation of image or audio in the signal, plus the ability to display up to 130 still images at once.Widescreen 2.8-inch PureColor LCD II and wide viewing angleThe PowerShot SD960 IS Digital ELPH gives you a large and wide 2.8-inch LCD screen for excellent control when framing your shots. Canon&rsquo;s PureColor LCD II offers spectacular color, resolution and contrast even when viewed at an angle. The screen is highly durable and easy to see in any light with a scratch-resistant, anti-reflective coating. It also features Night Display for easy viewing in low light--a perfect feature for gathering friends and family around to see your images.Smart AUTO intelligently selects the proper settingsJust set the Canon PowerShot SD960 IS Digital ELPH to Smart AUTO and you&rsquo;re ready for maximum enjoyment from your picture taking every time. It&rsquo;s a relaxing and satisfying way to shoot because you can completely concentrate on your subject knowing that the camera has the technical details covered. Advanced Canon technology intelligently analyzes your situation and shooting conditions. Then it automatically selects an appropriate setting from 18 specially defined settings. So whether you&rsquo;re photographing flowers, a captivating sunset, or your friends at the park, you can be confident that you&rsquo;re getting dramatic, memorable images.Shooting ModesAdvanced presets for the best possible photos under certain conditions. With 20 Shooting Modes, you&rsquo;re ready for whatever shot comes your way.New Active display technology for quickly switching between imagesActive Display is a fun new feature powered by an accelerometer built into the PowerShot SD960 IS Digital ELPH. When browsing through your images in playback, just give the camera a quick shake to advance or return images one frame at a time. Tilting the camera will activate continuous image advance, and tilting at a further angle will make the images advance more quickly.Simply tilt the SD960 IS to advance imagesA World of Advantages with Canon&rsquo;s TechnologyDIGIC 4 image processor has evolved Face Detection Technology that tracks the faces of moving subjects and lets the shooter enter the frame seamlessly with the Face Detection Self-Timer.DIGIC 4 Image ProcessorCanon&rsquo;s most advanced image processor, DIGIC 4, delivers evolved Face Detection Technology that keeps every face in every photo looking its very best. The technology finds and tracks the faces of moving subjects until you&rsquo;re ready to shoot, then delivers perfect focus. In addition, exposure, flash and white balance are compensated, so that faces exhibit natural skin tones and backgrounds are properly exposed.iSAPS Technologyis an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the advanced DIGIC 4 Image Processor to improve focus speed and accuracy, as well as exposure and white balance.AFace Detection Self-Timerautomatically detects an increase in the number of faces and makes the appropriate adjustments. For instance, to include the photographer&rsquo;s face in a group shot, there&rsquo;s no need to rush in. Just put the camera on a stand or tripod, specify Face Detection Self-Timer, and the camera will wait for the photographer&rsquo;s face to get on-camera before it takes the shot. Motion Detection tracks moving subjects in a much larger range, and the Servo AF retains focus on a moving subject after the shutter button is pressed halfway--allowing you to wait for the perfect shot without refocusing.Intelligent Contrast CorrectionDIGIC 4 also makes possible the i-Contrast (Intelligent Contrast Correction) system, which controls the compensation level in pixel units to brighten dark areas while leaving bright areas unchanged for better images where the main subject is dark, and more natural transition. The PowerShot SD960 IS Digital ELPH can even use i-Contrast in playback mode to adjust images that were shot without the setting activated.Red-eye Correctionprovides three options for removing red-eye from subjects in flash pictures. 1) Red-eye Correction during shooting actually identifies and corrects red-eye in human subjects as pictures are taken. 2) The PowerShot SD960 IS Digital ELPH can be set to automatically detect and correct red-eye during image playback. 3) You can manually locate any red eyes in a scene during image playback on the LCD screen, and command the camera to remove them.Life doesn&rsquo;t give you second chances to capture special times. That&rsquo;s why the PowerShot SD960 IS Digital ELPH features an ISO 1600 setting that reduces the effects of camera shake and sharpens subjects in low-light situations, giving you greater shooting flexibility. ISO can be expanded to 3200 when you select ISO 3200 Special Scene mode.What's in the BoxPowerShot SD960 IS Digital ELPH bodyLithium-ion battery pack (NB-4L)Battery charger (CB-2LV)Wrist strap (WS-DC7)Digital Camera Solution CD-ROMUSB interface cable (IFC-400PCU)AV cable (AVC-DC400)"}