{"asin": "B000WG6XW6", "description": ".caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; }Music and entertainment, your way. That's what the Zune 80 GB Digital Media Player is designed to deliver. The Zune easily connects you with your music, videos, and pictures wherever and whenever you want, and unlike the iPod, it even has a built-in FM tuner so you can keep up with local news and sports. Your Zune gives you the power to wirelessly share full-length tracks, playlists, pictures and podcasts with your other Zune-wielding friends. And when you receive songs that you just can't get out of your head, you can easily tag the songs and buy them the next time you sync up. Whether you're listening to music, radio, or rocking out to the latest music videos on the bright, roomy screen, the Zune allows you to tailor your entertainment, right in the palm of your hand.Watch a demo on Zune.The Zune easily connects you with your music, videos, and pictures wherever and whenever you want.Share full-length tracks of your favorite songs, albums, playlists, pictures, and even audio podcasts with other Zune users.Shown withDock Pack v2 with remote, sold separately.Store up to 20,000 songs, 25,000 pictures, or 250 hours of video on the 80 GB Zune, available in red or black.Get all your favorite music at the Zune Marketplace.Simple, Innovative ControlsThe Zune is a breeze to use with new, intuitive touch controls. Don't subject yourself to cumbersome, slow scrolling. The innovative new Zune pad makes browsing your music, video and picture collections fun and effortless. You'll fly through your favorites and get to just what you're looking for in no time flat. This powerhouse device stores up to 20,000 songs, 25,000 pictures, or 250 hours of video. (Please note that music estimates are based on 128 kbps WMA files, with length of 4 minutes each; pictures transferred to Zune will be optimized for Zune screen size; and video estimates are based on 500 kbps WMV files with 128 kbps WMA audio tracks.)That's a lot of entertainment, and you'll appreciate it even more with the Zune's awesome screen. The big, beautiful, 3.2-inch color screen provides uncompromising portable video viewing. This Zune also comes equipped with premium earphones. Designed to block out external noise, these earphones provide superior sound and bass response, and leave your ears with nothing but your favorite tunes. Your favorite music, videos, and pictures have never looked and sounded better.FM RadioThe Zune also features a built-in FM radio tuner so that you can listen to local FM stations or tune-in programming while you're at the gym. Advanced tuning capabilities allow you to see the name of the song that's currently playing on select frequencies.Wireless SyncWe're all exhausted by the cables and wires that tangle up our lives. Luckily, the Zune is one device that doesn't require another cord. You can easily connect to your home wireless network and sync your Zune with your PC collection of digital goodies. You can also sync using the dock, AC adapter, or speaker dock accessory (not included).The Zune Community and MarketplaceZune is all about sharing and community. At the Zune Online Community, you'll discover, share, and leave your musical mark. Create a Zune card and Zune profile page to reflect your musical identity. From the Zune Online Community you can invite friends, share song recommendations, post comments, and browse member pages to unearth new tunes and connect to others who share your musical tastes.When you're ready to purchase music and load your device with new tunes, turn to Zune Marketplace. With more than 3 million songs, DRM-free MP3s, music videos, audio/video podcasts, and more content added every day, you'll certainly get your fill. The store is always open and just a mouse click away. You can also choose between the download or subscription packages--buy individual songs and albums, or snag a Zune Pass subscription withall you can eataccess to discover and explore the nooks and crannies of artists and genres.Zune-to-Zune SharingOnce your Zune is loaded with good stuff, you'll be ready to embrace wireless Zune-to-Zune sharing. Share full-length tracks of your favorite songs, albums, playlists, pictures, and even audio podcasts. You can listen to the full track of any song you receive up to three times, and you can even pass along songs that are shared with you to other friends. If you find a song you really love, you can easily add it to your wishlist and buy it later when you sync to your PC. When it comes to syncing and importing your music, the Zune makes it easy. Zune software can automatically import your existing music, pictures and videos from iTunes and Windows Media Player in a variety of formats, including your existing playlists and song ratings.Recorded TV or Movies to GoThe Zune will also automatically import TV shows or movies recorded using a PC running Windows Media Center in Windows Vista. Record all your favorites, sync to your Zune, and hit the road with your favorite TV shows right in your pocket.Your Games. Your Music. Your Way.Another aweome feature is the Zune's compatibility with the Xbox 360. Plug your Zune into your Xbox 360 to customize the soundtrack in supported games. You can also stream music, pictures, and vidos from the Zune software on your PC to your Xbox 360 console using a wireless connection. Whether you're staying in or going out, travelling or working, the Zune can be right there with you, providing loads of entertainment direct from your pocket.What's in the BoxZune 80 GB Digital Media Player, premium headphones, sync cable, and three sizes of ear sleeves.", "title": "Zune 80 GB Digital Media Player (Black)", "price": 7.99, "imUrl": "http://ecx.images-amazon.com/images/I/41K7bhZXgmL._SY300_.jpg", "related": {"also_bought": ["B001TJIZTY", "B0013RU8HE", "B000IXNEI4", "B0017HEZE2", "B000VWOKQM", "B002VZ4MD8", "B000VWPULQ", "B002N0S0L6", "B000VWKSHM", "B000MUBEDU", "B002EBF0OY", "B000VWOKRG", "B001EQ0HAW", "B000IXP932", "B000IXP96Y", "B002ZPVNYK", "B000EPLP3C", "B002JPITY8", "B002RI1SEU", "B00192H7XG", "B002WB433U", "B000XPG2YU", "B000IXP946", "B000IXLHOM", "B000OP8BVG", "B002JPITXY", "B000IXQPJO", "B000IXQPNK", "B001FA1NJG", "B002JPITZ2", "B004798MKA", "B002SKVYZA", "B000WG5FFM", "B00ADF0WDW", "B000FMZE7W", "B000H0QDCC", "B001XYBWXQ", "B001BKHC4U"], "buy_after_viewing": ["B000VWPULQ", "B000EPLP3C", "B000VWOKQM", "B002JPITY8"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}