{"asin": "B00D9UN5Z0", "description": "What is it?This is one of the simplest and most professional looking cases for your iPad Mini.  The deep dark brown gives an elegant look and feel while the simplicity of this case is unrivaled.  There's nothing super-fancy about it  - it's just a basic synthetic leather sleeve with a premium look and feel.  The synthetic leather has just enough cushion to protect your iPad but still remains a super thin solution for protecting your device while you throw it into your briefcase, backpack, or in with your stack of books.How it works:The iPad is held into the case simply by friction - so no need to worry about breaking any buckles, snaps, or clasps.Who should buy this?If you enjoy using your iPad without a case but still want to protect it when not in use - or find you remove your iPad from it's case often, this is the case for you (for example, if you remove it from its case often to mount into our Koala Tablet Wall Mount).  If you are looking for a complicated product that does all sorts of fancy stands and flips, don't buy this. If you want a simple, beautiful sleeve for your iPad, this is the case for you.  It's elegant and professional, yet incredibly easy to get your iPad in and out, frustration free.Compatibility:This sleeve is designed to be compatible with the original iPad Mini and the iPad Mini Retina, but may also work with similarly sized Android or Windows tablets.  Please note that this sleeve is designed solely for use with a naked iPad Mini or iPad Mini Retina and is NOT compatible with the Smart Cover or any other cases.  The opening (between the stitching) is 14.75 cm x 21 cm.  The iPad Mini is approximately 13.5 cm x 20 cm x .72 cm, so any tablet smaller than that should fit ok.", "title": "Synthetic Leather Sleeve for iPad Mini and iPad Mini Retina by Dockem; Slim, Simple, and Professional Executive Tablet Case - Soft Felt Lined Dark Brown Basic Synthetic Leather Protective Pouch Cover", "price": 9.99, "imUrl": "http://ecx.images-amazon.com/images/I/31HzG4uRfqL._SY300_.jpg", "related": {"also_bought": ["B00GMRBZBS", "B00GIY960C", "B00IISTKTI", "B00GMSSFMY", "B00A0GS3PI", "B00D856NOG", "B00AH8U5IM", "B00HQYNQSQ", "B00HAWW590", "B00L40YJ8O", "B00JPHUXQK", "B00GIY965M", "B00IDHBDVM", "B0044CNRGY", "B00DVFLJKQ", "B000CKVOOY", "B00ELQHVXS", "B007FNF5IC", "B00DD7204G", "B003CKAQ9U", "B008PNK5EA", "B00EBNDOIC", "B00I8T4PUG", "B00EL94Z4I", "B00GIY965C", "B00GDTV308", "B006ZT4VA0", "B009RRTPSK", "B00585CLVS", "B009QQMEEY", "B00DN6TSVA", "B00G3J8EDM", "B009VN9F0S", "B00DVFLJDS", "B00D52HVXY", "B00G7PUD68", "B00J8ZJCUW", "B002VPE1Q6", "B008UHLFRC", "B00GSC6HDI", "B004TLH7C0", "B00G9TIR9W", "B002VPE1QG", "B00E4OKXPU", "B00F6SPYJS", "B00E5T4MR4", "B00E44B18I", "B00I812L4Q", "B00GY203DC", "B00HV51P2O", "B00G4SA1FG", "B00E9QK7X6", "B00CR61RW0", "B00479FQCM", "B000T8PTLI", "B00G2X1VIY", "B008MOHLVC", "B009WHV3BM", "B00CA67PVO", "B00F4SU6FM", "B00G2TK76A", "B00DQEB1V4", "B00A1A4KHS", "B0002H49BC", "B00IJ331WY", "B00IBDOB5I", "B00CW1N6CY", "B00CA65AR0", "B004NY9UW8", "B00GTGETFG", "B0050R67U0", "B009UZ3TF4", "B000L47AHG", "B00G5N0ZZQ", "B00E1HIVG8"], "bought_together": ["B00D856NOG"], "buy_after_viewing": ["B00AH8U5IM", "B00CB7T52O", "B00AU73C58", "B00GIY960C"]}, "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Cases & Sleeves", "Sleeves"]]}