{"asin": "B000WMEHYG", "description": "Amazon.com Product Description.caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100%; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The n52te is an innovative keyboard and gamepad with incredible personalization options powered by Razer.View larger.Engineered to optimize your gaming speed and prowess.View larger.The Belkin n52te offers:Keyboard and gamepad functionalityAdjustable soft-touch wrist pad and backlit keypad and scroll wheel15 fully programmable keys built for complete customization and speedPersonalization options powered by RazerDominate your opponents with Belkin's n52te.View larger.Dominate your opponents with Belkin's n52te, an innovative gamepad and keyboard that integrates crucial gaming functions into one, sleekly designed device. Whether your passion is rooted in FPS, MMORPG, or RTS games, Belkin's n52te is built to deliver wicked-fast response to whatever mayhem comes your way.Keyboard and Gamepad FunctionalityThe n52te puts keyboard and gamepad functionality into one small and easy-to-use unit, delivering more tools for customizing your game than ever. Using feedback from hundreds of gamers, Belkin's engineers designed the n52te's intuitive nature and stylish versatility to give you easy access to your arsenal of deadly maneuvers.An adjustable soft-touch wrist pad offers maximum comfort and endurance, while the backlit keypad and scroll wheel give you total control in dark conditions. Gamers demand speed and instantaneous response, so the n52te features enhanced tactile feedback and button responsiveness for rapid key presses. Non-slip, rubber stability pads keep the device in place so you can concentrate on firing, bobbing, and weaving.Supreme CustomizationNeed to custom tune your device to match your unique fragging needs? Not a problem with the n52te. Fifteen fully-programmable keys and three keymaps are built for complete customization and speed, giving you intuitive setup and performance. The 8-way thumb pad is programmable, as well, and it sports a removable joystick.Powered by RazerThanks to Razer Synapse&trade; embedded memory, you can personalize multiple player profiles for all your games and access killer performance tools. The inclusion of onboard memory also means that you get plug and play versatility with no additional software installation.What's in the BoxBelkin n52te, quick start guide, and Nostromo Array Programming Software.", "title": "Belkin n52te Tournament Edition SpeedPad", "price": 66.6, "imUrl": "http://ecx.images-amazon.com/images/I/51pYw4BGYTL._SX300_.jpg", "related": {"also_bought": ["B004AM5RB6", "B0086UK7IQ", "B00AAQRNQ8", "B00B1N07QM", "B009ZN03AA", "B001NEK2GE"], "buy_after_viewing": ["B001NEK2GE", "B00B1N07QM", "B00EHBKUTE", "B004AM5RB6"]}, "categories": [["Electronics", "Computers & Accessories", "Game Hardware"]]}