{"asin": "B000MQNMQ6", "description": "Your computer is the center of your digital life. Your TV is the center of your entertainment life. But what if you want to watch movies, TV shows, movie trailers, podcasts, and photos from your computer on your TV? For one low price, Apple TV brings iTunes to the big screen.Say you&#x92;ve just downloadedThe Incrediblesfrom iTunes. Instead of huddling around your computer to watch, you pop some popcorn while your computer wirelessly syncs your new flick to Apple TV. Then you pull up a seat, put up your feet, and pick up the included Apple Remote to play your movie on TV. Give yourself a hand: You've just changed the way you watch digital media.Getting all your favorite iTunes movies, TV shows and music from your Computer to your TV is a snap with Apple TV.Apple TV ports iTunes to Apple TV, wire free.Apple TV connects to your TV via an HDMI port or component video and audio ports. Its built-in, superfast 802.11 wireless capability syncs your iTunes library from any Mac or PC in the house. Best of all, what's on Apple TV stays in sync: Anytime you change your library in iTunes, it changes on Apple TV &#x97; wirelessly, automatically.Apple TV boasts a simple easy to navigate menu.What&#x92;s on TV? Whatever you want.Apple TV puts your iTunes library &#x97; movies, TV shows, music, and podcasts &#x97; plus movie trailers from Apple.com on your TV. And your digital photos from iPhoto on a Mac or Adobe Photoshop Elements or Adobe Album on a Windows PC appear in high definition, so you can put on a stunning big-screen slideshow.Just add popcorn.Turn your living room into a multiplex with Apple TV. From the Movies menu, you can choose from up to 50 hours of flicks from iTunes, home movies you made yourself, previews from iTunes Top Movies, even movie trailers that stream directly from Apple.com.Channel you.Be your own program director with up to 50 hours of TV shows on Apple TV. Sort shows by date or show, then watch them anytime &#x97; completely commercial free. Or check out the latest TV offerings from iTunes Top TV Shows.Musically inclined.If the best sound system in your house is connected to your TV, why play your iTunes library anywhere else? Apple TV lets you browse and play up to 9,000 songs and watch music videos, all on the big screen (and the big speakers).Radio on the TV.Thanks to Apple TV, you can enjoy podcasts on your TV for the first time ever. Listen to your favorite audio podcasts through your entertainment system speakers and watch video podcasts from the comfort of your couch.Get the big picture.Apple TV brings photo slideshows out of the den and into the living room. Pull up the best seat in the house and view your photos in jaw-dropping high definition. With up to 25,000 photos at your fingertips, you'll never cease to amaze.All set.From the Settings menu, you can set up your screen saver, your network, or your TV resolution, and get more information about your Apple TV.Because Apple TV streams wirelessly, you can send movies or musicfrom your computer to your TV or ipod anywhere in your house.Wirelessly in SyncYour iPod syncs seamlessly with iTunes. Apple TV does the same &#x97; wirelessly, from wherever your Mac or PC may be. Your computer is in your office. Your TV is in your living room. Apple TV brings them together using its built-in 802.11 wireless capability and your existing wireless network. Pair Apple TV with your computer and your TV shows, movies, music, podcasts, and photos sync automatically. Through the air. Like magic.Sync from one&#x85;Open iTunes and Apple TV appears in your devices list, ready to sync. Set iTunes to sync unwatched video. Sync new purchases. Or manually select what to sync. Set your preferences once and Apple TV automatically updates as your iTunes library changes. Everything travels over your network to Apple TV&#x92;s built-in hard drive. So once you sync, even if you turn off your computer or disconnect it from the network, you can still enjoy stored video &#x97; up to 50 hours of it &#x97; from Apple TV.&#x85;stream from many.If you want to watch video from another computer, you can stream it live to your TV via Apple TV. Streamed media travels over your network to your TV &#x97; without taking up space on Apple TV&#x92;s hard drive. That&#x92;s perfect for multicomputer households or when the computer you sync with has more in its iTunes library than will fit on Apple TV. Just choose up to five additional computers from the Sources menu. As long as a computer&#x92;s on your network, it can stream to your TV.It just fits.Easy connectivity and built-in wireless make Apple TV right at home in your home entertainment system. Got a widescreen TV? Got iTunes? Then you&#x92;re ready for Apple TV. Connect Apple TV to your TV and open iTunes on your computer. iTunes wirelessly detects Apple TV and walks you through a simple setup.Relax and unwire. If you don&#x92;t have a wireless network, you can set one up easily with a wireless access point like the superfast 802.11 AirPort Extreme Base Station. Newer AirPort Extreme-enabled Macs let you create a wireless network using only your computer. And if you have a Mac or PC without wireless capability, you can connect Apple TV to your network using an Ethernet cable (sold separately).What you needWidescreen TVMac or PCiTunes 7.1Wired or wireless networkHDMI cable orComponent video cables and analog audio cables or optical audio cableApple TV connects to your widescreen TV via an HDMI cable (sold separately). This simple connection delivers both audio and video to your TV &#x97; no need for multiple cables.If your TV&#x92;s HDMI port is occupied by another device, or if your TV doesn&#x92;t have an HDMI port, you can connect to Apple TV via component video and audio. So no matter what your entertainment system looks like, Apple TV connects easily. And since Apple TV has a built-in power supply, there's no unwieldy power brick to hide.Help when you need it.From connecting your existing A/V receiver to selecting the right video mode, if you run into problems while setting up your Apple TV, help is just a click away. Get quick and simple setup and connection solutions from the Apple TV: Tips and Basic Troubleshooting guide.Apple TV works with widescreen, enhanced-definition or high-definition TVs capable of 1080i, 720p, 576p, or 480p resolutions.", "title": "Apple MA711LL/A TV with 40GB Hard Drive [OLD VERSION]", "price": 102.49, "imUrl": "http://ecx.images-amazon.com/images/I/31D7Nnf1dUL._SX300_.jpg", "related": {"also_bought": ["B000RQHAUA", "B001FA1NK0", "B005MQPW5U", "B008D96Z8Q", "B000BQYM0W", "B0050QJUP0", "B000VZ3JLG", "B00CH643A8", "B00I5SW8MC", "B00GR30SW4", "B002OXGYQU", "B002TPFNXS", "B0049D7PCU", "B00B9996LA", "B0062U5WYQ"], "buy_after_viewing": ["B007I5JT4S", "B008D96Z8Q", "B001FA1NK0", "B002TPFNXS"]}, "categories": [["Electronics", "Television & Video", "Streaming Media Players"]]}