{"asin": "B00008OE6I", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The newest Digital Elph in the Canon's PowerShot line, the compact  S400--the successor to the popular S200, S230, and S330 models--is both elegant and powerful. It features a 4-megapixel sensor, 3x optical zoom, an improved 3.6x digital zoom, and movie mode for videos of up to three minutes. A stainless steel shell protects the camera, while a new finish--Super Hard Cerabrite--mixes metals and ceramics to produce a tough cool-toned exterior that is visually stunning.Optics and ResolutionFeaturing a 4.0-megapixel CCD sensor, the PowerShot S400 delivers a wide range of detail and color (with images up to 2,272 x 1,704 pixels) and prints beyond 11 by 14 inches. Canon's high-quality 3x optical zoom lens (36-108mm, f/2.8-4.9) allows you to close in on the action, while the 3.6x digital zoom allows for a combined 10.8x zoom letting you capture intimate details that might have been missed with another camera.The PowerShot S400 also features Canon's nine-point AiAF (Artificial intelligence Auto Focus) system for focusing accuracy, shutter speeds of  15 to 1/2,000 second, and fast sequence shooting at a rate of 2.5 frames per second (fps).Movie ModeShoot up to three minutes of MPEG video at resolutions up to 320 x 240 pixels with sound, editing controls, and VCR-like playback. The movies aren't camcorder quality, but they're fun and convenient, and they're perfect as e-mail attachments. The camera can also attach voice memos or sound files of up to 60 seconds to each image.More FeaturesYou can select from evaluative, center-weighted, and  spot-metering modes depending on the subject matter, and can even choose to set shutter speeds and apertures manually. An ISO range of 50 to 400 ensures practical shutter speeds in a wide variety of lighting situations, while a multifunctional, built-in flash offers a maximum reach of 3.5 meters in Auto ISO mode.Canon's DIGIC (DIGital Imaging Core) processor ensures excellent color rendition and white balance for every shot, as well as super-fast auto focusing, noise-free imaging, and advanced flash exposure performance.1.5-inch TFT (transreflective) LCD monitor.Built-in flash with auto, on, off, manual, slow-synch, and red-eye reduction modes.Shot modes include manual, auto, and stitch assist.White balance modes include daylight, cloudy, tungsten, fluorescent, and more.Histogram display for checking exposure and contrast levels in images stored on the memory card.Built-in orientation sensor automatically rotates portrait pictures, and these images remain rotated when downloaded, saving time during in-computer image processing.Storage and TransferImages and video are stored on CompactFlash memory cards (Type I only) and the included 32 MB card holds approximately 27 images at the Large/Fine setting. Files can be downloaded to either a Mac or PC via USB connectivity, which means it can be connected to any USB-based Windows 98/Me/2000/XP and Mac OS 8.6 or later computer without installing any software.PrintingCanon has introduced a series of printers designed to work directly with its lineup of digital cameras. Using these printers, no computer is required--simply connect the camera to the printer and start printing. Printers include Canon's bubble jet direct printersS830DandS530D, and card photo printerCP-100. Of course, photos from your camera can also be printed on any home computer system with an inkjet printer, sent off for online processing, or simply enjoyed on your computer screen.Power, Size, and ContentsThe camera is powered by a rechargeable lithium-ion battery NB-1LH (included). It measures 3.4 by 2.2 by 1.1 inches and weighs 6.5 ounces (without battery). This package includes the PowerShot S400 digital camera, 32 MB CompactFlash card, battery and battery charger (CB-2LS), USB and AV cables, wrist strap, and ArcSoft Camera Suite CD-ROM and USB drivers for Windows and Mac.", "title": "Canon PowerShot S400 4MP Digital Camera w/ 3x Optical Zoom", "price": 9.99, "salesRank": {"Camera &amp; Photo": 11062}, "imUrl": "http://ecx.images-amazon.com/images/I/41Q7YRRD7TL._SX300_.jpg", "related": {"also_viewed": ["B001SER48S", "B0007TJ5OG", "B001SER49M", "B0075SUHKI", "B000NK6J6Q", "B005MTME3U", "B0075SUHQC", "B0001G6U5W", "B0075SUHGC", "B00005JAD8", "B00B5HE2MO", "B0090SLJ1C", "B0075SUH5S", "B00AWYN182", "B0075T7NW2", "B004J3V8UU", "B0075SUK14", "B0034XFG1S", "B006UMM1AY", "B006UMM1J0", "B00B5HE2UG", "B001SER492", "B000AYKUUQ", "B00B5HE1SY", "B001SER47O", "B004HW73QQ", "B004J41T7Q", "B004HW73R0", "B0075SUI2A", "B0075SUFSC", "B0075SUHWG", "B0012Y6958", "B000EMWBT2", "B00AWYN0BU", "B0075SUIEI", "B00B5HE3NW", "B006UMM15O", "B000069Z5U", "B00B5HE3AK", "B00B5HE32I", "B00B5HE3IW", "B001O1GEU4", "B0012YC7AE", "B000099SGU", "B0075SUGQI", "B0011ZK6PC", "B00AWYMXZY", "B003ZSHNGS", "B001PK8FHY", "B003VTZE1M"], "buy_after_viewing": ["B003VNKNEQ", "B005HNF01O", "B00B5HE2UG", "B00B5HE2MO"]}}