{"asin": "B00005V6BB", "description": "Medal of Honor: Frontlinemarks the debut of the Medal of Honor franchise on the PlayStation2. InFrontline, you go behind enemy lines as Lieutenant Jimmy Patterson. Your missions include the D-day assault on Omaha Beach, tracking your Nazi nemesis aboard a speeding armored train, the epic battle for control of the Nijmegen Bridge, a strategic choke point in the Allied drive into the heart of Nazi Germany, and a top-secret, high-risk mission to steal the Ho IX flying wing. The Ho IX is an experimental Nazi jetfighter so powerful it could turn the tide of World War II.There are 20 levels of gameplay spread across six major missions, all based on real World War II events and all adding up to one complete and uninterrupted story line. Fully realized and highly-detailed 3-D environments include six times the number of nonplayer character animations as in the originalMedal of Honor. The game includes detailed German, British, and American troops, as well as Dutch civilians, all with full facial expressions and lip synch. More than 20 authentic WWII weapons include the Colt .45, Springfield sniper rifle, Panzerschreck rocket launcher, MG42 mounted machine gun, and the Browning automatic rifle. Enemy vehicles include panzer and tiger tanks, trucks, motorcycles with sidecars, and armored railway scout cars. There are also player-driven motorized railcars, trains, and mine carts.An improved enemy AI requires you to consistently vary your attack strategy as the situation dictates. Go it alone to accomplish your mission with the utmost stealth or work as part of a highly trained military unit to wreak havoc on the enemy. The game offers intense noncombat scenarios as well, such as a disguised, weaponless infiltration of an officer's pub brimming with Gestapo to make contact with a Dutch Resistance operative.Medal of Honor: Frontlineincludes more than 70 minutes of original orchestral music from composer Michael Giacchino, and the game as a whole features eight times more audio than the originalMedal of Honor.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51B7EMDWFTL._SY300_.jpg", "related": {"also_bought": ["B00009WAVB", "B00095LEC4", "B000MUU5MG", "B0008GJRRS", "B000G7YX14", "B0001I9YGC", "B000YYR3D4", "B0033T1UWW", "B000SFK0NY", "B0000696CZ", "B0009351R0", "B0009EHQVI", "B00004W4QS", "B000099T2H", "B00020LZAW", "B001AWDG44", "B00004YRQA", "B000G77WPS", "B0000A03AI", "B00002R28F", "B00020BV2E", "B00006GSNZ", "B0002CHIUQ", "B001MW91IW", "B00005O0I2", "B000TLU67W", "B0000503MO", "B0000690Z9", "B000B69E9G", "B00006JN5H", "B000087L4E", "B0000A1HW3", "B00009VE6D", "B0002IQC70", "B000GVYYFK", "B000083JTR", "B0009O7HVM", "B0002XL3BA", "B0000A0MDV", "B000088KH1", "B00009WAVD", "B00004YRQ9", "B001CDL6SE", "B0000C7GHG", "B000PS4X9G", "B00005ML10", "B00005J536", "B00006N5SZ", "B00005ME6N", "B0001ADAME", "B0002GTFJ4", "9629971372", "B000EHQDA0", "B00069BV7G", "B0002IQD1U", "B000099T2G", "B00008DHNL", "B0000690ZE", "B0009Z3HYW", "B000099T2E", "B00005BIG7", "B000069D39", "B00006IJJE", "B0002CNUN0", "B0001NE48U", "B00005NUIZ", "B00005R5PO", "B00005NCCR", "B0009Z3IXC", "B000067DPL", "B0002RQ3ES", "B0009SQF0C", "B000930DOQ", "B0000A8VBZ", "B000930DLO", "B00005OLX1", "B00006C28Z", "B00005UOS7", "B00012TIVY", "B00G6MW5CC", "B00009ZVHY", "B0000CGB1B", "B0013KW1B2", "B00006Z7HU", "B000BC2FD2", "B0007DFIK2", "B00019HNNC", "B0002CHJ9G", "B0007PLKZM", "B000277J00", "B000GPVUQ2", "B000069BCR", "B00006599O", "B00004YNVG", "B000KCX9M4", "B0001VGFK2", "B000093NQM", "B0045L3SNQ", "B00004TNB0", "B0000B0MNH"], "bought_together": ["B00009WAVB", "B00095LEC4"], "buy_after_viewing": ["B000YYR3D4", "B000PS4X9G", "B000LQZO22", "B00095LEC4"]}, "salesRank": {"Video Games": 12219}, "categories": [["Video Games", "More Systems", "PlayStation 2", "Games"]]}