{"asin": "B000JJM8XE", "description": "Logitech X-540 5.1 Speaker SystemSurround yourself with the sound of victoryTake your game to the next level with surround sound so rich and detailed, you can hear your enemies before they hear you. With this 5.1 surround sound system on your side, you'll hear every footstep and where the bullets are flying from. Frequency Directed Dual Driver satellite speakers and a thundering subwoofer create a three-dimensional soundstage that envelops you and immerses you in the action. From crisp clean highs to deep thumping bass, this is everything you need to go from playing the game to feeling like you're actually in it.Key FeaturesLogitech FDD2&#8482;Conventional Dual Driver DesignUniform, smooth                responseUneven response5.1 surround sound for an intensified game and movie experienceImmerse yourself in the action with richly detailed and accurately reproduced 5.1 surround sound. High-performance satellite speakers use Frequency Directed Dual Drivers (FDD2) to eliminate uneven frequency response&mdash;the sound distortion that occurs when some frequencies are artificially louder or softer than they were meant to be. The result?&nbsp; A smooth and uniform field of surround sound throughout the room, without the dead zones and hot spots sometimes created by conventional dual driver satellites.&nbsp;Matrix mode transforms classic games from stereo to surround soundYour favorite old games are about to take a giant leap in sound quality. Choose the Matrix Mode and the speaker system instantly converts 2-channel stereo to realistic 5.1 surround sound. The difference in audio detail is so dramatic, it's like hearing your classic stereo games, movies and music for the first time.&nbsp;&nbsp;Ported down-firing subwoofer gives you deeper, booming bassEnjoy deep, rich bass as its booming best. By facing the ported subwoofer down instead of straight ahead, bass is directed evenly throughout the room. Extra-deep rumbles and explosions make your games and movies more intense. Feel free to crank up the volume. Thanks to real-time bass equalization, you get clean, rich bass without distortion&mdash;even at volumes you can feel.Control pod with headphone jack puts sound control at your fingertipsWith the corded control pod, all your controls are at hand&mdash;power, master volume, bass level, even Matrix Mode. So it's easy to adjust sound in the heat of battle. And when you want to keep the game all to yourself, there's a headset jack for private listening.Versatile mounts let you customize your setupSetup your speaker system however you want to fit your listening environment. You can place the center channel speaker below your monitor. Or, to free up desk space, use the integrated clip to easily attach the speaker onto the top of your flat-panel display. You can also setup your four satellite speakers on a desk or mount them on the wall. Simply rotate the stands to switch from desktop to wall-mounted.Browse For More Logitech ProductsEnhance your listening experience with great Logitech products.Logitech Speaker System Z523&nbsp;&nbsp;Speakers with 360-degree sound help project audio evenly in all directions, so you get a great listening experience throughout the room.Ultimate Ears SuperFi 4 Noise-Isolating EarphonesFeaturing the same speaker technology and sound signatures used in our higher-end products, these compact earphones deliver detailed bass with crisp and clean mids and highs.Ultimate Ears SuperFi 5 Noise-Isolating Earphones&nbsp;Housed in a sleek, liquid silver body, the top-fire speaker produces a detailed and full soundstage&mdash;ideal for listening to a broad range of music genres.What's In The BoxPackage ContentsSpeakers: 4 satellites, 1 center channel, 1 subwooferControl PodColor coded audio cablesGame console adapterUser's manual2-year limited hardware warranty", "title": "Logitech X-540 5.1 Surround Sound Speaker System with Subwoofer", "price": 306.99, "imUrl": "http://ecx.images-amazon.com/images/I/41WrBdCDRjL._SX300_.jpg", "related": {"also_bought": ["B0006U3ACY", "B0002ZPJZY", "B004M18O60", "B000I1EYK8", "B0056PVM5G", "B0044DEDCA", "B004PSEJHS", "B00D6GINF4", "B003VAK1FA", "B0016LDZ36", "B009ISU33E", "B008KEPWMY"], "buy_after_viewing": ["B003VAK1FA", "B004M18O60", "B003VAHYTG", "B0027VT6V4"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]]}