{"asin": "B000WEQL02", "description": "The sequel to the award-winning  next-generation first-person shooter -- returns to Sin City.Tom Clancy's Rainbow Six Vegas 2is your last chance to rescue America's sexiest city from an escalating terrorist siege that will force you into heart-pounding action from beginning to end. The best are back and this time winner takes all.Back to Sin CityCoordinate with your TeamView larger.Intense Multiplayer ModesView larger.Next Gen Consoles generate realistic lighting effects.View larger.Taking the fight to the streets.View larger.What Happens In Vegas, Stays in Vegas...This is your last chance to rescue America's sexiest city from an escalating terrorist siege. You can play as Bishop, a new member of the Rainbow squad who is soaring through the ranks. Or you can customize your character with experience points earned in both single-player and multiplayer. Choose between a male or female character in the singleplayer mode.Unprecedented Character CustomizationFully customize your character choose your gender, facial configuration, hair, clothing, and weapons. Exclusive to Xbox 360 you can now take a photo of your face and place the image onto your character using the Xbox LIVE&#174; Vision camera and literally get into the game. A stat-tracking feature observes how your play style, unlocking new weapons and equipment  based off your performance. 11 new weapons, 13 multiplayer maps, 2 new game modes, and an improved ranking system makes Vegas 2's multiplayer option easier to locate and join online matches that are already in progress.Game Features:Ubisoft Montreal Returns - The award-winning studio responsible for the hit gameTom Clancy's  Rainbow Six Vegasis back with another unforgettable experience that will bring the Vegas storyline to a startling finale.Bigger, Bolder Vegas &#150; Explore brand-new Vegas hotspots for the first time by day. Whether it's the daylight-drenched Strip or the Nevada desert at dusk, all are superbly rendered in mega-watt Vegas style.Expanded Multiplayer Mode &#150; The highly acclaimed multiplayer that madeTom Clancy's Rainbow Six Vegasa must-have game has been expanded to include more than 10 new close-quarters maps perfect for dramatic face-offs, two new adversarial modes, a deeper rewards system, and improved online matchmaking.Unprecedented Character Customization - Fully customize your character: choose your gender, facial configuration, hair, clothing, and weapons. Even put your own face on  your character using Xbox LIVE Vision. Then, complete the Vegas storyline in single-player mode or&#151;for the first time ever in aRainbow Sixgame&#151;take your unique character online to battle other fully customized operatives -Xbox 360 version only.Vastly Improved Co-op Gameplay - New single-player maps with multiple entry points make co-op gameplay easier than ever. Have a friend jump into the action anytime, anywhere, and automatically switch from single-player to co-op mode&#151;all without affecting the storyline.Dramatically Revamped AI - Hone your most cunning tactics on terrorists equipped with thermal vision, night vision, and shields. Your enemies react differently each time you engage them&#151;ensuring that no two battles are ever the same.Extensive Tactical Options - Rely on your teammates to provide advanced tactical strategies like thermal scanning and leapfrogging to gain the upper hand against the toughest opponents.More Weapons and Armor - An expanded selection of camouflage, body armor, and weapons adds up to the most customizableRainbow Sixexperience yet.The Story So FarThe  terrorist threat to Vegas is still five years away, but the seeds of deceit are soon to be planted. And you, unknowingly, are about to play a central role.You are Bishop, leader of Rainbow's  elite Bravo Team. You've been ordered to a desolate observatory where a hostage stand-off is underway. Your mission is straightforward: infiltrate the observatory and protect the hostages should negotiations fail. But you're experienced enough to know that things have a funny way of not going as planned...2010 - Las Vegas, NevadaThe tragic events at the observatory are now a memory, but the terrorist threat in Sin City is very real. While Logan Keller is in pursuit of Irina Morales in Mexico, Six has ordered your team to Vegas. There, terrorist mastermind Alvarez Cabrero is hatching a scheme to bring Sin City to its knees&#151;and it's up to your team alone to stop him from turning Vegas into a devastated inferno.Return to Sin City for the last time inRainbow Six Vegas 2and put an end to the terrorist threat. There, you'll unravel a web of betrayal that will take you beyond the events ofRainbow Six Vegas. At a remote hideaway you'll witness the astonishing conclusion that will bring an end to the crisis in Vegas&#151;once and for all.About Team RainbowTeam Rainbow is a multinational task force comprising counter-terrorism experts from around the globe. Equipped with state-of-the-art weapons, Team Rainbow is deployed during terrorist crises. When all other attempts have failed, Rainbow is brought in to save the lives of  innocent people. They do not negotiate with terror. They destroy it.Rainbow began as an idea shared by John Clark and Domingo \"Ding\" Chavez. Clark, a former Navy SEAL and CIA operative, met Chavez during a covert  operation in Colombia. During the operation, Chavez was rescued by Clark. After that mission, Chavez joined the Central Intelligence Agency. Clark and Chavez developed a mentor-student relationship over the course of several missions together.Rainbow was created in 2000. Ding Chavez was made a Team Leader and began recruiting counter-terrorism operatives immediately. Experts in  close-quarters combat, demolitions, electronics, surveillances, and  reconnaissance were recruited. Snipers, hackers, soldiers, policemen, and contractors were all brought to Hereford, England, where Rainbow shares its headquarters with the British Special Air Service.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51bDhLY9p9L._SY300_.jpg", "related": {"also_bought": ["B000G7PMXC", "B000LXIO6I", "B00EVWYF0E", "B000SQ5LQ4", "B000A0EFJW", "B000X25GX6", "B0086V5V9A", "B0037LTTRO", "B001TOQ8J8", "B000CBVC0Y", "B0050SY5BM", "B000TI836G", "B000RHZ9JI", "B00503E8S2", "B002BRZ8BQ", "B00320JDWG", "B000WSE2WM", "B000KGD1GO", "B000ZK9QD2", "B002I0K50U", "B0050SYFM6", "B0009S4UOA", "B00008G764", "B000HCQK0A", "B001HWB68K", "B0050SY4DG", "B002I0H79C", "B00269QLI8", "B0023CBY4E", "B0014ULQB2", "B001AWIP68", "B003GSZ9ZE", "B000TG530M", "B00354NAYG", "B0030GBUCS", "B001TORSII", "B003O6G5TW", "B0016B28Y8", "B0010AYJXI", "B0009SQFHA", "B00G6MW5CC", "B0050SYY5E", "B00AA4FDTY", "B0050SYWVA", "B003VWGBC0", "B002BRZ852", "B000UUFQZE", "B001REZLY8", "B002I098JE", "B00AJGVIC4", "B004PFS9OK", "B0050SY77E", "B002BSA20M", "B005C2D2MO", "B0085CA8NY", "B0050SYPV2", "B001D25M1Q", "B0050SYV70", "B001UWGDC6", "B0050SYK44", "B000R0SR9E", "B00EFFW0HC", "B0065NP6NC", "B003P9C6QY", "B002DC8GEK", "B000ZKDOV2", "B002V16T0Q", "B002I0H2AG", "B001ASJIRM", "B003H0CC2O", "B0022TNO7S", "B002SRSQ72", "B00F3F2XAW", "B000PE0HBS", "B003MUNG0G", "B002I0JA7E", "B0050SYX8W", "B000GCGB3M", "B002I0JGDM", "B002DC8GKE", "B0034JKYO6", "B005THAX5Q", "B0050SYILE", "B000OLXX86", "B000FRS9II", "B00ERDGMT4", "B000ZK6950", "B005GM3Y5U", "B000H94PVO", "B001QXNBJM", "B004HYK956", "B00GJSUXLS", "B004H0J5S2", "B00BMFIXT2", "B00BRQN2EM", "B00BU3WWOS", "B000G75AXY", "B0016B8Q6M", "B00163LW7A", "B003Q53VZC"], "bought_together": ["B000G7PMXC", "B000SQ5LQ4"], "buy_after_viewing": ["B000G7PMXC", "B0086V5V9A", "B000SQ5LQ4", "B00EVWYF0E"]}, "salesRank": {"Video Games": 2815}, "categories": [["Video Games", "Xbox 360", "Games"]]}