{"asin": "B001NJMMHG", "description": "Beloved by role-playing game fans around the world,Dragon Quest V: Hand of the Heavenly Brideis the second installment in theDragon Quest, Zenithia Trilogy and has finally made its way to North America. Follow a journey that crosses three generations of a family's legacy in a classic Nintendo DS RPG brimming with new ideas, numerous lands to explore, multiple branches to enhance replayability, and dozens of your favoriteDragon Questmonsters.Enjoy traditional RPG play.View larger.Explore rich environments.View larger.Jump in to mini-games.View larger.Follow easy in-game direction.View larger.StoryInDragon Quest V: Hand of the Heavenly Bride, what begins as an innocent childhood voyage of a boy accompanying his father on a journey soon develops into an eye-opening adventure of a brave young man traveling the world as he faces life-altering decisions that transcend generations. You - a hero in the making - determine your own path, choose your wife, and befriend a wagonload of quirky monsters along the way. Indulge in the colorfulDragon Questworld created by Yuji Horii, combined with the charming characters and monsters designed by Akira Toriyama and memorable soundtrack from famed composer Koichi Sugiyama to create an unforgettable gaming experience.CharactersAlthough players will make the acquaintance of many characters and monsters throughout during their travels, here are just a few of the faces they can hope to see.Young Hero (You)As a child you discover a world filled with bizarre creatures and fantastical realms while traveling with your father. The owner of a truly pure heart, you have an unusual affinity with monsters.PankrazPankraz is your father, with whom you travel with as a boy. He has a hardened look and a talent for magic. What is the purpose of his quest? There is more to Pankraz than meets the eye.Young BiancaYou meet young Bianca in the town of Roundbeck while traveling with your father. Bianca is one of your oldest friends and has an animated personality overflowing with curiosity.Great SabrecubSaved from the hands of the town bullies as a cub by you (The Hero), this great sabrecub travels and fights by your side during his youth and will mature along with you.GameplayAlthoughHand of the Heavenly Brideis based in standard turn-based RPG gameplay mechanics like character leveling through with increased experience points and armor and weapon equipping for use in combat, it does add something new to theDragon Questseries, monster taming. Throughout your quests you will encounter monsters both known and new to theDragon Questuniverse. Once tamed, these can join your party, level up just like your other party members and provide valuable aid in combat.Key Game Features:Journey through a beautifully rendered 3D world, with dynamic dual-screen presentation and newly animated monsters.Recruit a unique cast ofDragon Questmonsters and create an indestructible party of your own.Brace yourself for some life-altering decision making - a key decision will affect the outcome of the game, and change the course of the hero's life forever.Take a breather from the main quest with addicting mini-games like Bruise the Ooze, T 'n' T, the Slurpodrome, and the Tombola.Collect and customize knick-knacks from around theDragon Questworld to create a personalized knick-knackatory.Use the wireless capabilities of Nintendo DS to exchange in-game creations and one-of-a-kind collection of rare items with friends.", "price": 59.99, "imUrl": "http://ecx.images-amazon.com/images/I/61vvWLXNX9L._SX300_.jpg", "related": {"also_bought": ["B002I0GKIQ", "B001AF1NVY", "B002I0EH6I", "B004CVWETI", "B001E27DLM", "B00184219U", "B001H8Y7DA", "B001TOMR6Q", "B0050SVP4W", "B0009A4EV2", "B003UI518A", "B000GABOTU", "B00136MBHA", "B001CU4EJ0", "B003O8EDUS", "B0009Z3K9E", "B000SSQPU8", "B000GIXIPK", "B00005OLWB", "B000IOM45C", "B001A01FD0", "B00171NYHM", "B00KVRK39A", "B00KWIYPZG", "B002DC8GWW", "B00GV4V8XC", "0744012910", "0744012384", "B0010YOQIM", "B00005ME7X", "B003S55EX2", "B0054J1LBO", "B00DZIX39E", "B000SSNCYU", "074401039X", "B003FBL86Q", "B00KWFCU4M", "B000Q6ZLMA", "B000GA8UAQ", "B00JKM09Z0", "B009LEIUY4", "B000B69E96", "B002I09286", "B001QLC2YY", "B001TOQ8WU", "B002TDIEDG", "B001O1PAMC", "B000Q6J51S", "B00AKIPBNS", "B003UI518U", "B000B8J7K0", "B002EE5RKI", "B004R0TR0S", "B002I08WVY", "B000FRV2UK", "B003IOGPAO", "B00GV4V8YQ", "B001TOQ8UW", "B002BS4834", "B003YVK5T8", "B001INDEOW", "B0012NWBH4", "B0010YOQIC", "B00K85X1TE", "B00D87TCN8", "B00K848IH0", "B00BY0G0YU", "B000JLL3UQ", "B007CSF3GO", "B001BWRBA8", "B0006TO2HM", "B000035XQ6", "B00KWFY04A", "0744010985", "B00B2QL2Y4", "B00I3DOZ8O", "B000NVKZ06", "B00KVMHSUM", "074401543X", "B0089X37NW", "B000G0O6CW", "B002EWD02C", "B00LNBQ8SI", "B0009XEC02", "B00LNBQ8UG", "B001QTW2IM", "B003O6E800", "B003O6E7DI", "B001NJKHWI", "B001OALQIA", "B00KWEHBAG", "B00JQI471A", "B0009K7ESC"], "bought_together": ["B002I0GKIQ", "B001AF1NVY"], "buy_after_viewing": ["B002I0EH6I", "B002I0GKIQ", "B004CVWETI", "B001E27DLM"]}, "salesRank": {"Video Games": 4785}, "categories": [["Video Games", "Kids & Family", "Nintendo DS", "Games"], ["Video Games", "Nintendo DS", "Games"]]}