{"asin": "B0013TRZI2", "description": "High-Speed Reader for Professional Photographers  Lexar offers high-performance Professional UDMA readers designed to help professional photographers and advanced photo enthusiasts maximize their post-production workflow speed. Lexar Professional UDMA Readers are ideal for use with high-speed cards, and provide incredibly fast download speeds when paired with a UDMA card-so you can maximize your workflow and minimize your post-production time.   The Lexar Professional UDMA Dual-Slot USB Reader is a high-performance reader with a compact, design that enables the fastest download speeds from the highest capacity CompactFlash (CF) and Secure Digital (SD) cards. Fully compatible with UDMA CF, standard CF, SD High Capacity (SDHC), and SD cards, the reader provides versatility and the ability to leverage blazing-fast UDMA CF card speeds.   The Lexar Professional UDMA Dual-Slot USB Reader satisfies the demand for faster transfer rates from card to computer. The reader has two slots, allowing it to read both CF- and SD-format cards, including UDMA CF and SDHC. The rugged Lexar Professional UDMA Dual-Slot USB Reader has a compact, portable design that's perfect for the photographer on the go. And its dual-slot, with slots for both CF and SD cards, makes it incredibly versatile.  Lexar is the brand trusted by professionals. When used in conjunction with a UDMA CF card, the reader's high-speed performance allows you to reliably improve workflow and drastically accelerate download speeds from card to computer-saving you time and money. The portable Professional UDMA Dual-Slot USB Reader comes with free, dedicated customer support and a two-year limited warranty. Designed with professional photographers in mind, the Lexar Professional UDMA Dual-Slot USB Reader delivers high-speed transfer rates, so you can get back to the business of photography.  *Highest transfer speeds achieved when paired with a UDMA memory card.", "title": "Lexar Dual-Slot USB 2.0 Flash Memory Card Reader RW035-001", "price": 39.9, "imUrl": "http://ecx.images-amazon.com/images/I/41SXoN53kOL._SX300_.jpg", "related": {"also_viewed": ["B0050C9ZMC"], "buy_after_viewing": ["B007FEFQDA", "B0050C9ZMC", "B008VQ2YUY", "B001NS0OZ4"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Memory Card Readers"]]}