{"asin": "B0001NNLHK", "description": "If you're looking to upgrade your portable music listening experience, the Shure E3c sound isolating earphones deserve a serious look. The E3c's offer a level of sensitivity and range that places them in the audiophile tier of earphones and fortunately, Shure has priced them to make this kind of quality within reach.In many ways, judging sound quality is all about making comparisons, and when the E3c's are matched against their big brother, theShure E5c earphones, the E3c's do reveal a noticeable loss of dynamic range and clarity. Of course, the E5c's are worth every penny for those who want to spend more on earphones than they spent on their iPod. The E3c's, on the other hand, come out a clear winner when you weigh their qualityandcost.DesignThe E3c earbuds are small and easy to insert in the ear-- easier, in fact, than the E5c earbuds, which are larger and less friendly to folks with small ears. The E3c's thin and pliant cords are light and easy to manage. They're also designed to be looped over the back of the ear, but some testers found it uncomfortable and awkward to keep them there. These testers also said they preferred inserting the earphones upside down, letting the cords dangle downwards from the ear to avoid hassles. By comparison, the E5c earphones feature a bendable stiffening material in the section of cable that runs behind the ears, allowing the listener to loop the cables over and behind the ear more securely. It would be nice to see this simple solution added to the E3c earphones.Shure did choose to give the E3c's the same gold-plated, 3.5mm input connector as the E5c's. The connector has a low-profile elbow bend to minimize accidental unplugging and snags-- great for laptop and airline users. And just like the E5c's, the E3c's come with a number of earplug \"sleeves\" packaged in what Shure calls a \"fit kit\". Our testers had little trouble finding a sleeve that felt comfortable. We especially liked the expanding foam sleeves that, like those foam dinosaurs that grow in water, expand to fit the contours of the ear canal.Sound QualityAs we listened to a broad range of musical genres on the E3c earphones it was hard, once again, not to make comparisons with the E5c's. If you aren't even entertaining the notion of purchasing the E5c's, then make sure you never have occasion to listen to them. Rest easy in the knowledge that the E3c's deliver clear, crisp highs and rich, thundering lows. Delight in the fact that they excel at delivering the celebrated earphone experience; the external world is largely silenced and the music resonates inside your head. Meanwhile, if you are toying with the idea of stepping up to the E5c's, go ahead and give both models a listen. Although the difference between the two is not stark, we immediately noticed that we had to drive the E3c's at higher volume to get the same kind of resonance and fullness the E5c's deliver at a relatively lower volume.Comparing the E3c's to the E5c's is a bit unfair, but in many ways, the comparisons revealed just how goodbothsets of earphones really are. The E5c's represent an extremely high benchmark, and fortunately for those who don't want to spend a bundle on top-quality earphones, the E3c's aren't too far off the pace. We recommend them as a massive upgrade to the standard headphones that ship with most portable music devices.--Joshua GunnProsSimple, compact designDesigned for compatibility with most earsExcellent sound quality at a non-stratospheric priceConsCord ergonomics could be betterLower-quality sound than the E5c model generates unplanned spending urge", "title": "Shure E3c Sound Isolating Earphones (Discontinued by Manufacturer)", "price": 97.0, "imUrl": "http://ecx.images-amazon.com/images/I/21vIV35bM8L._SY300_.jpg", "related": {"also_viewed": ["B004PNZFZ8", "B0015PN3W6", "B00426DND4", "B000NDLJNG", "B0000CE1UO", "B0007XGOTG", "B0000CE1VP", "B003NSBKSM", "B000E5GKW8", "B009ZNFEEU", "B000O8ENQK", "B003NSBKT6", "B002LWOKJ2", "B00EWOK09G", "B0015PN3X0", "B0013JT3XC", "B004CXBJ6A", "B00373PE9Y", "B0050L5VO4", "B003S3RFIQ", "B00DIUGW6A", "B000XPG2QI", "B00275F2GS", "B0015PKGH6", "B001MBLBXQ", "B003NSBKSW", "B003BYRGKE", "B001NTFAOS", "B0055P9K38", "B000TUZL3W", "B0007WZLDC", "B0094S35W4", "B003YKG2YQ", "B00EANUQ4S", "B0012UUL0Q", "B0046HADYQ", "B00EXN4GK0", "B00EA90QGA", "B0013JH30M", "B000VHUE0S", "B001TDKMLE", "B005Y7TTRE", "B0016MOC28", "B000NIOVWC", "B000300Y9O", "B000XP8DJC", "B003BYRGJ0", "B003S3RFJ0", "B000UF3AYI", "B003BYRGKY", "B001DX9EE6", "B007TCXGVC", "B0065MPIT0", "B001LEH7LE", "B003YKG2XC", "B002DP1FTU", "B000WAHFBK"], "buy_after_viewing": ["B004PNZFZ8", "B0015PN3W6", "B00426DND4", "B00275F2GS"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]]}