{"asin": "B0094C5C3A", "categories": [["Beauty", "Skin Care", "Face", "Creams & Moisturizers"]], "description": "AINHOA is an award-winning series of professional beauty products for use in the comfort of your home.  Pleasurable, convenient, made from the highest quality ingredients, these are Spa-quality products at affordable prices. Ainhoa has been available in the worlds&#x2019; finest hotels and spas for over 15 years, offering luxurious treatments using their products.  Whether you want daily use products or an intense treatment, whatever your skin type; the stunning Ainhoa range has the right products for you.  Treat yourself today and enter the exclusive world of Ainhoa. MEN is a complete range of products for face and body that have been designed just for Men. Formulated with Caviar Extract and natural plant extracts these products prepare and treat men's skin and their issues. The formulations are non-oily, gently and sensually fragranced, offering a smooth comfortable feel. MEN products are firming, calming, anti-aging, nourishing, rehydrating and help provide elasticity to the skin. Caviar Extract is rich in vitamins A, D, B1, B2, B6 and the elements Cobalt, Copper, Phosphorus, Silicon, Zinc; as well as Amino-Acids Glycine, Lysine, Histidine, Arginine and Asparagine. Additionally a source of marine DNA which is a key element to skin cell regeneration.  The potent combination of these ingredients intensifies the processes inside the skin cells and at the same time moisturizes, slowing down the aging process. MEN Vitality 24 Hours Cream is a daily use creamy gel moisturizer for applying at day and night. It is hydrating, nourishing, regenerative, protecting, anti-aging, firming, anti-oxidant and anti-wrinkle. It contains Caviar Extract, Vitamins, Glycosheres and Green Tea as well as Hyaluronic Acid.  Skin is left feeling smooth, firm and toned. The MEN range is recommended for all male skin types of all ages. Ainhoa products that compliment this range are:OXYGEN Oxygenating Cream, OXYGEN Oxygenating Facial Mask, SPECIFIC Glycolic Acid and SPECIFIC Hyaluronic Acid.", "title": "AINHOA Men Vitality 24 Hours Cream, 1.7 Fluid Ounce", "price": 53.0, "salesRank": {"Beauty": 488292}, "imUrl": "http://ecx.images-amazon.com/images/I/41Mmn99f9GL._SY300_.jpg", "related": {"also_viewed": ["B004ALIOZ8", "B00068GANC", "B006JV8DHG", "B00303YYTW", "B0042L2I6W", "B002ZSW7OC", "B00GDFNKKS", "B00J7NVLTA", "B003607ZNG", "B00G6RH4W8", "B004PC49HE", "B0018D4GAI", "B009JSC3I6", "B0006M559S", "B002ZSW7MY", "B000JNQSIQ"]}}