{"asin": "B000HCL5QO", "description": "Viva Pi&ntilde;ata is a window to another world where wild-roaming, living Pi&ntilde;ata animals inhabit a growing, changing garden world. Take control of this environment and the pi&ntilde;ata within it, influencing its contents to create your very own pet paradise. The \"Viva Pi&ntilde;ata\" gameplay experience presents a customizable, social and spontaneous world in which gamers play an absolutely crucial role. The world players create is an evolving paradise teeming with fantastic living pi&ntilde;ata creatures and vibrant plant life, all determined by the player's choices and actions. \"Viva Pi&ntilde;ata\" boasts the following qualities:Rare releases their second exciting title for the Xbox 360.Create the perfect environment for your favorite pi&ntilde;atas!View larger.Watch as pi&ntilde;atas adopt to the garden spaces you've created for them.View larger.Both sweet and sour pi&ntilde;atas will enter your garden.View larger.Go online and help other pi&ntilde;ata owners like yourself!View larger.Creating a living gardenIt's your very own world. Your choice of contents will determine which of the pi&ntilde;ata species are attracted to your world, since they all have individual requirements. Sowing grass, digging ponds, planting flowers and growing trees all affect which of the unique pi&ntilde;atas you will see. It's not just about plants, either; there is a whole range of ornaments and structures that could be decisive. Your reward for creating an appealing paradise is to watch the pi&ntilde;atas visit and eventually reside there, which is where the fun really starts.Getting to know and understand the personalities and requirements of your pi&ntilde;ata is essential if you want them to stay happy and thrive. Make your world their ideal paradise, and they'll want to raise a family and expand your community. Players decide how much help they want from the local guides, shopkeepers and work force. Go it alone or get them involved as you choose. Once you have resident pi&ntilde;atas, you can begin to personalize your loyal community. Pi&ntilde;atas can be individually named and given their own personally designed tag to put on display as a declaration of their home turf. And the customization doesn't end there. You can make the colorful critters more distinctive by customizing them with all kinds of costumes and accessories.A thriving community awaitsThe \"Viva Pi&ntilde;ata\" community is a rewarding place to be, whether you remain within the boundaries of your own world or venture out into the real world or your friend's pi&ntilde;ata world via Xbox Live, the first and only global, unified online console games service. Via the Xbox Live online community, players can contact other gamers to lend a hand, lay down a competitive challenge or trade items. Plus, it's not just new pi&ntilde;ata species that are drawn to your world; untamed sour pi&ntilde;atas with bad attitudes and troublemaking ruffians do their worst to spoil your creation and must be dealt with. Maintaining harmony within a growing community isn't always easy when rivalries, illness, injuries and even candy-spilling fights occur. If players turn their backs, who knows what their pi&ntilde;atas will do?Special edition extrasBoth kids and adults can break into the two-disc Special Edition \"Viva Pi&ntilde;ata\" Xbox 360 game with added bonuses for the whole family to enjoy. The Special Edition game, available for a limited time, will include playable demos of the season's hottest family-friendly titles and an episode from the \"Viva Pi&ntilde;ata\" animated series. In addition to the \"Viva Pi&ntilde;ata\" game, which will allow players to create their own environment where they can attract and host more than 60 species of wild pi&ntilde;atas and customize pi&ntilde;ata-filled adventures in their unique-ever-growing world, the Special Edition \"Viva Pi&ntilde;ata\" game will include playable demos of LucasArts' \"LEGO Star Wars II: The Original Trilogy,\" the arcade classic \"Frogger,\" \"Cloning Clyde,\" \"Time Pilot,\" and \"Marble Blast.\" Also included in the Special Edition \"Viva Pi&ntilde;ata\" game will be a sneak peek at the wacky, zany, anything-can-happen animated TV series, produced by 4Kids Entertainment and Bardel Entertainment. With this full-le! ngth episode of the colorful animated series, Kids can experience Pi&ntilde;ata Island for themselves, where multitudes of happy, colorful pi&ntilde;atas live the sweet life.", "price": 123.92, "imUrl": "http://ecx.images-amazon.com/images/I/51R3kJoAGWL._SY300_.jpg", "related": {"also_bought": ["B000UKZ208", "B0019MRKNI", "B000P297JI", "B00BU3ZLJQ", "B00IU3MSF4", "B000R0SRNU", "B000VWQWHC", "B0019MLWL4", "B000R0URWE", "B0023CDW9Y", "B003VJKJG2", "B00005NZ1I", "B000FRVCAA", "B001D25M1Q", "B004X56OU8", "B000WMEEAI", "B003ZSP0WW", "B0014FMHE2", "B002I0J9M0", "B005FLRUCU", "B002EE5RD0", "0761554378", "B000B7Q4CA", "B000RI17FM", "B001JICM12", "B0016NM7BU", "B00005O628", "B003S2MXO8", "B0088MVOES", "B00IMVRVA6", "B0050SYE40", "B0028ZJ4ZW", "B00009WAUF", "B00559XGXO", "B00CBVHI2Y", "B000PD0HQE", "B008OQTRYW", "B007MM9E4C", "B000F3AADE", "B0050SYYTK", "B002BS4JDS", "B00936K09S", "B0050SYAQ2", "B0037UCTCW", "B002I0J8RQ", "B002WW68C8", "B004YVOCYG"], "bought_together": ["B0019MRKNI", "B000UKZ208"], "buy_after_viewing": ["B0019MRKNI", "B003VBK1E0", "B000VWQWHC", "B003ZSP0WW"]}, "salesRank": {"Video Games": 3609}, "categories": [["Video Games", "Kids & Family", "Xbox 360", "Games"], ["Video Games", "Xbox 360", "Games"]]}