{"asin": "B00005LE75", "categories": [["Electronics", "Camera & Photo", "Lenses", "Camera Lenses", "Digital Camera Lenses"]], "description": "Lens-making is an art--Nikon artisans craft Nikkor optics from the finest materials, taking pride in adding their intellect and technique to bring the world's finest lenses to life. They push the leading edge of lens-making in their effort to provide the \"glass\" that makes the world's greatest pictures.AF Nikkor lenses work with Nikon SLRs for optimal performance, even the very latest. The Nikon 85mm f1.8D AF Nikkor is a compact and portable medium telephoto lens ideal for indoor or outdoor portraits. An excellent choice for your first telephoto lens, it features subtle blurring of background for beautifully natural and evocative portraits, Rear Focusing system for fast and smooth optical performance, and weighs 13.2 ounces.Nikon Super Integrated Coating ensures exceptional performanceTo enhance the performance of its optical lens elements, Nikon employs an exclusive multilayer lens coating that helps reduce ghost and flare to a negligible level. Nikon Super Integrated Coating achieves a number of objectives, including minimized reflection in the wider wavelength range and superior color balance and reproduction. Nikon Super Integrated Coating is especially effective for lenses with a large number of elements, like our Zoom-Nikkors. Also, Nikon's multilayer coating process is tailored to the design of each particular lens. The number of coatings applied to each lens element is carefully calculated to match the lens type and glass used, and also to assure the uniform color balance that characterizes Nikkor lenses. This results in lenses that meet much higher standards than the rest of the industry.Rear FocusingWith Nikon's Rear Focusing (RF) system, all the lens elements are divided into specific lens groups, with only the rear lens group moving for focusing. This makes autofocusing operation smoother and faster.Distance informationD-type and G-type Nikkors relay subject-to-camera distance information to AF Nikon camera bodies. This then makes possible advances like 3D Matrix Metering and 3D Multi-Sensor Balanced Fill-Flash. Note: D-type and G-type Nikkors provide distance information to the following cameras: Auto exposure; F6, F5, F100, F90X, F80, F75, F70, F65, F60, F55, F50, Pronea S, Pronea 600i, D2 series, D1 series, D100, and D70s/D70. Flash control; F6, F5, F100, F90X, F80, F75, F70, D2 series, D1 series, D100, and D70s/D70 cameras.What's in the Box:Lens, 62mm snap-on front lens cap, rear lens cap LF-1, screw-in hood HN-23.", "title": "Nikon 85mm f/1.8D AF Nikkor Lens for Nikon Digital SLR Cameras", "price": 711.89, "imUrl": "http://ecx.images-amazon.com/images/I/3197554SCHL.jpg", "brand": "Nikon", "related": {"also_bought": ["B00004ZCJJ", "B00005LENO", "B00005NPWK", "B00005LE6Z", "B0099XGZXA", "B00005LE72", "B00005LEN4", "B0000BZL7S", "B0042X9L6A", "B00009R97B", "B0045KGZOG", "B0031CS83U", "B0042X9LC4", "B001S2PPT0", "B000BYCKU8", "B008B14TQ6", "B0095ZKUD8", "B0045TYDNC", "B00FOTF8M2", "B007VGGIRK", "B0002EMY9Y", "B008MLAT78", "B0099Y1QM4", "B00006I5J4", "B00005LEOC", "B004Y1AYAC", "B0099XHB4M", "B009DJ1THW", "B00009R9BT", "B0076AYNXM", "B004863FRW", "B0095ZLP3C", "B00007EDZG", "B00009R96C", "B002ZIMEMW", "B00DORFOBG", "B00004ZCJG", "B00BXA7N6A", "B004EHJWRW", "B001GCVA0U", "B000MVF1LA", "B003L1ZYZ6", "B0034WR19Y", "B005XOIFNW", "B0080JH3YE", "B001G7PMMC", "B00005LE71", "B0000BZM56", "B003Y2V0A0", "B004BFXBXI", "B00BI9X7UC", "B0007U00XK", "B00009R97U", "B00005LEOI", "B004XY65WQ", "B00017LSPI", "B00007EDYY", "B003Y30334", "B001F6TXME", "B0098TG67U", "B008BYK53O", "B001542X64", "B00436G2OU", "B0079M711S", "B00005LEOH", "B004LEAYXY", "B00005MEAI", "B000BYCKUI", "B00005Y3OM", "B00006I5J7", "B007BZRXJ8", "B00004ZCEF", "B0069R7FFQ", "B000KZ70JE", "B002VPE1WK", "B000JLK5UU", "B00004ZCJM", "B000EOSHGQ", "B005LFT3MA", "B00004ZCI3", "B007M54E1M", "B00137NMMW", "B007NDL56A", "B004AZ38Z0", "B007XOYBE2", "B005UG3KS8", "B004ABHKZ8", "B00006JN3G", "B0019SHZU0", "B002NU5UW8"], "bought_together": ["B00004ZCJJ"], "buy_after_viewing": ["B006TAP096", "B00005LEN4", "B004Y1AYAC", "B0000BZL8H"]}}