{"asin": "B0036RH93K", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]], "description": "Coby's MP620 Video and MP3 Player offers playback of music, videos, photos, and text files, with intuitive navigation and a brilliant 1.8-inch TFT LCD display. With 4 GB of memory you'll get enough room for about 1000 songs, and Coby's Media Manager software is included for easy and hassle-free media syncing. A great media player without the huge price tag.A great media player without the huge price tag.Click to enlarge.Enjoy your favorite tracks with ID3 tag info such as artist, album, etc. displayed.Share your favorite photos one-at-a-time or in slideshow displays.Use Coby's Media Manager software to easily sync your device, or just drag and drop files.1.8-Inch LCD DisplayEnjoy your videos, pictures, and album art on the go with the MP620's color TFT display.4 GB Flash MemoryThe MP620 features 4 gigabytes of flash memory on-board, enough room for up to 1000 songs.Rechargeable BatteryGet up to eight hours of music playback on a single charge with the integrated rechargeable Li-Poly battery.Intuitive ControlsNavigate the MP620's features with ease using the circular four-way button and middle \"enter\" button. Get to exactly what you're after, right when you need it.Enjoy Your MediaThe Coby MP620 is ready for your favorite music, movies, and photos, so you can take them anywhere--whether it's for your own enjoyment, or a little sharing.Play back your favorite MP3/WMA music files for hours of entertainment. If your music files contain ID3 tags, you will be able to view your tracks by Artist, Album, or Genre. Create a quick playlist on the fly, enjoy random playback, repeat mode, and more. For the lyrics freaks, LRC files are also supported, so you can view the words (including synchronized timing display).Use the photo browser to explore and share your photo files. JPEG and BMP formats are supported, and the slideshow function makes a great way to share with friends.Support is offered for video in the MTV format, at 128x128 pixel resolution, and 25 fps (frames per second). Basic controls--e.g., fast-forward, rewind, scan, etc.--are provided for your convenience.Integrated FM RadioUsing the headphones and an antenna, the MP620 delivers FM radio, so you can check up on the news or your favorite programming on the go. Preset your favorit stations for quick access, or have the MP60 do a quick scan of local stations.Equalizer PresetsTo further dial in your sound, pick an EQ preset that works with whatever you're listening to: Normal, Pop, Rock, Classic, Jazz, or Bass.Text FilesRead text files on your screen, including eBooks in the TXT format. Set font color, turn on auto scroll, and save your current location with \"bookmarks.\"Choose Your SoftwareThe included Coby Media Manager software will let you convert your existing audio and video clips to the correct formats, for enjoyment on your device. You can also choose to handle the conversion in your own preferred way, and simply drag-and-drop files onto the device like any other system folder.USB 2.0This device uses USB 2.0 for speedy file transfers when syncing.What's in the Box4GB Coby MP620 (Red), Stereo Earphones, USB Cable, User's Manual", "title": "Coby MP620 4 GB Video MP3 Player with FM Radio (Red) (Discontinued by Manufacturer)", "price": 24.28, "imUrl": "http://ecx.images-amazon.com/images/I/41D3wS41qvL._SY300_.jpg", "brand": "Coby", "related": {"also_bought": ["9985558634", "B0036RA4M8", "B001PAB0MQ", "B0035P4C06", "B0035PBHU4", "B00358PRD4", "9985558642", "B00777264W", "B005BJUZOG", "B0037255EY", "B003X26VA0", "B006Z2Z2GO", "B0035PBHX6", "B003ELYQJI", "B005BJQTDC", "B002I006XG", "B001PAEAQO", "B0058TKWTM", "B0035P8DO2", "B007B5TOZY", "B0036ZHNJW", "B0050GNIW6", "B005P5MISM", "B00BN0MZY0", "B002MAPT7U", "B009IJE2SU", "B003ULP5PG", "B00DP4INH0", "B004WODP20"], "bought_together": ["B0036RA4M8", "9985558634"], "buy_after_viewing": ["B005BJQTDC", "B0036RA4M8", "B0035PBHU4", "B002MAPT7U"]}}