{"asin": "B001HN5HOS", "description": "From the ManufacturerKeep connected and in touch with the current events of the day and the treasured family memories of the past. The Intouch IT7150 wireless Internet frame seamlessly transfers digital content from the PC or internet to a portable touch screen frame making it easy to view and share photos, listen to live Internet radio or WEB TV and receive the latest news on favorite hobbies in a comfortable home setting. Digital photo frames have been hot for a while, but the Intouch IT7150 is the first wireless Internet frame to combine multimedia content on an all touch screen, making it the most versatile and easy to use frame on the market today.Easy-To-Use Intouch IT7150 features True Touch Screen Photo Viewing, Internet Radio, WebTV, RSS Feed Capabilities RSS Feed CapabilitiesThe wireless Intouch IT7100 provides you a multimedia window to the world in a comfortable setting without having to be glued to the home office PC. In addition to viewing and sharing photos, the Intouch IT7100 provides more content as a portable multi media player featuring audio a nd video playback and live Internet radio.Easy-To-Use Intouch IT7150 HighlightsYou have the flexibility to view photos with a memory card, but isn't that so yesterday? Instead connect your frame to a networked PC via your wireless network. Friends and family can also add photos and content directly to the frame, using the world wide web, making it fun for everyone to stay up-to-date even over long distances. With a free subscription to FrameChannel, a web-based content provider, you can also access and share photos stored on your favorite photo websites like Facebook, Flickr, Webshots and Picasa, so even grandma can view the latest photos of the grandkids without ever touching the PC. FrameChannel also offers over 400 channels of news, weather, traffic and sports content that you can select personally and have automatically delivered to your framesAccess to more contentUpdate content remotelyTouch Screen is an intuitive user interface that&rsquo;s like a familiar stranger that you know you&rsquo;ve never met, but there&rsquo;s this captivating connection. There&rsquo;s no anxiety, no discomfort and using it comes natural. If you like the feeling of being in command, Touch Screen is the way to go. This latest technological breakthrough empowers you to bring features to life while having fun.Easy to set upEasy operationEasy text input through on-screen QWERTY keyboardPower up your Intouch IT7150 with versatility and attitude. Your IT7150 comes equipped with a universal input power adaptor cord for whenever you feel like powering up. Don&rsquo;t need the hassle of a cord? Your digital picture frame also comes with its own rechargeable battery. You and your loved ones often time desire portability. Well, rechargeable batteries offer the family this flexibility.No longer glued to your home PCComplete freedom on where to watchNo dangling cordsWe&rsquo;re pleased to say that the IT7150 comes with a level of sophistication that&rsquo;s incomparable to yesterday&rsquo;s conventional static picture frames. Think of your IT7150 as an old friend with a new face. We&rsquo;ve leveraged the latest technology to bridge the gap between the millennial generation and beloved Golden agers. This picture frame does not only lets you enjoy your snap shots but also allows you to keep in touch with news, sports, weather and more. Even popular websites like Facebook, Flickr and Picasa are brought to you on the frame. Would you like to play some music while you watch? No problem, this frame does it all.Crystal clear photosStay up to date with past memoriesGet weather, news and sports updates through FrameChannelUpdate on the internet or PCPlay music in the backgroundExperience radio from all over the world with unlimited choices of internet radio stations. Whether it is your favorite local internet radio station or music from the other side of the world, whether you are in to classical music or hip hop, with over 13,000 channels you can keep exploring.Listen to local and far away radio stationsOver 13,000 internet radio stationsOver 8,000 podcast stationsNo subscription feesWeb TV or also called Live Internet TV is becoming increasingly popular. No matter what geographical market you are in, you can experience video from all over the world. The stations range from reputable TV stations to obscure niche oriented stations. Have fun exploring.Watch local and far away TV stationsOver 850 Web TV stationsNo subscriptions feesThe Intouch frame comes pre-programmed with commonly used news sources with the option to add personalized feeds, based on your unique lifestyle and news preferences. You simply type in your favorite RSS news feeds on the frame&rsquo;s soft QWERTY touch screen keyboard and you have access to a plethora of digital information at your fingertips without having to be confined to the home office.Stay up to date with headline news and moreSet up personalized RSS feeds", "title": "Intouch IT7150 7-Inch Wireless Internet Frame", "price": 206.48, "imUrl": "http://ecx.images-amazon.com/images/I/41-QdYfXLpL._SY300_.jpg", "related": {"also_viewed": ["B00FWDXZIO", "B00DYQQSSK", "B008MW6Y12", "B00442VXCO", "B008FC8FJ8", "B000N29KOW", "B00368CDH6", "B008R3875C", "B007B4UKOE", "B0056HNTAU", "B0030MIU16", "B00C1TOBJO", "B0036MDUO2", "B003OBZLDS", "B00J3TWQ8I", "B0016NOTOI", "B005ER3RZE", "B008FC8FPC"]}, "categories": [["Electronics", "Camera & Photo", "Lighting & Studio", "Photo Studio", "Storage & Presentation Materials"]]}