{"asin": "B000A5TAT2", "description": "Amazon.com Product Description If you're looking for vehicle navigation that's powerful and simple to use, the Garmin StreetPilot c340 is just the ticket. Right out of the box, this unit helps you make the right turns wherever your travels take you. With an easy-to-use touchscreen interface, text-to-speech voice commands, a brilliant display that shows the way with 2D or 3D animations, and a massive points of interest database, the c340 has all the basics covered. Plus, you'll find some great additional features that make it a must-have companion.Look Mom, no buttons! Garmin has taken simplicity to a new level with the c340.The c340 is designed with simplicity in mind, although Garmin hasn't forgotten to add a touch of class. With a weight of under ten ounces and a width of 4.4 inches, the c340 is ultracompact and easy to transport. To keep confusion on the road to a minimum, the only buttons are a rotary volume knob and an on/off switch. The bright 3.5-inch-diagonal display features a touchscreen, making it a snap to input routing information and make quick selections on the road. The c340 sports dual integrated speakers for high-quality voice prompts, a USB port for PC connectivity, and an internal lithium-ion battery that provides power when you're planning your routes outside the car (approximately 4-8 hours battery life). In addition to an included 12-volt power adapter for in-car power, there's also an SD memory card expansion slot for use with other Garmin MapSource mapping products. The unit is secured by a suction-mount cradle that fastens to the windshield, allowing for easy portability between vehicles. You can even customize the c340's appearance with optional colored faceplates that suit your style. While the c340 has an internal GPS antenna, it also has an MCX-type connector for hooking up an optional external GPS antenna.Finding your way with the c340 starts with inputting a location on the touch screen. Next, the unit's text-to-speech feature speaks to you just like a back seat driver, telling you the names of streets and when to turn and in what direction. And if you happen to miss a turn--don't worry, the c340 automatically calculates a new route to your destination. Audible and visual navigation instructions and warnings help you navigate more quickly while keeping your eyes on the road. You can also choose between a 3D mapping perspective or 2D overhead view.The c340 offers clear, easy-to-read 3D directions.Another time- and frustration-saving feature of the c340 is the database of preloaded maps and points of interest. Gone are the days of uploading partial maps from your computer to your GPS device: the c340 has them all built in. The unit comes preloaded with Garmin's highly detailed City Select NT street data of the entire United States, Canada, and Puerto Rico. Finding points of interest along your route is made easy with the c340's huge built-in database of nearly six million hotels, restaurants, gas stations, ATMs, and attractions. Garmin has also made it easy for users to upload custom points of interest--now you can add school zones or safety cameras to your database. You can even turn on a proximity alert to notify you of upcoming custom points of interest.Garmin really kicks the power of the c340 up a notch with the addition of real-time traffic information. This optional service will display congested areas on a color-coded map, allowing you to avoid traffic by simply pushing a button that calculates a new route. All this wizardry is made possible by the new Garmin GTM 10 receiver that connects to the c340 and other select Garmin products. Note that while the GTM 10 receives digital data from specific FM broadcast stations in select major metro areas throughout the United States and Europe, note that these traffic services are available only in select cities where coverage exists. The service requires the GTM 10 FM TMC traffic receiver and, in some cases, a subscription to enable these traffic capabilities.What's in the BoxStreetPilot c340 receiver with built-in antenna, dual internal speaker system for voice guidance and alerts, vehicle suction cup mount with 12-24 volt adapter, dashboard disk, USB interface cable, preloaded City Select North America NT database, and quick-reference guide.", "title": "Garmin StreetPilot c340 3.5-Inch Portable GPS Navigator", "imUrl": "http://ecx.images-amazon.com/images/I/51A36B98KYL._SY300_.jpg", "related": {"also_viewed": ["B0007LJHVA", "B0015F1L7A", "B0011ULQNI", "B000OH63MI", "B001ELJ9QK", "B0057ODOCA", "B0057ODG6Y", "B00AFEKM6I", "B0015EWMX8", "B00AY7NSTY", "B00HK6CPVY", "B001ELJ9P6", "B0057OCDQS", "B00AXZY42W", "B00AY7NUW4", "B0057OCS9A", "B001U0O7T4", "B000A5T7AO", "B000U9WVW6", "B004W1GQ92", "B00AY7NSX0", "B00BIZ0EY8", "B0026MTATW", "B00AXZWG8Q", "B00DW14I66", "B007N6K3AG", "B0066IUPS2", "B00AY7NUYC", "B001S2RDGS", "B001H9NR2Q", "B002CMOUHI", "B003EG0200", "B003ZX8B2S", "B00AY7NT2U", "B005DIBHCE"]}, "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]]}