{"asin": "B003ZHV70M", "related": {"also_bought": ["B00AMGKYJE", "B0069S8S0G", "B004VTF7IG", "B009ZCRRNM", "B000UXDHOI", "B0092SX9B8", "B00CXV3UDI", "B00705020G", "B003VNKNF0", "B005ZY78R4", "B009ZCRSCM", "B0048BQ2FE", "B001207YMY", "B00A8P22TE", "B00A80BLGO", "B0058GN1AM", "B0044GCKZE", "B003FMUOXI", "B009SAL106", "B007N6YIF2", "B004T7VI2Y", "B001CCWJBS", "B004T7VIPG", "B009TZRIGG", "0957424604", "B002TXYEV2", "B00CV9LG06", "B005SN3INA", "9525668851", "B004EDB1S4", "B00608WXGA", "B0073N2CTO", "B00DJY9PMI", "B003LWYGPE", "B003Y5YMQ6", "B004HN2U7W", "B004NZB37W", "B003ES5ZR8", "B0037T6O2Y", "B005FH3X1G", "B005WKFT18", "0711230390", "B002IFUQPO", "1579129536", "B00GWJIDKC", "B002VU0S7M", "B00GMTGJFS", "B005SN3IN0", "B00J8JLOA4", "B0043VUHXC", "B00FQKEIS4", "B00F5NJSPK", "B008GFMPQ8", "B008XBCJ34", "B004YOEFG8", "B005VF15HG", "B003G4T6D4", "B001M5BIX0", "B00CZGJM88", "B003Z2LAAO", "B00H83EV5W", "B004DBE080", "B0044M2OU4", "B00B4804KS", "B007M51J3I", "B008YAQ8P4", "B00447G2O8", "B001R6SRMO", "B00DQLQN3S", "B004XIB9T6", "B00G0OHMUG", "B005ELVCVQ", "B0052WNHQU", "B0027FFQ8M", "076033725X", "B00B7ID99I", "B00DT55PBC", "B001NXDGFY", "B00608XLUM", "B004NZCU92", "B0039GGZ3I", "B00GMTBWDW", "B00G5GNZ1E", "B00AJ4QQ6E", "B008CVHLT2", "B00ESW4TJ4", "B00966J1WC", "B005LAII80", "B00B7ID9CU", "B004A8ZWUQ", "B0041TRPSG", "B004PW1XRS"], "bought_together": ["B003VNKNF0"], "buy_after_viewing": ["B00F5NJSPK", "B004T7VI2Y", "B003VNKNF0", "B0092SX9B8"]}, "title": "Fujifilm FinePix Real 3D W3 Digital Camera with 3.5-Inch LCD", "price": 275.0, "salesRank": {"Camera &amp; Photo": 2830}, "imUrl": "http://ecx.images-amazon.com/images/I/41ZYxlHkLDL._SX300_.jpg", "brand": "Fujifilm", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Capture 3D HD movies and still photos. Shoot high-resolution 3D photos and movies effortlessly with 3D Auto. The FinePix REAL 3D W3 digital camera comes complete with two 10-megapixel sensors and two Fujinon 3x optical zoom lenses. This set-up allows you to capture high-definition, high-resolution images and movies in 3D effortlessly, just by selecting 3D Auto. What's more, your memories will be captured with stereo audio sound in movie mode.Two sets of lens that work in the same way as human eyes. Our ability to perceive depth comes from viewing an object along two different lines of sight. This phenomenon is called parallax. The FinePix REAL 3D W3 is fitted with two lenses to capture realistic images that are unchanged from how human eyes see them. Both optical 3x zoom lenses capture subjects beautifully, even from a distance. The camera's newly developed stainless steel frame maintains the optical axis with high precision.All these features are combined in a light, compact, stylish body. With its two 10 megapixel sensors, the FinePix REAL 3D W3 captures even the finest of details. The synchronized control of the two sensors and lenses prevents any inaccuracy between the two images and produces a perfectly matched pair of images which, when combined, produce a single image with a very natural sense of depth. Image data captured by the twin lens-CCD system is processed by the newly developed RP (REAL PHOTO) Processor 3D HD. The technology merges the left and right images into a single image. This processor is also the power behind 3D Auto--the function that lets even first-time users take stunning HD-quality images effortlessly. And not only can it shoot in spectacular 3D, but you can also switch to standard 2D mode and use it as a normal camera. There are even special features that allow you to use the fact that the camera has two lenses and two sensors and take two different photos at once. Super Intelligent Flash and Scene Position are featured to automatically make the optical settings to match your scene.Plus, you can see your 3D movies and photos with the naked eye. The large 3.5-inch LCD screen displays high-resolution, high-contrast 3D images and movies without the need for glasses. See it in all its glory with your own eyes. High Luminosity Mode displays images 1.5x brighter and reproduces color 1.8 x deeper, allowing you to enjoy clear, distinct and vivid images. Simply connect your W3 camera to a 3DTV using a HDMI cable and sit back and enjoy all your photos and home movies in amazing high definition 3D. Try out Fujifilm's 3D printing system which prints 3D images directly on to special lenticular sheets. The result is photos with spectacular depth, and memories preserved in beautiful 3D.FinePix REAL 3D Technology pioneers a new dimension in imagingFujinon Lens - Two Sets of Lens that Work in the Same Way as Human EyesOur ability to perceive depth comes from viewing an object along two different lines of sight. This phenomenon is called parallax. The FinePix REAL 3D W3 is fitted with dual lenses to capture realistic images that are unchanged from how human eyes see them. Both optical 3x zoom lenses capture subjects beautifully, even from a distance. The camera's newly developed stainless steel frame maintains the optical axis with high precision. All these features are combined in a light, compact, stylish body.3D CCD System - Natural Sense of Depth with Synchronized Control of Two CCDsWith its two 10 megapixel sensors, the FinePix Real 3D W3 captures even the finest of details. The synchronized control of the two sensors and lenses prevents any inaccuracy between the two images and produces a perfectly matched pair of images which, when combined, produce a single image with a very natural sense of depth.RP (REAL PHOTO) Processor - New REAL PHOTO Processor 3DHDImage data captured by the dual lens-CCD system is processed by the newly developed RP (REAL PHOTO) processor 3DHD. The technology merges the left and right images into a single image. This processor is also the power behind 3D Auto - the function that lets even first-time users take stunning HD-quality images effortlessly.Advanced 2D ModeWith two lenses and two sensors, the W3 camera is effectively two cameras in one. These advanced 2D modes allow you to benefit from the two cameras independently with Dual Shooting modes taking two shots at the same time and capturing the same scene in different colors, at different zoom lengths and at different sensitivities.Tele/Wide Simultaneous ShootingZoom in on your subject and also take a wide-angle shot of the same scene at the same time. The twin-lens system lets you freely set the zoom magnification for one lens while the other is set to wide angle, letting you capture the exact same instant with totally different angles of view.* With Tele/Wide Simultaneous Shooting, the left lens can zoom while the right lens is fixed in a wide angle setting.2-Color Simultaneous ShootingChange the settings and with one press of the shutter, you can take two photos of the same scene with a different color tonality. Set one lens system to Standard and the other to the vivid colors of Chrome. You can also capture the scene in both Standard and vintage Black &amp; White or shoot simultaneously with Chrome and Black &amp; White. Fujifilm doubles your enjoyment of every moment.2-Sensitivity Simultaneous ShootingTake two photos of the same instant - one at high sensitivity and one at low sensitivity. For example, you can take panned shots of a moving subject at the exact same instant with different degrees of background motion blur. In dark scenes, you can prioritize blur reduction for one shot, and image quality for the other. For times when you are not sure which sensitivity setting is best, you can shoot the moment at two settings and later pick the image to keep during playback.Intuitive Interface &amp; OperationIntroducing easy to navigate interface and smooth operation for a better 3D / 2D shooting experience.Design &amp; InterfaceOne-hand grip slim design; featuring grip parts, this body delivers you the utmost grip comfort when shooting and opening the barrier with one hand.Sliding BarrierWith a sliding barrier protecting the lenses, the camera is designed for ease of operation.One-touch 3D/2D SwitchControl button for one-touch switching between 3D and 2D shooting and playbackMode DialSmooth mode dial control can easily be done when choosing for the right shooting mode.Slim BodyDesigned with the smart look, this compact slim body allows mobility and convenience.Playback FunctionFeaturing an innovative 3D viewing LCD monitor, you can playback the results both in 3D and 2D right on the spot.Micro Thumbnail ViewUp to 100 pictures can be viewed at a time in a 10x10 array of micro thumbnails. Convenient for smooth and comfortable playback.SlideshowBring your photos to life! Close-ups of detected faces are shown in slideshow style.3D File FormatFor 3D image recording, the FinePix REAL 3D system adopts the MP format for stills and 3D-AVI format for movies. MP format is the \"multi-picture format\" standardized by CIPA. FinePix REAL 3D W3 can also simultaneously record still images in both MP format (3D) and JPEG (2D). 3D-AVI adopts the widely used AVI multimedia container format. Adoption of these formats enables 2D playback of recorded images on the user's current personal computer.SD/SDHC Memory Card SlotThe versatile card slot is compatible with SD and high-capacity Secure Digital (SDHC) memory cards.Expanded World of \"View 3D\"3D excitement begins the moment you see the stunning form and builds as you experience the innovative interface.3.5-inch Widescreen 3D LCD MonitorSee your 3D movies and photos with the naked eye The large 3.5-inch LCD screen displays high-resolution, high-contrast 3D images and movies without the need for glasses. See it in all its glory with your own eyes!Lenticular Lens SystemFujifilm's unique 3D monitor enables you to enjoy 3D images just with your naked eyes. The Finepix REAL 3D W3 uses an array of microscopic concave lenses to produce binocular disparity. This technology prevents on-screen flickering and crosstalk.Images come to life on the bright LCD displayHigh Luminosity Mode displays images 1.5x* brighter and reproduces color 1.8x* deeper allowing you to enjoy clear, distinct and vivid images.* Compared to previous models.High-resolution 1.15 million dot LCD3D images are shown on a high resolution 1.15 million dot LCD. The LCD ensures perfect portrayal of fine detail and color.Crisp 3D Shots with Low CrosstalkEnjoy natural, effective 3D images with reduced \"crosstalk\" (or double exposure) which is typically present in 3D images.Simply connect with HDMI cable to enjoy HDTV-quality imagesSimply connect your W3 camera to a 3DTV using a HDMI cable* and sit back and enjoy all your photos and home movies in amazing high definition 3D!* Commercially available HDMI cable (high speed type) required.High Resolution 3D Print SystemTry out Fujifilm's 3D printing system which prints 3D images directly on to special lenticular sheets. The result is photos with spectacular depth, and memories preserved in beautiful 3D.Edit your 3D Images on MyFinePix StudioEdit your 3D images using the MyFinePix Studio software* included. You can separate 3D photos in to left/right still images and re-combine them. You can also trim and combine your 3D movies quickly and easily.* Please ensure you have completed automatic update of the latest version (ver.2.0 or higher).Shooting FeaturesShoot 2D/3D HybridThe FinePix REAL 3D W3 comes loaded with a variety of functions for both 3D and 2D.Switch 3D/2D ButtonYou can still capture normal photos in 2D with this camera. Just press the 2D-3D button to toggle between the two settings. 2D/3D button can also be used in \"Playback\" mode.Manual Shooting FunctionsChoose \"M\" (Manual) Mode for the freedom to set shutter speed and aperture. Get instant control of depth of field in \"A\" (Aperture Priority) Mode. With the built-in \"P\" (Program) Mode, the camera automatically sets the shutter speed and aperture value. Take the shot you want, whether it is in 2D or 3D.Super Intelligent FlashThis advanced flash system automatically adjusts flash output and timing to capture subjects and background in bright natural detail over the full flash range. No more flash washout even when taking ultra close-up shots.* Macro can be set at 38cm in 3D mode and 8cm in 2D mode.3D/2D Continuous ShootingNever miss the moment capturing the scene in continual frames.3D: 2 frames / sec. max 40 frames (size S)2D: 1 frame/ sec. max 40 frames (size L), 3 frames / sec. max 40 frames (size S)Mode Dial and Scene PositionEasy-to-select Mode Dial and Scene Position. Just select the Scene Position (SP) that matches the subject and situation. The camera automatically optimizes every setting from shutter speed and white balance to sensitivity and even selects whether or not the flash is required. Moments are captured with the best possible results for both 2D and 3D photos.Mode Dial SettingsAUTO: The easiest mode for taking pictures. Use this mode for ordinary photography. Scene Position: Choose a SP scene suited to the subject or shooting conditions and the camera will do the rest.Manual: Provides detailed settings that are impossible to set in Auto mode.Aperture Priority Auto: An automatic mode to set the aperture.Program Auto: An automatic mode to specify the settings except for the shutter speed and aperture setting.Adv. 2D: Simultaneously captures one set of the following 3 shooting types: Wide angle / zoom, standard / black &amp; white, or high sensitivity / low sensitivity photos.Adv. 3D Shooting: Automatically takes successive shots with a press of a single shutter.Scene Positions for Every MomentNatural Light &amp; with Flash: Shoots 2 images continuously, without flash and with flash. Comes in great handy during marginal shooting situations.Natural Light: Produces beautiful images that retain the natural ambience when shots are taken in low-light conditions.Portrait: Set for shooting portraits. Skin tones are softened as it enhances the overall natural look.Landscape: Best for shooting scenery in daylight capturing clear and sharp shots of buildings and mountains effectively.Sport: A quick recognition of persons in motion or objects for a faster shutter speed to help you catch the perfect moment.Night: Mode for shooting evening and night scenes. A picture is taken with a slow shutter.Night (Tripod): Clear shots of twilight scenes using tripod.Sunset: Capture sunset scenes vivid in color.Snow: Most adaptable to snow scenes without unnatural darkened images or where the whole screen appears white.Beach: Clear shots of people without darkened images under strong sunlight.Underwater: Best for shooting underwater capturing clear images of the ocean blue.Party: Best for shooting indoor weddings or parties. Retains the natural ambience in low-light conditions.Anti Blur: Gives blur free results by preventing camera shake on moving subjects.What's in the BoxW3 3D digital cameraBattery (NP-50)Battery charger (BC-45W)Hand strapUSB cableCD-ROMOwner's manual*Note: All sample photos are simulated images."}