{"asin": "B000UHE8YM", "categories": [["Video Games", "PC", "Accessories", "Gaming Keyboards"]], "description": "From the ManufacturerGood intel and the proper gear are the keys to victory, even in gaming. The Logitech&reg; G15 keyboard keeps you informed and outfitted to win.With the Logitech-exclusive GamePanel&trade; LCD, you can easily find out what server your friends are using to play Battlefield 2142&trade;, or receive notification when your World of Warcraft&reg; battleground becomes available. You can even identify who&rsquo;s speaking in Ventrilo&trade;.&nbsp; Create useful macros on the fly and play them back with a single press of a G-key. Backlighted keyboard allows you to play late into the night.The Logitech&reg; G15 gives you a winning advantage, and everyone knows it&rsquo;s more fun when you win.&nbsp;&nbsp;&nbsp;High-visibility GamePanel&trade; LCD: Displays game stats and other important system information.&nbsp;Backlit keyboard: Choose from three levels of brightness. Locate keys easily in both bright and low-light conditions.&nbsp;Six programmable G-keys: Perform single keystrokes or complex macros with six fully programmable G-keys. Create macros on the fly, without having to pause the action.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Intelligent cable management: Keep mouse, headset, and other cords out of the way by routing them through channels on the underside of the keyboard.&nbsp;Instant media access: Use the convenient one-touch controls for volume and media playback.&nbsp;Detachable palmrest: Can be used with or without palmrest, depending upon user's preference&nbsp;System RequirementsWindows&reg; XP, Windows Vista&trade;256 MB RAM20 MB available hard disk spaceUSB portCD-ROM drivePackage ContentsLogitech&reg; G15 KeyboardPalm restSoftware CDInstallation Guide1-year limited hardware warranty", "title": "Logitech G15 Gaming Keyboard (Black)", "price": 82.6, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41IP1acPZxL._SY300_.jpg", "related": {"also_bought": ["B001NTFATI", "B0086UK7I6", "B001NEK2GE", "B0055QZ216", "B001NXDBI6", "B003VANOFY", "B002Q4U5DK", "B002J9GDXI"], "buy_after_viewing": ["B00BCEK2LU", "B009C98NPY", "B001NEK2GE", "B000UEZ36W"]}}