{"asin": "B001F51G0W", "description": "From the ManufacturerIntroducing Logitech Z-5 USB Speakers, built for Mac and PC, featuring omnidirectional acoustics--an innovative speaker technology, previously found only in expensive home theater systems. Omnidirectional acoustics provide great sound at a more consistent level, no matter where you are in the room. Because they are connected via USB, there's no bulky power adapter, and it's easy to move them from room to room. These speakers also include a sleek remote control that lets you wirelessly navigate and enjoy your entertainment options.Key FeaturesLogitech's Omnidirectional Advantage: Make Any Spot in Your Room a Sweet SpotYou don't sit in one spot when you're listening to music from your computer. Shouldn't your speakers produce great sound no matter where you are in your room? Most of today's speakers for PC are designed to deliver the highest-quality sound immediately in front of the speakers. If you move from what audiophiles call the sweet spot on the couch to the impromptu dance floor, the sound you hear can easily become distorted and you might find yourself out of step.The Logitech Z-5 Omnidirectional Stereo Speakers are designed to transmit sound more consistently over a wider range of space, so you never miss a beat--no matter where you are in the room.Traditional versus omnidirectional loudspeakersMost speakers are designed to radiate sound in a fixed direction. As shown in Figure 1, traditional speakers optimize sound for a sweet spot located directly in front of the speakers. In other words, the sweet spot is limited to a constrained sound field that fans outward in one direction. If you're outside the sweet spot, you'll hear unbalanced sound due to loudspeaker directionality.Logitech Audio Labs' omnidirectional speakers differ from traditional speakers. Designed to radiate sound more uniformly over a wider range of frequencies and angles, Logitech's omnidirectional speakers create a broad sweet spot that is not dependent on a fixed listening position, as shown in Figure 2. The true hallmark of omnidirectional speakers is the increased sound quality that comes from tonally balanced direct and reflected sound. The increased reverberant sound field also increases the sensation of spaciousness and listener envelopment. By designing loudspeakers to radiate sound more uniformly, Logitech delivers great sound to any spot in the room.USB ConnectivityDelivers pure digital audio that's easily moved with your laptop from room to room.Sleek Remote ControlWorks with a Mac or PC to let you wirelessly navigate and enjoy your entertainment options.Mac and PC CompatibleAllows you the flexibility to use with any computer.Check out other stylish products from LogitechLogitech Pure-Fi Express PlusThe Logitech Pure-Fi Express Plus speaker dock for the iPod and iPhone features omnidirectional acoustic technology, which provides great sound at a consistent level, throughout the room.Logitech diNovo Edge, Mac EditionThe ultra-slim profile and elegant styling of the diNovo Edge, Mac Edition are complemented gracefully by easy, one-touch controls to launch your favorite Mac OS applications.Logitech Illuminated KeyboardFeaturing bright, laser-etched, backlit keys and an ultra-thin 9.3-mm profile, the Logitech Illuminated Keyboard adds a touch of elegance to your desk--even in the dark.Logitech V550 Nano Cordless Laser Mouse for NotebooksFeaturing a Clip-and-Go dock that attaches your mouse to your laptop and a nano-receiver that's small enough to stay plugged in, you'll enjoy greater freedom of movement.What's in the BoxPackage ContentsLogitech Z-5Sleek wireless remote with batteryLogitech software CD6.5ft USB cable4ft audio extension cableQuick-start guide&lt;System RequirementsPCWindows 98SE, Windows ME, Windows 2000, Windows XP or Windows VistaAvailable USB portCD-ROM driveInternet Connection (For SoftSqueeze software)MacMac OS X 10.3.9 or higherAvailable USB portCD-ROM driveInternet Connection (For SoftSqueeze software)", "title": "Logitech Z-5 USB Stereo Speakers for Mac and PC", "price": 99.0, "imUrl": "http://ecx.images-amazon.com/images/I/51btQt-4HHL._SY300_.jpg", "related": {"also_viewed": ["B002FU5QMA", "B005FE72Q6", "B004ULOZPQ", "B003VAK1I2", "B001IWOBA4", "B00CXLK1X0", "B00DYVK304", "B000AM6QHE", "B0080K2KUK", "B001RNOHDU", "B0028N6YH0", "B00CD1PTF0", "B000IF4788", "B00EZ9XKCM", "B000ZH98LU", "B009JXHTNU", "B002FU5QLQ", "B007GF9N96", "B000WS5VNQ", "B002LGXD3C", "B003CP0OT2", "B0050JS1QG", "B0011FQURK", "B000G0JD0C", "B000UY1MB2", "B0007XU370", "B005OSR1C8", "B003R6U6HG", "B000HZDF8W", "B00F8HRSN2", "B00ESKS9L0", "B008X1BVH4", "B0043TB7OC", "B001S14DYO", "B00BZ7MATG", "B005OA3BSY", "B002HWRZ2K", "B002VK7L04", "B00BZ7MALY", "B0053T4PHC", "B00EZ9XKDG", "B00EZ9XLEY", "B000RQSGYO", "B005TLTOLG", "B008F2YEN4", "B007ZWIEJK", "B002PF752O", "B003VAHYTG", "B009QUCP80", "B00BZ4X2VY", "B0002SQ2P2", "B004M18O60", "B00GMPDAAO", "B0009WKBGC", "B00031S4KO", "B00AFQZ4AU", "B002TR6KRO", "B007Q42TJS", "B0042F3K9W", "B0027VT6V4"], "buy_after_viewing": ["B00CD1PTF0", "B0027VT6V4", "B000ZH98LU", "B00EZ9XKCM"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]]}