{"asin": "B001V9LA44", "categories": [["Electronics", "Television & Video", "Blu-ray Players & Recorders", "Blu-ray Players"]], "description": "The Panasonic DMP-BD60 Blu-ray Disc Player combines high quality images with enhanced networking functions. Continuing its commitment to producing products that stress ease of use, the 2009 line of Blu-ray Disc players continue to incorporate VIERA Link, allowing the consumer to operate their audio/video components, via HDMI, with one remote. And, in keeping with Panasonic&rsquo;s pledge to reduce the planet&rsquo;s carbon footprint, the new Blu-ray players have been designed to reduce power consumption.BD Live and BonusView so you can connect directly to the Internet to access bonus features, games and movie studio extras.SD memory card and USB slot so you can enjoy precious memories in HDClick to enlarge.Experience Movies Like Never BeforeThe DMP-BD60 employs the PHL Reference Chroma Processor Plus. Developed in collaboration with Panasonic Hollywood Laboratory, this high image processing technology reproduces clear, vivid colors that are faithful to the original film. Recognizing that audio is important to the overall entertainment experience, this Blu-ray Disc player features a high definition audio decoder (Dolby Digital Plus, Dolby TrueHD, DTS-HD Master Audio Essential) to take advantage of the exceptionally high quality 7.1 channel surround sound now integrated in Blu-ray Discs.Experience Movies Like Never BeforeThe DMP-BD60&nbsp; includes an SD Memory card slot and USB slot, making it easy for the consumer to view and share both digital still images and HD video recorded with an HD camcorder in the AVCHD format.In order to produce the ultimate picture quality, the Panasonic&rsquo;s DMP-BD60 Blu-ray players employs high precision 4:4:4 signal technology, which working in tandem with PHL Reference Chroma Processor Plus processes each pixel of the Blu-ray Disc video signal in the horizontal direction, to compliment vertical direction processing. P4HD (Pixel Precision Progressive Processing for HD) is another technology that contributes to the superior picture quality of the Blu-ray players. P4HD processes more than 15 billion pixels per second and applies the optimal processing to every pixel.Panasonic&rsquo;s Blu-ray players further utilize 16-level motion detection to categorize the image motion of each pixel into one of 16 levels; diagonal processing to detect diagonals and correct the pixels accordingly; 1080p up-conversion to up-convert content recorded in the 480i/p or 720p format to 1080p. The Blu-ray players also provide 1080/24p output, thereby reproducing cinema images from a Blu-ray Disc and DVD in their original 24p form with no need for conversion. This allows the user to enjoy cinema images in the same format used in cinema with a 1080/24p compatible TV.Complimenting the HD audio codecs this Blu-ray player features 96kHz surround re-master, a function that enhances the sound quality of CDs and other sources, and even improves the quality of the multi-channel audio data on Blu-ray Discs and DVDs.ENERGY STAR RatedIn order to obtain a reduction in power consumption the Panasonic DMP-BD60 uses Auto Power Stand-By, a function that automatically turns off the player when you return to TV operation using the VIERA Link menu. In addition, the Stand-by Power Save automatically turns off the player&rsquo;s Quick Start function. When VIERA is turned on, Quick Start also turns on. In addition, the development of the UniPhier single chip LSI makes it possible to pack an entire video signal processing circuit onto a single chip. This helps lower power consumption, reduces the number of parts needed and allows for a more compact design. In fact, the DMP-BD60 consumes 16% less power in standby mode than last year&rsquo;s model, the DMP-BD35.Key Features IncludePHL Reference Chroma Processor Plus for faithful and sharp color reproductionBD Live and BonusView so you can connect directly to the Internet to access bonus features, games and movie studio extrasSD memory card and USB slot so you can enjoy precious memories in HDHigh precision 4:4:424p cinema mode7.1ch lossless audio decode and bit-stream outputVIERA LinkENERGY STAR rated consumes 10 percent less power than DMP-BD35What's in the boxPanasonic DMP-BD60 Blu-ray Disc Player, remote control, instruction manual", "title": "Panasonic DMP-BD60 Blu-ray Disc Player (Black)", "price": 142.0, "salesRank": {"Electronics": 18649}, "imUrl": "http://ecx.images-amazon.com/images/I/31mFgNWnoXL._SX300_.jpg", "related": {"also_viewed": ["B00752R4Y6", "B0038KN114", "B006H8WFU2", "B0038KR8WM", "B004LNFJCQ", "B001GAOYCS", "B0038KV0BM", "B00752R4QO", "B00752R5Z4", "B00752R4PK", "B00AYB3OMG", "B004OF9XMI", "B001VYZVBC", "B00AYB3OOY", "B000Y634SU", "B00B9JR5H2", "B004G8HXXO", "B005NEZDUA", "B00B9JR5EU", "B004M8SBFW", "B00HPMCPJK", "B0082NJ5BC", "B0038KLM9W", "B00AWX6EYQ", "B00752R4S2", "B001A4LVYY", "B0091VAHIO", "B001URWAYG", "B004XYJKHI", "B004XYJKHS", "B0036WS4CA", "B007WF1IMK", "B001VZ1W5U", "B00BFRKYVM", "B00BFDHVAS", "B00F6B3ULE", "B006U1YVZ8", "B006U1YUZE", "B0021YZ4EK", "B003ZXE87A", "B00HPMCO4Q", "B00EUY59Z8", "B004N85YBA", "B004MF79QM"], "buy_after_viewing": ["B00AWKC0JM", "B00EUY59Z8", "B00EUY59Z8", "B00AYB3OMG", "B003L1ZYYM"]}}