{"asin": "B000I1ZWRC", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]], "description": "Canon EOS Digital Rebel XTi offers an unbeatable combination of performance, ease-of-use and value. It has a newly designed 10.1-megapixel CMOS sensor plus a host of new features including a 2.5-inch LCD monitor, the exclusive EOS Integrated Cleaning System, and Canon's Picture Style technology, all in a lightweight, ergonomic body. The Digital Rebel XTi is proof positive that Canon continues to lead the way with our phenomenal digital SLRs.The Canon Rebel XTi's APS-C size sensor has the same 3:2 ratio as film cameras.10.1-Megapixel APS-C Size CMOS SensorCanon's large-area CMOS (Complementary Metal Oxide Semiconductor) sensor captures images with exceptional clarity and tonal range, and offers the most pixels in its class. This APS-C size sensor (22.2 x 14.8mm) has the same 3:2 ratio as film cameras, enabling an effective angle of view that is 1.6x the normal EF lens focal length. With pixel resolution of 3,904 x 2,598, the Digital Rebel XTi not only offers the most pixels in its class, but bests many professional-level cameras. Recorded on Canon's CMOS sensor, each pixel is captured with fine detail to create images of tremendous depth, nuance, and resolution, ensuring enough information for even poster-sized prints.DIGIC II Image ProcessorThe EOS Digital Rebel XTi is the product of Canon's extensive in-house development: The DIGIC II Image Processor was designed specifically for Canon digital SLR cameras and enhances every aspect of image capture. Information captured by the CMOS sensor is processed and assembled into images of exceptional quality. With the DIGIC II Image Processor on board, photographers can expect natural color reproduction, precise white balance in any number of lighting situations, and unparalleled clarity. The DIGIC II Image Processor employs sophisticated signal processing algorithms and works at greater speeds, all while consuming less energy. The entire processing chip--not just the software that drives it--is dedicated for use in a digital still camera.The XTi's 2.5-inch LCD is larger than most DSLR screens.Responsive and ReliableThe EOS Digital Rebel XTi has a brilliant 2.5-inch LCD monitor with approximately 230,000 pixels. Also used in Canon's Professional EOS SLRs, this screen displays more than images. Shooting information and playback are both displayed on the LCD, so that the photographer can see all of the shooting information simultaneously on one screen. Not only can images be viewed larger than on the Digital Rebel XT, they can be viewed at a greater angle (160 degrees) than many other conventional LCD monitors.Display Off SensorWhen composing images, the Digital Rebel XTi's external display turns off automatically thanks to the newly developed Display Off Sensor. This new sensor detects the photographer's face against the back panel of the camera, and turns the screen off to prevent the LCD monitor's brightness from disturbing the photographer's eye while looking through the viewfinder.Speedy OperationWith a startup time of 0.2 seconds, the EOS Digital Rebel XTi is ready to go the instant it's brought to the eye. And the Digital Rebel XTi's shutter can record images as fast as 1/4000 seconds and as long as 30 seconds, plus bulb at up to 3 frames per second (fps) for 27 consecutive shots. It synchronizes with Canon Speedlites at 1/200 second.EF-S 18-55mm f3.5-5.6 USM Standard Zoom LensThis kit includes a standard zoom exclusively for the EOS Digital Rebel and EOS 20D SLR cameras, with APS-C size image circle equivalent to an approximately 28-90mm focal length. The lens is compact and ultra-lightweight with impressive close-focusing ability of 0.9 feet (0.28 meters). It features optimized coating for digital imaging sensor to minimize ghost images and flare.Picture Style settings allow you to recreate characteristics of your favorite photo films.9-Point AFThe EOS Digital Rebel XTi has a high-precision 9-point AF system for speedy and accurate focusing in any situation. Conveniently located on the back of the camera for thumb-controlled action, Canon's cross key buttons enable instant choice of the 9 focus points or allow the camera to choose them automatically. One-Shot is perfect for still photography. AI Servo AF tracks moving subjects, ensuring accurate focus. AI Focus AF switches between One-Shot and AI Servo when subjects are moving and stopping. The Digital Rebel XTi's focusing system functions in metering ranges of EV-0.5 to 18 and displays information on the Digital Rebel XTi's big LCD display.Picture Style settingsWith Picture Style technology and the EOS Digital Rebel XTi, photographers can recreate characteristics of their favorite films. Color, saturation, sharpness, and contrast settings create noticeable variation in the saved image. In addition to six preset Picture Styles (Standard, Portrait, Landscape, Neutral, Faithful, and Monochrome), users can create three additional settings for their particular photographic style.SettingDescriptionSaturationSharpnessStandard(default setting)(default setting) Vivid, sharp expression; usable in a wide variety of conditions; optimal for direct printing without post-processinghighslightly highPortraitSoft texture and beautiful expression of skin colorslightly highslightly lowLandscapeSharp expression with particularly vivid results for blue skies and green hueshigh green-bluehighNeutralLow saturation and contrast for easy adjusting during post-processinglownoneFaithfulAccurate reproduction of the subject's colors based on colorimetric datalownoneMonochromeMonochrome expression similar to silver halide film in black and white; for color filter worknone (monochrome)slightly highPrint/Share ButtonPrinting and uploading to a computer is incredibly simple with the Digital Rebel XTi's Print/Share button. By connecting the Digital Rebel XTi to a computer via the USB 2.0 port, it's easy to transfer some or all of the photographs in the cameras memory to folders on the computer.EF and EF-S LensesThe EOS Digital Rebel XTi is compatible with all Canon lenses in the EF lineup, ranging from ultra-wide-angle to super-telephoto lenses, and including Canon's EF-S series lenses, manufactured specifically for Canon's APS-C sized digital sensor. Canon lenses employ advanced optical expertise and micron-precision engineering to deliver unprecedented performance in all facets of the photographic process. Aspherical optics and fluorite elements, for example, are featured in the universally acclaimed L-Series lenses, and Canon's Image Stabilizer technology in select lenses minimizes the effect of camera shake.Flash PhotographyThe EOS Digital Rebel XTi features the acclaimed E-TTL II flash metering system. Whether using its flush-mounted integral flash (guide no. of 43 feet/13 meters at ISO 100), or any of the flashes in the EX Speedlite line, E-TTL II provides reliable flash output through numerous exposures.SoftwareThe EOS Digital Rebel XTi comes bundled with the updatedCanon EOS Digital Solution Disk (Version 13.0), which features powerful software programs designed to extend the EOS experience to the computer. These include Canon's ZoomBrowser EX for Windows (Version 5.7), ImageBrower for Macintosh OS X (Version 5.7), Digital Photo Professional (Version 2.2), Canon's EOS Utility (Version 1.1) and PhotoStitch (Version 3.1). Each application is designed to perfect captured images and streamline the digital workflow.Digital Photo Professional (Version 2.2)is an image processing program that enables high-speed RAW image processing, high-speed previewing for real-time image adjustment, and support for sRGB, Adobe RGB, and Wide Gamut RGB color spaces. Because it's CMS (Color Management System) compatible, Digital Photo Professional allows for easy image layout and printing in Adobe RGB in conjunction with Easy-PhotoPrint and PictBridge printers. It also features the Digital Rebel XTi's Dust Delete Data Detection tool for cleaner images.EOS Utility (Version 1.1) for Macintosh or Windowshandles the connection between the camera and computer, whenever they're connected via USB. It allows remote-controlled shooting from the computer, handles downloading of images from the camera to the computer, and allows seamless linking to either Canon's ZoomBrowser/ImageBrowser or Digital Photo Professional software once images have been copied to the hard drive. Furthermore, it's used to upload settings back into a USB-connected camera.ZoomBrowser EX (Version 5.7) for WindowsandImageBrowser (Version 5.7) for Mac OS Xare the easy, user-friendly options for viewing and editing of JPEG and even RAW image files. Both allow viewing of numerous types of images including finished TIFF and BMP files. Both also have a variety of search options for finding images, allow re-naming of single images or batches of files, and offer a variety of options for printing without using a separate image-editing program.Dependable for Cleaning the SensorThe EOS Digital Rebel XTi not only sports a newly refined body with better ergonomics and a new grip, but it also has some of Canon's most advanced improvements in dust reduction. No matter how careful photographers may be to change lenses in dust free areas and to keep their equipment as clean as possible, dust often ends up on their cameras' sensors, creating distracting spots on recorded images. The Digital Rebel XTi's integrated hardware and software solutions make trouble with dust a thing of the past. The Digital Rebel XTi is the first digital EOS SLR camera to feature this important technology: by ensuring the sensor is free of dust and debris, the camera guarantees a cleaner image.Self Cleaning Sensor UnitTo combat  stray dust that enters the camera and adheres to the image sensor during a lens change, the Digital Rebel XTi features an all new Canon-designed Self Cleaning Sensor Unit. The low-pass filter cleans itself automatically with ultrasonic vibrations, removing dust from the sensor assembly.Dust Delete Data DetectionDust that has been missed by the Integrated Self Cleaning Sensor Unit can also be erased with software included in Digital Photo Professional (DPP) Version 2.2. The Digital Rebel XTi's imaging sensor is able to single out the dust particles on its surface, then plots out their location coordinates within the image. This data is transmitted along with the image, whether JPEG or RAW, and can be either manually or automatically erased in Canon's DPP 2.2. This added software option ensures the cleanest possible image, perfect for printing or archiving.What's in the boxEOS Rebel XTI Camera, EF-S 18-55 MM 3.5-5.6 lens, Strap, Battery Charger, Battery Pack, USB Interface Cable, Video Cable, Software CD Rom", "title": "Canon Rebel XTi DSLR Camera with EF-S 18-55mm f/3.5-5.6 Lens (OLD MODEL)", "price": 749.0, "salesRank": {"Camera &amp; Photo": 1366}, "imUrl": "http://ecx.images-amazon.com/images/I/41RMGH3XG3L._SX300_.jpg", "related": {"also_bought": ["B00B5KC9Z8", "B00189JVCA", "B000W05O5O", "0470110074", "B00065ANYW", "B00065ANY2", "B002POMXZY", "B000BO3CW8", "B0053V5MF4", "B0033ZJFGY", "B003HMNDVQ", "B00C3JPIAI", "B001FO4QHI", "B00194QVQS", "B002A1MLV8", "B003F3WCQE", "B002WE4H8I", "B001DKO7R8", "B000T9251O", "B000YZGCIU", "B002NO7Q26", "B002YVRGPA", "B00004THD0", "B001T9N120", "B00007E7JU", "B00004WCGF", "B001NXDB4A", "B00009R6UA", "B003WD2SLQ", "B0002Y5WZM", "B0039BPG1A"], "buy_after_viewing": ["B003VNKNF0", "B004J3Y9U6", "B00EFILPHA", "B004VGDFD8"]}}