{"asin": "B001GGO1GG", "description": "Inspired by the events of the classic film of the same name, inThe Godfather IIplayers take on the role of Dominic Corleone, a little-known member of the Corleone crime family tasked with rebuilding the once dominant, but now faltering Mafia empire. Set in an open-world gameplay universe full of dangers and opportunities, players must maintain and develop the Corleone crime family's resources using every and all means available if they hope in the end to prevail in the ultimate challenge, to act like a mobster, but think like a Don.Command a crew of three as Dominic Corleone.View larger.Analyze your empire with 'The Don's View' .View larger.Enjoy open-world gameplay.View larger.Take your family online.View larger.StoryOn the eve of the Cuban revolution, a major mob meeting in Havana takes a bloody turn. The Don of your family is killed in Cuba, leaving it to you to take the reigns and lead your battered organization and reestablish the Corleone powerbase in Queens. Success breeds opportunity: after you've proven you have the chops to run a top-tier crime organization, Hyman Roth invites you to expand and support him in South Florida. Do you accept his offer or do you remain loyal to the Corleones? Things get even more complicated when Michael Corleone comes under investigation by a Senate Committee on Organized Crime, and you're tapped to run the Family with support from Tom Hagen. Whatever decisions you make, you must build up your arsenal, command your crew, and establish and maintain power... or face the consequences. Stack your pockets with favors from those in positions of influence as you fight off attacks and strike back at your rivals. As the Godfather there will be a price on your head and a target on your back, but don't take it personally. After all, it's only business.The Don's ViewBe a true Don as you coordinate all the action using a 3D world map: survey your turf, place defenses on businesses, analyze crime patterns, identify new illicit rackets, and choose the target of your next attack. As the Don of a family, there are a ton of strategic choices to make inThe Godfather 2. Just one example are Monopolies. Monopolies are groupings of rackets that \"run\" the same criminal activity. Controlling, and defending a monopoly comes with both a monetary bonus and game perk benefits making them key to owning the map, gaining wealth and amassing power. Monopolies can be local to one city or span across the cities. Larger monopolies made up of many targets, spanning multiple cities are obviously more difficult but offer greater rewards. Other in-game rackets include: Fronts - extortable legitimate businesses of the game that provide payouts as well as money laundering opportunities; and Small, Medium and Large Rackets - venues containing an illegal criminal activity and usually disguised as legitimate businesses. These three require various degrees of muscle to defend and keep under your control.Key Game Features:Build Your Family- Recruit, develop, and promote members of your crime family.Command a Crew- Bring up to three crew members along on jobs, including an arsonist, demolitions expert, safecracker, and more. Command their actions in battle and unleash their specialties on your enemies.The Don's View- Be a true Don as you coordinate all the action using a 3D world map: survey your turf, place defenses on businesses, analyze crime patterns, identify new illicit racket monopolies, and choose the target of your next attack.Blackhand Brutality- Act like a mobster to command respect, intimidating and extorting business owners and rival families with devastating new attacks and executions.Bring Your Family Online- Recruit your friends to join your family and take them into battle online to find out who is the Don of Dons.'It's Only Business'- Relive the greatest moments from The Godfather II in an open-world action experience inspired by the movie.Commanding Your CrewThere are six ranks within each family, starting with the Don. As the Don you will have a right hand man, your Consigliere Tom Hagen, who will teach you the ropes and advise you on how to take down the other families. The rest of your family is comprised of an Underboss, Capos, Soldiers and Associates. These are the men who guard your interests and follow your orders without question. Members of your family within these ranks, known as Made Men, possess exclusive skills and specialties that can be taken into battle. Direct them wisely and upgrade them to develop their specialties and increase the power of your organization. But beware. Each rival family has it&rsquo;s own family tree as well. Learning how to hunt down and permanently eliminate their Made Men will be critical to your success.Take Your Family Online in Multiplayer ModesPlayThe Godfather IIonline multiplayer modes and become the true Don of Dons. Take your money, weapons, and crew from your singleplayer experience online and wage mob warfare against players around the world. Play as one of your family&rsquo;s Made Men and put your best strategies to the test as you battle for riches and honors that transfer back and forth between your singleplayer campaign. Some available modes include:Fire Starter Game Mode- Arsonist crew members attempt to destroy as much as possible in a race to reach the scoring limit.Safe Cracker Mode- Safe cracker crew members attempt to find safes throughout the map. Cracking them earns your team points and money.Demolition Assault Mode- Use your demolitions specialty to destroy the enemy&rsquo;s three assault points.Team Deathmatch- The bloodiest mode and so not for the squeamish. Team with most kills wins.", "price": 47.32, "imUrl": "http://ecx.images-amazon.com/images/I/51bdU8LxN8L._SY300_.jpg", "related": {"also_bought": ["B000MF8AV4", "B00198PO5I", "B002I0J5UQ", "B00149ILDO", "B005DZ4IL4", "B0022TNO7I", "B001RTCOWA", "B0076ZQSFI", "B0012NAPNQ", "B000930DLO", "B004UD0CSI", "B002I0H2G0", "B0023CBZ70", "B003O6E6EI", "B005EZ5GYQ", "B003Q55YCU", "B001NQ7GH0", "B007Z3UUDW", "B004FUI84G", "B008XMSR6G", "B0050SXKU4", "B001NJ28SO", "B005YR308S", "B000MUW98O", "B002CYWJWO", "B0045U01OG", "B000MAFXU0", "B001CRM3YQ", "B000UUATJ2", "B007V9NHMQ", "B0036FDHT2", "B004J6I0YO", "B000QAVV6G", "B003VKLAAU", "B001PKHRUK", "B003ZRZW9O", "B000HKP88C", "B0050SXBQC", "B008J16APQ", "B0050SXX88", "B0014UGK8G", "B0030F1DOO", "B0016PZYLS", "B00B59L9T6", "B00320JAWY", "B003QX4F7C", "B000X2SGRY", "B00BMFIXKQ", "B00CLF839C", "B00BRQN2H4", "B002I0JBL4", "B002ZJNWWC", "B002ELCV00", "0761559892", "B0050SXLQC", "B006Y76HXM", "B000XJNTQ0", "B00I0574EW", "B001SGZL2W", "B00354NANC", "B005N64U9I", "B0030GBSUC", "B0050SWZHS", "B005THAX6K", "B00G6MW4SM", "B0030GBU2I", "B004FS8LYK", "B00E9CVW9I", "B001URRH0S", "B004CVQUOI", "B009DZTXQU", "B005N4HBIW", "B00G9DFMDW", "B001NX6GBK", "B0050SXOD2", "B0050SX2MK", "B007UM599S", "B0050SXFKE", "B000UW21A0", "B003O65TXU", "B0026IBHH4", "B002NN7AKU", "B002MED6EO", "B00BGHUS58", "B007CM0K86", "B00F3F2VYA", "B0065NP05G", "B004EDJOYC", "B008E6ZXMM", "B001CSPRJI", "B00CJ7IUI6", "B004QEWVLC", "B005DKMCCG", "B0087Y3DSW", "B00886WO7A", "B004PAGJNS", "B0030MQPQ8", "B007TYC8MI", "B0047TLIBU", "B004MXM7WU"], "bought_together": ["B00198PO5I", "B002I0J5UQ"], "buy_after_viewing": ["B00198PO5I", "B002I0J5UQ", "B000MF8AV4", "B00BMFIXKQ"]}, "salesRank": {"Video Games": 2477}, "categories": [["Video Games", "PlayStation 3", "Games"]]}