{"asin": "B001OC5UNA", "categories": [["Baby"]], "description": "An essential tool in childproofing your home, the Regalo Easy Step Extra Tall Walk-Through Gate offers a sturdy, convenient gate that helps to protect your child. Made with durable all-steel construction, the safety gate is designed with a pressure-mount system that is ideal for doorways or staircases. Ideal for tall or energetic toddlers, this portable gate features a lever-style handle with safety lock that makes it easy for adults to open but tough for children. Fits openings 29-1/2 to 40 inches wide.Easy Step Extra TallWalk-Through GateAt a Glance:Age/Weight Requirements:6 to 36 monthsAssembly Requirements:No tools for pressure mount; screwdriver or drill for wall cupsWarranty:Limited 90-dayThe lever-style handle features a one-touch release safety lock for easy adult operation.View larger.Sturdy Steel Construction with Secure Pressure MountsThis safety gate boasts 100 percent steel construction for durability and strength, providing security you can rely on for those moments when you can't be within arm's reach of your child. It installs quickly with four pressure mounts that are each individually adjustable to provide a stable, secure fit.The gate is PVC-free and has been certified by the Juvenile Products Manufacturers Association (JPMA). It also meets the safety standards set by the American Society for Testing and Materials (ASTM).Extra Tall and Expandable for a Custom FitThe safety gate is 41 inches tall and can fit openings between 29-1/2 and 34 inches wide. It also includes a 6-inch extension kit to increase the width up to 40 inches. The extra height is great if you have a tall child and makes it more difficult for a curious child to climb. Plus, you can purchase two extension kits to accommodate wider spaces if necessary. The sturdy gate is ideal for doorways and hall openings, and when used with the four wall cups (included), it can also be installed at the top of the stairs.Convenient Walk-Through DesignThe gate's convenient design allows adults to walk through with a simple lift of the lever-style handle. It offers a safety lock one-touch release that's easy for adults to operate but impossible for babies and toddlers. The gate can even be used to contain large pets to one part of the home.Lightweight and PortableAs easy as it is to install, it's even easier to take down thanks to its pressure-mounted system. The gate's lightweight, portable frame stows flat, so you can take it with you on your next overnight trip.The Regalo Easy Step Extra Tall Walk-Through Gate is backed by a manufacturer's limited 90-day warranty.About Regalo: Safety and Convenience Above AllRegalo is an industry leader in products that make life a little less hectic for busy caregivers and exceptionally safe for little ones. The entire product line uses non-toxic powder coat and products such as bed rails, safety gates, and booster seats that are eligible for meeting ASTM standards and JPMA certification do just that. Over the years, parents, grandparents, and caregivers have come to know and depend on Regalo products for at home and on the go.What's in the BoxOne Regalo Easy Step Extra Tall Walk-Through Gate, instruction manual, one 6-inch extension kit, and four pressure mounted spindle rods with four wall cups.Standing at 41 inches tall, the Easy Step gate installs with four pressure mounts for a secure fit.", "title": "Regalo Easy Step Extra Tall Walk Thru Gate - White", "price": 45.68, "imUrl": "http://ecx.images-amazon.com/images/I/41wCRrmUI%2BL._SY300_.jpg", "brand": "Regalo", "related": {"also_bought": ["B00H3X89XM", "B003VNKLHK", "B0007G6KFQ", "B003VNKLHA", "B001OC5UMQ", "B001OC5UNK", "B008E4WIAE", "B003MA8P0W", "B0033PR7CS", "B0089HDZYO", "B003ARUKTG", "B000JJFNJK", "B0055LV3XW", "B000XT30G4", "B0002DHXVE", "B001J4LM6W", "B003VNKLIE", "B00GUN3Z1W", "B003VNKLI4", "B000A796WG", "B002U4MP4I", "B000JJDI0G", "B002C7GQ0C", "B007A2ZSZ8", "B000QFWCLY", "B00081J3N6", "B000OX89XI", "B003TU0XG4", "B00063KG3W", "B00EI673B6", "B005FU4XBW", "B000P007FI", "B003NSAY7U", "B00FPKNRF0", "B000FPKZPA", "B0001ZWZ8O", "B00063KG7S", "B000OX64P8", "B000A09C4K", "B000QFT1RC", "B000OX89VK", "B000H904WI", "B0040QQ07C", "B0026T65Z2", "B005AP3B8S", "B0031M9H3A", "B002ZF4T1O", "B007ZXJYHU", "B00HJTI3KE", "B0002DHNLE", "B0002AR18C", "B00FG6G7XM", "B0002AR0II", "B0002DGL26", "B0002AR0I8", "B0053WMOJA"], "also_viewed": ["B001OC5UMQ", "B000XT30G4", "B001OC5UNK", "B000JJDI0G", "B000JJFNJK", "B003VNKLHK", "B0089HDZYO", "B0038OLMXE", "B002VLR6JE", "B000PRUAFI", "B0000DEW91", "B0007G6KFQ", "B00DCR5EKE", "B000058CC7", "B003VNKLHA", "B003CZOZ8S", "B005JN6304", "B006UMUB92", "B000Y3HXDA", "B000EICY8E", "B00AJSJE3C", "B00LOV18DC", "B004CLBX0Y", "B0007G6KEW", "B001BS43SU", "B001OB83FS", "B00K4OB9YI", "B003VNKLIE", "B000A796WG", "B0055LV3XW", "B004CLBX2M", "B005DOS2EE", "B00AX0LG64", "B0089HDZYY", "B003VNKLFM", "B001TI4ADA", "B003VNKLI4", "B00H3X89XM", "B0002JETOM", "B001OE1PDC", "B001PYQWXY", "B004CL9YHS", "B00FLXBJ92", "B000P007FI", "B00LNTZRPU", "B00K4OBC54", "B000G6BZJI", "B004CEN62O", "B0040MN2EU", "B000Y3OJTG", "B0055LV4MM", "B0006GW0YC", "B001MUK5A2", "B00GUN3Z1W", "B00EFB78M8", "B000EIGJQ2", "B000GGD3O8", "B00AQE6Z6I", "B001L67EQA", "B000H1OMHE"], "bought_together": ["B003VNKLHK", "B001OC5UMQ"], "buy_after_viewing": ["B001OC5UMQ", "B000XT30G4", "B000JJDI0G", "B001OC5UNK"]}}