{"asin": "B0030MITDK", "related": {"also_bought": ["B000SIFHZM", "B004HGZ6J8", "B001R6SRMO", "B0055OMCJ8", "B001S0PWWC", "B0044CQ89C", "B0052OYT4M", "B001207YMY", "B004FLL5BI", "B002KIBFKY", "B0058VDO9K", "B00DQYAKYS", "B003VNKNEQ", "B003N65X28", "B003VNKNF0", "B00BV9ZQKS", "B004SPQREQ", "B003RRDN6Q", "B004I4IZYW", "B0058VDWS8", "B004FLL5B8", "B00E00KH0O", "B006QIWZEE", "B007Y4NWH8", "B0045DPCNI", "B002FECHQ4", "B004CGJ8CE", "B002HZJ1T2", "B001C1PQO6", "B005C3CSXC", "B0049WZH2G", "B004I72D2Y", "B009R5F5IQ", "B004FLL5AY", "B00A4AKFOW", "B004I77BWG", "B004Q19T74", "B004GKLW3O", "B0058VDIQO", "B004OEQKI4", "B007JRB0RE", "B005FGXYCU"], "bought_together": ["B003VNKNEQ"], "buy_after_viewing": ["B000SIFHZM", "B003VNKNF0", "B001R6SRMO", "B004FLL5BI"]}, "title": "Kodak PlaySport (Zx3) HD Waterproof Pocket Video Camera - Black", "price": 259.0, "salesRank": {"Camera &amp; Photo": 717}, "imUrl": "http://ecx.images-amazon.com/images/I/31J2tRAHOgL._SX300_.jpg", "brand": "Kodak", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "Life&rsquo;s an adventure. Soak it up in HD.Be fearless with the KODAK PLAYSPORT. It can plunge up to 10 feet under water and record it all in full 1080p HD.Heads up, adrenaline junkies. The KODAK PLAYSPORT has as much appetite for adventure as you do. And it&rsquo;s not afraid to get wet. This audacious little camera can plunge up to 10 ft under water and capture the entire experience in full 1080p HD. And you don&rsquo;t need to worry about blurry footage when things get a little shaky. With built-in image stabilization, the KODAK PLAYSPORT will stay steady as a rock. From the waves, to the slopes, to the mud-soaked trails, this baby was made for the extremes.Show them what you&rsquo;re made of &ndash; in HDTake the plunge with the waterproof digital video camera capable of shooting up to 10 ft. (3 m) under waterGo anywhere&mdash;rugged design enables full 1080p HD video recording in just about any environment&nbsp;&nbsp; &nbsp;Start bragging with amazing 5 MP, 16:9 widescreen HD still picturesMake a colorful statementThe KODAK PLAYSPORT Video Camera was designed with you in mind, right down to the colors it comes in. We took cues from the environment&mdash;from nature, to climate, to the adrenaline rush it provides&mdash;and transformed it into attention-grabbing colors that help you stand out from the crowd.Don&rsquo;t let sun glare ruin your recordingSimply use your camera settings to turn on the LCD Glare Shield featureLCD Glare Shield feature gives you two filters to choose from that help you see your subject on the display screen in reflective outdoor situationsThese filters are only applied to your display screen, not your footage&mdash;so everything you record will look as great as the moment you shot itSmooth, stable, and always ableGet sharper videos and less blur thanks to built-in electronic image stabilizationAccidents happen&mdash;luckily the PLAYSPORT isn&rsquo;t afraid of a little fall, it can take itCapture your friends in all their glory with smart face tracking technologySee more details and accurate colors with incredible low-light performanceShare your rebellious sideShare on Facebook, and YouTube and Twitter sites with ease&mdash;built-in software and USB cable make editing, uploading, and sending e-mails simpleDebut videos in the palm of your hand with the vivid, high-contrast 2.0 in. color LCDThere&rsquo;s always room for more&mdash;record up to 10 hours of HD video with expandable SD/SDHC card slot (up to 32 GB)1Catch the highlights with slow motion playback right in the palm of your handReady for the big screen&mdash;right out of the boxComplimentary HDMI cable lets your videos debut in full gloryNever miss a moment thanks to the rechargeable Li-Ion battery with in-camera chargingIt doesn&rsquo;t matter if you own a MAC or a PC&mdash;the KODAK PLAYSPORT is compatible with bothBe creative with great video softwareEdit and trim videosAdd a voice-over to narrate your footage when editing on a PCAdd pictures and music to your videos to make cool mash-upsGrab and edit still images from video frames to get that perfect shotEverything you need to shoot, watch, and share 1080p HD videoKODAK PLAYSPORT Video CameraKODAK Li-Ion Rechargeable Digital Camera Battery KLIC-7004HDMI and AV cablesWrist strapUser GuideARCSOFT MEDIA IMPRESSION Software for Kodak (PC only)1 Record about 20 min per 1 GB at 720p HD at 30 fps. Actual results may vary."}