{"asin": "B0001IXUDK", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Cables & Interconnects", "Video Cables", "HDMI Cables"]], "description": "The Ultimate Audio/Video Interface Has Finally Arrived in One Digital Connection. Backed by some of the industry's biggest names, High-Definition Multimedia Interface (HDMI) enables true high definition audio/video content for consumers. HDMI cables and adapters by Monster have been developed in a joint partnership with HDMI founder, Silicon Image.Silicon Image and Monster have worked together to deliver HDMI's crystal-clear, all-digital, high-definition video and multi-channel audio. Not all HDMI cables are created equal. Without the right design and construction characteristics, all HDMI cables are susceptible to the same noise and loss that can compromise analog audio and video.Maximize Your Connection with the Ultimate HDMI Cable: Monster HDMI 400You've invested in HDMI technology so you could get superior picture and sound from your home theater. Now you can maximize the performance of this extraordinary digital interface by making the connection with the highest quality cable.Monster HDMI 400 is a remarkable new high-bandwidth digital connection that offers superior digital video and multi-channel audio in a single cable, reducing the maze of home theater connections. It's simple, user-friendly connection is backwards-compatible with DVI, and it delivers a high-definition picture that's five times the resolution of conventional TV for the highest quality, crispest image quality available. Now you can connect HDMI-equipped devices such as DVD players, set-top boxes, AV receivers and HDTVs with a cable that helps optimize this next-generation technology. For the ultimate high-definition audio and video HDMI experience,  get Monster HDMI 400.Advanced Design and Construction for the Best Possible Sound and PictureMonster HDMI 400's advanced design and construction exceeds HDMI standards to transfer digital AV signals with optimal power, accuracy and clarity. 24k gold contacts resist corrosion to provide optimum signal transfer. Triple-layer shielding rejects interference for the clearest picture possible. And Monster's gas-injected cellular dielectric helps facilitate high velocity transfer and maximum signal strength, even over long lengths.", "title": "Monster HDMI-400 400 Series HDTV HDMI Cable (2 meters)", "price": 38.0, "imUrl": "http://ecx.images-amazon.com/images/I/41PHgkoZN4L._SY300_.jpg", "brand": "Monster", "related": {"also_viewed": ["B003ILIFEG", "B000UF3FT8", "B000UF53I4", "B004H1P7H4", "B0049II7W2", "B000JVGWJI", "B00J8SM6Y8", "B00H7L7QMA", "B000UF24OK", "B0019EHU8G", "B000UF53HA", "B008BKRT1Y", "B00GXI12LO", "B000JVCPEY", "B000UF24P4", "B002RL9XQW", "B00GSE97FG", "B00GXI11LA", "B003RI9BUW", "B00DG54ARU", "B000UF3FV6", "B003R7MQMI", "B000UF53HK", "B009NIBFHM", "B003CT08E4", "B001MZXUI6", "B008DGMNCQ", "B00GOY00WE", "B007VX2DL8", "B00BEWF4R2", "B009NIAGXQ", "B00GOY004C", "B003TVU00C", "B000UF3FUC", "B009A44N8M", "B00HSWI7YE", "B000WX9E0M", "B000WXAXG6", "B000UF3FVG", "B0031APPM4", "B0040DEACC", "B003CT2A6I", "B000WX7B5M", "B001A5PDKQ", "B000UF72E2", "B009A44NRS", "B000UF24PE", "B0052SCU8U", "B00421DQMM", "B0019HL8Q8", "B003L1ZYYM", "B00DUIGOEU", "B005GGTTZ0", "B008YLHBEA", "B00II6VY2G", "B0060B7NCG", "B00870ZHCQ"], "buy_after_viewing": ["B0019EHU8G", "B003L1ZYYM", "B003ILIFEG", "B000AA2RCY"]}}