{"asin": "B000HCJD68", "description": "Untold Legends: Dark Kingdomsets the standard for next-gen RPGs through never-before-seen graphics delivered in true high-definition and all-new action-RPG combat featuring physics-based gameplay. Immerse yourself in a truly epic fantasy adventure that comes to life through engaging storylines and action-packed battles filled with heart-pounding combat, magical spells and brilliant SFX. Experience cinematic storytelling and in-depth character progression as a hero in a fantastic world of beauty, terror and betrayal, where only you can end the long standing oppression of a tyrannical king. Collect and equip thousands of weapons, armor, and items along your journey as you slay the hordes of monsters which inhabit the magical worlds from which they come. In addition,Dark Kingdomwill feature online gameplay and expanded online game options through the PlayStation 3's online service. Prepare to experience the next generation of console gaming. Prepare to experienceDark Kingdom. The truth lies in darkness on PlayStation 3.Co-op RPG action in glorious high definition.Cast spells as a mage for powerful damage.View larger.Enemies often attack in groups.View larger.The evil King suspects your aware of his plans.View larger.Join a friend online for co-op questing.View larger.A warrior's riteYou are members of the Dragon's Shade, an elite squad of mystical warriors with the ability to absorb power from those you defeat. Although you have loyally served King Halaskar, you have reason to believe he is being corrupted by ultimate dark forces. Sensing your distrust, Halaskar sends you off to quell an uprising in the barbaric borderlands. However, upon your return home, to your utter amazement, you find the land of Dureth a horribly changed place.Greater sources reveal to you that it is very possibly your own king who is responsible for brutally torturing and mindlessly killing many of the innocent people whom you were once sworn to protect. In order to save your Kingdom and restore peace and order to the lands, you and you comrades agree that the only solution is to assassinate the king.On your journey, get ready to explore mystical lands drenched with deceit and betrayal as you venture to save your people. Teleport to the first site of anguish, the Sunken Cathedral located in a flooded portion of the city where the king's sorcerers have animated the long-drowned people to keep them in eternal pain. Or battle your way through The Kiln, a terrifying place where Halaskar relentlessly burns citizens alive to further fuel his power. Race to The Grinder: a gigantic machine that mixes unwilling slaves with blades and saws and save Dureth before it is too late.The future of your Kingdom lies in your hands...Opportunity knocksEncounter numerous foes on your quest and defeat them with skills beyond your wildest imagination. Encounter the following four characters as you attempt to put an end to Halaskar's madness:Warrior- The awesome might of his steel-clad fists leave a trail of shattered bodies in his path. His magical abilities mirror his physical strength. This includes rippling shockwaves, controlled blasts of force, and other earthshaking attacks.Scout- Using shadow magic, poisonous attacks, and vicious direct assaults, the Scout is a fierce close-quarters combatant. Her agility and skill with bladed weapons giver her an almost snake-like appearance as she weaves through throngs of enemies.Mage- The Mage wields a staff in addition to his mastery of arcane elements. The Mage's basic attacks are weaker than the other classes but he makes up for it with his commanding power over the elements of fire and ice.King- Halaskar is a man driven by the pursuit of power an security. When Halaskar assumed the throne, he vowed to secure the Kingdom of Dureth from al aggressors once and for all. Yet as the years passed, the kingdom descended deeper and deeper into an era of war and suffering. Today, rumors whisper of great atrocities against the people of Dureth...atrocities committed by monsters bearing the King's orders.Not only doesUntold Legends: Dark Kingdomfeature rich next-generation visuals and engaging combat, but it also offers players a unique multiplayer online co-op mode. Take on Halaskar yourself or ask a friend to join you on your quest. Either way, the Kingdom hangs in the balance, and a world looks your way for help.", "price": 39.99, "imUrl": "http://ecx.images-amazon.com/images/I/51Nk1FAfuLL._SY300_.jpg", "related": {"also_bought": ["B000K9OP2A", "B003O6G1L4", "B000K9OR4Q", "B000JLIXI6", "B000G7X5Q8", "B000ZK695U", "B000UW1YBW", "B00319DX4M", "B001D7T2VC", "B003A6X0H6", "B002I0J4AM", "B004WL4LOY", "B001ASJIS6", "B000KLNLUK", "B0047TLIBU", "B00104KCF8", "B003DLQTYY", "B00BJH11FQ", "0761554637", "B002BRYHY0", "B002X9KYFW", "B00KQPYA4Q", "B002W5GI9I", "B000UHI7IK", "B00C3MKCF6", "0804163448", "B000QAVV6G", "B0007UDYTW", "B009VURUYE", "B005185SDA", "B002BRZ744", "B00170823O", "B002BXJ9VA", "B0081B1O5A", "B000BKHYQ2", "B000R3CIV4", "B0030GBU2I", "B000ZK7ZOE", "B002DC8GKO", "B002I0J45C", "B00104KJ4W", "B000QW9D14", "B00K6ZNX3K", "B002ELCUUG", "B0000CDZBC", "B000ZK7ZOY"], "bought_together": ["B000K9OP2A"], "buy_after_viewing": ["B003O6G1L4", "B000K9OP2A", "B0016C3260", "B000K9OR4Q"]}, "salesRank": {"Video Games": 7412}, "categories": [["Video Games", "PlayStation 3", "Games"]]}