{"asin": "B008P8FDEW", "description": "Now there&rsquo;s a better way to defend your property. Catch every detail and observe every movement at your home or business with the Swann TruBlue 8 Channel D1 Professional Security System. It is cutting-edge high resolution D1 surveillance technology made easy, at an affordable price.The Real-Time Security Monitoring System includes a state-of-the-art 8 Channel D1 DVR with real time, full screen high resolution video playback and recording of 8 video streams locally, over the Internet or on your compatible 3G Smartphone or tablet. The kit includes 4 high resolution day/night security cameras to ensure all the important locations at your premises are protected. You also have the ability to add 4 more cameras of your choice for full 8 channel monitoring to ensure all the important locations at your premises are protected.Swann&rsquo;s 8 Channel 3000 DVR is capable of real-time D1 recording on all 8 channels (30fps per channel, 240 fps total). This allows you to playback full screen video in rich high resolution and in real-time. Each channel is also independently configurable, so that you can record for longer, and the H.264 video compression allows for fast, efficient recording and playback. Leave fuzzy CIF and imitation D1 DVRs in the past, you will notice the difference with true D1 video resolution.The 4 day/night cameras provide crystal clear video through their high resolution 600 TVL image sensors with night vision up to 65 feet and the ability to operate indoors and outdoors. The cameras are truly weather proof with IP67 ratings for water resistance and the cables are threaded through their mounting stands for added protection.&#x2028;&#x2028;The difference between this system and other DVRs is crystal clear with a HDMI port generating high definition video to your plasma or LCD TV or monitor (HDMI cable not included). The D1 DVR also has a VGA connection for viewing on your LCD monitor or compatible TV (with PC (VGA) input).&nbsp;A massive 1TB SATA hard drive is pre-installed to allow up to 30 days of continuous recording from all 8 channels* or record for even longer with motion triggered recording. If an incident you can transfer the AVI format video files to back up media via USB, network or eSATA. The new Swann SMART feature also monitors the performance of your hard drive, ensuring you can &lsquo;set and forget&rsquo;.Setting up the DVR for remote viewing has never been easier or faster with Swann&rsquo;s &lsquo;My DVR&rsquo; software guiding you through set-up coupled and the built-in UPnP (Universal Plug n Play) technology automatically configures the DVR to your router and the internet. You will also love Swann&rsquo;s DDNS service to ensure you can always log-on to your DVR remotely when you need to.Best of all you can integrate the Real-Time Security Monitoring System into your daily life like never before. Once you have installed the DVR and cameras at your home or business, simply download the free SwannView app for your Smartphone or tablet (including iPhone, iPad, Android devices, BlackBerry devices and more) and see what the cameras see live. You can also control the dome camera all on your SwannView app. To ensure you know what&rsquo;s happening at all times configure the DVR to send email alerts to your Smartphone, with a JPEG image of any activity attached. That&rsquo;s peace of mind, all the time.The Swann TruBlue 8 Channel D1 Professional Security System&nbsp;is professional, affordable and with cutting edge features to allow you to have peace of mind wherever you might be. It really is advanced security made easy.", "title": "Swann SWDVK-830004-US TruBlue D1 3000 8-Channel DVR with 4 x 600TVL Cameras and 1 TB Hard Disk Drive (Black)", "price": 559.0, "imUrl": "http://ecx.images-amazon.com/images/I/41wWqm1hQfL._SY300_.jpg", "related": {"also_bought": ["B000P8X65S", "B008B4K7O6", "B002A6CWCQ", "B008YGGKUQ", "B001DZ6CDU", "B0017KZ8Y0", "B005B4M1RU", "B008P8FE6Y", "B002WM8ZV0", "B004EAHJAG", "B001D55HHW", "B008XV7T5C", "B008P8FDX8", "B008EDS5ZM", "B008B4KMSC", "B00A43XGWW", "B0076QH71Q", "B008D1KRHE", "B0058RLD9C", "B002S4G870", "B002A6CWEO", "B000S7AQF4", "B005AXDVUS", "B008P8FELO", "B000P910OG", "B0076CLIME", "B00280KIJ8", "B0056PKPZ4", "B008FXH2O6", "B004EAMFDC", "B003MHUN7S", "B005JWAN9W", "B001D2AV8A", "B000P8Z3MM", "B000TBHBSO", "B004T9Y0MW", "B00571CD70", "B005UK1UL8", "B005B4O4GG", "B001RNHQ3S", "B008AGUI8K", "B000T8SO4M", "B0014D06IS", "B006962PLG", "B00A16FR10", "B001BGGD4E", "B002KPTVLW", "B003RZY9U2", "B001HBP9ZC", "B000VRIK54", "B00D36MC0E", "B007Q8KD6U", "B002OXL8IY", "B000QBPUKS", "B004REA7MG", "B004GW25WY", "B003K1NFY4", "B00CK2PG0U"], "buy_after_viewing": ["B00ENKQ1ZQ", "B001D55HHW", "B001DZ6CDU", "B008B4K7O6"]}, "categories": [["Electronics", "Camera & Photo", "Video Surveillance", "Surveillance Systems", "Surveillance DVR Kits"]]}