{"asin": "B001AAN4PW", "categories": [["Electronics", "Portable Audio & Video", "Digital Voice Recorders"]], "description": "From the ManufacturerCapture EverythingThe Pulse smartpen records audio and links it what you write. Missed something? Tap on your notes or drawings with the tip of your Pulse smartpen to hear what was said while you were writing.No Need to Lug the LaptopThe Pulse smartpen automatically captures everything as you write and draw. Transfer your notes to your computer, organize them, and even search for words within your notes. Find what you want in seconds.Share Your NotesTransform your notes and audio into interactive movies. Upload your creations online for everyone to see, hear and play.What You GetThe Pulse smartpen (1.3 ounces, anodized aluminum housing)2 GB of memory (actual user available memory will be less)Livescribe Desktop software (download)3-D Recording Headset100 sheet dot paper college-ruled notebookUSB mobile charging cradleSmartpen case3 black fine point ink cartridges + 1 stylus cartridgeDemo card and interactive stickersInteractive Getting Started GuideWhat You NeedWindows XP&trade; 32-bit SP2 or higher, Windows Vista&trade; 32 or 64-bit operating system, or Intel Mac with Mac OS X 10.5.5 or newer600MHz CPU or higher300 MB minimum free disk spaceAvailable USB portInternet connectionThe Pulse smartpen works only with Livescribe dot paper.Warranty InformationInternational Limited Warranty. Livescribe warrants the Pulse smartpen to be free from defects in materials and workmanship under normal use for a period of ninety (90) days from the date of original direct or retail purchase. This warranty is void if the product has been damaged by accident or unreasonable use, immersion in water, neglect, abuse, improper maintenance, or other causes not arising out of defects in workmanship or materials of the product. All warranty claims are subject to: (1) you notifying Livescribe of the warranty claim within the warranty period, (2) Livescribe verifying the existence of a defect in the product and (3) receipt of valid proof of your purchase and the date of your purchase. Your exclusive remedy shall be, at Livescribe's option, to have it repaired or receive a replacement Pulse smartpen. All shipping costs, both to Livescribe and back to the user/owner must be prepaid by the user/owner. Before returning the Pulse smartpen, please contact the Livescribe Customer Service Department for instructions.In the event that a product under warranty is repaired or replaced, the replacement will be covered under the original warranty or for 30 days, whichever is longer. Repair or replacement is your exclusive remedy, and Livescribe&rsquo;s exclusive liability, under this warranty. The limited warranty set forth herein is the only warranty made to you and is provided in lieu of any other warranties (if any) created by any documentation or packaging. This limited warranty gives you specific legal rights.Disclaimer of Warranties.You expressly acknowledge and agree that use of the Livescribe desktop software, Pulse smartpen and other products and services is at your sole risk and that the entire risk as to satisfactory quality, performance, accuracy and effort is with you. Except for the limited warranty set forth above and to the maximumExtent permitted by applicable law, the Livescribe desktop software, Pulse smartpen, products and services are provided \"as is\", with all faults and without warranty of any kind, and Livescribe and Livescribe's licensors (collectively referred to as \"Livescribe\") hereby disclaim all other warranties and representations, either express, implied or statutory, including, but not limited to, the implied warranties of merchantability, of satisfactory quality, of fitness for a particular purpose, of accuracy, of quiet enjoyment, and non-infringement of third party rights. Livescribe does not warrant against interference with your enjoyment of the Livescribe desktop software, Pulse smartpen, products or services, that the functions contained in the Livescribe desktop software, Pulse smartpen, products or services will meet your requirements, that the operation of the Livescribe desktop software, Pulse smartpen or services will be uninterrupted or error-free, or that defects in the Livescribe desktop software, Pulse smartpen or services will be corrected. No oral or written information or advice given by Livescribe or any Livescribe authorized representative shall create a warranty. Should the Livescribe desktop software, Pulse smartpen, or services prove defective, you assume the entire cost of all necessary servicing, repair or correction.Limitation of Liability.To the extent not prohibited by law, in no event shall Livescribe be liable for personal injury, or any incidental, special, indirect or consequential damages whatsoever, including, without limitation, damages for loss of profits, loss of data, business interruption or any other commercial damages or losses, arising out of or related to your use or inability to use the Livescribe desktop software, Pulse smartpen, or services, however caused, regardless of the theory of liability (contract, tort or otherwise) and even if Livescribe has been advised of the possibility of such damages.In no event shall Livescribe's total liability to you for all damages (other than as may be required by applicable law in cases involving personal injury) exceed the amount of fifty dollars ($50.00). The foregoing limitations will apply even if the above stated remedy fails of its essential purpose.Paper &amp; Accessory ProductsThe warranty is 30 days. The customer would have to pay shipping both ways for defective product.Customer Support InformationPhone 1-877-SCRIBE9 (1-877-727-4239): Mon.-Sun., 7am-7pm PSTChat via www.livescribe.com/support: Mon.-Fri., 9am-5pm PSTEmail cs@livescribe.com: 7 days a weekSupport LanguagesAt this time, Livescribe only offers support in English.", "title": "Livescribe 2GB Pulse Smartpen (APA-00002)", "price": 289.99, "salesRank": {"Electronics": 49899}, "imUrl": "http://ecx.images-amazon.com/images/I/41N8dbsDUHL._SY300_.jpg", "related": {"also_bought": ["B001AAOZV4", "B001AALJ1I", "B001R4I74E", "B003TO56F8", "B002M3HO0M", "B00524DLZ0", "B002DJTMSW"], "buy_after_viewing": ["B00524DLZ0", "B001AAOZV4", "B001AALJ1I", "B009FU2AYU"]}}