{"asin": "B006SOLITY", "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS", "Trucking GPS"]], "description": "Thanks to Garmin Guidance 3.0, FREE lifetime Digital 3D traffic&sup1; and  map&sup2; updates, advanced lane guidance and much more, n&uuml;vi 3590LMT  provides the most comprehensive navigation capabilities available in our  thinnest 5\" high resolution touchscreen navigator.Navigate By Touch or By VoiceWith its innovative voice-activated navigation, you can control n&uuml;vi  3590LMT with your voice &mdash; allowing you to keep both hands on the wheel.  Simply wake up n&uuml;vi with a customizable voice command and begin speaking  menu options that are clearly displayed on the screen. You also can  control the n&uuml;vi using its high-resolution 5\" (12.7 cm) glass  touchscreen.Garmin Guidance 3.0 allows you to quickly look up addresses and  services and be guided to your destination with voice-prompted,  turn-by-turn directions that speak street names. It comes preloaded with  maps that feature 3-D landmarks and terrain for North America. It also  comes preloaded with more than 8 million points of interest (POIs) and  offers the ability to add your own.Avoid Traffic Tie-upsWith FREE lifetime traffic updates from Digital 3D Traffic, n&uuml;vi  3590LMT can help you avoid delays. Digital 3D Traffic provides updates  as often as every 30 seconds over the HD Radio system, so you can easily  reroute around congestion and arrive on time.Enjoy FREE Lifetime Map UpdatesWith FREE lifetime map updates, you always have the most up-to-date  maps, POIs and navigation information available at your fingertips. Map  updates are available for download up to 4 times a year with no  subscription or update fees and no expiration dates.Know the Lane Before It&rsquo;s Too LateNow there&rsquo;s no more guessing which lane you need to be in to make an  upcoming turn. Available in select metropolitan areas, photoReal  junction view makes unfamiliar intersections and exits easy to navigate.  When you approach an exit or interchange, n&uuml;vi 3590LMT will enter split  screen mode and show you a realistic depiction of junctions on your  route, complete with road signs and arrows that indicate the proper lane  for navigation. Bird&rsquo;s Eye junction view also is included for a  top-down look at upcoming complex interchanges.Go Beyond NavigationPoint-to-point navigation is just the beginning. Share information  and Live Services between n&uuml;vi 3590LMT and your compatible Android phone  withGarmin Smartphone Link.   n&uuml;vi 3590LMT also includes Garmin Digital 3D Traffic which delivers  traffic updates as often as 30 seconds over the HD Radio system. That&rsquo;s  up to 10 times more often than other traffic receivers. With Garmin  Digital 3D Traffic, you get all the advantages of our extensive Garmin  Traffic avoidance system, plus 2 to 3 times more road coverage than our  Garmin traffic offering over RDS.The built-in microSD&trade; card slot lets you store and use detailedcityXplorer&trade; maps or download custom voices and vehicles for free from  theGarmin Garage&trade;.  It also comes with a powered mount that charges while you drive as well  as dual-orientation functionality that lets you hold your n&uuml;vi  vertically or horizontally for added convenience driving or walking. And  for added convenience and safety, built-in Bluetooth&reg; connectivity lets  you make and take hands-free calls and texts.&sup3;&ldquo;Where Am I?&rdquo; emergency locator provides your exact latitude and  longitude coordinates, the nearest address and intersection, and the  closest hospitals, police stations and more. And Enhanced Exit Services  tells you what services you&rsquo;re approaching on the highway.What's in the Box:n&uuml;vi 3590LM (the \"T\" in \"LMT\" model name refers to the traffic cable included in the package)Preloaded City Navigator&reg; NT North America (U.S., Canada and Mexico)Lifetime maps&sup1; and traffic&sup2; (indicated by &ldquo;LMT&rdquo; after model number on the box)Digital 3D traffic receiver with vehicle power cable (vehicle power cable is traffic receiver)Quick release powered mount&sup3;USB cableQuick start manual&sup1;FREE lifetime traffic updates may not be transferred to another   person or another Garmin product. Lifetime traffic extends for the   useful life of your Garmin traffic receiver (as long as you own a  compatible Garmin GPS) or as long as Garmin receives traffic data from   its traffic supplier, whichever is shorter. A traffic receiver's \"useful   life\" means the period during which the receiver (a) has the required   technical capabilities to utilize current traffic data service and (b)   is capable of operating as intended without major repairs. Traffic   content not available for all areas. Seetraffic coverage areas.&sup2;If you purchase a n&uuml;Maps Lifetime subscription (sold separately   or bundled together with certain GPS models), you will receive up to 4   map data updates per year, when and as such updates are made available   on Garmin&rsquo;s website, for 1 compatible Garmin product until your   product&rsquo;s useful life expires or Garmin no longer receives map data from   its third party supplier, whichever is shorter. A product&rsquo;s &ldquo;useful   life&rdquo; means the period during which the product (a) has sufficient   memory capacity and other required technical capabilities to utilize   current  map data and (b) is capable of operating as intended without   major repairs. A product will be deemed to be out of service and its   useful life to be ended if no updates have been downloaded for such   product for a period of 24 months or more. Unless otherwise stated, the   updates you receive under the subscription will be updates to the same   geographic map data originally included with your Garmin product when   originally purchased. In some instances, your Garmin product might not   have sufficient memory remaining for you to load an update to the map   data, in which case you will need to either (a) select reduced map data   coverage for your updates, or (b) purchase separately a microSD&trade;/SD&trade;   card (if and as applicable to your Garmin product) and load all or a   portion of the map data coverage for your updates to the card and insert   the card into the microSD/SD card slot contained in your Garmin   product. If neither of the measures in (a) or (b) can be used to address   your product&rsquo;s lack of sufficient remaining memory, then Garmin may   conclude that the &ldquo;useful life&rdquo; of your product has expired. Garmin may   terminate your n&uuml;Maps Lifetime subscription at any time if you violate   any of the terms of this agreement or your subscription. Your n&uuml;Maps   Lifetime subscription may not be transferred to another Garmin product.&sup3;Only works with Bluetooth&reg; Message Access Profile compatible handsets. For compatibility call your carrier or check ourBluetooth&reg; compatibilitypages.", "title": "Garmin n&uuml;vi 3590LMT 5-Inch Portable Bluetooth GPS Navigator with Lifetime Map and 3D Traffic Updates", "price": 319.98, "imUrl": "http://ecx.images-amazon.com/images/I/418Q3Z0aB0L._SY300_.jpg", "brand": "Garmin", "related": {"also_bought": ["B00AWUT4A0", "B00INXAHCW", "B004I5BUSO", "B002OL2MU4", "B00422KZQG", "B005HN1UIG", "B007IW0SO6", "B00INXAQ28", "B007RMAS1K", "B003YCLB0E", "B00BXQ0370", "B00IPMJDEO", "B000LRMS66", "B0093CADC6", "B00B5TELRI", "B002UBK04I", "B001S2RCWI", "B00A8BU9NO", "B002I05VS6", "B007IW0C6K", "B00BCPYPVC", "B003N73S9M", "B00INXAJ0W", "B0035JL4V2", "B00F0CXAF0", "B008H6176U", "B008AWLSB0", "B00HSJN6H0", "B00CWNT69O", "B007RC71DS", "B004HYGEOQ", "B00AXX0IC4", "B00EDT9DQG", "B00B7DUAU4", "B002LV1EXS", "B000MNA3BG", "B005NJJWVG", "B002T0EK64", "B000F78582", "B000L3APBK", "B000U0S304", "B00488G6P8", "B005DIBFYE", "B00BGKQHQ4", "B0015A6YN6", "B004VBA4R8", "B00HPM6E5Q", "B000F7857S", "B000BKJDKM", "B009QZH6JS", "B002KO5XVU", "B003OR3HBU", "B009QZH7D8"], "bought_together": ["B002OL2MU4", "B004I5BUSO"], "buy_after_viewing": ["B00AXX0I88", "B00AXX0IC4", "B002OL2MU4", "B004I5BUSO"]}}