{"asin": "B001TH7T2U", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Cables & Interconnects", "Video Cables", "HDMI Cables"]], "description": "The AmazonBasics HDMI to DVI Adapter Cable connects your DVI-equipped computer, or any other device with a DVI connection, to your home theater or any other device that utilizes an HDMI connection. You can also use it to connect source devices with an HDMI connection, like Blu-Ray, PlayStation 3, or Xbox 360, to a DVI-equipped monitor or television set. This cable supports high-bandwidth, uncompressed video, and provides your system with high-definition video quality.High-quality, gold-plated connectors help resist corrosion for a long life and signal purity.Recommended Uses:Connecting your computer, or any other DVI-equipped device to an HDMI-equipped HDTV or other digital displayConnecting your HDMI-enabled devices (computer, Blu-Ray, PlayStation 3, or Xbox 360) to a DVI-equipped monitor or TVTechnical Specifications:Connector Type: HDMI A Male TO DVI 24+1MaleConnector Plating: GoldCable Length: 9.8 ft./3.0 mTransfer Speed: 1920x1200Jacket: PVC, blackWarranty: AmazonBasics 1-Year LimitedWarranty[PDF]Documentation:Helpful Hints[PDF]HDMI to DVI for Quality Video TransmissionHDMI (High-Definition Multimedia Interface) is the only industry-standard interface for transmitting uncompressed digital data. HDMI cables are intended for use with a wide range of everyday electronic components, such as computers and a home theater system&rsquo;s screen. HDMI provides video, especially at high resolutions, and renders small, high-contrast details, such as text, in high quality. DVI (Digital Visual Interface) is a video-interface standard that provides quality transmissions on digital display devices such as flat-panel LCD computer displays and digital projectors. Audio will need to be transmitted through a separate audio cable(s) or through a fiber-optic (Toslink) cable as the DVI connector of this cable is not fitted for audio capability.For Use with Computers, Blu-Ray Players, and Game ConsolesThis cable offers optimal support for resolutions up to 1920 x 1200 and is intended to connect computers and other source components with HDMI outputs--such as Blu-Ray players or Xbox 360/PlayStation 3 game consoles--to DVI-equipped televisions or monitors.Turn Your Computer into a Home-Theater CenterThe AmazonBasics HDMI to DVI Adapter Cable is intended to connect computers with DVI connections--such as home-theater PCs, Mac minis, and some laptops--to an HDMI-equipped HDTV, projector, or other display device.For office professionals, you can use this cable to create quality presentations using your projector. For home users, the cable will help you turn your computer into a virtual home-entertainment center, so you can watch all your computer-based media on your home-theater screen.Gold-Plated Connectors for Superior ConductivityThis AmazonBasics cable features shielding, a durable PVC outer layer, gold-plated HDMI A Male to DVI 24+1 Male connectors that resist corrosion while offering optimum signal transfer. To ensure compatibility, it's best to check your component product manuals to determine what kind of connections your components require.AmazonBasics: Quality Products at Low PricesAmazonBasics is a collection of consumer electronic \"basics\" created by combining quality and low prices for an overall focus on value.Warranty and Helpful HintsThis cable is backed by an AmazonBasics 1-year limited warranty. To view the full AmazonBasics warranty,click here. If you are having trouble connecting your components with this cable,click herefor the AmazonBasics HDMI/DVI Helpful Hints Guide [PDF].What's in the BoxHDMI to DVI multi-shielded adapter cable (9.8 feet / 3.0 meters) and warranty card.", "title": "AmazonBasics HDMI to DVI  Adapter Cable (9.8 Feet/3.0 Meters)", "price": 7.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/417BbpDkU9L._SX300_.jpg", "related": {"also_bought": ["B003L1ZYYM", "B0035B4LJM", "B00BP5KOPA", "B003L1ZYYW", "B0098Y77OG", "B004S5H30I", "B000KZW9WM", "B00879DM56", "B00006HSM2", "B00ECDM78E", "B00G5AEZOQ", "B004C9M7UG", "B009H0XQPU", "B006FILNV6", "B00CCVKQRM", "B00C8T5KOW", "B00IT1WJZQ", "B009H0XQRS", "B0052SCU8U", "B004C9O6T6", "B007ZS3O62", "B003MTTJOY", "B00C0Y6BQG", "B00GTV05XG", "B005YR1PV2", "B005FNC0JG", "B00C28L51G", "B002VV1HOO", "B00G6TPCN4", "B0038XNTWW", "B00AGQ4WHA", "B002CSRF9M", "B005BZNDOO", "B0041BT21M", "B004C9P9TM", "B007KB0EGC", "B009H0XQRI", "B00D601UC8", "B003M0NURK", "B001VKQR5U", "B00FY9RKW8", "B004S4R5CK", "B00C18YRSA", "B00GBV07QO", "B002IWP87S", "B009YCASUW", "B002TUC64W", "B0006LSISO", "B00870ZHCQ", "B009WA4EBU", "B007NJ0S1W", "B000FUVNX8", "B005DKZTMG", "B003VANO7C", "B004PW1XRS", "B007SM7O2U", "B005BZNDS0", "B00004Z5CP", "B0098Y77U0", "B00GWDLJGS", "B008BUIKD0", "B00FE8MKU6", "B007EA48MA", "B005EJH6Z4", "B003NREDC8", "B003VAGXZC", "B005H3I38Q", "B00IEZGY2Q", "B001TH7GUU", "B000067SOH", "B005H3Q5E0", "B007NLEF3W", "B00B7GV802", "B00DZLSEVI", "B00ENPQ1GK", "B0007MWE1E", "B002R0DZXU", "B00EHTUKLY", "B00B3P15M8", "B003SVSJ1K", "B004JO16KG", "B00CJHXY0U", "B00C18YUZU", "B005HPSFWI", "B00BFZ18O6", "B00629NHW6", "B0087OV77G", "B00BBD7NFU", "B001EPVOQY", "B009W8EWOG", "B00APLJY4C", "B00FX867JC", "B0038P1TP4", "B00FQU7CPU", "B00EMB4L0I", "B00LPESRUK", "B0071NWYP8", "B009K62HQ0", "B003UE52ME"], "bought_together": ["B003L1ZYYM"], "buy_after_viewing": ["B004S4R5CK", "B00879DM56", "B00C0Y6BQG", "B003L1ZYYM"]}}