{"asin": "B000PDR27G", "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]], "description": "Neither deep foliage nor steep canyons will faze the rugged Garmin eTrex Legend HCx navigator. Equipped with a high-sensitivity, WAAS-enabled GPS receiver, the unit locates your position quickly and precisely and maintains its GPS location even in heavy cover. The advantage is clear: whether you're traipsing through thick woods or strolling near tall buildings and trees, you can count on the Legend HCx to help you find your way when you need it the most. Adding maps to the Legend HCx is easier than ever thanks to the device's microSD card slot, which accepts cards preloaded with MapSource data for your land and sea excursions. Just insert a MapSource card with detailed street maps, and the Legend HCx will provide turn-by-turn directions to your destination. Plus, the card slot is located inside the waterproof battery compartment, so you needn't worry about it getting wet.Besides appreciating its small size, users will also be happy with the Legend HCx's unique button layout, with five buttons located on either side of the unit. The benefits of this design are twofold: First, the Legend HCx is a breeze to operate with just one hand, and, second, with the buttons on both sides of the unit, the bulk of the front is dedicated to the 256-color, sunlight-readable TFT display. This makes it easy to distinguish map details regardless of the time of day.The Legend HCx basemap, meanwhile, contains lakes, rivers, cities, interstates, national and state highways, railroads, and coastlines--in short, a host of helpful details for your outdoor adventures. Other details include an IPX7 waterproof housing that withstands inclement weather, a speedy USB interface, 1,000 waypoints with names and graphic symbols, a track log with 20 saved tracks, a hunt/fish calendar, a built-in patch antenna, and a geocaching mode. The Legend HCx, which runs for up to 25 hours on a pair of AA batteries (not included), measures 2.2 by 4.2 by 1.2 inches (W x H x D) and is backed by a one-year warranty.What's in the BoxeTrex Legend HCx, basemap, MapSource Trip & Waypoint Manager software, USB cable, wrist strap, quick start guide, user's manual.", "title": "Garmin eTrex Legend HCx Personal Navigator", "price": 219.89, "imUrl": "http://ecx.images-amazon.com/images/I/41Y8g%2BBy-zL._SY300_.jpg", "brand": "Garmin", "related": {"also_bought": ["B00004VX39", "B00004VX15", "B0002WSL7A", "B000JLP5UK", "B002MIT5ZE", "B000PDR230", "B000PDR1LS", "B00542NVDW", "B00542NV32", "B0055BJBCM", "B000PDV0CE", "B0013KTADE", "B001OMGVLK", "B00003IEME"], "bought_together": ["B00004VX39"], "buy_after_viewing": ["B00542NVDW", "B00004VX39", "B000PDR1LS", "B00542NVS2"]}}