{"asin": "B000X1TC0U", "description": "Dead Space from EA is sure to please any action-adventure gamer looking for a bloody battle against deadly aliens. Dead Space for PlayStation 3 begins when a massive mining ship, the USG Ishimura, comes in contact with a mysterious alien artifact and suddenly loses its communications with Earth. Engineer Isaac Clarke is sent to repair.caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Deep Space pits Isaac Clarke against deadly aliens.View larger.Zero-G game play allows you to walk on walls and the ceiling.View larger.EA delivers an incredibly frightening experience with state-of-the-art graphics and effects.View larger.Neutralize the attacking enemies with weapons and telekinetic powers.View larger.the Ishimura's communications, but arrives to find a floating vessel that has become a complete bloodbath. The crew is mutilated and infected with an ancient alien scourge. Clarke's repair mission is transformed to one of survival as he fights to save himself and return the artifact to the planet at any cost.Fight with Weapons and TelekinesisThe alien hordes are incredibly resilient. You'll have to find creative ways to neutralize the attacking enemies by shearing off limbs with powerful weapons. And when the ammo runs out you'll be thankful that you can use your telekinetic powers to pick up objects (even the aliens' own severed arms and legs) and hurl them at your advancing enemies.Graphics, Effects, and Sound Increase the HorrorEA delivers an incredibly frightening experience with state-of-the-art graphics and effects, an audio system that will have you jumping out of your seat, and a truly horrific atmosphere that is permeated with death, mutilation, and despair. You'll have to be resilient to slash through the alien onslaught and stop this virulent scourge. As you explore the ship, the tragic story of the USG Ishimura will unfold in gory detail as you discover frantic logs from the hideously transformed crew in their final days.True Zero-G EffectsYou'll be able to take full advantage of zero gravity in Deep Space. Battling enemies and solving puzzles takes on new challenges and present ingenious opportunities with the Zero-G game play. You can use zero gravity to create your own path around obstacles by walking on walls and the ceiling. Leap across vast distances or change your perspective to gain a strategic advantage over your enemies.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51byOFTwekL._SY300_.jpg", "related": {"also_bought": ["B00309XHD0", "B0050SWUTQ", "B0043M64FQ", "B009WI7VAS", "B003O6EDSM", "B003C1I06U", "B001NIP3EG", "B000WQWPP0", "B001D7T2VC", "B0065NP05G", "B000HKMPVA", "B00104KCF8", "B003O6E6NE", "B0050SXX88", "B002BRZ6UE", "B008E6ZXTA", "B00B59L9T6", "B004FUI84G", "B001B1W3GG", "B00269DX5W", "B00DJ42BUQ", "B004NRN5EO", "B0050SXAIG", "B00BU3WVM6", "B002BRZ744", "B001NX6GBK", "B008CP6Q6M", "B002AB7TX8", "B0050SXGU8", "B007CM0K86", "B005C2D1YI", "B002I0J5UQ", "B0050SXLQC", "B004YVOCV4", "B000P46NMA", "B002I0J8FI", "B009GZX49Y", "B00149MEVY", "B008CP6MA2", "B001UWGCW2", "B005YR308S", "B003L8DXOI", "B001YHX4B0", "B004FS8LYK", "B002Z7BE24", "B003O6HDHA", "B000ZK7ZOE", "B0012N94WO", "B007SRM5U6", "B000UW21A0", "B002I0H2G0", "B008CP6RUW", "B000FQBF1M", "B007TYC8MI", "B0085CA8QG", "B002I0K5NC", "B005N4HBIW", "B005VBVQDI", "B00GFV5DI2", "B002BXKJ6O", "B00BMFIXKQ", "B006JKAS16", "B0056WJA6M", "B009DZTXQU", "B009JBFF9C", "B0076ZQSFI", "B008PQU3E4", "B0050SXFKE", "B0041OWQTO", "B001TOMQSK", "B0022TNO7I", "B001AWBYNE", "B00319DX4M", "B0047TLIBU", "B000FQ2D5E", "B005185SDA", "B003GT8IL0", "B00CJ7IUI6", "B004UDB9SA", "B003O6E67A", "B007UM599S", "B003O680RM", "B001C0NMXE", "B002I0F5I2", "B000WMEEBM", "B00354NANC", "B008XMSR6G", "B001BP4JY6", "B000ZK9QCS", "B0050SX7BQ", "B002CYWJWO", "B003H0CBYS", "B0050SX9VO", "B008LW4SCU", "B0044SA734", "B008CP6RWU", "B00886WO7A", "B004HCYVO8"], "bought_together": ["B00309XHD0", "B0050SWUTQ"], "buy_after_viewing": ["B0050SWUTQ", "B007CM0K86", "B00309XHD0", "B009WI7VAS"]}, "salesRank": {"Video Games": 2020}, "categories": [["Video Games", "PlayStation 3"]]}