{"asin": "B000O5FUKQ", "description": "Prepare to experience an evolution in the first person shooter. Originally one of the most popular titles for the Nintendo 64, theTurokfranchise has returned with a roar; this time springing on to the Next Generation gaming platform. Armed with a rich, all-new story line, as well as features and gameplay that will remind players why they fell for the genre in the first place, players will come away knowing why it is a good thing for humans that dinosaurs went extinct.An FPS evolvedYou don't want to cross Turok.View larger.There's more than one way to skin a raptor.View larger.Duel wielding against the Wolf Pack.View larger.Solidier Bugs are as bad as dinos.View larger.The StoryYou are Joseph Turok, once a member of Wolf Pack &#151; the most savage, merciless black ops squad of its time. Now, you have been attached by special order to Whiskey Company, an elite commando team, for what should have been a simple mission: Capture and detain Roland Kane from his fortress on a worthless, backwater planet. Kane is an escaped war criminal, the once-legendary leader of Wolf Pack...and your former mentor. Unbeknownst to you and your team, Kane is in command of a secret paramilitary force funded by the Mendel-Gruman (M-G) Corporation. As Whiskey Company's ship approaches the planet, it is blasted out of the sky by Kane's troops. Suddenly, your simple mission isn't quite so simple. Even worse, it quickly becomes apparent that Mendel-Gruman scientists have been terraforming and genetically engineering the once-barren planet for accelerated evolution.The Trouble with DinosaursThe trouble is that they like meat and that&#146;s just what you are to them. So your number one rule is don&#146;t get eaten. Far from cuddly, the genetically altered prehistoric beasts that Mendel-Gruman has unleashed on the landscape of the world you are dropped into come in all shapes, sizes. Although game developer, Propaganda Games, drew from Earth&#146;s own fossil record, they also let their creative juices flow as they created the deadly fauna of the game. Just a few of the beasties players will have to deal with are:Velociraptors&#150; Velociraptors are some of the most vicious and deadly predators on the planet. Beware, they can charge their prey, knocking them backwards and then mauling them with their deadly claws and teeth.Mini-Raptors&#150; Despite their diminutive size, mini-raptors move quickly and often hunt in packs, making them a deadly enemy.Dilophosaurus&#150; This large dinosaur is a mean carnivore with a huge appetite. It has a large crest on its head and can use its powerful tail to knock down enemies.Lurkers&#150; Like a cross between a dinosaur and a powerful jungle cat, Lurkers prowl the jungle, climbing and positioning themselves on trees and rocks, always ready to pounce on its next prey.Soldier Bugs&#150; These eight legged creatures look like the common scorpion, but they are much bigger and deadlier. They can be encountered in caves and other dark, enclosed areas on the planet. They are often seen in swarms, and due to their large size can easily overcome prey.T-Rex&#150; The Mother of all dinosaurs, the T-Rex is the smartest and largest of all creature enemies on this terraformed planet. Turok and Whisky company will have many run-ins with the T-Rex throughout the campaign.In addition to these, other creatures also roam the jungles and caves of the planet, some carnivorous and others plant eaters, but all are dangerous. Underestimate them at your own risk.Strategy and Multiplayer MayhemAlthough the real attention grabber inTurokare the dinosaurs, the most challenging combat in the game is essentially human on human. In these clashes the dinos serve as very dangerous obstacles. Even so, it&#146;s best not to go dino crazy, so the best players should not only come to coexist with the &#145;terrible lizards&#146; of this planet, but find a use for them. Through a combination of tactics players will learn how to use the single-minded feeding instinct of the dinosaurs against their human enemies, both real and AI. But be cautious. Your human opponents know the rules of engagement as well as you do and may very well use your own tactics against you.Regarding game modes, in addition to a single player mode utilizing engaging cinematic flashbacks and in-game interactions with non-playable characters to reveal the path that has brought Turok to the jungles of this alien world, players will also enjoy several raging online multiplayer modes. Including everything from four-player co-op play to 16 player matches in deathmatch and capture the flag modes, these online frag-fests are best enjoyed by spreading the action across the game&#146;s seven in-game maps. Filled with a variety of terrain ranging from high exposed routes, to low lying paths and even lava covered volcano slopes, these maps and possible additional downloadable content, should add extensive hours of gameplay.Weapons &#150; Quiet and Not So Quiet KillsTrue to its RPG rootsTurokcomes loaded with a large arsenal of weapons, but the real fun of this selection is its variety. Easily accessible from your controller&#146;s D-Pad, available weapons are both low tech and modern, and range from the basic, but quite deadly survival knife and compound bow, all the way up to standard FPS favorites like chain guns, shotguns, duel-wield pistols and a rocket launcher. Learning to use all these at the proper time is also crucial. Beyond the addiction of taking down an enemy with nothing but a cold piece of steel, silence on the battlefield can be priceless, especially when there are raptors about that will come running at the slightest sound. But on the other hand a rocket launcher does come in handy in a pinch.In the end whether it&#146;s taking on the game&#146;s larger than life fauna or its unabashed old-school shooter roots,Turokis a sure bet to deliver for gamers yearning to get back to the good old days.", "price": 42.99, "imUrl": "http://ecx.images-amazon.com/images/I/51DFL%2BCKYjL._SY300_.jpg", "related": {"also_bought": ["B002E1R1TG", "B001TOMQSK", "B000JLIXIG", "B008E6ZXTA", "B001CRM3YQ", "B003GT8IL0", "B002I0JBL4", "B0012N3T3Y", "B000WS97QI", "B00006599O", "B000HWX418", "B000V1OUVI", "B005THAX6K", "B001UWGCW2", "B000QAVV6G", "B00354NANC", "B003P9FRGA", "B004ML44Y6", "B000K9OR4Q", "B000O5FULU", "B003H0CBYS", "B005185SDA", "B003S2MXQG", "B000SQ5LQE", "B004EW948E", "B002BRZ744", "B000KLNLUK", "B001PKHRUK", "B004PAGJNS", "B003O6E67A", "B000RHZ9G6", "B0085CA8QG", "B00163LW7K", "B00170823O", "B00HQY8LRM", "B000R3CIV4", "B003Q55YCU", "B000PS4X9G", "B002EZH804", "B000ZK9QCS", "B00B59L9T6", "B002ZJNWWC", "B002ELCV00", "B001NJ28SO", "B002EE1P2W", "B002BRZ6UE", "B0023CBZ70", "B004FS8LYK", "B004LWEK7C", "B004J6I0YO", "B002BXKJ6O", "B000K9OP2A", "B000R39GPA", "B004FUI84G", "B001NX6GBK", "B0030F1DOO", "B00149ILDO", "B001AWBYNE", "B000WQWPP0", "B00BU3WVM6", "B002I0J6DC", "B000NGP1R8", "B001TOMQOY", "B000SH3XCW", "B0021TVYCG", "B0030HM2WO", "B00104KCF8", "B00309XHD0", "B000UUATJ2", "B000HKMPVA", "B000R39GPK", "B0050SXX88", "B0050SXGU8", "B002I0K5NC", "B003O6KWZK", "B005VBVQDI", "B000XJK40O", "B001QXNBNI", "B0050SWUTQ", "B000RI17CA", "B006Y76HXM", "B002I0J5YW", "B000P297EI", "B000X1TC0U", "B004L9YS22", "B000XJLQ24", "B00FQCT1ZW", "B000PE0HBI", "B0056WJA6M", "B00109KMQC", "B0065NP05G", "B000FQ2D5E", "B003DLQTYY", "B0010EI6T2", "B0050SXOD2", "B001E7MMNG", "B0009351R0", "B0047TLIBU", "B0056WJA6C", "B000P46NMA"], "bought_together": ["B002E1R1TG", "B001TOMQSK"], "buy_after_viewing": ["B002E1R1TG", "B008E6ZXTA", "B001TOMQSK", "B00EFFVZP0"]}, "salesRank": {"Video Games": 7158}, "categories": [["Video Games", "PlayStation 3", "Games"]]}