{"asin": "B007MXGG5Q", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Repeaters"]], "description": "About Anker UspeedThe Anker Uspeed line produces reliable computer peripherals with the latest technology standards. Using quality materials, Anker Uspeed products offer superior data transmission, power consumption, and compatibility - all at affordable prices with our great Anker customer service.ThisAnker Uspeed Wi-Fi Repeaterenables your wireless access to the Internet where you want. It works in a well-targeted way rather than just adding higher power and more radiation.Three-in-one DeviceWireless Access Point(AP Mode) - If you have network cable in place at the room, or if you current router / modem has NO Wi-Fi capability, this device serving in AP Mode can create a wireless network around itself so that you can connect to the web wirelessly.Wireless Repeater(Repeater Mode) - If you want your existing wireless range to extend farther to the wanted direction but prefer there to be no wire to maintain flexibility, this device serving in Repeater Mode boosts the coverage of your existing wireless network by detecting the wireless signal and repeating it to a farther range.Wi-Fi Bridge(Repeater Mode) - Not all internet-ready devices are natively wirelessly capable. With this device set also in Repeater Mode, you can connect its ethernet port to your set top box, game console, blu-ray player or other ethernet device and quickly form a link to your existing Wi-Fi network, no additional wiring.Package Include1 x Wireless-N Wi-Fi repeater with input 110-240V; 1 x RJ-45 cable; 1 x instruction manualSupports & WarrantyAnker Uspeed provides customers with warranty of 18 MONTHS from the date of purchase. Anker provides 24 x 7 email support, and direct phone support from our US-based friendly customer service team.", "title": "Anker Generic Wireless-N Wi-Fi Repeater Access Point Range Extender 300Mbps", "price": 23.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31ZaoLVusHL._SY300_.jpg", "related": {"also_bought": ["B006J1ZAR2", "B0044YU60M", "B0078PY0E2", "B006JWMOOI", "B005D5M136", "B000M2TAN4", "B005CLPP84", "B006U1YUZE", "B0073FE1F0", "B003ULOZ5W", "B007KEZMX4", "B000Q8UAWY", "B002RM08RE", "B00DR0PDNE", "B001QUA6RA", "B00316263Y", "B006ZP8UOW", "B007KFXIDE", "B007HQR710"], "bought_together": ["B006JWMOOI"], "buy_after_viewing": ["B00E98O7GC", "B00794RDVY", "B00C4PLQAM", "B0087NZ31S"]}}