{"asin": "B0007U9KAY", "categories": [["Electronics", "Computers & Accessories", "Routers"]], "description": "Amazon.com Product Description.caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The NETGEAR WPN824 RangeMax Wireless Router offers:Advanced MIMO technology that delivers greater speed and range compared to standard 802.11gEnhanced security with support for WPA 128-bit WEP encryptionBackwards compatibility with 802.11b networksThe NETGEAR WPN824 RangeMax Wireless Router lets you easily set up a wireless network in your home so you can share a single internet connection with everyone in your household or office at speeds up to 108 Mbps. Using MIMO technology, the access point offers superior range and eliminates \"dead spots\" in your home or office.The WPN824 has an elegant design with no unsightly antennas.View larger.Beautiful Design and Easy SetupThe WPN824 is a very attractive unit with a white exterior and rounded edges. An included plastic stand lets you stand the router on its edge to take up less space. Since the antennas are built in, there are no protrusions extending out of the case, maintaining a clean, elegant form factor. A vertical stand is included for more placement options.The WPN824 makes it easy for even a novice to set up a wireless network: just plug the included Ethernet cable from your DSL modem, cable modem, or other network connection into the router. An installation wizard guides you through the setup process step-by-step.The WPN824 employs a web-based interface for configuration, and the router will automatically do the initial setup by getting your DNS settings and determining your IP address. The firmware is also upgradeable via the web interface so you can be sure your router will always be up-to-date.Fast and SecureThe WPN824 supports the 802.11g standard but extends it with Smart MIMO technology that incorporates intelligent internal antennas, allowing it to detect interference from home devices such as microwaves, and adjusting itself accordingly. The upshot is speeds up to 108 Mbps with a longer range and a lack of \"dead zones\" in your home. When used with NETGEAR's adapters, it can provide up to 500,00 square feet of uninterrupted coverage. You will see the difference when you download music, stream video, or make internet telephone calls. If you still have computers that use 802.11b, don't fret as the router is backwards compatible with the older wireless standard and can be set so all your computers can connect to the network and the WGR614 will automatically figure out the connection type and work accordingly.Smart MIMO technology automatically adapts for interference from devices such as cordless phones and microwaves.In addition to wireless access, there are four 10/100 Mbps RJ-45 Ethernet ports in the back for connecting computers to the network via a fast wired connection.The WPN824 offers many security options to ensure your data is private. Double firewall protection keeps your network shielded from outside attacks and Network Address Translation (NAT) hides your PCs and files from outside snoopers. To ensure the security of your wireless data, both 40/64-bit and 128-bit WEP encryption is available, as well as WPA (Wi-Fi Protected Access). You can also use MAC address authentication to allow only authorized users onto the network and Wireless Access Control (SSID) to identify authorized wireless network devices.Keep Tabs on KidsThis router is an especially good choice for parents as it allows settings to log all sites that are visited, lets you block specific sites based on whether it contains specific keywords, and lets you set time schedules for certain computers to work.The NETGEAR WPN824 RangeMax Wireless Router is backed by a 1-year warranty.What's in the BoxWPN824 RangeMax Wireless Router, power adapter, Ethernet cable, setup guide, setup CD, vertical stand, warranty/support information card.", "title": "NETGEAR WPN824NA Wireless Mimo Router", "price": 24.99, "salesRank": {"Electronics": 39759}, "imUrl": "http://ecx.images-amazon.com/images/I/31WJjyebJML._SX300_.jpg", "related": {"also_viewed": ["B001UI4RTG", "B004H1PMJC", "B0041LYY6K", "B000W4HJ6M", "B00008SCFL", "B000MANHJE", "B001AZP8EW", "B002HWRJY4", "B000LIFB7S", "B008HO9DK4", "B00894WP4S", "B0045HG53K", "B0085WN7YQ", "B002RYYZZS", "B00EM5UFP4", "B00004SB92", "B004N6259Q", "B005KG44V0", "B000QD7B6W", "B001FWYGJS", "B0014J07R2", "B006QB1RPY", "B0000C0XS0", "B004N6259G", "B00KFD0O9E", "B0085WVQDK", "B002VJL0OS", "B000Z3U1P6", "B000FFRZ1W", "B00F3ZN536", "B008HO9DIG", "B0009K9FZW", "B003QQ0NIY", "B0096239EC", "B00HEX851C", "B00F0DD0I6", "B005SAKW7S", "B005GRFC82", "B0081H8TRA", "B00II4QK2W", "B008I21EA2", "B0045HHTGW", "B000H97UC0", "B00KWHMR6G", "B000BTL0OA", "B001SEL326", "B004T9RR6I", "B0049YQVHE", "B00E37JODK", "B001498LIO", "B0007MGG2M", "B008ABOJKS", "B004T9RR4A"], "buy_after_viewing": ["B001UI4RTG", "B004H1PMJC", "B00A3YN0Z0", "B006QB1RPY"]}}