{"asin": "B0035WTVWI", "categories": [["Electronics", "Camera & Photo", "Underwater Photography", "Cameras"]], "description": "The FinePix XP10 is the first in a new category of super-tough, 'Four-Proof' digital cameras - waterproof, freezeproof, shockproof and dustproof.  Resulting from a redesign of Fujifilm's best-selling FinePix Z33WP, the FinePix XP10 is an ergonomically \"life proof\" camera housed in a metal uni-body chassis with a tactile grip finish.The FinePix XP10 sports a 12-megapixel CCD sensor, a 2.7-inch, high-contrast LCD for better viewing in bright sunlight and a high-precision, Fujinon 5x periscopic optical zoom lens with a reinforced protective lens barrier.  The FinePix XP10 is only 21.7mm thin, and retains the chiselled design of a conventional compact camera.FinePix XP10 HighlightsThe XP10 is waterproof, drop-proof, freezeproof, and dustproof.Four-Way ProtectionThe FinePix XP10 is the ultimate lifestyle camera.  You can drop it, soak it, freeze it, and even cover it in dirt, and this camera will come out unscathed.  Not only is the FinePix XP10 waterproof up to 10 feet, but it is also shockproof up to 3 feet, freezeproof up to 14&deg;F and dustproof, giving you total confidence that they can take it with them wherever they go, whatever they are doing, regardless of the conditions.Easy Web UploadNow a key consideration for the younger web-savvy generations, the FinePix XP10 features a new Facebook/YouTube Automatic Web Upload function that makes it much faster to post photos on social networking sites.  While in playback mode, this feature allows users to 'mark' a picture for Facebook or You Tube upload.  Then, once the FinePix XP10 is connected to a computer with Fujifilm's MyFinePix Studio software (included), users upload their images and videos and the marked pictures and videos will automatically transfer to the selected site.HD CapabilityThe FinePix XP10 also offers stunning movies in 720p with sound and high quality stills with one touch ease.  Many consumers are happy to enjoy HD movies on their PC, but with the new HD Player (optional extra), which comes equipped with a remote control, families can gather around their home HDTV to enjoy amazingly detailed stills and high resolution movie playback.Target FocusCreated specifically to capture an action shot, the Target Focus function tracks fast moving subjects so they don't escape from the frame in a blur.  Subjects will be tracked automatically for as long as it is kept in the frame and the shutter is half-pressed; when users fully press the shutter button your subject will be in the centre of the photo in perfect focus.Edit movie clips in-camera.Additional FeaturesMovie Editing Mode and Blog mode: Get creative and add finishing touches to videos and images, among others, you can choose from B&amp;W, Sepia, or you can even add a dynamic lighting effect, all this in-camera.Scene Recognition Auto (SR AUTO): This mode intelligently identifies the scene type and necessary shooting conditions to optimize picture perfect potential.Face Detection and Automatic Red-eye Removal: To provide perfectly exposed and focused portrait shots, the FinePix XP10 is fitted with Fujifilm's latest Face Detection technology which is able to track up to 10 faces simultaneously, at almost any angle to the camera. The system instantly corrects red-eye and then saves both the original and the corrected image file automatically.Digital Image Stabilization: Reduces image blur and offers creative adaptability and excellent picture quality.Li-ion rechargeable battery: The long-life rechargeable Li-ion battery (up to 200 shots) allows for extended use without worrying if the camera is going to last for the duration of the trip.Digital image Stabilization in action.", "title": "Fujifilm FinePix XP10 12 MP Waterproof Digital Camera with 5x Optical Zoom and 2.7-Inch LCD (Silver)", "price": 199.99, "salesRank": {"Camera &amp; Photo": 6239}, "imUrl": "http://ecx.images-amazon.com/images/I/41FG57FJU7L._SX300_.jpg", "related": {"also_viewed": ["B008NC0K4I", "B001QENO6Q", "B006T7QTNK", "B00ATM1NBO", "B00ATM1M9W", "B00ATM1M92", "B00ATM1MF6", "B00B18L7KC", "B004V9SRPG", "B00HGE3CZS", "B0073HSJGU", "B00HGE3D2K", "B0073HSJLA", "B00HGE7MPO", "B007W6WI6Y", "B0073HSJOC", "B001R23JO4", "B004FLL5C2", "B0081VI3GI", "B004FLL5BS", "B004FLL5CC", "B008DRA18I", "B004XNFHJY", "B004SB1X44", "B008VUZXQC", "B004SB1X4Y", "B004XNFHKI", "B00IA9LTTY", "B00ATE7U64", "B00IA9LTBW", "B00BW3ZR48", "B008099VAS", "B004SB1X4E", "B001R23JNU", "B004SB1X80", "B00ATE7UFU", "B00ATE7TQA", "B00B7N9ABY", "B004XNFHOY", "B00B7N9A5A", "B004SB1X58", "B005GSYPWA", "B00AQ2BVTQ", "B006T7QVLU", "B00728ZC1U", "B00BQX5MDA", "B004JSP8A6", "B00ATE7TYC", "B00B7N9AY6", "B006T7QXTU", "B003P9VMXC", "B004JSP92I", "B00AQ2BV0A", "B006T7QYZS"], "bought_together": ["B003D3DRA6", "B000OF2F36"], "buy_after_viewing": ["B003VNKNEQ", "B003D8O264", "B003D8OSV8", "B003VNKNF0"]}}