{"asin": "B00006IBV7", "categories": [["Office Products", "Office & School Supplies", "Paper", "Cards & Card Stock", "Business Cards"]], "description": "Premium, Professional QualityPaper thin cards with jagged, perforated edges? Just because you print your cards yourself doesn&rsquo;t mean they have to look homemade! Avery&rsquo;s unique, patented Clean Edge&reg; technology enables these business cards to snap apart from the sheet, leaving completely smooth, non-perforated edges... just like professionally printed cards. Plus, they are made from thick, stiff cardstock, so they are durable and also feel like premium cards.&nbsp; And you can print vivid color graphics and sharp text on both sides.Free, Easy to Use TemplatesAvery&rsquo;s Design &amp; Print Online tool (www.avery.com/print) contains thousands of free pre-designed templates that are easy to customize. It&rsquo;s completely Internet-based, so there is no software to download and is compatible with both PC and Mac&reg; operating systems. You can easily import your own images, graphics or logos, and can save your projects on your computer for easy editing and reprinting.Why Should I Print My Own Business Cards?&bull;&nbsp;&nbsp;&nbsp;No Minimum Order Quantities.&nbsp; Print as many or as few cards as you need, when you need them.&nbsp; So, if you only need 20 cards, then just print 20 cards (instead of having to order 500 from a printer).&bull;&nbsp;&nbsp;&nbsp;Customizable.&nbsp; Because you can print as few as 10 cards at a time, you can change your business cards as often you&rsquo;d like.&nbsp; For example, you might want to feature a &ldquo;product of the month&rdquo; on the back of your card.&nbsp; Or maybe you want to promote upcoming events or advertise time sensitive promotions.&nbsp; And how often have you had to throw away a box of business cards because your phone # or e-mail address changed or you were given a new title?&nbsp; What a waste!&bull;&nbsp;&nbsp;&nbsp;Available Right Away.&nbsp; Uh oh... you just realized you ran out of business cards as you&rsquo;re packing for a business trip or preparing for a big meeting tomorrow.&nbsp; Not to worry.&nbsp; You don&rsquo;t have to wait days or weeks for a printer to print and ship your cards or pay a huge fee for expedited shipping.&nbsp; Just print off a few sheets of business cards and your problem is solved in minutes.&bull;&nbsp;&nbsp;&nbsp;Affordable.&nbsp; In most cases, if you need less than 500 cards at a time, it&rsquo;s cheaper to print your own cards than to order them online or from a printer&sup1;.&nbsp; Online printers may lure you in with an attractive offer, but then they often charge extra fees for backside printing, color printing, uploading your logo, proofing, better cardstock, different colors, textures or finishes, etc.&nbsp; Do the math--figure out the cost per card after all these fees are added.&nbsp; Then compare to Avery&rsquo;s Clean Edge&reg; Business Cards, which cost only about 8 cents per card1 and Avery&rsquo;s on-line design tool with thousands of pre-designed templates is FREE!Great Ways to Use Avery Clean Edge&reg; Business CardsAvery Clean Edge&reg; Business Cards are printable on both sides, so be sure to take advantage of the back side of the card.Promotional Tool for Small BusinessesGrow your business by using your business card as a promotional tool. Put your logo, location and contact information on the front of the card and use the back side to:&bull;&nbsp;&nbsp;&nbsp; Showcase a list of products or services&bull;&nbsp;&nbsp;&nbsp; Feature a new product or service&bull;&nbsp;&nbsp;&nbsp; Promote an upcoming event&bull;&nbsp;&nbsp;&nbsp; Give out a coupon with a discount off the next visit&bull;&nbsp;&nbsp;&nbsp; Run a \"frequent shopper\" program (for ex, the 10th sandwich is free)&bull;&nbsp;&nbsp;&nbsp; Use as an appointment reminder card&bull;&nbsp;&nbsp;&nbsp; List several locations&bull;&nbsp;&nbsp;&nbsp; Include a map or directions&bull;&nbsp;&nbsp;&nbsp; Translate the front of your card into another language (bilingual cards)&bull;&nbsp;&nbsp;&nbsp; Include a calendar, a tip rate chart or other useful info so customers will want to keep your card handyPromotional Tool for RealtorsBecause you can print as few as 10 cards at a time, realtors can create targeted, marketing materials &hellip;customized for every open house, every property for sale, every neighborhood or every client.&nbsp; Use the back side of the card to:&bull;&nbsp;&nbsp;&nbsp; Feature current listings, including pictures of the home, key features, listing price, etc.&bull;&nbsp;&nbsp;&nbsp; Advertise open houses, including date, time, map, directions, etc.&bull;&nbsp;&nbsp;&nbsp; List recent neighborhood sales&bull;&nbsp;&nbsp;&nbsp; Include an interest rate tableYou could even create a customized card for each home you are selling and provide a stack to the home owner to distribute for you.Networking Tool for Job SeekersLooking for a job?&nbsp; Let your business card sell you!&nbsp; Create your own personal business cards to promote yourself at career fairs, networking events, social gatherings, job interviews or any situation where it&rsquo;s not appropriate or convenient to hand out a full page resume.&nbsp; Just put your name and contact info on the front of the card and use the back side to:&bull;&nbsp;&nbsp;&nbsp; Highlight your experience, like a mini resume card&bull;&nbsp;&nbsp;&nbsp; Indicate your area of expertise&bull;&nbsp;&nbsp;&nbsp; Summarize your unique skills and abilities&bull;&nbsp;&nbsp;&nbsp; List your credentials, degrees, training or certifications&bull;&nbsp;&nbsp;&nbsp; Outline your career objective&bull;&nbsp;&nbsp;&nbsp; Communicate a personal positioning statementAnd because you can print as few as 10 cards at a time, you can tailor your business cards for specific industries, job opportunities or networking situations, so you can create multiple versions of your business card, just like you do with your resume.Other Creative Uses&bull;&nbsp;&nbsp;&nbsp; Gift Tags&bull;&nbsp;&nbsp;&nbsp; Merchandise or Price Tags&bull;&nbsp;&nbsp;&nbsp; Coupons&bull;&nbsp;&nbsp;&nbsp; Appointment Reminder Cards&bull;&nbsp;&nbsp;&nbsp; Raffle Tickets&bull;&nbsp;&nbsp;&nbsp; Wallet Calendars&bull;&nbsp;&nbsp;&nbsp; Contact List Cards&bull;&nbsp;&nbsp;&nbsp; Flashcards&bull;&nbsp;&nbsp;&nbsp; Mini recipe cards&sup1;Based on cost of two-sided, full color, white&nbsp; matte business cards at several online/commercial printers.&nbsp; Costs are as of April 2009 and include printer shipping charges. Avery&reg; Clean Edge&reg; business card costs do not include the cost of ink or toner.", "title": "Avery Two-Side Printable Clean Edge Business Cards for Inkjet Printers, Matte, White, Pack of 200 (08871)", "price": 10.53, "imUrl": "http://ecx.images-amazon.com/images/I/51W5NODyXjL._SY300_.jpg", "brand": "Avery", "related": {"also_bought": ["B001602ZT2", "B00009KIYH", "B004I01M2I", "B002LGEY7Q", "B00004Z63V", "B001E6BCSI", "B00007B8VL", "B009M3UUQA", "B00004Z5TW", "B00004Z5SB", "B00004Z5SM", "B00008XPHB", "B00006B8G7", "B0007LTI8C", "B000GRB6UA", "B00DV1N44O", "B00004TS5X", "B000GAU9M8", "B00004Z5T0", "B00006HPWA", "B0010JEJPC", "B00BB9OZH8", "B001BBCGC2", "B003R2RW4K", "B00139YKH6", "B0006HXLMG", "B00006B8G6", "B00345RZK6", "B0006HV3GC", "B00006IDRW", "B0000C0CJA", "B00004Z5QO", "B003UYLVJC", "B005IMAO2E", "B00006IBV3", "B002HJ9OJK", "B001PMC4TW", "B0013CE9S8", "B00DGY5IP4", "B00007LVE0", "B000BKZ7YI", "B0006HV36C", "B00006HQU9", "B0017TGMCI", "B00007M5L9", "B00I155MXG", "B00BB5DJU6", "B00DSYED3U", "B0058M2YLS", "B00007LVDM", "B0052C1NNY", "B00005QT7U", "B000PU1LIU", "B006P1EQXA", "B000ANLD1M", "B008FKRYMO", "B005IMAODI", "B000083E4Z", "B004TTXA50", "B001E667U6", "B0013N2QU0", "B004AMH3UE", "B000ANJW1U", "B00006IC89", "B009LIOOPO", "B000078CQ7", "B00006IFHD", "B002Q0YD28", "B001TOD3NM", "B0012YVGOW", "B0014WJYOG", "B001W0Y5US", "B0024KGE72", "B000N4C1LO", "B00316WHMO", "B0006VZAZS", "B004TTVV0G", "B0020X9SZS", "B0069RY9BY", "B00BGN8PLG", "B000J0C47S", "B000J09IH2", "B009WLX83Y", "B003ZZS5IG", "B00KZLE30W", "B005IMAKYG", "B004X2WXA6", "B0038NHBBM", "B008BW41EK", "B000H5OKOU", "B00AIUL40C", "B001GAOTSW", "B000EFJGWY", "B000083E4G", "B004INKGYA", "B00006IFKU", "B00B51367M", "B0006HXSTC", "B005IMARNA", "B00006IC8I"], "also_viewed": ["B00004Z5TW", "B00005QT7U", "B00006IBV3", "B000BIVXLG", "B00009KIYH", "B00006B8G6", "B004I01M2I", "B00006HQU9", "B0058TXME4", "B00008XPHB", "B00004Z63P", "B00004Z5TU", "B0013CLN2S", "B002GPHKUU", "B000UAMKBM", "B001E6BCSI", "B001TQFLZS", "B0021451LQ", "B001PMGBQE", "B00466H6X8", "B00008BOV5", "B00497KWN0", "B0013CE9S8", "B0025WIC3S", "B000GAU9M8", "B00006HPWA", "B007IKQ6TO", "B00IZL26QW", "B000UAMKS0", "B000SB7P7W", "B007INWAVY", "B003D1YJ8C", "B006KCL9ZC", "B00006B8G7", "B001ALMYL6", "B001602ZT2", "B0000C0CJA", "B002JFWQQ0", "B000C1TXPK", "B00007LVDF", "B0006HV3GC", "B00345RZK6", "B005D9C538", "B00004Z63V", "B006KCL7U4", "B00139YKH6", "B0007OWVJC", "B002V083EM", "B002PNLX10", "B00006IC8I", "B00G07D95K", "B0096XYZ7Q", "B005IMAODI", "B002LGEY7Q", "B00007B8VL", "B00004Z5SM", "B0002BQR2C", "B0049PWRPS", "B00007E7CV", "B007ON5WXG"]}}