{"asin": "B00008J7NZ", "description": "Halo 2is one of those rare video games that garnishes attention from regular folk who wouldn't know which direction to point a game controller. With more than 1.5 million pre-orders and a massive release party in Times Square, the game enjoys the sort of buzz, and sales, generally reserved for boy wizards. But does it merit the hype?Opening SceneHalo 2opens with a cut scene in the Covenant Holy City of High Charity. Much has happened since Master Chief (that's you) created so much havoc for the Covenant in the firstHalo, and the Arbiter has much atoning to do for his failures. This first cut scene is long, but the lush graphics, orchestral sound, and polished voice talent for both this and other cut scenes as well as the game itself put most animated television shows to shame.Much has happened since Master Chief created so much havoc for the Covenant in the firstHalo, and the Arbiter has much atoning to do.In the end, though,Halo 2is unabashedly a first-person shooter. It has a Mature rating and is not meant for kids. Gameplay is constant and intense. No sooner is one bunch of aliens taken care of than another descends. The controls are identical to the first game so those familiar with it will be up and blasting in no time. And the sound and graphics have been beefed up so thatHalo 2is undoubtedly one of the most beautiful console games available.Opening FireMost of the weapons from the first game return, although strangely the MA5B Assault Rifle (the default weapon in the first game) is not available. There is a single melee weapon known as the Covenant Sword, but the controls for it are the same as that for all the shooter weapons, making it difficult to direct. Also, for a new twist, you can hold two of the smaller guns at the same time and shoot double-fisted.As for vehicles, the old favorites are back and joined by a few new, mostly Covenant wheeled monsters. Some improvements have been made to the AI so that the nonplayer characters can drive without running into too many obstacles while you man the turret. This improved AI also has enemies ducking for cover, and the banter from both the Marines and the bad guys has undergone massive improvements so that it no longer sounds quite so repetitive.On Your OwnThe most significant change in the single-player game is with Master Chief's much-touted defensive suit. At the beginning of the game, he is told that the suit has been upgraded, but it's really undergone a severe downgrade. InHalo 2, the player has only one lifeline. Unlike in the first game, there is basically no defensive shield on the suit, making gameplay tougher. It can often take multiple--sometimes a maddening number--attempts to make it through thorny parts of the game.Or with a FriendFinally, no review of aHalogame is complete without mentioning multiplayer. One of the main reasons to buyHalo 2is the ability to play through Xbox Live, a feature not included in the first game, which was among the original releases for the Xbox. Multiplayer forHalo 2uses all of the same weapons and vehicles as in the single-player game, and the types of games available inHalo(King of the Hill, Slayer, Capture the Flag) return with a host of new maps. MultiplayerHalo 2offers customizable profiles, control layout, and screens as well as a voice proximity feature, where you can talk with other players via an Xbox Communicator so that those closer to you sound louder than those farther away. Players can also create both permanent clans and temporary parties in the Xbox Live world. Undoubtedly, this multiplayer feature alone ensures thatHalo 2will remain a top-selling game for years to come.--David MorelPros:Lush graphics and orchestral soundConstant, thumping shoot-'em-up actionMultiplayer available through Xbox liveCons:Suit downgrade makes single-player often overly difficultGet ready for some bleary-eyed mornings", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51oqrB3-qHL._SY300_.jpg", "related": {"also_bought": ["B00005NZ1G", "B0050SYY5E", "B000FRU0NU", "B000930DA0", "B001HWB68K", "B002BSA20M", "B0050SYX8W", "B00GV8QTPU", "B0034JKYO6", "B001ELWMHI", "B0002A2S26", "B0000C6EDL", "B0000C7GH4", "B006ZQ85YG", "B0001DI6FM", "B006ZQBLTW", "B000B2YR74", "B0000C6EDM", "B000HVDEQO", "B000K8YAKI", "B00BQMGW4Y", "B0016CQ0Q4", "B00FKV8AK6", "B0017HW5LM", "B0009O7HUI", "B002K8Y23G", "B00005NZ1I", "B00129I75I", "B0002SQ0BS", "B006HPLKK6", "B0054OGCS6", "B00020BV0Q", "B00009W5WB", "B000I7GI8I", "B0006SST9U", "B000G82DDS", "B00269QLI8", "B0000A082T", "B00006409Z", "B00006JZQZ", "B00005R6YX", "B0001UEHP8", "B000F2JUOK", "B0010AYJXI", "B00020BV1A", "B0062E3YU6", "B002Q21X7Y", "B0016B28Y8", "B0002B90SA", "B00770KPTW", "0761544739", "B004GWW0H4", "B002I0H79C", "B00006C28W", "B000FDMV9U", "B00770KR7W", "B00005OWBL", "B000067DPM", "B001I020CW", "B0006BK5AI", "B0001I9YE4", "B00019AZA0", "B0007ZD79E", "B003ZSP0WW", "B002B5FQC4", "B001TOQ8J8", "B003JVKHEQ", "B000PE0HBS", "B001AWIP68", "B00354NAYG", "B002I0JDC6", "B003IT6E8C", "B0007SL202", "B000RHZ9JI", "B0050SWVIQ", "B000HCQK0A", "B00D9EPI38", "B000E61G4O", "B0028IBTL6", "B000087R8F", "B008E6ZXRM", "B00KSQHX1K", "B00EVWZHLK", "B00009TW6R", "B00DBCAT3W", "B0030HIULQ", "B00656HLGO", "B001G3AZS2", "B000R0URCE", "B00HVOOB6M", "B000P46NMK", "B003L8HQ7S", "B002I098JE", "B007LQG9A6", "B004FSE52C", "B007XVTR3K", "B00CX9T598", "B004YVOCYG", "B00503E8S2", "B00FATRKOK"], "bought_together": ["B0050SYY5E"], "buy_after_viewing": ["B000FRU0NU", "B002BSA20M", "B0050SYX8W", "B00005NZ1G"]}, "salesRank": {"Video Games": 285}, "categories": [["Video Games", "More Systems", "Xbox", "Games"]]}