{"asin": "B000R2XJJK", "description": "Reinvigorating the role-playing genre with a fresh and modern approach,The Witchercombines unrivalled story and character development in an original, vibrant world with tactically-deep real-time combat and a challenging view of good and evil that will intrigue RPG players of all levels.Hunt with Geralt, the White WolfHe's not your average monster-hunting mercenary.View larger.He'll pit blade against beast.View larger.Or go mano v. mana.View larger.Explore an elegant and inventive combat system.View larger.Based on the \"Witcher Saga\" of books and short stories by Polish author Andrzej Sapkowski and built utilizing the powerfulNeverwinter Nightsengine,The Witcherimmerses players in a beautifully vivid, but harsh fantasy world in the role of a Geralt, an adept and feared monster-slayer-for-hire. Brutally trained from birth to be a cold-hearted assassin whose services are available to the highest bidder, yet troubled by a past he can&#146;t entirely remember, Geralt is a classic anti-hero. To this most renowned of witchers, a society of mutants born with superhuman strength and reflexes and trained at a high level in magic and alchemy, killing has been and seemingly should remain a strictly commercial affair, but as questions about his past come to the fore, so do doubts surrounding the morality of his trade. And these doubts only grow when bits of his past are revealed as he and you grow in power and acclaim through the progression of the game.The Thin Line Between Good and EvilFar from a common black and white treatment of good and evil, the moral attitudes defining the world ofThe Witcherare as close to that of our own prevalent real world view as you are likely to see in a modern RPG. Set in a time dominated by vanity, greed and prejudice, there is no lack of work for Geralt as the kingdoms of the North forsake old alliances and give in to endless intrigue and purges instead of facing a growing tide of evil. But as despicable as the monsters, non-human enemies and pure human trash you are hired to eliminate may seem and may very well be, pity, mercy and good faith are nearly always a possible option to deadly force and one that can change Geralt&#146;s overall destiny. It&#146;s this kernel of reality in a universe peopled with fantastic and sometimes frightening beings and creatures against a backdrop of morally challenging scenarios that will keep players coming back for more as they explore the varying consequences of Geralt&#146;s choices and the choices forced upon him.Character DevelopmentA witcher's destiny is preordained at birth, but your goal is to determine Geralt's specific path. Hidden withinThe Witcherare a startling 250 in-game skills and abilities that allow you to define and in many cases plan the evolution of Geralt&#146;s character. Will he rely mainly on his skill with a blade? Develop into an arcane battle mage? Transform into a potent alchemist? Or meld all these skills into a more complicated, but potentially unbeatable combo of all three? Give some thought to your path, but know it will not always be an easy or thoughtful one. Filled with non-linear decision-making opportunities and consequences, expect to be forced into quick decisions, choices between the lesser of two evils and to invariably be stuck with the consequences of your employer&#146;s short-sighted plans for your services. It&#146;s these consequences that will determine your progression through the game&#146;s storyline and lead to the availability of different skills and abilities.Stunning Real-time CombatPossessing superior strength, speed and agility makes Geralt quick to draw his blade when conflict arises, but this birthright is not always the right skill to rely on and depending on the enemy, can prove disastrous. To survive in this world of varied threats you will need to put aside the button mashing common to other RPGs and utilizeThe Witcher&#146;s complex yet intuitive combat- based fighting system. You will learn quickly to switch seamlessly between the game&#146;s six combat styles, dozens of potions, complex alchemy and magic systems and weapons modification mode, using your mouse alone or mouse with keyboard, to add tactical depth to your combat experience. Once you have mastered these, you will also have time to appreciate the ground-breaking fluidity of the game&#146;s 600 in-game combat animations, based on actual medieval sword-fighting techniques and performed by experts at Frankfurt&#146;s renowned Metric Minds Studio.It&#146;s only through a combined focus on Geralt&#146;s physical and mental capabilities that you can hope to survive the viciously violent world he inhabits and unlock both his true potential as a warrior as well as the secrets hidden in his past.Complete Game Features:Geralt of Rivia: a one-of-a-kind protagonistA charismatic and unique character, Geralt is a mutant swordmaster and professional monster slayer.Choose from over 250 special abilities correlated to attributes, combat skills and magical powers to build the character in a way best suited to tactical needs and style of play.Original fantasy world drawn from literatureInspired by the writings of renowned Polish author Andrzej Sapkowski.Featuring adult themes, less fairy-tale than typical fantasy, with mature social issues like racism, political intrigue and genocide.It is a harsh world where nothing is black or white, right or wrong, often forcing players to choose between the lesser of two evils to advance.Non-linear and captivating storylineFull of turns, twists and ambiguous moral decisions which have real impact on the storyline.All quests can be accomplished in several ways and the game has three different endings depending on the player&#146;s actions and choices throughout the adventure.Visually stunning tactical actionEngage in complex yet intuitive real-time combat based on real medieval sword-fighting techniques.Motion capture performed by medieval fighting experts at Frankfurt&#146;s renowned Metric Minds studio, resulting in 600 spectacular and authentic in-game combat animations.Six combat styles, dozens of potions, complex alchemy system, modifiable weapons and powerful magic add tactical depth to the fluid real-time experience.", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/51HIJfgHNWL._SY300_.jpg", "related": {"also_bought": ["B003VJNPPE", "B006P5RW3M", "B001AH8YSW", "B001B5U80K", "B001IK1BWC", "B0045ZB66I", "B000A76ZNO", "B0000CNUUP", "B0047THYWC", "B001VJ4DHK", "B00ICWO1XA", "B000WCCURW", "B0019C4MU2", "B002V1GFHS", "B005G4CXPK", "0316029181", "B0000A1VER", "B00006IR62", "B002SU4QG4", "B003FSFSEW", "B002I0HKRQ", "B00002EPZ2", "B003336KG4", "B0044S8DA8", "B006GHA8EE", "B003BU77P2", "B000SKWLLI", "B003P9C6EQ", "B005EZ5GQO", "B00140P9BA", "B004FYKWZU", "B005XFGZ4W", "0307894622", "0316219134", "B000PS2XDO", "B005OGYVKU", "B001CWXAP2", "B0050SZ980", "B004D8QAAO", "B000FGA1US", "B0016G88RO", "B001E8QA2E", "B002BXKJA0", "B00004KHB7", "B002V14VOC", "B0029E1VGC", "B001DF1AM8", "B001Q96ZNU", "B003VJP92Q", "B003ICGL7I", "B001C6Q8QG", "B0001XM2HU", "B004H80TUC", "B002BS47YE", "B00CPKUV9I", "B002I0J5YW", "B005UI8V6C", "B002I0KOLA", "B0007GBBHI", "B005C2D2H4", "B0002BQN7Q", "B008UE8ICK", "B001CXGC6A", "B00009MGVF", "B000EEDY6O"], "bought_together": ["B003VJNPPE", "B001AH8YSW"], "buy_after_viewing": ["B001AH8YSW", "B006P5RW3M", "B003VJNPPE", "B006GHA8EE"]}, "salesRank": {"Video Games": 5921}, "categories": [["Video Games", "PC", "Games"]]}