{"asin": "B001V9LPT4", "description": "Image S4 Headphones: Pro-Grade Sound at a Reasonable PriceTune out the external environment and tune into your own private concert experience anytime, anywhere with the Image S4. These noise-isolating in-ear headphones deliver dynamic sound and unequaled comfort for a price that&rsquo;s easy on the wallet. The enhanced bass and superior noise isolation ensure clean, professional sound, while the innovative eartip design and angled nozzles provide a comfortable fit for long-term wear. Strain-relief cord design makes the Image S4 as perfect for the gym as it is for the street.Above and Beyond ExpectationsThese reasonably priced, high-performance earphones go above and beyond what you&rsquo;d expect from the stock earbuds that come with your MP3 player or music phone. In fact, you&rsquo;ll find Klipsch headphones are far superior to other brands&mdash;delivering unequaled comfort, noise isolation, musical accuracy and bass. Furthermore, Klipsch has managed to take its decades of research and development experience to value engineer the Image S4, while staying true to its audiophile heritage.Amazing Comfort and FitMade just for you, the Image S4&rsquo;s exclusive soft and flexible oval ear tips naturally fit the contours of your ear canals, providing comfortable long-term wear as well as producing a perfect acoustic seal. A good seal minimizes outside noise, also known as noise isolation, and allows you to enjoy your music at lower, safer volumes.These headphones come with three different sizes of washable ear tips: a small/medium dual flange design as well as medium and large single flange designs. So light and narrow, they are almost impossible to feel inside your ears.Premium SoundAt the heart of every Klipsch product is over 60 years of audio expertise beating strong. Our commitment to no-compromise performance has made us the preferred choice of top cinema operators, a leader in stereo and home theater sound and now a premium name in headphones.The Image S4 delivers strikingly realistic sound through the use of a single, moving coil driver per channel. These drivers cover a wide frequency range with dynamic detail. From heart-pounding bass to spine-tingling guitar riffs, you won&rsquo;t miss a beat.Added FrillsAvailable in a beautiful piano black and silver finish, the Image S4 makes quite a fashion statement. It carries a two-year manufacturer's warranty and works with the iPod, iPhone, or any other portable device that features a standard 3.5mm headphone jack. A compact, crush-resistant aluminum case is also included in the purchase.What Critics Are Saying About Klipsch Image S4 EarphonesHands down, these are the most comfortable in-ear headphones I've ever used! They do have very nice bass response and mid-range as well. These are a huge improvement over any earbuds included with an iPod or other MP3 type player...they are a good value and I don't hesitate to recommend them.\"--Jay Siegel, examiner.com [April 28, 2009]", "title": "Klipsch IMAGE S4 In-Ear Enhanced Bass Noise-Isolating Headphones (Black)", "price": 106.99, "imUrl": "http://ecx.images-amazon.com/images/I/41e0W6whpcL._SY300_.jpg", "related": {"also_bought": ["B002NX7M9O", "B00F4LEULU", "B00304AADU", "B008X9Q0JK", "B007CSRJN4", "B005ZNHOW4", "B00F4KQLNQ", "B00264GYMG", "B00304BX1S", "B001EZYMF4", "B003JBYUEY", "B000WAHFBK", "B00F4KQ352", "B002ODIE54", "B00F4KX6CU", "B003U9VWGO", "B0043M9ATI", "B007P0LA4S", "B008X8HZZO", "B003XU6H8I", "B008VHHYLW", "B00452TDSY", "B002O3W3Y2", "B004PNZFZ8", "B000QSNYGI"], "bought_together": ["B002NX7M9O", "B00304AADU"], "buy_after_viewing": ["B008X9Q0JK", "B001EZYMF4", "B008X8HZZO", "B00264GYMG"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]]}