{"asin": "B0016BFZBQ", "description": "The JBL On Stage Micro portable docking sound system is the perfect travel partner for your iPod. Imagine the convenience of taking the JBL On Stage Micro system on the road or enjoying the sound anywhere you happen to be. Connected to your iPod, MP3 player, computer, or other music source, it produces clean, powerful sound. It charges your iPod and also provides a USB pass-through to connect to your computer. With the JBL On Stage Micro system's IR remote control, you have all the power with your digital music experience.Enjoy your iPod, view photos or videos, and listen to virtually any other auxiliary audio component, all through the JBL On Stage Micro system.Provides a rich, complete soundstage over a wide range of listening positions.Navigate your music, watch your slideshows, and find and play your videos.Which Dock Is for You?JBL's been in the iPod dock business for awhile, so it's no surprise that the company has crafted enough models to keep up with an ever-increasing army of iPod owners. Which one is right for you? Well, that depends what kind of pod person you are:For the Power HungryFor those who seek more volume, theOn Stage 400IDshould be your first stop. At 2x15 Watts, it's the loudest and largest of the bunch, and features an Atlas woofer for added bass. But size isn't everything--theOn Stage Microboasts the same wattage rating without the woofer.For the Weekend WarriorsThose who need a dock that they can take anywhere should investigate docks that can be powered by batteries. TheOn Stage Microruns on four AAAs, whereas theOn Stage IIIPandOn Stage IIIrun on six. Take your music to the beach, on camping trips--wherever you can't bear to be without it.For the iPhone TechiesThe iPhone owner--if you can stand to put the thing down--has a couple choices. TheOn Stage IIIPprovides a smaller and more portable option, or theOn Stage 200IDgives a bit more power. These two docks support all docking iPod models as well.For the Featurephiles or Heavy SleepersSome of us just aren't content with basic functionality; we need more buttons, more lights. Others just need a little nudge to wake up in the morning. If this is you, then the On Time200IDand400IHDare for you. Both feature an alarm clock and AM/FM radio, with the ability to wake up to your favorite song stored on your iPod (and then reject it with the snooze button). Of course, for the masochists, a classic buzzer is also available. TheOn Time 400IHDadds a dual alarm clock and HD radio to the mix, for a crystal-clear signal and a variety of text-based information (artist name, song title, weather alerts, school closings, etc.) scrolled across your screen.Something for EveryoneAll of these models feature a remote control for full iPod navigation, Evercharge topology to charge iPod even when not connected to a PC or the system is turned off, a mini-jack for auxiliary devices, and the sleek design and solid performance you'd expect from JBL.CompatibilityThe JBL On Stage Micro system is compatible with all docking versions of the iPod, including the nano, photo, and video iPod. A stereo mini jack connection also allows you to enjoy high-quality audio from a variety of other devices, such as MP3 and CD players, desktop computers (all platforms), satellite radio, and laptops. Specific dockable iPod compatibility: iPod mini 1G; iPod nano 1G, 2G, 3G; iPod 3G, 4G, 5G, 5.5G, 6G; iPod touch.Easy-to-Use Music and Navigation ControlsJust a touch of the music controls increases or decreases the volume. Using the navigation controls, you can browse iPod songs, photos, and playlists; change tracks and settings; and much more. With the JBL On Stage Micro IR remote, you have complete control of your iPod, as if it were in your hand.Connection VersatilityThe JBL On Stage Micro loudspeaker dock is a multimedia focal point. Enjoy your iPod, view photos or videos, and listen to virtually any other auxiliary audio component, all through the JBL On Stage Micro system. Connect the USB cable to your computer for full iPod and iTunes compatibility.Additional FeaturesIR remote--The JBL On Stage Micro IR remote has several modes of operation. The Music mode allows you to control the volume, change tracks, fast forward, and fast reverse. The iPod Navigation mode allows you to navigate the iPod menus just as if you were touching the iPod itself. You can navigate your music, watch your slideshows, and find and play your videos.OnePoint design--The OnePoint iPod connectors provide the connection to your computer. Connect the USB cable to the rear of the unit; then, every time you dock your iPod, you will have a connection for synchronizing and charging.Evercharge topology--The JBL On Stage Micro system provides power to charge your iPod, even when not connected to the computer or if the system is off.Advanced TechnologyThe JBL On Stage Micro loudspeaker dock combines many proprietary technologies to provide the highest quality sound, astonishing bass, and clear and accurate sound from any direction.Odyssey transducers--The Odyssey drivers provide accurate high frequencies while capable of low-frequency extension of four octaves, unlike traditional powered tweeters. This design provides a full, rich frequency response from low bass to the highest highs.Slipstream port design--The JBL On Stage Micro port minimizes boundary layer separation, providing high-output bass with low distortion.COE (Computer-Optimized Equalization)--The JBL On Stage Micro system equalization is computer-optimized to provide a rich, complete soundstage over a range of listening positions.OCT (Optimized Compression Topology)--The system utilizes a proprietary compression technology to ensure clean, accurate sound at high output levels.AEMS (Advanced Energy Management System)--The JBL On Stage Micro system has an automatic battery-saving shutoff. The AEMS will automatically put the system into sleep mode when there is no audio input. The system awakens with just a touch and resumes at the same volume level.Battery-powered--The JBL On Stage Micro loudspeaker dock is designed to use most types of AAA batteries. Four fresh AAA batteries allow up to 24 hours of continuous play at normal listening levels. An amber LED flashes when the battery protection circuit senses that the batteries are low. JBL encourages the use of rechargeable reduce waste and help the environment.What's in the BoxJBL On Stage Micro Portable Speaker Dock for iPod (Silver), remote control, auxiliary audio input cable", "title": "JBL On Stage Micro Portable Speaker Dock for iPod (Silver)", "price": 59.2, "imUrl": "http://ecx.images-amazon.com/images/I/41pMhcEqg8L._SX300_.jpg", "related": {"buy_after_viewing": ["B003BIFJOA", "B0017XMN7C", "B0016BQS12", "B003VANOI6"]}, "categories": [["Electronics", "Portable Audio & Video"]]}