{"asin": "B000OVPB9K", "related": {"also_viewed": ["B00HFW1E1A", "B006ZW4HY2", "B000OVPBA4", "B002DSHMA8", "B000I5JMYW", "B00HFW1E6K", "B006ZW4H4C", "B005756GYM", "B006ZW4HWY", "B006ZW4IVE", "B004M8SSZK", "B006ZW4HA6", "B00BOXNSRY", "B003VWXWTK", "B004SO876S", "B00HFW1E2Y", "B00HFW1FUK", "B000NPKO4E", "B001DDUV20", "B00BOXN91O", "B000NM8DI6", "B00J580L8E", "B007G0WFVY", "B003VWU14E", "B004S561V0", "B002JTX87W", "B001DDT42I", "B0072YREEM", "B000I3C6CE", "B003XEC0I0", "B00HFW1DWK", "B00387E5BM", "B003TPT05O", "B000MVBHRW", "B0090XX0MS", "B00020M1T6", "B008VJ9BUW", "B001O1UE7S", "B00BQ7WRAC", "B00CH5U24A", "B006ZW4HAQ", "B00COF74E4", "B00007KJWO", "B00755UGEI", "B004T9R3TE", "B0083SHQEE", "B004M8ST2W", "B007T3IQ5C", "B0013NYB5S", "B000A2EXI8", "B0009Y7IK2", "B004M8SU0I", "B0058LK8V2", "B000VDNC9M", "B00387E5AS", "B00BXKOGS8", "B000EHUK3Q"], "bought_together": ["B000GU88CQ"], "buy_after_viewing": ["B000MYPPPE", "B006ZW4HY2", "B00HFW1E1A", "B008VJ9BUW"]}, "title": "Olympus VN-4100PC Digital Voice Recorder", "price": 220.0, "salesRank": {"Electronics": 37611}, "imUrl": "http://ecx.images-amazon.com/images/I/41tA3p2rgHL._SY300_.jpg", "brand": "Olympus", "categories": [["Electronics", "Portable Audio & Video", "Digital Voice Recorders"]], "description": "Record over 144 hours of uninterrupted audio on the Olympus VN-4100-PC 256MB PC Digital Voice Recorder and then transfer the audio files to your PC with speed and ease with the included USB PC Link. With one simple cable connection, files can be transferred to a computer for easy organization, playback, and emailing to friends and coworkers. The easy-to-use thumb pad allows for quick and convenient navigation of functions like file management, choosing recording modes, and more while the included timer recoding and voice activation modes provide added versatility. Depending on the quality of the desired recording, the VN-4100PC is able to record in four recording modes to meet your specific needs: XHQ for extra high quality, HQ for high-quality, and SP and LP modes for extended recording. Just above the easy-to-use thumb pad, users will find a large LCD screen for easy, quick viewing of file locations, recording status, and battery life. The thumb pad also allows you to control the slow and fast playback modes, allowing you to listen to audio playback at 25-percent slower or 50-percent faster than real time. The unit's storage capacity is divided into four folders, and each folder can store up to 100 files. Easy file management functions allow you to erase single files, multiple files, as well as transfer files between folders. An on-board voice activation feature extends recording time by recording only when the microphone senses sound while the easy-to-use index marks let you specify a particular point in a recording or playback for easy reference. Use the timer recording option to set a start and end time for a particular recording. Measuring 4.0 x 1.5 x 0.8 inches, the VN-4100PC weighs only 2.2 ounces.What's in the BoxVN-4100PC digital voice recorder, Digital Wave Player software, USB cable, two AAA alkaline batteries, and instruction manual."}