{"asin": "B0006VJ7TI", "related": {"also_bought": ["B0006VJ7TS", "B0026MF17C", "B002E9HJ18", "B001Q9TTE2", "B003WQMYN0", "B009EA04PI", "B001ET73GU", "B000068P8W"], "bought_together": ["B0026MF17C"], "buy_after_viewing": ["B0006VJ7TS", "B009EA04PI", "B002E9HJ18", "B0023WU6OI"]}, "title": "Monster AI ICLN-S iClean+ ScreenClean", "price": 15.68, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41cpAV%2B1O2L._SY300_.jpg", "brand": "Monster", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Cleaning & Repair", "Lens Cleaners"]], "description": "Family Size iClean: 200mlTravel Size iClean: 45mlSee MoreEnhance the brilliance of your display.Your computer monitors, laptop displays and portable electronics screens for your camcorder, digital camera and iPod&#153; were designed to produce great graphics at high resolutions. iClean protects the integrity of that vision. Use the iClean solution and special MicroFiber&#8482; cloth to gently polish your electronic displays without scratching them.On DisplayiClean's liquid gel stays where you spray it.Unlike ordinary glass cleaners, iClean won't drip into delicate electronics. Plus the iClean solution contains a special polymer to protect your display, while reducing static electricity that attracts dust.Handle with CareClean your displays safely.iClean's alcohol-free, ammonia-free formula cleans your displays without damaging its protective coating. It removes dust, dirt, fingerprints and more, so your displays can be as clear and bright as possible.iClean for All Your DisplaysFrom PowerBook to iMac to iPod.With the iClean large cleaning pack, you get a large bottle of iClean and two special MicroFiber&#8482; cloths, so you can keep all the electronic displays in your home and office free from dust, stains and streaks.With the iClean travel pack, you get two small bottles of iClean and special MicroFiber&#8482; cloth, so all your portable electronic displays can stay free of dust, stains and streaks.Use iclean and see what you've been missing.Caution: Keep away from children. To prevent potential damage, be sure iClean is compatible with your product/display before using. If the product you are cleaning requires soap and water only, do not use iClean."}