{"asin": "B000065UDU", "description": "This preprogrammed learning remote control is designed to simplify your entertainment experience. The brightly backlit LCD view screen actually has 26 individual pages for operating up to 10 audio and/or video components. The component buttons are strategically placed around the LCD view screen and can be renamed, according to the actual components that your audio or video system may include.The MX-500 is ergonomically designed and weight balanced to fit comfortably in one hand. The brightly backlit LCD view screen and buttons make navigation within a darkened home theater environment a breeze. To further enhance the navigation of the remote control, the MX-500 has incorporated a multi-directional joystick.The MX-500 Punch Through feature enables control of one component while the remote is actually in another component mode. For example, you can adjust the volume of the amplifier while actually in the DVD mode, eliminating the need to toggle back-and-forth from the DVD screen to the amplifier screen.The macro feature allows the remote control to be programmed to send out multiple commands at once. The unit has 3 dedicated macro buttons, a \"Power\" button and a \"System Off\" button that send out up to 20 commands each. For example, the MX-500 can be programmed to turn on all the components within the home theater system at just the touch of a button!The MX-500 also incorporates a memory back-up system designed to prevent memory loss for up to one year, should the batteries be removed.", "title": "Universal Remote Control MX-500 10-Device LCD Viewscreen Remote Control with Joystick Operation (Discontinued by Manufacturer)", "price": 67.99, "imUrl": "http://ecx.images-amazon.com/images/I/11QSPMG3KXL.jpg", "related": {"also_viewed": ["B004OVECU0", "B000FL9E6K", "B001KC08A4", "B004UKRRD4", "B001KC08AE", "B0007N5XPW", "B001HKLA60", "B000FL9E6U", "B0007PCB6O", "B000FL5OIW", "B005FO43OU", "B003UVVGHW", "B002N1J7DU", "B002IC0YLS", "B003JSLP54", "B007FIPSXE", "B00008UVAE", "B00385XUG0", "B001M5U5AC", "B00093IIRA", "B003DNS88W", "B009EIUH6G", "B00BQ5RY1G", "B000VAXSFS", "B00IAKLM54", "B00BQ5RYI4", "B00J7KM5X4", "B004U605FK", "B000F7JCRA", "B00385XUFQ", "B004HB2X3U", "B0002TU25M", "B003IZFCFW", "B0003QER82", "B000P0QD6U", "B002GR1YZ0", "B0008FPTR6", "B002IC0YL8", "B000C1Z0HA", "B00I54C0GA", "B00468G6PU", "B002LARYGA", "B00AJHE7QC", "B007TAMIAO", "B000W0WHRC", "B00067R5Y6"], "buy_after_viewing": ["B004OVECU0", "B000FL9E6K", "B001KC08A4", "B004UKRRD4"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Remote Controls", "TV Remote Controls"]]}