{"asin": "B004ZAZMKE", "description": "Bear Motion has once again brought you the best case for Motorola Xoom Tablet.This case is made of 100% real cowhigh leather. It is specially designed to offer full protection for your beloved Xoom tablet.All ports, cameras and buttons are accessible while the tablet is in the case. Taking pictures and video chatting with your friend becomes so much easier with built in stand. It even offers a 30 degree angle for easy typing.Must have for Xoom owners.Two reasons to buy Bear Motion:Reason No. 1: Rigorous and relentless quality controlOne might think that anybody can make these cases that have nothing special in design. While this is true, nobody other than Bear Motion can deliver the quality consistently to every end user. We actually test every single case with a real Xoom. It might sound crazy, but that is why we can guarantee the quality.Reason No. 2: Best material guaranteedWe only use the best. Never compromise quality for any reasons.That being said, all the cases are handmade and defects are still possible even under our rigorous quality control. If one or two of the defective ones happened to slip through our fingers and get into your hands, please contact us immediately. We guarantee you a good solution in timely manner.", "title": "Bear Motion &reg; 100% Real Leather Case for For Motorola Xoom 10.1 inch tablet (3G &amp; 4G WI-FI 16 GB 32 GB 64 GB) - Xoom Case Google Android 3.0 Honeycomb Black (NOT Compatible with XOOM Family and XOOM 2)", "price": 7.99, "imUrl": "http://ecx.images-amazon.com/images/I/51UPlwSC7yL._SY300_.jpg", "related": {"also_bought": ["B00513HAEA", "B0045FM6SU", "B004M8RWCU", "B004QISZX6", "B004M8RWDE", "B005EC0HXE", "B004M8RWDO", "B004M8RWD4", "B00652CYPG", "B00462QTA8", "B004M8RWB6", "B00513H3D8", "B004M8RWCK", "B004L9MBH6", "B006LPRXJE", "B004QS84UU", "1118088352", "B004ZHWGCO", "B00576STJ6", "B004XMW96Y", "B004P551BE", "B0051LKGD4", "B0064VNC1S", "B005LFXBKA", "B0064VNCFY", "B004NQHMZ8"], "buy_after_viewing": ["B004M8RWCK", "B004QISZX6", "B004XMW96Y", "B0051LKGD4"]}, "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Cases & Sleeves", "Cases"]]}