{"asin": "B0012OGF6Q", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]], "description": "Are you looking for a real digital SLR that&#x92;s easy to use? Do you want mobility without sacrificing capability? Would you like simple operation and enough features to step forward creatively? If so, then get to know the Nikon D60. Now you can experience the best of both worlds: enjoy one-button simplicity with Auto, or try many exciting levels of creative control. There is room for everyone to explore the thrill and magic of photography. Have fun, and don&#x92;t worry -- it&#x92;s a Nikon.Built on 90 years of optical expertise and decades of award-winning camera designs, the Nikon family of cameras covers every type of picture-taker -- from seasoned professionals to travelers on vacation. The D60 is the latest example of Nikon innovation, transforming complex technology into a fun, powerful and easy-to-use camera. Nikon delivers the cutting-edge technologies you would expect from a digital SLR -- fast response, creative versatility, and breathtaking image quality -- while eliminating complications and frustrations so that taking pictures is enjoyable and stress-free. With 10.2 megapixels, the D60&#x92;s image sensor delivers high-resolution pictures with rich, faithful color and detail that are ready for stunning enlargements. It also gives you the freedom to crop pictures exactly as you want them. And with Nikon&#x92;s 3D Color Matrix Metering II, you can expect beautifully exposed pictures under almost any lighting condition, with Nikon&#x92;s original digital image processing concept, EXPEED, comprehensively optimizing your pictures, shot after shot.Nikon D60 Digital SLR HighlightsNikon Integrated Dust Reduction SystemDust in front of your camera sensor can mean distracting spots on your pictures. That&#x92;s why Nikon does everything to ensure clear pictures, including minimizing the build-up and appearance of dust. Nikon&#x92;s exclusive Airflow Control System is one of the two main protections against dust. It leads air within the mirror box towards small ducts near the base, preventing internal dust from settling in front of the image sensor. The D60&#x92;s second form of defense is the Imaging Sensor Cleaning function, which was originally built for the D300. Every time you turn the camera on or off, this function uses vibrations to steer dust away from the optical low-pass filter in front of the sensor (deactivation and manual activation are also possible). Nikon engineers have also dealt with dust and other tiny particles in many other ways to prevent such image degrading material from attaching to the filter or being seen by the sensor when you are taking pictures. With all these measures in place, you can concentrate on getting the shot while exploring the wide array of Nikkor interchangeable lenses that a Nikon digital SLR opens up to you.Rich, Smooth Detail with Active D-LightingSometimes, even a perfectly exposed scene will not render an ideal photograph. With difficult lighting conditions, important details can be lost in the highlights and shadows. But with Nikon&#x92;s Active D-Lighting, the D60 can correct these exposure issues instantly and automatically, while you shoot. Simply set Active D-Lighting before you start shooting. Active D-Lighting is available when \"Matrix\" is selected for metering.Eye SensorThe Eye Sensor activates every time you look through the viewfinder, turning off the information display on the LCD for comfortable shooting.Compact, Light and ComfortableThe D60 is compact, light and ready to go wherever life takes you. The D60&#x92;s size is not the only factor to consider; its shape is ergonomically designed to fit in your hand naturally and comfortably. Nikon&#x92;s experienced engineers know that operating a camera shouldn&#x92;t distract you. That&#x92;s why each button and texture on the camera&#x92;s exterior has been carefully considered for the most efficient and fluid operation possible.The D60&#x92;s bright, clear optical viewfinder is also designed with the user in mind, its helpful indicators and intuitive icons helping you achieve ideal composition with the optimal settings.Nikon&#x92;s Intelligent Built-in Flash -- Simply BrilliantProper flash lighting used to require skill, time and patience. With the D60, however, flash photography is simple, instant and accurate. Thanks to Nikon&#x92;s cutting-edge i-TTL flash technology, all the complicated calculations happen automatically, giving you balanced flash illumination under almost any conditions, even difficult lighting situations such as backlit subjects. With Auto mode, you just point, shoot and let the camera do the rest. It&#x92;s that simple.Display Format OptionsThe information display in the 2.5-inch LCD monitor lets you check essential camera information quickly and easily. Choose whatever display format fits your taste best: each of the Graphic and Classic formats have three color variations to suit your preferences, while Wallpaper uses one of your own pictures as the background. Graphic format uses visual displays to show shutter speed and aperture, as well as the mode dial every time you turn it to a new setting. The D60 even recognizes whether you are holding the camera horizontally or vertically, and then automatically displays camera information on the LCD monitor accordingly.Intuitive Menu NavigationThe D60 lets you alter settings and functions in many ways. For all the choices it offers, the menu is still amazingly simple and intuitive, with navigation made easy thanks to a carefully considered design. If you are ever unsure about a specific feature or function, simply press the O button for detailed information. It&#x92;s like having an onboard instructor to answer your questions. The D60&#x92;s convenient assist images help you select appropriate camera settings. These useful reference images help explain the effect that each function has on your photos -- very helpful for exploring new features and making the most of the camera.Creative shooting is just a quick turn awayWith the D60, you will always be prepared to shoot a wide variety of subject matter. Just turn the mode dial to fit your shooting situation and beautiful results are yours instantly.Quick responses, captured momentsAmazing moments can pass by quickly, but the D60&#x92;s fast 0.19-second startup, split-second shooting time lag and fast, accurate autofocus capture more of these moments with precision. The camera&#x92;s high-speed continuous shooting also helps capture fast-moving action at up to 3 pictures per second for as many as 100 (JPEG) pictures.A wide variety of in-camera Retouch MenusEven after a picture is taken, the D60 offers ways to explore your creativity further. With a wide range of options to choose from, the quick, simple and extensive Retouch Menu allows you to create a duplicate image with amazing photo effects, leaving the original picture intact. And it&#x92;s all done in-camera -- without the need for a computer.The right touch -- Quick RetouchSometimes you want to make sure that your picture has the best balance of contrast and saturation. For this, choose the Quick Retouch feature. It creates an automatically retouched copy that has been optimized for better-looking pictures.Original animation -- Stop-motion MovieWant more fun out of digital photography? Try making a stop-motion movie from a series of consecutive pictures. Simply select the first and last frames from a sequence of shots. You can easily re-edit before saving it as a movie by changing the starting image or removing specific images. There are also several size and frame rates to choose from.Expect much more from your pictures -- In-camera NEF (RAW) ProcessingNikon&#x92;s NEF (RAW) format lets you enjoy an incredible amount of creative freedom and control over camera settings -- even after the actual shot is taken. If time is tight or you are unsure of which setting to use, it&#x92;s even possible to shoot first with NEF (RAW) and make adjustments later. That&#x92;s right: you can take pictures, and then change the image quality, image size, white balance or even exposure compensation. All operations are quick, simple and do not require a computer.Explore further -- Filter EffectsThe D60&#x92;s Filter Effects let you experiment with color and light. Each of the Red/Green/Blue Intensifier effects let you enhance the color of your choice. Try the Cross Screen feature to create starbursts radiating from scene highlights. For other options, use Color Balance to modify the entire image, or experiment with Skylight and Warm Filters.Supplied AccessoriesStrap, Body Cap, Eyepiece Cap, USB Cable, Quick Charger (MH-23)w/ AC adapter, Rechargeable Li-ion Battery (EN-EL9), Accessory shoe cover, Lens cap, Software CD-Rom, Quick Start Guide, Instruction Manual, Warranty and Registration card", "title": "Nikon D60 DSLR Camera with 18-55mm f/3.5-5.6G AF-S Nikkor Zoom Lens", "brand": "Nikon", "salesRank": {"Camera &amp; Photo": 3701}, "imUrl": "http://ecx.images-amazon.com/images/I/510E-icDlcL._SX300_.jpg", "related": {"also_bought": ["B000KJQ1DG", "0470385383", "B002VSM7LE", "B001ET5U92", "B000NG67E4", "B003HMMAUG", "B000NOEDGK", "B001YQ74FI", "B000LWJ1ES", "B000ZMCILW", "B000O161X0", "B008JRXH92", "B003E6YED6", "0470383127", "B000BY52NK", "B002JCSV5I", "B00006I5J7", "B0049I48JI", "B0009HN57Y", "B000KLZGGW", "1598635778", "B0042X9LC4", "B0012X43P2", "B000HGIWN4", "B001ENOZY4", "B004DEKH84", "B004JMZPJG", "B001T9N120", "B003ZSHNCC", "B002P9HXMW", "B000O19JF2"], "bought_together": ["B000KJQ1DG"], "buy_after_viewing": ["B000NG67E4", "B003VNKNF0", "B007M51J3I", "B002JCSV5I"]}}