{"asin": "B000VJRU44", "description": "The active-play phenomenon started byWii Sportsnow spreads to your whole body thanks toWii Fitand the pressure-sensitive Wii Balance Board, which comes bundled with it. Used together players will experience an extensive array of fun, dynamic and surprisingly challenging activities, including aerobics, yoga, muscle stretches and balance oriented games. The focus of these activities is towards providing a \"core\" workout, a popular exercise method that emphasizes slower, controlled motions, but it's the fun approach to fitness ofWii Fitthat will keep players hooked on fitness for years to come.Have fun while you get fitThe Wii Balance Board.View larger.Calculate your BMI and Wii Fit age.View larger.Enjoy a wide variety of mini-games.View larger.Follow your own personal trainer.View larger.Track your progress against friends.View larger.TheWii FitBalance BoardThe primary tenet ofWii Fitis balance. Your center of balance, the point between your left and right sides when you stand upright, has a lot to do with your health. Those without an even center of balance will be unnaturally compensating for this imbalance, which causes their posture to become misaligned, increasing the possibility of putting unnecessary strain on their bodies. This is where the Wii Balance Board comes in.Similar in appearance to a step aerobics board, the Wii Balance Board is much, much more. Easily capable of supporting weights up to a maximum of 300 pounds, it is sturdy and precise, able to measure weight and register pressure accurately when placed on a variety of flat surfaces. This advanced level of sensitivity allows for both the wide range of activities found in theWii Fitsoftware as well as the board's amazing ability recognize individual players by their weight alone.Getting Started: Create a ProfileBefore you jump into doing exercises and activities, you&#146;ll start by creating a profile. This is done easily and intuitively by simply choosing a Mii, entering your height and age information, and doing a few quick tests that will serve as a baseline for your new Wii fitness regimen. These tests are:BMI Check: BMI, or Body Mass Index, is a measure of body fat based on height and weight that is the standard used by agencies such as the World Health Organization and the National Institute of Health. To check your BMI, you&#146;ll enter your height then stand on the Wii Balance Board and let it read your weight.Wii Fit Age: After you&#146;ve checked your BMI, you&#146;ll do a basic balance test and find out your currentWii FitAge. This basic balance test measures how well you can control your left and right balance. Based on the results, you&#146;ll be assigned a Wii Fit Age.Four Categories of FunOnce you have created your profile it's time to have some fun.Wii Fitfeatures four main categories of exercises to choose from: Strength Training, Aerobics, Yoga and Balance Games.Wii Fitwill guide you through the first three with the help of your own virtual personal trainer, while the balance games offer variety and fun to help keep you engaged and excited about your fitness goals. In addition, as you spend time exercising, you&#146;ll earnFitCredits that unlock additional exercises and activities within your favorite categories that will allow you to continue to push yourself. See more detail on the four categories below:Strength Training: Put your strength to the test with muscle-toning exercises like Single Leg Extension, Sideways Leg Lift, Arm and Leg Lift, Single-Arm Stand, Torso Twists, Rowing Squat, Single Leg Twist, Lunge, Push-Up and Side Plank, Jackknife, Plank and Tricep Extension. Challenges include Push-Up Challenge, Plank Challenge and Jackknife Challenge.Aerobics: Get your heart pumping with fun, interactive Aerobic exercises like Hula Hoop, Basic Step, Basic Run, Super Hula Hoop, Advanced Step, 2-P Run, Rhythm Boxing, Free Step and Free Run.Yoga: Work on your balance and flexibility with Yoga poses and activities like Deep Breathing, Half-Moon, Dance, Cobra, Bridge, Spinal Twist, Shoulder Stand, Warrior, Tree, Sun Salutation, Standing Knee, Palm Tree, Chair, Triangle and Downward-Facing Dog.Balance Games: Get into the action with fun, balanced-based games like Soccer Heading, Ski Slalom, Ski Jump, Table Tilt, Tightrope Walk, Balance Bubble, Penguin Slide, Snowboard Slalom and Lotus Focus.Keep Track of Your ProgressBecause keeping fit is an ongoing process,Wii Fitalso tracks the activities you do the most and puts them into your Favorites category. With this information players can note exercises and activities that they are strong in, as well as others that may need to improve at. Some of the ways players can use this information for are to:Keep tabs on your daily progress with easy-to-understand graphs and charts. Using your personal profile, you can set goals, view a graph of your BMI results over time, see how many Fit Credits you&#146;ve earned, check yourWii FitAge and even enter exercise time you&#146;ve done outside ofWii Fit. It&#146;s all about coming back and exercising a little every day, and the personal profile makes tracking your daily progress simple and easy.Quickly check yourWii Fit Ageand BMI without even putting the game in the console by going directly to theWii FitChannel.Allow up to eight family members can create their own profiles inWii Fit. On the profile-selection screen, everyone in the family can see each other&#146;s recent BMI progress and Fit Credit total. This will allow families to have a friendly competition to exercise and get fit.Variety, fun and progress tracking;Wii Fithas it all. So, Wii owners if you ready to reclaim your balance and get fit all you need isWii Fit, a few minutes a day to play and the urge to have fun. Get on board today.", "price": 7.99, "imUrl": "http://ecx.images-amazon.com/images/I/41ZeUHZBIsL._SX300_.jpg", "related": {"also_bought": ["B002BS47JE", "B001EXKSTU", "B001AWPOXK", "B002ECN43C", "B003C3WYSI", "B0009VXBAQ", "B0017Q4DGI", "B0024MNOGE", "B002EWD040", "B002BUSVJO", "B0013E9HP6", "B001KX504C", "B009M72E5Q", "B003OZZJGS", "B002BSA3EM", "B00FF9MLQW", "B002CSLY1W", "B001AMO1D4", "B003OQ4B1Q", "B0028IDSWE", "B001H0RZX2", "B002672Z80", "B001DW73NQ", "B002KJ9XE8", "B002MQLPJ0", "B004W1IX1G", "B0045F8QD4", "B002GEKIOG", "B001HT1CXM", "B004WLRR4K", "B003S2OO7W", "B002D2Y3IS", "B0035DN7JK", "B003JZASVE", "B004U4C25S", "B001MBUGLY", "B000W5Y49G", "B002CZ7P04", "B003WTWJUK", "B0056C2LIG", "B002YJ0U3W", "B00634MLMW", "B0028IDSYW", "B001B1W3KM", "B002MWSY3O", "B0018RWMRS", "B004IK24MU", "B003TK1HSM", "B003LDKIQ4", "B0013OL0BK", "B003O6C0V4", "B003EGULF6", "B0019N57M8", "B006AN894U", "B00AFYAUYW", "B003S2JI6O", "B0056WJA1W", "B003R5THKO", "B003H3CBW2", "B0024MJ8XC", "B008BERGYU", "B001PO2BJI", "B003JKK3PA", "B003VC8TUM", "B0094X28J0", "B0015ZQFTY", "B000IMWK2G", "B002E0S6K0", "B001D21F58", "B000QD7BBM", "B001DDBBSS", "B001GIUWX0", "B004Y6DPQM", "B001COQW14", "B0057PERGQ", "B003E86NL0", "B003Q5J4NU", "B001A1PLOS", "B004N3FGHC", "B003EH0BQ4", "B00F2ENJY8", "B002OL1KEI", "B005IGPY48", "B0030U1YYS", "B002CZ835U", "B002NNNL1W", "B004ZWPBWG", "B0056FOHVW", "B0056FOILG", "0761556478", "B0094X227I", "B004VFO4X4", "B0042VV5DY", "B001TOQ8K2", "B0088I6JEW", "0307465934", "B0028ZNWWS"], "buy_after_viewing": ["B002BSA3EM", "B002BS47JE", "B00FE8WKPQ", "B001EXKSTU"]}, "salesRank": {"Video Games": 1755}, "categories": [["Video Games", "Kids & Family", "Wii"], ["Video Games", "Wii", "Games"]]}