{"asin": "B002NEG0VO", "description": "The compact Altec Lansing iML237 Orbit USB is small in size but big on sound, giving you great out loud audio for your laptop or netbook wherever you need it. Weighing less than six ounces, this mighty little USB speaker boasts Altec Lansing's Audio Alignment technology, which is the precise balance and craftsmanship of the key audio components -- the driver, the enclosure and the electronics. The result is rich, full sound in a small system. This tough, ultra-portable Orbit USB is powered by your USB port so you never have to worry about finding an outlet to plug it in or carrying around batteries.The iML 237 Orbit USBAt a Glance:Full, rich sound for laptops and netbooks.Ultraportable - built tough and lightweight.Plug-and-play USB connectivity for convenience and digital clarity.Built-in retractable stand.Storage case with hook-on carabiner.1. Plug-and-play for great sound anywhere.2. The USB cable winds neatly away.3. A built-in stand lets you aim the sound.4. Carrying case included.(Click on each feature for an expanded view.)Ideal for Entertainment and PresentationsThe Orbit USB is ideal for those who rely on their laptops for much of their entertainment.  College students, for example, may find that the built-in laptop speakers are not powerful enough for their music and movies, or maybe even a recorded class lecture. The Orbit USB can be tossed in a backpack to provide powerful, instant sound at any time. Also, business people can enhance their presentations with board-room filling sound from the Orbit USB, which is small enough to pack in a briefcase. And then they can listen to music in their hotel rooms at night.Plug-and-Play for Great SoundEnjoying great sound has never been easier; just plug the Orbit USB into your computer and start listening. Since the audio maintains a pure digital signal through the USB connection from the source to the speaker, you won't have any fuzz or muffle. And thanks to Audio Alignment technology, all the components are perfectly balanced for sound with great volume, clarity, and depth.No Batteries or AC AdapterSince the Orbit USB is powered by USB, there is no need to worry about running out of batteries or finding an AC outlet. In addition, the USB cord winds and stores neatly away in the compartment underneath. And the Orbit USB's battery-free design offers an environmentally responsible solution.Ultra-Portable Round Design Provides 360-Degree SoundJust by looking at the Orbit USB, you'll know it's something special. With aluminum and composite construction, the Orbit USB is built to survive tough travel conditions. It includes a stylish neoprene case with hook-on carabineer as well as tangle-free cord storage into the underbelly of the speaker for protection and convenience.The small, round design not only looks good but also provides a 360-degree sound field, so you'll enjoy full, distortion-free sound in every direction.  A built-in retractable stand lets you aim the sound in any direction and an LED lets you know when the speaker is on. The Altec Lansing iML237 Orbit USB comes with a handy carrying case with a clip making it easy to carry everywhere.What's in the BoxOrbit USB speaker and carrying case with carabiner.", "title": "Altec Lansing iML237USB ORBIT Ultra Portable USB-Powered Speaker", "price": 64.99, "imUrl": "http://ecx.images-amazon.com/images/I/41hzO%2BhUXUL._SY300_.jpg", "related": {"also_bought": ["B008Y5GHCI", "B0043ZWJHU", "B001ELK2NY", "B004CYKEBK", "B001TH7GUU", "B001TH7GV4"], "bought_together": ["B008Y5GHCI", "B004CYKEBK"], "buy_after_viewing": ["B0043ZWJHU", "B008Y5GHCI", "B004CYKEBK", "B001ELK2NY"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]]}