{"asin": "B001IK1BWC", "description": "From BioWare, the makers ofMass Effect,Star Wars: Knights of the Old Republic, andBaldur's GatecomesDragon Age: Origins. An epic tale of violence, lust, and betrayal,Dragon Age: Originsis a single player role-playing game (RPG) set in a fantasy game environment, and featuring three playable character classes, accessible in the form of three races. In addition, the game features extreme character customization, a new game engine, party-based gameplay utilizing non-player characters and a built-in personal history system for each hero character rooted in a variety of possible origin stories..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }6 possible hero Origin Stories.View larger.3 classes and 3 races to play as.View larger.Gritty, brutal action.View larger.Frightening enemies and bosses.View larger.Party-based combat using NPCs.View larger.Stunning 3D environments.View larger.StoryInDragon Age: Originsthe survival of humanity rests in the hands of those chosen by fate. You are a Grey Warden, one of the last of an ancient order of guardians who have defended the lands on the continent of Thedas throughout the centuries. Betrayed by a trusted general in a critical battle, you must hunt down the traitor and bring him to justice. As you fight your way towards the final confrontation with an evil nemesis, you will face monstrous foes and engage in epic quests to unite the disparate peoples of a world at war. A romance with a seductive shapeshifter may hold the key to victory, or she may be a dangerous diversion from the heart of your mission. To be a leader, you must make ruthless decisions and be willing to sacrifice your friends and loved ones for the greater good.GameplayDragon Age: Originsis a 3D oriented RPG based in a dark, heroic, fantasy realm where moral choices have a lasting impression on the people you meet, the members of your own party and the world around you. The inclusion of subtitle \"Origins\" in the game's title refers to the six unique origin stories available to new heroes as a new game begins. Each of these has an impact on the player's motivations and his or her experience, and renders a unique prelude, path, and possible ending(s) to the game. There are many different endings to the game based on the origin story of the character and the choices you make as you play through the game. The game features three character classes--warrior, mage, and rogue--and three races of being--Human, Elf or Dwarf--that can assume these classes. Although most game elements, such as weapons, magic, etc., are available to any character, each class and race has different strengths, abilities and affinities which lend themselves to better utilizing different elements.Dragon Age: Originsis a single player game based on party-based gameplay and combat where the player can join, control and quest with up to three non-player characters (NPCs). Players can also quest alone if they so choose, but with the chance of survival are slim. Convincing NPCs to join you, and treating them well may be necessary depending on the varying sentiments between the player and the NPC, or between the NPC's in the party based on the chosen history written into the origin story accepted at the beginning of the game. This uncertainty allows for a variety of possible dynamics within the party ranging from open hostility, all the way to romance. The game progresses in real-time via a pause-and-play tactical combat system that allows the player to check inventory levels, equip a character, etc. in a slight vacuum. Additional features found in the game include: a combination of a standard loot system and a currency system based on gold silver and copper; advanced character customization functionality; the use of poison, traps and herbalism; dual-wielding skills; and \"spell combos,\" which allow players to chain together different spells to create a unique effects.Key Game FeaturesBioWare&rsquo;s deepest universe to date with over 80 hours of gameplay and more than double the size and scope ofMass Effect.Travel throughout dozens of environments and fully immerse yourself in a shattered world that is on the brink of utter annihilation.An epic story that is completely shaped and reactive to your play style.Complex moral dilemmas offering no easy choices.Tailor yourDragon Age: Originsexperience from the very beginning by choose from six different origin stories.Decide how to handle complex issues like murder, genocide, betrayal, and the possession/sacrificing of children without the security of a good/bad slider to tell you what to do.Full character customization allowing the player to sculpt a hero in your own image or fantasy.Elaborate character creator allows you to create your own hero unique from anyone else.Shape your character&rsquo;s personality and morality based on the choices you make throughout the game.Engage in bone-crushing, visceral combat engaging in battle against massive and terrifying creatures.Unleash legendary powers and choose from over 100 different magical spells and skills.Experience the adrenaline rush of brutal combat, beheading your foes or casting spells that make enemies explode from within.System Requirements:MinimumRecommendedOS:Windows XP with SP3 / Vista with SP1CPU:XP: Intel Core 2(or equivalent) running at 1.4Ghz or greater AMD X2(or equivalent) running at 1.8Ghz or greater / Vista: Intel Core 2 (or equivalent) running at 1.6Ghz or greaterIntel Core 2 Quad 2.4Ghz Processor or equivalentRAM:XP: 1GB or more / 1.5GB or more2 GB (XP) / 4 GB (Vista)HDD:20GBVideo:XP: ATI Radeon X850 128MB or greater, NVIDIA GeForce 6600 GT 128MB or greater / Vista: ATI Radeon X1550 256MB or greater, NVIDIA GeForce 7600 GT 256MB or greaterATI 3850 512 MB or greater, NVIDIA 8800GTS 512 MB or greater, AMD Phenom II X3 Triple-Core 2.8 GHz or greaterOther:DVD-ROM drive for physical disc play; Mouse/keyboard/gamepad for gameplay", "price": 6.99, "imUrl": "http://ecx.images-amazon.com/images/I/51mCVgMobcL._SY300_.jpg", "related": {"also_bought": ["B003336KG4", "B0047THYWC", "B00140P9BA", "B001VJ4DHK", "B005G4CXPK", "B001B5U80K", "B004FYKWZU", "B001AH8YSW", "B002V1GFHS", "B0044S8DA8", "B002I0HKRQ", "B004HYIAPM", "B0015M0PYI", "B005OGYVKU", "B0045ZB66I", "B000R2XJJK", "B006P5RW3M", "B005EZ5GQO", "0761561420", "B002I0JJAW", "B0050SZ980", "B002BWONIU", "B003VJNPPE", "B000A76ZNO", "B0019C4MU2", "B000WCCURW", "B003GSZAOY", "B0016BVYAM", "B003TIVSM4", "B004H80TUC", "B002BXKJA0", "B003DNLDR0", "B0065NP39E", "B00006IR62", "B000FGA1US", "B002V14VOC", "B007TRXBJY", "B003L8DXS4", "B000G80MKO", "B00JUI8HJ4", "B003FSFSEW", "B001TOQ8R0", "B00BPANZ60", "B002I7KJ5O", "B00CJ7IUIQ", "B002NIP2SM", "B0079NGSDO", "B006O4YSJ0", "B002BS47YE", "B002I0IHIM", "B0050SZ836", "B001E2I4H4", "B001Q96ZNU", "B004FUGKSW", "B000MK694E", "B00005LABK", "B003P9C6EQ", "B0000CNUUP", "B001C4VU5C", "B003VM8HFE", "B002SU4QG4", "B004QEWVTO", "B001E8QA2E", "B003ZULWQI", "B003BU77P2", "B008IYCVK2", "B0012LGHZI", "B002LHSGSI", "B003ICGL7I", "B000FNA2QY", "B005UI8V6C", "0307468356", "B0042WXQ62", "0700099867", "B000NJFMUQ", "B002I0HJ68", "B005C2D2H4", "B00002EPZ2", "B002I0KOSI", "B0047TG2R0", "B000FGBVAC", "B003BJ09QM", "B000GRB4G6", "B0016N4A7E", "B00B70WKUK", "B001C6Q8QG", "B00E9I1FPI", "B001V9PTVE", "B0012N5EQE", "B00784HHUM", "B000UCK0LW", "B00BMFIXZG", "B004CD9X2W", "B00269QLJ2", "B000FHB8Q8", "B0013RC1W4", "B0016O5G26", "B004JQDJ8G"], "bought_together": ["B003336KG4", "B0047THYWC"], "buy_after_viewing": ["B0045ZB66I", "B0047THYWC", "B001VJ4DHK", "B002BWONIU"]}, "salesRank": {"Video Games": 7129}, "categories": [["Video Games", "PC"], ["Video Games", "PlayStation 3"], ["Video Games", "Xbox 360", "Games"]]}