{"asin": "B001NT9UHG", "description": "A great choice for students as well as business travelers who like to travel light, this affordable ultra-lightweight Acer Aspire One (AOA150-1505) weighs just over 2 pounds and is packed with a 160 GB hard drive and Windows XP operating system. It has a vibrant 8.9-inch CrystalBrite WSVGA LED backlit display, integrated webcam for easy video chatting, and Intel's latest mobile processor--the Atom. Offering a cool seashell white chassis, the netbook's smooth surface is comfortable to touch, and it's accented with distinctive details, such as the attractive orange hinge ring.A great choice for light-packing business travelers, it comes with Windows XP Home, a 160 GB hard drive, and a 6-cell battery for up to 5.5 hours of battery life.Weighing just 2.17 pounds, the stylish Acer Aspire One goes anywhere with you.Designed especially for mobile devices, the 1.6 GHz Intel Atom processor uses a brand new design structure new hafnium-infused circuitry, which reduces electrical current leakage in transistors to conserve energy and gives you more time away from the wall outlet--up to 5.5 hours with the included 6-cell battery. Other features include 1 GB of installed RAM (1.5 GB maximum), 54g Wi-Fi networking (802.11b/g), multi-format memory card reader, multiple USB ports, and built-in email, web browsing, and digital media applications.It comes preinstalled with the Microsoft Windows XP Home operating system, which offers more experienced users an enhanced and innovative experience that incorporates Windows Live features like Windows Live Messenger for instant messaging and Windows Live Mail for consolidated email accounts on your desktop.ProcessorThe Intel Atom processor uses a brand new design structure that packs in 47 million transistors into a single chip sized at just 22mm (0.87 inches), and it uses just 2.5 watts of power--less than 1/10 of the 35 watts used by an Intel Core 2 Duo processor--for excellent battery management. This 1.6 GHz Atom N270 processor also includes a power-optimized front side bus of 533 MHz for faster data transfer on demanding mobile applications and a 512 KB L2 cache (which temporarily stores data).StorageThis version of the Aspire One comes with a 160 GB hard disk drive (5400 RPM), which offers enough to room to hold a an extra-large digital audio library of and still have room left over for movies, games, and a large collection of software. This Serial ATA (SATA) hard drive also quickens the pace with a higher speed transfer of data--akin to Firewire and USB 2.0.MemoryThe 1 GB of installed RAM (512 MB onboard memory and one 512 MB DIMM, 533 MHz)  can be expanded to a maximum of 1.5 GB of RAM,DVD/CD DriveBecause of its size, the Aspire One does not come with an integrated optical drive, but optional CD/DVD read/write drives can be connected to the laptop via one of the three USB ports, enabling you to create your music mixes, burn movies to DVD, and more.ConnectivityThis Acer Aspire One notebook has an integrated 54g wireless LAN (Acer InviLink) that's compatible with 802.11b and 802.11g networks and offers Acer's SignalUp technology for enhanced antenna efficiency. It has has one dedicated SD memory card slot as well as a second multi-in-one card reader that's compatible with five different types of memory cards--Secure Digital, MultiMediaCard, Memory Stick, Memory Stick PRO and xD-Picture Card--for maximum flexibility. The ability to have both a multi-in-1 card reader and a SD card reader at the same time allows you to download photos from the multi-in-1 to share with others and store to the SD card as an internal storage device simultaneously. Here's the full list of ports and external connections:3 USB 2.0 ports for connecting a wide range of peripherals--from digital cameras to MP3 playersSecure Digital (SD) card reader, also compatible with MultiMedia cards (MMCs)Multi-in-one card reader supports SD, MMC, Memory Stick/Memory Stick PRO, and XD Picture Cards1 VGA monitor port1 headphone jack and 1 microphone jackRJ-45 port for 10/100 Fast Ethernet connection56K modem port (V.90)Screen, Video and AudioThe 8.9-inch screen has a WSVGA resolution (1024 x 600) and support for up a 262K color depth. Video is powered by the Intel Graphics Media Accelerator 950, which uses shared video memory with the main memory. Acer's CrystalBrite display technology guarantees the best possible visual experience by preventing the diffusion of surrounding light and internal ray. Compared to normal TFT LCDs, Acer CrystalBrite technology is able to read color coordinates more accurately, thus minimizing distortion and creating high-fidelity colors in all environments.This notebook includes an integrated audio card with Microsoft DirectSound compatibility, and it includes two stereo speakers.What's in the BoxThis package contains the Acer Aspire One notebook PC (AOA150-1505; LU.S040B.235), rechargeable 6-cell lithium-ion battery, AC adapter, and operating instructions. It is backed by a limited warranty for parts and labor for one year from date of purchase.", "title": "Acer Aspire One AOA150-1505 8.9-Inch Seashell White Netbook - 6.5 Hour Battery Life", "imUrl": "http://ecx.images-amazon.com/images/I/4145ebBPvlL._SX300_.jpg", "related": {"also_viewed": ["B00GZ1GV3I", "B00FNPD1VW", "B009LL9VDG"]}, "categories": [["Electronics", "Computers & Accessories"]]}