{"asin": "B001OC5JLI", "description": "Enjoy your digital life! Easily share and access photos, videos and music between your home computers with the Iomega Home Media Network Hard Drive. This device provides easy-to-use, yet powerful, network storage for the home user and the three step setup is a breeze, even if you&rsquo;ve never used a network drive before. Save all your digital files to one central location and share them between computers on your network. Then play back your pictures, videos and music from digital media adapters such as game consoles, digital picture frames or networked TVs. Built-in iTunes support automatically feeds music into iTunes for easy playback. Easily share one printer over the network, and control which family members have access to certain folders. Plus, secure your memories and backup automatically with award winning EMC Retrospect software (PC/Mac) and for extra protection backup online with MozyHome Online Backup service with 2GB free.The Iomega Home Media Network Hard Drive offers massive capacity and versitile backup features in an elegant, simple design.Network Multiple Computers in Your Home with the Iomega Home Media Network Hard DriveA Great Way to Network Multiple Computers in Your HomeEasily share and access photos, videos and music between your home computers with the Iomega &reg; Home Media Network Hard Drive, Gigabit Ethernet/USB 2.0. This device provides easy-to-use, powerful network storage for the home user, allowing you to save all your digital files to one central location and share them between computers on your network.Easy to Use, Secure, Fast and PowerfulWith a three step set-up, sharing your files has never been easier.  The Home Media Network Hard Drive uses a Gigabit Ethernet connection for fast performance.  And with EMC Retrospect HD software, your critical data is secure.Capacity: 500GB (1 SATA II HDD)Simple to use: Three step set up &ndash; simply plug into your router, power on, and install the software CD. Friendly web screens for easy managementHigh Performance: Gigabit Ethernet connectivity combined with a high performance processorUPnP AV Media Server: Compatible with DLNA certified media players, able to stream photos, audio content and videos to a variety of media devices like game consoles, audio bridges, DMA&rsquo;s, picture frames and moreiTunes Server: Store your audio content in one central location and share it across your iTunes playersExpandable: Add storage capacity by connecting external USB hard disk drives.  Supports FAT32 and NTFS formatted hard drivesData Protection: Touch-free professional-level backup for all your critical data with EMC Retrospect HD backup softwareWhat&rsquo;s in the BoxHome Media Network Hard DriveStandPower supplyQuick start guideSolution CD with system software, user manual and EMC Retrospect HD backup software", "title": "Iomega  Home Media 500 GB Network Attached Storage 34336", "imUrl": "http://ecx.images-amazon.com/images/I/51Gd4UTMuML._SY300_.jpg", "related": {"also_viewed": ["B00ARB5FPM", "B007KWLXRK", "B00G9X5N18", "B00EVVGAC6", "B0040NPGP2", "B00G9X5NFO", "B004UBU3SY", "B005TJLU24", "B00EVVGAFI", "B00439GMJ2", "B00AQRUW4Q", "B00EVVGAD0", "B007A2JNGS", "B003GALRIA", "B00597E938", "B00CRB9CK4"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "Network Attached Storage"]]}