{"asin": "B002BS47JE", "description": "Wii Fitattracted millions of new players to the world of video games. NowWii Fit Plusoffers a range of new features and enhancements to help players reinvigorate their workouts, along with exercises and balance games designed to keep them fun. Players will find a new dimension to theWii Fitexperience as they easily set their own customized workout routines, or choose 20-, 30- or 40-minute workouts based on how much time they have available..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }6 new yoga &amp; strength activities.View larger.The 'Perfect 10' balance game.View larger.Personalization options.View larger.'Obstacle Course' gameView larger.Target specific body areas.View larger.Users will also be able to choose from specialized workout routines that focus on all-around individual personal fitness goals or certain target areas. And with the addition of activities like Skateboarding and Rhythm Kung Fu, players will be using the Wii Balance Board accessory in a variety of new and fun ways.GameplayAs with the originalWii Fitrelease,Wii Fit Plusis designed, as its name implies, to improve the user's fitness. The game contains a large number of activities that fall into a variety of categories, including: yoga, aerobics, strength training and balance games. With all but a few exceptions, which utilize variations on a standard Wii Remote configuration, all activities utilize the Wii Balance Board (not included, but available with theWii Fit PlusBalance Board Bundle), either alone or configured with either a Wii Remote alone or the Wii Remote and nunchuck. The Balance Board, like any other Wii controller acts as a motion/pressure sensing device wirelessly synched to your Wii and replicating your body's movements. Each controller employed occupies one of the Wii's four wireless inputs, together mapping the reference points needed to recreate most full body motions on screen. Although this limits the majority of the activities to a single player orientation, various activities throughout the game support up to eight players in alternating play.To useWii Fit Plusplayers import their Miis from their Wii system, set up profiles, establish a current physical baseline, set fitness goals, and embark on a routine to reach them.Wii Fit Plustracks your usage, weight and progress towards your goal over time, giving you a status report as you start each session. At any time players can choose whatever activity they want, whether exercise or balance game, and as they progress in these they will level up in each, gaining points, setting high scores and unlocking more activities.Personalization Option Via 'The Locker Room'The originalWii Fitwas designed to have something for everyone. NowWii Fit Plusraises the bar by providing users with personalization options that allow them to find/create a specific workout routine that is exactly right for them, their family and their lifestyle. One example of this is \"The Locker Room.\" Easily accessible throughout the game, here players can choose from a number customizable options that allow them to maximize their time withWii Fit Pluswithout having to navigate through the game menu while in the middle of a workout. In essence this allows players to become their own personal trainer. Customization options available within The Locker Room include: preprogrammed and timedWii Fit PlusRoutines; My Routine, where you choose your own set of activities, optimizing their length and area of the body to be focused on; and Favorites, a notation of activities you frequent, which provides fast access to exercises you enjoy doing the most.Addition Yoga and Strength ExercisesDesigned as an addition to the already substantial list of focused, physical exercises available inWii Fit,Wii Fit Pluscontains six new and challenging strength and yoga activities. But continuing with the game's commitment to personalization, the key to these additions is not in their volume, but in how the player chooses to mix and match them. Do them in the order they are presented, or combine them in whatever order you want. The choice is yours. The player even has the ability to repeat the ones that he/she prefers, maximizing attention and effort where it is needed most. In addition, for those to whom time is a commodity, you can now omit unnecessary interludes between exercises, making for a continuous, timesaving routine.A Wealth of New Balance GamesRegardless of the considerable fitness factor packed intoWii Fit Plus, the Nintendo brand is and will always be all about having fun. With that in mindWii Fit Plusalso comes packed with 15 new, entertaining balance games suitable for every member of the family. Just a few of those that players can expect to see are: Juggling; Skateboarding; Snowball Fight; Obstacle Course, a log-leaping, cannonball-evading event reminiscent of what Nintendo icon Mario must go through; and Perfect 10, a balance game designed to promote a combination of physical and mental health. In this final example the player's Mii is situated between multiple color-coated balls, each showing specific numbers, with the goal to swing your hips, hula style, in different directions to tap out a total of ten as many times as possible before time runs out.Key Game FeaturesUsers can input the amount of time they want to spend on their workouts or select an area for personal improvement, andWii Fit Pluswill suggest a number of diverse activities for them.For the first time, users can mix and match which strength and yoga activities they prefer on a given day. The seamless exercise flows make it easier than ever for users to maintain their daily workout routines.Users might be asked to run an obstacle course across a series of platforms, zoom across a beach on a Segway x2 Personal Transporter or flap their arms to help their hilarious chicken-suited characters aim for targets.The range of games and customization options will make players want to play every day. They&rsquo;ll be having so much fun that their workouts will seem to fly by in no time at all.Players also can see estimates of calories burned and can even activate a feature that lets them weigh their dogs or cats.", "price": 43.96, "imUrl": "http://ecx.images-amazon.com/images/I/51nZj8RTdRL._SY300_.jpg", "related": {"also_bought": ["B001EXKSTU", "B0024MNOGE", "B003OZZJGS", "B002ECN43C", "B000VJRU44", "B002CSLY1W", "B001H0RZX2", "B001AWPOXK", "B002BSA3EM", "B002NNNL1W", "B001AMO1D4", "B002KJ9XE8", "B004W1IX1G", "B003JZASVE", "B0017Q4DGI", "B001KX504C", "B00FE8WKPQ", "B003O6C0V4", "B0035DN7JK", "B0013E9HP6", "B002EWD040", "B002CZ7P04", "B004WLRR4K", "B003H3CBW2", "B0015RTAZ8", "B0037ML994", "B003R5THKO", "B00AY0PR68", "B002BUSVJO", "B0056WJA1W", "B0019N57M8", "B0028IBYSO", "B003OQ4B1Q", "B0056C2LIG", "B0053BG26C", "B005IGPY48", "B0086V5TYC", "B00GRFZRP0", "B0009VXBAQ", "B001COQW14", "B002672Z80", "B00634MLMW", "B008BERGYU", "B000W5Y49G", "B00D7UHT0E", "B003S2OO7W", "B002EECSZ0", "B001MBUGLY", "B00HY0OP8C", "B003AG73MY", "B003VC8TUM", "B00166MPV4", "B004J30X4W", "B002K9VIAU", "B0094X221O", "B002GEKIOG", "B000QD7BBM", "B002MQLPJ0", "B0086V5UF0", "B003LDKIQ4", "B002OL1KEI", "B001GIUWX0", "B000RL8G1W", "B002D2Y3IS", "B009M72E5Q", "B00FE8WKMO", "B0050SVFWE", "B003TK1HSM", "B002BRZ9G0", "B003S2JI6O", "B0042VV5DY", "B001TOQ8NO", "B006AN894U", "B0094X28J0", "B0094X20IO", "B00E8RVP0U", "B0017HIIWW", "B003ZHMMEM", "B005EYG6EQ", "B00DJYK8XS", "B004M8K9AW", "B004IK24MU", "B0094X1ZXU", "B0081AWU4A", "B0094X227I", "B000FQ9QVI", "B00FF9MLQW", "B0013B30SY", "B005FYJA52", "B003DSAT0C", "B002MWSY3O", "B0087OYB38", "B006QRNKOO", "B004V13D0I"], "bought_together": ["B001EXKSTU", "B002ECN43C"], "buy_after_viewing": ["B002BSA3EM", "B002CSLY1W", "B001H0RZX2", "B00FE8WKPQ"]}, "salesRank": {"Video Games": 577}, "categories": [["Video Games", "Kids & Family", "Wii", "Games"], ["Video Games", "Wii", "Games"]]}