{"asin": "B00002STGN", "description": "Doom set the standard for first-person shooters when it hit PCs in 1993. Since then, we've seen versions for every system that could handle it, from Sony's PlayStation to Sega's ill-conceived 32X add-on, with varying results. While most would argue that Doom is finally dead, Midway is attempting to keep the series alive with its latest release, Doom 64 for the N64. While it's probably the best version to date, it pales in comparison to id Software's follow-up, Quake, which currently looms on the console horizon.Doom 64 picks up where all the other Doom games left off. After tearing through space, hell, and wherever else your Space Marine was sent, you thought that the threat of the demons was finally past. Of course, one survived, and it is currently reanimating all of the fallen monsters in a last-ditch attempt to revitalize their evil mission. Your task is to finally rid the universe of all the crazy hellions - from the dead guy with the pistol to the rocket-spewing Cyberdemon.Of all the changes made for the N64 version, the upgraded graphics are perhaps the most striking. There are new images and texture maps for every weapon, monster, and wall. Every character looks crisp and maintains his sharpness at close range - finally removing the pixelation that previous versions have suffered from. True lightsourcing has also been added, so colored lights and shadows permeate the game's 30-plus levels. The sound has also been tweaked and now boasts a few new death screams and a hauntingly ambient soundtrack. Thrown in (seemingly) as an afterthought is a new weapon, the laser, which proves to be next to useless and is nowhere near as cool as it's made out to be.The basic rules have been adjusted as well. Some changes are major - the switch system is no longer a \"flip once\" process - some are now used for multiple openings and must be returned to more than once. Several items teleport in now, making it much harder to find keys and other power-ups integral to completing the game. The minor changes, while not noticeable to everyone, will surely bother hard-core Doom fans. For instance, now that the engine is true 3-D, rooms can exist on top of each other - gone are the gratuitous staircases and ramps that dominated the original. It's almost as if the design team set out to make people re-think what Doom was capable of doing. While no one could argue that this is an unworthy ambition, if the team was prepared to make minor, annoying changes to the game, then why couldn't they throw in completely new features like jumping or the ability to look up and down. Better yet - why not just make an entirely new game instead? Play control remains the same in Doom 64 but seems somewhat restrictive when compared to that of the PC version. The analog stick enables you to force your Marine along at several different speeds - but it never feels quite right. In fact, this sense of being 'wrong' permeates the entire title. On paper, Doom 64 sounds better than the original could ever hope to be, but the end result feels more like a bastardization of the original.Uninitiated or casual Doom players may get a kick out of Doom 64 - the graphics are fairly impressive and the game still has a spooky atmosphere. But anyone who has downloaded custom WADs for the PC with new levels, graphics, and sounds has already seen greater things from the world of Doom. Sigh... yet another mediocre N64 game. --Jeff Gerstmann--Copyright &copy;1999 GameSpot Inc. All rights reserved. Reproduction  in whole or in part in any form or medium without express written permission of GameSpot is prohibited. GameSpot and the GameSpot logo are trademarks of GameSpot Inc.--GameSpot Review", "price": 414.97, "imUrl": "http://ecx.images-amazon.com/images/I/51vjZD1ZF3L._SX300_.jpg", "related": {"also_bought": ["B00000JQ0V", "B00002STGQ", "B00000DMB5", "B00002STGL", "B00000DMAT", "B00000F1GS", "B00002STFD", "B00002STFP", "B00000K2G7", "B00000ID61", "B00000DMB2", "B00000DMAX", "B00005M8TL", "B00000F1GM", "B00002DHEV", "B00002STEZ", "B00004UG9B", "B00000I1BE", "B0015OG4G4", "B000031KJT", "B00004S9AA", "B00004TJE5", "B000Y0CHX4", "B00004S9A7", "B00002STFN", "B00000JMWB", "B00000I1BB", "B00002STH5", "B000038A7C", "B000034DML", "B00000DMAQ", "B00002STH0", "B00002SWF4", "B00004R9IB", "B00000J2W7", "B00000K1XU", "B000YOCGUO", "B00002STFH", "B000021Y2Z", "B005GTNBGK", "B00004SWLT", "B00000DMAZ", "B00000INR2", "B00002STI2", "B000021Y30", "B00000J2OO", "B00003OTI3", "B00001TZYA", "B00004U1R3", "B0009Y808Q", "B00000K2GI", "B00001TZYB", "B000F9JFXE", "B00000DMAO", "B000PJHAD6", "B005GTND0E", "B00000DMB9", "B00000ID60", "B00004U1R2", "B000JVM256", "B005GTNC8W", "B003UI5GLC", "B002TK1PX0", "B00005ME6D", "B000021Y1B", "B000QHOHHE", "B00002970G", "B000006OWT", "B009MRZAUC", "B005DI7N7W", "B00002STFO", "B000038A6U", "B000031KJM", "B00001P4VO", "B00004R9I4", "B000069BC8", "B00001WRJO", "B00000JHPT", "B00001QES1", "B00004SVSS", "B00000K4E1", "B00002STHX", "B00002STZ6", "B00001OX4T", "B000021Y2Y", "B00001X5C3", "B00004U4QP", "B00004TTTS", "B00002STGE", "B00004WLMA"], "bought_together": ["B00000DMAT"], "buy_after_viewing": ["B00000DMAT", "B00000F1GM", "B00002STGL", "B002TK1PX0"]}, "salesRank": {"Video Games": 12373}, "categories": [["Video Games", "More Systems", "Nintendo 64", "Games"]]}