{"asin": "B0000C6FKA", "description": "Project Gotham Racing 2is the ultimate test of racing skill, style, and daring that rewards you not only for how fast you drive, but also for how you drive fast. Earn Kudos points and gain recognition for cornering on two wheels around the Sears Tower in Chicago; power sliding through the ancient streets of Florence, Italy; or maneuvering along the racing line through the slick streets of Edinburgh, Scotland&#151;all while racing some of the most exotic high-performance vehicles available. Challenge other gamers online, utilizing Xbox Live, or take on your friends in a multiplayer race via System Link.FeaturesNew Kudos reward system: Earn Kudos by performing power slides, spinning out in 360s that corner on two wheels, and (for the first time) drafting while staying on the race line and keeping car damage to a minimum. Kudos is a way to measure your driving skills, flair, and daring, as well as the accomplishments you achieve throughout the game. The more Kudos you earn, the better you're ranking will be and the more vehicles, skins, and tracks you can unlock.Online play:Project Gotham Racing 2supports Xbox Live. Join friends and others around the world for the ultimate street race, or download ghosts (recorded cars to watch, learn from, and compete against).Multiplayer System Link: Allows players to race head-to-head in the same room. Racing around the globe: Maintaining its international theme,Project Gotham Racing 2takes place in photo-realistic recreations of famous cities including Chicago, Edinburgh, Florence, and Moscow.Sweet rides: Take the wheel of some of the most exclusive high-performance vehicles, all fully licensed with realistic damage modeling.Project Gotham Racing 2offers an exciting driving experience in vehicles such as the Ferrari Enzo, Porsche GT2, BMW Z4, Pontiac GTO, Mini Cooper S, and many more.Music that drives you: Listen to the hottest DJs in the world turn out authentic music from real radio stations, as you drive through each city in the game. You can also create personal play lists with the exclusive CD player inProject Gotham Racing 2.Highly detailed game environments:Project Gotham Racing 2captures the essence of every city, with fully researched, photo-realistic environments (including highly detailed storefronts and buildings), allowing gamers to experience the superior graphics technology of Xbox.", "price": 42.54, "imUrl": "http://ecx.images-amazon.com/images/I/51fLfVbvm7L._SY300_.jpg", "related": {"also_bought": ["B00005NZ1J", "B004AGYHUE", "B000UKZ20S", "B000B6ML28", "B001ELWMHI", "B000062YIN", "B001I020CW", "B000086JXB", "B0000C4M23", "B000GPXSA8", "B0001CJEFY", "B000F2JUOK", "B00005Q5CW", "B0000A0MDV", "B00006IJIW", "B0002ILS10", "B000083DZP", "B000E61G4O", "B000069BCI", "B0002CHIZ6", "B00129I75I", "B0000C7GH4", "B002BSA2LQ", "B00065HIR2", "B0000C6FJ3", "B0000503MO", "B0002VYPEE", "B0000C6EDL", "B00005O0I9", "B00005R6YX", "B0007KTBDK", "B0002ILSH4", "B0000ZG4AA", "B00005OLWV", "B000CC5FU6", "B000HVDEQO", "B003O6E986", "B000FRVCAA", "B002K8Y23G", "B0007M226G", "B000A3ON7S", "B00008PX7N", "B00009KO3H", "B00027JYSU", "B00001ZT50", "B00006N5SV", "B00007DCEF", "B00004SVWG"], "bought_together": ["B00005NZ1J", "B000UKZ20S"], "buy_after_viewing": ["B000B6ML28", "B004AGYHUE", "B000UKZ20S", "B00005NZ1J"]}, "salesRank": {"Video Games": 8069}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "More Systems", "Xbox", "Games"]]}