{"asin": "B0083I85HQ", "description": "The Etekcity Remote Control Switch Outlets are ideal for the remote   operation of many electrical devices, including lamps, appliances, tools   and more.The remote control and power sockets are fashioned in a sleek pearl   design.  Get your Etekcity Remote Controlled Switch Sockets today!What's specialUse this remote control switch to control any lamps or small appliance plugged into an AC outletOperates on radio frequency - will perform through walls, doors and floors up to 60 feet away; no line of sight needed. Plugs into any standard wall outletRemote & manual operation. Power status indicator LEDsComes with 5 outlet units and 1 controller-turns on five (5) appliances on from up to 66-Feet awayIdeal for holiday decorations, hard to reach lamps, and great for the mobility impairedFast, Tool-Free Setup - Designed to be user friendly, the remote outlets sets up easily without tools and guides you through the installation processOperate Three Different Appliances with One Remote ControlFeature:433.92 MHz frequency100-foot rangeWorks through walls, floors and doorsGreat for use anywhere in your homeFive(5) Single 3-prong outlets120 v 60 Hz voltage10 A currentVery low consumption: 1.8wDigital codes, no interferenceWith children protectionWith LED indication lights on each socket and transmitterMax power for each socket: 1200wPackage Content:5 Pack Etekcity Wireless Remote OutletsRemote   Control12-volt battery for the remote", "title": "Etekcity&reg; 5 Pack Wireless Control Electrical Outlet Light Switch Socket with 1 Remote (Battery Included)", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/41qKGS20BjL._SY300_.jpg", "related": {"also_bought": ["B000CRFOMK", "B0087DAW46", "B000234UFG", "B00DQELHBS", "B00CDVX330", "B008A4UWK6", "B00DQ2KGB2", "B0065PASNI", "B00A1BO6SA", "B001Q9EFUK", "B002WV3F3E", "B000G80V28", "B001DF2QDK", "B003ZTWYXY", "B00DQELHAE", "B0011DBQBW", "B00DQELIUI", "B00FGI2DO2", "B000083KIH", "B005EHHLD8", "B005N7IO1C", "B005HX2YT0", "B003YFIRR6", "B005WQIDHY", "B00004YK10", "B00178HJ6C", "B006VZKSNC"], "buy_after_viewing": ["B00DQELHBS", "B0087DAW46", "B00A1BO6SA", "B00DQELIUI"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Remote Controls", "TV Remote Controls"]]}