{"asin": "B000MK4GGM", "description": "The sleek Nokia N800 Internet Tablet combines a truly personal Internet experience with easy wireless connections, high resolution display and support for a wide variety of Internet applications. Built to be constantly in use, you easily stay in touch with business associates, friends, and family thanks to its Internet calling, instant messaging and email connectivity. And with stereo audio, multimedia support and a new ergonomic design, the Nokia N800 morphs into a portable Internet entertainment device, enabling playback of streamed and downloaded content wherever you roam.COMMENT: place in \"n800-front-400.jpg\"Stay connected to your world via the Web, streaming Internet radio, and the latest RSS news feeds.The main form of connectivity is Wi-Fi (802.11b/g), and hooking up to a network is as simple as connecting with a laptop. You can also use the integrated Bluetooth wireless connectivity to hook up with a cell phone that is compatible with online data services. When connected to either a WLAN network or to a cell phone, you can make calls using the built-in Internet telephony application as well as conduct video conferencing with the built-in Web cam.The N800 provides 256 MB of onboard flash memory and 128 MB of RAM. It also offers two expansion slots that are compatible with Secure Digital (SD), MultiMedia, miniSD, and microSD memory cards with a size limit of 2 GB. (Adapter required for miniSD and microSD.) You can also connect the N800 to a PC using the included USB cable to update software and transfer files from the PC to the a memory card. For multimedia playback, the N800 is compatible with MP3 and WMA digital audio files (as well as AAC, M3U, and WAV), Real Audio streams, and video files encoded as AVI or MPEG4. Additionally, with the UPnP media server functionality, you can share your music, video, and photos with others on the same Wi-Fi network. The N800 has two integrated speakers as well as a headphone jack for personal listening.Access the web using the N800's Opera web browser, which provides Flash 7 multimedia support. Other applications include an RSS feed reader (for accessing all your favorite news sources), a PDF reader, image viewer, Internet radio player, and instant messenger with voice and video conferencing capabilities (using the Jabber and Google Talk services).COMMENT: place in \"nokia-n800-stand.jpg\"Chat with friends and business associates using built-in chat programs and easy-to-use onscreen keyboard.The 4.1-inch touchscreen has an 800 x 400-pixel resolution with up to 65,536 colors. You can access controls with your fingers or use the included stylus, and the N800 provides intuitive handwriting recognition and a full-screen finger keyboard. The rechargable battery provides up to 10 days of standby time and up to 3 hours of continuous Web browsing or media playback. Other features include:Integrated desk stand for on-table useZooming, full-screen and panning display functionalityAuto connection to saved Wi-Fi hotspots or through Bluetooth compatible phonesMore applications: Clock, Sketch, Notes, BackupDimensions: 5.7 x 2.95 x 0.5 inches (WxHxD)Weight: 7.27 ouncesWhat's in the BoxNokia N800 Internet Tablet, stylus, battery (BP-5L), 128 MB miniSD memory card (with adapter), earphones, carrying case, travel charger, USB cable, Quick Start guide.", "title": "Nokia N800 Portable Internet Tablet", "price": 9.99, "imUrl": "http://ecx.images-amazon.com/images/I/41NlzBXeSLL._SX300_.jpg", "related": {"also_viewed": ["B000Y4AH3C", "B0076ML4LY", "B009EQJ5F2", "B002X3I8PQ", "B00E52M516", "B00BNR5AWM", "B00CKUBLFQ", "B00E45043A"], "buy_after_viewing": ["B003XPAYE6", "B007P4VOWC"]}, "categories": [["Electronics", "Computers & Accessories", "PDAs, Handhelds & Accessories", "PDAs & Handhelds"]]}