{"asin": "B0040JHI4S", "categories": [["Electronics", "Camera & Photo", "Lighting & Studio", "Photo Studio", "Storage & Presentation Materials", "Digital Picture Frames"]], "description": "ViewSonic's 10.2&quot; VFD1027w-11 digital photo frame stores 128 MB of digital photos and displays them in a beautiful ebony frame that complements any home or office d&eacute;cor. Use the slideshow feature to customize your viewing. The ultrahigh 1024x600 resolution screen shows your photos in brilliant detail. It's easy to load photos using the USB port or your memory card. The clock and calendar functions keep you on schedule while showcasing your favorite photos. Choose the VFD1027w-11 for anyone on your gift list or treat yourself to this beautiful digital frame.Key Features:VFD1027w-11 Digital Photo Frame features a high-resolution 1024x600 display for a crystal clear, high quality picture.Card reader supports SD, SDHC, MS, MS PRO and MMC card formats, plus USB transfer from PC, to making loading your photos easyEasy to enjoy and store content with an built-in 128MB internal storageSupports USB in both host and slave modesMore than just a pretty picture with calendar, clock, energy saving and auto-on/off featuresBrightness/contrast/saturation adjustment and power saving auto on/offElegant ebony frame design complements your home or officeIntuitive and easy-to-use interface with remote control includedMemories Last ForeverShowcase a lifetime worth of photos in a single, stylish frame. With 128MB of internal storage plus support for all popular memory cards and USB transfer, the VFD1027w-11 makes it easy to display all your favorite photos. Unlike print photos, your digital pictures never tear, wrinkle or fade, so you can enjoy vibrant, crystal clear memories for years to come.More Beautiful Than You RememberWith a high-resolution 1024x600 display, the VFD1027w-11 digital photo frame displays all your favorite photos in rich, brilliant color with super-fine detail. Frame your full-size photos perfectly to enjoy them the way they were meant to be seen.", "title": "ViewSonic VFD1027w-11 10.2-Inch Digital Photo Frame with 128 MB Internal Memory", "price": 69.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41-%2BNqiBh9L._SY300_.jpg", "related": {"also_bought": ["B000MX48VM", "B0021L9BKQ", "B00200K1SY", "B000OF2F36", "B008R3875C", "B0013AV9TW", "B0043EV1XY"], "buy_after_viewing": ["B008R3875C", "B009A13IB8", "B00DYQQSSK", "B008MW6Y12"]}}