{"asin": "B001U3Y8QI", "categories": [["Electronics", "Television & Video", "Televisions", "LCD TVs"]], "description": "Manufacturer's Description (April 20, 2009)With the Samsung 46-inch LN46B630 HDTV, you're investing in a high-quality LCD TV that offers top-of-the-line picture quality with 1080p high definition resolution. Enjoy the sharpest details and vivid color with an 80,000:1 dynamic contrast ratio for more realistic images and Samsung's Wide Color Enhancer 3 technology for a more natural rendering of colors. It also incorporates a number of innovative features to reduce the motion blur and image judder, which traditionally plague LCD HDTVs when displaying fast movement. This B630 series HDTV combines an ultra-fast 4ms (millisecond) response time with Samsung's Auto Motion Plus frame interpolation technology, which utilizes a 120Hz refresh rate helps ensure crisp, easy viewing of sports, video games and movies.The stylish Samsung LN46B630 1080p HDTV with innovative Touch of Color design.You get superb connectivity and networking with 2 USB ports--for playing MP3 audio and displaying JPEG/MPEG files--and four HDMI 1.3 ports, and it also includes access to Samsung's InfoLink RSS service, which can instantly display updated news, sports, weather and stocks information with a touch of the remote. This HDTV is accented by Samsung's TOC (Touch of Color) bezel design, which offers a hint of red translucent color around the edges of the unit for a uniquely fashionable look. Plus, it's Energy Star compliant, which helps you be green while saving on your electric bill.In addition to this 46-inch model, the Samsung B630 series also includes the 1080p 40-inchLN40B630and 52-inchLN52B630. (Learn more aboutwhat size TV should you get.)Key FeaturesScreen Size:46 inchesBlazing fast 4ms response timeminimizes blurring of fast motion in sports programs. (Learn more)HD-Grade 1920 (H) x 1080 (V) pixel resolution:High-resolution pixel density is combined with a built-in image scaler to handle inputs from a variety of digital and analog audio/video sources.Built-in digital tuner:No external box neededAuto Motion Plus 120Hz:Advanced processing that reduces blur and enhances image detail when viewing fast motion video sequences. (Learn more)Picture-in-Picture (PIP)enables convenient, simultaneous viewing of TV programs and video or PC content sources.Game Modeenhances dark areas, sharpens the picture, speeds up the image processing response and enhances the sounds of your games. Picture and sound quality optimized for the special needs of gaming systems at the touch of a button.Side-mounted USB 2.0 port:Connect USB devices directly to your HDTV to view JPEG photos or MPEG movies or easily listen to your MP3 player through your HDTV's audio system or your home theater system.Touch of Color (ToC):Samsung's unique manufacturing process accents the surrounding bezel with a stylish red tone. (Learn more)Wide Color Enhancer 3optimizes a given color's hue, resulting in more natural rendering of colors. (Learn more)Audio:Two 10-watt stereo speakers (for 20 watts of total power)SRS TruSurround HDcreates an immersive, feature-rich surround sound experience from two speakers, complete with rich bass, high frequency detail and clear dialog.InfoLink: Get free RSS feeds of news, weather and sports right to your HDTV with a built-in Ethernet port (Learn more)Variable sleep timercan be programmed to turn the TV off at different time intervals.Trilingual on-screen displaysin English, Spanish or French.Energy Star Compliant:Reduces energy consumption by up to 25 percent compared with standard TVs.Swivel standincluded.Warranty:1 year parts and labor with in-home service, backed by Samsung toll-free supportConnectionsA wide variety of multimedia devices can be connected to the set through any one of the four HDMI 1.3 inputs (including one on the side), and the handy Anynet+ feature (HDMI-CEC) lets you control all your CEC-enabled peripherals--such as a DVD or Blu-ray player--using just one remote. Connect HD digital devices like disc players, game consoles, and satellite dish components into the two rear connections and use the side-mounted input for cameras, camcorders, and laptops. HDMI is the best performing interface for displaying an HD source on an HDTV.HDMI (version 1.3): 4Component: 2 rearComposite A/V: 1 rear/1 side (shared with component)USB 2.0: 2PC input (15-pin, D-Sub): 1Ethernet: 1RS232C: 1Digital audio output: 1 opticalDimensionsTV without stand: 44 x 28.5 x 3.1 inches (WxHxD); 42.5 poundsTV with stand: 44 x 30.7 x 10.9 inches (WxHxD); 53.6 poundsWhat size TV should you get?Accessories2010 LinkStick:Connect wirelessly to a world of digital content from Samsung. The LinkStick wireless LAN adaptor eliminates the hassle and cluttered look of wires. Learn more about theSamsung WIS09ABGN LinkStick Wireless LAN Adapter.Learn MoreCOMMENT: ==========================================Full HD 1080PFull HD, or 1080p, contains 1.5 times more scanning lines than conventional HD TVs. More scanning lines mean more pixels, more details and a better picture. The new Samsung LCD TV with resolution that is approximately 2 times greater than conventional HDTVs, creating the most perfect picture imaginable. Samsung's 1080p panel uses a new high-speed liquid crystal to cut response time to 6ms (milliseconds).COMMENT: ==========================================Auto Motion Plus 120HzThis technology doubles the frame rate from 60 to 120 frames per second (120Hz LCD panel) without repeating the same image to make more frames. Instead, the TV intelligently calculates the &lsquo;middle' image between frame A and frame B and inserts it in between (Auto Motion Plus 120Hz processor), making a fluid transition from one frame to the next.COMMENT: ==========================================Wide Color Enhancer 3/Cold Cathode Fluorescent LampThe NTSC (National Television Systems Committee) has established the color standards all TVs in America try to meet. And typical LCD TVs only meet about 72 percent of this standard. Samsung LCD HDTVs use Cold Cathode Fluorescent Lamp backlights to give you 92 percent coverage of the NTSC standard, ensuring truer, more breathlessly vivid colors.Samsung's Wide Color Enhancer 3 technology delivers more brilliant colors by expanding the gamut of color expression into a third axis, creating a 3D diagram of luminance. This creates a dynamic display of on-screen color and allows traditionally weak colors, such as green and blue, to look vivid and deep. In addition, red colors are enhanced to provide strong colors across the spectrum and the perfect balance of RGB.COMMENT: ==========================================80,000:1 Dynamic Contrast Ratio80,000:1 Dynamic Contrast Ratio will give you a picture better than you ever thought possible, with whiter whites, blacker blacks and a nearly infinite subtlety of gradations in between. As two of the most important determining factors in overall picture quality, contrast and brightness levels achieve new heights in this latest generation LCD panel. Samsung's new LCD TV's give the most stunning realistic picture quality ever.COMMENT: ==========================================Touch of ColorIn 2008, Samsung created its unique Touch of Color (ToC) design, which uses dual-injection molding to coat a translucent, colored surface to achieve an attractive crystalline appearance. The latest evolution of Samsung's ToC design begins with a deep piano black bezel that fades into distinct chrome that finishes as light ruby highlights. The intensity of the color subtly changes depending upon the viewing angle, and further accentuates these TV's slim bezels.COMMENT: ==========================================Which Size HDTV is Right for My Room?With standard-definition TVs, the rule used to be that viewers would feel comfortable watching a set from a distance of 3 to 6 times the screen size in inches. With HDTV, the resolution is so much better that you can sit closer to a larger TV without noticing the pixels. So with HDTVs, the rule tends to be you can sit anywhere from 1.5 to 3 times the screen size (in inches) for the best experience.If you know the size of the room you have already, where you want to sit, and where your new HDTV should go once you get it, you can figure out the size HDTV you should get.Minimum size = Viewing distance/3Maximum size=Viewing distance/1.5", "title": "Samsung LN46B630 46-Inch 1080p 120 Hz LCD HDTV with Red Touch of Color", "price": 13.77, "salesRank": {"Electronics": 73366}, "imUrl": "http://ecx.images-amazon.com/images/I/41b43rSq9fL._SY300_.jpg", "related": {"also_viewed": ["B00BCGRYY6", "B002669XKY", "B0028YB8MA", "B00GKKI4NY", "B00BEAFLYK", "B00IDXIL7K", "B0074FGP4Y", "B00HPMCNXI", "B00ARAHBIW", "B00I94IPTW", "B00I94IPJC", "B0074FGW5G", "B00I94IRE0", "B00BCGRVX0", "B00BB9ORUS", "B00BB0ZTJA", "B0078LSTRK", "B00BB0ZTO0", "B00GKKI4Q6", "B00ID2HGQ8", "B00ID2HGP4", "B00I94IRIQ", "B00BD8TMIO", "B009AGXH64", "B0071NWYP8", "B00I94ISS0", "B00723QKVQ", "B0074FGR74", "B0074FGLUM", "B00I94IR8G"], "buy_after_viewing": ["B003NF83NU", "B0012S4APK"]}}