{"asin": "B002DC8GKO", "description": "Brink is an immersive first-person shooter that blends single-player, co-op, and multiplayer gameplay into one seamless experience, allowing you to develop your character whether playing alone, with your friends, or against others online. You decide the combat role you want to assume in the world of Brink as you fight to save yourself and mankind&rsquo;s last refuge. Brink offers a compelling mix of dynamic battlefields, extensive customization options, and an innovative control system that will keep you coming back for more.PUBLISHER: Bethesda SoftworksDEVELOPER: Splash DamageANTICIPATED RELEASE DATE: Q1 2011PLATFORMS: Xbox 360&trade; / PLAYSTATION&reg;3 /Games for WindowsGENRE: First-Person ShooterSTORY:Brink takes place on the Ark, a man-made floating city that is on the brink of all-out civil war. Originally built as an experimental, self-sufficient and 100% &ldquo;green&rdquo; habitat, the reported rapid rise of the Earth&rsquo;s oceans has forced the Ark to become home to not only the original founders and their descendants but also to thousands of refugees. With tensions between the two groups growing, Security and Resistance forces are locked in a heated battle for control of the Ark. Which side will you choose?KEY FEATURES:Not Just Another Hero&ndash; Brink&rsquo;s advanced player customization offers a near-endless combination of looks for your character &ndash; allowing for the appearance of your character to be truly unique. As you progress through the game and acquire more experience, you&rsquo;ll have even more opportunities for customization.Two Sides to Every Story&ndash; Choose to fight through the single player campaign as either a member of the Resistance or the Security and then take your same character online to play cooperatively or competitively against other players.Blurring the Lines&ndash; Take your unique character online at any time you choose! Brink allows you to seamlessly move between your single player campaign, co-op with friends, and intense multiplayer action. Multiplayer takes the story online where you can play with up to seven other people (or AI characters) cooperatively as you take on the opposing faction or with up to 16 players competitively.Play SMART&ndash; Brink uses the familiar shooter controls that you&rsquo;re used to, without frustrating, artificial constraints and adds a new feature: the SMART button. When you press the SMART button, the game dynamically evaluates where you&rsquo;re trying to get to, and makes it happen. Whether you&rsquo;re a seasoned FPS veteran or someone just getting started, you&rsquo;ll be able to make more intelligent decisions during the fast-paced action with SMART.Context-Sensitive Goals and Rewards- Objectives, communications, missions, and inventory selection are all dynamically generated based on your role, your condition, your location, your squad-mates, and the overall status of the battle in all gameplay modes. You&rsquo;ll always know exactly where to go, what to do when you get there, and what your reward will be for success.images and screenshots &copy; 2010 Zenimax Media LLC. All Rights Reserved.About Bethesda SoftworksBethesda Softworks, part of the ZeniMax Media Inc. family of companies, is a premier developer and worldwide publisher of interactive entertainment software. Titles from two of the world&rsquo;s top development studios &ndash; Bethesda Game Studios and id Software &ndash; are featured under the Bethesda Softworks label and include such blockbuster franchises as DOOM&reg;, QUAKE&reg;, The Elder Scrolls&reg;, Fallout&reg;, Wolfenstein&trade; and RAGE&trade;.For more information on Bethesda Softworks&rsquo; products, visit www.bethsoft.com.About Splash DamageBased in London, England, Splash Damage Ltd is an independently-owned game developer that created the critically acclaimed Wolfenstein: Enemy Territory for id Software and most recently developed the #1 PC hit Enemy Territory: QUAKE Wars. The studio has won over 100 awards and nominations from publications across world and was named Best Independent Developer at the Develop Industry Excellence Awards 2008. Founded by Paul 'Locki' Wedgwood in 2001 with key members of the mod-making community, Splash Damage is currently working on BRINK with Bethesda Softworks. Splash Damage's Web site is located at www.splashdamage.com. SPLASH DAMAGE and the Splash Damage logo are registered trademarks of Splash Damage Ltd in the United Kingdom and/or other countries.Copyright &copy;2001 - 2010 Splash Damage Ltd. All rights reserved.ZeniMax, Bethesda Softworks and related logos are registered trademarks or trademarks of ZeniMax Media Inc. in the U.S. and/or other countries. RAGE, ID, id Software, ID TECH, and related logos are registered trademarks or trademarks of id Software LLC in the U.S. and/or other countries. All Rights Reserved.All other trademarks or trade names are the property of their respective owners. All rights reserved.", "price": 16.49, "imUrl": "http://ecx.images-amazon.com/images/I/51jvfKGK8iL._SY300_.jpg", "related": {"also_bought": ["B003P9FRGA", "B003H0CBYS", "B00354NANC", "B0050SX2MK", "B001C4DKG4", "B0023CBZ70", "B00576U7W8", "B003O6HE0Q", "B0016GC9D8", "B002BRZ744", "B000SQ5LQE", "B003Q55YCU", "B004L5SJ58", "B000R3CIV4", "B000NGP1R8", "B001COV1CY", "B002BXJ9VA", "B005185SDA", "B002I0JBL4", "B004ML44Y6", "B0050SWZHS", "B0012N3T3Y", "B0021TVYCG", "B00170823O", "B000FQBF1M", "B001UWGCW2", "B000K9OR4Q", "B0056WJA6C", "B002ZJNWWC", "B002I0K6DG", "B000HGOHWO", "B003S2MXQG", "B002I0K5NC", "B0022TNO7I", "B005C2D1YI", "B002BRZ6UE", "B004BCZLQ6", "B0050SXGU8", "B00198PO5I", "B000KLNLUK", "B004LWEK7C", "B0037LVW9M", "B003GT8IL0", "B002ELCV00", "B0012N94WO", "B002I0J5YW", "B000FPOJOS", "B00320JAWY", "B000WJFZEA", "B0050SXZ7W", "B005GM3XVA", "B003O6E6EI", "B000GA73O0", "B000R3BLA8", "B003O6E67A", "B0014UGK8G", "B000JLIXIG", "B000M4KJ32", "B000ZK695U", "B001D7T2VC", "B008XMSR6G", "B003O6G1L4", "B0056WJA6M", "B002I0K5HI", "B000JLIYLC", "B00139RPNC", "B001QXNBNI", "B00320J6W8", "B008E6ZXTA", "B003L8DXOI", "B004UDB9SA", "B004EW948E", "B000UUATJ2", "B001ASJIS6", "B003O6E3QY", "B007UM599S", "B0050SXEM8", "B005THAX6K", "B00269QLH4", "B004FUI84G", "B003FBL85M", "B004FYJFNA", "B0050SXX88", "B002EZH804", "B002EE1P2W", "B0085CA8QG", "B007V9NHMQ", "B003O6HDRU", "B000V1OUVI", "B000QAVV6G", "B000WMEEBM", "B002I0H2G0", "B002I0J82G", "B0050SXOD2", "B003DLQTYY", "B0081B1O5A", "B0076ZQSFI", "B003O6KWZK", "B0043M64GK", "B001NX6GBK"], "bought_together": ["B001C4DKG4"], "buy_after_viewing": ["B001C4DKG4", "B005185SDA", "B0081B1O5A", "B004HYK8Y8"]}, "salesRank": {"Video Games": 8674}, "categories": [["Video Games", "PlayStation 3", "Games"]]}