{"asin": "B0001VGFKW", "related": {"also_bought": ["B0029HHIDY", "B003ZX4QU4", "B00F0H88SY", "B009OBCAW2", "B0001VHARO", "B0044YPN0A", "B006LW0WDQ", "B0082CFIVY", "B0049P6OTI", "B006U1VH2S", "B000V52CP0", "B004G8CTPG", "B002JP4Z96", "B009GUQZ9U", "B0007LCL90", "B00BQO4VN6", "B00IKMHR3S", "B002HPNDDW", "B0029XW5JA", "B002UL0XH2", "B00DIGD604", "B00B981F4M", "B0037WLS4U", "B007A99ICA", "B001CROHU4", "B00B981F1U", "B007N43T5Y", "B00081NX5U", "B0093F4ROI", "B00D36RQQO", "B002UL0XE0", "B003ZX4Q7M", "B00B7X2OW6", "B002I9XKTE", "B003ZX4RFS", "B000N7DY9Y", "B004UR486G", "B000CHRJ8C", "B003OELGGG", "B0002EPWC0", "B003ZX4RD0", "B001QNBUA4", "B004NQU4YY", "B0007OGTGS", "B002JTOLH8", "B003GSLEJY", "B007JV6F34", "B000NJHAFQ", "B0077V8930", "B008I640QS", "B00BWS87WW", "B000Q87LM6", "B0033SC2SE", "B003LZA95W", "B007K7P6GO", "B001AVRD62", "B009ZGK6QS", "B00C2P61FO", "B000O3TFZO", "B00004Z5CP", "B001TKAE7O", "B0001VHARY", "B000TQ4D8K", "B00IJH57I6", "B000XPSH70", "B003EVA5E8", "B0097JLQVC", "B00077INZU", "B0031TEBRK", "B001P2R1RW", "B009JR1QVM", "B000MBUSD6", "B00DIUDLFU", "B00J4CUO3S", "B00026BQJ6", "B000067RBT", "B0002KVQBA", "B00B3K4YTY", "B001CROHX6", "B00005T3BD", "B00BBM0664", "B000K8MV86", "B006U3O566", "B004VM1T5S", "B0083J7EUO", "B000OG88KY", "B00BG5M94S", "B0032JTDPO", "B001TKE25E", "B0054U46Y2", "B00B9B4IYI", "B00378KMF0", "B003CFATT2", "B001KPILLE", "B008DW9H56", "B004YEBK66"], "bought_together": ["B0029HHIDY"], "buy_after_viewing": ["B0001VHARO", "B00378KMF0", "B0029HHIDY", "B0001VHARY"]}, "title": "Yamaha NS-AW150BL 2-Way Outdoor Speakers (Pair, Black)", "price": 83.19, "salesRank": {"Electronics": 1163}, "imUrl": "http://ecx.images-amazon.com/images/I/41XQPEZVG3L._SX300_.jpg", "brand": "Yamaha", "categories": [["Electronics", "Home Audio", "Stereo Components", "Speakers", "Satellite Speakers"]], "description": "Yamaha's compact NS-AW150 bookshelf speakers provide an affordable way to enjoy your music or television programming on a deck or under a porch. You can bring them in during the cold months and set them up indoors, too: their high build quality and good sound lend them equally well to two-channel indoor listening.The speakers, which are sold as a pair, each use a 6.5-inch high-compliance, polypropylene, mica-filled woofer and .5-inch PEI dome tweeter. The drivers are optimized for high rigidity but low mass, giving them reasonably high sensitivity (80 dB with 2.83V at 1 meter), another way of saying modest amplifiers won't have much trouble driving them. Their acoustic-suspension cabinets are sealed to prevent undue resonance or tubby, tuneless bass, which often results from low-cost ported designs.With a nominal impedance of 6 ohms, the speakers will work nicely with amplifiers up to 35 watts per channel, nominal, or 120 watts, peak power. They boast a frequency response of 80 to 40,000 Hz (+/-3 dB), giving you decent bass output for their compact size and unusually extended high-frequency response for your most demanding digital media. For indoor use, you may want to augment their performance with a subwoofer to deliver deeper and more powerful bass; be sure to select one with a variable crossover so you can tailor its upper frequency to effectively \"take over\" at the point of the NS-AW150s' lowest deliverable frequency.The speakers are magnetically shielded, so you can place them on or near a TV or video monitor without fear of picture degradation from their magnetic fields. Five-way binding posts simplify connection with several different terminations of speaker cable (including banana plugs), and the NS-AW150s even come with two lengths of cable to get you started.While you wouldn't want to leave the speakers exposed on, say, the deck of a boat, they are water resistant and designed to withstand light wind and rain--a benefit of their sealed enclosures and rugged metal grilles. The speakers come with mounting bases and brackets.What's in the BoxTwo speakers, two lengths of speaker cable, speaker bases, mounting brackets, a warranty card, and a user's manual."}