{"asin": "B000OK6T9W", "categories": [["Electronics", "Computers & Accessories", "Monitors"]], "description": "HP W2207 22 In Widescreen Flat Panel LCD Monitor. The HP w2207 with BrightView panel provides an elegant flat panel monitor with a wide view for work or play. The HP w2207 provides a BrightView widescreen panel for for brilliant picture quality. Dual inputs support true digital /DVI D/ and traditional analog /VGA/ signals. HDCP enabled for optimum viewing of High Definition content /High Bandwidth Digital Content Protection. Double hinge base allows height adjustment from the youngest to oldest viewer to view comfortably. Rotate from regular mode to portrait to view long documents or web pages on your PC. My Display provides one touch adjustment for brightness, color and contrast. Quick View modes change work environments easily and quickly. Integrated speakers and keyboard parking keeps your desktop clutter free. Personalize your monitor with Easy Clip by clipping on photo holders, cameras, and accessories. My Display provides one touch OSD adjustment for brightness, color and contrast. The wide aspect ratio and high resolution bring gaming, videos and internet surfing brilliantly alive when you plug into your HP PC. Fast response time makes gaming even more enjoyable High Resolution Picture Quality and Ultimate flexibility. Creative and technical users can maximize project productivity with this widescreen. View two pages side by side for editing graphic layouts, or working with wider spread sheets. Rotate from your regular view to portrait mode to view long documents or web pages. Extreme resolution at 1680 x 1050 for bright, awesome graphic quality perfect for videos, photo editing or gamingon your PC Standard 15 pin D sub analog and advanced DVI D digital interfaces for optimal graphic performance.", "title": "HP W2207 22-inch Widescreen Flat Panel LCD Monitor", "price": 7.99, "salesRank": {"Computers & Accessories": 3653}, "imUrl": "http://ecx.images-amazon.com/images/I/41Y60Tmw2UL._SY300_.jpg", "related": {"also_viewed": ["B00139S3U6", "B002RW08EC", "B00B332A4C", "B001UHOX2S", "B00B3FTM7S", "B0088IAXJY", "B003FMUL7M", "B008LE4XU0", "B0085H66NU", "B004G8QO5C", "B00KRA5RTC", "B009H0XQPU", "B00BWBEL1U", "B00347A48O", "B007JLEEXC", "B00CR0JNIG", "B00EMB4L0I", "B002RW08EM", "B00B332A24", "B00AYA7NBA", "B00B332A9C", "B00B3329WA", "B009H0XQRS", "B005BZNDOO", "B004G8QO5M", "B0085H662G", "B005BZNDS0", "B000NL2MJ8", "B00GJO7GOE", "B00EZSUWFG", "B00AYA7NAQ", "B005LN1JEC", "B003Y3BJ7S", "B005BZNEVQ", "B004G8QO8O", "B00413PHDM", "B00JTEV47Q", "B000TGUN8E", "B003FMUL72", "B00847TYYO", "B003D1CFHY", "B009HNEBLK", "B00C18YRR6", "B003HFCDLY"], "buy_after_viewing": ["B001TH7T2U", "B005BZNDOO", "B005BZNDS0", "B0041BT21M"]}}