{"asin": "B0021AFZOI", "description": "Weighing just 2.8 pounds, the Samsung N120-12GBK mini-notebook in black improves on its predecessors with a sleeker, curvier design, a glossy LCD screen, a larger touchpad, an integrated subwoofer for 2.1-channel surround sound (via SRS audio technology), and a 6-cell lithium rechargeable battery that provides up to 6 hours of continuous use. An affordable mobile PC that's ideal for all your online needs, the N120 is designed to go almost anywhere--from kitchen and living room at home to Wi-Fi hotspots at coffee shops, airports and more. It sports a 10.1-inch LED-backlit SuperBright screen and a 97-percent full-size keyboard that's easy to type on.It's powered by the 1.6 GHz Intel Atom N270 processor, which is designed especially for mobile devices and features an innovative hafnium-infused circuitry that reduces electrical current leakage in transistors to conserve energy. The integrated 54g Wi-Fi networking (802.11b/g) will keep you connected to email and all your social networks, while the Bluetooth 2.0+EDR technology enables you to use handsfree communication headsets while video chatting via the integrated 1.3-megapixel webcam. This model comes in black, but it's also available inwhite.Other features include a 160 GB hard drive, 1 GB of RAM, built-in speakers and microphone, SD/SDHC/MMC memory card reader, three USB ports (with two of them able to charge your peripherals), and a VGA output to an external monitor. It comes preinstalled with the Microsoft Windows XP Home operating system, which offers more experienced users an enhanced and innovative experience that incorporates Windows Live features like Windows Live Messenger for instant messaging and Windows Live Mail for consolidated email accounts on your desktop.Seelarger image.Seelarger image.ProcessorThe Intel Atom processor uses a brand new design structure that packs in 47 million transistors into a single chip sized at just 22mm (0.87 inches), and it uses just 2.5 watts of power--less than 1/10 of the 35 watts used by an Intel Core 2 Duo processor--for excellent battery management. This 1.6 GHz Atom N270 processor also includes a power-optimized front side bus of 533 MHz for faster data transfer on demanding mobile applications and a 512 KB L2 cache (which temporarily stores data).The 97-percent full-size keyboard makes it easy to type no matter where you are (seelarger image).Storage &amp; MemoryThere's plenty of room for everything you download from the web with 160 GB of hard disk drive storage. Plus, you'll enjoy a quick system boot-up and fast access to stored information. The N120 offers 1 GB of installed RAM, delivering maximum netbook performance for accessing the Internet and enjoying streaming multimedia.Screen, Video &amp; AudioWith its LED-backlit SuperBright 10.1-inch wide LCD, you can view the Internet or any application in full-screen mode (at a 1024 x 600-pixel resolution) without compromise and in a clear and comfortable display. Video is powered by Intel's integrated, power-efficient 945GSE Express chipset, which features a 32-bit 3D graphics engine based on the Intel Graphics Media Accelerator 950. Enjoy a full and rich multimedia experience on the go with high-quality sound thanks to the integrated SRS 2.1-channel system, featuring 2 x 1.5 watt stereo speakers with a dedicated subwoofer. It also offers an integrated audio chip that's compatible with HD Audio.Integrated WebcamAn integrated 1.3 megapixel digital motion camera makes it easier than ever to keep in touch with friends and family, using video-conferencing or live messaging. The camera combines the resolution and image quality of a still camera with the sustained high frame rates of a video camera.ConnectivityThis Samsung N120 mini-notebook has an integrated 54g wireless LAN (Acer InviLink) that's compatible with 802.11b and 802.11g wireless networks, as well as an Ethernet jack for plugging into a wired network. With the integrated Bluetooth connectivity, you can communicate and synchronize with Bluetooth-enabled peripherals such as PDAs and cell phones as well as use Bluetooth-enabled headsets for VoIP phone calls and handsfree video chats. To increase your storage capabilities, you can access optional memory cards (Secure Digital, Secure Digital High Capacity, and MultiMediaCard).Here's the full list of connectivity options:3 USB 2.0 ports for connecting a wide range of peripherals--from digital cameras to MP3 players (2 chargeable USB portsSD/SDHC/MMC memory card reader1 headphone out/microphone inRJ-45 port for 10/100 Fast Ethernet connectionVGA video output for external monitorsOperating System &amp; SoftwarePre-installed with Windows XP, the Samsung N110 includes the following software: Samsung Recovery Solution III, Samsung Magic Doctor, Samsung Update Plus Easy Display Manager, Easy Battery Manager, Easy Network Manager, Easy SpeedUp Manager McAfee Virus Scan, Adobe Acrobat Reader.Dimensions &amp; WeightThis netbook measures 10.71 x 7.4 x 1.17 inches and weighs 2.8 pounds.PowerThis mini-notebook includes a six-cell (5200mAh) lithium-ion battery for up to 6 hours of use.What's in the BoxThis package includes the Samsung N120-12GBK, rechargeable battery, AC adapter, and printed operating instructions. It's backed by a one-year warranty.", "title": "Samsung N120-12GBK 10.1-Inch Black Netbook - 6 Cell Battery", "price": 299.0, "imUrl": "http://ecx.images-amazon.com/images/I/413CabgCmoL._SX300_.jpg", "related": {"also_viewed": ["B00A4TN97S", "B009AF5736", "B0030KZ2GE", "B00B7K11MI", "B00J49ZH6K", "B00HZT1T5E", "B00CPIF4G0", "B009M2YNWI", "B00HZT1TK4", "B00HZT1TWW", "B00FCK20SI", "B009LL9VDG", "B00FEE7D1Q", "B00G1NC0Y4", "B00FAUGGPS", "B00KMRGF28", "B00HE6ROFC", "B00EYTI0TG", "B00HQZGZ38", "B00J49ZHCY", "B00GJ1CFZ2", "B00FJXVRM8", "B00FGOTA6K", "B00CM1AAP0", "B00JTI4X3E", "B00GWVNK8A", "B00FNPD1VW", "B00J49ZH1U", "B004KZJ0UM", "B00GSEOV7U", "B00FFJ0HUE", "B00HRLSSKO", "B00HRO3IBA"]}, "categories": [["Electronics", "Computers & Accessories"]]}