{"asin": "B001T9CTRS", "categories": [["Electronics", "Computers & Accessories", "Data Storage", "USB Flash Drives"]], "description": "With USB ports popping up everywhere you look, you need a simple and reliable way to store and share your photos, videos and music on the fly. The SanDisk Cruzer USB Flash Drive is your answer. Because it works with virtually any computer or electronic device with a USB slot, this flash drive lets you leave your laptop at home but still take your vast amounts of content with you to share with family and friends. Whether you need to transport your latest MP3 downloads, vacation videos, or your college thesis, the SanDisk Cruzer USB Flash drive offers portable storage that you can trust.SanDisk Cruzer USB Flash driveAt-a-Glance:Take it all with you- on reliable USB flash drivesTransfer with confidence- when moving data from PC to PC or other consumer electronic devicesIdeal for video- the easy way to store, share and play your favorite video filesTrust the minds behind flash memoryto keep your files safe and secure with a two-year limited warrantyInnovative capless design exposes the USB connector via a convenient slider.View larger.The SanDisk&reg; Cruzer&reg; USB Flash drive is a fast and reliable flash storage device for Windows&reg; XP, Windows&reg; Vista&reg;, Mac OS&reg; 10+ and Linux machines.Convenient Storage and PortabilityWith USB ports on computers, to new ports popping up on cars, DVD players, TVs, photo frames, and more, the need for a fast and reliable way to share your digital content on a moment's notice is greater than ever.The SanDisk&reg; Cruzer&reg; USB Flash drive meets that need. This reliable flash drive fits in the palm of your hand and gives you the storage capacity you need to store and transfer up to 8 GB of data.While the drive is optimized for laptops and devices with USB 2.0 port, it is backwards compatible with older devices that have USB 1.1 ports, so you can be assured of near universal compatibility.View Videos Without Extra Software or SetupWith the SanDisk Cruzer USB Flash drive, you can transfer your favorite video from one device to another easily and conveniently, without any additional software or setup. The drive offers drag-and-drop convenience, which means you can simply drag the files from your device onto your SanDisk Cruzer Flash drive, or vice versa, without any steps.Transferring video files from computer to computer, or from your drive to a USB-enabled DVD player, is incredibly simple. Drag your video files from your PC to your USB flash drive and then plug the drive into your DVD player -- or even your USB-enabled TV -- and sit back to enjoy the show.Smart, Stylish Design for Ease of UseWith a capless design that exposes the USB connector via a convenient slider, the SanDisk Cruzer USB Flash drive looks just as great as it performs.When you plug the SanDisk Cruzer USB Flash drive into your USB-enabled device, a glowing, amber-colored LED alerts you that the drives are ready for reading or writing data. This LED rapidly pulses when data is being transferred, and it slows down when the drives are idle, giving you a clear indication of the disk's activity.The SanDisk Cruzer USB Flash drive is compatible as a flash storage device with Windows&reg; XP, Windows&reg; Vista&reg;, Mac OS 10+ and Linux machines.The drive is backed by a limited two-year warranty.About SanDiskSanDisk Corporation, a Silicon Valley-based S&amp;P 500 company, is the world's largest supplier of flash storage cards. It is a global leader in flash memory cards cards--from research, manufacturing, and product design to consumer branding and retail distribution. SanDisk holds more than 860 U.S. patents, more than 550 foreign patents, and it is the only company that has worldwide rights to both manufacture and sell top flash card formats  including SD, microSD, miniSD, CompactFlash, MultiMediaCard, xD-Picture Card, Memory Stick PRO, and related Memory Stick micro card products.SanDisk's product portfolio includes flash memory cards for mobile phones; digital cameras and camcorders; digital audio/video players; USB flash drives; embedded memory for mobile devices; and solid-state drives for computers.What's in the BoxSanDisk Cruzer USB Flash drive (8 GB)HOW MUCH CAN YOU STORE?CARDCAPACITY64 GB*16,0003.5 minute songs**or19,200images**or128hours**32 GB*8,0003.5 minute songs**or9,600images**or64hours**16 GB*4,0003.5 minute songs**or4,800images**or32hours**8 GB*2,0003.5 minute songs**or2,400images**or16hours*** 1 gigabyte (GB) = 1 billion bytes. Some capacity not available for data storage.** Approximations: results will vary based on file size, resokution, compression, bit rate, content, host device, pre-loaded files and other factors. See www.sandisk.com", "title": "SanDisk Cruzer 8 GB USB 2.0 Flash Drive (SDCZ36-008G-A11)", "price": 9.99, "imUrl": "http://ecx.images-amazon.com/images/I/415-RxBhmgL._SY300_.jpg", "brand": "SanDisk", "related": {"also_bought": ["B003K26VP8", "B001XURP7W", "B001T99ZTI", "B001XURP8G", "B007RB0JZG", "B007JR531I", "B007JR532C", "B003EO328Q", "B004TS1J18", "B003MULNRY", "B003S6AXVO", "B007JR532M", "B007JR5368", "B003U7LJJ6", "B007RB12YI", "B006I04AIO", "B007RB0VJK", "B0009Y7AX2", "B000RT77I2", "B0009Y7AW8", "B002U1ZBG0", "B007JR5304", "B00H7PBXXE"], "bought_together": ["B007JR532M"], "buy_after_viewing": ["B007JR532C", "B004TS1J18", "B007JR5368", "B00DYQYJ3Q"]}}