{"asin": "B000BTL0OA", "related": {"also_bought": ["B008I64LC6", "B0002F3G7M", "B00IKMJWY0", "B008I646WG", "B004XC6GJ0", "B002K683V0", "B00DTWOHE6", "B00IKMJ9B6", "B00DTW7JIW", "B00AJHDZSI", "B000NZNTVE", "B000SEN9U6", "B00000JDF5", "B003CFATOW", "B002M3SHXA", "B002R7JPGE", "B000JV9LUK", "B005Y1UFIM", "B000FCIMDU", "B00EO6X4XG", "B00002EQCS", "B00002EQCW", "B00023433U", "B005BTA0FA", "B001TH7GVE", "B0000BVYT3", "B0057OC5O8", "B0063K4NN6", "B001IBFSJ8", "B004EGI3CI", "B00KEK4Q5Q", "B0088PUEPK", "B004NBZ98K", "B00000K4KH", "B000JE7GPY", "B004T9RR6I", "B00461G3MS", "B00EUAFAF6", "B00I94ISS0", "B00D78QCYK", "B00A3VFIM6", "B000P1OA1O", "B001CY0P7G", "B004ULP9QA", "B00DSUTX3O", "B00AO4EKSU", "B001W28L2Y", "B00H09BOXQ", "B003VAHYNC", "B00CIDQ470", "B00BB0ZTO0", "B008ALA6DW", "B003LVZO8S", "B00DHJ8QLQ", "B00450DVDY", "B0052SCU8U", "B008I638AM", "B005T3GRNW", "B007I5JT4S"], "bought_together": ["B008I64LC6"], "buy_after_viewing": ["B001FWYGJS", "B004XC6GJ0", "B006QB1RPY", "B001UI4RTG"]}, "title": "Linksys WRT54GL Wireless-G Broadband Router", "price": 49.95, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41YJr7hITzL._SY300_.jpg", "brand": "Linksys", "categories": [["Electronics", "Computers & Accessories", "Routers"]], "description": "The Linksys Wireless-G Broadband Router is really three devices in one box. First, there's the Wireless Access Point, which lets you connect both screaming fast Wireless-G (802.11g at 54Mbps) and Wireless-B (802.11b at 11Mbps) devices to the network.The Linksys-Cisco WRT54GL offers great performance and ease of use -- plus Linux compatibility. See it in detail:frontandrear.There's also a built-in 4-port full-duplex 10/100 Switch to connect your wired-Ethernet devices together. Connect four PCs directly, or attach more hubs and switches to create as big a network as you need. Finally, the Router function ties it all together and lets your whole network share a high-speed cable or DSL Internet connection.Once your computers are connected to the Router and the Internet, they can communicate with each other too, sharing resources and files. All your computers can print on a shared printer connected anywhere in the house. And your computers can share all kinds of files -- music, digital pictures, and documents. Keep all your digital music on one computer, and listen to it anywhere in the house. Organize all of your family's digital pictures in one place, to simplify finding the ones you want, and easing backup to CD-R. Utilize extra free space on one computer when another's hard drive starts to fill up.The new push button setup feature makes it easy to configure your wireless devices. Just push the button on the router and on your other SecureEasySetup-enabled wireless device to automatically create an encryption-secured wireless connection. TKIP and AES protects your data and privacy with up to 128-bit industrial-strength encryption. The Router can serve as a DHCP Server, has a powerful SPI firewall to protect your PCs against intruders and most known Internet attacks, supports VPN pass-through, and can be configured to filter internal users' access to the Internet. Advanced configuration is a snap with the web browser-based interface.With the Linksys Wireless-G Broadband Router at the center of your home or office network, you can share a high-speed Internet connection, files, printers, and multi-player games with flexibility, speed, security and simplicity!"}