{"asin": "B000VRRPSC", "description": "Amazon.com Product Description.caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; }The Logitech Pure-Fi Elite stereo system creates a full-functioning stereo from your iPod, filling any room with high-performance digital sound. Charge your iPod while you enjoy favorite tunes from selected playlists or from the built-in AM/FM radio--and control it all from across the room with the included backlit remote. The remote also provides easy one-touch access to shuffle and repeat functions, and even allows instant access to preset iPod playlists without navigating menus on your iPod.The Pure-Fi Elite and your iPod combine to provide a full-function stereo system.View larger.The Pure-Fi Elite immerses users in high-quality acoustics. The system features two 1-inch high-definition soft-dome tweeters to ensure precision and clarity from even the highest notes. The two 4-inch high-power long-throw woofers are capable of filling the room with deep, powerful bass. Meanwhile, DSP-controlled, dynamic, digital EQ, and advanced filtering features minimize distortion to create true-to-life sound. Also included is a bi-amplified transducer design with digital electronic crossover for studio-quality audio that plays louder and sounds better. The onboard StereoXL technology dramatically widens stereo image, creating an immersive audio experience.Composite and S-Video output jacks are included for when you want to view iPod video files on a big screen while enjoying outstanding audio pumped through the Pure-Fi Elite.The Pure-Fi Elite supports all iPod models with dock connectors--including iPod nanos and fifth-generation iPods. The Pure-Fi Elite supports 1G through 3G iPod models (and other portable music players) via a 3.5-mm auxiliary input. With an easy-to-read digital clock, the Pure-Fi Elite measures 17.6 by 10.6 by 5.7 inches and comes backed by a two-year limited warranty.Audiophile Performance- 1-inch high-definition, soft-dome tweeters: Get precision and clarity from even the highest notes.- 4-inch high-power, long-throw woofers: Fill the room with deep, powerful bass.- DSP-controlled, dynamic, digital EQ and filtering: Minimizes distortion to create true-to-life sound.- Bi-amplified transducer design with digital electronic crossover: Enjoy studio-quality audio that plays louder and sounds better.- StereoXL technology: Dramatically widens stereo image, creating an immersive audio experience.Convenience- Digital AM/FM radio: Increases your musical choices while giving you a complete stereo solution.- Digital clock: Watch where the time goes.- Charges your iPod: Doubles as an iPod charger.Control- Backlighted wireless remote: Control and browse your iPod from anywhere in the room with a remote that's backlighted for use in the dark. Enjoy one-touch access to Shuffle and Repeat.- Presets for iPod playlists: Enjoy instant access to your favorite music, without having to navigate menus on your iPod.What's in the BoxSpeaker system, AC adapter, backlighted wireless remote and remote holder, universal dock adapters, quick-start guide, and user's manual.", "title": "Logitech Pure-Fi Elite High-Performance Stereo System for iPod (Black)", "price": 113.95, "imUrl": "http://ecx.images-amazon.com/images/I/41sl87ktLmL._SY300_.jpg", "related": {"also_viewed": ["B003VANOI6", "B001FWXDZQ", "B000UPBUP4", "B001G5Z82I", "B002I3OZ7G", "B002I636XM", "B005KQ2O2G", "B000ARSLB8", "B000HQMJBA", "B000KINJ3W", "B005IVL0UA", "B00170IBF8", "B0038W0N8G", "B000UPA82U", "B00383I0OE", "B00BQ4HRN2", "B005KQ2O26", "B007JCNOHI", "B00ANG3ULW", "B009CCNG76", "B00G9BPBIU", "B00C5DHGEI", "B00657WTO2", "B005NGOPSY", "B000VS827Y", "B005JW6WQU", "B004TS2AOS", "B0064IIFPO", "B00FQ7ICHU", "B004A9LVKK", "B001RB1XK2", "B0037W6692", "B00BI8IT24", "B00CLUSJF0", "B0039P3D0W", "B004VW3ORO", "B007PZYBSA", "B002Y5XQYG", "B005HY4UJ6", "B0000E2OAS", "B000KA0QG8", "B00G2BH23O", "B003ZZWJII", "B0006FNL0U", "B00K5NYNWS", "B00COC0QNI", "B00BCSYZQY", "B003IB759W", "B000LFF0FE", "B000EFBN2U", "B0064IIEPU", "B003XQLRBY"], "buy_after_viewing": ["B003VANOI6", "B001FWXDZQ", "B003VAHYTG", "B003IBB9CG"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}