{"asin": "B0006OCEFY", "related": {"also_bought": ["B00066Z9XG", "B001PNNXGO", "B000023VW2", "0955548152", "0955548160", "B008MPKAPK", "B004H9C4JK", "B004H912FC", "B00ESUOMFW", "B000668BKY", "0914941801", "B00009VT84", "B008RZJHJU", "B008IYCQSO", "B00408K36Y", "B004QJKO52", "B00GJ51NVA", "B000H7NVX4", "B00CP0I474", "B00065X51U", "0945053657", "B00006IS4X", "B008RZ0EQ0", "B005F5FL5O", "B003KWKUO6", "B009MAKWC0", "B004P5XW06", "B008Y2SPE4", "B00BY3XN7E", "B00C37AZXK", "087259257X", "B0000228GF", "1470146967", "B00BY3XOSW", "B0014T7W8Y", "B006PJ6EDW", "B00C83AU9S", "B00HUB0ONK", "B004QD0R3M", "B003XU76PQ", "B004Q21I4U", "B000VIA4CA", "0945053746", "B0097252UK", "B008Y2SPH6", "B00DTQ4A6M", "B00020S7XK"], "bought_together": ["B00066Z9XG"], "buy_after_viewing": ["B004H912FC", "B00066Z9XG", "B000023VW2", "B004H9C4JK"]}, "title": "Kaito KA1103 Worldband Radio, Silver", "price": 77.86, "salesRank": {"Electronics": 29342}, "imUrl": "http://ecx.images-amazon.com/images/I/51OFd0d2fVL._SX300_.jpg", "brand": "Kaito", "categories": [["Electronics", "Portable Audio & Video", "Radios", "Shortwave Radios"]], "description": "The newly released Kaito KA1103 is an improved and more advanced version of widely praised KA1102. This digital PLL dual conversion world band receiver will keep you connected to a very comprehensive frequency range including FM, AM, short wave and long wave stations with both a digital readout and a simulation of the old-fashioned analog dial. The KA 1103 has a very effective wide-narrow filter. It does a really good job of whacking back adjacent channel interference. Listeners will be impressed with both selectivity and sensitivity. With single side band (SSB) reception, the radio will transmit with a minimal amount of interference. There are four options when tuning your radio stations. With direct tuning, you input the desired frequency digits. Manual tuning allows you to change the frequency using the tuning knob. If you are unsure of what station you want, use the scan tuning option to have the radio stop at all hearable receptions. Finally, with preset tuning, you can recall a preset station with a single button press. You can store up to 256 preset stations using memory tuning feature, and there is a ten-key direct access tuning function, offering you quickly access to your top ten favorite stations. If you plan on traveling with a radio, the KA1103 is a very good choice. You can either listen to the KA1103 via the built-in 3\" speaker or with the included earphones. Beyond the ability to tune into various radio bands, the KA1103 also features a built-in automatic battery charger, plugs it into any wall outlet with the included AC adpator when the battery indicator shows that battery is low. Frequency Coverage: FM:76.0-108.0MHz;MW:520-1710 MHz; SW:1.71-29.99 MHz;LW 100 - 519 kHz. Package includes Stereo earphones, 120 V/AC adaptor, external antenna, carrying pouch, 3 pcs of AA rechargeable batterties and a copy of user manual."}