{"asin": "B006UMM1PO", "related": {"also_bought": ["B007JL60U2", "B005HNF01O", "B003VNKNEQ", "B007KSQRNY", "B00890LRG4", "B000EVLS4C", "B004MT8ECG", "B007ZFSAB4", "B005POCF4U", "B003VNKNF0", "B0037TA7Z4", "B009FCGCHY", "B001V9KG0I", "B00960BQ0S", "B003LYJY4K", "B006Z9XOTY", "B00GBDPVUE", "B005RXH1WU", "B001THX7FI", "B00CV9MHG8", "B007PREO62", "B007KNFEJM", "B00BC4GTTY", "B003F7DWH8", "B00009R6VO", "B007P7FTTI", "B00890R4U2", "B003ASCW8C", "B002HZW6WQ", "B003VNKNEG", "B007M54E08", "B004XIB9T6", "B007FTJ8RU", "B007M54E1M", "B00ABJXV5Q", "B007JRB0RE"], "bought_together": ["B003VNKNEQ"], "buy_after_viewing": ["B003VNKNF0", "B003VNKNEQ", "B00AWYN182", "B00AWYN0ME"]}, "title": "Canon PowerShot ELPH 110 HS 16.1 MP CMOS Digital Camera with 5x Optical Image Stabilized Zoom 24mm Wide-Angle Lens and 1080p Full HD Video Recording (Silver)", "price": 275.0, "salesRank": {"Camera &amp; Photo": 1528}, "imUrl": "http://ecx.images-amazon.com/images/I/51yz49CBp8L._SY300_.jpg", "brand": "Canon", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Canon PowerShot ELPH 110 HSStyle, Sophistication, and PowerSlim and curvy, the PowerShot ELPH 110 HS is a natural fit for your hand. Easy operability andreliable high-quality performance are reason enough to carry it everywhere, but you&rsquo;ll also love the attention-getting quality of the camera&rsquo;s distinctly sophisticated modern design. The matte finish in a wide range of vivid, highly expressive colors projects your taste and style like a fashion accessory, but the PowerShot ELPH 110 HS has its serious side, too. A 16.1 Megapixel high-sensitivity sensor plus Canon&rsquo;s DIGIC 5 Image Processor deliver impeccable image quality and high-performance features never before possible. Experience Face ID that recognizes and optimizes images of your friends and family, Intelligent IS that creates sharp, steady shots in a wide variety of situations, and stunning Full HD Video. Smart AUTO lives up to its name, letting you shoot anywhere, anytime as the mood strikes, confident that the camera will automatically make your images the best they can be.&nbsp;&nbsp;&nbsp;&nbsp;Canon HS SYSTEMThe Canon HS SYSTEM lets you take bright, clear photos in an even wider range of shooting situations. Beautiful low-light shots are possible with minimal noise and maximum detail in highlight and shadow areas. The system is the result of two technologies brought together in PowerShot cameras: a high-sensitivity imaging sensor, which is able to capture more light; and the DIGIC Image Processor, which actively reduces noise with high-speed image processing. The 16.1 Megapixel CMOS sensor in the PowerShot ELPH 110 HS digital camera incorporates advanced light reception technology that enhances sensitivity. The DIGIC 5 Image Processor provides a major boost in noise reduction, expanding the usable ISO range to an amazing high of ISO 3200. The Canon HS SYSTEM takes the frustration out of low-light shooting, delivering clear, blur-free images.Canon DIGIC 5 Image ProcessorThe latest-generation Canon DIGIC 5 Image Processor brings phenomenal increases in processing speed and power. Improved chip architecture and algorithms deliver greatly expanded functionality with further refinement in image quality. Improved noise reduction produces clearer images when shooting in low light at high ISO speeds. Enhanced i-Contrast performance adjusts differences between light and dark areas to achieve even more natural-looking results. The faster processing speed also results in faster continuous shooting capability while maintaining full image quality. The DIGIC 5 Image Processor also makes possible a new, highly advanced automatic white balance system. Whereas conventional white balance makes an overall adjustment based on a single type of light source, the new Canon Multi-Area White Balance analyzes several areas of the image to determine whether different adjustments are needed, for example, for the main subject and the background.Canon Full HD Video AdvantageIn addition to the Canon HS SYSTEM, the combination of the advanced CMOS sensor and DIGIC 5 Image Processor in the PowerShot ELPH 110 HS makes it possible to shoot crisp, clear high definition video. Imagine the fun and excitement of being able to shoot spectacular 1080p Full HD video that you can later watch on your HDTV or download to your computer to share with family and friends. In addition to being able to shoot Full HD 1080p video at 24* frames per second, the PowerShot ELPH 110 HS can also shoot 720p HD video at 30** frames per second.*Actual frame rate is 23.976 fps.**Actual frame rate is 29.97 fps.Dedicated Movie Button and Optical Zoom for Easy Video CaptureIt&rsquo;s never been easier to shoot videos with a PowerShot digital camera. The PowerShot ELPH 110 HS has a dedicated movie button that lets you start and stop recording instantly. There is no need to go through layers of menus or operate switches or dials to switch to and from video recording mode. The camera is always ready to shoot stills or video whenever you want. And unlike less sophisticated point-and-shoot cameras, the PowerShot ELPH 110 HS lets you use the full range of optical zoom when you&rsquo;re shooting a video.HDTV Playback via HDMI with CEC SupportIt&rsquo;s easy to enjoy and share the videos you shoot with the PowerShot ELPH 110 HS digital camera. Simply connect its HDMI terminal to your HDTV using an HDMI cable. And because the PowerShot ELPH 110 HS supports HDMI-CEC technology, you&rsquo;ll be able to control the playback of your images and videos on any CEC-enabled HDTV using the TV&rsquo;s remote control. (CEC&mdash;Consumer Electronic Control&mdash;is part of the HDMI specification, enabling components in a system to communicate with one another.)iFrameWith the PowerShot ELPH 110 HS, you can also shoot video in the Apple iFrame format, which is a computer-friendly standard that speeds up importing and editing of videos. It keeps file sizes small, making it more convenient to upload or e-mail high-quality videos. The iFrame format enjoys native support in compatible Mac and Windows video applications, making it unnecessary to perform time-consuming and often quality-degrading conversions.Give Your Images a Whole New Perspective5x Optical Zoom with 24mm Wide-Angle LensPhotographers who look for new ways to put excitement into their images will love the PowerShot ELPH 110 HS&rsquo;s 24mm Wide-Angle lens. It captures both depth and expanse to give photos a real sense of scale. Landscapes, group photos, city shots and more all benefit from the extra room the wide-angle lens affords, and the added expanse gives you more to work with in every frame. The 5x Optical Zoom puts real zooming power in your hands&mdash;a rarity in a camera this slim and chic. Images are bright and steady all along the zoom, so feel free to get in close and pull back as your creativity dictates. It also incorporates the latest in Canon UA lens technology, suppressing lens aberration for outstanding image quality throughout the entire zoom range.UA Lens TechnologyPioneered by Canon, UA Lens technology makes possible compact lenses with remarkable optical performance. By using molded glass with an ultra-high refractive index in aspherical lens elements, Canon has succeeded in reducing lens size while significantly reducing image aberrations. Another stellar example of cutting-edge Canon optics, UA Lens technology helps make PowerShot digital cameras pocket-friendly and capable of astounding image quality.PureColor System LCDThe PowerShot ELPH 110 HS digital camera&rsquo;s large and bright 3.0-inch PureColor LCD screen makes it easy toview and frame your shots in high resolution (461,000 dots). Many LCD screens on the market today use a striped arrangement of dots that works great for text and menus, but is not ideal for imagery. The PowerShot ELPH 110 HS digital camera&rsquo;s PureColor System LCD uses a delta arrangement of dots, an arrangement that works better for the organic nature of photos and videos, allowing you to review your images with exceptional clarity with rich, true-to-life color. Moreover, you can view the LCD screen over a surprisingly wide angle&mdash;above, below or to either side&mdash;without color shifts and with minimal reflections. A scratch-proof hard coating and a dust-repellent fluorine coating ensure a durable screen that dependably displays clear, vibrant images.Smart AUTOSmart AUTO for the PowerShot ELPH 110 HS has been significantly expanded, making it easier than ever to capture the sharp, bright, colorful images&mdash;and videos&mdash;you&rsquo;re looking for. By assessing various factors in both the background and the subject, the system recognizes 58 predefined shooting situations and automatically selects the camera settings that will yield the best possible results. Simply frame the shot you want, and in dozens of common or challenging scenarios the camera takes care of the rest. Hard-to-capture shots such as moving subjects, night scenes, backlit subjects, and landscapes at evening or on a bright snowy day are instantly and effortlessly captured as &ldquo;keeper&rdquo; shots. Smart AUTO makes the PowerShot ELPH 110 HS ideal for capturing excellent quality still images and video on the go.Smart AUTOThe camera automatically selects the best shooting settings for optimal quality based on subjects and environmental factors to provide point-and-shoot simplicity.Program&nbsp;The camera automatically and intelligently selects the aperture/shutter speed combination based on the shooting conditions.Movie Digest in 720p HDRecords a video clip in 720p HD before capturing a still image and then combines one day&rsquo;s worth of clips into a video.Stitch Assist&nbsp;Easy-to-use guidelines simplify the shooting of aligned multiple frames that can later be combined (using bundled software) to create panoramic photos.Low Light&nbsp;For high quality image capture in an amazing range of dimly-lit situations.PortraitBrings the subject into focus while beautifully blurring the background.Smart Shutter&nbsp;The camera automatically takes the photo when people smile, wink, or get into frame.High-Speed BurstCaptures rapid action frame by frame, by shooting continuously at a high speed while the shutter&nbsp; is held down.Handheld Night SceneTake clear and steady pictures at night without the use of a tripod.Super Vivid&nbsp;Super Vivid intensifies existing hues, saturating the scene with bright colors.Color AccentChoose to retain a single color in your image while other colors turn monochrome.Color Swap&nbsp;Select a color and replace it with a color you specify for special effects.UnderwaterCapture underwater images with reduced backscatter effect. Optional Underwater Case required.Snow&nbsp;Shoot clear snow scenes without darkened subjects or an unnatural bluish tint.Long ShutterUse to blur moving subjects for artistic effect, ideal for urban night photography.Fisheye EffectNow you can get the fisheye effect &mdash; a classic photographic distortion &mdash; without a fisheye lens.Miniature Effect&nbsp;Give images a miniature look with an effect that emphasizes perspective by blurring the top and bottom of the image.Toy Camera Effect&nbsp;Simulates photos taken with &ldquo;toy&rdquo; or pinhole cameras, darkening the image at the edges to create a vignette effect.MonochromeChoose from three single-tone effects: Black-and-White, Sepia, or Blue.Poster Effect&nbsp;Poster Effect combines several similar shades into one color, turning subtle gradations into eye-catching, scene-popping contrasts.iFrame MovieThe Apple&reg; movie format, iFrame, makes it easier and quicker to import and upload videos while retaining high image quality.Super Slow Motion Movie&nbsp;Record your clips in high speed (approx. 240 fps), and then watch your videos in slow motion.Smooth SkinRemoves dullness, wrinkles, and harsh shadows for beautiful faces.Soft FocusCreates a hazy ambiance that&rsquo;s perfect for portraits and wedding photos.Face IDFace ID is one of the most advanced and exciting new features of the PowerShot ELPH 110 HS, giving you an easy way to improve every shot of the people you love. Simply take a picture of up to 12 faces you would like the camera to register, then enter names and ages. Once a person is registered, the camera will pick him or her out of a group (even against a busy background) and adjust focus and exposure to his or her face, even recognizing faces in profile. Face ID is particularly great for shots of babies and children. The system can pick your baby out of a group of children, focus on your baby when pictured with an adult, and capture her best smile by taking three successive images when the smile is detected. The flash is even disabled so as not to startle the baby and interrupt the moment. Older children in motion are tracked, with focus and exposure continually adjusted with Servo AF; with one shutter press three successive images are captured so the best shot is never missed. And because you&rsquo;ll identify each face you register, Face ID makes it easy to search images by name.&nbsp;Intelligent ISThe latest advance in Canon Optical Image Stabilization technology, Intelligent IS analyzes camera movement and applies the best shake correction method for the shooting situation. For stills, the system automatically selects among Normal, Panning, Macro (Hybrid) and Tripod IS modes. When shooting video, the system automatically selects among Dynamic, Powered, Macro and Tripod IS modes. With Intelligent IS, you can concentrate on image capture, letting the camera make the most effective IS settings to assure the steadiest possible image.NormalCorrects for a wide range of camera movement when shooting stills.PanningPanning motion is detected so that IS does not interfere with desired camera movement.HybridCorrects for shift-type camera shake, which typically occurs in macro (close-up) shooting.DynamicEffective for video shooting at wide-angle focal lengths, eliminating the unwanted shaking that typically occurs while walking.PoweredCompensates for hand movement when shooting video at the telephoto end of the zoom range, where camera shake is magnified.TripodWhen tripod use is detected, the Image Stabilizer is stopped because it is not needed.High-Speed Burst ModeCapture amazing action shots like the pros with the PowerShot ELPH 110 HS camera. Using High-Speed Burst mode,* you can shoot at exceptionally high speeds&mdash;5.8 frames per second. It&rsquo;s a great feature for those who enjoy taking pictures at sporting events. High-Speed Burst is also an excellent way to make sure you capture that perfect instant in time when shooting any moving subject.*Image resolution is 2304 x 1728 pixels when shooting in High-Speed Burst mode.Super Slow MotionThe Super Slow Motion Movie mode* on the PowerShot ELPH 110 HS gives you a fun and useful option when shooting videos. It records video clips at a very high speed&mdash;up to approximately 240 frames per second. When the clips are played at normal speed (30 fps), the action is dramatically slower. This video shooting mode can be used to capture memorable plays at sporting events or to analyze and study motion.*Records 640 x 480 pixels at 120 fps and 320 x 420 pixels at 240 fps.Turn Your Memories into a Highlights Reel with 720p Movie DigestWith the PowerShot ELPH 110 HS digital camera, capturing trips and special occasions with a high-quality video &ldquo;highlights reel&rdquo; is as easy as switching on the Movie Digest feature. When activated, the feature automatically records the four seconds before each still shot as video, then auto-edits them into a short movie. Played back together, the video clips capture the mood and ambiance of special days in a way that&rsquo;s completely different from still images, both documenting the creation of still images and providing a unique stand-alone memory preserver. New with the PowerShot ELPH 110 HS, the video is captured in 720p high definition so that it looks smooth and beautifully detailed when played back on your HDTV. With bundled software ImageBrowser EX, you can easily delete any scenes you don&rsquo;t want.New Smooth Skin and Soft Focus Scene ModesThe PowerShot ELPH 110 HS makes it easier than ever to give your images a professional look with new scene modes that instantly mimic the effects of post-production editing and special filters. Smooth Skin takes away dullness, fine wrinkles and harsh shadows, subtly smoothing and brightening skin for beautiful faces. Smooth Skin Effect can be set to Low, Medium or High; Skin Tone Color can be set to Off, Lighter Skin Tone or Darker Skin Tone to counteract shadows and improve visibility. Soft Focus creates a hazy ambiance that&rsquo;s perfect for nostalgic portraits, romantic shots, wedding photos and more. The mode can be set to Low, Medium or High for just the right effect.What's in the box?PowerShot ELPH 110 HS Digital CameraBattery Pack NB-11LBattery Charger CB-2LDUSB Interface Cable IFC-400PCUWrist Strap WS-800Digita Camera Solution CD-Rom"}