{"asin": "B002IJA1EG", "description": "The future of computer storage is here! The Intel X25-M Mainstream SATA II Solid State Drive (Retail) provides faster disk performance and greater durability than traditional hard drives. Since it stores data using NAND flash memory instead of spinning platters, the X25-M will never keep you waiting for disks to spin up. For further convenience, there are no moving parts to worry about breaking down.X25-M Solid State Drive (Retail)features:80 GB of solid state storage.No moving parts for better reliability and performance.Silent operation.Lower battery consumption than traditional drives.With no moving parts, the X25-M Solid State Drive provides silent and reliable storage.View larger.The Intel SSD Toolbox lets you easily optimize the performance of your drive.View larger.A New Kind of Storage for Faster Data AccessThe X25-M is a SATA II hard drive with a capacity of 80 GB. Additionally, it's in a 2.5-inch form factor that will work anywhere a regular 2.5-inch hard drive does, such as in notebook computers and external enclosures.But don't think that the X25-M is any old drive. Instead of using spinning platters like traditional hard drives, the X25-M is a Solid State Drive (SSD), and it uses flash memory for storage, giving you dramatically faster data access. If you need more disk space, the X25-M also comes in a160 GB version.Performs Faster than Other Solid State DrivesIntel has been making memory chips for decades, and the company's experience is clearly displayed with the X25-M drive, which uses Intel's Multi-Level Cell (MLC) NAND Flash Memory. This delivers better performance than other SSDs, thanks to an advanced architecture and technologies such as Native Command Queuing, which enables up to 32 simultaneous operations. The result is sustained sequential read speeds of up to 250 MBps, sustained sequential write speeds of up to 70 MBps, and a read latency of just 85 microseconds.And thanks to the drive's SATA interface that offers data throughput of up to 3.0 Gbps, you can take advantage of all that speed. What all this means for you is that applications launch instantaneously, files copy in less time, and your overall productivity is increased.Optimize Performance with the Intel SSD ToolboxIntel offers the Intel SSD Toolbox with Intel SSD Optimizer, so you can easily optimize and manage the performance of your drive. Simply download the Intel SSD Toolbox and you'll get a powerful set of management, information, and diagnostic tools to help you maintain performance at \"fresh out-of-the-box\" levels. The Intel SSD Toolbox with Intel SSD Optimizer is specially designed to run on Microsoft Windows 7, and it also works with Microsoft Windows Vista and XP.Higher Reliability and Silent OperationCompared to traditional hard drives, the X25-M is both faster and more durable. Because it doesn't have spinning disks or writing heads, there are fewer parts to fail. It is also less susceptible to vibration and shock and is completely silent. Providing superb reliability, the X25-M is rated at 1.2 million hours mean time before failure (MTBF).Lower Power Consumption is Good for the EnvironmentThe X25-M also consumes far less power than traditional drives, which saves you money and makes this drive a choice. The drive is certified RoHS compliant for its use of non-hazardous materials. Additionally, when it's installed in a laptop, the X25-M will give you better battery life, which means you can work longer on cross-country plane trips.The Intel X25-M Mainstream SATA II Solid State Drive supports Self-Monitoring, Analysis, and Reporting Technology (SMART) commands, as well as additional SSD monitoring.The X25-M is backed by a three-year limited warranty.What's in the BoxIntel X25-M Solid State Drive (SSD), manual, sticker and 3.5\" desktop drive bay adapter, screws and installation guide.", "title": "Intel 80 GB X25M Mainstream SATA II Solid-State Drive (SSD) Retail Package SSDSA2MH080G2R5", "price": 298.99, "imUrl": "http://ecx.images-amazon.com/images/I/41izsd-ow9L._SY300_.jpg", "related": {"also_viewed": ["B007ZWLRSU", "B001F4YIYY", "B004TFTE0O", "B00ECAOZP0", "B002IGT7IU", "B00F0RD3ZM", "B0042MM3LG", "B00A35X6GM", "B006VCP9G6", "B00E3W15P0", "B002IJA1EQ", "B00A1ZTZOG", "B00F0RD5H8", "B00BR0CH1M", "B009SX8WEQ", "B00BQ4F9ZA", "B004UG3YUS", "B004W2JKZI", "B004TFXBMG", "B004U8TBJY", "B00B3WX3WG", "B00FNPCL36", "B00DTPYT78", "B009NHAF06", "B004TFXBPS", "B006VCP8L2", "B00A1ZTZNM", "B00B99JUBQ", "B00I44ES4I", "B009SKB5HA", "B007WT9SU0", "B00GV7V6EA", "B00IF4NGEU", "B004I9J5OG", "B007R67FNA", "B00E3W1726", "B004Q81CKY", "B00FXJWO5C", "B00E3W16OU", "B009NB8WR0", "B00B3X72OU", "B002WE4H8I", "B0093LINVK", "B00DTPYRX4", "B00DTPYSEM", "B00APEG8OI", "B00BQ8RM1A", "B009NB8WRU", "B00F3F381A", "B007GMPZ0A", "B00BQ8RGL6", "B00E3W19MO", "B00746YPQI", "B00IT1WJZQ", "B005BZNDS0", "B0058UUR6E", "B00BP5KOPA"], "buy_after_viewing": ["B00E3W1726", "B00A1ZTZOG", "B00E3W15P0", "B00BQ4F9ZA"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "Internal Solid State Drives"]]}