{"asin": "B00006B9CR", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Input Devices", "Trackballs"]], "description": "Logitech's cordless optical TrackMan lets you work where and how you want with the freedom of a cordless mouse, the comfort of a trackball, and the precision of optical technology. It's Logitech's most advanced trackball finger-operated trackball mouse. Save space and eliminate desktop clutter. Take advantage of extra buttons that help you navigate around Windows and the Web more easily. And with Logitech's patented optical technology, you get virtually maintenance-free precision and smooth tracking.Logitech's patented Optical Marble technology ensures smooth cursor movement, while 27 MHz cordless digital radio technology gives you reliable cordless freedom. The product offers advanced navigation features in a form-fitting, right-handed design. Its special drag-lock functions let you move text and images with ease, while Cruise Control scrolling lets you scroll rapidly through Web pages and documents by merely pressing a button. With conveniently located thumb-operated forward and back buttons, you can easily move through applications and Web pages without having to move the cursor to the browser's onscreen buttons. Two AA batteries (included) keep you powered for six months or more.", "title": "Logitech Cordless Optical Trackman (USB/PS/2)", "price": 432.0, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/417jvRpyYJL._SY300_.jpg", "related": {"also_bought": ["B0043T7FXE", "B001F42MKG", "B000A6PPOK", "B00005853Z", "B002MMY4WY", "B00005NIMJ", "B000Q6UZBM", "B004SUIM4E", "B0050SPZMK", "B000MAFQ20", "B00GXPIFTE", "B004N627KS", "B00427TAIK", "B004M3XDAA", "B00009KH63", "B004GXZ69W", "B000KA7PD0", "B00FOFLMJE", "B0006VJE82", "B004I61N9Y", "B002OOWB3O", "B00DE83RSC", "B000TUK47U", "B000HEW0KW", "B002VR6A9K", "B004E2OP6U", "B002HWRJBM", "B003VAHYNC", "B00DT73FVM", "B007GFYLU2", "B003VAGXWK", "B003AU0FLQ", "B004V94F5C", "B0006HX518", "B006JH8T3S", "B007U5MGDC", "B004MF11MU", "B003TG75EG", "B002NUYTCA", "B003NR57BY"], "bought_together": ["B0043T7FXE", "B000A6PPOK"], "buy_after_viewing": ["B0043T7FXE", "B001F42MKG", "B0050SPZMK", "B002OOWB3O"]}}