{"asin": "B000JV6TQY", "description": "Samsung brings you great flexibility for delivering FREE over-the-air digital television signals to a DTVready television or DTV-capable computer monitors. Award-winning Samsung technology easily tunes and decodes all 18 ATSC Table 3 broadcast formats. With the Samsung DTB-H260F, you can view HDTV, SDTV, and listen to Dolby&#xAE; Digital 2.0 stereo or Dolby&#xAE; Digital 5.1 surround audio through your audio system. Samsung solves output worries with a wide selection of output options including 1080i, 720p or 480p/i DTV formats, and connection options including HDMI (1), Component (1),Composite (1), Audio-Right/Left, Dolby&#xAE; Digital Optical. Attractive styling and affordable pricing make the Samsung DTB-H260F a perfect solution.Feature ListOn-Screen Signal Strength IndicatorHave the ability to view whether or not you are receiving a strong signal which may be affecting the quality of your on-screen imagery.Full GuideTo find your favorite programs or to see what is currently on and/or available, you will have access to a full guideMini GuideFor a short list and not to interfere with current viewing you can utilize the mini guide to check concurrent programming.Intuitive and Iconic MenuSelect the right settings to get the optimal picture.", "title": "Samsung DTBH260F HDTV Terrestrial Receiver", "price": 33.29, "imUrl": "http://ecx.images-amazon.com/images/I/316lUO1Rf8L._SY300_.jpg", "related": {"also_viewed": ["B00G5RXM16", "B00I2ZBD1U", "B00GGVPKKC", "B00BFIJQ10", "B00CM2V0EY", "B002RL8I2W", "B0066O1DI2", "B008RHTXLA", "B0011NM17K", "B004HO58SO", "B001BNT3FS", "B00GOILYB6", "B00EHHPPM0", "B00198MYB0", "B00FOY5PVQ", "B004PAA8XK", "B000TUUC7M", "B00EWPMG38", "B007FEEO3S", "B009GUR2U6", "B001F5889E", "B00JG80TDA", "B00D3UBKMG", "B0090A7MZM", "B004XIB9UA", "B006DQ0QG8", "B00EYO241Q", "B001DT5LII", "B001DVZXC0", "B001R6E8YK", "B00JKU44HQ", "B00FL3324W", "B00IJLLVSM", "B005FPT38A", "B0007MXZB2", "B00J5U4HWS", "B00GAGMWL8", "B0076R7F3U", "B00K7ETHC6", "B00008WAJY", "B001HB4PXE"], "buy_after_viewing": ["B00G5RXM16", "B00I2ZBD1U", "B00GGVPKKC", "B00BFIJQ10"]}, "categories": [["Electronics", "Home Audio", "Stereo Components", "Tuners"]]}