{"asin": "B004TC4TVQ", "description": "Overview:The 4-in-1 stand by Alpatronix is a unique, simple, and practical case that is slim, classy, and fully protective of your precious iPad. Easily installed, this high quality vegan leather case has a soft interior that protects all external surfaces of your iPad such as the screen or the metal shell against all scratches and dings. The external surface is made of a high quality vegan leather that protects against external elements such as rough surfaces, moderate shocks, or stains. All materials have been selected from the highest quality selections and are sure to add a touch of added class and a ton of added protection to your iPad. Whether you are a fan of carbon fiber or classic leather look, our vegan leather material is sure to look like the real thing, without any animals ever suffering for it.Features:- Made of high quality vegan leather. No animals have been harmed in the process of making this case. In fact, the cows watched TV as their humans went to work to make these beautiful cases!- Sleep function (smart cover) will automatically put your iPad to sleep when you close the cover.- Offers full protection all around against scratches or dings. All external iPad ports, buttons, camera, and speakers are completely useable while your iPad is in the case.- Available in Carbon Fiber and Black Leather patterns.", "title": "Protective Case and 4-In-1 Stand with Carbon Fiber print for Apple iPad-1 3G / Wifi (Pearl White)", "price": 13.95, "imUrl": "http://ecx.images-amazon.com/images/I/41VoxD7VNqL._SX300_.jpg", "related": {"also_bought": ["B004J6PI8K", "B004WYA852", "B0013FRNKG", "B008UHK3KM", "B0047DVWLW", "B00D6P52PE", "B009XCCC52", "B00HEYAC44", "B003I4TGDC", "B004N62I0C", "B004N62HZI", "B00BSMJUHS", "B0091DF9CG", "B00CKG61WI", "B005Z20MVU", "B007CKLCSK", "B004RDWVUS", "B00EVQV0DK", "B00F8ARPSM", "B00CB7T52O", "B00GMYQKC0", "B005HMO6A6", "B005Z1ZWEI", "B008UHKTCY", "B00H790VSS", "B005E7KMH0", "B00CZ6D248", "B004SBBD8U"], "bought_together": ["B004WYA852"], "buy_after_viewing": ["B0091DF9CG", "B00CB7T52O", "B007CKLCSK", "B00CZ6D248"]}, "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Cases & Sleeves", "Cases"]]}