{"asin": "B000BUEMOO", "categories": [["Electronics", "Home Audio", "Stereo Components", "Turntables"]], "description": "The first USB turntable that lets you convert your old vinyl collection directly to CD or MP3, the Ion Audio iTTUSB is a must for people who don't want to deal with clumsy adapters or mismatched software when transferring formats. Requiring no special drivers, the turntable comes with Audacity, a recording application that works with both PCs and Macs, as well a trial version of Bias Soundsoap 2 to clean and restore vinyl recordings. As an alternative, the turntable also works with any other software that supports USB audio input sound cards. Once connected, the turntable transfers both 33-1/3 rpm albums and 45 rpm singles to digital formats in mere minutes.The iTTUSB also offers a few hardware extras, such as an adjustable anti-skating control for increased stereo balancing, an adjustable pitch control (+/- 8 percent), and support for high-speed vinyl recording. And thanks to the line-level outputs, you can connect to any home stereo with CD or auxiliary (AUX) inputs--no phono inputs required. The turntable comes with a cartridge and stylus, 45 adapter, and USB cable and is compatible with PCs running Windows 98, 2000, or XP and Macs running OS 9 or greater. All computers must also have at least one available USB 1.1 port.The iTTUSB's master carton measures 20.27 by 6.85 by 17.16 inches (W x H x D) while the turntable itself weighs 7.7 pounds.What's in the BoxTurntable, tonearm counterweight, platter with belt, slipmat, cartridge premounted on headshell, RCA cable, USB cable, software CD-ROM, 45 adapter, quick-start guide, user's manual.", "title": "Ion TTUSB Turntable with USB Record (Discontinued by Manufacturer)", "price": 99.99, "salesRank": {"Electronics": 49774}, "imUrl": "http://ecx.images-amazon.com/images/I/41SjEvpxsFL._SX300_.jpg", "related": {"also_viewed": ["B002GYTPB8", "B000G3FNVM", "B0029QRA1U", "B002YVAT72", "B00032BOLO", "B006ZZUEYQ", "B003TEBZK8", "B003WTMUQ8", "B009Z6N4TO", "B000T5PPQA", "B001ECQ6PG", "B006ZZUDPQ", "B0015HOFZI", "B001727KOY", "B00009V3TU", "B00COC60YC", "B001SKXWKG", "B002QTYVY4", "B002OHE4RM", "B00AOBHDPA", "B000MUDI9S", "B001UJS9EE", "B002S1CJ2Q", "B002GYTPAE", "B00BCA4116", "B0037GTM12", "B00009QORL", "B00AOBMQDY", "B00FFC83VQ", "B00JKRG1ZW", "B004G08OO4", "B00292BREU", "B002PF4YKU", "B00GJAP4MO", "B00840KRDI", "B005A9ZYI4", "B0062IMDBI", "B0000BZHGV", "B0062IMDE0", "B000UVKE2I", "B001R27MKG", "B004V71Z3Y", "B00JKQVG44", "B000V0HU9S", "B001JY67ZS", "B00F0YXHGK", "B000M13DKG", "B001JY9MB4", "B00439QA1C", "B00GA9COMM", "B00CKQOZBM", "B00292BREK"], "buy_after_viewing": ["B002GYTPB8", "B000T5PPQA", "B002GYTPAE", "B000G3FNVM"]}}