{"asin": "B004ZXZK4O", "description": "MediaDevil is the highest-rated and most reviewed screen protector and touch screen stylus brand on Amazon UK (link below). We hope to now achieve the same in the US by providing you with the same high-quality products and caring after-sales support!http://www.amazon.co.uk/shops/mediadevilMediaDevil's Magicscreen screen protector: Matte Clear edition protects your screen from scratches, reduces screen glare, and leaves no markings when removed. It does not reduce the touch sensitivity of the device screen.An essential accessory that is also available in a Crystal Clear (Invisible) edition.PLEASE NOTE:Matte material protectors do produce a slight pixellation of the screen, as this is the natural effect created by the Matte (anti-glare) frosted texture. It is simply an unavoidable 'Law of Physics'.You will see this pixellation on all anti-glare screen protectors from all brands (many of which are noticeably more extreme than ours). Apple's matte screen monitors (and professional television industry monitors) display it also, as it is unavoidable.If you require a perfectly 'crystal clear' screen to enjoy the screen resolution to its full extent, westronglyrecommend purchasing our (glossy surface textured) Crystal Clear edition instead:http://www.amazon.co.uk/gp/product/B004ZXYU8QOur Magicpotion screen cleaning solution can be used to clean your device screen before applying your protector:http://www.amazon.com/gp/product/B008EOJIVGPack Contents:2 x Magicscreen screen protector (FRONT)1 x Microfibre cleaning cloth1 x Smoothing application cardYour satisfaction is really important to us, and we will do our best to help ensure that you are a happy MediaDevil customer.-tt.", "title": "MediaDevil Magicscreen Screen Protector: Matte Clear (Anti-Glare) - Apple iPad 2/3/4 (2nd Generation / 3rd Generation / 4th Generation) (2 x Screen Protectors)", "price": 19.97, "imUrl": "http://ecx.images-amazon.com/images/I/51526MPdTGL._SY300_.jpg", "related": {"also_bought": ["B003VPT5U2", "B009B1XZ6U", "B009XBPYR6", "B00F43MZWO", "B00G9ZVRCA", "B006IJNQTE", "B006IJNR5M", "B004ZXYU8Q", "B009B1XY0W", "B008EOJIVG", "B003VPV9JW", "B002WG8SLS", "B00AAOWYHI", "B009XBPY9Y", "B003WM76RS", "B006IJNQHG", "B007PA1K84", "B006JWR0XS", "B008EOXKXI", "B00G9ZVQ12", "B004R2V1SC", "B006R2OH4A", "B00GCG3O6S", "B007IVW15Q", "B008Y5M2WW", "B007CKLCSK", "B008UHK3KM", "B009B1Y20S", "B0055OVK8M", "B004RDWVUS", "B008THTK52", "B004V4EYPS", "B007IV7KRU", "B00ATM9T2O", "B007BZOGLG", "B004RRU1B0", "B007FXMOV8", "B004R7A9NU", "B0073FE1F0", "B007PRHNHO", "B0054L8MR8", "B0068RKK18", "B0097BEFYA", "B007I5JT4S", "B008ASW57U", "B005Y1CYSQ", "B0059KTEBC", "B009SYZ8OC"], "bought_together": ["B003VPT5U2", "B009B1XZ6U"], "buy_after_viewing": ["B008UHK3KM", "B004ZXYU8Q", "B009XBPYR6", "B009B1XZ6U"]}, "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Screen Protectors"]]}