{"asin": "B00005NZ1M", "description": "When Microsoft releasedNFL Fever 2000on the PC in 1999, it gaveMaddena serious run for its money. It's been a few years, butFeverandMaddenare once again going head-to-head on the Xbox,  and once againFeverproves itself a serious threat to EA's perennial  football powerhouse. That's not to say thatNFL Fever 2002is a perfect  game, because it isn't, but it does offer great graphics, decent AI, and plenty  of bone-crunching gameplay.NFL Fever 2002features several gameplay modes, including practice,  single game, and season, which itself contains a couple of different options,  including dynasty and fantasy challenge.Fever 2002has a full NFL  license and includes all 31 current NFL teams--and 15 fantasy teams--along with  all the current stadiums. Dynasty mode is where most players will find  themselves, as this mode lets you manage all aspects of your team, including  signing and cutting players, negotiating trades, and making sure that your team  comes in under the salary cap.A great feature in dynasty mode is Dynamic Player Performance, which adjusts  players' ratings (which determine how well they play) based on past game  performances. So if you have a second-string running back who rattles off three  or four great games in a row, his rating will increase, which should keep him  performing at that high level. On the flip side, if a player has several poor  games, his rating will decrease.Because it was designed specifically for the Xbox (unlikeMadden NFL  2002, which was ported to the Xbox from the PlayStation2 version),NFL  Fever 2002looks awesome. Player animations are highly detailed, the  stadiums look fantastic, and the weather effects are topnotch. Beyond the  obvious features, though, there are many subtle details that really add to the  experience: the field will get torn up in wet weather, player uniforms will get  stained with dirt, and the crowd will begin to thin out if the game is a  blowout.In terms of gameplay,Fever 2002delivers a solid experience. The AI is  pretty solid, especially on the defensive side, and if you call a perfect game  it's possible to get a shutout against the computer, even on the higher  difficulty settings. On the downside, the computer rarely runs the ball, even  when it has a high-powered running back like Corey Dillon, and AI play calling  is rather suspect at times.Those complaints aside,Fever 2002is a lot of fun. It offers great  graphics, multiplayer is a blast, and the dynasty mode features a good deal of  depth. If you only want one football game,NFL Fever 2002deserves your  consideration.--William HarmsPros:Dynamic Player PerformanceGreat graphicsSolid defensive AICons:Computer rarely runs the ballGameplay a little arcadelike at times", "price": 10.99, "imUrl": "http://ecx.images-amazon.com/images/I/51F8J0V6DRL._SY300_.jpg", "related": {"also_bought": ["B00006F2EE", "B00009YFU5", "B001ELWMHI", "B000066TSF", "B00005QWWF", "B0002IJY2U", "B0000ACP8S", "B00005NZ1J", "B0000C6FJ0", "B000F2JUOK", "B00005O62C", "B00009IM2C", "B000062YIN", "B00020V4NK", "B000HVDEQO", "B002B5FQC4", "B0000690ZV", "B000GXD6CU"], "buy_after_viewing": ["B00009YFU5", "B00006F2EE"]}, "salesRank": {"Video Games": 16842}, "categories": [["Video Games", "More Systems", "Xbox", "Games"]]}