{"asin": "B002JSQ96K", "description": "Take your digital life with you on WD&#x2019;s ultra-portable My Passport Elite drive. It&#x2019;s our smallest drive but it&#x2019;s packed with smart features.   Our smallest portable drive ever &#x2013; WD are experts in portable storage, so they designed a smaller, high-quality integrated USB hard drive inside a premium finished package. Smaller is always better for a portable drive. WD SmartWare - A control center for your drive that gives you the power to:  Protect your data automatically &#x2013; Relax, your data is secure. Automatic, continuous backup will instantly make a second copy whenever you add or change a file. See your backup as it happens &#x2013; Seeing is believing. Visual backup organizes and displays your content into categories and show the progress of your backup. Bring back lost files effortlessly &#x2013; Retrieve your valuable data to its original location whether you&#x2019;ve lost all your data or just overwritten an important file. Take control &#x2013; Customize your backup, set drive security, run diagnostics, manage the power settings, and more from the WD SmartWare control center. Drive lock -- Gain peace of mind knowing that your data is protected from unauthorized access or theft with password protection and military-grade 256-bit hardware-based encryption. Illuminated capacity gauge - Connect the drive to your computer and see at a glance how much space is available on your drive. Grab-and-go USB dock &#x2013; Convenient one-hand connection to your computer. Ready to plug-and-play with Windows PCs &#x2013; if you&#x2019;re a Mac user, check out our Mac version of this product. [link to] USB 2.0 interface - Powered directly from the USB port on your PC. No separate power supply is needed*. * An optional cable is available for the few computers that limit power from the USB port. Planet friendly &#x2013; We designed a small box from recycled materials to minimize waste. We encourage you to recycle it.", "title": "Western Digital My Passport Elite 640 GB USB 2.0 Portable External Hard Drive (Charcoal)", "price": 69.0, "imUrl": "http://ecx.images-amazon.com/images/I/31%2BmT4Wws%2BL._SY300_.jpg", "related": {"also_viewed": ["B006Y5UPZU", "B006Y5UV4U", "B006Y5UV2M", "B007FQNLR6", "B00CGUMVHW", "B00CGUMULO", "B007FQNKRC", "B000ND75C0", "B005J7YCHG", "B006Y5UQ4U", "B00CI3BISU", "B006Y5UQ3Q", "B006Y5UV36", "B00829THSW", "B0062FZ3PY", "B00CGUMVEA", "B006Y5UQ3G", "B00EAS8AA0", "B00CGUMUK0", "B00834SJSK", "B00CI3BLPA", "B00EAS8IYI", "B00EAYFX54", "B00EAS8I3O", "B006Y5UV4A", "B00CGUMUGE", "B00829THEG", "B007FQNLOY", "B009T0FGRE", "B0085JRRAY", "B00E83X9P8", "B005J7YA4G", "B0041OSQ9S", "B002KG2LOA", "B00CGUMUIC", "B002R9CQYK", "B00EAS8MWQ", "B00J773SYC", "B00BOHNZ0A", "B00H4XH5FY", "B00829THTG", "B001FWCDQG", "B009ZEATVM", "B00CGUMSZC", "B008S4TGDM", "B006Y5UV3G", "B002KCA85I", "B00ESUIX4S", "B003MVMTDA", "B00EY5APPC", "B00CO1I2FS", "B005J7YA64", "B00CGUMSY8", "B004H1W0HO", "B00CGUMR30"], "buy_after_viewing": ["B00E83X9P8", "B00EAS8M0S", "B00EAS8MWQ", "B003LSTD38"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]]}