{"asin": "B0013FW8XS", "description": "We recently reviewed theNETGEAR ReadyNAS NV+, a network attached storage device, or NAS, that's built for small offices and work groups. We were so impressed with its performance that we decided to test NETGEAR's home-user model, the ReadyNAS Duo, to see if it measures up to its bigger sibling's performance..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1.3em; } td.think { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; border-bottom: 1px dotted #000000; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; } td.glance { height: 100%; background: #9DC4D8; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-top: 10px; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; }The ReadyNAS Duo can serve as a digital media server for your home.View larger.We're happy to report that the ReadyNAS Duo rivals the NV+, but at a fraction of the price. Built for the home-user and home office, this compact, powerful, and surprisingly quiet and energy-efficient device has just about everything you need to keep your digital media easily accessible and protected.Unfortunately we don't have the space to describe everything we admire about this outstanding NAS device. What we can describe are several features that stood out, including its compact design and easy set-up, quiet and energy-efficient performance, web-, print-server and advanced media streaming features, and its outstanding data protection capabilities. (Our review of theReadyNAS NV+covered the system's RAID array functionality, as well several other features that the Duo shares.)In short, this is an advanced NAS device that anyone who is serious about digital media should consider for their home network.Easy Set-Up and Compact DesignIn addition to this 500 GB version, the NETGEAR ReadyNAS Duo comes with750 GB, and1 TBcapacities. The models share identical features, with the difference being the amount of storage in each. The version we tested, the RND2150, included a single 500 GB SATA drive in a hot-swappable carrier with room for a second drive alongside it. (Each of the models ships with a single hard disk drive and can be easily upgraded for data redundancy by installing a second compatible disk drive of equal or higher capacity. The new disk drive will automatically mirror the first drive.)While the initial set-up with the system's extremely intuitive interface took less than 20 minutes, getting the information for the more advanced-user procedures took a bit more time. NETGEAR does not ship the Duo with extensive user guides. Instead, users are directed to ReadyNAS's online community forum (www.readynas.com) for advanced set-up procedures and add-ons. While navigating the forum for information can be time consuming, the site is constantly updated by NETGEAR developers and community members. We found information easy to locate and well presented.Like the NV+, users do not need an technical background to configure the Duo. However, a knowledge of network basics, and an ability to search for and install basic files is a must. And anyone with even a modicum of networking experience will find the Duo a breeze to work with.The Duo is smaller than a breadbox and is constructed with a sturdy metal chassis and door. It includes a Gigabit Ethernet port and two USB 2.0 ports on the back, and an extra USB port at the front along with a \"backup\" button.With two drive bays, you can easily upgrade the Duo for data redundancy.View larger.The Duo is designed to work with virtually any USB storage device and USB printer. We began by plugging a flash drive, external hard drive and a printer directly into the Duo. In each case, the devices appeared as shared drives on our network computers, and the printer connected to the device without a hitch, giving the networked computers instant printing abilities.Overall Set-Up and Design Grade: A-We would prefer to have more documentation included with the hardware, but the online forum is an excellent source of information.Quiet and Energy-Efficient PerformanceA huge plus for us is the ReadyNAS Duo's quiet performance. A fan sits at the back of the device, softly humming. Although we disagree with the NETGEAR marketing materials and wouldn't sleep with the Duo, we wouldn't hesitate to set it alongside a home theater system, or in another common area. Compared to many other NAS devices, the ReadyNAS Duo is as quiet and unobtrusive as they come.In an idle state, our single-disk Duo consumes only 27 Watts of power (or about 35 Watts with two drives installed), and a bit more than that with disk activity. In disk spin-down mode, power consumption goes down to a mere 12 Watts. This is a huge savings when compared to the 100 Watts or more from most computers with comparable storage and RAID abilities.The Duo also lets you schedule partial or complete shut downs for additional efficiencies. So if you plan to use the device as your primary digital media server or for scheduled back ups of your data, these energy savings will quickly add up.Overall Power Performance and Noise-Level Grade: AWhat a relief to keep our carbon print (and electricity bills) low--quietly and unobtrusively.Web Server and Advanced Media Streaming FeaturesOur primary reason for wanting the Duo was to serve our digital media from a single source and reduce the work load of our personal computers. With the Duo, you can kiss goodbye the need to keep your computers running when you want to stream media files. The Duo can connect via your network to such devices as the NETGEAR EVA8000, Sonos Digital Music System, Logitech Squeezebox, Apple iTunes clients, Sony Playstation 3 and Microsoft Xbox 360. In fact, it will work with just about any DLNA-compliant device.Once we loaded our entire music collection onto the server and launched the Duo's built-in iTunes server, our music was immediately available through iTunes on our personal computers. But what really made us smile was that our digital music became instantly available through our Logitech Squeezbox player, bypassing our computers entirely. This means that we now have 24/7 wireless access to our entire digital music collection without having to turn on our computers. On the down side, because the Duo's SlimServer add-on does not offer the software's most recent updates, functionality is slightly compromised, but the advantages of instant, uninterrupted access to our music library far outweighs those inconveniences.The ReadyNAS Duo can serve files to all your computers and compatible media players in your home.We were also able to access our personal video files seamlessly through our networked computers. While we found performance to be virtually indistinguishable from playing the files directly on our hard drives, if we were streaming HD video over our wireless network we would have needed to use Wireless-N to ensure steady performance. (If you're looking to do this NETGEAR recommends a purpose-built product called the 5GHz Wireless-N Bridge Kit, or one of their 200MB Powerline Network Adapters.) We also found that editing large raw video files was best accomplished directly off our local hard drive and uploading the edited files to the Duo, but this was more a function of our network connections than it was with the Duo's performance.NETGEAR's FrontView web-based control panel makes configuration and administration simple.View larger.Another nice touch is the Duo's Web server capability. With about 20 minutes of configuration time, you can serve your own personal Web Site or blog. Set-up was much easier and quicker than uploading to a remote hosting site. Obviously, if you have visions of launching the next hot social network site, neither the Duo (or your Internet connection) will be able to handle the traffic. But for your own Web site or personal blog, it will stand up nicely.Overall Web Server and Media Streaming Grade: B+Once ReadyNAS is able to update firmware concurrently with the media device updates, you'll never need a computer to serve your media files again.Advanced Data ProtectionWhat truly allows the Duo to live up to its \"advanced NAS\" moniker is it wealth of data protection features, especially its X-RAID technology, \"Continuous Data Protection or CDP,\" and its scheduled back up abilities.Just add a second 500 GB disk drive into the empty bay, and the ReadyNAS Duo will automatically build a mirror of the first drive by copying every byte from the first drive to the second one. In case of any hard drive failure, the data is protected. We had a SATA 500GB drive on hand, so we tried this. It was as easy as securing the drive with four screws onto the carrier and plugging the drive in. The data mirroring is taken care of automatically on the fly by the unique X-RAID.ReadyNAS Duo also includes a feature we're enthralled with called \"Shadow\" that not only backs up folders and files every time you save them on your computer, but also gives you the ability to save and revert to previous versions of the files. If your local file is lost or corrupted, you simply right click on the back-up file on the Duo to restore it to its original location. Every user on our network accessed this feature without a glitch. As featured on the Duo, CDP is a powerful way to keep your files protected.And to keep the files on the Duo protected, we scheduled back-ups to a connected external USB drive. The Duo flawlessly performed a full back up the first time, and incremental back ups thereafter. And a convenient \"back-up button\" located on the front of the device lets you back up your entire system, or parts of it, with a single click. With the X-RAID and the backup features provided by the Duo, you'll never have an excuse to lose a byte of data again.Overall Data Protection Grade: AWith the Duo, we will have to work hard to ever lose data again.ConclusionsThe ReadyNAS Duo is a powerful, attractive, and flexible NAS device that is great for a home network. It offers much of the functionality of a dedicated server, but since set up is mostly plug-and-play, it does not require a dedicated IT personnel to manage. As noted, the manual does not give all the answers. Fortunately, the strong online community and Web forums offer excellent support and services. And finally, the ReadyNAS Duo is backed by an industry-leading 5-year warranty, so you can rest assured that you'll be protected should anything go wrong.What's in the BoxReadyNAS Duo with 500 GB hard disk drive, two hard disk trays, quick installation guide, warranty card, power adapter, power cable, Ethernet cable, ReadyNAS Installation CD and Discovery Utility, and NTI Shadow for ReadyNAS for Windows and Macintosh.", "title": "NETGEAR ReadyNAS Duo 2-Bay 500 GB (1 x 500 GB) Network Attached Storage RND2150", "price": 399.0, "imUrl": "http://ecx.images-amazon.com/images/I/51-Ouf24A9L._SX300_.jpg", "related": {"also_viewed": ["B00BNI4A90", "B0063E3ZPO", "B00BNI4BE4", "B00BNI4CVG", "B00BNI4BSK", "B00BNI4AWM", "B006HTAB6G", "B00BNI4CAM", "B00BO0MFXU", "B00BNI4DR4", "B006KSLI0W", "B00BNI4EL4", "B00BO0MG02", "B005YW7OLM", "B00DW1UNS8", "B00DR7END8", "B007KWLXRK", "B00CRB9CK4", "B007JLDTRY", "B008DWAGPG", "B004UBU3SY", "B00FY6RW2Y", "B005TJLU24", "B00G9X5NFO", "B0048TWIX6", "B006427IY4", "B00FY6DV3S", "B00G9X5N18", "B002O3W2OI", "B0040NPGP2", "B00BNI4D9W", "B0048L62I6", "B00I2P53NY", "B008JJLXO6", "B00BO0MFXK", "B008JJLZ7G", "B00I2P82CS", "B008U69OA8", "B00CDG2XHC", "B00EVVGAD0", "B005EJLFNI", "B00CO0DE0W", "B00HC970B4", "B004JQNKVC", "B00BNI4KEU", "B00DR7ENQA", "B00G2HZNXO", "B00CTL9B58", "B00BNI4EYG", "B00CO0DH6S", "B00G9X5N2W", "B00B5Q7B78", "B00I2P56FE", "B00I2P57TO", "B004L87XAC", "B00EVVGAC6"], "buy_after_viewing": ["B008JJLZ7G", "B00BNI4A90", "B008JJLW4M", "B008YAHW6I"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "Network Attached Storage"]]}