{"asin": "B00EYTI0TG", "categories": [["Electronics", "Computers & Accessories", "Laptops"]], "description": "Chromebooks are a unique class of mobile computing devices, designed specifically for Web-based tasks. They differ from traditional laptops in a few important ways:Chromebooks run Web-based apps, not traditional PC applications.Chromebooks are designed to be connected to the Internet. You can create documents and spreadsheets or edit photos on a Chromebook using Google apps designed for these purposes. The Chrome operating system will not load and run traditional PC software like Microsoft Office and Adobe Photoshop. However, files created in these applications can be viewed and edited using Google apps on your Chromebook or cloud-based applications like Microsoft's Office web apps.You store your files in the Cloud, not on the machine.To help make them thin and light, Chromebooks are built without large-capacity drives. So instead of storing your documents, videos, and photos on your computer, you save them to Google Drive (Google's Cloud-based storage service). Your files are password-protected and secure, and you can access them anywhere there's an Internet connection. If you know you'll want access to a file or photo offline, however, you can easily save it to the built-in solid-state drive.Continually updated, always new, the Acer C7 Chromebook keeps getting better and better. It starts in seconds, has virus protection built in, and runs your favorite Google apps plus thousands more. At about an inch thin and 3 lbs. light, this Chromebook goes wherever you go and keeps your files safe and secure in the cloud.Key Features11.6\" HD Widescreen CineCrystal&trade; LED-backlit DisplayIntel&reg; Celeron&reg; Processor 1007U(1.5GHz, 2MB L3 cache)Google Chrome Operating System16GB SSD Drive2GB DDR3 MemoryIntel&reg; HD Graphicswith 128MB of dedicated system memory802.11a/b/g/n Wireless LANBuilt-in HD WebcamTwo built-in stereo speakers3- USB 2.0 Ports1- HDMI&trade; PortFull-size Acer FineTip KeyboardMulti-Gesture Touchpad4-cell Li-ion Battery3.05 lbs.| 1.38 kg(system unit only)Learn MoreAlways NewStart in seconds and have that new computer feeling -- every time. Chromebook's cloud-based Chrome OS and built-in virus protection refresh on reboot. No updates to track, no discs to insert, and backups are automatic, too. Unlike other computers, Chromebooks get better with age. Plus, Chrome OS's intuitive interface makes it all so simple.Always AppsChromebooks come with popular Google products built in. Play and work out of the box with Google's Search, Gmail, Talk and YouTube&trade;. Create documents, spreadsheets, presentations and drawings with apps like Google Docs, Zoho and SlideRocket. Get 100 GB of free storage on Google Drive for two years. Video chat with up to nine friends using Google+ Hangouts.Always HDThe Acer C7 Chromebook's 11.6\" HD screen energizes your videos, pictures and web content. Crisp resolution brings family closer during video chats, and the HD webcam presents you at your best, too. Images are crystal clear on HD devices like monitors, projectors and TVs via the HMDI&reg; port, and connect as you please with 3 USB ports plus VGA.Always SimpleChromebooks require almost no setup, so you can go from unboxing to doing in minutes. Tasks are easy using the extra-large, button-free touchpad. Stay online with the Acer C7 Chromebook's convenient and reliable wireless. With your Chromebook, you can even get online at 10,000 feet with 12 free in-air Internet passes.1Work from your favorite coffee shop, browse the Web at the airport or wherever you are with up to 4 hours of cord-free battery life, you can get more done in your day.1 Your Chromebook comes with 12 free Gogo&reg; in-air Internet passes (estimated $150 value, redeemable for two years after Chromebook purchase) usable on continental U.S. flights of participating airlines.", "title": "Acer C710-2834 11.6-Inch Chromebook (Iron Gray)", "price": 214.99, "imUrl": "http://ecx.images-amazon.com/images/I/41Y9LEYVaOL._SX300_.jpg", "brand": "Acer", "related": {"also_bought": ["B00CD8ADKO", "B00DUN2PBQ", "B001ENYQT8", "B008713GPA", "B00GH3NBSM", "B00GH2VG4E", "B00GH2T5HE", "B00GRS89MK", "B00J0825JC", "B00GH39GLS", "B00FNPD1VW", "B00E3EALJO", "B00DNGRL82", "B00DUGZFA6", "B00CHYKVPQ", "B00EKE4Z1M", "B00D6WF80G", "B007582KGM", "B00J0825N8", "B005LDLP8W", "B004NY9UV4", "B009LL9VDG", "B00IJD3QTC", "B005F1A12G", "B00J8DL6UI", "B005VP9M8A", "B00D02AGU4", "B00FJ9F50C", "B001KMRN0M", "B00BC0WNUC", "B0083LOX2Y", "B00E89FFO0", "B00FL9ECK4", "B00A020P2G", "B00A29WCA0", "B0034TZONM", "B00FNKAG4W", "B003EKIS4S", "B001FWYGJS", "B00GM7Z8F2"], "bought_together": ["B00CD8ADKO"], "buy_after_viewing": ["B00FNPD1VW", "B00GZ1GV3I", "B00CD8ADKO", "B009LL9VDG"]}}