{"asin": "B0017H4G0A", "description": "Got a lot of music and videos on your iPod? The rechargeable Kensington Battery Pack and Charger for iPhone and iPod provides a go-anywhere boost of juice so that the music and videos can keep playing. Simply connect the lightweight Battery Pack and Charger to your laptop or notebook computer's USB port to recharge it, and you're ready to give your PDA, cell phone, iPod, iPhone, or other mobile devices the power boost it needs.A go-anywhere, backup battery pack so that the music and videos can keep playing.LED battery meter displays remaining power level.Charge up and rock out.FeaturesRechargeable battery pack extends playing time up to 100 hours of music*; 21 hours of video*; 6 hours of talk**.AC power adapter with USB allows you to recharge your battery pack.Includes a dock connector to power and charge your iPhone and iPod.Included mini-USB cable powers and charges other mobile devices, such as cell phones, PDAs, and more.LED battery meter displays remaining power level.High-capacity, rechargeable Lithium-Ion polymer battery pack increases energy efficiency.* 3rd generation iPod nano** iPhoneWarrantyBattery Pack and Charger for iPhone and iPod is backed by the Kensington 2-Year warranty.What's in the BoxBattery Pack, AC power plug, USB Mini Cable and 30pin iPod/iPhone CableLearn More About Universal Power AdaptersUniversal Power Adapters are a convenient choice for households and businesses that have multiple brands of laptops/netbooks. More compact and portable than standard OEM bricks, Kensington Universal Power Adapters can be shared between Users of different laptop brands simply by exchanging the tips included in the packaging. Also, many of Kensington&rsquo;s Universal Power Adapters offer additional functionality over standard OEM bricks by including a USB port to allow for charging peripheral devices (i.e. Smart Phone, MP3 Player, Personal Gaming Device) while also charging/powering your notebook.Kensington&rsquo;s Universal Power Adapters are a popular replacement to lost or broken OEM adapters.&nbsp; But most often, users enjoy the convenience of having an additional Universal Power Adapter to keep in their travel cases for use on the road.", "title": "Kensington Battery Pack and Charger for iPod; iPhone 1G, 3G", "price": 29.95, "imUrl": "http://ecx.images-amazon.com/images/I/41nTytr5sCL._SY300_.jpg", "related": {"also_viewed": ["B005X1Y7I2", "B009USAJCC", "B003SE6LE4", "B00D5T3QK4", "B005NGLTZQ", "B00EF1OGOG"], "buy_after_viewing": ["B00AAP2U4Y", "B005X1Y7I2", "B009USAJCC", "B0013G8PTS"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Chargers", "Battery Packs"]]}