{"asin": "B002I0JFN8", "description": "Alan Wake, developed by Remedy Entertainment for the Xbox 360, is psychological action thriller that incorporates the elements of a TV show with the interactivity of a video game for a uniquely immersive experience. A suspenseful story told in successive episodes, this release will treat players to top-notch graphics that give the game a stunning cinematic look..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; } img.withlink {border:1px #777777 solid;}Search for clues to figure out the mystery.View larger.Alan Wake slowly realizes that his nightmares are coming true.View larger.Alan Wake Xbox LIVE Bright Falls ThemeView larger.You'll be able to freely roam the town of Bright Falls.View larger.High definition graphics and lighting effects make for a spectacular looking game.View larger.Avatar T-shirt: &quot;I Am Awake&quot;View larger.OverviewIn this long-awaited exclusive Xbox 360&#174; title, fill the shoes of one Alan Wake, a man who makes his living from the terror of others as a best-selling suspense novelist. Trapped in the deceptively peaceful Washington town of Bright Falls, where he came to escape the trauma of losing his fianc&#233;e, Alan must piece together a mystery to prevent himself from being trapped inside a nightmarish world forever.Limited Collectors EditionHardbound in quality linen, the packaging is designed to resemble a hardcover book and will include:Game Disc in box with unique artExclusive In-Game Audio Commentary and Hints by Remedy&ldquo;The Alan Wake Files&rdquo; &ndash; a 144pg book that includes a short story written by Alan Wake and compiles the FBI dossiers investigating the events in Bright FallsExclusive Xbox bonus disc with special content:Exclusive Xbox Theme & AvatarPDLC #1 TokenVideo Documentaries/Behind the Scenes:The Theme of Alan WakeThe World of Bright FallsThe People of Bright FallsAlan&rsquo;s MissionsExclusive Audio Disc with Soundtrack and ScoreFeaturesIntense psychological thriller: Alan Wake delivers a deeply psychological and finely crafted plot that raises the bar for storytelling in video games. The riveting story of Alan Wake is propelled by a movie-like atmosphere, compelling situations, memorable characters, and real-time pacing. Remedy has a record of creating and developing games with unique cinematic presentation and exceptionally high production values. Preorder Alan Wake today to obtain your Exclusive BonusLight as a combat element: As Wake journeys deeper into the mystery of Bright Falls, the shadows close in around him. When darkness descends, light becomes his only ally as he fights his way to daybreak. This poses a severe problem for Alan Wake since his enemies seemingly gain strength from the shadows, and before long, light itself becomes his greatest ally. Players must skillfully combine their use of light with more conventional weapons to stand a chance.Realistic, interactive environment: Set in the town of Bright Falls, the hyper-detailed environments of the Pacific Northwest play an important role, as even the change in daylight and weather will profoundly affect the characters and enemies in Alan Wake. The game&#8217;s advanced rendering engine provides amazingly realistic environments that bring this world to detailed life&#8211;from the lush forest of evergreen trees to the quaint small-town buildings and streets. The world of Alan Wake is alive and real.Episodic narrative: The mission-based structure of Alan Wake creates an episodic narrative similar to a deeply structured dramatic television series, such as LOST, Twin Peaks and X-Files. As the episodes progress, gameplay evolves to introduce new elements and characters, escalating the level of threat and action in the game.Pre-Order informationPreorder Alan Wake today to obtain your Exclusive Bonus Content, which includes:Avatar T-shirt: &#8220;I Am Awake&#8221;Alan Wake Xbox LIVE Bright Falls ThemeInsider Video", "price": 79.99, "imUrl": "http://ecx.images-amazon.com/images/I/51B%2BE21D27L._SY300_.jpg", "related": {"also_bought": ["B00KVQ78B2", "030746654X", "B00KVRK39A", "B0016BTNTQ", "B003UZ49PY", "B007T86T4C", "B002V16T0Q", "B0067KR316", "B000HCQJTC", "B0085O6XHC", "0744015170", "B00A7QA0NO", "B00AA4FDT4", "B0053BSN82", "B007P0X7IA", "B000B6ML1Y", "B00795XGL4", "B002WSR8BC", "B002I0HEZ4", "B005EZ5GNW", "B002I0H7U6", "074401493X", "B0050SYEYK", "B00GV4V8YQ", "B003O6G718", "B000XYFY3Q", "B000XJO7A2", "B00ARCWQQM", "B0019SY1D4", "B0014ET6EM", "B00AYABWYO", "B0041OWQUI", "B00D6P9IC2", "B0002A2S26", "B003IT6E8C", "B005PSTTFE", "B001CH9ISA", "B001C3N0NS", "B008E6ZXRM", "B00FRESMZE", "B00DYDE0X8", "B002I0HCVK", "B000CBVC0Y", "B001TOMQT4", "B004XIQMS4", "B0009SQFHA", "B000F0UT2Y", "B0053OOEAA", "B00BG6ZHK0", "B000QW9D14", "B003ESDQW4", "0804161607", "B00DYAQHTQ", "B0050SYZS0", "B006JKASCK", "B003YMV2G2", "B00CLF811W", "B00000K1VE", "0804162727", "B0009VXAM0", "B00D6P9I4K", "B00319DX4W", "B000K8ZTK8", "B001TOQ8MU", "B001NX4DUQ", "B003O6E6SO", "B005N4HBE6", "1781164266", "B00B5XAKSI", "B005TH6BD4", "0744014603", "B000HE9LL8", "B009PJ9L3O", "B002I0H1J8", "B005VBVQAG", "B008GUBTX8", "B004YVC1F8", "B009LWQ8EU", "B0014CFO4K", "B00FDQQD6Q", "B00BORFD9Q", "B00019HNNC", "B00B3PEWQE", "B0065NP6NC", "B0050SWMN0", "B000R0PLK2", "B0050SYAQ2", "B00B2QL2Y4", "B008E6ZXTA", "B00BY0G0YU", "B000FQBPCQ", "B0050SXCQ6", "B00309U0M6", "B000R0URCE", "1616550414", "B0009XBWY6", "B002I0HBZW", "1595829946"], "bought_together": ["B0016BTNTQ"], "buy_after_viewing": ["B004NSVF68", "B004NRN5DU", "B003O6EB70", "B004FSE52C"]}, "salesRank": {"Video Games": 14450}, "categories": [["Video Games", "Xbox 360", "Games"]]}