{"asin": "B0036WT1WC", "description": "bd550LGOpen up a new world of entertainment with LG&rsquo;s BD550 Network Blu-Ray Disc&trade; Player. Whether it&rsquo;s the newest Blu-Ray Disc&trade; or an up-scaled DVD, this makes sure you see it all in the best possible Full HD 1080p video with digital sound. Plus, Internet access brings NetCast&trade; to your television, letting you stream movies, TV shows and more.Innovative FeaturesEntertainment On TapThe end of \"there&rsquo;s nothing on.\" NetCast&trade; Entertainment Access lets you stream instant, and virtually endless, entertainment from Netflix&reg;, Vudu&trade;, CinemaNow&trade;, Pandora&reg;, YouTube&trade;, Picasa&trade; and AccuWeather&reg; direct to your TV from the Internet- no computer required. (Learn more)Enjoy It at It's BestMake the most of your HDTV. Blu-Ray Disc&trade; playback delivers exceptional Full 1080p video performance.Making Old Just Like NewNo need to go out and replace your old DVD collection. Even they look better on Blu-Ray. Standard DVD Up-Scaling delivers exceptional image quality from standard DVDs with 1080p Up-Scaling via HDMI&trade; output. (Learn more)Don&rsquo;t just hear it. Feel it.Great picture needs great sound. Get Superior Audio Performance that supports surround sound up to 7.1 channels with Dolby&reg; Digital Plus, Dolby&reg; TrueHD and dts-HD Advanced Digital Out technologies. (Learn more)Don&rsquo;t Wait To WatchA quick-opening tray- ready to play before you hit the couch.Memories on the big screenWant to view a highlight reel of the family vacation in the comfort of your living room? USB Media Host lets you view family photos, and listen to music from USB storage devices. (Learn more)All In OneHaving a hard time keeping track of your remotes? With SIMPLINK&trade;, all your LG devices can be controlled with just one remote. (Learn more)Learn MoreNetcast EntertainmentNow buying a Blu-ray player from LG can also mean getting access to virtually endless entertainment and services from the Internet. Want to watch your favorite action film? If you have an LG Network Blu-Ray Disc&trade; Player with NetCast&trade; Entertainment Access and an Internet connection, select an onscreen service and you&rsquo;ll be enjoying it in moments. Tapping into virtually endless entertainment from the Internet no longer requires a computer or messy wires. This is the future of entertainment, and it&rsquo;s available now with LG.Roxio CinemaNow&trade;Now Hollywood&rsquo;s latest hits can be viewed any time you want. With CinemaNow&trade;, LG consumers can get instant access to pay-per-view movies from major studios directly to any LG Network Blu-Ray Disc&trade; Player. Find major release titles, along with broadcast and cable television programs. The entire premium content catalog can be browsed directly and selections can be watched instantly. CinemaNow&trade; and LG have redefined what can be expected of digitally available entertainment.Netflix&reg;Make the most of the extensive offerings on Netflix&reg;. Users with a subscription can sit back and enjoy unlimited instant access to over 12,000 Netflix&reg; movies and TV episodes* streamed directly to their TV set. Most movies and TV episodes appear in standard definition and many selections are not new releases.Netflix&reg; subscription required and sold separately.YouTube&trade;Now you can watch everything on YouTube&trade; right in your living room. Blu-ray players with NetCast&trade; give you unlimited, direct access to the millions of Web videos available through YouTube&trade;, whenever you want them. All you need is an active Internet connection. Watch that one fellow making a fool of himself over and over again.Vudu&trade;If you want major studio releases in Full HD 1080p and Dolby&reg; Digital Plus sound, Vudu&trade; is the only place you&rsquo;ll find it. With 20,000 HD titles available, and 2,000 in Blu-ray-quality HDX format, there&rsquo;s no better source for streaming HD movies on NetCast&trade;.Pandora&reg;Listen to a radio station made just for you. By entering artist or song information, Pandora&reg; will generate a playlist of similar recommendations. Your new favorite song is waiting.Picasa&trade;Edit digital photos so they look their best when shared on your television screen, and create galleries and slideshows for easy organization any time you want to enjoy them.Accuweather&reg;Get up to the minute weather updates, plus forecast information to help plan ahead.Standard DVD Up-ScalingIt's not just Blu-ray discs that look great on a Blu-ray player. Standard DVD Up-Scaling delivers exceptional image quality from standard DVDs to near full HD picture quality. That means even your older movies and shows look better on an LG Blu-ray player.Superior Audio PerformanceBlu-Ray lets you enjoy the best sound available from your movies and shows. Supports surround sound up to 7.1 channels with Dolby&reg; Digital Plus, Dolby&reg; TrueHD and dts-HD Advanced Digital Out technologies.USB 2.0 Media HostBring your digital library to life on your television with USB 2.0 Media Host. View family photos, watch videos and listen to music from USB storage devices.SimpLink&trade;Are your remote controls taking over the living room?&nbsp; Now with SimpLink&trade;, you can easily set up and control all of your HDMI&trade; connected LG devices with just one remote.", "title": "LG BD550 Network Blu-ray Disc Player (2010 Model)", "price": 5.99, "imUrl": "http://ecx.images-amazon.com/images/I/31-aBC7nEyL._SY300_.jpg", "related": {"also_viewed": ["B00KB9VBCQ", "B004MSGEOC", "B00G4TTQQK", "B00793MIJM", "B00400NL02", "B00803FNAG", "B00F9YYHW4", "B00ABU7Y26", "B00IAELTK8", "B00BD7UVKI", "B00IAELTKI", "B00BD7UVO4", "B00793MIGK", "B003IVOCR0", "B00BD7UVHG", "B00I83T0DO", "B00FF9SVWA", "B004OF9XMI", "B005DII6DC", "B00F9YYHSI", "B0076R7FFI", "B00ICDAAX4", "B009V03IIQ", "B009YWN926", "B00EUY59Z8", "B006U1YUZE", "B009H5RFF2", "B00C0R46J2", "B00B9JR5EU", "B0036WT1V8", "B005NEZDUA", "B001V9LA44", "B0076R7F62", "B00CUL7V90", "B004ZP756S", "B00IBR189Q", "B00BQ3EGPU"], "buy_after_viewing": ["B00BD7UVO4", "B003L1ZYYM", "B00AWKC0JM", "B00EUY59Z8", "B00EUY59Z8"]}, "categories": [["Electronics", "Television & Video", "Blu-ray Players & Recorders", "Blu-ray Players"]]}