{"asin": "B000NVR9SM", "description": "From the ManufacturerKeep an Eye on Your PetsAlways feel close to your pets, whether at work or on vacation. Did the walker show up as promised? Is the dog sleeping on the sofa? Is the cat scratching your new leather chair? You'll know instantly with the Panasonic PetCam.See There When You Can't Be TherePlace this plug-and-play camera in your home, office, vacation home, or almost anywhere else you'd like to keep an eye on things, with no PC required at the location. The camera can be viewed and controlled from a standard Web browser, video display, or even a compatible cell phone or PDA, with no additional software required. All of the other required software, including control software (TCP/UDP) and e-mail software (SMTP), is already inside the camera.Control the Camera RemotelyUsing a standard Web browser, video display, or even a compatible cell phone or PDA, you can control the movement of the camera. There is Pan (left &amp; right) movement and Tilt (up &amp; down) movement available. You can also assign a \"Home Position\" that allows you to return the camera to a pre-designated shooting position. Up to eight shooting positions can be registered in advance, so you can aim the camera exactly where you want it. You can also click on the part of the image you want to see, and automatically bring that part to the center of the screen.When You Need a Little PrivacyWith the built-in Privacy mode, your privacy is protected by simply pressing a button. An indicator on the front of the camera turns red, and you know at a glance that the camera is now only accessible by you. The camera can also be set up to show a green light when the camera is being accessed.Sensor RecordingWith the built-in heat sensor, the camera can be set to record and/or notify you by email when someone enters the room. It can even automatically move to a preset location when triggered, just in case someone was viewing a different part of the room.Record Only What You Want to RecordThe camera can be set to automatically record video at certain times and certain speeds.Create Your Own Free Web AddressThe free Viewnetcam service allows you to create a personal Web address (e.g. http://bob.viewnetcam.com) so you can view your camera's live images on the Internet. Access your Panasonic Network Camera live from virtually any Internet connection point around the world! Your Web browser is the only software you'll need. Here's how the camera and service works: Special software embedded within your Panasonic Network Camera gives your camera the ability to locate your unique Internet address. No matter what kind of Internet connection you have or which Internet provider you use, the Viewnetcam.com service will keep your camera's Internet address permanent.Features802.11g/b WirelessPan/Tilt/Digital Zoom with PresetsSimultaneous MPEG-4 and JPEG1 Lux Color Night View ModeUp to 30 Frames per Second CMOSFull-screen MonitoringRemote Monitoring from Cell Phone4-up and 12-up Multi-camera PagesBuilt-in Web Server/IP Address (IPv4/v6)Built-in MicrophoneThermal SensorImage Transfer by Motion Detection, Sensor Alert, TimerPrivacy ModePlug-and-Play InstallationFree Web AddressMulti-Language Interface1 Year Warranty", "title": "Panasonic BL-C131A Network Camera Wireless 802.11", "price": 195.5, "imUrl": "http://ecx.images-amazon.com/images/I/51fpJ715xEL._SY300_.jpg", "related": {"also_viewed": ["B008SHK7W8", "B002JM5JSU", "B008TSB2C0", "B002JLZMN8", "B0002GS4Z0", "B001P4NHUA", "B000V6Y0VI", "B0040NPHZG", "B000NVPTZC", "B000E1Z0E6", "B00H3Q8QB4", "B001BBR546", "B00F3KWZW8", "B001BBMWBW", "B000EXVTJY", "B00G6UAEHC", "B007G53W1G", "B0009PD0ZI", "B00IGFK7X6", "B003X26LYG", "B000NVSPQW", "B003QLGZ04", "B00J38NVHE", "B0040QX1P6", "B008915L2O", "B006ZP8UOW", "B00F9FCW7K", "B00F5CTTAU", "B006G8HSGO", "B00DSJA3G6", "B001BBS7ZW", "B0098M3B34", "B008P8FE6Y", "B00E8FSH44", "B002PILZV8", "B009C98NQS", "B006P88VSE", "B004ARFC5C", "B00GALXXWU", "B00KOFCQE4", "B00HJYQE8C", "B00CO9W21U", "B009AR2MQO", "B004DTWQG0", "B004P8K24W", "B0061GQ7PO", "B006I0KL6Y", "B008SHK6KG", "B00IYD4OJI", "B002OHDFOA", "B0057D8P7K", "B003YUEF0E", "B00CO9TBGO", "B0096YORV4", "B0046710G6"], "buy_after_viewing": ["B00F3KWZW8", "B00F9FCW7K", "B006ZP8UOW", "B006ZPWS4U"]}, "categories": [["Electronics", "Camera & Photo", "Video Surveillance", "Surveillance Cameras"]]}