{"asin": "B0011FOOI2", "description": "You're connecting your PC to your TV. You're downloading   movies and watching them on your big screen.Take control of your PC   entertainment with the only palm-sized, cordless mini-keyboard optimized for the   way you get your entertainment.&nbsp;Convenience and StylePalm-sized mini-keyboard with backlighting: Fits in your   hand. Backlighting makes text entry effortless, even in low light.Compact: Perfect size for your coffee table.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ControlIntegrated, dual-purpose ClickPad: Use as a touch pad to   point and click &ndash; or as a directional pad to navigate menus and make selections.Backlighting: Makes text entry effortless &ndash; even in low   light. Enjoy two different backlight colors depending on the mode you're in &ndash;   orange for cursor mode, and green for media control mode.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;PerformanceRechargeable Li-ion batteries: Last longer &ndash; up to one   month between charges.Bluetooth&reg; 2.0: Enjoy long-range wireless control from up   to 30 feet away.&nbsp;System RequirementsPC with Windows&reg; XP or Windows Vista&reg;USB PortThis product is compatible with PLAYSTATION&reg;3Technical Specifications25 mm (.98-inch) dual-purpose ClickPad. Works as a touch pad and a 4-way   directional padThumb-operated keypad design63 backlighted keysBacklighting for two modes&mdash;orange for touch-pad mode, green for media-center   remote modeAmbient light sensor measures current available light and turns off   backlight, if necessary, to conserve powerTroy gloss silver with midnight black designDedicated Windows Media&reg; Center buttonRange: up to 10 m (33 feet)ConnectivityBluetooth&reg; 2.0 wireless technologyPoint-to-point technology pre-paired with DiNovo Mini keyboard. (Does not   act as a hub.)Power and Battery30 days (battery life)Full-charge: Takes about 4 hours.Fast-charge: Takes about 10 minutes for 1 day of use950 mAH lithium-ion batteryPackage ContentsLogitech&reg; diNovo Mini&trade;USB Mini-receiverPower adapterCD with software, comfort guidelines and help centerUser&rsquo;s guideCleaning cloth3-year limited hardware warrantyFull product support", "title": "Logitech diNovo Mini Keyboard", "price": 51.95, "imUrl": "http://ecx.images-amazon.com/images/I/41-lJCRKJ%2BL._SY300_.jpg", "related": {"also_bought": ["B008JGU3YA", "B0093H8H8I", "B007X8TQYI", "B0035FIS2O", "B007QXLIWI", "B005JR1LXE", "B000J43HJ8", "B004MKNNGW", "B00224ZDFY", "B002UOR17Y", "B00BALK9CM", "B005XO4J5K", "B0040QE97A", "B0085J17KA", "B005T3GRLY", "B005L2NTTQ", "B007Q45EF4", "B004QRKWKQ", "B005DKZTMG", "B009NHAF06"], "buy_after_viewing": ["B008JGU3YA", "B005DKZTMG", "B0040QE97A", "B00B9996LA"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Keyboards"]]}