{"asin": "B004275EO4", "related": {"also_bought": ["B0044DEDCA", "B000095SA6", "B000KI0YXU", "B00EZT7RE4", "B0002E51CQ", "B0044DEDC0", "B000BQU1F2", "B00EO6X7PG", "B00BE50BPO", "B00DI89I04", "B001S14DYO", "B0042A8CW2", "B0001VWJ8Y", "B000068O17", "B001TH7GSW", "B004444O3W", "B001OV789U", "B000068O3T", "B004FEEY9A", "B002JIMZU4", "B00BQ6KSK4", "B00DI89IQS", "B00F6S0XGW", "B000ULAP4U", "B00HRQB3FQ", "B00GWU8FAE", "B00B3P15M8", "B0042A68R8", "B00009MK3A", "B000TTHVYK", "B004QMH8KI", "B009XDWUCQ", "B00EO6X4XG", "B000E1PXH0", "B000HHLU64", "B000J5XS3C", "B00FMTIUD8", "B000I1IG8Y", "B00CEKZZJ0", "B003VGUGBS", "B0011UB9CQ", "B0002BACB4", "B005F3H6Q8", "B007ZSYHYU", "B004SNCZ3K", "B00ESM3FM6", "B001JI2KHS", "B002LM0U2S", "B000068O3S", "B005FKT70O", "B00965WK8K", "B0001MHZM8", "B009NB8WTI", "B009E55WL4", "B00FP19HE4", "B005DL2OVE", "B004ZB9D4O", "B0001F347K", "B00BIPTDZY", "B004LPZBD6", "B002RMPHMU", "B004H0MQYW", "B0001ARCFA", "B00BFOEY3Y", "B008UG6GCC", "B000A1EHGW", "B0045JHJSS", "B000002MX7", "B0051WAM64", "B00CO8TBNS", "B004UR487A", "B005LJQNQU", "B00ELHTC2U", "B00006I5SB", "B009UEBQIM", "B00A14ZT8I", "B00CFLBU88", "B00FBPE52I", "B008ZGKWQI", "B00E3W15P0", "B001TH7GUK", "B003FVYXY0", "B00F3I7HNM", "B00AQ5PK6I", "B000JE9LD4", "B00E3W1726", "B0088PUEPK", "B002N5MHLU", "B0002J2MV4", "B0002CZW0Y", "B004C4UQZE", "B00E3W19MO", "B009ZN2NH6", "B007SJGGAE", "B008NCD2LG", "B008I647MA", "B00BCWALHM", "B001MSS6CS", "B006JH8T3S"], "bought_together": ["B001TH7GSW"], "buy_after_viewing": ["B0044DEDCA", "B00EZT7RE4", "B0044DEDC0", "B00E7QA9E0"]}, "title": "Creative Sound Blaster X-Fi HD USB Audio System with SBX SB1240", "price": 86.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/318U3n2AetL._SX300_.jpg", "brand": "Creative", "categories": [["Electronics", "Computers & Accessories", "Computer Components", "Internal Sound Cards"]], "description": "Designed to satisfy audiophiles and music lovers, the Creative Sound Blaster X-Fi HD USB audio card adds high-definition audio to any PC or notebook with a USB 2.0 port. It uses fine audio components and THX-enhanced audio technology to deliver rich, pristine sound. The X-Fi HD is also a useful device for DJs and turntablists: it features a phono preamp, which allows you to create digital recordings from your turntable. A software toolbox has been included to help facilitate vinyl recordings.Note: this sound card is not compatible with Mac systems.Sound Blaster X-Fi HD USB Audio System with THX SB1240At a Glance:High fidelity, distortion-free audio with signal-to-noise ratio of 114 dBHigh-grade components and THX technology for surround sound audioIntegrated phono preamp with RIAA equalization allows for recordings straight from a turntableWide range of inputs/outputs for connectivity to a variety of devicesBacked by a one-year limited warrantyFeatures a wide range of input and output ports for connectivity to a variety of devices.View larger.High-Fidelity Components Deliver Rich SoundThanks to its careful audio engineering, the X-Fi HD delivers excellent audio performance. It produces a signal-to-noise ratio of 114 dB, which ensures that audio playback is pure and distortion-free. The card's components make a particular difference when playing music: high and mid tones are reproduced with pitch-perfect detail, and lows are defined and tight.THX-Enhanced Surround Sound for Your PCThe X-Fi HD utilizes TruStudio Pro, an audio technology developed by THX. This technology works to expand your PC's audio channels, which allows surround sound content to be reproduced faithfully, making audio more expansive, immersive, and realistic. Even if you're listening through headphones, you'll experience the surround sound effect.In addition, TruStudio Pro uses a variety of techniques to make your music sound livelier. It restores your music's natural frequency range--something that is often lost when music is compressed into MP3 format. It also fills in low frequencies, which adds a little extra impact to bass. You'll be able to enjoy higher quality audio, even when streaming MP3s from your music library.Record Directly From Your TurntableTurntable artists, DJs, and vinyl collectors will find the X-Fi HD especially useful. The sound system features an integrated phono preamp, which allows users to create recordings directly from a turntable. The preamp uses RIAA equalization to minimize loss of quality during analog-to-digital conversion. This allows the X-Fi HD to create recordings that are faithful to the original vinyl.Includes Toolbox Software for Advanced RecordingThe X-Fi HD comes bundled with Creative's Media Toolbox software to make recording easy. Whether you're recording from your turntable or a microphone, the Media Toolbox helps you compress audio data and convert it into a variety of different formats. It also has several basic editing functions, which allow you to clean up, enhance, and embellish your music as you please.Supports Wide Range of I/O ConnectivityBuilt for versatility, the X-Fi HD supports connections to a variety of devices. It features ports that can accommodate microphones, headphones, home studio speakers, portable music players, AV Receivers, and more. Ports include a 1/4-inch microphone input, a 1/4-inch headphone output, an RCA input and output, and an optical SPDIF input and output. Headphone performance is enhanced with the studio-grade headphone amp.Compatibility and System RequirementsThe X-Fi HD USB sound card is compatible with Microsoft Windows XP (Professional x64 Edition, Service Pack 2 or above), Windows Vista, and Windows 7. (The card is not Mac compatible.)To install the card, you'll need an Intel Core 2 Duo or AMD equivalent processor, 2.2 GHz or faster; 1 GB RAM; at least 600 MB free hard disk space; an available USB 2.0 port; and a CD/DVD drive for software installation.The X-Fi HD is backed by a one-year limited hardware warranty.What's in the BoxX-Fi HD USB sound card, USB cable, RCA to stereo cable, user guide, and installation CD.Creative Sound Blaster Sound Cards (External)Looking for internal sound cards from Creative?Clickhere.Sound Blaster X-Fi Go! Pro USB Audio System with THX SB1290Sound Blaster X-Fi Surround 5.1 Pro USB Audio System with THX SB1095Sound Blaster X-Fi HD USB Audio System with THX SB1240General Info:Connection TypeUSB 2.0USB 2.0USB 2.0Speaker/Headphone SupportStereoStereo to 5.1 SurroundStereo with dedicated headphone amplifierMusic and Movies:24-bit Sound QualityTHX TruStudio ProDolby Digital LiveDTS & Dolby Digital Decoding via free PowerDVD DownloadPhono Preamp for Direct Recording from VinylGames:EAX SupportEAX 5.0X-Fi CMSS-3D Headphone Surround"}