{"asin": "B009X2OS72", "related": {"also_viewed": ["B008429624", "B0077M2958", "B000YB862E", "B009X2OS5Y", "B00803N2AY", "B002UA2H9A", "B00DCZL4K0", "B008EQFI86", "B007F0IMK8", "B006O130X8", "B00500U78U", "B005V7D1LW", "B009QNKXTU", "B007OWQGTG", "B008LQTFJW", "B005IMHCOC", "B00E3EU58Q", "B00E3CWVGC", "B00A2BW8HU", "B0019I26IQ", "B00AXFKRDC", "B007HOB466", "B00A3DIXP8", "B000KFRSG4", "B00K7146S4", "B003UBY03O", "B008UUPUPM", "B00008WIX5", "B00E5IS74O", "B00HLCG6US", "B00551BP3K", "B006TN1F06", "B0018OXP3G", "B00DRGQETA", "B008H3XZ22", "B00CXDMCK8", "B007T86TYW", "B00FBI1Y2Y", "B008S8DUDK", "B00BU9GBNA", "B00A2BG74A", "B00G4G6W1U", "B00G49TBWE", "B00HLCG8G0", "B00BOGOT4M", "B0002DGDBA", "B0097BCBM8", "B0036NSY5Q", "B005V7975G", "B006NLHXIW", "B00BWW9YOI", "B004VS9G2U", "B003HNS6S0", "B00GMQPHNQ", "B00CYSX148", "B0047FJDXE"], "buy_after_viewing": ["B0077M2958", "B008429624", "B000YB862E", "B009QNKXTU"]}, "title": "Cinetics miniSkates Pro Tripod Camera Dolly", "price": 99.95, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41Xp2PFLi6L._SX300_.jpg", "brand": "Cinetics", "categories": [["Electronics", "Camera & Photo", "Video", "Camera Supports & Stabilizers", "Camera Cine Dollies"]], "description": "Includes miniSkates Pro  dolly only. A tripod head is required. Purchase a tripod head (Example:  Joby Ballhead 1) separately if you do not already own one. Clamps are  included to attach GorillaPod SLR-Zoom tripod directly to miniSkates  wheels or on top of the SkatePlate frame. Purchase the GorillaPod  SLR-Zoom tripod separately to expand the functionality of miniSkates  Pro.miniSkates Pro is a combination of miniSkates dolly wheels  and the SkatePlate frame. miniSkates are the perfect companion for your  camera phone or compact camera. They're a set of three wheels that  enable filmmakers to capture fluid, moving video footage. miniSkates are  a smaller, more compact version of CineSkates, Cinetics' first product.  CineSkates caused a sensation with filmmakers in a 2011 Kickstarter  campaign, which launched the MIT student project into Cinetics, one of  the fastest growing brands in photo video. With help from customer  feedback, the Cinetics team built SkatePlate. SkatePlate has a  retractable quick-set-up design. Simply fold the three legs out, tighten  the knobs and SkatePlate locks in to a sturdy configuration. SkatePlate  has a standard 1/4-20 inch mounting thread to mount your favorite  tripod head. miniSkates and SkatePlate combine to form miniSkates Pro, a  revolutionary camera dolly.Key miniSkates Pro features:&bull; Quality components enable a smooth roll in a portable package&bull; Wheels can be positioned to make linear or arcing moves&bull; Markings are printed on top of the dolly and which enable quick setup&bull; Arms lock into several different configurations and fold up for portable storage&bull; Convenient travel bag is included&bull; Clamps are included to attach the GorillaPod SLR-Zoom tripod directly to the wheels or on top of the SkatePlate frame&bull;  The system is modular. The miniSkates wheels detach via the Cinetics  Connect quick connect and other Cinetics components can be attached."}