{"asin": "B000A3WS16", "description": "Note: For the latest version of this item, see theApple 30 GB iPod with Video Playback (White).Witness the evolution of the revolution. First it played songs. Then photos. Then podcasts. Now iPod plays video, changing the way you experience your music and more. Again.Better YetTime for the world's best music player to take the stage for another encore. In 30 GB and 60 GB* models that hold up to 15,000** songs, full-color album art and up to 25,000 photos***, the new iPod makes the most of your music and more. Yeah, you've heard that tune before. Only now, you can watch it, too. With support for up to 150 hours**** of video and a 2.5-inch color display, the new iPod lets you take music videos and TV shows on the road.More and LessThe new iPod boasts up to 20 hours of battery life*****, five hours more than before. Plus, you get a bigger display and one more iPod color--sleek black. But here's the kicker: At under half an inch thin, the new 30 GB iPod takes up about 45 percent less room than the original iPod. Even the new 60 GB model is 10 percent thinner than the fourth-generation 20 GB iPod. More features in less space? Sounds like iPod.The new iPod is thinner than ever before.Hold EverythingNow you can put all your music in your pocket and still have room for, well, practically everything else. Catch up on your reading with audiobooks. Browse your memories with photo slideshows, complete with music. Watch video podcasts, music videos and your favorite TV shows. Consult your calendar or look up an email address. Even check the time in another city or time your fastest lap. The new iPod keeps it all close at hand.Spin Some TunesThe Apple Click Wheel gives you access to your entire music, photo and video library--from one thumb. Control volume and browse using the touch-sensitive surface. Play. Pause. Rewind and fast-forward. Rate your favorites. Create playlists on the go. Launch photo slideshows. The Click Wheel puts everything at your fingertips, so you can keep your eyes and ears on the music.Sync, Look, and ListenPlaying your iPod is only half the fun. Try filling it with downloads from the iTunes Music Store. Choose from over 2 million songs, 20,000 podcasts, 2,000 music videos or your favorite ABC and Disney television shows, download them to your Mac or PC and sync them to your iPod. Add an optional audio cable to play music from the iPod to your home stereo or use an optional S-video cable with iPod to play VJ on your TV. You can perform the same big-screen feat with iPod photo slideshows. Oh, and you can do it all from across the room using the optional Universal Dock and handy new Apple remote.* 1 GB = 1 billion bytes; actual formatted capacity less.** Song capacity is based on four minutes per song and 128-Kbps AAC encoding.***Photo capacity is based on iPod-viewable photos transferred from iTunes.****Video capacity is based on 4 minutes per H.264 750-Kbps video combined with 128-Kbps audio.*****Rechargeable batteries have a limited number of charge cycles and may eventually need to be replaced. Battery life and the number of charge cycles vary by use and settings. See www.apple.com/batteries for more information.", "title": "Apple iPod 30 GB White (5th Generation)  (Discontinued by Manufacturer)", "price": 259.0, "imUrl": "http://ecx.images-amazon.com/images/I/3191Y0P9XJL._SX300_.jpg", "related": {"also_bought": ["B000A3WS84", "B0028ND432", "B002H9LNGW", "B009RXGC1W", "B000EPNDEG", "B008U25LI6", "B002S0O7LI", "B001TETXW2", "B002F4RHYG", "B000JLKIHA", "B000P9I6B6", "B000JO1380", "B002AF5184", "B000A3WS8O", "B0006ITP3O", "B004O8VGZW", "B006YNTJ6I", "B008JEZG7Q", "B002L6HDPG", "B001A4Q8JM", "B004CP4FJ6", "B0030LSFQW", "B000WBDD56", "B00365F6G4", "B009CWRVH2"], "buy_after_viewing": ["B000A3WS84", "B000EPNDEG", "B000JLKIHA", "B0097BEDOC"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}