{"asin": "B005UBT7LW", "description": "The Lenovo 7&quot; IdeaPad Tablet A1: Comes with everything except a hefty price tag.If you're always on the go and always online, look to our 7&quot; IdeaPad A1 Tablet, a compact yet rugged multimedia device that runs on the Android&trade; 2.3 operating system. Affordable, slim and with an eye-catching black design, the A1 Tablet is also durable with a magnesium alloy roll-cage internal frame that protects the critical system components in case of accidents or jolts.   It's preloaded with more than 10 useful apps, and with access to both the Lenovo App Shop and the Android Market, thousands of apps are just a click away.&nbsp;Lenovo IdeaPad A1           TabletKEY SPECIFICATIONSTI&reg;3622 (Cortex-A8)      1GHz single-core processorAndroid&trade;2.3 operating system7&quot;      LED (1024x600) capacitive multi-touch display512MB LP DDR memory, 16GB SSD (Solid State Drive) storageWi-Fi      and Bluetooth&reg;connectivityLess than 1/2&quot; thin &mdash; 7.6&quot;(H) x 4.9&quot;(W) x 0.47&quot;(T)Micro      SD card reader and a Mini USB portIntegrated      front (0.3M) and rear (3M) webcamsINSPIRE CREATIVITYConnect      in style &mdash; the A1 sports a sleek, contemporary designSolid      as a rock &mdash; internal frame that protects the critical system componentsGO THE DISTANCEUltraportable &mdash; the A1 weighs in at less than 1 lb (0.88 lbs)Micro      SD card reader and a Mini USB port for easy connections to other devices16GB SSD (Solid State Drive) of storageCAPTIVATE &amp; ENTERTAINWeb-optimized      with Android 2.3 and instant synchingIntegrated      front (0.3M) and rear (3M) webcamsAdobe&reg;Flash&reg;support for vivid animation and video playbackMore      than 10 preloaded apps, plus the Lenovo App Store and the Android Market      ensure ready access to thousands more&nbsp;&nbsp;DO MORE OUT OF THE BOXStart your tablet experience right when you open the box. The A1 comes preloaded with over 10 popular apps. You can also take advantage of everything Android has to offer with the Android Market and the Lenovo App Shop, which contains apps tested specifically for Lenovo tablets.DO MORE ENTERTAINMENTOptimized for the Web with full Flash support for vivid animation and video playback so you can enjoy your favorite online videos and websites.DO MORE SOCIAL NETWORKINGConnect to your entire social network, and video chat with your your circle from anywhere in the world with the front and back mounted webcams.&nbsp;&nbsp;&nbsp;", "title": "Lenovo Ideapad A1 22282EU 7-Inch Tablet (Black)", "price": 99.99, "imUrl": "http://ecx.images-amazon.com/images/I/41WtY1XdqrL._SY300_.jpg", "related": {"also_bought": ["B006DKEUAM", "B00B0N85WG", "B006EB3ENO", "B007ZVITZK", "B0067CUP9Q", "B006JSEY2C", "B009AEPTDA", "B0062TAKAS", "B005P40FNI", "B0063P0C6S", "B00F2DQV94", "B007P4VOWC", "B004OB0EBQ", "B00CRXZPA8", "B004UL34EY", "B004UL34GW", "B004QZASJ8", "B0011UXSHK", "B00E435N1A", "B007KFXIDE", "B0062TAKJO", "B005P40FX8", "B006DKEUKM"], "buy_after_viewing": ["B00DKFF386", "B00F2ENYPC", "B004QZASJ8", "B00F2ENTJI"]}, "categories": [["Electronics", "Computers & Accessories", "Tablets"]]}