{"asin": "B0021AFWL4", "description": "Stylish Portable Storage in a Protective Rotating Jacket  Lexar offers a comprehensive line of high-performance USB flash drives designed with a wide variety of features, capacities, and capabilities. With so many options, it's easy to find the right Lexar JumpDrive product to fit your needs and lifestyle.  Lexar JumpDrive TwistTurn is a high-capacity USB flash drive that provides a convenient solution for storing, transferring, and sharing multimedia and more. Convenient, High-Capacity Solution   High-Capacity Storage and Stylish Housing. JumpDrive TwistTurn is available in a range of large capacities, allowing you to transfer, store, and share a vast number of data, photo, music, and video files. The drive has a capless design with a rotating case to protect the drive and its contents, providing an excellent combination of durability and convenience.  Plug-and-Play Design with Great Features. JumpDrive TwistTurn has a simple plug-and-play design that allows you to quickly and easily store files, so wherever you go, your information goes with you. Its durable hinged jacket rotates to easily access a USB port, and it sports an LED activity light that blinks during file transfer, so you know when the job is done. JumpDrive TwistTurn also works across platforms, giving you flexibility and ease of use.  Created to suit your style, JumpDrive TwistTurn is available in a different stylish color for each of its varying capacities. It also makes a fashionable accessory and comes with a key chain hole, making it easy to tether to a key ring, attach to a backpack, or hook to a purse or briefcase. With large storage capacities and stylish design, Lexar JumpDrive TwistTurn is an incredibly versatile and convenient portable storage solution.  Lexar. When Memory Matters.  DISCLAIMER:  Actual usable memory capacity may vary. 1MB equals 1 million bytes; 1GB equals 1 billion bytes.", "title": "Lexar JumpDrive TwistTurn 4GB USB Flash Drive LJDTT4GBASBNA (Red)", "price": 5.38, "imUrl": "http://ecx.images-amazon.com/images/I/41W5eWAxyJL._SY300_.jpg", "related": {"also_bought": ["B007JR531I", "B0041Q38O4", "B0027VT6PA", "B004TS1J18", "B008CQCEX0", "B003O2S080", "B000FFLWLQ", "B004OR781Y", "B006W8U2MU", "B004WB7I3K", "B005GWQRWM", "B001XURP7W", "B0041Q38NK", "B0041Q38NU", "B005FYNSPK", "B007JR532C"], "buy_after_viewing": ["B004TS1J18", "B00DYQYJ3Q", "B0041Q38NU", "B007JR532C"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "USB Flash Drives"]]}