{"asin": "B001TK3D3Q", "categories": [["Electronics", "Television & Video", "DVD Players & Recorders", "DVD Players"]], "description": "Samsung with NFLGet amazing DVD images, plus improved connectivity, with Samsung&rsquo;s DVD-1080p. Crisp, clear 1080p upconversion offers brilliant high-definition entertainment &ndash; it&rsquo;s like enjoying your entire DVD library in a whole new way. Innovative HDMI-CEC connectivity offers one-remote convenience with your other Samsung electronics. Advanced BD Wise technology syncs your Samsung components for optimized picture and sound quality, every time. And multi-format playback &ndash; including DVD, MP3, WMA, JPEG and more &ndash; makes this player as versatile as it is impressive.Key Features1080p up-conversionSuper Scan PlaybackInstant skipInstant ReplayHDMI (High-Definition Multimedia Interface):transfers hi-definition (720p/1080i) video and audio from your DVD Player to your TV, Home Theater, or other digital AV components. Simply connect your DVD Player to your Home Theater System with a single cable for the high quality pictures and sound.HDMI-CEC (Anynet+):A true &ldquo;plug and play&rdquo; product, it comes with a Consumer Electronics Control (CEC) feature that lets you operate multiple HDMI products with a single remote control..14 bit video DACProgressive scan outputscans individual picture lines in sequencerather than alternately, maximizing the clarity of digital images andbringing new realism to your DVD viewing experience.DivX playback: Insert DVDs &amp; CDs that have DivX movies downloaded via computer and enjoy watching them on a large-scale TV.ConnectionsVideoHDMI output: yesComponent video out: yesAudioCoaxial Out: yes", "title": "Samsung DVD-1080P9 1080p Upconverting DVD Player", "price": 37.99, "salesRank": {"Electronics": 47954}, "imUrl": "http://ecx.images-amazon.com/images/I/21%2BDFiCUN6L._SX300_.jpg", "related": {"also_viewed": ["B007F9XHAY", "B003ANVQWU", "B007BYLO4E", "B00GLT3HNQ", "B00FW7ATEI", "B008MWLHX2", "B0039XRUBM", "B004LNMAAA", "B007F9XHBI", "B008PB8XN2", "B004CYWVAM", "B00BFDHV9E", "B001IBHUU8", "B00BN9CH26", "B001TK3D3G", "B004BI6MVS", "B005625SJK", "B0076R7FFI", "B0076R7FWQ", "B00269YAAO", "B00C8SHXKW", "B002CO6GUK", "B0065907GC", "B006N70DOM", "B007S71NZO", "B008MWLHY6", "B00EUY59Z8", "B00CXNHJAQ", "B00ICDAAX4", "B004LNL6V4", "B003ZFRA00", "B004SBHSZ2", "B00D0EP68Y", "B00ICDAAXO", "B00GXTUTN0", "B003LWXJ2A"], "buy_after_viewing": ["B007F9XHAY", "B007F9XHAY", "B007BYLO4E", "B007BYLO4E", "B003ANVQWU", "B003L1ZYYM"]}}