{"asin": "B00002N6AN", "related": {"also_bought": ["B0002IKUF0", "B004INGS8S", "B000NCWP44", "B000NCWOKE", "B002VED42O", "B000NJPUHG", "B000NJ3R26", "B00INTIK9S", "B000FJYSHW", "B00INTILTC", "B0036GA7K8", "B006FLGHGE", "B00CSS0KLQ", "B00FBOUEJC", "B00002N8NR", "B00CWC3DDK", "B000YKJ6YW", "B000NJ1ZQQ", "B004PVK4GK", "B0026RGNJ2", "B000XTI5Q4", "B007CW1I0A", "B000BQS2I0", "B007FG7TWO", "B001Y8PT5I", "B000P6BGYI", "B000FJF8P8", "B00E1HXYRE", "B000BO6RIE", "B0094KM4VK", "B000P0ZSHA", "B00004RAMY", "B003D7E2XI", "B001BSQB94", "B0016PC4TS", "B00004R9VZ", "B00004R9TL"], "also_viewed": ["B000NJPUHG", "B0036GA7K8", "B002VED42O", "B004XWBCFI", "B0002PB214", "B00J8IN6MY", "B00CWC3DDK", "B000YKJ6YW", "B000NJ3R26", "B009DYU89W", "B003TLN84M", "B004VUA82K", "B007CW1I0A", "B002VED43S", "B000UK0YRY", "B00004SDYT", "B00CRF2QD0", "B0013J99DG", "0399160965", "B003403LT0", "B000BQSGAY", "B008YFE7WA", "B000FJX67U", "B00A25E194", "B0036G6J0U", "B002VED42E", "B000UJW61C", "B0036G8FV6", "B001RCTX4E", "B000TKJEKS", "B007XIVFVU", "B000071NUS", "B006ZN253Q", "B007CKT5CA", "B004Y9YEUA", "B00004SE08", "B0017QDHYM", "B0055OR3UQ", "B0015AOT4W", "B00005Y0IG", "B00L8KU2PO", "B0018C8LK0", "B00IZYXPRI", "B003UA1QX2", "B0015AOXAM", "B004INGS8S", "B002VED438", "B004Y9YF5Y", "B0015ASK1K", "B00K72WU3Q", "B0002IQ96Y", "B0008IT0HS", "B002LIBL3Y", "B003LY4I28", "B000BQPZ80", "0763653136"], "bought_together": ["B000NCWP44", "B004INGS8S"]}, "title": "Nelson 1865 Raintrain Traveling Sprinkler", "price": 49.99, "salesRank": {"Patio, Lawn & Garden": 351}, "imUrl": "http://ecx.images-amazon.com/images/I/31l8ZEKFQwL._SY300_.jpg", "brand": "Nelson", "categories": [["Patio, Lawn & Garden", "Gardening & Lawn Care", "Watering Equipment", "Sprinklers"]], "description": "The classic yellow tractor that goes wherever you lay the hose. Nothing covers more ground with less effort, the most durable and convenient lawn sprinklers on the market. Self-propels across the lawn, following the pattern you lay out with the hose. The Nelson travelers are equipped with 3 speed settings and are designed to automatically shut off at any given point along your hose track. Ideal for medium to large established lawns with open areas. Nelson was the first in the industry to introduce the traveling sprinkler and it remains a core item today.While an automatic sprinkling system certainly ensures greener grass and nurtured flowerbeds during the sweltering days of summer, not every household comes equipped with such a system and they can be downright expensive to install. Historically, the alternative to the built-in sprinkler system has involved setting up a hose and sprinkler and then manually relocating the water source to several strategic locations every thirty minutes for several hours. Despite all the detail and time this manual system receives, the sprinkler never quite makes contact with certain patches. Likewise, swamping also occurs at times because homeowners generally have more important things to worry about than whether it is time to switch the sprinkler. Luckily, the folks at LR Nelson are employed to worry about finding comprehensive watering methods for busy homeowners who don't have the means, time, or desire to dig up the yard to install and intricate system of sprinkler pipes. Responsible for a bevy of creative lawn care solutions, the Peoria, Illinois outfit introduce this ingenious Raintrain traveling sprinkler.With a rustproof cast iron construction, the sprinkler waters up to 13, 500 square feet, though covering a lesser area of 11,9000 square feet ensures more effective performance. The sprinkler arms adjust for varied spray patterns and arcs, throwing water from 15 to 56 feet. The sprinkler waters as it travels along a hose on a preset route, much like an electric model train, except with a hose as the rails. To water, the homeowner lays out the hose as desired, taking care to avoid dramatic corners or turnabouts that may result in hose kinks or a derailed sprinkler. A front wheel runs on the hose with the two traction-ready rear wheels bestride. The hose connects to the posterior of the sprinkler. For the best results, LR Nelson recommends a 5/8-inch hose, though a 1/2-inch hose may suffice, up to 200 feet in length. For sprinkling termination, the user places a shut-off ramp on the hose to lift the sprinkler off its \"rails,\" while simultaneous stopping operation. The shut-off ramp should be installed with at least five feet of hose between it and the spigot. The traveling sprinkler operates at two motor speeds, high and low. On high power, the sprinkler travels approximately 37 feet per hour, with a 1/4-inch water application. On low power, the sprinkler moves at a 21 feet per hour rate with a 1/2-inch water application. The simple installation requires no tools. The sprinkler weighs 18.1 pounds upon shipping.--Jessica Reuling"}