{"asin": "B0011ZK6OS", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Manufacturer DescriptionChiseled edges with a subtle gleam give this PowerShot SD790 IS Digital ELPH distinctive sculptural appeal. Just as attractive are its high-end specifications, including 10 megapixels of resolution plus Face Detection and Motion Detection Technology that delivers the ultimate in crisp, clear, amazingly detailed images. Prepare to be transfixed by the view from the camera&rsquo;s 3.0-inch PureColor LCD II screen. With rich, accurate color and superb clarity, the screen is easy to view at wide angles too -- perfect for gathering a group around to see your images.PowerShot SD790IS Highlights1x zoom/3x zoomAdvanced 10-megapixel Digital ELPH with 3x optical zoom and Optical Image StabilizerThe PowerShot SD790 IS Digital ELPH offers impressive core technologies. The 10.0-megapixel CCD gives you extraordinary flexibility in cropping and enlarging: the detail and resolution are so fine that you can take any part of an image and enlarge it with confidence. The 3x optical zoom can more than handle your everyday shooting. Canon&rsquo;s exclusive Optical Image Stabilizer automatically detects and cancels camera shake, ensuring that your images are crisp and blur-free throughout the zoom range.Motion Detection Technology automatically detects subject movement and optimizes exposure control to reduce blurLife doesn&rsquo;t stand still for picture-taking. That&rsquo;s why Canon included its advanced Motion Detection Technology in the PowerShot SD790 IS Digital ELPH. This sophisticated feature works in the background to instantly evaluate how fast your subject is moving. Then it automatically selects and sets the optimal exposure and ISO settings to keep everything looking sharp and clear. When you need higher ISOs for action-stopping shutter speeds, Motion Detection Technology provides it. But when no movement is detected, it allows lower ISOs for excellent color and detail. So whether you&rsquo;re shooting a bride walking down the aisle, a ballet recital or even a child&rsquo;s soccer game, you can relax and shoot with confidence knowing you&rsquo;ve got the picture you intended.Large 3.0-inch PureColor LCD II screen for bright, accurate color and wide viewing angleThe PowerShot SD790 IS Digital ELPH gives you large 3.0-inch LCD screen for excellent control when framing your shots. Canon&rsquo;s PureColor LCD II offers more spectacular color, resolution and contrast even when viewed at an angle (compared to PureColor LCD). The screen is highly durable and easy to see in any light with a scratch-resistant, anti-reflective coating. It also features Night Display for easy viewing in low light -- a perfect feature for gathering friends and family around to see your images.With Canon's Face Detection WB (right), skin tones are not affected by overall lightingImproved Face Detection Technology sets the focus, exposure, flash and white balance automaticallyCanon's powerful Face Detection Technology delivers even better results with the new SD790 IS Digital ELPH. The Face Detection Technology continues to recognize faces in a scene, concentrate exposure (daylight or flash) and focus upon them. But the SD790 IS Digital ELPH adds more: Face Detection WB means the camera concentrates upon faces when calculating white balance for the best possible skin tones. Face Select and Track lets the SD790 IS Digital ELPH user highlight one face among several in a scene, and the camera concentrates on that person, even as they move around the scene. Face Detection Technology is a powerful contributing factor in Canon's new Motion Detection Technology.And with 19 Shooting Modes including 12 Special Scene Modes, you&rsquo;re ready for whatever shot comes your way.Edgy, stylish design combined with a cool new button configuration for great operabilityIt&rsquo;s all about edge with the PowerShot SD790 IS Digital ELPH. Sculptured angles not only ratchet up this Digital ELPH&rsquo;s \"look at me\" quotient, but add an extra degree of control for superior handling. Gleaming cut surfaces emphasize the camera&rsquo;s slim style. A cutting-edge control dial makes accessing functions and operations easier than ever. Large, flat buttons in an intuitive configuration are uniquely attractive and fun to use.DIGIC III Image Processor for superior image quality and improved functionalityWith DIGIC III, your images boast superior quality, the camera operates at top efficiency and battery life is enhanced. What&rsquo;s more, DIGIC III enables Canon&rsquo;s Face Detection Technology and Red-eye Correction to give you better, more true-to-life people shots. Simply press the Shutter Button halfway down, and the camera automatically pinpoints the faces in the scene and chooses the ideal focus point. The camera controls exposure settings and flash to keep every face looking bright and natural. Red-eye Correction can be handled in-camera, in two ways. The entirely new Red-eye Correction during shooting uses the Face Detection Technology to recognize and remove red-eye from flash images as they're taken, before the file is written to the memory card. It's also possible to correct red-eye during image playback, using simple settings in the SD790 IS Digital ELPH's menu.iSAPS Technologyis an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the fast DIGIC III Image Processor to improve focus speed and accuracy, as well as exposure and white balance.Red-eye Correctionprovides three options for removing red-eye from subjects in flash pictures.1) The new Red-eye Correction during shooting actually identifies and corrects red-eye in human subjects as pictures are taken.2) The SD790 IS Digital ELPH can be set to automatically detect and correct red-eye during image playback.3) The user can manually locate any red eyes in a scene during image playback on the LCD screen, and command the camera to remove them.The PowerShot SD790 IS Digital ELPH also features ISO 1600 and High ISO Auto settings that reduce the effects of camera shake and sharpen subjects in low-light situations, giving you greater shooting flexibility.Print/Share Button for easy direct printing and downloadingThe PowerShot SD790 IS Digital ELPH's Print/Share button makes direct printing easier than ever. Simply connect the SD790 IS Digital ELPH to a Canon PIXMA photo printer or SELPHY compact photo printer or any PictBridge compatible photo printer, press the lighted Print/Share button and print! Also use the Print/Share button to transfer images to a computer (Windows and Macintosh).Print your own ID photos in up to 28 different sizes or use the Movie Print function to output multiple stills from a recorded movie on a single sheet with a Canon SELPHY compact photo printer.", "title": "Canon PowerShot SD790IS 10MP Digital Camera with 3x Optical Image Stabilized Zoom", "price": 17.12, "salesRank": {"Camera &amp; Photo": 5841}, "imUrl": "http://ecx.images-amazon.com/images/I/417P3fQ5aKL._SX300_.jpg", "related": {"also_viewed": ["B002LITT42", "B001SER46A", "B0012YC7AE", "B001SER49M", "B000NK6J6Q", "B006UMM15O", "B00CWMBR10", "B001SSTGUS", "B001SER492", "B0035FZJKI", "B0015DNJKE", "B001DO15J2", "B000NK8EWI", "B005II5OLY", "B0035FZJJ4", "B001G5ZTN6", "B001SER47Y", "B001SER48S", "B0015DPJ5W", "B004J3V8UU", "B001G5ZTZO", "B001G5ZTWM", "B00AWYN0BU", "B006UMM1J0", "B006UMM1AY", "B004J41T7Q", "B005MTME3U", "B009B0MYSQ", "B0075T7NW2", "B000V1VG5G", "B00B5HE3UU", "B004J3VAYO", "B006UMM1F4", "B006UMM1UO", "B00AWYN0ME", "B000EVS4YE", "B000EMWBT2", "B0076993SI", "B0032JRRXE", "B0041RSPRS", "B0075SUII4", "B00EFILNV8", "B0075SUEOM", "B001SER47O", "B0075SUFLE", "B004M8SVGG", "B0012Y6958", "B00I58LVKC", "B0075SUK14", "B0075SUJ4W", "B00B5HE3IW", "B002M51C5S", "B0015DNIKU", "B002LITT56"], "buy_after_viewing": ["B003VNKNF0", "B000EVS4YE", "B003VNKNEQ", "B005JX1IOU"]}}