{"asin": "B004FLL5BS", "categories": [["Electronics", "Camera & Photo", "Underwater Photography", "Cameras"]], "description": "KODAK EASYSHARE SPORT CameraOverviewReady for life unlimited. Whether it&rsquo;s a dunk in the pool, a downpour on the hiking trail, or a spilled drink at the restaurant, check out the great outdoors without worrying about dirt, dust, and sand. Be ready with the KODAK EASYSHARE SPORT Camera. Take your best shot&mdash;up to 10 ft underwater. Plus, wherever you go, your friends will wish they were there. With Kodak&rsquo;s Share button you can tag pictures directly from your camera for e-mailing to friends or uploading to popular social networking sites2.Only KODAK Digital Cameras allow you to simultaneously share to multiple social networks and e-mail1.Kodak&rsquo;s Share button makes sharing your videos and pictures as simple with One Button Upload:&nbsp;&nbsp; &nbsp;&bull; Just press Share&nbsp;when in review mode&nbsp;&nbsp; &nbsp;&bull; Choose your favorite sharing destinations: FACEBOOK, e-mail, KODAK Gallery and KODAK PULSE Digital Frames2, and other popular sharing sites&nbsp;&nbsp; &nbsp;&bull; Connect your camera to your computer&nbsp;or insert your memory card and your videos or pictures are automatically uploaded to the destination(s)1Kodak&rsquo;s exclusive Share Button:&nbsp;&nbsp; &nbsp;&bull; Automatically shares when you connect to a PC1&nbsp;&nbsp; &nbsp;&bull; Tags to the largest number of socialnetworks3&nbsp;&nbsp; &nbsp;&bull; Uploads friend tags to FACEBOOK1Take a swim and take your best shot:Waterproof*, dustproof**, and worry proof&nbsp;&nbsp; &nbsp;&bull; Take the plunge&mdash;shoot stills and video up to 10 ft underwater&nbsp;&nbsp; &nbsp;&bull; Go anywhere&mdash;dustproof design lets you shoot in just about any environment&nbsp;&nbsp; &nbsp;&bull; Don&rsquo;t get the blues&mdash;underwater white balance mode gives true-to-life colors in the pool or under the waves* IEC 60529 IPX8 compliant** IEC 60529 IP6X compliantFeatures:&nbsp;&nbsp;&nbsp; &bull; Share your world big and bright with 12 MP: More megapixels means you can crop and enlarge and still have great picture quality. Make stunning prints up to 30 x 40 in.&nbsp;&nbsp;&nbsp; &bull; 2.4 in. bright LCD: Relive moments and view pictures with brilliance and clarity thanks to KODAK Color Science&nbsp;&nbsp;&nbsp; &bull; Face detection: For great shots of friends and family, face detection locates faces and automatically adjusts camera settings&nbsp;&nbsp; &bull; Never miss a moment with AA batteries: Your camera is always ready to go using convenient AA batteriesKodak's Smart Capture feature:Beautiful pictures, more often-automaticallyBecome a better photographer with a smarter camera. Kodak&rsquo;s innovative Smart Capture feature automatically identifies the scene and adjusts camera settings for a great picture in just about any environment.&nbsp;&nbsp; &nbsp;&bull; Intelligent scene detection&mdash;analyzes the scene to give you better pictures under various conditions&nbsp;&nbsp; &nbsp;&bull; Intelligent capture control&mdash;automatically sets camera settings for clear, sharp pictures even in low light and challenging situations&nbsp;&nbsp; &nbsp;&bull; Intelligent image processing&mdash;reduces noise and clears up dark shadows for vibrant, crisp details and true-to-life colorsWhat&rsquo;s In the Box: Everything you need to shoot and share&bull;&nbsp;&nbsp;&nbsp; KODAK EASYSHARE SPORT Camera&bull;&nbsp;&nbsp;&nbsp; KODAK Alkaline AA Batteries or equivalent&bull;&nbsp;&nbsp;&nbsp; Wrist strap&bull;&nbsp;&nbsp;&nbsp; USB cable&bull;&nbsp;&nbsp;&nbsp; User Guide1All Kodak digital still and video cameras manufactured in 2011 or later.2KODAK PULSE Display and KODAK Gallery support still pictures; video not supported.3Sharing sites vary by region", "title": "Kodak EasyShare Sport C123 12 MP Waterproof Digital Camera (Red)", "price": 7.33, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41NDyZagplL._SX300_.jpg", "related": {"also_bought": ["B004Y6YAFC", "B001OBWGX8", "B000P1O73A", "B004GKLW3O", "B0045DR7UE", "B002KID8K4", "B0048FFHTC", "B0050DRYEM", "B001OBVG5C", "B0027E4GB6", "B0054L1SOM", "B003CK10DG", "B000VUVA62", "B0045DPCNI", "B0054L1T2S", "B007JRB0TC", "B0042GFQRA", "B001RFT698", "B004OEQKI4", "B007JRB0SS", "B006L6ZUW0", "B0037TA7QS", "B00LFB45KO", "B00B2NLP26", "B0014E02AO", "B004VSN338", "B0014DURIW", "B007JRB0RE", "B003VNKNEG", "B001W1BSM0", "B0050DRX7K", "B004IRPXO4", "B003VNKNEQ", "B0064PBBOY"], "buy_after_viewing": ["B000P1O73A", "B003CK10DG", "B001OBWGX8", "B003VNKNF0"]}}