{"asin": "B003FBL85M", "description": "Set in a dark fantasy world,Hunted: The Demon&rsquo;s Forge&trade;is an unforgettable cooperative action game, pitting you and your partner against waves of vicious enemies. Taking control of either E&rsquo;lara, a ranged weapon expert, or Caddoc, a master swordsman, you must use a variety of weapons, powerful spells, and cover tactics to battle your way through menacing dungeons, overgrown ruins, and downtrodden towns. Discover secrets and complete co-op-based puzzles whilst exploring the sinister world to discover answers to the game&rsquo;s deep, dark mysteries.PUBLISHER: Bethesda SoftworksDEVELOPER: inXile EntertainmentANTICIPATED RELEASE DATE: Q1 2011PLATFORMS: Xbox 360&trade; / PLAYSTATION&reg;3 /Games for WindowsGENRE: 3rd Person Co-op AdventureSTORY:The dark ages have become corrupted. Heinous creatures have emerged from underground. Townsfolk across the land are disappearing. Upon the promise of their fortune in gold, mercenaries E&rsquo;lara and Caddoc take on the daunting task of discovering where the innocent villagers have been taken. Their journey will lead them on a dark and twisted path where they will encounter death, slavery, and sacrifice. Travel deep within the world of Kala Moor...and to the secrets of The Demon&rsquo;s Forge.KEY FEATURES:Dark Fantasy ShooterPowered by the Unreal 3 engine, the dark world of Hunted comes to life as a third-person fantasy game with the intensity and action of a modern-day shooter. Hunted boasts stunning visuals with breath-taking vistas and foreboding underground worlds.Co-op at a DistanceCombine E&rsquo;lara&rsquo;s ranged attacks with Caddoc&rsquo;s melee expertise to pull off gruesome co-op kill moves, perform special attacks, and heal one another from anywhere on the battlefield. The characters&rsquo; differing combat expertise allows a player&rsquo;s strategy to vary from one play through to the next.Descend into Dungeon DepthsWork with your co-op partner to discover hidden paths and solve the devious puzzles that block your way. Explore menacing dungeons, overgrown ruins, and terrorized towns to discover treasure and powerful upgrades.Two Ways to FightWade into the thick of the fight using deadly melee skills, or tactically use cover to dispatch hordes of creatures with bows and spells. Use powerful magic to boost your partner&rsquo;s combat effectiveness and even the odds against increasingly formidable enemies.Forge Your Own LevelsCreate and share your own challenging dungeon designs with The Crucible, a powerful in-game editor that provides endless opportunities for exploration and battles for you and your friends.images and screenshots &copy; 2010 Zenimax Media Inc. All Rights Reserved.About Bethesda SoftworksBethesda Softworks, part of the ZeniMax Media Inc. family of companies, is a premier developer and worldwide publisher of interactive entertainment software. Titles from two of the world&rsquo;s top development studios &ndash; Bethesda Game Studios and id Software &ndash; are featured under the Bethesda Softworks label and include such blockbuster franchises as DOOM&reg;, QUAKE&reg;, The Elder Scrolls&reg;, Fallout&reg;, Wolfenstein&trade; and RAGE&trade;.For more information on Bethesda Softworks&rsquo; products, visit www.bethsoft.com.Hunted: The Demon's Forge, Bethesda Softworks, ZeniMax and related logos are registered trademarks or trademarks of ZeniMax Media Inc. in the U.S. and/or other countries. Developed in association with inXile Entertainment Inc. inXile Entertainment and the inXile Entertainment logo are registered trademarks or trademarks of inXile Entertainment Inc. All Rights Reserved.All other trademarks or trade names are the property of their respective owners. All rights reserved.", "price": 43.07, "imUrl": "http://ecx.images-amazon.com/images/I/61HCqFRl7RL._SY300_.jpg", "related": {"also_bought": ["B003O6G1L4", "B0021TVYCG", "B000HCJD68", "B0057PERNE", "B003DNLDUC", "B004A87506", "B0044SA734", "B000K9OR4Q", "B001BTPRKC", "B000G7X5Q8", "B002I0J6KU", "B000XJNTQ0", "B002BRZ744", "B0047TLIBU", "B00354NANC", "B001UWGCW2", "B000WCT1KQ", "B003O6HDRU", "B003P9FRGA", "B00J22636W", "B003S2MXQG", "B002I0K5NC", "B0056WJA6M", "B00320J6W8", "B00170823O", "B001CBW18U", "B001D7T2VC", "B00432O50W", "B003GT8IL0", "B004ML44Y6", "B002DC8GKO", "B000ZK695U", "B000K9OP2A", "B00319DX4M", "B004NRN5EO", "B0014QAO4Q", "B0050SXZ7W", "B002BRYIJY", "B0016GC9D8", "B001NX6GBK", "B0014UGK8G", "B005J5K9UW", "B004LWEK7C", "B00B59MXGY", "B003H0CBYS", "B00104KCF8", "B007FMSH4M", "B000KLNLUK", "B003ZFVD4O", "B003A6X0H6", "B002I0J6DC", "B004EW948E", "B003DLQTYY", "B00JUFT3I6", "B000NGP1R8", "B002BXJ9VA", "B005VBVQDI", "B003Q55YCU", "B005C2D1YI", "B000XJM2AE", "B003O6HLOK", "B00309XHD0", "B005185SDA", "B001E7MMNG", "B0023CBZ70", "B002I0J4AM", "B003O6E67A", "B004UDB9SA", "B004CDBP9G", "B003O6HE0Q", "B003O6HDHA", "B005TH6BD4", "B00163LW7K", "B008XMSR6G", "B003O6E6EI", "B0050SXEM8", "B0050SX2MK", "B002EZH804", "B004HCYVO8", "B00KVR4HEC", "B005THAX6K", "B000GKCI4A", "B002AB7TX8", "B004WL4LOY", "B00109KMQC", "B00G6S2SE6", "B001YHX4B0", "B001TOMQOY", "B003O6HAS2", "B000R39GPK", "B0032LTVX6", "B004MXM7WU", "B002BRZ6UE", "B003A6X0HG", "B000ZK7ZOY", "B000QAVV6G", "B00J226358", "B000X1TC0U", "B007UM599S", "B004FUI84G"], "bought_together": ["B003O6G1L4", "B0021TVYCG"], "buy_after_viewing": ["B0044SA734", "B0021TVYCG", "B003O6G1L4", "B00B59MXGY"]}, "salesRank": {"Video Games": 8163}, "categories": [["Video Games", "PlayStation 3", "Games"]]}