{"asin": "B000MG3LDA", "description": "The Return of Tiberium, The Return of Kane, The Return ofC&C;.The year is 2047. A massive nuclear fireball explodes high in the night sky, marking the dramatic beginning of the Third Tiberium War and the long-awaited return of the most groundbreaking Real-Time Strategy franchise of all time.Command & Conquer 3 Tiberium Warsunveils the future of RTS gaming by bringing you back to where it all began: the Tiberium Universe. With the corrupt substance Tiberium blanketing most of the Earth, the infamous Kane is back to lead his Brotherhood of Nod in a massive global assault on the Global Defense Initiative (GDI) and the few remaining livable Blue Zones left on the planet. Only you can stop him. Featuring state-of-the-art next-generation graphics, an epic story, and truly innovative features such as the ability to transform online battles into a spectator sport,Command & Conqueris about to reinvent RTS gaming &#133; again. Welcome back, Commander.FEATURESFast, Fluid, Fun&#151;The ultra-responsive, smooth-as-silk gameplayC&C;invented is now better than ever, intuitively placing your entire arsenal at your fingertips.35+ Single Player Missions&#151;In a vast open-world theater of war where each decision you make matters, you&#146;ll experience one cohesive, epic story told from the unique perspective of all three warring factions.RTS as a Sport&#151;Play an RTS game as a sport for the first time! Observe, broadcast, and compete in thrilling online battles with innovations including all-new interactive spectator modes, VoIP communication, player commentary, and more.Story Like You&#146;ve Never Seen&#151;High-definition, live action video sequences that seamlessly tie the game&#146;s epic story together feature an unparalleled, diverse Hollywood cast, including talent from Star Wars, Starship Troopers, Battlestar Galactica, LOST, and House and the return of Joe Kucan as Kane.AI with Distinct Styles of Play&#151;The game AI matches your style of play&#151;choose from play styles such as &#145;rushing&#146;, &#145;turtling&#146;, and more, or level the battlefield and let the AI use its own tactics to give you the highest level of challenge.New Ways to Attack&#151;Keep your opponent guessing by building flying battleships, wielding the power of terrifying Ion Storms, and combining units to form powerful, never-before-seen super-units.Technology Makes the World Come Alive&#151;Lose yourself in reflected sunlight and scream in sheer joy as you blow chunks off of enemy tanks, structures, and anything else you can launch a rocket at. The game world gains a new dimension and the battlefield comes to life as the atmosphere fills with smoke, fire, haze, tracers, explosions, and state-of-the-art weather effects.Intuitive and Evolved Interface&#151;A fully evolved side-bar interface allows you to completely manage your base operations while never leaving the action.", "price": 12.95, "imUrl": "http://ecx.images-amazon.com/images/I/51PoP5sS0ZL._SY300_.jpg", "related": {"also_bought": ["B000YJ09QW", "B002NIP6X8", "B0016BVY7U", "B000CPKIT6", "B001FLGEEE", "B002BXN6GY", "B00007LVJD", "B002L6HJCI", "B000FJSIUA", "B0000CE1GK", "B00000DMA8", "B000SOYG8U", "B00005QJDS", "B002SU4QG4", "B002SKDIKE", "B000FNA2QY", "B000ZKA0J6", "B000U8AYOO", "B002GJMGNM", "B000R2WI0G", "B001Q96ZNU", "B006ZPAYJ6", "B00005A3I5", "B003BJ09QM", "B00005V9Q1", "B001UHO8KU", "B001RQWJ2S", "B002BXKJA0", "B004H48VFQ", "B000AB603U", "B000YJ3TR8", "B002I0JIQW", "B0006SL93I", "B0031MAI10", "B00027CXEM", "B000B63RSA", "B000FGA1US", "B000PWWL64", "B0007GBBHI", "B00AQ2BLI2", "B000YQ639M", "B00001IVRD", "B0050SZ836", "B0026EGO3A", "B002I0KP4G", "0761543554", "0761555781"], "buy_after_viewing": ["B001FLGEEE", "B000CPKIT6", "B002NIP6X8", "B000YJ09QW"]}, "salesRank": {"Video Games": 13906}, "categories": [["Video Games", "PC", "Games"]]}