{"asin": "B009D9CZ5C", "description": "AnkerAnker offers diverse consumer tech solutions including batteries, adapters, networking devices, and more. We are passionate about excellence so that with every Anker brand purchase, you can expect to find quality materials, reliable performance, affordable prices, and great customer service.Features:The Anker vertical ergonomic optical mouse is designed to reduce forearm twisting and the resulting repetitive stress and pain. The vertical \"handshake\" position encourages a neutral wrist and arm alignment for greater comfort and better health. No finger contortions are needed to operate the easy-to-reach buttons. The thumb rest has been reshaped to provide even more comfort over earlier versions, and the addition of two programmable thumb buttons provide greatly extended functionality.Compatibility:Windows 7 / Vista / XP / 2000LinuxMac OS XPackage included:1 x Vertical MouseBuy with confidence:Next business day shipping24 x 7 Email Support18 Month WarrantyNOTE:1. You may not get used to the product at the beginning, due to its innovative design. Please keep using the product for a few days, and you will enjoy its company.2. The two thumb buttons are not recognized on the Mac OS.", "title": "Anker&reg; Vertical Ergonomic Optical Mouse, Wired, USB, 5 Buttons - Black", "price": 23.99, "imUrl": "http://ecx.images-amazon.com/images/I/31iMyjwqxVL._SY300_.jpg", "related": {"also_bought": ["B000A6PPOK", "B000UVD8B2", "B001FWKA7A", "B00000JRRD", "B001FWOXVE", "B00427TAIK", "B005LZ1WGK", "B00008KWWF", "B00006I51C", "B004SUIM4E", "B00BIFNTMC", "B00FPAVUHC", "B00CEO4SH6", "B001F42MKG", "B0076KQRXG", "B004N0ACVK", "B001CWOKEM", "B004V94FFW", "B005BI6J8I", "B005XWR5NA", "B000RBBMNG", "B000F2BP7U", "0965510999", "B004GXZ69W", "B00ABZPX06", "B0016A0RLA", "B0016OV5MQ", "B0043T7FXE", "B006L88X04", "B0083EZE4M", "B006W2SYF8", "B001G7R0M2", "B00006B9CR", "B00004Z5RA", "B000Q6UZBM", "B005CPGHAA"], "buy_after_viewing": ["B00BIFNTMC", "B00FPAVUHC", "B000A6PPOK", "B00427TAIK"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Mice"]]}