{"asin": "B003HC85D2", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Cable Adapters"]], "description": "The UltraAV DisplayPort to VGA cable adapter enables the connection of your DisplayPort supported computer to a VGA (HD-15) supported monitor or other VGA display. It supports VGA analog resolutions of up to 1920x1200 (WUXGA), 60Hz and is simple to setup and easy to use. Connect the DisplayPort (male) end of the connector to your computer and plug your existing VGA cable from the monitor into the VGA (female) adapter. Setup is complete, no software required. The circuitry built into the DisplayPort to VGA cable adapter seamlessly converts the DisplayPort&#x2019;s video signal into a crystal clear VGA video signal. The latching DisplayPort connector keeps the adapter securely in-place. The DisplayPort to VGA cable adapter requires no external power. It is designed to use the power provided through the DisplayPort connection. The power-saving standby mode is initiated through the DisplayPort source or based on the monitor&#x2019;s status, which is automatically detected by the adapter. Standby mode reduces power consumption when the adapter is not in use and is ideal for energy conservation. Features: Connect a DisplayPort Enabled Computer to a VGA (HD-15) Monitor, TV or Projector. Integrated 10-bit, 162 MHz Video DAC Delivers Clear VGA Output. Automatic Sink Detection and Standby Mode for Energy Conservation. Features a locking DisplayPort cable for a secure connection. Features are subject to the capabilities of the computer and graphics solution.", "title": "Accell UltraAV B101B-003B Display Port with VGA Active Adapter", "price": 29.0, "imUrl": "http://ecx.images-amazon.com/images/I/41-1dpkdr0L._SX300_.jpg", "brand": "Accell", "related": {"also_bought": ["B005G306I2", "B004FPTQTM", "B002FJQXXC", "B004GL72K0", "B00DOZHLAA", "B004071ZX0", "B00879DM56", "B004AIJE9G", "B0041O7XHY", "B003V4TV8O", "B0098HVXXY", "B002BL6B7C", "B004FPO2NW", "B00581F43Y", "B000P24YBY", "B0055B8100", "B003AVPV1O", "B006DJ5E08", "B003TSDG06", "B005H3I38Q", "B000067SOH", "B005AT2LI0", "B00062WV9U", "B009L14FHI", "B00653OOPS", "B0098Y77U0", "B004SUO1GM", "B005H3I38G", "B007KFVQXI", "B004S4R5CK", "B004C9M7UG", "B00D78QCYK", "B0019804U8", "B001TH7T2U", "B00D601UC8", "B0031SEMBQ", "B00484IEJS", "B003VAGXZC", "B00C2BJ664", "B005H3Q59U", "B0000BVYT3", "B00A5TXSCI", "B007PLL4CK", "B00483WRZ6", "B003VANO7C", "B002CSRF9M", "B003NREDC8", "B0007T27H8", "B000V1LX40", "B00969J3EU", "B00BWF5U0M"], "bought_together": ["B0007Y1SJQ"], "buy_after_viewing": ["B004AIJE9G", "B005G306I2", "B00879DM56", "B002FJQXXC"]}}