{"asin": "B004H8FNC6", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "Bloggie3dBloggie Duo CameraDouble troubleSporting a 2.7-inch screen on the back and a 2.0-inch screen on the front, the Bloggie Duo makes self-recording a snap.Self-recording made easyWe all love to extend our arm and take fun pics of ourselves with friends. With the Bloggie Duo, you get a live view of what the lens sees. The full-color, 2-inch screen proves to be very convenient.Finding facesFace Detection technology recognizes faces and optimizes camera settings for both video and still images, so faces are captured more clearly and look more natural.Easy shooting. Easy sharingNow you can record and share those must-see moments easier than ever. Every Bloggie captures HD video and fits right in your pocket. Best of all, uploading your videos to the internet is a cinch.ShootWhen fun happens, your Bloggie is there. Shoot life's must-see, must-share moments in beautiful high definition.Full HD 1080P VideoCapture beautiful, 1080P video in the web-friendly MP4 format, perfect for uploading to sites like YouTube. The handy HDMI out even lets you watch videos on your HDTV.Auto-Macro shooting and 4x digital zoom&nbsp;&nbsp;&nbsp;With the Bloggie Duo camera you'll be able to take pictures or video from as little as 4-inch away, perfect for capturing a business card or a new friend's phone number.Sony Exmor CMOS sensor for high-quality video/stills&nbsp;&nbsp;&nbsp;The Bloggie Duo camera's&nbsp; Exmor CMOS sensor delivers&nbsp; high-quality video and pictures with less grain, even in challenging lighting conditions.Built-in rechargeable battery&nbsp;&nbsp;&nbsp;The built-in battery contributes to the Bloggie Duo camera's sleek and stylish design while powering the large 2.7-inch screen and camera functions.Built-in LED Light&nbsp;&nbsp;&nbsp;The Bloggie Duo camera features an LED light that can assist in low-light situations giving you more flexibility when capturing your video.Razor Sharp StillsCapture up to 12.8-megapixel stills with impeccable detail for cropping shots or large prints. You can even use the Dual Record feature and simultaneously take pictures while shooting video.Image StabilizationGot shaky hands? SteadyShot image stabilization technology is built in to help reduce blur, making your videos and photos look even better.ConnectOnce you've caught the magic on your Bloggie, it's time to connect your compatible Mac, PC or HDTV where you can do so much more.Built in USB ArmNo cables needed. Just flip out the built-in USB arm and connect directly to your computer. It charges the camera, tooShare it LaterTag videos and images on your Bloggie while on the go and mark them for upload to your favorite internet sharing sites the next time the camera is connected to a computer.HDMI OutJust connect an HDMI mini cable (sold separately) and you can enjoy video from your Bloggie on your compatible HDTV.ShareWhy keep the fun to yourself? Connect to your world and share your experiences with friends and family.Share PrivatelySave the good stuff for your inner circle. Personal Space by Sony gives you free private sharing with friends and family when used with the built-in Bloggie software.Share PubliclyUsing the built-in Bloggie software, you can share your videos and photo with a few clicks. The Bloggie makes posting to your favorite social network sites a snap.Compare all BloggiesBloggie 3D CameraBloggie Touch CameraBloggie Duo CameraBloggie CameraKey Feature3D Video and still image recording capabilityCapacitive touch screenSecond LCD for Self-recordingSlim designHD Video1920x1080p MP41920x1080p MP41920x1080p MP41920x1080p MP4Still Images5MP12MP5MP5MPHD Record TimeUp to 4 hoursUp to 4 hoursUp to 2 hoursUp to 2 hoursRecording &amp; Playback on2.4-inch LCD Vertical/horizontal3.0-inch LCD Vertical/horizontal2.7-inch LCD Vertical/horizontal2.7-inch LCD Vertical/horizontal", "title": "Sony Bloggie Duo Camera (Violet)", "price": 189.0, "salesRank": {"Camera &amp; Photo": 2730}, "imUrl": "http://ecx.images-amazon.com/images/I/41yWlnB44eL._SY300_.jpg", "related": {"also_bought": ["B004Z0JRK0", "B001PO5VZY", "B005CSB9AK", "B0048FU2GU", "B0045DPCNI", "B0037TA7QS", "B004MJBZXG", "B0043D4V8M", "B0043CVH2Q", "B002KIBFKY", "B0043CYRT6", "B004MJ9ZVK", "B00352GTNC", "B005CSBBWQ", "B004MJBJ14", "B001PO5VYU", "B0037TA7TU", "B0043CWU22", "B005BI23KQ", "B005CSBAK4", "B0056BIZXW", "B0054RSR8Q", "B006CT73DU"], "bought_together": ["B004Z0JRK0", "B0045DPCNI"], "buy_after_viewing": ["B0043D4V8M", "B0043CVH2Q", "B003VNKNF0", "B003VNKNEQ"]}}