{"asin": "B001UEN67Y", "description": "As the sequel to the acclaimed racer of 2007,DiRT 2is set to take off-road racing games to a new level. Packed with a wide variety of features and in-game events such as new benchmark technology, thrilling new race types, big event atmosphere, stunning locations, a new breed of off-roading heroes and a peerless line-up of super-charged speed machines,DiRT 2isn't your standard off-road racing game. It is the new standard..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }High flying arcade fun.View larger.Varied events and environments.View larger.Customization options.View larger.Easy access to favorite cars.View larger.Promising a thrilling race experience and an extreme sports attitude that borrows from snowboarding and skateboarding culture,DiRT 2will take players on a World Tour to diverse and challenging real-world environments to compete in contemporary off-road events. Specifically selected to deliver aggressive and fast paced racing,DiRT 2&rsquo;s garage will house a best-in-class collection of officially licensed rally cars and off-road vehicles; covering seven vehicle classes and players will be given the keys to powerful machines right from the off.In addition,DiRT 2come complete with full online functionality that will be core to the overall experience, with head-to-head competitive online play and new social features to engage the racing community. Prepare for mud, gravel, dust and dirt too inDiRT 2.Turbo-charged Off-roading with Extreme Sports AttitudeDefined by its multiple disciplines, encompassing the very best that modern off-roading has to offer and fuelled by the 3rd generation of Codemasters&rsquo; world-renowned EGO Engine technology,DiRT 2has more attitude, more adrenaline and more DiRT than ever &ndash; off-roading just got cool.Take it on TourDiRT 2will take players on a World Tour to compete in aggressive multi-car and intense solo race events in the most diverse and challenging real-world environments. Career paths will span the globe as players unlock tours in stunning locations spread across the face of the planet. Races within the USA, Japan, Malaysia, Baja, Croatia and others await as players climb to the pinnacle of modern competitive off-roading.It&rsquo;s All About the EventDiRT 2is adrenaline-fuelled extreme sports with eye-popping visuals and presentation in stunning real-world locations. Events include exhilarating rally cross in the massive Los Angeles sports stadium&rsquo;s \"Stadium King Shootout,\" edge-of-control canyon racing of Utah&rsquo;s \"Creek Trailblazer\" event, the \"Rawang Rally Run\" along treacherous Malaysian rainforest tracks and the \"Battersea Battle,\" where night races are staged at the iconic London power station.Love Your RideEmbark on a game-long love affair with your favourite cars. Rather than being forced through a checklist of in-game cars,DiRT 2enables players to pick their favourite rides and drive them across multiple disciplines. Upgrade them, cherish them - and then smash them to bits at breakneck speeds. Get to know which to use for what event and surface, tweak them to perfection, then push them to the absolute limit.The Complete Off-road Online PackageDiRT 2invites players to become part of an extreme sports community, with full online multiplayer race events and community integration across multiple disciplines. With leader boards, news feeds and &lsquo;scribbles&rsquo; to keep you up-to-date on your friends&rsquo; racing achievements,DiRT 2will be a social hub for off-roading fans.Key Game FeaturesTurbo-charged off-roading action and in-game characters with extreme sports attitudeAdvanced graphics fuelled by the 3rd generation of Codemasters&rsquo; world-renowned EGO Engine technology.A World Tour race mode that encompasses both aggressive multi-car and intense solo race options.Diverse and challenging events set in real-world environments, including sport stadium racing at Los Angeles' \"Stadium King Shootout,\" edge-of-control canyon racing of Utah&rsquo;s \"Creek Trailblazer\" event and jungle racing at Malaysia's \"Rawang Rally Run.\"The Ability to pick your favorite rides at any time and drive them across multiple disciplines instead of being limited to a few choices.Access to a wide array of online multiplayer race events and community integration across multiple disciplines.2-8 multiplayer support both on Xbox LIVE and via system link.Teams, leaderboards, tournaments, player stats, voice messaging and voice functionalities supported via Xbox LIVE.", "price": 55.0, "imUrl": "http://ecx.images-amazon.com/images/I/61971BY22SL._SY300_.jpg", "related": {"also_bought": ["B000OPPR7W", "B004Q8N7IE", "B0074LIX16", "B007NUQIXS", "B00149Y1G0", "B0016NM7BU", "B0056WJA7Q", "B002E1SBVI", "B0016MJ7OQ", "B002I0H8R8", "B0093FO2S4", "B004K73JGG", "B0050SYDEQ", "B000UKZ20S", "B000MUXLOK", "B0050SY0L2", "B003O6E986", "B002ACFZ10", "B0009WPZMW", "B000TP2V3A", "B004NRN5E4", "B0058VI1SO", "B002AQNT14", "B005EZ5GQY", "B008HHTDP6", "B003VWGBD4", "B008BT80UY", "B001L8DKM0", "B0046CC4R0", "B000FRVCAA", "B000P297JS", "B003UT9XII", "B000M4M7BO", "B0050SWTAQ", "B000B7Q4CU", "B00BU7WVG8", "B002BSA2LQ", "B00A6GW30I", "B0007ZD79E", "B002I0H1J8", "B00488PZ1E", "B0023CBY4E", "B000BQUV5M", "B001ASJIRM", "B001HWB68K", "B00269QLI8", "B002X36HW2", "B001OAKUZU", "B0048C8VKM", "B003JVKHEQ", "B004RIACPY", "B000WEQL02", "B000VBIGK4", "B002QHDKE8", "B0054JK8KO", "B004Q8L46G", "B001PB9J14", "B000F3AADE", "B0002IQCSY", "B000P0XA4I", "B001TOMQTY", "B008YTAJLE", "B003ZSP0WW", "B003O6EA4E", "B0009WPZOA", "B00354NAYG", "B005NH6NMY", "B000TI836G", "B00CJ7IUGS", "B000FRU0NU", "B003O6C9LK", "B00503E8S2", "B0001DI6FM", "B0083RDTXM", "B0053BQN34", "B0009S4UOA", "B000FRU1UM", "B004FSE52C", "B002BSA20M", "B004CVQUGQ", "B0050SYY5E", "B002I098JE", "B0050SYILE", "B0050SYX8W", "B000X1PE16"], "bought_together": ["B000OPPR7W", "B00149Y1G0"], "buy_after_viewing": ["B004Q8N7IE", "B007NUQIXS", "B000OPPR7W", "B003O6E986"]}, "salesRank": {"Video Games": 7268}, "categories": [["Video Games", "Xbox 360", "Games"]]}