{"asin": "B002NU5UW8", "related": {"also_bought": ["B00169N0BK", "B0098HGNGG", "B000L9M2LU", "B0098HGNFM", "B0098HGNLQ", "B0040609WO", "B00827MK3S", "B001ENW61I", "B006TF36TM", "B00GUQJZCW", "B005KEL4NI", "B004TGZ7WM", "B003T1Q8EO", "B000BTCJNG", "B000JLO31C", "B00BP1W52Y", "B009APMNB0", "B00FZ15M48", "B005KEL4BU", "B0055MBQOW", "B0041L3JS4", "B003UOIMAS", "B006TF37H8", "B007FH1KX2", "B001M4HTAW", "B0034WR71G", "B001KELVS0", "B002ZIMEMW", "B007FH1LJU", "B007BD4BRC", "B00551636O", "B00BXA7N6A", "B001M4HXB2", "B007TCITAA", "B008AZJXDM", "B0055MBQOM", "B007TIYZ3Y", "B00IK0PWJG", "B0094IF6G2", "0321968166", "B00C3KP4U6", "B0009QZDL6", "B007ODZYRK", "B001KNP3MQ", "B00908A8PK", "B0018LQVIA", "B00BQ5UO1S", "B003TYDBYQ", "B001DIG46M", "B00181R8SM", "B0009BX0AM", "B000ARHJPW", "B00827MIC6", "B000OG3YOY", "2880466520", "B0049H89F8", "B00A9PB8WU", "B003Y2KCAY", "B00BWV72O8", "B001JQLH8I", "B00009UTL1", "B004XY65WQ", "B00JQ69AF0", "0321966465", "B0090BSSZO", "B0042X8Y7M", "B007NDL56A", "B0083Z6R4W", "B006ISEJ9Q", "B00CLKOWVA", "B005T741VS", "B001AXKY70", "B00DNADZME", "B004G3NW5M", "B0050YG3CU", "B004TL3VJ8", "B0095PWR4S", "B009RVLX1S", "B002NEGTSI", "B001E4LC6C", "B00I0WGGIK", "B007B8Y1KO", "B00I44F14O", "B00CXM03D2", "1598639870", "B00E8NLOY6", "B004861IX0", "B00AA5LPT0", "B00009UTQD", "B00004ZCI3", "B00139VKU6", "B007NDL54C", "B00K8ROO6G", "B006LZQ6O2", "B001TANZ0W", "B00004ZCIC", "B006G5ZVA2", "B00BPE6ERS", "B007P1C4RO"], "bought_together": ["B00169N0BK"], "buy_after_viewing": ["B006TF37H8", "B0055MBQOW", "B000JLO31C", "B0055MBQOM"]}, "title": "X-Rite MSCCPP ColorChecker Passport", "price": 88.44, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/51IpBwPy66L._SY300_.jpg", "brand": "X-Rite", "categories": [["Electronics", "Camera & Photo", "Accessories", "Digital Camera Accessories", "Accessory Kits"]], "description": "ColorChecker PassportWindowsMicrosoft Windows XP 32 or 64 bit (with latest Service Pack installed)Microsoft Windows Vista&reg; 32 or 64 bit (with latest Service Pack installed)Microsoft Windows 7, 32 or 64 bit (with latest Service Pack installed)512MB RAMIntel Pentium 4 or AMD Athlon XP or better CPU200 MB of available disk spaceUser must have Administrator rights to install, uninstall the application.Monitor resolution of 1024x768 pixels or higherInternet connection required for software updateMacintoshMac OSX 10.5.x, 10.6, or 10.7 (with the latest updates installed)G4 Processor or higher (Intel recommended)512 MB RAM350 MB of available disk spaceUser must have Administrator rights to install and uninstall the applicationMonitor resolution of 1024x768 pixels or higherInternet connection required for software updateAbout the ColorChecker PassportColorChecker Passport is a powerful 'capture to edit' color solution for any photographer looking for more accurate, consistent color and creative flexibility. And when you combine ColorChecker Passport with Adobe&reg; Imaging solutions you'll gain even greater benefits. ColorChecker Passport combines three photographic targets into one pocket size protective, self-standing case that adjusts to any scene. Together with the included camera calibration software, you get the ultimate in functionality, flexibility and portability.There are so many ways to incorporate X-Rite ColorChecker Passport into your Raw workflow. Whether you take advantage of the entire solution, or just a couple of ColorChecker Passport's many features, you'll realize improved quality and productivity almost immediately.CREATIVE ENHANCEMENT TARGETTwo rows of warming and cooling patches in the middle guide you to create pleasing and repeatable edits. Creatively refine the color of your image by adding warmth to skin tones or boost the deep greens or blues in a landscape. Simply click through the patches to view the adjustment, and select the one that provides your optimal look. Then, save the setting and apply it to other images that were shot under that same lighting to create pleasing edits - it's that easy!When it comes to clipping, the Enhancement target highlights the power of working in Raw. A row of clipping patches across the bottom serve as a visual reference for judging, controlling and editing images for shadow details or highlight clipping. Although it may appear from a preview that shadow or highlight details have been lost, it is possible that the processing software just clipped them and they are still available in the Raw file. With some careful adjustments, you may be able to bring them back.The clipping patches are separated into two groups: light and dark. The light patches are ordered with 1/3 of an F-stop difference between them. The dark patches are ordered the same, with the exception of the last patch; which represents the blackest patch in the ColorChecker target. The exposure difference between the darkest and next darkest patch is approximately 1/10th of a stop, and the dynamic range of the target is about 32:1 (5 stops). In Adobe applications, use these patches along with the clipping preview to ensure you are not losing details.Across the top of the Enhancement target, the top HSL (hue, saturation, lightness) row includes 8 spectrum patches to ensure color fidelity across all hues so you can evaluate and edit for any color shifts.WHITE BALANCE TARGETThe ColorChecker White Balance target is an all-new spectrally flat target that provides a neutral reference point across different lighting conditions that you encounter during a photo shoot. Since the target reflects light equally across the visible spectrum, creating an in-camera custom white balance can properly compensate for varying lighting. You'll be able to:Eliminate color castsImprove the color preview on your camera's display so your histograms are more reliableMake post production color editing faster and easier by eliminating the need to neutralize each image individuallySetting a custom white balance for each lighting situation will make the previews on your camera's built in display more color correct, make your histograms more reliable, and speed up post production color editing. Raw shooters can capture anytime during the session to gain these benefits, while JPEG shooters should make it your first shot.CLASSIC TARGETThe ColorChecker Passport includes a travel-sized version of the Classic 24 patch target. When combined with camera calibration software you can produce DNG profiles of your camera's response to scene lighting to get consistent, predictable and repeatable results from image to image and camera to camera.The Classic target also provides a visual point of color reference. Photograph it in the same lighting as your images; then open it in your photo processing software as a reference to help with color correction. Each of the 24 color patches represents the colors of natural objects, such as sky blue, skin tones and leaf green; and each patch reflects light just like its real world counterpart. Each square is individually colored using a solid tone to produce pure, flat, rich color without dots or mixed tints.The Classic can help you make global corrections based on accurate information. If you shoot a large number of images that all require the same color correction, you know that editing a few key photos and applying your changes can sometimes change colors you didn't intend to be changed. A shot of the ColorChecker Classic captured under the same lighting as your images will provide a point of reference, so you can see exactly how changes will affect the rest of your colors before you apply them. Since your changes can be applied to one photo or a group of images, you'll achieve consistency throughout your images.CAMERA CALIBRATION SOFTWAREWith the included ColorChecker Passport Camera Calibration Application and Lightroom&reg; Plug-In, you can quickly and easily build DNG profiles for Adobe&reg; Imaging solutions including Lightroom&reg;, Photoshop&reg;, Photoshop&reg; Elements, Camera Raw (ACR) and Adobe&reg; Bridge.This new advanced profiling technology provides excellent results with just the small 24-patch ColorChecker Classic target, producing DNG profiles that work exceptionally well, even in unusual artificial light sources. Plus, software auto-detection will locate the target automatically. Whether you are shooting with just one camera or multiple cameras, you'll easily establish an accurate color foundation and maintain control of your colors. A very powerful feature of the software is the ability to create dual-illuminant DNG profiles. This type of profile takes into account two different light sources to create a single profile, which can be applied to an even wider variety of lighting conditions. Dual-Illuminant profiles can be made with any two of twenty-one supported illuminants, allowing you to create a profile for just about any kind of lighting condition you may encounter. Dual-illuminant profiles allow you the freedom to move between the represented lighting conditions without switching profiles.Camera calibration for Raw shooters enables greater capability to calibrate and correct colorAccurate color gives a consistent foundation for creative interpretationMinimize color differences between cameras and lensesAdapt for mixed lightingMake color balance match across different scenesSHOOTING JPEG NOT RAW?You'll still gain many great benefits when you include ColorChecker Passport in your workflow.White Balance TargetEnsure your JPEG files are captured with the correct white pointEliminate the chance of any extreme white balance errors which cannot be corrected later in JPEG workflowSave time on post production edits of each individual shotCreative Enhancement TargetEvaluate and optimize shadow details or highlight clipping with gray ramp patchesUse as visual reference for color spectrum and color adjustment with HSL (hue, saturation, lightness) patchesWarm or cool imagesClassic TargetPhotograph the Classic target in the same lighting as your images and use as a visual reference to help with color correction"}