{"asin": "B0000C8VEK", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]], "description": "In 1990, Canon's first EOS Rebel revolutionized photography by making SLR excitement available to everyone. In the decade that followed, the Rebel grew and evolved to give its legions of fans even more photographic freedom.  Now the Rebel achieves its ultimate evolution. Equipped with Canon's exclusive \"digital trinity\"--a 6.3-megapixel CMOS sensor, Digic imaging processor, and compatibility with over 50 of Canon's superb EF lenses--the Digital Rebel breaks definitively through every remaining barrier to truly deliver photography without limits. Create memorable images no matter what your level of experience. Nurture your creativity with easy controls and a world of EOS accessories. Share and reproduce your images with state-of-the-art digital freedom. The world's first affordable, premium-quality digital SLR makes it all possible.Capture Any Shot the Way You See It--BrilliantlyThe seven-point wide-area AF system makes focusing quick and accurate, even when your subject is off center. Seven focusing points are laid out in a cross pattern that's visible on the clear, uncluttered viewfinder. You can let the camera detect your subject and choose the proper focusing point--it will then be illuminated for no-surprise focus. The Digital Rebel supports your own creative vision as well, by letting you choose your own focusing point. Dioptric adjustment lets you shoot comfortably with or without your glasses.Dazzling Resolution: 6.3-Megapixel CMOS SensorThe camera's large-format, high-resolution 6.3-megapixel CMOS sensor delivers images that will astonish you with their depth and detail. Every image is remarkably detailed throughout the full dynamic range, from highlights to shadows. The large sensor has a 3:2 aspect ratio to give you the familiar compositional feel and classic image proportions of a 35mm camera.Canon's more than 60 years of photographic experience went into the CMOS sensor's invention and refinements and the way it works in perfect tandem with the imaging processor. Together, they virtually eliminate stray light and off colors. Even long exposure images, like of city lights against a night sky, are clear and virtually noise-free.The sensor supports an extensive range of ISO speeds. This allows you to quickly compensate for shifting light conditions, as if you had film of various speeds actually built into the camera. In short, the CMOS sensor allows the Digital Rebel to achieve film-quality images while offering all the advantages of digital technology.RAW and JPEGIn RAW mode, every shot is captured as both a RAW and middle/fine JPEG file. RAW files render the most detailed printed images, while less-detailed JPEGs are also smaller, making them perfect for sending via e-mail and viewing on computer screens. Having both kinds of files recorded automatically means that whatever you decide to do with your final images, you're covered.The Speed to Capture the Shots That Won't WaitHighly responsive autofocus makes for shooting excitement. The camera automatically employs one of three AF systems to deliver fast, spot-on focus in any situation. One-Shot AF is the best choice for still subjects, locking in focus as you press the shutter button halfway. AI Servo AF tracks active subjects, predicting their movement. AI Focus AF switches between One-Shot AF and AI Servo AF when subjects start and stop--perfect for children, pets, and other unpredictable subjects. A high-speed, 2.5 frame-per-second motor drive powers the continuous shooting mode, letting you capture split-second action sequences with a burst of up to four shots.The DIGIC Imaging ProcessorCanon's exclusive DIGIC chip gives the Digital Rebel spectacular image quality, natural color reproduction, and fast, responsive handling. The general-purpose imaging processors used by most digital cameras perform pixel operations one at a time. DIGIC, however, operates in parallel mode for exceptionally fast processing. Fast processing combines with high-capacity buffering to eliminate waiting time between shots, so when the great shots are ready, you are too. Newly developed antinoise/high-resolution algorithms make stray light and off-color pixels minimal to non-existent. Feel free to enlarge and crop with exceptional results.ISO FlexibilityDigital Rebel's digital component performance is impressive, offering you many advantages. ISO speed can be set from 100 to 1600, so when lighting conditions change, the camera can change with them. A conventional SLR would have to hold multiple rolls of film at various speeds to match this flexibility!Works Smart on Its Own, Hands Over Control When You Want ItThe Digital Rebel's 35-zone, AF point-linked Evaluative Metering Sensor and three metering modes make the art of controlling exposure as easy or advanced as you want. Thirty-five-zone evaluative metering ensures accurate, consistent exposure, taking into account lighting extremes and subject position through the active focusing point. Whether the light is bright and sunny or darkly atmospheric, whether it comes from the front or the back, exposure is detailed, natural and flattering.Control is there when you want it, with Partial Metering to bring extra sensitivity to high-contrast situations, or Center-Weighted Average Metering in manual exposure mode. Creative exposure options go even further with illumination from the built-in flash or an optional EX-series Speedlite: you can use Canon's most advanced flash metering system, E-TTL, plus FE Lock, High-Speed Sync and Wireless E-TTL Autoflash.A Fun Companion, At Your Side Wherever the Day Takes YouThe Digital Rebel is compact and lightweight, with a secure rounded grip. In fact, it feels so good in your hand you'll want to bring it everywhere. Operation feels familiar and intuitive, whether you're new to digital, new to SLR cameras, or even new to photography itself.The mode dial makes one-handed shooting comfortable, with digital and shooting controls easily accessed and cross keys located right under your thumb to handle the operations you'll use most. The LCD screen is big and informative, and you can even adjust the brightness setting. Menus are written in plain language and tabbed on a single screen--no scrolling necessary. The highly intelligent built-in flash pops up and fires automatically in appropriate modes for point-and-shoot convenience.The Versatility of SLR Photography with Point-and-Shoot SimplicityThe right-side-mounted mode dial makes one-handed shooting comfortable, and 12 versatile shooting modes let you make the call: shoot fully automatically, master a given situation with a Programmed Image Control mode, experience the excitement of manipulating shutter and aperture combinations, or go fully manual. Additional advanced exposure controls include AE Lock, FE Lock and AutoExposure Bracketing, which records three consecutive exposures for one shot to make sure you get the effect you want. And with a touch of the depth-of-field preview button, you can check the front-to-back sharpness of an image just before shooting. Illumination is always flattering thanks to automatic flash output reduction in backlit daytime conditions and built-in redeye reduction.", "title": "Canon EOS 6.3MP Digital Rebel Camera with 18-55mm Lens", "price": 749.0, "salesRank": {"Camera &amp; Photo": 6411}, "imUrl": "http://ecx.images-amazon.com/images/I/51G7D1Q1ZVL._SY300_.jpg", "related": {"also_bought": ["B000W05O5O", "B000BNY64C", "B001T9N120", "B0002A4M4I", "B007Z0MN30", "B00065ANY2", "B000U92PHW", "B003Y60DZO", "B001NS0OZ4", "B000T9251O", "B0030UL7IG", "B003SFWG5G", "B00065ANYW", "B000FW1X4K", "B000V5K3FG", "B000BO3CW8"], "buy_after_viewing": ["B003VNKNF0", "B00EFILPHA", "B0039BPG1A", "B004J3Y9U6"]}}