{"asin": "B000085AHJ", "description": "In the open-ended space action/adventure gameFreelanceryou play a ne'er-do-well with a lucky streak, one of two survivors of a space disaster. Penniless and shipless, you venture around a space dock until you find a ship and a job. You'll encounter a heady mix of canned missions that follow one main quest, and a million opportunities to make money or aggravate the various factions that co-exist in the universe. Like an online role-playing game, or Bethesda'sMorrowind, you determine who your enemies are and who your friends are by your own actions, and, in another nod to role-playing, you can customize your ship with guns, rockets, and equipment just as you would customize a RPG character with swords, bows, and magic items. Best of all, you can play cooperatively with friends or fight it out with enemies online.The backstory posits a future where various countries, divided by both nationality and, seemingly, race, have boarded massive colony ships and ventured into a wormhole that appeared within reach of our crude space technology. They found themselves in a galaxy far, far away and they got stuck there when the wormhole collapsed. They quickly colonized new home worlds and named everything with familiar locales that make navigation a breeze. In the American sectors you'll feel at home entering the New York system and landing at a spaceport called Manhattan, for example. While contrived, this device is used beautifully and it's far better than having to memorize a bunch of sci-fi names and remembering where they are, perfect for a massive universe such as this one.ThoughFreelanceris set in space, it is technically not a space simulation. The game was designed to be accessible to casual gamers. For example,Freelancermakes you use the mouse for ship control. This is quite a shift for a game genre normally known to require joystick control. But even old-schoolWing CommanderorX-Wingfans may find that the sacrifice of verisimilitude is made up for with gains in agility. The mouse controls your guns, while you use the keyboard to maneuver around the rich universe that developer Digital Anvil has constructed. Much like a first-person shooter, you can dodge and weave while precisely blasting your enemies.Despite the game's age, its graphics are spectacular, as is the sound and voice acting, and in that way, fighting and trading with friends or alone,Freelancerproves worth the wait. Just keep in mind that it is explicitly not a hardcore space simulation, and you'll have to leave your joystick on the shelf.--Andrew S. BubPros:A deep and interesting universeGame adjusts to your choices and affiliationsInnovative and addictive co-op multiplayerIt looks like a space sim but plays like a RPGCons:Joystick isn't even an optionIt looks like a space sim but plays like a RPG", "price": 34.95, "imUrl": "http://ecx.images-amazon.com/images/I/515YFTX450L._SY300_.jpg", "related": {"also_bought": ["B00004R9AL", "B00001LDCK", "0782141870", "B00K6ZUOQE", "B000083JXD", "B002V8KA72", "B00371R8P4", "B001CXYMFS", "B0029M6VKA", "B004ING996", "B000NJFMR4", "B000H3HK3U", "B00009OY9U", "B003BJ09QM", "B00030GSJY", "B00009TW6R", "B00006B84Z", "B00002EPYI", "B00002EPYY", "B00FAVVKO4", "B000LQ4HTS", "B000063EKR", "B0000663TT", "B00005ASGK", "1616617691", "B000SOYG8U", "B00006B84X", "B0000512IE", "B000WCCURW", "B0006NGZ7S", "0700026657", "B000EVMK8K", "B00D3LA698", "B0002BQN7Q", "B001E2I4H4", "B005OM6CGU", "B002OH8U0Y", "B00B1N07QM", "B00ENFVUGQ", "B00002SU5C", "B004QRKWLA", "B00HWWUQYY", "B003UEREBQ", "B001AH8YSW", "B0045ZB66I", "B00AEGRGNO", "B002BS47YE", "B00BMFIXZG", "B001B5U80K", "1477817409", "B00CJ7IUIQ", "B00B5QLS4A", "B003L8DXS4", "B001EYU1VO", "0316129062", "B00906HM6K", "1477809783", "B0007D90EW", "B0079NGSDO", "1601251505", "B00E3W1726", "B00C7103JI"], "bought_together": ["B00004R9AL"], "buy_after_viewing": ["B000NJFMR4", "B00009OY9U", "B002V8KA72", "B0065NP39E"]}, "salesRank": {"Video Games": 10840}, "categories": [["Video Games", "PC", "Games"]]}