{"asin": "B000056KDW", "description": "After making a name for himself with horror classics such asThe  Damnation Gamenovel,The Books of Bloodshort-story collection, and  the feature filmsHellraiserandCandyman, Clive Barker has slowly  moved away from the horror genre toward more fantasy-centric work. Barker hasn't  completely forgotten about his first love, however, andClive Barker's  Undying, a first-person action game from Electronic Arts and DreamWorks  Interactive, beautifully captures the type of horrors that populated Barker's  earliest works. And not only is this game genuinely frightening, it's also a lot  of fun to play.Cast against the backdrop of Ireland in the year 1923,Undyingfollows  Patrick Galloway, an investigator of the paranormal. Galloway has been summoned  to Ireland by his old war buddy Jeremiah Covenant to put an end to the strange  occurrences at the Covenant family estate. What Galloway finds is a house of  horrors that is populated with Jeremiah's dead siblings (and other ghastly  creatures), all of whom want to snuff out Jeremiah so they can complete a spell  cast when they were children.Graphically,Undyingis first rate. TheUnreal Tournamentgraphics  engine has been used to great effect and the result is amazing character models  and environments. The haunted mansion is suitably dark, with wispy draperies and  macabre paintings. The estate's grounds are a mix of lush Irish countryside and  crumbling ruins, all set against vivid skies.Pretty pictures aside, the most impressive thing aboutUndyingis its  atmosphere--this game is flat-out scary. Every element of the game, be it the  gothic architecture, eerie story, great weather effects including rain and  lightning, or amazing sound effects, perfectly complement each other. The result  is a gameplay experience that rivals theResident Evilseries in terms of  generating sheer terror in the player.The great atmosphere isn'tUndying's only innovation--it also features a  very cool two-handed attack system. Most action games saddle the player with an  attack system where one hand controls all the weapons and the other hand does  nothing. InUndying, the left hand (and left mouse button) controls the  standard weapons, such as the pistol and shotgun, while the right hand (and  right mouse button) casts spells. This is a great gameplay device and ensures  the action stays at a frantic pace.Of all the spells in the game, the coolest is the Scrye spell. When cast, it  lets the player see and hear past events--some of which are quite  horrific--and  occasionally it shows you how to progress beyond a certain level. This help can  come in the form of highlighting certain objects or unveiling a portal, but  whatever the method it is a very well-designed gameplay element.The only real complaints withUndyinginvolve the long loading times  between levels and the system requirements, but even those aren't enough to  derail this excellent--and terrifying--action game.--Kilmic RobbinsPros:Very, very creepyAmazing sound effectsExcellent graphicsSlick controlsCons:Long loading timesStory is a little convoluted", "price": 22.79, "imUrl": "http://ecx.images-amazon.com/images/I/51VVE0SDN9L._SY300_.jpg", "related": {"also_bought": ["B000R2W8WE", "B004FZ9822", "B004CD9X2W", "B0001X5YN4", "B000RPHJDO", "B003ZULWQI", "B001UWGDPS", "B00006C2HA", "B007BYWJ8Y", "B000R39GPK", "B001IRFVLC", "B001D7798A", "B00AMA4L4E", "B000GPVUUS", "B00002SUOV", "B000KMCF0G", "B0012LGHZI", "0425165582", "B005CFBZQ6", "B001Q96ZNU", "0761532226", "B006W41WF0", "B00004UE0V", "B000XJK40O", "B0012S3X2Q", "B00002CF8V", "B0000CFWA4", "B000NUQQZ0", "B00000K4AX", "B000O5HZTK", "B0007M69SS"], "bought_together": ["B000R2W8WE"], "buy_after_viewing": ["B004FZ9822", "B000R2W8WE", "B001IRFVLC", "B000BHQZAQ"]}, "salesRank": {"Video Games": 26341}, "categories": [["Video Games", "PC", "Games"]]}