{"asin": "B00EVNVRM2", "categories": [["Electronics", "Camera & Photo", "Video Surveillance", "Surveillance Cameras", "Bullet Cameras"]], "description": "High Definition Bullet. Clarity and detail are a given when you protect your home or property with a Q-See IP surveillance camera. With a recorded image size of 1920x1080, Q-See IP cameras offer a clarity unlike any other conventional surveillance camera available to the consumer. The larger 1080p image sizes means more pixels which translates to even more clarity and detail on the screen. At reasonable distances this camera will capture the numbers on a license place, record a person's face and even discern between currencies. Colors appear crisp and video flows smoothly. The QCN8004B bullet IP camera offers stunning 1080p resolution as a standalone or with your existing NVR system. This high quality camera offers access to video streams via an internet browser or compatible mobile device. An NVR is not required to view live video feeds! Its ability to independently monitor makes it in ideal standalone monitoring asset or peripheral camera to an existing NVR system. Constructed of sturdy aluminum, it's also built to last with a weatherproof and rustproof housing making it ideal for indoor or outdoor use. Never worry about changing weather conditions affecting your camera! Versatile 3-axis brackets allow the camera to be mounted to just about any flat surface, such as a wall or ceiling. A quick fix or part of a larger integrated system, the Q-See HD 1080p IP Camera secures your property with crystal clear resolution.", "title": "Q-See QCN8004B 1080p High Definition Weatherproof IP Bullet Camera with 100-Feet Night Vision (White)", "price": 239.96, "salesRank": {"Camera &amp; Photo": 4213}, "imUrl": "http://ecx.images-amazon.com/images/I/41TuNafMnHL._SX300_.jpg", "related": {"also_bought": ["B009KPAR2M", "B00DY2Y1QU", "B00DWGRQ10", "B009F7EQAY", "B002MPVJGU", "B009HPBSGE", "B00G3DDBVI", "B001PS9E5I", "B000FI9VU2", "B009F7EQPY", "B000QYEN1W", "B000063UZW", "B009P4QQPU", "B005O55U2Y"], "bought_together": ["B009KPAR2M"], "buy_after_viewing": ["B009KPAR2M", "B00G3K1XC0", "B00DY2Y1QU", "B00H7OF2LY"]}}