{"asin": "B00004W4QJ", "description": "Three years ago, gamers were introduced to Aya as she resigned from the  New York Police Department and enlisted as a NMC (neo-mitochondrion creature)  hunter for the shadowy government organization M.I.S.T., a secret agency of  monster slayers somewhere betweenGhostbustersandMen in Black.  Wherever there was a neo-mitochondrion outbreak, Aya and her team were on the  scene to put the boots to the mutants. From the outset, it's evident that  SquareSoft revamped the entire game to give gamers a better looking, sounding,  and (most importantly) playing experience.The game starts with Aya training in the agency's shooting gallery in Los  Angeles. Just as she begins to get in a groove, she is asked to look into some  strange happenings at the Akropolis Tower. When she arrives on the scene, an  explosive, full-motion video flashes across the screen and showcases the death  and carnage as Aya surveys the scene. Her entry into the Tower is where this RPG  begins.SquareSoft has kept some of the excellent elements of the weapons systems from  the firstParasite Evetitle, but went for an entirely new battle system.  Combat is delivered in real time and allows players to run, hide, and open fire.  Aya can tap into her parasitic powers and can unleash elemental, magic-based  attacks on the many foes she encounters. Ammunition is plentiful in the game and  there are plenty of entertaining weapons to choose from. Auto targeting and  involving puzzles are back, though the arrow-pointing interface for solving  these puzzles is really hard to operate.The cinematic mix of story and action is very well done, and the numerous  cutscenes do an excellent job of moving the pace along in a believable way.Even though the originalParasite Evehad its problems, SquareSoft has  pieced together an excellent sequel that will satisfy fans of the first game and  help create many new ones.--Todd MowattPros:New, real-time battle system is an improvement over firstParasite  EveGreat weapons and plentiful ammunitionGreat mix of story and actionCons:Clunky interface for solving puzzles", "price": 241.18, "imUrl": "http://ecx.images-amazon.com/images/I/516K6Y0BB0L._SX300_.jpg", "related": {"also_bought": ["B000038ABO", "0744000017", "B000038IFX", "B00000K1VE", "B0000296O5", "B00004SPW9", "B00004TC6E", "B00000JRSB", "B00001XDUB", "B00004S9AF", "B000034DMG", "B0045U4U52", "B00004Y57G", "B00000I1BY", "B0019LMXAY", "B000038AAN", "B00004XOM1", "B00002SVX5", "B00004S9AC", "B00000K39I", "B00001ZWMV", "1566868246", "B00001X50M", "B000FDOTIQ", "B000006OVE", "B00002SWCJ", "B000034DBS", "B00005BW7Q", "B000G82R20", "B00004SWM0", "B000059Z7Q", "B00000K1VA", "B00002SVWG", "B00004U4R4", "B0045L3SNQ", "B00004XMRL", "B0002CHJAA", "B00008RUYZ", "B0001OK7VW", "B00001OWYW", "B00001ZUGT", "B00KVRK39A", "B00004WLZ7", "B000G7X5P4", "B00005LOXE", "B00000IM2T", "B00008KTRS", "B0015MMN6G", "B00002R28C", "B00007LV7Y", "B000637T7S", "B00005ME6O", "B0002GTFIK", "B000K6TOK6", "B00008URUA", "B0009XBWY6", "B00002STJN", "B00005Q8M4", "B000IONGU4", "B00002STPG", "B000FPGZUE", "B00005YO7I", "B000G0O6CW", "B001QTW2GY", "B00006LELI", "B00019HNNC", "B00002STPE", "B00024W1U6", "B00001X50L", "B000066TS3", "B00004XOWT", "B00004RBQX", "B000784XG2", "B000006OVJ", "B0011BE3KA", "B00000I1BZ", "B00005MA97", "B000B69E9G", "B00005ME8S", "1566867142", "B00000DMAR", "B00005ME6N", "B00J6DLPLK", "B0000TSRA6", "B00004R9IL", "B00005TNI6", "B0002CTTR6", "B000F3AACA", "B00005B70K", "B00002STPM", "B00004WMQB", "B00005JXXX", "B000TLU67W", "B0009VXAM0", "B00004WFRN", "B0000CED4T", "B000BKSGH8", "B0001Y7404", "B00019HNNM"], "bought_together": ["B000038ABO", "B00004TC6E"], "buy_after_viewing": ["B000038ABO", "B00004TC6E", "B0045L3SNQ", "B00000K1VE"]}, "salesRank": {"Video Games": 5439}, "categories": [["Video Games", "More Systems", "PlayStation", "Games"], ["Video Games", "PC"]]}