{"asin": "B00003G1RG", "description": "Go to the Memory Finder tosee a listingof the digital cameras, PDAs, MP3 players, photo printers, or other products that are guaranteed compatible with this Viking product. TheMemory Findercontains an up-to-date list of the devices that work with this memory.Benefits of Adding Flash MemoryIncreased Speed: With a larger flash card you will spend less time transferring files to or from your computer or laptop and more time taking pictures with your digital camera, listening to music on your digital audio player, or storing more information on your PDA.Increased Power: Increasing the memory storage for your digital camera, PDA, or MP3 player will enable you to do more with a device. For example, if you are taking pictures on your digital camera using the highest resolution and highest quality setting, an image taken from a 2-megapixel camera can be as large as 6 MB. This can eat up storage space quickly, so it's easy to see the benefits of increasing your device's flash memory.Guaranteed CompatibilityIt is important to purchase memory that is guaranteed to be compatible with a device because of the many subtle differences between the hundreds of different brands, types, and configurations of digital devices on the market. A product that accepts one particular brand or capacity of memory does not necessarily accept another brand or capacity--and there's nothing more frustrating than buying something you can't use.Because compatibility is so critically important, Amazon has forged a strategic relationship with Viking Components to create the Memory Finder. TheMemory Finderis a tool that can help you find memory that works with your specific product, taking the guesswork out of buying memory.Quality ProductsViking Components physically tests their flash cards with hundreds of devices including laptops, PDAs, digital audio players, and digital cameras. When you purchase a Viking flash card, you can be assured that it will perform flawlessly with your specific device. Furthermore, Viking uses only the highest quality components to manufacture their flash memory, which results in fast, reliable, durable flash products.Viking Components has its own registered ISO 9000 certified facilities. ISO 9000 is a family of standards approved by the International Standards Organization that provide a framework for quality management and quality assurance. ISO authorized and accredited registrars frequently visit our ISO 9000 facilities to perform internal quality audits to verify that all quality activities comply with documented procedures and to measure the effectiveness of Viking's quality systems, including the organizational structure, responsibilities, procedures, processes and resources for implementing quality management.Viking has established and maintains documented procedures for handling, storage, packaging, preservation and delivery of product to ensure the highest quality and complete standardization compliance during each process. Viking's ISO 9000 certification guarantees that Viking's quality processes and standards conform to specific requirements to ensure consistency of product for customers worldwide.Superb ServiceSince 1988, Viking has built customer loyalty and long-term partnerships as the industry leader in customer service. As a result, when you purchase this item you can expect the industry's best customer service policies including: a 5-year replacement warranty, guaranteed product compatibility, 24/7 toll free technical support, a liberal returns policy, and a 24-hour replacement policy in the unlikely event of a Viking product failure.If you have any further questions about this product, please feel free to send an e-mail to:amazoninfo@vikingsupport.com", "title": "Viking 128 MB CompactFlash Card (CF128M)", "price": 13.99, "imUrl": "http://ecx.images-amazon.com/images/I/41G0DJZSYYL._SX300_.jpg", "related": {"also_viewed": ["B0093HGEKG", "B0093HGDVG", "B0093HGF32", "B002NO8PTY", "B0093HGD2K", "B0093HGG18", "B00GGM6LRW", "B002WE4H8I", "B00ECEVE50", "B005IMFX2K", "B004NDEWWW", "B00IAYFD0K", "B002WE0QN8"], "buy_after_viewing": ["B000W05O5O", "B002NO7Q26", "B0093HGEKG", "B001NS0OZ4"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Memory Cards", "CompactFlash Cards"]]}