{"asin": "B00004WHWF", "description": "As we made ourselves comfortable in the demo room for THQ's unveiling ofRed Faction, I figured I'd get the toughest question out of the way straight off. \"So, what is it about this game that's going to set it apart from everything else?\" Without hesitation, Rob Loftus, the Associate Producer, responded, \"Take a look at this!\" Half an hour later, I had come to the conclusion that the genre of first-person-shooters was about to get a much-needed kick in the pants.What was it, you ask, that convinced me thatRed Factionwill make a very big splash when it hits store shelves next year? It's a new-fangled bit of code called Geo-Mod -- essentially the engine that will powerRed Faction. What this brilliant new piece of programming brings to the table is the ability to perform real-time, arbitrary geometry modification. Don't worry -- when I first heard that phrase I had no idea what it meant either. Simply put, this engine is capable of simulating advanced physics effects on the environment - if you shoot something you put a hole in it relative to the size and trajectory of the projectile that hit it.For instance, you can fire a rocket into the ground and it will leave a crater (to be used as a solitary fox hole). Fire off a few more rockets into the same hole and you'll have a nice little trench for yourself to hide in. In other words, the environments are completely blow-up-able (for lack of a better description). Of course, it goes much deeper than shooting holes in the ground. Is that sniper in the tower bugging you? No problem... blow up the tower's base and watch the little camper fall from his nest to a (well deserved) death. Stuck in a room and no keycard/key/lock combination? Blow a hole through the wall. Need to get inside a pipe? Blast it open. The possibilities are endless. As Alan Lawrence, Lead Designer forRed Factionputs it, \"We wanted to give the player the power to destroy whatever he wants, not just pre-determined objects.\" To emphasize the level of Volition's achievement in getting this engine functional, Epic Game's tech guru, Tim Sweeney, had described deformable terrain as \"the holy grail of first-person gaming.\" From this showing, Volition \"chose wisely\".The Physics of Liquids and GasesStructures aren't the only things that you can realistically interact with inRed Faction; liquids and gases also behave as they would in real life. If you see a stream of water, you can fire a rocket into the side of that stream and the water will flow into the new hole you just made. You can even completely redirect that stream of water and make it go anywhere you want. Smoke from pipes will travel in the direction that the wind is blowing and sparks from electricity will bounce off the floor. None of this is pre-scripted; it's all on the fly. Even your bullet casings will bounce off surfaces realistically. For every action, there's a perfect reaction delivered by this impressive engine. Blow the support columns of a bridge and it will collapse, crushing any and all enemies beneath it. Needless to say, the Geo-Mod engine is unlike anything we've ever seen before.However, as an old wise man once said (actually, it was just Rob Smith), \"What good is an engine without a killer game to go with it?\" Luckily, Volition has proven time and again that it is a very capable development house. After all, it did bring us the excellentFreespacegames. WithRed Factionthe group plans on surpassing anything it's done in the past with the goal of dethroning the current king of first-person-shooters,Half-Life. To do this, a full-time writer is tasked with ensuring a deep and involving storyline. There will be in-game cut scenes, as well as in-game dialogue to keep the narrative going and draw you in. As Lawrence put it, \"We're focused on creating a realistic and consistent world forRed Faction, with the goal of creating the most immersive FPS to date.\"The story follows a man named Parker, a miner on Mars who works for a large conglomerate known as the Ultor Corporation. Apparently, a deadly disease known as The Plague [that pro writer is earning his corn! -Ed] is spreading through the miner population. Already stuck with inhumane living conditions, the miners decide that this is the final straw. A rebellion breaks out and Parker gets caught up in an epic struggle to bring down the Ultor Corporation and find a cure for the deadly plague. Of course, this won't be easy; Ultor is a very large company with great influence, power, and almost unlimited resources. And like any megalomaniacal conglomerate worth its salt, it reeks of pure evil. As should be expected, Ultor uses its influences to bring in a group of mercenaries to stamp out the rebellion.So what's a poor miner to do when faced with overwhelming odds? Get guns, of course...lots of guns. While the list of available weapons is not finalized yet, it has been confirmed that there will be around 15 of them. Definitely making the line-up are a handgun, an assault rifle, a sniper rifle, and a rocket launcher, and the others will maintain similarities with real world weapons. Volition plans to ensure that all the weapons will have a satisfying and visceral impact - a direct result of the responses to Epic'sUnreal. The assault rifle fires either in bursts or at full-auto, and has a very distinct chatter that will be instantly familiar to anyone who has been exposed to the real thing (and lived!).The sniper rifle is fairly standard issue, but is sure to please. The true head-turner will be the rocket launcher. This compact tool of destruction comes complete with its own infrared scanner. A screen attached to the launcher displays a red glob whenever an object that gives off heat is in range. This allows you literally to see through walls. For example, you could be walking down a hallway watching the scanner and spot the bad guys, even if they're hiding behind something. You can then use the rocket launcher to blast through the wall and take that sorry sod out to pasture. Of course, the infrared scanner will have a limited range. Volition is still hard at work on the rest of the arsenal, but you can be assured that the final lineup will be more than adequate for your fragging needs.Finally, there are the vehicles: submarines, APCs, and various flying vehicles round out the selection. You can use the APC to ram through walls, and it also has a mortar mounted on it to get rid of other pesky barriers. One of the most impressive parts of the demo was the underwater sequence where piloting submarines serves up some deep-sea action. The effects are incredible and will remind many gamers ofThe Abyss(but not that crappy ending). Enemy subs actually implode when destroyed and the light sources are incredible. There's even plankton in the water to help give you a sense of motion.With a promising storyline and the Geo-Mod engine in its corner, this could be one of the biggest hits of 2001. The engine should open up previously unexplored areas in the genre and add some much-needed innovation. If the rest of the development schedule is as productive as what's already been accomplished, we'll have to dust off some of the superlatives reserved for the likes ofHalf-Life. --DailyRadar Review", "price": 3.99, "imUrl": "http://ecx.images-amazon.com/images/I/51MV0MZAZNL._SY300_.jpg", "related": {"also_bought": ["B00007KK0F", "B003P9C6EQ", "B0014UGK4U", "B002I0JAJ2", "B000HMQE8S", "B00007M5D8", "B000E31OFS", "B00005QX4F", "B00005N7YM", "B00000K4AX", "B00009WDS8", "B000028U28", "B00005QX48", "B00006599Y", "B0007II11K", "B00000K3QV", "B001AZTU28", "B001D7798A", "B00009MQHU", "B001EM7TUC", "B000BC38RO", "B0001BYH16"], "bought_together": ["B003P9C6EQ"], "buy_after_viewing": ["B00006J3H0", "B0014UGK4U", "B003P9C6EQ", "B00006LELA"]}, "salesRank": {"Video Games": 34212}, "categories": [["Video Games", "PC", "Games"]]}