{"asin": "B007OY5V68", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]], "description": "AYL Portable Mini Speaker System with Rechargeable Battery and Expandable Bass Resonator is an extraordinary audio device. It offers the right balance between sound, quality and portability.Surprisingly Loud Clear Sound with Expandable Bass ResonatorEngineered for exceptional clarity of sound, audio with high fidelity. Built-in amplifier for a surprisingly loud volume. Size defying sound.Device CompatibilityCompatible and Connects to any audio player and multimedia device that has a standard 3.5mm Audio Jack to the AYL portable mini speaker; including the Apple iPhone, iPods, iPads, MP3 Players, Laptops, Desktop PC, Samsung Galaxy and Note 2, Tablets.Long-lasting Playing TimeIts powerful built-in amplifier produces exceptional sound while its high capacity battery facilitates up to 10 hours of continuous playback on a single charge.Create and Enhance a Positive AmbianceIt is so portable in size and weight that you can easily carry it anywhere with the included velvet pouch. Enjoy and share your music, movies, games, anytime and everywhere. With its pocket-sized portability, it is convenient so you can enjoy your music indoors and outdoors, at the beach, park, picnic, party or family gathering.Perfect Gift IdeaIt's a great affordable gift for family, friends and for yourself. With the AYL portable speaker, you can surround yourself with good music, anywhere, anytime!What's in the Retail Gift Box- AYL SPK001- Soft Black Velvet Pouch for Easy Traveling- USB Cable with 3.5mm Audio Jack- User Manual3 Year Worry Free Warranty", "title": "NEW AYL&reg; Portable Mini Speaker System with 3YR GUARANTEE (Black) with Rechargeable Battery and Expandable Bass Resonator for Smartphones / Tablets / MP3 Players / Computers / Laptops / Cell Phones / iPhone 5S / iPod! Great Gift for Every Occasion!", "price": 17.99, "salesRank": {"Cell Phones & Accessories": 975}, "imUrl": "http://ecx.images-amazon.com/images/I/41GtzLZQ44L._SY300_.jpg", "related": {"also_bought": ["B004C51HRY", "B004HHICKC", "B008I646WG", "B0082E9K7U", "B00CP7SWII", "B000QCHMG2", "0152167730", "B00CA4WTHQ", "B0025VKUPW", "B002MAPT7U", "B002OFOK50", "B008CC3LWC", "B00FZR0W7Y", "B0027VT6V4"], "bought_together": ["B004C51HRY", "B004HHICKC"], "buy_after_viewing": ["B004HHICKC", "B0082E9K7U", "B001UEBN42", "B00CP7SWII"]}}