{"asin": "B000GR9P76", "description": "The Lord of the Rings Online: Shadows of Angmarputs you into the greatest fantasy of all time. For the first time, you can immerse yourself in the only authentic recreation of Middle-Earth to explore legendary lands, interact with famous characters like Gandalf and Aragorn, and create your own heroic story. The War of the Ring has commenced! As the Fellowship embarks on their quest to destroy the One Ring, you must defend the Free Peoples against Sauron's evil minion, the Nazgul Witch-King. Adventure solo or forge fellowships, battle hideous monsters and rise to fame in the most epic MMO ever launched.FEATURESEpic Storyline -The Lord of the Rings Onlineis the only MMO based on the extensive and beloved fantasy universe of J.R.R. Tolkien, and the first MMO to provide a compelling story behind players' actions. It is the original epic world that serves as the source for all other \"me too\" fantasy games.Unique Combat and Advancement Systems -The Lord of the Rings Onlineimplements unique game mechanics which surpass skills and levels to include accomplishment, traits and titles to help you gain experience in a variety of ways and to advance your character beyond traditional grinding.Monster Battles - Jump in as a monster and battle against other gamers in a fast, action-packed session of monster vs. player combat.Innovative Social Networking -The Lord of the Rings Onlinetakes social networking tools to the next level. Besides in-game mail, chat, crafting and guild management tools,The Lord of the Rings Onlineuses next-generation features like integrated voice chat, instant messaging and automatically updated web pages with your characters' in-game stats. These innovative tools engage players, facilitate real-time communication and encourage community.", "price": 49.99, "imUrl": "http://ecx.images-amazon.com/images/I/51GbfzXZg7L._SY300_.jpg", "related": {"also_bought": ["B001FS7FE0", "B001FS8XAK", "B003DNLDR0", "B001CWXAP2", "B001S4U674", "0761553304", "B00167X6YI", "B000E7E9JM", "B002W8XTL0"], "buy_after_viewing": ["B001FS8XAK", "B001FS7FE0", "B003DNLDR0", "B000CA5FLW"]}, "salesRank": {"Video Games": 21958}, "categories": [["Video Games", "PC", "Games"]]}