{"asin": "B00000DMB2", "description": "It is a time soon after the destruction of the first Death Star. Luke Skywalker has formed a squadron of hot-shot pilots to engage the still-formidable Imperial forces. You, as Luke, must lead this rogue squadron in a series of galaxy-spanning raids and rescues. To complete all your missions, you'll need good flying skills, fast reflexes, a keen eye, and a quick trigger finger.You get to fly all your favorite ships: The X-wing, Y-wing, snowspeeder--even the Millennium Falcon. There are also some \"secret\" ships, such as the sleekNaboo StarfighterfromStar Wars: Episode I, The Phantom Menace, a TIE interceptor, and, um, a '78 Buick.The flight simulation in this game is first-rate. You'll find yourself leaning to the side as you pull a high-G turn in pursuit of Imperial TIE fighters. And the outstanding graphics and sounds are realistic enough to transport you to theStar Warsuniverse. Every detail is in place, right down to the individual Stormtroopers you can see running around (and trying to shoot you). One of the more impressive sequences lets you bring down Imperial Walkers by using the tow cables on your snowspeeder. Nice touch.This is a single-player game, but you start each mission with a few wingmen from your squadron, and the well-done spoken dialogue between pilots and commanders really makes you feel like part of a team. The only significant shortcoming is the lack of a cooperative multiplayer option. With its excellent gameplay, varied environments, and interesting missions,Star Wars: Rogue Squadronis sure to become a long-time favorite.--Eric FredricksonPros:Faithful to lots ofStar WarsdetailsSatisfying flight action, explosions, sound effectsInteresting missions and plotSee--and fight over--the Spice mines of Kessel and other famousStar WarsplanetsCons:For some reason, you can only fly clockwise when bringing down a WalkerNo \"easy\" setting for those without The ForceVoices of Luke, Wedge, and Han don't sound like the real thing", "price": 249.98, "imUrl": "http://ecx.images-amazon.com/images/I/41baU3rtsTL._SX300_.jpg", "related": {"also_bought": ["B00002STFD", "B00000J2OO", "B00000DMAT", "B00000ID61", "B00002STH0", "B00002STGL", "B000056FLI", "B00002STI2", "B00000F1GM", "B00000DMB5", "B00002STEZ", "B00000INR2", "B00004UG9B", "B00002DHEV", "B000031KJT", "B0015OG4G4", "B00000DMAX", "B00003OTI3", "B00000ID60", "B00005M8TL", "B00000DMAO", "B00002STFH", "B000Y0CHX4", "B0000A1OG4", "B00000I1BB", "B00005QDPZ", "B00000DMAQ", "B00001QES1", "B005GTND0E", "B00000J2W7", "B000031KJM", "B000PJHAD6", "B000HA3NZC", "B00002STFP", "B002TK1PX0", "B00004S9AA", "B00001TZYA", "B00002STGU", "B00004U1R2", "B00000K2G7", "B005GTNBGK", "B00002STH5", "B00004U1QY", "B00004S9A7", "B005DI7N7W", "B000F9JFXE", "B0009Y808Q", "B000038A6U", "B000021Y30", "B000QHOHHE", "B005GTNC8W", "B00000IFRI", "B000021Y2Z", "B00002STGN", "B00000JHPD", "B000YOCGUO", "B003UI5GLC", "B003ZU0PHU", "B00001X5C3", "B00001WRJO", "B00004TUF1", "B00001TZYB", "B00000K1AF", "B00000DMB9", "B00004U1R1", "B00001QERY", "B00000JHPT", "B000038A7C", "B00002STHX", "B00004R9IB", "B00000I1BE", "B00004SWLT", "B00004WLMA", "B00001X5BU", "B00004U1R3", "B000046Q7Q", "B00000JQQM", "B00001P4VO", "B00003E4EB", "B000006OWT", "B00002STFN", "B000058BCU", "B00000JQ0V", "B00002970G", "B000JVM256", "B00000F1GS", "B009MRZAUC", "B00002STGQ", "B00002STGE", "B00002STHH"], "buy_after_viewing": ["B00000DMAT", "B00005QDPZ", "B00002STFD", "B00000J2OO"]}, "salesRank": {"Video Games": 4000}, "categories": [["Video Games", "More Systems", "Nintendo 64", "Games"]]}