{"asin": "B000JNA4LS", "description": "Amazon.com Product Description Understated, sublimely functional industrial design with unsurpassed performance and ease of use. From its flat, protective iPod cradle to its smart RF remote to its arching stainless-steel handle, this portable loudspeaker iPod dock is one that only Harman Kardon could build. Harman Kardon Go + Play delivers tight, thunderous bass from high-excursion low-frequency drivers. Just as important, the highs are distinct and crystal clear. Go + Play is AC- or battery-operated, so it will go anywhere your iPod or other music player goes--and make your favorite music sound better when it arrives. No matter how or where you use it, it's the sound that sets Go + Play apart.The Harman Kardon Go + Play multimedia loudspeaker system is designed to entertain.Click to enlarge.Go + Play works equally well on the go or as a personal home entertainment system.Click to enlarge.The system features the extraordinary industrial design, innovative technologies, and meticulous engineering that you'd expect from Harman Kardon.Click to enlarge.Go + Play delivers an incredible sound experience from most dockable iPod models, MP3 players, or other audio devices, regardless of where you happen to be.Click to enlarge.Designed to EntertainFor more than 50 years, Harman Kardon products have delivered--through extraordinary industrial design, innovative technologies, and meticulous engineering--the ultimate listening experience. And for the past 10 years, Harman Kardon has used these techniques to develop some of the world's best-sounding and most-striking-looking multimedia products available. Whether for your computer or your iPod, Harman Kardon multimedia products deliver rich, high-quality sound from systems that look just as good as they sound. In fact, the Harman Kardon SoundSticks system is now in the permanent collection of New York City's Museum of Modern Art. So hook up your computer, dock your iPod, or connect nearly any other audio device, and enjoy the ultimate listening experience from the world's ultimate multimedia products.A World-Class Listening Experience on the GoThe Harman Kardon Go + Play features an eye-catching industrial design that delivers an incredible sound experience from most dockable iPod models, MP3 players, or other audio devices, no matter where you happen to be. Using an arching stainless-steel handle and a flat protective cradle for keeping your iPod secure, the Go + Play works equally well on the go or as a personal home entertainment system.Using proprietary speaker design and technology, the sound quality from the Go + Play is simply stunning. And with flexible connectivity, this incredible sound can be had from nearly any audio device, not just your iPod. There's even an S-VHS output so you can watch the videos from your video iPod while enjoying their sound in incredible detail through the Go + Play speaker system.With an included wireless remote control, using the system is a snap. The remote gives you full control of and access to your music, however and whenever you want it. The Harman Kardon Go + Play system is the perfect combination of functional design and unparalleled sound quality.Flexible ConnectivityGreat sound shouldn't just be limited to a stand-alone system in your home. You also should be able to have great sound from your music devices when you're on the go. With the Go + Play, you now can enjoy great sound wherever you happen to be. Take it with you anywhere; it works with both the included AC adapter and on batteries. You can rock out for nearly 18 hours from just 8 D-cell batteries, and there's even a handy battery-save feature that will save your battery power when the system isn't in use.When it comes to connecting your musical devices, it couldn't be easier. Do you have a dockable iPod? Simply place it in the flat protective cradle, and instantly enjoy the sound of your favorite musical artist. The Go + Play uses a OnePoint iPod connector so that, by connecting a standard USB cable to the rear of the unit, you'll have a connection that enables you to synchronize your iPod with your computer. The Go + Play will even charge most iPods when they're docked in the cradle. Don't have an iPod? Well, you can still connect your MP3 player, portable CD player, satellite receiver, or computer through the Go + Play system's 3.5-mm input using a simple cable.The system even has the ability to connect to a television or display device using an S-VHS connection. Now, watching movies, TV shows, and other video content from your video iPod is just a connection away--and you get to listen to them through the high-performance speakers built into the Go + Play.Advanced TechnologyTo deliver unmatched high-performance sound, the system features a number of proprietary technologies, including dual-proprietary Ridge transducers. They're made from aluminum, which is inherently strong yet lightweight. This design allows these drivers to reproduce sound with unparalleled accuracy and detail for their size, and means that your music will be played back with a rich midrange and crystal-clear highs, without distortion.The included wireless RF remote control gives you the freedom to enjoy your music from across the room, in another room, or even from outside--from up to 20 feet away.Click to enlarge.To deliver thunderous bass, the Go + Play uses dual Atlas woofers, which maximize audible output. The Atlas woofers are a high-excursion design, which allows them to deliver the bass response of much larger woofers, and means you'll hear tight, deep bass that will make your music sound more dynamic.Powering the speakers are two 30-watt Harman Kardon amplifiers, which are designed to deliver high output with minimal distortion. The system even uses highly advanced digital signal processing and equalization to deliver cool, efficient power.All of that technology comes together in the Harman Kardon Go + Play system to provide a sound experience--whether on the go or in your personal entertainment space--you need to hear to believe.Easy to UseNo need to be a rocket scientist to use the Harman Kardon Go + Play system. Its elegant, stainless-steel touch-volume controls mean that a single touch increases or decreases the volume. And with the included wireless RF remote control, you have the freedom to enjoy your music from across the room, in another room, or even from outside--from up to 20 feet away. With full access to your iPod, you can easily change tracks, browse libraries, adjust settings, and scroll through extras. It's the perfect way to enjoy your Harman Kardon Go + Play system, no matter where you happen to be.What's in the BoxHarman Kardon Go + Play speaker system, power supply, 3.5-mm auxiliary audio cable, remote, adapters for iPod", "title": "Harman Kardon Go + Play Portable Speakers System with Dock for iPod (Black/Silver)", "price": 113.95, "imUrl": "http://ecx.images-amazon.com/images/I/41lEpV9h%2BbL._SX300_.jpg", "related": {"also_viewed": ["B00CBGJ1NI", "B002GHBTNC", "B003BIFJTA", "B00FSKQNEY", "B000LFF0FE", "B00IYR8W2O", "B005EZ10QO", "B0038W0N8G", "B00644JO9O", "B003VANOI6", "B00H2LLG0S", "B000V2FJAS", "B00IJSAYJW", "B000P6664I", "B00BAQJ94Q", "B004PJC9QU", "B007JCNOHI", "B008PQAB3C", "B0090IA4FO", "B008YFD5G4", "B00FQJ9MCC", "B009CA7G92", "B009CWRVH2", "B009W7GB5U", "B002I636XM", "B001DLTDQC", "B000ICZZJG", "B00ALWIV12", "B00BQ4HRG4", "B0042F3K9W", "B001FA1O18", "B0097BEF4A", "B00D5Q75RC", "B00ID2HIJS"], "buy_after_viewing": ["B003VANOI6", "B00CBGJ1NI", "B002O3W3Y2", "B0016BQS12"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}