{"asin": "B005GMRVZO", "description": "Following in the footsteps of the award-winning FinePix F200 EXR and F300 EXR models, this latest  recruit to the range is the ideal camera for discerning point-and-shoot photographers or SLR users who  want to travel light but don't want to compromise image quality and picture-taking versatility. Superb  results are assured with exciting new features including an innovative 16 megapixel EXR CMOS sensor, a  15x wide-angle zoom lens, Full HD video functionality and an improved user interface. With a stylish  design and pocketable dimensions, the FinePix F505 EXR is set to become the must-have compact in 2011.Fujifilm FinePix F505 HighlightsPerfect pictures in every situationThanks to a brand new hybrid sensor, the FinePix F505 EXR delivers extra fast, high quality results in  a wide range of lighting conditions. The 16-megapixel sensor developed by Fujifilm is a clever  combination of Back Side Illuminated CMOS (BSI-CMOS) and EXR technologies, which delivers superior  results to a conventional sensor; particularly in low light conditions, and also offers high-speed  shooting facilities and Full HD movie capture.Light falling on ordinary sensors has to pass through a layer of wiring before it hits the light- sensitive photo diodes. This layer of wiring reduces light transmission. On the EXR BSI-CMOS sensor,  however, the wiring layer is positioned behind the photo diodes so light sensitivity is vastly  improved. Add to this the triple-layer EXR technology pioneered by Fujifilm in the F200 EXR and the  result is a sensor that is capable of outstanding results, time after time.Users can still select from the usual three different EXR shooting modes, or simply leave the FinePix  F505 EXR to choose the best option itself by selecting Auto EXR. Those preferring to take control can  pick from:High Resolution mode where the sensor utilises the full 16 megapixel resolution for high quality  results that can be printed out at A3-size without the need for any re-sizing using software.Dynamic Range mode where the camera employs dual capture technology to provide a range up to 1600%  - almost a full stop wider than any other camera. Two images are captured and then merged together to  produce superb results on high contrast scenes.Signal to Noise mode utilises Pixel Fusion, doubling pixels up to increase sensitivity. Coupled  with the BSI technology, this mode delivers superb images in low lighting conditions.Keep up with the action &ndash; no matter how fast it's movingThe FinePix F505 EXR isn't just clever; it's quick as well, boasting a range of features that will keep  pace with even the fastest moving action without compromising picture quality.Image Stabilization (CMOS Shift + High ISO): Conventional digital camera  (left) vs. Fujifilm F505 (right)RAW image captureWith the ability to shoot in RAW or in JPEG format (or both simultaneously), the F505EXR will have real  appeal to those that want to be in true control of their images. By shooting in RAW mode you can ensure  that you get the true uncompressed image just as the camera sees it.Huge zoom range, tiny cameraIt's a minor miracle that Fujifilm has managed to pack such a high level specification into the FinePix  F505 EXR's compact dimensions, but it's even more impressive that the camera also features a 15x  optical zoom.Wide angle (24mm) vs. 5x optical zoom (120mm) vs. 15x optical zoom  (360mm)Despite having a body that measures just 22.9mm wide, the zoom range extends from a wide-angle setting  of 24mm through to 360mm (35mm equivalents) giving users a huge range of shooting options from sweeping  landscapes through to tightly-cropped details. Plus, image quality and sharpness is assured thanks to  the Fujinon lens and new triple core EXR processing engine that automatically reduces colour fringing  and boosts corner resolution for uniform image sharpness.Using the longer focal lengths can cause camera shake, but the FinePix F505 EXR has the bases covered  fighting camera shake on three fronts. First, the sensor moves to counter any hand movements. Second,  sensitivity is boosted using Pixel Fusion to allow faster shutter speeds and third, users can select  &ldquo;Advanced Anti-blur&rdquo; mode when in EXR Auto where a sequence of four images are taken and then combined  to provide one, shake-free result.Full HD for stunning videosPeople don't just want to capture their memories as photos any longer, there's a big demand for high- quality video capture too. Not only does the FinePix F505 EXR record videos in stunning Full HD (1080p)  at 30 frames per second, it also boasts stereo sound for high quality audio and outputs the files in  H.264 (MOV) format. Favoured by broadcasters and Blu-Ray manufacturers, H.264 produces file sizes that  are smaller and more manageable than the conventional AVI format. What's more, they're compatible with  a wide range of websites and applications, which makes it easier for users to share content on sites  including YouTube.New to the F505 EXR, Fuji's EXR SN mode is now available when shooting videos. &ldquo;Pixel Fusion Movie  technology&rdquo; fuses pixels together to create superpixels which are extra sensitive to light (and  therefore capture much crisper low-light videos with lower levels of noise.And finally, if it's speedy video capture you're after, the F505 EXR also offers a class-leading  selection of high speed video capture options. No other compact camera comes close to the F505 EXR's  incredible 320 frames per second capture at 320 x 100 pixels. But if it's higher quality you're after,  you can also capture the action at 160 frames per second at 320 x 240 pixels or 80 frames per second at  640 x 480 pixels.Wave goodbye to pixellated graphics and menusThe FinePix F505 EXR's three inch rear LCD doesn't just benefit from an increased pixel count &ndash; now  460,000 &ndash; it also uses a brand new Rich User Interface, which dramatically enhances the user experience  and kicks pixellated menus and graphics into touch.By employing Vector fonts and graphics, camera menus and readouts use smooth text and icons. The  graphics are scaleable so they take on the same appearance whether you're viewing on the read LCD or a  50 inch HDTV via the camera's HDMI output.Additional FeaturesAll-new 16 megapixel EXR CMOS sensor15x optical zoom covering 24-360mm (35mm equivalent)3.0 inch rear LCD with 460,000 pixel and new Rich User Interface using Vector fonts and graphics1600% wide dynamic rangeFull resolution high speed shooting at 3fpsFull HD movie capture (H.264 MOV file format)Advanced 27 scene mode EXR AutoFilm simulation modes360&deg; Motion Panorama modePhotobook Assist function", "title": "Fujifilm FinePix F505 16 MP CMOS Sensor and 15x Optical Zoom Digital Camera with 4 GB Class 10 SD Memory Card  (Black)", "price": 344.0, "imUrl": "http://ecx.images-amazon.com/images/I/51k8xqLMo8L._SX300_.jpg", "related": {"also_viewed": ["B006T7QSV8", "B00B46XSDK", "B00FP1HOB2", "B004HO58KW", "B004HO58KM", "B00B46XSC6", "B00ATM1NAU", "B004HO58OI", "B00HGE3CXU", "B00AX12XTC", "B009P975FK", "B00AV3XH9W", "B00B46XRN6", "B00ATM1MVU", "B00BQU11JW", "B006T7QSW2", "B0095F5AFQ", "B000P6I4XO", "B005KBB79C", "B006T7QZ1G", "B00ATM1MGA", "B0075SUK6O", "B00HZE2PYI", "B00CC9QTA2", "B006T7QRMS", "B004VTF7IG", "B00GFYTU4W", "B00FPKDPXY", "B004HO58NO", "B004TI5BI0", "B00B5MUJTO", "B00B46XSFI", "B006T7QWIM", "B0075SUKBO", "B00GFYTVZA", "B0075SUK14", "B00726185Q", "B004L1BL0M", "B004G8Q5Z6", "B006CSMIEA", "B006K553QA", "B001QENO7A", "B00B46XRK4", "B00EFILPHA", "B004HO58NY", "B00HQ4W3OE", "B00B46XLT6", "B00EFILR6E", "B003VNKNEQ", "B009AYJQ2U", "B0076W0LNQ", "B00AY6Y35I", "B00HV6KIDA", "B00HV6KI8U", "B0075SUI2A", "B00728ZBA2"], "bought_together": ["B004TM69I2", "B003VNKNEQ"], "buy_after_viewing": ["B003VNKNEQ", "B003VNKNF0", "B004VTF7IG", "B00HQ4W3X0"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Memory Cards", "SD & SDHC Cards"]]}