{"asin": "140053271X", "categories": [["Electronics", "eBook Readers & Accessories", "eBook Readers"]], "description": "Barnes & Noble Nook Simple Touch Wi-Fi ReaderIncredibly easy-just touch and read; Ultra-light, thin and the longest battery life; Most advanced E Ink 6\" display w/ crisp fonts; Expert recommendations and fun social features.Features:* Easy to Use 6\" Touchscreen: Shop for the best books, magazines and newspapers right on your NOOK with just a touch. Turn pages, look up words, highlight passages, adjust the font size and style-just by tapping the infrared-powered touchscreen.* Clear, Crisp Reading: NOOK features the most advanced E Ink Pearl technology. The high-contrast 16-level grayscale touchscreen displays text as crisp and clear as a printed page, so you can read easily-even in bright sun. 50% more contrast than NOOK 1st Edition.* Ultra-Light, Ultra-Portable: At 7.48 ounces, NOOK islighter than a paperback and super thin, yet holds up to 1,000 books, magazines and newspapers-so it's easy to take your entire library with you anywhere.* Longest Battery Life: With the longest battery life of any eReader, you can read for up totwo months on just one charge. That's enough timeto start and finish a lot of great stories-or an entire series.* World's Largest Bookstore: Over2 million titles including books, magazines & newspapers -just a touch away! Thousands are FREE, most others $9.99 or less. Pre-order books and subscribe to magazines so you'll get them the instant they're released.* Read Your Way: Make the text bigger or smaller. (See demo) Choose the font style you like. You can even add bookmarks and highlight passages while you read.* Immersive Reading Experience: With 80% less flashing than other eReaders, NOOK delivers an immersive reading experience-so it's easy to lose yourself in your latest read. And with Fast Page, just touch and hold the side button to quickly scan through any book, magazine or newspaper to get to where you want to read lightning fast.* NOOK Friends: Connect with NOOK Friends to share and fi", "title": "Barnes &amp; Noble Nook Simple Touch eBook Reader (Wi-Fi Only)", "price": 79.49, "imUrl": "http://ecx.images-amazon.com/images/I/51jat7CVtoL._SY300_.jpg", "brand": "Barnes &amp; Noble", "related": {"also_bought": ["B007UXNHNM", "B007UXNHGY", "B00IKMJOZC", "B0055ZDRI2", "B00BXCN70O", "B007UXNHWS", "B007UXNH6O", "1400532736", "B00884BPUE", "B00BXCN82Q", "B007UXNHRS", "B008I65986", "B005HI7YEK", "B00BXCN54M", "B005HI8BAG", "B005J7EOE2", "161685572X", "1616826053", "0594296420", "B00A88YXN4", "B005IBV4LK", "B00FLM5M46", "161552763X", "B005IBUZSS", "B00406Q59K", "1616855711", "B00IKML52C", "B007UXNH46", "B00BXCN60K", "B00DS70YY4", "B00DS70YGW", "B00DSK80QU", "B00BXX0QVQ", "B005QWM1UY", "B007MJD5I6", "1615527672", "B00DS70XJK", "B00IKMJNXU", "B00FLM5MNM", "B0064HU40Y", "B007HCCNJU", "B0087UBS4M", "B0069QPC0W", "B00AFKC7QK", "B004D1OBFW", "1400699894", "B0067US1R6", "B00CTTJRTU", "B0032UP32K", "B00DYQYLQQ", "B002BWQ4H8", "B00FVU5VJE", "B001F7AJKI"], "bought_together": ["B007UXNHNM", "B007UXNHGY"], "buy_after_viewing": ["B007HCCNJU", "B00884BPUE", "1400532736", "B00JG8GOWU"]}}