{"asin": "B000OH26OM", "description": "Amazon.com Product Description Navigate both North America and Europe without loading more maps with the affordable n&uuml;vi 270. This entry-level Personal Travel Assistant makes traveling so simple. For even more mapping options,n&uuml;vi 250andn&uuml;vi 200offer less map coverage at a lower price. Like all n&uuml;vi 200-series members, the 270 features an easy-to-use colorful touchscreen and ultra-slim design--perfect for everyday navigation.The n&uuml;vi 270 comes preloaded with maps for North America and Europe, and features an easy-to-use touchscreen and ultra-slim design.Configurable vehicle icons let you select car-shaped graphics.n&uuml;vi 270 accepts custom points of interest (POIs).View larger.Smart, Powerful DesignThe n&uuml;vi 270 is built with a high-sensitivity WAAS-enabled GPS receiver for extreme accuracy, as well as an SD card slot for storing your media and additional navigation tools, and a USB interface for loading data. All this is wrapped up in a package that measures 3.8 x 2.8 x .8 inches (W x H x D) and weighs just 5.2 ounces. The n&uuml;vi 270's 3.5-inch (diagonal) display is touchscreen-enabled, making it a cinch to control the device with your fingertips. A rechargeable lithium-ion battery provides up to five hours of battery life depending on use.Navigate with Easen&uuml;vi 270 comes ready to go right out of the box with preloaded City Navigator NT street maps, including a hefty points of interest (POIs) database with hotels, restaurants, fuel, ATMs and more. Simply touch the color screen to enter a destination, and n&uuml;vi takes you there with 2D or 3D maps and turn-by-turn voice directions. In addition, n&uuml;vi 270 accepts custom points of interest (POIs), such as school zones and safety cameras and lets you set proximity alerts to warn you of upcoming POIs.Go Beyond NavigationNavigation is just the beginning. n&uuml;vi 270 features many travel tools including JPEG picture viewer, world travel clock with time zones, currency converter, measurement converter, calculator and more. It also comes with Garmin Lock, an anti-theft feature, and configurable vehicle icons that let you select car-shaped graphics to show your location on the map. Optional plug-in SD cards for our line of Garmin Travel Guides and Garmin SaversGuide provide detailed data for attractions and information on nearby merchants offering discounts, so you can customize n&uuml;vi for your travel needs.Note:Like most USB Mass Storage Devices, the n&uuml;vi is not compatible with Windows 95, Windows 98 or Windows Me.What's in the Boxn&uuml;vi 270, preloaded City Navigator NT for North America and Europe (full coverage), vehicle suction cup mount, vehicle power cable, dashboard disk, and set up and go guide.Which n&uuml;vi is Best for You?Note: All n&uuml;vis come with detailed NAVTEQ maps containing more than 6 million pre-loaded point of interest locations.", "title": "Garmin n&uuml;vi 270 3.5-Inch Portable GPS Navigator (Discontinued by Manufacturer)", "price": 179.99, "imUrl": "http://ecx.images-amazon.com/images/I/51TT76HIecL._SX300_.jpg", "related": {"also_viewed": ["B00BHSTWOY", "B001U0O7RQ", "B00407238Q", "B005DIBH4M", "B0055XNWJI", "B005DIBH6A", "B00BHT7AT2", "B002ACBNXO", "B00AXX0I7Y", "B00AXX0JNW", "B003B3P2CO", "B000MNA3BG", "B004MYFTDI", "B001UO0RKS", "B002X8I27U", "B003B3P2D8", "B003KM29N6", "B00AD5EOAO", "B008JWSTC2", "B003ZX8AZQ", "B000BS2V44", "B000WJ67UQ", "B003B3P2CY", "B00AXX0JP0", "B004MYFTEW", "B00AXX0IEC", "B000L3APBK", "B00GD7DCW2", "B00AXZWG8Q", "B00AXX0I88", "B000NVZE5M", "B005DIBHCE", "B001JBOK5K", "B000F007K8", "B003ZX8B0U", "B001PKTDMU", "B0030E6I4K", "B001U0O7QW", "B0088HSMHK", "B00KXDK1KS", "B0057OCDQS", "B0057ODG6Y", "B001U0O7QC", "B004W1GQ92", "B007M4Z7GO", "B00407237W"], "buy_after_viewing": ["B00BHSTWOY", "B001U0O7RQ", "B00AXX0JNW", "B004I5BUSO"]}, "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS"]]}