{"asin": "B002QC17VG", "categories": [["Electronics", "Computers & Accessories", "Video Projectors"]], "description": "HC705HDProduct DescriptionFrom the ManufacturerBig-screen performance at a brilliant value. &mdash; Get amazing big-screen entertainment with the Epson PowerLite Home Cinema 705HD. This affordable, 720p, widescreen projector makes it easier than ever to enjoy spectacular movies, games and sporting events in the comfort of your own home. With its 3LCD, 3-chip technology, you get rich, vibrant images for a true cinematic adventure. And, with 2500 lumens of color and white light output,* images will shine bright in any room. Invite the neighbors over and experience high-def movies in a whole new way. Or, share photos from your computer via the USB connection.With seven customizable color modes, the Home Cinema 705HD is ready for any event. Setup is simple with its 1.2x optical zoom. And, it&rsquo;s easy for anyone to install. The Home Cinema 705HD is even energy efficient with a long-life E-TORL&reg;lamp that lasts up to 5000 hours.** That means you save on expenses, without sacrificing quality. So, bring big-screen entertainment home with the Epson PowerLite Home Cinema 705HD.A stunning, large-screen, immersive experience takes videogame playing to a whole new level.Brilliant widescreen performanceWith WXGA (1280 x 800) resolution, this projector is ideal for use with widescreen computers, or to display HD video content. Its 16:10 aspect ratio allows you to fully utilize the capabilities of your widescreen notebook, giving you 30 percent more usable area than a regular 4:3 image and 10 percent more than a 16:9 image. And, the Epson PowerLite Home Cinema 705HD still offers the flexibility of displaying 4:3 and 16:9 images, as needed. It&rsquo;s the ultimate in power and convenience.Easy to setup and useEnjoy the Epson PowerLite Home Cinema 705HD wherever it&rsquo;s convenient&mdash; place it on a table or in an entertainment center, or mount it on the ceiling. Depending on the image settings you&rsquo;ve chosen, you can place the projector anywhere from 8 feet to 12 feet from the wall or screen. With 1.2x optical zoom capability, auto keystone correction and four color modes, you can make easy picture adjustments to suit your viewing environment. This projector is lightweight and portable enough to stow away for storage, or take to a friend&rsquo;s house for movie or game night. The Home Cinema 705HD can also be set up for a more professional-quality viewing experience with a projection screen.Incredibly versatile connectivity for a wide range of home entertainment optionsIn addition to watching DVD movies or televised programs, you can connect the Epson PowerLite Home Cinema 705HD to other devices for even more entertainment options. Viewers may want to experience the best seats out of the house and set up a backyard theater. There are inflatable and portable screens on the market, but even a garage wall will work! Enjoy a much more immersive experience with super-sized videogames. Connect a Wii, Xbox 360, or SonyPS3 console and play larger-than-life videogames. And, remember that old carousel slide projector for family viewing of vacation slides? For an updated version, use a flash/thumb drive and the projector&rsquo;s USB port to run a looping slideshow of digital JPEG photos. Project videos and play songs from your favorite playlists on your AppleiPod. You may also view images from an HD cable or satellite TV receiver, HD DVR or HD camcorder using the HDMI video connection. The Epson PowerLite Home Cinema 705HD also doubles as a business projector for presentations &mdash; just connect through the VGA port to your computer.High-Definition 720p performance at a great valueEnjoy the benefits of high-definition entertainment &mdash; whether it&rsquo;s a blockbuster movie, live sporting event or a videogame. Native WXGA (1280 x 800) resolution, plus 2500 lumens of color light output and 2500 lumens of white light output,* allows you to enjoy widescreen entertainment, while delivering bright, vibrant image quality at an affordable price.Quality and color that's beyond amazing3LCD technology delivers amazing color and detail. Whether it&rsquo;s a blockbuster movie or live sporting event, 3LCD technology takes video performance to the next level. Delivering legendary image quality, this innovative technology always ensures a stunning cinematic experience.Color&mdash; 3LCD technology goes far beyond ordinary color. \"Clear,\" \"rich\" and \"vibrant\" barely begin to describe the incredible depth and brilliance it delivers. The impact is stunning. It&rsquo;s an astonishing level of realism you never thought possible.Reliability&mdash; 3LCD technology is durable and dependable. Road-tested by millions of projector users around the world, it has been used in more projection products than any other.Detail&mdash; 3LCD technology offers extraordinary detail. And detail is what exceptional image quality is all about &mdash; from movies to videogames, 3LCD light engines deliver incredible, jaw-dropping detail &mdash; the kind that puts you right in the middle of where the action is.Energy-efficient E-TORL lampThe innovative E-TORL lamp, exclusively from Epson, is a reliable performer that delivers more lumens per watt and lasts up to 5000 hours.** The special E-TORL design minimizes both light diffraction and light leakage, providing you the ultimate in lamp longevity &mdash; up to 65% more lamp life than competitive products. And, E-TORL replacement lamps cost up to $100 less than competing replacement lamps. So, while the E-TORL lamp maximizes your presentation time, it also minimizes your costsAmazing color and white light output&nbsp;With Epson projectors, your presentations are sure to shine bright. The Epson PowerLite Home Cinema 705HD delivers 2500 lumens color light output and 2500 lumens white light output for rich, colorful images. Whether you&rsquo;re projecting images with deep, dark colors or a white screen with minimal text or graphics, you get consistent light output. And, with Epson, you can be confident you&rsquo;re getting what you need because Epson measures white light output according to the ISO 21118 standard, a more rigid standard than the maximum or outdated ANSI lumens rating used by competitive products.&nbsp;Features/BenefitsSuper bright and colorful&mdash; 2500 lumens color light output, 2500 lumens white light output*720p, high-definition, widescreen performance&mdash; for movies, games and moreRich, vibrant color and reliable performance&mdash; advanced 3LCD, 3-chip technologyEasy setup&mdash; 1.2x optical zoom, auto keystone (+/- 30 degrees)Versatile connectivity&mdash; HDMI, USB Type A, Component Video, and S-Video digital connectionsLarger-than-life photo slideshows&mdash; USB 2.0 connectivitySeven color modes&mdash; optimize viewing for different environments and image contentEnergy-efficient E-TORL lamp&mdash; lasts up to 5000 hours**Lightweight and portable (5.1 lb)&mdash; for entertainment that goes where you goOutstanding support&mdash; two-year parts-and-labor limited warranty; Epson Home Service program and Epson PrivateLine dedicated toll-free support (U.S. and Canada only)Dimensions (W x D x H)&mdash; Including feet: 11.6\" x 9.0\" x 3.1\", Excluding feet: 11.6\" x 9.0\" x 3.0\" and Weight 5.1 lbMolded hardshell case (ELPKS58)50\" portable screen (ELPSC06)Duetscreen (ELPSC80)Epson DC-10s document camera (ELPDC10S)Epson home entertainment projectorsEpson high-definition projectors take home theater entertainment to a whole new level, featuring color and detail that&rsquo;s sure to win rave reviews from friends and family alike. With the vivid realism of Epson 3LCD technology, these projectors will make your home the hottest ticket in town. Experience movies, games and sporting events like you never have before. Designed by the world leader in projectors, these models are the ideal choice for amazing home entertainment that all are sure to enjoy.What's in the BoxPowerLite Home Cinema 705HDPower cableComputer adapterProjector remote control with batteriesSoft carrying caseComponent adapterUser manual CDQuick Setup SheetPrivateLine support cardRegistration cardEco FeaturesEnergy-efficient 200 W E-TORL lampDesigned to be recycled***** Light output varies depending on modes (color and white light output). White light output measured using ISO 21118 standard.** Lamp life will vary depending upon mode selected, environmental conditions and usage. Lamp brightness decreases over time.*** See our website for convenient and reasonable recycling options at www.epson.com/recycleEpson and E-TORL are registered trademarks, Epson Exceed Your Vision is a registered logomark and Better Products for a Better Future is a trademark of Seiko Epson Corporation. PowerLite and PrivateLine are registered trademarks of Epson America, Inc. All other product and brand names are trademarks and/or registered trademarks of their respective companies. Epson disclaims any and all rights in these marks. 8/09", "title": "Epson PowerLite Home Cinema 705 HD 720p 3LCD Home Theater Projector", "price": 909.99, "imUrl": "http://ecx.images-amazon.com/images/I/31seA4WoxgL._SX300_.jpg", "brand": "Epson", "related": {"also_viewed": ["B00EU9V3S0", "B00GMGDFPI", "B00BQ6KG9W", "B007HOHV9U", "B00EU9V3YO", "B00BAJ1QDA", "B002ZWU33U", "B00F0DI8LK", "B005SN3I4O", "B00E87E1OM", "B00D29Z1TQ", "B00EO96W2I", "B0046SQFZG", "B005J31BCY", "B005J31BCO", "B002OEBMT8", "B00EU9V3VW", "B009PK2MNY", "B00A9S3OOC", "B002RL8IHM", "B00F9ZQ9RE", "B004VELBAO", "B00F9ZQ7GC", "B005ZAMFDU", "B00E87E1LK", "B006FKQ5F8", "B005SN3I7Q", "B00E87E1NI", "B00511ITEM", "B00I0VRE6E", "B00E87E1ME", "B00GMGDH38", "B00ARW0OFM", "B00C8H690I", "B0085ZJTAE", "B004UG3BQK", "B00BRM8YM6", "B00CY9PWJY", "B005J31BDS", "B00COGA6A2", "B004U7M02K", "B0044UHJWY", "B00G2HX6OW", "B00GGM6G9A", "B003N349NU", "B005VONPT8", "B00D68Y9B4", "B006ISZM2E", "B005EV1R8Y", "B008PQA3NU", "B007ZW42CI", "B00CPV7P32", "B00G87AW3E", "B00FYIFQ6G"], "bought_together": ["B002UC9782", "B000IJY8DS"], "buy_after_viewing": ["B00EU9V3S0", "B00GMGDFPI", "B000IJY8DS", "B00A9S3OOC"]}}