{"asin": "B001ASJISG", "description": "Prince of Persiais set in a land rooted in ancient Persian mythology, with the Prince finding himself caught in an epic battle between the primal forces of light and darkness&#151;the god of Light, Ormazd versus his brother Ahriman, the destructive god of Darkness. The Prince arrives just in time to witness the destruction of the legendary Tree of Life, an act which threatens to plunge the entire world into eternal darkness. Manifested in the form of 'the Corruption,' a dark substance that physically contaminates the land and the skies, the Prince must partner with his new deadly companion Elika to heal the world from the evil Corruption.The Next-Gen of PoPA new Prince for a new story.View larger.The Hunter is not to be trifled with.View larger.Elika is a beautiful, but deadly ally.View larger.A Frightening New Enemy and a Powerful AllyAs Ahriman, the god of Darkness is released so are his minions of monstrous slaves. The most dangerous and powerful set against the Prince is known as \"the Hunter.\" Once a human prince himself, the Hunter was raised in opulent decadence and detached from the day-to-day world. His only passion was for the drama and brutality of the hunt, but soon passion grew to obsession. After killing every variety of beast known, he grew bored and too bold. Recognizing an opportunity Ahriman appeared to him and offered a bargain, a hunt against the most dangerous beasts the world has to offer in return for his soul. Foolishly he accepted and was transformed from man into demonic beast and was hunted by men from all over the world. His all-consuming rage made easy work of the hunters set against him, but also bound him to Ahriman for eternity.But wherever there is evil, there is also a counter balance to it. Following the defeat and imprisonment of Ahriman, his brother Ormazd, the god of Light, left the world in the care of his servants, the Ahuras, guardians of the tree of life. The Prince&#146;s new ally, Elika, is one of those guardians. Beautiful and mysterious she is a powerful AI companion who accompanies players throughout the game. Filled with an unknown power, she will be helpful in all aspects of gameplay, including acrobatics, combat and puzzle-solving as players quest to rid the land from Ahriman's corruption.Key Features:A New Hero Emerges- Master the acrobatics, strategy and fighting tactics of the most agile warrior of all time. Grip fall down the face of a building, perform perfectly timed acrobatic combinations, and swing over canyons, buildings and anything that is reachable. This new rogue warrior must utilize all of his new skills, along with a whole new combat system, to battle Ahriman&#146;s corrupted lieutenants to heal the land from the dark Corruption and restore the light.A New Epic Journey Begins- Escape to the new fantasy world of ancient Persia. Masterful storytelling and sprawling environments deliver to action-adventure fans an experience that rivals even the best Hollywood movies.A New Open World Structure- A first for thePrince of Persiafranchise &#150; now you have the freedom to determine how the game evolves in this non-linear adventure. Players will decide how they unfold the storyline by choosing their path in the open-ended world.Emergence of a Deadly New Ally- History&#146;s greatest ally is revealed in the form of Elika, a dynamic AI companion who joins the Prince in his fight to save the world. Gifted with magical powers, she interacts with the player in combat, acrobatics and puzzle-solving, enabling the Prince to reach new heights of deadly high-flying artistry through special duo acrobatic moves or devastating fighting combo attacks.Next-Gen Engine- The franchise&#146;s debut on next-generation consoles utilizes Ubisoft&#146;s proprietary Anvil engine, the same engine used to developAssassins Creed.A Franchise With HistoryThe critically acclaimedPrince of Persiafranchise returns for the first time on next-generation platforms with an all-new epic journey. Built by the same award-winning Ubisoft Montreal studio that createdAssassins Creed,Prince of Persiahas been in development for over three years to deliver a whole new action-adventure gaming experience to consumers. With a whole new Prince, storyline, open world environments, combat style, signature illustrative graphical style and the addition of Elika, a deadly new ally,Prince of Persiabrings the franchise to new heights of deadly acrobatic, artistry and is set to become the #1 action-adventure game of 2008.", "price": 12.93, "imUrl": "http://ecx.images-amazon.com/images/I/51CNI7vt02L._SY300_.jpg", "related": {"also_bought": ["B0030GBUCS", "B002GPPPS4", "B00319DX4W", "B000P297E8", "B00009ZVHU", "B000KLNLV4", "B0009Z3IV4", "B001NX4DUQ", "B0002CHJ3W", "B002DC8GKE", "B000XJNTPG", "B0058VI0SU", "B001UWGDC6", "B002I0JA7E", "B0050SY9WC", "B000ZK696O", "B005VBVQAG", "B00354NAYG", "B001D7T2VM", "B007UM59AC", "B003P9C6QY", "B001D25M1Q", "B000SH3XD6", "B000ZK9QD2", "B000C427NM", "B000FRVAD4", "B000WSE2WM", "B000RHZ9JI", "B003H0CC2O", "B000ZK9QFK", "B0050SY4DG", "B000A0EFJW", "B000TI836G", "B003BE6OZC", "B001E7MMNQ", "B0054INKZK", "B000R0SS3Y", "B000HCQK0A", "B0010AYJXI", "B002BSA1MQ", "B000P46NMK", "B0016BVYA2", "B004ML7WOK", "B0056WJA30", "B0023CBY4E", "B003GSZ9ZE", "B00ICWO1XA", "B000OLSJLC", "B002I0JGDM", "B000R0SR9E", "B000B6ML0U", "B000FRS9II", "B000H94PVO", "B00163LW7A", "B001BC948U", "B002I0H79C", "B0016NRS28", "B000XJS00K", "B000HX1P72", "B008XMSRKC", "B000R0RHA4", "B003C1I0CO", "B0022TNO7S", "B003O6E7AG", "B001E8VB3C", "B003Q53VZC", "B000KGD1GO", "B000GPVUOY", "B004UDLRMS", "B0016NUZFU", "B001CMIUYS", "B004EW7LSY", "B004FUL9YW", "B00EVWZHLK", "B00269DXCK", "B00309U0M6", "B0043B5SLI", "B007SRM5MO", "B000SQ5LQ4", "B000G7PMXC", "B003O6N2TI", "B003L8HQ7S", "B000SQ5LO6", "B003FBL85W", "B004YVOCYG", "B001YI0Z2U", "B000A0XSN6", "B0012N8WXQ", "B000G75AXY", "B0047TG2R0", "B005C2D2MO", "B000ZK6950", "B00113JSCG", "B000LXIO6I", "B001CBW18K", "B000R0URCE", "B000FLZEXM", "B000B6ML1Y", "B002EZOQVI", "B003S2MXRA"], "bought_together": ["B0030GBUCS", "B002GPPPS4"], "buy_after_viewing": ["B0030GBUCS", "B002GPPPS4", "B004J6I0YO", "B0050SY4DG"]}, "salesRank": {"Video Games": 11376}, "categories": [["Video Games", "Xbox 360", "Games"]]}