{"asin": "B003BQ91Y6", "related": {"also_bought": ["B0001FTVD6", "B0007OGTGS", "B001ECQQ8I", "B000CD1R84", "B0002NRTL8", "B0002DV0CC", "B0002BG4O8", "B0002DV0CW", "B0002D017M", "B0002DVD7E", "B00653XX46", "B000RW9STK", "B000RWJQRE", "B0002NQPHM", "B001UO05YG", "B008X3JHJQ", "B0002DV0CM", "B000068NXH", "B001B84JPW", "B0014598WQ", "B0000WSA4Q", "B0002DV0G8", "B000CCIVI4", "B000A2UOYK", "B005HGM1D6", "B000LJ2WAQ", "B000RYPN38", "B0002NQQCQ", "B000068NYH", "B0002D020S", "B000K6B38C", "B004J9WSD0", "B00DLHGLCA", "B000068O1P", "B001Q3KTH4", "B002FOEKNC", "B008LQHV20", "B0002F6JH6", "B0002E513U", "B003YJQX1O", "B003BLOSJ4", "B001UJEKZ6", "B000RY68PA", "B000RTPBWQ", "B001UJIYIK", "B0010BQ3FY", "B000068O17", "B006H9ZCJ2", "B004TPDBGC", "B0002M3OVI", "B0010CTUW6", "B001ECQQ5Q", "B000068NTU", "B0002E57D4", "B00C0WMFIG", "B002OQ04I6", "B0020IYOO8", "B0015J6ZAY", "B000RKL8R2", "B004VUOAPG", "B000SKS2NY", "B000A8J3N2", "B00356J8KE", "B00F0GPTRS", "B005EHINAS", "B007YFWTXU", "B000068NXI", "B00FN28RU0", "B0002D0B4K", "B007EWI572", "B0002DV0DQ", "B0002DV0DG", "B000CZ0RK6", "B000068O3S", "B000CZ0RII", "B00145EVJ6", "B0002GL82G", "B0002E3DPI", "B001COE9T6", "B003JJQMD8", "B0002DV0GI", "B000068O3T", "B003HZV2OI", "B000CCIVCA", "B0011EJTP6", "B000GASJF2", "B000KIPT30", "B005BSOVRY", "B001UJGNMO", "B003B1R5T4", "B000TYBYOI", "B002DOVT7O", "B0050DDP8G", "B000RYE5Y6", "B0017RAJFG", "B0006I935Y", "B000TRCDGS", "B0002IHGZC", "B005ONOX2E"], "bought_together": ["B0001FTVD6", "B0007OGTGS"], "buy_after_viewing": ["B0014598WQ", "B0002D017M", "B00145EVJ6", "B0001FTVD6"]}, "title": "Furman M-8X2 Merit Series 8 Outlet Power Conditioner and Surge Protector", "price": 45.8, "salesRank": {"Musical Instruments": 191}, "imUrl": "http://ecx.images-amazon.com/images/I/31kUijEWwzL._SY300_.jpg", "brand": "Furman", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Connectors & Adapters"]], "description": "A Merit Series Power Conditioner is the perfect low-cost AC power solution for any rack mount system. Install an M-8x2 in to the top slot of your rack, and the eight switched outlets in the rear panel will power up and protect all your equipment up to a 15-amp load. The M-8x2 is designed for applications where lights are not required. Instrument Rigs: You've got a rack for your effects, preamps, tuner...You're going to plug that into the wall? One big spike and your rig is up in smoke. Furman's standard level surge/spike protection defends your gear from the spikes and surges that are so common at gigs and practice spots. With Furman's standard level RFI/EMI filtration, you'll get a quieter tone without pops, crackles, and the local radio station coming out of your amp. Recording: Can't track down where that noise is coming from? Your mix sounding flat? With Furman's standard level RFI/EMI filtration you'll lower the noise floor caused by the dirty AC power coming into your console or DAW. Furman's standard level surge and spike protection keeps your sensitive digital equipment from acting funny or burning up due to everyday spikes and surges. DJ Equipment: Bars, clubs and other event venues have some of the worst power out there - from air compressors turning on and off to light shows pulling current loads up and down, the AC power can be a strain on the circuits in your rig. Furman's standard level protection and filtration keeps the bad stuff out. Pro Audio: When you're out there gigging, you never know what kind of power you're going to get. The wear and tear on mobile rigs eventually takes its toll - that's why it's smart to plug into Furman's standard level protection and RFI/EMI filtration. It keeps your equipment safe and sounding clean. Whether you're setting up a show at the local club or powering up the church band for their next service, make sure you give them power they can trust."}