{"asin": "B000058BCQ", "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]], "description": "The Garmin eTrex Legend GPS receiver is modeled on Garmin's popular entry level eTrex, but adds the same base map found in Garmin's III+ and eMap models, along with 8 MB of memory, making it a solid midlevel offering in the eTrex line just behind the eTrex Summit. Housed in a translucent blue case, this powerful, 12-parallel-channel, global positioning satellite (GPS) receiver weighs only 5.3 ounces and measures 4.4 by 2 inches. It literally fits in the palm of your hand. The Legend boasts the ability to hold up to 8 MB of amazingly detailed information that you upload for the area you plan to navigate. In addition to all that detailed information at your fingertips, the Legend actually gives you a higher-resolution screen than the slightly better equipped eTrex Summit. The massive 10,000 track log points of the Legend compare well to the 3,000 track log points the Summit model offers and the 2,048 that the Venture offers.The eTrex Legend's 8 MB memory enables you to download points of interest and map data from optional Garmin MapSource CD-ROMs to make your GPS unit more useful. The built-in base map of the Americas displays city and interstate highway information for North, South, and Central America, as well as U.S. highway exits. Address and business listings are displayed with data downloads. It also provides points of interest along lakes, rivers, and coastlines.The Legend has a front-panel rocker switch that allows for quick and accurate map panning. View maps on a liquid crystal display with a resolution of 288 x 160 pixels. The unit is waterproof to an IPX7 standard, so it can withstand a dunk.The Legend maintains a tight satellite lock, even in a forest. The unit can store up to 1,000 user waypoints with graphical icons, and it boasts Garmin's own TracBack feature, which reverses your track log and helps you navigate your way back home. The eTrex Legend also uses animated graphics that will help you identify your marked waypoints quickly and easily.Garmin makes some of the accessories to help you integrate your GPS with your life and your priorities. Keep your GPS at the ready while protecting it from knocks and bumps with thecarrying case. If you'll be on the road, you'll want to have access to the most detailed topographical maps of the United States available: TheGarmin MapSource CD-ROM(USA TOPO). And don't let the product's many abilities overwhelm you--train yourself in all the eTrex's ins and outs with a handyinstructional video.The Garmin eTrex Legend comes with a PC interface cable, a manual, and a quick-reference card, and it's covered by a one-year warranty.", "title": "Garmin Etrex Legend GPS Receiver", "price": 159.99, "imUrl": "http://ecx.images-amazon.com/images/I/41K2HcGXL4L._SY300_.jpg", "brand": "Garmin", "related": {"also_bought": ["B00004VX39", "B000PDV0CE", "B008RIX9HI", "B00004VX23", "B00004VX15", "B00542NV32", "B000058BCR", "B000PDR230", "B001OMGVJW", "B000066TPO"], "bought_together": ["B00004VX39"], "buy_after_viewing": ["B00542NVDW", "B00542NV32", "B00004VX39", "B008RIX9HI"]}}