{"asin": "B000FQ2D5E", "description": "Metal Gear Solid 4: Guns of the Patriots, is a next-gen experience complete with top-of-the-line graphics and surround sound designed for theSony PlayStation 3. Featuring the most revealing display of Kojima Production's premier title,MSG4details the world where Snake must under go his final mission. In a world overrun by private military companies (PMCs), wars are no longer fought over nations or ideologies. Instead, the wars of the future are micro-managed by overarching PMCs, right down to the bullet. New gadgets and abilities fuel Snake's journey deep into the enemy domains of the Middle East, South America, and beyond. New gear includes \"Metal Gear Mk. II,\" the ultimate reconnaissance tool, and \"Solid Eye,\" which gives Snake real-time information on enemies and his surroundings.Old timer Snake returns for what is slated as the final installment in theMetal Gearseries.View larger.New and old characters abound inMGS4.View larger.PMCs have run amok and the world is at war.View larger.Octacamo will help Snake blend into surroundings.View larger.Joined by a familiar cast of characters, Snake must once again return to the battlefield to confront his lifelong rival, Liquid Ocelot, who is manipulating the world's wars from the one world where soldiers will always have a place. But Liquid Ocelot is not the only one who will be able to manipulate the world's wars--Snake can destabilize opposing forces by working behind the scenes, supporting the local militia as they fight PMCs, creating a smokescreen that allows Snake to move freely within the war-zone.MGS4 is a next-generation adventure set in the aftermath ofMGS2: Sons of Liberty. The concept behind the latestMetal Gear Solidproject is \"no place to hide,\" and this edition in the series will force Snake into unexpected circumstances with an all-new storyline that breaks away in some ways from the previousMGSfranchise entries. We don't want to spoil it for you, but, producer Hideo Kojima did reveal some very juicy tidbits about the game and the storyline when it was first announced at E3 of 2006. \"Until now,\" said Kojima, \"we've released two entries of theMSX2 Metal Gearseries, and three entries in theMetal Gear Solidseries. Add to thisPortable Ops, and you get a total of six titles. All mysteries will be cleared up inMetal Gear Solid 4.\"Kojima was very clear about the finality ofMSG4, leaving gamers to wonder, \"Will Snake die?!\" When asked if the story will come to this sort of an end, Kojima responded without the slightest bit of vagueness, \"It will come to an end.\" TheMGS4E3 trailer showed a number of characters from theMetal GearandMetal Gear Solidhistories. This final installment is sure to deliver loads of cameos, in fact, it is rumored that nearly all the characters from the series will make an appearance.In addition to a return of classicMetal Gear Solidcharacters, the gameplay systems from part three are also expected to make a comeback. The camouflage system from part three will make it intoMGS4, with the addition of \"OctoCamo,\" Snake's most advanced stealth suit to date. The name appears to be formed from the words \"Octopus\" and \"camoflauge,\" and players will be awestruck by the chameleon-like camo that changes with the surroundings. OctoCamo allows Snake to blend in with his environment as it digitally manifests nearby textures in real time. Think if it this way, if Snake is standing next to a wall worn out with holes, he too will appear to be riddled with holes. It has also been revealed thatMGS4will have online play, but no specifics have been released. Although very little information is known about the game's visuals, rumor has it thatMGS4is expected to be the finest representation of console graphics on the PS3, and it is expected that they will just get better and better as the game nears its release date.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51VGqOqZ1pL._SY300_.jpg", "related": {"also_bought": ["B0050SX97I", "B002I0J8FI", "B00GJSUUC0", "B000ZK9QCS", "B008CP6MA2", "B000UW21A0", "B008CP6RUW", "B0055202HE", "B009JBFF9C", "B005N4HBIW", "B005YR308S", "B0016C3260", "B007CM0K86", "B002I0J5FG", "B001JKTC9A", "B001SGZL2W", "B002I0F5I2", "B000FQ2DTA", "B002AB7TX8", "B004EQCCI4", "B007A7UJ4S", "B0086V5V8G", "B008PQU3E4", "B008CP6Q6M", "B007TYC8MI", "B002I0H2G0", "B000FQBF1M", "B002CZ38KA", "B000JLIXIG", "B00005ML10", "B008CP6RWU", "B005C2D1YI", "B0050SXLQC", "B00IA2NYT4", "B002I0K6DG", "B0050SXX88", "B00309XHD0", "B0022TNO7I", "B004NRN5EO", "B0016B28WU", "B00001X50M", "B000UC5ML0", "B006WQR3V0", "B002I0F5M8", "B0045U01OG", "B0050SX7BQ", "B000K9OP2A", "B003O6E3C8", "B00275A7LI", "B008SBZD5U", "B0012N94WO", "B000ZK7ZOE", "B003O6E67A", "B003O680RM", "B00269DX5W", "B00BMFIXKQ", "B0050SXFKE", "B0055L9BFO", "B005DVAB0A", "B002BSA1C6", "B001NX6GBK", "B0010EI6T2", "B002I0J82G", "B00E369SDM", "B00269QLH4", "B000HKP88C", "B000X1TC0U", "B00503E9FY", "B0002RQ3ES", "B007SRM5U6", "B004FS8LYK", "B002VB4DMW", "B003C1I06U", "B006JKAS16", "B00HD4R5YU", "B004HYK8Y8", "B000FII8KQ", "B0050SXKU4", "B00354NANC", "B002BXKJ6O", "B0012N3T3Y", "B005VBVQDI", "B0050SYOOA", "B002I0GX88", "B004HCYVO8", "B002TDIEEK", "B0015AARJI", "B006ZTHFPS", "B0050SXI6K", "B002I0J5UQ", "B009GZX49Y", "B0050SXVK8", "B002I0J4AM", "B002I0J5JW", "B002BRZ6UE", "B00B59MXGY", "B002ELCV00", "B000Y1MOIQ", "B0085L2T0A", "B0009VXAM0"], "bought_together": ["B0050SX97I", "B00GJSUUC0"], "buy_after_viewing": ["B00GJSUUC0", "B00BMFIXKQ", "B00CTKHXFO", "B007CM0K86"]}, "salesRank": {"Video Games": 984}, "categories": [["Video Games"]]}