{"asin": "B0011ULQNI", "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS"]], "description": "Go wide with the ultra-cool n&uuml;vi 260W that speaks street names. This widescreen navigator is attractively-priced and simple to use. Like the rest of the n&uuml;vi 200-series, you&rsquo;re just a few screen taps away from anywhere.Navigate With Easen&uuml;vi 260W comes ready to go right out of the box with preloaded City Navigator&reg; NT street maps, including a hefty points of interest (POIs) database with hotels, restaurants, fuel, ATMs and more. It even announces the name of exits and streets so you never have to take your eyes off the road. Simply touch the color screen to enter a destination, and n&uuml;vi takes you there with 2-D or 3-D maps and turn-by-turn voice directions. In addition, n&uuml;vi 260W accepts custom points of interest (POIs), such as school zones and safety cameras and lets you set proximity alerts to warn you of upcoming POIs.Take It With YouLike the rest of the n&uuml;vi 200-series, n&uuml;vi 260W sports a sleek, slim design and fits comfortably in your pocket or purse. Its rechargeable lithium-ion battery makes it convenient for navigation by car or foot.Go Beyond NavigationNavigation is just the beginning. n&uuml;vi 260W includes many travel tools including JPEG picture viewer, world travel clock with time zones, currency converter, measurement converter, calculator and more. It also comes with Garmin Lock&trade;, an anti-theft feature, and is compatible with our free Garmin Garage where you can download custom vehicles that show your location on the map. Enhance your travel experience with optional plug-in SD cards such as Garmin Travel Guides for detailed data on attractions.Compare all Garmin n&uuml;visClick the button below to compare by series, user type, and features.What's in the Boxn&uuml;vi 260W, preloaded City Navigator NT for North America, vehicle suction cup mount, vehicle power cable, dashboard disk, and quick start manual.All n&uuml;vis come with detailed NAVTEQ maps containing more than 6 million pre-loaded point of interest locations.", "title": "Garmin n&uuml;vi 260W 4.3-Inch Widescreen Portable GPS Navigator", "price": 200.0, "imUrl": "http://ecx.images-amazon.com/images/I/51W7xhE0hzL._SY300_.jpg", "brand": "Garmin", "related": {"also_bought": ["B002IUG14O", "B0097I53RG", "B002YMQM1S", "B001M09MUG", "B0030BJ9MQ", "B0015EWMX8", "B001QKZ3OQ", "B003WZ9E1G", "B009ABO2N6", "B003CJ6IMA", "B000NW12C0", "B004QPROAO", "B000NVZE5M", "B0029EYRVS", "B001U0O7SA", "B0037JE8VS", "B001U0O7T4", "B0015F1L7A", "B002WIQ8LI", "B003DMH938", "B000BM8RFM"], "bought_together": ["B002IUG14O", "B001M09MUG"], "buy_after_viewing": ["B0057ODG6Y", "B0057OCDQS", "B002IUG14O", "B0057ODOCA"]}}