{"asin": "B0062CBCGG", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]], "description": "Overview:The AX300 is the ultimate portable audio solution for any device in need of a sound boost! It is a great alternative to using the small speakers on your smartphone or digital media streaming device. The speaker can be paired via wireless Bluetooth or line-in feature.Indoor/outdoor use:This sleek and portable speaker can easily fill up a room and works great just about anywhere and everywhere. Indoors, it can be used in your room, dorm, hotel, living room, kitchen, shower (not water resistant, keep away from direct contact with water), office, cubicle, or anywhere else! Outdoors, it is a great product to use at parks, beaches, pools, bonfires, sporting activities, kids? soccer practice, or any other individual/group outdoor activity.Battery life / charging:This amazing speaker delivers quality sound with deeper base than the standard speakers on your device.The AX300 can be easily charged in 1-2 hours using any USB charger or output on your desktop or laptop. The AX300 also features Bluetooth 4.0, which uses less battery and faster connection speed that delivers high quality audio and sound.Pairing:The pairing process is simple and easy! If asked to enter a code, enter \"0000\". Once paired, the wireless streaming range can be up to 30 feet. You may also use the speaker in line-in mode if you wish to increase battery time. Simply turn the on/off switch to \"Line\" mode and use the cable provided.Multifunction:Once paired with your phone, you no longer have to touch your device. You can virtually control everything using the multifunction toggle: Increase/decrease volume, skip forward/back, playpause your music/video, or even answer/hang up your incoming/outgoing calls. The speaker also has a microphone for Handsfree function in your conference room or in your vehicle! Available in 2 colors: Black/Red", "title": "Alpatronix AX300 X-tra Strong Wireless Bluetooth 4.0 Portable Rechargeable Mini Capsule Speaker with Built-In Mic / Handsfree Calling / Music Streaming / Enhanced Bass / AUX Input for Wired Connection / Compatible with all iPhones, iPods, iPads, Samsung Galaxy,  Tablets, MP3 Players and other iOS/Android Devices and Smartphones / Perfect for the Beach, Vacation, Outdoors, Travel and as a Car Speakerphone / Audio Playing / Exclusive 1-Year Warranty (Retail Packaging) - Black", "price": 33.95, "salesRank": {"Cell Phones & Accessories": 11002}, "imUrl": "http://ecx.images-amazon.com/images/I/41XcZ63CfGL._SY300_.jpg", "related": {"also_bought": ["B004HHICKC", "B007R6HUFI", "B001TKTHFY", "B0037N32VG", "B007R6HUEE", "B0073FCPSK", "B004LTEUDO", "B00H2FK7O0"], "bought_together": ["B004HHICKC"], "buy_after_viewing": ["B007R6HUEE", "B00FJILVDS", "B007R6HUDK", "B007R6HV4S"]}}