{"asin": "B00007B77T", "description": "We could talk about theSerious Sambackstory, but that would be missing the point, namely to commit carnage on a galactic scale. The smooth engine, multiplayer options, and fast pace make this game a solid choice for fans of first-person shooters.The interface uses the tried-and-true Xbox formula for shooters: the left thumbstick controls movement and the right thumbstick controls the angle of view. The extensive arsenal is something special though, with each weapon possessing a different efficiency so you have to find the perfect weapon quickly for each situation. For instance, the shotgun is a great weapon for up-close fighting among a crowd of enemies, but it's horrible at a distance or when you're stuck in the middle of a melee. The enemy list is also quite extensive. You will be fired upon, stepped on, stabbed, slashed, and electrocuted. Enemies will appear by land, air, and water.What makes this game stand out and keep you interested, though, is its irreverent, offbeat sense of humor. Serious Sam makes outlandish comments throughout the game, rides cosmic surfboards between scenes, saves progress at Dr. Who-like telephone booths, and pays homage to the Indiana Jones theme song. And you can change the blood splatters between red, green, and hippy (flowers and fruit). Our only major complaint is level design. Even when you believe you've cleared a room, enemies can pop out of midair and injure you. By not allowing you to seal yourself off from the onrushing masses in appropriate spaces, a major strategic element has been missed.--Eric Franklin", "price": 38.99, "imUrl": "http://ecx.images-amazon.com/images/I/616yP2f5r7L._SY300_.jpg", "related": {"also_bought": ["B000ARJIBU", "B0002CHIZ6", "B00009XS68", "B00C3MK9BS", "B00005NZ1G", "B000641ZCM", "B001ELWMHI", "B000784XIA", "B0001ZDLE6", "B0002HDSZU", "B0001UEHP8", "B00082ZQZY", "B00019HNN2", "B0007OGDHS", "B00005NZ1I", "B00008H2IU", "B0016CQ0Q4", "B00008J7NZ", "B000784XGM", "B00006LU9C", "B00005Y404", "B00006JN5J", "B000E61G4O", "B0002SQ0BS", "B00006IKCC", "B00008KTNN", "B00005NZ1K", "B0006SST9U", "B0009Z3HZQ", "B00009YXIE", "B00069FK0A", "B000CEXDW6", "B00019PD9S", "B000A0XSMM", "B00008G6GH", "B00011V8EK", "B0002AU13O", "B00005NCB5"], "bought_together": ["B000ARJIBU"], "buy_after_viewing": ["B00C3MK9BS", "B00006C28W", "B000ARJIBU", "B00005NZ1G"]}, "salesRank": {"Video Games": 20114}, "categories": [["Video Games", "More Systems", "Xbox", "Games"]]}