{"asin": "B00GX9A06Q", "description": "High definition sound and the industry's longest playtime packed into one of the smallest packages. Your mobile audio, delivered.Volumes of high-def.Don't simply pump out volumes of sound, but volumes of surprisingly clear and full-bodied sound. Powered by a 4-watt, 2-inch driver and topped off with a bass port, experience the clarity and volume of a boombox, without the bulk of one.Play all day AND all night.We packed the whole set into a 3-inch cube that easily slips into your pack or purse. The built-in rechargeable battery enables a breakthrough 15-20 hours of playtime so you can jam through a full day and still play your nighttime-ambiance soundtrack on a single charge. Not to mention breakthrough #2: up to a 33-foot connection range (standard is 30 feet or less).No PhD needed.Built for ages 6 and up, simply slide the on/off switch to the \"on\"  position to automatically connect to the last-connected device and start streaming your music - that's just one step. The unit also doubles as a speaker phone with a 2-foot range microphone so you can answer or make calls mid-song.Broad Compatibility.Connect with any bluetooth-enabled device (Bluetooth 2.1 and over) or just plug in with the traditional audio cable to start your tunes.Get to know us.We created Anker with a single goal in mind: to make the smart life easier. That means starting with affordable, high-quality gear and ending with a commitment to 100% user satisfaction and an 18-month warranty. After all, we're customers too.", "title": "Anker&reg; MP141 Portable Bluetooth 4.0 Speaker with Super-Sized 4W Driver &amp; up to 20 Hours of Playtime (White)", "price": 39.99, "imUrl": "http://ecx.images-amazon.com/images/I/412rU7VPePL._SY300_.jpg", "related": {"also_bought": ["B00IBDOB5I", "B00C4Q61Z6", "B00KQDTYHQ", "B00D5VAYRU", "B00IU6R2AW", "B006T8JZJY", "B00K4VQZCM", "B00EI8SS4U", "B00HA6ACW8", "B00D82O68Y", "B00EJDHGN8", "B00GWEX3MK", "B00HIZYCM2", "B00DMWV3EU", "B00GTGETFG", "B00D856NOG", "B005NGLTZQ", "B00CEZBKTO", "B009USAJCC", "B00GNPPJW0", "B00EF1OGOG", "B00HV899C4", "B00E174RTS", "B00FYQKMRG", "B00B8M4IMK", "B00F3T0DKK", "B00BN42G6S", "B005X1Y7I2", "B00DVH62J2", "B00J5DS8NE", "B00AWRH9L4", "B00ES2BQ7M", "B00L17FASI", "B00FXWKFSM", "B00IJ331WY", "B0028R3NCU", "B00EVQ9MAS", "B00B0TXEEY", "B00HQ2GYT6", "B00B45EOYS", "B000I1UTNE", "B00IY5254C", "B00GNQ10VS", "B002VPE1QG", "B00D5T3QK4", "B00E3OL5U8", "B005NF5NTK", "B00HFQG09C", "B00EFE9OAE", "B00B8PRRTI", "B00D6OHHEE", "B00EYXZI4M", "B00ILM977Q", "B0097LG9U8", "B00C13YSIO"], "bought_together": ["B00IBDOB5I"], "buy_after_viewing": ["B00C4Q61Z6", "B008JGR9MO", "B00D6OHHEE", "B00ES2BQ7M"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]]}