{"asin": "B000BI1XNE", "categories": [["Electronics", "Computers & Accessories", "Routers"]], "description": "The 54Mbps Wireless G Router offers a complete wireless solution that allows you to share files, an Internet connection, or network resource while protecting your network using enhanced security features. Simply plug your workstations and your broadband modem into the Wireless G router, and configure your broadband connection using its built-in Web Interface. Use the Virtual Server feature to configure any workstation as a Web Server or FTP server easily, allowing users to view files from the Internet. You can also protect your Wireless LAN using 64/128-bit WEP encryption or industry standard WPA-PSK with TKIP or AES algorithms. Increase security by enabling MAC, IP, or Protocol Filtering as well as setting Firewall Rules to limit Internet Access or block malicious intruders from accessing your network.FeaturesWi-Fi Compliant with IEEE 802.11g and 802.11b DevicesBuilt-in 4 x 10/100Mbps Auto-MDIX LAN PortsBuilt-in 1 x 10/100Mbps Auto-MDIX WAN Port (Internet) Supports Cable/DSL Modems with Dynamic IP, Static IP, PPPoE, or PPTPDHCP Server Feature Allocates up to 253 Client IP AddressesSupports 64/128-bit Wired Equivalent Privacy (WEP)Supports 802.1x/WPA, WPA-PSK, TKIP/AES for Advance SecuritySupports MAC Address, Protocol Filters and UPnP (Universal Plug & Play)Traffic Control with Virtual Server, Virtual PC mapping and DMZProvides Additional Security with SPI / NAT firewall and Attack Alert via emailsProvides Additional Security of Enable/Disable SSID, Password ProtectionSupports Static and Dynamic RoutingSupports IPSec and PPTP VPN Pass-Through SessionsFlash Memory for Firmware Upgrade, Save/Restore Settings, and Traffic LogCompliant with Windows 95/98/NT/2000/XP, Linux and Mac OSEasy Management via Web Browser (HTTP) and Remote ManagementRange for Indoor of 30 ~ 50 meters (depends on the environment)Range for Outdoor of 50 ~ 200 meters (depends on the environment)3-Year Warranty", "title": "TRENDnet 54 Mbps Wireless G Broadband Router TEW-432BRP (Blue)", "price": 42.86, "imUrl": "http://ecx.images-amazon.com/images/I/41sSsUf4TLL._SY300_.jpg", "brand": "TRENDnet", "related": {"also_viewed": ["B001FWYGJS", "B0062KA4VM", "B00008SCFL", "B000BLHZMY", "B000Z3XXR4", "B000BTL0OA", "B0014J07R2", "B0012JCZYM", "B001C1MGKI", "B00093IIRA", "B0002JKGRQ", "B00006I5XC", "B001AZP8EW", "B008IFXQIW", "B00030GSJY", "B0001FTVEK", "B00B0CQCCC", "B00007KDVI", "B001UI4RTG", "B006IJHK96", "B004T9RR6I", "B000A6PPOK", "B005WKIKA0", "B002WBX7TQ", "B007IL6OR2", "B006V72AHC", "B004T9RR4A", "B0019EQ1RW", "B003Y5RYNY", "B004XC6GJ0", "B002YLAUU8", "B0040IUI46", "B004P8K24W", "B006ZP8UOW", "B00A3YN0Z0", "B006QB1RPY", "B00AJHDZSI"], "bought_together": ["B00000JDF5"], "buy_after_viewing": ["B001FWYGJS", "B004XC6GJ0", "B0062KA4VM", "B001UI4RTG"]}}