{"asin": "B0000AOWWY", "description": "Get the ultimate in performance, style, and comfort in a single package. Give your desktop all the best wireless features and functionality, with a cushioned palm rest, a Microsoft Wireless IntelliMouse Explorer with revolutionary new Tilt Wheel Technology, one-touch multimedia keys, \"My Favorites\" keys, and comfortable, ergonomic design. You&#x92;ll think about your desktop in a whole new way.Key FeaturesIncludes mouseIntegrated palm restErgonomic designWirelessHot keysMac-compatibleUSB connectorMultimediaPS/2 connectorTilt Wheel TechnologyExperience unrivaled accuracy, speed, and control&#x97;new wheel functionality and intuitive software enables enhanced, accelerated scrolling through documents and Web pages. Depress the wheel to toggle between open windows, making multi-tasking a snap. Your screen will move as smoothly as the scroll wheel feels.FeaturesIncludes Wireless Optical Mouse and KeyboardEnjoy desktop harmony&#x97;this set includes a wireless optical mouse that accents the stylish design of the keyboard.Smart ReceiverGo wireless with confidence-smart technology sends a message when interference or low battery life is detected, reducing the likelihood of interruption.Longer Battery LifeFinally, a solution to the top wireless hassle&#x97;now you can work longer without interruption. Many users experience a half year of battery life!Wireless FreedomGo wireless. Free your desktop from needless clutter and cables.", "title": "Microsoft Wireless Optical Desktop Elite", "price": 49.99, "imUrl": "http://ecx.images-amazon.com/images/I/41B4KVPDZCL._SX300_.jpg", "related": {"also_viewed": ["B003VAHYNC", "B002JCSCYS", "B0036E8V08", "B007BPKHJ6", "B001S4OTS6", "B004SUO1QM", "B0002CE0XY", "B004W8JBFG", "B00CYX53QW", "B00501T8XY", "B003SVSJ1K", "B001B8EUEW", "B004SUO1R6", "B00ESB9WF6", "B004XLA1R4", "B000Q6UZBM", "B003VAGXZC", "B001B8CU8U", "B001B8EOMU", "B005770DJE", "B00I14395A", "B002MMY4WY", "B0054PSS46", "B000A6PPOK", "B004KSQANO", "B0011FQUQG", "B003W0RKM6", "B004KNAU0S", "B0009V6TL4", "B004RJFTKG", "B001OAOZ2E", "B0002IG356", "B003VANO7C", "B00EUAFQCS", "B001DJ9GOS", "B00BP5KOPA", "B008OEHS04", "B0002ZHBIM", "B000H14IDC", "B00CYX54C0", "B0097CSZJ0", "B000TKHGL2", "B00CE5XAX8", "B006HIFZMW", "B004SUIM4E", "B00CPLILH6", "B00FFJ0ED4", "B002KQ5KVG", "B00DI79YUE", "B003NR874S", "B002UNFVK4"], "buy_after_viewing": ["B003VAHYNC", "B00BP5KOPA", "B002JCSCYS", "B0036E8V08"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Keyboard & Mouse Combos"]]}