{"asin": "B002HWRK66", "description": "Toshiba&#x2019;s Desktop External Hard Drive offers you both extra storage space, and a comprehensive yet easy-to-use data backup and sync solution. The Toshiba 1.0 TB Drive can handle even the largest digital libraries - it can store up to 200,000 photos, or 250,000 music files, or 380 hours of video. With just a few clicks you can create a digital safety net to help protect files on your computer or other storage devices. Our dual connectivity design lets you choose between the USB interface or the faster eSATA interface for your data transfer needs. A built-in On/Off switch allows you to power down your drive when not in use to save energy. The slim design and small footprint help save your desktop space both at work and at home. The Backup software lets you back up your entire system (including attached storage devices) or specific file types (e.g. music files) on any internal or external drive attached to your system. The powerful Restore feature allows you to quickly restore files from any point in the backup history. You can even restore files based on selected criteria, such as name, date, and file extension. Bi-directional synchronization helps keep files on two sync targets up-to-date, no matter which target has been modified. For added convenience, you can schedule your backup and sync tasks to automatically run at your desired day and time. The Drive Monitor will monitor your Toshiba drive and let you know when it is getting full. These software features are preloaded in your Toshiba drive and run directly from the drive without requiring installation on your computer.", "title": "Toshiba 1 TB USB 2.0/eSATA Desktop External Hard Dive PH3100U-1EXB", "price": 72.99, "imUrl": "http://ecx.images-amazon.com/images/I/31fmPoamptL._SX300_.jpg", "related": {"also_viewed": ["B005J7YA3W", "B000VZCEUI", "B00134BWHW", "B002JMYCTC", "B00847V9Z6", "B0016P8OLU", "B004CF2RT6", "B002CZQ4GU", "B001HAMNSY", "B005J7YBPO", "B008DW96NY", "B00CGUMSZC", "B005J7YA64", "B005J7YAZK", "B005J7YBRW", "B002JN554C", "B001FWCDQG", "B001DCELO0", "B005J7YBOU", "B0052L77SA", "B002COI60I", "B008DW976A", "B003B8PPEY", "B0041OSQ9S", "B006Y5UV4U", "B000ENYXZ6", "B001UI49XA", "B00CI3BISU", "B005J7YAWI", "B001SJVU6K", "B00ALPMM2I", "B00CGUMSWA", "B00CGUMTQ0", "B00CGUMTQA", "B000WBJDUA", "B00CI3BLPA", "B00847VJ06", "B00CGUMR2Q", "B005J7YCHG", "B00CGUMSY8", "B006Y5UV4A", "B001FWEETK", "B0042Z55RM", "B005MNGQ6C", "B003WUBIZQ", "B005HMKKH4", "B00E362W9O", "B005J7YA4G", "B00834SJNA", "B00834SJS0", "B00E83X9P8", "B00EAS8MWQ", "B00CGUMS48"], "buy_after_viewing": ["B005J7YA3W", "B006Y5UV4A", "B003MVZ60S", "B00CGUMSZC"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]]}