{"asin": "B00005NZ1J", "description": "This super-slick driving game lets players strap into more than 20 licensed cars and compete on more than 300 circuits in cities around the world. In addition, the game boasts 100-plus individual and wheel-to-wheel challenges, an arcade mode, and a four-person multiplayer option. You may want to put your seat back--this could be a long drive. In a unique twist, players are rewarded with a ratings system that scores their style, dexterity, and placement. Throw on the flare, boast your driving skills, and prove your daring side and you'll be rewarded.UnlikeCrazy Taxi's reward scheme,Project Gotham Racingis a true-to-life racing simulation (no bounding from rooftops here). The tracks--located in global centers such as London, Tokyo, New York, and San Francisco--are incredibly detailed, adding a thick layer of realism to the course. The cars are just as nicely rendered, each shining with the gloss of a fresh paint job and driving with the appropriate responses for its particular style. Those looking for a game with speed to match the hardware should add this racer to their list of Xbox must-haves.", "price": 14.99, "imUrl": "http://ecx.images-amazon.com/images/I/51K5KWCN4YL._SY300_.jpg", "related": {"also_bought": ["B0000C6FKA", "B004AGYHUE", "B000UKZ20S", "B001ELWMHI", "B000062YIN", "B000B6ML28", "B00005NZ1I", "B00006IJIW", "B000F2JUOK", "B000GPXSA8", "B0001CJEFY", "B000930DLE", "B000086JXB", "B001DTHT6U", "B0002ILSH4", "B00005NZ1M", "B005CKQ6LU", "B000HVDEQO", "B002K8Y23G", "B00005Q5CW", "B00065HIR2", "B0002CHIZ6", "B006ZQ85YG", "B0000C6EDL", "B000083DZP", "B0000503MO", "B0000C6FJ3", "B00006409Z", "B0002VYPEE", "B002BSA2LQ", "B00129I75I", "B00009B8DL", "B00006F2EE", "B0000A0MDV", "B0000E32YB", "B00027JYSU", "B0002CTTIA", "B0094QU92U", "B0000631VI"], "bought_together": ["B0000C6FKA", "B000UKZ20S"], "buy_after_viewing": ["B000UKZ20S", "B000B6ML28", "B002BSA2LQ", "B0000C6FKA"]}, "salesRank": {"Video Games": 18539}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "More Systems", "Xbox", "Games"]]}