{"asin": "B00012TIW8", "description": "2006: The U.S. installs a temporary military base on East Timor to train the developing defense force of the \"world's youngest democracy.\" Resistance to the U.S. military presence in Southeast Asia is widespread and passionate, but the threat Indonesian militias pose to Timorese democracy is deemed sufficient justification. Anti-U.S. resentment comes to a head under the leadership of guerrilla militia leader Suhadi Sadono, acting with the unofficial support of major corrupt factions of the Indonesian government. Suhadi's men attack and occupy the U.S. Embassy in Jakarta, taking dozens of civilian and military personnel hostage.Deployed by a top secret wing of the NSA (National Security Agency) known as Third Echelon, Sam Fisher is a lone field operative supported by a remote team. Fisher must defend and assist the U.S. military, both locally and from remote locations, until Suhadi's terror-driven policies can be subverted and the guerrilla faction eradicated. Charged with saving the world, it&#146;s a high stakes game. If he fails, the U.S. will deny any knowledge of his existence.An experience so compelling you feel it.Believe the story.Inspired by the world of Tom Clancy, and endorsed by the famous author, and written by JT Petty, who penned the original Splinter Cell, Tom Clancy&#146;s Splinter Cell Pandora Tomorrow features a storyline so real you can feel it. Tension filled stealth-action springs from a compelling original storyline so realistic it could have been ripped from the headlines.Understand the characters.In this sequel to the original game, favorite characters like Sam Fisher and Irving Lambert return and unveil even more about their personal histories in the more character-driven storyline. New antagonists appear, including Suhadi Sodano an Indonesian guerilla leader whose beliefs are sound, but whose methods are barbaric. And then there is Norman Soth: CIA-trained mercenary deep under cover or traitor working for the enemy? Whose side is he really on?Immerse yourself.Revolutionary lighting, shadowing, animation, physics, and sound effects pushed to the limit to create a universe so tightly woven that the line between reality and gaming starts to blur. \"High res\" cinematics, amazing sound design and music as well as top quality voice over give SCPT as unique movie production quality. Voice actors, music composers and cinematic directors to be announced in the coming months.You&#146;ve got the moves.Now more than ever, Sam relies on his moves. In this sequel to the original Splinter Cell, circumstances demand that Sam use his agility and athleticism to avoid detection and death. In fact the level design demands them. Use a half split jump to reach a ledge, zip line across an open courtyard, rappel along the side of a building, SWAT-turn to bypass an open door unseen.You&#146;ve got the gear.Based on prototypes currently in development, or gadgets out on the field, Sam Fisher has a menu of high tech gadgets and tools from which to choose.Revolutionary multiplayer stealth action gameplay online for the first time.Take Splinter Cell online.Taking place in a graphically-rich environment we expect from Splinter Cell, the multiplayer gameplay is a natural extension of the Splinter Cell world. Just as in Splinter Cell, players will call on a wide variety of gadgets, weapons and athletic moves to best their opponents. The light and shadow-filled environment offers dark retreats for stealth gamers and wide open spaces that spell danger for spies. The multiplayer game is integrated into the compelling offline story, though both offline and online gameplay can be enjoyed independently of one another.Choose a side.Taunt your enemies from the shadows as you meet stealth objectives playing through wide multiplayer maps in third-person view as a Shadow Net Spy. Or track spies using a first-person perspective as a heavy armed Argus Mercenary protecting your compound. The abilities and resources on each side are evenly matched. Winning will come down to skill and strategy.Feel the tension.Just as in the original game, online players will feel the tension that comes from never knowing what might happen next. Shadow Net spies hold their breath as mercenaries pass by close enough to touch them. They hide in the dark and wait for the right moment to spring into action. They work in concert&#151;one can distract the mercenaries, while the other(s) meets the objective. Mercenaries never know when a Shadow Net spy might silently drop down from the shadows to attack, or slip by detection efforts to complete a mission. By relying heavily on their detection devices they feel like they can stop the threat&#151;at least for now. Are spies stealing your secrets while they toy with you?It&#146;s important to note that the maximum number of players on a multiplayer map is four. Too many people in a map would create chaos and result in shooter gameplay. But this is Splinter Cell. It&#146;s a stealth action game not a shooter. This game tests your stealth and your strategy, your readiness and your resourcefulness. Are you ready?Feel the game.The multiplayer maps feature the revolutionary lighting, shadowing, animation, physics, and sound effects that have become the Splinter Cell trademark. Graphical effects push that even further. Electronic interference can disrupt the vision and tools of the mercenaries. Spies must avoid the searching flash lights and laser pointers. Flash bang, shaft and gas grenades are also powerful visual effects that players will have to deal with. Thanks to their advanced goggles, Shadow Nets can see in the dark and read thermo signatures in their environment while mercenaries detect movements and electro-magnetic disturbance in their surroundings&#133;and much more to discover.", "price": 86.97, "imUrl": "http://ecx.images-amazon.com/images/I/51A2RCKQRQL._SY300_.jpg", "related": {"also_bought": ["B00006JZQZ", "B0002SQ0BS", "B000CBVC0Y", "B000CBZPDO", "B000SQ5LQ4", "B0086V5V9A", "B000069BCN", "B0002CHJA0", "B00005NZ1G", "B0007ULFDO", "B00020BV0Q", "B000A0EFJW", "B00005BZCH", "B00005RCQ5", "B000LXIO6I", "B00025EJ1E", "B00008XKZM", "B0000AJMPK", "B0009N1KD4", "B0000A92KZ", "B00008J7NZ", "B0008JILX6", "B0001AVSH8", "B00069BV5I", "B00019HNN2", "B000093NQH", "B001ELWMHI", "B000AOEV6A", "B0009351RK", "B0006ZJPSC", "B0009PQ0IM", "B00008KTNW", "B000087L4G", "B00006JC48", "B000B2YR74", "B0001UEHP8", "B00006LU9L", "B00008G764", "B002I0H9JA", "B0009UC68U", "B0000DJX7I", "B000WSE2WM", "B00006IJIS", "B0002CHIZ6", "B00006JN5J", "B00008DHNN", "B000088KH3", "B000067DPM", "B00009M7Q8", "B000930DLE", "B000P46NMK", "B0002B90SA", "B0037LTTRO", "B000B6MLZK", "B00009ZVHU", "B000IBGV18", "B00009X3V0", "B004AGYHUE", "B0009Z3IV4", "B00020BV1A", "B000ZK9QD2", "B000FRS9II", "B000G82DDS", "B000G7PMXC", "B0008GJRQ4", "B000F3AADE", "B0007ZD79E", "B001ASJIRM", "B0002A2S26", "B0006I5I58", "B00006LELH", "B000X25GX6", "B0001DI6FM", "B00005O0I9", "B00005O0I7", "B00095LEEW", "B002K8Y23G", "B0001ADAMO", "B00005NCAM", "B001UWGDC6", "B00006409Z", "B0001I9YE4", "B000OCXK6A", "B0007DGB4E", "B002I0JA7E", "B0000C4M23", "B00ICWO1XA", "B000809PA8", "B00078W0BM", "B001AWIP68", "B0007P8FN2", "B000HKGIOA", "B0002CHJ3W", "B000WEQL02", "B000BOJPRE", "B00006LU9C", "B002BSA1MQ", "B001QXNBJM", "B000160MCO", "B00005RKO7"], "bought_together": ["B00006JZQZ", "B0002SQ0BS"], "buy_after_viewing": ["B0086V5V9A", "B000SQ5LQ4", "B00006JZQZ", "B000CBVC0Y"]}, "salesRank": {"Video Games": 4482}, "categories": [["Video Games", "More Systems", "Xbox", "Games"]]}