{"asin": "B0006SL93I", "description": "Lock and load, soldier! There's a war going on andBattlefield 2is going to drop you right into the middle of a 21st century shoot-out! The good news is that you have a team of grunts at your side to help you survive the frenzied close-quarters combat. The bad news is that you have to engage the enemy on their home turf, at the world's most dangerous hot spots. You'll need to unleash the fury of an awesome high-tech arsenal that includes laser-guided bombs, heat-seeking missiles, and much more in order to survive. You have all the tools you need to get the job done--Abrams tanks, F-15 Strike Eagles, Wasp Class assault carriers, you name it. Hit the enemy with everything you've got. This is no minor skirmish--this is all-out war with all the high-tech firepower you can muster.An exclusiveBattlefield 2headset by Logitech is included as a free pre-order bonus.Features:Online multiplayer action with 64 players on the PC.All-new gameplay engine brings the immense locations to life complete with realistic physics and dynamic lighting.Maps scale to the number of players engaging in battle for a unique and intense experience every time.Take control of over 30 land, sea, and air vehicles, including tanks, helicopters, hovercraft, fast attack vehicles, and fighter jets.Choose to battle as U.S., Chinese, or Middle East Coalition troops, each with their own unique arsenals.A variety of soldier classes to choose from, including Assault, Sniper, Special Ops, Combat Engineer, and Anti-tank units.Join a squad or select the new Commander Mode to assume the strategic role of a battlefield commander directing his forces.New state-of-the-art weapon systems, including heat seeking missiles and laser designated bombs.Material penetration feature makes sure players know the difference between cover and concealment.Character persistence and growth: with in-game success, players increase their rank and unlock awards, including new weapons, vehicle decals, medals, and more.Earn ranks ranging from Recruit all the way to General.Full in-game community support including buddy lists, stat tracking, live chat rooms, and in-game clan creation.Voice-over IP (VOIP) supported.", "price": 35.71, "imUrl": "http://ecx.images-amazon.com/images/I/51SRQE869DL._SY300_.jpg", "related": {"also_bought": ["B000YJ3TR8", "B0001AO01Y", "B002NIP2SM", "B000067O0Q", "B00022Q0RI", "B000GPXS9O", "B002I0HJZO", "B000AO9YQM", "B000B63RSA", "B003Q55Y5C", "B001CC8UBG", "B000922E0S", "B0007U6JTY", "B000FJSIUA", "B002S1LP5S", "B001AWBYRA", "B0000A1VER", "B00EDJLXHI", "B00269QLJ2", "B002ZJPYHS", "B007H2V9W2", "B003ZULWQI", "B008OQTUKS", "B003JVF728", "B000BFPAPY", "B00503EAG2", "B000VV9T7S", "B002S7V28C", "B000PS1HMM", "B004PFS9TU", "B000VRCNLG", "B000VVEMXY", "B000X9FV5M", "B000J53BZC", "B001Q96ZNU", "B000SOYG8U", "B000TTFLS8", "B007XVTR12", "B00009OY9U", "B0010DZBAA", "B001QZGVEC", "B005G4CXPK", "B0001X5YN4", "B00006GSNY", "B0018YXM3Y", "B001NJ296A", "B00BY0G7IE", "B0013RC1W4", "B001E6DG6Y", "B00006C2HA", "B000AOKX3K", "B0014UGK4U", "B000MG3LDA", "B003P9C6EQ", "B0011WJBKQ", "B002I0HKRQ", "B000BD1AFA", "B0067G555G", "B000PS2XES", "B00C3LQPVW", "B002BS47YE", "B0002L88HE", "B0002U7ZFG"], "bought_together": ["B000YJ3TR8", "B0001AO01Y"], "buy_after_viewing": ["B002NIP2SM", "B000YJ3TR8", "B00022Q0RI", "B002I0HJZO"]}, "salesRank": {"Video Games": 3581}, "categories": [["Video Games", "PC", "Games"]]}