{"asin": "B00006I5FQ", "description": "Store, transfer and carry your data with you wherever you go!Lexar Media's JumpDrive will revolutionize the way you store, transfer and carry your files. Moving files from one computer to another has never been easier. With cross platform capabilities, the JumpDrive allows you to effortlessly store and transfer files via the USB port on your computer with no driver installation required.*StoreThe possibilities are endless as to what you can store on your JumpDrive, from music, presentations, documents, digital photos, and more. With the integrated data protection light, the JumpDrive will blink until data is safely stored. To further protect your data, the write-protect switch can be flipped into the locked position to prevent accidental deletion of your files.TransferGone are the days of carrying around stacks of floppy disks because Lexar Media has just given you a reason to throw them away. The storage capacity of the128MB JumpDrive holds as much data as approximately 90 floppy disks! With the JumpDrive, you can even transfer files between your PC and Mac with no extra steps. It requires no drivers and plugs directly into the USB port found on most computers.CarryYou already carry your keys with you wherever you go, so why not add the JumpDrive to your keychain? With its lightweight size and durability, the JumpDrive is the easiest way to keep your most important data with you at all times. Access your files from home or on the road at a moments notice with no messy cables or adapters. 1-year Limited Warranty.System Requirements:Windows 98SE/Me/2000/XPMac OS X, Mac OS 8.6 or higherOne available USB port*Windows 98 users: Internet connection", "title": "Lexar PD-128-231 128 MB JumpDrive Portable USB Flash Drive", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/41mWaW9ILrL._SY300_.jpg", "related": {"buy_after_viewing": ["B007JR5304", "B007YX9OGW"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "USB Flash Drives"]]}