{"asin": "B00BXAGSRU", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Hubs"]], "description": "HooToo HT-UH011 USB 3.0 7-Port Hub is a super fast USB extension that allows you to connect up to 7 additional USB peripherals. No driver is needed. It is designed with the latest VIA VL812 chipset, and current surge protection. It is ideal for quickly transferring large files (movies, database, projects files, etc), as well as increasing the number of available USB 3.0 ports on your computer and laptop.Specifications:- Chipset: VIA VL812- USB Type: 7 Super speed USB 3.0- Current Protection: Built-in circuit- Transfer Rate: up to 5 Gbps- Compatibility: USB 3.0/2.0- Power: 12V/3A Power AdapterOperation Environment:Windows 7, 8, XP, Vista; Mac OS 9.1 or above/10.2 or abovePackage:1 x 7 port USB 3.0 hub; 1 x USB data cable(3.3ft); 1 x 12V/3A power adapter; 1 x User Manual.Note:- 2.4 GHz wireless devices may not work in close proximity to USB 3.0 devices or hubs.- This hub is not designed to charge devices.- Mac OS X Lion 10.7.4 needs to be upgraded to Mountain Lion 10.8.2 or later. 2012 June MacBook Air and MacBook Pro users can download \"MacBook Air and MacBook Pro Update 2.0\" from the official Apple website as improvement of USB 3.0 performance and compatibility.HooToo Superior Product QualityWe only supply superior quality products. All products strictly follow the standards of CE, FCC and RoHS, and are carefully inspected by a responsible QA team before packaging.", "title": "HooToo&reg; HT-UH011 USB 3.0 HUB 7-Port (12V/3A AC Power Adapter, Latest VIA VL812 Chipset Adopted, 3.3 feet USB 3.0 Cable,), Backward Compatible with USB 2.0 and Supporting Windows / Mac / Linux OS", "price": 28.99, "salesRank": {"Computers & Accessories": 556}, "imUrl": "http://ecx.images-amazon.com/images/I/41EiWQp7fHL._SY300_.jpg", "related": {"also_bought": ["B00GSNNWDA", "B00DGBL6W6", "B00JFNQKK2", "B00B3P15M8", "B005H3Q55E", "B00DKOVVR4", "B00BE67N3Q", "B008EQYRRY", "B00GTGETFG", "B009D79VH4", "B00A20KIXW", "B00FE2N1WS", "B00821FDI8", "B00C7RXR72", "B001E1Y5O6", "B00C7RZPJ0", "B0045ASBLG", "B00DMFB5OK", "B00BBD7NFU", "B00DVH62J2", "B000JE9LD4", "B003VTZ07U", "B0056TYUD8", "B00B7FOQCK", "B00B3Y4FAS"], "bought_together": ["B00GSNNWDA"], "buy_after_viewing": ["B00GSNNWDA", "B00FR795WA", "B00DKOVVR4", "B00GTGETFG"]}}