{"asin": "B00170F3SQ", "description": "Small but mighty, the HP 2133 Mini-Note PC offers you a full-function laptop that weighs just 2.8 pounds. Designed to go where you go without weighing you down, it's perfect for young students in your home, and robust enough to handle demanding business applications for road warriors. Despite its size, it features an 8.9-inch scratch-resistant display with a WXGA resolution and a nearly full-size keyboard (92 percent). A durable all-aluminum case encompasses the top and bottom of the notebook, while an internal magnesium alloy support structure helps protect sensitive components from damage.The HP Mini-Note features a simple, refined design and anodized aluminum shell that is sleek and sturdy yet lightweight. See alarger viewof all the external ports.It's powered by the VIA C7-M ULV processor, which provides a 1.6 GHz clock speed and excellent power management capabilities. Other features include a 120 GB hard drive, 2 GB of installed RAM (maximizing capacity), tri-mode Wi-Fi connectivity (802.11a/b/g), integrated Bluetooth, lightning quick Gigabit Ethernet, VGA webcam built into the screen's bezel for video chats, and up to 4.5 hours of battery life.It comes pre-installed with Microsoft Windows Vista Business, which has a new user interface, named Windows Aero, that makes it easy to navigate through the operating system and from application to application. For instance, Windows Aero helps you juggle multiple tasks at once by providing a three-dimensional, real-time, animated view of all your open applications and documents. Vista also integrates new search tools throughout the operating system, includes new parental control features, and offers new tools that can warn you of impending hardware failures.The BasicsProcessor:The VIA C7-M ULV (ultra-low voltage) processor has a 1.6 GHz speed, 800 MHz front-side bus (FSB) and a 128 KB L2 cache. (An L2, or secondary, cache temporarily stores data; and a larger L2 cache can help speed up your system's performance. The FSB carries data between the CPU and RAM, and a faster front-side bus will deliver better overall performance.)Operating at an average power of less than 1W, the VIA C7-M ULV processor is the embodiment of cool processing and sets the standard for next generation low power mobile and personal electronics systems. It also features VIA PowerSaver technology that further reduces power consumption by dynamically adjusting the frequency and the voltage of the VIA C7-M ULV processor as the system requires. This innovative technology can reduce power consumption by as much as 50 percent while still ensuring seamless mobile operation.Hard Drive:The 120 GB hard drive (5400 RPM) offers enough to room to hold a digital audio library of over 20,000 songs and still have room left over for movies, games, and a large collection of software. This Serial ATA (SATA) hard drive also quickens the pace with a higher speed transfer of data--akin to Firewire and USB 2.0. It also includes HP's 3D DriveGuard, which sends a signal to shut down the hard drive upon sudden movement or shock by using a three-axis digital accelerometer chip.Memory:The 2 GB of installed RAM (2 x 1024 MB, PC2-5300) maximizes the capacity for this PC. It also offers a top-of-class 667 MHz speed.DVD/CD Drive:The HP 2133 Mini-Note PC does not include an integrated optical drive, but HP offers optional drives that connect to the Mini-Note using the optional HP External MultiBay II.Keyboard &amp; Mouse:The spill-resistant keyboard is 92 percent of full size, 101/102-key compatible with isolated inverted-T cursor control keys, both left and right control and alt keys, 12 function keys, and hotkey combinations for audio volume, power conservation, brightness, and other features. It also features HP DuraKeys, which have a clear coating applied over the keyboard to protects the finish and printed letters and characters. The touchpad includes a scroll zone and two soft-touch buttons.The HP DuraKeys have a clear coating applied over the notebook keyboard to protect the finish and printed letters and characters. See alarger viewof the keyboard and internal features.Screen, Video &amp; AudioThe 8.9-inch display has a 1280 x 768-pixel resolution, for native 720p high-resolution clarity, and the Mini-Note includes a VGA output for connecting to an external monitor or projector. Video is powered by the integrated Via Chrome 9 video/graphics card, and it includes an integrated high-definition audio card for crisp sound via the internal 2-watt stereo speakers.Networking, Connectivity &amp; ExpansionThis notebook has an integrated tri-mode Intel 3945ABG wireless LAN (802.11a/b/g), with throughput up to 54 Mbps at 5 GHz (802.11a) and 2.4 GHz (802.11g). It's compatible with 802.11b/g networks (commonly found in home routers and Wi-Fi hotspots) as well as 802.11a networks (which has a higher throughput, but more limited range--great for closed office environments). With the Bluetooth connectivity (version 2.0), you can communicate and synchronize with Bluetooth-enabled peripherals such as PDAs and cell phones. You also get super-fast wired connectivity via the Gigabit Ethernet port (10/100/1000).This notebook includes a next-generation ExpressCard 54/34 card slot (replacing the PCMCIA slot), which lets you take advantage of thinner, faster, and lighter expansion cards for even more advanced wireless, networking, storage, and security features. And it offers a Secure Digital memory card slot for downloading pictures and videos from your digital camera, or filling up a card for your MP3 player. It includes the following ports:2 USB 2.0 ports for connecting a wide range of peripherals--from digital cameras to MP3 players1 ExpressCard/54 slot (also supports ExpressCard/34)1 Secure Digital memory card slot1 headphone/line-out and 1 microphone1 VGA monitor port1 RJ045 for 10/100/1000 Gigabit Ethernet connectivityOperating SystemThe Windows Vista Business operating system is designed to meet the needs of business organizations of all sizes. For small businesses, Windows Vista Business will help keep PCs running smoothly and more securely so you will be less reliant on dedicated IT support. For larger organizations, Windows Vista Business provides dramatic new infrastructure improvements, enabling your IT staff to spend less time focused on the day-to-day maintenance of PCs. An array of sophisticated new backup technologies helps protect your information even in the event of a catastrophic hardware failure. And Windows Vista Business has a new user interface, named Windows Aero, which is designed to deliver new levels of efficiency for any business user. This new interface makes it easy to navigate through the operating system and from application to application. For instance, Windows Aero helps you juggle multiple tasks at once by providing a three-dimensional, real-time, animated view of all your open applications and documents.Every edition of Windows Vista provides the essential tools and technologies to help protect you whether you are browsing the Internet, connecting to a wireless network, or just reading e-mail. All editions of Windows Vista include new tools that can warn you of impending hardware failures long before you have lost any important personal data. And, all Windows Vista editions include parental control features that allow you to manage and monitor your family's use of games, the Internet, instant messaging, and other activities.Preloaded SoftwareMicrosoft Office Ready 2007, Norton Internet Security, MS Live Messenger, Adobe Flash Player, Roxio Creator Basic, Intervideo WinDVD, HP Backup and Recovery ManagerDimensions &amp; WeightThis notebook measures 10.04 x 6.5 x 1.05 inches and weighs 2.8 pounds.PowerThis model is powered by 6-cell high capacity lithium-ion rechargeable battery, which can provide up to 4.5 hours of battery life.What's in the BoxThis package contains the HP 2133 Mini-Note PC (model KX870AT), rechargeable lithium-ion battery, AC adapter, and operating instructions. It is backed by a limited warranty for parts and labor for one year from date of purchase as well as technical telephone assistance for one year. Software is also covered for 30 days from date of purchase.", "title": "HP 2133-KX870AT 8.9-Inch Netbook - 6 Cell Battery", "price": 22.96, "imUrl": "http://ecx.images-amazon.com/images/I/41Bo5H6xP6L._SX300_.jpg", "related": {"also_viewed": ["B00IUOU6MA", "B000UTTJLW", "B005F0IKHA", "B007IDHAOQ", "B00EXPEGX0", "B0062HJVQ4", "B0030T17DW", "B00J2T6RM0", "B00IUP7LNG", "B00EC4QJAU", "B00BPMGJJ8", "B00IUP7ZLO", "B005LLG9Z8", "B00J6Y2I38", "B005J22OLC", "B00DK4BDPY", "B0080F3B94", "B001PII4HW", "B00AS7IE7Q", "B009LL9VDG"], "buy_after_viewing": ["B001UILOCE", "B002BAA9HQ"]}, "categories": [["Electronics", "Computers & Accessories", "Laptop & Netbook Computer Accessories", "Batteries"]]}