{"asin": "B001PUQ7PG", "description": "Livespeakr is an ultra-portable, multi-functional speaker system that allows you to enjoy up to 16 hours of ultimate sound quality on-the-go. Small enough to fit in your back pocket, Livespeakr boasts a unique \"super\" cradle to fit most iPods.Livespeakr FeaturesPremium custom speakers prove that amazing soundcancome in a small package.Speakers expand, contract, and rotate to work with both portrait and landscape orientations.Advanced audio technology shields against radio frequency/GSM interference.Powered by a rechargeable Lithium-Ion battery that lasts up to 16 hours; AC/USB charger included.Sleek retractable aluminum stand on the back provides multiple viewing angles.Rubberized feet prevent the unit from sliding and keep it stable.Low-profile design allows the Livespeakr to be taken anywhere--it can even fit in your pocket!RF Shielding lets you enjoy your Livespeakr without interference from electronic devices.Speakers expand, contract, and rotate to work in both portrait and landscape orientations.Why Livespeakr?Each Livespeakr device features a set of high-quality speakers that expand and contract conveniently into the device as you rotate the cradle. In order to maximize use with any iPhone, Livespeakr is shielded against radio frequency interference.  This prevents obnoxious static interference from making an unwanted, distorted guest appearance on all of your favorite tracks.The Livespeakr utilizes a powerful internal rechargeable Lithium-Ion battery with an average lifespan of 14-16 hours as well as an AC adapter to make this one of the most convenient sound systems on the market today.  With Livespeakr, you can say goodbye to purchasing AA or AAA batteries.How it Works: The 3-Click SystemClick 1:Simply slide the media player into the Livespeakr; the speakers are stored and hidden behind the unit for maximum portability.Click 2:Give the unit a gentle rotation, and the Livespeakr rotates 90 degrees to rest in the vertical or portrait position. You'll receive tactile feedback by feeling and hearing a click.Click 3:Another twist will turn the unit another 90 degrees; the speakers will expand and the unit will click into place.  The Livespeakr is now in landscape mode for viewing all of your multimedia files. Simply reverse these clicks to put the Livespeakr back into storage.Will Livespeakr Charge My iPod?Livespeakr connects using the headphone jack; therefore, it does not charge your iPhone or iPod.NOTE: Livespeakr does not include an iPhone, iPod, or iPod touch. You must remove any external cases you have on your iPhone/iPod to interact with Livespeakr.What's in the BoxLivespeakr System (White), travel box, cradle, USB charging cable, USB-to-AC wall charger, travel bag", "title": "Livespeakr Ultraportable Speaker System for iPod/iPhone (Black)", "price": 16.08, "imUrl": "http://ecx.images-amazon.com/images/I/41S9emoNxdL._SX300_.jpg", "related": {"also_viewed": ["B009CWRVH2", "B003VANOI6", "B0096T7TQE", "B004OA733E", "B001K4YWCW", "B00BQ4HROG", "B00H3JTT30", "B0097BEFI6"], "buy_after_viewing": ["B0038W0N8G", "B009CWRVH2", "B001UEBN42", "B007UT60VC"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}