{"asin": "B0001FTVEK", "related": {"also_bought": ["B000EBPJCO", "B0002MQGOK", "B009GF6X56", "B0083J7EM2", "B005K2TXMO", "B00ATNPW06", "B005LJQMCK", "B009A6CZYO", "B000I23TTE", "B00BVT4M30", "B0001FTVEA", "B005DIRI6I", "B00G191YL8", "B004C4WPXA", "B00005NCWK", "B001TH7GSW", "B003O509PY", "B002TLT10I", "B00F4ORTZ6", "B00HLV1KQO", "B000ENRQ3M", "B009LRR5AQ", "B008DGMNCQ", "B00FQMKZU2", "B000067RC4", "B003LPTAYI", "B0019D6H2M", "B00AWRUIY4", "B00IDXB1W2", "B00FX6KO8Y", "B007K684ZK", "B000FNR726", "B008ALA2RC", "B00DB9WCR6", "B009UEBQIM", "B00870ZHCQ"], "bought_together": ["B000EBPJCO", "B0002MQGOK"], "buy_after_viewing": ["B009A6CZYO", "B002TLT10I", "B0001FTVEA", "B000ULAP4U"]}, "title": "Sennheiser  RS120 On-Ear 926MHz Wireless RF Headphones with Charging Cradle", "price": 79.95, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41Mr-mEf2rL._SX300_.jpg", "brand": "Sennheiser", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]], "description": "General DescriptionThe RS 120 is a lightweight RF wireless headphone system with open, supra-aural headphones. They feature a transparent, well-balanced sound with excellent bass reproduction, making them an ideal choice for both hi-fi and TV use. The transmitter is fitted with an &ldquo;Easy Recharge&rdquo; function for conveniently recharging the included headphone batteries. The RS 120 offers freedom of movement, stylish design and optimum comfort at an affordable price.FeaturesDetailed,warm sound reproduction with excellent bass responseIdeal for all types of modern music and TV useThree selectable channelsVery lightweight and comfortable to wearConvenient controls for easy, intuitive operationTransmitter doubles as a charging unit &ndash; headphones are recharged when stored on the metal cradleTransmitter can be wall-mountedDelivery includes: HDR 120 RF wireless headphones, TR 120 RF wireless transmitter/charging unit, power supply unit for the transmitter/charger, 2 rechargeable NiMH batteries (AAA)Wireless freedom and stereo sound with reception through walls and ceilings up to 328 feetOpen-Aire Supra-Aural design for hi-fidelity audio reproductionVolume, on/off and tuning control located on the headphoneReplaceable earpads for long service lifeSupports the use of multiple headphones receiving the RF signal from one transmitter(use HDR 120)2-year warrantyDelivery IncludesHDR 120 headphoneTR 120 transmitter (audio cable is attached)Transmitter power cable (in a small white box- its there, trust us)(2) AAA NiMH rechargeable batteriesRCA to 1/8\" audio adapter1/8\" to 1/4\" audio adapterInstructions for useIE6 Dynamic In-Ear HeadphonesSennheiser MX 580 In-Ear Stereo HeadphonesHD 218 Closed Back Headphones iPhone/iPod/mP3 Compatible&nbsp;HD 201HD 202HD 428HD 438HD 448Frequency21-18,000 Hz18-18,000 Hz (-3 dB/1 kHz)18-22,000 Hz17-22,500 Hz16-24,000 HzTHD&lt; 0.7%&lt; 0.5%&lt;0.1% (1 kHz/100dB)&lt;0.1% (1 kHz/100dB)&lt; 0.1% (1kHz/100dB)Transducer PricipleDynamicDynamic, ClosedDynamic, ClosedDynamic, ClosedDynamic, ClosedWeight165g130g390g394g380gWirelessNoNoNoNoNoSound Pressure Level108 dB (1 kHz, 1 V)115 dB (1 kHz, 1 V)110 dB112 dB (1 kHz/1 V)(1 kHz, 1 V)Warranty2 yrs2 yrs2 yrs2 yrs2 yrs"}