{"asin": "B00009WAUH", "description": "As renowned as theFinal Fantasyseries has become over the years, the release ofCrystal Chroniclesbrings with it an air of unfamiliarity. Although many of its elements tie into the greaterFinal Fantasyuniverse, this is but a faint echo of what you have come to know and love.While it can be argued that this is a new direction for the series, and therefore shouldn't be put on the same level as the other games, fans have come to expect the best fromFinal Fantasy, and with each passing release, Square has delivered.Crystal Chroniclesmay break new ground, but it lacks the creativity and passion of its role-playing brethren.As stylish as the character designs may be, they are completely void of personality. The story is just as ambiguous. Never once did I feel attached to my character, nor did I care what twists or turns the plot would make. TheFinal Fantasygames are renowned for storytelling, but it seems like an afterthought inCrystal Chronicles. Cinematic flair is also noticeably&nbsp;absent.The gameplay is just as careless and jagged. While the quest can be played single-player, it's meant to be tackled by a group of people (preferably four). Since each player utilizes menu screens often, Square and Game Designer's Studio decided that you could only play multiplayer with a Game Boy Advance attached to the GameCube. Hence, all menu management is done on the GBA screen, and the action on the TV is unaffected. In theory, this is a just solution. As it turns out, though, I found it to be more detrimental to the quest than anything.When a player accesses the GBA, their character on the TV cannot be controlled. Not only does this leave them open to attack, it more or less halts any progress that the group can make. So basically, you still find yourself sitting around waiting for your buddy to make preparations, but instead, you're doing it with a controller that has fewer buttons and dying batteries.To make matters worse, players must also keep an eye on a bucket. To prevent characters from scattering and trying to run in different directions, the bucket emits a field of energy that covers roughly 80 percent of the screen. If you go outside of this barrier, you'll take damage. So you basically must stay huddled together as one person carries the bucket throughout a stage. Without question, this is one of the stupidest ideas in the history of video games.When it comes to the basics of gameplay, the combat is respectable, but by no means great. I really like the timing-based combo system that accompanies both magic and general hack n' slash, yet I absolutely despise losing all of my magic with each new area that I enter. Hence, classes are not defined, and you never really get the impression that your character is growing in power.There's little here that truly excites.Crystal Chroniclesplays like an experiment gone awry, and is unfit to bear the sacrosanctFinal Fantasyname.Concept:A hack n' slash with inventive, yet highly aggravating GBA-based multiplayer connectivity, and a worthless bucketGraphics:Stylish character designs, gorgeous particle effects, and awesome boss designsSound:Not the familiarFinal Fantasymelodies, but memorable nonethelessPlayability:Steers away from button mashing with timing-based chains, manual spell aiming, and multi-person combosEntertainment:A cookie cutter adventure with a lackluster story, poor character growth, and frustrating playReplay:Moderately HighRated:7 out of 10Editor:Andrew ReinerIssue:February 20042nd Opinion:Crystal Chroniclesis here to remind us that every so often, Square Enix actually puts out an average game. It seems like for every thingFF: CCdoes right, it does two things wrong. Combining spells with your teammates is awesome, but half the time it's less effective than two individual castings, and you lose all of your magic between areas. The effects and character models are cool, but downtimes really drag and many cutscenes look awfully similar. The worst part, though, is that character advancement is the slowest I've ever seen. Beat a boss and get your choice of +1 to one of your stats! Thrilling. There is certainly some enjoyment to be had here, but it's sprinkled somewhat thinly among all of the lame and boring parts. On a console with a lot of great four-player titles,Crystal Chroniclesdoes very little to distinguish itself.Rated:7 out of 10Editor:Adam BiessenerSubscribe to Game Informer--Game Informer Review", "price": 59.24, "imUrl": "http://ecx.images-amazon.com/images/I/416GN34N7VL._SY300_.jpg", "related": {"also_bought": ["B002SUF668", "B0000E5U6M", "B00G2F1N80", "1930206402", "B002BSC4RQ", "B0002CHIWO", "B0001OK7VW", "B00006599U", "B00008H2IS", "B00006IJJK", "B00012D0SG", "B00005QEFD", "B0010YOQIM", "B000ARPXU0", "B001NJRR7G", "B00005B8G1", "B00006LU9B", "B000A15K0Y", "B00006FWTX", "B00005Q8LY", "B0002ILS1U", "B00006IJJI", "B00006LEMY", "B0002ILS1K", "B0009UBR3A", "9861019731", "B00005QDQ1", "B00009KO3S", "B00006LELI", "B0000A09EI", "B002L8W5V6", "B00008DHLV", "B0009Z3I0K", "B00007E1OH", "B00005QEFF", "B00009PS24", "B0002A6CQ4", "B000L9NPGG", "B000084318", "B0002IQOPU", "B00095KU5G", "B000066JRN", "B00005QDPZ", "B00005ULXN", "B0000657SP", "B0002I9RQI", "B004P4YIB4", "B000MIL3WY", "B00005Q8M4", "B00009WAUF", "B00005Q8LR", "B0009XEC0M", "B000070IWB", "B00005B8G3", "B00008KTWH", "B00007KUUD", "B00006N5SL", "B000E36ONK", "B0001YYNL2", "B00008RUYZ", "B00008G8IA", "B0001JXAC0", "B00008URUB", "B00L3LQ1FI", "B000069BB0", "B0009351P2", "B004CHLNWQ", "B00006DY1M", "B000AQA9UA", "B00005OARM", "B000EHPQMG", "B00019AZC8", "B001NJPI0Y", "B000AS3AB8", "B00006JN5O", "B002C5BMFI", "B00021HBAE", "B000620PSY", "B000075B64", "B00009PS22", "B00005Q8M0", "B000UQCER6", "B000ARJI88", "B00006HBTW", "B000GABOTU", "B0000A03CX", "B000B5MV6A", "B00009WAUK", "B0009Z3MGA", "B000GIPJ8E", "B00005Q8LV", "B0042BZQBQ", "B0000657SM", "B000066JRH", "B0002WYUB6", "B002FY4AOG", "B00005YYFE", "B00L3LQ4B4", "B00009M98D"], "bought_together": ["B002SUF668"], "buy_after_viewing": ["B000ARPXU0", "B00012D0SG", "B000A15K0Y", "B00006IJJK"]}, "salesRank": {"Video Games": 6792}, "categories": [["Video Games", "More Systems", "GameCube", "Games"]]}