{"asin": "B00149MEVY", "description": "Silent Hill: Homecomingmarks the debut of the renowned psychological horror series on next-generation consoles. Building upon the series' trademark foundations of atmosphere, adventure and storytelling, it introduces a frightening new and standalone gameplay experience destined to haunt the dreams of both first-time players and those with some experience wandering the famously fog-shrouded streets of the town of Silent Hill and its new sinister sister city Shepherd's Glen.Survive Shepherd's nightmareExplore Silent Hill as Alex Shepherd.View larger.Battle frightening enemies.View larger.And the unexpectedly frightening.View larger.Use tools and your wits to puzzle-solve.View larger.The Story of a Grim HomecomingHomecoming'sstory follows the nightmare turned real life of Alex Shepherd, a war veteran returning to his hometown of Shepherd's Glen to investigate the sudden disappearance of his kid brother, Josh. From Shepherd's Glen to the foggy streets of dreaded Silent Hill, Alex must face the darkest of horrors in order to find his brother. Struggling with his own grip on reality, it's here that Alex must unravel the mystery behind his nightmares, discover the truth behind his brother's disappearance, and confront the evil that takes hold of his own flesh and blood in the process.Improved GameplayFirmly steeped in the Survival-Horror genre its series has been pivotal in establishing, action inHomecomingremains based on exploration of the terrors residing in the communities surrounding Toluca lake and puzzle-solving skill as a means of surviving them. But to its credit game developer Double Helix refuses to rest on past laurels, choosing instead to include new more accessible gameplay in the hopes of gaining a new audience forHomecoming. Examples of this gameplay include:Next-Gen Visual and Spatial Features- Every sequel seeks reinvent the namesake game in their series.Homecomingdoes this in three ways, by adding the ability to toggle between a traditional third-person view and an action-oriented first-person view; by adding fully 3-D physics to the game, creating a realistic range of motion for any and all objects impacted by the player; and by adding transitions or \"Hell States\" that alter the game's physical landscape at points in the game both in real-time and via cinematics. All three actively change the way players see themselves and in the process create a whole new game experience.An Enhanced Combat System- Adding to the standard knives, axes, pipes and other melee weapons that made up the arsenal of previousSilent Hillgames,Homecomingadds a wide variety of guns and explosives. Fitting with the military back-story of protagonist Alex Shephard, these weapons can be wielded in attacks weighted as weak or strong and can be strung together in combos to stun or incapacitate opponents, who can then be taken out with powerful finishing moves. With practice players can even perform evasive ducks and rolls and follow these up with counterattacks. But remember that enemy AI has also been significantly improved to compensate for your higher degree of combat prowess, and that it's not uncommon to battle multiple monsters simultaneously.Key Features:Enter the next chapter ofSilent Hillas you delve deeper in the tormented history of the town and learn of the evil that surrounds Toluca Lake.Silent Hill: Homecomingis the 1stSilent Hillgame designed for PlayStation 3.From the murky fog to the ominous shadows, all-new next-gen graphics bringSilent Hillto life like never before.Survive the denizens ofSilent Hillwith an all-new enhanced combat system that gives you a wide array of attacks and counters.Solve the treacherous and deadly puzzles of Silent Hill to discover its darkest secrets.Silent Hill: Homecomingwill feature an all-new soundtrack by acclaimed series composer Akira Yamaoka.Exceptional Replay ValueAlthough Alex Shepherd is the only playable character inSilent Hill: Homecomingthere are many other important characters--some returning from earlier games in the series--that can have a dramatic impact on the game. When interacting with these, players are given a choice in how to proceed via dialog trees. Will you take the short route letting only the search for your brother guide you or will you explore the nooks and crannies that make up the mystery ofSilent Hillhidden in the small talk you share with non-playable characters? The choice is yours, with different paths providing for possible alternate endings each time you delve into the game.A Frighteningly Masterful SoundtrackAll games in the Survival-Horror genre seek to create tension and unease through sound andHomecomingdoes this masterfully through the compositions and sound engineering of Akira Yamaoka. Having scored the music and effects for dozens of video game titles, including all of the previous games in theSilent Hillseries, Yamaoka is considered a master at using sound to illicit a response.", "price": 104.82, "imUrl": "http://ecx.images-amazon.com/images/I/61vdlSfBw-L._SY300_.jpg", "related": {"also_bought": ["B003O6HDHA", "B0050SXAIG", "B0011BE3KA", "B0001Y7404", "B00B59L9T6", "B0050SXLQC", "B003GT8IL0", "B00163LW7K", "B000X1TC0U", "B004UDB9SA", "B002Z7BE24", "B002CZ7FW2", "0744010438", "B002CZ3SLO", "B000XJK40O", "B00309XHD0", "B000HKMPVA", "B002CYWJWO", "B002I0J6DC", "B008E6ZXTA", "B00432O50W", "B00007LV7Y", "B0085CA8QG", "B006476318", "B004CDBP9G", "B00104KCF8", "B000P297EI", "B0023CBZ70", "B0050SWUTQ", "B0012N94WO", "B005VBVQDI", "B0022TNO7I", "B005YR308S", "B009GZX49Y", "B005J5K9UW", "0307892328", "B008XMSR6G", "B009WI7VAS", "B00005ME6O", "B001E7MMNG", "B00AMA4L4E", "B007TYC8MI", "B000R39GPK", "B008CP6MA2", "B000UW1YBW", "B004J6I0YO", "B004P7VGF2", "B001D7T2VC", "B00ENWZAHO", "B0050SX7BQ", "B002I0J8FI", "B000UUATJ2", "B0029MAXR2", "B002I0H2G0", "B0009UC6AI", "B0050SXX88", "B007UM599S", "B001CRM3YQ", "B00KVR4HEC", "B0056WJA6M", "B00001XDUB", "B001YHX4B0", "B007CM0K86", "B001NX6GBK", "B001UWGCW2", "B000FII8KQ", "B004FS8LYK", "B002EE1P2W", "B003O6KWZK", "B00EPIG606", "B00354NANC", "B002BRYHY0", "B005N4HBIW", "B00319DX4M", "B00BFU8IEE", "B00HYPWE8A", "B007SRM5U6", "B004FUI84G", "B00CTKHXFO", "B002I0K7H6", "B002I0J5UQ", "B00BU3WVM6", "B006ZTHFPS", "B002BRZ744", "B0016GC9D8", "B005THAX6K", "B005C2D1YI", "B00269DX5W", "B00198PO5I", "B000P46NMA", "B000WQWPP0", "B002I0J4AM", "B0030GBSUC", "B002I0J5JW", "B00B67ZTUW", "B0045U01OG", "B00B59MXGY", "B002CZ3SEQ", "0744001080"], "bought_together": ["B003O6HDHA", "B0050SXAIG"], "buy_after_viewing": ["B0050SXAIG", "B003O6HDHA", "B00B59L9T6", "B007CM0K86"]}, "salesRank": {"Video Games": 4592}, "categories": [["Video Games", "PlayStation 3", "Games"]]}