{"asin": "B002Z7BE24", "description": "Experience the thrill and terror of the infamousResident Evilfranchise like never before with theResident Evil 5Gold Edition. Featuring Chris Redfield of the originalResident Eviland new partner Sheva Alomar, a West African agent of the Bioterrorism Security Assessment Alliance (BSAA), this sci-fi action/survival game is packed with hordes of fast-moving, quick-thinking enemies that represent a whole new breed of unimaginable undead evil. The Gold Edition features every exciting play option found in the initial releases of the game, including two-player co-op, powerful new weapons and real-time inventory management between players, but also includes allRE5console version download content released to date. This includes new episodes and costumes, an improved Mercenaries Mode, and online versus mode..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }New co-op play and character.View larger.The same dangerously fun action.View larger.Updated Mercenary Mode.View larger.New, hot in-game costumes.View larger.Online multiplayer versus mode.View larger.StoryFrom the ashes of old conflicts, a new terror arises. The Umbrella Corporation and its crop of lethal viruses have been destroyed and contained, but a new, more dangerous threat has emerged. Years after surviving the events in Raccoon City, Chris Redfield has been fighting the scourge of bio-organic weapons all over the world. Now a member of the Bio-terrorism Security Assessment Alliance (B.S.A.A.), Chris is sent to Africa to investigate a biological agent that is transforming the populace into aggressive and disturbing creatures. Joined by local BSSA agent, Sheva Alomar, the two must work together to solve the truth behind the disturbing turn of events.Exciting Two-Player Co-op ModeThe new cooperative gameplay element focuses on the realities of a dual-agent mission, highlighting the ways in which Redfield and Alomar must work together to survive the unexpected, while still allowing them to split up and work alone. To help you maximize the potential of this setup, two-player online and offline co-op modes ensure that you have options when aligning yourself with a partner.New Episodes Episodes and CostumesIn addition to all the campaign gameplay content included in the initial standard console release,Resident Evil 5 Gold Editionalso includes two all-new episodes. These include \"Lost in Nightmares\" in which Chris Redfield and Jill Valentine journey back to the Spencer Mansion from the originalResident Evilto solve its puzzles, and uncover the secrets of the Umbrella Corporation; and \"Desperate Escape\", featuring Jill Valentine and BSAA agent Josh Stone fighting to escape the Tricell facility, and the unrelenting waves of enemies at their heels. The Gold Edition also adds two new costume packs containing a total of four new costumes. These new costumes feature full playability both in-game and in cutscenes, ensuring that Gold Edition players always fight evil in style.Online Versus Mode now IncludedOriginally available only as an additional digital content download, theResident Evil 5online versus mode comes packaged along with the Gold Edition. In it players with free PlayStation Network memberships take control of Chris, Sheva and otherRE5favorites in online battles of up to four players where the choice is yours whether to fight alone or with a team in two game variations which include \"Slayers\", where you compete for points by defeating the zombie Majini, and \"Survivors\", where you fight against human competition.Mercenaries ReunionMercenary Mode, was an unlockable mode available at the end of the single player campaign in the original releases of the game that hearkened back to the franchises roots in the Horror genre. Mercenaries Reunion is an updated version of that mode included in the Gold Edition. It is an all-out, arcade style zombie fest in which players must eliminate as many enemies as they can in a limited amount of time, using only the weapons and ammo that is found in the play environment, and a curtailed number of inventory slots. Available both offline and online, Mercenaries Reunion features eight new playable characters and weapon load outs, providing players with additional opportunities and challenges.An Unprecedented Level of FearCO-producer and series veterans Jun Takeuchi (Lost Planet) and Masachika Kawata (Resident Evil 4Wii Edition,Resident Evil: Umbrella Chronicles) unleash an unprecedented level of fear for the next generation inResident Evil 5, the sequel to one of the highest-rated video games in history according to Metacritic.com and Gamerankings.com. Revolutionizing the series with an unbelievable level of detail, realism and control,Resident Evil 5is certain to bring new fans to the series as well as satisfy veteran players. These incredible changes to both the gameplay and world ofResident Evilmake this a must-have game for gamers across the globe.Key FeaturesGold Edition Extras- Get the fullRE5experience on one disc. This special edition includes: all of the original content, two new episodes, four new costumes, an updated Mercenaries Mode and onlineRE5versus mode.Two Playable Characters&ndash; Chris Redfield, protagonist of the originalResident EvilandResident Evil: Code Veronica, returns and is joined by new playable character Sheva Alomar, an African BSAA agent tasked with investigating the epidemic.Two Player Online Co-op&ndash; New cooperatively-focused gameplay revolutionizes the way thatResident Evilis played. Chris and Sheva must work together to survive new challenges and fight dangerous hordes of enemies.Next Generation of Fear&ndash; Features groundbreaking graphics that utilize an advanced version of Capcom&rsquo;s proprietary game engine, MT Framework, which powered the hit titlesDevil May Cry 4,Lost PlanetandDead Rising.\"Quick-Select\" Inventory System&ndash; Improved inventory system allows items to be traded between characters. To add to the intensity, all inventory management is done in real time; items can even be assigned to the directional pad for instant access.New Control Schemes&ndash; Features new modernized third-person action game control variations as well as the return of the traditionalResident Evil 4control schemes.New Enemies Bring New Challenges&ndash; Enemies boast increased speed and intelligence, making them as dangerous alone as they are in groups.Powerful New Weapons&ndash; The number of weapon variations has been greatly increased providing new ways to keep enemies at bay.Fear Light as much as Shadow&ndash; Lighting effects provide a new level of suspense as players attempt to survive in both harsh sunlight and extreme darkness.", "price": 39.99, "imUrl": "http://ecx.images-amazon.com/images/I/61EcWpmudmL._SY300_.jpg", "related": {"also_bought": ["B0050SXLQC", "B00B59L9T6", "B004UDB9SA", "B005VBVQDI", "B000P297EI", "B007TYC8MI", "B008CP6MA2", "B006ZTHFPS", "B007VPBDIK", "B0029MAXR2", "B001NX6GBK", "B003O6HDHA", "B0050SWUTQ", "B002I0J8FI", "B000X1TC0U", "B0050SXAIG", "B00DT55P94", "B002I0K6DG", "B001YHX4B0", "B002BRZ744", "B008MO6AQO", "B0022TNO7I", "B007CM0K86", "B003O6EDSM", "B00309XHD0", "B0050SXKU4", "B002I0K6X6", "B003O6JIVE", "B005N4HBIW", "B0012N94WO", "B00BSECSP2", "B008PQU3E4", "B003O6E67A", "B0050SWSQQ", "B0085CA8QG", "B009GZX49Y", "B007SRM5U6", "B00149MEVY", "B0055202HE", "B003S55EWI", "B004J6I0YO", "B008CP6Q6M", "B0020H46D8", "B0050SXGU8", "B00269DXXO", "B0056WJA6M", "B0053B7ICO", "B00BMFIXKQ", "B00269DXR0", "B002I0JBL4", "B0050SWZHS", "B002I0H2G0", "B002MED6EO", "B002ZJNWWC", "B00005ME6N", "B0050SXVK8", "B00GJSUUC0", "B008E6ZXTA", "B000P46NKC", "B000HKP88C", "B000FQ2DTA", "B00BAWXCRU", "B000UW21A0", "B008CP6RUW", "B002I0K4QU", "B003C1I06U", "B000P46NMA", "B004FS8LYK", "B000FQ2D5E", "B002I0K622", "B008XMSR6G", "B009JBFF9C", "B00EPIG606", "B005YR308S", "B0050SX1JO", "B000B69E9G", "B003O6KWZK", "B0050SXX88", "B0050SX9VO", "B00104KCF8", "B002I0J6DC", "B0000657SP", "B000FII8KQ", "B008H6GH8I", "B002I0J5NI", "B0050SXEM8", "B0058LLJL0", "B000ZK9QCS", "B00D4AK17A", "B00ENWZAHO", "B0050SX7BQ", "B007XVTR5S", "B00BFU8IEE", "B0045U01OG", "B003O6CBIG", "B001D7T2VC", "B003O6E620", "B004FUI84G", "B00BY0G0YU"], "bought_together": ["B0050SXLQC", "B00B59L9T6"], "buy_after_viewing": ["B0012N94WO", "B0050SXLQC", "B00B59L9T6", "B007CM0K86"]}, "salesRank": {"Video Games": 1368}, "categories": [["Video Games", "PlayStation 3", "Games"]]}