{"asin": "B0044UHMOO", "categories": [["Electronics", "Camera & Photo", "Lighting & Studio", "Photo Studio", "Storage & Presentation Materials", "Digital Picture Frames"]], "description": "Show off your pictures simply.Looking for a digital frame that makes remembering every moment super simple? Check out the Kodak EasyShare P85 Digital Frame. Viewing your pictures in brilliant detail is as easy as popping in a memory card. You&rsquo;ll see every image in bright, vivid, lifelike colors, thanks to our built-in Kodak Color Science technology. And since it&rsquo;s Energy Star qualified, you can share each moment more responsibly while you save power. Because, after all, remembering every moment is why you took the pictures in the first place. The real Kodak Moment happens when you share.Viewing pictures is easy &mdash; simply put in your memory card to start the showSee each image in brilliant, lifelike color thanks to Kodak Color Science technologyAttractive and efficient &mdash; Energy Star qualifiedCreate a one-of-a-kind gift by adding pictures to the frame before you wrap itSo effortless, yet so rewardingViewing pictures is easy&mdash;simply put in your memory card or USB flash drive to start the showCompatible with most memory cardsDisplays pictures beautifullyEnjoy stunning picture quality&mdash;the P85 Digital Frame features proprietary KODAK Color Science Technology to enhance each picture individuallyPictures look amazing on the 8 in. high-resolution 4:3 viewing screenChoose from three picture transition speedsEnvironmentally responsible operationEnergy Star qualified for efficient power consumptionMercury-free panelMakes a great giftGive the frame as a personalized gift by including a memory card with your pictures to get the show started.Package Contents&bull; Kodak EasyShare P85 Digital Frame&bull; Power supply with 6 ft (1.8 m) cord&bull; AC plugs&bull; Desk stand&bull; Quick Start Guide", "title": "Kodak Easyshare P85 8-inch Digital Frame", "price": 139.95, "imUrl": "http://ecx.images-amazon.com/images/I/41tngJw0bML._SX300_.jpg", "brand": "Kodak", "related": {"also_viewed": ["B008MW6Y12", "B0030MIU16", "B00368CDH6", "B005GDSEW2", "B00FWDXZIO", "B008MDOTUE", "B000MURAU6", "B0043554TK", "B00438AR9Y", "B0013A12H6", "B003VTZE76", "B00DYQQSSK", "B002IT3242", "B002FJQFIK", "B00J3TWQ8I", "B003WOLOLK", "B008FC8FJ8", "B008R3875C", "B0041686QY", "B0056HNTAU", "B009A13IB8", "B008FC8FUW", "B00442VXCO", "B005GXFH5O", "B008FC8FPC", "B0043EV1XY", "B00D8JX296", "B00906DNHC", "B008738A0E", "B001XVSAAC", "B00FGHODK0", "B00DYQZ4Z8", "B0016NOTOI", "B007UU354G", "B0036MDUMY", "B0064LCG6U", "B003VTZE7G", "B009W89WDW", "B001FN14RE", "B00I4I92GS", "B0030MIUAC", "B006P1QRFU", "B001T9N9JU", "B00I7FHQFW", "B000MURAT2", "B0036MDUO2", "B005DKZRAK", "B007B4UKOE", "B00FGHA3TK", "B0078OVG0O", "B00FGGO12G", "B000N29KOW", "B0016NN1ZQ"], "bought_together": ["B000P1O73A"], "buy_after_viewing": ["B008MW6Y12", "B0056HNTAU", "B008FC8FJ8", "B00DYQQSSK"]}}