{"asin": "B004QHI3ZW", "related": {"also_bought": ["B006U3ZJ1G", "B007JNWIU6", "B0050FXF52", "B00975PTTQ", "B001F7BL0U", "B003VMXX7G", "0735663866", "B00975PTVY", "B006QF3TW4", "B0042285HW", "1426204205", "B004DT6TEK", "B00LVDZDXY", "B006M9NJIS", "B009IJGSBO", "B008CL24SA"], "also_viewed": ["B00975PTTQ", "B001F7BL0U", "B00975PTVY", "B007SUKPOG", "B006U3ZIQW", "B0050FXF52", "B003VMXX7G", "B00AWTSRDQ", "B00HV3OD1G", "B006U3ZJRA", "B00L4CH3Q2", "B00C94G8NI", "B00542NV32", "B006U3ZJAM", "B006U3ZJ1G", "B006ZGB58Y", "B00542NVDW", "B000BGVYYE", "B002G1YPIE", "B002EOULAE", "B006U3ZINK", "B0062NEHOO", "B002EOSQII", "B00AKHV7RS", "B000OEZSXQ", "B002MZZX9E", "B008VWNBBE", "B007JNWIU6", "B007WZRYXW", "B004JU0E2G", "B00D8DHHWU", "B00542NVS2", "B000PDV0CE", "B002QBSYOA", "B00029TN9S", "B008ALQGG8", "B003C29UAO", "B006DWFGU8", "B0047ZG1LQ", "B002G1YPIO", "B005IQ1V4U", "B003CYKYVQ", "B00J14AMT0", "B00DW40UZQ", "B003TFDTM4", "B002PHRDO2", "B0011XV19O", "B008GT8C7K", "B008YD2SQO", "B001FYQO3W", "B000058BCQ", "B00B6A72HC", "B00264GKVQ", "B001EJP3CG", "B000064184"], "bought_together": ["B006U3ZJ1G"]}, "title": "Bushnell BackTrack D-Tour Personal GPS Tracking Device", "price": 77.75, "salesRank": {"Sports &amp; Outdoors": 16241}, "imUrl": "http://ecx.images-amazon.com/images/I/51II2O32lML._SY300_.jpg", "brand": "Bushnell", "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]], "description": "Keep track of every journey with the D Tour Personal GPS Tracking Device from Bushnell. High-functioning GPS capabilities and a precision digital compass with latitude and longitude allow you to track any course by automatically keeping track of time, temperature, and altitude, along with route, length and speed. You can mark and store up to five locations on the GPS and 24 hours worth of data. A great exercise tool, the D Tour can help track your fitness by recording your time and distance, charting your progress and helping you meet your goals. Hunters can keep track of territories, while boaters and fishers will find the GPS useful for navigation and marking sweet spots. After your workout, trip, or adventure, share you results on Facebook, email them to yourself or a friend, and save them to your computer.What's in the Box?Package Includes: 1 D-Tour GPS unit, 1 Quick-start guide, 1 USB cableKeep track of your progress or routes by uploading D Tour data to your computer.Features:Personal GPS Tracking Device with precision accuracyAllows you to mark and store up to 5 locationsAutomatically records time (military and civilian), temperature, and altitudeWeather-resistant constructionRecords course taken, length in miles and yards or meters and kilometers, speed, temp, and elevationPrecision digital compass with latitude and longitudeAllows you to easily share data via social media, email or save to computerAccelerometer accuracyLogs up to 48 hours of trip dataKeep track of repeated exercise pathsUpload to social media, email, or computerThe D-Tour records course taken, length in miles and yards or meters and kilometers, speed, temperature, and elevation.Specifications:Screen size: 1.625 by 1.625Weight: .25 pounds with batteriesScreen Type: Grayscale LCDPower source: 3 AAA batteries (not included)Unit Dimensions: 2.75 by 4.125 by .875 inches (W x H x D)Runs on Windows (XP SP1 or later) and MAC (10.4.9 or later)1 Year Limited WarrantyBest Uses:HikingBikingRunning/Fitness/Outdoor ExerciseHuntingBoating/Fishing"}