{"asin": "B002ZAVVHY", "description": "The iHM60 is the perfect portable speaker for your iPod/iPhone, laptop, or MP3 player. The compact speaker extends for surprisingly big sound, and snaps shut for the ultimate in portability. Throw one or two in your backpack and you'll always be ready for some jams.The perfect portable speaker for your iPod/iPhone, laptop, or MP3 player.Click to enlarge.Twists open or shut with a small turn, and expands to deliver sound.Unique design provides volume and bass response you might not expect.Collapsible SpeakersThe iHM60 feature an innovative collapsible design. The speakers twist open or shut with a small turn, and expand to deliver sound. Pick up two speakers for stereo, or go with a single speaker for basic mono.Size-Defying SoundYou'll be surprised by the sound these little guys can pump out. A unique \"vacuum bass\" design provides volume and bass response you might not expect in a speaker that fits in your hand.Built-in Rechargeable BatteryA long-lasting internal lithium ion battery gives the speakers plenty of power.2-in-1 CableThe supplied cable works for both charging the speakers and connecting to an audio source, with both a USB plug (charging) and a 3.5mm audio connector. Charge up even while you listen. An LED power and charging indicator lets you know it's working.For Any Audio SourceThe iHM60 works with any device utilizing a 3.5 mm headphone jack, so it's perfect for laptops, cell phones, portable game devices, MP3 players, etc.Convenient Carry PouchSure, they fit in the palm of your hand, but a carry pouch is always handy.What's in the BoxiHome iHM60 Speaker (Blue), Charging/Audio Cable, User's Manual", "title": "iHome iHM60 3.5mm Aux Portable Speaker (Blue)", "price": 21.42, "imUrl": "http://ecx.images-amazon.com/images/I/51KYf9j-VjL._SY300_.jpg", "related": {"also_viewed": ["B001ELK2NY", "B0062W0XD4", "B001UEBN42", "B0082E9K7U", "B00CJJ2224", "B0059ERNG6", "B004DJMQ06", "B004HHICKC", "B00ED5O7OI", "B00ED5MLG4", "B00F8PJ1WK", "B0059ERNGG", "B004DJSVIW", "B00ED5KMSS", "B004SNDC50", "B0039YP37E", "B00H8YSRHO", "B002XNO7FQ", "B004SNDC7I", "B00F8PMITI", "B00BGU7CZE", "B00F8PNPAO", "B0082ENI1O", "B005DI0ZQS", "B00FW8ZO0Q", "B00F8PP3OK", "B00CMBAKKU", "B00343DNJK", "B0057DDYLC", "B002ZAU47M", "B007OYAVLI", "B007T08Y8Y", "B00AFHGDMW", "B00I1K7QWQ", "B00ED5LTGM", "B00CP7SWII", "B0039ZN014", "B005DI0UBS", "B00A837TYO", "B00ED5N8IO", "B00A80VVIC", "B003Y7PXSK", "B00A82WR2E", "B008Y5GHCI", "B005CQRXRK", "B0039WIHNS", "B005DI1PL2", "B005DI1IZA", "B00H8Z0YQ0", "B00A0JUO48"], "bought_together": ["B0062W0XD4"], "buy_after_viewing": ["B0062W0XD4", "B004C51HRY", "B0082E9K7U"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}