{"asin": "B001M53FX6", "related": {"also_bought": ["B0015TJNEY", "B0016P392O", "B004AUK9IY", "B002DW0VT8", "B003VY4M42", "B004HKAIBA", "B005E3U5X0", "B008GWPC1Q", "B003ZC91VO", "B001LJIQ32", "B001M5092G", "B002EQ6E9E", "B0030B6F1O", "B0019WF4FE", "B005BHCZ4Q", "B004I1GHPO", "B000VCTHM4", "B00284VD02", "B002UT36UU", "B003819R2U", "B001FY7LBQ", "B002KL0VY2", "B001MI7I4A", "B001TH7GUU"], "bought_together": ["B0015TJNEY", "B0016P392O"], "buy_after_viewing": ["B00K11RI6W", "B002DW0VT8", "B004AUK9IY", "B005E3U5X0"]}, "title": "SANOXY&reg; 4 LED Blue USB PC Webcam Camera for PC Laptop Notebooks", "price": 9.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41BUG4SJKxL._SY300_.jpg", "brand": "SANOXY", "categories": [["Electronics", "Computers & Accessories", "Webcams"]], "description": "4 LED Blue USB PC Webcam Camera for PC Laptop Notebooks.\nUSB PC WEBCAMSANOXY high quality USB Night Vision PC Web Camera with still image capture and 4 bright LED lights for night vision. Take pictures and videos or send live images across the internet in real time video chat. Chat with your friends on MSN, ICQ, AIM, Yahoo, Skype or net meeting with webcam features. Ideal for video conferencing and other personal communication. Support Windows 2000 / NT / Me / XP / Vista. No built in microphone (microphone not included)\nProduct FeaturesSoftware included:4 LED lights for night vision viewing; still image captureSwivel head design for full 360 degree rotation with suction baseAutomatic brightness adjustment and color compensationCompatible with Windows 2000 / NT / Me / XP / VistaSANOXY brand has been awarded trademarks by the United States Patent and Trademark Office. SANOXY has a duty and a right to inform the market of our patent and trademark rights. Sanoxy Webcams are exclusively marketed by authorized resellers on amazon.com in order to ensure product warranty. SANOXY warranty is not applicable for No Name Generic or other branded products. * All Sanoxy webcams have authentic brand logo on the product and with original Sanoxy product packaging."}