{"asin": "B00752QXZ2", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Input Devices", "Graphics Tablet Styluses"]], "description": "The Friendly Swede Basics Rubber Tip Stylus BundleEasier, smoother typing and gaming with The Friendly SwedeGive your finger a rest! Try The Friendly Swede's Stylus series for easier, smoother, fingerprint-free typing and gaming. Through years of experience, The Friendly Swede has created a complete range of stylus pens that are totally capacitive (work with any device), sensitive, durable and super-comfortable to use.QUICK TIPS\"..due to the non-durable nature of the capacitive touchscreen (iPad, smartphones, etc.) the tip has to be soft. Treat the stylus like a small, soft-tipped paint brush and stroke the screen. If the tip is collapsing or if you tore the tip off quickly, they you trying to write with the stylus versus stroking the screen..\"\"..Soft tip styli do not last. 3-6 months of daily use and they are done....product is disposable..\"The stylus pens are universal and work with all capacitive touch-screen devices.CONTENTS6 x Universal stylus touch screen pen (4.5 inches)2 x 15\" Detachable elastic lanyards1 x The Friendly Swede microfiber cleaning cloth 5.5x3.0\"OUR PROMISE TO YOUWe are totally obsessive about quality and customer service - if you have any questions please get in touch and we will do everything we can to solve them.There's a reason they call us \"The Friendly Swede\"", "title": "The Friendly Swede Basics - Bundle of 6 Capacitive Stylus Pens (Rubber Tip, Universal Compatibility) + Two 15&quot; Lanyards + Microfiber cloth (Black, Purple, Pink, Red, Gold, Silver)", "price": 8.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/51NPF7DsH2L._SY300_.jpg", "related": {"also_bought": ["B008M9XXZK", "B004TLH7C0", "B00CEURAWA", "B0081SDM8U", "B00FJ7HA7U", "B00D9ICTOU", "B00AYSTU4A", "B007R28B50", "B004TRYENE", "B0092KRAXY", "B008E7TQYC", "B004WYA852", "B00CGUCBVI", "B0092KRAXO", "B00H8ZJ97A", "B0075IQKYA", "B006JAVNXS"], "bought_together": ["B004TLH7C0"], "buy_after_viewing": ["B005AOKW8Q", "B007R28B50", "B0092KRAXY", "B0092KRAXO"]}}