{"asin": "B000SDW84K", "description": "Featuring a minimalist footprint and a unique top-light design, the Belkin Hi-Speed USB 2.0 7-Port Lighted Hub (F5U700) lets you connect up to seven peripherals through a single open port on your PC or Mac. Ideal for use with essential system components including printers, storage drives, cameras, and scanners, this Lighted Hub supports both USB 2.0 and USB 1.1 devices. In addition, plug-and-play installation makes adding it to your existing system quick and easy.Hi-Speed USB 2.0 7-Port Lighted HubAt a Glance:Compact design with unique top lightsPlug-and-play installation7 downstream USB ports with transfer rates up to 480MbpsCompatible with both USB 2.0 and USB 1.1 devicesOver-current protection guards your computer and peripheralsBacked by a lifetime warrantyThe blue top lights add a stylish look to your desk.View larger.High-Speed Convenience with Seven USB 2.0 PortsThe Belkin Hi-Speed USB 2.0 7-Port Lighted Hub features seven USB 2.0 downstream ports for fast, efficient data transfers at rates up to 480Mbps. And it's backward compatible with USB 1.1 devices, which means you can keep older-generation peripherals up and running while maximizing the high-speed performance of new devices. You get smooth access to big files and quick transfer of high-resolution photos and video.Unique Design Includes Stylish Top LightsCompact and elegant, the Lighted Hub has a small footprint to preserve desk space, and its silver finish is offset by two, blue top lights that add a contemporary glow to your workstation. Its small size makes it ideal for travel, and it comes with an AC power supply, so you don't have to worry about it draining laptop batteries.Plug-and-Play InstallationA plug-and-play setup gets this seven-port Lighted Hub up and running quickly and easily. Simply connect it to your computer using a USB cable (not included), follow the on-screen directions, and start connecting devices.System Requirements and Warranty InformationThe Lighted Hub works with a broad range of systems. For PC Users, it supports use with Windows 98, 2000, ME, XP, or Vista. For Mac Users, it supports OS 9 to OS 10.The Belkin Hi-Speed USB 2.0 7-Port Lighted Hub is backed by a lifetime warranty.What's in the BoxHi-Speed USB 2.0 7-Port Lighted Hub, AC power adapter, and manual.USB HubsUSB 2.0 4-PortUltra-Mini HubHi-Speed USB 2.04-Port HubHi-Speed USB 2.0 7-Port Lighted Hub (Black)Hi-Speed USB 2.0 7-PortLighted HubHi-Speed USB 2.0 7-PortMobile HubPorts44777USB 2.0YesYesYesYesYesUSB 1.1YesYesYesYesYesUSB PoweredYesNoNoNoNoAC PoweredNoYesYesYesYesUSB HubsUSB 2.04-Port HubUSB 2.0 PlusHub (4 Port)USB 2.0 Plus7-Port HubHigh-Speed USB 2.07-Port Hub2-in-1 USB 2.07-Port HubPorts44777USB 2.0YesYesYesYesYesUSB 1.1YesYesYesYesYesUSB PoweredNoNoNoNoNoAC PoweredYesYesYesYesYes", "title": "Belkin Hi-Speed USB 2.0 7-Port Lighted Hub", "price": 20.0, "imUrl": "http://ecx.images-amazon.com/images/I/41S4ggBuAlL._SY300_.jpg", "related": {"also_bought": ["B003MTTJOY", "111846446X", "B004EYSKM8", "B003X26PMO", "B00AYH22VY", "B000RMRU5Y", "0071807837", "B000SDZ0K4", "B000Q8UAWY", "B006ZZUK5Y", "B009SQQF9C", "B004KSQANO", "B001TH7T2U", "B008TCUXLW", "B000SAB34O", "B003E6493G", "B00I1AELS8", "B00182CIB8", "B008PT4GGC", "B003NREDC8", "B003VNKNEG", "B0045IIZKU", "B001TH7GUU", "B001W1BSM0", "B009LS0XOK", "B001QUA6RA", "B003UE52ME", "B009NKNDVG", "B00834SJU8", "B00004Z5M1", "B002JQNXZC", "B002K3Y2MM", "B00109Y2DQ", "B00DR0RBV6"], "bought_together": ["B003MTTJOY"], "buy_after_viewing": ["B000Q8UAWY", "B003Z4G3I6", "B000TTTJ36", "B000SDZ0K4"]}, "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Hubs"]]}