{"asin": "B00114PN1U", "related": {"also_bought": ["B001P8XVK2", "B0013TOJTU", "B00178ZDF6", "B0039GKJ1W", "B000I5YZL2", "B001DABPPK", "B000TMD3QC", "B00006JPWW", "B001TH7GVY", "B000VEOIDK", "B002GYPS3M", "B001KN6WL2", "B001P95FZ0", "B0000632H7", "B00007FWP2", "B0051M6IPI", "B002BZXAFE", "B001ELQTTA", "B000AAZQM2", "B000TLXCDW", "B000SMZDIY"], "bought_together": ["B00178ZDF6"], "buy_after_viewing": ["B001TH7GVY", "B0013TOJTU", "B00AWZFJ22", "B001P95FZ0"]}, "title": "Canon VIXIA HV30 MiniDV High Definition Camcorder with 10x Optical Image Stabilized Zoom", "price": 934.0, "salesRank": {"Camera &amp; Photo": 4893}, "imUrl": "http://ecx.images-amazon.com/images/I/41sI4R7DSJL._SX300_.jpg", "brand": "Canon", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "From the ManufacturerFor tech-savvy, sophisticated and discerning videographers who demand a first-rate quality camcorder, Canon&#146;s HV30 enables them to capture the ultimate in HD video and still photo quality. The HV30 offers the unparalleled combination of a 10x HD Video lens, a 2.96-megapixel CMOS image sensor, and a DIGIC DV II processor, all packaged in an elegant HDV camcorder.Featuring Canon&#146;s exclusive SuperRange Optical Image Stabilizer to stabilize a wide range of movements, a built-in video light to easily shoot in dark settings, and the new 2.7-inch multi-angle Vivid LCD acreen to view from various angles with true color representation and contrast, your shooting possibilities are now boundless. Beyond that, you can capture amazing HD detail and color reproduction while achieving critical focus with Instant AF. Create the look and feel of Hollywood movies with the 24p Cinema Mode or choose 30p Progressive Mode to capture fast action with optimization for the web. With HD and SD recording modes, you can make the move to HD while retaining compatibility with standard definition equipment. The HV30 is easy to use and delivers the high level of performance you&#146;ve come to expect from a Canon camcorder."}