{"asin": "B00000DMAT", "description": "GoldenEye 007has been a huge success for Rareware, and it's easy to see why. More than a simple movie translation, this has earned its top-seller status on its own. Fans ofDoomandQuakewill recognize the first-person shooter perspective, but there the similarity ends. James Bond 007 has too much style to simply blast everything in sight and move to the next level. No, as 007, the player has a variety of different missions to perform, each with its own specific objectives. Each mission follows thefilmclosely, and so James must use stealth and cunning as much as brute force. But if you see a Kalashnikov rifle lying around, by all means pick it up.Controls are easy to master, which is impressive considering the variety of actions the onscreen hero can perform. James can run and walk at variable speeds, duck, pivot, hide, attach mines to enemy helicopters, block doors from opening, and more. The optional auto-aim feature is especially nice. Of course, James Bond is proficient in a wide variety of weapons. You get to use them all, from the trusty Walther PPK (with silencer) to double sets of full-auto machine guns.The game's faithful tribute to the Bond legacy includes briefing dossiers on each mission, complete with wisecracks from Q and flirtatious comments from Moneypenny. And the 3-D representation of locations and characters from the movie is very impressive. The Rareware team spent time on the set with digital cameras, and it shows.One of the distinguishing features of the game is the outstanding artificial intelligence of the enemies. When attacked, squads will rush to hit the alarm. If they make it, reinforcements come running. Enemy soldiers respond to being shot or blown up with chilling realism. According to Rareware, there are over 30 different animation routines that come into play, depending on where the soldier is hit. For those who prefer the challenge of human opponents, there are six clever multiplayer modes where up to four players can shoot it out, as teams or solo agents.With excellent gameplay, intelligence, and style,GoldenEye 007is a first-person shooter that'll keep you coming back for more.--Jeanne UyPros:Built-in save capability for up to 4 playersAuto-aim feature helps novice players feel like a sharpshooterRich, complex game world filled with detail and varietyGreat bonus missionsCons:Sometimes cinematic scenes for fulfilling mission objectives are a bit anticlimactic", "price": 249.98, "imUrl": "http://ecx.images-amazon.com/images/I/414QkxMtsYL._SX300_.jpg", "related": {"also_bought": ["B00000DMAX", "B00002DHEV", "B00000ID61", "B00000F1GM", "B00002STGL", "B00000J2W7", "B005GTNBGK", "B000PJHAD6", "B00002STH0", "B00002STEZ", "B005DI7N7W", "B005GTND0E", "B00000DMB2", "B00005M8TL", "B00003OTI3", "B00002STFD", "B0015OG4G4", "B00000IFRI", "B000YOCGUO", "B005GTNC8W", "B000021Y2Z", "B003UI5GLC", "B00002STI2", "B00000INR2", "B00000ID60", "B002TK1PX0", "B00004U1QY", "B000F9JFXE", "B00000I1BB", "B000QHOHHE", "B00004UG9B", "B00000DMAQ", "B000Y0CHX4", "B00000J2OO", "B00001QES1", "B00004S9AA", "B00000DMB9", "B00002STFP", "B00000JQ0V", "B00003E4EB", "B00000DMAO", "B00004R9I4", "B003ZU0PHU", "B00004WLMA", "B000021Y30", "B00000DMB5", "B007SJMEHI", "B00002STGN", "B00001TZYA", "B00004S9A7", "B00005ME6D", "B000046Q7Q", "B00000K1AF", "B00004U1R1", "B00000JHPD", "B00004R9IB", "B000031KJM", "B00002STHX", "B00002STFH", "B00000K2GI", "B002J44BXW", "B00005C4IE", "B00001WRJO", "B00000K2G9", "B00001X5C3", "B00004SWLT", "B000031KJT", "B0046CZX78", "B00002STFN", "B000058BCU", "B00004U1R2", "B00002STH5", "B00000K2G7", "B00002STHH", "B00005AW1W", "B00002STXQ", "B00004TUF1", "B00001TZYB", "B00004S9A2", "B000JVM256", "B00002STGU", "B00004U1R3", "B00002SVFZ", "B00HM3QANO"], "bought_together": ["B00000DMAX", "B005GTNBGK"], "buy_after_viewing": ["B002TK1PX0", "B00002DHEV", "B00000DMAX", "B00856304Y"]}, "salesRank": {"Video Games": 802}, "categories": [["Video Games", "More Systems", "Nintendo 64", "Games"]]}