{"asin": "B000Y634SU", "description": "Blu-ray means incredible full-HD images, breathtaking sound and 5x the data capacity of DVDs. Now Blu-ray means something else too: an entirely new movie-viewing experience, made possible by Final Standard Profile, which adds features never seen before, like four Picture-in-Picture modes including Enhanced Commentary (from directors and actors), Backstage Pass, Peek Behind the Animation and Audio Mixing.Images So Real, You Feel Like You're in the PictureCombining a PHL Reference Chroma Processor with advanced P4HD (Pixel Precision Progressive Processing) imaging technology, UniPhier &#x97; the Precise Digital Video processor &#x97; reproduces crisp, natural colors that are extremely faithful to the original movie. It does this by up-sampling the color information in decoded video signals, while the super high-speed P4HD up-converts content recorded in 480i/p, 720p or 1080i format to 1080p by correctly generating each pixel according to information drawn from up to 60 surrounding pixels. The image motion of each pixel is then categorized into one of 16 levels, from stationary to super fast. Image quality is further enhanced by Diagonal Processing, which creates smooth, sharp diagonal lines, and 3:2 Pull-Down, which optimizes the processing accordingly for film or video making the images look natural and lifelike. In addition, the DMP-BD30's HDMI output is Deep Color compatible, with 4,096 steps of gradation for even smoother, finer-quality images that meet Hollywood's stringent demands, so you can experience movies just the way they were meant to be experienced.Incredible Sound Completes the Hi-Def ExperienceWith Precise Digital Audio, Blu-ray's beautiful images are complemented by exceptionally pure, accurate sound thanks to Dolby TrueHD and DTS-HD. UniPhier's advanced processing capability decodes these audio signals with high precision and outputs them in bitstream form with no degradation. It also brings re-mastering to Blu-ray for the first time, which compensates for data lost during the compression process creating a fuller, richer sound.HD Networking with SD CardThe convenient SD card slot on the DMP-BD30 allows easy viewing of hi-def videos and photos on your HDTV. Videos shot with a Panasonic HD camcorder are output in their original 1920x1080 resolution, while still images taken with a Panasonic Lumix digital camera are up-converted and output in 1920x1080 resolution1.One-Touch Control from Your TV's RemoteWith EZ Sync HDAVI Control, you can control your Blu-ray Disc player &#x97; and all your home theater components &#x97; with your TV's remote2. Simply press the EZ Sync button and select \"BD Player\" on the menu screen; the BD player's menu will be displayed and you can begin playback.", "title": "Panasonic DMP-BD30K 1080p Blu-ray Disc Player", "price": 142.0, "imUrl": "http://ecx.images-amazon.com/images/I/31Q6k0RlUqL._SX300_.jpg", "related": {"also_viewed": ["B00752R4PK", "B00752R4Y6", "B001V9LA44", "B001GAOYCS", "B00752R4QO", "B00AYB3OMG", "B00AYB3OOY", "B00B9JR5H2", "B001A5NGZU", "B0038KV0BM", "B0091VAHIO", "B00B9JR5EU", "B00752R4S2", "B004G8HXXO", "B009AHQ8C8", "B0038KN114", "B004LNFJCQ", "B006U1YUZE", "B001VZ1W5U", "B0038KR8WM", "B00F6B3ULE", "B001URWAYG", "B00GPFM106", "B001A4LVYY", "B00JLOES8G", "B0036WS4CA", "B006H8WFU2", "B009LRR5AQ", "B004N85YBA", "B001FN3ZRQ", "B00BFRKYVM", "B008982LDY", "B006U1YVZ8", "B005C98484", "B000VSWCRK", "B004BLK24S", "B00HPMCO14", "B00752R5Z4", "B00BQ3EGPU", "B00BFDHVAS", "B003ZXE87A", "B0076R7FWQ", "B00EUY59Z8", "B00AWKC0JM", "B00HPMCO6O", "B00AWKC0EC", "B00BFYUTO2", "B004K1EOCA", "B00KQ2EQUM", "B007WF1IMK", "B005NEZDUA", "B00BD7UVKI"], "buy_after_viewing": ["B00AWKC0JM", "B00752R4QO", "B00752R4PK", "B0019EHU8G"]}, "categories": [["Electronics", "Television & Video", "Blu-ray Players & Recorders", "Blu-ray Players"]]}