{"asin": "B0042USV5A", "categories": [["Electronics", "Camera & Photo", "Lighting & Studio", "Photo Studio", "Storage & Presentation Materials", "Digital Picture Frames"]], "description": "The future has arrived with the NIX Pro Series 12\" frame featuring a motion sensor to added convenience. Killer styling from the design studio 'NIX of London' is coupled with the latest tech to deliver the ultimate in convenience, featuring a motion sensor that turns the frame on when you're nearby and off when you're not. It really couldn't be any more convenient whilst also saving an estimated 60% off your energy bill. This frame makes a perfect gift for technophobes, no longer will a frame sit around grandma's house unused!  Stylish azure blue touch controls on an obsidian black frame provides for a modern yet elegant look complimenting most interior decors. The NIX frame is designed for the greatest convenience: grab the memory card from your camera (or USB flash drive), insert it into the frame and transfer your images directly onto the frames large 2GB internal memory. The frame will automatically re-size your photos to the optimal size for the frame, allowing you to store as many as 16000 images on the 2GB internal memory whilst maintaining the best resolution for your frame. Alternatively you can connect the frame directly to your PC or MAC and transfer movies, music or other images (note the frame does not resize files from a computer only directly from a memory card or USB flash drive).  The frame's motion sensor operates by switching the frame off when it senses no movement. You can set the frame to power off after sensing no movement for any period of time from 1 second through to 24 hrs down to the second!  The motion sensor makes the frame ideal for commercial use too: grab customer attention with the motion sensor. Remind employees of SOP's or announcements when they pass by. Hospitals worldwide use motion-sensing frames to remind staff of hygiene procedures at key locations.", "title": "NIX Pro Series 12&quot; Digital Frame with Motion Detection Sensor", "price": 119.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41jxmpk0j6L._SX300_.jpg", "related": {"also_bought": ["B003VNKNEQ", "B008MW6Y12", "B00DYQQSSK", "B003VNKNF0", "B0013AV9TW"], "buy_after_viewing": ["B00DYQQSSK", "B008MW6Y12", "B00DYQZ4Z8", "B0056HNTAU"]}}