{"asin": "B002CWZ29S", "description": "If you're a style-conscious person who believes that technology should enhance your enjoyment of entertainment and online experience, then look no further than Logitech's Compact Keyboard K300. Unlike standard media keyboards, which are bulky and cluttered with extra keys, the Compact Keyboard K300 provides the stylish control you're looking for, with beautiful backlit media controls, full-sized keys, and a thin profile in a space-saving design.Control your media. Smarten up your space.With just a touch, the Logitech Compact Keyboard K300 has stylish, backlit media controls that provide an elegant and easy way to access your music, videos, and e-mail. Space-saving design with full-size keys integrates perfectly into even the most stylish setups, freeing up space on your desk. Full-size, integrated number pad makes data entry fast and effortless. The ultra-flat profile helps you type comfortably with keys that move quietly, shifting your wrists toward a more neutral position. Plus, it works right out of the box with no software to install.Key FeaturesStylish, backlit media controlsStylish, backlit media controls provide an elegant and easy way to access your music, videos, and e-mail with keys that blend cleanly into the most stylish setups. Keyboard features include:music and volume controlslaunch calculator buttonweb and e-mail controlsWindows Vista start keyprogrammable F-keysSpace-saving design with full-size keysIntelligent power management with automatic sleep mode, on/off switch, and a battery status indicator allows you to go for months without changing batteries&mdash;up to 15 months for the keyboard and up to 8 months for the mouse.Integrated full-size number padFull-size number pad makes data entry fast and effortless.Ultra-flat profileThe ultra-flat profile helps you type comfortably&mdash;the keys move quietly and feel great, helping your wrists shift toward a more neutral position.Easy setupNo software to install, the keyboard works right out of the box.Which Logitech keyboard and mouse combo is right for you?GoodBetter&nbsp;BestUltradiNovo  Keyboardfor NotebooksIlluminatedKeyboardWaveKeyboardCompact KeyboardK300&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Product InformationKeyboardWirelessCordedCordedCordedIntegrated Number PadConnection FeaturesUSB SupportWireless ProtocolAdvanced 2.4 GHzN/AN/AN/AWireless Security128-Bit AES EncryptionN/AN/AN/AKeyboard DesignEnhanced Comfort&nbsp;&nbsp;&nbsp;Ultra-Thin Profile&nbsp;&nbsp;Palm RestIntegratedIntegratedIntegrated CushionIntegratedBacklighting&nbsp;&nbsp;&nbsp;Adjustable Height/Angles&nbsp;Operational and Navigational ControlsEnhanced F-KeysLaunch Calculator Key&nbsp;&nbsp;Search Web&nbsp;Communication ControlsLaunch E-Mail&nbsp;Launch Web Browser&nbsp;Launch IM / VOIP&nbsp;System SupportCertified for Windows VistaWindows XPMac OS X&nbsp;&nbsp;&nbsp;What's in the BoxPackage ContentsLogitech Compact Keyboard K300Quick-start guide3-years limited hardware warrantySystem RequirementsPC with Windows XP, Windows VistaUSB connectivity", "title": "Logitech Compact Keyboard K300 (Black)", "price": 13.95, "imUrl": "http://ecx.images-amazon.com/images/I/41X2BMN8Q6L._SX300_.jpg", "related": {"also_viewed": ["B003ELVLKU", "B005EOWBHC", "B001F51G16", "B0036ECGS6", "B002MUYP3E", "B003UT2E8E", "B004SUILFO", "B001OAR26K", "B003VAM36K", "B003YGVDDU", "B007PJ4PN2", "B002MMY4WY", "B004VVLZN0", "B002QFOKOO", "B001CJH6Y6", "B003JZU8DC", "B0028PJ6OQ", "B00GLDVSNI", "B0036WTWX0", "B0053O9ZNQ", "B008CXTX7S", "B00EDI0WW6", "B00B7GV802", "B004SUIMGW", "B0025ZSBNG", "B00ALSO4N0", "B0041A5OGA", "B00CEZQ8FA", "B00CKF6ACK", "B002VKMO0G", "B003NREDC8", "B0007TFLSU", "B0075PY6HG", "B002ZV51DI", "B008D1JRIO", "B0071JXD7U", "B005SGIILO", "B003VAGXWK", "B004N627KS", "B00I0S6SK0", "B00BBUCCKO", "B00426HI8U", "B00FWJF6E4", "B00F3U4TQS", "B0038KLIPA", "B003PHJJV6", "B009K7QB8O", "B005Y0G9ME", "B004ABJH2C", "B004V94F5C", "B004GV7PJ8", "B00JV8P5J8", "B00C9W27RQ", "B00KCHQDS4", "B00CRBJ1VO", "B0083AWDP4", "B002LB42NM", "B00F8W9SWQ", "B00BP5KOPA", "B000MAFQ20"], "buy_after_viewing": ["B003ELVLKU", "B005EOWBHC", "B007PJ4PN2", "B001F51G16"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Keyboards"]]}