{"asin": "B004KKZ0J2", "categories": [["Electronics", "Camera & Photo", "Underwater Photography", "Cameras"]], "description": "Panasonic's Lumix DMC-TS3, specifically designed for active users who want to capture high-quality photos and 1920 x 1080 full-High Definition videos, incorporating a powerful rugged design and new outdoor-friendly features, such as a built-in GPS function, a compass, altimeter and barometer.  The new 12.1-megapixel Lumix TS3 further strengthens its toughness, when compared to its Lumix TS2 predecessor,  and is now waterproof to approximately 40 feet (12m); shockproof to approximately 6.6 feet (2m); freezeproof to 14&ordm;F (-10 degrees C); and dustproof.The Panasonic Lumix TS3 also features the new Panasonic 3D Photo mode, which produces a realistic 3D photo by taking 20 consecutive photos and overlays the two best to create a 3D image that can then be played on a Panasonic VIERA 3D HDTV. The format of 3D images is compatible with MPO, and can also be played back on other MPO-compatible equipment such as a televisions, digital photo frames and printers.  Panasonic also adds the Lumix Image Uploader, for seamless and instant sharing via Facebook (for digital photos) or YouTube (for videos). Users can checkmark the photo or video files they want to share, connect it to a PC with the included USB cable or by inserting the SD Memory Card directly into the PC's SD Card slot, and then the uploading automatically launches with an easy-to-follow menu option.The Panasonic Lumix TS3 features a 28mm wide-angle Leica DC Vario-Elmar lens, complete with a folded optics design. With an optical zoom up to 4.6x, the Lumix TS3 works even while shooting video--giving the user the flexibility for a variety of different scenes--especially underwater, where movement is often restricted and the angle of view becomes important for composing shots.  Thanks to the newly incorporated Intelligent Resolution technology, the Intelligent Zoom is available and extends the zoom to 6x equivalent.Empowered by a newly developed 12.1-megapixel Hi-Speed CCD sensor, the Lumix TS3 is compatible with high-speed, large-capacity signal processing required for 1920 x 1080 full-HD AVCHD video recording and high speed continuous shooting. The advanced image processor, the Venus Engine FHD, powers Panasonic's Intelligent Resolution and the Sonic Speed AF, allows for a shutter release time lag as short as approximately 0.005 second. Beyond full-HD video recording capabilities, Lumix TS3 excels in shooting videos with a Dolby Digital Creator so audio quality is also high.  The built-in LED light greatly supports shooting in dark situations. The Lumix TS3 also features a 2.7-inch, 230,000-dot Intelligent LCD screen with wide-viewing angle and Anti-Reflection coating.Panasonic's iA Mode, a suite of technologies that engage automatically, has evolved for more powerful image stabilization while video recording and taking still photos with Active Mode which boosts POWER OIS to excel in suppressing blur when recording videos at wide angle while walking. Other features of iA include: POWER OIS, Face Recognition, Face Detection, AF Tracking, Intelligent ISO Control, Intelligent Scene Selector and Intelligent Exposure. With iA, taking beautiful photos is possible for users at any skill level. In addition, the Intelligent Resolution technology is always activated in the iA mode, which helps produce even clearer photos by precisely performing signal processing pixel by pixel to help ensure clear and sharp images.The newly-integrated GPS function shows the name of the Country/Region, State/Prov./County, County/Township, City/Town/Village and Landmark by using the internal data to give users details on where the photos or videos were taken.  The area information covers 203 countries or regions for global users. Plus, more than 1,000,000 landmarks over 78 countries or regions are in the database. Using the included software PHOTOfunSTUDIO 6.1 HD Lite Edition, photos and videos can be searched by location and names. The Lumix TS3 also features an internal clock that automatically adjusts to the local time when GPS is enabled--a handy feature for travelers.Panasonic Lumix TS3 Highlights3D Photo ModeThe newly added 3D Photo Mode*produces a 3D image in the camera. The image-processing method used by LUMIX records beautiful images with less distortion or visible image links. Take 20 panning shots and the camera automatically selects the two most suitable images--one for the right eye and one for the left eye--to synthesize a 3D composite.The 3D image can be viewed on a VIERA HDTV. The 3D image format is compatible with MPO, so it can be played back on other MPO-compatible equipment such as TVs and digital photo frames, or printed.*The picture size is fixed to 2-megapixel (16:9)3D Image Viewer/VIERA LinkPhotos or movies recorded in AVCHD on the SD/SDHC/SDXC Memory Cards are easy to view on a Panasonic VIERA TV. Simply insert the card into the VIERA Image Viewer (SD/SDHC/SDXC Memory Card slot) on VIERA TV or DIGA Blu-ray Disc Player to playback your contents. Alternatively, you can use an optional HDMI micro cable to output the still and motion images you took from the DMC-TS3 directly to the TV for VIERA Link. Most of the control is possible using only the TV's remote control.Leica DC LensThe DMC-TS3 features a high-quality LEICA DC VARIO-ELMAR 28mm wide-angle lens with a 4.6x optical zoom (35mm camera equivalent: 28-128mm). The folded optics of shaft guide method is adopted to secure the toughness of the lens unit. This lens unit comprises 10 elements and a prism unit in 8 groups, including an ED lens and 5 aspherical lenses with 6 aspherical surfaces passing the Leica's stringent standards to deliver exceptional optical performance to the edges.The DMC-TS3 is drop proof from a height up to 2.0m in accordance with the \"MIL-STD 810F Method516.5-Shock\" test standard. In addition to reinforcing the exterior of the camera with shock-resistant material, the DMC-TS3 uses folded optics to prevent its lens unit from taking damage when dropped during operation. The lens unit is protected by a supplementary damper to absorb the force from shock impact. All components including the lens unit are reexamined to endure the temperature as low as -10 degrees C to make the DMC-TS3 freezeproof.2.7-inch high-resolution LCDThe DMC-TS3's large 2.7-inch LCD features a high 230,000-dot resolution, and a wide-viewing angle that lets you frame your shot in a variety of ways for both shooting and viewing. LUMIX's acclaimed Intelligent LCD function also automatically adjusts the brightness in 11 steps according to shooting conditions. In addition, the AR (anti-reflective) coating LCD minimizes glare and provides clear images, for high visibility even in outdoor brightness.This LCD provides sharp, clear images in virtually all shooting situations, ranging from nighttime to bright daylight scenes and from low-angle to high-angle shooting. And it lets you share the fun of viewing images with family and friends.Lumix Image UploaderThe DMC-TS3 gives you a new form of communication by letting you share your photos and movies. All you have to do is checkmark the photos and movies you want to share and connect the camera or SD/SDHC/SDXC Memory Card to a computer. Uploading automatically starts by simply following the guidance. It's easy to share photos and movies on the spot, which means that your friends don't have to wait for you to come back home to see them.", "title": "Panasonic Lumix DMC-TS3 12.1 MP Rugged/Waterproof Digital Camera with 4.6x Wide Angle Optical Image Stabilized Zoom and 2.7-Inch LCD (Silver)", "price": 329.99, "salesRank": {"Camera &amp; Photo": 4471}, "imUrl": "http://ecx.images-amazon.com/images/I/41ys1-rLDoL._SX300_.jpg", "related": {"also_bought": ["B003CK10DG", "B0049Q7LFI", "B002ACZX3K", "B002P9VHGU", "B004OZEM24", "B005MEZJOG"], "buy_after_viewing": ["B003VNKNF0", "B003VNKNEQ", "B003CK10DG", "B00ATE7ULY", "B00ATE7ULY"]}}