{"asin": "B003CFB1AS", "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Cases & Sleeves", "Cases"]], "description": "Keep your iPad's touch screen looking like new with the Belkin ClearScreen Overlay for iPad. Transparent and protective, the ClearScreen Overlay helps you avoid scratches on the device's all-important screen. A practical accessory for your iPad, the overlay can be applied in a few simple steps for long-lasting peace of mind.ClearScreen Overlay for iPadAt a glance:Shields iPad touch screen from scratchesPerfectly transparentEasy applicationIncludes cleaning wipe and smoothing cardThe ClearScreen Overlay helps you to prevent nicks and scratches that occur from everyday use.View larger.Protects Against ScratchesWhen it comes to protection, your iPad is too important to overlook. The Belkin ClearScreen Overlay for iPad is a simple, common-sense solution that helps keep your device's screen free of the nicks and scratches that occur from everyday use.Easy ApplicationThe overlay applies easily in just a few quick steps. Start by thoroughly cleaning your screen with the included Cleaning Wipe. Then, separate a corner of the overlay (no more than a thumbnail's length) from its backing, taking care not to touch the adhesive side. Line up the exposed part of the overlay with the top border of your screen, and slowly run the rest of the overlay across the screen. Finally, smooth the overlay onto the screen with the included smoothing card by gently pressing down on it.Once applied, the overlay should appear perfectly clear and transparent. You may even forget it's there.The Belkin ClearScreen Overlay for iPad is backed by a one-year, limited warranty.About Belkin International, Inc.Belkin offers a diverse product mix that provides people with seamless electronics integration in their homes, cars, and on the go. Founded in California in 1983, Belkin is a privately held company and the recognized leader in connectivity solutions, in addition to accessories for MP3 devices, computers, and more. We provide extensive solutions for networking, home theater-with our PureAV line of cables, power, and digital wireless accessories-and many more categories. Belkin's phenomenal growth has led to our expanding global presence. In addition to corporate headquarters in Los Angeles, we now have offices throughout Europe-in the United Kingdom, the Netherlands, and Germany, among others-and in the Asia Pacific region, including Australia, Shanghai, and our regional headquarters in Hong Kong.What's in the BoxBelkin ClearScreen Overlay for iPad, cleaning wipe, and smoothing card.", "title": "Belkin F8N365tt Screen Overlay for Apple iPad", "price": 10.33, "imUrl": "http://ecx.images-amazon.com/images/I/416ajCs9prL._SX300_.jpg", "brand": "BELKIN", "related": {"also_viewed": ["B00GDTV308", "B003D8GAA0", "B00G9TIR9W", "B00F6A9672"], "buy_after_viewing": ["B00EL94Z4I", "B00BG34UMY", "B004Q3RE24", "B004WYA852"]}}