{"asin": "B000BP8AY2", "description": "Amazon.com Product Description Weighing not much more than its power source (a single AAA battery), the Sansa m250 2 GB flash memory digital audio player is a full-featured, ultra-portable MP3 player. The m250 includes FM radio and voice recording, a backlit LCD screen that displays ID3 tag information, support for multiple file formats, and full compatibility with most subscription services.The Sansa M250 can hold 32 hours of CD-quality MP3 tracks on its 2 GB memory.Detailed view of thebasic controls.The Music LCD screen.The FM Radio LCD screen.Top Level Menu.Take Your Music With YouThe 2 GB Sansa m250 will hold approximately 32 hours of CD-quality MP3 tracks (encoded at 128kps) or 64 hours of WMA tracks (at 64kbps). It's compatible with MP3, WMA, secure WMA, and Audible audio file formats. The backlit LCD screen shows ID3 tag information for the currently playing track (song title, artist and album). Navigate the music on your player with ease, sorting by artist, album, song title, playlist or other criteria. With five equalizer types, you can optimize your sound for your favorite style of music, such as, Rock, Jazz, Classical, Pop, and Custom (user-defined). Keep the music coming with up to 19 hours continuous playback using one AAA Battery.FM RadioThe m250 includes a digital FM radio tuner for portable radio listening. Easily access your favorite stations by adding them to one of the 20 presets.Voice Recording IncludedUse the built-in microphone to capture interviews, classes, short notes to yourself, or anything else you might feel inspired to record.Peace of Mind With PlaysForSureThe SanDisk Sansa m250 digital audio player uses PlaysForSure technology. Look for the PlaysForSure logo if you want to make sure the digital music and video you purchase will play back on it every time. Match the PlaysForSure logo on a large selection of leading devices and online music stores. If you see the logo, you'll know your digital music will play for sure. Choose from a large number of digital music and video stores, including MTV's Urge, Rhapsody, Yahoo!, MSN Music, MusicMatch, MusicNow, Napster, Wal-Mart Music Downloads, and many more.Ease of OperationTo transfer songs to the Sansa, simply connect the device to your PC via the included USB 2.0 cable. The device will appear as a drive in the Windows Explorer. Just drag and drop your compatible music files and be on your way. Additionally, use a variety of music software to move licensed music to the device. Works with Windows XP and Windows Media Player 9 or later.What's in the BoxSansa m250 MP3 Player, Earphones, Armband and Case, AAA battery, and USB 2.0 travel cable.", "title": "SanDisk Sansa m250 2 GB MP3 Player (Black)", "price": 34.99, "imUrl": "http://ecx.images-amazon.com/images/I/41A12CR07JL._SY300_.jpg", "related": {"also_viewed": ["B002MAPT7U", "B000BP50AY", "B0035PBHRM", "B000VIHFZ4", "B000BONJXU", "B00CE3YJCQ", "B000ETXOC8", "B000LBNZKU", "B000IM9542", "B002MAPS6W", "B00AF40U5G", "B0035ZU4G2", "B002MAPSC6", "B007V7XQ7E", "B005FVNGRS", "B000ETVKHE", "B000F3NIYW", "B0001F22R8", "B002MAPRYU", "B000BFHWXM", "B00BTLN5OC", "B00400TGEC", "B00HCMZ2SE", "B00083XXQM", "B000MD40N8", "B00HCMZ19Y", "B000BPPRPC", "B000EUCMWK", "B005FVNGZA", "B000IM5GBS", "B0035PBHX6", "B00BG13P9K", "B005FVNGRI", "B0035PBHS6", "B000MQJ19S", "B002MAPSQM", "B005FVNH04", "B009PO32AM", "B0076HNNHM", "B005FVNGZU", "B0035P4BXO", "B005FVNGZK", "B00066EK3G", "B004COIBFG", "B005Q6MX7G", "B007C87KSI", "B00HCMZ0OK", "B00D1ZXVDY", "B000RN62LG", "B00AQRXEDC", "B00KAUMPG2", "B000V8CZYA", "B009PNXZFA"], "buy_after_viewing": ["B002MAPT7U", "B000BP50AY", "B0035PBHRM", "B005FVNGRS"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}