{"asin": "B002HWRZ2K", "related": {"also_bought": ["B00IKMJ9B6", "B008I64LC6", "B008I646WG", "B0033Z2BAQ", "B00IKMJWY0", "B00K2MAU5Q", "B005O65JXI", "B00H09BB16", "B00E3W1726", "B006JH8T3S", "B0043T7FHK", "B005T63BJM", "B003VANO7C", "B004SUO068", "B008ZVRAQS", "B0088PUEPK", "B000GZ6ZQW", "B00EUAFAF6", "B00BBUCCKO", "B000PMGZDO", "B000I23TTE", "B000J2EN4S", "B007PJ4PN2", "B00BCEK2LA", "B005T3GRNW", "B00BP5KOPA", "B000OGX5AM", "B003VAHYNC", "B00CO8TBOW", "B00IZEYIRO", "B003ELVLKU", "B00KPRWAX8", "B000UEZ36W", "B004IJZNHO", "B00DKXXAAQ", "B008DWH00K", "B009O7YUF6", "B006YG9EEW", "B005BZNDOO", "B000SE6IV8", "B00FJRS6FU", "B0092ML0MY", "B002XLR0JI", "B000N99BBC", "B001TH7GVE", "B00BQ8RM1A", "B004EFUOY4", "B00B17C5KO", "B009O7YORK", "B001TH7GUA", "B00IDG3IDO", "B00D78QCYK", "B009GUXU52", "B008V9959O", "B0079XWMEI", "B003VANOFY", "B0041BT21M", "B0058UUR6E", "B00A0HZMGA", "B000W8UIZW", "B00DHW4HXY", "B005T3GRN2", "B002N0MZMQ", "B005DLDO4U", "B006EWUO22", "B00CZIQXBA", "B001F51G16", "B004OAFO0I", "B00H09BOXQ", "B00CBQO930", "B005BZNDS0", "B0060AU5MW", "B004QRKWLA", "B00BFOEY4I", "B00FJRS628", "B003L1ZYYM", "B0096XTJKO", "B00000JRRD", "B00JX1ZS5O", "B0000AI0N1", "B009UEBQIM", "B00E3W15P0", "B00BBIJ600", "B000067RC4", "B0027VT6V4", "B001TH7T2U"], "bought_together": ["B00IKMJ9B6"], "buy_after_viewing": ["B0027VT6V4", "B002FU5QM0", "B003VAHYTG", "B003VAK1FA"]}, "title": "Logitech Z313 Speaker System", "price": 38.79, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41aXw5OM6KL._SX300_.jpg", "brand": "Logitech", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]], "description": "From the ManufacturerSay goodbye to tinny computer speakers and dull sound. With the Logitech Speaker System Z313, it's easy to have the big listening experience you've been missing. The convenient control pod puts volume control at your fingertips. 25 watts (RMS) of power fills your room with dynamically rich and balanced music. The compact subwoofer fits in tight spaces, like under your desk, producing deep bass you can feel. And setup is a snap. Just connect the system to your computer and you're done.The easy choice for a room-filling sound experienceYour computer isn't just a computer. It's also your music, movie and gaming center. But when you want the full sound experience, built-in computer speakers just don't cut it. That's where the Logitech Speaker System Z313 comes in. Twin satellite speakers and a compact subwoofer make it easy to bring your music and entertainment to life. You have plenty of power to fill your room with clean, rich sound&#8212;and a handy control pod to turn up the volume the moment the music moves you. From crisp high notes and warm mid-tones to deep, thumping bass, you'll never miss a beat, note or nuance. Just plug it in, kick back and enjoy big, balanced audio.&nbsp;Key FeaturesConvenient control pod with headphone jack for easy volume and listening controlSometimes you like your music to play softly in the background. Other times, you're in the mood to crank it up. Either way, the control pod puts total volume control at your fingertips. You can also turn the power on and off at the touch of a button. And when you want to listen in privacy, just plug your headphones into the built-in jack and you're good to go.&nbsp;25 watts of powerful, crystal-clear soundYou don't have to choose between &quot;not enough power&quot; and paying for more power than you need. With 25 watts (RMS), you have just the right amount of power to fill the room. And feel free to turn it up. You music will stay perfectly balanced and richly detailed&#8212;even at full volume.Compact subwoofer delivers deep bass in a small spaceYou won't need a lot of room to fill yours with rich, resonant bass. Thanks to the ported, down-firing design, your subwoofer produces the big, deep lows that make music, movies and games more exciting. Yet, it's small enough to easily fit in a tight space, tucked away under a desk or bed. So you get the big sound experience without the clutter.Easy setup, right out of the boxYour new speaker system makes great sound simple from the start. Just plug the satellite speakers into the subwoofer, and the subwoofer into your computer. That's it. In two minutes, you're set for endless hours of listening nirvana.Enhance your listening experience with great Logitech products.Logitech Speaker System Z320Rock the room with small notebook speakers that sound big. 360-degree sound helps project audio evenly in all directions for great sound throughout the room.Ultimate Ears MetroFi 220 Noise Isolating EarphonesMore than just a pretty package, the MetroFi 220 earphones give you clarity, smooth range, and deep bass in a sleek and comfortable design.Ultimate Ears MetroFi 170 Noise Isolating EarphonesWith a lightweight, noise-isolating design and three different-sizes of ear cushions, you can enjoy great comfort and clear sound throughout the day.What's In The BoxPackage Contents2 satellite speakers1 subwooferCable included: power cable and color-corded audio cablesUser documentationSystem RequirementsWorks with:Computer soundcards or audio sources that include a 3.5 mm jackAny major operating systems including Windows, Mac, and Linux"}