{"asin": "B0015R40JE", "related": {"also_bought": ["B000IQEAK2", "B00DQ1FBRM", "B0015R1NE4", "B001AYOOHU", "B0015R1NBW", "B00CQU00EI", "B001CK0Q1K", "B003RZ94MU", "B001G7Q24Y", "B000HU11ZG", "B000MWRJR8", "B0041D0XFO", "B000FIAU8O", "B006QQX3C4", "B001O07WK6", "B008QVXOI0", "B008H5JWL8", "B008RM08X2", "B001AQK8GY", "B000YYYP3K", "B00BCUYPLM", "B008VUTP9I", "B00E1NQ4P2", "B007KJBN78", "B000FI6XGC", "B00142MD62", "B00470WTBW", "B00E1NQ21S", "B0009R96YK", "B004YIB6DO", "B004WLCLQY", "B003UWCI8C", "B000RYBG0M", "B000WY6ZXA", "B00ESY49Y2", "B000FI6YOS", "B001O35F2A", "B00G6M4DT0", "B000FIE3WI", "B0016KY5UE", "B00BCUA8CM", "B00F3QGXMU", "B006JXYGW0", "B002MQYQ2S", "B00HLYUWLA", "B00915FJY2", "B00ABAZ5M2", "B009P3MOF2", "B001P9EWKE", "B000FIAVN8", "B00H9IFSH6", "B000IZGFCE", "B001NOEF5I", "B0030BS30K", "B002GSZ9I2", "B000SPL4A2", "B000HTYZUA", "B000YBEID0", "B000BFNOT8", "B008F9HCHM", "B002UD4TQ6", "B005DVA37Q", "B007KJBZ9E", "B004N62IP2", "B00CPWZV3M", "B004Y69QX8", "B001VNHMOC", "B00KP7UEP4", "B009DKGVCE", "B005551BA8", "B009XJNON4", "B001HBVI2K", "B00DPN03QU", "B000YBGJRS", "B008H5ZORY", "B000ZKATZG", "B003UWI6WO", "B00GQOW71E", "B001SN8IUM", "B0083X4566", "B00M0V1AXI", "B009H9RT3G", "B003YMYX5E", "B003GNTCJI", "B000RYAKHC", "B002KT3XRQ", "B00D9B7OKQ", "B00KX2J1LY", "B003933G06", "B0034IAQM2", "B002NU6J1Y", "B00435IPFK", "B00J08LPFC", "B000FIE49A", "B00H1KUG1A", "B00437TV3I", "B002UQB1YQ", "B00428B1FO"], "also_viewed": ["B00CQU00EI", "B003RZ94MU", "B001G7Q24Y", "B0015R9PZI", "B0030BS30K", "B000HVP5A2", "B00435IPFK", "B00JMG2W3G", "B00DQ1FBRM", "B0015R1N76", "B005DVA57Y", "B000IQEAK2", "B000QSXMME", "B000RYAKHC", "B005CSZY6A", "B00FZ5WRCO", "B00CVIBGYI", "B000AQU8BA", "B00E1NQ6T6", "B00BFG832U", "B000HU11ZG", "B00EDBREHE", "B00GA1YV30", "B00ALRTIZ0", "B0015R1NE4", "B000MWRJR8", "B008ZTLSJA", "B0015R9Q4S", "B000793NY4", "B00JX96CQA", "B00428J5P2", "B008QVXQ1K", "B001GSKKPU", "B00LLETEEM", "B003BYYW38", "B0057GJFW6", "B004KZZNGC", "B003Z7WIQY", "B00CULFR4Q", "B00DSZ624W", "B00GJW2B3W", "B00CQTZVLQ", "B0015R1NBW", "B008QVXOI0", "B00KQSVRF8", "B009VUB0Q8", "B00B13A29E", "B001CK0Q1K", "B00G3IP7VU", "B0041D0XFO", "B00IY2G5CS", "B003WCFJZE", "B0040QH4Z4", "B000AO7JP0", "B00LGNN660", "B006QQX3C4", "B007GB2V5S"], "bought_together": ["B000IQEAK2"]}, "title": "Planet Bike 3034-1 Blinky Superflash .5 Watt LED with 2 Red LED Tail Lights (Black/Clear Case)", "price": 23.75, "salesRank": {"Sports &amp; Outdoors": 21486}, "imUrl": "http://ecx.images-amazon.com/images/I/41JsPAP%2B-1L._SY300_.jpg", "brand": "Planet Bike", "categories": [["Sports & Outdoors", "Cycling", "Lights & Reflectors", "Taillights"]], "description": "Whether you're biking home from school or on a long training ride, the Planet Bike Blinky Superflash rear bicycle light will keep you visible to passing cars, pedestrians, and other cyclists. The Blinky Superflash is equipped with a 1/2-watt Blaze red LED and two eXtreme LEDs, which combine to produce a unique, eye-catching red flash pattern that's visible for up to 1 mile. The light is also built for long-term use, with an ultra-compact vertical design that's weatherproof, lightweight, and durable. Best of all, the Blinky Superflash attaches to almost any bike, with bike mounts and a clip mount included in the package. Offering both flashing red and steady red modes, the Blinky Superflash runs for up to 100 hours on two AAA batteries (included) and carries a limited lifetime warranty.About Planet BikeIn November of 1996, Planet Bike was founded in Madison, Wisconsin. In many ways, Planet Bike began as a social experiment that dedicated itself to doing business in a different way. Instead of being just another company that develops and sells products with profit as its end goal, Planet Bike wanted to help bring about positive change for people, their communities, and the environment.Despite being a simple machine, the people at Planet Bike have always believed that the bicycle has great potential to help improve the world and the lives of the people in it. From the start, they have embraced an alternative corporate purpose which seeks to help get more people on bicycles by making communities friendlier places for the self-propelled. By donating 25% of company profits to causes that promote and facilitate bicycle usage, Planet Bike hopes to make an impact.Social experiments aside, Planet Bike was born from the heart of a cyclist with a goal of making innovative, high quality, and practical bicycle accessories. Simply put, they strive to design and develop the best bicycle products in the world. In the company's short ten year history, they have made important product innovations within the bicycle industry. Advancements include the 4-line computer which is now a standard in the industry and the world's first self-contained HID light. Not bad for a company that ten years ago started as a one man operation. Today, while still a small company, Planet Bike continues to evolve and improve their product line with the goal of always striving to build accessories that make it easier for people to ride their bikes. Since 1996, Planet Bike's financial support of the grassroots bicycle movement has totaled $500,000. By 2010, they have made a goal to donate $1 million to organizations that are dedicated to making America a friendlier place for cyclists."}