{"asin": "B00GPDRFPO", "categories": [["Beauty", "Skin Care", "Body", "Moisturizers", "Oils"]], "description": "Rejuvenate and nourish your skin and hair with Argan AlchemyArgan Oil so pure you can truly call it\"Liquid Gold\".Argan Oil is nature's gift for rejuvenating skin and hair - a beauty oil that has been used by the Berber women of Morocco for centuries. It's also an excellent remedy to cool off and calm inflammation and relieve the symptoms of eczema, acne, and psoriasis.This wonderful oil is rich in essential fatty acids, Vitamin E, and Omega 3-6-9, which are all vital to your skin. Our body \"loves\" this oil and absorbs it quickly, leaving no greasy residue, just a moist and nourished skin. It is also really healthy for your hair, making it stronger, more vibrant, and lustrous.Argan Alchemy is 100% natural and certified organic by USDA and Ecocert, fair-traded, and bottled in the United States.Our premium quality oil is bottled in blue glass, which preserves its high quality by filtering out sunlight.  The elegantly labeled bottle comes in a beautiful box, which makes it a perfect gift or a treat to yourself.It is imported from the Essaouira province of south west Morocco, where it is grown and produced by cooperatives of local Berber women. By purchasing this oil, you are contributing positively to their local economy, their social equality, and to the local eco-system, because more Argan trees get planted.Argan Alchemy is 100% satisfaction guaranteed, and comes with a 30-day money back guarantee.Click the orange\"Add to Cart\"button on the top right of this page to order. If you order 2+ bottles, we will ship the product to you for Free.Experience the magic of Argan Alchemy and let your natural beauty shine.Order Now!", "title": "Argan Oil - 100% Pure Unrefined Natural &amp; Cold Pressed from Morocco - Certified Organic USDA &amp; Ecocert - Multiple uses in Health &amp; Personal Care for Hair, Face, and Dry Skin Treatment such as intense hydrating mask - Many Benefits for Beauty &amp; Body", "price": 29.95, "salesRank": {"Beauty": 161941}, "imUrl": "http://ecx.images-amazon.com/images/I/51dcak4K9gL._SY300_.jpg", "related": {"also_bought": ["B00KHH2VOY", "B00KCFAZTE", "B00JYY56ZW", "B00JL2TURM", "B00GXBEV0A", "B00HZ7IRT2", "B00HHR0SYW", "B00I00AGGA", "B00HBR41LY", "B00FX1QCQC", "B00GNU6MFI", "B00JJVG6HC", "B00G3ZHOLY", "B00C8YCFU4", "B00HJD8NLY", "B00G5WO2R4", "B00GN8XLUE", "B00GDV55B4", "B00IDWP4IA", "B00GFBWWWC", "B00H93NJLS"], "also_viewed": ["B00IT1HKV4", "B00G5WO2R4", "B00H93NJLS", "B00H7NKNE6", "B00GRBVM0S", "B00GMAWI66", "B00GJYQCB2", "B00L5JHZJO", "B00I134Y82", "B00EABZTBU", "B009D6ZQCO", "B00KGCAK4S", "B00GZLTD2Y", "B003XKY57S", "B004S2G4FG", "B00D5KVDOE", "B00D3M0CRS", "B00GGR7YGO", "B00ISGJIQA", "B004Z209HS", "B00GO4KSRG", "B00KD73PBQ", "B00GSMJG36", "B00HCGJGUU", "B00CJGRYMU", "B00I3JIBUG", "B00K7PO996", "B00GJX58PE", "B005H37238", "B00GDTVJ7A", "B00KCFAZTE", "B000VSZDVW", "B001DJ9JJU", "B0069VGCZ6", "B00GCQMSVA", "B00GWF4AS0", "B007WFZ0XI", "B007CDSFKU", "B00C8YCFU4", "B00HL6ZE9S", "B00KDIONMK", "B00H0CVFGO", "B00IP42FBA", "B00KAL5JAU", "B00GXMHVXS", "B00H416L6U", "B00GO4VW3U", "B00GDLXS5E", "B00HHR0SYW", "B00HTD16XQ", "B00IPNEHB2", "B002UJ31HS", "B00FJQFJX8", "B0010ED34U", "B003Y5VCKU", "B00GG3XWAK", "B00II4NXO0", "B00A5C017U"]}}