{"asin": "B001N0DQOS", "categories": [["Electronics", "Computers & Accessories", "Computer Components", "Memory"]], "description": "In today&#xBF;s fast paced world, with the internet, video games, and so much more, it&#xBF;s important to have a fast computer. Rather than spend your money on buying a new PC, why not upgrade the one you have. The easiest way to increase the speed of any PC is by adding some more memory also known as RAM.Why Choose Corsair. Corsair memory sticks known as modules, are designed and tested to ensure 100% Compatibility with today&#xBF;s current PC&#xBF;s and motherboards. Every stick of RAM is qualified to meet Corsair&#xBF;s exact specifications. After a rigid internal test and inspection, every memory module is then shipped individually in anti-static packaging for protection during transport. The result: Guaranteed compatibility with your motherboard, no defective product, quality memory that will keep working and working providing a faster PC for a greater experience for you.Attention to Customer Satisfaction.We understand that you may get confused with today&#xBF;s tech language and may not know which memory module is right for you. With that in mind, we&#xBF;ve created a Memory Configurator that allows you to choose which memory perfectly fits your computer.Ask The RAM GuyIf you need help installing your memory, don&#xBF;t fret, at Corsair we understand that the first timers might need some help. So we&#xBF;ve created a 24/7 online customer support site just for you at www.asktheramguy.com. Here, you can find other people like yourself that are &#xBF;In the know&#xBF; and can help answer questions you may have about installation or anything RAM related.More importantly, Corsair stands behind every module with a Lifetime Warranty. We realize any manufacturer can put a product in a box and hope that it will work, however, at Corsair we guarantee it will work for a lifetime.", "title": "Corsair 2GB (1x2GB) DDR3 1066 MHz (PC3 8500) Laptop Memory (CM3X2GSD1066)", "price": 22.47, "imUrl": "http://ecx.images-amazon.com/images/I/41UggkWwTIL._SX300_.jpg", "brand": "Corsair", "related": {"also_bought": ["B00CRB53CU", "B007CFRF72", "B00CM9K7E6", "B001UOPXVG", "B008JJLW4M", "B002BJ37JO", "B007SDHAJ6", "B00EHBERSE", "B001KB6Z2U", "B00505EZYM", "B00CYSYYU8", "B0050X1OQ6", "B009EMFXGG", "B007L5XW9S", "B007L5M63G", "B004WO8O9Y", "B007ANF6HW", "B007ZWLRSU", "B005T3GRLY", "B00D1GYO4S", "B003KP8VSK", "B0037NYQ7K", "B003DXI288", "B006ICQ3FK", "B00C249QNE", "B000OFXKFI", "B00FCLG65U", "B002YU83YO", "B00BQ8RFAI", "B00E3W15P0", "B004LT8MN8", "B00E3W19MO", "B001342KM8", "B003D3MFHM", "B00E3W1726", "B008JJLZ7G", "B002YUF8ZG", "B008S08D9E", "B0011UPBMA", "B004MU8VCS", "B001CO3EKQ", "B003EE12EC", "B00127OVHI", "B0088PUEPK", "B006ITMC7Q", "B004LR1RPK", "B002BH3Z8E", "B00461G3MS", "B003DZJQQI", "B0014YFC18", "B005DKZTMG"], "bought_together": ["B008JJLW4M"], "buy_after_viewing": ["B001KB6Z2U", "B002BJ37JO", "B0050X1OQ6", "B002ACM5MM"]}}