{"asin": "B005L38XRS", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]], "description": "Monster iSport Immersion In-Ear Headphones with ControlTalkTM &#x2022; Patented SportClips and Pro Sound Isolating Eartips provide a secure, customized fit that won't interfere with eyewear or helmets &#x2022; OmniTipTM swivel nozzle pivots for extra adjustment &#x2022; Tough, durable, UV-protected, and sweatproof for your most aggressive workout-indoors or out &#x2022; Washable-simply toss your headphones in with your laundry and they'll still look and sound brand new &#x2022; Advanced in-ear speaker design delivers true monster-quality sound-adding bass and definition to your favorite music iSport Immersion: The Athlete's Headphone by MonsterFor those serious about their game or their workout, Monster delivers the ultimate high-performance sport headphone. iSport Immersion was designed to meet the specific demands of today's top athletes. It's rugged, sweatproof and totally machine washable. The Pro Sound Isolating Eartips ensure an impenetrable seal blocking out water and leaving in that deep, pulse-pounding sound. Whether you're running, biking, or snowboarding, you'll go further and never lose focus, thanks to iSport's revolutionary in-ear SportClip design. Secure and comfortable, it won't fall out or get in the way of your goggles, glasses or helmet.If music is what moves you, iSport Immersion is the ultimate motivator. Its advanced in-ear speaker and MicroStrand Conductors turn your tunes into pure audio adrenaline. Powerful, clear and full of detail, you're in the zone. Go ahead and dominate. Advanced", "title": "Monster iSport Immersion In-Ear Headphones with ControlTalk, Black (Discontinued by Manufacturer)", "price": 129.99, "imUrl": "http://ecx.images-amazon.com/images/I/41bX3kaQzuL._SY300_.jpg", "brand": "Monster", "related": {"also_bought": ["B003YH9EZ8", "B003TFEHMA", "B006VJQ2OM", "B00BOTPPL0", "B009LU80RK", "B00GYATOS4", "B00FO12XOG", "B00AQQ41C6", "B00AIRUOI8"], "bought_together": ["B003TFEHMA"], "buy_after_viewing": ["B00BOTPPL0", "B004XW2NEW", "B0094R4POC", "B006VJQ2OM"]}}