{"asin": "B002OGMNT4", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Mice"]], "description": "Logitech Wireless Mouse M505 lets you be more productiveLogitech Wireless Mouse M505 helps you get more done, more comfortably, in more places. With 15 months of battery life and laser tracking, you've got the power and precision to be more productive.Different setups. Different locations. One tiny Logitech Unifying receiver.The Logitech Unifying receiver is part of a new family of products that brings you wireless freedom and convenience without the hassle of multiple receivers. It's easy to pair up to six Unifying compatible devices, all to the same tiny receiver that never needs to leave your laptop. Now it's even more convenient to move around and work at the office, at home or on the road.Create The Combo That Works For You.See other products that work with Logitech Unifying receiver.Key Features15 months of battery lifeThis feature virtually eliminates the hassle of changing batteries. The On/Off switch saves power. A battery-indicator light eliminates surprises. (Battery life may vary based on user and computing conditions.)Track with laser precisionThe laser tracking delivers smooth, responsive, precise cursor control on surfaces that cause problems for optical mice, such as polished or wood-grain tables.&#xA0;Plug it. Forget it. Add to it.This mouse includes the Logitech Unifying receiver. The tiny wireless receiver stays in your notebook, so there's no need to unplug it when you move around. Plus, you can easily add a compatible Unifying keyboard or number pad&#x2014;without the hassle of multiple USB receivers.Designed to be comfortableThe ergonomically designed shape with soft rubber grip conforms to your hand to be naturally comfortable, yet is small enough to easily take with you.Advanced 2.4 GHz wireless connectivityLogitech Advanced 2.4 GHz wireless connectivity offers you the reliability of a cord, plus fast data transmission and virtually no delays or dropouts.Choose The Right Logitech Wireless Mouse For YouGoodBetterBestV220M505Anywhere Mouse MXLX6LX8Performance Mouse MXWhat to look forPortable MiceFull-Sized MiceConnection StrengthThe higher the signal strength, the more reliable your connection will be. Especially important in busy wireless environments like airports.27 MHz2.4 GHz2.4 GHz27 MHz27 MHz2.4 GHzTracking QualityLook for smooth, precise cursor control. The higher the quality, the easier it is to navigate documents and web pages. The best also work on more surfaces, including glass.Also works on glassAlso works on glassPower ManagementStay more productive and eliminate hassles with longer periods between battery changes or a rechargeable mouse.1 AA battery2 AA batteries2 AA batteries2 AA batteries2 AA batteriesRechargeableWireless ReceiverThe receiver stays in your computer for cordless mouse control. The smaller the receiver (from standard to nano size), the more convenient it is. The Unifying receiver also lets you add compatible devices like a wireless keyboard.&#xA0;Unifying receiver for up to 6 Unifying compatible devicesUnifying receiver for up to 6 Unifying compatible devicesUnifying receiver for up to 6 Unifying compatible devicesScrolling PerformanceScroll through long documents and web pages without having to drag the scroll bar. Performance ranges from fast to hyper-fast.Create The Combo That Works For YouLogitech has a range of products that you can connect via a single, tiny receiver you leave plugged in to your notebook. Mix. Match. Unify. Now you can create your perfect laptop workstation, wherever you work.", "title": "Logitech Wireless Mouse M505 (Red)", "price": 79.95, "imUrl": "http://ecx.images-amazon.com/images/I/41OZCZOfwJL._SX300_.jpg", "brand": "Logitech", "related": {"also_bought": ["B005KSAOKI", "B005KSAJXK", "B005KSAHZU", "B005KSAG3S", "B005KSAO6C", "B007PJ4PN2", "B004HIN8N2", "B004MF11MU", "B004N627KS", "B003VAGXWK", "B003NR57BY", "B003VANO7C", "B005HQ5138"], "bought_together": ["B007PJ4PN2"], "buy_after_viewing": ["B003NR57BY", "B005KSAOKI", "B005KSAHZU", "B005KSAJXK"]}}