{"asin": "B000261N6M", "description": "Forget thinking outside the box--now you can stop worrying about the box altogether. Coby's DVD-224 is about the size of a hardcover book, so whether you're ferrying the player between the kitchen and the bedroom or hooking it up for periodic use by the kids, the DVD-224's small size permits enjoyment of DVD programs and music CDs in just about any room you want. While not portable in the traditional sense--the unit has no screen and requires AC power--the DVD-224 is much easier to move around, set-up, and use than a traditional component DVD player.It handles not only your DVD-Videos (both NTSC- and PAL-formatted discs, depending on your TV), but it plays your music, too--everything from standard CDs to home-burned CD-Rs, CD-RWs, and MP3-encoded CDs. Further, you can load a disc brimming with digital photos for custom slide shows in the comfort of your home theater.An onscreen display simplifies setup and operation, and the unit comes with a compact, full-function remote control. Other features include parental controls (with PIN lock), frame-by-frame slow motion, picture zoom (2x, 4x), and multiple-angle viewing (with applicable discs).Like to travel? The DVD-224 won't hog space in your bag, and an auto-switching universal power supply handles inputs from AC 110 to 220 volts (50/60 Hz) for use in most countries. Accordingly, the unit's onscreen display offers a choice of 5 setup languages: English, Spanish, French, German, and Italian.A composite-video output ensures compatibility with nearly any television and many newer computer monitors. Both Dolby Digital and DTS 5.1-channel surround-sound signals can be routed through the player's digital-audio outputs (choose from either optical or coaxial) for direct connection to a full-featured audio/video receiver. A set of standard left/right RCA analog outputs simplifies hookup with traditional integrated amplifiers and most televisions.What's in the BoxDVD player, remote control, remote batteries, a user's manual, and a stereo analog audio interconnect/composite-video cable.", "title": "Coby DVD-224 Compact DVD Player (Black)", "price": 33.0, "imUrl": "http://ecx.images-amazon.com/images/I/31LZY%2B4w5OL._SY300_.jpg", "related": {"also_viewed": ["B007F9XHBI", "B007S71NZO", "B00A71YOQI", "B007BYLO4E", "B003EX0BVS", "B007BGF196"], "buy_after_viewing": ["B007F9XHBI", "B007F9XHAY", "B007F9XHAY", "B001NFOZ4I", "B007WRPCN4"]}, "categories": [["Electronics", "Television & Video", "DVD Players & Recorders", "DVD Players"]]}