{"asin": "B0000ZUGZ4", "description": "F.E.A.R. (First Encounter Assault Recon) is an intense combat experience with rich atmosphere and a deeply intense paranormal storyline presented entirely in first person. Be the hero in your own spine-tingling epic of action, tension, and terror... and discover the true meaning of F.E.A.R.An unidentified paramilitary force infiltrates a multi-billion dollar aerospace compound, taking hostages but issuing no demands. A Special Forces team is sent in by the government to contain the situation, but contact is severed as an eerie signal interrupts radio communications. When the interference subsides moments later, the team has been obliterated. Live footage of the massacre shows an inexplicable wave of destruction tearing the soldiers apart before they can even react.See more imagesIn light of the desperate situation the F.E.A.R. team is assembled. As part of this elite classified strike team created to deal with the most unusual and shocking of threats your mission is simple: Eliminate the intruders at any cost. Determine the origin of the signal. And contain this crisis before it spirals out of control.Hyper-stylized combat for breathtaking cinematic quality actionGripping supernatural storyline for spine-tingling intensity of playMulti-player action with multiple gameplay modes and all single player capabilitiesAdvanced graphics and physics for visceral movie-like experienceEnemies with special abilities and A.I. so intuitive it&#146;s like battling living, breathing players", "price": 48.46, "imUrl": "http://ecx.images-amazon.com/images/I/51HD94VPVCL._SY300_.jpg", "related": {"also_bought": ["B0016N4A7E", "B003GSZAOY", "B000VSHMC0", "B000GC5V1U", "B0019C4MU2", "B001Q96ZNU", "B002BS47YE", "B003ICGL7I", "B00006C2HA", "B003ZULWQI", "B0000A1VER", "B001D7798A", "B0001X5YN4", "B007BYWJ8Y", "B005C2D2H4", "B00009TW6R", "B000BHQZAQ", "B004FZ9822", "B002I0HKRQ", "B0047THYWC", "B0016BVYAM", "B002BWONOY", "B0050SZ0SY", "B001C4VU5C", "B0012LGHZI", "B002V14VOC", "B00163LW7A", "B003TIVSM4", "B0009Q1IE2", "B001VJ4DHK", "B001LKM0EW", "B0079NGSDO", "B002I0HJ68", "B000P297F2", "B001AH8YSW", "B000HMQE8S", "B0002MQG36", "B0007IQGDK", "B001EM7TUC", "B002KAKSGO", "B00005BIQK", "B0000TA6IW", "B001EAQIT2", "B00004Z0FM", "B002IYR0KO"], "bought_together": ["B0016N4A7E", "B003GSZAOY"], "buy_after_viewing": ["B003GSZAOY", "B0016N4A7E", "B003ZULWQI", "B000HKGIOA"]}, "salesRank": {"Video Games": 23761}, "categories": [["Video Games", "PC", "Games"]]}