{"asin": "B005I6DUYE", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "ELPH 310A Masterpiece of Design and TechnologyUltra-Slim, Elegant DesignAt a slim 0.87 inches, the PowerShot ELPH 310 HS digital camera is super-thin, making it a perfect choice for those who desire a small camera that fits easily in a pocket. With five cool metallic colors to choose from (Purple, Blue, Pink, Green and Silver), there is a PowerShot ELPH 310 HS that fits your style.8x Optical Zoom with 28mm Wide-Angle LensDespite its slim profile, the PowerShot ELPH 310 HS houses a powerful Genuine Canon 8x Optical Zoom Lens that delivers outstanding optical performance and versatility. The zoom starts at 28mm wide-angle and extends to 224mm telephoto (35mm equivalent), covering a wide and highly useful range. The telephoto reach gives you the freedom to capture subjects from afar, while the 28mm wide-angle makes it easy to shoot sweeping landscapes, large groups of people and tall buildings.Optical Image StabilizerHandheld shooting can often lead to camera shake, making photos and videos blurry. Canon's Optical Image Stabilizer is a sophisticated system that uses lens-shift technology to correct for unwanted camera movement. It makes handheld photography more practical in more shooting situations, providing excellent image quality in many difficult situations: outdoors at dusk, inside without a flash, and even at the telephoto end of the zoom range without a tripod. For photos, it enables shooting at slower shutter speeds, accommodating more low-light shooting situations than ever before without having to boost ISO sensitivity. With camera shake and vibration reduced, you get a sharper, steadier image. And because it is an optical system, there is none of the image degradation typical with electronic image stabilizers.Experience the PowerCanon HS SYSTEMThe Canon HS SYSTEM lets you take bright, clear photos in an even wider range of shooting situations. Beautiful low-light shots are possible with minimal noise and maximum detail in highlight and shadow areas. The system is the result of two technologies brought together in PowerShot cameras: a high-sensitivity imaging sensor, which is able to capture more light; and the DIGIC Image Processor, which actively reduces noise with high-speed image processing. The 12.1 Megapixel CMOS sensor in the PowerShot ELPH 310 HS incorporates advanced light reception technology that enhances sensitivity. The DIGIC 4 Image Processor provides a major boost in noise reduction, expanding the usable ISO range to an amazing high of 3200. The Canon HS SYSTEM takes the frustration out of low-light shooting, delivering clear, blur-free images.Canon DIGIC 4 Image ProcessorCanon DIGIC Image Processors have set the standard for functionality and performance since their groundbreaking introduction in 1999. With each successive generation, DIGIC processors have brought elevated performance and powerful new features to PowerShot digital cameras. The DIGIC 4 processor has ushered in a new level of picture quality and accelerated processing, making possible features such as high-speed continuous shooting, Full HD video and Face Detection Self-timer. New, more powerful noise reduction algorithms also provide improved low-light capture.Memorable Moments in Spectacular Full HDCanon Full HD Video AdvantageIn addition to the Canon HS SYSTEM, the combination of the advanced CMOS sensor and DIGIC 4 Image Processor in the PowerShot ELPH 310 HS makes it possible to shoot crisp, clear high definition video. Imagine the fun and excitement of being able to shoot spectacular 1080p Full HD video with stereo sound that you can later watch on your HDTV or download to your computer to share with family and friends. In addition to being able to shoot Full HD 1080p video at 24* frames per second, the PowerShot ELPH 310 HS can also shoot 720p HD video at 30** frames per second. *Actual frame rate is 23.976 fps.** Actual frame rate is 29.97 fps.HDTV Playback via HDMI with CEC SupportIt's easy to enjoy and share the videos you shoot with the PowerShot ELPH 310 HS. Simply connect its HDMI terminal to your HDTV using an HDMI cable. And because the PowerShot ELPH 310 HS supports HDMI-CEC technology, you&iacute;ll be able to control the playback of your images and videos on any CEC-enabled HDTV using the TV&iacute;s remote control. (CEC &ntilde; Consumer Electronic Control &ntilde; is part of the HDMI specification, enabling components in a system to communicate with one another.)", "title": "Canon PowerShot ELPH 310 HS 12.1 MP CMOS Digital Camera with 8x Wide-Angle Optical Zoom Lens and Full 1080p HD Video (Blue)", "price": 179.0, "salesRank": {"Camera &amp; Photo": 6942}, "imUrl": "http://ecx.images-amazon.com/images/I/51ZAahkJWyL._SY300_.jpg", "related": {"also_bought": ["B00507CH5E", "B003AKGENE", "B0037T6O6A", "B005HNF01O", "B003VNKNEQ", "B005O3YXRE", "B004ZMBV9S", "B006JO1YW4", "B00449BNDG", "B000EVLS4C", "B005UP4KRO", "B005P188B2", "B003VNKNF0", "B004SHES72"], "buy_after_viewing": ["B003VNKNF0", "B003VNKNEQ", "B00B5HE3UU", "B005HNF01O"]}}