{"asin": "B0055R0YK4", "description": "The Belkin ScreenCast TV Adapter for Intel Wireless Display connects your laptop to your TV--wirelessly, letting you stream HD videos, share photos, and surf the Web on a big screen with big sound. Designed for laptops that have Intel Wireless Display, ScreenCast is easy to set up. Simply plug ScreenCast into an HDMI port on your HDTV using the included cable, and you're ready to enjoy online content in full-HD 1080p resolution and Dolby 5.1 surround sound.ScreenCast TV Adapter for Intel Wireless DisplayAt a Glance:Wirelessly transmits laptop content to your TV and home speakersStreams media in full HD 1080p resolution and Dolby 5.1 surround soundLets you enjoy Blu-ray movies, Internet videos, online photo galleries, and Web sites on a big screenInstalls easily and quickly on any laptop featuring Intel Wireless DisplayBacked by a one-year limited warrantyShare and enjoy your favorite photos and videos on a larger screen.View larger.HDMI provides full-HD 1080p video quality.View larger.Wirelessly stream content from a laptop to your TV and speakers.View larger.Connect Your Laptop to Your TV--WirelesslyWith Belkin ScreenCast, the days of watching online media on a small laptop screen are over. ScreenCast wirelessly connects any laptop with Intel Wireless Display to your home entertainment system, allowing you to enjoy everything your laptop has to offer without having to compromise on video/audio quality.Easy to Set Up, Easy to UseTo wirelessly stream media from your laptop, simply connect ScreenCast to your TV with the included HDMI cable, then launch Intel Wireless Display on your laptop. The software will automatically detect ScreenCast and establish a connection between your laptop and TV. From there, your laptop's screen will appear on your TV, allowing you to stream HD Internet content to your HDTV from your favorite Web sites, like Netflix, YouTube, and Pandora. You can also share photos and surf the Web--all on a screen that's big enough for the whole family to see.Enjoy All Your Laptop Content on a Big Screen with Big SoundWith Belkin ScreenCast, media from your hard drive, home network, or the Internet seamlessly integrates with your home entertainment system. Insert a Blu-ray disc into your laptop's disc drive, then watch it on your HDTV. Or, enjoy your iTunes library on your home stereo speakers--not your tiny computer speakers--for incredible sound.ScreenCast streams media in full-HD 1080p resolution with Dolby 5.1 surround sound, transforming your laptop into a source for endless state-of-the-art home theater entertainment*. Just sit back, relax, and enjoy online content from the comfort of your couch.Requires Intel Wireless DisplayScreenCast requires a laptop with Windows 7 and Intel Wireless Display powered by select Intel Core processors. Additionally, an HDTV is required for 1080p (HD) resolution and 5.1 surround sound. ScreenCast includes HDTV and HDMI ports for optimal output--an RCA output is also included for standard-definition televisions.The Belkin ScreenCast TV Adapter for Intel Wireless Display is backed by a one-year limited warranty.What's in the BoxScreenCast TV Adapter for Intel Wireless Display, quick-install guide, user manual, power adapter, and HDMI cable.*Actual output may depend on audio/video equipment and mix of wireless products used.", "title": "Belkin ScreenCast TV Adapter for Intel Wireless Display (Discontinued by Manufacturer)", "price": 69.0, "imUrl": "http://ecx.images-amazon.com/images/I/31tkaL7iDFL._SX300_.jpg", "related": {"also_bought": ["B0053XG256", "B004SBEVSY", "B007QXLIU0", "B00904JILO", "B0098O9TRO", "B009Z8T3K6", "B009TOUBY8", "B005O88CUS", "B007QXLIWI", "B00CZ6WAEQ", "B0033WWAF0", "B009TOY1V2", "B005YQXPWK", "B006WAPM78", "B005GU0DXS", "B009TOXVD6", "B003L1ZYYM", "B006ZGWJU2", "B0093LINVK", "B0031SEMBQ", "B00310EEO4", "B0002L5R78", "B007I5JT4S", "B0052SCU8U", "B008R6OPQE", "B008OEHV6U", "B001TH7T2U"], "bought_together": ["B003L1ZYYM"], "buy_after_viewing": ["B00904JILO", "B00DR0PDNE", "B00CZ6WAEQ", "B0089VO7MY"]}, "categories": [["Electronics", "Accessories & Supplies", "Batteries, Chargers & Accessories", "AC Adapters"]]}