{"asin": "B00176TEGM", "description": "Philips SHE9850 In-Ear Headphones Deliver Advanced AcousticsAn improvement in both sound and comfort, Philips SHE9850 Advanced Acoustics Headphones evolved from extensive research into the music listening experience. The result is sound so pure, so full and rich you can hear every subtle nuance. These in-ear headphones fit perfectly, so when you put them in, you won&rsquo;t want to take them out.Enjoy Quality SoundHigh Definition TransducerThe motor of the receiver comprises of a coil, a metal u-shaped armature, a pair of permanent magnets, as well as a drive rod and diaphragm.  Electromagnetic currents alter the armature&rsquo;s polarity up or down, moving the drive rod and diaphragm to generate sound output.  The receiver components have been fine-tuned to produce greater output at lower frequencies while boosting the peaks at higher frequencies.  The result is crisp, detailed and transparent audio with extended precision highs.Precise Acoustic TuningDesigned for a high quality listening experience, these headphones have been meticulously tuned by Philips iLab to deliver professional-grade acoustics with extended precision highs.  The resulting sound is transparent, crisp and detailed.Angled Acoustic DesignDerived from a thorough understanding of the anatomy of a human ear canal, the Angled Acoustic design adjusts the angle of the speaker tube and ear bud to individual ear canal shapes.  Besides delivering sound directly to your ears, it also createds a perfect seal from ambient noise that enables you to listen to your music at lower volum levels.Ultimate Wearing ComfortEar Fitting DesignThe design superiority of a slight 15-degree tilt in the Angled Acoustic model based on the anatomy of the human ear achieves a natural fit and supreme comfort.Three-Size Ultra-Soft Silicon CapAvailable in three different sizes - small, medium and large - the interchangeable ear caps ensure a personalized fit to each individual user.  They are also made from ultra-soft silicon the provide the utmost comfort for prolonged listening.Tight Sealing Foam SleevesMade from slow recovery foam, this pair of sleeves is a comfortable alternative to the rubber ear caps.  A snug seal is created by these foam sleeves when they are compressed between the fingers before being inserted into the user's ear canal.  After the earphone is held in place for a few seconds, the slow-recovery foam expands to create a secure and tight fit.Premium Metal HousingHoused in superior metal, these earphones are shielded from unnecessary vibration for accurate sound transmission, resulting in smooth bass response and clear mid-to-high range tones.Always Ready to GoSleek Metal Carrying CaseMade of high-quality metal witha  luxurious touch, the compact carrying case incorporates a cable bank which provdes an easy solution for neat cable winding and headphone storage.  It even includes a storage compartment for the foam sleeves.  The hard case exterior also provides additional protection for teh headphones while not in use.Symmetrical CablesThe SHE9850 headphones have symmetrical cables to prevent them from tangling, and provide for easy listening.Flexi-Grip DesignThe soft flexigrip material that the body of the hadphones is sheathed in, enhances its performance and extends its durability.  It protects the cable connection from damage that otherwise could occur due to repeated bending of the headphone body from frequent contact with your fingertips when being put on and removed.Technical SpecificationsImpedance: 12 ohmSensitivity: 115dBMaximum power input: 3mWFrequency range: 20Hz-20kHz", "title": "Philips SHE9850 In-Ear Headphones with Advanced Acoustics", "price": 8.41, "imUrl": "http://ecx.images-amazon.com/images/I/31zhwfGh8EL._SX300_.jpg", "related": {"also_viewed": ["B006K55662", "B001V9LPT4", "B004PNZFZ8", "B000XPG2QI", "B00KZIGZCY", "B004HCBX44"], "buy_after_viewing": ["B003EM8008", "B004JU0E3A", "B004S7Q8CA", "B006K55662"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]]}