{"asin": "B0017HIIWW", "description": "Transformed and unleashed, Sonic races to save the world...and himself. Sonic the Hedgehog is on an adventure unlike any other. Powered by an all-new engine,Sonic Unleashedblends classicSonicgameplay with a variety of in-game perspectives to create an entirely new and unique gaming experience. Merging blistering 2D action with meticulously rendered 3D environments, players race through intriguing locations across the globe as Sonic to save a chaotic world.The other side of SonicSonic and his alter ego Werehog.View larger.Collect rings for Ring Energy.View larger.Swing into action with Werehog.View larger.A NewSonica New StoryOn a quest for world domination Sonic nemesis Dr. Eggman has managed to steal the chaos emeralds once again and this time drained them of their power. As a result not only has the Earth split into distinct sections, so has Sonic. Now he is two beings. During the day he is the usual speed-addicted hedgehog players will remember, but at night he becomes Sonic the Werehog. In either form it is the player's ultimate goal to find the missing chaos emeralds and return them to their proper place in order to set the world and Sonic himself, back the way he should be.Gameplay: The Two Sides of SonicLike nearly allSonicgames,Sonic Unleashedis platform-based. The game combines the feel of 2D side-scrolling that fans of theSonicseries love, with sharp 3D graphics, and throws in an over the back third-person perspective reminiscent of FPS gameplay for good measure. And just as in earlier games, as players race through and explore the expansive world before them, using auto lock to hone in on enemies and areas of interest, they will rely on the power they gain from the rings they collect for a variety of things, but with the new twist of Sonic's split personality, things are a little bit different.Playing during the day, as you race across the world in the form of Sonic, speed is the main goal. Collecting rings fills you with 'Ring Energy,' which not only provides extra life, but also the advantage of 'Sonic Boost.' With this players can travel at speeds that approximate 300 MPH. In addition,Sonic Unleashedintroduces two new features: the 'Speed Drift' and the 'Quick Step'. Speed Drifting is similar to drifting in racing games, allowing players to slide around corners at high speeds, while Quick Stepping is a sidestepping maneuver allowing Sonic to avoid enemies with quick steps to either side. Both keep you moving as fast as possible, so you can get as many rings as possible, which again keeps you moving as fast as possible.As night falls and Sonic assumes his Werehog form the rings provide a different kind of power more suited to his more menacing appearance. Much slower, but also much more powerful, the Werehog relies on the rings to provide life as well as strength to shield himself from the attacks of enemies. This is necessary because Werehog gameplay, although based in platforming, incorporates significant levels of combat as well. Red orbs gathered as enemies are defeated allow the player to unlock additional combo moves that will supplement the hack and slash and arm stretching abilities that the Werehog always possesses. Whether Hedgehog or Werehog, no matter which form players prefer they will get ample opportunity to explore the two sides of Sonic since each area in the game contains both night and day segments where each form must be played.Key Game Features:Sonic&rsquo;s World Transformed- Sonic maintains his high-speed abilities during the day, but at night he is transformed into a mysterious dark form with incredible never-before-seen abilities including 3D-action brawling and amazing agility.Tight Navigation and Speed Control- Players accelerate to super speed with &lsquo;Sonic Boost&rsquo; by collecting rings to increase Sonic&rsquo;s &lsquo;Ring Energy.&rsquo; Using &lsquo;Quick Step,&rsquo; players will quickly move left or right to avoid obstacles instantly. Additionally, &lsquo;Speed Drift&rsquo; allows players to rocket through turns without slowing down.Powerful New Engine and Cinematic Graphics- With its new modified game engine,Sonic Unleashedenhances the classic 2D perspective with mind-blowing 3D stages. Other technology capabilities include global illumination, grid computing, continuous data streaming and an intricate path finding system.Enhanced and Expanded Environments- Many unique and fascinating continents offer the player an opportunity to save the world in a dynamic, high-speed experience. In addition to exploring exciting unlockable areas, players dash through up to nine locations resembling real-life destinations including the Great Wall of China, Arctic Pole glaciers and many more.Whether it's the updated graphics that retain the side-scrolling feel of classic games in theSonicfranchise, an expansive world to race through and explore or the multiple and new ways to play,Sonic Unleashedoffers something for players of any age or level of ability.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51fsbGJKQyL._SY300_.jpg", "related": {"also_bought": ["B000IONGVI", "B001D8PFIK", "B002I0IIPY", "B000YUYNTK", "B002BH3N2W", "B00DWXV074", "B003ZHMMEM", "B005FYJA52", "B0048WY6RO", "B004XV9EWW", "B002BRZ9G0", "B00DWXV2EU", "B00D41GCVS", "B002BSA388", "B00292T6HA", "B004M8K9AW", "B005EYRAUK", "B004VMX9YW", "B0050SVFB0", "B001SIFNXW", "B006ZPAYB4", "B000PTYKSY", "B002WDL53O", "B000FQ9QVI", "B00DR6GQ2K", "B000FQ9R4E", "B008R2A66Q", "B007U59CMK", "B003T8BWR0", "B0045ZV12W", "B001GIUWX0", "B000ZKBJYG", "B00D41GCUY", "B00KX7672U", "B008J279DC", "B002I0GEXM", "B005J7EJP6", "B000R3BNE2", "B00A6YSE1W", "B004IK24MU", "B0009PM8V0", "B0026FCARI", "B00F4FF8TE", "B000XUPBBU", "B00006LU9B", "B00E20STCK", "B00503E9UO", "B0028WR0WO", "B003ZCH7DI", "B003YKVGLK", "B00CZKY4NC", "B007MM9E42", "B004H0LCH4", "B0009SQFHK", "B001PO2BJI", "B0000VSH4U", "1879794411", "B000SH3XEA", "B0051873RE", "B007M4L6C8", "B006RD2DMW", "B0051OLIPQ", "B001FEO74U", "B0051OLJPU", "B007MHE9PG", "B008Z1SC42", "B008L1PYGK", "B003OPX7OO", "B003S2SQCQ", "B005NC5IFM", "B000INV44U", "B000R3BNHE", "B00GZY7D0U", "B008DNUXA8", "B000RHZJJS", "B003ESHRVA", "B004WLRQMI", "B001AWFIW2", "B00149IL9I", "B008BT2FEG", "B009D0ZB8O", "B0094X1ZXU", "B002BSC4RQ", "B0030GBU8W", "B002NGDR0O", "B00008URUB", "B004WLRR0E", "B002672Z80", "B001C58T46", "B007YZ5QP8", "B002EE5SAC", "B003TEI3E4", "B004LM36HW", "B0026IUSXI", "B007VIYQVI", "B00113T0VA", "B00BJ642BC", "B003LDKIQ4"], "bought_together": ["B001D8PFIK", "B000IONGVI"], "buy_after_viewing": ["B002I0IIPY", "B002BH3N2W", "B001D8PFIK", "B003ZHMMEM"]}, "salesRank": {"Video Games": 775}, "categories": [["Video Games", "Kids & Family", "Wii", "Games"], ["Video Games", "Wii", "Games"]]}