{"asin": "B00413PEZS", "categories": [["Electronics", "Computers & Accessories"]], "description": "The next generation of eReaders. \"Cruz\" through books, magazines, and newspapers on this revolutionary device's crystal-clear, full-color, 7-inch display. Use the built-in Borders bookstore app to download and read over 2 million eBooks in a light and convenient package. At just under one pound, the 0.6-inch-thick Cruz Reader goes everywhere you do and fits perfectly in one hand. Staying up-to-date with email and social networks is just a Wi-Fi hotspot away, thanks to the Cruz Reader's 802.11 b/g Wi-Fi and full browser support. You can even load your Cruz Reader up with all your favorite music and movies, using the included 4GB SD card.An affordable touchscreen color eReader.USB and SD slots for memory expansion.Download remarkable content, astonishing applications, and amazing games.Full-Color Touchscreen DisplayThe Cruz Reader features a seven-inch (diagonal) touchscreen with 800 x 600 pixel resolution, ideal for viewing eBooks and eMagazines, Web pages, and movies. The built-in, tilt-activated accelerometer will flip the page display from portrait to landscape and back when you turn the device.Android-Based OSThe Cruz Reader and Cruz Tablet are built using the Android OS, an easy-to-use, powerful, and reliable operating system from the team at Google. Designed for touchscreen devices like the Cruz, Android helps you easily manage your programs with a vastly intuitive interface.eBook ReaderPack dozens of books for a weeklong getaway without weighing down your suitcase. The Cruz Reader offers access to over 2 million eBooks via the included Borders eBook library portal application. Velocity's own Cruz Market also provides eBook content, and is a one-stop shop for downloading apps and videos from a broad array of content and providers, all in one market. Support is provided for ePub, PDF, TXT, PDB, and HTML reader files.Enjoy Your Other MediaBring your favorite movies on a plane without the hassle of a portable DVD player or laptop, with support for MPEG-4 and H.264 video formats. Listen to your favorite tunes in MP3, WMA, AAC, or WAV formats. Or share pictures from your last vacation with JPEG, GIF, PNG, and BMP support.Stay Connected with 802.11 b/g Wi-Fi and Full Browser SupportPut the power of the Internet right in your hands. Stay connected with email and social networks even while on the road. Download remarkable content, astonishing applications, and amazing games.Slim and StylishVelocity has designed and refined the Cruz Reader to be as stylish as it is functional. Get ready to attract attention with the sleek, slim, and stylish Cruz Reader.Add Storage CapacityThe Cruz Reader offers 256 MB internal storage, expandable via both USB and SD card slots. A 4 GB micro SD card is included with the device (pre-installed)Built-in ApplicationsThe Cruz Reader includes a built-in dictionary, notepad, calendar, alarm clock, contacts, games, and other useful apps.User-Replaceable BatteryAn extended life, user-replaceable lithium-ion battery is included, offering up to 10+ hours of life on a single charge (24+ hours on standby).Product SupportEach Cruz is backed by Velocity Micro's expert US-based support, for extra peace of mind.What's in the BoxCruz Reader, docking station (Not Powered), AC adapter, carrying pouch, user's guide, and 4 GB SD card (pre-installed).", "title": "Velocity Micro Cruz Reader 7&quot; Touch/Android/Wi-Fi", "price": 89.99, "salesRank": {"Electronics": 43829}, "imUrl": "http://ecx.images-amazon.com/images/I/41pbMc671ML._SY300_.jpg", "related": {"also_bought": ["B002BBJMO6", "B004OB0EBQ", "B003D8GAA0", "B00AAZ2DIM", "B005409V9M", "B00AQNUQ0K", "B005SM1144"], "bought_together": ["B002BBJMO6", "B004OB0EBQ"], "buy_after_viewing": ["B009W49ALA", "B004OB0EBQ", "B00B8A43CC", "B00CN3UJ3K"]}}