{"asin": "B0028ZNX68", "description": "Although theGuitar Heroseries has only been around since 2005, the gobs of exposure--or  perhaps over exposure--that it has received has fueled an understandable amount of skepticism among many gamers regarding the future of the overall franchise. After all, once a music game has conquered single player, two-player, artist-specific, full band multiplayer and handheld action, where does it go? Answer: into the DJ booth withDJ Hero.Recently I was able to spend some time with a Xbox 360 demo of the game that has been making the rounds, and here is what I came away with..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; }  ul.indent { list-style: inside disc; text-indent: -15px; }  table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; }  td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Challenge yourself with realistic DJ gameplay mechanics and multiple point multipliers.View          larger.Put your old Guitar Hero axe to work in DJ and Guitar mode.View          larger.Go head-to-head against a friend in DJ vs. DJ mode.View          larger.Action inDJ Herorevolves around aGuitar Herostyle note highway which streams color coated prompts toward the player, in the role of DJ, who input these via the bundled game-specific wireless turntable/mixer controller. The turntable portion of the controller is made up of a realistic platter that spins all the way around in both directions when pushed by the player and has familiar green, red and blue buttons attached on top. The mixer half has a sliding three-position fader bar, a button used to activate star power like \"Euphoria\" gameplay sections which temporarily double point multipliers, an effects knob and a hidden control panel containing your console's standard navigational buttons. Gameplay takes you through pre matched, two-jam tracks, with the green and blue buttons oriented on the left and right edges of the note highway and on the platter representing these, and the red button in the middle providing  a spot to add samples, which can be changed at various times in the game with the effects knob. Players must perform three main types of DJ actions when prompted by the note highway: taps, which are beat matching actions requiring the pushing of buttons on the platter;  fader bar moves indicating either a selection of one of the two tracks during the jam, or a mix of the two; and scratching, which entails selecting one of the two tracks on the platter and moving the turntable quickly up and down. In addition, players can activate Euphoria strategically, as success throughout sections of a track fills the Euphoria meter at the left, and shoot for the additional bonus of a Rewind, given for perfection in certain sections, and allowing the player to replay that same section again for additional points.It's interesting how this latest release in the series parallels the historical deconstructive trend  in actual pop music, which saw Hip-hop, Electronica, House, and other musical genres rise through the use of DJ sampling and mixing techniques, but does this mean thatDJ Herowill enjoy as much success and be as good a play experience as some of theHerogames that came before it? Only time will tell, but after a few hours breaking it down on the DJ deck myself, it seems to me that the game has a major thing going against it, and an equally important positive thing going for it that together will probably decide this for most players. The negative is that the controller used is a bit more difficult to operate than any used in earlier games, except perhaps the drums ofGuitar Hero World Tour, while the positive is that the overall gameplay is as fun and infectious as any seen in the series.To be clear, the controller issues alluded to are by no means a deal breaker. More than anything else, what the vast majority of players will be challenged by in theDJ Herocontroller is their unfamiliarity with a DJ deck. As popular as DJ influenced music is in reality, not too many fans per capita have had hands-on experience with the tools of the trade, unlike the legions ofGuitar Herofans, purchasing in their millions, who are at least somewhat familiar with how a guitar, drum and microphone work. Another inconvenience related to the controller is its fairly cramped layout, with both sections residing right next to each other and no apparent way to create space between the two pieces without disconnecting them. This is enhanced by the fact that in many cases the controller may be more easily worked from a high platform in front of the standing player, potentially making this lack of space even more of a problem. But as with any new controller type, muscle memory will kick in with practice and players become more comfortable with the basic DJ mechanics of the game. There are also some simple hints doled out by the in-game tutorials that should be heeded, like when scratching make sure to let go at the end of each scratch, and anchor your hand to the turntable deck with your thumb to avoid spinning the platter too wildly. Also, the two pieces of the controller can be swapped to allow for left-handed play, and thankfullyDJ Hero's development team recognized that discouraged players are not a good thing and did away with the familiarGuitar Heroscenario of AI audiences booing a player off the stage. If you are screwing up they will still let you know, but at least players will always get the experience of finishing. At the end of each set you are rated at 1-5 stars, where the more stars you get the more tracks are unlocked and DJ gear is made available to you. The gradual organization of the game's four play settings also help you build confidence by introducing more advanced skills as you progress. In Easy, players primarily use tapping and a simplified form of scratching. The Medium setting adds fader bar functionality. Play on the Hard level requires precise directional scratching, where you must scratch in the same direction as the note highway. The assumption is that Expert level bumps things up even farther, although this level was not available with the demo played.Finally, as part of the fun built into the game, players can expect various ways to play and experience the game. These include a variety of gameplay modes including single player, a head-to-head multiplayer DJ vs. DJ mode where two players work their way through the same track for the best possible point total, the multiplayer Guitar and DJ mode which is compatible with allGuitar Heroguitars made for the same platform, and Party Mode where scoring is turned off and you can just listen to the 80+ unique mixes by big name DJs included in the game. And as with all games in theGuitar Heroseries players can expect some pretty deep character customization options to be made available as their skills rise.Taken together does all this equate to a quality music gameplay experience? Well, what I've seen is pretty solid, so if you are a fan of bothGuitar Herotype gameplay and DJ music and culture, I'd say you almost certainly will not be disappointed. Also, with its new controller, as well as different and in many places, challenging gameplay, if you are more interested inDJ Heroas a departure from series' very well-worn gameplay mold, you will probably be equally happy.Tom Milnes, Amazon.com/games freelance contributor", "price": 69.99, "imUrl": "http://ecx.images-amazon.com/images/I/61ula-d-y2L._SX300_.jpg", "related": {"also_bought": ["B003QOWPWS", "B003QOWQP4", "B003N5ZXU6", "B0028ZJ4O8", "B000TGDHW8", "B0028ZJ4ZW", "B001PKHRTQ", "B003JD7QVG", "B001UWGEJS", "B001UWN0EA", "B0039RFIQM", "B003ZSH6WY", "B004PV1JDM", "B003RRTXYW", "B000TTITVY", "B001KAN1VO", "B001GGM2M6", "B003RRTWSE", "B001TOMR5C", "B005VR1Q7S", "B00655BYI6", "B001ABP95E", "B006ZZU77A", "B0053BQN34"], "bought_together": ["B003QOWPWS"], "buy_after_viewing": ["B003QOWQP4", "B003QOWPWS"]}, "salesRank": {"Video Games": 5756}, "categories": [["Video Games", "Xbox 360", "Games"]]}