{"asin": "B000084318", "description": "TheLegend of Zeldaseries practically defined adventure gaming for an entire generation. Link, the hero of the adventure games, delighted millions by starring in games for each Nintendo console from the NES and Super NES to the Nintendo 64. Link brings this beloved franchise to the Nintendo GameCube inThe Legend Of Zelda: The Wind Waker, and he's moreanimatedthan ever.The first thing you'll notice aboutThe Legend Of Zelda: The Wind Wakeris that it looks completely different from any previous title in the franchise. Nintendo has opted to use cel-shading technology onWind Waker; the result is that the game looks like a cartoon. Die-hard Zelda purists initially howled at this change, arguing that the game skews too young. I think it's fantastic. The cartoon animation style allows for better expression of the characters, and several of the animations--like Link trying to pick up an object that's too heavy--are so cute that you can't help but laugh a little.The second thing you&#x92;ll notice is a focus on wind. Instead of trotting around on foot, Link travels from island to island on a talking boat, but he doesn't get far without the wind blowing in right direction. Luckily, you'll learn how to change the direction of the wind early in the game, and you'll do so frequently--not only to power your boat but also to solve puzzles. Clever use of wind makesWind Wakerstand out from more conventional adventure games.The third thing you&#x92;ll notice is that the game is just plain fun. Puzzles are innovative and refreshing, and despite some tricky puzzles, I never felt too frustrated to keep playing. The locales you'll visit are invariably exotic and fun to explore, and the host of bizarre creatures you'll encounter (friendly and otherwise) are always a kick in the pants. Moreover, though the look is radically different,Wind Wakerfeels like a classic Zelda game. Veterans of the early games in the franchise will experience more than a bit of nostalgia while playing it.The Legend Of Zelda: The Wind Wakeris everything you've come to expect from a Zelda game, and it's one of the best adventure games to date. This is a must-have title for any GameCube owner.--Jon \"Safety Monkey\" GroverPros:New cel-shaded animation looks greatPuzzles and characters are a lot of funThere's a special place in the heart of any gamer who's ever owned a Nintendo console, and that place is shaped like a TriforceCons:Some Zelda purists may be turned off by the cartoon look", "price": 105.63, "imUrl": "http://ecx.images-amazon.com/images/I/51W8C95QDDL._SY300_.jpg", "related": {"also_bought": ["9861019731", "B004CHLNWQ", "B00012D0SG", "B000ARPXU0", "B000066JRN", "B0009XSMNA", "B0002ILS1K", "B00005QEFD", "B00005Q8LR", "B00009WAUD", "B000A15K0Y", "B00006IJJI", "B00095KU5G", "B00021HBAE", "B00006FWTX", "B000620PSY", "B0001YYNL2", "B00005Q8LY", "B00006LEMY", "B002FY4AOG", "B000L9NPGG", "B00005QEFF", "B002L93F0A", "B0017KIBAI", "0761539603", "B0000E5U6I", "B0000E5U6K", "B0002ILS24", "B002C5BMFI", "B002L8W5V6", "B006QRNKOO", "B00006966U", "B00005ATSM", "B00006DY1M", "B00005ULXN", "B00009WAUF", "B0009XEC0C", "B000UQCER6", "B0002Y5180", "B000X37732", "B00005ATSN", "B001TOQ8UW", "B00004U1R1", "B001AI7CF2", "B00006LU9B", "B0000A0O28", "B00030GS80", "B00006LELB", "B000B8J7JQ", "B002BSC54I", "B000FRV2UK", "B00005YXRM", "B004P4YIB4", "B0000D9SQ6", "B004TC13JC", "B0002XCCU6", "B00006YXLE", "B00002ST3U", "B0009VXBAQ", "B0000A09EI", "B0000E5U6M", "B001VB72BC", "B000ARJI88", "B000FDOU9E", "B000N1IZOO", "B000AQA9UA", "B0000A1OG4", "B009CCTSIM", "B00005BOSF", "B0000A03CX", "B00002STXN", "B000090W86", "1930206305", "B0009PM8V0", "B00005QEFG", "B00006HBTW", "B000070IWB", "B000JVM256"], "bought_together": ["B000ARPXU0", "B00012D0SG"], "buy_after_viewing": ["9861019731", "B00012D0SG", "B004CHLNWQ", "B000ARPXU0"]}, "salesRank": {"Video Games": 568}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "More Systems", "GameCube", "Games"]]}