{"asin": "B000GEDN5E", "description": "Rayman Raving Rabbidsis the edgiest and most off-the-wall gaming experience in the history of the Rayman franchise. This new Rayman game features the funniest, zaniest, wackiest antics ever when hordes of nasty bunnies invade Rayman's world. They enslave him, forcing Rayman to participate in a series of gladiator-like trials. In order to win his freedom, Rayman must entertain and outwit these crazed, out-of-control bunnies.Beat the bad bunnies and become a superstar!Unlock mini-games to play with friends.View larger.Innumerable uses for the Wii Remote allow for creative game modes.View larger.How many Raving Rabbids can you take out in 30 seconds?View larger.Multiplayer games are as fast as they are hilarious.View larger.Welcome to a new generation of RaymanYou'd be hard-pressed to find a game with as much character asRayman Raving Rabbids. From the creative minigames to the quirks of the bunnies, this game packs an immense amount of entertainment on one disc. It's rare in games that failing during a competition can bring you as much joy as actually succeeding, butRayman Raving Rabbidsdoes an admirable job of rewarding your failure with a large dose of comic screams, flying plungers and crossed eyes.Of course, the point is to succeed and not let the bunnies laugh at your failure.Rayman Raving Rabbidsmay have a lot of style but it has very little plot. Each level consists of four minigame challenges and one \"boss battle,\" so to speak. If you complete at least three of the minigames, the main gate opens, allowing you to take on a greater challenge. Once you play a minigame in the Story Mode, you unlock that minigame and can play it at any time and against friends.Exercise your Wii RemoteHand it to Ubisoft's development crew as they really took advantage of the Wii Remote and Nunchuk controllers' capabilities. Some minigames are as simple as twirling the Wii Remote like a lasso and pushing a button to launch a cow as if you were in a hammer throw competition. Some minigames really test your coordinating, asking you to swing the Nunchuk like a jump rope and flicking the Wii Remote up to make Rayman jump.Each level has one consistant challege, however: a rhythm game. As a song plays, the bunnies approach a spot on either stage left or right. When they hit that spot, you'll shake the Nunchuk (if the bunny is on the left) or the Wii Remote when the rabbid hits the mark.When you take on the boss stages, you'll find yourself, more often than not, playing a rail shooter. The Wii Remote becomes your light gun, firing plungers at the horde of oncoming rodents. When your plunger supply runs out, shake the Nunchuk to reload. In recent years, the rail shooter (where you don't control the movement) has been forsaken for the first-person shooter and free movement. The Rayman boss experience will make rail shooter fans rejoice. If other shooters can perform as well as the plunger-fueled firing action ofRayman Raving Rabbids, the genre will come back with a vengeance.Impressive replay valueThere's extra incentive to play the many minigames ofRayman Raving Rabbids. When you complete a game in Challenge Mode, the game gives you a code that you can enter at the Rayman Web site which basically gives you access to special features on the site.The minigames ofRayman Raving Rabbidsskew toward a younger audience, and at first, an above-average gamer should find the games to be pretty easy. However, once the minigames are unlocked, a big challenge awaits you to get the highest scores and blast your friends in multiplayer challenges. That's when the real party begins! Rayman delivers exactly what the Wii promises: fun and lots of it. Here's hoping the bunnies come back for multiple invasions!", "price": 25.53, "imUrl": "http://ecx.images-amazon.com/images/I/51KmmvVbCxL._SY300_.jpg", "related": {"also_bought": ["B000SQ5LPU", "B003O6FVN8", "B001FEO74U", "B001TOQ8OI", "B004CUOD70", "B000YDIYFG", "B0050SVFB0", "B000SQ5LPK", "B005C0ZH8I", "B00IUOISNO", "B00897Z240", "B0013E9HP6", "B001TERJD2", "B004W1IX1G", "B004L4EWPU", "B0089KLTNA", "B002BS6210", "B000QD7BBM", "B000IONGVI", "B0065O9O34", "B001GIUWX0", "B002BRZ9G0", "B000R3BNHE", "B000VLJQ76", "B005FYJA52", "B002672Z80", "B000R3BNE2", "B002BH3N2W", "B002BSA388", "B00DWXV074", "B007MN6KGQ", "B00DTQTE54", "B0017Q4DGI", "B008YYSEBG", "B003WOFXEY", "B002I0GEXM", "B002I0IIPY", "B00D7UHT0E", "B0017HIIWW", "B0051873RE", "B003ZHMMEM", "B0014ULQDA", "B003ZCH7DI", "B001FEO74K", "B001PO2BJI", "B000SH3XEA", "B000LSJKAM", "B000FQ9YB0", "B008AU4YEA", "B0026IUSXI", "B001DO3NEW", "B0094X1ZXU", "B000P297ES", "B003S2SQCQ", "B00F2ENJY8", "B0026FCARI", "B004IK24MU", "B0087OYB38", "B000ZKBJYG", "B004B431A2", "B000IMWK2G", "B004L4AZ7Y", "B002MGPAKU", "B000XJNTNS", "B000GHLBUA", "B0050SYAQ2", "B003O6E3QY", "B000OAO188", "B003YLWJLA", "B002D2Y3IS", "B003S2JI6O", "B002ECN43C", "B0009VXBAQ", "B0033BJS9C", "B003O6FV8S", "B008CXUT12", "B002GEKIOG", "B0094X28J0", "B006ZPAYB4", "B004JKZUJI", "B005EHQJ2C", "B0050SVGXM", "B008E6ZYCQ", "B00DLL8P98", "B0094X2066", "B0053BG26C", "B002BSA3EM", "B00A4T3GZ8", "B0050SYUSU", "B003LDKIQ4", "B001B1W3HA", "B00ECGIL9K"], "bought_together": ["B000SQ5LPU", "B003O6FVN8"], "buy_after_viewing": ["B004CUOD70", "B000SQ5LPU", "B003O6FVN8", "B00897Z240"]}, "salesRank": {"Video Games": 4534}, "categories": [["Video Games", "Kids & Family", "Wii", "Games"], ["Video Games", "Wii", "Games"]]}