{"asin": "B004UR16ES", "description": "The Aspire One AO722, 11.6\" Netbook, is the perfect combination of usability and portability in a thin and light design, while boasting a full-size keyboard and excellent connectivity for the best of both worlds. Throw in one-of-a-kind style, and we've got you covered! Get more done while mobile with AMD C-Series processing performance, ATI Radeon&trade; HD Graphics, up to 7 hours of battery life and fun media features. You'll have everything you need in a travel light design to stay connected on the go, enjoy more of your media and tackle your everyday demands with ease.Key FeaturesAMD C-Series Processor C-50(1.0GHz, 1MB L2 cache)11.6&rdquo; HD Widescreen CineCrystal&trade; LED-backlit DisplayWindows&reg; 7 Home Premium2GB DDR3 Single-Channel Memory250GB SATA Hard DriveATI Radeon&trade; HD 6250 Graphicswith 256MB of dedicated system memory802.11b/g/n Wi-Fi CERTIFIED&trade;Multi-in-One Digital Media Card ReaderBuilt-in 0.3 Megapixel WebcamTwo Built-in Stereo SpeakersFull-Size Acer FineTip KeyboardMulti-Gesture Touchpadsupporting circular-motion scrolling, pinch-action zoom and page flip3- USB 2.0 Ports1- HDMI&trade; Port with HDCP Support6-cell Li-ion Batteryup to 7-hours battery life3.21 lbs. | 1.46kg(system unit only)Color: Espresso BlackComes with Black Cover and Espresso PalmrestLearn MoreRemarkable Netbook Performance &amp; Unique StyleExperience crisp, clear HD content anywhere!The new look of the Acer&reg; Aspire One AO722 is sure to turn heads. The glossy cover features a unique \"water ripples\" pattern.The AMD C-Series Processor is designed to deliver the balanced performance you need to enjoy your favorite applications. Browse the Internet, read and send email, watch videos, and play games &ndash; all on the go.The AO722 boasts great HD resolution and ATI Radeon&trade; HD 6250 Graphics with 256MB of dedicated system memory to deliver the performance you need. Experience smooth streaming of Internet videos from popular sites like Hulu.com or YouTube.HDMI&trade; output lets you bring HD content and high-quality audio from your netbook to a large display or big screen HDTV through a single cable! Share your favorite HD entertainment with family and friends.Full-on Ultra-PortabilityEnjoy console-quality gaming and fun with preloaded full versions of games!Just 1\" thin and around 3 lbs., this Netbook is easy to carry around and take with you while on-the-go. The 6-cell battery fits flush into the chassis, further streamlining the Netbook's look and provides up to 7- hours cable-free battery life on a single charge!The 11.6&rdquo; HD Widescreen CineCrystal&trade; LED-backlit display with true cinematic 16:9 aspect ratio delivers an optimal viewing experience. Easily view Web pages, chat online, stay productive and more- all while remaining compact.This lightweight Netbook provides regular-size notebook functionality for comfortable mobile usability. The 100% standard-size keyboard has bigger keys for more accurate typing, and the Multi-Gesture Touchpad is perfect for scrolling, rotating images, zooming and browsing -- all with fingertip convenience.Seamless CommunicationsStay fully connected with friends and the latest buzz wherever you go.Multi-in-1 Card Reader and (3) USB ports provide convenient file sharing and connectivity between a digital camera or other mobile devices. Store files and media on the 250GB Hard Drive.With 802.11b/g/n Wireless and 10/100 Ethernet LAN connectivity you will always have a way to jump on the Internet and access email, browse the web, connect to your social networks and more!Go the distance without moving an inch -- engage in high-quality face-to face video chats with the Built-in 0.3 Megapixel Webcam and Digital Microphone.Windows&reg; 7 Home Premium makes the things you do every day easier and with Office Starter 2010, experience new ways to deliver your best work! Buy Microsoft&reg; Office 2010 to activate a full-featured Office suite preloaded on this PC.", "title": "Acer Aspire One AO722-BZ454 11.6-Inch HD Netbook (Espresso Black)", "price": 17.19, "imUrl": "http://ecx.images-amazon.com/images/I/41XgnjeA73L._SX300_.jpg", "related": {"also_viewed": ["B005J2E2US", "B009AANCKG", "B006ITMC7Q", "B00AAIC5S2", "B005SEIO4M", "B00BJ6UW9I", "B00EC4QJAU", "B008D9HZ62", "B00DQHZLO4", "B007Z92SS6", "B004FEQV2S", "B0054581W0", "B007582KGM", "B005V0GZFI", "B0065PFC34", "B005F7GZEI", "B00CU2K6MS", "B00H7WF2D4", "B00CU2K4LQ", "B00KJIY79S", "B009GHW0YW", "B007C5VOP6", "B00BQH8QTI", "B001KB21KA", "B006MQ1JS8", "B005T63BEM", "B00CU2K5IS", "B00CM1AAOG", "B00IF0QIAI", "B009R7VDQ2"], "buy_after_viewing": ["B005J2E2US", "B009SLTBJ8", "B00FNPD1VW", "B00CU2K6MS"]}, "categories": [["Electronics", "Computers & Accessories"]]}