{"asin": "B002PHM0XQ", "description": "Sony BDP-N460(October 13, 2009)In addition to playing Blu-ray Discs and DVDs, the Sony BDP-N460 streams one of the largest collections of premium and free on-demand entertainment from the BRAVIA Internet Video platform, including thousands of movies, TV programs, and music from from over 25 leading content providers--including YouTube, Slacker, and Netflix. Simply connect the BDP-N460 to your existing Internet connection.Stream video from one of the largest collections of premium and free on-demand entertainment, including thousands of movies, TV programs, and music from YouTube, Slacker, and, later this fall, Netflix.The Sony BDP-N460 incorporates Sony&rsquo;s Precision Cinema HD Upscale technology that converts standard-definition signals (480i) to near HD quality (seelarger image).It supports Dolby TrueHD and dts-HD audio codecs for up to 7.1 channels of high-definition sound, and there's even quick start-up mode which begins operating your Blu-ray Disc player in approximately six seconds from the time it is powered on. You can also play and upscale your standard DVDs to near high definition. And navigation of the player's menus is a breeze thanks to the icon-based Xross Media Bar (XMB) menu system.Key FeaturesInstantly stream thousands of movies, videos and musicfrom an ever-growing list of over 25 content providers including Netflix, Slacker Radio, YouTube and more. (Learn more)Full HD 1080p Output(Learn more)DVD Upscaling via HDMI technology:DVD Upscaling via HDMI makes your existing standard DVDs look better on your HDTV by upscaling them to near HD quality.Dolby TrueHD and dts HD- 7.1 Analog:In the past, most audio codecs used compression that actually removes some sound data to transmit audio from the disc to the audio circuitry. This means that what you hear is a subset of the original audio. However, newer formats allow the audio to be compressed but not discarded, allowing the original audio to come through once it's been decoded. This player allows you to stream the audio out via HDMI to a capable receiver or through analog 7.1 outputs for maximum compatibility with high end receivers. (Learn more)BD-Live Technologyallows you to download and stream bonus content such as additional scenes, shorts, trailers, movie-based games, and more. And with Bonus View, you can enjoy \"picture-in-picture\" capability with select Blu-ray titles. External memory (sold separately) is required.Quick Start Mode:Quick Start Mode lets you begin operating your Sony Blu-ray Disc player approximately six seconds from the time it's powered on.Ethernet portlets you connect the BDP-S360 to your home's existing broadband network to access bonus features on BD-Live enabled Blu-ray Disc movies.Bonus View featureprovides \"picture-in-picture\" capability with select Blu-ray Disc titles--useful for viewing director or actor commentary while the movie plays.x.v.Color outputplays AVCHD-format discs with support for the international xvYCC color standard, producing images with nearly twice as many viewable colors as the existing RGB color standard.BRAVIA Sync technologylets you enjoy the convenience of one remote control to operate and control all your compatible home entertainment devices. It utilizes the HDMI CEC function to easily turn on and control your compatible HDMI-connected components without having to use multiple remote controls.24p True Cinema technologylets you watch films at their intended 24 fps (frames per second)--the way movies are shot and mastered--so you can enjoy cinematic picture quality.Precision Cinema HD Upscale circuitrydelivers accurate and vivid images with clarity and detail that are faithful to the source--whether film or video (upscaled image quality will vary). This circuitry uses advanced conversion and processing to detect image changes at the pixel level, rather than at the level of whole scan lines. Additionally, separate algorithms are used to process the moving and still parts of an image, resulting in sharp backgrounds with moving objects that are free from motion artifacts.Emmy-Award Winning Xross Media Bar Interface:Sony's exclusive xross media bar user interface makes it simple and intuitive to navigate television menus, controls, and user settings. (Learn more)x.v.Color outputplays AVCHD-format discs with support for the international xvYCC color standard, producing images with nearly twice as many viewable colors as the existing RGB color standard. (Learn more)Easy Wi-Fi setup:In addition to a built-in Ethernet port, the BDP-N460 includes built-in software that makes it easy to connect this player to your existing wireless network by pairing the optional Linksys Wireless Ethernet Bridge (WET-610N) to connect to your home router (each sold separately). Or you can use the built-in Ethernet port to use a wired connection.Convenience features includeparental controls, child lock, and video bit rate indicatorDimensions:16.9 x 2.2 x 8.1 inchesWarranty:1 year parts and laborConnectionsHDMI audio/video output: 1Component video (Y/Pb/Pr) output: 1Composite video output: 1Optical digital audio output: 1Coaxial digital audio output: 1Analog audio output: 1 (2-channel)Ethernet networking: 1USB port: 1Video SpecificationsAVC-HD: Yes (8cm/12cm; DVD+R/RW/-R/-RW)BD-R/RE Read Compatibility: Yes (BDMV &amp; BDAV)BD-ROM: Bonus View (Profile1.1); BD-Live (Profile2.0); BD-ROM (SL/DL)CD (CD-DA): YesCD-R/RW: Yes (CD-DA &amp; Data)DVD Playback: YesDVD+R Read Compatibility: Yes (DL) (+VR)DVD+RW Read Compatibility: Yes (+VR) (8cm)DVD-R Read Compatibility: Yes (DL) (VR) (VR with CPRM) (8cm)DVD-RW Read Compatibility: Yes (VR) (VR with CPRM) (8cm)JPEG Playback: Yes (BD-R/REDVD+RW/+R/-RW/-R/CD-R,RW)Noise Reduction: YesPhotoTV HD: Yesx.v.Color Technology: YesAudio SpecificationsDolby: Yes &amp; Dolby TrueHD bitstream out over HDMI (V1.3)Dolby Digital plus Decoding: YesDolby True HD bitstream output: YesDolby TrueHD Decoding: YesLPCM: Yes (multi channel decoder): Yes (HDMI bitstream out)MP3 Playback: Yes (BD-R/RE/DVD+RW/+R/-RW/-R/CD-R,RW)dts Decoding: Yesdts HD bitstream output: Yesdts Output: Yes, &amp; /DTS-HD bitstream out over HDMI (V1.3)What's in the BoxSony BDP-N460 BD player, remote control (with 2 AA batteries), composite video cable, AC cable, printed instruction manualLearn MoreCOMMENT: ==========================================Premium Online Entertainment StreamingInstantly stream thousands of movies, videos and music from an ever-growing list of over 25 content providers including Netflix (coming Fall 2009), Slacker Radio, YouTube and more. Just connect the BDP-N460 to your existing internet connection and enjoy the convenience of instant streaming. Content providers include:NetflixYouTubeBlip.tvCrackleVideo DetectiveSlackerConcierge.comFear.netMen.Style.comWiredSingingFool.comStyle.comDailymotionVideocast.comOn NetworksMy PlayeHowGolflink.comHowcastEpicuriousLivestrong.comSony Pictures TelevisionFord ModelsMore PictureSee Everything Your HDTV Can Show You with Full HD.6 Times the Picture Data on DVDsSee everything your HDTV can show you. Blu-ray Disc's Full HD 1080p resolution produces over 2 million pixels per frame to produce a razor-sharp picture with unmatched depth and clarity that takes full advantage of the capabilities of today's 1080p HDTVs. That's six times the picture data contained on DVDs, which are encoded at only 480p.24p True Cinema Video OutputMost of all Hollywood movies are shot at 24 frames per second, and Blu-ray Disc movies are mastered at 24 frame per second, so it is only fitting that the Sony Blu-ray Disc Players can output your films at 1080/24p for a true film-like experience at home. Of course, Sony Blu-ray Disc Players can also output at 1080/60p for more traditional HDTV sets on the market. Either way Sony has you covered for the best picture possible in Full 1080p.Backwards compatible and UpscalingAll existing Blu-ray Disc players will play your standard DVD collection without a problem. And with built-in 1080p video upscaling, they'll look even better.More SoundThis Sony BD player is compatible with Dolby TrueHD, Dolby&rsquo;s next-generation lossless technology developed for high-definition disc-based media. Dolby TrueHD delivers tantalizing sound that is bit-for-bit identical to the studio master, unlocking the true high-definition entertainment experience on next-generation discs. When coupled with high-definition video, Dolby TrueHD offers an unprecedented home theater experience that lets you enjoy sound as stunning as the high-definition picture.Delivers enthralling studio-master-quality sound that unlocks the true high-definition entertainment experience on next-generation discs.Offers more discrete channels than ever before for impeccable surround sound.Compatible with the A/V receivers and home-theaters-in-a-box (HTIBs) of today and tomorrow.Dialogue normalization maintains the same volume level when you change to other Dolby Digital and Dolby TrueHD programming.Dynamic range control (Night mode) enables you to customize audio playback to reduce peak volume levels (no loud surprises) while experiencing all the details in the soundtrack, enabling late-night viewing of high-energy surround sound without disturbing others.Xross Media BarXross (pronouncedCross) is Sony's Technical-Emmy award-winning graphic user interface for Sony WEGA and BRAVIA televisions and PS3 and PSX game systems. The interface features category icons spread horizontally across the screen that organize the viewing options (TV, Music, Internet, Tools, etc...). When a category icon is selected on the horizontal bar, a vertical bar appears showing the viewing options within that category. Using the directional pad on your remote, you can easily maneuver horizontally from category to category, then scroll vertically through individual viewing options to easily navigate through the wide range of programming available on today's televisions.x.v ColorThanks to the adoption of a newly approved international color standard called xvYCC (an option in the HDMI v1.3 spec and which Sony participated in creating), the color space has been greatly expanded.All Sony XBR HDTVs support the xvYCC color profile (Extended YCC Colorimetry for Video Applications), or \"x.v. color\" for short. Standard RGB color space allows the display of a portion of the colors that are viewable to the human eye. The next generation \"xvYCC\" color space actually offers&nbsp; an available range of colors that exceeds what human eyes can recognize.Next-generation \"xvYCC\" color space supports 1.8 times as many colors as existing HDTV signalsLets HDTVs display colors more accuratelyEnables displays with more natural and vivid colors", "title": "Sony BDP-N460 Blu-ray Disc Player (Black) (2009 Model)", "price": 142.0, "imUrl": "http://ecx.images-amazon.com/images/I/31VFHoQjwAL._SY300_.jpg", "related": {"also_viewed": ["B0036WS4CA", "B006H8WFU2", "B0038KR8WM", "B004OF9XMI", "B0082NJ5BC", "B004XYJKHI", "B0044Z964I", "B00HPMCPJK", "B0091VAHIO", "B007WF1IMK", "B004XYJKHS", "B003YTDD9Y", "B006U1YVZ8", "B005DJBR6O", "B00752R4QO", "B004OVEYTO", "B0035ER1OQ", "B00AWX6EYQ", "B004T6VT74", "B006U1YUZE", "B004K1EOCA", "B00HPMCO4Q", "B004RKVWQK", "B004LNFJCQ", "B00BFRKYVM", "B004MF79QM", "B005NEZDUA", "B00HPMCO14", "B0038KN114", "B001V9LA44", "B00752R5Z4", "B00BFDHVAS", "B00HPMCO6O", "B000RFURG0", "B00AYB3OMG", "B00AWKC0EC", "B004M8SBFW", "B00AYB3OOY", "B00752R4PK", "B004K1EO5C"], "buy_after_viewing": ["B00AWKC0JM", "B00AWKC0EC", "B00HPMCO4Q", "B00HPMCO4Q", "B003L1ZYYM"]}, "categories": [["Electronics", "Television & Video", "Blu-ray Players & Recorders", "Blu-ray Players"]]}