{"asin": "B001F7BKZQ", "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]], "description": "There's nothing quite as refreshing as a good hike or snowshoe trip, but there's nothing quite as terrifying as getting lost on the trail. Enter the Bushnell GPS BackTrack personal locator, which gets you back to your car or home base safely and easily. The BackTrack is a breeze to use, with an intuitive two-button design that employs GPS technology in its most basic format. All you have to do is mark the location of your car, campsite, or anything else (the BackTrack stores up to three locations) and then forget it until it's time to return. At the end of the day, just select the stored location and the BackTrack will display the direction and distance to travel until you return. You can use it to locate a treestand or trailhead, to find your car in a crowded parking lot, even to rendezvous with a group. Plus, it's extremely compact, so you can stow it conveniently in your pocket, pack, or purse.The BackTrack is weather-resistant and operates on two AAA batteries (not included). It also comes with a lanyard for easy attachment.About BushnellBushnell has been the industry leader in high-performance sports optics for more than 50 years. The company's guiding principle is to provide the highest quality, most reliable, and most affordable sports optics products on the market. Bushnell product lines enhance the enjoyment of every outdoor pursuit, including nature study, hunting, fishing, birding, and stargazing. Indoors, the company's binoculars bring the audience closer to the action in fast-moving sports or the fine arts at theaters and concerts.", "title": "Bushnell GPS BackTrack Personal Locator", "price": 49.95, "salesRank": {"Sports &amp; Outdoors": 40826}, "imUrl": "http://ecx.images-amazon.com/images/I/51HvuCZ3T3L._SY300_.jpg", "related": {"also_bought": ["B007SUKPOG", "B004QHW7UY", "B0050FXF52", "B00975PTVY", "B003VMXX7G", "B00L4CH3Q2", "B003B4SV30", "B0010O748Q", "B003WHJ0QI", "B006QF3TW4", "B000W0EW9I", "B005IDQW3S", "B00LVDZDXY"], "also_viewed": ["B00975PTVY", "B007SUKPOG", "B00975PTTQ", "B004QHW7UY", "B006U3ZJRA", "B0050FXF52", "B00AKHV7RS", "B00HV3OD1G", "B0010BDECY", "B003VMXX7G", "B006U3ZIQW", "B006U3ZJAM", "B00C94G8NI", "B002PHRDO2", "B0047ZG1LQ", "B006DWFGU8", "B005IQ1V4U", "B001EJP3CG", "B009SUHH5O", "B006U3ZINK", "B00L4CH3Q2", "B00264GKVQ", "B003TFDTM4", "B00AWTSRDQ", "B008YD2SQO", "B00CICM150", "B00EGSH0JQ", "B00B95OD4E", "B006JXY0CQ", "B002PHRDQU", "B008GT8C7K", "B0009PLRXK", "B005E1OU1A", "B00FIVPFE2", "B00GWDE8MA", "B0079SR568", "B00JPF7XSI", "B00542NV32", "B007TW3QG2", "B002MZZX9E", "B004TX01B2", "B00C8S8S4W", "B001FYQO3W", "B008M64COO", "B00DW40UZQ", "B0024UJ762", "B00AENQOZI", "B00HN02XEQ", "B002EOULAE", "B00IAIFF0Y", "B00JAH54QE", "B006DYTWQA", "B00542NVDW", "B00K7KEZ0O"]}}