{"asin": "B000UD205K", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphone Accessories"]], "description": "Developed by Shure, the industry leader in professional audio electronics, the Music Phone Adapter (MPA) is a sleek modular accessory that converts any Shure Sound Isolating Earphones into a stereo headset and allows Apple iPhone users to switch seamlessly between listening and communicating. Building off of Shure's 80-year professional audio legacy, the MPA utilizes the company's innovative modular design to bridge from personal listening nirvana to other communication activities that converged devices such as the iPhone offer.By combining a VoicePort microphone with a control button that allows users to answer and end calls without touching the phone, the MPA enables consumers to incorporate the premium sound quality of Shure Sound Isolating Earphones into mobile phone conversations.  The MPA's low-profile VoicePort microphone, which was developed using the same technology as Shure's QuietSpot mobile headsets, is tuned to optimize intelligibility, ensuring callers hear you clearly even in noisy environments. This professional-grade Shure microphone uses VoicePort technology to provide superior sound quality and blocks background noise and wind from interfering with your phone call.Shure's award-winning line of earphones are precision-engineered for a listening experience that's true to live performance. They feature premium sound quality, sound isolating design and extensive \"fit kits\" for personalization. With the addition of this MPA attachment, Shure's Sound Isolating Earphones take convenience, portability, sound quality and freedom from outside noise one step further, enabling listeners to experience professional quality sound with both their MP3 players and music-enabled phones. Instead of carrying a pair of earphones and a separate, lower-quality headset for your music phone, the MPA allows you to incorporate the premium sound quality of Shure Sound Isolating Earphones into your mobile phone conversations.", "title": "Shure MPA-3C Music Phone Adapter for iPhone", "price": 46.99, "salesRank": {"Musical Instruments": 29678}, "imUrl": "http://ecx.images-amazon.com/images/I/41mm0JaMuPL._SX300_.jpg", "related": {"also_viewed": ["B000V8RCTS", "B002ZX695U", "B0043241X8", "B002RL9WDQ", "B002K4GBEI", "B0046HJLJO", "B0050L5VO4", "B002RL9WE0", "B0059F3EXG", "B0039YOZWI", "B003DPPYKK", "B0047FS9Y8", "B00426DND4", "B0051SNWZQ", "B0055DGM8Q", "B0046HADYQ", "B009X1DWF2", "B006NGHN5A", "B00C1IH5QG", "B00029MTMQ", "B0058XPFJU", "B003YTROIU", "B0013RTHEO", "B00FIAYE40", "B008DWGLLO", "B004PNZFZ8", "B00HZOVW0Q", "B0091CWYQ6", "B0031RG33C", "B001P5HL3S", "B007TCXGVC", "B003NSBKT6", "B00JQ3OBZM", "B003A5AXP4", "B00HI4QRW6", "B009HW15UG", "B000WKS8QG", "B0011ADHL2", "B004Z97CQW", "B00ENFA3GO", "B00FJRPD8I", "B001DX9EDW", "B009ZNFEEU", "B000WKQ8LS", "B0016MF7W2", "B003NSBKSM", "B00AUN6F7Y", "B00EWOK09G", "B0013JT3XC", "B0099ENZSM", "B0081601G8", "B00EXN4GK0", "B003AOS1QI", "B00001P4XH", "B000YBY2U4"], "buy_after_viewing": ["B000V8RCTS", "B002ZX695U", "B0043241X8", "B002RL9WDQ"]}}