{"asin": "B002CZ7P04", "description": "Walk it Out!provides gamers on the Wii platform with a unique way to explore an inviting and entertaining gameworld, while staying active and social. Containing both local single player and multiplayer options, and supporting theDanceDanceRevolution (DDR)controller for Wii, the Wii Remote/Nunchuk configuration or Wii Balance Board, players walk to the rhythm of an in-game soundtrack, as well as take on a series of mini-games. With continued success the gameworld expands with new physical elements, as well as additional songs by popular artists which together keep the fun coming and players moving as they discover new challenges with each step they take..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Walk your way to fun and fitness using your controller of choice.View larger.Two-player local support.View larger.AI companion stat and calorie tracking.View larger.Your choice of three mini-games.View larger.GameplayWalk It Out!is a unique blend of simulation, action, rhythm and exercise gameplay. The game's main campaign, known as Stepping Mode, exists in an area known as \"Rhythm Island\", can be played in single player or local two-player simultaneous and challenges players to explore a gameworld that grows with every literal step taken through it. These steps are patterned after the rhythm of the songs of the in-game soundtrack, which are tapped/stepped out using the game controllers supported. These include the Wii Remote/Nunchuk, the Wii Balance Board and theDDRcontroller for Wii. Tracks are of various speed and tempo, which the player can alter through difficulty settings. The game features a moving indicator line, known as the \"Stepping Guide\" that helps players keep in tune with the beat, and the displaying of lyrics, which for some can be helpful in keeping in time, can also be suspended as the player chooses. As players walk in synch they are rewarded with in-game chips, depending on their level of accuracy. These chips can in turn be used to unlock \"Event Capsules\", which hold a variety of elements ranging from new songs, new paths through the gameworld and physical environmental features like zodiac constellations and rainbows. The unlocking/purchasing of events can happen as the user pauses the action to do so, or can be cued to happen as the required chips are collected. Additional features include: character customization and Mii support, your choice of a male or female AI companion, in-game song set lists, map functionality and varied camera controls for improved Event Capsule searching.Mini-GamesAlong with moving through the main campaign found within theWalk It Out!Stepping Mode, players also have the option to take a break and play a range of entertaining mini-games, some of which involve walking and some not. These include:Whack-A-Slack!A take off on the iconic gameWhack-A-Mole, here players try to hit as many of the \"Slackie\" creatures as possible with an in-game mallet, within the parameters chosen for the game. Multiple difficulty settings are available and play is possible during a single run-through of an unlocked song or set list, or by letting the song(s) loop and play as long as you like.PsycoloPsycolois a puzzle game in which you use your ability to walk to the beat to move a cube around a gameboard collecting hearts and avoiding Slackies, all while maintaining your on-screen health through accuracy in play. The game features 3 ways to move your cube.Smash &lsquo;n Run!Another nod toWhack-A-Mole,Smash &lsquo;n Run!again has players looking to drop the hammer on Slackies. The difference here is that players need the right size hammer, if not Slackies can fight back and drain your life. This game also incorporates the Wii Remote/Nunchuk controller configuration with your choice ofDDRmat or Wii Balance Board controllers.Game FeaturesUniquely Motivational Gameplay- Stay active and explore an in-game world where the more you move, the richer your gameworld becomes. Unlockable areas and music tracks tied to the in-game time of day ensure the discovery of new items and goodies every time you play.Music to Get You Going-Walk It Out!is the only fitness-focused game that keeps you in the game with great music. Move to the beat of 120 songs, including 20 licensed tracks, including masters performed by the original artists. Hits include: \"Boom Boom Pow\" by the Black Eyed Peas, \"How Do You Sleep?\" by Jesse McCartney, \"La La Land\" by Demi Lovato, and more.Track Your Achievements- Get a visual feel for how well you're doing through charts and graphs that show burned calories, distance traveled, steps taken and more.Wii Balance Board Compatible- Play with the peripheral of your choice, including theDanceDanceRevolutionWii controller, Wii Remote and Nunchuk or Wii Balance Board.Mini-game Fun- Along with exploring and unlocking theWalk It Out!gameworld, players can also engage in a series of mini-games at any time. These include: Whack-A-Slack!, Psycolo and Smash &lsquo;n Run!.", "price": 85.27, "imUrl": "http://ecx.images-amazon.com/images/I/51foUxmQbtL._SY300_.jpg", "related": {"also_bought": ["B003JZASVE", "B0056WJA1W", "B001H0RZX2", "B002BS47JE", "B003OZZJGS", "B001KX504C", "B003TJYOTW", "B0013LTP5Q", "B002NNNL1W", "B002EWD040", "B004M4IO08", "B003R5THKO", "B001KWE2WE", "B001NXCIUS", "B002BSA3EM", "B0028IDSWE", "B0050SVFWE", "B002ECN43C", "B002TK3HEK", "B002KJ9XE8", "B0030U1YYS", "B0057PERGQ", "B0049L2UJK", "B0035DN7JK", "B001MBUGLY", "B003GZY88G", "B003LDKIQ4", "B003O6C0V4", "B0028A8PDY", "B000VJRU44", "B0024MNOGE", "B001AMO1D4", "B004J30X4W", "B003WF4826", "B0052J8GF0", "B0086V5TYC", "B0047SFGDW", "B0053BG26C", "B002MWSY3O", "B002BUSVJO", "B005EEYBA2", "B0094X221O", "B001DO3NEW", "B0012R58LG", "B001B1W3KM", "B008BERGYU", "B003LDKH2E", "B002YJ0U3W", "B009M72E5Q", "B002I0EOSE", "B002BFPE8U", "B0094X2066", "B003S2JI82", "B003P9BIMW", "B00FE8WKPQ", "B0009VXBAQ", "B000OAO188", "B005FEX576", "B008J16AG0", "B000SFK0SO", "B0086V5UF0", "1574219049", "B003VWGBCK", "B00D7UHT0E", "B00434FED2", "B0028R1M3W", "B0024RI6S0", "B0017Q4DGI", "B003S2OO7W", "B00EPH8S8U", "B0094X28J0", "B004Y6DPQM", "B003O6FV8S", "B00FF9MLQW", "B00265T7O2", "B003X1R29K", "B00E8RVP0U", "B001KRCDRA", "B00DJYK8XS", "B001ABP9B8", "B0088I8M10", "B004W1IX1G", "B003VC8TUM", "B000QD7BBM", "B00DLX76BY", "B0057PERPM", "B00D2UMHWO", "B0013OL0BK", "B0042VV5DY", "B003OQ4B1Q", "B00E8A0PNK", "B00634MLMW", "B001GZT1UI", "B00068S97M"], "bought_together": ["B002BS47JE", "B003OZZJGS"], "buy_after_viewing": ["B001H0RZX2", "B003OZZJGS", "B001KX504C", "B008BERGYU"]}, "salesRank": {"Video Games": 7455}, "categories": [["Video Games", "Kids & Family", "Wii", "Games"], ["Video Games", "Wii", "Games"]]}