{"asin": "B00006C2HA", "description": "The wait is over. After five years of development, Lead Programmer John Carmack and the id Software team have put together a revolutionary visual experience. AlthoughDoom 3is not perfect, the 3D graphics engine upon which it is built sets a new, jaw-dropping standard that makes this game a must-have. In addition to adding multi-player action via xBox live, or via networked consoles, the Xbox version of Doom 3 also adds a great two-player cooperative mode.Hell on MarsYour character is a low ranking Marine on a routine rotation to the United Aerospace Corporation's (UAC) Mars Research Facility. That's pretty much all the back-story you need.Doom 3is a bit skimpy in the story-line department, but rich plotting and character development have never been the focus of theDoomfranchise. Action is the name of the game here, and we found plenty. After a few minutes of wandering through the facility, listening to rumors about impending catastrophe from the staff (rememberHalf-Life?) it was time to start shooting. We fought our way through dark, lavishly detailed environments until finally doing battle with pure evil in the depths of hell. Although the game offers no opportunities to explore the Martian setting apart from the linear corridors of the research facility, good level design and well crafted sound effects were successful at scaring the living heck out of us all the way through.Fearsome monsters. Dimly-lit environments. The perfect recipe for horror.Creature DiscomfortsGroaning zombies and the sudden leaping attack of an eleven-eyed Imp are just the beginning of the horror and anxiety inDoom 3. Floating Cacodemons attack from above with a mouthful of teeth, ethereal Revenant fire flesh-seeking missiles with deadly accuracy, a swarm of spider-like Trites skitter down the corridor, hungry for blood. Although the enemy AI inDoom 3is less crafty than we would have liked, the incredible variety of enemies--each with a unique style of attack--outweighs this shortcoming somewhat.Guns, Guns, GunsWhile there are many powerful weapons in the game, they are designed to force players to anticipate and plan for firefights. For instance, we liked wielding the chaingun to shred enemies at longer ranges, but the weapon devours ammo and using it on close-range targets was a waste of bullets. We quickly learned to switch to the shotgun or the chainsaw to dispatch foes at close range.One piece of hardware, the flashlight, was a point of both salvation and frustration for us.Doom 3is a dark game and many enemies know how to take advantage of it. You'll find yourself switching back and forth between your weapons and your flashlight often just to see what's lurking ahead. This problem might be easily solved by duct taping the flashlight to your equipped weapon, but, alas, we found no duct tape on Mars.MultiplayerWhile Doom 3 is noHalo 2when it comes to multi-player action, there are some respectable multi-player arenas and modes including death match, team death match, last man standing and tournament. Five maps serve to keep things interesting, and you'll want to look for special tricks in some arenas to give you a leg up on enemies. Cooperative multi-player proved to be a hoot as we teamed up with friends to try to make our way through the levels. The intensity of gameplay ramps up significantly in the cooperative mode, as the levels are designed to be harder. They're also designed to force players to work together, so you'll want to communicate with your partner as much as possible.Looking GoodDoom 3is incredible looking. Every room is exquisitely detailed, from the shimmer of the air near a heat source to the texture of a hamburger sitting on the counter of the company mess hall. Id obviously went all out designing every creature in the game and their realism makes them all the more horrifying. Get ready to jump out of your couch cushions!--Joshua GunnProsStunning display of graphics technologyStrong level design with lots of spookinessGreat cooperative modePlenty of hours of single-player gameplayConsThin storylineNo headlamps or gun-mounted lighting in the 22nd centuryFairly basic multi-player options", "price": 121.92, "imUrl": "http://ecx.images-amazon.com/images/I/51dHf3yfriL._SY300_.jpg", "related": {"also_bought": ["B0007II11K", "B0009Q1IE2", "B008E6ZXA4", "B002I0JAJ2", "B00005OBQB", "B003ICGL7I", "B000BHQZAQ", "B0002IBEJQ", "B000GPVUUS", "B000AQE79E", "B0006SJZOS", "B00009TW6R", "B00004U55E", "B000B63RSA", "B0029ZBZ0I", "B000EPP6UA", "B00006I02Z", "B003GSZAOY", "B001Q96ZNU", "B00CPKUV9I", "B000X9FV5M", "B001E6DG6Y", "B002BS47YE", "B0000ZUGZ4", "B001B5U80K", "B002BXKJA0", "B0000A1VER", "B0019C4MU2", "B0002LHPA0", "B001CLYL1K", "B00002SUOV", "B00005N7YR", "B000028U28", "B00080LSOY", "B000PS2XES", "B000GRB4G6", "B004FUGKSW", "B001AWBYRA", "B000PS1HMM", "B000056KDW", "B001UWGDPS", "B00005RV92", "B0000C6EB4", "B0001OU19K", "B001AZTU28", "B000B6MLZK", "B00B70WKUK", "B0012LGHZI", "B00006IR62", "B001CC8UBG", "B002ZJPYHS", "B000929AJQ", "B001C4VU5C", "B001D7798A", "B0016BVYAM", "B00002SUPP", "B000922E0S", "B000A2KF3K", "B004FZ9822", "B003ZULWQI", "B0013RC1W4", "B00004WHWF", "B00002SUDC", "B0000BVGOM", "B000HMQE8S", "B0001AO028", "B0006SL93I", "B0000696PJ", "B000NV8F58", "B000MK694E", "B002NQ4820", "B00001NFVK", "B005C2D2H4", "B000021Y20", "B0079NGSDO", "B00CPKUV7K", "B00009WDS8", "B00002S7YE", "B000BDG7BM", "B0007M69SS"], "bought_together": ["B0007II11K", "B0009Q1IE2"], "buy_after_viewing": ["B008E6ZXA4", "B008E6ZXRM", "B00CPKUV9I", "B008E6ZXTA"]}, "salesRank": {"Video Games": 12739}, "categories": [["Video Games", "PC", "Games"]]}