{"asin": "B000CSQJ8C", "description": "Just when you thought Garmin had cornered the market on powerful, affordable, and effective wrist-mounted GPS devices, here comes the Forerunner 205. The release of this device is a major achievement from a design and technology perspective. This isn't just marketing-speak; the Forerunner 205 is the most accurate, most reliable wrist-mounted performance and GPS tracking tool we've ever tested. Yes, it's that good. While no device this compact can do everything (yet), the 205 pushes the boundaries of what is possible from something strapped around your wrist. While the 205 doesn't offer heart rate monitoring, or connectivity with Garmin's wireless speed and cadence sensor -- for that, you'll need to step up to theForerunner 305-- but it's a great way to get basic GPS location and performance data.View Garmin's Forerunnerdemonstration video.Choose from 12 data fields to display on the 305's screen.View larger.The design cleverly integrates the GPS antenna and aims it towards the sky when you're running or walking.View larger.The Virtual Partner function makes your workouts more competitive.View larger.Choose from three workout modes that help you target your training goals.View larger.The 305 features rudimentary mapping and location marking functions.View larger.DesignThe 205's design is a radical departure from Garmin's previous generation of wrist mounted GPS devices, which reached a pinnacle with the GarminForerunner 301. While the 301 delivered accurate heart rate monitoring, good performance tracking, and decent GPS reception, it didn't quite deliver in the design department. The form factor was bulky and wearing it wasn't much different than duct taping a full-sized GPS device to your wrist.Not so with the 205. Garmin's engineers obviously burned the midnight oil and have come up with a waterproof design that, while certainly not as small as a sports watch, feels just as comfortable. The curved casing allows the unit's antenna to face the sky when you're running, while the widescreen display is perfectly positioned for viewing when you need it. And the display certainly deserves a few kudos. While it's smaller than the display found on previous Forerunners, its resolution is far higher, offering incredible clarity and crispness.Garmin has smartly given the 205 a simple button layout and the buttons have a nice tactile feel with good pressure response. The right side houses the menu selection and enter buttons, while the left houses a power/backlight button and a mode button. This simple and elegant solution is a big improvement over the sometimes confusing button functionality of previous Forerunners.View button layout.The underside of the 205 is pretty nondescript, except for a row of contacts that interface with the included charging and data cradle. The cradle is small and unobtrusive and its single mini-USB port connects to either an included AC adapter, or a USB cable that connects to your PC. In addition to data transfer with the USB cable, you can also charge the 205's embedded lithium-ion battery via a powered USB connection from your computer.GPS PerformanceThe big news about the Forerunner 205 is that it features an integrated, high-sensitivity SiRFstar III GPS receiver. What does this mean? It means that the 205's ability to both track, and maintain a lock on, your position is better than anything before it. After an intial battery charge, our product tester had the 205 on his wrist and was tracking speed and distance with GPS satellites within 3 minutes. The next time we used the 205, satellite acquisition was nearly instantaneous. A run through dense trees didn't faze the unit either; tracking remained true and steady. Performance on a bike was equally impressive. Whatever witchcraft has been cooked up by the designers of the SiRF technology, we like it!The simple docking cradle makes charging and data connectivity a snap (Forerunner 305 model shown).While the Forerunner 205 isn't billed as a GPS navigation device, it does have some rudimentary mapping, waypoint marking, and routing capabilities. In addition to marking locations along your journey, you can zoom in or out of a simple map that displays your current direction and path. There's also a \"go to location\" feature that routes you back to your starting location, or to any location you have defined. Once you have defined several locations, you can save this information as a route, allowing you to travel the same path in the future. As you'll see below, the 205's new \"Courses\" feature gives you new levels of control over how you define your favorite runs and rides.Training FunctionsThe 205 is first and foremost a training tool, and its ability to organize a ton of data types into a user experience that is intuitive and simple is no small feat. Whiz-bang technology aside, if you can't use it and make it a natural part of your exercise routine, it's worthless. When it comes to these factors -- and here's the take home message on the 205 -- this device is successful where many other devices fail.The heart and soul of the 205 can be found on the data screens, which give you real-time information about all aspects of your workout. In fact, the 305 can display a dizzying array of data, such as calories burned, distance, elevation, grade, and heading, as well as multiple lap and pace modes.Thankfully, the device makes it easy to define how much or how little data you want to view during a workout. You can arrange the data that's most important to you and then make that data appear front and center on the device. Indeed, within a few minutes of skimming the manual and fiddling with the device setup, you'll have your most important data displaying just the way you like it.Garmin's Virtual Partner function was cool feature of previous Forerunners and they've decided to keep a good thing going with the 205. If you're the type that performs best when you've got a competitor egging you on, you'll love this function, as it allows you to set up virtual running or biking companions that compete against you.If you're looking for an complicated workout with a variety of intervals and intensity levels, or just a quick three-mile jog against your best time last week, the 205 has you covered. Navigating to the Workouts menu on the device yields three options: Quick Workouts, Interval, and Advanced Workout. A quick workout is just that; set the distance and time, distance and pace, or time and pace of your planned workout and off you go. Interval workouts are just the same, but they allow you to add repetitions and rest between them. When you really want to get fancy with your exercise, you can step up to advanced workouts, which include goals for each workout step, as well as varied distances, times, and rest periods. You can use the Garmin Training Center software to set up these workouts and then upload them to the device.PC Connectivity and SoftwareGarmin has been outfitting their devices with USB connectivity for some time now -- a welcome move for those who struggled with serial port connections in the days of yore. Thanks to USB, the 205 integrates seamlessly with the Training Center software and we quickly had workout history uploaded and stored on the PC.In a first for the Forerunner series, the Training Center software also lets you define courses on your PC that you can upload to the device. When course information is combined with uploaded workout information, the Forerunner becomes a complete guide, telling you where to go, when to make a turn, and what kind of workout to do when you're on the road or path. Back on the PC, the software's ability to overlay workout data on maps of the course makes it easy to see where the course offers up the tough hills and the easy recovery spots. Plus, the ability to track historical performance on a given course is a great way to measure your improvement.The 205 is also fully compatible with Garmin's MotionBased service, which takes your training to another level by connecting your data with the Internet. While we weren't able to use the service, the promise of sharing courses, maps, workouts, and performance data with other users is intriguing. And if you're a serious endurance athlete, you'll be glad to know that the 205 is also compatible with TrainingPeaks.com, an easy-to-use web based training system designed to help athletes train for any event.ProsRadically new design is better in every wayAmazing accuracy and fast satellite acquisition timeSo simple to set up and use, you will actually use itConsOkay, it's bigger than a sport's watch -- but so much more powerfulWhat's in the BoxForerunner 205, Garmin Training Center CD-ROM, docking cradle, expander strap, A/C charger, USB cable, owner's manual, quick start guide.", "title": "Garmin Forerunner 205 GPS Receiver and Sports Watch (Discontinued by Manufacturer)", "price": 173.27, "imUrl": "http://ecx.images-amazon.com/images/I/41u1PrJyqlL._SY300_.jpg", "related": {"also_bought": ["998379683X", "B000E65HXA", "B000CSWCQA", "B000G687AS", "B000MM3EKY", "B000ONDECY", "1891369903"], "buy_after_viewing": ["B0025VKUPM", "B0025VKW5K", "B003JNYULA", "B000G687AS"]}, "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Running GPS Units"]]}