{"asin": "B001SER460", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "For those with a taste for adventure, there&rsquo;s a camera as bold as the active life you lead. It&rsquo;s the Canon PowerShot D10. Waterproof, freeze-proof and shockproof; it&rsquo;s tough enough to take what you dish out. Plus it&rsquo;s got all the high performance features you expect from a Canon digital camera. You&rsquo;ve got 12.1 megapixels of resolution plus all of Canon&rsquo;s powerful, state of the art imaging technologies so you can capture your epic experiences in breathtaking color and awesome detail.PowerShot D10 HighlightsTake this camera anywhere: waterproof, cold resistant and shockproofLife can take you almost anywhere. So Canon engineered a digital camera durable enough to go where you go and produce the kind of awe-inspiring images that will earn your respect. It&rsquo;s the PowerShot D10 and it's no ordinary digital camera. This unique camera is waterproof down to 33 feet so you can take it scuba diving, snorkeling or surfing. It&rsquo;s freeze proof and can withstand extremes of temperature from 14-104 degrees (F) so it&rsquo;s also ideal for snowboarding, mountaineering and more. Plus, it&rsquo;s shockproof to 4 feet, so when the going gets rough, the D10 will keep going strong.Unique accessories available such as customized straps and interchangeable faceplatesYou&rsquo;re always up for any challenge. So Canon designed the PowerShot D10 with a selection of versatile accessories (sold separately) that enable you to outfit the camera to meet the requirements of your next adventure. The customized strap is a perfect choice for those who want to have their camera within easy reach, yet keep their hands free. The Canon faceplates let you distinctively mark the camera as belonging to you alone. The carabiner hook offers you a handy way to securely suspend the D10 from a belt, backpack or diving harness.A World of Advantages with Canon&rsquo;s TechnologyDIGIC 4 Image Processor has evolved Face Detection Technology that tracks the faces of moving subjects and lets the shooter enter the frame seamlessly with the Face Detection Self-Timer.DIGIC 4 Image ProcessorCanon&rsquo;s most advanced image processor, DIGIC 4, delivers evolved Face Detection Technology that keeps every face in every photo looking its very best. The technology finds and tracks the faces of moving subjects until you&rsquo;re ready to shoot, then delivers perfect focus. In addition, exposure, flash and white balance are compensated, so that faces exhibit natural skin tones and backgrounds are properly exposed.iSAPS Technologyis an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the advanced DIGIC 4 image processor to improve focus speed and accuracy, as well as exposure and white balance.AFace Detection Self-Timerautomatically detects an increase in the number of faces and makes the appropriate adjustments. For instance, to include the photographer&rsquo;s face in a group shot, there&rsquo;s no need to rush in. Just put the camera on a stand or tripod, specify Face Detection Self-Timer, and the camera will wait for the photographer&rsquo;s face to get on-camera before it takes the shot. Motion Detection tracks moving subjects in a much larger range--allowing you to wait for the perfect shot without refocusing.Intelligent Contrast CorrectionDIGIC 4 also makes possible the i-Contrast (Intelligent Contrast Correction) system, which controls the compensation level in pixel units to brighten dark areas while leaving bright areas unchanged for better images where the main subject is dark, and more natural transition. The PowerShot D10 can even use i-Contrast in playback mode to adjust images that were shot without the setting activated.Red-eye Correctionprovides three options for removing red-eye from subjects in flash pictures.1) Red-eye Correction during shooting actually identifies and corrects red-eye in human subjects as pictures are taken.2) The PowerShot D10 can be set to automatically detect and correct red-eye during image playback.3) You can manually locate any red eyes in a scene during image playback on the LCD screen, and command the camera to remove them.Life doesn&rsquo;t give you second chances to capture special times. That&rsquo;s why the PowerShot D10 features ISO 1600 setting that reduces the effects of camera shake and sharpens subjects in low-light situations, giving you greater shooting flexibility. ISO can be expanded to 3200 when you select ISO 3200 Special Scene mode.12.1 megapixels, plus 3x optical zoom lens with Optical Image StabilizerWith the PowerShot D10, dramatic, personal pictures have never been easier to shoot and share. This 12.1-megapixel camera lets you create impressively large photos of family and friends you&rsquo;ll be proud to display. The high-resolution images taken by the D10 can be enlarged up to 13 x 19 inches.The PowerShot D10 has a 3x optical zoom that gives you the power to shoot distant subjects with razor-sharp precision and stunning lifelike color.The PowerShot D10 is equipped with Canon&rsquo;s acclaimed Optical Image Stabilizer Technology that automatically detects and corrects camera shake--one of the leading causes of fuzzy or blurred shots. Even when zoomed in, you can get the steady, crisp, brilliant images you&rsquo;ll be proud to shoot and share. And Canon&rsquo;s Optical Image Stabilizer Technology is so convenient to use. It functions perfectly with or without a flash.Blink DetectionNothing ruins a great picture more than having your subjects&rsquo; eyes closed. That&rsquo;s why the PowerShot D10 is equipped with Blink Detection. If closed eyes are detected, a \"blink warning\" icon appears for 3 seconds, allowing you to retake the shot before your subject or subjects move on. Blink Detection provides you with extra assurance when capturing once-in-a-lifetime moments like planting the flag at the summit of the mountain.Smart AUTO intelligently selects the proper settingsJust set the Canon PowerShot D10 to Smart AUTO and you&rsquo;re ready for maximum enjoyment from your picture taking every time. It&rsquo;s a relaxing and satisfying way to shoot because you can completely concentrate on your subject knowing that the camera has the technical details covered. Advanced Canon technology intelligently analyzes your situation and shooting conditions. Then it automatically selects an appropriate setting from 18 specially defined settings. So whether you&rsquo;re photographing flowers, a captivating sunset, or your friends at the park, you can be confident that you&rsquo;re getting dramatic, memorable images.Shooting ModesAdvanced presets for the best possible photos under certain conditions. With 19 Shooting Modes including 16 Special Scene Modes, you&rsquo;re ready for whatever shot comes your wayWhat's in the BoxPowerShot D10 bodyLithium-ion battery pack (NB-6L)Battery charger (CB-2LY)Wrist strap (WS-DC7)Digital Camera Solution CD-ROMUSB interface cable (IFC-400PCU)AV cable (AVC-DC400)", "title": "Canon PowerShot D10 12.1 MP Waterproof Digital Camera with 3x Optical Image Stabilized Zoom and 2.5-Inch LCD", "price": 329.0, "salesRank": {"Camera &amp; Photo": 3116}, "imUrl": "http://ecx.images-amazon.com/images/I/41YlZjywPRL._SX300_.jpg", "related": {"also_bought": ["B002P9127O", "B003CK10DG", "B0064L8L3M", "B0051IICYC", "B003VNKNEQ", "B0037T6O6A", "B0051IICBA", "B001FA09WI", "B0075SUKIC", "B004GLBZC6", "B004J3V8UU", "B0015DNIOG", "B003VNKNF0"], "buy_after_viewing": ["B0075SUKIC", "B003VNKNF0", "B00I58LNF0", "B003CK10DG"]}}