{"asin": "B0007P8FN2", "description": "In the ancient, mysterious world of the Jade Empire, you train under your master's watchful eye and learn powerful martial arts and mystical powers. When danger threatens, you travel across the world, from the harsh mountains of the Land of Howling Spirits to the lush gardens of the Imperial City. In your adventures you face powerful human and supernatural foes, learn exotic and magical martial arts, and discover the darkest secrets of the world. Only by mastering the greatest fighting styles and defeating the most powerful enemies will you earn your place as a master of martial arts in the world of Jade Empire.Features:Epic story set in a world inspired by the myths and legends of ancient China. Jade Empire immerses you in a deep, rich storyline in the tradition of the BioWare-developedStar Wars: Knights of the Old Republic.Sinister events upset the peaceful harmony of an isolated martial arts school and draw you into a story that unfolds with drama, action, and adventure. Detailed followers and other non-player characters enrich the adventure by providing comic relief, rivalries, flirtations, and hostility. Stare in awe at the sweeping views of the lush environments, sheer vertical drops, and overpowering scale that provide the visual backdrop to the story. Confront wild outlaws, evil magicians, demonic incarnations, and other foul villains that protect the Jade Empire's darkest secrets.Become a martial-arts master. Using the knowledge gained in crafting multiple story-based role-playing games, BioWare sends you on a journey to become a martial arts master. Choose a character with a unique appearance and quirks, a custom voice set, and a powerful combination of ability scores and fighting styles. You can choose to act for good or evil, and these decisions build your reputation, which precedes you throughout the land, changing the course of interaction with other characters and followers. Take the role of a master of martial arts and recruit followers to your cause in an interactive, living world.Innovative fighting system. Master fighting styles and mystical powers. Jade Empire provides a gameplay experience with the tempo and fury normally found in Hong Kong cinema favorites such as Crouching Tiger, Hidden Dragon and the Bruce Lee classics. As you journey through Jade Empire, you can upgrade your starting combat style or learn entirely new styles to tailor a character for your specific gameplay preferences. Select from dozens of fighting styles, including (for example) martial-arts styles (Legendary Strike, Leaping Tiger), magic styles (Tempest, Dire Flame), transformation styles, and weapon styles (Twin Axes, Staff, and improvised weapons like chairs). Each style has its own tactical role and attacks that range from punches and kicks to weapon strikes, mystical powers, and even transformations into supernatural monsters! You can focus on a narrow channel of styles and become dominant in these forms or broaden your area of study to include a wide variety of styles adaptable to many combat situations. Combat is fast-paced martial-arts action, and it is exciting and tactical as you rapidly switch fighting styles to meet diverse challenges.", "price": 200.98, "imUrl": "http://ecx.images-amazon.com/images/I/511SCEChW-L._SY300_.jpg", "related": {"also_bought": ["B000067DPM", "B0002B90SA", "B0001UEHP8", "B001ELWMHI", "B00006IJIS", "B0000AOE9K", "B00006LU9C", "0761547207", "B0007PIEA6", "B00005OWBL", "B0002SQ0BS", "0761547487", "B00006LEMQ", "B00008XKZM", "B00009ZVHR", "B00078W0BM", "B000B2YR74", "B00005Y404", "B00009ZVHU", "B000E61G4O", "B00009M987", "B00008H2IU", "B0002A6CQY", "B00009X3V0", "B0000A1OG8", "B0009351RK", "B0009UC68U", "B00005NZ1G", "B0007ZD794", "B000192C38", "B00IEYG1AC", "B00005LOXE", "0761550895", "B00005RCQ5", "B000641ZCM", "B0007SL202", "B00ICWO1XA", "0761542299", "B000F3Z59S", "B00006JZQZ", "B0006I5I58", "B00008G75X", "B0007PIEAQ", "B0000C6EDM", "B0007OGDHS", "B0000C7GH4", "B00J22635I", "B00008G886", "B00013K5P6", "B00006C296", "B00019HNN2", "B0000A92KZ", "B00005RKO7", "B00JUFT3JA", "B0002HDSZU", "B00006C260", "B0002A2S26", "B0006SST9U", "B00008XKZH", "B00009M7Q8", "B000B6MLZK", "B0000DJX7I", "B0002OOV40", "B00005NZ1T", "B0008JILX6", "B0002IZICK", "B001I020CW", "B00007F8PB", "B0045ZIEPY", "B00082ZQZY", "B005SMPTHY", "B000087L4G", "B0009O7HUS", "B0001XAO4S", "B0001ADAMO", "B0002GTFIK", "B000ETUF0W", "B0006ZJPSC", "B002Q21X7Y", "B00006IKCC", "B0002EJ852", "B00005NZ1K", "B00020BV1A", "B00097IA88", "B000ZJVDA2", "B002B5FQC4", "B0000A1OG4", "B0002IJY2U", "B0001JXQ5Q", "B00C3MK9BS", "B00006ZCD1", "B00006C28W", "B0000640A9", "B0009SQFHA", "B00129I75I", "B0000C6EDL", "B000930DP0", "B000930DLE", "B0001I9YFS"], "bought_together": ["B000067DPM", "B0002B90SA"], "buy_after_viewing": ["B0006ZJPSC", "B000067DPM", "B0001UEHP8", "B0002B90SA"]}, "salesRank": {"Video Games": 5888}, "categories": [["Video Games", "More Systems", "Xbox", "Games"], ["Video Games", "PC"]]}