{"asin": "B001JKTTVQ", "related": {"also_bought": ["B005UL1B34", "B0029ERWH4", "B005UKRRKG", "B00FORNVGO", "B001C6H6F8", "B00HHA4DL8", "B00B58DLY8", "B005UKZAJG", "B006HCJXBM", "B006GTKSHY", "B00K7PMA60", "B00K7P74GQ", "B005UL3LVY", "B00EOFEKF8", "B004X1QY20", "B0061KQEVW", "B00IIG7UQ0", "B003K16SYI", "B009Q1YPVY", "B005UKOXMG", "B00KVBZAXK", "B0092SVTGA", "B004HSO124", "B003K16T06", "B0061KQF2K", "B003DVNKU0", "B008GOR6O0", "B0072CSNSU", "B00K67AQN8", "B00FYUX3Z0", "B008FX7B9M", "B0034KYDPG", "B0052Z8BH2", "B007GMJ8Z8", "B002QFGKUQ", "B000V6DMUS", "B00HF6SJVY", "B008B2Z94Q", "B00C066MRW", "B003EBNLIA", "B00373DIYM", "B00B8MJ2MG", "B00B1ZRTP2", "B00D3KP69O", "B00IOWYHJ6", "B002QANC2A", "B001TK1I4M", "B005HJ0QLC", "B0068Y0EXK", "B00G5EZI3E", "B002QFGQAK", "B003K16T1K", "B00GR4TPW2", "B00F4VX9G2", "B004MGAGP2", "B00BMW24TU", "B00IJ3LG94", "B00D0NLJM2", "B002TPQPEE", "B00HLG1VM2", "B00EL1HZ34", "B00HKA110G", "B00K8SBAGC", "B004FAJFDO", "B00E7LQHZ0", "B00HLEI8FW", "B006LT7A7U", "B00D3KXYS4", "B009WI3RZQ", "B00D3KU8AG", "B00B4YVU4G", "B007OX0RBS", "B00FORO1P4", "B00IHQQGKM", "B00I52JGWS", "B004BCXAM8", "B00FVGS3W0", "B00112BUBO", "B002XXAUE8", "B00HWR1OZ4", "B00B2I7Z0C", "B005IHSO2Q", "B004BPVF7W", "B001DTKQEM", "B005AN8BZ8", "B00FORNYMU", "B00D3KY6U4", "B00HLF8C3O", "B006R1HC3Y", "B004Y9M81W", "B006UET4XE", "B00K8QF41Q", "B00D3KQIIM", "B002XGWPHK", "B006OZF4KG", "B00HLF8E2S", "B005CYJBPY"], "also_viewed": ["B00EYZR3E8", "B0067F8BBM", "B00FVGS3W0", "B001HKR6WM", "B00KXOLTD0", "B00K8SBAGC", "B00JFLRCOW", "B005IHSO2Q", "B00LY1KX2E", "B00IZZ7RTO", "B00J00OP5W", "B00ELAA8NY", "B0064X6DC6", "B00KWSCOZO", "B005IHS8KY", "B00BMARRIA", "B00KN04CD8", "B00JQV5P1S", "B0088AR2IM", "B00JL7AQES", "B005UKZAJG", "B008148R8E", "B00HWR1OZ4", "B00BJOXW9M", "B00K3M4T0C", "B00EOFEKF8", "B00B8P5CTA", "B00GJXGMT0", "B005TKZS76", "B00ITJFE64", "B00KLREGQ6", "B00B58DLY8", "B008GOR6O0", "B0095BGU6I", "B004TSFBNK", "B00HQ8MA70", "B0030HMQTS", "B00KVBZAXK", "B0032DHP6O", "B0061JQY40", "B002XXAUE8", "B00K7P74GQ", "B004TSFE28", "B0029ERWH4", "B00EZ80KIU", "B00H2YL8W6", "B001C6H6F8", "B00BWB3YTA", "B00L0R8KK4", "B00J921XM4", "B00KLREIJQ", "B006HCJXBM", "B004BPVF7W", "B00CXDVRU4", "B003ZX32ZO", "B005UL1B34", "B00J5A8BV6", "B00KA5QF6I"], "bought_together": ["B005UL1B34"]}, "title": "SHANY Professional 13-Piece Cosmetic Brush Set with Pouch, Set of 12 Brushes and 1 Pouch, Red", "price": 12.95, "salesRank": {"Beauty": 248}, "imUrl": "http://ecx.images-amazon.com/images/I/51k5sxas3yL._SX300_.jpg", "brand": "SHANY Cosmetics", "categories": [["Beauty", "Tools & Accessories", "Makeup Brushes & Tools", "Brushes & Applicators"]], "description": "The SHANY Professional 13-Piece Cosmetic Brush Set with Pouch (Set of 12 Brushes and 1 Pouch, Red) provides a complete assortment of brushes for makeup applications. Made from a combination of natural animal hair and synthetic hair, the set includes 12 key brushes that are soft and silky to the touch. Animal hair brushes apply makeup evenly and are easy to clean. For convenient storage and portability, the brushes come with a handy organizer pouch.Professional 13-PieceCosmetic Brush Setwith PouchAt a Glance:Basic set of 12 professional-grade cosmetics brushesNatural animal hair is soft, durable, and does not hold colorEasy to clean and dryConvenient storage pouch for easy organizationHandmade; SHANY logo engraved on the long handlesHandmade from natural animal hair and synthetic hair for even application.View larger.Complete Set of 12 Professional-Grade BrushesThis brush set features brushes used for applying powder, foundation, blush, and eye shadow. It also includes concealer, lip, spoolie, and mascara brushes and a dual eyebrow brush/lash comb. Each brush is designed with long, easy-to-grip handle for precision during application.Handmade from Animal Hair for a Soft, Silky FeelThe cosmetics brushes are made from a combination of natural animal hair and synthetic hair, so they are soft and silky on top, yet firm and durable on the bottom. The brushes allow you to apply colors smoothly, while pigment does not cling to the hairs after application, so you can blend and reuse colors without cleaning every time.Handmade with precision, each brush in the set is engraved with the SHANY logo.Easy to Clean and DryYou do not need to clean these brushes frequently, but when you do wash, it's easy--simply run the brushes under warm water, clean them with your favorite shampoo, and rinse thoroughly. You can let your brushes air dry or use a hair dryer for quicker results. Brushes should be cleaned once before first use.Storage Pouch for Organization and TravelFor easy organization, the brushes are packaged in a slender folding pouch, that you can toss into your gym bag or purse. Each individual brush arrives packaged in clear plastic wrap to protect from dirt and dust.About SHANY: Sleek. Sexy. Breathtaking.With a commitment to high quality, SHANY creates a variety of makeup kits, cases, and accessories. Offering easy accessibility to professional-quality makeup and accessories for at-home users, SHANY assembles and hand-selects every item in their assortment of makeup collections. All shadows are formulated with a natural mineral oil base and packaged in recyclable plastic. SHANY is a proud member of People for the Ethical Treatment of Animals (PETA), and does not test any makeup on animals. No animals are harmed to create these natural brushes.What's in the BoxSHANY Professional 13-Piece Cosmetic Brush Set with Pouch (Set of 12 Brushes and 1 Pouch, Red).Cosmetic Brush SetsStudio-QualityNatural CosmeticBrush SetEco-NaturalCosmetic Brush SetProfessionalCosmetic Brush Set&#xA0;"}