{"asin": "B0000A0AJH", "description": "Offering a downright amazing feature set for such an affordable price, Cyber Home's compact CH-DVD 300S makes a rich and promising starter player. You get everything from top-of-the-line progressive-scan component-video outputs to built-in MP3 decoding, JPEG image viewing, and 3:2 pulldown for viewing movies in their native frame rates.Whether your living room is currently home to an HDTV or you're merely thinking of \"someday,\" the CH-DVD 300S stands ready to deliver the full potential of DVDs. Progressive scanning, referred to as 480p for the number of horizontal lines that compose the video image, creates a picture using twice the scan lines of a conventional DVD picture, providing higher resolution and sharper images while eliminating nearly all motion artifacts. Composite- and S-video outputs bring compatibility with nearly any television.With 3:2 pulldown support, the player corrects for a common distortion in DVDs when 24 frames-per-second movies make the leap to 30 fps video; 3:2 pulldown removes the redundant information to display a film-frame-accurate picture.A set of multichannel analog-audio outputs routes decoded Dolby Digital and DTS 5.1-channel surround signals to your audio/video receiver. Dolby Digital and DTS signals can also be channeled through the player's digital-audio outputs (one each of RCA coaxial and optical) for direct connection to a surround-featuredAV receiver. The player has left/right analog audio outputs, too.The CH-DVD 300S is compatible with DVD-R/-RW and DVD+R/+RW media, handling just about any recordable disc you give it. It can even play both PAL- and NTSC-formatted discs, handy when viewing non-region-specific European discs. Other features include motion zoom, screen saver, last-disc resume, and repeat play.What's in the BoxDVD player, AC power cord, multi-function remote control, remote batteries, and a composite-video/stereo analog-audio interconnect.", "title": "CyberHome CH-DVD 300S Progressive-Scan DVD Player , Silver", "price": 33.0, "imUrl": "http://ecx.images-amazon.com/images/I/31CCYSEC5TL._SX300_.jpg", "related": {"also_viewed": ["B00A71YOQI", "B007BYLO4E", "B007S71NZO", "B003EX0BVS", "B004CYWVAM", "B0087FQPP4", "B004612IWM", "B002N2LNM2", "B007F9XHBI", "B00GXTUTN0", "B00H5C3W38", "B00KQ5LERM", "B00FW7ATEI", "B008PB8XN2", "B004LNMAAA", "B008MWLHY6", "B0012KHNZW", "B003ANVQWU", "B004BI6MVS", "B006N70DOM", "B007F9XHAY", "B00FX6WVSA", "B001IBHUU8", "B00JE6UIUS", "B0045PKK60", "B0039XRUBM", "B00BN9CH26", "B001BQD5QS", "B003LWXJ2A", "B00FX4CW8Q", "B003JN3ITA", "B0046W556M", "B002WHFMN4", "B004K3C9JI", "B008MWLHX2", "B003E4M4WQ", "B00K2B5BK6", "B0089KJPM2", "B00DCFZ5P0"], "buy_after_viewing": ["B007F9XHBI", "B00A71YOQI", "B007BYLO4E", "B007BYLO4E", "B007S71NZO"]}, "categories": [["Electronics", "Television & Video", "DVD Players & Recorders", "DVD Players"]]}