{"asin": "B0036J1S1W", "description": "Acoustibuds are soft, flexible tips that fit over the flat speaker face of your earphones. Acoustibuds flexible tips maximize bass, improve noise isolation, add comfort and help keep earphones from falling out. Personalize the fit of your earphone and Bluetooth devices while improving the sound quality. Acoustibuds fit original style, flat faced earphones sold with Apple iPod, iPhone, Microsoft Zune, Sony and many other MP3 players. Acoustibuds also fit many replacement earphones and Bluetooth headsets that are noted in our compatibility list. They are not designed to fit Apple Ear pods or earphones that come with stem mounted tips. Package contains tips only, earphones are not included. Made in the USA. The shape of your ear is unique, and no rigid earpiece is going to fit you as well as cushy, soft Acoustibuds tips. Acoustibuds' flexible fins conform to the unique shape of your ear canal and create a gentle seal for better bass fidelity and sound isolation. Acoustibuds come in different sizes to fit a wide variety of ears and to produce more or less sound isolation. As the fins grip the walls of the ear canal, they resist sweat and tugs on the speaker wire, keeping your earphones in place. Acoustibuds are not like other in ear headphones. Many in ear headphones offer flexible bulbs mounted over a rigid tubular stem. Acoustibuds' flexible sound port gathers sound waves from the speaker and funnels them into a trumpet shaped passage into the ear canal. By avoiding abrupt changes in shape and direction, the sound port helps eliminate reflections that cause earphones to sound ''tinny\" Because they are flexible, Acoustibuds can bend and direct sound waves into a wide variety of unique ears.", "title": "Burton Technologies ABR-BLACK Acoustibuds Original Flexible Tips for earphones and Bluetooth, 3 Pair, 3 Sizes, BLACK (Discontinued by manufacturer Replaced by Acoustibuds Model EPB)", "price": 36.99, "imUrl": "http://ecx.images-amazon.com/images/I/41vTbaoiY2L._SX300_.jpg", "related": {"also_bought": ["B00G6H5N7Q", "B002QDCP3Y", "B0047Y1HMK", "B00G9AU6KE", "B00659KQSG", "B001DYUV0Q", "B001GPCBPU", "B00B4YD2P6", "B009XHM2Y8", "B00HK8V694", "B007BWCDYQ", "B001LU9SEW", "B004CN91Q0", "B00GQUHTMU", "B00BIJTN5K", "B003C7E3NI", "B00HK8V74I", "B004Q6Y32U", "B005HKE4VO", "B00AFGP5MM", "B003MZ6450", "B003MCSVI6", "B0041DECI8", "B005KNUJZ8", "B00C0M5A1A", "B00ANSKT2I", "B00GEPOXG2", "B006SJL4VG", "B00DJBZKDE", "B00AIRUOI8", "B006T9TIYK", "B00428N9OK", "B0095PS6TI", "B008SFSIXU", "B007X8LGCS", "B00GQS95ZQ", "B00FEQ1428", "B00A8ML9S2", "B00AM8CSPK", "B00DTQWO56", "B00E4JT1CQ", "B0075D1NEW", "B00EPUUY02", "B005WGFECQ", "B004JLOJSA", "B004X2IHN8", "B007UR1PIC", "B00DV9O0GC", "B00H2QUBMW", "B00ELCP55I", "B009A5204K", "B002BH3I9U", "B007WIB0R0", "B00D1MDY98", "B00E0GRRR4", "B009M27MB2", "B00E5HXJEI", "B004WSWX92", "B005MHGBX6", "B00GBEAMDE", "B00E6AQ96Y", "B00GTGETFG"], "buy_after_viewing": ["B0047Y1HMK", "B00G6H5N7Q", "B00G9AU6KE", "B002QDCP3Y"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphone Accessories", "Earpads"]]}