{"asin": "B000EXVTJY", "description": "See There When You Can't Be ThereThis camera can be viewed and controlled from a standard Web browser, video display, or even a compatible cell phone or PDA. Place it in your home, office, vacation home or almost anywhere else that you'd like to keep an eye on things, with no PC required on location! They are easy to install and operate and require no additional software for the PC that you're viewing them on. Each camera also comes with a free web address, which can track the camera automatically. All you need is a regular web browser to view them on your PC--all of the other required software, including control software (TCP/UDP) and e-mail software (SMTP), is already inside the camera.Just Plug It In and PlayThis network camera is easy to install and use. With industry standard automatic configuration (UPnP), the camera and your router or PC will automatically decide the best settings, allowing you to access your camera without any complicated setup. Once connected, using a simple web browser, just enter in your free, permanent web address and you're done! It's that simple.Sensor Recording and Email AlertsWith the built-in motion sensor, the camera can be set to record and/or notify you by email when someone enters the room.And Now You Can Watch Your Pets!Always feel close to your animals, whether at work or on vacation. Did the walker show up as promised? Is the dog sleeping on the sofa? Is the cat scratching your new leather chair? You'll know instantly with this webcam.", "title": "Panasonic Network Camera and Pet Cam (BLC1A)", "price": 199.99, "imUrl": "http://ecx.images-amazon.com/images/I/314YG1A0JEL._SY300_.jpg", "related": {"also_viewed": ["B004IWPX76", "B0002GS4Z0", "B000FBOF96", "B009MKVHOC", "B001BBS7ZW", "B00CZ7K3N0", "B00CL3JTRO", "B002JLZMN8", "B007CJJZMG", "B000NVR9SM", "B008TSB2C0", "B006P88VSE", "B00452V66G", "B0017T7Q00", "B008SHK7W8", "B00HF3X5RU", "B009XP1HS2", "B009AR2MQO", "B00F9FCW7K", "B00H2VEN0I", "B00C9KOWA8", "B002JM5JSU", "B006ZP8UOW", "B006I0KL6Y", "B00BHBW8AQ", "B001BBR546", "B000NEPJPY", "B008SHK7BY", "B000OLIO44", "B00J38NVHE", "B004P8K24W", "B00C97AF16", "B00CL8FA4A", "B00CSOOGXS", "B00BIX0ZSA", "B00F3KWZW8", "B0017U4U0S", "B0081S94WS", "B0061MNRW4", "B006ZPWS4U", "B0037W6TX0", "B00FWD090Q", "B00130BSVG", "B009SPUY5O", "B0017U8FTU", "B00EL0IE1W", "B008SHK7Z0", "B0061MU0A6", "B007X5MZKS", "B000RZUUWG", "B003QLGZ04", "B002OHDFOA", "B009UOLJ20", "B008SHK6KG"], "buy_after_viewing": ["B00F9FCW7K", "B006P88VSE", "B00452V66G", "B006ZP8UOW"]}, "categories": [["Electronics", "Camera & Photo", "Video Surveillance", "Surveillance Cameras"]]}