{"asin": "B000WQ3838", "description": "The fifth game in theMidnight Clubseries,Midnight Club: Los Angelesbrings the popular simulation racer to next-generation consoles for the first time. Developed by Rockstar Games, developers of theGrand Theft Autoseries, it is packed with an incredible selection of muscle cars, tuners, exotics, motorcycles, luxury cars and an incredible selection of after-market performance parts and custom kits. Enter the ultimate world of Illegal street racing with no track, no load times, no rules: Welcome back to the Midnight Club.Ready to roll at 245 mph?Roll in muscle cars, exotics or tuners.View larger.Or dust them all aboard a rice rocket.View larger.Race past accurate LA landmarks.View larger.Reach out and touch startling detail.View larger.Check out multiple in-game angles.View larger.Remember to keep an eye open for cops.View larger.A Wide-open LA Like You've Never ImaginedMidnight Club Los Angelesdrops players into a painstakingly recreated version of world-famous Tinseltown. Broken down into five distinct open-world gameplay areas, linked on the game map, cumulatively these areas comprise a massive area, much larger than anything ever seen in previousMidnight Clubreleases and possibly larger than any existing racer to date. Within these areas, Santa Monica, Beverly Hills, Hollywood, Mulholland Drive and Downtown LA, players are free to engage in mission play driving them to attain and customize a wide range of authentic world-class street racing vehicles, or to simply explore the city, taking on all comers in a variety of race types as they wish. Regardless, along the way they will experience not only the visual realism of the iconic boulevards, freeways, and landmarks made famous in TV and movies, but also the realism of the living breathing LA urban experience. Here traffic backs up then clears as people go to and leave work for the day, weather systems come and go and day turns to night, then back again. All the while the race goes on. It's all part of the living, breathing LA. It's all part of theMidnight Club.The CarsMidnight Club: Los Angeleswill feature an astounding selection of vehicles in the Muscle Car, Exotics, Tuners, Motorcycle and Luxury car categories. At the time of publishing only a fraction of the total list has been announced, but a good sampling of what players can expect at launch can be seen below. Click the links in each category to see screen shots of the cars:Muscle Cars&nbsp;&nbsp;&nbsp;Saleen S302 Extreme&nbsp;&nbsp;&nbsp;Chevrolet Corvette Z06&nbsp;&nbsp;&nbsp;Dodge Challenger Concept CarBikes&nbsp;&nbsp;&nbsp;Kawasaki Ninja ZX14Exotics&nbsp;&nbsp;&nbsp;Aston Martin V8 Vantage Roadster&nbsp;&nbsp;&nbsp;Ford GT&nbsp;&nbsp;&nbsp;Lamborghini Gallardo SpyderTuners&nbsp;&nbsp;&nbsp;Volkswagen R32&nbsp;&nbsp;&nbsp;Pontiac Solstice&nbsp;&nbsp;&nbsp;1999 Mitsubishi Eclipse GSXExtreme CustomizationMidnight Club Los Angelescontinues the tradition of offering some of the deepest vehicle customization you will find in any video game. The hottest licensed cars and bikes in the world are at your disposal - kit them out, supe them up, and personalize them down to the last detail to make them all your own. Visitthe Club'sin-game garages located in Hollywood and Santa Monica and let your imagination run wild - tweaking and fine tuning through the following three different types of vehicle modifications:Performance &amp; Handling- To become a street legend, you're going to have to tune your vehicle for maximum performance. The garage offers three levels of upgrades for virtually every component on your vehicle, but it's up to you to craft the winning combination that will give you the edge on the competition.Exterior- For the Midnight Club, stunting is a habit and its clandestine Los Angeles garages have all the toys needed to ensure heads turn in this jaded town. From making sure your car is dripping in candy paint, to adding unique body kits and jaw dropping extras, the garage offers practically limitless possibilities to personalize your vehicle with aftermarket accessories and customizable options.Interior- Don't embarrass yourself by pulling up with an outrageously kitted-up car that has a 'me-too' factory interior. Not a good look! You're going to be spending a lot of time behind the wheel, so renovate and make yourself feel comfortable.Beware or Befriend the Local CompetitionThe street racing scene ofMidnight Clubis tough, but tight, meaning that everyone that you meet in expansiveLos Angelescould just as easily be an ally as an enemy. One thing is for certain though, they are all willing to throw down at the drop of a hat. Just a few of the faces you'll encounter out on the streets are:Karol, Age 45- A veteran of Moscow's underground street racing circuit, Karol moved to LA in the 1990's after the collapse of the Soviet Union. If you're looking for cars, he's your man. He owns two successful garages and claims to be able to get hold of any vehicle, no questions asked. He also sees himself as a philosopher and will bend your ear if you left him. He mostly races around Hollywood and the Beaches and his rides include a 1975 Datsun 280Z, 1969 Boss Mustang 302, 2006 Dodge Challenger and a 1971 Lamborghini Miura SV.Annie, Age 31- Annie has a rep as one of the fiercest drivers in the city. She detests posers and wannabes, is intelligent and sharp-tongued and pulls no punches when it comes to cutting the competition down to size. She has been spotted in everything from a 1983 VW Golf GTI, 2006 Pontiac Solstice, 2008 Chrysler 300C SRT-8, 2008 Audi RS4 and a 2004 Ford Shelby Cobra Concept and can usually be found hanging out near Pink's Hotdog Stand in Hollywood along with her crew.Rockstar Games Social Club: Join the CommunityBeing a Rockstar gameMidnight Club: Los Angelescomes with a huge commitment to the gaming community. To take advantage of all the benefits that come with this players should ensure that they join the 'Rockstar Games Social Club' to extend theirMidnight Clubexperience. Benefits will include, but are not limited to detailed player statistics, robust multiplayer leaderboards for all online games modes - plus a host of other special features, including in-game music download opportunities, to be announced at a later date. Simply create an account, link your PlayStation Network ID, set up your profile and you're in.Game ModesAs of the time of publishing Rockstar Games has not confirmed the gameplay modes that will be available forMidnight Club: Los Angeles, but multiple multiplayer gameplay modes, in addition to a deep singleplayer mode, are expected to be available with the game. As the game's launch date creeps closer please check back for further details.", "price": 71.95, "imUrl": "http://ecx.images-amazon.com/images/I/61rc5FR67zL._SY300_.jpg", "related": {"also_bought": ["B002MED6EO", "B000HKP88C", "B000RI17CA", "B003R7H5TC", "B000MUW98O", "B000TG72TM", "B001AZFSEW", "B003O6ECOM", "B00269QLH4", "B00198PO5I", "B003O680ZY", "B003JVCA9Q", "B00149V3CU", "B002I0HIMI", "B002I0K6DG", "B003IMGC9U", "B000WS97QI", "B00488PZ2S", "B000FPOJOS", "B004CVQUOI", "B00503E9FY", "B002ELCV00", "B00BU7WVCM", "B001AWBYNE", "B003O65TXU", "B002TDIEEK", "B0022TNO7I", "B003IEBO9Q", "B0002IQCSY", "B005UI9BT8", "B000WMEEBM", "B0037LVW9M", "B0012N5MIO", "B002I0J82G", "B0050SWSQQ", "B004EDJOYC", "B003MUNFW0", "B003O6E5OE", "B00386VMWI", "B000QAVV6G", "B0050SXKU4", "B001TOMQOY", "B0014G26WO", "B004Q8L46G", "B003O6CBIG", "B005JGC5BC", "B000JHMJDA", "B002EZH804", "B007NUQIGK", "B0050SWZHS", "B001TORSHO", "B0053BQU4G", "B003L8DXOI", "B003O6KWZK", "B00163LW7K", "B0036FDHT2", "B002I0K8SE", "B001NX6GBK", "B002BSA1C6", "B0028IBTLG", "B000HCMR8E", "B000ZK7ZOE", "B006VB2UMI", "B008P9IO2Y", "B002I0H2G0", "B0045U01OG", "B0012N94WO", "B002EE1P2W", "B000NJFMFQ", "B000EMJA3M", "B0037TPGHI", "B002I0K6Q8", "B007XVTR5S", "B003O6E1JS", "B004918C4M", "B003O6G8C6", "B001SGZL2W", "B006VB2UNC", "B0016PZYLS", "B005FYJB9M", "B005GM3XVA", "B000FII8KQ", "B006JKARN0", "B000R39GPA", "B0093FO2TS", "B000ZK9QCS", "B003P9C70E", "B0012NAPNQ", "B002BUSSTM", "B000X1TC0U", "B0053OMTVQ", "B0030F1DOO", "B0053BSOD6", "B002ACFYUM", "B0015AARJI", "B0017ZIIK6", "B002NN7AKU", "B003KZJA9Y", "B00519C7JC", "B00CMC6HCY"], "bought_together": ["B002MED6EO", "B006JKARN0"], "buy_after_viewing": ["B002MED6EO", "B002MED6F8", "B0050SXKU4", "B000EMJA3M"]}, "salesRank": {"Video Games": 8751}, "categories": [["Video Games", "PlayStation 3", "Games"]]}