{"asin": "B000MF4N42", "description": "Travel throughout North America without loading any more maps with the Garmin n&uuml;vi 680 Personal Travel Assistant with MSN Direct. Plus, you can receive door-to-door directions while staying on top of local weather, traffic, and more with n&uuml;vi 680. The device features a colorful widescreen, hands-free calling, and an FM transmitter, then takes it up a notch by adding dynamic content from MSN Direct, as well as a convenient digital travel kit that includes an MP3 player with sample MP3s, audio books, a picture viewer, a world clock, currency and measurement converters, a calculator, and more.This pocket sized personal travel assistant has a super bright, sunlight-readable color screen.See side view.Easy control via the simple touch screen.Weather reporting available with bright, colorful graphics.Despite being loaded with features, the n&uuml;vi 680 still allows you to navigate with ease. This unit comes ready to go right out of the box with preloaded NavTeq City Navigator NT street maps for North America, and includes a hefty points of interest (POIs) database with hotels, restaurants, fuel stops, ATMs and more. Simply touch the super-bright, sunlight-readable color screen to enter a destination, and the 680 takes you there with either 2D or 3D maps and turn-by-turn voice directions. This navigator voice even announces the name of exits and streets so you never have to take your eyes off the road, and can concentrate on your driving to keep yourself and your loved ones safe. In addition, the 680 accepts custom points of interest (POIs), such as school zones and safety cameras, and lets you set proximity alerts to warn you of upcoming POIs that require your special consideration such as speed zones and safety cameras.Speaking of keeping you safe, the n&uuml;vi 680 lets you make hands-free calls so you can talk freely during your worry-free driving. By integrating Bluetooth wireless technology with a built-in microphone and speaker, you can pair your n&uuml;vi with any compatible Bluetooth phone and talk hands-free while staying focused on the road. You no longer have to fumble with your phone's handset to answer a call or dial a number, just tap the 680's screen and you're instantly connected. And with 1-touch dialing for your POIs, you can quickly and conveniently call ahead to make reservations or get needed information.Simply insert a memory card to enjoy pictures, songs, and audiobooks.You can also use the mini-USB port for tranferring files directly to the memory card.The new n&uuml;vi 680 lets you get localized information with dynamic content from MSN Direct, making it one of the most resourceful navigators available. Using the included receiver and free trial service to MSN Direct, you can check your local weather, avoid traffic backups, compare local gas prices, and even check movie times and locations, all while you travel. Easy and virtually fool-proof to use, the MSN Direct receiver is plug-and-play portable so you can quickly connect to your navigator unit when you are out and about. All of which can be customized with configurable vehicle icons that let you choose individual car-shaped icons in a variety of colors that show your position on the map.In additional to all this functionality, the n&uuml;vi 680 includes many must-have entertainment and travel tools such as an MP3 player, an audio book player (subscription to Audible.com required), and a JPEG picture viewer so you can take your favorite music and pictures with you wherever you go. This unit also features a world travel clock with time zones, a currency converter, a measurement converter, and a calculator so that wherever you travel it will be easy to know what you are getting and keep track of your costs. The MP3 player lets you browse music by artist, album, and/or song, while the optional audio books may be purchased from Audible.com which features over 70,000 hours of audio programs. What's more, the n&uuml;vi 680 allows further customization via optional software such as a travel guide, savings programs and language translation on plug-and-play SD cards for all your travel needs.The Garmin n&uuml;vi 680 comes with a built-in, high-sensitivity, WAAS-enabled GPS receiver, and lets you view and operate it via its bright, LCD TFT touch-screen, wide-screen display that measures 4.3 inches (diagonal) and has a resolution of 480 x 272 pixels with 64,000 colors and a white backlight. As a whole, the n&uuml;vi 680 measures 4.9 x 2.9 x 0.9 inches (W x H x D), and weighs only 6.2 ounces for easy portability. This unit provides you with from three to seven hours of battery life (depending on use) via its rechargeable lithium-ion battery, and comes with Garmin Lock, which is an anti-theft feature to protect your investment. While you can add software via the SD card slot, the Garmin n&uuml;vi 680 also lets you interface via high-speed USB for loading data, though users should note that, like most USB mass storage devices, this unit is not compatible with Windows 95, Windows 98 or Windows Me.The n&uuml;vi 680 comes ready to go right out of the box with preloaded City Navigator NT street maps, including a hefty points of interest (POIs) database with hotels, restaurants, fuel stops, ATMs, and more.What's in the BoxGarmin n&uuml;vi 680 with MSN Direct, City Navigator NT maps for North America (preloaded, full coverage), MSN Direct receiver with integrated vehicle power cable, vehicle suction cup mount, an AC charger, vehicle power cable, dashboard disk, a USB cable, leather carrying case, quick reference guide, and owner's manual.Notice: MSN Direct service will be available only until January 1, 2012.Which n&uuml;vi is Best for You?Note: All n&uuml;vis come with detailed NAVTEQ maps containing more than 6 million pre-loaded point of interest locations.", "title": "Garmin n&uuml;vi 680 4.3-Inch Bluetooth Portable GPS Navigator", "price": 209.99, "imUrl": "http://ecx.images-amazon.com/images/I/41TYjGFwsRL._SY300_.jpg", "related": {"also_viewed": ["B0057ODG6Y", "B005DIBHCE", "B0057ODOCA", "B000OH63MI", "B00AXX0JNW", "B005DIBHA6", "B00AY7NSTY", "B001ELJ9QK", "B007M52QR6", "B0011ULQNI", "B0015EWMX8", "B0015F1L7A", "B00AXX0IEC", "B0057OCDQS", "B000H866BM", "B001U0O7RG", "B00HLYAI4Q", "B00AXX0JOQ", "B00AXX0I88", "B00AXZWG8Q", "B003ZX8B2S", "B00AXZY42W", "B005DIBFYE", "B001FL3XW0", "B007M52QEE", "B00AXX0I6A", "B0057OCS9A", "B000F78582", "B0007LJHVA", "B002771V48", "B003ZX8B1E", "B003ZHVBQM", "B00AY7NUYC", "B005DIBH6A", "B00HK6CPVY", "B00AY7NT2U", "B006SOLITY", "B003ZX8B0U", "B0096FT902", "B00AY7NUW4", "B00BIZ0EY8", "B001PKTFM8", "B002RL8H1Y", "B002OL2NT4"], "buy_after_viewing": ["B0057ODG6Y", "B005DIBHCE", "B000F78582", "B0057ODOCA"]}, "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS"]]}