{"asin": "B00081A2KY", "related": {"also_bought": ["B000067S60", "B00029U1DK", "B00B5P23SG", "B0019X20R8", "B006GOFW3E", "B000HZ999Q", "B001T6K7G6", "B000EUFJXE", "B0040FT30O", "B00094EXW8", "B0001MKU48", "B000067SRA", "B00471HK0Q", "B00066FHNI", "B000GHWRIK", "B000067VBM", "B000CD4CEA", "B00GXOOL4S", "B00DPHOV0A", "B00006B8G8", "B000JJSQ58", "B003ZDNZSI", "B000VM60I8", "B000B0NC2W", "B002ROEKBW", "B001B0GWVE", "B002S4027C", "B003EE08S8", "B000086EYG", "B004I1E9HC", "B0009WU65I", "B00CCILYDA", "B008I641TE", "B0018C8QKU", "B00603S1OS", "B000UWYM5C", "B001D8OGOO", "B0033Z2BAQ", "B00J604SVW", "B00DBV28TG", "B0029U2YSA", "B00012F6A6", "B00065DGF0", "B0001MKU0W", "B000GAXCXQ", "B002RO8JE6", "B006YG89Q6", "B00029U1DU", "B00AO1XFM0", "B009KXE4VO", "B00009WO51", "B000A0CV9S", "B009GGC4B2", "B0009MX5R4", "B00DIHVM36", "B00A1W44PO", "B0002LEMWE", "B005EJH6RW", "B0038JECKY", "B00011KM3I", "B003CFATNI", "B002FYAQ2Q", "B00FJRS6FU", "B009SPWCFY", "B00011KM38", "B000PE46I8", "B00AWRTXVS", "B005ARQV6U", "B003NREDC8", "B00E83X9P8", "B00AEF7RLG", "B004TS1J1S", "B0012P26ZO", "B00DYQYJ0E", "B00DRK73IM", "B002BH3Z8E", "B007JR5368", "B00134D3BA", "B000R9AAJA", "B00G9WHMHC", "B004TS1J18", "B00G9WHMCW", "B007JR532C", "B002TNRTSC", "B004TS1J1I", "B00BQ4F9ZA", "B002K0TU2C", "B00E3W1726", "B003VANO7C", "B007JRB0SS"], "bought_together": ["B000067S60", "B00029U1DK"], "buy_after_viewing": ["B00029U1DK", "B00A1W44PO", "B00081A2KE", "B009DZIEBK"]}, "title": "Verbatim 4.7 GB up to 16x Branded Recordable Disc AZO DVD-R 50-Disc Spindle 95101", "price": 16.46, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/51wBrW99DTL._SY300_.jpg", "brand": "Verbatim", "categories": [["Electronics", "Accessories & Supplies", "Blank Media", "DVD-R Discs"]], "description": "The Verbatim AZO recording layer gives our DVD media the competitive advantage-the patented coating delivers protection that lasts generations and provides ultimate resistance to UV light damage. That's why Verbatim's been recognized as the No. 1 Optical Brand in the World*--we consistently provide optical media of the highest quality and compatibility. When drive manufacturers test their products for maximum performance, they use Verbatim--so why wouldn't you?Mitsubishi Kagaku Media (MKM), Verbatim's parent company in Japan, brings extensive technological research and development to the table. Core technologies, like the AZO recording layer give Verbatim an offering like no other optical manufacturer.   This unique and ultra-stable layer strongly resists UV light, withstands high laser and rotation speeds on newer drives and ensures compatibility with current DVD standards.Verbatim's AZO recording layer not only withstands the extremely high laser and rotation speeds of newer drives, it also maximizes their performance. Verbatim paid particular attention to the durability and light fastness of AZO; tests show that it is more stable than most recording dyes and the least affected by ultraviolet light.AZO also offers high sensitivity for reliable high-speed recording and high reflectivity to eliminate read errors. The thinness of the recording layer is also critical. The thinner the layer, the higher the sensitivity and power margin; therefore, the better the DVD works for high-speed recording.What does all this mean for you? Verbatim AZO technology translates into optical products that cost just a little more but are worth the slight difference. They are products you want-offering reliability, high read and write performance, high-quality photos and sound and superior archival protection that lasts.FeaturesWarranty- Verbatim manufactures our DVDs to meet our strict quality standards. We stand behind the quality of our products-and our Limited Lifetime Warranty proves it!Compatibility- our online reviews say it for us; we make DVDs that work--no coasters! Mitsubishi Kagaku Media (MKM), our parent company, has long-standing relationships with drive manufacturers who use our products to test their performance, making Verbatim DVDs the most compatible in the industry.About VerbatimVerbatim provides technology you can trust-we've done so for over 40 years. Our products include an impressive selection of removable storage and computer peripherals, featuring a wide range of highly acclaimed CD, DVD and Blu-ray&reg; media products. Verbatim also offers an array of lightning fast desktop and portable hard drives, USB flash drives, memory cards, stylish, feature-rich mice and keyboards and a broad range of replacement laser toner cartridges. Buy Verbatim and you get innovation, security and reliability-and that means peace of mind.*SCG CD, DVD/R 2003-2009"}