{"asin": "B004PADOPO", "description": "Featuring an intuitive layout and slim profile, the Archos Vision 24b is a sleek and affordable solution to your portable media needs. The Vision 24b holds 4 GB of data and offers up to 12 hours of music playback. A 2.4-inch color TFT screen lets you enjoy videos and display your favorite photos with the push of a button. With included FM radio capabilities and a built-in voice recorder that can also record live radio, the Archos Vision 24b has all the features you need to enjoy a wide variety of media on the go.Vision 24b 4 GBAt a Glance:Slim, lightweight design for maximum portability4 GB of storage space and up to 12 hours of battery life for long-lasting usePlays multiple music formats and FM radioSupports video playback and picture display on 2.4-inch screenWorks as a voice and radio recorder with internal microphoneLimited one-year warrantySlim design and up to 12 hours of battery life lets you enjoy your favorite media on the go.View larger.Watch videos and view photos in vivid color on a 2.4-inch TFT screen.Slim, Light Body and 12-Hour Playback TimeDesigned for maximum portability, the Archos Vision 24b features a slim profile, measuring 3.74 by 1.97 by 0.35 inches (H x W x D), and weighs 1.4 ounces. An intuitive layout makes the Vision remarkably easy to use, and a battery life of up to 12 hours ensures that you can use it all day long on a single charge.4 GB Storage Capacity and Streaming FM RadioThe Vision 24b offers 4 GB of storage, so you can take plenty of music with you wherever you go. Enjoy all of your favorite songs and podcasts with optimal sound thanks to an integrated audio equalizer. With song title and album cover view, you'll be able to immediately recognize your music. In addition to playing MP3 files, the Vision supports WAV, OGG, FLAC, and APE formats.When you want a break from your music library, take advantage of the streaming FM radio, which includes several station presets. Whether listening to local news, catching sports results, or enjoying some tunes, you'll appreciate the receiver's high-quality sound and reception.Watch Video and Display Photos on 2.4-Inch ScreenEquipped with a 2.4-inch color TFT screen with 320-by-240-pixel resolution, the Archos Vision is ideal for video and picture playback. You can easily store and display photos on the Vision to relive those special occasions and share your memories with family and friends. The device supports JPEG, GIF, and BMP photo formats.The Archos Vision is equipped to play AVI, MPEG-4, FLV, and RMVB video files. Thanks to this wide range of file compatibility, you can avoid the hassle of having to convert your video files before taking them with you. Ideal for traveling, the Vision can hold hours of video so you won't run out of things to watch.The screen on the Archos Vision also displays text files (.TXT) and lyric files (.LRC) for your music, so you can sing along to all of your favorite songs.Built-In Audio RecorderNeed to remember an important lecture or meeting, or want to capture a special occasion? The Vision includes an internal microphone and ample storage space; you can record at any moment, store files on the device, and listen to them whenever you like. The 24b also allows you to record directly from FM radio, so you can enjoy that live DJ set or friend's mix time and time again.Product and Warranty InformationThe Archos Vision is compatible with Windows, Mac, and Linux (with mass storage support) operating systems. It uses USB 2.0 high-speed interface for data transfer and recharging--simply drag your files from your computer onto the Vision and you're ready to go.The Archos Vision 24b is backed by a limited one-year warranty.What's in the BoxArchos Vision 24b player, USB mini B/A cable, earphones, and user guide.VIDEO/MP3 PLAYERSVision 15bVision 18bVision 20bVision 24bVision 30c 4GBVision 30c 8GBCapacity4 GB8 GB8 GB4 GB4 GB8 GBScreen Size &amp; Type1.5-inch color TFT1.8-inch color TFT2-inch color TFT2.4-inch color TFT3-inch touchscreen3-inch touchscreenScreen Resolution128 x 128 pixels128 x 160 pixels176 x 220 pixels320 x 240 pixels320 x 400 pixels320 x 400 pixelsBattery Lifeup to 22 hoursup to 18 hoursup to 15 hoursup to 12 hoursup to 13 hoursup to 13 hoursMeasurements(H x W x D)2.95 x 1.53 x 0.35 inches3.35 x 1.57 x 0.33 inches3.38 x 1.7 x 0.35 inches3.74 x 1.97 x 0.35 inches3-9/10 x 2 x 3/10 inches3-9/10 x 2 x 3/10 inches", "title": "Archos Vision 24b 4 GB Video MP3 Player with 2.4-Inch Screen and FM Radio (Black)", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/41%2BuoG7p-WL._SY300_.jpg", "related": {"buy_after_viewing": ["B002TGEYOQ", "B005FVNGRS", "B005FVNGRI", "B005FVNGZU"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}