{"asin": "B000AZ57M6", "categories": [["Electronics", "Camera & Photo", "Lenses", "Camera Lenses", "Digital Camera Lenses"]], "description": "Dust and moisture resistant and incorporating Canon's very finest standards of precision optics, the EF 24-105mm f4L IS USM is designed for reportage, event, travel, and celebrity photographers looking for a lightweight and maneuverable lens with minimal image quality compromise.Complementing theEF 17-40mm f4L USMandEF 70-200mm f4L USM, the lens completes Canon's f4L-series zoom lens range. These lenses are designed for professional photographers requiring a light zoom lens with a fixed aperture throughout the zoom range. For outstanding camera-shake reduction, Image Stabilizer allows shutter speeds of 3 stops slower than would otherwise be possible, with no perceptible increase in image blur.The L-series is Canon's flagship professional lens range, designed to include outstanding image performance, ultimate operability, and weather resistance. The EF 24-105mm f4L IS USM offers a lightweight alternative to the renownedEF 24-70mm f2.8L USM.Image StabilizerImage Stabilizer (IS) dramatically reduces image blur caused by camera shake. Gyro sensors detect unwanted vibrations, triggering the corresponding movement of a correcting lens group perpendicular to the optical axis. This alters the light path, returning the image to its correct position on the sensor or film plane.The 3-stop advantage means that photographers normally shooting a 105mm lens handheld at 1/125 second can obtain a shake free result with a shutter speed as low as 1/15 second, for vastly extended options in low light conditions.Superb autofocusThe ring-type USM motor found in the EF 24-105mm f4L IS USM employs ultra-sonic frequency vibrations to drive autofocus with unrivalled speed and near-silent operation. A powerful CPU and improved AF algorithm contribute to speed performance. Good holding torque stops the lens with precision and accuracy, the instant it arrives at the correct focus point and without overshoot. Photographers can choose manual focus instantly and at any time simply by moving the manual focus ring without first having to switch out of autofocus mode.Constant f4 aperture from 24 to 105mmThe EF 24-105mm f4L IS USM offers the highest possible optical quality with no change in aperture over the full focal range of the lens. This allows photographers to set exposure at the widest aperture and zoom all the way through to 105mm without having to vary the shutter speed. It is the perfect lens for professional photographers looking for a lightweight and extended zoom alternative to its EF 24-70mm f2.8L USM counterpart. The lens employs an almost perfectly circular barrel aperture, helping create attractive, defocused backgrounds.Image qualityTo limit lens size and improve image clarity over the total image area, an Ultra-Low Dispersion glass (UD) element is used to eliminate the secondary chromatic aberrations that otherwise reduce sharpness and introduce color fringing. Aspherical lens elements correct spherical aberration for crisp, high-contrast, corner-to-corner quality. By optimizing Super Spectra lens coatings and lens element shaping, Canon's engineers have been effective in suppressing flare and ghosting--more prone to occur with digital cameras due to reflection off the image sensor. By increasing light absorption, coatings reduce reflections off lens element surfaces to deliver crisp, undistorted images with natural color balance.EOS system integrationThe EF 24-105mm f4L IS USM includes distance metering information, providing compatibility with the E-TTL II flash system of late-model cameras such as theEOS-1D Mark II NandEOS 5D. When used in conjunction with Canon's range of EX Speedlite flash units, the lens passes distance information to the flash algorithm for markedly improved flash exposure metering. To match the weather resistance afforded by EOS-1 professional camera bodies, an O-ring seals the lens against the lens mount and numerous seals around the lens' moving components provide protection against the ingress of dust and moisture.AF Mode and IS switches have been reshaped, making them less susceptible to being engaged or disengaged accidentally.The EF 24-105mm f4L IS USM comes with a bayonet mount lens hood EW-83H and soft lens pouch LP1219. In keeping with Canon's Kyosei philosophy of living in harmony with the environment, the lens features only lead-free glass.What's in the boxCanon 24-105mm f/4L IS EF USM AF Lens, E-77U 77mm Snap-On Lens Cap, Lens Dust Cap E (Rear), EW-83H Lens Hood, LP1219 Soft Lens Case, 1-Year Warranty.", "title": "Canon EF 24-105mm f/4 L IS USM Lens for Canon EOS SLR Cameras", "brand": "Canon", "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41FER7HPR7L._SX300_.jpg", "related": {"also_bought": ["B000B6A4S6", "B00004ZCJM", "B0000BZLBQ", "B00DMS0GTC", "B0000BZLAC", "B009B0MZ8U", "B007FGYZFI", "B001KELVS0", "B00004ZCI3", "B0082CAWEW", "B002NEGTTW", "B00009R9EO", "B0049XGNKK", "B00009XVCZ", "B002L60TTI", "B002K40R84", "B001G5ZTLS", "B0040JHVCC", "B001CCAISE", "B007FH1KX2", "B009OO71WS", "B004OVE188", "B00I4DXJ4E", "B000I1YIDQ", "B000I1X3W8", "B0040X4PQI", "B00007GQLS", "B002WE4H8I", "B00009R6WO", "B004K8WPUQ", "B004S8GUZO", "B002NEGTSI", "B0033PRWSW", "B00A2BWBNQ", "B007NDL56A", "B004Z55VP0", "B00007GQLU", "B005DEHVC8", "B00DMS0NGS", "B007SXJ26A", "B000NP46K2", "B007ORXEIW", "B0007Y791C", "B00FP1BQ1Q", "B000053HC5", "B0002Y5WXE", "B002NO7PWC", "B0083WYEHC", "B00007E7JU", "B002ZIMEMW", "B00309D9JW", "B004OR15LI", "B007M54E1M", "B000CLNHXY", "B0080JH3YE", "B00004ZCJI", "B0019CSVMW", "B002CWQTXG", "B007FH1FZ0", "B00BSDTTYQ", "1285084535", "1285422732", "B005AY9278", "B000BH5OW6", "B00006I53W", "B007FH1LJU", "B001KBZ3P0", "B003FHNDF4", "B0043RTLNS", "B0041MY32Y", "B0083Z6R4W", "B0040X4PUE", "B001QWBM62", "B007BXD66E", "B0093HGEKG", "B00009R6TA", "B002NEFL8W", "B007NMMUZQ", "B004TJ6JH6", "B00004ZCIC", "B0045JAJR6", "B000NP3DJW", "B0014D2WGW", "B00CV9MOBQ", "B0076BNK30", "B0000BZL68", "B00158QASW", "B000A1SWOA", "B0045F5CXQ", "B00HVT34FG", "B005UF3G2Y", "B00BCEJ0E0", "B000UMX7FI", "B0007Y794O", "B00246XB1S", "B0048IW030", "B005CAHOCK", "B0000BZLAD", "B002VPE1WK"], "bought_together": ["B00004ZCJM"], "buy_after_viewing": ["B005IRKK7S", "B0000BZLBQ", "B00004ZCJM", "B004V97MXE"]}}