{"asin": "B002DS4HTM", "related": {"also_bought": ["B001MSS6CS", "B004SP0WAQ", "B00D6NPH88", "B00IKMKHIU", "B00FWK8UWI", "B000UEZ36W", "B00DKXXAAQ", "B002D41HKS", "B005T3GRNW", "B0083EZE4M", "B005O65JXI", "B0075W8DG4", "B00F3L19KQ", "B005LKKNQA", "B00FNKMVUO", "B00CBQO930", "B00E88ZGNG", "B006YG9E7O", "B0058P0I2C", "B00E3W1726", "B003LVZO8S", "B009GXZ8MM", "B00DPC015E", "B004QRKWLA", "B001FBHT34", "B008QUYFE8", "B00BBUCCKO", "B000OGX5AM", "B00CO8TBOW", "B00BCEK2LA", "B0092QJRPC", "B00ENFA3GO", "B006W41W7S", "B0033Z2BAQ", "B00569K7LM", "B00AAQRNQ8", "B00JST2QEW", "B00ALYORA4", "B003VAHYQY", "B009GUXU52", "B0088PUEPK", "B00B2HH7G0", "B00F6S0XJO", "B00A3VOA3O", "B003H4QPJQ", "B00KWFY04A", "B0042FZ51I", "B004431UBM", "B009O7YU56", "B003YVJJ5Y", "B00906E03I", "B004QBUL1C", "B00CO8TA4I", "B00HLUZX7M", "B00G5T1Z5Y", "B00ALK3KEM", "B004LT6O56", "B008V9959O", "B00EDSI7QO", "B003ELVLKU", "B001NEK2GE", "B009O7YORK", "B00CJD4HD2", "B00H09BB16", "B00DGNA4FY", "B009FC3YJ8", "B007HSKSMI", "B00BWS87WW", "B00004Z5RA", "B00I0D81OG", "B00BFOEY4I", "B00E3W15P0", "B00BEJDGOS", "B008CXTX7S", "B00F3ZN2W0", "B005XWR5NA", "B009SJR2BE", "B00A1ZTZOG", "B002I08CSW", "B001FY7LBQ", "B00IDG3IDO", "B008I646WG", "B00KVRK39A", "B0000AI0N1", "B006GDVREI", "B0096PLB9O", "B001R76D42", "B005EOWBHC", "B000UXZQ42", "B00840353W", "B00007FGU7", "B003L1ZYYM", "B00AWRUIY4", "B007GMPZ0A"], "bought_together": ["B000UEZ36W"], "buy_after_viewing": ["B00BFOEY4I", "B00DU2CHE2", "B00906E03I", "B00HLUZXAY"]}, "title": "Creative  Fatal1ty Gaming Headset", "price": 29.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/414ZSVlsFyL._SY300_.jpg", "brand": "Creative", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Headsets & Microphones", "PC Headsets"]], "description": "Don't let your opponent sneak up behind you--get a competitive edge with Creative Labs' HS-800 Fatal1ty Professional Series Gaming Headset. Developed with input from world-famous gamer Johnathan \"Fatal1ty\" Wendel, the HS-800 features high-quality drivers for dynamic in-game audio and a noise-cancelling microphone for crisp voice communications. And with an ergonomic, lightweight design, you'll stay comfortable and maintain your advantage throughout extended gaming sessions.HS-800 Fatal1tyGaming HeadsetAt a Glance:40 mm Neodymium audio drivers with extended bass responseComfortable, lightweight designNoise-canceling microphone for clear voice communicationIn-line volume control with microphone on/offThe HS-800 features velvet padded ear cups, an adjustable noise-canceling mic, and an in-line volume control module.Powerful Neodymium Magnets for Realistic SoundIn the heat of battle, you need every advantage you can get. The HS-800 features two large 40-millimeter drivers powered by Neodymium magnets that capture every whizzing bullet and clanging sword in realistic detail. You'll be able to hunt down your enemies with ease thanks to the accurately rendered audio cues, while excellent bass response will let you hear the powerful immediacy of every explosion.The HS-800 features a generous eight foot cable made from oxygen-free copper that provides a pure signal with outstanding clarity. The cable features a gold-plated 1/8-inch mini-jack for optimum compatibility.Detachable, Noise-Canceling MicrophoneThe HS-800 Fatal1ty features a military-grade, noise-canceling microphone so your orders will be heard loud and clear by your team. The flexible boom microphone is adjustable to fit the contours of your face, enabling clear voice communications. Also, the microphone cord features in-line controls enabling you to easily adjust your sound level, or mute the mic on the fly for private conversations.And after you've finished gaming, you can detach the microphone and use the HS-800 to listen to your favorite tunes.Lightweight Construction for Comfortable Gaming SessionsThe HS-800's adjustable headband features a strong, lightweight construction of steel wrapped in durable ABS plastic. The plush, ergonomic ear-pads are lined with velvet and leatherette trimmings, keeping ears comfortable and cool.The Creative Labs HS-800 Fatal1ty Professional Series Gaming Headset is backed by a one-year limited warranty.What's in the BoxHeadset and detachable boom microphone with in-line volume control.Gaming HeadsetsHS-980 Fatal1ty Professional Series MKII Gaming HeadsetHS-800 Fatal1ty Gaming Headset (Analog)HS-1000 Fatal1ty USB Gaming HeadsetSound Blaster Arena Surround USB Gaming HeadsetHeadphone QualityErgonomic ear cups with sound isolationVelvet PaddingVelvet PaddingErgonomic ear cups with sound isolationAudio Speaker Size40mm Drivers(Full-Spectrum)40mm Drivers40mm Drivers40mm Drivers(Full-Spectrum)Type of Microphone SupportDual Noise Canceling MicrophoneNoise Canceling MicrophoneNoise Canceling MicrophoneDual Noise Canceling MicrophoneRemovable Microphone?YesYesYesYesConnection Type3.5mm jack3.5mm jackUSB 2.0USB 2.0Inline Volume / MuteYesYesYesYesSound Control LocationAlong the cableAlong the cableAlong the cableAlong the cableSound ControlVolume control /Mute on and offVolume control /Mute on and offVolume control /Mute on and offVolume control /Mute on and offSilencer Tech EnabledYes(with Sound Blaster Titanium Series Sound Card)NoNoYesVoice FX EnabledYesNoNoYesX-Fi EnabledYes(When used with an X-Fi Sound Card)NoYesYesIdeal ForFPS Desktop Gamer / MMO(Recommend Sound Blaster TI Series Sound Card)Everyday Desktop Gamer/ MMO(Recommend Sound Blaster Sound Card)Everyday Desktop or Laptop Gaming / VOIPMMO / FPS / Competitive LAN Gamer"}