{"asin": "B00IRX1NXK", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Hubs"], ["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Chargers & Adapters"]], "description": "Turn an existing USB port into a rapid turbo charger. You can boost your standard USB port to charge devices such as smart phones or tablets up to 3 X faster than before. It supports all Android and Apple devices such as iPad or iPhone.Key Features:* Increase charging speeds on an available USB port* Use a standard USB port to charge a Tablet PC or an iPadSabrent USB Turbo Charger - A rapid charger for iPads and Tablet PC'sMany devices require more power than a standard USB port can provide. Which means that some devices will charge slower than usual and some devices may not charge at all. A good example would be power hungry devices such as iPads and Tablet PCs. The Sabrent USB Turbo Charger is a tiny accessory that boosts charge speeds on any USB port or USB hub, and it requires no external power.Specifications:* Input: 5V, 0.5A - 2.1A* Output: 5V, 0.5A - 2.1AHow to Use HB-SFSTThe Sabrent HB-SFST charging adapter is Plug & Play. Simply plug it into any existing USB port, and then connect the device to be charged into the other end of this charger. It will automatically charge your device at a much faster speeds.Please Note: You cannot transfer data through this adapter. This device is used only for the purposes of speeding up the Charging process of these devices.Warranty:This product comes with a 1 year manafacture warranty. In order for us to properly assist you, please follow these simple instructions:Go to www.sabrent.com/support and click 'Submit a ticket'.Submit your ticket.You must include your Amazon Order ID# number in the subject line.", "title": "Sabrent USB Turbo Charging Adapter for Apple iPhone, iPad, Android, and other devices [Simulates 1A Charger on Powered USB Port] (HB-SFST)", "price": 6.82, "imUrl": "http://ecx.images-amazon.com/images/I/31mS1QkVaLL._SY300_.jpg", "brand": "Sabrent", "related": {"also_bought": ["B00ICR1UB6", "B00IKCI6X8", "B00FMTIUD8", "B00GC4AJOU", "B00L1PMQLY", "B00IRV2DL8", "B00JJ2C0S0", "B00IKC14OG", "B00IBDOB5I", "B00GJYJFKM", "B00FDLCTQO", "B000A7G45I", "B00GTGETFG", "B00E9IFDBU", "B00CFVO5C6", "B007Z92RIW", "B000083KIH", "B001AR6MI6", "B000OVPGGI", "B00C13YSIO", "B00DTOAWZ2", "B00DWKK6PY", "B00B3P15M8", "B00ANI1Q9S", "B007PTCFFW"], "bought_together": ["B00IKCI6X8"], "buy_after_viewing": ["B00IKCI6X8", "B00ICR1UB6", "B00HBZ3FHM", "B00GTGETFG"]}}