{"asin": "B000031KIM", "categories": [["Electronics", "Computers & Accessories", "PDAs, Handhelds & Accessories", "PDAs & Handhelds"]], "description": "At only 4.7 by 3.2 inches square and 0.4 inches thick, the Palm Vx  handheld is truly pocket sized; however, this model sports a hefty 8 MB of RAM.  The Palm Vx handheld also sports a sleek exterior that looks supercool--an  intangible value to be sure, but one that's hard to argue with.The Palm Vx handheld offers the same improvements to its screen that were made  to the Palm IIIx. These updates since the Palm III handheld include a far  sharper screen and contrast-variable backlighting, which makes the Palm Vx  handheld much easier to use in low-light conditions. Rechargeable lithium-ion  batteries, which charge while the unit sits in its HotSync cradle, make battery  life a nonissue.You can synchronize Palm handhelds with your computer so that you can carry all  your appointments, notes, contacts, and e-mail with you. The simple one-touch  interface makes sense to new and seasoned computer users alike. For owners that  prefer Microsoft Outlook to keep tabs on folks for business and pleasure, rest  easy. With the simple installation procedure, and Outlook support out of the  box, you can transfer the data you have in Outlook, or start fresh with the Palm  Desktop software. In addition, there are thousands of applications for the Palm  operating system available on the Internet that make your Palm handheld work as  everything from a universal remote to a digital book and restaurant guide.We had no trouble setting up the device, synching with our PC-based Netscape e-mail,  using the Graffiti character-recognition software, or working with the  address book, date book, memo writer, to-do list, and all the other applications  that put the Palm OS on the map. All in all, this is a great upgrade to an  already strong product. If this is your first Palm, it's a great way to start.Pros:Palm OS interface is simple to useEasy to install and set upUses rechargeable batteriesSleek, solid design can take some punishmentCons:Not expandable (has a closed case)Case cover opens too easily", "title": "PalmOne Vx Handheld", "price": 49.99, "salesRank": {"Electronics": 77299}, "imUrl": "http://ecx.images-amazon.com/images/I/41YSRGHR1WL._SY300_.jpg", "related": {"also_viewed": ["B00005AWBJ", "B0007VMROE", "B000BI7NHY", "B00000J4FS", "B000BI2180", "B00000DM9S", "B00000JI2C", "B00007GPI1", "B00005Y1Z6", "B00006J6RN", "B00004VWM3", "B0000DB4D1", "B00005O70S", "B00004RC2I", "B00005V63T", "B0000796XL", "B00004WHIL", "B0000AH5N1", "B000059MSI", "B00004DS1N", "B000HEEEV0", "B00004RIUB", "B001CODA9G", "B00005Y1Z7", "B00000IGBF", "B00004TDN0", "B00006JKXN", "B0000CBJ8J", "B0002Y7DO0", "B002ZFSR30", "B00008WEHZ", "B0000A8VNY", "B000672QAE", "B008G1BTLE", "B000WVIXME"], "buy_after_viewing": ["B00005AWBJ", "B000WVIXME", "B0007VMROE", "B000BI7NHY"]}}