{"asin": "B00006HCJI", "description": "TiVo's Series2 DVR delivers more recording capacity at a lower cost than original TiVo models. TiVo DVRs record television programming directly to a digital hard drive, eliminating the hassles of videotape. This Series2 TiVo offers 60 hours of recording time in TiVo's small, sleek chassis (15 inches wide by 11.5 inches deep and 3 inches high).TiVo automatically records your favorite shows.The Series2 has two USB ports for ready connectivity with home networks. This connectivity also gives TiVo subscribers optional access to exciting entertainment services like music, digital photos, and multiroom viewing and scheduling via the Web. The TiVo DVR Series2 is compatible with virtually every television. It also works with VCRs, TV antennas, cable systems, and satellite systems. A patented remote control simplifies program recording and controls multiple TiVos within the home (two devices can share your existing phone line). Connections include three video inputs and outputs (S-video, composite-video, and RF coaxial), one set of stereo RCA analog audio inputs, and two sets of stereo audio outputs. A standard female RJ-11 telephone jack is the channel by which the Series2 accesses the TiVo service, or you can use a USB cable to connect via broadband.TiVo subscribers can pay $12.95 per month or a one-time product lifetime fee of $299. Among the many benefits of TiVo service are these: Season Pass (TiVo automatically finds and records every episode of a series all season long, even if the network schedule changes), WishList (TiVo finds and records programs that feature your favorite actor, director, team, or even topic), Smart Recording (TiVo detects lineup changes for you and suggests programs to match your interests, if desired), and Showcases (exclusive entertainment plus recording shortcuts from some of the most popular networks on TV).Now, through your home network you can access TiVo's Home Media Features. This services provides remote scheduling capabilities from anywhere you have Internet access; MP3 streaming from your PC to your TiVo so you can listen to music through your home theater sound system; digital image viewing from your PC so that you can create slideshows on your TV; and multiroom viewing, which allows you to connect two TiVo Series2 DVRs in your home so that you can record on one and watch on another.", "title": "TiVo R240060 60-Hour Digital Video Recorder", "imUrl": "http://ecx.images-amazon.com/images/I/31TXJR0XKZL._SX300_.jpg", "related": {"also_viewed": ["B00BUCLVZU", "B00EEOSZK0", "B000ER5G58", "B0036OR910", "B00GGVPKKC", "B0038JECKY", "B00I2ZBD1U", "B000RZDBM2", "B00BF2M21C", "B0018LX0DY", "B0036OR91A", "B007FEEO3S", "B00BA4ILX8", "B00E8HIN78", "B009D90JFA", "B007JPCL88", "B002Z1JCP6", "B00JGZQ17Q", "B00G037DQU", "B0002A0206", "B00F5NB7MW"]}, "categories": [["Electronics", "Television & Video", "Streaming Media Players"]]}