{"asin": "B000HAOVGM", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Manufacturer DescriptionThis is the Digital Elph that's raising the bar. There's everything you'd expect from a camera of this caliber: a 7.1-megapixel CCD to render images in magnificent detail, and a DIGIC III Image Processor for stellar quality and fast operation. Yet what sets the SD800 IS Digital Elph apart is its wide-angle, 3.8x optical zoom with Image Stabilizer technology for rock-steady zooms. The Canon SD800 IS Digital Elph, it's the Digital Elph that's a step ahead.PowerShot SD800 IS Digital Elph Highlights7.1-megapixel Digital Elph with elegant stainless steel Perpetual Curve designThe PowerShot SD800 IS features a high-resolution, 7.1-megapixel CCD to give you images of uncompromising texture and detail. With it, you'll capture what others miss - the delicate strands of a baby's hair, the intricate petals of a wild flower. Plus the camera is as beautiful to hold as the images it takes. The Perpetual Curve design has the look of fine sculpture. Yet it's practical, too. Its unique form is engineered for the shape of your hand.3.8x optical zoom in actionWide-angle 28-105mm (35mm equivalent) 3.8x optical zoom with Optical Image Stabilizer technologyEngineered with Canon's sophisticated wide-angle 3.8x zoom lens with integrated Image Stabilizer technology, the SD800 IS Digital Elph gives you the \"shake-free\" performance that makes your pictures sharp and clear. No matter how close you zoom in, the SD800 IS Digital Elph keeps everything stable. All you have to think about is your subject.DIGIC III Image Processor with Face Detection technologyThe DIGIC III Image Processor is the latest advancement to Canon's proprietary DIGIC technology, delivering superior image quality, ultra-responsive performance and extended battery life. DIGIC III provides a speedier interface for the SD800 IS Digital Elph's SD memory card, as well as higher definition for its LCD monitor.Face Detection makes it easy to snap the perfect pictureDIGIC III also empowers new Face Detection AF/AE, which finds all the faces in the frame and sets the most suitable focus point, when the shutter button is depressed half-way. Exposure and flash are controlled to ensure proper illumination of both the faces and the overall scene, eliminating the common problem of darkened or overexposed faces.iSAPS Technology is an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the fast DIGIC III Image Processor to improve focus speed and accuracy, as well as exposure and white balance.Large 2.5-inch LCD monitor with wide viewing angleThe SD800's 2.5-inch LCD monitor gives you the big picture, whether you're shooting, reviewing or showing off your images. This high-resolution screen offers a crisp, clear picture and wider viewing angle to make shooting, playback and using the camera's menu functions especially convenient. The clear and bright LCD also features Night Display mode for easy viewing in low light.ISO 1600 to reduce image blur and expand low-light shooting capabilityThe PowerShot SD800 IS Digital Elph features new ISO 1600 and High ISO Auto settings that reduce the effects of camera shake and sharpen subjects in low-light situations, giving you greater flexibility for shooting.Improved Movie Mode with fast frame rateWith the SD800 IS's Improved Movie Mode, you can shoot extremely high-quality, full-motion movies at 60 fps QVGA (320 x240). When you want to save space, you've also got Standard Recording that lets you shoot at 30 fps VGA (640 x 480). There's even a 15 fps Compact Movie Mode that's ideal for creating movies you can attach to emails.Print/Share buttonThe PowerShot SD800 IS Digital Elph's Print/Share button makes direct printing easier than ever. Simply connect the SD800 IS Digital Elph to a Canon CP, SElphY or PIXMA Photo Printer or any PictBridge compatible photo printer, press the lighted Print/Share button and print! Also use the Print/Share button to transfer images to a computer (Windows and Macintosh).Print your own photos in 28 different sizes or use the Movie Print function to output multiple stills from a recorded movie on a single sheet with a Canon SElphY Compact Photo Printer.Direct Photo PrintersFor desktop large-format printing, try one of the Direct Photo Printers that allow you to print without a computer in one of two ways: plug your compatible PowerShot camera into the Direct Photo Printer using the supplied USB interface cable, or simply insert a memory card into the supplied adapter. You can also connect the printer to your computer for more options. Print high-resolution, borderless images as postcards or 8.5 x 11-inch sheets within minutes.Compact Photo PrintersCompact Photo Printers let you produce versatile, fun 4 x 6-inch postcards, 4 x 8-inch wide greeting cards or credit-card size prints in just two easy steps: connect and press/print. Control the printer right from your camera's LCD monitor. You get durable, dye-sublimated prints quickly with or without borders. Assorted paper types let you create mini or credit card size labels. You can even take the SElphY ES1 and CP730 Compact Photo Printers to a party or an outdoor picnic using an optional rechargeable battery.", "title": "Canon PowerShot SD800 IS 7.1MP Digital Elph Camera with 3.8x Wide Angle Image-Stabilized Optical Zoom", "price": 17.12, "salesRank": {"Camera &amp; Photo": 5832}, "imUrl": "http://ecx.images-amazon.com/images/I/51TTWVDGD3L._SX300_.jpg", "related": {"also_viewed": ["B0009GZSSO", "B000GHVZQ0", "B000EMWBV0", "B000AYJDD6", "B000AYKUUQ", "B00009VT1T", "B000Q3043Y", "B000Q30420", "B001SER48S", "B001SER47O", "B0035FZJKI", "B0012Y6AY8", "B000NK8EWI", "B000NK6J6Q", "B001SER492", "B001SER47Y", "B0012YC7AE", "B000EN0K94", "B0075T7NW2", "B000ENPDSW", "B0075SUG3Q", "B0035FZJJ4", "B001SER49M", "B0075SUII4", "B000EMWBT2", "B00B5HE3AK", "B001SER46A", "B0011ZK6PC", "B004J3V828", "B00B5HE2UG", "B009F6X30E", "B00HLDFPA4", "B000VR3W16", "B0075SUHKI", "B0011ZK6OS", "B0075SUIEI", "B00B5HE3UU", "B006UMM15O", "B0075SUGQI", "B0075SUK14", "B001G5ZTN6", "B0035FZJJE", "B004HW73S4", "B000NK3NBA", "B00AWYN0BU", "B005I6DUKS", "B000RN2KRQ"], "buy_after_viewing": ["B003VNKNF0", "B000EVS4YE", "B003VNKNEQ", "B007BJHETS"]}}