{"asin": "B000UPXU2A", "description": ".prodname  {font-weight: bold; font-size: font-style: italic;} .caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; }SpaSensials*Relax, rejuvenate and pamper yourself with a spa treatment at home. SpaSensials* socks and gloves deliver a deep-moisturizing treatment in as little as 15 minutes.SimpleNo need to apply lotion &mdash; just open the pouch, slip on the socks and gloves, and see visible results after just one treatment. The cotton-like, three-layer material used in SpaSensials* socks and gloves has a unique barrier that keeps all the moisturizing lotion on the inside &mdash; with a soft, comfortable feel on the outside.SoothingInfused with aloe, jojoba, avocado and vitamins, SpaSensials* socks and gloves also feature our gentle signature fragrance, Mandarin Ginger Flower. You get a multi-sensory spa experience without ever leaving home.RejuvenatingSpaSensials* socks and gloves are clinically proven to deeply moisturize dry skin. Whether you're maintaining the look of a salon treatment or simply getting in some much-needed Me Time&trade;, softer-feeling, better-looking skin can be yours in as little as 15 minutes.Our ProductsSpaSensials* Moisturizing &amp; Deep-Conditioning Foot TreatmentComfortable, form-fitting disposable socks (four pairs) infused with vitamins (A, B5, E), aloe, avocado and jojoba. Includes two exfoliating buffs infused with skin cleansers and conditioners.SpaSensials* Moisturizing &amp; Deep-Conditioning Hand TreatmentSoft-fitting disposable gloves (four pairs) infused with vitamins (A, B5, E), aloe, avocado and jojoba. Also includes two exfoliating buffs infused with skin cleansers and conditioners.SpaSensials* Hand &amp; Foot Treatment SystemsContains two pairs each of the infused socks and gloves, plus two exfoliating buffs.SpaSensials* 4-Step Rejuvenating Foot Treatment SystemIncludes bubbling foot soak, two-sided exfoliating buff, moisturizing socks and foot finishing cream.SpaSensials* 4-Step Radiant Facial Treatment SystemIncludes purifying facial exfoliant, two-piece moisturizing mask, undereye treatment and a moisture retention cream.", "title": "SpaSensials* Combination Hand &amp; Foot Treatment Systems", "imUrl": "http://ecx.images-amazon.com/images/I/41qcey0hFOL._SY300_.jpg", "salesRank": {"Beauty": 365384}, "categories": [["Beauty", "Skin Care", "Sets & Kits"]]}