{"asin": "B000EUGX70", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Remote Controls", "TV Remote Controls"]], "description": "Logitech Harmony 550: Control your Entertainment Universe with One TouchSay goodbye to juggling multiple remotes. Harmony 550 gives you one-touch control of your entire home entertainment system. Want to watch TV? See a movie? Listen to music? Play a game? Start your activity with one touch. Patented Smart State Technology takes care of turning on, or off, all the right components. It's the remote everyone can use. No cheat sheets. No complicated button sequences. No numb thumb. Harmony 550 is the easier, more affordable way to take complete command of your entertainment.Key FeaturesOne-touch activity control for easy access to all your entertainmentOne trigger finger is all you need. Choose the activity you want and the remote does the work for you. Select &quot;Watch a DVD&quot; and Harmony 550 will power on your TV, DVD player, stereo receiver, set all the inputs and even press play. What could be easier? Enjoy programmable buttons that make your favorite activities easy to access. Or press the Sound and Picture buttons to instantly tame tough configurations like switching picture aspect ratios and sound modes.High style, comfort and convenience at your fingertipsWhy settle for another boring remote? Harmony 550's comfort-grip shape and slim-line ergonomic design combine eye-catching comfort and style. The right controls are in the right places, intelligently arranged so they're easy to reach. The fully backlit controls and display make it to easy navigate your entertainment options, even in home movie-theater darkness. There's also a handy &quot;help&quot; button, so anyone from the kids to the babysitter can easily access their favorite TV shows, music, movies and games.Controls virtually any component you own now and add laterHarmony 550 controls up to 15 home theater components simultaneously&mdash;everything from HDTVs and PVRs/DVRs to Blu-Ray disc players and VCRs. With the world's largest A/V control database, Harmony remotes support more than 250,000 home entertainment components from 5,000 brands. So your remote is never out of date. You'll always be in control of the components you own today and add tomorrow, even if they're mixed brands.Simple to set up. Simple to get support.Your Harmony guided set-up wizard does the programming, so you don't have to. Just connect the remote to your computer, access the online wizard, answer a few questions and you're ready to control even the most complex system. Problems? Questions?&nbsp; Get live support, free, over the phone or online. Getting control of your entertainment system couldn't be any simpler.Get the Logitech Harmony Adapter for PLAYSTATION 3. Finally, control movies on your PS3 &mdash; drama free.Wish you could control all your movies, music, games and entertainment gear &mdash; including your PLAYSTATION 3 &mdash; with one remote? Wish granted.Add one touch PS3 control to any Harmony remote with the new Logitech Harmony Adapter for PLAYSTATION 3. Now your entire entertainment system and every PS3 command is at your fingertips. Want to watch a DVD or Blue-ray Disc movie? Play a game? Turn the console on or off? Easy. Just press one button on the remote to experience instant entertainment gratification.Which Harmony Is Right For You?Find out what other Logitech Harmony Advanced Universal Remotes fit your audio &amp; video set-ups. Browse more Harmony remotes and see which one is right for you.Harmony 510Complete Control with a single remote.Harmony 550Added convenience and control.Harmony 670The Harmony designed for your DVR.Harmony OneFull color touch screen with intuitive button layout.Harmony 890Controls out of sight devices with RF wireless technology.Harmony 1100Powerful home entertainment control through a customizable 3.5-inch color touch screen.&nbsp;Control FeaturesHarmony 510Harmony 550Harmony 670Harmony OneHarmony 890Harmony 1100Number of devices supportedUp to 5Up to 15Up to 15Up to 15Up to 15Up to 15Black and white LCD display&nbsp;&nbsp;&nbsp;Color LCD display&nbsp;&nbsp;&nbsp;Easy-to-read&nbsp; touch screen&nbsp;&nbsp;&nbsp;&nbsp;Preset activity buttons&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Layout optimized for DVR / TiVo&nbsp;&nbsp;Contoured design to fit comfortably in your hand&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Customizable buttons so you decide what is on the screenCustomizable screens for more powerful personalization&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;RF code support for devices in cabinets or behind walls&nbsp;&nbsp;&nbsp;&nbsp;RF Wireless Extender for RF connection&nbsp;&nbsp;&nbsp;&nbsp;available separatelyPower ManagementHarmony 510Harmony 550Harmony 670Harmony OneHarmony 890Harmony 1100AAA Battery Operated (included)&nbsp;&nbsp;&nbsp;Recharging cradle so you don't need to worry about batteries&nbsp;&nbsp;&nbsp;With Every Harmony RemoteHarmony 510Harmony 550Harmony 670Harmony OneHarmony 890Harmony 1100Handy help button so you're never stuckGuided, online set up, with live support if you hit a snagControls 225,000+ devices from 5,000+ brands so you know Harmony will work with your devices, today and tomorrowWarranty1 Year1 Year1 Year1 Year1 Year1 YearSystem SupportHarmony 510Harmony 550Harmony 670Harmony OneHarmony 890Harmony 1100Windows Vista, XPMac OS X (8.3 and above)What's in the BoxPackage ContentsLogitech Harmony 550 Advanced Universal RemoteUSB cableInstallation CDInstallation guide4 AAA batteries1-year warrantySystem RequirementsPCWindows 2000, XP, VistaUSB portCD-ROM driveInternet accessMacMacintosh OS X 10.3 or laterUSB portCD-Rom driveInternet access", "title": "Logitech Harmony 550 Universal Remote Control", "price": 248.99, "imUrl": "http://ecx.images-amazon.com/images/I/41HPP1HXYJL._SY300_.jpg", "brand": "Logitech", "related": {"also_viewed": ["B004OVECU0", "B002IC0YLS", "B001F51G1Q", "B000BDG3HU", "B000GD3J3G", "B00093IIRA", "B000IMSK8Y", "B004U605FK", "B003JSLP54", "B004OVECUA", "B005FO43OU", "B009EIUH6G", "B00IAKLM54", "B003IZFCFW", "B00119T6NQ", "B00J7KM5X4", "B000CS1TLE", "B00BQ5RYI4", "B0038OMEQI", "B004UKRRD4", "B001M5U5AC", "B00BQ5RY1G", "B0003QER82", "B002IC0YL8", "B00I54C0GA", "B001KC08AE", "B000II6YEA", "B000CCXCYC", "B005O81U9S", "B000FL9E6K", "B001KC08A4", "B003DNS88W", "B0033WSTYQ", "B000FL9E6U", "B003AM8S3G", "B000VAXSFS", "B001HA51Z6", "B002N1J7DU", "B005OS0OMW", "B00182F1SU", "B005O81U8Y", "B0003QER7S", "B001HKLA60", "B0007PCB6O", "B003YKB3OA", "B0003QER8C", "B0009YCABE", "B000623HE8", "B00067R5Y6", "B009VJUEJS", "B003UVVGHW", "B000FL5OIW", "B000ILIHTC", "B00385XUG0", "B00AP61HYM", "B002JW7BN6", "B00385XUFQ", "B00267S7XW"], "bought_together": ["B00267S7XW"], "buy_after_viewing": ["B004OVECU0", "B00BQ5RYI4", "B00BQ5RYI4", "B002IC0YLS", "B009EIUH6G"]}}