{"asin": "B000U5W4R2", "description": "Manufacturer's Description--September 15, 2007 With free lifetime traffic, Zagat Ratings, 3-D images of highway interchanges, Lane Assist, and text-to-speech, the Navigon 5100 is rich in features that directly empower navigation. Plus, it looks great on your dashboard. It&rsquo;s slim &mdash; less than an inch thick &mdash; and sports an easy-to-read 3.5\" touch screen wrapped in an elegant chrome frame.The 5100 is the smaller sibling to Navigon's flagship7100. The 5100 has a 3.5-inch screen, while the 7100 has a 4.3-inch widescreen. The 7100 also adds bluetooth-capability for hands-free mobile phone integration, so if you want that feature, do check out the 7100. Otherwise, the 5100 packs in a lot of useful features into its sleek frame.Key FeaturesLifetime Trafficgives you traffic flow and incident information and alternate route suggestion for the life of your unit (Learn more)ZAGAT Ratings and Reviewsgives you over 21,000 ratings and reviews for more than 70 cities in the U.S. and Canada&nbsp; (Learn more)Reality View: 3D images of highway interchanges with actual road sign text so you&rsquo;ll never miss your exit again (Learn more)Spoken Directions with Text-to-Speech: keep your eyes on the road with spoken turn-by-turn directions and real street names.&nbsp;Lane Assistant:. Icons alert you to the optimal lane to be in (Learn more)Landscape and Portrait Views:landscape gives you a widescreen view of the road ahead; portrait looks and feels like a cell phonePoints Of Interest: Reach gas stations, hotels, restaurants, transportation hubs, and more with millions of points of interest that will help you find your way.Branded icons: places are so easy to find that everywhere will feel like home.DirectHelp: At-a-glance information helps you find emergency and roadside services&mdash;and helps them find you. Just push a button and get instant directions and phone numbers to the nearest hospitals, police stations, roadside assistance companies and pharmacies.Easy Add-OnsFreshMapsgives you up to 12 regular, trusted map updates for three years with a simple activation code.Which Navigon is Right for You?Click hereto see a chart comparing features on the entire family of Navigon portable GPS navigatorsLearn more about NavigonLearn MoreSoftware and HardwareThe features and functions of the Navigon's portable GPS navigators are controlled via intuitive, easy-to-use animated menus that use predictive text input to quickly and easily select your city, state and address.Maps and menus appear on elegant, high-contrast, full-color touch-screen displays.Navigon portable GPS navigators run on a powerful Samsung 400 MHz processor, a fully integrated SiRF Star III GPS chip, 64 MBs of both RAM and ROM built in, and a rechargeable 1,200 mAh lithium ion battery that is rated for 4.5 hours of continuous use.All this is housed in an ultra-thin, sleek housing.Free Lifetime TrafficThe NAVIGON 5100 includes the industry's only subscription-free Lifetime Traffic service. Dynamic, real-time traffic feeds show you where traffic is slow and suggests alternate routes. Save time and stress. Real-Time Traffic is free for the lifetime of your NAVIGON 5100 and works out of the box.Reality ViewReality View&trade; provides 3D images and actual road sign text when approaching complex interchanges &mdash; so you&rsquo;ll never miss your exit again.Lane AssistNo more wondering what lane you need to be in to stay on course. Your NAVIGON will guide you with simple to follow lane guidance with arrows so you can make your turn and stay on track.Zagat RatingsNow you can enjoy the world's most comprehensive restaurant and entertainment guide &mdash; right on your NAVIGON GPS device. With ZAGAT's trusted Ratings and Reviews, you will know exactly where to stay and play during your travels and, with NAVIGON's guidance you will know exactly how to get there. The guide includes over 21,000 entries covering a variety of categories, including restaurants, hotels, golf courses, nightclubs and attractions in over 70 cities in the U.S. and Canada.ZAGAT SURVEY Ratings and Reviews is a standard feature on both the 7100 and 5100 models. An additional accessory purchase is required to activate the service on the 2100 model.What's in the BoxNAVIGON 5100 GPS NavigatorSD card preloaded with software and maps of US, Canada and Puerto RicoRechargeable 1150 mAH lithium ion battery (rated for up to 4.5 hours)Integrated traffic receiver with free Lifetime Traffic updatesCar ChargerCar MountQuickstart Guide and User Manual (on CD)Limited WarrantyNote:All Navigon GPS Navigators run on the Microsoft Windows CD Net 5.0 operating system. A PC is required to use additional map data, and in such cases users require Windows 2000, ME, XP or higher, as well as a CD ROM drive and a USB port. An SD/MMC card reader is recommended as the 7100 not only uses SD cards, but also comes with a 2 GB SD card in the package.The Navigon Family of Portable NavigatorsScreen Size (diagonally)MapsReality ViewReal Street NamesLane AssistantBluetoothPOIsLifetime TrafficData ServiceZagat RatingsFreshMaps 3-YearMap Update Service21003.5 inchescontinental U.S.1.3 millionRequires ActivationRequires ActivationRequires Activation21203.5 inchesU.S and Canada1.3 millionRequires ActivationRequires ActivationRequires Activation2100 Max4.3 inchescontinental U.S.1.3 millionRequires ActivationRequires ActivationRequires Activation51003.5 inchesU.S and CanadamillionsIncludedIncludedRequires Activation71004.3 inchesU.S and CanadamillionsIncludedIncludedRequires ActivationNAVIGON Real-Time Traffic City ListingUSAAlbany, NYAlbuquerque, NMAllentown, PAAtlanta, GAAustin, TXBaltimore, MDBaton Rouge, LABirmingham, ALBoston, MACharlotte-Gastonia-Rock Hill, NC-SCChicago, ILCincinnati, OHCleveland, OHColorado Springs, COColumbia, SCColumbus, OHDallas-Ft. Worth, TXDenver-Boulder, CODes Moines, IADetroit, MIFt. Meyers, FLFt. Pierce, FLGreensboro-Winston Salem-High Point, NCGreenville, SCHarrisburg, PAHartford-New Britain-Middletown, CTHouston-Galveston, TXHuntsville, ALIndianapolis, INJacksonville, FLKansas City, MOLas Vegas, NVLexington, KYLos Angeles, CALouisville, KYManchester, NHMadison, WIMemphis, TNMiami-Ft. Lauderdale-Hollywood, FLMiddlesex-Somerset-Union, NJMilwaukee-Racine, WIMinneapolis-St. Paul, MNNashville, TNNassau-Suffolk, NYNew Orleans, LANew York, NYNorfolk-Virginia Beach-Newport News, VAOmaha, NEOrlando, FLPhiladelphia, PAPhoenix, AZPittsburgh, PAPortland, ORPortsmouth, NHProvidence-Warwick-Pawtucket, RIRaleigh-Durham, NCRichmond, VARiverside-San Bernardino, CARochester, NYSacramento, CASalt Lake City-Ogden-Provo, UTSan Antonio, TXSan Diego, CASan Francisco, CASan Jose, CASarasota, FLSeattle-Tacoma, WASpringfield, MASt. Louis, MOSyracuse, NYTampa-St. Petersburg-Clearwater, FLToledo, OHTucson, AZTulsa, OKWashington, DCWest Palm Beach-Boca Raton, FLWorcester, MACanadaToronto, ONMontreal, QCOttawa, ONAbout NavigonNAVIGON has been a leader of GPS navigation since 1991, and has a long history of industry innovations. NAVIGON created the world's first dynamic personal GPS product in 1996, launched the industry's first navigation software for the Pocket PC in 2000, and unveiled the first Traffic Message Channel-based (TMC) avoidance feature on mobile navigation product in 2002.NAVIGON has helped revolutionize how consumers get from place to place with software products for practically any navigation-ready hardware. Personal navigation devices (PND), smartphones, and in-dash navigation systems directed by NAVIGON's award-winning MobileNavigator(MN) software delivers reliable information on millions of destinations in an intuitive, easy to use format. NAVIGON is a valued partner to the automotive industry, and in 2006 strengthened its category competency by acquiring NAVTEQ's navigation software business.NAVIGON is a privately-held software company based in Hamburg, Germany, with NAVIGON USA headquarters in Chicago, IL.", "title": "Navigon 5100 3.5-Inch Portable GPS Navigator", "price": 1.89, "imUrl": "http://ecx.images-amazon.com/images/I/51Qcwo%2BAsKL._SY300_.jpg", "related": {"also_viewed": ["B000W6EUOE", "B00280D390", "B001EJN9OA", "B0057ODOCA", "B007M4Z7GO", "B0066IUPS2", "B00AY7NSTY", "B00AXX0IEC", "B007M52QR6", "B0057ODG6Y", "B004W1GQ92", "B0057OCDQS", "B00AXZY42W", "B005DIBHCE", "B00AXX0I88", "B00AXZWG8Q"], "buy_after_viewing": ["B000W6EUOE", "B00280D390", "B0057ODG6Y", "B001AHAI1I"]}, "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS"]]}