{"asin": "B0028N7442", "related": {"also_bought": ["B002BSGUZ8", "B0040RDT0M", "1600596223", "B0009OAFI4", "B004UR7250", "B007OXY8H2", "B003FHZ3OS", "B00061J2BQ", "B002CGRR8I"], "bought_together": ["B002BSGUZ8"], "buy_after_viewing": ["B009JPEISW", "B004UR7250", "B003VNKNF0", "B008B489RS"]}, "title": "Pentax K-7 14.6 MP Digital SLR with Shake Reduction and 720p HD Video (Body Only)", "price": 809.0, "salesRank": {"Camera &amp; Photo": 9508}, "imUrl": "http://ecx.images-amazon.com/images/I/51l3w6fZauL._SX300_.jpg", "brand": "Pentax", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]], "description": "The Pentax K-7 features a rugged, yet compact new body design, a new 14.6 megapixel CMOS sensor rebuilt from the ground up, and advanced features such as HD Movie Capture and new, unique-to-Pentax camera controls. Compatible with every Pentax lens ever made, the high-end K-7 features an abundance of long-anticipated new and improved features that are exclusive to the camera and combine to make it a tremendous photography tool.The most significant features of the Pentax K-7 that have never been offered before in any K series digital camera, and in some cases any camera, include:A compact, magnesium alloy body that is one of the smallest in the advanced photo enthusiast category to reduce bulk and allow users to travel light while maintaining durability and build quality (seven percent smaller than the K20D and up to 25 percent smaller than other cameras in the same class).A new 14.6 megapixel CMOS sensor rebuilt from the ground up to minimize noise, adds four channel output for fast image capture, and the ability to capture HD quality movies. It is the ideal combination of resolution and file size, allowing very large (poster size and larger) prints and cropping flexibility.A new 77-segment metering system quickly and accurately determines exposure for even the most complex and dynamic lighting situations.HD Movie capture features adjustable quality and resolution settings, aperture control, as well as mechanical Shake Reduction, and an external microphone terminal for recording stereo sound.* The K-7 will capture video at the default standard of 1280x720 resolution with a 16:9 aspect ratio (equivalent to 720p), 1536x1024 resolution with a 3:2 aspect ratio, or 640x416 resolution with a 3:2 aspect ratio (equivalent to VGA quality), all shot at 30 frames per second.An HDMI port with selectable output resolution (1080i, 720p, 480p, and auto) offers high resolution playback of images and video on modern high definition TV&rsquo;s.A Dedicated AF-assist lamp further improves autofocus response and accuracy in low light conditions.An Electronic Level function ensures that images have truly level horizons to minimize post-capture editing.An innovative in-camera Lens Correction function that electronically adjusts for Distortion and Lateral Chromatic Aberrations to maximize image quality with DA series lenses.A dedicated Mirror Lock-up function eliminates image blur due to mirror movement during long exposures.A High Dynamic Range (HDR) image capture mode captures three images then combines them in camera to widen the exposure gamut to bring out detail in all exposure areas of images.A composition adjustment feature in Live View allows minor shifts in the framing and composition of images using the Shake Reduction mechanism without having to physically move the camera. This feature is ideal for tripod use.A programmable embedded copyright function preserves artistic integrity and image ownership during capture via a keypad that may record ownership in metatag data.*Due to the compact size of the K-7 camera and the in-body Shake Reduction mechanism, a camera mounted microphone is a highly recommended accessory for optimal audio quality when capturing video.Pentax K7 Digital SLR HighlightsThe K7's magnesium alloy body is light, durable and weather-resistantA durable, functional body, smaller than any other in its classThe K-7 is built exceptionally solid and durable with a chassis made of a highly rigid stainless-steel alloy and a housing made of a durable but lightweight magnesium-steel alloy. Construction includes 77 seals for weather, dust and cold-resistance for reliable operation even under harsh conditions and at temperatures as low as 14&deg;F (-10&deg;C). The camera also features a newly designed shutter unit providing a top shutter speed of 1/8000 second and the outstanding durability to withstand 100,000 shutter releases. Despite all these features, the K-7 is one of the most compact and functional photo enthusiast level models in the market.High-quality image reproductionThe K-7 incorporates a newly developed CMOS image sensor measuring 23.4mm by 15.6mm and featuring a high-speed, four-channel image data readout. With approximately 14.6 effective megapixels, this image sensor more accurately produces fine-detailed, gradation-rich images. With the adverse effects of digital noise significantly reduced, the sensitivity may be increased from ISO 100 up to the highest level of ISO 6400 (via a custom function).High-performance, high-speed PRIME II imaging engineThe K-7 features the newly developed PRIME (Pentax Real Image Engine) II, an upgrade of the original PRIME, as its imaging engine. This new imaging engine offers faster data-processing speed for higher quality images with richer gradation and more accurate color rendition. The system also offers high-speed movie data transmission.A wealth of inputs--including HDMI--make it simple to share images and video captured on the K7High-quality movie recording at 1280 x 720 pixels; 30-frames-per-secondThe K-7 adds a new movie recording function, extending the benefits of SLR photography to the world of movie shooting: For instance, reduce the depth of field to make the subject stand out, or use different lenses to create distinctive visual effects. Beautiful movie clips can recorded at different sizes--640 x 416 pixels, 1536 x 1024 pixels, or 1280 x 720 pixels (16:9 high-definition TV proportions)--at a frame rate of 30 frames per second. The K-7 is also equipped with an HDMI terminal and an external microphone input terminal for high quality sound to match your videos.Large, easy-to-view 3.0 inch wide-view LCD monitor with 921,000 dot resolutionThe K-7 features a large 3.0 inch color LCD monitor with 921,000 dot resolution. The wide-view design allows the photographer to check the monitor image from approximately 170 degrees both vertically and horizontally, facilitating low and high-angle shooting using the Live View function.High-speed continuous shooting at approx. 5.2 images per secondThe high-speed continuous shooting mode captures as many as 40 images (in JPEG recording format) at a maximum speed of approximately 5.2 images per second, allowing photographers to follow the movement of an active subject or preserve a sequence of the subject&rsquo;s expressions.New 77-segment multi-pattern meteringNewly-developed for the K-7, a sophisticated 77-segment multi-pattern metering system greatly improves light-metering accuracy. By accurately analyzing various types of data (such as the image&rsquo;s composition and format between upright and horizontal, and the subject&rsquo;s distance and magnification) transmitted from the sensors in the camera body, this system greatly improves the accuracy of exposure control.Live View image confirmation with Face Recognition AF and high-speed continuous shooting modesThe K-7 features the Live View function, which allows the user to view the image on the LCD monitor during shooting. This function is available not only in the Contrast AF mode, which optimizes the focus based on the subject&rsquo;s contrast, but also in the Face Recognition AF mode, which automatically and accurately focuses on the subject&rsquo;s face. A newly developed diaphragm-control mechanism allows the Live View function be used during Continuous Shooting mode with the mirror at lock-up position.Optical viewfinder provides 100 percent field of viewThe K-7 glass prism finder offers 100 percent field of view and an approximately 0.92X magnification to facilitate focusing and framing operations. A new Natural-Bright-Matte III focusing screen improves focusing accuracy during manual-focus operation.3.0-inch LCD monitor with Live ViewNew 11-point wide-frame AF sensorThe K-7&rsquo;s new SAFOX VIII Plus wide-frame autofocus system features 11 sensor points (with nine cross-type sensors positioned in the middle). By adding the light source type to its data range, and driven by a greatly improved algorithm, Pentax improved the AF system assuring reliable, responsive autofocus operation superior in speed and accuracy to the previous system. The K-7 also incorporates an AF-assist spotbeam projector in its built-in flash unit to improve autofocusing accuracy in the dark.Next-generation Shake Reduction mechanism*The K-7 features the Pentax-developed SR (Shake Reduction) mechanism, which effectively compensates the adverse effect of camera shake by approximately 2.5 to 4 shutter stops, assuring sharp, blur-free images even under demanding shooting conditions. This innovative mechanism is compatible with all Pentax interchangeable lenses ever produced. This new-generation version allows complete shift freedom, including rotationally, of the image-sensor regardless of the camera&rsquo;s inclination. The mechanism also provides user-friendly new functions such as Automatic Level Adjustment and Minute Angle Adjustment (up/down, right/left and clockwise/counterclockwise) to help photographers compose images exactly to their specifications.* Lenses compatible with this mechanism are the Pentax K-, KA-, KAF-, KAF2- and KAF3-mount lenses; screw-mounted lenses (with an adapter); and 645- and 67-system lenses (with an adapter). Some functions may not be available with certain lenses.New DR II mechanism to minimize dust spotsThe K-7 is equipped with a newly developed Dust Removal (DR II) mechanism to more effectively remove dust and minimize spots on recorded images even after changing lenses in dust-prone outdoor settings. Using a piezo-ceramic vibration action, the system shifts or vibrates the low-pass filter located in front of the CMOS image sensor at supersonic speed to remove dust more efficiently. A unique dust-alert system also allows users to check for dust adhering to the low-pass filter prior to actual shooting.Custom Image function to easily create desired visual effectsThe K-7&rsquo;s Custom Image function lets the user control the image&rsquo;s finishing touch to capture their photographic intention, or reproduce the ambience of the scene. With the K-7, the user can select one of seven modes, including the new \"Muted\" mode designed to recreate an image with delicate, subdued colors. In addition to saturation, tone, contrast and sharpness, the function now makes it possible to adjust \"key\" and \"contrast highlight/shadow\" to the desired levels. The effects of these factors may be effortlessly confirmed on a preview image using the Digital Preview or Live View function before finalizing the settings.Versatile exposure system for exceptional reproduction of creative intentionsHyper Program functionThe K-7&rsquo;s Hyper Program function allows users to instantly switch to the Shutter- or Aperture-Priority AE mode from the Programmed AE mode, with a simple turn of the electronic dials on the grip. To return to the Programmed AE mode, simply press the green button positioned next to the shutter release button.Hyper Manual functionWhen shooting in Manual mode, a single push of the green button allows the user to instantly set the proper exposure for the subject.Sensitivity-Priority modeThe K-7 features a unique Sensitivity-Priority (Sv) mode, which is designed to automatically select the optimum combination of aperture and shutter speed for a user-selected sensitivity. The sensitivity can be shifted instantly in 1/2 or 1/3 steps by turning the electronic dial on the back panel.Shutter/Aperture-Priority modeTaking full advantage of the unique capability of digital cameras permitting automatic shift of sensitivity at any time, the Shutter/Aperture-Priority (TAv) mode automatically selects the most appropriate sensitivity for a user-selected shutter-speed/aperture combination. This allows the user to experiment with a greater range of photographic expressions with great ease.Powerful rechargeable batteryThe K-7 is powered by a large-capacity, rechargeable lithium-ion battery, which can capture approximately 980 images* when fully charged.*Under testing conditions prescribed by Pentax, when using a rechargeable D-LI90 lithium-ion battery with no flashAdditional features:HDR (high dynamic range) function to create one composite image with an extra-wide gradation range from three images with different exposuresDynamic-range expansion function to compensate for both white-washed (overexposed) and blacked-out (underexposed) areasDigital level function for easy checking of the image&rsquo;s levelsAutomatic compensation of distortion and lateral chromatic aberration (available only with DA- and DFA-series lenses)White balance control, featuring a new CTE mode to emphasize the color components of sunset scenes and a new incandescent-tinted fluorescent light modeMulti-exposure function, with a superimposition of already-recorded images on the LCD monitor for at-a-glance comparisonAttachment of copyright credits on recorded imagesRAW button for single-action switching of image file format16 digital filters to add a range of visual effects; a new function to record an overwritten history also availableColor-specific control buttons/dials for easy recognition and quick access, based on the universal color designPentax Digital Camera Utility 4 software package, including a RAW-data processing application (based on the popularSILKYPIX RAW-data processing engine developed by Ichikawa Soft Laboratory) and a browser application"}