{"asin": "B00149ILDO", "description": "The Saboteuris a brand-new take on familiar World War II gaming. The first open-world, action game set in Nazi-occupied Europe, it contains a mix of single player stealth, third-person shooter and racing gameplay in which the player assumes the role of a hero obsessed with a personal vendetta against the Nazi regime. Utilizing a wealth of items, abilities, weapons and vehicles the player turns his private, stealth war into something much broader with the game's \"Will to Fight\" system which graphically reflects the will of the occupied peoples in the game, which can proves the deciding factor for all..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Open-world WWII gameplay.View larger.A wide array of weapons and items.View larger.Fast-paced vehicular action.View larger.Restore color and hope to Paris.View larger.StoryWelcome to Nazi-occupied Paris, a unique open-world environment where you take on the role of street-tough Irish race driver Sean Devlin and eventually becomeThe Saboteur. Although living in occupied WWII Paris, Sean is initially concerned only with the racing lifestyle and his friends within it. That all changes though when the Nazis kill his friends, and change his life forever. Seeking personal retribution on a Nazi officer and others involved, Sean's life soon becomes dominated by a need for payback, which is exacted with the help of the French Resistance, British intelligence, an arsenal of weaponry, and your own street smarts and brawn. Motivated by retribution and armed with tactics of sabotage you are a one man wrecking crew, blowing up zeppelins, derailing trains, imploding bridges, destroying armored tanks, and leveling enemy facilities in the name of vengeance.Open-world GameplayThe Saboteurin the first open-world, action game set in Nazi-occupied Europe, and combines a variety of different kinds of gameplay, including third-person shooter, stealth and racing. As in other open-world games, this means that although players will be tasked with completing an extensive list of set missions against Nazi units and individuals, they will also have the freedom to explore and fight throughout the game world as they choose. This world although set in Paris also encompasses the French countryside, as well as parts of Germany. Within it players will be able to use representations of actual landmarks &#151; for example, the Eiffel Tower &#151; for navigation, and a variety of vehicles for transportation and combat. In mission play, with each success players move closer to tracking down the particular Nazis responsible for the death of Sean's friends by putting the rewards that they receive for success to work on the black-market. They can trade for all sorts of items to help their progress, from weapons, to cars, maps and more. These all can also either be found throughout the game, or taken from defeated opponents, although the more commotion that is created and the higher the skills of the player, the greater the enemy response will be.The \"Will to Fight\" SystemAlthough built around Sean's desire for personal revenge,The Saboteuralso contains a play mechanism through which the lives of the non-player characters (NPCs) are improved, and can even be manipulated. This is the \"Will to Fight\" system. Long known as the \"City of Light,\" Paris as depicted in the game under Nazi occupation is a place dominated by stark black and white colors. These colors reflect the hopelessness of the people. But as the player collects victories against the invaders, a change will begin to be seen in the physical environments of the game, again reflecting the mood of the people. Where once there were only stark black and white colors and few civilians on the street, now players will see increasingly bright colors, reflecting the hope of the civilians and eventually incite an underground resistance among the Parisians to take up arms on their own, and even come to your aid when the odds are stacked against you.Key FeaturesExplore Open-World Paris- Climb the Eiffel Tour, snipe from Notre Dame Cathedral, and brawl on the Champs d&rsquo;Elysee as you sabotage your enemies. Fight, climb, and prowl through the dark alleys, rooftops, burlesque houses, and seedy streets of the City of Lights&mdash;the ultimate playground for The Saboteur.Be the Saboteur- Use a broad range of weapons and explosives to perform your blockbuster sabotage as you single-handedly hunt-down your enemies to dismantle and destroy the Nazi occupation.Stealth Gameplay- Use gameplay systems like climbing, sneaking, and stealth Kills to infiltrate the Nazi occupation to perform acts of sabotage Once you've blown your target to pieces, leverage the intuitive cover system and assortment of weapons to blast your way to freedom.Vertical World- This version of Paris was designed to leverage the unique abilities ofThe Saboteur. Being a saboteur is all about surprise attacks and Paris' rooftops are the perfect path for your secret operations.The \"Will to Fight\" System-The Saboteurintroduces a innovative new feature that is both an iconic visual style, and a compelling gameplay element. See and feel Paris change around you as you progress through the game. Go from a dark and oppressed black and white policed state, to a bright and inspired world where the citizens fight back.Jack Your Ride- From high performance race cars to military vehicles, asThe Saboteur, you can drive any vehicle that comes along to escape your pursuers.", "price": 51.89, "imUrl": "http://ecx.images-amazon.com/images/I/61iIKd48HjL._SY300_.jpg", "related": {"also_bought": ["B0016GC9D8", "B00198PO5I", "B000XJNTQ0", "B001CRM3YQ", "B001RTCOWA", "B001UWGCW2", "B001GGO1GG", "B002I0J5UQ", "B0014UGK8G", "B003VKLAAU", "B0050SX2MK", "B0076ZQSFI", "B0023CBZ70", "B0012NAPNQ", "B000N4MSAS", "B000QAVV6G", "B001ASJIRC", "B00170823O", "B00320JAWY", "B004EW948E", "B0022TNO7I", "B00KF7BEFS", "B00432O50W", "B000GPXSCQ", "B000X2SGRY", "B002I0H2G0", "B002I0K5NC", "B001E7MMNG", "B000PS4X9G", "B0050SXX88", "B00354NANC", "B004ML44Y6", "B000UUATJ2", "B001AWBYNE", "B009DZTXQU", "B001PKHRUK", "B003H0CBYS", "B003PHLT8W", "B005EZ5GW8", "B004FUI84G", "B000RHZ9G6", "B000HWX418", "B008XMSR6G", "B001TOMQSK", "B00G6MW4SM", "B0050SXEM8", "B000HKMPVA", "B005J5K9UW", "B001TOMQOY", "B001SGZL2W", "B000QU1BEI", "B004HCYVO8", "B000WS97QI", "B005C2D1YI", "B003S2MXQG", "B000MF8AV4", "B000GA73O0", "B004FS8LYK", "B001AWDFUY", "B00AA4FDSA", "B005DKMCCG", "B005YR308S", "B005N4HBIW", "B007V9NHMQ", "B0087Y3DSW", "B001DYVHY0", "B003GT8IL0", "B004QEWVLC", "B00G9DFMDW", "B000NGP1R8", "B003FBL85M", "B003QX4F7C", "B00BU3WVM6", "B0050SXBQC", "B000K9OP2A", "B004LWEK7C", "B0050SXFKE", "B000V7KLKQ", "B002DC8GKO", "B0014G26WO", "B002BXKJ6O", "B000XJLQ24", "B00HQY8LRM", "B001NX6GBK", "B003O6E6EI", "B0086V5V8G", "B0016PZYLS", "B000WQWPP0", "B001YHX4B0", "B0030GBSUC", "B00AMA4L4E", "B000SH3XCW", "B000UW1YBW", "B001CSPRJI", "B0030GBU2I", "B00319DX4M", "B003P9FRGA", "B0044SA734", "B00163LW7K", "B000XJK40O"], "bought_together": ["B00198PO5I", "B002I0J5UQ"], "buy_after_viewing": ["B00198PO5I", "B001GGO1GG", "B0016C3260", "B0050SXX88"]}, "salesRank": {"Video Games": 8848}, "categories": [["Video Games", "PlayStation 3"]]}