{"asin": "B000YIWR8G", "related": {"also_bought": ["B0000BZLBQ", "B0080JH3YE", "B001KELVS0", "B0045KGZOG", "B0033PRWSW", "B00004ZCJM", "B007G5NNOW", "B004AH10K8", "B000PTFDYO", "B00K899B9Y", "B0048IW030", "B003Y30334", "B00HTWF9ZI", "B00004ZCJI", "B007NDL56A", "B000NP46K2", "B007FGZ1V0", "B00BXA7N6A", "B002ZIMEMW", "B000A1SWOA", "B000YIYQ30", "B007M54E1M", "B00004ZCI3", "B00009R6WO", "B009B0MZG2", "B00007EDZG", "B007FH1KX2", "B009EM694G", "B002WE4H8I", "B00004ZCJK", "B007FGYZFI", "B007FH1LJU", "B0049XGNKK", "B00007LA0T", "B00006I53W", "B00009XVCZ", "B0093HGEKG", "B0062W02C6", "B001CCAISE", "B000VDCT3C", "B007BXD66E", "B003ZDHP7U", "B003ZSHNE0", "B007TIYYQ2", "B001F6TXME", "B00796D03C", "B009JZ08D6", "B001S2PPT0", "B002JCSV8U", "B00DUQ09K2", "B0000BZL8H", "B0000BZL68", "B00006JN3G", "B002PLQ7LI", "B0053NWF8O", "B00007E7JU", "B00CBB5GVO", "B003656Q7C", "B004OR15LI", "B00FP1BQ1Q", "B000CLNHXY", "B005AY9278", "B0081ER9KG", "B00004ZCJG", "B00EE1ZH6I", "B0076BNK30", "B00004ZCK0", "B00ECEVEP0", "B00017LSPI", "B002O3KVSC", "B0014ZADVQ", "B000I1X3W8", "B00E00HQL2", "B0043D2L6Q", "B003BQ71MA", "B004NROQCO", "B004TJ6JH6", "B00004ZCFQ", "B00DA8459G", "B004Y1AYAC", "B007ORXEIW", "B004V6BQ3O", "B004Z55VP0", "B000HDZAUA", "B004AQ95A6", "B00AE1M31Y", "B004XY65WQ", "B003SQEAY0", "B00IAYFDIC", "B001M4HXB2", "B000CBLYVG", "B001QWBM62", "B001ENW61I", "B007SNP02K", "B005ES0YYA", "B0000BZL9J", "0321934318", "B0027JM35M", "B0045JCPQE"], "bought_together": ["B0080JH3YE"], "buy_after_viewing": ["B000YIYQ30", "B002DW99H8", "B005MYAHJ8", "B000YA33DC"]}, "title": "Lowepro Fastpack 350-Black", "price": 86.45, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41w6g6Su2KL._SY300_.jpg", "brand": "Lowepro", "categories": [["Electronics", "Computers & Accessories", "Laptop & Netbook Computer Accessories", "Bags & Cases", "Sleeves & Slipcases"]], "description": "Fastpack 350Manufacturer Description:Go all day with the lightweight, comfortable Fastpack 350 backpack. It protects your pro digital SLR and 17\" widescreen notebook compactly while providing generous storage for other gear. Side-entry compartments let you quickly grab equipment and accessories, even while you're on the move. You won't miss a shot, because side-entry compartments let you grab equipment and accessories, even while you're on the move. Customize the easy-to-access main compartment with adjustable dividers, use the outer organizer to keep large accessories handy, and manage memory cards with a built-in pocket. Breathable, contoured shoulder straps distribute weight evenly.Hardware Capacity:1 pro digital SLR with lens attached (up to 70-200mm f/2.8), 2-3 additional lenses or flash units, 17\" widescreen notebook, memory cards, batteries and cables.Fastpack 350 Highlights:1.&nbsp;Security FlapProvides additional protection to outer compartments2.&nbsp;Built-in Memory Card HoldersEfficiently manage memory cards3.&nbsp;180-degree Side-entry PanelProvides complete access to camera compartment and lets you easily customize camera kit to suit your shooting needs4.&nbsp;Adjustable DividersDelivers excellent protection in customized fit that's easy to load5.&nbsp;Triple Compartment DesignEnsures superior camera protection, notebook protection and organizes personal accessories6.&nbsp;Harness PocketProvides easy access to MP3 player or mobile phone7.&nbsp;Outer Accessory PocketsProvides external storage for large accessories to provide fast access8.&nbsp;Mesh Side PocketKeeps a water bottle or other personal items readily accessible9.&nbsp;Tough, Water Resistant Outer FabricProtects against moisture and abrasion10.&nbsp;Side-entry AccessOffers fast and easy access to camera and gear so you can capture that perfect shot in a moment&nbsp;Additional Features &amp; Benefits:Compact design protects camera with large lens plus notebook computer while providing generous storage for accessoriesLightweight material makes this bag perfect for daytripsPadded main compartment with full 180-degree access and adjustable dividers delivers excellent protection and a customized fitPadded, contoured shoulder straps with DryFlow fabric provide breathable comfortBuilt-in pockets efficiently manage digital accessoriesReversed zipper with silent pulls resists sand and dirtDurable, water-resistant outer fabric helps protect against the elementsAir mesh padded back provides enhanced comfort, moisture wicking and ergonomic support"}