{"asin": "B000NO5QVG", "description": "Designed for exclusive use with Pentax digital SLR cameras, the Pentax DA series 50-135mm telephoto zoom lens makes it easy to capture close-in sports shots or intimate wildlife photography. The lens is distinguished by its aspherical elements, special optical-glass elements, and original glass coatings, which help produce a high contrast, unmatched clarity, and edge-to-edge sharpness. The lens also boasts a tightly sealed weather- and dust-resistant housing that stands up to rainy or dusty conditions. And users will love the new SDM system, which produces smoother, quieter autofocusing using a built-in supersonic motor. Other details include a Pentax-original Quick-Shift Focus System that switches instantly to manual-focus operation, a Pentax SP coating that protects the exposed lens elements, and a focal length equivalent to 76.5-207mm in the 35mm format.Lens mount: Pentax KAF2Lens construction: 18 elements in 14 groupsAngle of view: 31.5 to 11.9 degrees (when used with Pentax digital SLR camera body)Aperture control: AutomaticMinimum aperture: F22Metering system: TTL open-aperture meteringMinimum focusing distance: 1 meterFilter size: 67mmMaximum magnification: 0.17xDimensions: 3 inches in diameter and 5.4 inches longWeight: 24.2 ounces (without hood)", "title": "Pentax SMC DA* Series 50-135mm f/2.8 ED IF SDM Telephoto Zoom Lens for Pentax and Digital SLR Cameras", "brand": "Pentax", "imUrl": "http://ecx.images-amazon.com/images/I/41wRJ95IQ-L._SY300_.jpg", "related": {"also_bought": ["B000NO5QV6", "B004UR7250", "B0040RDT0M", "B009JPEISW", "B00FKLQ0LW", "B0099J8A2S", "B0042RTQPC", "B00861DI4U", "B00004ZCJK", "B0030GGS3O", "B001F514F4", "B00004ZCFQ", "B002CGRR8I", "B0000BZL8H", "B002CGRR9C", "B005TCMW7S", "B001GAPHRE", "B0013545U2", "B001G7PMFY", "B000B8AF9W", "B007NDL56A", "B000B8AFUG", "B004HD577M", "B007NDL54C", "B0001DBZKK", "B006IQ3W0U", "B000R8Z2DK", "B0013HAC0C", "B001JUBXN8", "B004DUMU8I", "B0007YZLFS"], "bought_together": ["B000NO5QV6", "B009JPEISW"], "buy_after_viewing": ["B0040RDT0M", "B009JPEISW", "B009D79VH4", "B0030GGS3O"]}, "categories": [["Electronics", "Camera & Photo", "Lenses", "Camera Lenses", "Digital Camera Lenses"]]}