{"asin": "B001CB0RSG", "description": "Experience your MP3 music as the artist originally intended with the Creative ZEN X-Fi--the first player to restore the quality of compressed music with award-winning X-Fi Xtreme Fidelity Audio technology. Indulge in rich, crystal-clear audio when you listen to your music, as the detail that's lost during file compression is now beautifully restored and played through premium-quality, noise-isolating EP-830 earphones.Creative ZEN X-Fi, built with X-Fi technology and wireless LAN--the sound of perfection.Click to enlarge.A pocket-sized player that weighs a mere 2.4 ounces, the ZEN X-Fi sports attractive curves with a graceful finish.Click to enlarge.The included EP-830 earphones provide optimum comfort with excellent noise isolation.Click to enlarge.A control/feature schematic.Click to enlarge.Immerse yourself in the brilliant 2.5-inch TFT screen with 16.7 million colors as you watch your movies and view your pictures.Click to enlarge.Sleek BeautyA pocket-sized player that weighs a mere 2.4 ounces, the ZEN X-Fi sports attractive curves with a graceful finish. Immerse yourself in the brilliant 2.5-inch TFT screen with 16.7 million colors as you watch your movies and view your pictures. Built with X-Fi Xtreme Fidelity Audio technology, the player lets you experience the very essence of music perfection as you listen to audio in crystal-clear clarity. Hear your music the way it was always meant to be heard. Plus, the included EP-830 earphones provide optimum comfort with excellent noise-isolation capability. Or, be the life of the party as you share your music out loud with the powerful built-in speaker.True MobilityYou can now stream music and photos wirelessly from your PC to your player within a home network. With the ZEN X-Fi, experience the sound of perfection wherever you go.Stay connected with friends on Yahoo Messenger or Windows Live Messenger on the go (at region-specific public wireless LAN hotspots).More Content, Endless EnjoymentListen to your music in multiple supported formats such as MP3, WMA, and (non-protected) AAC (m4a) from iTunes Plus. Download Creative Centrale to rip, transfer, and manage your media content easily. Enjoy the ultimate collection of free video and audio podcast channels on www.zencast.com. Manage all of your favorite subscriptions with ZENcast Organizer, and experience the best of the free-to-share formats available. Tired of your own music? Switch to the FM radio. The 32 station presets let you switch stations with ease. Increase the size of your portable media library with an SD or SDHC card. Transfer your files easily to enjoy more videos, music, and photos on your player.Packed with FeaturesRecord your important meetings or personal audio memos with the integrated voice recorder. Set audio effects to enhance your overall music-listening experience. Choose from eight EQ presets or customize your own EQ, and enhance it all with bass-boost and smart-volume controls. Start the day on the right note with your very own alarm tone. You can even set the alarm for any day of the week.What's in the BoxCreative ZEN X-Fi 16 GB, installation CD, quick start guide, wireless function quick guide, EP-830 noise-isolating earbuds, and USB 2.0 cable.", "title": "Creative Zen X-Fi 16 GB Video MP3 Player with Wireless LAN and Built-In Speaker (Black/Silver)", "price": 259.0, "imUrl": "http://ecx.images-amazon.com/images/I/31vsyXZgUZL._SX300_.jpg", "related": {"also_viewed": ["B003G4ZQV0", "B004EW0P9G", "B005MJU1QC", "B000CS7U1C", "B000IF4TPY", "B003G4XRI4", "B002JPITXY", "B008G5ZAGU", "B008RK9XTO", "B00ECQUY2M", "B009K6ULV8", "B0002BRMNA", "B007R00TKM", "B000WFZSBE", "B003G4XRJS", "B008V99972", "B003ULP5PG", "B004ZF0T4I", "B00HCMZ2SE", "B007B5TOZY", "B00EPFLJS8", "B00IBR5QJY", "B003D78O1Y", "B000EPLP3C", "B007B5TPEY", "B002IPHA1W", "B002MAPS6W", "B00DE14T9U", "B007V7XQ7E", "B002JPITY8", "B0041G62VU", "B0041G62TW", "B001EWDFCI", "B003ES5GWW", "B005FPT5DS", "B004EVV3KM", "B007M6EYU2", "B0044ZFXS6", "B00JQI6C72", "B00963DPUY", "B000IBNXX2", "B004M8STFY", "B009JXJJK6", "B001PR1ZMY", "B00JTOC286", "B008RK9XGW", "B002MAPT7U", "B00DE16F74", "B005FVNH04", "B00EE1H7BQ", "B00ECRRB8G"], "buy_after_viewing": ["B002MAPT7U"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}