{"asin": "B00005T6GZ", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Modems"]], "description": "Are you ready to step up to high-speed broadband Internet? The EtherFast cable modem with USB and Ethernet connection from Linksys provides you with the perfect solution for a fast and easy Internet connection.Now you can make the most of the Internet and cruise the Web at speeds you never imagined possible. Cable-modem Internet service means no more waiting for lagging downloads--even the most graphic-intensive Web pages load in seconds.And if you're looking for convenience and affordability, the EtherFast cable modem with USB really delivers. Installation is quick and easy. The plug-and-play EtherFast cable modem with USB connects directly to any USB-ready PC--just plug it in and you're ready to surf the Internet. Or connect it to your LAN using a router and share that speed with everyone on your network.So if you're ready to enjoy broadband Internet speed, then you're ready for the EtherFast cable modem with USB and Ethernet connection from Linksys. It's the easiest and most affordable way to harness the full potential of the Internet.Features:Easy installation--one phone call to your Internet service provider completes the setup\"Always on\" connection eliminates worries about busy signals and time-outsMuch faster downloads and uploads than dial-up Internet connectionsSeamlessly compatible with Linksys routers", "title": "Cisco-Linksys BEFCMU10 Ethernet Cable Modem", "price": 99.95, "salesRank": {"Electronics": 20536}, "imUrl": "http://ecx.images-amazon.com/images/I/41W61T0K22L._SX300_.jpg", "related": {"also_viewed": ["B002M3SHXA", "B006IJHK96", "B000WIK61I", "B0000TW3RE", "B000JV9LUK", "B001L9265G", "B00723KZTY", "B00D35XKW4", "B00005T3T6", "B00008Y1BX", "B002V41X2M", "B004XC6GJ0", "B00BHZLHBI", "B0009IRUKG", "B006GDTTM0", "B006UK3K06", "B0047106KC", "B007OAHDTU", "B00004SB92", "B008A2OG3C", "B0002JKGRQ", "B00AJHDZSI", "B0000CFY6K", "B00K1FZ64Y", "B0009K9FZW", "B00E6IQ1BE", "B001UI2FPE", "B009WC6RRC", "B0040IUI46", "B005HFJFHW", "B007I81588", "B0001MQSB2", "B0063K4NN6", "B001C4VRZK", "B00768SBAU", "B00IF0JAIU", "B00I6NKP62", "B00A0L0GC6", "B00IF0JAYE", "B00274S55O", "B000BTL0OA", "B001AMUI7W", "B0034JSYZ2", "B00HC0ZDOE", "B0039UWW54", "B00723PZ2G", "B005Y1UFIM", "B008Y7CESM", "B008GG78FU", "B007IMPMW4", "B00GJ7Y7MU", "B002M3SJ6U", "B00005ARK3", "B00C1TSFH8", "B0056VN9M4"], "bought_together": ["B000BTL0OA"], "buy_after_viewing": ["B004XC6GJ0", "B00AJHDZSI", "B002M3SHXA", "B006IJHK96"]}}