{"asin": "B0046A8YEO", "description": "The verdict is in: The Eco-Vue is the perfect smart accessory for the stylish, eco-conscious Kindle reader&#x2013;case closed. Marware didn&#x2019;t just create a folio leather case&#x2013;we created a folio style responsible leather case with tons of added functionality. From its innovative elastic hand strap system to its soft charcoal microfiber interior, the Eco-Vue was engineered with unmatched functionality and uncompromising style. In addition to the convenient interior hand strap that helps hold the Kindle securely while walking, exercising, or lounging around, the Eco-Vue also offers an inner storage pocket that&#x2019;s great for cards or cash, a non-slip interior safety tab that locks the Kindle safely in place, an elastic strap that helps keep the case open or closed, easy access to all ports/buttons, and a sleek design. The Eco-Vue for Kindle is an attractive case designed to improve your reading experience.     In addition to the style and functionality, Marware utilizes durable eco-leather, so each Eco-Vue case helps protect your investment and the environment. What's so great about eco-leather? The tanning process used to make this leather uses fewer toxins than traditional leather tanning. This minimizes toxic runoff into the ground and water tables. Throughout the entire process, the leather remains RoHS (Restriction of Hazardous Substances) compliant. No chlorine, no sulfuric acid, and no petroleum/chemical based dyes. This is real leather, without the environmental impact of standard tanning and dyeing processes.", "price": 9.99, "imUrl": "http://ecx.images-amazon.com/images/I/31qd%2BUgLnhL._SY300_.jpg", "related": {"also_bought": ["B0046LD4X4", "B00AJ0X4WW", "B0046L7X0E", "B007HCCNJU", "B004ZN5Q5W", "B004JWA70I", "B006BGZJJ4", "B004JXVOD6", "B007MLLKDG", "B004A7ZEI2", "B00BXX0QVQ", "B0069R1G4M", "B009RFYDOS", "B003HKRVAW", "B005QFH62O", "B007HCCOD0", "B00489ZUNQ", "B008SYWFNA", "B007OZNUCE", "B006WQDNEG", "B006GWO5WK", "1593592116", "B004E8X6FU", "B0057WTEWQ", "B005DOKG70", "B0062IPIPQ", "B001W1TZTS", "B00884SJKS"], "buy_after_viewing": ["B004JXVOD6", "B007HCCNJU", "B0042AM7L4", "B004SK60JS"]}, "categories": [["Electronics", "eBook Readers & Accessories", "Covers"]]}