{"asin": "B000AYKV4G", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "With 5.0 megapixels, the A610 incorporates a host of high-end features normally reserved for G-series PowerShots. The DIGIC II processor drives a fast, responsive performance, and--in combination with the camera's 4x optical zoom lenses--delivers superior image quality. A wide range of manual, automatic, and special scene modes offer flexibility, creative control, and simplicity when required.The camera also features a 2.0-inch vari-angle LCD, My Colors, and a macro mode that allows photographers to get as close as 1 centimeter. VGA movies at 30 frames per second can be created. A complete range of optional accessories, including wide and tele-converters and waterproof case, extends shooting flexibility. (Accessories not included--must be purchased separately.) A comprehensive software suite is provided as standard. The A610 is equipped with a Print/Share button, PictBridge printing, as well as ID Photo Print and Movie Print. USB 2.0 Hi-Speed connections provide for high-speed transfer of image data.Improved resolution, zoom, and image qualityReplacing the popularPowerShot A95, the new camera has been given a serious performance boost. The A610 features a 5.0-megapixel CCD sensor, delivering image quality suitable for detailed photo-quality prints up to 13 x 17 inches and allowing substantial cropping without loss of print quality.The precision Canon zoom lens in this new camera follows the design and construction of G-series lenses, with eight elements in seven groups, and incorporating two aspherical elements. The upgrade to a 4x optical zoom provides a 35-140mm focal length (35mm equivalent). With a maximum aperture range of f2.8 (W) to f4.1 (T), the lens is impressively bright at the telephoto end. In addition, focusing performance in low light has improved by up to 2 stops, resulting in greater freedom when shooting in dim conditions.The lenses' spectral characteristics have been optimized specifically for the configuration of the lens and sensor, providing accurate colors and significantly reducing the chromatic aberrations (such as purple fringing) often found with lower quality lenses.Advanced processing and focusingThe addition of Canon's advanced DIGIC II image processor results in a faster and more responsive camera that delivers improved image quality. Focusing time has been cut by around 60%, and shutter lag is negligible at no more than 0.1 seconds. Smooth continuous shooting is now available at approximately 2.4 frames per second. With DIGIC II's superior assessment of white balance, color rendition accuracy is increased.The new PowerShot still features Canon's 9-point AiAF for fast, accurate focusing even when subjects are not centerd. FlexiZone AF/AE allows free scrolling anywhere within the frame's auto focus area to select the desired subject, for which exposure is weighted accordingly. Manual focus selection is also available.Increased versatilityA larger 2.0-inch vari-angle LCD offers users great versatility in composing shots from awkward angles, such as from ground or waist level, above the head, and when shooting self portraits. The selectable grid line display helps with composition and levelling horizons.The A610 incorporates a total of 20 shooting modes, including full Manual mode, a Custom mode for allocating preferred shooting settings, and a shutter speed priority mode, with shutter speeds ranging from 15 seconds to 1/2500 second. Eight scene modes--such as Night Snapshot, Snow, and Underwater--maximize results in a variety of shooting situations. The Stitch Assist mode facilitates shooting pictures for panoramas, which can be joined together easily with the supplied PhotoStitch software. My Colors--located on the mode dial--allows the expansion of creativity in digital photography. Special effects, such as Color Swap or Custom Color, which allows users to select their preferred color balance for any given shot, can be performed in-camera and viewed on the LCD while shooting stills and movies. These effects could previously only be achieved using PC software after shooting.High-quality movies are selectable from VGA (30/15 frames per second), QVGA (30/15 frames per second), Fast Frame Rate (for slow motion replays in camera), and Compact Mode (for clips that are ideal for e-mailing).Advanced printingWhen used in combination with Canon's new Compact Photo Printer Selphy CP510 and Canon's Ink and Paper Set (KP-108IP), prints can be produced very inexpensively. Printing via Selphy CP Compact Photo Printers also allows the user to print handy ID photo prints and movie prints.When connected to the latest range of PictBridge compatible PIXMA printers, image enhancement is possible with functions such as Noise Reduction and Vivid Photo, as well as the new Face Brightener feature. Also new is Captured Info print, which prints shooting data such as shutter speed, aperture and shooting mode within the photo border.Printing images without having to connect to a PC is kept simple with the Print/Share button, which also acts as an easy upload button for Windows XP and Mac OS X.Comprehensive softwareThe new cameras come bundled with a comprehensive software suite, including Canon's browsing and printing software ZoomBrowser EX 5.5 (Windows) and ImageBrowser 5.5 (Mac), easy printing software PhotoRecord 2.2 and PhotoStitch 3.1 for creating stunning panoramas. Also included is the photo manipulation software, ArcSoft PhotoStudio.Purchasers of the cameras are eligible for membership of Canon iMAGE Gateway , which offers 100 MB of online space for uploading and sharing images, and supports My Camera, which allows users to further customise their camera settings.Supported operating systems are Windows 98 (SE), Me, 2000 (SP4), XP (SP1/2) and Mac OS X v10.2-v10.3. The cameras support PTP for driverless transfer to supported Windows XP or Mac OS X.What's in the boxPowerShot A610 body, four AA-size Alkaline batteries, 16 MB SD memory card SDC-16M, wrist strap WS-200, Digital Camera Solution CD-ROM, USB interface cable IFC-400PCU, audio-video cable AVC-DC300", "title": "Canon Powershot A610 5MP Digital Camera with 4x Optical Zoom", "price": 6.98, "salesRank": {"Camera &amp; Photo": 12070}, "imUrl": "http://ecx.images-amazon.com/images/I/41P6ZEHDAJL._SY300_.jpg", "related": {"also_viewed": ["B000AYJDD6", "B000HAOVC6", "B0009GZSSO", "B000HARTYI", "B005MTME3U", "B000EMWBV0", "B00HLDFPA4", "B0075SUIEI", "B00908BQCY", "B0075SUII4", "B009B0MZ1M", "B00908BMVE", "B00I58LZRG", "B00HQ4W76I", "B005AVL1J8", "B003WJR69E", "B0011ZCDKS", "B00HLDIDVM", "B0075SUK14", "B0007MVHZS", "B00EFILR6E", "B00B5HE2MO", "B0075SUIOS", "B000V1VG2E", "B004J41T7Q", "B004J3YCGM", "B0041RSPRS", "B00HLDFNKQ", "B0011E67BA", "B00AQDG7YE", "B00AWYN0ME", "B0032JRRXE", "B009I2TP7K", "B00EFILHB4", "B00728ZBA2", "B00BW6LTG0", "B006UMM15O", "B00I58M26Y", "B00ECGX9TW", "B0007QKN22", "B00B46XSC6", "B0096W1PG6", "B00AWYN182", "B00I58LVKC", "B003ZSHNGS", "B005MTMFHU", "B00B5HE1SY", "B00EFILSOU", "B00HLDFQU8", "B00EFILPHA", "B00I8BIC9E", "B00DY2Y28M", "B00BW6LUL4", "B00AQDGAPK", "B005I6DVC0", "B000Q3043Y", "B00BHQ5NVM"], "buy_after_viewing": ["B000AYJDD6", "B005AVL1J8", "B00AWYMXZY", "B0002A4M4I"]}}