{"asin": "B002Q21X7Y", "description": "Fable 2 is the anticipated sequel to the popular original that sold more than 3 million copies. Created by famed game designer Peter Molyneux, Fable 2 for Xbox 360 features an epic story that picks up 500 years after the first game. It offers an open world environment giving players a massive amount of freedom to explore and play as they please, with every decision made contributing to the game itself..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Fable 2Players:Offline: 1-2Online: 2Gameplay Modes:Single player, offline cooperative multiplayer, online cooperative multiplayer.The new combat system lets you master different fighting styles.View larger.You are free to roam the world of Albion any way you like.View larger.Every Choice Has Its ConsequencesFable 2 provides players with a truly immersive experience where a virtually limitless number of choices can be made, all of which have their own consequences, making each game unique. When you start the game, you choose either to play the role of a boy or girl, and depending on your choices, the hero will grow up to be tall or short, good or evil. Players can get married and have children; female player characters will become pregnant, which will then be reflected by their physical appearance.Early in the game, players are presented with a stray dog for a best friend, who will need to be fed and loved, and will accompany the player throughout his or her life. Depending on the player, the dog will change appearance and assist him or her in various ways, such as alerting of impending dangers and attacking enemies.Players inhabit the world of Albion and are free to roam the land to as they please. Players can use different expressions to communicate with others, such as taunting and laughing, and even belching or farting.As the players grow, so does Albion, reflecting the choices that were made earlier in the game. Every house, hut, castle, and dungeon can be purchased if the player wishes. Players can buy up all the land in a town and can become mayor, king, and even emperor of the entire land.Fable 2 presents a dynamic and free-roaming world that doesn't demand a player to take any one set path. At the same time, players seeking a plot line will find an epic story and quest that they can follow if they wish, along with many side adventures.Fight Using Different Weapons and MagicFable 2 introduces a new combat system that allows for mastery of hand weapons, such as swords, long range weapons such as cross-bows and guns, and, of course, magic. Players improve at each discipline with time, and can combine different combat styles when they fight. Other advanced design features include tactical positional advantages that can bring new strategic elements into combat.Bring Other Players into Your WorldFable 2 has a multiplayer mode that allows you to bring other players into your own world. Consistent with the rest of the game, the actions of these other players can be permanent and affect your world. You can explore and fight together with these other players, share treasures, and even fight each other.Note:Fable 2 will not ship with Online Co-op mode. An update with this functionality is rumored to be released shortly after the launch of the game.Xbox LIVE Arcade Mini-GamesGamers can play minigames through Xbox LIVE Arcade and earn currency that can be used in Fable 2 to purchase weapons, armor, and other items for the hero.Fable 2 is rated M for having mature content that may be suitable for persons ages 17 and older.Depending on your choices, the protagonist can turn out wildly different -- male, female, good, evil, and more.", "price": 62.29, "imUrl": "http://ecx.images-amazon.com/images/I/51Juh6-402L._SY300_.jpg", "related": {"also_bought": ["B002I0JGDM", "B00DBCAT3W", "B0001UEHP8", "B0050SY8UK", "0744010497", "B0044SA70M", "0804161607", "B0016NRS8M", "B005FDUSTA", "B001REZLY8", "B0047TG2R0", "B000OLXX86", "B000FRU0NU", "B00CJ7IUGS", "B004JSDQPU", "B001IK1BJ0", "B00ICWO1XA", "B004NRN5DU", "0744012244", "B0041OWQUI", "B000TG72PG", "B0045ZIENQ", "B004HYK956", "B001HWB68K", "B003O6G6G4", "B002I0H79C", "B00F4GSAYI", "B00D9EPI38", "B000R0SS3Y", "B001D7T2VM", "B006GHA8EE", "B004JHJHCC", "B0050SYV70", "B000B6ML1Y", "B000WCN7G0", "B009WI7V9E", "B003O6EB70", "B003DNH95K", "B005N4HBE6", "B00FATRKOK", "B0034JKYO6", "B002I0H2AG", "B000QW9D14", "B00065W7CS", "B00008XKZM", "B000P46NMK", "B003O6HGHM", "B000ZKDOVW", "B002GPPPS4", "B001A4MTGS", "B001TORSII", "B002I0JA7E", "B00D7NQP9M", "B005C2D2MO", "B000ZJVDA2", "B00BMFIXT2", "B008I62AN8", "B000NJH6YG", "B000X1PE16", "B005VBVQAG", "B00008J7NZ", "B003S2MXRA", "B0065NP6NC", "B00BRQN2EM", "B002BSA20M", "B003O6EBRA", "B000PC4FYK", "B0050SYBL6", "B000WMEEB2", "B0050SYY5E", "B00ERDGMT4", "B00EVWYF0E", "B003O6CA64", "B0025KZV7A", "B008PQU3E4", "B0045EI7I4", "B004ML7WOK", "B003O6E9EK", "B002I0H7U6", "B000F3AADE", "B00269DXCK", "B00EVWZHLK", "B0016B28Y8", "B002BRZ852", "B00B59MXDM", "B002GN8HU4", "B000NNFJQY", "B0056WJA30", "B0058VI0SU", "B003O6EA4E", "B0015HZLVA", "B000MTF054", "B001ASJIRM", "B003P9C6QY", "B0010AYJXI", "B0032LTVWW", "B002W5GI9I", "B0044SA734", "B004P6IVPQ", "B004YVOCYG"], "bought_together": ["B002I0JGDM", "B00DBCAT3W"], "buy_after_viewing": ["B002I0JGDM", "B00DBCAT3W", "B0001UEHP8", "B000FRU0NU"]}, "salesRank": {"Video Games": 1589}, "categories": [["Video Games", "Xbox 360", "Games"]]}