{"asin": "B002LITT3I", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Discover the HD difference. With the classically stylish PowerShot SX20 IS, you can produce magnificent HD movies and dazzling photos. Loaded with features, it&rsquo;s got a high-powered 20x wide-angle optical zoom with Optical Image Stabilizer, 12.1 megapixels, a big 2.5-inch Vari-Angle LCD, Blink Detection and more.The PowerShot SX20 IS is equipped with many of the same features as a higher-end camera: an ultra-powerful zoom, eye-popping resolution and advanced picture-improving technology. 12.1 megapixels of resolution gives your photography incomparable depth and ensures that any section of any shot can be enlarged and cropped with no loss in quality when you edit the image even if you choose to print the image. It can create crisp, clear 13 x 19-inch posters.PowerShot SX20 IS Highlights20x optical zoom in action20x wide-angle optical zoom with Optical Image StabilizerThe PowerShot SX20 IS is equipped with a 20x Optical Zoom lens with a focal length of 5.0-100mm (35mm equivalent: 28-560mm) that allows you to shoot any scene from wide-angle to telephoto. The camera uses a VCM (Voice Coil Motor) for high-speed, quiet, energy-efficient lens movement with precise control. Focal length is conveniently indicated on the lens barrel.The lens is optimized to fully exploit its zoom length and wide shooting angle in concert with the camera&rsquo;s high 12.1 Megapixel resolution. UD glass effectively suppresses chromatic aberration, while enhanced negative refractive power ensures that distortion at the wide-angle is also corrected. Further aberration is controlled with the inclusion of a double-sided aspherical glass-molded lens and ultra-high refraction index lens.The SX20 IS is equipped with Canon&rsquo;s acclaimed Optical Image Stabilizer Technology that automatically detects and corrects camera shake--one of the leading causes of fuzzy or blurred shots. Even when zoomed in, you can get the steady, crisp, brilliant images you&rsquo;ll be proud to shoot and share. And Canon&rsquo;s Optical Image Stabilizer Technology is convenient to use. It functions perfectly with or without a flash.Use the optical zoom while shooting superb 720p HD movies with stereo soundIf you long for the convenience of an advanced still camera that also creates superb movies, the new PowerShot SX20 IS lets you record video in beautiful high definition (1280 x 720 pixels). The camera also makes it easy to enjoy HD movies (and still photos) on your HDTV with a mini-HDMI connector for direct connection to a high-definition monitor. You'll enjoy the HD experience with no degradation of image or audio in the signal, plus the ability to display up to 130 thumbnails at once.Improved Smart AUTO intelligently selects the proper settingsJust set the Canon PowerShot SX20 IS to Smart AUTO and you're ready for maximum enjoyment from your picture taking every time. It's a relaxing and satisfying way to shoot because you can completely concentrate on your subject knowing that the camera has the technical details covered. Advanced Canon technology intelligently analyzes your situation and shooting conditions. Then it automatically selects an appropriate setting from 22 specially defined settings. So whether you're photographing flowers, a captivating sunset, or your friends at the park, you can be confident that you're getting dramatic, memorable images.Shooting ModesAdvanced presets for the best possible photos under certain conditions. With 24 Shooting Modes, you're ready for whatever shot comes your way.DIGIC 4 Image ProcessorCanon&rsquo;s proprietary DIGIC Image Processors have long set its cameras apart from the competition, and the new DIGIC 4 sets the bar even higher. Faster, more accurate noise reduction delivers better image quality, even at high ISO speeds.iSAPS Technologyis an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the advanced DIGIC 4 Image Processor to improve focus speed and accuracy, as well as exposure and white balance.Large 2.5-inch Vari-Angle LCD enables easy viewingThe camera&rsquo;s 2.5-inch LCD screen gives you the big picture, whether you&rsquo;re shooting, reviewing or showing off your images. This high-resolution screen offers a crisp, clear picture to make shooting, playback and using the camera&rsquo;s menu functions especially convenient. Clear and bright, it also features Night Display for easy viewing in low light. It also has an electronic viewfinder that provides sharp images when you shoot close-up with Super Macro shooting mode.This AA battery powered camera enables you to easily power upConveniently, you don&rsquo;t need to worry about running out of batteries or having to recharging them. Since AA-size batteries can be purchased at any store, simply get new ones locally wherever you go--no special power adapters or chargers are needed.What's in the BoxPowerShot SX20 IS BodyAA-size Alkaline Battery (x4)Neck Strap NS-DC4Lens Hood LH-DC50Lens CapDigital Camera Solution CD-ROMUSB Interface Cable IFC-400PCUStereo Video Cable STV-250N", "title": "Canon PowerShot SX20IS 12.1MP Digital Camera with 20x Wide Angle Optical Image Stabilized Zoom and 2.5-Inch Articulating LCD", "price": 699.95, "salesRank": {"Camera &amp; Photo": 3487}, "imUrl": "http://ecx.images-amazon.com/images/I/516hZV9JkBL._SX300_.jpg", "related": {"also_bought": ["B003GGN2SM", "1928873928", "B0039BPG1A", "B0056MHRMG", "B004DKSC7G", "B002ULWSLG", "B00330O2U8", "B001G5ZTZO", "B004DLLGIM", "B009OGHYNW", "B003KQPVBE", "B003HMM20O", "B0002A4M4I", "B003VNKNF0", "B00AQDG96K", "B0015AOK1O"], "bought_together": ["B0039BPG1A", "B003VNKNF0"], "buy_after_viewing": ["B0039BPG1A", "B003VNKNF0", "B00EFILPHA", "B009B0MZ1M"]}}