{"asin": "B001DYXGUI", "description": "InWanted: Weapons of Fate, Warner Bros. brings the box office movie to the Xbox 360 platform. Like the movie, the game revolves around a centuries-old, secret fraternity of assassins that brutally executes people as dictated by the mysterious Loom of Fate. Your destiny is to become their ultimate weapon..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } img.withlink {border:0px black solid;} a.nodecoration {text-decoration: none}Curve bullets and kill your targets, just like in the hit movie.View larger.You play as Wesley Gibson -- a super assassin and the heir to The Fraternity's legacy of power.View larger.Close, hand-to-hand combat provides exciting game play.View larger.Take out your targets by hitting an explosive object and creating a deadly blast.View larger.From Big Screen to Video GameKicking into action where the hit film left off,Wanted: Weapons of Fatelets you take on the role of Wesley Gibson -- a super assassin and the heir to The Fraternity's legacy of power. Your position has made you a target for a renegade faction of The Fraternity that is dead-set on hunting you down and killing you. In order to survive you must master an arsenal of deadly skills to protect the secrets of The Fraternity and turn the table on those who want you dead.Bend bullets and Become a Super AssassinThis game employs plenty of mechanics that fans of the movie are sure to love. The most obvious example is curved bullets. During game play you can curve a bullet around objects or corners to hit your target. You can determine the curved trajectory of your bullet so it can bend around columns and take out multiple enemies in a single shot, or use this skill to hit an explosive object and take out your enemy with a blast.Other cool game play features include a \"quick-chain\" cover to shield yourself and move through the environment with remarkable speed. The pace of the game and your assassin skills encourage close, hand-to-hand combat for even greater excitement. And as you hone your skills, you can even take down multiple enemies with sheer precision while using Assassin Time.Meet The HeirWesley Gibson -- The Heir -- was once an insignificant nobody, but now he's the successor to his father's legacy as The Killer. After being betrayed by The Fraternity that trained him, Wesley took his destiny into his own hands and exacted his revenge on them all. Now he is surrounded by the destruction he caused with nothing but questions about his heritage, The Fraternity, and the Will of Fate. The answers he seeks are out there, but so is a bullet with his name on it.The Assassin's DirectoryThe Russian is The Fraternity's cleaner. Known as Death's Janitor he is vulgar and perverted. He finds pleasure in things that others would find appalling. As the leader of the French Fraternity, The Immortal is not a villain -- he's a fanatic. he will stop at nothing to follow The Code of Weavers with an unwavering, unquestioning commitment. The Immortal is a supremely skilled assassin almost equal to that of The Killer (Gibson's father). Remorseless, it is not his fault that deaths occur by his hands, it is the fault of his victims for being \"only mortal,\" and incapable of escaping Fate's Will.Cross, also known as The Killer, is the greatest assassin that has ever lived. A member of the Chicago Fraternity, he is a true believer in The Fraternity's tenet of \"Kill one, save a thousand.\" Although his name was never wove by the Loom of Fate, Cross discovered a secret in the Chicago Fraternity that made him the target of those who were once his allies.Cool concept art shows the making of an assassin.View larger.An combat scene is depicted in this concept art example.View larger.", "price": 24.95, "imUrl": "http://ecx.images-amazon.com/images/I/510Uj3ubGmL._SY300_.jpg", "related": {"also_bought": ["B000X2TZY2", "B000XJS00K", "B0050SY9WC", "B00149ILCK", "B001PKHRVE", "B001TOQ8J8", "B003VKLABE", "B000SQ5LQ4", "B004FUL9YW", "B003P9C6QY", "B002CZ3N3C", "B0022TNO7S", "B001NJ6AWO", "B001GJ306U", "B004EW7LSY", "1582404976", "B001SH7YMG", "B001GKJ2E8", "B001URRH12", "B000ZK9QFK", "B003S2MXRA", "B004BD1DWG", "B002SRSQ72", "B0053BSN82", "B000XJNTPG", "B000UUFQZE", "B000XJO7A2", "B001AWIOYG", "B001D25M1Q", "B000E260LM", "B005DKMC6M", "B003Q53VZC", "B000OLSJLC", "B000ZK6950", "B002BSA1MQ", "B00163LW7A", "B0085CA8NY", "B0018092BE", "B000MK4G1M", "B0023CBY4E", "B000HCQK0A", "B0037LTTRO", "B000A0EFJW", "B002JQ2JSY", "B0076ZPYPI", "B001KWFBG0", "B005EZ5GQY", "B001UWGDC6", "B00320JDWG", "B0088MVODE", "B000QU1CDS", "B000HKGIOA", "B0043B5SLI", "B000F1UK3Q", "B000WQWPOQ", "B001BC948U", "B006ZTHGCK", "B00432O4VM", "B003O6N266", "B004UDLRMS", "B000FRS9II", "B000P297E8", "B008E6ZXRM", "B000KLNLV4", "B003GSZ9ZE", "B002I0HBZW", "B0050SY77E", "B003H0CC2O", "B005EZ5GXW", "B000ZK698C", "B001ASJISG", "B0008JILX6", "B002DC8GMM", "B0009Z3I0A", "B000LXIO6I", "B000VNS9D6", "B001KY7GCA", "B004RIACPY", "B000SFK0NO", "B000B90GD6", "B008LW4SBQ", "B0009WPZMC", "B002I0K50U", "B004LWEKCM", "B000R0SR9E", "B002EE5ROO", "B000R0SS3Y", "B008XMSRKC", "B00354NAYG", "B00503E8S2", "B000V1OUV8", "B0050SYFM6", "B001QXNBJM", "B004A88W8K", "B004WYTUCO", "B00113JSCG", "B000GPVUOY", "B000ZK9QD2", "B0050SY4DG"], "bought_together": ["B000X2TZY2"], "buy_after_viewing": ["B000X2TZY2", "B008XMSRKC", "B001AWIOYG", "B0022TNO7S"]}, "salesRank": {"Video Games": 7109}, "categories": [["Video Games", "Xbox 360", "Games"]]}