{"asin": "B000UU5T7E", "description": "The third game in theFalloutseries,Fallout 3is a singleplayer action role-playing game (RPG) set in a post-apocalyptic Washington DC. Combining the horrific insanity of the Cold War era theory of mutually assured destruction gone terribly wrong, with the kitschy naivety of American 1950s nuclear propaganda,Fallout 3will satisfy both players familiar with the popular first two games in its series as well as those coming to the franchise for the first time.The Cold War goes Next-GenWelcome to the nation's capital.View larger.The Brotherhood of Steel is a powerful ally.View larger.Customize characters with your Pip-Boy.View larger.The Story: Vault 101 ? Jewel of the WastesFor 200 years, Vault 101 , a fallout shelter, has faithfully served the surviving residents of Washington DC and its environs, now known as the Capital Wasteland. Though the global atomic war of 2077 left the US all but destroyed, the residents of Vault 101 enjoy a life free from the constant stress of the outside world. Giant Insects, Raiders, Slavers, and yes, even Super Mutants are all no match for superior Vault-Tec engineering. Yet one fateful morning, you awake to find that your father has defied the Overseer and left the comfort and security afforded by Vault 101 for reasons unknown. Leaving the only home you've ever known, you emerge from the Vault into the harsh Wasteland sun to search for your father, and the truth.Key Features:Limitless Freedom!? Take in the sights and sounds of the vast Capital Wasteland! See the great monuments of the United States lying in post-apocalyptic ruin! You make the choices that define you and change the world. Just keep an eye on your Rad Meter!Experience S.P.E.C.I.A.L.!? Vault-Tec engineers bring you the latest in human ability simulation ? the SPECIAL Character System! Utilizing new breakthroughs in points-based ability representation, SPECIAL affords unlimited customization of your character. Also included are dozens of unique skills and perks to choose from, each with a dazzling variety of effects!Fantastic New Views!? The wizards at Vault-Tec have done it again! No longer constrained to just one view, experience the world from 1st or 3rd person perspective. Customize your view with the touch of a button!The Power of Choice!? Feeling like a dastardly villain today, or a Good Samaritan? Pick a side or walk the line, as every situation can be dealt with in many different ways. Talk out your problems in a civilized fashion, or just flash your Plasma Rifle.Blast 'Em Away With V.A.T.S.!?Even the odds in combat with the Vault-Tec Assisted Targeting System for your Pip-Boy Model 3000! V.A.T.S. allows you to pause time in combat, target specific body parts on your target, queue up attacks, and let Vault-Tec take out your aggression for you. Rain death and destruction in an all-new cinematic presentation featuring gory dismemberments and spectacular explosions.Mind-Blowing Artificial Intelligence!? At Vault-Tec, we realize that the key to reviving civilization after a global nuclear war is people. Our best minds pooled their efforts to produce an advanced version of Radiant AI, America's First Choice in Human Interaction Simulation. Facial expressions, gestures, unique dialog, and lifelike behavior are brought together with stunning results by the latest in Vault-Tec technology.Eye-Popping Prettiness!? Witness the harsh realities of nuclear fallout rendered like never before in modern super-deluxe HD graphics. From the barren Wasteland, to the danger-filled offices and metro tunnels of DC, to the hideous rotten flesh of a mutant's face.System Requirements:Minimum Specifications:Recommended Specifications:OS:Windows XP/VistaProcessor:2.4 Ghz Intel Pentium 4 or equivalent processorIntel Core 2 Duo processorRAM:XP:1GB System RAMVista:2GB System RAM2 GB System RAMVideo Card:Direct X 9.0c compliant video card with 256MB RAM (NVIDIA 6800 or better/ATI X850 or better)NvidiaDirect X 9.0c compliant video card with 512MB RAM (NVIDIA 8800 series, ATI 3800 series)Supported Video Card Chipsets:NVIDIA GeForce Series 200, 9800, 9600, 8800, 8600, 8500, 8400, 7900, 7800, 7600, 7300, 6800; ATI HD Series 4800, 4600, 3800, 3600, 3400, 2900, 2600, 2400; ATI Series X1900, X1800, X1600, X1300, and X850", "price": 18.24, "imUrl": "http://ecx.images-amazon.com/images/I/51mFPOe6wML._SY300_.jpg", "related": {"also_bought": ["B002SU4QG4", "B002GDRNLS", "B0027I8SV6", "B0065NP39E", "B001VJ4DHK", "B005EZ5GQO", "B001V9PTVE", "B0016BVYAM", "B003ICGL7I", "B005G4CXPK", "B004HYIAPM", "B002I0HKRQ", "B0029E1VGC", "B002V14VOC", "B0013RC1W4", "B002BXKJA0", "B000PS2XES", "B002BS47YE", "B000MK694E", "B0050SZ980", "B0050SZ836", "B003FSFSEW", "B001O4YSTU", "B00140P9BA", "0761559965", "B0019C4MU2", "B0001X5YN4", "B005C2D2H4", "B000V9C9FO", "B000FUHVSE", "B001C4VU5C", "B000PS4X7S", "B001CC8UBG", "B004H80TUC", "B00FB3UPB0", "B004FZ9822", "B001AH8YSW", "B000ID1AKI", "B002I0KOSI", "B001E8QA2E", "0307469948", "B0000CNUUP", "B002NIP2SM", "B0012LGHZI", "B004FYKWZU", "B006P5RW3M", "B004CD9X2W", "B001BNFQKO", "B0045ZB66I", "B004FUGKSW", "B0050SZ0SY", "B000NV8F58", "B002ZJPYHS", "B0047THYWC", "B000X9FV5M", "B0010EK3SE", "B003GSZAOY", "B003L8DXS4", "B00CJ7IUIQ", "B00006IR62", "B001GGO1FW", "B001IK1BWC", "B000EPP6UA", "B001Q96ZNU", "B000AC59ZO", "B00140P9G0", "B008E6ZXA4", "B002I0JJAW", "B0009WPZNQ", "B003VJNPPE", "B001AWBYRA", "B005THAX60", "076156327X", "B0009V9OY8", "B00003OPES", "B000YSJRFC", "B00C7103JI", "B007XVTR12", "B001KU7XMW", "B002I0IHIM", "B0050SZ2EQ", "B001E6DG6Y", "B001B5U80K", "B003ZULWQI", "B002I0HJZO", "B003JVF728", "B001REZLY8", "B000E2D3LC", "B000ZKA0J6", "B0044TD9HY"], "bought_together": ["B002SU4QG4", "B0027I8SV6"], "buy_after_viewing": ["B002BXKJA0", "B0065NP39E", "B002SU4QG4", "B001V9PTVE"]}, "salesRank": {"Video Games": 9033}, "categories": [["Video Games", "PC", "Games"]]}