{"asin": "B002SOKFNS", "imUrl": "http://ecx.images-amazon.com/images/I/41FuxvFkdVL._SX300_.jpg", "description": "The LaCie Starck 320 GB USB 2.0 Mobile Hard Drive is the stunning result of a collaboration between LaCie and world-renowned designer Philippe Starck. The perfect union of form and function, this compact hard drive features a curved design and sturdy aluminum casing that protects your data. The embedded USB cable makes it even easier to travel with your music, photos, and other data.LaCie Starck 320GB USB 2.0 Portable Hard DriveAt a Glance:320 GB of disk space.Stylish portable design by Phillipe Starck.Aluminum construction for shock and heat protection.Built-in USB 2.0 cable.The design by Phillipe Starck is stunning from all angles.Travel in Style with 320 GB of Disk SpaceMeasuring just 5.4 x 3.6 x 0.7 inches, the LaCie Starck Mobile Hard Drive is ideal for on-the-go users. The curvy design is both attractive and easy-to-hold, and the sturdy, aluminum casing provides protection from shock and overheating.With a 320 GB hard disk, you'll be able to carry photos, music files, and more wherever you go.Built-In USB 2.0 CableThe LaCie Starck connects via a USB 2.0 interface that is compatible with virtually all computers. The USB cable is integrated into the drive itself, so you'll never worry about forgetting or losing it. And because the drive draws power from the USB connection, there's no bulky AC adapter to carry around. For those users with older computers, LaCie has included a USB power sharing cable that allows the unit to draw power from an additional USB port.The LaCie Stark is compatible with both PC and Mac operating systems, including Windows 7 and Mac OS X 10.6, and supports data speeds of up to 480Mbits/s. And with USB Boost, you'll experience up to 33% faster speeds.Easy-to-Use Backup Software IncludedLaCie's easy-to-use backup software is included for both PC and Mac, making it easy for you to protect files on your computer and avoid accidental data loss. And for Mac users, the drive is compatible with Apple's Time Machine backup software.The LaCie Starck Mobile Hard Drive is backed by a two-year limited warranty.What's in the BoxLaCie Starck Mobile Hard Drive, USB 2.0 cable, USB power-sharing cable, Quick Install Guide.", "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]], "title": "LaCie Starck 320 GB USB 2.0 Portable External Hard Drive 301891"}