{"asin": "B000VJTJNE", "description": "Fans of World of Warcraft, prepare for Blizzard Entertainment's next installment -- World of Warcraft: Wrath of King Lich. In this latest expansion, something is afoot in the cold, harsh northlands. The Lich King Arthas has set in motion events that could lead to the extinction of all life on Azeroth. The necromantic power of the plague and legions of undead armies threaten to sweep across the land. Only the mightiest heroes can oppose the Lich King and end his reign of terror..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }The tuskarr, a walrus-like race of nomadic fisherman, inhabit the icy Borean Tundra.View larger.Half-giant warriors, the vrykul, once inhabited the land.View larger.You'll enjoy exploring Northrend and all its environments and dungeons.View larger.Explore Northrend and battle the Lich King with World of Warcraft's first hero class character -- The Death Knight.View larger.One of many new environments, Dragonblight is an arctic wasteland surrounded by dense forests.View larger.Many strange and terrifying creatures inhabit this frozen continent.View larger.Enter the Death KnightThis expansion adds a host of content to the already massive existing game world. Players will achieve soaring levels of power, explore Northrend (the vast icy continent of the Lich King), and battle high-level heroes to determine the ultimate fate of Azeroth. As you face the dangers of the frigid, harsh north, prepare to master the dark necromantic powers of the Death Night -- World of Warcraft's first Hero class. No longer servants of the Lich King, the Death Knights begin their new calling as experienced, formidable adversaries. Each is heavily armed, armored, and in possession of a deadly arsenal of forbidden magic.If you have a World of Warcraft account with a character of at least level 55, you will be able to create a new level-55 Death Knight of any race (if on a PvP realm, the Death Knight must be the same faction as your existing character). And upon entering the new world, your Death Knight will begin to quest to level 80, gaining potent new abilities and talents along the way. This expansion allows for only one Death Knight per realm, per account.New Environments in Northrend AwaitJourney through the remote, diverse lands of Northrend and explore Dragonblight, Grizzly Hills, Borean Tundra, and Howling Fjord. Named for bones of perished dragons and majestic shrines to the fallen creatures, Dragonblight is an arctic wasteland surrounded by dense forests.Not everything is frozen in Northrend. The lush mountains of Grizzly Hills are the ancestral home to the furbolgs, who have grown accustomed to relative peace. Although their tranquility is being challenged by trappers, goblins, and ice trolls, Grizzly Hills remains a vast and dangerous wilderness.The southwestern tip of Northrend is home to the sprawling Borean Tundra. The Horde has established a dominant presence in this icy portion of the continent and has formed a bond with the tuskarr, a walrus-like race of nomadic fisherman. Magical energy is afoot in the region, and it has caused increased tension.High above the Great Sea at the southeastern tip of Northrend lies the Howling Fjord. Ancient mythology holds that a race of half-giant warriors, the vrykul, once inhabited the land, founding a prosperous civilization. They mysteriously vanished, leaving deserted villages and abandoned temples. In present times, the Alliance and the Horde have come to Howling Fjord to confront the Lich King. Strangely, this has prompted the return of the vrykul, who are attacking the Alliance and Horde settlements. Howling Fjord presents a difficult challenge on two fronts: withstanding the vrykul's onslaught and battling the evil Lich King.A Multitude of MonstersStrange and terrifying creatures inhabit the frozen continent of Northrend, such as Nerubian Viziniers, Plague Eruptors, Shoveltusks and Flesh Giants, to name just a few. Half-spider, half-humanoid, the viziniers utilize sorcery and high intelligence to emerge as the rulers of Nerubians' underground kingdom. The Plague Eruptors are walking corpses created by the Lich King's evil experiments to spread horror and chaos across the living world.Massive curved antlers make it easy to identify the Shoveltusks. These grumpy beasts are very dangerous, territorial, and best left alone. The Flesh Giants are nothing short of nightmarish abominations. Cobbled together from the pieces of giant body parts, the Flesh Giants employ tremendous strength to carry out the Lich King's wishes.The World of Warcraft: Wrath of King Lich expansion pack allows you to engage in epic siege warfare. The pack presents the first Hero class and allows you to transform your Death Knight's look with character customization that even include hairstyles and dances. You'll enjoy exploring the Northrend and all its environments and dungeons, filled with some of the deadliest creatures -- and greatest treasures -- on all of Azeroth.System RequirementsMinimumRecommendedOperating SystemPC: Microsoft Windows XP or Windows Vista (with latest Service Packs)Mac: Mac OS X 10.4.11 or newerCPUPC: Intel Pentium 4 1.3 GHz or AMD Athlong XP 1500+Mac: PowerPC G5 1.6 GHz or Intel Core Duo processorPC: Dual-core processor, such as Intel Pentium D or AmD Athlong 64 X2Mac: Intel 1.8 GHz processor or betterGraphics HardwarePC: 3D graphics processor with Hardware Transfor and Lighting with 32 MB VRAM, such as an ATI Radeon 7200 or NVIDIA GeForce2 class card or betterMac: 3D graphics processor with Hardware Transform and Lighting with 64 MB VRAM, such as ATI Radeon 9600 or NVIDIA GeForce Ti 4600 class card or betterPC: 3D Graphics processor with Vertex and Pixel Shader capabilities with 128 MB VRAM, such as an ATI Radeon X1600 or NVIDIA GeForce 7600 GT class card or betterMac: 3D graphics processor with Vertex and Pixel Shader capability with 128 MB VRAM, such as ATI Radeon X1600 or NVIDIA 7600 class card or better.MemoryPC: 512 MB (1 GB for Vista)Mac: 1 GBPC: 1 GB (2 GB for Vista)Mac: 2 GBHard Drive Space15 GB of free spaceAll Platform RequirementsKeyboard and mouse, required for controls. Other input devices not supported. Active broadband Internet connection required to play.", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/61aKhzsdRwL._SY300_.jpg", "related": {"also_bought": ["B002I0HKIU", "B000BWZY7Q", "B009716ESA", "B0050SZBP6", "B000067FDW", "B000H96C9M", "B00FRESQYG", "B00063BLG8", "B0040RHMAK", "B0050SZDAO", "B003O6N74S", "B00009ECGK", "0744010217", "0744012414", "B005L38QHA", "B00GLZQO30", "B004FHU4FA", "B00178630A", "0744014336", "B000ZKA0J6", "B00001IVRD", "B00D8E0ERY", "074401414X", "0744012422", "1465414444", "0744010519", "0744008190", "0744004411", "B004YARDSY", "0744013100", "B00005V9Q1", "B001RB61LS", "B0044DJZ0A", "B001CWXAP2", "B002KBV8V2", "B00FENJVOE", "B003M0CS2I", "B00G5I750Y", "B000FKBCX4", "1416550771", "B001TOQ8X4", "B00DU2CHE2", "B00EDJLXHI", "B0040AXYDQ", "143915760X", "0744011086", "B002I0KP4G", "0743471385", "B0081Q58AW", "B000PC9ZQS", "B00ANSM9MQ", "B00FWK8UWI", "B0053B5RGI", "B001V7RF9U", "B005CPGHAA", "B00DPC015E", "B002MPPSGW", "B00CJ7IUIQ", "B00115PAAS", "B000EPTFD4", "B0006FZUHM", "B0047SC3DI", "B00006J02N", "B00008Z0ER"], "bought_together": ["B002I0HKIU", "B0050SZBP6"], "buy_after_viewing": ["B00FRESQYG", "B0050SZBP6", "B00063BLG8", "B000067FDW"]}, "salesRank": {"Video Games": 3993}, "categories": [["Video Games", "Mac", "Games"], ["Video Games", "PC", "Games"]]}