{"asin": "B001TP3CH8", "categories": [["Electronics", "Home Audio", "Stereo Components", "Receivers & Amplifiers", "Component Receivers"]], "description": "Enjoy bolder, quality sound without the fuss. The solid, 2-channel STR-DH100 stereo receiver delivers clear stereo sound for everyday music fans and rooms where a complex home theater system is not needed. With the right mix of inputs and technologies, the STR-DH100 transforms any environment into a concert hall. In addition, it also includes the Digital Media Port input that allows you to extend your music selection from an iPod, Walkman digital music player, Bluetooth device or from a PC (accessories sold separately).Stereo Audio AmplifierPerfect for use in a secondary or small room for music playback from either the built in tuner or an external source like a CD player. Its 5 audio inputs and 2 audio outputs give the receiver the flexibility to work with a variety of audio components like CD players and recorders. Bring 100 watts per channel of strong, clean power to your vinyl turntables, SACD players, or any other source designed for serious critical listening.", "title": "Sony STR-DH100 2-Channel Audio Receiver (Black) (Discontinued by Manufacturer)", "price": 149.95, "salesRank": {"Electronics": 32820}, "imUrl": "http://ecx.images-amazon.com/images/I/41RMM3Bl2ML._SX300_.jpg", "related": {"also_viewed": ["B006U1VH2S", "B000MBUSD6", "B001E2UKSU", "B0002EPWC0", "B000A6PTHI", "B00009K087", "B00EE18O7W", "B0037WLS4U", "B004SF20FG", "B00F0H88SY", "B005GMRVUE", "B0044779H2", "B004UR486G", "B0071I3MUY", "B004H1PJAE", "B001AMSPQI", "B000RGR50U", "B0071I3OF2", "B007L8Q75G", "B0044779GI", "B001TOZTCA", "B00AAKEN7Q", "B004G8EKIA", "B0038C5FWA", "B0071VO3GI", "B003RD3ZJK", "B00AKZX50M", "B0044779G8", "B005FU5JBK", "B004QQXDVC", "B00198F89A", "B00E1CZRHY", "B00AQCW8NO", "B00I5PNGLW", "B001EMBKNO", "B00026BQJ6", "B001P05NGA", "B001NJW712"], "bought_together": ["B008I64126"], "buy_after_viewing": ["B006U1VH2S", "B000MBUSD6", "B004UR486G", "B00F0H88SY"]}}