{"asin": "B004D247SC", "related": {"also_bought": ["B001P60R1A", "B00JJDIH9A", "B00JQVU8LK", "B005M2IKEO", "B00HRQRL5W", "B00HZREW1Y", "B00GJG9JBA", "B00JJEFWPQ", "B00J8K36WC", "B0088W8K04", "B0060JVSOM", "B00H4OR526", "B00HUBYV66", "B00J8KSYOC", "B004XMI5O4", "B0016S0Y4M", "B004D2DPT4", "B00DDSBI1G", "B00JE18VQ6", "B000FGG8TG", "B004XEKNFG", "B00B7PQ1AU", "B00H41LTL2", "B00I1DCXYE", "B00CSKN3ZE", "B0072F8D7S", "B00318CLVO", "B00HF3XSO0", "B005M2INAK", "B003BHSXPS", "B000JOT2RO", "B006YQ7Z3E", "B00C5AHTC0", "B001FQKPSU", "B0000536EY", "B00GJG9JQA", "B0014SVCL8", "B001GIOV8C", "B003UZOX96", "B00LCR30IE", "B00FFXZZV6", "B00BYO55K6", "B0088W2E4W", "B0029O0BYU", "B00CLBY2VY", "B000OFNDOQ", "B000FPM22Y", "B004U3NN5M", "B00LMGZONE", "B0012HEGXW", "B00849L3QO", "B002RW9C3A", "B004VM9JCS", "B00L9G1ST6", "B0021HR94K", "B00169KRMK", "B004VMGTY4", "B001FWZ1NI", "B002HTREHE", "B001E96LB8", "B00D8KLZVW", "B000QFRBNS", "B005M2IHME", "B00DEF49I2", "B001GIOV82", "B001KYS2UA", "B00E36RQC2", "B000GG146C", "B00421MNIU", "B008XB9T1Y", "B0047F70B6", "B00EEIG3QO", "B00HV7RF4Y", "B00AREI6DC", "B005CYJXHU", "B00DDSEJHG", "B00537128O", "B000PYN4Q8", "B004VMGU8E", "B008HC92D4", "B007RC6JGS", "B00BR04QIE", "B006YTX0HQ", "B000F4F9L6", "B000WMISI2", "B0000536EW", "B001J5T952", "B000FJ9DOK", "B00HUAO7ZM", "B009LR090Y", "B00A46OK8S", "B002QYW8LW", "B003CYBF5K", "B00JGPND4K", "B000GCE5C6", "B00BNPL0MI", "B001C32YYO", "B00J7OCYXG"], "also_viewed": ["B00JJDIH9A", "B00JQVU8LK", "B005M2IKEO", "B00HRQRL5W", "B0088W8K04", "B001P60R1A", "B004D2C5G8", "B004RRDRRU", "B004D2DPT4", "B004DKAUR6", "B001E96LB8", "B003156OK6", "B003156OJC", "B00JJEFWPQ", "B00GANZE5W", "B00KACUSUK", "B00J8K36WC", "B005M2HS0Q", "B0067H6MF2", "B000EPA4G6", "B004X8GITC", "B00GJG9JBA", "B002DMK0K8", "B001E96L9K", "B00K5TIJMM", "B0060JVSOM", "B00BEEMQQM", "B00E5Q87JQ", "B005M2INAK", "B00E5Q89O4", "B00J8KSYOC", "B00JE18VQ6", "B001GIOV8C", "B004RRG2C2", "B00LDF4U0W", "B0054MSBE6", "B00E4MSUKM", "B001E96LAO", "B0067H6KP4", "B00ISZP9FK", "B00BYNKADY", "B006YQ7Z3E", "B00BS7AJYQ", "B002BWOXVW", "B00HF3IT6C", "B00HUBYV66", "B00H3EAKKQ", "B00HZREW1Y", "B003RF82UK", "B004VMGTY4", "B00H4OR526", "B008HBMVZ6", "B003156OJW", "B001E96L1S", "B005M2DV8O", "B00E5QNB9C", "B002K8QUBS"]}, "title": "Aveeno Smart Essentials Daily Detoxifying Scrub, 5 Ounce", "price": 7.12, "salesRank": {"Beauty": 3838}, "imUrl": "http://ecx.images-amazon.com/images/I/41RoTwaFEsL._SY300_.jpg", "brand": "Aveeno", "categories": [["Beauty", "Skin Care", "Face", "Creams & Moisturizers", "Fluids & Lotions", "Fluids"]], "description": "Smart Skincare that Knows What Your Skin NeedsGreat, healthy looking skin happens when you reveal your brilliant side. Diet, free-radicals, environmental toxins, and a hectic lifestyle can result in noticeably dull, uneven skin. Formulated with antioxidant Southernwood extract, SMART ESSENTIALS Daily Detoxifying Scrub helps keep what's good in and what's bad out. It gently polishes away debris, revealing a brighter, smoother look.SMART ESSENTIALSAVEENO SMART ESSENTIALS is a unique line harnessing the power of ACTIVE NATURALS antioxidant Southernwood extract in formulas to cleanse, nourish, protect and treat stressed skin so you can look beautiful every day.AVEENO SMART ESSENTIALSDaily Detoxifying Scrub&nbsp;&nbsp;It keeps the good in:Reveals fresher-looking, smoother skin.Prepares your skin for your daily moisturizer.&nbsp;&nbsp;And the bad out:Exfoliates to remove toxins and dead skin cells with natural luffa and coconut pulp enriched formula.Polishes away pore-clogging debris that can lead to breakouts.The Nourishing Benefits of SouthernwoodNourish stressed skin with antioxidant Southernwood extract and essential vitamins.The Science of SouthernwoodFound in the gardens and foothills of Europe, Southernwood has traditionally been used for its digestive purposes. Now, scientists for the AVEENO brand have extracted the plant's natural combination of sugars and polyphenols that have demonstrated antioxidant activity and can help to bind water to skin to fortify the moisture barrier.Products with SouthernwoodThe SMART ESSENTIALS Facial Collection with ACTIVE NATURALS antioxidant Southernwood extract helps to keep the good in and the bad out. In a clinical study of the Daily Nourishing Moisturizer, 100&#37; of women showed a visible improvement--transforming stressed skin into fresh skin.** In clinical testing, 100&#37; of women showed an improvement in roughness, dehydration, or blotchinessAVEENORecommended by dermatologists for over 60 years, AVEENO combines the best of nature and science to reveal the natural beauty of your skin. AVEENO uses select natural ingredients because of their advanced benefits; we call these ACTIVE NATURALS, natural ingredients uniquely formulated to deliver visible results.What's in the BoxAVEENO SMART ESSENTIALS Daily Detoxifying Scrub (5 Ounces).Try the complete SMART ESSENTIALS line that contains antioxidant Southernwood extract and is specially formulated for stressed skin:CleanseDaily Detoxifying ScrubReveal your brilliant side by polishing away debris to reveal a brighter, smoother look.Pore Purifying Facial WashPurify and renew your skin with each wash. This mild formula supports moisture by cleansing without over-drying skin as it cleanses to remove impurities, dirt, and makeup.Nourish &amp; ProtectDaily Nourishing Moisturizer SPF 30Replenish stressed skin and strengthen and protect the skin's moisture barrier to leave skin soft and smooth.Nighttime Moisture InfusionReplenish your skin's moisture barrier as you sleep so you can wake up to skin that feels refreshed, renewed, and ready to take on another day.TreatAnti-fatigue Eye TreatmentHydrate and infuse the eye area with vitamins and antioxidants so you'll look and feel refreshed and replenished.Trademark Information:AVEENO&reg;AVEENO SMART ESSENTIALS&trade;AVEENO ACTIVE NATURALS&reg;"}