{"asin": "B00000JNHJ", "description": "What's more fun than a barrel of opposable-thumbed simians? How about the silly--but  challenging--Ape Escape? While not the first game to offer enhanced control with Sony's  dual-stick analog controller,Ape Escapeis the first game to require either an analog ordual shock controllerto play. That requirement  ensures that players will have full control of their hero, Spike. One stick moves Spike in any direction,  while the other swings his monkey-catching devices.InApe Escape, a circus monkey named Specter stumbles upon a scientist's prototype  intelligence-enhancing helmet, turning him into an evil monkey genius. As Spike, the professor's young  friend, you must travel through time to clean up all of the monkeys Specter has sent back in his attempt to  repopulate the world. If that's not enough to make you laugh, then chasing his goofy monkey minions as  they scurry from your clutches will certainly tickle your funny bone. You'll discover a variety of gadgets to  help you in your quest, including monkey radar, a slingshot, and a propeller for flying. Spanning 25 huge  levels,Ape Escapeis approachable for novices, and offers added challenges for veteran gamers.  One such challenge is to lure a dinosaur near a rocky cliff, and then jar the monkey off his back and into  your net. Note: no monkeys were harmed in the creation of this game.--Jeff YoungPros:Unique control scheme brings new challenge to the PlayStationMassive game has plenty of replay valueCons:Unique control scheme requires some ramp-up time", "price": 91.52, "imUrl": "http://ecx.images-amazon.com/images/I/61Q9XW7YZWL._SX300_.jpg", "related": {"also_bought": ["B000093NQC", "B000CFWHPY", "B00000I1BF", "B000034DCF", "B0045L3SNQ", "B00000I1BR", "B00000I1BQ", "B000034DC2", "B00000DMAR", "B00000I1BS", "B00004U4R9", "B00000K1VK", "B000K6TOK6", "B000038AAN", "B0015MMN6G", "B000637T7S", "B00004TBGT", "B00001QHW9", "B00004U4R8", "B001TEYMRI", "B00005MA97", "B00004XOWT", "B000006OVJ", "B000029706", "B00002STKG", "B00002STJI", "B00002STKH", "B00001QER9", "B00L3LQ4B4", "B00019HNNC", "B00001QED2", "B00002STOT", "B00004YRQ9", "B000029716", "B0009XBWY6", "B00001ZWXH", "B00002STJ0", "B00004XONL", "B000059S78", "B00005NOFH", "B00004YRQA", "B0002Y2XXQ", "B000021Y5T", "B00002STXG", "B00004SPYF", "B00000JQQJ", "B000034DC7", "B00002SVWA", "B000066JRN", "B00002STPM", "B00002STEZ", "B00005Y402", "B000TLU67W", "B001PBDBNQ", "B00006F2ZP"], "bought_together": ["B000CFWHPY"], "buy_after_viewing": ["B000CFWHPY", "B0045L3SNQ", "B000K6TOK6", "B0015MMN6G"]}, "salesRank": {"Video Games": 8915}, "categories": [["Video Games", "More Systems", "PlayStation", "Games"]]}