{"asin": "B001TOQ8MU", "description": "Aliens vs Predator is an entirely new title for PC and high-definition consoles from acclaimed British developer Rebellion, the team behind the 1999 original PC gaming classic. Bringing the legendary war between two of science-fiction&rsquo;s most popular characters to FPS fans, AvP delivers three outstanding single player campaigns and provides untold hours of unique 3-way multiplayer gaming. Experience distinctly new and thrilling first person gameplay as you survive, hunt and prey in the deadly jungles and swamps surrounding the damned colony of Freya&rsquo;s Prospect.Play as an AlienView larger.Play as a MarineView larger.Alien Battles a PredatorView larger.Play as the PredatorView larger.Three Breeds of Warrior. Three Brutal Campaigns. One Relentless Battleground.In deep space, on the frontier of human colonization, an ancient pyramid is discovered. When archaeologists probe the pyramid&rsquo;s secrets they unwittingly trigger an apocalyptic confrontation between vengeful Predators, menacing Aliens, and heavily-armed Colonial Marines. Welcome to Aliens versus Predator, a stunningly-detailed FPS that seamlessly blends the action and intensity of one of the most popular movie franchises of all time. Whether you stalk your prey as a Predator, evolve into the perfect killing machine as an Alien, or use superior firepower as a Colonial Marine, one thing is certain. This will be a battle for the ages.Features:Master the skills of three deadly species:As a Predator, use your cloaking abilities and multiple vision modes to stalk your enemies while remaining hidden. Then rip out their spines with your wrist blades, or snipe them from afar with your plasma caster. As an Alien, use your finely-honed killer instincts to become the most lethal creature in the galaxy. Traverse any surface at blinding speeds, emerging from the dark to tear off your victims&rsquo; heads or impale them with your dagger-sharp tail. As a Colonial Marine, use your diverse arsenal and overwhelming firepower to hold the line against seemingly impossible odds.Discover three unique single-player experiences:Each of the three species has its own unique storyline that intertwines with the others to create a compelling cinematic narrative, inspired by one of the most popular movie franchises of all time.Plunge yourself into intense online multiplayer combat:Take on hordes of online opponents in adrenaline-fueled multiplayer battles. Stalk your prey silently as a Predator, become a nightmarish killing machine as an Alien, or lay down a barrage of lethal fire as a battle-hardened Colonial Marine. Take advantage of each faction&rsquo;s unique abilities to rise to the top of the leaderboards and become the most dominant species in the universe.", "price": 61.25, "imUrl": "http://ecx.images-amazon.com/images/I/51rss-9y-OL._SY300_.jpg", "related": {"also_bought": ["B005THAX5Q", "B00009KX7C", "B001NJ6AWO", "B008E6ZXRM", "B000O5DS32", "B003GSZ9ZE", "B000R0SR9E", "B00309U0M6", "B000KGD1GO", "B002DC8GEK", "B0050SY77E", "B002E1R1RI", "B004FUL9YW", "B0050SWVIQ", "B000WCN8IW", "B001E7MMNQ", "B004UDLRMS", "B0085CA8NY", "B007P0X7IA", "B002EZOQVI", "B002ZG98LO", "B000X1PE16", "B003C1I0CO", "B00AF3F1II", "B00HESBQOK", "B000XJO7A2", "B0002735AI", "B001L18RIE", "B0009SQFHA", "B001ASJIRM", "B001D7T2VM", "B0050SY4DG", "B003Q53VZC", "B0016NRS28", "B001CRQYBO", "B001PKHRVE", "B0053BSN82", "0744011973", "B001UWGDC6", "B000HX1P72", "B000H94PVO", "B007SRM5MO", "B001NX4DUQ", "B00005JMZK", "B00G6MW5CC", "B002I0H79C", "B00147F8ZA", "B000ZK6950", "B000PE0HBS", "B000FRU0NU", "B005C2D2MO", "B003FBL85W", "B002BSA1MQ", "B002BSA20M", "B0065NP6NC", "B007ZQJN1Y", "B00113JSCG", "B000SFK0MU", "B0016B8Q6M", "B00BMFIXT2", "B008LW4SBQ", "B004QDQASS", "B000C427NM", "B003O6G47U", "B00114XU4W", "B0030GBUCS", "B000ZKBJXC", "B000WXS5M0", "B002I098JE", "B003DNH95K", "B001SBUBJU", "B0050SYOOA", "B00FWXSQ3S", "B002SRSQ72", "B0050SY9WC", "B0056WJA30", "B0050SYX8W", "B000R0SS3Y", "B00FJWNSWQ", "B002BRZ852", "B00BT6SIEY", "B003DZ4F64", "B00FWXMSDW", "B003ESDQW4", "B001451HXO", "B002Z7BE1U", "B00886WO5W", "B000HKGIOA", "B002I0HAC6", "B00FWXYMJA", "B004RCVZLA", "B000P297E8", "B005EZ5GQY", "B000NJH6QE", "B002C0VNVG", "B000WSE2WM", "B000CQNWH0", "B004FYEZMQ", "B004HYK956", "B005DVAB1Y"], "bought_together": ["B005THAX5Q", "B0050SWVIQ"], "buy_after_viewing": ["B005THAX5Q", "B0050SY4DG", "B00147F8ZA", "B005THAX6K"]}, "salesRank": {"Video Games": 3831}, "categories": [["Video Games", "Xbox 360", "Games"]]}