{"asin": "B004RFGK1W", "description": "Buffalo Technology CloudStor&#153; Dual-Bay Cloud Accessible Storage and Media Sharing Device CS-WX/1D (black)CloudStor&trade; CS-WX/1DCloud Accessible Storage and Media Sharing DeviceAccess your files anytime, anywhereShare photos, videos and more with anyoneSetup in about one minuteScalable-add terabytes in secondsNo service or subscription feesFree mobile appsCloudStor from Buffalo Technology goes beyond simple home storage. CloudStor is a personal storage solution designed with you in mind. It is your portal to freely access and share your data, photos, videos, music and much more with anyone, anywhere over the Internet. And because none of your data resides in the cloud, CloudStor is your secure solution to store and share digital assets easily and freely. With apps for mobile devices, you&rsquo;ll always be seconds away from your content. Whether you&rsquo;re at home, the office or on the road, your CloudStor user experience remains the same. It looks and operates just like a hard drive on your PC or Mac&reg;. CloudStor can even integrate with Facebook and Twitter for easy sharing to popular online services. CloudStor is that easy. Just plug it in, turn it on and create your free account at mycloudstor.com.Personal Connection to Your ContentFreely access and share photos, slide shows, videos, music and much more with anyone, anywhere over the Internet.Secure, accessible storageRemote access anywhereEasy, secure sharing&nbsp;", "title": "BUFFALO CloudStor 2-Bay, 1-Drive 1 TB  (1 x 1 TB) RAID Personal Cloud Storage - CS-WX1.0/1D", "price": 19.0, "imUrl": "http://ecx.images-amazon.com/images/I/41bCbRMQV7L._SY300_.jpg", "related": {"also_viewed": ["B004RCNKC2", "B0048TWIX6", "B008DWAGPG", "B003NVMG6Y", "B00365MF5E", "B00CO0DE0W", "B00I2P53NY", "B00G9X5NFO", "B00ARB5FPM", "B00DW1UNS8", "B00CO0DH6S", "B005UDHU5U", "B0048L62I6", "B00EVVGAD0", "B00ARB5FNE", "B004UBU3SY", "B00ARB5FLQ", "B00CF9VFSU", "B00I2P56FE", "B00HC970B4", "B006I5MKZY", "B00AGI7I2O", "B00G2HZNXO", "B00JKM0A36", "B00G9X5N18", "B0064XAJ5I", "B00I2P82CS", "B005XDGJB8", "B005EJLFNI", "B00BFNJ2NW", "B00BOHNWZS", "B00EVVGAC6", "B00CO0DDZS", "B00439GMJ2", "B00EKTJLIY", "B00B5Q7AIS", "B003IT6YFU", "B004J6GNUC", "B00G4JZ2T0", "B00EVVGAFI", "B00BXAVDLQ", "B008YAHW6I", "B003CJTQPQ", "B00365MF54", "B0093NUFVE", "B00CO0DH6I", "B005TJLU24", "B005IULTI4", "B0009RML8S", "B00CRB9CK4", "B00E83X9P8"], "buy_after_viewing": ["B006I5MKZY", "B00439GMJ2", "B004RCNKC2", "B0048TWIX6"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "Network Attached Storage"]]}