{"asin": "B000FPOJOS", "description": "The award-winningGran Turismofranchise returns with its 5th installment,Gran Turismo 5 Prologue, exclusively for PlayStation 3. With its signature realism and unrivaled physics, this highly anticipated precursor toGran Turismo 5continues to blur the line between simulation and reality.\"Prologue\" is defined as an introductory or preceding event or development, and true to every letter,Gran Turismo 5: Prologuetreats both long-time fans of theGran Turismofranchise as well as those coming to it new, with a generous sampling of what they can expect to see inGran Turismo 5later in the year and further releases on the PS3.The new direction of Grand TurismoTake your ride online for the first time.View larger.Race across six international tracks.View larger.Customize your ride in the garage.View larger.Developed By the BestPolyphony Digital is the developer of theGran Turismofranchise, led by creator Kazunori Yamauchi. Polyphony Digital is known for pushing the limits of the PlayStation hardware, and with its realistic graphics and physics,Gran Turismo 5: Prologueis no different. In addition to receiving CAD data from the auto manufacturers, they have taken thousands of photos to model each car (and track). As an example of the level of detail, a car inGran Turismo 4has the same number of polygons as a headlight inGran Turismo 5: Prologue.Polyphony works even closer with the automotive industry to make sure that the cars look and drive just as they do in real life. In fact, Kazunori Yamauchi designed the on-board computer for the real Nissan GT-R. If you&#146;re lucky to buy one when it releases, you will notice the Polyphony Digital logo when you start your car.Take Your Cars and Tracks Online and OffGran Turismo 5: Prologuefeatures over 60 stunning cars &#150; including vehicles by Lotus, Mitsubishi, Nissan and Ferrari for you to race on seriously realistic, real-life tracks: including the Eiger Nordwand, the London City Track and Suzuka &#150; all rendered in incredible High Definition graphics. There's also all-new driving physics for the most lifelike driving experience ever and new, improved opponent artificial intelligence for the toughest race challenge yet.But that's not all &#150; for the first time ever in the history ofGran Turismo, players will now be able to race online. Up to 16 players will be able to go head-to-head on some of the world's best racetracks on PlayStation Network. All you need to get racing is a broadband connection and PS3. Once you're up and revving, Global Online Rankings and the My Garage homepage feature will leave the world in n o doubt as to just who is the best atGran Turismo.And then there's the Online Dealership, providing a wealth of information on cars and manufacturers and alsoGran TurismoTV &#150; a dedicated online channel available exclusively from PSN and packed with some of the greatest content that Motorsport, car manufacturers and TV has to offer.Key Features:Race over 60 cars from worldwide automotive manufacturers, precisely modeled both inside and out.All-new interior dash view, featuring full driver animation and working gauges.Compete on 6 tracks with 12 total layouts, including Fuji Speedway, Suzuka Circuit, and for the first time ever, Daytona International Speedway.Online racing with up to 16 players, complete with detailed rankings, plus downloadable ghost cars and race replays of top racers.New online community features including Gran Turismo TV, featuring worldwide automotive and motorsport programming.Tune vehicle performance, from suspension and tires to gear ratio and engine modifications.Rendered in stunning 1080p at 60 frames per second with crisp, realistic lighting and camera effects (replays rendered in 1080p 30fps).Full Car List (71 cars):Lexus IS F '07Nissan Skyline GT-R V-spec II Nur '02Nissan Fairlady Z Version S '07Nissan Skyline Sedan 350GT Type SP '06Nissan Skyline Coupe Concept '07Nissan Skyline Coupe 370GT Type SP '07Nissan Skyline Coupe (V36) Tuned CarNissan GT-R Proto '05Nissan GT-R '07Honda Integra TYPE R '04Honda NSX Type R '02Acura NSX '91Mazda Atenza Sport (2007 Tokyo Motor Show reference exhibit)Mazda RX-8 Type S '03Mazda RX-7 Spirit R Type A (FD)Mazda RX-7 (FD) Special Tuned CarSubaru Impreza WRX STI (18inch BBS Wheel Option) '07Subaru Impreza Sedan WRX STI spec C Type RA '05Mitsubishi Lancer Evolution IX GSR '05Mitsubishi Lancer Evolution X GSR Premium Package '07Mitsubishi Lancer Evolution IX GSR Tuned CarMitsubishi Lancer Evolution X GSR Tuned CarSuzuki Cappuccino '95Suzuki Swift Sport '07Suzuki Cervo SR '07Suzuki Cappuccino Tuned CarSuzuki Swift Sport Tuned CarDaihatsu Copen Active Top '02Daihatsu OFC-1 '07Chevrolet Corvette Z06 '06Chevrolet Corvette Z06 (C6) Tuned CarDodge Viper GTS '02Dodge Viper SRT10 Coupe '06Dodge Viper SRT10 Coupe Tuned CarFord Mustang V8 GT Coupe Premium '07Ford GT '05Ford Focus ST '06Ford GT Tuned CarAudi R8 4.2 FSI R tronic '07Audi TT Coupe 3.2 quattro '07BMW Z4 '03BMW 135i Coupe '07BMW M3 Coupe '07BMW 135tii '08Mini Cooper-S '06Mercedes-Benz SL 55 AMG '02Volkswagen Golf GTI '01Volkswagen Golf V GTI '05Alfa Romeo 147 TI 2.0 TWIN SPARK '06Alfa Romeo Brera Sky Window 3.2 JTS Q4 '06Ferrari 599 '06Ferrari F430 '06Ferrari 512BB '76Ferrari F40 '92Lancia Delta HF Integrale Evoluzione '91Citroen C4 Coupe 2.0VTS '06Renault Clio Renault Sport V6 24V '00Clio Renault Sport V6 24V Tuned CarAston Martin DB9 Coupe '06Jaguar XK Coupe '06Lotus Elise 111R '04Lotus Elise '96Lotus Elise 111R Tuned CarLotus Elise Tuned CarTVR Tuscan Speed 6 '00TVR Tamora '02Art Morrison Corvette'60Amuse/Opera Performance Gran Turismo 350Z RSAmuse S2000 GT1 TurboMine's BNR34 Skyline GT-R N1 base '06Blitz Dunlop ER34 '07", "price": 12.81, "imUrl": "http://ecx.images-amazon.com/images/I/51cHVkGtMQL._SY300_.jpg", "related": {"also_bought": ["B001C4DKG4", "B0012N5MIO", "B001TORSHO", "B003IMGC9U", "B006JKARN0", "B003171CEW", "B002BSA1C6", "B003KZJA9Y", "B003UT9XI8", "B002BCVFRM", "B00647615G", "B00488PZ2S", "B003R7H5TC", "B000HCMR8E", "B0030CYE8O", "B0056WJA4E", "B002I0K74Y", "B000RI17CA", "B000MUW98O", "B001COV1CY", "B001CPBLLE", "B001441550", "B002I0K6DG", "B002C7RBFQ", "B004UDB9SA", "B001UU1WN8", "B005EVFQH2", "B00BJ60LEY", "B002I0K8JI", "B00JQHU9RC", "B002I0J632", "B003O6E5OE", "B0050SWSQQ", "B000MIP72G", "B003O6E620", "B004X56PWK", "B0033PKTCS", "B00149V3CU", "B000QB05AI", "B002I0HIMI", "B00420K18K", "B00386VMWI", "B002TDIEEA", "B000V4TXN0", "B003O6E2TM", "B004Z4ZKL6", "B00DWXV1B4", "B0038MUCPK", "B004DI5H26", "B000KLNLUK"], "bought_together": ["B006JKARN0"], "buy_after_viewing": ["B006JKARN0", "B00CRL9TU2", "B002BSA1C6", "B0050SWSQQ"]}, "salesRank": {"Video Games": 5433}, "categories": [["Video Games", "Kids & Family", "PlayStation 3", "Games"], ["Video Games", "PlayStation 3", "Games"]]}