{"asin": "B0009VKJH4", "description": "Amazon.com Product Description Ushering in a new era of out-loud audio for iPod, the inMotion iM7 delivers full-bodied sound that rivals traditional home stereo systems. Its sleek, compact design goes where you go--around the house, to the office, out in the backyard or off to the beach. That's because the iM7 features a long-lasting battery mode along with the ability to plug into a nearby outlet for AC power.COMMENT: place in \"inmotion-im7-400.jpg\"Cool, rounded design for easy portability.The iPod recharges while you listen. Your dockable iPod is secured within a patent pending universal cradle that gracefully opens and recesses with the touch of a finger. The iM7's impressive sound comes from highly advanced neodymium drivers and tweeters, plus a powerful, built-in subwoofer. A wireless remote provides across-the-room command of both the iM7 and iPod, allowing perfect adjustment of your music.COMMENT: place in \"im7side.jpg\"Get booming sound from the 4-inch, side-firing subwoofer.FeaturesHigh performance everywhere you go: Patent-pending high efficiency digital amplification delivers consistent, powerful sound from a compact system.Deep bass: Feel the exceptional low frequency bass from the built-in 4-inch side-firing subwoofer enhanced with revolutionary XdB technology.Smooth mids: Two 3-inch neodymium drivers deliver smooth mids and mid bass.Crystal-clear highs: From two custom-designed 1-inch neodymium tweeters.Built-in iPod cradle: Adjusts to fit your iPod and recharges it while you listen.Portable design: Runs on batteries (8 D batteries, not included) or plugs into the wall.Video output: Play your downloaded video movies and TV programs as well as photo albums on most TVs.Wireless remote and built-in controls: Basic iPod functions, as well as the speaker system&Otilde;s stand-by, master volume, bass, and treble are at your fingertips with a wireless remote.Convenient auxiliary input jack: For connection with other audio devices, including laptops, older iPods, iPod shuffle, and other MP3 players (cable included).Universal power adapter: International plug set included.What's in the BoxAltec Lansing iM7 portable audio system, remote control, 3.5mm auxilliary input cable, universal power supply (with international plugs), iPod mini adapter, Quick Start guide, printed operating instructionsiPod CompatibilityiPod nano 1G,iPod mini,iPod 3G,iPod 4G (Clickwheel),iPod Color,iPod 5G/5.5G Video(note that an iPod nano 2G adapter is available from the Altec Lansing web site, but is not included in the box)", "title": "Altec Lansing inMotion iM7 Portable Audio System for iPod (White)", "price": 10.99, "imUrl": "http://ecx.images-amazon.com/images/I/11DNAchdFkL.jpg", "related": {"also_viewed": ["B009EHTXGM", "B000BKPGOE", "B002I636XM", "B004TS2AO8", "B005IVL0UA", "B002I636YG", "B0038W0N8G", "B004TS2AOS", "B00DXYDBPG", "B00DXYDBPQ", "B00JYQOXAO", "B009H5N2IG", "B004TS2AP2", "B002I529AY", "B0014XKQY2", "B00I7IFY5I", "B005IVL0SM", "B004CYKEBK", "B004I44EVA", "B0090IA4FO", "B00ECL8IN4", "B000R5NRS0", "B00BSGUPQY", "B0006ZO2CG", "B008H7MHD6", "B00BUC3H20", "B002QQ7TLY", "B001K4YWCW", "B000R6QAHO", "B005CPBYGM", "B00EXPNI84", "B000BKBYY0", "B001ELK2NY", "B00644JO9O", "B007JCNOHI", "B00DXYDBLK", "B00CMNZ01C", "B000EVQ3PQ", "B001G5Z82I", "B000PBQZMG", "B0041Q38R6", "B004BGTK14", "B008BLDI4U", "B0006VX1G8", "B005IVL0U0", "B00DXYDBRO", "B00BAQJ94Q", "B002O3W3Y2", "B0061HMRA2", "B006MPQ3BW"], "buy_after_viewing": ["B009EHTXGM", "B000BKPGOE", "B002I636XM", "B003VANOI6"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}