{"asin": "B000NK3NBA", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The PowerShot A560 gives you the freedom to shoot high resolution images you can enlarge, crop and print -- big. With its 7.1-megapixel CCD, the camera records every detail -- like a baby&#x92;s delicate curls -- in razor-sharp, astonishingly clear, natural color that will make every picture something to cherish. And the A560 is equipped with a high-quality Canon 4x optical zoom lens that brings you in close at the touch of a button. So you can capture special moments like a child&#x92;s first homerun with clarity and brilliance --even if you&#x92;re sitting in the bleachers.PowerShot A560 HighlightsDIGIC III Image ProcessorWith DIGIC III, you get images of superior quality, the camera functions at top efficiency and battery life is significantly enhanced. What&#x92;s more, DIGIC III enables Canon&#x92;s newly improved Face Detection Technology and Red-eye Correction to give you better, more true-to-life people shots. Simply press the Shutter button halfway down, and the PowerShot A560 automatically pinpoints the faces in the scene and chooses the ideal focus point. To keep every face looking bright and natural -- without scary red eyes -- the camera controls exposure settings and flash, so every shot is just what you were shooting for.DIGIC III features Face Detection AF/AE, which finds multiple faces in the frame and sets the most suitable focus point, when the shutter button is pressed halfway. And an additional new feature, Face Detection FE adjusts the flash, based on a person&#x92;s face on the screen. Exposure and flash are controlled to ensure proper illumination of both the faces and the overall scene, eliminating the common problem of darkened or overexposed faces.Red-eye Correction detects and automatically corrects red-eye during playback for both regular and flash photography. In unusual cases where red-eye is not automatically detected, it can easily be corrected manually during playback mode from the LCD screen.iSAPS Technology is an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the fast DIGIC III Image Processor to improve focus speed and accuracy, as well as exposure and white balance.Clear, high-resolution 2.5-inch LCD for easy on-camera viewingThe camera&#x92;s 2.5-inch LCD screen gives you the big picture, whether you&#x92;re shooting, reviewing or showing off your images. This high-resolution screen offers a crisp, clear picture to make shooting, playback and using the camera&#x92;s menu functions especially convenient. Clear and bright, it also features Night Display for easy viewing in low light.Shooting ModesWith 14 Shooting Modes, including 6 Special Scene Modes, you&#x92;re ready for whatever shot comes your way.AutoThe camera chooses all the settings so you can concentrate on your subject.ManualThe ultimate in creative control, you set ISO speed, exposure compensation and white balance.PortraitThe camera sets a large aperture, focusing the subject and artistically blurring the background to make your subject \"pop.\"LandscapeFor front to back sharpness, the camera sets a small aperture.Night SnapshotGet natural-looking pictures with brighter backgrounds and subjects lit by flash.IndoorReduce blur and improve color accuracy when shooting handheld indoors.Kids &amp; PetsReduced focusing time freezes fast-moving subjects, so you won&#x92;t miss those special shots.MovieShoot in VGA and QVGA (30 fps/15 fps for up to 1 hour or 4GB), Fast Frame Rate (60 fps for up to 1 minute) or QQVGA (15 fps for up to 3 minutes).Special Scene ModesNight SceneFor impressive sunset or nightlife shots, the camera properly exposes the background and uses slow-sync flash for the subject.FoliageCapture brilliant shots of autumn foliage, greenery and blossoms.SnowShoot clear snow scenes without darkened subjects or an unnatural bluish tint.BeachGet clear shots of people at a sunny beach without darkened faces.FireworksGrab brilliant images of skyrocketing fireworks.AquariumAchieve proper flash-free exposure and natural hues at indoor aquariums. A variety of movie-making options.A variety of movie-making optionsFour movie modes including 30 fps VGA and 60 fps Fast Frame Rate. With a highly flexible movie mode, you can create the movie that&#x92;s perfect for any application. Select from VGA (640 x 480 pixels) and QVGA (320 x 240 pixels), with frame rates of 30 fps and 15 fps for recording up to 1 hour or 4GB. Also Fast Frame Rate (QVGA; 320 x 240 pixels) recording at 60 fps for up to 1 minute, and Compact Movie Mode (QQVGA; 160 x 120 pixels) recording at 15 fps for up to 3 minutes. The PowerShot A560 also supports the USB 2.0 Hi-Speed standard, so you&#x92;ll enjoy the fastest possible data transfer speeds when using a USB 2.0 Hi-Speed compatible computer.Get new batteries anywherePower on the go with two AA-size batteries. You don&#x92;t need to worry about running out or recharging batteries. Since AA-size batteries can be purchased at any store, simply get new ones locally.The complete print solutionThe PowerShot A560's Print/Share button makes direct printing easier than ever. Simply connect the A560 Digital Elph to a Canon CP, Selphy or PIXMA Photo Printer or any PictBridge-compatible photo printer, press the lighted Print/Share button and print! Also use the Print/Share button to transfer images to a computer (Windows and Macintosh).Print your own ID photos in 28 different sizes or use the Movie Print function to output multiple stills from a recorded movie on a single sheet with a Canon Selphy Compact Photo Printer.For desktop large-format printing, try one of the Direct Photo Printers that allow you to print without a computer in one of two ways: plug your compatible PowerShot camera into the Direct Photo Printer using the supplied USB interface cable, or simply insert a memory card into the supplied adapter. You can also connect the printer to your computer for more options. Print high-resolution, borderless images as postcards or 8.5 x 11-inch sheets within minutes.Compact Photo Printers let you produce versatile, fun 4 x 6-inch postcards, 4 x 8-inch wide greeting cards or credit card size prints in just two easy steps: connect and press/print. Control the printer right from your camera's LCD screen. You get durable, dye-sublimated prints quickly with or without borders.", "title": "Canon PowerShot A560 7.1MP Digital Camera with 4x Optical Zoom", "price": 17.12, "salesRank": {"Camera &amp; Photo": 6882}, "imUrl": "http://ecx.images-amazon.com/images/I/41R0X-1rIbL._SX300_.jpg", "related": {"also_bought": ["B000WI2D2I", "B000NK3H4S", "B000WQKOQM", "B000EMU888", "B00762YNMG", "B0007MVHZS", "B000EMU4HS"], "buy_after_viewing": ["B003VNKNF0", "B00AWYMXZY", "B000NK3H4S", "B003VNKNEQ"]}}