{"asin": "B000AMLXHW", "related": {"also_viewed": ["B009FU8BTI", "B000VXKD8K", "B001EZRJZE", "B009FU8BR0", "B000IVDIL4", "B000IVDTSG", "B000HBEKJE", "B004JOQSEA", "B004M189OM", "B0089L4TL8", "B00LIP10KK", "B003597DYE", "B000VXD2S8", "B000R3K488", "B000J56H5I", "B001Z5140O", "B005KY3XN2", "B002AVXDWE", "B000CS7RYM", "B00AEC9VM2", "B00COJ8FPC", "B008H7MFKQ", "B00JXFM75Y", "B005LMWPNM", "B00GY0UB6I", "B00BF2M21C", "B004HKIB6E", "B005KOZNBW", "B000BGOWIE", "B0092U3TKC", "B008RWHC0E", "B004HO58SO", "B00EEOSZK0", "B000YQ6DIS", "B005FPT38A", "B000RZDBM2", "B008TVSLVC", "B008I64C2A", "B0038JE07O", "B0096KLQN0", "B00GY0UB54", "B00BLUYPO0", "B005TI1ILS", "B00CMCMZR0", "B00BUCLVZU", "B00BN0M0O0", "B004W2T2V0", "B00D79AQ14", "B00C4XVOOC", "B002USAIYS", "B0008D5FRW", "B0036OR91A", "B0018LX0DY", "B00CX00IVG", "B004GK0GKO"], "buy_after_viewing": ["B009FU8BTI", "B000VXKD8K", "B001EZRJZE", "B009FU8BR0"]}, "title": "Sling Media Slingbox Classic", "price": 129.93, "salesRank": {"Electronics": 49530}, "imUrl": "http://ecx.images-amazon.com/images/I/41HF5TBH9BL._SX300_.jpg", "brand": "Sling Media", "categories": [["Electronics", "Television & Video", "Streaming Media Players"]], "description": "From the Manufacturer What if you were able to watch live television wherever you go? The World Series in your cube. MSNBC breaking news at the coffeeshop. Your local news station halfway around the world.Lostin Hawaii.Emeril Livein your kitchen. Now what if we told you that you could do that without having to lug a television, a cable box, a satellite dish, or a subscription along with you? In fact, you don&rsquo;t need anything besides your laptop (which is attached to your hip already).That&rsquo;s because back home, you have a Slingbox sitting on top of your television. The simple silver device looks suspiciously like a gigantic chocolate bar, but the technology inside is truly sweet. This award-winning gadget is a breakthrough device that enables you to watch and control your living room television programming from anywhere by turning any Internet-connected laptop or PC into a personal television.Yes, It Really WorksWith a wave of a virtual magic wand, the Slingbox place-shifts the television signal from an antenna, cable box, satellite receiver, DVR, and more to your PC via the Internet, whether you're at home or 3,000 miles away. Thanks to the Slingbox, you can enjoy your home TV programming wherever you are: the office, a hotel room, your garden, even the bathroom--anywhere there is an Internet connection. You even get full control over the source, from changing channels and viewing recorded content to fast-forwarding or setting up a season pass. You truly can watch and control your television anytime, anywhere--the power is in your hands.With a resizable window mode, full-screen mode, and the Slingbar, the SlingPlayer lets you watch your television however you want.Our solution to viewing your own TV while on the road involves two pieces of technology. In addition to the Slingbox hardware which always remains connected to your television source, we provide you with the SlingPlayer--which is installed on any Windows-based desktop or laptop. This software program gives you 100% control over your source. It encompasses several innovative technologies, including our SlingStream optimization algorithms that automatically give you the best picture possible. You can watch your TV in full-screen or windowed mode. There&rsquo;s also the Slingbar mode, which docks the SlingPlayer on either side of the desktop. Your desktop will dynamically resize to fit the remaining screen space, so you can watch TV while using your computer for other functions such as surfing the Web or working on a presentation.We're Scared of Wires, TooThe Slingbox is designed to fit seamlessly into your existing home theater setup and your PC technologies. We support literally thousands of devices, so whatever you&rsquo;ve got, we&rsquo;re sure the Slingbox can handle it. Better yet, installing it is a piece of cake. We won&rsquo;t make you rewire the entire house, wait around for someone all morning, or purchase extra required pieces. The Setup Wizard automatically discovers and configures the Slingbox for the device that it is connected to, and it walks you through the process step by step. In just four simple steps, the Slingbox is good to go.It&rsquo;s easy to connect to your Slingbox. With the free Slingbox Directory service, you can see a list of all Slingboxes on your network, and whether they&rsquo;re available or in use already. Scroll down the list and select yours, then hit connect.Connect the TV source to the Slingbox.Connect the Slingbox to the Internet.Plug in the Slingbox power adapter.Load the SlingPlayer software onto your PC.You are now ready to view and control your TV programming via your Internet-connected desktop or laptop as if you were sitting in your living room, watching your TV source, and using its own remote control.SlingMobile: Sling on the MoveIn addition to watching your Slingbox via any Internet-connected PC, you can now also utilize select Smartphones and Windows Mobile products to connect to your Sling, making it possible to watch your favorite shows from airports, inside taxis, during road trips, and just about anywhere else you can get your mobile phone signal. The optional software is available on www.slingmedia.com for download.It&rsquo;s My TVSling Media believes in giving you what is yours. This means that in addition to giving you your television wherever you go, the Slingbox lets you personalize the viewing experience. We have developed numerous remote control skins that look just like your real remote control. You can fine-tune the volume, brightness, contrast, hue, and other video signal settings to perfection. The Favorites Bar gives you one-click access to all of your favorite stations. You can even use any picture from your computer&rsquo;s hard drive as the channel&rsquo;s icon.We believe that watching your TV is about, well, you. That&rsquo;s why your remote control is your own, your favorite channels are your own, and your video signal is just the way you like it.What&rsquo;s in It for Me?When you buy a Slingbox, you don&rsquo;t need to buy another computer just to watch it. There is no monthly, yearly, or hourly subscription fee. There are no contracts to fill out or services to sign up for. That means you don&rsquo;t have to feel guilty about watching TV all the time now. (Well, unless you want your significant other to still love you.)Talk Nerdy to MeThe Slingbox is powered by a high-performance digital signal processor from Texas Instruments and leverages Microsoft&rsquo;s latest Windows Media Video technologies to provide superior video quality. Plus, our engineering dudes developed the SlingStream optimization algorithms that automatically adapt to changing network conditions. This means that we can give you the best video quality consistently, personalized to your connection. Our variety of S-Video, coax, and composite RCA inputs allows you to hook up basically anything you want to the Slingbox and sling that signal around the world. Right now, the software works with Microsoft Windows Vista/2000/XP/MCE and Mac computers, as well as select handheld devices."}