{"asin": "B000U6AHZW", "description": ".caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; }The Toshiba HD-A35 HD DVD Player stands less than two-and-a-half inches tall but packs a long list of cutting edge features that will help you get the most out of your home theater system. With support for 1080p/24-frame video, Deep Color, and HDMI pass-through audio, this player makes it possible to achieve a viewing experience that's as much like being in a theater as you can get without going to one.The Toshiba HD-A35 HD DVD Player has support for 1080p/24-frame video and HDMI pass-through audio.View larger.The HD-A35 upconverts standard DVDs for display on an 1080p HD screen.View larger.A Refined, Slimmer LookThe HD-A35's refined design--with rounded edges, a slim chassis, and a high-gloss black face plate--looks sleek and elegant in your home theater system without taking up too much real estate.Outstanding PerformanceAll of Toshiba's HD DVD players support the enhanced features of the HD DVD format, including picture-in-picture video, audio commentary, and Web-enabled network capabilities. With an Ethernet port, the A35 can connect to the Internet for firmware updates to keep the player up to date on new features, and to support the growing number of HD DVD titles with interactive online features and bonus content.The HD-A35 uses the latest HDMI 1.3 interface to connect to your HD television, providing large bandwidth to eliminate any data bottlenecks and to support new technologies for the utmost in viewing experience. The HD-A35 can output video at 1080p, the highest resolution available, and includes support for 24-frame video, which maintains the native 24-frames-per-second rate of films, thereby delivering an experience more similar to one in theaters. It also supports Deep Color, a new standard that breaks through the 8-bit color depth limitation of existing HD video and allows a wider range of color than ever before.Of course, the HD-A35 upconverts from other resolutions so all your standard-definition DVDs display in near-HD quality on your HD television. In addition to 1080p, the HD-A35 also outputs at 720p and 1080i if desired.High-Definition AudioAudiophiles rejoice! The A35 has HDMI pass-through audio: The audio signal can bypass the HD DVD player's internal audio processor and feed directly into an A/V receiver. The HD-A35 can output 5.1 channel analog audio and, with HDMITM, High Bit Rate Audio (up to 7.1 channels).  With a capable receiver, the lossless Dolby TrueHD and DTS-HD Master Audio standards are then decoded externally and audiophiles will be rewarded with the highest fidelity surround sound possible, adding a new dimension of enjoyment to the home theater experience. The HD-A35 also supports other surround sound audio standards including Dolby Digital Plus, DTS 5.1, and DTS HD (core only).One-Touch ConvenienceYou can use the CE-Link (HDMI-CEC) to connect the HD-A35 with other CEC-capable devices for unsurpassed simplicity and convenience. For example, if the HD-A35 is connected to a compatible HDTV, you can turn on both the HD DVD player and the TV and start playing a movie with a single touch of a button on the remote.The HD-A35 is backed by a limited 1-year warranty.Six times the resolution of regular DVD (up to 1080p).Upconverts standard DVDs to the output resolution.Tons of new interactive features and bonus content.What's in the BoxHD-A35 HD DVD player, remote control, and power cable.", "title": "Toshiba HD-A35 1080p HD DVD Player", "price": 8.99, "imUrl": "http://ecx.images-amazon.com/images/I/31wEXdBVpOL._SX300_.jpg", "related": {"also_viewed": ["B000E21TY0", "B000YB2IPK", "B007F9XHAY", "B003ANVQWU", "B000VDDDY6", "B00AEFXP8K", "0783227876", "B004BI6MVS", "B003AWRMBA", "B001RIY4WE", "B007BYLO4E", "B000MRAAJM", "B001KZVQJI", "B00IAELTKI", "B000ZMY24I", "B001DJLD1M", "B00BQ3EGPU", "B004R6JG7G", "B007F9XHBI", "B000PC0U1W", "B00ICDAAX4", "B00HPMCO14", "B000A7DVR2", "B00BFRKYVM", "B00CALM2KS", "B00BHC7ZTE", "B00BEJL6Q8", "B004OVECU0", "B00HPMCO4Q", "B0038JECKY", "B001T6K7G6", "B00EUY59Z8", "B00CAAJDP6", "B00B981F1U", "B00JL6L4WC", "B00E9PMMX0", "B00AIBZMM2", "B00E5I2MEK", "B00HEPEBWC"], "buy_after_viewing": ["B007F9XHAY", "B007F9XHAY", "B0019EHU8G", "B000Q6GX5Y", "B000XPU66U"]}, "categories": [["Electronics", "Television & Video", "DVD Players & Recorders"]]}