{"asin": "B002C74E9C", "description": "Updated with a brilliant 21.5-inch LED-backlit widescreen display in a new edge-to-edge glass design and seamless all aluminum enclosure, the new Apple iMac is ideal for watching high definition movies and TV shows from iTunes, or editing and watching your own videos or photos using iLife. The iMac now also comes standard with a wireless keyboard and the new Magic Mouse, which features Apple's Multi-Touch technology. And it's faster than ever with a 3.06 GHz Intel Core 2 Duo processor.The 21.5-inch iMac features a brilliant LED-backlit display with widescreen 16:9 aspect ratio.The iMac declutters your desktop with a wireless keyboard and new Magic Mouse--the world's first Multi-Touch mouse.The iMac's display offers a 1920 x 1080-pixel resolution (for native 1080p high-definition viewing), and it uses IPS technology to deliver consistent color across an ultra wide 178 degree viewing angle. This 21.5-inch model also features improved graphics with the NVIDIA GeForce 9400M integrated graphics processor. It's powered by a 3.06 GHz Intel Core 2 Duo processor, which provides an optimized, multithreaded architecture for improved multitasking, video, and gaming performance.It comes pre-loaded with Apple's Mac OS X 10.6 Snow Leopard operating system--an operating system custom-designed for the advanced technology inside--and it also comes with the iLife '09 suite of applications, including iPhoto, iMovie, Garageband, and iTunes.Key Features21.5-inch LED-backlit glossy widescreen displaywith IPS technology, a 1920 x 1080-pixel resolution, 16:9 aspect ratio, 320 cd/m2 brightness rating, and 178-degree viewing angle (horizontal and vertical)3.06 GHz Intel Core 2 Duo processorwith 3 MB shared L2 cache for excellent multitasking500 GB Serial ATA hard drive(7200 RPM)4 GB installed RAM(1066 MHz DDR3; supports up to 16 GB)NVIDIA GeForce 9400M graphics processor(with 256 MB of DDR3 SDRAM shared with main memory) for an outstanding everyday graphics experience8x slot-loading SuperDrive with double-layer DVD support(DVD&plusmn;R DL/DVD&plusmn;RW/Built-in iSight camera for video chattingWi-Fi wireless networking(based on 802.11n specification; 802.11a/b/g compatible)Gigabit Ethernet wired networking(10/100/1000BASE-T)Bluetooth 2.1 + EDR (Enhanced Data Rate)for connecting with peripherals such as keyboards, mice and cell phonesSide-loading SD card slotFour USB 2.0 ports, one FireWire 800 portMini DisplayPort video outputwith optional adapters for DVI and VGA outputBuilt-in stereo speakers with two internal 17-watt high-efficiency amplifiersalong with built-in microphone, optical digital audio output/headphone out, optical digital audio input/audio line inDimensions:20.8 x 7.42 x 17.75 inches (WxDxH)Weight:20.5 poundsIncluded Apple Wireless Keyboard and Magic MouseWhat's in the BoxiMac, Apple Wireless Keyboard, Magic Mouse, cleaning cloth, power cord, install/restore DVDs, printed and electronic documentationLimited Warranty And ServiceThe iMac comes with 90 days of free telephone support and a one-year limited warranty. Purchase the AppleCare Protection Plan to extend your service and support to three years from your computer's purchase date. Only the AppleCare Protection Plan provides you with direct telephone support from Apple technical experts and the assurance that repairs will be handled by Apple-authorized technicians using genuine Apple parts.Key FeaturesBig, Beautiful Display Combined with All-In-One SimplicityThe evolution of the Apple iMac.The new iMac has come a long way from the first 15-inch iMac. The all-in-one design of the first flat-panel iMac cleaned up the desktop, and put everything you need--display, processor, graphics card, hard drive, optical drive, memory, and more--inside one simple enclosure. New technology inside and out makes the new iMac a worthy addition to the all-in-one dynasty.This 21.5-inch model features an edge-to-edge glass display that covers nearly the entire front of the enclosure. When all you see is the display, nothing gets between you and what's onscreen. Movies, TV shows, websites, photos--everything looks stunning on the new 16:9 widescreen iMac display. And the LED backlighting in the new iMac helps push more light through the pixels with remarkable brightness and efficiency. And because the LED backlight doesn't take up much space, the iMac enclosure stays thin--even with all the high-performance components inside.The iMac display is designed to look great from almost any angle. A technology called in-plane switching (IPS) makes this possible. Whether you're sitting in front of the display or standing off to the side, you'll get a perfect picture with superb color consistency and no loss of detail.The wider iMac display allows more room to separate the two hottest components, the CPU and the GPU. This keeps things cool inside the iMac enclosure. Apple engineers also implemented an intelligent control system that monitors temperatures and delivers just the right amount of airflow to critical components. And the three fans inside iMac have been tuned to be ultraquiet.While you'll find a collection of ports on the back of iMac, you won't find much else. A seamless, precision-forged enclosure makes the back one continuous aluminum surface. And there's only one cord: the power cord.Wireless Magic Mouse and KeyboardForget the mouse as you know it. Every iMac comes with the wireless Magic Mouse: the world's first Multi-Touch mouse. Use it once and you'll wonder how you ever used anything else. There's no scroll ball, no clunky wheel, no cord, and no visible button. Instead, the Magic Mouse uses Multi-Touch technology to let you control everything with simple gestures. Give them a try and you'll find that Magic Mouse changes the way you interact with your computer. Built-in software lets you configure Magic Mouse any way you want. Its smooth, seamless design is ambidextrous, and it supports two-button clicking--without buttons.The iMac banishes desktop clutter completely with a wireless keyboard to go with the wireless Magic Mouse. This low-profile keyboard takes up less desk space--24 percent less--than larger keyboards. There's no numeric keypad, so you can place your mouse comfortably next to the keyboard. And built-in Bluetooth means there are no cables to connect.Built-in Wi-FiHigh-speed 802.11n wireless technology is built into iMac. And with Time Capsule or the AirPort Express Base Station, every computer in every room can wirelessly connect to iMac, the Internet, and each other. Over this network, everyone can print, surf the web, and play music on iTunes through your home stereo--wirelessly.iSight WebcamHidden behind the glass display at the top of iMac is an iSight camera. Use it with iChat, and you can be anywhere without actually being there. Video chat with up to three of your friends, share a video with a colleague, or present to a client. Use iSight with Photo Booth for fun photo effects. And there's no need to waste valuable primping time installing software or configuring the camera.Pre-Loaded with Mac OS X Snow Leopard and iLife '09Every Mac comes with Mac OS X Snow Leopard, the world's most advanced operating system, and iLife, Apple's innovative suite of applications for managing photos, making movies and creating and learning to play music. Snow Leopard builds on a decade of OS X innovation and success with hundreds of refinements, new core technologies and out of the box support for Microsoft Exchange. iLife features iPhoto, to easily organize and manage photos; iMovie with powerful easy-to-use new features such as Precision Editor, video stabilization and advanced drag and drop; and GarageBand which introduces a whole new way to help you learn to play piano and guitar.Installed softwareMac OS X v10.6 Snow Leopard (includes Time Machine, Quick Look, Spaces, Spotlight, Dashboard, Mail, iChat, Safari, Address Book, QuickTime, iCal, DVD Player, Photo Booth, Front Row, Xcode Developer Tools)iLife '09 (includes iPhoto, iMovie, GarageBand, iWeb, iDVD)@ DesignBecause Apple designs both hardware and software, we can reduce our environmental footprint in ways others can't. For starters, a highly efficient power supply reduces the amount of power wasted when bringing electricity from the wall to your Mac. Unlike a lot of PCs, a Mac uses energy-efficient hardware components that work hand in hand with the operating system to conserve power--even between keystrokes.A Mac also doesn't contain a lot of toxic materials. All Mac displays are mercury and arsenic free, and the internal components are free of polyvinyl chloride (PVC) and brominated flame retardants (BFRs).Efficient Power SupplyThe iMac includes a highly efficient power supply that reduces the amount of power wasted when bringing electricity from the wall to your computer. Lower power consumption reduces energy bills and lessens the environmental impact of greenhouse gas emissions from power plants.Advanced Power ManagementUnlike a lot of Windows-based PC systems, iMac uses energy-efficient hardware components that work hand in hand with the operating system to conserve power. Mac OS X spins down hard drives and activates sleep mode on already energy-efficient LED-backlit displays. And it balances tasks across both central processors and graphics processors. Mac OS X never misses a power-saving opportunity, no matter how small. It even regulates the processor between keystrokes, reducing power between the letters you type. That's just one of many ways Apple manages small amounts of power that add up to big savings.ENERGY STAR QualificationThe iMac meets the stringent low power requirements set by the EPA, making it ENERGY STAR qualified. ENERGY STAR 5.0 sets significantly higher efficiency limits for power supplies and aggressive limits for the computer's typical annual power consumption.", "title": "Apple iMac MB950LL/A 21.5-Inch Desktop (OLD VERSION)", "imUrl": "http://ecx.images-amazon.com/images/I/41NTb0MCcWL._SX300_.jpg", "related": {"also_bought": ["B002TLTGM6", "B005DLDTAE", "B008LTBJFM", "B00361EZUQ", "B00746YPQI", "B005DLDO4U"], "buy_after_viewing": ["B004YLCIC4", "B008AL9VXI", "B005DLDO4U", "B003XIJ3MW"]}, "categories": [["Electronics", "Computers & Accessories", "Desktops"]]}