{"asin": "B001U0O7RG", "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS"]], "description": "The ultra-thin n&uuml;vi 1390T is a full-featured navigator that offers lane assist with junction view and subscription-free traffic alerts for many metro areas. n&uuml;vi 1390T announces streets by name and has hands-free calling compatibility. It also has pedestrian routing that can be enhanced with optional cityXplorer&trade; maps for mass transit information and ecoRoute&trade; to calculates a more fuel-efficient route.Just over a half-inch thick with a 4.3-inch widescreen display.Click to enlarge.Lane assist guides you to the correct lane for an approaching turn or exit, making unfamiliar intersections and exits easy to navigate.Click to enlarge.The device announces the name of exits and streets so you never have to take your eyes off the road.Click to enlarge.Junction View gives you a photo-realistic screen that shows you both the road detail as well as the signs as you will see them on the road.Click to enlarge.Receive Subscription-Free Traffic AlertsSteer clear of traffic with n&uuml;vi 1390T's integrated FM traffic receiver and free lifetime&sup1; traffic updates. Receive alerts about traffic delays and road construction that lie ahead on your route. Next, simply touch n&uuml;vi's screen to view traffic details or detour around the problem area.An ultra-thin GPS navigator with great Garmin features like CityXplorer and ecoRoute.Click to enlarge.Know the Lane Before It&rsquo;s Too LateNo more guessing which lane you need to be in to make an upcoming turn. Lane assist with junction view guides you to the correct lane for an approaching turn or exit, makingunfamiliar intersections and exits easy to navigate. It realistically displays road signs and junctions on your route along with arrows that indicate the proper lane for navigation. Lane assist with junction view is available in select metropolitan cities.Navigate City TransitWith its enhanced pedestrian navigation capabilities, n&uuml;vi 1390T is the perfect travel companion for getting around town. Download optional cityXplorer&trade; content to help you navigate city public transit. Know where to walk, where to catch the bus, subway, tram or other transportation, and how long it will take to get there. n&uuml;vi 1390T easily fits in your pocket or purse. cityXplorer maps are available for select cities throughout North America and Europe. And with prices as low as $9.99, you'll have money left over to spend in the big city.See MoreWith n&uuml;vi 1390T's widescreen display, you'll always get the big picture. View map detail, driving directions, photos and more in bright, brilliant color. Its sunlight-readable, 4.3\" (10.92 cm) display is easy to read, from any direction.Get Turn-by-Turn Directionsn&uuml;vi 1390T's intuitive interface greets you with two simple questions: \"Where To?\" and \"View Map.\" Touch the color screen to easily look up addresses and services and get voice-prompted, turn-by-turn directions that speak street names to your destination. It comes preloaded with detailed City Navigator&reg; NT street maps, nearly 6 million points of interest (POIs), 2-D or 3-D maps and the speed limit for most major roads in the U.S. and Europe. Its digital elevation maps show you shaded contours at higher zoom levels, giving you a big picture of the surrounding terrain. With the 1390T's enhanced user interface, you can slide your finger to conveniently scroll between screens. You also can upload custom points of interest (POIs). And with HotFix&reg; satellite prediction, n&uuml;vi calculates your position faster to get you there quicker.Make Hands-free CallsFor hands-free calling, n&uuml;vi 1390Tintegrates Bluetooth&reg; wireless technology with a built-in microphone and speaker. Just pair it with your compatible Bluetooth phone and talk hands-free through the 1390T while staying focused on the road. Simply dial numbers with n&uuml;vi's touchscreen keypad to make a call. To answer calls, just tap the screen and speak into its built-in microphone. Enjoy convenient one-touch dialing for contacts and points of interest.Go Beyond NavigationNavigation is just the beginning. n&uuml;vi 1390T saves you gas and money with ecoRoute &mdash; a green feature that calculates the most fuel-efficient route, tracks fuel usage and more. The 1390T includes many travel tools including JPEG picture viewer, world travel clock with time zones, currency converter, measurement converter, calculator and more. With photo navigation, you can download pictures from Garmin Connect&trade; Photos and navigate to them. With its \"Where Am I?\" emergency locator, you always know your location. Simply tap the screen to get your exact latitude and longitude coordinates, the nearest address and intersection, and the closest hospitals, police stations and fuel stations. The 1390T features Garmin Lock&trade;, an anti-theft feature, and is compatible with our free Garmin Garage&trade; where you can download custom voices and vehicles. Enhance your travel experience with optional plug-in microSD&trade; cards.What's in the Boxn&uuml;vi 1390, Preloaded City Navigator&reg; NT North America (U.S. and Canada), Lifetime traffic&sup1;, Vehicle suction cup mount, FM traffic receiver with vehicle power cable (indicated by \"T\" after model number on the box), Vehicle suction cup mount, USB cable, and Quick start manualCompare all Garmin n&uuml;visClick the button below to compare by series, user type, and features.Visit Garmin.com athttps://www8.garmin.com/support/download.jspto get the latest firmware updates for your n&uuml;vi to keep it current and performing at its best.&sup1;Lifetime traffic extends for the useful life of your Garmin traffic receiver (as long as you own a compatible Garmin GPS) or as long as Garmin receives traffic data from its traffic supplier, whichever is shorter. Traffic content not available for all areas. See www.navteq.com/rdstraffic for traffic coverage areas and www.garmin.com/traffic/fm/navteq.html for program License Agreement containing complete terms and conditions.", "title": "Garmin nuvi 1390/1390T 4.3-Inch Widescreen Bluetooth Portable GPS Navigator with Traffic (Discontinued by Manufacturer)", "price": 199.95, "imUrl": "http://ecx.images-amazon.com/images/I/41kKGwzXepL._SX300_.jpg", "brand": "Garmin", "related": {"also_bought": ["B002Z1J8R8", "B003DSCU72", "B0030BJ9S0", "B0039LRQ8G", "B002OL2MU4", "B001U0O7T4", "B003ZX8B1E", "B0015EWMX8", "B002771V48", "B0057OCS9A", "B004I5BUSO", "B001U0O7SA", "B004072386", "B0057ODOCA", "B003MX2UX2", "B003ZX8AZQ", "B003W645N2", "B003EYVG0C", "B0029LL5IY", "B001XUQPJQ", "B003ZX8B3W", "B002VPE21A", "B002WIZWHY", "B00357TQTQ"], "bought_together": ["B002OL2MU4", "B004I5BUSO"], "buy_after_viewing": ["B003ZX8B1E", "B002OL2MU4", "B005DIBHCE", "B00AXX0I88"]}}