{"asin": "B00007KDVJ", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Wireless Access Points"]], "description": "Amazon.com Product Description The Linksys Wireless-G access point lets you connect Wireless-G (802.11g) or Wireless-B (802.11b) devices to your network. Because both standards are built-in, you can protect your investment in existing 802.11b infrastructure, and migrate your network clients to the new screaming-fast Wireless-G standard as your needs grow.For more information on the differences between an access point and a router with access point, see the following table:To protect your data and privacy, the Wireless-G access point can encrypt all wireless transmissions. The MAC address filter lets you decide exactly who has access to your wireless network. Configuration is a snap with the Web browser-based configuration utility.Wireless-G is the upcoming 54 Mbps wireless networking standard that's almost five times faster than the widely deployed Wireless-B (802.11b) products found in homes, businesses, and public wireless hotspots around the country--but since they share the same 2.4 GHz radio band, Wireless-G devices can also work with existing 11 Mbps Wireless-B equipment.Future-proof your wireless network with the Linksys Wireless-G access point. You'll enjoy Wireless-B connectivity today, and be prepared for a high-speed Wireless-G tomorrow.The Linksys Wireless-G access point is compatible with Windows 95, 98, Me, NT 4.0, 2000, and XP.See acomparison diagramof the different wireless technologies.Wireless networks are rapidly becoming more popular and coming down in price. Since they don't require cables, you can use the devices anywhere in an office or home, even out on the patio. There's no need to roll out an Ethernet network cable to each room of a house; you can network anywhere--without wires. Outside the home, wireless networking is available in hotspots at coffee shops, businesses, and airports--great when you're on the road and need to get some work done. For convenience, wireless networking is the answer.Which Wireless Standard Is Right for Me?Now that you've decided to create a wireless network, the next step is to figure out which wireless standard to use.Basically, a standard is a set of specifications for a device. All devices that follow a specific standard share operating characteristics, such as the radio frequency used and maximum data transfer speed.For wireless networking, there are three standards to choose from at this time:802.11b802.11a802.11gTo learn about the differences between the standards and select the right one for your network,click herefor an easy-to-understand chart.", "title": "Cisco-Linksys WAP54G Wireless-G Access Point", "price": 159.0, "imUrl": "http://ecx.images-amazon.com/images/I/41xFqsgzCtL._SX300_.jpg", "brand": "Linksys", "related": {"also_bought": ["B0002F3G7M", "B00BK0YRZS", "B000BTL0OA", "B0000AG8TX", "B00007KDVI", "B0000Y7W98", "B002LITFTG", "B00004SB92", "B00003006E", "B002YETVXC", "B009UNQGEW", "B0001D3K8A", "B000NZNTVE", "B0000BVYT3", "B00003006K", "B000ELSXFY"], "bought_together": ["B0002F3G7M", "B000BTL0OA"], "buy_after_viewing": ["B000BTL0OA", "B00BK0YRZS", "B0002F3G7M", "B006QB1RPY"]}}