{"asin": "B002GXIT6Q", "description": "Don't just hear the music, feel it. With the Remix Remote, you get unparalleled sound clarity and vibrant bass putting you in every song. Plus, you get control at your fingertips with the integrated three-button remote and high fidelity microphone. Combining all-metal craftsmanship with fashion-forward design, the Remix Remote is lightweight and durable, perfect for the mobile lifestyle.Unparalleled Control and SoundA three-button remote and high fidelity, omni-directional microphone let you control the music playback, volume or Voice Control functions with ease. A newly tuned 9mm V-MASQUE high definition dynamic driver creates the absolute in clarity and the perfect balance of vibrant bass built in collaboration with pro musicians and DJs. The BEATPORT air flow system delivers a high-definition soundstage, invoking the sense of a live music or club experience. V-MODA's revered BLISS (Bass Level Isolating Soft Silicone) noise-isolating technology further reduces outside noise and enables deep punchy bass for the ultimate audio experience.Universal CompatibilityFeaturing a three-button remote and discrete omni-directional microphone, the Remix Remote gives you complete control of an iPhone 3GS or supported iPod. You can play, pause, raise or lower the volume of your music with the touch of a button. You can even record voice memos and utilize Apple Voice Control. Of course, you can listen to music with any iPod. In fact, any mp3 player with a 3.5mm input will work with the Remix Remote.Kevlar core for serious durability.Click to enlarge.What about other phones? You can use the high-fidelity microphone and control button to talk all you want with your favorite phone, provided it has a 3.5mm jack.Want to use the Remix Remote with your Mac? You can, it's compatible with the latest Mac products, including the iMac, Mac Pro, MacBook or MacBook Pro and can be used for iChat, iTunes, Skype, VoIP, and other audio recording applications.Ultimate Ergonomic ComfortYour headphones are supposed to be comfortable. With rigorous ergonomic research and development, the Remix Remote gives you an incredible fit for the ultimate music experience. The newly designed medical-grade soft silicone ear tips come in four sizes and are designed for a comfortable and secure fit. For the active lifestyle, the detachable sport earhooks feature patent pending Active Flex technology for maximum stability.Built to LastWe're passionate about sound and providing you a durable product. We've spent years of diligent engineering to insure Remix Remote is multiple times stronger than many headphones sold within the same price range. Each component was dissected and analyzed by a team of seasoned engineers to create a high-quality headphone that could withstand the extended use by V-MODA's dedicated listeners. With the dual functionality of today's headphones as headsets, it is paramount that the cable and plug are as precisely engineered as the ear buds. Special attention was given to a custom cable construction comprised of a strong Kevlar core to relieve tension and a uniquely braided copper material that is specially designed to increase flex during use. The gold-plated plug and stainless steel core feature a 45-degree extended strain relief to withstand stress.What It Means to be a \"Lifestyle\" HeadphoneAt the gym, heading to the venue, or walking down the street, the Remix Remote is designed for your mobile lifestyle. Weighing only 17 grams, they are lightweight for comfort. Featuring all-metal construction, the Remix Remote combines sleek design and durability. The patent pending detachable sport earhooks insure you don't miss a beat, even when you're on the go. With the Remix Remote, the pinnacle experience of music is interwoven with supreme style in these premium fashion-phones that sound as amazing as they look.We put years of extra thought and research into the cable. Why is the cable so important? The main cable diameter of 2.2mm and overall cord length of 44&quot;-46&quot; work best to prevent &quot;earphone fallout&quot;. V-MODA's cables are rigorously tested with weights to withstand abuse.", "title": "V-MODA Remix Remote In-Ear Noise-Isolating Metal Headphone with 3-Button Apple Control (Blush) (Discontinued by Manufacturer)", "price": 37.31, "imUrl": "http://ecx.images-amazon.com/images/I/41kT2HuPtHL._SY300_.jpg", "related": {"also_bought": ["B006DK65A0", "B002DMKPS0", "B008MW7SLW", "B0018M8L6O", "B008S4TM1S", "B005LD275M", "B0011345GA", "B003J5FWGK", "B008B6TWP4"], "buy_after_viewing": ["B006DK65A0", "B002DMKPS0", "B0018M8L6O", "B008MW7SLW"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]]}