{"asin": "B000930DLO", "description": "Welcome to the Corleone family. After a life of small-time jobs and petty thefts, you&#146;ve been accepted into America&#146;s most famous criminal organization. Now it&#146;s up to you to carry out orders, earn respect, rise through the ranks, and make New York City your own. Play your cards right and you could even be running everything as the next--and most powerful--Don.A story about family, respect, and loyalty,The Godfatherbook by Mario Puzo and film by Paramount Pictures serve as inspiration for the game, as you join the Corleone family and earn respect through loyalty and fear while you rise through the ranks to become Don in a living, 1945-1955 New York. The Godfather video game will put you at the center of action in one of history&#146;s most revered cinematic masterpieces, allowing you to create yourself in the game, and then choose your path as you rise from lowly outsider to envied and feared Don.Featuring non-linear action-adventure gameplay,The Godfatherwill offer gamers countless choices for solving the family&#146;s problems with brutal violence, skillful diplomacy, or a cunning mixture of both. From mob hits and bank heists to drive-bys and extortion, step deep inside the world of The Godfather--where intimidation and negotiation are your tickets to the top. Players will use their powers of loyalty and fear to earn respect through interactions with characters in the world. Decisions made by the player in the game will have lasting consequences, just as it was in the mob underworld featured inThe Godfatherfiction.The Godfatherfilm from Paramount Pictures featured some of Hollywood&#146;s finest actors, and several are contributing to the game&#146;s development. All character likenesses from the movie will be included, and lending their voices to add a dramatic and cinematic touch to the game are the late Marlon Brando as Don Vito Corleone, James Caan as Sonny Corleone, and Robert Duvall as consigliore Tom Hagen.Features:The world of The Godfather: experience a decade of violence in New York City from 1945-55.Classic film moments: non-linear action-adventure gameplay with missions direct from the film and original missions with characters from the film provide an experience for all types of gamers.Put yourself in the Godfather: players will create their own mobster and put themselves in the action of the game and experience the fiction of The Godfather.Respect and consequences: Players will use their powers of loyalty and fear to earn respect throughout New York City. Decisions made by the player in the game will have lasting consequences.Persistent world: Your character will interact freely with other characters in the world. Depending on your needs in the game and how you choose to play the game, by violent or intimidating means or respectful or negotiating means, the characters in the world will remember your interactions with them and your interactions will affect the outcome of the game.Compete for New York: the control of New York will be challenged by the five families from the fiction including the Tattaglia, Cuneo, Sollozzo, Brazini, and Stracci families.Mark Winegardner, author of the novel Godfather Returns, provided story editing and fiction insight.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/41XNJWKVCTL._SY300_.jpg", "related": {"also_bought": ["B0007PLKZM", "B0009SQF0C", "B0000A03AG", "B0009Z3HYW", "B0001ADAME", "B00008DHNL", "B0001VGFK2", "B000KCX9M4", "B000FW300K", "B000EHQDA0", "B0009Z3HXI", "B0000696CZ", "B000EMJA3M", "B001GGO1GG", "B00004YRQA", "B0009351R0", "B000NGWFX6", "B000B69E9G", "B000F0GX8I", "B00005OLX1", "B000YYR3D4", "B00020BV2E", "B00020LZAW", "B00005O0I2", "B00097CYZS", "B0000A8VBZ", "9629971372", "B0001AVZ5I", "B001MW91IW", "B000CRSBLG", "B000930DOQ", "B000TLU67W", "B000NIJ35W", "B0033T1UWW", "B000FW4YOQ", "B0009O7HVM", "B000069BCR", "B000UH6GEM", "B0009EHQVI", "B00004YRQ9", "B00006RHM0", "B00020V5B6", "B0002RQ3ES", "B0001NE48U", "B000Q6CZYM", "B000MKR2CM", "B0007SL1ZI", "B00005J536", "B000083JTR", "B0000B0MNH", "B00005CF9L", "B00009VE6D", "B00005NUIZ", "B0013KW1B2", "B0009N1KCU", "B0000A0MDV", "B0002CHJ8C", "B0002XL3BA", "B00006GSO0", "B0009R1T9K", "B0000C7GHG", "B0009VRSIC", "B00019AZBO", "B000GVYYFK", "B0000TSRA6", "B0008GJRRS", "B000G6SPHI", "B000MF8AV4", "B000QAVV70", "B0002CNUN0", "B00009ZVHY", "B000G7YX14", "B0000A92KX", "B00005V6BB", "B0013JHKU0", "B0009350BW", "B00005ME6N", "B0032GTMEE", "B000QB059Y", "B001CLG6SG", "B0002TVX6O", "B0002IQCSY", "B000088KH1", "B0022TNO6E", "B000095ZH5", "B0002EJ8FC", "B000F1YH62", "B003P9LECG", "B000099T2H", "B002C7TFVO", "B00008NRM7", "B001AZFSEM", "B0002GTFJ4", "B000066TS5", "B00009WAVD", "B0009R1SRI", "B0000A082Y", "B0000VSH3G", "B004S3KB6S", "B002BWS5QG"], "bought_together": ["B0007PLKZM", "B0001VGFK2"], "buy_after_viewing": ["B0007PLKZM", "B001GGO1GG", "B0009SQF0C", "9629971372"]}, "salesRank": {"Video Games": 11760}, "categories": [["Video Games", "More Systems", "PlayStation 2"]]}