{"asin": "B0002ZAILY", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]], "description": "From the ManufacturerNote: For the latest version of the iPod Shuffle, see theApple 1 GB Shuffle (Metal).Time to mix things up. Meet iPod shuffle, the unpredictable new iPod. What will it play next? Can it read your mind? Can it read your moods? Load it up. Put it on. See where it takes you.Random is the New OrderWelcome to a life less orderly. As official soundtrack to the random revolution, the iPod Shuffle Songs setting takes you on a unique journey through your music collection -- you never know what's around the next tune. Meet your new ride. More roadster than Rolls, iPod shuffle rejects routine by serving up your favorite songs in a different order every time. Just plug iPod shuffle into your computer's USB port, let iTunes Autofill it with up to 240 songs and get a new experience with every connection. The trail you run every day looks different with an iPod shuffle. Daily gridlock feels less mundane when you don't know what song will play next. iPod shuffle adds musical spontaneity to your life. Lose control. Love it.Smaller than a pack of gum and much more fun.DJ Your DayIf you favor cycling to a hip-hop soundtrack and snowboarding to a little electronica, Autofill iPod shuffle from a specific iTunes Playlist and roll. Download an album from the iTunes Music Store and listen to it in order before you Shuffle it into your collection. Or just drag and drop individual songs from iTunes onto iPod shuffle. With Play in Order mode, you manage the music. If things take a turn for the predictable, never fear. Turn iPod shuffle over, flip the slider to Shuffle and mix on the go.Goes with EverythingiPod shuffle weighs as little as a car key and makes a tuneful fashion statement. Just throw the included lanyard around your neck and take a walk. Or run. Or ride. There's nowhere your skip-free iPod shuffle can't go, and with up to 12 hours of continuous playback time, it keeps going as long as you do. A neat little cap protects the USB connector, and those signature white earbud headphones tell the world you love to listen in style. You can even make your iPod shufflesplash-proof,arm-hugging, andlonger-runningwith optional accessories. Ready for anything from a Transatlantic flight to a weekend at the beach, the iPod shuffle makes the perfect, low-maintenance pal.Touch of GeniusGood things really do come in small packages. The controls on the iPod shuffle feel as intuitive and easy to use as those on every iPod model. Play, pause, skip, repeat, shuffle and hold at the touch of a thumb: The circular, ergonomic controls and one-click slider make it simple to listen without looking.The Music Store in Your HouseAdd to the iPod shuffle mix with songs downloaded from the iTunes Music Store. Browse and preview more than one million songs, then buy what you want, 24-7, from the comfort of your Mac or PC. With the iTunes Music Store and iPod shuffle, you'll always have music at hand literally.The smallest iPod yet, iPod shuffle fits neatly in the palm of your hand and looks just plain neat around your neck. Prepare to make friends and influence people when you wear it biking, hiking, snowboarding, dog-walking and anywhere else that could use a great soundtrack.Download an album and listen to it in order before you Shuffle it into your collection.That includes off-the-beaten-path spots where you may need to play, pause, move back, skip forward, shuffle and turn up the volume without looking. Luckily, iPod shuffle pays due respect to its elders with a thumb-friendly, circular control pad that puts the 'go' in ergonomic.Plug-and-PlaylistsiPod shuffle makes syncing a piece of cake. Cupcake, even. Use the optional Dock to connect to your computer or just plug iPod shuffle directly into a USB port on any computer. Then drag and drop individual songs, Autofill your favorite playlists or Autofill your iPod shuffle with a random sampling from your music library. Since iPod shuffle automatically charges while syncing, it stays ready for your next adventure.", "title": "Apple iPod shuffle 512 MB White (1st Generation)  (Discontinued by Manufacturer)", "price": 54.99, "imUrl": "http://ecx.images-amazon.com/images/I/31B394KN81L._SY300_.jpg", "brand": "Apple", "related": {"also_bought": ["B00074Z9OQ", "B000IHGJ50", "B0021ZUMPK", "B0033QQBZQ", "B00074Z9P0", "B004WE6UFO", "B0007KX4VA", "B000CPYWG6", "B000EP4TWQ", "B00496G5KU", "B0062W0XD4", "B006Z8M3P6", "B0007VHIUC", "B002M3SON8"], "bought_together": ["B0062W0XD4"], "buy_after_viewing": ["B000NU4OTA", "B0097BEEW8", "B000IHGJ50", "B008F4ZR6A"]}}