{"asin": "B003IT70B2", "categories": [["Electronics", "Home Audio", "Stereo Components", "Speakers", "Subwoofers"]], "description": "Pinnacle's SUB-SONIX 10-200 is a 10\" 200 Watt Front Firing powered subwoofer with tremdndous, authoritative bass down into the mid 20Hz range with an SPL of over 115 dB, which is louder than at a packed house for a pro football game! Even as they deliver a full compliment of speakers Pinnacle Speakers engineers remain, above all, bass experts. Pinnacle has a roster of notable achievements including US Patents for innovative designs. The SUB-SONIX 10-200 is protected by Pinnacle's stellar warranty. Designed and manufactured in the USA. Family Owned and Operated. For over 30 years, Pinnacle Speakers has been synonymous with superior performance and value and is relied upon by thousands of professional custom home installers as their speaker of choice. Pinnacle products have been installed in millions of households and now their tradition of excellence is available directly to you. All Pinnacle speakers are designed in their state-of-the-art research facility in Massachusetts and most Pinnacle products are assembled at their factory in New York. Decades of Rave Reviews. Throughout the years Pinnacle speakers have been consistently recognized by the critical industry press for innovative designs, superior performance, build quality and great consumer value regardless of price point.", "title": "Pinnacle Speakers SubSonix 10-200 10-Inch 200 Watt Front Firing Powered Subwoofer (Black)", "price": 91.98, "salesRank": {"Electronics": 41661}, "imUrl": "http://ecx.images-amazon.com/images/I/51panH4pbUL._SY300_.jpg", "related": {"also_bought": ["B003LY36TO", "B003FW0WIK", "B0001XGR1C", "B003FVYXY0", "B0001XGQTA", "B0015A8Y3E", "B0029HHIDY", "B009AOG0KQ", "B0077V88YU", "B003FVX9FO", "B0018QROM2", "B0077V8930", "B00B7X2OW6", "B007O1NPYG", "B0077V88VI", "B0077V88W2", "B003CCRZWO", "B007JF85WE", "B000X9O8SI", "B00006JPDI", "B003BKW2K2", "B00D2172MS", "B004EBX5GW", "B0049Z89MS", "B004QOA92A", "B0015AJW94", "B0093F4ROI", "B007JF85VU", "B009EPSJXM", "B0019EHU8G", "B007JF861O", "B003CP0K9Q", "B0015AB7RE", "B004WR125O", "B006U3O566", "B00BHC7ZTE", "B007O5ATC8", "B00873FGP6", "B00823170Y", "B0097JLQVC", "B004LT2C5W", "B004CM4A58", "B002MP5JX4", "B0052SCU8U", "B005LJQOPK", "B000BVCSMG", "B001TH7GSW"], "buy_after_viewing": ["B0002KVQBA", "B0015A8Y5M", "B003FW0WIK", "B003FVYXY0"]}}