{"asin": "B0000642RX", "description": "Stay comfortable and work longer with the Microsoft Natural Keyboard Elite. The split, gently sloped shape of this keyboard allows you to type with a more natural hand, wrist, and forearm position. The ergonomic design helps to prevent poor posture and fatigue, so you can work longer at your computer. At the same time, enhanced F-key commands and a multimedia center give you more control over how your system works, enabling you to tailor your keyboard to match your needs.Natural Keyboard EliteAt a Glance:Ergonomic design for extra comfort.Multimedia controls.Enhanced F-key commands.Connects to USB or PS/2 port.Designed For ComfortYou spend a lot of time with your hands on a keyboard, which is why comfort is key. The Natural Keyboard Elite features a split, gently sloped keyboard design that promotes a more natural hand and arm position. A built-in palm rest prevents fatigue, while adjustable keyboard legs ensure that you can find the typing position that works best for you.More Control Over Your SystemGet one-touch control over the computer functions you use the most with the Natural Keyboard Elite's enhanced F-key commands. Whether you want to enjoy your favorite music, video clips, or media programs, the multimedia controls give you quick and easy access to all the commands. You can even set the perfect sound level with the integrated volume controls.Easy Connection To Your PCThe Microsoft Natural Keyboard Elite connects quickly and easily to your PC through any available USB or PS/2 port. It is backed by a limited three-year warranty.What's in the BoxThe Microsoft Natural Keyboard Elite connects quickly and easily to your PC through any available USB or PS/2 port. It is backed by a limited three-year warranty.", "title": "Microsoft Natural Keyboard Elite", "price": 31.99, "imUrl": "http://ecx.images-amazon.com/images/I/41TOc8nO2TL._SX300_.jpg", "related": {"also_bought": ["B0076KUTKS", "B00BPJL5Z4", "B000Y2GVOI", "B004GXZ69W", "B00028OP2Y", "B004SUIM4E", "B001F42MKG", "B000A6PPOK", "B0002CE0XO", "B00006B7HB", "B0076KQRXG", "B000A0K2JO", "B0009RKLMG", "B004V94F5C", "B0043T7FXE", "B003V8Y892", "B00H09BOXQ", "B0010LXT9W", "B0006FUHSE"], "buy_after_viewing": ["B000A6PPOK", "B0076KUTKS", "B004SUIM4E", "B0076KQRXG"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Keyboards"]]}