{"asin": "B001TOMQVC", "description": "Dead Space Extractionis a prequel to 2008's critically acclaimed third-person action horror game for Next-Gen and PC platforms,Dead Space. A Wii exclusive,Extractionups the action through an exciting mix of intuitive controls, co-op gameplay, puzzle-solving and branching pathways. Together with the addition of new enemies, characters, weapons and environments,Dead Space Extractionsets a new standard for action horror on the Wii that is sure to please both those new to theDead Spacegame universe, and those anxious for more..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }New FPS perspective.View larger.New characters, weapons...View larger.Two-player co-op and arcade style challenge mode play options.View larger.StoryDead Space Extractiontells the untold story of the Aegis VII Colony through a handful of survivors battling to reach the orbiting USG Ishimura amidst a horrific infection and the initial invasion by a violent alien race known as Necromorphs. As these survivors' allies mysteriously fall victim to dementia, it becomes clear that protecting a young girl granting them a bizarre immunity may be their only hope for survival in a struggle that could have implications for all of humanity.GameplayAlthough designed to preserve the feel of the action of the original game, gameplay inExtractionis also quite unique. First, the player perspective has been changed from third, to first-person, placing all the action right in front of you. Also,Extractionis a 'rail shooter,' meaning a shooter game where most of the action engaged in and paths followed are programmed into the mission play, instead of the freeform wandering ability built into the considerably larger Next-Gen and PCDead Spacerelease. The combination of these two changes funnels the players focus onto the combat options available in the game. In dealing with the danger of the alien Necromorphs swarming the game space,Dead Space Extractionutilizes the precision of the Wii Remote in variety of ways. Weapons like the Plasma Cutter can dispatch these enemies from a distance by taking advantage of the remote's pointing targeting ability, while a quick wave can activate weapons like the Ripper, a guidable spinning saw blade. The Wii Remote is also handy for picking up items and hurling them at enemies using the power of Kinesis.Other gameplay changes include new play modes. The most notable of these is the inclusion of a two player co-op play option. This allows an additional player to drop in or out of the action as he/she chooses. The game rebalances the opposition in these cases to make sure that the gameplay doesn't become too easy. In addition,Extractionalso features a Challenge mode in which after certain sections of the game are cleared, areas within those sections are unlocked for bonus arcade style action where players build up points linked to how many Necromorphs are destroyed. Taken together all these changes add up to more action, more fun and moreDead Spacefor players on the Wii.Key Game FeaturesAn All-New Prequel Exclusively for the WiiFollow the lives of several different Aegis VII colony members as they carve a bloody path to survival.Meet a new cast of characters, destroy fearsome new enemies, and wield brutal new weapons.Real TerrorStunning graphics, panic-inducing audio, and a frenetic first-person perspective thrust you headlong into the terror.Play through an engrossing, interactive horror movie experience that raises the bar for storytelling in video games.Intuitive ControlsStrategically dismember your enemies with pinpoint control using the Wii Remote.Wield a powerful arsenal of abilities and weapons to freeze enemies, manipulate gravity with telekinesis, solve puzzles, and fight off attacks from every direction in zero gravity.Co-Op GameplayTeam up with a friend to fight off the invasion on the USG Ishimura with jump-in cooperative play.Combine efforts on engineering puzzles or determine specific roles to create a unique experience with each play session.", "price": 35.94, "imUrl": "http://ecx.images-amazon.com/images/I/51ZUm16d-ZL._SY300_.jpg", "related": {"also_bought": ["B001ET07O0", "B000P297F2", "B0020H46D8", "B001TOMR0C", "B000WCQWR6", "B000P46NKC", "B002EE7OKE", "B002CZ3SLO", "B0019SY1D4", "B002BRZ9AG", "B000RF7164", "B001SI39E2", "B001HB7K6I", "B00269DXXO", "B000X2RKOO", "B001HKPUKC", "B000FQBPDU", "B002BRYXOO", "B00269DXR0", "B001P5HM64", "B003WOFXEY", "B001D8TQ44", "B002BSC4ZS", "B000X25GW2", "B0037M2SOY", "B000Z9A95M", "B003P5AJFI", "B003JD7QYI", "B000G7PMX2", "B002EE5SAC", "B002E6XY6U", "B00B47WVLE", "B007CSF3GO", "B000P297ES", "B000XPMU1O", "B004WLRQMI", "B000W5Y49G", "B003O6H7X0", "B002I08CJG", "B000NDFFFE", "B00B2QL2Y4", "B001AWIP7M", "B002DC8GWC", "B002BSC4RQ", "B00163ROMC", "B00897Z27C", "B003ZCH7DI", "B001COVME6", "B003ZHMMEM", "B002I0IIPY", "B001CU4EMW", "B005FYJA52", "B002BSA388", "B003N3HEU0", "B002FG9MWE", "B002ATY7JE", "B001C58T46", "B000G7T7JC", "B002BRZ9G0", "B0042A1B84", "B0094X1ZXU", "B002I0GEXM", "B001AWFIPO", "B000R3BNHE", "0765325047", "B0030GBU8W", "B005EIIBKY", "B0050SVFB0", "B007RNWUC4", "B006L1FAK2", "B000GPW2QO", "B00309U0M6", "B000FQBPCQ", "B003VJOC4W", "B000FQ9R4E", "B000FQ9QVI", "B001HTFQ0C", "B0094X28J0", "B005EHQJ2C", "178116553X", "B002TLTBN0", "B004L5SJ5I", "B002BSC54I", "B006QRNKOO", "B0017WHQ34", "B000CBCVFE", "B004I6KDA4", "B0040KJGEM", "B005C2QSDY", "B00B59L9YG", "B000GQ1NK4", "B0010YOQIC", "0765364301", "B0058CA4S8", "B003GB4UXI", "B001GIUWX0", "B001ADW51S", "B00117PPME", "B000NIJ35M", "B0016OVBG6"], "bought_together": ["B001ET07O0"], "buy_after_viewing": ["B001ET07O0", "B000P46NKC", "B000WCQWR6", "B0020H46D8"]}, "salesRank": {"Video Games": 8929}, "categories": [["Video Games", "Wii", "Games"]]}