{"asin": "B004LU1CA2", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]], "description": "The Satechi BT Wireless is a super-stylish Bluetooth stereo speaker  system that combines exceptional audio performance and cutting-edge  portable design. It connects wirelessly to your smartphone, tablet,  notebook, allowing you to listen to your music in high quality audio or  to speak to callers through the built-in DSP microphone.Ultra Portable DesignBeing  wireless means it's as portable as your phone. The strikingly  attractive, compact unique design fits snugly into a provided carry  pouch between uses.Dynamic SoundArmed with the  signature Bass Expansion System, the nifty speakers extend to amplify  dynamic audio range without compromising on acoustic integrity.Bluetooth ConnectionSatechi  BT easily pairs with iPhones, iPads, notebooks, and other  Bluetooth-enabled mobile devices. It streams music and handsfree  communication from the standard Bluetooth range of up to 33 feet away.Built-in Audio ConnectionConnect  most any audio device thanks to the built-in 3.5mm audio jack that is  always in reach. The audio cable neatly slips away underneath the  speaker when not in use.Series ConnectionConnect a row of Satechi BT Speakers to get jaw-dropping audio.USB ChargingWith  long-lasting lithium-ion rechargeable batteries built in, the Satechi  BT gives you plenty of playback time. When you do need a charge, grab  the included USB cable and connect to any USB charger or USB port on  your computer.What's in the BoxSatechi BT Speaker, Charging Cable, Carry Pouch, User Manual", "title": "Satechi BT Wireless Bluetooth Portable Speaker System for MP3 Players, iPhone, Android Phones, and iPad", "price": 44.99, "imUrl": "http://ecx.images-amazon.com/images/I/41J%2BL3YL6mL._SY300_.jpg", "brand": "Satechi", "related": {"also_bought": ["B004HHICKC", "B004C51HRY", "B0043WDNRI", "B008FSEA0K", "B00A80VVIC", "B002UXT3NU", "B000HOYA3M", "B00DR0PDNE", "B00A837TYO", "B007IOHPEA", "B00FJBY7CM", "B009TBF7IG", "B00FOUVRVW", "B00CJRZ31S"], "bought_together": ["B004HHICKC", "B004C51HRY"], "buy_after_viewing": ["B004HHICKC", "B00A80VVIC", "B00FJILVDS", "B004C51HRY"]}}