{"asin": "B000L7INLU", "description": "PNY's SD/SDHC family of cards makes a great solution for point-and-shoot digital cameras and digital camcorders.  With capacities available up to 32GB*, you'll have plenty of space to capture and store those special moments&hellip;whether family or friends, vacations, sporting events and more.Get the most out of your digital camera or camcorder with PNY SDHC Memory cards. Ideal for capturing video on digital camcorders.Store, transport and share all your favorite documents, photos, music, videos and more.PNY OPTIMA 4GB* Secure Digital&trade; High-Capacity Class 4 Memory Card (P-SDHC4G4-FS)Record video and images, download music and store images.Ideal for latest digital cameras and camcorders.Class 4 (minimum 4MB/sec write speed).  Also functions with Class 2 host devices.Lifetime warranty and free technical support.Typical ApplicationsCapture, store and share images, video, movies, music, etc. Ideal for capturing video on digital camcorders.Wide CompatibilityCompatible with most Advanced Point &amp; Shoot Cameras, Entry-Level Digital SLR Cameras, Digital Camcorders, and other SDHC-compatible devices.What&rsquo;s in the BoxSDHC Flash Memory Card, Protective Storage Case, Insert Card with Warranty Information and Operating Considerations and Precautions.* Please note: For Flash Media Devices, 1 megabyte = 1 million bytes; 1 gigabyte = 1 billion bytes. Actual usable capacity may vary. Some of the listed capacity is used for formatting and other functions, and thus is not available for data storage.** 1X = 150KB/second*** Number of photos may vary by camera setting and camera manufacturer.**** Actual number of songs may vary based on file format, compression settings, and song length.&dagger; Please verify that your device supports SDHC. SDHC cards are not compatible with standard SD host devices and card readers, and will only work on SDHC host devices. Check with your device manufacturer to see if the device supports SDHC.", "title": "PNY Optima 4GB SDHC Class 4 Flash Memory Card P-SDHC4G4-EF", "price": 14.95, "imUrl": "http://ecx.images-amazon.com/images/I/51rmVsD9DTL._SY300_.jpg", "related": {"also_bought": ["B00EXI73Q4", "B003ZHTNNU", "B003ZTZE5Y", "B000ZD0CV4", "B0015LCFYW", "B000MX48VM", "B000FGNM6I"], "bought_together": ["B000ZD0CV4"], "buy_after_viewing": ["B007JRB0TC", "B00200K1SY", "B002DS7NJI", "B0020ZDI5C"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Memory Cards", "SD & SDHC Cards"]]}