{"asin": "B000I4RMOU", "related": {"also_bought": ["B003LLEG00", "B004FVFJKG", "B0007NWLXO", "B004FVDUAW", "B0000ALPBP", "B005VAORH6", "B0001M4E72", "B005LKO230", "B004FV7MHE", "B000Z0YECU", "B00BW75AI2", "B000FK7C9C", "B00CXWNOI8", "B00IBL3MP0", "B000IZCUTQ", "B00006B7SG", "B006QNMZZ8", "B004UYPN18", "B005VAORJO", "B000ANOY7M", "B00C0NWBFC", "B0001V3AVY", "B0032HM6JG", "B00029RDGI", "B0074ZN27C", "B00D68ZVY8", "B006JH8T3S", "B00906E03I", "B008OTQ864", "B00007M1TZ", "B0036R9Z96", "B0000CEPC8", "B0082DCPQ4", "B00DXZKYTQ", "B001TH7GUU", "B00CYX54C0", "B005BZNDS0", "B004UQ40IS", "B003XIJ3MW", "B0013CED4I", "B00BFUFYZK", "B003VSCLMI", "B000A6V0JO", "B005BZNDOO", "B007B6YPAM", "B00DQ5NU76", "B003LVZO8S", "B004OAFO0I", "B009QBIZ60", "B002GHBUTK"], "bought_together": ["B003LLEG00"], "buy_after_viewing": ["B0007NWLXO", "B00007M1TZ", "B005VAORH6", "B003LLEG00"]}, "title": "Plantronics MX500i 3-in-1 Headset", "price": 28.54, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41SEAX9C44L._SY300_.jpg", "brand": "Plantronics", "categories": [["Electronics", "Accessories & Supplies", "Telephone Accessories", "Headsets"], ["Electronics", "Computers & Accessories", "Cables & Accessories", "Headsets & Microphones"]], "description": "From the Manufacturer Featuring hands-free versatility and professional-class performance, the MX500i 3-in-1 VoIP Headset lets you make Skype and other Internet calls through your computer, or make calls with your cordless phone or cell phone. Ideal for on-the-go home office professionals, the MX500i offers advanced sound technologies, such as WindSmart microphone technology for reduced wind and fast-motion noise, giving you the professional-class call clarity that your work demands.A next-generation Flex Grip design offers improved comfort and performance.View larger.Inline controls for easy volume adjustment and muting.Hands-Free Talk on Cordless Phones and Cell PhonesMaking it easier for the home-office professional to multi-task, the MX500i headset also works with your cordless phone, giving you the flexibility to move about your home office and take calls hands-free. And with its unique 3-in-1 design, the headset also allows you to talk hands-free on your cell simply by plugging it into your cell phone's 2.5 mm jack.The MX500i headset also has inline controls that allow you to easily mute the headset when necessary. Additionally, a microphone adjust switch lets you optimize speaking and listening volumes, so you'll have a clear conversation regardless of what model of cordless phone you're using.Professional-Class Clarity for Internet Calls, Web Conferencing, and MoreBy simply plugging the MX500i into your computer's USB port with the included USB adapter, you are ready to take full advantage of your computer's multi-media features. With this plug-n-play headset, you can make calls via Skype&trade;, Yahoo!&reg; Voice, Google&trade; Talk, or other VoIP services, and you can join in on Web conferences and calls. While VoIP calls have a reputation for lacking in clarity, the MX500i is designed with advanced sound technologies, allowing your calls to come through echo-free--so you can be confident that you come across clearly and professionally to your clients.WindSmart Technology for Outstanding Sound Quality AnywhereThanks to the headset's integrated WindSmart microphone technology, you don't need to worry about unwanted background noise from wind gusts or fast motion. WindSmart effectively blocks out wind noise for outstanding clarity even in the most challenging environments. So wherever you're working--at home, on the road, or even in the office--you and your caller will experience clear, professional sound quality.Ergonomic Design Provides All-Day ComfortThe MX500i is designed for all-day comfort, with an ultra-light single earpiece. The headset's under-the-ear Flex Grip&trade; design hugs your ear for greater comfort and improved performance, and thanks to the one-touch volume and mute buttons, you'll have complete control over your calls.The MX500i is backed by a one-year limited warranty.What's in the BoxMX500i headset with 2.5 mm phone plug, and a USB adapter.Inline volume and mute buttons make it easy to control calls."}