{"asin": "B000VG2KBU", "imUrl": "http://ecx.images-amazon.com/images/I/41n2EggxI6L._SY300_.jpg", "description": "Combining a mirrored surface and metal body, Transcend's T.sonic 840 is a real eye-catcher. This compact 4 GB MP3 player boasts a high-resolution, 1.8-inch color TFT-LCD screen, delivering great image quality for video and photo playback. The 3-phase wheel control and the intuitive graphic user interface make the player simple to use. Enjoy your entertainment on the go, and quickly access useful functions like a digital voice recorder, FM radio, FM recorder, real-time world clock displaying local and world times, and more.The Transcend T.sonic 840 is the perfect marriage of elegance and functionality.The player features a bright and colorful 1.8-inch TFT screen. (White model shown here.)Smooth metal backplate.3-way easy navigation wheel (2 GB white model pictured).Enjoy Your Music Anywhere, AnytimeThe T.sonic 840 provides 30 hours of nonstop music playback, and it supports MP3, WMA, and WAV formats, including WMA-DRM10 subscription music files.It also boasts a few features you don't find in many players--like the A-B repeat function (which allows you to continuously replay a designated section of a track), variable track playback speeds, and a sleep mode (which will power off the 840 after 15, 30, or 60 minutes). And naturally, you can dial in the EQ--the 840 features seven equalizer settings, including one customizable user setting.Take Your Entire Photo Library with YouT.sonic 840's high-resolution screen and slideshow screensaver is perfect for viewing your favorite pictures. Pull up JPG and BMP format images for sharing anytime.A Movie Theater in Your PocketTransfer full-length movies and video clips to the T.sonic 840 for convenient, portable viewing. Just use the included Transcend Media Converter software to convert to the \".mtv\" format, and you're good to go.Listen to Your Favorite Radio StationsT.sonic 840 is equipped with a crystal-clear recordable FM radio with 20 station presets. Pull up your favorite stations in a snap, and if you want to save it for later, just hit record--the 840 features FM recording.Read Novels Without Turning a Single PageLeave your books at home, and use the T.sonic 840 to read all of your favorite e-books or other text documents while on the go. The text feature also lets you display lyrics for karaoke-style fun.Create Memorable Voice RecordingsClass lectures, important meetings, or personal memos can be recorded at the touch of a button with T.sonic 840's digital voice recorder enhanced with voice-activity detection (VAD) technology for high-quality gapless recordings.Take Your Files with YouThe Hi-Speed Mini USB 2.0 port ensures easy computer connectivity and fast file transfers. An added plus is the ability to use the 840 as a USB flash drive for carrying/transferring files.What's in the BoxTranscend T Sonic 840 4 GB Video MP3 Player (Black), earphones, neck strap, USB cable, software CD, quick start guide, warranty card", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]], "title": "Transcend T.sonic 840 4 GB Video MP3 Player (Black)"}