{"asin": "B004BLIQEG", "categories": [["Electronics", "Computers & Accessories", "Data Storage", "USB Flash Drives"]], "description": "Award-Winning Design and Functionality in One. Designed by Arman Emami, and awarded 2010 &#34;Best of the Best&#34; product design recognition by Red Dot Online, the Verbatim Store &#39;n&#39; Go&#174; Clip-It USB drive combines the speed and simplicity of flash storage, with the usability of a paperclip. Available in a range of vibrant colors, the Clip-It USB drive is the perfect way to bundle digital images, audio or other large files with printed presentations or school papers &ndash; simply print your documents and use the Clip-It drive to secure them together.FeaturesInnovation- Unique USB drive combines speed of flash storage with the functionality of a paperclipDurable- Resistant to dust, water and static dischargesAward Winning&ndash; Recognized with Red Dot Online&#39;s 2010 &#34;Best of the Best&#34; product design awardColorful&ndash; The Clip-It USB drive is available in a variety of vibrant colors including: pink, blue, orange, green and blackUSB Interface&ndash; Compatible with all USB interfaces including USB 3.0, USB 2.0, and USB 1.1Operating System&ndash; Compatible with Windows 7, Vista, XP or 2000, Mac OS 9.x or higher, Linux kernel 2.6 or higherWarranty&ndash; Limited Lifetime Warranty. Verbatim manufactures our products to meet our strict quality standards. We stand behind the quality of our products &ndash; and our warranty proves it.What&#39;s the buzz?Users everywhere have fallen in love with Verbatim&#39;s award-winning Clip-It USB drives! Here&#39;s what they&#39;re saying:&#34;It&#39;s one of those ideas you wonder why no one came up with before.&#34;  - Geek.com&#34;Always losing your favorite USB flash drive deep in the recesses of your day bag or purse? Then check out the Store-N-Go Clip-It!&#34;  - Computershopper.com&#34;There&#39;s still room for innovation in the USB thumb drive market, as Verbatim just proved with its new Store &#39;n&#39; Go Clip-It USB drive.&#34;  - Maximum PCAbout VerbatimVerbatim provides technology you can trust &ndash; we&#39;ve done so for over 40 years. Our products include an impressive selection of removable storage and computer peripherals, featuring a wide variety of highly acclaimed CD, DVD and Blu-Ray&#174; media products. Verbatim also offers an array of lightning fast desktop and portable hard drives, USB flash drives, memory cards, stylish, feature-rich mice and keyboards and a broad range of replacement laser toner cartridges. Buy Verbatim and you get innovation, security and reliability &ndash; and that means peace of mind.", "title": "Verbatim Clip-IT 4 GB USB 2.0 Flash Drive, Pink 97549", "price": 9.0, "imUrl": "http://ecx.images-amazon.com/images/I/31RQCzzU4mL._SX300_.jpg", "brand": "Verbatim", "related": {"also_viewed": ["B001UHTDS2", "B007LLYAIO", "B001RCTA8I", "B004896ZE4", "B003DTLWHU", "B007LLYB1U", "B007LLYCV4", "B009FWMZ2K", "B0042NDSVE", "B0030M5NFC", "B0031YFK5C", "B007XAPI84", "B00E3PFDSM", "B00EAMO29Y", "B00FOLLANQ", "B00512P52K", "B007LLYC5A", "B00K57LP4I", "B00FOLLAR2", "B00C5R89FY", "B007LLYBVK", "B007LLYCKA", "B007LLYCGY", "B00IRUS6VK", "B00FOLLAFO", "B00E7MJRHE", "B00J0NXKZ0", "B007XAPLQI", "B00G9TZL7S", "B006SF6ANW", "B0030M5NFM", "B005FYNSPK", "B00512P5DE", "B00HFKN1F4", "B005GWQRWM", "B007OUIL1Y", "B00GWTHDIA", "B00GGD12NO", "B00DYQYJ3Q", "B006W8U2MU", "B006I04AIO", "B001BAW7P4", "B00512P5IO", "B007V9SNNY", "B00D422JBE", "B00B2Z8Z2M", "B00CIYFPEW", "B00GGD120W", "B0056TYSHG", "B009CMN3W4", "B00AP9QMHQ", "B00A35X42S", "B00EUVB09K", "B005CQBJXY", "B009PHHLDS"], "buy_after_viewing": ["B001UHTDS2", "B005GWQRWM", "B007LLYAIO", "B006W8U2MU"]}}