{"asin": "B001CTL5GQ", "description": "Life under a microscope fantasy world,Pikmindelivers a unique experience like few before it with a blend of real-time strategy, adventure, and puzzle elements. You control Captain Olimar, a lovable little astronaut, who crash-landed on a planet inhabited by even more lovable little plant creatures known asPikmin. Olimar can command these creatures RTS-style, assign them tasks, make them attack foes, and gather resources. The ultimate task is to rebuild Olimar's space ship before a 30-day time window elapses. Command lovable little creatures RTS-style Rebuild Olimar's space ship before a 30-day time window elapsesPikminView larger.Overcome predatorsView larger.Coordinate the Pikmin to help you get back homeView larger.The StoryStranded in a vast and strange world, Captain Olimar faces a daunting challenge. When he crash-landed on this alien planet, the pieces of his ship scattered far and wide, and it would be a near-impossible task to recover all of them by himself. Luckily, he has been able to befriend curious creatures he calls Pikmin. Only with their help &mdash; and your quick thinking &mdash; will he be able to collect all the pieces of his ship and finally make his way home.Key Game Features:Befriend the odd alien creatures known as Pikmin and seek their aid in your quest to return homeUse your Wii Remote to pluck up the Pikmin and put them to workCommand your own Pikmin army of up to 100 creatures at onceEnlist the help of multiple Pikmin to overcome predators, demolish barriers and haul critical ship partsCoordinate the actions of the Pikmin to help you collect the missing pieces of your shipFor 1 playerRedesigned for the Wii RemoteAction and strategy combine in fun and innovative ways in New Play Control! Pikmin. Point your Wii Remote at the screen to pluck the Pikmin and guide them in the tasks you assign them. Command up to 100 Pikmin at once to take on big jobs, including swarming predators, demolishing barriers and more, and coordinate the creatures' actions to help you find all the pieces of the ship before it's too late. They're small. They're plantlike. They're Pikmin! And they can be a space traveler's best friend! Stranded on an unknown planet, Captain Olimar must enlist the help of these native Pikmin. Together, they must rebuild Olimar's spaceship and defend themselves from attackers. Time is tight. Cooperation is key. This innovative action-strategy game is unlike any other game you've ever played, and with remastered Wii controls, it has never played better!", "price": 93.99, "imUrl": "http://ecx.images-amazon.com/images/I/51BUG6%2Bzv%2BL._SY300_.jpg", "related": {"also_bought": ["B0081716P2", "B001KN51K0", "B0019LU6VC", "B0050SWBAE", "B001KN51HI", "B001KN51J6", "B001KN51FU", "B001KN51GO", "B001TOMQWG", "B00KWF38AW", "0307897095", "B004AB6OSM", "B008GFZV6Y", "B001KN51IC", "B001KN51FA", "0761562168", "B00KWF366S", "B001KN51FK", "B001KN51GE", "B00KWFCUNS", "B00I5LMSE2", "B000P297ES", "B001KN51I2", "B002EE7OKE", "B0050SVGW8", "B00KWEHBAG", "B003ZCH7DI", "B00KX7672U", "B001KN51HS", "B00DC7O77A", "B00GSFY9SA", "B00DC7G2W8", "B0000A09EP", "B00JRJQMSO", "B001PP3Q3W", "B001JBFJQY", "B001KN51IM", "B00GRS40FA", "1930206399", "B001KN51IW", "B001PBDBNQ", "1616550414", "B00005Q8LR", "B00CQ7CIMS", "B0017WHQ34", "B000620PSY", "B00DC7G0GG", "B0002ILS1K", "B00D41GCVS", "B003ZHMMEM", "B001DC9PAK", "B0058CA4S8", "B001KN51G4", "B008AU4YEA", "B0053BCP40", "0804161380", "B002I0GF72", "B0050SVFB0", "B00K848IH0", "B00CHYOP94", "B005EIIBKY", "B002I0K3CK", "B00FLYZ7NU", "B000HE7KZC", "B009AFLXQQ", "B005EHQJ2C", "B0053BCMAC", "B001C58T46", "B00FLYZIM0", "B00149IL9I", "B002BSA388", "B00F9N08WI", "B001F66Z98", "B00CH923NE", "B001KN51GY", "B00JM3R6M6", "B00DC7G3Q8"], "bought_together": ["B0081716P2", "B0050SWBAE"], "buy_after_viewing": ["B0081716P2", "B00005Q8LY", "B00DC7G2W8", "B0050SWBAE"]}, "salesRank": {"Video Games": 3811}, "categories": [["Video Games", "Kids & Family", "Wii", "Games"], ["Video Games", "Wii", "Games"]]}