{"asin": "B000F31KLA", "categories": [["Electronics", "Camera & Photo", "Bags & Cases", "Camera Cases"]], "description": "The Adventure 9 is a modern backpack designed for the SLR photographer with a pro digital or film SLR (such as Canon's EOS 1D Series or Nikon's D2 Series) with a grip and 5-inch lens attached, several additional lenses, a flash, accessories, and a laptop. The completely foam-padded lower compartment protects photo equipment, while the large top compartment holds a light jacket, lunch, or other necessary items. Inside the top, a Pop-Off Pocket keeps AC adaptors and laptop cords organized. A separate, completely foam-padded compartment provides quick access to a laptop (such as Apple's PowerBook G4 or others up to 15.5-by-11-by-2-inches in size) without disturbing photo gear.Double zipper pulls provide quick access to photo gear while a weather flap and quick-release buckle provide security and weather protection. Inside the main compartment, foam pillars support the camera with lens attached, ready for action, while adjustable, foam-padded dividers protect other equipment. Tamrac's patented Memory and Battery Management System uses red flags to identify available memory cards and batteries from ones that are used up. A Windowpane-Mesh pocket organizes filters, cables, and other accessories.Two mesh side pockets provide quick access to accessories and water bottles. The comfortable, foam-padded backpack harness with sternum strap is contoured to distribute the weight of the camera gear across the shoulders. The harness also features Tamrac's Strap Accessory System attachment points for customizing this pack with optional Tamrac S.A.S. products. Two lash tabs on the bottom allow a tripod to be carried (requires accessory straps).Memory and Battery Management SystemMany of our camera bags feature the patented Memory and Battery Management System, which provides quick access to memory cards, batteries and accessories. This unique system uses red flags to identify available memory cards and batteries from ones that are used up.Strap Accessory System (S.A.S.)Tamrac's Strap Accessory System has components that attach to the shoulder straps of most of our camera bags and backpacks to allow photographers to personalize and customize their carrying systems.Windowpane-MeshA Tamrac innovation developed in the early eighties, Windowpane-Mesh combines clear vinyl and nylon mesh for film and accessory pockets.", "title": "Tamrac 5549 Adventure 9 Photo/Computer Backpack (Grey/Black)", "price": 230.95, "imUrl": "http://ecx.images-amazon.com/images/I/41cpC%2BwgdgL._SY300_.jpg", "brand": "Tamrac", "related": {"also_viewed": ["B001L5U16G", "B003D5TVAO", "B000EB7OTU", "B00148QQSC", "B004USLWVE", "B003D5MZRK", "B0015L8OSS", "B003D5MZUW", "B001L5U16Q", "B00148RMR6", "B00ISC17PE", "B000B9O83A", "B000XXBMCY", "B000EMXB4Q", "B002TF5VC6", "B002TF9YOC", "B00148VORK", "B00148QQLY", "B003BIFN9G", "B002TG3O06", "B004XNLR16", "B005O9YMM4", "B000WP3PH8", "B003BIFNE6", "B005MYAHJ8", "B000EY5R8C", "B0064X5QM4", "B0064X5R50", "B000YIWR8G", "B000XXDJY8", "B0045XUN3M", "B000WH86BQ", "B003D5TVA4", "B000A2LA70", "B000YIYQ30", "B00004X0ZO", "B000CBLYVG", "B009M3UULK", "B001APJZ50", "B008S94KQK", "B000MUK81E", "B000BAX50G", "B004TA6Y8O", "B002DW99H8", "B001OOGCV2", "B00AMXVKLI", "B00B9OGHM6", "B0064X5QLU", "B00148XH5M", "B005DD3MEK", "B002VKGTLQ", "B004XNLR48", "B001O2F6RA"], "bought_together": ["B0009PEUR0"], "buy_after_viewing": ["B0009PEUR0", "B001L5U16G", "B003D5TVAO", "B000YIYQ30"]}}