{"asin": "B000WMEEBC", "description": "Experience the Epic World of CivilizationSid Meier's Civilization&reg; Revolution&trade; is the latest offering in the legendary award winning Sid Meier's Civilization&reg; series of strategy games, featuring the famous &quot;just one more turn&quot; addictive gameplay that has made this one of the greatest game series of all time.Civilization Revolutiongives you the opportunity to experience the epic world-building of Civilization in a brand-new way. Designed from the ground up by the legendary Sid Meier and his team at Firaxis, you'll enjoy new graphics, gameplay and control that take full advantage of today's leading gaming platforms.Key FeaturesCHOOSE YOUR CIV- Choose from 16 Civilizations throughout history (from Africa to Germany to America to China) to lead to victory. Each time you defeat a rival civilization you'll add an exhibit to your Hall of Achievements paying homage to your great accomplishments. With so many Civs and Leaders to play, you'll have a new and exciting experience with every game.LEAD YOUR CIV- When you choose a Civ play as one of the world's most famous historical leaders (like Abe Lincoln, Otto von Bismarck, and Mao Tse Dong) and compete against the other leaders as you strive to create your own history in this epic game. Each leader will have 4 special abilities giving their Civ unique advantages throughout the ages.REAL-TIME INTERACTION- Leaders and advisors will actively communicate with you - even turning and pointing to things in the world as they speak - making the interactions more realistic and engaging than ever before.EXPLORE THE WORLD- Your quest to explore and discover will have you traversing the globe in search of long lost relics, rival civs, technologies, barbarians and much more.FAST-PACED ACTION- Accessible maps and streamlined time scale will deliver quicker games and constant action.INTENSE COMBAT- Triple your strength by combining up to three units into one powerful army and destroy your enemies. When your units win tough battles, they will become veterans and then elites. You can then choose from a list of powerful upgrades that will give elite units even more strength to dominate in war. Your Army will wear a distinct uniform representing your Civilization, so you will easily see them on the screen as you lead them into battle.The LegacyHall of Fame Game designer, Sid Meier, has been called &quot;The Father of Computer Gaming&quot; with such early hits as F-15 Stealth Fighter, Railroad Tycoon, and Pirates. He put computer gaming on the map however, in 1991, when he delivered Sid Meier's Civilization&reg; to the gaming world launching the &quot;God Game&quot; genre and creating one of the most award winning and addicting games on the planet. Civilization remains one of the world's top selling PC game series with over 8 million units sold and is recognized by the press as one of the greatest game franchises ever created.In Civilization, players strive to become Ruler of the World by establishing and leading a civilization from the dawn of man into the space age waging war, conducting diplomacy, discovering technologies, going head-to-head with some of history's greatest leaders, and building the most powerful empire the world has ever known.Sid Meier's Civilization&reg; Revolution&trade; is the latest offering in the legendary award winning Sid Meier's Civilization&reg; series of strategy games, featuring the famous &quot;just one more turn&quot; addictive gameplay that has made this one of the greatest game series of all time. Civilization Revolution has been designed and built (by the legendary Sid Meier and his team at Firaxis) from the ground up for console and handheld systems delivering graphics, gameplay and controls that take full advantage of the hugely popular gaming platforms. Civilization Revolution is a watershed game offering players a chance to experience the epic empire building world of Civilization in a whole new way - in an accessible, visually immersive, fast paced, action-packed world that gamers crave.Lead Your CivilizationView ImageDiscover New Technologies!View Image", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/61JKH5X1fPL._SY300_.jpg", "related": {"also_bought": ["B0020KZZHG", "B005FYK2HW", "B008E6ZXMM", "B001IX4CMU", "B00IBC6NE6", "B00109KMQ2", "B00C3MKA30", "B003KMCHTC", "B006Y76HXM", "B0035FYXSC", "B000HCJ6QU", "0744010144", "B00JQHU9RC", "B00FNNQRII", "B0057PERIY", "B0028A6UUY", "B000PS4XB4", "B008CP6RWU", "B003O6E3C8", "B0016C3260", "B00JUFT3I6", "B006VB2UNC", "B005185SDA", "B0042QY4UU", "B0088MVOUC", "B00A750QIE", "B0015AARJI", "B000WJFZEA", "B000HXDKA2", "B0058VI2LA", "B007A7UJ4S", "B0081B1O5A", "B0047TLIBU", "B007XYBUBE", "B0054IUWSI", "B008CP6RUW", "B00BXTKJ94", "B009DL2TBA", "B001AZFSE2", "B004I19MGA", "B0050SX00Y", "B00BKF5IXS", "B002I0J4AM", "B00AEX81SG", "B004RIACMW", "B0051TLAZ4", "B009GZX49Y", "B001SGZL2W", "B00AY1CT3G", "B000N4MSAS", "B00HWMP0TU", "B006ZPAYD2", "B005VKRGXI", "B003O680RM", "B00G9DFMDW", "B00CMC6HCY", "B008CP6Q6M", "B00F9MZSVA", "B002I0J8KS", "B000K1CS5Y", "B004UDB9SA", "B0088I7L76"], "bought_together": ["B0020KZZHG", "B005FYK2HW"], "buy_after_viewing": ["B003KMCHTC", "B0020KZZHG", "B00FNNQRII", "B005FYK2HW"]}, "salesRank": {"Video Games": 1338}, "categories": [["Video Games", "Kids & Family", "PlayStation 3", "Games"], ["Video Games", "PlayStation 3", "Games"]]}