{"asin": "B000JNYWBG", "description": ".caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } .caption2 { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; }The iPod touch features Apple's revolutionary multi-touch user interface that enables you to find and enjoy all of your music, videos, and more on its gorgeous widescreen display with just the touch of a finger. First introduced on iPhone, the multi-touch interface uses pioneering new software to present the perfect user interface for each application.Glide through albums with the iPod touch's amazing Cover Flow technology. ViewiPod touch dimensions.Browse the Web with the included Safari browser. Or fire up a YouTube video and enjoy the show.The iPod touch responds to your movements; turn it sideways and your video is presented in widescreen mode.Incredibly thin at just 8 millimeters.The iPod touch also includes Wi-Fi wireless networking, the first on any iPod, and three amazing applications that use it: Safari, the most advanced browser on any mobile device, lets you wirelessly view web pages just as they look on your computer, and features Google Search or Yahoo! oneSearch; Apple's YouTube application lets users wirelessly watch over 10 million free videos from the Internet's most popular video website; and the new iTunes Wi-Fi Music Store lets you wirelessly browse, preview and buy songs and albums from the most popular online music store in the world. And to top it all off, the iPod touch is an unbelievable eight millimeters thin.MusicIf a picture says a thousand words, think of what all the album art in your collection might say. With Cover Flow on iPod touch, you can flick through your music to find the album you want to hear. And when you do, a quick tap of the cover flips it over to display a track list. Another tap starts the music.VideoThe 3.5-inch display gives you video like nothing you've seen before on a portable device. Watch your favorite movie. Catch up on television shows, anywhere. Enjoy video podcasts. Play music videos. All using multi-touch technology that lets you bring up onscreen controls and go widescreen (or back to full screen) with a tap.PhotosiPod touch holds up to 20,000 photos you sync via iTunes. Flick to scroll through thumbnails. Tap to view full screen. Rotate for landscape format. Or perform some sleight of hand by opening two fingers to zoom in. You can even play slideshows, complete with music and transitions. Set any photo as your wallpaper to personalize your iPod touch...with a touch.SafariWith Apple's Safari browser built in, iPod touch is the only iPod that gives you wireless access to the web, everywhere you go. See websites the way they were designed to be seen. Sync your bookmarks or add a few as you go. Search the web using the touchscreen keyboard. Zoom in and out by tapping the multi-touch display.YouTubeGot a bit of a YouTube addiction? iPod touch feeds it from anywhere with a special YouTube player built right in. Watch featured videos, check out the most viewed, search for something specific, then bookmark your favorites for future reference. It's all the fun of YouTube--pocket-size.iTunes Wi-Fi Music StoreWith iPod touch, you can discover new music anywhere. Built-in wireless capability gives you access to the iTunes Wi-Fi Music Store, where you can buy songs with a tap. Browse New Releases, What's Hot, and Just Added lists. Or find exactly what you're looking for with a quick search. Tap a song to preview it or tap Buy to purchase it. From anywhere.Starbucks MusicYou walk into a Starbucks. Order your latte. While you wait, you hear a song wafting from the loudspeakers. You love it. So you get out your iPod touch and buy it over Wi-Fi. Just like that. The iTunes Wi-Fi Music Store on iPod touch tells you what's playing in select Starbucks and lets you buy it along with other featured Starbucks content. So you can sip, shop, and listen.Read Kindle Books on the iPod touchRead Kindle books on your iPod touch.230,000 books, including more than 109 of 112New York Times&reg;Bestsellers.Buy a book on your PC or Mac and get it auto-delivered wirelessly to your iPod touch.No Kindle required.AllNew York Times&reg;Bestsellers and new releases are $9.99, unless marked otherwise.Free book samples--read the first chapter for free before you decide to buy.Books you purchase also can be read on a Kindle.If you own a Kindle, Amazon automatically synchronizes your last page read between devices with Whispersync.Adjust the text size, add bookmarks, and view the annotations you created on your Kindle.&gt;Learn moreabout the Kindle for iPod touch application.Multi-touchiPod touch features the same revolutionary interface as iPhone. Built to take full advantage of the large 3.5-inch display, the multi-touch interface lets you control everything using only your fingers. So you can glide through albums with Cover Flow, flick through photos and enlarge them with a pinch, or zoom in and out on a section of a web page. And iPod touch features a touchscreen QWERTY keyboard perfect for browsing the web in Safari, searching for videos on YouTube, finding music on the iTunes Wi-Fi Music Store, entering calendar events, or adding new contacts.Ambient Light SensorThe iPod touch display has an ambient light sensor that automatically adjusts brightness to suit the ambient light in your surroundings. The result? A better experience for you and battery-saving efficiency for iPod touch.AccelerometerAn accelerometer detects when you rotate iPod touch from portrait to landscape, then automatically changes the contents of the display, so you immediately see the entire width of a web page, your music in Cover Flow, or a photo in its proper aspect ratio.", "title": "Apple iPod touch 16 GB (1st Generation)  (Discontinued by Manufacturer)", "price": 203.49, "imUrl": "http://ecx.images-amazon.com/images/I/41R91ByZg9L._SX300_.jpg", "related": {"also_viewed": ["B001FA1NZK", "B001FA1NZU", "B0012JCZYM", "B0012JCYPC", "B001FA1O0E", "B0012JNQYK", "B002M3SOBU", "B0020OYUL4", "B002M3SOCE", "B002M3SOC4", "B001FA1O18", "B001FA1O0O", "B000A3WS8O", "B0097BEFI6", "B0097BEFEU", "B005GS3C2O", "B002657EUG", "B005VJQTAA", "B0097BEF0O", "B000JO7T7E", "B000A3WS84", "B005GS3CFG", "B0002OZXHO", "B0097BEDOC", "B0012S7GRY", "B001FA1O1S", "B005GS3C9C", "B0002OZXGU", "B005JR9W26", "B000EPHR0C", "B000EPHPPE", "B0097BEFJK", "B000EPHP4U", "B0097BEDTC", "B0002ZAEYK", "B000A3WS16", "B000JO1MU4", "B000EPNDEG", "B0097BEE9Q", "B0013GJIBC", "B0097BEFA4", "B001F7AHXW", "B0097BEDRY", "B0097BEF7M", "B0097BEDPG", "B004J359ZK", "B00474ORI6", "B000EP4TWQ"], "buy_after_viewing": ["B002M3SOC4", "B001FA1NZK", "B0097BEFI6", "B001FA1NZU"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}