{"asin": "B0007QKMQY", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]], "description": "For an uncompromising mix of ease of use, affordability and outstanding features, look no further than the Canon Digital Rebel XT. Featuring an 8.0 Megapixel CMOS sensor, Canon's DIGIC II Image Processor, and compatibility with over 50 EF Lenses, this digital SLR offers outstanding performance for both the serious photographer and the weekend photographer who just wants to take great pictures.All controls and displays are right where you need them.The camera is compatible with over 50 EF lenses.View larger.CompactFlash card slot.Easy-to-navigate menus.For starters, the Rebel XT delivers 3,456 x 2,304-pixel images for images of 13x19 inches and larger. The camera features variable ISO -- 100, 200, 400, 800 and 1,600 settings -- and supports all Canon EOS series lenses. An optical viewfinder provides detailed information such as diopter adjustment and depth-of-field preview, while the 1.8-inch TFT LCD view finder offers a wealth of additional information as well as several playback features, including thumbnail view and zooming to 10x magnification. Backlit with five level settings for brightness, the viewfinder is easy to read in dark environments.While the Rebel XT is compatible with all Canon lenses in the EF lineup -- ranging from ultra-wide-angle to super-telephoto lenses --, the camera includes the Canon EF-S 18-55mm f/3.5-5.6 lens. This 18-55mm is a standard zoom designed exclusively for the Digital Rebel and features optimized coating to minimize ghost images and flare.If action photography is your specialty, the Rebel XT offers a continuous shooting mode that captures as many as 14 images as fast as three frames per second (with shutter speeds of 1/250 second or faster.) The camera offers a shutter speed range from 1/4,000 to 30 seconds, and a bulb x-sync at 1/200 seconds. Best of all, it features an ultra-fast 0.2 seconds startup time, a shutter release lag of 100 milliseconds, and viewfinder blackout time of 175 milliseconds -- all of which means that you'll always be on top of the action.Despite its wealth of advanced features, the Rebel XT is also one of the easiest, and most user-friendly digital SLRs you'll find anywhere. Its compact design -- 4.98 x 3.71 x 2.63 inches (W x H x D) -- and weight (less than two pounds) means that the camera body will fit snugly in your hands. The EOS Digital Rebel XT has a newly developed high-precision seven-point autofocus (AF) system for speedy and accurate focusing in any situation. You can easily choose your own point of focus or direct the camera to choose it automatically. You can even use predictive AF to ensure that moving subjects stay focused while you compose your shot. With a built-in dioptric adjustment mechanism and a new precision matte screen, achieving sharp focus is fast and easy with the Rebel XT, no matter where or when you're taking pictures.A number of additional automatic setting and shooting modes -- including Portrait, Landscape, Close-up, Sports, Night Portrait, and Flash Off -- allows you to concentrate on your subject and leave the camera to sort out the details. A redeye reduction via a built-in illuminator keeps your face shots on track, and USB 2.0 connectivity for both PC and Macintosh lets you upload your images with ease and without the need for additional software. The camera also supports direct printing with PictBridge compatible printers. In short, the Rebel XT is the ideal digital SLR choice for both the serious photographer who demands the ultimate in high-quality features, as well as the weekend picture taker who demands the ultimate in affordability and convenience.", "title": "Canon Rebel XT DSLR Camera with EF-S 18-55mm f/3.5-5.6 Lens (Silver) (OLD MODEL)", "price": 499.0, "salesRank": {"Camera &amp; Photo": 4758}, "imUrl": "http://ecx.images-amazon.com/images/I/51G31QKNJFL._SY300_.jpg", "related": {"also_bought": ["B000W05O5O", "B00B5KCRZK", "1598633376", "B00194VYQK", "B003HMTCM0", "B001NXDB4A", "B00065ANYW", "B000BO3CW8", "B00189JVCA", "1934148024", "B002POMXZY", "B000T9251O", "B00001QEMF", "B002A1MLV8", "B001FO4QHI", "B00004THD0", "B00CF5OHZ2", "B003Y60DZO", "B000W0BC7I", "B001NS0OZ4", "B002WE4H8I", "B00004WCGF", "B002ZIULPY", "B00301RMXE", "B003CKC8W8", "B0001CNMFM", "B00004THCZ", "B0002Y5WZM", "B004ZGN6MY"], "buy_after_viewing": ["B003VNKNF0", "B00EFILPHA", "B0039BPG1A", "B000W05O5O"]}}