{"asin": "B0032JRRXO", "related": {"also_viewed": ["B0075SUITS", "B0075T7NW2", "B0075SUIEI", "B004HW73QG", "B0075SUIOS", "B0032JRRYI", "B0032JRRWK", "B005I6DVC0", "B0075SUIZW", "B00AWYMXZY", "B001SER492", "B004J3YCGM", "B003ZSHNG8", "B001SER4BK", "B001SER46K", "B00908BQCY", "B0075SUK14", "B004HW73O8", "B0035FZJKI", "B00B5HE2UG", "B004HW73S4", "B000NK3NBA", "B00I58LX0A", "B00BW6LTG0", "B004HW73QQ", "B0032JRRX4", "B0075SUHQC", "B00B7N9BRW", "B001SER4BU", "B0011ZCDKS", "B0035FZJJ4", "B00CBYMWNQ", "B001SER4C4", "B001SER47Y", "B0075SUII4", "B000NK6J6Q", "B0075SUHGC", "B004J3V8UU", "B0041RSPRS", "B0075SUH5S", "B004HW73TI", "B000V1VG4W", "B00I58LVKC", "B006UMM1AY", "B004HW7KC8", "B00328HR44", "B005MTME3U", "B001SER4CO", "B0032JRRY8", "B004HW73R0", "B0090SLJ1C", "B00ECGX9NS", "B002LITT3S", "B0075SUG3Q", "B009B0MYSQ", "B00AWYN0BU"], "bought_together": ["B000JMJWV2"], "buy_after_viewing": ["B003VNKNEQ", "B00AWYMXZY", "B0075SUITS", "B0075T7NW2"]}, "title": "Canon PowerShot A490 10.0 MP Digital Camera with 3.3x Optical Zoom and 2.5-Inch LCD", "price": 179.99, "salesRank": {"Camera &amp; Photo": 4370}, "imUrl": "http://ecx.images-amazon.com/images/I/41WdvOcokiL._SX300_.jpg", "brand": "Canon", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "With its streamlined silhouette and smoothly curved edges, the Canon PowerShot A490 has the compact sophistication and relaxed simplicity that make it a natural for beginners and everyone else who craves style and convenience. 10.0-megapixel resolution and 3.3x optical zoom make it easy to capture the action in dazzling color and brilliant detail. The DIGIC III Image Processor keeps it all looking sharp. A bright, bold 2.5-inch LCD makes shooting and playback a genuine pleasure.10-megapixel resolutionCanon PowerShot A490 HighlightsEasy to use, powerful A-Series camera has 10.0 megapixels and 3.3x optical zoomWith the PowerShot A490, dramatic, personal pictures have never been easier to shoot and share. This 10.0-megapixel camera lets you create impressive large photos of family and friends you'll be proud to display. The high-resolution images taken by the PowerShot A490 can be enlarged up to 13 x 19 inches.The PowerShot A490 also has a 3.3x Optical Zoom lens (35mm film equivalent 37-122mm) that let you capture up-close and memorable images.Low Light mode and Smart Flash Exposure technologyWith an ISO of 400-3200, the Low Light mode takes the Canon PowerShot A490 where no A-Series has gone before--into the shadows! Now even scenes notorious for having insufficient light, such as those lit by candles, fire, or street lamp, come through in fantastic color and clarity, with less noise. You can keep the feel of the scene intact without adding additional light, so the result will be scenes with the visual accuracy, depth and clarity you expect from a Canon camera.Low Light mode in actionSmart AUTO will do the work for you by intelligently selecting the proper settings for the cameraJust set the Canon PowerShot A490 to Smart AUTO and you're ready for maximum enjoyment from your picture-taking every time. It's a relaxing and satisfying way to shoot because you can completely concentrate on your subject knowing that the camera has the technical details covered. Advanced Canon technology intelligently analyzes your situation and shooting conditions. Then it automatically selects an appropriate setting from 13 specially defined settings. So whether you're photographing flowers, a captivating sunset, or your friends at the park, you can be confident that you're getting dramatic, memorable images.Smart Flash exposureSmart Flash Exposure is a technology that can produce excellent flash exposures across a wide range of conditions, and helps ensure against over- or under-exposed images. The detail and color of your photo remain intact and truer to life even in challenging lighting.Large, clear 2.5-inch LCDThe PowerShot A490's 2.5-inch LCD screen gives you the big picture, whether you're shooting, reviewing or showing off your images. This high-resolution screen offers a crisp, clear and bright picture. It also features Night Display for easy viewing in low light.AA battery power enables you to easily power up on the goConveniently, you don't need to worry about running out or recharging of batteries. Since AA-size batteries can be purchased at any store, simply get new ones locally."}