{"asin": "B000R99GJ0", "description": "Whisper quiet, and about the size of a shoebox, the NETGEAR RND4450 ReadyNAS NV+ 2TB Gigabit Desktop Network Storage device offers homes and small businesses an easy-to-configure and cost-effective way to store your data and serve your digital media. With its several advanced server features, you will have true peace of mind knowing that your irreplaceable data is safe and secure..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } .headline { font-size: 15px; font-weight: bold; } ul.indent { list-style: inside disc; text-indent: -15px; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; } #callout { width: 300px; height: 185px; background: #FFFFFF; border-right: 1px dotted; border-left: 1px dotted; border-bottom: 1px dotted; border-color: #CCCCCC; } #callout-header { width: 100%; height: 35px; font-family: Verdana, Helvetica neue, Arial, serif; font-weight: bold; font-size: 11px; background: #CCCCCC; color: #000000; text-align: center; border-bottom: 1px solid; border-top: 1px solid; padding-top: 2px; } #callout-content { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; text-align: left; line-height: 1.5em; padding: 5px; }The ReadyNAS NV+ offers an easy-to-configure and cost-effective way to store your data and stream your digital media.View larger.Use the ReadyNAS+ to stream music and video, share network printers, and share files across multiple platforms.The NETGEAR ReadyNAS NV+:Store and protect up to 4 terabytes of dataServe files easily across Windows, Mac and Linux platformsBack-up data automaticallyStream music and video across multiple devicesShare network printersNot much bigger than a shoebox, the NETGEAR ReadyNAS NV+ 2 TB Gigabit Desktop Network Storage device is compact, but powerful.True Protection for your DataChances are that you've got a huge portion--if not all--of your business data or personal life digitized. Your kids' birthday videos, photos, important tax records, customer files, music--it's all digital. Until recently an external hard drive has done the job. But your storage solution is near capacity, and you now realize that it won't be long before your 24/7 usage burns it out. And when that happens, you will either have to kiss everything you've ever created good-bye, or pay a pretty penny trying to retrieve it all.The NETGEAR ReadyNAS NV+ is an ultra-compact box filled with four 500 gigabyte disks, designed to fit easily on your desktop. NETGEAR also offers the Ready NAS NV+ in theReadyNAS 2x500GB Drives (2 Open Bays),ReadyNAS 4x250GB Drives, and several other configurations. Once connected to your network, you can store and protect all of your digital data and stream your digital media. What truly causes heads to turn with the ReadyNAS NV+ is its RAID functionality, along with its own X-RAID technology. Combined, these two features that are normally found only in high-end servers will ensure that your data will never be corrupted or lost due to hardware failure.The device's RAID functionality, or Redundant Array of Independent Disks, copies, splits and shares your data across the hard disks within the device, so that should one of the drives fail, the data can be rebuilt with the remaining drives. Without RAID, once a failure occurs, you risk losing all of the data stored on the drive. ReadyNAS's patent pending X-RAID technology automates the volume expansion as you scale up to four disks. (The ReadyNAS NV+ includes four 500 GB hard drives.) In short, X-RAID automatically manages the RAID details for you, so you don't have to spend the hours that it normally takes to format the disks. Simply put, you won't find a simpler or more secure way to protect and store your data.Data Back-up, Monitoring and File ServingWith the ReadyNAS NV+, the days of storing your digital files across several computers or storage devices are over. This device is scalable to up to four terabytes of data, which means that you can bring all of your data together for fast and easy access and file serving to multiple clients simultaneously. And as any small business knows, having a sound backup strategy is essential. With the help of ReadyNAS NV's EMC Retrospect backup and recovery software, you can set automatic backups of all of your network clients to your ReadyNAS. Additionally, the device includes an integrated backup manager that enables one-button backup to an external USB HDD for offsite rotation, or to remote servers for even greater security.If something should go wrong with one of your disks or if performance has been compromised, the ReadyNAS NV+ offers advanced-server monitoring features that alert you via email when something is amiss. The device will also shut itself down if the operating temperatures of the disks are too high.Media StreamingBut don't think that the ReadyNAS NV+ doesn't know how to have fun. If video or other media is your business or passion, you can use your ReadyNAS for streaming to multiple devices at the same time without the need to keep your desktop computers running. The ReadyNAS includes built-in media servers, including Slimserver and iTunes, that will let you stream audio and video to devices on your network.Easy Set-up and Other FeaturesWith an easy-to-use Web browser interface and setup wizard, ReadyNAS can be configured quickly. Simply plug the device into your network, power up, and you'll be ready to go.The ReadyNAS NV+ also includes three USB ports, which can be used to connect a USB printer, a back-up power supply, external drives and more. The device measures 7.9 x 5.2 x 8.7 inches (HxWxD), and weighs 10 pounds without the disks. The ReadyNAS NV+ includes a five-year warranty.What's in the BoxReadyNAS NV+ 4 hard disk trays (each with 500 GB HDD), getting started guide,  warranty card, power cable, Ethernet cable, ReadyNAS Installation CD (ReadyNAS Discovery Utility, 5-Client EMC Retrospect Professional for Windows, 5 Client EMC Retrospect Desktop for Macintosh), and 16 screws for future HDD installation.", "title": "NETGEAR ReadyNAS NV+ 4-Bay 2TB (4 x 500GB)", "price": 98.95, "imUrl": "http://ecx.images-amazon.com/images/I/51S7be-AmPL._SY300_.jpg", "related": {"also_viewed": ["B00BNI4CVG", "B006427IY4", "B00BNI4A90", "B00BO0MG02", "B00BNI4DR4", "B00BNI4D9W", "B006HTAB7K", "B00BNI4BSK", "B00BNI4EL4", "B004UBU3SY", "B00I2P57TO", "B00BNI4CAM", "B00BNI4BE4", "B00DW1VJVI", "B000W3X480", "B00BO0MFXU", "B00B5Q7B78", "B00BNI4AWM", "B00AGI7I2O", "B00G4JZ2WC", "B008DWAGPG", "B00G9X5NFO", "B00I2P82CS", "B003X26VV4", "B00G4JZ2T0", "B00I2P53NY", "B00G4JZ42A", "B00DW1UNS8", "B00EHBERSE", "B0064XAJ5I", "B0064XAIZY", "B0013G04AQ", "B00K6PCTCG", "B001MVIH24", "B00BO0MFYO", "B0010SQBBS", "B002UUPWP6", "B007JLDTRY", "B008U69LC4", "B001W6Q6FY", "B003YFHEAC", "B008JJLW4M", "B008JJLZ7G", "B00CO0DE0W", "B008JJLXO6", "B00CRB9CK4", "B0085RO8U8", "B00B5Q79EI", "B00CO0DDZS", "B00BO0MFYY", "B00FY6RW2Y", "B00439GMJ2", "B00D1GYNU8", "B00ITI054G", "B0047FL85U", "B00G4CIPHS", "B004L87XAC"], "buy_after_viewing": ["B008JJLZ7G", "B000W3X480"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "Network Attached Storage"]]}