{"asin": "B002VBWIP6", "description": "With an Xbox LIVE Gold membership, take your Xbox 360 online to play Kinect and controller games with friends wherever they are. Instantly watch HD movies, TV shows and sports, and with Kinect, your voice is the remote control. Not sure what to play or watch? Quickly find new movies, songs or games with your voice. Even use your phone or tablet as a second screen to control and interact with what you&rsquo;re watching. Plus, now you can explore the web on your TV with Internet Explorer for Xbox.* Entertainment is more amazing with Xbox.Why to BuyPlay Kinect and controller games online with friendsWatch HD programs from Netflix, Hulu Plus, ESPN, and moreUse your voice to easily find movies, TV shows, music and games on Xbox 360 with KinectUse your phone or tablet as a second screen for an enhanced game and entertainment experience* Broadband internet, additional fees and/or requirements apply for some Xbox LIVE features. Not all features and content on Xbox LIVE is Kinect voice and gesture enabled. Second screen control requires compatible devices enabled with Xbox SmartGlass and is only available with select Xbox LIVE content. Xbox SmartGlass and Internet Explorer for Xbox are coming Holiday 2012. See xbox.com/live.&nbsp;Xbox LIVE Code RedemptionNOT AN XBOX LIVE MEMBER YET?Follow these steps first before redeeming your code:Connect your Xbox 360 to a broadband Internet connection.Press the silver/green Xbox Guide Button on the controller.Select Create Profile &amp; follow instructions to create profile name &amp; avatar.Select Join Xbox LIVE &amp; follow instructions to setup yourXbox LIVE account.TO REDEEM GOLD MEMBERSHIP CODE:Sign in to your Xbox LIVE account.Press the silver/green Xbox Guide Button on the controller.Navigate to Games &amp; Apps tab.Select Redeem Code &amp; enter code.Codes can also be redeemed at xbox.com/live.&nbsp;What is Xbox LIVE?Your entertainment. Your way. Get your favorite games, music, movies and more on your TV, tablet and phone.Use your voice to easily find movies, TV shows, music and games on Xbox 360 with KinectPlay Kinect and controller games online with friendsWatch HD programs from Netflix, HuluPlus, ESPN, and moreUse your phone or tablet as a second screen for an enhanced game and entertainment experienceExplore the web on your TV with Internet Explorer for XboxUse Microsoft Points to buy or rent TV shows, movies, and gamesDownload new songs, workouts, levels and maps to keep your games fresh&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Games&nbsp;Entertainment&nbsp;Kinect&nbsp;&nbsp;&nbsp;&nbsp;Xbox LIVE is where your friends are playing Call of Duty, Halo, and other online multiplayer games1. With your voice you can quickly find things to watch and play. Even use your phone and tablet to add an extra layer of control for an enhanced experience with your console games. Plus, explore the web easily with Internet Explorer for Xbox on your biggest screen.&nbsp;Xbox brings you great entertainment no matter where you are. Play games online with friends on your TV, tablet or phone. Even enjoy music, TV shows and movies on any of your devices2. And when you&rsquo;re at home with Kinect, just say what you want to watch and Xbox finds it. Entertainment is more amazing with Xbox.&nbsp;With Kinect for Xbox 360, you are the controller. Enjoy HD movies, TV, music and sports and control it all with the sound of your voice. Or choose from tons of great Kinect games and experience the fun of getting your whole body in the action1. Games and entertainment is more amazing with Xbox.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;SmartGlass&nbsp;Windows 8&nbsp;Internet Explorer&nbsp;&nbsp;&nbsp;&nbsp;Xbox SmartGlass lets you use your phone or tablet as a second screen with your Xbox 360 for an enhanced game and entertainment experience2. Control and interact with your favorite TV shows, movies, music, sports and games. Even start watching on your tablet and flick it to your TV to keep watching on the big-screen. With Xbox SmartGlass, your devices intelligently work together to show rich interactive activities and new content related to what you&rsquo;re watching or playing on TV at the moment. The Xbox SmartGlass app will be available on Windows 8, Windows Phone, and the innovative Xbox SmartGlass technology will be available on other major platforms in the My Xbox LIVE app.&nbsp;Xbox is the new way to get great entertainment on Windows 8. Enjoy the latest movies, TV shows, and music on your PC or tablet. You also get access to great games for every style &mdash; from the latest hits to your favorite classics. Plus, you can use your tablet as a second screen with your Xbox 360 for an enhanced experience with what you&rsquo;re watching or playing2. Even start a show on your tablet and flick it to your TV. Entertainment is more amazing with Xbox.&nbsp;Explore the web on your TV with Internet Explorer for Xbox1. And with Kinect, use your voice to explore your favorite sites with ease on the biggest screen in the house. Even use your phone or tablet to type and control your experience. Discover the entertainment you love with Xbox.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Xbox Video&nbsp;Xbox Music&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Xbox Video brings you the latest HD movies and TV shows on your TV, tablet, PC or phone. Rent or buy new blockbuster movies and classic favorites, or stay up with last night&rsquo;s episodes of your favorite TV shows3. And with Xbox Video you get instant on HD to start watching right away. Plus, the video you buy can be enjoyed wherever you want. Start watching on your Xbox 360, and pick-up where you left off on your tablet. Even download it and take it with you on your Windows Phone at no extra cost. Xbox makes it easy to watch what you love wherever you are.&nbsp;Xbox Music brings you all the music you love, every way you want it. With millions of songs to discover, stream, download and own&mdash;it&rsquo;s the all-in-one music service for your tablet, PC, TV and phone4. Select an artist, and SmartDJ instantly creates a playlist tailored to you. And with Xbox Music Pass, your favorite songs follow you wherever you go, across all your devices, including unlimited downloads. Because music is more amazing when it&rsquo;s all brought together for you.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1Xbox LIVE Gold membership, fees and/or requirements apply for some Xbox LIVE features. Not all Xbox LIVE content is Kinect enabled. Games, add-ons and media content sold separately. Internet Explorer on Xbox coming Holiday 2012. See xbox.com/live.2Coming Holiday 2012. Compatible devices required. Broadband internet, additional fees and/or requirements apply for some Xbox LIVE features. Not all features and content on Xbox LIVE is Kinect voice and gesture enabled. Second screen control requires compatible devices enabled with Xbox SmartGlass and is only available with select Xbox LIVE content. See xbox.com/live.3Coming Holiday 2012. Broadband internet and compatible devices required. To watch on Windows Phone, sync content from compatible PC. See xbox.com/live.4Coming Holiday 2012. Compatible devices and internet required; carrier fees apply. On TV, Xbox Music Pass allows for streaming only and requires an Xbox 360 console and Xbox LIVE Gold subscription (both sold separately). Limited hours of free streaming after 6 months; unlimited with paid subscription. Available Xbox Music features and content may vary over time. See xbox.com/music.", "price": 59.9, "imUrl": "http://ecx.images-amazon.com/images/I/415TMngowzL._SY300_.jpg", "related": {"also_bought": ["B00F4CEHNK", "B00F4CEWOY", "B00F4CFAV8", "B00F4CEOS8", "B00F4CF39C", "B00F4CF4PU", "B00F4CFBUS", "B00F4CFHFC", "B00F4CFCXO", "B00F4CF7L6", "B004VSTQ2A", "B004RMK5QG", "B004RMK4P8", "B004RMK4BC", "B00GAC1D2G", "B00K59HKIQ", "B00K59HHHU", "B00G05QHC4", "B004RMK57U", "B00H89IBFM", "B007Z3RN2I", "B008BKEWMI", "B008BKF2FO", "B007QPEDQY", "B00KBDH8KG"], "buy_after_viewing": ["B00F4CEHNK", "B00F4CEOS8", "B00F4CFHFC"]}, "salesRank": {"Video Games": 17}, "categories": [["Gift Cards", "Gift Cards"], ["Video Games", "Xbox 360", "Accessories", "Networking"], ["Video Games", "Xbox 360", "Games"], ["Video Games", "Xbox 360", "LIVE", "Subscription Cards"], ["Video Games", "Xbox One", "LIVE", "Subscription Cards"]]}