{"asin": "B0032OREFU", "categories": [["Office Products", "Office Furniture & Lighting", "Furniture Accessories", "Footrests"]], "description": "Improve poor posture and reduce strain as you work with the Climate Control Footrest from Fellowes. This footrest features customizable height and tilt, and a textured surface to help relieve stress. The climate control function with built-in heat and fan and auto-off feature allows you to safely adjust the temperature and airflow of your workstation.Climate Control FootrestAt a Glance:Elevates feet and legs to improve posture and relieve back pressureFreestanding climate control with three settings for easy temperature adjustmentAuto-off features turns unit off after eight hours to prevent overheatingSurface massage bumps help relieve work-related stressEconomical and ETL approved; requires only 250 watts to runRelieve back pressure and improve your posture.View larger.Ergonomic Design Relieves PressureThis ergonomic footrest elevates your feet and legs to help relieve lower back pressure and improve posture. The unit raises feet 5 to 6 inches off the ground and tilts 5, 14, or 20 degrees to provide a comfortable and posture-friendly foot and leg position.The footrest's surface features massage bumps to help relieve work-related stress. Kick off your shoes and rub your feet against the textured surface for a subtle but soothing massage.Climate Control for ComfortFine-tune your temperature with freestanding climate control. This footrest features three temperature settings: cool fan, low heat, and high heat. The built-in fan lets you adjust your workspace airflow to suit your preference. Whether you're feeling too warm or too chilled, this feature has you covered.Safe and Economical DesignYou'll never have to worry about whether or not you switched off the unit before leaving your office. An auto-off feature shuts off the climate control after eight hours to save energy and prevent overheating.Surface massage bumps help relieve work-related stress.ETL approved for safety and quality, this durable footrest requires only 250 watts to run its climate control feature. Measuring 5-1/2 by 16-1/2 by 10 inches (H x W x D), it's suitable for just about any size desk.About FellowesFellowes, Inc. is a global manufacturer and marketer of workspace products and solutions that enhance security, organization, and productivity in today's workplace. Designed and manufactured to offer superior quality, usefulness, and value, Fellowes' products range from business machines (paper shredders, binder machines and laminators) to records storage solutions to a full-line of accessories.Founded in 1917 by Harry Fellowes and headquartered in Itasca, Illinois, Fellowes, Inc. employs more than 2,700 people throughout the world and has operations in 15 countries.What's in the BoxFellowes Climate Control Footrest.Recommended Companion Products and AccessoriesProfessional Series Back SupportSmart Suites Corner Monitor RiserProfessional Series Compact Keyboard TrayMid-spinal support with memory foam promotes good postureLower lumbar support with three memory foam sections conforms comfortably to body curvatureTri-Tachment system eliminates the need for readjustmentUnique shape fits neatly into desk corner to maximize workspaceElevates display to comfortable viewing height to help prevent neck strain.Three height adjustments for customizable viewing comfort (from 3-7/8 to 5-1/8 inches)Compact 17-3/4-inch glide track to provide comfort and maneuverability for smaller workspacesLift and lock feature lets you adjust height with one handMemory foam wrist supports with Microban antimicrobial protection keep product cleanerMain Product Benefit", "title": "Fellowes Climate Control Footrest (8030901)", "price": 35.33, "imUrl": "http://ecx.images-amazon.com/images/I/41AL-ROpxqL._SY300_.jpg", "brand": "Fellowes", "related": {"also_bought": ["B000WTO52I", "B006K0PAM2", "B009X9Z6BW", "B0013V6PDG", "B002T0FMH0", "B002GH1T32", "B004E3ECRQ", "B00006B8J2", "B001U8PRY0", "B000079896", "B000YTNKK4", "B004I2HMQG", "B00006I62X", "B00004Z5RA", "B000A6PPOK", "B0000AQOH9", "B004UQ40IS", "B001E2N1NG", "B000VZZMXE", "B001MS6XW8", "B003VAHYNC", "B004SUIM4E", "B001DJ80RC", "B000UH9M3E", "B00CYX54C0", "B0000AI45T"], "also_viewed": ["B0013V6PDG", "B004UQ40IS", "B004I2HMQG", "B005KUIU8Y", "B004RTT8DA", "B006K0PAM2", "B00006I62X", "B002T0FMH0", "B004E3ECRQ", "B001MS70F2", "B000IJ14M6", "B0002LD0ZO", "B0013F12YO", "B0035IPOGY", "B0000AI45T", "B001MS6XW8", "B004E3NTJI", "B002UUQGY2", "B003DHZPAC", "B001MS6VUW", "B001ACF0B6", "B001EDZ6I8", "B00EN9W3UY", "B002I6S86W", "B00331YTDM", "B000079896", "B000AXTU62", "B0013PBSW0", "B00GXJE8W8", "B00IXE4KG0", "B007477L4K", "B001MS6WKQ", "B0013CMAHU", "B001JI6CVS", "B000HVI1RG", "B00H3R4JHI", "B0032VDRG8", "B001T9QPFA", "B000GEBXHY", "B001MS710G", "B000HVK01G", "B006UGRVJQ", "B0002DR45E", "B00506DS58", "B009R645G8", "B0013V1PYA", "B000VNOBC4", "B000JTMOVA", "B001AFJ0MS", "B003VP0E02", "B00G1X4A06", "B0053QKKZQ", "B00006IAHM", "B001JI9IKU", "B003IPMLN8", "B0013V39J4", "B009X9Z6BW", "B000KUJENY", "B00I6GPCE4"]}}