{"asin": "B000Q30420", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Manufacturer DescriptionDiscover a new inspiration. The PowerShot SD850 IS Digital Elph is a digital camera that will really get your creative juices flowing. It starts with a high-resolution 8-megapixel CCD, a 4x optical zoom with Canon&rsquo;s exclusive UA Lens and an Optical Image Stabilizer for steady zooming. There&rsquo;s also a DIGIC III Image Processor with Face Detection and red-eye correction, an ISO 1600 setting for sharper images in low light, 5 Movie Modes and a 2.5-inch PureColor LCD with scratch-resistant, anti-reflective coating for easy viewing.PowerShot SD850 Highlights4x optical zoom in actionAdvanced 8.0-megapixel Digital Elph with 4x optical zoom and exclusive UA lensCount on the PowerShot SD850 IS Digital Elph for images that will make you say \"wow\" every time you shoot! Equipped with a high resolution 8-megapixel CCD, this Digital Elph is just what you need to capture life&rsquo;s greatest inspirations as you&rsquo;ve always wanted them. You&rsquo;ll get every exquisite detail in dazzling, eye-popping color. And you can print big. Plus, the SD850 IS Digital Elph is equipped with a 4x optical zoom that features Canon&rsquo;s exclusive UA lens with ultra-high refractive index glass to enhance your pictures while significantly reducing total lens size. Just imagine the possibilities!Optical Image Stabilizer technology for steady, long zoom shootingLife doesn&rsquo;t give you second chances to capture special times. That&rsquo;s why the elegant PowerShot SD850 IS Digital Elph is equipped with Canon&rsquo;s acclaimed Optical Image Stabilizer Technology that automatically detects and corrects camera shake -- one of the leading causes of fuzzy or blurred shots. So now even when you&rsquo;re zooming in tight you can get the steady, crisp, brilliant images you&rsquo;ll be proud to shoot and share. And Canon&rsquo;s Optical Image Stabilizer Technology is so convenient to use. Just turn it on, it functions perfectly with or without a flash.DIGIC III Image Processor with improved Face Detection Technology and Red-eye CorrectionWith DIGIC III, you get images of superior quality, the camera functions at top efficiency and battery life is significantly enhanced. What&rsquo;s more, DIGIC III enables Canon&rsquo;s newly improved Face Detection Technology and Red-eye Correction to give you better, more true-to-life people shots. Simply press the Shutter Button halfway down, and the PowerShot SD850 IS Digital Elph automatically pinpoints the faces in the scene and chooses the ideal focus point. To keep every face looking bright and natural -- without scary red eyes -- the camera controls exposure settings and flash, so every shot is just what you were shooting for.Find multiple faces with Canon's improved Face Detection technologyDIGIC III features Face Detection AF/AE, which finds multiple faces in the frame and sets the most suitable focus point, when the shutter button is pressed halfway. And an additional new feature, Face Detection FE adjusts the flash, based on a person&rsquo;s face on the screen. Exposure and flash are controlled to ensure proper illumination of both the faces and the overall scene, eliminating the common problem of darkened or overexposed faces.Red-eye Correction detects and automatically corrects red-eye during playback for both regular and flash photography. In unusual cases where red-eye is not automatically detected, it can easily be corrected manually during playback mode.iSAPS technology is an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the fast DIGIC III Image Processor to improve focus speed and accuracy, as well as exposure and white balance.Vivid, high-resolution 2.5-inch PureColor LCDThe camera&rsquo;s 2.5-inch LCD screen gives you the big picture, whether you&rsquo;re shooting, reviewing or showing off your images. This extra-durable, high-resolution screen with tough scratch-resistant coating on the anti-reflective, PureColor LCD screen offers a crisp, clear picture to make shooting, playback and using the camera&rsquo;s menu functions especially convenient. Clear and bright, it also features Night Display for easy viewing in low light.Sensitivity range expanded to ISO 1600The PowerShot SD850 IS Digital Elph features new ISO 1600 and High ISO Auto settings that reduce the effects of camera shake and sharpen subjects in low-light situations, giving you greater flexibility for shooting.ISO 80 v. ISO 1600Creative Light effects, and five movies modesA new Special Scene Mode \"Creative Light Effects\" brings you a new pleasure of capturing night scenes! You can select ant effect before shooting, then it transforms background bright spots to stars, hearts, music notes and more.Shooting movies have also five options. With a highly flexible movie mode, you can create the movie that&rsquo;s perfect for any application. Select from VGA (640 x 480 pixels) and QVGA (320 x 240 pixels), with frame rates of 30 fps and 15 fps for recording up to 1 hour or 4GB. Also choose from Fast Frame Rate (QVGA; 320 x 240 pixels) recording at 60 fps for up to 1 minute, Compact Movie Mode (QQVGA; 160 x 120 pixels) recording at 15 fps for up to 3 minutes, and Time Lapse (640 x 480) recording at 1 or 2 sec. intervals. The PowerShot SD850 IS Digital Elph supports the USB 2.0 Hi-Speed standard, so you&rsquo;ll enjoy the fastest possible data transfer speeds when using a USB 2.0 Hi-Speed compatible computer.18 Shooting Modes including 11 Special Scene ModesAutoThe camera chooses all the settings so you can concentrate on your subject.ManualThe ultimate in creative control, you set ISO speed, exposure compensation and white balance.Color AccentChoose to retain a single color in your image while other colors turn monochrome.Color SwapSelect a color and replace it with a color you specify for special effects.Digital MacroShoot larger-than-life close-ups with one-button simplicity.Stitch AssistBuild awe-inspiring panoramas by neatly aligning sequential images.MovieShoot in VGA and QVGA (30 fps/15 fps for up to 1 hour or 4GB), Fast Frame Rate (60 fps for up to 1 minute), QQVGA (15 fps for up to 3 minutes) or Time Lapse (640 x 480 for 1 sec./2 sec. intervals).PortraitThe camera sets a large aperture, focusing the subject and artistically blurring the background to make your subject \"pop.\"FoliageCapture brilliant shots of autumn foliage, greenery and blossoms.SnowShoot clear snow scenes without darkened subjects or an unnatural bluish tint.BeachGet clear shots of people at a sunny beach without darkened faces.FireworksGrab brilliant images of skyrocketing fireworks.AquariumAchieve proper flash-free exposure and natural hues at indoor aquariums.UnderwaterCapture underwater images with reduced backscatter effect (Note: Optional Waterproof Case WP-DC15 required for shooting any underwater images).IndoorReduce blur and improve color accuracy when shooting handheld indoors.Kids &amp; PetsReduced focusing time freezes fast-moving subjects, so you won&rsquo;t miss those special shots.Night SnapshotGet natural-looking pictures with brighter backgrounds and subjects lit by flash.Creative Light EffectsTransform background bright spots to stars, hearts, music notes and more.The Complete Print SolutionPrint/Share Button for easy direct printing and downloadingThe PowerShot SD850 IS Digital Elph's Print/Share button makes direct printing easier than ever. Simply connect the SD850 IS Digital Elph to a Canon CP, SElphY or PIXMA Photo Printer or any PictBridge compatible photo printer, press the lighted Print/Share button and print! Also use the Print/Share button to transfer images to a computer (Windows and Macintosh).Print your own ID photos in 28 different sizes or use the Movie Print function to output multiple stills from a recorded movie on a single sheet with a Canon SElphY Compact Photo Printer.Direct Photo PrintersFor desktop large-format printing, try one of the Direct Photo Printers that allow you to print without a computer in one of two ways: plug your compatible PowerShot camera into the Direct Photo Printer using the supplied USB interface cable, or simply insert a memory card into the supplied adapter. You can also connect the printer to your computer for more options. Print high-resolution, borderless images as postcards or 8.5 x 11-inch sheets within minutes.Compact Photo PrintersCompact Photo Printers let you produce versatile, fun 4 x 6-inch postcards, 4 x 8-inch wide greeting cards or credit card size prints in just two easy steps: connect and press/print. Control the printer right from your camera's LCD screen. You get durable, dye-sublimated prints quickly with or without borders. Assorted paper types let you create mini or credit card size labels. You can even take select Compact Photo Printers to a party or an outdoor picnic using an optional rechargeable battery.PictBridgeThe PictBridge standard enables any digital camera that supports PictBridge to connect and print to any PictBridge compatible printer.What's in the boxPowerShot SD850 IS Digital ELPH body, Lithium Battery Pack NB-5L, Battery Charger CB-2LX, SD Memory Card SDC-32M, Wrist Strap WS-700, Digital Camera Solution CD-ROM, USB Interface Cable IFC-400PCU, AV Cable AVC-DC300", "title": "Canon PowerShot SD850 IS 8.0 MP Digital Elph Camera with 4x Optical Image Stabilized Zoom", "price": 369.0, "salesRank": {"Camera &amp; Photo": 2862}, "imUrl": "http://ecx.images-amazon.com/images/I/41HO%2Bdjnm8L._SX300_.jpg", "related": {"also_viewed": ["B001SER47O", "B001SER47Y", "B000V1VG2O", "B000NK6J6Q", "B000NK8EWI", "B0075SUII4", "B001SER48S", "B0035FZJKI", "B0012YC7AE", "B001SER48I", "B000EN0K94", "B001SER492", "B0075SUIEI", "B002LITT3S", "B000EVS4YE", "B000EMWBT2", "B0011ZK6PC", "B001SER46A", "B0011ZCDKS", "B001G5ZTN6", "B00HLDFPA4", "B005JX1IOU", "B0013TUG5G", "B000AYGDIO", "B00427ZLRO", "B004HW73S4", "B00141LYY0", "B0035FZJJ4", "B00HLDFNKQ", "B004HW73SO", "B0007TJ5OG", "B000ENPDSW", "B00AWYN0BU", "B00I58LVKC", "B001G5ZTWM", "B001SER46K", "B0075SUK14", "B0012Y84AG", "B003ZSHNGS", "B00I58LXVY", "B005MTME3U", "B0035FZJJE", "B001R4QM5K", "B00AWYMXZY", "B000AYJDD6", "B004J3V8UU", "B004J3VAYO", "B006UMM1PO", "B009F6X30E", "B004J3YCGM", "B00AWYN182", "B00AWYN0ME", "B000NK5Z8Y"], "bought_together": ["B000NK5Z8Y"], "buy_after_viewing": ["B000EVS4YE", "B003VNKNEQ", "B007M51J3I", "B000NK5Z8Y"]}}