{"asin": "B0016PZYLS", "description": "A worthy successor toSaints Row, the first open-world title on next-generation    consoles,Saints Row 2features all new customization options, including    player's: gender, age, voice, crib and gang. In addition, the sandbox just got    larger with a totally transformed and expanded city of Stilwater, offering all    new locations to explore with new vehicles, including motorcycles, boats, helicopters    and planes.Saints Row 2will be playable online in 2-player co-op through    the entire singleplayer campaign or in the all new open-world competitive multiplayer    mode never before seen in the genre.Take back the streets of StilwaterWelcome back to StilwaterView larger.One of the new faces on the Row.View larger.Customization down to the taunt.View larger.Extreme posse creation.View larger.Take the battle to the air.View            larger.Weapons that go bang.View            larger.Throw down some skin.View            larger.BackstoryFive years have passed since your former Saints crew betrayed you. As you awake from a coma for the first time since that fateful day, you find the Stilwater you once ruled is in disarray. Unfamiliar gangs have laid claim to your territory, rival factions have taken over your rackets, and cash-hungry corporations have laid waste to your once proud 3rd Street home. Abandoned and left scarred with an unrecognizable face, you seek out a plastic surgeon to begin your new life on the streets. Yet some things never change in Stilwater.Respect can only be earned and that requires a lifestyle that reflects your    unique personality. Your crib, your crew, and your character define who you    are on the streets and how you are perceived. The image you portray is as important    as the decisions you make in a city ruled by false bravado and impulsive behavior.    The only constant is the need for an identity that reflects your individuality.    But style and image can only take you so far in a world where actions speak    louder than words. Sometimes sending a message to your enemies requires heavy    lifting, like that of a rival gang member into oncoming traffic. Respect in    Stilwater needs to be taken, and what better way than to grab it from the hands    of a gang full of enemies by means of a satchel charge, a flame-thrower or those    minigun rounds you've been saving for a special occasion.Meet Your HomiesBut remember that the  fight to reclaim Stilwater does not have to be waged alone. The Saints once ruled these streets as a crew of brothers, and their return to the top can help be secured through co-operative alliances. The time has finally come to seek revenge against your rivals to reestablish your crew as the rightful kings of Stilwater, but the streets are crawling with bangers. Check out the crews you'll run into and remember their faces and their ways:3rd Street SaintsOnce the kings of the city, the Saints have been forced out of their titular home of Saints Row by the Ultor Corporation, a giant conglomerate that gentrified the once poor neighborhood. Now operating out of an abandoned underground hotel, the Saints are looking to reclaim the glory that they lost several years ago.RoninOne of the newest gangs instilling fear in Stilwater, the Ronin recruit        from both the city's Asian population as well as among the immigrants. Their        crimes involve peddling vice through gambling, prostitution, street-racing,        and protection rackets, and their power has reached even into the boardroom        of corporations like Ultor.Sons of SamediInfluenced by Voodoo and a history of military corruption in Haiti, the Sons of Samedi are known for their potent combination of spiritualism and fearlessness. Members are attracted to the gang out of respect for their methods, through coercion or a desire for easy income generated through trade in their designer drug called \"Loa Dust.\"BrotherhoodFormed from the cast-outs and dredges of Stilwater society, the Brotherhood is a solid force of strength and intimidation intent on revenging itself upon the police and city. Specializing in violent extortion, they forego subtlety and nuance and simply take what they want, all the while flashing their allegiance with piercings and tattoos, bright colors, and gas-guzzling trucks.Ultor CorporationA ruthless corporate contender, the Ultor Corporation's gentrification of        Saints Row created a new skyline for the city and a headquarters for their        corporate office at the expense of the poor and the 3rd Street Saints. Now        they're targeting another neighborhood, the Shivington projects, fueling        gang wars and waiting for the prime moment to move in and reap the profits.Key Game Features:Freedom to Explore Through Open World Gameplay- Balancing story progression with all the time-wasting mayhem imaginable,Saints Row 2contains more activities, diversions, races, cribs, city districts, and interiors than ever before.Extensive Mission Play- Over 40 story missions with additional bonus missions take place in a transformed Stilwater that is over 50% larger than before.Limitless Customization-Saints Row 2allows you to customize everything connected to what you wear, drive and where you live as well as gives you access to countless character combinations from facial expression, body type, voice, taunts, gender to walking style. In addition, players can customize gangs various and extreme physical looks (some pretty crazy), fighting styles, gang taunts and tags and vehicle preferences.Improved Combat Functionality- In addition to the usual run, jump,      punch, drive, stab, shoot model of combat,Saints Row 2allows you      to take human shields and exact finishing moves if you choose, but beware.      How you commit crimes affects your notoriety, which determines the response      of police.Expanded Multiplayer options- Along with a compelling singleplayer mode, enjoy a variety of multiplayer play options including:Strong Arm: A team-based multiplayer mode batching together prominent activities from the singleplayer campaign into one series of timed events, with the goal to earn the most cash as a team at the end of the events.Gangsta Brawl: A standard deathmatch mode with the single player with the most kills winning.Team Gangsta Brawl: A standard team deathmatch mode with the team with the most kills winning.Co-Op Mode: Full drop in/drop out coop support and ability to play through the full single player campaign with buddies and with the ability to set online co-op games to public, friends-only or invite-only status.Lots of Wieldable Weapons- Whether you talking chairs, parking meters, street signs, newspaper dispensers or your neighbor's garden gnome, use whatever is on hand to take out an enemy.An Explosive Weapon Arsenal- When a melee weapon just won't do,      send a message to your enemies by dipping into an arsenal that includes: rocket      launchers, shock-paddles, stun-guns, satchel-charges, mini-guns, uzis, automatic      shotguns and flame-throwers; Some of which can be duel wielded.A Vehicle for Every Surface- Put the pedal to the metal in a large selection of cars, motorcycles, ATVs, planes, watercraft and helicopters.All New Music-Saints Row 2will feature an entirely new soundtrack of songs and the ability to create a custom in-game radio station, accessible from any vehicle by building a playlist of songs purchased in-game, with in-game money.The Silwater sprawled before you as you wake inSaints Row 2is both familiar and strange, but you will find that the explosive conclusion to the originalSaints Rownot only has left you wounded and betrayed, but also thirsty for revenge. Now it's time to take back the city that has forgotten you and only you will decide how far you'll go to achieve that.", "price": 27.9, "imUrl": "http://ecx.images-amazon.com/images/I/614vhz78gYL._SY300_.jpg", "related": {"also_bought": ["B004QEWVLC", "B00BRQN2H4", "B009DZTXQU", "B00198PO5I", "B0076ZQSFI", "B000BLM5PG", "B000HKP88C", "B002I0J5UQ", "B0036FDHT2", "B0045U01OG", "B000QAVV6G", "B0022TNO7I", "B000WQWPP0", "B002EE1P2W", "B000WMEEBM", "B001ASJIRC", "B000MAFXU0", "B001GGO1GG", "B0012NAPNQ", "B0023CBZ70", "B003H0CBYS", "B0014UGK8G", "B002MED6EO", "B0050SXX88", "B00269DX5W", "B001RTCOWA", "B001SGZL2W", "B00503E9FY", "B00149ILDO", "B0030CYE8O", "B0050SXKU4", "B0050SXFKE", "B003JVCA9Q", "B001NIP3EG", "B002I0HIMI", "B0016GC9D8", "B00354NANC", "B003KMCHTC", "B000FQBF1M", "B000QAUGH6", "B002I0H2G0", "B003GT8IL0", "B000P46NMA", "B006ZTHFPS", "B000XJNTQ0", "B003P9FRGA", "B0028IBTLG", "B002I0K5NC", "B000P297EI", "B005N4HBIW", "B0085CA8QG", "B0065NP05G", "B005VBVQDI", "B003C1I06U", "B002I0K7H6", "B000X1TC0U", "B0017ZIIK6", "B002I0F5M8", "B0021TVYCG", "B003L8DXOI", "B000IONGWW", "B00269QLH4", "B002I0JBL4", "B004J6I0YO", "B000UU7VUC", "B000GPXSCQ", "B00104KCF8", "B004FYJFNA", "B004HYK8Y8", "B004FUI84G", "B007XVTR5S", "B004PAGJNS", "B00CJ7IUI6", "B000UUATJ2", "B000TG72TM", "B00320JAWY", "B002NN7AKU", "B00149ND28", "B004CVQUOI", "B0050SX9VO", "B0053BSOD6", "B000UW21A0", "B0044SA734", "B001TOMQOY", "B002ZJNWWC", "B001D7T2VC", "B007SRM5U6", "B00BMFIXKQ", "B000JLIXIG", "B002AB7TX8", "B000WS97QI", "B000TVT7U4", "B003O6E5OE", "B001AZFSEW", "B00175GC3Q", "B0000A92KX", "B003KZJA9Y", "B000XJLQ24", "B002I0J82G"], "bought_together": ["B004QEWVLC", "B00BRQN2H4"], "buy_after_viewing": ["B004QEWVLC", "B009DZTXQU", "B00BRQN2H4", "B005DZ4IL4"]}, "categories": [["Video Games", "PlayStation 3", "Games"]]}