{"asin": "B003D5MZUW", "categories": [["Electronics", "Camera & Photo", "Bags & Cases", "Camera Cases"]], "description": "The Evolution 8 Photo/Laptop Sling Backpack can be carried three different ways: as a backpack, as a sling pack on the right shoulder, and as a sling pack on the left shoulder. With Tamrac's Triple Access System, there are also three ways to access your gear: through the front door and through two side doors. The Evolution 8 is perfect for a DSLR with a grip and up to an 8\" lens attached, several additional lenses, a flash, and accessories. The rear, completely foam-padded laptop pocket holds most 15.6\" screen laptops and others up to 15\" x 10&#xBC;\" x 1&#xBD;\" (38 x 26 x 4cm) in size. When worn as a backpack, the two foam-padded shoulder straps, waist belt, and chest strap distribute the weight. For quick access to camera gear, slip off one shoulder strap, swing the pack around to the front, and open the side door to access a DSLR with a lens attached. To get to additional equipment, swing the pack around to the opposite shoulder and open the side door on the other side of the pack. Both side doors feature two convenient memory card pockets and a pocket to store lens caps while shooting. To convert the Evolution 8 to a sling pack, cross-connect a single shoulder strap &#x2013; red to red for carrying on the right shoulder, or blue to blue for carrying on the left shoulder. The other strap is easily tucked away inside the back harness. When the pack is removed, all gear can be accessed through the door to the main compartment. The internal dividers are foam-padded and fully adjustable", "title": "Tamrac 5788 Evolution 8 Photo/Laptop Sling Backpack (Brown/Tan)", "price": 175.95, "imUrl": "http://ecx.images-amazon.com/images/I/41XykvW-agL._SX300_.jpg", "brand": "Tamrac", "related": {"also_bought": ["B0000BZLBQ", "B000067O7T", "B00004ZCI3", "B007NDL56A", "B000BH5OW6", "B0045KGZOG", "B00017LSPI", "B0033PRWSW", "B003D5TVA4", "B0048IW030", "B00009R96C", "B001E3XLZI", "B0043RTLNS", "B0000BZLAC", "B00CH6ATMO", "B00009XVA3", "B0083WYFWG", "B007P1C4RO", "B001KELVS0", "B000067O7U", "B003Y30334", "B0000BZL83", "B007M54E1M", "B00007EDZG", "B00006JN3G", "B00004ZCJK", "B002SXNXUG", "B0000BZL7S", "B00004ZCJG", "B0080JH3YE", "B00004ZCJM", "B0090T8ESM", "B004OVE188", "B0070WU51U"], "bought_together": ["B00017LSPI", "B00006JN3G"], "buy_after_viewing": ["B004USLWVE", "B003D5TVA4", "B003D5MZRK", "B0080JH3YE"]}}