{"asin": "B00113T0VA", "description": "The Star Wars saga will continue inStar Wars: The Force Unleashed, a videogame developed by LucasArts, which casts players as Darth Vader's &quot;Secret Apprentice&quot; and promises to unveil new revelations about the Star Wars galaxy. The expansive story, created under direction from George Lucas, is set during the largely unexplored era between Star Wars: Episode III Revenge of the Sith and Star Wars: Episode IV A New Hope. In it, players will assist the iconic villain in his quest to rid the universe of Jedi - and face decisions that could change the course of their destiny.Join the Dark SideYou are Darth Vader's Secret ApprenticeView larger.Use the Force to disable your enemiesView larger.Artwork of the Jedi \"Maris\"View larger.As its name implies,The Force Unleashedcompletely re-imagines the scope and scale of the Force. The Wii version will not only give you a solid story-line developed by LucasArts involving the Darth Vader's secret apprentice, but you'll experience a new style of gameplay only the Wii can offer. With the Wiimote and Nunchuck you'll be able to battle your way through your enemies utilizing your Lightsaber attacks and Force powers. Not only can you experience this new control system in story mode, but you can also try your Jedi skills against a friend in the Wii,&quot;Battle Mode.&quot;Joining the Dark Side doesn't seem like such a bad idea after all.Game Features:During the period between Episodes III and IV, players hunt Jedi in the role of Darth Vader's Secret Apprentice.Unleash and upgrade the Secret Apprentice's four core Force powers - Force push, grip, repulse and lightning - throughout the course of the game, and combine them for ultra-destructive, never-before-seen combos.Examples of unleashing the Force in ways never thought possible:The Secret Apprentice won't just Force push enemies into walls - he'll Force push enemies through walls.The Secret Apprentice won't just Force grip foes to throw them aside - he'll Force grip them in midair, zap them with lightning, then drop them to the ground to explode like a bomb.In addition to new adversaries created just for the game, such as fugitive Jedi and Force-sensitive Felucians, players will also confront and associate with familiar faces from the Star Wars films, including Darth Vader.Visit locations such as Episode III's Wookiee homeworld Kashyyyk and the floral Felucia, the junk planet Raxus Prime, plus an Imperial TIE fighter construction facility.The Wii system's &quot;Battle Mode,&quot; a one on one fighting arena simliar to the classic game,Star Wars: Masters of Ter&#xE4;s K&#xE4;si.Use the Wiimote to slash and pierce your enemies with your Jedi Lightsaber while you use the Wii Nunchuk to disable other opponents with your Force Powers.LucasArts is preparing an unprecedented promotional effort around the launch ofThe Force Unleashed, encompassing a full line of toys and game-based action figures from Hasbro, as well as a full publishing program from Dark Horse, Del Rey and Palace Press.Meet the CastThe Star Wars Saga will continue in 2008 with LucasArts' biggest-ever video game event. Set during the &quot;dark times&quot; between Episodes III and IV,Star Wars: The Force Unleashedportrays the previously untold story of Darth Vader's Secret Apprentice -- and now you can put a face to that mysterious character as well as the major supporting cast members as LucasArts unveils the actors set to star inThe Force Unleashed.The Technology ofThe Force UnleashedWithThe Force Unleashed, LucasArts not only introduces a new chapter in the Star Wars saga, but also pushes the Wii's game engine to deliver amazing detail and realism only found in a Star Wars title. You will experience gameplay and the Force like you never had before.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51rAd9-Xf%2BL._SY300_.jpg", "related": {"also_bought": ["B0030F1DQC", "B002ABVLZA", "B001BWRBB2", "B002E1L660", "B004122X7Q", "B002BSA2R0", "B004MXQ3FM", "B000R3BNDI", "B0037UCT0O", "B0030GBU8W", "B000KKTCCC", "B002EZLA5I", "B001AWIP7M", "B003O6H7X0", "B00503E9UO", "B004VMX9YW", "B007M4L6C8", "B005FYJA52", "B004BCXOVU", "B002UMC2J8", "B004LM36HW", "B0088MVP4M", "B001RERN30", "B000G7T7JC", "B003ESHRVA", "B002WDL51Q", "B0051TL964", "B001DUKZFG", "B002BSC4ZS", "B004WLRQMI", "B0013KK84O", "B003TEI3E4", "B000RHZJJS", "B000P46NKC", "B000NJIUZ0", "B002I0GEBO", "B000FQ9R4E", "B0037M2SOY", "B006ZPAYB4", "1465418970", "B004DGQISU", "B000FQ9QVI", "B002BRZ9G0", "B002BS4JLA", "B002I0GEXM", "B000KWZ6D4", "B00DWXV074", "B000ZKBJYG", "B002I08CJG", "B003WOFXEY", "B0013E9HP6", "B003ZHMMEM", "B0038N9WWI", "0761559167", "B0017HIIWW", "B000X25GW2", "B00DWXV2EU", "B000ZK6946", "B001GIUWX0", "B004C34D2M", "B0007SL1ZI", "B0094X1ZXU", "B001PKHRV4", "B008BT2FEG", "B002BSA388", "B002XGIAD8", "B000NDFFFE", "B001GHMLLC", "B000HGKEZS", "B0029CSOC8", "B004FEI752", "0345511557", "B00104KJ4M", "034550285X", "B004RIACMM", "B002GEKIOG", "B0051873RE", "B000FQBPDU", "B000SH3XH2", "B0030HM2YM", "B000RHXD1O", "B001811BVC", "B00K278J0Y", "B001D8PFIK", "B003LDKIQ4", "B003YC4D9A", "B003XDRIYC", "B002BRYXOO", "B001PO2BJI", "B001B1W3KM", "B0094X28J0", "B005EHQJ2C", "B001ASJISG", "B004M8K9AW", "B000R4809W", "B005EW67PG", "B001PKHRSW", "B002BUIDO2", "B000MUSG4U"], "bought_together": ["B0030F1DQC", "B001BWRBB2"], "buy_after_viewing": ["B0037UCT0O", "B000R3BNDI", "B0030F1DQC", "B002ABVLZA"]}, "salesRank": {"Video Games": 2678}, "categories": [["Video Games", "Wii", "Games"]]}