{"asin": "B001BO7R00", "related": {"also_viewed": ["B006L6ZU84", "B003VTZE4Y", "B002HOPUPC", "B002HOQ08S", "B002HOPXE0", "B003WOLOLU", "B004FLL5AE", "B004FLL5BI", "B0043D4V8M", "B005G81E9M", "B0030MITDK", "B004FLL5AO", "B006KDQFLY", "B0043CWU22", "B003WOLOM4", "B000V1PXL4", "B001OC5L0C", "B004H8FNBC", "B0044DEEJC", "B0030MITLW", "B00BF9HZT4", "B005G81EAQ", "B009GLINO4", "B004FLL5B8", "B0040702HA", "B0023B14TK", "B004H1QCMI", "B004FLL5AY", "B00CLEQD5E", "B0072619RI", "B001LK8P14", "B001QWKI8K", "B006P8C1Y4", "B003AVH0TK", "B004EWGSVU", "B003Z6QHSK", "B000V1PXMI", "B004GKLW84", "B001HSOFI2", "B007261A6I", "B0043CVH2Q", "B0031RGKVC", "B004AP9FSE", "B0040702IE", "B003P2V4OQ", "B003DZ122O", "B000FLXTBQ", "B001O94GNS", "B003VTZE62", "B003JIYNOO", "B0043CYRT6"], "bought_together": ["B001795L5W", "B003VNKNF0"], "buy_after_viewing": ["B006L6ZU84", "B003VNKNF0", "B003VTZE4Y", "B003VNKNEQ"]}, "title": "Kodak Zi6 HD Pocket Video Camera", "price": 179.99, "salesRank": {"Camera &amp; Photo": 4402}, "imUrl": "http://ecx.images-amazon.com/images/I/31u7C4s1tuL._SY300_.jpg", "brand": "Kodak", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "Become an instant celebrity or paparazzi with the Kodak Zi6 pocket video camera. Just hit record to capture the action, adventure and all the juicy details in stunning HD quality video. Make your cinematic debut on any HDTV. Or just pop the USB in the nearest PC and you're ready to share the fun on YouTube.Edit, add music and personalize your flick and then easily share with your adoring fans. There/s no such thing as \"you should've been there\" with the Zi6. Catch life as it happens.Kodak Zi6 HighlightsCatch life as it happensCapture HD quality video (720p at 60 fps with 16:9 aspect ratio)Record hours of video with the expandable SD/SDHC card slot that can hold up to 32 GBYou're the directorSee it all on a vibrant 2.4-inch LCD screenCatch the highlights with slow motion playback right in the palm of your handChoose the video quality that works for you: HD at 60 fps, HD at 30 fps, or VGA (Video Graphics Array)Be creative with great video softwareEdit and trim videosAdd pictures and music to your videos to make cool mash-upsGrab still images from video frames to get that perfect shotEmail your creations or upload to YouTube right from the softwareWho needs Hollywood?Upload your videos to YouTube quickly and easily using the built-in USB and softwareExperience your videos on an HDTV in stunning HD quality with included cablesShow off your unique style with cool accessoriesGreat cases help keep your Zi6 close so you never miss the momentUse a tripod to keep your video steady or star in your own showMount your Zi6 on your bike handles or helmet and catch a new perspectiveSave the planet -- one battery at a timeGo green with included pre-charged AA Ni-MH rechargeable batteries and battery charger.What's in the boxKODAK Zi6 Pocket Video Camera(2) AA pre-charged Ni-MH rechargeable batteriesBattery chargerHD and AV cablesWrist strapCamera pouchUser GuideARCSOFT MEDIA IMPRESSION Software for Kodak (PC only)"}