{"asin": "B0014YFC18", "related": {"also_bought": ["B005DKZTMG", "B008XEYT5M", "B001DEYVXO", "B001DERXV6", "B00DVTBM2W", "B00224ZDFY", "B00EUVEFEC", "B0088PUEPK", "B00E3W15P0", "B0069CQ7BE", "B003WM5J0O", "B008J0ZOV8", "B009F1DTLM", "B001H0BA24", "B00EUAFAF6", "B00KPRWAX8", "B008YAHW6I", "B0033Z2BAQ", "B00DIFIP06", "B00DL4BMRC", "B00H09BOXQ", "B001E2T6Y4", "B005FPT38A", "B00D38U4GQ", "B00E3W1726", "B00D2NMTB0", "B007U5MGBE", "B000OGX5AM", "B007YWMCA8", "B00CPLGGXM", "B006YG9EEW", "B005T3GRLY", "B005T3GRN2", "B0001UZQWG", "B00DIFIO8E", "B0018BQR84", "B00E1YBTVU", "B004X8EO6Q", "B0035FIS2O", "B005CT56R6", "B00A1ZTZOG", "B00A0HZMGA", "B004SUO068", "B001H3KG6W", "B0092ML0MY", "B0002MQGKO", "B0057Q4AGW", "B002UOR17Y", "B0045JHJSS", "B007ILC49Y", "B002BH3Z8E", "B00FA4KP8S", "B000NPKGH4", "B00H09BB16", "B006YG89Q6", "B004I5UDO6", "B00FJRS6FU", "B0049MPQA4", "B004GGUAUE", "B005O65JXI", "B002UOUQ08", "B001E2V7R8", "B00126U0VA", "B009GUXU52", "B00BQ4F9ZA", "B0094PI0GI", "B001Q7X0Z8", "B00F3ZN0CC", "B001PPVX8W", "B007RH5GZI", "B00DGHDQVO", "B001DFTGR4", "B007YDJJFS", "B00E7B08MS", "B0000BZ2WC", "B000HLZXH2", "B00CO8TBQ0", "B00H09BO2M", "B00F3ZN2W0", "B00BP5KOPA", "B001TH7T2U", "B0037TO5C0", "B006EWUO22", "B003FVX8GE", "B005T3GRNW", "B00A3VOA3O", "B00E3W19MO", "B0057Q4ADU", "B003CFATNI", "B00CKNOVN2", "B00CPLGGWS", "B00G57BN1M", "B00DUYD9RE", "B002MZW5KE", "B004Q0PT3I", "B003BU0EKW", "B0030DSECK", "B0095VPBM2", "B00BS92DCK"], "bought_together": ["B005DKZTMG"], "buy_after_viewing": ["B002U6KT8U", "B005DKZTMG", "B006PU81QE", "B002UOUQ08"]}, "title": "Hauppauge 1196 WinTV-HVR-1250 PCI-E x1 TV Tuner 1196", "price": 60.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/51EprSzwi9L._SX300_.jpg", "brand": "Hauppauge", "categories": [["Electronics", "Computers & Accessories", "Computer Components", "Internal TV Tuner & Capture Cards"]], "description": "The Hauppauge 1196 WinTV-HVR-1250 lets you watch, pause and record both digital and analog television on your PC, in a window or full screen. With PVR software you can also record television onto your computer for viewing later without slowing down your computer. Thanks to MPEG-2 encoding, video quality is superb..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The Hauppauge 1196 WinTV-HVR-1250 offers:Watch, pause, and record digital and analog TV on your PC.Compatible with ATSC and QAM digital TV, and NTSC analog cable TV signals.Convenient remote control.MPEG-2 software encoder for analog TV.WinTV software makes it easy to record your favorite shows.View larger.Watch and record high-definition digital television on your computer.View larger.View ports.Watch High-definition Digital TV on Your ComputerThe WinTV-HVR-1250 lets you watch ATSC digital TV as well as QAM digital TV and analog cable TV directly on your computer. ATSC digital TV, which typically requires an antenna for reception, is the over-the-air HDTV standard for North America. ATSC broadcasts range in resolution from standard definition up to the high definition 1080i format. (To check the ATSC digital transmissions in your area, input your zip code at titantv.com.)The WinTV-HVR-1250 also lets you watch and record QAM channels, which are unencrypted digital channels broadcast by your local cable operator. If you don't have access to digital television channels yet, you can also watch regular analog cable television. And with the included remote control, you can control your cable TV or satellite set top box.In addition to high-definition video, the card also features a dbx-TV stereo decoder for great TV sound. The card has S-Video and stereo audio inputs that allow for connecting VCRs or cable/satellite set top boxes.Your Own Personal Digital Video Recorder!With the included software, you can easily record TV shows to your hard disk using MPEG-2. Several recording options are available depending on your playback needs; higher quality video requires more disk space. Generally, 5 gigabytes of disk space is used per hour of ATSC digital TV recordings, and 1.5 gigabytes of disk space is used per hour of Analog recording using Hauppauge's SoftPVR for Windows XP and Media Center.With the WinTV-Scheduler software, you can easily schedule the recordings of your favorite television shows daily, weekly, or just once. You can then play back the recordings at your leisure, burn them onto CD or DVD for playback on another computer or your television, or with video editing software (not included), you can even edit the shows. This is great for saving favorite movie clips, clips of your home team's dramatic last-second win, or your favorite player's grand slam.The Hauppauge 1196 WinTV-HVR-1250 plugs into a PCI express X1 or X16 slot, and is compatible with Windows Vista, XP with Service Pack 2, and Windows XP Media Center Edition. With XP-MCE and Vista, you can add the WinTV-HVR-1250 as either the primary or secondary TV tuner. The Microsoft Media Center application supports up to two TV tuners so if you have a second tuner in addition to the WinTV-HVR-1250, you can watch one channel while recording another.What's in the BoxWinTV-HVR-1250 PCI Express bus TV tuner, remote control with batteries, remote control receiver cable, WinTV software CD-ROM, quick installation guide, and half-height bracket for use in low-profile chassis."}