{"asin": "B002XDRWZS", "description": "The TomTom XL 325 is an easy to use widescreen navigator. TomTom&rsquo;s award-winning software means effortless navigation from A to B. Switch your XL 325 on and go right out of the box. Just enter the address on the touchscreen and start driving anywhere in the US. TomTom guides you door-to-door with turn-by-turn spoken instructions. 3D graphics help guide you to your destination. An extra-wide touchscreen helps you find your way, worry-free. The XL 325 is preloaded with millions of points of interest to enhance your traveling experience &ndash; easily find your favorite gas stations, hotels, restaurants, and more.TomTom has the most accurate maps and with TomTom Map Share technology you can instantly modify street names, street direction, points of interest, and more on your own device. And with the &ldquo;Help Me!&rdquo; menu, there are added safety features so you can easily access local emergency providers such as police, fire stations and hospitals.The award-winning Fold &amp; Go EasyPort mount folds flat against the device, making it easy to take it with you from car to car.Go confidently.XL 325 FeaturesMaps of US with TomTom Map ShareFold &amp; Go EasyPort MountSpoken Instructions4.3-inch touchscreenAll TomToms FeaturePreloaded Points of Interest--Easily find millions of gas stations, restaurants, hotels, and more on your route.30-Day Latest Map Guarantee--Up to date, off the shelf.Help Me! Emergency Menu--Easily access local emergency providers, such as police, fire stations, and hospitals.TomTom HOME--Always up to date.Traffic Ready--Optional RDS-TMC traffic receiver accessory keeps you up-to-date on traffic events to minimize potential delays.Fuel Price Service (optional)--Know more, pay less.", "title": "TomTom XL 325 4.3-inch Portable GPS Navigator", "price": 93.91, "imUrl": "http://ecx.images-amazon.com/images/I/51uwVSkhk%2BL._SY300_.jpg", "related": {"also_viewed": ["B007PPYXOC", "B0057ODG6Y", "B0057ODOCA", "B003DQVW00", "B007M52QR6", "B00A7LULA6", "B003FSTAFK", "B00AY7NSTY", "B004W1GQ92", "B00AXZY42W", "B000PCBVA6", "B007M4Z7GO", "B00AJXMWP4", "B004MYFTEC", "B004MYFTFQ", "B00AXX0I7Y", "B003B3P2C4", "B004MYFTFG", "B00HK6CPVY", "B002OL2NT4", "B003CYKDQ2", "B004J4VYG2", "B004MYFTE2", "B0057OCDQS", "B00C9W1LT6", "B003B3P2BK", "B004HZFBOO", "B007M52EXM", "B001LK6XHM", "B004J4VYGM", "B00BHABL1O", "B004MYFTDS", "B005DIBH6A", "B005LMWPYG", "B007M52QEE", "B001VEJEGK", "B003FSTAHS", "B00BHAC85W", "B004MYFTEW", "B001LK6XGS", "B003FSTAGY", "B0037BVSCI", "B003B3P2CE", "B000H866BM", "B003FSTAG4", "B003NYU5NM", "B007M4Z6FG", "B002SPG2HK", "B00AXX0JP0", "B00AXX0IEC", "B00AXX0JNW", "B0057OCS9A", "B00AXZWG8Q"], "buy_after_viewing": ["B00AJXMWP4", "B0037BVSCI", "B0057ODG6Y", "B007PPYXOC"]}, "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS", "Trucking GPS"]]}