{"asin": "1400532620", "related": {"also_bought": ["B0035CLBT4", "B004X18N24", "B00406Q59K", "140053271X", "B0069ZFYCY", "B008I64R5W", "B0055ZDRI2", "B004D1OBFW", "B007UXNHGY", "B0050C0R92"], "bought_together": ["B0035CLBT4"], "buy_after_viewing": ["140053271X", "B007HCCNJU", "B004X18N24", "1400532655"]}, "title": "Barnes &amp; Noble Nook eReader - no 3G", "price": 74.95, "salesRank": {"Electronics": 23071}, "imUrl": "http://ecx.images-amazon.com/images/I/519ca3cu5eL._SY300_.jpg", "brand": "Barnes &amp; Noble", "categories": [["Electronics", "eBook Readers & Accessories"]], "description": "Barnes & Noble Nook eReader - no 3GMeet nook. Access to over one million eBooks, newspapers, and magazines downloaded wirelessly. Get bestsellers and new releases, your favorite eNewspapers, and eMagazines all delivered fast and free via Wi-Fi. Browse the vast Barnes and Noble eBookstore and sample any eBook for free.Choose an eBook using the beautiful color touch screen, then watch it appear instantly onthe E Ink display, where text appears as crisp asa printed page. The 16-level gray scale display offers great contrast with no glare or backlight. Choose from five font sizes so you can read with ease.Features:* No reading glasses required! Choose from 5 different font sizes so you can read with ease. The best-in-class E Ink display witha 16-bit gray scale offers great contrast with noglare or backlight making for hours of reading enjoyment.* Endless shelf space. Store as many as1,500 eBooks, eNewspapers, and eMagazines on yournook's 2 GB of internal storage, so you'll never be without your favorites. Need more space? Just add a Micro SD card.* Download eBooks in seconds. Sample eBooks for free just about anywhere you are, on us. Browse eBooks, magazines and newspaperson Wi-Fi. And every Barnes & Noble has free Wi-Fi, so you can connect at lightning-fast speeds.*Get endless shelf space. With 2GB of memory, nookstores up to 1,500 books, newspapers and magazines. Need even more space? Just add a memory card. An entire library light enough to take with you everywhere, so you'll never be without your favorites.* Free Reading: Try before you buy. Download afree sample of any eBook we sell to discover new authors and check out today's most talked about books for free. Find something you like? It's easy to buy and download the titles you want in seconds.* Reading Now: Use Reading Now, your virtual bookmark, to bring you back to the last book you've read, right where you left off. Coming soon, if you forget your NOOK at home"}