{"asin": "B00000K2R4", "description": "The Dreamcast system is, in a word, awesome. Fire upSoul Calibur, and instantly you'll appreciate that the graphics and gameplay are even better than in the arcade version. AndSonic Adventure, with its light-speed gameplay, is sure to wow even the most jaded gamer.It's amazing that such a small machine (it's about the size of your mouse pad) can deliver such incredible performance. Chalk it up to superior engineering. Dreamcast's only downside is that it comes with only one controller and a demo disc. In order to truly take advantage of Dreamcast's capabilities, we recommend outfitting the controller with a Jump Pack and a Visual Memory Unit. Getting one or more extra controllers is also a good idea, because some of the best Dreamcast games support up to four players at once.Why it's so cool:Ultramodern components:Custom-made video, audio, and processor technology blows away the Nintendo 64 and PlayStation and puts Dreamcast in the same league as PS2 and XBox.Integrated modem:In another video-game first, Dreamcast comes with a 56K modem. Use your regular Internet service provider and the separately sold keyboard to access e-mail, shopping, and the World Wide Web. Not only can you upload high scores, participate in chat discussions, and download updates and enhancements for your games, but, through a membership to the SegaNet Internet service provider, you can playQuake III Arena,NFL 2K1, and other games against Dreamcast owners over the Internet.The Visual Memory Unit (VMU):More than just a memory card, the VMU is a miniature portable game system that fits inside a controller--so its LCD screen is easily seen by you but hidden from your opponent.All-in-one entertainment:It plays games. It plays audio CDs. It connects to the Internet and lets you browse the Web or e-mail friends. Our note to the cost-conscious: If you have a Dreamcast system, you just don't need a separate CD player or a separate computer. Dreamcast does it all, and does it well.--Mike Fehlauer", "price": 5.34, "imUrl": "http://ecx.images-amazon.com/images/I/51v6Fml%2BTXL._SY300_.jpg", "related": {"also_bought": ["B000IVF2VS", "B00004SA3J", "B00000K3X9", "B00000K2R6", "B002GC5YMY", "B000059Z7G", "B00000K13K", "B00000K2R5", "B00004SA3U", "B0002J1NWS", "B00005A775", "B000VZICX6", "B00HPU96FI", "B00004T4XO", "B00002EQAP", "B000SL4IIG", "B001QVDSRO", "B00005CDR8", "B00004R8V4", "B00004SA3K", "B0007MZWQS", "B000A7I7M6", "B00000K11O", "B00000TBQQ", "B00004SA3R", "B000F0PNH0", "B00000SWOY", "B00004UFFP", "B00004T4XM", "B000SP1WLI", "B00000K2R7", "B00004SR5M", "B000034DLH", "B00004TEQD", "B00004T4XI", "B000K6TOK6", "B00000K4BX", "B00004T4XK", "B000028U2F", "B00002971H", "B0036UHVX0", "B00004S99M", "B00004YMZV", "B00001P4QN", "B00004U3GL", "B00005ME69", "B000035Y6D", "B00002DHEV", "B000056FLK", "B0000568U4", "B00004S9WU", "B0000488VQ", "B00000K2R9", "B005CJE1Z4"], "buy_after_viewing": ["B002GC5YMY", "B00004SA3J", "B00000K3X9", "B000IVF2VS"]}, "salesRank": {"Video Games": 1887}, "categories": [["Video Games", "More Systems", "Sega Dreamcast", "Hardware", "Consoles"]]}