{"asin": "B00ATM1M92", "categories": [["Electronics", "Camera & Photo", "Underwater Photography", "Cameras"]], "description": "A Tough Companion for All SeasonsWaterproof to 20ft (6m)Shockproof to 5ft (1.5m)Freezeproof to 14&deg;F (-10&deg;C)Dustproof*&nbsp;Dustproof:IP6XWaterproof:IPX8(up to 6.0m, within 120min.)&nbsp;Anti-shock:Method;MIL-STD-810F-516.5 Fuji's standard;1.5m.28mm Wide Angle, 5x Optical Zoom &amp; 10x Intelligent Digital Zoom.The indomitable FinePix XP60 features an internal 5x optical FUJINON zoom lens(28mm - 140mm)**, which means that you can zoom right up to the action, even underwater. The technology continues to impress with the added application of Intelligent Digital Zoom. The FinePix XP60 combines its 5x optical zoom with Intelligent Digital Zoom which results in double the zoom range(10x) whilst offering optimum image processing to counteract the degradation that has traditionally occurred when digital zooms are used.**&nbsp;35mm      format equivalentHigh-Resolution, 16M CMOS Sensor and Optical Image Stabilization16 million pixels CMOS sensor16 million pixels CMOS sensor makes even dark scenes bright for high-quality images.Optical (Sensor-Shift) image StabilizationOptical image stabilization reduces the blur that tends to occur when the camera is zoomed in.6 Scene SR AUTOScene Recogniton Auto ensures the optimum camera settings are always deployed for the best images of a given scene.New&nbsp;\"Burst Mode Button\" for Responsive, Hassle-Free ShootingCapture the action quickly and surely with continuous shooting toggle buttonCharacterized by high-speed processing, the CMOS sensor empowers continuous shooting at up to 10 frames/sec. (max. 10 frames) or ultra-high-speed bursts at a maximum 60 frames/sec. (max. 70 frames***). A dedicated \"Burst mode button\" lets you instantly switch into continuous shooting mode, making it easy to capture exactly the moment or expression that you're shooting for.Continuous shooting at up to 10 frames/sec. (max. 10 frames) at full resolutionUltra-high-speed bursts at a maximum 60 frames/sec. (max. 70 frames***)***&nbsp;16:9      S size onlyFull HD Movie (1080i/60fps)Thanks to the CMOS sensor, the FinePix XP60 can shoot 1920 x 1080-pixel full HD video, at a maximum rate of 240 frames/second. A dedicated movie recording button makes it easy to switch to movie recording mode with a single touch.High Speed MovieSometimes things happen too fast for you to see them properly with your own eyes. The FinePix XP60 can freeze the action at up to an amazing 240fps! So you can see every single minute detail and watch things happening step by step in slow motion.*&nbsp;High      Speed Movie can be recorded at the following speeds and sizes: 240fps (320      x 120 pixels), 160fps (320 x 240 pixels), 80fps (VGA 640 x 480 pixels).Scene RecognitionScene recognition is available during movie recording.Movie editThe camera also incorporates a number of advanced movie-editing features, including \"movie trimming\" to cut un-wanted footage from movies, and \"movie join\" to join multiple separate clips into a single movie.Noise cancellationNoise cancellation eliminates the sounds made by the zoom lens during recording.Bright and Clear LCD with an Anti-Reflective CoatingThe bright, clear LCD monitor is treated with anti-reflective coating to ensure excellent visibility, even in bright sunlight. LCD monitor brightness is automatically adjusted in response to lighting conditions to maintain optimal visibility and prevent unnecessary battery drain.Advanced FilterA selection of seven special filters lets you create distinctive photo effects. Filter effects can be verified on the LCD monitor to ensure you get exactly the results you're shooting for.Pop ColorToy CameraMiniatureSoft FocusPartial Color (Red/Orange/Yellow/Green/Blue/Purple)Cross ScreenHigh-Key&nbsp;Motion Panorama 360Select &ldquo;Motion Panorama 360&rdquo; mode, press the shutter button and sweep the camera to pan the scene. The FinePix XP60 cleverly produces a stunning 360&deg; panorama shot, effortlessly and automatically!&nbsp;3D Shooting with \"Individual Shutter 3D\"Two exposures of the same scene are saved in Multi-Picture Format (MPO) to create convincing images that appear to have been shot in real 3D. An overlapping guide on the LCD screen provides assistance for positioning the exposures, making it easy for anyone to create impressive 3D effects. And FUJIFILM's proprietary high-resolution 3D print system produces natural, beautiful 3D prints from images captured with the FinePix XP60.Versatile Shooting ModesIn addition to a wide range of shooting modes, the FinePix XP60 offers a selection of versatile scene positions that ensure optimum results no matter what the scene.Tracking Auto FocusKeeps fast moving subjects in the frame and in focus, even at 5x zoom extended. Great for capturing dynamic close-ups.Pro Low-light ModeIdeal for shooting non-moving subjects in low light, this mode automatically takes a series of four high-sensitivity &amp; low-noise exposures and then combines them into an image with less noise than the single exposures.Dynamic Range (HDR)This mode uses Multi Frame technology to capture three consecutive photos shot at high speed-under-exposed, normal exposure, and over-exposed. The three images are then layered to an optimum balance of detail in shadow and highlights, eliminating \"blackout\" or \"washout\" and producing pleasing, natural gradations.Natural Light and with FlashCan't decide whether it's best to use flash? Choose this mode, press the shutter and automatically capture the same scene twice: once with high sensitivity and natural light, and the second time with Intelligent Flash. Later choose one or keep both!Face DetectionFace Detection optimizes people pictures by identifying faces and adjusting focus and exposure to ensure bright, clear results.Red-eye Removal in Detected FacesRed-eye removal automatically detects and corrects flash reflection for a perfect end result.Instantly Detect up to 6 Faces!The Face Detection can simultaneously recognizes up to 6 faces in a photo. Share your group portraits using the zoom up function in playbacks, checking each detected face. Each priceless expression can be cropped and saved in clear high resolution results.Face Detection Timer FunctionThe Face Detection Self-timer automatically sets off after the number and position of faces in a scene are detected, snapping the photo at the right moment, with the faces in focus and properly exposed.Share your images with built in social networkingDon't wait until you get home to start choosing which pictures to upload to FACEBOOK. Start the process in camera by tagging the pictures you want to share. The next time you connect to your home computer your images will upload automatically. The same goes for movie clips too, which can also be uploaded to YouTube&trade;.Easy Web Uploading to YouTube&trade; and FACEBOOK via MyFinePix StudioIt's as easy as one, two, three. Shoot pictures and tag them for upload to your FACEBOOK profile page or YouTube&trade; account.UploadWhen the FinePix XP60 is connected to a PC, the marked images are uploaded to the designated site, eliminating the need for time-consuming PC-based image processing or selection.MyFinePix Studio Automatically Searches for New Images to Upload for YouMyFinePix Studio detects new images to upload. When finding new image to upload, the uploader starts automatically.", "title": "Fujifilm FinePix XP60 16.4MP Digital Camera with 2.7-Inch LCD (Red)", "price": 199.99, "salesRank": {"Camera &amp; Photo": 1775}, "imUrl": "http://ecx.images-amazon.com/images/I/51%2BZFvYJuYL._SY300_.jpg", "related": {"also_bought": ["B00B605XC8", "B003CK10DG", "B00CXXP5FC", "B003VNKNF0", "B00B6060O8", "B0014E02AO", "B001RFT698", "B006C0S9AK", "B00F0XRQGS", "B003VNKNEQ", "B004OEQKI4", "B0037TA7TU", "B005HNF01O", "B00CV9LG06", "B0048FFHTC", "B004L1BL0M", "B00C6OJYQY", "B008VXF5CQ", "B007TWO9RW", "B00CYO8T30", "B005VF150S", "B00C6PH28K", "B006T7QVII", "B004O995AY", "B0029MN0EA", "B003ODU0P0", "B004THA3PW", "B00BQX5M9Y", "B005VF15HG", "B0039NLSAG", "B0014DURIW", "B001QBHT1K", "B006C0R2P8", "B004VSN338", "B003VKTGV0", "B003VNKNEG", "B007JRB0RE", "B003F7DWH8", "B001QBJRY2"], "bought_together": ["B003VNKNF0"], "buy_after_viewing": ["B003VNKNF0", "B003CK10DG", "B00HGE3D2K", "B00HGE3CZS"]}}