{"asin": "B007V5A1BK", "categories": [["Electronics", "Computers & Accessories", "Data Storage", "Internal Hard Drives"]], "description": "WD VelociRaptor drives offer an unmatched combination of high performance and high reliability, perfect for workstations, high-end video and photo editing, low-end servers and performance enthusiast's systems. Comes with a 3.5-inch mounting frame for easy installation into today's high-performance systems and chassis. Ultra fast - Designed around a 10,000 RPM spin speed, these SATA 6 Gb/s drives include a 64 MB cache and deliver the ultimate performance for photo and video editing. Rock-solid reliability - With 1.4 million hours MTBF, these drives have the highest available reliability rating on a high capacity SATA drive. High capacity - State-of-the-art technology delivers a balance of high performance and high capacity perfect for data-intensive workloads that require large amounts of storage such as video editing, 3D rendering and scientific modeling. Ultra-cool operation Consumes less idle power and uses similar active power as the previous generation WD VelociRaptor, while offering higher capacity and performance. Advanced Format (AF) Technology adopted by WD and other drive manufacturers as one of multiple ways to continue growing hard drive capacities. AF is a more efficient media format that enables increased areal densities. IcePack mounting frame - The 2.5-inch hard drive is enclosed in a backplane-ready 3.5-inch mounting frame with a built-in heat sink that keeps this powerful little drive extra cool when installed in high-performance desktop chassis. NoTouch ramp load technology - The recording head never touches the disk media ensuring significantly less wear to the recording head and media as well as better drive protection in transit. Pre-emptive Wear Leveling (PWL) - Ensures reliability for applications that perform a high incidence of read/write operations at the same physical location on the disk.  Rotary Acceleration Feed Forward (RAFF) - Optimizes operation and performance when the drives are used in vibration-prone, multi-drive chassis. Environmentally Conscious - In addition to being RoHS compliant, this generation of WD VelociRaptor also provides a halogen-free design.", "title": "WD VelociRaptor 250 GB Workstation Hard Drive: 3.5 Inch, 10000 RPM, SATA III, 64 MB Cache - WD2500HHTZ", "price": 94.28, "imUrl": "http://ecx.images-amazon.com/images/I/51SS4q5KyvL._SY300_.jpg", "brand": "Western Digital", "related": {"also_bought": ["B0033Z2BAQ", "B00H09BOXQ", "B008968L6M", "B000OGX5AM", "B009GUXU52", "B00FJRS6FU", "B00J8E8ZOC", "B001CY0P7G", "B00FJRS628", "B003FW9T0M", "B002YIG9AQ", "B0093H8GQG", "B00CO8TBQ0", "B002BH3Z8E", "B00E3W1726", "B004Q0PT3I", "B00F3ZN0CC", "B003SANWI6", "B008Y8PON8", "B004F3CWK4", "B00FE29IWK", "B00F3I7HNM", "B008JJLZ7G", "B008JJLXO6", "B001R4BT1M", "B00J2LIF2S", "B003NREDC8", "B00G57BN1M", "B009O7YUF6", "B004DDI0IE", "B006EWUO22", "B009NB8WRU", "B00ERJXTE4", "B00461G3MS", "B0088PUEPK", "B007SZ0EOW", "B0085MPDCU", "B00DSUTVYK", "B009O7YORK", "B00030DEQE", "B00EMHM672", "B00E3W15P0", "B003SARYDK", "B009NB8WR0", "B005T3GRN2", "B0092ML0OC", "B0000BVYT3", "B00HK8V0YK", "B007SZ0EHE", "B00EUAFAF6", "B003N8GVUY", "B009GXZ8MM", "B000ANF8FO", "B00DSUTVK4", "B00FCKCJ6Q", "B0092ML1SC", "B008YAHW6I", "B0094NXBZ0", "B004PQBT8C", "B001Q7X0Z8", "B008RJZQSW", "B004UC4HCG", "B007ZWLRSU", "B00CXIVEA2", "B0036Q7MV0", "B0087EVHVW", "B004SUO068", "B00H09BB16", "B005CGDPHM", "B008B6ONXK", "B00EUTW24E", "B004CSIG1G", "B005I4LLJM", "B00A1ZTZOG", "B0057Q4ADU", "B00CE58ZYC", "B00BQ4F9ZA", "B00H09BO2M", "B004ASW73G", "B0027JQI9O", "B00G6TAAWC", "B004SUO3VK", "B00D78Q2DQ", "B0011A4UZE", "B003BYRO7E", "B0049MPQA4", "B004EIUTFK", "B00EDT01TO", "B003D3MFHM", "B00D6KOU66", "B008O510FW", "B0092ML0MY", "B008I647MA", "B00H09C0U2", "B003SALVN4", "B003EKT9NM", "B00H09CF70", "B007EM7N70"], "bought_together": ["B0033Z2BAQ"], "buy_after_viewing": ["B0088PUEPK", "B00E3W1726", "B00FJRS6FU", "B002BH3Z8E"]}}