{"asin": "B000CS7U1C", "description": "The ZEN Vision:M MP3 and Video Player lets you take all your movies, music, and photos in a light, pocket-sized device that is loaded with 30 GB of memory. At this capacity you can carry tens of thousands of photos, 120 hours of movies (500 Kbps MPEG4-SP), or up to 15,000 songs (WMA encoded at 64 Kbps), all in the palm of your hand. You can also tune in the radio (32 station presets), record your favorite talk show, or make personal voice memos with the built-in microphone.The ZEN Vision:M can hold thousands of songs, photos, and movies in its 30 GB memory.View larger.See the ZEN Vision:M in 3D.Today's big-screen blockbuster, yesterday's picnic home video, and even your favorite TV shows--they all now fit in your pocket and are ready to be shared. ZEN Vision:M supports many video formats, such as AVI, DivX 4 and 53, XviD4, MPEG-1, -2, -SP, WMV9, and Motion-JPEG, which simply means you have more choices and less restrictions. Instead of busting out your wallet to show snapshots of your kids, you can enlist the ZEN Vision:M to give viewers a glimpse of your precious memories--tens of thousands of them. In 262,144 vivid colors and 320 x 240 resolution, complete with a thumbnail gallery, this device makes it easy to scroll through your entire photo collection. Of course, music files are a big portion of anyone's digital canvas. Perfect for taking with you on the road or just around the house, this device makes all your music sound as good as the ZEN Vision:M looks. And with eight preset EQ settings and 97 dB signal-to-noise ratio, you can fine-tune your listening experience for any musical genre.You can also connect the ZEN Vision:M to a projector or TV with the included AV cable, and put on a big show from this little device. Synchronize music files with photo or video montages for a taste of spectacular, personalized big-screen magic. Viewing images on this device is a pleasant experience. The 2.5-inch, high-definition LCD screen features a 320 x 240 resolution and hundreds of thousands of colors. What this means is you see crisp, clear detail in every movie and photo, even under bright light.Creative didn't skimp on design, either. The ZEN Vision:M features an ergonomic design with an innovative touchpad control that enables quick, comfortable access to menus and settings. And you'll get loads more playback time with the built-in rechargeable battery. Enjoy up to 13 hours of music or 4.5 hours of movies on a single charge. The optional extended-life battery pack lets you double playback time, so you can enjoy days of uninterrupted entertainment. Other features include a personal organizer that you sync with Microsoft Outlook and an integrated voice recorder that can store hundreds of hours worth of recordings. Take a closer look at all theZEN Vision:M features.The ZEN Vision:M MP3 and Video Player uses PlaysForSure technology. Look for the PlaysForSure logo if you're shopping for a portable music or video device and you want to make sure the digital music and video you purchase will play back on it every time. Match the PlaysForSure logo on a large selection of leading devices and online music stores. If you see the logo, you'll know your digital music will play for sure. Choose from a large number of digital music and video stores, including MTV's Urge, Rhapsody, Yahoo!, MSN Music, MusicMatch, MusicNow, Napster, Wal-Mart Music Downloads, and many more.What's in the BoxCreative ZEN Vision:M, earphones, sync adapter, USB 2.0 adapter, pouch, user's guide, and installation CD. Note: As of July 2006, Creative no longer ships the ZEN M with the AC power adapter.", "title": "Creative ZEN Vision:M 30 GB MP3 and Video Player (Black)", "price": 46.99, "imUrl": "http://ecx.images-amazon.com/images/I/412PHJJPDSL._SY300_.jpg", "related": {"also_bought": ["B000RBDTEG", "B000R23ER2", "B001IK0T16", "B000ENOR8Y", "B001BJLEBS", "B003TLR2RQ", "B000NK9MCY", "B002KVTKO4", "B000V5GHME", "B000GWIEGO", "B0011YIN2Q", "B0021ZW75I", "B000IF4TPY", "B000PHLGTM", "B000I0Z4US", "B000FEROIC"], "buy_after_viewing": ["B002MAPS6W", "B0030LSFS0", "B00ECQUY2M", "B009QZH7BU"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}