{"asin": "B00113PUJQ", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]], "description": "More music than you can possibly imagineThe Creative Inspire T10 redefines your listening experience. Boasting an elegant stylish look coupled with clear pristine audio, the compact Inspire T10 packs a formidable performance in a two-way speaker design.Start hearing detail in your music that you have never heard before. High frequency instruments such as strings and cymbals can now be picked out, thanks to the dedicated tweeters. Even seismic drumming can now be felt with the unique BasXPort technology which delivers vivid bass effects that can match a speaker system with a subwoofer. Revel in a speaker system without sacrificing performance and extra space.Get ready for a phenomenal performance that promises more body, balance and a greater naturalness to your music.Music to match your styleA perfect combination of style and performance, the Inspire T10 is a revolutionary breakaway from traditional speaker design. With a glossy finish augmented by an acoustically slanted front, the Inspire T10 re-introduces desktop speakers in a whole new light, be it for your PC, Mac or MP3.More music, more detailImagine being able to pick up even the soft clamour of a \"Ride\" cymbal in a slow rock song. With a dedicated tweeter and two-way design, you can fully appreciate performances that are rich in high frequencies, such as those with clarinets and strings.All bass, less spaceThe exclusive space-saving BasXPort means you don&#39;t really need an additional subwoofer to enjoy deep bass music. Acoustically engineered to enhance the lower midrange, BasXPort channels the sound waves efficiently from the inner chamber to the soundstage. What you get is music that has more weight - without a third box.Extended listeningThe built-in headphone jack and AUX In connector makes it easy to plug in your headphones for private listening, or play music from your MP3 player or any other analog audio devices.", "title": "Creative Inspire T10 2.0 Multimedia Speaker System with BasXPort Technology", "price": 32.99, "imUrl": "http://ecx.images-amazon.com/images/I/41bLpPWoV0L._SX300_.jpg", "brand": "Creative Labs", "related": {"also_bought": ["B001S14DYO", "B0088PUEPK", "B0028N6YH0", "B001RNOHDU", "B0090UFITO", "B00FJRS628", "B003NR57BY", "B004Q0PT3I", "B0000ZQTCS", "B00H09BOXQ", "B006JH8T3S", "B00E3W1726", "B003HE260I", "B00BQ8RM1A", "B00C6MNQ92", "B00ALYOPSS", "B003VAHYNC", "B009NB8WRU", "B000UD4LIY", "B003VAGXZC", "B00FJRS6FU", "B005BZNDS0", "B0041QBAIA", "B00006B8CX", "B00CIDFP70", "B000IF4788", "B005O65JXI", "B0019804U8", "B003ELVLKU", "B001TH7T2U", "B000Z80ICM", "B005EORRBW", "B000J2EN4S", "B009ZN2NH6", "B00A1ZTZOG"], "bought_together": ["B0088PUEPK", "B005O65JXI"], "buy_after_viewing": ["B0028N6YH0", "B001RNOHDU", "B00EZ9XKCM", "B003CP0OT2"]}}