{"asin": "B000EXTXSI", "description": "Amazon.com Product Description Is your computer loaded with photos, music, video, and all sorts of important files? If so, you should make extra room, back them up, and keep them safe on Western Digital's WDG1C5000 My Book Premium Edition 500 GB Hard Drive. This reliable, easy-to-use external hard drive is the perfect storage solution for all your precious digital assets.Save and back up all your digital assets with the My Book Premium Edition Hard Drive.View larger.Simple, easy-to-use design.Hard drive features dual interface connectivity (FireWire 400 and USB 2.0).View larger.The elegant case takes up very little space.Installation is a breeze because you don't really \"install\" anything -- just plug it in and it's ready to use. There is not even an installation CD because all the included software loads automatically from the hard drive the first time you plug it in. For cream-of-the-crop, high-speed performance, use My Book Premium's FireWire 400 interface. However, if FireWire 400 isn't convenient, Western Digital has you covered -- the My Book Premium hard drive is also compatible with USB 2.0 connectivity. Best of all, you don't have to choose between one or the other because both interfaces are built into every drive.Western Digital provides software (WD Backup) that makes backing up your data as easy as possible. With a few simple steps you can back up all your data files, or just save your picture and music files. You can also schedule routine backups so you don't have to worry about it ever again. Built for ease of use, this drive is equipped with a capacity gauge that shows how much space is left on your drive. The My Book Premium also includes intelligent drive management features. For example, the drive turns itself on and off with your computer, and Safe Shutdown prevents the drive from being powered down until all your data has been written.But that's not all. Western Digital uses a smart design to make the My Book Premium look as good as it performs. The elegant case resembles a book and takes up very little space on your desk. Plus, it stacks horizontally and allows two or more drives to nestle neatly together like encyclopedias on a shelf. Inside the stylish exterior is an exceptionally fast, ultra-quiet, cool-running hard drive. Last but not least, the My Book Premium is equipped with free Google software that searches your drives, manages your photos, and simplifies Web searches.My Book Premium Edition Hard Drives are ideal for:High-speed backup of important documents and imagesExtra storage for your computerAutomatic backups of your existing hard driveArchiving the music stored on your MP3 playerAdding plenty of space for digital video capture and editingSaving and organizing your digital photo collectionNote:For basic, less expensive storage option without automatic backup software, consider theMy Book Essential Edition 500 GB Hard Drive.What's in the BoxMy Book Premium 500 GB USB 2.0/FireWire external hard drive, USB cable, FireWire cable (six-pin to six-pin), AC adapter with power cord, and quick install guide.", "title": "Western Digital My Book Premium 500GB USB/FW 400 Ext Hard Drive", "price": 199.0, "imUrl": "http://ecx.images-amazon.com/images/I/31RDZGEB52L._SY300_.jpg", "related": {"also_viewed": ["B000WGSAAE", "B000XRK3LG", "B000EXRSVM", "B00CI3BISU", "B005J7YA64", "B005J7YCHG", "B004CG4WOI", "B006Y5UV36", "B006Y5UV4U", "B009R66E9O", "B000VZCEUI", "B00006IBHN", "B005WKKE3Q", "B003ELOSEG", "B00KPRWAX8", "B0085JRRAY", "B000ND75C0", "B005J7YA4G", "B00ARJD56K", "B00834SJSK", "B00E3RH5W2", "B00EAS8AA0", "B00CI3BLPA", "B00E83X9P8", "B00E055H5O"], "buy_after_viewing": ["B0078PV9GO", "B0041OSQBG", "B000J01I1G", "B0030BBH5I"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]]}