{"asin": "B0044DEDC0", "related": {"also_bought": ["B0044DEDCA", "B00D69U1B0", "B002FI7GWK", "B005FKT70O", "B0054L8GVK", "B00BWF5U0M", "B001MSS6CS", "B004275EO4", "B000LP0R3E", "B001EHG7DM", "B002R33VWW", "B00392PQT6", "B00EO6X4XG", "B00EO6X7PG", "B00IRVQ0F8", "B0093L6SCG", "B002PAOMSY", "B00EO6X9YA", "B00EZT7RE4", "B000N35A0Y", "B007O59Z7I", "B00HTAH3KY", "B0036VO4X4", "B00CKLZHMI", "B00H09BOXQ", "B008MR2EGG", "B000TGT4OS", "B0045JHJSS", "B000TH3ALK", "B001EAQTRI", "B00FXMGC5M", "B00BQ8RM1A", "B0077L2WCY", "B0036VO4XO", "B00FB45ZDM", "B00C9TEBJQ", "B001S14DYO", "B000RTPBWQ", "B009XDWUCQ", "B007TMZ1BK", "B00B4QESVQ", "B009JXKQ9O", "B001TH7GUU", "B008MRZSH8", "B00EUUKVXM", "B000068O3B", "B00DJCB83O", "B007HISGRW", "B008I646WG", "B006W41X36", "B00HWHVOC2", "B008ZGKWQI", "B00BQ8RFAI", "B00EZB23LE", "B000068O17", "B0027VT6V4", "B00CO8TBNS", "B0031U1ATQ", "B007S642BW", "B006YG89Q6", "B005HGM1D6", "B008IFXQFU", "B001R76D42", "B00E3W1726", "B001E0JH5E", "B004LU156S", "B00029MTMQ", "B004YDUZ22", "B00BQ8RHMO", "B001FY7LBQ", "B00E7QGHE6", "B00CQ35C1Q", "B00BFOEY4I", "B0028Y4F4S", "B004M8RWDE", "B00683X4PQ", "B0001ARCFA", "B0096KSBB0", "B003CP0OT2", "B009ISU33E", "B00E3W15P0", "B000RATBWQ", "B005L38QK2", "B003Y24DEU", "B00ETD2KGQ", "B004SP0WAQ", "B00G500AE0", "B005LDLVAO", "B007B5YUMQ", "B006JH8T3S", "B001J30FZM", "B0002H0H4A", "B00BQ8RKT4", "B0092QJRPC", "B00C2DL96W", "B006GG1Q7I", "B00BP5KOPA", "B0058DOWH6"], "bought_together": ["B00BWF5U0M"], "buy_after_viewing": ["B001MSS6CS", "B0044DEDCA", "B00IRVQ0F8", "B0054L8GVK"]}, "title": "Creative Sound Blaster X-Fi Go! Pro USB Audio System with SBX SB1290", "price": 22.06, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31tudwHNXgL._SY300_.jpg", "brand": "Creative", "categories": [["Electronics", "Computers & Accessories", "Computer Components", "Internal Sound Cards"]], "description": "Take immersive, THX-enhanced sound wherever you go with the Creative Sound Blaster X-Fi Go! Pro USB audio system. This thumb-sized USB sound card adds high-definition audio to any PC or notebook with a USB 2.0 port. The plug-and-play card features THX's TruStudio Pro technology, which enhances audio depth, improves bass response, and provides multichannel sound. And thanks to EAX 5.0 technology, your games will sound more realistic than ever before.Note: this sound card is not compatible with Mac systems.Sound Blaster X-Fi Go! Pro USB Audio System with THX SB1290At a Glance:Portable, plug-and-play USB sound card enhances audio performanceTHX TruStudio Pro for high-fidelity, surround sound audioEAX 5.0 technology for seamless, immersive gaming audioTwo 3.5 mm stereo jacks for connections to microphones, headsets, and speakersBacked by a one-year limited warrantyFeatures two 3.5 millimeter stereo jacks for connections to a variety of devices.View larger.Ports support connectivity to a variety of devices.View larger.Compact, Portable Sound UpgradeNo larger than a typical USB flash drive, The X-Fi Go! Pro can easily slip into your pocket. An ideal companion for any laptop, the Pro manages to be portable without sacrificing sound quality or functionality. The card can also be used with a home desktop for a quick audio upgrade.THX-Enhanced Sound for Your PCWhen you connect the X-Fi Go! Pro to your PC, you'll immediately notice an improvement in audio performance. The card utilizes TruStudio Pro, an audio technology developed by THX. This technology works to expand your PC's audio channels, which allows surround sound content to be reproduced faithfully, making audio more expansive, immersive, and realistic. Even if you're listening through headphones, you'll experience full audio immersion.In addition, TruStudio Pro uses a variety of techniques to make your music sound livelier. It restores your music's natural frequency range--something that is often lost when music is compressed into MP3 format. It also fills in low frequencies, which adds a little extra impact to bass. You'll be able to enjoy higher quality audio, even when streaming MP3s from your music library.EAX 5.0 Enhances Gaming Audio and PerformanceThe X-Fi Go! Pro has been specially engineered to handle gaming applications. Using hardware-accelerated EAX 5.0 technology, the sound card delivers crisp, deep audio that will fully immerse you in the game. The car also supports OpenAL and Creative ALchemy software to further enhance surround sound in gaming.In addition to enriching your gaming audio, using the X-Fi Go! Pro will boost your PC's gaming performance as a whole. By functioning as a dedicated sound unit, the card frees up resources that would otherwise be tied up in audio processes. This allows your PC to dedicate more of its processing power towards other tasks, like graphical and AI processing. The result is a gaming experience free of hiccups and slowdowns.Supports Microphone, Speakers, and HeadsetsThe X-Fi Go! Pro includes two convenient 3.5 mm stereo jacks, one input and one output. This allows you to connect the card to any auxiliary device with a 3.5 mm adapter, including microphones, speakers, and headphones.With the X-Fi Go! Pro, communicating via headset is easier and clearer. The card features built-in silencer drivers, which reduce background noise when you're speaking into the microphone. It also features several built-in VoiceFX presets, which can be used to morph and disguise your voice. The Creative Silencer functionality requires use of a Creative proprietary dual-microphone headset.Compatibility and System RequirementsThe X-Fi Go! Pro sound card is compatible with Microsoft Windows XP (Professional x64 Edition, Service Pack 2 or above), Windows Vista, and Windows 7. (The card is not Mac compatible.)To use the card, you'll need an Intel Core 2 Duo or AMD equivalent processor, 2.2 GHz or faster; 1 GB RAM; at least 600 MB free hard disk space; an available USB 2.0 port; and a CD/DVD drive for software installation.The X-Fi Go! Pro is backed by a one-year limited hardware warranty.What's in the BoxX-Fi Go! Pro USB sound card, USB cable, quick start leaflet, and installation CD.Creative Sound Blaster Sound Cards (External)Looking for internal sound cards from Creative?Clickhere.Sound Blaster X-Fi Go! Pro USB Audio System with THX SB1290Sound Blaster X-Fi Surround 5.1 Pro USB Audio System with THX SB1095Sound Blaster X-Fi HD USB Audio System with THX SB1240General Info:Connection TypeUSB 2.0USB 2.0USB 2.0Speaker/Headphone SupportStereoStereo to 5.1 SurroundStereo with dedicated headphone amplifierMusic and Movies:24-bit Sound QualityTHX TruStudio ProDolby Digital LiveDTS & Dolby Digital Decoding via free PowerDVD DownloadPhono Preamp for Direct Recording from VinylGames:EAX SupportEAX 5.0X-Fi CMSS-3D Headphone Surround"}