{"asin": "B000HCMR8E", "description": "Continuing its illustrious history,Ridge Racer 7returns as a title on the PlayStation 3 platform. Drift around corners at speeds over 160 mph taking the lead asRidge Racer 7brings gamers a driving experience unlike any other. With a new platform comes new territory asRidge Racer 7promises to reinvent itself, allowing players to choose from 40 different machines and over 20 courses. With reversed courses, the total grows to over 40, most in the series ever! Players can further enjoy the drift racing experience by taking part in the new customization mode, opening up the experience with up to 375,000 visual customization and 7,150 tunable combinations. With full support of Sony's new network service,Ridge Racerfans have an entirely new world to explore and drift through!The classic drift racer debuts on the PlayStation 3.Decals can add a fun look to your car.View larger.Nitrous tuning can pay off big time.View larger.Motion blur increases the feeling of speed.View larger.More tracks than ever before.View larger.Create the ultimate rideThe classic drift racing game returns to the PlayStation brand in style and with loads of new customization features. In exterior creation mode, players can select, view, and apply body kits for almost any area of their car. Kits include lowers, lifts, airflow and even major body modification. Once the kits are applied, players can head to the paint and body shop to have their specific paint tone applied as the backdrop for their killer custom decals. If you're ride still isn't hot enough, consider adding some wheels from the wheel shop for that extra bit of style.If exteriors aren't your thing, then consider fine tuning the handing. Customizable Handling mode allows you to tweak cornering performance by adjusting tire pressure and suspension to your chosen settings. Feel the turns with sport suspension or soften the landings with something more touring oriented. Either way, you can pick just the right feel for your favorite track, rival racer, or experience level.Nitrous boosts have always been a central part to any racers' strategy, but beforeRidge Racer 7there wasn't any control over the type or amount of gas. Now, you have total control over such minutiae as the number of tanks, charge rate, even total boost limit. If you prefer to have more control over nitrous while racing, consider the new \"flex nitrous,\" which can be turned off or on at the driver's discretion.Improved cars, improved performanceA wide range of sports cars are available inRidge Racer, with over 40 to choose from. Including the customization options listed above, each car has over 200,000 variations in terms of control and appearance. Debuting in this title are two impressive sportsters: the Centellee and the Magnifico. The Centellee from Terrazi Motors blasts off the line with a 4000cc V8 engine and has an unbelievable top speed of just over 210 mph. Not to skimp on looks, the body of the Centellee is hand-crafted and recreated perfectly on-screen.Another other welcome addition to theRidge Racerfamily is the Magnifico, known the world round for its unmatched luxurious interior. One of the new generation of light bodied sports cars, the Magnifico can ramp up to 178 mph via a 2000cc 4-cyvlinder inline engine.On the track, the cars still accelerate and drift in that quintessentialRidge Racerarcade style. Large, sliding turns and short bursts of air are the name of the game as you speed past your opponents in a blur of color. The track count for this installment has been pushed to an astonishing 44- more tracks than any any previousRidge Racertitle. The variety of locales is truly astounding, as you'll be racing by rushing waterfalls one minute and near the top of a snow-capped peak the next. The track layouts have something for every racing fan and style.Ridge Racer 7grabs the PlayStation 3's processing power and doesn't let go. Running in 1080p high definition video at 60 frames per second, the courses look lusher, the tracks feel faster, and the cars look gorgeous.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51WKYm1ZONL._SY300_.jpg", "related": {"also_bought": ["B000MUW98O", "B00488PZ2S", "B00149V3CU", "B001TORSHO", "B000FPOJOS", "B000JHMJDA", "B002ACFYUM", "B000RI17CA", "B006JKARN0", "B001AS4TTE", "B0093FO2TS", "B0033PKTCS", "B003R7H5TC", "B0050SWSQQ", "B003UT9XI8", "B002AQLQM8", "B004X56PWK", "B000QL0T36", "B008YTAJLO", "B00004TKMB", "B0093FMS3U", "B000AMF76A", "B00JXDJVHS", "B007NUQIGK", "B000KELUA0", "B002BSA1C6", "B002I0JLPU", "B005EW61MA", "B0012N5MIO", "B000MIP72G", "B004K7AOYG", "B002BH3N2C", "B000IONGWM", "B00170BV6E", "B001441550", "B002BRZ7JE", "B003LXM1IM", "B00CRL9TU2", "B003171CEW", "B00BJ60LEY", "B002I0K6DG", "B002EJVTC8", "B003IEBO9Q", "B003O6FXFY"], "bought_together": ["B006JKARN0"], "buy_after_viewing": ["B006JKARN0", "B000MUW98O", "B00488PZ2S", "B000RI17CA"]}, "salesRank": {"Video Games": 8440}, "categories": [["Video Games", "Kids & Family", "PlayStation 3", "Games"], ["Video Games", "PlayStation 3", "Games"]]}