{"asin": "B000BI7NHY", "related": {"also_bought": ["B000I1D2M4", "B0009RGLSE", "B000BUTH4E", "0072263792", "B0003V577C", "B00487D2Q0", "B0007VMROE", "B001653Z1O", "B0001W05IE", "B004879HXM", "B002LAW208", "B000EG4GLY", "B000BUOU4G", "B0010B1I3G", "B00063ZVJQ", "B0007T9IUW", "B00448LFIK", "B000BGRRXQ", "B004877N9M", "B002MH22KU", "B000YTRXGQ", "B000BUQQ3O", "B000UK5KIC", "B000WMEC1E", "B000BQ7GW8", "B00006IE59", "B00016WPLK", "B000095SMW", "B0000DB4D1", "B004879I6I", "B00062GJ8O", "B004WLPY90", "B000P5AJXI", "B0000E2Y2W", "B000BKBHJM", "B000UCZHWO", "B004879I90", "B008I638AM", "B0000E1718"], "bought_together": ["B0009RGLSE", "B000I1D2M4"], "buy_after_viewing": ["B0007VMROE", "B000I1D2M4", "B000BUTH4E", "B001653Z1O"]}, "title": "Palm TX Handheld", "price": 124.99, "salesRank": {"Electronics": 22699}, "imUrl": "http://ecx.images-amazon.com/images/I/51G2VP9TBJL._SY300_.jpg", "brand": "Palm", "categories": [["Electronics", "Computers & Accessories", "PDAs, Handhelds & Accessories", "PDAs & Handhelds"]], "description": "Created for today's fast-paced mobile landscape, the sleekly lightweight Palm TX handheld keeps you connected to your most important data--from email to files stored on your office PC--while you're away from your desktop with built-in Wi-Fi and Bluetooth wireless connectivity. It also features a high-resolution 320 x 480-pixel screen (with portrait and landscape orientation modes), a fast Intel 312 MHz ARM-based processor, expansion slot for Secure Digital (SD), MultiMedia (MMC), and Secure Digital I/O (SDIO) cards. The 128 MB of non-volatile flash memory (of which approximately 100 MB is available for files and software)  protects your documents and information, even if the device is not charged and the power runs down. And, of course, the Palm TX features Palm's suite of information management applications, the ability to edit Word- and Excel-compatible files, and synchronization with Microsoft Outlook (Windows only).Built-in Wi-Fi and Bluetooth Wireless ConnectivityStay connected easily when you're on the go with the built-in Wi-Fi wireless connectivity (802.11b), which enables you to access email and browse the Web at hotspots such as at coffee shops and in airports, or in your office if you have a wireless LAN network. You can even retrieve documents from your main computer with the included WiFile LT software. The Palm TX also comes the following enhancements:Added ability for the device to scan for available networksImproved connection logic to automatically connect to  available compatible networksThree steps to easily set up a new network connectionA free 30-day subscription to all T-Mobile Wi-Fi hotspotsWith built-in wireless Bluetooth connectivity (version 1.1), you can synchronize the Palm TX with a Bluetooth-enabled computer from across the room (within a range of 10 meters, or approximately 30 feet). But that's just the start. Using a compatible Bluetooth-enabled phone, you can send and receive e-mail and connect to the Web, send multimedia (MMS) or text (SMS) messages, and even automatically dial any number in your handheld's Contact's application. (You can also synchronize data the \"old-fashioned\" way via the USB connection at the base of the handheld.)For mobile professionals, the Palm TX provides all the conveniences of managing email on the road. With Wi-Fi access or Bluetooth technology, you can check corporate or campus email as well as personal accounts; download, read and edit a Word or Excel report on the fly; synchronize Outlook contacts, calendar, tasks and memos; and work with Microsoft Exchange ActiveSync, using VersaMail software, to synchronize email and calendarExpansion CapabilitiesThe expansion card slot for MMC, SD and SDIO formats lets you insert a memory card from a digital camera and view photos on the large, color display; you can even can add transitions between photos and present them as a slideshow. The Palm TX handheld's compatibility with SD Cards up to 2GB lets road warriors carry a few favorite home videos and be entertained on long trips.Support for Word, Excel, PowerPoint and PDF filesWith the included DataViz Documents To Go software, you rehearse your PowerPoint presentation discreetly in an airport, make last-minute changes to a Word document, and check the numbers in an Excel spreadsheet and update them on the spot. The Palm TX comes with support for native Word, Excel, and PowerPoint files. And with the included Adobe Reader for Palm OS, you can download and view converted Acrobat files.MultimediaThe Palm TX comes bundled with Pocket Tunes MP3 player for playing music files or Podcasts, which allows you to create and edit play lists, shuffle songs and navigate by album, artist or genre. The Palm TX also includes built-in software for viewing digital photos and video clips. And with MobiTV software (sold separately), you can view a wide range of television programs, including news, sports and entertainment, directly on the Palm TX handheld.Operating System and SoftwareVeteran Palm OS handheld users will immediately notice the new Favorites view, which provides easy access to applications, files, and folders. The installed Palm OS 5.4 also introduces the Files application, which enables easy navigation among folders and files. It uses the intuitive and easy-to-learn Graffiti 2 writing software to input data into the handheld (as well as an on-screen keyboard). Windows users can synchronize their calendar, contacts, tasks, and notes with Microsoft Outlook. The Palm OS features the following organizer applications:Contacts: Lets you store several addresses for each contact, and with new fields for more phone numbers, multiple e-mail addresses, instant messenger IDs, and Web sites.Calendar: Use the new Agenda view to see upcoming calendar events, tasks due, and important e-mail, and color-code your events to provide an easy way to reference your calendar in the Agenda, Day, Week, and Month views. Take more notes, or synchronize more details from your desktop, in the larger Memos and Notes fields.Tasks: Use tasks with alarms and repeating tasks to set reminders for important commients.CompatibilityThe Palm TX is compatible with PCs running Windows Windows 2000 (SP4) and XP (Outlook synchronization requires MS Outlook 2000, 2002, or 2003; sold separately), and with Macs running Mac OS 10.2.8 to 10.4.What's in the BoxPalm TX handheld, flip cover, USB sync cable, power adapter, 3-step setup poster, Graffiti 2 sticker, Software Install CD-ROM with Palm Desktop, Tutorial, Getting Started Guide, User Guide, and bonus software."}