{"asin": "B002DU15TU", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]], "description": "Featuring a pink color scheme, Creative's EP-630 In-Ear Headphones pack high-end, noise-isolating performance into a compact design. Built to deliver rich, full-bodied music and reduce distracting background noise, these stylish earphones come with a range of silicon ear tips to help you find the best fit.EP-630CIn-Ear Noise Isolating HeadphonesPinkAt a glance:In-ear design customized to reduce external noiseImproved clarity with 9 mm Neodymium magnet driversUninterrupted transmission with 1.2 m oxygen-free copper cableThree sizes of soft, silicon ear tips for custom comfortPink and white color schemeEP-630's are colorful, stylish, and designed for long-term listening comfort.View larger.Clear Transmission and Pristine Audio QualityThe EP-630 earphones' fantastic audio reproduction makes them an ideal pick for digital music playback and fatigue-free, long-term listening. Specially engineered, high-quality, 9-millimeter Neodymium magnetic drivers power their incredible sound. No matter what your favorite music genre is, these headphones offer optimum performance with deep bass and balanced tones.In addition, the EP-630's gold-plated, 1.2-meter, oxygen-free copper cable provides uninterrupted voice and music transmission from your favorite player to the earphones.Ergonomic Ear Buds for Comfort and Noise-IsolationHelping to ensure a crisp, pure audio experience wherever you are, the EP-630's ergonomic in-ear design reduces background noise and sound leakage significantly. Because comfort is so essential to enjoying high-quality audio, each pair of earphones comes with three sets of soft silicone tips, so you can select the size that fits best.The simple yet innovative design of these earphones showcases Creative's years of consumer research on listener comfort and extended use.Colorful Design Keeps Listening FunFor a look that's stylish and attractive, these earphones are finished in white and pink with subtle, silver on-ear accents.For days when pink isn't the perfect match for your personal style, EP-630s are also available inblack,white,blue, andgreen. Or, if you're looking for the same technology with added sophistication, try the sleek, black-and-chromeEP-650. Better yet, try theEP-630i, which integrates a discreet microphone so you can listen to music and make hands-free phone calls using your iPhone.The Creative EP-630C In Ear Noise Isolating Headphones are backed by a one-year limited warranty.What's in the BoxEP-630C earphones in pink and three sets of silicon ear tips.In-Ear Noise IsolatingHeadphonesEP-630CEP-630CEP-630CEP-630CEP-630CEP-630iEP-650Color Schemeblueblackgreenpinkwhiteblackchrome", "title": "Creative EP-630 In-Ear Noise Isolating Headphones (Pink)", "price": 14.89, "imUrl": "http://ecx.images-amazon.com/images/I/217hM4JkeXL._SX300_.jpg", "brand": "Creative Labs", "related": {"also_viewed": ["B004ZF0R22", "B004ZF0RQ8", "B00BI1DJU8", "B00BI1DIZE", "B00BI1DKCK", "B00CWFMVDA", "B00CWFMTQ4", "B00BI1DI5E", "B001GUY5V8", "B00B0CQCK4", "B0009G6FQI", "B002EL4MYI", "B001EZUQ5E", "B001EZYMF4", "B004SNCZ3K", "B004ZLUZOG", "B0018Z27NE", "B005EIVL5G", "B003EM8008", "B007UNOH0O", "B007136BMA", "B004ROGUMC", "B0018YYVUW", "B0043M9ATI", "B003EM2WAW", "B0015AM3A4", "B007TEQNAG", "B003EM6AOG", "B000LVIC58", "B003ELYQHK", "B002EL4MY8", "B005HP3PNM", "B003VNKKS0", "B00C30HUQ2", "B005EIVKLQ", "B007136AW6", "B003EM6AQE", "B007136DNW", "B004ZLV02C", "B005EIVL74", "B004U5DHE2", "B004ROGUNG", "B004E9SWM6", "B004U532KQ", "B008VGQ4VO", "B007PZSUF0", "B00DVH25E8", "B005HP3OB0", "B003EM800S", "B004S7Q8CA", "B005920DVA", "B00A6DK5Q0", "B003ELYQGG", "B007BY3OVU", "B007BY3OU6", "B007BY3PBE"], "buy_after_viewing": ["B004ZF0R22", "B003EM2WAW", "B003EM8008", "B002EL4MY8"]}}