{"asin": "B001FA1O0E", "description": "The iPod touch has always been an amazing iPod. And with its groundbreaking technologies--including a Multi-Touch screen, the accelerometer, and 3D graphics--and access to hundreds of games, iPod touch puts an amazing gaming experience in the palm of your hand. It comes in 8 GB, 16 GB, and 32 GB models with new volume controls and a built-in speaker. Play hours of music. Create a Genius Playlist of songs that go great together. Watch a movie. Surf the web. View rich HTML email. Find your location and get directions with Google Maps. Browse YouTube videos. And shop the App Store for games and applications.Millions of songs, thousands of videos, hundreds of games.Click to enlarge.MusicMusic on iPod touch not only sounds amazing, it looks amazing, too.Touch Your MusicRemember what it felt like to flip through your CD or record collection? Cover Flow brings that feeling back. Just turn iPod touch on its side and flick through your music to find the album you want to hear. Tap the cover to flip it over and display a track list. Tap again to start the music. Even view the lyrics while you're listening.A Musical GeniusSay you're listening to a song you really like and want to hear other tracks that go great with it. The new Genius feature finds the songs in your library that go great together and makes a Genius Playlist for you. You can listen to the playlist right away, save it for later, or even refresh it and give it another go. Count on Genius to create a mix you wouldn't have thought of yourself.Fill It UpFill up your iPod touch with audio and video from your iTunes library. All you have to do is choose the playlists, videos, and other content you want to sync, and iTunes does the rest.The iPod touch feels even better in your hand, thanks to the stunningly thin, contoured enclosure made of polished stainless steel.Just turn iPod touch on its side and flick through your music to find the album you want to hear.Click to enlarge.Carry hours of video with you, and watch it on a crisp, clear 3.5-inch widescreen color display.Movies and TV ShowsMovies and TV shows have never looked this good on a portable device.Everything's a Must-seeCarry hours of video with you, and watch it on a crisp, clear 3.5-inch widescreen color display. Need ideas? From Hollywood blockbusters to independent favorites, there's something for everyone at the iTunes Store. Download and watch movies with a few clicks. Prefer TV shows? Buy a single episode or an entire season's worth all at once.In ControlWhile watching your video, tap the display to bring up the onscreen controls. You can play/pause, view by chapter, and adjust the volume. You also can use the new volume controls on the left side of iPod touch. Want to switch between widescreen and full screen? Simply tap the display twice.Sync and GoNeed some entertainment for your next flight or road trip? With iTunes on your Mac or PC, you can sit at your computer and choose the movies and TV shows you want to sync to your iPod touch.GamesWith its groundbreaking technologies, iPod touch puts an amazing gaming experience in the palm of your hand.Get in the GameDevelopers all over the world are creating exciting games unlike anything you've ever seen on an iPod or mobile device. Many games come alive with stunning 3D graphics and immerse you in the action with the advanced technologies in iPod touch. There's even a built-in speaker, so you can hear all the action.Fingertip ControlMany games for iPod touch use Multi-Touch to give you precise, fingertip control over game elements. Use your finger to drag your pieces around the board in chess or dice games. Or pinch to enlarge or shrink your view, rotate your character left or right, or just tap to make a selection.Tilt, Turn, and GoThe built-in accelerometer actually responds to your movements, so you can tilt and turn your iPod touch to control the action. It's perfect for racing games--where your entire iPod touch acts as a steering wheel--and for tap-and-tilt games like Super Monkey Ball, in which your character rolls to your movements.The App StoreEven if games aren't your thing, there's an iPod touch application for you. Thousands of applications in almost every category--entertainment, social networking, sports, photography, reference, and travel--are a tap away at the App Store.Developers all over the world are creating exciting games unlike anything you've ever seen on an iPod or mobile device.Click to enlarge.The built-in wireless capability in iPod touch gives you access to the iTunes Wi-Fi Music Store, where you can choose from millions of songs with a tap.iPod touch features Safari, the most advanced web browser ever on a portable device.iTunes Wi-Fi Music StoreDiscover new music anywhere.Buy on the FlyThe built-in wireless capability in iPod touch gives you access to the iTunes Wi-Fi Music Store, where you can choose from millions of songs with a tap. Browse New Releases, What's Hot, and Genres. Take a look at Top Songs and Top Albums. Or find exactly what you're looking for with a quick search. Play a 30-second preview of any song, then tap once to buy it. Your music starts downloading instantly, and you can keep tabs on its progress by tapping the Downloads button.Sync it BackWhen you connect iPod touch to your computer, the music you bought on-the-go syncs to your iTunes library. If you've partially downloaded a song to iPod touch, your computer completes the download automatically.iPod touch at StarbucksIf you have an iPod touch, an iPhone, or a computer with the latest version of iTunes, you get free Wi-Fi access to the iTunes Store and to Starbucks' Now Playing content. Stroll into a participating Starbucks, and you're connected automatically.Home ScreenGet instant access to whatever you need on your iPod touch.Customize Your Home ScreenArrange the icons on your Home screen any way you want. Even move them to another Home screen. Create up to nine Home screens for quick access to the games and applications you download from the App Store and to your Safari Web Clips.Go HomeNo matter where you are on iPod touch, you can press the Home button to return to the Home screen. You can go back to what you were doing at any time.Add Apps, Web Clips, and MoreWhenever you download an application from the App Store, a new icon appears on your Home screen. And if you check the same websites every day, just create Web Clips and you can access the sites directly from your Home screen with a single tap. Not happy with how they're organized? Reorder them any way you want by dragging them around the screen.SafariiPod touch features Safari, the most advanced web browser ever on a portable device.Browse AnywhereThe iPod touch is the only iPod with 802.11b/g wireless access to the web. Whenever you're connected via Wi-Fi, you can access your favorite websites to read news, check scores, pay bills, and go shopping.Search and FindiPod touch syncs your bookmarks from your PC or Mac, so you can access favorite sites quickly. It has Google and Yahoo! search built in, so it's easy to find what you're looking for on the web.Zoom with a ViewGet a closer look at any web page by zooming in and out with a tap or a pinch of the Multi-Touch display. View websites in portrait or landscape. Rotate iPod touch 90 degrees and the website rotates, too.Clip it.If you check a website frequently--a favorite newspaper, blog, or sports site--why not create a Home screen icon for it? Make Web Clips with Safari, and your favorite sites are always just a tap away.Email on iPod touch looks and works just like email on your computer.When you're connected via Wi-Fi, you can get directions, find local businesses, and check traffic with Maps.MailEmail on iPod touch looks and works just like email on your computer.See it AlliPod touch supports rich HTML email, so images and photos appear alongside text. And you see email attachments in their original formats, not stripped-down versions. Rotate, zoom, and pan in more than a dozen standard file and image formats, including PDF; Microsoft Word, Excel, and PowerPoint; and iWork.Access it AllAccess your email from popular providers--including MobileMe, Microsoft Exchange, Yahoo! Mail, Google Gmail, and AOL--and most industry-standard IMAP and POP mail systems.Send FastiPod touch recognizes email addresses in different applications. If you run across an email address on a web page or a map listing, for example, just tap it; iPod touch opens a new message and addresses it for you.Type SmartWith its built-in dictionary, the intelligent iPod touch keyboard predicts and suggests words as you type, making it fast and easy to write email.MapsWhen you're connected via Wi-Fi, you can get directions, find local businesses, and check traffic.Find YourselfiPod touch finds your location using known Wi-Fi hotspots. It also finds points of interest by keyword: Search for \"coffee\" and iPod touch shows you every cafe nearby.Get DirectionsJust type in an address and get directions from wherever you are. View a list of turn-by-turn directions, or see a highlighted map route. You also can mark specific locations and find the best route between them.Enjoy the ViewJust like Google Maps on your computer, Maps on iPod touch lets you switch between views of Google map data, satellite images, and a hybrid of both. Multi-Touch makes the difference. Tap to zoom, pan, and change your view on the move.See TrafficMaps on iPod touch shows you live traffic information, indicating traffic speed along your route in easy-to-read green, red, and yellow highlights.Love to watch the latest YouTube videos? iPod touch gives you all the fun of the web's best videos--pocket-size.iPod touch uses iTunes to sync photos you have in iPhoto on a Mac or Adobe Photoshop Elements and Adobe Photoshop Album on a PC.Keep your schedule at your fingertips with iPod touch.Build your contacts list on your Mac with Address Book or on your PC with Microsoft Outlook, then sync everything to your iPod touch using iTunes.YouTubeLove to watch the latest YouTube videos? iPod touch gives you all the fun of the web's best videos--pocket-size.Share from AnywhereEmail your favorite videos to your favorite people. Tap \"Share\" on any YouTube video detail page, and iPod touch creates an email with the video link already in it.Watch What You WantExplore Featured, Most Viewed, Most Recent, and Top Rated videos. Or search for the video you want with a keyword search. Once you find what you're looking for, bookmark it to watch later.PhotosCarry up to 25,000 of your favorite photos everywhere.Share PhotosShow thousands of photos from the palm of your hand. Flick to scroll through thumbnails. Tap to view full screen. Rotate to see a photo in landscape. Pinch to zoom in or out. Play slideshows, complete with music and transitions. Email a photo to a friend, set it as your wallpaper, or share it in a MobileMe Gallery.Save PhotosIf you receive a great image in an email, save it to your photo library on iPod touch. Once there, it acts just like any other photo. You can set it as your wallpaper, share it on the web, or pass it on.Sync PhotosiPod touch uses iTunes to sync photos you have in iPhoto on a Mac or Adobe Photoshop Elements and Adobe Photoshop Album on a PC. Just choose which photos or albums to sync to your iPod touch, then you can look at them--and share them--anywhere you go.CalendarWith iPod touch, it's easy to make plans and stay on schedule.Add EventsKeep your schedule at your fingertips with iPod touch. Add events to your calendar. Set a custom alert. Write a note or two. Manage multiple color-coded calendars. And do it all with just a few taps.Stay in SyncConnect iPod touch to your computer, and the events that you've created on-the-go automatically sync to Microsoft Outlook on a PC or iCal on a Mac. And all the events you've added on your computer sync to iPod touch.Three Ways to ViewiPod touch gives you three ways to view your calendars. List view shows you all your appointments in the coming days as a comprehensive list, which you can scroll up and down. Day view displays one day's worth of appointments visually. And Month view offers an at-a-glance look at an entire month.ContactsPut names, email addresses, phone numbers, and more at your fingertips.Make ContactBuild your contacts list on your Mac with Address Book or on your PC with Microsoft Outlook, then sync everything to your iPod touch using iTunes. You also can add contact information directly to your iPod touch from maps, web pages, and email. Next time you sync, your computer is updated, too.Search ContactsIf you have a lot of contacts, a quick search shows you a list of matching names. Or you can scroll up and down your entire list to find the right contact. Want to send them an email? Just tap an email address and the Mail application opens automatically.Organized by GroupsIf you keep your contacts organized into groups--such as co-workers, friends, family, and so on--iPod touch will, too. And iPod touch can hold more than just names, email addresses, and phone numbers. You also can track birthdays, websites, nicknames, and notes.Stocks, Weather, and NotesStay on top of it all.Check StocksStocks on iPod touch shows you performance information for any stock you choose. When you want more details about a stock's performance, tap the Y! for instant access to Yahoo! Finance.Get WeatherCheck worldwide weather at home or away. Add the cities you want, then flick back and forth to get six-day forecasts for each. Tap the Y! to open a Yahoo! city guide that shows you what's happening, rain or shine.Take NotesForget the pen and paper. Use Notes on iPod touch to write yourself a quick note and keep important information on hand. There's even a built-in email function that lets you send notes to yourself or others.CalculatoriPod touch's calculator helps you settle the restaurant bill or keep track of your budget.Calculate SimplyWhen you tap the Calculator icon, iPod touch shows you a simple application with addition, subtraction, multiplication, division, and memory functions. Use it just as you would a pocket calculator.Calculate ScientificallyYour simple calculator doubles as a sophisticated scientific calculator. Just rotate it to landscape to access dozens of functions for solving complex science and math problems.iPod touch now includes built-in Nike + iPod support.Nike + iPodGet the most out of your workout.Tune Your RuniPod touch now includes built-in Nike + iPod support. Just slip the Nike + iPod Sensor (available separately) into your Nike+ shoe and start your run. The sensor communicates wirelessly with your iPod touch, tracking your time, distance, and calories burned. It even gives you voice feedback on your progress.Tune Your Cardio WorkoutThis feature also works with new cardio equipment available in many fitness centers. Just look for treadmills, ellipticals, stair steppers, and stationary bikes that are Nike + iPod compatible.Sync with Nikeplus.comWhen you get back to your computer, sync your iPod touch via iTunes and transfer your exercise data to nikeplus.com, where you can track your workouts, set goals, and challenge friends.Multi-TouchiPod touch features the same revolutionary interface as iPhone.Glide, Flick, PinchBuilt to take full advantage of the large 3.5-inch display, the Multi-Touch touchscreen interface lets you control everything using only your fingers. So you can glide through albums with Cover Flow, flick through photos and enlarge them with a pinch, zoom in and out on a section of a web page, and control game elements precisely.How it WorksThe Multi-Touch display layers a protective shield over a capacitive panel that senses your touch using electrical fields. It then transmits that information to the LCD screen below it. iPod touch software enables the flick, tap, and pinch.Type with the Touchscreen KeyboardiPod touch features an intelligent touchscreen keyboard perfect for browsing the web in Safari, getting directions on a map, searching for videos on YouTube, finding music on the iTunes Wi-Fi Music Store, or adding new contacts. It analyzes keystrokes to suggest words as you type and correct spelling errors automatically. And because it's software based, it changes its keys to support typing in multiple languages.iPod touch locates nearby wireless hotspots, including protected networks.AccelerometeriPod touch responds to motion using a built-in accelerometer.Responds to MovementiPod touch detects when you rotate it from portrait to landscape, then automatically changes the contents of the display. So you immediately see the entire width of a web page, view a photo in its proper aspect ratio, or control a game using only your movements.How it WorksThe accelerometer inside iPod touch uses three elements: a silicon mass, a set of silicon springs, and an electrical current. The silicon springs measure the position of the silicon mass using the electrical current. Rotating iPod touch causes a fluctuation in the electrical current passing through the silicon springs. The accelerometer registers these fluctuations and tells iPod touch to adjust the display accordingly.Perfect for GamingAccelerometer technology really shines when you play games because it immerses you in the action. It's perfect for racing games--where your entire iPod touch acts as a steering wheel--and for tap-and-tilt games like Super Monkey Ball, in which your character responds to your every movement.WirelessConnect iPod touch to the Internet anywhere there's a wireless network.Connect AutomaticallyiPod touch locates nearby wireless hotspots, including protected networks. If you've never used a particular network, it asks you to enter a password the first time, and it remembers the password from then on. So the next time you're within range, it connects automatically.Surf's UpNow you can send email from a coffee shop. Surf the web at the airport. Shop for games from your couch. Browse, buy, and download music from the iTunes Wi-Fi Music Store at select Starbucks locations or other wireless hotspots in your area.Read Kindle Books on the iPod touchRead Kindle books on your iPod touch.No Kindle required.Get the best reading experience available on your iPhone or iPod touch.Access your Kindle books even if you don't have your Kindle with you.Automatically synchronizes your last page read between devices with Amazon Whispersync.Adjust the text size, add bookmarks, and view the annotations you created on your Kindle.Don't have a Kindle?Get yours here.Shop for Books on the Kindle Store on Your iPod touchBuy a book from the Kindle Store, optimized for Safari, on your iPod touch or iPhone and get it auto-delivered wirelessly.Search and browse more than400,000 books, including more than 103 of 112New York Timesbestsellers.FindNew York Timesbestsellers and new releases for $9.99, unless marked otherwise.Get free book samples; read the first chapter for free before you decide to buy.Books you purchase also can be read on a Kindle.Kindle newspapers, magazines, and blogs are not currently available on the iPod touch or iPhone.Kindle for iPhone is currently available for customers in Argentina, Australia, Austria, Belgium, Brazil, Canada, Chile, Colombia, Costa Rica, Croatia, Czech Republic, Denmark, Dominican Rep., Ecuador, El Salvador, Estonia, Finland, France, Germany, Greece, Guatemala, Honduras, Hong Kong, Hungary, India, Ireland, Israel, Italy, Jamaica, Japan, South Korea, Latvia, Lithuania, Luxembourg, Malta, Republic of, Mexico, Moldova, Republic Of, Netherlands, New Zealand, Nicaragua, Norway, Panama, Paraguay, Peru, Philippines, Poland, Portugal, Romania, Russia, Slovakia, Slovenia, South Africa, Spain, Sri Lanka, Sweden, Switzerland, Taiwan, Thailand, United Kingdom, United States, Uruguay, Venezuela, and VietnamWhat's in the BoxiPod touch 32 GB, earphones, USB 2.0 cable, dock adapter, polishing cloth, quick start guide", "title": "Apple iPod touch 32 GB (2nd Generation)  (Discontinued by Manufacturer)", "price": 194.99, "imUrl": "http://ecx.images-amazon.com/images/I/41KNABB9GRL._SY300_.jpg", "related": {"also_bought": ["B001J85BS8", "B001U7EKKI", "B002QCIHSM", "B00517CEUQ", "B002M3SOC4", "B00517CVL8", "B001JP8T9Y", "B001FA1NZU", "B001FA1NZK", "B0012JNQYK", "B002M3SOCE", "B003R5AYRE", "B00IKMI43A", "B00302IP4I", "B00862OJ9M", "B009O6XJT0", "B0056XAX1W", "B0012JCZYM", "B00517E1O8", "B002SNGE98", "B007Z0GFWU", "B003FVU49I", "B001FA1O18", "B0089V5HDW", "B002M3SOBU", "B007Z0GFPM", "B001FA1O1S", "B00517DFSQ", "B004E41R5A", "B006PB3RIA", "B003TN1996", "B001GF1RJG", "B0097BVA70", "B001G5A3UU", "B001FA1O0O", "B00862ORMQ", "B007Z0FKNU", "B002L6HDQA", "B0084YWLT2", "B00862OF1E", "B002C74BO0", "B000EYRLXQ", "B00365F6G4", "B0012JCYPC"], "bought_together": ["B001J85BS8", "B00517CEUQ"], "buy_after_viewing": ["B002M3SOC4", "B002M3SOBU", "B001FA1NZU", "B001FA1O18"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}