{"asin": "B002M3SHXA", "related": {"also_bought": ["B001FWYGJS", "B001UI4RTG", "B00AAU54TW", "B004H1PMJC", "B00894WP4S", "B00C7NSIO8", "B008IFXQIW", "B000BTL0OA", "B0062KA4VM", "B000JV9LUK", "B00895BUPC", "B0049YQVHE", "B004N6259G", "B007YV0UQW", "B004XC6GJ0", "B0098QV038", "B006MISZOC", "B00A3YN0Z0", "B004T9RR6I", "B0052G14E8", "B0044YU60M", "B00IJYGICI", "B00IKMJ9B6", "B0037DAX9U", "B004N625A0", "B0041OOG9M", "B002KCO96C", "B002JM0RNC", "B000HM83OQ", "B001CN9K6E", "B00GTCAY04", "B004MEBENM", "B00DIFIM36", "B001AZP8EW", "B001UI2FPE", "B0057ODG6Y", "B002HWRJY4", "B002GU5XKE", "B003Y5RYNY", "B005TLM7WE", "B00BB0ZTO0", "B0085WN7YQ", "B00723KZTY", "B00DR0PDNE", "B003IKMSFE", "B004LQ1RKQ", "B000J2EN4S", "B00J7KM5X4", "B005KUVZRW", "B0079XWMEI", "B00I4XMEYA", "B000IF4788", "B003FVJYF8", "B007KA07YM", "B000RYYI7K", "B008IFXQFU", "B001AKVBFC", "B00AZBIZTW", "B005LTNLDI", "B001LTXRDG", "B00000JDF5", "B000TYR5R8", "B008KVUAGU", "B000IZ793S", "B00E45043A", "B000OR2RNM", "B00DIFIO8E", "B0018BQR84", "B001TH7GVE", "B000RH22WA", "B000MVZ2E6", "B0012H549W", "B0034JSYZ2", "B0011XSEW6", "B007TUQF9O"], "bought_together": ["B001FWYGJS"], "buy_after_viewing": ["B004XC6GJ0", "B001FWYGJS", "B00AJHDZSI", "B000JV9LUK"]}, "title": "ARRIS / Motorola SURFboard SB5101U DOCSIS 2.0 Cable Modem - Retail Packaging", "price": 35.74, "salesRank": {"Electronics": 206}, "imUrl": "http://ecx.images-amazon.com/images/I/31ORD1-N1bL._SY300_.jpg", "brand": "Motorola", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Modems"]], "description": "Enjoy a super-fast broadband connection with an Environmentally-Friendly Cable Modem.Get more out of your time online and feel good about using a Green cable modem. Surf the Web and view pages quickly, download video with blazing speed and play online games faster than your opponents with this SURFboard cable modem. Up to 100 times faster than traditional dial-up. No dialing up &ndash; no phone line required. Easy-to-install and simple-to-useMotorola SURFboard&reg; SB5101U Cable ModemEasy to Install, Activate, and Use.Product FeaturesEnvironmentally-FriendlyAll packaging products are made from recycled materialsThe shipping carton is made of recycled corrugated material100% of package contents is created from recycled materialsEnergy Star CompliantSmaller Power Supply (PWB) for reduced environmental impactUSB and Ethernet connectivity to help ensure compatibility with almost any PC or Mac network-ready systemSupports up to 63 users (with additional networking hardware; not included)No telephone lines needed; always on, always connected10/100Base-T Ethernet for blazing speed; capable of downloading at speeds up to 100 times faster than a standard 28.8Kbps analog phone modemHigh-Speed Internet is as Easy as 1,2,3Additional FeaturesDownstream data speeds up to 38 MbpsUpstream data speeds up to 30 MbpsInternet Protocol version 6 (IPv6) Ready - Next-generation Internet ProtocolFront-panel status LEDs and user-friendly online diagnostics page for quick and easy troubleshootingCompatible with Windows, Macintosh and Unix systemsIntegrated DOCSIS 2.0 A-TDMA and S-CDMA technology; backwards compatible with existing DOCSIS 1.0 and 1.1 systemsRemote configuration and monitoring from the headend using SNMP and TFTPIncludes USB and Ethernet cables, power adapter and installation CD-ROMNote: Ask your cable company if they support DOCSIS cable modems. DOCSIS (Data Over Cable Service Interface Specification) is the industry standard for cable-based Internet access service.2-year limited warrantyWhat&rsquo;s in the BoxInside the Box - Motorola SB5101U SURFboard Cable Modem,Installation CD-ROM with USB drivers,Power,adapter,Ethernet cable,Quick Start Guide,Warranty card"}