{"asin": "B003ZX8B1E", "description": "n&uuml;vi 1390LMT packs big features--including free Lifetime Maps and Traffic--into a slim design. This thin navigator also comes with lane assist with junction view, pedestrian navigation options, hands-free calling and ecoRoute to calculate a more fuel-efficient route.The n&uuml;vi 1390LMT packs big features into a slim design.Traffic information is updated constantly, and map updates are available up to 4 times a year, with no subscription, fees, or expiration dates.Travel tools include JPEG picture viewer, world travel clock with time zones, currency converter, measurement converter, calculator and more.EcoRoute calculates the most fuel-efficient route, tracks fuel usage and more.Affordable, Widescreen GPS Vavigator With Lifetime Map and Traffic UpdatesIncludes Free Lifetime Map and Traffic UpdatesWith free Lifetime Map and Traffic updates, you always have the most up-to-date maps, points of interest and navigation information available at your fingertips. Traffic information is updated constantly, and map updates are available for download up to 4 times a year. Both features are ready to go, right out of the box, with no subscription or update fees and no expiration dates.Know the Lane Before It's Too LateNo more guessing which lane you need to be in to make an upcoming turn. Lane assist with junction view guides you to the correct lane for an approaching turn or exit, making unfamiliar intersections and exits easy to navigate. It realistically displays road signs and junctions on your route along with arrows that indicate the proper lane for navigation. Lane assist with junction view is available in select metropolitan cities.Navigate City TransitWith its enhanced pedestrian navigation capabilities, n&uuml;vi 1390LMT is the perfect travel companion for getting around town. Download optional cityXplorer content to help you navigate city public transit. Know where to walk, where to catch the bus, subway, tram or other transportation, and how long it will take to get there. n&uuml;vi 1390LMT easily fits in your pocket or purse. cityXplorer maps are available for select cities throughout North America and Europe. And with prices as low as $9.99, you'll have money left over to spend in the big city.See MoreWith n&uuml;vi 1390LMT's widescreen display, you'll always get the big picture. View map detail, driving directions, photos and more in bright, brilliant color. Its sunlight-readable, 4.3-inch (10.92 cm) display is easy to read, from any direction.Get Turn-by-Turn Directionsn&uuml;vi 1390LMT's intuitive interface greets you with two simple questions: \"Where To?\" and \"View Map.\" Touch the color screen to easily look up addresses and services and get voice-prompted, turn-by-turn directions that speak street names to your destination. It comes preloaded with detailed City Navigator NT street maps, nearly 6 million points of interest (POIs), 2-D or 3-D maps and the speed limit for most major roads. Its digital elevation maps show you shaded contours at higher zoom levels, giving you a big picture of the surrounding terrain. With the 1390LMT's enhanced user interface, you can slide your finger to conveniently scroll between screens. You also can upload custom points of interest (POIs). And with HotFix satellite prediction, n&uuml;vi calculates your position faster to get you there quicker.Make Hands-free CallsFor hands-free calling, n&uuml;vi 1390LMT integrates Bluetooth wireless technology with a built-in microphone and speaker. Just pair it with your compatible Bluetooth phone and talk hands-free through the 1390LMT while staying focused on the road. Simply dial numbers with n&uuml;vi's touchscreen keypad to make a call. To answer calls, just tap the screen and speak into its built-in microphone. Enjoy convenient one-touch dialing for contacts and points of interest.Go Beyond NavigationNavigation is just the beginning. n&uuml;vi 1390LMT saves you gas and money with ecoRoute--a green feature that calculates the most fuel-efficient route, tracks fuel usage and more. The 1390LMT includes many travel tools including JPEG picture viewer, world travel clock with time zones, currency converter, measurement converter, calculator and more. With photo navigation, you can download pictures from Garmin Connect Photos and navigate to them. With its \"Where Am I?\" emergency locator, you always know your location. Simply tap the screen to get your exact latitude and longitude coordinates, the nearest address and intersection, and the closest hospitals, police stations and fuel stations. The 1390LMT features Garmin Lock, an anti-theft feature, and is compatible with our free Garmin Garage where you can download custom voices and vehicles. Enhance your travel experience with optional plug-in microSD cards.What's in the Boxn&uuml;vi 1390; Preloaded City Navigator NT North America (U.S, Canada); Lifetime Maps and Traffic; FM Traffic Receiver With Vehicle Power Cable (vehicle power cable is traffic receiver); Vehicle Suction Cup Mount; USB Cable; Dashboard Disc; Quick Start Manual", "title": "Garmin n&uuml;vi 1390LMT 4.3-Inch Portable Bluetooth GPS Navigator with Lifetime Map &amp; Traffic Updates (Discontinued by Manufacturer)", "price": 189.99, "imUrl": "http://ecx.images-amazon.com/images/I/41-iyro%2BKCL._SY300_.jpg", "related": {"also_bought": ["B003DSCU72", "B0030BJ9S0", "B004HPW0TS", "B002OL2MU4", "B002Z1J8R8", "B002VPE21A", "B004I5BUSO", "B00269VU0W", "B00273AMH4", "B002KO7R2I", "B003Y2DUHQ", "B000LRMS66", "B002GU60BK", "B004SUJFN6", "B004HPUHXY", "B0051FWA7U", "B003ZX8B0U", "B003W645N2", "B001XUQPJQ", "B0039LRQ8G", "B004DELGNE", "B002WRHFOS", "B002RS7KKQ", "B002TLSOG0", "B00357TQTQ", "B002I05VRC", "B0035JL4VC", "B007RMAS1K", "B001U0O7RG", "B0057RAHO0", "B005DIZWYS", "B000IN09C8", "B002757BQC", "B001CQT0X4", "B003ZX8B3W", "B0035JL4V2", "B001B0Z4CM", "B0015A6YN6", "B0040FT30O", "B002SRW3JY", "B0048K15G6", "B008EUDQXG", "B0014DUHLO", "B003CLYMSU", "B003ZX8B2S", "B001QKZ3OQ", "B008SYWFNA", "B000GR37WU", "9984984427", "B003VNKNEQ", "B002I007IA", "B000SMVQK8", "B002D47XO2", "B0057REBME", "B000BMAQAQ", "B003FMUP0K", "B006GWO5WK", "B009CCXJ0A", "B003VL0KN2", "B0050JJU3E", "B0037JE8VS", "B001BZM998", "B006U1YUZE", "B005GOPXRA", "B003WIRFD2", "B0057OCDQS", "B0083SBJXS", "B005D5M12M", "B00622AG6S", "B005CLPP84", "B007KFXIDE", "B001MU246A", "B003VNKNF0", "B00721CLN4", "B007VBXC38", "B005K9GWZS", "B006U1YVZ8", "B008NK0J4G", "B007P4VOWC", "B005DIBH6A", "B008EO8RNQ", "B004LWZWGK", "B0044YU60M", "B005HNF01O", "B00ABBAUCQ", "B0050SYX8W", "B003VNKNEG", "B000F7857S", "B008GFRDL0", "B00200K1TS"], "bought_together": ["B002OL2MU4", "B004I5BUSO"], "buy_after_viewing": ["B005DIBHA6", "B005DIBHCE", "B002OL2MU4", "B00AXX0I88"]}, "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS"]]}