{"asin": "B00006B9H9", "related": {"also_bought": ["B00002EQCW", "B000063UZW", "B00006RVPW", "B00002EQCS", "B000067RG5", "B0001BVXI6", "B0000BVYT3", "B001NLV4TQ", "B004EFHN66", "B008YAHW6I", "B000IHUR58", "B008JJLZ7G", "B0007T27H8"], "bought_together": ["B00002EQCW"], "buy_after_viewing": ["B001UI4RTG", "B002OMX0XQ", "B003CFATSS", "B007B60SCG"]}, "title": "NETGEAR RP614 Web Safe Router with 4-Port 10/100 Mbps Switch", "price": 23.99, "salesRank": {"Electronics": 18288}, "imUrl": "http://ecx.images-amazon.com/images/I/31gZejPMwqL._SX300_.jpg", "brand": "Netgear", "categories": [["Electronics", "Computers & Accessories", "Routers"]], "description": ".caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The NETGEAR RP614 Web Safe Router with 4-Port 10/100 Mbps Switch offers:A way to share a single broadband connection with multiple users.A built-in 4-port 10/100 Mbps switch.NAT translation and an SPI firewall for enhanced security.A 2-year warranty.The NETGEAR RP614 Web Safe Router with 4-Port 10/100 Mbps Switch lets you easily share a broadband connection by creating a secure network with double firewall protection.The modern styling fits in with your home decor.View larger.A built-in 4-port switch provides wired connections for your home network.View larger.Simple SetupNETGEAR has made setting up network devices as painless as possible with their interactive Installation Assistant that guides you through setup step by step. Configuration is done through an easy-to-use web interface.Outstanding Performance and SecurityThe RP614 features four auto-sensing 10/100 Mbps Ethernet ports that will figure out each network connection without any need for manual switches. The RP614 allows for transfer of movies, music and photos at up 200 Mbps so the video and sound will be clear.Two security methods are utilized to keep the network secure: Network Address Translation (NAT) and Stateful Packet Inspection (SPI). SPI safeguards against popular Denial of Service (DoS) attacks. For parents, content filtering allows you to set filters so that children are unable to reach websites with certain keywords or domain names, such as those associated with pornography. Web access can also be limited by the day of the week and time of day.Styling That Fits In Your HomeThe RP614 has a svelte design with silver-and-gray styling that won't look out of place in your home.The NETGEAR RP614 Web Safe Router with 4-Port 10/100 Mbps Switch is backed by a 2-year warranty.What's in the BoxRP614 Router Gateway, resource CD, power adapter, Ethernet cable, and warranty/support information card."}