{"asin": "B00008KUA3", "description": "Taking the art of video game design to a new level, Nintendo'sWarioWare, Inc.: Mega Microgame$gives gamers a hilarious look at what really goes on behind the scenes.You can't really say that Wario is greedy. He's just, uh, financially motivated. Always on the lookout for his next get-rich-quick scheme, Wario stumbles upon the lucrative video game publishing market. Like any aspiring entrepreneur, Wario buys a PC and starts his own company, called WarioWare, Inc. With the help of his friends, he develops over 200 of the wildest games the world has never seen.Each \"game\" lasts five seconds, which is kept track of via an on-screen time-bomb. Directions aren't provided, so much of the challenge comes from figuring out how, precisely, to beat each minigame. This is where you come in. You are challenged by Wario and each of his developer buddies to beat all of their games within the given time limit. Each developer specializes in a particular genre of game, so you at least have a vague idea of what to expect.You'd be amazed at what you can accomplish in five seconds. Minigames vary wildly, including brushing teeth, picking someone's nose, cracking an egg over a moving frying pan, shaking a dog's paws and more. One of the game developers even has a Nintendo genre of games, including five-second versions ofSuper Mario Bros.,F-Zero,Balloon Fightand evenThe Legend of Zelda.The more games you beat, the faster and more difficult the games become. The games also appear in random order, so you can't simply memorize what you're supposed to do each time. After defeating the required number of games, you'll enter a boss encounter. These games have no specific time limit and are often much more challenging than the preceding mini-games. Successfully defeating the \"boss\" unlocks the next level of developers until you finally face Wario himself.Defeating specific game developers will unlock special two-player and challenge games for added replay value. Only a single Game Pak and Game Boy Advance system are required for multiplayer.WarioWare, Inc.: Mega Microgame$offers hours of curiously addictive gameplay. This is definitely one game (or 200, depending on how you look at it) you have to play to believe", "price": 79.99, "imUrl": "http://ecx.images-amazon.com/images/I/61J7USA8snL._SY300_.jpg", "related": {"also_bought": ["B0007D4MW2", "B00005MDZY", "B00006FWTW", "B0007D4MVS", "B0000A09EP", "B00005MI42", "B000070IW6", "B00008URUF", "B0002GTXJG", "B00005UK88", "B00005B8FZ", "B00009WAUO", "B00006LELB", "B0001JXACA", "B00006M3R6", "B00007D02M", "B00030GS80", "B00005MDZZ", "B0033BJSDI", "B0001JSSLS", "B00005BZE0", "B00005OARM", "B00004S99X", "B0002TB4CW", "B0009Z3MH4", "B00022GIYI", "B0007YXB8W", "B00002ST27", "B00012BSJ4", "B00000J9J9", "B00005B8G1", "B0009XEC2K", "B00008YMZV", "B00009WAUN", "B00027NWRY", "B00009WAUK", "B000087H7T", "B00008DHNU", "B000FQ9YB0", "B000641ZC2", "9882106463", "B00002ST28", "B0000A9Y11", "B0009Z3MOW", "B000HE7KZC", "B000087PM3", "B0001ZZNNI", "B00002SVER", "B0001ZZNME", "B00005B8G3", "B00006IJJJ", "B000VBB69M", "B00002ST5L", "B0007WWYM8", "B000B5MV6A", "B0006SSR24", "B00005NOFM", "B0002HDSZ0", "B00DTCWNL0", "B00002SVEO", "B00068O278", "B00005CFHN", "B0015DOOEY", "B00005NCCW", "B00006LEMM", "B000070IWB", "B0002Y67PQ", "B000LSKXRQ", "B000046S40", "B000031KJL", "B00009WAUM", "B000BI3SIC", "B001TOQ8WU", "B00004U1QY", "B00005LOW5", "B0001YYNKS", "B000B5MV60", "B000B8J7K0", "B00I5LMSE2", "B000AX224Y", "B0001YYNL2", "B0006GBD04", "B00023JJUW", "B000090W86", "B00000IWYT", "B000CNESH6", "B002CJ8Z04", "B0000A03CT", "B0000BX8M6", "B000L9NPGG", "B0000E5U6M", "B0001ZZNLK", "B0000A0O28"], "buy_after_viewing": ["B00005B8FZ", "B00006LELB", "B00005MI42", "B0000A09EP"]}, "salesRank": {"Video Games": 6063}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "More Systems", "Game Boy Advance", "Games"]]}