{"asin": "B0001WW3F2", "description": "There's a lot to like about Internet radio, but sometimes you just want to catch the local NPR broadcast or listen to the ballgame without searching for a streaming audio feed. Griffin satisfies this urge with its RadioShark, an AM/FM desktop radio that plugs into your computer's USB port to broadcast the full spectrum of local radio. More impressively, the device also acts as a radio version of a digital video recorder, employing a technology called Time-Shift Recording to pause and rewind live radio (think TiVo). Time-Shift Recording lets a user pause a live interview, leave the desk for 15 minutes, and then return without missing a second of conversation. In addition, the RadioShark records radio in real time with the push of a button or records favorite programs via the VCR-like scheduling window. Griffin touts the device as a great way to take control of how and when you listen to the radio. And we agree for the most part, but with a major caveat.The software interface includes frequency and volume sliders, along with band, seek, and record buttons.Design and SetupThe slick-looking RadioShark is shaped like (surprise!) a shark fin, with a white plastic exterior that looks perfectly at home amidst a desktop full of Apple peripherals, including the ubiquitous iPod. This makes sense given Griffin's reputation as a manufacturer of Apple accessories. Installation is quick and easy thanks to the included CD-ROM, which comes with software installers for both Mac and PC. Users will need to be running OS X 10.2.8 or higher or Windows XP to operate the software, however. Once it's up and running, users can easily reposition the device to improve radio reception and recording quality, though we didn't have any problem picking up the signals in our notoriously reception-poor region. Listeners can also add an external antenna to the rear jack should reception prove spotty.Features and PerformanceListening to the radio with the RadioShark is as simple as flipping a switch. The basic yet intuitive software interface includes frequency and volume sliders, along with band, seek, and record buttons. It takes but a fraction of a second to change stations, and the signal responds immediately. The audio quality isn't terrific, but it's just fine given the circumstances (FM radio through computer speakers). Recording is also quite easy, whether it's for five seconds or five hours. Once you turn it off, the files save conveniently as either AIFF or AAC files (Mac) or WAV files (PC) in your computer's designated music directory, where you can listen to them later or export them to other applications. Alternately, Mac users can choose to import their recordings directly into iTunes for added convenience. This is particularly cool for iPod users, who can record songs or programs from the RadioShark and then listen to them later while on the move.The Time-Shift feature, which offers a continuous 30-minute recording loop, is also quite convenient. Should you pause or rewind a segment, you can easily rejoin the live broadcast by clicking the fast forward button. The RadioShark also continues to record the live broadcast while you're checking out the archived footage, ensuring that you don't miss a second. And should you want to permanently record a Time-Shifted song or program, you can just hit record and it's done. A couple of other convenient features include an equalizer with several preset settings and an easy-to-follow scheduling window for upcoming recordings. Listeners can even set the RadioShark to record hourly, daily, or weekly programs.Unfortunately, thanks to a few serious hiccups, these scheduled recordings may never come to pass. Specifically, if you let your computer drift off to sleep, the RadioShark responds by disconnecting from the software. The only way to sync it back up is to unplug the Shark and start again, but in the process, listeners lose all their scheduling information. This problem appears persistent in both Macs and PCs, though Griffin's web site says Windows users shouldn't experience the problem. Griffin recommends disabling the sleep preference as a solution, but that's inconvenient for a number of reasons. As an alternative, users can reconnect the device each time it fizzles, but that's also a pain and makes the scheduling window virtually obsolete. Until Griffin releases an update, the sleep issue will remain a major drawback.We also experienced a few skips while using the Time-Shift feature. These weren't standard static interruptions, but sounded more like sporadic CD skips--sometimes several to a song. This wouldn't be a big deal when listening to conversational radio such as NPR, but if you're trying to record music, it could be a real drag.But it's the sleep issue that really prevents us from giving the RadioShark an enthusiastic recommendation. Should the recording problems steer listeners away from the RadioShark? Not necessarily, unless scheduled recording is the main reason you're drawn to the machine. The radio and Time-Shift features are still pretty cool, and the RadioShark offers one of the easiest ways to record live radio into digital formats. But it does put a damper on an otherwise great product.--Rivers JanssenProsPlays local AM and FM stations through your computerRecords live radio and syncs recordings to iTunes and iPodTiVo-like Time-Shift Recording lets listeners pause or rewind live broadcastFun, shark-fin-like antenna receives solid receptionConsRadioShark loses signal when computer sleeps, disabling scheduled recordingsTime-Shift feature occasionally causes audio skipsWhat's in the BoxRadioShark, USB extension cable, installation CD-ROM, user's manual.", "title": "Griffin Technology RadioShark AM / FM Desktop Radio with Time-Shift Recording (Discontinued by Manufacturer)", "price": 85.02, "imUrl": "http://ecx.images-amazon.com/images/I/11EZEYPCXHL.jpg", "related": {"also_viewed": ["B001BGGD8A", "B0016OEV7C", "B0009ZAA42", "B005GTO0DI", "B000L6OYIM", "B000HNHA12", "B0009ZAA4M", "B008I9PWGW", "B00IGXENR4", "B00006I5WK", "B00EJVVKPA", "B0016CWV3U", "B0000WM2L8", "B00FBJ55DC", "B003XDU4B6", "B0036VO5OC", "B009OCBBGW", "B008I6ITME", "B007IPZDNO", "B00HQO34HY", "B009K6ULV8", "B00628AOW8", "B0000DHVOO", "B00009KAQH", "B0030MZ1NQ", "B0031NF116", "B001QTXKF6", "B004FV4ND0", "B003XU76NI", "B006ZSMGTE", "B009OCBBJY", "B00007KDX6", "B0012YFY54", "B00BGW1PFA", "B003QHXZM4", "B00120WRSU", "B000QUGKRQ", "B007H3L24Q", "B00CFULOZ8", "B000G6M916", "B00CCIKJT0", "B0012YHQVE", "B0081IKTN6", "B008XNGMA8", "B0014T7W8Y", "B007TSX4QI", "B004CSXBRA", "B000P0RPNA", "B004H912FC", "B00FK0AEG0", "B00D8FIYZ2", "B0009ZAA4C", "B002Q0W82A", "B000EDVT9E", "B000TEVQVO", "B001CK9760", "B001QTXKCE"], "buy_after_viewing": ["B001BGGD8A", "B0016OEV7C", "B0009ZAA42", "B005GTO0DI"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Cable Adapters"]]}