{"asin": "B002TA7VO2", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Memory Cards", "SD & SDHC Cards"]], "description": "Capture your images or video as they happen without missing a moment with the Patriot LX Series 8 GB SDHC flash memory card. Offering blazing fast performance, LX Class 10 SDHC memory cards are fully compatible with the latest SD 3.0 specifications, which call for a minimum sustained write speed of 10 MB per second. This is a significant performance upgrade over earlier SDHC standards, and is fast enough to record high-definition 1920 x 1080 resolution video. As a result, LX SDHC flash memory cards easily keep up with the most demanding photography and video equipment, making them ideal for both new digital SLR users and seasoned professionals.Each LX flash memory card is also built to keep your data safe, with a write protection switch that prevents users from accidentally overwriting important files. Also available in 16 GB and 32 GB capacities, the card carries a five-year warranty.The 8 GB SDHC flash memory card removes the bottleneck of slow memory speeds.SpecificationsType: SDHC flash, Class 10Capacity: 8 GBImage storage: 7,002 images (3 megapixels), 3,225 images (5 megapixels), 2,695 images (6 megapixels)MP3 storage: 9,096 minutes (128 kbps), 6,824 minutes (160 kbps)WMA storage: 10,496 minutes (96 kbps), 8,024 minutes (128 kbps)Movie storage: 1 movie (DVD .iso, 4.7 GB)Dimensions: 0.93 by 1.25 by 0.08 inches (W x H x D)Weight: 0.07 ouncesCertifications/safety: RoHS, FC, CEWarranty: 5 yearsDesign and QualityAll Patriot Memory products are designed to respond quickly and intelligently to the rapid changes inherent in the technology sector. This commitment to R&D; helps Patriot deliver the best-quality memory modules powered by the latest innovative technology. The company's manufacturing process begins with high-quality components and ends with rigorous functional testing to ensure each module's reliability and compatibility. Patriot Memory modules are approved by such leading motherboard and system manufacturers as Intel, Tyan, Supermicro, and Iwill. Patriot is also a member of the Apple Developer Connection, and has earned awards from such leading product review sites as XBit Labs, Anandtech, Tom's Hardware, and Hot Hardware.com.About Patriot MemoryEstablished in 1985, Patriot Memory builds a full range of memory module and flash memory products, including Extreme Performance (EP), Signature Lines (SL), and Flash Memory (FM) solutions. The company--which has sales offices located throughout the U.S. and Asia, along with distribution channels throughout North America, Europe, Asia Pacific, the Middle East, Africa, and Latin America--is dedicated to becoming the vendor of choice for the computer and consumer electronics industries, with a commitment to service and quality that exceeds all other brands. Headquartered in Fremont, California, Patriot Memory maintains state-of-the-art manufacturing facilities in both Fremont and Taipei, Taiwan.", "title": "Patriot 8GB Class 10 SDHC Flash Memory Card For Camera - PSF8GSDHC10", "price": 8.79, "imUrl": "http://ecx.images-amazon.com/images/I/41udHWKy1bL._SY300_.jpg", "brand": "Patriot", "related": {"also_viewed": ["B0064Z7260", "B007M54DYA", "B00B7ID97A", "B007M51J42", "B004CDI8MS", "B009C98OGW", "B00DX5D49S", "B003VNKNEQ", "B007R9NYK0", "B0037FLUYU", "B007ADFTUG", "B004H8FTCU", "B007M51J3I", "B007ZW2LO4", "B00DN43UPM", "B00ENPQ1GK", "B007NDL542", "B00B588HY2", "B0060C861M", "B002WE6D44", "B000QUUFRW", "B00B7ID99I", "B003VNKNEG", "B00IEYG878", "B00B7ID9CU", "B005Y8C0H4", "B00FB463E2", "B003VNKNF0", "B007M54E08", "B000Y9TZ9Y", "B009SQQF9C", "B00DLUXD64", "B008PO5CSI", "B004XIB9T6", "B007NDL56U", "B00DG9D63A", "B004Q3C98S", "B007M54E1M", "B00DX5D9I4", "B008CVHLT2", "B0070WU51U", "B00HIKBW1G", "B0090J5XLS", "B00IVPU786", "B00G1PNG54", "B007JRB0SS", "B007WT9SU0"], "bought_together": ["B003MTTJOY"], "buy_after_viewing": ["B003VNKNEG", "B009SQQF9C", "B003VNKNEQ", "B000Y9TZ9Y"]}}