{"asin": "B0090C7A3O", "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Running GPS Units"]], "description": "Stylish, Simple GPS Captures Every MileTracks distance, pace and caloriesStart running with the press a buttonIdentifies personal recordsVirtual Pacer&trade; compares current pace to targetPlan, review and share runs at Garmin Connect&trade;Forerunner 10 is a GPS running watch that tracks your distance,  speed/pace and calories. It also identifies your personal records and  provides motivation along the way.Ready to RunForerunner 10 is so easy to use, you can start your run with the  press of a button. As you run, you can see your time and distance  clearly displayed on 1 screen and calories and pace on another. You can  also customize the settings to show pace and distance on the same  screen.It FitsIt&rsquo;s our lightest, most comfortable watch yet and is available in  multiple colors. The black/red and orange/black models have a slightly  larger watch face and wider wristband. All models can be worn as a  regular watch, so your running partner is always on hand. For typical  use (with GPS on 30 minutes per day), the battery life is 10 days. If  used continuously with GPS, the battery life is 5 hours.Motivating FeedbackAs you run, Forerunner 10 automatically alerts you when you complete  each mile, giving you a friendly beep and a screen that flashes your  time for that mile. When you complete your run and save it, you&rsquo;ll see a  summary of how you did, including your total time, distance, average  pace and calories. The watch even lets you know when you achieve a  personal record, such as your fastest mile or longest run to date.Training ToolsFor runners who want a little more, Forerunner 10 has a couple of  simple training features. Virtual Pacer&trade; compares your current running  pace to your target. It also has a run/walk feature that&rsquo;s helpful if  you&rsquo;re just starting out or your running plan includes walk breaks.Store and ShareWith a simple connection to your computer, you can upload your runs to Garmin Connect&trade;  to see your run on a map, get more detail on each mile and share it  with friends &mdash; all for free. You&rsquo;ll be even more motivated when you see  your miles add up in Garmin Connect and can go back and see how you&rsquo;ve  improved from last week, last month or last year.What's in the Box:", "title": "Garmin Forerunner 10 GPS Watch (Green/White)", "price": 129.39, "imUrl": "http://ecx.images-amazon.com/images/I/31GZyGQ8UfL._SY300_.jpg", "brand": "Garmin", "related": {"also_bought": ["B002I05VRC", "B00INXAIDK", "B00INXAY9S", "B00BB2NMJC", "B009IFTOFK", "B005DN52GQ", "1623361230", "B00DPHDEFI", "B00B9J1E9M", "B006ZT7JMM", "B002UNFJI8", "B000NHLHFW", "B007EVLTJE", "B009T467VY", "1449459951", "B003XIHXHE", "B00AK95UL0", "0307279189", "B00024CU2K", "B0088WT4VS", "B00CQ7QDQA", "B007X5BNFQ", "B00AO309NG"], "bought_together": ["B002I05VRC"], "buy_after_viewing": ["B00JQF6HBQ", "B003JNYULA", "B003JTLKIA", "B002I05VRC"]}}