{"asin": "B001FA1NCI", "description": "With eight amazing colors, a new curved design, and great new features, iPod nano rocks like never before. The Genius Playlist feature finds the songs in your music library that go great together and makes a playlist for you. With its built-in accelerometer, iPod nano is made to move. Give it a shake, and it shuffles to a different song in your library. Turn it on its side to flip through your album art in Cover Flow. And tilt, move, and play accelerometer-inspired games (games available separately). Watching movies, TV shows, and video is even more fun on the sharp 2-inch screen. And your photos (up to 7,000 of them) look great in portrait or landscape view. Available in 8 GB and 16 GB models, the 8 GB iPod nano puts up to 2,000 songs or 8 hours of video in your pocket.With a new curved design and great new features, iPod nano rocks like never before.Click to enlarge.Up to 2,000 songs, 8 hours of video, or 7,000 photos in your pocket.Click to enlarge.Just under a quarter-inch deep.Click to enlarge.Available in nine amazing colors; the (PRODUCT)RED nano is available exclusively through Apple.Click to enlarge.Enjoy album art in Cover Flow, games, videos, and photos in landscape mode. (Green nano shown here.)A Musical GeniusSay you're listening to a song you really like and want to hear other tracks that go great with it. The Genius Playlist feature finds the songs in your music library that go great together and makes a Genius Playlist for you. It's like having your own highly intelligent, personal DJ.Find Your Music FasterIt's even easier to find the song you want to hear. Now you can view your album art in Cover Flow. Or just press and hold the Center button to browse by album or artist. When you find the right song, press the Center button to add it to your on-the-go playlist.Rock and Roll OverTilt or turn iPod nano on its side, and you'll listen, watch, and play in new ways. You can flip through your album art with Cover Flow. Or, vertically speaking, see more albums and artists on the screen at one time.Shake Your Groove ThingSometimes, we could all use a little unpredictability. And now you can shake to change your music. Just give iPod nano a shake, and it shuffles to a different song in your music library. You'll always be surprised by what you'll hear.Let the Games BeginNow you can get in on games made especially for iPod nano and the accelerometer. They respond to the way you move, so they're immersive, addictive, and a blast. The iPod nano comes with Maze, which lets you work your way through vast mazes by tilting and moving. You can find even more games on the iTunes Store.Even Your Photos RockPull hundreds of photos from your pocket and share them wherever you go. Hold iPod nano upright and see your photos in portrait view. Turn the player on its side to see them in landscape. Your photos look beautiful in their proper aspect ratio on the vibrant, 320-by-240-resolution display.The World's Biggest Small ScreenWatching movies, TV shows, and videos is big fun on iPod nano. And the high-resolution picture looks crisp and vivid on the 2-inch widescreen display. So you can always have a little video with you.Reduced Environmental ImpactThe iPod nano embodies Apple's continuing environmental progress. It is designed with the following features to reduce environmental impact:Arsenic-free glassBrominated flame retardant-freeMercury-freePVC-freeHighly recyclable aluminum enclosureWhat's in the BoxiPod nano, earphones, USB 2.0 cable, dock adapter, quick start guide", "title": "Apple iPod nano 8 GB Black (4th Generation)  (Discontinued by Manufacturer)", "price": 159.99, "imUrl": "http://ecx.images-amazon.com/images/I/41qEH4hLTRL._SY300_.jpg", "related": {"also_bought": ["B002BYC5HY", "B001JJUBD2", "B001FA1NIC", "B001FA1NCS", "B001FA1ND2", "B001J800GG", "B00A8N698Q", "B001FA1NDC", "B002L6HDPG", "B001FA1NEG", "B001IEXOFK", "B002L6HDOC", "B003L9WPUU", "B002P6EXDC", "B00IKMI26Y", "B001IJN2HA", "B00IKMI1EW", "B002L6HDR4", "B001L5SN4S", "B00IKMMDFA", "B001LYUW02", "B001GC475K", "B002RX7RN6", "B002SRQLM4", "B002RSU80U", "B00AV2KRO6", "B001FA1NDW", "B001HABRKE", "B001FB5710", "B000JO7PIM", "B001GEY13G", "B002L6HDTC", "B001N85YTK", "B0047DVWQM"], "bought_together": ["B002BYC5HY", "B001JJUBD2"], "buy_after_viewing": ["B002L6HDPG", "B0097BEE9Q", "B001FA1NCS", "B001FA1NIC"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}