{"asin": "B0046A8MQO", "description": "Experience transfer speeds up to 10x faster with the new Store &#39;n&#39; Go&#174; SuperSpeed USB 3.0! This Verbatim compact external portable hard drive features a sleek piano-black finish and comes with the fastest USB connectivity available. SuperSpeed USB 3.0 lets you blaze through demanding tasks by reading and saving files faster. This external hard drive features Nero BackItUp &#38; Burn Essentials software that allows full system backup and restore functions, the ability to schedule automatic backup by date/time and an encrypted backup option with password control. Save your precious photos, videos, graphics, games, music, data and more in ultimate safety with Verbatim.FeaturesDesign&mdash;Compact,  portable drive features a sleek piano black finish.SuperSpeed  USB 3.0&mdash;increases transfer speeds up to 10x faster than USB 2.0. The  fastest USB connectivity available!Transfer Speeds&mdash;SuperSpeed USB 3.0 data transfers at a rate  of 4800Mb/s (max) when connected to a USB 3.0 portCompatibility&mdash;the Store &#39;n&#39; Go SuperSpeed USB 3.0 drive is  backwardly compatible with USB 2.0 ports.Nero BackItUp &#38; Burn Software&mdash;this drive includes Nero  BackItUp Software for Windows only and offers full system backup and restore  functions, the ability to schedule automatic backup by date/time and an  encrypted backup option with password control. Software compatible with Windows  operating systems only.Warranty&mdash;7-year limited warranty!Verbatim manufactures our  hard drives to meet our strict quality standards. We stand behind the quality  of our products&mdash;and our warranty proves it!Bonus! Free 60-day trial of Norton Online Backup (5GB).Tips for Getting StartedUsing the Store &#39;n&#39; Go SuperSpeed  USB 3.0 Portable Hard Driveis easy:Remove the drive from the boxConnect the included USB 3.0 cable to the drive       and then to your computerThe drive will mount automatically and a new icon       appears on the desktop (Mac) or in My Computer (Windows)Now you&#39;re ready to transfer and protect your files.What&#39;s in the Box?1 Store &#39;n&#39; Go SuperSpeed USB 3.0 Portable &nbsp;Hard DriveUSB 3.0 cable&nbsp;Quickstart GuideNorton Online Backup (included on hard drive)Nero BackItUp &#38;  Burn Software (included on hard drive)About VerbatimVerbatim provides technology you can trust&mdash;we&#39;ve done so for  over 40 years. Our products include an impressive selection of removable  storage and computer peripherals, featuring a wide range of highly acclaimed  CD, DVD and Blu-ray&#174; media products. Verbatim also offers an array of lightning  fast desktop and portable hard drives, USB flash drives, memory cards, stylish,  feature-rich mice and keyboards and a broad range of replacement laser toner  cartridges. Buy Verbatim and you get innovation, security and reliability&mdash;and  that means peace of mind.", "title": "Verbatim Store 'n' Go SuperSpeed 750 GB USB 3.0 Portable External Hard Drive 97396 (Black)", "price": 69.0, "imUrl": "http://ecx.images-amazon.com/images/I/31q6qi-LcSL._SY300_.jpg", "related": {"also_viewed": ["B0053ORUS8", "B00EC1ZKVM", "B005AT5UZG", "B00ESUIX4S", "B007FQNKRC", "B005EWTL7C", "B005J7YCHG", "B005J7YA4G", "B00EAS8KSW", "B005J7YA64", "B005J7YBRW", "B0085JRRAY", "B00134BWHW", "B00EAS8AA0", "B004BLIQ64", "B00847VJ06", "B00EAS8M0S", "B007FQNLOY", "B005AT5V00", "B00E83X9P8", "B00EAS8MWQ", "B007AUGPGG", "B00ARJD56K", "B00E055H5O", "B008OE0S56", "B00834SJSK", "B006P2R708", "B00AN15O34", "B00H4XH586", "B009T0FGRE", "B008R7FC74", "B006Y5UV4A", "B00H4XH5IG", "B00JT0EGPW", "B00834SJNA", "B00CI3BLPA", "B00834SJS0", "B00H4XH5GI", "B00FRHTSK4", "B00834SJU8", "B00CO1I2FS", "B00EAS89AG", "B00EAS87J4", "B0097CZBH4", "B00EAS86DQ", "B00H4XH5FY"], "buy_after_viewing": ["B00E83X9P8", "B003LSTD38", "B003WUBIZQ", "B002GKBA5G"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]]}