{"asin": "B0007TJ5OG", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Canon's 5.0-megapixel PowerShot SD400 features a 3.0x optical zoom, a large 2.0-inch LCD, high quality VGA video clips at 30fps limited in length only by the capacity of the memory card , high speed USB 2.0, 'My Color' in-camera color editing and a Print/Share button for easy PictBridge direct printing and fast file uploads. Its 5.0-megapixel sensor allows detailed enlargements up to 13 x 17 inches. For fast start-up times, responsive performance and superb, accurate colors and image rendering, the camera features the same high speed DIGIC II processor found in Canon's latest professional series digital SLR cameras.Superb Quality, Great PerformanceColor gradation and white balance accuracy are improved with Canon's purpose-built second generation DIGIC II image processor, to ensure the very finest image quality. DIGIC II speed and accuracy allows sophisticated and complex processing algorithms to be used in image rendering, without any trade-off in camera performance.DIGIC II also helps achieve a fast start up time of just over a second and uninterrupted 2.1 frame per second shooting until the memory card fills. A new USB 2.0 high-speed interface provides one of the fastest upload speeds in this category. An abundance of processing capacity also supports a new high-speed image playback function, image jump function (jump 10 or 100 images at a time or jump to previous shooting date), fast image rotation, and an increased card writing speed.Bigger, Brighter ScreenA new QuickBright LCD function on the large 2.0-inch screen takes the display temporarily to maximum brightness, improving visibility in glary or outdoor conditions. Composition and framing in low light conditions is made easier with a Night Display function, which improves visibility on the LCD without affecting recorded image exposure.New Stills FeaturesA new 'Hold' function increases shoot-and-share enjoyment by allowing users to extend indefinitely the display of a newly shot images, which can then be deleted without switching first to replay mode. The camera returns immediately to shooting mode when the shutter button is pressed again. A new My Colors function gives users pre-capture control over colors in both stills and movies. Nine sophisticated color-editing features include Color Swap, the ability to replace one color with another; Color Accent, the ability to convert all but one color area of an image to monochrome, Vivid Blue, Green, or Red to emphasize the selected primary color; and Lighter or Darker Skin Tone, the facility to darken or lighten a person's skin without affecting the color balance of the surroundings.Shooting ModesA total of 10 shooting modes are provided for maximum versatility and ease of use. Included are six Special Scene modes, which help produce great results in difficult lighting conditions by optimizing camera settings such as white balance and exposure for specific shooting situations. Scene modes include Night Snapshot, Kids and Pets, Portrait, and Underwater (for use with the camera's optional all-weather case). Manual mode allows more experienced or adventurous users to take control of settings such as white balance, metering, ISO sensitivity, and shutter speed, which extend from 15 seconds (in Long Shutter mode) to 1/1500 second.Self-timer functionality improves with the facility to select from range of delays (1 second to 10, 15, 20, or 30 seconds) and the number of shots taken at the end of the delay (from one to ten shots).Improved Movie FeaturesThe PowerShot SD400 also incorporates a number of new advanced video features. My Colors effects can also be applied in movies, and Digital Zoom is now available while shooting video. To minimize deterioration associated with digital zooming, CCD control is optimised to capture maximum information from the CCD. Users can record up to one minute at 60 frames per second (fps) for smooth in-camera slow motion playback. Control over slow motion improves with more sensitive, five speed level adjustment, while white balance, and exposure adjusts automatically during video capture. For recording clips suitable for email attachment, a Compact mode provides for recording up to 3 minutes of 15 fps, 160 x 120 resolution files.Built-in AssistantThe Intelligent Orientation Sensor not only rotates automatically images taken with the camera held vertically, it also improves auto white balance, autofocus, and autoexposure by helping the camera's iSAPS 'built-in assistant' processing take into account likely positions of sky and foreground.Advanced AccessoriesAn optional 3 meter depth all-weather case (AW-DC30, not included--must be purchased separately) gives plenty of protection for splashing around, expanding the possibilities of locations into which the camera can be taken. A new optional High Power Flash accessory, the HF-DC1 (not included--must be purchased separately), further extends lighting options and night shooting range. With a guide number of 18 (ISO 100, meters), the slave flash automatically fires in-sync with the camera's in-built flash, ignoring any pre-flash. It can be adjusted to three power output settings based on the aperture value of the camera. The unit attaches to the camera with a supplied bracket that maintains the ability to mount both camera and flash on a tripod.Easy Printing, Easy SharingPictBridge direct printing functionality is supported, for photo prints without the need for a computer. When coupled with DIGIC II Compact Photo Printers such as Canon's new Compact Photo Printer Selphy CP600, the camera/printer combination is capable of producing borderless photo prints in just 63 seconds. ID photo print, N-Up printing and movie clip series printing are also supported. A postcard date impression mode imprints the date/time on each print.Software and Access to Canon iMAGE GatewaySoftware supplied includes ZoomBrowser EX 5.1 (Windows) and ImageBrowser 5.1 (Mac) for viewing, managing and archiving images. Other software includes PhotoStitch and PhotoRecord, plus photo manipulation software ArcSoft PhotoStudio. Drivers include TWAIN (Windows 98/2000) and WIA (Windows Me). Picture Transfer Protocol (PTP) support allows the camera to connect to any Windows XP (SP1 - 2) and Mac OS X (v10.1.5 - 10.3) system without the requirement for a driver installation.Camera ownership entitles the purchaser to register for 100MB storage space on the Canon iMAGE Gateway, an online gallery where images and movies can be stored in albums and shared to selected friends and family. New My Camera functions (such as shutter sounds and start up images) can also be downloaded to the camera from Canon iMAGE Gateway.What's in the boxPowerShot SD400 Digital ELPH, wrist strap WS-700, 16 MB SD Memory Card, battery pack NB-4L, battery charger CB-2LV, Digital Camera Solution CD-ROM, AV cable AVC-DC300, interface cable IFC-400PCU", "title": "Canon Powershot SD400 5MP Digital Elph Camera with 3x Optical Zoom", "price": 11.49, "salesRank": {"Camera &amp; Photo": 7149}, "imUrl": "http://ecx.images-amazon.com/images/I/51V1XRYAYSL._SY300_.jpg", "related": {"also_bought": ["B000J47W12", "B003F3ZFVS", "B000GGOKN6", "B00065L5SU", "B000IBU4IY"], "buy_after_viewing": ["B003F3ZFVS", "B003VNKNEQ", "B000GGOKN6", "B000IBU4IY"]}}