{"asin": "B001OAKV3G", "description": "Taking gamers as close to war as they'll ever want to get,Operation Flashpoint: Dragon Risingis the much anticipated return of the genre-defining military conflict simulator. Set to deliver the total combat experience,Flashpoint: Dragon Risingwill challenge players to survive the chaos and rapidly evolving situations of modern warfare in a new contemporary theater..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Realistic Marine field combat.View larger.Loads of weapons &amp; vehicles.View larger.Careful attack planning is key.View larger.Players will experience the intensity, diversity and claustrophobia of a modern conflict from the unique perspectives of an infantry marine, a helicopter pilot, a Special Forces officer or a tank commander, each engaged against the full force of the Chinese People&rsquo;s Liberation Army (PLA) on a scale never previously experienced in a military action title.StoryThe 220-square-kilometer island of Skira, located off the eastern coast of Russia, north of Japan, is an oil-rich Russian-controlled island that stands on the brink of war. An airborne division of the PLA lands to claim the island as the sovereign possession of the People&rsquo;s Republic. Russia turns to the US for support aid and they&rsquo;re quick to respond. Sending in the USS Iwo Jima, an expeditionary force of US Marines launch an assault on the strung out, but dug-in Chinese force. Can the situation be defused before this flashpoint turns white hot and an all-out global war between the superpowers erupts?GameplayOperation Flashpoint: Dragon Risingis an open-world tactical shooter designed to realistically represent modern infantry combat. In it players will utilize the game's Quick Command radial menu to dole out commands to their unit. These commands include directives like ordering them to stay put, to follow you, to fire at will or only after your lead, and to assemble into various tactical formations. With a wealth of weapons and vehicles available, engagements can play out very differently depending on tactics and the pros and cons of chosen armaments. The game features set missions as well as quick fight, fire team engagement and several multiplayer modes for varied gameplay. Another prominent and realistic gameplay consideration is its extensive and persistent damage model. This relates both to the environment and the soldiers under player's command in that buildings destroyed, stay destroyed and casualties can be inflicted immediately with a single bullet or develop from wounds not tended to.Key FeaturesOpen-World Gameplay- Gameplay is completely open and objectives are assigned as they would be in real life. In addition, all building can be entered, all vehicles commandeered and weapons and ammunition scavenged.Artificial Intelligence- AI tactics are developed out of actual US training manuals ensuring intelligent responses to tactics in changing circumstances and a sense of self-preservation.Extensive List of Weapons and Vehicles- Utilize more than 70 real-life weapons supporting realistic ballistic system and more than 50 land, air and sea vehicles.Varied Difficulty Levels- Choose from difficulty levels which either keep you apprised via heads-up-display of crucial info like enemy units sighted and ammo remaining, or require you to keep track of these on your own.Advanced Visual Effects- Experience realistic fire, dust and smoke effects that last for minutes instead of seconds.Multiplayer Options- Enjoy co-op gameplay options as well as a 16-player multiplayer online via Xbox LIVE.Xbox LIVE Support- Collect Xbox achievements and add to your gamer score as you battle your way through the game.Online SupportIn addition to the extensive single player campaign,Operation Flashpoint: Dragon Risingwill feature an in-depth multiplayer gameplay options. Players will enjoy co-op play that will enable squads of players to work tactically through the intense campaign together, while online via Xbox LIVE players can partake of 16-player matches (8 vs. 8).Operation Flashpoint: Dragon Risingis set to deliver the most accessible, engaging and visceral sandbox shooter yet seen and it&rsquo;s coming in summer 2009 to Xbox 360.", "price": 26.78, "imUrl": "http://ecx.images-amazon.com/images/I/51-m4tc2iiL._SY300_.jpg", "related": {"also_bought": ["B004PFS9OK", "B000KGD1GO", "B003Q53VZC", "B000WSE2WM", "B000TI836G", "B0050SY5BM", "B000LXIO6I", "B000OCXK6A", "B000Q4VK86", "B005EZ5GQY", "B000PE0HBS", "B002SRSQ72", "B000X25GX6", "B0056WJA76", "B00320JDWG", "B000SQ5LQ4", "B0037LTTRO", "B000A0EFJW", "B003VWGBC0", "B0050SYPV2", "B000WEQL02", "B000SFK0NO", "B000G7PMXC", "B00AJGVIC4", "B0009S4UOA", "B000BLM5Q0", "B00G6MW5CC", "B001ASJIRM", "B001D25M1Q", "B00EVWYF0E", "B003P9C6QY", "B000O5FUQ0", "B001QXNBJM", "B002BSA1MQ", "B00BU3WWOS", "B00354NAYG", "B004EW7LSY", "B0050SYV70", "B0022TNO7S", "B0050SY9WC", "B000G7YRHO", "B0016B28Y8", "B000R0RHPY", "B00503E8S2", "B0050SY77E", "B000CBVC0Y", "B003S2MXRA", "B000BLNFPA", "B005GM3Y5U", "B003H0CC2O", "B002V16T0Q", "B000QU1CDS", "B001REZLY8", "B0042GW7C2", "B000ZK698C", "B00149ILCK", "B0086V5V9A", "B0076ZPYPI", "B003O6G5TW", "B002DC8GKE", "B0058VI1SO", "B001TOQ8J8", "B001AWIP68", "B000O5DPJE", "B0009Z3IWS", "B0013RATNM", "B000Z3VI58", "B0016NRS96", "B000ZKDOV2", "B00EFFW0HC", "B0002CHIWY", "B001HWB68K", "B001RTCOWK", "B000XYUVAC", "B004LWEKCM", "B000RHZ9JI", "B000UUFQZE", "B00886WO5W", "B000YDIYEW", "B000F3AADE", "B0014ULQB2", "B004UDLRMS", "B002BXJ87K", "B003VKLA6E", "B00CPKUV7K", "B001NY42JC", "B0030GBUCS", "B0050SYFM6", "B0023CBY4E", "B001SH7YMG", "B0010AYJXI", "B0016NRS8M", "B000HKGIOA", "B000R0RHA4", "B001UWGDC6", "B0050SY4DG", "B002I098JE", "B004JSDQPU", "B000BLM5PG", "B001GJ306U"], "bought_together": ["B004PFS9OK", "B0050SY5BM"], "buy_after_viewing": ["B004PFS9OK", "B003Q53VZC", "B000KGD1GO", "B002I098JE"]}, "salesRank": {"Video Games": 5558}, "categories": [["Video Games", "Xbox 360", "Games"]]}