{"asin": "B00000PLUW", "description": "With a sub-$100 price tag and a massive software library, the Sony PlayStation is the undisputed king of home video game consoles. Although the PlayStation is no longer the fastest machine on the market, it does boast the broadest selection of software. Some of the hottest console games available today are created exclusively for the PlayStation, including several modern-day video gaming classics (Metal Gear SolidandCrash Bandicootto name a few).The Sony PlayStation truly shines with 3D-rendered action games, such asTomb RaiderandSyphon Filter. These and other 3D-based titles place players in the middle of elaborate gaming environments that take full advantage of the system's ability to render up to 360,000 polygons per second. The PlayStation also has the capability to display 16.8 million colors simultaneously and can support full-frame video playback at 30 frames per second. In addition to impressive graphics, the PlayStation also offers CD-quality sound. Each PlayStation disc has the capacity to store up to 650 MB of data--significantly more information than can be stored on cartridge-based games. As an added bonus, the PlayStation will even play your favorite music CDs (accompanied by a selection of cool graphics).Additionally, the PlayStation now comes packed with Sony's impressive dual shock controller, which allows players to feel every punch, kick, and rumble during gameplay. The controller features dual-analog thumb joysticks and round rubber grips for improved game control and comfort. Separate accessories that could enhance the PlayStation experience include an additional controller--allowing two-player action--and a memory card so players can save their progress in a game.--Brett Atwood", "price": 399.99, "imUrl": "http://ecx.images-amazon.com/images/I/41VQ39oG%2BrL._SX300_.jpg", "related": {"also_bought": ["B0015MMN6G", "B00000I1BQ", "B00000DMAR", "B0045L3SNQ", "B00004YRQ9", "B000GACEHQ", "B00000JRSB", "B00005MA97", "B00000I1BR", "B001TEYMRI", "B0015IXKSK", "B00004ZEEH", "B00000IODY"], "bought_together": ["B0015MMN6G"], "buy_after_viewing": ["B000K6TOK6", "B00004Y57G", "B0045L3SNQ", "B00000I1BY"]}, "salesRank": {"Video Games": 41296}, "categories": [["Video Games", "More Systems", "PlayStation", "Hardware", "Consoles"]]}