{"asin": "B00165XQWW", "description": "Logitech V450 Nano Cordless Laser Black Mouse Cordless Laser Mouse for notebooks. You're always on the go,always looking for the next opportunity. With itslaser precision, 12 months battery life, and ergonomic design, the V450 Nano gives you everything you need to get the job done. Features: * Laser precision: Enjoy smoother cursor control on virtually any surface. The V450 Nano outperforms ordinary optical mice. * Powerful, reliable connection: Logitech's advanced 2.4 GHz wireless dramatically reduces interference with 300 times faster data rate.** Virtually no delays or dropouts. Enjoy all the benefits of a cord with the convenience ofcordless. * 12 months battery life: Minimises hassle and helps you stay more productive. Convenient on/off switch saves even more power. Battery-indicator light eliminates surprises. * Be more mobile. Plug-and-Forget Nano-receiver: Barely largerthan a coin - the Nano-receiver is so small that once you plug it into your notebook, you can forget about it. Your mouse is always ready to use. *Storable Nano-receiver: Store the Nano-receiver inside the mouse, if necessary. When stored inside the battery compartment, the mouse turns off automatically. * Sculpted, ergonomic design with softrubber grip: Work longer in more comfort. * Sculpted keys: Position fingers naturally.  Specifications: Connection Type: Cordless Hand Orientation: Ambidextrous Tracking Method: Laser Scrolling Capability System Requirements: PC: Windows XP or Windows Vista; USB port  Mac: Mac OS X 10.3.9 or later; USB port", "title": "Logitech V450 Nano Cordless Laser Mouse for PC and Mac", "price": 24.99, "imUrl": "http://ecx.images-amazon.com/images/I/41-Vo3a3oNL._SX300_.jpg", "related": {"also_bought": ["B000GABCY2", "B00325ME7W", "B005KSAHZU", "B003NR57BY", "B004MF11MU"], "buy_after_viewing": ["B003NR57BY", "B0082D5660", "B000GABCY2", "B007T1CTDE"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Mice"]]}