{"asin": "B004S7Q8CA", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]], "description": "In-ear canal headphones that reproduce powerful and dynamic deep bass sound. The new three-model Xtreme Xplosives, or XX, series combines aggressive new design with JVC&#x2019;s traditional high-quality build and style to meet the needs of today&#x2019;s music enthusiasts in comfort, sound and price.The series includes an inner-ear headphone, on-ear model and an around-the-ear headphone. All three XX series models feature a bass port for outstanding bass reproduction, a durable rubber protector for impact protection and to help withstand heavy use, and a gold-plated 3.5mm stereo plug. The most compact style in the line is the HA-FX1X inner-ear headphone, which features a 10mm diaphragm with neodymium magnet and superior sound isolation by including three different size silicone ear pieces. Ergonomically designed to provide comfort in any size ear, the HA-FX1X provides a snug, secure fit. The HA-FX1X also comes with a handy carrying case. 2.6mm-thick and robust 1.2m pure copper cable (Y-type) Special hard carrying case included S/M/L silicone ear-pieces included Gold-plated 3.5mm stereo straight plug iPod, iphone and iPad compatible.", "title": "JVC HAFX1X Headphone Xtreme-Xplosivs", "price": 26.79, "imUrl": "http://ecx.images-amazon.com/images/I/31Qgav5LcFL._SX300_.jpg", "brand": "JVC", "related": {"also_bought": ["B0073XY5LC", "B001EZYMF4", "B00D07CJQS", "B007B5V2L8", "B0046SN13U", "B0073XY5HG", "B003EM8008", "B007HIT0GS", "B004VLYIE8", "B004RE3YU8", "B00IER1ZP0", "B00I4C5QQE", "B009BKVYZK", "B004PEIG12", "B009UEBQIM", "B007VEQ2UU", "B000669482", "0812968255", "B000QSNYGI", "B00I0DI0Z6", "B00C30HUQ2", "B004LTEUDO", "B0073FCPSK", "B000V2ACH8", "B002HHREU8", "B009QZH7BU", "B002GYVFSY", "B00HUNUOJW", "B003ELYQGG", "B00DVBB0XQ"], "bought_together": ["B003EM8008"], "buy_after_viewing": ["B003EM8008", "B001EZYMF4", "B00H2QUD9S", "B00H2QUBMW"]}}