{"asin": "B004H8FNCQ", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "Bloggie 3D CameraIn-your-face action.Two lenses, three dimensions. The Fun and innovative Bloggie 3D captures high-definition video in 3d and 2D.3D in your pocketAdd a dazzling new dimension of excitement to your videos. Dual lenses provide dynamic 1920x1080 3D HD video for a richer, more realistic 3D experience while offering the option to record in exquisite 2D 1920x1080 HD.No glasses neededThe moment you record the action, you can view it instantly in 3D right on the camera's screen. No 3D glasses are required. Just shoot the video and enjoy it on the crystal-clear LCD.Share it on YouTube 3DShow off your latest 3D videos to all of your friends on YouTube 3D. Just upload the 3D action and share it with your friends. All they need is a pair of inexpensive red- and blue-lens glasses.Easy shooting. Easy sharingNow you can record and share those must-see moments easier than ever. Every Bloggie captures HD video and fits right in your pocket. Best of all, uploading your videos to the internet is a cinch.ShootWhen fun happens, your Bloggie is there. Shoot life's must-see, must-share moments in beautiful high definition.Full HD 1080P VideoCapture beautiful, 1080P video in the web-friendly MP4 format, perfect for uploading to sites like YouTube. The handy HDMI out even lets you watch videos on your HDTV.Razor Sharp StillsCapture up to 12.8-megapixel stills with impeccable detail for cropping shots or large prints. You can even use the Dual Record feature and simultaneously take pictures while shooting video.Image StabilizationGot shaky hands? SteadyShot&reg; image stabilization technology is built in to help reduce blur, making your videos and photos look even better.Auto-Macro shooting and 4x digital zoomWith the Bloggie 3D camera you'll be able to take pictures or video from as little as four inches away, perfect for capturing a business card or a new friend's phone number.Sony Exmor CMOS sensor for high-quality video/stills&nbsp;&nbsp;&nbsp;The Bloggie 3D camera's&nbsp; Exmor CMOS sensor delivers&nbsp; high-quality video and pictures with less grain, even in challenging lighting conditions.Face Detection technology for video and stills &nbsp;&nbsp;Face Detection technology recognizes faces and optimizes camera settings for both video and still images, so faces are captured more clearly and skin tones look more natural.Built-in LED Light&nbsp;&nbsp;&nbsp;The Bloggie 3D camera features an LED light that can assist in low-light situations giving you more flexibility when capturing your video.ConnectOnce you've caught the magic on your Bloggie, it's time to connect your compatible Mac, PC or HDTV where you can do so much more.Built in USB ArmNo cables needed. Just flip out the built-in USB arm and connect directly to your computer. It charges the camera, tooShare it LaterTag videos and images on your Bloggie while on the go and mark them for upload to your favorite internet sharing sites the next time the camera is connected to a computer.Built-in rechargeable battery&nbsp;&nbsp;&nbsp;The built-in battery contributes to the Bloggie 3D camera's sleek and stylish design while powering the large 2.4-inch screen and camera functions.HDMI output with 3D support&nbsp;&nbsp;&nbsp;With HDMI output, you'll be able to share your HD Bloggie 3D video with friends and family on your 3D HDTV (3D HDMI cable required/not included).ShareWhy keep the fun to yourself? Connect to your world and share your experiences with friends and family.Share PrivatelySave the good stuff for your inner circle. Personal Space by Sony gives you free private sharing with friends and family when used with the built-in Bloggie software.Share PubliclyUsing the built-in Bloggie software, you can share your videos and photo with a few clicks. The Bloggie makes posting to your favorite social network sites a snap.Compare all BloggiesBloggie 3D CameraBloggie Touch CameraBloggie Duo CameraBloggie CameraKey Feature3D Video and still image recording capabilityCapacitive touch screenSecond LCD for Self-recordingSlim designHD Video1920x1080p MP41920x1080p MP41920x1080p MP41920x1080p MP4Still Images5MP12MP5MP5MPHD Record TimeUp to 4 hoursUp to 4 hoursUp to 2 hoursUp to 2 hoursRecording &amp; Playback on2.4-inch LCD Vertical/horizontal3.0-inch LCD Vertical/horizontal2.7-inch LCD Vertical/horizontal2.7-inch LCD Vertical/horizontal", "title": "Sony Bloggie 3D Camera (Black)", "price": 279.97, "salesRank": {"Camera &amp; Photo": 7956}, "imUrl": "http://ecx.images-amazon.com/images/I/41yCmiPjJ%2BL._SY300_.jpg", "related": {"also_bought": ["B003ZHV70M", "B003ES5ZR8", "B001CCWJBS", "B00BX49C3S", "B0044M2OU4", "B004Z0IDQY", "B0070B64MK", "B00CNW9ZEU", "B003LWYGPE", "B00AR95H0W", "098177413X"], "bought_together": ["B003ES5ZR8"], "buy_after_viewing": ["B003ZHV70M", "B003VNKNF0", "B0043CVH2Q", "B0073N2CTO"]}}