{"asin": "B002P3KMXA", "description": "The Best has just gotten better! - Mobility has Evolved with the Eee PC 1005HA-P.The 10.1-inch Eee PC 1005HA-P Seashell, with Windows 7 Starter Edition and enhanced storage, shines as the ideal netbook for the traveler looking to have it all.It is encased in a smooth pearlescent shell to captivate any onlookers or passers-by.  But the Eee PC 1005HA isn&rsquo;t just looks; inside it features a higher-capacity storage than its predecessors.Plus, it offers great user comfort and convenience with its 92-percent scaled keyboard, multi-touch trackpad, and convenient instant keys &ndash; granting you quick access to Wi-Fi and control of the ASUS Super Hybrid Engine (SHE).Take the Eee PC 1005HA wherever you choose with all-day battery life and enjoy the brilliant clarity of its 10.1-inch LED-backlit display for comfortable computing for hours on end. And its generous 250GB HDD with 500GB of ASUS WebStorage** enables you to store, share, and access your important data anytime, anywhere.Miles ahead of its competition, the Eee PC 1005HA-P provides multi-tasking performance and superior portability, liberating you from wall chargers and bringing you into the future of mobility.Key Features10.5 hours of unplugged all-day computing with ASUS' exclusive Super Hybrid EngineIncredibly spacious 750GB Hybrid Storage for convenient storage on-the-go (250GB HDD + 500GB ASUS WebStorage**)10.1-inch LED-backlit WSVGA screen (1024 x 600)92-percent full-size keyboard for comfortable typingMulti-touch trackpad for effortless controlEasy mobile wireless connectivity via built-in Wi-Fi 802.11n (draft 2.4GHz n) and Bluetooth V2.1SRS surround sound for premium audioStunning looks and convenient mobility with seashell design weighing a mere 2.8 lbs0.3MP webcam and microphone for simple and clear communicationWindows 7 Starter for a more intuitive and reliable interfaceF9 easy recovery for convenient and easy system reinstallation1 year global warranty30-day Flawless Display GuaranteeLearn MoreInspired by Nature, Innovatively CraftedFlawlessly smooth, the Eee PC 1005HA Seashell draws its inspiration from the curvature of an ocean seashell.Its lustrous and glossy exterior is crafted by In-mold Roller (IR) technology, giving it a stylish yet scratch-resistant surface that&rsquo;s perfect for everyday use.It's specially designed to be ultra-compact so you can take it anywhere with you, and its eye-catching style will easily catch the eye of passers-by.The Eee PC 1005HA Seashell is a joy to use and an excellent companion for long trips.Note: This Eee PC features a glossy finish chassis. Reflections in photos may vary. Color of the chassis is single-toned.Battery and Performance Boosting Features You&rsquo;ll Only Get with Eee PCASUS has produced an innovation in PC mobility with the ASUS Super Hybrid Engine (SHE) to give you ultimate control of your Eee PC 1005HA.With a hot key above the keyboard, you can instantly command the processor to run faster for more performance or reduce speed to increase battery life.Backed with a high density Lithium Ion battery, the Eee PC 1005HA packs more power per charge for up to 10.5 hours of unplugged use when you are out and about.The Eee PC 1005HA Seashell is powered by the Intel Atom N280 processor. Built with the world&rsquo;s smallest transistors, the Intel Atom N280 processor uses only 2.5 watts of power, which is less than 1/10 of the power consumption of ordinary desktop processors.Even More StorageThe Eee PC 1005HA-P hard drive has been expanded to give you 250GB of storage capacity and comes with an additional 500GB of ASUS WebStorage**, a free and secure database to store your treasured data.ASUS WebStorage** allows you to easily share and safeguard your movies, music, and files, so you can access them anywhere that has an online connection.Get the Big Picture in a Small FrameA brilliant 10.1-inch LED-backlit display makes reading documents and surfing the Web comfortable and easy.The Eee PC 1005HA features the latest generation of LED-backlit technology for ultra-thin, ultra-bright, and energy-efficient portability and versatility.With a 1024 x 600 resolution screen, you can coast through most of your favorite web pages without having to resize your browser or scroll left and right.The 1005HA-P also features a brilliant Color-Shine glossy display normally found on high-end notebooks. With Color-Shine, your movies, games, and photos are displayed in true and vibrant colors.Markedly Comfortable. Perfectly Concise.The Eee PC 1005HA Seashell comes with a 92-percent full-size keyboard that&rsquo;s ergonomically designed to reduce fatigue and offer a more comfortable experience during prolonged use.The Eee PC 1005HA also features a user-friendly multi-touch trackpad that helps you navigate documents and web pages.With a simple touch of your fingertips you can effortlessly scroll up and down, and zoom-in and out, so that every detail is brought front and center.Easy Connectivity to Nationwide HotspotsThe Eee PC 1005HA Seashell connects you to your wireless world with built-in 802.11 b/g/n Wi-Fi and Windows 7 Starter to deliver ultimate wireless accessibility.Plus, its integrated Bluetooth V2.1 gives you the flexibility and convenience to sync your most commonly used Bluetooth devices.A spring-loaded Plug-and-Play flash card slot (MMC/SD/SDHC) expands your storage capability so you can view and share your digital photos, videos, and external data files instantly.A built-in 0.3 megapixel webcam and a microphone combine to give you clear video conferencing so you can have clear on-the-go video chats with family and friends.Note: This Eee PC features a glossy finish chassis. Reflections in photos may vary.Quick Recovery with Just One KeyNo more scrambling to find restore discs, the Eee PC 1005HA features a quick built-in recovery program that can restore your system to its original factory settings by simply pressing F9 three times during start-up.Coupled with ASUS WebStorage, this means you can now easily back-up your data prior to system recovery so you can pick up wherever you leave off without issue.Eee PC with Windows 7 &ndash;Life Made EasierExplore the great new features of Windows 7 Starter with the Eee PC 1005HA-P.  Featuring optimized energy-saving features and easy-to-use shortcuts, the Windows operating system is redesigned to give you an enhanced user experience making your everyday tasks simpler than ever before.  Plus, Windows 7 has easy networking sharing that helps connect you instantly to Wi-Fi hotspots and networking hubs.  Share more with friends and surf the Web better with Windows 7 and the Eee PC 1005HA-P.Windows 7 Starter makes small notebook PCs easier to use because it puts less between you and what you want to do &ndash; less waiting, less clicking, less hassle connecting to networks. Starter combines the latest in reliability and responsiveness with the familiarity and compatibility of Windows.Get more features with Windows Anytime Upgrade.  A small notebook PC running Windows 7 Home Premium is even easier to use. The new taskbar and advanced navigation features make launching programs, opening files, managing windows, and getting around your PC faster and easier. Personalize your PC to be just the way you want it with helpful gadgets and desktop themes &ndash; even turn your desktop into a slideshow of your favorite photos.  You get the best entertainment experience on a PC; with Windows Media Center, you can watch, pause, rewind, and record TV.Don&rsquo;t forget&hellip; Microsoft Office is not part of Microsoft Windows. In order to get the most out of your new PC, don&rsquo;t forget to purchase a Microsoft Office suite.Learn more about Microsoft Office 2007* Internet access required.  Free TV content varies by geography. Some content may require additional fees.WarrantyCustomer Warranty &ndash;The Industry's Most Complete Netbook Care Package1 Year Global Warranty6 Months Battery Warranty30-Day Flawless Display Guarantee: If you discover one defective bright dot within 30 days of purchase, ASUS will replace the panel at no cost.Free one-way standard shipping24/7 technical supportWhat's in the BoxEee PC 1005HA-P Seashell (Black)Travel SleevePower Adapter &dagger;User ManualWarranty CardRecovery DVD / Support CDSpecificationsOperating System:Genuine Microsoft Windows 7 StarterDisplay:10.1-inch 1024x600 LED-Backlit Widescreen LCD (Color-Shine/Glossy Screen Technology)Intel CPU:Intel Atom N280Wireless Data Network:WLAN: 802.11b/g/n (draft 2.4GHz n) &amp; Bluetooth V2.1 + EDRMemory:1GB DDR-2 (Memory size is upgradable to 2GB)Hybrid Storage:250GB HDD + 500GB ASUS WebStorage**Camera:0.3M PixelsAudio:Stereo Speakers, High-Definition Audio CODEC, Built-in microphoneStorage Cards:2-in-1 MMC, SD(SDHC) flash card slotInput/Output:1 x VGA connector, 3 x USB 2.0 ports, 1 x LAN RJ-45, 2 x audio jacks: Headphone &amp; Mic-inBattery:10.5 hours* Li-Ion battery &dagger;Dimensions:10.31 (W) x 7.01 (D) x 1.02~1.44 (H) inchesWeight:2.81 lbs (with battery)Color:Black*Operation lifetime subject to product model, normal usage conditions and configurations.**ASUS WebStorage is a complimentary trial service for 1 year after registration. Actual storage capacity varies by model.&dagger; To recharge using the AC power adapter, power plug must be fully pushed into the power socket on the Eee PC until it clicks firmly into place.All specifications and terms are subject to change without notice. Please check with your supplier for exact offers on selected models. Products may not be available in all markets. Product may not be exactly as shown in images.Check Out Other ASUS Products and AccessoriesASUS Eee PC Seashell Optical Mouse - BlackIts slim and sleek design makes the Eee PC Seashell Optical Mouse the perfect accessory for your Eee PC Seashell.ASUS Slim External Optical Drive/DVD WriterCreate and read CDs or DVDs with speed, style, and simplicity with the ASUS Slim Extrenal Optical Drive and your Eee PC.ASUS Thin and Light UL30A-X5 LaptopLooking for great battery life and processing power?  Check out the Amazon exclusive thin and light UL30A-X5 Laptop.Eee PC Touch T91 Tablet NetbookThe Eee PC T91 delivers ultimate portability and simplicity with an easy-to-use touchscreen that enables user to effortlessly navigate applications and the Web at a press of a finger.", "title": "Asus Eee PC 1005HA-PU17-BK 10.1-Inch Intel Atom Netbook Computer (Crystal Black)", "price": 14.9, "imUrl": "http://ecx.images-amazon.com/images/I/41R6MjuDfWL._SX300_.jpg", "related": {"also_viewed": ["B00251BKCO", "B002PY7P02", "B0071N3AYC", "B0071N6AC6", "B009P7LL2A", "B0071N3BJ6", "B008XKHG9W", "B007582KGM", "B002UEC3AY", "B00F8QW4RS", "B00BQH8QTI", "B00COZRNX6", "B00EC4QJAU", "B00CPIF4G0", "B00AAIC5S2", "B002TBAFAI", "B00KMRGF28"], "buy_after_viewing": ["B003X306SW", "B001342KM8"]}, "categories": [["Electronics", "Computers & Accessories"]]}