{"asin": "B001FORGMK", "description": "The SAL70400G lens is a 5.7x super telephoto zoom lens and the latest addition to Sony&#x92;s G-series line of premium lenses. Designed to deliver extremely sharp descriptive performance across its wide focal length range, it is ideally suited for sports, action and wildlife photography.Constructed of 18 elements in 12 groups, it includes two extra-low dispersion glass lenses for high contrast, sharp details, and exceptional center-to-edge resolution with minimal chromatic aberration. A circular aperture with nine diaphragm blades is utilized to achieve natural, aesthetically-pleasing de-focusing effects.With a minimum focus distance of 1.5m and maximum magnification of 0.27x, the lens delivers best-in-class performance. Like the SAL1635ZA lens, focus drive is provided by its SSM system, which offers the speed and rotational precision often required for telephoto shooting. Additionally, the lens has an internal focusing system for faster auto focusing.A focus-mode/range switch and three focus-hold buttons have been added to the lens barrel for enhanced operability.When attached to the flagship a900 camera body, the AF hold buttons can be customized to activate the intelligent preview function.", "title": "Sony SAL70400G 70-400mm f/4-5.6 G SSM Lens", "imUrl": "http://ecx.images-amazon.com/images/I/41c8MVpN4qL._SY300_.jpg", "related": {"also_bought": ["B000UPNQCY", "B00004ZCJM", "B0096W1P6G", "B0013GWBIE", "B00FSB7432", "B0097DFR8G", "B003LYKLCO", "B003MQWN40", "B000VXPEWK", "B0000BZLBQ", "1133597130", "B005K8AUYI", "B00FRDUZUK", "1133948863", "B005OB2L7U", "B0097DFRMC", "B0097DFRO0", "B000G2BHTU", "B0012DHL10", "1285838424", "B001BRP0UG", "B0096W1O30", "B005LFT3QG", "B005K8AUNE", "B005IHAIC0", "B000DZH7J4", "B00004ZCI3", "B000BH5OW6", "B003EK5WHO", "B0062W02C6", "B0000BZL9J", "B004AH10K8", "B000VXQZV4", "B000VXVIJS", "B005GMV7LI", "B001FORHOW", "B0007YZLIA", "B000VXVIJ8", "B000DZH7JO"], "buy_after_viewing": ["B00BFQHGV4", "B00FSB7432", "B00I8BICEO", "B000UPNQCY"]}, "categories": [["Electronics", "Camera & Photo", "Lenses", "Camera Lenses", "Digital Camera Lenses"]]}