{"asin": "B000V9T2JA", "description": "From the ManufacturerErgonomic design provides a comfortable supplement to mouse and keyboard input.PersonalizeAdd your own distinctive touch. Change the face of your communications by handwriting notes, making quick sketches, and adding your personal signature to digital documents. With the natural feel of pen-on-paper, Bamboo makes it quick and easy for you to get your point across.WriteExpress yourself. Combine Bamboo with Mac Inkwell or Microsoft Windows Vista and Office 2007 to jot notes, handwrite email, mark up documents, and enter handwritten text anywhere typed text is accepted. Bamboo gives you precise pen control with 512 levels of pressure sensitivity.NavigateMove around your desktop quickly and easily. Bamboo helps you select files, switch views, and open applications with a flick of the pen. Unleash new pen-specific features and capabilities that help you find your way when you combine Bamboo with Mac Inkwell or Microsoft Windows Vista and Office 2007.SimplifyBamboo is a more comfortable and natural way to work, giving you a supplement to keyboard input and helping reduce mouse-related stress on your hand and wrist. ExpressKeys provide shortcuts to your most commonly-used keystrokes, and the Touch Ring allows you to zoom and scroll with the touch of your finger.Quick access to user-defined shortcuts with four Express KeysFeaturesWorks with new handwriting recognition, inking and pen features in Windows Vista (all editions but Home Basic) and Apple operating systems (OS X)Supports widescreen displays and has a textured work surface for a natural pen-on-paper feelHigh resolution and report rate for outstanding accuracyPrecise control with an active area of 21 square inches and 512 levels of pressure sensitivity on the penEasy scrolling and zooming with finger-sensitive Touch RingPatented, battery-free pen with customizable buttons for comfort and reliabilityDetachable USB cable unplugs from your computer and your tablet for easy storage and transportIncludes one year warrantyFree US-based technical support availableWhat's in the BoxBamboo pen tabletBamboo penPen standUSB cableQuick start guideInstallation CD (includes tablet driver and electronic user manual)", "title": "Bamboo (Small) Pen Tablet with Pen Only", "price": 75.99, "imUrl": "http://ecx.images-amazon.com/images/I/31%2BC0iBZMFL._SX300_.jpg", "related": {"also_viewed": ["B008E0U51W", "B000V9NU2A", "B00ISSKQNW", "B0089VGPII", "B005HGBEZ2", "B003OBZRPU", "B005HGBF9W", "B002OOWC3S", "B00EN27U9U", "B00EN27TCI", "B008Y40DQU", "B00DKW816K", "B005HGBEYS", "B00EN27UC2", "B000XQK2OU", "B00FR8DMU0", "B002OOWC4C", "B008E0RSYY", "B003XQO38I", "B00A40U0OC", "B009KPUHCM", "B0013T1Z7O", "B00DM00B9A", "B00DTPYWBG", "B006SYG6UA", "B003XQO392", "B00A40GPM8", "B00DMWC7J0", "B008Y431CS", "B002OOWC42", "B004C4ZT0G", "B00JK7Z856", "B00DKRLAFY", "B00IOG0K4I", "B0003009BC", "B00DMZBCRA", "B00GIGGS6A", "B003XQO38S", "B00EVOXM3S", "B00HPYY5QE", "B00EQW6LYC", "B0084KGMEQ", "B002LAK17Y", "B0067PLK5G", "B000BBAL0W", "B001TUYTZM", "B00EQW6LY2", "B00DZJ6USY", "B00EQW6M2S", "B0076HMDQO", "B00EN27SHY", "B00IOC9368", "B000V9RL3Y", "B00EN27ULS", "B008E0ND66"], "buy_after_viewing": ["B00EN27U9U", "B00EN27TCI", "B008E0U51W", "B008I647MA"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Input Devices", "Graphics Tablets"]]}