{"asin": "B006M7IDTA", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Input Devices", "Touch Pads"]], "description": "Bluefin is an accessory that seamlessly unites your Apple Wireless Keyboard and Magic Trackpad into one unified input device (KEYBOARD AND TRACKPAD NOT INCLUDED). Its minimalist design meshes perfectly with your Apple devices, while giving you maximum control over your multi-touch computing experience. With Bluefin you can click, type, tap, swipe, pinch, zoom and gesture from anywhere you want - completely untethered. Bluefin's flexible design accommodates both left and right hand users, allowing you to place the trackpad on either side of the keyboard without any loss of functionality. Since Bluefin leaves the top surface of your input devices free from obstruction, there's nothing to get in your way when typing on the keyboard and you can still click on all the edges of the trackpad without any interference. Connecting your Apple devices is a literally a snap. Simply place your devices on top of the Bluefin and press into place. There are no extra little bits or pieces to assemble, fuss with, or lose. Once connected, Bluefin holds your devices securely in place, keeping them solidly connected together even when turned on end or upside-down. High friction silicone feet help prevent the assembly from sliding on smooth surfaces so you don't have to worry about it wandering across your desk. The included padded power labels allow you to power your devices on and off without having to remove them, simply by pressing your devices together. Bluefin is the ideal solution for taking control of your Mac-connected home theater setup. Whether you're connecting through a MacBook or a Mac Mini, Bluefin makes controlling your Mac on the big screen a breeze. No matter where you use your Apple input devices - on your desk or on your lap, from the sofa or from the lectern, in the boardroom or in the bedroom - Bluefin gives you unparalleled freedom and flexibility over your wireless multi-touch computing experience. Proudly MADE in the USA!", "title": "MeshWe Bluefin Seamlessly Connects Magic Trackpad to Apple Wireless Keyboard (apple white)", "price": 29.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31gDfrd59dL._SX300_.jpg", "related": {"also_bought": ["B003XIJ3MW", "B005DLDO4U", "B000OOYECC", "B005M1777G", "B003XIJ566", "B002TMRZOQ", "B003XLYAWC", "B004RCY198", "B004XQWGHW", "B008LTBJFW", "B007KKVCAU", "B002TLTGM6", "B008JIGL08", "B003BRURLG", "B007477V0Y", "B004CAGDUA", "B007476KRY", "B007B6YPAM", "B00BQYCF84", "B002DGM8U4", "B002DGM8VS", "B005DLDTAE", "B00EFE9OAE", "B006T3RM08", "B00B3Y4FAS", "B0044RUSZM", "B007KB0EGC", "B009K916ZK", "B007X6XJ98", "B002OLM56K", "B0098EYM3A", "B004CADY9I", "B004YLCKYA", "B00GEC3ZJQ", "B00A42Y0PA", "B00C1C1WU2", "B00CRJWW2G", "B004SPPRR4", "B008ALA6DW", "B009HPGD2I", "B008ALAHA4", "B004L9M0B8", "B00CJD5HBI", "B0076W9Q5A", "B008MCZJXG", "B008AL9VXI", "B009C3M7H0", "B008BVNQW4", "B005L9ATK6", "B00CJKW4WQ", "B00IRSDKX6", "B0057CVH6W", "B000AMJC2K", "B00APLKGA8", "B007I5JT4S", "B007VX4L9K", "B00IRUB9IW", "B00870ZHCQ", "B00APLJ58M", "B005IIR9F8", "B00F0JXE04", "B00DB9WCR6", "B004YW7WCY", "B008YLHBEA", "B004LPZBD6", "B0002D0B4K", "B00IU6R2AW", "B00ENZRP0G", "B00B3Y4U4E", "B003Y54NPQ", "B00AQFFSAG", "B008RXYOKY", "B00HVYBWQO", "B00IJ331WY", "B00IBDOB5I", "B00DBV28TG", "B00CEJW0WQ", "B006JRIDHK", "B003L1ZYYM", "B00CKIFPQY", "B004L6MLPQ", "B00B17C5KO", "B00005A1K1", "B00004Z5RA", "B005GGTTZ0", "B0096VD85I", "B009H0XQPA", "B00D6BYDGC", "B00F9FCW7K", "B005QT6F0E", "B00GH92V8C", "B00E3W19MO", "B007PJ4Q4A", "B0088MPO1W", "B004NY9UW8", "B008ALA2RC", "B004CAHTCQ", "B008ALAAV0", "B00GH0N1LM"], "bought_together": ["B003XIJ3MW", "B005DLDO4U"], "buy_after_viewing": ["B003XIJ3MW", "B005DLDO4U", "B000OOYECC", "B005L38VRU"]}}