{"asin": "B001CWT4JI", "related": {"also_bought": ["B001CWNJ9O", "B003YFG0M0", "B0012D301K", "B001CWRH2E", "B001CWRH10", "B000M4W2E6", "B005UO6NRA", "B000Z88BRQ", "B0000TN7MY", "1585420581", "B003LZOTVM", "0399532986", "B004LTOOPI", "B0013D20M4", "B001G7QMYE", "0874778077", "B007QXGYTA", "B000QYNWS2", "B000H82JXG", "0345496027", "B005JAT304", "B0013J0FLQ", "B00BERFHX8", "B002N1TOZ6", "B007QVIBT8", "B000RU3HYE", "B001GAOIO2", "B00G9G16A2", "B000GG5OU4", "B001A39C5A", "B001JQGTAY", "B0062QLGIQ", "B000H84D2G", "B001HDRHR8", "B0011DTL78", "B000GG5OUY", "B006IM9JHY", "B001GLCES8", "B000OD937E", "B001JD8X7E", "B00IKCI6X8", "B003BV1C4I", "B002JZ8ETS", "B000WJICDG", "B00171KTP2", "B000FHZNQE", "B00GP1DDES", "B002NGOORY", "B001ET76AI", "B003P7YVTQ", "B004158IWM", "B000OLEC6I", "B0010DLYR4", "B004QM0OJ0", "B00LGJMW1Y", "B004GW7WS6", "B002GU5YCG", "B000FLGZIU", "B002R0DR3I", "B000I2079E", "B00BI8OG2Q", "B0009F3RW4", "B00126349K", "B0058UUR6E"], "also_viewed": ["B005UO6NRA", "B003YFG0M0", "B001JQGTAY", "B0000TN7MY", "B000H84D2G", "B0013JWFFA", "B001CWRH2E", "B00A5P821O", "B000AYYK5M", "B005C4VCA6", "B000F5LYAK", "B001CWNJ9O", "B004CQJRE8", "B0012D301K", "B00175XP2C", "B00400B1W2", "B0061ZRTAW", "B00ALIHCHU", "B006IM9JHY", "B00C30TNKI", "B002N1TOZ6", "B00DQSTVRQ", "B0012DEV5E", "B0016ZM9LQ", "B003TJ6Q4S", "B0025ZPC60", "B000K5YM5O", "B00JA6N3PE", "B00CQ7IBFG", "B0083F7LQA", "B003XU8AB0", "B004158IWM", "B001CWRH10", "B0013D20M4", "B0012DEWEO", "B0013J0FLQ", "B006VKRXSU", "B00168H6UC", "B001HDRHR8", "B000GG5OU4", "B000M4W2E6", "B000U3OJ0Y", "B000Z88BRQ", "B0056E9HDG", "0399532986", "0345496027", "B002LUYZE4", "B001G7QMYE", "B000GLRREU", "B0002AHW0E", "B002Z6D0Q8", "B003B3Q3H2", "B001ET76AI", "B00D9W1672", "B00DMAI9MG"], "bought_together": ["B003YFG0M0", "B001CWNJ9O"]}, "title": "SinuPulse Elite Advanced Nasal Sinus Irrigation System", "price": 79.95, "salesRank": {"Health & Personal Care": 6295}, "imUrl": "http://ecx.images-amazon.com/images/I/41b5Lwfj7hL._SX300_.jpg", "brand": "Health Solutions", "categories": [["Health & Personal Care", "Health Care", "Allergy, Sinus & Asthma", "Sinus Medicine"]], "description": "Are you one of the millions of sinus and allergy sufferers? Is your nose stuffed up? Do you experience sinus headaches, allergy symptoms, infections, or post nasal drip? Does your treatment improve your body's disease fighting function, or are you simply treating the symptoms? The SinuPulse Elite&#174; Advanced Sinus Irrigation System effectively cleanses and clears your sinuses gently and pleasantly, a powerful tool for the maintenance of clear &amp; healthy sinuses - Without Drugs.View largerView largerSinus Relief in Less Than a MinuteThe SinuPulse Elite was developed and engineered in Switzerland to be the best and most advanced nasal sinus irrigation system in the world complete with state-of-the-art electronics and Intellipulse&#153; technology. The SinuPulse Elite&#174; is an award-winning sinus irrigation system which features the patented SinuMist&#174; function.  It is the only sinus irrigator capable of delivering both a gentle pulsating mist spray for doctor recommended rinses, solutions, or simple moisturizing and a more thorough cleansing pulsating rinse to clear the sinuses and massage the nasal cilia to their normal, healthy state. It really is like having two units in one!  The oscillating stream of saline gently breaks down bio-film and frees your cilia to help you clear your sinuses of infections and foreign substances that can lead to chronic infections and allergy symptoms.The SinuPulse Elite is a soothing drug free device to relieve symptoms caused by sinus infections, sinusitis, allergies and the common cold including: post nasal drip, cough, congestion, sinus headaches, and irritated nasal passages. Recommended by leading health care professionals pulsating irrigation is supported by published medical reports.Nasal Irrigation is believed to have originated over 5,000 years ago in ancient India. The practice of irrigation in ancient times consisted of manually sniffing a saltwater solution into the nostrils to help relieve nasal congestion by rinsing the sinus passages of pollens originating from grasses, weeds, flowers and trees. Modern day neti pots and nasal wash bottles continue this tradition and have changed little over the last 5,000 years. However, advancements have been made in both the design of sinus irrigation delivery systems and the solutions used to clean the nose of inflammatory irritants responsible for allergy and sinus symptoms.Imagine rain drops falling from the sky landing on the soil with a gentle force that breaks apart soil particles. As this process continues, runoff water travels over the ground, collecting more soil particles dislodged by the rain and transports them to a new location. Pulsatile irrigation mimics a cleansing process present in nature. The SinuPulse Elite&#174; pulsating treatment is gentle, pleasant, &amp; soothing leaving you feeling clear and fresh. The sinus system uses ordinary saline, or for best results, our enhanced SinuAir&#174; nasal irrigation solution.The SinuPulse Elite advanced features include: state-of-the-art Micro Touch power button, electronic LED display, encapsulated motor and pump assembly to resist wear from saline, improve durability and performance. fully adjustable pressure and pause control on handle for finger tip control, hypo allergenic design, calibrated pulse rate, measurement scale, hi-capacity water tank with hygienic cover, soft color coded nasal tips for family members, and sinus treatment information.View Product DemoAllergy StatisticsAffects as many as 40 to 50 million people in the United States.Allergic diseases affect more than 20% of the U.S. population.Allergic diseases are the sixth leading cause of chronic disease in the United States.At least 35.9 million people in the United States have seasonal allergic rhinitis (hay fever).Approximately 14.1 million physician office visits each year are attributed to allergic rhinitis.The estimated overall costs of allergic rhinitis in the United States in 1996 totaled $6 billion.Sinusitis develops in approximately 31 million Americans each year.Chronic sinusitis affects nearly 35 million people in the United States.18 million office visits to primary care physicians resulting in a diagnosis of sinusitis annually.Overall health care expenditures attributable to sinusitis in the United States  over $5.8 billion.The incidence of sinusitis in asthmatic subjects ranges from 40 to 75%.\"I recommend the SinuPulse Elite from Health Solutions Medical Products. Our team has been using their sinus irrigation products as part of our regular healthcare regimen. We have found the products help our players that suffer from allergies and sinus problems.\"Gary Vitti,6X NBA World Champion Head Athletic Trainer of the Los Angeles Lakers&#160;\"Our players and staff have been working with the sinus irrigation products from Health Solutions Medical Products Corporation and the SinuPulse Elite with great results. They have definitely been great holistic tools to use in our training room for our players that suffer with chronic allergy and sinus problems.  I highly recommend their use as an effective and natural treatment for allergy and sinus relief.\"Jim RamsayHead Athletic Medical Trainer, 4X NHL Stanley Cup Champion New York RangersHead Athletic Trainer for the gold medal-winning Team Canada at the 2002 Winter Olympics&#160;\"I recommend the SinuPulse Elite&#174; from Health Solutions, it is the premier state-of-the-art  nasal irrigation device and the only one capable of delivering both a gently moisturizing  mist spray or a more thorough cleansing pulsating rinse. One of the most therapeutic measures in completely eliminating a sinus infection and treating sinusitis. It can help quickly and dramatically.\"Dr. Robert S. Ivker, Author of the Best Selling Book \"Sinus Survival\"President, American Holistic Medical AssociationFellow, American Academy of Family PhysiciansClinical Instructor, Dept. of Family Medicine and OtolaryngologyUniversity of Colorado, School of Medicine -  Boulder, COSinuPulse Elite&#174; Contents:SinuPulse Elite&#174; Advanced Nasal Sinus Irrigation System2 Sinus Tips  (1 pulsating stream and 1 pulsating spray)2 Throat Tips (1 pulsating stream and 1 pulsating spray)SinuAir&#153; Saline Mix (30 packets)Sinus Survival Tips, by Dr. Rob IvkerFree 2 year limited warranty protection on top of standard 1year warrantyFDA Registered, UL and CE Approved"}