{"asin": "B002VPDM2K", "description": "Give your iPhone or iPod a safe, secure place to charge. WallDock's cushioned top and  pivoting dock provide total support without fit inserts. In the office, bedroom, kitchen -  anywhere you need a convenient, cable-free charing solution. Clutter-free design. The cushioned top supports your iPhone or iPod without the need for fit inserts, keeping your area neat and clutter-free. It also hides the connector when not in use for a discreet, attractive charging solution. Fast charging. Don't sit around waiting for your device to charge! The power output of this charger ensures your device is fully charged in a shorter amount of time compared to standard, less powerful chargers. Pivoting dock. The 30-pin dock connector itself pivots which allows your device to simply rest backwards against the support without the need for clunky cradles or fit inserts. Plug-in charging dock. The wall-mounted dock gives your iPhone or iPod a save and secure place to charge. Simply plug the dock into the wall to cradle your iPod or iPhone - this gets your iPod or iPhone up off the floor where it could be stepped on, and up out of the way of spills and countertop messes. Safely charge your device. Plugging your device into a cable-based charger and leaving it on the floor or countertop puts your iPod or iPhone at risk of being stepped on or damaged from spills and splashes. Instead, using a wall-mounted charger elevates your iPod or iPhone for safe and secure charging. Turn any outlet into a dock. In the office, the bedroom, the kitchen - WallDock easily plugs in anywhere you need a convenient, cable-free charging solution. Plus, it's small enough to take it with you when you travel so you're ready to dock and charge when you arrive.", "title": "Digital Lifestyle Outfitters DLA49002/17 Wall Dock for Ipod and Iphone", "price": 19.95, "imUrl": "http://ecx.images-amazon.com/images/I/31QsB9%2BLVVL._SX300_.jpg", "related": {"also_bought": ["B005IV060K"], "buy_after_viewing": ["B005IV060K", "B003JJ6LNY", "B00313JY46", "B00564ZWNU"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Docking Stations"]]}