{"asin": "B0023B14TK", "related": {"also_bought": ["B000VJRUKS", "B0041LXANI", "B001B5CVNC", "B002DM6W2I", "B00272MT3A", "B0040702HA", "B002R5AM7W", "B0023B14U4", "B0040702IE", "B00272MT3U", "B001U5R9YE", "B005GTAH4O", "B001O94GNS", "B003N7NPF4", "B0049U3XQK", "B002OT4NN0", "B002FTII94", "B00009RUCH", "B00CV9MHYU", "B0019I2AYG", "B001S0PWWC", "B0040702HU", "B002R5AM7C", "B002WZ4N40", "B0023B14UE", "B0016BXRB6", "0470879165", "B002EVP85K", "B0016BVKAQ", "B003FMUPA0", "B001HSOFI2", "B00EE8AIW4", "B0043D4V8M", "B001U9SF5M", "1118143957"], "bought_together": ["B000VJRUKS", "B001B5CVNC"], "buy_after_viewing": ["B00272MT3A", "B0040702HA", "B001B5CVNC", "B0041LXANI"]}, "title": "Flip UltraHD Video Camera - Black, 8 GB, 2 Hours (2nd Generation)", "price": 305.99, "salesRank": {"Camera &amp; Photo": 853}, "imUrl": "http://ecx.images-amazon.com/images/I/41s-ZcgRNmL._SY300_.jpg", "brand": "Flip Video", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "UltraHD OverviewEasy-to-use, pocket-sized HD camcorder featuring one-touch recording and digital zoomSimple user interface lets you start capturing HD video just seconds after powering onCaptures 120 minutes of HD video on 8 GB of built-in memory; no tapes or additional memory cards requiredConvenient flip-out USB arm plugs directly into your PC or Mac to launch FlipShare softwarePre-installed FlipShare software lets you easily email videos, edit individual clips, make custom movies, capture still photos from video, and even upload video to sharing sites like YouTube and MySpaceFlipShare&rsquo;s advanced compression technology allows for quick and easy sharing of high-resolution HD video in compact-sized files (via email or publishing online)Comes with Flip Video rechargeable AA battery pack (recharges when connected to USB); also supported by standard AA batteriesLarge 2-inch anti-glare color LCD screen to play back and delete videosHDMI output (mini-HDMI connector) makes it simple to watch video on your HDTVVideo: 16:9 widescreen, HD 720p (1280 x 720) at 30 frames per second (fps) progressive scan; recorded as MP4 filesFlip UltraHD HighlightsThe World&rsquo;s Simplest HD CamcorderThe Flip UltraHD camcorder combines Flip Video&rsquo;s signature shoot-and-share simplicity with the power of vivid, vibrant HD video. UltraHD could not be easier to use: just power on and press record, and you&rsquo;ll be capturing high-quality HD video in seconds.Ultra-Spontaneous, Ultra-FunUltraHD features 120 minutes of record time and an included rechargeable battery pack, so you&rsquo;ll never miss another minute of video again. And because it&rsquo;s ultra-portable, UltraHD lets you capture spontaneous video anytime, anywhere. Whether it&rsquo;s a lazy afternoon in the park; a family vacation; or simply an unplanned, everyday event, your UltraHD will be charged and ready to go. So you never have to say, \"You should have been there.\"Stunning HD VideoWhile it may be small, UltraHD produces stunning HD 720p video that will look crisp and clear on your HDTV. Flip camcorders are known for high-quality video, and UltraHD combines that signature Flip quality with the latest in HD technology. Its 8 GB of built-in memory lets you capture 120 minutes of brilliant HD video, even in low-light situations. Plus, premier AAC audio means your videos will sound clearer than ever, too. And included HDMI output makes it easy to enjoy your videos on your HDTV.Pre-Installed FlipShare SoftwareUltraHD comes pre-loaded withFlipShare software, which makes it easy to organize, create and share your videos:Organize your videos.Drag and drop your videos into folders you've created, or use the automatic date-stamped folders.Create custom movies.Make movies featuring your favorite video clips, and add your own music to provide a more personal touch.Capture still-image snapshots.Use enhanced freeze-frame capabilities to grab a snapshot from any of the thirty frames that comprise each second of your video.Share privately.Send videos to your friends and family using attachment-free emails. Or create private Flip Channels to share your videos with specific groups of friends and family.Share with the world.Publish your videos directly to Facebook, YouTube and other sites, all with the click of a button.Recommended Accessories:"}