{"asin": "B0010YWPZ8", "description": "The LaCie Hard Disk 301304U 1 TB USB 2.0 External Hard Drive, Design by Neil Poulton adds a sleek, sophisticated style to your desktop while delivering high-speed performance as a hard drive. You no longer have to worry about running out of disk space for your latest music, movies, and photos. And with universal compatibility and a compact size, this portable drive lets you easily share your music, photos and video files with your friends and family..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The Lacie Hard Disk 1 TB USB 2.0 External Hard Drive, Design by Neil Poulton offers:1 TB (1,000 GB) of disk space.USB 2.0 for fast transfer rates and universal connectivity.Near-silent operation thanks to a fanless design.7200 RPM and 8 MB of cache for maximum drive performance.The gorgeous, minimalist case was designed by Neil Poulton.View larger.Beautiful, Stunning DesignDesigned by internationally acclaimed designer Neil Poulton, the Hard Disk features sleek and sophisticated styling. The case is entirely black with a fashionable, mirror-polished finish. A cool, blue LED strip on the bottom casts an ambient glow. The ultra-minimalist look will blend perfectly into home entertainment setups and workstations.But don't think the design is just about looking good. Built to optimize heat dissipation so that it can operate without a fan, the drive is also designed for convenience and portability. At just 4.6 x 1.8 x 7.6 inches (WxHxD) and weighing barely two pounds, it can be easily transported into your briefcase, allowing you to shuttle files between your home and office, or move your work between your laptop and desktop with ease.More Space for More MediaWith an additional 1 TB of disk space, the Hard Disk can store up to 70 hours of DV video or 270,000 or over 1 million photos. Instead of having all this data stored on an internal drive on your desktop computer that can't be moved around, imagine being able to carry your entire digital media collection with you on your travels. You can also use the drive to back up your computer files for extra security.Fast Performance and Exceptional CompatibilityUsing the universal and fast USB 2.0 interface, which offers a transfer rate of up to 480 Mbps, this drive will work with both Macs and PCs. Just plug it in and play it. The drive is pre-formatted for use across Windows and Macs, doesn't require any additional drivers, and is ready to go seconds after being removed from the box. The drive features a rotational speed of 7200 RPM and has a cache of at least 8 MB, providing performance that won't keep you waiting for your files to backup or your media to play.A compact, fanless design allows for quiet operation.View larger.The drive is compatible with Windows 2000, XP, and Vista, as well as Mac OS 10.3 or higher. Included in the box is LaCie's 1-Click Backup Software (Windows and Mac), as well as LaCie SilverKeeper Backup Software (Mac) making backups an easy and painless process.The LaCie 500 GB USB 2.0 Hard Disk, Design by Neil Poulton is backed by a 2-year limited warranty.About LaCieEstablished in France in 1989, LaCie is a leading manufacturer of computer peripherals for Windows, Apple and Linux users. With offices and plants in the USA, Canada, Japan, Australia, Europe, Singapore and Hong Kong, LaCie develops and manufactures external storage solutions and color monitors that help professionals and everyday people easily manage their digital lives. LaCie has differentiated its products through original designs and leading-edge technology.What's in the BoxLaCie hard disk, USB 2.0 cable, external power supply, quick install guide, LaCie utilities (preloaded on drive), user's manual, backup software.", "title": "LaCie Hard Disk 1TB USB 2.0 External Hard Drive designed by Neil Poulton 301304U", "price": 209.99, "imUrl": "http://ecx.images-amazon.com/images/I/31v5s-3qtYL._SX300_.jpg", "related": {"also_viewed": ["B0058VIXBY", "B0058VIWTM", "B0078T11QS", "B0042KFLJE", "B0055Q2VS8", "B00EMDP09M", "B0042KFLIU", "B00352LSYW", "B005CG8X1A", "B008SA63Y6", "B005C2BNJI", "B008SA69L8", "B000FJQWJ4", "B000VZCEUI", "B009GXI3QU", "B000WBJDUA", "B008SA6A1C", "B0052MNIAA", "B0012GTJXU", "B0058VIWXI", "B00AK9ZT98", "B005C2BNKM", "B00CGUMSZC", "B00H2V30U2", "B001UI49XA", "B003GQGYBY", "B001KFH6K6", "B00AX9ZAHG", "B0050SI9W8", "B00CGUMSY8", "B002KPUX2S", "B00GXTRAM8", "B00829TIIQ", "B008R7FC74", "B00AJJIWG6", "B001FWEETK", "B00E83X9P8", "B0058VIWUG", "B006B9B2PQ", "B00CGUMSXE", "B002LZV0B0", "B006Y5UV4A", "B00829THK0", "B00CGUMSWA", "B00CGUMTQA", "B00A3U8JV4", "B005J7YBRW", "B002SOKFN8", "B002QEBMB4", "B00CO1I2FS"], "buy_after_viewing": ["B0058VIXBY", "B00E83X9P8", "B0078T11QS", "B0058VIWTM"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]]}