{"asin": "B000U9WVW6", "description": "TomTom's 3rd edition update to the world's bestselling (as of this writing, 8/30/08) portable navigation device features an updated chipset that provides better satellite lock and TomTom's new MapShare technology that lets you add your own map corrections and points of interest, then upload your corrections to and download other corrections from millions of other TomTom users via the TomTom HOME website.The TomTom ONE's 3D driving view offers a clear picture of the road and maneuvers ahead.See the ONE in detail.The device's icon-driven menu system makes using the ONE a snap.Emergency menu gives you fast direct access to emergency numbers and direction to the nearest assistance.Voice instructions are available in over 30 languages. Tom Tom even has comedy and celebrity voices available.MapShare lets you add your own map corrections and POIs, then share them with the entire TomTom user community via the TomTom HOME website.Even though the ONE, 3rd Edition is TomTom's entry-level portable GPS vehicle navigation device, it remains a complete solution with an incredible range of features.Tiny, but ToughA sleek design and a sharp display combine to make the TomTom ONE a vital companion on the road. THe ONE, 3rd edition comes pre-loaded with complete maps for the United States and Canada.Weighing less than 10 ounces and measuring 4.33 x 3.5 x 1.34 inches, the TomTom ONE can be easily installed in any vehicle. An included windshield suction mount holds it in place. Plus, with an operating temperature range of an icy -10 degrees to a sweltering 55 degrees Celsius (14 to 131 degrees Fahrenheit), the navigator is durable enough for New England winters or Arizona summers. The TomTom ONE is powered by an internal lithium ion battery that can be charged from your vehicle's cigarette lighter with the included 12-24V adapter.Easy To UseThe user-friendly design also puts it a step above other navigation systems. The crystal-clear multicolor display makes for exceptionally easy viewing of maps, routes, driving directions, and other traveling information, such as mileage and distance. Measuring 3.5 inches, the TFT display offers a resolution of 320 x 240 to provide brilliant two- and three-dimensional graphics. The device also features 32 MB RAM and 380 MHz CPU, making it responsive and zippy. Using the USB port and the provided cable, you can use your PC to add your own points of interest.With its touch-sensitive screen, the TomTom ONE puts programming and operation literally at your fingertips to make sophisticated technology simple. The built-in database offers millions of points of interest for you to use as destinations or reference points as you plan your trip. ONE will also provide a selection of available routes, giving you the option of avoiding toll roads or choosing between the quickest or the most scenic routes. The database includes zip codes to simplify your route selection, and for extra convenience, the TomTom ONE lets you save the addresses of frequent destinations, making route planning easier and faster than ever. Other display features include a compass mode to assist you with directional orientation, and an anti-glare screen for optimal viewing even in direct sunlight.You Can Hear Me NowONE provides clear and accurate turn-by-turn voice instructions, so that you don't have to take your eyes off the road while your vehicle is on the move. Voice instructions are available in over 30 languages. Tom Tom even has comedy and celebrity voices available, some for free, and others for purchase via download at TomTom's website. One nifty feature is speed-sensitive volume. With this optional feature turned on, your vehicle's engine becomes louder or quieter as your speed changes, the volume adjusts itself accordingly, guaranteeing clear and easy listening.TomTom HOMEHOME is TomTom&#x92;s free software that enables TomTom users to future proof and personalize their devices. Via easy desktop access, any TomTom customer can update maps, download the latest application, celebrity voices and more. TomTom HOME allows TomTom customers to&#x95; Update their TomTom device with TomTom&#x92;s latest software and services automatically and for free&#x95; Easily buy and install the latest maps and European safety cameras&#x95; Download celebrity and character voices&#x95; Pre-plan trip itineraries&#x95; Receive free traffic alerts on their computersWhat's in the BoxTomTom ONE device, suction mount, car charger, USB 2.0 data cable, and installation CD with connection software and manual.Supported LanguagesThe user interface/application comes in the following languages:CatalanLatvianCzechLithuanianDanishNorwegianDutchPolishEstonianPortugueseFinnishSlovakianFlemishSpanishFrenchSwedishGermanTurkishHungarianUK EnglishItalianUS EnglishSpoken navigation instructions come in the following languages:AustralianJapaneseBrazilian PortugueseLatin American SpanishBulgarianLatvianCatalanLithuanianChinese MandarinMalaysianChinese CantoneseNorwegianCroatianPolishCzechPortugueseDanishRomanianDutchRussianEstonianSerbianFinnishSlovenianFlemishSpanishFrenchSwedishGermanThaiGreekTurkishHungarianUK EnglishItalianUS EnglishAbout TomTomTomTom NV is the world&#x92;s largest navigation solution provider, developing products with an emphasis on innovation, quality, ease of use and value. TomTom's products include all-in-one navigation devices which enable customers to navigate right out of the box; including the award-winning TomTom GO family, the TomTom ONE range and the TomTom RIDER (for motorcycles). TomTom also provides navigation software products which integrate with third party devices; the TomTom NAVIGATOR software for PDA&#x92;s and smartphones. TomTom WORK combines industry leading communication and smart navigation technology with leading edge tracking and tracing expertise. TomTom&#x92;s products are sold through a network of leading retailers in 25 countries and online. TomTom was founded in 1991 in Amsterdam and has offices in Europe, North America and Asia Pacific.", "title": "TomTom ONE 3rd Edition 3.5-Inch Portable GPS Vehicle Navigator (Discontinued by Manufacturer)", "price": 13.95, "imUrl": "http://ecx.images-amazon.com/images/I/51EYTavXaEL._SX300_.jpg", "related": {"also_bought": ["B004ZMC1TC", "B0037BVSCI", "B0038X9VN8", "B003709L4Q", "B000X14R28", "B004ZMC29Q", "B0006ZQ4E0", "B00172RI2I", "B004V3KD4K", "B001H9O71Q"], "buy_after_viewing": ["B000X14R28", "B0037BVSCI", "B0038X9VN8", "B007M52QR6"]}, "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS"]]}