{"asin": "B004TMGZ9K", "description": "The next installment in this popular hardcore SRPG series is back!Disgaea 4: A Promise Unforgottenpacks in more features than ever, along with an all-new graphics engine, making it the first game in theDisgaeaseries with true high-resolution graphics! Experience this insane netherworld adventure in full hi-res glory!-------- ROW 1 ----------OverviewThis item includesDisgaea4: A Promise Unforgottenfor the PlayStation&reg;3 Computer Entertainment System.This latest incarnation of the popular Disgaea strategy RPG series boasts major graphical improvements, Disgaea's most in-depth gameplay yet, everlasting value, and the great sense of humor you've come to love. The new graphics engine truly brings Takehito Harada's characters to life with fluid animations and high definition details. Create your own political party and take advantage of a slew of new battle and strategic features expanding upon the already staggering replay value. Finally,Disgaea 4adopts an all new map-generating mode, enabling players to create and share custom maps with other players around the world! You can even design your own pirate ship to attack them with! Beware!-------- ROW 2 ----------View largerCreate your own pirate and invade other player's world!View larger-------- ROW 3 ----------Game FeaturesDive face-first into SRPG mayhem!&#x2014;Players can create and manage an army of darkness to combat enemies on a grid-based battlefield. Each map is overflowing with puzzle elements that can help or hinder you in every encounter.The ever-popular Dark Assembly is reborn as the Senate!&#x2014; You will have the chance to become the head of a political organization, using every dirty trick in the book to shape the government to your liking. Become the ultimate dark dictator!2D art reaches new heights!&#x2014;Disgaea 4has adapted an all-new graphics engine which boasts rich detail and fluid animation.Lv9999 is just the beginning!&#x2014;Reincarnate your characters to inflict millions upon millions of points of damage on the enemy.Create your own army of darkness!View largerMassive number of special skills!View largerTons of character to choose from!View largerVarious puzzles on battle map!View largerCreate your own dungeon and share it with other players!View largerProduct DescriptionThe latest incarnation of the popularDisgaeastrategy RPG series boasts major graphical improvements, the most in-depth gameplay yet, unending replay value, and that oddball sense of humor you've come to love. The new graphics engine really brings Takehito Harada's characters to life, utilizing fluid animations and high-definition detail. Create your own political party and take advantage of a slew of new battle strategies, compounding the already staggering game content.Disgaea 4also adopt an all-new map creation mode, enabling you to create and share custom maps with other players around the world! And you can even design your own pirate ship to invade other players' worlds! This summer,Disgaea 4will mercilessly invade your gaming space. Beware!", "price": 67.46, "imUrl": "http://ecx.images-amazon.com/images/I/61d%2Bybe4ACL._SY300_.jpg", "related": {"also_bought": ["B001C4C4KW", "B00BJH11F6", "B000F8O1C0", "B0016C3260", "B002I0J4AM", "B00BJH11D8", "B00B67ZTUW", "B007A7UJ4S", "B00009YEJY", "B002I0K2J4", "B00D87TCN8", "B0087OY17Y", "B006O5YW54", "B001CRQY1E", "B0058VI2LA", "B006MBZZSI", "B00ANGVX9I", "B002BRYHY0", "B005DVAAZG", "B0067O5SBE", "0804162131", "0744013186", "B004HVKABW", "B007H44U1W", "B008SBZD5U", "B00AZWE7ES", "B00BJH11FQ", "B003YVP5DE", "B002I0J45C", "B003O6JIVE", "B00BY0G0YU", "B007V9QKH0", "B004P7VGF2", "B000FQ2DTA", "B00C3MKCF6", "B002AB7TX8", "B006FRMVIQ", "B007B7BHJ8", "B002DPUJCE", "B00KVRK39A", "B002I0J5FG", "B00JC5Y2KS", "B001P2PW3M", "B00B59MXGY", "B007IFMEYK", "B00946FSIA", "B004WL4LOY", "B004Q8IZHW", "B007PNBU0Y", "B00GV4V8XC", "B000ZK695U", "B007W8S2MG", "B00ENFVKK2", "B00J6DLPLK", "B005TH6BD4", "B00H45K6KS", "B0015HZLVA", "B005J5K9UW", "B00KBD4SJA", "B005VBVQDI", "B004NRN5EO", "B000TTZI0E", "B00E5UHXBK", "B00F6YD2AK", "B003O680RM", "B006VB2V7W", "B008CP6RWU", "B002I09286", "B000FPGZUE", "B00DZIX39E", "B007CSF3GO", "B001C4J62Q", "B008CP6MA2", "B003VR5PPY", "B0028A6UUY", "B00DV16N6U", "B008BERJEM", "B00APBF8A6", "B00C1ZBFTW", "B00G6S2SE6", "B0044SA734", "B008CP6Q6M", "B00B7ELWAU", "074401543X", "B001HB7KAO", "B0029MAXR2", "B00DJ42BUQ", "B002I08WVY", "0979884837", "B00H51BJ0C", "B002I0J8FI", "B00477VLZU", "B00B59L9T6", "B000QW9D14", "B00008KTRS", "B00370Q1E4", "B005YR308S", "B000784XG2", "B003O6KWZK"], "bought_together": ["B001C4C4KW", "B00BJH11F6"], "buy_after_viewing": ["B00BJH11F6", "B00B67ZTUW", "B001C4C4KW", "B0016C3260"]}, "salesRank": {"Video Games": 4908}, "categories": [["Video Games", "PlayStation 3", "Games"]]}