{"asin": "B005L2NA54", "related": {"also_bought": ["B004NY9UWI", "B00FE690DI", "B00CMKOVMO", "B000Q8UAWY", "B00BY3LCO0", "B005SEZR0G", "B00ATWZMI4", "B00008NG7N", "B005F0IKHA", "B00E39GCP6", "B00004Z7F0", "B0073BOCNU", "B001EVY5Y6", "B009CP4PIW", "B00H0FK2A6", "B002NUYTCA", "B00671E4B2", "B00B7FOQCK", "1456468693", "B008ABKADI", "B002GI6LXO", "B00BWF5U0M", "B001N4KGNS", "B0085MQLMQ", "B008OEHV6U", "B00ATZ9QMO", "B007FNF5IC", "B004ZHT89S", "B005H3I38Q", "B0085MQL3K", "B00DQFGH80", "B00EHDNAOE", "B0093H8H8I", "B003NR57BY", "B00BBIXRHS", "B0031SEMBQ", "B008HBFADQ", "B005LN1JEC", "B00BZC31WQ", "B005JN9310", "B0012W9APQ", "B003VANO7C", "B00COEBCXY", "B001TH7T2U", "B00ESM3HOW", "B002HWRJBM", "B0036E8V08", "B002DPUUL4", "B005DSPLCQ", "B006ZGWJU2", "B008ZGKWQI", "B00E3W1726", "B0038P1TP4", "B00DR0PDNE", "B008LTBJFW", "B0095EFXMC", "B0016OOS16", "B0000BVYT3", "B00CKIFPQY", "B005BZNDCG", "B003M0NURK", "B00ECDM78E", "B0019804U8", "B0099SMFVQ", "B004SUIM4E", "B009UNGYHG", "B009SYZ8OC", "B005DSPLDA", "B007Z419BI", "B00E3W16OU", "B00D856NOG", "B00E3W15P0", "B00DBV28TG"], "bought_together": ["B004NY9UWI"], "buy_after_viewing": ["B00CMKOVMO", "B00FE690DI", "B005SEZR0G", "B00H0FK2A6"]}, "title": "Lenovo 14&quot; ThinkVision LT1421 Wide LCD Flat Panel", "price": 273.44, "salesRank": {"Computers & Accessories": 1728}, "imUrl": "http://ecx.images-amazon.com/images/I/319bkEBo5%2BL._SX300_.jpg", "brand": "Lenovo", "categories": [["Electronics", "Computers & Accessories", "Monitors"]], "description": "ThinkVision LT1421 gives mobile professionals a second screen for on-the-go use in displaying spreadsheets and making presentations. At under two pounds and less than an inch thick, the 14-inch ThinkVision LT1421 mobile monitor makes the perfect traveling companion for traveling professionals, like auditors or consultants. The mobile monitor works great for ad hoc meetings in places like hotel lobbies or cafes that lack access to a projector and even for extra screen space for work that requires multitasking on the go. To use, simply plug the monitor into a laptop via USB and prop it up with its photo frame stand. Tilt the display to the desired angle and choose from 16 brightness levels to get presentations looking their best. Designed to match with the ThinkPad family of laptops, the mobile monitor offers convenience, simplicity and elegance and comes with a standard carrying case. Tested to the same rigorous standards as ThinkPad laptops to ensure the highest levels of reliability and dependability, LT1421 is durable for travel convenience. Features and Benefits:-14-inch (355.6 mm) viewable image size-Display resolution of 1366 x 768 matching mainstream Notebook resolution-Slim (21.5mm, as slim as 9.3mm)-Light weight (monitor: 0.84kg/1.8lbs; with Screen Cover: 1.02kg/2.25lbs)-Photo frame tilt stand adjustments for viewing comfort (12 degree~40 degree)-Brightness adjustment button for 16 level brightness-USB 2.0 connection-USB powered-Kensington lock slot-The Electronic Product Environmental Assessment Tool (EPEAT) Gold certified-No VESA mount.Packaging:-One monitor-Attached tilt stand that cannot be removed-1.8-meter (5.9-foot) USB cable (Y-type) that can be removed-Screen cover-CD containing multilingual user's guide, setup test pattern, and Windows installation file-Quick start and safety poster"}