{"asin": "B004JHJHCC", "description": "Get 2 adventures in one package and see the Divinity II saga to its true ending in this incredible RPG compilation that includes both the remastered Ego Draconis and its sequel Flames of Vengeance! As a Dragon Knight, you will explore the huge world of Rivellon and delve into the true nature of the age-old conflict between Dragon Slayers and Dragon Knights.-------- ROW 1 ----------OverviewThe long-besieged realm of Rivellon continues to be plagued by strife and conflict.&nbsp; Decades ago, the divine prophet of a holy order was murdered by a Dragon Knight.&nbsp; Blessed with superhuman power and the ability to transform into their namesake and take to the skies with the might of fire to aid them, these Knights suddenly became outcasts in Rivellon, condemned for the killing of the holy order's leader.&nbsp; Hunted mercilessly by Slayers, followers of the Divine now vigilantly committed to avenging the assassination of their prophet, the Knights soon became scarce.&nbsp;During the final attack that would result in the extermination of the Dragon Knights, you-a lone Slayer separated from your group, stumble upon a dying Knight.&nbsp; With her final breath, she grants you her abilities, insisting that all is not as it seems.&nbsp; You arise the last living Dragon Knight, shunned by your former Slayer allies, gifted with supernatural powers, and tasked with exploring the true nature of your age-old conflict...The open world of Rivellon stretches out around you.View larger-------- ROW 2 ----------View largerSoar and attack as a dragon!View larger-------- ROW 3 ----------Game FeaturesThe complete Divinity II saga in one package&#x2014;With the remastered Ego Draconis and its thrilling conclusion Flames of Vengeance together on one jam-packed disc (along with all previously released DLC), The Dragon Knight Saga offers over 100 hours of rich fantasy roleplaying and gamers' first chance to experience the entire Divinity II adventure from start to finish!Wage war as human and dragon&#x2014;You begin the adventure as a human Dragon Slayer but are soon transformed into a Dragon Knight with the ability to change into dragon form at will. From here, perspectives shift as both your skills and objectives adapt to encompass the concerns of land and air, human and dragon.Dynamically unfolding storyline&#x2014;Apart from your primary mission, the open land of Rivellon and its many secrets and surprises lie in wait for the daring explorer. Every nook and cranny potentially hides a new path to explore, while the protagonist's ability to read the mind of any NPC can lead to new quests to solve and new areas to discover. Take on over 180 missions, and watch the storyline change according to your choices and skills.Incredible foes.View largerChasing dragons.View largerAlways be on your guard.View largerYou never know what you'll encounter.View largerBeware this man.View largerProduct DescriptionGet 2 adventures in one package and see the Divinity II saga to its true ending in this incredible RPG compilation that includes both the remastered Ego Draconis and its sequel Flames of Vengeance! As a Dragon Knight, you will explore the huge world of Rivellon and delve into the true nature of the age-old conflict between Dragon Slayers and Dragon Knights.Decades ago, a divine prophet was murdered by a Dragon Knight, and the Knights became outcasts, hunted by Slayers. You, a Slayer, stumble onto a dying Knight who transfers her abilities to you, leaving you shunned by your former allies, gifted with brand new powers, and forced to delve into the true nature of Rivellon&rsquo;s age-old conflict.", "price": 88.76, "imUrl": "http://ecx.images-amazon.com/images/I/51yqQD7MVjL._SY300_.jpg", "related": {"also_bought": ["B002C0VNVG", "B0016NRS8M", "B003O6E9EK", "B00J22635I", "B001IKHVTE", "B0044SA70M", "B00ICWO1XA", "B003FBL85W", "B003O6G6G4", "B004H0J5S2", "B002QK00OI", "B00B59MXDM", "B004A88W8K", "B002W5GI9I", "B0043B5SLI", "B000NJH6YG", "B006GHA8EE", "B00149NCYW", "B007FMSH4W", "B0045ZIENQ", "B00JUFT3JA", "B001CMJAP6", "B000MTF054", "B000ZJVDA2", "B001LGFPSY", "B003BU3ZIU", "B00DBCAT3W", "B000WCN7G0", "B000WCN8IW", "B0058VI0SU", "B0028A6V7Q", "B0047TG2R0", "B002I0JGDM", "B004NRN5DU", "B002BRUTT2", "B003ZFVD6W", "B003DNH95K", "B00319DX4W", "B000FLZEXM", "B001CBW18K", "B000QW9D14", "B002Q21X7Y", "B0015HZLVA", "B004EW7LSY", "B002GPPPS4", "B00J22636W", "B000C427NM", "B001D25M1Q", "B0058NY63Q", "B0006ZJPSC", "B00D7NQP9M", "B0019GZ93M", "B0056WJA30", "B00CJ7IUGS", "B004Q4EQ4M", "B003O6HGHM", "B002V16T0Q", "B001NX4DUQ", "B00432O4VM", "B000R0SS3Y", "B000XJNTPG", "B001D7T2VM", "B002DC8GEK", "B00H4BBVZQ", "B002BRWUA8", "B00J6DLPLK", "B002I0JA7E", "B003BE6OZC", "B0088MVP2Y", "B003KT0ACG", "B0065FYG8G", "B001P2M532", "B003GSZ9ZE", "B000SH3XD6", "B0065NP6NC", "B0054INKZK", "B00JDOX2PE", "B000HX1P72", "B00IQCRO3K", "B000P7V34K", "B00KWF803C", "B000XJO78Y", "B0009SQFHA", "B0010AYJXI", "B00ERDGMT4", "B003O6EBRA", "B00C3MK9BS", "B003S2MXRA", "B000XJO7A2", "3869930578", "B001BC948U", "B000FUG5WC", "B006RHAT2E", "B005J5K9EI", "B003O6G1L4", "B000CQNWH0", "B002WSR8BC", "B009VURUYE", "B008XMSRKC", "B00K85X1W6"], "bought_together": ["B0044SA70M"], "buy_after_viewing": ["B00B59MXDM", "B0016NRS8M", "B0044SA70M", "B001IKHVTE"]}, "salesRank": {"Video Games": 6734}, "categories": [["Video Games", "Xbox 360", "Games"]]}