{"asin": "B001GUPEMW", "description": "BackBeat Titanium Earphones...Take Your Music SeriouslyThe BackBeat Titanium noise-isolating earphones are designed for the discerning music enthusiast and feature titanium-enhanced micro-speakers that deliver vivid, full-spectrum sound with exceptional clarity and realism.Revel in the rich detail of a live music performance when you listen with BackBeat Titanium noise-isolating earphones.  The music on your iPhone, iPod or other MP3 player truly comes alive with unsurpassed full-spectrum sound thanks to the titanium-coated acoustic diaphragms in the dynamic micro-speakers. Titanium enhancement extends frequency response to bring out all the delicious musical nuances and coloration for an optimized listening experience. The eight-piece custom fit kit features ultra-comfortable neoprene SnugFit&#x99; ear tips plus a dual-flange tip for superior isolation from outside ambient noises. BackBeat Titanium earphones have a convenient, tangle-free cloth cable and soft-sided carry case.Titanium enhancement extends frequency response to bring out all the delicious musical nuances and coloration for an optimized listening experience.Click to enlarge.Noise-isolating earphones for iPod and iPhone listeners in mind.Click to enlarge.Making the DifferenceKey Factors&#8226; Full-spectrum Sound&#8226; Superior noise-isolating earphones&#8226; Soft-sided carry case&#8226; Tangle-free cloth cable&#8226; Perfect for iPod, iPhone and MP3 music playersFull Spectrum Sound&#8226; Titanium-enhanced dynamic micro-speakers&#8226; Excellent sound across multiple music stylesCustom Fit&#8226; Superior noise isolation&#8226; Convenient right/left earphone identification&#8226; 8-piece fit kit with ultra-comfort neoprene ear tips (S, M, L) plus one set of dual flange tips for extra noise reductionCompatibility&#8226; iPod and MP3 players with a standard 3.5mm connector&#8226; iPhone (music only)&#8226; Desktop and laptop computersWhat's in the Box&#8226; BackBeat Titanium noise-isolating earphones&#8226; Ultra-comfort neoprene ear tips (S, M, L) plus one set of dual flange tips for extra new reduction&#8226; Soft-sided case", "title": "Altec Lansing UHP326 BackBeat Titanium noise-isolating earphones", "price": 12.99, "imUrl": "http://ecx.images-amazon.com/images/I/41PAF%2BWDzeL._SY300_.jpg", "related": {"also_viewed": ["B001GUNJPG", "B001GUVBJC", "B003FMUP3M", "B006Z01UAI", "B001TK3ACK", "B003FMUP3W", "B00945906M", "B00518DE2W", "B001W2GAAY", "B005AFP1AY", "B00510ERKI", "B00518DEN6", "B006Z01V0W", "B005HP3OB0", "B002RWJD7A", "B000WAHFBK", "B001EZYMF4", "B003FMUP2I", "B004H1VKJ8", "B002IJ4Y6M", "B008X9Q0JK", "B001V9LPT4", "B006S8DS4I", "B003NSBKT6", "B0053R0WWG", "B004PNZFZ8", "B0006DPMU4", "B0035JKJ68", "B008VGN75U", "B001EZUQ5E", "B0073XY5LC", "B0078JSD1E", "B0094A09F8", "B001TK3ACA", "B004HD4L2E", "B005HP3PNM", "B003YKG2UK", "B003I65U4E", "B0069HW3GW", "B001939H4C", "B002AWZC7W", "B003FMUP32", "B005BHIZ7M", "B0001ARCFA", "B008V6T1IW", "B001EUDUFC", "B004HD4L1U", "B007BY3PBY", "B009ES68P0", "B003EM8008", "B003XU6H8I", "B00FZHCR04", "B00IUICOUS", "B004S7Q8CA", "B00B8QCMHY"], "buy_after_viewing": ["B001GUNJPG", "B001GUVBJC", "B003FMUP3M", "B006Z01UAI"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]]}