{"asin": "B0002MPT6Q", "description": "Rule the Roman Empire. Rule the World.The much anticipatedRome: Total Waris a multi-award winner: best strategy game of E3 (the Electronic Entertainment Expo 2003, held in Los Angeles); Game Critics Awards: Best of E3 2003 awarded by GameSpy and IGN; runner up for PC game of show as chosen by IGN; and 4th best game of the show (all formats) as chosen by Gamespy.Create, rule, conquer and manipulate the Roman Republic and Empire to become the \"Imperator\" of Rome in this award-winning game from the highly-acclaimedTotal Warseries. Fight as, or against ancient history's most legendary generals including Julius Caesar, Hannibal and the rebel Spartacus.From the Punic Wars against Carthage to the death of Augustus, the first Emperor of Rome, control mighty armies of up to 10,000 fully polygonal, highly detailed, motion-captured warriors clashing in panoramic real-time battles.At your disposal are over a hundred different troop types including legionaries, hoplites, barbarian hordes, war elephants, gladiators and scythe chariots to colossal war machines such as siege towers, battering rams and catapults hurling flaming missiles. The stage is set for carnage on more than 10,000 unique battlefields based on the topography of Europe and North Africa.Conflict is not the only way to gain favor with the senate and people of Rome, however, as politics, diplomacy the gladiatorial games will play key roles in your quest to be declared Imperator.Dominate and reign over one of the most powerful empires in history.", "price": 8.88, "imUrl": "http://ecx.images-amazon.com/images/I/41G4ZKJ57CL._SY300_.jpg", "related": {"also_bought": ["B000FUONLM", "B0018YXM3Y", "B000E2D3LC", "B00BQZ5EWW", "B000YQ639M", "B000B6JASQ", "B002M78NM6", "B001HL3Q70", "B000PIRVQI", "B000ZMYZWC", "B00AQ2BLI2", "B005IOJ6US", "B000SOYG8U", "B00027CXEM", "B000DZH8ZC", "B002PAIPQO", "B002RD6MV4", "B0000CFU9U", "B001QZGVEC", "B001DF1AM8", "B0049WF6FY", "B000CPKIT6", "B000AVG3QE", "B000EDPQMU", "B000063SAU", "B000089SB6", "B00EBH65HU", "B00006IR62", "B003OZOAKY", "B000FJSIUA", "B002SKDIKE", "B002L6HJCI", "B000WMEEBC", "B00020LZAM", "B00001IVRD", "B000067DPM"], "buy_after_viewing": ["B000E2D3LC", "B001HL3Q70", "B000YQ639M", "B00BQZ5EWW"]}, "salesRank": {"Video Games": 9623}, "categories": [["Video Games", "PC", "Games"]]}