{"asin": "B000NMKHW6", "description": "Amazon.com Product Description With built-in AAA TourBook&reg; travel information and member roadside assistance details, the Magellan Maestro 4040 Portable Auto GPS System is the ultimate travel companion. Re-engineered for easy use, it combines advanced features, elegance, and simplicity to make driving more pleasurable and less stressful. A few simple touches are all the Maestro 4040 needs to audibly guide you with turn-by-turn street name directions to virtually any destination in the United States and Canada. You can even customize your navigation method or route to get there quicker and stress-free.With fresh graphics and an intelligent touch screen, the Magellan Maestro 4040 is the ultimate travel companion.View larger-Side viewEasy to use navigation features SmartDetour and auto re-route.View larger.Access built-in AAA information from your GPS touch screen.View larger.AAA-enabledWith built-in AAA travel information, the Maestro 4040 gives you instant access to the most trusted source for trip planning; searchable AAA TourBook&reg; listings, Show Your Card &amp; Save&reg; locations for member discounts, approved auto repair facilities, attractions, events, and more. The Maestro 4040 also provides AAA members roadside assistance details, with exact location and a toll-free help number. The Maestro 4040 is also Bluetooth-enabled, so you can connect your Bluetooth cell phone directly to AAA for immediate help when you need it most.Note:AAA member roadside assistance requires AAA membership.Easy-to-Use NavigationEnter virtually any address on the freshly designed graphical touch screen, or select from 4.5 million preprogrammed points of interest and get turn-by-turn voice guidance to anywhere in the entire United States, Canada, and Puerto Rico, right out of the box. Just turn it on and go. SiRFstarIII&trade; gives you the fastest GPS position accuracy in the industry, while SayWhere&trade; text-to-speech tells you the street name for each maneuver so you can focus on driving. Smart buttons and Magellan's unique QuickSpell&trade; function enable error-free spelling to minimize steps and give you a customized route to your destination with just a few screen touches.Bluetooth, Traffic Updates, and MoreThe Maestro 4040's Bluetooth wireless technology lets you make hands-free phone calls with your Bluetooth-enabled phone. You can also store or sync numbers and contact information through the easy-to-use touch screen and make calls via the Maestro 4040's integrated microphone and speakers. Add the optional Magellan TrafficKit&trade; to this device and you'll be equipped with live traffic incident reports, so you'll never get stuck on the freeway.Additional Product FeaturesSophisticated and simple:Streamlined touch-screen buttons minimize steps to locate a destinationSleek design:Integrated GPS antenna provides excellent satellite reception in a slim and compact designGraphical interactive maps:Maps and destinations for the U.S., Puerto Rico, and Canada are built-in, so you can travel far and wide and always know where you are and where you're goingTraffic-enabled:Add the Magellan TrafficKit&trade; to your Maestro 4040 to get live traffic incident reports; activation and subscription fees applyVoice command upgradeable:Add Voice Command control for hands-free operation with an upgrade from Magellan; activation fee appliesBird's-eye 3D view:Clearly see your surroundings in 2D or 3D; also choose between Map View, TrueView&trade; 3D split screen, and Maneuver ListRechargeable battery:Navigate even when you don't have access to powerMulti-destination routing:Select up to 20 destinations and choose the order that best fits your needsSmartDetour&trade;:Automatically prompts you to route around suddenly slow freeway trafficAuto re-route:Never miss a turn and quickly get back on track whenever you make a detourAuto night view:Adjusts color and contrast for easy night viewingQuickSpell&trade;:Easily enter addresses with unique auto-complete feature that even corrects spellingComplete mobility:Transfer to any vehicle with no installation4.5 million points of interest (POIs):Optimized database to easily find gas stations, restaurants, ATMs, and more. And with smart location you can search by name, category, and region. There's even a Coffee category so you can quickly find caffeine whenever you need it.Interactive POI icons:Touch an onscreen icon for a nearby destination, see name and address, and get an instant routeCustomizable route method:Fastest time, shortest distance, least or most use of freeways, avoid toll roadsRoute exclusion:Select streets and freeways to avoid so you can get there your wayAddress book:Create and store personal points of interest for easy reoccurring tripsInstant locate:One touch shows your location; quickly advise roadside assistance or emergency servicesWhat's in the BoxMagellan Maestro 4040 Portable Auto GPS System, windshield mount and cradle, adhesive dash mount disk, cigarette lighter power adapter (12-24 watts), AC wall power supply/charger, quick reference guide, reference manual CD, and USB cable.", "title": "Magellan Maestro 4040 4.3-Inch Widescreen Bluetooth Portable GPS Navigator", "price": 89.95, "imUrl": "http://ecx.images-amazon.com/images/I/51nY4Uk8jqL._SX300_.jpg", "related": {"also_viewed": ["B003ZHVBQM", "B000V4PZCI", "B00HK6CPVY", "B007TSERYG", "B000PCBVA6", "B002LITI70", "B0015EWMX8", "B00BIZ0EY8", "B0021L9C0A", "B00EE2CKWQ", "B0015F1L7A", "B001U0O7T4", "B000H866BM", "B002DMK1R0", "B000HCY8KO", "B003CYKYUC", "B0057ODOCA", "B0057ODG6Y", "B006E5WSNW", "B003CYKYVG", "B0054J8BWQ", "B000V4X26O", "B001VEIYAC", "B001ELJ9QK", "B0066IUPS2", "B0082XN57W", "B000OH63MI", "B003CYKYV6", "B0011ULQNI", "B0052D38UE", "B00C9W1LT6", "B002NEFXQW", "B00CH3FRG0", "B00AXZY42W"], "buy_after_viewing": ["B002C3XPQY", "B003ZHVBQM", "B0057ODOCA", "B0057OCDQS"]}, "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS"]]}