{"asin": "B001TD6SK8", "description": "Chronologically set between the events ofKingdom HeartsandKingdom Hearts II,Kingdom Hearts 358/2 Days(pronounced \"Kingdom Hearts Three-Five-Eight Days Over Two\") is the newest installment on the Nintendo DS of the wildly popular role-playing game series. Featuring supporting details ofKingdom Hearts IIcharacter Roxas, as well as single and multiplayer modes and the new \"Panel System\" game mechanic, it is destined to be find a cherished place of its own in the beloved RPG franchise..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }All your favorite characters.View larger.2-4 multiplayer support.View larger.New \"Panel System\" gameplay mechanic.View larger.StoryInKingdom Hearts, Sora turned the Keyblade on himself in order to release Kairi&rsquo;s heart, but his heart was also released in the process. This brought about the creation of Roxas, Sora&rsquo;s \"Nobody.\" Yet Roxas has no recollection of his previous life, which is unusual for a Nobody. He joins Organization XIII and slowly begins to discover the truth behind his existence and the Organization itself. As time passes he meets and befriends the fourteenth member of the Organization, who also has no recollection of her past. It is a strange coincidence. What will Roxas see during his time in the Organization? What is the connection between him, Sora, and the fourteenth member? And what becomes of them? Dive into the heart of theKingdom Heartsstoryline&rsquo;s biggest secrets.Panel SystemKingdom Hearts 358/2 Dayscontains a new gameplay mechanic referred to as the \"Panel System.\" These panels serve as a means to equip and customize character's levels, items, magic, weapons, abilities, armor and accessories. But more than just a means of access, panels also facilitate progression through the game in that certain items, spells, etc. necessary for progression cannot be used, or at least used to their full potential, until their panels are equipped. Once done though, not only can these be used, in many cases through the use of \"Link Panels\", which can be used in conjunction with other panels, thus allowing for special item and ability creation.MultiplayerNot only doesKingdom Hearts 358/2 Daysallow for team-based gameplay utilizing the franchises standard AI partners functionality, it also contains exciting cooperative and competitive multiplayer options. In both these options players can join together with additional players in DS multi-card play over a DS Wi-Fi connection. The cooperative mode is the real showcase option though, allowing players to team up with up to three friends and engage in mission play that is distinct from the story driven mode of the single player campaign. During these battles players choose from one of the fourteen members of Organization XIII, each wielding different weapons, skills, and stats. The multiplayer campaign also features hidden characters including favorite characters from theKingdom Heartsand Disney universe including Sora, Donald, Goofy, King Mickey and Riku.In addition, although dialog between characters and player inKingdom Hearts 358/2is limited to text, within multiplayer modes players will have access to a chat system for communication which displays responses on a single screen, allowing for complete exchanges and conversations between players in context.Key FeaturesFamiliar action-packedKingdom Heartsgameplay that has captivated fans worldwide.The brand new \"Panel System\" that allows you to customize Roxas&rsquo; arsenal by placing abilities, items, and weapon parts into allotted slots.Learn about the origins of the \"Organization XIII\" name.A series-first multiplayer mode, allowing up to 4 players to control any Organization XIII member.Additional unlockable characters in multiplayer modes, including: Sora, Donald, Goofy, King Mickey and Riku.Get to know the members of Organization XIII, including the mysterious fourteenth member.Finally experience theKingdom Heartsstoryline&rsquo;s missing chapter.", "price": 24.99, "imUrl": "http://ecx.images-amazon.com/images/I/511h8RVB1FL._SX300_.jpg", "related": {"also_bought": ["B002I08UPC", "B006OI3CTS", "B002I0GZ5Y", "B001G3B0HC", "B00136MBHA", "B00068O278", "B0009A4EVM", "B008SBZD5U", "B001TOMR6Q", "B000GABOTU", "0744014026", "B00184219U", "B000066TS5", "0744011485", "B00829H3E2", "B000GIXIPK", "B000SSQPU8", "B003FBL86Q", "B000FRV2UK", "B003O6E800", "B000NVKZ06", "B001A01FD0", "B002ZQDAVI", "B00GANWVJE", "B001E27DLM", "B002I0EH6I", "B0006B0O9U", "B001TOQ8WU", "B0009Z3K9E", "B002I08WVY", "B000ERVMI8", "B001CU4EJ0", "B0014X7SQ6", "B000B8J7K0", "B00E1A1SP6", "B0053B66KE", "B0045WL026", "B0050SVMYA", "B0009SQFHK", "B003IOGPAO", "B003UI518A", "B0050SVNP8", "B009B1D7JK", "B001KMRN0M", "B0050SVOXE", "B00GV4V8XC", "B0047WMHGC", "B002I092MM", "B0053B5RGI", "B007R4X3AG", "B0054J1LBO", "B00FS2XRIC", "B00BP4EUIS", "B000B69E96", "B0010YOQIM", "B004K6LQAS", "B001O1PAMC", "B007R1NYPS", "B008PFTE1S", "B00I5LMSE2", "B0053BCML6", "B00K2O4O6U", "B000GHG9VG", "031640120X", "B00AKIPBNS", "B00KI2OZ9M", "B000E0OCRI", "B0053BCO00", "B001V7UX1W", "B000FW4OHS", "B00FXOP1JI", "B004WL4LZS", "B001TOQ8UW", "B00005LZNI", "B0050SVNSU", "0316401196", "B000LLUXDW", "B007RUY1NS", "B004EW2PC6", "B001O1OBFY", "B000PTYKSY", "B000E0L41K", "B000GABTVS", "B000Q6J51S", "B002I0GXWO", "B009LGO88E", "B0053BCP40", "B0016B4EEA", "B008HPAXZ2", "B002KA20C4", "B000MJB1WU", "B000HE9LL8", "B00DBF81JS", "B0014DHIL6", "B00BQI3UQG"], "bought_together": ["B002I08UPC", "B006OI3CTS"], "buy_after_viewing": ["B006OI3CTS", "B008SBZD5U", "B008SBZD5U", "B002I08UPC", "B0009A4EVM"]}, "salesRank": {"Video Games": 1692}, "categories": [["Video Games", "Kids & Family", "Nintendo DS", "Games"], ["Video Games", "Nintendo DS", "Games"]]}