{"asin": "B003VTZE1M", "related": {"also_bought": ["B000P1O73A", "B001OBWGX8", "B001OBVG5C", "B005JM9118", "B0045DR7HM", "B003VKR34C", "B0046D4YMM", "B007JRB0TC", "B00F0XQ81W", "B005D7V6YY", "B0046DQLBY", "B0046DLJUM", "B007JRB0SS", "B00L5U9LL8", "B004GJ2F86", "B000VUVA62", "B0046DQK7E", "B00467FACQ", "B004JPIVQW", "B005AYDKVM", "B00EDHIDO6", "B000WQKOQM", "B0000DC4EL", "B0046DNPB8", "B00BGYOO60", "B0020ZDI5C", "B003F7DWH8", "B00200K1TS", "B00003IEME", "B00H8A2FVM", "B007UI40NI", "B001W1BSM0", "B002DS7NJI", "B000DLBU4G", "B007M51J42", "B00C7NX884", "B00B7CS3UY", "B00GXHPN1U", "B0041Q38NU", "B003VNKNEQ", "B008DYS016", "B004CZVMHE", "B00I8BIBCW", "B008VPQOCY", "B0097BEECI", "B00F4PRKDG", "B00200K1SY", "B00007E7CM", "B00E0FZEAC", "B003YFHBE6", "B008ZE6PJS", "B001GIB3FQ", "B00B9H8FK0", "B009PLBLQC", "0769646794", "B00851LVLS", "B00FVWQ6XC", "B000R9AAJA", "B00AMPJGMG", "B008D902Q2", "B00C7NX3MK", "B001UE6MIO", "B004HFQOLI", "B0013CED4I", "B000F9WJ7S", "B002WM9HM6", "B003VNKNF0"], "bought_together": ["B000P1O73A", "B001OBWGX8"], "buy_after_viewing": ["B00C7NX884", "B000P1O73A", "B001OBWGX8", "B007JRB0TC"]}, "title": "Kodak Easyshare C195 Digital Camera (Silver)", "price": 47.67, "salesRank": {"Camera &amp; Photo": 45}, "imUrl": "http://ecx.images-amazon.com/images/I/41%2BbPZmeM5L._SY300_.jpg", "brand": "Kodak", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Zoom in on life's greatest momentsWith 5X optical zoom the Kodak EasyShare C195 Digital Camera lets you shoot top-notch pictures with ease. And when you press Kodak's Share button, you can instantly tag and share those pictures with the world.Zoom in on life's greatest moments and share them quickly and easily with the Kodak EasyShare C195 Digital Camera. With 5X optical zoom and Kodak's Smart Capture feature, you'll be shooting top-notch pictures with ease. And when you press Kodak's Share button, you can instantly tag and then share those pictures with the world. The C195&#x2014;giving you beautiful pictures to share at an attractive price. The real Kodak moment happens when you share.One-button upload&#x2014;turn moments into memoriesWith the Share button and Kodak's Share button app, sharing your pictures is amazingly simple.&#xA0;&#xA0;&#xA0; Snap your picture&#xA0;&#xA0;&#xA0; Press the Share button and tag it to Kodak Gallery, YouTube, Facebook, FLICKR, and ORKUT sites, plus e-mail too&#xA0;&#xA0;&#xA0; Connect your camera to your computer, and with Kodak's Share button app, your pictures are automatically uploaded&#xA0;&#xA0;&#xA0; Your pictures and videos are automatically transferred to your computerShare your world big and bright with 14 MP14 MP means you can make stunning prints up to 30 x 40 in.More megapixels means you can crop and enlarge and still have great picture qualityHowever you choose to print&#x2014;at home, at retail, or online&#x2014;trust Kodak for picture quality that's truly exceptional and for memories that will last5X optical zoom lens5X optical zoom (35 mm equivalent: 33&#x2013;165 mm) gets you closer to your subjects without reducing image quality.Blur reductionReduce blur caused by subject movement or fast-action situations to deliver clearer, sharper pictures3.0 in. bright LCDRelive moments and view pictures with brilliance and clarityBrighter, more vibrant details thanks to Kodak Color ScienceKodak's Smart Capture featureChoose the camera that does the thinking for you. Kodak's innovative Smart Capture feature automatically identifies the scene and adjusts camera settings for a great picture in just about any environment.Intelligent scene detection&#x2014;analyzes the scene to give you better pictures under various conditionsIntelligent capture control&#x2014;automatically sets camera settings for clear, sharp pictures even in low light and challenging situationsIntelligent image processing&#x2014;reduces noise and clears up dark shadows for vibrant, crisp details and true-to-life colorsKodak's Face Recognition featureFind, organize, and share your pictures easilyCamera automatically recognizes up to 20 pre-tagged faces so you can easily locate and share them laterRecognizes up to five faces in a single imageName tags carry over to your favorite photo management software for easy searchingHD picture captureTake stunning HD pictures in 16:9 formatView your pictures in high definition on an HDTV or other HD devices1Shoot video with easeRecord life in motion with continuous VGA video featuring audio capture and on-camera editingEnjoy video print options including 9-up prints, plus view and share single framesScene and color modesGet great shots time after time with multiple scene modes, including auto, sport, portrait, snow, fireworks, and backlightHave fun with five different color modes: vivid, full, and basic color, black & white, and sepiaMultimedia slideshowTurn your pictures into a creative multimedia slideshow right on your cameraSet the mood when you choose from pre-loaded sound these and creative transitionsHigh ISOCapture the details in low-light conditions and fast-action situations with high ISO (up to 1000).Picture enhancing and editing featuresAchieve your perfect shot with on-camera features such as cropping, undo-delete, picture rotation, and self-timerCapture the details of your pictures with on-camera text tagging and multi-field searchNever miss a moment with AA batteriesYour camera can always be ready to go using convenient AA batteries.Kodak EasyShare SoftwareThe complete solution for transferring, online sharing, e-mailing, organizing, editing, and creative printing of your pictures.Organize your pictures with your own tags, star ratings, and date and time stamps, then use the search feature to quickly find any picture in your collectionEdit your pictures with ease&#x2014;select from a variety of simple tools that reduce red-eye, improve lighting, remove wrinkles and blemishes, and add textCreate photo projects online or at home&#x2014;choose from hundreds of templates and designs to create album pages, cards, invitations, and much moreManually upload to Kodak Gallery, YouTube, Facebook, FLICKR, and ORKUT sites, plus e-mail tooReady to go &#x2014; right out of the boxKodak EasyShare C195 Digital CameraKodak Alkaline AA Batteries or equivalentWrist strapUSB cableUser Guide1Kodak AV cable available as optional accessory."}