{"asin": "B0001FV3C8", "description": "SanDisk Cruzer Mini is the fastest and easiest way to store and move your documents, pictures, presentations and music files between home, work, school -- or any other place you need to go.Nothing moves you-or your data-like SanDisk Cruzer Mini.Say hello to Cruzer Mini from SanDisk. Cruzer Mini is an ultra-small, ultra-thin USB 2.0 Hi-Speed flash drive that will have you and your data on the move in no time at all. In fact, the portable Cruzer Mini is the fastest and easiest way to store and move your documents, pictures, presentations and music files between home, work, school-or any other place you need to go.Have data, will travel.SanDisk Cruzer Mini is a new kind of personal data storage device for people who are going places (and need to take their important computer files with them). Unlike floppy disks and other removable media, Cruzer Mini offers higher storage capacities, faster data transfer rates, and better file security-all in a device no bigger than a pack of gum.Small, sleek and very sexy.SanDisk Cruzer Mini is built for travel. Its thin and sleek design lets you take it anywhere with ease. Just slip it into a pocket or purse and off you go. Two additional color caps and a removable neckstrap let you personalize Cruzer Mini to fit your style. With Cruzer Mini, transporting your documents, pictures, presentations and music files has never been easier. Or looked better.CruzerLock protects your personal data.Worried about data security? Don&#x92;t be. Cruzer Mini comes with an advanced file security application called CruzerLock that encrypts your individual files, keeping them safe and secure from prying eyes. Simply choose a personal password, select the file that you want to encrypt and CruzerLock does the rest!Easily fits any lifestyle...including yours.Cruzer Mini&#x92;s ultra-thin profile takes up very little space. So if you already have a cable plugged into a stacked USB port, Cruzer Mini can plug in easily next to it. Most other USB Flash Drives obstruct the port next to it, making it extremely difficult to use two USB devices at once. The ultra-small, ultra-thin Cruzer Mini won&#x92;t cramp your style-no matter how tight things may get.\"Plug and play\" means no hassles.No drivers needed-just plug and go! Cruzer Mini plugs into any USB 2.0 port and is backwards compatible with USB 1.1. It&#x92;s truly \"plug and play\" with both PCs and the Macintosh due to USB Mass Storage Class (MSC) compliance when used with Windows ME, Windows 2000, Windows XP, Mac OS 9.2.1+ and Mac OS 10.1.2+.It's your move. So make the most of it.Whether for business, pleasure or both, Cruzer Mini makes it easy to take your documents, pictures, presentations, music and any other personal files along with you anywhere, anytime. For example, need to revise your PowerPoint presentations at home? No problem. Simply load them up and leave your laptop at the office. It&#x92;s that easy!", "title": "SanDisk SDCZ2-1024-A10 1 GB Cruzer Mini USB 2.0 Flash Drive (Retail Package)", "price": 5.38, "imUrl": "http://ecx.images-amazon.com/images/I/41BE5NDHYSL._SY300_.jpg", "related": {"buy_after_viewing": ["B004TS1J18", "B001N0RJQO", "B007JR531I", "B002LVUN6M"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "USB Flash Drives"]]}