{"asin": "B0007MGG2M", "categories": [["Electronics", "Computers & Accessories", "Routers"]], "description": "The Linksys compact wireless-G broadband router is an all-in-one Internet-sharing router, four-port switch, and 54 Mbps wireless-G access point. Almost five times faster than 802.11b, it can also interoperate with any 802.11b device (at 11 Mbps).The Linksys compact wireless-G broadband router is really three devices in one small box. There's the wireless access point, which lets you connect both screamingly fast wireless-G (802.11g at 54 Mbps) and wireless-B (802.11b at 11 Mbps) devices to yout network. There's also a built-in four-port full-duplex 10/100 switch to connect your wired-Ethernet devices together. Connect four PCs directly, or attach more hubs and switches to create as big a network as you need. Finally, the router function ties it all together and lets your whole network share a high-speed cable or DSL Internet connection.Connect up to four wired PCs and share Internet, printers, digital music and pictures, document files, and multiplayer or online games.Once your computers are connected to the router and the Internet, they can communicate with each other, too, sharing a printer, digital music, picture and document files, and multiplayer or online games.To protect your data and privacy, the wireless-G broadband router can encode all wireless transmissions with WEP or industrial-strength WPA personal encryption. The router can serve as a DHCP server, has a powerful SPI firewall to protect your PCs against intruders and most known Internet attacks, and supports VPN pass-through. Configuration is a snap with the Web browser-based configuration utility. And the tiny form factor fits any home or desktop.FeaturesAll-in-one Internet-sharing router, four-port switch, and wireless-G (802.11g) access pointShares a single Internet connection and other resources with Ethernet wired, wireless-G, and wireless-B devicesCompact form fits anywhere--use the internal antenna, or add anoptional external antennafor more rangeHigh security: Wi-Fi protected access (WPA/WPA2 personal), wireless MAC address filtering, powerful SPI firewallSee acomparison         diagramof the different wireless technologies.Wireless networks are rapidly         becoming more popular and coming down in price. Since they don't require         cables, you can use the devices anywhere in an office or home, even out         on the patio. There's no need to roll out an Ethernet network cable to         each room of a house; you can network anywhere -- without wires. Outside         of the home, wireless networking is available in hotspots at coffee shops,         businesses, airports -- great when you're on the road and need to get         some work done. For convenience, wireless networking is the answer.What Wireless Standard is Right for Me?Now that you've decided to create a wireless network, the next step is         to figure out which wireless standard to use.Basically, a standard is a set of specifications for a device. All devices         that follow a specific standard share operating characteristics, such         as the radio frequency used and maximum data transfer speed.For wireless networking, there are three standards to choose from at this         time:802.11b802.11a802.11g802.11a/gTo learn about the differences between the standards and select the right         one for your network,click         herefor an easy-to-understand chart.", "title": "Cisco-Linksys Compact Wireless-G Broadband Router WRT54GC", "price": 5.49, "salesRank": {"Electronics": 62077}, "imUrl": "http://ecx.images-amazon.com/images/I/41F5VYZ1MZL._SY300_.jpg", "related": {"also_viewed": ["B000BTL0OA", "B000A1AQOO", "B005X9XW8K", "B003Q9AZHU", "B003ZM17R0", "B00007KDVI", "B002G1CLS0", "B00L4HWY3E", "B006DEBYWU", "B00FRMAOIO", "B00DJ6AFX4", "B007PTCFFW", "B0028N6VNW", "B00634PLTW", "B005WKIKA0", "B004T9RR6I", "B00005T6GZ", "B001UI4RTG", "B00FEE7LW2", "B00IMYMG12", "B009LENJ90", "B007IL6OR2", "B00HZWOQZ6", "B00008SCFL", "B0009P657S", "B007IL764W", "B00HQ883T4", "B005FDXMJS", "B00DTPYRTI", "B000Z3U1P6", "B0001D3K8A", "B005HFJFHW", "B000IZWYXI", "B0046RE60S", "B00BXKY9CQ", "B000MANHJE", "B00FXQUR86", "B007FGX1US", "B008BGYJSO", "B00CWIRMRC", "B004T9RR4A", "B0002I7288", "B004H1PMJC", "B007IL7AKM", "B0002V8KX6", "B001AZ01EO", "B00GANEE1C", "B00005ARK3", "B0007U9KAY", "B000Z3XXR4", "B00C0WZ9FW", "B008VP5H2M", "B007IL72CI", "B00F3TS3U2"], "buy_after_viewing": ["B000SEN9U6", "B000BTL0OA", "B004XC6GJ0", "B004T9RR6I"]}}