{"asin": "B007HBLX8I", "description": "Poetic Protective Case for iPad 3/iPad 4 adds the functionality and protection you need, in this all in one design, folder style case. The Protective case features an ultra-thin hard shell tray that safely holds your iPad in place, and adds much needed scratch and drop protection while working on the go. The front flap of the Protective case is drapped with a soft leather like material, along with a microfiber interior lining that will keep your iPad's precious screen away from dust and scratches. With multiple stand positions and viewing options with the roll back cover, and interior spines - you'll be enjoying your iPad in comfort and in style, with your new Protective case by Poetic.Poetic warrants the Poetic Brand of Products against defects in material or workmanship for a period?3 (three) Yearsfrom the original date of purchase of the product by a consumer through an authorized Poetic dealer. Poetic does not warrant, and is not responsible for, any smart phone, tablet or other device made by any manufacturer other than Poetic. If a defect arises in the materials or workmanship warranted by Poetic, Poetic will replace that unit as long as it falls within the warranty constraints.The Poetic name, logo, all product names, customer graphics, trademarks and service marks appearing on the Poetic website unless otherwise noted, are service marks, trademarks (whether registered or not) and/or trade dress of Poetic brand.", "title": "Poetic Protective Case for The NEW iPad HD / iPad 2 / iPad 3 /iPad 4 with Built-in Folding Cover Blue - Support Auto Wake/Sleep Function (3 Year Manufacturer Warranty From Poetic)", "price": 14.95, "imUrl": "http://ecx.images-amazon.com/images/I/31IfOa9itdL._SX300_.jpg", "related": {"also_bought": ["B00CW1N6CY", "B004WYA852", "B00EX9J95G", "B00746NEJW", "B00CW1N7DW", "B00CW1N6R4", "B00746UVQG", "B008UHKTCY", "B00FNX0IRE", "B00746UR2E", "B00746VS86", "B00FNX0KAE", "B00CW1N7Q4", "B00CB7T52O", "B00746LVOM", "B00FNX0GOE", "B00CW1N5Z2", "B00CW1N732", "B00EI4OIGQ", "B00G3TUL4C", "B00E5NOXM4", "B00EX9J992", "B00FNX0JSM", "B0073FE1F0", "B004SBBD8U", "B00E44B18I", "B00G6C611S", "B00CZ6D248", "B00EV5Z7YY", "B00EL94Z4I", "B004R2VMWC", "B00DMKGPP4", "B00BNQYIUS"], "bought_together": ["B004WYA852"], "buy_after_viewing": ["B00CB7T52O", "B0091DF9CG", "B00CW1N6CY", "B00CZ6D248"]}, "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Cases & Sleeves", "Cases"]]}