{"asin": "B00IZGWTVO", "categories": [["Electronics", "Portable Audio & Video", "CB & Two-Way Radios", "CB Radios & Scanners"]], "description": "The Cobra CWR200 is an All-Hazards-Alert weather radio with new weather alert features that make it Cobra Electronics&#x2019; most advanced all-purpose weather radio to-date. As a NOAA Weather and Emergency Radio, users receive alerts to over 60 emergency related events such as tornados, hurricanes, blizzards, natural disasters, civil emergencies and more. As well, the CWR200 features Specific Area Messaging Encoding (S.A.M.E), allowing users to filter and receive alerts concerning only their local area. The CWR200 is a durable, All-Hazards-Alert weather radio that has been designed with ruggedness and harsh conditions in mind. The CWR200 helps outdoor recreationists or individuals and families located in highly-active storm locations to stay connected and informed of the environment around them. The CWR200 can also be used as a preparation tool for when severe weather strikes. The radio also includes a number of additional user benefits, including a rubberized grip for traction in slick environments, and an illuminated dot matrix LCD display for ease-of-use when navigating through menus. As well, users receive a set of AA NiMH rechargeable batteries, micro-USB A/C charger, desktop charger and a wrist strap with purchase.", "title": "Cobra Electronics CWR 200 Weather and Emergency Alert Radio (Orange)", "price": 32.42, "imUrl": "http://ecx.images-amazon.com/images/I/41E5eJPd5pL._SY300_.jpg", "brand": "Cobra", "related": {"also_viewed": ["B003FGWF04", "B003DMIGQC", "B003S81Q04", "B0083J46Q4", "B00126K8BM", "B005R5MEXE", "B000TG91T6", "B000P708NM", "B00GRSSC72", "B000P0PW76", "B0080JIVC2", "B00EYI8GTQ", "B00C5B276W", "B00AJVMVQQ", "B002YT8A2A", "B000U92H34", "B008N2O2GK", "B00009V2YV", "B00176T9OY", "B003QHXZM4", "B00AQ2BRXQ", "B00004TKVD", "B00ECGWZRO", "B00JU77TTE", "B000P0O12I", "B000OYJ62U", "B000E99WOC", "B0012YHQVE", "B000P0M99U", "B005I1B1RM", "B007T13LD6", "B00BSYCZZ0", "B007B5ZR4G", "B000069DOV", "B004OVE61U", "B00772EAT6", "B002VMKU1O", "B001J5MQ20", "B000167NZI", "B003JHJL38", "B00005Q4ZV", "B00IKU3PFE", "B003XU76O2", "B004YWB2DE", "B005JW6X1O", "B003I29YF4", "B00J75CNRW", "B00ICCON7E", "B00480OV30", "B00BKV3ALE", "B00IZGWYDM", "B007Z7KROK", "B00ET8FP68", "B007KFXHFS", "B00B20M8CU", "B00I4ZITYM", "B00EQV1I0K", "B00IA96MBE", "B0001OHH0Q", "B00FPQR7KK"], "buy_after_viewing": ["B003FGWF04", "B003DMIGQC", "B00176T9OY", "B00009V2YV"]}}