{"asin": "B0007Y798U", "description": "From the Manufacturer Take everything you love about iPod and shrink it. Now shrink it again. The pencil-thin iPod nano packs the entire iPod experience into an impossibly small design. So small, it will take your music places you never dreamed of.Believe Your EarsCall it astonishing. Unbelievable. Impossible, even. Then pick it up and hold it in your hand. Take in the brilliant color display. Run your thumb around the Click Wheel. Put on the earbuds and turn up your music. That&rsquo;s when everything becomes clear: It&rsquo;s an iPod.The iPod nano is the same thickness as a #2 pencil.It holds up to three days&rsquo; worth of music. It plays for up to 14 hours between battery charges.(1) It displays the color album art for the song you&rsquo;re listening to right now. It carries your photos, podcasts and audiobooks. It syncs seamlessly with iTunes. It connects to a host of iPod accessories. Simply put, iPod nano is 100-percent iPod. And then some.Touch and GoiPod nano&rsquo;s Click Wheel puts music under your thumb. Click to fast-forward, rewind, play, pause or access menus. Use the touch-sensitive surface to control volume or browse music. You can do it all without looking. But with an iPod this beautiful, who&rsquo;d want to?The small form of the iPod nano lets you take your music anywhere.Song StylingsAdd accessories to your iPod nano via the Dock connector and headphone jack and your music will always keep up with you -- at home, on the go, even in your car. Of course, in either signature white or sleek black, iPod nano itself makes the ultimate accessory.Up to 4 GB(2) of skip-free storage on a featherweight iPod means you can wear almost three days&rsquo; worth of music around your neck. Or jog with 1,000 songs on your arm. Now that you can take your music everywhere, there&rsquo;s no limit to where it will take you.iPod nano FeaturesHolds up to 1,000 songs and full-color album artOnly 3.5 x 1.6 x 0.27 inches and 1.5 ouncesBright 1.5-inch color LCD displayUp to 14 hours of battery lifeApple Click WheelCharges and syncs via USBAccessory-compatible Dock connectorCompletely skip-free playbackWorks with Mac OS X or Windows 2000/XPPlays music, podcasts and audiobooksHolds up to 25,000 photosSyncs contacts, calendars and to-do listsRechargeable batteries have a limited number of charge cycles and may eventually need to be replaced. Battery life and the number of charge cycles vary by use and settings. See www.apple.com/batteries for more information.1GB = 1 billion bytes; actual formatted capacity less. Song capacity based on 4 minutes per song and 128-Kbps AAC encoding.", "title": "Apple 4 GB iPod nano - White (1G)  (Discontinued by Manufacturer)", "price": 49.99, "imUrl": "http://ecx.images-amazon.com/images/I/31JYJP2V03L._SY300_.jpg", "related": {"also_bought": ["B0007Y79AI", "B0007Y79B2", "B000BMAL10", "B0007Y7976", "B000932AMO"], "buy_after_viewing": ["B0097BEECI", "B0097BEDPG", "B000GAAP8Q", "B0097BEE9Q"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}