{"asin": "B001FWXKMM", "categories": [["Health & Personal Care"]], "description": "Designed to give you some peace of mind when your child comes down with a fever, the Braun Thermoscan Ear Thermometer with ExacTemp Technology has all the features you could ever want in a thermometer. Used by more doctors' offices than any other infrared thermometer brand, the Thermoscan features a pre-warmed tip that improves accuracy, a unique guidance system that ensures precise results, and infrared technology that takes your child's temperature in seconds.View largerView largerProduct SpecificationsModel #IRT-4520CategoryInfraredDimensions9.06 x 6.85 x 3.54 inchesColorBlue/WhiteWarranty60 daysRelated ProductLF-40 Ear Thermometer Lens FiltersEar Thermometers Deliver Most Precise ReadingsIf you are the parent of a young child, you probably know all too well that the average baby gets seven fevers a year. Clinical studies prove that ear thermometers reflect changes in core body temperature faster than oral thermometers and more accurately than rectal or temple measurements.Rectal temperatures lag behind changes in core body temperature, so they are not always a reliable indicator. Temple and underarm measurements take skin temperatures, not core body temperatures, so they can be influenced by external factors such as sweating or drafts. Likewise, oral temperatures can be influenced by external factors such as drinking, eating, and breathing.The eardrum, however, shares its blood supply with the temperature control center of the brain, so changes in body temperature are reflected sooner and more accurately in the ear than in other places.Pre-warmed Tip and Guidance System Ensure Accuracy Every TimeWhen you use the Braun ThermoScan, you can be sure you'll receive professional-level results every time. Unlike other ear thermometers, Braun ThermoScan ExacTemp features a patented pre-warmed tip. This feature minimizes the cooling effect on the ear canal that can result from using room-temperature tips, meaning you get the most accurate results possible.Additionally, the ThermoScan's unique ExacTemp technology with Guidance System confirms with a light and a beep when you have taken a proper measurement. An ExacTemp light flashes during the measuring process and signals when the probe has not been placed correctly in the ear canal. The light shines continuously once the temperature has been taken, and a beep signals that you have an accurate reading.And when you have to regularly monitor your baby's temperature, the ThermoScan's memory function facilitates by keeping track of the development of the temperature, storing up to eight different results.Infra-Red Technology and Flexible Tip Make Measurement Fast and GentleThe Braun ThermoScan is the perfect thermometer for parents who have fussy children. The ThermoScan measures the infrared heat generated by the eardrum and surrounding tissue, giving an accurate temperature in just a few seconds. With such a fast measurement time and with a small, soft, flexible tip, the ThermoScan is as gentle as can be. In fact, the ThermoScan is so gentle and fast, you can take your baby's temperature while he or she is sleeping, without worrying about an unscheduled wake-up.Lens Filters Improve Accuracy and SafetyTo ensure the accuracy of every temperature reading, a new clean lens filter should be used for each measurement. Lens filters protect the tip from scratches, as well as from impurities such as earwax, which might adversely affect the accuracy. Furthermore, exchanging the lens filter before every temperature reading virtually eliminates the risk of spreading germs from one person to the next.For ease of use, a lens filter detector makes sure that a lens filter always is in place, and a lens filter ejector makes removing used lens filters as easy as can be.About Braun: Award-Winning Design, Quality, and InnovationBraun strives to fulfill consumer needs by creating products that have innovative features and benefits, high-quality performance and durability, and ergonomic, distinctive, and aesthetic design. Braun products consistently achieve outstanding ratings tests conducted by independent consumer organizations, and international awards and exhibitions document the reputation of the company and its products.What's in the BoxBraun Thermoscan Ear Thermometer with ExacTemp Technology, protective case, lens filters, and batteries.", "title": "Braun Thermoscan Ear Thermometer with ExacTemp Technology, IRT4520USSM", "price": 39.88, "imUrl": "http://ecx.images-amazon.com/images/I/31Iey7pk3UL._SY300_.jpg", "brand": "Braun", "related": {"also_bought": ["B001FWXJJG", "B002QYW8LW", "B005MI648C", "B000W3XEQM", "B006Z6E8AG", "B004C053C4", "B000JOT2RO", "B000LPZTQY", "B000GUZC2A", "B000CSBP3G", "B009QXDE32", "B004C053AQ", "B003CT36NE", "B005ZDIBAS", "B004HMUIN6", "B0021HR94K", "B0032YTT9E", "B000V88HJM", "B00849L3QO", "B00HCN268W", "B000BNCA4K", "B006VIJOPW", "B000YDDF6O", "B00913CZ64", "B00DEF49I2", "B00EOML70W", "B000JVCBBG", "B006L1OA6M", "B0011YS0J2", "B00A475DRO", "B000ICZ9Y2", "B0031E1GEG", "B001FZGTJA", "B000VPR7UK", "B000LSL5ZK", "B006ZBREJ8", "B00HZO5S4M", "B000UVX7KE", "B0083TTLG4", "B006XFC9AA", "B00BR04QIE", "B002F9MUX4", "B00AXS00IQ", "B00537128O", "B000IDSLOG", "B009SYWHOQ", "B000XV7ORI", "B004QZBEFK", "B004EDYQT0", "B0013O9RX8", "B003DYQ59U", "B006XISCNA", "B000NG5K9W", "B0030UF6EW", "B002TLU5JO", "B0012S5HRU", "B006YPTZRO", "B000JILUYI", "B000FPM22Y", "B000050FE2", "B004HMQPJ2", "B006ZBOJX2", "B004V7JXFG", "B000MXHQTS", "B00EOML96O", "B00J2P9V36", "B006GYLL8Y", "B009YSYD20", "B007HKOL92", "B000GZJITI", "B001EHLSSG", "B001UF8BL4", "B001EHI316", "B001LENCUE", "B003E6OBMA", "B002A9JCY4", "B001E5D0CU", "B001SCK644", "B00318CLUU", "B005Q3LSDO", "B001EXKWH8", "B00AP5OEE8", "B00GOBPDAG", "B00C6PXYTQ", "B000H612Y0", "B00JJ3ODGG", "B00E1CI2TO", "B0017ILBHU", "B004KKXNM8", "B0057ECYS0", "B000GB0NZK", "B001263PFI", "B000ER3FD8", "B002VATZDU", "B000BFR3PE", "B000N0SNHY", "B001PBFWMO", "B000056JBU", "B007LKFW7I", "B0032AM8JG"], "also_viewed": ["B00EP1ZLO0", "B00JYPFZXO", "B001FWXJJG", "B001FWXJIW", "B0011YS0J2", "B004T6G550", "B002QYW8LW", "B00E3OY80W", "B002RL7UWQ", "B00CKL70LO", "B000LPZTQY", "B000050FE2", "B003CT36NE", "B000W3XEQM", "B00082IXCM", "B0032YTT9E", "B0001D0LMS", "B000JOT2RO", "B005MI648C", "B000GUZC2A", "B000CSBP3G", "B004HMUIN6", "B006Z6E8AG", "B000EGI5HU", "B00LT4YFEI", "B00CV041OS", "B00GKF71Y2", "B000LSL5ZK", "B009QXDE32", "B004C053AQ", "B005ZDIBAS", "B000GZJITI", "B004C053C4", "B006VIJOPW", "B00005UMZS", "B003DYQ59U", "B000V88HJM", "B001FZGTJA", "B00HPZQ85E", "B00LIBA7D0", "B00KVJA8C0", "B00537128O", "B000JILUYI", "B00DEF49I2", "B00849L3QO", "B0021HR94K", "B00LIFCLB2", "B00KUYCEJQ", "B00LC6NUFS", "B006XFC9AA", "B00AP5OEE8", "B000050FE0"], "bought_together": ["B002QYW8LW"], "buy_after_viewing": ["B00EP1ZLO0", "B002QYW8LW", "B001FWXJJG", "B004C053C4"]}}