{"asin": "B002FB7IWU", "description": "Klipsch Image S2m: Superior Sound and Convenient Call FunctionsKeep your favorite music close and your family and friends closer with the Image S2m. Not only does this in-ear headset deliver superior sound performance, it features a single-button mic that puts phone calls right at your fingertips.Accommodates phones with a 3.5mm headphone jackAnswer and end calls with the touch of a buttonPrecise, comfortable fit for long-term wearSuperior noise-isolation designSkype compatibleDelivers smooth sound with great bassDurable, built-in strain reliefIt&rsquo;s great that today&rsquo;s phones let you enjoy your digital music files while on the go. But if you&rsquo;re listening through standard headphones and a call comes in, you probably have to fiddle around before you can answer. The Image S2m in-ear headset easily solves that problem.&nbsp;Complete ConvenienceThe Image S2m features a compact in-line mic that lets you answer or end calls with the touch of a button. Furthermore, the mic has amazing intelligibility, so it easily picks up your voice without having to talk directly into it.&nbsp;Amazing Comfort and FitMade just for you, the Image S2m&rsquo;s exclusive soft and flexible oval ear tips naturally fit the contours of your ear canals, providing comfortable long-term wear as well as producing a perfect acoustic seal. A good seal minimizes outside noise, also known as noise isolation, and allows you to enjoy your music at lower, safer volumes.These headphones come with three different sizes of washable ear tips: small, medium and large single flange designs. So light and narrow, they are virtually impossible to feel inside your ears.&nbsp;Premium SoundAt the heart of every Klipsch product is over 60 years of audio expertise beating strong. Our commitment to no-compromise performance has made us the preferred choice of top cinema operators, a leader in stereo and home theater sound and now a premium name in headphones.The Image S2m delivers strikingly realistic sound through the use of a single, moving coil driver per channel. These customized drivers dig deep into the musical spectrum with a level of dynamic detail that many speakers can&rsquo;t produce. From heart-pounding bass to spine-tingling guitar riffs, you won&rsquo;t miss a beat.&nbsp;Added FrillsAvailable in a beautiful piano black finish, the Image S2m comes with three different-sized oval ear tips and a cloth carrying pouch. It carries a two-year warranty and works with portable devices that feature a standard 3.5mm headphone jack.As a bonus, because many phones have side-mounted headphone jacks, the S2m employs a right-angled plug that swivels to avoid the damage that&rsquo;s often associated with straight plug designs. It&rsquo;s also a feature that lets your phone fit comfortably in your pocket.Helpful HintsDoes the Image S2m work with all cell phones?The Image S2m is compatible with virtually all phones that have a 3.5 mm headphone jack.&nbsp;Consult your cell phone owner&rsquo;s manual for compatibility.Why does the Image S2m have a right-angled plug?Because many phones have side-mounted headphone jacks, the S2m employs a right-angled plug that swivels to avoid the damage that&rsquo;s often associated with straight plug designs. It&rsquo;s also a feature that lets your phone fit comfortably in your pocket.", "title": "Klipsch Image S2m Noise-Isolating Headset with Microphone and Single-Button Control (Discontinued by Manufacturer)", "price": 68.99, "imUrl": "http://ecx.images-amazon.com/images/I/41BG3dMc0uL._SY300_.jpg", "related": {"also_viewed": ["B001FWYXF0", "B004HD4L2E", "B001EZYMF4", "B002RWJDB6", "B004U4A5RU", "B004RKVXXM", "B001939H4C", "B001U612R8", "B003EM800S", "B003EM8008"], "buy_after_viewing": ["B008VHHYLW", "B008X8HZZO", "B008X9Q0JK", "B008VGN75U"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]]}