{"asin": "B001AZ01EO", "categories": [["Electronics", "Computers & Accessories", "Routers"]], "description": "From the ManufacturerThe Dual-Band Wireless-N Gigabit Router is really four devices in one box. First, there's the dual-band Wireless Access Point, which lets you connect to the network without wires. There's also a built-in 4-port full-duplex 10/100/1000 Switch to connect your wired-Ethernet devices together at up to gigabit speeds. The Router function ties it all together and lets your whole network share a high-speed cable or DSL Internet connection.We've also included a Storage Link that lets you easily add gigabytes of storage space onto your network using readily available USB 2.0 hard drives--or plug in a USB flash disk for a convenient way to access your portable data files. The built-in Media Server streams music, video, and photos from the attached storage device to any UPnP compatible media adapter. And you can get to your files from anywhere in the world through the Internet.The Access Point built into the Router uses a dual-band version of the very latest wireless networking technology, Wireless-N (draft 802.11n). By overlaying the signals of multiple radios for each band, Wireless-N's \"Multiple In, Multiple Out\" (MIMO) technology multiplies the effective data rate. Unlike ordinary wireless networking technologies that are confused by signal reflections, MIMO actually uses these reflections to increase the range and reduce \"dead spots\" in the wireless coverage area. The robust signals travel farther, maintaining wireless connections much farther than standard Wireless-G.With Wireless-N, the farther away you are, the more speed advantage you get. It works great with standard Wireless-G, -A, and -B equipment, but when both ends of the wireless link are Wireless-N, the router can increase the throughput even more by using twice as much radio band, yielding speeds much faster than standard Wireless-G. But unlike other speed-enhanced technologies, Wireless-N can dynamically enable this double-speed mode for Wireless-N devices, while still connecting to other wireless devices at their respective fastest speeds. In congested areas, the \"good neighbor\" mode ensures that the Router checks for other wireless devices in the area before gobbling up the radio band.Since the Router can operate in both the 2.4 and 5 gigahertz radio bands at the same time, it effectively doubles your available wireless bandwidth. For instance, you could set up your network to handle video streaming on one radio band, and use the other band for simultaneous data transfer--avoiding any interference or collisions that would degrade the video performance.To help protect your data and privacy, the Router can encode all wireless transmissions with industrial-strength 256-bit encryption. It can serve as your network's DHCP Server, has a powerful SPI firewall to protect your PCs against intruders and most known Internet attacks, and supports VPN pass-through. Configuration is a snap with the web browser-based configuration utility.The incredible speed of Wireless-N and gigabit wired networking is ideal for media-centric applications like streaming video, gaming, and Voice over IP telephony, and gives you plenty of headroom to run multiple media-intense data streams through the network at the same time, with no degradation in performance. With the Linksys Wireless-N Storage Link Router at the center of your home or office network, you can easily add storage, share a high-speed Internet connection, files, printers and multi-player games, and run media-intensive applications at amazing speeds, without the hassle of stringing wires.", "title": "Cisco-Linksys WRT610N Simultaneous Dual-N Band Wireless Router", "price": 189.99, "salesRank": {"Electronics": 24640}, "imUrl": "http://ecx.images-amazon.com/images/I/41rgY5rjqjL._SX300_.jpg", "related": {"also_bought": ["B0028N6VNW", "B003B48UQ8", "B0058NN6CS", "B008I64BWQ", "B004T9RR7C"], "bought_together": ["B003B48UQ8", "B004XC6GJ0"], "buy_after_viewing": ["B007IL6OR2", "B006QB1RPY", "B00FB45SI4", "B007IL7AKM"]}}