{"asin": "B000BTCJNG", "related": {"also_bought": ["B002NU5UW8", "B002ZIMEMW", "B003TYDBYQ", "B004AZ38Z0", "B003WGR3PY", "B007FH8MS8", "B003D8KV0K", "B001ENW61I", "B00BXA7N6A", "B001KNP3MQ", "B003UOIMAS", "B003DPKUDQ", "B00B8JRPXC", "B0090BSSZO", "B005KEL4NI", "B00CYVNX0W", "B004V3I6JY", "B007BD4BRC", "B004ABHKZ8", "B008K83ZH4", "B001196MG0", "B00CXM03D2", "B004XY65WQ", "B001WB02Z4", "B0034WR71G", "B002SWIOOM", "0240812255", "B004TGZ7WM", "B007FH1KX2", "B0019SHZU0", "B007ODZYRK", "B003UOIMBW", "B0034WR19Y", "B004FNRTGG", "B00GUQJZCW", "B001GQO8ZK", "B00GD6K5KA", "B005IQRMN4", "B006TF37H8", "B001AHALEC", "B001C6SYR2", "B0054EKSMC", "B0002ER2Z0", "B0073HCE3O", "B004RIC11C", "B00BXM4VKO", "B00009UTZA", "B00HT9MA1W", "B002S9KTAW", "B001KELVS0", "B00E8NLOY6", "B002P32990", "B004YW79F4", "0321786610", "B00A9PB8WU", "B00009UTL1", "B004QEX0BM", "B001SVJUPG", "B00554PCDG", "B004M7921K", "B003LYURRI", "B001WRP4WE", "B0083Z6R4W", "B007KA3LQS", "B00908A8PK", "B001GO5TU0", "B003Y30334", "B006ISEJ9Q", "B0002ER2YQ", "B008AZJXDM", "B00G6PNF8M", "B004MASO4I", "B002W5P8GW", "B0009BX0AM", "B00761MABI", "B00009R8ZW", "B004RE3CFU", "B004BFXBXI", "B001DIG46M", "B005ODKR8S", "B001TZWFBM", "B0079M711S", "B00492BTKK", "B00H40IJZW", "B000XB9GV0", "B00DBB7Q02", "0321814339", "B0040JHG86", "B001C6YKD4", "B001TCCZYM", "B002S9KDKS", "B00BP1W52Y", "B00007GQLU", "B003PFKIEK", "B00EPXQ28W", "B007B8Y1KO", "B000CLNHXY", "B006NYJNTG", "B001E4LC6C"], "bought_together": ["B002ZIMEMW", "B004AZ38Z0"], "buy_after_viewing": ["B00009X3UA", "B007FH8MS8", "B005A0ETXY", "B001KNP3MQ"]}, "title": "Sekonic L-308s Light Meter - Black", "price": 219.0, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41UvYsslpmL._SY300_.jpg", "brand": "Sekonic", "categories": [["Electronics", "Camera & Photo", "Lighting & Studio", "Light Meters & Accessories", "Light Meters"]], "description": "\"The pocket-sized Sekonic L-308S Flashmate is the smallest and lightest digital light meter in the Sekonic line-up. It is designed to read ambient or flash exposures in either reflected or incident modes, and it displays accurate exposure readings in full, half, or third-stop increments to mirror the exposure settings of today's DSLR and film cameras.The L-308S delivers accurate exposure readings in full-, half-, or third-stop increments to mirror the exposure displays of most popular cameras. When set to full-stop mode, exposures are displayed in tenth-stop increments with a repeat accuracy of +/- 0.1 EV.The LCD screen is designed to emulate the look and feel of its bigger brother, the Sekonic L-358 flash meter. Exposure data and related information are displayed using large type and easy-to-read icons, perfectly legible in even low-level lighting conditions.Incident or reflected light measurement - Reflected light readings are captured at a receiving angle of about 40 degrees for subject readings made at the camera. Slide the L-308S's built-in Lumisphere over the silicon photo diode for incident light exposure readings of three-dimensional subjects. Snap on the included Lumidisc over the sensor for metering flat artwork or measuring contrast and/or exposure ratios within a scene.Ambient / Flash measurement - Incident or reflected ambient light readings can be made with the L-308S over a wide range of lighting conditions at shutter speeds from 60 seconds to 1/8000th of a second and apertures from f/stops of f/1.4 to f/90.9. Flash at speeds from 1 to 1/500th of a second can be measured cordlessly or wired using a separate accessory PC cord. Flash and ambient readings are automatically calculated to display the proper exposure for the combination.Accurate measurements - Exposures accurate down to a tenth-of-a-stop for both ambient and electronic flash light readings are available in full-stop mode. The L-308S can also display shutter speeds and apertures in half or third-stop increments to mirror the exposure settings on your camera with a repeat accuracy of +/- 0.1 EV. For cinema applications frame rates can be set from 8 to 128 frames per second. ISO sensitivity can be set from 3 to 8000 in third-stop increments.Compact size and lightweight - The L-308S is the smallest digital flash meter for reflective and incident light readings in ambient or electronic flash lighting conditions. It is compact and light enough to fit into a shirt pocket, yet versatile enough to meet virtually every photographic demand. The L-308S is powered by a single AA battery and weighs only 3.4 ounces (95g). Its measurements are a compact 2.5\"\"W x 4.3\"\"H x 0.9\"\"D (63mmW x 110mmH x 22mmD).Accessories -  The Sekonic L-308S FlashMate comes with a Lumidisc (with pouch), soft case, strap, synchro terminal cap and an AA battery. It has a full, 1-year warranty, extendable at no charge to 3 years total (in the USA only) after registration, and is backed by our outstanding customer support team.L-308S Flashmate - Technical SpecificationsType: Digital exposure meter for ambient and flash lightReceptor Head: Sliding Lumisphere with Lumidisc AdapterLight Receiving Method: Incident light and reflected lightReceptor Incident Light: Built-In Lumisphere, Attachable Lumidisc (included)Receptor Reflected Light: Lens with 40 degree Recieving AngleLight Receptor Element: Silicone photo diodeMeasuring Range and ModesMeasuring Modes Ambient Light: - EV metering & Shutter priority meteringMeasuring Modes Flash: - Without synchro cord & With synchro cordMeasuring Range (ISO 100) Ambient Light: - Incident light EV 0 to EV 19.9 &  Reflected light EV 0 to EV 19.9 (with 40 Degree angle)Measuring Range (ISO 100) Flash: - Incident light f/1.4 to f/90.9 (approx. f/124) &  Reflected light f/1.4 to f/90.9 (approx. f/124) with 40 Degree LumigridRepeatability Repeat Accuracy: (+/-) 0.1 EV or lessCalibration Constant Incident: Lumisphere C = 340, Lumidisc C = 250Calibration Constant Reflected: K = 12.5Display Range and ModesDisplay Range Film Speed: ISO 3 to 8000 (in 1/3 steps)Display Range Shutter Speeds Ambient: 60 sec to 1/8000 sec. (in 1, 1/2, 1/3 steps)Display Range Shutter Speeds Flash: 1 sec to 1/500 sec. (in 1/ 1/2, 1/3 steps) plus 1/75, 1/80, 1/90, 1/100 sec.Display Range Aperture: f/0.5 to f/90.9 (in 1, 1/2, 1/3 steps)Display Range EV: EV -5.0 to EV 26.0 (in 1/10 steps)Display Cine Speeds fps: 8, 12, 16, 18, 24, 25, 30, 32, 64, 128 (shutter angle: 180 Degree)OtherExposure Out Of Range: Eu (underexposure) or Eo (overexposure)Auto Power Off: Yes, About 4 minutes after last usageBattery Power Indicator Display: Icon with 3 statusBattery(Power): (1) Type AA 1.5V Battery alkaline, manganese or lithiumOperating Temperature Range: 32 to 104 F / 0 to 40 CStorage Temperature Range: -4 to 140 F / -20 to 60 CDimension and WeightProduct Dimensions: 4.30x2.50x0.90 in./10.90x6.40x2.30 cmProduct Weight: 0.20lbs./0.10kg.Item IncludesL-308S, L-308S Case, AA 1.5 volt battery, Strap, Syncro Terminal Cap and Lumidisc w/ case \""}