{"asin": "B000P1QJXQ", "related": {"also_bought": ["B0006PUDQK", "B003P2UMS0", "B0006Q3B2W", "B009LD6XH6", "B00BVD0D66", "B000L9635G", "B005DTBCD2", "B003P2UMQ2", "B009LD36TO", "B003FLMX5G", "B00BVQZXWW", "B003FLMX60", "B000RGF29Q", "B00009MDBU", "B0017YXIKC", "B000L9FQUO", "B003P2UMNK", "B003UQ17O4", "B0040JH21W", "B0049P6OTI", "B001AQRVZU", "B004G7O1PI", "B0068LACFI", "B000068O4D", "B002SVANCY", "B000CRFOMK", "B009ZGK6QS", "B006U3O566", "B00APEG9M4", "B000234UFG"], "bought_together": ["B0006PUDQK", "B003P2UMS0"], "buy_after_viewing": ["B003P2UMQ2", "B003P2UMS0", "B0006PUDQK", "B000L9635G"]}, "title": "Smart Strip SCG3 Energy Saving Power Strip with Autoswitching Technology", "price": 26.95, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31GD0HOSoaL._SY300_.jpg", "brand": "Smart Home USA", "categories": [["Electronics", "Accessories & Supplies", "Batteries, Chargers & Accessories", "Power Strips"]], "description": "With patented auto-switching technology that saves you money on electrical bills, the Smart Strip SCG3 Energy Saving Power Strip features seven outlets that work in sync to efficiently power your electrical devices. This unique energy-saving power strip automatically switches devices on and off and uses less than one watt of power when fully energized. And with premium EMF/RFI filtering and 900-joule protection to defend devices against surges, this strip keeps your valuable electronic equipment fully protected..caption {font-family: Verdana, Helvetica neue, Arial, serif;font-size: 10px;font-weight: bold;font-style: italic;}ul.indent {list-style: inside disc;text-indent: 20px;}table.callout {font-family: Verdana, Helvetica, Arial, serif;margin: 10px;width: 250;}td.callout3-c26 {height: 100 percent;background: url('http://g-ecx.images-amazon.com/images/G/01/th/content_26/Q1_2009/c26-callout3.png') repeat-y;border-left: 0px solid #999999;border-right: 1px solid #999999;padding: 10px;width: 250px;}ul.callout {list-style: inside disc;text-indent: -12px;font-size: 12px;line-height: 1.5em;}h5.callout {text-align: center;}img.withlink {border:1px black solid;}a.nodecoration {text-decoration: none}The Smart Strip SCG3Energy Saving Power Strip:Provides a safe, uninterrupted power supplyAuto-switches devices on and off to save energyUses less than one watt of power when fully energizedOffers an EMI/RFI filter and 15 AMP circuit breakerDelivers 900-joule and 48,000 AMP protectionSeven outlets work in sync to power and protect your electrical devices.View larger.Protection and Power-Efficiency Save You Money and WorryYou don't want your power strip to eat up power, but you also want assurance that your equipment is safe from harsh power surges. Ideal for computer systems and home entertainment centers, the Smart Strip SCG3 employs a proprietary auto-switching technology that automatically shuts down devices that are not in use, saving you money and reducing your overall energy usage.The Smart Strip has seven clearly marked outlets that you plug your computer or home entertainment center peripherals into. When you power down computer or stereo, the Smart Strip automatically shuts down the power to your computer's and entertainment's center peripherals. This unique feature not only saves you money and helps the environment, it also makes shutting down your systems fast and easy.Unlike most power strips, the Smart Strip itself uses very little energy. It uses one watt of power when fully engaged and less than 1/4 of a watt when the automatically switched outlets are off.Advanced Surge Protection with Superior EMI/RFI FilterPower strips without EMI/RFI (Electromagnetic Interference/Radio Frequency Interference) run the risk of allowing waves from one electronic device to cause malfunctions or interference in another. The Smart Strip SCG3 protects you from this risk with its advanced EMI/RFI filter, backed up by a 15 AMP circuit breaker. Plus, a passive current sensor ensures an ultra-safe, ultra-clean switching off and on of your peripherals, giving you added peace of mind that your valuable electronics will remain safe.The possible hazards of power surges are further prevented with 900-joule surge protection and 48,000 AMP protection, both of which employ a three-way design to give you the ultimate protection for your valuable equipment.Place for Convenience with Long Cord and 45-Degree PlugThe Smart Strip SCG3's widely spaced, clearly marked outlets give you the space and ease to connect all necessary equipment. The four-way wall mountable design, 45-degree space-saver plug, and heavy-duty six-foot power cord offer the versatility to place the power strip wherever it is most convenient, so it never gets in the way of your footpath or your home d&eacute;cor. A lighted power switch keeps the strip visible, so you're never left fumbling in the dark.The Smart Strip SCG3 is backed by a full two-year warranty for defects and includes a lifetime $30,000 connected equipment warranty.What's in the BoxSmart Strip SCG3 Energy Saving Power Strip with Autoswitching Technology"}