{"asin": "B000JLKIHA", "description": ".caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; }With 80GB or 160GB of storage, iPod classic gives your music and video room to move. It also has plenty of energy (up to 40 hours of audio playback), good looks (a sleek, all-metal design), and a great personality (a brand-new interface with Cover Flow). In other words, iPod classic makes an ideal companion.Cover FlowIf a picture says a thousand words, think of what all the album art in your collection might say. With Cover Flow on iPod classic, you can flip through your music to find the album you want to hear. Use the Click Wheel to browse music by album cover, then select an album to flip it over and see the track list.With 80GB or 160GB of storage, iPod classic gives your music and video room to move.View iPod classic dimensions.Up to 40 hours of audio playback in the palm of your hand.View larger.MusicUse the Click Wheel to adjust volume, navigate songs, browse in Cover Flow, or explore the Music menu by playlist, artist, album, song, genre, composer, and more. Want to mix things up? Click Shuffle Songs. iPod classic makes your music look as good as it sounds, thanks to its big, bright, color display.MoviesBuy movies from the iTunes Store and you can sync them to your iPod classic to watch anywhere, anytime. The gorgeous 2.5-inch display makes your movies pop. And iPod classic keeps you entertained for up to 7 hours. Long flight or darkened room? Adjust the brightness for even more video playback time.TV ShowsThere's always something good on iPod classic. Browse thousands of episodes of your favorite TV shows on the iTunes Store, buy them for just $1.99 each, then sync them to iPod classic. Watch last night's episodes this morning, or buy a whole TV series and play a pocket-size marathon.PodcastsThe iTunes Store features thousands of free video and audio podcasts, including indie favorites and offerings from such big names as ABC News, Comedy Central, ESPN, PBS, NPR, and many more. Browse and subscribe to podcasts, then sync them to your iPod classic. You can even play video podcasts on TV using an optional Apple component or composite AV cable.AudiobooksThe digital shelves of the iTunes Store are stocked with thousands of audiobooks--including exclusives like the entire Harry Potter series--so you can catch up on your reading wherever iPod classic takes you. iPod classic recognizes where you left off and bookmarks your place. You can even adjust the reading speed to suit you.GamesPut hours of fun at your fingertips. iPod classic comes with three games--Vortex, iQuiz, and Klondike--and you can download more from the iTunes Store for $4.99 each. All iPod games are designed specifically for the iPod interface. And all of them look great on the 2.5-inch color display.Experience a whole new way to browse and view your music and video.Use the patented Click Wheel to flip through your music by album cover.Beautifully redesigned, iPod classic features a sleek, new all-metal enclosure.PhotosiPod classic holds up to 25,000 photos you can sync from your Mac or PC via iTunes. Use the Click Wheel to scroll through photo thumbnails the same way you scroll through song titles. To see a photo full screen, click the center button. You can even view photo slideshows--complete with music and transitions--on iPod classic or on a TV using an optional Apple component or composite AV cable.SearchWith up to 40,000 songs on your iPod classic, you need an easy way to search your collection. A built-in search function lets you use the Click Wheel to type out the name of the song, artist, album, audiobook, or podcast you're looking for. iPod classic returns results instantly as you select letters.ExtrasCalendars, contacts, and a clock appear in the Extras menu, along with a few more handy items. Take the screen lock, for example. Spin the Click Wheel to choose a four-digit combination and protect your iPod classic from prying eyes. If you forget your combination, just reset when you sync. Or use the built-in stopwatch to log your best times.", "title": "Apple iPod classic 80 GB 6th Generation(Black)  (Discontinued by Manufacturer)", "price": 257.95, "imUrl": "http://ecx.images-amazon.com/images/I/41mNXW9CAXL._SY300_.jpg", "related": {"also_bought": ["B000JO1380", "B006YNTJ6I", "B000WBDD56", "B002H9LNGW", "B002AF5184", "B0056BUVES", "B000WLXO9Q", "B001F7AHXM", "B000EPHR0C", "B00FABZTDW", "B002ICN1GS", "B000EPHPPE", "B000A3WS16", "B0019LM9AS", "B001A4Q8JM", "B000A3WS8O", "B00A36AX80", "B001NKGWEY", "B000A3WS84", "B002S0O7LI", "B001F7AHY6", "B004SBBD8U", "B00011KM38", "B00AWKJPMC"], "buy_after_viewing": ["B001F7AHOG", "B000JO1380", "B001F7AHXM", "B000A3WS84"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}