{"asin": "B002L0G54C", "description": "Parents and kids will enjoy spending quality time together with Storybook Workshop, an interactive reading-based game involving classic folk tales from around the world. Recordable readings, voice alteration and a Singalong mode bring each tale to life. You'll earn rewards, such as having your Mii appear in select stories, while introducing your children to the same beloved stories you heard as a child.Fairy tales from around the worldView larger.Virtual sticker pad!View larger.Listen to or perform each taleView larger.SynopsisIncluding 16 famous children's fairy tales, Storybook Workshop offers plenty of make-believe fun. Reminisce on your own childhood story time as you read well-known favorites such as Little Red Riding Hood, The Ugly Duckling and The Golden Goose. Read in your own voice, or use the Magic Voice feature to change your voice to sound like characters from the stories. You can also sing along to four classic children's songs and record them, so boys and girls can listen to the performances on their own.Key Game Features:Features 16 children's fairy tales to listen to or perform, such asLittle Red Riding Hood,The Ugly Duckling,The Town Musicians of BremenandBe Kind to the EarthIncludesThe Boy Who Went to the North Wind,The Little Match Girl,The Happy Prince,The Giant Turnip,A GloveandHats for the JizosIncludesThree Wishes,The Star Money,The Elves and the ShoemakerandThe Golden GooseServes as an interactive book with fairy tales from around the world written by Hans Christian Andersen, the Brothers Grimm, Aesop and other famous authorsPlay mini games and sing along to four classic children's songsRecord readings as well as the songs you perform in Singalong modeChange your voice to match that of a fairy tale character with the Magic Voice featureEarn rewards the more you read, such as the ability to feature your Mii in select storiesVirtual sticker pad helps track progress", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/51H%2B7DJ8%2BDL._SY300_.jpg", "related": {"also_bought": ["B002DC8GT0", "B002P8KOK6", "B003QPEKHA", "B002P8KOJM", "B000OAO188", "B001EGJTF6", "B002SRNFX2", "B001DZDUA8", "B000Z67GH4", "B000ME3M5O", "B003QP725W", "B003E66YA2", "B001NCJQTK", "B002BUUMNC", "B009AFLXZM", "B002P8KOJ2", "B004Y6DPQM", "B000UUWHS8", "B00273ZAH6", "B008CXUT12", "B005Q6R3C6", "B001CSS4QG", "B001DU0YAW", "B001EGJTEW", "B003JZASVE", "B0013E9HP6", "B000SFK0PW", "B003QWXZII", "B001UWGEZM", "B003OPYPMC", "B00503RP3M", "B001DZDUC6", "B003TK1HSM", "B0030U1YYS", "B0088I8M10", "B0045FEEAS", "B002F87WF6", "B0088I6JEW", "B004NB1BV4", "B001AWFIW2", "B001DO3NEW", "B003JZW6TG", "B008E6ZYNK", "B002KA20GA", "B0019R2QSM", "B000QD7BBM", "B001D0FZ60", "B00291C04M", "B003S2JI82", "B003ZRZVW2"], "bought_together": ["B002DC8GT0"], "buy_after_viewing": ["B002P8KOK6", "B002SRNFX2", "B003QPEKHA", "B002P8KOJM"]}, "salesRank": {"Video Games": 20890}, "categories": [["Video Games", "Kids & Family", "Wii", "Games"], ["Video Games", "Wii", "Games"]]}