{"asin": "B0040JHVC2", "related": {"also_bought": ["B007M54E08", "B00CV9ML5U", "B0002Y5WZM", "B00CV9MLLO", "B004GITBSE", "B0002YE6FY", "B00004ZCJK", "B0007Y794O", "B004ZIMU7Y", "B004Z4FBE2", "B00CV9M6U0", "1118004892", "B007M54E1M", "B00007E7JU", "B002VPE1WK", "B001KELVS0", "B004T4P6AM", "B00005K47X", "B00BWZU2U0", "B00FP1BQ1Q", "B004Q3C98S", "B005AY9278", "B00004WCGF", "B003VNKNF0", "B00004ZCFQ", "B0049XGNKK", "B00B27SIRC", "0321747437", "B00449NU3W", "B0082RT1BM", "B006D0K88U", "B004HREPCQ", "B0002Y5WZC", "1435459385", "B007SXJ13E", "B00009R6TA", "B0080JH3YE", "B00009XVCZ", "B001TZUS98", "B00CV9M7AO", "B004WB8EYM", "B0041EDRQ0", "B0045FLMIA", "B0062C4KQU", "B00004THCZ", "B00BI9X97I", "B002K46DDC", "B004EBUN2Q", "B004GLEWTY", "B00DZ0SMY8", "B00CAE8PM4", "B001CCAISE", "B0050CNVXG", "B006BGUP98", "B00CV9MKU6", "B001QWBM62", "B004XIB9T6", "B00CBB5GVO", "B004XC3GWU", "B00D61M8AK", "B0045JCPQE", "B0007WK8KS", "B005K7JLBM", "B00CF5OGP8", "B005AYT6R4", "B0041MY32Y", "B007NDL56A", "B0070WU51U", "B0037FLUYU", "B004IY7F20", "B004K8WPUQ", "B0034DUR6W", "B00I1CPA0O", "B00D6JWHWG", "B007M51J3I", "B000V7AF8E", "B00FXYT9DC", "B000NP3DJW", "B00HPQ09H6", "B00715CUEG", "B00I1CPAWC", "B00FXYTCVG", "B00I1CPACM", "B004JMZPJG", "B0055I2JWO", "B003Q9X770", "B00BW6LWO4", "B00I4DGRCU", "B00CF5OHZ2", "B00443EN2U", "B00461J0J6", "B00603S04E", "B00HPQ0A16", "B00317H7Q4", "B004TJ6JH6"], "bought_together": ["B007M54E08"], "buy_after_viewing": ["B003VNKNF0", "B007M54E1M", "B00DMS0GTC", "B00007E7JU"]}, "title": "Canon EOS 60D 18 MP CMOS Digital SLR Camera with 3.0-Inch LCD and 18-135mm f/3.5-5.6 IS UD Standard Zoom Lens", "price": 999.0, "salesRank": {"Camera &amp; Photo": 474}, "imUrl": "http://ecx.images-amazon.com/images/I/5163UrUy7qL._SY300_.jpg", "brand": "Canon", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]], "description": "With the new EOS 60D DSLR, Canon gives the photo enthusiast a powerful tool fostering creativity, with better image quality, more advanced features and automatic and in-camera technologies for ease-of-use. It features an improved APS-C sized 18.0-megapixel CMOS sensor for tremendous images, a new DIGIC 4 Image Processor for finer detail and excellent color reproduction, and improved ISO capabilities from 100-6400 (expandable to 12800) for uncompromised shooting even in the dimmest situations. The new Multi-control Dial enables users to conveniently operate menus and enter settings with a simple touch.The EOS 60D also features an EOS first: A Vari-angle 3.0-inch Clear View LCD (1,040,000 dots) monitor for easy low- or high-angle viewing. An improved viewfinder, a number of new in-camera creative options and filters, plus HDMI output for viewing images on an HDTV all make the EOS 60D invaluable for the evolving photographer. With continuously curved surfaces, user-friendliness and exuding solidity and refinement, the EOS 60D is true digital inspiration!EOS 60D Highlights18.0-megapixel CMOS sensor and DIGIC 4 Imaging ProcessorThe EOS 60D features a new, Canon-designed 18.0-megapixel APS-C size CMOS sensor that captures such a high level of resolution, it's easy to crop images for enlargement without concern of losing detail. A major factor in reducing noise, the CMOS sensor assures that images shot at highest sensitivity will be remarkably smooth.The improved DIGIC 4 Image Processor ensures that images are captured, processed and saved with remarkable speed. The EOS 60D DSLR's new 3:2 multiple aspect ratio, in-camera RAW image processing, creative filters, image resizing and provided S2 and S3 image-recording quality are all possible thanks to the DIGIC 4 Image Processor.  With dazzling results, the new DIGIC 4 Image Processor also works to capture and process data of images shot at 18.0 megapixels at 5.3 fps, as well as 14-bit signal processing for excellent image gradation, enhanced Face Detection Live mode, Full HD video recording, Auto Lighting Optimizer and Lens Peripheral Optimization.ISO 100-6400 (expandable to 12800) for shooting from bright to dim lightWith a broad range of ISO settings, expandable up to 6400 in the Auto Setting and 12800 with Custom function, the EOS 60D enables shooting from sunrise to sunset and helps ensure capture of the finest detail. With enhanced high-sensitivity optimization, subjects can be captured clearly and easily at high shutter speeds without flash, with minimized blur and noise. In bright scenes, especially long exposures in daylight, optimal exposure can be achieved with a fully open wide-diameter lens, no dark filter needed.Improved EOS HD Video mode with manual exposure controlDesigned for the evolving, tech-savvy user, the EOS 60D features HD Video capture technologies--manual exposure control for more creative control, for example--borrowed directly from professional Canon DSLRs to capture stellar video with all the benefits of shooting with a DSLR. By shooting video with the EOS 60D, photographers as well as filmmakers can take advantage of the creative features native to DSLR cameras. Along with its manual controls, the EOS 60D allows for full use of Canon EF and EF-S lenses, including Macro and Fisheye, providing a plethora of shooting options once reserved only for still photography. The resulting HD video is a standout in its beautiful depth-of-field characteristics and remarkable capture capability under poor lighting conditions. Additionally, a Movie Crop function is included: An SD-quality video (640 x 480) can be cropped to the equivalent of about 7x magnification of regular shooting.The audio input level can be set to Auto or Manual, up to 64 levels, and a wind filter minimizes unwanted background noise. By pressing the Quick Control button, a simple graphic user interface for adjusting image quality, white balance, image creation and other settings appears on the LCD. The EOS 60D even lets users edit video in-camera: On-site or off, unnecessary scenes can be deleted and the start/end points of video footage can be designated via in-camera editing functions without the need of a separate computer.Video can be captured at a number of resolutions and frame rates for numerous applications. It can capture 1920 x 1080 Full HD video at frame rates of 30 (29.97 fps), 24 (23.976 fps) and 25.0 frames per second, for up to 4GB per clip. Video footage is saved as MOV files and can be viewed in Full HD through the EOS 60D DSLR's HDMI output. Other recording sizes include HD at 1280 x 720 (50/60 fps) or SD/VGA at 640 x 480 (50/60 fps)--24/30 fps delivers cinema-like motion, while 60fps is perfect for footage being uploaded to video-sharing websites.  The EOS 60D also has a built-in microphone for simple mono recording and stereo sound can be recorded through a self-powered external microphone.Vari-angle 3.0-inch Clear View LCD monitorA first for any EOS, the EOS 60D features a bright, high resolution, flip-out Vari-angle 3.0-inch Clear View LCD monitor for shooting at a variety of angles. By easily switching between low and high angles, the EOS 60D freely enables angle adjustments even if the camera is mounted on a tripod or has a battery grip attached.With 1,040,000 (dots/VGA) pixels for spectacular detail, the advanced, smudge-resistant monitor includes high transparency materials plus anti-reflective and water-repellant coatings to provide clear and bright viewing. Superb for reviewing, editing and deleting photos or composing new images in Live View function, the Vari-angle Clear View LCD monitor is also the perfect means for accessing camera settings like ISO, metering modes, AF Point selection, the horizontal Electronic Level and flash options.5.3fps continuous shooting up to approx. 58 Large/JPEGs and 16 RAWThe EOS 60D operates with such effortless speed that operation is nothing short of intuitive. With a 0.1 second start-up time, speedy autofocus and minimal shutter lag, the EOS 60D is made to capture even rapidly-occurring scenes with stunning precision. Able to shoot up to 5.3 frames per second (fps), capturing a maximum burst of approximately 58 Large/JPEGs and 16 RAW, the EOS 60D DSLR lets you catch even the briefest of moments, whether it's a faced-paced soccer game or the flicker of a candle flame.96% viewfinder coverage allowing you to see more of your image in the viewfinderThe EOS 60D features a phenomenally redesigned viewfinder that not only offers an improved 96% coverage, 0.95x magnification, a 27.0&deg; angle of view and user-controlled dioptric adjustment, it also features a newly designed transparent LCD display that enables a number of viewfinder displays. A six-level battery check indicator has been added on the left, and the exposure level indicator scale has been expanded to up to three stops, with arrows indicating greater exposure levels.The 60D's Electronic Level.The EOS 60D also features an advanced horizontal Electronic Level, that, when activated, is superimposed on the LCD monitor to aid in achieving evenly leveled shots by indicating the horizontal tilt up to approximately 9&deg; in 1&deg; increments.Enhanced iFCL 63-zone, Dual-layer metering system; and 9-point AF systemThe EOS 60D features a sophisticated, 63-zone Dual-layer sensor designed to complement the 9-point AF system. By taking into account the color and luminosity surrounding chosen AF points, this system delivers an advanced level of accuracy for better results even in difficult lighting situations. Since the metering sensor has a color measurement function, exposure errors and focus errors caused by different light sources are minimized; the EOS 60D gives stable exposure from shot to shot in situations where light changes, such as in a theater or concert hall.  This makes the EOS 60D ideal for scenes with extreme difference in brightness such as brightly lit scenes or backlit scenes; the camera balances exposure of the main subject at the background, and exposures are not overly influenced by bright areas in the shot.Since the EOS 60D provides high-speed X-sync (\"X-sync\" means the fastest shutter speed that can synchronize with a flash burst at the moment the shutter is fully released) up to 1/250 sec., the range of photographic expression is dramatically increased, allowing the EOS 60D to be used with confidence in bright scenes or dim.Metering zones.Convert RAW images into JPEGs in-camera and set the images to a 3:2 aspect ratioThe EOS 60D marks a highpoint in convenience for the photographer by being able to shoot an image as a RAW file and then process it entirely in-camera to produce a separate JPEG file without the need of an outside computer. The EOS 60D gives you 10 process variables--brightness adjustment, white balance, Picture Style, Auto Lighting Optimizer, noise reduction, JPEG image-recording quality, color space, lens peripheral illumination correction, distortion correction and chromatic aberrations correction--to create the image you envision, set to the 3:2 aspect ratio used in 35mm film.Additionally, once you capture an image with the EOS 60D, you can digitally manipulate it in-camera with a number of creative filters for artistic and dramatic effect. Options include Soft Focus Effect to convey dreamy tableaus; Grainy Black-and-White Effect for a gritty, hard-bitten look; Toy Camera Effect--the deliberate vignetting and color shift technique popular in art photography--and Miniature Effect, which blurs the top and bottom edges of the image to emphasize perspective and conveys a miniaturized look of the scene.Compatibility with SD/SDHC/SDXC memory cardsThe EOS 60D DSLR uses popular SD, SDHC and SDXC memory cards. Compact, inexpensive and available in increasingly large capacities, SD, SDHC and SDXC memory cards are a perfect complement to the EOS 60D DSLR's compact and lightweight body design.Compatible with the full line of Canon EF and EF-S lensesThe EOS 60D is compatible with all Canon lenses in the EF and EF-S lineup, ranging from ultra-wide angle to super telephoto lenses. Canon lenses employ advanced optical expertise and micron-precision engineering to deliver unprecedented performance in all facets of the photographic process. Special optical technologies, such as aspherical, ultra-low dispersion, or fluorite elements are featured in the universally acclaimed L-series lenses. And Canon's Optical Image Stabilizer technology is featured in select lenses to minimize the effect of camera shake. Additionally, photographers can use for video the same lenses they do for still photography; Canon wide-angle, macro, super-telephoto, tilt-shift and fisheye lenses provide a wealth of focal lengths, depth-of-field and other creative shooting options once reserved for stills. Through Canon lenses, photographers can truly maximize the quality and liberating performance of the EOS 60D.Flash PhotographyWith a flash sync speed of 1/250 of a second, the EOS 60D also features the acclaimed E-TTL II flash metering system. With any of the flashes in the EX Speedlite line (sold separately), E-TTL II provides reliable flash output whether shooting fill-in flash pictures in sunlight, or using flash in total darkness. With E-TTL II, the exact same 35-zone metering sensor used for measuring ambient light is also used for flash metering--giving even finer metering command of the image area. If you prefer a broader area for flash metering, there's a menu setting to change to \"Average\" flash metering--where the entire 35-zone area is measured evenly for flash exposure. Additionally, the EOS 60D has a Speedlite transmitter built-in for convenient, full-featured wireless control of EX-series Speedlite flashes set as slave units.The Canon Speedlite 430EX II is the ideal step-up accessory for powerful flash shooting with the EOS 60D. It has excellent flash power (maximum guide number of 141 ft./43m at ISO 100), and is the perfect way to get great flash pictures when you can't get right up to the subject. The 430EX II is also great for bounce flash, with its tilting and swiveling flash head.  It automatically zooms the flash head to cover lenses ranging from 16mm up to 105mm or longer with the EOS 60D. Of course, it works with the camera to provide full E-TTL II automatic flash exposure. And the 430EX II has a powerful AF-assist beam, which allows the camera to autofocus even in total darkness on subjects as far as 32 ft. from the camera.Included SoftwareCanon EOS Digital Solution Disk (Version 23.0)The EOS 60D comes bundled with an updated Canon EOS Digital Solution Disk, which features powerful software programs designed to extend the EOS experience to the computer. These include Canon's EOS Utility (Version 2.9.0), Digital Photo Professional (Version 3.9.1), ZoomBrowser EX for Windows&reg; (Version 6.6.0), ImageBrowser for Macintosh&reg; OS X (Version 6.6.0), the Picture Style Editor (Version 1.8.0), PhotoStitch (Version W: 3.1.22/M: 3.4.4), WFT Utility (version 3.5.1), Memory Card Utility (Version 1.4), WFT Utility (Version 3.5.1), Original Data Security Tools (Version 1.9.0). Each application is designed to perfect the captured images and streamline the digital workflow.EOS Utility (Version 2.9.0) for Macintosh or Windowshandles the connection between the camera and computer, whenever they're connected via USB. It allows remote controlled shooting from the computer, handles downloading of images from the camera to the computer, and allows seamless linking to either Canon's ZoomBrowser/ImageBrowser or Digital Photo Professional software once images have been copied to the hard drive. Furthermore, it's used to upload settings back into a USB-connected camera.Digital Photo Professional (Version 3.9.1)is an image processing program that enables high-speed RAW image processing, high-speed previewing for real-time image adjustment and support for sRGB, Adobe RGB and Wide Gamut RGB color spaces. Because it's CMS (Color Management System) compatible, Digital Photo Professional allows for easy image layout and printing in Adobe RGB in conjunction with Easy-PhotoPrint and PictBridge printers. It also features the Dust Delete Data Detection tool for cleaner images.ZoomBrowser EX (Version 6.6.0) for Windows and ImageBrowser (Version 6.6.0) for Mac OS Xare the easy, user-friendly options for viewing and editing of JPEG and even RAW image files. Both allow viewing of numerous types of images including finished TIFF and BMP files. Both also have a variety of search options for finding images, allow re-naming of single images or batches of files, and offer a variety of options for printing without using a separate image-editing program.Picture Style Editor (Version 1.8.0)Canon's Picture Style Editor enables photographers to create custom Picture Style profiles that can be used to customize the appearance of JPEG and RAW images captured with EOS Digital SLR cameras. Picture Style files created with Picture Style Editor can be loaded into the EOS cameras that support Picture Style and may also be used when processing RAW images in Canon software applications Digital Photo Professional, ZoomBrowser EX (for Windows) and ImageBrowser (for Mac).What's in the BoxEOS 60D BodyEF-S 18-135mm f/3.5-5.6 IS LensEyecup EbWide Strap EW-EOS 60DUSB Interface Cable IFC-130UStereo AV cable AVC-DC400STBattery Pack LP-E6Battery Charger LC-E6EOS Digital Solution Disk and Instruction Manuals \"Great Photography is Easy\" Booklet and \"Do More with Macro\" Booklet"}