{"asin": "B001BZ3PY6", "description": "Xbox 360 sets a new pace for digital entertainment. More than just a cutting-edge game system, Xbox 360 also integrates high-definition video, DVD movie playback, digital music, photos, and online connectivity into one sleek, small tower, and in the process puts true Next-Gen power right at your fingertips.Xbox 360, shown with wireless controller, is a sleek, customizable gaming and entertainment systemUnder the HoodXbox 360 is much smaller than its predecessor--it measures approximately 3.3 by 12.2 by 10.2 inches and weighs 7.7 lbs. It's powered by custom IBM PowerPC-based CPU with three symmetrical cores each running at 3.2 GHz. It also carries a custom ATI graphics processor loaded with 10 MB of embedded DRAM, 48-way parallel floating-point dynamically scheduled shader pipelines and Unified shader architecture. This is powerful enough to draw 500 million triangles per second. In other words, it makes for great looking games in standard TV definition, and even better thanks to built-in support for HDTV 1080i televisions. It also supports the widescreen 16:9 format.The unit has a 12x dual-layer DVD-ROM drive, which plays both the game media and progressive-scan DVD movies right out of the box. For game-save and media storage, users can choose between the detachable and upgradeable 60GB hard drive, or a separately sold 64MB flash Memory Unit. Along with storing files, the hard drive will make the Xbox 360 backward-compatible with part of the existing Xbox game library.Control your GameplayXbox 360 uses a refined button layout for its controllers. Back and Start buttons sit at the center of the controller and between them is a new Xbox Guide button, which instantly takes the user to the Xbox 360 user interface. From there, they can check for friends online, access personal digital content like photos and songs, and more. The black and white buttons of the first Xbox controllers have been replaced with new shoulder buttons placed above the left and right triggers. Xbox 360 can accommodate up to four wireless controllers and has three USB 2.0 slots to use for wired controllers or for streaming your digital media from digital cameras, MP3 players, and any Windows XP-based PC. Microsoft has also created a video-conferencing camera, sold separately, that will work with the system.Xbox 360 can manage your games, your online friends, and your personal digital libraryThe Media ExperienceAll Xbox 360 titles can be played in either standard or high-definition resolution in 16:9 widescreen, with anti-aliasing for smoother graphics. Game designers will be able to take advantage of the system's multi-channel surround sound. The Xbox 360's digital media allows users to supplement any game's music from tracks in their own personal library.Go LiveA built-in Ethernet port allows users to connect their system to a broadband connection for access to Xbox Live. The Xbox Live Silver Membership included with the console lets anyone create a Gamertag and gamer card to express your online identity, chat live with voice chat, and connect to the Xbox Live Marketplace to buy expansions, maps, and other digital items for your games. You can also update to aXbox Live Gold Membershipat anytime for even more benefits. The separately sold wireless adapter supports the common 802.11a, -b, and -g standards.What's in the Box?Xbox 360 console60GB detachable hard driveWireless controllerXbox Live headsetStandard AV cableEthernet cableDetachable faceplateXbox Live Silver membership", "price": 261.95, "imUrl": "http://ecx.images-amazon.com/images/I/41K2VDCPCNL._SY300_.jpg", "related": {"also_bought": ["B000PT18OS", "B003D3OOYY", "B000B6MLPU", "B000BPLCDI", "B0011ACZM4", "B003ZSP0WW", "B008U2XILI", "B007LQG9A6", "B00BU3ZLJQ", "B000UODATY", "B00273Z9WM"], "buy_after_viewing": ["B00D9EPI38", "B005YR1VP2", "B003O6JKLC", "B000PD0HQE"]}, "categories": [["Video Games", "Xbox 360", "Consoles"]]}