{"asin": "B000QCU9I0", "description": "This template creates an A+ review that contains an opening paragraph, followed by three columns that cotain a left column for logo and images, a center column for lists and features, and a right column for images that can be clicked through. The last part of the template is a paragraph for more text if necessary.Intro Paragraph (Need at least 250 characters here)A Mercenary's Rule: Everyone PaysMercenaries 2: World in Flamesis an explosive open-world action game set in a massive, highly reactive, war-torn world. When a power-hungry tyrant messes with Venezuela's oil supply he sparks an invasion that turns the country into a war zone. But for you, international crisis is all upside: You are a mercenary, and you profit from chaos. You are not a soldier. You don't have to play by anyone's rules. You have your own code: you will fulfill the terms of the contract, no matter what. If you see it, you can buy it, steal it, or blow the living crap out of it. Play your own way, or play with the help of a friend in the new co-op multiplayer mode.  And remember rule #1 for mercenaries: EVERYBODY PAYS.Left ColumnLogo Image (Assumes a logo of 200ppx)Center ColumnKey FeaturesMassively Open World- Play throughout the varied terrains of Venezuela that is larger than all theMercenariesmaps combined.Work for the Highest Bidder- You decide which factions to work for and when. From oneoff pick-up jobs to complex multi-objective missions your choices will decide how the game progresses and which faction wins the war.New Toys- Over 130 vehicles from civilian cars to tanks and choppers plus all the destructive weaponry you can handle from pistols to rocket launchers.Co-op Multiplayer- Whether split-screen or online you no longer have to go it alone. Invite a friend to jump in and help you fight your way to the top.Next Gen Destruction- Take down any building and see them crumble with fantastic effects - and they can be used to take out enemy forces and change the landscape of the battlefield.Build Your Own Private Military Company- Recruit other mercenaries to build out your arsenal and options until you have the ultimate array of options to play with.Playable Water- Fly over it, swim through it, race across it in boats. No longer just something to look at, water is an active part of the game.Right ColumnImage 1Play by your own rulesView larger imageImage 2All the destruction you can handleView larger imageImage 3Build your own military companyView larger image", "price": 52.99, "imUrl": "http://ecx.images-amazon.com/images/I/61T9yraAKYL._SY300_.jpg", "related": {"also_bought": ["B00020BV0Q", "B00149ILCK", "B0014ULQB2", "B001ASJIRM", "B003P9C6QY", "B00020BV2E", "B002BRZ8BQ", "B000X25GX6", "B000G7YRHO", "B0013RATNM", "B000OCXK6A", "B000WSE2WM", "B000RHZ9JI", "B002DC8GEK", "B001CRQYBO", "B001GJ306U", "B00354NAYG", "B004EW7LSY", "B0016NRS8M", "B000FZZ5UA", "B000ZK698C", "B0050SY5BM", "B003Q53VZC", "B000O5DS32", "B007UM599I", "B000R0SS3Y", "B003VKLA6E", "B000O5FUQ0", "B003S2MXRA", "B001TOQ8J8", "B001UWGDC6", "B0065NP6NC", "B00309U0M6", "B00163LW7A", "B00KAEIS6O", "B000G7PMXC", "B000CQNWH0", "B0009S4UOA", "B0016B28Y8", "B00G6MW5CC", "B00BRQN2EM", "B0050SYV70", "B0009WPZM2", "B00EW47602", "B007XVTR3K", "B00IEYG1DO", "B001D25M1Q", "B001REZLY8", "B001NJ293I", "B001UWGBC8", "B001AWIP68", "B0050SYWVA", "B000C427NM", "B0076ZPYPI", "B002V16T0Q", "B0030EU3TG", "B000WEQL02", "B005C2D2MO", "B003GSZ9ZE", "B000FRVAD4", "B000ZK9QD2", "B00320JDWG", "B004QEV0MI", "B0050SYILE", "B004FUL9YW", "B002IGIW1I", "B002BSA1MQ", "B002I0K50U", "B002I0JA7E", "B000R0URCE", "B00CLF832E", "B000KGD1GO", "B000PE0HBS", "B00D7NQP9M", "B0058VI0SU", "B000088KH4", "B003DNH95K", "B00BMFIXT2", "B0028IBTL6", "B000ZKDOV2", "B003O6N2TI", "B000CEXDVW", "B002I0JGDM", "B0022TNO7S", "B003JVKHEQ", "B00020BV1A", "B005EZ5GQY", "B0043B5SLI", "B000X1PE16", "B001NX4DUQ", "B000ZJVDA2", "B0009SQFHA", "B002BSA20M", "B0050SWVIQ", "B004FYEZMQ", "B005FYK2PO", "B000X2TZY2", "B000XJO7A2", "B000TI836G", "B000B6ML1Y"], "bought_together": ["B00020BV0Q"], "buy_after_viewing": ["B0013RATNM", "B00020BV0Q", "B0050SYV70", "B00BMFIXT2"]}, "salesRank": {"Video Games": 3578}, "categories": [["Video Games", "Xbox 360", "Games"]]}