{"asin": "B000NK3H4S", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Even when the kids can&#x92;t sit still and the light is less than ideal, the amazing, the PowerShot A570 IS lets you capture life&#x92;s special moments -- perfectly. Optical Image Stabilizer Technology keeps images crisp even when you&#x92;re zoomed way in. The ISO 1600 and High ISO Auto settings reduce blur when the lights are down low. Plus, the A570 IS is packed with easy-to-use creative and convenient features you&#x92;ll love.PowerShot A570IS HighlightsDIGIC III Image ProcessorDIGIC III features Face Detection AF/AE, which finds multiple faces in the frame and sets the most suitable focus point, when the shutter button is pressed halfway. And an additional new feature, Face Detection FE adjusts the flash, based on a person&#x92;s face on the screen. Exposure and flash are controlled to ensure proper illumination of both the faces and the overall scene, eliminating the common problem of darkened or overexposed faces.Red-eye Correction detects and automatically corrects red-eye during playback for both regular and flash photography. In unusual cases where red-eye is not automatically detected, it can easily be corrected manually during playback mode from the LCD screen.iSAPS Technology is an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the fast DIGIC III Image Processor to improve focus speed and accuracy, as well as exposure and white balance.Clear, high-resolution 2.5-inch LCD for easy on-camera viewingThe camera&#x92;s 2.5-inch LCD screen gives you the big picture, whether you&#x92;re shooting, reviewing or showing off your images. This high-resolution screen offers a crisp, clear picture to make shooting, playback and using the camera&#x92;s menu functions especially convenient. Clear and bright, it also features Night Display for easy viewing in low light.ISO 1600 and High ISO AutoThe PowerShot A570 IS features new ISO 1600 and High ISO Auto settings that reduce the effects of camera shake and sharpen subjects in low-light situations, giving you greater flexibility for shooting.A variety of movie-making optionsWith a highly flexible movie mode, you can create the movie that&#x92;s perfect for any application. Select from VGA (640 x 480 pixels) and QVGA (320 x 240 pixels), with frame rates of 30 fps and 15 fps for recording up to 1 hour or 4GB. Also Fast Frame Rate (QVGA; 320 x 240 pixels) recording at 60 fps for up to 1 minute, and Compact Movie Mode (QQVGA; 160 x 120 pixels) recording at 15 fps for up to 3 minutes. The PowerShot A570 IS also supports the USB 2.0 Hi-Speed standard, so you&#x92;ll enjoy the fastest possible data transfer speeds when using a USB 2.0 Hi-Speed compatible computer.Shooting ModesAdvanced presets for the best possible photos under certain conditions.AutoThe camera chooses all the settings so you can concentrate on your subject.P ProgramAccess advanced exposure compensation features while shooting mostly automatically.Av Aperture-priorityYou define the aperture to either isolate your subject or have clarity throughout the entire picture, and the camera will choose the corresponding shutter speed.Tv Shutter-priorityYou select the shutter speed to stop or blur action, and the camera finds the appropriate aperture. With slow exposure times, Canon&#x92;s noise reduction system activates to ensure low image noise.ManualThe ultimate in creative control, you set ISO speed, exposure compensation and white balance.PortraitThe camera sets a large aperture, focusing the subject and artistically blurring the background to make your subject \"pop.\"LandscapeFor front to back sharpness, the camera sets a small aperture.Night SnapshotGet natural-looking pictures with brighter backgrounds and subjects lit by flash.IndoorReduce blur and improve color accuracy when shooting handheld indoors.Kids &amp; PetsReduced focusing time freezes fast-moving subjects, so you won&#x92;t miss those special shots.Stitch AssistBuild awe-inspiring panoramas by neatly aligning sequential images.MovieShoot in VGA and QVGA (30 fps/15 fps for up to 1 hour or 4GB), Fast Frame Rate (60 fps for up to 1 minute) or QQVGA (15 fps for up to 3 minutes).Special Scene ModesNight SceneFor impressive sunset or nightlife shots, the camera properly exposes the background and uses slow-sync flash for the subject.FoliageCapture brilliant shots of autumn foliage, greenery and blossoms.SnowShoot clear snow scenes without darkened subjects or an unnatural bluish tint.BeachGet clear shots of people at a sunny beach without darkened faces.FireworksGrab brilliant images of skyrocketing fireworks.AquariumAchieve proper flash-free exposure and natural hues at indoor aquariums.UnderwaterCapture underwater images with reduced backscatter effect.(Note: Optional Waterproof Case WP-DC12 required for shooting any underwater images)Get new batteries anywherePower on the go with two AA-size batteries. You don&#x92;t need to worry about running out or recharging batteries. Since AA-size batteries can be purchased at any store, simply get new ones locally.The complete print solutionPrint/Share Button for easy direct printing and downloading, plus ID Photo Print and Movie Print with Canon CP and Selphy Compact Photo Printers. The PowerShot A570 IS's Print/Share button makes direct printing easier than ever. Simply connect the A570 IS to a Canon CP, Selphy or PIXMA Photo Printer or any PictBridge compatible photo printer, press the lighted Print/Share button and print! Also use the Print/Share button to transfer images to a computer (Windows and Macintosh).Print your own ID photos in 28 different sizes or use the Movie Print function to output multiple stills from a recorded movie on a single sheet with a Canon Selphy Compact Photo Printer.For desktop large-format printing, try one of the Direct Photo Printers that allow you to print without a computer in one of two ways: plug your compatible PowerShot camera into the Direct Photo Printer using the supplied USB interface cable, or simply insert a memory card into the supplied adapter. You can also connect the printer to your computer for more options. Print high-resolution, borderless images as postcards or 8.5 x 11-inch sheets within minutes.Compact Photo Printers let you produce versatile, fun 4 x 6-inch postcards, 4 x 8-inch wide greeting cards or credit card size prints in just two easy steps: connect and press/print. Control the printer right from your camera's LCD screen. You get durable, dye-sublimated prints quickly with or without borders. Assortedpaper types let you create mini or credit card size labels. You can even take select Compact Photo Printers to a party or an outdoor picnic using an optional rechargeable battery.", "title": "Canon PowerShot A570IS 7.1MP Digital Camera with 4x Optical Image Stabilized Zoom", "price": 149.99, "salesRank": {"Camera &amp; Photo": 5863}, "imUrl": "http://ecx.images-amazon.com/images/I/51AzYFmmUyL._SX300_.jpg", "related": {"also_viewed": ["B0011ZCDKS", "B000NK3NBA", "B000EMU888", "B0032JRRXE", "B000EMU4HS", "B000HAOVC6", "B0075SUIEI", "B000AYJDD6", "B0012YA4YK", "B0075SUII4", "B000MFA1NE", "B004HW73S4", "B000HATNH4", "B004HW73SO", "B00AWYMXZY", "B0075T7NW2", "B001SER4BK", "B000V1VG2E", "B000NK8EWI", "B003ZSHNG8", "B0012YA6P2", "B000V1VG4W", "B000NK6J6Q", "B000ENPDSW", "B00EFILR6E", "B00908BQCY", "B0075SUIOS", "B0075SUITS", "B009B0MY6S", "B0035FZJKI", "B000EMWBV0", "B004J3V828", "B001EQ4C4E", "B004J3YCGM", "B004LB4SAM", "B004J3V8UU", "B000VY2KNK", "B00EFILPHA", "B00B5HE2UG", "B00I58LVKC", "B006UMM15O", "B009B0MZ1M", "B008HVZY1E", "B00728ZBA2", "B00908BMVE", "B0011ZK6ZM", "B0041RSPR8", "B00AWYMZE8", "B0090SLJ1C", "B0073HSIY8", "B001SEQPHO", "B000LXZKQK"], "buy_after_viewing": ["B00AWYMXZY", "B007JRB0SS", "B001NDIZA0", "B003VNKNEQ"]}}