{"asin": "B001ULD4L0", "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]], "description": "Whether you&rsquo;re in the market for a backup hard drive or simply want to expand your data storage capacity, the Fantom Drives Green Drive External Hard Drive is the perfect addition to your digital life.The Latest Advances in Power Saving TechnologyThe Green Drive External Hard Dive is like a curiously high-powered hybrid automobile. With only 40% of the power consumed by other drives, it saves you money on your monthly power bill.Intense Speed and FlexibilityAdditionally, no lead is used in any component of the GreenDrive, making it Restriction of Hazardous Substances Directive (ROHS) as well as California Electronic Waste Recycling Act compliant. As a matter of fact, even the soy-based inks used to print the box are .Why Use Fantom's GreenDrive?You don&rsquo;t have to choose between high performance and portability any longer. With both the high-speed e-SATA connection, boasting a maximum throughput of 300MB/sec, and the universal availability of USB 2.0, you have the best of both worlds.Reliable and Value-Added SolutionWith it's easy installation and convenient backup software, you will be confidently backing up your critical data within minutes! This unit features all the ruggedness and durability that you've come to expect from Fantom Drives complete with a 2-year limited warranty. The GreenDrive eSATA &amp; USB 2.0 is the perfect storage solution for any user with critical or valuable data - whether you want to store your DVD library, backup your music, photos, games or any personal or professional documents.Award-Winning Backup SoftwareNTI Shadow 4 with Ninja provides automatic backup and sharing of files to most any computer or attached storage device on your network. You can schedule backups in various intervals and even select a specific file type with Shadow 4 file filtering. NTI Shadow 4 features also include Ninja public and private partitioning and encryption on the same USB drive, version control allowing for multiple revisions of important documents and offers a 1-Click Quick Restore - returning you to the backup file location for simple drag and drop restoration.About The Manufacturer22 Years of Storage You Can Rely On- MicroNet/Fantom Drives' mission is to meet the demands of today&rsquo;s digital world by providing storage solutions with innovation, integrity and reliablility. Since its founding in 1988, MicroNet has sold its products exclusively through a select, global network of distributors, VARs and system integrators and have deployed over 21,000 systems to more than 52 countries. We have installed our systems in small and medium-sized enterprises as well as large global enterprises around the world. MicroNet/Fantom Drives' product line consists of external hard drives, RAID/NAS systems as well as the highly acclaimed GreenDrive series.What's Included?", "title": "Micronet Technology Fantom GreenDrive 2 TB USB 2.0/eSATA Desktop External Hard Drive GD2000EUS", "price": 129.99, "imUrl": "http://ecx.images-amazon.com/images/I/41zBm2x6PNL._SY300_.jpg", "brand": "Micronet", "related": {"also_bought": ["B000ENUCR4", "B000ENYXZ6", "B002G1YNRC", "B002VLYK0M", "B003MVZ60S", "B000N4QV4M", "B004NNYIVM", "B005BYWI78", "B002RL8IJK"], "bought_together": ["B000ENUCR4"], "buy_after_viewing": ["B003MVZ60S", "B000ENUCR4", "B002VLYK0M", "B000ENYXZ6"]}}