{"asin": "B00005AW1H", "description": "Amazon.com Product Description The Linksys wireless USB network adapter easily connects any PC orlaptop to your wireless network with no additional wiring. The plug-and-play USB adapter connects directly to any USB-ready PC, so you can share data, printers, or high-speed Internet access over your existing wireless network. This convenient yet powerful adapter offers data transfer rates of up to 11 Mpbs with a built-in antenna capable of connecting at distances of up to 1,500 feet.The wireless USB network adapter provides data security and reliability with its automatic fallback rate for data transfers and ensures secured networking with 128-bit WEP encryption capability.This adapter comes with a one-year limited warranty.See acomparison diagramof the different wireless technologies.Wireless networks are rapidly becoming more popular and coming down in price. Since they don't require cables, you can use the devices anywhere in an office or home, even out on the patio. There's no need to roll out an Ethernet network cable to each room of a house; you can network anywhere -- without wires. Outside of the home, wireless networking is available in hotspots at coffee shops, businesses, airports -- great when you're on the road and need to get some work done. For convenience, wireless networking is the answer.What Wireless Standard is Right for Me?Now that you've decided to create a wireless network, the next step is to figure out which wireless standard to use.Basically, a standard is a set of specifications for a device. All devices that follow a specific standard share operating characteristics, such as the radio frequency used and maximum data transfer speed.For wireless networking, there are three standards to choose from at this time:802.11b802.11a802.11gTo learn about the differences between the standards and select the right one for your network,click herefor an easy-to-understand chart.", "title": "Linksys WUSB11 Wireless-B USB Network Adapter v4", "price": 34.95, "imUrl": "http://ecx.images-amazon.com/images/I/417T83WREYL._SY300_.jpg", "related": {"also_viewed": ["B000ER5G6C", "B00009X6PH", "B0036OR924", "B0000CEPE8", "B005OIB6XI", "B0002HA7FY", "B0054YQOM0", "B008UQMMV6", "B0036R9XRU", "B004UAKCS6", "B004P8K2JW", "B000063WPA", "B007CO5DZ4", "B001F0R1CY", "B00E559NC2", "B000CRFI8A", "B001NLV4TQ", "B003CFAU0U", "B003KPBRRW", "B000FW60FW", "B007KTH73C", "B00DJUU0KS", "B00416Q5KI", "B006JWMOOI", "B004VRGRI2", "B00C7P40A2", "B0011E324K", "B000056SSM", "B00BFF47DU", "B0054YQO5C", "B007ZLGXA8", "B00HID6E98", "B004N625B4", "B00005ARK3", "B00004SB96", "B0000E658Q", "B003BDMK3S", "B002VX0GJY", "B00EDOG8NC", "B004T11M4E", "B001CN9K6E", "B004RU8RM2", "B003CFATRE", "B000J3ZZ4Y", "B005N6XBDO", "B00A7NYY8O", "B003VSTDFG", "B00FRMAOIO", "B0058DN1Q4", "B00AKXOVG6", "B004VDR37K", "B004QS4OF4", "B00FS5M4ME", "B00AVSRLTO", "B0045HG53K", "B003CFATR4", "B008140GOC", "B000QSN3O6"], "bought_together": ["B000I1GZEQ"], "buy_after_viewing": ["B000ER5G6C", "B00009X6PH", "B00416Q5KI", "B00E559NC2"]}, "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Network Adapters", "USB Network Adapters"]]}