{"asin": "B0051PMWY6", "related": {"also_bought": ["B001F1ZRAQ", "B00066Z9XG", "B00AZKNYX0", "B000023VW2", "B003XL3BQI", "B0010O748Q", "B006QF3TW4", "B006P4TH9U", "B000GCRWCG", "B00LVDZDXY", "B001QC78YM", "B0014T7W8Y", "B001PNNXGO", "B003A21DQA", "B00HX2AP9O", "B00ASP3YZK", "B001BCNTHC", "0615680682", "B00FEL0JOW", "061572096X", "B004RZHU8E", "0615687466", "B007KAX77G", "0061733199", "B0073H1UQQ", "B001BKS3Z2", "B0026OOS60", "B005IDQW3S", "B001AXLUX2", "B0043X2N50", "B0000DC4EL", "B00199NUJY", "161871001X", "B008CL24SA", "0942364058"], "bought_together": ["B001F1ZRAQ", "B00066Z9XG"], "buy_after_viewing": ["B001F1ZRAQ", "B00066Z9XG", "B00HMREOLK", "B000023VW2"]}, "title": "Kaito Voyager Pro KA600 Digital Solar/Dynamo AM/FM/LW/SW &amp; NOAA Weather Emergency Radio with Alert &amp; RDS, Silver", "price": 71.87, "salesRank": {"Electronics": 12771}, "imUrl": "http://ecx.images-amazon.com/images/I/519vL5sex9L._SX300_.jpg", "brand": "Kaito", "categories": [["Electronics", "Portable Audio & Video", "Radios", "Weather Radios"]], "description": "Radio Data System, or RDS, is a communications protocol standard for embedding amounts of digital information in conventional FM radio broadcasts. RDS standardizes several types of information transmitted, including time, station identification and program information. Connected to the Emergency Alert System (EAS) through NWR (National Weather Radio) network provided by NOAA (National Oceanic and Atmospheric Association), this feature will automatically activate the radio to inform you of any hazardous weather conditions or warnings including natural, environmental and public safety while the radio is set at the \"Alert\" mode.The newest and most advanced model from Kaito's Voyager radio family, the KA600 Voyager Pro is designed for both everyday use and emergency preparedness applications. It offers different methods to power up including optional AC/DC adapter, three AA batteries (not included), the built in rechargeable Ni MH battery that can be charged by the AC adapter, hand cranking or a computer, and the patented flip up 180 degree adjustable solar panel provides power for the radio even when no battery is installed. With its revolutionary design and versatile functions, it's not only an ideal choice of a bedside radio but also an indispensable tool for emergency preparedness purposes, travelling, camping, backpacking and other outdoor activities. Specifications: FM: 88   108 MHz AM (MW): 520  1710 KHz LW (longwave): 150   521 KHz SW (shortwave): 2,300 23,000 KHz NOAA Weather: 1   7 Internal speaker: Diameter 66 mm Headset jack socket: 3.5 mm Sensitivity: FM &#x2264; 10uV MW &#x2264; 1mV/m SW &#x2264; 30uV Rechargeable batteries: 3 Ni MH batteries 600mAh Dimensions: 9 &#xBD; x 5 &#xBD; x 2 &#xBD; inches Weight: 1 pounds Accessories: User manual Earphones Warranty card"}