{"asin": "B00006Z7HR", "description": "What's creepier than a sinister clown? Nothing, as it turns out, which is probably why the makers ofDark Cloud 2made their evil villain a member of the circus family. After all, a clown who lifts the town's friendly mayor off his feet--with a strangle hold--is not to be messed with.Welcome to the world ofDark Cloud 2. Stylistically, it resembles a Holly Hobbie Colorforms set. All the characters are of childlike proportions, and the village's Tudor buildings seem pried from a Yorkshire hamlet. While Maximillian, the preteen hero, wanders around his hometown, Parisian accordion MIDI music serenades him. Though this is not a kid's game (it carries a Teen ESRB rating), gamers who are put off by kitschy/cute nuances should beware--this game is loaded with them.But at its heart,Dark Cloud 2is a wonderfully solid RPG. Its story has three main elements: Max's lost mother, the secret of what's going on outside the village, and why the evil clown wants Max's red stone pendant. Fighting takes place in real time, unlike the turn-based fighting in the similarFinal Fantasyseries. This was a good decision on behalf of the designers, as was the attention to weapon customizing. And if you love to manage inventory (there aren't many RPG fans that don't), this is your game. Not only can Max's weapons be upgraded, but by taking pictures and tinkering, he can create tools from scratch, in seemingly endless variations.There's so much more to this game than can be described in any review. Along the way, for example, Max meets up with Monica, a princess from the future. He may build a village using the Georama system, or he may just want to do a little fishing--to say more would be to spoil the fun, but you get the idea. You'll just have to discover it all--and there is a tremendously rich world here--on your own.--Jennifer BuckendorffPros:Multi-layered world with strong replayabilityIntuitive game controlsStrong inventory management and interesting itemsGreat, playful aspects, like Steve the \"ridepod\"Cons:Painfully slow, almost hour-long introductionSome repetitiveness in weapon upgrading and dungeon mapsHokey gestures and dialogue", "price": 181.93, "imUrl": "http://ecx.images-amazon.com/images/I/61V972CCQRL._SY300_.jpg", "related": {"also_bought": ["B00004ZDFY", "B000G77X34", "0761542639", "B0009A4EV2", "B00005BW7Q", "B0002GTFIK", "B0009A4EVM", "B00006B5T8", "B0002CHJAA", "B000066TS5", "B0009A4EUI", "B00008O0YD", "0761530738", "B00005TNI6", "B000TLU67W", "B000G7X5P4", "B00004YRQA", "B00029QQNY", "B00006LEMK", "B000F5IH2I", "B00005MANB", "B000784XG2", "B000R2YWEQ", "B00007KQC1", "B001C6GVI6", "B000G82R20", "B000AVBFU8", "B000G7X5MM", "B00024W1U6", "9629971372", "B000BKSGH8", "B00008KTRS", "B00005Q8IR", "B000IONGU4", "B00007KUUD", "B000DZTRHE", "B00008W2R8", "B0014CN2H6", "B000094M46", "B00004YRQ9", "B0002SQ0AY", "B00005T7ZP", "B00005NYZ7", "B00008URUA", "B00006LEM8", "B0009XBWY6", "B00005T7ZN", "B00004TC6E", "B0000AHOOH", "B0009A4ETY", "B0000296O5", "B00006C28X", "B00009MVJ7", "B000E5N4RW", "B000FPGZUE", "B000CC5CHW", "B00004Y57G", "B00KVRK39A", "B00009YEJY", "B001MW91IW", "B000TYQL1O", "B000F8O1C0", "B00019HNNC", "B00GV4V8XC", "B0001VNNE8", "B001G3B0HC", "B000NGQ26C", "B000784XEE", "B000066TS3", "B00004U5VK", "B001QTW2GY", "B0000CDZBC", "B00002SVWG", "B0001A86EG", "B00004S9AF", "B000034DBS", "B0000C7GHG", "B00J6DLPLK", "B0000A8VBZ", "B00KBD4SJA", "B00006FDLM", "B00K6ZNX3K", "B001UIG6M2", "B000LOAQNQ", "B00004WYR7", "B00005MA97", "B0009I6S0O", "B00005NH6G", "B00005UNWC", "B00009WAVI", "0744005833", "B0007CGBDG", "B00000JRSB", "B00004U5VI", "B000FUG5TK", "B001CRQY1E", "B0000A09EM", "B0032GTMEE", "B002I0J4AM", "B000CSUKY6"], "bought_together": ["B00004ZDFY", "B0009A4EVM"], "buy_after_viewing": ["B00004ZDFY", "B0009A4EV2", "B000F5IH2I", "B000G77X34"]}, "salesRank": {"Video Games": 3198}, "categories": [["Video Games", "More Systems", "PlayStation 2", "Games"]]}