{"asin": "B000IZWNLG", "description": "The incredible Sony Playstation 3 combines multiple state-of-the-art technologies, for unrivaled gaming and entertainment. It accepts Blu-Ray discs, the new medium that stores up to 54GB -- delivering entertainment content in full high-definition (HD) quality. It also supports high quality display in resolution of 1080p as standard -- a far superior picture compared to 720p & 1080i. The advanced Cell processor, RSX graphics processor and high-definition picture quality means graphics you've only ever imagined become possible: Character movement is far more realistic, landscapes are rendered in real-time and expansive, cinematic storylines seem more real than ever. New online features and the simple Cross Media Bar tool make it simple to manage your digital media: Play games, watch movies and download new content more simply than ever. The PS3 is an overwhelming home entertainment experience -- the most advanced ideas in home entertainment, all in one console.   20GB 2.5 Serial ATA hard drive    Supports Blu-ray Discs, plus a wide variety of DVD and CD formats   HDMI output    4 USB 2.0 ports    Gigabit ethernet port -- 10BASE-T, 100BASE-TX, 1000BASE-T    Bluetooth 2.0 (EDR) support for up to 7 simultaneous controllers    A/V output -  480i, 480p, 720p, 1080i, 1080p   Sound -  Dolby 5.1 ch, DTS   Controls up to 7 wireless Bluetooth controllers    Backwards compatible with Playstation and PS2 games    Includes one wireless controller    Dimensions -  3.9   12.8   10.8 (9.8   32.5   27.4 cm)   Weight -  Approx. 11 lbs. (5 kg)", "price": 229.88, "imUrl": "http://ecx.images-amazon.com/images/I/31xCIjsrdJL._SY300_.jpg", "related": {"also_bought": ["B0009VXAM0", "B003O6E3C8", "B002I0F5M8", "B000R0PLK2", "B001DNGCN2", "B007A7UJ4S", "B000PD0HQE", "B002ISCORE", "B004HYK956", "B005UI9BT8", "B000XGJH1O", "B008SBZD5U", "B000FQ2DTA", "B00FC7JIAO", "B0045U01OG", "B00D9IM0B2", "B008CP6MA2", "B002GJRQSC", "B00009WAUD", "B00897Z240", "B0015AARJI", "B002TK1Q6Q", "B008277M36", "B003RRTXLA", "B000066TS5", "B003WY86L6", "B004HVKA9O", "B004HYK8Y8", "B000TVT7U4", "B008MO6B1S", "B002AB7TX8", "B001C6GVI6", "B008E6ZXTA", "B001ENPDJA", "B00DS0MQUQ", "B007CM0K86"], "buy_after_viewing": ["B0009VXAM0", "B000XGJH1O", "B00E369SDM", "B001COU9I6"]}, "salesRank": {"Video Games": 15893}, "categories": [["Video Games", "PlayStation 3", "Accessories"], ["Video Games", "PlayStation 3", "Consoles"]]}