{"asin": "B001U02JZ8", "description": "The ASUS Slim SDRW-08D1S-U is the perfect companion for your Eee family products or other mini-notebooks.The portable and stylish ASUS SDRW-08D1S-U lets you create and read CDs or DVDs with speed, style, and simplicity.Encased inside a slim and elegant diamond-cut design with a shimmering finish, the SDRW-08D1S-U is a joy to carry and pair up with your Eee PC.This slim external DVD re-writer utilizes high-speed USB 2.0 with the ability to record on 8X DVD+R, 8X DVD+RW, 6X DVD-R, 5X DVD-RAM, and access 8X DVD-ROM and 5X DVD-RAM formats. The SDRW-08D1S-U does this by powering the unit through the USB ports so you don't have to carry any big and bulky power adapters, or hunt around for open power outlets.Additionally, it includes user-friendly burning software by Cyberlink. From backing up your songs to encrypting your secret data, it can all be done quickly with the easy to use ASUS Slim SDRW-08D1S-U.The data encryption feature in the provided software gives you a reassured peace of mind by protecting your most sensitive material with secure password protection. It also has the ability to hide file names from unwanted onlookers.Featuring the ASUS Turbo Engine, you can burn DVDs of your favorite movies, a mixed CD with the latest hits, or anything you want with time to spare.The ASUS SDRW-08D1S-U encompasses a wide variety of high-grade features that easily makes it a must-have component for anyone looking to create CDs and DVDs on-the-go or at home.Key FeaturesPortable slim DVD Re-Writer designed to match your Eee family products or mini-notebooksRecord onto DVD-R (SL/DL), DVD+R (SL/DL), CD-R/CD-RW, DVD-RW and DVD-RAM quicklyPowered and connected by high-speed USB 2.0 ports for universal compatibility and convenienceDrag-and-drop software makes recording data simple and fastEncryption software included to help you backup sensitive documentsLearn MoreASUS Innovation and QualityASUS is the world leader in motherboards and graphics cards, and is the fastest growing of the top 10 notebook brands (currently number 5).*The ASUS product portfolio includes notebooks, Eee PCs, motherboards, graphics cards, and much more.In 2008 alone, ASUS products won 3,056 distinguished awards thanks to the innovative user-centric technologies and stylish elegant designs.The Perfect Companion for Your Eee PC (or any other mini-notebooks)The SDRW-08D1S-U is designed to be the perfect companion for your Eee family products or other mini-notebooks.With a compact and slim design, it is easy to carry, just like your Eee PC.Having the ASUS SDRW-08D1S-U alongside your Eee PC is like having a portable movie player.  You can watch your favorite DVD movie anywhere you go.Its glossy surface and diamond-cut design also gives it a radiant shine that is elegant.With the universal USB 2.0 connectivity, you can attach it to any computers that have two USB 2.0 ports and have it work right away.  No driver installation is necessary, it is as easy as plug-and-play.Think S.L.I.M.SimpleRecording data is simple with the SDRW-08D1S-U. Easily drag and drop media and files into the Cyberlink&rsquo;s thumbnail to create CDs and DVDs instantly.Low Power ConsumptionSave time while burning CDs and DVDs with low power consumption and high-speed data transfers via USB 2.0.ID DesignThe SDRW-08D1S-U stands out from the crowd with its elegant and eye catching diamond-cut design. It looks great with or without the included stand.MobilityThe ultra-slim design makes it easy to carry. The included stand can be easily taken off to allow for maximum portability. The ability to power via only USB ports also mean that there are no big and bulky power adapters to carry around, just the included USB cable will do the trick.Record onto a Wide Array of Optical MediaThe ASUS SDRW-08D1S-U is slim but powerful. It can read and write to almost all of the DVD and CD formats available.Max. 8X DVD-ROM(SL)(DL)/ DVD+R/DVD+RW - ReadMax. 8X DVD+R/ DVD+RW - WriteMax. 5X DVD-RAM &ndash; Read &amp; WriteFor a complete list of read and write capabilities, please see the specification section.WarrantyASUS 1 Year Limited WarrantyASUS SDRW-08D1S-U External Optical Disk Drive comes with 1 year limited warranty.Please visitSupport.ASUS.comfor more details on ASUS optical storage warranty policy.What's in the BoxASUS SDRW-08D1S-U Black DVD Re-WriterUSB 2.0 Y Cable (dual type A plug and one mini-B plug)Software DiskVertical StandQuick Installation GuideSpecificationsWrite Speed:DVD-R: 8XDVD-RW: 6XDVD+R: 8XDVD+RW: 8XDVD+R(DL): 6XDVD-R (DL): 6XCD-R: 24XCD-RW: 16XDVD-RAM: 5XRead Speed:DVD-R(Single): 8 X max.DVD-RW(single): 8 X max.DVD+R(Single): 8 X max.DVD+RW(single): 8 X max.DVD-R(DL): 6 X max.DVD+R(DL): 6 X max.DVD-ROM (Single): 8 X max.DVD-ROM (Dual): 8 X max.CD-ROM: 24 X max.CD-RW: 24 X max.CD-R: 24 X max.Access time:DVD: 160ms CD: 140msWriting Mode:DVD-R &amp; DVD-R(DL): DAO(Disc-At-Once)/Incremental Recording (Multi-Border Recording)DVD-RW &amp; DVD-RW (DL): DAO(Disc-At-Once)/Restricted Overwriting/Incremental Recording (Multi-Border Recording)DVD+R &amp; DVD+R (DL): Sequential Recording (Multi-Session Recording)DVD+RW &amp; DVD+RW (DL): Random RecordingCD-R/RW: DAO(Disc-At-Once)/TAO(Track-At-Once)/SAO(Session-At-Once)/Packet Recording (Multi-Session Recording)O/S Compatibility:Windows 2000, Windows NT, Windows XP, Windows VistaInterface:USB 2.0Data Buffer:2 MBBundled Software:CyberlinkDisc Diameters:12cm/8cmMTBF:60,000 Power On Hours, Operating Duty Cycle (Read) 10 % POH, Operating Duty Cycle (Write) 2 % POHMTTR:30 MinutesMounting Orientation:Vertical and Horizontal ( +5 &deg; ~ -5 &deg;)Humidity:Operating: 15% ~ 85% (Non-condensing). Storage: 10% ~ 90% (Non-condensing)Power Requirements:DC+5V &plusmn;5%,DC+12V &plusmn;10 %Vibration:Operating: 0.2 G peak (at 10~500 Hz). Storage: 1 G peak (at 10~500 Hz)Temperature:Operating: 32&deg; F to 104&deg; F.  Storage: -22&deg; F to 140&deg; FDimension(WxHxD):17.52 x 15.24 x 8.07 inchesNet Weight (estimated):0.91 lbs.All specifications are subject to change without notice.Color and bundled software versions are subject to change without notice.Brand and product names mentioned are trademarks of their respective companies.Product may not be exactly as shown in photos.* According to IDC's Q4 2008 Worldwide Portable PC Shipments data.Check Out Other ASUS Products that Makes a Great Pairing with the SDRW-08D1S-UEee PC 1008HA SeashellUltra mobile mini-notebook with a slim and stylish design, weighing less than 2.5lbs and up to 6 hour of battery life.Eee PC 1005HA-P Black&ldquo;Sleek Seashell design with up to 10.5 hours of battery life, the ultimate road warrior Eee PC with premium features loaded right in.ASUS Eee Top - BlackAn affordable touch screen PC that makes learning, work, and play easier than ever before, for users of all ages.Eee Box 202 Nettop PCSmall, LCD mountable and energy saving, Eee Box is the perfect machine for getting online.", "title": "ASUS USB 2.0 8xDVD Writer External Optical Drive SDRW-08D1S-U (Black)", "price": 34.24, "imUrl": "http://ecx.images-amazon.com/images/I/31of2%2BuXUFL._SX300_.jpg", "related": {"also_viewed": ["B006HUMYCO", "B003YT578O", "B00632SOD4", "B005KQ0S8S", "B007581HB6", "B00E3EAU4A", "B004W88SBE", "B009QBIZ60", "B001RKS7AC", "B00DBV28TG", "B00C2AMK2M", "B0018LO1R8", "B008AJLPYS", "B004ZMVQRA", "B00FQAE86Q", "B003M0NT1M", "B009ZMV0F8", "B009X0FQNY", "B004K2Z4MS", "B009MQTU9K", "9573212919", "B003N3BLAO", "B00BMAQV82", "B00IYAXBAO", "B003AVGN5M", "B0056UV96I", "B00AWRTXVS", "B009ZMV0RG", "B00FK412GC", "B004CFDJ2A", "B00BI4BRNQ", "B002782LTG", "B0027JPO6C", "B00AW5E9MI", "B00AN5WCCQ", "B009NRPKVU", "B00GD78R3Q", "B0051UY168", "B007581HIO", "B006DUJ9NA", "B002781HHI", "B00BD7UIGK", "B0032GU1LW", "B00741HKHO", "B001UDVUNW", "B00E6HG1XI", "9573212900", "B00DCGO5H8", "B0027UUAJ2", "B00A64SIXQ", "B007WLP0BY", "B002C1BBU8", "B00IEX9KNI", "B009XON646"], "buy_after_viewing": ["B006HUMYCO", "B003YT578O", "B00DBV28TG", "B00BWF5U0M"]}, "categories": [["Electronics", "Computers & Accessories", "External Components", "Optical Drives", "DVD Drives"]]}