{"asin": "B000066JQU", "categories": [["Electronics", "Computers & Accessories", "Routers"]], "description": "Amazon.com Product Description The versatile wireless Ethernet bridge from Linksys can make any wired Ethernet-equipped device a part of your wireless network. At home, use the wireless Ethernet bridge to connect game consoles, set-top boxes, or computers to your wireless network to share your high-speed network connection. In the office, convert your Ethernet-wired printer, scanner, camera, notebook, or desktop into a wireless networked device.It's completely driver-free, so it works on any platform and with any operating system. Because there are no drivers to load, setup is a snap--just plug it into your device and configure the network settings through your Web browser.You can also use the Linksys wireless Ethernet bridge as a kind of \"cableless cable\" to connect remote areas together. Maybe the Shipping department is all the way across the warehouse from Receiving. Or maybe you want to set up a home office in your detached garage. With a wireless Ethernet bridge in the garage and an other one (or a wireless access point) in the house, you're connected--without the hassle of cabling.See acomparison diagramof the different wireless technologies.Wireless networks are rapidly becoming more popular and coming down in price. Since they don't require cables, you can use the devices anywhere in an office or home, even out on the patio. There's no need to roll out an Ethernet network cable to each room of a house; you can network anywhere--without wires. Outside the home, wireless networking is available in hotspots at coffee shops, businesses, and airports--great when you're on the road and need to get some work done. For convenience, wireless networking is the answer.Which Wireless Standard Is Right for Me?Now that you've decided to create a wireless network, the next step is to figure out which wireless standard to use.Basically, a standard is a set of specifications for a device. All devices that follow a specific standard share operating characteristics, such as the radio frequency used and maximum data transfer speed.For wireless networking, there are three standards to choose from at this time:802.11b802.11a802.11gTo learn about the differences between the standards and select the right one for your network,click herefor an easy-to-understand chart.", "title": "Cisco-Linksys WET11 Wireless Ethernet Bridge", "price": 26.99, "salesRank": {"Electronics": 73878}, "imUrl": "http://ecx.images-amazon.com/images/I/31TWZQJ7GDL._SY300_.jpg", "related": {"also_viewed": ["B007CO5DZ4", "B003KPBRRW", "B008LTPFG6", "B0056VP0KS", "B004UAKCS6", "B00008WMBT", "B00BZQLBG0", "B005N6XBDO", "B001QVQ7JU", "B00FX38A56", "B005OIB6XI", "B006P191F8", "B0062K5JAI", "B005O88CY4", "B002K683V0", "B004FMI3DA", "B0001ZRLRE", "B00FRMAOIO", "B00009X6DT", "B0090DX8O8", "B001QVN2NE", "B005KN1YV6", "B003Z53K8Q", "B0002IHP58", "B00ATFFHEA", "B007PTCFFW", "B006WU2LCC", "B004RU8RM2", "B00A66WJWK", "B004ZMYMSK", "B008140GOC", "B000BNDEZY", "B00H4WMZ1O", "B00KLVDNB6", "B004UBU8IE", "B005WKIKA0", "B00GTFC7BA", "B00CZ3Z5HI", "B0010TEOLQ", "B0000AJVBW", "B00E9CEBZU", "B006DEBYWU", "B002YETVVE", "B004EI0F0O", "B007FN4D7Q", "B00020H1TG", "B005FDXMJS", "B00009PUM0", "B002YETVXC", "B00007KDVJ", "B008CV8ST4", "B003QQ0NIY", "B001769K3O", "B0014L4ZKK", "B00JFSOXTC", "B00BKFYIP2"], "buy_after_viewing": ["B007CO5DZ4", "B008LTPFG6", "B003KPBRRW", "B0056VP0KS"]}}