{"asin": "B0009F4OR6", "description": "Ready for remarkably thin and powerful performance from your portable music device? The Creative Zen Nano Plus 1 GB MP3 Player is the ticket. Incredibly thin and lightweight, it's packed with the latest features to meet all your needs. Enjoy amazing, skip-free audio quality when you're listening to your MP3 and WMA music.The Zen Nano Plus is incredibly thin and can store 500 songs on its 1 GB flash memory.View larger.The built in mic lets you record conversations.The LCD is built for left or right handed operation.The Nano Plus is much more than just a music player; it includes an FM tuner, voice/FM recording, and line-in encoding for direct connection and recording from any audio source. Use the Nano Plus to record music directly from your CD player, without a computer.Of course, if you do have a computer you can transfer audio and data files in seconds with \"drag-and-drop\" ease--and without software--using the player's USB 2.0 connection. Meanwhile, the Auto Synchronization feature makes it easy to transfer your favorite songs and albums from CDs through the line-in port. Battery life is outstanding, allowing you to listen to music for up to 18 hours on a single AAA battery. Now you can keep the tunes rolling all day long, and do it in style, as the Zen Nano plus comes in ten fun, vibrant colors. The 1 GB model's flash memory can store up to 500 songs (WMA-encoding, 64 kbps).The FM tuner lets you tune 32 stations. As mentioned, you can also record FM radio so you can catch your favorite tunes or talk shows later on. The built in microphone lets you record voice conversations -- great for those long lectures at school. You can also use the Nano Plus as a portable mini hard drive, allowing you to store data files such as photos and presentations. The unit's LCD is even reversible for left or right handed operation. Last but not least, the Zen Nano sports equalizer presets (Classical, Jazz, Pop, Rock) that make your music sound better.The Zen Nano Plus uses PlaysForSure technology. Look for the PlaysForSure logo if you're shopping for a portable music or video device and you want to make sure the digital music and video you purchase will play back on it every time. Match the PlaysForSure logo on a large selection of leading devices and online music stores. If you see the logo, you'll know your digital music will play for sure. Choose from a large number of digital music and video stores, including MTV's Urge, Rhapsody, Yahoo!, MSN Music, MusicMatch, MusicNow, Napster, Wal-Mart Music Downloads, and many more.What's in the BoxZen Nano Plus, high quality earphones, AAA battery, USB 2.0 cable, line-in cable, quick start booklet, installation CD and neck strap.", "title": "Creative Zen Nano Plus 1 GB MP3 Player (Black)", "price": 34.99, "imUrl": "http://ecx.images-amazon.com/images/I/41KYDXCP1CL._SY300_.jpg", "related": {"also_viewed": ["B002MAPT7U", "B0009R5KMM", "B00099I19O", "B000BP8AY2", "B00AF40U5G", "B005FVNGRS", "B002MAPRYU", "B00140DBRY", "B005FVNH04", "B002MAPS6W", "B00092M1QA", "B00BTLN5OC", "B00028Y826", "B009K6ULV8", "B00400TGEC", "B0097BEE9Q"], "buy_after_viewing": ["B002MAPT7U", "B002MAPS6W", "B0035P4BXO", "B0009R5KMM"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}