{"asin": "B0007G6RZE", "description": "If your digital photography demands blazing speed and durability from your memory media, SanDisk has the memory cards for you. SanDisk Extreme III CompactFlash media are designed for serious professional photographers who demand one of the fastest and most rugged memory cards on the market.*Based on SanDisk internal testing.Extreme III media are made to withstand brutal temperatures.Ships with advanced data recovery software.Many professionals work in less than ideal conditions, and that's why SanDisk Extreme III CompactFlash cards are built to perform in the most extreme environments and temperatures, from -13 to 185 degrees Fahrenheit. Extreme III media are rigorously temperature, shock, and vibration tested, something you'll definitely appreciate whenever you find yourself shooting and storing pictures in harsh environments, extreme temperatures or at high altitudes.Extreme III memory cards also feature SanDisk's exclusive and innovative Enhanced Super-Parallel Processing (ESP) Technology for the fastest speeds and highest performance. It means that you are getting the fastest read/write speeds available -- an amazing minimum 20MB per second sequential read and write speed.Every SanDisk Extreme III CompactFlash card comes with RescuePRO so you can recover images, documents, mail, video, music -- just about any digital file, with ease. Built with leading-edge media recovery algorithms, RescuePro lets you preview recoverable data before you try to retrieve it. With RescuePRO's unique recovery algorithm for MPEG audio and MPEG video recovery (MPEG-1/2/3) what you see, and what you hear, is what you can recover.For owners of SanDisk Extreme products, SanDisk maintains a dedicated, priority technical support hotline, and you get a lifetime limited warranty. Extreme III media also ships with a travel case that keeps your memory cards organized.What's in the Box2 GB CompactFlash card, travel case, and RescuePro data recovery software mini-CD.", "title": "SanDisk SDCFX3-2048-901 2 GB Extreme III CompactFlash Card (Retail Package)", "price": 29.65, "imUrl": "http://ecx.images-amazon.com/images/I/51182DSSMAL._SX300_.jpg", "related": {"also_viewed": ["B002N694A6", "B002NO7Q26", "B00065ANYW", "B004UC9HSA", "B0008D76L0", "B000VY2BC0", "B0001CNMFM", "B000T9251O", "B004FNJ8ME", "B00EKKM6MG", "B000E7WMOQ", "B0033ZDJ7A", "B0000CD0B7", "B000VY7HYM", "B000F2YHRA", "B002NO8PTY", "B000FKQ8LA", "B000HI93T4", "B00720TEYO", "B000W05O5O", "B002P370AI", "B00178PKVS", "B0015EXQW4", "B007NDL542", "B004FOZ700", "B0017QPV96", "B001NXDB4A", "B00ECEVE50", "B00ECEVEP0", "B002T84DQI", "B000I1ZWRW", "B001RUKFNE", "B001FO4QHI", "B00154GQS0", "B002NO7PWC", "B000NM6SWO", "B0093HGD2K", "B0013HIT0C", "B00065ANY2", "B0070JFGNU", "B002O3KVSC", "B000W0BC7I", "B001KQSP2S", "B000HI4VHI", "B0062EUE54", "B00009967Y", "B00ECEVFFO", "B0093HGDVG", "B008OZF9SQ", "B00065ANYC", "B0056TYRMW", "B007NDL56A", "B001B0HZQA"], "buy_after_viewing": ["B002N694A6", "B00065ANYW", "B002NO7Q26", "B004UC9HSA"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Memory Cards", "CompactFlash Cards"]]}