{"asin": "B00DPLQSA2", "description": "Partial compatible with:iPad 2 (Auto Sleep and Auto Wake Function Not for iPad 2)Material:Interior--- Lint interior is with soft touch feeling and the soft lint can safeguard and clean the screen.Exterior---synthetic PU leather with well wear resistant. You will don't worry about scratching or wearing out leather by accident.Custom-Made:This leather case is specially designed for iPad 3 iPad 4th. Leather frame wrap your device tightly and snugly. All buttons and ports like charging, earphone port, camera and speaker are exposed; you can enjoy your device any function without remove the caseDesign:Easy to carry---Slim and light case is easy to carry with your device in a bagVelcro flap---Extra Velcro flap design to further fasten device, make sure it will not fall outMagnetic closure---makes sure your lid closed well to protect your device against shake while in a backpack, handbag or briefcase2-view angle stand(Vertical and Horizontal)---you can enjoy your content hand free. You can hold your device at an ideal angle for watching or typing on the onscreen keyboard on a deskAuto sleep and wake up---making your device go to sleep once you close it, and instantly waking it up when you open it ready for use. Just close and open the lid, save more energy and protect the power button.Workmanship:Classic style will never out; functional design; Neat cut and complimentary stitch for exquisite workmanship; This is an absolutely economical protective case for you!", "title": "Kamor&reg; iPad 2 3 4 smart Case Cover - with Auto Sleep and Wake Up Function(Black)", "price": 5.99, "imUrl": "http://ecx.images-amazon.com/images/I/51%2BeOP4s13L._SY300_.jpg", "related": {"also_viewed": ["B007CKLCSK", "B007OAFLOY", "B00CE6QGLU", "B00B42K5BM", "B007PWI6N4", "B0076POAOE", "B00CE3IC74", "B00FS4AF0S", "B004N62I0C", "B0089VO7RY", "B00DRDZ07A", "B004R7A9NU", "B00HLENR44", "B008VIBE0I", "B00E0NRESE", "B007KPINM0", "B003X0BHOW", "B0079T722O", "B007C0Y8R2", "B007HBLX5G", "B007C0Y8PY", "B00KBOAO9M", "B008BW17JM", "B00F6K8R72", "B0091DF9CG", "B005E7KMH0", "B007B5ZR9G", "B00C4PFDBA", "B007PA1K84", "B009S2MWZM", "B0079TOI8K", "B00CZ6D248", "B007IS3EHS", "B0052V6VAU", "B0081LRO5Y", "B0076POAI0", "B00ESC2KS6", "B00B977B0U", "B00IPZPJWG", "B00ATM9T2O", "B004T0EQP2", "B009K2PPMC", "B0076POB8O", "B004TF3Q1W", "B0079TOGDW", "B005GRO0C6", "B007OWQ7TK", "B00GN6EKZG", "B008IGGCRI", "B00826FKRW", "B004S4AEFK", "B00ALIMNIS", "B007VAOF8U"], "bought_together": ["B008023XPO"], "buy_after_viewing": ["B008023XPO", "B0091DF9CG", "B005E7KMH0", "B007CKLCSK"]}, "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Cases & Sleeves", "Cases"]]}