{"asin": "B007PA1K84", "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Cases & Sleeves", "Cases"]], "description": "The Ridge folio case by Device wear for the New iPad is the whole package: It provides excellent protection for your New iPad with classic styling and features that are unparalleled. Designed to both look good and feel good, The Ridge's textured vegan leather exterior shields the New (2nd, 3rd, or 4th generation) iPad from bumps and bruises, while its soft micro suede interior cushions the screen from scratches. This slim case (adds only 7 mm of total thickness) provides excellent protection all around. The unique design allows for six varied viewing angles for optimum ease of use, and whereas other cases use the iPad itself to sit in the grooves to allow for multiple viewing angles, The Ridge has a small plastic lip or ridge that sits at the bottom of the iPad and slips firmly into the grooves to hold the iPad in place more securely. It is smart-enabled, utilizing the on/off function of the iPad, and the camera and ports are all easily accessible. With its sturdy construction and classic styling, The Ridge is the perfect fit for the New iPad. Device wear is a registered trademark of Device wear, LLC. If you buy from any other seller, you will most likely receive a counterfeit product.", "title": "Slim iPad case: The Ridge by Devicewear - Black Vegan Leather Magnetic iPad 2/3/4 Case with Six Position Flip Stand", "price": 27.67, "imUrl": "http://ecx.images-amazon.com/images/I/41DUtdhYvOL._SX300_.jpg", "brand": "Devicewear", "related": {"also_bought": ["B008UHKTCY", "B004WYA852", "B00AT4WOMO", "B0059KTEBC", "B004TLH7C0", "B008UHK3KM", "B004RDWVUS", "B00B7MR1P2", "B009W9APU0", "B009W8YQ6K", "B00176SY5O", "B009W9C4OK", "B00GQREFWA", "B00B3OA7R8", "B00IBDOB5I", "B00HVORET8", "B004M5KYGY", "B007IV7KRU", "B00G11D5JA", "B00A83I8G2", "B0013FRNKG", "B009SYZ8OC", "B00IWA1MNE", "B008MOHLVC", "B00CB7T52O", "B00ITCSL9I"], "bought_together": ["B008UHKTCY", "B0059KTEBC"], "buy_after_viewing": ["B0091DF9CG", "B00CB7T52O", "B00CZ6D248", "B004WYA852"]}}