{"asin": "B000U8HBRW", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "Manufacturer Description  The Canon HG10 AVCHD hard disk drive camcorder delivers high definition technology with the effortless ease of recording video directly onto a hard disk. Incorporating the latest AVCHD (Advanced Video Codec High Definition) format, it puts superb image reproduction and advanced features at your fingertips in a compact AVCHD Format HDD camcorder, which means you'll carry it everywhere you want to capture the special moments in your life in true HD.Among the Canon Exclusive features on the HG10 are Canon's own Full HD CMOS sensor and advanced DIGIC DV II image processor. More exclusives are SuperRange Optical Image Stabilization, Instant Auto Focus and our new 2.7-inch widescreen multi-angle vivid LCD. With the Genuine Canon 10x HD video zoom lens and a host of other advanced features, the HG10 is the right choice in HDD camcorders.Canon HG10 HighlightsAVCHD-format HDD in a compact sizeThe HG10 is Canon's first AVCHD (Advanced Video Codec High Definition) hard disk drive camcorder. AVCHD uses an MPEG-4 AVC/H.264 video codec, recording true 1080 high-definition resolution video. It allows you to capture more video onto a hard disk using less storage, for extended recording time. You can play the video directly from the camcorder on your HDTV, or easily download it onto your Windows XP or Vista system computer for playback, editing or sharing with friends and family. You can also burn video onto DVDs which play in AVCHD compatible Blu-ray disc players. Higher audio quality is also yours with the AVCHD format. All of this comes in a compact AVCHD format HDD camcorder, measuring only 3.2 inches wide, 3 inches high and 5.1 inches deep.Added to the HG10's handy size is the convenience of shooting high definition onto a hard disk. You'll never tape over a precious moment by accident, since the disk automatically searches for a blank space on which to record.Full HD on a 40GB hard disk driveThe HG10 captures 1920 x 1080 high-definition resolution video onto a 40GB hard disk drive. A convenient format for anyone who wants to transfer video to a computer for viewing, editing or sharing, it also makes your life easier as you never have to worry about not carrying around enough recording media with you as you shoot your future memories. In LP mode, you'll be able to record up to 15 hours of video. Even when shooting in super high quality mode, five-and-a-half hours of footage is yours without taking a break to change tapes or DVDs.HDD recording also delivers true random-access play, letting you get to the scene you select instantly.With the HG10's built-in HDMI (High-Definition Multimedia Interface) Terminal, it's easy to transfer the HD video signal to your HDTV. With a single cable, you'll send a pure digital signal, audio and video, to your television to get the ultimate HD viewing experience.1920 x 1080 full-HD CMOS sensorThe HG10 captures 1920x1080 HD video through its Canon-designed-and-manufactured CMOS image sensor, similar to the CMOS image sensors in Canon's EOS-series digital SLR cameras.Compared to a CCD, the HG10's CMOS's high color resolution and advanced color reproduction gives brilliant results. It is also unique in featuring Canon's proprietary noise reduction technologies for crisp, sharp images. Low noise technology also means that even in dimly lit scenes, the signal from each pixel is as pure as possible, with minimal noise or other aberrations. It's the ideal sensor for HD.The HG10 uses an RGB Primary Color Filter with Bayer Placement Pattern that separates light into red, green and blue color components. This results in vibrant images with deep, rich, accurate color and natural-looking tones similar to what you'd obtain from 3CCD camcorders. In addition, the Bayer Placement Pattern delivers sharp high definition images with true-to-life color reproduction. As an added benefit, the CMOS sensor provides outstanding image capture in low light conditions.Canon 10x HD video zoom lensThe HG10 comes with an outstanding high-definition video lens -- a 10x HD Genuine Canon zoom lens. It's the tool you need to record long shots of your child on the soccer field, wide shots of beautiful landscapes, and everything in-between. And because it comes with three pre-set zoom speeds, you always get smooth, steady, professional-looking zoom shots.Super Spectra Coating technology results in images with minimal flare and ghosting. Plus, the new lens' aspheric design reduces aberration and increases resolution, ensuring crisp, sharp video and enhancing the HD image quality. Not only that, but a new gradation neutral density (ND) system gives you better exposures in bright shooting situations.In addition, for those times when you need to get a particular shot from a very long distance, this flexible lens also has a 200x digital zoom.DIGIC DV IIDIGIC DV II is the next generation of Canon's exclusive DIGIC DV signal-processing technology. Designed specifically for HD, DIGIC DV II ensures optimal image quality. It also ensures optimal image quality for still images, even though video and still images have different color requirements. DIGIC DV II is just another one of Canon's advanced technologies that make the HG10 an exceptional performer.Thanks to DIGIC DV II image processing, the HG10 produces video with improved color reproduction -- especially in skin tones, and dark and light scenes. It also uses a hybrid noise reduction system that employs two types of noise reduction -- for high definition images that are crystal clear.Plus, DIGIC DV II features improved continuous shooting of digital photographs with the HG10. You can shoot five (3.1 Megapixel) still images per second, and enjoy faster processing of your images to your memory card (1.4x normal card; 2.5x Hi Speed card). It also helps lower power consumption for longer battery life.SuperRange Optical Image StabilizationThe high-resolution images of high-definition video demand a steady hand. It's easier to get those clear, steady images with the HG10, thanks to Canon's innovative SuperRange Optical Image Stabilization. It combines gyro- and image-sensors to give image stabilization through a wider range of camera motions. Some image stabilization systems correct one type of camera motion or vibration better than another. But Canon's SuperRange OIS corrects for a wide range of camcorder motion: the fast vibration you'd experience while recording from a moving car; the medium-speed motion of hand-held recording; and the slower motion of body sway. No matter what you're recording and how you're recording it, the HG10's stabilization design corrects camcorder shake instantly. SuperRange OIS also delivers steady images when shooting at long focal lengths.In addition, optical stabilization keeps your shot steady without a loss in image quality -- something that can't be said for electronic image stabilization. And image stabilization isn't just for video; you can even use it for taking sharper, clearer digital photographs with your HG10. Thanks to Canon's expertise, it's easy to eliminate one of the telltale signs of amateur video and photography.Instant AFAnother critical objective when shooting in HD is achieving a very sharp focus. The HG10 camcorder features Canon's revolutionary Instant AF focusing system which offers a dramatic improvement in auto focus speed and accuracy (compared to traditional auto focus systems). The Instant AF feature uses an external sensor, in combination with Canon's auto focus system, to help significantly decrease the time it takes to find focus, even in low light conditions. This system achieves focus instantaneously, reducing focus \"hunting.\" The benefits of Instant AF are especially seen in high brightness and night shooting situations. With Instant AF, it's possible to capture fast, accurate focusing, even when following a moving subject.24p Cinema Mode24p Cinema Mode enables all aspiring moviemakers to achieve a professional \"film-look.\" You can change the camcorder's frame rate to 24p, which provides the same frame rate as movie film. In addition, you can use the HG10's CINE setting, which changes the color and tonal characteristics, evoking the look and feel of a movie shown in a theater. For added flexibility, these settings can be used together or independently.HDD photo grab from videoAnother feature you will find only on the HG10 is the capability to capture still frame images onto a miniSD card from recorded video on the hard disk drive. None of Canon's competitors allow you to review your already shot footage to select just the right still to save and share. It's just one more way the HG10 gives you more flexibility to meet your creative desires.2.7-inch Multi-Angle Vivid Widescreen LCDThe 2.7-inch multi-angle vivid widescreen LCD on the HG10 lets you see more of what your camcorder is recording. Using a hard coat anti-reflective surface and improved color reproduction, the scene in the viewfinder is more accurate to what you're capturing in the camcorder. An added benefit is the wider range of viewing angles possible with this new LCD screen. With less glare and deeper contrasts, groups of people can gather around it and see the image displayed more clearly than ever before.Superb Shooting ControlNavigation Control dialThe HG10's direct-operation Navigation Control Dial makes it easy and convenient to operate. Located on the LCD control panel, it allows you to select the navigation buttons you want with a turn of the dial. Simply press the \"Set\" button on the LCD monitor and your choice is confirmed. You can also select footage for playback by using this button.Variable zoom speed controlAnother sure sign of amateur video is the unsteady zoom shot. But with the HG10's zoom control, you simply select one of three pre-set zoom speeds for smooth, steady, professional looking zooms.Focus Assist functionThe image quality of HD demands a properly focused subject. The Focus Assist feature on the HG10 gives you sharp focus by zooming into your image to let you focus on a close up of your subject. It's the way professional videographers and photographers work manually. A Peaking function also helps, by emphasizing image contours.Level and Grid MarkersWith the Level Marker feature, it's easy to keep your camera level for more professional looking video. Line up any horizontal lines in your shot -- such as the horizon -- to the marker and you can be sure your camcorder is level.The HG10's Grid Marker feature lets you compose your shot accurately, according to the grid in your viewfinder. You can even choose from two different colors for the grid. This ensures that you see the grid, no matter what the background color of your shot is.Program AE modeFor the best exposure for various situations, the HG10's Program AE mode will automatically adjust the settings to compensate for the conditions and subject. Choose from Portrait, Sports, Night, Snow, Beach, Sunset, Spotlight and Fireworks. You won't have to guess if you're capturing all the action just the way you want it because the HG10 will do it for you.Quick StartNever miss a quickly unfolding shot again. Push the Quick Start button between shots -- it places the HG10 in standby mode. When the action starts, push the Quick Start button again to begin recording in less than one second. You'll also help extend your battery life compared with leaving the camcorder in regular recording mode.Low-light performanceBy increasing the sensitivity of the HG10s HD CMOS sensor and using improved fixed-pattern \"noise\" reduction technology, you can now shoot clearer, sharper video at very low light levels. When taken with a 1/30 sec. slow shutter, subjects can be shot at light levels as low as just 3 lux. You won't be afraid to shoot indoors or in poorly lit outdoor locations again.Built-in electronic lens coverNever worry about a lost lens cover or one that gets in your way when shooting. The built-in electronic lens cover on the HG10 automatically opens when you turn the camcorder on and closes when you turn it off.Advanced accessory shoe terminalShoot video like the professionals do, with the accessories that give you the best in audio and lighting. The HG10's advanced accessory shoe provides the power for an accessory video light, video flash or directional stereo microphone- the things you need to bring your video to the next level.Microphone/headphone terminalEnhance the quality of your audio by using an accessory microphone to capture better sound and headphones to monitor the audio as you hear it. Your videos will sound as good as they look.Built-in Ultra Video LightSome of the most magical shots are taken at the end of the day or long after the sun has set. You won't miss any of them, thanks to the HG10's bright built-in Ultra Video Light. The light lets you shoot subjects in color in low light up to 4.9 feet away. So, whether it's a shot of a sleeping baby or a dramatic skyline at night, the HG10 captures all the moments you want to record.Long battery recording timeYou can truly take advantage of the long recording times offered by HDD video thanks to the long life of the HG10's bundled battery. Your actual recording time can be up to 70 minutes with the LCD used in the Normal brightness mode. Getting the shots you want, when you want them, will be easier than ever.Advanced Photo Features3.1-megapixel photosThe same Canon CMOS image sensor that ensures sharp, vivid HD video also gives you brilliant digital photographs. Like the CMOS image sensors in Canon's EOS Series digital SLR cameras, the HG10's image sensor results in outstanding digital photographs. It gives an impressive resolution of 1920 x 1440 for sharp, crisp still images.DIGIC DV IIThe DIGIC DV II features improved continuous shooting of digital photographs with the HG10. You can shoot five (3.1-megapixel) still images per second, and enjoy faster processing of your images to your memory card (1.4x normal card; 2.5x Hi Speed card).Focus featuresAuto Intelligent Auto Focus (AiAF) ensures sharp images and gives creative flexibility. Even when your subject isn't in the center of the frame, the HG10's 9-Point AiAF will automatically select from nine metering frames on the screen to help bring images into sharp focus.Since it is critical to achieve very sharp focus when shooting in HD, the HG10 camcorder features Canon's revolutionary Instant AF focusing system. It offers a dramatic improvement in auto focus speed and accuracy (compared to traditional auto focus systems). The Instant AF feature uses an external sensor, in combination with Canon's auto focus system, to help significantly decrease the time it takes to find focus, even in low light conditions. This new system achieves focus instantaneously, reducing focus \"hunting.\" The benefits of Instant AF are especially seen in high brightness, and night shooting situations. It's even possible to capture fast, accurate focusing, even when following a moving subject.And because a properly focused subject is more critical than ever with HD, the HG10 also features Focus Assist. This helps in capturing your subject in razor sharp focus. (When you start recording, this assistance is automatically cancelled.)Auto Exposure modesLike any good digital still camera, the HG10 lets you choose from a range of exposure modes. Auto mode automatically sets the exposure, letting you concentrate on your subject. AV (aperture priority) mode lets you control depth of field by letting you choose the aperture. TV (shutter priority) mode lets you select the shutter speed for sharp, action shots. In P (program) mode, the camcorder adjusts camera settings automatically.Program AE modeYour life happens everywhere, so the HG10 gives you settings that automatically result in the best exposure settings for different conditions and different subjects.Portrait mode ensures shallow depth of field for a pleasing background to your shots of friends and family. Sports mode stops the action with faster shutter speeds. Night mode is designed to give you great shots after the sun goes down. Snow and Beach modes compensate for bright surroundings and give you the proper exposure on your subject. Sunset mode results in vibrant, well-exposed colors for one of the toughest subjects to capture. Use Spotlight mode when your child is on stage and in the spotlight--literally--and you want to make sure the exposure is right for them. And Fireworks mode records brilliant images of another tough subject: the holiday fireworks display.Simultaneous photo recordingWith the HG10, you can record HD video and capture a 2-megapixel photo to a memory card--simultaneously. Simply press the photo button and you've got an email-ready digital photo to share with friends and family.Histogram DisplayFor the advanced digital photographer, the HG10 comes with a Histogram Display -- a feature found in Canon's line of digital SLR cameras. The display allows you to see the brightness information of your still images, so you can adjust your exposures as you shoot.Level and Grid MarkersWith the Level Marker feature, it's easy to keep your camera level for more professional-looking photographs. Line up any horizontal lines in your shot--such as the horizon--to the marker and you can be sure your camcorder is level.The HG10's Grid Marker feature lets you compose your shot accurately, according to the grid in your viewfinder. You can even choose from two different colors for the grid. This ensures that you see the grid, no matter what the background color of your shot is.Photo Grab from Hard DriveThe versatile HG10 even lets you capture a still image from an already recorded movie. While playing the movie in your camcorder, simply press the photo button to capture a 2.07-megapixel 16:9 still frame on a miniSD card. It's another way the HG10 lets you enjoy and share your precious memories.Built-in flashYour HG10's built-in flash lets you capture superb photos indoors and in low light conditions. The HG10 also features red-eye reduction.Share your photosPrint/Share turns your HG10 into a photo lab in the palm of your hand. Simply connect your camcorder directly to select Canon printers or any PictBridge-compatible printer with the supplied USB cable. Then, with a simple touch of the Print/Share button, print directly from your HG10 without going through a computer.Print/Share also makes it easy to transfer your still images to your computer. Simply connect your HG10 with your computer, press the Print/Share button and your photos are downloaded to your computer.The HG10 makes it easy to store digital photos on an optional miniSD Memory Card. Popularly used in today's newest cell phones and half the size of a standard SD card, the miniSD Card offers the benefit of high-capacity storage in a very small size.Corel Application discThe Canon HG10 camcorder is bundled with a powerful software suite from Corel. WinDVD SE lets you play back your recorded video on your computer. You can also easily perform AVCHD Editing in which you can trim, reorder, and combine scenes, as well as add music, titles, and transitions. With the Corel Application Disc, you can use DVD Moviewriter SE when finished to burn your edited video onto either a full size AVCHD DVD or Standard Definition DVD.*The bundled application is compatible with Windows XP and Windows Vista.", "title": "Canon HG10 AVCHD High Definition Camcorder with Optical Image Stabilizer", "brand": "Canon", "salesRank": {"Camera &amp; Photo": 8467}, "imUrl": "http://ecx.images-amazon.com/images/I/416Rwj0mngL._SX300_.jpg", "related": {"also_viewed": ["B001DTTCQA", "B00114PN1U", "B00114162K", "B004HW7E3I", "B001OI2YTC", "B0000507JI", "B001OI2Z2I", "B004HW7E7E", "B001OI2YZQ", "B00123XZNI", "B00AWZFJ22", "B006UMMP2I", "B00322OP54", "B001DTV95C", "B00AWZFHG0", "B00HLDFTRS", "B004HW7E6K", "B0031RGKZI", "B00AW54YWS", "B000MANFIC", "B00114LG7U", "B006K551HQ", "B006K55018", "B006YVMA5C", "B00AW54Z7C", "B000TRBD3M", "B001BET2YY", "B00HLDFSQK", "B00AR95FRM", "B004HW7E92", "B00HNJWWL6", "B000Q34PYS", "B006UMMP8C", "B00C3R14J4", "B001DABPPK", "B00AR95H0W", "B00AR95H7U", "B006K54ZX2", "B000TVSYMQ", "B00127Y984", "B004HW7E2O", "B004H8FN94", "B00AR95ENW", "B006K5507M", "B00006FXHQ", "B00AWZFIUU", "B00123WDR2", "B00AR95FP4"], "bought_together": ["B003VNKNF0"], "buy_after_viewing": ["B001DABPPK", "B0013TTHB0", "B002S81W9A", "B003VNKNF0"]}}