{"asin": "B00005OQMO", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The FinePix 2600 reaffirms Fuji's reputation for producing high-quality, affordable digital point-and-shoot cameras. Like its predecessors, the 2600 is compact, lightweight, fast, and fun to use.The 2600 is competing in one of the most crowded segments in the digital camera market. Virtually every manufacturer is now (as of November 2001) producing a 2-megapixel point-and-shoot with a 3x optical zoom lens, and it's no surprise: these cameras closely resemble their film counterparts in size, shape, and function, and the 1,600 by 1,200 images they capture contain enough detail for 8-by-10-inch prints, more or less matching the quality of most film point-and-shoot cameras.With so many models to choose from, why pick the 2600? For one thing, Fuji was unusually generous with the accessories. The camera comes with a 16 MB memory card (big enough for 39 pictures at default resolution), plus a set of rechargeable batteries and a charger. In addition, this camera is quicker than most of its competitors. When you turn it on, it's ready to use very quickly, and shutter lag and shot-to-shot performance are also surprising for a camera in its class. Battery life is also good, especially for a camera that uses only two AA batteries.Of course, not everything about the 2600 is perfect. Its body is made of plastic, and some of the buttons don't feel quite as durable as those on other cameras, though we had no problems with reliability during testing. The sliding clamshell lens cover is a nice touch, but, unlike other cameras, sliding the cover open and closed does not turn the camera on and off--there's a power switch on top for this purpose. As a result, we sometimes found ourselves closing the lens cover and forgetting to turn the camera off. In addition, the camera offers relatively few manual controls: white balance is adjustable, as is exposure compensation, and the flash has five modes, but shutter speed and aperture are both set automatically. The camera also includes a 20-second movie mode, but the movies lack audio. If you're the type of photographer who simply likes to turn the camera on, aim, zoom, and shoot, you'll be thrilled with the simplicity of the design, but if you want more control, this probably isn't the best choice for you.The FinePix 2600 Zoom is a great value, especially for photographers who love point-and-shoot simplicity. It's affordably priced, simple, and fun to use, includes rechargeable batteries and a charger, and produces crisp images.--Shane BurnettPros:Compact, lightweight, fast, and affordableSliding cover protects lensPackage includes batteries, charger, 16 MB cardMovie mode captures silent 20-second clipsSpeedy USB image transfersCons:Few settings can be adjusted by userTwo-step on-off procedure seems unnecessarily complicatedNo video-out connection for TV image viewing", "title": "Fujifilm FinePix 2600 2MP Digital Camera w/ 3x Optical Zoom", "price": 19.89, "salesRank": {"Camera &amp; Photo": 20289}, "imUrl": "http://ecx.images-amazon.com/images/I/412VN23DKYL._SX300_.jpg", "related": {"also_viewed": ["B0084292EG", "B008L24488", "B002KV30A4", "B00630J2CI", "B007Z36HWU", "B003E47FUM", "B00DJGQN8A", "B005EQBK3Q", "B001PK8FG0", "B003E47FT8", "B000P6R3DQ", "B008C3A1V0", "B00FVXVJEW", "B003VUZJ1Q", "B0025X1AKO", "B006ZAHOEO", "B00DRG0AF4", "B000087KY8", "B003VTZE1M", "B000RO3D4Y", "B00DJGQIB2", "B005PZ1BR6", "B002HEWA2S", "B008M9SQ48", "B003E47FVG", "B005F5HTMC", "B0000645C9", "B0007XY6QY", "B00JAONR70", "B004LODKYY"], "buy_after_viewing": ["B000QYCXX2", "B003NLHZKQ", "B003HMNO7Y"]}}