{"asin": "B0000DK3I4", "description": "Break from the limitations of traditional memory devices and put more storage at your fingertips with Kingston Technology&#x92;s Secure Digital (SD) memory cards. The latest in the Kingston family, SD memory cards combine massive storage capacity, blazing data transfer rates and ironclad security in a memory card no bigger than a postage stamp.SD memory cards from Kingston are built of nonvolatile memory components, meaning they keep the information stored on them without needing power. For added reliability and durability, our solidstate SD memory cards have no moving parts to wear out or break.Quickly and easily download and transfer secure digital files between various digital devices, a computer and the Internet. An SD memory card reader makes it easy to upload files from an SD memory card to a computer. The beauty of the SD memory card is its huge capacity in such a tiny package, making it an ideal expansion option for the smallest of devices. Kingston SD memory cards are compatible with:Digital audio players (MP3)Digital camerasPDAs and handheld computersCellular phones and smart phonesGlobal positioning systems (GPS)Data requiring a high level of security:Copyright protection (book, music)Personal identification data (cell phone address book)Intellectual property right protectionKingston SD memory cards represent a technological leap over MMC, including cryptographic security protection of proprietary data and a four-fold increase in data transfer rates. SD memory cards are slightly thicker than MMC, and most devices designed to accept SD memory cards are backwardcompatible to accept MMC as well. If you are unsure whether your device accepts both SD memory cards and MMC, consult your product&#x92;s user manual.FeaturesSmall- about the size of a postage stamp (24mm X 32mm X 2.1mm)Spacious- up to 512 MB of storage capacitySecure- built-in write-protect switch prevents accidental data lossFast- data transfer rate up to 2 Mbps (average)Flexible- compliant with the Secure Digital Music Initiative (SDMI) portable device requirementsReliable- lifetime warrantySimple- as easy as plug-and-playEconomical- low power consumption is easy on batteriesEfficient- average write speeds of 1.5 MB/sec.Supports Windows XP, 2000, 98, 95, NT; Macintosh OS and OS/2 Warp", "title": "Kingston 512 MB Secure Digital Card (SD/512) (Retail Package)", "price": 3.65, "imUrl": "http://ecx.images-amazon.com/images/I/41xmsWYsJ2L._SX300_.jpg", "related": {"also_viewed": ["B0014CC9G6", "B000FGNM6I"], "buy_after_viewing": ["B0014CC9G6", "B0000AKVJC", "B0000D8CMK", "B000P5AJXI"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Memory Cards", "SD & SDHC Cards"]]}