{"asin": "B007Q7HWF6", "related": {"also_viewed": ["B00BJ777IQ", "B00887IF0Y", "B00F3U2H80", "B009M7WAKU", "B00CMNX906", "B008DBI5RI", "B00CS1WDBI", "B00BPPQY8G", "B008DS1M58", "B00G1YTI4I", "B00805TJGS", "B00BKSYFCU", "B00CP4J7OY", "B00BU49P6K", "B00D4K8XIY", "B00BU49P7Y", "B00CXG0Z5Y", "B00AALKTR8", "B00CBOCSC6", "B00GZD6W30", "B009MA7XCC", "B00BU49PDI", "B00EQ9PTNY", "B004VJNRKG", "B00K0OBEE2", "B005XVCTAU", "B00GMUIKMM", "B00CUM9CNW", "B0050DWYT2", "B00K0S2J1A", "B00HCRI6O6", "B00FVHA50M", "B00EDAJPYK", "B00GTCKO90", "B008VXS6D6", "B00CMNX8ZW", "B007XVYN7U", "B009PLLG9O", "B00HAQ8IF6", "B00F0RB4CG", "B0082XEGUW", "B00E8SDQY2", "B00DHKGAAE", "B0072BKZOQ", "B006GII4JO", "B00ICCX2EE", "B00B8A43CC", "B00J8DL78O", "B00HWMPSJC", "B00C5W16B8"], "bought_together": ["B0082XEGUW"]}, "title": "VINCI Tab II 7&quot; Touch Learning Tablet with WiFi, Android 2.3", "price": 129.98, "salesRank": {"Toys & Games": 137289}, "imUrl": "http://ecx.images-amazon.com/images/I/41Vey%2BD93UL._SY300_.jpg", "brand": "VINCI", "categories": [["Toys & Games", "Electronics for Kids"]], "description": "The perfect gift for that special child &#x2013; VINCI Tab was created as a new category of fun learning tools for children, aged toddler to elementary. Combined with award winning VINCI Curriculum (sold separately), educational toys and books, VINCI provides blended digital and tactic learning solutions to inspire the genius in every child. With WIFI and Parent Login, VINCI Tab is also a full featured Android tablet to be shared with older kids or parents.  VINCI Differentiation:  Learning Structure: VINCI Tab, VINCI Curriculum, Guide for Parents are all part of VINCI Early Learning System, specially designed to help your child to succeed by enabling your child to have fun learning and climbing the learning ladder. VINCI Curriculum Levels are sold separately.  VINCI Kids Library: With VINCI Tab, experience the safe and healthy digital learning environment which is free from commercials, adult content, violence and addictive in-app purchases. VINCI Kids Library apps are to be purchased separately. Certain Kids Library apps are free.  Mobility: your child will love VINCI's signature handle, perfect for on-the-go.   Safety: VINCI tablets are the only ones certified for FDA Child Safety and use food grade materials.  Specifications:  Cortex A8 processor and graphic engine (GPU) to support VINCI 3D animated learning content  7\" capacitive multi-touch screen, 800x480 display resolution, designed to minimize the impact of electronic display on your child's eyesight  Android 2.3, WIFI, 512 MB RAM, 8GB internal storage, expandable MicroSD card slot  Back facing camera 3 MP  Battery: 6400 mAH ( approx. 6 hours depending on use)  Child Safety Certified: FDA ASTM F963  Warranty 1 year (normal use, touch screen not included)  Preloaded VINCI Curriculum 6 sample apps (full package to be purchased separately), 3 samples of Kids Library apps, one hour of award winning VINCI Music Videos  Bonus: 50 apps free upon registering your purchase of VINCI Tab."}