{"asin": "B0008GJRRS", "description": "Experience the adrenaline rush and harsh realities of war as never before, get to know your squadmates, and fight alongside them through an epic story during the most harrowing moments of WWII. As a part of America&#146;s most decorated and heroic fighting unit, The Big Red One, you'll work together with your squad to accomplish a variety of combat missions spanning North Africa, Italy, and Nazi-occupied Western Europe.Features:Cinematic intensity as never before on consoles: The hallmark cinematic intensity ofCall of Dutyreturns with a more complete gameplay experience than ever. Experience a wide variety of missions on land, sea, and in the air, with the aid of over three dozen authentic American, Italian, French, and German weapons. Charge into battle together as Allied and Axis planes duel overhead, artillery explosions shake the ground and choke the air, and bullets and shrapnel streak past you and your squadmates. Experience war-torn Europe and Africa, from the blistering desert expanses of Tunisia and Libya to the beautiful yet deadly countryside of Italy, France, Belgium, and Germany.Live a soldier's story, deeper than any you've experienced before: You are thrust into the role and story of a member of The Big Red One, America&#146;s most heroic and decorated infantry division. Experience the camaraderie of a single tight-knit army squad, bound together through the chaos of battle over the course of the entire game. Yes, you will suffer casualties; you must not suffer defeat.Know your squad like never before: Through all-new AI and animation, your allies (and your enemies) just got a lot smarter. Your squad will now make better use of environmental cover and tactical maneuvers, such as flanking, envelopment, and fire-and-maneuver behaviors. Hear your allies reacting to the events on the battlefield with contextually accurate battle chatter.Online multiplayer action: go online for intense Axis vs. Allies team-based multiplayer action on PlayStation2 Online.", "price": 12.99, "imUrl": "http://ecx.images-amazon.com/images/I/51DZNHEHR0L._SY300_.jpg", "related": {"also_bought": ["B0001I9YGC", "B0033T1UWW", "B000G7YX14", "B00005V6BB", "B001AWDG44", "B0009EHQVI", "B000MUU5MG", "B00009WAVB", "B00095LEC4", "B00005O0I2", "B00020LZAW", "B0001ADAME", "B001MW91IW", "B00006Z7HU", "B00004UFRI", "B000GPVUQ2", "B000G77WPS", "B0009351R0", "B000GA73O0", "B002I0H0SA", "B0002IQC70", "B0000A0MDV", "9629971372", "B000EHQDA0", "B0000696CZ", "B000099T2H", "B000KCX9M4", "B0002CHIUQ", "B000B69E9G", "B0009Z3HYW", "B0001VGFK2", "B000GVYYFK", "B000G79YNQ", "B000TLU67W", "B00005OLX1", "B000YYR3D4", "B000G6SPHI", "B004Z4ZJMQ", "B0038N09Q6", "B004S3KB6S", "B000SFK0NY", "B00019AZBO", "B0009O7HVM", "B002BWS5QG", "B000EMJA3M", "B0013KW1B2", "B0002XL3BA", "B0009SQF0C", "B000PS4X9G", "B00004U5VF", "B001AZFSEM", "B00004YRQ9", "B00008NRM7", "B0000C4M22", "B002C7TFVO", "B00004YRQA", "B0000690Z9", "B003P9LECG", "B0001NE48U", "B0009Z3IXC", "B0013JHKU0", "B0000C7GHG", "B000F0GX8I", "B00005J536", "B000930DOQ", "B0002RQ3ES", "B004F14XB2", "B001CLG6SG", "B001AWBYNE", "B00008DHNL", "B000UH6GEM", "B00069BV7G", "B00020BV2E", "B0000503MO", "B000QB059Y", "B00006C28Z", "B000930DLO", "B0000A03AG", "B00006N5SZ", "B000093NQG", "B008MO6BJU", "B000M4H6RE", "B00009ZVHY", "B0007PLKZM", "B0007ULFL6", "B000QJLQBC", "B0032GVBS4", "B0000TSRA6", "B000NJH6RS", "B001AWFIMW", "B0000CGB1B", "B000099T1Y", "B0000A8VBZ", "B001CDL6SE", "B00006GSNZ", "B00009WAVD", "B000RHZJK2", "B000GPXS9Y", "B0009N1KCU", "B0009350BW"], "bought_together": ["B0033T1UWW", "B001MW91IW"], "buy_after_viewing": ["B000YYR3D4", "B0033T1UWW", "B0001I9YGC", "B000GA73O0"]}, "salesRank": {"Video Games": 4836}, "categories": [["Video Games", "More Systems", "PlayStation 2", "Games"]]}