{"asin": "B001HKPUKC", "description": "Washington, D.C. has fallen prey to a full-scale alien invasion, and suspicions have arisen regarding the government's role in the attack. With the city thrown into chaos, it's up to you, as a former Secret Service agent code-named &quot;Mr. Ford,&quot; to fight back against the alien invaders as well as rogue agents and other enemy forces. Arm yourself with an array of sci-fi-style gadgets and high-powered weaponry and prepare to blast into the heart of a conflict that may have roots into cover-ups spanning centuries.SynopsisInThe Conduit, you'll find yourself at the center of a thrilling battle involving aliens, secret agents and centuries-old government conspiracies, all set against the backdrop of modern-day Washington, D.C. Built from the ground up for the Wii, the game pits you against ruthless, wily enemies who react to your moves and use the environment to their own advantage. Tailor the game to suit your personal style, and see the game's intense visuals burst to life complete with dynamic environment mapping, interactive water with real-time reflection and four-stage texture composition. Gather up to 11 additional players online for brutal multiplayer action, and incorporate the Wii Speak peripheral to enhance the immediacy of the battle.Key Game Features:Arm yourself with exciting gadgets and weapons to fight back against an alien invasion in Washington, D.C.Become immersed in compelling conspiracy-driven action involving secret agents and centuries-old cover-upsBattle against ruthless, realistic AI enemies who use the environment for cover and react to your movesCustomize your controls on the fly to tailor the game to suit your styleSupports the Wii Speak peripheral during multiplayer matches (Wii Speak not included)Explore a variety of intense online multiplayer modes for up to 12 total playersFirst Person ShooterView larger.Defeat the AliensView larger.Realistic AIView larger.Detailed ControlArmed with an array of futuristic weaponry and an intelligence-gathering device simply called the &ldquo;All-Seeing Eye,&rdquo; players follow an intricate storyline filled with conspiracy, shady government activity and terrifying aliens. The Conduit&rsquo;s detailed control system allows players to customize and configure look sensitivity, turning speed, the dead zone and much more. As players delve further into the mystery behind the extraterrestrial invasion, shocking details reveal that the invasion may have been brought on with help from the government itself.", "price": 23.78, "imUrl": "http://ecx.images-amazon.com/images/I/51pY2hs4WXL._SY300_.jpg", "related": {"also_bought": ["B003GB4UXI", "B001TOMR0C", "B000G7PMX2", "B0019SY1D4", "B002EE7OKE", "B001TOMQVC", "B000RF7164", "B002BRZ9AG", "B002E6XY6U", "B001ET07O0", "B003O6H7X0", "B0030GBU8W", "B000X25GW2", "B000P46NKC", "B000P297F2", "B000WCQWR6", "B0020H46D8", "B00B2QL2Y4", "B001HB7K6I", "B001AWFIPO", "B002BRYXOO", "B002I08CJG", "B000P297ES", "B002BSC4ZS", "B007CSF3GO", "B000W5Y49G", "B0037M2SOY", "B001AWIP7M", "B00503E9UO", "B001P5HM64", "B000R4809W", "B002EE5SAC", "B001COVME6", "B001SI39E2", "B0017WHQ34", "B000RHXD1O", "B000G7T7JC", "B000XPMU1O", "B0010YOQIC", "B00149IL9I", "B000Z9A95M", "B002BSC4RQ", "B002HJQSQW", "B003JD7QYI", "B000FQBPDU", "B002I0IIPY", "B00113T0VA", "B002CZ3SLO", "B0021TVYB2", "B001AZFSGU", "B00269DXR0", "B003P5AJFI", "B002MBQA18", "B003XDRIYC", "B000HCQK0A", "B00269DXXO", "B0081716P2", "B000X2RKOO", "B000HGKEZS", "B004L5SJ5I", "B002P8KOL0", "B003WY86NE", "B0015HZLVK", "B003M31RN6", "B003N3HEU0", "B000NIJ35M", "B00429YACY", "B0093FMS3U", "B002I0GEXM", "B001NCARPW", "B001UWGDC6", "B0016OVBG6", "B003O6FW6E", "B00163ROMC", "B0011GD54K", "B0030F1DQC", "B002DC8GWC", "B007RNWUC4", "B002I0H0FS", "B003ZCH7DI", "B002ATY7JE", "B00005BIG7", "B002TLTBN0", "B005EIIBKY", "B000FQBPCQ", "B008MO6B1S", "B0040ZTFWK", "B0030GBU32", "B000NDFFFE", "B00008KTNW", "B001D8TQ44", "B0053B0DI0", "B002EZLA5I", "B001C58T46", "B00897Z27C", "B00C3MKCF6", "B001BJ690E", "B00BORFD9Q", "B0030HM2YM", "B00004S99R"], "bought_together": ["B003GB4UXI", "B001TOMR0C"], "buy_after_viewing": ["B001TOMR0C", "B002BRYXOO", "B002EE7OKE", "B00503E9UO"]}, "salesRank": {"Video Games": 13433}, "categories": [["Video Games", "Wii", "Games"]]}