{"asin": "B0041RSPR8", "related": {"also_bought": ["B0026MTCFY", "B0046CA2KG", "B004GYUP92", "B001NJHZM8", "B0039BPG1A", "B004PJJU30", "B003VNKNEQ", "B004DLOYAY", "B001G5ZTRM", "B008515KOM", "B008514RSC", "B0046C8BWM", "B004DBCMW6", "B008MAZT56", "B003VNKNF0", "B004AXKXYG", "B0057G2TH4", "B008V0H284", "B0049AWVO0", "B0073HSHJY", "B00494QFBG", "B004J3YCGM", "B005IGVXO8", "B0037T6OBK", "B001KY0D98", "B003H0PNIY", "B004DLIN2Y", "B00322ON1A", "1935763016", "B0035FZJMG"], "bought_together": ["B003VNKNEQ"], "buy_after_viewing": ["B0039BPG1A", "B003VNKNF0", "B009B0MZ1M", "B008514RSC"]}, "title": "Canon SX30IS 14.1MP Digital Camera with 35x Wide Angle Optical Image Stabilized Zoom and 2.7 Inch Wide LCD", "price": 435.0, "salesRank": {"Camera &amp; Photo": 1880}, "imUrl": "http://ecx.images-amazon.com/images/I/51tAAPi3vQL._SY300_.jpg", "brand": "Canon", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The PowerShot SX30 IS has got you prepared for your next extreme photo opportunity. This point-and-shoot digital camera comes with a massive 35x Wide-Angle (24-840mm) Optical Zoom lens--a first for any PowerShot! It also comes with a 2.7-inch Vari-angle LCD, 14.1 Megapixels, High Dynamic Range, Zoom Framing Assist and much more.Canon PowerShot SX30 Highlights35x wide-angle optical zoom (24-840mm) with Optical Image StabilizerThe PowerShot SX30 IS is equipped with a 35x Optical Zoom lens with a focal length of 4.3-150.5mm (35mm equivalent: 24-840mm) that allows you to shoot any scene from wide-angle to telephoto. The camera uses a VCM (Voice Coil Motor) for high-speed, quiet, energy-efficient lens movement with precise control. Focal length is conveniently indicated on the lens barrel.The lens is optimized to fully exploit its zoom length and wide shooting angle in concert with the camera's high 14.1 Megapixel resolution. UD glass effectively suppresses chromatic aberration, while enhanced negative refractive power ensures that distortion at the wide-angle is also corrected. Further aberration is controlled with the inclusion of a double-sided aspherical glass-molded lens and ultra-high refraction index lens.The SX30 IS is equipped with Canon's acclaimed Optical Image Stabilizer Technology that automatically detects and corrects camera shake--one of the leading causes of fuzzy or blurred shots. Even when zoomed in, you can get the steady, crisp, brilliant images you'll be proud to shoot and share. And Canon's Optical Image Stabilizer Technology is convenient to use. It functions perfectly with or without a flash.Improvements to Movie modes: Dynamic mode enables users to use the Optical Image Stabilizer while shooting videoDynamic IS allows you to capture video with more precision and ease than ever before! Without having to make any additional camera adjustments, Dynamic IS automatically operates the moment you start recording video. This image stabilizer continuously readjusts throughout the camera's entire zoom range to correct a broad range of motion -- especially when shooting in the wide-angle end, so footage comes out steady and clear even while you're walking and recording at the same time!And with a powerful 35x Optical Zoom, you'll never be too far away from capturing your greatest memories! Best of all, the Optical Zoom can now be used while shooting video--a first for any of the Canon PowerShot SX digital cameras! So no matter the distance or environment, Canon lets you stay confident that you'll capture the footage you want.Shoots superb 720p HD video with stereo sound; HDMI outputThe PowerShot SX30 IS lets you record video in beautiful high definition (1280 x 720 pixels). The camera also makes it easy to enjoy HD videos (and still photos) on your HDTV with a mini-HDMI connector for direct connection to a high-definition TV monitor. You'll enjoy the HD experience with no degradation of image or audio in the signal, plus the ability to display up to 130 still images at once.New Zoom Framing Assist buttonWith its 35x Optical Zoom lens, the SX30 IS can certainly capture subjects located at a very far distance; however, even with a powerful zoom lens it can often be tricky to track a moving subject while zoomed out to the maximum telephoto range and attempting to steady the camera. To counter this problem, Canon created the Zoom Framing Assist function. By simply pressing and holding the convenient Zoom Framing Assist function button, the camera will automatically zoom out to a wider focal point, allowing you to look for your elusive subject.  Once found, releasing the button will cause the camera to return to its original position and intelligently keep the subject in focus, so you don't have to trouble yourself with any of the controls. Recording video and images has never been easier with a Canon PowerShot!Advanced Smart AUTO intelligently selects the proper settingsJust set the Canon PowerShot SX30 IS to Smart AUTO and you're ready for maximum enjoyment from your picture taking every time. It's a relaxing and satisfying way to shoot because you can completely concentrate on your subject knowing that the camera has the technical details covered. Advanced Canon technology intelligently analyzes your situation and shooting conditions. Then it automatically selects an appropriate setting from 28 specially defined settings. So whether you're photographing flowers, a captivating sunset, or your friends at the park, you can be confident that you're getting dramatic, memorable images.DIGIC 4 Image Processor and 14.1 megapixelsThe PowerShot SX30 IS is equipped with many of the same features as a higher-end camera: an ultra-powerful zoom, eye-popping resolution and advanced picture-improving technology. 14.1 Megapixels of resolution gives your photography incomparable depth and ensures that any section of any shot can be enlarged and cropped with no loss in quality when you edit the image or even if you choose to print the image. It can create crisp, clear 13\" x 19\" posters.Canon's proprietary DIGIC Image Processors have long set its cameras apart from the competition, and the new DIGIC 4 sets the bar even higher. Faster, more accurate noise reduction delivers better image quality, even at high ISO speeds.iSAPS Technology is an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the advanced DIGIC 4 Image Processor to improve focus speed and accuracy, as well as exposure and white balance.Large 2.7-inch Vari-angle LCD enables easy viewingThe camera's 2.7-inch PureColor System LCD screen gives you the big picture, whether you're shooting, reviewing or showing off your images. This high-resolution screen offers a crisp, clear picture to make shooting, playback and using the camera's menu functions especially convenient. The clear and bright LCD also features Night Display for easy viewing in low light. It also has an electronic viewfinder that provides sharp images when you shoot up close during Macro photography.Lithium-ion rechargeable batteries, which makes powering up simpleThe PowerShot SX30 IS now uses a rechargeable lithium-ion NB-7L battery. For ultimate convenience and simplicity, just charge the batteries and you're ready for your next photographic adventure!What's in the BoxPowerShot SX30 IS Camera bodyLithium-ion Battery Pack NB-7LBattery Charger CB-2LZNeck Strap NS-DC11Lens CapCase for Hot Shoe CapAV Cable AVC-DC400STUSB Interface Cable IFC-400PCUDigital Camera Solution CD-ROM"}