{"asin": "B0013RC1W4", "description": "On the island nation of Panau, rival gangs wage war in the streets while the ruthless dictator Baby Panay exercises a system of oppression and corruption against his own people. Somewhere on the island, your friend and mentor Tom Sheldon has disappeared with top-secret intel and millions in Agency cash. As Rico Rodriguez, the Agency's most dangerous weapon, you must infiltrate the island and locate Sheldon, setting off a violent chain of events that will set Panau ablaze.Basejump and attack from aboveView larger.Use your signature grapple to travel or to tether enemies and objectsView larger.You are an instrument of chaosView larger.Harness Just Cause 2's unique parachute and grapple combination to create your own unbelievable, high-speed aerial stunts. Whether free falling from thousands of feet, hijacking enemy fighter jets in midair or blasting through security checkpoints on the ground, use your imagination to create maximum chaos. With hundreds of weapons, vehicles, missions and Rico's trademark parachute and grapple, experience vertical freedom unparalleled in the third-person action genre.Take to the air like no other game. Experience total aerial freedom with the unique parachute and dual grapple.Freefall, BASE jump, vehicle surf, parasail, skydive, grapple, slingshot, leap between vehicles, hang from helicopters, scale buildings. The impossible is within your grasp.Your best tool is now a weapon. Fire two shots with the grapple hook and attach unwilling enemies to high-speed vehicles, hang them upside down from buildings, tether objects in mid air. The possibilities are as vast as your imagination.Explore the island paradise; from sprawling cities, secluded beaches and towering mountain peaks &ndash; more than 400 square miles of your own personal playground.Hundreds of objectives can be completed in any way or order that you choose. When it's time for a break from Agency business, kick back and enjoy all the attractions that Panau has to offer.Catch air on a high-speed dirt bike, race across the sea in a power boat, or fire a spread of rockets from an attack chopper &ndash; more than 100 land, sea and air vehicles are yours for the taking.System RequirementsMinimumRecommendedOperating SystemMicrosoft Windows Vista or Windows 7 (Windows XP is unsupported)ProcessorDual-core CPU with SSE3 (Athlon 64 X2 4200 / Pentium D 3GHz)Intel Core&reg; 2 Duo 2.6 GHz or AMD Phenom X3 2.4GHzGraphics CardNvidia GeForce 8800 Series / ATI Radeon HD 2600 Pro with 256MB memory or equivalent DX10 card with 256MB memoryNvidia GeForce GTS 250 Series with 512MB / ATI Radeon HD 5750 Series with 512MB or equivalent DX10 card with 512MB memoryMemory2GB RAM3GBDirectXMicrosoft DirectX 10Microsoft DirectX 10.1 with Vista SP1Hard Drive10GB of free drive spaceOptical DriveDVD-ROM driveSound Card100% DirectX 10 compatible sound card100% DirectX 10 compatible Dolby Digital 5.1 sound cardInternet ConnectionInternet connection required for product activationInputKeyboard and Mouse (Microsoft Xbox360 controller optional)", "price": 14.99, "imUrl": "http://ecx.images-amazon.com/images/I/51GuuDN%2BM3L._SY300_.jpg", "related": {"also_bought": ["B002V14VOC", "B002BS47YE", "B003EZ1KGQ", "B001O4YSTU", "B000FU2TA4", "B004QEWVTO", "B002I0HKRQ", "B003GSZAOY", "B003ICGL7I", "B003ZULWQI", "B003P9C6EQ", "B000X9FV5M", "B00178631E", "B002ZJPYHS", "B002I0HJ68", "B001Q96ZNU", "B007TRXBJY", "B001KNID2S", "B0050SZ2EQ", "B0050SZ0SY", "B001UWGDPS", "B004H80TUC", "B002BXKJA0", "B004D8QAAO", "B000UB3B3W", "B0012LGHZI", "B001AWIP0Y", "B00BU3WUU4", "B003Q55Y5C", "B0014UGK4U", "B0065NP39E", "B002NIP2SM", "B004ML9WKC", "B001BNFQKO", "B005G4CXPK", "B005C2D2H4", "B003L8DXS4", "B001C4VU5C", "B002I0HFBC", "B002AQNT96", "B00BWH0ZDW", "B009SHV7Y4", "B002EQEFOU", "B002I0IHIM", "B0037M07UG", "B004PFS9TU", "B0000A1VER", "B0079NGSDO", "B0016G88RO", "B0076DO5A0", "B0016Q4UJE", "B0044S8DA8", "B0050SWTS8", "B001AWBYRA", "B001VJ4DHK", "B00503EAG2", "B002I0HJZO", "B003FSFSEW", "B001E8QA2E", "B004FYKWZU", "B0001X5YN4", "B004FUGKSW", "B003TIVSM4", "B0050SZ836", "B004HYIAPM", "B002EE1PBS", "B002I0KOSI", "B002SU4QG4", "B0019C4MU2", "B001D7798A", "B003JVF728", "B003O6CB6S", "B000QB05BM", "B0029ZBZ0I", "B00BMFIXZG", "B002I0JAJ2", "B0016BVYAM", "B000UU5T7E", "B00269QLJ2", "B007XVTR12", "B006P5RW3M", "B00EDJLXHI", "B00F4H2O6W", "B00CPKUV9I", "0700099956", "B00ERDGMSA", "B00CJ7IUIQ", "B001ATHKVC", "B007H2V9W2", "B001GGO1FW", "B0050SZ0JI", "B00C7103JI", "B005EZ5GQO", "B000UCK0LW", "B000Z3VI3K", "B00008JODN", "B004PAGJMO"], "bought_together": ["B000FU2TA4"], "buy_after_viewing": ["B001O4YSTU", "B004QRKWLA", "B0050SZ0SY", "B002I0HKRQ"]}, "salesRank": {"Video Games": 7432}, "categories": [["Video Games", "PC", "Games"]]}