{"asin": "B000EMWBV0", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The sleek PowerShot S3 IS digital camera offers you high resolution, an extra-long zoom, advanced yet easy-to-use movie functions plus great new shooting options. Also, with Image Stabilizer technology, images and movies taken with the S3 IS are sharp and smooth, even when the camera gets jostled. It's everything you need to capture the fun, excitement and beauty of your active life - wherever it takes you!Successor to the popular PowerShot S2 IS, the latest addition to the PowerShot S-series incorporates a 6.0-megapixel CCD sensor, Canon's renowned optical Image Stabilizer technology, and video functionality rivalling that of dedicated digital video camcorders. Sporting a striking new finish in gunmetal grey, the compact PowerShot S3 IS answers the demands of advanced photographers with several improvements over its predecessor, including an increased sensitivity range of ISO 80 to ISO 800, a larger 2.0-inch vari-angle LCD screen, widescreen (16:9) recording, new movie features, and an additional Sports mode.Canon PowerShot S3 IS features:12x optical zoom lens with USM and UD lens elementOptical Image Stabilizer6.0-megapixel CCDLarger size 2.0-inch vari-angle LCD30-frame-per-second (fps) VGA movies with stereo sound and Photo in Movie featureDIGIC II, iSAPS, and Flexizone AF/AE for fast, precise results and 2.3 fps continuous shooting performance20 shooting modes and My Colors photo effectsHigh ISO Auto and ISO 800 for low light flexibilityWidescreen (16:9) recordingThe PowerShot S3 IS caters for serious photo enthusiasts seeking extended zooming flexibility and fully featured movie recording in a versatile compact digital stills camera.OpticsStill the most powerful zoom in a Canon digital compact camera (36 to 432mm, f2.7-f.3.5), the PowerShot S3 IS's lens incorporates the same leading technologies used in Canon's professional EF lenses. An Ultra-Sonic Motor (USM) drives rapid and near-silent zoom operation; an Ultra-low Dispersion (UD) lens element significantly reduces chromatic aberration in telephoto shots; Canon's optical Image Stabilizer (IS) technology counteracts camera shake to reduce image blur when shooting stills or recording video, essential for handheld shots at longer focal lengths. IS allows photographers to shoot at shutter speeds up to 3 stops slower for reliable flash-free photography in low light conditions.The PowerShot S3 IS's 12x optical zoom combines with digital zoom to deliver 48x magnification for recording both stills and video. For even wider framing options, optional wide and telephoto converter lenses extend the focal length from wide 27mm to super-tele 648mm (35mm film equivalent) for an impressive 24x optical zoom. A Super Macro mode and optional Close-Up lens 500D (58mm) allow for detailed macro photography. (Optional wide, telephoto, and close-up lenses not included--must be purchased separately.)Increased ISO speedIn addition to Image Stabilization, the PowerShot S3 IS features a new High ISO Auto setting and ISO 800 to further extend the camera's low light shooting capabilities. High ISO Auto automatically sets exposure using the higher range of ISO sensitivities, enabling faster shutter speeds in low light and increased image stability at the telephoto end. A dedicated ISO button allows for easy switching between ISO sensitivities.Movie functionsPowerful video functions make the PowerShot S3 IS far more than just a high-performance digital still camera. A dedicated movie button means users do not need to switch modes to start recording, so spontaneous moments can be instantly captured in full motion. Users can record smooth 30-frame-per-second VGA quality movies of up to 1 GB with stereo sound, or create 60-frame-per-second QVGA clips for sharp slow-motion playback. The Movie mode also allows users to pre-select exposure and white balance, zoom throughout the camera's focal range, and manually adjust focus while shooting. A Photo In Movie feature enables the capture of full resolution digital stills during video recording.Creative shootingThe PowerShot S3 IS offers 20 shooting modes including full Manual mode, Aperture Priority, and Shutter Speed Priority. Together with 2.3-frame-per-second continuous shooting, a new fast-shutter Sports mode with improved autofocus accuracy provides unprecedented capabilities for capturing action sports sequences. Special Scene modes--such as Night Snapshot and Snow--assist with tricky lighting conditions, while Color Accent and Color Swap modes enable dramatic color effects to be applied to both images and movies. Canon's My Colors photo effects have been enhanced for this model, and can now be applied to images both before and after shooting.The PowerShot S3 IS features a new Widescreen mode (2816 x 1584 recording pixels) for capturing still images in 16:9 format--perfect for viewing images on widescreen television or printing wide (10 x 20-centimeter) photos with a Selphy Compact Photo Printer.Printing and other featuresA new, dedicated Print menu simplifies printing of multiple images. Full PictBridge support means users can print directly to any PictBridge compatible printer without the need for a PC. New PictBridge features include the ability to print shooting data and optimize faces in portrait shots when connected to a compatible Canon PIXMA printer. The camera's ID photo and movie stills features are also available when connected to a Selphy CP Series Printer. A handy Print/Share button allows one-touch printing and easy uploads to Windows or Mac systems. (Printer not included--must be purchased separately.)The camera's menu system now features support for Arabic, bringing the total number of supported languages to 23.Canon technologies explainedOptical Image StabilizerCanon's lens-shift-type optical Image Stabilizer counteracts the camera shake caused by slight hand movements. Vibration sensors detect the angle and speed of movement and send this information to a processor, allowing the camera to compensate. This adds stability to hand-held, telephoto, or moving shots and enables shooting at shutter speeds of up to three stops slower with no noticeable increase in image blur.DIGIC IICanon's purpose-built DIGIC II (DIGital Imaging Core) image processor links all primary camera functions for maximum efficiency. High-speed processing results in outstanding responsiveness, rapid autofocus, and extended continuous shooting ability. Advanced image processing algorithms deliver superb image detail and color reproduction with accurate white balance and minimal noise. DIGIC II operates efficiently to extend battery life, for longer shooting on a single charge.iSAPSiSAPS (Intelligent Scene Analysis based on Photographic Space) automatically optimizes key camera settings before every shot. Each scene is analyzed and cross-referenced against Photographic Space--a vast in-camera library of photographic data. This enables the camera to make optimal adjustments to autoexposure, autofocus, and auto white balance before image capture occurs.9-Point AiAFCanon's 9-point AiAF (Artificial Intelligence Autofocus) automatically scans and selects subjects from a set of nine focusing areas across the scene. This ensures accurately focused images even when subjects are not in the centre of the frame.FlexiZone AF/AEFlexiZone AF/AE lets users manually select the focus point from almost any point in the frame by moving the autofocus window in the viewfinder. Exposure is linked to the focus point to ensure that the chosen subject is accurately focused and exposed.Ultra-low Dispersion (UD) lens technologyNo matter how well engineered, conventional optical glass lens elements cause chromatic aberrations which can 'soften' images and appear in photographs as fringing around the outside edge of subjects. Canon's Ultra-low Dispersion (UD) glass has special optical properties to successfully reduce these aberrations. Especially effective in super telephoto lenses, UD glass helps to deliver crisp, sharp, high-contrast images.What's in the BoxPowerShot S3 IS body, AA-size alkaline battery (x 4), SD memory card SDC-16MB, lens cap, neck strap NS-DC4, Digital Camera Solution CD-ROM, USB interface cable IFC-400PCU, stereo video cable STV-250N", "title": "Canon PowerShot Pro Series S3 IS 6MP with 12x Image Stabilized Zoom", "price": 17.12, "salesRank": {"Camera &amp; Photo": 5934}, "imUrl": "http://ecx.images-amazon.com/images/I/41awLJE6gfL._SX300_.jpg", "related": {"also_bought": ["B001RMHAR6", "B000Q3043Y", "B000YJ0LEW", "B0009O6IXA", "B003ZSHNG8", "B0009GZSSO", "B00009PRYY", "B001AO2274", "B000FH9EQO", "B002LITT3S", "B003VNKNEQ", "B0011ZCDKS", "B00006JU62", "B002WUN24C", "B000FSILBM"], "buy_after_viewing": ["B003VNKNF0", "B00EFILPHA", "B0039BPG1A", "B003VNKNEQ"]}}