{"asin": "B00005Q5U5", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Quite simply, the Canon PowerShot G2 is an elegant, easy-to-use joy of a digital camera that boasts impressive 4-megapixel resolution, a 3x optical zoom, a bright LCD monitor that swivels off to the side of the camera and tilts up and down as needed, and maximum overall creative control in addition to a fully automatic mode. Of course, none of this comes as much of a surprise to anyone familiar with its popular predecessor, the PowerShot G1. Both of these cameras have features and picture-taking modes similar to Canon's EOS cameras, which means they have what Canon calls a \"very camera-like feel.\" Some of the G2's more obvious improvements over the G1 (besides higher resolution) include a champagne gold finish, larger grip for easier handling, improved image and color quality, new photo-effect shooting mode for various effects, including black-and-white and sepia, and a new high-speed selectable three-point autofocus.The G2's 4-megapixel CCD captures images at user-selectable resolutions of 2,272 x 1,704, 1,600 x 1,200, 1,024 x 768, and 640 x 480. This range allows for detail-rich 8-by-10-inch prints that match the results of film cameras as well as easy-to-upload images for the Web and e-mail. Choose between three varying degrees of JPEG compression or store images in the 10-bit RAW data file format for faster transfer without any image quality loss. Your computer easily translates the RAW files into TIFF files using Canon's included software.The telescoping, 3x optical zoom lens (34-102mm equivalent on a 35mm camera) with 3.6x digital zoom, offers both automatic and manual focus control. The improved, high-speed, selectable three-point autofocus system allows flexibility in composition over the single focus point of the G1. A distance scale has been added on the LCD monitor for precision focus adjustment that works best for extreme close-ups. Improved circuitry allows the G2 to perform these advanced functions with faster image capture times and longer battery life than the G1.Like the G1, the G2 has point-and-shoot settings that take the guesswork out of almost all situations, but the manual controls and creative options are where this camera stands out from the competition. Twelve EOS-style shooting modes allow for a wide range of creative possibilities, with manual focus zoom, adjustable aperture priority at 50, 100, 200, and 400 ISO, selectable shutter speed, and six preset white balances--sunny, cloudy, tungsten, etc. Canon has provided four presets for professional results when shooting for maximum depth of field, portraits, landscapes, and night scenes. Other creative controls include the photo-effect mode that allows four possible variations of the normal color saturation: vivid color, standard color, sepia tones, and standard black-and-white.Two video formats have also been included, allowing for 30 and 120 seconds of moving images with audio. Slow shutter-speed mode allows extended exposures in low-light situations. Autoexposure bracketing allows you to intentionally over- and underexpose two extra shots to help capture the best picture possible. Five different flash modes, including red-eye reduction, handle after-dark challenges. The TTL hot shoe is fully compatible with all Canon EX-series Speedlite flashes. The included software package goes beyond standard image processing with a remote capture function that allows complete control and manipulation of the camera functions from your computer keyboard. Canon's Stitch Assist program allows you to combine up to four images into one, seamless, panoramic view.Exterior design features include the highly versatile LCD monitor from the G1 that needs no improvement; its 270-degree rotation allows all angles of image composition from around corners to self-portraits. Changes in ergonomics, as requested by the users of the G1, include a contoured grip for better one-handed shooting and a more streamlined look. Photographers new to the digital market will find the G2 as easy to use as previous PowerShot models, while professionals will be pleased with the improved selection of creative options for capturing the best possible images.The G2 comes complete with USB port and cable for connection to PC or Macintosh computers; Canon's digital camera software package for downloading, processing, and organizing your images; a NTSC cable for connecting to a television set; a rechargeable BP-511 lithium-ion battery pack and AC adapter for charging the battery in the camera; a generous 32 MB CompactFlash card; infrared remote control; lens cap; and neck strap. The camera weighs about 14.8 ounces, and its dimensions are 4.8(W) by 3.0(H) by 2.5(D) inches.", "title": "Canon PowerShot G2 4MP Digital Camera w/ 3x Optical Zoom", "price": 11.73, "salesRank": {"Camera &amp; Photo": 12752}, "imUrl": "http://ecx.images-amazon.com/images/I/41AW9TV924L._SX300_.jpg", "related": {"also_viewed": ["B001G5ZTPY", "B000HATNI8", "B00009W5FF", "B0041RSPRS", "B002LITT56", "B00EFILHB4", "B000Q3043Y", "B009B0MY6S", "B0075T7NW2", "B004HW73QG", "B0075SUIEI", "B000V1VG5G", "B00I58M1VK", "B000BNY64C", "B006UMM2BW", "B0042WD8TM", "B00427ZLRO", "B004J3V8UU", "B000MS043I", "B005DECJBQ", "B005MTMFHU", "B004HW73S4", "B00ET9XV8Q", "B004HW73QQ", "B0075SUHGC", "B0009B05H8", "B009B0MZ1M", "B003ZSHNG8", "B000EMU888", "B0009GZSSO", "B003WJR69E", "B001EQ4C4E", "B00F4PQGDG", "B000PGWMZA", "B00FZEJ3XG", "B0001GMIOE", "B000NVXF26", "B000EMWBV0", "B004M8SWBK", "B000I1ZWRW", "B000069092", "B000NK3NBA", "B00604YTFM", "B000EMWBT2", "B00FCEJ9Y2", "B0007MVHZS", "B006UMM1PO", "B005MTME3U", "B0035LBRJO", "B00I58M26Y", "B00B7N9CB2", "B005I6DVC0", "B00ATM1MVA"], "buy_after_viewing": ["B0042WD8TM", "B009ZK9FZM", "B000YHR57A", "B003VNKNF0"]}}