{"asin": "B0012R9T0M", "description": "Introducing the Signature Mini family of bite-size drives, bursting with tasty ingredients. Supple and resilient to the touch, with a positive velvety grip, they're designed by our friends at Pininfarina, the icon of Italian sports car design since 1930.High speed USB 2.0 \"Y\" cable included provides power without extra cablesPerfect for the Consumers who own a laptop or desktop computer looking for a stylish, simple way to store, backup, and carry their files.Just plug one in, and inside you'll find smart ways to protect and manage all your precious stuff. Includes both local and online backup for unbeatable, total protection. With Fabrik Local Backup software, you can set up automatic backups from your computer to your Signature Mini, while Fabrik Ultimate Backup (2 GB free) provides secure, online storage that's safe from real world mishaps. It works in the background, for constant, near-real time protection without bogging down your computer.And who says the Signature Mini is just for storage? For all the photos, songs, and video in your life, Joggle helps you keep track of them wherever they're stored. Online or on any drive, you'll see all your stuff on a single screen and easily share it with friends and family everywhere.Features and Benefits:Sleek pocket-sized design by PininfarinaVelvety smooth texture for a secure gripDurable and made for travelExpress yourself &#x96; choose from multiple colors and capacitiesAll-in-one high speed USB 2.0 \"Y\" cable (included) also provides powerSimple, automatic backups with Fabrik Local BackupTMComplete, unbeatable protection with Fabrik Ultimate BackupTM online service (2 GB free)JoggleTM digital content manager for easy tracking, sharing and publishing of photos, music, and videosFree technical support3-year warrantyWhat&#x92;s in the BoxSignature Mini USB 2.0 Portable Drive USB 2.0 Cable Fabrik Local Backup&#x99; Software Fabrik Ultimate Backup&#x99; Service (2GB free)&#x86; Joggle&#x99; Digital Content Manager Free technical support", "title": "SimpleTech by Hitachi Signature Mini 500 GB USB 2.0 Portable External Hard Drive FS-U25/500E (Espresso)", "price": 7.73, "imUrl": "http://ecx.images-amazon.com/images/I/31ig247IfpL._SY300_.jpg", "related": {"buy_after_viewing": ["B0046RE21G", "B002N2EL6C", "B003WUBIZQ", "B0012R9WHW"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]]}