{"asin": "B001C58T46", "description": "TheWario Landseries is where Wario, Nintendo's greedy, uncouth and rude anti-hero first appeared, and now he's back in singleplayer action inWario Land: Shake It. With the Wii Remote controller turned sideways like an old-school controller, veterans and newcomers alike can run, jump and smash their way through hectic side-scrolling stages. Players shake the Wii Remote to help Wario take down his enemies, empty bags of treasure or cause earthquakes. Best of all, there are numerous stages each offering multiple missions to keep players coming back again and again to unlock everything, collect more coins or just improve their best times.Get ready to shake things upClassic side-scrolling for coin.View larger.Wobble enemies with the Wii Remote.View larger.Take careful aim against bosses.View larger.Storyline and GameplayWario receives an antique globe and telescope that allow him to travel to the once-idyllic Shake Dimension, now conquered by the tyrannical pirate, the Shake King. With the assistance of his longtime rival, Captain Syrup, he must rescue the Merfles, denizens of the Shake Dimension imprisoned by the Shake King. Only by defeating the bosses of all five continents of this strange world can Wario find and confront the Shake King, rescue Queen Merelda, queen of the Merfles, and, most importantly, claim the Bottomless Coin Sack, a never-ending supply of gold.Each stage has Wario navigating an obstacle course of dangers and traps to find an imprisoned Merfle. Once he frees the little fellow, the countdown begins and he must find his way back to the starting gate before time runs out. Wario must also defeat a boss in each continent, and then buy a map of the next continent from Captain Syrup. Once all five continents' bosses have been defeated, Wario takes on the Shake King himself.CharactersWario Land: Shake Itfeatures a wide cast of off-the-wall characters including: Wario, our \"hero.\" Captain Syrup, a female pirate (and rival from previous games) who aids Wario on his quest. The Merfles, helpless natives of the Shake Dimension, and their queen, Queen Merelda. The Shake King, leader of a ruthless pirate band who has conquered the Shake Dimension.Key Game Features:Shake Things Up With the Wii Remote- With the Wii Remote controller turned sideways, veterans and newcomers alike can run, jump and smash their way through hectic side-scrolling stages. By shaking the Wii Remote, you can shake down your enemies, free coins from treasure bags and even cause earthquakes.Side-Scrolling Fun- Each stage is a masterfully crafted side-scrolling obstacle course of puzzles, enemies and assorted hazards. Every stage holds numerous secrets and treasures to discover (and steal). And each stage has multiple \"missions\" to keep you coming back again and again to unlock everything, collect more coins or just improve your best time.Classic Wario Action and Attitude- Wario returns to form, with all the jumping, power-dashing and butt-stomping we've come to expect. This is surly Wario at his finest.The Wii Remote: Powers, Weapons, Moves &amp; VehiclesWario can jump and dash, as per previousWario Landgames. New to this game is the ability to shake the Wii Remote for various effects. By default, a shake of the Wii Remote makes Wario punch the ground, causing a small earthquake and dazing enemies. Wario can then pick up dazed enemies and, with another shake of the Wii Remote, shake them for rejuvenating garlic and occasionally gold. Enemies can also be thrown, and you aim by tilting the Wii Remote.Wario also takes control of three different vehicles during the course of the game, all of which are piloted in part by tilting the Wii Remote. The controls are standard for a Wii Remote held sideways (D-pad, buttons), but with an important twist: most of Wario's special moves are accomplished by shaking or tilting the Wii Remote. This allows great versatility but without forcing the player to remember complicated button combinations.", "price": 21.98, "imUrl": "http://ecx.images-amazon.com/images/I/61omGAZzy-L._SY300_.jpg", "related": {"also_bought": ["B003ZCH7DI", "B005EHQJ2C", "B002EE7OKE", "B002FG9MWE", "B000LSKXRQ", "B000NNDN1M", "B000FQ9YB0", "B000070IWB", "B003ZHMMEM", "B002BSA388", "B006L1FAK2", "B008GFZV6Y", "B000P297ES", "B005EIIBKY", "B0050SVGW8", "B0050SVFB0", "B00KWFY04A", "B002I0IIPY", "B001PBDBNQ", "B0050SVGXM", "B00I5LMSE2", "B000TU1P3C", "B001TOQ8K2", "B00005MI42", "B005FYJA52", "B002I0GEXM", "B000FQ9QVI", "B001TOMQVM", "B003JD7QYI", "B000R3BNHE", "B0050SVOXE", "B000INV44U", "B005EIIS4S", "B0033BJSDI", "B00CHYOP94", "B003M31RN6", "B0058CA4S8", "B001TOQ8WU", "B0007D4MVS", "B001CU4EMW", "B002BRZ9G0", "B000FW57OC", "B000HE7KZC", "B001TOMQWG", "B008171AZ8", "B0049DYNNO", "B000VLJQ76", "B00095LIC0", "B00KWEHBAG", "B0016OVBG6", "B00KVMHVQ8", "B003FBL86Q", "B001V135P4", "B00002SVER", "B00DC7O77A", "B003S2SQCQ", "B00F9N08WI", "B000R3BNE2", "B000B8J7K0", "B00DC7G2W8", "B001GIUWX0", "B003AMOKS8", "B0017HIIWW", "B000U34SYQ", "B007MM9E42", "B00CQ7CIMS", "B000XZZ8C2", "B0017WHQ34", "B000LSJKAM", "B0001JSSLS", "B004WLRR0E", "B002BSC54I"], "bought_together": ["B003ZCH7DI", "B003ZHMMEM"], "buy_after_viewing": ["B003ZHMMEM", "B000FQ9YB0", "B003ZCH7DI", "B005EHQJ2C"]}, "salesRank": {"Video Games": 5284}, "categories": [["Video Games", "Kids & Family", "Wii", "Games"], ["Video Games", "Wii", "Games"]]}