{"asin": "B001IKHVTE", "description": "Sacred 2: Fallen Angelis an Action Role-playing Game (RPG) where the paths players choose and the decisions they make along the way, determine not only the destinies of their character, but also that of their chosen race as a whole, members of the other five other in-game races, and perhaps the game world of Ancaria itself. Set 2,000 years prior to the self-titled first game in theSacredseries,Fallen Angelis prequel to the events and quests of earlier RPG hit, that drops players in the midst of an epic struggle for control of elemental power on the grandest of scale.Caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Sacred 2: Fallen AngelPlayers:Offline 1-4; Online 1-4Other:Co-op multiplayer; HDTV 480p, 720p, 1080i; 16:9 widescreen; In-game Dolby Digital sound.6 stunning character classes.View larger.Battle using brute force &amp; steel.View larger.A massive weapons inventory.View larger.Master the lore of the ancients.View larger.Classic RPG character leveling.View larger.The StoryT-Energy has been flowing through Ancaria since time immemorial. This mysterious power forms the beginning of all life, is the source of all magic and the origin of all thought. For eons the angelic Seraphim watched over the T-Energy and therefore over the fate of the entire world. But eventually tiring of their burden, they passed their knowledge on to the High Elves. T-Energy helped the realm of the High Elves to experience an unimaginable boost of prosperity, making it the reigning culture in Ancaria. But a force as powerful as T-Energy carries great dangers. Not taught how to deal with this, no sooner did the Elves take control, then a heated dispute erupted among them as to how and to what purpose the T-Energy was to be used. Dispute morphed into irresolvable conflict, then rift and eventually to a civil war among the High Elves, where all participants were losers. Their realm collapsed and with it the entire power structure of Anacaria. In the turmoil all the peoples of Anacaria coveted the right, either openly or in secret, to wield the power of T-Energy and in the end, unmanaged, the T-Energy raged out of control warping creature and lands alike. Can anyone regain control over the T-Energy. And if so, will he/she strive to prevent the world from lapsing into final chaos, or deepen it?GameplayGameplay inSacred 2: Fallen Angelin divided into two campaign paths: Light and Dark. As the game begins players choose and customize their character and choose the path they will follow. This choice determines the ultimate goal and intentions of their character, and as the game progresses through literally hundreds of quests and side quests, the paths of different characters intersect at different junctions. Choose one way and you may be tasked to defend a town and its people, while another path could result in you attacking the same town. The choice is yours and the fate of the world and your well-being are at stake.Key Game Features:A massive, seamless and dynamic world delivering hundreds of hours of freeform exploration.Two deep campaigns: play as the 'Light' or 'Shadow' side, complete with distinct skills, rewards and story-elements tailored to the chosen path.Six exceptional, playable characters, each with a distinct look, capabilities and in-game motivation.Modifiable combat arts: change, upgrade and link together your alter ego's combat skills to match your playing style.Fight effectively from the back of a number of mounts under your control; equip and upgrade your character's unlockable special mount.Deities offer unique combat disciplines and unlock additional quests.Seamless transition between single and multiplayer gaming modes via Xbox LIVE.Captivating online modes of play challenge gamers in cooperative, PvP and PvE play.Extraordinary, cutting-edge graphics and Dolby 5.1 channel surround sound utilize the latest technologies for a truly immersive experience.Character ClassesInSacred 2: Fallen Angelplayers assume the role of one of six characters -- five of which are new to the franchise -- and delve into a thrilling story full of side quests and secrets that you will have to unravel. Breathtaking combat arts and sophisticated spells are waiting to be learned. A multitude of weapons and items will be available, and you will choose which of your character's attributes you will enhance with these items in order to create a unique and distinct hero.SeraphimOften referred to as 'Fallen Angels,' these mystical and angelic creatures are the oldest inhabitants of Ancaria. Fast, elegant and acrobatic warriors from a technological future they fight with light to medium weapons and, if required, with massive technological support. Players can assume the role of a Seraphim and protect the world from chaos.Shadow WarriorShadow Warriors were originally humans trained as elite soldiers in service to the High Elves. Upon their death their souls were stolen by an Elven general, bound to lifeless bodies and imbued with T-Energy. Now free, they travel between this world and the next as undead beings with only the desire to return to the peace of the golden halls of Elysium.High ElfThe best student at the ancient academy of magic in Thylysium, the High Elf character lives and breathes magic. Her hunger for adventure and her insatiable desire to increase her personal knowledge and the influence of her once-powerful house are the driving forces as she sets off into an Ancaria boiling over with turmoil.DryadMasters of the hunt and akin to the Elves, The Dryad are in tune with nature and are equipped with the strength of the forests. The most powerful and the strongest among them are knowledgeable of the dark art of voodoo and were chosen in order to save their peoples from extinction. All are expert with the bow, traps, poisons and lore of the forest.InquisitorThe Inquisitors are the High Priests of the High Elves. Arrogant and deadly, they are only committed to themselves and their ultimate goal of assume control over the T-Energy. Proficient in close combat and able to gain increasing power as damage is taken, their manipulative spells make them powerful fighters from the shadows.Temple GuardianSince the beginning of time the purpose of Temple Guardians were to maintain and protect the Great Machine, so that it could keep the world in balance. Neither fully flesh or mechanical, they are half human and half machine. Propelled by T-Energy and devoted to protecting it, they are part of the Great Machine and so able to use the T-Energy for their purposes.A Wide Variety of MountsAcross Ancaria you will find many horse dealers. They offer all kinds of animals, from the simple nag up to a real war horse. You can equip a war horse with bridle, saddle and even special armor. These special items can be found in the game just like player items, ranging in quality from regular to rare and even unique items. In addition, every character also has a unique mount created specifically for their character class. This mount not only fits the personality of the character, but also complements the various aspects of the character's playing style perfectly. All character classes can fight from a mounted position using a variety of tactics that the player chooses depending on the terrain and battle conditions.", "price": 8.59, "imUrl": "http://ecx.images-amazon.com/images/I/51N6LpjCgtL._SY300_.jpg", "related": {"also_bought": ["B003O6E9EK", "B003FBL85W", "B0016NRS8M", "B004JHJHCC", "B00J22635I", "B0043B5SLI", "B003DNH95K", "B000WCN7G0", "B002C0VNVG", "B0044SA70M", "B000NJH6YG", "B004H0J5S2", "B00KAEIS6O", "B00B59MXDM", "B004A88W8K", "B007FMSH4W", "B00D7NQP9M", "B0058VI0SU", "B00IQCRNS6", "B002QK00OI", "B003O6G6G4", "B0047TG2R0", "B0045ZIENQ", "B00319DX4W", "B001LGFPSY", "B003BU3ZIU", "B002I0JGDM", "B0050SY9WC", "B001UWGDC6", "B004NRN5DU", "B006GHA8EE", "B00149NCYW", "B002GPPPS4", "B001D7T2VM", "B000R0SS3Y", "B000PC4FYK", "B00ICWO1XA", "B000MTF054", "B002W5GI9I", "B001P2M532", "B0056WJA30", "B000FRVAD4", "B002BRWUA8", "B001CMJAP6", "B001CBW18K", "B00DBCAT3W", "B006RHAT2E", "B000FLZEXM", "B003O6E7AG", "B002DC8GEK", "B00JUFT3JA", "B0028A6V7Q", "B002BRUTT2", "B002I0JA7E", "B0015HZLVA", "B007FQUFC0", "B005VBVQAG", "B000QW9D14", "B000KLNLV4", "B004EW7LSY", "B003O6EBRA", "B000XJO7A2", "B005FDUSTA", "B001NX4DUQ", "B001CMIUYS", "B00009U146", "B000ZJVDA2", "B000P297E8", "B00320JDWG", "B00576U8CC", "B001D25M1Q", "B008XMSRKC", "B000HCJD68", "B002Q21X7Y", "B000XJS00K", "B00KAEITQ8", "B00J6DLPLK", "B000LV9N8S", "B0050SYK44", "B001EOQV9U", "B0041OWQUI", "B004MXQ3DY", "B0014ULQB2", "B00B59L9VO", "B00354NAYG", "B007UMD1EI", "B00ERDGMT4", "B000FUG5WC", "B0016NUZFU", "B003VMWR14", "B00IODWOW2", "B000G82KU4", "B001BC948U", "B004FYEZMQ", "B000BLM5PG", "B0019MRKNI", "0307890112", "B001ASJISG", "B00EVWYF0E", "B00BU3WWOS"], "buy_after_viewing": ["B0016NRS8M", "B003O6E9EK", "B0044SA70M", "B003DNH95K"]}, "salesRank": {"Video Games": 5242}, "categories": [["Video Games", "Xbox 360", "Games"]]}