{"asin": "B0030BJEUS", "imUrl": "http://ecx.images-amazon.com/images/I/31m4XkAs4aL._SX300_.jpg", "description": "The efficient LaCie Hard Disk Quadra, Design by Neil Poulton is extremely easy for anyone to use. Compact, but with colossal capacity, this lightweight storage solution takes up little room and can move around easily. Setup is nearly effortless; it's plug and play and offers automatic formatting with LaCie Setup Assistant with customizable features. Moreover, LaCie Backup Assistant software for PC and Mac users is included for saving files in one click. The LaCie Hard Disk Quadra, Design by Neil Poulton provides eSATA 3Gb/s, FireWire 800, and USB 2.0 interfaces for full connectivity with your PC or Mac, as well as an included 9-to-6-pin cable for FireWire 400 compliancy. There are two FireWire ports so you can connect it to your computer and to another device like a second external drive, camcorder, or camera. This sleek hard disk has an all-black mirror-polished finish and a unique feature, a cool, blue LED strip on its underside that creates an ambient glow.    Interface Transfer Rate (max. bus speed) -     eSATA 3Gb/s -  up to 3Gbits/s   FireWire 400 -  up to 400Mbits/s   FireWire 800 -  up to 800Mbits/s   USB 2.0 -  Up to 480Mbits/s   Burst Transfer Rate -     eSATA 3Gb/s -  Up to 80MB/s   FireWire 400 -  Up to 40MB/s   FireWire 800 -  Up to 80-90MB/s   USB 2.0 -  Up to 35MB/s   In the box -     LaCie Hard Disk Quadra, Design by Neil Poulton   USB 2.0 cable   eSATA cable   FireWire 800 cable   FireWire 800 to FireWire 400 cable   External power supply   Quick Install Guide   LaCie Utilities (preloaded on the drive) -  User Manual, LaCie Backup Assistant (Windows and Mac), and LaCie Setup Assistant     System Requirements -     Computer with an eSATA, FireWire 800, FireWire 400, or USB 2.0 port   Latest version of Windows XP, Windows Vista, Windows 7 / Mac OS X 10.4, 10.5, 10.6    Minimum free disk space -  600MB recommended   Unit Dimensions -  4.6 x 7.6 x 1.8, Weight -  33.5 oz.    Manufacturer's 2-year limited", "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]], "title": "LaCie 301881U 1TB Hard Disk Quadra External Drive"}