{"asin": "B002HWRN9U", "categories": [["Electronics", "Computers & Accessories", "Computer Components", "Internal Sound Cards"]], "description": "The AVerTVHD Duet is your Pure HD Dual Digital, Compatible with Windows 7 TV tuner that will &#x201C;Accelerate&#x201D; your existing HTPC (Home Theater PC) to higher levels of High Definition Digital Entertainment. It&#x2019;s designed to receive HD Digital TV Over-the-Air (ATSC) or Unencrypted Digital Cable (ClearQAM) signals directly to your PC! The AVerTVHD Duet has a single input, which adopts the PCI Express interface, which offers a stable and higher bandwidth transmission environment than the traditional PCI bus. One of the great features about a dual tuner is, with the included AVer MediaCenter application, users can watch one program, while recording another, or record two programs simultaneously! Better yet, if you have an available PCI-E slot, you can install a second tuner and record up to four different programs simultaneously, while viewing any of the four programs.Through the AVer MediaCenter application, which also supports all Windows Operating Systems (32 and 64 Bit), you will experience PIP (Picture-in-Picture) features. This function enables you to work on their PC and watch TV at the same time, providing more convenience to watch TV without interrupting your work! While working on your PC you can choose the PIP window size from 1/4, 1/9 or 1/16 on your PC screen. Also, you can select Transparent PIP and see through the Picture-in-Picture, not to cover anything on your desktop that you may be working on. PVR (Personal Video Recorder) features such as Pause, Rewinding and Recording Live TV as well as Scheduling Recordings and TimeShift are also part of the AVer MediaCenter application. Input Signal:75 Ohms TV Antenna Input; Package Includes: AVerTVHD Duet; Low Profile Bracket; Installation CD (Includes: Application, Drivers, Quick Guide and User Manual); Warranty Card", "title": "AVerMedia A188 HD Duet - Dual ATSC PCI-E TV Tuner for Windows Media Center", "price": 69.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41sTEloATXL._SX300_.jpg", "related": {"also_bought": ["B00224ZDFY", "B004GGUAUE", "B003WM5J0O", "B005DKZTMG", "B004HO58SO", "B005ZAK4W4", "B0095VPBFY", "B0088PUEPK", "B0014YFC18", "B00IICMUWS", "B004Q0PT3I", "B004I5UDO6", "B004SUO068", "B001E2T6Y4", "B008J0ZOV8", "B009O7YZ7O", "B000XBF466", "B00GY0UB54", "B002UOR17Y", "B000WDR94U", "B0079XWMEI", "B002UOUQ08", "B0024R4B5C", "B006PU81QE", "B00B4BJY7E", "B00F3ZN0CC", "B00DQN3R9O", "B004X8EO6Q", "B008YAHW6I", "B00B9996LA", "B0037ECAM2", "B001O4EPHA", "B00D78Q2DQ", "B008TZJ126", "B00286SIFS", "B00A35X6GM", "B00DIGAIRS", "B00A4ZXE40", "B0030DSECK", "B001E2V7R8", "B000292DO0", "B001EKCGT8", "B000AAN76Y", "B005T3GRLY", "B008KVUAGU", "B007RH5GZI", "B005T3GRN2", "B004QK7HI8", "B0029U2XH2", "B007VPGL5U", "B0037TO5C0", "B003UE52ME", "B007YV0UQW", "B0057Q4AGW", "B001I5610E", "B0035A6AUG", "B009GUXU52", "B005FMLZQQ", "B00DIFIM36", "B006YLVD50", "B008EQ6QI2", "B003P92D9Y", "B006WAGGUK", "B0063705PE", "B002CIDIPW", "B002N2EHVQ", "B003MTTJOY", "B002V2R8VY", "B001PI09SE", "B0027AGK3M", "B00EHBEUZO", "B008G9V60K", "B0052SCU8U", "B001QUA6RA", "B0011A4UZE", "B0033Z2BAQ", "B007Q45EF4"], "buy_after_viewing": ["B0014YFC18", "B001E2V7R8", "B00224ZDFY", "B001E2T6Y4"]}}