{"asin": "B002453K5G", "categories": [["Electronics", "Computers & Accessories", "Monitors"]], "description": "Fabulous Colors for Fabulous Entertainment.The ASUS VH236H LCD monitor delivers stunning high definition visual quality with a 23-inch 1080p Full HD LCD, perfect for HD movies and multimedia.With HDMI input and built-in stereo speakers, you can attach your gaming console, PC, or Blu-Ray player for instant HD enjoyment. Splendid Video Intelligence Technology, Smart Contrast Ratio Technology, and Aspect Control optimize visuals for all user-scenarios and environments.With built-in stereo speakers, the ASUS VH236H energizes gaming, HD movies, videos, and graphic-intensive applications.Key Features23-inch Full 1080p HD widescreenwith spectacular vibrancy (Learn more)HDMI/DVI/VGA inputs with built-in stereo speakersfor instant HD multimedia enjoyment (Learn more)Splendid Video Intelligence Technologywith 5 preset modes and 3 skin-tone presets (Learn more)ASUS TraceFree 2ms quick response timefor flawless gaming and video playback (Learn more)Stylish design with practical wall-mount optionsfor fitting into any type of d&eacute;cor (Learn more)Built-in stereo speakersenhance multimedia and movies (Learn more)Aspect Controlautomatically optimizes all aspect ratio display modes for undistorted display (Learn more)Covered by ASUS three year LCD monitor warrantyfor casing and panel for worry-free enjoyment (Learn more)Learn MoreDesktop High Definition CinematicsASUS VH236H features a 23-inch 16:9 widescreen  display with 1920x1080 resolution that enables  borderless Full HD 1080p full-screen video display.  Its vibrant ASUS Splendid display engine and HDMI  input provides life-like images so you can enjoy  stunning details and High Definition clarity.HDMI input simplifies cabling in a pure uncompressed  digital format for plug-and-play easiness. HDMI provides  pristine and stunning audio and video clarity for instant  multimedia enjoyment with PC, gaming consoles,  Blu-ray players, etc.Along with the TraceFree 2ms (gray-to-gray) response time, the VH236H is lightning quick to provide a smooth and flawless video playback, whether you are playing the fast action games or blockbuster movies.Also onboard is a digital SPDIF audio output to  Connect to your home audio system for complete  desktop entertainment experience.ASUS VH236H is versatile and High Definition ready to  handle your multimedia needs.Delivers Vibrant Images with Exceptional FeaturesHDMI input and DVI input with HDCP (High-Bandwidth Digital Content Protection)  support ensures video signal integrity and image quality.ASCR (ASUS Smart Contrast Ratio) Technology automatically  adjusts the luminance of the backlight for better display according  to image contents, and improves the contrast ratio to  20000:1 for more realistic night scenes in games and movies.Aspect Control function allows users to select a preferred display  mode between Full and 4:3 modes for true-to-life gaming or movie watching without any quality loss or image distortion.The 23-inch widescreen in 16:9 golden ratio gives you the best  viewing comfort with more horizontal real estate compared to the traditional  4:3 ratio. 16.7 million display colors deliver rich, colorful images.Intelligent Image Enhancement with ASUS Splendid Video Intelligence TechnologyASUS Splendid Video Intelligence Technologyadopts a color engine to  detect activation and usage of video applications. It then automatically  optimizes image quality with intelligent color, brightness, contrast, and  sharpness corrections for the best visual results.Splendid Technology offers five video modes designed forscenery, theater, gaming,  night view, andstandard imagesscenarios.Splendid also provides three skin tones of yellowish, natural and reddish to  produce realistic visuals of the human objects in your videos.You can see optimized images on screen and select between the five  modes via a hotkey quickly.Streamlined, User-friendly DesignSophisticated glossy piano-black frame and smooth base design.Built-in stereo speakers enhance audio enjoyment together with  true-to-life HD visuals.Convenient key controls for easy set-up in the multi-language OSD.Cable manager helps you manage cables and keep them out of sight.VESA wall mount compatible (100 x 100 mm) minimizes the footprint in homes or offices.25&deg; ( forward 5&deg;, backwards 20&deg; ) tilting angle for a more ergonomic,  comfortable viewing experience.KENSINGTON security lock in public settings.WarrantyASUS 3 Years LCD Monitor Warranty + 3 Year Panel WarrantyThe ASUS VH236H is covered by ASUS 3 years LCD monitor warranty for the casing and panel. Accessories and cables covered by 1 year warranty.  Please visitSupport.ASUS.comfor more details on ASUS LCD monitor warranty policy.What's in the BoxASUS VH236H LCD MonitorDVI CableVGA CableD-sub cableAudio CablePower CordQuick Starter GuideWarranty Information CardsSpecificationsPanel Size:23-inch Wide ScreenTrue Resolution:1920x1080 (Full HD)Pixel Pitch:0.266mmBrightness(Max):300 cd/m2Contrast Ratio (Max):20000:1 (ASCR)Display Color:16.7 millionViewing Angle (CR&gt;=10):160&deg;(H)/160&deg;(V)Response Time:2 ms (Gray-to-Gray)Video Features:Trace Free Technology, SPLENDID Video Intelligence Technology, SPLENDID Video Preset Modes (5 modes), Skin-Tone Selection (3 modes), HDCP support, Color Temperature Selection (5 modes)Audio Features:Stereo Speakers 2Wx2 stereo RMSConvenient Hotkey:SPLENDID Video Preset Mode Selection, Auto. Adjustment, Brightness Adjustment, Volume Adjustment, Input SelectionVideo Input:HDMIAV Audio Input:HDMIAudio Output:SPDIF (through digital coaxial out)Earphone jack:3.5mm Mini-jackPC Video Input:DVI-D/D-SubPC Audio Input:3.5mm Mini-jackAnalog Signal Frequency:30~83kHz(H)/ 50~75 Hz(V)Digital Signal Frequency:30 ~ 83KHz(H)/50 ~ 75 Hz(V)Power Consumption:Power Consumption &lt; 55 W, Power Saving Mode &lt; 1 WChassis Colors:BlackTilt:+20&deg;~ -5&deg;VESA Wall Mounting:100x100mmSecurity:Kensington lockPhys.Dimension(WxHxD):21.61 x 13.7 x 8.66 inchesBox Dimension(WxHxD):24.52 x 18.81 x 6.73 inchesWeight:12.12 lbsRegulation Approval:Energy Star, UL/cUL, CB, CE, FCC, CCC, BSMI, Gost-R, C-Tick, VCCI, PSB, J-MOSS, RoHS, WEEEAll specifications are subject to change without notice.Color and bundled software versions are subject to change without notice.Brand and product names mentioned are trademarks of their respective companies.Product may not be exactly as shown in photos.1Rated number 1 Windows-based PC maker in PCMag.com&rsquo;s Service &amp; Reliability Report 2009. Rated number 1 PC brand according to SquareTrade, the leading direct-to-consumer warranty company (for more information visit http://www.squaretrade.com/pages/laptop-reliability-1109/ )Check Out Other ASUS Notebook Computers and AccessoriesASUS VW266H LCD MonitorUpgrade to bigger LCD. 25.5-inch large with 1920x1200 resolution and a 2ms response rate, VW266H is ready to take on your latest games and movies. Comes with HDMI, DVI-D, D-Sub, and Component inputs as well as S/PDIF output.ASUS MS246H Slim LCD MonitorFull HD display housed in a razor-slim frame, the artistically designed MS246H LCD monitor saves you desk space and is HDMI ready.ASUS RT-N13U Wireless N Router (with USB)Upgrade your network to faster performance and broader range with this EZ to setup router. You can even share an all-in-one printer with the peers in your network.RT-N16 Wireless N Router w/ Gigabit EthernetEnjoy the speed of gigabit ethernet and convenience wireless N all in one powerful router. The RT-N16 also has 2x USB 2.0 ports for sharing your printers and USB attached storage amongst network users.", "title": "ASUS VH236H 23-Inch Full-HD 2ms LCD Monitor", "price": 155.43, "salesRank": {"Computers & Accessories": 3759}, "imUrl": "http://ecx.images-amazon.com/images/I/41KrmL5waeL._SX300_.jpg", "related": {"also_bought": ["B0002L5R78", "B007SZ0E1K", "B002RJUSO0", "B0041D1L3W", "B007KTY4A6", "B004Q0PT3I", "B004J6BIJ8", "B0036Q7MV0", "B003ZM7YTA", "B005O65JXI", "B008I649KA", "B00840353W", "B002RRLQIO", "B005BZNEVQ", "B002J9GDXI", "B0033Z2BAQ", "B002ZV51DI", "B002YIG9AQ", "B004EBUXHQ", "B004CRSM4I", "B003ZSN600", "B0057FRTPW", "B008DWITHI", "B0055QZ216", "B003NREDC8", "B00B2IZ3B0", "B007UXJ6LE", "B001EYV690", "B007SZ0EOW", "B00461G3MS", "B004WK3KKQ", "B002Q4U5DK", "B0088PUEPK", "B003L1ZYYM", "B002P35JMO", "B003ELVLKU", "B000GQMHBI", "B000UEZ36W", "B005T3GRNW", "B009EAEZAI", "B003ZJ5B4I", "B006EWUO22", "B008SBX6GI", "B0050SYX8W", "B005BZNDS0", "B004W2JKZI", "B00316263Y", "B003O6CACS", "B003ZJ1VD8", "B003HE260I", "B004KSQANO", "B0087EVHVW", "B007RIFKUS", "B001TH7T2U", "B004MR3QY4", "B004W2JKWG", "B000I5LACO", "B004LB5AZY", "B0030CGMAC", "B005EQE0YM", "B006VCP7YA", "B007XVTR3K", "B007R21JJK", "B007SZ0ECE", "B007OCJWTM", "B0026FCI2U", "B002WIG4LW", "B004MYFODI", "B007R1FH3K", "B008ZT8QKO", "B0058J1QYC", "B005CPGHAA", "B003VANO7C", "B009NHAF06", "B0027VT6V4", "B000J1H4VI", "B002RM08RE", "B005C7R8I8", "B0039L50J8", "B007G51UWY", "B0053GR2YI", "B000V6KD78", "B002R9HQLI", "B004QBUL1C", "B001S5CCF2", "B001G0WPLK", "B0094NY3R0", "B0026ZPFCK", "B004VLYIE8", "B0019EHU8G", "B004SUILFO", "B000Q8UAWY", "B001QUA6RA", "B002DHGMK0", "B00413PHDM"], "buy_after_viewing": ["B005BZNDS0", "B008DWITHI", "B004J6BIJ8", "B007HSKSMI"]}}