{"asin": "B003ZSHNG8", "related": {"also_bought": ["B004052JBO", "B003VNKNEQ", "B003F7DWH8", "B004DBE080", "B003ZSHNGI", "B004GIYZGC", "B004GRLMDW", "B004W4J830", "B001795L5W", "B0037T6O2Y", "B005I6DVC0", "B000EVQ0OU", "B003CJTQJC", "B003VNKNEG", "B004RP2VNI", "B003VNKNF0", "B002I03UQG", "B00908BQCY", "B005N1QL54", "B002LITT3S", "B00CV9LG06", "B005HX1OLY", "B002WE4HE2", "B005QIW8UQ", "B00CV9MHG8", "B000EMWBV0", "B004NPWFP6", "B002OVMLW8", "B0035FZJM6", "B002CSNVOA", "B001V9KG12", "B0001LJ392", "B0078F0XAC", "B0039BPG1A", "B008BSREGQ"], "bought_together": ["B003VNKNEQ", "B003F7DWH8"], "buy_after_viewing": ["B003VNKNF0", "B003F7DWH8", "B005I6DVC0", "B00908BQCY"]}, "title": "Canon PowerShot SX130IS 12.1 MP Digital Camera with 12x Wide Angle Optical Image Stabilized Zoom with 3.0-Inch LCD", "price": 228.0, "salesRank": {"Camera &amp; Photo": 1280}, "imUrl": "http://ecx.images-amazon.com/images/I/51-%2B06Y1wEL._SY300_.jpg", "brand": "Canon", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Smart, sleek and creative, the PowerShot SX130 IS is the perfect companion to all your good times. Now you can capture every detail of special moments in crisp, stunning 720p HD--even while using the high-powered 12x wide-angle optical zoom. You'll record in stereo sound, then play back your videos instantly on you computer. The SX130 IS is all about creativity, with fun new scene modes like Miniature Effect for Movies, and Fisheye Effect for artistically distorted stills.While you're having fun creating, the camera's Smart Flash Exposure and advanced Smart AUTO systems are ensuring that every image is the best it can be. Add the DIGIC 4 Image Processor, 12.1 megapixels and Canon's Optical Image Stabilizer, and you've got the ideal camera for making the good times last.Canon PowerShot SX130IS HighlightsShoot 720p HD video with stereo sound while using the optical zoomThe PowerShot SX130 IS is the perfect combination of still camera and extraordinary video maker. Videos are recorded in spectacularly detailed 720p HD with clear stereo sound. Better yet, you can now zoom in and out as your creativity demands, without losing a bit of the 720p HD resolution. Given the SX130 IS's powerful 12x wide-angle optical zoom, this capability is especially meaningful.12x wide-angle optical zoom with Optical Image StabilizerWith precision engineering and decades of leadership in optics technology, Canon has created a bright, wide-angle lens that magnifies to an astonishing 12x. Moreover, it's sized to fit the SX130 IS's compact profile, performs at high speed, and keeps power consumption low.Whether you're at a sporting event, school play, or just out and about shooting, you'll love how the SX130's powerful wide-angle 12x optical zoom gets you up close fast and puts more image into every frame. And Canon's Optical Image Stabilizer controls camera shake to ensure that throughout the zoom range, your images are steady and crystal clear.Scene modes like Miniature Effect for Movie and Fisheye Effect offers creative options for videos and imagesExplore your creativity!  The PowerShot SX130 IS gives you fun, easy ways to play with perspective in your still images and videos, too.Miniature Effect for Movies (also available for still images) enhances perspective to give whatever you're shooting the fascinating look of a scene shot with miniature models. At the same time, selective frames are removed to enhance the effect when you play the scene back at 30 fps.\"Fisheye\" lenses are favorites of professional photographers: their quirky, convex perspective gives a fun creative punch to shots of kids, pets and more. The SX130 IS creates a Fisheye Effect without the need to attach a special lens--simply activate the mode, choose from three levels (low, medium and high) and shoot!Smart Flash Exposure determines the correct flash based on the shooting situationSmart Flash Exposure is a technology that uses the proper flash by analyzing a wide range of lighting conditions, and helps ensure against over or underexposed images. The detail and color of your photo remain intact and truer to life even in challenging lighting.Advanced Smart AUTO selects from 28 predefined shooting situationsJust set the Canon PowerShot SX130 IS to Smart AUTO and you're ready for maximum enjoyment from your picture taking every time. It's a relaxing and satisfying way to shoot because you can completely concentrate on your subject, knowing that the camera has the technical details covered. Advanced Canon technology intelligently analyzes your situation and shooting conditions. Then it automatically selects an appropriate setting from 28 specially defined settings. So whether you're photographing flowers, a captivating sunset, or your friends at the park, you can be confident that you're getting dramatic, memorable images.With 22 Shooting Modes including 12 Special Scene Modes, you're ready for whatever shot comes your way.Capture amazing detail with 12.1-megapixel resolutionPowerful DIGIC 4 Image Processor with 12.1 megapixelsThe PowerShot SX130 IS is equipped with many of the same features as a higher-end camera: an ultra-powerful zoom, eye-popping resolution and advanced picture-improving technology. 12.1 Megapixels of resolution gives your photography incomparable depth and ensures that any section of any shot can be enlarged and cropped with no loss in quality when you edit the image even if you choose to print the image. It can create crisp, clear 13 x 19-inch posters.Canon's proprietary DIGIC Image Processors have long set its cameras apart from the competition, and the new DIGIC 4 sets the bar even higher. Faster, more accurate noise reduction delivers better image quality, even at high ISO speeds.Large 3.0-inch LCD with wide viewing angleThe camera's high resolution (230,000 dots) 3.0-inch LCD gives you the big picture, whether you're shooting, reviewing or showing off your images. This high-resolution screen offers a crisp, clear picture to make shooting, playback and using the camera's menu functions especially convenient. Clear and bright, it also features Night Display for easy viewing in low light.AA battery power enables you to easily power upConveniently, you don't need to worry about running out of batteries or having to recharge them. Since AA-size batteries can be purchased at any store, simply get new ones locally--wherever you go, no special power adapters or chargers are needed.What's in the BoxPowerShot SX130 IS Camera bodyAA-size Alkaline Battery (x2)Wrist Strap WS-800AV Cable AVC-DC400STUSB Interface Cable IFC-400PCUDigital Camera Solution CD-ROM"}