{"asin": "B001DQKHX0", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "The new waterproof Sanyo Xacti E2 camcorder captures stunning digital video and beautiful 8-megapixel photos -- on land and even underwater!Practically four cameras in one, the Xacti E2 allows you to shoot both photos and video at a park, birthday party, or virtually anywhere else on dry land. And, when the opportunity presents itself, you can also shoot both photos and video while snorkeling or while just playing around in a swimming pool. This means you can enjoy shooting at the beach, by the pool, or on the ski slopes without worrying about submerging the camera or getting it wet from rain or snow.Shoot both video and photos underwaterThis powerful little camcorder easily records both full 640x480 resolution video at 60 fields-per-second and high-resolution 8-megapixel digital still images, all of which are handily stored to a standard SD or SDHC flash memory card (sold separately).Sanyo Xacti VPC-E2 HighlightsDesigned to IPX8 international standard for waterproofThe Xacti E2 is capable of recording full-motion video five feet underwater for up to 30 minutes. Incorporating a water-tight design that can resist the pressure created when submersed at five feet, the Xacti E2 is capable of capturing dramatic photos and video footage underwater to share with less adventurous family members and friends.Incorporates the highly advanced AVC/H.264 video compressionThis makes posting movies on the Internet or e-mailing them to friends and family easier by reducing the file size. In fact, the file size can be up to 25 percent smaller than that of typical MPEG-4 cameras. To accomplish the complexity of encoding AVC/H.264 in real-time on the E2, a H.264 video compression IC was incorporated into the camera that was designed specifically for portable consumer devices to achieve high video quality while simultaneously reducing the system power consumption. The result is high-quality video recording up to a total of 8 hours of full-motion video with an 8 GB SDHC memory card (in TV-HQ mode). The Xacti E2 can also record up to a total of 4 hours of video with a 4 GB SDHC memory card, up to 2 hours with a standard 2GB SD card, and up to 1 hours with a standard SD card.Large, 2.5-inch Liquid Crystal Display (LCD)The display flips out from the camera and rotates up to 285 degrees on an axis that allows you to take great video or still images from otherwise-difficult-to-view positions, proving to be especially useful when shooting underwater or in small rooms.Sophisticated photo face detection and video face chaserSophisticated photo face detection and video face chaserUsing a proprietary Sanyo algorithm, the E2 automatically compensates for distracting up-and-down or side-to-side camera movement, keeping your subject steady and easy to follow. It accurately distinguishes between unintentional camera shake and deliberate camera movement. This handy feature operates in both wide-angle and telephoto modes, giving every shot a solid, professional-looking feel. It can detect faces and adjust the focus and exposure accordingly. Faces are sensed even when they move, allowing you to track up to 12 people at once. Automatic exposure is applied according to the area, while automatic focus captures the person at the center of the frame. During playback, you can zoom in and enjoy those facial expressions in detail.Setting the E2 camcorder apart from other video cameras begins insideYou can find an advanced 8.0-megapixel (total) CMOS image sensor inside the E2. The large sensor allows the E2 to capture high-resolution, 8-megapixel still images in addition to recording high-quality digital videos with full-range stereo sound.Record up to a total of 8 hours of full motion videoOr capture up to 2000 8-megapixel still images on a 8GB SDHC memory card, up to 4 hours of video with a 4 GB SDHC memory card, up to 2 hours with a 2GB standard SD card, and up to 1 hours with a 1GB standard SD card.Import files directly into iTunes softwareEasy transfer to your video-capable iPod allows you to share a quick video the next time you are asked how the kids are doing!E2 incorporates a digital image stabilizerShake control mechanismUsed for still pictures, it cancels both rotational blurring that cannot be corrected by optical systems and blurring caused by moving subjects. The E2 also incorporates a digital image stabilizer for videos, which accurately distinguishes between unintentional trembling and intentional camera work such as panning and tilting -- a distinction that some systems have difficulty making -- so that shaking is corrected without sacrificing the natural look of your actual camera work.Ever need to capture still images while you&#x92;re already shooting video?The E2 enables simultaneous shooting of both 8-megapixel still images and 640 x 480-pixel video clips with a simple press of the shutter button during the shooting of a movie clip. You will never need to miss another precious photo opportunity. (Depending on the mode used to take still images, simultaneous video clip shooting may be interrupted. While shooting video clips, using the digital image stabilizer may change the angle of view for still images.)Sequential ShootingThe E2 is capable of high-speed continuous shooting at 5 frames per second (for up to 10 frames) in [2M] mode, ensuring that you won&#x92;t miss that perfect shot. It is also capable of continuous shooting at 1 frame per second (for up to 10 frames) in [8M] mode.E2 is capable of high-speed continuous shooting at 5 FPS5x optical zoom with a bright maximum aperture of f/3.5Consisting of 9 groups and 12 total lenses, the E2&#x92;s lens provides a fantastic field-of-view with a 38-190 mm range (35mm equivalent). Combined with the 12x digital zoom, the E2 provides up to 62.5x zooming capability.Super-fast start-upReduce your chance of missing the moment. The Xacti E2 media camera is designed for super fast start-up and shooting. With the tapeless design, the E2 eliminates the need to queue up a tape deck, allowing the E2 to begin shooting in as little as 1.7 seconds! When the E2 is powered on, closing the LCD display puts the E2 in standby mode. Simply open the display and the E2 automatically powers up and can begin immediately recording in as little as 1.7 seconds.Includes a high-capacity Sanyo brand lithium-ion batteryThe DBL-L20U is a high-voltage, 3.7-volt battery designed to work with the Sanyo Xacti E2 camera. High-energy density design minimizes the battery size and weight, making it perfect for use in small, portable cameras. The DBL-L20 is designed to resist memory accumulation so it provides a full charge every time.Easy playback of recorded video directly on a TVConnect the E2 to a VCR or DVD Recorder to back-up copies of recorded content. Still images and video clips on the Xacti E2 are played back continuously and in chronological order. The Xacti E2 offers convenient connection to a PC. With simple drag-and-drop operation, it's easy to save recorded video clips and still images onto a computer's hard disk for emailing, editing or archiving.Easy video sharingVideo recording on the E2 employs highly efficient MPEG-4 AVC/H.264 compression. This keeps high-quality files small, so you can upload videos to websites and blogs or share them via podcasts or online social networks. Conveniently, these video files don&#x92;t require format conversion before being uploaded to websites. If you know that you are filming for your blog, you can record at a smaller file size that's suitable for website use. You can then upload the file as-is, without needing to resize it.On or off, the E2 is a true work of art Ergonomically designed to fit comfortably in the palm of your hand, most video and still functions can be easily accessed with the thumb of the hand used to hold the camera. Available in Blue and White and the E2&#x92;s design is likely to get as much attention as your videos.", "title": "Sanyo Xacti VPC-E2 Digital Camcorder and 8 MP Digital Camera (White)", "price": 17.12, "salesRank": {"Camera &amp; Photo": 14003}, "imUrl": "http://ecx.images-amazon.com/images/I/41KHEEnm%2BnL._SX300_.jpg", "related": {"also_viewed": ["B00AW54ZGS", "B00AW54ZF4", "B003M11CCO", "B0030MITDK", "B0072EW7KI", "B000QSNQ9S", "B0036TH80M", "B005AJ16WM", "B007KSXXP4", "B009GLINO4", "B0090EC5MS", "B007JRB0SS", "B007JRB0RE"], "buy_after_viewing": ["B003VNKNF0", "B00AW54ZGS", "B001S0PWWC", "B004W98Y2G"]}}