{"asin": "B001EQ4BVI", "description": "Canon&#x92;s new EOS 50D bridges the gap between the novice and the seasoned pro with a perfect combination of high-speed and quality. It features an APS-C sized 15.1-megapixel CMOS sensor for tremendous images, new DIGIC 4 Image Processor for fine detail and superior color reproduction, and improved ISO capabilities up to 12800 for uncompromised shooting even in the dimmest situations. It features a refined 3.0-inch Clear View LCD (920,000 dots) monitor, supercharged Live View Function with Face Detection Live mode, plus a number of new automatic Image Correction settings and HDMI output for viewing images on an HDTV. Pick up the EOS 50D and you&#x92;ll experience true digital inspiration!Canon EOS 50D Digital SLR HighlightsNew 15.1-megapixel CMOS sensor with improved noise reductionThe EOS 50D features a newly-designed 15.1-megapixel APS-C sized CMOS sensor which is capable of recording up to 4752 x 3168 pixels with full 14-bit A/D conversion for extremely fine tonal gradation. Ready to capture images in an instant, the sensor is designed to work with Canon&#x92;s EF and EF-S lenses with a conversion factor of 1.6x. It&#x92;s capable of recording at sensitivities previously too noisy for shooting in low light or subjects in motion. With a maximum ISO rating of 12800 combined with a 4-level High ISO speed noise reduction function, images that would have been impossible without the use of a strobe or flash become simple to record.Capture up to 6.3 fps, in bursts of up to 90 JPEGsNext generation DIGIC 4 Image Processor for faster processingThe EOS 50D operates with such effortless speed that operation is nothing short of intuitive. With instant startup times, speedy autofocus and minimal shutter lag, the EOS 50D is one of the fastest cameras available today. It can shoot up to 6.3 fps, in bursts of up to 90 JPEGs (using an UDMA CF card), 60 JPEGs (using a CF card) consecutively or 16 RAW files, so you&#x92;ll never, ever miss a shot.DIGIC 4 Image ProcessorThis next generation DIGIC 4 Image Processor offers finer details and even more natural color reproduction, compared with the previous DIGIC III Image Processor. Since Canon&#x92;s DIGIC 4 chips use advanced signal processing technologies, they provide even faster operations, including write times to UDMA cards. It also enables Face Detection Live mode to detect and focus up to 35 face(s) to capture the best possible shot. Further, DIGIC 4 offers the improved Auto Lighting Optimizer that corrects brightness and contrast automatically, and Peripheral Illumination Correction for up to 40 EF lenses. DIGIC always maximizes performance between the capturing and recording stages of digital photography.3.0-inch Clear View LCDThe EOS 50D features a bright, high resolution, 3.0-inch Clear View LCD monitor with 920,000 (dots/VGA) pixels and a broad viewing angle of 160 degrees horizontally and vertically. It offers a brighter and more detailed display than the EOS 40D, includes a new smudge-resistant coating, and is perfect for accessing camera settings like ISO, Metering modes AF Point selection and flash options. Plus, it&#x92;s superb for reviewing, editing and deleting photos or composing new images in Live View Function.Live Face Detection Mode AFEnhanced Live View shooting includes Face Detection Live modeThe EOS 50D features Canon&#x92;s most advanced Live View shooting thanks to the number of focusing modes available including Quick mode, Live mode and Face Detection Live mode. You can zoom in and navigate the composition 5x or 10x normal size, enabling critical focus. There&#x92;s even 2 overlay grid options, perfect for lining up vertical and horizontal lines. In the studio, the camera can be controlled remotely with Live View Function when the camera is connected to a computer through a USB cable, or wirelessly if the optional Wireless File Transmitter WFT-E3A is used.9 cross-type high-precision sensors for accurate target subject acquisitionThe EOS 50D has a high-precision 9-point wide area AF that uses cross-type points at f-stops of f/5.6 or faster, enabling the camera to focus faster, more accurately, and in difficult lighting situations. AF sensitivity is a stunning EV-0.5 to EV18. Adding to this AF performance, the EOS 50D incorporates a diagonally mounted cross-type sensor that is sensitive to both vertical and horizontal lines at f/2.8, perfect for enhanced operation in dim light. The EOS 50D has a number of focus modes, including One-Shot AF, AI Focus AF and AI Servo AF.New Lens Peripheral Illumination Correction settingCanon&#x92;s exclusive Lens Peripheral Illumination setting takes into account any light falloff in the corners of the frame and corrects it, making for a perfectly exposed image. Correction data are detected automatically on a number of Canon EF lenses and can be entered manually through included the Canon EOS Utility software.Updated EOS Integrated Cleaning SystemThe EOS 50D&#x92;s Self Cleaning Sensor Unit eliminates stray dust that enters the camera when changing a lens or when out in the field. The sensor&#x92;s IR-cut/Low-pass filter cleans itself automatically with ultrasonic vibrations every time the camera is turned on or off and features a new flourine coating to minimize dust adhesion. Dust missed by the cleaning unit is captured by Canon&#x92;s Dust Delete Data Detection software and can be erased from the image file.Self Cleaning Sensor UnitSelf Cleaning Sensor UnitA key element of minimizing dust is preventing it from clinging to the front surface of the imaging sensor. To combat this, the EOS 50D features a Canon-designed Self Cleaning Sensor Unit. The low-pass filter at the front of the sensor shakes off dust automatically with ultrasonic vibrations, removing dust from the sensor assembly. The EOS 50D also has a coating on the front surface of the low-pass filter, to increase its resistance to dust sticking to the sensor.Dust Delete Data DetectionDust Delete Data DetectionDust that may still remain on the front of the sensor can also be erased with software included in Digital Photo Professional (DPP) Version 3.3 or later software. A simple test shot of a plain, white object can be taken, using a menu setting. This Dust Delete Data image is analyzed in-camera, and the location and size of any remaining dust is added to any subsequent pictures taken. This data is transmitted along with the image, whether JPEG or RAW, and can be either manually or automatically erased in Canon&#x92;s DPP software. This added software option ensures the cleanest possible image, perfect for printing or archiving.Creative Auto goes a step beyond full auto with on screen setting displayThe EOS 50D has a new Creative Auto mode and a quick control screen that helps novice users narrow the gap between fully automatic and manual control. While the camera will remain by default in fully automatic mode, frequently changed settings like flash, exposure compensation, image quality and more are all accessible through one easy screen interface designed for intuitive, quick action. A provided shooting guide serves as a quick-reference for on-the-fly operation.HDMI output for displaying full high-resolution images on a HDTVThe EOS 50D includes a new HDMI (High Definition Multimedia Interface) output device that enables High Definition display of your photographs on any HDTV with HDMI ports. It&#x92;s remarkable to behold the details of your photographs in Full HD, and it&#x92;s easy with the EOS 50D. Resolution is set automatically to match the TV to which you&#x92;ve connected, and images are displayed in a full-frame 3:2 ratio with blacked out bars to the left and right of the image.Compatible with over 60 Canon EF/EF-S lenses and most EOS System accessoriesEF & EF-S LensesThe EOS 50D is compatible with all Canon lenses in the EF and EF-S lineup, ranging from ultra-wide angle to super telephoto lenses. Canon lenses employ advanced optical expertise and micron-precision engineering to deliver unprecedented performance in all facets of the photographic process. Special optical technologies, such as Aspherical, ultra-low dispersion, or fluorite elements are featured in the universally acclaimed L-series lenses. And Canon's Optical Image Stabilizer technology is featured in select lenses to minimize the effect of camera shake. Through Canon lenses, photographers can truly maximize the quality and liberating performance of the EOS 50D.Flash PhotographyThe EOS 50D features the acclaimed E-TTL II flash metering system. With any of the flashes in the EX Speedlite line, E-TTL II provides reliable flash output whether shooting fill-in flash pictures in sunlight, or using flash in total darkness. With E-TTL II, the exact same 35-zone metering sensor used for measuring ambient light is also used for flash metering--giving even finer metering command of the image area. If you prefer a broader area for flash metering, there's a menu setting to change to \"Average\" flash metering--where the entire 35-zone area is measured evenly for flash exposure.SoftwareCanon EOS Digital Solution Disk (Version 17.0)The EOS 50D comes bundled with an updated Canon EOS Digital Solution Disk, which features powerful software programs designed to extend the EOS experience to the computer. These include Canon's EOS Utility (Version 2.5), Digital Photo Professional (Version 3.5), ZoomBrowser EX for Windows (Version 6.2), ImageBrowser for Macintosh OS X (Version 6.2), the Picture Style Editor (Version 1.4), PhotoStitch (version 3.2), WFT Utility (version 3.2). Each application is designed to perfect the captured images and streamline the digital workflow.EOS Utility (Version 2.5)for Macintosh or Windows handles the connection between the camera and computer, whenever they&#x92;re connected via USB. It allows remote controlled shooting from the computer, handles downloading of images from the camera to the computer, and allows seamless linking to either Canon&#x92;s ZoomBrowser/ImageBrowser or Digital Photo Professional software once images have been copied to the hard drive. Furthermore, it&#x92;s used to upload settings back into a USB-connected camera.Digital Photo Professional (Version 3.5)is an image processing program that enables high-speed RAW image processing, high-speed previewing for real-time image adjustment and support for sRGB, Adobe RGB and Wide Gamut RGB color spaces. Because it&#x92;s CMS (Color Management System) compatible, Digital Photo Professional allows for easy image layout and printing in Adobe RGB in conjunction with Easy-PhotoPrint and PictBridge printers. It also features the Dust Delete Data Detection tool for cleaner images.ZoomBrowser EX (Version 6.2)for Windows and ImageBrowser (Version 6.2) for Mac OS X are the easy, user-friendly options for viewing and editing of JPEG and even RAW image files. Both allow viewing of numerous types of images including finished TIFF and BMP files. Both also have a variety of search options for finding images, allow re-naming of single images or batches of files, and offer a variety of options for printing without using a separate image-editing program.Picture Style Editor (Version 1.4)Canon&#x92;s Picture Style Editor enables photographers to create custom Picture Style profiles that can be used to customize the appearance of JPEG and RAW images captured with EOS Digital SLR cameras. Picture Style files created with Picture Style Editor can be loaded into the EOS cameras that support Picture Style and may also be used when processing RAW images in Canon software applications Digital Photo Professional, ZoomBrowser EX (for Windows) and ImageBrowser (for Mac).", "title": "Canon EOS 50D DSLR Camera (Body Only)", "imUrl": "http://ecx.images-amazon.com/images/I/51gowkaFJ7L._SY300_.jpg", "related": {"also_bought": ["B003MACYGS", "B000BNY64C", "B009JCL55Y", "0470455594", "B001IMPVEE", "B0009B05H8", "B00065ANY2", "B00006I53S", "B005DECJBQ", "B001G9TYHE", "B00007E7JU", "B002WE4H8I", "B003CIBC36", "B000V5K3FG", "B001FO4QHI", "B0014YZH9A", "B001NS0OZ4", "B000U92PHW", "B005IMFX2K", "B000EXR0SI", "B000V5P90K", "B0001GMIOE", "B0093HGD2K", "B00005K47X", "B005EVPZJQ", "B002NO7Q26", "B00009XVCZ", "B003CQD3B2", "B000AZ57M6", "B001G4QXLE", "B0093HGDVG", "B0013LRSRS", "B002TXJUJ8", "B001NXDB4A", "B002N694A6", "B002WE2PW8", "B0079M711S", "B002YVRGPA", "B003PYJA7W", "B000W05O5O", "B009JS61MK", "B008UGMLWQ", "B0013DG08E", "B00009R6VZ", "B00554PCDG", "B0011NVMO8", "B00065ANYW", "B0002Y5WXO", "B004M170YC", "B0056TYRMW", "B000W0BC7I", "B00FSJAWTC", "B004LEAYXY", "B00844N5OC", "B00004ZCJL", "B00603RTCI", "0321613112", "B0002XQI2E", "B003A6H27K", "B0030UL7IG", "B003DWON9Q", "B0007Y791C", "B002K42W50", "B0081EC08M", "B0007WK8KS", "B0049HCSM8", "B005OUUFGK", "B002VPE1WK", "B001LMQM3U", "B003TYDBYQ", "B0000A1G05", "B005JV06QI", "B00009R6TA", "B0092F974E", "B00EJ8CKPC", "B002ODISD2", "B00004ZCJM", "B002ZIMEMW", "B00CV9MMUE", "1598639048", "B00894YP00", "B001CCAISE", "B0001G112O", "B002NEGTTM", "B000TQPTTM", "B00009XVCU", "B003Y60DZO", "B003Y2GTG0", "B0051XDOZO", "B001ET6QFY", "B00BXA7N6A", "B00004ZCJG", "B001D60LG8", "B00A2BWBNQ", "B003Y30334", "B0007WK8MQ", "B003EB0AXY", "B002K450RM"], "bought_together": ["B000BNY64C", "B003MACYGS"], "buy_after_viewing": ["B000BNY64C", "B0040JHVCC", "B000V5P90K", "B00007E7JU"]}, "salesRank": {"Camera &amp; Photo": 1344}, "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]]}