{"asin": "B000EN0K94", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The PowerShot SD700 IS Digital Elph sets a new standard. The first Digital Elph equipped with Canon's Image Stabilizer technology, its sleek, tri-color body is loaded with high-end features that make taking great pictures more stylish and convenient than ever.Get close, stay steadyEngineered with Canon's sophisticated Image Stabilizer technology, the SD700 IS Digital Elph gives you the \"shake-free\" performance that makes your pictures sharp and clear. No matter how close you zoom in, the SD700 IS Digital Elph keeps everything stable. All you have to think about is your subject.High performance, high styleThis is a camera that could make it on looks alone. But wait until you see its performance. The 4x optical zoom brings you in for intimate close-ups. The 6.0-megapixel CCD produces images of impressive quality with resolution that lets you create big prints.Canon innovation enhances your experienceThe PowerShot SD700 IS Digital Elph features new ISO 800 and High ISO Auto settings that reduce the effects of camera shake and sharpen subjects in low-light situations, giving you greater flexibility for shooting.Advanced imaging technology improves every photoDIGIC II Image ProcessorCanon's DIGIC II Image Processor is designed to improve processing speed and image quality, so DIGIC II provides markedly faster startup, autofocus, and playback, plus it assures that every image is more colorfully vibrant.iSAPS TechnologyiSAPS Technology is an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the fast DIGIC II Image Processor to improve focus speed and accuracy, as well as exposure and white balance.Shoot and view wide imagesThe PowerShot SD700 IS Digital Elph includes a 16:9 widescreen resolution option, producing images and film clips that are perfect for your widescreen TV or computer monitor.Superior movie qualityFast Frame Rate Movie Mode allows you to record extremely smooth, full-motion movie clips for up to one minute  in QVGA at 60 frames per second (fps) (320 x 240 pixels). With a highly flexible movie mode, you can create the movie that's perfect for any application. Select from VGA (640 x 480 pixels) and QVGA (320 x 240 pixels) with frame rates of 30 fps and 15 fps for recording up to one hour or 1 GB. Plus, Compact Movie Mode (QQVGA; 160 x 120 pixels) records at 15 fps for up to 3 minutes.Shooting ModesAdvanced presets for the best possible photos under certain conditionsAuto: The camera chooses all the settings so you can concentrate on your subject.Manual: The ultimate in creative control, you set ISO speed, exposure compensation and white balance.Portrait: The camera sets a large aperture, focusing the subject and artistically blurring the background to make your subject \"pop.\"Foliage: Capture brilliant shots of autumn foliage, greenery and blossoms.Snow: Shoot clear snow scenes without darkened subjects or an unatural bluish tint.Beach: Get clear shots of people at a sunny beach without darkened faces.Fireworks: Grab brilliant images of skyrocketing fireworks.Underwater: Capture underwater images with reduced backscatter effect. (Note: Optional Waterproof Case WP-DC4 required for shooting any underwater images)Indoor: Reduce blur and improve color accuracy when shooting handheld indoors.Kids and Pets: Reduced focusing time freezes fast-moving subjects, so you won't miss those special shots.Night Snapshot: Get natural-looking pictures with brighter backgrounds and subjects lit by flash.Color Accent: Choose to retain a single color in your image while other colors turn monochrome.Color Swap: Select a color and replace it with a color you specify for special effects.Digital Macro: Shoot larger-than-life close-ups with one-button simplicity.Stitch Assist: Build awe-inspiring panoramas by neatly aligning sequential images.My Colors&#160; &#160; &#160;Vivid: Yield vibrant shots with dramatic high-contrast.&#160; &#160; &#160;Vivid Blue: Emphasize the sea, sky, and other blue areas.&#160; &#160; &#160;Vivid Green: Add vivid dimension to greens for extraordinary nature shots.&#160; &#160; &#160;Vivid Red: Charge up red objects in your images for extra impact.Neutral: Produce images of subtle, elegant tonality.Sepia: Recreate the look of vintage photographs.Black and White: Deliver enhanced clarity--especially useful when shooting text.Positive Film: Combine \"Vivid Blue,\" \"Vivid Green,\" and \"Vivid Red\" to achieve a positive film effect.Lighter Skin Tone: Make your subjects' skin tones lighter.Darker Skin Tone: Darken skin tones a shade.Custom Color: Finely adjust brightness and vividness, and set your preferred balance of blue, green, red, and skin colors.The complete print solutionThe PowerShot SD700 Digital Elph's Print/Share button makes direct printing easier than ever. Simply connect the SD700 to a Canon CP, SELPHY, or PIXMA Photo Printer or any PictBridge-compatible photo printer, press the lighted Print/Share button, and print! Also use the Print/Share button to transfer images to a computer (Windows and Macintosh).Connect the USB interface cable to your Canon digital camera and a PictBridge compatible photo printer. Press lighted Print/Share button. You'll have long-lasting, professional-quality prints in minutes.Print your own ID photos in 28 different sizes or use the Movie Print function to output multiple stills from a recorded movie on a single sheet with a Canon SELPHY Compact Photo Printer. (Printers not included--must be purchased separately.)What's in the BoxPowerShot SD700 IS body, Lithium battery pack NB-5L, battery charger CB-2LX, SD memory card SDC-16M, wrist strap WS-700, Digital Camera Solution CD-ROM, USB interface cable IFC-400PCU, AV cable AVC-DC300", "title": "Canon PowerShot SD700 IS 6MP Digital Elph Camera with 4x Image Stabilized Zoom", "price": 299.0, "salesRank": {"Camera &amp; Photo": 9567}, "imUrl": "http://ecx.images-amazon.com/images/I/41J33D7SC3L._SX300_.jpg", "related": {"also_viewed": ["B000EVS4YE", "B000EMWBT2", "B001SER48S", "B000Q30420", "B0011ZK6PC", "B00I58M26Y", "B000NK8EWI", "B0012YC7AE", "B001SER492", "B000ENPDSW", "B00I58M2VE", "B000EMWBV0", "B000NK6J6Q", "B000NK8L6W", "B000NK6INU", "B001SER47Y", "B0007TJ5AK", "B00HLDFPA4", "B000EVQ0PO", "B00AWYN0BU", "B006UMM1AY", "B0012Y6AY8", "B0075T7NW2", "B001SER47O", "B006UMM1UO", "B001SER46A", "B00B5HE3YG", "B004J41T7Q", "B000AYKUUQ", "B00AWYMXZY", "B005II5OLY", "B000V1VG2O", "B00EFILNV8", "B00BOZ1XA6", "B00HLDFNKQ", "B0007TJ5OG", "B00I58M192", "B004J3V8UU", "B00B5HE3UU", "B003966MRM", "B00AWYN182", "B005MTME3U", "B00B5HE45E", "B00B5HE32I", "B001G5ZTWM", "B00B5HE3IW", "B0001G6U5W", "B0035FZJJ4", "B00HLDFQU8", "B001G5ZTN6", "B00AWYN0ME", "B0035FZJKI", "B006UMM1F4", "B00065L5TE", "B00IGFFZR4", "B000TM7GD8", "B005AVMFTI"], "buy_after_viewing": ["B000EVS4YE", "B000FGNM6I", "B000EMWBT2", "B003VNKNEQ"]}}