{"asin": "B002PAR0AQ", "description": "The Belkin Easy Transfer Cable for Windows 7 has you covered when it's time to migrate from a PC running an older version of Windows to a new computer running Windows 7. Don't worry about losing any of your personalized settings, important files, music or treasured family photos. With the Easy Transfer Cable, you'll be able to quickly and seamlessly migrate your data and user settings in a fast, easy, and user-friendly way.Easy Transfer CableSystem Requirements:Destination PC with USB port running Windows 7 (32- or 64-bit)Source PC with USB port, 40MB hard-disk space, and CD-ROM drive running Windows XP SP2 (32- or 64-bit) or Windows Vista SP1 (32- or 64-bit)LEDs on the cable give you status updates at a glance.View larger.Migrate to Windows 7 the easy way.View larger.Migration/Transfer Compatibility:XP SP2 32-bittoWindows 7 32-bitXP SP2 32-bittoWindows 7 64-bitXP SP2 64-bittoWindows 7 64-bitVista SP1 32-bittoWindows 7 32-bitVista SP1 32-bittoWindows 7 64-bitVista SP1 64-bittoWindows 7 64-bitWindows 7 32-bit&nbsp;toWindows 7 32-bitWindows 7 32-bit&nbsp;toWindows 7 64-bitWindows 7 64-bit&nbsp;toWindows 7 64-bitMigrate to Windows 7 the Easy WayThe Easy Transfer Cable was officially designed for the Microsoft Windows Easy Transfer utility, which is featured in Windows 7. All you need to do is connect the cable to USB ports on your old Windows XP or Vista computer to your new Windows 7 machine, and run the utility.Easily Transfer User Accounts, PC Settings, Files, and MoreYour user accounts, Windows settings, files and folders, pictures and photos, MP3s and other music, videos, program settings and program data, and e-mail messages, settings, and contacts will all be transferred over to your new computer without a fuss.  Thanks to the \"Map User Accounts\" feature, the destination PC is not required to have matching User Accounts. Gone are the days of losing important email messages or having to reset all your user settings!Once the transfer done, a post migration report is generated, which gives you a comprehensive view of everything that was transferred. Because of possible incompatibility issues, programs and applications are not transferred to the new computer. Instead, the utility provides a list of all the programs and applications that were installed on the old PC along with links to the latest versions of the programs if they are provided by the software developer.Eight-foot USB 2.0 Cable with LED IndicatorsThe Easy Transfer Cable is eight feet long and has two auto-speed selectable, USB type-A male connectors. The USB 2.0 Hi-Speed cable provides transfer speeds of up to 480Mbps and is fully backward compatible with USB 1.1. LEDs on the cable lets you quickly know that the transfers have begun.What's in the BoxBelkin Easy Transfer Cable, Driver CD, Product guide.Ensure that you don't lose any files or data when you migrate to Windows 7", "title": "Belkin Easy Transfer  (F5U279)", "price": 19.95, "imUrl": "http://ecx.images-amazon.com/images/I/3174DME4hUL._SY300_.jpg", "related": {"also_bought": ["1936220016", "B0093HCIQ0", "B004GIGNVC", "B008MR37XK", "B005OTPVMY", "B00I0MKP2I", "B0030F2U9G", "B00FU83YWS", "B00HSEW02C", "0470497432", "B004BU8O9Y", "B003VTZ070", "B001BPII48", "B00HEYVAN6", "B0002ZWGT6", "0596806396", "B000UX21PY", "B000Q6ZK3K", "B00E83X9P8", "B00C2H2VQA", "B005HARR2W", "0470523980", "B0087OV77G", "B00D78PZE8", "B0025VKUPW", "B001TH7GV4", "B004TXPWV6", "B004SUILFO", "B00EZPXYP4", "B00E3RH63A", "B00000JRRD"], "buy_after_viewing": ["B005OTPVMY", "B0093HCIQ0", "B007XZXUIY", "B004GIGNVC"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Cable Adapters"]]}