{"asin": "B00HBYKVA2", "related": {"also_bought": ["B00IKCQ0EK", "B00GANEE1C", "B0087NZ31S", "B00E98O7GC", "B0067TYD6A", "B00DR0PDNE", "B00AWRUICG", "B00CQJUT9U", "B000FNFSPY", "B00004Z5H3", "B00416Q5KI", "B0052SCU8U", "B00794RDVY", "B000E8DMU8", "B003L1ZYYM", "B00B46XUQU", "B004KABG1S", "B00316263Y", "B00A3YN0Z0", "B00000J1V5", "B009QZH7BU", "B007I5JT4S"], "bought_together": ["B00DR0PDNE"], "buy_after_viewing": ["B00E98O7GC", "B00IKCQ0EK", "B0087NZ31S", "B00GANEE1C"]}, "title": "Sabrent Wi-Fi Range Extender 300mbps 2.4GHZ 801.11N Multifunction Mini Router / Repeater / Access Point / Client / Bridge - Wall Plug Version (WR-WN300)", "price": 42.95, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41k%2BZfdjwML._SY300_.jpg", "brand": "Sabrent", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Repeaters"]], "description": "The Wireless Mini Router includes different modes to utilize whatever  needs you may have for your network. It has the speed and wireless range  to power multiple devices. Exclusively integrates four operating modes  (Router, Repeater, AP, &amp; WISP), easy setup to manage with any  network. Supports high-bandwidth applications such as online gaming,  VoIP, and video streaming. Wireless speeds up to 300Mbps and two  10/100Mbps LAN ports. Perfect for Business or Entertainment purposes.  Supports the newest 802.11b/g standards.Features:Router Mode:Functions as a router, connects to Internet provided by your ISP and  broadcasts a wireless signal that allows creation of your own network.Repeater Mode:Connects to your existing network and extends your wireless signal  comprehensively. Valuable if you have weak connection in any area far  away from your router.Access Point Mode:Creates a  wireless connection from a wired source in Access Point mode. If only an  Ethernet port or cable is available, the router will connect via  Ethernet and broadcast a wireless network compatible for any devices to  use.WISP Mode:Connects to an existing wireless  network and rebroadcast it under any new name; useful for creating  public hotspots or organizing different users on your network into  separate connections.What&rsquo;s in the box?* Sabrent Wireless Mini Router,* LAN Cable,* Installation GuideWarranty:This  product comes with a 1 year manafacture warranty. In order for us to  properly assist you, please follow these simple instructions: Go to  www.sabrent.com/support and click 'Submit a ticket'.Submit your ticket.You must include your Amazon Order ID# number in the subject line."}