{"asin": "B001F50UHM", "description": "Take your entertainment with you. Featuring a new compact and slim design, the NWZ-E436F 4 GB Walkman video MP3 player provides up to 45 hours of continuous music and up to 8 hours of uninterrupted video while offering support of multiple audio codecs and video formats. You even can listen to your favorite FM programming, thanks to a built-in FM tuner. View pictures or watch your favorite movies in vivid detail on the 2-inch QVGA high-brightness, color LCD (measured diagonally). Easily load your music, pictures, and video by dragging and dropping them into the video MP3 player on your computer. Headphones, CD-ROM, and USB cable are included. This MP3 player is available in black, red, blue, and pink.Listen to your favorite tunes, view pictures, or watch your favorite movies in vivid detail on the 2-inch QVGA high-brightness, color LCD (measured diagonally).Includes headphones and quick start guide.Available in black, red, blue, and pink.Long Battery LifeEquipped with a long-lasting battery that enables you to listen to up to 45 hours of music and watch up to 8 hours of video without needing to recharge. Plus, 4 GB of built-in memory stores up to 925 songs or 15 hours of video.Compact and Slim DesignMakes carrying your video MP3 player wherever you go a breeze. The 2-inch high-brightness color LCD provides a rich viewing experience on your video MP3 player.Multiple Video FormatsThis player supports multiple high-quality video formats (AVC (H.264/AVC), MPEG-4, and WMV2, as well as a variety of audio codecs (MP3, WMA, AAC-LC 3, and L-PCM), giving you more freedom to download the kind of music and video that you want. Plus, it works with Windows Media Technology (WMT), which lets you manage your music the way you want.Drag and Drop FunctionalityEasily load your music, pictures, and video onto this player by dragging and dropping them into the video MP3 player on your computer.What's in the BoxSony 4 GB Walkman MP3 Player (Black), Headphones, Quick Start Guide, USB to WM-Port, Limited Warranty, CD-ROM (Microsoft Windows Media Player 11, \"Napster,\" \"Content Transfer,\" \"Operation Guide\")", "title": "Sony 4 GB Walkman Video MP3 Player NWZ-E436F (Black)", "price": 34.99, "imUrl": "http://ecx.images-amazon.com/images/I/41f6shSvw9L._SY300_.jpg", "related": {"also_viewed": ["B00EE1H7BQ", "B00ECRRB8G", "B00ECRPOKS", "B002IPHA3U", "B008V998MI", "B005EQS8RM", "B00ECQUY2M", "B000VAH8OU", "B00ECRRWTE", "B009RQW3BC", "B0085YLBVK", "B009RQEDXS", "B00FF071RK", "B0076HNNHM", "B002IPHA1W", "B00HLTIUV4", "B00FF07HFQ", "B005EQSA9S", "B003Z3NGTG", "B005EQSA9I", "B005ER3SCG", "B005FPT5DS", "B007V7XQ7E", "B0074FU2DO", "B005EQSB2E", "B009JXJJK6", "B008V99972", "B005N279LI", "B00ICI7IXE", "B0058TKZZS", "B002MAPT7U", "B00KPM2RIG", "B007B5TOJK", "B005FVNGRS", "B003D2FOOE", "B007B5TOZY", "B00IBR5QJY", "B0041MMMWW", "B0035P4C06"], "buy_after_viewing": ["B002MAPT7U", "B00EE1H7BQ", "B005N279LI", "B009RQW3BC"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}