{"asin": "B003VTZE4Y", "related": {"also_bought": ["B002YEUBEK", "B004L4JVHE", "B002HJ9PTO", "B000SIFHZM", "B004IRTMRS", "B003VNKNF0", "B001R6SRMO", "B00BV9ZQKS", "B002FECHQ4", "B003VKR8O2", "B001KW1VEQ", "0300099479", "B001C1PQO6", "B00DQYAKYS", "1571109668", "0516460366", "1606238531", "0674645111", "B004FLL5AO", "B00006HOLL", "B00F0XQWUO", "B004GJ0FGU", "0205573525", "B006L6ZU84", "B003VNKNEQ", "B003N65X28", "B007JRB0RE", "0325046557", "B00F0XS1V2", "B0058MJX4O", "1889609110", "B004IZR858", "0064451666", "B003L139HG", "B000O7AW98", "B001207YMY", "B003VKYQQA", "B004ZGN6MY", "B00F0XRFAK", "B008YK74MU", "B00006I523", "1571103899", "B009R5F5IQ", "189298959X", "B00007E8D2", "B000JC8WYA", "0763646113", "B00006HO3R", "B000EVSLRO", "B005FDJC6K", "B008YE0HAW", "B0045TFBBK", "B002DUCRXS", "0316133760", "B0007L8BQW", "B004KU4BWY", "B004YKDOC8", "B000815CF4", "B000MYPPPE", "B001AW8W7A", "B002HJ61PK", "B00E9JIZJ6", "0688114490", "B004YM4HGS", "B00B7ID97A", "B002ONSZPI", "B008BOSOEG", "B007JRB0TC", "B00272MT3A", "B005KP473Q", "B004ZGLM5W", "B00006IDP4", "B000V7AF8E", "B001S0PWWC", "B00009UT28", "0415947472", "B004FLL5AE", "B00B7ID99I", "B0036UL6OK", "B00869KUHK", "B007JRB0SS", "B004IRUJIE", "1118512316"], "bought_together": ["B003VNKNF0"], "buy_after_viewing": ["B003VNKNF0", "B006L6ZU84", "B002HJ9PTO", "B000SIFHZM"]}, "title": "Kodak PlayTouch Video Camera (Black)", "price": 169.95, "salesRank": {"Camera &amp; Photo": 1079}, "imUrl": "http://ecx.images-amazon.com/images/I/315nO8QuhJL._SY300_.jpg", "brand": "Kodak", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "Touch the Beauty of HD Video.With its unique touchscreen, the Kodak PlayTouch lets you glide through full 1080p HD video like never beforeGo ahead. Touch it. You know you want to. Its unique touchscreen lets you glide through HD video like never before. That's the beauty of the Kodak PlayTouch Video Camera. It puts the high-end features you want right at your fingertips. With on-screen editing, you can easily keep the moments you want and trim the ones you don't. And when you're ready to turn today's escapades into tomorrow's buzz, getting them online is easier than ever. Just press the Share button and your videos are automatically ready for the Web. With the Kodak PlayTouch Video Camera, the power to be seen is as simple as touching a screen. The real Kodak moment happens when you share.One-button upload&mdash;turn moments into memoriesWith the Share button and Kodak's Share button app, sharing your pictures is amazingly simple.Record your video or snap your picturePress the Share button and tag it to Kodak Gallery, YouTube, FaceBook, FLICKR, and ORKUT sites, plus e-mail tooConnect your PlayTouch to your computer, and with Kodak's Share button app, your videos and pictures are automatically uploadedYour pictures and videos are also automatically transferred to your computerTurn Today's Escapades into Tomorrow's Buzz&mdash;in HDThe bright 3.0 in. capacitive touchscreen LCD is optimized for reviewing in landscape mode to give you the ultimate 1080p HD video-sharing experienceThere's always room for more&mdash;record up to 10 hours of HD video with expandable SD/SDHC card slot (up to 32 GB)[1]The Power to Edit in the Palm of your HandThe Kodak PlayTouch features on-camera editing capability, so you can fine-tune your footage, cut out what you don't want, or extract still images from videoWhen you're ready to upload, just press Share, choose your destination, pop out the USB arm, and you're good to goYou're the DirectorChoose the video quality that works for you:Full 1080p HD at 30 fps720p HD at 60 fps&mdash;great for super-slow-motion playback720p HD at 30 fpsWVGA at 30 fps&mdash;good for smaller filesYou can even take 5 MP HD still picturesDefine your style with four (4) capture effects, including black and white, sepia, high saturation, and 1970's film lookCatch the highlights with slow-motion playback right in the palm of your handRecord from a distance or play back on your TV conveniently with the optional remoteDon't Let Sun Glare Ruin your RecordingSimply use your camera settings to turn on the LCD Glare Shield featureLCD Glare Shield feature gives you two filters to choose from that help you see your subject on the display screen in reflective outdoor situationsThese filters are only applied to your display screen, not your footage, so everything you record will look as great as the moment you shot itSmooth, Stable, and Always AbleGet sharper videos and less blur thanks to built-in digital image stabilizationCapture your friends in their best light with smart face tracking technologySee more details and accurate colors with incredible low-light performanceReady for the Big Screen&mdash;Right out of the BoxBuilt-in USB arm makes it easy to debut your videos on your computer and automatically e-mail or share to your favorite siteCapture more moments thanks to the rechargeable Li-Ion battery with in-camera chargingIt doesn't matter if you own a MAC or a PC&mdash;the Kodak PlayTouch is compatible with bothComplimentary HDMI cable lets your videos debut in full glory on your HDTVPeace of Mind when You're Showing OffSafe Mode protects your videos and settings while you let others enjoy your PlayTouch&mdash;it allows the user to take and review videos and pictures, but edit, share, and delete functions are disabledSafe Mode also locks many of your settings, so until safe mode is turned off they cannot be changed during useBe Creative with Great Video SoftwareEdit and trim videosAdd a voice-over to narrate your footage when editing on a PCAdd pictures and music to your videos to make cool mash-upsGrab and edit still images from video frames to get that perfect shotShoot, Watch, and Share 1080p HD Video Right out of the BoxKodak PlayTouch Video CameraKodak Li-Ion Rechargeable Digital Camera Battery KLIC-7004USB cable and adapter for camera chargingHDMI and AV cablesPremium wrist strapCamera pouchUser GuideARCSOFT MEDIA IMPRESSION Software for Kodak (on-camera, PC only)1 Record about 20 min per 1 GB at 720p HD at 30 fps. Actual results may vary."}