{"asin": "B00007KQE9", "description": "There's no logical reason the Dynasty Warriors series has such a devoted fan base. The makers have mined the same plot for four installments, based on the same few heroic tales of ancient China. The dialogue is as stilted as ever, and no real surprises unfold. But think of the zealotry people have for goofy, unrealistic kung fu flicks, and you'll start to see Dynasty Warriors' lasting appeal.If you've never touched an earlier version of the game, here's what to  know:Dynasty Warriorsis a fighting game series played from the third-person perspective, where you pick a military general as your avatar and fight through across sprawling battlefields. The generals all have distinct personalities, and there are a few women characters included, too. As you campaign, you collect special items--such as the Dragon Amulet, which increases your Musou gauge (Musou allows you to enact special, prolonged attacks on multiple enemies.) You have bodyguards, you kill enemy generals, and along the way your new skill points increase your weapon's power.WithDW4, there are many new additions, only some of which are  successful. Charge attacks and items are souped up and truly improved.  For example, equipping a magic orb can cause you to freeze enemies in a block of ice. You can edit characters, but with so many good preset ones to choose from, chances are you won't spend a lot of time working on your own. In addition to a better game engine, there's also the option of one-on-one-duels. The maps are immense compared to previous editions, with a lot more variance in what can happen by the end of your mission.Even with a significant number of new features, it's debatable whetherDynasty Warriors 4is a true overhaul, or just another release to cash in on the massive popularity of the franchise. Regardless, it's addictive for reasons that almost defy explanation. You just want to clear this act, to get to the next stage, and to reveal the goodies you've received from killing that big boss. It's as simple as that. And at the moment when you can knock down an entire platoon with a couple hits, well, then you'll join the ranks of the dedicated.--Jennifer BuckendorffPros:Many more (and much improved) mapsComplex and compelling charge attack functionsImproved fighting AI makes enemies noticeably trickierCons:\"Siege engine\" function mostly a noveltyStill tedious retracing of steps, even with speed bootsDisappointing officer customization", "price": 68.89, "imUrl": "http://ecx.images-amazon.com/images/I/51PhuuCXAaL._SY300_.jpg", "related": {"also_bought": ["B00005RL4E", "B0007QRKA0", "B00004YC3N", "B00009B05O", "B0001Y73WI", "B000ARJI8I", "B0001XASJ4", "B00007KQEA", "B001DTUY6W", "B00104KJ4W", "B000TLU67W", "B000EGDEC6", "B00004YRQ9", "B00005Q8IR", "B000T7P4W8", "B00009VE6D", "B00005J536", "B0002XL3BA", "B000069D39", "B00004YRQA", "B0009O7HVM", "B00005TNI6", "B004HVKA9O", "B0000CDZBC", "B00004U5VI", "B000G82QEO", "9629971372", "B000B69E9G", "B001MW91IW", "B00006GSNX", "B001C3N0QK", "B000066TS5", "B001L8DKIO", "B000G6SPHI", "B0009A4EV2", "B0009I6S0O", "B000935256", "B0009A4EVM", "B0000664JF", "B0013KW1B2", "B00005NCCR", "B000F5IH2I", "B00006GSNZ", "B00IIB2K4C", "B00009WAVI", "B00006F2ZT", "B0001I9YHG", "B0001NE48U", "B0000C7GHG", "B003K18LT8", "B0045L3SNQ", "B000G7YX4G", "B00020LZBG", "B004S3KB6S", "B0009HAYDC", "B00CBNV7UQ", "B0000A0MDV", "B0002IQD1U", "B00004ZDFY", "B00000K2X5", "B0000696CZ", "B000E49SGE", "B00CBNVAE4", "B001CLG6SG", "B000189K3E", "B00005R5PO", "B0002GTFIK", "B0009350BW", "B00009B05M", "B000FDOTIQ", "B00005QIQP", "B00026RFI2", "B00004WKN9", "B00020LZAM", "B00005BR6H", "B000ENW5YW", "B000063RRN", "B0002CHIUQ", "B00005MDZD", "B0002RQ3ES", "B00020LZAW", "B00005NN5G", "B0008GJRRS", "B0009I6S0Y", "B0000A09EM", "B0009351R0", "B00009ZVHY", "B0009O7HVW", "B00009WAVD", "B000EHQDA0", "B0000A8VBZ", "B000099T1Y", "B000RW3V34", "B005DVAB28", "B00004U5VF", "B000099T2E", "B0001A86EG", "B0002CNUN0", "B0009RG8DW"], "bought_together": ["B00004YC3N"], "buy_after_viewing": ["B0007QRKA0", "B00005RL4E", "B004HVKA9O", "B00009B05O"]}, "salesRank": {"Video Games": 10126}, "categories": [["Video Games", "More Systems", "PlayStation 2", "Games"]]}