{"asin": "B0018782QI", "categories": [["Electronics", "Portable Audio & Video", "Radios", "Shortwave Radios"]], "description": "Get even more of your favorite music and news for free! Now with Pandora, Aupeo, Live365 and MP3tunes (sorry, no iHeart radio)! Most people get a WiFi radio so they can listen to their favorite stations with perfect clarity. With the CC WiFi Radio the stations are always clear, no matter how far away they are and you can also be able to pick up stations on the CC WiFi that are difficult to get on a computer. Sometimes you have to register with a station to get their audio stream but the CC Wifi can get your station direct without you having to give out personal information to get it. Whatever your interests are, you can find 10 or maybe 100 times more news and music with the CC WiFi than any other type of radio. For example you have about 500 stations each of Jazz or Classical to choose from. With the radio you can access these stations from any place in the world where high speed internet is available. The CC WiFi has good audio for its size and it can be connected to your stereo system directly for superb audio. CC WiFi Radio is great for World Listening. C. Crane&#x2019;s greatest joy is to hear from someone who has just tuned in a favorite station they grew up with. There are about 12,000 international stations streaming from almost every country in the world. No matter where you are from, no matter what your musical or news preferences are, it is OK to anticipate a smile and continued joy when tuning in \"back home\". Are you learning a language? There is no better way to fine tune your accent than to listen to a station streaming in the language you are learning. Features: 16,000+ available stations, 99 memory presets, remote control, an alarm clock, WiFi Signal Strength Indicator, an Ethernet port for a hard-wire network connection and AC Adapter. Requires a broadband Internet connection. No subscription fee. Detailed instructions are included, but you can always call C. Crane if you have any questions about how to get the most out of your CC WiFi Radio. Uses Reciva technology.", "title": "C Crane Co CWF CC WiFi Internet Radio", "price": 99.95, "salesRank": {"Electronics": 5730}, "imUrl": "http://ecx.images-amazon.com/images/I/41SCSkkPaiL._SX300_.jpg", "related": {"also_bought": ["B000AL6NVO", "B0092TX8Y0", "B005GUQ0FI", "B002O4I1PG", "B006RG23JC", "B0078ZZ5PA", "B004YI9NTS", "B003FBQKZ0", "B004GAKIKW", "B003XU76QK", "B0032CI80W", "B008X1BV9M", "B00ET8FP68", "B004YI9HG2", "B0012R8O1M", "B000SANUA4"], "bought_together": ["B000AL6NVO", "B002O4I1PG"], "buy_after_viewing": ["B004YI9NTS", "B006RG23JC", "B00CSMAHNS", "B006KD37TC"]}}