{"asin": "B001W0XZYA", "categories": [["Electronics", "Camera & Photo", "Accessories", "Batteries & Chargers", "Battery Chargers"]], "description": "Dfx Essentials software allows you to apply the most popular creative photographic filters after you've taken the shot and is available for both Windows or Macintosh users. This software is a selective version of Tiffen's professional award-winning Dfx Creative Digital Effects software. This latest edition to the Tiffen award-winning software line, gives digital camera owners the ability to explore their creative options with an easy to use application that includes a step-by-step on-screen tutorial with audio. Dfx Essentials compliments any digital camera and features a definitive selection of 37 specialized filters and effects with hundreds of built-in presets and the ability to create and save custom versions and custom setups to repeat favorite looks. Dfx Essentials offers the ability to easily create multiple filter and effect layers, color, clone and red-eye removal tools, with non-destructive crop, rotate and scaling. The intuitive filter palette with thumbnail previews makes it simple to evaluate effects before applying the filter to an image. Dfx Essentials is compatible with a wide range of file types including camera raw and final images can be saved in either tif or jpg formats.Minimum system requirements: WindowsWindows XP Pro, XP Home, Vista , Windows 71.0 GHz processor or fasterIntel or AMD processor1GB RAM (2 GB+ recommended)1GB available disk space for caching and temporary filesOpen-GL capable graphics cardDisplay with 1024 x 768 resolution or higher (1280 x 1024 recommended)Three-button mouseMacintoshMac OS X 10.4-10.6Macintosh 1.0 GHz processor or faster PowerPC G5 or Intel processor1GB RAM (2 GB+ recommended)1GB available disk space for caching and temporary filesDisplay with 1024 x 768 resolution or higher (1280 x 1024 recommended)Three-button mouse", "title": "Tiffen Dfx Essentials Creative Digital Effects Software", "price": 12.29, "imUrl": "http://ecx.images-amazon.com/images/I/516wi4i23rL._SY300_.jpg", "brand": "Tiffen", "related": {"also_viewed": ["B001F50EHS", "B0082JW12Q", "B0082JW0WM", "B00DBPKBQO", "B000SKVZOM", "B00AAQXGLE", "B00DBPKAI8", "B009JPEISW", "B00861DI4U", "B00DBPKAAG", "B00FY42JYW", "B00BW6LX20", "B001S2PPT0", "B00BW6LWO4", "B007VGGFZU", "B00007E7JU"], "bought_together": ["B0041RSPRS", "B003VNKNEQ"], "buy_after_viewing": ["B001F50EHS", "B0082JW0WM", "B0082JW12Q", "B0041RSPRS"]}}