{"asin": "B005DIBH10", "description": "Whether you&rsquo;re driving through an unfamiliar city or on your dailycommute, n&uuml;vi 2475LT makes your trip easier than ever before. It  includes FREE lifetime traffic updates&sup1;, advanced lane guidance and  more.Get Turn-by-Turn DirectionsGarmin Guidance 2.0'sintuitive interface greets you with two simple choices: \"Where To?\" and  \"View Map.\" Touch the screen to easily look up addresses and services  and to be guided to your destination with voice-prompted, turn-by-turn  directions that speak street names. It comes preloaded with maps for  North America and Europe. It also includes more than 8 million points of  interest and offers the ability to add your own.Avoid Traffic Tie-upsWith FREE lifetime traffic updates from3D Traffic,  our most extensivetraffic avoidance system, n&uuml;vi 2475LT can help you  avoid delays. We check traffic conditions more than 2 billion times each  month, so you can easily reroute around congestion and arrive on time.Know the Lane Before It&rsquo;s Too LateNow there&rsquo;s no more guessing which lane you need to be in to make an  upcoming turn. Available in select metropolitan areas, photoReal  junction view makes unfamiliar intersections and exits easy to navigate.  When you approach an exit or interchange, n&uuml;vi 2475LT will enter split  screen mode and show you a realistic depiction of junctions on your  route, complete with road signs and arrows that indicate the proper lane  for navigation.Go Beyond NavigationPoint-to-point navigation is just the beginning. n&uuml;vi 2475LT features a microSD&trade; card slot so you can store and use detailedcityXplorer&trade;maps or download custom voices and vehicles for free from theGarmin Garage.  Bluetooth&reg; connectivity lets you make and take hands-free calls and  texts, while dual-orientation functionality lets you hold the n&uuml;vi  vertically or horizontally for added convenience driving or walking.n&uuml;vi 2475LT's \"Where Am I?\" emergency locator provides your exact  latitude and longitude coordinates, the nearest address and  intersection, and the closest hospitals, police stations and more while  Enhanced Exit Services tells you what services you&rsquo;re approaching on the  highway.What's in the Box:n&uuml;vi 2475LTPreloaded City Navigator&reg; NTNorth America(U.S, Canada and Mexico) andEuropeLifetime traffic&sup1; (indicated by \"LT\" after model number on the box)3D traffic receiver with vehicle power cable (vehicle power cable is also traffic receiver)Vehicle suction cup mount&sup2;USB cableQuick start manual&sup1;Free lifetime traffic updates may not be transferred to another  person or another Garmin product. Lifetime traffic extends for the  useful life of your Garmin traffic receiver (as long as you own a  compatible Garmin GPS) or as long as Garmin receives traffic data from  its traffic supplier, whichever is shorter. Traffic content not  available for all areas. Seetraffic coverage areas.", "title": "Garmin n&uuml;vi 2475LT 4.3-Inch Bluetooth Portable GPS Navigator with Lifetime Traffic Updates", "price": 9.49, "imUrl": "http://ecx.images-amazon.com/images/I/51w9bJ-3MgL._SY300_.jpg", "related": {"also_bought": ["B006G44HZI", "B000BMAQAQ", "B004I5BUSO", "B002VPE21A", "B002OL2MU4", "B002TLSOG0", "B0037JE8VS", "B009SSEH0Y", "B002I05VS6", "B00273AMH4", "B003DSCU72", "B002WRHFOS", "B007RC71OM", "B00BCPYPVC", "206714099X", "B001U0O7RQ", "B007RMAS1K", "B004SY5O5K", "B000W9DJ1Q", "1612383750", "B001M09MUG", "B001QKZ3OQ", "B0083J3UJ8", "B004SCSV2U", "B00AWUUJVS", "B0035JL4V2", "B00AWUUKA8"], "buy_after_viewing": ["B004I5BUSO", "B001U0O7RQ", "B002OL2MU4", "B00BHSTWOY"]}, "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS"]]}