{"asin": "B0007ZJ1IK", "categories": [["Patio, Lawn & Garden", "Lawn Mowers & Outdoor Power Tools", "Replacement Parts & Accessories", "Lawn Mower Parts & Accessories", "Lawn Mower Replacement Parts", "Tires"]], "description": "Keep your tires properly inflated with the Campbell Hausfeld MP6000 Tire Inflator with Gauge. The MP6000 combines an inflation gun, chuck, and gauge in one easy-to-use tool, and it comes with a flexible hose for easy use. This handy gadget can help increase the life of your tires, saving you both time and money.This combination inflation gun, chuck, and gauge makes quick work of inflation jobs, helping extend the life of your tires.The MP6000 Tire Inflatorwith GaugeAt a Glance:Inflation gun, chuck, and gauge in one toolClip-on design for hands-free useBuilt-in relief valve reduces pressure in over-inflated tiresGauge range of 10 to 150 PSIIncludes flexible hose for easy useGet the Most out of Your TiresBecause routine pressure checks can help extend the life of your tires, investing in a tool like the MP6000 is a smart choice. Not only will the MP6000 help you save time and money, but it will also help protect the environment by optimizing your gas mileage, and it will even help make your vehicle safer to drive.The MP6000 combines three different tools in one compact design: an inflation gun, chuck, and gauge, which has a range of 10 to 150 PSI. It clips on for hands-free chuck use, and it features a built-in relief valve for reducing pressure in over-inflated tires.Incredibly Easy to Use: Just Position, Pull, and FillThe MP6000 is exceptionally easy to use. Just position the chuck on the tire stem, pull the lever on the chuck, and fill. If you wish to keep a record of the pressure results, the gauge will keep the pressure rating when you remove the chuck from the stem, and then it will clear the reading when you touch the reset button.About Campbell Hausfeld: Making it Easier to Do it Like a Pro!Campbell Hausfeld makes it easier for you to finish your projects like a pro. The company's history of creating quality products began in 1836, when it manufactured horse-drawn wagons and agricultural equipment. Today, the company offers a complete line of air compressors, air tools and accessories, inflators, nailers and staplers, paint sprayers, pressure washers, and more. Finish your projects faster and easier with Campbell Hausfeld.What's in the BoxMP6000 tire inflator with gauge and hose.", "title": "Campbell Hausfeld MP6000 Tire Inflator with Gauge", "price": 16.7, "imUrl": "http://ecx.images-amazon.com/images/I/41lkgdgd0JL._SY300_.jpg", "brand": "Campbell Hausfeld", "related": {"also_bought": ["B0037JHOFU", "B0000225E0", "B000BO6E1E", "B00BMUGQNC", "B00835GYZO", "B0000CBJKT", "B000N5UHK0", "B006CVXGR0", "B0038MD0V8", "B003TFE7VG", "B0009KN9PE", "B000BOAB9K", "B003YL4CHY", "B002O15NRS", "B00472O5LM", "B008FCSQ1U", "B0000AQK78", "B003TFE7WK", "B004285RLS", "B00835H17E", "B000NPPB4C", "B004HQGDYK", "B00889ZYD8", "B000S377BO", "B0081ZO8T0", "B00889ZYPQ", "B003DN7716", "B001NYTBY8", "B0030EU5Y4", "B0038T6WUM", "B0038MD180", "B00CF3H5ZS", "B000HZJLV2", "B004HL25J2", "B000BOAM4O", "B000FVUO4G", "B003E6HLC2", "B002LQ7WKM", "B005LU2ZOI", "B000ATWZV8", "B00889ZYOW", "B007OX6E3S", "B0046402MW", "B003O5B5LG", "B001F731MG", "B002K2H5T0", "B003X5Q88M", "B00BF4VQ44", "B003X5Q8BE", "B004GHKASA", "B0002SRL0C", "B00006ANRX", "B00HQYFZGM", "B00AZJYDQI", "B0009KNA58", "B000J2FKY0", "B005JRMOV2", "B000BOCBAM", "B000HNC14I", "B0001Q2VPU", "B000HZJMFM", "B0037L327M", "B0038M4ZMQ", "B00B0WL1LO", "B00F9Y1G3C", "B00GUTVJ2S", "B004CY1DSS", "B003G3009Y", "B000O5RO1Y", "B001NSYV58", "B005IUEC2O", "B000X63JUO", "B0000AXCF4", "B00LE904XY", "B000FIAVKG", "B0081EEFOO", "B0002V4PRG", "B0037V0EW8", "B0001MQIAI", "B003V5F17I", "B003TFE7XE", "B000HZI6F4", "B000H399PC", "B00I18QNO0", "B000NPUKC0", "B003MBKH8Y", "B000QTYDGW", "B000IG3RG0", "B003TFE7UW", "B001PNIL48", "B00807XWLY", "B007H2NSQ2", "B00IXP7VK6", "B00080QHMM", "B00AK4CY7S", "B004FDJGNA", "B001S98NLU", "B00004YZQP", "B000MLPE7G", "B000BQMRU4"], "bought_together": ["B0037JHOFU", "B0000225E0"], "buy_after_viewing": ["B0037JHOFU", "B00BMUGQNC", "B0000CBJKT", "B0036ULEV0"]}}