{"asin": "B000IBNXX2", "description": "Amazon.com Product Description With a tiny, eye-catching design, smooth contours, and a discreet size, the Creative Zen V Plus 4 GB Portable Media Player fits perfectly in your palm and slides effortlessly into your smallest pocket. With 4 GB of storage space,A 1.5-inch OLED screen displays rich and vibrant photos, as well as the easy-to-use Creative interface.View all Zen V Plus features.Not much bigger than a pair of earbuds! (black and orange model shown)See the Zen V Plus in 3D.the Zen V Plus holds up to 2,000 songs, and the 1.5-inch OLED screen displays rich and vibrant photos, full-color menus, and album art at any viewing angle. Another great feature built right into the Zen V Plus is the tiny device's ability to support subscription services and pay-per-download music. Plus, you'll never sweat formats--the Zen V Plus plays the broadest selection of MP3 and WMA music. And browsing your music collection has never been easier with Creative's innovative interface that enables effective and intuitive navigation and track selection. The Plus has an extra feature that it's predecessor lacked: the ability to play short video clips. With the Zen V Plus you can watch short clips in transcoded video format and impress your friends with the latest tidbits from the web or a brief glimpse of a home video.Another great feature is a Direct CD Recording function that allows you to record songs directly from a CD player or other audio source without using a PC as an intermediary. You no longer need to burn CDs to your PC then download to your MP3 player. Just connect an audio device directly to your Zen V Plus, and record your favorite CDs, records, beats and more, direct from the source. Meanwhile, automatic track detection separates each song for you--a handy feature when you're converting analog (records and cassette tapes) to digital. If organization is a high priority, the Zen V Plus's Personal Organizer will help you stay connected and in-sync with your Microsoft Outlook information. Just connect the Zen V Plus to your PC, sync your Outlook information, and you'll be ready to carry around your contacts, calendar, and to-do lists right in your pocket. Plus, the Zen V Plus uses a handy built-in microphone to double as a voice recorder, so you can capture notes, record lectures, and more.No matter how you hold it, the Zen V Plus is just the right size.Creative knows that sporty is sexy, and this player is ideal for any workout junkie. The skip-free playback is perfect on your morning jog or your most rigorous workout at the gym. The optional armband and case fit comfortably on your arm and keep your Zen V Plus safe and secure while running or lifting. The Zen V Plus player was designed for people who appreciate style and function. Don't be surprised when people take notice of your cool, colorful music and photo player. You can proudly announce that your device carries up to 2,000 songs, and you can show off your favorite photos and video clips that you've stored on this pocket-sized powerhouse.What's in the BoxCreative Zen V Plus, earphones, drawstring pouch, lanyard, USB 2.0 cable, line-in cable, neck strap, installation CD including user manual, and quick start guide.", "title": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "price": 46.99, "imUrl": "http://ecx.images-amazon.com/images/I/41SJW6RYVCL._SY300_.jpg", "related": {"also_viewed": ["B002MAPS6W", "B000IBROQE", "B000CS7U1C", "B004EW0P9G", "B005MJU1QC", "B008G5ZAGU", "B0002BRMNA", "B002MAPT7U", "B0044ZFXS6", "B001D20KUE", "B000IF4TPY", "B000EA8U12", "B0009R5KMM", "B005FVNH04", "B004ZF0T4I", "B000EPLP3C", "B002MAPSC6", "B002MAPRYU", "B005FVNGRS", "B00028Y826", "B003D78O1Y", "B000LRJXZ0", "B0006HTZ8K", "B000H0QDCC", "B005FVNGS2", "B00IBR5QJY", "B00ECQUY2M", "B00400TGEC", "B006OSFPZC", "B007B5TOZY", "B002JPITY8", "B009K6ULV8", "B001PR1ZMY", "B0076HNNHM", "B001CB0RSG", "B00HCMZ2AC", "B002JPITXY", "B00HCMZ4H8", "B00EE1H7BQ", "B0015L0T68", "B00HCMZ2SE", "B00HCMZ19Y"], "buy_after_viewing": ["B002MAPS6W", "B002MAPT7U", "B005FVNGRS", "B005FVNGRI"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}