{"asin": "B00006JKW5", "description": "Home Theatre Picture and Sound Keeps Getting BetterDVD and Satellite Receivers use high performance connections like S-Video, Component Video, and Dolby Digital Surround Audio. Using high quality connections is more important than ever, to get the most out of these technologies.That's why THX, the industry leader in soundquality certification for movie theatres (you've probably seen the famous THX logo in movie theatres and DVDs), collaborated together with Monster Cable, to create connection standards specifically for home theatre.Today's Home Theatre Components Need Higher Quality ConnectionsThe cables that come in the box don't meet Monster THX standards. Some of the connections you need don't even come in the box, including S-Video, Component Video, and Digital Audio for Surround Sound.Introducing the Monster Standard Line of Monster THX-Certified CablesAlthough Monster Standard THX cable doesn't feature many of the advanced technologies found in our higher performance product lines, it still packs plenty of Monsterous features: higher quality gold tip connections, user-friendly features like color-coded connecters & ID labels for easy, error-free hookup, plus increase power handling of speaker cables to deliver the full dynamic range of explosions and crashes found in today's movies. And dig the stylish, futuristic connector design inspired by Lucasfilm'sStar Warsepics.", "title": "Monster Cable Thx-certified Fiber Optic Digital Interconnect Cable-4 Feet", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/31R4BZNHG7L._SX300_.jpg", "related": {"also_viewed": ["B00006JKWX", "B000Y99KSU", "B0010DLYN8", "B0010DIWAG", "B0006HQ7HC", "B00006RVNQ", "B00003CWA6", "B000Y9B1GO", "B00003CWA7", "B000F8R0O6", "B004CANMCC", "B000Y97PZU", "B003ILIFEG", "B00IXWJ66G", "B000BTICMI", "B00006RVNR", "B004CANMCM", "B005LJQNQU", "B0049II7W2", "B004LSNF04", "B001TH7GSW", "B00H7L7QMA", "B004CARB9W", "B005LJQMCK", "B004UHY8SO", "B000JVCPEY", "B004H2E2J2", "B000JVGWJI", "B005LJQMZC", "B001LUOQQW", "B0010DLYO2", "B00006RHZG", "B00J8SM6Y8", "B006NB5VBS", "B000F6NTUC", "B000UF3FT8", "B00003CWAB", "B003R7MQMI", "B004H1P7H4", "B001LUQDMC", "B0001VWHH2", "B000UF53I4", "B00G188Z7A", "B00006JKWT", "B0043KDDFM", "B002YEYGD2", "B001TR4SAG", "B0038YWJVS", "B0009JR4GK", "B00EWODHFA", "B0002344GG", "B000PCVF3E", "B00006RVNO", "B0002JFN10", "B000Y99KPI", "B00F5L6CAQ", "B002MXWKAG", "B000UF24OK"], "buy_after_viewing": ["B00006JKWX", "B001TH7GSW", "B000Y99KSU", "B004LSNF04"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Cables & Interconnects", "Audio Cables", "Fiber Optic Cables"]]}