{"asin": "B00160GOR6", "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS"]], "description": "TomTom GO 730's award-winning software means groundbreaking new technology for the ultimate driving experience. Switch on and it's ready right out of the box. Just enter the address on the touchscreen or use voice address entry and start driving anywhere in the U.S. and Canada. TomTom guides you door-to-door with turn-by-turn spoken instructions, including street names.Groundbreaking new technology for the ultimate driving experience.Click to enlarge.Includes windshield mount.IQ Routes technology gives you the fastest route every time by using actual average speeds of travel to calculate your trip rather than posted speed limits. Advanced Lane Guidance uses photorealistic images to bring even more clarity to complex multi-lane exits so you can be more confident on the road.TomTom has the most accurate maps, and with TomTom Map Share technology, you instantly can modify street names, street direction, points of interest, and more on your own device.And with the \"Help Me!\" menu, added safety features enable you to easily access local emergency providers. The GO 730 makes driving even safer with Bluetooth hands-free calling.*The TomTom GO 730 is the ultimate car navigator.*Compatible mobile phone requiredGO 730 FeaturesMaps of the U.S. and Canada with TomTom Map ShareBluetooth hands-free callingSpoken street namesIQ Routes technologyAdvanced Lane GuidanceVoice address inputFM transmitteriPod-readyAll TomToms FeaturePlug and Go--Works right out of the box.Pre-loaded Points of Interest--Easily find millions of gas stations, restaurants, hotels, and more on your route.30-Day Latest Map Guarantee--Up-to-date, off the shelf.TomTom Map Share--Modify your own map and benefit from other users' verified changes with TomTom Map Share.Help Me! Emergency Menu--Easily access local emergency providers such as police, fire stations, and hospitals.TomTom HOME--Always-up-to date.Traffic-Ready--Optional RDS-TMC traffic receiver accessory keeps you up-to-date on traffic events to minimize potential delays.Fuel Price Service (optional)--Know more, pay less.Why TomTom?TomTom believes that personal navigation should be as easy and safe as possible. TomTom develops smart technology that gives you straightforward solutions and innovations to make life easy.Easy to UseAward-winning navigation softwarePlug and goBest Maps30-Day Latest Map GuaranteeModify your own map and benefit from other users' verified changes with TomTom Map ShareBest RoutingQuickGPSfixTraffic-readyLeader in SafetyHelp Me! emergency resources menuSafety preferences menuWhat's in the BoxGO 730 device, windshield mount, USB cable, adhesive disk, car charger, and user's guide.About TomTomFounded in Amsterdam in 1991, TomTom has established itself as a global leader in navigation by being an innovative company with a strong brand, clear customer focus, and high-quality products and services.TomTom is a leading navigation solutions provider, with navigation products sold in 30 countries and in over 20 languages. To further its commitment to car navigation, TomTom acquired Tele Atlas maps in 2008 so that the company can continually provide the most up-to-date maps and intelligent routing.TomTom has its own mapping company!Did you know that every year, roads change by up to 40% in high-growth areas? Tele Atlas manages this by using the world's most comprehensive systems to identify and incorporate these changes into our maps with unprecedented levels of speed and accuracy. All TomTom devices benefit from the Tele Atlas advantage--more coverage, more points of interest, and more freshness and accuracy.", "title": "TomTom GO 730 4.3-Inch Portable Bluetooth GPS Navigator", "price": 349.0, "imUrl": "http://ecx.images-amazon.com/images/I/41JNTXqv%2BGL._SX300_.jpg", "brand": "TomTom", "related": {"also_viewed": ["B004J4VYG2", "B004MYFTFG", "B001P3O764", "B000PCBVA6", "B004MYFTFQ", "B000H866BM", "B004MYFTEC", "B005LMWPYG", "B002OL2NT4", "B001VEJEGU", "B003B3P2CY", "B007M52QR6", "B007PPYXOC", "B001VEJEGK", "B00BHSTWOY", "B00I9UKS6O", "B003FSTAGY", "B004MYFTF6", "B00I9UKS3M", "B00I9UKRZ6", "B004MYFTEW", "B007M4Z7GO", "B00486U368", "B00AJXMWP4", "B000SSUHSO", "B007M4Z6FG", "B004MYFTDI", "B00A7LULA6", "B003FSTAHS", "B004J4VYGM", "B00I9UKU8K", "B007M52QEE", "B004MYFTE2", "B007M4Z60Q", "B000U9WVW6", "B001H9NR2Q", "B00BHAC85W", "B004W1GQ92", "B003FSTAFK", "B00CRXI2BW", "B000F007K8", "B0015F1L7A", "B001U0O7RG", "B004MYFTDS", "B001H9O72K", "B0051DSXXM", "B008BL2JOA", "B005DIBH6A", "B001LK6XHM", "B0010G5K80", "B001ET5O70", "B003B3P2CO"], "bought_together": ["B001ET5O70"], "buy_after_viewing": ["B004I5BUSO", "B005DIBHCE", "B001ET5O70", "B007M4Z7GO"]}}