{"asin": "B002QQ8EKO", "description": "Amazon.com has certified this product is Frustration Free. A Frustration-Free Package is easy-to-open and comes without hard plastic \"clamshell\" casings, plastic bindings, and wire ties. It's designed to be opened without the use of a box cutter or knife and will protect your product just as well as traditional packaging during shipping. Products with Frustration-Free Packaging can frequently be shipped in their own boxes, without the need for an additional shipping box.Learn moreabout Frustration-Free Packaging.Inheriting technology and design features from the MacBook Pro line, the new MacBook has been updated with a durable polycarbonate unibody design featuring a brilliant LED-backlit display, a glass Multi-Touch trackpad and Apple's innovative built-in battery for up to seven hours of battery life. Measuring just 1.08 inches thin and weighing 4.7 pounds, the sleek new MacBook cuts a slim profile on any desk (or in any backpack or briefcase). And it comes with everything you need for email, calendar, contacts, browsing the Internet, and more--all a part of the pre-installed Mac OS X Snow Leopard operating system.The redesigned MacBook with 13-inch LED-backlit screen, durable unibody enclosure, and built-in 7-hour battery.Spacious new glass multi-touch trackpad gives you plenty of room to navigate and supports two-finger multi-touch gestures.The MacBook's new seamless, more durable unibody enclosure with rounded contours makes it easy to pick up and slide into and out of your bag. And it's made of rugged polycarbonate that withstands the rough and tumble of everyday life--at school, at work, or while traveling. Even the bottom of the new MacBook feels different. Covering its entire surface is a nonslip material that keeps your MacBook right where you put it, whether on a desk, table, or airplane tray.The LED-backlit 13.3-inch glossy widescreen display provides a spectacular viewing experience, helping to make documents, videos, photos, and games look incredibly sharp and detailed. The LED backlighting delivers stunning colors and instant full-screen brightness the moment you open the lid. And its 1280 x 800 pixel resolution offers an outstanding balance of luminous color and easy readability in a perfectly portable size.It comes pre-loaded with Apple's Mac OS X 10.6 Snow Leopard operating system--an operating system custom-designed for the advanced technology inside--and it also comes with the iLife '09 suite of applications, including iPhoto, iMovie, Garageband, and iTunes.Key Specifications13.3-inch LED-backlit, glossy widescreen displaywith a widescreen resolution of 1280 x 800 pixels to give you plenty of room to multitask. And the display is greener than ever: power efficient, free of harmful toxins such as mercury, and made of arsenic-free glass.Fast 2.26 GHz Intel Core 2 Duo processorhelps you breeze through everyday tasks such as emailing, web browsing, and working with documents, spreadsheets, and presentations in iWork or Microsoft Office for Mac (both sold separately).250 GB hard drive(5400 RPM)2 GB installed RAM(1066 MHz DDR3; supports up to 4 GB)NVIDIA GeForce 9400M graphics processor(with 256 MB of DDR3 SDRAM shared with main memory) for an outstanding everyday graphics experience8x slot-loading SuperDrive with double-layer DVD support(DVD&plusmn;R DL/DVD&plusmn;RW/CD-RW)Built-in iSight camera for video chattingWi-Fi wireless networking(based on 802.11n specification; 802.11a/b/g compatible)Gigabit Ethernet wired networking(10/100/1000BASE-T)Bluetooth 2.1 + EDR (Enhanced Data Rate)for connecting with peripherals such as keyboards, mice and cell phonesTwo USB 2.0 portsMini DisplayPort video outputwith optional adapters for DVI and VGA outputBuilt-in stereo speakers and omnidirectional microphoneCombined optical digital output/headphone output(also includes line-in/microphone jack)Up to 7 hours of continuous usewith 60-watt-hour lithium-polymer batteryDimensions:13 x 9.12 x 1.08 inches (WxDxH)Weight:4.7 poundsWhat's in the boxMacBook; 60W MagSafe Power Adapter, AC wall plug, and power cord; install/restore DVDs; printed and electronic documentationLimited Warranty And ServiceThe MacBook comes with 90 days of free telephone support and a one-year limited warranty. Purchase the AppleCare Protection Plan to extend your service and support to three years from your computer's purchase date. Only the AppleCare Protection Plan provides you with direct telephone support from Apple technical experts and the assurance that repairs will be handled by Apple-authorized technicians using genuine Apple parts.Key FeaturesThe Longest-Lasting Macbook Battery Ever--Up to 7 HoursNow take MacBook with you everywhere without worrying about plugging in or even carrying your power adapter. Its built-in lithium-polymer battery lasts up to 7 hours on a single charge, which makes it perfect for long flights, all-day workshops, and marathon study sessions. Thanks to its advanced battery chemistry and charging technology, the MacBook battery can be recharged up to 1000 times--good for about five years of typical usage--and lasts nearly three times the lifespan of typical notebook batteries.A Comfortable Keyboard Your Fingers Will LoveThe MacBook's keyboard is full size, with keys that are curved to contain your fingers and highly responsive to your touch. Its low-profile design integrates perfectly into the unibody enclosure, so you'll get a comfortable experience whether you're typing a quick email or writing a lengthy research report. The keyboard also gives you one-touch access to music and video controls and Mac OS X features such as Dashboard and Expos&eacute;.Spacious Glass Multi-Touch TrackpadThe new MacBook Multi-Touch trackpad has no button because it is the button. Not having a separate button also makes for a larger trackpad surface, giving your fingers more room to move, click, and gesture. And because the trackpad supports Multi-Touch gestures, you can use one or more fingers to interact with your documents, images, and applications with gestures such as two-finger scroll, pinch, swipe, and rotate. If you come from a right-click world, you can configure a right-click area on the trackpad or simply press with two fingers.Some of the multi-touch gestures you can perform with the MacBook.Wireless That WorksConnect to the Internet at fast speeds anywhere thanks to the built-in AirPort Extreme 802.11n Wi-Fi. Like everything else about a Mac, joining Wi-Fi networks couldn't be simpler. If you've previously connected to a network, your Mac automatically logs you in so you can immediately email, surf the web, or video chat. Have a Bluetooth-enabled phone, headset, keyboard, or mouse? They can all connect to your MacBook courtesy of built-in Bluetooth 2.1 + EDR--and it remembers all your devices, tooInnovative Power CordThe MagSafe Power Adapter has a magnetic connection instead of a physical one. So if someone happens to trip over the power cord while you're working, they won't send your new MacBook flying off a table or desk. Instead, the cord breaks cleanly away, without damage to either the cord or the system. As a bonus, you can tell if your MacBook is fully charged when the LED on the connector changes from amber to green.Easy Access To Connections And PortsThe connections and ports on MacBook--MagSafe power, Gigabit Ethernet, Mini DisplayPort, USB, and audio in/out--are all smartly integrated on the same side of the notebook. So your cables stay neatly organized, and connecting and disconnecting your devices is easy and convenient.Pre-Loaded with Mac OS X Snow Leopard and iLife '09Every Mac comes with Mac OS X Snow Leopard, the world's most advanced operating system, and iLife, Apple's innovative suite of applications for managing photos, making movies and creating and learning to play music. Snow Leopard builds on a decade of OS X innovation and success with hundreds of refinements, new core technologies and out of the box support for Microsoft Exchange. iLife features iPhoto, to easily organize and manage photos; iMovie with powerful easy-to-use new features such as Precision Editor, video stabilization and advanced drag and drop; and GarageBand which introduces a whole new way to help you learn to play piano and guitar.Installed softwareMac OS X v10.6 Snow Leopard (includes Time Machine, Quick Look, Spaces, Spotlight, Dashboard, Mail, iChat, Safari, Address Book, QuickTime, iCal, DVD Player, Photo Booth, Front Row, Xcode Developer Tools)iLife '09 (includes iPhoto, iMovie, GarageBand, iWeb, iDVD)@ DesignBecause Apple designs both hardware and software, we can reduce our environmental footprint in ways others can't. For starters, a highly efficient power supply reduces the amount of power wasted when bringing electricity from the wall to your Mac. Unlike a lot of PCs, a Mac uses energy-efficient hardware components that work hand in hand with the operating system to conserve power--even between keystrokes.A Mac also doesn't contain a lot of toxic materials. All Mac displays are mercury and arsenic free, and the internal components are free of polyvinyl chloride (PVC) and brominated flame retardants (BFRs).Advanced Power ManagementUnlike a lot of Windows-based PC systems, MacBook uses energy-efficient hardware components that work hand in hand with the operating system to conserve power. Mac OS X spins down hard drives and activates sleep mode on already energy-efficient LED-backlit displays. And it balances tasks across both central processors and graphics processors. Mac OS X never misses a power-saving opportunity, no matter how small. It even regulates the processor between keystrokes, reducing power between the letters you type. That's just one of many ways Apple manages small amounts of power that add up to big savings.Longer-lasting Battery--Lasts up to 5 YearsThe removable batteries in most notebooks are designed to be replaced every year or two, which means lots of batteries are used up and discarded. But the battery in the new MacBook lasts up to five years--or 1000 recharges. So it uses just one battery in the same time a typical notebook uses three, reducing waste and environmental impact. And to help ensure that batteries are disposed of in an environmentally responsible way, Apple offers a battery take-back program in 95 percent of the countries in which it does business.ENERGY STAR QualificationThe MacBook meets the stringent low power requirements set by the EPA, making it ENERGY STAR qualified. ENERGY STAR 5.0 sets significantly higher efficiency limits for power supplies and aggressive limits for the computer's typical annual power consumption.", "title": "Apple MacBook MC207LL/A 13.3-Inch Laptop (OLD VERSION)", "imUrl": "http://ecx.images-amazon.com/images/I/41CzAf-pawL._SX300_.jpg", "related": {"also_bought": ["B0096W5B3O", "B002C7489S", "B008LYD7WU", "B007JL5DXW", "B0031MJZ0K", "B0031MLAFS", "B0031MOL2C", "B002YPSKFQ", "B0031MGUBC", "B00JLOYZ2K", "B00HB8B9VS", "B0031MJ70I", "B0031MH3F4", "B0031MQMU6", "B0031MG760", "B007JLHEFW", "B0096WDYWO", "B007KU7MPO", "B002ACM5MM", "B004N1FHQ4", "B00FO4GVAK", "B003GSLU3E", "B001P05NKG", "B008UWXQWO", "B004VAI62Y", "B002HU39BS", "B004WG1Y62", "B006QHHN6K", "B007JLI6S6", "B007JL5T0Y", "B000X86ZAS", "B0065UZMJ8", "B003YCOJAI"], "buy_after_viewing": ["B002C7489S", "B008LYD7WU", "B007JL5DXW", "B00K760Z84"]}, "categories": [["Electronics", "Computers & Accessories", "Laptops"]]}