{"asin": "B000069092", "categories": [["Electronics", "Camera & Photo", "Digital Cameras"]], "description": "Nikon's Coolpix 5700 digital camera combines Nikon's world-renowned Nikkor optics, an 8x optical zoom, and a 5-megapixel CCD sensor for superior image quality. With its maximum resolution of 2,560 x 1,920 pixels and file sizes of up to 15 MB, you can create brilliant color prints sized 16 by 20 inches and beyond. The Coolpix 5700 provides great control over picture composition, and plenty of latitude to crop and resize images without digital artifacts becoming noticeable in the final print.The 8X optical zoom Nikkor lens offers a 35-280mm zoom range (35mm equivalent), and uses Nikon-developed ED (extra-low dispersion) glass. For even greater magnification, the stepless 4x digital zoom provides for a maximum zoom range of 32x, so you can capture details even from great distances.The Coolpix 5700 features Nikon's exclusive clear-image mode for lower-resolution shooting, plus noise-reduction mode for use with longer exposures. It also offers a three frame-per-second burst mode and a top shutter speed of 1/4,000 second, great for action-packed outdoor and sports photography.You can frame subjects using the various-angle LCD monitor, or the new electronic viewfinder for through-the-lens viewing of scenes and menus. Nikons \"quick review\" makes viewing images on the included memory card a snap, and a five-area multi autofocus lets you pick your focus spot.Its movie mode enables you to record full-motion video for up to one full minute with sound. A built-in speaker provides instant confirmation and playback capabilities for digital movies.The Coolpix 5700 comes equipped with an automatic pop-up flash, plus a hot shoe for additional flash units. The bundled NikonView 5 browser software (for Mac and Windows) makes it simple to organize, retrieve, and print images. It includes a lens cap, camera strap, 16 MB CompactFlash card, AV cable, USB cable, rechargeable lithium-ion battery (EN-EL1), and battery charger. It is compatible with type I and II CompactFlash memory cards, as well as IBM Microdrives (512 MB and 1 GB).", "title": "Nikon Coolpix 5700 5MP Digital Camera w/ 8x Optical Zoom", "brand": "Nikon", "salesRank": {"Camera &amp; Photo": 10030}, "imUrl": "http://ecx.images-amazon.com/images/I/51XEVE34F0L._SX300_.jpg", "related": {"also_bought": ["B0032GRY9O", "B000ES8B4K", "B00LUDER1Y", "B00023JL96", "B0002JFM3Y"], "bought_together": ["B0032GRY9O"], "buy_after_viewing": ["B0032GRY9O", "B000ES8B4K", "B00CIC6TAS", "B000YHP0CM"]}}