{"asin": "B000A7XSSY", "related": {"also_viewed": ["B002IKLJU0", "B000GHVZQ0", "B008MB6YX6", "B003WJR694", "B000MWVMRG", "B00DY2Y28M", "B008MB6ZX0", "B001CCLBSU", "B0056ENTVC", "B003WJR68U", "B008MB71IS", "B005058BTW", "B001PKEJZQ", "B000EBK3FW", "B0009GZANC", "B003I95ASC", "B00E52ZJDM", "B000F6Y686", "B004HO58NO", "B00604YTH0", "B0011YZ1OO", "B00B3YSTI2", "B009WS2NGK", "B006ZNYSX6", "B000TM7GD8", "B00ENLB1T6", "B00B3YSW5W", "B0007GIXS8", "B003BR8BE6", "B008MB719C", "B000CP4ML6", "B005F25IL4", "B00728ZBA2", "B00ATE7SZM", "B001P06Q66", "B007R7HUAM", "B000M4J2PI", "B0034XFG86", "B00ATM1MGA", "B006ZAHN8Q", "B001CCLBSA", "B008MD3RE8", "B004HO58OI", "B00KOUIBZW", "B00CPPRO3Y", "B00B2QK2H2", "B0035FZJM6", "B0034XIMG4", "B00CFCTDD6", "B007XJG4F6", "B0091T97J6", "B00B7FNGIK", "B003AOAXL4"], "bought_together": ["B0012OGF6Q"], "buy_after_viewing": ["B00168NDQS", "B000CP4ML6", "B003I95ASC", "B003VNKNF0"]}, "title": "Panasonic Lumix DMC-FZ30K 8MP Digital Camera with 12x Image Stabilized Optical Zoom (Black)", "price": 699.95, "salesRank": {"Camera &amp; Photo": 13672}, "imUrl": "http://ecx.images-amazon.com/images/I/51YPGBYTE5L._SX300_.jpg", "brand": "Panasonic", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The DMC-FZ30's Leica DC Vario-Elmarit lens features 14 elements in 8 groups, including 3 aspherical lenses and an ED (extra-low dispersion) lens which helps to suppress the color bleeding that often occurs in telephoto shots, plus a 12x optical zoom (35mm equivalent: 35 to 420mm). This combines with the large, 1/1.8-inch diagonal 8-megapixel CCD to give you enormous expressive power. The new Extended Optical Zoom, which minimizes the image degradation that normally occurs with digital zooming, gives you up to 19.1x power in 3-megapixel photos, and up to 15x power in 5-megapixel photos. Plus, the 12x optical zoom can be used together with the 4x digital zoom to produce a maximum of 48x zooming power.Accurate, Flexible Focusing--Both Auto and ManualIn addition to five auto focus modes (1-point, 3-point high-speed, 9-point, spot AF, and 1-point high-speed AF with reduced focusing speed), the FZ30 features a ring that lets you manually adjust the focus from 0.98 feet (0.3 meters) to infinity. It also has Manual Focus Assist, a function that shows an enlarged image of the subject's center in the viewfinder. The One-Shot AF function in manual focus mode lets you focus automatically for a single shot by pressing the \"FOCUS\" button. The Continuous AF function keeps moving subjects in sharp focus, and the AF Assist Lamp helps in dim lighting. This all adds up to easy, accurate focusing.Manual Focus and Zoom Rings with Intuitive ControlThe manual focus ring lets you focus on whatever part of your subject you wish, and the zoom ring lets you zoom in and out easily and accurately as you compose the perfect shot. They're both fast, so you can capture moving subjects in your composition.Free-Angle 2.0-Inch Diagonal High-Resolution LCDChange the angle of the high-resolution 230,000-pixel 2.0-inch diagonal LCD monitor any way you like. You get the flexibility to catch a high-angle shot over a crowd, or a low-angle shot of flowers in a garden, all with a comfortable posture.Lightning Response Whenever You Need ItNew with this model, the lens does not retract when not in use, so the camera is ready to shoot almost immediately. Also, the super-fast Venus Engine II has ultra-fast release and refresh times.Mega Burst Consecutive ShootingYou can snap off consecutive shots at 3 frames per second with full resolution. In addition, the Unlimited Consecutive Shooting function lets you continue shooting until the memory card is full.Instant Close-ups with a Single SwitchRegardless of the Mode Dial setting, you can take macro shots instantly by flicking the switch on the side of the lens to the AF Macro setting. This lets you get as close as 0.16 feet (5 centimeters) from your subject (at the maximum wide-angle setting).Flexible Shooting to Match the SceneTake beautiful photos even if you're using a camera for the very first time. The camera does all the work, so you can just aim and press the shutter button.Program AE ModeThis mode determines the optimal aperture and shutter speed settings for you.Aperture Priority AE ModeYou can set the aperture between f2.8 and f8.0 to create a softer focus.Shutter Priority AE ModeSet the shutter speed between 60 seconds and 1/2,000 second to freeze or express movement.Manual Exposure ModeYou can manually set both the aperture and shutter speed using the command dial as you hold the camera. Simply press the shutter button halfway down and the Manual Exposure Assist screen in the viewfinder or LCD monitor will show you how much your exposure setting varies from the setting the camera considers optimal.Moving-Image ModeEnjoy smooth moving pictures complete with sound. Even in dimly lit situations, a new 9-pixel mixed readout method produces bright VGA-size (640 x 480-pixel) moving images at 30 frames per second on large-screen TVs.Playback ModeSelect two of the following 14 modes according to the shooting conditions. Pressing the left of the cursor button opens a help screen that explains what each mode is for.Starry Sky ModeCandle ModePortrait ModeNight Portrait ModeNight Scenery ModeParty ModeSports ModeScenery ModeFireworks ModeSnow ModePanning ModeBaby ModeSoft Skin ModeFood ModeMore Functions, More ShotsAuto Angle Detection rotates vertical shots 90 degrees for easier viewing when connecting with an AV cable. This function may not work on some TV/LCD monitors.TIFF compatible for saving images without compressing dataRAW format for saving images as unprocessed CCD dataPictBridge-compatible for direct printer connectionOptions to Broaden Your Creative PossibilitiesTwo new optional conversion lenses have been developed to enhance the performance of the FZ30: the 1.7x tele-conversion lens (35mm equivalent: 714mm), and the 0.7x wide-conversion lens (35mm equivalent: 24.5mm). Conversion lenses are optional accessories and must be purchased separately.Wide-Conversion lensDMW-LW55 (0.7x)Tele-Conversion lensDMW-LT55 (1.7x)What's in the BoxPanasonic Lumix DMC-FZ30K 8MP digital camera, battery charger, battery pack, SD memory card (32MB), lens cap, lens hood, lens hood adaptor, AV cable, USB connection cable, strap, CD-ROM"}