{"asin": "B001HBHLEY", "categories": [["Electronics", "Television & Video", "Blu-ray Players & Recorders", "Blu-ray Players"]], "description": "Amazon.com Product Description Samsung's BD-P2500 is BD-Live 2.0 Ready with an ethernet port so you can enjoy special interactive features, download extra content from the internet, and more. It has 1Gb of onboard memory and a USB port for memory expansion. You&rsquo;ll enjoy bold color and crisp details with full 1080p resolution. The BD-P2500 also offers breakthrough enhancements such as Hollywood Quality Video (HQV) processing and 7.1-Channel analog audio outputs creating a powerful HD audio-visual experience. Plays Blu-ray discs, upscales standard DVDs, and is compatible with BD-ROM, DVD-ROM, DVD-R (V mode only), DVD-RW (V/VR mode), Audio CD, CD-R, CD-RW, and&nbsp; AVCHD discs. Movie night just got even more exciting - with the highest-quality audio and an incredible picture.Key FeaturesTotal BD Profile Compatibilityright out of the box, lets you instantly enjoy the latest interactive features available, including BD Live (Profile 2.0) and Bonus View (Profile 1.1)Lots of Memory and Easy Upgradeability:The BD-P2500 comes with a built-in, wired Ethernet connection, 1GB of internal flash memory, and a USB port for memory expansionFull HD 1080pHQV processing chipfor the highest quality viewing of Blu-ray discs, upconversion of standard DVDs, and viewing of JPEG imagesHDMI 1.3 outputwith xvYCC Deep Color support, and a 24fps film mode, exhibiting smoother, more natural playback of film-based material.7.1-Channel Dolby TrueHD Soundand dts-HD Master Audiocapable of decoding the latest high-resolution digital multichannel audio soundtracksHQV Video ProcessorIn a perfect world, every disc&rsquo;s image that passed through your Blu-ray disc player into your HDTV would offer immaculate 1080p video with flawless color, impeccable detail, and nary a bit of pesky video noise. In the real world, though, pristine source material isn&rsquo;t available for every Blu-ray disc&mdash;due to age or neglect of the original elements&mdash;and there are plenty of movies and TV shows on DVD that you&rsquo;ll still want to watch on your Blu-ray player. HQV video processing is a great way of elevating those less-than-perfect video sources to a new level, and ensuring that you&rsquo;re getting the most out of your beautiful high-definition video display.To do this, the HQV video processors built into better Blu-ray players employ sophisticated algorithms to alleviate the problems that often plague less-than-perfect video sources. HQV processors analyze multiple video fields at once to determine where frames match up and where they don&rsquo;t, and even which objects are in motion within those frames. In analyzing the video signal over time, the processor also determines the proper frame rate or refresh rate of the original video signal&mdash;whether it&rsquo;s a 24 fps film source or a 30 fps video source, for example&mdash;and makes sure that it is dealt with properly. HQV video processors are also great at minimizing video noise without scrubbing the image of all its fine detail, as well as restoring some of the detail that&rsquo;s lost as a result of aggressive video filtering during the Blu-ray or DVD mastering process. And unlike some competing video processors, HQV processors boast enough processing power to keep up with the multiple video streams (picture-in-picture and split screen) found on many new Blu-ray discs.Stream Netflix Movies Right Over Your PlayerNetflix, the world&rsquo;s largest online movie rental service, has a library of more than 12,000 movies and television episodes available for streaming. You must be a Netflix subscriber in order to receive streaming video service. For Netflix customers you simply need to activate your new BluRay player to your existing Netflix account. Non-Netflix customers must first sign up for Netflix in order to utilize this feature-there is a monthly cost.BD-LiveBD-Live is a Blu-ray feature that enables you to access&nbsp; special content via an internet-connected Blu-ray player. Because it's not coded into the disc, BD-Live content is always updated, always fresh. With BD-Live, your Blu-ray disc is different every time you view it.Check out the latest previews,&nbsp; download special scenes, exclusive features and ringtones, and participate in online communities or games.As BD-Live continues to grow and expand, even more features will become available, customizing features and content to your location or preferences. Now, your disc kBonus ViewBlu-ray Disc has 5x more storage capacity than DVD, which allows more content to fit on the disc. The extra storage capacity also means more room for special features like inline navigation, Bonus View, interactive games, deleted scenes, director commentary and moreNavigate to special features, other scenes, or settings without leaving the content you are watching.Bonus View lets you watch special features and commentary inline without leaving the movie.High Definition Soundtrack Support and OutputProviding a truly immersive HD home theater experience, Samsung's BD-P2500 is capable of decoding the latest high-resolution digital multichannel audio soundtracks available. Out of the box, the player can output Dolby Digital, Dolby Digital Plus, Dolby TrueHD and dts as an uncompressed PCM signal, as a bitstream, or via the 7.1 analog outputs for cinematic sound that is comparable with the latest movie theaters. Additionally, dts-HD HR (High Resolution) decoding will become available with a firmware upgrade in the fall. The BD-P2500 will also pass these and dts-HD MA (Master Audio) as a bitstream output to a separate, external surround sound decoder.HDMI Featuresx.v Color", "title": "Samsung BD-P2500 1080p Blu-ray Disc Player", "price": 197.99, "salesRank": {"Electronics": 62203}, "imUrl": "http://ecx.images-amazon.com/images/I/21%2B9imxEi0L._SX300_.jpg", "related": {"also_viewed": ["B00ICDAAX4", "B00EUY59Z8", "B00BFRKYVM", "B0036WS4CA", "B0076R7F62", "B0076R7FFI", "B00HPMCPJK", "B00I83T0DO", "B00BFDHVAS", "B004ZP756S", "B00ICDAAXO", "B00793MIGK", "B006U1YVZ8", "B005NEZDUA", "B0076R7F1M", "B00HPMCO6O", "B00AWKC0JM", "B00752R4PK", "B00HPMCO4Q", "B006U1YUZE", "B00KZ4PO2K", "B001URWAYG", "B00ECQABDY", "B00AWKC0EC", "B00752R4S2", "B004K1EOCA", "B00AWX6EYQ", "B004N85YBA", "B00ICDABYC", "B00BQ3EGPU", "B00F6B3ULE", "B00FF9SVWA", "B00BFDHV9E", "B00K5VZMX4", "B005DII6DC", "B00K1MODQ4", "B00AYB3OMG", "B00BD7UVHG", "B009YWN926", "B00IAELTK8", "B0089KJPM2"], "buy_after_viewing": ["B00ICDAAX4", "B00ICDAAX4", "B003L1ZYYM", "B00EUY59Z8", "B00EUY59Z8", "B00AWKC0JM"]}}