{"asin": "B001418WF4", "description": "Amazon.com Product Description--March 24, 2008 Samsung adds a Touch of Color to a blazing-fast 4ms response time andrich connectivity features to redefine the role HDTVs play in the home with its forward-looking Series 7 LCD HDTVs. Utilizing the award-winning technologies found in all Samsung HDTVs, Series 7 HDTVs deliver unparalleled picture quality and enhanced connectivity and networking capabilities that create a true entertainment hub for any home, and take networking and multimedia management to a whole new level. Easily enjoy MPEG and JPEG files stored on external devices by connecting through a side-mounted USB 2.0, turning their LCD into a full-scale home viewing gallery, or connect MP3 players for a dynamic audio experience.Key FeaturesNew-- Internal flash memory (1GB) with pre-loaded interactive contentsuch as cooking recipes, children's entertainment, HD artwork and moreNew--Integrated wooferfor an enhanced audio experienceNew--DLNA-Compatible:for better interopability with electronics, computers and mobile devices from many different manufacturers (Learn more)New--50,000:1 dynamic contrast ratio: up from 25,000:1 on 2007 models (Learn more)New--Blazing 4ms response time:down from 8ms on 2007 models thanks to a new high-speed liquid crystalNew--Transparent and Opaque Color (TOC) bezelwith infused color creates an ultra-sleek shape and appearance (Learn more)New--InfoLink: Get free RSS feeds of news, weather and sports right to your HDTV with a built-in Ethernet port (Learn more)New--4 HDMI 1.3 ports: Simplay compliant, and up from 3 on 2007 models (Learn more)Full 1080p HD(Learn more)Automotion Plus 120 Hzimage interpolation technology provides smoother motion (Learn more)178-degree viewing anglefrom all four axes with Super Patterned Vertical Alignment (Learn more)Ultra Clear Paneltechnology for deeper blacks and more vibrant colors (Learn more)Side-mounted USB 2.0 port:connect USB devices directly to your HDTV to view JPEG photos or MPEG movies or easily listen to your MP3 player through your HDTV's audio system or your home theater system.Sports and Game modesboost on-screen performance and interaction with the latest gaming systemsCompatible with Samsung'sHome Digital Media Adapter(sold separately) for playback and navigation of Internet and stored PC multimediaHidden, downward-firing speakerswith SRS TruSurround XT audio (Learn more)Cold Cathode Flourescent LampandWide Color Enhancertechnology offer a wider color range (Learn more)Picture-in-Pictureenables convenient simultaneous viewing of TV programs and video or PC sourcesV-Chipsystem allows blocking of rated TV and movie programs determined by the parent to contain objectionable content.Trilingualon-screen displays in English, Spanish or French.Variable sleep timerto turn the TV off in varying time intervals.Auto wall mount compatible:3-dimensional operation via TV&rsquo;s remote control; no external IR receiver required.1 year parts and 1 year labor warranty(90 days parts and labor for commercial use), with in-home service, backed by Samsung toll-free support.Step Up FeaturesSeries 8:super-slim 1.9-inch thick profileWhat size TV should you get?Learn MoreTouch of ColorInspired by designs from the automotive and fashion industries, Samsung&rsquo;s unique unique Transparent and Opaque Color molding process creates a clean, smooth finish infused with a hint of a translucent color during the manufacturing process for an ultra-sleek appearance.InfoLinkUp-to-the-minute access to weather, news, sports and stock information is just a cable and a click away through the HDTV&rsquo;s Ethernet port and new InfoLink RSS service. An all-new user interface with digital contents management guide provides intuitive navigation and access to both internal and external content.Auto Motion Plus 120HzThis technology doubles the frame rate from 60 to 120 frames per second (120Hz LCD panel) without repeating the same image to make more frames. Instead, the TV intelligently calculates the &lsquo;middle&rsquo; image between frame A and frame B and inserts it in between (Auto Motion Plus 120Hz processor), making a fluid transition from one frame to the next.Super Clear PanelSamsung enhances the clarity of select LCD HDTVs by replacing the light-diffusing plastic face of traditional LCD HDTVs with a&nbsp; natural black panel with a clear anti-glare shield. Reduced reflection of external light creates a new dimension in image clarity, highlighting black and darkened areas, enabling vibrant, more compelling colors and a brighter, clearer picture.&nbsp; Black will never again appear grayish. Black details will show in vivid black even in dark scenes.The latest version of Samsung&rsquo;s breakthrough super clear panel technology makes colors appear more vibrant and blacks even deeper than ever. Enhanced films reduce glare and optimize off-angle viewing.50,000:1 Dynamic Contrast Ratio/500 nit Brightness50,000:1 Dynamic Contrast Ratio will give you a picture better than you ever thought possible, with whiter whites, blacker blacks and a nearly infinite subtlety of gradations in between. As two of the most important determining factors in overall picture quality, contrast and brightness levels achieve new heights in this latest generation LCD panel. Samsung&rsquo;s new LCD TV&rsquo;s give the most stunning realistic picture quality ever.Full HD 1080PFull HD, or 1080p, contains 1.5 times more scanning lines than conventional HD TVs. More scanning lines mean more pixels, more details and a better picture. The new Samsung LCD TV with resolution that is approximately 2 times greater than conventional HDTVs, creating the most perfect picture imaginable.Samsung&rsquo;s 1080p panel uses a new high-speed liquid crystal to cut response time to 4ms. The fast response time, coupled with Samsung&rsquo;s Auto Motion Plus 120Hz motion blur reduction technology dramatically reduces motion blur and judder.Digital Natural Image EngineDNIe&trade; The Samsung Digital Natural Image engine. This exclusive Samsung technology dramatically improves the picture by enhancing the contrast, detail, white balance and reduces.Wide Color Enhancer/Cold Cathode Flourescent LampThe NTSC (National Television Systems Committee) has established the color standards all TVs in America try to meet. And typical LCD TVs only meet about 72% of this standard. Samsung LCD HDTVs use Cold Cathode Fluorescent Lamp backlights to give you 92% coverage of the NTSC standard, ensuring truer, more breathlessly vivid colors.Samsung&rsquo;s exclusive Wide Color Enhancer technology delivers more brilliant colors, even in bright areas of the picture where blues and greens are washed out on conventional screens. The system displays wider color reproduction, showing you truer colors &ndash; the fresh green of spring foliage, the intense blue of the summer sky.ConnectivityTo make the Series 6 a true entertainment hub for any home, Samsung has incorporated advanced HD connectivity and networking capabilities that expand the HDTV&rsquo;s functionality. A wide variety of multimedia devices can be connected to the set through any one of the four Simplay compliant HDMI 1.3 inputs (including one on the side), and the handy HDMICEC feature lets you control all your CEC-enabled peripherals using just one remote.Connect HD digital devices like disc players, game consoles, and satellite dish components into the 2 rear connections and use the side-mounted input for cameras, camcorders, and laptops. HDMI is the best performing interface for displaying an HD source on an HDTV.Once connected, users can easily access device menus and manage and display content through the newly redesigned Wheel Key Remote control and the HDTV&rsquo;s sophisticated content management interface.All ConnectionsHDMI (High Definition Multimedia Interface version 1.3): 4 (3 rear/1 side)Ethernet portComponent video: 2 (Y, Pb, Pr)S-Video input: 1 side/1 rearA/V inputs: 1 side/1 rearPC Inpuy (D-Sub): 1RF antenna inputs: 2HDMI-CECPremium audio: Improved sound quality with dedicated low-range speaker systemHeadphone jackDigital Living Network Alliance (DLNA)", "title": "Samsung LN52A750 52-Inch 1080p DLNA LCD HDTV with Red Touch of Color", "price": 25.69, "imUrl": "http://ecx.images-amazon.com/images/I/51fCrMBJItL._SX300_.jpg", "related": {"also_viewed": ["B00EBNAMZA", "B0074FH14C", "B00EA650XM", "B00K4UJ318", "B00AK4OS4K", "B007BG54H0", "B00K4UJ31S", "B0074FGW5G", "B00I94IPTW", "B0078LSTRK", "B00ID2HI8O", "B0078LN0K6", "B00JP7OW9E", "B003NF83NU", "B00GKKI4IE", "B00BCGRYY6", "B00I94IRIQ", "B00BCGRVX0", "B008RYWHY8", "B00ID2HICA", "B0076LY17E", "B00ID2HGP4", "B00BD8TOTG", "B004NB0NNG", "B0074FGLUM", "B00BCGRX9W", "B0078LN0RE", "B00IDXILHA", "B00BCGRVN0", "B00AK4O4EY", "B00I94IPJC", "B00I94IR4K", "B0044J4U2W", "B00BBAFUQC", "B000WL6YY8", "B002SV5PLS", "B00ID2HGQ8"], "buy_after_viewing": ["B0012S4APK", "B0074FGW5G", "B008PWWS32", "B000NMFCIA"]}, "categories": [["Electronics", "Television & Video", "Televisions", "LCD TVs"]]}