{"asin": "B000XZCIX4", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Memory Cards", "SD & SDHC Cards"]], "description": "The SanDisk Extreme III Secured Digital High Capacity (SDHC) Card is designed specifically for high-end, professional photographers who work under extreme conditions and expect the very best in products and support services. This 8 Gigabyte SDHC Card has a minimum of 20MB/second sequential write and read speed (based on SanDisk internal testing), which allows for faster capturing of large image files to the card, faster viewing of images and faster data transfer rates.This SanDisk Secure Digital High Capacity (SDHC) Memory Card can be used in a variety of digital products including digital music players, cellular phones, handheld PCs, digital cameras, digital video camcorders, smart phones, car navigation systems and electronic books, that conform to the SD 2.00 specification (rated Class 10 for speed and performance). The SDHC Card also contains a security feature for the protection of copyrighted data.It is high speed USB 2.0 certified for fast data transfer, and its single slot supports both SD & SDHC cards. (Requires Windows 2000, XP or Mac OS X (10.1.2+) Operating System)FeaturesFeatures ESP Technology (Enhanced Super-Parallel Processing Technology), which provides best-in-class performance.Tested in extreme temperature ranges from -13 to +185 Fahrenheit so that they can be used to shoot photos in any weather condition.Shock and vibration tested with industrial-grade RTV included, which is designed for rugged use", "title": "SanDisk Extreme 8 GB Class 10 SDHC Flash Memory Card (SDSDRX3-8192-A21)", "price": 11.95, "imUrl": "http://ecx.images-amazon.com/images/I/51a58cncGML._SY300_.jpg", "brand": "SanDisk", "related": {"also_bought": ["B003D5MY5I", "B000Y9TZ9Y", "B000QUUFRW", "B000OFWJO6", "B000ZD0CV4", "B007M54DYA", "B003EGNUH2", "B0037FLUYU", "B005DIYQA4", "B007M54E08", "B007SK9GCS", "B0026FCKAA", "B000HJPK2C", "B003VNKNEG", "B0045KGZOG", "B0080JH3YE"], "bought_together": ["B003D5MY5I", "B000ZD0CV4"], "buy_after_viewing": ["B007M54E08", "B00812K4V4", "B007M54DYA", "B000Y9TZ9Y"]}}