{"asin": "B0002SQ2P2", "description": "Logitech Z-2300 2.1 Speaker SystemHear your movies, music and games for the first time.Great sound. It's all in the details. This powerful speaker system brings them out in high-clarity THX-certified sound. From the fat bass thumps in your favorite rock anthem to the creepy hallway steps in your favorite horror film, you'll hear details you never knew were there. Add to that an impressive 200 watts of RMS power and you've got everything you need to rock your entertainment world.Key FeaturesGenuine THX-certified audio qualityOnce you hear these speakers, you'll know why they're among the few that have earned the THX seal of approval. THX certification is the ultimate mark of audio quality and your assurance of a studio-quality listening experience.200 watts of bold, powerful soundHear and feel the music with more than enough power to rock the room. Go ahead and turn it up. The speakers are built to deliver clear, detailed, distortion-free sound&mdash;even at window-rattling volume.Phase-plug drivers for more accurate sound reproductionFrom the soaring high note in a guitar solo to the loud burst of jet engines in an action movie, Logitech Phase Plug drivers make sure you don't miss a sound. A cone-shaped aluminum Phase Plug at the center of the driver helps to accurately reproduce high- and mid-range frequencies with less coloration than standard drivers. And because the Phase Plug acts as a heat sink, the driver is better able to preserve dynamic range. So you hear the quiet of a whisper and the loud, full force of an explosion. The Phase Plug even acts as a reflector, creating a much wider sweet spot of mid to high frequencies compared to conventional speaker designs. The bottom line? The true sonic signature of your movies, music and games comes through loud and clear.Long-throw subwoofer for rich, room-filling bassIntensify your movie, music and gaming experience with distortion-free bass that goes extra deep. The powerful 8-inch, 120 watt driver reproduces the wide range of low frequencies that deliver room-shaking rumbles and rich, tight bass notes. And with Logitech's flared side port, the port noise that can occur with subwoofers is eliminated.It's big, bold bass without the distractions.SoundTouch&#8482; remote for easy controlYou have complete control over your listening experience with this sleek wired remote. Control master volume, subwoofer level and power. There's even a headphone jack for private listening.Audio adapter for quick device connectionsThe system comes complete with a handy adapter that lets you easily connect the speakers directly to your game console, DVD player or CD player.Browse For More Logitech ProductsEnhance your listening experience with great Logitech products.Logitech Speaker System Z523Speakers with 360-degree sound help project audio evenly in all directions, so you get a great listening experience throughout the room.Ultimate Ears SuperFi 4 Noise-Isolating EarphonesFeaturing the same speaker technology and sound signatures used in our higher-end products, these compact earphones deliver detailed bass with crisp and clean mids and highs.Ultimate Ears SuperFi 5 Noise-Isolating EarphonesHoused in a sleek, liquid silver body, the top-fire speaker produces a detailed and full soundstage&mdash;ideal for listening to a broad range of music genres.What's In The BoxPackage ContentsSpeakers: 2 satellites,  1 subwooferCables included: Power cord, Color coded audio cablesSoundTouch&#8482; wired remote controlVideo game console adapterUser's manual2 year limited warranty", "title": "Logitech Z-2300 THX-Certified 2.1 Speaker System with Subwoofer", "price": 118.99, "imUrl": "http://ecx.images-amazon.com/images/I/41QPWH9EWWL._SY300_.jpg", "related": {"also_viewed": ["B003VAHYTG", "B003VAK1FA", "B00KTT5N4U", "B002FU5QMK", "B00031S4KO", "B0002WPSBC", "B003UPJXIC", "B000062VUO", "B004M18O60", "B000JJM8XE", "B000AM6QHE", "B004H0MQYW", "B0002SQ0AE", "B001S10DDO", "B002HWRZ2K", "B0042F3K9W", "B0025VKUR0", "B00DV56K6O", "B002BA5JLW", "B0027VT6V4", "B00BGYQKZS", "B0011FQURK", "B00K5NYNWS", "B007PXV2K2", "B0002WPSCG", "B008X1BVH4", "B0030ZLZ5G", "B002VK7L04", "B002FU5QM0", "B0056BPUQC", "B004EOOAXQ", "B0068R2IOU", "B0051WAM64", "B000AM6QHO", "B00711MUTA", "B007PXV2KM", "B0038W0NEU", "B005FE72PW", "B0006FFO9G", "B004A5TMG4", "B002FU5QMA", "B0029Z9UNW", "B00GNHPFRW", "B0039NM52Q", "B004CCINMY", "B0025VKUQQ", "B001QXDSMM", "B003INFEG6", "B0000C20V3", "B00DQMJE7E", "B009T9YU4K", "B004N31D9W", "B0015C30J0"], "buy_after_viewing": ["B003VAHYTG", "B003VAK1FA", "B0027VT6V4", "B00KTT5N4U"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]]}