{"asin": "B003SNITOA", "description": "Fill a tiny space with a big sound while you charge your iPhone or iPod with the compact Altec Lansing M102 Octiv Mini. An innovative alternative to standard chargers, the Octiv Mini speaker system delivers clear, powerful sound, so you can enjoy all your favorite songs while your iPhone or iPod charges. The Octiv Mini is small enough to fit just about anywhere--on a kitchen countertop, office desk, or bedroom nightstand. Even alarm functions can be added with the free, downloadable Alarm Rock app.M102 - Octiv MiniAt a glance:Charges your iPhone or iPod while you listenWorks with all iPhone and iPod modelsCompact design, small footprintAdd alarm functions with the free Alarm Rock appShielded for mobile phones to eliminate interferenceThe Octiv Mini not only delivers great sound--it also has a small footprint.View larger.Works with all models of iPhones and iPods--charge up and rock out.View larger.Charges your iPhone or iPod While You ListenEnjoy the convenience of charging your iPhone or iPod while you play your favorite tunes. The Octiv Mini delivers clear, rich sound that you would expect from a larger system, while simultaneously charging your iPhone and iPod.Sleek, Compact Speaker Fits AnywhereThe stylish and sleek Octiv Mini not only delivers great sound, it has an exceptionally small footprint. Measuring a mere 3.8 x 4.0 x 5.3 inches (H x W x D), it fits just about anywhere. Whether you're in the kitchen, bedroom, shop, or office, there's always space for the Octiv Mini.Free Alarm Rock AppMake your morning routine a little more exciting with the free Alarm Rock App. Downloadable to your iPhone or iPod (with iPhone OS 3.1 or later), the Alarm Rock App adds alarm functions that wake you to music. Fun, functional, and free--it doesn't get better than that.Compatible with All iPod and iPhone ModelsThe Octiv Mini works with all models of iPhones and iPods, so all you need to do is dock, play, and charge. And it comes with both the \"Works with iPhone\" and \"Made for iPod\" certifications, so you're assured that it meets Apple's strict performance standards.Shielded Design Eliminates InterferenceThe Octiv Mini's design ensures that your music will come through loud and clear. With built-in shielded protection, you won't have to worry about getting magnetic interference from mobile devices.About Altec Lansing: 70 Years of Audio InnovationFor more than 70 years, Altec Lansing has been shaping the history of sound delivery, and is viewed by many to be one of the world's most innovative and valuable audio brands. The company boasts a unique history of invention that includes the introduction of the first \"talkie\" film speakers, the first set of desktop computer speakers, the first iPod docking station, and the first \"Works with iPhone\" speaker system. Altec Lansing LLC is headquartered in Milford, PA.What's in the BoxAltec Lansing M102 Octiv Mini.", "title": "Altec Lansing Octiv Mini Speaker System for iPhone and iPod (Black)", "price": 29.95, "imUrl": "http://ecx.images-amazon.com/images/I/31IR8XhILbL._SY300_.jpg", "related": {"also_viewed": ["B0038W0N8G", "B003ZQYVVK", "B002I636XM", "B004CZ7QRE", "B001ELK2NY", "B008Y5GHCI", "B004CYKEBK", "B005IVL0UA", "B004CZ7XWW", "B008BLDI4U", "B002Y5XQYG", "B00539J63K", "B002I636YG", "B002I3OZ7G", "B003Y3BFB8", "B004TS2AP2", "B00AWRPIWQ", "B003BIFJOA", "B003SX0NFI", "B003SX0NG2", "B004SKBJ5S", "B0040YGJDY", "B005IVL0SM", "B001S0LU96", "B0017XMN7C", "B00DXYDCIW", "B003VANOI6", "B004I8WH8I", "B004UBONK8", "B006KZ0R1Q", "B004M8SU1C", "B001FWXDZQ", "B005OYR9D8", "B0060DVYW4", "B0064XTQ98", "B009CWRVH2", "B004VFH7G0", "B001NXYXX8", "B00703BOV4", "B0035WTCVI", "B00462QC2I", "B00GYHCUXI", "B002O3W3Y2", "B004I4YRR6", "B000M5UO04", "B007PZYBSA", "B00E0HHJZI", "B008N73V7G", "B00171PB6O", "B004HD5326", "B009I7XCYM", "B002HJHRC6", "B004I8WH9C", "B004TS2AO8", "B00JMUPHGQ"], "bought_together": ["B0015RB39O"], "buy_after_viewing": ["B0038W0N8G", "B002I636XM", "B003ZQYVVK", "B00AWRPIWQ"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}