{"asin": "B000WQWPOQ", "description": "Prototypeis a single player, open-world action game where players take control of shape-shifter Alex Mercer. In this gameworld you literally are a genetic prototype hiding in human form. You step out onto the streets of New York with no memory, but limitless potential power. As a terrifying viral epidemic sweeps across Manhattan, top-secret Blackwatch Special Forces move in, transforming it into a war zone. Delve into the mysteries of your origin, the true nature of your power and your part in a conspiracy 40 years in the making..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Battle through an infected NYC.View larger.Turn your body into a weapon.View larger.Consume abilities, memories and physical form of others.View larger.Combat or join special forces units.View larger.StoryAlex Mercer was once a scientist for the prominent medical research corporation, Gentek, but one day he wakes up to find himself a shape-shifter with absolute mastery over his genetic structure, but no memory of how this came to be. Taking to the streets of New York City in search of answers, he quickly encounters a web of lies and vows to rip the truth from those who have hidden it from him and the world.A few other things that Alex also learns quickly is that he is not alone in possessing amazing abilities, that there is a secret war brewing in New York City and he is on its front lines. A deadly infection has spilled out of control and the government has seized the media to stop the spread of information and has placed New York under quarantine as martial law is instated; igniting a firestorm of combat, carnage and death. As he roams the city, he faces an ever growing army of infected creatures warped and changed by the virus. As it spreads, the virus overwrites the genetics of those it infects, warping and changing their form into something else, something that seems to have been planned. The answers he seeks appear to be tied to the virus, so he rushes to discover the truth behind it, but standing against him and his goal is Project Blackwatch. An elite army specialist force, they are tasked with halting the spread of the virus at any cost and are eager to bring Alex in dead or alive to determine his connection to it. It would seem that they are potentially both enemy and ally to Alex's cause. Will Alex assist Blackwatch in its hunt, or join forces with the virus and subjugate humanity, pushing his powers to the limit as the genetic shackles of humanity fall by the wayside? That choice is up to the player inPrototype.GameplayInPrototypeplayers engage in 'Deceive or Destroy' gameplay. This allows gamers the choice to either blend in with the population and covertly progress through the story, or fully unleash Alex&rsquo;s powers, and move through New York City like a walking slaughterhouse, taking control of military vehicles, and causing destruction at every turn.Although Alex is literally strong enough to fling people and large objects around easily, his most intriguing power is his ability to 'consume' people. In doing this he acquires their memories, abilities, and their appearance. New memories help him to solve the mystery of how he got the way he is, while new appearances allow him to shape-shift into new useful forms at will and abilities allow him to maneuver in parts of the game requiring specific skills in specific situations. In addition, Alex's consumption of people also facilitates his ability to transform his physical body and manipulate his senses. Most weapons acquired in this way are outgrowths from his appendages like exaggerated blades, shields, whips and claws used for brutal close combat, but consumption also allows for powerful abilities like thermal vision, which provides for vision through smoke and obstacles, as well as 'infected vision' with which Alex can detect hotspots of viral infection throughout the city.Key Features:Fast and Deadly Combat- Shape-shift your body to the situation at hand ... from claws to blades to hammers to whips, as you choose the right weapon for the situation. Change to shield or armor for defense or use advanced sensory powers (thermal vision, infected vision) to track your enemies.Over-the-top Locomotion- Seamlessly and fluidly bound from building to building, run up walls, bounce off cars and everything in your path. Adaptive parkour lets you move freely through the open-world environments of New York City.Unique Disguising Abilities- Consume anyone at anytime, take on their appearance and assume their memories and special abilities.Deep Conspiracy Driven Storyline- Wake up with no memory of the past ... just mysterious powers and a link to a town in Idaho. Delve into the mysteries of your origin, the true nature of your power and your part in a conspiracy 40 years in the making.Parkour Inspired In-game Movement- Alex Mercer's movements are inpired by Parkour, a mostly urban activity bordering on both art and martial arts that aims at moving the human body from one point to another as smoothly, efficiently and quickly as possible. Recent examples of it gained worldwide attention in chase scenes in the 2007 film \"Casino Royale.\"Xbox LIVE Achievements- Collect a wealth of Xbox LIVE achievements and build your gamer score as you play.", "price": 29.9, "imUrl": "http://ecx.images-amazon.com/images/I/5114B-KXquL._SY300_.jpg", "related": {"also_bought": ["B004FUL9YW", "B001D7T2VM", "B001NX4DUQ", "B0056WJA30", "B000HX1P72", "B000G75AXY", "B003H0CC2O", "B002BSA1MQ", "B000P46NMK", "B0013RATNM", "B000HCQK0A", "B000FRS9II", "B0054U4A4I", "B002DC8GEK", "B002I0JA7E", "B003FBL85W", "B00795XGL4", "B004ML7WOK", "B000R0SS3Y", "B001UWGDC6", "B000RHZ9JI", "B000ZK696O", "B005C2D2MO", "B000ZKDOV2", "B000XJS00K", "B00354NAYG", "B000OLXX86", "B00432O4VM", "B001TOQ8J8", "B002BRZ8BQ", "B0076ZPYPI", "B0022TNO7S", "B007UM59AC", "B003GSZ9ZE", "B004QEV0MI", "B00309U0M6", "B002GPPPS4", "B003L8HQ7S", "B000FLZEXM", "B004EW7LSY", "B001KWFBG0", "B00319DX4W", "B001PKHRVE", "B000F3AADE", "B001ASJIRM", "B000FZZ5UA", "B002V16T0Q", "B000WSE2WM", "B004PAGJOC", "B002I0H79C", "B0050SYV70", "B000BLM5PG", "B003S2MXRA", "B004YVOCYG", "B001ASJISG", "B0014ULQB2", "B001YI0Z2U", "B002I0JAVK", "B000GPVUOY", "B000WMEEB2", "B001TORSII", "B004Y3951E", "B004UDLRMS", "B004NRN5DU", "B000ZK6950", "B001E8VB3C", "B000ZK9QD2", "B003Q53VZC", "B002I0K50U", "B003O6HGHM", "B000HKGIOA", "B006GHA8EE", "B003O6E7AG", "B000KLNLV4", "B0037LTTRO", "B0030GBUCS", "B001HWB68K", "B000MKA60W", "B001IK1BJ0", "B0050SWVIQ", "B002Z7BE1U", "B004FYEZMQ", "B0016NUZFU", "B002I0HAC6", "B002I0HBZW", "B00163LW7A", "B000FRU0NU", "B001CRQYBO", "B0050SYLRK", "B0010AYJXI", "B003PHLTDC", "B005VBVQAG", "B000X25GX6", "B002EE5ROO", "B005THAX5Q", "B000TI836G", "B0047TG2R0", "B0016BVYA2", "B0023CBY4E", "B005J5K9EI"], "bought_together": ["B004FUL9YW"], "buy_after_viewing": ["B004FUL9YW", "B001D7T2VM", "B0056WJA30", "B003O6EB70"]}, "salesRank": {"Video Games": 10497}, "categories": [["Video Games", "Xbox 360", "Games"]]}