{"asin": "B0002B90SA", "description": "Smug Statement: The Sith Lords is smart, deep, dark, and stands as the best thing to happen to Star Wars since Timothy Zahn penned the extraordinary Heir to the Empire trilogy. Much like a Padawan learning the ways of the Force from a Jedi Master, Obsidian Entertainment has embraced the teachings of BioWare, built upon the original formula, and forged a powerful sequel that will take your breath away faster than Vader ever&#xA0;could.In the five years that have passed since the fall of Lord Malak, the Dark Side of the Force has spread across the galaxy like a disease. Sith Lord attacks have devastated the Old Republic, and the Jedi guardians are on the verge of extinction. The Republic's only hope of survival lies within your uncertain hands. Awakening in a battle-damaged vessel that is spinning uncontrollably through an asteroid field, you have no recollection of your past, yet you can feel the Force flowing through your veins. Will you side with the Republic and battle the Sith scourge? Or will you fade into darkness and let evil reign?This compelling introduction pulls you into the plot, keeping you completely transfixed as you tip the scales between the light and dark and scour the cosmos for clues that will unearth your enigmatic past. The tale is paced to perfection and never once feels like it is making unnecessary detours to lengthen the experience.From HK-47's amusing \"droid prejudice\" banter to Kreia's cryptic messages, the game is overflowing with fascinating personalities and some of the most believable characters to ever be brought to life in a game. Again, pacing is used expertly to develop relationships with the player. As the plot unfolds, you'll be forced to decide who to trust, who to keep close, and who to keep a watchful eye on. When you communicate with your allies, your choice of words will affect your standing with them. If you have a high enough influence over them, they may open up to you and follow your ways (be it light or&#xA0;dark).The game also dives deeper into Star Wars lore as it utilizes a much wider selection of alien species, weapons, and gear, as well as planets that we really haven't seen much of in the movies or games. Obsidian can also be commended for creating not one, but two of the most fearsome and awe-inspiring nemeses in the Star Wars universe. Discovering who these Sith Lords are is another of the games exciting mysteries.On the gameplay front, Obsidian stuck to the formula of the original game, but has built upon it with little additions and subtle tweaks. Of course, this still means that your supporting party will blindly run over a clearly visible mine, load times are just as extensive, some of the loose ends in the plot are not tied up (what's up with the HK droids?), and slowdown occurs when too many characters engage in battle. In short it still has its annoyances, yet the new material more than makes up for them. As you engage in conversation, you can now tap into your skills to add a new level of persuasion. For instance, if your character is knowledgeable to the subject matter, you may be prompted with an awareness option. Another interesting addition is the ability to break down items into components that you can turn around and use to create a wide variety of things.The missions that you'll undertake are just as varied, and the consequences to your actions can be just as cataclysmic. A raised level cap won't stunt your characters growth this time around, and the variety that stems from the new character interactions only heightens the reasons to play this game numerous times. Many of the visuals are a bit underwhelming, but the detail in the facial modeling is much more defined, and you won't see as many unintentional identical twins throughout your&#xA0;journey.It's almost impossible to deny the charms that emerge from this title's expertly crafted story and unbound freedom. The Sith Lords is a crowning accomplishment for video games and one of the finest Star Wars stories ever told.Concept:A Star Wars mystery set in the old times that offers up a fantastic story and role-playing blissGraphics:Better facial models, but the environments are still bland and slowdown does occurSound:The score fits perfectly into Star Wars canon, and the character dialogue is some of the best to datePlayability:The same engine with a few enhancements around the edges. Influencing characters and making items are done wellEntertainment:You absolutely have to play it twice to see where the story goes for light and darkReplay:HighRated:9.25 out of 10Editor:Andrew ReinerIssue:February 20052nd Opinion:The call of The Sith Lords is impossible to resist. Embracing the dark side, I twisted an apprentice to my corrupt will, polluted the Force with senseless slaughter, and was told by my loyal HK unit that I was like \"a delightful random cruelty generator.\" Even more than its predecessor, The Sith Lords provides countless opportunities for players to revel in the aftermath of their own choices. Essentially, anyone who said that Obsidian couldn't live up to the standards set by BioWare's first installment should be stuffing their mouths full of Bantha fodder right about now. Every exemplary aspect of KOTOR has actually been improved through expanded dialogue options, tons of alignment-specific variables, and a more engaging story. Honestly, I want to give this game an even higher score, but I just can't ignore the multitude of technical problems (like pathfinding and battle glitches) and certain key plot point omissions. Regardless, despite the imperfections, The Sith Lords crushes the feeble windpipes of any other RPG of 2004.Rated:9 out of 10Editor:Joe JubaSubscribe to Game Informer", "price": 78.99, "imUrl": "http://ecx.images-amazon.com/images/I/517N0Q1QRKL._SY300_.jpg", "related": {"also_bought": ["B000067DPM", "B00020BV1A", "B0000A1OG8", "B001ELWMHI", "B00006LEMQ", "0761547487", "B0007SL202", "0761542299", "B0001DI6FM", "B0009O7HUI", "B00005RCQJ", "B0007P8FN2", "B00008XKZM", "B0006ZJPSC", "B0001UEHP8", "B001I020CW", "B00005OWBL", "B00008DHNZ", "0345511352", "B000E61G4O", "B00129I75I", "B00005NZ1T", "B000BC1UZ6", "B000R0URCE", "B00009VE6E", "B00005NZ1G", "B00097IA88", "B00006409Z", "B0007PIEAQ", "0345511395", "B0000C6EDL", "B002K8Y23G", "B00008V6TF", "B0006SST9U", "B000F2JUOK", "B000R39GPA", "B00007F8PB", "B0000C6EDM", "B00006LU9C", "B0002IJY2U", "0345477499", "B0000C7GH4", "0345511573", "B00065W7CS", "B00009U146", "B00005NZ1I", "B00008J7NZ", "B0030EU3TG", "B00005V5LO", "B00006IJIS", "B00005EBAA", "B0007ZD79E", "B0016CQ0Q4", "0345541936", "B0002A6CQY", "B00BQMGW4Y", "B00006409Y", "B00002STFD", "B000087R8F", "B001CWXAP2", "B001TORSII", "B00009ZVHR", "B00005V6BL", "B001HWB68K", "B00005Q8LR", "B0001CNRQQ", "B000066JRN", "B00005QDPZ", "B003C1I0CO", "0345477375", "0345511336", "B0009UBR3A", "B004FYEZMQ", "B00008KTNW", "B000AOEV7Y", "B00006ZCD1", "B0030F1DOO", "B00006IR62", "B003O6G718", "B0001R0426", "B000784XIA", "B0034JKYO6", "B00006ZLP8", "B0009O7HUS", "B0065NP6NC", "B008E6ZXRM", "0345529421", "B00000JNHJ", "B000OLXX86", "B002IGIW1I", "B0000AOE9K", "B00GMFKYH6", "B001CRQYBO", "B003DNH95K", "B000SOYG8U", "B00075GLVK", "B00005R6YX", "0786918365", "B0062E3YU6"], "bought_together": ["B000067DPM", "B00020BV1A"], "buy_after_viewing": ["B000067DPM", "B0000A1OG8", "B00027CXEM", "B001ELWMHI"]}, "salesRank": {"Video Games": 1553}, "categories": [["Video Games", "More Systems", "Xbox", "Games"]]}