{"asin": "B001VKY7WU", "categories": [["Electronics", "Television & Video", "Televisions", "LCD TVs"]], "description": "(June 23, 2009)Behold smoother, bolder, more breathtaking full HD 1080p images and advanced connectivity options right on the LN40B750. The LN52B750 With the innovative Touch of Color design, the 750 features the radical Auto Motion Plus 240Hz technology, which produces an unbelievably clear picture, no matter how fast the action. The Ultra Clear Panel and an impressive 150,000:1 dynamic contrast ratio bring out the deepest, darkest blacks and pristine whites. Also helping to redefine HDTV is Internet@TV: access digital entertainment from online TV widgets with partners like Yahoo! , Flickr, eBay and others right on your TV. It&rsquo;s everything you&rsquo;re looking for in an HDTV, and more.Take your picture quality to a higher levelClick to enlarge.150,000:1 dynamic contrast ratioContrast and brightness levels achieve new heights in this LCD TV. Watch movies and shows come to life with enhanced details in very dark or bright scenes. Enjoy a more realistic, sharper picture that's sure to catch your eye.Full HD 1080p resolutionEnjoy outstanding clarity and resolution with this SAMSUNG LCD HDTV. Images are crisper and sharper with superior details.Contrast and brightness levels achieve new heights in this LCD TV.Enjoy outstanding clarity with full 1080p resolution.Auto Motion Plus 240 Hz virtually eliminates any motion blur.Wide Color Enhancer3Optimizes a given color's hue, resulting in more natural rendering of colors.Picture-in-Picture (PIP)Enables convenient, simultaneous viewing of TV programs and video or PC content sources.Game ModeEnhances dark areas, sharpens the picture, speeds up the image processing response and enhances the sounds of your games. Picture and sound quality is optimized for the special needs of gaming systems at the touch of a button.Auto Motion Plus 240 HzYour action-packed sports and movies have never looked this real. Auto Motion Plus 240 Hz virtually eliminates any motion blur, creates smooth transitions between frames and produces an unbelievably clear picture, no matter how fast the action.Response TimeA fast 2ms response time minimizes blurring of fast motion in sports programs.Ultra Clear PanelAdvanced LCD technology lets you enjoy crisp image details, natural skin tones, excellent shadow detail, and vibrant colors.Touch of Color designMake a statement with SAMSUNG's exclusive Touch of Color design. It features a hint of charcoal grey color naturally blended into the traditional piano black frame--transforming your already stylish TVs into a work of art for a look that complements any room.ENERGY STAR compliantENERGY STAR compliance assures you that your SAMSUNG model is helping the environment by using less energy while saving you money, up to 25% compared with standard TVs. ENERGY STAR is a joint program of the U.S. Environmental Protection Agency and the U.S. Department of Energy promoting energy efficiency.Warranty1 year parts and 1 year labor warranty (90 days parts and labor for commercial use), with in home service, backed by Samsung toll-free support.What's in the BoxSamsung LN52B750 52-Inch 1080p 240Hz LCD HDTV, Remote control, Program CD, Power cord, Cleaning cloth, Warranty card/safety guide, User manual, Crystal Neck Swivel stand/hardware.Accessories2010 LinkStick:Connect wirelessly to a world of digital content from Samsung. The LinkStick wireless LAN adaptor eliminates the hassle and cluttered look of wires. Learn more about theSamsung WIS09ABGN LinkStick Wireless LAN Adapter.COMMENT: ==========================================COMMENT: ==========================================Medi@2.0Medi@2.0 lets you enjoy more with Internet TV, allowing you to receive content via Yahoo!, Flickr, and more on screen. It also includes a content library so you can enjoy pre-loaded content, such as cooking recipes and fitness exercises. Plus, DLNA CERTIFIED connectivity lets you remotely access your PC's personal media so that you can download music, video, and photos and enjoy them anywhere in the home your TV is. Finally USB 2.0 multi-media center lets you connect a thumb drive or a digital camera quickly and easily.&nbsp;Current Widgets&nbsp;eBayGet real-time updates, place bids, monitor your favorite items, view photos and compare prices with the press of your remote. You won&rsquo;t miss a buying or selling opportunity with the eBay TV widget.&nbsp;RallyCastTrack fantasy league scores, standings, and player stats in real time while you watch the games on TV.&nbsp;TwitterKeep in touch with people and share real-time updates and frequent answers while you watch TV.&nbsp;FlickrShare photos with family &amp; friends and browse the latest photos posted by the Flickr community.&nbsp;YouTubeShare your favorite YouTube videos without having to gather around a computer screen.&nbsp;Yahoo! WeatherChoose a location and get a snapshot of current weather conditions, the 5-day forecast and more.&nbsp;Yahoo! NewsGet breaking news, headlines, and top stories from leading news sources, designed for the big screen.&nbsp;USA Today SportsGet the latest sports scores, stories, and snapshots, as the news happens from USA TODAY.&nbsp; &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Widgets allow you to track local weather with Yahoo, access eBay, display Flickr pictures and see Twitter updates - all on your screen. With a split-screen display, you can do it all without missing a second of your favorite shows. And now, you can also get movies on demand via blockbuster and Amazon Instant Video.COMMENT: ==========================================COMMENT: ==========================================Which Size HDTV is Right for My Room?With standard-definition TVs, the rule used to be that viewers would feel comfortable watching a set from a distance of 3 to 6 times the screen size in inches. With HDTV, the resolution is so much better that you can sit closer to a larger TV without noticing the pixels. So with HDTVs, the rule tends to be you can sit anywhere from 1.5 to 3 times the screen size (in inches) for the best experience. If you know the size of the room you have already, where you want to sit, and where your new HDTV should go once you get it, you can figure out the size HDTV you should get.Minimum size = Viewing distance/3Maximum size=Viewing distance/1.5Connections4 HDMI (High-Definition Multimedia Interface) version 1.3: 3 rear/1 sideAnynet + (HDMI-CEC): allows the TV's remote control to operate at the push of one button, peripheral AV devices such as a DVD player featuring HDMI-CEC.2 USB 2.0 Movie: side2 Component video: rear2 Composite inputs: 1 rear/ 1 side (shared with component)1 Optical sound output1 PC input: rear1 Ethernet: rear", "title": "Samsung LN52B750 52-Inch 1080p 240 Hz LCD HDTV with Charcoal Grey Touch of Color", "price": 34.99, "salesRank": {"Electronics": 58487}, "imUrl": "http://ecx.images-amazon.com/images/I/513ajlSUlzL._SY300_.jpg", "related": {"also_viewed": ["B0028YB8MA", "B0076LY17E", "B004VC1PCA", "B006ZH0MGY", "B00EA650XM", "B00K4UIOE0", "B00752R9W8", "B004NOVLRK", "B002HDZNSC", "B0036WT4JW", "B0078LSTRK", "B0074FGSBY", "B007BG54H0", "B002669XKY", "B00K4UJ318", "B0078LN0K6", "B00ID2HGP4", "B00BP54QNG", "B00I94IRIQ", "B006ZH0N68", "B00I94IR4K", "B00I94IPTW", "B0074FGW5G", "B00BCGROJG", "B00KQRFLZQ", "B004N866SU", "B00IRSX900", "B00BCGRRWA", "B0096YOQE2", "B00BCGRLUI"], "buy_after_viewing": ["B0079KZZKO", "B003L1ZYYM", "B0012S4APK", "B004XC6GJ0"]}}