{"asin": "B00024DIDK", "related": {"also_bought": ["B00005N5X2", "B0016LG0CY", "B001D0LMG2", "B0000ATNH3", "B002KO63X2", "B000H2W270", "B001JT0CGI", "B00042LC9M", "B00000K2YV", "B00005Q4ZV", "B000QB917Q", "B001JT37VK", "B002IP3WV4", "B00317HUWU", "B0002HRBSU", "B00G620ZVU", "B001AAT94W", "B001JT33F0", "B000X380KQ", "B004X84B5K", "B000X381K0", "B00006JPES", "B004J1FYFM", "B005AUJXLM", "B004ULN610", "B003DRJ738", "B004IA5BQQ", "B002KRME3C", "B002UL0WEQ", "B000K8IZMC", "B000WYYP14", "B002UL0WH8", "B00HMDQ4RQ", "B001JT3DYQ", "B00603DSGO", "B001JT36IY", "B00ESBOL3E", "B001JT58OY", "B00FQ0ROZS", "B000X3EP7I", "B000FSADEA", "B000I5NQA8", "B004PGMFI0", "B00083KUVS", "B00002N9ER", "B00000K2YR", "B0096GPTG4", "B001JT5QHS", "B00EUUNJRM", "B000UTQUAK", "B00D8RYGOI", "B004M905NM", "B000X39TFG", "B00BF2V8ZS", "B0094XXIL2", "B002UL31G2", "B000ZIC18Q", "B000X39TOM", "B001JT7DDI", "B005ZLB0E4", "B002LZB0J2", "B0039QC6KE", "B001JT0MJA", "B003D10QR0", "B001GH1PU0", "B00C0XCHKG", "B0036UI1OI", "B001JT98S6", "B0002BA570", "B001DZO7KU", "B003EB38C4", "B00006JPEU", "B0071HZLDG", "B001JT5PH4", "B000X3D7PE", "B001JT74EG", "B00176RNLA", "B001TE0IMG", "B006D9W22G", "B001JT5OL6", "B00005N5X1", "B001DN1L6K", "B001DMXRBI", "B005UURCIS", "B000EBMLIY", "B001JT14SI", "B00AZPI0NE", "B000X3C9AS", "B00006JPER", "B000KEUFME", "B000X3C8L8", "B004P9DQLC", "B000X39TCY", "B004DF7C8Q", "B00004TKVD", "B009ES619S", "B000IXAJVY", "B001JT97C8", "B001JT72HK"], "bought_together": ["B0016LG0CY", "B00005N5X2"], "buy_after_viewing": ["B00176RNLA", "B00004VXNI", "B0016LG0CY", "B005ZLB0E4"]}, "title": "Midland 1001Z 40-Channel CB Radio", "price": 33.98, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41JtT1IRXrL._SY300_.jpg", "brand": "Midland", "categories": [["Electronics", "Portable Audio & Video", "CB & Two-Way Radios", "CB Radios & Scanners"]], "description": "The Midland 1001Z two-way, 40-channel CB radio represents the state of the art in CB engineering. Incorporating microprocessor controlled PLL circuitry for precise tuning, it boasts 4 Watts of power, an emergency channel, digital power signal strength meter, squelch control, external speaker and PA speaker jacks, and plenty more. Installation is a breeze in most cars, trucks and RVs. Perfect for novices and long-time CB users alike.Perfect for novices and long-time CB users alike.Click to enlarge.View front panel control diagram.Click to enlarge.View microphone details.Click to enlarge.1001Z Features4 Watt Output PowerThe maximum power allowed to give you the maximum communication range.CB/pa switchAllows the CB to be used as a Public Address System when paired with a PA speaker.Instant Channel 9Immediate access to emergency - channel 9.RF GainAdjusts reception sensitivity range for clear communication.Front panel locking mic connectorEasy to connect microphone locks securely to CB.Digital Power meterDisplays incoming signal strength and RF output power.Squelch controlRemoves background noise.LED DisplayLarge high-intensity channel readout. Easy to read day or night.ControlsOn/OFF/Volume knob, Squelch knob, RF Gain knob, Tuning knob, CB/PA switch, Instant Channel 9 switchJacks and connectors4 pin locking mic connector, antenna connector, external speaker connector, PA speaker connector and DC power cord connector.Midland Radio CorporationMidland Radio Corporation is an international industry leader in wireless communications with affiliates in Italy, Bulgaria, Germany, Poland, Russia, Spain, and the United Kingdom, as well as representation in Latin America.  Midland develops high quality consumer products such as GMRS Two-Way Radios, Citizen Band (CB) Radios, Marine Radios, Bluetooth intercom systems, and All Hazards/Weather Alert Radios.  Also, as a leading manufacturer of Land Mobile Radios, Midland supplies professional grade analog and digital (P25 Technology) Portables, Mobiles and Base Stations/Repeaters for government entities such as forestry, public safety, and other commercial users.Known in the '70s primarily for CB radios and household electronics, Midland has grown with the times by producing innovative new communications products and by actively promoting public emergency preparedness.   Midland has manufactured quality Two-Way Radios for the last 50 years and is a market leader in several individual categories.What's in the Box1001Z CB Radio, Microphone, Mounting Bracket and Hardware, Owner's Manual"}