{"asin": "B00020LZAM", "description": "Jak 3concludes the Jak and Daxter trilogy with a truly plot-driven adventure game filled with friendship, betrayal, death, and a long-awaited understanding of the Precursor civilization that has, until now, remained a mystery.One year has passed since Jak and Daxter saved Haven City from Kor and the attacking Metal Heads, yet Haven City is still immersed in deadly chaos as three groups fight for control of the streets. The people of Haven City have grown to distrust Jak's dark powers, and as rumors boil of Jak's ties with Krew and Kor, the city blames Jak for its current woeful circumstances. When the palace is destroyed by a surprise Metal Head attack, even Ashelin cannot protect Jak as the High Council's power broker, Count Veger, forces Jak into banishment to the desolate Wasteland. Jak is flown to the harsh island and dumped. With Daxter and Pecker bravely by his side, the three begin their next adventure where the battle for the city has just begun.Five times the size of Haven City, the Wasteland is a desert environment with multiple areas including mines and a volcano. Given the enormity and variance in terrain, vehicles play a large role as off-road transportation is introduced, fueled by a true-to-life physics engine. With a rugged new look and suited with armor, Jak is also equipped with an arsenal of new weapons with upgradeable mods that enable players to increase their firepower and enjoy the freedom to strategize and activate their arsenal at any time.As Jak has been exposed to Light Eco, players can now experience Jak's magnificent transformation to Light Jak. With a glowing electric blue aura and a massive wing span, Light Jak introduces new move sets, including the ability to glide great distances, emit an energy to block enemy attack, and power up at anytime, all of which provide the player with a sense of being invincible. Dark Jak also returns with more capabilities, forcing Jak to find a balance between light and dark.Additionally, game developer Naughty Dog continues to push the genre forward with the introduction of new technology. For the first time in the franchise, enemies feature realistic ragdoll physics, which will allow gamers to witness a unique death for each enemy that is killed. Naughty Dog has also implemented independent cloth movement technology and enhanced the enemy artificial intelligence (AI) with wall climbing and smart formation capabilities.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51eR38rBjtL._SY300_.jpg", "related": {"also_bought": ["B000099T1Y", "B00005R5PO", "B002DGG9KY", "B00020LZBG", "B000099T2E", "B000056C34", "B00006GSNX", "B0009I6S0Y", "B0000690ZE", "B0009F3E1I", "B00004TNB0", "B0009A4EVM", "B00004YRQA", "B000066TS5", "9629971372", "B000G6SPHI", "B002KIK8FW", "B0000C7GHG", "B0002XL3BA", "B000TLU67W", "B00009ZVHY", "B001MW91IW", "B00005TNI6", "B0009O7HVM", "B0013JHKU0", "B00127VDVK", "B001G3B0HC", "B00004YRQ9", "B0002RQ3ES", "B0009I6S0O", "B00008NRM7", "B000TYQL1O", "B000B69E9G", "B00006F2ZP", "B0013KW1B2", "B00097CYZS", "B002BWS5QG", "B00005NCCI", "B00009VE6D", "B000E49SGE", "B000E991PC", "B000IVIP7G", "B000IZAQD8", "B0032GPYO6", "B0009EHQVI", "B0000A0MDV", "B001VLFCVE", "B004S3KB6S", "B0000B0MNH", "B0002RQ3I4", "B0009350BW", "B00006Z7HU", "B00008URUA", "B000034DC2", "B0002Y2XXQ", "B00005U8TQ", "B003OPX7K8", "B000EHQDA0", "B0002IQC8E", "B000TTXL9E", "B00006JC4A", "B00005J536", "B0001NE48U", "B00558INEC", "B00008DHNV", "B000RW3V34", "B0032GTMEE", "B0038N09Q6", "B0026FCAR8", "B000F5IH2I", "B0001ADAME", "B000FW4YOQ", "B000EXZAKI", "B00020LZAW", "B00005NN5G", "B0000A8VBZ", "B00000I1BR", "B00006JN5H", "B00005O0I2", "B000UH6GEM", "B0001CJCG0", "B001CLG6SG", "B00005Q8IR", "B00000DMAR", "B00004U8QX", "B0000696CZ", "B00005NCCR", "B000034DCF", "B00006GSNZ", "B0000A30R8", "B00026RFI2", "B00005NUJ3", "B000QAVV70", "B0001VGFK2", "B002J9QIWY", "B0002CNUN0", "B000UC5ML0", "B00009ZVHW", "B000099T2G", "B0002RQ3IO"], "bought_together": ["B000099T1Y", "B00005R5PO"], "buy_after_viewing": ["B00005R5PO", "B000099T1Y", "B0009A4EVM", "B001MW91IW"]}, "salesRank": {"Video Games": 1686}, "categories": [["Tools & Home Improvement", "Rough Plumbing", "Pipes, Pipe Fittings & Accessories", "Pipe Fittings"], ["Video Games", "More Systems", "PlayStation 2", "Games"]]}