{"asin": "B001SER48S", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "When a camera puts a smile on your face the moment you hold it, imagine how great you&rsquo;ll feel when you see your first pictures! The PowerShot SD1200 IS Digital ELPH has everything going for it--exuberant color, the sculptured style of Canon&rsquo;s famed ELPH series--and the innovative know-how that takes you to a whole new level of picture-taking accomplishment. Fun, smart and a style that follows you everywhere.PowerShot SD1200 IS Highlights10.0-megapixel resolution makes it a breeze to print large size imagesWith the PowerShot SD1200 IS Digital ELPH, dramatic, personal pictures have never been easier to shoot and share. This 10.0-megapixel camera lets you create impressive, large photos of family and friends you&rsquo;ll be proud display. The high-resolution images taken by the SD1200 IS Digital ELPH can be enlarged up to 13 x 19 inches.The PowerShot SD1200 IS Digital ELPH is equipped with Canon&rsquo;s acclaimed Optical Image Stabilizer Technology that automatically detects and corrects camera shake--one of the leading causes of fuzzy or blurred shots. Even when zoomed in, you can get the steady, crisp, brilliant images you&rsquo;ll be proud to shoot and share. And Canon&rsquo;s Optical Image Stabilizer Technology is so convenient to use. It functions perfectly with or without a flash.Large, crisp 2.5-inch PureColor LCD II and wide viewing angleThe PowerShot SD1200 IS Digital ELPH gives you a large 2.5-inch LCD screen for excellent control when framing your shots. Canon&rsquo;s PureColor LCD II offers spectacular color, resolution and contrast even when viewed at an angle. The screen is highly durable and easy to see in any light with a scratch-resistant, anti-reflective coating. It also features Night Display for easy viewing in low light--a perfect feature for gathering friends and family around to see your images.Smart AUTO intelligently selects the proper settingsJust set the Canon PowerShot SD1200 IS Digital ELPH to Smart AUTO and you&rsquo;re ready for maximum enjoyment from your picture taking every time. It&rsquo;s a relaxing and satisfying way to shoot because you can completely concentrate on your subject knowing that the camera has the technical details covered. Advanced Canon technology intelligently analyzes your situation and shooting conditions. Then it automatically selects an appropriate setting from 18 specially defined settings. So whether you&rsquo;re photographing flowers, a captivating sunset, or your friends at the park, you can be confident that you&rsquo;re getting dramatic, memorable images.Shooting ModesAdvanced presets for the best possible photos under certain conditions. With 17 Shooting Modes, you&rsquo;re ready for whatever shot comes your way.A World of Advantages with Canon&rsquo;s TechnologyThe DIGIC 4 Image Processor has evolved Face Detection Technology that tracks the faces of moving subjects and lets the shooter enter the frame seamlessly with the Face Detection Self-Timer.DIGIC 4 Image ProcessorCanon&rsquo;s most advanced image processor, DIGIC 4, delivers evolved Face Detection Technology that keeps every face in every photo looking its very best. The technology finds and tracks the faces of moving subjects until you&rsquo;re ready to shoot, then delivers perfect focus. In addition, exposure, flash and white balance are compensated, so that faces exhibit natural skin tones and backgrounds are properly exposed.iSAPS Technologyis an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the advanced DIGIC 4 Image Processor to improve focus speed and accuracy, as well as exposure and white balance.AFace Detection Self-Timerautomatically detects an increase in the number of faces and makes the appropriate adjustments. For instance, to include the photographer&rsquo;s face in a group shot, there&rsquo;s no need to rush in. Just put the camera on a stand or tripod, specify Face Detection Self-Timer, and the camera will wait for the photographer&rsquo;s face to get on-camera before it takes the shot. Motion Detection tracks moving subjects in a much larger range--allowing you to wait for the perfect shot without refocusing.Intelligent Contrast CorrectionDIGIC 4 also makes possible the i-Contrast (Intelligent Contrast Correction) system, which controls the compensation level in pixel units to brighten dark areas while leaving bright areas unchanged for better images where the main subject is dark, and more natural transition. The PowerShot SD1200 IS Digital ELPH can even use i-Contrast in playback mode to adjust images that were shot without the setting activated.Red-eye Correctionprovides three options for removing red-eye from subjects in flash pictures. 1) Red-eye Correction during shooting actually identifies and corrects red-eye in human subjects as pictures are taken. 2) The PowerShot SD1200 IS Digital ELPH can be set to automatically detect and correct red-eye during image playback. 3) You can manually locate any red eyes in a scene during image playback on the LCD screen, and command the camera to remove them.Life doesn&rsquo;t give you second chances to capture special times. That&rsquo;s why the PowerShot SD1200 IS Digital ELPH features an ISO 1600 setting that reduces the effects of camera shake and sharpens subjects in low-light situations, giving you greater shooting flexibility. ISO can be expanded to 3200 when you select ISO 3200 Special Scene mode.What's in the BoxPowerShot SD1200 IS Digital ELPH bodyLithium-ion battery pack (NB-6L)Battery charger (CB-2LY)Wrist strap (WS-DC7)Digital Camera Solution CD-ROMUSB interface cable (IFC-400PCU)AV cable (AVC-DC400)", "title": "Canon PowerShot SD1200IS 10 MP Digital Camera with 3x Optical Image Stabilized Zoom and 2.5-inch LCD (Silver)", "price": 9.99, "salesRank": {"Camera &amp; Photo": 4334}, "imUrl": "http://ecx.images-amazon.com/images/I/416TtqXZ-bL._SX300_.jpg", "related": {"also_viewed": ["B000NK8EWI", "B0012YC7AE", "B000EMWBT2", "B000AYKUUQ", "B000ENPDSW", "B0035FZJKS", "B0012Y6AY8", "B000EN0K94", "B0012Y6958", "B0012Y84AG", "B001SER47Y", "B0035FZJKI", "B0011ZK6PC", "B000NK8L6W", "B00I58M192", "B001SER47O", "B000NK6J6Q", "B0035FZJL2", "B00AWYN0BU", "B0035FZJLC", "B00AWYN0ME", "B0035FZJJ4", "B000Q30420", "B00I58LZRG", "B004HW73SO", "B000AYJDD6", "B006UMM1AY", "B00B5HE3IW", "B006UMM15O", "B0075SUII4", "B0035FZJLM", "B00HLDFNKQ", "B00B5HE3AK", "B001SER48I", "B005I6DUKS", "B00AWYN182", "B00I58LZ80", "B00HLDFPA4", "B00I58LVKC", "B00I58M0HK", "B0032JRRXE", "B002LITT3S", "B006UMM1J0", "B00B5HE32I", "B001SER4BK", "B004J41T7Q", "B0075SUHGC", "B0075SUIEI", "B006UMM1F4"], "buy_after_viewing": ["B003VNKNEQ", "B00AWYN0BU", "B003VNKNF0", "B000NK8EWI"]}}