{"asin": "B004U403XQ", "categories": [["Electronics", "Home Audio", "Stereo Components", "Receivers & Amplifiers", "Component Receivers"]], "description": "Transforming any ordinary home theater into an extraordinary one, the Denon AVR-1912 7.1 Home Theater Receiver offers a 3D experience with exceptional picture and dynamic sound quality. Equipped with the latest inputs and network functions, this robust receiver brings out the best in your Blu-ray/DVD players, game consoles, and other entertainment devices. The AVR-1912 boasts an equal amp power design and supports multiple high-resolution audio formats, providing for an absorbing listening experience in surround sound. It also supports HDMI v1.4a, allowing you to get the most out of 3D content. Enhanced by digital network audio/photo streaming capabilities, including support for AirPlay, mp3/WMA/WAV and FLAC HD audio, and Windows 7 compatibility, the AVR-1912 will satisfy even the most demanding home theater enthusiasts.AVR-1912 7.1Home Theater ReceiverAt a Glance:Equal power amp design with seven discrete 90-watt*channelsHDMI v1.4a supports all 3D formats and Audio Return ChannelEthernet, USB, and six HDMI inputs for added connectivitySupports AirPlay for wireless music streaming from iPhone, iPad, iPod touch, or iTunesAudyssey MultEQ, GUI overlay, and remote control make setup and operation easyBacked by a two-year warrantyEqual power amplifier design offers true reproduction of original sound.View larger.Features six 1.4a HDMI ports for vibrant 3D visuals.View larger.Play songs from your iPod via a USB cable.View larger.Quick Selection buttons let you select video and music sources effortlessly.View larger.Premium Audio Technologies for Superb Surround SoundFully compatible with current HD audio formats, the Denon AVR-1912 7.1-Channel A/V Receiver provides powerful, theater-quality surround sound. It ensures maximum audio performance with multiple technologies:Equal Power Amp Design:Each of the AVR-1912's seven 90-watt*channels is powered by its own discrete circuit. This allows the receiver to reproduce original sound more faithfully than conventional models, which use integrated circuits.High-Definition Audio Support:The AVR-1912 features support for Blu-ray high-definition audio formats, including Dolby TrueHD and DTS-HD Master Audio. These formats play back sound with exceptional fidelity, providing a more realistic listening experience.Dolby Pro Logic IIz:With the option of two additional height channels, this feature adds a vertical dimension to the soundstage, providing more immersive surround sound.Audyssey MultEQ Support:Audyssey technology helps create an optimal acoustic profile for your home theater. Using the included calibration microphone, Audyssey MultEQ measures sound levels and adjusts speaker configuration accordingly, making setup fast and easy.Full HD SupportWith six HDMI inputs, the AVR-1912 allows you to route multiple high-definition devices--like game consoles and Blu-ray players--to your TV. It also allows you to connect all of your devices to your TV with a single HDMI cable, reducing cable clutter.Vivid 3D Visuals with HDMI v1.4aThe AVR-1912 comes equipped with HDMI v1.4a, allowing you to make the most of several premium video features:3D Pass-Through:With the advent of 3D media, it is important to own a receiver that recognizes 3D video signals. The AVR-1912 is able to pass through 3D signals from your Blu-ray player, ensuring that the 3D effect doesn't get lost in translation. It also recognizes signals from 3D television broadcasts.Audio Return Channel:HDMI v1.4a also features Audio Return Channel functionality, which allows for audio content from your display to be played back through the AVR-1912 via the single HDMI cable that goes from the receiver to the display. This eliminates the need for separate audio and video cables running from your TV to the receiver.Deep Color and x.v.Color Support:The AVR-1912 also supports Deep Color and x.v.Color schemes, which can display a larger color range than standard-definition schemes. The result is a more lifelike, vibrant picture.Enhanced Network Capability and iPod ConnectivityWhen connected to a network, the AVR-1912 lets you listen to Internet radio, play audio files, and display images via an Ethernet connection. The receiver also supports AirPlay, which allows you to stream music wirelessly from an iPhone, iPad, iPod touch, or iTunes. Or, connect an iPhone/iPod/iPad directly to the receiver with a USB cable.With the Denon Remote App installed on your iPad, iPhone, or iPod touch, you can perform basic operations, like turning the AVR-1912's power on or off, adjusting the volume, and switching sources.For serious audio enthusiasts, FLAC HD decoding delivers uncompressed playback of your high-definition music files. A compressed audio restorer guarantees that playback of lower resolution audio files is crisp and clear.The AVR-1912 is compatible with Windows 7 audio and photo streaming, as well as giving you convenient web control. This receiver provides online support for Pandora, Flickr, Napster, and Rhapsody, allowing you to enjoy a wide variety of online digital content at any time.GUI Overlay and Remote Control for Simple OperationWith its programmable functions and intuitive button layout, the AVR-1912 is designed for ease of use. The front panel is smartly organized, featuring clearly labeled buttons and onboard controls for volume and source. In addition, its on-screen display provides quick information about your system's settings.The AVR-1912's pre-memory remote control with Glo-Key and on-screen programming is easy to setup and use, thus giving you more flexibility in controlling your home theater.Product and Warranty InformationThe receiver measures 6-3/8 by 17-1/8 by 15-3/64 inches (H x W x D), and weighs 22-1/2 pounds.The Denon AVR-1912 7.1 Channel A/V Home Theater Multi-Source/Multi-Zone Receiver is backed by a two-year warranty.What's in the BoxAVR-1912 7.1-Channel A/V Receiver, remote control, AA batteries, setup microphone, AM loop antenna, FM indoor antenna, and owner's manual.*90 watts per channel (20Hz-20kHz, 8 ohms, .08% THD), 150 watts per channel (1kHz, 6 ohms)", "title": "Denon AVR-1912 7.1 Channel Network Streaming A/V Home Theater Receiver", "price": 599.0, "salesRank": {"Electronics": 24451}, "imUrl": "http://ecx.images-amazon.com/images/I/41uHlRGECIL._SX300_.jpg", "related": {"also_bought": ["B001202C44", "B006U3O566", "B00752R4PK", "B0043M666S", "B003BKW2K2", "B0029HHIDY", "B0019EHU8G", "B003FVYXY0", "B003FW0WIK", "B002HPNDDW", "B002IC0YL8", "B0002KMQJ6", "B00006BMQT", "B00006I5O6", "B004L9DGCK", "B000092TT0", "B0000CFYOL", "B001QNBUA4", "B002WNAFSU", "B001UAFJ0K", "B006U1YUZE", "B000WXAX6G", "B00002EQCW", "B003VIWK0G"], "buy_after_viewing": ["B00B7X2OTY", "B00B7X2OV2", "B00CALM2KS", "B001202C44"]}}