{"asin": "B0014G98WA", "description": "The only thing better than watching stylized samurai battles with Samuel L. Jackson's voice booming in your ear is controlling the character as it all happens. And now you can, with Afro Samurai for the Xbox 360. Based on the popular anime series, Afro Samurai will finally let gamers control their favorite samurai as he violently slashes through an eclectic lineup of assassins, ninjas, and robotic thugs..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }The voice acting is done by Samuel L. Jackson, who brings along his usual flair.View larger.The Focus maneuver lets you low down time and perform precision hits.View larger.The Story UnfoldsSet in a futuristic, yet feudal Japan, this story follows a samurai named Afro after his hair. Afro has set out to try and avenge his father's murder by a man named Justice. Justice murdered Afro's father to claim the 'Number One' headband, giving himself the chance to rule the worldAfro Samurai is based on the popular and stylistic anime of the same name.View larger.with powers akin to a god. The only one allowed to challenge Number One is the person with the 'Number Two' headband, but unfortunately for Afro, the current owner of the headband, anybody and everybody can, and does, challenge Number Two. But never fear, as this new title includes brand new material and background for fans of the series and newcomers alike to enjoy.Loads of Stylized ActionAfro Samurai brings gamers a balanced experienced, with stylistic combat and acrobatic platforming combined with the ability to dynamically slice and dismember enemies in unending ways. While gamers can hack and slash their way through many foes by combining heavy and light attacks with just two buttons, accomplished players will master moves like the Deep Throat Killer, where they pierce their opponent's neck and rip everything loose in a crimson splash.Players will also need to learn the Focus maneuver with its bullet-time effect. This allows the user to slow down time and designate a specific strike zone, which with the right timing and skill can allow Afro to cleave an enemy in two or slice a limb completely off. And since characters are not pre-rendered you don't just get a canned scene when you cut through your enemy, giving you endless ways and means to cut your enemies down to size. This ethos is applied game-wide, as Afro is allowed to interact with anything and everything in his environment to help him on his journey.Star-Studded Supporting CastSamuel L. Jackson reprises his role as both Afro and Ninja in the game, and the same striking art style that made the anime series so popular provides the unique look and feel across beautifully animated open environments. And for those of you who are wondering, developers Namco Bandai let Jackson ad-lib a lot, so be prepared for his branded vulgarity and the M rating it helps the game earn.Meanwhile, Ron Pearlman and Kelly Hu continue on in their roles as Justice and Okiku, while RZA of Wu-Tang Clan fame has created all new tracks for the hip-hop inspired soundtrack. And thanks to an innovative gameplay system, the enemy AI and tone of the game are affected by the beat of the musical score, for a truly immersing experience.With its visual stunning graphics, and fluid and graceful movements, Afro Samurai will provide hours of entertaining, balletic action. Add to this ground-breaking elements like health that is represented by the blood on your clothes, or your enemies', and you have a game that simply can not be passed up.Slice and dice your enemies in a glorious number of different ways.", "price": 38.99, "imUrl": "http://ecx.images-amazon.com/images/I/51g72VKqGyL._SY300_.jpg", "related": {"also_bought": ["B000XJS00K", "B002KPIO4C", "B001KWFBG0", "B001PKHRVE", "B002GPPPS4", "B000SH3XD6", "B000ZK696O", "B00319DX4W", "B002I0K50U", "B0054INKZK", "B000XJNTPG", "B0087Y3M5G", "B0058VI0SU", "B00G6MW612", "B000LP5FWC", "B000ZJVDA2", "B001UWGDC6", "B004EW7LSY", "B001LXDGQA", "B004L9WGDA", "B000F3AADE", "B003H0CC2O", "B008XMSRKC", "B004FUL9YW", "B0009WPZM2", "B007UM59AC", "B00354NAYG", "B0016NUZFU", "B001YI0Z2U", "B002I0HAC6", "B004P6IVPQ", "B008LW4SBQ", "B005DVAB1Y", "B000ZK698C", "B005J5K9EI", "B000QW9D14", "B0016NRS28", "B000NNFJQY", "B000R0SR9E", "B000R0SS3Y", "B00309U0M6", "B003IE9V28", "B001D7T2VM", "B008E6ZXRM", "B007UMD1EI", "B004JSDQPU", "B0044SA70M", "B00149ILCK", "B0076ZPYPI", "B000P297E8", "B000HCQK0A", "B001ASJIRM", "B000FRS9II", "B0015HZLVA", "B003O6G6G4", "B004RIACPY", "B0050SY4DG", "B002BSA1MQ", "B0016BVYA2", "B0050SY9WC", "B0056WJA30", "B0023CBY4E", "B000WMEEB2", "B001ASJISG", "B004LWEKCM", "B002C0VNVG", "B000FLZEXM", "B0030MOTNE", "B001E7MMNQ", "B0030HIULQ", "B002I0H79C", "B000O5DS32", "B001TOQ8MU", "B000WSE2WM", "B000GPVUOY", "B001BC948U", "B001CRQYBO", "B005VBVQAG", "B000Q36UJQ", "B003O6HGHM", "B0007PLKZM", "B0056WJA76", "B00BFU8IBC", "B0000269IF", "B000ICV996", "B000UUFQZE", "B0014ULQB2", "B001989B4S", "B006HPLJFC", "B004ML7WOK", "B004FYEZMQ", "B007IFMFYE", "0345520726", "B005THAX5Q", "B000UCKELI", "B002BRUTT2", "B002I0J998", "B000MAFXUA", "B001NX4DUQ"], "bought_together": ["B000XJS00K"], "buy_after_viewing": ["B002KPIO4C", "B001AII4WM", "B0050SY9WC", "B001LXDGQK"]}, "salesRank": {"Video Games": 14219}, "categories": [["Video Games", "Xbox 360", "Games"]]}