{"asin": "B004GIZ61K", "categories": [["Electronics", "Television & Video", "Streaming Media Players"]], "description": "The EP350 G2 is a powerful network digital media player and storage device that offers an unbeatable combination of features and performance. Not only does it handle playback of a wide range of media files including Full-HD 1080P videos, it can also act as a centralized storage location for media files and make them available to other devices on the same network. With so much capability packed into the EP350 G2, it can be the hub for all your home media entertainment needs.A Universal Media PlayerThe EP350 G2 provides flawless playback for all of today's popular media file formats! It is able to handle high definition videos perfectly all the way up to 1080p Full-HD resolution.- Video Files: AVI, MKV, MP4, M2TS, MOV, DAT, VOB, IFO, MPG, TS, TP, WMV, ASF, RM, RMVB, FLV, ISO- Video Codec: H.264/AVC, MPEG1/2/4, DivX/Xvid, VC-1, RMVB- Audio Files/Codec: AC3, TrueHD, DTS, DTS-MA/HR, MP3, WMA, AAC, OGG, FLAC, M4A, WAV- Photo Formats: JPG, GIF, PNG, BMP, TIFUp to 2TB of Internal StorageThe EP350 G2 contains an internal 3.5\" SATA HDD bay for up to 2TB of storage space. This internal storage provides a central location for all your media files with fast and stable playbackFast LAN and 802.11n Wi-Fi ReadyThe EP350 G2 has a built-in 10/100mbps fast Ethernet LAN connection. Unlike other network enabled media players, the EP350 G2 uses the network not just for playing media files on other devices, but also for serving media files to other devices. The EP350 G2 can play media files from UPnP media servers, manage BitTorrent downloads, access web services like Flikr and Picasa.NOTE: 802.11n Wi-Fi (Not Included) streaming speeds vary, Ethernet LAN required for high bit rate videosWhat's Included- EP350 G2 Digital Media Player- IR Remote Control- 110-240V AC Adapter- Composite AV cables", "title": "Micca EP350 G2 1080p Network Digital Media Player with 7.1 HD-Audio, Fast LAN, 3.5&quot; SATA Bay (Realtek 1185)", "price": 159.95, "salesRank": {"Electronics": 41589}, "imUrl": "http://ecx.images-amazon.com/images/I/3130aF1o51L._SX300_.jpg", "related": {"also_bought": ["B004VFJ9MK", "B0069MGRG4", "B008YAHW6I", "B00CHDSPSM", "B002XVBAKI", "B005W8M09E", "B008NO9RRM", "B004RORMF6", "B0053YKMGA", "B005T3GRLY", "B005T3GRN2", "B006FNCWSY", "B002RCKDEC", "B008CBQSKU", "B0088PUEPK", "B004GK0GKO", "B006GDVREI", "B002ZCXK0I", "B00B9996LA", "B005KOZNBW", "B00834SJU8", "B008JJLZ7G", "B004Z0S6WK", "B002ZCXJZE", "B0027AGK3M", "B00APP6694", "B008JJLW4M", "B00EHBEUZO", "B00834SJS0"], "buy_after_viewing": ["B00CHDSPSM", "B008NO9RRM", "B002XVBAKI", "B005KOZNBW"]}}