{"asin": "B001H8Y7DA", "description": "The Million World universe lies under threat from the mighty One King, who harbors a plot to sow chaos throughout its vast expanse. The only ones who stand a chance of opposing the One King's plan and thwarting his evil machinations are the 108 Stars of Destiny, a group of magical warriors. When the members of the 108 Stars of Destiny come together, it will unleash a stunning battle of good vs. evil that will span the Million World universe's near-infinite parallel worlds.Customize Your CharacterView larger.Suikoden StorylineView larger.Lush EnvironmentsView larger.SynopsisIn Suikoden: Tierkries, the first handheld game in the enduring Suikoden RPG series, you'll use your DS to gather the members of the 108 Stars of Destiny and help put a stop to the One King's plan. Explore the vast Million World universe as you travel across parallel worlds to a variety of exciting cities, and experience a gripping, cinematic storyline that will immerse you fully in the battle to overcome the forces of evil. Send your warriors on exciting quests via the Nintendo Wi-Fi Connection to level up your characters and savor the game's rich online community.Key Game Features:Experience the excitement of the first handheld game in the long-running Suikoden RPG seriesGather the magical warriors who comprise the 108 Stars of Destiny to thwart the mighty One King's sinister plan to create chaos throughout the universeTravel across a universe of exciting parallel worlds in which you'll discover a variety of exotic locations and culturesSavor a cinematic gameplay experience complete with new characters, rich animation sequences and gripping dialogue with voiceoverSend your characters on quests to be completed by other members of the Suikoden: Tierkreis community via the Nintendo Wi-Fi ConnectionSuikoden goes online via Nintendo WiFi Connection!This all new, epic RPG in the long running Suikoden series incorporates many innovative features to the handheld RPG genre. An active online community experience is encouraged by allowing players to send their characters on quests that other members of the Suikoden: Tierkreis community will complete for them via Nintendo WiFi Connection. As your character travels around the community and completes quests he will eventually return to your party with new abilities and treasures. This provides a new way to level up characters your characters which helps create a sense of community and provides a new way to experience RPGs on handhelds.", "price": 87.97, "imUrl": "http://ecx.images-amazon.com/images/I/61-V0Y%2BqA4L._SX300_.jpg", "related": {"also_bought": ["B004CVWETI", "B002DC8GWW", "B001NJKHWI", "B003UI518A", "B001NJMMHG", "B001A01FD0", "B002I0EH6I", "B003O8EDUS", "B002I0GKIQ", "B0009Z3KB2", "B001TOMR6Q", "B00KWIYPZG", "B000SSQPU8", "B001E27DLM", "B00KVRK39A", "B001AF1NVY", "B000P46NK2", "B00184219U", "B002L0G58I", "B000CC5CHW", "B001COZFPI", "B00136MBHA", "B001O1PAMC", "B001QLC2YY", "B0054J1LBO", "B002I08WVY", "B001C4J62Q", "B00006LEMK", "B000GHG9VG", "B002EE5RKI", "B00GV4V8XC", "B002AF4XI8", "B00KWFY04A", "B003UI518U", "B000Q6ZLMA", "B00JKM09Z0", "B002I09286", "B0010YOQIM", "B000GABOTU", "B002BRWU8U", "B001QTW2IC", "B00KBD4SJA", "B001HBF1MS", "B003S55EX2", "B002TDIEDG", "B0002SQ0AY", "B002KHQKUK", "B00171NYHM", "B00AKIPBNS", "B00DZIX39E", "B009LEIUY4", "B00006LEM8", "B008BERJEM", "B001BWRBA8", "B00BAWXD88", "B0009XEC02", "B000FW4OHS", "B001NJRR7G", "B0009Z3K9E", "B0012NWBH4", "B00H45K6KS", "B003IOGPAO", "B00001X50L", "B000IOM45C", "B001G9F9JQ", "B002EWD02C", "B00007KQC1", "B00GV4V8YQ", "B000SSPI4C", "B000GIXIPK", "B00I3DOZ8O", "B000NVKZ06", "B000B69E96", "B00104KJ2E", "B0050SVP4W", "B0089X37NW", "B002DC8GVI", "B002WSR8DU", "B00KWFCU4M", "B0009A4EUI", "B00KY59REG", "B00K2O4O6U", "B001INDEOW", "B00HHIPQ98", "B001OALQIA", "B001GMSHSI", "B002BS4834", "B000R37S78", "B00B67ZS3U", "B0009F3QSE", "B001CU4EJ0", "B000CI83LI", "B0018YDKAE", "B001YHVA84"], "bought_together": ["B004CVWETI", "B002I0EH6I"], "buy_after_viewing": ["B004CVWETI", "B002I0EH6I", "B00GV4V8XC", "B001TOMR6Q"]}, "salesRank": {"Video Games": 8216}, "categories": [["Video Games", "Kids & Family", "Nintendo DS", "Games"], ["Video Games", "Nintendo DS", "Games"]]}