{"asin": "B0009STJIW", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Keyboards"]], "description": "Save money and desk space with the Macally BTKEYPRO. One unified keyboard pairs up to 5 devices.  Pair them all via bluetooth to prevent wire tangling.  Ultra slim, full-sized keyboard with soft keys that are comfortable to the touch.  Lightweight and portable and designed for the multitasking.  The BTKEYPRO allows you to keep working while you stay connected to your family and friends.  Works with iOS phones/tablets, Android phones/tablets, Apple computers, and PCs.  Features an array of shortcut keys that work across different platforms.  Whatever device you have, the BTKEYPRO makes sure you don&#x2019;t miss a single stroke.  By pressing a single key, you can instantly switch among all your paired devices.  Manage the work on your computer and your mobile devices with the press of a button.  In case out of battery, there is also a wired USB option as well.  When connected through USB it will run from computer or other power source.  Mac OS X 10.6 to 10.9.  Windows XP/7/8, iOS 5.0 and above.  Android 3.0 and above.", "title": "Macally Quick Switch Bluetooth Keyboard for Mac, iPad, iPhone, PC, Tablets and Smartphones Wired (BTKEYPRO)", "price": 36.69, "imUrl": "http://ecx.images-amazon.com/images/I/41TmKfukbnL._SX300_.jpg", "brand": "Macally", "related": {"also_bought": ["B007476KRY", "B0009VU7RG", "B008LTBJFW", "B0093H9EXA", "B003BHHIA4", "B001NXDQBI", "B007477COO", "B005DLDTAE", "B009K916ZK", "B0044RUSZM", "B005C9U00E", "B00EQ94566", "B002DW90CC", "B000OOYECC", "B005058AH0", "B004CAHTCQ", "B008ALAHA4", "B0019804U8", "B008AL9VXI", "B001MGPYDE", "B001TH7T2U", "B004S4R5CK", "B008ZGKWQI", "B00DRIRGAO", "B003OC6LWM", "B005BZNDS0", "B00483WRZ6", "B008ALA6DW", "B009QBIZ60", "B003Y3BJ7S", "B004CADYDO", "B000JE7CMG", "B005L38VRU", "B00870ZHCQ", "B002HU39BS", "B008JJLW4M", "B007B6YPAM"], "bought_together": ["B007476KRY", "B008LTBJFW"], "buy_after_viewing": ["B006UIACYK", "B00A7Z0WQ0", "B0009VU7RG", "B0093H9EXA"]}}