{"asin": "B000PEF254", "description": "TheLexar Professional UDMA 300x CompactFlash Cardprovides the ultimate high-speed memory card performance for professional photographers and photo enthusiasts.The high-speed UDMA performance and reliability of this CF card dramatically improves transfer speeds from card to computer when paired with a UDMA-enabled reader, and also provides support for the next generation of high-resolution UDMA-enabled digital SLR (DSLR) cameras, yet these cards are still fully compatible with all CF devices. The Lexar Professional UDMA CF card also includes Image Rescue 4, Lexar Backup n Sync, and Corel Paint Shop Pro X software (available for free download with purchase).With huge capacities and valuable software, the Lexar Professional UDMA 300x CF card provides advanced memory card performance so you can focus on the business of photography.FEATURESBlazing Card-to-Computer Download SpeedsThe Lexar Professional UDMA CF card offers the ultimate performance available today when used with a UDMA-enabled device. These cards deliver incredibly fast download speeds with a minimum sustained write speed capability of a blazing 300x (45MB/sec) in all capacities to satisfy the demand for faster transfer rates from card to computer, drastically reducing post-production time.Includes Valuable ExtrasThe Lexar Professional UDMA 300x CF card includes Lexar Image Rescue 3 software, which reliably recovers most photo, video, and audio files, even if they've been erased or the card has been corrupted, Lexar Backup n Sync software powered by Sharpcast provides the ability to backup, sync, and share all your valuable photos, and extend your ability to enhance, edit, and manage photos from your desktop using the full version of Corel Paint Shop Pro X software. All software is available for free download with purchas", "title": "Lexar Professional Series 8 GB 300x UDMA CompactFlash Memory Card CF8GB-300-381", "price": 29.9, "imUrl": "http://ecx.images-amazon.com/images/I/517yIJHEEvL._SX300_.jpg", "related": {"also_viewed": ["B0093HGD2K", "B002NO7Q26", "B002N694A6", "B0093HGDVG", "B0040XJDBA", "B00IF4O96Y", "B001FO4QHI", "B0093HGEKG", "B0040XMT70", "B001NXDB4A", "B002NO8PTY", "B002WE4H8I", "B0093HGF32", "B000T9251O", "B003LL1EM8", "B000OU7EQ4", "B007C0VHX0", "B007BXD66E", "B00IAYFDIC", "B000W05O5O", "B003LLB7CA", "B007FEFQDA", "B00065ANY2", "B002P370AI", "B0035IXYUC", "B00IAYFD0K", "B002WE0QN8", "B0093HGG18", "B002WE2PW8", "B0008D76L0", "B002NO7PWC", "B007C0VHTE", "B00IAYFCYC", "B000YZGCIU", "B000HYX2SG", "B007BZRXKM", "B004NDEWWW", "B001M62X0Q", "B00IAYFDJG", "B00D6XZGGG", "B004UC9HSA", "B000VDCT3C", "B002TXJUJ8", "B000OU9FGQ", "B0030T2XEO", "B007ADFV2M", "B007BZRXK2", "B007XZKN02", "B004FNJ8ME", "B007NDL542", "B000BYCKU8", "B0087N18U8", "B000JLK5PK", "B0012WBAFO", "B002RCQ0SU"], "buy_after_viewing": ["B0093HGD2K", "B002NO7Q26", "B002N694A6", "B0093HGDVG"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Memory Cards", "CompactFlash Cards"]]}