{"asin": "B00CGWNKVQ", "categories": [["Electronics", "Computers & Accessories", "Laptop & Netbook Computer Accessories", "Bags & Cases", "Backpacks"]], "description": "Targus Pewter Backpack16&quot; Pewter BackpackA Bag for the Active TechieThe  daily commute can be rough, but choosing the right gear can make the journey a  little easier. The Pewter Backpack in particular has all the storage,  convenience, and protection features you need to stay mobile and productive.  The bag&rsquo;s unique style and highly functional design make it a great choice for  students and professionals. It features dedicated pockets for your laptop and  your tablet, so all your technology can be protected while you&rsquo;re on the go.Organize Your Digital LifeLooking  for a bag that is durable and secure? This backpack features a padded laptop  compartment that protects your 16-inch laptop at all times from the occasional  bumps that come with your active lifestyle. There&rsquo;s even a dedicated protective  pocket to store your tablet or eReader. And let&rsquo;s not forget the little  things&mdash;there&rsquo;s a zippered front compartment with pockets for storing an  assortment of accessories such as pens, business cards, flash drives, and more. In  addition to storage for all your technology, there&rsquo;s a separate compartment  specifically for your documents. When you&rsquo;re in a hurry, utilize the  quick-access side pockets for your smartphone or other small accessories. A hidden  water-bottle pouch adds convenience while maintaining the integrity of the bag&rsquo;s  overall design.accessory and document storagewater bottle pouch16-inch laptop compartmentStyle Meets DurabilityThe  Pewter Backpack is simply built to last. The bag features durable material that  not only lends style, but also makes it lightweight and incredibly rugged. Its  exterior is also water-resistant to help keep moisture away from documents and  sensitive electronics stored inside.strong  stitching and hardwarelong-lasting baserugged water-resistant exteriorCarry in ComfortThe  back panel includes special details such as a mesh fabric that provides air ventilation  for a cooler journey. A heavily cushioned back panel and two adjustable padded shoulder  straps lend extra comfort and ergonomic support. For grab-and-go convenience,  there&rsquo;s even a comfortable carrying handle. Plus, the Pewter Backpack comes  with the Targus Limited Lifetime Warranty, which provides you with the  assurance that your backpack will be repaired or replaced should anything go  wrong with its structure.padded back paneladjustable shoulder strapslimited lifetime warranty", "title": "Targus Pewter Backpack for 16-Inch Laptops, Sage (TSB77801US)", "price": 69.99, "imUrl": "http://ecx.images-amazon.com/images/I/41s8712pMsL._SY300_.jpg", "brand": "Targus", "related": {"also_viewed": ["B006NNWZSI", "B0057V9HPQ", "B00CGWNCGE", "B00BZC0LLA", "B00BMJRLM8", "B00CGWNK2U", "B0021AFMPK", "B004UBULPO", "B00C6RL9AU", "B004UBU42Y", "B0081U0628", "B007GNN0AG", "B002LF2PQO", "B007TIYYNU", "B007GNN0HE", "B00KGDCK7W", "B005YQY3AS", "B0077AOALQ", "B00CLFSOS2", "B003HIXPJA", "B00BHDX6XM", "B005YQY5TM", "B001586UI2", "B001GT4AA0", "B008RY6W1C", "B00BP5N2BS", "B002WOD824", "B00EP5EV1U", "B00024ENVG", "B0029L9YHI", "B002J9HBSE", "B00A0IICY8", "B00BJFVCD4", "B003VAK8H6", "B003WU6KFO", "B004YIFKRM", "B001FE322I", "B00IKDNSIK", "B003WUBM3O", "B00BTHPNZU", "B0024IGH3A", "B004AM624C", "B004Z5363O", "B00007LTAI", "B00A0IICZ2", "B003H272TK", "B0001H27PS", "B00BW0QCBS", "B000EZYKMA", "B000X4SRPS", "B00507NAYQ", "B008HY62OO", "B007M4YEVI", "B009ZNHYFW", "B003MRUVTI", "B00A0Y7KS6", "B00I3JXZZ2", "B0088WIINS", "B002I2RO0C", "B008HY60AA"], "buy_after_viewing": ["B006NNWZSI", "B007GNN0AG", "B00507NAYQ", "B0057V9HPQ"]}}