{"asin": "B001F7AP1Q", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Mice"]], "description": "From the ManufacturerOverview:Works on Virtually Any Surface.The Microsoft&reg; Explorer Mouse, with revolutionary Microsoft BlueTrack&trade; Technology, works more places than ever before, including on granite countertops, living room or airport carpets&mdash;even on a wood table or rough, unfinished park bench.&nbsp;&nbsp;Features:&nbsp;&nbsp;&nbsp;Easy RechargingThe battery status indicator tells you when a quick recharge is needed. The compact, stable recharging base is easy to use.&nbsp;Reliable Wireless on the GoMicrosoft 2.4 GHz wireless and the snap-in mini-transceiver deliver a reliable connection with up to a 30-foot range.&nbsp;Sophisticated Design and ComfortThe glowing blue light effects and comfortable curved surfaces set your mouse apart.&nbsp;Additional Features:Go Anywhere -Microsoft BlueTrack Technology&trade; combines the power of optical with the precision of laser for remarkable tracking on more surfaces.*5-Button Mouse- Get quick access to the media, programs, and files you use most often with customizable buttons.4-Way Scrolling -Scroll side to side as well as up and down.What is BlueTrack?Microsoft&rsquo;s proprietary BlueTrack&trade; Technology works on more surfaces than both optical and laser mice.** It uses high-angle imaging optics to generate an accurate picture of the surface.&nbsp;&nbsp;&nbsp;Now track more accurately on:&nbsp;&nbsp;Granite&nbsp;Carpet&nbsp;Wood&nbsp;&nbsp;System RequirementsWindows Vista&reg;/Windows XP100 MBMac OS X v10.2.x-10.5x30 MBUSB PortCD drive1 NiMH rechargeable battery (included)&nbsp;Also Available:Microsoft&reg; Explorer Mini MouseFor Notebooks&nbsp;*BlueTrack Technology does not work on clear glass or mirrored surfaces.**Compared to leading laser and optical mice commercially available spring 2008.", "title": "Microsoft 2.4GHz Wireless BlueTrack Technology Laser Explorer Mouse with 30-Foot Range and Easy Battery Recharging Base (5AA-00001).", "price": 129.99, "imUrl": "http://ecx.images-amazon.com/images/I/413bVXHh8DL._SY300_.jpg", "brand": "Microsoft", "related": {"also_bought": ["B008XB0JNG", "B0011FCV8W", "B0021Y73W6", "B002HWRJBM", "B000A6PPOK"], "bought_together": ["B000A6PPOK"], "buy_after_viewing": ["B008XB0JNG", "B002DPUUL4", "B002HWRJBM", "B003NR57BY"]}}