{"asin": "B00004U1QY", "description": "Nintendo certainly has added a quirky spin on the old English game withMario Tennis. With 16 classic Nintendo characters on hand, ranging from  Bowser to Baby Mario, the crux of the game is the standard game of tennis, with  its break points, deuces, and double faults, but also with the added bonus of  power-ups and special moves.The game revolves around the individual players, and, as in other Mario  adventures, the characters all have their own strengths and weaknesses. Bowser  is great for the sheer strength and his powerful smashes, while other characters  survive on speed and agility, rather like inMario KartorMario  Golf.With Exhibition, Tournament, and Multiplayer modes, the game does have a number  of options to keep you busy. The chance to play with up to three other players  makes this game great to play with your friends.With this game, Nintendo has done to tennis what it did to kart racing and golf,  by producing a fun spin on what's not usually the most fun in computer games.  This is how tennis should be: super smashes, special combos, and Mario running  around in circles.--Stuart Miles--Amazon.co.ukNintendo has incorporated characters from the Super Mario Brothers series into a tennis simulation game for up to 4 players.  Each player manipulates a selected character from the 13 in the series.  There are multiple levels of difficulty.  Players need to learn the types of strategies used in traditional tennis; each can choose how to hit the ball over the net by selecting from a wide range of moves, some of which may be unique to the character each has chosen.  Lobs, smashes, and cross-court shots are among the options.Mario Tennis 64 taps the controlled challenge of real-life tennis, and intertwines light-hearted graphics with good game play.  A 2000 Parents' Choice&#174; Approved winner.Reviewed by Jason R. Rich, Parents' Choice&#174; 2000--FromParents' Choice&#174;", "price": 99.99, "imUrl": "http://ecx.images-amazon.com/images/I/41zY8atw94L._SX300_.jpg", "related": {"also_bought": ["B00000K1AF", "B00000DMAX", "B00000J2W7", "B00002STH0", "B000021Y2Z", "B00000F1GM", "B00000IFRI", "B005GTND0E", "B000046Q7Q", "B00000ID61", "B005GTNBGK", "B00002DHEV", "B00002STEZ", "B00005AW1W", "B005DI7N7W", "B00004R9IB", "B000PJHAD6", "B00003OTI3", "B00002STI2", "B005GTNC8W", "B00000DMAO", "B000031KJM", "B00001QES1", "B00000J2OO", "B00000K2G9", "B003UI5GLC", "B000Y0CHX4", "B00002STFH", "B000QHOHHE", "B00004S9AA", "B00000DMAQ", "B00005ME6D", "B002TK1PX0", "B00004SWLT", "B00005M8TL", "B00000INR2", "B00004U1R3", "B000058BCU", "B00000DMB9", "B00004S9A7", "B00000ID60", "B007SJMEHI", "B00005AQRH", "B00856304Y", "B000YOCGUO", "B00000JHPD", "B0015OG4G4", "B00000JFC6", "B000F9JFXE", "B00002STH5", "B00001WRJO", "B0046CZX78", "B000641ZC2", "B00005C4IE", "B000JVM256", "B000046S41", "B00004WLMA", "B00004U1R1", "B000038A6U", "B00002970G", "B000056WXG", "B002J44BXW", "B00002STGE", "B00004R9I4", "B00000J6GR", "B00002SWFB", "B00004S9A2"], "buy_after_viewing": ["B00000K1AF", "B00000F1GM", "B002TK1PX0", "B00000DMAX"]}, "salesRank": {"Video Games": 3806}, "categories": [["Video Games", "More Systems", "Nintendo 64", "Games"]]}