{"asin": "B001U0O7T4", "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS"]], "description": "The thin n&uuml;vi&reg; 1300 has a widescreen display, yet it&rsquo;s slim and light enough to take along on all your travels. This affordable GPS comes with regional mapping, announces streets by name, offers pedestrian navigation options and calculates a more fuel-efficient route with ecoRoute&trade;.Navigate City TransitWith its enhanced pedestrian navigation capabilities, n&uuml;vi 1300 is the perfect travel companion for getting around town. Download optional cityXplorer&trade; content to help you navigate city public transit. Know where to walk, where to catch the bus, subway, tram or other transportation and how long it will take to get there. It easily fits in your pocket or purse. cityXplorer maps are available for select cities throughout North America and Europe. And with prices as low as $9.99, you'll have money left over to spend in the big city.Just over a half-inch thick with a 4.3-inch widescreen display.Click to enlarge.The device announces the name of exits and streets so you never have to take your eyes off the road.Click to enlarge.Garmin greets you with two simple questions: \"Where to?\" and \"View Map.\"&nbsp; Simply plug and play.Click to enlarge.An ultra-thin GPS navigator with great Garmin features like CityXplorer and ecoRoute.Click here for an interactive demoSee MoreWith n&uuml;vi 1300's widescreen display, you'll always get the big picture. View map detail, driving directions, photos and more in bright, brilliant color. Its sunlight-readable, 4.3\" (10.92 cm) display is easy to read &mdash; from any direction.Get Turn-by-Turn Directionsn&uuml;vi 1300's intuitive interface greets you with two simple questions: \"Where To?\" and \"View Map.\" Touch the color screen to easily look up addresses and services and get voice-prompted, turn-by-turn directions that speak street names to your destination. It comes preloaded with City Navigator&reg; NT street maps for the continental U.S., Hawaii and Puerto Rico or one European region or country (click versions tab to view all), millions of points of interest (POIs), and 2-D or 3-D maps. Its digital elevation maps show you shaded contours at higher zoom levels, giving you a big picture of the surrounding terrain. With the 1300's enhanced user interface, you can slide your finger to conveniently scroll between screens. You also can upload custom points of interest (POIs). And with HotFix&reg; satellite prediction, n&uuml;vi calculates your position faster to get you there quicker.Go Beyond NavigationNavigation is just the beginning. n&uuml;vi 1300 saves you gas and money with ecoRoute &mdash; a green feature that calculates the most fuel-efficient route, tracks fuel usage and more. The 1300 includes many travel tools, including JPEG picture viewer, world travel clock with time zones, currency converter, measurement converter, calculator and more. With photo navigation, you can download pictures from Garmin Connect&trade; Photos and navigate to them. It's also compatible with lifetime traffic alerts (receiver purchase required). With its \"Where Am I?\" emergency locator, you always know your location. Simply tap the screen to get your exact latitude and longitude coordinates, the nearest address and intersection, and the closest hospitals, police stations and fuel stations. The 1300 features Garmin Lock&trade;, an anti-theft feature, and is compatible with our free Garmin Garage&trade; where you can download custom custom voices and vehicles. Enhance your travel experience with optional plug-in microSD&trade; cards.What's in the Boxn&uuml;vi 1300, Preloaded City Navigator&reg; NT data for the lower 48 states, Hawaii and Puerto Rico (no Alaska or Canada detail), Vehicle suction cup mount, Vehicle power cable, and Quick start manualCompare all Garmin n&uuml;visClick the button below to compare by series, user type, and features.Visit Garmin.com athttps://www8.garmin.com/support/download.jspto get the latest firmware updates for your n&uuml;vi to keep it current and performing at its best.", "title": "Garmin nuvi 1300 4.3-Inch Widescreen Portable GPS Navigator (Discontinued by Manufacturer)", "price": 119.99, "imUrl": "http://ecx.images-amazon.com/images/I/51TB9kqJZlL._SY300_.jpg", "brand": "Garmin", "related": {"also_bought": ["B005GDUFFG", "B002KO7R2I", "B003DSCU72", "B002Z1J8R8", "B001U0O7SA", "B002RL8H1Y", "B0039LRQ8G", "B0015EWMX8", "B006HY0Z1M", "B003ZX8AZQ", "B001U0O7QW", "B001U0O7RG", "B000NVZE5M", "B0057ODOCA", "B0030BJ9S0", "B0036X8F50", "B002OL2MU4", "B002IUG14O", "B00269VU0W", "B003ZX8B0U", "B004AL7B7K", "B001ELJ9QK", "B0057OCS9A", "B0054J8BWQ", "B002KO6PQ2", "B006ZAHOJY", "B003NREG7U", "B0011ULQNI", "B002ACBNXO", "B0015F1L7A", "B000BM8RFM", "B0048K15G6", "B001VEJEGK", "B0075SUIOS", "B002VPE21A", "B00273AMH4", "B000NW12C0", "B0057ODG6Y", "B003ZX8B3W", "B009PLBLQC", "B007P4VOWC"], "bought_together": ["B005GDUFFG", "B003DSCU72"], "buy_after_viewing": ["B005GDUFFG", "B0057ODG6Y", "B0057OCDQS", "B00AXZWG8Q"]}}