{"asin": "B001BR95PW", "description": "The Official Bluetooth Headset for the PlayStation 3 from Sony will keep you looking stylish whether you are barking orders at your teammates or chatting with your mother on the phone. Thanks to Bluetooth support, the headset will do double-duty, working with both the PS3 and Bluetooth-enabled phones..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }The Bluetooth Headset works with both the PS3 and cellphones.View larger.The easily accessible mute button comes in handy during gaming.View larger.High-Quality Voice with PS3 Specific FeaturesThe Official Bluetooth Headset for the PlayStation 3 was designed and optimized specifically for gaming use. This headset offers the highest-quality voice available, thanks to the High-Quality (HQ) mode, which implements various advanced voice technologies and noise-cancelingWhen docked to the charging stand, the headset doubles as a desktop microphone.View larger.techniques to provide crystal-clear talk quality. And thanks to the dual-microphone design, you get high-bandwidth voice recording and playback. So next time you're in the middle of a heated online gaming session, you won't have to worry that your allies don't understand.Additionally, with HQ-mode enabled, games that support or require \"Voice Command\" and \"Voice Animation\" features will work perfectly because of the headset's excellent speech recognition capabilities. Games that support this feature include Tom Clancy's EndWar, SOCOM: U.S. Navy SEALs Confrontation, and more.Pairing the Headset to the PS3 is automatically done when you connect with a USB cable. While connected to the PS3, a simple button push will bring up an indicator on screen that tells you the connection status, battery level, speaker volume, and microphone mute status.Compact, Comfortable DesignThanks to its compact, ergonomic design, the headset fits comfortably on either ear for hours of use. Sony smartly put a large mute button that is easily accessible, making it especially friendly to gamers.Bluetooth Support Lets You Use ItWhen you're done gaming, you can keep the headset on your ear for use with most Bluetooth-enabled cell phone. It supports the Bluetooth 2.0 standard and is compatible with Bluetooth 1.1 and higher devices.Charging Stand IncludedA charging stand is included with the headset, providing a convenient and handsome way to display it while it is charging. In addition, the headset also works as a desktop microphone when it is plugged in and charging.The Headset has an operating range of 30 feet.The Headset has an HQ mode for optimum audio quality on your PlayStation 3.", "price": 34.68, "imUrl": "http://ecx.images-amazon.com/images/I/41n12aWyN7L._SY300_.jpg", "related": {"also_bought": ["B007VLRMAM", "B001ENPDJA", "B0015AARJI", "B0042R81XU", "B002GJRQRS", "B007SO6USW", "B005JB84GM", "B008P9IO2Y", "B000RAVVR4", "B003VUO6LU", "B00A8FUY6W", "B0093FO2TS", "B001H4NMNA", "B005UI9BT8", "B00C710AQO", "B000VTQ3LU", "B00BWBTJ4Y", "B004UDB9SA", "B00A906BP4", "B0040QCPYY", "B00BIZQE10", "B000K1CS5Y", "B005QVY65I", "B003V4AK8E", "B000KI99SG", "B002GJRQSC", "B000S0C2UI", "B002I0H738", "B000Y1MOIQ", "B0072A4GQK", "B008DBJPLS", "B003A0T6YS", "B00FOHP8XI", "B0040546HY", "B00AY1CT3G", "B007M6W3A0", "B006VB2UMI", "B002G9DE24", "B009GZX49Y", "B00DU2CHE2", "B0053OLY9O", "B00CEGPXM8", "B0050SWSQQ"], "bought_together": ["B0015AARJI"], "buy_after_viewing": ["B0042R81XU", "B005LN5UOC", "B0080CY4SY", "B00BSQKSUM"]}, "salesRank": {"Video Games": 5029}, "categories": [["Cell Phones & Accessories", "Accessories", "Headsets", "Bluetooth Headsets"], ["Video Games", "PlayStation 3", "Accessories", "Headsets"]]}