{"asin": "B001F7AHOG", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]], "description": "The new iPod classic comes with 160GB of storage in the same compact size, making it the take-everything-everywhere iPod. It's available in quintessential silver or striking black. iPod classic also has plenty of battery life (up to 36 hours of audio playback or 6 hours of video playback), good looks (a sleek, anodized aluminum design), and other great features (Cover Flow and Genius playlists for creating perfect playlists). You can even rent a movie from iTunes and watch it on the go.iPod classic is the take-everything-everywhere iPod.Click to enlarge.Your Top 40,000Meet a Musical GeniusSay you're listening to a song you really like and want to hear other tracks that go great with it. With a few clicks, the Genius feature finds the songs in your library that go great together and makes a Genius playlist for you. You can listen to the playlist right away, save it for later, or even refresh it and give it another go. Count on Genius to create a mix you wouldn't have thought of yourself.Hold EverythingiPod classic gives you 160GB of storage capacity, good for up to 40,000 songs, 200 hours of video, 25,000 photos, or any combination. And you get up to 36 hours of battery life, so you can keep on rocking for a long, long time.With 160GB of space, iPod classic means you can always have your entire music and movie library with you. Carry it from the living room to a party in the backyard. Or take it on a cross-country road trip and never listen to the same song twice.Click to EnjoyFinding exactly what you want to watch or listen to is easy. Use the Click Wheel to browse by album art with Cover Flow or navigate your songs and videos by playlist, artist, album, genre, and more. You can also search for specific titles and artists. Want to mix things up? Click Shuffle Songs for a different experience every time.Watch Movies and TV ShowsThe vivid 2.5-inch display makes video come alive. Purchase or rent movies, buy TV shows, and download video podcasts from the iTunes Store, then sync them to your iPod classic to watch anywhere, anytime.Available in quintessential silver or striking black.Click to enlarge.Play iPod GamesPut hours of fun at your fingertips. iPod classic comes with three games--Vortex, iQuiz, and Klondike--and you can purchase games such as Cake Mania from the iTunes Store. All iPod games are designed specifically for the iPod interface.Share Your PhotosiPod classic uses iTunes to sync the photos you have in iPhoto on a Mac. You can view photo slideshows complete with music and transitions on iPod classic, or play them on a TV using an optional Apple component or composite AV cable.Reduced Environmental ImpactiPod classic embodies Apple's continuing environmental progress. It is designed with the following features to reduce environmental impact:Arsenic-free display glassBFR-freeMercury-free LED-backlit displayPVC-freeHighly recyclable aluminum and stainless steel enclosureWhat's in the BoxApple iPod classic 160 GB Black (7th Generation), Earphones, USB 2.0 cable, Dock adapter, Quick Start guide", "title": "Apple iPod classic 160 GB Black (7th Generation)", "price": 245.99, "imUrl": "http://ecx.images-amazon.com/images/I/41s-vKh2z4L._SY300_.jpg", "brand": "Apple", "related": {"also_bought": ["B002H9LNGW", "B00IKMI516", "B0056BUVES", "B006YNTJ6I", "B00IKMMI0A", "B000WBDD56", "B002ICN1GS", "B0037T4WIM", "B000VXVHRQ", "B002AF5184", "B000Y9LWDG", "B0019LM9AS", "B000XHMKIA", "B002YHHKKU", "B001FU8OUM", "B001DLTDQC", "B00A36AX80", "B0057JN998", "B001NKF0YC", "B001NKGWGM", "B004HM0PYI", "B001NKGWEY", "B000WLXO9Q", "B001OBU400", "B001NKF0ZG", "B000V2FJAS", "B002HZY570", "B004JRY402", "B002S0O7LI", "B003VANOI6", "B004I408OW", "B00KE3B7TG", "B009NQCBOK", "B0097BEFI6", "B0097BEDTC", "B0097BEE9Q", "B00G2XRVNS", "B003ZJ0ZX0", "B0097BEFWC", "B00834SJU8"], "bought_together": ["B002H9LNGW", "B00IKMI516"], "buy_after_viewing": ["B002H9LNGW", "B0097BEE9Q", "B006YNTJ6I", "B001F7AHXM"]}}