{"asin": "B0019Y8AAI", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "Contour is a wearable camcorder that records hands-free video from within the action. Contour records up to 2-hours of TV quality audio and video to an internal MicroSD card. Its operation couldn&rsquo;t be simpler with a single on and off switch. Even when wearing gloves, the oversized magnetic button can be operated easily for one click recording. Contour&rsquo;s TRail Mounts attach it to your helmet, goggles, handle bars, or vehicle, to record video in any weather conditions. Its rotating lens and patent pending laser alignment ensure you get the shot every time.Contour HighlightsWearContour is a hands-free, wearable camcorder that records action video while you keep your hands on the ski poles, stearingwheel, oars, handlebars, etc. It&rsquo;s aluminum and fiberglass body is light, yet durable. The TRail mounts attach Contour to your helmet, goggles, handle bars, or vehicle.ShootWith a single switch, Contour captures up to 2 hours of TV quality audio and video in all weather conditions. Its rotating lens and patent pending laser alignment ensure you get the shot every time. Ideal for outdoor use, Contour will capture video in all weather conditions.ShareUpload your videos in seconds to Contour.com. Watch, rate, and discover authentic action videos from around the world.ConnectContour connects to your computer with single USB 2.0 connection. Download your videos in seconds.Contour DesktopThe free Contour software makes it automatic to download, watch, and tag your videos before sharing them to Contour.com with the click of a button. We make managing your videos easy.Geo-Tagging your VideosTag your videos with the title, description, keywords, and location. Contour is leading the way with Geo-Tagging for video because where you recorded your adventure is as important to us as what is in the video. Search and discover videos on the Contour.com Geo Maps.Share your VideosEmail your videos to all your friends or embed them all over the internet.Product FeaturesRuggedA camera for all seasons. Its anodized aluminum exoskeleton armor withstands dust, dirt, mud, and snow -- elements that destroy most electronic gear. It's also shock, vibration, and impact resistant.Mount ItContour TRail Mounting System is an integrated mounting system, which attaches Contour to any number of platforms quickly and securely.2 Hours of VideoRecord 2 hours of TV quality video on a removable microSD memory card.Align ItA 192 degree rotating lens and dual laser alignment ensure you get the right shot every time.One Switch RecordingIts operation couldn&rsquo;t be simpler, featuring a single oversized and sealed magnetic record switch. Don&rsquo;t miss a beat, even while wearing gloves.No tapes. No hasslesContour includes camera-integrated software that makes downloading, organizing, and uploading as easy as checking your email. Quickly connect Contour to a computer's USB port, or eject the tiny MicroSD card for ultra fast content downloading through a card reader.WarrantyAll Contour, Inc products are covered by a 180-day limited warranty.Product SpecsWhat&rsquo;s in the Box:Contour Video CameraMicro SD CardContour SoftwareHelmet MountUSB CableBatteryUser ManualVideo:Video Processing: FineLineTM Hardware EncodingVideo size pixels (lines): 640x480 (480 lines)Frame rate: 30fpsFile type: mpeg4Video rate: 50min/GBAvg. battery life: 2 hoursLens:Type: 1/4-inch 4GSize: 3.6mmViewing Angle: 90 degreeDid we mention it rotates and has laser beamsCamera:Sensor Type: CMOSQuality: Minimum illumination: 0.04 Lux @f/1.2High sensitivity for low-light operationLow fixed pattern noise, anti-booming, zero smearingLow power consumptionAudio:Waterproof MicrophoneSensitivity (0dB=1V/Pa, 1KHz): -44+/-2dBDirection: Omni-directionalFrequency Range: 100-10,000 HzInputs/Outputs/Controls:Media: MicroSDBattery: Removable lithium polymerOutput: Mini USB 2.0Slide lock on-record/off-stop switchPush button battery/memory life indicatorSize and Weight:Height: 95mm (3.75 in.)Length: 53mm (2.1 in.)Width: 34mm (1.35 in.)Weight: 4.8ozPress Reviews:This TV-quality video camera is easy to mount on pretty much any piece of action sports equipment and houses new technology that captures steady shots of action when the terrain gets really rough.--Today ShowThe VholdR camcorder from Twenty20 lets you skip the handholding by clipping it right onto handlebars, helmets, or goggles to record action video as you see it.--New York TimesThe heart and soul of the new camera is its compact, comprehensive design. There are no entangling cables, no external recorders, no remote controls. Just click stick the thing onto your bike or helmet, toggle one big ol&rsquo; switch, and you&rsquo;re recording.--Bike Magazine2008 CES Innovations Award-- \"Personal Electronics\"Product Name: VholdR (Vee-Holder)Category: Wearable CamcorderSoftware Update:Download the latest version of the Contour Desktop Software for both PC and Mac Systems!", "title": "Contour Wearable Camcorder (Black)", "price": 48.8, "salesRank": {"Camera &amp; Photo": 11493}, "imUrl": "http://ecx.images-amazon.com/images/I/41eLabMFbAL._SX300_.jpg", "related": {"also_viewed": ["B0055QYIY8", "B00AW54ZC2", "B002QGSYZ4", "B009CN8VRK", "B00BOTLDJI", "B00ECHDV4O", "B005GRFTMQ", "B00AMYNREU", "B00G04PLH2", "B00063E872", "B009CN8X3C", "B00ECV7QSC", "B009CN8VRU", "B004L5AF4Q", "B005GLFSYQ", "B00K962E0O", "B00B7TNWU8", "B009CN8VNY", "B006ITDEBO", "B00BZWOHKQ", "B00AW54Z9A", "B00A81SXHI", "B007W02PRM", "B0029631VI", "B0051GR9HA", "B0051GNABO", "B00K962E7C", "B003DNSIOQ", "B004OBMGNK", "B0030ZESEQ", "B008KFMVZY", "B0026P4H6K", "B004AP9FSE", "B005V7K214", "B009GDMA6E", "B003P9W9J8", "B00F46UQ4K", "B00GSX8O92", "B00426DQ2W", "B007N4EJMG", "B0090EC5MS", "B002VA57XC", "B0090EC5NC", "B0050VL2EC", "B007N4EJK8", "B007VZY8QO", "B0037P5CAI", "B00JD4T7CQ", "B002VA56I8", "B009F773I6", "B00GGNY89Y", "B00C6N07GQ", "B002VA59DK", "B003P9W9JI", "B005H2RDK6", "B009F76LI4", "B00KX1YSOA"], "buy_after_viewing": ["B0037P5CAI", "B009QZH7BU", "B0055QYIY8", "B00A81SXHI"]}}