{"asin": "B005J5TZQ6", "description": "The new LUMIX G X VARIO PZ 45-175mm/F4.0-5.6 ASPH./POWER O.I.S. lens features superb image rendering for lifelike textures and crisp, edge-to-edge contrast.  A unique Nano Surface Coating technology minimizes reflections at entire visual light range (380nm-780nm) for a dramatic reduction of ghosts and light flare, resulting in outstandingly clear picture quality. Using a Multi-Actuator Floating Inner Focus System to control three lens groups separately the LUMIX G X VARIO PZ 45-175mm/F4.0-5.6 ASPH./POWER O.I.S. achieves a reduction in both size and weight without compromising picture quality.  Boasting outstanding compactness, the lens is approximately 90mm in length and 7.4oz in weight, resulting in ultra-high mobility. Offering a versatile zoom range of 45-175mm the LUMIX G X VARIO PZ 45-175mm/F4.0-5.6 ASPH./POWER O.I.S. allows distant subjects to be captured sharply at the tele-end.  Also notable, the lens is extremely suitable for portrait and landscape shots, as its high contrast and resolution helps images shot at the wide end maintain exceptional quality, and the zoom lever allows for quick and stable zooming, even while shooting a moving object. The new lens system features two Extra-low Dispersion (ED) lenses which suppress chromatic aberration and contribute to high descriptive performance across the entire zoom range 45-175mm.  The POWER O.I.S. (Optical Image Stabilizer) integrated into the LUMIX G X VARIO PZ 45-175mm/F4.0-5.6 ASPH./POWER O.I.S. makes it easy to shoot sharp images even in low-lit situations.  With improved sensitivity of the gyro sensor, the new POWER O.I.S. also suppresses large, slow movements two times more effectively while small, fast movements are compensated for by the conventional MEGA O.I.S.", "title": "Panasonic Lumix G X Vario PZ 45-175mm/F4.0-5.6 Lens for Panasonic Lumix G-Series Digital Cameras", "price": 296.0, "imUrl": "http://ecx.images-amazon.com/images/I/41n1S86dP9L._SX300_.jpg", "related": {"also_bought": ["B002LARVXQ", "B0000BZL1P", "B004G8QSTO", "B005GOPXRA", "B0056ENTVC", "B00004ZCJE", "B0050SWMN0", "B008MB71IS", "B004K34MUC", "B005I6DUKS", "B007R0RKV8", "B006FKR1PG", "B002IKLJVE", "B00604YTD4", "B0042VJCXY", "B005I6DU7G", "B002HWRJBC", "B005J5UKIS", "B005I6DUU8", "B001NXDBI6", "B003BYRGKY", "B0055N2L22", "B004OZMZKK", "B00E87OITK", "B003VAM32E", "B003BYRGJU", "B006I5MKZY", "B005NJCFRE", "B008H3SW4I", "B003G49V70", "B0050SWMCG", "B0057LX9H8", "B00AKINWZ2", "B003YJAZZ4", "B0011NVMO8", "B002HWRJBM", "B005JXADSW", "B006KYY0CY", "B005J5TZZ2", "B005THHP0C", "B005BQI5CI"], "buy_after_viewing": ["B001ISKNKA", "B009SGB3KS", "B0000BZL1P", "B009SGB3KI"]}, "categories": [["Electronics", "Camera & Photo", "Lenses", "Camera Lenses", "Digital Camera Lenses"]]}