{"asin": "B00A7Q9ZOY", "description": "The Thrustmaster Y-250P Gaming Headset for PS3 and PS4 offers stereo gaming at its best with optimal reproduction of the sound of games on your PS3/PS4. This stereo USB audio headset features amplified performance, specially designed for use with your PlayStation 3 and Playstation 4. The premium 50 mm drivers provide &#x201C;Crystal-clear&#x201D; audio which allows you to hear everything and react quickly! At last, you can properly hear the bass frequencies from explosions! The audio sensations are even more &#x201C;real&#x201D; than real life, thanks to the stable frequency response curve optimized for your gaming sessions. The Y-250P Gaming Headset represents the best of our audio expertise, taking your gaming performance to the next level! This headset perfectly matches your PlayStation 3 and Playstation 4 and is crafted to provide outstanding comfort: large, ultra-soft ear pads and a headband covered in thick, soft foam padding for extreme comfort during long gaming sessions. Double electro-acoustic bass amplification, thanks to the earpieces&#x2019; unique design, is combined with electronic bass boost built into the controller. The 5.20-meters of cables (17&#x2019;) adapts to any type of gaming configuration. The Y-250P Gaming Headset features a high-performance unidirectional microphone, designed to accurately target just your voice, for the most effective communication with your teammates. The microphone is both detachable and adjustable. The multifunctional controller on the cable allows you to adjust the audio level of the game and of voices independently: both the mic and chat volume can be set separately, for a perfect fit with every game and every gamer. There&#x2019;s a voice feedback system (to cut out the feedback from your voice) directly on the controller. Using the detachable cable, enjoy full compatibility with your other gear including MP3 players and Nintendo 3DS / PS Vita / smartphones (including call function!). The Y250P is fully compatible with your PC via its USB connection.", "price": 79.99, "imUrl": "http://ecx.images-amazon.com/images/I/41g9pRnXzDL._SY300_.jpg", "related": {"also_viewed": ["B00FRES9QQ", "B004EJ0L8E", "B00C9UND8K", "B00275C2L6", "B002I0J5CO", "B00D96BNGM", "B00B1KJK22", "B00DP7XH1E", "B00D96BORK", "B00D96BO7K", "B00E5UHSYW", "B0087ZMATE", "B00E5UHSXI", "B003NREDG4", "B009IF0EUE", "B00DP7XHWI", "B00BFOEY4I", "B005HGBDBM", "B004J6KRD6", "B00ESESLQ4", "B006JH6A0W", "B00BDS415I", "B008M4BNQG", "B002BU0DPE", "B001E45XT4", "B00HLUZX7M", "B008Y1KK6Q", "B00292OW1U", "B00EXPNFQO", "B006W41X18", "B00HLUZXAY", "B009RXUNZI", "B00EI4V3X2", "B00DU2CHE2", "B006W41W7S", "B003N636VI", "B00CQ35C1Q", "B003VANOFY", "B00EXPNFUA", "B00CMQTUY2", "B00E5UHSX8", "B009SJR278", "B00DPC015E", "B006JH8T3S", "B001NT9TK4"], "buy_after_viewing": ["B00E5UHSYW", "B008M4BNQG", "B002BU0DPE", "B008S8VXTS"]}, "salesRank": {"Video Games": 48760}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Headsets & Microphones", "PC Headsets"]]}