{"asin": "B00365MF54", "description": "Buffalo's dual drive LinkStation Duo LS-WXL/R1 network storage server offers a reliable and scalable high capacity shared storage solution for home or business. Quickly back up, store and share documents and multimedia files in a secure, central location. Fast, reliable, and secure, the LinkStation Duo is perfect for any home or business. Designed to replace the LinkStation Pro Duo (LS-WGL/R1), the LinkStation Duo LS-WXL/R1 features a newly redesigned chassis, a 40% increase in performance, and support for Quick Swap hard drive replacement.View larger imageSecure, High Performance Central StorageBuffalo&rsquo;s LinkStation Duo is a high performance, dependable shared storage solution with easily accessible hard drives and simple to use data management features. Paired with two 3.5\" hard drives, LinkStation Duo provides users the option to easily protect their data using RAID redundancy. RAID 1 automatically mirrors the drives, providing an exact copy for maximum data protection while RAID 0 combines both drives offering maximum capacity.The two hard drive bays are easily accessed via the user removable front panel without the use of tools, providing simple drive servicing and replacement. Additionally, LinkStation Duo features gigabit connectivity, delivering fast connection speeds for exceptional performance.Also available is theLinkStation Duo LS-WXL/1Dwhich houses a single hard drive in its dual bay, giving users the option to upgrade the unit by adding a hard drive at any time. This flexibility provides a scalable storage solution that allows users to enable data mirroring or increase the overall capacity as needed.Back Up Your DataThe LinkStation Duo includes many additional features that are ideal for home users who want protect their important data. To safeguard digital content, Memeo AutoBackup instantly backs up and protects saved files. Plus, there is no need for manual or scheduled backups; Memeo AutoBackup will backup any new or changed file instantly and automatically. Once you set your backup plan you never have to look at it again. For Mac&reg; users, LinkStation Duo includes Time Machine&reg; support. Easily and automatically back up your important files or your entire computer to the LinkStation Duo.Home Server for any Streaming NeedFast and easy to install, LinkStation Duo allows you to store and share your music, photos and videos with multiple computers and users on your network and even over the Internet. Since the LinkStation Duo is connected to your network, you can stream media to any connected device, anywhere in your house!For easy sharing and enjoyment of your multimedia content, the LinkStation Duo includes a DLNA CERTIFIED&trade; server, allowing DLNA players (such as the Buffalo LinkTheater) to access content on the LinkStation without the need of a computer. Plus, the built-in iTunes&reg; server allows for your iTunes application to identify and access the LinkStation as an iTunes content source. Now you store, share, back up and stream your favorites from one central and secure location.You can even share your favorites with family and friends anywhere in the world over the Internet and on your iPhone&reg; using Buffalo&rsquo;s WebAccess remote access feature. The user-friendly LinkStation Duo makes file sharing simple.A Fitting Solution for Home Offices and Small BusinessIn addition to its great home server features, the LinkStation Duo network storage solution is also a simple and economical way for small businesses, branch offices and other professional users to add business class features such as RAID 0 and RAID 1, Active Directory Support and WebAccess to their network with an installation that is virtually plug-and-play. Fast, reliable, and secure, the LinkStation Duo is perfect for any home or business.Key Features and BenefitsRAID 0 and RAID 1 Support:Get maximum reliability with automatic data mirroring in RAID 1 or maximum storage with two striped hard drives in RAID 0Near Silent Operation:Noiseless fan design ensures reliable and silent operationPower ManagementSavings mode automatically powers the LinkStation Duo on and off with your PC (requires installation of NAS Navigator)DLNA CERTIFIED&trade; and iTunes&reg; Servers:Stream content directly to any DLNA compatible media player or use LinkStation Duo as content source from within your iTunes applicationBitTorrent&reg; Client:Download digital content over the Internet directly to your LinkStation DuoWebAccess:Share your photos, music, videos or data files with family, friends and colleagues over the Internet with a standard browser or Apple iPhone&reg;Active Directory Support:Join to an existing Active Directory Domain for Windows&reg; user authentication and folder level permissionsUSB Port:Attach a printer to the network, add a USB hard drive for additional storage or backup, or connect to a UPS for shutdown managementMemeo&reg; AutoBackup:Includes Memeo backup software for automatic backup from your PCs and Macs (LifeAgent)Time Machine&reg; Compatibility:Works perfectly with Time Machine to back up your Mac computerNo Annual or Monthly Feesto use any features or services, including Web Access with iPhone support, or to add multiple users and groupsFree 24/7 Tech Support:US-based tech support for life of the productThe LinkStation Duo LS-WXL/R1 is backed by a one-year limited warranty and lifetime 24/7 US based technical support.What&rsquo;s in the BoxLinkStation Duo, Quick Setup Guide, Ethernet Cable, Power Cord, and Warranty Statement", "title": "BUFFALO LinkStation Duo 2-Bay 1 TB (2 x 500 GB) RAID Network Attached Storage (NAS) - LS-WX1.0TL/R1", "price": 89.99, "imUrl": "http://ecx.images-amazon.com/images/I/41sjk6vD4dL._SY300_.jpg", "related": {"also_viewed": ["B008DWAGPG", "B0048TWIX6", "B005EJLFNI", "B0048L62I6", "B005PVXH18", "B00CO0DH6S", "B005PVXI0S", "B00CO0DH6I", "B005PVXH2W", "B00CO0DE0W", "B00CO0DDZS", "B00CO0DIHQ", "B00CO0DHCM", "B00CO0DIQ2", "B00DW1UNS8", "B007JLDTRY", "B004UBU3SY", "B004J6JW1Y", "B00JKM0EBE", "B004J6GNUC", "B00DIO9M1S", "B00BXAVDLQ", "B00CO0DH2C", "B00JKM0A36", "B005TJLU24", "B00DIO9N8A", "B0042TW3J6", "B00I2P82CS", "B00EVVGAFI", "B00365MF7C", "B00CRB9CK4", "B00I2P53NY", "B005KD78CA", "B00DR7END8", "B008D4X9TY", "B002O3W2OI", "B00BNI4A90", "B00D02AS2U", "B0093NUFVE", "B00G9X5N18", "B00B5Q7ACE", "B004B93S28", "B00HK74G4W", "B0087ECCVQ", "B00429N16A", "B00CF9VFSU", "B00B5Q7AIS", "B00G9X5NFO", "B00EVVGAD0", "B00439GMJ2", "B0040NPGP2", "B009FU8BTI", "B008U69OA8"], "buy_after_viewing": ["B008DWAGPG", "B00CO0DE0W", "B008JJLW4M", "B008JJLZ7G"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "Network Attached Storage"]]}