{"asin": "B00004ZBSX", "description": "The science-fiction role-playing gamesFalloutandFallout 2have been bundled together for the complete post-nuclear-war game experience. InFalloutyou are dwelling in a self-sufficient fallout shelter called Vault-13, three generations removed from the apocalyptic war. When your shelter's water filter breaks down, you are sent out into the unknown wasteland to find a replacement filter or a new source of fresh water. TheFalloutadventure unfolds as a gritty tale of discovery, paranoia, and survival. Mature gamers are in for a classic role-playing game that has earned a cult following just as loyal as the fans of theMad Maxmovies that inspired it.Fallout 2takes place 80 years after the events in the original game. You are the Chosen One, a tribal ancestor ofFallout's vault dweller. Your tribe has built a modest settlement in an isolated corner of the futuristic Californian wasteland, but you must find a Garden of Eden Creation Kit to sustain the village. During your adventure, you'll encounter misfits and monsters ranging from gangsters to supermutants. Twice as many weapons are at your disposal, including the M72 Gauss Rifle, M3A1 \"Grease Gun\" SMG, Louisville Slugger, H&K; CAWS, and the Solar Scorcher. In addition, you can give your character combat postures such as berserk, aggressive, defensive, or cowardly.Parents should be aware that the games contain violence and some sexual situations. Though you can adjust the tone down a bit through the main control panel, developments that occur on the adult setting are integral to the story.", "price": 14.99, "imUrl": "http://ecx.images-amazon.com/images/I/51G0FQ9M1VL._SX300_.jpg", "related": {"also_bought": ["B000059O8B", "B0016BTNTQ", "B002BXKJA0", "B0065NP39E", "B00E9I1FPI", "B0016BVYDY", "B001REZLY8", "0782124151", "B00008NRMA", "B00001QEQ8"], "buy_after_viewing": ["B001V9PTVE", "B00004KDF9", "B00001QEQ8", "B000FUHVSE"]}, "salesRank": {"Video Games": 16126}, "categories": [["Video Games", "PC", "Games"]]}