{"asin": "B002JM1XWQ", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "See it, shoot it, and share it--all in high definition. With the Creative Labs Vado HD 8 GB Pocket Video Cam Second Generation, you can capture life's amazing moments in 720p high-definition quality, all with a touch of a button. The Vado HD has a compact, stylish glossy black design and features 8 GB of memory to store your videos. Small enough to fit in the palm of your hand, the Vado is the first pocket video camcorder that you can directly connect to an HDTV to share your videos instantly. And with its built-in USB connectivity, you can just as easily upload your videos to popular Web sites such as YouTube, or you can directly upload them to your computer for storage and editing.Vado HD Pocket Video Cam Second GenerationAccessorize your Vado HD:Vado HD Rechargeable BatteryAdd up to 2 hours of recording and playback time.Vado HD Battery ChargerKeep batteries fresh so you never miss a great shot!Vado HD Waterproof Pouch (Blue)Take great shots while underwater!Vado HD Mesh Pouch (Silver)Carry and protect your Vado with style.Take high-definition video anywhere with just a push of a button.View larger.A built-in USB cable makes it easy to upload movies onto your computer.View larger.Precision-Engineered Lens for Superb ClarityA PC Magazine Editors' Choice recipient, the Creative Labs Vado features a precision-engineered glass lens for sharp, clear, professional-looking videos. With this wide-angle lens, you can capture wider scenes and record more action, and with the Vado's 2x digital zoom, you can get up close with your shots, even in dim environments.Easy, One-Touch RecordingRecording high-definition video with the Vado is as simple as touching a button. Press it to start recording and press it to stop. It doesn't get any easier than that.The Vado features 8 GB of internal memory and four recording modes, giving you the freedom to choose the video quality that's best for you. You can record up to two hours of stunning HD-quality video, or up to four hours of video at VGA resolution.Edit Movies and Snap PhotosWith integrated Vado Central software, the VadoPocket Video Cam makes it easy to quickly shoot and edit your own short movies and capture snapshots in still and burst modes. For Mac users, the new Vado Central&trade; for OS X lets you transfer and import your videos direct into iMovie.Easy HDTV Playback or Web UploadThe Vado features high-quality HDMI connectivity and an HDMI cable, which allow you to connect your camcorder into your HDTV and immediately enjoy your videos and pictures in full 720p HD quality. You don't need any special software or downloads--just plug it in and play.And for videos you want to upload to YouTube or other popular Web sites, the Vado makes it as simple as can be. Just plug the camcorder's integrated USB tab into your computer and post your files. Vado will take care of everything, so you can concentrate on your videos and not worry about the details.Easy to View ScreenThe Vado features a large, two-inch antiglare screen, so you can review your clips or show them off to friends without a computer or HDTV. For further convenience, it runs off an included rechargeable Lithium-ion battery. Fully charged, the battery offers up to two hours of recording and playback time. Recharge the battery via the USB connector, or if you're in a hurry, simply take it out and replace with a fresh battery.The Creative Labs Pocket Video Camcorder is backed by a one-year limited warranty.What's in the BoxVado HD Pocket Video CamHDMI cableUSB extension cableSilicon skinRechargeable batteryThe Vado HD's compact size lets you easily take it with you everywhere.", "title": "Creative Labs Vado HD 8 GB Pocket Video Camcorder, 2nd Generation (Black Gloss with Maroon Accents)", "price": 127.99, "salesRank": {"Camera &amp; Photo": 7877}, "imUrl": "http://ecx.images-amazon.com/images/I/41B%2B04E7%2B-L._SY300_.jpg", "related": {"also_viewed": ["B001LK8P14", "B002NXGP6U", "B0040702HA", "B009GLINO4", "B002HOPUPC", "B0043D4V8M", "B0023B14TK", "B0031RGKVC", "B004FLL5BI", "B002P3F5DM", "B004FLL5AE", "B006KDQFLY", "B006L6ZU84", "B0043CVH2Q", "B002S53CK0", "B00AW54ZF4", "B0043CWU22", "B0030MITDK", "B0018QIOPI", "B004AP9FSE", "B0072619RI", "B00BF9HZT4", "B006K551LM", "B002P3F5D2", "B003P2V4OQ", "B004FLL5AO", "B004FLL5B8", "B0044DEEJC", "B00AW54ZGS", "B005G81E9M", "B003VTZE4Y", "B001HSOFI2", "B002YBTWJ8", "B00E62YCQQ", "B0037P5CAI", "B001I44YCC", "B007261A6I", "B00EVIBMR2", "B0040702HK", "B0018P0S1M", "B003DZ122O", "B002HOPXE0", "B001BO7R00", "B0040702IE", "B005G81EAQ", "B008KFMVZY", "B002GYWJ3Y", "B001O94GNS", "B000V1PXL4", "B0030MITLW", "B004GKLW70"], "buy_after_viewing": ["B001LK8P14", "B002NXGP6U", "B003VNKNF0", "B002S53CK0"]}}