{"asin": "B0021MGPYA", "categories": [["Electronics", "Car & Vehicle Electronics", "Vehicle Electronics Accessories", "Radar Detectors"]], "description": "Whistler's RLC-100 is a compact, full-featured red light/speed camera warning system. The device compares your vehicle's current location (using GPS) against an on-board database of thousands of known red light camera and speed camera locations. Free updates are included for one year, installable via USB on your home PC, and you can manually enter in up to 100 of your own custom locations. Plenty of bonus features are also included, such as speed alerts, a tripmeter, and a digital clock.A compact, full-featured red light/speed camera warning system.Click to enlarge.Measures just 3.13 x 2.13 x .75 inches, and 1.6 oz.View a feature diagram.Click to enlarge.High Sensitivity  GPS AntennaCompact, high efficiency antenna receives GPS signals.Updatable Camera DatabaseThe RLC-100 is shipped with the Verilight camera database (Red Light and Speed cameras) preloaded. This unit can be updated with the latest database anytime by connecting to a PC. In order to update the unit, you will need to download the Software program from Whistler&#xFFFD;s website first. You must also register the unit before any updates can be downloaded.Free Updates For One YearFree updates will be available for up to 1 year from the date of registration and software installation. After 1 year, updates can be purchased.Seven-Segment Digital ReadoutThe RLC-100 features an easy-to-read display indicating time, speed, and distance to camera. Choose between bright/dim modes based on preference, time of day, etc.Current Speed Reading With MPH/KPH OptionChoose from MPH/Yards or KPH/Meters for your units of measurement.12 Volt Power Out JackProvides a 12 volt, 1.5 amp output to power other devices.Enter Custom LocationsThe unit's Manual Entry function allows for storage of up to 100 user locations.Digital ClockKeep track of time with th ebuilt-in clock. Select a \"top-of-the-hour\" alert to be reminded as each hour passes.Selectable Speed WarningSelect a speed warning threshold to keep your lead foot in check. When exceeded, the unit will announce, \"attention, reduce speed now.\"Built-in SpeakerProvides distinct audio warnings for Red Light, Speed Camera and user entered locations. You may adjust alert volume to your preference.Camera AlertsWhen a camera location is approached, the unit will announce the type of alert (Red Light Camera, Speed Camera, or User Selected), for example, \"Caution, red light camera detected.\" The display also counts down the distance to the camera.USB PortFor connection to a PC for updates. A mini USB cable will be required to connect the RLC-250 to a PC.Stay alertThe Stay Alert feature provides a reminder to stop for rest after 2 hours of travel. It can be turned off in option mode.Mounting the unitThe unit can be mounted using the included magnetic dash disk, or the non-skid pad.What's in the BoxRLC-100 Unit, Power Cord, Non-skid Dash Pad, USB Cable, Magnetic Disk Mount, Alcohol Pad", "title": "Whistler RLC-100 Red Light-speed Camera Detector", "price": 69.99, "imUrl": "http://ecx.images-amazon.com/images/I/41rsMvxeXwL._SX300_.jpg", "brand": "Whistler", "related": {"also_viewed": ["B003O95CQ6", "B002OSQGOK", "B001N54TD0", "B001TE5V0U", "B008AT6BZQ", "B003CYL4Z6", "B00DNJU61S", "B004RO3QOM", "B0036UMQX0", "B001TE3VBG", "B000OHYIDE", "B00G9227ZE", "B00CM06VIQ", "B008AT6BOW", "B00CM06VIG", "B001TE0MXQ", "B004RO3QLU", "B0043D2ICS", "B00297J562", "B004RO3QPQ", "B00297FKFC", "B001RHTVC8", "B003E3HH38", "B0017W86FG", "B004RO3RB4", "B004RO3QNI", "B001RHSA5W", "B001Q6TZ5S", "B0025QMHW6", "B00297J5C6", "B0025QSN6K", "B008AT6BMY", "B004RQD604", "B00CM06VJA", "B0009SCMKY", "B0085Y9CIY", "B00CM06VJK", "B00CM06VHC", "B000U89KGW", "B004HVJIGA", "B0025QQMIG", "B006ZOF5RI", "B001S0I26K", "B001TUYQT6", "B0063A0NZI", "B00E40QPX8", "B005IQGU0A", "B001UALXG4", "B004S22KFE", "B008CXYPE4", "B0025QL8JE", "B003AIL5KI", "B000F8XGJO", "B001F0RPGG", "B0098QSTFK", "B00CL55JSA", "B008LY1GCS", "B006ZOF6X6"], "bought_together": ["B002FAKYQ8"], "buy_after_viewing": ["B003O95CQ6", "B001DSIMAI", "B002OSQGOK", "B001N54TD0"]}}