{"asin": "B001EWEIOW", "description": "Introducing the new TiVo XL HD DVR. At approximately 7 times the size of the TiVo HD DVR, the TiVo XL HD can hold up to 150 hours of HD programming or 1,350 hours of standard-definition programming. In addition to its expanded capacity, the TiVo XL is THX certified for the best possible sound and video quality.Key FeaturesSave up to 150 hours of HD programming or 1,350 hours of standard-definition programming at a timeThe largest capacity DVR available in the countryTHX-certified for premium audio and video qualityRecord two shows at onceIncludes the premium programmable backlit remote controlWorks with cable and antenna; does NOT support satelliteUse CableCARD decoders from your cable company to replace your cable boxSupports high definition TVWhat's in the box: TiVo HD XL DVR, TiVo backlit, programmable remote control, Quick Start guide, Manual, HDMI cable, composite cable, component cable, phone cord, power cord, 4 AAA batteriesLearn MoreWith a TiVo DVR connected to an existing phone line or home network you canRecord Every Episode of Your Favorite ShowsThe TiVo service keeps track of the latest TV schedule, and automatically records every episode of your favorite shows, even if the day or time they air changes. All you do is find the show you want by searching or browsing the TV listings, and then specify whether you want to record all episodes or just the new ones.Record Two Shows at OnceTiVo DVRs have two tuners, so they can record two different TV shows at the same time. You can even play back a third show that you&rsquo;ve already saved while two new shows are recording.TiVo HD DVR and TiVo Series3 HD DVRs work with the following configurations:Digital cable only (record 2 shows at once, requires up to two CableCARD decoders from your cable company; supports HD channels)Antenna only (record 2 shows at once; supports HD channels)Digital cable + antenna (record 2 shows at once; supports HD channels)Basic cable (record 2 shows at once; does not support HD or premium channels)Basic cable + antenna (record 2 shows at once; supports HD channels on antenna only)Does NOT support:SatelliteCable box (replace your digital cable box with a CableCARD decoder)Control live or recorded showsTiVo DVRs can: Pause live or recorded shows (live TV can stay paused for 30 minutes), Rewind (3 different speeds), fast-forward (3 different speeds), instant replay, slow motion, frame forward, frame reverse, skip-to-tick (jump ahead or back in 15 minute increments in recorded shows), jump to the beginning of a show, the end of a show, or the point being broadcast live at that moment.Search for showsYou can search for shows with a specific word in the title or episode description, like \"House\". You can search for shows in a particular category, like &ldquo;Cooking&rdquo; shows about \"Chocolate\", or \"Football\" programs with \"Giants\". You can even find every movie with Johnny Depp, or every movie directed by Steven Spielberg. If it is available on your television lineup, the TiVo service can find it and record it for you.Record by actor, director, or keywordUse a TiVo WishList search to find every show with your favorite actor, director, keyword, or sports team. Your TiVo DVR will save your search, and if you like, automatically record every new show that matches it.TiVo SuggestionsTiVo Suggestions are personalized shows selected to match your preferences. Any time you watch a live TV or recorded show, or see something you like or don&rsquo;t like in the Guide, you can rate that show by using the THUMBS UP or the THUMBS DOWN buttons on your remote control. When the TiVo DVR has empty space, it will automatically record shows that are liked by other people who like the same shows you do. This is an excellent way to discover new shows that may interest you. TiVo Suggestions never replace any shows you request, or prevent them from being recorded. Suggestions are always the first programs to be deleted when it&rsquo;s time for one of your shows to record.Pre-approve kids TVWhen you enable KidZone on your TiVo DVR, you can select the programs and channels that your children can watch. You can also block specific shows on channels that you have approved, to keep your kids from watching those shows you just can&rsquo;t stand. When you let your children watch TV you&rsquo;ll be comfortable knowing they can only get to shows you&rsquo;ve approved.Schedule shows onlineYou can search for TV shows by title, category, keyword, or person in the Find TV shows section of tivo.com. When you&rsquo;ve found the show you want to record, simply log in to your tivo.com account, select the DVR you want to set to record, and decide whether you want to record just that episode or every episode of the series. You have access to the same settings as you do when you set up a recording on the DVR itself. You will receive one email confirmation when your request is received and a second one when the DVR has reported back whether your show will record.When the TiVo DVR is connected to a home network that includes a PC or Mac you canTake your shows with youOnce you&rsquo;ve recorded your favorite shows on your TiVo DVR, you can transfer them to your computer, iPod, PSP, or other compatible portable player &nbsp;as long as your DVR is connected to your home network. For PC, you will need TiVo Desktop for PC (transfer to computer only) or TiVo Desktop Plus for PC (t ransfer to portable player). For Macintosh computer, you will need Roxio Toast TitaniumSave shows to a DVDYou can save your favorite TV shows and movies to a DVD using your network-connected TiVo DVR and your computer capable of creating DVDs. To save your TiVo shows to DVD using your PC, you will need Roxio Creator . To save your TiVo shows to DVD using your Macintosh, you will need Roxio Toast Titanium software.Transfer shows between two TiVo DVRsIf you have more than one TiVo DVR with TiVo service on your home network , you can transfer shows between the two DVRs. That way you can start watching a show in the living room and finish it in the bedroom. High-definition shows can only transfer between two HD-compatible TiVo DVRs. Standard definition shows can transfer between all Series2, HD, and Series3 DVRs. Video downloads and any shows that have been protected by the copyright holder can not be transferred. If you don&rsquo;t have a home network, you can directly connect two DVRs together by creating a peer-to-peer network.Your own music libraryIf you have MP3 music files on your PC or Mac, you can stream them to your network-connected TiVo DVR for playback through your TV or home entertainment system. To stream music from your PC, you will need TiVo Desktop software for PC . To stream music from your Macintosh, you will need TiVo Desktop software for Mac.Your photo libraryIf you have photos on your PC or Mac, you can use your network-connected TiVo DVR to view them on your TV. To view photos from your PC, you will need TiVo Desktop software for PC . To view photos from your Macintosh, you will need TiVo Desktop software for Mac .When your home network is connected to your high-speed internet connection you canAmazon Instant VideoUsing your broadband-connected&nbsp; TiVo DVR watch new release movies and your favorite TV shows in HD. Movies are typically available the same day they are released on DVD. TV shows are typically available within days of the original broadcast. Movie rentals are usually $2.99 or $3.99 (with HD titles only a dollar extra specials as low as 99 cents). Buy movies for $9.99 to $14.99 (with some titles as low as $5.49). TV show episodes may be purchased for as little as $1.89 each, with HD shows starting at $2.99 each. There are even shows and bonus footage you can download for free. Rentals must be viewed within 24 hours of starting playback. Rentals not started after 30 days will be deleted, and must be re-rented to view. Purchases may be kept on your TiVo DVR as long as you like. If you delete a purchase you can typically re-download it at no additional charge from your Amazon Media Library.Music videosYou can download thousands of FREE music videos from Music Choice directly to yourbroadband-connectedTiVo DVR.Rhapsody music serviceWith Rhapsody on TiVo you cah choose from millions of songs, search for your favorite artists, tune into continuous music on Rhapsody Channels, and build your own music library&ndash;straight from your TV using your TiVo remote control. Whether you&rsquo;re in the mood for classical, hip-hop, or anything in between, it&rsquo;s all just a few clicks away. And with a Rhapsody membership you can listen all you want without the need to buy individual songs.&nbsp; You can try the Rhapsody music service on your TiVo DVR free for 30 days. To continue using the service after the free trial, visit www.rhapsody.com/tivo/signup to join.Internet radio &amp; podcastsYou can play your favorite audio podcasts on your broadband-connected TiVo DVR using our Podcaster feature, or listen to the world&rsquo;s largest Internet radio network with Live365.com. Take advantage of the great sound system on your TV or home entertainment system and relax and enjoy your favorite audio entertainment.View family and friends' photos fromPhotobucketorPicasa Web Albumson your TVYou can make your personal photos available to your family and friends to view directly on their TV using their TiVo DVR. All you need to do is create an account with www.photobucket.com or www.picasa.google.com and upload your photos. Then let your family and friends know your user name, and they can search for and view your public photos on theirbroadband-connectedTiVo DVRsHome videosYou can make your personal home movies available to your family and friends to watch directly on their TV using their TiVo DVR. All you need to do is create an account with www.onetruemedia.com and upload your photos and video footage, edit and customize your movie, and receive your private channel code. Then share that code with family and friends, and they can have your new videos automatically downloaded to theirbroadband-connectedTiVo DVRs.Internet feedsSome videos on the Internet are available as part of regularly updated feeds (such as RSS or video podcasts). UsingTiVo Desktop Plus softwareon your PC, the TiVo DVR can monitor your favorite feeds for updates. When a new video is available, it will be automatically downloaded and made available on yournetwork-connectedTiVo DVR, so you can watch it on your TV instead of on a computer monitor. Get freevideo downloads&mdash; things not available on TV &mdash; from dozens of leading providers.Connections", "title": "TiVo TCD658000 HD XL Digital Video Recorder", "price": 389.99, "imUrl": "http://ecx.images-amazon.com/images/I/31V6byIbPhL._SX300_.jpg", "related": {"also_viewed": ["B00EEOSZK0", "B007JPCL88", "B000RZDBM2", "B0036OR91A", "B000ER5G58", "B0036OR910", "B005TI1ILS", "B00E8HIN78", "B006L8TX94", "B00E8HGWIK", "B00BUCLVZU", "B008RWHC0E", "B009D90JFA", "B000ER1G3E", "B0038JECKY", "B00GGVPKKC", "B00BF2M21C", "B007FEEO3S", "B00G037DQU", "B00JGZQ17Q", "B0043EGG5M", "B008RHTXLA", "B00EYO241Q", "B008KXG59O", "B00G037DQ0", "B0066O1DI2", "B000ER5G6C", "B00EHHPPM0", "B009WROL6G", "B0036F0JPC", "B009L04DCQ", "B0036OR924", "B00I2ZBD1U", "B002AVXDWE", "B004HKIB6E", "B003MVZ60S", "B00BA4ILX8", "B004XIB9UA", "B003H3A2NM", "B00HC2XTMA", "B004W9BKE0", "B0002A0206", "B00J05QJPG", "B0018LX0DY", "B009EDFUOK", "B002Z1JCP6", "B0089R57KY"], "buy_after_viewing": ["B00EEOSZK0", "B007JPCL88", "B003H3A2NM", "B000RZDBM2"]}, "categories": [["Electronics", "Television & Video", "Streaming Media Players"]]}