{"asin": "B000HZA2LA", "categories": [["Automotive", "Tires & Wheels", "Accessories", "Snow Chains", "Car, Light Truck & SUV"]], "description": "The SCC Super Z6 SZ135 winter traction product offers superior performance for cars, pickups, and SUVs with very limited operating clearance around the drive tires. Be ready for winter driving with an innovative solution that is a step beyond traditional tire chains.New DesignBased on the \"Z\" family of products, the Super Z6 is designed for vehicles with restricted clearance around the drive tires. The Super Z6 requires only 6.33 millimeters (.25 inches) of sidewall clearance to operate, less than half the space required by most cable and tire chains.The Super Z6 installs quickly and easily.View installation guide.Be prepared for driving this winter with Super Z6 traction systems.A diagonal crossmember pattern provides better outstanding traction and durability than conventional chain systems.Easy to InstallA split outside cable with two fastening positions allows for easy installation without moving the vehicle, so there's no need to stop and retighten. The traction coils are manufactured from alloy steel to increase the lifespan of the product. The Super Z6 is also designed to prevent scratching of alloy or high performance tire rims.VersatilityThe Super Z6 is available to fit passenger cars, pickups, and SUV tire sizes. It offers a unique combination of performance and convenience features for every user, including a \"designed-in\" rubber tightener, better all-around traction performance than conventional tire chains or cables, and greater durability.Designed for High PerformanceThe Super Z6 has better compatibility with anti-lock brakes, traction control, all-wheel drive, and other electronically monitored control systems so as not to interfere with the normal handling characteristics of your vehicle. The unique design also offers a low potential for damage to vehicle body and mechanical components, even when abused.The Super Z6 SZ135 is designed for tires sized from approximately 195 to 255 millimeters. Check the manufacturer's website for the exact product to fit your tire size. Also check your owner's manual for clearance specifications before installing winter traction products.What's in the BoxChains, plastic gloves, one pair of rubber tensioners, durable, re-usable nylon bag, and clear, illustrated step-by-step installation and removal instructions.", "title": "Security Chain Company Super Z6, SZ135, Cable Chain for Passenger Cars, Pickups &amp; SUVs - Set of 2", "price": 54.44, "imUrl": "http://ecx.images-amazon.com/images/I/516Z1N0DX4L._SX300_.jpg", "brand": "SCC", "related": {"also_bought": ["B006PAM19W", "B006PAM19M", "B006PAM1IS", "B000BPLNXC", "B000HACYNY", "B002SIR91A", "B001DKO3X6", "B001H9GQR4", "B000CQ6DK8", "B000IAIP72", "B001DKR6CQ", "B000VAKXVA", "B000BQQWR8", "B008YPPVS4", "B000BPTUR8", "B000UNLVDC", "B00308ZIOM", "B000CQ6DJO", "B004GYKO9S", "B004G7DSD4", "B002JAZXWE", "B000B8Y016", "B005PW6MTG", "B000CQ466G", "B000CQ6DIU", "B000FW4LT4", "B002JAUL26", "B000FSZF5M", "B0091RCIOO", "B00K52I21C", "B0022UYBII", "B00AQESYEO", "B000GAYNXO", "B0006MQJ02", "B000GCRWCG", "B000NPPBHO", "B00812M5Q6", "B001CF4UXU", "B00A64ZQBI", "B009LJAYJS", "B003PBEK0M", "B007TG7I0I", "B002SINBRQ", "B00H4ILJNI", "1935182706", "B00LE6T4ZQ", "B00A8O1Y1W", "B004NBZLJ2", "B000FQ7L92", "B000XB7UA4", "B00042KJQ4", "B004UG41XW", "B00080QHMM", "B005ILYG4M", "B0018BGFM2", "B00G5G7K7O", "B0007ZF4PE"], "also_viewed": ["B000VAKXVA", "B000CQ6DK8", "B001H9GQR4", "B001DKR6CQ", "B000UNRJE2", "B004G7DSD4", "B0053UE2PG", "B003SK8DMQ", "B000UNKGKG", "B002LF7H08", "B004BT8WS8", "B000UNLVDC", "B000BR8U9K", "B000HZA2OM", "B0091RCIOO", "B000UUZPT6", "B001DKV5XW", "B004BWKJ2C", "B006PAM19W", "B000CQ466G", "B004C0G0YY", "B004BT8Y5O", "B005TU62DU", "B001ED4Q1Q", "B005PW6C6E", "B000BRA6P6", "B004GLBANK", "B000BTDKKM", "B005EMHC0U", "B004GYNZ94", "B008C2GJNU", "B004GYKO9S", "B005VPS0H4", "B006PAM1IS", "B006PAM19M", "B000BPLNXC", "B008RWU7OC", "B002KQG9OI", "B000CQ6DIU", "B005Q0TE7E", "B000BREMP6", "B005PW6B5Q", "B004BWKNEG", "B000BREMQ0", "B005PW6MTG", "B000BTDKLQ", "B005N7JLNM", "B002KQ89LE", "B005PW6CFA", "B000HACYNY", "B001IYNYH8", "B002KQG902", "B002KQA8EK", "B005PW6JOY", "B002KQ86EY", "B005ZUZ3FM", "B000BR8U9A", "B00C5SNS4K"], "bought_together": ["B006PAM19W", "B000BPLNXC"]}}