{"asin": "B002SG7MEG", "description": "The Iomega StorCenter ix2-200 Network Storage offers content sharing with advanced security, and is ideal for small and remote offices, workgroups or home networks. Based on enterprise-class EMC storage technology, the StorCenter ix2-200 provides easy file sharing, iSCSI block access, and multiple RAID configurations for optimized data protection. Business users will appreciate the robust data protection features such as UPS support, print serving, folder quotas, rsync device-to-device replication, and user replaceable drives for business continuity and disaster recovery. The easy-to-use interface provides no-hassle management. Active Directory support and remote access round out the comprehensive business features. The StorCenter ix2-200 supports up to five Axis IP security cameras for basic video surveillance. Home users benefit from the advanced media features such as the DLNA certified UPnP AV Media Server, PTP (Picture Transfer Protocol), torrent download compatibility, Bluetooth upload, and Cooliris slide show plug-in. Award-winning EMC Retrospect Express backup software and RSA BSAFE encryption for protected installs and upgrades. Supports PC, Mac and Linux clients and is VMware certified for NFS and iSCSI. Available in 1TB, 2TB and 4TB capacities.StorCenter ix2-200 Network StorageUser-Swappable DrivesIdeal for Small Offices and Remote OfficesThe StorCenter ix2-200 offers many features that a small office will appreciate such as the iSCSI target that provides block-level access for the most efficient storage utilization, remote access via an internet connection, as well as print sharing with up to 3 USB printers.  The StorCenter ix2-200 Network Storage is VMware Ready certified.The StorCenter ix2-200 Network Storage also offers device-to-device copy jobs via the one-touch QuikTransfer button and will even send email alerts to help IT administrators manage the StorCenter.Great Features for Home NetworksThe StorCenter ix2-200 Network Storage offers many features that home users will enjoy such as a UPnP DLNA certified AV Media Server to stream music, videos and photos via game consoles, photo slideshows using Cooliris technology, and a torrent download manager for peer-to-peer file transfers without the need of a dedicated PC.Other features are the Bluetooth Upload to transfer contacts, photos, and more from cell phones, pocket PCs, and BlackBerry&rsquo;s, Picture Transfer Protocol to automatically transfer photos from a digital camera via a USB port, and best of all &ndash; an easy 4-step set up process.Easy to Use Network StorageProduct FeaturesSharing: Access files from any networked Windows PC, Mac or Linux workstation for easy file sharing, data backup and print servingRAID Support &ndash; RAID 1 with automatic RAID rebuild.  JBOD mode also available.iSCSI support provides block-level access for the most efficient storage utilization, especially for database and email application performanceHigh Performance: Gigabit Ethernet connectivity with Jumbo frame support and high performance embedded architectureActive Directory Support: Functions as a client member in an Active Directory domain allowing the Iomega StorCenter ix2-200 to utilize the domain users and groupsFolder Quotas: Easily manage capacity by setting a maximum for shared storage foldersUPS Support: Enables unattended system shutdown via the USB port without data loss in the case of extended power failureEmail Alerts: If the device detects a problem, an email alert is sent to one or more email addressesExpandability: Add storage capacity by connecting external USB Hard Disk Drives. It supports read and write on Fat32, NTFS or ext2/ext3 formatted hard disksPrint Server: Intelligent print sharing capability for up to 3 USB printers directly connected to the ix2-200Advanced Media Support: Includes UPnP support through an integrated DLNA certified media server. Also supports PTP and Bluetooth uploadVMware Certified: HCL certified NAS (NFS) and iSCSI storage for VMwareSecurity Camera: Connect up to 5 Axis network security cameras and the ix2-200 captures and stores video without the need of a dedicated PCEMC Retrospect Express Backup Software (unlimited client licenses) for automated backups on a scheduled basis (client to StorCenter)Iomega QuikProtect Software for effortlessly synchronizing files between the clients and the StorCenter ix2-200RSA BSAFE encryption technology protects installs and upgradesWarranty: 3 years with product registrationWhat&rsquo;s in the BoxStorCenter ix2-200 Network Storage, Ethernet cable, power supply, Quick Start Guide, solutions CD with system administration software, Iomega QuikProtect Software, EMC Retrospect Express Backup software and user manual", "title": "Iomega StorCenter ix2-200 - 2 TB (2 x 1TB) Network Attached Storage 34481", "price": 98.95, "imUrl": "http://ecx.images-amazon.com/images/I/41ocBslKl9L._SX300_.jpg", "related": {"buy_after_viewing": ["B008JJLZ7G", "B008JJLXO6", "B008JJLW4M", "B004L9M4DW"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "Network Attached Storage"]]}