{"asin": "B00519RW1U", "description": "Discover the next generation of portable entertainment with the thin, light, and powerful Samsung WiFi Galaxy Tab 10.1-Inch. Showcasing a 10.1-inch widescreen HD display and a dual-core processor for stunning detail and speed, the Galaxy Tab 10.1 delivers sharper movies, better game graphics, and crystal-clear video chats. Surf the web in its full glory with Adobe Flash compatibility and WiFi and Bluetooth connectivity. The Android 3.1 Honeycomb OS provides open access to over 200,000 Android Market apps, giving you the freedom to customize your Tab however you please. At 1.25 pounds, this sleek, 0.34-inch-thick tablet is designed for premium mobile computing around the house and on the go.WiFi Galaxy Tab 10.1-Inch(16 GB)At a Glance:10.1-inch HD widescreen display offers high resolution1.25 pounds and 0.34 inches thick for maximum portabilityAdobe Flash compatible for unrestricted web browsingAndroid 3.1 OS with open access to over 200,000 apps for full customizationDual-core processor and 1 GB of RAM provide power and speed3-megapixel camera and camcorder; front-facing video chat cameraCompatible with a wide spectrum of Google services, media, and document filesLimited one-year warrantySlim, lightweight body is designed for easy grip and portability.View larger.Features a 3-megapixel camera for crisp pictures and 720p video.View larger.Access to Android Market lets you customize your web and entertainment needs.View larger.Dual-Core Processor Provides Speed and PowerA dual-core Tegra 2 processor and 1 GB of RAM deliver lightning-fast speed whether you're surfing the web, watching HD video, or playing the latest games. The Galaxy Tab 10.1 also features Adobe Flash compatibility, allowing you to experience unrestricted browsing on millions of web pages. And with up to 10 hours of battery life, the Galaxy offers endurance as well as power.The Galaxy supports WiFi 802.11 a/b/g/n and Bluetooth v2.1 connections. A 30-pin IF connector and USB 2.0 compatibility offer easy file transfer and charging.This version of the Galaxy Tab offers 16 GB of onboard memory. For additional memory storage, Samsung also offers the32 GB Galaxy Tab 10.1.Light, Sleek Body with HD DisplayEnjoy your media in beautiful clarity thanks to the Galaxy's 10.1-inch widescreen display with 1280-by-800-pixel high-definition resolution.At 1.25 pounds, the Galaxy Tab is remarkably light. Measuring 10.1 by 6.9 by 0.34 inches (H x W x D), this easy-to-grip tablet is designed to fit comfortably in your hand and travel with ease.Access to Android Market for Full CustomizationThe Galaxy Tab 10.1 features the Android 3.1 Honeycomb operating system, which offers exceptional speed and power for immersive web browsing and multitasking. With open access to Android Market--the fastest growing app market--over 200,000 apps are only a touch away, giving you the freedom to customize your tablet for all of your web and entertainment needs.Intuitive Android OS Designed for MultitaskingSince Android 3.1 is designed specifically for tablets, computing is visual, fluid, and intuitive, making multitasking a breeze. The Quick App Tray can float above other applications, keeping important tasks at your fingertips, while multiscreen scrolling allows you to view up to five screens at the same time. The system's enhanced browser includes tabbed pages, form auto-fill, bookmark syncing with Google Chrome, and private browsing.Integrated Google ServicesAndroid 3.1 also features key Google services that you can easily access through convenient apps on your home screen. Use Google Maps with the Galaxy Tab's built-in GPS to point out your current location, search for businesses and addresses, and get directions. View your Gmail inbox and conversations side by side, and drop Gmail widgets on your home screen to stay on top of all your accounts. The mobile YouTube app provides a simple way to search, browse, and watch videos on your mobile device, while Google Talk lets you swap between multiple chats at a time, search your chat history, and see previews of videos and images within conversations or video chat.Back- and Front-Facing CamerasThe Galaxy Tab 10.1 is equipped with a 3-megapixel camera for snapping crisp pictures and capturing 720p video. It also features a 2-megapixel front-facing camera for Google Talk video chat. You can share Tab content on your HDTV through the Tablet Extender feature, or stream it wirelessly with Allshare.Compatible with Popular Media FormatsDesigned to handle all of your portable entertainment needs, the Galaxy Tab 10.1 is compatible with major audio, video, and image file formats, letting you enjoy all of your media whenever and wherever you please. Stay entertained with Samsung's music and media hubs, where it's easy to purchase a wide range of content, including music, books, and magazines.Security Suite Ideal for Business UseThe Galaxy Tab 10.1 is compatible with Word, Excel, PowerPoint, and PDF files, making it ideal for handling your business needs as well as your entertainment. An enterprise-friendly tablet, the Galaxy Tab includes a suite of security solutions. Relationships with SAP, Exchange ActiveSync, Cisco AnyConnect, Sybase, and Cisco WebEx make it possible to operate efficiently, confidently, and securely.The Samsung WiFi Galaxy Tab 10.1-Inch is backed by a limited one-year warranty.What's in the BoxWiFi Galaxy Tab 10.1 (16 GB), 30-pin IF connector, USB 2.0 cable, charger and plug, earphones, product registration, and instruction manual.", "title": "Samsung Galaxy Tab (10.1-Inch, 16GB, Wi-Fi)", "price": 319.0, "imUrl": "http://ecx.images-amazon.com/images/I/51hepeLazbL._SY300_.jpg", "related": {"also_viewed": ["B00D029NNA", "B00DEZ5KMQ", "B00JKCH552", "B0087DXLOO", "B0052P6DQI", "B007M50PTM", "B00JKCH4X0", "B00EVNVP0G", "B00IAA2EY2", "B0088URQSI", "B006XGCQ2U", "B00IY2B60O", "B00IXZVKWQ", "B00ET9L9U8", "B0075W8E4A", "B00FAOLLG8", "B00G6SHDQ4", "B00C6TP52Q", "B00BJ8I7P2", "B0051OKCHG", "B006XGCQ48", "B00HTD7MS4", "B00GGGMS20", "B008DWG5HE", "B00DQ5LSO8", "B00HMTXYVY", "B00H90AIOM", "B006UGNYNI", "B00J8DL78O", "B00HBZ5EIA", "B00JCGXHVW", "B00GP5IMY0", "B008F4NL04", "B00ETLZ5AG", "B006DIWZ42", "B007P4YAPK", "B00JKCH4V2", "B00DIYS93A", "B00JAIE86U", "B00AG6NAF0", "B00DB1NNXG", "B004U9USEA"], "buy_after_viewing": ["B00D029NNA", "B00D029NNA", "B00DEZ5KMQ", "B00DEZ5KMQ", "B00JKCH552", "B007M50PTM"]}, "categories": [["Electronics", "Computers & Accessories", "Tablets"]]}