{"asin": "B000BQ57BU", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]], "description": "The JBL On Tour is a compact, lightweight, high performance portable sound system. Connected to your iPod, MP3 player, laptop or other music source, the JBL On Tour will provide hours of clean, powerful sound. JBL On Tour runs on 4 AAA batteries or with an AC adapter. With a protective cover and compact size, you can easily go on the road and let your iPod or MP3 player rock out in your room.Compatibility&nbsp;The stereo mini jack connection allows you to enjoy high quality audio from a variety of devices such as iPod, iPod mini, MP3 and CD players, desktop computers (all platforms), laptops and most portable devices.Easy-to-Use Touch-ControlsTouch Volume Control--Just a touch increases or decrease the volume. A touch on both pads mutes or un-mutes the system. JBL On Tour also remembers your last volume setting even after the system shuts down.Additional FeaturesIntegrated protective Cover and Stand. The sliding cover protects your sound system and serves as a stand when open. The surface gripping rubber feet provide a stable platform on most surfaces. A universal AC adapter allows for easy worldwide use. An audio input cable is also included.Advanced TechnologyThe JBL On Tour combines many proprietary technologies to provide the highest quality sound and playing time. The JBL On Tour will provide astonishing bass and clear accurate sound from a pocket sized system.Digital Amplifier Technology--The Class D digital amplifiers provide clean, powerful sound while extending battery life.Odyssey Transducers--The two aluminum domed transducers are driven by powerful Neodymium magnets. This design provides a full rich frequency response from the lowest bass to the highest highs.COE (Computer Optimized Equalization)--The JBL On Tour system equalization was computer optimized to provide a rich, complete sound stage.AEMS (Advanced Energy Management System)--The JBL On Tour system has an automatic battery saving shutoff. The AEMS will automatically put the system into sleep mode when the cover is closed or when there is no audio input. The JBL On Tour awakens with just a touch and resumes at the same volume level when the cover is opened or the input resumes.Battery Powered--The JBL On Tour is designed to use most types of AAA batteries. Four fresh AAA batteries provide over 24 hours of continuous play at normal to high listening levels. An amber LED flashes when the battery protection circuit senses the batteries are low. JBL encourages the use of rechargeable types of batteries (i.e. NiMH and Lithium). These batteries reduce waste and help the environment.", "title": "JBL On Tour Portable Speaker System ( Black )", "price": 269.99, "imUrl": "http://ecx.images-amazon.com/images/I/31-QengJY8L._SX300_.jpg", "brand": "JBL", "related": {"also_viewed": ["B00FPUYSXK", "B009AXVM6E", "B00BNIO4H8", "B000BRV60A", "B005FMBVLA", "B00F5IV0GU", "B007E4AER4", "B007E4A8CK", "B00F8JEJKK", "B0096T7TQE", "B0092PDT20", "B0007XU370", "B009AYLDSU", "B00BNIO88I", "B00BNIO6G2", "B00HKIXOEY", "B00BSGUPQY", "B008PCBCU2", "B0096T7U04", "B008N5FBX0", "B00GAJ2OK4", "B00CBGJ1NI", "B003Y3BFB8", "B0098FAH7O", "B007E4A8NO", "B00I3Q5CJC", "B0062S88OY", "B009AWT01Y", "B009V09YY8", "B009INNQL0", "B0013N3T7O", "B007E4AERY", "B00KH636V2", "B00B5RP0C0", "B00F5IUH3M", "B0016BI0TA", "B00F8HRTCC", "B003BIFJOA", "B0061HMRA2", "B00F8HRSN2", "B00B2G3R5G", "B00J9O4B6W", "B009V0A0GY", "B00BMMPPNW", "B00CBSBQ1Q", "B00DQAPJSY", "B004UHWZDY", "B0061HMPWM", "B008Y5GHCI", "B003BIFJTA", "B00I5O2KVU", "B00CM0XHNS", "B00E64GUGY", "B00B5QNGN6", "B00GAJ2NLE", "B005KQ2O26", "B00CAMCCMA", "B00I5ODA4Q", "B00JBM5X3W"], "buy_after_viewing": ["B00FPUYSXK", "B009AXVM6E", "B00BNIO4H8", "B0096T7TQE"]}}