{"asin": "B002I3OZB2", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Headsets & Microphones", "PC Headsets"]], "description": "From the Manufacturer It's late. The gaming casualties are heavy--but not your Logitech Gaming Headset G330. With its lightweight, behind-the-head fit, pivoting ear pads, and adjustable headband lined with soft, pressure-relieving silicone, you're well prepared for marathon gaming sessions. A noise-canceling microphone with flexible boom reduces annoying background noise and rotates out of the way when you're not using it. It's one serious gaming headset providing you comfort that won't quit.Key Features&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Adjustable, behind-the-head design provides a lightweight, personalized fit&#8212;the first of its kind in gaming headsets.&nbsp;Silicone-lined headband and pivoting ear pads relieve pressure from extended wear.&nbsp;Noise-canceling microphone reduces annoying background noise; position the flexible microphone right where you want it and rotate it out of the way when you're not using it.&nbsp;Use the USB adapter to connect digitally to any USB port for enhanced audio or directly to your PC sound card via 3.5 mm jacks.&nbsp;3.5mm connection.&nbsp;In-line audio controls let you adjust the volume or mute the microphone without pausing the action.&nbsp;Microphone mute switch.Check out the G-SERIES&nbsp;&nbsp;from Logitech:", "title": "Logitech Gaming Headset G330 (Black)", "price": 99.95, "imUrl": "http://ecx.images-amazon.com/images/I/41nwjpAizcL._SX300_.jpg", "brand": "Logitech", "related": {"also_bought": ["B00008ZLHG", "B000OAHOVO", "B0034XREEA", "B002TXIB7U", "B006JH8T3S", "B002HJ9PTO", "B003EALLHE", "B004SP0WAQ", "B005VAORJO", "B008I64U2C", "B0058P0I2C", "B003554BPW", "B000FKNZR0", "B00BUIA362", "B000UXZQ42", "B002VA464S", "B005LKRB4M", "B00ENFA3GO", "B001MSS6CS", "B00BCEK2LU", "B005GTNZUM", "B004UAJZDY", "B006T0CHLA", "B00EO2ECUY", "B000UEZ36W", "B00BCEK2LA", "B00E8CF268", "B008CXFM64", "B00CO8TBQ0", "B0052WCZEK", "B0061TXSSA", "B005BZNDS0", "B00BFOEY4I"], "bought_together": ["B006JH8T3S"], "buy_after_viewing": ["B003VANOFY", "B000OAHOVO", "B00BFOEY4I", "B00CQ35C1Q"]}}