{"asin": "B001SEL326", "related": {"also_viewed": ["B000Z3XXR4", "B0028N6VNW", "B001AZ01EO", "B001SEL36M", "B000Z3U1P6", "B007IL6OR2", "B003B20F54", "B003B48UQ8", "B004T9RR4A", "B007IL72CI", "B007IL7AKM", "B0014J07R2", "B004T9RR7C", "B005HFJFHW", "B00D8BQI5O", "B004K1EZDS", "B004T9RR6I", "B003B4AVRE", "B002HWRJY4", "B007IL764W", "B00387G6R8", "B003B4AVSS", "B0041LYY6K", "B005S0BYQ6", "B001F7HLRC", "B00C0WZ9FW", "B000FDOWQK", "B008HO9DK4", "B0083P4SIE", "B008I21EA2", "B0049YQVHE", "B006QB1RPY", "B00DLYD31A", "B003VY83GU", "B0098QV038", "B000WG3ZU4", "B00EXK14S0", "B000BTL0OA", "B00D9S36CE", "B00L4HWY3E", "B0088CJT4U", "B0014IYZDK", "B0085WN7YQ", "B008RV51EE", "B001UI4RTG", "B00DES2FQW", "B0028N6VLE", "B008HO9DIG", "B00JZWQW4C", "B00EM5UFP4", "B00BUSDVBQ", "B007ZIFICU", "B0042X3F76", "B0081H8TRA", "B005276QSQ", "B005FDXMJS", "B004T9RR0E", "B004PA2B6C", "B00F0DD0I6"], "bought_together": ["B004XC6GJ0"], "buy_after_viewing": ["B00AJHDZSI", "B004XC6GJ0", "B006QB1RPY", "B000Z3XXR4"]}, "title": "Cisco-Linksys  WRT320N Dual-Band Wireless-N Gigabit Router", "price": 134.93, "salesRank": {"Electronics": 16746}, "imUrl": "http://ecx.images-amazon.com/images/I/41ZlNKAjqlL._SX300_.jpg", "brand": "Linksys", "categories": [["Electronics", "Computers & Accessories", "Routers"]], "description": "Get ready for the power of Wireless-N technology with the Linksys by Cisco WRT320N Dual-Band Wireless-N Gigabit Router that provides ultra-fast transfer speeds, air-tight security features, greater coverage, and support for wireless and wired devices. Dual Wireless-N radio bands ensure less interference from other wireless networks, and four integrated Gigabit Ethernet ports provides support for a variety of wired devices at blazing-fast speeds ideal for streaming videos, gaming, and ultra-quick file transfers.Wireless-N Technology for Superior PerformanceWireless-N is the latest technology built for faster transfer speeds with less interference and greater range. The WRT320N features dual Wireless-N radio bands for a crystal-clear signal with less static and interference from other wireless networks in the area. Plus it's versatile &ndash; the WRT320N Router will work great with any of your existing Wireless-G, B, or A devices, so you don't have to go out and purchase all new equipment.The power of Wireless-N makes it an ideal choice for heavy gaming, streaming video, and large file transfers. With the WRT320N, you get Multiple in, Multiple Out MIMO technology, which utilizes signal reflections that work to boost range and reduce dead spots. This means greater coverage, less interference, and reduced dropped signals.Four Gigabit-Enabled Ports for Wired DevicesThe WRT320 Dual-Band Wireless-N Router enables you to not only have an ultra-fast wireless network, but also to connect all of your Gigabit-enabled wired devices - such as storage drives, computers, and printers &ndash; at the same blazing-fast speeds as your wireless devices. All four of the Gigabit ports support auto-crossover (MDI/MDI-X), so there's no need to purchase crossover cables. The versatile WRT320N is the only router you'll ever need for your home network.Air-Tight Security FeaturesThe WRT320N protects your wireless network from security breaches and malicious attacks from hackers with its two powerful, built-in security features. This router features both 128-Bit encryption and SPI Firewall for air-tight security that will keep your network safe and secure from Internet attacks.Minimum System RequirementsInternet Explorer 6.0, Safari 3.0, or Firefox 1.0; CD-ROM drive; Windows XP, Vista or Vista 64-bit edition; Wired or Wireless Network AdapterCompatible with Windows and Macintosh, the Linksys WRT320N Wireless-N Router measures 7.95 x 1.34 x 6.3 inches and weighs 10.58 ounces. It is backed by a 1-year limited warranty.What's in the BoxDual-Band Wireless-N Gigabit Router, setup CD-ROM, User Guide CD-ROM, Quick Install, Ethernet network cable, and power adapter."}