{"asin": "B002MWYUFU", "categories": [["Electronics", "eBook Readers & Accessories", "eBook Readers"]], "description": "The Reader Touch Edition features a 6\"display with simple, easy-to-use touchscreen navigation. Turn pages with the swipe of a finger and enjoy fast and intuitive navigation of your favorite books. Take freehand notes and highlight sections of text you want to revisit later, just as you would in a real book, using the included stylus. If you prefer, a virtual keyboard is also available for entering quick notes or searching your eBooks. If you want, you can even export your notes to your computer using the eBook Library software. Enjoy access to a wider number of books from a wider number of places. By supporting both industry standard formats, ePub and PDF, you can access books at Sony's eBookstore, check out books from public libraries, access over 500,000 free public domain titles from Google, as well as sharing sites, online aggregators and personal publishers (Internet access is required). Not sure which books to bring on your trip? With the Reader Touch Edition, you will never have to make that choice again. 512MB of onboard memory lets you carry up to 350 of your favorite books at a time. Whether you're venturing across town or across the country, the Reader Touch Edition makes an ideal travelling companion. Measuring just 0.4\" thin and weighing less than 9 ounces, the Reader Touch Edition is thinner and more lightweight than almost any book, and even many magazines. The Reader Touch Edition utilizes E-Ink screen technology to deliver an amazing, paper-like display that's more like ink on paper and fully readable in direct sunlight. Enjoy up to two full weeks of reading (7,500 continuous page turns) on a single battery charge. Paper-like display for easy, natural reading Two full weeks of reading on a single battery charge; Built-in Oxford American English eDictionary; Intuitive eBook Library software for PC and Mac 5 adjustable font sizes to customize your", "title": "Sony PRS-600BC Touch Edition E-Book Reader", "price": 69.0, "salesRank": {"Electronics": 24472}, "imUrl": "http://ecx.images-amazon.com/images/I/41wdpSkQYDL._SY300_.jpg", "related": {"also_bought": ["B002NFW4XG", "B002MGZTEW", "B0039L8WG6", "B002L9YJJ6", "B002NQW4YE", "B002MSHQ46", "B00538AHNO", "B0035GQ9A6", "B005MIZKW8", "B004GSML22", "B005MIZKZK", "B008I64S4W", "B003YQVTP2", "B0036C7WZ0", "B002ODL7XA"], "buy_after_viewing": ["B007HCCNJU", "B005MIZKW8", "B002MSNS4S", "B002MSHQ46"]}}