{"asin": "B0016P15E8", "description": "Amazon.com Product Description -- Posted May 22, 2008 The TravelSound i80 for iPod nano is a slim, hand-held speaker that comes in a design that perfectly complements the iPod nano 3rd generation. With its powerful high-quality music output, you'll always be eager to share music out loud with all of your friends, making it a great tool for social interaction. Bring the TravelSound along with you anywhere and start enjoying music, unrestricted by the need for earphones or headphones.The TravelSound i80 is a slim, hand-held speaker for the iPod nano 3G.Big Sound, Small PackagePowered by four micro drivers and a Class D digital amplifier, the TravelSound plays your music out loud in high quality. Go easy on your ears after long hours on your earphones, and let the speaker soothe you with easy music listening.Built-in Rechargeable BatteryEnjoy up to 15 hours of music on the move, thanks to the built-in high-performance Lithium-Polymer rechargeable battery.The TravelSound's tri-colored LED indicator tells you when your speaker is powered on, charging, or when the battery power is low.Charge both your TravelSound and iPod nano (when docked) in a simple one-step process using the USB connection port. You can also sync with iTunes the same way.For added convenience, a USB wall charger is also included, letting you charge both your speaker and iPod nano (when docked) easily.Bring the TravelSound along with you anywhere and start enjoying music.The included intuitive speaker stand tilts your speaker, allowing you to view your photos or movies at a comfortable angle.Sleek Speaker StandThe included intuitive speaker stand tilts your speaker, allowing you to view your photos or movies at a comfortable angle.What's in the BoxOne-piece docking speaker, USB wall charger, Quick Start Guide, warranty and technical support booklet, speaker stand, pouch", "title": "Creative TravelSound i80 Speaker Dock for iPod nano 3G", "price": 16.66, "imUrl": "http://ecx.images-amazon.com/images/I/41E0C8WJItL._SY300_.jpg", "related": {"also_bought": ["B000JO7PIM", "B000JO3N3S", "B000W2MW7U", "B0012S7GRY", "B000JO1MU4", "B00166YXN2", "B000WOGA6C", "B000YZCF5Y"], "bought_together": ["B000W2MW7U"], "buy_after_viewing": ["B0062W0XD4", "B004HHICKC", "B000WGQ1PU", "B005UWD2YY"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}