{"asin": "B003J2V8AC", "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Running GPS Units"]], "description": "Garmin's Forerunner 110 is the easiest way to track your training. It's GPS-enabled so it knows how far and how fast--with no extra bells and whistles. There's virtually no setup required, so you can just press start and run or walk with it.Garmin's Forerunner 110 is the easiest way to track your training.Use with included heart rate monitor to hit your targets, track calories burned, and more.Whether you're training to complete your first 5k or you want to get faster and fitter, having accurate workout data is the key.Train Smarter, Not HarderWhether you're training to complete your first 5k or you want to get faster and fitter, having accurate workout data is the key. Forerunner 110 uses GPS to accurately record your distance, time and pace. Data from each run is stored in the unit, so you can go back and review how you did last week or last month. Or, upload to our Garmin Connect website for more detailed analysis.Easy to UseNow there's nothing standing in the way of you and your run. Forerunner 110 is our simplest training device yet. Out of the box, you'll charge it, take it outside to find GPS satellites and answer a few setup questions. Then just press start and take off. Once you're done, press stop. It really is that easy.Follow Your HeartSome versions of the Forerunner 110 (men's black/red and women's gray/pink) come with a heart rate monitor to display your heart rate in beats per minute. It also provides heart rate-based calorie computations so you can accurately track your calories burned. If you purchase the black/gray Forerunner 110 without heart rate, you can buy a Garmin heart rate monitor separately or use with an ANT+ heart rate monitor you already own.Store, Analyze and ShareBeginning and advanced runners know that reviewing data from your run can be motivating and provide meaningful feedback for improvement. Tracking your data is simple with Garmin Connect, our website for free data analysis and sharing. Just upload to Garmin Connect from your PC or Mac, then see the route you traveled on a map, view a summary of your workout data, create goals and more.Fast and AccurateForerunner 110 features HotFix satellite prediction, which means it locks onto satellites quickly so you can be out the door and on with your run in no time. It also has a high-sensitivity GPS receiver to stay locked onto satellites, even near tall buildings or under tree cover.What's in the BoxGarmin Forerunner 110 GPS-Enabled Sport Watch with Heart Rate Monitor (Pink), AC Charger, Owner's Manual", "title": "Garmin Forerunner 110 GPS-Enabled Sport Watch with Heart Rate Monitor (Pink) (Discontinued by Manufacturer)", "price": 183.0, "imUrl": "http://ecx.images-amazon.com/images/I/41%2By6ubceAL._SY300_.jpg", "brand": "Garmin", "related": {"also_bought": ["B00INXADT4", "B00INXAKTC", "B003VL2NR8", "B0029M3NSS", "B00AHPP84Q", "B00BI9X1QM", "B00AK95UOM", "B00INXAY9S", "B0011UNMIK", "B000VK5BMQ", "B0045ZPVB4", "B00INXANNU", "B00FBYY5UG", "B00DGK3T2M", "B00D86D4L0", "B0042ESTSK", "B0029Z3RZ4", "B00BB7MS2Y", "B005L8YVRO", "B00GUGFYNG", "B0025VKUPM", "B004Q7EQ1M", "1609612248", "B00BMM04K6", "B000KRGI4K", "B000A2BCIW", "B00DYQWRC6", "B00AW7IF9Y", "B0088WT4VS", "B00DP6ZWWC", "B002UNFJI8", "B00BBFZ1LQ", "B0049WJ6XW", "B000UOD5QM", "1937715124", "B00AAES5US", "B00AX2OU6A", "B00A49SG8A", "B006ZT7JMM", "B00AK95UL0", "B0075W8UZS", "B002I007IA", "B000YGJYJ8", "B00DPHDEFI", "B00DYAD1F4", "B009T467VY", "B0049VVQ9U", "B0088WTJB8", "B000NU4OTA", "B002OM65OC", "B00APLY6EA", "B00IMBR8KY", "B004WSWX92", "B005I6DA5S", "B00GU1FSBE", "B006BKWL0U", "B00CQ7QDQA", "B004GXA71O", "B0011UNTYC", "B00AK95UYW", "B0097BEEMS", "B002KT3XRQ", "B00AJNB5Y8", "B00DHCRCOK", "B00BMLTY94"], "bought_together": ["B00INXADT4"], "buy_after_viewing": ["B0090C7A3O", "B0090C7A5C", "B00BT6NZJ2", "B00EJJM25Y"]}}