{"asin": "B000X27XDC", "description": "Manufacturer Product Description A Wireless Memory Card? Yes, there really is Wi-Fi inside that tiny little card. It's going to change the way you take, save and share photos.It makes your camera a Wi-Fi camera. Upload and share your photos automatically.Photos shouldn't be trapped in your camera. Set them free effortlessly and wirelessly. The Eye-Fi Card is a wireless SD memory card for your digital camera. It stores pictures like a standard SD memory card, but also uses your home Wi-Fi network to automatically upload images from inside your camera to your PC or Mac and to your favorite photo or social networking website for sharing or printing. No cables, no cradles, no fuss.Key FeaturesUnlimited WebShare erviceWireless Uploads to Computer2 GB of storageHow it works&nbsp;WebShareWith WebShare, your photos can be automatically uploaded to your favorite photo sharing, printing, blogging or social networking website. No wasted time sitting in front of your computer. No fussing with upload software. No delay in sharing your new memories with friends and family.Choose from among more than 20 of the most popular websites and some up-and-comers too. You can upload images privately andcontrol if and when they are viewable by others. Many sites even let you edit your photo albums online. And, you can change your preferred upload site at any time.You can even upload to the Web when your computer is turned off. The Eye-Fi Share and The Eye-Fi Explore will upload your photos directly to the Eye-Fi Service through your home Wi-Fi network. We'll deliver them to your photo site and then deliver them to your computer the next time you turn it on. The Eye-Fi Service is secure and encrypted, so your data and photos are safe and private.Eye-Fi Share and Eye-Fi Explore include unlimited WebShare service. Upload and share all you want.", "title": "Eye-Fi Share 2 GB Wi-Fi SD Flash Memory Card EYE-FI-2GB (OLD VERSION)", "price": 74.0, "imUrl": "http://ecx.images-amazon.com/images/I/51cBxrk-q4L._SY300_.jpg", "related": {"also_viewed": ["B003DV4234", "B002UT42UI", "B001AD0TGG", "B000AEBR12", "B00CS4WPD6", "B004U5QR62"], "buy_after_viewing": ["B003PVGA1O", "B003DV4234", "B002UT42UI", "B001AD0TGG"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Memory Cards", "SD & SDHC Cards"]]}