{"asin": "B000MF7L5A", "description": "Amazon.com Product Description Now you can go from North America to Europe without loading any more maps with the Garmin's transatlantic n&uuml;vi 370 Personal Travel Assistant. This pocket-sized personal travel assistant comes with built-in street maps for both continents, making traveling abroad as easy as getting off the plane. The n&uuml;vi 370 is loaded with convenience features such as a travel kit and hands-free calling, on top of which it provides you with even more maps and an integrated traffic receiver.The n&uuml;vi 370 comes with built-in street maps for both continents, making traveling abroad so easy.See side view.Keep track of all of your speed and timed information on one single screen.The 370's travel kit menu delivers access to audio books, pictures, and more.Despite being loaded with features, the n&uuml;vi 370 still allows you to navigate with ease. This unit comes ready to go right out of the box with preloaded NavTeq City Navigator NT street maps for both North America and Europe, and includes a hefty points of interest (POIs) database with hotels, restaurants, fuel stops, ATMs and more. Simply touch the super-bright, sunlight-readable color screen to enter a destination, and the 370 takes you there with either 2D or 3D maps and turn-by-turn voice directions. This navigator voice even announces the name of exits and streets so you never have to take your eyes off the road, and can concentrate on your driving to keep yourself and your loved ones safe. In addition, the 370 accepts custom points of interest (POIs), such as school zones and safety cameras, and lets you set proximity alerts to warn you of upcoming POIs that require your special consideration such as speed zones and safety cameras.Speaking of keeping you safe, the n&uuml;vi 370 lets you make hands-free calls so you can talk freely during your worry-free driving. By integrating Bluetooth wireless technology with a built-in microphone and speaker, you can pair your n&uuml;vi with any compatible Bluetooth phone and talk hands-free while staying focused on the road. You no longer have to fumble with your phone's handset to answer a call or dial a number, just tap the 370's screen and you're instantly connected. And with 1-touch dialing for your POIs, you can quickly and conveniently call ahead to make reservations or get needed information.You can also avoid tie-ups and steer clear of traffic with the n&uuml;vi 370's integrated FM TMC traffic receiver. This unit allows you to receive alerts about road construction and traffic problems that lie ahead on your route. Simply touch the n&uuml;vi's screen to view traffic details or change your route so you can detour around the problem area. All of which can be customized with configurable vehicle icons that let you choose individual car-shaped icons in a variety of colors that show your position on the map.In additional to all this functionality, the n&uuml;vi 370 includes many must-have entertainment and travel tools such as an MP3 player, an audio book player (subscription to Audible.com required), and a JPEG picture viewer so you can take your favorite music and pictures with you wherever you go. This unit also features a world travel clock with time zones, a currency converter, a measurement converter, and a calculator so that wherever you travel it will be easy to know what you are getting and keep track of your costs. The MP3 player lets you browse music by artist, album, and/or song, while the optional audio books may be purchased from Audible.com which features over 70,000 hours of audio programs. What's more, the n&uuml;vi 370 allows further customization via optional software such as travel guide, savings programs and language translation on plug-and-play SD cards for all your travel needs.The Garmin n&uuml;vi 370 comes with a built-in, high-sensitivity, WAAS-enabled GPS receiver, and lets you view and operate it via its bright, LCD TFT touch-screen display that measures 2.8 x 2.1 inches (W x H) and has a resolution of 320 x 240 pixels with 64,000 colors and a white backlight. As a whole, the n&uuml;vi 370 measures 3.87 x 2.91 x 0.87 inches (W x H x D), and weighs only 5.1 ounces for easy portability. This unit provides you with from four to eight hours of battery life (depending on use) via its rechargeable lithium-ion battery, and comes with Garmin Lock, which is an anti-theft feature to protect your investment. While you can add software via the SD card slot, the Garmin n&uuml;vi 370 also lets you interface via high-speed USB for loading data, though users should note that, like most USB mass storage devices, this unit is not compatible with Windows 95, Windows 98 or Windows Me.What's in the BoxGarmin n&uuml;vi 370, City Navigator NT maps for North America and Europe (preloaded, full coverage), FM traffic receiver, vehicle suction cup mount, AC charger, vehicle power cable, dashboard disk, USB cable, carrying case, quick reference guide and, owner's manual.Which n&uuml;vi is Best for You?Note: All n&uuml;vis come with detailed NAVTEQ maps containing more than 6 million pre-loaded point of interest locations.", "title": "Garmin n&uuml;vi 370 3.5-Inch Bluetooth Portable GPS Navigator", "price": 179.99, "imUrl": "http://ecx.images-amazon.com/images/I/51EB4GR3fgL._SX300_.jpg", "related": {"also_viewed": ["B00BHSTWOY", "B001U0O7RQ", "B0055XNWJI", "B005DIBH6A", "B005DIBH4M", "B00AXX0I7Y", "B002ACBNXO", "B00407238Q", "B000MNA3BG", "B008JWSTC2", "B00BHT7AT2", "B00AXX0JNW", "B002X8I27U", "B000F007K8", "B001UO0RKS", "B000BS2V44", "B00AD5EOAO", "B00AXX0JP0", "B0057ODG6Y", "B00GD7DCW2", "B000OH63MI", "B004W1GQ92", "B003ZX8B3W", "B001U0O7QC", "B0015F1L7A", "B00AXX0IEC", "B004MYFTDI", "B001ELJ9QK", "B003B3P2CO", "B00AXZY42W", "B003B3P2D8", "B00AXZWG8Q", "B000WJ67UQ", "B004MYFTEW", "B00AXX0I88", "B001ELJ9P6", "B001U0O7PS", "B006OJZNEE", "B003ZX8AZQ", "B001U0O7QW", "B005DIBHCE", "B001PKTDMU"], "buy_after_viewing": ["B00BHSTWOY", "B001U0O7RQ", "B004I5BUSO", "B002OL2MU4"]}, "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]]}