{"asin": "B009X2OS5Y", "related": {"also_viewed": ["B003II3FD0", "B007F0IMK8", "B000YB862E", "B009X2OS72", "B00E3CWVGC", "B00DCZL4K0", "B001GCU0MY", "B006O130X8", "B00551BP3K", "B008429624", "B0038YWLCU", "B00E3EU58Q", "B00A2BW8HU", "B00E5IS74O", "B009QNKXTU", "B004VS9G2U", "B00E3FD8LQ", "B005UKMQD4", "B001BPE3KQ", "B007SF7HEM", "B007HOB466", "B0019I26IQ", "B005V7D1LW", "B00HLCG8G0", "B007OWQGTG", "B005OAU24K", "B00803N2AY", "B002UA2H9A", "B000ASTKWQ", "B008LQTFJW", "B006KYBN4M", "B00GMQPHEK", "B0055P4WJ0", "B002FGTWOC", "B00IV4EHVU", "B002UPRCMC", "B006TN1F06", "B007T86TYW", "B000KFRSG4", "B00A3DIXP8", "B008S8DUDK", "B0077M2958", "B0002J2TLC", "B00CYSX148", "B00139XOCI", "B00G4G6W1U", "B00BOGP6DK", "B00139W0XM", "B00CXDMCK8", "B00BOGOT4M", "B009GHYMB6", "B00DRGQETA", "B009TBMPJA", "B00EYTNF28", "B00ISGLTD0", "B00500U78U", "B00BU91JD2", "B00A2WJ4AI"], "bought_together": ["B003II3FD0"], "buy_after_viewing": ["B003II3FD0", "B007F0IMK8", "B0073Z49AM", "B000YB862E"]}, "title": "Cinetics CineSkates Pro Tripod Camera Dolly", "price": 149.95, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/318D%2BstdaxL._SX300_.jpg", "brand": "Cinetics", "categories": [["Electronics", "Camera & Photo", "Video", "Camera Supports & Stabilizers", "Camera Cine Dollies"]], "description": "Includes CineSkates Pro  dolly only. A tripod head is required. Purchase a tripod head (Example:  Joby Ballhead X) separately if you do not already own one. Clamps are  included to attach GorillaPod Focus tripod directly to CineSkates wheels  or on top of the SkatePlate frame. Purchase the GorillaPod Focus tripod  separately to expand the functionality of CineSkates Pro.The  CineSkates Pro is a combination of Cinetics' first product, CineSkates,  and the SkatePlate frame. CineSkates are a set of three wheels that  enable filmmakers to capture fluid, moving video footage without lugging  heavy gear. CineSkates caused a sensation with filmmakers in a 2011  Kickstarter campaign, which launched the MIT student project into  Cinetics, one of the fastest growing brands in photo video. With help  from customer feedback, the Cinetics team built SkatePlate. SkatePlate  has a retractable quick-set-up design. Simply fold the three legs out,  tighten the knobs and SkatePlate locks in to a sturdy configuration.  SkatePlate has a standard 1/4-20 inch mounting thread to mount your  favorite tripod head. CineSkates and SkatePlate combine to form  CineSkates Pro, a revolutionary camera dolly.Key CineSkates Pro features:&bull; High quality components enable an incredibly smooth roll&bull; Wheels can be positioned to make linear or arcing moves&bull; Markings are printed on top of the dolly and which enable quick setup&bull; Ruler marks on the wheels enable precise movements for timelapse and stop motion&bull; Arms lock into several different configurations and fold up for portable storage&bull; Durable ballistic nylon travel bag is included&bull; Clamps are included to attach the GorillaPod Focus tripod directly to the wheels or on top of the SkatePlate frame&bull;  The system is modular. The CineSkates wheels detach via the Cinetics  Connect quick connect and other Cinetics components can be attached,  like CineSquid suction cups, CineMoco motor control, or V wheels."}