{"asin": "B001PNNXGO", "description": "The Kaito AN200 tunable indoor AM loop antenna can dramatically improve the reception on AM (Medium Wave) stations throughout the entire AM broadcasting band. This AM Antenna enhances reception as well as adds clarity to the ferrite AM antennas that are included with all home stereo receivers and portable radios. The AN200's loop design offers you the reception that normally would only be achieved with a very long wire hooked up directly to your radio. With the AN200, it will work on all portable radios without wires attached.\n\nThe Kaito AN200 features a built-in tuning dial that allows precision tuning to the appropriate station and the selectivity to block out unwanted stations and noise; which without the antenna would crowd or \"bleed\" into the desired signal. The antenna can also be adjusted by physically turning the loop in the direction of the station's broadcasting and pointing it directly at the station. One of the best features of this antenna is the possibilities of using selective tuning, loop adjustment and radio dialing. The AN200 Loop Antenna will give you an added dimension to your AM radio by giving you better reception, clearer sound, better clarity of the stations you already get and enhancement of stations that would otherwise be drowned out.\n\nThe Kaito AN200 AM Medium Wave Loop Antenna is a passive (NO power requirements) radiant device that works by either placing it next to the portable radio's internal AM rod antenna or by connecting it to larger desktop radios that have AM antenna terminals by using the included 1/8\" to bare wire cable.", "title": "Kaito AN-200 Tunable Passive AM Antenna", "price": 25.0, "imUrl": "http://ecx.images-amazon.com/images/I/41U7qlbKhvL._SY300_.jpg", "related": {"also_bought": ["B000023VW2", "0955548152", "B000H7NVX4", "B0006OCEFY", "B004H9C4JK", "B000Q5APCC", "B004QJKO52", "B0014T7W8Y", "B00GJ51NVA", "B000M9EREE", "B004P5XW06", "B000EIOQBM", "B001BGGD8A", "B003XU76PQ", "B0002ZPIOQ", "B00066Z9XG", "0955548160", "B004H912FC", "B000069EUW", "B00F05ZPS2", "B00006IS4X", "B0009ZAA4M", "B001HKM1HM", "B004Q21I4U", "B005GTO0CY", "B000VVJRDE", "B00120WRSU", "B005GTO0DI", "B008MPKAPK", "B0009ZAA42", "0945053592", "B003SVGJ9Y", "B00009ZY5C", "1878707116", "B00ET8FP68", "B007WL5DB6", "B000668BKY", "B00005T3EZ", "0945053789", "B0051PMWY6", "B0081IKTN6", "B00C5QHO3I", "B00BKRH45G", "B0055Q5FIQ", "B008NG36UY", "B001N7X67I", "B004FV4ND0", "B003KWKUO6", "B00BSYCZZ0", "B00008NJEP", "B0084CCDWE", "B000NQ9E4Y", "B00408K36Y", "B0065QGQN8", "B003QHXZM4", "B001JT1KEG", "B00G6TG5YE", "B0016OEV7C", "B003XQLUGQ", "B00020S7XK", "B0085H18W4", "0872597075", "B00BY3XOSW", "B00CKG6T9I", "B006SLV25C", "B00006LVEU", "B001JT3J7W", "B008RZJHJU"], "bought_together": ["B000023VW2", "B004H9C4JK"], "buy_after_viewing": ["B000069EUW", "B003SVGJ9Y", "B000023VW2", "B007WL5DB6"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Antennas", "Radio Antennas"]]}