{"asin": "B003L77Y5I", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Loaded with first-of-its-kind features and high-end capabilities, the Canon PowerShot SD4000 IS Digital ELPH gives ELPH lovers all new reasons to step up. Never before has Canon equipped an ELPH with a back-illuminated CMOS sensor-driven HS System or an f/2.0 lens--both of which deliver incredible images in low light. And shooting action or sporting events has never been so fun, with High-Speed Burst mode and the Super Slow Motion Movie function to mix things up.You'll control shots like a pro with Aperture- and Shutter- priority modes, and play your 720p HD movies effortlessly on your HDTV.  All this from a super-slim style icon--what more could you ask?PowerShot SD4000 IS Highlights10.0-megapixel CMOS sensor combined with the DIGIC 4 Image Processor create the Canon HS SystemThe Canon HS System takes the frustration out of low light shooting. The system delivers clear, blur-free shots with all the ambiance intact, and frees you from the sometimes unwanted effects of using the flash. Beautiful low light shots are possible at both low and high ISO speeds, and the dynamic range is expanded to retain maximum detail in highlight and shadow areas.The system is the result of two technologies brought together in a compact PowerShot. The first is the 10.0-megapixel CMOS sensor, which positions the light-receiving surface for optimal light reception. More light means clearer, blur-free images with plenty of detail and nuance, even in dark areas. Working together with the CMOS sensor to deliver the HS System is Canon's advanced DIGIC 4 Image Processor, which actively reduces noise and delivers high speed image processing.Bright f/2.0 lens, great for shooting in low light conditions or using a shallow depth-of-fieldThe Canon PowerShot SD4000 IS Digital ELPH sports an f/2.0 aperture, perfect for creating enticing portraits, by drawing attention to the face and blurring the background with its impressively shallow depth-of-field. The Macro setting lets you get even closer. The large aperture also does more. It lets you capture more nuances in low light shooting by using more of the available light. You'll be ready for anything with a lens aperture larger than even many professional sizes.720p HD movie shooting capability plus HDMI outputThe Canon PowerShot SD4000 IS Digital ELPH lets you record video in beautiful 720p high definition (1280 x 720 pixels). The camera also makes it easy to enjoy HD movies (and still photos) on your HDTV with a mini-HDMI connector for direct connection to a high definition TV monitor. You'll enjoy the HD experience with no degradation of image or audio in the signal, plus the ability to display up to 130 still images at once.Super Slow Motion Movie function and High-Speed Burst modeGive your movies a whole new look with the Super Slow Motion Movie function. Whether you're going for a dreamy, creative slant when documenting family moments, or making a highlight film of your kids' greatest sports plays, you'll love the high quality capture of this all-new feature. The camera shoots your clips at high speed (approx. 240fps) and plays them back at 30fps for the inimitable super slow motion feeling you'll love.High-Speed Burst is exactly what you need when you're trying to capture the best possible shot within a moment of fast-moving action. In High-Speed Burst mode, the camera automatically shoots continuously at high speed (approx. 8.4fps)*while you simply hold down the shutter. The mode lets you shoot sporting events, kids in motion, wildlife and any situation with unpredictable movement, then simply choose the best shots captured.* Depending on the shooting conditions, camera settings and the zoom position, the shooting speed may slow down. As the number of images increases, the shooting interval may take longer.Scene modes such as Miniature Effect and Fisheye Effect, plus Low Light modeThe Canon PowerShot SD4000 IS Digital ELPH offers creative effects similar to those found in certain professional lenses. Miniature Effect creates an illusion where very large objects appear in miniature proportions. Turn soaring cityscapes into a scene in seemingly dollhouse-like proportions.Fisheye Effect uses barrel distortion to warp the image around the center, giving a distinctive curvature effect to the photo. The curvilinear images produced by Fisheye Effect can suggest the curve of the Earth, the inside of a dome, or the image you see through the peephole of a door.With an ISO of 400 - 6400, the Low Light mode takes the Canon PowerShot SD4000 IS Digital ELPH where no ELPH-Series has gone before - into the shadows! Now even scenes notorious for having insufficient light, such as those lit by candles, fire, or street lamp, come through in fantastic color and clarity, with less noise. You can keep the feel of the scene intact without adding additional light, so the result will be scenes with the visual accuracy, depth and clarity you expect from a Canon camera.Shooting ModesAdvanced presets for the best possible photos under certain conditions. With 23 Shooting Modes, you're ready for whatever shot comes your way.Shoot like a pro with Aperture- and Shutter-priority modesFor photography enthusiasts, the ability to control aperture and shutter speed is key. The Aperture- and Shutter-priority modes on the Canon PowerShot SD4000 IS Digital ELPH make it easy for anyone to take extra control over the look and feel of images captured.In Aperture-priority mode, you set the aperture and the camera automatically selects an appropriate shutter speed. This lets you create sharp subjects with beautifully blurred backgrounds, and landscapes with foreground, middle ground and background all in focus.Shutter-priority mode lets you choose a shutter speed while the camera automatically selects the aperture. Higher shutter speeds are great for catching stop-action shots of moving subjects, while lower shutter speeds can create atmospheric blur.What's in the BoxPowerShot SD4000 IS Digital ELPH BodyLithium-ion Battery Pack NB-6LBattery Charger CB-2LYWrist Strap WS-DC7AV Cable AVC-DC400STUSB Interface Cable IFC-400PCUDigital Camera Solution CD-ROM", "title": "Canon PowerShot SD4000IS 10 MP CMOS Digital Camera with 3.8x Optical Zoom and f/2.0 Lens (Silver)", "price": 9.99, "salesRank": {"Camera &amp; Photo": 7283}, "imUrl": "http://ecx.images-amazon.com/images/I/41mup8gHYqL._SX300_.jpg", "related": {"also_viewed": ["B0075T7NW2", "B0035FZJJ4", "B006UMM1AY", "B004J3VAYO", "B0075SUJBA", "B004J3V8UU", "B0075SUJ4W", "B0035FZJKI", "B006UMM15O", "B00HLDFPA4", "B00B5HE3AK", "B0075SUH5S", "B00AWYN0BU", "B00B5HE1SY", "B006UMM1J0", "B00I58LVKC", "B00HLDFNKQ", "B00B5HE32I", "B00B5HE3YG", "B00B5HE3UU", "B006UMM1F4", "B0075SUKBO", "B004J3V7RO", "B00B5HE2UG", "B0075SUGQI", "B0076W0LNQ", "B0075SUJH4", "B0075SUFLE", "B00466PH2K", "B00CBYMWNQ", "B004J3X5IS", "B004J41SOU", "B00I58LZRG", "B003ZSHNF4", "B00B5HE3IW", "B00I58LZ80", "B004J3V828", "B00BW6LTG0", "B00B5HE2MO", "B0075SUK6O", "B001SER46K", "B00B5HE3NW", "B00B5HE45E", "B005MTME3U", "B004J41T7Q", "B0075SUHA8", "B000ENPDSW", "B005I6DUU8", "B00I58LX0A", "B00EFILNV8", "B00427ZLRO", "B006UMM1UO", "B00I58LWBK", "B0075SUK14"], "buy_after_viewing": ["B003VNKNEQ", "B003VNKNF0", "B009B0MYSQ", "B0075T7NW2"]}}