{"asin": "B00FISD9DO", "description": "Introducing the latest Slim Premium Litchi Grain Multifunction Leather Acase iPad Air Case is here- This is the best case you have ever had with your lovely Apple iPad Air. You buy a Apple iPad Air but you can`t find a suitable case for\nit. Acase knows what you need!Acase spends countless hours to ensure that this new design case is totally fit for Apple iPad Air.The Acase multifunction Litchi Grain leather case for Apple iPad Air is perfect for daily usages and travels! The exterior of this case is made of litchi grain leather, which is light-weight and can provide the Apple Mini a total protection from scratches and small impacts. The microfiber protect your Apple iPad Air without any scratches and no residues falling on to the screen. In the mean time you could still enjoy it`s perfectly thinness and nice look.This perfectly design give your iPad Air a snug fit without adding any bulk to it, which is a great match with the slender design of the Apple iPad Air.The grooves on the microfiber part of the case offer the Apple iPad Air multi viewing angles, now you are able to type an email or watch a movie without holding the Apple iPad Air all the time!.You can still access all of the Apple 's iPad Air features! You can put your Apple iPad into any other bag or case without having to worry about not fitting! The choice solution in Apple iPad Air mobile protection!Try it - from the best Tablet Case manufacture to add additional protector to your newest Apple iPad Air", "title": "Acase iPad Air Case / Cover (Apple iPad Air 16gb/32gb/64gb/128gb 10.1 inch Tablet) with Built-in Stand - Support Smart Cover Function for iPad Air (Black)", "price": 21.95, "imUrl": "http://ecx.images-amazon.com/images/I/51hgrN85yUL._SY300_.jpg", "related": {"also_bought": ["B009XCCC52", "B00EL94Z4I", "B00GBDA0Q4", "B00FDXLSL4", "B00BY36L1E", "B009AO9WAQ", "B00EX9J9ME", "B00G3IQ18I", "B00BISWJYS", "B00G3J8EZ0", "B00G1YKHH0", "B00FHBHN2A", "B00G2XSL3C", "B00EL93M3S", "B00CK9DARO", "B00G4SA1FG", "B00B67O71O", "B00F9SP9BS", "B004UDCXP8", "B00G43ZVYC", "B00FEW8FLU", "B00BG34UMY", "B00E44B18I", "B0052V6VAU", "B008MOHLVC", "B00G3J8EDM", "B00DQTBZCO", "B00FPRHUHY"], "bought_together": ["B00EL94Z4I", "B00CK9DARO"], "buy_after_viewing": ["B00CK9DARO", "B00EL94Z4I", "B00GBDA0Q4", "B00G3TUL4C"]}, "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Cases & Sleeves", "Cases"]]}