{"asin": "B001DO3NEW", "description": "When it comes to music and rhythm games,Wii Musicstands in a class of its own. Unlike other music games, which penalize players if they don't play perfectly,Wii Musicis a musical playground where there are no mistakes. Here anyone can pick up and master the huge array of instruments available, through simple motions like strumming and drumming. Musicians in your band jam by simply playing their instruments to the beat of a song or by improvising to their heart's content. Play faster. Play slower. Skip a beat, or throw in 10 more. No matter what you do,Wii Musicautomatically transforms your improv stylings into great music.Your music, your waySimple pickup and playability.View larger.Easy controls and learning curve.View larger.Huge array of diverse instruments.View larger.Make music by yourself.View larger.Or with up to 3 friends.View larger.Gameplay: Getting Your Band TogetherInWii Musicevery band has six members: Two play the main melody, two cover the percussion beats, one covers the bass groove and one uses the song's chords to support the melody. As a band, the six members often play their special parts at the same time, though each player can jam however and whenever he or she wants. Play all at once. Take turns in the spotlight. Pair up in creative ways throughout the song. You can bring the band to life by yourself, playing one part at a time-or with up to four players. See game mode below:Solo Play: When you play by yourself, you can add one part at a time to arrange the whole song exactly how you want. The Tutes are on hand to back up your band in any parts you need filled.Multiplayer: When in a band with friends, up to four people can be band members.Wii Friends: Using WiiConnect24, you can send your jam videos to Wii Friends who own Wii Music. They can then watch your performance, modify it to their liking and send their jam videos back to you.Tutes: Your Own Private Back-up BandWhen not playing with friends, you can invite jam masters known as Tutes to play with you. They'll join a session playing an instrument that each thinks is strong for a specific song. You can simply enjoy the musical camaraderie, or pick up instrument tips by watching them jam. If you choose to watch, the Tutes will show you lots of techniques for many of these instruments, then ask you to follow their examples. They'll start with the simplest techniques, then as you master each one, show you even more nuanced ones.Key Game Features:Easy to Play Improv Jams- All members of your band jam by simply playing their instruments to the beat of a song or by improvising to their heart's content. Play faster. Play slower. Skip a beat, or throw in 10 more.Wii Musicchallenges you to transform your improv stylings into great music. There are no mistakes and no game scores-just playing for the pure joy of playing.Wii Controls Immerse You in the Music- You can play most of the 60-plus instruments inWii Musicusing simple motions with the Wii Remote and Nunchuk controllers. Strum to play guitar, banjo and sitar. Drum to play jazz drums, congas and snare drums. Hammer away to play piano, vibraphone and marimba. Unlike most music games,Wii Musicdoesn't make you use many complex buttons. You only need to imitate playing the instrument.Virtually Endless Ways to Make Music- You choose the song and instruments and decide whether to blaze through a rock take on classical songs, put a jazzy spin on folk tunes or transform Nintendo classics like theSuper Mario Bros.theme into Latin-flavored numbers. The song list is only a takeoff point-it's how you improvise with the songs that matters.Share Your Band Jams With Friends- They'll see your Mii band members, your players' improv styles and your instrument selections. They can watch your recordings, or play over parts of your song, then send their modified recording back to you. So you can send improv jams back and forth over WiiConnect24, changing them again and again.60+ InstrumentsYou can play most of the 60-plus instruments inWii Musicusing simple motions with the Wii Remote and Nunchuk controllers. Strum to play guitar, banjo and sitar. Drum to play jazz drums, congas and marching drums. Hammer away to play piano, vibraphone and marimba. Unlike most music games, Wii Music doesn't make you use complex buttons. You only need to imitate playing the instrument.Wii Musicoffers virtually endless ways to make music.Fun Beyond the JamDesigned with classic Wii gameplay in mind,Wii Musicincludes many other modes and play options besides the main band jams, including several musical games and an enhanced video playback mode for recorded jams.Videos Mode: Watch your jam videos in an enhanced playback mode that brings your jams to life with fun environmental effects and dramatic camera angles.Mii Maestro: By waving the Wii Remote like a conductor's baton in this mini-game, you'll lead a Mii orchestra through orchestrated songs, such as TheLegend of Zeldatheme. Make them play quickly, slowly, strongly or gently-the orchestra is at your command.Handbell Harmony: In this musical mini-game, you'll play in a handbell ensemble by swinging your Wii Remote and Nunchuk. Everyone on the team has a job to do: play one of your notes only when the tune demands it.Pitch Perfect: How good is your musical ear? In this whimsical musical quiz, you'll have to solve challenges, like putting note-playing Miis in order from lowest to highest pitch.Drum Mode: In the one mode that uses the Wii Balance Board accessory (sold withWii Fit), you can feel what it's like to play a real-life drum set. You'll use the Wii Remote and Nunchuk as drumsticks, and place both feet on the Wii Balance Board-which work as virtual pedals for the bass drum and hi-hat cymbal.", "price": 32.76, "imUrl": "http://ecx.images-amazon.com/images/I/51mThLJ0Y8L._SY300_.jpg", "related": {"also_bought": ["B0056C2LIG", "B0016OVB2U", "B003LDKIQ4", "B0013E9HP6", "B003O6DZSQ", "B000ME3M5O", "B000OAO188", "B000UUWHS8", "B000QD7BBM", "B000WINB56", "B002K9VIAU", "B004W1IX1G", "B0015HZLUQ", "B003S2SQCQ", "B001EAWM56", "B001TOMQYO", "B0026IUSXI", "B006L1FAK2", "B002KJ9XE8", "B001GIUWX0", "B0094X2066", "B001C0L7O0", "B002ACFY9S", "B00149IL9I", "B0058CA4S8", "B00D7UHT0E", "B000R3BNE2", "B008QLUSD4", "B00KWFY04A", "B0094X1ZXU", "B0058SHMXM", "B000NKRJAG", "B001QL8GCG", "B007MM9E42", "B004WLRR4K", "B002CZ835U", "B000SFK0SO", "B001B1W3KM", "B000YDIYFG", "B003QPEKHA", "B000KUHR8S", "B003ZCH7DI", "B000R39IW6", "B000JV78XC", "B003QWXYKW", "B000ME252U", "B005EYG6EQ", "B0088I8M10", "B004XV9EWW", "B000R3BNDI", "B002BS47L2", "B001C0L7PY", "B003ZHMMEM", "B002CZ7P04", "B001UWGEZM", "B003TK1HSM", "B0011V2HR6", "B002BRZ9G0", "B002I0EOSE", "B001COQW14", "B00139U8TU", "B002DC8GUY", "B003P9BIMW", "B001PO2BJI", "B000QAXZZ6", "B000FQ9YB0", "B003WY86LQ", "B0017Q4DGI", "B00434FED2", "B002BUQFQA", "B001C58T46", "B002MQLPJ0", "B000XZZ8C2", "B002BSA388", "B002BUUMNC", "B003S2JI6O", "B004QSXOMS", "B003S2JI82", "B000FQBWAG", "B00DLL8P98", "B002GEA4U4", "B003JETPHS", "B002I0GEXM", "B0053BG26C", "B0019R4VD0", "B005EZ5GXC", "B0029ZUPW2", "B001F85SSU", "B007YZ5QP8", "B001AIL4ZG", "B001APM444", "B005LBDOLK"], "bought_together": ["B0056C2LIG", "B003LDKIQ4"], "buy_after_viewing": ["B003LDKIQ4", "B0013E9HP6", "B0017Q4DGI", "B0016OVB2U"]}, "salesRank": {"Video Games": 3201}, "categories": [["Video Games", "Kids & Family", "Wii", "Games"], ["Video Games", "Wii", "Games"]]}