{"asin": "B000UHE8Y2", "description": "Tune for the way you play.The G9 Laser Mouse is built with advanced customization technology so you can tune  your mouse for your playing style.&nbsp; It  comes with two interchangeable grips from which to choose for your preferred  comfort.&nbsp; A 3200 dpi full-speed USB laser  engine with adjustable dpi, as well as onboard memory that stores up to 5 mouse  setting profiles, give you the most advanced performance.&nbsp; For more control, the G9&rsquo;s weight tuning  system allows you to add up to 28 grams of additional weight, while the  exclusive MicroGear&trade; Scroll Wheel lets you switch between modes --  click-to-click and hyper-fast scrolling.&nbsp;  Finally, custom-color LEDs let you customize the G9 look for a mouse  that&rsquo;s all your own.Features&nbsp;&nbsp;&nbsp;Interchangeable GripsThe G9 comes with Wide Load and Precision grips to get a fit and feel that&rsquo;s best  for the way you play. Wide Load's soft satin feel and fuller shape offer  extra comfort. Precision Grip's DryGrip technology plus compact shape  give the utmost in fingertip control.&nbsp;Ultra Gaming-Grade PrecisionGet  uncompromised speed and accuracy from a high-performance Gaming-Grade Laser  Engine (adjustable 200 dpi - 3200 dpi) and  Full-Speed USB (up to 1000  reports/second).&nbsp;Plug-and-Play PerformanceThe G9 performs wherever you go, even without software. Keep up to 5 mouse setting profiles (including keyboard  macros, dpi settings, and LED color) stored directly in on-board memory.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Weight Tuning SystemPrefer  a heavier or lighter mouse? Use the weight cartridge and up to 28 grams of  metal weights to customize your G9 for a personalized feel.&nbsp;Custom-Color LED DisplayThe G9's LED display lights up to show your mouse dpi and profile settings. Choose the color of your LEDs from hundreds of options on a broad color spectrum.&nbsp;MicroGear&trade; Precision Scroll WheelLogitech's exclusive MicroGear&trade; Scroll Wheel's precise click-to-click scrolling is perfect for weapon selection. Or switch modes for frictionless Hyper-Fast scrolling.&nbsp;System RequirementsWindows&reg; XP, Windows Vista&trade;USB portTechnical SpecificationsTrackingResolution: 200&ndash;3200 dpi (user-selectable)Image processing: 6.4 megapixels/secondMaximum acceleration: 20 GMaximum speed: 45&ndash;65 inches/second (depending on surface)ResponsivenessUSB data format: 16 bits/axisUSB report rate: Up to 1000 reports/secondSleep mode: DisabledGlideDynamic coefficient of friction (&#61549;k): .09**Static coefficient of friction (&#61549;s): .14**Tuning weight: Up to 28 gramsDurabilityMouse buttons (left/right): 8 million clicksMouse feet: 250 kilometersPackage ContentsLogitech&reg; G9 Laser MouseTwo custom grips (Wide Load and Precision)Adjustable weight cartridgeTuning weights and caseUser guide3-year limited warranty", "title": "Logitech G9 Laser Mouse", "price": 182.0, "imUrl": "http://ecx.images-amazon.com/images/I/316WaFTgd0L._SX300_.jpg", "related": {"also_viewed": ["B001NTFATI", "B003TG75EG", "B00CJD4HD2", "B00BFOEY3Y", "B0034XRDUA", "B002J9GDXI", "B005S0KHIC", "B00IRHE892", "B0007Z1M50", "B000AY5Y5W", "B000ODN7VM", "B0055QZ216", "B005EWB3AU", "B000HCT12O", "B002HWRJBM", "B003VAM32E", "B00E4MQODC", "B00AAS888S", "B003NR57BY", "B00AAQRNQ8", "B005TEPB74", "B000GP844S", "B002Q4U5DK", "B00BCEK2LA", "B000UHE8YM", "B002HWRJBC", "B002B3YCQM", "B000TTQFIS", "B009DYOPK0", "B001DWK4NC", "B004RJJMBI", "B007MPVRQC", "B00ARD5410", "B0098W4ZD4", "B005QUQP76", "B00BCEK2LK", "B0095D1CM8", "B00I8P5G0S", "B00B0TXEEY", "B00GU8W5AE", "B00A79DK6U", "B0086UK7IQ", "B003ZMF26W", "B005KSAHZU", "B00H7MABE4", "B00EWEHI5K", "B00GU4F4OM", "B00C9R48A0", "B00AAS88K6", "B00A79DJMK", "B008OQTQSO", "B003DKJ44C", "B00CDINUTK", "B009JZ04BC", "B007AP8RJ4", "B0072NZ292"], "buy_after_viewing": ["B003TG75EG", "B001NTFATI", "B000UEZ36W", "B00CJD4HD2"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Mice"]]}