{"asin": "B001V7XPSA", "description": "With the new LaCie iamaKey, inventive storage meets data protection. The key-shaped design is functional and memorable, and the protection that the LaCie iamaKey offers makes it extremely reliable. Best of all, you can fit an enormous amount of data in a small flash drive. With its eye-catching design, the iamaKey certainly stands out, but its connector (Gold SIP) is both water- and scratch-resistant, making it one of the most durable and thinnest USB keys on the market. Protective edges on the connectors ensure that you will always insert the LaCie iamaKey properly, keeping it usable and safe. With the universal Hi-Speed USB 2.0 interface, iamaKey can be used with both PC and Macs. Hi-Speed USB 2.0 not only offers universal compatibility and cross-platform convenience, but features a hot-pluggable connection and high-speed transfer rates, and is Windows ReadyBoost compatible. Best of all, the iamaKey is backward-compatible with USB 1.1, so you can use it on any computer. A product of the 5.5 Designers firm, the LaCie iamaKey fits in your pocket, and on your keychain, letting you take your data with you wherever you go. Another new collectible product produced in conjunction with 5.5 Designers, the iamaKey is a usable, tough USB flash drive, but with a well-developed sense of fun. Minimum System Requirements: Windows 2000, Windows XP, or Windows Vista, Mac OS X v10.3.5 or higher, Linux-based system. Box Contents: LaCie iamakey and cap.", "title": "LaCie iamaKey 8 GB USB 2.0 Flash Drive 130870", "price": 27.2, "imUrl": "http://ecx.images-amazon.com/images/I/31otzAea3AL._SX300_.jpg", "related": {"also_viewed": ["B00A3U8L8U", "B00A3U7VVI", "B004D2AZ0Q", "B00A3U7IS4", "B006I04AIO", "B004FHI1E6", "B004D2AZ06", "B0038KR9EY", "B008SA63FA", "B00347UQ0U", "B008SA62QK", "B00FU4X9B8", "B0016IXEWG", "B000UVD8B2", "B00347URCC", "B001BAW7P4", "B00FU4X9DG", "B00AK9ZU24", "B00A5Y2AKO", "B003AM8S3G", "B00347L6I6", "B00DYQYITG", "B00A35WYBA", "B00A35X42S", "B00DYQYJ0E", "B002CYJN64", "B001UHTDS2", "B006II8ZFA", "B00A35X1BM", "B00DYQYJ3Q", "B0019UGCLG", "B00AK9ZUD8", "B001U5HKMK", "B000HPZG3E", "B001H1QH1W", "B00H3BETH4", "B000A5CLH0", "B005OP2JQ4", "B002JPEX52", "B0001EFSTI", "B0031DGU20", "B0026G8SCI", "B0023SNDYC", "B008KNLZ3U", "B00IUE7DGM", "B00E3PFDSM", "B00314WHW6"], "buy_after_viewing": ["B00A3U8L8U", "B00A3U7VVI", "B004D2AZ0Q", "B00A3U7IS4"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "USB Flash Drives"]]}