{"asin": "B001WM73P0", "categories": [["Electronics", "Portable Audio & Video", "CB & Two-Way Radios", "Two-Way Radios"]], "description": "Midway's GXT1050VP4 two-way, 22-channel radios are designed for GMRS (General Mobile Radio Service) operation, in a rugged, weatherproof package. With a range of up to 36 miles and Mossy Oak Breakup Camo finish, they're ideal for your next hunting trip. Features include privacy codes, direct/group calling, NOAA weather radio/alert/scan, silent operation, whisper function, SOS siren, and plenty more. Five animal call alerts are also included. Perfect for the outdoorsman.With a range of up to 36 miles, the GXT1050VP4s are perfect for most any adventure.Click to enlarge.Package includes Pair of radios, belt clips, desktop charger, rechargeable batteries, pair of mic headsets, AC wall adapter, and DC (vehicle) adapter.Click to enlarge.Measures 9.75 x 2.5 x 1.75 inches.GXT1050VP4 Features22 Channels PLUS 28 EXTRA CHANNELSClear, crisp communication with easy button access.Up to 36 Mile RangeLonger range communication in open areas with little or no obstruction.142 Privacy CodesGives you up to 5560 channel options to help you block other conversations.NOAA Weather Alert Radio with Weather ScanAutomatically locks on to your local weather channel and alerts you to severe weather.SOS SirenAllows you to send out distress/locator signals in an emergency situation.JIS4 WaterproofProtection against light rain or splashing water from all directions on the radio.WhisperAllows you to speak quietly and still be heard clearly by others.Group CallAllows you to make \"direct calls\" to other people within the group without alerting the entire group.eVOXHands-Free Operation (9 levels) with easy voice activation--no need for an external microphone.X-TRA TALK PowerMaximum allowed by law.Weather ScanEasily scans the active weather channel in your area.Direct CallAllows you to instantly contact one member of your party without alerting the others.10 Call AlertsDifferent call tones to notify you of incoming calls from your group.Five Animal Call AlertsIncludes Turkey, Duck, Crow, Cougar and Wolf alerts.Channel ScanAutomatically checks channels for activity.Dual WatchLets you monitor two channels.Vibrate AlertProvides silent page / call notification.Auto SquelchRemoves annoying background noise.Keypad LockLocks in your selected settings.MonitorChecks for any activity within your channel.HI/MED/LO Power SettingsLets you adjust transmit power & conserve battery life.Roger BeepIndicates call completion.Silent OperationTurns off all tones for quiet operation.Bright Backlit Display [LCD]Easy to read day or night.Keystroke Tones Audible tones with each key pressMic and Headphone JacksBattery Life ExtenderProvides longer battery life.Drop-in Charger CapableDual Power Options4 standard \"AA\" batteries (not included) or rechargeable batteries.Midland Radio CorporationMidland Radio Corporation is an international industry leader in wireless communications with affiliates in Italy, Bulgaria, Germany, Poland, Russia, Spain, and the United Kingdom, as well as representation in Latin America.  Midland develops high quality consumer products such as GMRS Two-Way Radios, Citizen Band (CB) Radios, Marine Radios, Bluetooth intercom systems, and All Hazards/Weather Alert Radios.  Also, as a leading manufacturer of Land Mobile Radios, Midland supplies professional grade analog and digital (P25 Technology) Portables, Mobiles and Base Stations/Repeaters for government entities such as forestry, public safety, and other commercial users.Known in the '70s primarily for CB radios and household electronics, Midland has grown with the times by producing innovative new communications products and by actively promoting public emergency preparedness.   Midland has manufactured quality Two-Way Radios for the last 50 years and is a market leader in several individual categories.What's in the BoxPair of radios, belt clips, desktop charger, rechargeable batteries, pair of mic headsets, AC wall adapter, DC (vehicle) adapter and owner's manual", "title": "Midland GXT1050VP4 36-Mile 50-Channel FRS/GMRS Two-Way Radio (Pair) (Camo)", "price": 69.18, "imUrl": "http://ecx.images-amazon.com/images/I/51cbnx%2BYigL._SY300_.jpg", "brand": "Midland", "related": {"also_bought": ["B000FCT04U", "B000CNAEEW", "B002CX0QLQ", "B000P0O12I", "B00CMNQ4GC", "B001DVOUHO", "B007B5ZL6K", "B00IKMJOZC", "B00CZA396U", "B000E0IOAE", "B000CMGJ0G", "B00DFTSJYM", "B00865N1L6", "B0002DHN6Y", "B0051F8PSI", "B008I65986", "B000CMGJ0Q", "B00008JOMD", "B003XL8P0A", "B00CR2G39G", "B00BHL61FO", "B003N9LQE4", "B00FHUBBWY", "B00EVWX7CG", "B009L6RDE0", "B00836HLMI", "B009AHXZY2", "B005FKT70O", "B0007TAJ0K", "B00168PIQ6", "B0083ZZJ1E", "B00C5IUM8U", "B006QF3TW4", "B003H2EODW", "B003RY9YIU", "B000P3WPXM", "B00DT04HWU", "B00HPEONSY", "B004T8G5H6", "B007B5ZKGG", "B00CHSM2FE", "B001QC78YM", "B00BSQ2QBG", "B004BOA6SM", "B004DT6TEK", "B00HZ4JLNG", "B00066Z9XG", "B00BZD4WXW", "B00ESH15JQ", "B00GP6XN3Y", "B00E965ZKQ", "B002UBPBTC", "B00CZA3N0M", "B007B5ZR4G", "B001UE6MJI", "B0026OOS60", "B00AB63708", "B000Q3LZYG", "B00F7FM2CM", "B0034A8C4O", "B004NC188O", "B00DTXIHCS", "B00BMU6CWW", "B00HBCEU1U", "B0083EV2JI", "B000P0PW76", "B00886XQHM", "B00DB6ZD84", "B00ADQOYR6", "B008RZJHJU", "B000YU3FQW", "B001BCNTHC", "B009QBFZP4", "B002UUSBMC", "B003ZDNIJY", "B004NNUEWY", "0882663917", "B0030IRKHK", "B0006GE5N6", "B001UE6MJ8", "B007C9P3PO", "B00FEL0JOW", "B0085PPSIQ", "B000XFHJW4", "B003IHV6YG", "0988872536", "B00LVDZDXY", "B0009TUEJE", "B00CMWCT26", "B001F0M5UW", "B005NGMJLY", "B0010O748Q", "B0012GMDC4", "B0030Z95B2", "B004AO6BUK", "B00DGK1O3S", "B002L9C7SQ"], "bought_together": ["B000FCT04U", "B000CNAEEW"], "buy_after_viewing": ["B001UE6MJ8", "B001UE6MIO", "B000FCT04U", "B000CNAEEW"]}}