{"asin": "B00005Y4Q1", "description": "Unreal II: The Awakeningreturns to the fascinating futuristic setting ofUnreal, first visited in 1998. Since then we've had to content ourselves with the excellentUnreal Tournamentmultiplayer combat series. For this first true sequel Epic Games hired Legend Entertainment, who made a name for themselves with theUnreal: Return to Na Paliexpansion pack and the woefully underratedWheel of Timegame (based on the books by Robert Jordan). The result is fun and frantic, if a bit too short-lived.Unreal II's best feature is its lush graphics engine. It's state of the art. All the locations, which range from bizarre alien worlds to those based on the filmAlien, exude dynamic realism. Human and alien characters are well-animated and rendered, but have a cartoonish exaggeration that clashes with the realism of the architecture. The designers were undoubtedly shooting for a comic-book look, which explains why the women look like blow-up dolls with bare midriffs and the men have hulking muscles. The monsters, too, ripple with strength and menace. This style will please some, but is less effective than the more realistic styles employed by similar titles--although at least the art direction is consistent throughout the game.Unrealcast you as a prisoner who--through both good and bad luck--was freed from confinement, but marooned on an alien world. He goes on to become a sort of messiah figure to the four-armed natives, while other, scarier, natives want to kill him. It ends with a cliffhanger that this game does nothing to resolve. Now, you play as a new character who works for the Terran Colonial Authority. You're a space marshal on the ship Atlantis. You and your buxom partner, who looks more like an exotic dancer than a police woman, have to solve problems in a game only tenuously connected with the originalUnreal.Core gameplay and mission design are good, but uninspired. Legend has taken a conservative, almost minimalist approach. They've made a solid shooter that takes full advantage of Epic's state-of-the-art graphics engine, but did nothing to set the shooter apart from the crowd. One hopes thatUnreal II: The Awakeningawakens Epic to the fact thatUnrealis a genuinely interesting franchise that deserves more.--Andrew S. BubPros:Gorgeous graphicsDecent gameplayCons:Amateurish if consistent art designToo short", "price": 10.99, "imUrl": "http://ecx.images-amazon.com/images/I/51XQY84QXVL._SY300_.jpg", "related": {"also_viewed": ["B000GPVUUS", "B000GRB4G6", "B00005QI89", "B0002VKQFG", "B00000DMAM", "B000065SQJ", "B00004KHDP", "B0000296ZD", "B0009Q1IE2", "B0002VRP82", "B00004YC3U", "B00001XDKO", "B0000690OR", "B000641ZCM", "B004UR8E84", "B0000CNUUP", "B002ZJPYHS", "B003P9C6EQ", "B000B63RSA", "B000O5DQ9S", "B0000A1VER", "B0000ZR85U", "B0000BVGOM", "B0001IMDAG", "B002GDRPYI", "B000BHQZAQ", "B000O5HZTK", "B001CC8UBG", "B001UWGDPS", "B007XVTR12", "B00503EAG2", "B00178630A", "B00CPKUV9I", "B004QRKWLA"], "buy_after_viewing": ["B000GPVUUS", "B0000ZR85U"]}, "salesRank": {"Video Games": 41398}, "categories": [["Video Games", "PC", "Games"]]}