{"asin": "B004BLIQ5K", "imUrl": "http://ecx.images-amazon.com/images/I/41gJ7bcCiTL._SY300_.jpg", "description": "Thin, portable and executive-inspired &ndash; the Verbatim Wallet Drive&#8482; looks like a billfold but holds something even more valuable&mdash; your photos and data. This portable hard drive offers high-end styling with a smooth, premium leather enclosure and contrast trim for the ultimate executive look. The ultra-compact size is perfect for sliding into your shirt pocket or briefcase. The Wallet Drive includes Turbo USB software and Nero BackItUp &#38; Burn software with full system backup and restore functions. The Wallet Drive boasts special bonuses from Norton Online Backup as well as a 7-year limited warranty.FeaturesDesign&mdash;Add a high-end leather enclosure to a super-small drive, and you have smart-looking, portable storage on-the-go!Warranty&mdash;7-year limited warranty! Verbatim manufactures our hard drives to meet our strict quality standards. We stand behind the quality of our products&mdash;and our warranty proves it!Compatibility&mdash;this portable Wallet Drive is compatible with both Windows and Mac operating systems and can be used with all USB ports.Nero BackItUp &#38; Burn Software&mdash;the Wallet Drive includes Nero BackItUp Software for Window only and offers full system backup and restore functions, the ability to schedule automatic backup by date/time and an encrypted backup option with password control.Bonus&mdash;Free 60-day trial of Norton Online Backup  (5GB).Tips for Getting StartedUsing the Wallet Drive is easy:Remove the Wallet Drive from the box.Connect the included USB cable to the drive and       then to your computer.The Wallet Drive will mount automatically and a       new icon appears on the desktop (Mac) or in My Computer (Windows).Now you&#39;re ready to transfer and protect your files.What&#39;s in the Box?1 Wallet Drive pre-loaded with Turbo USB       Software &#38; Nero BackItUp SoftwareUSB cable&nbsp;Quickstart GuideQuick links to Norton Online BackupAbout VerbatimVerbatim provides technology you can trust&mdash;we&#39;ve done so for  over 40 years. Our products include an impressive selection of removable  storage and computer peripherals, featuring a wide range of highly acclaimed  CD, DVD and Blu-ray&#174; media products. Verbatim also offers an array of lightning  fast desktop and portable hard drives, USB flash drives, memory cards, stylish,  feature-rich mice and keyboards and a broad range of replacement laser toner  cartridges. Buy Verbatim and you get innovation, security and reliability&mdash;and  that means peace of mind.", "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]], "title": "Verbatim Leather Wallet 640 GB 2.0 USB Portable Hard Drive 97312 (Black)"}