{"asin": "B0017D5Z40", "categories": [["Office Products", "Office & School Supplies", "Desk Accessories & Workspace Organizers", "Mouse Pads & Wrist Rests", "Mouse Pads"]], "description": "Get the most from your wireless or optical mouse with the 3M Precise Battery-Saving Mousing Surface. This ultra-thin pad uses 3M repositionable adhesive to stay securely positioned on flat surfaces and can be conveniently stored on the back of your notebook computer between uses. Utilizing a battery-saving design (see below), this mousing surface extends the battery life of wireless mice by up to 75 percent. This combination of effortless portability and exceptional functionality make this mousing surface an ideal solution for anyone computing on the go.Precise Battery-Saving Mousing Surface (MP200PS)At a Glance:Exceptionally thin designRepositionable adhesive keeps pad securely fastenedStores conveniently on the back of a notebook computerExtends battery life in wireless mice by up to 75 percentBacked by a limited one-year warrantyBattery saving surface extends battery life of wireless mice up to 75%.Sleek, Portable DesignWireless and optical mice need a proper surface to work on to reduce loss-of-signal and skipping errors. The 3M Precise Battery-Saving Mousing Surface is remarkably thin, measuring 8.1 by 9.2 inches wide by only .2 inches thick, and is specifically designed for wireless and optical mice.The bottom of the pad features 3M repositionable adhesive, allowing it to be securely fastened to and removed from flat surfaces again and again. Between uses, the pad can be conveniently stored on the back of your notebook computer. You can rest easy knowing that this mousing surface goes wherever your computer does, so you'll always have it when you need it.Extends Battery Life of Wireless MiceThis mousing surface features a unique battery-saving design that can extend the battery life of your wireless mouse by up to 75 percent. Lab testing showed that optical mice from leading manufacturers drew less current when used on this mousing surface rather than on typical desk-top surfaces and black-foam mousepads, significantly reducing battery consumption.The 3M Precise Battery-Saving Mousing Surface is backed by a limited one-year warranty.What's in the Box3M Precise Battery-Saving Mousing Surface and instructions.Comfort SolutionsMousing SurfacePrecise Battery Saving Mousing Surface (MP200PS)Foam Wrist RestsFoam Mouse Pad Wrist Rest (MW209MB)Foam Wrist Rest (WR209MB)Gel Wrist RestsGel Mouse Pad Wrist RestCompact size (MW309LE)Gel Wrist RestCompact Size (WR309LE)Gel Mouse Pad Wrist RestLarge size (MW310LE)Gel Wrist RestLarge Size (WR310LE)Gel Wrist Rest for Ergonomic\"Split\" Keyboards (WR314LE)Gel Wrist Rest for \"Curvy\"Keyboards (WR315LE)Gel Wrist RestExtra-Long (WR340LE)Gel Wrist Rest for Mouse or Trackball (WR305LE)", "title": "3M Precise Mouse Pad with Repositionable Adhesive Backing, Battery Saving Design, 8.5 in x 7 in", "price": 7.13, "imUrl": "http://ecx.images-amazon.com/images/I/41T5%2BCHGsFL._SX300_.jpg", "brand": "3M", "related": {"also_bought": ["B0016OV5MQ", "B000ZHB2HS", "B00FJ84WI4", "B000OOYECC", "B0002CE0WK", "B003NR57BY", "B007PJ4PN2", "B005L38VRU", "B005EJH6Z4", "B002NX0M8C", "B000FOO1OW", "B000RB7B72", "B002TLTGM6", "B002B3YCQM", "B00EFE9OAE", "B003VANO7C", "B00006HTZ0", "B003VAHYNC", "B007PJ4Q4U", "B00006HTLJ", "B005EOWBHC", "B00C18YRSA", "B000CD01I6", "B00DR8LA60", "B003TG75EG", "B00JHKSMJU", "B003XIJ3MW", "B00D68ZVY8", "B0084M696K", "B000G2BESO", "B00006IF79", "B002ZFQ318", "B00870ZHCQ", "B001E1Y5O6", "B00BIULEJC", "B003L62T7W", "B002HWRJBM", "B003VAGXWK", "B001TH7GVE", "B0036D9YKU", "B002SZEOLG", "B00C7RJQPY", "B00F3L19KQ", "B000A6V0JO", "B00004Z5RA", "B000J2EN4S", "B005P58CYG", "B005DLDO4U", "B007NLEF3W", "B004M8SSW8", "B000JE9LD4", "B001N40CB4", "B00006JNNE", "B004R8TTXK", "B00DBV28TG", "B000UEZ36W", "B00BP5KOPA", "B001JZ50SC", "B0033Z2BAQ", "B00CPR45IE", "B00JJ2C0S0"], "also_viewed": ["B00006HTZ0", "B00GMSS39E", "B00KAXTA80", "B00FJ84WI4", "B00370BH66", "B00AJN9MAC", "B0000365QL", "B000UEZ36W", "B00880TD8Y", "B000SR120M", "B00FJ84Q5I", "B00JRG6PAM", "B00I59691W", "B0002CE0WU", "B00004ZAGC", "B000UEZ37G", "B002J9G5AE", "B002XBQYKE", "B00FJ84Z9K", "B0002CE0WK", "B00L2AN9PK", "B0075CJ5ZW", "B00E52T320", "B002M81A1G", "B000ZHB2HS", "B001TKUOEC", "B00FVPXRWC", "B00AJN9O1Y", "B0002CE0WA", "B00FVPXST4"]}}