{"asin": "B0006VX1G8", "description": "Get Bose quality sound from your iPod or iPod mini with the Bose POD1 SoundDock Digital Music System. Simply dock and play to fill the room with vibrant, detailed sound that will revolutionize the way you experience your iPod.The SoundDock digital music system was specifically designed to expand and enhance your enjoyment of the music stored on your iPod or iPod mini. Just slip it into the docking cradle for the BOSE sound your favorite songs deserve. The iPod charges as it plays, so you enjoy music without interruption. Its sleek, slender design fits almost any room's decor. And the included remote lets you control the SoundDock system from across the room.The SoundDock system is designed to play your favorite tracks with crisp clarity, allowing you to discover subtleties in your music that used to simmer beneath the surface. A host of proprietary technologies add vitality and realism to your tracks. As a result, the music seems to come from a surprisingly wide soundstage. And an optimized port design delivers a full, rich sound that's greater than you'd expect from a system this small.The SoundDock system is easy to operate. Just plug it in, pop in your iPod and play. Your iPod works as long as it has a dock connector on the bottom. There are no extra wires or adapters. The included remote allows you to control your music at the push of a button. And a stylish, sophisticated look means it can blend in or be the center of attention wherever you place it.What's in the BoxSoundDock, remote control, power cord, power pack, and five dock inserts.", "title": "Bose SoundDock digital music system for iPod (White)", "price": 199.0, "imUrl": "http://ecx.images-amazon.com/images/I/51FYRAG8AZL._SY300_.jpg", "related": {"also_bought": ["B007QIXSVM", "B0010DH086", "B00DA06Z3I", "B009WNR13U", "B001NXYXX8", "B003MQ7F8Y", "B000JLKIHA", "B000V2FJAS", "B002M3SOC4"], "buy_after_viewing": ["B001DLTDQC", "B007JCNOHI", "B0010DH086", "B000V2FJAS"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}