{"asin": "B003OBZRPU", "related": {"also_bought": ["B008TN81ZG", "B00975BPC6", "B00IKMJ9B6", "B001NK395Y", "B008I64LC6", "B00ANH074Y", "B00H56FRYQ", "B008I646WG", "B008MR2HWC", "0470129867", "1440309310", "B00DU2CHE2", "B001C6GVI6", "B00DTSOBQ4", "B000SN2JWQ", "B00003CXG7", "1612622534", "B00BWF5U0M", "B00EVVGAFI", "B00JWN848G", "1612620248", "1612620264", "B006O5ENC6"], "bought_together": ["B00IKMJ9B6"], "buy_after_viewing": ["B00EN27U9U", "B00DKW816K", "B00EN27TCI", "B008I647MA"]}, "title": "VT PenPad 7.7-Inch Graphic Pen Tablet (Black)", "price": 39.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31LZOQlrcQL._SX300_.jpg", "brand": "VisTablet", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Input Devices", "Graphics Tablets"]], "description": "The VT PenPad is our newest, most affordable and lowest priced graphic tablet on the market. It's a great way to learn how to use a graphic tablet and pen without a large investment. Now you can easily and affordably turn any Mac, PC or Netbook into a tablet computer and take advantage of the cordless pen for a natural cursor control in any application. Draw, edit, mark up digital documents, annotate and personalize presentations, write notes, draw diagrams and navigate applications with speed, accuracy and comfort. It's a great learning tool for children, adults and students. Great gift idea for travelers, students, artists, busy professionals or anyone who uses a computer. The VisTablet PenPad has 1,024 levels of pen-pressure sensitivity that can you apply to the surface for superb recognition and 2048 lines per inch of resolution. With overall dimensions of 7.5-inch x 7.5-inch and an active area of 6-inch x 4.5-inch the VT PenPad is an ideal learning, drawing, and writing tool, that is great for everyday use by students K through 12 as well as University and Higher Education. It is the ideal gift for travelers, artists, business persons or anyone who uses a computer. There is no need to pay more or sacrifice performance for the versatility that the VT PenPad offers for Graphic art and Photo industries, students, and general needs for handwriting recognition on your MAC or PC. System Requirements: Microsoft Windows Vista, Windows XP (SP 2), Windows 7, and Apple OSX (10.3 or later). Please note that the VisTablet graphics tablets are designed to take advantage of built-in features in Mac OS or PC OS. Mouse capabilities are universal with all compatible operating systems."}