{"asin": "B002I3OZ6W", "description": "From the ManufacturerThe Logitech Portable Speaker S125i is ready to move, ready to groove.Just slip your iPod into the dock, and you're ready to move and groove to your favorite hip-hop band or rock anthem. Suddenly you have a new emotional connection to your music. Wherever you and your Portable Speaker S125i go, your friends are sure to follow. This compact speaker is lightweight and offers long-lasting tunes&#8212;up to 10 hours of battery life&#8212;so your music is easily transportable, whether relaxing in your room, or going to the park or the beach with friends. Added boost bass lets you feel the beat even more. It's so simple, your mom and dad will want to borrow it. But make them get their own.Key FeaturesThe Portable Speaker S125i is made for iPodsPlay and charge any iPod model with a dock connector.Boost your bass at the push of a buttonGive your bass sound a big boost with a push of your fingertips.Portable and power-smart, tooA compact size (0.8 pounds) and up to 10 hours of batter life make it easy to listen to your favorite music in your bedroom, kitchen, living room, or even in your back yard.Auxiliary input is at your disposalListen to any portable music player with a standard 3.5mm stereo jackCheck Out Other Stylish MP3 Speakers From Logitech:", "title": "Logitech Portable Speaker S125i with Built-in iPod Dock", "price": 113.95, "imUrl": "http://ecx.images-amazon.com/images/I/51kc0wZ9zxL._SX300_.jpg", "related": {"also_viewed": ["B003VANOI6", "B003Z9L390", "B002I3OZ7G", "B001FWXDZQ", "B001G5Z82I", "B0038W0N8G", "B002I636XM", "B002Y5XQYG", "B003SX0NG2", "B005IVL0UA", "B004I8WH8I", "B009CWRVH2", "B003SX0NFI", "B005OYR9D8", "B007JCNOHI", "B002I636YG", "B009I7XCYM", "B003ARSO08", "B001S0JZKW", "B00B7D4CS0", "B004TS2AP2", "B007JAQBZW", "B00BQ4HRG4", "B0035FJVHA", "B001S0LU96", "B00AWRPIWQ", "B00170IBF8", "B007PZYBSA", "B003ZQYVVK", "B003BIFJOA", "B008N73V7G", "B005KQ2O26", "B004SKBJ5S", "B0064XTQ98", "B0089ZV1WY", "B004UBONK8", "B000ARSLB8", "B005KQ2O2G", "B001Q9BVVG", "B007KFEOZK", "B005GUAIJM", "B00B7D4CRQ", "B0035WTCVI", "B003SNITOA", "B00BQ4HRE6", "B000UPA82U", "B009NZ6SZE", "B0014XKQY2", "B004MF5676", "B000NB05OW", "B008BLDI4U", "B007PZYBR6", "B001DLTDQC", "B001NXYXX8", "B00703BOV4", "B001JM1L5Q"], "buy_after_viewing": ["B003VANOI6", "B003Z9L390", "B002I3OZ7G", "B009CWRVH2"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories"]]}