{"asin": "B000PDR230", "description": "eTrex Venture HC is an essential for any outdoor excursion. It features a high-sensitivity GPS receiver for peak performance in any environment and includes 24 megabytes (MB) of internal memory, a detailed basemap and crisp color screen.An essential for any outdoor excursion.The H series marries high-sensitivity GPS with full-featured mapping, for a superb portable receiver.Basemap contains lakes, rivers, cities, interstates, national and state highways and coastlines.Make trip planning simple for your next outdoor adventure with the included MapSource Trip and Waypoint Manager.Proven Performance and Full-Featured MappingClear ReceptionThe Garmin eTrex Venture HC helps you navigate through the toughest terrain. The unit is equipped with a high-sensitivity, WAAS-enabled GPS receiver, which locates your position quickly and precisely and maintains its GPS location even in heavy cover and deep canyons. The advantage is clear: whether you're traipsing through thick woods or strolling near tall buildings and trees, you can count on the Venture HC to help you find your way when you need it the most.Intuitive OperationAt the same time, the Venture HC's easy-to-use menu lets you create and view waypoints (up to 500), save and view 10 track logs, access setup features, and more. It even offers 24 MB of internal memory and a detailed basemap, so you can load waypoints and routes from the included MapSource Trip & Waypoint Manager software and add map detail from Garmin's entire line of optional MapSource mapping products.Besides appreciating its small size, outdoorsmen will also be happy with the Venture HC's unique button layout, with five buttons located on either side of the unit. The benefits of this design are twofold: First, the Venture HC is a breeze to operate with just one hand, and, second, with the buttons on both sides of the unit, the bulk of the front is dedicated to the 256-color, sunlight-readable TFT display. This makes it easy to distinguish map details regardless of the time of day.Comprehensive BasemapThe Venture HC'sAmericas Recreationalbasemap, meanwhile, contains lakes, rivers, cities, interstates, national and state highways, railroads, and coastlines--in short, a host of helpful details for your outdoor adventures.The map covers the United States, Canada, Mexico, and Central and South America.And More...Other details include an IPX7 waterproof housing, a built-in patch antenna, a USB interface, a hunt/fish calendar, sun and moon information, and a geocaching mode.The Venture HC, which runs for up to 14 hours on a pair of AA batteries (not included), measures 2.2 by 4.2 by 1.2 inches (W x H x D) and is backed by a one-year warranty.Trip and Waypoint ManagerMake trip planning simple for your next outdoor adventure with the included MapSource Trip and Waypoint Manager. This computer software allows you to transfer waypoints, routes and tracks between your Garmin device and your computer. For reference, Trip and Waypoint Manager provides general worldwide maps that include interstates, motorways, political boundaries, principal cities and towns, oceans and other general reference details to place your GPS data in context.What's in the BoxeTrex Venture HC, Basemap, MapSource Trip &amp; Waypoint Manager Software, USB Cable, Wrist Strap, Quick Start Guide, User's Manual.", "title": "Garmin eTrex Venture HC GPS Receiver (Discontinued by Manufacturer)", "price": 169.85, "imUrl": "http://ecx.images-amazon.com/images/I/51IkJ7qLWeL._SY300_.jpg", "related": {"also_bought": ["B00004VX39", "B00004VX15", "B00542NV32", "B000PDV0CE", "B000PDR27G", "B003IHV6XW", "B003IHV6YG", "B00542NVDW", "B00542NVS2", "B000058BCQ", "1592578772", "B003I86PIM", "B00449YYM8", "B000UNDLQ2"], "buy_after_viewing": ["B00542NVDW", "B00004VX39", "B00542NV32", "B002MIT5ZE"]}, "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]]}