{"asin": "B00008WMBT", "categories": [["Electronics", "Computers & Accessories", "Routers"]], "description": "The versatile Wireless-G Ethernet Bridge can make any wired Ethernet-equipped device a part of your wireless network. At home, use the Bridge to connect game consoles, set-top boxes, or computers to your Wireless-G network and its shared high-speed Internet connection. In the office, convert your Ethernet-wired printer, scanner, camera, notebook or desktop into a wireless networked device.It's completely driver-free, so it works on any platform and under any operating system! Since there are no drivers to load, setup is a snap--configure the network settings through your PC's web browser, then plug it into your device and go. And physical installation is simplified by support for Power Over Ethernet. With an optional POE Adapter, you can mount the Bridge wherever you want--power and data are both supplied through the Category 5 Ethernet cable.You can also use the Wireless-G Ethernet Bridge as a kind of \"cable-less cable\" to connect remote areas together. Maybe Shipping is all the way across the warehouse from Receiving. Or maybe you want to set up a home office in your detached garage. With a Wireless-G Ethernet Bridge in the garage, and another one (or a Wireless-G Access Point) in the house, you're connected--no digging trenches, and no overhead wires.Let the Wireless-G Ethernet Bridge from Linksys open up exciting new possibilities for your wireless network.See acomparison         diagramof the different wireless technologies.Wireless networks are rapidly         becoming more popular and coming down in price. Since they don't require         cables, you can use the devices anywhere in an office or home, even out         on the patio. There's no need to roll out an Ethernet network cable to         each room of a house; you can network anywhere -- without wires. Outside         of the home, wireless networking is available in hotspots at coffee shops,         businesses, airports -- great when you're on the road and need to get         some work done. For convenience, wireless networking is the answer.What Wireless Standard is Right for Me?Now that you've decided to create a wireless network, the next step is         to figure out which wireless standard to use.Basically, a standard is a set of specifications for a device. All devices         that follow a specific standard share operating characteristics, such         as the radio frequency used and maximum data transfer speed.For wireless networking, there are three standards to choose from at this         time:802.11b802.11a802.11g802.11a/gTo learn about the differences between the standards and select the right         one for your network,click         herefor an easy-to-understand chart.", "title": "Cisco-Linksys WET54G Wireless-G Ethernet Bridge", "price": 99.0, "salesRank": {"Electronics": 13904}, "imUrl": "http://ecx.images-amazon.com/images/I/41RF0YWMP0L._SY300_.jpg", "related": {"also_bought": ["B000SEN9U6", "B000EREM6C", "B004UAKCS6", "B000NZNTVE", "B003KPBRRW", "B008I647MA"], "bought_together": ["B000SEN9U6", "B000BTL0OA"], "buy_after_viewing": ["B0056VP0KS", "B007CO5DZ4", "B008LTPFG6", "B003KPBRRW"]}}