{"asin": "B00140S21O", "description": "Team Fortress 2(TF2) is the sequel to the game that put class-based, multiplayer team warfare on the map. A long time coming,TF2was first announced in 1998, but in the years that followed went through various concept and design changes, which left it looking less and less like the beloved original release. Luckily by the time the final version came off the presses and was bundled as part of EA?s 2007 release,The Orange Box, it had returned to something very close to the original game.The return of a classicMeet the full team.View larger.Heavy dropping a few shells.View larger.Pyro bringing the heat.View larger.Scout catching some air.View larger.GameplayBuilt around multiplayer battles of two teams, Reliable Excavation Demolition (RED) and Builders League United (BLU), representing competing construction teams, players choose between two game modes: capture the flag (CTF) and a control point mode. In CTF the objective is to obtain a briefcase of intelligence from the enemy team's base and return it to their own base while preventing the opposing team from doing the same. In the control point mode the objective is similar, only related to holding particular territories. To be successful in either the most important thing is to understand and use each character class in the best way possible.A Game That's a Class OperationUnlike other \"class-based\" games that offer a variety of combat classes only,Team Fortress 2features a wide variety of classes which provide a broad range of tactical abilities and personalities, and lend themselves to a variety of player skills. All nine playable character classes from the original game are available and although a few of these, like the Medic and Heavy generally work well with any mix of characters, overall each have particular strengths in offensive, defensive and support capacities. Each also will respond dynamically with different comical dialogue when in combat.The full character classes include:Pyro- An offensive class with average damage tolerance, Pyros are armed with a flamethrower, shotgun and a fire axe.Engineer- A defensive class with a low threshold for damage, Engineers can upgrade weapons and equipment and are armed with a shotgun, a pistol and a wrench.Spy- Used for sabotage the Spy carries a revolver, a butterfly knife, an electronic zapper and a diguise kit.Heavy- Tough on offense and defense the Heavy's weapons are the minigun, the shotgun and his fists.Sniper- A support class with low damage tolerance, the Sniper is armed with a sniper rifle, a submachine gun and a machete.Scout- The Scout is fast but susceptible to damage. His weapons are a sawed off shotgun, a pistol and a baseball bat.Soldier- A slow, but a powerful offensive class, the soldier wields a rocket launcher, a shotgun and a spade.Demoman- A defense class with an average amount of protection, the Demoman is armed with a remotely detonated sticky bomb and a bottle of Scotch.Medic- Medics keep other characters alive and are armed with a healing 'medigun,' a syringe-firing launcher and a bone saw.The importance of the abilities of particular classes aside, far and away the dominant factor inTeam Fortress 2and the secret to its popularity, is its clear dedication to fun. This is seen in its rejection of realism in favor of cartoon-style art in the game's graphics, the inclusion of super weapons like lasers and missile launchers hidden within the six standard maps and the attention given to each character's incidental trash talking functionality. Combined, these simply make for fast-paced, over-the-top fun which are the building blocks of any multiplayer shooter.System Requirements:Minimum Specifications:Recommended Specifications:OS:Windows Vista/XP/2000Processor:1.7 Ghz ProcessorPentium 4 Processor (3.0 Ghz or better)RAM:512 MB RAM1 GB RAMVideo Card:DirectX 8 level Graphics cardDirectX 9 level Graphics cardOther:DVD-ROM Drive/Mouse/Keyboard/Internet Connection&nbsp;", "price": 69.9, "imUrl": "http://ecx.images-amazon.com/images/I/51u2Imk7dcL._SY300_.jpg", "related": {"also_bought": ["B002I0JIQW", "B002BRYXRQ", "B001440YD4", "B00006I02Z", "B000R0PLK2", "B000PS2XES", "B00140P9G0", "B002NIP2SM", "B005C2D2H4", "B000FKBCX4", "B000TD3IA2"], "buy_after_viewing": ["B000R0PLK2", "B000PS2XES", "B00CZBGT02", "B000PE0HBI"]}, "salesRank": {"Video Games": 7649}, "categories": [["Video Games", "PC", "Games"]]}