{"asin": "B000ZK7ZOY", "description": "Bionic Commando is back, now on the PS3, 20 years after the NES classic was initially released. And returning with it is the swinging bionic arm game mechanic that made it so popular and critically acclaimed. Bionic Commando makes the move to 3D, and gamers will be able to grapple, swing, and scale a giant environment filled with buildings, canyons, and more..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; } img.withlink {border:1px #777777 solid;}There are many creative uses for your bionic arm.View larger.Being able to swing and shoot is an essential skill.View larger.Freely explore Ascension City and its outskirts.View larger.Ten players can get it on the action at the same time.View larger.Nathan Spencer is BackBionic Commando takes place 10 years after the 1988 game, with Nathan Spencer again the protagonist. Voiced by Mike Patton, ex-Faith No More singer, Spencer is betrayed by his government, falsely accused of murder and sentenced to execution. Just prior to his execution, however, the city is bombed and Spencer is asked to track down the terrorists in return for his freedom.Bionic Arm Offers New Control PossibilitiesLike in the original game, the bionic arm is what separates Bionic Commando from other games. With it, you can swing between buildings, grapple onto ledges and zip up, walk walls, pull apart the landscape, throw heavy objects, attack enemies, and more.Giant, Sweeping World to ExploreAs you swing around with your bionic arm, you'll be subjected to beautifully detailed scenery that ranges from Ascension City and its bridges and skyscrapers, to outdoor environments like canyons. By mastering different swinging techniques, players will be able to reach different areas and target enemies while mid-swing or even hanging upside down. If you misjudge your swing by even a little bit, you might find yourself plunging to your doom.Swinging Multiplayer Fun for up to Ten PlayersBionic Commando allows up to 10 players at a time to get in on the swinging fun, finding new ways and techniques with the bionic arm to dispatch your friends and enemies. Maps are designed with the swing and gun game mechanic in mind, rewarding players who are adept at simultaneously swinging and aiming.Bionic Commando is an updated and beautiful take on the classic, bringing the core elements of the 8-bit original into a beautiful, 3D world. Fans of the classic and newcomers alike will delight at the unique game play options that the bionic arm afford.", "price": 58.73, "imUrl": "http://ecx.images-amazon.com/images/I/51gg1j%2BgkXL._SY300_.jpg", "related": {"also_bought": ["B00170823O", "B000KLNLUK", "B002BRZ744", "B000K9OR4Q", "B002DC8GKO", "B000R3CIV4", "B000SQ5LQE", "B000K9OP2A", "B00319DX4M", "B003O6HLOK", "B001ASJIS6", "B000HGOHWO", "B000R39GPA", "B0081B1O5A", "B004BCZLQ6", "B00104KCF8", "B007UM599S", "B005DVAB0A", "B0030MQPQ8", "B003ESHRL0", "B0030GBU2I", "B000QAVV6G", "B005185SDA", "B002BXJ9VA", "B00320JAWY", "B0050SXYIC", "B001D7T2VC", "B000ZK7ZOE", "B003DLQTYY", "B000ZK7ZMQ", "B002I0F5M8", "B000HCJD68", "B0030HM2WO", "B000MUW98O", "B000WS97QI", "B002EZH804", "B007IFMEYK", "B003O6G1L4", "B005UDTTQ8", "B001D5DQL6", "B002I0K6DG"], "bought_together": ["B00170823O", "B000KLNLUK"], "buy_after_viewing": ["B000KLNLUK", "B00170823O", "B007SRM5U6", "B002DC8GKO"]}, "salesRank": {"Video Games": 12750}, "categories": [["Video Games", "PlayStation 3", "Games"]]}