{"asin": "B001542UQW", "related": {"also_bought": ["B007SHJJFU", "B0002J2TLC", "B00CDHJ6SU", "B003D3NFBC", "B000ASTKWQ", "B005SSMT8A", "B003TJALAI", "B004E10NF8", "B008ND5GS2", "B0023RRPDI", "B001AVR8TY", "B002S9KDKS", "B002PNEDFS", "B007SHJJV4", "B0083Z6R4W", "B003WLY24O", "B004AZ38Z0", "B002SOBPH8", "B00004XOM3"], "bought_together": ["B007SHJJFU"], "buy_after_viewing": ["B0002J2TLC", "B003TJALAI", "B00CDHJ6SU", "B007SHJJFU"]}, "title": "MyStudio MS32 Professional Tabletop Photo Studio Kit w/ 5000K Continuous Lighting for Product Photography, 32x32x16 inches", "price": 334.95, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31YliN5k4NL._SX300_.jpg", "brand": "MyStudio", "categories": [["Electronics", "Camera & Photo", "Lighting & Studio", "Photo Studio", "Background Support Equipment"]], "description": "They say a picture is worth a thousand words, but for catalog and online retailers, eBay power sellers and product manufacturers, a good product photo can be worth much, much more.  In fact, a good photo is arguably the single most important element in selling your product.  If a customer cannot touch the products you are selling, they must rely on your photos, and your photos must accurately communicate value that they will be willing to pay for.  Studies have actually shown that customers are often willing to pay more for products with attractive, professional quality photos because it engenders a type of trust between them and the seller. Conversely, poor product photos tend to create just the opposite feeling and can turn potential customers away.MyStudio products are designed to provide a high quality, professional photo solution at an affordable price; one that can be used by amateur and professional photographers alike to create fantastic product photos with a minimum amount of expense and effort.MyStudio 32 Highlights32 x 32 x 16-inch seamless cyclorama infinity backgroundProviding the perfect white infinity background for product photography is what the MyStudio 32 cyc background is all about.  The 90-degree corner design optimizes your shooting angles and provides a maximum 44 inches of background width from left to right, 40\" deep and 16\" high.  These generous dimensions provide enough room for most small to medium sized products, and even multiple item sets.Before and after with MyStudioDesigned and manufactured by Pro Cyc, Inc.The world&#x92;s leading designer and manufacturer of modular cyclorama backgrounds for large television and film studios, Pro Cyc engineered the MyStudio 32 tabletop cyc background for maximum versatility.  The MyStudio 32 background features a lightweight, durable standalone cyc with a 90-degree corner and a seamless floor to wall cove radius that runs the entire length of the cyc.  This means there are no seams that have to be edited out later, and it provides an easy-to-light infinity background that allows your subject to be photographed in a perfect white setting every time.  Whether you are an online or catalog retailer, eBay power seller, toy collector, or documenting items for insurance purposes or any number of other applications, the MyStudio 32 cyclorama is the perfect background for small to medium-sized item photography.5000K color-corrected \"daylight\" continuous lighting systemTalk to any good photographer and they will affirm that proper lighting is one of the single most important aspects of taking a good photograph.  MyStudio 32 solves this problem for you by including a complete continuous lighting system that takes all the guesswork and expense out of the lighting dilemma.The customized lighting kit that comes with MyStudio 32 was designed by a professional product photographer with over 25 years of experience in catalog product photography.  It features a two 15 watt 5000K (\"daylight\") color-corrected fluorescent bulbs with a CRI of 92 which provides strong, accurate full-spectrum lighting that will bring out the true colors and fine details of your product.  The lights are installed on a double-wide adjustable height aluminum stand.  The MyStudio 32 lighting kit also comes with 4 light reflectors (two overhead \"ceiling\" reflectors that span the width of the studio and two large 16\" x 20\" side bounce cards).  This allows you many different options when lighting your subject and ensures that there will be plenty of continuous, accurate and even lighting all around.Before and after with MyStudioEverything but the cameraMyStudio 32 comes with everything you need to produce fantastic, professional quality photographs right out of the box. Until now, the combination of the professional quality infinity background and continuous 5000K lighting that is found in the MyStudio complete tabletop photo studios could only be replicated in a professional photo studio at much greater expense.  No longer.  In essence, each MyStudio system is a miniature replica of a much larger professional cyclorama photography studio. While large studios certainly have their place and are necessary for larger applications, it can cost tens of thousands of dollars or more to build and properly light such a space. The average photographer and online entrepreneur just don&#x92;t have that kind of budget, nor do they require such a large studio for the majority of their photographic needs. That&#x92;s where the MyStudio portable photography studio comes in.  At a fraction of the cost, now everyone can take professional quality photos with almost any camera and very little experience.  If great looking professional photos would help your business in any way, then you can't afford to not have your own MyStudio system.  Just as digital cameras have eliminated the need for film, MyStudio virtually eliminates the need for expensive lighting and studio backgrounds.MyStudio HistoryDesigned and manufactured in the USA by Pro Cyc, Inc., the MyStudio line of tabletop photo studio products derives its design and inspiration from Pro Cyc&#x92;s world leading modular cyclorama studio backgrounds.  Since 1987 Pro Cyc has been providing custom cyclorama (\"cyc\") infinity background solutions which are currently used by virtually every major television network (CNN, NBC, CNBC, ESPN, FOX, etc.), film studios, photographers and videographers worldwide for green screen, blue screen and countless other applications that require an infinity background.To design MyStudio, Pro Cyc drew on their experience and success at creating seamless infinity backgrounds for the large studio industry and applied the same technology and expertise to this revolutionary line of cyclorama-based tabletop studio products intended for use by both professional photographers and amateurs alike.  Add to that a color-corrected 5000K lighting system that was designed by a professional product photographer with over 25 years of experience and the result is line of tabletop studio products that deliver unparalleled results at an affordable price.  The best feature of all, however, is that virtually anyone with a standard digital camera can take fantastic photos, because with MyStudio the barrier to professional quality photos has just been erased."}