{"asin": "B001GAOYCS", "description": "Amazon.com Product Description Panasonic's two new slim, BD-Live compatible, feature-filled Blu-ray players, the DMP-BD35 and DMP-BD55, offer cutting edge technologies focused on producing the ultimate movie-viewing experience.The BD35 and BD55 both feature an HD Audio Decoder (Dolby TrueHD, Dolby Digital Plus and DTSTM-HD Master Audio Essential), delivering 7.1-channel surround sound through a 7.1-channel receiver equipped with an HDMI terminal. The DMP-BD55 features high-end audio components and can also output analog signals for 7.1-channel sound, so even receivers that are not compatible with HDMI can produce the newest 7.1-channel surround sound.Both models are equipped with an SD Memory Card slot that makes it easy to transfer images from an HD camcorder or digital still camera that uses SD Memory Cards and are compatible with Panasonic&rsquo;s VIERA Link function so they can be operated by the VIERA HDTV remote control.The combination of a Panasonic Blu-ray player, Home Theater audio system and a VIERA HDTV converts the home entertainment experience into a true-to-life cinematic experience. Consumers can now view and enjoy movies the way the film maker intended -- in stunning High Definition video and audio &ndash; right from the comfort of their own home.Learn MoreTrue-To-Life Colors with PHL Reference Chroma Processor PlusThe PHL Reference Chroma Processor Plus video processor was developed after more than 15 years of collaboration between Panasonic Hollywood Laboratory and professional cinema studios in Hollywood. With PHL Reference Chroma Processor Plus, users viewing content on Blu-ray Discs enjoy crisp, vivid colors that are extremely close to the original.&nbsp; A high-precision 4:4:4 function creates video signals in which each pixel of the signal from the Blu-ray Disc is color-compensated, so when the player is connected to aPanasonic VIERA HDTV, the colors are even sharper and more vivid.UniPhier SystemUniPhier is a Panasonic-created system LSI developed by applying 45-nanometer processing to a consumer product &ndash; a world&rsquo;s first.&nbsp; This single-chip integration technology also contributes greatly to the BD35&rsquo;s world's slimmest height of 49mm.Blu-ray Video FeaturesMore PictureSee Everything Your HDTV Can Show You with Full HD.6 Times the Picture Data on DVDsSee everything your HDTV can show you. Blu-ray Disc's Full HD 1080p resolution produces over 2 million pixels per frame to produce a razor-sharp picture with unmatched depth and clarity that takes full advantage of the capabilities of today's 1080p HDTVs. That's six times the picture data contained on DVDs, which are encoded at only 480p.24p True Cinema Video OutputMost of all Hollywood movies are shot at 24 frames per second, and Blu-ray Disc movies are mastered at 24 frame per second. Blu-ray Disc Players can output films at 1080/24p for a true film-like experience at home, as well as 1080/60p for more traditional HDTV sets on the market.Backwards compatible and UpscalingAll existing Blu-ray Disc players will play your standard DVD collection without a problem. And with built-in 1080p video upscaling, they'll look even better.More SpaceBlu-ray Disc has 5x more storage capacity than DVD, which allows more content to fit on the disc. The extra storage capacity also means more room for special features like inline navigation, Bonus View, interactive games, deleted scenes, director commentary and moreNavigate to special features, other scenes, or settings without leaving the content you are watching.Bonus View lets you watch special features and commentary inline without leaving the movie.More BitsIn the digital world, picture quality is not just about resolution, but also about bit rates. The higher the bit rate, the more data that is processed, typically resulting in higher video quality. DVDs have a maximum video bit rate of about 10 megabits per second (Mbps). In comparison, Blu-ray Disc is capable of video bitrates up to an incredible 40 Mbps. The bottom line, higher bit rates allow for the least amount of data compression for HD video that looks closest to the original video source.BD-LiveBoth the BD35 and BD55 feature BD-Live compatibility which enables users to connect to the Internet to download images, subtitles and other data, and take part in interactive activities and multi-player games linked to bonus cinema content found on Blu-ray Discs.BD-Live is a Blu-ray feature that enables you to access&nbsp; special content via an internet-connected Blu-ray player. Because it's not coded into the disc, BD-Live content is always updated, always fresh. With BD-Live, your Blu-ray disc is different every time you view it.Check out the latest previews,&nbsp; download special scenes, exclusive features and ringtones, and participate in online communities or games.As BD-Live continues to grow and expand, even more features will become available, customizing features and content to your location or preferences.Life-Like Surround SoundThe BD35 and BD55 both feature an HD Audio Decoder (Dolby TrueHD, Dolby Digital Plus and DTSTM-HD Master Audio Essential), which supports the 7.1-channel surround sound newly adopted in Blu-ray Discs.&nbsp; Users can enjoy 7.1-channel surround even with systems that do not support HD Audio -- as long as the DMP-BD35/55 is connected to a 7.1-channel receiver equipped with an HDMI terminal. The DMP-BD55 can also output analog signals for 7.1-channel sound, so even receivers that are not compatible with HDMI can produce the newest 7.1-channel surround sound by simply connecting to the DMP-BD55.Dolby TrueHD, Dolby&rsquo;s next-generation lossless technology developed for high-definition disc-based media, delivers tantalizing sound that is bit-for-bit identical to the studio master.Delivers enthralling studio-master-quality sound that unlocks the true high-definition entertainment experience on next-generation discs.Offers more discrete channels than ever before for impeccable surround sound.Compatible with the A/V receivers and home-theaters-in-a-box (HTIBs) of today and tomorrow.Dialogue normalization maintains the same volume level when you change to other Dolby Digital and Dolby TrueHD programming.Dynamic range control (Night mode) enables you to customize audio playback to reduce peak volume levels (no loud surprises) while experiencing all the details in the soundtrack, enabling late-night viewing of high-energy surround sound without disturbing others.The Panasonic BD55 goes a step further with a high-end audio design and components. Thanks to a 192kHz 24bit audio digital-analog converter and high quality insulators, electrolytic capacitors, copper-foil film capacitors and ultra-low-impedance electrolytic capacitors, the DMP-BD55 delivers the same kind of exciting surround effect and lifelike ambience as today's finest cinemas. The DMP-BD55 can also output analog signals for 7.1-channel sound, so even receivers that are not compatible with HDMI can produce the newest 7.1-channel surround sound by simply connecting to the DMP-BD55.HDMI Featuresx.v Color", "title": "Panasonic DMP-BD35K 1080p Blu-ray Player", "price": 142.0, "imUrl": "http://ecx.images-amazon.com/images/I/31Ps0DXvqDL._SX300_.jpg", "related": {"also_viewed": ["B00B9JR5EU", "B00752R4PK", "B00752R4Y6", "B001V9LA44", "B000Y634SU", "B00B9JR5H2", "B0038KR8WM", "B00AYB3OMG", "B0038KN114", "B004LNFJCQ", "B00752R4QO", "B004G8HXXO", "B00JMNUGSM", "B00752R4S2", "B0080S4JO2", "B00F6B3ULE", "B00AYB3OOY", "B0038KV0BM", "B001URWAYG", "B005NEZDUA", "B001A4LVYY", "B0036WS4CA", "B00793MIGK", "B00752R5Z4", "B009AHQ8C8", "B00IQA1XIO", "B00I19TOGS", "B00KQ2EQUM", "B00EUY59Z8", "B006H8WFU2", "B00BQ3EGPU", "B003ZXE87A", "B00AWX6EYQ", "B006U1YVZ8", "B005DII6DC", "B00D8M59QW", "B00AWKC0JM", "B00AWKC0EC", "B006U1YUZE", "B00ICDAAX4", "B00FF9SVWA", "B002CO6GUK", "B00G3HA1O4", "B004N85YBA", "B00IBR189Q", "B00FL4EWEK", "B00CP76N7U"], "buy_after_viewing": ["B00AWKC0JM", "B003L1ZYYM", "B00B9JR5EU", "B00752R4PK"]}, "categories": [["Electronics", "Television & Video", "Blu-ray Players & Recorders", "Blu-ray Players"]]}