{"asin": "B003MPSHP0", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Compact System Cameras"]], "description": "The NEX-5 has all picture quality of a DSLR, yet it's about half the size, half the weight and far less complex. Pulling off this minor miracle took some clever innovations in glass, silicon and software code.Sony Alpha NEX-5 OverviewBigger Sensor, Better PicturesIn technical terms, the APS-C image sensor is 13 times the size of the typical sensor. In human terms, you'll be taking photographs, not snapshots. The bigger sensor means softer backgrounds, for more attractive portraits.The NEX-5 is equipped with a powerful new 14.2-megapixel Exmor APS HD CMOS sensor, specially tuned to deliver uncompromising still-photo and movie image quality. Equal in surface area and performance to the large, APS-C image sensors used in Sony's acclaimed a system digital SLR cameras, it offers exceptionally rich tonal gradation and true-to-life color. Proprietary Sony processing technologies are also incorporated directly into the sensor, assuring clean, low-noise signal output and ultra high-speed data transfer.World's Smallest and LightestThe NEX-5 delivers the quality of a DSLR in a camera that's ready to go wherever you go. In fact, this is the world's smallest, lightest interchangeable lens digital camera (as of April 2010). It's roughly half the size and weight of Sony's smallest, lightest DSLR, the a230.Equipped with an image sensor that's 13 times the size of the typical compact camera's sensor, a NEX cameras turn snapshots into photographs. The bigger sensor means images with softer background that make your subject stand out and stunning low-light shots.Expect More from a CameraSony has always recognized that a digital camera could take pictures in ways that film cameras never dreamed of. That's why we've created new capabilities to take your photography further than ever. These include Sweep Panorama, Auto HDR, Handheld Twilight and Anti Motion Blur modes.Thanks to their powerful Exmor CMOS image sensor and BIONZ image processing engine, both these cameras can offer high-speed continuous shooting at up to 7 fps (approx.) in Speed Priority Continuous mode, and at up to 2.3 fps (approx.) in Continuous Advance mode. In addition, their 10-second self-timer also has a 3-shot continuous shooting setting.High Def, Not Half DefMany cameras take HD movies, but not so many offer the same Full HD 1080-line resolution as most broadcast HD networks. And very few have the same 60i frame rate for fluid, natural motion. In fact, this is the world's first interchangeable lens digital still camera with 1080/60i HD movies1.When you're shooting movies in AF mode with an E-mount lens, the camera smoothly adjusts focus and exposure in response to changes in the scene, and you can use the control wheel to instantly adjust exposure compensation on the fly. If desired, you can also preselect white balance and Creative Style settings before movie recording begins.The Creativity of Changing LensesThe beauty of SLR photography is the ability to change lenses to match your shooting situation. Now Sony brings that beauty to a compact camera. The NEX-5 gives you a choice of dedicated E-mount lenses, plus a choice of 28 A-mount lenses via an adaptor, sold separately.Sophistication Made SimpleSome cameras bristle with knobs, buttons and dials. The NEX-5 replaces them with a simple turn-and-click Control Wheel and a pair of Soft Keys. These give you easy access to the full power of digital photography. To make learning even easier, Sony includes an On-Screen Help Guide and On-Screen Tips.Automatically apply exposure values and Scene Selection modes that are optimized to suit each scene. What's more, they combine this full-auto convenience with a Background Defocus Control function that lets you enjoy one of the biggest creative advantages of interchangeable lens photography--the ability to defocus the background to make your main subject stand out from the scene. Just press and rotate the control wheel to set the level of background defocusing you want--it's easy and intuitive because you can confirm the level of defocusing on the LCD monitor in real-time.The main menu features six clearly labeled icons that can be selected simply by rotating and pressing the control wheel. Inside, standard scrolling menus provide quick access to settings for shooting and playback functions, as well as a host of other user preferences and camera settings. The wide-screen format of the LCD monitor also contributes to enhanced menu legibility, so text and icons are always easy to see and select.", "title": "Sony Alpha NEX NEX5K/S Digital Camera with Interchangeable Lens (Silver)", "price": 17.49, "salesRank": {"Camera &amp; Photo": 10526}, "imUrl": "http://ecx.images-amazon.com/images/I/510X9h3ngTL._SY300_.jpg", "related": {"also_viewed": ["B005IHAIHA", "B00AYGLO4G", "B00KMDAWQM", "B00836H2I6", "B005IHAIJ8", "B0090QXFP2", "B00BF9MUBM", "B003MPOLX2", "B0090QXG92", "B00HHAJSWW", "B00BF9MUAS", "B00GUSVP3M", "B003MPN90S", "B00836H2BI", "B00ENZRP38", "B00EPWC2WI", "B003MPSING", "B003MPOMI6", "B00HNJWTC8", "B003MPN97Q", "B005IHAIMA", "B00HNJWU3G", "B00HNJWT9G", "B009Z7URX4", "B00D5N6792", "B0090QXG0G", "B00H7HVRU6", "B00ESIWG6G", "B00D5N67T2", "B00AB4I5W0", "B00D6MN72W", "B00CEH9NFU", "B0096W1OKS", "B003LM2K3Y", "B00EH5UGR6", "B0056ENTVC", "B005IKZU8O", "B0096W1OCG", "B00FB2X4ZU", "B003MPUO9W", "B004J2LMJ8", "B007R7DTRK", "B00AB4I6NS", "B005OGQXJW", "B00D6MNNN0", "B003U8Q7TC", "B009Z3PCKQ", "B007KD7IBE", "B005OGR36O", "B007SQB896", "B005OGQZFO", "B00946HOX2", "B00946HJAA"], "buy_after_viewing": ["B00B7ID99I", "B0049WBZEK", "B0096W1OKS", "B005IHAIHA"]}}