{"asin": "B00008I9K8", "categories": [["Electronics", "Computers & Accessories", "Computer Components", "Network Cards"]], "description": "Amazon.com Product Description.caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The NETGEAR WG511 Wireless-G PC Card offers:802.11g wireless networking capability.Backwards compatibility with 802.11b wireless networks.128-bit WEP encryption for extra security.The NETGEAR WG511 Wireless-G PC Card makes it simple for you to provide wireless internet access to your notebook computer, letting you surf the web, check email, and chat online without the need for cables.An antenna is built in for portability.View larger.Easy SetupThe WG511 is a PC Card and requires a Pentium class PC with an available 32-bit CardBus slot for installation. It supports Windows Vista and is also compatible with Windows XP, 2000, 98SE, and Me. Setup is as simple as inserting the card into the slot and installing the included software. A built-in stub antenna helps you receive a strong signal for the fastest possible speeds.Fast and SecureThe NETGEAR WG511 supports the 802.11g protocol standard for speeds up to 54 Mbps and a longer range than previous-generation 802.11b adapters. With a good connection, you'll notice the difference right away as you'll be able to stream high-quality music without any hiccups and load videos much faster. Downloading files is up to five times faster than it was with 802.11b. Since 802.11g is also interoperable with 802.11b, you don't have to worry about whether or not you'll get a connection at specific airports and hotspots; the WG111US will automatically detect the network and allow you to connect to it at the highest speed possible.The adapter supports 40/64-bit and 128-bit WEP encryption for security so you don't have to worry about anyone eavesdropping on your emails or stealing your passwords. The included software makes managing different WEP passwords a breeze as you can set up different profiles for each location you frequent, saving yourself the trouble of having to type in encryption keys each time you connect to a hotspot you've already used.The NETGEAR WG511 Wireless-G PC Card is backed by a 1-year warranty.What's in the BoxWG511 Wireless-G PC Card, setup CD, installation guide, warranty/support information card.", "title": "NETGEAR WG511NA Wireless G Pc Card", "price": 11.95, "imUrl": "http://ecx.images-amazon.com/images/I/41cNROJNubL._SX300_.jpg", "brand": "Netgear", "related": {"also_bought": ["B0027Q4HXG", "B00007KDVK", "B000LQKA6C", "B00006B7CG", "B0002AFU4E", "B003CH77YK", "B0002VAQR4", "B00005NWV1", "B000RFPBQQ", "B00BKT4RFY", "B003CHANJG", "B0000X5U7K"], "bought_together": ["B00007KDVK", "B0027Q4HXG"], "buy_after_viewing": ["B00007KDVK", "B000FFLYI2", "B008IFXQFU", "B000W8UIZW"]}}