{"asin": "B000IMWK2G", "description": "To make gaming as accessible to people of all ages and all abilities, Nintendo wanted to create a controller that was as inviting as it was sophisticated- the result is the Wii Remote. Nintendo fused the global familiarity of a remote control with the sophistication of motion-sensing technology to come up with an input device that differentiates the Wii from any other console that has come before it.Revolutionary controlSporting the dimensions of a small traditional remote control, the wireless Wii Remote is a multifunctional device that is limited only by the game designer's imagination. The magic of the Wii Remote's design lies within; acellerometers inside the controller body measure movement in all directions and at all speeds. In a tennis game, it serves as your racket as you swing your arm for a long forehand or a quick and hard backhand. In a 4x4 driving game it serves as a steering wheel, allowing you to swerve to avoid obstacles or pickup power-ups. In first-person shooters, the Wii Remote acts as a firearm that you can point directly at an on-screen enemy. The list of potential uses is enormous, and the light weight of the Wii Remote allows gamers to play for hours without feeling fatigued.The Wii Remote boasts impressive technology for such a compact package.All Wii Remote buttons are accessible and responsive.View larger.Control many games from up to 30 feet away.View larger.The motion sensing technology is neatly tucked away within the Wii Remote body.View larger.The remote feels comfortable in both right and left hands.View larger.As comfortable as it is functionalThe Wii Remote is equally comfortable in right and left hands and houses just the right number of buttons for gaming- not so many that new players will get confused, but enough so that Wii games don't feel constrained. On the face of the remote are the D (or \"plus\") pad, a large \"A\" button which is used for major on-screen actions, and two small options buttons. Between the game buttons are a plus and minus buttons (which often act as \"forwards\" and \"back\"), as well as a \"Home\" button to engage the Wii home screen to change settings or check remote battery levels. On the back side of the controller is a trigger-like \"B\" button, perfect for timing releases of a bowling roll inWii Sports.Thankfully, battery life is excellent with the two included AA batteries, just as with the previous generation of Nintendo wireless controllers.Immersive intelligenceAlong the bottom of the Wii Remote, four blue LED lights indicate which player position the remote is currently set to. The controller automatically connects to the Wii console via Bluetooth wireless technology. Below the LEDs, an expansion port lets you connect a number of devices including the Nunchuck and Classic controllers for Virtual Console gaming (Virtual Console games and controller accessories sold separately). Other features of the Wii Remote include adjustable rumble force-feedback and a reinforced wrist strap to ensure safe use. A speaker inside the remote gives the player feedback about the strength of swings or the accuracy of their moves- such as realistic tennis noises as the \"racket\" connects with the ball inWii Sports. Overall, the physical design of the remote is extremely sturdy and of very high quality, ensuring countless hours of Wii gaming fun!", "price": 25.39, "imUrl": "http://ecx.images-amazon.com/images/I/31zy-i3HFML._SY300_.jpg", "related": {"also_bought": ["B0094X2066", "B000IMYKQ0", "B001GIUWX0", "B0009VXBAQ", "B0013B30SY", "B002BRZ9G0", "B001PO2BJI", "B0017Q4DGI", "B004VPRY04", "B002GEKIOG", "B001TOQ8NO", "B004IK24MU", "B00D7UHT0E", "B001UAAX60", "B003Y5SSGG", "B000LSJKAM", "B000LFJNF2", "B00BXGY9SY", "B000IN0BSU", "B004W1IX1G", "B0086V5UF0", "B000FQ9QVI", "B003ZHMMEM", "B003DSAT0C", "B004WLRR4K", "B00AFYAUYW", "B0045F8QDE", "B000R9A9JG", "B0013OL0BK", "B002I08DQI", "B004N3FGHC", "B000QD7BBM", "B0000E5U6I", "B0053BG26C", "B00293IKQC", "B0013E9HP6", "B004WLRQCI", "B004Y2VAVS", "B004MNDCTC", "B003ANMB6A", "B000OFSBL6", "B005FYJA52", "B003F5JI0U", "B0049WQPOK", "B004WLRQ2S", "B000FQ9YB0", "B00DC7G2W8", "B000XJNTNS", "B006TSI5EK", "B0094X1ZXU", "B0050SVFB0", "B002D2Y3IS", "B009M72E5Q", "B0018QOWEU", "B0094X28J0", "B005IGPY48", "B0011E4J2Y", "B0016JX2HW", "B002RD2WJ0", "B003ZCH7DI", "B00B47WVLE", "B001COQW14", "B007BKMGEU", "B0045FEE3A", "B002WZH9HS", "B0050SVGU0", "B004JKZUJI", "B00170UDHM", "B00G0OYHCW", "B000NNDN1M", "B0019AE9C0", "B0041NGO48", "B002MGPAKU", "B00G314M5O", "B0081AWU4A", "B0088I8M10", "B002L93F0A", "B001AI7CF2", "B0056GJVQW", "B004NT9WU8", "B00BS520SG", "B002P4KXFG", "B002K9VIAU", "B007PY3ZPG", "B004V13D0I", "B003P8O16S", "B00B0D0GMI", "B006AN894U", "B0026IUSXI", "B000R3BNDI", "B00A878J5I", "B0041TBNBQ", "B003S2JI6O", "B002B7E3B2", "B000ZKBJYG", "B002MWSY3O", "B000M5ZIVY"], "bought_together": ["B0094X2066"], "buy_after_viewing": ["B0094X28J0", "B004N3FGHC", "B001GIUWX0", "B002D2Y3IS"]}, "salesRank": {"Video Games": 501}, "categories": [["Video Games", "Wii"]]}