{"asin": "B000MD40N8", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]], "description": "The Sansa Express MP3 Player is the world's first cable-less, flash-based MP3 player with a microSD expansion slot.  It includes an FM tuner, a built-in microphone, voice and radio recording, a bright four-line OLED screen, and intuitive controls for quick navigation.Everything you need to enjoy digital music.No cables necessary.Compact design to go anywhere you go.Fits Any LifestyleThe Sansa Express connects directly to your computer's USB port. That means no extra cables to add to your already-cluttered desktop (if you do require a cable, an extension USB cable is included). Weighing less than an ounce and about the size of a pack of chewing gum, the Express can easily go anywhere you go.Full-Featured MP3 PlayerThe Sansa Express supports MP3, WMA, protected WMA, WAV, and Audible file formats. It includes 1 GB of flash memory, along with a microSD slot to expand your capacity and provide music portability. It also supports most subscription music stores.Enjoy FM Radio--Now or LaterThe Sansa Express features a digital FM radio tuner and the ability to record radio broadcasts. Keep that interview or song for later reference. Program up to 20 of your favorite stations as presets.Voice RecordingHave a thought you need to get down before it evades you? Use the built-in microphone to record voice memos. Capture interviews, classes, short notes to yourself, or anything else you might feel inspired to record.Sweet SimplicityOnce connected to your computer, the Express is detected by your operating system and appears as additional drive. Simply drag and drop your music files to the Express and you're ready to go. The lithium polymer battery is also recharged while the device is connected, giving you  up to 15 hours of use at full capacity. The device is compatible with Windows XP and Vista, and requires Windows Media Player 10 or later.What's in the BoxSansa Express Player, Headphones, Lanyard, USB Extension Cable, and Quick Start Guide.", "title": "SanDisk Sansa Express 1 GB MP3 Player (Black)", "price": 76.5, "imUrl": "http://ecx.images-amazon.com/images/I/31n3MgdvT0L._SX300_.jpg", "brand": "SanDisk", "related": {"also_viewed": ["B002MAPT7U", "B000IM9542", "B000IM5GBS", "B0076HNNHM", "B000BP50AY", "B0001F22R8", "B00BEWDP2I", "B00HCMZ0OK", "B000BONJXU", "B005FVNH04", "B0013N5PFI", "B005FVNGRS", "B002MAPRYU", "B0035PBHRM", "B009PO32AM", "B00D1ZXVDY", "B00CE3YJCQ", "B00AF40U5G", "B000RN62LG", "B007B5TQQG", "B00HCMZ2SE", "B00B8O44P4", "B00400TGEC", "B00HCMZ19Y", "B00BTLN5OC", "B009IJE2SU", "B002MAPS6W", "B004COIBFG", "B002MAPSC6", "B000BP8AY2", "B001525KB6", "B000VIHFZ4", "B005FVNGS2", "B007V7XQ7E", "B00AF5AC9Y", "B000EUCMWK", "B005FVNGRI", "B000RN1RXO", "B005FVNGZA", "B004S464WM", "B005FVNGZK", "B0041G62R4", "B00ECQUY2M", "B0041G62TW", "B000H24M4Q", "B00066EK3G", "B00BG13P9K", "B00AQRXEPK", "B00HCMZ4H8", "B0015L451I", "B00IH4R306", "B004M8SSTG", "B00HCMZ4Z0", "B002MAPSQM"], "bought_together": ["B000JLP5UK"], "buy_after_viewing": ["B002MAPT7U", "B005FVNGRI", "B003VKZEL6", "B002MAPRYU"]}}