{"asin": "B002BSC4RQ", "description": "His body imbued with the power of crystals. He controls magic beyond our knowledge. He possesses abilities greater than ours and powers that can cause us grievous harm. Is he a savior, or is he damned...? He is...a crystal bearer.Immerse yourself in a variety of motion-driven gameplayView larger.Discover the secrets of a fully interactive worldView larger.Unleash Layle&rsquo;s crystal bearer powers over gravityView larger.StoryA thousand years have passed since the events of the original FINAL FANTASY CRYSTAL CHRONICLES. The destruction of the Yuke Crystal during the Great War had at once brought the victorious Lilty Tribe prosperity, the defeated Yuke Tribe apparent annihilation and the world a new age of science and reason. In this new era exists a rare breed of powerful beings called \"crystal bearers,\" whose seemingly magical abilities have led them to be feared and scorned by the public. The young mercenary Layle is one such crystal bearer, who has been hired to escort the new passenger airship Alexis, the pinnacle of Lilty technology and a symbol of their current dominance. However, when the Alexis is suddenly besieged by a horde of monsters, Layle comes face-to-face with an adversary thought to have vanished from the pages of history that's on a quest that may threaten the future of the world.GameplayFINAL FANTASY CRYSTAL CHRONICLES: THE CRYSTAL BEARERS provides a fresh take on the FINAL FANTASY CRYSTAL CHRONICLES series as it combines the storytelling depth, expansive world and graphical quality of FINAL FANTASY with motion-driven, real-time action gameplay. In this world, realistic gameplay and fantastical art direction are brought together for a truly unique experience for Wii users around the globe.FeaturesEnjoy a new chapter of the series that takes place a thousand years after the events of the original FINAL FANTASY CRYSTAL CHRONICLES, where technology has advanced to its peak and magic is considered tabooEncounter the first FINAL FANTASY game developed exclusively for Wii, complete with motion-driven gameplay and intuitive controls that are accessible for gamers of all levels. Enjoy a variety of actions including flying and third-person shooter style gameplayStep into the hero's shoes and experience the action first-hand! Control Layle's crystal bearer powers to battle adversaries, navigate through obstacles and move objects at will in a highly interactive environmentTraverse the terrain, swing from high places or take a swim in a world in which all areas are open for explorationWith an extra remote, friends and family can jump in to assist the player in times of need in special areas of the game", "price": 21.0, "imUrl": "http://ecx.images-amazon.com/images/I/51WBxDNes8L._SY300_.jpg", "related": {"also_bought": ["B001NJPI0Y", "B0016OVBG6", "B0015HZLVK", "B0010YOQIC", "B001NJRR7G", "B001NCARPW", "B007CSF3GO", "B002E6XY6U", "B0010YOQIM", "B00009WAUH", "B002D2DQL8", "B002EE7OKE", "B001HB7KAO", "B00B2QL2Y4", "B002BSC4ZS", "0744011884", "B0058VI0G2", "B00KWEHBAG", "B000SSQPU8", "B0026IUSXS", "B001HB7K6I", "B001A01FD0", "B00JQI471A", "B002BRYXOO", "B003O8EDUS", "B001COVME6", "B002BRZ9AG", "B00KVRK39A", "B000P297F2", "B000R3BNHE", "B000G7PMX2", "B004WLRQMI", "B003JD7QYI", "B000Z9A95M", "B000GABOTU", "B007RNWUC4", "B001TOMR0C", "B002BSC54I", "B002EE5SAC", "B0020H46D8", "B0019SY1D4", "B002BVQNPW", "B00J6DLPLK", "B00269DXR0", "B00KWJ4JW4", "B00269DXXO", "B002DC8GWC", "B001TOMQVC", "B000P46NKC", "B00149IL9I", "B003K18LT8", "B000FDOTIQ", "B001TOMR6Q", "B000NKPFFM", "B00I3DOZ8O", "B008171AZ8", "B001C58T46", "0804163448", "B006QRNKOO", "B00B59L9YG", "B003ZCH7DI", "B000NJH6ZA", "B001TKK3NE", "B00149NCYW", "B001HKPUKC", "B00897Z218", "B00184219U", "B000R4809W", "B000ZK695U", "B009EWHKAI", "B00H51BJBG", "B002I0EH6I", "B00JKM09Z0", "B002TLTBN0", "B002HJQSQW", "B003O6JIVE", "0804162867", "B00K85X1W6", "B00KWFCU4M", "B000F5IH2I", "B000U34SYQ", "B002I0GEXM", "B0050SVH18", "B000SSPH3E", "B004LLRYOY", "B005FYJA52", "B002DC8GWW", "B000NPOGWK", "B000FQBPDU", "B00K2O4O6U", "B007R4X3AG", "B000NPTOTK", "B002BRYHY0", "B0030GBU8W", "B000X25GW2", "B009CLBY0I", "B0001A86EG", "B002X9KYD4", "B00HHIPQ98"], "bought_together": ["B001NJPI0Y", "B0016OVBG6"], "buy_after_viewing": ["B007CSF3GO", "B002E6XY6U", "B00009WAUH", "B00B2QL2Y4"]}, "salesRank": {"Video Games": 11307}, "categories": [["Video Games", "Wii", "Games"]]}