{"asin": "B00CRKHGUS", "categories": [["Beauty", "Hair Care", "Styling Tools", "Irons", "Flattening Irons"]], "description": "Silky smooth hair is the ultimate achievement for your hair!Solid Tourmaline Ceramic plates protect your hair and leave it silky smooth,\nYou won't believe how silky smooth your hair will be, no more pinched hair from low quality metal plates. \nTourmaline ceramic is the way to go!\nDigital temperature control makes sure the temperature is set precisely for YOUR hair. No more 1 to 10 temperature adjuster, too cold one moment, too hot the next. Temperature will be displayed precisely for maximum results!\nGive your hair the quality it deserves with ISA Professional Tourmaline Ceramic hair products. Your loved ones will certainly notice!* 100% Solid Tourmaline ceramic plates* Neon background LCD display* Digital Temperature control 80 - 220 Celsius = 175 - 425 Fahrenheit* 45 Minute Auto shut off safety feature* Fast and safe straightening, curls, waves* 360 degree no tangle cord* Full 2 year warrantyThe ISA Professional Tourmaline Ceramic Hair Straightener has heating plates made from 100% solid ceramic which enables salon quality hair straightening at home. Unlike metal or ceramic-coated plates, our 100% solid ceramic plates transfers heat faster and more evenly, for perfect results each and every time.The Neon background LCD display and high tech Digital temperature controls allows you to set any temperature between 80 and 220 degrees Celsius = 175 to 425 Fahrenheit. This is the best and most accurate control on the market. The unique shape of the ISA Professional Hair Straightener does more than just straighten your hair. You can also shape your hair into bouncy curls or glam waves with just the flick of your wrist. Beautiful and so simple!We guarantee this salon quality professional product for 2 years. Questions? Please contact us.", "title": "ISA PROFESSIONAL FLAT IRON HAIR STRAIGHTENER DIGITAL 1&quot; TOURMALINE CERAMIC 2 YEAR WARRANTY - Professional Salon Quality 100% Solid Tourmaline Ceramic Pivoting Plates Neon background LCD display Digital Temperature Control 80 - 220 Celsius (175 to 425 Fahrenheit) Fast and Safe Straightening Curls and Waves Auto shut off Safety Feature THE BEST FLAT IRON HAIR STRAIGHTENER", "price": 94.5, "salesRank": {"Beauty": 4278}, "imUrl": "http://ecx.images-amazon.com/images/I/519M2iEtNyL._SY300_.jpg", "related": {"also_bought": ["B007QCI1II", "B00BR3I7XQ", "B00GCJM24A", "B00BLIMB2U", "B00DQ69Q7S", "B00801FCVS", "B001UHN0I6", "B00E6D6LQY", "B00BGN8PLG"], "also_viewed": ["B00L3IWTMU", "B00H1NWX8Q", "B00CFRBIC0", "B007ZXR4I6", "B00GVDUS0W", "B003H0U5BY", "B00B2WYA2Y", "B00F9YDA2W", "B00LZW59YO", "B00455KQN2", "B0072CTTBA", "B00EAOWSD4", "B002SIY98Q", "B00JX7V8PM", "B00B76ALVO", "B003ZZBINA", "B00EM89DQI", "B00B1I5RUS", "B00BLIMB2U", "B00GZW35U4", "B004VWCEDE", "B000N8K8RY", "B00H4B37IA", "B000PT08RQ", "B001LF4I8I", "B00AZTEX04", "B00FW0YB7Q", "B00GM7PGDQ", "B003MY14J2", "B00CYDSAO4", "B00F5GI37G", "B00BB8ZIRK", "B007E0FQ1W", "B00EHDB0G4", "B003CIOTDG", "B0009V1YR8", "B00ANW4LLY", "B002LIXTFC", "B005NLOLLU", "B008U5XS2O", "B003AJJTXM", "B00L3KPPRE", "B004EE1EC6", "B00GM7BAIQ", "B0092XDZMQ", "B0072CT816", "B0068YVVKK", "B002NGMEV2", "B003ES7GRA", "B00455F1Z0", "B00E6DBRDG", "B002N0U37A", "B00BWO5IO6", "B002TNJ6V0", "B00196NQC8", "B002NGMF6Q", "B00ISJK3N4", "B003IQN46A", "B003TMLSFM"], "bought_together": ["B001UHN0I6"]}}