{"asin": "B001EQ4C4E", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The sleek design of the PowerShot A1000 IS is as refreshing as a breath of fresh air. Better still, its high-end features make everything simple: there&rsquo;s the 10.0-megapixel resolution and powerful 4x optical zoom lens with Optical Image Stabilizer for sharpness along the full zoom range. A DIGIC III Image Processor with Canon Face Detection automatically lets every face stand out. Easy Mode and Easy Playback make this camera a marvel of simplicity.PowerShot A1000IS Highlights10.0 Megapixel resolutionWith the PowerShot A1000 IS, dramatic, personal pictures have never been easier to shoot and share. This 10.0-megapixel camera lets you create impressive large photos of family and friends you&rsquo;ll be proud to display. The high-resolution images taken by the A1000 IS can be enlarged up to 13 x 19 inches.New slim design with a 4x Optical Zoom with Optical Image StabilizerThe PowerShot A1000 IS has a 4x optical zoom lens that makes it easy to get the inspiring, emotive close-ups that will make your images lasting keepsakes. This magnificent lens gives you the power to shoot distant subjects with razor-sharp precision and stunning lifelike color, so you can brilliantly capture a bird high atop a tree, a child&rsquo;s winning goal from across the stadium or a school play from the last row. Plus, thanks to Canon&rsquo;s highly sophisticated Optical Image Stabilizer technology, even at maximum zoom, every image is rock steady.The A1000 IS is equipped with Canon&rsquo;s acclaimed Optical Image Stabilizer Technology that automatically detects and corrects camera shake -- one of the leading causes of fuzzy or blurred shots. Even when zoomed in, you can get the steady, crisp, brilliant images you&rsquo;ll be proud to shoot and share. And Canon&rsquo;s Optical Image Stabilizer Technology is so convenient to use, it functions perfectly with or without a flash.High-quality 2.5-inch LCD and optical viewfinderThe PowerShot A1000 IS&rsquo;s 2.5-inch LCD screen gives you the big picture, whether you&rsquo;re shooting, reviewing or showing off your images. This high-resolution screen offers a crisp, clear and bright picture. It also features Night Display for easy viewing in low light.DIGIC III Image Processor with Genuine Canon Face Detection AF/AE/FE/WBWith DIGIC III, your images boast superior quality, the camera operates at top efficiency and battery life is enhanced. What&rsquo;s more, DIGIC III enables Canon&rsquo;s Face Detection, Motion Detection Technologies and Red-eye Correction to give you better, more true-to-life people shots. Simply press the shutter button halfway down, and the camera automatically pinpoints the faces in the scene and chooses the ideal focus point. The camera controls exposure settings and flash to keep every face looking bright and natural. The camera also selects and sets the optimal exposure and ISO settings automatically to keep everything looking sharp and clear. Red-eye Correction can be handled in-camera, in two ways. The Red-eye Correction during shooting uses the Face Detection Technology to recognize and remove red-eye from images as they're taken, before the file is written to the memory card. It's also possible to correct red-eye during image playback, using simple settings in the PowerShot A1000 IS's menu.iSAPS Technologyis an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the fast DIGIC III Image Processor to improve focus speed and accuracy, as well as exposure and white balance.DIGIC III features Face Detection technologies, giving you the best possible results in any shooting situation. Face Detection AF/AE sets the focus point and exposure for the faces of your subjects. Face Detection FE adjusts the flash to correctly illuminate your subject to provide the best balance between your subject and the overall scene, eliminating the common problems of over and underexposed faces. Face Detection WB means the camera concentrates upon faces when calculating white balance for the best possible skin tones. Face Select and Track lets you highlight one face among several in a scene, and the camera concentrates on that person, even as they move around the scene. Face Detection Technology is a powerful contributing factor in Canon's Motion Detection Technology. Simply press the Face Selector Button, then the selected face is double-framed and tracked when the face moves in the frame.Motion Detection Technologyworks in the background to instantly evaluate how fast your subject is moving. It automatically selects and sets the optimal exposure and ISO settings to keep everything looking sharp and clear. This feature provides higher ISOs when you need it for action-stopping shutter speeds. But when no movement is detected, it sets lower ISOs for excellent color and detail. Life doesn&rsquo;t give you second chances to capture special times. That&rsquo;s why the PowerShot A1000 IS features ISO 1600 and High ISO Auto settings that reduce the effects of camera shake and sharpen subjects in low-light situations, giving you greater shooting flexibility.Red-eye Correctionprovides three options for removing red-eye from subjects in flash pictures.1) The Red-eye Correction during shooting actually identifies and corrects red-eye in human subjects as pictures are taken.2) The A1000 IS can be set to automatically detect and correct red-eye during image playback.3) You can manually locate any red eyes in a scene during image playback on the LCD screen, and command the camera to remove them.Easy Mode and Easy Playback modeWhen you&rsquo;re taking pictures, the only thing you want to think about is your subject. That&rsquo;s why the PowerShot A1000 IS is equipped with Canon&rsquo;s Easy Mode that works in the background to handle all the technical details for you. Now you can relax and concentrate on choosing just the right angle, capturing the perfect expression, framing your shot perfectly. To make showing off your images just as carefree, the A1000 IS features the new Easy Playback mode that makes viewing single images and slideshows on the camera effortless -- even if you&rsquo;re new to digital photography! With 17 Shooting Modes including 8 Special Scene Modes, you&rsquo;re ready for whatever shot comes your way.Print/Share Button for easy direct printing and downloadingThe PowerShot A1000 IS's Print/Share button makes direct printing easier than ever. Simply connect the A1000 IS to a Canon PIXMA Photo Printer or SELPHY Compact Photo Printer or any PictBridge compatible photo printer, press the lighted Print/Share button and print! Also use the Print/Share button to transfer images to a computer (Windows and Macintosh). Print your own ID photos in up to 28 different sizes or use the Movie Print function to output multiple stills from a recorded movie on a single sheet with a Canon SELPHY Compact Photo Printer.What's in the BoxPowerShot A1000 IS BodyAA-size Alkaline Battery (x2)SD Memory Card SDC-32MBWrist Strap WS-800Digital Camera Solution CD-ROMUSB Interface Cable IFC-400PCUAV Cable AVC-DC400", "title": "Canon Powershot A1000IS 10MP Digital Camera with 4x Optical Image Stabilized Zoom (Grey)", "price": 149.99, "salesRank": {"Camera &amp; Photo": 7014}, "imUrl": "http://ecx.images-amazon.com/images/I/51LTWEEpg6L._SX300_.jpg", "related": {"also_viewed": ["B00AWYMXZY", "B0032JRRXE", "B004HW73SO", "B0075SUII4", "B0011ZK6PC", "B001SER4BK", "B00I58LVKC", "B004HW73S4", "B0011ZCDKS", "B0032JRRWU", "B00908BQCY", "B004HW73QG", "B0075SUIEI", "B0075T7NW2", "B0075SUG8Q", "B00I58LPYO", "B004HW73QQ", "B005I6DVC0", "B0032JRRX4", "B001G5ZTZO", "B00EFILR6E", "B0012YC7AE", "B0075SUG3Q", "B004HW73OS", "B000MFA1NE", "B001EQ4BZE", "B004HW73RA", "B0032JRRWK", "B000V1VG4W", "B000NK3H4S", "B0034XIMG4", "B0075SUFLE", "B00HLDFNKQ", "B00I58M192", "B000NK8EWI", "B000EMWBV0", "B0075SUFSC", "B001SER4AQ", "B000EMWBT2", "B0073HSIY8", "B006UMM15O", "B0075SUHGC", "B002LITT42", "B00728ZAFS", "B004J41T7Q", "B002LITT3S", "B0075SUJ4W", "B0075SUK14", "B005IGVXJS", "B000V1VG5G", "B003ZSHNGS"], "buy_after_viewing": ["B00AWYMXZY", "B007JRB0SS", "B007JRB0TC", "B003VNKNF0"]}}