{"asin": "B005F2AD3W", "description": "AINHOA is an award-winning series of professional beauty products for use in the comfort of your home.  Pleasurable, convenient, made from the highest quality ingredients, these are Spa-quality products at affordable prices. Ainhoa has been available in the worlds&#x2019; finest hotels and spas for over 15 years, offering luxurious treatments using their products.   Whether you want daily use products or an intense treatment, whatever your skin type; the stunning Ainhoa range has the right products for you.  Treat yourself today and enter the exclusive world of Ainhoa. LUXE GOLD is a very special facial range containing Gold and highly sought-after Caviar Extract in even greater concentrations, to pamper the skin and this combination of innovative ingredients provides anti-wrinkle, regenerative, revitalizing, oxygenating and lifting actions. Caviar Extract is regenerative and nourishing while Gold stimulates cellular oxygenation, lifts and provides light reflection. Caviar Extract is rich in vitamins A, D, B1, B2, B6 and the elements Cobalt, Copper, Phosphorus, Silicon, Zinc; as well as Amino-Acids Glycine, Lysine, Histidine, Arginine and Asparagine. Additionally sources of marine DNA, key to skin cell regeneration.  This potent combination intensifies the processes inside the skin cells and moisturizes, slowing down the aging process.  You will not find higher Caviar Extract concentrations even in products that cost hundreds of dollars more than LUXE GOLD. LUXE GOLD Facial Serum offers regenerative and moisturizing properties. When used day and night before applying face cream this light, absorbent serum contributes to accelerating the skin's recovery, renewing skin cells and regenerating tissue.  A truly wonderful product to compliment your current day and night creams. dry/dehydrated skins / expression lines. Ainhoa products which compliment this range are: LUXE Cleansing Milk, LUXE Facial Tonic, SPECIFIC Glycolic Acid, PLASTIC MASK Lifting Mask, any AINHOA face cream.", "title": "AINHOA Luxe Gold Facial Serum, 1.05 Fluid Ounce", "price": 67.9, "imUrl": "http://ecx.images-amazon.com/images/I/312r4tG0iQL._SY300_.jpg", "salesRank": {"Beauty": 829711}, "categories": [["Beauty", "Skin Care", "Face", "Oils & Serums"]]}