{"asin": "B009GF6F9U", "description": "Fintie, a quality product within your reach!The Fintie Folio Classic Leather Case offers secure protection for your tablet while adding a range of versatile options. A smart holder is designed to hold your stylus pen, while a soft inner liner and protective corners help safeguard the tablet against scratches and damage. The Fintie Folio Classic Leather Case comes in a variety of bright, fun colors, the widest selections to suite your taste. It offers an ideal way to protect your tablet wherever you go.PLEASE NOTE: This case is designed for Kindle Fire HDX 7\" only. It will not fit the original Kindle Fire, Kindle Fire HD 7 (2012 Release) or All-New Kindle Fire HD 7(2013 Release).Instructions:When inserting the All New Kindle Fire HDX 7 (2013 Model) into the case, please ensure to insert thecamera side firstso thepower button is on the top. It is also important to verify your All New Kindle Fire HDX 7 (2013 Model) screen rotation button displays \"Auto-Rotate\" to allow free rotation of the screen.To auto-rotate screen rotation:1.   Swipe from the top of the screen downward.2.   To lock or unlock, tap the screen rotation icon. This icon will be the first icon on the left.This product is sold exclusively by Fintie. Only buy from Fintie to get genuine Fintie(TM) products with manufacturer warranty and superb customer service.", "title": "Fintie Amazon All-New Kindle Fire HDX 7 Folio Case Cover - Auto Sleep/Wake (will only fit Kindle Fire HDX 7&quot; 2013), Dual Color", "price": 18.99, "imUrl": "http://ecx.images-amazon.com/images/I/514R%2BfdBCaL._SY300_.jpg", "related": {"also_bought": ["B00BWYQ9YE", "B00FGI3CBU", "B0098GT8NW", "B00DQGIHZ0", "B00FJ8JC8Y", "B00FZ9SM4M", "B009OB141A", "B0094MXKVQ", "B00FJ8JHYI", "B00FGF0LV2", "B00G01UNTQ", "B008HJGPVO", "B00DQZQ370", "B00CX5P8FC", "B00DQZQ2GM", "B00FGOLFZO", "B00E9YZBY8", "B00G0ETGVY", "B006GWO5WK", "B00G8B4JXE", "0615918735", "B00C5W16B8", "B00FFS3I7O", "B00DQZQ16S", "B00AJ9XTPA", "B00EXIGQFS", "B004GCJEZU", "1118772652", "B00CP82FG2", "B0098F5X0A", "B00E8ZDCDU", "B001F0RRUA", "B006GWO5NE", "B005OOKNP4", "B008QZTJH6", "B00DU0ZI8Q", "B003L1ZYYM", "B00FGI3E22", "B007VFR1XG", "B005QCDY50", "B008JW3HX8", "B00DQGIHNW", "B00BHJRYYS", "B004GF8TIK"], "bought_together": ["B00BWYQ9YE", "B00DQGIHZ0"], "buy_after_viewing": ["B00BWYQ9YE", "B00FGI3CBU", "B00FGF0LV2", "B00DQGIHZ0"]}, "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Cases & Sleeves", "Cases"]]}