{"asin": "B002MAPSDA", "categories": [["Electronics", "Home Audio", "Stereo Components", "Speakers", "Speaker Systems"]], "description": "The iSP110 from iLuv is a portable amplified speaker case, perfect for iPods, iPhones, and other MP3 players. Just throw your device in the case and take it anywhere--camping, to a picnic, or anywhere else you want some portable tunes.A portable amplified speaker case, perfect for iPods, iPhones, and other MP3 players.Click to enlarge.Most modern portable MP3 and music players will fit snugly in the iSP110's zipper case.Available in blue, pink, or black.iSP110 Portable Amplified Stereo Speaker CasePerfect for PortablesMost modern portable MP3 and music players will fit snugly in the iSP110's zipper case--iPods, iPhones, Zunes, and other MP3 players--so you should be set, whatever your preferred brand.Devices are connected to the speaker via a standard 3.5-mm input--just plug it in and you're ready to go. At just 0.44 pounds, the iSP110 shouldn't weigh you down.Louder Than You ThinkThe iSP110's powerful built-in speakers allow you to hear your music with depth and clarity, delivering 8.2 watts of loud, high-quality stereo sound through a pair of 1.25-inch speakers, so you can keep the party going.Battery-PoweredAll you need to operate the iSP110 is a pair of AA batteries (not included).Use store-bought rechargeables for a \"greener\" solution.Hanging ClipA handy hanging clip lets you snap the device to your backpack, belt loop, etc.What's in the BoxiLuv iSP110 Portable Amplified Stereo Speaker Case (pink) and user's manual.", "title": "iLuv SmashBox 3.5mm Aux Portable Speaker Case (Pink)", "price": 8.75, "imUrl": "http://ecx.images-amazon.com/images/I/41yhCuPueCL._SY300_.jpg", "brand": "iLuv", "related": {"also_bought": ["B002HPVFW8", "B0064YXAZS", "B00703BLCG", "B005DSN2XG", "B00CRWBGOI", "B0064YXEUY", "B004U2VV0M", "B004G5NC6E", "B00400TGEC", "B001VMAQ78", "B004Q1K78E", "B0041A75W6", "B005UWD2YY", "B00BCMI084", "B007MM3EXY", "B005SWTQUA", "B003Z9L38Q", "B009BKVYZK", "B003EM2WAW"], "bought_together": ["B002HPVFW8"], "buy_after_viewing": ["B00703BLCG", "B0064YXAZS", "B0064YXEUY", "B0041A75W6"]}}