{"asin": "B002X2F2N8", "categories": [["Electronics", "Car & Vehicle Electronics", "Vehicle Electronics Accessories", "Audio & Video Accessories", "Audio Car Mounts"]], "description": "The TomTom app is just the beginning. Combine it with the TomTom car kit for iPhone to experience enhanced GPS performance for the ultimate in-car navigation; from safe and secure docking all the way to taking calls on the move and playing your favorite tunes over your car stereo.Give your iPhone secure docking, hands-free calling, enhanced GPS performance, and more.Specially designed mount fixes your iPhone securely to your windscreen or dashboard.Built-in speaker for hearing instructions and mic for taking calls.Line-out plug and USB port for charging.Note: TomTom GPS application must be purchased separately. Requires compatible car audio system and audio cable.Secure DockingKeep your iPhone secure while you're on the move. Our specially designed award-winning EasyPort mount attaches your iPhone securely to your windscreen or dashboard--perfectly within reach. It lets you rotate the screen for exceptional widescreen route display. And it folds flat, so moving it from car to car is easy and simple.Enhanced GPS PerformanceDon't let a weak signal slow you down. The TomTom car kit boosts your iPhone's GPS signal, to ensure that you get the best possible navigation experience. Its built-in receiver increases the GPS performance of your iPhone to give you an incredibly reliable signal--even when driving in high-rise urban areas.Clear Voice InstructionsWith built-in volume controls and its superior speaker, you'll hear every voice instruction loud and clear--so you'll never miss a thing.Hands-free CallingReceive calls without taking your eyes off the road, using the car kit's built-in extra-sensitive microphone and speaker for crystal clear sound. And don't worry about missing a turn. The app automatically starts navigating again as soon as the call ends.Charges iPhone While DrivingAlways on the go? Dock your iPhone in the mount to charge it as you drive, so it will always be fully charged and ready to go, wherever you're going next.Rotates for Optimal PositioningView your route in either portrait or landscape mode. The TomTom car kit rotates easily, in order to give you the view you prefer.Line Out for Music Playback*Enjoy the perfect driving soundtrack. Play all your favorite songs through your car's audio system with the optional audio cable*. It even fades music out when receiving calls and giving directions.CompatibilityThe car kit will fit the iPhone, iPhone 3G, and the iPhone 3GS. Note: Requires iPhone OS 3.0 or later. Designed to work with the TomTom app for the iPhone and iPod touch.SpecsDimensions: 5.17\" x 2.70\" x 1.96\"Weight: 4.13 ozGPS receiver: SiRF star 3Hands free: Bluetooth CSR BC05MMSpeaker: 300 to 15 kHz/ 2.0 WattMicrophone: -44 +/- 3 dBvOperating temperature: 14 to 131 degrees FDock connector: 30 pin Apple connectorAudio out: 3.5mm audio outVolume control: YesPortrait/landscape support: YesWindshield and Dashboard mounting: YesiPhone charging via CLA: Yes*Requires compatible car audio system &amp; audio cable.What's in the BoxCar Kit for iPhone, USB Car Charger, Adhesive Disks, Docomentation", "title": "TomTom Car Kit for iPhone (compatible with iPhone, iPhone 3G, iPhone 3GS)", "price": 19.99, "salesRank": {"Cell Phones & Accessories": 212204}, "imUrl": "http://ecx.images-amazon.com/images/I/412IGqU-Q8L._SY300_.jpg", "related": {"also_viewed": ["B00A46PWCG", "B00A46PYHY", "B002WN30IM", "B003DQPE40", "B006M49G80", "B0033WSDV0", "B0035Y7ZJ2", "B00E65TNYE", "B00G2BX616", "B00D901B4W", "B009NLTW60", "B007FHX9OK", "B008IOQ3K6", "B006SU0SX0"], "buy_after_viewing": ["B007FHX9OK", "B00A46PWCG", "B0066BWMNU", "B008J0ZSTQ"]}}