{"asin": "B004FLJVXM", "related": {"also_bought": ["B00004ZCJJ", "B001GN3SGS", "B0009R5NN8", "B00004ZCEF", "B00BW6LW7G", "B00603RTDW", "B00DMFX570", "B00DMS0GTC", "B002KEYYE2", "B001PKY2J4", "B001KNAZY2", "B00005061L", "B00603RU9A", "B00BW6LXHA", "B001G7PIBC", "B008XXC2CA", "B009IY3U3I", "B0071RSIPO", "B0000BZL7S", "B00D6JWHWG", "B00009R6KK", "B00006I5WP", "B002L7FOX8", "B00955MQL2", "B00DMS0NGS", "B00I4DXDFE", "B00I4DXE2G", "B0040JHVCC", "B00603RXMO", "B007SXJ2DS", "B00393THEK", "B00603RZCM", "B007M54E1M", "B006Y0YZZ6", "B0054RJ870", "B0000BZL78", "1285765265", "0133571254", "B00AA48E90", "B0083WYDRI", "B004M170YC", "B0049XGNKK", "B0058I7CVE", "B001KELVS0", "B0083Z6R4W", "1118722965", "B00I4A9VVC", "B001LMU78G", "B00DQXJM6Q", "B00CXB63QO", "B00BCEJ0E0", "B00H0B98XC", "B006JOG3AC", "B00CJ0X30S", "B008BURQNK", "B00F36K5Q0", "B00370WU2G", "B00004WCGF", "B004ZIMU7Y", "B001UE6N7Y", "B001TZUS98", "B0055I2K9G", "B004MFQ2I8", "B009GYIJ3Q", "B0040X4PUE", "B00009R9BT", "B00004ZCJM", "B00004ZCI3", "B00007E7JU", "B004VTAVLE", "B0080JH3YE", "B00FP1BQ1Q", "B008H3XZAO", "B003Y06336", "B00004WCID", "B003Q9RERY", "B007FH1KX2", "B00DZIFWRU", "B0062C4KQU", "B00FFZM8RI", "B00009XVCZ", "B00004ZCEQ", "B007M54E08", "B00DR8SGQW", "B00009UTQL", "B00570DFYQ", "B0062W02C6", "B00HS8ZFXO", "B00FW6TN3M", "B0010F4L40", "B0081SS5C8", "B00004ZCJI", "B00CV9MK4W", "B007NDL56A", "B008MWBY6W", "B003YH9DZ4", "B00EN1HIAC", "B00D6S126E"], "bought_together": ["B00004ZCJJ", "B001GN3SGS"], "buy_after_viewing": ["B00004ZCJJ", "B008B48AAE", "B00004ZCEF", "B001GN3SGS"]}, "title": "Tamron AF 18-270mm f/3.5-6.3 VC PZD All-In-One Zoom Lens for Canon DSLR, Model BOO8E Filter Size 062mm", "price": 449.0, "salesRank": {"Camera &amp; Photo": 575}, "imUrl": "http://ecx.images-amazon.com/images/I/51zEe66bLCL._SY300_.jpg", "brand": "Tamron", "categories": [["Electronics", "Camera & Photo"]], "description": "pzd-newThe acclaimed Tamron 18-270mm VC ultra zoom for APS-C format DSLRs has reached an astonishing new level of compactness, performance, and speedwith the addition of PZD (Piezo Drive), an innovative ultrasonic autofocus motor based on an advanced piezoelectric design. The result is a lens that's considerably lighter, and noticeably shorter and slimmer (filter diameter: 62mm) than any previous lens in its class, and provides faster, quieter auto-focusing.Signature features that have made this amazingly versatile lens the world standard in its class have been retained. They include a 28-419mm equivalent (15X) zoom range, an improved, lightweight, compact Vibration Compensation (VC) system, macro focusing to 0.49m (19.3 inches) throughout, and, of course, superlative imaging performance.&nbsp;Technical SpecificationsFocal Length: 18-270mmFormat Size: APS-C Di-IIMaximum Aperture: F/3.5-6.3Diagonal Angle of View: 75&deg;33' - 5&deg;55'Lens Construction: 16 elements/13 groupsMFD/Max. Mag. Ratio: 19.3\" / 1:3.8 (at f=270mm)Filter Diameter: 62mmOverall Length: 3.5\"Maximum Diameter: 2.9\"Weight: 15.9 oz.Diaphragm Blades: 7Standard Accessory: HoodPiezo Drive (PZD) Ultrasonic Autofocus Motor&nbsp;Ultrasonic motors are divided into two categories depending on the principle that generates the energy to move the drive: traveling wave motors and standing wave motors. Traveling wave motors include the ring type ultrasonic motor used in the recently launched 70-300mm F/4-5.6 VC USD as well as other lenses, but this lens employs a newer technology, the PZD (Piezo Drive), which functions on the standing wave principle.A standing wave ultrasonic motor utilizes high-frequency voltage to extend and turn the piezoelectric (piezoceramic) element, thus moving the entire element in a standing wave movement. The metal tip is the contact point of the element to the rotor, and moves in an elliptic motion from the swiveling motion of the moving element, and the friction from this motion turns the rotor. Standing wave ultrasonic motors have the distinct advantage of being smaller than their traveling wave counterparts, and therefore allow a more compact SLR lens size.PZD Technology DiagramDi IILenses are designed for exclusive use on digital cameras with smaller-size imagers and inherit all of the benefits of our Di products. These lenses are not designed for conventional cameras and digital cameras with image sensors larger than 24mm x 16mm.15x Zoom RatioThis lens covers an extremely broad range of focal lengths, from an extra-wide 18mm length to a telephoto 270mm length (the 35mm equivalent of 28mm to 419mm). The resulting 15x zoom ratio is the world's largest, representing a wide cross section of Tamron high-power zoom design technologies. Plus, the vibration compensation works throughout the entire zoom range, giving you the freedom to create a wide variety of images. The lens lets users capture once-in-a-lifetime panoramic landscape images or close-up pictures of children smiling, all without getting too close to the subject or changing lenses. Other details include a macro magnification range of 1:3.5, a minimum focusing distance of 19.3 inches, and a 72mm filter diameter. The lens, which measures 3.1 inches in diameter and 3.9 inches long, carries a six-year warranty.18mm zoom - 270mm zoomVibration Compensation (VC)Shake can ruin your photos, particularly when taking telephoto shots or shooting in low light conditions.Simply flip the VC switch on and you'll notice the difference immediately.VC delivers blur free - handheld images for incredible resultsVC mechanism employs a three-coil systemLens element compensates for vibration using 3-steel balls (making movement quiet &amp; smooth)Exceptional images at slower shutter speeds &ndash; reduces the need for a tripodBring out contrast to motion &amp; stillnessEliminate the need to shoot with a FlashVC Off - VC OnLow Dispersion (LD) Glass for Greater Lens SharpnessAdd sharpness to your image with Low Dispersion (LD) glass lensesLow dispersion (LD) glass elements in a lens help reduce chromatic aberration; the tendency of light of different colors to come to different points of focus at the image plane. Chromatic aberration reduces the sharpness of an image, but glass with an extremely lowdispersion index, has less of a tendency to separate (defract) a ray of light into a rainbow of colors. This characteristic allows the lens designer to effectively compensate for chromatic aberration at the center of the field (on axis), a particular problem at long focal lengths (the telephoto end of the zoom range), and for lateral chromatic aberration (towards the edges of the field) that often occurs at short focal lengths (the wide-angle end of the zoom range.)Internal Focusing (IF) SystemInternal focusing provides numerous practical benefits to photographers including a non-rotating front filter ring that facilitates the positioning of polarizing and graduated filters, and more predictable handling because the lens length does not change during focusing. Even more important, Tamron&rsquo;s Internal Focusing (IF) system provides a much closer minimum focusing distance (MFD) throughout its entire focusing range. In addition, IF improves optical performance by minimizing illumination loss at the corners of the image field, and helps to suppress other aberrations that become more troublesome at different focusing positions.Zoom Lock (ZL)Another original Tamron mechanical engineering concept is the Zoom Lock (ZL), a simple convenience feature that prevents undesired extension of the lens barrel when carrying the camera/lens unit on a neck strap.Anomalous Dispersion (AD) for Better Color CorrectionAnomalous DispersionAnomalous dispersion (AD) glass is a special type of optical glass that is used to achieve more precise control of chromatic aberrations, thereby enhancing overall imaging performance. Glass of this type provides an abnormally large partial dispersion ratio (amount of diffraction) for light of specific wavelength ranges (colors) within the visible spectrum. By combining AD glass having these special characteristics with elements made of normal glass having different dispersion characteristics, it is possible to control the dispersion factors of a specific wavelength. This enhanced level of control results in much lower levels of on-axis (central) chromatic aberration for telephoto lenses (or zooms used at tele-photo settings) and a significant reduction of lateral (peripheral) chromatic aber-ration for wide-angle lenses (or zooms used at wide-angle settings.)Aspherical Lens Elements (ASL)Tamron uses several hybrid Aspherical lens elements in many lensesAchieve the ultimate in image quality with Aspherical Lens Elements (ASL)bearing the Aspherical designation. These innovative optics allow us to achieve the ultimate in image quality, and at the same time produce lenses that offer remarkable zoom ranges in extraordinarily compact packages. By perfecting theses cutting-edge advances for series production, Tamron has advanced the state of optical design, and virtually eliminated spherical aberration and image distortion from the high-power-zoom series.Through the effective application of Hybrid Aspherical Technology, one lens element can take the place of multiple elements without compromising performance. This is what allows us to produce remarkably compact long-range lenses that deliver a uniformly high level of image quality at all focal lengths and apertures."}