{"asin": "B001EKABK4", "categories": [["Electronics", "Computers & Accessories", "Computer Components"]], "description": "Amazon.com Product Description The HP Photosmart C6380 All-in-One Compact Color Inkjet Printer, Copier, And Scanner is capable of printing at speeds of up to 33 ppm in black &amp; white and 31 ppm in color. Enjoy freedom from messy cables and wiring with the C6380's built-in Wi-Fi and optional Blue tooth capabilities. The C6380 is also capable of printing up to 8.5 x 11-inch borderless photos that feature vivid color and stunning 9600 x 2400 dpi resolution from supported memory cards or PictBridge compatible digital cameras..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; } img.withlink {border:1px black solid;}The HP Photosmart C6380 offers:The ability to Print, Copy, and ScanPrint and copy speeds up to 33 ppm black &amp; white and 31 ppm colorBuilt-in Wi-Fi and optional Blue tooth capabilitiesHigh-resolution color prints of up to 9600 x 2400 dpiA 125-sheet paper tray and 20-sheet photo trayThe HP Photosmart C6380 is a compact multifunction printer.View larger.Aa color preview screen makes it easy to print directly from memory cards.View larger.Print Crisp, Colorful Photos and Image-Rich DocumentsNot only does the HP C6380 print colorful photos and documents at speeds reaching as high as 31 ppm, but it also makes the quality of the imagery a priority, with its use of HP Vivera Inks and five-color ink process that produces lap-quality photos and laser-quality text.With the HP C6380, you can print directly from a variety of supported memory cards, including CompactFlash, Memory Sticks (Duo), SD Card, SDHC Card, MMC,xD-Picture Cards. No need for the computer; just plug-in a compatible memory card and use the colorful 2.4 inch LCD screen to help guide you through the printing process, or just plug in your PictBridge digital camera to print directly.Wireless Networking Made EasyHp is a leader in wireless printing, and they make it easy to configure your wireless network. The C6380 features built-in 802.11 b/g Wi-Fi connectivity for networking laptops and desktop computers to a single printer without having to use messy cables, and HP's step-by-step instructions will guide you through this simple process.Color Copy and Scan With EaseThe C6380 features easy one-button copying in both black &amp; white and full-color with ultra-high resolution of up to 600 x 600 dpi and 9600 x 2400 dpi respectively. It will make as many as 50 copies with the push of a button at speeds of up to 33 cpm in black &amp; white and 31 cpm in color. Reduce or enlarge originals from 50&#37; to 400&#37; for added versatility.You get a full-color preview of your scan before you actually decide to scan the document, which can be as large as 8.5 x 11.7 inches in size. Once you decide to scan, it will be quick; it takes a matter of seconds to produce full-color images up to 4800 dpi in dynamic 48-bit color. Use the included software to enhance a scanned image or document to an unbelievable 19,200 dpi for producing large-scale prints and digital documents.Versatile Paper HandlingThis printer will handle a variety of special media, including cards, envelopes, transparencies, and photo paper at sizes as large as 8.5 x 14 inches. The C6380 comes equipped with a 125-sheet paper tray and a convenient 20-sheet photo tray.Compatible with both Windows (including Vista) and Macintosh, the HP Photosmart C6380 measures 17.79 x 15.97 x 8.17 inches (WxDxH) and weighs 16.4 pounds. It's backed by a 1-year limited warranty that includes phone support.What's in the BoxHP Photosmart C6380 All-in-One Printer, power cord, power supply, print head assembly, HP 564 black cartridge (approx. 250 pages), HP 564 photo black cartridge (approx. 130 photos), HP 564 cyan, magenta, and yellow cartridges (approx. 300 pages each), software, media sample pack, set-up and basics guides.", "title": "HP Photosmart C6380 All-in-One Printer", "price": 356.91, "imUrl": "http://ecx.images-amazon.com/images/I/41i0o%2BGOL-L._SY300_.jpg", "brand": "HP", "related": {"also_viewed": ["B009JHIREG", "B0047IWQ1M", "B002RZ1XWU", "B008DWCFVY", "B0052USOE2", "B0017OCLOQ", "B008FCAA2S", "B0094V8B8O", "B000UY6M2G", "B001F0R14C", "B005DZNLWQ", "B002GWVZHW", "B000P6L92C", "B000FJLBU4", "B005O55T98", "B003VL3ZJ8", "B001EHAKSK", "B00DGHO3NY", "B008BNU9O0", "B001ULDAKA", "B000GWMJVA", "B002FB63EO", "B00AAW79IO", "B002MCZIUG", "B008TYHS3G", "B000I3IXLC", "B003YTATLO", "B0036TGGJG", "B00CIDHSS4", "B00188K75Q", "B00J8NBVYE", "B00847V1EA", "B00E5TQ592", "B004TTVV0G", "B000B63RJE", "B000UY3O22", "B000RQ1OYI", "B000B61X1S", "B004TTXA50", "B0002MKC9A", "B00191TTGA", "B0027ISA2S", "B008HSJD50", "B00J9E68E0", "B000RQSGYO", "B0040XYTIW", "B00367GPC6", "B009WTF0XM", "B003YH3PAI", "B000CO9ZMI", "B009SM8GYS", "B007UR0UZG", "B003F6G6O0", "B00EANURCE", "B00FIKD50O", "B001B19XPA", "B00191RKGQ", "B00J9E68B8", "B00CIDQ470", "B0091UBCAW"], "bought_together": ["B002YA5COS"], "buy_after_viewing": ["B0047IWQ1M", "B009JHIREG", "B002RZ1XWU", "B008DWCFVY", "B008DWCFVY"]}}