{"asin": "B00191PKJK", "description": "The newest generation of its popular Eee PC line, the Asus Eee PC 900 provides the power of a full-sized laptop in a compact body with a larger 8.9-inch screen. Even with the larger size of the Eee PC 900 when compared to the original Eee PC, the new model still weighs under 2 pounds--perfect for students toting to school or road warriors packing away to Wi-Fi hotspots. And because it uses flash memory instead of a hard drive (with 20 GB of storage), the Eee PC 900 is optimal for weathering rough handling and sharing space in overstuffed bags.The Asus Eee PC 900's 8.9-inch screen is easier on the eyes, and the integrated webcam makes video chats a snap.Other features include a 1.3-megapixel webcam integrated into the bezel above the LCD, a Secure Digital memory card slot, Wi-Fi connectivity (802.11b/g), multiple USB ports, and a VGA output for connecting to a monitor. It comes preinstalled with the Linux operating system, and it's also compatible with the Microsoft Windows XP operating system.For the students and professionals, the Eee PC comes with a powerful selection of software to maximize personal productivity--over 40 built-in applications. The Open Office suite of software enables the user to open, edit and create documents, presentations, spreadsheets and databases that are compatible with Microsoft Office. For journalists, photographers and other professionals who need to use a computer in the field to create, to communicate and to collaborate with other colleagues, the Eee PC's combination of power, extreme portability and rugged build makes it the ideal computing solution.No technical manual required with the specially designed, user-friendly, and intuitive graphic interface..It's also a great choice for young students, with a built-in Dictionary that's great for homework, and it includes two modes of intuitive graphic user interface design to accommodate both experienced and inexperienced PC users. The Eee PC also handles your digital images, movies, and music as well as Internet radio.Nicely light at just 35 ounces, the Eee PC 900 has an 8.9-inch wide TFT LCD with a 1024 x 600-pixel resolution (WXGA)--making it more comfortable on eyes than its predecessor. Under the hood is a 900 MHz Intel Mobile CPU with integrated Intel graphics processor, 1 GB of RAM (not expandable), and 20 GB of flash memory solid-state drive (SSD). The SSD provides quiet performance and helps save energy, while its shock-proof solid state design helps to guard against data loss or shock-related damage if the laptop is dropped.The Eee PC includes software for Web browsing (Firefox), e-mail, OpenOffice 2.0 for creating and editing word processing documents and spreadsheets, and a suite of other productivity software to help keep you on track.You get three USB 2.0 ports, a VGA output for connecting to external monitors, headphone and microphone jacks, and a Secure Digital (SD) memory card slot. The rechargeable battery provides up to 3.5 hours of battery life (depending on usage). It's backed by a 1 year warranty for parts and labor.SpecificationsInternal memory: 20 GB solid state diskMemory expansion: Slot for MMC/SD(SDHC) cardsRAM: 1 GB DDR2Processor: 900 MHz Intel Mobile CPUOperating system: Linux (supports Windows XP)LCD: 8.9 inches, 1024 x 600 pixelsNetworking: 54g Wi-Fi (802.11b/g), 10/100 Fast EthernetPeripheral connectivity: Three USB 2.0External video: One VGAExternal audio: One headphone and one microphone portWebcamera: Yes, 1.3 megapixelsBattery life: up to 3.5 hoursWeight: 2 pounds (32 ounces)Dimensions: 8.9 x 6.7 x 1.33 inches", "title": "ASUS Eee PC 900 8.9-Inch Netbook (Intel Mobile Processor, 1 GB RAM, 20 GB Solid State Drive, Linux, 4 Cell Battery) Pearl White", "imUrl": "http://ecx.images-amazon.com/images/I/410LBTXQznL._SX300_.jpg", "related": {"also_viewed": ["B0071N3BJ6", "B003TPC4HA", "B00CS5J99S", "B002CYXKYA", "B00BKRMMUS", "B00HZT1T5E", "B00IT1WJZQ", "B00IVLHJ2M", "B00FCK20SI", "B00GZ1GV3I", "B009LL9VDG"]}, "categories": [["Electronics", "Computers & Accessories"]]}