{"asin": "B003ZHV70C", "description": "Fujifilm's FinePix J40 will be a hit with photographers who demand a compact that's affordable, easy-to-use and produces great images. Not only does it feature the latest technology, such as Scene Recognition AUTO and Face Detection, but it's very stylish too, with a petite slim-line frame and high-gloss, double coated veneer finish.With a core specification of 12 megapixels, pin-sharp 3x Fujinon optical zoom lens, and a huge 3.0-inch LCD screen, the FinePix J40 will deliver fantastic pictures with minimal effort. Offering wide photographic versatility, a new Panoramic Shooting mode allows users to create stunning shots of sweeping landscapes and large groups of people. Just slip it in your pocket and go and have fun!Fujifilm FinePix J40 HighlightsPint-sized CompactAt a mere 20mm thin, this slender little camera is the perfect companion for someone who likes to carry their camera with them at all times, and does not want it to take up too much room in their bag, or be too bulky in their pocket.Big on StyleThe FinePix J40 may be low on cost but it's high on style. As well as its adorable petite frame, the FinePix J40 has been finished with a special double coated lacquer to give a beautifully glossy, varnished finish.Zoom, Zoom, ZoomThe FinePix J40 is fitted with a high quality Fujinon 3x zoom lens, ensuring you can get up close to your subject.3x optical zoomBig ScreenIt's easy to view and compose your photos using the FinePix J40's large and bright 3.0-inch LCD screen. Plus, try the Microthumbnail View in playback which displays up to 100 thumbnails of your photos so you can quickly find your favourite shot.Easy-to-useThe J40 has been designed to make taking photos fun and easy. With a simple and intuitive graphical user interface it really is a joy use.Memory storageThe FinePix J40 is compatible with SD/SDHC memory cards. Plus there is an extra 10MB of internal memory so you don't have to worry about filling up your memory card.Fujifilm FinePix J40 FeaturesImpressive PanoramasThe FinePix J40 features a handy Panoramic Shooting mode. So now you can create stunning panoramic shots in-camera. All you have to do is take three consecutive shots of a scene and this clever technology seamlessly stitches them together to create one superb panoramic image.Take impressive panoramic photosHigh-Resolution imagesWith 12.2 megapixels, you will be amazed at the clarity of the images you take: clear, sharp and packed full of colour.Let us do all the hard workFujifilm's Scene Recognition Auto (SR AUTO) technology makes it easy to take good pictures. It intelligently detects a scene without the need to pre-select a mode on the camera. Having identified the most commonly photographed subjects, Fujifilm has developed technology to automatically recognise different scenes; Portrait, Backlit Portrait, Night Portrait, Landscape, Night and Macro. Just point at the scene and let the camera adjust the settings to optimise the results. Easy!Perfect PortraitsFor perfect people pictures Fujifilm's Face Detection technology cleverly detects faces in the frame and sets the focus and exposure for the faces rather than anything in the background, revealing sharp and in-focus portrait shots.No More BlurThe J40 is kitted out with Picture Stabilization, which minimises image blur that can so often ruin photos. Fujifilm's stabilization system works automatically and ensures that image blurring and camera shake are kept to an absolute minimum.Picture stabilization in actionMake a MovieCapture more than just a picture - re-live your memories in their full glory, with sound at 30 frames per second. You can even use the zoom function during movie recording.Good in low-lightPhotos taken in low light are the ones that are most likely to produce disappointing results. Limited flash range and direct light can mean the foreground is harshly lit and the background lost all together. If the flash isn't used at all, the image can suffer from digital interference called 'noise' as the sensor struggles to pick up all of the detail in the scene. Fujifilm has put 70 years of experience in imaging into fine-tuning the light sensitivity and flash systems of its cameras and you perhaps wouldn't normally expect a camera placed at such an affordable price point, to house such technology &ndash; but we can assure you - it does.Scene it?With 17 special scene modes, the J40 is ready to shoot everything and anything, from \"Sunsets\" to \"Flowers.\" Have fun trying out each scene position and the camera automatically selects the appropriate shutter speed, exposure and white balance to ensure that you get great images with the least amount of effort.What's in the BoxFinePix J40 digital camera2 GB SD memory cardLi-ion rechargeable battery NP-45AAC Adaptor/ChargerHand StrapUSB cableFinePix software (CD-ROM)Owner's manual(CD-ROM)User's GuideCertified Frustration-Free PackagingAmazon.com has certified this product's packaging is Frustration-Free. A Frustration-Free Package is easy-to-open and comes without excess packaging materials such as hard plastic \"clamshell\" casings, plastic bindings, and wire ties. It is exactly the same as a traditionally packaged product--we've just streamlined the packaging to be opened without the use of a box cutter or knife and will protect your product just as well as traditional packaging during shipping. Products with Frustration-Free Packaging can frequently be shipped in their own boxes, without the need for an additional shipping box.Learn more.", "title": "Fujifilm FinePix J40 12.2 MP Digital Camera with 3x Optical Zoom and 3-Inch LCD (Includes 2 GB SD Memory Card)", "price": 2.65, "imUrl": "http://ecx.images-amazon.com/images/I/41Vmw-hTreL._SX300_.jpg", "related": {"also_viewed": ["B003D8OSV8", "B006UT8Z70", "B00B5HE32I", "B003VTZE1W", "B00AWYN0BU", "B00BBJIFWE", "B00B7UTB5C", "B00B5HE2UG", "B00BJ60VW6", "B00BINFLK2", "B00I8BIBCW", "B00BN1OBYG", "B007JRB0TC", "B007M51J42"], "buy_after_viewing": ["B003DPR7AK", "B003D8OSV8", "B003P9VMXC", "B006UT8Z70"]}, "categories": [["Electronics", "Computers & Accessories", "Computer Components", "Memory"]]}