{"asin": "B004AX6Z3Y", "description": "Why buy a single purpose book holder, or a stand made just for an iPad or Kindle or Nook? The BookGem is the one device that works brilliantly for virtually any paper book or ebook or tablet computer you may have now - or in the future. The BookGem is a revelation to any reader tired of having to constantly hold up their reading material. The patented design is unlike any of the flimsy wire or simplistic pillow-type book supports. Spring-loaded page clips hold the book and pages in place, while allowing for quick and easy page turning. These same clips also have rubber tips, with rubber pads behind, to hold your ebook or iPad firmly but gently so it can't slip out. The clever folding support legs allow for multiple angles, and even allow the book to be positioned sideways extremely comfortable reading in bed. An iPad or ebook can be held in portrait or landscape orientation, and can even be grasped from the side to allow one leg to be varied for an adjustable angle. The charging cord and buttons are not obstructed. The positive attachment means the stand goes where your book or tablet goes - easily carry it around with one hand. Have a nice leather cover for your iPad or eBook? The BookGem will still work wonderfully with the cover open and attached. Plus, the whole thing folds up like a pair of glasses to drop into your pocket or purse. Ideal for students, reading at mealtime, taking notes, studying at the computer. Also makes a great cookbook holder, or instructional book holder while working on projects, sewing and needlepoint, machinery repair, etc. (Note that some large textbooks and very heavy books will overwhelm the small pocketable book holder.) A full video product tour is now available on our Youtube Channel. And visit our website at BookGem for great photos, instructions, and much more info.", "price": 14.99, "imUrl": "http://ecx.images-amazon.com/images/I/514ztLdd6bL._SY300_.jpg", "related": {"also_bought": ["B001VSA88Y", "B005IV6U0U", "B00006B8HT", "B00414L8IY", "B000GW64HA", "B009G7VW32", "B001B0TXEW", "B001J9SFXK", "B00GIJ20O6", "B00DYTM9K8", "B009DAOI92", "B00ENNKTMO", "B003QDSRN0", "B00696Q0SK", "B0052DH2XI", "B000ABHIXG", "B003JJ7HYQ", "B00006B8MU", "0965510999", "B003QDSR12", "B001SR1242", "1933622709", "B001JL6EZ4"], "buy_after_viewing": ["B005IV6U0U", "B001J9SFXK", "B00ENNKTMO", "B0012KLYV6"]}, "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Stands"]]}