{"asin": "B001KFH6IS", "description": "With a unique ridged exterior that enhances the enclosure's cooling performance, and a quadruple interface for full Mac and PC compatibility, the LaCie 301442U d2 Quadra External Hard Drive is an all-in-one drive that's built with the professional in mind. Designed by internationally acclaimed designer Neil Poulton, this versatile drive offers extreme performance and an aesthetic touch that will enhance any work space..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The LaCie d2 Quadra Hard Disk offers:eSATA 3Gbits, FireWire 400/800, and USB 2.0 for universal compatibility and extreme speed1 TB of disk space.7200 RPM spin speed and 16 MB cache.Fanless ridged design for cool, quiet operation.Unique ridged heat sink aluminum design increases surface area by 60% for cooler operation. (Shown here with the Little Big Disk Quadra and the 2big Network.)View larger.The minimalist space-saving design will enhance the aesthetics of any work space.View larger.View back.The d2 can be racked horizontally and set up in a RAID configuration.View larger.Quadruple Interface for Unmatched Performance and CompatibilityThe LaCie 301442U d2 Quadra External Hard Drive features one eSATA 3 Gbit port, two FireWire 800 ports (9-pin), one FireWire 400 port (6-pin), and one hi-speed USB 2.0 port that is USB 1.1-compatible. (Cables for each connection are conveniently included with the drive.) This quadruple interface makes the d2 Quadra ideal for demanding multi-media applications that require extreme speed as well as universal connectivity. The eSATA interface offers a blazing transfer rate of up to 300 MB per second (3Gbits/sec), while FireWire allows you to connect directly to your DV camera.The LaCie d2 is compatible with Windows, including Vista, and Mac OS X 10.2.8 and above (10.3 for eSATA). If you have Mac OS X 10.5 Leopard, the d2 Quadra works with Time Machine, which automatically backs up your Mac's system files, applications, accounts, preferences, music, photos, movies, and documents to an external hard drive and lets you easily go back in time to recover anything.Superior Drive Performance for Power UsersBuilt for power users such as video editors, the d2 Quadra features a rotational speed of 7200 RPM and a cache of at least 16 MB. Perfect for digital content creation, audio/video editing, DVD authoring, web animation, and more, the d2 Quadra can handle multiple demanding professional tasks. It can also be daisy-chained via FireWire or connected to your DV camera and is even bootable in FireWire for Mac and in eSATA for Mac/PC.With a capacity of 1 TB (1,000 GB), the d2 Quadra can hold up to 1,000,000 photos, 350,000 songs, or 70 hours of DV video. If you purchase multiple drives, they can be daisy-chained and set to RAID 1 for data redundancy and protection, or RAID 0 for even greater speed. If you have different storage needs, you can also choose between the500 GBor750 GBversion of the d2 Quadra.The d2 Quadra also offers three power management options: \"Auto\" for energy efficiency; \"On\" for instant access; and \"Off\" for data protection. The drive also lets you back up files or launch any application with a simple push of the front blue button. This \"shortcut button\" can be configured to launch any document or application.Smart, Elegant Design and Loaded with SoftwareWith the d2 Quadra, Neil Poulton has fashioned a unique, attractive and functional drive that offers excellent heat dissipation features and space-saving options for stacking. The fanless aluminum heat sink design features exterior ridges that provide 60 percent more surface area for heat dissipation, keeping the drive quiet and as safe as possible at all times. The d2 Quadra will sit nicely in an upright position alongside your PC or Mac machines, or it can be stacked horizontally with other drives or rack mounted to save desktop space.Set-up and use is quick and easy, thanks to LaCie's preloaded Setup Assistant that helps format the hard disk according to your needs. For instance, the d2 Quadra lets you easily create a FAT32 partition for use with Macs. LaCie's Shortcut Button lets you easily launch any application with one push.Included with the drive is LaCie's Genie Backup Assistant for Windows and Intego Backup Assistant for Mac. Both make it easy for you to back up your files including your pictures, music, and documents, and let you restore your files to previous versions in case anything happens to them.The drive measures a slim 1.7 x 6.3 x 6.8 inches (WxHxD), weighs 3.31 pounds, and is backed by a 3-year limited warranty.About LaCieEstablished in France in 1989, LaCie is a leading manufacturer of computer peripherals for Windows, Apple and Linux users. With offices and plants in the USA, Canada, Japan, Australia, Europe, Singapore and Hong Kong, LaCie develops and manufactures external storage solutions and color monitors that help professionals and everyday people easily manage their digital lives. LaCie has differentiated its products through original designs and leading-edge technology.What's in the BoxLaCie d2 Quadra Hard Disk; eSATA-to-eSATA cable; FireWire 800 (9-to-9 pin) cable; FireWire 400 (6-to-6 pin) cable; USB 2.0 cable (USB 1.1 compatible); external power supply; drive stand for upright desktop use; LaCie Utilities (preloaded); Genie Backup Assistant for Windows; Intego Backup Assistant for Mac.", "title": "LaCie d2 Quadra Hard Disk 1 TB eSATA/FireWire800/FireWire400/USB 2.0 Desktop External Hard Drive 301442U (Aluminum)", "price": 189.99, "imUrl": "http://ecx.images-amazon.com/images/I/31YUjD9cVDL._SX300_.jpg", "related": {"also_viewed": ["B0052MNIAA", "B0050SI9W8", "B00AK9ZT98", "B002LZV0B0", "B003DTK1HC", "B004QGXOOI", "B009VQ7KPM", "B002LITG7M", "B004QGXOP2", "B005C2BNJI", "B004E9SGUO", "B0038CRQQS", "B00AJJIUKO", "B009VQCHS2", "B00CO1HUGU", "B004QGXOOS", "B0042KFLJE", "B00HRKB3VQ", "B0058BDFXA", "B0058VIXBY", "B00AKC8EJW", "B005C2BNKM", "B009HQHPB0", "B00F0JXDUU", "B0090A8TX6", "B003FQBJZQ", "B0058VIWTM", "B00655YT9C", "B00CO1I2C6", "B0010YWPZ8", "B00965HKK8", "B00BTCWZW4", "B00E6N9GS4", "B0078T11QS", "B002QID2NG", "B009AP6X0C", "B009DYCU6Q", "B00829TII6", "B009F7IC1I", "B008SA63Y6", "B008R7EXJW", "B001E06W8O", "B00829THSW", "B00HFRWXV0", "B003MRI398"], "buy_after_viewing": ["B0052MNIAA", "B0050SI9W8", "B00AK9ZT98", "B009VQ7KPM"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]]}