{"asin": "B0017TFVUW", "categories": [["Electronics", "Computers & Accessories", "Routers"]], "description": "The NETGEAR RangeMax Dual Band Wireless-N Router (WNDR3300) effectively creates two separate but simultaneous wireless networks in your home or office--one that supports older Wireless-G products, and one for the newer, more robust Wireless N standards. The router's \"dual\" nature lets you continue to use your existing Wireless-G devices while giving you the advantage of the vastly improved throughput speed, range and performance of a Wireless-N network.RangeMax Dual Band Wireless-N Routerfeatures:Blazing speeds and extended range thanks to Wireless-N technology.Backwards compatibility with Wireless-G devices.Double firewall security and parental controls.Quality of Service for automatic prioritization of tasks.With its dual band nature, you can create two separate but simultaneous wireless networks.View larger.And when used with computers and devices with Wireless-N capability, the RangeMax Dual Band Wireless-N Router will let you surf, email, stream HD video, play on-line games, and even make Internet phone calls simultaneously, avoiding annoying interference from neighboring Wi-Fi networks and other wireless devices like Bluetooth or cordless phones.Dual Band Wireless-N: Less Interference, Increased Range and Superior PerformanceFeaturing the latest dual band Wireless-N technology, the RangeMax Dual Band Wireless-N Router delivers exceptional range and speed for new Wireless-N devices while still offering backwards compatibility to older Wireless-G devices.NETGEAR's unique multiple internal antenna technology packs eight metamaterial antennas into this wireless router. This enables wireless signals to travel farther for a stronger, more reliable wireless connection. This new technology also minimizes \"dead spots\" that can frustrate wireless network users.While performance will vary according to your particular conditions, when used with other Wireless-N computers and devices, the RangeMax Dual Band Wireless-N Router can deliver up to 10 times the range of older Wireless-G routers and offer a throughput speed of up to 15 times faster.(For optimal performance, the RangeMax Dual Band Wireless-N Router should be used with NETGEAR'sRangeMax Dual Band Wireless-N Adapteror laptops with integrated Wireless-N)Push 'N' Connect makes set up a cinch.Easy Set-Up with Push 'N' ConnectSetting up and connecting to the RangeMax Dual Band Wireless-N Router couldn't be easier. The router comes with a Smart Wizard installation CD that vastly simplifies the initial set-up process by automatically detecting and configuring your router for virtually all ISP connections.And once your network is set up, the router's \"Push 'N' Connect\" feature takes over. To connect a new device on your network, you simply push a button on the router, and your device is automatically and securely configured and connected to your wireless network.This means that the days of having to remember complicated security keys and passwords are over. The router also features an integrated switch that lets you attach up to four devices directly to the router.Another notable advantage of dual band Wireless-N is that it works with up to 23 channels that operate on the 5GHz band. Wireless-G networks, on the other hand, operate on the 2.4-GHz band with only 3 channels, which is also home to some cordless phones, microwaves, and other devices that can cause interference. 5GHz Wireless-N avoids the interference that can interrupt Wireless-G networks, giving you greater reliability and performance.And the RangeMax Dual Band Wireless-N Router \"dual\" nature means the router creates both Wireless-G and Wireless-N networks at the same time. So on your Wireless-N enabled computer, you'll see two networks to choose from, depending on your usage.For instance, if you're using your network for streaming HD movies or VoIP, you can connect over the Wireless-N network and use the Wireless-G for less demanding applications, such as connecting to your printer or sending email.And thanks to its QoS, or Quality of Service, the router will automatically prioritize its tasks according to your network's existing bandwidth and your needs. So if you're playing an online game, or streaming an HD video while someone else on your network starts downloading a large file, the router helps ensure that your games and video won't be interrupted.Four ports let you connect via ethernet cable.Parental Controls and Security at HomeThe RangeMax Dual Band Wireless-N Router offers double firewall protection that includes network address translation, or NAT, to keep you network hidden from outside users, and stateful packet inspection, or SPI, firewall to deny outside requests for personal information.Other security measures include denial-of-service (DoS) attack prevention, intrusion detection and prevention (IDS), and Wi-Fi Protected Access (WPA2-PSK, WPA-PSK). The router offers both 64-bit and 128-bit encryption as well as a wireless access control that identifies authorized wireless network devices connected to your network.For parental peace of mind, the RangeMax Dual Band Wireless-N Router offers several options designed to keep your kids safe, including URL content filtering, time-based usage controls, and \"trusted user\" controls. The router's remote management controls make it easy to keep your kids online and protected.The RangeMax Dual Band Wireless-N Router measures 8.8 x 6.0 x 1.2 inches (HxWxD) and comes with a 1-year manufacturer's warranty.What's in the BoxRangeMax Dual Band Wireless-N Router (WNDR3300), stand, Ethernet cable, setup CD, 12V 1.5A power adapter, and warranty/support information card.Wireless-N Routers ComparisonSpeedSecure ConnectionWi-Fi and Power On/Off ButtonsParental ControlsCoverageMultiplayer GamingReadySHAREStreaming MultimediaDual BandGigabitNETGEAR GreenWNDR3700300 + 300BestWNDR3300300 + 54BestWNR3500L300BetterWNR2000300BetterWNR1000150Good", "title": "NETGEAR WNDR3300 RangeMax Dual Band Wireless-N Router", "price": 39.85, "salesRank": {"Electronics": 26014}, "imUrl": "http://ecx.images-amazon.com/images/I/31J7AgcI%2BRL._SX300_.jpg", "related": {"also_viewed": ["B0085WN7YQ", "B0041LYY6K", "B008HO9DK4", "B001UI4RTG", "B002HWRJY4", "B0085WVQDK", "B001AZP8EW", "B002RYYZZS", "B005KG44V0", "B007KZQM9G", "B004H1PMJC", "B00895BUPC", "B00EM5UFP4", "B0058NN6CS", "B0081H8TRA", "B007ZEQFG2", "B00KFD0O9E", "B0045HHTGW", "B007ZIFICU", "B001498LIO", "B0098QV038", "B004N625AK", "B001UHMB5O", "B008RV51EE", "B001SEL36M", "B00008SCFL", "B007KZQM9Q", "B008HO9DIG", "B004N625AA", "B0088CJT4U", "B000FFRZ1W", "B00F0DD0I6", "B008D97LNE", "B00HEX851C", "B006V72AHC", "B001FWYGJS", "B0042X3F76", "B00D78Q2AO", "B005S0BYQ6", "B002WBV2T8", "B003S4ZJW4", "B000Z3U1P6", "B007KZQMO6", "B006V72AE0", "B001MVKZOC", "B0049YQVHE", "B004PA2B6C", "B000Z3XXR4", "B007IL6OR2", "B002YLAUU8", "B0062KA4VM", "B00JYCJJNY", "B003TWZ97A", "B0081TXJ28", "B004N625A0", "B00005ARK3"], "buy_after_viewing": ["B0085WN7YQ", "B0041LYY6K", "B008HO9DK4", "B001UI4RTG"]}}