{"asin": "B000NLLXUM", "description": "Perfect for the busy traveler, this portable iPod alarm clock speaker system lets you sleep or wake to your favorite iPod tunes or buzzer, or just enjoy a little music while your iPod charges. With a lock feature to maintain settings, battery or AC power, and a protective carrying case, it lets you take some room-filling sound nearly anywhere.A perfect iPod dock for the busy traveler.Click to enlarge.Protective carrying case.Charge and Play Your iPod AnywherePlay back your favorite tunes at home or while traveling with the iH27. While your iPod is docked, it receives a charge (when on AC power), so when you're ready to go, so is your iPod.The iH27 power adapter is able to handle input voltage from 100 to 240 VA, so it'll work overseas with the right plug adapters. And because the iH27 is powered by either AC or four AA batteries (not included), you can enjoy music with or without an outlet. A handy carrying case is also included to keep the device safe and sound while in transit, whether it's a business trip or a barbecue.Sleep or Wake to Your iPodThe iH27 lets you wake to your docked iPod (or the buzzer alarm for you masochists). A gradual alarm feature gently raises the alarm volume, so as not to jar you out of sleep. You can also dim the display, with high, medium, low, and off settings.The iH27 also has a sure alarm feature so the buzzer alarm will still sound in the event of power failure, if backup battery is installed.And of course, there's a snooze button for grabbing a few more minutes of slumber and a sleep mode for falling asleep to your favorite tunes or podcasts.Big Sound in a Small PackageiHome's Reson8 technology, with through-body ported speaker chambers, gives the iH27's four speakers better response characteristics for superior stereo sound. In addition, SRS WOW technology is designed to provide a broader audio image with enhanced low-range and mid-range sound reproduction, in order to bring added life to compressed MP3 files.Auxiliary Input and A/V OutputUse the iH27's auxiliary input to connect external devices such as MP3 or CD players. You can also send the audio and/or video from the dock's A/V out to a television or stereo, for enjoying your iPod content on a larger scale.What's in the BoxiH27 main unit, AC adapter, iPod dock inserts, auxiliary cable, and user's manual.", "title": "iHome iH27 Portable Alarm Clock for iPod (Black)", "price": 99.99, "imUrl": "http://ecx.images-amazon.com/images/I/516dSzFfOoL._SY300_.jpg", "related": {"also_viewed": ["B004T0MW7Q", "B003VWW3Q8", "B001S0JZKW", "B00BDRX7ZE", "B003B82R4U", "B0016600G6", "B00080FO4O", "B000Z9UY2K", "B000NDA4J6", "B009NZ6SZE", "B001L9KMTI", "B0035FCWBC", "B000C7DQ66", "B002OB4BK8", "B001RYK2Q0", "B004NBZA98", "B0043M66XG", "B000N483Y8", "B003VANOI6", "B007JCNOHI", "B00644JO9O", "B002TNCMMA", "B007PZYBSA", "B004NBZAI4", "B003ARSO08", "B003SNJ4TE", "B0039STTVQ", "B0000V157Q", "B002H9LNGW", "B005KQ2O2G", "B003VX1EF8", "B004X69BFW", "B0010KUZP4", "B005GUAIJM", "B005GUAIBU", "B002I3OZ7G", "B008N73V7G", "B003SX0NG2", "B002VJJODM", "B00538NGEG", "B00BQ4HROG", "B00FSB6B2W"], "buy_after_viewing": ["B004T0MW7Q", "B003VWW3Q8", "B005GUAIJM", "B003VX1EF8"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}