{"asin": "B0056Z0SJM", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Kodak EasyShare Touch M5370 Digital CameraYou&#x2019;ve got the shot. Now Share it with a touch. With its brilliant high-resolution capacitive touchscreen LCD and our exclusive Share button, the Kodak EasyShare Touch M5370 camera makes it simple to take, organize, edit, and share incredible pictures and videos with a touch. Whether you&#x2019;re on the prowl for new shoes or headed out to the clubs, sharing your scene is simple with the Kodak EasyShare Touch M5370 camera. The high-resolution capacitive touchscreen LCD shows off your picture&#x2019;s brilliant colors and vivid details. And its wide-angle lens gets everyone in the shot. When you&#x2019;re ready to share, update your status by pressing Kodak&#x2019;s exclusive Share button. Simply tag pictures or videos and connect to a PC to e-mail to friends and the Kodak PULSE Display or upload to Kodak Gallery and other popular sharing sites.Pick a color to complement your personality and styleThe Kodak EasyShare Touch M5370 comes in some of the boldest colors out there&#x2014;the perfect match for the hottest features contained inside.Kodak&#x2019;s Share button makes sharing your videos and pictures as simple with One Button Upload:&nbsp;&nbsp; &nbsp;&#x2022; Just press Share&nbsp;when in review mode&nbsp;&nbsp; &nbsp;&#x2022; Choose your favorite sharing destinations: Facebook1, e-mail, Kodak Gallery and Kodak PULSE Digital Frames2, and other popular sharing sites&nbsp;&nbsp; &nbsp;&#x2022; Connect your camera to your computer&nbsp;or insert your memory card and your videos or pictures are automatically uploaded to the destination(s)1Kodak&#x2019;s exclusive Share Button:&nbsp;&nbsp; &nbsp;&#x2022; Automatically shares when you connect to a PC1&nbsp;&nbsp; &nbsp;&#x2022; Tags to the largest number of socialnetworks3&nbsp;&nbsp; &nbsp;&#x2022; Uploads friend tags to Facebook1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#x2022; Automatically saves up to 20 people tags&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#x2022; Instantly recognizes up to five faces in a single image&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#x2022;Makes finding and tagging friends easyKodak EasyShare SoftwareThe complete solution for transferring, online sharing, e-mailing, organizing, editing, and creative printing of your pictures&nbsp;&nbsp;&nbsp; &#x2022;&nbsp; Organize your pictures with your own tags, star ratings, and date and time stamps, then use the search feature to quickly find any picture in your collection&nbsp;&nbsp;&nbsp; &#x2022; Edit your pictures with ease&#x2014;select from a variety of simple tools that reduce red-eye, improve lighting, remove wrinkles and blemishes, and add text&nbsp;&nbsp;&nbsp; &#x2022; Create photo projects online or at home&#x2014;choose from hundreds of templates and designs to create album pages, cards, invitations and much more&nbsp;&nbsp;&nbsp; &#x2022; Manually upload to the Facebook1, e-mail, Kodak Gallery and Kodak PULSE Digital Frames2, and other popular sharing sitesFeatures:&nbsp;Capture stunning pictures in tight spots or from far away&#x2022;&nbsp;&nbsp;&nbsp; The 5X SCHNEIDER-KREUZNACH Optical Zoom Lens gets in close for extraordinary details on faraway shots&#x2022;&nbsp;&nbsp;&nbsp; Capture dramatic shots in tight quarters with the 28 mm wide-angle lens and reduce blur caused by subject movement or fast-action situations&#x2022;&nbsp;&nbsp;&nbsp; The camera automatically minimizes the effects of camera shake to deliver clearer, sharper picturesCreative modes and artistic effects&#x2022;&nbsp;&nbsp;&nbsp; Get great shots time after time with multiple scene &amp; color modes, including auto, sport, portrait, snow, fireworks, and backlight&#x2022;&nbsp;&nbsp;&nbsp; Add a classic flair to your pictures with film effects&#x2014;KODACOLOR, KODACHROME, EKTACHROME, TRI-X, T-MAX, or Sepia&#x2022;&nbsp;&nbsp;&nbsp; Make your pictures even more personal with post-capture effects such as spot color, photo captions, background blur, borders and tints, and photobooth modeAmazing quality with 16 megapixels&#x2022;&nbsp;&nbsp;&nbsp; 16 MP means you can make stunning prints up to 30 x 40 in. allowing you to crop and enlarge and still have great picture qualityJust tap...swipe...or drag&#x2014;editing and sharing is super simple!&#x2022;&nbsp;&nbsp;&nbsp; Explore your pictures on the brilliant and intuitive 3 in. HVGA high-resolution touchscreen display featuring 2X more resolution than standard displays&#x2022;&nbsp;&nbsp;&nbsp; Kodak Color Science technology built-in for brighter, more vibrant details&#x2022;&nbsp;&nbsp;&nbsp; With the slightest touch, you'll get a responsive, fluid experience allowing you to take advantage of your camera's built-in features&#x2022;&nbsp;&nbsp;&nbsp; Change a mode, review, tag, or edit your pictures and videos&#x2014;it&#x2019;s easy on our capacitive touchscreen displayShoot video as the moment happens&#x2022;&nbsp;&nbsp;&nbsp; The conveniently located dedicated video record button captures 720p HD video&#x2022;&nbsp;&nbsp;&nbsp; Review and edit videos right on the camera, using the bright touchscreen display or debut your videos in full glory on your HDTV with the optional remote control and HDMI cable4Kodak&#x2019;s Face Recognition makes it easy to find friends&#x2022;&nbsp;&nbsp;&nbsp; Automatically recognizes up to 20 pre-tagged faces&#x2022;&nbsp;&nbsp;&nbsp; Recognizes up to five faces in a single image&#x2022;&nbsp;&nbsp;&nbsp; Once a friend is tagged, that information stays with the picture wherever it goes&#x2022;&nbsp;&nbsp;&nbsp; Find them easily by choosing a name or faceBe ready and recharged at a moment&#x2019;s notice&#x2022;&nbsp;&nbsp;&nbsp; Get energy that lasts with the power of the included Li-Ion rechargeable battery and in-camera charging&#x2022;&nbsp;&nbsp;&nbsp; Smaller, lighter battery with higher voltage and energy capacity&#x2022;&nbsp;&nbsp;&nbsp; Don&#x2019;t miss a shot if your memory card becomes full&#x2014;switch to in camera memory quickly, thanks to the internal memory plus feature&#x2022;&nbsp;&nbsp;&nbsp; With the MICROSD/MICROSDHC card slot, you can add up to 4 GB of memory&#x2014;plenty of room for all your picturesKodak's Smart Capture featureBeautiful pictures, more often-automatically. Kodak&#x2019;s innovative Smart Capture feature automatically identifies the scene and adjusts camera settings for a great picture in just about any environment&nbsp;&nbsp; &nbsp;&#x2022; Intelligent scene detection&#x2014;analyzes the scene to give you better pictures under various conditions&nbsp;&nbsp; &nbsp;&#x2022; Intelligent capture control&#x2014;automatically adjusts camera exposure, focus, and ISO for clear pictures in any environment, even in low light&nbsp;&nbsp; &nbsp;&#x2022; Intelligent image processing&#x2014;reduces noise and clears up dark shadows for vibrant, crisp details and true-to-life colorsWhat&#x2019;s In the Box:Everything you need to shoot and share&nbsp;&nbsp; &nbsp;&#x2022; Kodak EasyShare M5370 Digital Camera&nbsp;&nbsp;&nbsp; &#x2022; Kodak Rechargeable Li-Ion Battery KLIC-7006&nbsp;&nbsp;&nbsp; &#x2022; Kodak USB AC adapter for in-camera charging&nbsp;&nbsp;&nbsp; &#x2022; Wrist strap&nbsp;&nbsp;&nbsp; &#x2022; USB cable&nbsp;&nbsp;&nbsp; &#x2022; User GuideWarranty: One Year1All Kodak digital still and video cameras manufactured in 2011 or later2Kodak PULSE Display and Kodak Gallery support still pictures; video not supported3Sharing sites vary by region4Kodak AV Cable available as an optional accessory", "title": "Kodak Easyshare Touch M5370 16 MP Digital Camera with 5x Optical Zoom, HD Video Capture and 3.0-Inch Capacitive Touchscreen LCD (Blue)", "price": 6.45, "salesRank": {"Camera &amp; Photo": 8124}, "imUrl": "http://ecx.images-amazon.com/images/I/511yLiz2BWL._SX300_.jpg", "related": {"also_viewed": ["B0050I56A6", "B0056Z0V0I", "B004MB9UMM", "B004MB4FEU", "B004FLL572", "B004FLL58Q", "B004MB8302", "B004FLL59A", "B004FLL57C", "B003VTZE26", "B004FLL57M", "B004FLL590", "B003VTZE1W", "B0031RGGC0", "B003VTZE1M", "B004FLL54U", "B00CF32O8G", "B004FLL54K", "B0050I568S", "B004FLL5A4", "B003VTZE2G", "B00BTKNZ70", "B0073WNN3E", "B004FLL56I", "B00B5HE2UG", "B00BP83T0O", "B00B7N9CB2", "B00BN1OCCW", "B004FLL59K", "B0021XW3YU", "B00BBJPSQK", "B00CD9JNDQ", "B00I8BIC9E", "B00BOYFX30", "B0075SUHA8", "B004FLL53Q", "B00B5HE3IW", "B0031RGGAM", "B00I8BIBCW", "B006ZAHNZY", "B005AKS4DA", "B00BN1OBYG", "B00BBJIFWE", "B00AQDGAKK", "B0031RGGAW", "B004FLQTJG", "B00B5HE2MO", "B0075SUHWG", "B005AKRPP8", "B00B7N9COY"], "buy_after_viewing": ["B001OBVG5C", "B0050I56A6", "B003VNKNEQ", "B003VTZE1M"]}}