{"asin": "B0006BK58U", "description": "In Forza Motorsport, it's all about you and your car. With over 250 of the baddest racing machines imaginable, an infinite number of ways to customize them, and all the tools you need to tune them to perfection, you'll find yourself behind the wheel of the slickest vehicles on the planet.With Forza Motorsport, you'll be able to own cars from the world's most recognized manufacturers. Get behind the wheel of the Enzo Ferrari, Porsche 911, Ford GT, or the Audi R8, to name a few. The physics model of each car is based upon actual car data, so your driving feels like the real deal. Plus, Forza has taken meticulous steps to design each car's visuals according to exact specifications. Teams of artists have worked to reproduce the surface properties of materials in an ultra-realistic fashion -- the painted metal is shiny with gloss, the glass reflects light, and the car's rubber is rich with texture.You can trick out every car with real-world body parts, such as rims, wings, side skirts, bumpers, and hoods. At the advanced paint shop you can pimp your ride with phatty decals and classy custom paint schemes. But don't stop with looks alone -- Forza also lets you upgrade your car with suspension kits, turbochargers, superchargers, intercoolers, brakes, and racing slicks. It's your car, and Forza gives you the tools to make it your own.And once your ride is ready, you can immerse yourself in 17 different environments that deliver challenging tracks textured with accurate, photo-realistic graphics. Slip on your driving gloves, get behind the wheel, and rev your engine as you ready yourself for the world-famous Nring Nordschleife, the corkscrew turns of Laguna Seca, the urban jungle of New York City, or the lush Copacabana in Rio de Janeiro. Each location has been recreated with detail matching the attention given to the vehicles -- the total package of fast cars and exotic locales makes the racing experience of Forza Motorsport totally awesome.Take your powerful, new creation to cyberspace, and challenge the globe's toughest drivers on Xbox Live. Once you've built your vehicle and mastered all the driving nuances, you'll be ready to burn some serious rubber.", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/51XQKAE5FNL._SY300_.jpg", "related": {"also_viewed": ["B003O6E986", "B00CMQTTQG", "B00FM5IY4W", "B000FRVCAA", "B00KAI3KW2", "B00IIHU44E", "B00CMQTVK0"], "buy_after_viewing": ["B003O6E986", "B002BSA2LQ", "B0050SY0L2", "B00CMQTTQG"]}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "More Systems", "Xbox"]]}