{"asin": "B001TOD7N8", "imUrl": "http://ecx.images-amazon.com/images/I/4153T5FaEiL._SX300_.jpg", "description": "This spindle of 50 AmazonBasics 52X CD-Rs provides a natural storage solution for music, photos, and archiving important data. Each disk offers a capacity of 700MB. These CD-Rs support fast write speeds up to 52X and provide an audio recording time of 80 minutes.The AmazonBasics 52X CD-Rs offers a capacity of 700 MB, fast write speeds up to 52X, and an audio recording time of 80 minutes.Recommended Uses:Creating audio CDs for playback on a CD player.Sharing photos with friends and family.Backing up and archiving up to 700 MB of data.Technical Specifications:Capacity: 700 MBFormat: CD-RRecording Speed: 52xRecording Time: 80 minutesWarranty: AmazonBasics 1-Year LimitedWarranty[PDF]Documentation:Helpful Hints[PDF]CD-R: Quality Media StorageCD-R is a Write-Once format with a storage lifetime that's intended for sharing music, organizing your media library, or archiving important business or personal data.CD-Rs are compatible with most standard CD readers, which means that after you burn your favorite tunes to a CD-R, you can play them back on most home or car stereos.With 700MB of space on each disk, you can store up to 80 minutes of standard audio, 150 songs in mp3 format, or up to 350 photos (this number varies widely depending on file format and size).52X Write Speed: Quick and ConvenientAmazonBasics CD-R disks enable fast write speeds up to 52X (52X is maximum. Burning speed will fluctuate.) for quick, clean data transfer. (To take full advantage of these speeds, your CD burner must burn at speeds of at least 52X. Consult your computer or CD burner product manual for this information.)At 52X, transfer speed translates to 7.8 MB/s, which means that you can burn a full disk in a minute and a half. Plus, quality construction minimizes errors and improves performance.AmazonBasics: Quality Products at Low PricesAmazonBasics is a collection of consumer electronic \"basics\" created by combining quality and low prices for an overall focus on value.Amazon Frustration-Free PackagingThis AmazonBasics product features Amazon Frustration-Free Packaging that is recyclable. It comes without excess packaging materials such as hard plastic clamshell casings, plastic bindings, or wire ties. The packaging is designed to be opened without the use of a box cutter or knife, and it will protect your product just as well as traditional packaging. Products with Amazon Frustration-Free Packaging can frequently be shipped in their own boxes, without an additional shipping box, saving on resources and reducing waste. In addition, the packaging materials that we do use are easily and frequently recycled, composted, or reused by our customers, and all the inks and dyes are biodegradable.Warranty and Helpful HintsThese disks are backed by an AmazonBasics 1-year limited warranty. To view the full AmazonBasics warranty,click here. If you are having trouble with these disks,click herefor the AmazonBasics CD/DVD Helpful Hints Guide [PDF].What's in the BoxSpindle of 50 52X CD-R disks and warranty card.", "categories": [["Electronics", "Accessories & Supplies", "Blank Media", "CD-R Discs"]], "title": "AmazonBasics 700MB 52x CD-R (50-Pack Spindle) (Discontinued by Manufacturer)"}