{"asin": "B002IKLJU0", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The Panasonic Lumix DMC-FZ35 features AVCHD Lite, High Definition (HD) video recording capability, combined with a powerful 27mm wide-angle, 18x optical zoom Leica DC lens. A successor to the popular FZ28, the FZ35 packs enhanced creative features combined with the power to shoot HD videos, including motion zoom capabilities to take full advantage of the 18x zoom.  The operational layout of the FZ35 includes a dedicated video record button, making it a true hybrid--a single model that performs seamlessly at capturing both still and motion images--while still providing smooth and easy operation in either mode.For users looking for increased creativity while shooting both video and still images, the Lumix FZ35 delivers.  New manual controls and creative options, include:Creative Movie Mode: Allows the user to set the shutter speed and aperture manually to make even more impressive movies. Changing the shutter speed brings special effects to movies, which is especially suitable for shooting fast-moving subjects. The ability to control the aperture is convenient when there are several subjects at different distances.My Color Mode: This special option gives free reign to the user&rsquo;s creativity. The color, brightness and saturation parameters can be freely adjusted while seeing how the adjustments affect the picture, live on the monitor.High Dynamic Mode: Helps to capture a scene with moderate exposure even though the scene may contain both bright and dark areas.The 12.1-megapixel-FZ35 features the upgraded POWER Optical Image Stabilizer (O.I.S.), which allows for double the repression power compared to the conventional image stabilization system, MEGA O.I.S., and ultra high-speed Auto Focus (AF) for capturing action scenes as they happen. Additionally, with the super-powerful 18x optical zoom lens, it is easy to capture subjects that are far away or take dramatic close-ups.With the enhanced energy-efficient image processing LSI--the Venus Engine HD--the FZ35 has an extended battery life of approximately 470 pictures, making it the ideal choice for active photo enthusiasts. As with all Panasonic Lumix cameras, the FZ35 features Intelligent Auto (iA) Mode, a suite of intuitive technologies including Face Detection, Intelligent Scene Selector, Intelligent Exposure and Face Recognition. With the improved Face Recognition, the FZ35 recognizes up to three faces simultaneously while taking photos and allows users to specify the age of the registered subject. When babies under 3 years-old are registered, the camera will automatically switch to Baby mode if the baby appears to be in the frame.AVCHD Lite--Beautiful HD movies, extended shooting timeThe FZ35 records HD movies with 1280 x 720-pixel resolution. It uses the AVCHD Lite format (MPEG-4/H.264) to achieve higher image quality while storing less data than the conventional Motion JPEG. Plus, the FZ35 is equipped with an HDMI output terminal for direct transmission of digital image and sound signals. Just connect the camera to an HDTV using a single HDMI mini cable (optional) for fast and easy slideshow enjoyment.Wide-angle 27mm Leica DC Vario-Elmarit lens and 18x optical zoomThe bright F2.8 Leica DC Vario-Elmarit lens ranges from 27mm wide-angle all the way to 486mm telephoto. Combined with the double* corrective power of the improved Power O.I.S., this makes it possible to capture subjects clearly without hand-shaking, even in the telephoto range.*Panasonic comparisonCreative Movie modeYou can adjust the aperture and shutter speed any way you like. This mode gives you a wider range of expressive possibilities to explore in your movie making.Zoom-in movieYou can zoom in and out while shooting movies.Stereo micThis camera features Dolby&reg; Digital Stereo Creator, which records dynamic, true-to-life audio to bring out the power of your HD images.IA mode (Movie)You can also use iA mode to shoot movies, and let the camera do all the work for you.High-speed response for truly intuitive shootingEnjoy high-speed 1.2-second start-ups, AF speeds of approximately 0.3 second, and up to five consecutive shots at 2.3 frames per second with full resolution. You can also take up to 470 photos with a single battery charge (CIPA). This comfortable level of performance lets you capture even the most fleeting shutter chances.My Color mode puts you in control of the colorIn this mode, you can freely adjust the color, brightness and saturation parameters. This makes it easier and more fun to create interesting, expressive images. Adjust the settings that best suit the shooting conditions and your expressive intent, and then enjoy your own photography.", "title": "Panasonic Lumix DMC-FZ35 12.1MP Digital Camera with 18x POWER Optical Image Stabilized Zoom and 2.7 inch LCD", "price": 489.77, "salesRank": {"Camera &amp; Photo": 3528}, "imUrl": "http://ecx.images-amazon.com/images/I/41Q9XAL5whL._SX300_.jpg", "related": {"also_bought": ["B002MGNCG4", "B006ZNYSX6", "B0039BPG1A", "B002MGQO64", "B001UE6N6A", "B003I95ASC", "B005QEL7X4", "B003VNKNEQ", "B009656D3I", "B003WJR694"], "bought_together": ["B0039BPG1A"], "buy_after_viewing": ["B0039BPG1A", "B003VNKNF0", "B006ZNYSX6", "B00DY2Y28M", "B00DY2Y28M"]}}