{"asin": "B004477OAY", "description": "If replacing busted buds over and over again is getting old, when you step up to iBeats, you not only get stylish in-ear headphones built to last. You also hear what you've been missing. Engineered to deliver extraordinary HD audio from your iPad, iPhone, or iPod, it's amazing how such a big sound comes out of so compact a package. And once you go iBeats, you never go back.Features&middot;&nbsp;Signature Beats sound and iconic Beats style in sleek, compact design&middot;&nbsp;Solid metal housing resists vibrations for purest sound without sonic side effects&middot;&nbsp;ControlTalk on-cable mic for convenient hands-free calling with iPhones and smartphones&middot;&nbsp;ControlTalk track seeking capabilities without touching your iPod or music phoneSpecially Designed for iPad, iPhone, and iPodAdvanced engineering reproduces high resolution sound from your iPad, iPhone, or iPod for a listening experience other buds are unequipped to deliver.Extended Full Range Sound from Compact ln-Ear HeadphonesExclusive driver design pumps out the deepest bass, soaring highs, and ultra-clear midrange so you can stop hearing the music and start listening to it.Ultra-Lightweight Yet Super ToughLightweight for listening while exercising or when you're on the go. Hard chrome earphone finishes for rugged durability and everlasting shine.Solid Metal Housing for the Purest Sound PossiblePrecision-machined single-billet metal housing prevents vibrations and unwelcome sonic artifacts from tainting your listening experience.Built-in Mic for Hands-Free Calls and Online ChatsControlTalk's built-in mic lets you talk hands-free on your iPhone or music phone. It even works with online voice or video chats on iPad, iPhone or iPod touch.Control iPhone and iPod the Easy WayControlTalk gives you on-cable playback control of your iPad, iPhone or iPod, including pause, next track and volume.Noise IsolationSealed in-ear construction and multiple eartip designs block out external noise so you hear more of the fine details in your music and less outside noise.Custom FitEveryone's ear canals are different, so we give you multiple sizes to experiment with. Find the fit that's most comfortable, noise-isolating, and secure for you.What's in the box:Headphones5 pairs of standard Monster designed ear-tips2 pairs of different sized triple layer \"Airlocks\"Carrying case", "title": "iBeats Headphones with ControlTalk From Monster&reg; - In-Ear Noise Isolation - Black", "price": 74.46, "imUrl": "http://ecx.images-amazon.com/images/I/41TIZ-SvBIL._SY300_.jpg", "related": {"also_bought": ["B00B2A1OD4", "B004921NKQ", "B007VL8Z9O", "B004477OBI", "B004477OB8", "B003FNWIRC", "B008CQVUZS", "B0073YC5ZE", "B003I65U2G", "B00C79DW7U", "B008DS0W18", "B008CS9O8Q", "B008CQVSXC", "B00GEPT8EO", "B008CS9M9C", "B008CQVWN8", "B007G4O5IG", "B00ETI275K", "B008CS5ZRU", "B00FJRPD8I", "B000B4ZY2E", "B00ETI1I8W", "B00ETI15VC", "B008EQ1Z0Q", "B00GJVF766", "B008CS5QTW", "B00KQPQFLM", "B0090WVHJ2", "B008FQMUYK", "B0097BEFI6", "B00746W3HG", "B0097BEE9Q"], "buy_after_viewing": ["B0073YC5ZE", "B004921NKQ", "B008CQVUZS", "B008CS9O8Q"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]]}