{"asin": "B00062QY5W", "description": "Odds are, your computer is a primary source of entertainment. So why rely on standard computer speakers when so much rich content resides at your fingertips? Step up to Bose's Companion 2 speakers and unleash your computer's true potential with powerful, full-range sound for CDs, DVDs, MP3s, streaming videos, games, and more. Companion 2 speakers enhance the subtleties in your music while also enriching the rousing resonance of movie and game sound effects. Think of them as giving new voice to your computer. And with Bose TrueSpace stereo signal processing, that voice really has some reach. Whether you set the speakers next to your monitor or place them farther apart, you'll enjoy a spacious, dramatic soundstage that seems to extend beyond the desktop.The sleek and compact speakers fit easily in their surroundings to save useful desk space, while the dual inputs connect to both your computer and portable audio sources at the same time. The system also features a volume control and headphone jack on the front of one speaker to provide easy control over your listening experience. And users won't have to worry about video interference, as the speakers are magnetically shielded to ensure a crisp, uninterrupted picture.Features include:TrueSpace surround digital processing circuitry helps maximize audio performance by widening the image of closely placed speakersPorted cabinet design delivers clear, deep low musical tones and movie/gaming special effects from a small enclosureDual inputs for connecting to computer and portable audio device simultaneouslyConvenient control and jack placement offers easy access to volume, headphone jack, and connection for second sourceMagnetically shielded design lets speakers sit in close proximity to monitor without interfering with the picture qualityAutomatic tonal balance adjustment automatically adjusts tonal balance for rich, convincing audio performance at practically any listening levelWhat's in the BoxPowered speaker, accessory speaker, audio input cable with mini plug, audio input cable with RCA plugs, speaker cable, AC adapter, rubber feet, user's manual.", "title": "Bose Companion 2; Multimedia Speaker System", "price": 99.0, "imUrl": "http://ecx.images-amazon.com/images/I/51QGNB4B0RL._SY300_.jpg", "related": {"also_viewed": ["B00CD1PTF0", "B005TLTOLG", "B000HZDF8W", "B00B3C57AM", "B0053T4PHC", "B0028N6YH0", "B005FE72Q6", "B000WS5VNQ", "B001RNOHDU", "B00064X4QM", "B00EZ9XKCM", "B00CXLK1X0", "B0062S88OY", "B002FU5QLQ", "B00GNHPFRW", "B00EQHCP38", "B0041QBAIA", "B008H7MF4W", "B00BI8ISHU", "B0092PDT20", "B00011CNWG", "B0027VT6V4", "B00ESKS9L0", "B002LGXD3C", "B002FU5QMA", "B006PJXU84", "B000IE8Z4Q", "B00F8HRSN2", "B003CP0OT2", "B00006I53A", "B000IF4788", "B0025VKUQG", "B009XGH2HG", "B008F2YEN4", "B000K7LQUQ", "B007GF9N96", "B00113PUJQ", "B00AFQZ4AU", "B00CQ7ZGEU", "B00EZ9XKDG", "B00EVWX5UK", "B001IZYV3S", "B00BZ7MALY", "B000MCKALA", "B0025VKUQQ", "B00006B9W3", "B000ZH98LU", "B001QXDSKE", "B00F8HRTCC", "B007PXV2KM", "B004ULOZPQ", "B00BZ7MATG", "B00556TKRI"], "buy_after_viewing": ["B00CD1PTF0", "B0027VT6V4", "B005TLTOLG", "B00EZ9XKCM"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]]}