{"asin": "B002NIP2SM", "description": "Battlefield Bad Company 2is a first-person shooter, and sequel to Electronic Arts' 2008 release,Battlefield Bad Company. Following the continuing combat adventures of misfits of the US Army's Company \"B,\"Bad Company 2features the characteristic humor and grit of theBad Companyseries, as well as a variety of gameplay improvements and additions, including 2-24 player online support; all-new four man squad gameplay; and more.&nbsp;.caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Story and GameplayLike the originalBattlefield: Bad Companygame,Bad Company 2is a first-person shooter following the exploits of Company \"B\" of the US Army's 222nd Battalion. In this new adventure, the more mature yet still infamous company of misfits are tasked with interceding in a series of conflicts that have the potential to ignite of a new World War. Game environments cover snowy mountains, all the way to jungles and deserts.Classic military combat gameplay.View larger.New destructive abilities.View larger.Ultimate online vehicle warfare.View larger.New squad-based play options.View larger.Four available character classes.View larger.As the action begins players have their pick of four distinct character classes, and weapons, gadgets and specializations. Within these, players have over 15,000 kit variations to discover, and will be able to fine-tune their preferred fighting style to give them the edge in combat that they will need to survive and prevail. In addition, new vehicles like the all terrain vehicle (ATV) and the UH-60 transport helicopter allow for new tactics, which players are free to choose from. As players fight through mission play they will level up their playable character through the ranks as they accumulate experience points in combat for enemies eliminated and objectives completed. Excellence in the battlefield is rewarded with an extensive range of pins, insignias and stars to unlock along with 50 dedicated ranks to achieve.Battlefield 2also features a major multiplayer component. Along with standard 24-player online multiplayer options across eight maps, players can also compete in 4-player teams in 2 exclusive squad-only game modes, fighting together to unlock exclusive team awards and achievements. During these online battles players can spawn on your squad to get straight into the action, and use gadgets such as the tracer dart in-conjunction with the RPG to devastating effect. Taken together these features make for one of the most realistic ground/vehicle combat experiences ever.The New Frostbite EngineTactical destruction inBad Company 2is taken to new heights with the updated DICE 'Frostbite' engine. Unlike in the first game in the series, which featured considerable, but limited destructible game environments, inBattlefield Bad Company 2players can now take down entire buildings or create their own vantage points by blasting holes through cover, thereby delivering a unique dynamic experience in every match.Key Features8 huge multiplayer maps. Each with a different tactical and gameplay focus and set across a variety of environments.Ultimate online vehicle warfare. 15 land, sea and air vehicles, each with a tactical advantage during play. Race into action with the ATV or rain death from above in the UH-60 transport helicopter with its 2 side-mounted rail guns.Intense single player action in dense jungles to snow-torn mountains, following the mature \"B\" Company on a daring new mission.All-new squad gameplay. Team up with 3 other players and fight together to unlock special awards and achievements in 2 squad-specific game modes.Destruction 2.0. Take down entire buildings, create firepoints or blow it up entirely. InBattlefield Bad Company 2there is be no place to hide.'Play It Your Way' experiment and refine your ideal combat style with 4 character classes (medic, assault, recon and engineer), 15,000+ kit variations, 46 weapons (200 different customization opportunities), 15 gadgets and 13 character specializations.Combat efficiency and performance is rewarded with special awards such pins, stars and insignias which contribute to unlocking 50 ranks.System Requirements:Minimum Specifications:Recommended Specifications:OS:Windows XP, Vista or Windows 7.Processor:Core 2 Duo @ 2.0GHzQuadcoreRAM:2GB2GB+Disc Drive:8x DVD-ROM drive or betterHard Drive:10GB or moreVideo Card:256MB GeForce 7800 GT / ATI X1900512MB GeForce GTX 260Input Device:Mouse and keyboard, gamepad", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51TiTI2M65L._SY300_.jpg", "related": {"also_bought": ["B002ZJPYHS", "B002I0HJZO", "B007H2V9W2", "B001CC8UBG", "B00269QLJ2", "B000YJ3TR8", "B00503EAG2", "B003Q55Y5C", "B002BS47YE", "B001AWBYRA", "B0006SL93I", "B003JVF728", "B00022Q0RI", "B000B63RSA", "B001E6DG6Y", "B00EDJLXHI", "B003GSZAOY", "B008OQTUKS", "B0001AO01Y", "B007XVTR12", "B001Q96ZNU", "B000UB3B3W", "B0050SZ0SY", "B0050SZ0JI", "B002I0HKRQ", "B003P9C6EQ", "B00178631E", "B0050SZ2EQ", "B004PFS9TU", "B003VOQFOM", "B005G4CXPK", "B003ICGL7I", "B0076DO5A0", "B000067O0Q", "B001O4YSTU", "B003O6CB6S", "B000PS1HMM", "B0016N4A7E", "B00BU3WUU4", "B002I0HFNU", "B003EZ1KGQ", "B0014UGK4U", "B005C2D2H4", "B002I0IHIM", "B000X9FV5M", "B0013RC1W4", "B003TIVSM4", "B000922E0S", "B003ZULWQI", "B00007M5D8", "B000U88T28", "B002I0HJ68", "B009SHV7Y4", "B002SRP9VI", "B0000A1VER", "B000KIBABA", "B001TOMR84", "B002GDRPYI", "B001VJ4DHK", "B003L8DXS4", "B0050SWTS8", "B000N4JENW", "B002V14VOC", "B0050SZ836", "B00KAED6Y8", "B0037M07UG", "B000TTFLS8", "B001AWIP0Y", "B007RY6KYC", "B0079NGSDO", "B002I0HFBC", "B001EM7TUC", "B000FJSIUA", "B004FYKWZU", "B000PS2XES", "B005THAX60", "B004FUGKSW", "B001B5U80K", "B001LKM0EW", "B002I0KOSI", "B00488PZ0U", "B008E6ZXA4", "B004M2DWGQ", "B000Z3VI3K", "B004CD9X2W", "B000WSE2WM", "B000GRB4G6", "B00CPKUV9I", "B001IK1BWC", "B0018BOL1E", "B000VV9T7S", "8176503290", "B0009IX7K8", "B004D8QAAO", "B002BXKJA0"], "bought_together": ["B002I0HJZO", "B007H2V9W2"], "buy_after_viewing": ["B002I0HJZO", "B007H2V9W2", "B00503EAG2", "B002ZJPYHS"]}, "salesRank": {"Video Games": 4892}, "categories": [["Video Games", "PC", "Games"]]}