{"asin": "B0042TW3J6", "description": "LinkStation Pro&trade;Shared Network StorageLS-VLHigh Speed Shared StorageNovaBACKUP IncludedFree WebAccess ServiceAccess Data with i AppMultimedia ServerBitTorrent&reg; DownloaderLinkStation Pro LS-VL network storage offers instant storage expansion and file access on your home network and over the Internet.  Significantly faster than a USB 2.0 hard drive, LinkStation Pro features a fast 1.6 GHz processor and DDR3 RAM for maximum transfer speeds  up to 76 MBps. Simply plug it into any network Ethernet port or into the back of your wireless router and instantly access it on any networked  computer in your house. While on the go, use Buffalo&rsquo;s free WebAccess service for remote access to your files over the Internet from any  standard Web browser and download the free WebAccess i apps from the iTunes&reg; store to access and share files from your iPhone&reg;, iPod touch&reg;  and iPad&reg;. Included NovaBACKUP&reg; Professional software for Windows&reg; and Time Machine&reg; support provide a whole home backup solution for every  PC and Mac&reg; on your network. LinkStation Pro makes central storage and backup easy.Network Attached StorageConnect LinkStation Pro to any Ethernet port or to the back of your wireless router and instantly access storage from any computer on the network.  Store or back up digital photos, MP3s and documents on one hard drive and access it from any computer simultaneously.Shared folders can be accessed by everyone on the networkProtect private folders and files from unauthorized accessBack up every computer on your home network to one locationHigh SpeedOptimized for maximum transfer speed, LinkStation Pro utilizes an upgraded processor and RAM, offering greater than 2X the data transfer  speed of competing devices.1.6 GHz processor speedDDR3 RAMTransfer speeds up to 76 MB/sTurboPC for Windows enhances the overall performance of your PC and increases file transfer speeds up to 35%Whole Home BackupFive copies of NovaBACKUP Professional for Windows and a built-in Time Machine Server allow for back up of all PCs and Mac computers in your  home to a central, always available storage device. Put an end to moving USB drives between multiple computers.Free WebAccess ServiceAccess and share your files quickly and securely from any computer over the Internet with a standard Web browser. BuffaloNAS.com makes  sharing and accessing remote files easy. It even resizes your photos for optimized streaming over the Internet.Access Data From Your iPod touch, iPhone or iPadFree Buffalo WebAccess i apps on the Apple iTunes App Store allow you to access your LinkStation and those of friends and family. Upload photos  and videos to an authorized LinkStation or access terabytes of multimedia files and documents directly from your Apple mobile device or a computer.Multimedia ServerAn integrated DLNA Certified&trade; server streams multimedia content to any DNLA or uPnP A/V media playback device such as PS3&trade;, Xbox 360&reg;, many  network enabled TVs, digital photo frames, etc.BitTorrent&reg; DownloaderPowered by the leading BitTorrent client, uTorrent, LinkStation Pro can download any BitTorrent files automatically without your PC being on.   Simply paste a torrent URL into the LinkStation uTorrent application and then turn off your PC.Key Features and Benefits:Shared Storage:Store or back up files from multiple PCs, laptops or Mac computers in one central locationFree WebAccess and WebAccess i apps for iPod touch, iPhone and iPad:Access and share your photos, music, videos or data files with friends, family and colleagues over the Internet with any standard Web browser or on your iPod touch, iPhone or iPad for free.DLNA Certified and iTunes Servers:content directly to any DLNA compatible media player or use LinkStation Pro as a content source from within your iTunes applicationBitTorrent Client:Download digital content over the Internet directly to your LinkStation ProNovaBACKUP Professional:Includes an easy-to-use, complete backup solution for up to 5 of your home and home office Windows PCsTime Machine Compatibility:Use the LinkStation Pro with Time Machine backupUSB 2.0 Port:Attach a printer to the network, add a USB hard drive for additional storage or backup or connect to a UPS for AC power failure managementECO-Minded:With the power savings feature, you regulate the power usage of your LinkStation at predetermined times, shutting the unit down and reducing energy consumptionTurboPC with TurboCopy:Enhance the overall performance of your PC and increase file transfer rates up to 35%No Annual or Monthly Fees:To use any features or services, including WebAccess with iPhone and iPad support, or to add multiple users and groupsNetwork Servers:FTP and print servers included with the firmwareDirect Copy:Plug in your USB hard drive or camera to quickly offload picturesFree 24/7 Tech Support:US-based tech supportBuffalo&rsquo;s LinkStation Pro LS-VL is backed by a one-year limited warranty and lifetime 24/7 US based technical support.What's in the BoxLinkStation Pro LS-VL, Setup CD-ROM, Quick-Setup Guide, Ethernet Cable, AC Adapter, Warranty Statement", "title": "BUFFALO LinkStation Pro 2 TB High Performance Network Attached Storage (NAS) - LS-V2.0TL", "price": 169.99, "imUrl": "http://ecx.images-amazon.com/images/I/41MGDylKwML._SY300_.jpg", "related": {"also_bought": ["B005PVXI0S", "B005PVXH18", "B00CO0DIHQ", "B0048TWIX6", "B00D695GS8", "B00365MF5E", "B0000BVYT3", "B005SHQ644", "B001QUA6RA", "B0028H1G9C", "B000QZ3UG0", "B005H3I38Q"], "buy_after_viewing": ["B005PVXH18", "B00CO0DIHQ", "B00EVVGAFI", "B005PVXI0S"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "Network Attached Storage"]]}