{"asin": "B000VE2RP6", "categories": [["Electronics", "Computers & Accessories", "Data Storage", "USB Flash Drives"]], "description": "The latest addition to the Xporter XT family, the Patriot Xporter XT Boost USB flash drive is many things in one: fast, spacious, durable, and highly compatible. The 8 GB drive offers an extremely fast transfer rate of up to 200x, making it one of the fastest USB flash drives available. As a result, you'll enjoy blistering fast access to your data whether you're transferring movies, photos, music, or other info. The drive is also extremely durable, with a water- and shock-resistant rubberized housing that protects the device from accidental drops, liquid spills, and other mishaps. Perhaps best of all, the Xporter XT Boost works with virtually every modern OS, including Windows 7, Windows Vista, Windows XP, Windows 2000, Windows Me, Linux 2.4 and later, Mac OS 9, and Mac OS X and later. To use, simply plug and play.The drive--which is Hi-Speed USB 2.0 compatible (and is backwards compatible to USB 1.1)--is backed by a lifetime warranty.The 8 GB Xporter XT Boost USB flash drive offers speeds of up to 200x.SpecificationsType: USB flash driveCapacity: 8 GBImage storage: 7,002 images (3 megapixels), 3,225 images (5 megapixels), 2,695 images (6 megapixels)MP3 storage: 9,096 minutes (128 kbps), 6,824 minutes (160 kbps)WMA storage: 10,496 minutes (96 kbps), 8,024 minutes (128 kbps)Movie storage: 1 movie (DVD .iso, 4.7 GB)Driverless compatibility: Windows Me, 2000, XP, and Vista; Mac OS 9.x, OS X, and higher; Linux with USB storage supportDimensions: 2.9 by 0.75 by 0.43 inches (W x H x D)Weight: 0.5 ouncesWarranty: LifetimeDesign and QualityAll Patriot Memory products are designed to respond quickly and intelligently to the rapid changes inherent in the technology sector. This commitment to R&D; helps Patriot deliver the best-quality memory modules powered by the latest innovative technology. The company's manufacturing process begins with high-quality components and ends with rigorous functional testing to ensure each module's reliability and compatibility. Patriot Memory modules are approved by such leading motherboard and system manufacturers as Intel, Tyan, Supermicro, and Iwill. Patriot is also a member of the Apple Developer Connection, and has earned awards from such leading product review sites as XBit Labs, Anandtech, Tom's Hardware, and Hot Hardware.com.About Patriot MemoryEstablished in 1985, Patriot Memory builds a full range of memory module and flash memory products, including Extreme Performance (EP), Signature Lines (SL), and Flash Memory (FM) solutions. The company--which has sales offices located throughout the U.S. and Asia, along with distribution channels throughout North America, Europe, Asia Pacific, the Middle East, Africa, and Latin America--is dedicated to becoming the vendor of choice for the computer and consumer electronics industries, with a commitment to service and quality that exceeds all other brands. Headquartered in Fremont, California, Patriot Memory maintains state-of-the-art manufacturing facilities in both Fremont and Taipei, Taiwan.", "title": "Patriot Xporter XT Boost 8GB USB 2.0 Flash Drive (PEF8GUSB)", "price": 64.99, "imUrl": "http://ecx.images-amazon.com/images/I/31FROSJbf8L._SY300_.jpg", "brand": "Patriot", "related": {"also_bought": ["B007JPVT8G", "B007JPVVOI", "B007JPVYFO", "B003WUX6QK", "B003WUX6RO", "B002SZEOLG"], "bought_together": ["B002SZEOLG"], "buy_after_viewing": ["B007JPVT8G", "B007JPVVOI", "B007JPVYFO", "B008R6OPJQ"]}}