{"asin": "B0012W7HQK", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Memory Cards", "SD & SDHC Cards"]], "description": "From the ManufacturerSanDisk Ultra&reg; II SDHC&trade; 16 GB Memory CardCatch whatever life throws your wayThere&#8217;s never a dull moment&#8212;or at least it feels that way&#8212;when you can shoot and transfer photos and videos like the pros. That means capturing and sharing all your favorite photo and video opps with a SanDisk Ultra&reg; II memory card. It&#8217;s so fast, you&#8217;re always ready for the next shot, plus so rugged that environmental conditions will never hold you back. With SanDisk Ultra&reg; II memory cards available in CompactFlash&reg; and SD&trade; formats, and superior speeds that let you transfer from your camera to computer in a snap, you&#8217;re ready to go where the shot takes you.Video is the new photoOnly video tells the whole story. So get the larger capacity SanDisk Ultra&reg; II SD cards that give you plenty of room to keep on shooting. Larger capacities, like 8 GB or 16 GB are the perfect way to shoot more video on your point-and-shoot camera.Maximize your camera&#8217;s performanceKeep shooting without fear of running out of spaceGet dependable performance every timeDon&#8217;t come up short, store more photos and videos* 15MB/s Read, 9MB/s Write. Based on internal testing with TestMetrix; performance may be lower depending upon host device. 1 megabyte (MB) = 1 million bytes. ** 1 gigabyte (GB) = 1 billion bytes. Some capacity not available for data storage. *** Excludes Germany and other regions which do not recognize limited warranty.Choose SanDisk, the minds behind flash memoryAs the pioneers of flash memory, SanDisk is known all over the planet. Wherever people take pictures, listen to music, use cell phones&#8212;or do much of anything at all with digital devices&#8212;they&#8217;re likely to be using a SanDisk memory card. That&#8217;s because, after 20 years in the business, SanDisk has never stopped innovating.", "title": "SanDisk Ultra SDSDRH-016G-A11 16 GB Class 6 SDHC Flash Memory Card", "price": 9.99, "imUrl": "http://ecx.images-amazon.com/images/I/51A5vKkkxKL._SY300_.jpg", "brand": "SanDisk", "related": {"also_bought": ["B0026T3TYW", "B004M8SVFM", "B0040V08M0", "B00427ZLS8", "B002GEVZPC", "B003ZYF42C", "B004VTRT1Y", "B004WXUXXU", "B0058DX9HK", "B001DO2XWA", "B00427ZLTW", "B0042RUSY0", "B0073HSHJY", "B004R1FKDA", "B00427ZLTC", "B001DO2XZC", "B00427ZLSS", "B004M8SVG6", "B005XEE5IG", "B004W40G1S", "B0071C7BTI", "B003ZSHNI6", "B003ZSHNHM", "B004M8SVFW", "B0036ORZEQ", "B005HX15C2", "B004N91BK2", "B0058DX9KM", "B004VTKOFM", "B002UZAFSK", "B0034XIM82", "B004B738PW", "B0073HSHOE", "B002KGG344", "B002DQV0PS", "B00427ZLUQ", "B004VRQNS6", "B006ZMR9FG", "B0042RUSYA", "B0055UF69A", "B009SE6KPI", "B005IGVXP2", "B0049I48JI", "B0036ORZE6", "B0024FACYI", "B0047EPBDQ", "B002FB5HD2", "B0014VY28A", "B0073HSHSU", "B000J5LA9Q", "1118004728", "B007RB0VJK", "B003BQ8246", "B0000A1VS3", "B005HNF01O", "B0058OGZIY", "B003ZYF3M8", "B0092ZPHFM", "B0046D4ZG2", "B007M51J42", "B007M51J3I", "B00B7N9C4Y"], "bought_together": ["B0026T3TYW", "B002GEVZPC"], "buy_after_viewing": ["B007M51J42", "B007M51J3I", "B007BJHETS", "B007JRB0SS"]}}