{"asin": "B007SP2CO2", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]], "description": "DJs can put in some long hours as they spin the tunes and they need equipment that is both comfortable and rugged enough to withstand heavy use. These Monoprice Pro Headphones are designed for the professional sound spinner and the casual listener that wants the best quality sound and best durability available.The earpieces on these 'phones are equipped with thick, comfortable padding that keeps the music inside and the noise outside. They swivel up to 90 degrees so they can double as a makeshift set of speakers. The headphones can extend up to 1.5\" on each side and are wide enough to fit over a cap, while maintaining good contact over the ears. The headpiece is also padded on the inside and is made of flexible rubber, ensuring that it won't break.The headsets do not have a fixed wire. Instead, there is a 3.5 mm jack in the bottom of the left earpiece, which allows a standard 3.5 mm audio patch cable to be inserted. This means that if you break a wire, you don't have to throw away the headphones or make a messy repair; just get a new cable and you're ready to rock again!The 50 mm drivers and 100 dB sensitivity ensure that these 'phones produce good volume and premium sound clarity at all frequencies. The kit comes with two 3.5 mm male-to-male, gold-plated audio cables and a 3.5 mm to 1/4\" gold-plated adapter plug.The thicker cable is over 11.5 ft long and is well suited for professional work and for laying back on your couch to enjoy the tunes. A thinner, lightweight cable is also included, which measures about 50\" in length and is better suited for more portable operations.High-quality sound, supreme durability, and maximum comfort. These ARE the 'phones you've been looking for!", "title": "Monoprice 108323 Premium Hi-Fi DJ Style Over-the-Ear Pro Headphone, Black", "price": 33.48, "imUrl": "http://ecx.images-amazon.com/images/I/41HLwjRxwYL._SX300_.jpg", "brand": "Monoprice", "related": {"also_bought": ["B00B8QCMHY", "B00029MTMQ", "B007VEQ2UU", "B00DIGD1IG", "B0041A3P5W", "B0016MF7W2", "B00HPPI0W8", "B000067RC4", "B00AJHCJ2Q", "B0053KWDES", "B00E4LGU1Y", "B001WHY3JO", "B0013OWPV4", "B004HIN97M", "B004RC2SDO", "B003M8NVFS", "B0002E52S4", "B00HG1L334", "B00DIGD3TS", "B00007E7C8", "B00CI3BLPA", "B003WU6KFO", "B004JRYLG4", "B003LSTD38", "B005HJWWW8", "B003LMN5N8", "B001TH7GUK", "B004CADYDO", "B00BFOEY3Y", "B005HGM1D6", "B00CJ7IUGS"], "bought_together": ["B00029MTMQ"], "buy_after_viewing": ["B00HTPHK5W", "B00007E7C8", "B0013OWPV4", "B00B8QCMHY"]}}