{"asin": "B001C4C4KW", "description": "The third American release in theDisgaeaseries by Japanese game developer and publisher Nippon Ishi,Disgaea 3: Absence of Justicemarks the arrival of this acclaimed and beloved strategic RPG franchise into the Next-Gen gaming era. A PlayStation 3 exclusive,Absence of Justicefeatures high-definition graphics, including beautiful high-res 2-D sprite character art and stunning spell effects. And although it is the third in a series of games, its story and gameplay stand on their own, allowing players both new to and experienced with the humor, zany characters, thrilling action, and unmatched excitement of theDisgaeauniverse to jump right into the battle.Disgaea goes Next-Gen on PS3Search for clues and advice in conversations.View larger.Enjoy 3-D play across geo blocks.View larger.Level up weapons and gear with 'item world'.View larger.'Magichange' makes weapons of characters.View larger.Inflict damage with the 'Stack Attack'.View larger.The Story of Mao, a Demon Gone BadSet in and around the &#145;Nether Institute, Evil Academy,&#146; the demon version of the preppiest of prep schools,Disgaea 3: Absence of Justicefollows the puzzling decision of Mao, son of the Overlord of the Netherworld, who after reading a manga comic book decides to forsake his proper demonic upbringing, become a hero and attempt to overthrow his father. But in the backwards world of demon scholastics where good is bad and bad is good, Mao is a top honor student. He knows all about ditching school, being totally unhelpful and quickly resorting to violence, but nothing of the selfless nobility and patience of heroes. Heroes are for delinquents, as the number one delinquent of the Nether Institute, Raspberyl and her friends try to tell him. But Mao&#146;s mind is made up. It's a hero he will be.Flow of Gameplay: Events &rArr; Base &rArr; Battle &rArr; RepeatEvents: Players advance through the game as events unfold. These events can occur during the story, at your base, or before/after battles. You will be able to witness the fun and interesting interactions through a mixture of sprite animation and exciting character battles.Base: Mao's school, the Nether Institute, Evil Academy is the base point of the game. Players will be able to prepare for upcoming battles here by purchasing new weapons and items, customizing characters and/or restoring health.Battle: You will be fighting against enemies in battle scenes with a quarter view, tactical simulations. The goal is to defeat all of the enemies before all of your team members die. Battles utilize a turn-based system, where all of your team members will have their turn to attack before enemies begin theirs.Character Customization: The Evility SystemCharacter customization is crucial in all role-playing games.Absence of Justiceallows for maximum character customization through its \"Evility System.\" There are two different categories of evilities: evility that is already set for each character depending upon the jobs of each and evility that players can customize. Customizable evilities include: evility to acquire the special skills for certain weapons, evility to up character status under certain requirements, evility to up the amount of experience points earned, evility to enable special skills and functions, etc. This variety is powerful and important. You may have only one kind of evility that supports a character's status, but you may have multiple evilities for skills. Use this system to create and customize your characters and ideally group multiple evilities in one to conduct battles more efficiently.TheDisgaea 3Battle SystemCombat inDisgaea 3: Absence of Justiceconsists of a combination of the franchises familiar standard system of attacks, along with a whole new array of moves debuting with the game. This wide range of possibilities allows players to pick and choose tactics that suit the immediate conflict before them or to quest for overall success in the game, and maximum fun by attemping to master all. Attacks and skills include:Team Attack- Use up to four adjoining team members to help you attack adjoining enemies. Although this may seem random, it is actually closely connected with the team members you have selected in class and their special skills.Combos- Combos happen when multiple team members attack the same enemy during a single turn. They can occur even when team members are not on adjoining squares and their effectiveness increases with the number of occurring combos.Lift and Throw- Humanoid characters have the ability to lift and throw enemies or teammates. The distance of a throw depends on the thrower and lifted team members are safe from attack, making this a key defensive tactic.Stack Attack- If you keep using the lift command, you will be able to create a tower of characters. Select the attack command while in that state and all stacked characters will begin to attack. The larger the stack the higher the damage to your enemies.Double Throw- If one of your characters stacked in a tower selects the \"throw\" command you can choose to throw any of the stacked characters. This is a useful skill when you want to reach a floor that is too high to reach on your own.Throw and Receive- Useful in moving long distances, when you throw a character towards a monster teammate he/she will knock the thrown character further away in the direction faced.Geo Effect- The combination of geo panels and geo blocks is called the 'Geo Effect.' The special effect of a block on top of a panel will affect all panels of the same color. You gain the power of those effects by landing on the right block.Uniting Skills- If you meet certain requirements during a combo, two skills will unite into one, increasing damage and depending on the skills will increase the effectiveness of your combo.Magichange- Magichange allows humanoid characters and monster characters to to fight as one. In doing this the monster will turn into a special weapon for the human to wield and in the process increase the power of both.Will Mao be able to become a hero and defeat the Overlord? Or will Raspberyl and the demon delinquents convince him to return to his honor role ways? It all depends on you, and so the troublesome, devilish story begins.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51VadV1aQvL._SY300_.jpg", "related": {"also_bought": ["B004TMGZ9K", "B000F8O1C0", "B00BJH11F6", "B004XYN4NY", "B00009YEJY", "B0016C3260", "B002I0J4AM", "B0087OY17Y", "B00477VLZU", "B00BJH11D8", "B0067O5SBE", "B003YVP5DE", "B0058VI2LA", "B002BRYHY0", "B006O5YW54", "B006MBZZSI", "B00B67ZTUW", "B002I0K2J4", "B007A7UJ4S", "B002DPUJCE", "B00ANGVX9I", "B001CRQY1E", "B001P2PW3M", "B004Q8IZHW", "B00D87TCN8", "B004HVKABW", "B007H44U1W", "B005DVAAZG", "B002AB7TX8", "0744013186", "B000FQ2DTA", "B000ZK695U", "B00AZWE7ES", "B000TTZI0E", "B00BJH11FQ", "B007PNBU0Y", "0804162131", "B00K85X1W6", "B003O6JIVE", "B005TH6BD4", "B007V9QKH0", "0979884837", "B00JC5Y2KS", "B002I0J45C", "B004WL4LOY", "B00BY0G0YU", "B00G6S2SE6", "B008SBZD5U", "B004P7VGF2", "B002I0J5FG", "B00370Q1E4", "B00C3MKCF6", "B007UM59XY", "B001YHX4B0", "B001C4J62Q", "B00J6DLPLK", "B00IA2NYT4", "B007IFMEYK", "B006VB2V7W", "B007B7BHJ8", "B00H45K6KS", "B006FRMVIQ", "B00GV4V8XC", "B00H51BJ0C", "B005VBVQDI", "B00B59MXGY", "B0015HZLVA", "B00KVRK39A", "B00946FSIA", "B008CP6RWU", "B008CP6MA2", "B003E6VK5Q", "B005YR308S", "B0001XAO4S", "074401543X", "B004NRN5EO", "B008CP6Q6M", "B00024W1U6", "B0029MAXR2", "B002BRYIJY", "B002L43OGU", "B003O680RM", "B0030GBSUC", "B00B2QL2Y4", "B003YVK5T8", "B0055202HE", "B004Q4EQ4M", "B009LEIUY4", "B002I0J6KU", "B006JKAS16", "B00DZIX39E", "0804162867", "B00BAWXCRU", "B004L9YS22", "B003O6HLOK", "B00C1ZBFTW", "B005J5K9UW", "B00K5UZMGM", "B000UW1YBW"], "bought_together": ["B004TMGZ9K", "B00BJH11F6"], "buy_after_viewing": ["B004TMGZ9K", "B002I0J4AM", "B0016C3260", "B00BJH11F6"]}, "salesRank": {"Video Games": 4952}, "categories": [["Video Games", "PlayStation 3", "Games"]]}