{"asin": "B004QK5N5W", "description": "Put your slides, movies, photos, and everything else that fills your iPad 2 screen on an even bigger screen your HDTV. The Apple Digital AV Adapter mirrors exactly what you see on iPad 2 so that everyone in the room can enjoy it on your widescreen TV, video projection screen, or other HDMI-compatible display. The Apple Digital AV Adapter also supports video out for iPad, iPhone 4, or iPod touch (4th generation). General Information Manufacturer: Apple, Inc Manufacturer Part Number: Manufacturer Website Address: Brand Name: Apple Product Model: Product Name: HDMI Cable Adapter Marketing Information: Put your slides, movies, photos, and everything else that fills your iPad 2 screen on an even bigger screen your HDTV. The Apple Digital AV Adapter mirrors exactly what you see on iPad 2 so that everyone in the room can enjoy it on your widescreen TV, video projection screen, or other HDMI-compatible display. The Apple Digital AV Adapter also supports video out for iPad, iPhone 4, or iPod touch (4th generation).Product Type: A/V Cable Technical Information Cable Type: HDMI Fiber Optic Mode: Not Applicable Core/Cladding Diameter: Not Applicable Connector on First End: 1 x 30-pin Male Proprietary Connector on Second End: 1 x 19-pin HDMI (Type A) Male Digital Audio/Video Connector on Second End: 1 x 30-pin Female Proprietary Conductor: Copper Miscellaneous Compatibility: Apple: iPad, iPad 2, iPhone 4, iPod touch (4th generation)", "title": "Apple Digital AV Adapter (MC953ZM/A) - [OLD VERSION]", "price": 36.9, "imUrl": "http://ecx.images-amazon.com/images/I/11E9s7wWOBL.jpg", "related": {"also_bought": ["B0002L5R78", "B005VAONLQ", "B009WHV3BM", "B008D6JDS8", "B0052XN17Y", "B007IRBNRW", "B000O5N5AI", "B0094Z6N9Y", "B000N47CEA", "B009FLJZXI", "B003L1ZYYM", "B009A5EIWC", "B0085MQLGC", "B008H7UAIK"], "buy_after_viewing": ["B007IRBNRW", "B009WHV3BM", "B0094Z6N9Y", "B003L1ZYYM"]}, "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Chargers & Adapters"]]}