{"asin": "B001CCLBSA", "related": {"also_bought": ["B00378YPB2", "B0011MSEEK", "0964987511", "B001GNC7OW", "B000OF2F36", "B001GNC7Q0", "B003EENZEC", "B004TUX7Y8", "B001GNC7PG", "B0013AV9TW", "B003VNKNF0"], "bought_together": ["B00378YPB2", "B0011MSEEK"], "buy_after_viewing": ["B008MB719C", "B008MB719C", "B00378YPB2", "B00728ZBA2", "B003EENZEC"]}, "title": "Panasonic DMC-LX3 10.1MP Digital Camera with 24mm Wide Angle MEGA Optical Image Stabilized Zoom (Black)", "price": 349.95, "salesRank": {"Camera &amp; Photo": 3921}, "imUrl": "http://ecx.images-amazon.com/images/I/41GAW227mGL._SY300_.jpg", "brand": "Panasonic", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Designed for easy, creative shooting, and high-performance in low-light conditions, the Panasonic DMC-LX3 features a F2.0 24mm Leica DC Vario-Summicron lens, 10.1 megapixels and an ultra-sensitive 1/1.63-inch CCD developed specifically for this model.  By combining a high-quality lens and sensor ready for a variety of shooting conditions with a wide-range of accessories and manual controls, the DMC-LX3 is ideal for professional photographers and serious amateurs looking for a compact digital camera that furthers their creative photography.At the heart of the DMC-LX3, is its 1/1.63-inch CCD.  Making the intentional choice to limit the number of megapixels to 10.1 on its CCD, Panasonic was able to give more space for each pixel and also redesigned the peripheral circuits and other components to further minimize noise generation.  As a result, sensitivity is almost 40 percent higher and saturation is increased by 35 percent when compared to Panasonic&#x92;s 10 MP digital cameras, giving the DMC-LX3 outstanding image quality and a wide dynamic range, and meeting the demand for a camera that works optimally in low-light environments.  The CCD is also capable of reproducing images in three aspect ratios -- 4:3, 3:2 or 16:9.  The new Multi Aspect mode allows the camera to take an image in all three aspect ratios simultaneously, allowing users to choose the version that best suits their needs.Another major upgrade to the LX3 is the F2.0 24mm ultra wide-angle Leica DC Vario-Summicron lens.  The F2.0 is about twice as bright as a F2.8 lens and can shoot at higher shutter speeds to capture clear, blur-free images in dimly lit environments.  In addition, the 24mm lens captures approximately a 213-percent larger viewing angle than a normal 35mm camera and 136% larger compared to a 28mm wide-angle lens.  The lens unit consists of eight elements in six groups with four aspherical lenses with four aspherical surfaces.  As a result of the F2.0 lens, the LX3 produces high resolution and minimal distortion and artifacts -- such as chromatic aberrations, ghosting and flaring.The LX3 also incorporates the Venus Engine IV, which provides more advanced signal processing technology for producing higher-quality images with reduced noise in both luminance signal and chromatic signal processing -- as compared to the Venus Engine III.   The Venus Engine IV supports high sensitivity recording enabling the DMC-LX3 to record at up to ISO 3200 at full resolution and even up to ISO 6400 when using high sensitivity mode, enough to capture subjects in low lighting without using a flash.  The Venus Engine IV also supports a faster response time, allowing the camera to shoot 2.5 shots per second at full resolution and six shots per second in High-Speed Burst mode.The easy-to-use joystick operation which was featured in its predecessor continues with the LX3, as its intuitive design makes selecting different settings on the camera, including focus, aperture and shutter speed -- easy and quick.  Other convenient design elements include a switch on the side of the lens barrel that allows the user to quickly change the focus modes between Manual Focus, Auto Focus and Macro Auto Focus.  When choosing Manual Focus, the focus distance and the depth of field according to the zoom range and aperture is also displayed.  For setting white balance, the LX3 provides a new color temperature display function, and still includes the Two-Axis white balance adjustment settings offered in previous models.  Users can also customize and store their own personal settings of up to four unique functions and instantly recall them later using the mode dial.Furthering its creative options, the LX3 also features a Film mode with six color types and three types of monochrome selections.  Much like selecting from different film types, this function gives the user the flexibility and creative freedom to take more expressive digital photos.  Also, when using the Multi-film mode, the LX3 produces a maximum of three images from a RAW file for the user to compare the different textures.  Another new feature is the multiple-exposure feature, which lets the user create artistic photos by overlaying up to three consecutive images; while still viewing the last image on the 3.0-inch LCD screen.  The LCD on the LX3 is new and improved with a 460,000-dot high resolution.While the LX3 allows full manual control for more advanced photography, it also includes Panasonic&#x92;s Intelligent Auto mode (iA), including the new feature, AF (auto focus) Tracking.  AF Tracking automatically tracks the image subject and locks it into focus, making it easier for anyone to capture sharp, well-focused photos.  The AF Tracking technology also improves face detection accuracy, allowing for crisp, sharp-focused shots even if the subject moves or turns their face.  Other iA technologies include Intelligent Exposure, Digital Red-eye Correction, MEGA O.I.S, Intelligent ISO, Intelligent Scene Selector, Face Detection (up to 15 faces) and Quick AF.The DMC-LX3 has the ability to record High Definition (HD) video in 1280 x 720p at 24fps.  With the newly added HD component output capability, still and moving pictures can be viewed by connecting the camera to a TV via an optional component cable (DMW-HDC2).  In addition, the LX3 features Image Leveling, so when a captured image \"leans\" to the right or left because the camera was held at a slight angle when the photo was taken, this feature rotates the image to straighten it and crops the unnecessary edges."}