{"asin": "B004JK8BDK", "categories": [["Electronics", "Home Audio", "Stereo Components", "Receivers & Amplifiers", "Component Amplifiers"]], "description": "Clean-sounding, efficient, and versatile, Dayton Audio's DTA-100a packs audiophile-grade sonic performance into a package just slightly larger than pocket-sized! The DTA-100a utilizes the Tripath TK2050, a high-performance chipset that delivers 50 watts of continuous power per channel (100W total) into an 8 ohm load. The Dayton Audio DTA-100a's Class-T mini amplifier circuitry offers the audio fidelity of a Class-AB amplifier while providing the &#62; 85% power efficiency of a Class-D design. This compact powerhouse also features a convenient front-mounted 3.5 mm stereo input for quick connection of iPods, MP3 players, and other portable audio devices. A rear-mounted RCA-type line level input is also provided for permanent connection of larger devices such as CD players. Speaker output connections are high-current banana plug receptacles spaced on 3/4&#34; centers and compatible with standard double banana plugs (sold separately). High quality screw-on banana plugs that will accept 10 to 18 AWG wire are included. The DTA-100a also doubles as a high fidelity headphone amplifier that will drive any headphone easily, and delivers colossal sound stage from 20-20,000 Hz with a signal-to-noise ratio of 103 dB (A-weighted). The 1/4&#34; stereo jack simplifies connection of larger home and studio style headphones. An adapter is also provided so smaller 3.5 mm personal-style headphones can be used. The amplifier comes complete with a world compatible power supply and its associated connectors. Dimensions: Faceplate dimensions: 1-29/32&#34; H x 3-3/8&#34; W x 5/16&#34; D; Body dimensions: 1-3/4&#34; H x 3-1/8&#34; W x 4-5/8&#34; D; Overall dimensions: 2-1/8&#34; H x 3-3/8&#34; W x 5-1/2&#34; D (feet, faceplate, and volume knob included).", "title": "Dayton Audio DTA-100a Class-T Digital Amplifier 50 WPC (Black) (Discontinued by Manufacturer)", "price": 99.89, "salesRank": {"Electronics": 41095}, "imUrl": "http://ecx.images-amazon.com/images/I/41YbvoyLEFL._SY300_.jpg", "related": {"also_bought": ["B002RMPHMU", "B0063NU3AA", "B0029HO66G", "B000KW2YEI", "B00HFG3FYA", "B00E7H8GG2", "B001PNOH2I", "B0049P6OTI", "B0097JLQVC", "B008ALA2RC", "B008NCD2LG", "B0029HHIDY", "B000N7JWVI", "B00669L3HS", "B002JP4Z96", "B0029XW5JA", "B004VM1T5S", "B004YEBK66", "B00006JPDI", "B009IUIV4A", "B005VR0PQQ", "B000VKXLBO", "B000OG88KY", "B00022TN86", "B003L1717K", "B0002KVQBA", "B000MCLWEE", "B00828UTE4", "B00CWEJJ9K", "B005CRLZGE", "B002ZRQ3PW", "B00C2P61FO", "B0001XGQSG", "B00378KMEG", "B005K2TXMO", "B00E8ONRBS", "B009346RSS", "B000ZZINTK", "B001I4UO3U", "B0069LR09I", "B00004Z5CP", "B002JTV7UM", "B009RT2IAK", "B0002GDIII", "B0090CVJZ4", "B003EGIE2S", "B003P534SW", "B00BIQER0E", "B006LW0WDQ", "B003MTTJOY", "B000MCEL1K", "B002HPNDDW", "B006U3O566", "B00004Y3UY", "B003L1AFC8", "B009OBCAW2", "B000KULLM6", "B0071HZ5RI", "B000MCGF1O", "B009EA7XKC", "B000I1IG8Y", "B0044YPN0A", "B003BFTKUC", "B0011YR8UE", "B0045NCB32", "B007I5JT4S", "B00870ZHCQ"], "buy_after_viewing": ["B0049P6OTI", "B00C2P61FO", "B00E7H8GG2", "B00HFG3FYA"]}}