{"asin": "B001EWETAK", "related": {"also_bought": ["B00FEZV7XA", "B003PF406M", "B001JHVEE4", "B004SL0V42", "B003PG21IU", "B0044CZX1G", "B001EWET96", "B00J03A878", "B003XUMQ7E", "B001EWET8W", "B004X42FES", "B002BW3LT2", "B001JHYJSW", "B004QXUWVO", "B00L1MLPA0", "B00AACC2ZY", "B00H6YT0RC", "B004NFYU8Q", "B00AACC0AG", "B00J03AMNS", "B00I4ZZR9C", "B0044TIP0K", "B004R7N4BO", "B007AS626G", "B0044AAHYG", "B00J03A396", "B003PL2D6A", "B0044TIOYW", "B007NQO5EG", "B001JI0KPM", "B004NG0QJ2", "B003PL9PLG", "B00AACBZMA", "B0044TNORO", "B004DTPKNQ", "B004TANVTY"], "also_viewed": ["B00FEZV7XA", "B001JHVEE4", "B003PG21IU", "B00BCO5OM2", "B001EWET8W", "B001JHYJSW", "B003PF406M", "B00EPQ0JT2", "B004SL0V42", "B008UWEVIC", "B001JI0KPM", "B004X42FES", "B00H6YT0RC", "B003XUMQ7E", "B00AACC0AG", "B001EWET96", "B00E92XOFI", "B004QXUWVO", "B002X796IA", "B00L1GI4P0", "B0082BNW5E", "B00IYSCL2K", "B004R7N4BO", "B0016BEX78", "B0006BDTC4", "B00J03A878", "B00BE584VW", "B009NPMD2G", "B003BHY01O"], "bought_together": ["B003PF406M"]}, "title": "Yes To Carrots Body Butter, Super Rich, Nourishing, 8.45 Ounce Tubs (Pack of 2)", "price": 33.5, "salesRank": {"Beauty": 58957}, "imUrl": "http://ecx.images-amazon.com/images/I/41GIFdN3v1L._SX300_.jpg", "brand": "Yes To Carrots", "categories": [["Beauty", "Skin Care", "Body", "Moisturizers", "Body Butter"]], "description": "Pamper your body with Yes To Carrots C Through the Dry Spell Body Butter. This rich and luxurious moisturizing cream revives and rejuvenates your skin without preservatives, harsh chemicals, or paraben. Designed to deliver long-lasting hydration to dry skin, this smoothing and soothing formula nourishes your entire body from head to toe so you look and feel your best..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } img.withlink {border:1px black solid;}Beta-carotene hydrates without leaving your skin greasy.View larger.The Dead Sea is the world's oldest natural spa.View larger.Revitalize Dry SkinSuffering from very dry skin and just don't know how to keep it soft? Let C Through the Dry Spell Body Butter heal, soften, and protect your skin. Ideal for sensitive skin care, this amazing revitalizing body treatment provides an immediate and long-lasting moisturizing effect that won't fade away as the day goes on.Rich, Organic IngredientsFortified with delicious ingredients sourced from certified organic farmers in Israel, C Through the Dry Spell glides over your skin, smoothing the rough patches--like knees and elbows--and leaving behind glowing, softly scented skin.The antioxidant power of beta-carotene from organic fruits and vegetables combines with Dead Sea mud and minerals to hydrate without a greasy feel. This emollient-rich lotion also contains shea butter, high in Vitamins A and E, to improve skin softness and suppleness. For best results, start your daily routine by lathering up with C How to Shower Carrot Rich Shower Gel, then spritz with Yes to Carrots Body Mist for added hydration. Follow up with a final touch of C Through the Dry Spell to seal in moisture.Say Yes to Carrots and Minerals from the Dead SeaIt's no secret that carrots are good for you, but not just to eat. When it comes to natural ingredients, carrots--along with other orange-colored produce such as melons, sweet potatoes, oranges and pumpkins--are the best known vegetable source of beta-carotene, a powerful antioxidant that helps reduce daily damage to your skin and hair.C Through the Dry Spell also incorporates minerals from the Dead Sea, the world's oldest and most renowned natural spa. The Dead Sea region is known to contain the highest concentration of rich minerals found anywhere, such as magnesium, calcium, iron and potassium. And it has been proven to boost your skin's metabolism and draw in moisture for glowing skin--naturally!About Yes to CarrotsYes To Carrots is on a mission to ensure that your daily beauty routine is as good for your outside as the fruit smoothie you contemplated drinking this morning is for your inside. They strive to provide their extended family of users with a natural glow and a feeling of joy. This company also gives a percentage of all proceeds directly to the Yes To Carrots Seed Fund, a U.S. 501(c)3 non-profit organization. With this organization, Yes to Carrots strives to make a difference in people's lives by providing under-served communities with the resources to develop and sustain an organic food source and access to healthy nutrition. Together with their partner organizations, the Yes To Carrots Seed Fund assists these communities by sharing donations for seeds, plants, equipment, irrigation support and technical know-how."}