{"asin": "B004R0RQ8S", "description": "This Premium Black Galaxy Tab 7.0 Leather Case is made from top quality PU leather and has a soft nubuck fibre interior that protects your Tab 7.0 from scratches and scrapes. We are so confident in the quality of the materials we use that we offer aLifetime GuaranteeThis case has abuilt-in standthat allows you to watch videos or read at different angles. The velcro flap on the inside secures your Galaxy Tab 7.0 tightly in place whilst theelastic hand strapgives you greater security when moving your Samsung Galaxy Tab 7.0The case also hascutouts for all of the ports and features including the camera and heaphone jackas well as a stylus loop that holds your stylus securely but can be folded away if not in use.A classic styleGalaxy Tab 7.0 Black Leather Casethis combines robust protection with easy use and a quality finish.Key Features- Built in Stand- Elastic Hand Strap- Access to all the ports and features- In Built Stylus Loop- Lifetime GuaranteeWhy Buy From Snugg?- Snugg Promise- Worldwide Brand- Lifetime Guarantee- Featured by Popular Tech Sites Such as MacWorld, GQ & Many More- Trusted Brand & Product Used By Google, Coca Cola, Range Rover & Many MoreGalaxy Tab Size Guide1) Turn your Galaxy Tab off.2) Switch it back on again.3) The start screen will display the name of your tablet and model number.", "title": "Snugg Galaxy Tab Leather Case Cover and Flip Stand for the Samsung Galaxy Tablet 7.0 (Black)", "price": 14.99, "imUrl": "http://ecx.images-amazon.com/images/I/51GxeSa7yRL._SY300_.jpg", "related": {"also_bought": ["B004V4O8KY", "B004BCPYFE", "B004GFPW12", "B0047EM82I", "B004MUBXO6", "B006K1E13U", "B0067VSWD8", "B004CZ2APC", "B00636FQ86", "B0052C8D5A", "B006UGNYNI", "B004LYBX0W", "B00AEV9MAE", "B008AJNF78", "B00BMEJ55O", "B004DBD4TG", "B004DBIKOK", "B004CGHDEO", "B004T0E0R6", "B00DV56J9W", "B007VGI9OK", "B0049XEC76", "B008G1LXMY", "B009RTV66C", "B00CMMGK58", "B004BHDZIW", "B005EAEQR4", "B004NYAHD4", "B0083XTOSK", "B004M5CUFM", "B007P4VOWC", "B0089ME3CC", "B005IR2J2M", "B005YUDK6W", "B00AMVD9SC", "B004G60AD6", "B007X6FCTS", "B007YUISN0", "B0085DDRQ8", "B007KFXIDE", "B004SZYPBS", "B004MEZ3H0", "B00DVT373E", "B007I5VKYU"], "bought_together": ["B0047EM82I"], "buy_after_viewing": ["B00K9VYFQ0", "B0047EM82I", "B00JFR8UY2", "B00CO9KV0Y"]}, "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Cases & Sleeves", "Cases"]]}