{"asin": "B00HSYS3C8", "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Chargers & Adapters"]], "description": "Even more power with the home charger 4500 you can fast charge four of your USB devices at the same time. With four ports, all up to 2.9a (combined 4.5a), and the support of USB 3.1 your devices are fit for service in a blink. Charge your devices fast - the two black ports are able to fast charge smartphones of every major manufacturer (Apple, Nokia, LG, Huawei, Blackberry, Samsung, Motorola, Sony, HTC, Lenovo). The configuration of the orange ports enable tablets of the new generation such as iPad, Xperia, Nexus, Slate etc. Change into fast charge mode. Older devices can possibly be charged only at the black ones. The home charger 4500 charges Samsung Galaxy tab, Samsung Galaxy note, Hyundai t7s, LG Optimus 7 and Odys Xelio only with max. 1a. Samsung Galaxy tab and Samsung Galaxy note are not showing that the device is charging. Led lights - every port has its own led light that shows you if a device is being charged and how fast. Another led signaling the function of the charger if a total load of 4a is exceeded. More than enough power - with a total output of 4500ma, you can fast charge a combination of four smartphones and tablets without overloading the home charger 4500. 86% efficiency does not just save you electricity cost; it also keeps the adapter's temperature low and makes it live longer. Worry-free charging thanks to its thermal, short circuit, over-current and over-voltage protection, you can rely on this wall USB charger to charge all your USB gadgets worry-free.", "title": "ARCTIC Home Charger 4500 USB Portable Wall Charger, 4-Port 4.5A Total Output, Fast-Charge, US Plug - Black", "price": 15.98, "imUrl": "http://ecx.images-amazon.com/images/I/41WEdDXRasL._SY300_.jpg", "brand": "ARCTIC", "related": {"also_viewed": ["B007QVITE0", "B0077JNN4M", "B007HZ39SQ", "B00FQVNYR4", "B00HVKFIY0", "B00HVKR92Y", "B00008VFAF", "B00AZW4N3I", "B00F89VCGE", "B005JZP3IU", "B00A3RF9OW", "B00FW1GE9S", "B0048F64DU", "B003XFWSU4", "B00GV4UIVA", "B00EI8SS4U", "B00HPTU00E", "B00DVH62J2", "B00C4034IE", "B00E7LSCNK", "B0015DYMVO", "B00HQY35SM", "B00GTGETFG", "B008EOXXFI", "B00HP0FOCM", "B003XN24GY", "B00BNQTIRQ", "B00B8L36A6", "B00IBDOB5I", "B007NLW3C2", "B00GGYU8TC", "B00HBZ3FHM", "B00DAR4ITE", "B00F4EONWS", "B00D856NOG", "B00GSNNWDA", "B009D79VH4", "B00DH101WQ", "B0073FCPSK", "B00ATZJ5YS", "B0073FE1F0", "B005X1Y7I2", "B003ES5ZSW"], "buy_after_viewing": ["B00IBDOB5I"]}}