{"asin": "B000JLK5PK", "related": {"also_bought": ["B000UMX7FI", "B000N7VPRW", "B001GIPR5S", "B00IQ7PT50", "B000N81BXO", "B008I2175E", "B000FFSD86", "B004T8OIT8", "B001D9AYF8", "B0015MHY6K", "B001A1RMXG", "B0049H89F8", "B004TKY4OK", "B00IQ7PUKY", "B001ASU1QO", "B000JLK5NW", "B0010CKE7G", "B00IQ7PSY2", "B001GIPR62", "B00007E7RF", "B001KELVS0", "B003TLDL94", "B00G36G7WU", "B00I0WGGIK", "B007FH1KX2", "B0076BNK30", "B000UH7X1C", "B00D366FE8", "B002BSH2KA", "B001GCUNNA", "B0000BZLBQ", "B001ENW61I", "B002WR7VSS", "B0045KGZOG", "B004QC6VAG", "B00017LSPI", "B001CCAISE", "0321524764", "B00009R6FV", "B005HWC6PI", "B000KZAJNS", "B003Y30334", "B001GXQRA2", "B000PTFDYO", "B000JLM50I", "B0037NX6JY", "B007NDL56A", "B007FH1LJU", "B00004ZCI3", "B0002TKGZS", "B0000BZLAC", "B00004WCID", "B001F6TXME", "B002N5NRSC", "B00G36G9Q4", "B00009R6GE", "B0079RQZBU", "B00BWV72O8", "B0000WKYU4", "B0083Z6R4W", "B00009R6VZ", "B00009R6AV", "B007FH8MS8", "B004TL3R8I", "B00D76RNLS", "B0040X4PV8", "B00007EDZG", "B00BBQ8IDS", "B001AHALEC", "B000EOSHGQ", "B00004ZCJ7", "B00013MSUQ", "B004AH10K8", "B00A2LYVT8", "B0033PRWSW", "B002ZIMEMW", "B001GXQRAC", "B002KDS2BY", "B007FGYZFI", "B00DMS0GTC", "B004TL3OUY", "B004MKNJ6G", "B0000BZL9J", "B002SWIOOM", "B009G41VMM", "B003TLSXMO", "B003AM7V0C", "B000CLNHXY", "B000A1SWOA", "B0000YD2JC", "B0000BZL8H", "B004OVE188", "B000XB9GV0", "B00009XVCZ", "B000BTCJNG", "B009B0MZ8U", "B003LA595M", "B007N6TF9G"], "bought_together": ["B000UMX7FI"], "buy_after_viewing": ["B003AM7V0C", "B008I2175E", "B003CRGZJS", "B000N7VPRW"]}, "title": "Manfrotto 322RC2 Joystick Head Short", "price": 179.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31lX3dsYtML._SY300_.jpg", "brand": "Manfrotto", "categories": [["Electronics", "Camera & Photo", "Tripods & Monopods", "Tripod Heads"]], "description": "Take the versatility of a ball head, add true ergonomic control and you get the 322RC2 Horizontal Grip Action Ballhead! The 322RC2 is unique in that it allows you to unblock, move, position and lock your camera with one hand in one position. This is due to the revolutionary design of its grip handle which incorporates the ball lock lever.A friction control wheel lets you regulate the power of the blocking mechanism to match the weight of your camera and lens. The 322RC2 is made from magnesium for lightweight performance, and is designed to keep the weight of your equipment as close as possible to the tripod's center of gravity by way of its reduced height. It is this fact, matched with the precision construction of the 322RC2 that gives the head its load capacity of 11 pounds (5.5 pound capacity when in the vertical position).The 322RC2 comes complete with a built-in bubble spirit level and quick release camera plate (standard 1/4-20-inch screw, with secondary safety pin). The 322RC2 is suitable for use with 35mm or medium format cameras. In addition, you can also mount the 322RS shutter release accessory. The 322RS is a world's first. With its remote control electronic camera shutter release, the 322RC2 becomes the only photographic head available today that can put camera control within reach without having to move your hand from the head grip to the camera body.Features include:Sturdy all-metal construction.The compact, rectangular 200PL quick release plate system fits neatly under small-bodied still cameras up to SLR (even with tele lenses) or small medium format, or under small video cameras or spotting scopes. Its rubber pad gives a good grip without damaging the camera, and its angled sides ensure that it also fits perfectly and tightly into a wide range of Manfrotto heads.This head features a secondary security lock so you can't accidentally release the plate (and camera) without meaning to. The lock stops the quick release lever from opening fully.A convenient single locking mechanism blocks or frees movement on all axes for greater speed of use.Separate control for pre-setting the friction of the ball when unblocked. The position of the red line indicates the approximate amount of friction applied.By keeping the head and camera mounting plate as low as possible, the camera is kept safely closer to the tripod's center of gravity for more stable support.Thanks to the repositionable camera plate, this can be used right- or left-handed. Photographers are normally forced to be right-handed by the position of the shutter release button, but the advantage of this system even to right-handed users is that you can keep one hand on the grip to control framing position and switch rapidly between portrait and landscape settings, while the other hand stays on the camera, ready to shoot even with the head in movement. Keeping both hands positioned like this gives you greater control over panning or tracking shots.Designed for use with the 322RS electronic or 322RSM manual shutter release cables and mounts; the first accessories to let you control head positioning and shutter release at the same time, with the same hand, without needing to let go of the head grip.The built-in, carefully hand-set bubble spirit level helps make sure your horizons really are horizontal.What's in the Box:Ball head, quick release plate."}