{"asin": "B000R3BNE2", "description": "Two of the most beloved icons in the world, Mario and Sonic, are joining forces to star inMario and Sonic at the Olympic Games.Developed exclusively for the Wii video game system and the Nintendo DS system, this momentous agreement marks the first time these two renowned stars have appeared together in a game.Featuring an all-star cast of characters from the amazing worlds of both Mario and Sonic, players will be able to compete as or against a range of familiar characters including Mario, Sonic, Luigi, Knuckles, Yoshi, Tails, and more. Innovative usage of the Wii and DS control systems to maneuver your favorite character will allow players to race the likes of Mario and Sonic down the 100m track, leap over the high jump, or churn water in a swimming heat, all while competing for the much sought-after Olympic gold medal. With up to four players on the Wii and on the DS, the stage is set to catch the fever this holiday with Mario and Sonic.Features:Compete in stylized Olympic venues with authentic sports and events to choose from including track and field, archery, skeet shooting, table tennis, gymnastics, and more.Select your favorite playing style from the all-star cast of Mario and Sonic characters with four player types to choose from: all-around, technical, speed, and power. Examples: Mario (All-around), Peach (Technical), Yoshi (Speed), Bowser (Power), Sonic (Speed), Knuckles (Power), Tails (Technical), Amy (All-around).Game Modes: Try out each event individually with Single Match mode, compete for the highest overall score in a series of events in Circuit mode, or take on challenges created specifically for each character in the Mission mode. Up to four players can play together on the Wii. DS allows up to four players to compete via wireless connection.Unlockable stages where familiar items from the worlds of Mario and Sonic enhance the challenge of each unique event.", "price": 37.49, "imUrl": "http://ecx.images-amazon.com/images/I/51AqFeAPoqL._SY300_.jpg", "related": {"also_bought": ["B001SIFNXW", "B004XV9EWW", "B002BH3N2W", "B000FQ9QVI", "B000IONGVI", "B000INV44U", "B0017HIIWW", "B001D8PFIK", "B003O6H8CK", "B000RHXD28", "B000YUYNTK", "B000LSJKAM", "B0013E9HP6", "B002BRZ9G0", "B001GIUWX0", "B005FYJA52", "B001O1QLDO", "B001APM444", "B000GUQJQ8", "B0050SVGXM", "B000NNDN1M", "B002I0GEXM", "B004WLRR0E", "B0050SVGU0", "B002672Z80", "B000XUPBBU", "B001SICHU4", "B002BSA388", "B0017Q4DGI", "B000SFK0SO", "B001PO2BJI", "B002I0IIPY", "B0029ZUPW2", "B002K9VIAU", "B000FQ9YB0", "B0019R4VD0", "B000WINB56", "B00DC7O3K6", "B001C58T46", "B003ZHMMEM", "B001DO3NEW", "B004W1IX1G", "B000R39IW6", "B007MM9E42", "B001B1W3KM", "B000QD7BBM", "B0027WNRFE", "B004K0HUHC", "B004IK24MU", "B0013B30SY", "B0039XZGXG", "B0014ULQDA", "B001AMMZSC", "B0015HZLUQ", "B000R4J35W", "B000GHLBUA", "B002JKQIVE", "B003LDKIUA", "B000XZZ8C2", "B000GEDN5E", "B0045FCKVI", "B001B1W3HA", "B00AEZ27ZM", "B00139U8TU", "B0036KRP6S", "B001FEO75E", "B000ZKBJYG", "B00DWXV074", "B004XV9F62", "B000OAJKI4", "B001U2BMF4", "B00354NAXM", "B001FEO74U", "B002I0EOSE", "B0056C2LIG", "B006ZPAYB4", "B003S2JI6O", "B002EWD03Q", "B002BS47L2", "B000R3BNDI", "B008GFZV6Y", "B0038MUCWS", "B008171AZ8", "B003O6FV8S", "B002D2Y3IS", "B000S1MMG6", "B002I0ENX0", "B000SH3XEA", "B000GJ0J24", "B000OAO188", "B003O6DZSQ", "B005EYG6EQ", "B0053BG26C", "B0019UJ4QQ"], "bought_together": ["B001SIFNXW", "B004XV9EWW"], "buy_after_viewing": ["B004XV9EWW", "B001SIFNXW", "B002BRZ9G0", "B001GIUWX0"]}, "salesRank": {"Video Games": 3441}, "categories": [["Video Games", "Kids & Family", "Wii", "Games"], ["Video Games", "Wii", "Games"]]}