{"asin": "B00C94GTJQ", "categories": [["Electronics", "Camera & Photo", "Bags & Cases", "Binocular, Camera & Camcorder Straps"]], "description": "CONTENTS OF THE FRIENDLY SWEDE RETAIL PACKAGING:1 x Extra long red edge polyester yarn camera/camcorder neck shoulder straps belt1 x Extra long black polyester yarn camera/camcorder neck shoulder straps belt1 x The Friendly Swede 5.5 x 3.0\" microfiber cleaning clothCarry your camera in comfort and in style - extra long straps for taller users and for convenient and safe, side-sling style carrying.\"COMPATIBLE WITH:Panasonic Sony Canon Nikon Fuji Olympus Pentax Dslr Camera/CamcorderTHE FRIENDLY SWEDE - Selected Accessories:If you for any reason are not happy with any product supplied by The Friendly Swede, please do not hesitate to contact us and we will do our best to solve your problem ASAP! At The Friendly Swede we take full ownership and responsibility for the quality of our products. The Friendly Swede - USPTO serial: 85494642, 85511082, 85521942 - is a registered trademark protected by US Trademark Law. All products supplied by The Friendly Swede are exclusively manufactured by The Friendly Swede.References to other companies and their products use trademarks owned by the respective companies and are for reference purposes only. All other trademarks used herein are the property of their respective owners.Device NOT included.", "title": "2 PACK] Extra Long Camera / Camcorder Neck Shoulder Straps Belt - Length Approximately 47&quot; + Cleaning Cloth in Retail Packaging (Extra Long - Black/Red + Black)", "price": 10.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41REIUQHXWL._SY300_.jpg", "related": {"also_bought": ["B00CCKE4J4", "B00APQ9PVE", "B00G97ALA2", "B0029N3U9E", "B0000BZL8D", "B0000BZL7S", "B0048IW030", "B0000BZL68", "B005F5D4W6", "B000FK84C6", "B007ABIYKA", "B0051G9ZTK", "B00DZIFWRU", "B00DX5D9I4", "B00B7ID99I", "B00714FK2G", "B007M51J3I", "B0058I7CVE", "B005KEL4NI", "B00006JN3G", "B009TL1YMY", "B000ANCPNM", "B0080JH3YE", "B007PZALFC", "B005UG3KS8", "B007UNSF3E", "B004ZGLM5W"], "bought_together": ["B00CCKE4J4", "B0048IW030"], "buy_after_viewing": ["B007XOYBE2", "B003U3H5CK", "B00CFHBBUE"]}}