{"asin": "B0007NIJBC", "description": "Ramp up your video communication with QuickCam Communicate STX's high performance VGA optics and integrated microphone. Whether you want to improve your video IM or upgrade to video calling, STX will make your online chats, conversations, and friendships far more compelling.The Communicate STX works with all popular Instant Messenger services, including AIM, AOL Instant Messenger, MSN Messenger, Yahoo! Messenger, and Windows Messenger (on XP). You'll get ultra sharp video IM, and the STX will let you know you're \"live\" with its vivid blue activity light.Ready for the next level in Internet communication? The Communicate STX will take you there in style. Make live video calls and share photos seamlessly with Logitech's VideoCall for broadband. Communicate STX even lets you \"go big\" by taking your video full-screen, and makes it a snap to attach videos and photos to e-mail.The STX is easy to set up, includes a free clip to fit virtually any CRT monitor, flat panel display, or notebook PC, and comes complete with all of the software you need for an outstanding video communication experience.Power boost your video.The Communicate STX uses high performance optics that captures great video, and snaps still images at an impressive 1.3 megapixel (interpolated) quality.Add video to your Instant Messages.Video-chat with your friends using MSN Messenger, AIM/AOL Instant Messenger (AIM), Yahoo! Messenger, or Windows Messenger (on XP). It's easy, fun, and far more personal than ordinary text messaging.Instantly attach photos and video to e-mail.Communicate STX comes with Logitech's easy-to-use QuickCam software, which automatically integrates with all popular e-mail programs. Take photos, record videos, and send them to friends in a snap.Make live video calls to friends and family.This is the next best thing to being there in person. Now you can make two-way, real-time video calls with integrated audio--the perfect way to stay in touch with the people you care about.What's in the BoxLogitech QuickCam Communicate STX camera, a high-quality VGA sensor, a built-in microphone, a fixed-focus lens, a 6-foot USB cable, a round desktop base, an adjustable monitor clip, an installation CD (including a user guide, a quick-start guide, and bundled software), and warranty information.", "title": "Logitech QuickCam Communicate STX", "price": 26.99, "imUrl": "http://ecx.images-amazon.com/images/I/21T57W2FT6L.jpg", "related": {"also_viewed": ["B00K11RI6W", "B000GP845M", "B0016JMS90", "B002GP7ZTQ", "B002GP7ZTG", "B00519B4YG", "B000NB2GF8", "B0043PIZYG", "B0092QJRPC", "B004431UBM", "B003LVZO8S", "B0015TJNEY", "B004FHO5Y6", "B004H1MCKY", "B000RZSHQM", "B000RZQZM0", "B008GWPC1Q", "B003LVZO88", "B0015BWO5W", "B008ZVRAQS", "B000O9GGLY", "B000BBYH8O", "B003JZC7AE", "B004HK757U", "B0017IB07G", "B005E3U5X0", "B009CPC6QA", "B002ACQDEI", "B001DWI1F0", "B0052T8X3U", "B002GP7ZT6", "B000UY1OMY", "B004WO8HQ4", "B004FK04M0", "B003VANOAO", "B009E47ZDI", "B004AUK9IY", "B003GSLGQU", "B000TGAVSQ", "B004CYLARC", "B0007ZFLYI", "B0040QE98Y", "B001LJIQ32", "B0096KSBB0", "B0002UM05Q", "B004FLJ4YI", "B000AMPXN2", "B000GE9XQ2", "B005BZNEKM", "B003M2YT96", "B003LVZO92", "B00F4OYKL2", "B002NTC9YQ", "B0017ICW4G", "B004YW7WCY", "B002MCZJ78", "B00ILF2M2A", "B00I4JCK8O"], "buy_after_viewing": ["B004FHO5Y6", "B003LVZO8S", "B004WO8HQ4", "B00K11RI6W"]}, "categories": [["Electronics", "Computers & Accessories", "Webcams"]]}