{"asin": "B0012N3T3Y", "description": "In the highly anticipated sequel to the best-selling Sony PlayStation 3 game, Resistance 2 is an alternate-history, first-person shooter that puts you in the heroic role of Sgt. Nathan Hale as he struggles against overwhelming odds to defend humankind from an insurmountable Chimera..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Players:Offline: 1-8Online: 2-60game play Modes:Single player offline, multiplayer offline cooperative, multiplayer online cooperative.Resistance 2 puts you in the heroic role of Sgt. Nathan Hale.View larger.This sequel introduces several new Chimeran enemies with a host of new powers.View larger.Resistance 2 takes up right where Resistance: Fall of Man left off. Hale is kidnapped by a black ops group in London and forced to Iceland for research testing. The full scope of what happens in Iceland is a mystery, but the game reveals that as Hale wrestles with the insidious Chimera war machine, he must also battle the virus raging inside his body that threatens to transform him into the very creature he fights against.The Return of the ChimeraThe Chimera are the main enemies of the Resistance franchise. For those new to the story, it is believed that the Chimera are of extraterrestrial origin. Yet, it is known that their army expands by infecting humans with a virus that transforms humans into Chimera while inside a cocoon. These creatures are much stronger than humans, and they usually have multiple yellow eyes. They have remarkable healing abilities and thrive in very cold temperatures, which has led them to alter the Earth's climate to a much lower temperature that better suits their habitat requirements.Resistance 2 introduces several new Chimeran enemies with a host of new powers. A few new characters include the Chameleon, a creature that can cloak itself completely and kill a player in one, destructive blow, and the Grim, which are a terrifying species that attack in hordes.The Battle Moves to the United StatesAfter the brief opening scenes in London and then Iceland, game play jumps ahead two years and across the globe to San Francisco. Giant, mile-long motherships slowly cruise through the skies, demolishing the city with fiery beams. The city is burned and mangled, and it appears that there will be little to no survivors. As the battle continues across the United States, you're sure to encounter many new, deranged, and much more powerful enemies.In Chicago, you'll be joined by a squad of soldiers, all carrying different weapons. To survive and move through the level, you'll need to work together, moving from cover to cover, setting up your squad in a smart and defensive manner. These are just a few examples of the challenging levels you'll encounter as you battle your way across the country to save humankind. And if you're hoping for new weapons, Resistance 2 won't leave you disappointed. The US-based campaign is loaded with tons of new weapons to enhance the overall game play and first-person shooter experience.Online game play Goes BIGPowered by Insomniac Games' third-generation PlayStation 3 technology, Resistance 2 delivers several console gaming breakthroughs. Most impressive are the stand-alone, class-based, online co-operative campaign mode that can accommodate up to eight players, and the mind-blowing, 60-player, squad-based online competitive multiplayer battle fest. This unprecedented 60-player option could revolutionize online multiplayer game play and is sure to provide countless hours of action-packed fun.Resistance 2, set in the United States, is loaded with new weapons, enemies, and an unprecedented online gaming experience.", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/61MZQUjZ%2BiL._SY300_.jpg", "related": {"also_bought": ["B000JLIXIG", "B003O6E67A", "B000FQBF1M", "B002I0K6DG", "B00354NANC", "B003P9FRGA", "B004EQCCI4", "B000ZK7ZOE", "B008PQU3E4", "B002I0J5YW", "B000FQ9IDE", "B001UWGCW2", "B001JKTC9A", "B000UW21A0", "B000ZK9QCS", "B002DC8GKO", "B002BRZ6UE", "B002ZJNWWC", "B002BRZ744", "B004EW948E", "B0050SX2MK", "B002ELCV00", "B000RHZ9G6", "B002I0F5I2", "B003H0CBYS", "B0023CBZ70", "B00576U7W8", "B003S2MXQG", "B005185SDA", "B001C4DKG4", "B000FQ2D5E", "B004ML44Y6", "B0016GC9D8", "B008CP6MA2", "B000UU7VUC", "B0050SXGU8", "B000SQ5LQE", "B001NIP3EG", "B008CP6RUW", "B005YR308S", "B001TOMQOY", "B003L8DXOI", "B003GT8IL0", "B001COV1CY", "B00309XHD0", "B002CZ38KA", "B00170823O", "B000WMEEBM", "B002I0GX88", "B005C2D1YI", "B0050SXZ7W", "B0055202HE", "B000NGP1R8", "B0050SWUTQ", "B005GM3XVA", "B00269QLH4", "B00320JAWY", "B000WS97QI", "B002NN7AKU", "B003O6KWZK", "B008E6ZXTA", "B003Q55YCU", "B007TYC8MI", "B0050SWZHS", "B000X1TC0U", "B007CM0K86", "B000HGOHWO", "B002AB7TX8", "B001RTCOWA", "B0014UGK8G", "B004J6I0YO", "B000JLIYLC", "B000UC5ML0", "B001QXNBNI", "B000XJNTQ0", "B003O6E6NE", "B0016B28WU", "B00163LW7K", "B004UDB9SA", "B002I0K5NC", "B000WJFZEA", "B0076ZQSFI", "B001ASJIS6", "B0050SXEM8", "B00269DX5W", "B00503E9FY", "B000FPOJOS", "B001NX6GBK", "B002Z7BE24", "B008CP6Q6M", "B003O680RM", "B005THAX6K", "B002I0F5M8", "B0050SXX88", "B0050SXLQC", "B0010EI6T2", "B0037LVW9M", "B004FYJFNA", "B003IMGC9U", "B0022TNO7I"], "bought_together": ["B003O6E67A", "B000JLIXIG"], "buy_after_viewing": ["B000JLIXIG", "B003O6E67A", "B008CP6MA2", "B000FQBF1M"]}, "salesRank": {"Video Games": 4354}, "categories": [["Video Games", "PlayStation 3", "Games"]]}