{"asin": "B000WIK61I", "related": {"also_viewed": ["B00723KZTY", "B006IJHK96", "B00005T6GZ", "B001L9265G", "B007OAHDTU", "B001AMUI7W", "B0039UWW54", "B000JV9LUK", "B00721TUNS", "B006UK3K06", "B0047106KC", "B004XC6GJ0", "B002M3SHXA", "B00AJHDZSI", "B0000TW3RE", "B00E6IQ1BE", "B001UI2FPE", "B005Y1UFIM", "B002V41X2M", "B00008Y1BX", "B0063K4NN6", "B00D35XKW4", "B0009IRUKG", "B006GDTTM0", "B0040IUI46", "B008GG78FU", "B00768SBAU", "B00K1FZ64Y", "B00BHZLHBI", "B0001MQSB2", "B007IMPMW4", "B0000CFY6K", "B00IF0JAYE", "B008A2OG3C", "B001C4VRZK", "B002PL50H0", "B000TKDR6K", "B003VWXYUC", "B0002JKGRQ", "B00IF0JAIU", "B0009K9FZW", "B00723PZ2G", "B0056NRU3G", "B008KRLZCW", "B00HC0ZDOE", "B008C4HDQA", "B00GJ7Y7MU", "B007I81588", "B00FS480OQ", "B00I6NKP62", "B007CMHILS", "B00274S55O"], "bought_together": ["B000BTL0OA"], "buy_after_viewing": ["B004XC6GJ0", "B00AJHDZSI", "B00721TUNS", "B00723KZTY"]}, "title": "Cisco-Linksys Cable Modem with Ethernet USB Connection", "price": 79.99, "salesRank": {"Electronics": 24133}, "imUrl": "http://ecx.images-amazon.com/images/I/410Ms90YhGL._SY300_.jpg", "brand": "Linksys", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Modems"]], "description": "Experience the savings of owning your own cable modem! The Linksys Cable Modem is an easy and affordable way to get a blazing fast connection to the Internet--far faster than a dial-up and without tying up your phone line. The \"always on\" connection eliminates dial-up wait time and busy signals. Web surfing and your e-mail are instantly available, anytime. And with the extra speed, online gaming is a whole new experience and download time on big music, video, and other files goes from minutes to seconds.Installation is quick and simple. Connect it directly to any PC with an available USB or Ethernet port, and you&#x92;re ready to surf the Internet. Or connect it to a Linksys router and share that high-speed Internet access with everyone on your home network. The Linksys CM100 Cable Modem is fully compliant with all industry standards--DOCSIS 1.0, 1.1, and 2.0--so you know it&#x92;ll work with any DOCSIS cable Internet service provider.When you own a Linksys Cable Modem, you'll avoid monthly equipment rental charges and make the most of your high-speed cable Internet connection.FeaturesOwn your own DOCSIS 2.0 Cable modem and avoid paying monthly rentEasy installation--one phone call to your Internet service provider completes the setup\"Always on\" connection eliminates dial-up wait times and busy signalsUp to 100 times faster than dial-up Internet connections"}