{"asin": "B003O6JKLC", "description": "Xbox 3604GB ConsoleXbox 360has blockbuster games, HD movies and controller-free fun for everyoneBuilt-in Wi-Fi for easy connection to Xbox LIVESuper quiet with sleek new design plus matching controllerReady for the controller-free fun of KinectProduct DescriptionThe new Xbox 3604GB Console. Here today, ready for tomorrow with a brand new, leaner machine. Wi-Fi is built-in for easier connection to the world of entertainment on Xbox LIVE, where HD movies and TV stream in an instant. It&rsquo;s ready for the controller-free experiences of Kinect &ndash; you don&rsquo;t just play the game, you are the game. Xbox 360 is more games, entertainment and fun.What&rsquo;s In The Box?Xbox 360 4GB S ConsoleXbox 360 Black Wireless ControllerXbox 360 Composite A/V cable (standard definition)1 year limited warranty on consoleProduct FeaturesBuilt-in Wi-Fi:The new Xbox 360 is the only console with 802.11n Wi-Fi built-in for a faster and easier connection to Xbox LIVE. Stream HD movies and TV or download games from Xbox LIVE in 1080p and 5.1 surround sound from anywhere in the house. Compatible with b/g/n networks.Xbox LIVE:Xbox LIVE brings a world of entertainment to you. Instantly watch movies and TV streaming from Netflix. In crystal-clear HD, or download game add-ons like new levels, characters, maps and songs. Easily jump right into online multiplayer fun and play along with friends around the world. Plus, get your favorite music from Last.fm, connect with friends on Facebookand post Tweets on Twitter. Xbox LIVE is your connection to more games, entertainment and fun.Kinect Ready:Featuring a dedicated, specialized port, the Xbox 360 4GB is built to connect seamlessly with the Kinect Sensor. Kinect brings games and entertainment to life in extraordinary new ways &ndash; no controller required. Easy to use and instantly fun, Kinect gets everyone off the couch moving, laughing and cheering. See a ball? Kick it. Want to join a friend in the fun? Simply jump in. Even control an HD movie with a wave of your hand.Xbox 360 Wireless Controller (black):This award-winning, high-performance wireless controller features a range of up to 30 feet and a battery life of up to 30 hours on two AA batteries.More ports:Connect more accessories and storage solutions with added USB ports. Now with a total of 5, (3 back/2 front) you&rsquo;ll find more places to plug and play. Plus, in addition to the standard Ethernet port and HDMI output, we&rsquo;ve added an integrated optical audio out port for an easier connection to the booming sound of your A/V receiver.Attach RecommendationsKinect SensorXbox 360 250GB S Hard DriveXbox LIVE Gold 12 month cardMicrosoft 1600 Points Card* Kinect sensor and supported games coming November 2010. Microsoft Points required to purchase games, add-ons and media content (sold separately). Instant on HD in full 1080p available with select videos; requires HDMI cable, HDCP compliant 1080p display, minimum 4 mbps broadband speed. Xbox LIVE Gold membership and Netflix unlimited membership required to instantly watch movies streaming from Netflix. See Netflix Terms of Use for details about Netflix service. Xbox LIVE Gold membership required for online multiplayer, video chat, Facebook, Twitter and Last.fm. Xbox LIVE Gold membership and Zune Pass subscription required for Zune Pass. Broadband internet required.", "price": 16.71, "imUrl": "http://ecx.images-amazon.com/images/I/411d9xAlGRL._SY300_.jpg", "related": {"also_bought": ["B008I629WU", "B0050SYILE", "B003ZSP0WW", "B007XVTR3K", "B000BPLCDI", "B00BU3ZLJQ", "B0050SYX8W", "B008TP1OKI", "B002I098JE", "B00503E8S2", "B005HN5LKY", "B0097MVXRG", "B008FHL56S", "B003JVKHEQ", "B002BSA298", "B00EQNP8W2", "B00269QLI8", "B004PALCKS", "B004HYK956", "B000OYITQO", "B007MJSZDQ", "B00JPBFC8U", "B003EV7ED8", "B0089GWZ82", "B001E93IWI", "B000ZK9QD2", "B004GINKNQ", "B0047EIRIM", "B005LBDOLA", "B007LQG9A6", "B004U5615E", "B000QY9C90", "B0060QTIZG", "B00D9EPI38", "B000FRS9II", "B00ITH6OO2", "B000UODATY", "B000FRU1UM", "B00IWMAREW", "B0041CWZEM", "B003X1MUTW", "B003VUO6H4", "B002I0H738", "B000TG530M", "B001SH7YMG", "B00BMFIXT2", "B002I0J998", "B003OAE79S", "B00C710AZ0", "B005PSTV2K", "B007HGSAGQ", "B0025KZV7A", "B00EFFW0HC", "B00273Z9WM", "B002SRSQ72", "B00GYO9D0O", "B005YR1VP2", "B001MNTVNQ", "B00JK5RVIK", "B000OYMYZQ", "B000ZK698C", "B000UU3SVI", "B00CHGYUE2", "B004YV9U7U", "B000FRU0NU", "B006476318", "B00CD90R4K", "B00CD90R7M", "B0069EB9CY", "B009K5WSNI", "B004L8XEGY", "B00JJIJNB6", "B002I0H79C", "B00EVWZHLK", "B002BSA20M", "B003O6G5TW", "B003IMGC2C", "B004YV9TSA", "B006VB2UO6", "B0085CA8NY", "B00D7NQP9M", "B001NX4DUQ", "B000MKA60W", "B003EV7EC4", "B002I0JDC6", "B0050SYLRK", "B00J3KLZO8", "B008J16ARY", "B001KMRN0M", "B00519C7CE", "B0099OZR9W", "B0045EI7I4", "B00DUV027M", "B003O6EE4U", "B00GJDJP3K", "B004HX5OFW", "B005C2D2MO", "B00CXTX2YW", "B000SJ5ZX0", "B002ST7AEU"], "bought_together": ["B0050SYILE", "B003ZSP0WW"], "buy_after_viewing": ["B00D9EPI38", "B003ZSP0WW", "B00BU3ZLJQ", "B008FHL56S"]}, "salesRank": {"Video Games": 592}, "categories": [["Video Games", "Xbox 360", "Consoles"]]}