{"asin": "B000NBBWNU", "categories": [["Electronics", "Computers & Accessories", "Monitors"]], "description": "The Samsung 226BW 22-Inch Digital/Analog Widescreen LCD Monitor offers razor-sharp, widescreen image clarity and a host of innovative features. The image quality of the 22-inch widescreen offers wide viewing angles with bright colors for a very favorable viewing experience. With a wider viewing angle (160-degree vertical and horizontal viewing angle) Samsung makes sure you can see objects on your screen even when you're leaning over to grab a snack.With 16.7 million colors bombarding your rods and cones, you'll be impressed with the clearer, brighter imagery that this wide spectrum monitor has to offer. Another impressive feature of the 206BW is the pixel pitch, or the distance between pixels. This specification is usually measured in millimeters, and the smaller the pitch the sharper the image. Samsung offers a remarkable 0.282-millimeter pixel pitch for outstanding image clarity. The most talked about spec associated with LCD monitors is the measure of the difference of brightness levels between the brightest white and the darkest dark--the contrast ratio. With a contrast ration of 3000:1, this monitor assures crisp, easy-to-view images. Lastly, Samsung has designed this monitor with MagicColor to improve hue and saturation of colors. This function also adjusts mid-level colors to shades that the human eye accepts as natural. By enhancing the contrast ratio with MagicColor, fresh images with exceptional clarity spring to life, even on a darker screen.Connectivity is also important when choosing a monitor. The 226BW features an advanced dual interface that is capable of handling both analog video signals for present use, and digital video signals for the future. Whatever the signal sources are, this monitor will process those signals to give you an optimal viewing experience. In addition, this monitor features a standard D-Sub 15-pin connection and a fast DVI-D connection for your high-resolution demands.Other features include compatibility with all major operating systems (including Microsoft Vista's Premium standards) and an ultra-fast 2ms response time that virtually eliminates the \"blur\" that is present in 25, 16, and 12ms monitors (this is especially good news for gamers). Plus, with Samsung you have Magic Technologies, such asMagicBright3 and MagicTune, right at your fingertips. MagicBright3 is a new feature that provides the best viewing environment depending on the contents of the image you are watching, and MagicTune is Samsung's OSD (On-Screen Display) solution that provides a simple, convenient adjustment to the best image quality.", "title": "Samsung SyncMaster 226BW 22-inch LCD Monitor", "price": 7.99, "salesRank": {"Computers & Accessories": 11288}, "imUrl": "http://ecx.images-amazon.com/images/I/41rDwrF5vIL._SX300_.jpg", "related": {"also_viewed": ["B005BZNDS0", "B0098Y77U0", "B002RW08EC", "B00D78QCYK", "B003Y3BJ7S", "B00EZSUWFG", "B00FQU7CPU", "B00A46Y6DW", "B0058UUR6E", "B008RM235I", "B00C18YQ86", "B0069UDMXW", "B00413PHDM", "B0098Y77OG", "B008DWITHI", "B005LN1JEC", "B005BZNDOO", "B00JM99DIU", "B00C18YRSA", "B005BZNEVQ", "B00C18YUZU", "B009F1HUMQ", "B0050X2N2K", "B009HNEBLK", "B007HSKSMI", "B00C18YTC4", "B009S7ALH8", "B00ANKMNXO", "B00EZSUVHK", "B00HE61SOA", "B00C18YRNU", "B00B2HH7G0", "B008DWH00K", "B005S0XYKK", "B009H0XQPA", "B00D601UC8", "B007HSKSP0", "B00ARJNJQG", "B00G5AEZOQ", "B008RM23ZI", "B00IEZH06K", "B005JN9310", "B00BUI44US", "B00C18YRR6", "B00IEZGW8C", "B00CMKOVPQ", "B0043T7FHK", "B008RM1YQW", "B00C18YTAG"], "buy_after_viewing": ["B001TH7T2U", "B00C18YQ86", "B00C18YQ86", "B005BZNDS0", "B002R9HQLI"]}}