{"asin": "B00004X0ZO", "categories": [["Electronics", "Camera & Photo", "Bags & Cases", "Camera Cases"]], "description": "From the ManufacturerThe Expedition 3 offers expedition-level performance in a compact photo backpack.&nbsp; This full-featured pack is perfect for holding most SLRs with a lens attached up to 7 inches long, 3 to 4 additional lenses and accessories.&nbsp; For maximum protection, the pack is fully padded with thick, closed-cell foam.&nbsp; A cinch strap keeps the camera in place while a large rain flap protects the main compartment zippers.&nbsp; Features include: QuickClip tripod attachment system with vinyl reinforced mesh pocket, front accessory pocket with Tamrac's U.S. patented memory and battery management system that uses red flags to identify which memory cards and batteries are available and which ones are used up, EasyGrip handle, inner windowpane-mesh accessory pockets, and padded backpack harness. Add Tamrac accessories to the strap accessory system (S.A.S) and modular accessory system (M.A.S.) attachment slots to customize this pack.Amazon.com Product DescriptionTamrac Expedition 3 photo backpack is filled with foam padding to create a web of protection for an assortment of camera equipment. Capable of holding an SLR body with up to a 7-inch lens attached, as well as four to five additional lenses and equipment, the Expedition 3 is roomy enough to fit the needs of most photographers. Featuring a rigid platform on the bottom of the backpack to ensure stability, the Expedition 3 also features cinch straps inside the main compartment to hold a camera, lenses, or other items in place. The main entry flap has a mesh pocket on the inside for filters, film, or other loose items. Padded shoulder straps create a stable carrying surface, and a large rain flap protects against inclement weather.Expedition 3 SLR Photo BackpackFeatures ExplainedAModular Accessory System attachment slots. Accessories sold separately.BLash tabs on both sides and bottom to tie on expedition equipment or extra clothing.CAdjustable, foam-padded dividers for custom fit of equipment.DWindowpane-mesh pockets for filters and other accessories.HGiant rain flap for weather protection.GLens cinch straps helps to holds everything in place.FFoam pillars support camera with long lens attachedEFully padded with thick, closed-cell foam. Rigid, foam-padded platform in bottom.", "title": "Tamrac 5273 Expedition 3 Photo Backpack (Black)", "price": 69.95, "imUrl": "http://ecx.images-amazon.com/images/I/51h9rsjo-UL._SY300_.jpg", "brand": "Tamrac", "related": {"also_viewed": ["B0009PEUIE", "B00B9OGHM6", "B0015L8OSS", "B000I3ZM70", "B000WP3PH8", "B002TF5VC6", "B0009PCX7O", "B002TF9YOC", "B00138RRVS", "B003D5MZRK", "B00148QQSC", "B00148QQLY", "B00148RMR6", "B000EB7OTU", "B00B9OGH3A", "B002VGWFF4", "B00BEHTF4K", "B000P3ZB42", "B0019H6S6I", "B000KLQXUU", "B00ISC17PE", "B000EOUYH6", "B000F31KLU", "B0030U9PD0", "B001L5U16G", "B000F31KLA", "B000P41DZM", "B000EMW99Y", "B003D5TVAO", "B00009R6TA", "B000YIYOJ6", "B00004X10C", "B00BQ9FZO0", "B00BEHTELE", "B001O2F6RA", "B009HPC21O", "B003D5TVA4", "B001OXSLJE", "B004JMZPK0", "B00148XH5M", "B000YA1DS4", "B002VPE1WK", "B002AH2A6S", "B000YA33DC", "B009PKNMFQ", "B00KF30E6M", "B00142K4JK", "B001JD3R7U", "B0078K17WK", "B00B72R9D6", "B00579WCKK", "B00B6Z3AZK", "B004VEO296", "B009HPC2VY", "B00BQ9FYRS", "B00CF5OGP8", "B002TG3O06"], "bought_together": ["B00004ZCJI"], "buy_after_viewing": ["B002VPE1WK", "B002DW99H8", "B0009PEUIE", "B00009R6TA"]}}