{"asin": "B000R6QAHY", "description": "The Altec Lansing M812 Octiv AIR is a next-generation wireless speaker system that lets you step up to the way digital music is enjoyed today with great versatility of use. For your iPod, the Octiv AIR delivers 80 watts of powerful high-fidelity sound, without wires and in a convenient, clutter-free package. And with the included Octiv AIR remote, you'll have fingertip control of your music from anywhere in the room.The advanced Octiv AIR remote lets you control your music from across the room.View largerYou can place the speaker up to 100 feet away from the dock.View largerBrilliant Sound from your iPod Throughout Your HomeAt the heart of the Octiv AIR is a transmitter dock that transmits the music from your iPod wirelessly to the system's powerful 80-watt speaker. You can place the dock wherever it&rsquo;s most convenient and experience your music in full, brilliant sound wherever you'd like. By using a 2.4-GHz wireless link, the system delivers high-quality, static-free transmission through walls and ceilings up to 100 feet away, for best-in-class sound quality.In addition to the music on your iPod, the Octiv AIR can also send FM radio, music from your CD collection, or even satellite radio throughout your home, thanks to the dock's integrated FM tuner and auxiliary input. The included remote will give you convenient, fingertip control of your iPod, FM radio, and speaker functions. And for greater convenience, the transmitter dock will simultaneously charge your iPod while you listen to it.The bass and treble are entirely user-adjustable, so the Octiv AIR lets you control your ideal sound equilization.Note: The Octiv AIR is compatible with the iPod touch (1st and 2nd generation), iPod classic, iPod with video, iPod nano (all generations), iPod with color display, iPod mini, and iPod with click wheel.Customized Stereo Sound for Each RoomWith the Octiv AIR, you have the choice of exactly how your music is delivered. If you want to focus your music in a large entertainment room, you can add a second speaker and choose the system's \"left/right\" mode, which will separate your sound into two channels, effectively doubling your power.To truly revolutionize your sound experience, the system gives you the option of adding up to seven additional speakers throughout different rooms in your home, so you will never be away from your music.Powerful, Full-Spectrum SoundThe Octiv AIR uses digital amplification to deliver crystal-clear sound up to 80 watts RMS, enough power to fill a large room with sound. The speaker also features unique bass-enhancement technology that creates deep bass without a subwoofer.Overall sound quality is outstanding, thanks to a two-way design with dual 4-inch speakers and 1-inch tweeters that deliver clean treble and deep bass. The Octiv AIR has a system response from 42 Hz to 22 kHz.You can easily mount the speaker either on the wall with the optional wall bracket, or place it on a shelf or desktop. The Octiv AIR is so precisely tuned that it uses its surrounding environment to kick up the omni-directional bass frequencies. A switch on the speaker itself allows you to set the ideal bass EQ, optimized no matter where you place the system.The Altec Lansing M812 Octiv AIR speaker measures 17.5 x 10.75 x 5 inches and weighs 11.9 pounds. It is backed by a one-year warranty.What's in the BoxTransmitter base with dock, dock adapters, speaker, FM Antenna, remote control (batteries included), power cord, power adapter, stereo cable, user's guide, and quick reference guide.The Octiv AIR can fill a large room with crystal-clear sound wirelessly.", "title": "Altec Lansing M812 Octiv Air Wireless Speaker System with Dock for iPod (Black)", "price": 196.72, "imUrl": "http://ecx.images-amazon.com/images/I/41FADCiFkeL._SY300_.jpg", "related": {"also_viewed": ["B004TS2AOS", "B004TS2AP2", "B002I636XM", "B0014XKQY2", "B003VANOI6", "B002I636YG", "B001G5Z82I", "B005IVL0UA", "B00DXYDBPG", "B005CPBYGM", "B008BLDI4U", "B004TS2AO8", "B000V2FJAS", "B002P8M6DE", "B0038W0N8G", "B00B5RP0C0", "B005IVL0U0", "B002I3OZ7G", "B008YDTRLS", "B001DLTDQC", "B00D5ILURG", "B00DXYDCIW", "B007JCNOHI", "B0006VX1G8", "B004T1Y8G8", "B00FFH4O9Q", "B00I053I5G", "B005NGOPSY", "B002QQ7TLY", "B0043M66X6", "B00B2G3R5G", "B00B2IRFHA", "B00BCSYZQY", "B0025VKUQG", "B005KQ2O26", "B003ZQYVVK", "B00IJSAYJW", "B00BAOX6EC", "B00ALWIV12", "B005IVL0SM", "B00BLCLUQO", "B0078GCM4G", "B00FSB6B22", "B004T0MW7Q", "B00I3I5VL4", "B009CWRVH2", "B00BQ4HRN2", "B0015C30J0", "B009QSMRP8", "B004MEB4AK", "B00FPUYSXK", "B00903HKOC", "B00BLCLURI", "B002UKZ9IG", "B00EOA7EMO"], "buy_after_viewing": ["B00E5XF1DE", "B004TS2AOS", "B004TS2AP2", "B002I636XM"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}