{"asin": "B002JM5JSU", "related": {"also_bought": ["B003VAHYXW", "B003O91EUY", "B0038JE07O", "B000X23I22", "B008KCSPRK", "B002ZNJIHG", "B002ZNJIGM", "B00EUMLYOK", "B004WT6Z54", "B00EUMNQTG", "B005CKDICA", "B0013CFRWK", "B001PFKI24", "B002JLZMN8", "B008SHK7W8", "B005FSLI80", "B001LL5JDA", "B0081UUYWA", "B0019804U8", "B000UV3G9Q", "B003KKD7DY", "B008TSB2C0", "B004C4ZVW2", "B000TYR5R8", "B0042ET0LU", "B000IJY8DS", "B00B6RZ7MM", "B008D5TYGU", "B001BBMWBW", "B0016FYDQU", "B001AKVBFC", "B001BBS7ZW", "B0035YUOWC", "B00D80J2XU", "B0074WIVJ4"], "bought_together": ["B000X23I22"], "buy_after_viewing": ["B006ZP8UOW", "B00F9FCW7K", "B008SHK7W8", "B000X23I22"]}, "title": "Panasonic BL-C230A Wireless Internet Security Camera", "price": 379.98, "salesRank": {"Camera &amp; Photo": 1981}, "imUrl": "http://ecx.images-amazon.com/images/I/31KvUiII2PL._SX300_.jpg", "brand": "Panasonic", "categories": [["Electronics", "Camera & Photo", "Video Surveillance", "Surveillance Cameras"]], "description": "Do you sometimes worry about things at home while you're at work or on vacation? Save your worries with Remote Monitoring by Panasonic Home Network Camera. Panasonic network cameras let you monitor your room over the Internet from wherever you are. They even notify you by e-mail when they detect moving objects. And you can choose the video format to match the Internet connection and your viewing needs. Let Panasonic network cameras keep an eye on things - anytime, anywhere - so you can relax and enjoy yourself.Triple sensors monitor and capture images when motion, sound, or body heat is detected.The small and discreet profile fits almost anywhere in your home or office.A Camera with the Ability to See, Hear, Feel and InteractIntroducing the Panasonic BL-C230&mdash;the newest addition to the Panasonic Network Camera family. The crystal clear video image is easy to access right from your PC or hand-held device. An on-screen user interface with the ability to pan, tilt, and zoom allows you to adjust camera view wherever you may be. And with Triple Sensor technology detecting changes in sound, motion, and body heat, this camera is the next best thing to being two places at once.Triple Sensor TechnologyThe Panasonic BL-C230 camera offers a Triple Sensor with the ability to track changes in movement, sound, and body temperature in your indoor atmospheres. When the Triple Sensor is activated, an instant email alert is sent directly to your mobile phone or PC with a captured image from your network camera.Body Heat Sensor -Monitors the presence of people in a room and can be discretely placed at the entryway of your home or office.Motion Sensor -Works well in still areas, such as stores and restaurants after hours, and will alert you with an email and image capture when it detects movement, such as during an accident or break-in.Sound Sensor -Perfect for a baby's room or with new pets. This sensor will alert you to any noises made in the room.Connection and MonitoringThe BL-C230 is a wireless model with built-in anntenae, easily connecting directly to a wireless network. Your network camera user interface can be accessed right from your PC or mobile phone. Panasonic Network Camera has built-in memory storage for security and personal purposes. Refer to your captured videos and images to monitor live-in nannies, office activity, or store employees. Share videos of your loved ones with family and friends.The BL-C230 is also compatible with Panasonic&rsquo;s Viera Cast&trade; Televisions. With a few easy clicks of the remote, watch up to eight connected cameras around your home or office. The following Panasonic HDTVs will support BL-C230 Network Camera:TC-PG10 series with 42, 46, 50, and 54-inch screenTC-PG15 series with 42, 46, and 50-inch screenTC-PV10 series with 50, 54, 58, and 65-inch screenTC-P54Z1Convenient Internet access provides peace of mind while you're away.See There When You Can't Be ThereThe convenience, simple installation, and instant email alerts in this reliable video monitoring system make for peace of mind...at the click of a button.BL-C230 Wireless H.264/MPEG-4 Network Camera FeaturesWireless connection (IEEE 802.11 b/g)Image transfer by timer, alarm, motion, sound or human presencePlug &amp; Play installationAccess via hand-held device or PCNo PC required on siteEmail alert notificationsH.264 compression for high quality imagesBuilt-in memory for storing images and videoWhat's in the BoxBL-C230 camera, AC Adapter, Set-up CD-ROM, Screws (6), Washers (4), Safety Wire, and Installation Guide"}