{"asin": "B000A2R54M", "description": "The ultimateMario Kartrace is on&hellip;and online via your Nintendo Wi-Fi Connection inMario Kart DS. Drawing on more than 30 courses and battle arenas from every game in theMario Kartseries - not to mention tons of new ones,Mario Kart DSallows you to play as Mario, Luigi, Princess Peach, Wario, Yoshi, Donkey Kong, Toad, Bowser and Shy Guy as you put the pedal to the go-kart metal, grab coins to max out your speed and blast rivals with the ever-popular arsenal of red, green and spiked Koopa shells in a race to finally put to rest the question of who is the true king of the Mushroom Kingdom racing circuit.Race the Mushroom circuitMario is a veteran of the circuit.View larger.Choose your favorite character.View larger.Peach is a master drifter.View larger.Select the Kart you want.View larger.Bowser is the bruiser of the track.View larger.Watch your position in the pack.View larger.Progressing Through the GamePlace first in Grand Prix circuits or clear skill-based missions to open up increasingly difficult and thrilling circuits. Of course, players can have multiplayer races on any open courses or battle in arenas.Game Modes: At Least Five Ways to PlayWhether you prefer to race by yourself or to mix it up with friends,Mario Kart DSis a game with something for everyone. Features five different game modes, these include a 'VS' and 'Battle' mode that are available in multiplayer for up to eight players via local wireless connection while all modes are available singleplayer. See a complete list and description of the play modes below:Grand Prix Mode: In Grand Prix Mode, the driver who earns the most points at the end of a four-course cup is the victor.Mario Kart DSfeatures eight different cups, with each cup featuring four different tracks.Time Trial Mode: Your objective in Time Trial Mode is to get the fastest time that you can on a single track. . You can save your best runs as ghost data and share them with a friend.VS Mode: A competitive mode that can be either singleplayer. or multiplayer. In the singleplayer. version you'll race against computer-controlled karts, while in multiplayer you'll race against human opponents who play using their own Nintendo DS systems.Battle Modes: Mario Kart DS contains two battle modes.Balloon Battle Mode: Your goal is to pop your opponent's balloons by attacking/stealing them by colliding into an opponent via a mushroom boost, before your own balloons are popped.Shine Runners: In this mode the driver who collects the most Shine Sprites is the winner.Mission Mode: In this mode you are given sets of specific missions that you must clear in order to move on to the next set of missions. What could wait at the end?Special Powers, Weapons, Moves &amp; FeaturesTurbo power-drifting and item tossing is the order of the day, whether players are racing around an obstacle-filled track or battling in an arena. Use familiar items taken from every game in the series like Green Shells, homing Red Shells, Bananas, Bombs, Lightning and the destructive Spiny Shell, not to mention new ones like the Blooper. The touch screen features a map that shows items being fired at players, who can even tap it with their fingers mid-race to zoom in or out.Wireless Communication: Even More Ways to Play:Mario Kart DSfeatures three different forms of wireless game play: two kinds of local wireless game play and Nintendo Wi-Fi Connection online game play.Mario Kart DSoffers two different options for LAN Wireless game play: DS Download Play, in which only one player hasMario Kart DSand all players have Nintendo DS systems, and Multi-Card Play, in which all players haveMario Kart DSand Nintendo DS systems.DS Download PlayAs with all DS Download multiplayer games, the DS Download Play inMario Kart DSrequires that only one player has a copy of the game. Unlike past DS games, however, DS Download Play inMario Kart DSallows multiple players who have the game card to play with multiple players who do not have the game card. DS Download Play offers the following features:2-8 player simultaneous wireless game play.A choice of multiplayer racing, Balloon Battle, or Shine Runner modes.Players who ownMario Kart DScan choose their own characters and use personalized icons, while players who do not ownMario Kart DSmust play as Shy Guy and cannot use personalized player icons.Track selection is limited to eight tracks for racing and three arenas for Balloon Battle and Shine Runner modes.DS Download Play is limited to the 100 cc engine classMulti-Card PlayMulti-Card Play requires all players to have their own copies ofMario Kart DS, giving players more options, modes and tracks to choose from. Multi-Card Play offers the following features:2-8 player simultaneous wireless game play.Your choice of multiplayer racing, Balloon Battle, or Shine Runner modes.Players can choose from different engine classes.No limits on character choice.No limits on track choice.Player's win/loss ratio is saved and tracked.Players who race locally are automatically added to each other's friend roster and then can race via Nintendo Wi-Fi Connection.Players can trade ghost data wirelessly, allowing them to race against each others' best times.Nintendo Wi-Fi Connection:Nintendo Wi-Fi Connection is a free online game-play service provided by Nintendo to Nintendo DS owners. It offers seamless access to online game play and an environment that is welcoming to gamers of all skill levels. Features include: Whether it's the updated graphics that retain the side-scrolling feel of classic games in theSonicfranchise, an expansive world to race through and explore or the multiple and new ways to play,Sonic Unleashedoffers something for players of any age or level of ability.2-4 players racing simultaneously.Choice of playing with:Friends only (players registered as Friends)Rivals (players with similar skills)Recent opponentsRegional racers (players in their country)World racers (players anywhere in the world)No limit on course choice, but each player votes for a course and the course with the most votes wins (in case of a tie, the course is chosen randomly)No limit on character choicePlayers can create and use personalized player iconsConnecting to the Nintendo Wi-Fi Connection will be quick, easy and seamless. Players can go to an official Nintendo hotspot and immediately go online and start playing. To use their home Wi-Fi routers, players first must configure the DS to connect to their routers by entering the router's network ID and optional security key or install the Nintendo Wi-Fi USB Connector on their PC and configure the DS to enable it to share the PC's broadband connection. After that, players can go online anytime without further configuration. Friends are registered to the friends roster either by exchanging and entering Friend Registration Keys or by playing local Multi-Card Multiplayer mode together.", "price": 39.99, "imUrl": "http://ecx.images-amazon.com/images/I/51%2B0W2WBidL._SX300_.jpg", "related": {"also_bought": ["B000ERVMI8", "B000U34SZA", "B002WDL53O", "B0006B0O9U", "B003ZHQH02", "B001SICHU4", "B004M8M2H0", "B001290A3U", "B001T8W2LW", "B000I10PY2", "B000BIZR72", "B000VXJEW6", "B000R4J35W", "B001TH8HAS", "B002I0GU2M", "B000TZI2FQ", "B000FO4KO8", "B00F6YISIQ", "B001C6H8LA", "B001T8S62Q", "B0053BCO00", "B008XN2GZI", "B008UQWX0Q", "B000NUBY0C", "B006ZPAYPU", "B003BMJKI2", "B008DNUXBM", "B00407F2BQ", "B000LLUXDW", "B00005MDZY", "B000FUWCRY", "B002LL2086", "B000HE7KZC", "B002B1TDV8", "B001TOQ8WU", "B0088MVPFQ", "B0038N09LG", "B0009UBR3K", "B0036VSD3G", "B003T8BWWK", "B00B98HHAI", "B0018SRLGE", "B007M4L6BY", "B0039XVFF4", "B000R4NFC4", "B0009Z3MQK", "B000GHG9V6", "B004IYY8PW", "B0033BJS92", "B0050SVNP8", "B0050SVOXE", "B002DOC93C", "B002I08UGQ", "B007WPM9GO", "B000FRV2UK", "B0037UCSQ4", "B001PIY49O", "B0050SVMCC", "B000R4GF94", "B000I10PYC", "B0019QEY06", "B002AUULC0", "B001TOQ8UW", "B0045IH196", "B005J3J4R8", "B00CAWFA1A", "B000SH3XE0", "B000FW57OC", "B0019QEY3I", "B000PTYKSY", "B003OQDJDW", "B007ZZGLMO", "B002BRYHT0", "B005DVAB2S", "B0027PA2EA", "B000CNESHG", "B000BT4ABA", "B002I092MM", "B00266P7KY", "B005VKRGT2", "B005EHQHSS", "B0024WJV9I", "B00EZPCWWA", "B001GIUWX0", "B00078ZGTA", "B00EZPCX1A", "B000HEB3U0", "B008J16AQK", "B001C0L7L8", "B000H5U5DA", "B000EGELP0", "B004393I0I", "B000TG52YY", "B00B2Q8RM4", "B007PX6MFM", "B008E6ZXSG"], "bought_together": ["B000ERVMI8", "B000U34SZA"], "buy_after_viewing": ["B000ERVMI8", "B0053BCO00", "B0088MVPFQ", "B002WDL53O"]}, "salesRank": {"Video Games": 323}, "categories": [["Video Games", "Kids & Family", "Nintendo DS", "Games"], ["Video Games", "Nintendo DS", "Games"]]}