{"asin": "B001FA1NUU", "description": "Introducing the new, colorful clip-and-go iPod shuffle. Its buttons give you an easy way to play your music. With a press of the VoiceOver button, you can hear the song's title and artist, playlist menu, or battery status. And it holds hundreds of songs, multiple playlists, and Genius Mixes, so you can always have the perfect music for every mood.With buttons, VoiceOver, and playlists, it's the perfect mix.Click to enlarge.Built-in clip.Easy-to-use control pad for playing your music, audiobooks, and podcasts.Available in silver, blue, green, orange, and pink.Design. As beautiful as it is wearable.Sleek, polished aluminum. Five brilliant colors.Its main body is crafted from a single piece of aluminum and polished to a beautiful shine, so the new iPod shuffle feels solid, sleek, and durable. And the color palette makes it the perfect fashion accessory. Choose gleaming silver, blue, green, orange, or pink.Hundreds of songs to goNever leave a favorite tune behind. Along with up to 15 hours of battery life, iPod shuffle gives you 2 GB of storage capacity, good for hundreds of songs. That's plenty of room for the essential songs for your workout or commute. And for multiple playlists, Genius Mixes, podcasts, and audiobooks.Goes anywhere. And with anything.iPod shuffle isn't just portable. It's wearable, too. Clip it to your shirt, jacket, workout gear, backpack, or purse strap, and it stays put--whether you're running an errand or running around the track.Controls. Right on the button.Control your music with just a clickIt's back--the big, clickable control pad on the front of iPod shuffle. It's 18 percent larger than on previous iPod shuffle models, so it's even easier to see and use the music controls. Press the center button to play and pause. Press the outer buttons to skip forward or back and adjust volume. Click, click, click. It's music to your fingers.Play it your wayMaybe you're the spontaneous type. Or maybe you prefer a little order. Just flip the shuffle switch to suit your listening style. Flip it to the left, and you'll hear your music in a refreshingly random way. Flip it to the middle, and your songs play in order. Or flip to the right to turn iPod shuffle off.VoiceOver. It tells you what you want to hear.Give your songs a voiceSay you're listening to a song and want to know the title or the artist. Just press the new VoiceOver button on top of your iPod shuffle, and it tells you. You can even use VoiceOver to hear the names of playlists and switch between them. And if your battery needs charging, VoiceOver tells you that, too.It speaks your languageA French love song. A Spanish bolero. An Italian cantata. Your music library has songs from all over the world. That's why VoiceOver speaks 25 different languages. So it can tell you song titles and artists in their native tongues or any language you choose.Playlists. The perfect mix for every mood.Sync to your heart's contentiTunes on your Mac or PC makes it easy to load up your iPod shuffle. Just choose the playlists, audiobooks, podcasts, and other audio files you want, then sync.When one playlist isn't enoughYou probably have multiple playlists in iTunes on your computer. One for your commute. One for the gym. One for just relaxing. Sync all those playlists to iPod shuffle, and you can play the perfect mix for whatever mood strikes you. VoiceOver tells you the name of each playlist, so it's easy to switch between them and find the one you want without looking.Genius comes to iPod shuffleThere's another way to get a good mix of music on iPod shuffle: let Genius do the work. Activate Genius in iTunes on your computer, and it automatically finds songs that sound great together. Then it creates Genius Mixes, which you can easily sync to your iPod shuffle. It's the perfect way to rediscover songs you haven't listened to in, like, forever.What's in the Box?2 GB iPod shuffle (blue), Apple earphones, iPod shuffle USB cable (45 mm), quick start guide, and other important product information.", "title": "Apple iPod shuffle 2 GB Blue (4th Generation) (Discontinued by Manufacturer)", "price": 66.0, "imUrl": "http://ecx.images-amazon.com/images/I/41VGQH0OLtL._SY300_.jpg", "related": {"also_bought": ["B001FA1NVE", "B001FA1NVO", "B001FA1NUK", "B000E5GCJE", "B000NU4OTA", "B005Q74EEU", "B004D2EL2Y", "B004NY7B9C", "B00496G5KU", "B006PB3QEA", "B005XRSFNY", "B004R5VEPY", "B0097BEEDM", "B0097BEEMS", "B000IHGJ50", "B0097BEEF0", "B009QXCA6E", "B000PB4BPO", "B002L6HEAU", "B000QHOB4S", "B004D63A9U", "B0097BEECI", "B0097BEEIW", "B002L6HEBE", "B00AIGZ72C", "B004A7TAAK", "B0097BEEGE", "B0030LVHM6", "B000MVHRRQ", "B008F4ZR6A", "B004R5ZBIA", "B005EEGBNW", "B0097BEEJQ", "B002L6HEA0", "B005GS3C2O", "B000NHWM0G", "B001FA1O0O", "B000LQY5TA", "B002M3SOME", "B002L6HE9G", "B002M3SOM4", "B0049YFWD8", "B004D66YO8", "B001FA1NSC", "0440238390", "B002L6HECS", "B0045DT3A6", "B003EM6AOG", "B001FA1O18"], "buy_after_viewing": ["B0097BEEIW", "B0097BEEW8", "B001FA1NUK", "B0097BEECI"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}