{"asin": "B004WLRQMI", "description": "When an evil darkness enshrouds the land of Hyrule, a young farm boy named Link must awaken the hero and the animal within. When Link travels to the Twilight Realm, he transforms into a wolf and must scour the land with the help of a mysterious girl named Midna. Besides his trusty sword and shield, Link will use his bow and arrows by aiming with the Wii Remote controller, fight while on horseback and use a wealth of other items, both new and old.The most epic Zelda ever launches with the Wii.Link roams an entirely new land of Hyrule.View larger.Take control of your trusty horse as you travel from quest to quest.View larger.Link must solve a number of challenging puzzles to progress to boss battles.View larger.Fishing with the Wii Remote is a fun and worthwhile diversion.View larger.Link's journeys, reinventedHailed by many as the best Zelda game since 1998'sOcarina of Time,Twilight Princessthrusts players into a troubled world ravaged by a dangerous magic. Sporting a new, more realistic visual style than the previous Zelda title, Link looks much more like an adult than in previous installments and fits well into an environment that provides Zelda fans with a much more gritty and grim environment to explore. The entirety of the quest fits this darker mood, as both Link and NPC's alike share the same concern for the changes about in Hyrule.More than just a spiritual successor to previous Zelda installments,Twilight Princessoffers players a new way of controlling Link through dungeons, forests, towns, and the bizarre Twilight Realm: precise weapon controls with the Wii remote! Players can use the remote to control Links' weapons including the sword, arrows, and boomerang. This new control scheme allows for much faster and more accurate control than on previous Nintendo hardware. For example, waving the remote in the air will result in Link performing the same move with the sword. To fire off on arrow, players \"pull back\" on a virtual controller string as the Wii remote's speaker lets players know that the projectile is ready for release. It all works incredibly well and adds to the title's immersion and style- you feel more in the center of the action than in previous Zelda games.As impressive as the new control scheme is, the scope and size of the new land of the Hyrule is equally as impressive- truly the Wii's first epic adventure. Beautifully crafted and four years in the making, the land players travel through is vast and diverse as the dungeons and monsters that lie within. As players collect triforce pieces from the distant sections of the continent, they will get to know many different villages and foes. Thankfully, Link will be able to move over long stretches of land faster thanks to \"Epona,\" your faithful horse. Epona also helps Link become a more effective fighter, as a number of powerful and impressive sword strikes can be launched while galloping through fields of enemies.The Twilight Realm awaitsLike most games in the Zelda franchise, Link begins his adventure with little more than the clothes he has on an an inkling that something has gone awry. After an initial trip to the Twilight Realm, in which Link appears as a wolf, a friendly shadow dweller named Midna will meet up with players and give helpful advice on gameplay. Fortunately for players, this virtual assistant spells out ways to be a more effective adventurer in and out of the shadow world. Early stages of the game have Link spending a lot of time in the Twilight Realm, and outdoor areas of Hyrule, attempting to clear areas of the strange darkness that has seemingly fallen over every village, forest, and field. As the story progresses, players will learn the cause of the shadows, and what they must to do vanquish them for good.Puzzling puzzlesLink once again finds himself in a number of classic Zelda-esque puzzle scenarios in which he must light torches to unlock doors, raise and lower water levels, and fight enemies to collect keys and open chests for valuable rupees. A number of the dungeons present unique puzzle challenges that rely on the player's ability to hone their Wii remote's control, such as an air castle in the sky that can only be accessed by an extremely accurate grappling hook toss.In general,Twilight Princessis more challenging than the average Zelda game, with a number of boss battles having protracted hit sequences with little support potions about, and even less warning. Still, there's never been an adventure experience such as this, wherein players can literally charge at a dungeon boss with their fists and punch the air to defeat an enormous foe. As the finest Zelda experience in almost ten years and the game fans have been waiting for,Twilight Princesswill delight young and old gamers alike.", "price": 110.39, "imUrl": "http://ecx.images-amazon.com/images/I/519LgOv9z7L._SY300_.jpg", "related": {"also_bought": ["B002BSC54I", "B006QRNKOO", "B0094X1ZXU", "B005FYJA52", "B002BSA388", "B0094X28J0", "B002TLTBN0", "B000FQ9R4E", "1598120042", "B000P46NKC", "B002BSC4ZS", "B00269DXXO", "B000FRV2UK", "B00G2GD6TS", "B000Z9A95M", "B007CSF3GO", "B003ZHMMEM", "B003O6E800", "B002I0GF72", "B00269DXR0", "B005EHQJ2C", "1616550414", "B0050SVGW8", "B003ZCH7DI", "B00KWEHBAG", "B001TOMR0C", "B005EIIBKY", "B0019SY1D4", "B009AFLXQQ", "B002BRZ9G0", "B00EV4O8VS", "B00DC7G2W8", "B007RNWUC4", "B00GANWVJE", "B00DC7G0GG", "B000FQBPDU", "B0094X2066", "B002ATY7JE", "B002I0IIPY", "B00F2ENJY8", "B002I0GEXM", "B009EWHKAI", "B00DD0B0BM", "B001TOQ8UW", "B0009VXBAQ", "B00G0OYHCW", "B00005ATSN", "B001TOMQVC", "B002CZ3SLO", "B0049DYNNO", "B00DC7O77A", "B002EE7OKE", "B0050SVGU0", "B005EIIS4S", "B000P297F2", "B004C34D2M", "B002EE5SAC", "B0081716P2", "B000NNDN1M", "B001C58T46", "B00005ATSM", "B00FLYZIM0", "B004JKZUJI", "B002BRYXOO", "B000W5Y49G", "B002E6XY6U", "B000X25GW2", "B0056FOHVW", "B002I08CSW", "B008GFZV6Y", "B0020H46D8", "B000FQ9QVI", "B009AFLXJS", "B004IK24MU", "B005QWYKOE", "B00A878J5I", "B00897Z218", "B00FLYZ7NU", "B00897Z27C", "B00ANHBI4W", "B0094X227I", "B000GLHQJG", "B00KWFCU4M", "B000RW3V3E", "B001COVME6", "B000L9NPGG", "B0045F8QDE", "B001D8PFIK", "B00J4QLE0G", "B00A878J4E", "B00FE8WKPQ", "B00BMFIXEW", "B002GEKIOG", "B0017KIBAI", "B002OL1KEI", "B00030GS80", "B0037US4IA", "B009NRO1J2", "B003IOGPAO", "B001ET07O0"], "bought_together": ["B002BSC54I", "B0094X1ZXU"], "buy_after_viewing": ["B000FQBPCQ", "B006QRNKOO", "B002BSC54I", "B000FQ9R4E"]}, "salesRank": {"Video Games": 708}, "categories": [["Video Games", "Wii", "Games"]]}