{"asin": "B002L6GCP8", "related": {"also_bought": ["B009F7G0AI", "B005L38QHA", "B004FHU4FA", "B0044DJZ0A", "B0079PC0EI", "B005S6XNPA", "B0002H7F3G", "B00E563PV6", "B004GZ2RCY", "1465414444", "B00D8E0ERY", "B001RB61LS", "B008I64UF4", "B004AM5RAM", "B00292OW1U", "B004EX44ZQ", "B00BKBMQCI", "B009LNEO1I", "B0050SZDAO", "B0051QOKBS", "B0030GUGC8", "1451684487", "B007D82BNG", "B00FDQQF82", "B00392PQT6", "B00FGOSLX8", "B0077R9V6I", "B005Y2E9OW", "B001RB3WO2", "1416293590", "1416539905", "B00F9ZQQ8Q", "B003NQTWCA", "1416550763", "B004AM5RAW", "B0050SZBP6", "B00FDQQFNW", "B00BMCEFH4", "B002YF3OCU", "B008MR2EGG", "B008H8LE4I", "B004ILYZR6", "B00HRQB28Y", "B005EQJ4RU", "B0044DEDCA", "B009716ESA", "B008ZT9YAA", "B00G6CLNCK", "B008ZT9VB2", "B008I64U2C", "B008ZT9WT8", "B009V9LR4Y", "B000AOMO50", "0744015421", "B004M8RWDE", "B003VNCROU", "B0018MU3SS", "B002N60HES", "B004AM5RB6", "B0083F31K0", "B00F9XE932", "B004EXB3GE", "1416550674", "B001NXDBI6", "B002R0DX1E", "B00E8CF268", "B009R4I01G", "B000VOE466", "B005G8DIPA", "B00063BLG8", "B003Q9PG24", "B0036WTBFY", "1416550887", "074401414X", "B009XDWUCQ", "0671041517", "143915760X", "B0083F31IW", "B007VPZR5U", "B0060SXDRI", "0744014336", "B00AM2GZTQ", "B0050SZ1JW", "B000VJTJNE", "B001NEK2GE", "0743471385", "B002ZVQMEU", "B003VANOFY", "B008U5ZNIG", "B008AMK9VK"], "bought_together": ["B005L38QHA"], "buy_after_viewing": ["B003VANOFY", "B005L38QHA", "B001SEQN3U", "B00BFOEY4I"]}, "title": "Creative Sound Blaster World of Warcraft Wireless Headset", "price": 113.0, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41mcLHPplIL._SY300_.jpg", "brand": "Creative Labs", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Headsets & Microphones", "PC Microphones"]], "description": "Specially designed for World of Warcraft gamers, the Creative Labs Sound Blaster World of Warcraft Wireless Headset will transport you to the world of Azeroth. THX TruStudio PC technology lets you experience outstanding depth of audio, while VoiceFX technology lets you alter your voice to sound like familiar World of Warcraft characters and creatures. Best of all, this headset delivers an unbeatable gaming audio experience without the hassle of cables.World of Warcraft Wireless HeadsetAt a Glance:THX TruStudio PC technology for immersive audio realism.VoiceFX technology to disguise and alter your voice.Wireless connectivity with uncompressed, high-quality sound.Detachable noise-canceling boom mic provides clear communications.Customizable ear-cup lenses for personalization.An uncompressed wireless connection gives you both outstanding audio quality and freedom from wires and tangles.THX TruStudio PC technology brings you surround effects for amazing immersive audio realism.View larger.Experience World of Warcraft Like Never BeforeIf you're one of the millions that play Blizzard's bestselling game, then Creative Labs made the Sound Blaster World of Warcraft Wireless Headset especially for you.THX TruStudio PC technology powers the headset to achieve an amazing level of immersive audio realism. This second-generation audio enhancement technology produces stunning surround effects with virtual speakers around, above, and below you. Additionally, the 40mm neodymium drivers deliver full-range sound and bass impact, giving you an authentic experience.The headset also features VoiceFX technology that lets you morph and disguise your voice to sound like different World of Warcraft characters and creatures.Wireless Freedom with Built-In Rechargeable BatteryFeaturing wireless connectivity, this headset brings you even closer to the world of Azeroth. You'll be able to concentrate on the game without worrying about tangles. And when you need a break to get up and walk around, you won't have to take off your headset.Unlike many other audio devices, this headset doesn't sacrifice sound quality for wireless freedom. Creative Labs employs an advanced, uncompressed wireless connection to transmit your audio and voice, so there's nothing missing in your audio landscape.The built-in rechargeable lithium polymer battery delivers an outstanding eight hours of continuous gaming per four hours of charging, and is fully rechargeable even while in use. To recharge, simply plug in the included USB power cable.Easy-to-use software and interchangeable lenses let you choose between 16 million colors and proudly declare your allegiance.Noise-Canceling Microphone for Clear ConversationsCommunication during raids and in the arena is vital. The Sound Blaster World of Warcraft Wireless headset uses a professional-grade noise-canceling microphone, so you'll always be able to communicate clearly with your guild or Arena mates when coordinating your attack. Also, the microphone is detachable, so it won't get in the way if you're using the headset to enjoy your music.Declare Your Allegiance with Customizable LensesThe removable ear-cup lenses can be used to declare your allegiance to your faction. Every headset includes a set of Horde and Alliance lenses, and additional lenses will be available in the future as well. Included software makes it easy for you to customize the color of the programmable LEDs that illuminate the lenses--16 million colors to be exact. And you can control the intensity and pulsation of the lighting as well.Smart Design is Comfortable and PortableTo keep you comfortable for extended gaming sessions, the headset features oversized cups and padding that fit snugly over your ears. Volume, mic mute/pairing, and power buttons are built into the ear cup, so you can change settings quickly.And in case you need to change locations, this headset makes it a cinch. It folds flat, and the microphone detaches for quick and easy portability. Included with the headset is a pouch for protection during travel.Volume, mic mute/pairing, and volume buttons are conveniently built into the ear cup.View larger.Customizable Software IncludedThe World of Warcraft Audio Control Panel allows you to easily configure this headset for a personalized audio experience. In addition to customizing the illumination options, you can also enable VoiceFX and equalizer for game audio, turn on and off THX TruStudio PC, bind commands to keys for quicker access, and save multiple profiles that you can easily switch between.System RequirementsIntel Pentium 4 1.6GHz or equivalent AMD processor.RAM: 512 MBAvailable USB 1.1 or USB 2.0 portOS supported:Windows 7 32-bit and 64-bitWindows Vista SP1 32-bit and 64-bitWindows XP SP2 32-bit and 64-bitMac OS X 10.5 and aboveThe Sound Blaster World of Warcraft Wireless Headset is backed by a one-year limited hardware warranty.What's in the BoxWireless headset with detachable microphone, USB wireless transmitter, travel pouch, braided USB Type-A-to-mini-USB plug cable (for charging), quick-start booklet, two sets of interchangeable headset lenses (one pair of Horde symbols and one pair of Alliance symbols), and online software installation with user guide."}