{"asin": "B001TOMQOY", "description": "Army of Two: The 40th Dayis a third-person shooter based in groundbreaking cooperative gameplay functionality. Sequel to the 2008 game of the same name, and featuring series heroes, Rios and Salem, in this new iteration players have a bigger playbook of features and a new arsenal of co-op moves that either player can perform at any time, opening up fresh strategies in the face of overwhelming odds. In addition, the game features advanced weapon customization and upgrade systems, as well as four explosive online multiplayer modes, each focused on unique cooperative play..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Extreme co-op tactics and gameplay.View larger.Extensive weapons customization.View larger.Help from Mission Coordinator Alice Murray.View larger.Improved cover system.View larger.StorySet a few years after the events of the originalArmy of Twogame,Army of Two: The 40th Dayfeatures the continuing adventures of millitary contractors Tyson Rios and Elliot Salem. With the help of Alice Murray, their mission coordinator, they now run their own paramilitary business, known as TransWorld Operations (TWO). Working what seems to be a routine mission in Shanghai they find themselves surrounded by a force of competing private military contractors intent on running amok in the city. Will Rios and Salem survive? Will they be able to make a few bucks off a bad situation? All they have is each other to rely on.GameplayAs with the originalArmy of Two, and as the name of the series implies, gameplay inArmy of Two: The 40th Dayrevolves around co-op combat tactics necessary to survive specific and general combat situations. Players can team up with an AI companion in single player mode or a human friend in two-player co-op. Co-op tactics are made aware to the player in what is known as the co-op playbook. Unlike the original game, which in some instances limited the use of some tactics to certain situations, inThe 40th Day, players have access to all tactics. Implementing these against opponents revolves around the game's \"Aggro\" system, tallied in the heads-up-display (HUD) and which measures the amount of attention a team member draws from opponents for certain tactics, leaving the other team member in various states of freedom to launch coordinated attacks as chosen. In addition to this change, players are also faced with moral dilemmas in the game, including choices presented to one of the players on a team that the other must bear the consequences of, as well as the decision as to deal with and/or defend civilian non-player characters (NPCs), who can be killed in the game.Multiplayer ModesIn addition to its single player campaign,Army of Two: The 40th Dayoffers a robust, region-free, multiplayer experience that provides an array of unique features for up to 12 players at a time. This experience consists of four modes, including, three brand-new modes that provide a variety of objectives for partners to battle over. The four modes are:Co-op Deathmatch- An intense battle of survival between up to six two-player partnerships. Only by mastering teamwork and partnership skills will players earn the most points and come out on top.Control- Sets players partnerships as TWO or FDI rival faction members as they aim to capture strategic locations in the city. Work with your partner and faction to control the most points within the time limit.Warzone- Is an all-out objective-based battle between TWO and FDI forces. Complete the most Destruction, Assassination, VIP, and Infiltration missions with your partner and faction to crush the opposition and win.Extraction- Pits a team of four players against a series of unique enemy waves as they move from point to point in the ruined city. Players must strategize as a unified team to combat the different forces of the 40th Day Initiative while trying to get out alive. Extraction is a bonus mode that will be available for free one month after Army of Two: The 40th Day is released, or at launch for players who pre-ordered.Weapons CustomizationArmy of Two: The 40th Dayfeatures the most advanced weapons customization ever seen in a video game. Using money earned in-game for your contracting duties you can adapt your arsenal and firepower to fit the obstacles you face. With malleable attributes like handling, accuracy, ammunition capacity, and power, coupled with a huge variety of parts and the ability to make customizations at any time in the game, the possibilities and impact you can make through customization are virtually limitless.Key Game FeaturesThe Best Co-op Experience with All-New Moves and Tactics-Army of Two: The 40th Dayhas been built from the ground up with a focus on an incredible cooperative experience. The result is a bigger, better, more organic and immersive co-op experience that lets you put your best two-man tactics to use whenever and wherever you want.An Epic Story- A carefully orchestrated series of mysterious catastrophes is dragging Shanghai, China to the brink of ruin, and now the Army of Two must fight their way through ravaged city districts as they try to beat the odds and uncover the secret of the 40th Day.Explosive Game Modes Focused on Unique Co-op Play- Take your partner online in explosive multiplayer modes, each focused on unique cooperative play. Or strategize in the four-player co-op Extraction bonus mode and take on a series of intense enemy waves as you move from point to point through the ruined city.12-player Multiplayer Support- Game supports up to 12 players in online modes.Advanced Weapons Customization- Change your weapon in the heat of battle and adapt your firepower to the situation.", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/61y1CJDjQCL._SY300_.jpg", "related": {"also_bought": ["B000RHZ9G6", "B0050SXEM8", "B0023CBZ70", "B000UUATJ2", "B003O6E67A", "B00320JAWY", "B000HGOHWO", "B0010EI6T2", "B002I0K6DG", "B001NX6GBK", "B0050SXLQC", "B003GT8IL0", "B0037LVW9M", "B002ZJNWWC", "B002ELCV00", "B000JLIXIG", "B00354NANC", "B002BRZ744", "B0012N94WO", "B000WS97QI", "B002I0J82G", "B0050SXGU8", "B001RTCOWA", "B0050SXZ7W", "B0050SWZHS", "B0012N3T3Y", "B0056WJA6C", "B002BRZ6UE", "B00503E9FY", "B00309XHD0", "B004UDB9SA", "B00163LW7K", "B0050SXFKE", "B00269QLH4", "B002Z7BE24", "B004EQCCI4", "B005THAX6K", "B0076ZQSFI", "B0050SX9VO", "B0016B28WU", "B0086V5V8G", "B000QAVV6G", "B004EW948E", "B0016GC9D8", "B0022TNO7I", "B0050SWUTQ", "B002I0H2G0", "B000HKP88C", "B0085CA8QG", "B007TYC8MI", "B001UWGCW2", "B0030GBU2I", "B001TOMQSK", "B00319DX4M", "B0050SX2MK", "B0050SXOD2", "B004EDJOYC", "B0050SXX88", "B000TG72TM", "B006ZTHFPS", "B007XVTR5S", "B004FUI84G", "B00BMFIXKQ", "B000X1TC0U", "B000FQBF1M", "B00B59L9T6", "B001D7T2VC", "B00198PO5I", "B003O6E6EI", "B00149ILDO", "B000ZK9QCS", "B00CWYYLH0", "B001AWBYNE", "B00G9DFMDW", "B003Q55YCU", "B003P9FRGA", "B002I0J8FI", "B004HCYVO8", "B000SQ5LQE", "B003O6ECOM", "B002NN7AKU", "B009GZX49Y", "B000WMEEBM", "B001ASJIS6", "B003JVCA9Q", "B004ML44Y6", "B003O6E1JS", "B004PAGJNS", "B0043QQNXK", "B003PHLT8W", "B0053BSOD6", "B005C2D1YI", "B007SRM5U6", "B00ESI5N3O", "B008PQU3E4", "B004FS8LYK", "B002I0K5NC", "B002I0JBL4", "B003O6CBIG", "B000V1OUVI"], "bought_together": ["B0050SXEM8", "B000RHZ9G6"], "buy_after_viewing": ["B0050SXEM8", "B000RHZ9G6", "B003O6CBIG", "B00EFFVZP0"]}, "salesRank": {"Video Games": 4553}, "categories": [["Video Games", "PlayStation 3", "Games"]]}