{"asin": "B003WJR67Q", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Panasonic's new Lumix DMC-TS10 digital camera is the latest addition to the TS-Series of rugged models, ideal for active users wanting a versatile camera for outdoor use. Featuring a flat, slim profile, and a folded optics design with a 4x optical zoom lens, the new 14.1-megapixel Lumix TS10 is waterproof to approximately 10 feet, shockproof to 5 feet, dustproof and freezeproof to 14&deg;F.  For even further protection, the Lumix TS10 comes with a silicone jacket to help prevent scratches.Panasonic Lumix DMC-TS10 HighlightsIntelligent Auto (iA) modePanasonic's popular Intelligent Auto (iA) mode makes it easy for anyone to take beautiful photos by offering a full suite of shooting-assist functions.  The Lumix TS10 makes it extremely easy for consumers to engage this setting, with a dedicated iA button on the top of the camera. The MEGA O.I.S. helps reduce blur due to hand-shake and the Intelligent ISO control prevents a moving subject from being blurred by optimizing the shutter speed and ISO sensitivity setting, to produce sharp, clear images. Human faces are captured in focus and with correct exposure using the Face Detection mode and unwanted red-eyes are digitally corrected and backlight compensation automatically adjusted.Intelligent Scene SelectorIntelligent Scene Selector automatically selects one of six Scene Modes--Macro, Portrait, Scenery, Night Portrait, Night Scenery and Sunset--that best suits the shooting situation. The Quick AF system allows the camera to keep focus on the subject while the camera is in recording mode even before pressing a shutter button halfway.High Definition video in 720p Motion JPGThe Lumix TS10 can also shoot High Definition video in 720p Motion JPG and the image-processing Venus Engine IV features advanced signal processing technology for rendering high-quality images and videos. The camera's quick response makes it easier to capture sudden, spur-of-the-moment photo opportunities.2.7-inch Intelligent LCDThe Panasonic Lumix TS10 features an easy-to-see, 2.7-inch 230,000-dot Intelligent LCD for comfortable viewing while both monitoring shots and playing back the results. The Intelligent LCD function detects the light condition and automatically boosts the LCD backlighting by 40% when shooting outdoors in bright sunshine, and adjusts the frame rate when shooting in low-lit situations. Detecting the lighting condition precisely and automatically controlling the brightness with a total of 11 fine steps, this function gives the display the most appropriate clarity in any situation without using extra energy. The High-Angle mode makes the LCD screen extremely easy to view when the camera is held high, such as when shooting over a crowd.", "title": "Panasonic Lumix DMC-TS10 14.1 MP Digital Camera with 4x Optical Image Stabilized Zoom and 2.7-Inch LCD (Silver)", "price": 209.0, "salesRank": {"Camera &amp; Photo": 5579}, "imUrl": "http://ecx.images-amazon.com/images/I/416OJHv-xIL._SY300_.jpg", "related": {"also_bought": ["B001V9KG0I", "B003VNKNEG", "B003CI3IDI", "B004KPLNKM", "B00425ZK40"], "bought_together": ["B003VNKNEG"], "buy_after_viewing": ["B00ATE7UFU", "B00ATE7UFU", "B00ATE7U64", "B00ATE7U64", "B003VNKNEQ", "B00728ZC1U"]}}