{"asin": "B00008OT2G", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]], "description": "Canon's EOS-10D 6.3-megapixel digital SLR builds on the strengths of the award-winning EOS-D60 and offers a range of improvements to both the camera's design and its feature set. It offers a seven-point wide-area autofocus system, fast 3-frames-per-second burst rate, and an ergonomic, super-tough magnesium alloy body shell.The 6.3-million effective pixel CMOS sensor--providing up to 3,072 x 2,048 pixels--is supported by Canon's unique high-power DIGital Imaging Core (DIGIC) processor. The speed at which the DIGIC processor works has allowed Canon to extend the number of full resolution images in burst sequences to nine, at a rate of 3 frames per second. As well as improved speed, DIGIC also helps produce more accurate color rendition while reducing image noise.The metering system, using the newest metering algorithm available and a 35-zone evaluative metering system linked to all seven focus points, offers improved exposure consistency and stability. A range covering ISO 100 to 1,600 offers high-quality images across a very broad spectrum of shooting conditions. Photographers working in particularly poor light may also take advantage of an option to extend this range to ISO 3,200.The EOS-10D is the first digital SLR camera to feature direct printing. Linking via a USB cable, you can make prints immediately from any of Canon's range of compatible bubble jet or CP  printers--including theS830D,S530D, andCP-100--without the need to connect to a computer. Controls within the camera's own menu system allow you to choose print quantity, size, and image cropping. When using Canon's card photo printer CP-100, with the optional battery pack, prints can be made in the field away from a power supply.Other features include:Automatic selection of FAT16 or FAT32 file systems, to support  large-capacity CompactFlash Type I or II memory cards of over 2 GB storage size (such as Microdrives).1.8-inch TFT (transreflective) LCD monitor with five brightness levels and 10x zoom.Super Intelligent Orientation Sensor detects whether the camera is being held in the portrait or landscape orientation when an image is captured, and automatically rotates the image in the camera's LCD preview screen and on a computer when downloading using Canon's ZoomBrowser software.Extended battery life providing approximately 650 images without flash or 500 images with 50 percent flash.Ability to save an image in RAW format even when it was shot in JPEG mode.The EOS-10D comes complete with battery pack, compact single  battery-charging unit, USB cable, video cable, the latest Canon software and Photoshop Elements. The EOS-10D accepts the same BP-511 battery pack, and the same BG-ED3 battery grip as the EOS-D60.", "title": "Canon EOS-10D 6.3MP Digital SLR Camera (Body Only)", "price": 13.99, "salesRank": {"Camera &amp; Photo": 2581}, "imUrl": "http://ecx.images-amazon.com/images/I/41tjb8QPCWL._SX300_.jpg", "related": {"also_bought": ["B000W05O5O", "B003CIBC36", "B001G9TYHE", "B0007VRPZ0", "B001FO4QHI", "B000T9251O", "B004MFQ2I8", "B00004ZCJH", "B0000665V6", "B00004THD0", "B00007E7JU", "B003Y60DZO", "B000WHKRU4", "B0030UL7IG", "B002YVRGPA", "B001NXDB4A", "B002K3Z3E8"], "buy_after_viewing": ["B000W05O5O", "B003CIBC36", "B00007E7JU", "B000BNY64C"]}}