{"asin": "B00140P9G0", "description": "Portalis an action/puzzle video game from Valve, creators ofHalf-Life 2andCounter-Strike. The winner of over 40 awards, including 15 Game of the Year honors, it is one of the most original games on any platform in years and offers gamers hours of unique gameplay. Set in the mysterious Aperture Science Laboratories,Portalis designed to change the way players approach, manipulate and surmise the possibilities in a given environment; similar to howHalf-Life 2&#x92;s Gravity Gun innovated new ways to leverage an object in any given situation. Players must solve physical puzzles and challenges by opening portals to maneuver objects, and themselves, through space.The new physics of funUse the portal gun to create your path.View larger.Every portal has two ends.View larger.Toss companion cubes through portals.View larger.The StoryPortal contains only two characters, the player-controlled Chell and GLaDOS (Genetic Lifeform and Disk Operating System), a computer AI that monitors, directs and misleads Chell in a kind of twisted experiment. It's not exactly a match made in heavenRegardless, Chell must rely on information provided by GLaDOS to survive as she navigates through a series of mostly doorless rooms using the Aperture Science Handheld Portal Device (\"portal gun\"). The portal gun creates two portal ends, one orange and the other blue. Both are simultaneously a potential entrance and exit and objects, alive or otherwise, that travel through one end will exit the other at the same speed. In addition, portals create a visual and physical connection between two different locations in 3D space. Their ends are restricted to planar surfaces, but if the portal ends are on nonparallel planes, bizarre twists in geometry and gravity can occur as the player character is immediately reoriented to be upright with respect to gravity after leaving a portal. Chell can pass through open portals at will, but barriers, known as \"Material Emancipation Grids\" or 'fizzlers' prevent players from carrying objects beyond them. Luckily certain objects, known as 'companion cubes' can be tossed through. Once through these can then be used as the player wishes. Passage through these fields also closes any open portals, so it's important to look before you leap. It's Chell's challenge and yours to survive the hazards of the portals, including bobby traps, hidden gun turrets and the treachery of GLaDOS in the search for eventual freedom.FeaturesAward-winning, innovative gameplay.The first first-person puzzle action adventure game.Two bonus games introduce new play challenges.Support for level editing and mod creation &#x96; build your own Portal puzzles.Hours of single player gaming.Makes you feel smart!System Requirements:Minimum Specifications:Recommended Specifications:OS:Windows Vista/XP/2000Processor:1.7 Ghz ProcessorPentium 4 Processor (3.0 Ghz or better)RAM:512 MB RAM1 GB RAMVideo Card:DirectX 8 level Graphics cardDirectX 9 level Graphics cardOther:DVD-ROM Drive/Mouse/Keyboard/Internet Connection&#xA0;", "price": 15.68, "imUrl": "http://ecx.images-amazon.com/images/I/41XUK21yAhL._SY300_.jpg", "related": {"also_bought": ["B002I0JIQW", "B007AKAQ66", "B0087RHFG0", "B002I0J9M0", "B00A2UP2JM", "B00DS7CM5I", "B0030BFW18", "B009DJB8I2", "B003O6E3C8", "B009YU2J8I", "B0061QQRP4", "B008JGPSJU", "B001440YD4", "B004HYIAPM", "B007G99BBM", "B006P5RW3M", "B000PS2XES", "B000MK694E", "B005UQ8J3O", "B000UU5T7E", "B00140S21O", "B001AH8YSW", "B005QBQBXS", "B0045ZB66I", "B005M0KSIM", "B002I0HKRQ", "B00CIYKMQ8", "B008CP6ORS", "B000ZKA0J6", "B00030GS80", "B0018OXKHC"], "buy_after_viewing": ["B002I0JIQW", "B002I0J9M0", "B003O6E3C8", "B000PS2XES"]}, "salesRank": {"Video Games": 7988}, "categories": [["Video Games", "PC", "Games"]]}