{"asin": "B0014XKQY2", "description": "Listen to rich, distortion-free sound from your iPhone without missing any calls with the Altec Lansing T612 Digital Speaker for iPod and iPhone. Designed to complement the iPhone and certified to meet all \"Works with iPhone\" and \"Works with iPhone 3G\" requirements, the T612 won't pick up any of the annoying hum that mobile phones often emit, meaning you can leave your iPhone on and not in airplane mode..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The Altec Lansing T612 Speaker:is specially shielded to complement the iPhone, letting you leave your iPhone on while playing music;provides full-range sound from deep bass to sterling highs;fills music throughout the room with 60 watts of power; andincludes a wireless remote.XdB bass-enhancement gives deep powerful bass without a subwoofer.View larger.Big, Full-Bodied SoundEmploying four specially engineered drivers (two 3-inch full-range drivers and two silk dome 1-inch tweeters), the T612 offers smooth, rich sound through the full audio spectrum. Even without a subwoofer, the bass is deep and powerful, thanks to the XdB bass-enhancement technology. The T612 provides a system response from 60 Hz to 20 kHz.The built-in amplification provides 60 watts of power RMS (120 watts peak), enough power to fill an entire room with dynamic music.No More Mobile InterferenceUnlike most speaker systems, the T612 is shielded from the noise emitted by mobile phones. The upshot is that you won't miss any phone calls because you don't need to put your iPhone in airplane mode just to listen to your music. When you do receive a call, the T612 will automatically pause the music to ensure that you hear your call.Elegant, Versatile DesignWith a minimalist and elegant silver-and-black design, the T612 will look great placed on a table in your living room or mounted on the wall. (A wall-mounting kit is available separately.) A built-in dock places your iPhone or dockable iPod at an easy-to-see angle in the center of the system while charging it. Also, an auxiliary stereo input lets you connect another MP3 or CD player to the system.A wireless remote is included, allowing you to control such functions as track forward/back, volume, and bass/treble levels from across the room.The Altec Lansing T612 is backed by a one-year warranty.What's in the BoxT612 speaker system, remote control with battery, 3.5-mm stereo cable, power supply, docking adapter for iPhone, user's manual, and quick connect guide.The T612 lets you leave your phone on while listening to music so you won't miss any calls.", "title": "Altec Lansing T612 Digital Speaker for iPod and iPhone (Black)", "price": 69.0, "imUrl": "http://ecx.images-amazon.com/images/I/41LX7PISrWL._SX300_.jpg", "related": {"also_viewed": ["B002I636XM", "B0038W0N8G", "B008BLDI4U", "B003VANOI6", "B005IVL0UA", "B004TS2AP2", "B002I636YG", "B009EHTXGM", "B002O3W3Y2", "B000R6QAHY", "B009CWRVH2", "B0016BQS12", "B003ZQYVVK", "B007JCNOHI", "B004TS2AOS", "B005IVL0U0", "B002I3OZ7G", "B005IVL0SM", "B00BQ4HRG4", "B0017XMN7C", "B005NGOPSY", "B001FWXDZQ", "B00ALWIV12", "B001G5Z82I", "B000V2FJAS", "B001S0JZKW", "B00169KFP4", "B0006VX1G8", "B007KFEP04", "B003SX0NGC", "B004NBZAI4", "B000F49RAA", "B00B7D4CRQ", "B003SX0NG2", "B003SNITOA", "B004TS2AO8", "B00FSB6B22", "B0041Q38R6", "B004NEUL2Q", "B001DLTDQC", "B003BIFJOA", "B007KAHUWY", "B00C5DHGEI", "B00A82NHG4", "B00B7D4CS0", "B0035FJVHA", "B005GUAIJM", "B002M78L6E"], "buy_after_viewing": ["B002I636XM", "B0038W0N8G", "B008BLDI4U", "B003VANOI6"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}