{"asin": "B000EMU4HS", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The PowerShot A540 combines ease of use with creative flexibility. The PowerShot A540 delivers 6.0-megapixel resolution and a high-performance 4x optical zoom lens. It also features an extensive range of creative shooting modes and is compatible with optional converter lenses for extended versatility.The PowerShot A540 packs a vast array of additional high-end features into a remarkably compact space, including:Canon's DIGIC II image processor and iSAPS technology for fast, superb resultsAccurate focusing with 9-point AiAF1ISO 800 shootingWidescreen (16:9) stills recording30-frame-per-second VGA movie recording2.5-inch LCD with Night Display and Grid Line DisplayThe versatile PowerShot A540 is the replacement to last year's popular PowerShot A520.OpticsA 4x optical zoom lens (35mm equivalent: 35 to 140mm) delivers crisp, bright results that make the very most of the camera's 6.0-megapixel resolution.The camera also has optional wide (0.7x) and telephoto (1.75x) converter lenses to extend the focal length range, for an effective 10x optical zoom. It is also compatible with optional close-up lenses for detailed macro photography. (Wide, telephoto, and close-up lenses are optional accessories and are not included; they must be purchased separately.)Designed for creativityWith 20 shooting modes, the camera is superbly equipped for artistic photography. Creative Zone modes on each camera include full Manual mode, Aperture Priority, and Shutter Speed Priority. Special Scene modes--such as Night Snapshot and Snow--assist with tricky lighting conditions, while Color Accent and Color Swap modes enable dramatic color effects to be applied to both images and movies direct from the camera. Users can record smooth 30-frame-per-second VGA quality movies of up to 1 GB with sound or create 60-frame-per-second QVGA clips for sharp slow-motion playback. A handy Compact mode enables shooting of small format clips of up to 3 minutes for easy sharing via email. My Colors can also be applied to movies before shooting.The PowerShot A540 features a new Widescreen mode (2816 x 1584 recording pixels) for capturing still images in 16:9 format--perfect for viewing on widescreen television or printing wide photos with a Selphy Compact Photo Printer.Low-light shootingThe addition of ISO 800 gives photographers the flexibility to shoot without flash indoors and in other low-light environments. It also enables shooting at faster shutter speeds, increasing image stability at full zoom and reducing unwanted motion blur. The advanced DIGIC II processor also minimizes noise at higher ISO levels.Instant photo printsThe PowerShot A540 is PictBridge compliant for instant direct printing to compatible printers, including all Canon Selphy CP Compact Photo Printers and most Canon PIXMA printers. You can also print ID photos and stills images from movies when connected to a Selphy CP Compact Photo Printer.The handy Print/Share button on each camera allows one-touch printing and hassle-free uploads to Windows or Macintosh systems. A new Print menu makes it easier than ever to organize print jobs direct from the camera.The menu system on this camera also features support for 23 languages, including Arabic.What's in the BoxPowerShot A540 body, AA-size alkaline battery x 2, MultiMediaCard MMC-16M, wrist strap WS-800, Digital Camera Solution CD-ROM, USB interface cable IFC-400PCU, AV cable AVC-DC300", "title": "Canon PowerShot A540 6MP Digital Camera with 4x Optical Zoom", "price": 9.99, "salesRank": {"Camera &amp; Photo": 5284}, "imUrl": "http://ecx.images-amazon.com/images/I/41VJQ8H78CL._SX300_.jpg", "related": {"also_viewed": ["B000EMU888", "B000NK3H4S", "B0032JRRXE", "B000NK3NBA", "B0011ZCDKS", "B000MFA1NE", "B0007MVHZS", "B004HW73QG", "B0075SUIEI", "B004HW73QQ", "B000AYJDD6", "B0009GZSSO", "B0075T7NW2", "B004HW73S4", "B000EMWBV0", "B000ENPDSW", "B000EMWBT2", "B003ZSHNG8", "B00AWYMXZY", "B002LITT3S", "B00I58LZRG", "B001SER47Y", "B0075SUK14", "B0075SUII4", "B002LITT3I", "B004HW73R0", "B0034XFG1S", "B00B5HE3UU", "B00EFILR6E", "B000EGLXTW", "B003KJM05Q", "B000NK6J6Q", "B000M4HLCE", "B0012YA4YK", "B000Q30420", "B001EQ4BZE", "B0007KQUP2", "B0011ZK6PC", "B0012YC7AE", "B002LITT56", "B001SER4BK", "B000Q3043Y", "B00EFILHB4", "B006UMM15O", "B000HATNH4", "B0072DKWQ0", "B0007TJ5OG", "B00908BQCY", "B0007UQNWW", "B0075SUHKI", "B0007QKMQY", "B000AYGDIO", "B0012YA6P2", "B00HLDFQU8", "B009B0MZ1M", "B0095F5AFQ", "B0091T97J6", "B00AWYN0BU"], "buy_after_viewing": ["B003VNKNEQ", "B00AWYMXZY", "B000EMU888", "B000NK3H4S"]}}