{"asin": "B000087H7T", "description": "Early Adopters Pick: March 2003. As the  world's smallest video-game platform, the Game Boy Advance SP is also the first to use a built-in rechargeable battery.Many decried the original Game Boy Advance's reflective LCD screen and its reliance on external light sources. The Game Boy Advance SP's main feature--optional backlighting--fixes this complaint nicely, but it's the wealth of other features that makes this system so surprisingly good.At first look, you might think the SP is a sleek travel alarm clock. When closed, it's just as tall and deep as the original GBA, but only half as wide. Due to its clamshell design, the screen is always protected from everyday scratches. A small button in the center of the console turns on the backlighting element for use in low-light situations, like in a moving car.The SP comes with a well-designed power adapter that recharges a built-in battery; its prongs fold in for easier storage. Our informal tests found that it takes about four hours to fully charge (you can even play it while it's plugged in and charging), and the battery lasts about 11 hours with the backlighting constantly on--your results may vary. Using the backlighting less often will conserve battery power.Withseparately sold  cables, you can connect the Game Boy Advance SP to other GBAs  for multiplayer gaming (above) or to theNintendo GameCube(below) to access secret levels, exchange data, or use other special  features that vary from game to game.The quality of the backlighting is very good. It's bright and clear when looking directly at it, but degraded from other angles. This is only a problem for friends who are watching the screen from over your shoulder.But size, power, and affordability do not come without trade offs. There's no headphone jack here, though Nintendo promises an adapter. The system isn't very loud at its highest volume, and the sound can be turned down to socially acceptable levels. The L and R shoulder buttons are a fraction of the size they were on the GBA, and thus are harder to hit. Also, the reduced size of the SP is slightly less comfortable for adult hands than the GBA, but perhaps more comfortable for smaller hands. The cartridge port placement on the lower part of the console is fine for GBA games, since they are flush with the console body, but older Game Boy Color carts will stick out in a way that takes some getting used to.Open it up and the hinge will seek out a preferred, pre-set angle (about 150 degrees), though you can open it a bit wider or narrower for your own comfort. The hinge stands up well to lateral pressure, and over all, the SP seems just as rugged as its predecessor--which has proven to be very rugged, indeed.--Porter B. HallUnit SpecificationsCPU:32-Bit ARM with embedded memoryMemory:32 KB with 96 KB VRAM (in CPU), 256 KB WRAM (external of CPU)Screen:2.9-inch reflective TFT color LCDDisplay Size:1.6 by 2.4 inches (40.8 by 61.2 mm)Resolution:240 x 160 pixels in a wide-screen aspect ratioColors:511 simultaneous colors from a palette of 32,768Software:Fully compatible with Game Boy and Game Boy Color game paksLight Source:Front light integrated with LCDSize (closed):3.3 by 3.23 by .96 inchWeight:Approximately 5 ouncesPower Supply:Rechargeable lithium-ion batteryBattery Life:10 hours continuous play with light on; 18 hours with light off; 3 hours recharging", "price": 1.69, "imUrl": "http://ecx.images-amazon.com/images/I/41X3B28XR7L._SX300_.jpg", "related": {"also_bought": ["B000VBB69M", "B00AYBVB44", "B00DTCYCAU", "B00009WAUO", "B0006SSR24", "B000047GEI", "B0006GBCZU", "B002CJ8Z04", "B00000IYEQ", "B000084314", "B00000IYER", "B0006GBD04", "B00DTCWNL0", "B00005UK88", "B00006FWTW", "B00DODCWMY", "B00D3IKP7Y", "B00005LBHM", "B008216WOW", "B0002TB4CW", "B00005MDZY", "B00005B8FZ", "B00004TCT3", "B004I8IAR0", "B0002GTXDM", "B00004TEYR", "B00005J53A", "B00028S9P8", "B00G2F1HB8", "B00AYQRGFW", "B0000A9Y11", "B00006LELB", "B00012BSJ4", "B000QJ1NS8", "B000070IW6", "B00030GS80", "B0000E5U6M", "B000087PM3", "B00005BZE0", "B00006M3R6", "B0000A09EP", "B002JEUDX4", "B00008URUF", "B00008DHNU", "B000EGAW1W", "B000B5MV6A", "B00002SVEO", "B000Y8EUVI", "B000EGDEJY", "B00G2F1N80", "B0000A03CT", "B00002ST27", "B00008WMG9", "B0019R361I", "B000238EJ4", "B0002V8O8M", "B00005OARM", "B000066TS7", "B00000J9J9", "B00005V9NJ", "B00005NCCA", "B0000631WO", "B00C2VGUG8", "B000MZ8QWM", "B0002HDSZK", "B003DSASTE", "B000035XB0", "B0001ZZNNI", "B003QU3EP4", "B000F8GWH2", "B000BI3SIC", "B00002ST3U", "B000B5MV60", "B00005MI42", "B0000859TK", "B00008J2UZ", "B00009WAUK", "B000FO4KO8", "B009I6SH16", "B00002ST28", "B0001615P2", "B00000IWYT", "B00068O278", "B000A3I9YQ", "B001290A3U", "B0002X4T4S", "B000GQ1G2E", "B00027NWRY", "B00005MDZZ", "B0000A09EO", "B00009WAUH", "B004I4MIOU", "B00FPWTTOQ", "B00GQCZF88", "B000MJB0H6", "B00030GS8A"], "buy_after_viewing": ["B000VBB69M", "B0002TB4CW", "B000087PM3", "B0000A9Y11"]}, "salesRank": {"Video Games": 1647}, "categories": [["Video Games", "More Systems", "Game Boy Advance", "Hardware", "Consoles"]]}