{"asin": "B0002WPSCG", "description": "Amazon.com Product DescriptionGet the most from your games and movies with the adrenaline-pumping surround sound of theLogitech X-530 5.1 Speaker System. Its subwoofer and satellites use the latest technological advances to ensure consistent audio at any volume.Plug the Logitech X-530 into your PC, music player, DVD player, or even your PlayStation&reg; or Xbox&reg; game console and immerse yourself in clean, crisp, consistent surround sound from your games, movies, and more.The high-tech subwoofer adjusts itself dynamically to deliver distortion-free bass. And the five wall-mountable satellite speakers use Logitech&acute;s patented FDD2 technology to eliminate the uneven sound response created by conventional dual-driver designs. The result: a clear, uniform sound field without the &quot;hot spots&quot; and inconsistency of other dual-driver satellites.Frequency Directed Dual Driver (FDD2) satellite technology produces a uniform sound field for full, rich soundMatching front &amp; rear satellites deliver balanced surround soundDedicated center channel makes dialogue clear and intelligible.Dynamic, real-time bass equalization maximizes bass response while minimizing distortionPorted subwoofer design displaces more air for deeper bassHeadphone jack enables private listeningMaster volume and subwoofer level controls placed for quick, convenient accessSatellite speaker stands rotate for easy wall mounting", "title": "Logitech X-530 5.1 Speaker System", "price": 306.99, "imUrl": "http://ecx.images-amazon.com/images/I/41TKYK95W9L._SX300_.jpg", "related": {"also_bought": ["B0006U3ACY", "B00004Z5CP", "B0056PVM5G", "B004PSEJHS", "B0002ZPJZY", "B00DSXG4YW", "B0044DEDCA", "B0045JHJSS", "B0017PG8KS", "B0057UNPVO", "B000V0G2C4", "B003VAK1FA", "B008I647AM", "B0016LFN2C", "B0002L5R78", "B000I1IG7U", "B000I23TTE"], "buy_after_viewing": ["B003VAK1FA", "B004M18O60", "B0006U3ACY", "B0027VT6V4"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]]}