{"asin": "B000E0I9K4", "related": {"also_viewed": ["B0017U8FTU", "B0017U6BZU", "B0017U8FVI", "B003X26LXW", "B003X26LYG", "B0017U6C0Y", "B003X26LYQ", "B008QN6V9W", "B007WPHY6E", "B000VEIRA0", "B00ATNL9AS", "B007WPHY64", "B00G3N1MRS", "B002KPTVLW", "B007N72U4M", "B00BIY0DFY", "B00ARJQRLU", "B0017U4U0S", "B0017U8FS6", "B006I0KL6Y", "B006ZP8UOW", "B006P88VSE", "B00F9FCW7K"], "buy_after_viewing": ["B0017U8FTU", "B0017U6BZU", "B0017U8FVI", "B003X26LXW"]}, "title": "Wilife DVS800I LukWerks Indoor Starter Kit", "price": 299.99, "salesRank": {"Electronics": 188574}, "imUrl": "http://ecx.images-amazon.com/images/I/51Un3AVdZcL._SX300_.jpg", "brand": "WiLife", "categories": [["Electronics", "Camera & Photo", "Video Surveillance", "Surveillance Cameras"]], "description": "Secure your home and small business with a professional-grade digital video surveillance system in an easy-to-setup and easy-to-use package. The LukWerks Indoor Camera Starter Kit includes all the components for a full-featured, single camera system with three mounting options. Each starter kit includes a smart LukWerks Camera, the powerful Werks Software, and Remote Viewing Technology. Built using Universal Plug and Play (UPnP), LukWerks automatically connects your cameras and PC. See the Video Tour for more details. Each Indoor Starter Kit includes all the components needed to get started:Intelligent Indoor CameraHigh-resolution color videoDigital motion detectionEasier than wireless -- just plug it inEasy to Use Werks PC SoftwareMonitor up to six cameras simultaneouslyMotion-based recordingPowerful search and playback toolsEmail and cell phone alertsFree Remote ViewingView live video from anywhere, anytimeInternet browser accessibleWindows Mobile cell phone accessibleWhat's in the BoxLukWerks Installation CD, Luk Indoor Camera, Luk Receiver, Luk Power Supply, USB Cable, Camera Ethernet Cable, Suction Cup Mount, Desktop Stand, Wall Mount Bracket Set, Window Decals, Cable Clip Accessories.Note: Monitor shown is not included."}