{"asin": "B000P6M6HY", "description": "The Shure SE530PTH Sound Isolating Earphones with Push-To-Hear Control marks the bridge from the classic E Series line, to the new line of Sound Isolating Earphones from Shure. Evolved from personal monitor technology road-tested by professional musicians, and fine-tuned by Shure engineers, the SE530PTH earphones deliver an unparalleled acoustic accuracy rivaled only by live performances.The Shure SE530PTH utilize three balanced armature drivers, one dedicated tweeter, and dual woofers, to bring you a listening experience that has been optimized for high-quality recordings and lossless formats. And with integrated passive crossovers that ensure high and low frequencies remain distinct and defined, you get an incredibly wide and detailed sound stage, distinguished by precision highs and robust bass. What's more, the SE530PTH includes sound isolating sleeves that block over 90-percent of ambient noise and provide a customized fit. Combined with a low-profile ergonomic design and modular cable options, this helps ensure interruptions from the outside world are minimized so you can focus on your musical passion. Not only are these earphones comfortable and audibly engaging, but the innovative triple driver configuration is a first in class for universal fit, sound isolating earphones.For occasions when you must tear yourself away from the music, the SE530PTH includes an innovative Push-To-Hear control. A first for sound isolating earphones, the detachable Push-To-Hear control allows you to activate the VoicePort microphone and adjust levels of external sound for clarity. Similar to the microphones used in Shure QuietSpot cellular headsets, the VoicePort microphone is tuned to pick up the human voice, ensuring maximum intelligibility. Ideal for brief conversations without removing your earphones, the Push-to-Hear switch allows you to quickly and conveniently alternate between your music and your connection to the outside world.Shure's SE530PTH comes with a premium fit kit that includes everything you need to get the most out of your new earphones. Because every ear is different, this kit includes three sizes: small, medium and large of both the flex and the black foam sleeves, as well as a pair of universal-fit triple-flange sleeves. These allow you to experiment with the size and style that creates the best fit for your ears, in order to provide a good seal for optimized sound isolation and bass response, as well as maximum comfort during extended wear. These earphones also come with a detachable cable solution that has been designed based on extensive user feedback to enable unmatched personal customization. The two included modular cables provided give you the option between a three-foot and a nine-foot option, so you can tailor your experience depending on your activity and application.The SE530PTH earphones feature a sensitivity of 119 dB SPL/mW, an impedance of 36 ohms, and a frequency range of 18 Hz to 19 kHz. These earphones include a 0.25-inch adapter that allows you to use them with home stereos and other devices with 0.25-inch jacks instead of 3.5-millimeter jacks. The SE530PTH package also includes a carrying case as a convenient, tangle-free storage solution, and a level attenuator that allows for comfortable listening from any high-output audio source. What's more, they even include an airline adapter that optimizes compatibility with European airplane armrests for overseas travel. The Shure SE530PTH earphones come with a cable length of 18 inches, and a manufacturer's limited two-year warranty.What's in the BoxShure SE530PTH earphones with Push-to-Hear control, sound-isolating sleeves, 1 x 3-foot modular cable, 1 x 9-foot modular cable, 0.25-inch adapter, carrying case, level attenuator, airline adapter, user's guide and warranty information.", "title": "Shure SE530PTH Sound Isolating Earphones with Push-To-Hear Control (Discontinued by Manufacturer)", "price": 549.0, "imUrl": "http://ecx.images-amazon.com/images/I/41HNtDPLX9L._SX300_.jpg", "related": {"also_viewed": ["B00426DND4", "B003NSBKT6", "B000O8ENQK", "B00EANUQ4S", "B003NSBKSW", "B003NSBKSM", "B00DIUGW6A", "B00373PE9Y", "B005Y7TTRE", "B002LWOKJ2", "B001MBLBXQ", "B004M4RTUY", "B000JFJDAE", "B004CXBJ6A", "B000NDHIHW", "B000NDR2PA", "B004PNZFZ8", "B009ZNFEEU", "B0019RBJOE", "B001DCBBHK", "B00A34TU7W", "B00JRPVO90", "B005LTWXK0", "B0043241X8", "B0050L5VO4", "B0094S35W4", "B00FKY3IFA", "B003R0FJKG", "B005GSVN48", "B000NDHIKY", "B003YOH8RW", "B000WAHFBK", "B0013JT3XC", "B0000CE1VP", "B00JB66VX4", "B00EWOK09G", "B000XPG2QI", "B000XP8DJC", "B003WV391Q", "B00GT36MGI", "B000VHUE0S", "B005W1DSU6", "B00GB2YASO", "B00A16BT4E", "B005N8W27I", "B00ELAM8NC", "B0052HYAT8", "B00591GIMY", "B009KNO1IU", "B002QL3CX8", "B0015PN3W6", "B00ELAM8LE", "B0065V7Y8E", "B00H8YOI04", "B00858I4FC", "B00E8QI4AK", "B00EA90QGA"], "buy_after_viewing": ["B004PNZFZ8", "B00426DND4", "B00EANUQ4S", "B003NSBKT6"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]]}