{"asin": "B000EPLP3C", "description": "Entertainment and sharing to go. That's the Zune 30 GB Digital Media Player. The Zune plays music and videos, displays images, and unlike the iPod, it even receives FM radio so you can stay on top of local news or sports. Designed around the principles of sharing, discovery, and community, Zune connects people and empowers them with the tools needed to share entertainment experiences. The Zune experience is centered around connection--connection to your library, friends, community, and other Zunes. It's powered by software that allows users to manage files on the player, rip audio CDs, and buy from a wide selection of music and videos at the Zune Marketplace.The Zune lets you share music and pictures with other Zune users in the area.The controls are designed to be familiar and easy to use so you can jump right in and start having fun.View larger.Zune software can find compatible music files on your PC and copy them to your Zune device.Wireless Zune-to-Zune sharing lets you share your favorite tracks and photos.Browse more than 100,000 artist bios and hundreds of playlists in the Zune Marketplace.The Zune is a 30 GB digital media player, but there's a twist. You can wirelessly share selected full-length sample tracks, playlists, pictures, or your own home-grown tunes directly from Zune to Zune (within 30 feet). You can listen to the full-length songs that you receive up to three times in three days, flag the ones you love, and easily buy them the next time you sync up--its like test-driving songs before you purchase an album.The Zune's navigation is simple and intuitive with a scroll wheel and basic buttons, and the big, bright screen makes it easy to browse music and show off your favorite pictures and videos. This attractive, smart device stores up to 7,500 songs, 25,000 pictures, or 100 hours of video. Get creative. Make playlists on the go and watch slide shows while you're listening. And if you're watching video on the Zune, you'll be pleased with the landscape mode that allows you to get the most out of the vivid display.Zune-to-Zune SharingDon't forget the primary principle of the Zune: sharing. With this device in hand you're holding an opportunity to share music and photos wirelessly from one Zune to another. Send your favorite tracks or images to your friends, or just about anyone with a Zune that's within your reach.Whether you're walking down the street, in a room with a bunch of friends, at a concert, at the airport, or on the bus, you can whip out your Zune and see all the other Zune devices that surround you. In the blink of an eye you're connected to your best friend and you can send over your band's newest song. Another friend might get the hilarious podcast your little brother made at school, plus that hot new song you just downloaded from the Zune Marketplace. And, of course, there's all the good stuff that your friends want to send back your way. The connections are made and the Zune community grows.Best of all, the song you sent (or received) isn't a short 30-second preview--it's the whole song. Your friend can sample the song up to three times in three days, flag it on their device and then buy it from the Zune Marketplace. You can send pictures, too. If you loved the photo of your dog at the park and you just have to share it with your buddies, shoot it off to whoever is around. And any pictures that are sent or received can be kept and viewed indefinitely.Sometimes you don't want to be noticed, and the Zune allows you to fly under the radar. All you need to do is turn the wireless function off, or adjust the privacy settings to control whether people can see you are online. And if you want to keep your Zune private while studying in the library or reading the newspaper on the bus, you can also block Zune devices in wireless range from sending you a song.Zune MarketplaceZune makes it easy to find music you love--whether it's songs in your existing library or new music from the Zune Marketplace. You can easily import your existing music, pictures, and videos in many popular formats from your PC and browse millions of songs at the Zune Marketplace where you can purchase individual tracks or buy a Zune Pass subscription to download as many songs as you want for a flat fee. Plus, you can apply Microsoft Points towards the purchase of music so you can buy online without a credit card for added security. At the Zune Marketplace you can read over 100,000 artist biographies and features from leading magazines including XLR8R, NME, and FADED, and you'll have easy access to Billboard Charts, including Billboard 200, Hot 100 Songs, and more. You'll even be able to browse what people in the Zune community are listening to by checking out the Zune Charts.Pre-Loaded ContentZune is a vehicle to explore new sounds and share entertainment experiences. With that in mind, the Zune comes pre-loaded with a variety of songs and videos from hot, new artists, as well as some fun films and images. With something for everyone, the pre-loaded Zune content may help you discover your new favorite band, but at the very least you'll have some entertainment at your fingertips so you can start connecting and sharing. Zune pre-loaded content includes loads of audio tracks, music videos, and film shorts, plus 12 classic rock posters from \"Art of Modern Rock: The Poster Explosion.\"Zune AccessoriesYou can choose from a full line of accessories to outfit your Zune. These three Zune Accessory Packs provide complete solutions for Zune in your car, in your home or while you travel. Individual accessories are also available.TheZune Car Packincludes everything needed to hit the road with a Zune device, such as the built-in FM tuner with AutoSeek and the Zune Car Charger.TheZune Home A/V Packenhances your experience in the home through five products that integrate Zune with the TV and music speakers: Zune AV Output Cable, Zune Dock, Zune Sync Cable, Zune AC Adapter and the Zune Wireless Remote for Zune Dock.TheZune Travel Packis a set of five products designed to keep friends and family entertained on the road: Zune Premium Earphones, Zune Dual Connect Remote, Zune Gear Bag, Zune Sync Cable and the Zune AC Adapter.What's in the BoxZune 30 GB Digital Media Player, earphones, USB cable, and sleeve.", "title": "Zune 30 GB Digital Media Player (Black)", "price": 7.99, "imUrl": "http://ecx.images-amazon.com/images/I/41OxZsQst1L._SY300_.jpg", "related": {"also_bought": ["B000IXNEI4", "B000MUBEDU", "B000VWN1LM", "B000JEUO7Q", "B000VWOKQM", "B000OXOITW", "B000VWPULQ", "B001XYBWXQ", "B000IXP932", "B000VWOKRG", "B000QJOZIS", "B000IXP96Y", "B000M9H8O0", "B000WFIR4Y", "B002SNCSKC", "B00CDJSM38", "B000VEOP42", "B000XPG2YU", "B000IXQPJO", "B000IXQPNK", "B000IXLHOM", "B000MN3DRW", "B002X3E378", "B001TJIZTY", "B000VWKSFE", "B000OP8BVG", "B001VBALOW", "B0012ROSZ8", "B002JPITZ2", "B002JPITXY", "B000JEUO4E", "B00166QHKE", "B000XYJN4C", "B000IXP946", "B000VWKSHM", "B00IKMHR3S", "B001EWDFCI", "B000WG6XW6", "B0017HEZDS", "B000MUF5Y4", "B002WB433U", "B002SKVYZA", "B00ADF0WDW", "B002JPITY8", "B00ECQUY2M", "B000LQZNZ0", "B00005MA97"], "buy_after_viewing": ["B000VWPULQ", "B000VWOKQM", "B00ECQUY2M", "B002JPITY8"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}