{"asin": "B00CRZXS82", "categories": [["Toys & Games", "Electronics for Kids", "Cameras & Camcorders"]], "description": "Create, learn and stretch your imagination with photos! Designed for little ones with simplicity in mind, the LeapFrog Creativity Camera Protective Case & App combine the camera power of your iPhone or iPod touch with creativity-focused fun! Your budding photographer can  use 6 different modes to edit photos to make silly pictures, go on photo missions to create special albums and even play an exciting augmented reality game. This breakthrough app toy turns your device into the ultimate creativity camera. Works with iPhone 4/4s/5 and iPod touch 4th & 5th generation (sold separately). Does not work with LeapPad or Leapster Explorer systems.  Appropriate for children ages 3 to 6 years.Learning fun is just a snap away with the camera case that unlocks 6 creativity modes!Take picture-perfect shots and edit those photos to create works of art, or dress them up with silly designs!Learning SkillsExploring your creative point of view is experiential and fun with the LeapFrog Creativity Camera Protective Case & App. Your little shutterbug can easily access six learning modes: 1) Camera&#x2014;for pixel-perfect pictures of friends, family and more, 2) Gallery&#x2014;to view photos as an album or scroll through individual frames, 3) Edit&#x2014;to use filter, stamp and morph functions to create one-of-a-kind photos, 4) Silly Faces&#x2014;to take portraits and dress up images with funny graphics, 5) Photobooks&#x2014;to create themed albums to explore letters and facial expressions, and 6) PeekABug Catch&#x2014;to catch and match virtual flying critters in a fast-action game.  The innovative Protective Case turns your iPhone or iPod touch into the ultimate  kid fun camera. When your Apple device is inserted into the case, your personal apps and data become inaccessible&#x2014;your child can enjoy hours of on-the-go expression using an App menu that&#x2019;s simple and easy to navigate. To get started, simply download the Creativity Camera App, place your device into the Protective Case and start exploring! The LeapFrog Creativity Camera is designed to teach important preschool and early elementary skills in a role-play environment.LeapFrog DifferenceLeapFrog has created a learning/play environment that is developmentally appropriate for children ages 3 to 6 years. The Creativity Camera takes your iPhone or iPod touch and incorporates a number of creative and curriculum-based activities with game play that reinforces the aspirational experience of being your own photographer.  \"Children grow up in a very visual world. Having children explore through visual arts like photography at an early age helps promote self-expression, stimulate creativity, and build vocabulary.\" -Clement C., LeapFrog Learning ExpertInnovative Learning ApproachThe Creativity Camera teaches Art and Creativity through the experiential and exciting medium of photography; Self-Expression by engaging with six learning modes that go beyond picture taking to picture enhancing and photo archiving; and Matching in a fast-action game of snapping, catching and matching virtual objects.What's In The Box?The LeapFrog Creativity Camera includes a Creativity Learning App and protective  case for iPhone 4/4s/5 or iPod touch 4th & 5th generation (sold separately). Parent Guide & Instruction Book included.Check out other LeapFrog App Toys like the Mr. Pencil stylus and writing app for your iPad, iPhone and iPod touch.  Children can learn how to write letters, numbers and shapes in a new, interactive way.", "title": "LeapFrog Creativity Camera App with Protective Case, Green", "price": 8.38, "salesRank": {"Toys & Games": 43753}, "imUrl": "http://ecx.images-amazon.com/images/I/410bn0aLxoL._SY300_.jpg", "related": {"also_bought": ["B00DGXTC2K", "B00CRZXSGE", "B00CG0CKXW", "B00804BEB2", "B00C6VPC22", "B0060JVU72", "B00CI6OCFI", "B00CMNX2I0", "B00BRCN99E", "B00BM2V52M", "B00CQHZ0ZU", "B00BQYR0KW", "B00C6SFC5W", "B00BM2V4YG", "B004MWN0G8", "B00C74HWU8", "B007RDFO0Y", "B00BSWRGOM", "B00BBSG96Y", "B00BNWI4WA", "B00AZZ07P8", "B00DCWM1N2", "B00AZZ07NU", "B00BQYQZOO", "B00C6SFC5C", "B00CE3JHCS", "B00DVK4HGE", "B00C58ZRPS", "B00DSIQS66", "B00B71D0AI", "B00BJ69YIS", "B00AZZ0CEO", "B00C3XK9UI", "B00BQYQZKS", "B00DVK4GTC", "B00AOHDBQ4", "B00CI6OCI0", "B00CQHYWJK", "B00BQYR0MA", "B00B1G4S1O", "B00CG5WODI", "B004UU9ZAW", "B00C2SJB6C", "B00BQYR0G6", "B00HG699OO", "B007RDFNEG", "B00DCWM2ZE", "B0093N52IK", "B00B2HGOEQ", "B0038AJYSS", "B008D8BO6K", "B00CI6OCC6", "B0072BKZOQ", "B007RDFNZU", "B00C3WXKR8", "B00BQYR11A", "B0044T2KBU", "B000BGT6CG", "B00920SDK8", "B00CG5WOAG", "B007J3FAJ2", "B00DJLQE3Y", "B00BSWRE2G", "B0096TTU5W", "B009AERWEE", "B00CI6J8L6", "B009PIJWUM", "B00FO0QDIY", "B00CMNX3TS", "B00AITWSZ8", "B00AZZ0F3M", "B00CMNX654", "B00CAGIUTU", "B00BUO0AEQ", "B00CX5XETO", "B00C58ZQFO", "B00AITWTG6", "B008DFT7RQ", "B00B9BFJH8", "B008AWFXD4", "B00ARQW1DQ", "B00CHFOZMA", "B005UX2KU0", "B00CQHYXMG", "B00CI6JB7C", "B00CM5D8PK", "B007XPLI4M", "B0074AFX5Q", "B00CQHZ208", "B004Z7H2EQ", "B006ILW9WC", "B003C1FO5U", "B00DPHEODO", "B00BQYR0P2", "B00C16Z6G4", "B00CKH9IIQ", "B00C6PY8D2", "B00ESDH5HQ", "B00BSWRFL6", "B00B5RK6BU"], "also_viewed": ["B00DGXTC2K", "B00GTCKOCM", "B00AOHDC4U", "B00CRZXSGE", "B007XVYRR6", "B00DW1TUY6", "B00DW1U3CY", "B0084BQ02E", "B00804BEB2", "B00CG0CL3G", "B00AITWTCK", "B00CRZXV52", "B00804BE8A", "B00DCWM2ZE", "B00CRZXX1Y", "B00H5HFEUM", "B00804BDCM", "B00DSE1ZJK", "B0006IRSXI", "B004MWN0G8", "B00D4K8XIO", "B00GTCKO90", "B002M78DR6", "B00CG0CKXW", "B005ZCY36K", "B00AWNUHB2", "B004MWN1AS", "B00CRZXWZG", "B0038AJYSS", "B00G49INKA", "B007U7LZQO", "B0084BPZJ8", "B00G15P0DK", "B000QF3VIW", "B007U7LZOG", "B00AOHDC5Y", "B004HJI53E", "B00D4K8XJ8", "B001W35I8I", "B007U7LZQ4", "B000E5LEH4", "B007U7M0L8", "B00D38UBJ6", "B0089RPUH4", "B00CRZXV16", "B002SRUVC0", "B00DCWM1N2", "B004WNIT3G", "B0089U3VPY", "B00BJKW8U0", "B00CRZXUZI", "B001W2WKS0", "B0089U3VDQ", "B00DCWM2Z4", "B00CRZXV3O", "B00CRXZWHO", "B00G4BL3G4", "B009PLLF9K", "B005F5HTMC", "B0024H9IYG"], "bought_together": ["B00CRZXSGE"]}}