{"asin": "B000MXYCU4", "description": "Toshiba's Regza line of TVs marry state-of-the-art technology to hip design. One feature that sets them apart is PixelPure 14-bit digital video processing, which creates more than 4,000 levels of color gradations for a smooth, natural-looking picture without posterization or image banding. Another benefit is a fast response time. Response time is the interval an LCD screen takes to from its darkest color to its lightest color and back again, measured in milliseconds (ms). This screen's response time is 8 ms, which is at the faster and better end of the spectrum. This screen is likely to display cleaner, sharper images during high-action scenes and with fewer image artifacts than other screens in its class. This technology is housed in a black gloss cabinetry that is sure to fit well with most any decor.The 32HL67 has a panel resolution of 1366 x 768 pixels. This qualifies it as 720 progressive-line HDTV, which is a noticeably better picture than standard definition sets, but not as detailed as the 1080 HD sets available. Its 16:9 wide screen aspect ratio delivers most movies the way they were meant to be seen in the theater, without back bars wasting the top and bottom of the screen.The Value of LCD TVsAside from their obvious aesthetic value, LCD TVs are much more practical in the home than CRT (tube-style) televisions. They take up a smaller footprint, and thus use up less floor space in the room. Also, LCD TVs are lighter and easier to move around when cleaning or redecorating. The 32HL67 is only 4.65 inches deep and weighs less than 35 pounds. Best of all, LCD screens use less power than CRTs and plasma screens.ConnectionsThe set has a built-in digital television tuner, so out of the box it can receive digital broadcast ATSC signals and QAM signals used by most digital cable providers. It also has a built-in 181-channel NTSC tuner, so it can also accept traditional analog signals. It can also make these connections to your audio and video components:HDMI inputs: 3ColorStream HD component video inputs: 2PC monitor input: 1 VGA 15 Pin D-subS-video input: 1A/V inputs: 2AudioThe unit's SoundStrip speaker system hides the unit's speakers in a thin strip bordering the screen. They're powerful enough to deliver big stereo sound, but they don't add significantly to the size of the set. Toshiba's StableSound feature maintains television volume within a preset range regardless of the source signal. This is an extremely useful feature when transitioning between a quiet television program and a very loud commercial advertisement or when changing channels. SRS WOW, a combination of SRS 3D, TruBass, and Focus sound-expanding systems, create a 3-D sound field with improved bass response over standard TV audio and create directed, three-dimensional audio sweet spot for maximum enjoyment. The TV also has optical digital output for connecting to your audio system.32-inch wide screenA general rule of thumb for selecting the right size television screen is that the screen width--not its 32-inch diagonal measurement--should be between three and five times the optimum viewing distance, such as the distance from the TV screen to where your eyes are while sitting on the couch. Less than that and you may be distracted by the scan lines of the picture. More than that, and you may lose the detail of your TV. Based on this guide, the 32HL67 is ideal for viewing distances of seven to 12 feet.What's in the Box32HL67, stand, 4-item universal remote, stand, warranty and product manuals.", "title": "Toshiba REGZA 32HL67U 32-Inch 720p LCD HDTV", "price": 247.99, "imUrl": "http://ecx.images-amazon.com/images/I/417Vm%2Bsut0L._SY300_.jpg", "related": {"also_viewed": ["B001P2R1RW", "B00BQO4VN6", "B0049P6OTI", "B005K2TXMO", "B00026BQJ6", "B00F0H88SY", "B006U1VH2S", "B000WYVBR0"], "buy_after_viewing": ["B0078LSTWU", "B00155V210", "B001DPRUMW", "B008BQGPOA"]}, "categories": [["Electronics", "Television & Video", "Televisions", "LCD TVs"]]}