{"asin": "B00005LB8P", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Canon's update to the PowerShot S100, the PowerShot S110, packs a high-quality digital camera into the tiny, elegant body of Canon's Digital Elph series. The idea behind the Elph line is simple: create a camera small enough to slip into a shirt pocket, so you can take it anywhere. To improve upon the impressive specs of the original, Canon upgraded the image processor, making it both faster and more effective in maximizing color fidelity and saturation. Additionally, the S110 has the ability to record QuickTime movies. A new, tiny microphone is embedded in the front of the camera.The basics include 2-megapixel resolution (1,600 x 1,200 image resolution) for high-quality photos and prints up to 8 by 10 inches; an all-glass aspherical 2x zoom lens (and a 2.5x digital zoom as well). A 1.5-inch LCD monitor displays most camera settings with easy-to-understand icons and minimal text. The built-in flash uses a light guide and does not need a Fresnel lens or a large reflector, making the camera even more compact.The PowerShot S110 stores images on an included 8 MB CompactFlash card. Adobe PhotoDeluxe and PhotoStitch control image management, editing, compositing, and printing, while ZoomBrowser EX or ImageBrowser produce self-running screen slide shows, automatic e-mail preparation, and auto layout. The camera uses a high-speed plug-and-play USB interface, plus it has NTSC-out so you can view your photos on your TV. It's fully compatible with both Mac and PC platforms.", "title": "Canon PowerShot S110 2MP Digital ELPH Camera Kit with 2x Optical Zoom", "price": 249.0, "salesRank": {"Camera &amp; Photo": 20515}, "imUrl": "http://ecx.images-amazon.com/images/I/416M17SSX4L._SX300_.jpg", "related": {"also_viewed": ["B009B0MYSQ", "B0000645C9", "B003KJM05Q", "B009B0MYLS", "B00CBYMWNQ", "B0012Y6AY8", "B005MTME3U", "B0054SLN3Q", "B003E47FUM", "B003VTZE1M", "B0032JRRXE", "B009VGRUDE", "B0007TJ5OG", "B006UMM1UO", "B00DRG0AF4", "B00AWYN0BU", "B003VTZE26", "B00BGYNYSY", "B006T7QVJM", "B009KDXHBC", "B008L24488", "B00AWYN182", "B000NK8EWI", "B0012Y84AG"], "buy_after_viewing": ["B009B0MYSQ", "B000069Z5U", "B005HNF01O", "B0000645C9"]}}