{"asin": "B001F50UDG", "description": "BlueAlert Movement Video RecorderCompact Digital Video RecorderThe BlueAlert is Swann&#x92;s smallest and most compact Movement Video Recorder. Records JPEG photo images or AVI video files when motion is detected. The BlueAlert is housed in a stylish metallic casing. With the BlueAlert's size being smaller than a DVD case you can store the DVR discreetly on a shelf or bookcase without it being noticed.Select between one wired and one wireless camera (use with any Swann security camera except IP cameras). Built-in PIP (Picture-In-Picture) feature allows you to see one wired and one wireless camera simultaneously on your monitor. The BlueAlert will record one camera at a time for optimum recording performance, the BlueAlert has four channels, and may be used with up to four cameras, although we recommend 3 for best results.A bonus (included) 128MB SD card can store over 2,000 images or 250 AVI videos (10 seconds each). The BlueAlert can take SD Cards ranging from 128 MB to 2 GB for maximum storage capacity. It also has installed a 16MB hard drive. The BlueAlert allows for easy back up to PC and you can view images caught by the BlueAlert on your existing television set.Protect your home or business by using Swann&#x92;s new BlueAlert for detecting and recording movement when you most need it. Don't waste time by watching hours of an empty room with no activity, the motion detection feature allows you to select the sensitivity of the motion detection for example, it may ignore family pets, or if you are looking to keep an eye on family pets then set the sensitivity higher to keep an eye on them too.The Swann BlueAlert is your perfect Personal Security Recorder.This Kit includes a bonus wireless camera and also a bonus 128MB SD Memory Card! Everything you need to get recording today!What's in the box::BlueAlert Movement Video RecorderBONUS 128MB SD CardBONUS Wireless Security CameraAntennaAV Cables x 2RCA to BNC AdapterManualEasy Setup Guide/li>Power SupplyBONUS Security Stickers x 4Tips for Setting Up Your Security SystemPlease find the below handy setup tips for your security systemFor best results do NOT point the camera towards a light source such as the sun or light.Also do not have the camera in a shaded area looking out into a well lit area as this will display poor results. Example: If the camera is hidden in a mailbox, because the mailbox is dark inside the camera sensor will try to adjust according to the available light. But if outside the mailbox there is good light like sunshine, you will get poor results. The light to the camera sensor in the front of the camera needs to be the same as the light at the focal target for best results.Power for Wired and Wireless Cameras, both types of cameras require a power source, although the camera maybe weatherproof the connections to the AV cable and power adapter are not. Please make sure that these connections are in a water or moisture free environment.Over time the lens or front case glass may become dirty, please use a lint free cloth to clean both. Similar cloth that would be used to clean a CD Disc.Power adapters: all power adapters are for indoor use only and must be shielded from outdoor elements. When using an outdoor camera, please use extension cords to power the camera and keep cables away from the outdoor elements.When installing the camera, before screwing in the mounting bracket, check the image on the screen to see if the picture is clear from direct sun or light.", "title": "Swann BlueAlert Movement Video Recorder Security Kit", "imUrl": "http://ecx.images-amazon.com/images/I/418tKLkgJ4L._SX300_.jpg", "related": {"also_viewed": ["B004I04LBC"]}, "categories": [["Electronics", "Security & Surveillance", "Surveillance Video Equipment", "Surveillance Video Recorders"]]}