{"asin": "B002I0F5I2", "description": "Follow-up game to 2007's critically acclaimedUncharted: Drake's Fortune, the PlayStation 3 exclusiveUncharted 2: Among Thievesis a continuation of the adventures of Nathan Drake, a fortune-hunter with a shady reputation and an even shadier past. Chock full of all the action, adventure, cinematic story elements and beautiful graphics that set the first game apart,Uncharted 2: Among Thievesadds deep online multiplayer options, including co-op and competitive campaigns, and a whole new supporting cast of characters, making it yet another must-have title for the PlayStation 3 platform..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Drake with his crew.View larger.Online multiplayer modes.View larger.Cinematic, over-the-top action.View larger.Varied exotic environments.View larger.No action-stopping load screens.View larger.New stealth gameplay.View larger.StoryInUncharted 2: Amongst Thievesfortune hunter Nathan Drake embarks on a journey that will push him to his physical, emotional and intellectual limits to discover the real truth behind the lost fleet of Marco Polo and the legendary Himalayan valley of Shambhala, more commonly known in the west as Shangri-La.In 1292 Marco Polo departed the court of Kublai Khan in China with 14 ships filled with over 600 passengers and crew. Eighteen months later only one ship remained and 18 passengers survived. Marco Polo never revealed what happened to these lost ships. Embarking on a quest to find the lost fleet, fortune hunter Nathan Drake soon realizes Marco Polo was hiding a much bigger secret - he had gone on a secret expedition to find the mythical kingdom of Shambhala and to recover the legendary Cintamani Stone, the \"Wish-fulfilling jewel\" of Buddhist mythology. With this new information Drake settles on a new course, following Marco Polo's trail through a diverse range of exotic environments. This quest also pits him against a new, more formidable adversary - a ruthless, rogue paramilitary leader with a private army and a relentless ambition to recover the stone for himself.GameplayAlthough gameplay inAmong Thievesis similar to that of the previous game, there are several major differences. The most important of these is the addition of several online multiplayer options. Unfortunately, no offline multiplayer could be included in the game due to the impact local split-screening has on the game's graphical quality. Thankfully though, the online modes included cover both co-op and competitive play. See the feature list below for details on these. In addition to play modes players can also expect a wealth of new gameplay features including a new stealth gameplay mechanic and altered climbing mechanic--both of which are extended to the AI of enemies; the ability to create cover by flipping over certain found items; the use of riot shields for defense and offense; and a complete lack of loading screens.Key Game FeaturesPowered by Naughty Dog&rsquo;s new 2.0 Engine Technology.Open layout allows players to take an aggressive or stealth approach to combat.Free-flowing \"traversal gunplay\" adds a unique vertical element to standard 3rd-person shooting mechanics.Award-winning cinematic story presentation.A Deep Single Player CampaignAn expanded cast of characters who reflect different facets of Drake&rsquo;s character, including Chloe Frazer, Drake&rsquo;s current partner and new romantic interest.Varied and exotic locations &ndash; from lush, green swamps and dense urban environments, all the way to the ice and snow of the Himalayas.Unrestricted combat allows you to take an aggressive or stealthy approach to combat.Free-flowing \"traversal gunplay\" adds a unique vertical element to familiar cover-based third-person shooting mechanics, allowing you to engage in combat from any position in the environment &ndash; even while climbing and hanging.Introduction of new traversal and free-climbing mechanics allow Drake to navigate through the environments more fluidly and naturally.Gunplay and combat enhancements, including an expanded melee system, and a variety of enemy types with advanced AI routines. High-quality cinematic presentation of scenes, characters and dialogue, all rendered within the Naughty Dog Engine 2.0.Dramatic in-game events that make you an active participant in the cinematic experience.Full character interaction with dynamic geometry.Utilizes Naughty Dog Engine 2.0 purpose-built for the PlayStation 3; utilizes the PS3 technology to hit a turning point in technology innovation by recreating reality and capturing human emotion.No visible loading &ndash; a Naughty Dog hallmark &ndash; returns along with technology improvements in major game systems such as lighting, shadows, ambient occlusion, animation technology and physics, among many others.A Wide Variety of Online Multiplayer Options.Competitive MultiplayerCompetitive multiplayer gameplay includes up to 10 players in heroes-versus-villains matches.Deathmatch: Up to 5 vs. 5 with customizable or pre-set game modes.Plunder: Unique style of multiplayer that encourages team work to transport a treasure across terrain horizontally and vertically over obstacles.Player boosters give you a variety of options to customize your characters to your play style or to provide an advantage over opponents.Co-op MultiplayerUp to three players work together in cooperative modes to accomplish set objectives with increasing difficulty and against special enemy characters.Combo system encourages further teamwork to increase a point total and currency multiplier.Weapon upgrades let you customize your weapons to your play style or provide an advantage over opponents.General Multiplayer Features.Robust party system allows you to remain with your friends in matchmaking and custom matches.Custom matches allow you to customize maps and modes which your party wishes to play.Currency gained in multiplayer matches can be combined with currency gained in single player missions to unlock additional content and upgrades.Character animations and environments taken from single player campaign maintain visual fidelity with no degradation.Gameplay and character mechanics identical from the single-player campaign, ensuring user familiarity and same level of quality.Headset support.Proprietary Naughty Dog Engine 2.0 network code captures a broad range of gameplay data for statistics reporting on the web and for functionality like Cinema, which allows players to watch replays of matches.Cutting edge technology such as cloud-based computing allows for scalable online infrastructure to provide optimal player experience.Game of the Year Edition Includes:3 Downloadable Content packs that include 19 skins, 4 maps, and one new game mode.3 boosters for use in online multiplayer modes including \"Currency Multiplier,\" \"Golden Guns,\" and early access to \"Revenge.\"4Uncharted: Eye of Indraanimated motion comics.2 multiplayer skins of characters featured in theEye of Indramotion comic series.4 PlayStation Network Avatar Packs including 18 premiumUnchartedavatars.Pinball Heroes--UnchartedPSP game.", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/61IJQ8MaHGL._SY300_.jpg", "related": {"also_bought": ["B000UW21A0", "B008CP6RUW", "B004EQCCI4", "B007CM0K86", "B000ZK9QCS", "B005YR308S", "B008CP6MA2", "B000ZK7ZOE", "B008CP6Q6M", "B002I0GX88", "B007SRM5U6", "B001SGZL2W", "B003O6E67A", "B005N4HBIW", "B0050SX7BQ", "B00269DX5W", "B000FQ2D5E", "B002I0J5FG", "B002I0K6DG", "B000FQBF1M", "B009JBFF9C", "B002NN7AKU", "B008CP6RWU", "B007TYC8MI", "B003C1I06U", "B001NX6GBK", "B00BMFIXKQ", "B008PQU3E4", "B003O6E6NE", "B000JLIXIG", "B0050SXX88", "B006JKAS16", "B009GZX49Y", "B0050SXFKE", "B000UC5ML0", "B0012N3T3Y", "B003O680RM", "B00309XHD0", "B00IA2NYT4", "B002I0J5YW", "B0022TNO7I", "B004FS8LYK", "B005T5OBWY", "B002I0H2G0", "B002CZ38KA", "B003O6EDSM", "B003O6E3C8", "B000X1TC0U", "B0050SXI6K", "B00C7103DO", "B002I0J5UQ", "B0012N94WO", "B001E8VB6O", "B00319DX4M", "B00DV16N6U", "B0050SXKU4", "B007A7UJ4S", "B0050SXLQC", "B0045U01OG", "B00CTKHXFO", "B002I0K5NC", "B0016C3260", "B0085CA8QG", "B000P46NMA", "B004P7VGF2", "B005185SDA", "B003R7H5TC", "B004NRN5EO", "B004HYK8Y8", "B005C2D1YI", "B002I0J45C", "B000K9OP2A", "B002ELCUUG", "B00CJ7IUI6", "B00EPIG606", "B002AB7TX8", "B00275A7LI", "B003GT8IL0", "B004FYJFNA", "B00320JAWY", "B0041OWQTO", "B00C3MKCF6", "B00BSECSP2", "B0050SXU3Q", "B0055L9BFO", "B0043M64GK", "B008SBZD5U", "B00269QLH4", "B001YHX4B0", "B00KVQ78B2", "B0015AARJI", "B002BRZ7JE", "B006JKARN0", "B009CYJ8SA", "B0065NP05G", "B000HKP88C", "B00198PO5I", "B003O6CBIG", "B003O6KWZK", "B009DZTXQU"], "bought_together": ["B000UW21A0", "B008CP6RUW"], "buy_after_viewing": ["B001JKTC9A", "B0055202HE", "B008CP6RUW", "B000UW21A0"]}, "salesRank": {"Video Games": 776}, "categories": [["Video Games", "PlayStation 3", "Games"]]}