{"asin": "B004FLL5AY", "related": {"also_bought": ["B004I4IZYW", "B0056AQW4M", "B004J1JPZC", "B003VNKNF0", "B003Z1817K", "B001S0PWWC", "B003VKTGV0", "B003I8I8LE", "B004KA5RTK", "B0045DPCNI", "B004I77BWG", "B003VNKNEQ", "B0037TA7TU", "B004GKLW3O", "B007Y4NWH8", "B004T1RW6Q", "B002FECHQ4", "B004SPQREQ", "B008GM0MW0", "B00F0XS1V2", "B005NRKAQE", "B004IW6F4Q", "B004HGZ6J8", "B002MSVYGW", "B004TF0QOM", "B003I8M19E", "B0052OYT4M", "B00BV9ZQKS", "B0058VDO9K", "B0030MITDK", "B004I4HHTG", "B004FLL5AO", "B007JRB0SS", "B005G81EAQ", "B002WE4HE2", "B008MR2HWC", "B003VNKNEG", "B002HZJ1T2", "B00272MT3A", "B007JRB0RE", "B003P3MCXW", "B007JRB0TC"], "bought_together": ["B003VNKNF0"], "buy_after_viewing": ["B003VNKNF0", "B00BF9HZT4", "B003VNKNEQ", "B0030MITDK"]}, "title": "Kodak PlaySport (Zx5) HD Waterproof Pocket Video Camera - Red  (2nd Generation)", "price": 283.99, "salesRank": {"Camera &amp; Photo": 1420}, "imUrl": "http://ecx.images-amazon.com/images/I/41S-GBldImL._SY300_.jpg", "brand": "Kodak", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "Takes an impact. Makes an impact&mdash;in full HD.Share your most extreme moments simply. The Kodak PlaySport Video Camera / Zx5 delivers full 1080p HD with a rugged design that's shockproof, dustproof, and waterproof up to 10 ft underwater.If you're going to live with no limits, you need a digital video camera that can deliver the goods in full 1080p HD. The Kodak PlaySport Video Camera / Zx5 is up for the challenge. We built it to take on the most extreme lifestyles with an insanely tough design&mdash;we're talking shockproof, dustproof, and waterproof to a depth of 10 ft. And built-in image stabilization smooths out even the roughest ride. Whether you're carving up the mountain or pulling stunts in the skate park, the PlaySport Video Camera / Zx5 is up for anything. And with a touch of the Share button, shocking your social network couldn't be simpler. Show the world why you're So Kodak. We dare you.Go anywhere, do anything, fearless designWaterproof*Take the plunge up to 10 ft under water for up to 2 hoursDon't get the blues&mdash;underwater white balance mode gives true-to-life colors in the pool or under the wavesDustproof**The muddiest, dustiest, sandiest conditions are no match for the PlaySport's rugged designShockproof***Bumps and bruises go with the territory&mdash;the PlaySport can even take a fall from 5 ft* IEC 60529 IPX8 compliant. ** IEC 60529 IP6X compliant. ***MIL-STD-810F, shock equivalent (onto plywood).Just press to impressThe world's only cameras with 3-step sharing!1Kodak's Share button makes sharing your videos and pictures as simple as 1, 2, 3.Step 1&mdash;Just press Share when in review modeStep 2&mdash;Choose your favorite sharing destination, e-mail address, or Kodak Pulse Display2Step 3&mdash;Connect your camera to your computer or insert your memory card and your videos or pictures are automatically uploaded to the destination(s)Only Kodak Cameras:Let you simultaneously share to multiple social networks, e-mail and Pulse Display1,2Automatically share when you connect to a PC1Tag to the largest number of social networks: Kodak Gallery, Facebook, Twitter, YouTube, FLICKR, ORKUT, YANDEX, and KAIXIN0011,3Show them what you're made of&mdash;in HDFull 1080p high definition captures your adventures in amazing detailEasily switch to still camera mode to catch 5 MP, 16:9 widescreen HD still picturesChoose the resolution that works for you:1080p&mdash;great for stunning playback on your HDTV&mdash;HDMI cable included!720p at 60 fps&mdash;for fast action and super slow motion playback720p at 30 fps&mdash;ideal for general recording in high definitionWVGA&mdash;perfect for conserving space on your memory card or smaller files sizes for web useSmooth, stable, and always ableGet sharper videos and less blur thanks to built-in digital image stabilizationCapture your friends in their best light with smart face tracking technology&mdash;the camera detects and locks onto faces, then ensures great exposure around themGet great close-up shots with macro mode (automatic detection or user selectable)See more details and accurate colors with incredible low-light performanceThere's always room for more&mdash;record up to 10 hours of HD video with expandable SD/SDHC card slot (up to 32 GB)4Don't let sun glare ruin your recordingThe bright 2.0 in. LCD automatically adjusts to the lighting conditions around youSee your screen even in ultra-bright sunlight&mdash;simply turn on the LCD Glare Shield featureSimple on-camera editingTrim your video to just the right moment and save it as a new videoMake a picture from a video frameCool capture effects give a new look to your scenesBlack and whiteSepiaHigh saturation&mdash;bright, bold colors'70s film&mdash;muted colors, slightly greenish cast, and a little graininess for a retro lookGreat video editing software comes on-board the PlaySport CameraDownload the software when you first connect it to your computer5to:Edit and trim videosAdd a voice-over to narrate your footageAdd pictures and music to your videos to make cool mashupsGrab and edit still images from video frames to get that perfect shotMake a colorful statementComes in a variety of colorsSoft rubberized feel for a secure gripRounded ergonomic designReady for the big screenHDMI port gives you the option to debut your videos in full glory on your HDTV6It doesn't matter if you own a MAC or a PC&mdash;the Kodak PlaySport is compatible with bothThe optional remote control makes it easy to comfortably enjoy your videos and picturesReady to go&mdash;right out of the boxKodak PlaySport Video Camera / Zx5Adapter and cable for battery chargingWrist strapUser GuideARCSOFT MEDIA IMPRESSION Software for Kodak and Kodak Share Button App (both on-camera, PC only)All models of digital still and video cameras manufactured in 2011 or later.Kodak Pulse Display and Kodak Gallery support still pictures; video not supported.Sharing sites vary by region.Record about 20 min per 1 GB at 720p HD at 30 fps. Actual results may vary.On-board software for PC only.HDMI cable is an optional accessory."}