{"asin": "B0009O7HVM", "description": "Star Wars Battlefront II takes the best-selling Star Wars&#174; video game of all time one Imperial-walker step forward with all-new space bat playable Jedi and never-before-seen environments straight out of the Star Wars: Episode III Revenge of the Sith movie. Fans of the original Star Wars Battlefront will also enjoy an all-new single-player experience that takes players through an epic story-based saga where every action the player takes impacts the battlefront and ultimately the fate of the Star Wars galaxy.Star Wars Battlefront II improves upon the original game s single-player experience with open-ended mission-based objectives inspired from all six Star Wars films. The pelling storyline spans more than 16 new locations many from the Episode III movie including volcanic Mustafar and the space battle above Coruscant. All-new classic movie moments plete the Star Wars Battlefront II experience as players battle within the interior of the Death Star and visit Princess Leia s blockade runner the Tantive IV as seen at the beginning of Episode IV A New Hope. In addition at certain key moments within the battles players can earn the opportunity to wield a lightsaber and use the Force as a Jedi.For the first time ever Star Wars Battlefront II players can engage in space bat and during the same battle board enemy ships to attack from within. Starting on foot inside a capital ship players can enter the starcraft of their choice and travel into space to dogfight with the rival faction. From there they can dock within the enemy s capital ship overtake the ship s mand posts man its turrets to disable its shields and destroy it from within! Or they can simply stay inside their own capital ship and defend it from attacks and enemy fire. The choice is theirs.The stellar online play that marked the original Battlefront returns even bigger and better for Star Wars Battlefront II. Players can locate their buddies and track their stats as they battle alongside more player", "price": 54.93, "imUrl": "http://ecx.images-amazon.com/images/I/51DJ5Y7GQQL._SY300_.jpg", "related": {"also_bought": ["B0001NE48U", "B00004YRQ9", "B0007SL1ZI", "B000067DPL", "B000TLU67W", "B00004YRQA", "9629971372", "B001MW91IW", "B0000C7GHG", "B0013KW1B2", "B000UH6GEM", "B0032GPYO6", "B00006JN5H", "B0013JHKU0", "B00020LZBG", "B000066TS5", "B0002XL3BA", "B000EHQDA0", "B00020BV2E", "B00020LZAM", "B000TYQL1O", "B00009VE6D", "B0009A4EVM", "B0009SQF0C", "B0002CNUN0", "B000069D39", "B0009PETYO", "B000099T1Y", "B000088KH1", "B0001VGFK2", "B0000B0MNH", "B0033T1UWW", "B002BWS5QG", "B000IZAQD8", "B0009I6S0O", "B00007KE6C", "B0009350BW", "B00005U8TQ", "B00005TNI6", "B00008NRM7", "B00097CYZS", "B0006I5FL0", "B000R3OR2W", "B004S3KB6S", "B00005R5PO", "B00005CF9L", "B000095ZH5", "B00067MX98", "B000FDDN2E", "B0002IQD1U", "B0002IQC8E", "B000GACEHQ", "B0001I9YHG", "B00020LZAW", "B000G6SPHI", "B001CLG6SG", "B0009I6S0Y", "B00006GSNZ", "B00005V9NK", "B00005NUJ3", "B000WE8JES", "B000099T2E", "B0009EHQVI", "B0032GTMEE", "B0007M2266", "B0006ZJPR8", "B002ABZDQI", "B000FW4YOQ", "B00000I1BR", "B000067DPK", "B00009WAVD", "B00006GSNX", "B0009351R0", "B0002IQCSY", "B0000CDZBC", "B00006F2ZT", "B000MAFXR8", "B0009O7HVW", "B0000696CZ", "B002J9QIWY", "B0000A0MDV", "B00009ZVHW", "B0002GTFIK", "B00009WAVB", "B00004U8QX", "B0010YOQJ6", "B0000A8VBZ", "B0007OSLAA", "B000G7YX14", "B00006C28Z", "B00026RFI2", "B000088KH5", "B00095LEC4", "B0009Z3HYW", "B00006FWUU", "B0002RQ3ES", "B004E0I8II", "B0006JMLMK"], "bought_together": ["B000TLU67W"], "buy_after_viewing": ["B0001NE48U", "B00004YRQA", "B0007SL1ZI", "B001MW91IW"]}, "salesRank": {"Video Games": 647}, "categories": [["Video Games", "More Systems", "PlayStation 2", "Games"]]}