{"asin": "B0043T7FHK", "related": {"also_bought": ["B004EFUOY4", "B003L1ZYYM", "B003VANO7C", "B0033Z2BAQ", "B00H09BOXQ", "B00413PHDM", "B00E3W1726", "B0058UUR6E", "B0088PUEPK", "B003VAGXZC", "B009S750LA", "B00H3YT886", "B007RG2QNY", "B009SPWJ98", "B005UE3C24", "B005T3GRNW", "B003NREDC8", "B00BP5KOPA", "B00FJRS6FU", "B004C9P9TM", "B00E3W15P0", "B005BZNDS0", "B00E3W19MO", "B006TVQTHW", "B00KPRWAX8", "B005LDLVAO", "B006ZGWJU2", "B007I59CN6", "B005O65JXI", "B00CO8TBOW", "B003VAHYNC", "B006YG9EEW", "B006WAGGUK", "B00BQ8RFAI", "B0043T34RK", "B006EWUO22", "B008968L6M", "B00CO8T9VC", "B000KZW9WM", "B003ELVLKU", "B00H3SWJ24", "B00F3ZN0CC", "B005LDLV6S", "B00F3ZN2W0", "B00H09BB16", "B0045JFTXU", "B0036FQ23A", "B0000BVYT3", "B0055ZJ2JK", "B004JO3L0Y", "B0019804U8", "B000A6PPOK", "B005HPSFWI", "B00ECDM78E", "B00870ZHCQ", "B002JCSCYS", "B0052SCU8U", "B005H3I38Q", "B00A1ZTZOG", "B0099XBO5E", "B0037TO4IK", "B00ALK3KEM", "B00EDSI7QO", "B003Y24DEU", "B00CQ35HBQ", "B004J6BIJ8", "B005T3GRN2", "B00DRK716G", "B00DMCVKMU", "B00CO8TBQ0", "B006YG8X9Y", "B008XQEQT4", "B007BPKHJ6", "B004AIJE9G", "B00ALK3HF4", "B0013TZRUA", "B000UD4LIY", "B00BQ8RHJ2", "B00K2MAU5Q", "B004F3DJYC", "B00EUTW24E", "B005SHQ644", "B003NR57BY", "B00ALYORA4", "B002HWRZ2K", "B00B3X72OU", "B00K2R6EGA", "B001TH7T2U", "B0068ZWZY0", "B003L62T7W", "B009GXZ8MM", "B0057Q4ADU", "B00EB7UITQ", "B002RCNX8K", "B00I52A13Q", "B006TVQTFE", "B00AI8LI1O", "B009TOXRK8", "B00ED34G8C", "B00D12OAOG"], "bought_together": ["B003L1ZYYM"], "buy_after_viewing": ["B0058UUR6E", "B005BZNDS0", "B00B2HH7G0", "B003L1ZYYM"]}, "title": "ASUS VE248H 24-Inch Full-HD LED Monitor with Integrated Speakers", "price": 188.98, "salesRank": {"Computers & Accessories": 201}, "imUrl": "http://ecx.images-amazon.com/images/I/412-mDHUMvL._SX300_.jpg", "brand": "Asus", "categories": [["Electronics", "Computers & Accessories", "Monitors"]], "description": "ASIN# B0043T7FHKBeautiful High Definition VisualsFrom gaming to movie watching to Web surfing, enjoy sharper, brighter, and all-around better visuals from the 24-inch LED-backlit ASUS VE248H Full HD display at home or in the office. With ASUS Smart Contrast Ratio (10,000,000:1), experience bright whites and dark blacks that bring photos and scenery to life. 2ms Trace-Free Technology ensures smooth motion playback by delivering precise visual detail during fast-moving scenes. The VE248H is built with user-friendly features such as AI Light which automatically detects surrounding light and adjusts screen brightness to help your eyes comfortably adapt to the display's lighting. Splendid Video Intelligence Technology lets you optimize screen color and contrast to your preference by instantly selecting from one of the six preset scenarios. Boasting a host of ports including HDMI and DisplayPort, the VE248H connects to various PCs, gaming consoles, and other devices. The VE248H has an understated yet sophisticated VESA-mountable design with built-in speakers and clean cable management to ideally fit any home or office setting.Key Features24-inch LED-backlit full HD displayfor crisp high-definition image quality (Learn more)ASUS Smart Contrast Ratio technology with 10,000,000:1 contrast ratiodynamically adjusts between black and white for sharper and brighter visuals (Learn more)2ms Trace Free Technologydelivers incredible detail for smooth motion playback during fast-moving scenes (Learn more)AI Lightautomatically detects the lighting environment and adjusts display brightness to prevent your eyes from having a blinding sensationSplendid Video Intelligence Technologylets you optimize color and contrast to your liking from the six preset color modes and three skin tone modes via the Splendid hot key  (Learn more)Clean cable management designfor a clutter-free appearance in any setting (Learn more)Built-in stereo speakersfor rich audio quality (Learn more)Aspect Controllets you control aspect ratio and adjust it for your maximum viewing comfort.3 year system warranty, 3 year panel warrantyLearn MoreFull 1080P HD Display in a Space-Saving SizeView largerThe 24-inch Full HD 1080p LED-backlit VE248H display is perfect for watching HD movies, playing games, and viewing photo albums. Its 2ms Trace-Free Technology (gray to gray) ensures accurate detail and fluid motion for fast-moving scenes. ASUS Smart Contrast Ratio (10,000,000:1) dynamically fine-tunes between black and white to sharpen images and accurately reproduce images as intended.Optimize to Your LikingView largerWhether you're viewing photos, watching movies, or surfing the Web, the VE248H comes with exclusive Splendid Video Intelligence Technology that lets you easily adjust color and contrast to your preference in a simple push of a button. With a total of six color preset modes and three skin tone modes, customize image settings for an entirely personalized visual experience. In addition, ASUS Aspect Control auto-detects and adjusts aspect ratio to your desired viewing preference.Sensibly Sophisticated DesignView largerThe VE248H has a streamlined design that's as practical as it is stylish. Its narrow frame gives additional screen real estate and offers a more seamless appearance when placed adjacent to other monitors&mdash;ideal for using multiple display technology. Plus, built-in stereo speakers provide sound when connected to either the HDMI or the audio out port, delivering sound with no external speakers. VESA mountable, the VE248H fits nicely on walls and, thanks to its cable management, hides wires for a clean simple appeal.ASUS &mdash; World Leader in TechnologyASUS is the world leader in motherboards and graphics cards, and is one of the fastest growing of the top 10 notebook brands. The ASUS product portfolio includes displays, notebooks, Eee PCs, motherboards, graphics cards, and much more. In 2010, ASUS products won 3,398 distinguished awards thanks to the innovative user-centric technologies such as Splendid Video Intelligence Technology&mdash;included in every ASUS display and notebook.ASUS Warranty3 year LCD monitor warranty3 year panel warranty2-way free standard shipping for repairsComplimentary ASUS Rapid Replacement (cross-shipping)What's in the BoxASUS VE248H LCD MonitorDVI CableVGA CableAudio CablePower Cord &amp; AdapterQuick Start GuideWarranty Information CardSpecificationsPanel Size:24-inch WidescreenTrue Resolution:1920 x 1080Pixel Pitch:0.277mmBrightness(Max):250 cd/m2Contrast Ratio (Max):10,000,000:1 (ASCR)Display Color:16.7MViewing Angle (CR&gt;=10):170&deg;(H)/160&deg;(V)Response Time:2ms (Gray-to-Gray)Video Features:2ms Trace Free TechnologySplendid Video Intelligence TechnologySplendid Video Preset Modes (6 modes)Skin-Tone Selection (3 mode)HDCP supportAudio Features:Stereo speakers 1W x 2 stereo RMSConvenient Hotkey:SPLENDID Video Preset Mode SelectionAuto AdjustmentBrightness AdjustmentVolume AdjustmentInput SelectionPC Video Input:DVI-D/ D-Sub / HDMI 1.3PC Audio Input:3.5 mm mini-jackAnalog Signal Frequency:30 ~ 83kHz(H)/ 55 ~ 76 Hz(V)Digital Signal Frequency:30 ~ 83kHz(H)/ 55 ~ 76 Hz(V)Power Consumption:Normal &lt; 35 W; Power Saving Mode &lt; 1 WChassis Colors:BlackTilt:+20&deg;~ 5&deg;VESA Wall Mounting:100mm x 100mmSecurity:Kensington lockPhys. Dimension (W x H x D):22.42 x 16.12 x 7.91 &ndash;inchesWeight (estimated):9.7 lbsRegulation Approval:Energy Star 5.0, CEL, UL/cUL, CB, CE, EuP, FCC, CCC, BSMI, Gost-R, C-Tick, VCCI, PSB, J-MOSS, WEEE, ErP, Windows Vista &amp; Windows 7 WHQL&copy; 2011 ASUS Computer International. All Rights Reserved. ASUS is a registered trademark of ASUSTeK Computer. All specifications are subject to change without notice. Color and bundled software versions are subject to change without notice. Brand and product names mentioned are trademarks of their respective companies. Product may not be exactly as shown in photos.Check Out Other Great ASUS ProductsEeeBox EB1501P Nettop PCEasily attaches behind a monitor to efficiently power anything from day-to-day tasks to Full HD entertainment.ASUS VE276Q LCD MonitorDazzle your visual senses with the ASUS VE276Q. Embedded digital HDMI and DisplayPort inputs enable the most advanced graphic card and computer connectivity.ASUS RT-N13U Wireless N Router (with USB)Upgrade your network to faster performance and broader range with this EZ to setup wireless N router. You can even share an all-in-one printer with the peers in your network.ASUS VW266H LCD Monitorfeatures a 25.5-inch 1920x1200 LCD screen that supersedes Full HD 1080p resolution. Its extra large resolution and ASUS Trace Free 2ms response time makes it ideal for immersing yourself in the latest games with the sharpest details and clarity, even for fast motion action video playback."}