{"asin": "B0014H16V0", "categories": [["Electronics", "Television & Video", "Blu-ray Players & Recorders", "Blu-ray Players"]], "description": "Experience the blu-ray difference with the SAMSUNG BD-P1500. TheBD-P1500 lets you have it all - watch your favorite DVDs and blu-ray discs or listen to CDs with the highest-quality audio.Full 1080p resolution gives you the most outstanding HD image quality.Enjoy a richer, bolder color palette via extended gamut YCC technology. HDMI 1.3 transmission bandwidth capabilities ensure the strongest signal fidelity, while the Ethernet connection lets you easily check for the latest firmware upgrades online. Control all your Samsung AV devices from one remote, via Anynet+ technology. And advanced audio compatibility, including DD+, and True-HD, offers premium sound, for the greatest HD experience.CD &amp; DVD CompatibleThis blu-ray disc player offers state-of-the-art viewing with CD and DVD playback compatibility. Even as you take advantage of the latest video and audio advances, you can still enjoy all your existing media content.Built-in Ethernet ConnectionBD profile 1.1 interactivity lets you download the latest firmware upgrades and more with just a click of a button. Making firmware upgrades simple and easy, you can continually upgrade the BD-P1500 with the latest features.Dolby Digital Plus and Dolby True HDImmerse yourself in amazing sound. The BD-P1500 supports the new Dolby Digital Plus Audio format. It also supports uncompressed PCM Audio and Legacy dts 5.1 Dolby Digital. Dolby&reg; Dolby TrueHD delivers powerful sound that is bit-for-bit identical to the studio master, unlocking the true high-definition entertainment experience.1080p ResolutionEnjoy lifelike, vivid visuals and crystal-clear details with full high definition 1080p resolution.Easily Connect Your Digital DevicesTired of tangled wires? HDMI keeps it simple by using a single cable wire to deliver the sharpest, richest images possible. Conveniently and easily transfer high-definition video and audio from your DVD player to your HDTV and other digital devices using a single cable. HDMI version 1.3 transfers deeper color and higher resolution, and handles new, compressed audio formats.Control it All with One RemoteYou're in full command with the BD-P1500. Anynet+ delivers streamlined, one-touch control over all your Anynet+ compatible devices such as the TV, AV receiver, and home theater. You can operate all of them with a single remote control. A true &ldquo;plug and play&rdquo; product, it comes with a Consumer Electronics Control feature that lets you operate SAMSUNG HDMI products with one remote control.Technical SpecificationsCompatibilityPlayback MediaBD-ROM / DVD-ROM / DVD-R / DVD-RW / AVCHD / audio CDPlayback FormatsVC-1 / MPEG2 / H.264&nbsp;A/V QualityDVD UpconversionYes&nbsp;Dolby Dital DecoderYes&nbsp;DTS DecoderYes&nbsp;Dolby Digital Plus DecoderYes&nbsp;DTS HD DecoderNo&nbsp;Dolby True HD DecoderYes&nbsp;Functional FeatureLocal StorageYesPicture in PictureYes&nbsp;BD Profileprofile 1.1&nbsp;Connectivity&nbsp;USB 2.0Yes (for SW upgrade and memory expansion)&nbsp;HDMI CECYes&nbsp;Composite Video OutputsYes&nbsp;Component Video OutputsYes&nbsp;S-Video OutputsNo&nbsp;HDMI Outputs(Version)Yes (1.3)&nbsp;Optical Digital Audio OutputsYes&nbsp;Coaxial Digital Audio OutputsNo&nbsp;Analog Audio Outputs2-Channel&nbsp;NetworkYes (for SW upgrade only)&nbsp;Product Weights &amp; Dimensions&nbsp;Dimension16.9 inches x 3.3 inches x 10.8 inches&nbsp;Weight8.6 lbs.&nbsp;Shipment Weights &amp; Dimensions&nbsp;Dimension20.6 inches x 7.1 inches x 15.0 inches&nbsp;Weight12.6 lbs.Spec //Answers to Basic Questions About Blu-rayWhat is Blu-ray?Blu-ray is a new optical disc format with over five and a half times the storage capacity of a standard DVD (25 GB versus 4.5 GB). A dual-layer Blu-ray disc can hold up to 50 GB of information. With that increased storage, movie studios can finally provide movies on disc in high definition, offering 6x the resolution or image detail of DVD and up to 8 channels of lossless (better than CD quality) digital sound. The new format can also provide interactive features that go well above anything ever offered before.Is Blu-ray different than HDTV?HDTV, or high definition television, is a new broadcasting format that offers widescreen, high resolution images offering 6x the resolution or image detail of DVD, with up to 5.1 channels of digital audio. Until now, the signals were only available through over the air transmissions (via an antenna), or through digital cable and satellite signals. You can not get HD signals from a standard video tape or DVD.&nbsp; An HDTV is a high resolution video display that is capable of receiving and displaying these HDTV broadcasts or images.&nbsp;&nbsp; Blu-ray is a complement to your HDTV. It's a disc media format that has enough storage to include an entire movie, plus soundtracks and bonus materials, recorded in the high definition format. You can play Blu-ray discs back on your HDTV and see the same, if not better image and sound quality as you do from HDTV broadcasts.What kind of TV do I need to enjoy Blu-ray?You can play back Blu-ray movies on any TV with composite video or better inputs (not RF), but to get a worthwhile benefit from the format over DVD you'll want to have a high-definition television, or HDTV, with a vertical resolution higher than 480p, and preferably higher than 720p. Most Blu-ray titles can deliver an image with a vertical resolution of 1080i or 1080p. The more horizontal resolution the TV can reproduce, up to 1920 lines or pixels, the better.How are Blu-ray discs different than regular DVDs?Blu-ray discs are the same size as DVD or CD, but use a blue* laser to store and read data as opposed to the red laser used in DVDs and CDs. The blue laser's shorter wavelength, combined with a smaller aperture lens and a thinner cover layer on the disc makes it possible to create a smaller beam spot size capable of storing and reading much more, smaller information on the disc.&nbsp; A single-layer Blu-ray disc can hold 25 GB worth of data, compared to 4.5 on a standard DVD. A dual layer BD disc holds up to 50 GB. This translates into the ability to store a full 1080p HD image. This has a resolution consisting of 1920 by 1080 progressively scanned pixels, compared to standard DVD's 720 by 480 pixels.&nbsp; In addition, Blu-ray has much wider bandwidth than DVD, delivering signals at speeds up to 48 Mbps, six times faster than DVD's 8 Mbps, and nearly 2.5 times the data of an HDTV broadcast's 19.2 Mbps.&nbsp; *technically, it's violet, but who's keeping track?Will Blu-ray discs play in my current DVD player?No. You will need a Blu-ray player to be able to read the smaller, denser information found on a Blu-ray disc.Will I be able to play standar DVDs on my Samsung Blu-ray player?Yes. Blu-ray players are backwards compatible with your standard DVDs.&nbsp; They can also play CDs.Is Blu-ray the same as HD DVD?No. HD DVD was a competing format with less storage capacity than Blu-ray. With Toshiba, its primary champion announcing on February 19, 2008 that they would end production of HD DVD products, the few companies that were supporting the format announced that they would instead create products for the Blu-ray format.What does up-conversion mean?Consumers have over 50 years worth of material in standard definition formats. Up-conversion is the process of taking that existing, standard definition material and converting it (lines and pixels are copied to some degree) to the higher resolution needed to display those signals on an HDTV. When done well, the process can often improve picture quality, though it can't increase actual resolution. The quality of the up-converter, included in everything from up-converting standard DVD players to Blu-ray players and HDTVs, can often determine the quality of the picture.What kind of cables, connections do I need to have to make Blu-ray work?You will need either a 3-wire analog component (typically labeled Y, Pr and Pb) or an HDMI digital video connection between the BD player and the TV. The HDMI connection is preferable. Not only will it provide better image quality, but it will pass along higher resolution audio and control information, as well. You may get limited up-conversion options with standard DVDs when using the component connection.What is firmware and do I need it?Firmware is like computer software, or the instruction set in the player that tells the hardware what to do under various conditions. Insert a disc, and the firmware tells the player to read the disc. Press the Play button and the firmware tells the player to play the movie. Generally speaking, the firmware is invisible to the end user. But Blu-ray keeps evolving, and new features keep being created. With each new feature that a movie studio comes up with, hardware manufacturers have to release new instruction sets, or firmware, to deal with it. Samsung's ability to easily update the firmware in their BD players makes them one of the best in the business.&nbsp;Who supports Blu-ray?At this point, nearly everyone supports Blu-ray. All the major movie studios have announced that they would support Blu-ray with both new and catalog titles. Thousands of movies and music videos are already available. Most major electronics manufacturers have been supporting Blu-ray since the format's beginning.Can I rent movies on Blu-ray?Yes. Blockbuster, Hollywood Video and Netflix, among other places, offer Blu-ray titles for rent.&nbsp;Are my regular DVDs obsolete?Not by the definition Merriam Webster would use. You can still play your regular DVDs on your Blu-ray disc player, so they're still useful, but you'll want to replace them with Blu-ray versions as they become available in the new format so that you can enjoy the improved image and sound quality.&nbsp;Is the only benefit to Blu-ray the video quality? Why should I upgrade to Blu-ray?You will probably upgrade because of the video quality, but you may also appreciate the improved sound quality available on some players as well as the advanced interactive features.&nbsp; Blu-ray offers the latest generation audio codecs that can play back up to 8 channels of surround sound with improved audio quality over that of standard 5.1 digital soundtracks. This includes Dolby Digital Plus, Dolby TrueHD, DTS High Resolution and DTS Master Audio.&nbsp; Blu-ray also offers advanced bonus features that can include interactive game features or picture-in-picture commentary tracks, not to mention additional features that could be downloaded after the disc has been produced.&nbsp;Do I need to buy a new home theater system?You don't need a new audio system, but you should at least have a surround system (five speakers and ideally a subwoofer) with Dolby Digital or DTS audio decoding to hear the theater-like audio experience that is available on Blu-ray. Some BD players offer more advanced audio codecs that provide even better quality sound through up to 8 channels of surround.&nbsp;What do all these audio formats mean?You can hear better-than theater-like audio at home. As George Lucas has said, sound is 50% of the movie experience. With the right audio equipment, you can hear up to 7.1 channels of sound that is no different than what the recording engineers heard in the mixing room.&nbsp;What's the benefit of 24p?Movies are recorded on film at 24 frames per second (fps). Video is recorded and played back at 60 frames per second. Movies must be converted to 60 frames before being played back on your TV.&nbsp; Blu-ray discs record movie content in the original 24 frame format, and convert the signal within the player to output at 60 fps for standard HDTVs. Some current HDTVs, like Samsung's Auto Motion Plus 120Hz models, and undoubtedly more future ones, can accept and play back the 24 frame signal without the intermediary conversion to 60 fps, which can offer a smoother, more natural-looking image.&nbsp;What does Profile 1.0, 1.1, 2.0 mean?Blu-ray's specifications for video are broken into three profiles, each with its own set of hardware and software requirements. Profile 1.0 gave hardware manufacturers a grace period to create players that were capable of Blu-ray video playback, but didn't need to meet the final standard profile requirements. This grace period ended October 31, 2007. These players, while not able to take advantage of all of Blu-ray's promised extra content, will provide full 1080p video playback.Profile 1.1, also known as BonusView, makes certain requirements mandatory: picture-in-picture, secondary audio mixing, a minimum of 256MB of memory (built-in or removable), and the incorporation of a virtual file system. Players created and sold after October 31, 2007 are required to meet the Profile 1.1 specification, and therefore will take advantage of 1.1-enabled bonus materials on certain BD discs.BD-Live (Profile 2.0) makes mandatory all parts of Profile 1.1, but increases the memory requirement to 1GB and adds the hardware requirement of a network connection. This specification enables the even-more interactive web-based bonus material found on discs that provide such content.Features and specifications are subject to change without prior notification.", "title": "Samsung BD-P1500 1080p Blu-ray Disc Player", "price": 5.99, "salesRank": {"Electronics": 18833}, "imUrl": "http://ecx.images-amazon.com/images/I/31iat-nBzRL._SX300_.jpg", "related": {"also_viewed": ["B004N85YBA", "B0089KJPM2", "B004ZP756S", "B00ECQABDY", "B00ICDAAX4", "B00EUY59Z8", "B005NEZDUA", "B001URWAYG", "B009YWN926", "B0076R7F62", "B005DII6DC", "B0036WS4CA", "B00G4TTQQK", "B00ICDAAXO", "B00IBR189Q", "B00KB9VBCQ", "B00I83T0DO", "B0076R7FFI", "B00BFDHVAS", "B00793MIJM", "B00FF9SVWA", "B00FL4EWEK", "B00803FNAG", "B0076R7F1M", "B00BFDHV9E", "B00BQ3EGPU", "B00D8M59QW", "B00BD7UVO4", "B006U1YUZE", "B00BFYUTO2", "B00HUBYBHA", "B0096FBGIA", "B00AWX6EYQ", "B00AWKC0JM", "B0070XF9LA", "B00HUBK82C", "B00KLG978O"], "buy_after_viewing": ["B00ICDAAX4", "B00ICDAAX4", "B003L1ZYYM", "B00EUY59Z8", "B00EUY59Z8", "B00IBR189Q"]}}