{"asin": "B0038KUYLO", "categories": [["Electronics", "Television & Video", "Televisions", "LCD TVs"]], "description": "Offering excellent picture performance, Panasonic's 22-inch VIERA TC-L22X2 LCD HDTV provides 720p high-definition imagery and includes a Universal Dock for Apple iPod, which enables you to control and play music and video directly from your iPod or iPhone through your VIERA HDTV. This X2 series model also features 24P Playback function for superb imagery from 24-frame movies on DVD and Blu-ray Disc, Game Mode for faster image response while playing immersive 3D games and a 15,000:1 contrast ratio.This and other models in the X2 line offer Panasonic's VIERA Image Viewer feature, which enables you to play slideshows of JPEG images stored on SD memory cards, as well as the VIERA Link feature for controlling a variety of compatible components--from Blu-ray Disc players to digital cameras--through a single remote.Adhering to Panasonic's commitment to the environment, this VIERA model--as well as all 2010 models--features improved power consumption and meets the new, more stringent Energy Star 4.0 requirements.Key FeaturesGame Mode:With Game Mode, quicker image response increases the enjoyment of video games when a game console is connected to the TV. What's more, VIERA produces the dark images in video games more clearly. This mode works with the anti-image retention (wobbling) function, too.&nbsp;VIERA Link:Allows the interlinked operation of various AV devices--from DVD and Blu-ray Disc players to home theater sound systems to digital cameras and camcorders--using only the VIERA remote control by simply connecting the devices to each other by an HDMI cable (seepop-up illustration).&nbsp;Panasonic's VIERA X2 series LCD HDTV.iPod Entertainment Kit:With the included Universal Dock for iPod, you can control playback of the music and video stored on your Apple iPod or iPhone directly through your VIERA HDTV via the remote control and intuitive onscreen menu system (see more about iPod/iPhone compatibility).&nbsp;VIERA Image Viewer:View full-HD images with the integrated SD card slot, enabling you to view JPEG photos captured from your digital camera or camcorder on the big screen. Navigate your images via an easy-to-use thumbnail display.Key SpecificationsSeries:X2Screen type:LCD (CCFL backlight)Screen size:22 inchesFilter:Fine Black PanelNative resolution:1366 x 768 pixelsContrast ratio:15,000:1Viewing angle:178 degreesReceiving system:ATSC/QAM/NTSCHDTV display capability:720pEDTV display capability:480pSpeakers:2 full range, 6W total power; surround sound capabilitiesImage viewer:JPEG compatibilityAspect control:480i/p -- Full, Just, 4:3, Zoom; 720p -- Full, H-Fill, Just, 4:3, ZoomOptional wall-mounting bracket:TY-WK23LR2WMulti-lingual menu:English/Spanish/FrenchEnergy Star qualified:YesConnectionsHDMI: 1Component (Y, PB, PR): 1Composite A/V: 1PC input (15-pin, D-Sub): 1Digital audio output: 1DimensionsTV with stand: 21.4 x 15.9 x 7.5 inches (WxHxD); 15.4 poundsTV without stand: 21.4 x 14.3 x 2.4 inches (WxHxD); 13.2 poundsWhat size TV should you get?What's in the BoxPanasonic X2 series LCD HDTV, removable stand, remote control (with batteries), operating instructionsHEADING row -Series:VT25 PlasmaGT25 PlasmaG25 PlasmaS2 PlasmaU2 PlasmaC2 PlasmaU22 LCDX2 LCDC22 LCDSUBHEADING row - linksModels:TC-P54VT2554\"TC-P50VT2550\"TC-P50GT2550\"TC-P42GT2542\"TC-P54G2554\"TC-P50G2550\"TC-P46G2546\"TC-P42G2542\"TC-P65S265\"TC-P58S258\"TC-P54S254\"TC-P50S250\"TC-P46S246\"TC-P42S242\"TC-P50U250\"TC-P42U242\"TC-P50C250\"TC-P46C246\"TC-P42C242\"TC-L42U2242\"TC-L37U2237\"TC-L32U2232\"TC-L37X237\"TC-L32X232\"TC-L22X222\"TC-L37C2237\"TC-L32C2232\"spec rowVIERA CastVT25GT25G25S2--U2--C2--U22--X2--C22--spec rowVIERA Image ViewerVT25(AVCHD/MPEG2/JPEG/MP3 playback)GT25(AVCHD/MPEG2/JPEG/MP3 playback)G25(JPEG)S2(JPEG)U2(JPEG)C2(JPEG)U22(JPEG)X2(JPEG)C22(JPEG)spec rowVIERA LinkVT25webcam capableGT25webcam capableG25webcam capableS2U2C2U22X2C22spec rowNeoPDP PanelVT25--GT25--G25S2U2--C2--U22--X2--C22--spec rowTHX DisplayVT25GT25G25S2--U2--C2--U22--X2--C22--spec rowContrast RatioVT25Infinite Black Pro / 5,000,000:1 NativeGT25Infinite Black / 5,000,000:1 NativeG25Infinite Black / 5,000,000:1 NativeS2Dynamic: 2,000,000:1U2Dynamic: 2,000,000:1C2Dynamic: 2,000,000:1U22Dynamic: 20,000:1X2Dynamic: 20,000:122\": 15,000:1C22Dynamic: 18,000:1spec rowMoving Picture ResolutionVT251080 linesGT251080 linesG251080 linesS21080 linesU2900 linesC2720 linesU22--X2--C22--spec rowAnti-Reflective FilterVT25GT25G25S2U2--C2--U22--X2--C22--spec rowDisplay CapabilitiesVT251080p, 1080i,720p, 480pGT251080p, 1080i,720p, 480pG251080p, 1080i,720p, 480pS21080p, 1080i,720p, 480pU21080p, 1080i,720p, 480pC2720p, 480pU221080p, 1080i,720p, 480pX2720p, 480pC22720p, 480pspec row600Hz Sub-field DriveVT25GT25G25S2U2C2U22--X2--C22--spec rowspec rowGame ModeVT25GT25G25S2U2C2--U22--X2C22--spec rowSpeakersVT253; 30W totalGT252; 20W totalG252; 20W totalS22; 20W totalU22; 20W totalC22; 20W totalU222; 20W totalX22; 20W total22\": 6WC222; 20W totalspec rowSurround SoundVT25GT25G25S2U2C2U22X2C22spec rowHDMI inputVT254 (1 side)GT253 (1 side)G253 (1 side)S23 (1 side)U23 (1 side)C22U223 (1 side)X23 (1 side)22\": 1C222spec rowComponent input(Y, PB, PR)VT252GT252G252S22U22C22U221X21C221spec rowComposite inputVT252 (1 side)GT252 (1 side)G252 (1 side)S22 (1 side)U22 (1 side)C22 (1 side)U222 (1 side)X22 (1 side)22\": 1C222spec rowPC inputVT251 (side)GT251 (side)G251 (side)S2--U2--C2--U221X21C221spec rowUSBVT252GT252G252S2--U2--C2--U22--X2--C22--spec rowEthernet LAN inputVT251GT251G251S2--U2--C2--U22--X2--C22--spec rowDigital Audio outputVT251GT251G251S21U21C21U221X21C221spec rowiPod Universal DockVT25--GT25--G25--S2--U2--C2--U22--X2C22--spec rowEnergy StarVT25GT25G25S2U2C2U22X2C22HEADING row - SeriesSeries:VT25 PlasmaGT25 PlasmaG25 PlasmaS2 PlasmaU2 PlasmaC2 PlasmaU22 LCDX2 LCDC22 LCDWhich Size HDTV is Right for My Room?With standard-definition TVs, the rule used to be that viewers would feel comfortable watching a set from a distance of 3 to 6 times the screen size in inches. With HDTV, the resolution is so much better that you can sit closer to a larger TV without noticing the pixels. So with HDTVs, the rule tends to be you can sit anywhere from 1.5 to 3 times the screen size (in inches) for the best experience.If you know the size of the room you have already, where you want to sit, and where your new HDTV should go once you get it, you can figure out the size HDTV you should get.Minimum size = Viewing distance/3Maximum size=Viewing distance/1.5", "title": "Panasonic TC-L22X2 22-Inch 720p LCD HDTV with iPod Dock", "price": 8.81, "salesRank": {"Electronics": 40290}, "imUrl": "http://ecx.images-amazon.com/images/I/51St-XURRHL._SY300_.jpg", "related": {"also_viewed": ["B00BCGRX9M", "B000WYVBR0", "B00HZI0Y0Q"], "buy_after_viewing": ["B005LR04WQ", "B00BCGRX9M", "B00BCGRX9M", "B00BF9MZ44", "B003O1UYHG"]}}