{"asin": "B000MUXJCO", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]], "description": "The compact Studiophile AV 40 powered speakers deliver the same proven M-Audio technology favored by top producers, recording engineers and musicians around the world. The combination of 4-inch polypropylene-coated drivers and 3/4-inch ferrofluid-cooled silk dome tweeters provides punchy lows, crisp highs and a balanced, uncolored response. Custom cabinets with dense wood construction deliver more accurate bass response than you could ever get from plastic multimedia speakers. And for the highest possible fidelity, the Studiophile AV 40 speakers also feature OptImage III wave-guide technology and a 20 watt-per-channel internal amplifier that utilizes Class A/B architecture. The Studiophile AV 40 reference monitors are the perfect solution for traveling musicians or anyone who wants top-notch sound from their desktop multimedia system.A perfect solution for traveling musicians or anyone who wants top-notch sound from their desktop multimedia system.Click to enlarge.Convenient front auxiliary input and phones jack.Rear features balanced quarter inch and RCA inputs, along with bass boost switch for low-end enhancement.Click to enlarge.Studiophile AV 40 Compact Desktop Speaker SystemProfessional Components--Professional ResultsThe Studiophile AV 40 monitors are designed with the same quality materials and internal electronics that are used in M-Audio's acclaimed professional monitors. You'll find features like audiophile-grade Class A/B amplifier architecture and balanced 1/4-inch TRS inputs in addition to RCAs. It all adds up to a big sound that belies the speakers' small size. With the Studiophile AV 40s, you don't have to give up professional-grade fidelity to enjoy the ease and mobility of a compact speaker system.Extended Low EndIf you require extra bass response, the Studiophile AV 40 speakers have you covered. MDF wooden cabinets, bass reflex design and an integrated bass boost switch let the Studiophile AV 40s crank out plenty of low end--perfect for urban/dance music, DVDs and more.OptImage III TechnologyM-Audio's proprietary OptImage III wave guide improves overall detail and clarity while minimizing sound issues that can plague other compact monitors. The system works by improving the overall efficiency of the tweeter as well as time-aligning the drivers. This ensures that the audio from each driver reaches the listener at the same time, guaranteeing precise stereo imaging and accurate response.Magnetically Shielded for Desktop UseUnchecked, all speakers emit electromagnetic waves that can wreak havoc with your computer's video monitor or a nearby TV. The Studiophile AV 40 speakers are magnetically shielded so that all of your electronic equipment can coexist on your desktop without interference.AV 40 SpecsType:Two-way desktop reference monitorLow-frequency Driver:4\" diameter, magnetically shielded and curved cone with high-temperature voice coilHigh-frequency Driver:1\" diameter, magnetically shielded silk dome tweeterFrequency Response:85Hz - 20kHzCrossover Frequency:2.7kHzRMS SPL:101.5dB @ 1 meterSignal-to-Noise Ratio:> 90dB (typical, A-weighted)Input Connectors:Left and right RCA line input, left and right 1/4\" TRS input and 1/8\" aux inputPolarity:Positive signal at \"+\" input produces outward low-frequency cone displacementDynamic Power:20 watts continuous, per channel into 4 &Omega;Input Impedance:10 k &Omega; unbalanced, 20 k &Omega; balancedInput Sensitivity:100 mV pink noise input produces 90dBA output SPL at 1 meter with volume control at maximumProtection:RF interference, output current limiting, over temperature, turn on/off transient, subsonic filterIndicator:Blue power LED ring around volume knob on front panelPower Requirements:100-120V/~50/60Hz, 220-240V/~50/60Hz; powered via detachable 2-conductor line cordCabinet:Vinyl-laminated MDFDimensions:8.75\" (H) x 6\" (W) x 7.25\" (D)Weight:14 lbs./6.34 kgWhat's in the BoxPair of AV 40 Monitors, Two Power Cables, 1/8-Inch Mini-to-RCA cable, 1/8-Inch Auxiliary Cable, Bare Wire Cable for Speaker Connection, Two Traction Pads, User's Manual.", "title": "M-Audio Studiophile AV 40 Powered Speakers (Previous Version)", "price": 149.99, "salesRank": {"Musical Instruments": 18230}, "imUrl": "http://ecx.images-amazon.com/images/I/41kbtBZ-mjL._SY300_.jpg", "related": {"also_viewed": ["B0051WAM64", "B0051WAM1O", "B005F3H6Q8", "B000VKEFN2", "B000IKSIOM", "B00II8H3AQ", "B00DQMJE7E", "B000BN7CRU", "B000U2G6VA", "B00F3F7OIS", "B000979TV0", "B00181T20O", "B000VKEFMS", "B0019R8U7I", "B00181YT9S", "B0038YX39A", "B009ELKA6U", "B005OA3BSY", "B000062VUO", "B00DGAXXV4", "B000OB16ZI", "B000OABTPQ", "B005F3H6MC", "B00DUKP37C", "B009JXHTNU", "B00DFUTY1I", "B001S14DYO", "B000EJTXZU", "B004LU9HEA", "B003VAHYTG", "B008YRJ0AC", "B002FU5QMA", "B005HHKATM", "B001A6G6CY", "B00DIGC5NS", "B003OT7O1C", "B00EO7UNXO", "B001T9O5UM", "B00DS5QZYO", "B001RNOHDU", "B00CP4IJH0", "B00CFOX420", "B002RMPHMU", "B00EZ1VAMC", "B003OT9N48", "B00LIQJQ2S", "B000OG88KY", "B00FX7MMRO", "B002GHBZ3Q", "B00CD1PTF0", "B001PYK1BS", "B00E7H8GG2", "B0042F3K9W", "B0002SQ2P2", "B005OSR1C8", "B009IBXUNG"], "buy_after_viewing": ["B0051WAM64", "B005HGM1D6", "B0049P6OTI", "B0051WAM1O"]}}