{"asin": "B0009JR5IM", "description": "Now you can easily let all your favorite iPod tunes rock the house with the Kensington 33164 Stereo Dock for iPods. This system works with all iPods with dock connectors, including the new iPod nanos and videos, and simultaneously charges your iPod in its cradle as it transmits your tunes in high quality through your home stereo system.The Kensington 33164 comes with a handy infrared remote that lets you operate your iPod from up to 30 feet away, free of interference from other devices. Five simple buttons let you control play/pause, skip forward, skip back, volume up and volume down, while a long-life battery provides your control with power for up to one year of uninterrupted use. This unit's sleek design perfectly matches your iPod's aesthetic, as well as complementing today's home stereo components. The 33164 system comes with everything you need to get plugged in and up-and-running right out of the box, simply requiring you to plug in the power cable and connect the docking station to your stereo's input port to start enjoying your music throughout the house.Compatible with any iPod with a dock connector--including theiPod nano 1G,iPod nano 2G,iPod mini,iPod 3G,iPod 4G (Click Wheel),iPod color, andiPod 5G/5.5G Video--the Kensington Stereo Dock is backed by Kensington's 5-Year warranty and free technical support.What's in the BoxKensington Stereo Dock, IR remote control with 2 AAA batteries, 7-foot gold-plated RCA output cable, an AC adapter, an instruction sheet, and warranty information.", "title": "Kensington 33164 Stereo Dock, Charger, and Transmitter for iPod, iPod Mini, iPod Nano, or iPod Photo", "price": 21.39, "imUrl": "http://ecx.images-amazon.com/images/I/412SP4140ML._SY300_.jpg", "related": {"also_viewed": ["B0056IB3DY", "B0019FMEO0", "B001JM1L5Q", "B0051MQJF2", "B0077PNA1W", "B007A9932U", "B000BQQL24", "B004F1NZTS", "B007BYDA1O", "B00AWRPIWQ", "B00JMUPHGQ", "B00AYNRLFA", "B004I8WH8I", "B0049MOK92", "B0016P15E8", "B00424Q6GW", "B005MQ1B6O", "B0061I0212", "B00490OVM0", "B0000D8LSW", "B0082D05OS", "B003CP0K9Q", "B003VANOI6", "B000FLRXKE", "B0002OD0N8", "B000M5UO04", "B002H9LNGW", "B0056YAY74", "B006TST2DS", "B004YEBK66", "B009A5EIWC", "B00GHUHMUS", "B004VM1T5S", "B006U1VH2S", "B0097BEE9Q", "B0047T79VS"], "buy_after_viewing": ["B0056IB3DY", "B0019FMEO0", "B001JM1L5Q", "B0051MQJF2"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}