{"asin": "B00DN27H58", "description": "Aerb is aimed to make innovations to enhance people's life, and excited to bring our coolest Bluetooth speaking mouse into this hot summer.Bluetooth mice and Bluetooth speakers are both popular and widely used because of their wireless connectivity. To integrate a speaker into a mouse, and make the speaker and mouse both wirelessly connected to the external device, will not be a fancy technique, but very applicable in our daily life. It plays the role of traditional mouse does; it could control the cursor for android based tablets or smartphones; it replaces your mouse+speaker+microphone combo, and it makes your Skype very easy; it works as a speakerphone when you want easy talk...Only support built-in Bluetooth laptops, computers, tablets and mobile phones. Be sure that some type of Bluetooth dangle itself won't support. So make sure your device support Bluetooth.About Pairing:For Bluetooth speaker, turn speaker power off then turn power on.Double check the setting to make sure the Bluetooth speaker is the default audio device.For Bluetooth mouse, turn mouse power off then turn power on.Specifications:Version: Bluetooth 3.0Protocol: HID for Bluetooth mouse & A2DP for Bluetooth speakerInternal battery capacity: 900 mA (charge using micro USB adapter at 5V 150Ma; red indicates charging, green indicates fully charged)Working hours per charge: 7 HoursFunction keys: forward/backward; volume up/down; accept/reject incoming callsPackage Includes:1*Bluetooth Mouse Speaker1*Micro USB charging cable1*User ManualPls be kindly note, our Aerb Bluetooth Speaking Mouse won't work as a mouse for iPad or iPhone because iPad or iPhone won't support any mouse function.", "title": "Aerb&reg; Wireless Bluetooth Speaking Mouse with Speaker Speakerphone for Bluetooth Enabled Devices (HID &amp; A2DP)--Purple", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/41Gc08xYboL._SY300_.jpg", "related": {"also_bought": ["B00FEYJP0I", "B00E1HIVG8", "B0096M8VR2", "B009ZIILLI", "B005C6CVAE"], "bought_together": ["B0096M8VR2"], "buy_after_viewing": ["B00BZC31WQ", "B009KY58FE", "B00ESJPSWY", "B000Q7V0W4"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Mice"]]}