{"asin": "B002VPDM2A", "description": "Double your battery capacity and charge on the go with a portable power pack that securely suctions to the back of your iPod or iPhone. The included cable recharges JumpStart via your computer while syncing your iPod or iPhone with iTunes. The battery pack uses suction cups for secure attachment to the back of your iPod or iPhone. They also allow for easy removal when not in use.The compact, flexible design means you can still comfortably use your iPod or iPhone while the battery pack is attached and charging.Now you can talk, surf and enjoy the music and videos on your iPod or iPhone for twice as long with double the battery capacity using the attachable power pack. Keep the battery pack on hand so you have the power to recharge the battery of your iPod or iPhone wherever you are. Simply attach the battery pack to fully recharge on the go.Discreet and energy conscious, the hidden LED light appears with the push of a button to let you know the power status of your battery pack at a glance.The included mini-USB cable connects the battery pack to a USB charging unit - like your computer or a USB wall or car charger. When connected to your computer, the cable charges the battery pack and allows you to sync your iPod or iPhone with iTunes.Even if you're not near a wall or car charger, you can recharge your iPod or iPhone battery with the convenient battery pack. The intelligent battery pack supplies power first, so you can remove the pack after use and still have a full iPod or iPhone battery.", "title": "Digital Lifestyle Outfitters DLA52527/17 JumpStart Power Charger for Ipod and Iphone", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/41nsjCMIuuL._SY300_.jpg", "related": {"also_bought": ["B004BNXC8Y", "B004SI3MDW"], "buy_after_viewing": ["B0035R2QS4", "B004SI3MDW", "B004BNXC8Y", "B0043RTM1O"]}, "categories": [["Electronics", "Computers & Accessories", "Laptop & Netbook Computer Accessories", "Chargers & Adapters"]]}