{"asin": "B000MS3VGA", "description": "The Perfect Integration of Form and FunctionV-MODA, the music lifestyle brand that owes its allure to the fusion of fashion and function, introduces its passion for music and style to the world with our innovative line of \"modaphones\".  The pinnacle experience of music is interwoven with supreme style in these premium fashion-phones that sound as amazing as they look.  The Vibe series of earphones comprises the signature example of the V-MODA line, combining for the first time a meticulously-crafted sound signature with a conscious eye towards modern design.V-MODA's \"Sculpted Sound Curve\"V-MODA's engineers spent over a year of the design phase crafting the perfect sound signature of the Vibe series of headphones.  Designed to mimic the warm, sweet sound of hi-fi stereo speakers costing thousands of dollars apiece, the curve remains amazingly straight  with no bass roll-off which delivers a smooth and detailed bass response.  A sensitivity dip in the 500hz to 2kHz range accentuates the bass slightly and reproduces a warm soundstage.  The gentle dropoff in the high ranges was carefully designed to avoid harsh or \"clinical\"-sounding highs, making the Vibes suitable as in-ear monitors.The Power of V-MASQUE and BLISS TechnologiesV-MASQUE is the speaker technology designed to reproduce V-MODA's sculpted sound curve.  It involves using micro-sized metal alloy housings with dynamic neodymium speaker drivers to produce intense clarity and a warm, rich sound.  Many other high-end headphones use balanced armature drivers, which can produce clarity well when inserted deeply--and for many people, uncomfortably--into the ear.  Yet even in the best-case scenarios headphones using balanced-armature drivers can often lack warmth, producing a \"mechanical\"-sounding midrange and highs that feel flat and cold.  The sound signature of the Vibe series is specifically designed for juicy lows and a sweet midrange yet maintains very precise highs.Vibe's amazing hi-definition sound makes every element of your music crystal clear and present on a 3-D soundstage.  The unique V-MASQUE dynamic driver and \"beat port\" airflow system recreates the sensation of a LIVE music experience.  The \"beat port\" airflow system works by allowing the airflow to move throughout the housing naturally thanks to precision-cut holes in the driver and the housing.  This airflow creates an organic output that is far different than other high-end in-ear monitors that can sound distant and mechanical.  The Vibe simulates an experience of listening to live music thanks to the circulation that takes place inside the headphone.BLISS is the acronym for \"Bass-Level-Isolating Soft Silicon\".  Passive noise isolation by itself is not unordinary for in-ear headphones, yet extreme attention to detail is critical because of the fitting's effect in both comfort and sound.   The exact thickness of the silicon can make all the difference in the world.  Many of the \"softest\" silicon fittings on some brands proved to be too thick in V-MODA's user test panel.   BLISS is made to not only be extremely comfortable in the ear canal, but also to be the easiest earphone to put in and take out quickly.   This way one can rock quickly in a matter of seconds, then take an intermission before another encore.The shape of the fitting is also extremely crucial to prevent them from popping out too easily by providing a proper seal.   One of the interesting things V-MODA discovered is that the smaller the fitting, the better the fit for some users since the smaller fitting fits slightly deeper to prevent fall-out.   However, many people commonly try only \"larger\" fittings thinking they may be tighter when the opposite is true.  This is why V-MODA puts the small fittings on by default in the packaging, but users should try a few different sizes to decide for themselves optimal sound and comfort.The design behind BLISS is also an ideology of how far deep the fittings should lie in the ear and the level of noise isolation.   In V-MODA's user test groups, many users found that other high-end headphones required a fit too deep and too intrusive to get the best sound and comfort.   BLISS fittings are \"just right\" for everyday use and the amount of noise isolation they provide.", "title": "V-MODA Vibe In-Ear Noise-Isolating Metal Headphone (Gunmetal Black) (Discontinued by Manufacturer)", "price": 49.0, "imUrl": "http://ecx.images-amazon.com/images/I/41ogLWZMacL._SY300_.jpg", "related": {"also_bought": ["B003J5FWGK", "B006DK65A0", "B007TEQNBK", "B0038W0NOU", "B0038W0NPE", "B002DMKPS0", "B004HKIAG0", "B0011345GA", "B005LD275M", "B007TEQNAG", "B008S4TM1S", "B00BYPKKPU", "B0041GZ6JO"], "bought_together": ["B003J5FWGK", "B006DK65A0"], "buy_after_viewing": ["B006DK65A0", "B008MW7SLW", "B005LD275M", "B002DMKPS0"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]]}