{"asin": "B0016GABR4", "description": "The firstMotorstormwowed fans with its heady formula of brutal, unpredictable off-road racing, festival vibes and stunning Monument Valley desert scenery. Now,Motorstorm Pacific Rifttakes you to a solitary tropical paradise in the Pacific Ocean, ready for a whole new take on no-holds-barred racing action through thick swamps, dense jungle, towering peaks and steaming volcanoes.Unleash the storm againHappy landings in the air zone.View larger.4-player split screen.View larger.The new Monster Truck class.View larger.Light up in the fire zone.View larger.Not just pretty backdrops to the action, these environments take center stage in challenging players with everything in Mother Nature's arsenal. Thick mud, tangled undergrowth, swift flowing rivers, choking volcanic clouds and searing lava pools all test the drivers to their limits and beyond. Expect a rich festival of off road racing, along with a host of game modes and rewards. It's brutal, dangerous, relentless, and unpredictable and more than a game -Motorstorm Pacific Riftis a way of life.Even More Vehicle Classes and TracksPacific Riftships with eight car classes: the seven from the original game (Bikes, ATVs, Buggies, Rally Cars, Racing trucks, Mud Pluggers and Big Rigs) all reproduced in new forms, as well as the new Monster Truck class. Big, but not as big or powerful as a Big Rig, Monster Trucks are surprisingly fast for their size and are able to roll over most other classes of vehicle and virtually any vegetation they encounter.The game's list of playable tracks has also been doubled to 16 and are categorized along the lines of the elements and the different environmental zones are found on the island. These zones are:The Air Zone- Tracks high up in the mountain and featuring lots of big jumps.The Fire Zone- Track oozing with new land and pools of lava that come from the island's resident volcano.The Water Zone- Here players will find courses laid out along the the beaches and other water sources of the island.The Earth Zone- The typical rough, rocky mud-filled off-road courses similar to the tracks found in the original game.Multiplayer ModesIn addition to the wild, anything goes singleplayer festival mode players of the originalMotorstormgame will remember and relish,Motorstorm Pacific Riftalso provides addictive multiplayer modes for both online and local play. These include the same rampaging, music injected, 12-player online support as the first game, as well as multiplayer options for local action up to four players. Play in local multiplayer modes are further enhanced by new four-player split screen functionality that when used in conjunction with the game's 720p HD video output ensures clarity no matter how fast racers are moving or how much mud they are throwing up.Key Game Features:The Island- A brand new radically different location for the festival.Unpredictable Events- Never the same race twice. Events will take place to change the race on a lap to lap basis.Split Screen Play- Play with up to 3 buddies on the same screen.The Monster Truck- An all new vehicle class added to the core vehicle selection for a total of 8 different vehicle classes.Immersive Online Experience- A radical re-look at the wholeMotorstormonline experience, focusing on ease of use and breadth of gameplay all while tearing it up in races up to 12 players.Improved Actions- A new level of control; punch, duck and ram using a new control layout.Free-play- Race how you want by creating your own race tickets.Photo Mode- Snap your greatest victory or your most visceral crashes and share them with the world.New Rating System- It's not all about winning; it's also about how you perform.Bells and Whistles: Tunes and XMB FunctionalityAs was the case with the originalMotorstorm, the driving experience inPacific Riftcan not be separated from the music that accompanies it. The game comes with a thumping 40 song soundtrack and players will also have the ability to pipe in their own playlists saved to their PS3 the ability to access others saved on your PS3's Hard drive. In addition for players who want to relive their moments tearing across the island, the game also features PlayStation 3 XrossMediaBar (XMB) functionality and Photo Mode. XMB lets plays create movies of their races and access them from the PS3's main menu, while Photo Mode allows you to take snapshots while within a race.As you roll into theRift, expect a rich festival of off road racing, along with a host of game modes and rewards. It's brutal, dangerous, relentless, unpredictable and much more than a game -Motorstorm Pacific Riftis a way of life.", "price": 21.25, "imUrl": "http://ecx.images-amazon.com/images/I/61bFz8ndzmL._SY300_.jpg", "related": {"also_bought": ["B003O680ZY", "B000JLIYLC", "B00170BV6E", "B002ACFYUM", "B006JKARN0", "B003O65TXU", "B00149V3CU", "B003R7H5TC", "B0042R2BXQ", "B002BRZ7JE", "B004Q8L46G", "B007NUQIGK", "B001TORSHO", "B002689AQE", "B00JXDJVHS", "B000MUW98O", "B005T5OBWY", "B0000A3ZZF", "B0050SWSQQ", "B00275A7LI", "B002AQLQM8", "B003O6ECOM", "B00FQCT1ZW", "B009JBFF9C", "B0015AARJI", "B001UEN68I", "B000TP2V2G", "B003O6KWZK", "B006ZTHFPS", "B002MED6EO", "B000UC5ML0", "B002EJVTC8", "B000HXDKA2", "B000HCMR8E", "B000QL0T36", "B0050SX00Y", "B001QXNBNI", "B0057PERIY", "B0074LIKJQ", "B000FQBF1M", "B002BRZ744", "B0050SX1JO", "B002I0K7DK", "B002I0K6DG", "B003O6E67A", "B008PQU3E4", "B00BJ60LEY", "B000WJFZEA", "B002BH3N2C", "B000V1OUVI", "B007XYBUBE", "B007TYC8MI", "B001NY42J2", "B0093FO2TS", "B001G33V8S", "B00163LW7K", "B005DKMCCG", "B00104KCF8", "B004NRN5DA", "B0050SX3KG", "B00488PZ2S", "B00CTKHZH0", "B00170823O", "B0053B7ICO", "B003S55EWI", "B005185SDA", "B004K7AOYG", "B003GT8IL0", "B006JKAS16", "B0050SXX88", "B0056WJA4E", "B003URSUSE", "B008CP6MA2", "B005C7R950", "B002I0K5W8", "B008CP6RUW", "B0022TNO7I", "B002I0K622", "B000SQ5LQE", "B00IA2NYT4", "B0050SXLQC", "B005N4HBIW", "B001OAKV1S", "B004L5SJ4E", "B0053BSOD6", "B000K9OR4Q", "B0085CA8QG", "B003171CEW", "B002ELCUUG", "B004UPP5TC", "B002NN7AKU", "B008B3AVPC", "B002I0K5NC", "B008OQTR3S", "B0050SXI6K", "B000JLIXIG", "B004X56PWK", "B002I0J5FG", "B004EQCCI4", "B007A7UJ4S"], "bought_together": ["B003O680ZY", "B000JLIYLC"], "buy_after_viewing": ["B003O680ZY", "B000JLIYLC", "B006JKARN0", "B0042R2BXQ"]}, "salesRank": {"Video Games": 4388}, "categories": [["Video Games", "PlayStation 3", "Games"]]}