{"asin": "B0036R9YA6", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Network Adapters", "Powerline Network Adapters"]], "description": "The NETGEAR Powerline AV 200 Adapter Kit XAVB2001 includes everything you need to extend a high-speed network connection using just the built-in electrical wiring in your home. This kit allows you to create a network port wherever you have a power outlet, making it perfect for connecting HDTVs, Blu-ray players, DVRs, PCs, game consoles, and more. With this kit, you won't have to worry about weak wireless signals or unsightly cables running through your home anymore.Powerline AV 200 Adapter Kitfeatures:Two Powerline AV 200 Adapters lets you create a network port anywhere you have a power outletUp to 200 Mbps data speedsPlug and play installationSimple, push-button securityThe Powerline AV 200 Adapter Kit includes two Powerline AV adapters to get you started right away.View larger.The Powerline AV 200 Adapter Kit offers simple, plug-and-play installation.View larger.Plug-and-Play SimplicityThe Powerline AV 200 Adapter Kit includes two Powerline AV 200 adapters, which makes setting up a connection a snap. Simply plug one of the adapters into an available electrical outlet near your router and connect it to your router with an included Ethernet cable. Then plug the second adapter into any electrical outlet that's located near the device you want to network. Connect your device into the adapter and it will be connected to your network. It's as simple as that.You can easily create more network connections in your home by simply purchasing and installing additionalPowerline AV 200 XAV2001 adapters. The Powerline AV 200 is also compatible with all HomePlug AV products.Fast Network Connection for Streaming HD MediaThe Powerline AV 200 offers network connection speeds of up to 200 MBps, making it the ideal solution for network-intensive tasks such as making Internet phone calls, streaming HD video, playing online games, and transferring large files. The fast network speeds make the Powerline AV 200 great for devices such as the Slingbox, Xbox 360, Playstation 3, networked televisions, and more.And for added convenience, the Powerline AV 200 also features three different colored LEDs that give information on Power, Network Status, and Ethernet connections.Easy, Push-Button Security for Enhanced SafetyYou won't have to worry about hackers snooping in your private data when you're using the Powerline AV 200. By simply pushing a button, you'll enable an encrypted connection that keeps your sensitive information secure from prying eyes.The Powerline AV 200 Adapter Kit is a NETGEAR Green product, so you know you're getting a product. The Powerline AV 200 adapters automatically power down when not connected or not in use to conserve energy. The LEDs can be disabled to further save energy, and the packaging is manufactured with at least 95-percent recycled materials.Each adapter measures 3.38 x 2.63 x 1.57 inches (WxHxD) and is backed by a one-year warranty.What's in the BoxTwo Powerline AV 200 Adapters (XAV2001), two 2 meter Ethernet cables, setup CD and documentation.Related NETGEAR Products to Enhance Your Digital Entertainer Express ExperienceNETGEAR Powerline AV 200 Adapter (XAV2001)Extends a high speed Internet connection to any power outlet (2 units required)Ideal for connecting HDTVs, Blu-ray players, DVRs, PCs, and game consoles to your home network and the InternetUp to 200 Mbps data speedsCompact design with push-button security&nbsp;NETGEAR Rangemax Dual Band Wireless-N Gigabit Router (WNDR3700)Top-of-the line router, ideal for serious gamers, videophiles, and small businesses demanding high performanceDual-band Wireless-N operates simultaneously on 2.4 and 5.0 GHz frequencies for highest throughput speed and performance600 Mbps speed, with real throughput of over 350 MbpsNETGEAR Home Theater Internet Connection Kit (XAVB1004)Converts your home wiring into a high-speed networkTurns standard outlets into high-speed, entertainment-grade Internet connections for up to 4 devicesIdeal for connecting HDTVs, Blu-ray players, and game consoles to your home network&nbsp;NETGEAR Wireless Adapter for EVA9100 (EVAW111)Wireless adapter for EVA9100Wireless-N provides ultra-fast speed and performancePush 'N' Connect for easy set-upUSB adapter plugs right into port for quick and painless installationNETGEAR Powerline AV Adapter with Ethernet Switch (XAV1004)Ideal way to add high-speed network connections to your home without rewiringConverts standard electrical outlets into high-speed network connectionsConnects up to 4 devicesPerfect for connecting HDTVs, Blu-ray players, and game consoles to your home network&nbsp;NETGEAR Stora (MS2110)Centralize all your digital media in a single, secure locationShare music and photos with selected friends and familyEasily share your photos and movies with your favorite social networking siteStream music to your iPhone or other Web-enabled phone", "title": "NETGEAR Powerline AV 200 Adapter Kit", "price": 86.99, "imUrl": "http://ecx.images-amazon.com/images/I/31yQg%2B2vbtL._SX300_.jpg", "brand": "Netgear", "related": {"also_bought": ["B006OOKT3Y", "B0046SQ8VW", "B0036RH2U0", "B00000J1V5", "B000G9XC7S", "B00000JDF5", "B0036RFGKS"], "bought_together": ["B00000J1V5", "B00000JDF5"], "buy_after_viewing": ["B006OOKT3Y", "B00AWRUICG", "B00AWRUIY4", "B009WG6JF8"]}}