{"asin": "B000EW8074", "related": {"also_bought": ["B0012GWOFK", "B000EQ5HSK", "B002K46DEQ", "B0000BZLBQ", "B00DMS0GTC", "B00004ZCJM", "B0056XG47E", "B00009R9EO", "B0000BZLAC", "B001KELVS0", "B00004ZCI3", "B001CCAISE", "B006TZ8TZI", "B00009XVCZ", "B0002Y5WXE", "B0040JHVCC", "B000CLNHXY", "B004OVE188", "B002L60TTI", "B002NEGTTW", "B00BW6LW7G", "B0000BZLAD", "B00DMS0NGS", "B00007GQLU", "B004OR15LI", "B0080JH3YE", "B00013MSUQ", "B00018U7KO", "B00603RTBY", "B00603RW48", "B0037NX6JY", "B007M54E1M", "B0049XGNKK", "B00006I53W", "B007NDL56A", "B0033PRWSW", "B0048IW030", "B00004ZCJI", "B00DQXJM6Q", "B008BA2QNK", "B005AY9278", "B00I4DXHX2", "B004S8GUZO", "1118169123", "B00007B4DM", "B00595M3XS", "B0000BZL8H", "B000MVF1LA", "B00BCEJ0E0", "B007FH1KX2", "B002NEFL8W", "B004AQ95A6", "B007ORXEIW", "B00603RTC8", "B003Y30334", "B00CV9MM3G", "B0007Y794O", "B0000CBBNM", "B002K42W4Q", "B00C89ZVR8", "B002ZIMEMW", "B00007E7JU", "B006Y0YZZ6", "B0008G2GUS", "B00FP1BQ1Q", "B0083WYEHC", "B00BJ4CR5C", "B005DEHVC8", "B001UE6N8S", "B00393THEK", "B00009R6UI", "B0007WK8KS", "B000I1X3W8", "B00DMS0LCO", "B00FAP0ZOG", "B00K899B9Y", "B009XHFHEA", "B0039VYN1Y", "B00009R6UJ", "B007NDL54C", "B00C8YFBQY", "B00IAYFCYC", "B00AA48DC8", "B009IYBR56", "B004TJ6JH6", "B0045JAJR6", "B0000BZL68", "B00BXA7N6A", "B000BH5OW6", "B0009K7CZC", "B00HS8ZFXO", "B001TZUS98", "B0001G6U3Y", "B002WE4H8I", "B0002Y5WZC", "B00JWLUQYI", "B0043FAKPS"], "bought_together": ["B0012GWOFK", "B0000BZLBQ"], "buy_after_viewing": ["B0000BZLBQ", "B00007E7JU", "B003A6H27K", "B0002Y5WXE"]}, "title": "Canon EF-S 17-55mm f/2.8 IS USM Lens for Canon DSLR Cameras", "price": 879.0, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41E8KPR74HL._SY300_.jpg", "brand": "Canon", "categories": [["Electronics", "Camera & Photo", "Lenses", "Camera Lenses", "Digital Camera Lenses"]], "description": "Designed to meet consumer demands for a fast EF-S zoom lens, the EF-S 17-55mm offers image quality on par with Canon's highly regarded L-series lenses. The lens features a large circular aperture that produces a shallow depth of field, creating background blur that draws special attention to the photographic subject. The lens construction, meanwhile, includes UD and aspherical elements that deliver impressive image quality throughout the entire zoom range. And thanks to the Image Stabilizer lens groups--which shift to compensate for camera shake--the image appears crisp and clear on the image plane, eve in dim light. Finally, the lens offers a ring-type ultra-sonic monitor (USM), inner focusing, and new AF algorithms to help achieve autofocus quickly and quietly, along with full-time mechanical manual focusing that makes it possible to manually adjust the focus even in AF mode. As with all Canon lenses, this lens carries a one-year warranty.Focal length: 17-55mmMaximum aperture: f/2.8Lens construction: 19 elements in 12 groupsDiagonal angle of view: 78 degrees (at 30 feet) to 27 degrees (at 50 feet)Focus adjustment: AF with full-time manualClosest focusing distance: 1.15 feetZoom system: 5-group helical zoom (front group moves 27mm)Filter size: 77mmDimensions: 3.3 inches in diameter, 4.4 inches longWeight: 22.8 ouncesThe EF-S 17-55mm f2.8 IS USM offers image quality on a par with Canon's highly regarded L-series lenses. It has a large maximum aperture which, combined with higher shutter speeds, can minimize subject motion blur. Shallow depth-of-field separation of a subject from its background is much easier to achieve and the f2.8 maximum aperture allows a bright finder and extremely precise focusing with f2.8 compatible AF sensors. The internal stabilization has a sharpness benefit equivalent to a three-stop faster shutter speed, making this lens outstanding in low-light situations. Smaller and lighter than lenses of similar specifications, the EF-S 17-55 mm f2.8 IS USM lens has a 35mm equivalent focal length of 27-88mm and is compatible only with the EOS 30D, EOS 20D, EOS Digital Rebel XT, and EOS Digital Rebel SLRs. To meet user demands for a fast EF-S zoom lens, Canon has specially designed a new lens with a large aperture of f/2.8 for select Canon Digital SLR cameras. The large circular aperture produces a shallow depth-of-field, creating background blur that draws attention to the photographic subject. The lens construction includes UD and aspherical elements, which deliver impressive image quality throughout the entire zoom range. Image Stabilizer lens groups shift to compensate for camera movement so that the image appears steady on the image plane, ensuring clear, crisp images, even in dim light. With a Ring-type USM, inner focusing and new AF algorithms, this lens achieves autofocus quickly and quietly, and with full-time mechanical manual focusing, manually adjusting the focus is possible even in AF mode."}