{"asin": "B0001VNNE8", "description": "Experience the freedom to play anywhere you want and eliminate cable clutter in your living room. The second generation Logitech Cordless Action Controller delivers the performance, convenience, and comfort you've been looking for. It's engineered to be small and light, yet it still uses Logitech's highly reliable 2.4 GHz radio frequency technology to deliver precise control with no lag.Logitech 2.4 GHz radio frequency technology: Highly reliable, lag-free performance. Enjoy precise control with no cords to get in the wayRange of 30 feet: Play anywhere you want in your living room, bedroom, dorm room, or wherever you gameSmall and light gamepad design: Experience the same basic comfort and button access you're used to with a standard corded controllerOnly requires 2 AA batteries (included): We engineered it to be smaller and lighter, yet it still provides over 50 hours of game play, even with vibration onMini receiver: Plug it directly into console, neat and tidyFull set of gamepad controls that are Sony Dualshock2 compatible D-pad, mini-joysticks, action buttons, triggers, and Start, Select, and Mode buttons...everything you need, 100-percent compatibleSleep mode: The gamepad goes into a sleep mode after 5 minutes of inactivity to preserve battery lifeTwo vibration feedback motors: Feel like you're part of the action: all the hits, crashes, explosions, and moreVibration on/off button: Turn off vibration feedback when you don't need it or when you want to extend battery life even furtherMode/Status lights on gamepad and receiver: An easy visual indication about what mode the gamepad is in and information about the connection between the gamepad and receiver. Also provides \"low battery\" indicationQuality construction that stands up to serious punishment: As if you'd expect anything else from LogitechWhat's in the Box2.4 GHz cordless controller, 2.4 GHz mini-receiver, user documentation, and 2 AA batteries.", "price": 10.68, "imUrl": "http://ecx.images-amazon.com/images/I/41W3NRY3QCL._SX300_.jpg", "related": {"also_bought": ["B00004YRQA", "B00005MDZD", "B000TLU67W", "9629971372", "B0015ACX3Q", "B00006F2EP", "B0038LE5UE", "B002BWS5QG", "B000F5IH2I", "B0009I6S0O", "B001MW91IW", "B00004YRQ9", "B004S3KB6S", "B00005NUIZ", "B00005BOSF", "B00005TNI6", "B0006TQGBM", "B0009A4EVM", "B000066TS5", "B0013OM528", "B0045L3SNQ", "B0000E5U6N", "B00006Z7HR", "B0000296O5", "B000RATCJI", "B0032GTMEE", "B0009A4EV2", "B00005CF9L", "B00KWFCU4M", "B00095LEC4", "B00006LEM9", "B000MIXFWA", "B0002Y2XXQ", "B00GLW4016", "B00008URUA", "B000069D39", "B00006JN5H", "B0015MMN6G", "B001G3B0HC", "B00000JRSB", "B000G82R20", "B000IZAQD8", "B001UIG6M2", "B0009351R0", "B00012LZXS", "B004E0I8II", "B001C6GVI6", "B0002IQC8E", "B0007DFIK2", "B002BRYIJY", "B0009O7HVM", "B000A32O4W", "B0002A6CPA", "B00BY0G0YU", "B00006FWUU", "B00005R5PO", "B00005LOXE", "B00005MA97", "B000V1N7L2", "B0007PIEB0", "B000MUU5MG", "B000066TS3", "B00008XL0A", "B00024W1U6", "B0000CDZBC", "B000095ZH5", "B000K9OP2A", "B0000A0MDV", "B000G7X5P4", "B000NGWFX6", "B000IVIP7G", "B001TK9SEE", "B000935256", "B000051QDD", "B000GPXS9Y", "B002CZ7FW2", "B00066LGEM", "B000G7X5MM", "B00006B5T8", "B000094M47", "B0083LSCZ8", "B00007LV7Y", "B000F7B516", "B000094M46", "B0002CHIUQ", "B00008O0YD", "B001Q13BIU", "B0001Y7404", "B0001A86EG", "B002I0J4AM", "B00061HHRC", "B002J9QIWY", "B004C4U1VI", "B000B69E9G", "B0015Z1I4G", "074401543X", "B00005OLX1", "B0000631WB"], "buy_after_viewing": ["B004S3KB6S", "B002BWS5QG", "B00004YRQ9", "B0015ACX3Q"]}, "salesRank": {"Video Games": 4149}, "categories": [["Video Games", "More Systems", "PlayStation 2", "Hardware", "Accessories"]]}