{"asin": "B00002CF9M", "description": "InDiablo II, players return to a world of dark fantasy. As one of five distinct character types, players explore the world ofDiablo II, journey across distant lands, fight new villains, discover new treasures, and uncover ancient mysteries. Since the beginning of time, the forces of order and chaos have been engaged in an eternal struggle to decide the fate of all creation. That struggle has now come to the mortal realm, and neither man, demon, nor angel will be left unscathed. Diablo, lord of terror and youngest of the three prime evils, awakes from his long sleep beneath the dark earth. Setting in motion a grand scheme to free his exiled brothers, Mephisto and Baal, Diablo takes control of the small western kingdom of Khanduras. Working from deep within the ancient catacombs beneath the town of Tristram, Diablo grips the entire populace in a blanket of fear and paranoia. Ultimately, as even Khanduras's good King Leoric falls under Diablo's wicked power, a lone hero arises to challenge the darkness that engulfs the land. After plumbing the hellish depths of the labyrinth under Tristram, the nameless hero finally confronts the lord of terror himself. Knowing full well that Diablo's spirit can never be truly destroyed, the hero makes the noblest sacrifice of all--casting his soul and his very sanity aside, he takes the spirit of Diablo into himself, hoping that his own strength of will can contain the demon within. The hero doesn't realize that his selfless act will not only ensure Diablo's victory, but will also irrevocably damn his soul for all time.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/510DCD2K89L._SY300_.jpg", "related": {"also_bought": ["B000098XJQ", "B00005A3I8", "B0007YBJ1S", "B00001IVBL", "B0002BQN7Q", "B00178630A", "B005NH6J7S", "B00000DMAI", "B00001IVLY", "B00001LCDM", "B000067FDW", "B00001QEQA", "B00001IVRD", "B00009ECGK", "B00005V9Q1", "B00005BV7N", "1566868912", "B001B5U80K", "B00D7NQP9M", "B00005N9A7", "B000FGA1US", "B000ZKA0J6", "B000CHP9SY", "B00004TSXC", "B002I0HKIU", "B001E2I4H4", "B0050SZC5U", "0744013100", "B00008OLCI", "B003O6E9EK", "B001VJ4DHK", "B00354NAYG", "B001HL3Q70", "B0002L88HE", "B0000695GX", "1608870634", "B0050SYY5E"], "bought_together": ["B000098XJQ", "B0007YBJ1S"], "buy_after_viewing": ["B0002BQN7Q", "B005NH6J7S", "B00178630A", "B00005BV7N"]}, "salesRank": {"Video Games": 11440}, "categories": [["Video Games", "Mac"], ["Video Games", "PC"]]}