{"asin": "B003B2GTY0", "related": {"also_bought": ["B00424MW42", "B00B7O3FE6", "B00HNZV31U", "B0047RASLI", "B003TP03TQ", "B00JFBZ0GY", "B00F2IPI16", "B00424MW56", "B004EKH3MA", "B00424OYS4", "B00JFBZ29E", "B0047RERN8", "B006GGTUQM", "B00JFBZ5KK", "B00I0GAC3Q", "B0045DPC88", "B003B28KBK", "B00424MWDS", "B004U7JYXS", "B0000C73CQ", "B00JFBYYCK", "B00AFTDWVA", "B00AVYM5YY", "B008GVXL1A", "B008GVVUFE", "B003R1149U", "B003BWYDTI", "B008GVXKUW", "B003VKR34C", "B002JIN1IO", "B002OKFAM2", "0689839561", "B009ZM9R4O", "B001C3CKRA", "B00IS6EFEK", "0399161945", "B0049U49PY"], "bought_together": ["B00424MW42"], "buy_after_viewing": ["B004U7JYXS", "B00424MW42", "B00AWKJPOA", "B0000C73CQ"]}, "title": "Polaroid 300 Instant Camera PIC-300L", "price": 69.0, "salesRank": {"Camera &amp; Photo": 94}, "imUrl": "http://ecx.images-amazon.com/images/I/51en7qSsPcL._SY300_.jpg", "brand": "Polaroid", "categories": [["Electronics", "Camera & Photo", "Film Photography", "Film Cameras", "Instant Cameras"]], "description": "Polaroid Pic-300 Instant Camera FeaturesThis camera allows you to take pictures you'll see developed in front of your eyes in minutes. It's the modern version of the classic Polaroid instant camera you've grown to love and it's just in time for your wedding, anniversary, birthday or other big event! The Polaroid Pic-300 is great for guest books when you want to put a face on your special day, registration events or any other time when you want quick results you can share within minutes. The camera prints pictures about the size of a business card (1.8 inches x 2.4 inches) on paper that's 2.1 inches x 3.4 inches.Easy and fun to useTo use, simply snap, print, and share your photos - that's it! Take it on the go so you can send friends and family home with pictures of their own within minutes. The film counts down like a disposable camera so you know how many pictures are left before you change the film.How instant photos workThe Polaroid PoGo Zink Photo Paper produces high quality, full-color glossy prints of your favorite photos without a printer and even without ink. The paper features billions of tiny dye crystals embedded within the Zink Paper that are activated by precise heat pulses through the thermal print head within the camera. It's an advanced composite material with cyan, yellow, and magenta dye crystals embedded inside and a protective polymer overcoat layer outside. When heat is applied in just the right way, full color images appear like magic on the paper. The differing paper means you will have a bright and sharp image with just a camera and photo paper - no ink cartridges or ribbons needed.Each photo print is dry-to-the-touch, water resistant and features an adhesive back. You can stick your photos to any surface without damaging the photo or the surface. Zink Paper is the heart of ZINK Zero Ink Technology. For easy-to-use photo paper that prints vivid images, the Polaroid PoGo Zink Photo Paper has arrived. You must use Polaroid instant color film only. A film pack includes one black film cover and 10 film sheets. Do not remove the film from its inner bag until immediately before loading it into the camera and keep it out of direct heat.Taking a picture in all light settingsWhen the camera isn't used for 5 minutes while the power was turned on, all the lamps automatically turn off and the camera enters an energy saving state. The camera can be reset to the, \"power on\" state by hitting the shutter release button or pushing and pulling the lens section. The Pic-300 uses four AA batteries (must be the same type and size of alkaline batteries).What's in the box:Pic-300 cameraWrist strap4 AA batteriesNote:Film not included"}