{"asin": "B00005N7YR", "description": "InMedal of Honor: Allied Assault, you play as Lieutenant Mike Powell, member of the famed 1st Ranger Battalion. Following your recruitment by the Office of Strategic Services (OSS), you'll battle through more than 20 challenging levels based on historical military campaigns of World War II. Set during the most trying years of the war--1942 to 1945--Medal of Honor: Allied Assaultimparts a sense of the courage it took to survive the landings at Normandy, the assault at Arzew, a rendezvous with the resistance outside the village of St. Lo, and the push through the heavily defended border of Germany to take the bridge at Remagen.Staying true to the gameplay features that madeMedal of Honorone of the most acclaimed bestselling games of 1999,Medal of Honor: Allied Assaultbuilds on that success, adding new player weapons, interactive Allied vehicles such as Sherman tanks and M3 Half Tracks, smarter enemy AI, and artillery strike calls. Fully realized 3-D worlds utilize the powerfulQuake IIIengine. The game also features an original orchestral score byMedal of Honorcomposer Michael Giacchino and sound effects from the award-winningMedal of Honorsound design team at EALA.InMedal of Honor: Allied Assault, get access to more than 21 historically accurate World War II-era weapons, including Thompson submachine guns, Mark II frag grenades, .50-caliber mounted machine guns, flamethrowers, and \"sticky bombs.\" Battle more than 18 enemy vehicles, including the Tiger Mark I heavy tank, Stuka dive-bombers, and V2 rockets, and encounter 22 different enemies, including Wehrmacht snipers, Kradsch&uuml;tzen motorcycle troops, and Gestapo officers. Assault enemy units alone and as part of a crack military squad. Multiple online options including team combat and traditional last-man-standing modes.", "price": 7.78, "imUrl": "http://ecx.images-amazon.com/images/I/51DXQVCC2CL._SY300_.jpg", "related": {"also_bought": ["B0001OU19K", "B000PS1HMM", "B00006F7RJ", "B000B63RSA", "B0000C6EB4", "B000922E0S", "B000067O0Q", "B001E6DG6Y", "B007H2V9W2", "B00022Q0RI", "B002ZJPYHS", "B0000A1VER", "B000KIBABA", "B00009V435", "B0001AO028", "B001AWBYRA", "B00006C2HA", "B001CC8UBG", "B0002V3CPW", "B0001AO01Y", "B008OQTUKS", "B00503EAG2", "B0002AL1Z6", "B001ASJIRM", "B0050SZ0SY", "B0001OK7V2", "B00095LEC4", "B003JVF728", "B000E2D3LC", "B00004U8K2", "B000Z3VI3K", "B00008JODN", "B0009Q1IE2", "B0006SL93I", "B002BXKJA0", "B007XVTR12", "B0002Z22OU", "B000089SBB"], "bought_together": ["B0001OU19K", "B000PS1HMM"], "buy_after_viewing": ["B001E6DG6Y", "B0001AO028", "B000PS1HMM", "B0001OU19K"]}, "salesRank": {"Video Games": 17301}, "categories": [["Video Games", "PC", "Games"]]}