{"asin": "B00H8O8CMO", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Network Adapters", "USB Network Adapters"]], "description": "OverviewRocketek Bluetooth 4.0 Adapter is an Ideal Solution to transfer File, Audio or Voice Wirelessly for your Desktop and Laptop. Lets you communicate wirelessly with Bluetooth devices such as cell phones, PDAs, mice, keyboards, Tablet, Speaker, Headset, Headphone etc.It Achieved with CSR8510 Class 2 Low Energy Controller fully Content with Bluetooth 4.0 Specification. Advanced Audio Processing Exclusive for Bluetooth 4.0 Voice Quality Enhancing allow to Process AAC Audio Losslessly as well as Process MP3, WAV, APE or FLAC. Plug and Play Enabled Fingernail Size Micro Adapter allow to Plug and Forget.Supported Operating Systems* Windows XP, Vista, and Windows 7 (with included CSR drivers.)* Windows 8 (with built-in drivers; CSR drivers not needed for most common profiles.)* Linux kernels 3.0.34 and higher, with open source stack (may have limited functionality vs Windows.)Supported Bluetooth DevicesWireless Bluetooth keyboards, mice, headsets, speakers, printers, modems, serial devices, phones, and more.Package Include:1 x Rocketek Bluetooth 4.0 adapter1 X Drivers CDNote:- Windows 8 automatically finds and installs the latest drivers when the RT-BT4 dongle is plugged in for the first time.- Windows 7 / Vista / XP users need to use the included CD (or online links) to install the drivers.-If your computer system is Window 7, make sure have\"Microsoft .NET Framework 4.0\"before you install the CD driver.", "title": "[Bluetooth 4.0] Rocketek Low Energy USB Bluetooth Adapter - Support Windows 8, 7, XP, Linux; Classic Bluetooth and Stereo Headset Compatible usb 4.0 dongle", "price": 9.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/419KUdDFI8L._SY300_.jpg", "related": {"also_bought": ["B00DDH4TYA", "B00BCU4TZE", "B009ZIILLI", "B00HQCINKE", "B007MKMJGO", "B00I027GPC", "B0090I9NRE", "B00ITBF2FK", "B00HTPHK5W", "B003MTTJOY", "B007GFX0PY", "B00EW3WS9M", "B005Z5HT2M", "B00DOP3NPW", "B00H0DNUB6", "B00AKO7XOW", "B009OBCAW2", "B00FNQJQZQ", "B000NK5ZZC", "B0002E53O2", "B00F25Z0FS", "B00B20OYUY", "B008IFXQFU", "B0099SMFP2", "B00EDPW0LA", "B00DQFGH80", "B000068NYH", "B003XIJ3MW", "B004ISD7T6", "B0099SMFVQ", "B00BQ4F9ZA", "B006M7IDTA", "B00DJUU0KS", "B00B3P15M8", "B00AVLOHJ8", "B00D2CN730", "B00E1GGE40", "B00EIQTOFY", "B00BALK9CM", "B0007T27H8", "B003VX3S3Y", "B000068O4H", "B005DLDO4U", "B003H4QPJQ", "B003E48ERU", "B00FZPDG1K", "B00DYQYLQQ", "B007GMPZ0A", "B00B46XUQU", "B002TLTGM6"], "bought_together": ["B009ZIILLI", "B003MTTJOY"], "buy_after_viewing": ["B005Z5HT2M", "B007Q45EF4", "B009ZIILLI", "B007GFX0PY"]}}