{"asin": "B00427ZLS8", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "High speed operation, exceptional low light performance, excellent image quality and sophisticated features mark the 12.1-megapixel Coolpix S8100, with advanced CMOS sensor technologies. The optical 10x Zoom-Nikkor ED glass lens covers 30-300mm, and the camera's speedy start-up, fast autofocus, quick shutter release, superior low light performance and high-speed continuous shooting (capture 5 shots in one second) to ensure capture of memorable moments.The versatile Coolpix S8100 offers Optical VR Image Stabilization, high ISO sensitivity up to 3200, a new flash control system, full HD 1080p movie recording with stereo sound and a 3- inch Ultra-High Resolution (921,000-dot) Clear Color Display for bright, sharp image viewing and sharing.Nikon Coolpix S8100 HighlightsSuperior Image Quality12.1 -megapixel CMOS sensor for high speed operation and exceptional low-light performance.10x Wide-Angle Optical Zoom-Nikkor ED Glass Lens. Versatile 30-300mm lens ranges wide to capture landscapes, zooms in to get close to the action. In the Nikkor tradition of precision optics, the high-quality ED glass lens delivers superb color and razor-sharp results.4-way VR Image Stabilization SystemOptical VR Image Stabilization by lens shift minimizes the effects of camera shake.Motion Detection automatically detects moving subjects and adjusts shutter speed and ISO to compensate for camera shake and subject movement.High ISO up to 3200 for optimum results when shooting in low light or photographing fast-moving subjects.Nikon's Best Shot Selector (BSS) automatically takes up to ten shots while the shutter is pressed, then selects and saves the sharpest image.EXPEED C2 continues to expand the possibilities of photography with improved levels of image quality, fine detail and processing speed. Custom-optimized for each Coolpix model, Nikon's renowned digital image processing engine ensures outstanding images.Advanced Functions3-inch Ultra-High Resolution (921,000-dot) Clear Color Display for still images and movies that come alive with rich detail and improved contrast. The large LCD's wide viewing angle and antiglare coating make it easy to compose, view and share pictures.Advanced low light shooting capability.Shoot still images even while recording HD Movie. Creative ControlMode Dial for quick setting of key functions.ISO can be set as high as 3200.In-camera editing functions include Quick Retouch, and DLighting.Creative Slider allows adjustment of brightness, saturation and color.HD Movie RecordingFull HD (1080p) Movie with Stereo and HDMI Output, optical Zoom control and stereo sound recording. HDMI output allows easy incamera playback or convenient playback on HD-TV or computer. In-camera movie editing function also available. One-Touch record button for instant Movie recording.High Speed PerformanceUltra-fast start-up, autofocus and shooting.High Speed Shooting capture 5 shots in one second at full resolution.Sport Continuous Shooting to capture fast action (reduced image size)Shoot Slow Motion Movies up to 240 fps by selecting HS Movie mode (reduced image size)Subject Tracking automatically tracks a moving subject to ensure sharp focus.Convenient FeaturesSmart Portrait SystemSmile Timer automatically releases the shutter when your subject smiles.In-Camera Red-Eye Fix automatically corrects most instances of red-eye as you shoot. You may never see red-eye again.Face-Priority AF. Nikon's face-finding technology automatically detects up to 12 faces.Skin Softening smoothes skin tones at three different levels for optimal portraits; can be applied while shooting or during playback.Blink Warning alerts you if a subject has blinked.17 Scene modes including Scene Auto SelectorScene Auto Selector automatically recognizes the scene you're shooting and selects the most appropriate scene mode; offers six scene modes plus auto.Macro shooting as close as 0.4 inches.220 still shots (approx.) with supplied EN-EL12 Li-ion rechargeable battery.Supplied with AN-CP19 Strap; UC-E6 USB Cable; EG-CP16 Audio/Video Cable; EN-EL12 Rechargeable Li-ion Battery; EH-68P Charging AC Adapter; COOLPIX Software Suite CD-ROM", "title": "Nikon Coolpix S8100 12.1 MP CMOS Digital Camera with 10x Optical Zoom-Nikkor ED Lens and 3.0-Inch LCD (Black)", "price": 280.99, "salesRank": {"Camera &amp; Photo": 1206}, "imUrl": "http://ecx.images-amazon.com/images/I/41Ltli312fL._SX300_.jpg", "related": {"also_bought": ["B0012W7HQK", "B0026T3TYW", "B0040V08M0", "B002GEVZPC", "B005IGVXO8", "B0042RUSY0", "B001DO2XWA", "B005XEE5IG", "B004B738PW", "B003VNKNEQ", "B004H7NNG0", "B004VRQNS6", "B0073HSHJY", "B0014VY28A", "B00CV9MHG8", "B0036ORZE6"], "bought_together": ["B0026T3TYW", "B0012W7HQK"], "buy_after_viewing": ["B005IGVXO8", "B003VNKNF0", "B005HX15C2", "B001DO2XWA"]}}