{"asin": "B000V5P90K", "related": {"also_bought": ["B000BNY64C", "B001G9TYHE", "1598635107", "B003MACYGS", "B000V5K3FG", "B000W05O5O", "B00007E7JU", "0470260440", "B00006I53S", "B00K899B9Y", "B003DWON9Q", "B001FO4QHI", "B00065ANY2", "B005BSKKGU", "B001EQ4BVI", "B002NO7Q26", "1906672164", "B002NEGTT2", "B0009B05H8", "B005DECJBQ", "B002WP0VKU", "B004UC9HSA", "B00GGM6LRW", "B003DWP29G", "B000YZGCIU", "B0014YZH9A", "B002KDS2BY", "B000W0BC7I", "B003WGP0B8", "B005EVPZJQ", "B003CIBC36", "B0049HCSM8", "B0001GMIOE", "B00065ANYW", "B002K42W4Q", "B001LMQM3U", "B0030UL7IG", "B000U92PHW", "B00004XOM3", "B00007GQLU", "B002K3Z3E8", "B001ET6QFY", "B0007WK8MQ", "B008NF8BKK", "B00139WVZE", "B002WE4H8I", "B00551636O", "B00004ZCJI", "B00080SBD0", "B001NXDB4A", "B00009XVCZ", "B008UGMLWQ", "B00009R6WW", "B0002Y5WXO", "B001CBKJGG", "B00005K47X", "B00004ZCJG", "B00894YP00", "B002K42W50", "B00004ZCJL", "B00009R6TA", "B00009R6WT", "B005FDWE4C", "B001NS0OZ4", "B002NEGTTW", "B00166EUI0", "B004LEAYXY", "B001DKO7R8", "B002VPE1WK", "B00009R6WU", "B005HWC6PI", "B00009R6WO", "B0011NVMO8", "B00004ZCJK", "0817439390", "B002NEGTSI", "B007AAP15W", "B0002Y5WZM", "B0093HGDVG"], "bought_together": ["B00007E7JU"], "buy_after_viewing": ["B000BNY64C", "B00007E7JU", "B001FO4QHI", "B002WE4H8I"]}, "title": "Canon EOS 40D 10.1MP Digital SLR Camera (Body Only)", "price": 888.99, "salesRank": {"Camera &amp; Photo": 3583}, "imUrl": "http://ecx.images-amazon.com/images/I/51gt2JGO6oL._SX300_.jpg", "brand": "Canon", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]], "description": "Building on the success of Canon's perennially popular \"prosumer\" EOS 20D and 30D models, the EOS 40D advances the state-of-the-art for mid-range digital SLR cameras, making it a natural first choice for advanced amateur photographers and entry-level professionals, and an ideal second body for more established photo pros. Indeed, given the level of feature upgrades and improvements, technological wizardry, and user-requested creative controls, the Canon EOS 40D SLR's \"prosumer\" appellation may refer more to its accessible price point than to the exceptional quality, clarity, and resolution of the images it creates.From the camera's newly enhanced, 10.1-megapixel CMOS imaging sensor (designed and manufactured by Canon) and its proprietary and super-efficient DIGIC III image processor, to its completely redesigned autofocus sensor and fast, 6.5 frame-per-second (fps) continuous shooting capability (for bursts of up to 75 Large/Fine JPEGs or 17 RAW images), the EOS 40D SLR puts the fun in functionality and makes serious photo business a positive pleasure.The 40D is capable of shooting 6.5 frames per secondIndeed, at 6.5 fps, no digital SLR in the EOS 40D mid-range class and price category has so high a continuous shooting capability, making it ideal for shooting--and actually capturing--speed-sensitive outdoor and wild-nature shots as well as a wide variety of action and sports scenes. The speed of the EOS 40D SLR comes from Canon's balanced combination of its latest processor, DIGIC IIII, DDR SDRAM high-speed memory, four-channel-per-line sensor readout, and two separate motors for shutter and mirror operation.Canon EOS 40D HighlightsDisplay's the ThingThe most easily visible upgrade on the EOS 40D Digital SLR is the camera's larger 3.0-inch LCD screen (compared with the EOS 30D's 2.5-inch monitor). Still, size is only the beginning of the difference between these two cameras' displays. In order to increase viewing ease in outdoor conditions such as bright sunlight, Canon raised the brightness level of the EOS 40D camera's 230,000-pixel LCD screen, broadened the color gamut, and narrowed the viewing angle from 170 degrees to a still wide 140-degree perspective in all directions. An added advantage of the larger-sized display is the ability to use a larger font size for text, making it easier to read setting and menu options on the screen. The camera's menu is organized in the same tabbed format as the EOS-1D Mark III Digital SLR.Canon extends its \"ease-of-reading\" policy to the EOS 40D SLR's viewfinder as well. The upgraded viewfinder increases optical magnification from 0.90x to 0.95x, expands the viewing angle from 251 degrees to 264 degrees and raises the eye point from 20mm to 22mm.A rugged magnesium alloy exterior delivers enhanced durabilityEnhanced DurabilityRecognizing the often rigorous shooting conditions encountered by professional and advanced amateur photographers, Canon design engineers made the EOS 40D SLR's magnesium alloy exterior even more ruggedly dependable than its predecessors with upgraded dust- and weather-resistant construction, particularly around the camera's connection ports, battery compartment, and single-slot compact flash (CF) memory card door. Should the user inadvertently open the compact flash card door while the camera is writing to the card, a warning will pop up on the LCD screen and an open door \"alarm\" will sound, but the image(s) will continue writing to the memory card without interruption. The EOS 40D SLR also retains many of the outstanding features of the EOS 30D model, such as its fast 0.15-second initial start-up, its extremely durable shutter (rated up to 100,000 cycles), its top shutter speed of 1/8000 second, and 1/250 maximum X-sync flash shutter speed setting.Improved Image QualityAlthough it is based on the image sensor used in the EOS Digital Rebel XTi, the EOS 40D Digital SLR's 10.1-megapixel CMOS APS-C size image sensor has been significantly improved thanks to the use of larger microlenses over each pixel to reduce noise and expand sensitivity up to ISO 3200. The EOS 40D retains the model 30D camera's 1.6x focal length conversion factor (compared to full-frame digital image sensors or 35mm film) and is compatible with the full line-up of Canon EF lenses as well as the Company's expanding selection of high-quality, affordable EF-S lenses created specifically for Canon digital SLRs with APS-C size image sensors.Adding to the improved virtuosity of the images captured by the EOS 40D SLR is the camera's 14-bit Analog-to-Digital (A/D) conversion process. Able to recognize 16,384 colors per channel (four times the number of colors recognized by the EOS 30D SLR's 12-bit conversion capability), the EOS 40D camera is able to produce images with finer and more accurate gradations of tones and colors. The EOS 40D also incorporates the optional Highlight Tone Priority and High-ISO Noise Reduction functions first introduced earlier this year with the EOS-1D Mark III Professional Digital SLR.DIGIC IIIDIGIC III is the latest generation of Canon's proprietary image processing engine. DIGIC III technology ensures that the fine details and natural colors of the images are optimally recorded and, as an added bonus, is also responsible for the EOS 40D SLR's high-speed performance, faster signal processing, and even its efficient energy consumption.sRAWIn addition to retaining the RAW image capture capabilities of its predecessors, the EOS 40D SLR now offers a more manageable \"sRAW\" recording format. In sRAW mode, the number of pixels is reduced to one-fourth that of a standard RAW image and the file size is cut in half, while retaining all of the flexibility and creative possibilities associated with full-size, conventional RAW images.9-point AF ensures precise focusingImproved Autofocus and Exposure ControlWhile the EOS 40D SLR maintains the nine-point wide area AF coverage first introduced on the EOS 20D camera, Canon has made significant improvements to its speed, precision, and functionality, minimizing subject recognition problems in the process. The EOS 40D camera's completely redesigned nine-point AF sensor provides cross-type AF measurement at all nine focusing points for maximum apertures up to f5.6, and for the first time in any EOS camera, the central AF point offers enhanced precision for both vertical and horizontal subject contrast when using EF or EF-S lenses featuring maximum apertures of f2.8 or faster. AF calculation speed with the EOS 40D camera is 30 percent faster than the EOS 30D model.The Canon EOS 40D Digital SLR retains the same 35-zone metering sensor as its predecessor. Available patterns include Evaluative metering, which is linked to all AF points and is set automatically in the Basic Zone modes, Centerweighted average metering, Partial metering, and Spot metering, covering approximately 9 percent or 3.8 percent of the viewfinder at center, respectively. The camera's E-TTL II autoflash and 12 exposure control modes (11 AE modes plus manual) are also unchanged from the EOS 30D SLR model. However, as a result of consumer input, Canon has added three Custom exposure modes. As an added convenience, particularly for wireless flash operations, users can adjust the flash settings of the Canon Speedlite 580EX II directly from the camera.The Canon EOS 40D camera offers ISO speeds from ISO 100 to ISO 1600 in 1/3-stop increments. Users can also opt for a high-speed setting of ISO 3200. For the first time in any EOS camera, the 40D model offers Auto ISO capability in Creative Zone exposure modes. This valuable new feature adjusts the ISO speed to the optimal setting based on low light or shaky shooting conditions. Additionally, the EOS 40D provides full-time display of the active ISO speed setting, both in the viewfinder as well as on the top LCD data panel.The Canon EOS 40D Digital SLR is also the first camera in its class to offer two interchangeable focusing screens in addition to the standard precision matte screen. Users can opt for a grid-type focus screen that makes it easier to verify horizontal or vertical alignment while determining image composition, as well as the Super-Precision Matte focusing screen that makes it easier to grasp the \"sweet spot\" of manual focusing when using a lens with a maximum aperture of f2.8 or faster.Enhanced Live View with gridEnhanced Live ViewPreviously the province of the EOS-1D Mark III DSLR (one of Canon's top-tier professional cameras), the Live View function now gives EOS 40D camera users an expanded and exceedingly convenient and comfortable set of shooting options. By permitting the framing and capturing of subjects using the camera's LCD screen instead of the viewfinder, the shooter gains a 100 percent field view to more easily achieve the desired composition. A new Custom Function on the EOS 40D allows autofocus during Live View by pressing the camera's AF-ON button. At that point, the reflex mirror goes down and AF is carried out in the normal way. Letting go of the AF-ON button resumes Live View functions. Also, in the Live View shooting mode the user can magnify the image by five or ten times in order to ensure that the shot is optimally focused. Live View is at its best during tripod shooting--particularly for close-up photography where precise focusing is imperative. As a side benefit, the Live View shooting mode helps to reduce vibration by lifting the reflex mirror out of the optical path well in advance of the exposure, improving image quality at slow shutter speeds. A new electronic 1st-curtain shutter function in Live View mode reduces release time lag and operational noise even further to avoid spooking wildlife or disturbing people nearby with unwanted camera sounds. Additionally, as the release time lag is miniscule, even instantaneous movements like a bird taking flight can be readily captured.EOS Integrated Cleaning SystemFirst introduced on the EOS Digital Rebel XTi camera, the EOS Integrated Cleaning System is a prime example of trickle-up technology and is now becoming a standard feature on all new EOS Digital SLRs. The camera's Self-Cleaning Sensor Unit uses ultrasonic vibrations to literally shake dust particles off of the low-pass filter in front of the sensor each time the camera is powered up or shut down. Users also have the option of engaging the \"clean now\" function at will or bypassing it altogether. Additionally, the EOS 40D SLR's manual sensor cleaning function raises the mirror and allows users to clean dust that has stuck to the low-pass filter. Dust that has been shaken or blown loose is then trapped by adhesive at the base of the sensor unit housing, preventing the problematic particles from reattaching themselves to the filter when the camera moves. The second part of the cleaning system is a software solution that maps the location of any spots that may remain on the sensor. The mapped information is saved as Dust Delete Data and attached to the image file. Subsequently, the offending dust information is subtracted from the final image during post processing with a compatible personal computer, using the supplied Digital Photo Professional software.Improved SoftwareAmong the most valuable features of the Canon EOS 40D Digital SLR is its compatibility with Canon's Picture Style Editor (PSE) 1.0 software. With PSE, shooters can actually design the look of their photographs by inputting their own preferred style, color, and tone curves. The EOS 40D Digital SLR also ships with the latest versions of Canon's powerful software applications, including Digital Photo Professional 3.1 and EOS Utility 2.1, which now support the camera's Remote Live View and Dust Delete Data functions, as well as incorporating a broad range of additional improvements designed to improve image quality and speed up workflow. Also included are ZoomBrowser EX 5.8 and ImageBrowser 5.8 for easy browsing, viewing, printing, and archiving with compatible computer operating systems, including Microsoft Windows Vista and Windows XP, as well as Mac OS X.Accessories (Not Included--Must be Purchased Separately)New system accessories for the EOS 40D SLR include the redesigned high-capacity Battery Grip BG-E2N, which facilitates high-volume shooting and easier vertical shooting. Compatible with up to two BP-511A battery packs or a set of six AA-size batteries, the battery grip approximately doubles the number of shots that can be taken, compared with the battery power of the EOS 40D SLR alone. The BG-E2N grip features new sealing material around the battery compartment to better resist water and dust. The new model replaces the original BG-E2 grip and is compatible with the EOS 20D, 30D, and 40D models.Designed exclusively for the EOS 40D SLR, the new Wireless File Transmitter WFT-E3A permits wireless transfer and back-up, as well as remote control of the camera in Live View mode. It can also be connected to various GPS receivers or Hi-Speed USB 2.0 external storage devices such as convenient flash drives or high-capacity hard drives with much larger storage capacity than the memory cards in the camera for instant back-up as images are captured. Compact and affordable, the WFT-E3A wireless transmitter also doubles as a vertical grip and requires its own BP-511A battery pack in addition to the battery installed in the camera body.What's in the box:EOS 40D digital SLR body, eyecup Eb, wide neck strap EW-100DGR, video cable VC-100, USB interface cable IFC-200U, battery pack BP-511A, battery charger CG-580, \"Great Photography is Easy\" booklet and \"Do More with Macro\" booklet, EOS Digital Solution Disc, software instruction manual"}