{"asin": "B003TFEHMU", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]], "description": "Listen in High Definition to your Blackberry or PC while on the goNever before has such big sound come from such a small package. Just connect your Blackberry or PC via Bluetooth or 3.5 mm minijack cable and enjoy unbelievably clear, room filling music.Ultra-Clear Noise-canceling Bluetooth Speakerphone for Hands-free Calls and Video ChatClarityHD Precision Micro Bluetooth Speaker is an incredibly flexible wireless speakerphone solution. You'll get near lifelike hands-free calls on your Blackberry and even for Skype or iChat voice/video chats on your Bluetooth equipped PC. The built-in mic with advanced noise-canceling let's you use it for instant conference calls in the office&#151;or anywhere you are. You can even use it in your car and still be clearly heard.Portability that Gives You the Ultimate in ConvenienceSmall enough to fit in the palm of your hand, ClarityHD Precision Micro Bluetooth Speaker stores easily in your laptop bag or luggage. It&#146;s the perfect mobile solution for enjoying hands-free calling and incredible sounding music on the go.COMPATIBILITY:Wireless: Devices with Bluetooth 2.0 or above (See General Specifications for profiles)Wired: Devices with a standard 3.5 mm headphone portConnects via Bluetooth to: Blackberry and Bluetooth equipped PC and most Bluetooth equipped smartphones or computersConnects to any device with a headphone port via 3.5 mm minijack cable (not included)WHAT'S INCLUDED:ClarityHD Precision Micro Bluetooth Speaker 100Travel PouchUSB Charging CableUser ManualGENERAL SPECIFICATIONS:Bluetooth v2.0 includes profiles: A2DP, AVRCP, HFP, HSPAdvanced Audio Distribution Profile (A2DP) for wireless music streamingAudio Video Remote Control Profile (AVRCP) for wireless audio and video playback controlHands-free Audio (HFP) and Headset Profiles (HSP) for hands-free callingRange up to 33 FT (10 M)", "title": "Monster ClarityHD Bluetooth Wireless Speaker (Black) (Discontinued by Manufacturer)", "price": 54.95, "imUrl": "http://ecx.images-amazon.com/images/I/41iyvp3lgCL._SX300_.jpg", "brand": "Monster", "related": {"also_bought": ["B007GBR0CM", "B00684H6ZY", "B00066HP7Y", "B0084Y9V54", "B00EIMZKAG", "B008MF3ZBQ", "B004G97L4O", "B00GZZBIRS", "B009WNR13U", "B00DJCBBDG", "B0057X4TWA"], "bought_together": ["B007GBR0CM", "B00066HP7Y"], "buy_after_viewing": ["B00684H6ZY", "B0084Y9V54", "B00D6OHHEE", "B008JGR9MO"]}}