{"asin": "B0035JEL6C", "related": {"also_viewed": ["B00BBJIFWE", "B00B7UTB5C", "B00EFILPHA"], "buy_after_viewing": ["B003FMUOX8", "B0035WTVUK", "B003VYB1H8", "B0045DPCNI"]}, "title": "Fujifilm FinePix Z700EXR 12 MP Super CCD EXR Digital Camera with 5x Optical Zoom and 3.5-Inch Touch-Screen LCD (Red)", "price": 249.95, "salesRank": {"Camera &amp; Photo": 20024}, "imUrl": "http://ecx.images-amazon.com/images/I/41P9sLCbioL._SX300_.jpg", "brand": "Fujifilm", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The FinePix Z700EXR is the first in a new class of EXR touch-screen digital cameras. Combining beautiful styling, Fujifilm's award-winning EXR sensor technology and a gorgeous 3.5-inch, wide (16:9) high-resolution touch-screen, the FinePix Z700EXR offers consumers the latest digital imaging technology wrapped up in a sleek, sophisticated package.1. FinePix Z700EXR; 2. Conventional digital cameraThe FinePix Z700EXR combines a 12-megapixel Super CCD EXR sensor, a Fujinon 5x periscopic optical zoom lens (36-180mm equivalent) and ISO levels of up to 3200 at full resolution.  Housed inside a full metal chassis, the FinePix Z700EXR will fit in any pocket or purse at only 16.9mm thin and features a smart horizontal lens cover with wave detail, which neatly acts as the on/off switch and an LED \"Z\" that lights up when the camera is in operation.FinePix Z700EXR HighlightsTouch Screen TechnologyThe FinePix Z700EXR's real talking point is its intuitive touch screen technology. The rich 460k-pixel 3.5-inch touch-screen display panel facilitates effortless navigation of the camera's many functions.  This responsive touch screen not only lets you take and view photos with the touch of a finger, but also provides a large, bright screen to compose and view your photos.With the addition of new Dual Direction GUI and Dual Image Display, travelling though the FinePix Z700EXR's functions is smooth and easy.  Dual Direction GUI detects the orientation of the camera and automatically switches the direction of the menu button accordingly (for shooting, playback, multi-viewing and image search), while Dual Image Display splits the screen in various ways to view multiple images at once, so you can scroll through your images quickly and easily to locate the one you are looking for.Get close to the action with 5x optical zoom.HD CapabilityThe FinePix Z700EXR also offers stunning HD movie in 720p with sound and high quality stills playback.  Many consumers are happy to enjoy HD movies on their PC, but with the new HD Player (optional extra), which comes equipped with a remote control, families can gather around their home HDTV to enjoy amazingly detailed stills and high resolution movie playback.Face Recognition TechnologyFor the first time on a Fujifilm digital camera you can identify the people in a picture by name! Fujifilm's Face Recognition Technology gives you the ability to pre-program 8 people into the camera. To do this, you start by taking a picture of the person you want to program into the camera and then tell the camera who that person is (e.g. Mom).  You also have the option of inputting the category she belongs to (e.g. friends/family) and the date of her birthday.  The next time you take a photo of her, the camera will cleverly recognize \"Mom\" and optimize the settings to ensure that exposure and focus are best suited to her, rather than the other people in the picture.  This fun technology can recognize up to 5 pre-programmed people on screen at the same time.In addition, the FinePix Z700EXR's new Picture Search Tool is able to use the Face Recognition data (name, birthday and category) to help you find and playback your photographs quickly and easily.  If you want to scroll through all pictures featuring \"Mom\" for example, the camera will be able to select them for you for easy viewing.Pet DetectionFor those who enjoy the company of four-legged friends, the FinePix Z700EXR comes equipped with Fujifilm's brand new Pet Detection technology, allowing users the ability to detect up to 10 faces of dogs or cats and automatically optimize the focus. The FinePix Z700EXR is programmed to recognize 57% of the F&eacute;d&eacute;ration Cyno Logique Internationale (FCI) registered dogs, 80% of the Top 20 Dogs in the American Kennel Club (AKC) Ranking and 60% of The Cat Fancier's Association (CFA) breeds.  Pet Detection works by matching various dog or cat data of facial parts with patterns to detect the dog or cat being photographed.Enjoy easy upload of pictures and video to the WebEasy Web UploadFujifilm has also introduced a new Facebook/YouTube Automatic Upload feature which is perfectly suited for consumers who want to share their pictures and videos more easily.  Users can mark their favorite images and videos for Facebook or YouTube upload so they are all ready to go when they next connect to their computer.  No more time is wasted sorting through pictures on the computer--just connect to MyFinePix Studio (supplied with the camera) and all marked images and videos will upload directly to the respective site at the press of a button.Additional FeaturesEXR Technology: Prized for bringing a new level of image quality to the consumer compact market, Fujifilm's EXR technology has the unique ability to switch its behavior depending on the shooting conditions. The FinePix Z700EXR can be left on EXR Auto Mode and the camera will do all the hard work for you, or alternatively, you can manually select the EXR Priority mode for high resolution (HR), dynamic range (DR) or high sensitivity and low noise (SN).Touch Shot:  Provides the ability for one touch focus and shooting for easy photo taking.  After the user taps the focal point of choice for the shooting scene on the LCD display, the camera automatically sets the appropriate focus and functions, and then releases the shutter for optimal one touch picture taking.Automatic Scene Recognition: 'SR Auto Mode' intelligently detects the scene type you are shooting and optimizes the camera's focus, exposure and white balance, so whether you're photographing flowers or a holiday landscape, you will get flawless photos at the press of a button.Dual Image Stabilization: Long-zoom cameras need stabilization more than any other compact, with handshake and subject movement a particular problem in low light at telephoto range. The FinePix Z700EXR reduces blur to a minimum by deploying Picture Stabilization to automatically increase shutter speeds to freeze action, and mechanical CCD Sensor Shift Stabilization to counteract the problems of handshake.  By cleverly combining these two, blur is reduced to an absolute minimum.'Super Intelligent' Flash: The FinePix Z700EXR offers a flash control system which efficiently controls the level of flash for a given exposure to produce beautifully balanced flash illumination across the foreground and background.  Gone are the ugly washout shots where the subject is blasted with light and the background dark and unexposed.  Super Intelligent Flash is most useful in macro photography where the contrast between subject and background can be especially challenging, but is also effective for night and backlit photography.Face Detection and Automatic Red-eye Removal: To provide perfectly exposed and focused portrait shots, the FinePix Z700EXR is fitted with Fujifilm's latest Face Detection technology which is able to track up to 10 faces simultaneously, at almost any angle to the camera.  The system instantly corrects red-eye and then saves both the original and the corrected image file automatically.Dual Image Stabilization in action."}