{"asin": "B002B4P788", "description": "From the Manufacturer Are you ready for a world without cable clutter? Then you want the Logitech Wireless Desktop MK300. There's no cord, so you're free to lean back while you continue to type and navigate. It does everything you'll need, all built right into its sleek design. Plus programmable keys and media controls let you go through common tasks in an instant. And with intelligent power management, you get the most out of your batteries. Now nothing stands between you and what you want to do.The Logitech Wireless Desktop MK300 &mdash; free from cords and full of featuresFor an easy and reliable way to &quot;go cordless&quot; without sacrificing features, the Logitech Wireless Desktop MK300 offers a contemporary keyboard and mouse combination for your home desk. It features one-touch access controls for media and applications, extended battery life, and wireless technology that connects right out of the box &mdash; all in a sleek design.Key FeaturesOne-touch access controls and programmable F-keysOne-touch access controls and programmable F-keys give you fast, easy access to music, video, e-mail and application switching (with the included software).Intelligent power managementIntelligent power management with automatic sleep mode, on/off switch, and a battery status indicator allows you to go for months without changing batteries&mdash;up to 15 months for the keyboard and up to 8 months for the mouse.1200 dpi optical mouseA 1200 dpi optical mouse makes tracking smoother and more responsive than standard optical mice.Easy-to-setup wireless technologyEasy-to-setup wireless technology provides a fast, reliable connection right out of the box&mdash;just plug the wireless receiver into a USB port on any desktop PC or notebook to get started.Low-profile, whisper-quiet keysLow-profile, whisper-quiet keys let you work in comfort with keys that feel great and barely make a sound.Which Logitech keyboard and mouse combo is right for you?GoodBetter&nbsp;BestUltraCordless DesktopMX 5500 RevolutionCordless Desktop Wave ProCordless DesktopMX 3200 LaserCordless Desktop WaveCordless DesktopS 520Wireless Desktop MK300&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Connection FeaturesUSB SupportWireless Protocol &amp; SecurityBluetooth 2.0 EDR128-Bit AES EncryptionAdvanced 2.4 GHz128-Bit AES Encryption27MHz48-Bit Encryption27MHz48-Bit Encryption27MHz48-Bit Encryption27MHz48-Bit EncryptionMini-Receiver&nbsp;&nbsp;Mini-Receiver Stand&nbsp;&nbsp;&nbsp;Keyboard DesignPalm RestIntegratedIntegrated CushionIntegratedIntegrated CushionIntegrated&nbsp;Adjustable Height/AnglesIntegrated LCD&nbsp;&nbsp;&nbsp;&nbsp;Battery Level Indicator(on LCD)(on LCD)Battery Life (Maximum)3 months3 years12 months12 months12 months15 monthsOperational and Navigational ControlsEnhanced F-KeysSearch Feature&nbsp;&nbsp;Communication ControlsLaunch E-Mail&nbsp;Launch Web Browser&nbsp;Launch IM / VOIP&nbsp;&nbsp;&nbsp;Mouse FeaturesRechargeable Mouse&nbsp;&nbsp;&nbsp;&nbsp;Battery Life (Maximum)2-week charge2-month charge12 months8 months8 months8 monthsLaser Mouse&nbsp;Hyper-Fast Scrolling&nbsp;&nbsp;&nbsp;&nbsp;Battery Level Indicator&nbsp;On/Off Switch&nbsp;System SupportWindows Vista &amp; Windows XPMac OS X&nbsp;&nbsp;&nbsp;&nbsp;What's in the BoxPackage ContentsLogitech Wireless Keyboard MK300Logitech Wireless Mouse MK300USB receiverAA batteriesUser&rsquo;s guideCD with software and comfort guidelines5-years limited hardware warrantySystem RequirementsPC with Windows XP, Windows VistaAvailable USB portCD-ROM drive", "title": "Logitech Wireless Desktop MK 300", "price": 23.99, "imUrl": "http://ecx.images-amazon.com/images/I/51Ee5LQAbJL._SX300_.jpg", "related": {"also_viewed": ["B003VAGXZC", "B00BP5KOPA", "B003VANO7C", "B003NREDC8", "B0036E8V08", "B000TKHGL2", "B001DJ9GOS", "B0011FQUQG", "B001F51G1G", "B003VAHYNC", "B004RJFTKG", "B004KNAU0S", "B006GMLD7A", "B002MMY4WY", "B00A9H6O18", "B004KSQANO", "B00ACC0P0Q", "B0036ECGS6", "B001S4OTS6", "B004N627KS", "B005S0YO0O", "B0009V6TL4", "B0026PTO1I", "B003SVSJ1K", "B003JZU8DC", "B004SUO1R6", "B003ELVLKU", "B002MUYP3E", "B004SUO1QM", "B007PJ4PN2", "B004XLA1R4", "B003NR874S", "B008H0FOJM", "B000HCRVSK", "B00310PJM0", "B0058OU8VY", "B003VAGXWK", "B002R5AO20", "B00I14395A", "B005DKZTMG", "B007XZTMUE", "B001IOHAVO", "B002JCSCYS", "B004MF11MU", "B001AAK0P4", "B0042AI466", "B000V01RLK", "B000HX1P8G", "B004JO16KG", "B008BW9XTS", "B001B8EOMU", "B00B7GV802", "B006MDNXF8", "B003GU1028", "B000HCUTU2", "B00FPV2C8M", "B000AY649C", "B001F51G16", "B001CZKSWW"], "buy_after_viewing": ["B003VAGXZC", "B00BP5KOPA", "B003VANO7C", "B003NREDC8"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Keyboard & Mouse Combos"]]}