{"asin": "B000KX8TCI", "description": "Slingshot 300 AWManufacturer Description:<img border=\"0\" alt=\"Lowepro Slingshot 300 AW\" src=\"Images/Lowepro_Fastpack.jpg\" style=\"float:left; width:300px; padding:0px 20px 5px 0px;\"  />The Slingshot 300 AW is a sling style camera bag designed to comfortably carry a professional digital SLR body with a 70-200 f/2.8 lens attached, plus 5-6 extra lenses or flash units. Loaded with features, the SlingShot 300 AW boasts an All Weather Cover, a built-in memory card pouch, a micro fiber LCD protector, Hypalon SlipLock attachment loops and plenty of other amenities to provide the greatest ease of use and comfort.&nbsp;&nbsp;&nbsp;Hardware Capacity:Canon - EOS 1Ds Mark IIn; Contax - N Digital; Fujifilm - FinePix S3 Pro; Kodak - DCS SLR/c, DCS SLR/n, DCS 14n; Nikon - D2Hs, D2X, D1, D1x; Olympus - E-1; Sigma: SD9, SD10. 5-6 Zoom Lenses or Flash Units, memory cards and personal accessories.Slingshot 300 AW Highlights:1.&nbsp;Ergonomic Sling StrapEvenly distributes equipment weight while carrying heavy equipment2.&nbsp;Full Access LidAllows you to easily work from the bag while wearing it, and provides 180&deg; access while packing3.&nbsp;All Weather CoverOffers maximum protection against rain, dust and sand4.&nbsp;Zip-Stop BucklesPrevent zippers from completely opening while accessing equipment5.&nbsp;Padded Waist BeltFully adjustable belt distributes weight on hips for heavy loads6.&nbsp;Quick Pull HandleProvides an easy and secure location to grab and pull the bag into the \"access position\"7.&nbsp;Built-In Memory Card PouchQuickly find memory cards in the same place every time8.&nbsp;Built-in Micro Fiber LCD ClothProtects LCD screen from camera strap nicks and scratches9.&nbsp;Silent Zipper PullsProvide quiet access around film crews or wildlife10.&nbsp;SlipLock Attachment LoopsAdd pouches or other SlipLock compatible products to customize11.&nbsp;Accessory PocketsProvide quick access to cables, adaptors, small accessories or personal items12.&nbsp;Mesh Back PadProvides comfort during long treks&nbsp;Product Description:The unique design of the SlingShot 300 AW provides quick and easy access to camera equipment while it's still being worn. Perfect for photojournalists, sports photographers or anyone in need of quick access to their equipment, the SlingShot 300 AW allows you to focus on your shooting and not finding your equipment.&nbsp;", "title": "Lowepro SlingShot 300 All-Weather Camera Bag (Black)", "price": 69.95, "imUrl": "http://ecx.images-amazon.com/images/I/41l9xVMya2L._SY300_.jpg", "related": {"also_viewed": ["B0036AYTWG", "B0036AWR8E", "B003656Q7C", "B000B9O83A", "B000BAX50G", "B000EB7OTU", "B000EY5R8C", "B000F31KLA", "B00D96LZ6K", "B000YIYOJ6", "B004JMZPJQ", "B009HPC228", "B000YIWR8G", "B000YA1DS4", "B00DEH5XPS", "B002OEBJ7S", "B003D5MZRK", "B000YIWNUS", "B000YIYQ30", "B004TA6Y8O", "B009HPC2XW", "B0087N11NM", "B000YA33DC", "B003G2YZCS", "B0078K17WK", "B0028XD0EU", "B00FB6M6FA", "B004XNLPYK", "B005O9YMM4", "B004JMZPK0", "B0039NLS3I", "B009PKNMFQ", "B005MYAHJ8", "B002DW99H8", "B000YIWR9U", "B008TNX7PK", "B002ISXBFI", "B000A2LA70", "B00452UXFG", "B001APJZ50", "B001E07NY6", "B005VTIMEQ", "B001BP7YFM", "B009HPC21O", "B000EXHYK2", "B000YIYQ5I", "B000EXK2K6", "B004XNLPWC", "B002OEBJ7I", "B0084423UE", "B002OEBJ8C", "B009PKNN0U", "B004M9AS3Y", "B004XNLR16", "B002MZZR54", "B009H2LZQ0"], "buy_after_viewing": ["B0036AYTWG", "B0036AWR8E", "B003656Q7C", "B000YIYQ30"]}, "categories": [["Electronics", "Camera & Photo", "Bags & Cases", "Camera Cases"]]}