{"asin": "B0002XQJFA", "description": "The perfect EOS for advanced amateurs and professionals alike, the EOS 20D sets new standards in its class. Featuring an all-new 8.2 MP CMOS sensor, a second-generation DIGIC II image processor, 5 fps performance for up to 23 consecutive frames, and a 0.2 second start-up time, the EOS 20D is designed to capture richly detailed, perfectly exposed images with speed formerly found only in cameras several times the price. Other features include a top shutter speed of 1/8,000 seconds, flash sync at 1/250, a new high-precision nine-point AF system, a built-in multicontroller for fast focusing point selection, and a refined magnesium alloy body for rugged, go-anywhere photography. Compatible with not only Canon's new EF-S lenses but the entire EOS system of lenses and flashes, the EOS 20D is a professionally featured camera with a consumer price tag.8.2-Megapixel CMOS SensorCanon's all-new large-area CMOS (complementary metal oxide semiconductor) sensor captures images with exceptional clarity and tonal range, and offers the most pixels in its class. This second-generation APS-C-size sensor (22.5 by 15.0mm) has the same 3:2 ratio as film cameras, enabling an effective angle of view that is 1.6 times the normal EF lens focal length. The EOS 20D has an extensive ISO range (from 100 to 1600 plus ISO 3200 in extended mode), and the sensor features a newly developed set of narrow-gap microlenses and noise-reduction circuits to improve performance at high ISOs and optimized photodiode configurations for improved performance at all ISOs. This results in larger, clearer, sharper, and more detailed photographs right from the start.Second-Generation DIGIC II Image ProcessorThe EOS 20D benefits from Canon's in-house development: The DIGIC II image processor was developed originally for the EOS-1D Mark II and enhances every aspect of image capture. Information captured by the CMOS sensor is processed and assembled into images of exceptional quality by this new image processor. With the DIGIC II image processor on board, photographers can expect precise, natural colors and spot-on white balance in any number of lighting situations. Through sophisticated signal processing algorithms, the DIGIC II image processor even accelerates all aspects of image capture, while consuming less energy than other processors.Every Function Optimized for Speedy RAW and JPEG CaptureThe EOS 20D has been designed to capture images with speeds that had been reserved for professional-level cameras. Whether it's the 0.2 second start-up time, the high-speed mirror drive, the class-leading 65 microsecond shutter release lag time, or the predictive AF focusing at speeds up to 5 frames per second, the EOS 20D will amaze and delight photographers who don't want to wait for their camera when they're ready to shoot. The 20D's CMOS sensor allows four-channel high-speed data readout, and the DIGIC II image processor processes the data quickly, writing files to the CompactFlash card faster, and allowing continuous shooting for up to 23 frames (JPEG Large/Fine) with significant reductions in buffer clearing times.JPEG or Simultaneous RAW+JPEGWhenever you shoot the EOS 20D, you can choose to have it record RAWs or JPEGs alone, or in RAW plus JPEG formats simultaneously. The JPEG recording format is ideal for purposes such as Internet image transfers that require reduced file sizes. Canon's proprietary RAW (.CR2) format, on the other hand, employs lossless compression to ensure the highest possible image quality, and is recorded at 12 bits per pixel to provide a wider range of tones and superior detail in bright highlights and deep shadows when compared with JPEG files. RAW files must be processed before they can be opened in your computer's image-editing software. This conversion process typically takes only a few seconds using the dedicated driver software, which will convert the RAW file into a standard 8-bit-per-channel JPEG or TIFF file, or for maximum tonal range, a 16-bit TIFF. There are six selectable settings for in-camera JPEG image quality, when CF card space is at a premium.Expansive Sensor Array for Easier CompositionThe EOS 20D has a newly developed high-precision nine-point AF system for speedy and accurate focusing in any situation. An improved focusing screen with precision matte finish enables brighter and easier manual focus. A newly developed multicontroller, conveniently located on the back of the camera for thumb-controlled action, allows the photographer to instantly choose any of the nine focus points or direct the camera to choose them automatically. Focusing points are positioned in the viewfinder in a wide diamond-shaped array, allowing the user to achieve focus quickly in numerous compositions and situations.Features Formerly Offered Only in Canon's Pro Cameras Allow for More Fine-TuningPhotographers will find their options for color settings greatly expanded in the new EOS 20D. Taken directly from the EOS-1D Mark II, the white-balance compensation function utilizes the new multicontroller and a nifty LCD monitor display to tune any white balance setting up to +/-9 steps in blue, amber, magenta, or green hues to ensure spot-on color. The new white-balance bracketing feature produces a series of three files varying white balance from magenta to green or blue to amber, depending on the lighting situation.Images can be processed directly for the industry print standard Adobe RGB or standard sRGB, and are compatible with DCF 2.0 and Exif 2.21 standards for greater flexibility. A range of in-camera image processing parameters can optimize JPEG files for direct printing or post-processing, or can be customized to the user's tastes and needs.The EOS 20D also features a built-in monochrome mode, a first in Canon digital SLRs, which uses digital processing to re-create the effects of a number of different black and white filters and toning effects. These features help to take the guesswork out of black-and-white photography, reducing the need for post-processing by delivering the desired detail and contrast of a black-and-white image from the start.Strength and Elegance CombinedThe EOS 20D feels solid and rugged in your hands, ensuring stable, easy handling. Its rigid chassis combines engineering plastic with stainless steel and is covered by strong, lightweight magnesium alloy panels on the top, front, and rear. Controls are ergonomically shaped and positioned to sustain the EOS tradition of ergonomic excellence and sure-fire operation. The newly designed grip, shutter button, and rubber skin contribute to this excellent holding comfort, and the camera's high-profile built-in flash is compact and hides itself neatly into the top of the body. A newly refined finish adds to the elegance of the camera body.Expanded Zoom Display During PlaybackWhile viewing recorded images on the camera's 1.8-inch, high-definition TFT color LCD, you can enter enlargement mode and enlarge them up to 10 times in 15 stops for detailed analysis of lighting, composition, camera movement, focusing accuracy, facial expression, and more. The new multicontroller enables horizontal and vertical scrolling, while the main dial enables viewing of the previous or next image stored in the CF card at the same enlarged view. In the maximum reduced view, nine images are displayed simultaneously on the screen, making them quicker to find. The camera can be set to automatically rotate vertical images so they can be viewed easily on the monitor and also after downloading to your computer.Direct Printing with PictBridge-Compatible PrintersThe EOS 20D lets you print beautiful photos with minimum time and effort--directly from the camera. Simply connect the camera to any PictBridge-compatible printer via the high-speed USB 2.0 port to print images stored on the CF card. You can even set the EOS 20D to trim the image, add a surrounding \"frame,\" superimpose a date, or print multiple copies. The EOS 20D's direct-printing feature complies with Exif v2.2 (Exif Print) and DPOF v1.1. With a host of portable and home printers available from Canon, including the new PIXMA iP4000 and PIXMA iP3000 photo printers, getting tangible results from the camera has never been faster or easier.SoftwareThe EOS 20D comes bundled with three software CDs: Canon's Digital Photo Professional 1.1, the EOS Solution Disk 8.0, and Photoshop Elements 2.0. Each application is designed to optimize captured images and streamline the digital workflow.Includes EF-S 18-55mm f3.5-5.6 LensThe EF-S 18-55mm f3.5-5.6 is a standard zoom lens. Effective focal length is equivalent to 29-88mm in 35mm film format.Compact and lightweight11 elements in nine groups, including one high-precision aspherical lens elementHigh image quality at all focal lengthsOptimized lens coatings to minimize ghosting and flareFast AF speedVery close focusing distance (0.28 meters at all focal lengths)Circular aperture gives a more attractive appearance to out-of-focus background areas in photos shot using the widest aperturesLead-free opticsEF and EF-S LensesThe EOS 20D is compatible with all Canon lenses in the EF lineup, ranging from ultrawide-angle to super-telephoto lenses, and including Canon's new EF-S series lenses, manufactured specifically for the 20D and Digital Rebel. The EF lineup employs advanced optical know-how and micron precision engineering to deliver unprecedented performance in all facets of the photographic process. Aspherical optics and fluorite elements, for example, are featured in the universally acclaimed L-series lenses. Canon's image stabilization feature minimizes the effect of camera shake. Through Canon's EF lenses, photographers can truly maximize the quality and liberating performance of the EOS 20D.Flash PhotographyThe EOS 20D features the acclaimed E-TTL II flash metering system introduced with the EOS-1D Mark II. Whether using its flush mounted integral flash (guide no. of 43/13 @ ISO 100 m/ft.) or any of the flashes in the EX Speedlite line, E-TTL II provides stable flash brightness through numerous exposures.Additional AccessoriesIn addition to Canon's EF series of lenses and Speedlites, several other accessories are designed to work specifically with the EOS 20D. The Battery Grip BG-E2 adds a vertical shutter release, and is compatible with up to two of Canon's BP-511/511A/512/514 lithium-ion battery packs, or alternatively a set of six AA batteries, for greater convenience when traveling. Canon's Semi Hard Case EH/7-L can accommodate the EOS 20D with a small zoom lens (EF-S17-85mm f4-5.6 IS USM included), and the EOS 20D is compatible with Canon's DVK-E2 image data verification kit to check original image data authenticity, whenever verification is essential.What's in the BoxEOS 20D digital camera, EF-S 18-55mm f3.5-5.6 lens, Lithium-ion battery pack (BP-511A) with protective cover, battery charger (CG-580), USB cable (IFC-400PCU), video cable (VC-100), EB eyecup, wide neck strap, EOS Digital Solutions Software CD-ROM, Adobe Photoshop Elements 2.0 Software CD-ROM, EOS 20D instruction manual, 1-year USA limited warranty", "title": "Canon EOS 20D DSLR Camera with EF-S 18-55mm f/3.5-5.6 Lens (OLD MODEL)", "imUrl": "http://ecx.images-amazon.com/images/I/51A0DQR7HML._SY300_.jpg", "related": {"also_bought": ["B000W05O5O", "B003CIBC36", "B0037TENMC", "B000BNY64C", "B001G9TYHE", "B00004THD0", "B000V5K3FG", "B003B4TD32", "B0010BUYYK"], "buy_after_viewing": ["B0009B05H8", "B0002XQI2E", "B000W05O5O", "B000BNY64C"]}, "salesRank": {"Camera &amp; Photo": 3958}, "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]]}