{"asin": "B005CSPHYY", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphone Accessories", "Earpads"]], "description": "Replacement Ear Pad Cushions for Bose QuietComfort 2, QC2, QC15 Headphones by HeadphoneMate - This is NOT a Bose product. This is a HeadphoneMate product and HeadphoneMate is not endorsed or affiliated with Bose in any way. This is a NO RISK purchase because our product carries a 100% satisfaction guarantee. This means you can try our product and request a full refund for any reason if not completely satisfied. You, the buyer, are only responsible for the return postage cost. We don't want anyone who is dissatisfied with our product to keep it, and we will provide the best of service to help you send it back for a fast refund upon request. If you want the very same ear pads that were installed on your Bose headphones, when you first purchased them, it will be best for you to buy them directly from Bose. Most negative reviewers of our product unfairly rate it poorly in an apple to apple comparison to the original Bose product. These reviewers should never have bought our product in the first place had they read our product item description. Our product is a very good one, but we don't recommend it to anyone who can settle for nothing different than the original Bose product. HeadphoneMate makes no claim its ear pads are better than or even equal to the original Bose ear pads. We have sold THOUSANDS of pairs of these ear pads to satisfied buyers who have felt our product is of very good value for the price paid. HeadphoneMate ear pads are very good quality, but you may find them to not be quite as soft as the original Bose ear pads. Evaluation of HeadphoneMate ear pads in regards to noise cancellation varies with each individual user. You can find an installation video by doing a search on Google or YouTube by copying and pasting 1r88pvr7y1o into the search box. Our ear pads are guaranteed to fit perfectly and will remain in place as they should. We replace defective products and are happy to help with an exchange upon request. Please E-mail or call if you need help.", "title": "Replacement Ear Pad Cushions for Bose QuietComfort 2, QC2, QC15 Headphones", "price": 24.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/414H4knI0VL._SX300_.jpg", "related": {"also_bought": ["B00CB0HZAU", "B00ESZU95Y", "B00862522A", "B008F5JZVC", "B005C1U8QS", "B00IM349F4", "B0073UIS40", "B00IYDFHJY", "B0055DGM8Q", "B00ITAG4VC", "B00D1JJ31O", "B0080BK4I4", "B009BV4V4K", "B009BXX8II", "B0073W6ZE8", "B00D42A16E", "B0073H2WP4", "B0054JJ0QW", "B00IBDOB5I", "B005H3Q5E0", "B009QZH6JS", "B001LR08VW"], "bought_together": ["B00CB0HZAU"], "buy_after_viewing": ["B0073H2WP4", "B0080BK4I4", "B0073HD8R0", "B009BV4V4K"]}}