{"asin": "B0007Y79E4", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Mice"]], "description": "Meet the mouse that reinvented the wheel. The scroll wheel, that is. At a surprisingly low price, Mighty Mouse features the revolutionary Scroll Ball that lets you move anywhere inside a document, without lifting a finger. And with touch-sensitive technology concealed under the seamless top shell, you get the programability of a four-button mouse in a single-button design. Click, roll, squeeze and scroll. This mouse just aced the maze.Spry and MightyIn the beginning, there was one button. Then there were two. Then there were clickable scroll wheels and programmable toggles and solid-state slides. But nobody made a mouse as easy to use as your Mac. Until now. Mighty Mouse combines the capability of a multibutton mouse with Apple's signature top-shell design for the best of both form and function. Use it any way you work: Stick with single-button simplicity or click with multibutton efficiency.Get AroundTime is round. Space is curved. Why should your mouse be linear? Plenty of applications require you to do more than scroll up and down. Mighty Mouse offers 360-degree scrolling capability, thanks to its Scroll Ball, perfectly positioned to roll smoothly under just one finger. Explore the farthest reaches of your files&#x97;pan images in iPhoto, view timelines in iMovie HD and Final Cut Pro, traverse bars in GarageBand and Logic Pro&#x97;with one hand tied behind your back (or holding a cup of coffee or typing). Mighty Mouse gives you room to roam.You'll Really ClickTouch-sensitive technology under Mighty Mouse's seamless top shell detect where you're clicking, transforming your sleek, one-button mouse into a two-button wonder. But the innovation doesn't end there. Apple engineers added force-sensing buttons on either side of Mighty Mouse that let you squeeze the mouse between your thumb and finger, activating Mac OS X Tiger Dashboard, Expos&#xE9; or a whole host of other, customizable features&#x97;instantly.The Mouse That RoaredUnlike any other mouse on the market, Mighty Mouse was designed specifically to work with Mac OS X Tiger. Up-to-the-minute information on Dashboard is only a click away. Viewing, hiding, and selecting your windows via Expos&#xE9; is just as simple. And because Mac OS X Tiger makes Mighty Mouse programmable, you choose where every click takes you.", "title": "Apple Mighty Mouse", "price": 47.99, "imUrl": "http://ecx.images-amazon.com/images/I/318D41WBWDL._SY300_.jpg", "brand": "Apple", "related": {"also_bought": ["B005DLDTAE", "B002C7JG4A", "B002TLTH7K", "B000B6D39I", "B0000ACOBG", "B0000ACOBI", "B002TLTGM6", "B007X3VEVG", "B000V1IFR8", "B00ENF8Q2C", "B0000899ZB", "B008RXYOKY", "B00A7Z0WQ0", "B0069VBAXU", "B008AL9VXI", "B000OOYECC", "B007476KRY", "B008ALAHA4", "B008ALA6DW", "B002HU39BS", "B009FA98JU", "B003XIJ3MW", "B0044RUSZM", "B005DLDO4U", "B00CYSYZTS", "B009K916ZK", "B004L6MLPQ", "B003Y54NPQ", "B003BHHIA4", "B005T3GRLY"], "bought_together": ["B005DLDTAE"], "buy_after_viewing": ["B002TLTH7K", "B00EQ94566", "B005DLDTAE", "B002TLTGM6"]}}