{"asin": "B000HKIPVE", "description": "The ViewSonic 19-inch Widescreen LCD Monitor combines a generous feature set with a budget-friendly price. This ViewSonic monitor's widescreen aspect ratio provides more productive virtual space, and is ideally suited to maximize the natural field of vision for intense game play, high-definition (HD) format video, and multiple document windows.This 19-inch monitor's ClearMotiv technology gives it a super-fast 5ms video response that enables digital HD-quality, full-motion video, while its Dynamic Structure technology's innovative liquid-crystal composition and pixel matrix accelerate video response for seamless video and intense graphics. This unit features a high, 280-nits of brightness and 700:1 contrast ratio for rich details, as well as a 1,440 x 900 optimum resolution with a 16:10 aspect ratio that delivers crystal-clear images, crisp text and intense graphics. The ViewSonic LCD monitor also features an OSD lock that prevents changes to monitor settings, and an AutoTune function that maintains an optimized image. An ideal furnishing to any space, this feature-rich monitor has a stylish, slim-bezel design, comes in black, and is wall-mountable. This ViewSonic monitor is PC and Mac compatible, has an integrated power supply, is TCO'03 and Energy Star qualified, and is backed by a manufacturer's three-year limited warranty on parts, labor and backlight.Built with a long-life, 50,000-hour light source, and an anti-glare panel surface, this monitor has an RGB analog video input, as well as a digital DVI-D video input, and dual integrated stereo speakers. This system meets most regulations including UL, FCC, CB, CE, TUV/Ergo-S-GS, ICES-003,BSMI, CCC, and more, consumes 32-watts of energy running on 100-240 volts of AC power, and measures 17.8 x 7.8 x 15.4 inches (WxDxH).What's in the BoxViewSonic 19-inch Widescreen LCD Monitor, DVI cable, VGA cable, power cable, audio cable, Quick Start Guide, and ViewSonic Wizard CD.", "title": "ViewSonic VA1912WB 19-inch Widescreen LCD Monitor (Black)", "imUrl": "http://ecx.images-amazon.com/images/I/61Z8Z1W1QTL._SY300_.jpg", "salesRank": {"Electronics": 126804}, "categories": [["Electronics", "Computers & Accessories", "Monitors"]]}