{"asin": "B000050FZP", "related": {"also_bought": ["B00009W3FR", "B00006JQ7D", "B00005MITU", "B00000J0MS", "B007B5VH0E", "B003EI4GP0", "B00AU8IGEO", "B003D0JW6W", "B004OA758C", "B007P8DKZW", "B001S2PKPE", "B004UW0EMS", "B000MT2K20", "B0007LXQBW", "B000067RC1", "B001S2PKP4", "B001LQG28G", "B00K7EFLA8", "B00002N7J6", "B002AMW2ZC", "B004GMN2HG", "B001S2PKL8", "B00004Z5KI", "B004BUVAS6", "B00006ID3V", "B004OA6XAI", "B000LSUEC0", "B002HEQD8K", "B003OCUB2I", "B003WI9ULC", "B007ORP4GW", "B0039UUM5Q", "B000OFN5G2", "B004LGIJFC", "B0028Q82S6", "B007B5TABW", "B004OA74B0", "B005G9RB3Y", "B0037SRV5E", "B0006IEV60", "B007A4FI2E", "B000067RC5", "B004OA74MY", "B001GKKMPG", "B004OA6VVO", "B0036D9YKU", "B0048LMNP2", "B00002EQCS", "B0036RDR5E", "B00EVVNOT8", "B004OA74NI", "B004OA6VU0", "B009R5VTX6", "B0073W71IM", "B000OTEZ5I", "B00009V2QV", "B001C94HY8", "B003BVJBQ4", "B00KFD0O9E", "B0000BVYT3", "B0012YVGOW"], "bought_together": ["B00009W3FR", "B007B5VH0E"], "buy_after_viewing": ["B00005MITU", "B001S2PKP4", "B004OA758C", "B007B5VH0E"]}, "title": "AT&amp;T 210 Corded Phone, White, 1 Handset", "price": 10.74, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41MPxXabIlL._SY300_.jpg", "brand": "AT&amp;T", "categories": [["Office Products", "Office Electronics", "Telephones & Accessories", "Corded Telephones"]], "description": "A popular and affordable telephone, the 210 from AT&amp;T is designed for those who don't want hassles or frills, just a basic phone that's reliable and easy to use. Simple corded operation means you never have worry about misplacing a cordless handset, and the phone's sturdy construction means it's designed to last.You can place the base on a convenient surface or easily mount it on the wall, saving on counter space. A 13-number memory dial feature lets you store your most frequently called numbers (up to 21 digits)--nine speed dials plus three emergency one-touch dials that are easy to program. A directory card is provided to help you keep track of all your memory dial settings. A redial feature lets you quickly call the last outgoing number (up to 32 digits).Three ringer settings (off, low, and high) and three handset volume levels permit customization. Switchable tone and pulse dialing methods are also provided. The illuminated keypad helps you operate the phone even in darkly lit areas, while a prog/mute button on the handset lets you hear the other party while muting your side of the conversation. An excellent value, the 210 also comes backed with a one-year limited warranty.The product comes with 10 speed dials and 3 one touch dial buttons.What's in the BoxTelephone handset, telephone base, 7-foot line cord, coiled handset cord, user's manual, warranty information"}