{"asin": "B000FQBF1M", "description": "Get ready to take on the full strength of the Helghast war machine from a dramatic first-person perspective with Killzone 2 for PS3. From Guerilla Games, this much anticipated follow-up to Killzone for PS2 and Killzone: Liberation for PSP drops you right into the boots of battle hardened special forces soldier Sev. Set two years after the aborted Helghast assault on Vekta, the action opens with your ISA Legion squad deployed behind enemy lines on the Helghan's unforgiving home turf..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; } img.withlink {border:1px #777777 solid;}Motion blurs and studio-grade special effects bring battle to life.View larger.First-person viewpoints and 7.1 surround sound keep you immersed.View larger.Realistic lighting and detailed environments add a cinematic quality.View larger.Smooth animation and improved AI give the Helghans a terrifying, realistic presence.View larger.Combat Lifelike AI and Inhospitable TerrainDespite the smooth character animations and swift-thinking AI behind each individual Helghan, their planet itself may be the most deceptive opponent that you face. Unlike other game environments that serve as nothing more than a visual backdrop, the devastating Helghan climate takes a notable toll. And, worst of all, the Helghans know exactly how to use the planet against you.The in-your-face perspective comes to life as you take aim with exotic new weapons and mainstays from the previous games, including the M82-G assault rifle. And you can now drive an array of rugged, sometimes strange, vehicles that expand the gruesome possibilities of war.Guerilla Technology in a Terrifying, Realistic WorldGuerrilla's unique visuals and deferred rendering technology ensure that even the ugliest situations on Helghan are beautifully lit. Ambient occlusion and accurate shadow casting from a variety of light sources combine with gritty textures, detailed environments, and studio-grade special effects to help complete the realistic, Hollywood experience of this first-person shooter.Real-time cutscenes, full-screen anti-aliasing, motion blurs, and internal lens reflections all bring you into the fold and work to maximize the hardware capabilities of the PS3. And the audio experience is no less impressive. 7.1 surround sound capability lend a truly dynamic sound element to your experience, while audio occlusion with wave tracing means that you can hear the difference between indoor and outdoor firefights.Chaotic Multiplayer Drama OnlineWhile single-player mode lets you take on the unique challenges of 11 fully developed levels, online play lets you engage with up to 32 players at a time, bringing the gritty, realistic chaos of war to a whole new level.Other multi-player friendly enhancements in Killzone 2 include in-game clan management, a match wagering system, and the ability to integrate new information and track friends and enemies with the community at Killzone.com.", "price": 12.28, "imUrl": "http://ecx.images-amazon.com/images/I/51OZv5%2BxswL._SY300_.jpg", "related": {"also_bought": ["B002I0K6DG", "B0012N3T3Y", "B000JLIXIG", "B003O6E67A", "B001JKTC9A", "B000FQ2D5E", "B000UW21A0", "B00020LZAW", "B002BRZ6UE", "B003P9FRGA", "B002I0J5YW", "B001QXNBNI", "B00269QLH4", "B002ZJNWWC", "B005GM3XVA", "B000ZK9QCS", "B004EQCCI4", "B000ZK7ZOE", "B00503E9FY", "B002I0J82G", "B0050SXGU8", "B0012N94WO", "B002NN7AKU", "B00354NANC", "B002DC8GKO", "B002ELCV00", "B001C4DKG4", "B002I0F5I2", "B000WS97QI", "B0050SWZHS", "B003H0CBYS", "B003L8DXOI", "B00269DX5W", "B008CP6RUW", "B004L5SJ58", "B002I0F5M8", "B0016GC9D8", "B000HGOHWO", "B0016B28WU", "B005JGC5BC", "B003JVCA9Q", "B001NIP3EG", "B000TG72TM", "B000FPOJOS", "B0022TNO7I", "B001AWBYNE", "B0036FDHT2", "B009JBFF9C", "B001COV1CY", "B0050SXLQC", "B000JLIYLC", "B005185SDA", "B002I0GX88", "B000X1TC0U", "B004EDJOYC", "B0050SX2MK", "B005E7LJ6S", "B005C2D1YI", "B001IVPVVS", "B004FYJFNA", "B002BXJ9VA", "B004UDB9SA", "B0050SXX88", "B0037LVW9M", "B008CP6MA2", "B0050SX9VO", "B002I0H2G0", "B000UC5ML0", "B00163LW7K", "B003GT8IL0", "B003O6KWZK", "B0023CBZ70", "B000N4MSAS", "B001ASJIRC", "B000M4KJ32", "B005THAX6K", "B004PAGJNS", "B00576U7W8", "B002BSA1C6", "B000V1OUVI", "B0049LAVB4", "B0050SXOD2", "B00309XHD0", "B00320JAWY", "B0055L9BFO", "B000UU7VUC", "B0050SXFKE", "B0085CA8QG", "B002I0K5NC", "B001ASJIS6", "B0055202HE", "B007CM0K86", "B005N4HBIW", "B000HKP88C", "B001NX6GBK", "B000SQ5LQE", "B001TORSHO", "B003O6ECOM", "B0030CYE8O", "B00275A7LI"], "bought_together": ["B002I0K6DG"], "buy_after_viewing": ["B002I0K6DG", "B008PQU3E4", "B0012N3T3Y", "B001JKTC9A"]}, "salesRank": {"Video Games": 4358}, "categories": [["Video Games", "PlayStation 3", "Games"]]}