{"asin": "B00083XXQM", "description": "From the Manufacturer Sansa e100 Series MP3 players provide high-quality digital music playback with sophisticated navigation and expandable memory at an affordable price. You can add up to 2 GB of additional storage space with the SD slot for more MP3, WMA (including secure WMA content), and Audible audio file formats.FeaturesPlays MP3, WMA (including secure WMA content), Audible audio file formatsSupports Microsoft PlaysForSureDigital FM tuner with 20 preset stationsNew custom navigation allows sorting songs by artist, album, song title, genre, year, date loaded, and moreHi-Speed USB 2.0 port for fast and easy transfer of filesCan be used as an external storage device for data store and transfer.Includes sleek carrying case with armbandEnhanced sound fidelity with SRS WOWMass storage compliant, no drivers requiredUp to 17 hours continuous playback using one AAA battery(included)Indigo backlit multi-line LCD display with ID3 tag info.One-year warrantyChoose your music. Choose your device. Know it's going to work.Look for the PlaysForSure logo if you're shopping for a portable music or video device and you want to make sure the digital music and video you purchase will play back on it every time. Match the PlaysForSure logo on a large selection of leading devices and online music stores. If you see the logo, you'll know your digital music will play for sure.The PlaysForSure logo makes it easy to find digital media stores and devices that work together. Choose from a large number of digital music and video stores, including CinemaNow, MSN Music, MusicMatch, MusicNow, Napster, Wal-Mart Music Downloads, and many more.Look for the PlaysForSure logo on a wide variety of devices including portable music devices, portable video devices, digital audio receivers, Pocket PC's and Smartphones.The checkmarks indicate if the device is capable of playing back audio and/or video that's been downloaded from an online store. Additionally some devices will be able to play back media that has been purchase through an online store that offers subscription or rentals.", "title": "SanDisk Sansa e130 512 MB Digital Audio Player with SD Expansion Slot", "price": 34.99, "imUrl": "http://ecx.images-amazon.com/images/I/51X6KM73F6L._SY300_.jpg", "related": {"also_viewed": ["B002MAPT7U", "B002MAPSC6", "B000BP50AY", "B00066EK3G", "B000BFHWXM", "B005FVNGRS", "B000BONJXU", "B002MAPS6W", "B00HCMZ2SE", "B00083XXTY", "B005FVNH04", "B000BP8AY2", "B004COIBFG", "B00D1ZXVDY", "B005FVNGRI", "B005FVNGS2", "B000OVBSE2", "B005FVNGZU", "B005FVNGZA", "B0076HNNHM", "B00400TGEC", "B000VIHFZ4", "B007V7XQ7E", "B00HCMZ0OK", "B006OSFPZC", "B0041MMMWW", "B00AF40U5G", "B00HCMZ4H8", "B007BGGEOC", "B0001F22R8", "B0015L0T68", "B00HCMZ19Y", "B007B5TQQG", "B005FVNGZK", "B002MAPRYU", "B009RQW3BC", "B003ZUGKHY", "B00E9O6C96", "B001BFLS4U", "B00CE3YJCQ", "B00BJNHGRM", "B004S464WM", "B00ECQUY2M", "B0035PBHX6", "B00EE9B3LI", "B00HCMZ4Z0", "B002XATU5Q", "B007B5TO4A", "B000IM9542", "B00BG13P9K", "B0015L451I", "B0041G62TW", "B001PPTT9M", "B00EE1H7BQ"], "buy_after_viewing": ["B002MAPT7U", "B005FVNGRI", "B002MAPSC6", "B002ODQJKQ"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}