{"asin": "B00009MDBQ", "description": "Lens-making is an art--Nikon artisans craft Nikkor optics from the finest materials, taking pride in adding their intellect and technique to bring the world's finest lenses to life. They push the leading edge of lens-making in their effort to provide the \"glass\" that makes the world's greatest pictures.AF Nikkor lenses work with Nikon SLRs for optimal performance, even the very latest. The Nikon 70-200mm f2.8G IF-ED AF-S VR is a compact, lightweight G-type fast telephoto zoom with Vibration Reduction. VR operation offers the equivalent of using a shutter speed three stops (eight times) faster. In addition, active vibration mode selection is possible, for use in an active situation such as in a car, boat, or plane. VR On/Off mode available.The lens holds a fast and constant f2.8 maximum aperture through the entire focal range. The built-in Single Wave Motor provides ultra-fast, ultra-quiet AF operation. Five ED glass elements offer higher optical performance, and is protected by a dust and waterproof rubber sealing mount.Internal-focusing design smooths focusing and has great body balance, and the filter attachment does not rotate with focusing. It also features an M/A mode that enables instant switching from autofocus to manual with virtually no lag time even during AF servo operation, no power consumption during manual focus operation, rounded diaphragm (9 blades) for natural blur, and focuses as close as 4.9 feet in autofocus and 4.6 feet in manual focus. High-performance Nikon Super Integrated Coating offers superior color reproduction and minimizes ghost and flare. Detachable tripod mounting collar provided.The new G design enables apertures to be selected from select Nikon AF SLR camera bodies, incorporating distance information for flash and ambient light exposure processes. Fully compatible with Nikon TC-14E II, TC-17E II, and TC-20E II teleconverters and D1X, D2H, D1H, D100, D70, F6, F5, F100, N80, N75, and N65 cameras.ED glass: An essential element of Nikkor telephoto lensesNikon developed ED (Extra-low Dispersion) glass to enable the production of lenses that offer superior sharpness and color correction by minimizing chromatic aberration. Put simply, chromatic aberration is a type of image and color dispersion that occurs when light rays of varying wavelengths pass through optical glass. In the past, correcting this problem for telephoto lenses required special optical elements that offer anomalous dispersion characteristics--specifically calcium fluoride crystals. However, fluorite easily cracks and is sensitive to temperature changes that can adversely affect focusing by altering the lens' refractive index. So Nikon designers and engineers put their heads together and came up with ED glass, which offers all the benefits and none of the drawbacks of calcium fluorite-based glass. With this innovation, Nikon developed several types of ED glass suitable for various lenses. They deliver stunning sharpness and contrast even at their largest apertures. In this way, Nikkor's ED-series lenses exemplify Nikon's preeminence in lens innovation and performance.Nikon Super Integrated Coating ensures exceptional performanceTo enhance the performance of its optical lens elements, Nikon employs an exclusive multilayer lens coating that helps reduce ghost and flare to a negligible level. Nikon Super Integrated Coating achieves a number of objectives, including minimized reflection in the wider wavelength range and superior color balance and reproduction. Nikon Super Integrated Coating is especially effective for lenses with a large number of elements, like our Zoom-Nikkors. Also, Nikon's multilayer coating process is tailored to the design of each particular lens. The number of coatings applied to each lens element is carefully calculated to match the lens type and glass used, and also to assure the uniform color balance that characterizes Nikkor lenses. This results in lenses that meet much higher standards than the rest of the industry.Internal FocusingImagine being able to focus a lens without it changing in size. Nikon's IF technology enables just that. All internal optical movement is limited to the interior of the non-extending lens barrel. This allows for a more compact, lightweight construction as well as a closer focusing distance. In addition, a smaller and lighter focusing lens group is employed to ensure faster focusing. The IF system is featured in most Nikkor telephoto and selected Nikkor zoom lenses.Distance informationD-type and G-type Nikkors relay subject-to-camera distance information to AF Nikon camera bodies. This then makes possible advances like 3D Matrix Metering and 3D Multi-Sensor Balanced Fill-Flash. Note: D-type and G-type Nikkors provide distance information to the following cameras: Auto exposure; F6, F5, F100, F90X, F80, F75, F70, F65, F60, F55, F50, Pronea S, Pronea 600i, D2 series, D1 series, D100, and D70s/D70. Flash control; F6, F5, F100, F90X, F80, F75, F70, D2 series, D1 series, D100, and D70s/D70 cameras.G-type Nikkor lensThe G-type Nikkor has no aperture ring; aperture should be selected from camera body.Silent Wave MotorNikon's AF-S technology is yet another reason professional photographers like Nikkor telephoto lenses. AF-S Nikkors feature Nikon's SWM which converts \"traveling waves\" into rotational energy to focus the optics. This enables high-speed autofocusing that's extremely accurate and super quiet.M/A modeAF-S Nikkors feature Nikon's exclusive M/A mode, that allows switching from autofocus to manual operation with virtually no time lag--even during AF servo operation and regardless of AF mode in use.Vibration Reduction (VR)This innovative VR system minimizes image blur caused by camera shake, and offers the equivalent of shooting at a shutter speed three stops (eight times) faster. It allows handheld shooting at dusk, at night, and even in poorly lit interiors. The lens' VR system also detects automatically when the photographer pans--no special mode is required.VR operation works with the Nikon F6, F5, F100, F80, F75, F65, D2-series, D1-series, D100, D70-series, and D50 cameras.What's in the Box:Lens, 77mm snap-on front lens cap, rear lens cap LF-1, bayonet hood HB-29, soft pouch CL-M2.", "title": "Nikon 70-200mm f/2.8G ED-IF AF-S VR Zoom Nikkor Lens for Nikon Digital SLR Cameras", "brand": "Nikon", "imUrl": "http://ecx.images-amazon.com/images/I/41nn1v93WML._SX300_.jpg", "related": {"also_bought": ["B00004ZCJM", "B000VDCT3C", "B000VDCTCI", "B0030BG8ZC", "B0045KGZOG", "B00603RW48", "B0042X9L6A", "B00004ZCI3", "B002K40R8E", "B00CXM03D2", "B0002WT6S8", "B0095ZLP3C", "B00005LEOS", "B00007EDYY", "B00FOTF8M2", "B0099XGZXA", "B0050YG3CU", "B000BYCKU8", "B0009M1O9A", "B0098TAGHQ", "B001BTCSI6", "B0000BZLBQ", "B004Y1AYAC", "B0002EMY9Y", "B000EOSHGQ", "B000PTFDYO", "B001GCVA0U", "B002VPE1WK", "B0043RTLNS", "B007BD4BRC", "B00015GYU4", "B00BI9X7UC", "B00009R9EO", "B0001DLYJC", "B00017LSPI", "B0000BZLAD", "B004YW79F4", "B003TYDBYQ", "0385344783", "B0076UXKDG", "B000BYCKUI", "B00436G2OU", "B0076AYNXM", "B005681P3W", "B00004ZCIC", "B007NDL56A", "B002ZIMEMW", "1285084519", "B005DIYQA4", "B00BJ3NGFS", "B005PCDSBQ", "B001T9NXA0", "B00E8NLOY6", "B000VDF5RO", "B000RXW0AI", "B00508ZURU", "B00007EDZG", "B003Y30334", "B000144I2Q", "B006G5ZVA2", "B005UG3KS8", "B00FSG1INY", "B0042X9LC4", "B00006JN3G", "B004TGZ7WM", "B004861IX0", "B000YIWR8G", "B009PBUK9Q", "B001ET5U92", "B00CV9MNH6", "B007BXD66E", "B005EP26J4", "B00006I5JZ", "B0036AYTWG", "B005FDJC6K", "B000VJX7DW", "B005LFT3QG", "B0013A1XDE", "B00551636O", "B0009PEU3Y", "B003D8KV0K", "B000144I30", "B00BXA7N6A", "B006TAP096", "B007RZB3KM", "B001S2PPT0", "B0080JH3YE", "B00A9PB8WU", "B005LZX1W8", "B002L60TTI", "0817439390", "B00006I5JC", "B003Y2KC7W", "B004AZ38Z0", "B0098TG67U", "B00CH6ATMO", "B002WE4H8I", "B0014D2WGW"], "bought_together": ["B00004ZCJM"], "buy_after_viewing": ["B002JCSV8U", "B0000BZLBQ", "B003HC8VA4", "B0045KGZOG"]}, "categories": [["Electronics", "Camera & Photo", "Lenses", "Camera Lenses", "Digital Camera Lenses"]]}