{"asin": "B000MUV6BA", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "To tech-savvy, sophisticated, and discerning videographers who demand a premium quality camcorder, the Canon's HV20 enables the ultimate in HD video and still photo quality. The HV20 offers an unparalled combination of a 10x optical zoom, a 2.96-megapixel CMOS sensor, and a stylish design. With HD and SD recording modes, you can make the move to HD while retaining compatibility standard-definition equipment. Capturing meticulous detail and superior color reproduction, the HV20 raises the bar for HD resolution quality.HV20 HighlightsHDV formatThe HV20 records true 1080 high-definition resolution video, and is capable of recording and playing back HD images using MiniDV cassette tapes.Canon True HD CMOS sensorThe HV20 features a Canon-manufactured CMOS sensor. Similar to its use in Canon's EOS-series digital SLR cameras, CMOS reproduces high-resolution images with true HD information in movies. Canon's CMOS sensor acquires image information at 1920 x 1080. Canon's HD CMOS Sensor also features on-chip noise-reduction technology. The low noise technology feature means that even in dimly-lit scenes, the signals from each pixel are as pure as possible, with minimal \"noise\" or other aberrations.RGB Primary Color FilterWhether you're shooting video or photos, you will appreciate the HV20's stunning, high-definition image production. For rich, accurate color, the HV20 uses an RGB Primary Color Filter. It separates light into red, green, and blue color components, resulting in vibrant images with natural-looking tones similar to what you'd obtain from 3CCD camcorders.Genuine Canon 10x high-definition video lensThe HV20 comes equipped with a Genuine Canon 10x HD video lens. An aspherical lens is used to help achieve low aberration and high resolution. The HV20 lens also features super-spectra coating technology, which lowers flare and ghosting. A new gradation ND system is used for better exposure in bright shooting situations. The lens design creates true HD image quality.DIGIC DV II image processorDIGIC DV II is Canon's exclusive DIGIC DV signal processing technology designed specifically for HD. Even though video and still images have different color requirements, DIGIC DV II HD digital signal processing ensures optimal image quality for both HD video and still images. Thanks to DIGIC DV II image processing, the HV20 produces video with improved color reproduction -- especially in skin tones, and dark and light scenes. It also uses a hybrid noise reduction system that employs two types of noise reduction, for images that are crystal clear.Super-Range Optical Image StabilizerThe HV20 features Super-Range Optical Image Stabilization (OIS). Utilizing a hybrid detection method (combining vector and gyro detection method), it corrects camera shake instantly for steady shots -- even when they're handheld at long focal lengths, or taken with the camera in motion. And unlike electronic stablization, which can cause a loss in image quality, the optical system corrects the shake while preserving the quality. It is even effective while taking photos.24p Cinema Mode24p Cinema Mode is a feature demanded by professional filmmakers and previously only available on pro-level camcorders. 24p Cinema Mode enables all aspiring moviemakers a professional \"film look.\" This mode is actually two different features, which can be used independantly or together, depending on the user's preferences:The frame rate changed to 24p -- the same frame rate as movie filmThe HV20 changes the color and tonal characteristics to make you feel like you are watching a movie in the theatre.Instant AF (Auto Focus)Instant AF is Canon's new and advanced autofocus system. Using a Hybrid Control system that combines an external sensor and a TVAF, Instant AF makes it easier to focus on previously difficult subjects. It dramatically decreases the time it takes to achieve proper focus and increases accuracy, especially in low-light and high-brightness situations.HDMI terminalThe HDMI terminal transports high-definition video signals (with audio in one cable) to your HD television.Built-in electronic lens coverA built-in electronic lens cover automatically opens when the camcorder is turned on and closes when turned off. There is no dangling lens cover to lose.Advanced accessory shoe terminalThe advanced accessory shoe allows the use of additional accessories such as a video light and directional microphone.Simultaneous photo shootingWhile shooting an HDV movie, you can simultaneously capture a 2-megapixel photo to a memory card by simply pressing the photo button. It's perfect for any time you don't want to miss a moment.Histogram displayCommonly used in Canon's line of digital SLR cameras, the HV20 features a histogram display. With just one push of a button, the brightness information of a still image is revealed. This allows you to monitor image quality so you can make adjustments for the next shot.Program AE modeThe HV20 gives you settings that automatically result in the best exposure settings for different conditions. Secen modes include: Portrait, Sports, Night, Snow, Beach, Sunset, Spotlight, and Fireworks. Each adjusts your camcorder's settings to compensate for different lighting conditions and different subjects.9-Point Ai-AF modeAuto Intelligent Auto Focus ensures sharp images and creative flexibility. Even when your subject isn't in the center of the frame, the HV20's Ai-AF function will automatically select from 9 metering frames on the screen to help bring images into sharp focus.Built-in flashCapture superb images in low light and indoor photography settings.Built-in Ultra Video lightIncrease your low-light capabilities even further by shooting with the HV20. Featuring an Ultra Video light, the HV20 enables you to shoot subjects in color in low-light at distances up to 4.9 feet away.Mic/headphone terminalThe HV20 features a microphone terminal for attaching an external microphone. The audio/video terminal doubles as a headphone terminal for monitoring sound while recording. The HV20 also offers manual audio level adjustment, giving the user precise control.Focus Assist functionWhen shooting high definition, a properly focused subject is more critical than ever. With one push of the Focus Assist button (during manual focus setting), video zoom and peaking (for emphasizing image contours) are displayed. Not to worry, this is automatically cancelled when recording starts.Level and grid markersIt's easy to keep your D120 level for more professional-looking video. Simply press the Level Shot Control button, and a horizontal marker appears in your viewfinder. Line up any horizontal lines in your shot to the marker and you know your camcorder is level. Also, the grid marker is very convenient for setting up the special balance in your shots. Since background colors vary, you can select from two line colors to make the lines easily visible.Variable zoom speed control with 5 presetsWith this innovative feature, you can always be sure of smooth, steady, professional-looking zoom shots. Simply select one of five pre-set zoom speeds.3.1-megapixel photosCapture stunning 3.1-megapixel photos in 4:3 aspect ratio to a miniSD card, or 2-megapixel photos in 16:9 aspect ratio.Capture 2-megapixel still images from tapeWhile playing the recorded movie, you can capture 2-megapixel still images onto a miniSD card, simply by pressing the Photo button. If you prefer, you can even capture 2-megapixel photos while recording HD video to tape.2.7-inch widescreen LCD and widescreen color viewfinderA widescreen LCD and widescreen viewfinder lets you see exactly what your camcorder is recording, and what your TV will display later.Print/Share buttonFor fast, easy, one-touch printing of your photos at home, simply press the camcorder's Print &amp; Share button. The button can also be used for one-touch downloading of your images to a computer.", "title": "Canon HV20 3MP High Definition MiniDV Camcorder with 10x Optical Image Stabilized Zoom", "price": 899.0, "salesRank": {"Camera &amp; Photo": 3079}, "imUrl": "http://ecx.images-amazon.com/images/I/413ln0bZ%2BtL._SX300_.jpg", "related": {"also_bought": ["B001P95FZ0", "B001DABPPK", "B00006JPWW", "B0039GKJ1W", "B000AAZQM2", "B00007FWP2", "B001C1SU2G", "B001TH7GVY", "B001P8XVK2", "B0000632H7", "B000I5YZL2", "B003L4P872", "B002RWJGTU", "B000OT94PO", "B003PBB4ME", "B0010PASMY", "B002GYPS3M", "B000DZFSFY"], "buy_after_viewing": ["B00114PN1U", "B003VNKNF0", "B001P95FZ0", "B001TH7GVY"]}}