{"asin": "B00002STEZ", "description": "If Mario is Nintendo's Luke Skywalker, then it's safe to say that Donkey Kong is Nintendo's Darth Vader. Originally cast as the primate villain in the Donkey Kong arcade game back in the early '80s, Kong and his many descendants have stepped away from the \"dark side\" and become forces for good. While it's genetically unlikely that Kong is Mario's father, it's been well documented that Kong and company have been enlisted to rescue Nintendo in times of trouble. Remember when the Super NES was \"threatened\" by Sega's 32-bit/CD add-on hype? A game called Donkey Kong Country came out, featuring prerendered graphics never before seen on a home console. Not only did it breathe new life into the Super NES' sales, it spawned a profitable series that kept Nintendo's 16-bit scene alive for years to come. Fast forward to 1999. Sega and Sony again threaten the Nintendo 64 with superior game consoles, and once again Nintendo calls on Kong's descendants to breathe new life into its 64-bit system with Donkey Kong 64. While this much-anticipated 3D adventure game has high-quality gameplay and plenty of variety to fuel Nintendo's sales this holiday season, it lacks enough \"wow factor\" to exert the revolutionary influence that Donkey Kong Country had. Donkey Kong 64 starts with a well-worn storyline: Donkey Kong's isle of paradise faces destruction by an invading K.Rool and his crocodile Kremlings. Donkey now has four friends to help him defeat K.Rool: Diddy Kong, his perennial sidekick; Lanky Kong, an ape with super-stretchy limbs; Tiny Kong, a teenybopper who can shrink to fit into small holes; and Chunky Kong, a muscle-bound lunkhead who can lift boulders and smash down doors. Veterans of the Donkey Kong series will also note the return of old-timers like Cranky, Funky, and Candy, all of whom upgrade the Kongs with new abilities, hints, shooting weapons, and musical instruments that help unlock hidden areas. For the most part, Donkey Kong 64 is an explore-and-collect adventure. Those who obtain perverse pleasure from collecting every last coin and item in this type of game will be titillated - and those who don't will be frustrated. The main thrust is to find 200 golden bananas in the main world and in the seemingly standard individual stages: an underwater level, a forest level, a jungle level, an industrial level, etc. As expected, almost none of these bananas are in plain view - multipart puzzles and obstacles impede the way to these treasures. However, there's plenty more to collect: regular bananas, fairies (which you must take pictures of with a camera), banana medals, super-secret Rareware coins, blueprint pieces (found by defeating certain enemies), crowns (to unlock multiplayer games) and boss keys (to unlock new areas on the island). Now, factor in that each of the five characters must find some of these items individually: Devoted gamers will see this as added replay value, while others will see it as a royal pain in the Donkey derriere. If that weren't enough, it seems the developers threw every gameplay style they could think of into the mix. This gameplay variety is perhaps this title's main strength, although the quality of the games varies. For starters, the game has a separate two-to four-player mode, with games such as a battle arena, where Kongs can beat up each other in a circular ring, or a GoldenEye-type shooting game. In the adventure mode, you earn golden bananas by completing mini-bonus games. Some are true games in their own right, such as a racing track, race-boat water course, or mine-cart roller coaster - all of which look impressive in 3D. Some of these games are less visually impressive but are entertaining nevertheless, such as a maze where the Kong must avoid enemy detection, or a bug splattering stage. The remaining games - such as a simple target-shooting session or a slot machine - are either run-of-the-mill or too easy to sustain long-term interest. Finally, a couple of bonus games are direct translations of old-school titles, including a partial version of the original Donkey Kong arcade game that'll bring back memories for some. Since the Kongs learn unique abilities as the game progresses, some Kongs have special stages, as well. Remember the barrel-blast levels in the 16-bit games? Donkey now plays them in 3D with a target sight. As the barrel moves, you can shoot Donkey out to other barrels. Diddy gets a jet pack that lets him complete some flying stages, while the other three characters learn other impressive skills, such as shrinking (Tiny), climbing up steep slopes (Lanky), and lifting or breaking heavy objects (Chunky). If that weren't enough, some characters can transform into animals, such as a rhino or a swordfish, to break into boxes or secret areas and kill bothersome enemies.--Nelson Taruc--Copyright &#169; 1998 GameSpot Inc. All rights reserved. Reproduction in whole or in part in any form or medium without express written permission of GameSpot is prohibited.--GameSpot Review", "price": 488.98, "imUrl": "http://ecx.images-amazon.com/images/I/613Feh1FlKL._SX300_.jpg", "related": {"also_bought": ["B00000INR2", "B00000F1GM", "B000Y0CHX4", "B00000DMAQ", "B00000DMAX", "B00002STH0", "B00002DHEV", "B00002STFH", "B00000ID61", "B00000J2W7", "B00005M8TL", "B00004SWLT", "B00003OTI3", "B005GTNBGK", "B000YOCGUO", "B00004S9AA", "B00004R9IB", "B00004U1R1", "B000PJHAD6", "B000031KJM", "B0015OG4G4", "B002TK1PX0", "B005DI7N7W", "B003UI5GLC", "B00000J2OO", "B005GTND0E", "B00000IFRI", "B00000ID60", "B00004S9A7", "B00004U1QY", "B000F9JFXE", "B000058BCU", "B005GTNC8W", "B003ZU0PHU", "B000046Q7Q", "B00005B4Q7", "B00000DMAO", "B00002970G", "B00000K1AF", "B00004U1R3", "B007SJMEHI", "B000QHOHHE", "B00001QES1", "B00002STI2", "B00005AW1W", "B00001WRJO", "B00003E4EB", "B000038A6U", "B000JVM256", "B002J44BXW", "B00001OX4T", "B000021Y2Z", "B00005AQRH", "B00002SVFZ", "B0009Y808Q", "B00000I1BE", "B00000DMB9", "B0046CZX78", "B00002SVG2", "B00002STXG", "B00B7NLV6Q", "B000050FAE", "B000046S41", "B00000JHPD", "B00AFJMFJA", "B00002STXQ", "B0013KR3QA", "B00002SVG3", "B003DK353S", "B00856304Y"], "bought_together": ["B00000DMAX"], "buy_after_viewing": ["B00000F1GM", "B002TK1PX0", "B00002STH0", "B005GTNBGK"]}, "salesRank": {"Video Games": 1213}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "More Systems", "Nintendo 64", "Games"]]}