{"asin": "B0035LBRM6", "categories": [["Electronics", "Camera & Photo", "Lenses", "Camera Lenses"]], "description": "The M. Zuiko Digital ED 9-18mm F4.0-5.6 (35mm equivalent 18-36mm) lens is designed to maximize the performance advantages of the Micro Four Thirds System, and it's significantly lighter and more compact--easily fitting in a jacket pocket.The new lens, made with ED (extra-low dispersion) glass for superior image quality, complements the design of the PEN cameras, including the powerfully simple E-PL1, making it the all-in-one package for consumers with any skill level, including those who are new to photography.The Micro Four Thirds System standard meets the telecentric requirements of dedicated digital design. Light rays strike the imaging element nearly head-on for optimum edge-to-edge image reproduction. It also enables much more compact design than the Four Thirds System standard (or other interchangeable lens systems) because it reduces the outer diameter of the lens mount by 6mm, and the distance from the lens mount to the sensor (the flange back distance) by approximately half. As a result, M. Zuiko Digital Micro Four Thirds System lenses offer uncompromising professional quality for capturing both still-images and High-Definition (HD) videos, and the lenses are exceptionally compact to make capturing your life more fun.The super wide-angle M. Zuiko Digital ED 9-18mm F4.0-5.6 zoom lens (35mm equivalent 18-36mm) offers a 100 percent angle of view, and overturns the rule that super wide-angle zooms have to be big and heavy. With a length of just 49mm and a weight of just 155g, it is less than half the size and 60 percent of the weight of the ZUIKO Digital ED 9-18mm F4.0-5.6. With its wide angle of view, including background scenery in group photos is a snap, and it can be used to create unique images with a sense of dramatically exaggerated perspective.By maximizing the advantages of the Micro Four Thirds System design, compact size, low weight and amazing image quality, the new lens significantly expand the photographic potential of the system. The inner focusing mechanism uses a light, compact, single-element unit to enable exceptionally fast, quiet autofocusing for smooth, superior operating ease during still and video capture. The manual focusing mechanism is designed to offer a responsive feel and precise operation, enabling you an affordable, high-quality means to capture your life in stills or HD videos.The 9-18mm lens also offers quieter and more responsive AF performance, and provide professional image quality for capturing amazing still images and videos. It is compatible with all Micro Four Thirds System Olympus PEN cameras, and all other current and future cameras that comply with the Micro Four Thirds System standard. When mounted on an Olympus PEN camera, the lens is stabilized thanks to the camera's in-body Image Stabilization system and offer effective shake compensation at all focal lengths.", "title": "Olympus M ED 9-18mm f/4.0-5.6 micro Four Thirds Lens for Olympus and Panasonic Micro Four Third Interchangeable Lens Digital Camera", "price": 699.0, "imUrl": "http://ecx.images-amazon.com/images/I/415vB3NpEuL._SY300_.jpg", "brand": "Olympus", "related": {"also_bought": ["B003YCOL7Y", "B0000BZL47", "B0057LCUFK", "B00CI3TQSO", "B00EQ07PG2", "B007SK9GCS", "B00HWMP0XG", "B0096WDK0K", "B00CI3R53W", "B004RAU3OC", "B00EY3YGBS", "B0074WDFSQ", "B0058PL9QG", "B0084FM5JC", "B0035LBRMQ", "B007EZGOMC", "B00B3QYBIW", "B0000BZL1P", "B0066J6EOU", "B0043VE28S", "1285429966", "B0074WDGAI", "B002BZE4RM", "B00I19TVU2", "B007TNFT5M", "B0000BZL3G", "B0055N2L22", "B0074WDFHM", "B00CI3R4VU", "B00HPQ09GM", "B007TN2PF4", "B00HPQ09H6", "B0010HDY9Q", "B0051QL7E6", "B00CFCTH14", "B0074WDDN8", "B0058PL9R0", "B00EQ07PAI", "B0074WDERI", "B000A1SVXC", "B005TOU804", "B0061GS1OO", "B00111Y292", "B007TMYRVA", "B002CGSYOO", "B0073A1EBE", "B00CSU5Q5O", "B009DL0LOW", "B0000BZL68", "B002KDVQXU", "B00HPQ09NA", "B00DJS830Y", "B009B0X9PI", "B004OI0NGK", "B00009KLAD", "B00843ERMW", "B007TN0JKW", "B00B02FXJU", "B007VWZVB8", "B002IKLJVE", "1305106628", "B0058PL9RA", "B005J5TZWK", "B00AWVG0J2", "B0057LX9H8", "B0074WDFOK", "B004Q3Q9OS", "B00AWVB4R0", "B000TXHE20", "B009V71HEQ", "B00A7Q9U9Y", "B009I32Y6S", "B00BUXERJQ", "B00HWMOZ8M", "B00CHPQ2IA", "B00DHEQO6U", "B00BMGV4J2", "B00004ZCJG", "B0096WDMGC", "B0048IH5EY", "B00HWMOZEG", "B0009WKRNE", "B0000BZL7S", "B004OVE174", "B00J3KA814", "B000ILHQA8", "B0083WYFWG", "B00E87OITK", "B00EY6AV3W", "B0081RN9YI", "B006FKR1PG", "B0043VE29C", "B00CI3R4XS", "B004IK8F32", "B00004ZCJE", "B007TMZW2S", "B0040Q11G2", "B003Y35VMM", "B00EHJNASY", "B00E87OK84"], "bought_together": ["B003YCOL7Y", "B0000BZL47"], "buy_after_viewing": ["B0000BZL1P", "B00I19TVU2", "B00EY3YGBS", "B0066J6EOU"]}}