{"asin": "B0000C0XS0", "categories": [["Electronics", "Computers & Accessories", "Routers"]], "description": "Amazon.com Product Description.caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The NETGEAR WGT624 Super-G Wireless Router offers:Up to 108 Mbps via 802.11g wireless networking.4-port Ethernet switch for wired connections.Double Firewall protection to defend your computer from external hacker attacksWireless networking is constantly evolving, and the need for increasingly faster speeds and greater range is not only sought after, but expected. If better wireless speed and range with consistent wireless connections is what you're looking for, then NETGEAR has you covered with the WGT624 Super-G Wireless Router. With this handy device you'll have no more dropped connections, and you can kiss dead spots goodbye.With Super-G networking, the WGT624 can deliver speeds up to 108 Mbps.View larger.This compact, stylish router provides a simple and secure way to share your high-speed Internet connection. The WGT624 has a 4-port switch, and delivers twice the speed and four times the coverage of the standard Wireless-G protocol. And to achieve maximum performance, NETGEAR suggests using Super-G wireless adapters, such as theSuper-G Wireless PC Card,Super-G Wireless PCI Adapter, or theSuper-G Wireless USB 2.0 Adapter.If security is a concern, you can rest easy knowing that your network is being powered by this router. Designed to be configurable for private networks or public hotspots, the WGT624 features double Firewall protection to defend your computer from external hacker attacks. And with Touchless Wi-Fi Security, this device makes securing your network a breeze.The routing protocols for the WGT624 are both static and dynamic routing. This device works with most Internet gaming and instant messaging applications, and other applications that support Universal Plug and Play (UPnP) for automatic Internet access. Other functions include:Automatic ISP detectionExposed Host (DMZ)MAC address authenticationTime-based usage controls\"Trusted User\" controlsURL content filteringLogs and e-mail alerts of InternetWireless Access ControlWi-Fi Protected access (WPA)Pre-shared Key remote managementSetup is made quick and easy with the Smart Wizard install software. System requirements include a broadband (cable or DSL) Internet Service and a modem with an Ethernet connection; 2.4 GHz wireless adapter or Ethernet adapter and cable for each computer; Microsoft Windows Vista, XP, 2000, NT, Me, 98, 95, or other operating systems running a TCP/IP network; and Microsoft Internet Explorer 5.0 or higher, Netscape 4.7 or higher, or Firefox 1.0 or higher, and Safari for Mac. Microsoft Vista Beta drivers are available at www.netgear.com/vista.What's in the BoxNETGEAR WGT624 Super-G Wireless Router, setup CD, power adapter, Ethernet cable, vertical stand, setup guide, and warranty/support information card.", "title": "NETGEAR WGT624NA Wireless G Firewall Router", "price": 56.0, "salesRank": {"Electronics": 63157}, "imUrl": "http://ecx.images-amazon.com/images/I/31f1r1PDLAL._SX300_.jpg", "related": {"also_viewed": ["B00008SCFL", "B001UI4RTG", "B0001FXLUA", "B004H1PMJC", "B00KFD0O9E", "B00006B9H9", "B004N6259G", "B0001D3K8A", "B001AZP8EW", "B000BTL0OA", "B000MANHJE", "B007KZQM9G", "B00895BUPC", "B002RYYZZS", "B001FWYGJS", "B0000D8HK1", "B00007KDVI", "B003B48UNG", "B002HWRJY4", "B008HO9DK4", "B0087B6SV4", "B0007U9KAY", "B000QD7B6W", "B0045HG53K", "B006TZM6XO", "B002VJL0OS", "B0081H8TRA", "B005KG44V0", "B0085WN7YQ", "B008IFXQIW", "B00006HYKM", "B002FOTH44", "B0001PFQ08", "B0041LYY6K", "B000X4TJ6Y", "B00E37JFH0", "B004ZMXE66", "B0062KA4VM", "B00008ZPJU", "B0036R8FCO", "B0044YU60M", "B0002HA7FY", "B00EM5UFP4", "B0050SLU6K", "B006GDTTM0", "B0081HD3PI", "B001CNCQO2", "B004T9RR6I", "B008LTPFG6", "B001CN9K6E", "B00E92LIQU", "B004N625AA"], "buy_after_viewing": ["B00008SCFL", "B001UI4RTG", "B00A3YN0Z0", "B008HO9DK4"]}}