{"asin": "B001M4N956", "description": "Premium Comfort and Style for Your MacDesigned to complement your Mac in every way, this elegant, ultra-slim keyboard brings a high level of comfort and convenience to your Mac. Precision micro-scissor keys and a standard Mac layout let you type faster and more comfortably, and dedicated one-touch controls give you easy access to your favorite applications.Key FeaturesModern, Elegant Styling Accented by Glossy Black and Brushed AluminumThe ultra-slim profile, glossy black finish, and brushed aluminum palm rest give this keyboard a premium look that complements your Mac.PerfectStroke Key System for Typing that&rsquo;s Silent, Natural and FluidPrecision micro-scissor keys provide greater key travel than typical keyboards and distribute force evenly across the surface of the keys, so every key stroke is comfortable, fluid, and silent.Battery Life Up to 3 Years and Low-Battery Indicator to Help Eliminate SurprisesAdvanced battery management technologies mean that batteries will last up to 3 years. The convenient LED battery level indicator notifies you when batteries are low.Optimized Mac Controls for Easy One-Touch AccessDedicated one-touch controls give you easy access to your favorite applications, including Mail, Safari, iTunes and more.Check out these Mac-compatible products from LogitechLogitech Alto ConnectThis stylish notebook stand raises your notebook&rsquo;s display, includes additional USB ports, and when combined with a Logitech keyboard and mouse, encourages a more natural typing position.Logitech CordlessDesktop WaveThe Wave keyboard design instinctively guides your hands into a natural position for enhanced comfort and productivity. The wireless laser mouse delivers exceptional precision.Logitech diNovo Edge,Mac EditionThe ultra-slim profile and elegant styling of the diNovo Edge, Mac Edition are complemented gracefully by easy, one-touch controls to launch your favorite Mac OS applications.Logitech VX Nano Cordless Laser Mouse for NotebooksThe ultra-portable VX Nano is always ready to go. Plug the world&rsquo;s smallest USB receiver into your notebook&rsquo;s USB port just once, then forget about it.Logitech QuickCam Vision ProFeaturing autofocus and Carl Zeiss optics, the QuickCam Vision Pro adds razor-sharp video to your Mac OS video applications &mdash; including iChat and Photo Booth.", "title": "Logitech diNovo Mac Edition Keyboard", "price": 59.95, "imUrl": "http://ecx.images-amazon.com/images/I/414jPxtfseL._SX300_.jpg", "related": {"also_viewed": ["B005L38VRU", "B005L38VPC", "B0099SMFP2", "B001U0WQJM", "B000J43HJ8", "B0000DBJ8A", "B001FB55GC", "B000A0C6OS", "B003ZG9T62", "B0078FDOPS", "B00F9VPDJI", "B00D9I47L8", "B00426HI8U", "B007X3VEBG", "B001F51G16", "B005DLDTAE", "B00DR9V1T0", "B007F10V60", "B0078FDOOE", "B006T3RM08", "B007VL8Y2C", "B003VAGXWK", "B007X3VEAW", "B00A7Z0WQ0", "B001IOHAVO", "B0093H9EXA", "B002NP8XJ0", "B002C7JG4A", "B001NXDQBI", "B004MF11MU", "B003N3HFI6", "B003H987VK", "B007PJ4PN2", "B005DLDO4U", "B0045JFU4I", "B006M7IDTA", "B00GGM6R62", "B007GJ4QC6", "B000E204LY", "B0000ACOBG", "B00G3CLLT8", "B0009VU7RG", "B0081TIE64", "B004L9M0AO", "B009JP461G", "B00DR8LA60", "B00EDI0WW6", "B009ZRR8R2", "B008PFDUW2", "B0011FOOI2", "B0000UV0JA", "B004XQWGHW", "B008PFABI8", "B0076KUTKS", "B005EOWBHC"], "buy_after_viewing": ["B005L38VRU", "B005L38VPC", "B0099SMFP2", "B003VAGXWK"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Keyboards"]]}