{"asin": "B0012N94WO", "description": "Experience the thrill and terror all over again withResident Evil 5for PS3. Featuring Chris Redfield of the originalResident Eviland Sheva Alomar, a West African agent of the Bioterrorism Security Assessment Alliance (BSAA), this sci-fi survival game is staged in a remote desert colony packed with hordes of fast-moving, quick-thinking enemies that represent a whole new breed of evil..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; } img.withlink {border:1px black solid;} a.nodecoration {text-decoration: none}Cooperative game play options let you take teamwork to a new level.View larger.Dramatic graphics and lighting effects add a realistic edge to your mission.View larger.Move through vast environments that have a discernable impact on game play.View larger.You'll face faster enemies backed by improved AI.View larger.Meet Two Fierce, Playable Main CharactersBack from the original title andResident Evil: Code Veronica, former S.T.A.R.S. special forces team member Redfield is a battle-tested, founding member of the BSAA. With a reputation for superior marksmanship and phenomenal hand-to-hand combat abilities, he's on the ground and up against a new strain of evil.You'll call his shots from the same over-the-shoulder third person viewpoint that distinguishedResident Evil 4, except this time you'll also have the option of playing as his teammate, the fierce, local Alomar. Whoever you play as, updates to the earlier version's third-person control scheme offer more options and promise intuitive interactions.Learn to Work TogetherThe new cooperative game play element focuses on the realities of a dual-agent mission, highlighting the ways in which Redfield and Alomar must work together to survive the unexpected, while still allowing them to split up and work alone. To help you maximize the potential of this setup, two-player online and offline co-op modes ensure that you have options when picking a partner.Steel yourself Against the Harsh Reality of KijujuAn advanced version of Capcom's proprietary MT Framework game engine brings groundbreaking graphics and effects to Kijuju, the highly-developed environment where this game's action takes place. New, lifelike lighting schemes highlight the differences between harsh sunlight and extreme darkness, and when you move from one to the other, you'll have to wait for your character's eyes to adjust before you can see clearly, adding to the suspense and challenge of navigating this game's environs.Face the Next Generation of EvilYou'll face new enemies with faster reflexes and improved AI, designed to be as dangerous alone as they are in groups and to keep evenResident Evilmasters on their toes. Thankfully, they're not the only ones who have evolved. This game also offers access to powerful new weapons variations that extend your destructive capabilities.And the updated, quick-select inventory system allows for real-time inventory management, as well as allowing characters to trade items and allowing you to place an item on the directional pad for instant access. Add all this to a detailed storyline the touches on what the past ten years have meant for Redfield and a Hollywood-caliber soundtrack, and it's clear that the latest installment in this series really does showcase all the elements at the heart of horror gaming.", "price": 14.99, "imUrl": "http://ecx.images-amazon.com/images/I/51-2rD3mH0L._SY300_.jpg", "related": {"also_bought": ["B0050SXLQC", "B004UDB9SA", "B000HKP88C", "B00B59L9T6", "B0085CA8QG", "B002I0H2G0", "B002I0K6DG", "B0022TNO7I", "B006ZTHFPS", "B008CP6MA2", "B002ZJNWWC", "B007TYC8MI", "B0017ZIIK6", "B0050SWZHS", "B0050SXX88", "B00503E9FY", "B000UW21A0", "B0050SXEM8", "B0050SWSQQ", "B000ZK9QCS", "B008MO6AQO", "B0012N5MIO", "B002BSA1C6", "B001SGZL2W", "B00DT55P94", "B007SRM5U6", "B003L8DXOI", "B007CM0K86", "B002I0J82G", "B004PAGJNS", "B00D4AK17A", "B002NN7AKU", "B000P46NMA", "B003C1I06U", "B009GZX49Y", "B003O6CBIG", "B002EE1P2W", "B002ELCV00", "B000FQBF1M", "B004FS8LYK", "B003O6KWZK", "B001JKTC9A", "B0045U01OG", "B0036FDHT2", "B008CP6RUW", "B005DVAB0A", "B000FII8KQ", "B000JLIXIG", "B00269DX5W", "B00309XHD0", "B00BMFIXKQ", "B0050SXKU4", "B002TDIEEK", "B003P9FRGA", "B001TOMQOY", "B002I0J5UQ", "B007MM9E2E", "B000X1TC0U", "B004HYK8Y8", "B003O6E1JS", "B005VBVQDI", "B002I0J8FI", "B000WMEEBM", "B003O6E67A", "B003JVCA9Q", "B0037LVW9M", "B000B69E9G", "B007XVTR5S", "B0016B28WU", "B0050SXFKE", "B001B1W3GG", "B007H45AZ2", "B003O6ECOM", "B0088I7L76", "B000FQ2D5E", "B005N4HBIW", "B000FPOJOS", "B005C2D1YI", "B002Z7BE24", "B001C4DKG4", "B003O6HDHA", "B004EQCCI4", "B004ML44Y6", "B0023CBZ70", "B00000I1BY", "B008XWCX6Q", "B003R7H5TC", "B0050SXOD2", "B000034DMG", "B00149MEVY", "B001D7T2VC", "B001NIP3EG", "B002MED6EO", "B000ZK7ZMQ", "B004EDJOYC", "B0056WJA6M", "B0086V5V8G", "B004X56PWK", "B006JKARN0"], "bought_together": ["B0050SXLQC"], "buy_after_viewing": ["B0050SXLQC", "B002Z7BE24", "B003O6CBIG", "B00B59L9T6"]}, "salesRank": {"Video Games": 1291}, "categories": [["Video Games", "PlayStation 3", "Games"]]}