{"asin": "B000AA2IC8", "categories": [["Electronics", "Computers & Accessories", "Webcams"]], "description": "Take a Product TourLogitech QuickCam Fusion is a high-end Webcam that delivers true 1.3-megapixel images, superior video quality, and clear, echo-free audio. QuickCam Fusion's next-generation image sensor uses Logitech RightLight technology for great performance even in low light conditions, and its sleek shape provides a lower lens position for more personal, eye-to-eye contact.QuickCam Fusion also features a built-in microphone with Logitech RightSound technology--to ensure that your audience can hear you as well as they see you. RightSound makes headset-free conversations a reality by canceling unwanted echoes that can occur during video calls. You can talk naturally to your friends and family without tangled wires getting in the way.FeaturesTrue 1.3-Megapixel Sensor with RightLight technologyCaptures finer, more accurate details, achieving superior quality videos and pictures in low light situations.Built-in Microphone with RightSound technologyCancels echoes so you can make video calls without wearing a headset.Compatible with Logitech Video EffectsExpress your unique personality by using Logitech Video Effects. Choose 3-D animated avatars that imitate your facial expressions and head movements, or 2-D face accessories that allow you to change your look with glasses, hats, and more. They're fun and easy to use with programs such as MSN Messenger Video Conversation, Yahoo! Messenger, AOL Instant Messenger, and others.High-Speed USB 2.0The fastest interface for maximum frames-per-second video, allowing for true 1.3-megapixel still pictures. Fusion can connect to any USB port, including USB 1.1 systems.Low Distortion, Ultrawide Field of ViewWith expanded video coverage and multiperson intelligent face-tracking, QuickCam Fusion can your include friends and family without the distortion common in less-advanced cameras.View your subject more clearly.QuickCam Fusion captures twice the resolution of competitive Webcams--a true 1.3 megapixels. Enjoy finer, more accurate details and superior-quality videos and photos, even in low light conditions.Don't be left in the dark!RightLight technology, a new imaging system from Logitech, provides superior video performance through the combination of high-performance sensors, state-of-the-art optics, and advanced image-processing technology. You'll see improved low-light performance, clearer images, and more accurate skin tones when compared to other Webcams.Have more natural conversationsusing the built-in mic, featuring Logitech RightSound technology for clear, echo-free audio while remaining completely headset-free.Personalize your video experience.QuickCam Fusion includes Logitech Video Effects, with animated 3-D Avatars (which imitate your facial expressions and head movements) and 2-D Face Accessories (which you can apply to your own image to change your look). Logitech Video Effects avatars and face accessories are designed to work seamlessly with popular instant messaging programs for a truly unique experience.Be the star of the show.Intelligent Face Tracking keeps your face in the center of the video frame, so you're free to move around. You can even zoom in or out to get the right shot.Add live video to your favorite instant messenger.QuickCam Fusion works with MSN Messenger, AOL Instant Messenger (AIM), Yahoo! Messenger, and Windows Messenger.Take sharp, true 1.3-megapixel photos,up to 4.0 megapixels when software-enhanced.Capture fluid video at the highest frame rates possible.QuickCam Fusion is USB 2.0 high-speed-certified, and can be connected to any Windows-based computer (including USB 1.1 systems).System RequirementsIBM or compatible PCWindows 2000 or XPPentium P4 1.4 GHz or AMD Athlon processor 1 GHz (Pentium P4 2.4 GHz or better recommended*)128 MB RAM (256 MB RAM recommended*)200 MB free hard drive spaceCD-ROM drive16-bit color display adapterWindows-compatible sound card and speakers (full duplex sound card recommended*)Available 1.1 or 2.0 USB port (USB 2.0 high speed port required for megapixel image capture*)Technical SpecificationsVideo capture: up to 640 x 480 pixelsStill image capture: true 1280 x 960 pixels; up to 4 MP (software enhanced)Frame rate: up to 30 frames per second (with recommended system)Package ContentsLogitech QuickCam Fusion camera with built-in micIntegrated universal monitor mountThin, 6-foot USB cableQuickCam Software CDCamera setup guideAudio setup guideTwo-year limited warrantyApplications for WindowsLive video integrated with MSN Messenger video conversationWorks with video-enabled Yahoo! Messenger (XP only)Live video calls with Windows Messenger (XP only)Logitech Video Effects avatars and face accessories softwareIntelligent Face Tracking softwareQuickCapture photos and video softwareOne click video e-mail software", "title": "Logitech Quickcam Fusion (961403-0403)", "price": 49.95, "imUrl": "http://ecx.images-amazon.com/images/I/41CD4XQPG3L._SY300_.jpg", "brand": "Logitech", "related": {"also_viewed": ["B004FHO5Y6", "B004WO8HQ4", "B003LVZO8S", "B008ZVRAQS", "B004431UBM", "B000RZQZM0", "B002GP7ZTG", "B004YW7WCY", "B003LVZO88", "B004H1MCKY", "B003LVZO8I", "B00519B4YG", "B004ABO7QI", "B0067MK1TU", "B00K11RI6W", "B009CPC6QA", "B006JH8T3S", "B000RZNI4S", "B000TGAVSQ", "B000ME393O", "B000EVM5DK", "B002MCZJ78", "B0096KSBB0", "B0092QJRPC", "B0080CE5M4", "B002NTC9YQ", "B0040QE98Y", "B003M2YT96", "B0015TJNEY", "B000BBAKSA", "B00006HMPK", "B000GE9XQ2", "B00372567A", "B000NB2GF8", "B009E47ZDI", "B00CRJWW2G", "B005FYEKRK", "B000GOUE7Y", "B000O9GGLY", "B001DWI1F0", "B004ABQAFO", "B003LVZO92", "B000BDH2XY", "B0019WF4FE", "B007B62C5C", "B0015BWO5W", "B0015BYS74", "B0007ZFLYI", "B004FK04M0", "B0002OZXG0", "B005BZNEKM", "B0021ZJUC6", "B000H2NG7U", "B000UY1OMY", "B004HK757U", "B000BBYH8O", "B0000AKACN", "B0083I7Y8W", "B002XN7C6W", "B00I4JCFN4"], "bought_together": ["B004XXMUCQ"], "buy_after_viewing": ["B004FHO5Y6", "B006JH8T3S", "B004WO8HQ4", "B003LVZO8S"]}}