{"asin": "B000067DPM", "description": "Star Wars: Knights of the Old Republictakes place just a few years after the Mandolorian Wars, thousands of years before the events in the Star Wars movies we know and love. Two Jedi, master Revan and his apprentice Malak, led the Republic's forces to victory and pursued the Mandalorians into deep space only to return as Dark Jedi at the head of a huge fleet of Sith warships. Only the Force powers of the Jedi Bastila prevented the Sith from overwhelming the Republic's weakened forces. At the start of the game Malak has usurped control of the Sith by betraying Revan and has attacked the ship carrying Bastila and yourself. In true Star Wars style, the game begins with a bang.The storyline could have been a standard coming-of-age yarn but is instead a genuinely interesting adventure told with humor, compassion, and respect for the source material. Your character has a mystical bond with Bastila, and the two of you share some kind of connection to the Sith villains Darth Malak and Darth Revan. The game's planet-hopping adventures are driven by your exploration of these connections and how they relate to your larger goal of discovering the source of the Sith's sudden fleet. During your adventure you can explore side quests minor (such as racing swoops or gambling) and major (such as uncovering the fascinating back stories of your companions). Star Wars fans will get a kick out of the rich lore introduced in the game, particularly the Tatooine storyline that reveals the origin and history of the Sand People.Gameplay is an abbreviated form of Wizards of the Coast's d20 Star Wars RPG game system--anyone who has played Dungeons & Dragons will be familiar with the abilities, stats, feats, and bonuses in this game. The player creates a character as a member of one of three starting classes (soldier, smuggler, scout) and then later chooses a Jedi class (guardian, consular, sentinel). Joining the player's character are other Jedi, warriors, thieves, droids, a wookiee, and even a Mandolorian. Unlike the faceless non-player characters of other games, each member of the supporting cast has an intriguing history and even agenda. Up to two of these other characters can join your character at any time. Depending on who you chose to take with you, new dialogue and even intra-party arguments come into the game (put the Mandalorian veteran with the Republic patriot and you'll see sparks fly). Combat is real-time turn-based, meaning the turns are seamless but the player has the option of pausing the action at any time to issue orders or direct any character to use a certain Force power, ability, feat, or item.Graphics range from adequate to exceptional. Building and character models are not impressive--about what you get inGTA 3. Lightsaber graphics and environmental effects (like waving grass, clouds, and weather) bring the world to life. Battles are just brilliant, with characters pumping out blaster fire at Jedi who dash, dodge, and even deflect the bolts back toward their assailants. Complete with sounds straight out of the movies, the thrilling combat is pure Star Wars.All in all,Star Wars: Knights of the Old Republicis a masterpiece of Star Wars gaming. The pacing, balance of action and dialogue, clever puzzles and quests, and loving attention to detail have set the bar very high for role-playing games in general and Star Wars games in particular. Consider this a must-have game.--Mike FehlauerPros:Captivating storylineClever dialogueStar Wars feelTrue story and dialogue support for either Light Side or Dark Side playBrilliant combat graphicsFascinating characters (the loyal--and homicidal--droid HK-47 is truly unique)Cons:Occasional bugs in dialogue, movie playbackCannot transfer equipped gear between characters while on your ship", "price": 77.0, "imUrl": "http://ecx.images-amazon.com/images/I/51AZP0DZ1KL._SY300_.jpg", "related": {"also_bought": ["B0002B90SA", "B00020BV1A", "B0000A1OG8", "B001ELWMHI", "B00006LEMQ", "B0001DI6FM", "B0001UEHP8", "B0007SL202", "B0007P8FN2", "B0006ZJPSC", "B00008XKZM", "B0009O7HUI", "0761542299", "0761547487", "B00129I75I", "B00005OWBL", "B00005NZ1G", "B00005RCQJ", "B00006409Z", "B000B2YR74", "B0000C7GH4", "0345511352", "B00097IA88", "B0007ZD79E", "B0006SST9U", "B001I020CW", "B00006LELH", "B0001JXQ5Q", "B00065W7CS", "B002K8Y23G", "B00020BV0Q", "0345511395", "B00009VE6E", "B00008DHNZ", "B0002SQ0BS", "B000BC1UZ6", "B000095ZH0", "B006ZQ85YG", "B000R0URCE", "B006GHA8EE", "B0002ILSGA", "B00009W5WB", "B000E61G4O", "B00008J7NZ", "B00008V6TF", "B0000640A9", "1452118159", "B00008KTNW", "B0000657SQ", "B000087R8F", "B00006409Y", "B00006JZQZ", "B00002STFD", "B0000C6EDM", "B00006ZCD1", "B0000C6EDL", "B004FYEZMQ", "B000F2JUOK", "B0030EU3TG", "B000FRVAD4", "B0002ILSH4", "B003DNH95K", "B0007M226G", "B0002OOURS", "B00009X3SY", "B00006C28W", "0345511336", "B002ABVM54", "B00019AZAK", "B00005O0I3", "B0000A92KZ", "B000I7GI8I", "B00006IR62", "B00005RCQ5", "B000086JXC", "B00006JC48", "B0002A6CQY", "B000067DPL", "B00007F8PB", "B00005TN7U", "B002I0JGDM", "B000088KH3", "B0001KUE7S", "B00008KTNE", "B00009U146", "B001HWB68K", "B00005V6BL", "B00B19IALK", "B0044SA70M", "B003C1I0CO", "B0007PIEAQ", "B00019HNN2", "B00BQMGW4Y", "B002I0JDC6", "B0009O7HVM", "B00006FDLP", "1595829792", "B004FSE52C", "B000G82R20", "B000R39GPA"], "bought_together": ["B0002B90SA", "B00020BV1A"], "buy_after_viewing": ["B0002B90SA", "B0000A1OG8", "B0007SL202", "B00020BV1A"]}, "salesRank": {"Video Games": 932}, "categories": [["Video Games", "More Systems", "Xbox", "Games"], ["Video Games", "Xbox 360"]]}