{"asin": "B000W8UIZW", "related": {"also_bought": ["B001UI4RTG", "B00BP5KOPA", "B00118B1HG", "B00A3VFIM6", "B00895BUPC", "B00EQT0YK2", "B0088TKTY2", "B00GFG1B1A", "B008IFXQFU", "B00416Q5KI", "B0098Y77U0", "B009O7YORK", "B00BWF5U0M", "B008HO9D7M", "B00B5Q6Y8U", "B006HXUXRY", "B0092ML1SC", "B001TH7GUU", "B0088PUEPK", "B0082CFIVY", "B006CQR7CK", "B005DKZTMG", "B003NREDC8", "B00D2CO8WO", "B003VAGXZC", "B0015UGPWQ", "B00DYQYJ0E", "B002YIG9AQ", "B005EJH6Z4", "B00EZ9XKCM", "B00F3ZN2W0", "B004AIJE9G", "B001TH7T2U", "B0033Z2BAQ", "B005BZNDOO", "B009SPWJ98", "B004FHO5Y6", "B009FC3YJ8", "B002HWRZ2K", "B0000VYDHU", "B005EJH6RW", "B004XC6GJ0", "B005BZNDS0", "B00A1ZTZOG", "B0000AI0N1", "B0019804U8", "B001W28L2Y", "B007X4UYX4", "B003XS9DY0", "B00EVVGAD0", "B008I646WG", "B00DKXXAAQ", "B00GOUBT6E", "B00F3L19KQ", "B0093F4ROI", "B003CFATNI", "B000ZH98LU", "B00BQ4F9ZA", "B006GDVREI", "B000R9AAJA", "B001MSU1HG", "B00870ZHCQ", "B004TS1J1I", "B00CXLCMGY", "B005O65JXI", "B001FWYGJS", "B0012S4APK", "B000JV3CKA", "B001W26TIW", "B005T3GRNW", "B00E3W15P0", "B007PJ4PN2", "B00H09BB16", "B001GTT0VO"], "bought_together": ["B00BP5KOPA"], "buy_after_viewing": ["B008IFXQFU", "B00EQT0YK2", "B00A3VFIM6", "B00DTZYHX4"]}, "title": "NETGEAR WN111 Wireless-N 300 USB Adapter", "price": 11.85, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31-LzdMLT5L._SY300_.jpg", "brand": "Netgear", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Network Adapters", "USB Network Adapters"]], "description": "The NETGEAR WN111 RangeMax Next Wireless-N USB 2.0 Adapter makes it simple for you to provide the highest speed wireless internet access to your computer, whether it is a desktop or notebook, letting you surf the web, check email, stream music, make internet phone calls, and get a leg up on opponents when playing online games..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The NETGEAR WN111 RangeMax Next Wireless-N USB 2.0 Adapter offers:Wireless-N protocol for up to 300 Mbps throughput.A small, portable size for easy portability.Backwards compatibility with 802.11g and 802.11b wireless networks.The WN111's small size makes it easy to bring wireless access with you.View larger.Easy to Carry, Easier to SetupAbout the size of a pack of gum, the WN111 is easy to throw into your purse or pocket. This small size was made possible by the Micro Antenna technology. The adapter supports Windows Vista and is also compatible with Windows XP and 2000 SP4. The WN111 features a USB 2.0 connection for wide compatibility and high speeds, and setup is as simple as installing the included software and plugging the device into a USB port. A removable port cover keeps the connector protected and clean from knocks, dirt and other potential harm.Fast, Backwards Compatible, and SecureThe NETGEAR WN111 uses the Wireless-N protocol (based on 802.11n draft) for speeds up to 300 Mbps and a range ten times that of 802.11g adapters when paired with a NETGEAR Wireless-N Router. With this much speed and bandwidth, you can easily download large files, place Internet phone calls, download MP3s, stream video, and play online games -- all at the same time, without hiccups, and from farther away. Patented micro-antennas allows the WN111 to achieve this speed and range while maintaining its small form factor. You'll notice the difference immediately.The WN111 is backwards compatible with 802.11g and 802.11b wireless networks so you'll be able to connect to any hotspot, and it improves network performance up to 50 percent when used with the older 802.11b/g networks.You can feel secure about your information as the adapter supports Wi-Fi protected access (WPA2-PSK, WPA-PSK) and 64-bit and 128-bit WEP encryption for IEEE 082.11b and IEEE 802.11g. The included software makes managing different WEP passwords a breeze as you can set up different profiles for each location you frequent, saving yourself the trouble of having to type in encryption keys each time you connect to a hotspot you've already used.The NETGEAR WN111 RangeMax Next Wireless-N USB 2.0 Adapter is backed by a 1-year warranty.What's in the BoxWN111 RangeMax Next Wireless-N USB 2.0 Adapter, installation guide, setup CD, warranty/support information card."}