{"asin": "B000V1IFR8", "description": "Apple Wired Mighty MouseIts the wired mouse that reinvents the wheel  the scroll wheel. MightyMouse features the amazing Scroll Ball that lets you move anywhere inside a document, literally without lifting a finger. And with touch-sensitive technology concealed under the seamless top shell, you can choose either the versatility of a four-button mouse or the simplicity of a single-button beauty.Features:* Innovative Scroll Ball andbutton: Perfectly positioned to roll smoothly under just one finger, Mighty Mouse's Scroll Ball offers full 360-degree scrolling capability  up/down, left/right and diagonally. You can scroll long web pages, pan full-size images, maneuver around large spreadsheets, control a video timeline and more. And you can even click the Scroll Ball to access your favorite Tiger features such as Dashboard, Spotlight or Expose.* Touch-sensitive top shell: It looks and feels like a sleek one-button mouse, but Mighty Mouse's smooth top shell hides a powerful secret: touch-sensitive technology under the shell detects which part of the mouse you're clicking, so you can both left-click and right-click. And if you prefer the simplicity of a classic one-button mouse, Mighty Mouse is up to the task. Just use the Mac OS X system preference pane to configure it how you want.* Force-sensing side buttons: When you give Mighty Mouse a squeeze, force-sensing side buttons can be configured to activate MacOS X features such as Dashboard, Expose or a whole host of other customizable features.* Customizable: If you have Mac OS X Tiger, Mighty Mouse can give you fingertip access to the special features you love. Simply use the system preference panelto configure Mighty Mouse in the way that makes you most powerful. Control the Scroll Ball's tracking and click functions, as well as the right, leftand side click functions. And you even can set updifferent mouse profiles for every user acc", "title": "Apple Mighty Mouse Kit", "price": 44.99, "imUrl": "http://ecx.images-amazon.com/images/I/31xn7l0A-9L._SY300_.jpg", "related": {"also_viewed": ["B002TLTH7K", "B0007Y79E4", "B000B6D39I", "B007X3VEVG", "B0000ACOBI", "B00EQ94566", "B00DR8LA60", "B0000ACOBG", "B0097D1XUW", "B002C7JG4A", "B007X3VEAW", "B005DLDTAE", "B0000DBJ8A", "B007CLWN5A", "B007X3VEX4", "B00A7Z0WQ0", "B002TLTGM6", "B004WITQ9C", "B005DJ2G46", "B002NX0M8C", "B000V6SSRK", "B005EJH6RW", "B000098XIJ", "B0002VQDVW", "B00BIFNTMC", "B003NR57BY", "B005DLDO4U", "B009CP4PIW", "B005EJH6Z4", "B002HWRJBM"], "buy_after_viewing": ["B002TLTH7K", "B0007Y79E4", "B000B6D39I", "B005DLDTAE"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Mice"]]}