{"asin": "B00008QOL6", "description": "When it comes to first-person shooters, there are two schools of thought. One harkens back to the originalDoom--frantic action, scary monsters, big weapons, and story is given short shrift. The second school is best exemplified byHalf-Life: strong narrative, consistent real-world weapons, consistent monsters, and settings.Doom'sheirs up until now have beenQuakeandSerious Sam, but nowPainkillercomes onto the scene leaving bloody footprints, and &#x85; let the carnage begin!You play a man who dies in a pathetic car crash (he's distracted because he's holding his girl's hand) and has spent a long time in purgatory. He thinks this is unfair because, despite being well-schooled in the art of killing, he maintains that he's done nothing wrong. Heaven makes a deal with him. Take care of a little invasion problem concerning Hell, and our hero can enter those pearly gates.Weak storyline aside,Painkillerbasically amounts to a brilliant series of arcade-style levels and challenges. The settings include darkened monasteries, graveyards, a horrifying asylum, a medieval town under siege, and even H-E-Double Hockey Sticks itself. The level design is brilliant, varied, and jam-packed with enemies. There seems to be no end to the amount and variety of cool monsters to fight, and they each explode into chunks of blood and gore in a most disturbingly satisfying manner. At the end of each level is a challenge, such as collecting a certain amount of gold or killing a Boss within a time limit. Winning the challenge gives you tarot cards you can use to make the game easier. The different cards bring haste, double-damage, invulnerability, and so on. This simple mechanic makes the game far more replayable than your average shooter.The graphics are first rate, which means you need a powerful PC to run the game with all the detail settings maxed out. The only other problem is a CD-copy protection bug that makes the game unplayable for some (a patch is available).Painkillermay seem a bit silly at first glance. But the gameplay mechanics, replayability (full multiplayer is also available), variety, and brilliant level design make it one of the finest and most satisfying shooters ever made. -Andrew S. BubPros:Superb gameplay and game balanceExcellent level designStrong replayabilityCons:Poor, unnecessary storylineHigh system requirementsProblematic copy protection", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/5117NKN0XBL._SY300_.jpg", "related": {"also_viewed": ["B001AZTU28", "B009VURTWC", "B0027EM7LC", "B0009YN1T4", "B009VURQDE", "B000VF4PA0", "B000A0XSMM", "B003BU76ZS", "B00IEYG1AC", "B0000CNUUP", "B009ZMETKG"], "buy_after_viewing": ["B001AZTU28", "B009VURTWC", "B0027EM7LC", "B0009YN1T4"]}, "salesRank": {"Video Games": 43416}, "categories": [["Video Games", "PC", "Games"]]}