{"asin": "B0001AN1GY", "description": "InThief: Deadly Shadows, gamers once again take on the role of Garrett, a master thief. Garrett is rarely seen, never caught and capable of breaking into the most ingeniously secured places. Garrett steals from the wealthy and gives to himself, making his living in the dark and foreboding City. Preferring to be left alone to ply his trade, prophecies of an impending Dark Age dictate a different plan for the thief. In Garrett&#146;s efforts to prevent this approaching Dark Age, he has inadvertently roused an ancient hidden evil. Without allies, Garrett finds himself standing alone between the City and the forces that would crush it.Features:Cutting Edge Stealth: Hide in the shadows, sneak past the guards or ambush them in the darknessBrand New Game Perspective: Cinematic Third Person and Classic Immersive First Person modes are both fully supported and can be changed on the fly during gameplayAction Gameplay: Breaking and entering, stealing, sabotage, evasion, espionage, combat, assassination and setting up ambushesHuge Arsenal of Thieves&#146; Tools: Including lock picks, a blackjack, arrows with numerous purposes, wall-climbing gloves, oil flasks, flash bombs and a daggerAdvanced Artificial Intelligences: AI guards that see and hear, track evidence and suspiciousness, search for intruders, fight, give chase, and perform lip synching, facial expressions and hundreds of lines of real time dialogueDynamic Lighting and Shadow System: Every character and object casts a real shadow that dynamically affects stealth gameplay. Dynamically manipulate lighting to create your own shadows, but make sure your own shadow doesn&#146;t betray you to those who hurt youFrom Warren Spector: Creator of the award winning seriesDeus Ex", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/419STENN81L._SY300_.jpg", "related": {"also_bought": ["B00001YVIB", "B00004NS0Z", "B005G4CXPK", "B000KNCV36", "B002I0HKRQ", "B0001X5YN4", "B00BMFIXZG", "B002I0IHIM", "B005C2D2H4", "B00000K4AX", "B00002CF94"], "bought_together": ["B00001YVIB", "B00004NS0Z"], "buy_after_viewing": ["B0011EA24I", "B00001YVIB", "B002LVUKIS", "B00004NS0Z"]}, "salesRank": {"Video Games": 30799}, "categories": [["Video Games", "PC", "Games"]]}