{"asin": "B004J3V90Y", "related": {"also_bought": ["B00004WCGF", "B00004THD0", "B008MWBY6W", "B00CV9MK4W", "B007BJHETS", "B004Q3C98S", "B0011NVMO8", "B0002Y5WZM", "B003VNKNF0", "B003ENIC6E", "1118094980", "B00CV9M5CY", "B007M54E1M", "B006Y0YZZ6", "B00007E7JU", "B00EFILVQU", "B004VTAVLE", "B00BCEJ0E0", "1435460286", "B00BQ9FY0A", "B0053V5MF4", "B0037NZ2MI", "B00CV9MKJ2", "B004NEJ7HQ", "B00393THEK", "B004XIB9T6", "B00ADPFQ4C", "B0092F974E", "B004Z4ZNZ4", "B000V7AF8E", "B0075WEVK6", "B00CF5OHZ2", "B002VPE1WK", "B005TERKIW", "B005KP473Q", "B001I3X3HU", "032177664X", "B00007E7K9", "B007M51J3I", "B006FKS8TO", "B00004ZCJI", "B00006I53V", "B00CDS9EKE", "B003DWXST2", "B00CV9M5W4", "B00FGL1FBG", "B0070WU51U", "B007M51J42", "B0064FS7HI", "B007VPS2RU", "B003VNKNEQ", "B001TZUS98", "B0039BPG1A", "B003ZW316U", "B006FP9QG8", "1435460324", "B00FEY1ZGA", "B00005K47X", "B0078K16IK", "B009PKNN0U", "B0080JH3YE", "B008CVHLT2", "B00FB465IG", "B0089TSZXS", "B007BJHEWK", "B002HJ9PTO", "B00FIW2Y36", "B0002Y5WZC", "B005G0RL7O", "B0082RT1BM", "B003USYPX2", "B007M54E08", "B00B7ID99I", "B00CAE8PM4", "B00F08QQIC", "B0095F5BCS", "B002YVRGPA", "B007M51IZM", "B0007U9SOC", "B00E1D2LTA", "B0081TSZCC", "B0089INHZ0", "B004S494WO", "B0048IW030", "B00GYL9KK0", "B005GMWNY8", "B00AIW68GU", "B0037FLUYU", "B00KGE4VS2", "B004UTQRHW", "B004ZGN6MY", "B004ZGLM5W", "B00966J1WC", "B00570DFYQ", "B00004XOM3", "B0037TEO3K", "B003QKBVYK"], "bought_together": ["B007BJHETS"], "buy_after_viewing": ["B004Q6LMSI", "B003VNKNF0", "B007M54E1M", "B004Q79BIA"]}, "title": "Canon EOS Rebel T3i 18 MP CMOS Digital SLR Camera with EF-S 18-55mm f/3.5-5.6 IS Lens (DISCONTINUED)", "price": 528.49, "salesRank": {"Camera &amp; Photo": 26}, "imUrl": "http://ecx.images-amazon.com/images/I/51jGuISLz8L._SY300_.jpg", "brand": "Canon", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]], "description": "High Resolution Still Capture18.0 Megapixel CMOS (APS-C) sensor and DIGIC 4 Image Processor for high image quality and speed.The EOS Rebel T3i has an 18.0 Megapixel CMOS (Complementary Metal Oxide Semiconductor) sensor that captures images with exceptional clarity and tonal range and offers more than enough resolution for big enlargements or crops. This first-class sensor features many of the same new technologies as used by professional Canon cameras to maximize each pixel&rsquo;s light-gathering efficiency. Its APS-C size sensor creates an effective 1.6x field of view (compared to 35mm format).DIGIC 4 Image ProcessorThe Canon DIGIC 4 Image Processor dramatically speeds up the entire EOS Rebel T3i DSLR&rsquo;s camera operations for intuitive operation and offers improvements in both fine detail and natural color reproduction. It works in concert with the EOS Rebel T3i DSLR&rsquo;s CMOS Image Sensor to achieve phenomenal levels of performance in nearly any situation.Amazing Results, No Matter the Light.ISO 100 &ndash; 6400 (expandable to 12800) for shooting from bright to dim light.The EOS Rebel T3i features an expanded ISO range that makes shooting possible in situations previously unthinkable without flash. With an ISO rating up to 6400 (expandable to ISO 12800), along with the DIGIC 4 Image Processor's improved noise-reduction technology, creative possibilities abound. Combine the EOS Rebel T3i with one of Canon's EF or EF-S lenses with Optical Image Stabilizer and the shooting possibilities for both movies and stills expand even further.HD Dreams Come True.Improved EOS Full HD Movie mode with manual exposure control, expanded recording [1920 x 1080 Full HD video at frame rates of 30 (29.97), 24 (23.976) and 25.0 frames per second] with new Movie Digital zoom and Video Snapshot features for enhanced video shooting options.The EOS Rebel T3i does not just shoot video clips, it offers the enhanced ease-of-use, image quality, smooth frame rates and adaptive exposure compensation necessary in a professional video-making tool by boasting the most advanced EOS video capturing features to date: &nbsp;When Full HD (1920 x 1080) is set, you can use Movie Digital Zoom to magnify the center of the image by 3&ndash;10x while at the same time maintaining gorgeous Canon Full HD image quality. With the Video Snapshot feature, the EOS Rebel T3i DSLR will capture short video clips (of 2, 4 or 8 seconds) then combine them automatically into one video file as a snapshot or highlights &ldquo;album.&rdquo; With no editing needed after shooting, the compiled video is perfect for sharing online or displaying directly on an HDTV via the camera&rsquo;s HDMI port.In addition to a number of different recording size and frame rate modes, the EOS Rebel T3i enables easy manual control of exposure, focus and Live View features and even allows for in-camera editing. The large CMOS sensor and compatibility with over 60 lenses provide a wealth of depth-of-field options. And it&rsquo;s all as easy as the press of a button &mdash; the EOS Rebel T3i has a dedicated Live View/Movie Recording start/stop button that gets the shooting started fast.Three Recording SizesFull HD Video is captured at 1920 x 1080 resolution at 30p (29.97), 24p (23.976) or 25p frames per second, for up to 4GB per clip. Video are saved as .MOV files and can be viewed in Full HD with HDMI output. Other recording sizes include HD at 1280 x 720 (50p/60p (59.94) fps) or SD/VGA at 640 x 480 (30p (29.97) and 25p fps).Low Angles or High, a Big Vari-angle LCD Captures All the Details.Vari-angle 3.0-inch Clear View LCD monitor (3:2) for shooting at high or low angles and 1,040,000-dot VGA with reflection reduction using multi coating and high-transparency materials for bright and clear viewing.The EOS Rebel T3i features a bright, high resolution, flip-out Vari-angle 3.0-inch Clear View LCD monitor for shooting at a variety of angles. By simply rotating the monitor, you can hold the camera directly overhead for above-the-crowd shots at concerts, or hold the camera at a low angle for kids and pets. By rotating the LCD monitor fully, the EOS Rebel T3i becomes the ideal camera for self-portraits. The EOS Rebel T3i freely enables easy angle adjustments even if the camera is mounted on a tripod or has a battery grip attached.Model used is not EOS Rebel T3i and is used to illustrate vari-angle feature only.With 1,040,000 (dots/VGA) pixels for spectacular detail, the advanced, smudge-resistant monitor includes high transparency materials plus anti-reflective and water-repellant coatings to provide clear and bright viewing. Superb for reviewing, editing and deleting photos or composing new images in Live View function, the Vari-angle Clear View LCD monitor is also the perfect means for accessing camera settings like ISO, metering modes, AF Point selection, the horizontal Electronic Level and flash options.Automatic Scene Analysis for Standout Color.New Scene Intelligent Auto mode and Picture Style Auto incorporating the new EOS Scene Detection System to capture beautiful scenes with ease.The EOS Rebel T3i DSLR&rsquo;s new Scene Intelligent Auto mode unites five Canon digital camera technologies &ndash; the new Picture Style Auto, plus Automatic Lighting Optimizer, Automatic White Balance, Autofocus, and Automatic Exposure &ndash;into a powerful new feature for photographers. Using the advanced EOS Scene Detection System, the camera automatically analyzes the image, taking into account faces, colors, brightness, movement and contrast. Scene Intelligent Auto then chooses the enhancing features to deliver maximum impact. Blues and greens are more vivid, &ldquo;hot&rdquo; colors are more fiery, and skin tones are smooth and truer to life.Intelligent Scene Analysis for Superb Exposure.Enhanced metering with a 63-zone, Dual-layer metering system for accurate metering between exposures, and 9-point AF system utilizing a high precision, f/2.8 cross-type center point.The EOS Rebel T3i features a sophisticated, 63-zone Dual-layer sensor designed to complement the 9-point AF system. By taking into account the color and luminosity surrounding chosen AF points, this system delivers an advanced level of accuracy for better results even in difficult lighting situations. Since the metering sensor has a color measurement function, exposure errors and focus errors caused by different light sources are minimized; the EOS Rebel T3i gives stable exposure from shot to shot in situations where light changes, such as in a theater or concert hall. This makes the EOS Rebel T3i ideal for scenes with extreme difference in brightness such as brightly lit scenes or backlit scenes; the camera balances exposure of the main subject at the background, and exposures are not overly influenced by bright areas in the shot. Since the EOS Rebel T3i provides high-speed X-sync (&ldquo;X-sync&rdquo; means the fastest shutter speed that can synchronize with a flash burst at the moment the shutter is fully released) up to 1/200 sec., the range of photographic expression is dramatically increased, allowing the EOS Rebel T3i to be used with confidence in bright scenes or dim.63-zone Metering SystemMake Your Images As You See Them.Express your creativity with advanced imaging features like Basic+ function, Multi-Aspect function and Creative Filters.Basic+ is a new creative imaging feature that makes it easy to create the image effects you want. It can be set with the Quick Control screen in Basic Zone modes. Basic+ provides two options:Shoot by ambience selectionBased on the Picture Style and its parameters (sharpness, contrast, saturation, and color tone), the exposure compensation and white balance correction are adjusted to attain the selected ambience. You can also can also select the strength of the ambience effect.Shoot by lighting or scene typeAlthough the actual parameter set is the white balance, the settings are expressed in more understandable terms.The Multi-Aspect Function of the EOS Rebel T3i lets you express an image in one of three ways by matching the aspect ratio to each scene. In addition to the camera&rsquo;s standard 3:2 ration, the Multi-Aspect Function includes a 1:1 ratio that creates the sensation that the viewer's gaze is focusing upon the center of the image. At the 4:3 ratio, you get nearly the same aspect ratio as a regular TV or a 4:3 computer display. The 16:9 aspect ratio provides a wide look, much the same as HDTV.The EOS Rebel T3i incorporates five in-camera Creative Filters so you can artistically manipulate scenes without the aid of an outside computer. Soft Focus lends a dreamy, romantic aspect, while Grainy Black and White gives a dramatically gritty, hard-bitten look. Miniature Effect creates an illusion in which expansive subjects are seemingly reduced to doll-house-like proportions, and Toy Camera Effect recreates the colors and softness rendered by cameras with a plastic lens, an effect often sought after by art photographers. Fish Eye Effect mimics the &ldquo;Fisheye&rdquo; lenses that are favorites of professional photographers for their quirky, convex perspective.Never Miss a Moment.3.7 fps continuous shooting up to approximately 34 JPEGs or approximately 6 RAW.The EOS Rebel T3i can shoot up to 3.7 frames per second (fps) for up to approximately 6 consecutive RAW files or approximately 34 full-resolution JPEGs. Shooting at speeds of up to 1/4000 sec., the EOS Rebel T3i can capture even rapidly-unfolding scenes with ease.Photography Made Truly Easy.New Feature Guide offers short descriptions of each function and Quick Control screen for easy operation.The Canon EOS Rebel T3i DSLR demystifies great photography by including an in-camera Feature Guide. Appearing on the camera&rsquo;s LCD, the Feature Guide displays a simple description or advice for the respective function. It is displayed in each shooting mode, during Mode Dial operations, and for Quick Control screen functions (during normal shooting, Live View shooting, movie shooting, and playback). The Feature Guide appears automatically during Mode Dial operations and when a function is selected on the Quick Control screen.Flexible Storage with Memory Cards.Compatibility with SD/SDHC/SDXC memory cards.The EOS Rebel T3i uses popular SD, SDHC and SDXC memory cards. Compact, inexpensive and available in increasingly large capacities, SD, SDHC and SDXC memory cards are a perfect complement to the EOS Rebel T3i DSLR&rsquo;s compact and lightweight body design.Additionally, the EOS Rebel T3i is compatible with Eye-Fi* SD cards, which are outfitted with a Wi-Fi transmitter (IEEE 802.11b/g) and an internal antenna for wireless, high-speed transfer of images. With an Eye-Fi card installed, the EOS Rebel EOS Rebel T3i can display the Eye-Fi&rsquo;s connection status and error notes with ease, for fully functional wireless uploading of images directly from the camera.*Canon cameras are not guaranteed to support Eye-Fi card functions, including wireless transfer. In case of an issue with the Eye-Fi card, please consult with the card manufacturer. The use of Eye-Fi cards may not be available outside the United States and Canada; please contact the card manufacturer for territory availability.The Best Optics for the Best Images.Compatible with the full line of Canon EF and EF-S lenses.EF LensesThe EOS Rebel T3i is compatible with all Canon lenses in the EF lineup, including compact and lightweight EF-S lenses, ranging from ultra-wide angle to super telephoto lenses. Canon lenses employ advanced optical expertise and micron-precision engineering to deliver outstanding performance and deliver beautiful results. Special technologies like the Canon Image Stabilizer technology in select lenses helps to minimize the effect of camera shake, effectively adding up to four stops of light. With a dizzying array of lenses perfect for travel, sports, still life and everything in between, photographers can truly maximize the quality and performance of their EOS Rebel T3i with superlative Canon optics.Flash PhotographyWith a flash sync speed of 1/200 of a second, the EOS Rebel T3i also features the acclaimed E-TTL II flash metering system. With any of the flashes in the EX Speedlite line, E-TTL II provides reliable flash output whether shooting fill-in flash pictures in sunlight, or using flash in total darkness. With E-TTL II, the exact same 35-zone metering sensor used for measuring ambient light is also used for flash metering &mdash; giving even finer metering command of the image area. If you prefer a broader area for flash metering, there&rsquo;s a menu setting to change to &ldquo;Average&rdquo; flash metering &mdash; where the entire 35-zone area is measured evenly for flash exposure. Additionally, the EOS Rebel T3i has a Speedlite transmitter built-in for convenient, full-featured wireless control of EX-series Speedlite flashes set as slave units.The Canon Speedlite 430EX II is the ideal step-up accessory for powerful flash shooting with the EOS Rebel T3i. It has excellent flash power (maximum guide number of 141 ft./43m at ISO 100), and is the perfect way to get great flash pictures when you can't get right up to the subject. The 430EX II is also great for bounce flash, with its tilting and swiveling flash head.&nbsp; It automatically zooms the flash head to cover lenses ranging from 16mm up to 105mm or longer with the EOS Rebel T3i. Of course, it works with the camera to provide full E-TTL II automatic flash exposure. And the 430EX II has a powerful AF-assist beam, which allows the camera to autofocus even in total darkness on subjects as far as 32 ft. from the camera.Speedlite 430EX II"}