{"asin": "B00004TS16", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Canon's latest crowning achievement, the PowerShot S100, packs a high-quality digital camera into the tiny, elegant body of Canon's Digital Elph series. With this item, Canon becomes the first to produce such a small digital camera with high resolution. The super-popular Elph APS cameras were favored because users could slip them into shirt pockets and take them anywhere. Now the digital camera has truly come of age with this ultraportable model.The PowerShot S100 uses the same durable stainless-steel case as the traditional Elph series cameras. It offers 2-megapixel resolution for high-quality photos and prints up to 8 by 10 inches. Canon provides the PowerShot S100 with a high-resolution, low-distortion, all-glass aspherical 2x zoom lens (and a 4x digital zoom as well). The 1.5-inch LCD monitor displays most camera settings with easy-to-understand icons and minimal text. The PowerShot S100 features a 0.37-inch CCD that creates full color or black-and-white images up to 1,600 x 1,200 pixels (it also offers a 640 x 480 pixel image size). The built-in flash uses a light guide and does not need a fresnel lens or a large reflector, making the camera even more compact.The PowerShot S100 stores images on an 8 MB CompactFlash card. Adobe PhotoDeluxe and PhotoStitch control image management, editing, compositing, and printing, while ZoomBrowser EX or ImageBrowser produce self-running screen slide shows, automatic e-mail preparation, and auto layout. The camera uses a high-speed plug-and-play USB interface, plus it has NTSC-out so you can view your photos on your TV. It's fully compatible with both Mac and PC platforms.", "title": "Canon PowerShot S100 2MP Digital ELPH Camera Kit with 2x Optical Zoom", "price": 36.19, "salesRank": {"Camera &amp; Photo": 13255}, "imUrl": "http://ecx.images-amazon.com/images/I/41ZDH9HMK5L._SX300_.jpg", "related": {"also_viewed": ["B001O1GEU4", "B004HW73QG", "B0000645C9", "B005MTME3U", "B00DRG0AF4", "B005MTMEKI", "B00DRG0AKY", "B008N9DRPA", "B003E47FUM", "B008C3A1V0", "B0075SUHWG", "B00AWYMXZY", "B0075SUHKI", "B00DJGQIB2", "B0034XIMG4", "B003VTZE1M", "B008L24488", "B00C7NX884", "B0075SUHQC", "B00BGYO1HM", "B0090SLJ1C", "B004MB9UMM", "B001C20816", "B0054SLN3Q", "B004HW73SO", "B0075SUI2A", "B00008OE5I", "B005AKRPP8", "B009B0MYSQ", "B005F5HTMC", "B003VTZE26", "B005EQBK3Q", "B0049XEE88", "B002MCAF40", "B0009MFV0I", "B006ZAHOEO", "B00DJGQN8A", "B0032JRRXE", "B0073HSIY8", "B0090SLJMG", "B00B5HE2UG", "B000087KY8", "B003KIUGG2", "B0075SUH5S"], "buy_after_viewing": ["B001O1GEU4", "B005HNF01O", "B000P1O73A", "B000NK5Z8Y"]}}