{"asin": "B001U0O5QO", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Memory Cards", "SD & SDHC Cards"]], "description": "The Eye-Fi Explore Video SDHC wireless memory card transforms your regular camera into a versatile wireless camera. With this card, you can quickly and easily transfer images from your camera to your computer--wirelessly. No cables, no cradles, no hassles. When you're traveling, you can instantly share your favorite images with friends and family. Simply upload your photos or videos to an online share site of your choice. And because the location is automatically stored with every photo you take, there's no need to remember where you took each shot. It's a snap to get started with the easy installation.OverviewThe Eye-Fi Explore Video features:Easy wireless transfer of photos and videos from your camera to computer or to an online siteUpload to your favorite online site while traveling to share instantlySelective transfer of only those photos you wish to uploadStore thousands of photos with 4GB of memoryLocation information captured and stored automatically in each photoSimple setup in just minutesEasy Wireless Photo and Video UploadsWith the Eye-Fi Explore Video card, you can wirelessly transfer your latest images to your favorite online site from just about anywhere. The card includes one year of free HotSpot access to over 10,000 Wi-Fi locations in the U.S., so you can upload while on the go.Share your Photos and Videos While TravelingNow you don't have to wait until you are back home to share your vacation images with family and friends. With the Explore Video card, you can choose your favorite images and simply transfer them to an online sharing site such as Facebook, Flickr, or YouTube--there are over 25 to choose from. Also, you can be automatically notified when the files are uploaded, so you'll be certain that your images have posted.Stores up to 2,000 ImagesThe Explore Video card holds up to 2,000 images or 90 minutes of video with its robust 4 GB capacity. Now you can focus entirely on your subject matter without the distraction of running out of space.No Need to Remember the Location of Your ShotsEach photo you take is automatically marked with the location of the picture, so you'll always know where the image was taken. The Explore Video card detects surrounding Wi-Fi networks to add location information to each picture. Just snap the picture and after wirelessly uploading to your computer, the photo will be labeled with the place where it was taken. It's that easy.Quick and Easy Set UpWith the easy-to-read Setup Guide, installation is straightforward and  hassle-free. Most users are up and running in a few minutes.RequirementsSDHC-compatible digital cameraComputer with Windows XP/Vista/Win7 or Mac OS X 10.4, 10.5, 10.6100MB of free spaceWi-Fi router compatible with 802.11 b/gBroadband Internet connectionInternet browser: Explorer 7 (Windows only), Firefox 2 and 3 (Windows and OS X), or Safari 3 (OS X 10.4 - 10.6)What's in the BoxEye-Fi Explore Video 4GB, SDHC wireless memory card; Eye-Fi Manager software; USB card reader; and Setup Guide.Comparison Chart&nbsp;MEMORY CAPACITY2 GB&nbsp;&nbsp;&nbsp;&nbsp;4 GB&nbsp;&nbsp;&nbsp;8 GB&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;WIRELESS UPLOADSPhotosVideos&nbsp;&nbsp;RAW&nbsp;&nbsp;&nbsp;&nbsp;COOL FEATURESOnline Sharing&nbsp;Geotagging&nbsp;&nbsp;&nbsp;Hotspot Access&nbsp;&nbsp;&nbsp;Ad Hoc Transfers&nbsp;&nbsp;&nbsp;&nbsp;X2 ENGINESDHC Class 6&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;", "title": "Eye-Fi 4 GB Explore Video SDHC Wireless Flash Memory Card EYE-FI-4EV", "price": 99.99, "imUrl": "http://ecx.images-amazon.com/images/I/51-YlMXY2KL._SY300_.jpg", "brand": "Eye-Fi", "related": {"also_viewed": ["B002UT42UI", "B00CS4WPD6", "B003DV4234", "B00CS4WPHC", "B004U5QR62", "B001U0O5QE", "B00CRFK24K", "B00FG8PPXI", "B00GEBTH80", "B00A659ILQ", "B00A659IJI", "B00GEBTFNM", "B00HIKBW1G"], "buy_after_viewing": ["B002UT42UI", "B00CS4WPD6", "B007NDL56A", "B003DV4234"]}}