{"asin": "B001D7T2VM", "description": "Darksidersis a third-person, single player action/adventure game inspired by the characters, themes and mythology of the apocalypse and the battle of Armageddon described by the Book of Revelation. But this modern interpretation is not your run of the mill Sunday school stroll through the New Testament. In the game players take on the role of \"War,\" one of the dread Four Horsemen of the Apocalypse. But things are not as they were..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Devastating weapons arsenal.View larger.Upgradable abilities.View larger.Enemies from heaven &amp; hell.View larger.Fight &amp; explore atop your mount.View larger.Once the unstoppable and just wielder of divine retribution, War is now reduced in stature and cast out amongst the ruined lands of the Earth that he himself devastated. All that remains is the search for the truth behind his betrayal and the survival of its consequences.The StoryDeceived by the forces of evil into prematurely bringing about the end of the world, War - the first Horseman of the Apocalypse - stands accused of breaking the sacred law by inciting a war between heaven and hell. Dishonored and stripped of his powers, War must return to Earth to search for the truth and punish those responsible. But there is no clear definition of good and evil in this tale. Hunted by a vengeful group of angels, War must take on the forces of Hell, forge uneasy alliances with the very demons he hunts, and journey across the ravaged remains of the Earth on his quest for vindication. But the answers he seeks will reveal a deep conspiracy in which War will find, and have to resign himself to the reality that although once the hand of God, he is just a pawn in the eternal battle between heaven and hell.GameplayA mix of exploration and fast-paced action gameplay,Darksidersis based on nonlinear play situations. That means that as War slowly regains his previous powers of destruction and carnage in order to continue his search for the origins and reasons for his betrayal, players will be able to backtrack to areas and scenarios that they may have left unexplored upon first discovery. Almost all areas of the game can be explored and some of the things players will find as they do so are treasure chests, health chests, and bonus life points, etc. The ability to go back and explore areas is important, especially as the game progresses and War finds himself up against enemies whose defeat require special skills and/or weaponry.As for combat gameplay,Darksidersfeatures a variety of weapons--including blades and firearms--that can be used in combo moves or in single strikes. Some of these can be charged up for quick, but devastating attacks on enemies and all can be arranged on your controller's D-pad for easy and preferred access. Additional gameplay elements include the ability/necessity to fight from the back of your mount, Ruin, and the collection of the souls in the form of glowing orbs that fall to the ground as enemies are dispatched. The latter can be used to level up War with new items and abilities.Varied Characters and EnvironmentsAlthough players take on the imposing role or War,Darksidersalso contains a wide variety of equally intriguing and sometimes frightening characters. These include: an assortment of vengeful angels; demons, such as \"the Jailer\" whose body is made up of the remains of countless cadavers; a bestiary of wicked and vile creatures created to bolster the armies of hell on Earth; and Ruin, the trusty steed of War. Gameplay environments players will experience are equally varied, and include areas both underground and on the surface, that call to mind both familiar, if ruined modern urban environments, as well as ones seemingly pulled from the nightmarish scenes of the biblical apocalypse.Key FeaturesApocalyptic Power of War- Unleash the wrath of War, combining brutal attacks and supernatural abilities to decimate all who stand in your way.Extreme Arsenal- Wield a devastating arsenal of angelic, demonic, and Earthly weapons, and blaze a trail of destruction atop Ruin, War's fiery phantom steed.Epic Quest- Battle across the wastelands and demon-infested dungeons of the decimated Earth in your quest for vengeance and redemption.Character Progression- Uncover powerful ancient relics, upgrade your weapons, unlock new abilities, and customize your gameplay style.Battle Heaven and Hell- Battle against all who stand in your way&mdash;from war-weary angelic forces to hell's hideous demon hordes.Weapons and Gear-Darksidersfeatures an extensive arsenal and inventory of weapons and gear.Varied Play Environments- Players will fight through varied environments, including those above and underground, and modern and nightmarishly mythical in design.Xbox LIVE- Although a single player game,Darksidersfeatures Xbox LIVE achievements, content downloads and other features to heighten the gameplay experience.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51cfaigZP%2BL._SY300_.jpg", "related": {"also_bought": ["B0056WJA30", "B001NX4DUQ", "B002GPPPS4", "B004NRN5DU", "B005VBVQAG", "B0044SA70M", "B000WQWPOQ", "B004ML7WOK", "B007UM59AC", "B00319DX4W", "B000P297E8", "B005C2D2MO", "B004FUL9YW", "B002I0JA7E", "B001UWGDC6", "B009K4OXWI", "B0016NRS8M", "B00309U0M6", "B003O6G6G4", "B00B59MXDM", "B00354NAYG", "B002I0JGDM", "B003DZ4F64", "B0047TG2R0", "B002BSA1MQ", "B000X1PE16", "B0058VI0SU", "B000P46NMK", "B000HX1P72", "B006GHA8EE", "B000R0SS3Y", "B005J5K9EI", "B008XMSRKC", "B003C1I0CO", "B0050SWVIQ", "B002I0H79C", "B00ICWO1XA", "B005FDUSTA", "B0076ZPYPI", "B001ASJISG", "B003O6EB70", "0744010861", "B0030GBUCS", "B00F4GSAYI", "B001REZLY8", "B000C427NM", "B000RHZ9JI", "B004FSE52C", "B003H0CC2O", "B000SQ5LQ4", "B00B59L9VO", "B001IK1BJ0", "B002I0H2AG", "B000G75AXY", "B000XJNTPG", "B000FRS9II", "B009WI7V9E", "B002BRZ8FW", "B000R0URCE", "B000NJH6YG", "B003O6E9EK", "B0050SYV70", "B002Q21X7Y", "B003S2MXRA", "B002DC8GEK", "B0016NUZFU", "B001LGFPSY", "B000ZK6950", "B003O6EBRA", "B0010AYJXI", "B0022TNO7S", "B00EVWZHLK", "B004CD9X2C", "B000FLZEXM", "B002I0HAC6", "B00149NCYW", "B00J22635I", "B003GSZ9ZE", "B001D25M1Q", "B004UDLRMS", "B001CMIUYS", "B000MKA60W", "B00BMFIXT2", "B0050SY4DG", "B003PHLTDC", "B002V16T0Q", "B0043B5SLI", "B0085CA8NY", "B002DC8GKE", "B0023CBY4E", "B003FBL85W", "B000KLNLV4", "B0050SY9WC", "B002I0K50U", "B002W5GI9I", "B00432O4VM", "0345534026", "B000HCQK0A", "B004P6IVPQ", "B001TOQ8J8"], "bought_together": ["B0056WJA30", "B004NRN5DU"], "buy_after_viewing": ["B004NRN5DU", "B0056WJA30", "B00BMFIXT2", "B005C2D2MO"]}, "salesRank": {"Video Games": 5028}, "categories": [["Video Games", "Xbox 360", "Games"]]}