{"asin": "B0018O77Q2", "description": "Western Digital 500GB DVR Expander Western Digital My DVR expander, 500GB, eSATA, Compatible with Scientific Atlanta 8300 Series, TiVo Series3 and TiVo HD DVRs. Quiet and Cool - A unique no-fan passive cooling system and special hard drive design makes it quiet for the living room or bedroom Instantly add up to 60 hours of high-definition TV or up to 300 hours of standard-definition TV to your DISH Network ViP Series HD DVR. You'll have plenty of room to save your programs longer and never miss your favorite shows. Key Features: Easy to set up,easy to use - Just plug it in to the external USBport on your DISH Network ViP Series HD DVR and start recording even more TV shows, sporting eventsand movies. (Requires port activation. Fees may apply.)  Compatible: My DVR ExpanderTM USB EditionTM has been verified compatible with DISH Network's ViP Series HD DVRs.  Quieter, Cooler and Eco-friendlier - A low power-consuming hard drive and a no-fan passive cooling system reduces energy consumption by 30% and makes this drive quiet enough for use in living rooms and bedrooms.    Ideal For: Storing more recorded television shows and movies.  System Compatibility: DISH Network ViP Series HD DVRs  Package Contents: - External DVR expander  - USB 2.0 cable  -AC adapter  - Quick Install Guide", "title": "Western Digital My DVR Expander 500 GB eSATA External Hard Drive", "price": 97.0, "imUrl": "http://ecx.images-amazon.com/images/I/31kVEYsNLtL._SY300_.jpg", "related": {"also_viewed": ["B003MVZ60S", "B000ENUCR4", "B000ENYXZ6", "B0041OSQB6", "B002VLYK0M", "B002XITVCA", "B001G0WKT2", "B0086V16HQ", "B0041OSQBG", "B002JN554C", "B00EEOSZK0", "B000RZDBM2", "B00284AQLO", "B003MRI398", "B00E3RH5W2", "B007FEEO3S", "B0042AG9V8", "B0042Z55RM", "B001E06W8O", "B004PYDE1E", "B002BC32OG", "B0018LX0DY", "B009D90JFA", "B005B5G4S6", "B0036OR910", "B008RHTXLA", "B009WROL6G", "B006L8TX94", "B00CMKWL3A", "B00HC2XTMA", "B00EYO241Q", "B0038L3OWO", "B00CGUMVHW", "B004AA4E8K", "B0036OR91A", "B002JSQ97Y", "B008S94HXG", "B005TI1ILS", "B003SQ1JTY", "B00CGUMVEA", "B00CGUMUK0", "B00CGUMUIC", "B00CGUMUGE", "B00BUCLVZU", "B00E3RH61W", "B004HO58SO", "B007JPCL88", "B00GGVPKKC", "B00E8HIN78", "B00I2ZBD1U", "B0038JECKY", "B0036Q7MV0"], "buy_after_viewing": ["B003MVZ60S", "B000ENUCR4", "B008I647MA", "B000ENYXZ6"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]]}