{"asin": "B001T9N9JU", "categories": [["Electronics", "Camera & Photo", "Lighting & Studio", "Photo Studio", "Storage & Presentation Materials", "Digital Picture Frames"]], "description": "USBThe Pandigital PAN7000DW is an impressive member of the Pandigital family of digital picture frames.The 7-inch LCD screen with stunning 800 x 600 resolution gives excellent clarity and definition to your favorite photos, while the 4:3 viewing aspect ensures that your images will not be distorted from their original aspect ratio. Up to 6400 compressed images can be stored on 1 GB of internal memory. The black wood frame blends with any d&eacute;cor and your choice of charcoal gray or white mats add a professional finished presentation. Founded in 1998, Pandigital recognized the need to bridge new and traditional technologies like a digital camera and an elegant picture frame. Photography captures the special moments in our lives, moments that cannot be properly displayed or appreciated on the back of a digital camera. Pandigital has shipped more that 4 million digital picture frames and is one of the top 50 fastest growing companies in the US. In 2008, they were the #1 supplier of digital photo frames in North America. Their digital picture frames are of substantial quality, elegant and intuitive designs, they are versatile and affordable. They have helped millions of people move images out of their camera and back into their lives.The perfect companion for your digital cameraWe capture our most precious, and our most common, moments because they are not to be forgotten or taken for granted. The moment when we take a picture we are making a decision to be conscious, to be in the moment and to be grateful for it. But a photo in a camera or on a flash card is only an unfulfilled intention. Let your images free. Give them the power they deserve in your life to make you smile, to remember, or to pause for a moment and consider the past. Take advantage of customizable features like rotate and resize, programmable on and off, and your presentation will be seamlessThe gift of a digital photo frame to a friend or loved one is every bit as meaningful as the gift of one to yourself. Who doesn't need a pick-me-up right about now? It is said that the gift of experience is so much more meaningful than a mere material object. If that is the case, then the gift of re-experiencing those special moments must be priceless. The PAN7000DW includes 4 free digital greeting cards, which you can personalize with any message to your lucky giftee. The message will be displayed when the frame is turned on. Imagine the happy surprise of your recipient.Share yourself with a slideshowFramed pictures are such great conversation starters, and we get to know each other a little better when we share ourselves by displaying photos of friends, family, and favorite occasions. How much better we get to know each other through the use of slide shows, which allow us to showcase many special moments. We have seen our photo frames set in slide show mode at parties, family reunions, and gatherings to help establish a theme, at wedding anniversaries and bridal showers to highlight special moments in a couple's past. A slideshow on this Pandigital frame is as easy as inserting your memory card. You can also add digital music, voices, or sound, to be played via the built-in speakers or audio out port. Transition effects between images can add to the entertainment. The built-in card reader accepts SD, xD, MS, MSPro, MMC, MicroSD (MicroSD to SD adaptor not included) and USB flash drives.A little known feature is the built-in calendar and alarm clock. If space on your bedside table is tight, there's no reason to not have a digital picture frame, just consolidate. The panel can be turned off at night so that the light won't interfere with your sleep and a handy remote allows you to control major functions without crossing the room.The Pandigital PAN7000DW can play digital audio and video, as well as images, straight from your memory card via the 5 in 1 card reader.JPEG, AVI and MP3 files are all accepted, no PC is needed. Alternatively, if you have files on your computer or camera, you can transfer them to the frame with a USB cable (Not included). Don't forget the images on your cell phone, those can be transferred too. Drop and drag technology makes selecting images from your computer and transferring them to the frame's internal memory fast and easy, with no software needed. The PAN7000DW is Wi/Fi Bluetooth compatible when paired with the PANWF01 WiFi dongle and will allow wireless transfer with other Bluetooth devices.The Pandigital PAN7000DW effortlessly moving images out of your camera and into your life7-inch Digital Photo Frame in black domed wood4:3 aspect ratio800 x 600 resolutionStores up to 6400 images on 1 GB of internal memoryInterchangeable white and gray matsBuilt in 5 in 1 card readerUSB 2.0 port and Mini USB portJPEG, AVI and MP3 digital video and audioWiFi/Bluetooth compatible (with PANWF01 WiFi dongle)Brightness control dialThis comes with one speakerWhat's in the Box:Panimage PAN7000DW digital photo frame in domed black woodWhite and charcoal gray matsAC adaptorRemote controlOwners manualQuick start guide", "title": "PanDigital PAN7000DW 7-Inch Digital Picture Frame - Black", "price": 59.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/511YzH7BBnL._SY300_.jpg", "related": {"also_viewed": ["B008MW6Y12", "B00FWDXZIO", "B00368CDH6", "B0078OVG0O", "B000VZX5R4", "B00442VXCO", "B008FC8FJ8", "B008R3875C", "B000MUQ3NG", "B008FC8FPC", "B008MDOTUE", "B003307BYW", "B0030MIU16", "B005GXFH5O", "B003K0HISY", "B00906DNHC", "B0013A12H6", "B002FJQFIK", "B002IT3242", "B000FNPW96", "B00FGHA3TK", "B009A13IB8", "B0036MDUO2", "B00J61XZUG", "B00368CDGC", "B00J3TWQ8I", "B0056HNTAU", "B006P1QRFU", "B00180KAX8", "B00DYQQSSK", "B007UU354G", "B00906DNSG", "B004Y9HKH4", "B001T9N9IQ", "B0043554TK", "B00187E8UC", "B00DSRD2K2", "B0016NOTOI", "B00C1TOC34", "B005ER3RZE", "B000N29KOW", "B00D8JX296", "B00I7FHQFW", "B0064LCG6U", "B001U363PM", "B000UVNIA8", "B000MURAU6", "B004RO9L4Q", "B001EO6QR2", "B008FC8FUW", "B00AWUFCKG", "B003MB753Y"], "buy_after_viewing": ["B008MW6Y12", "B00FWDXZIO", "B00368CDH6", "B0056HNTAU"]}}