{"asin": "B002MCZJ3C", "description": "Asus O!PlayThese days many of us have a constantly growing media library, with our favorite music, movies, and photos in a variety of formats and locations. The ASUS O!Play is designed to easily bring your media into your living room, without sacrificing quality. Enjoy video in full HD 1080p resolution, full-fidelity audio, and photo slideshows on your HDTV or home theater setup. With impressively wide format support, a wealth of connection options, and playback over a network or directly from USB and eSATA drives, the O!Play is an elegant and modern media solution.The Easiest Way to Enjoy HD Content in the Living RoomHassle-free multimedia playback without file conversionFull 1080p high-definition video via HDMI outputSimple and fast plug-and-play connectivity (eSATA, USB 2.0)High-speed Ethernet LAN connection for easy network streamingBitstream or decode Dolby Digital and DTS Surround audioSleek and compact designFull HD 1080p SupportBy connecting the O!Play HD Media Player via HDMI, you can enjoy full 1080p high-definition video and digital audio using over a single cable. The HDP-R1 also features an optical digital audio output for lossless audio transfer to your receiver or TV.If you have yet to jump on the HDTV or digital audio bandwagon, no worries, the O!Play also features composite (RCA) audio and video outputs to ensure compatibility with most any setup.Small but PowerfulO!Play may be compact, but it's fully equipped to play most formats in your digital library. O!Play supports these formats:Video Compression:MPEG1/2/4, RM/RMVB, VC-1, H.264Video File Extension:.MP4, .MOV, .XVID, .AVI, .DIVX, .ASF, .WMV, .MKV, .RM, .RMVB, .FLV, .TS, .M2TS, .DAT, .MPG, .VOBAudio:MP3, WAV, AAC, OGG, FLAC, AIFFImage:JPEG, BMP, PNG, GIF, TIFFSubtitle:SRT, SUB, SMI, SSAO!Play can also bitstream Dolby Digital and DTS Surround audio to your receiver to bring realism to the next level. If you plan on plugging the O!Play directly to your TV set, HDP-R1 can decode those formats and provide a stereo output without headache or hassle.With such a wide range of compatibility, you can enjoy your media without waiting for conversion.&nbsp;High Speed Connectivity (eSATA and USB 2.0)HD content brings full details to your High Definition TV, but it also requires huge bandwidth to render that detailed content. This is why many consumers have invested in external drives with high-speed USB or eSATA interfaces.HDP-R1 provides an onboard eSATA (external SATA) port that is 6X faster than USB 2.0 for high speed transfer from your portable hard drives.And since the unit features both an eSATA/USB 2.0 combo port and a dedicated USB 2.0 port, you can store your media on drives with either interface, and access multiple drives simultaneously.Advanced LAN Network SupportThose who have their media on network-attached-storage or a networked PC will be delighted to know that the O!Play features an on-board LAN port.With high-speed Ethernet connectivity, you can stream contents directly to the O!Play rather than moving and connecting external drives.No matter your media storage preference, the O!Play's got you covered.Easy-to-Use InterfaceThe O!Play features an intuitive user interface that lets you easily access the files on your storage device regardless of your technical know-how. It only takes a few clicks to begin enjoying your media.Plus, with advanced options, you can customize settings such as subtitles, aspect ratio, noise reduction and more, to optimize your viewing experience.Music Shuffle and More at Your FingertipsThe O!Play features a full-function remote for navigating your media, complete with a unique dedicated button for instantly shuffling your music. Just press the Music Shuffle button, and O!Play accesses all the available music files for random playback.O!Play also works great as a photo viewer to easily share your vacation photos with your family and friends. Use the remote to control the slideshow.One-Year WarrantyThe O!Play HDP-R1 comes with a one-year limited warranty within North America. Please visitSupport.ASUS.comfor more details on ASUS multimedia warranty policy.What's in the BoxASUS O!Play HDP-R1 HD Media PlayerComposite (RCA) Audio/Video CableRemote Control (2x AAA Batteries Included)Power AdapterQuick Starter GuideComplete User Manual (CD)", "title": "ASUS O!Play - TV HD Media Player (Black)", "price": 129.99, "imUrl": "http://ecx.images-amazon.com/images/I/31Rq18nCcYL._SY300_.jpg", "related": {"also_viewed": ["B004Z0S6WK", "B002XVBAKI", "B005LPD4FW", "B0074CC56Y", "B008CBQSKU", "B001JZFQU4", "B00CHDSPSM", "B00JXFM75Y", "B002MZZWT0", "B00IJ142J2", "B004GK0GKO", "B002Q4U9PY", "B005KFHVES", "B002USAIYS", "B006FNCWSY", "B005KOZNBW", "B0065KJN9I", "B008YDUTRO", "B008NO9RRM", "B0042SDDXM", "B009B5FLKY", "B002KG0JMG", "B004CS4A3O", "B005O29F1O", "B005MR6CNK", "B003MVZ60I", "B002VPUZLQ", "B006LEYQK4", "B004HGVUYI", "B0042RA8C2", "B00HTFAVKS", "B00CTEV9SW", "B00G6BC57S", "B002KKFP9Y", "B006WB27G6", "B003GQGYBY", "B00FHREVBK", "B00F37K6VS", "B00D79AQ14", "B00B0OPDUM", "B009C15JAE", "B006OD3M84", "B00EFOLTCK", "B00EDTR7BO", "B003D0WIQS", "B00DBPU8KS", "B0040QRB9I", "B00HR11DKQ", "B00CH643A8", "B00IBUKLPA", "B008C0BUZO", "B00KNL8UXK", "B00JYCE1PU", "B00JA5DCNS", "B00B1GRLKY"], "buy_after_viewing": ["B004Z0S6WK", "B005KOZNBW", "B002XVBAKI", "B008NO9RRM"]}, "categories": [["Electronics", "Television & Video", "Streaming Media Players"]]}