{"asin": "B00G28IP38", "categories": [["Electronics", "Security & Surveillance", "Home Security Systems"]], "description": "Ensure your eyes and ears aware at all times with the Defender&#xAE; Phoenix&#x2122; 3.5&#x201D; wireless video monitoring system. With the included SD card, you are able to capture images or videos of an intruder, pet or employee. The built-in recording grants you the flexibility to record images or videos on demand with built-in motion based recording and on demand recording features. The camera&#x2019;s 8 invisible infrared LEDs show you what is happening up to 15ft away in complete darkness. The rechargeable lithium ion battery will perform up to 24 hours in power save mode so you can enjoy full-time, secure monitoring. ClearVu&#xAE; technology provides a clear and secure digital signal from up to 750ft away. The two-way intercom can be used to communicate with family members, staff and visitors from anywhere on your property. Mount the sleek camera on a wall or sit on a desk and adjust 240&#xB0; horizontally and 65&#xB0; vertically for a perfect view. With extra features such as an LED volume indicator, adjustable brightness, and expandability up to 4 cameras, you can be sure your property is in good hands.Smooth Pan Tilt Zoom CameraUsing the monitor from anywhere in your home or business, you can adjust the camera view horizontally 300&#xB0; and tilt vertically 110&#xB0;. When you find what you are looking for, zoom in to examine what you are seeing in even greater detail.Motion Activated RecordingSensors within the camera can detect movement so that if someone enters your monitoring location, you will know about it. Having the unit record only when motion is detected will conserve SD memory.Record events as they happenRecord an intruder, pet, or staff with your choice of recorded video or still images on the included micro SD card. Simply record and transfer footage to your home computer for review and storage.", "title": "Defender &reg; Phoenix(TM) 3.5&quot; Digital Wireless Security Video Monitor System with Invisible LED Night Vision PTZ and Two Way Talk Intercom", "price": 174.99, "imUrl": "http://ecx.images-amazon.com/images/I/41I-NC1Q6nL._SY300_.jpg", "brand": "Defender", "related": {"also_viewed": ["B003Y73Q4I", "B003Y73Q3O", "B003Y73Q48", "B003Y73Q3Y", "B007PYZZ2C", "B00KC0ZQA2", "B00BVZM84O", "B002TMHF5U", "B003Y73Q4S", "B00564TF4W", "B00CBOTUCC", "B007ROSPJK", "B00JL4QUS2", "B003Z3W4NU", "B009SPUY5O", "B003WOMD7O", "B009BA4KJC", "B00I2IPOJE", "B00B90PY56", "B00AW4CQO2", "B009V9BHNA", "B00BJO98DQ", "B00D3EWL3E", "B006G8HSGO", "B0085JIMQC", "B00BIY0DFY", "B007ULT41S", "B00J4I6VZW", "B00FYVBE96", "B006ZOEQZU", "B007ULT4K4", "B003X26LYG", "B00D538VQY", "B007ULT4KE", "B00ARJQRLU", "B00ADI6RFQ", "B0061GQ7PO", "B000TGC03U", "B0091DR2NK", "B00BLVLHLI", "B00A1D907U", "B000GIP98Y", "B006H1M50E", "B009WQAODG", "B00FRAU42M", "B009LIPJ3U", "B006M9TN42", "B00AWM08LM", "B003VPCHKM", "B002WF0RE0", "B00DVFLLBI", "B009AR2MQO", "B003SX0RHM", "B00AWM5CNQ", "B00DDOKBCM", "B00JL4D8GY", "B00A0JMY8C", "B004Y9OPC2"]}}