{"asin": "B003N12TSY", "categories": [["Electronics", "Computers & Accessories", "External Components", "Optical Drives", "DVD Drives"]], "description": "Read, write, and watch DVDs on the go with the Samsung Portable Optical Disc Drive. The winner of a 2010 iF product design award, this versatile multimedia storage device and DVD writer is 20 percent smaller and 25 percent lighter than conventional optical disc drives. Samsung's TruDirect software allows you to burn DVDs quickly and reliably. To power the device, just plug it into a USB 2.0 or USB 3.0 port--no AC adapter is needed.Portable Optical Disc DriveAt a Glance:Winner of a 2010 iF product design awardSlim, compact design is 25 percent lighter than conventional DVD writersPortable drive is USB-powered; no AC adapter requiredTruDirect technology for fast, easy, real-time digital recordingAvailable in a variety of vibrant colorsBacked by a one-year limited warrantyLightweight, compact design makes it ideal for travel (shown in black).View larger.Features a touch eject button for easy disc insertion and retrieval (shown in silver).View larger.Sleek, Award-Winning DesignThe Samsung Portable Optical Disc Drive was the winner of a 2010 iF product design award from International Forum Design. It features a sleek, rounded design with a curved surface and a metallic centerline, and comes in a variety of vibrant colors, includingblack,blue,pink,red,silver,white, andyellow.The drive's creative design also incorporates a touch eject button on the front, which, when gently pressed, opens the optical disc drive tray.Slim and Compact for Easy TravelThe lightweight, compact design of the Samsung Portable Optical Disc Drive makes it easy to take the device with you wherever you go. The drive is a full 20 percent smaller and 25 percent lighter than conventional DVD writers. At 2/5 by 5-7/10 by 6-7/10 inches (H x W x D), the drive is only slightly larger than a CD case. And it weighs less than 10 ounces, so it travels easily.To power the Samsung Portable Optical Disc Drive, simply plug it into your computer's USB 2.0 or USB 3.0 port. No AC adapter is required.Connects to USB-Compatible TVs for Viewing Videos and PhotosUsing an A/V connector, you can connect the Samsung Portable Optical Disc Drive to your TV and play videos and image files directly on your TV. (For use only on TVs with a USB port; check with the TV's manufacturer for compatibility).Fast, Reliable Disc BurningThe Samsung Portable Optical Disc Drive is equipped with TruDirect technology, which delivers fast, easy, real-time recording from nearly any digital device directly to DVD.TruDirect enables you to create DVDs and burn digital content through a PC without using a hard drive. Unlike other disc-burning software, TruDirect doesn't require empty space on your computer's hard drive to hold the file and backup. TruDirect also eliminates pre-mastering, multiplexing, and hard-drive buffering, so you can perform live-streaming recording.In addition, the Samsung Portable Optical Disc Drive contains technology to prevent buffer underrun errors. As a result, disc burning is fast and reliable.Compatibility and Warranty InformationThis drive is compatible with all major computer operating systems, including Windows 7 and Mac OS X. It supports the following disc formats: DVD-RAM, DVD+R, DVD+R dual-layer, DVD+RW, DVD-R, DVD-R dual-layer, DVD-RW, DVD-ROM, DVD-Video, CD-R, CD-RW, CD-ROM, CD-ROM/XA, CD-Audio, Video-CD, Photo CD, CD-I(FMV), and CD-Text.The Samsung Portable Optical Disc Drive is backed by a one-year limited warranty.What's in the BoxSamsung Portable Optical Disc Drive, USB Cable, documentation, and installation CD.Available in a variety of vibrant colors. Click on your favorite color.", "title": "Samsung USB 2.0 External Optical Drive SE-S084D/TSBS Super WriteMaster, Slim External DVD Writer (Gloss Black)", "price": 32.37, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31vSrJAmVnL._SX300_.jpg", "related": {"also_bought": ["B005GU0DXS", "B000Q8UAWY", "B0082PZ17C", "B005F15N2Y", "B0057ZCWQI", "B004UBUZ64", "B002Q7IKYS"], "buy_after_viewing": ["B00DBV28TG", "B009QBIZ60", "B005KQ0S8S", "B008AJLPYS"]}}