{"asin": "B006FXVT6K", "related": {"also_bought": ["B005YR1PV2", "B003VANO7C", "B0095EFXMC", "B009XZ3Y3I", "B00D601UC8", "B001TH7T2U", "B00FEE78H0", "B003VAHYNC", "B005BZNDS0", "B00EZSUVHK", "B003QXGWM8", "B009SPWJ98", "B003VAGXZC", "B00C18YQ86", "B0031SEMBQ", "B0036E8V08", "B00BZC31WQ", "B002JCSCYS", "B006ZB328U", "B00AQM8586", "B00EMB4L0I", "B00ECDM78E", "B00BP5KOPA", "B00GU1KULM", "B00BBD7NFU", "B0041BT21M", "B009SPL2K0", "B0040L80K2", "B005BZNDOO", "B000A6PPOK", "B004SUO1QM", "B0098Y77U0", "B00BXK7N3S", "B00HJAEO1U", "B005DIH1IS", "B00FNQPIDA", "B00BBIXRHS", "B007U5MGDC", "B00E3W1726", "B004SUO1R6", "B00AVM1VJQ", "B004EFUOY4", "B00DBV28TG", "B008GXQ1OW", "B007ED7V7G", "B007BPKHJ6", "B009NB8WRU", "B00BYQYZJ6", "B001985SWW", "B00HC3YW8E", "B003NREDC8", "B00FE8MKT2", "B00CYX54C0", "B006GOG148", "B0036TGGW8", "B008OEHV6U", "B00BSREURI", "B006JH8T3S", "B0098Y77OG", "B0000BVYT3", "B000643T3K", "B0058UUR6E", "B00C631EYU", "B005HPSFWI", "B00G0O7BZC", "B00C5H5DN0", "B004I4RBXI", "B00C2DLRV4", "B003UL531W", "B00BWBEL1U", "B007S0FUK0", "B005JN9310", "B00KFAGCUM", "B000KZW9WM", "B00D78QCYK", "B005H3I38Q", "B003ELVLKU", "B009TOXRK8", "B003L1ZYYM", "B00ESM3ISM", "B008ABLJC4", "B000N99BBC", "B00310K9VQ", "B006GQHRU8", "B00GAIMXR4", "B004S1O1X4", "B005LN1JEC", "B00BB9OZH8", "B0036FQ23A", "B001A3ZH8Q", "B003KRF9I8", "B00EM2V8AS", "B009YCASUW", "B003UT69IK", "B004GHMU60", "B00C28L138", "B0052SCU8U", "B00CRJWW2G", "B0044GJ516", "B00B588I46"], "bought_together": ["B003L1ZYYM"], "buy_after_viewing": ["B005YR1PV2", "B00ECDM78E", "B00C631EYU", "B00GQQO8FA"]}, "title": "Targus USB 3.0 SuperSpeed Dual Video Docking Station with Power, PC/Mac/Windows 8-Tablet/Netbook Compatible (ACP71USZ)", "price": 158.0, "salesRank": {"Computers & Accessories": 477}, "imUrl": "http://ecx.images-amazon.com/images/I/31k8hqz2FpL._SX300_.jpg", "brand": "Targus", "categories": [["Electronics", "Computers & Accessories", "Laptop & Netbook Computer Accessories", "Docking Stations"]], "description": "Targus USB 3.0 SuperSpeed&trade; Dual Video Docking StationTargus USB 3.0 SuperSpeed&trade; Dual Video Docking Stationwith PowerSuper FlexibilityMake the transition from laptop to desktop in a matter of seconds with the Targus USB 3.0 SuperSpeed&trade; Dual Video Docking with Power. This docking station is the first of its kind to offer the enhanced speed and power associated with USB 3.0; a technology that&rsquo;s being integrated into the latest devices including Ultrabooks. Where there&rsquo;s a need to easily move in and out of an environment, this dock ensures quick and easy setup and provides a place for all necessary peripherals. It even features blazing fast Gigabit Ethernet via USB for high-speed networking. Its blend of power and speed also helps to decrease total cost of ownership while boosting productivity.Super PowerfulThis docking station does so much more than give you seamless access to multiple devices. Although it does provide the convenience of integrating a range of gadgets into your laptop, the Targus USB 3.0 SuperSpeed&trade; Dual Video Docking Station with Power also boasts universal laptop charging to send power to both your laptop and everything it&rsquo;s connected to. This patent-pending technology is compatible with most 90W PC laptops and universal power tips are conveniently stored inside the dock for quick and easy access. The docking station can even provide extra power to your devices when the laptop is disconnected.universal tip storagetips for easy compatibilitysupports most laptop manufacturers&nbsp;Super ViewThere&rsquo;s no need to be limited to high-definition (HD) resolution. This docking station is compatible with the latest monitors and televisions that go beyond HD. Thanks to built-in technology from DisplayLink, the docking station is capable of powering two external monitors natively with up to 2048 x 1152 resolution. It even supports up to four monitors with optional Targus USB 3.0 SuperSpeed&trade; Video Adapters. There&rsquo;s also DVI-I to VGA and HDMI to DVI-D adapters included to help make your current setup compatible with the dock. Simply put, displaying the best graphics your laptop can provide is assured.power two external monitorssupports HD graphics and beyondadapts to your desktop&nbsp;Super Space SaverSaving space is essential in any environment, which is why the docking station&rsquo;s wedge design is so useful. By placing the laptop on top of the dock, performance-stifling hot air is allowed to dissipate while its ergonomic tilt ensures you won&rsquo;t have to compromise valuable desk space. Additionally, a 2 ft. USB 3.0 cable is included to easily connect the dock to any size laptop. For convenience, high-speed charging ports continue to send power to all your devices even when the laptop is turned off.dock functions as a standwedge design saves spaceheat is allowed to dissipateA Slot Above the CompetitionCreating a complete workstation has never been easier. That&rsquo;s because the docking station includes four USB 2.0 ports and two USB 3.0 ports for connecting portable accessories such as HD drives, smartphones, cameras and more. There&rsquo;s even audio in/out ports which allow you to connect speakers, headphones or a microphone, and a security lock slot helps secure the dock and deter theft. Should you need additional support, the docking station is even backed by a one year warranty and exemplary Targus support.SuperSpeed&trade;connectivityright side USB 3.0 port and lock slotleft side USB 2.0 and audio ports"}