{"asin": "B000SDZ0K4", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Hubs"]], "description": "Featuring a slim, ultra-compact design that's ideal for travel, the Belkin Hi-Speed USB 2.0 7-Port Mobile Hub (F5U701-BLK) lets you connect up to seven peripherals through a single open port on your laptop for full functionality anywhere. Ideal for use with USB devices including storage drives, card readers, cameras, laptop mice, external CD/DVD players, and printers, this Mobile Hub supports USB 2.0 and USB 1.1 connections. In addition, plug-and-play installation makes adding it to your existing mobile system quick and easy.Hi-Speed USB 2.0 7-Port Mobile HubAt a Glance:Compact design ideal for travel7 ports with data transfer rates up to 480MbpsCompatible with both USB 2.0 and USB 1.1 devicesIncluded power adapter for charging MP3 players and other devicesBacked by a lifetime warrantyConnect up to seven USB devices.View larger.Bring the USB hub with you when you travel.View larger.High-Speed Convenience with Seven USB 2.0 PortsThe Belkin Hi-Speed USB 2.0 Mobile Hub features seven USB 2.0 downstream ports for fast, efficient data transfers at speeds up to 480Mbps. And it's backward compatible with USB 1.1 devices, which means you can keep older-generation peripherals up and running while maximizing the high-speed performance of new devices. You achieve smooth access to big files, and quick transfer of high-resolution photos and video.Compact, Travel-Ready DesignLightweight and compact, the unobtrusive Mobile Hub is easy to tuck into your luggage, your carry-on, or your laptop bag for fast, USB-device support anywhere you take your laptop. Its sleek, black finish and small footprint also make it a great choice for adding extra USB ports to your home-base setup. In addition, it comes with an AC adapter that makes both running and charging connected USB devices fast and efficient--without draining your laptop's batteries.Plug-and-Play InstallationA plug-and-play setup gets the Mobile Hub up and running quickly and easily. Simply connect it to your computer using a USB cable (sold separately), follow the on-screen directions, and start connecting devices.System Requirements and Warranty InformationThe Mobile Hub works with a broad range of systems. For PC Users, it supports use with Windows 98, 2000, ME, XP, or Vista. For Mac Users, it supports OS 9 to OS 10.The Belkin Hi-Speed USB 2.0 7-Port Mobile Hub is backed by a lifetime warranty.What's in the BoxHi-Speed USB 2.0 7-Port Mobile Hub, power supply, and manual.USB HubsUSB 2.0 4-PortUltra-Mini HubHi-Speed USB 2.04-Port HubHi-Speed USB 2.0 7-Port Lighted Hub (Black)Hi-Speed USB 2.0 7-PortLighted HubHi-Speed USB 2.0 7-PortMobile HubPorts44777USB 2.0YesYesYesYesYesUSB 1.1YesYesYesYesYesUSB PoweredYesNoNoNoNoAC PoweredNoYesYesYesYesUSB HubsUSB 2.04-Port HubUSB 2.0 PlusHub (4 Port)USB 2.0 Plus7-Port HubHigh-Speed USB 2.07-Port Hub2-in-1 USB 2.07-Port HubPorts44777USB 2.0YesYesYesYesYesUSB 1.1YesYesYesYesYesUSB PoweredNoNoNoNoNoAC PoweredYesYesYesYesYes", "title": "Belkin High-Speed USB 2.0 7-Port Mobile Hub", "price": 20.7, "imUrl": "http://ecx.images-amazon.com/images/I/412D5WtAm6L._SY300_.jpg", "brand": "BELKIN", "related": {"also_bought": ["B002AESNUI", "B005A0B4B4", "B000SAB34O", "B00004Z5M1", "B000ESN9GA", "B000Q8UAWY", "B009AR2MD2", "B000SDW84K", "B000NAXC6Q", "B003MTTJOY", "B00C8NNZ36", "B00D78Q2AO", "B003WV5DME", "B000ERAOL4", "B004KQDG2Y", "B009SQQF9C", "B002K3Y2MM", "B00008VFAF", "B000JE9LD4", "B007B5P6S8", "B001TH7GUK", "B001TH7GUU", "B008XVAVAW", "B008ZGKWQI", "B0006NMRVQ", "B001MSU1FS", "B00080G0BK", "B007ED7V7G", "B00E3W19MO", "B003ES5ZSW", "B005UUY25E", "B00006RVPW"], "bought_together": ["B00004Z5M1"], "buy_after_viewing": ["B000TTTJ36", "B00BWF5U0M", "B000Q8UAWY", "B00008VFAF"]}}