{"asin": "B004HO58KC", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The slim FinePix T300 digital camera has a FUJINON 10x long-zoom lens, and is only 18.5mm thin. Combined with a 14-megapixel CCD sensor, it offers photographers the perfect fit: a complete set of advanced features, a size to fit in any pocket or small bag, and a price to fit their budgets. This powerful mix of features will ensure users capture great images, whether they are wide-angle landscapes or closely cropped portraits with details.Fujifilm FinePix T300 HighlightsImage StabilizationIn addition to the 10x zoom, the T300 also comes equipped with a powerful sensor shift Dual Image Stabilization (CIS) system. CIS works as the photo is being taken as it combines a mechanically stabilized sensor with high ISO to combat camera/hand shake and subject movement for improved low light shooting. The result is an expanded range of shooting situations where the cameras can be used without the need of a tripod or other support. With CIS working in the background, you can capture sharp, colorful scenes and portraits at night.HD CapabilityCapture stunning movies in 720p HD with sound at 30 frames per second. You can even zoom during movie capture. Not only can you enjoy HD movies on your PC, but with the optional HD Player accessory kit with wireless remote control (HDMI cable not included), families can gather around their home HDTV to enjoy amazingly detailed stills and high resolution movie playback.Tracking Auto FocusTracking Auto Focus is perfect for when you need to take a picture of a moving subject and can't keep your subject in the frame. Just switch Tracking Auto Focus on and it will track your subject and ensure that you achieve a crisp picture with you subject in the center of the frame in perfect focus.Face Recognition TechnologyWith Face Recognition, the T300 can identify the people in a picture by name! Fujifilm's Face Recognition Technology gives you the ability to pre-program 8 people into the camera. You also have the option of inputting the category to which they belong (e.g. friends/family) and the date of his/her birthday. The next time you take a photo of the same person, the camera will cleverly recognize that person and optimize the settings to ensure that exposure and focus are best suited to the individual, rather than the other people in the picture. This fun technology can recognize up to 4 pre-programmed people on screen at the same time.In addition, the Image Search Tool is able to use the Face Recognition data (name, birthday and category) to help you find and playback your photographs quickly and easily. If you want to scroll through all pictures featuring \"Mom\" for example, the camera will be able to select them for you for easy viewing.Additional FeaturesFace Detection and Automatic Red-eye Removal: To provide perfectly exposed and focused portrait shots, each T-Series model is fitted with Fujifilm's latest Face Detection technology which is able to track up to 10 faces simultaneously. The system instantly corrects red-eye and then saves both the original and the corrected image file automatically.Scene Recognition Auto (SR AUTO): This mode intelligently detects the scene type you are shooting and optimizes the camera's focus, exposure and white balance, so whether you're photographing flowers or a holiday landscape, you will get flawless photos at the press of a button.Motion Panorama Mode: Automatically stitches up to three shots to create a panoramic picture.Smile / Blink Detection: Smile Detection works with Fujifilm's highly-acclaimed Face Detection technology to detect smiles on faces: it will not take a picture until it detects a smile, so you're guaranteed happy shots! Another feature is Blink Detection which warns you if you have captured an image with people blinking, so you can re-shoot if necessary.PhotoBook Assist: Choosing images for a photo book can be time-consuming. The Photo Book Assist feature allows you to tag images, and then creates a simulation of the photo book which can be viewed on the LCD.", "title": "Fujifilm FinePix T300 14 MP Digital Camera with Fujinon 10x Wide Angle Optical Zoom Lens (Black)", "price": 69.0, "salesRank": {"Camera &amp; Photo": 10009}, "imUrl": "http://ecx.images-amazon.com/images/I/51zgQzZq-dL._SX300_.jpg", "related": {"also_bought": ["B0045DPCNI", "B003VNKNEG", "B001V9KG0I", "B00249GRAW", "B003VNKNEQ", "B003F43C1M", "B003P9VMXC", "B006T7QUDE"], "buy_after_viewing": ["B003VNKNEQ", "B006T7QUDE", "B003DPR7AK", "B003VNKNF0"]}}