{"asin": "B000F6SR0O", "description": "Featuring Panasonic's 9th generation gas-plasma screen, the 42-inch TH-42PX60U features a width-to-height 16:9 aspect ratio similar to movie theater screens, providing a theater-like experience at home. Its maximum of 29 billion colors and over 3,000 shades of gradation provide exceptionally fine detail for outstanding HDTV reproduction. The set's built-in ATSC (DTV) tuner pulls HD signals (480p/720p/1080i) right from the airwaves, and its QAM tuner is fully compatible with unscrambled HDTV cable reception. A standard analog NTSC tuner receives standard-definition (SD) programming. It also includes a Secure Digital (SD) memory card slot, enabling you to take an SD card directly from a digital still camera or camcorder and insert it directly into the TV for quick and colorful photo slideshows.A plasma screen renders vivid colors like you've never seen before (as in, up to 29 billion in this case), extremely wide viewing angles (wider, even, than those of most LCD screens), and easy placement due to a plasma monitor's slim profile--the TH-42PX60U is a mere 3.7 inches deep, one of the slimmest plasmas around--perfect for desk or wall mounting. Brightness tends to be extremely uniform across plasma screens, which are also impervious to the picture distortion and negative color balances that afflict CRT monitors when placed near lighting or sound systems.The TH-42PX60U features a 1024 x 768-pixel resolution and an amazing contrast ratio of 10000:1. (The higher the contrast ratio, the greater a TV's ability to display subtle color details and not get washed out by ambient room light.) The 3D Y/C digital comb filter constantly analyzes the three dimensions of picture height, picture width, and picture changes-over-time, to reduce dramatically edge image artifacts while improving transition detail. Other features include V-Chip parental controls, on/off sleep timers, closed-caption decoding, aspect ratio control, and video input labeling.The TV's internal stereo speakers are powered by 10 watts per channel (for 20 watts of total power). It features the following connection options:Component (Y/Pb/Pr): 2 inputs (with 2 audio inputs)HDMI: 2 inputsComposite (RCA audio/video): 3 inputs (1 on the front), 1 outputS-Video: 3 inputs (1 on the front)HDMI (High-Definition Multimedia Interface) is a lossless, uncompressed, all-digital audio/video interface to link any AV source with an audio and/or video monitor, such as a digital television (DTV). HDMI supports standard-definition (SD), enhanced definition (ED), or high-definition (HD) video, plus multi-channel digital audio--all using a single cable.If a component doesn't have an HDMI connection, you'll also get great picture reproduction using the three-jack component video (Y/Pb/Pr) input, which provides separate connections for luminance (Y), blue color difference (PB) and red color difference (PR). This results in increased bandwidth for color information, resulting in a more accurate picture with clearer color reproduction and less bleeding than you would get with S-Video or composite (RCA yellow video plug) connections. Component video output is available only for DVD playback.What's in the BoxPlasma TV, remote control (with batteries), pedestal base, power cord, printed operating instructions", "title": "Panasonic TH-42PX60U 42-Inch Plasma HDTV", "price": 314.99, "imUrl": "http://ecx.images-amazon.com/images/I/51JA9S3NFYL._SY300_.jpg", "related": {"also_viewed": ["B00BB9ORT4", "B000XEV6FQ", "B00BP5N498", "B00ARAHBIW", "B00HPMCO46", "B00IGXEBEY", "B00I94ISS0", "B00BB0ZTO0", "B00FFJ0HUE"], "buy_after_viewing": ["B00AEP8TG8", "B00BB0ZTJA", "B00BB0ZTJA", "B0074FGR74", "B0019D37M0"]}, "categories": [["Electronics", "Television & Video", "Televisions", "Plasma TVs"]]}