{"asin": "B00078GLJY", "description": "Improve the picture quality of DVD movies shown on your high-definition television with the versatile OPPO Digital OPDV971H DVD player, which provides 480p/540p/576p/720p/1080i resolutions and can upconvert 480i video from DVDs to the high definition 720p/1080i formats. Featuring a slim and elegant design, it featurs a sleek, silver design that will fit in nicely the rest of your home theater's components. In addition to standard DVD move and CD audio discs, it's also compatible with DVD-R/RW, DVD+R/RW, (S)VCD, HDCD, and CD-R/RW discs as well as WMA and JPEG digital content. It also plays DivX 5, DivX 4, DivX 3, and DivX VOD video content (in compliance with DivX Certified technical requirements).The OPDV971H features Faroudja's Emmy award-winning DCDi deinterlacing and scaling technology to up-convert standard video in DVDs to HD resolutions. DCDi (Directional Correlational Deinterlacing) technology eliminates the jagginess that conventional upconverters introduced to diagonal edges in video. Faroudja&#xD5;s unique DCDi algorithm identifies all the moving edges in a scene and adjusts the angle of interpolation at each pixel so that the interpolation always follows the edge instead of crossing it, eliminating staircasing or jagged edge artifacts.Other features include a 108MHz/12bit video D/A converter, super error correction with twin laser and intelligent laser wavelength control, NTSC/PAL output (from both NTSC and PAL formatted discs), multi-angled view capability, virtual surround sound, and built-in Dolby Digital and DTS decoders. Future upgrades to the firmware can be updated to the player via a CD-ROM disc. It offers the following connection options:DVI Out: 1 (480p, 576p, 540p, 720p, 1080i resolutions)S-Video Out: 1Composite AV Out: 1Component OutSubwoofer Out: 1Optical digital audio Out: 1Coaxial digital audio Out: 1Tech TalkDivXis a video codec (a piece of software encoding and decoding video) based on the MPEG-4 compression format, that blends good quality video with a low bitrate. This translates to a smaller file size (around 15 percent of a standard DVD's video file), making it easier to transfer to portable devices as well as quicker to create (encode).HDCD(High Definition Compatible Digital) is a disc encoding format for audio CDs and DVDs. It can encode 20 bits of audio information into a conventional CD 16-bit channel, yielding a greater dynamic range and a more true-to-life sound when decoded. HDCD-equipped players will improve audio quality for even traditionally recorded CDs and DVDs. Conversely, because of the recording process, HDCD-encoded media will also sound better than traditionally CDs and DVDs on players that don't have the HDCD chip.DVI(Digital Video Interface) provides an uncompressed transfer of high definition video from a digital video source to a digital display device. HDCP (High Bandwidth Digital Content Protection) ensures copy protection of the content. The DVI output is also essential if you want to watch copyrighted DVD&#xD5;s at a higher, upconverted resolution (other video connections do not provide upconversion).What's in the BoxDVD player, remote control (with batteries), video cable, RCA L/R audio cable, printed operating instructions", "title": "OPPO OPDV971H Digital HD-Ready Up-Converting DVD Player", "price": 5.99, "imUrl": "http://ecx.images-amazon.com/images/I/311GKT3EV6L._SX300_.jpg", "related": {"also_viewed": ["B004BLK24S", "B009LRR5AQ", "B004BI6MVS", "B00GPFM106", "B00817UWQ6", "B002CO6GUK", "B00BFEF9N8", "B00AFKBIYW", "B00HUGNN06", "B004QIPKNY", "B001IBHUU8", "B009AHQ8C8", "B007F9XHAY", "B00CP76N7U", "B005NEZDUA", "B0045PKK60", "B003ANVQWU", "B00AYB3OOY", "B00HUGP9EY", "B00A2QJMRY", "B00D0EP68Y", "B003R7KMTW", "B00752R4QO", "B005625SJK", "B0038JECKO", "B004SBHSZ2", "B00F6B3ULE", "B004UR487A", "B00AWKC0JM", "B009UXEOIW", "B005F0XRAU", "B001URWAYG", "B00BN9CH26", "B0065907GC", "B00FBQ84F6", "B001PBQNPO", "B00DB8MLK0", "B00GXTUTN0", "B007BYLO4E", "B004ZHDP0Q", "B00BFRKYVM"], "buy_after_viewing": ["B003L1ZYYM", "B001TH7GSW", "B007F9XHAY", "B007F9XHAY", "B00AWKC0JM"]}, "categories": [["Electronics", "Television & Video", "DVD Players & Recorders", "DVD Players"]]}