{"asin": "B002ZLOR38", "imUrl": "http://ecx.images-amazon.com/images/I/41e1u2DgMEL._SX300_.jpg", "description": "Hercules eCafeCombining value and design, this unique eCAF&Eacute;&trade; signature product is easy on the eyes while meeting the user&rsquo;s every need for convenience. Featuring a unique &ldquo;in-mold&rdquo; designed cover with a high gloss finish and mirror effect that causes a visual interplay of metallic and non-metallic colors, the eCAF&Eacute;&trade; EC-1000W never looks the same, changing with each moment of use. Built to be beautiful on the inside and outside, the eCAF&Eacute;&trade; EC-1000W features the most intuitive and essential applications for netbook users that are easy to understand and use. The eCAF&Eacute;&trade; EC 1000W offers a custom designed software package with functions available for the first time ever in a netbook. The eCAF&Eacute;&trade; is sturdy enough for urban users and provides an optimal keyboard setting and reading comfort.Key FeaturesWindows 7 Starter operating system with Windows Live&reg; Suite: Messenger, Mail, Photo Gallery, Movie Maker &amp; Media PlayerIntel Atom N270 1.6GHz Processor1GB Ram250GB HDD Storage + an extra 50GB of online storage6 Cell BatteryWiFi N TechnologyBuilt in webcam with microphoneComfortable chiclet keyboard with separated flat keysComplete Open Office SuiteFull version of the Avast! Anti-virus software2 Year manufacturer warrant y and toll-free tech supportLearn MoreeCAF&Eacute;&trade; Email CenterThe eCAF&Eacute;&trade; Email Center email management system allows users to access their multiple email accounts intuitively, efficiently, quickly and separately to avoid role conflict. The whole process is astonishingly easy with a 3-step mailbox setup process and color assignment per email account which includes colored icons and incoming mail pop-ups.eCAF&Eacute;&trade; Webcam StationThe webcam station software used with the Xtra Controller Pro application featured in Hercules webcams offers an unrivalled video chat experience with functions not previously included in netbooks, including the Chat and Show function , Image conversion and automatic formatting, 3 mode photo capture, One click video capture and more.eCAF&Eacute;&trade; CONNECTThe eCAF&Eacute;&trade; CONNECT tool provides easy network connection management via WiFi or Ethernet and works with the Windows 7 utility providing two ways to connect as the tools are perfectly synchronized with one another. It also allows users full control over the process and detects favorite networks without asking again for passwords.eCAF&Eacute;&trade; Update ManagereCAF&Eacute;&trade; has its own ecosystem that is available to consumers via the Web portal www.ecafe.hercules.com, complete with tutorials, tips and 50GB free online storage. The eCAF&Eacute;&trade; Update Manager tool not only updates the software included with the netbook, but also continually adds new applications to the eCAF&Eacute;&trade; such as games, special apps, and more.Includes Window 7 StarterWindows&reg; 7 Starter Edition was the obvious choice as an operating system to provide consumers with a solution that features a range of uses, is easy on system resources and provides maximum compatibility, for an experience on par with users&rsquo; expectations. All of the following have been included to round out the software experience for consumers: Internet Explorer 8 and the Windows&reg; Live suite of applications: Live Mail, Live Messenger, Photo Gallery and Movie Maker..", "categories": [["Electronics", "Computers & Accessories"]], "title": "Hercules eCafe EC-1000W 10.1-Inch Netbook - Up to 6 Hours of Battery Life"}