{"asin": "B0051OKCHG", "description": "Introducing the IdeaPad&reg;Tablet K1 &mdash; view the web as you&rsquo;ve never seen it before.The 10.1\" IdeaPad&reg;Tablet K1 is an attractive Android 3.1 mobile entertainment device that's uniquely optimized for enjoying music, movies, apps and the web on the go, for users that want to enjoy great multimedia without limitations.An entertainment tablet that runs Android 3.1Optimized for the web with Flash, full DRM and instant data syncing&nbsp;Lenovo IdeaPad K1PRODUCT FEATURES AND ATTRIBUTESA mobile entertainment device with a 10.1&rdquo; multi-touch displayUltraportable; just .52\"  thin &amp; weighing only 1.65lbs, with aluminum rear-casingOptimized for the web; full support for Flash content, complete Digital Rights Management (DRM) so you can legally download &amp; store movies, plus instant syncing of your photos, music and videos with a dedicated online storage spaceLenovo App Shop and the Android Market ensure ready access to thousands of useful appsKEY SPECSNVIDIA&reg;Tegra&trade;  2 T20 1.0GHz ProcessorGoogle Android 3.1 operating system10.1&rdquo; HD (1280x800) display1GB DDR2 memory, 32GB SSD storageIntegrated Bluetooth&reg;and 802.1 b/g/n Wi-Fi connectivityMicro SD card reader, Mini HDMI connector &amp; docking portIntegrated front (2M) &amp; back (5M) mounted webcamINSPIRE CREATIVITYSlim and eye-catching design with a black textured cover.GO THE DISTANCEUltraportable; just .52\" thin and weighing only 1.65lbsIntegrated Bluetooth&reg;and Wi-Fi connectivity for internet on the moveCAPTIVATE AND ENTERTAINIntegrated front (2M) &amp; back (5M) mounted webcamFull support for the latest Flash content10-point multi-touch for an unmatched touch &mdash; screen experienceInstantly syncs photos, music and videos with a dedicated online storage space for easy sharing across multiple devices, or with the wider world through integration with popular social networking sitesDigital Rights Management (DRM) allows you to legally download &amp; store movies on your tablet in every available format and watch them later &mdash; anywhere, anytimeSocialTouch&reg;allows you to manage all your social networking engagements on sites like Facebook&reg;and Twitter&reg;on a single, easy-to-use interfaceA range of addictive games like Angry Birds and Galaxy on Fire 2 THDLenovo App Shop and the Android Market ensure ready access to thousands of useful appsDO MORE OUT OF THE BOXStart your tablet experience right when you open the box. More than 30 popular apps &mdash; including ones that you would typically have to pay for like Documents To Go&reg;&mdash; are already preloaded onto your device. Also take advantage of everything Android has to offer with the Android Market and the Lenovo App Shop, which contains apps tested specifically for Lenovo tablets.DO MORE ENTERTAINMENTOne of the first Android tablets with full support of Flash so you can enjoy your favorite online videos and websites or buy and rent your movies and TV shows with Digital Rights Management (DRM). With a true 10.1\" (1280x800) HD display you can enjoy your HD movies and videos to their fullest. And with the HDMI connection, you can view them on your other HD displays in full 1080p.DO MORE SOCIAL NETWORKINGConnect to your entire social networking empire with Lenovo's breakthrough and exclusive SocialTouch app. Video chat with your circle from anywhere in the world with the front and back mounted webcams.DO MORE CLOUD SHARINGIntegrated cloud storage (2GB free) is designed to make it easy to share your photos, videos and files with friends and family whenever you like.&nbsp;&nbsp;", "title": "Lenovo IdeaPad K1 130422U 10-Inch Tablet (Black)", "price": 6.8, "imUrl": "http://ecx.images-amazon.com/images/I/51N12GKcYML._SY300_.jpg", "related": {"also_bought": ["B00E4RXD04", "B005R3UFQO", "B007P1L72W", "B007TGG0JS", "B007VY7IKI", "B007GJR7GS", "B005SSRWTG", "B005LIDF5S", "B004U78J1G", "B005G0MALQ", "B007LI1UOE", "B005L968D8", "B005LIDF0I", "B005SMD5RU"], "buy_after_viewing": ["B007VY7IKI", "B00F2ENU92", "B007P1L72W", "B009QZH7BU"]}, "categories": [["Electronics", "Computers & Accessories", "Tablets"]]}