{"asin": "B0001A99MO", "description": "Everything you love about iPod just got tinier. iPod mini lets you bring along enough music for a three-day weekend getaway in a package so small you&#x92;ll forget you&#x92;re carrying it. Until people ask you about it, that is.Fashionably CompactApple engineers squeezed all the best features of iPod into a case weighing just 3.6 ounces and smaller than most cell phones. iPod mini features an anodized aluminium case that resists stains and scratches. The case weighs practically nothing, but protects iPod mini in your pocket, purse or backpack. Recessed in the case to keep its surface pristine wherever you lay it, the 1.67 inch (diagonal) backlit screen displays full song names and more. Like its (slightly) bigger brother, iPod mini gives you over 25 minutes of skip protection and lasts up to 8 hours on a single battery charge. So you won&#x92;t pay a penalty for miniaturization.Can Touch ThisIn fact, all the features of iPod are still under your thumb. Always striving for perfection, Apple engineers moved the iPod&#x92;s buttonsunderthe wheel. The iPod mini Click Wheel gives you the enhanced durability and sensitivity of the iPod Touch Wheel, with buttons underneath. The Click Wheel takes best advantage of miniscule space and lets you scroll single handedly though 1,000 songs from your iTunes music collection. You&#x92;ll find such thoughtful construction only from Apple. Because try as they might, the competition can&#x92;t touch this.Oh, one other minor detail, you can choose your iPod mini in one of five trend-setting colors: silver, gold, green, pink, or blue (all shiny).Little iPod. Same great features.Autosync your iPod mini with Mac and WindowsiTunes 4 lets you organize your music on your Mac or Windows PC and automatically transfer it to iPod mini. Whether you&#x92;ve ripped your CD collection to MP3, bought music from the iTunes Music Store or made your own track with GarageBand, you can take it with you wherever you go. Your iPod mini includes both a FireWire and a USB 2.0 cable for high-speed transfer from your Mac or PC. In fact, you can move an entire album from your computer to your iPod mini in seconds flat. With the industry&#x92;s only true Auto-Sync, your iPod mini is always up-to-date, mirroring the latest changes you&#x92;ve made in iTunes. And if your collection on your computer is bigger than iPod mini, you can let iTunes automatically choose a selection of songs to fill it up.Games, Calendar, Contacts & NotesBehind the Click Wheel of your iPod mini await features that make it the world&#x92;s best digital music player. Listen to your music as you fall asleep, and wake up with music or an alarm. Store a copy of your contacts, calendar and to-do lists on your iPod mini. Or keep anything from store restaurant reviews to nightlife guides, and news articles to exercise routines -- right at your fingertips. iPod mini also includes four fun games you can play anywhere, a feature you&#x92;re sure to appreciate the next time you&#x92;re standing in line or waiting for someone. You can even play your music as the soundtrack to the games -- Music Quiz, Solitaire, Brick and Parachute.iPod supports vCalendar and iCalendar files, which can be exported by many applications, including Microsoft Entourage, Palm Desktop and iCal. And with support for industry-standard vCard files, iPod lets you store and access all your important contact information with the touch of a button. you&#x92;re standing in line or waiting for someone. PLus, the notes reader lets you can transfer text-based information to your iPod and read it on-screen. Now you can have the information you need &#x97; from restaurant reviews to concert guides to news articles &#x97; right at your fingertips.", "title": "Apple iPod 4 GB mini M9160LL/A (Silver)  (Discontinued by Manufacturer)", "price": 140.0, "imUrl": "http://ecx.images-amazon.com/images/I/11YNYNV0SCL.jpg", "related": {"also_bought": ["B0001A99LA", "B004I51X0E", "B0001A99LK", "B0001A99ME", "B000P3I1MQ", "B000BDVM8K", "B000EP4TWQ", "B004I4ZZU4"], "buy_after_viewing": ["B000EP4TWQ", "B002MAPT7U", "B0001A99LK", "B0001A99LA"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}