{"asin": "B001G3AZS2", "description": "Take a trip back in time to the heyday of the SEGA Genesis console by way of your Xbox 360 withSonic's Ultimate Genesis Collection. Led by six classicSonic The Hedgehogfavorites, this collection is packed with games from iconic franchises you know and love, likeEcco the Dolphin,Streets of Rage,Golden AxeandPhantasy Star, but also contains many others you may have missed. The largest collection of classic SEGA titles available to date, these 40+ games bring classic single player and multiplayer action to life like never before as the best of the SEGA Genesis catalog is reborn on the Next-Gen stage of Xbox 360.Side-scroll for rings with Sonic.View larger.'Beat 'em up' in Streets of Rage.View larger.Hack 'n Slash in Golden Axe.View larger.Find your inner ninja in Shinobi III.View larger.Classic Play Upgraded and Earning AchievementsEach title withinSonic's Ultimate Genesis Collectionhas been converted to hi-def (720p), ensuring that classic SEGA Genesis 2D style gaming never looked so good, but this collection is about more than looks. Each game will also play just as well, with original control schemes precisely matched to the intuitive and familiar controls of the Xbox 360 video gaming system. And since fun is always better when shared, multiplayer fans will enjoy the competition as they and their friends engage in 2-player classic battles in select games. Lastly all players with an Xbox LIVE membership will appreciate that their side-scrolling skill translates to the online arena via the collection's extensive set of Xbox LIVE achievements.Games Included:Alex Kidd in the Enchanted CastleAlien StormAltered BeastBeyond OasisBonanza Bros.ColumnsComix ZoneDecap Attack starring Chuck D. HeadDr. Robotnik's MBMDynamite HeaddyEcco the DolphinEcco II: The Tides of TimeE-SWATFatal LabyrinthFlickyGain GroundGolden Axe IGolden Axe IIGolden Axe IIIKid ChameleonPhantasy Star IIPhantasy Star III: Generations of DoomPhantasy Star IV: The End of the MillenniumRistarShining in the DarknessShining ForceShining Force 2Shinobi III: Return of the Ninja MasterSonic 3D BlastSonic and KnucklesSonic SpinballSonic the HedgehogSonic the Hedgehog 2Sonic the Hedgehog 3Streets of RageStreets of Rage 2Streets of Rage 3Super Thunder BladeVectormanVectorman 2*Additional games such asCongo Bongo,Zaxxonand others available as unlockables.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51Ov%2BhMS8PL._SY300_.jpg", "related": {"also_bought": ["B006MQH644", "B001E3VKC4", "B009GWKP76", "B004JF4Z3U", "B002W5GI8Y", "B004X56OU8", "B008J16AP6", "B00F9MZT2I", "B002BRYHUY", "B0017HPE7E", "B008OQTRYW", "B003ZSP0WW", "B0017ZDGWG", "B00BU3ZLJQ", "B004M8NR7E", "B002I0HEI6", "B002W5GI98", "B003C1I0CO", "B00DWXV1DM", "B003R783IY", "B007MM9E4C", "B006ZPAYGE", "B00DWXV1BE", "B0002VS8T2", "B007IFMFYE", "B003VJKJG2", "B0038N0A24", "B0050SWALO", "B00CSLIYU2", "B00821HMDM", "B003O6E9EK", "B007M6W38W", "B003O6G6RI", "B006ZPAYMI", "B0088I7KYU", "B002MED6F8", "B003IE9V28", "B0034JKYO6", "B000G0LE0Y", "B0051875OU", "B005C7R8I8", "B0042GW7C2", "B002I0J9M0", "B005GWU0FM", "B000UKZ20S", "B007SRM5MO", "B0043KI082", "B002I0IIPY", "B00559XGXO", "B002QK00NE", "B0050SWTAQ", "B000P297JI", "B00009B8DL", "B0050SYE40", "B008YTAJLE", "B003O6CACS", "B000NA6M2C", "B0002VYPEE", "B0053BG122", "B008277M0Y", "B00C7RVNY6", "B000XJNTPG", "B0050SYAQ2", "B0012N3ZXS", "B002GCFI2K", "B000ZKDOVW", "B00E20STAC"], "bought_together": ["B004X56OU8", "B003ZSP0WW"], "buy_after_viewing": ["B004X56OU8", "B00BU3ZLJQ", "B009GWKP76", "B002BRYHUY"]}, "salesRank": {"Video Games": 2089}, "categories": [["Video Games", "Kids & Family", "Xbox 360", "Games"], ["Video Games", "Xbox 360", "Games"]]}