{"asin": "B007PM8AFS", "description": "No question asked lifetime warrantyInfiGear HDMI cables come with a no question asked lifetime warranty. All of our cables go through rigorous testing. We are very confident of the quality of our cables and offer a lifetime warranty on all of our HDMI cables. In an unlikely scenario of if a cable fails, please contact us for a replacement.Audio, Video and Internet in a single cableInfiGear HDMI cables support the latest HDMI standard that allows audio, video and internet to be combined into one cable.NOTE: Ethernet Channel has no effect on audio or video and does not affect compatibility/quality with devices that do not use the internet.This cable is backwards compatible with all previous HDMI standards. If your device does not support Internet, this cable will still meet or exceed the old standards.Shielding and Gold-Plated Connectors for Signal PurityThe outer shielding provides defense against interference and helps maintain the integrity and purity of the digital signal. Gold-plated connectors resists corrosion while offering optimal signal transfer with lower distortion. This results into a sound and picture quality that is more true to the original.Features- Ethernet channel for Internet sharing- True HD Dolby 7.1 and DTS-HD Master Audio- Supports Audio Return Channel and 3D content- 4K, 1440p, 1080p, 1080i, 720p, 480p, and 480i Resolutions- Refresh Rates of up to 240hz and 48-Bit Deep Color- Transfer Rates of Up to 340Mhz or 10.2gbps- Works with all HDTVs, Blu-ray players, Xbox 360, PS3 and any other HDMI devices- HDCP Compliant- ATC (Authorized Testing Center) certifiedPhysical Specifications-28 AWGCable. Unlike lot of other HDMI cables, these cables are the thicker 28 AWG cables.- Shielding throughout cable- Gold plated connector helps resisting corrosion- Full metal jacket connectors", "title": "InfiGear Ultra Series High Speed HDMI Cable (6 Feet) - Supports Ethernet, 3D and Audio Return [Latest HDMI Standard]", "price": 3.44, "imUrl": "http://ecx.images-amazon.com/images/I/41eOPUuiJ-L._SX300_.jpg", "related": {"also_bought": ["B007PKLXQS", "B007PMA2FY"], "buy_after_viewing": ["B007PKLXQS", "B005K97B4Y", "B0019EHU8G", "B0002L5R78"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Cables & Interconnects", "Video Cables", "HDMI Cables"]]}