{"asin": "B00005B8G1", "description": "The Game Boy platform (which includes the original unit, the Game Boy Pocket, and the Game Boy Color) came to market when most video game consoles had a life expectancy of just a few years. More than a decade later, the system is still going strong. How did the Game Boy successfully compete--and in some cases bury--an onslaught of faster, more powerful handheld and home console systems? Let us count the ways: affordability, a huge library of games that consistently made the most of the hardware's limitations, smart power management that extended battery life, and uncluttered controls. But perhaps it was the system's ultraportable design that allowed devotees to play video games around their schedule, making it the must-have system for kids and adults alike.Now the Game Boy Advance (or GBA as people are already calling it) comes to us with power that would have been unthinkable back in the day. The portable's 32-bit RISC CPU runs circles around the former's 8-bit workhorse, allowing it to process program instructions much faster. What that means to everyday gamers is more intricate visuals, more simultaneous movement on the screen, and better sound. In fact, the often-annoying beeps and boops of old-school Game Boy titles are being replaced with digitized stereo sound. The extra processing muscle also means you can even network up to four Game Boy Advance units together, via the communication cable, for multiplayer fun off of one shared cartridge. Only two Game Boy Color units could link together, and each unit had to have its own copy of the game.What's not being replaced, however, is the wide selection of Game Boy games. Because the Game Boy Advance system is backward-compatible, it will play its own line of colorful games--including such launch titles asSuper Mario Advance,F-Zero: Maximum Velocity,Army Men Advance,High Heat Major League Baseball 2002,Tony Hawk's Pro Skater, andReady 2 Rumble Boxing: Round 2--as well as all of the monochrome and color games that have already been released for the previous Game Boy systems (nearly 500 in total). Players can view the older games in their smaller, originally square dimensions, or, with the touch of the shoulder button, expand the game to fit the GBA's larger screen. We tried enlarging the screen on a Game Boy Color edition ofTony Hawk's Pro Skater 2and found that Mr. Hawk was much easier to see.When you first pick up the system, you'll be amazed at how lightweight it is. At fewer than 5 ounces and a little larger than a deck of playing cards, the system easily fits into a shirt pocket without any sag. The GBA's wider shape fits better into a wider range of hands. The former design too often pushed the left and right thumb knuckles together during gameplay. The new layout should be comfortable for all ages, and the center screen orientation makes it easy to see.Game Boy Color owners will find the GBA's larger screen somewhat darker than they're used to, but that's because the screen is outfitted with antiglare technology. Like the old Game Boy Color, the color LCD is not backlit, so you need pretty good light to play by. Unlike that system, though, you won't be craning your neck and tilting the unit to see around the hot-spot reflection of the light bulb in your screen.But you'll also notice the graphics. Sporting what's basically a redesigned SNES technology, you'll see things on the GBA that the big consoles do, such as scaling (making objects larger or smaller) and rotation effects--technological advances that will affect the look of everything from crossing a finish line to throwing a touchdown pass to crawling through a dungeon.Some might argue that Nintendo could have tried to put even more power into this Game Boy Advance. After all, the 32-bit video game had its heyday more than five years ago. Perhaps, but after handling this new handheld, we're inclined to think that Nintendo wisely struck a balance between size, price, and power consumption. And considering how well the old 8-bit system weathered the decade's technological storms, we think the Game Boy Advance is here to stay, and we're glad.--Porter B. HallUnit SpecificationsCPU:32-bit RISC CPU with embedded memoryScreen:2.9-inch reflective TFT color LCDDisplay Size:1.6 by 2.4 inches (40.8 by 61.2 mm)Resolution:38,000 pixels in a wide-screen aspect ratio (10,000 per square inch)Colors:512 simultaneous colors from a palette of 32,768Size:3.2 by 5.6 by 1 inch (82 by 144.5 by 24.5 mm)Weight:Approximately 5 ounces (140 grams)Power Supply:2 AA alkaline batteriesBattery Life:Approximately 15 hours continuous play", "price": 1.69, "imUrl": "http://ecx.images-amazon.com/images/I/41ZWZ795YML._SY300_.jpg", "related": {"also_bought": ["B00AYBVB44", "B000GLHQJG", "B000047GEI", "B00000IYEQ", "B002CJ8Z04", "B00DTCYCAU", "B00005B8FZ", "B00005UK88", "B00000IYER", "B00DTCWNL0", "B0006SSR24", "B0015DOOEY", "B0000E5U6M", "B00G2F1N80", "B00005MDZY", "B00004TCT3", "B00D3IKP7Y", "B00004TEYR", "B002SUF668", "B00006LELB", "B000MIL3WY", "B00005B8G3", "B00009WAUO", "B0006GBCZU", "B0000A09EP", "B00005LBHM", "B00005B8G2", "B000084314", "B00006FWTW", "B00006M3R6", "B000VBB69M", "B00005BZE0", "B00028S9P8", "B00008URUF", "B00005MO5G", "B0006GBD04", "B000FDKZMU", "B00GKL905O", "B000A3E0MQ", "B004910A8I", "B00G2F1HB8", "B00AYQRGFW", "B00030GS80", "B00002SVEO", "B00068O278", "B0002TB4CW", "B00000J9J9", "B00005NCAD", "B000070IW6", "B008216WOW", "B000Y8EUVI", "B001C4TE9G", "B000066TS7", "B00000J97G", "B000FW57CE", "B000046S41", "B000090W86", "B0000A9Y11", "B0001JXACA", "B00005V9NJ", "B0000631WO", "B000GQ1G2E", "B00002ST28", "B00005ATSN", "B00005MDZZ", "B0001ZZNNI", "B00005J53A", "B004IXQISS", "B000B5MV60", "B00G2F1AG0", "B004I8IAR0", "B0001YYNL2", "B00012BSJ4", "B0001615P2", "B00008YMZV", "B00005MI42", "B000F8GWH2", "B000R08L7M", "B00005NCCA", "B0000296ZM", "B000058BCU", "B000BI3SIC", "B000A3I9XW", "B00008GYES", "B002DL4DNO", "B00007CWJ0", "B000ANYFW6", "B0002GTXDM", "B00027NWRY", "B00005JYBA", "B0061CZPCO", "B00005BOS7", "B0038MTE7C"], "buy_after_viewing": ["B00005B8G3", "B000VBB69M", "B000MIL3WY", "B00005B8G2"]}, "salesRank": {"Video Games": 1168}, "categories": [["Video Games", "More Systems", "Game Boy Advance", "Hardware", "Consoles"]]}