{"asin": "B00029QR8I", "description": "Originally released in 1987,Pirates!received unprecedented critical acclaim for crossing multiple game genres to offer unique, unrivaled gameplay options.Pirates!set the industry standard for innovative game design with its unique blend of open-ended role-playing, real-time adventures and thrilling action sequences.Now it's time for Sid Meier and Firaxis Games to bring this pioneering action-adventure game into the 21st century. An entirely new game engine will deliver updated gameplay, stunning new features, spectacular 3D graphics and enhanced sound effects, so players can fully experience the intrigue, adventure and danger of life as a pirate on the Spanish Main.InPirates!you take the leading role of a Pirate Captain in the 17th century Caribbean amassing fortune and fame in an attempt to seize your rightful place as one of the most revered (and feared!) pirates in history. Test your skills as a sea captain exploring the high seas and exotic ports in a richly detailed 3D world. Overtake the enemy and seize valuable booty. Exchange plank-shattering broadsides in fierce naval battles, and engage in duels with worthy opposing captains.The newPirates!carries on with the great gameplay and design simplicity tradition of the award-winning original, while adding more challenging and exciting battle options. It offers a deeper and more varied role-playing experience that includes multiple paths to a wealthy retirement. This and many other features and additions make this gaming classic one of the most highly anticipated releases of this century!Game Features:Experience an all-new story built upon the most fun and compelling features of the originalPirates!gameLive out multiple quests through a non-linear, open life timeline where every decision poses distinct challenges and possibilitiesWitness the consequences of your actions in current events throughout thePirates!worldBattle, overtake and command 27 different ship types, enhanced with assorted ammo, cannon and other upgradesTake on various foes including merchant and military captains, ferocious pirates, evil gentry and even rival suitors -- each with different skills and abilitiesConfront enemies on board ships, in seedy taverns, on the ramparts and even at the Governor's mansion Wield weapons -- or anything within your reach -- as you fence against foesEngage in fierce naval battles fighting single enemies or multiple shipsSneak into towns, escape out of prisons, navigate around adversaries and surprise unsuspecting vessels Dispatch landing parties of buccaneers in strategic battles to take over entire citiesIncrease your riches and impress the governor's daughter with your charm, fame, heroism -- even your dancing abilitiesCollect items (swords, spyglasses, armor, hats, coats, etc.) that improve skills or provide other new benefits and view them in a new inventory system Enhance your gameplay experience with downloadable content including flags, sail emblems, character skins and moreAwards:Since its initial release,Pirates!has sold more than a million units worldwide, and received numerous awards:Action Game of the YearComputer Gaming World MagazineHistorical Game of the YearCompute MagazineBest Fantasy/Role Playing GameAcademy of Adventure Gaming Arts and DesignHaving been inducted into the Hall of Fame by both Computer Gaming World and GameSpy, and voted one of the top 20 all-time games by Computer Gaming World Magazine,Pirates!is recognized as one of the greatest games ever created.", "price": 22.5, "imUrl": "http://ecx.images-amazon.com/images/I/51NNEGTTSRL._SY300_.jpg", "related": {"also_viewed": ["B000AOIES6", "B003NEVVYO", "B000FU1F0O", "B0006OJGT6", "B0002YFU5E", "B000LPJR4O", "B0026EGO3A", "B001GQ2PDM", "B00BZOBE78", "B005UKT826", "B00002S8AV", "B004JO17C8", "B000EZ1OEM", "B00004UE0E", "B00066VQS8", "B00HWMP0TU", "B005M0KSIM", "B0002TV2O2", "B00JUI8HJ4"], "bought_together": ["B000FU1F0O", "B000AOIES6"], "buy_after_viewing": ["B000AOIES6", "B003NEVVYO", "B000FU1F0O", "B0026EGO3A"]}, "salesRank": {"Video Games": 20654}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "PC", "Games"]]}