{"asin": "B001UE6MA2", "categories": [["Electronics", "Television & Video", "Televisions", "LCD TVs"]], "description": "From the Manufacturer(April 23, 2009)The 26-inch Viera TC-L26X1 LCD 720p HDTV is ideal for lovers of music and videos. The iPod Entertainment Kit lets you control and play back your iPod (not included) music and videos. Also the Viera Image Viewer provides a better way to share your digital photos, just put your SD memory card into the memory card slot, and your digital photos are instantly displayed. With Viera Link, you can control your compatible Panasonic DVD recorder, Blu-ray Disc player, home theater sound system, and HD camcorder, all with a single remote and helpful on-screen menus.An ideal LCD flatscreen for lovers of music and videos.Click to enlarge.The VIERA DifferencePanasonic VIERA TVs combine high picture quality, smart networking, environmental friendliness, and stylish design. The X1 LCD series features:720p ResolutionContrast Ratio: 12,000:1iPod Entertainment KitIntelligent Scene ControllerVIERA Image ViewerVIERA LinkPC InputGame Mode3 HDMI Inputs (32\" and 37\" only)Wide Viewing AngleThe wide 178 degree viewing angle ensures clear images even when viewed from an angle. The backlight's wide transmission aperture enhances the contrast between light and dark, and improves motion-image response.Fine Black PanelPanel reflections have been reduced to half those of conventional panels, to sharpen images and reduce glare. This also helps to unify the panel design with that of the VIERA lineup.Enjoy your favorite songs, movies, and photos by connecting your iPod&uml; and VIERA directly.The wide 178 degree viewing angle ensures clear images even when viewed from an angle.With the new VIERA Tools user interface, simply press a button on the remote control and icons such as the photos or movies from the menu screen.Control and Play Back Music and Videos from Your iPodWith the included iPod Entertainment Kit, a universal iPod dock provides a convenient way to enjoy music, videos and photos on your VIERA&uml; HDTV. Intuitive on-screen menus make it a breeze to control the action with the TVs remote.VIERA Image ViewerVIERA Image Viewer makes it easy to watch full-HD images by using the SD card slot. It lets you enjoy high-resolution, full-HD photos and videos with superb image quality and vivid colors on VIERA's large screen. Simply insert an SD card into the SD card slot to show your photos and full-HD videos on the large screen!Shoot still and motion images with a digital camera or HD camcorder.Insert the SD card into VIERA's card slotView photos and motion images in full-HD quality on VIERA's large screen.VIERA ToolsWith the new VIERA Tools user interface, simply press a button on the remote control and icons such as the photos or movies from the menu screen. Now you can just select the one you want. This kind of easy operation means you have more fun and less hassle.Network Your AV Devices, Quickly and EasilyWith VIERA Link, you can control your compatible Panasonic DVD recorder, Blu-ray Disc player, home theater sound system and HD camcorder, all with a single remote and helpful on-screen menus. VIERA Link is a function that lets you easily operate various AV devices that are interconnected with your VIERA TV, using only the VIERA remote control. You can choose the connection method--either an HDMI cable or a LAN cable--to match your devices and applications. You don't have to keep switching remotes to operate each device, so there's no more hassle and operation is easier than ever. Networking your devices with VIERA Link adds both convenience and fun to AV entertainment.The Next Level of Video GamingIn Game mode, quicker image response increases the enjoyment of video games when a game console is connected to the TV. What's more VIERA produces the dark images in video games more clearly. This mode works anti-image retention (wobbling) too.Standby Power SaveWhen the VIERA power is turned off, the standby power of connected devices is minimized.Auto Power StandbyPower loss is minimised by using VIERA Link control for interconnected devices.Eco ModePanasonic has further enhanced its energy-saving efficiency with fine power control and an automatic off function.What's in the BoxPanasonic Viera X1 Series TC-L26X1 26-Inch 720p LCD HDTV, Universal dock for iPod, Remote control, Remote batteries, AC cord, Pedestal with installation hardware, Cleaning cloth, Operating instructions, Quick setup guide, Product Registration Card, Customer Care Plan Card END", "title": "Panasonic VIERA X1 Series TC-L26X1 26-Inch 720p LCD HDTV", "price": 188.0, "salesRank": {"Electronics": 42156}, "imUrl": "http://ecx.images-amazon.com/images/I/51-qmsc5EFL._SX300_.jpg", "related": {"also_viewed": ["B00IZBQ460", "B00I7JZNIU", "B00794ZVT0", "B00C28WXI0", "B00F9YYHWY", "B00BN3VZDE", "B003CI7RMQ", "B009IBXEE6", "B00HZI0Y0Q", "B00BF9MZ44", "B00EGLQWP6", "B00BCGRX9M", "B00IL7C9K8", "B00AWKBZOI", "B00BB0ZTMM", "B00H8JNI2S", "B007PXV310", "B00BKWSSO2", "B00BCGRXD8", "B00BB0ZUI0", "B00I0S70C0", "B0096YOQRY", "B00BB0ZTLI", "B00GIEWXFW", "B0071O4ETQ", "B00IL7C8O0", "B00H8JNHOW", "B00IN2WDFW", "B0078LSTWU", "B00DTURF7E", "B009LG6AW6", "B0096YOQQA", "B00I0S72JQ", "B004HG056M", "B0094NPDEM", "B00BF897EG", "B00D9BER9C", "B0074FGNJ6", "B00J58HU6K", "B00IGSAPV2"], "buy_after_viewing": ["B00HZI0Y0Q", "B005EHRYDK", "B000WYVBR0", "B00BF9MZ44"]}}