{"asin": "B00000ID61", "description": "It is a shame that Nintendo can't clone Miyamoto, the genius behind the Mario and Zelda games. He is easily Nintendo's greatest asset, and one of the most brilliant storytellers ever to work in the interactive medium. His latest effort, Star Fox 64, is a game designed in his tradition of greatness, and it's perhaps the best N64 game seen since Super Mario 64 - which is still considered by many as the best video game of all time.Star Fox 64, the sequel to the Super Nintendo title Star Fox, is a shooter in the truest sense. As happens in Star Fox's predecessors, you fly along and blast away your enemies while powering up your weapons. But Star Fox 64 adds quality gameplay twists that rival the game's incredible 3D graphics. These features include multiple gameplay paths (which take you through various levels depending on how well you play, including a Tomorrow Land-like city, a meteor-filled corner of space, and a post-apocalyptic battleground), a submarine and a tank level, a four-player battle mode, and the smoothest 3D flight control yet seen on a console system. Not only is the animation incredibly smooth, but every polygonal building and ship is finely detailed. The enemies are also quite varied - in fact, the final boss, Andross, even qualifies as menacingly scary (there's something terrifying about a huge ape that literally chews you up and spits you out). This game is a pleasure to look at and does the Star Wars-like storyline justice with a truly cinematic quality.At any given time you have a variety of enemies to blast, and the game alternates between on-rails levels (where you are constantly moving forward on a track with 3D movement), and slightly more open levels where you can explore a limited area. While the game may be difficult to play at first, it includes a training mode to master the somersaults, U-turns, and power-ups. Once you get the hang of it, the game becomes a fast-paced thrill ride through multiple levels of interplanetary warfare. And unlike any game before it, Star Fox 64 uses force feedback, courtesy of Nintendo's latest peripheral, the Rumble Pak. Simply, you actually feel each shot you take and obstacle you bump into.The plot of Star Fox 64 pits Fox McCloud against the evil Andross and his crew of monkey people set to destroy the galaxy. As Fox McCloud you must lead the battle against his minions. Your wingmen Slippy (a frog), Falco (a falcon), and Peppy (a rabbit) accompany you on missions and offer advice on each level - they can also help you out in a jam, but you should expect to come to their rescue more often than not. The interaction between the four main characters makes for some of the most entertaining voice-overs yet heard in a video game and proves that the N64 doesn't need a CD drive to offer a vast array of speech. In fact, a third of the game's cartridge is used for the memorable chatter, which includes such lines as \"Let's show those monkey people who's boss,\" and \"Oh noooo!\" which is shrieked by Slippy, who's gender is, sadly, never revealed.Star Fox 64 is the kind of game you will spend many sleepless nights with - even after you finish. The replay value will bring you back again and again. N64 owners who have been waiting to embark on their next great gaming adventure should run out immediately and buy Star Fox 64 - the graphics, sound, and gameplay all combine to create an instant N64 classic. --Glenn Rubenstein--Copyright &copy;1999 GameSpot Inc. All rights reserved. Reproduction  in whole or in part in any form or medium without express written permission of GameSpot is prohibited. GameSpot and the GameSpot logo are trademarks of GameSpot Inc.--GameSpot Review", "price": 3.99, "imUrl": "http://ecx.images-amazon.com/images/I/5195l1u4rrL._SX300_.jpg", "related": {"also_bought": ["B00000F1GM", "B00000DMAX", "B00000J2W7", "B00002STH0", "B00002STEZ", "B00002DHEV", "B00004S9AA", "B00000DMAQ", "B00003OTI3", "B00005M8TL", "B005GTNBGK", "B00002STI2", "B0015OG4G4", "B005DI7N7W", "B00000INR2", "B000PJHAD6", "B000Y0CHX4", "B00004U1QY", "B000021Y2Z", "B005GTND0E", "B00002STFH", "B00000IFRI", "B00004U1R1", "B002TK1PX0", "B00000J2OO", "B00004S9A7", "B00000ID60", "B000031KJM", "B00000DMAO", "B00002STH5", "B003UI5GLC", "B00004R9IB", "B005GTNC8W", "B007SJMEHI", "B000F9JFXE", "B00004U1R3", "B000046Q7Q", "B000YOCGUO", "B00000I1BE", "B003ZU0PHU", "B0009Y808Q", "B00000K1AF", "B00000JHPD", "B00001QES1", "B000QHOHHE", "B00004SWLT", "B000058BCU", "B00005AW1W", "B000JVM256", "B0046CZX78", "B00000K2G9", "B00001WRJO", "B000YT1VMS", "B00856304Y", "B00004WLMA", "B00004R9I4", "B000046S41", "B009MRZAUC", "B00005AQRH", "B00002SVFZ", "B00003E4EB", "B00002SVG2", "B00002STHX", "B00002STXN", "B002J44BXW", "B00002STHH", "B000038A6U"], "buy_after_viewing": ["B002TK1PX0", "B00000F1GM", "B00002DHEV", "B005GTNBGK"]}, "salesRank": {"Video Games": 1984}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "More Systems", "Nintendo 64", "Games"]]}