{"asin": "B000IJV4BC", "description": "High definition playback delivers 720p/1080i resolution at a transfer rate higher than DVD or even HDTV, resulting in a more detailed, realistic picture.  Advanced audio, including Dolby&#xAE; TrueHD, Dolby&#xAE; Digital Plus and DTS&#xAE; HD (core only), along with legacy formats including Dolby&#xAE; Digital and DTS&#xAE; bring an increased sonic realism to movie soundtracks.  Backwards compatibility means you can enjoy your existing library of DVDs and CDs, and through the process of upconversion using HDMI, your movies are scaled to match the resolution of your HD display.  An interface suite includes an abundance of audio/video connections as well as an ethernet connection for firmware updates and future internet delivered features.Key Video FeaturesHD DVD playback (including Combo. Format Discs), DVD and DVD-R/-RW:High Definition video requires a tremendous amount of space on a disc, so a new Blue laser (versus a Red Laser for DVD) is utilized for HD DVD. The blue laser, with it&#x92;s shorter wave length, allows for information to be stored more densely on the disc, improving storage capacity by over 3 times that of a red laser technology. Additionally, more accurate and efficient video compression like MPEG-4 AVC and VC-1 (based on Microsoft&#x92;s Window Media) compress information to achieve file sizes that are less than half of the current standard DVD&#x92;s MPEG2.DVD upconversion via HDMI&#x99; Video Upconversion - 720p/1080i:HDMI&#x99; can support uncompressed digital video up to HDTV resolution. The HD-A2 player makes use of this conduit by up-converting the standard DVD picture resolution of 720p or 1080i. This makes a DVD player with an HDMI&#x99; connection the perfect match for today's digital televisions. And because this conversion is performed in the player, the signal remains free frome excessive digital to analog artifacts.Video Output: 1080i/720p/480p/480iKey Audio FeaturesBuilt-in Dolby&#xAE; Digital, Dolby&#xAE; TrueHD, Dolby&#xAE; Digital Plus, DTS&#xAE;, and DTS&#xAE; HD (core only): The HD-A2 has built-in processors to handle the multi-channel decoders for Dolby Digital, Dolby Digital Plus, Dolby TrueHD , DTS and DTSHD. It employs the use of four DSPs to decode the multi-channel streams of the wide array of audio formats. These 32-bit floating-point DSPs are world renown for their high accuracy and are employed in many high quality audio solutions in the home theater market.Advanced high-performance 32-bit SHARC&#xAE; Digital Signal Processing:Realize the benefits of new generation high-definition audio to complement high-definition video with 32-bit floating point SHARC DSP. Designed to perform audio conversion while executing extensive on-board multi-channel  signal management, SHARC DSP in HD DVD delivers the stunning audio to  complete your total high-definition experience.CD Audio Playback (CD, CD-R/-RW)Conveniece Features:Slim design cabinetryNew improved remote design with glow keys and TV operationEthernet connectionHDMI 1.2a interface, component video, S-Video, composite videoConnections:ColorStream Pro&#xAE; Component Video Output:ColorStream Pro&#xAE; progressive scan provides a non-interlaced component video DVD/TV connection that allows DVD-Video to reach its maximum picture quality potential. Every DVD-Video disc is mastered in MPEG-2 progressive scan (480P). By preserving DVD's progressive scan image, the ColorStream PRO connection provides a new dimension in total picture quality, delivering a more film-like, three-dimensional image. The progressive scan image is flicker-free, with virtually no visible NTSC line structure or motion artifacts, and offers better resolution than standard interlaced images. These outputs allow the video signal to be sent from the DVD player to a component video equipped interlaced or progressive scan TV. When this connection is utilized with today's HD-compatible sets, typical NTSC artifacts-like video noise, dot crawl, and flicker-are virtually eliminated, resulting in a low-noise, highly detailed picture with unequaled color purity.Composite Outputs -- 1S-Video Outputs -- 1Component Outputs -- 1HDMI Output Version 1.2 -- 1", "title": "Toshiba HD-A2 HD DVD Player", "price": 369.99, "imUrl": "http://ecx.images-amazon.com/images/I/31Mpv9lHtZL._SX300_.jpg", "categories": [["Electronics", "Television & Video", "DVD Players & Recorders"]]}