{"asin": "B0001OHH0Q", "related": {"also_bought": ["B000P708NM", "B00176T9OY", "B0002UB2K0", "B002VMKU1O", "B003FGWF04", "B004YWB2DE", "B00009V2YV", "B00009V2YP", "B00GG6PA9S", "B003DMIGQC", "B008NP5YHS", "B008X30AYW", "B007Z7KROK", "B008MPKAPK", "B000P41PCS", "B0002AS9OM", "B004OVE61U", "B0083J46Q4"], "bought_together": ["B00176T9OY", "B000P708NM"], "buy_after_viewing": ["B00176T9OY", "B00009V2YV", "B004OVE61U", "B000P708NM"]}, "title": "Midland WR100 Weather Radio (Discontinued by Manufacturer)", "price": 22.5, "salesRank": {"Electronics": 11712}, "imUrl": "http://ecx.images-amazon.com/images/I/41khEQe8cKL._SY300_.jpg", "brand": "Midland", "categories": [["Electronics", "Portable Audio & Video", "Radios", "Weather Radios"]], "description": "Stay up to date on all the latest weather, hazard, and civil emergency information with the Midland WR-100B monitor. Capable of receiving seven National Oceanic & Atmospheric Association (NOAA) channels--each of which receives emergency advisories on tornadoes, floods, severe thunderstorms, civil danger warnings, and more--the WR-100B is a must for people who live in high-risk weather areas, such as the Southeast or Midwest. Plus, the seven NOAA channels offer coverage for roughly 93 percent of the U.S., so most people are well covered regardless of where they live.Another valuable function is the monitor's Specific Area Message Encoding (SAME) reception. SAME allows users to program the radio to sound an alert only when weather and other emergencies threaten a selected county or counties. The technology eliminates all alerts from other areas, so users won't have to perk up their ears each time the alert sounds only to find the emergency is actually 100 miles up the highway. In addition, the WR-100B's memory system accepts up to 25 counties, so you can monitor a broad swatch of counties at once or restrict it to one.Should an alert occur, users have a choice of three warning systems: a 90 dB siren, a voice alert, or a flashing red LED light. The siren is the best option for people with larger homes or who aren't always near the monitor, while the latter two options work well for smaller homes. Additional features include a clock with an alarm and a snooze button, an emergency power backup that keeps your radio working during power outages or outdoor use, and external antenna and alert jacks.The WR-100B, which works with three AA batteries (not included), measures 5.12 by 2 by 6.25 inches (W x H x D) and is backed by a one-year warranty.What's in the BoxWR-100B monitor, power adapter, user's manual."}