{"asin": "B005OTPVMY", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Cables & Interconnects", "USB Cables"]], "description": "Transfer files between nearby Windows PCs with greater speed, plug-and-play ease, and point-to-point simplicity and security. The Plugable USB 2.0 Windows Transfer Cable works great for transferring files and folders when upgrading from an older Windows 8.1, 8, 7, Vista, or XP computer to a newer one, or for transferring data between two folders on a ongoing basis. (Note: Programs will not be transferred. They must be re-installed from the original disk or downloaded file.).SoftwareThe cable also includes a full license to Bravura's Easy Computer Sync software ($19.95 value). Created by one of the original developers of Windows Easy Transfer at Microsoft, the Bravura software manages the connection and transfer process for you and includes all needed drivers, making it easy to transfer your important documents and media files.CompatibilityAll needed drivers for Windows 8.1, 8, 7, Vista, and XP are included in the Bravura software. Supported by Linux kernel 3.0 and later as a high-speed virtual network interface, no special file transfer support. No support for Mac. Compatible with active and passive USB 2.0 extenders like the Plugable USB 2.0 10 meter extension cable (not included) for greater distances between PCs. Not compatible with ARM-based Windows (MS Surface RT).In the box6-foot (2-meter) USB 2.0 Easy Transfer Cable and quick installation guide. No CD - all software and drivers are built into Windows and Linux or are available via download.", "title": "Plugable Windows Transfer Cable for Windows 8.1, 8, 7, Vista, XP. Includes Bravura Easy Computer Sync Software", "price": 19.95, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31foBW1d3sL._SX300_.jpg", "related": {"also_bought": ["1118821076", "B008MR37XK", "193622075X", "1939791073", "B004GIGNVC", "B0093HCIQ0", "1118820878", "1939791227", "1449371620", "1936220016", "111882623X", "1936220687", "B003VTZ07U", "0470523980", "B002PAR0AQ", "1936220768", "B00HM0IXLO", "1936220911", "1118821211", "0596806396", "B00HSEW23O", "1936220814", "B00CPGYNV4", "B00DBV28TG", "B00HC3YXRO", "B00CUOAUK4", "B00JX1ZS5O", "B0087ECCGG", "B0049MPQA4", "B007ABANFY", "1118821491", "B00CUOAV2Q", "B007JR532M", "B00BWF5U0M", "B00EDSI7QO", "B003VANO7C", "B009SPUE72", "B005C31HC0", "B0051ZJLX6", "B009WA2NKY", "B005EJH6Z4", "B004TXPWV6", "B000J01I1G", "B00IKMJ9B6", "B00DRK73IM", "B00C2AMK2M", "B00H09BB16", "B0093H4WT6", "B00FY39770", "B007TK567Q", "B00BZC31WQ", "B00EAS87J4", "B0099TX7O4"], "bought_together": ["1118821076", "193622075X"], "buy_after_viewing": ["B0093HCIQ0", "B004GIGNVC", "B008MR37XK", "B002PAR0AQ"]}}