{"asin": "B0001F22PA", "description": "For use at home or in the car, the Belkin TuneCast II FM Transmitter allows you to play the music on your iPod, PC, MP3 player, or other portable device through your car or home stereo. Set the Belkin TuneCast II and your stereo to the same available radio frequency, and you will hear your music broadcast through the stereo.TuneCast II FM Transmitter for MP3 Players (Black)At a Glance:Transmits music from digital player through stereoMemorizes up to four preset radio frequenciesAutomatic On/Off preserves batteriesLow-battery LED indicatorCar-adapter power cord included for battery-free operationBroadcast your music through your home stereo, or in the car using the included power adapter.View larger.Play Your Music AnywhereBy placing the Belkin TuneCast II FM Transmitter within 10 to 30 feet of your FM radio and plugging it into the headphone jack of your iPod, computer, MP3 player, PDA, or CD or cassette player, you can quickly and easily broadcast your own music through your car or home stereo. The TuneCast II works with any digital audio player with a 3.5-mm mini-jackHow It WorksFind a frequency on the FM radio that has a clear or strong broadcast signal and program the TuneCast II to the same frequency. With the volume on your music player at a medium level, you can use the volume controls on your stereo to create the ideal listening experience.Preset Frequencies Add ConvenienceOnce you find the frequencies that work well in your area, you can store them as one of four preset memories. Once programmed, simply toggle through the preset frequencies to find the one that is currently transmitting the clearest signal.Power Options Preserve BatteriesAn automatic On/Off function preserves battery power by turning on when an audio signal is detected, and turning off after 60 seconds of no signal. An LED indicator alerts you when batteries are running low.The included power cord gives you the option to save battery life by powering the TuneCast II with the cigarette lighter in your car (Please note that it does not charge your portable player's battery).About Belkin International, Inc.Belkin offers a diverse product mix that provides people with seamless electronics integration in their homes, cars, and on the go. Founded in California in 1983, Belkin is a privately held company and the recognized leader in connectivity solutions, in addition to accessories for MP3 devices, computers, and more. We provide extensive solutions for networking, home theater--with our PureAV line of cables, power, and digital wireless accessories--and many more categories. Belkin's phenomenal growth has led to our expanding global presence. In addition to corporate headquarters in Los Angeles, we now have offices throughout Europe--in the United Kingdom, the Netherlands, and Germany, among others--and in the Asia Pacific region, including Australia, Shanghai, and our regional headquarters in Hong Kong.The Belkin TuneCast II FM Transmitter is backed by a one-year limited warranty.What's in the BoxBelkin TuneCast II FM Transmitter, mobile power cord, and two \"AAA\" batteries.Belkin iPod Accessories - CarF8Z136F8Z184F8Z343F8V3080ChargesYesYesYesNoCompatibilityiPod Nano 2GiPhone and iPodiPhone and iPodiPod and all MP3 players with a 3.5mm portLine OutNoNoNoNoClearScanNoNoYesNo", "title": "Belkin TuneCast II FM Transmitter for MP3 Players (Black)", "price": 20.13, "imUrl": "http://ecx.images-amazon.com/images/I/41TD8XEBZ5L._SY300_.jpg", "related": {"also_viewed": ["B00DEWBM1W", "B00448A5P4", "B003ZZ26OK", "B0035AN31A", "B004NEUK86", "B0001FV2YM", "B001NZI5E4", "B0016BVDIK", "B0000AAAPF", "B001AIM5ZE", "B0098Y90PK", "B00008SB1D", "B005FNYADA", "B005YW0Y3C", "B003EHT6YC", "B000R5NJCE", "B00ENY0ZLS", "B00JP5QAWI", "B00J4GESGI", "B000E43GOO", "B000OTF6G0", "B000KITCHE", "B00HIATW04", "B003SX0O2A", "B007NEBBA4", "B000WVVX6W", "B00GLPG03Y", "B001ILDK6G", "B00GJEO8HC", "B00EUVB2C0", "B001DQT40M", "B005TOQBFK", "B000WW1YVU", "B00479SVBU", "B002S9E3LI", "B00GJFP0IM", "B001LYOGRM", "B0077QHF1C", "B0018P7WZ2", "B00CGVG8B6", "B00IHRDGFY", "B0084RORHS", "B0087NBBD2", "B00CU7UFO2", "B00GJEO8CW", "B003TFDUKK", "B001DQL66M", "B008N7CCJY", "B003PPGOC0", "B00CRBUDGQ", "B002E9HI0A", "B005ZHI2PS", "B00IFUOB6G", "B003FO4UHW", "B001IWOBLI", "B00JA4ES0K", "B000BWACX2"], "buy_after_viewing": ["B0098Y90PK", "B00DEWBM1W", "B005YW0Y3C", "B00448A5P4"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "FM Transmitters"]]}