{"asin": "B004544YH2", "description": "FROM THE MANUFACTURERThe small but powerful AU-4912 Wireless N+ Mini USB adapter complies with the latest 802.11n standards to enhance the quality of your wireless transfer rate up to 150Mbps. Inserting this USB adapter into your computer allows you to access the Internet anywhere there is an Wi-Fi signal and to share the wireless Internet connection with your Wi-Fi enabled devices.KEY FEATURESSuperior Design and Wireless SpeedCreated with Wireless-N (802.11n) for wireless speeds up to 150 Mbps. Permits users to have the farthest range with the widest coverage (up to 6 times the speed and 3 times the coverage of 802.11b). Works with Windows, MAC and LinuxSupports Multiple Operation SystemsSupport multiple operation systems (Windows 7, Windows Vista, Windows XP, Linux, and Mac OS)Advanced SecurityWith the WPS (Wi-Fi Protect Setup) button, you can easily complete an encrypted connection in one touch to keep unwanted users out of your wireless networkClear Channel Assessment (CCA) TechnologyAllows you to detect wireless signals and avoid interference between different channelsWireless Multi-Media (WMM)Prioritize the streaming of video and audio files to ensure a smooth quality with minimal lagEasy to InstallComes with an installation disk and easy graphical user interface (GUI) to assist you to set up your wireless network quickly and easily* This is a new version of the AU-4912 (WU605n)", "title": "Sapido AU-4912 (WU605n) Mini USB 2.0 Network Adapter with Wireless-N (802.11)150 Mbps One-Touch WPS &amp; WMM (Wi-Fi Multimedia) Technology", "price": 8.95, "imUrl": "http://ecx.images-amazon.com/images/I/315f1XwkQ-L._SY300_.jpg", "related": {"also_viewed": ["B003MTTJOY", "B00762YNMG", "B00DTZYHX4", "B00DJUU0KS", "B003Q9AZHU", "B00BPYP4Y2", "B00DTPYRTI"], "buy_after_viewing": ["B003MTTJOY", "B00762YNMG", "B00DTZYHX4", "B003X26PMO"]}, "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Network Adapters", "USB Network Adapters"]]}