{"asin": "B0032JRRXY", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "With its streamlined silhouette and smoothly curved edges, the Canon PowerShot A495 has the compact sophistication and relaxed simplicity that make it a natural for beginners and everyone else who craves style and convenience. The 10.0-megapixel resolution and 3.3x optical zoom make it easy to capture the action in dazzling color and brilliant detail. The DIGIC III Image Processor keeps it all looking sharp. To help you make the most of your creativity, new Scene Modes make your photographs standout. A bright, bold 2.5-inch LCD makes shooting and playback a genuine pleasure. Plus, choose from any of three dazzling colors.10.0-megapixel resolution delivers amazing detailCanon PowerShot A495 HighlightsEasy to use, powerful A-Series camera has 10.0 megapixels and 3.3x optical zoomWith the PowerShot A495, dramatic, personal pictures have never been easier to shoot and share. This 10.0-megapixel camera lets you create impressive large photos of family and friends you'll be proud to display. The high-resolution images taken by the PowerShot A495 can be enlarged up to 13 x 19 inches.The PowerShot A495 has a 3.3x optical zoom lens (35mm film equivalent 37-122mm) that let you capture up-close and memorable images.Smart AUTO will do the work for you by intelligently selecting the proper settingsJust set the Canon PowerShot A495 to Smart AUTO and you're ready for maximum enjoyment from your picture-taking every time. It's a relaxing and satisfying way to shoot because you can completely concentrate on your subject knowing that the camera has the technical details covered. Advanced Canon technology intelligently analyzes your situation and shooting conditions. Then it automatically selects an appropriate setting from 18 specially defined settings. So whether you're photographing flowers, a captivating sunset, or your friends at the park, you can be confident that you're getting dramatic, memorable images.New Scene Modes deliver more creative freedomThe Canon PowerShot A495 gives you even more creative freedom by including new modes made to get the kind of images people talk about. Super Vivid captures the colors you see with your mind's eye, saturating the scene with intense colors. Turn drab scenes into exciting compositions, when dull pinks blaze into brilliant fuchsia and off-yellows suddenly burn bright and hot. Even dark colors become richer with Super Vivid. Sunsets and floral scenes turn into bursts of color, and get your photo noticed.Poster Effect combines several similar shades into one color, turning subtle gradations of color into eye-catching, scene-popping contrasts across your image for a unique artistic look.Large, clear 2.5-inch LCDThe PowerShot A495's 2.5-inch LCD screen gives you the big picture, whether you're shooting, reviewing or showing off your images. This high-resolution screen offers a crisp, clear and bright picture. It also features Night Display for easy viewing in low light.", "title": "Canon PowerShot A495 10.0 MP Digital Camera with 3.3x Optical Zoom and 2.5-Inch LCD (Blue)", "price": 169.99, "salesRank": {"Camera &amp; Photo": 3655}, "imUrl": "http://ecx.images-amazon.com/images/I/51kkUofBXTL._SX300_.jpg", "related": {"also_viewed": ["B004HW73QQ", "B0075SUIEI", "B004HW73QG", "B004HW73R0", "B0032JRRXO", "B0075SUGQI", "B0075SUH5S", "B0075SUII4", "B00B5HE3IW", "B0075SUG3Q", "B0075SUHKI", "B00C7NX884", "B00AWYMXZY", "B0075SUI2A", "B0075SUHA8", "B004HW73OS", "B003KJM05Q", "B004HW73RA", "B001O1GEU4", "B00B5HE1SY", "B004HW73PC", "B0075SUHQC", "B00B5HE2UG", "B0090SLJ1C", "B0075SUHGC", "B00C7NX3MK", "B001SER492", "B003VTZE26", "B0075SUHWG", "B001SER47Y", "B0073HSIY8", "B00B5HE3AK", "B00B5HE2MO", "B003ZSHNG8", "B00B5HE32I", "B00BTKNZ70", "B004J3V7RO", "B0075T7NW2", "B00B5HE3NW", "B004HW73O8", "B00EZAYFY8", "B0054SLN3Q", "B001SER4BK", "B00E1U9434", "B0032JRRWK", "B001EQ4C4E", "B0075SUG8Q", "B00J407OLU", "B00I58LWBK", "B003VTZE1M", "B0075SUITS", "B00EZAYELC"], "buy_after_viewing": ["B00AWYMXZY", "B00C7NX884", "B003VNKNEQ", "B003F7DWH8"]}}