{"asin": "B005KG3NSK", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Camera Bundles"]], "description": "Kodak EasyShare Camera / Z5010Product DescriptionBring your world closer for everyone to see.With its 21X optical zoom, 25 mm wide-angle lens, Smart Capture, and a fast click-to-capture speed, the Kodak EasyShare Camera / Z5010 makes it easy take stunning images in an instant from any distance. Then, press the Kodak Share button to tag to e-mail, Facebook and more. Just press to impress.When inspiration strikes, you won&rsquo;t miss a shot. The Kodak EasyShare Z5010 Camera&nbsp; delivers crisp, beautiful pictures that boost your reputation as the best photographer in the family, if not the neighborhood. Bring your world closer for everyone to see. And once you connect to your PC, your pre-tagged shots will automatically upload to e-mail and your favorite sharing sites with the Kodak Share button app. Just press to impress.Only KODAK Digital Cameras allow you to simultaneously share to multiple social networks and e-mail1.Kodak&rsquo;s Share button makes sharing your videos and pictures as simple with One Button Upload:&nbsp;&nbsp; &nbsp;&bull; Just press Share&nbsp;when in review mode&nbsp;&nbsp; &nbsp;&bull; Choose your favorite sharing destinations: Facebook, e-mail, and Kodak PULSE Digital Frames2, and other popular sharing sites&nbsp;&nbsp; &nbsp;&bull; Connect your camera to your computer&nbsp;or insert your memory card and your videos or pictures are automatically uploaded to the destination(s)1Kodak&rsquo;s exclusive Share Button:&nbsp;&nbsp; &nbsp;&bull; Automatically shares when you connect to a PC1&nbsp;&nbsp; &nbsp;&bull; Tags to the largest number of socialnetworks3&nbsp;&nbsp; &nbsp;&bull; Uploads friend tags to Facebook&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &bull; Automatically saves up to 20 people tags&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &bull; Instantly recognizes up to five faces in a single image&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &bull;Makes finding and tagging friends easyFeatures:&nbsp;Scene and color modes: Get great shots time after time with multiple scene modes, including ortrait, landscape, flower, night portrait, night landscape, fireworks, self-portrait, high-ISO, children, backlight, candlelight, sunset, sport, stage, panorama, and brightShoot video the moment it happens:HD video recording is right at your fingertips with our convenient dedicated video record button, which allows you to capture 720p HDProgram and manual mode:Allows you to adjust nearly every aspect of your image, such as: color, white balance, focus, exposure, ISO, shutter speed, aperture, and moreOn-camera video and picture editing:Allows you to trim and convert video into action stills up to 9 frames as well as crop, picture rotate, and apply Kodak Perfect Touch for ultimate sharingBeautiful pictures, more often&mdash;automaticallyPowerful 21X Wide-Angle Optical Zoom. The 21X SCHNEIDER-KREUZNACH VARIOGON Wide-Angle Optical Zoom Lens (25 mm equivalent) was designed to zoom in closer and faster to deliver crisp, steady shots for extrordinary creative performance.Kodak's Smart Capture feature:Beautiful pictures, more often-automaticallyBecome a better photographer with a smarter camera. Kodak&rsquo;s innovative Smart Capture feature automatically identifies the scene and adjusts camera settings for a great picture in just about any environment&nbsp;&nbsp; &nbsp;&bull; Intelligent scene detection&mdash;analyzes the scene to give you better pictures under various conditions&nbsp;&nbsp; &nbsp;&bull; Intelligent capture control&mdash;automatically adjusts camera exposure, focus, and ISO for clear pictures in any environment, even in low light&nbsp;&nbsp; &nbsp;&bull; Intelligent image processing&mdash;reduces noise and clears up dark shadows for vibrant, crisp details and true-to-life colorsWhat&rsquo;s In the Box:Everything you need to shoot and share&nbsp;&nbsp; &nbsp;&bull; Package Contents&nbsp;&nbsp;&nbsp; &bull; Kodak EasyShare Camera / Z1050&nbsp;&nbsp;&nbsp; &bull; (4) Kodak Ultra Alkaline Batteries AA&nbsp;&nbsp;&nbsp; &bull; Lens cap&nbsp;&nbsp;&nbsp; &bull; User GuideWarranty: One Year1All Kodak digital still and video cameras manufactured in 2011 or later.2KODAK PULSE Display  supports still pictures; video not supported.3Sharing sites vary by region", "title": "Kodak EasyShare Z5010 Digital Camera", "price": 17.12, "salesRank": {"Camera &amp; Photo": 5272}, "imUrl": "http://ecx.images-amazon.com/images/I/41xI-m4ERAL._SX300_.jpg", "related": {"also_bought": ["B004VNBOFC", "B0039BPG1A", "B003VNKNEQ", "B006XY2RGW", "B004FREPYG", "B006588KTE", "B0037TA7TU", "B0037TA7QS", "B006587TIW", "B0056ZMP0C", "B007RNK012", "B001P8180W", "B004JZ0MKK", "B004FLL53Q", "B004IS82T6", "B001T9N120", "B006K552CU", "B0079TAKM8", "B003VNKNEG", "B003960FFM"], "buy_after_viewing": ["B003VNKNF0", "B004FLL53Q", "B0039BPG1A", "B003VNKNEQ"]}}