{"asin": "B00A1ZRL88", "description": "CONTENTS - In the Friendly Swede packaging:1 x Purple 6FT USB Data Sync Cable1 x Aqua Blue 6FT USB Data Sync Cable1 x Yellow 6FT USB Data Sync Cable1 x Hot Pink 6FT USB Data Sync Cable1 x The Friendly Swede Cable TieCOMPATIBLE WITHiPad 1 2 3 unlike many other \"non-Apple brand\" cables. Also compatible with Apple iPhone 4 / 4S / 3G / 3GS. iPod Touch.**Note 1: Cables in the bundles have the 30 pin connector, not the lighting connector. The cables are not compatible with iPhone 5, iPod 5, iPad 4 or iPad Mini**Note 2: Charging your iPad from a computer will be usually not work well with ANY cables since a computer does not have the required 1.8 Amp power output.Charging an iPad at decent speed requires the USB cable to be connected to a dedicated >1.8 Amp wall or car charger.THE FRIENDLY SWEDE - Selected Accessories:If you for any reason are not happy with any product by The Friendly Swede, please do not hesitate to contact us and we will do our best to solve your problem asap!\nAt The Friendly Swede we take full ownership and responsibility for the quality of our products. The Friendly Swede - USPTO serial: 85494642, 85511082, 85521942 - is a registered trademark protected by US Trademark Law. \nAll products by The Friendly Swede are exclusively distributed by The Friendly SwedeApple, iPhone, iPad and iPod are registered trademarks and do in NO way endorse or have any affiliation with this package.", "title": "The Friendly Swede (TM) Bundle of 4 Colorful 6 Foot / 6 FT USB Data Sync Cable for Apple iPhone 4 4S 3GS iPod touch iPad 1 2 3 -  Retail Packaging - Full iPad Compatibility", "price": 10.99, "imUrl": "http://ecx.images-amazon.com/images/I/51eJcmN775L._SY300_.jpg", "related": {"also_bought": ["B0073FD4V2", "B0073FE1F0", "B0091XIUKY", "B007URUXU8", "B0052RM8T2", "B008GVM9K4", "B007ZST1I2", "B00A83I8G2", "B0080XGJPY", "B007JPSEP2", "B00937ZNDK", "B008GVL9YQ", "B007TV88F2", "B004SBBD8U", "B009RXU59C", "B00GC1G23K", "B009SYZ8OC", "B00622AG6S", "B00BVKH1L4", "B0088U6OZY", "B00B3OA7R8", "B004TIIBMS", "B003PU01M4", "B00BW3FUOK", "B00AGJMMVA", "B008R97TOQ", "B0097BEFWC", "B0015DYMVO"], "buy_after_viewing": ["B0073FE1F0", "B008GVM9K4", "B0091XIUKY"]}, "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Chargers & Adapters"]]}