{"asin": "B00030GS80", "description": "There's always been a certain magic to Zelda games. The classic formula should have gotten old by now, but it hasn't. Perhaps it's because we all identify on some level with this shy, unlikely hero. Maybe the games remind us of our own childhood. Or perhaps these titles are consistently of such high quality that we can't help but love them. Regardless, The Minish Cap succeeds in all these ways &#x96; simultaneously embracing its links to the past while offering numerous innovations that keep gameplay fresh, exciting, and a true joy to&#xA0;play.The greatest of these novel concepts is the ability to transform from normal size down to the diminutive form of the Minish, a race of tiny people living right under the noses of the humans. This opens up entirely new realms of gameplay, as puzzles and even combat must be accomplished in different ways. When miniaturized, the smallest puddle becomes a deep lake, and the most mundane creatures become monstrous foes.There's a new item called the Gust Jar that allows you to suck up obstacles and enemies before blowing them back out in a burst of air. It's one of the cooler new power-up items I've encountered in any of the Zelda games, and adds yet another level of complexity to how you play. Another new ability allows Link to double himself, creating a ghostly after-image that mirrors his moves for a brief time. As you might imagine, this results in some clever and unique brainteasers that are a nod to the recent Four Swords games. In all these ways, the game challenges you to think in multiple dimensions and carefully remember details on your journey. A large cast of characters fleshes out the land of Hyrule, and monsters both large and small await your blade. To further connect you to the world's people, you will now collect items called Kinstones &#x96; broken halves of coin-like objects that can be fused with the Kinstones that other characters in the world have collected. By doing so, you'll open up portals, treasure chests, and secret doors all over the map. It's an addictive side quest that serves as a worthy compliment to the main adventure.One of my few complaints is that while the puzzles in the game are uniformly challenging, some of the combat is easier than I might have liked, especially against the bosses, who were often one-trick ponies requiring minimal skill. Even so, the fights are satisfying in their simplicity, and you have access to all the familiar weapons and techniques, including the boomerang, spin attack, and bow. The old and new features combine to make a game that feels both true to the Zelda heritage while offering an entirely unique experience.But more than any of this, the game charms you with its stalwart hero. This silent little boy with ruffled, messy hair is faced with seemingly insurmountable odds. Through him, the game establishes a hero whose pure heart and will are carrying him forward. All the elements of The Minish Cap (even its presence on the GBA) contribute to the idea of a tiny force for good that strives to triumph against a huge evil. It's a classic adventure that more than lives up to the legacy of a classic series.Concept:The time-honored Zelda tale retold in yet another new formGraphics:Mixing the familiar images of previous Zelda games with humorous and detailed new character designs results in an impressive success for the GBASound:Some of the most memorable and recognizable tunes in gaming sound great even on those little GBA speakersPlayability:Responsive and flexible with a nearly perfect learning curve that moves from simple to challengingEntertainment:Like many of its predecessors &#x96; a true classicReplay:ModerateRated:9.5 out of 10Editor:Matt MillerIssue:February 20052nd Opinion:There's a bird sitting on my head, I'm no larger than a toenail clipping, and I've been stuck on the same puzzle for the last three hours. Long story short, I'm having the time of my life. For any of you who played the remarkable Super Nintendo title A Link to the Past, The Minish Cap will bring a tear to your eye. This is classic Zelda gameplay in all its glory. The journey is a tad easy for my liking (boss fights are a breeze), but I can't get enough of the creative puzzles and new gadgets. Shrinking in height to a two-pixel speck is not only hilarious, it's one of the most compelling concepts that the series has offered up in a long time. Minigames are also in great abundance, and you can collect over 130 different figurines that shed some light on the characters in the world (which also happens to be one of my favorite aspects of Wind Waker). From its stunning visuals to its gameplay finesse, The Minish Cap is another harrowing Hyrule adventure that you'll remember for a lifetime.Rated:9.5 out of 10Editor:Andrew ReinerSubscribe to Game Informer", "price": 170.98, "imUrl": "http://ecx.images-amazon.com/images/I/61cdIIQfyZL._SX300_.jpg", "related": {"also_bought": ["B00006LELB", "B00005ATSN", "B00005ATSM", "B00000IWYT", "B0002Y67QA", "B001TOQ8UW", "B00006M3R6", "B000FRV2UK", "B0001YYNL2", "B0000A09EP", "B00012BSJ4", "B0001ZZNME", "B00021HBAE", "B00005UK88", "B00005MDZY", "B000070IW6", "1930206569", "B00005OARM", "B00027NWRY", "B00005MDZZ", "B00005B8FZ", "B0001JXACA", "B00006FWTW", "B00002ST3U", "B00009WAUO", "B0002TB4CW", "B00005B8G1", "B000090W86", "B00009WAUK", "B00005MI42", "B000BI3SIC", "B000LY4IDK", "B000B5MV60", "1616550414", "B002CJ8Z04", "B00008URUF", "B00008KU9Z", "B004CHLNWQ", "B00005B8G3", "B000087PM3", "B0007D4MW2", "B000VBB69M", "B000087H7T", "B000AX224Y", "B000084318", "B002JEUDX4", "B0009Z3MOW", "B000HE9LEK", "B00002ST27", "B00068O278", "B00FPWTTOQ", "B00030GS8A", "B00007KQC3", "B002BSC54I", "B000238EJ4", "B00002SVEM", "B00002STXN", "B00005MO5G", "B0007ZSHOY", "B00004U1R1", "B000B5MV6A", "B0000E5U6M", "B0019R361I", "B000FW57CE", "B00009WAUM", "B0000BX8M6", "B00022EE44", "B000084314", "B003O6E800", "B0000A9Y11", "B00008DHNU", "B0009XSMNA", "B00008KUA3", "B0000A03CT", "B000JVM256", "B0006SSR24", "B0000C88HW", "B00GANWVJE", "B000GLHQJG", "B00005B8G2", "B00004SVYE", "0804161380", "B00000DMAQ", "B00000J9J9", "B0006GBCZU", "B0015DOOEY", "B00023JJUW", "B002S4SWGA"], "bought_together": ["B00006LELB"], "buy_after_viewing": ["B00006LELB", "B000FRV2UK", "B000VBB69M", "B001TOQ8UW"]}, "salesRank": {"Video Games": 2905}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "More Systems", "Game Boy Advance", "Games"]]}