{"asin": "B00B0CQCCC", "related": {"also_bought": ["B0083J8DS6", "B00BVRQEKG", "B00EVVGARQ", "B00AJHDZSI", "B004XC6GJ0", "B00FW6T36Y", "B00D69747O", "B001QUA6RA", "B000H38LLK", "B007IMPMW4", "B008ABOJKS", "B008VOUDK4", "B000JV9LUK", "B001EVGIYG", "B000J2EN4S", "B0041OOG9M", "B001W26TIW", "B001QUA6R0", "B00EU9V588", "B001VD9R4A", "B00HQ883QW", "B001E8TLKC", "B000ZOHLYE", "B001TH7GVE", "B0052SCU8U", "B00BGGDVOO", "B00G500AE0", "B003L1ZYYW", "B00DR0PDNE", "B00DIFIO8E", "B003MTTJOY"], "bought_together": ["B0083J8DS6"], "buy_after_viewing": ["B006QB1RPY", "B008ABOJKS", "B00F0DD0I6", "B00AJHDZSI"]}, "title": "TRENDnet Wireless AC1750 Dual Band Gigabit Router with USB Share Port, TEW-812DRU Version 2.1", "price": 115.0, "salesRank": {"Computers & Accessories": 161}, "imUrl": "http://ecx.images-amazon.com/images/I/41Tx%2BSiTabL._SY300_.jpg", "brand": "TRENDnet", "categories": [["Electronics", "Computers & Accessories", "Routers"]], "description": "Designed to produce the ultimate wireless experience in a busy connected home, TRENDnet&#x2019;s AC1750 Dual Band Wireless Router, model TEW-812DRU, creates two concurrent wireless networks&#x2014;a 1.3 Gigabit Wireless AC network and a 450 Mbps Wireless N network to connect common wireless devices. Use the high speed USB 3.0 port and Gigabit Ethernet ports to further expand your network. Ease of Use: Easy Setup - Get up and running in minutes with the intuitive guided setup. One Touch Connection -  Securely connect to the router at the touch of the Wi-Fi Protected Setup (WPS) button. USB 3.0 Share Port - Plug in a USB 3.0 flash or storage drive to share content at 5 Gbps USB 3.0 speeds. Security: Encrypted Wireless -  For your security the router arrives pre-encrypted with its own unique password. Guest Network - Create a secure, isolated network for guest internet access only. Parental Controls - Control access to specific websites. Next Generation Wireless AC - 802.11ac provides uninterrupted HD video streaming in a busy connected home. Simultaneous Dual Band - High speed 1300 Mbps Wireless AC band + 450 Mbps Wireless N. Gigabit Ports- Gigabit ports extend high performance wired connections. Wireless Coverage - Whole home wireless coverage for average size homes. Backward Compatible - Compatible with legacy wireless devices. Targeted Beamforming - Increased real-time performance by directing stronger wireless signals to your specific location.  Maximum wireless signal rates are referenced from IEEE 802.11 theoretical specifications. Actual data throughput and cover-age will vary depending on interference, network traffic, building materials and other conditions  Printer Control Center utility installation required for each computer in order to access the printer"}