{"asin": "B003ZX8AZQ", "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]], "description": "The thin n&uuml;vi 1300LM has a widescreen display, yet it's slim and light enough to take along on all your travels. This affordable GPS comes with free Lifetime Map updates, announces streets by name, offers pedestrian navigation options and calculates a more fuel-efficient route with ecoRoute.The thin n&uuml;vi 1300LM has a widescreen display, yet it's slim and light enough to take along on all your travels.Get map updates up to 4 times a year with no subscription, fees, or expiration dates.Includes a wealth of travel tools in addition to navigation.Stay on target no matter your mode of transportation.Affordable, Widescreen GPS Navigator With Lifetime Map UpdatesIncludes Free Lifetime Map UpdatesWith free Lifetime Map updates, you always have the most up-to-date maps, points of interest and navigation information available at your fingertips. Map updates are available for download up to 4 times a year with no subscription or update fees and no expiration dates.Navigate City TransitWith its enhanced pedestrian navigation capabilities, n&uuml;vi 1300LM is the perfect travel companion for getting around town. Download optional cityXplorer content to help you navigate city public transit. Know where to walk, where to catch the bus, subway, tram or other transportation and how long it will take to get there. n&uuml;vi 1300LM easily fits in your pocket or purse. cityXplorer maps are available for select cities throughout North America and Europe. And with prices as low as $9.99, you'll have money left over to spend in the big city.See MoreWith n&uuml;vi 1300LM's widescreen display, you'll always get the big picture. View map detail, driving directions, photos and more in bright, brilliant color. Its sunlight-readable, 4.3-inch (10.92 cm) display is easy to read--from any direction.Get Turn-by-Turn Directionsn&uuml;vi 1300LM's intuitive interface greets you with two simple questions: \"Where To?\" and \"View Map.\" Touch the color screen to easily look up addresses and services and get voice-prompted, turn-by-turn directions that speak street names to your destination. It comes preloaded with City Navigator NT street maps for the continental U.S., Hawaii and Puerto Rico or one European region or country (click versions tab to view all), millions of points of interest (POIs), and 2-D or 3-D maps. Its digital elevation maps show you shaded contours at higher zoom levels, giving you a big picture of the surrounding terrain. With the 1300LM's enhanced user interface, you can slide your finger to conveniently scroll between screens. You also can upload custom points of interest (POIs). And with HotFix satellite prediction, n&uuml;vi calculates your position faster to get you there quicker.Go Beyond NavigationNavigation is just the beginning. n&uuml;vi 1300LM saves you gas and money with ecoRoute--a green feature that calculates the most fuel-efficient route, tracks fuel usage and more. The 1300LM includes many travel tools, including JPEG picture viewer, world travel clock with time zones, currency converter, measurement converter, calculator and more. With photo navigation, you can download pictures from Garmin Connect Photos and navigate to them. It's also compatible with lifetime traffic alerts (receiver purchase required). With its \"Where Am I?\" emergency locator, you always know your location. Simply tap the screen to get your exact latitude and longitude coordinates, the nearest address and intersection, and the closest hospitals, police stations and fuel stations. The 1300LM features Garmin Lock, an anti-theft feature, and is compatible with our free Garmin Garage where you can download custom custom voices and vehicles. Enhance your travel experience with optional plug-in microSD cards.What's in the Boxn&uuml;vi 1300; Preloaded City Navigator NT Data for the Lower 48 States, Hawaii and Puerto Rico (no Alaska or Canada Detail); Lifetime Maps; Vehicle Suction Cup Mount; Vehicle Power Cable; Dashboard Disc; Quick Start Manual", "title": "Garmin n&uuml;vi 1300LM 4.3-Inch Portable GPS Navigator (Discontinued by Manufacturer)", "price": 169.97, "imUrl": "http://ecx.images-amazon.com/images/I/51AAPHcZE4L._SY300_.jpg", "brand": "Garmin", "related": {"also_bought": ["B002KO7R2I", "B003DSCU72", "B002Z1J8R8", "B001U0O7T4", "B0039LRQ8G", "B005GDUFFG", "B002OL2MU4", "B003ZX8B0U", "B0048K15G6", "B002WIQB0Q", "B0030BJ9S0", "9984984427", "B001U0O7RG", "B005IGVXO8", "B004HW67MW", "B000LRMS66", "B004HPXTIE"], "bought_together": ["B003DSCU72", "B002OL2MU4"], "buy_after_viewing": ["B0057OCDQS", "B0057ODG6Y", "B001U0O7T4", "B005DIBHCE"]}}