{"asin": "B002UHKR6I", "categories": [["Electronics", "Computers & Accessories", "Laptop & Netbook Computer Accessories", "Bags & Cases", "Backpacks"]], "description": "The Kata 3N1 Sling / Backpacks provide photographers with the quick access of a sling and the comfort of a backpack.  The 3N1 with laptop slot has the unique ability to be used as a right-handed sling, left-handed sling and backpack In addition to different carrying options, the 3N1 includes ample storage for photo and personal gear. Photo equipment is stored in the bottom main compartment of the pack taking full advantage of the modular dividers to custom fit the bag to your exact equipment. The large top compartment will hold personal items or additional gear, and the internal pockets and MP3 player pouch will allow you to organize your personal effects as efficiently as your photographic gear. Two external pockets allow quick zippered access to accessories without opening the main compartments. The 3N1 also includes a rain cover for protection in inclement weather. The 3N1-33 will hold a DSLR with battery grip & long-range zoom lens attached as well as, 5-6 lenses, flash, laptop computer (up to 15.4-Inch ) and personal gear. It also makes a great video bag and can hold a compact camcorder and accessories. External dimensions:  length  12.6-Inch ; width 9.3-Inch ; height 18.1-Inch ; weight  3.7 lbs. Internal dimensions Length 11.6-Inch ;Width 6.3-Inch ; Height 11.8-Inch . Laptop compartment dimensions Length 10.6-Inch ; Width 1.6-Inch ; Height 16.5-Inch .", "title": "Kata KT D-3N1-33 3 In 1 Sling /Backpack with Laptop Slot", "price": 124.9, "imUrl": "http://ecx.images-amazon.com/images/I/41KvDsDwv3L._SY300_.jpg", "brand": "Kata", "related": {"also_bought": ["B002UHKR68", "B000L9OIQC", "B005HWC6PI", "B0040X4PV8", "B00006JN3G", "B003II3FD0", "B006TZE0UQ", "B00017LSPI", "B0048IW030", "B0062W02C6", "B0083Z6R4W", "B005RG99OU", "B007NDL56A", "B0036VJ1OQ", "B0007M6GI6", "B00004ZCJI"], "bought_together": ["B00006JN3G", "B00017LSPI"], "buy_after_viewing": ["B008TNXDNG", "B008TNXAYI", "B002DW99H8", "B005OF328I"]}}