{"asin": "B000NVVDKC", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]], "description": "The Olympus EVOLT E-510 digital SLR is a great camera to help you evolve as a photographer. Only Olympus digital SLRs are engineered to be 100-percent digital. Simply put, this means your pictures will have stunning edge-to-edge sharpness that can&#x92;t be beat. Olympus&#x92; Live View LCD technology is a unique feature that enhances your picture-taking experience. Whatever life brings, whatever you&#x92;re photographing, you&#x92;ll capture colorful memories with the E-510&#x92;s proven Dust Reduction System and powerful, 10-megapixel imager.EVOLT E-510 HighlightsInnovative 2.5-inch Live View HyperCrystal LCDThe E-510 features a Live View LCD to provide users with the freedom to choose how they compose their shots, using either the LCD or the optical viewfinder on the back of the camera. The Olympus Live View LCD empowers users to easily compose their subjects live on the LCD before the shot has been taken, offering a level of versatility that can not be achieved by other digital SLR cameras that only offer an optical viewfinder. By holding the E-510 away from the face and using the Live View LCD to compose, it&#x92;s possible to shoot upward from a low angle for dramatic composition, in close for detailed macro photos of a butterfly&#x92;s wings or photographing a parade over a crowd of people.The E-510&#x92;s big and bright 2.5-inch LCD display with approximately 230,000 pixels includes HyperCrystal technology, which offers many times the contrast of conventional LCD monitors, and enables images to be beautifully displayed in vivid color -- both in preview and playback. The HyperCrystal LCD also provides a wide viewing angle, which ensures images can be composed from even the most obscure angles. The larger LCD makes viewing icons and text on the camera&#x92;s menu a squint-free process.Detailed, bright, and colorful photos with 10-megapixel Live MOS image sensorThe E-510 is loaded with an impressive 10 million pixels for high-resolution photos. The 10-megapixel sensor gives photographers the flexibility to blow up their prints to the large sizes supported by many of today&#x92;s printers, or crop the image to print only a part of the image that is important to them. The high-performance Live MOS image sensor in the E-510 delivers excellent dynamic range for accurate color fidelity, and a new state-of-the-art amplifier circuit to eradicate noise and capture fine image details in the highlight and shadow areas.Mechanical Image Stabilization for sharp imagesUnlike other digital SLR cameras in its class, the E-510 employs Mechanical Image Stabilization, which compensates for camera movement. This new technology complements Digital Image Stabilization, which compensates for a moving subject. Combined, Mechanical Image Stabilization and Digital Image Stabilization provide a powerful solution, ensuring blur-free photos even in active shooting situations where photographers may encounter camera shake or a moving subject. This powerful combination resides within the camera&#x92;s body, translating to blur-free images taken with any of the more than 30 digital-specific lenses.Dust Reduction System for spot-free imagesOlympus&#x92; Dust Reduction System produces spot-free photos with the exclusive Supersonic Wave Filter. The patented ultrasonic technology vibrates to remove dust and other particles from the front of the image sensor, and captures the debris on a special adhesive membrane every time you turn on the camera. These spot-free photos liberate users from hours spent retouching photographs at the computer or sending their cameras back to the manufacturer to remove dust trapped inside.TruePic III for image clarityOlympus&#x92; enhanced TruePic III Image Processor produces crystal clear photos using all the pixel information for each image to provide the best digital images possible for every photo with accurate color, true-to-life flesh tones, brilliant blue skies and precise tonal representation in between. TruePic III also lowers image noise by one step to reduce noise in images shot at higher ISO settings, enabling great results in low-light situations.Lens compatibilityAll E-Series cameras support the Four Thirds Standard whereby Olympus and various other manufacturers produce high-quality Four Thirds-compliant lenses and accessories that are specifically designed for digital SLR image capture. Because the E-510 is part of the Olympus E-System, it is compatible with a large and growing range of Olympus E-System accessories to further enhance personal shooting styles and applications. This includes the full line-up of Zuiko Digital Specific lenses and flashes.Easy-to-use, easy-to-handle light and ergonomic designThe EVOLT E-510 is extremely portable, measuring 5.35 inches (136mm) by 3.61 inches (91.7mm) and 2.2 inches (56mm), excluding protrusions, and weighing 16.2 ounces (460 grams) body only. The new camera has a classic penta-mirror design that is light and compact enough to comfortably shoot with all day. Beyond its portable size, the E-510 delivers unparalleled ease of use -- from menus that make sense and buttons on the body that are easy to understand and operate, to automatic settings for every imaginable situation.While the E-510 includes a full range of manual control options to customize your creativity, it also has 28 shooting modes designed to provide the ideal settings for a variety of shooting situations automatically. These include Digital Image Stabilization, Night Scene, Fireworks, Beach and Snow, and Candle Light to name a few, as well as an xD Panorama mode (for use with Olympus xD-Picture Cards). Users also benefit from special color modes and the possibility to apply a variety of Black & White filters.Accepting both CompactFlash Type I &amp; II, Microdrives, and xD-Picture Cards, the camera provides a choice of data storage options for enhanced flexibility, and it is possible to transfer image files from one card to the other right inside the camera.", "title": "Olympus Evolt E510 10MP Digital SLR Camera with CCD Shift Image Stabilization (Body Only)", "price": 11.38, "salesRank": {"Camera &amp; Photo": 12246}, "imUrl": "http://ecx.images-amazon.com/images/I/41DtgghwicL._SX300_.jpg", "related": {"also_viewed": ["B0015ASYJ8", "B000BK39DE", "B0015AUUFY", "B001TXKQBK", "B0042X9MNM", "B001TX9P6W", "B002CGSYL2", "B003BR8BE6", "B000X1T3IQ", "B0006NAB9G", "B0007QKN22", "B00061UHDS", "B0007QKMQY", "B0035LBRJO", "B0009U7MV6", "B002GILU44", "B000SSLR5Q", "B001K3JPRA", "B0029U0WWU", "B00CC9QTA2", "B0091TC3OC"], "buy_after_viewing": ["B001XX38KW", "B003VNKNEQ", "B003O7ZALU", "B003VNKNF0"]}}