{"asin": "B001WYIJL0", "description": "From the ManufacturerBroaden your view with the all new GE E1255W that delivers a big 3.0-inch intelligent LCD screen and a 28mm wide angle lens for more capturing and viewing dimension. Its powerful 12-megapixel resolution sensor offers superb image details. With the latest Pan-Capture Panorama feature, seamless wide-view photos can be captured without the need for stitching. The E1255W also contains a host of advanced features that you definitely appreciate.E1255 Highlights28mm Wide Angle LensEasily capture large group shots with the extra wide lens.Pan-Capture PanoramaWide-view photos are produced by panning the camera across to create a seamless panoramic picture.Auto Scene DetectionAutomatically determines the appropriate scene type and optimizes exposure for sharp, vibrant pictures.Blink DetectionBlink Detection alerts you if a subject&rsquo;s eyes were closed so you can immediately retake the picture.Smile DetectionThe shutter automatically releases when the smile appears so you can capture smiles the moment they happen.Face DetectionFace Detection automatically focuses and optimizes exposure for sharp, brilliant pictures.Image Stabilization in actionImage StabilizationOvercomes camera shake to help you take clearer, sharper pictures.In-Camera Red-Eye RemovalRemove red-eye immediately while viewing images on the LCD.Auto Adjust Brightness LCDThe LCD screen adjusts to the existing lighting conditions so you can frame your subject properly.What's in the BoxRechargeable Li-ion BatteryBattery ChargerAV cableUSB cableWrist strapArcsoft Photo Impression 6: Simplify management of your photos, videos and music files on your computer and get creative with digital photos.", "title": "GE 1255W-BK 12MP Digital Camera with 5X Optical Zoom and 3.0-Inch LCD Screen with Auto Brightness (Black)", "price": 81.94, "salesRank": {"Camera &amp; Photo": 24746}, "imUrl": "http://ecx.images-amazon.com/images/I/51rac830DLL._SX300_.jpg", "brand": "GE", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]]}