{"asin": "B002KQ5KVG", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Keyboard & Mouse Combos"]], "description": "With the Logitech Wireless Desktop MK700, comfort and productivity go hand-in-hand. Concave keys position your fingers properly, and their softly rounded edges invite your fingertips to glide from key to key, hour after hour. This low-profile keyboard features Logitech Incurve keys and a cushioned palm rest. The keys are so comfortable, you'd think they were custom-made to fit your fingers.A wireless desktop that deliversBuilt for power users who spend long hours working on their computers, the Logitech Wireless Desktop MK700 is a premium performance, low-profile keyboard and mouse solution. It&rsquo;s designed to deliver exceptional comfort, unlike other models on the market.Key FeaturesIncurve keys and cushioned palm rest make you comfortable at workConcave keys position your fingers properly, and their softly rounded edges invite your fingertips to glide from key to key, hour after hour. Keys so comfortable, you'd think they were custom-made to fit your fingers.Power management extends battery lifeUp to three-year keyboard battery life and 12-month mouse battery life. Better power management practically eliminates the need to replace batteries.Hyper-fast scrolling speeds you alongFly through long documents with the nearly frictionless scroll wheel, or shift to precise click-to-click scrolling to navigate lists, slides, and image collections.LCD dashboard makes it easyAn LCD dashboard gives you at-a-glance icon status of your battery, Caps Lock, Scroll Lock, and Num Lock, so you won't skip a beat while typing.No delays with Advanced 2.4 GHz wireless technologyLogitech Advanced 2.4 GHz wireless technology dramatically reduces interference with virtually no delays or dropouts. (Compared to conventional 27 MHz wireless technologies.) Includes 128-bit AES keyboard encryption&#8212;one of the highest levels of security available. Get all the benefits of a cord, with the convenience of wireless. Range up to 30 feet (10 m).Which Logitech Keyboard And Mouse Combo Is Right For You?GoodBetter&nbsp;BestUltraCordless DesktopMX 5500 RevolutionCordless Desktop Wave ProWireless Desktop MK 700Cordless Desktop WaveCordless DesktopS 520Wireless Desktop MK300&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Connection FeaturesUSB SupportWireless Protocol &amp; SecurityBluetooth 2.0 EDR128-Bit AES EncryptionAdvanced 2.4 GHz128-Bit AES EncryptionAdvanced 2.4 GHz128-Bit AES Encryption27MHz48-Bit Encryption27MHz48-Bit Encryption27MHz48-Bit EncryptionMini-Receiver&nbsp;&nbsp;Mini-Receiver Stand&nbsp;&nbsp;&nbsp;Keyboard DesignPalm RestIntegratedIntegrated CushionIntegrated CushionIntegrated CushionIntegrated&nbsp;Adjustable Height/AnglesIntegrated LCD&nbsp;&nbsp;&nbsp;&nbsp;Battery Level Indicator(on LCD)(on LCD)Battery Life (Maximum)3 months3 years3 years12 months12 months15 monthsOperational and Navigational ControlsEnhanced F-KeysSearch Feature&nbsp;&nbsp;Communication ControlsLaunch E-MailLaunch Web BrowserLaunch IM / VOIP&nbsp;&nbsp;&nbsp;Mouse FeaturesRechargeable Mouse&nbsp;&nbsp;&nbsp;&nbsp;Battery Life (Maximum)2-week charge2-month charge12 month8 months8 months8 monthsLaser Mouse&nbsp;Hyper-Fast Scrolling&nbsp;&nbsp;&nbsp;Battery Level Indicator&nbsp;On/Off Switch&nbsp;System SupportWindows Vista &amp; Windows XPMac OS X&nbsp;&nbsp;&nbsp;&nbsp;What's In The BoxPackage ContentsKeyboardMouseUSB 2.4 GHz mini-receiver4 AA alkaline batteriesCD with softwareUser documentationSystem RequirementsWindows-based PC onlyWindows XP, Windows Vista or Windows 7USB portCD-ROM driveInternet connection for software driver downloadKeyboard FeaturesOff/On switchLogitech Incurve keysAdjustable keyboard anglesIntegrated LCD dashboardMusic and volume controlsSpill-resistant designWireless encryptionCalculator buttonWeb and e-mail controlsProgrammable hot keysCushioned palm restMouse FeaturesLogitech high-performance laserHyper-fast scrollingSide-to-side scrolling plus zoomProgrammable buttonsBattery-life indicatorOff/On buttonTouch-to-search", "title": "Logitech Wireless Desktop MK700 Keyboard and Laser Mouse", "price": 229.99, "imUrl": "http://ecx.images-amazon.com/images/I/51rRF1Z93SL._SX300_.jpg", "brand": "Logitech", "related": {"also_viewed": ["B0036E8V08", "B003VAHYNC", "B0011FQUQG", "B0073YHEZU", "B00I14395A", "B001DJ9GOS", "B002MMY4WY", "B00655BBGG", "B006HIFZMW", "B000TKHGL2", "B004XLA1R4", "B005GB31PE", "B003VANO7C", "B00ACC0P0Q", "B002JCSCYS", "B000AY5ZIS", "B0002CE0XY", "B003TG75EG", "B004KSQANO", "B003VAGXZC", "B003VAGXWK", "B0058OU8VY", "B003JZU8DC", "B0034XRDUA", "B004VD4F1W", "B001S4OTS6", "B001B8EOMU", "B002HWRJBM", "B007BPKHJ6", "B0012MXZ3Y", "B00FPV2C8M", "B000Q6UZBM", "B002MUYP3E", "B00CIZPXRU", "B0012OKAP8", "B000J43HJ8", "B000TUK47U", "B004MF11MU", "B00JMO4YXO", "B004N627KS", "B005CMQIVG", "B003W0RKM6", "B000HCRVSK", "B008B91Y66", "B000A6PPOK", "B000HCT12O", "B00E93IEU2", "B007PJ4PN2", "B00CYX53QW", "B000CR1V5O", "B001F51G1G", "B001DJ64C0", "B0009V6TL4", "B000H14IDC", "B001NXDBI6", "B00BP5KOPA", "B0099SMFVQ", "B008OEHS04"], "buy_after_viewing": ["B0036E8V08", "B003VAHYNC", "B003VANO7C", "B002HWRJBM"]}}