{"asin": "B003WOLOLU", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "Did that just happen? Some moments in life need an instant replay button. With the Kodak Mini Video Camera you've got one with you wherever you go. This itty-bitty video camera easily slides into a pocket--even your skinny jeans. With one touch, the Kodak Mini captures all the highlights, and the pop-out USB arm makes it seriously simple to share the fun on Facebook and YouTube sites.Plus, it's built to withstand your craziest days--from a fumble in the rain, to a trip to the bottom of your bag. The Mini is ready when you are--so the next time you hear, \"Did that just happen?\" you can show the instant replay. The real Kodak Moment happens when you share.Kodak Mini HighlightsItty-bitty size. Big video fun.The size of a credit card, this ultra-thin, lightweight video camera can go anywhereTake it where life takes you so you can capture all the funThe Mini's sleek design lets you slip it into any pocket or purseCapture your craziest days with no worriesDive into the fun--its waterproof design helps protect it should things get a bit wet and wild--rain, snow, or even in the poolAccidents happen, and luckily the Mini isn't afraid of a little fall--it's built to take itMake a scene wherever you goNo cables to worry about, just pop out the USB arm to upload, share, and chargeShare on Facebook and YouTube sites with ease--built-in software and USB arm make editing, uploading, and sending e-mail simpleReplay your videos instantly with the vivid, high-contrast 1.8 in. color LCDSee more details and accurate colors with enhanced low-light performanceWhat you get. And how you use it.Capture more moments thanks to the rechargeable Li-Polymer battery with in-camera chargingIt doesn't matter if you own a MAC or a PC--the Kodak Mini is compatible with bothThere's always room for more--record hours of video with expandable card slot and included 2 GB MICROSD cardBe creative with great video softwareCut and trim videosTransform video frames into amazing photosAdd effects to your movies (black-and-white, sepia, old movie, fisheye, exposure, sketch, sharpen, negative, water color, and mute audio)What's in the boxKodak Mini Video Camera2 GB MICROSD Memory CardUser GuideARCSOFT MEDIA IMPRESSION SE Software for Kodak (stored in camera memory, for PC only)", "title": "Kodak Mini Video Camera with SD Card (Grey)", "price": 89.95, "salesRank": {"Camera &amp; Photo": 2633}, "imUrl": "http://ecx.images-amazon.com/images/I/41FQQOrNQNL._SY300_.jpg", "related": {"also_bought": ["B001S0PWWC", "B002HZJ1T2", "B0045DR7UE", "B002KI7RZG", "B003VNKNEQ", "B00BF9HZT4", "B003VKR34C", "B005G81EAQ", "B00189BSQM", "B0027JML5O", "B0090SLJ1C", "B004H1QCMI"], "bought_together": ["B001S0PWWC", "B003VNKNEQ"], "buy_after_viewing": ["B003VNKNF0", "B003VNKNEQ", "B0029631VI", "B004FLL5AE"]}}