{"asin": "B00004U5VF", "description": "The Tekken series has always stood as a set of console games that went above and beyond their arcade counterparts.  From additional characters to completely new modes, the series has always tried to add something that the arcade games lacked.  Tekken Tag Tournament, at first glance, is the most dramatic upgrade over an arcade Tekken game to date. The graphics have been given a huge boost, similar to the upgrade that Namco's weapon-based fighter, Soul Calibur, received when it hit the Dreamcast last year. Plus, new modes have been added. But does the series capture the same magical feeling that made the previous Tekken games such smash hits? Most definitely.Tekken Tag Tournament serves as an upgrade to Tekken 3, adding a few new moves along the way. Fighters that had appeared in Tekken 2 but were missing from Tekken 3 have been brought back as well, and most of them have lots of new moves to help balance them with the more powerful Tekken 3 fighters. Finally, the game is now fought in the same tag-team style as Capcom's versus series of fighters, so you can switch between two different characters at any time. Much like Street Fighter EX3 and Dead or Alive 2, you can have up to four players, with each player controlling a different fighter in the tag battle. However, unlike most other tag-battle fighters, Tekken Tag rounds end after only one of the two fighters have been defeated, rather than letting the battle continue as a one-on-two affair. An option that let you configure this would have been nice. Aside from the standard tag-battle arcade mode, there is also a one-on-one game that makes Tekken Tag Tournament more like the previous Tekken games, as well as the standard team battle (though it is now a tag-team battle), time attack, and survival modes. Unlockable modes include a theater mode, where you can watch all of the game's endings; a gallery mode, which lets you pause the game at any time and snap a screenshot of the action that is saved to your memory card for later viewing; and Tekken bowl mode, a bowling minigame that lets you hit the lanes and toss glimmer globes at Heihachi-headed bowling pins. Each character has a different bowling style that affects speed and control. The character endings, with the exception of the game's final boss, are rendered using the game engine. This presumably saved time during the game's development. As a result, they're short, mostly meaningless, and decidedly less than impressive.  By comparison, the prerendered intro and the final boss' prerendered ending are simply incredible pieces of footage. In Japan, the TV commercial for the game is simply an abridged version of the game's new intro movie. Very striking stuff.Graphically, the game has taken a very large leap, and the arcade version of the game looks downright ugly by comparison.  The characters are very, very smooth, and the backgrounds are amazing and filled with lots of movement, from helicopters to crowds of spectators. Some stages are well lit, showing off some really excellent lens-flare techniques. There are also some nice little touches, such as grass being crushed down by falling fighters then slowly springing up afterward. However, the game suffers from one particular problem that has in fact been seen throughout the series, but with the power of the PlayStation2 behind it, you'd expect it to be a thing of the past. The problem is the same one that showed up in Street Fighter EX3. While the backdrops of the fights and the ground on which you fight look great separately, they don't mesh very well. The result is two different types of scrolling, making it look as if the battle is occurring on a small, circular spinning platform surrounded by a nearly stationary background. It's easy to miss while you're actually playing, but it sticks out like a sore thumb on watching the game closely. Also, the game uses much of the same animation and motion-capture data from Tekken 3. Sure, the characters look pretty incredible, but with the identical animation quality, even as good as that animation was, the game looks and feels a little on the stale side. The soundtrack is full of techno and vocoder robot voices that will either endear you to the soundtrack or drive you up the wall.How much you enjoy the game will directly relate to one factor: If you played so much Tekken 2 and 3 that you couldn't possibly play another match, Tekken Tag doesn't offer enough new features to draw you back in. But if you've stayed away from the Tekken series for a long time, Tekken Tag is a very warm homecoming, delivering the same solid gameplay that Tekken fans crave in large doses. Still, you won't be able to stop yourself from wondering what Namco could have done with the game if it had been designed on the PS2 (or comparable arcade hardware) from the start. Guess we'll all have to wait for Tekken 4 to find that out.--Jeff Gerstmann--Copyright &#169; 2000 GameSpot Inc. All rights reserved. Reproduction in whole or in part in any form or medium without express written permission of GameSpot is prohibited.--GameSpot Review", "price": 19.0, "imUrl": "http://ecx.images-amazon.com/images/I/51dK733zicL._SY300_.jpg", "related": {"also_bought": ["B0000664JF", "B0002CHJ8C", "B00000K2X5", "B000006P0K", "B0002B90OE", "B000935256", "B00008H2IW", "B00005J536", "B00005NCCR", "B000GPVUQ2", "B000006P0J", "B0000A0MDV", "B00004YRQ9", "B00005NN5G", "B0000A082Y", "B00019AZBO", "B0006ZJPR8", "B000069BD9", "B00005J32C", "B006KYYOSO", "B000B69E9G", "B0002XL3BA", "9629971372", "B0000A30R8", "B00004YRQA", "B001CLG6SG", "B000021Y5P", "B000TLU67W", "B0001I9YHG", "B001MW91IW", "B000F3AACA", "B0053OMTVQ", "B000G6SPHI", "B0002RQ3ES", "B00005Q8J1", "B00005BK7X", "B0000C7GHG", "B00005TNI6", "B00009WAVI", "B0013KW1B2", "B00005ML10", "B00004U5VK", "B0008GJRRS", "B000G7YX14", "B0000503MO", "B00020LZAW", "B0009R1T9K", "B0009351PM", "B000FW87AI", "B000TGQLYE", "B00004YRVW", "B00009YEK6", "B00005OLX1", "B00005CF9L", "B0002CNUN0", "B000EMJA3M", "B0009SQF0C", "B00005R5PO", "B000V7889C", "B00005NUJ3", "B0002EJ8FC", "B000FII8KQ", "B0000696CZ", "B00005LIOL", "B00006LEM1", "B00005ME6N", "B00007E1OA", "B00000IZS1", "B000066TS5", "B0002IQCSY", "B00006JN5H", "B0000C4M22", "B00026RFI2", "B0009350BW", "B0009Z3HMY", "B000KCX9M4", "B0001ADAME", "B0045L3SNQ", "B0009UUQGE", "B0001VGFK2", "B000088KH1", "B00005U8TQ", "B001AZFSEM", "B00005NN5A", "B0013JHKU0", "B00005V6BE", "B00009ZVHY", "B00000I1BZ", "B00020LZAM", "B000E49SGE", "B00000I1C1", "B00005O0I2", "B00006LEMX", "B000069D39", "B000CRSBLG", "B0002IQC8E", "B00001X50M", "B006KYYP06", "B00019HNNM"], "bought_together": ["B0000664JF", "B0002CHJ8C"], "buy_after_viewing": ["B0002CHJ8C", "B0000664JF", "B006KYYOSO", "B000935256"]}, "salesRank": {"Video Games": 6604}, "categories": [["Video Games", "More Systems", "PlayStation 2", "Games"]]}