{"asin": "B001LK8P14", "related": {"also_bought": ["B001SHNEF2", "B00009W3TY", "B002NXGP6U", "B003VKTGV0", "B0037TA7TU", "B002651ZZG", "B002T45WXA", "B002YBTWJ8"], "bought_together": ["B00009W3TY"], "buy_after_viewing": ["B002NXGP6U", "B003VNKNF0", "B003VNKNEQ", "B002S53CK0"]}, "title": "Creative Labs Vado HD 720p Pocket Video Camcorder with 8 GB Video Storage and 2x Digital Zoom (Black) OLD MODEL", "price": 137.99, "salesRank": {"Camera &amp; Photo": 4359}, "imUrl": "http://ecx.images-amazon.com/images/I/31zr-yoWauL._SY300_.jpg", "brand": "Creative Labs", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "From the Manufacturer Catch the perfect snowboarding stunt, your baby's first steps or your kid's graduation, share it online and save it for a lifetime with Creative's Vado HD Pocket Video Cam. The thin, lightweight Vado HD is small enough to fit easily in a pocket, purse or the palm of your hand, and it captures video in 720P high-definition quality with just the touch of a button. Sharing videos online is simple with built-in software that helps you post videos to YouTube, Photobucket or Box.net. The Vado HD is the only pocket video cam to feature true HDMI connectivity and an included HDMI cable for a superior viewing experience on an HDTV. Take the Vado HD Pocket Video Cam with you everywhere you go and never miss a moment. Product specs include 720p high-definition video, wide-angle glass lens, 2x digital zoom, 8GB of video storage capacity, up to two hours of recording and playback per charge, up to eight hours of recording time at 640x480 at 30 frames per second, HDMI and RCA connections for TV, HDMI cable included, A/V cable sold separately, removable and rechargeable lithium battery, Vado Central software for simple video editing and sharing. System requirements include Windows Xp Service Pack 2 or Vista, Intel Pentium III or higher, 512MB of memory, USB port, 500MB free hard disk space, and 16MB of Video Memory or above. Product ships with soft pouch, HDMI cable, and USB cable.Vado HD HighlightsCapture life in HDSee it, shoot it, share it - capture life&rsquo;s unforgettable moments in high-definition clarity and share them online with Creative&rsquo;s Vado HD Pocket Video Cam. The thin, lightweight Vado HD is small enough to fit in a pocket, purse or the palm of your hand, and easily captures video in 720p high-definition quality with just the touch of a button. The Vado HD is the only pocket video cam to feature high quality HDMI connectivity and an included HDMI cable that provides true 720p output to an HDTV.Capture high-definition videoRecord all your fun moments at an HD video resolution of up to 1280 x 720p. With the wide-angle glass lens, you can also capture wider scenes and more action in your videos. This precision-engineered glass lens produces sharper and clearer images, giving you professional-looking videos. Vado HD also has 2x digital zoom and works great in dim environments.2 hours of recording and playbackSimply start and stop recording with the touch of a button. Record up to 2 hours of stunning HD quality video or up to 4 hours of video at VGA resolution. The large 8 GB internal memory and four recording modes give you the freedom to choose the video quality that&rsquo;s best for you.Edit movies and snap photosMake and edit your own short movies, or capture snapshots in still and burst mode with the built-in Vado Central software.Playback video on your HDTVConnect your Vado HD to any HDTV with the included HDMI cable and enjoy your videos in full 720p HD quality.Connect and share in an instantSimply plug in Vado HD&rsquo;s flexible USB tab and post your videos directly onto popular web sites such as YouTube, Photobucket or Box.net with the built-in Vado Central software. You can even save your great quality video clips to your computer for a lifetime of memories.Easily connect the Vado HD to your computer via the flexible USB armHigh-quality video compressionThe latest H.264 video compression technology provides unprecedented video quality at ultra-efficient file sizes for the best possible viewing experience. Record up to 4 times more videos, compared to MPEG-4 encoded ones.Large 2-inch antiglare screenSet up the perfect shot, review clips onscreen or show them off to friends. Keep the videos you like; delete the ones you don't.Rechargeable for hours of funEnjoy 2 hours of recording and playback with the Lithium-ion battery; simply recharge via USB. Need more time? The battery is even removable so you can change out for a fresh one.Accessorize your Vado HDPick up an optional accessory for your Vado HD! Choose from a Waterproof Pouch, Mesh Pouch, Spare Rechargeable Battery and a Battery Charger and get the most out of your Vado HD.RequirementsMicrosoft Windows Vista, Windows XP (Service Pack 2)Intel Pentium III 1 GHz, AMD Athlon, or equivalent with MMX support512MB RAMUSB 2.0 or 1.1500MB free hard-disk spaceVideo Memory: 16MB RAM & aboveOther Requirements: Microsoft DirectX 9.0 or higherPackage ContentsVado HD Pocket Video CamHDMI CableUSB Extension CableSilicon SkinRechargeable Battery"}