{"asin": "B00365EVW4", "description": "The Samsung BD-C6500 Blu-ray Player offers Internet@TV, which delivers the best of the web, straight to your HDTV, with downloadable widgets and apps like BLOCKBUSTER, Facebook, YouTube, Twitter, Flickr, Pandora and more. You can shop online, share pictures, catch up with friends and connect to a wide range of streaming digital content at the touch of a button. It also has wireless LAN built-in. Add to that AllShare, which enables content to be seamlessly streamed between DLNA devices, allowing you to play files stored on your PC or even to use your telephone through your TV.Key FeaturesInternet@TV:Connect to an ever-expanding portal of your favorite digital content.Customizable widgets give you access toBLOCKBUSTER, Facebook, YouTube, Flickr,and more &ndash; all on your HDTV.BD-Live ready:Get more out of a Blu-ray Disc than what's on it. BD-Live 2.0 lets studios future-proof their Blu-ray titles, so they can add content to BD-Live Ready discs even after they have been shipped. Simply connect your Blu-ray player to the Internet (through the included Ethernet port or using an optional Link Stick USB wireless dongle) to download images, subtitles and more. Text-chat with friends during a movie, or play against others in online trivia games to unlock exclusive video content and earn discounts on other products.AllShare:Sync up your entire household. A wired or wireless DLNA connection lets you stream your PC audio and video files to your HDTV using your remote.Wireless LAN-ready (Built-in)1GB built-in memoryFull screen, ultra fast playFull 1080p Picture QualitySleek, slim design (39mm)High glossy finishConnections1 HDMI2 USBAudioAdvanced HD audio (Dolby Digital TruHD, DTS-HD Master Audio)7.1 channel audio outLearn MoreCOMMENT: ==========================================Image Quality", "title": "Samsung BD-C6500 1080p Blu-ray Disc Player (2010 Model)", "price": 197.99, "imUrl": "http://ecx.images-amazon.com/images/I/21TaEr67eGL._SX300_.jpg", "related": {"also_viewed": ["B004N85YBA", "B00ICDABYC", "B00BFRKYVM", "B0076R7FWQ", "B0076R7F1M", "B0076R7FFI", "B0089KJPM2", "B0036WS4CA", "B00BFDHVAS", "B0076R7F62", "B005NEZDUA", "B0038KR8WM", "B00EUY59Z8", "B00F526CC8", "B00752R5Z4", "B00E0SJCX4", "B004BLK24S", "B00ICDAAXO", "B003QP41EW", "B001URWAYG", "B009YWN926", "B00752R4QO", "B001A4LVYY", "B00793MIJM", "B00ICDAAX4", "B006U1YUZE", "B0036WT1V8", "B00B9JR5H2", "B006U1YVZ8", "B00752R4S2", "B0078P6O8W", "B005DII6DC", "B00BFDHV9E", "B004K1EOCA", "B00AWKC0JM", "B00HPMCO4Q", "B00793MIGK", "B00BQ3EGPU", "B004G8HXXO", "B00AYB3OMG", "B004MSGEOC", "B001V9LA44"], "buy_after_viewing": ["B00F526CC8", "B00BFDHVAS", "B00BFDHVAS", "B00AWKC0JM", "B00EUY59Z8", "B00EUY59Z8"]}, "categories": [["Electronics", "Television & Video", "Blu-ray Players & Recorders", "Blu-ray Players"]]}