{"asin": "B007B2QDFQ", "description": "With the Tom Tom Bluetooth GPS MKii Receiver for USA and Canada you never need to be lost again, wherever you are, whatever you are doing. Tom Tom's Bluetooth device is designed for people who already own a compatible device that supports Bluetooth. This unit gives your device GPS functionality. The receiver utilizes Bluetooth technology to eliminate the need for connecting cables, and a high-performance GPS antenna to ensure the best possible reception wherever you might happen to go. Ideal for urban environments, the GPS antenna on this unit will stay connected to make sure you find your way whether you are driving down the road or walking down the street, and because of its Bluetooth connectivity, and its small size and light weight, this handy receiver can fit easily in a pocket, purse, or anywhere else out of the way.Instructions:Apple iPad, iPod Touch (Any Generation)Requirements: Apple Device Must Be JAILBROKEN.1. Download BTstack APP located in Cydia.2. Turn on the TomTom MKii. The light will turn green.3. Open the BTstack APP and connect it with the TomTom MKii.4. Wait 5 minutes for the TomTom to warm up and connect to satellites.5. Start using your favorite navigation APP. (Example, Google Maps, etc)Android Devices:1. Download Bluetooth GPS APP located in Google Play.2. Turn on the TomTom MKii. The light will turn green.3. Go into Settings and pair your device in the Bluetooth settings. It will never show connected but it will show paired. TomTom MKII passcode is 0000.4. Go into the Bluetooth GPS APP and select the TomTom and connect it. Make sure Mock GPS Provider is enabled.HP TouchPad Tablet1. Download MapTool Pro APP located in HP Catalog.2. Turn on the TomTom MKii. The light will turn green.3. Open the MapTool Pro APP and connect it with the TomTom MKii. Passcode is 0000.", "title": "Tomtom Mkii Bluetooth GPS Receiver for USA Canada Worldwide", "price": 83.8, "imUrl": "http://ecx.images-amazon.com/images/I/4114KN%2BaVLL._SY300_.jpg", "related": {"also_bought": ["B001EBE1LI", "B000PKX2KA", "B004M8ST36", "B00585CLR2", "B008I3POOS", "B0009PD3PA", "B0035Y7ZJ2", "B006M49G80", "B0018YZ836", "B00GAERLFC", "B00585CLSQ", "B003WNHGAO", "B005NLQAHS", "B00AYAZENY", "B00BFYH11Q", "B008U1MOM8", "B00AAOOQJC"], "buy_after_viewing": ["B006M49G80", "B0018YZ836", "B00AYAZENY", "B003WNHGAO"]}, "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]]}