{"asin": "B0009IX7K8", "description": "Minimum System RequirementsOS:XP and 2000Processor:Pentium III, Athlon 1.0 GHzRAM:256 MBHard Drive:4.7 GBVideo Card:64 MB Video Card with Direct X compatible driversAdditional Info:Keyboard and MouseIt may not be a splashy leap forward, but Rockstar Games'Grand Theft Auto: San Andreasin its own deep, dark way does just as much to move and revolutionize video games as its two predecessors,Grand Theft Auto IIIandGrand Theft Auto: Vice City. As in previous installments, here you play as a thug with problems you must steal and shoot your way out of, but the problems this time are disconcertingly more realistic. You play as Carl Johnson, known on the street as CJ, a likeable criminal type who has just returned to his hometown, Los Santos (a fictionalized Los Angeles), to find that his mother has been murdered and that the police have framed him for another murder. Reunions with his friends and a troubled relationship with his brother set off a sprawling, complex plot line, taking place at first in the immediate Los Santos area but eventually spilling into San Fierro (based on San Francisco) and Las Venturas (Las Vegas).You play as Carl Johnson, known on the street as CJ.This is an honest effort to create an engaging story about sympathetic characters caught up in a brutal environment that is on par with a movie or novel.Gaming GangstersWhereVice Citytook its cues, with tongue firmly in cheek, from the 1980s television seriesMiami Vice,San Andreasis a sincere homage to early 1990s innercity gangster films likeMenace 2 SocietyandBoyz &lsquo;N the Hood. This is an honest effort to create an engaging story about sympathetic characters caught up in a brutal environment that is on par with a movie or novel. If that effort hits a few flat notes (you would have to be totally desensitized not to wonder if it's OK to make entertainment out of driveby shootings), it may also mark the first step toward video games growing up.  The first thing that fans of earlierGTAgames will notice is the range of action is much wider now: Along with shooting, running, and driving, there's now swimming, eating, working out, shopping, and, yes, getting a haircut. All this means the game has a fairly steep learning curve. But, though the pick-up-and-play appeal ofGrand Theft Auto IIImay be long gone, your access to the action becomes fairly transparent after a little practice. My only serious complaint is that, with the controller now crowded with such previously unheard-of functions like \"Gang Active\" and \"Talk Positive,\" you can drive only with the left analog stick. A minor point, but it makes cars a lot more difficult to handle.Bicycles take on a surprisingly central role.Vehicular VarietyIt would be hard to surpass the variety of automobiles available in earlier games, andSan Andreaswisely does not for the most part try to compete on that score. Instead, it's bicycles of all things that steal the show. The bikes' speed and flexibility are perfect for many of the missions, and there is something about cruising through the streets and basketball courts on a BMX that just feels right. If you play far enough into the game, you will also be rewarded with the chance to fly a number of aircraft, and flying is something Rockstar makes a greater effort to get right this time (welcome news for anyone who struggled with the planes and &lsquo;copters of the earlier games).Lackluster Graphics--but a Real FeelGraphics--never a huge priority for Rockstar--actually take a step backward from the luscious, tropical look ofVice City. Textures are rendered with only a cursory attention to detail, and contours are often blocky. It scarcely matters, though, because no matter howSan Andreaslooks, itfeelsreal. This is due in no small part to voice work by an all-star cast including Samuel L. Jackson, Ice T, James Woods, Peter Fonda, and Outkast's Big Boy and a stellar soundtrack with tunes by Soundgarden, 2Pac, Public Enemy, and even a few country classics from the likes of Willie Nelson. But it's not just realistic,San Andreasis also vast, encompassing three big urban centers and huge swaths of rural land (complete with shotgun-toting farmers) between them. This vastness does mean, however, that there can be a lot of tedious driving to get to the missions, which, along with some awkward sequencing of the cut scenes (they are in places stacked one on top of the other), means that there is a bit too much downtime.  But never mind the quibbles. Ladies and gentlemen, we have another classic on our hands.--David StoeszPros:Astonishingly vast game spaceVivid character developmentComplex, engaging plotEnormous range of available actionsCons:Occasionally awkward game designYou can no longer steer cars with the directional buttonsSteep learning curveWhat's Your Strategy?Get mission strategies and detailed maps to achieve every objective with theGrand Theft Auto: San Andreas Official Strategy Guide.", "price": 49.99, "imUrl": "http://ecx.images-amazon.com/images/I/61YYKRP52TL._SY300_.jpg", "related": {"also_bought": ["B00008JODN", "B001BNFQKO", "B002NY2L12", "B00005YTYJ", "B002NQ4820", "B000COCAJI", "B0036FBERE", "B002BXKJA0", "B007MMINWQ", "B001DUG0NC", "B001CC8UBG", "B00EPFEUKM", "B001O4YSTU", "B0001X5YN4", "B00488PZ0U", "B00005LABK", "B004QEWVTO", "B000WYLZ12", "B0065NP39E", "B00791R1BO", "B00HSR3CQW", "B000N4JENW", "B002I0HFNU", "B002I0HFBC", "B001AWBYRA", "B004D8QAAO", "B004ML9WKC", "B002I0J58I", "B003O2182A", "B000VOSQ0Q", "B005THAX6K", "B004EI0XZQ", "B0009MFQQM", "B0016Q4UJE", "B008OQTUKS", "B004HYIAPM", "B001TOMR84", "B002NIP2SM", "B004FZ9822", "B004NNUEWY", "B004FUGKSW", "B00CMS5OIG", "B005G4CXPK", "B001EK5ZGE", "B000EPP6UA", "B00GN7IS44", "B00542XGPA", "B00BU3WUU4", "B0013RC1W4", "B00EVWX7CG", "B000AAL4HI", "B003VWXV50", "B00FJRP9TQ", "0744004292", "B002ZJPYHS", "B003VWU2WA", "B0013JUEJ4", "B005EZ5GQO", "B002I0HJZO", "B0012LGHZI", "B003O6CB6S", "B000NJH6PA", "B008NNY9V2", "B00FR6VLN2", "B002L6I9Z4", "B00269QLJ2", "B008J16APQ", "B00365R2AM", "B0001PKC0M", "B0030HM2WO", "B00004Z5IE", "B000U90L32", "B003B8UW7O", "B005PVXIWQ", "B004TAFJXK", "B004H80TUC", "B003SPDS8U", "B003L8DXS4", "B00CJ7IUIQ", "B003VAHYQY", "B001N9V420", "B004GGO1JA", "B003UM8T3K", "B001GGO1FW", "B0026EV5FC", "B007XVTR12", "B004S0PN6O", "B006ZPAYKU", "B005C2D2H4", "B003UEREBQ", "B0033WFJFS", "B0007TS24U", "B000VWYJ5Y", "B000067RMY", "B00HETF2T4", "B008OEHTB2", "B005Z9GVGS"], "bought_together": ["B00008JODN", "B001BNFQKO"], "buy_after_viewing": ["B00008JODN", "B001BNFQKO", "B001DUG0NC", "B0050SYILE"]}, "salesRank": {"Video Games": 7893}, "categories": [["Video Games", "PC", "Games"]]}