{"asin": "B000Q3043Y", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The ultimate zoom and a whole lot more.The ultra-powerful 12x optical zoom on the PowerShot S5 IS means you&#x92;ll get the shot you want with no compromise, yet that&#x92;s only the beginning of what makes this camera so exciting. The S5 IS is loaded with many of Canon&#x92;s latest advanced technologies, including the DIGIC III Image Processor, so both still images and movies are rendered with fine detail and luminous clarity. And now ambitious photographers have even greater creative latitude thanks to an included hot shoe adapter that allows you to attach Canon Speedlite EX Series external flashes.PowerShot Pro Series S5 IS HighlightsFull-featured, compact 8.0-megapixel digital camera with a 12x optical zoomThe PowerShot S5 IS is compact and portable, with streamlined controls and a sure, steady grip. And you&#x92;ll want to take it everywhere, because inside is a level of photographic power that&#x92;s truly impressive. 8 megapixels ensure deeply detailed images -- giving you complete freedom to enlarge an image or any section of an image and crop to your exact specifications. The 12x optical zoom brings this compact digital camera into the realm of serious photography. It has the power to take you right up onto the stage and into the end zone for the shot you really want. Zooming is fast and silent thanks to the ultrasonic motor drive.Canon Optical Image Stabilizer Technology and ISO 1600 for steady shootingLife doesn&#x92;t give you second chances to capture special times. That&#x92;s why the elegant PowerShot S5 IS  is equipped with Canon&#x92;s acclaimed Optical Image Stabilizer Technology that automatically detects and corrects camera shake -- one of the leading causes of fuzzy or blurred shots. So now even when you&#x92;re zooming in tight, you can get the steady, crisp, brilliant images you&#x92;ll be proud to shoot and share. And Canon&#x92;s Optical Image Stabilizer Technology is so convenient to use. It functions perfectly with or without a flash.The PowerShot S5 IS also features new ISO 1600 and High ISO Auto settings that reduce the effects of camera shake and sharpen subjects in low-light situations, giving you greater flexibility for shooting.DIGIC III Image Processor with improved Face Detection Technology and Red-eye CorrectionWith DIGIC III, you get images of superior quality, the camera functions at top efficiency and battery life is significantly enhanced. What&#x92;s more, DIGIC III enables Canon&#x92;s newly improved Face Detection Technology and Red-eye Correction to give you better, more true-to-life people shots. Simply press the Shutter Button halfway down, and the PowerShot S5 IS automatically pinpoints the faces in the scene and chooses the ideal focus point. To keep every face looking bright and natural -- without scary red eyes -- the camera controls exposure settings and flash, so every shot is just what you were shooting for.DIGIC III features Face Detection AF/AE, which finds multiple faces in the frame and sets the most suitable focus point, when the shutter button is pressed halfway. And an additional new feature, Face Detection FE adjusts the flash, based on a person&#x92;s face on the screen. Exposure and flash are controlled to ensure proper illumination of both the faces and the overall scene, eliminating the common problem of darkened or overexposed faces.Red-eye correction detects and automatically corrects red-eye during playback for both regular and flash photography. In unusual cases where red-eye is not automatically detected, it can easily be corrected manually during playback mode.iSAPS technology is an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the fast DIGIC III Image Processor to improve focus speed and accuracy, as well as exposure and white balance.High-resolution 2.5-inch vari-angle LCDThe camera&#x92;s 2.5-inch LCD screen gives you the big picture, whether you&#x92;re shooting, reviewing or showing off your images. This high-resolution screen offers a crisp, clear picture to make shooting, playback, and using the camera&#x92;s menu functions especially convenient. Clear and bright, it also features Night Display for easy viewing in low light.Hot shoe adapter for the Speedlite EX Series external flashes*Advanced users and anyone looking to expand their photographic repertoire will be excited to find that Canon has integrated the PowerShot S5 IS with a hot shoe adapter. The adapter lets you quickly and easily add one of several high-quality Canon Speedlite EX Series external flashes, including 220EX, 430EX, 580EX and 580EX II. Adding an external flash allows for advanced creative effects and greatly enhances your ability to achieve professional-quality results in many more situations. Flash intensity and other settings are easily accessed and controlled from the camera&#x92;s LCD screen.*Note: External flashes not includedA variety of movie-making optionsWith a highly flexible movie mode, you can create the movie that&#x92;s perfect for any application. Select from VGA (640 x 480 pixels) with frame rates of 30 fps and 30 fps LP, also QVGA (320 x 240 pixels) with frame rates of 60 fps and 30 fps for recording up to 1 hour or 4GB. With the S5 IS, seamless movie shooting is easy -- just by pressing the Movie button without switching to shooting mode. The PowerShot S5 IS supports the USB 2.0 Hi-Speed standard, so you&#x92;ll enjoy the fastest possible data transfer speeds when using a USB 2.0 Hi-Speed compatible computer.22 Shooting Modes, including 9 Special Scene ModesAutoThe camera chooses all the settings so you can concentrate on your subject.ProgramAccess advanced exposure compensation features while shooting mostly automatically.Av Aperture-priorityYou define the aperture to either isolate your subject or have clarity throughout the entire picture, and the camera will choose the corresponding shutter speed.Tv Shutter-priorityYou select the shutter speed to stop or blur action, and the camera finds the appropriate aperture. With slow exposure times, Canon&#x92;s noise reduction system activates to ensure low image noise.ManualThe ultimate in creative control, you set ISO speed, exposure compensation and white balance.C CustomDefine and store your own settings to achieve the effects you prefer.PortraitThe camera sets a large aperture, focusing the subject and artistically blurring the background to make your subject \"pop.\"LandscapeFor front to back sharpness, the camera sets a small aperture.SportsEnsure highly accurate autofocusing when shooting fast-moving subjects.Night SnapshotGet natural-looking pictures with brighter backgrounds and subjects lit by flash.Super MacroClose to almost touching distance to capture the subject detail.Stitch AssistBuild awe-inspiring panoramas by neatly aligning sequential images.MovieShoot in VGA (30 fps/30 fps LP) and QVGA (60 fps/30 fps) for up to 1 hour or 4 GB).Night SceneFor impressive sunset or nightlife shots, the camera properly exposes the background and uses slow-sync flash for the subject.FoliageCapture brilliant shots of autumn foliage, greenery and blossoms.SnowShoot clear snow scenes without darkened subjects or an unnatural bluish tint.BeachGet clear shots of people at a sunny beach without darkened faces.FireworksGrab brilliant images of skyrocketing fireworks.AquariumAchieve proper flash-free exposure and natural hues at indoor aquariums.IndoorReduce blur and improve color accuracy when shooting handheld indoors.Color AccentChoose to retain a single color in your image while other colors turn monochrome.Color SwapSelect a color and replace it with a color you specify for special effects.The Complete Print SolutionThe PowerShot S5 IS's Print/Share button makes direct printing easier than ever. Simply connect the S5 IS to a Canon CP, SElphY or PIXMA Photo Printer or any PictBridge compatible photo printer, press the lighted Print/Share button and print! Also use the Print/Share button to transfer images to a computer (Windows and Macintosh).Print your own ID photos in 28 different sizes or use the Movie Print function to output multiple stills from a recorded movie on a single sheet with a Canon SElphY Compact Photo Printer.Direct Photo PrintersFor desktop large-format printing, try one of the Direct Photo Printers that allow you to print without a computer in one of two ways: plug your compatible PowerShot camera into the Direct Photo Printer using the supplied USB interface cable, or simply insert a memory card into the supplied adapter. You can also connect the printer to your computer for more options. Print high-resolution, borderless images as postcards or 8.5\" x 11\" sheets within minutes.Compact Photo PrintersCompact Photo Printers let you produce versatile, fun 4 x 6-inch postcards, 4 x 8-inch wide greeting cards or credit card size prints in just two easy steps: connect and press/print. Control the printer right from your camera's LCD screen. You get durable, dye-sublimated prints quickly with or without borders. Assorted paper types let you create mini or credit card size labels. You can even take select Compact Photo Printers to a party or an outdoor picnic using an optional rechargeable battery.PictBridgeThe PictBridge standard enables any digital camera that supports PictBridge to connect and print to any PictBridge compatible printer.", "title": "Canon PowerShot Pro Series S5 IS 8.0MP Digital Camera with 12x Optical Image Stabilized Zoom", "price": 589.0, "salesRank": {"Camera &amp; Photo": 4517}, "imUrl": "http://ecx.images-amazon.com/images/I/51mCrb1SG9L._SX300_.jpg", "related": {"also_bought": ["B001RMHAR6", "B002WUN24C", "B000YJ0LEW", "B001RMKU2S", "B000EMWBV0", "B00009PRYY", "B00I36GY6C", "B0009O6IXA", "B001G5ZU0I", "B000FPWRAQ", "B0039BPG1A", "B003M3A1BK", "B0092F974E", "B000VKCIJU", "B001NIIHDA", "B003WRXF28", "B0076MBCJ8", "B000FSILBM"], "bought_together": ["B001RMHAR6", "B000YJ0LEW"], "buy_after_viewing": ["B003VNKNF0", "B000EMWBV0", "B0039BPG1A", "B003VNKNEQ"]}}