{"asin": "B000H4E7EO", "related": {"also_bought": ["B000FABD0G", "B001ACPP9S", "B00HB0Y12K", "B00GOORI10", "B006M7QQXU", "B008YEWZ4I", "B008Z9GK02", "B00K1A7TOE", "B00CIOGOYW", "B00CIOGP32", "B00FN5WINO", "B0048MB82A", "B009TJ3J60", "B00C8RK66Q", "B004GCJMLG", "B000056J7L", "B0018CX1AA", "B00DFFT5HG", "B00DFFT76U", "0763644765", "B003AVIO4K", "B007A2ZSZ8", "B005QU55EA", "B00BJKUJQ0", "B007GE75HY", "B00HB0WKWI", "B007KZR76S", "B00DDMITQ4", "B00DDMIWIO", "B003KJBK3E", "B000VXOUNY", "B002SG7JSK", "B0031E1GEG", "B006LJOC4E", "B0038JDV4W", "B00FEMIO7A", "B005XTKIBO", "B00171WXII", "B001TUZI4I", "B00JKPO5J8", "B000GE1MEI", "B005DLCJX2", "B00364E1DE", "B0085S0838", "B002QYW8LW", "B00834D5SO", "B00DFFT9S6", "0756615186", "B004XV11D2", "B001Q3KU9Q", "B00DDMJ332", "B001PGKPNK", "B002SG7JSU", "B00ESN885O", "B009D028GC", "B004IYDJNY", "B007KZR772", "B00BEJP498", "0756615151", "B005FUV4F0", "B00BMMOKYW", "B00081J3N6", "B00253T7R2", "0764152319", "B00009KWSR", "B00G34TIDW", "B0073TQIOS", "B003Y3BGYE", "B00A0ID90A", "B0016L4ELI", "B0013TR66I", "B00D3P9G3G", "B0027P8LSY", "B005XTCMSQ", "B007CUBCGW", "B005IWM8PU", "B007JCK5GG", "B002K8PCLW", "B00DDMJ454", "B0029O9WS6", "B002K8PCAI", "B004PBN9BC", "B005U9Y2Y6", "B003IEUQ3G", "B004DKAANA", "B005A3OGR0", "B00DFFT5IU", "B00B1M2NT2", "B00D94EEYC", "B001WAJVZM", "B004QWYCVG", "0553384422", "B001TUZI3Y", "B000K50780", "B004M0PSKG", "B009R27JJC", "B005MQRAAK"], "also_viewed": ["B008Y9HI2W", "B0018CX1AA", "B001DF68MA", "B0048MB82A", "B002MCYWHG", "B00782XN2U", "B0055PJUL0", "B003LP94BW", "B00AFRZ3WI", "B000056B86", "B0048LR8DE", "B00GVJVIJG", "B00782XXKM", "B009B8MS4I", "B000ZKAUE6", "B006M7QQXU", "B008Y5UFRG", "B00782YBOO", "B000FABD0G", "B00I56N7JM", "B000XKR0RI", "B001ACPP9S", "B0088X7UDQ", "B008Y5UGAM", "B0011G0J0S", "B00A2U8668", "B00JMP47PI", "B00IKSC1KG", "B003VDQO9E", "B0048LO37S", "B002QAZ8WC", "B00D3SFPSS", "B000G22QHW", "B00C8RK66Q", "B00LMNC69W", "B000F934WC", "B00LG7FN7G", "B002MKHREI", "B00HB0Y12K", "B008YEWZ4I", "B00CIOGOYW", "B00IPKO44A", "B00GOORI10", "B001MXIZ3I", "B00CHG6HHA", "B00EQUVHHA", "B002QAZ8ZY", "B009RHF930", "B0028018OW", "B00LG7RGBC", "B00HFBZ1OM", "B007T95EQ0", "B008Y5UMTW", "B002K2L2MG", "B00HFBZ1SS"], "bought_together": ["B00HB0Y12K"]}, "title": "iBert Safe-T Front Mounted Child Bicycle Seat", "price": 99.97, "salesRank": {"Sports &amp; Outdoors": 32490}, "imUrl": "http://ecx.images-amazon.com/images/I/51V18d0JaQL._SY300_.jpg", "brand": "iBert", "categories": [["Sports & Outdoors", "Cycling", "Child Seats & Cargo Trailers", "Child Seats"]], "description": "Created by parents who were disappointed with the family bicycling options available, the iBert Safe-T Front Mounted Child Bicycle seat was made to offer families the best biking experience possible in safety and comfort. This front mounted seat offers both parent and child excellent range of vision, with the opportunity to interact as they bike together. Noted for its ease of use, the seat takes just a few minutes to install and remove, and it is equally easy and safe to load and unload the child from the seat. Providing plenty of clearance for the knees so that the adult can bike with ease, the seat is positioned so that it is easy to maintain the center of gravity. This adaptable seat fits any adult bike with a minimum of 3/4 inches of clearance on the handlebar stem.The iBert Safe-T seat was developed after its creators became frustrated with the available bike seat options for children. They found that bike trailers kept their kids uncomfortably far away from them, got too hot in the sun, and only provided a limited view out to the children. The rear-mounted seats presented similar problems. The kids had a limited view and it was difficult to interact with them. Additionally, the balance of the bike was off and it was not easy to load and unload the kids. Other front mounted seats were complicated to hook onto the bike and difficult to remove. These seats also did not allow knee clearance for biking, and as a result were not comfortable.The iBert Safe-T seat offers a variety of safety and comfort advantages compared to other child bike seat options. The iBert Safe-T seat allows you to maintain control of the bike when loading and unloading your child. To load and unload the child, you simply straddle the bike and lift the child into or out of the seat. When using the iBert seat you can always see what your child is doing and you can make sure that your child is safe and comfortable at all times. The center of gravity in the iBert seat is closer to the center of the bike making it easier to control the bike as you ride. The seat sits higher on the bike and is smooth on the bottom so that even tall riders rarely brush the bottom of the seat with their knees and if they do they just glide along the smooth edges on the bottom.The iBert Safe-T seat is easy to install. The patented stinger assembly attaches to any bike with a minimum of 3/4 inches on the handle bar stem. The stinger system attaches to the bike in just two minutes and the seat can then be attached and detached from the stinger in 15 seconds. If you buy additional stinger assemblies the seat can be attached to multiple bikes.The iBert Safe-T seat is made in the U.S.A. with safety and quality as the main objectives. While the iBert Safe-T seat is designed to meet all 1625-00 standards, at this time ASTM 1625-00 is written for rear child carriers not front mounted seats.Specifications:Allows interaction with your childChild has a clear viewNo dirt, dust, rocks, or water thrown in child's faceSmall and easy to attachEasy and safe loading and unloading of childMaintains center of gravitySimilar construction to rear-mounted seatsOne adult can take multiple children for bike ridesEasy assemblyFull clearance for kneesMade in the USARecommended for children one to four years oldMaximum recommended height is 42 inchesMaximum recommended weight is 38 poundsWhat's in the Box?iBert Safe-T Front Mounted Bike Seat, Stinger AssemblyManufacturer's WarrantyTwo year limited warranty for manufacturer's defects"}