{"asin": "B0084Y9V54", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]], "description": "The Clarity HD&#x2122;Micro wirelessly delivers your music, movies, and conference calls with the detail and power other portable speakers lose. Take it anywhere you want and transform any space you're in. Interchangeable grilles (sold separately) let you customize the look and express your personal style.Enjoy High Definition Sound Wherever You Go with the Clarity HD Micro&#x2122;You'll be amazed by the big sound that comes out of this little speaker. Monster has expanded its ClarityHD line to include the ultimate wireless speaker/speakerphone. Advanced BlueTooth technology featuring AAC and apt-X&#xAE;brings out the full richness of your music when you pair to your smartphone or laptop.The Portable, Versatile Solution for Your LifestyleThe sleek and compact ClarityHD Micro provides today's multi-tasking music lover with a high-quality audio solution for music, plus the option of switching seamlessly to a speaker phone using the convenient built-in microphone. Micro is small enough to carry to the office, take on vacations or business trips, or anywhere else you're going yet produces remarkably huge sound.Keep Your Hands Free with Voice Command and ControlMonster's voice command and control functions makes it easy to switch from music to speakerphone and back again hands free. Use voice command to pair your smartphone to Micro, accept an incoming call, check the battery level and more.The Portable Speaker with PersonalityReplaceable front and rear grilles (sold separately) are available for the ClarityHD Micro, so you can choose from different styles and colors to customize the look of your Micro. The grilles attach magnetically and can be swapped in seconds.For the ultimate in customization, you can change the Micro's voice command response, choosing from multiple voices soon available on the Monster website.More Features for Added ConvenienceA rechargeable lithium-ion battery provides long-lasting power, and the AC power adapter comes with an assortment of interchangeable plugs so you can connect to power virtually anywhere in the world. A 3.5mm line-in jack is provided for connecting your smartphone or MP3 player directly to the speaker, and a handy carrying strap and pouch makes it easy to take the Micro wherever you go.", "title": "Monster Micro Clarity  Bluetooth Speakers", "price": 88.99, "imUrl": "http://ecx.images-amazon.com/images/I/4140qNONxqL._SX300_.jpg", "brand": "Monster", "related": {"also_bought": ["B00967TMH0", "B00967TMJI", "B00967TMI4", "B003TFEHMU", "B003TFEHYI", "B00684H6ZY", "B006VJOOHE", "B0086SKGL6", "B008EQTI1E", "B006MBP7T0"], "bought_together": ["B00967TMH0"], "buy_after_viewing": ["B003TFEHMU", "B003TFEHYI", "B0084Y9V90", "B00684H6ZY"]}}