{"asin": "B005MTME3U", "related": {"also_bought": ["B0066E5EYG", "B000NK5Z8Y", "B007MS1YEE", "B002OLWITO", "B0049XEE88", "B003VNKNEQ", "B008DR5R1O", "B00CV9MIEE", "1937986020", "B003VNKNF0", "B008MB1S0A", "B00CV9MHYU", "B002EQRY2A", "B00JFK6V4K", "B005HNF01O", "B007W0OW28", "B005OGQY5U", "B001JTP45C", "B005ERKVC6", "B009F6X30E", "B00CV9M2JU", "B003F7DWH8", "B007JT1W02", "B009B0MYSQ", "B00276S55M", "B00K0GAZT0", "B00313JX56", "B005RXH1WU", "B005VF1684", "B002HZW6XK", "B005OGQXJW", "B00FEQG25C", "B0073HSH8U", "B003FGB8H0", "B006UMM1UO", "B00DN43RCI", "B0066E6A94", "B00009R6VO", "B00EFILNV8", "B007M54E08", "B004Q3C98S", "B002HZY5F2", "B007M51J3I", "B002760XWU", "0374191875", "B001U0O7RQ", "B007NDL56A", "B007BJHETS", "B007M54E1M", "B00B7ID99I", "B004XIB9T6", "B0075SUK14", "B007M51J42", "B00GXMIRIQ", "B007JRB0RE", "B003LY4E04"], "bought_together": ["B003VNKNEQ"], "buy_after_viewing": ["B009B0MYSQ", "B003VNKNF0", "B000NK5Z8Y", "B00EFILNV8"]}, "title": "Canon PowerShot S100 12.1 MP Digital Camera with 5x Wide-Angle Optical Image Stabilized Zoom (Black)", "price": 379.99, "salesRank": {"Camera &amp; Photo": 592}, "imUrl": "http://ecx.images-amazon.com/images/I/51tInHscVvL._SY300_.jpg", "brand": "Canon", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "ELPH S100Sleek and SeriousThe PowerShot S100 is a sophisticated pocket-friendly point-and-shoot digital camera that has the power advancedusers and enthusiasts need to create standout images. As with other PowerShot cameras, the compact PowerShot S100 incorporates all of the advanced Canon technologies that make capturing superb photos and video as easy as pressing a button. As automatic or manual as you need it to be, the PowerShot S100 is a serious photographic tool, which incorporates the Canon HS SYSTEM, now featuring the new DIGIC 5 Image Processor.&nbsp; The fast f/2.0 lens helps you tackle unfavorable lighting and capture breathtaking portraits with beautiful, shallow depth-of-field. 12.1 Megapixels ensure crisp, richly detailed images, and a 5x Optical Zoom provides an excellent all-around range to shoot near or far.&nbsp;Experience the PowerCanon DIGIC 5 Image ProcessorThe latest-generation Canon DIGIC 5 Image Processor brings phenomenal increases in processing speed and power.&nbsp; Improved chip architecture and algorithms deliver greatly expanded functionality with further refinement in image quality.Improved noise reduction produces clearer images when shooting in low light at high ISO speeds. Enhanced i-Contrast performance adjusts differences between light and dark areas to achieve even more natural-looking results.The faster processing speed also results in faster continuous shooting capability while maintaining full image quality. The DIGIC 5 Image Processor also makes possible a new, highly advanced automatic white balance system. Whereas conventional white balance makes an overall adjustment based on a single type of light source, the new Canon Multi-Area White Balance analyzes several areas of the image to determine whether different adjustments are needed, for example, for the main subject and the background.Noise ReductionConventional Image Processor"}