{"asin": "B001HN6CVA", "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Chargers & Adapters"]], "description": "The Scosche passPORT USB charging adapter allows accessories that do not support USB charging to work with iPod and iPhone.Firewire-to-USB Charging Pass-ThroughIf you have an older iPod interface in your car, battery backup system, or similar product, you might find that charging is not supported with your new iPod. The Scosche passPORT solves that problem with Firewire-to-USB charging capabilities, providing a 12V to 5V solution for iPod nano 4G, iPod touch 2G, and iPhone 3G.Using passPORT is simple:Plug the dock connector into the female side of the passPORT.Plug the passPORT adapter into your iPod or iPhone.Select a song from your iPod or iPhone and begin enjoying your music while chargingGreat for Vehicle iPod AccessoriesThe passPORT is perfect for older car integration accessories that don't support charging for the iPhone 3G and iPod models released in September 2008 or later. The passPORT is compatible with: several aftermarket head-units as well as Acura, Audi, Aston Martin, Bentley, BMW, Chevrolet, Chrysler, Dodge, Ferrari, Ford, Honda, Hummer, Hyundai, Infiniti, Jaguar, Jeep, Lexus, Lincoln, Mazda, Mercedes Benz, Mercury, Mini Cooper, Mitsubishi, Nissan, Pontiac, Porsche, Rolls Royce, Saab, Saturn, Scion, Suzuki, Toyota, Volvo, and VW. (Not compatible with select Pioneer head-units that use the CD-iB100 or CD-i200 iPod to IP-Bus adapter.)Note: The passPORT is specifically designed to fix the charging error associated with several iPod and iPhone accessories. If the accessory you are intending to use does not initially support the audio or video functionality of the iPod or iPhone, the passPORT will not enable these features.", "title": "Scosche passPORT Charging Adapter for iPod and iPhone (Black)", "price": 26.36, "imUrl": "http://ecx.images-amazon.com/images/I/314LbpxpM8L._SX300_.jpg", "brand": "Scosche", "related": {"also_bought": ["B00BBHN0RQ", "B0094G44PS", "B004E5MBG8", "B009C7HGE0", "B003TJR2HS", "B00GNWMNMM", "B001NXYXX8", "B009DKZWBK", "B008EL58YA", "B00ASVCY46", "B0097BEG08", "B005FUX2WI", "B005FUWWWY", "B00829EHSW", "B00BRT0MQU", "B007QIXSVM", "B007JW8ROS", "B00B52LLJ6", "B00GP08858", "B00829ANNK", "B0084UJMS4", "B005UHDCYY", "B00B1K6D5Y", "B004BAC2B0", "B00CEIJEVW", "B0053PYAWQ", "B00545WG4O", "B000UVGIGE", "B00495JZTY", "B009A5EIWC", "B00ICCVJGC", "B009WNR13U", "B00C66X2O2", "B005DUQ6BY", "B003N3GRCQ", "B008SYCTKE", "B00E1UWA4O", "B00J46VW9O", "B0048ID2XC", "B00GHUHMUS", "B0040UBU3W", "B0030Z95B2", "B008R68DFS", "B00006RVNE", "B004NNUEWY", "B006DIFXTG", "B000JWXPPG", "B00FR6VLN2", "B000MLPE7G", "B008OEHTB2", "B00D901B4W", "B00IBL3MP0", "B00BCH4WWC", "B009AOFNU4", "B001C4SL04", "B000277ATA", "B009OBCAW2", "B00EI8SS4U", "B008AGQMQC"], "bought_together": ["B0094G44PS"], "buy_after_viewing": ["B003TJR2HS", "B0094G44PS", "B00BBHN0RQ", "B001NXYXX8"]}}