{"asin": "B003CQD8YO", "description": "litetouch&trade; keyboardSharing the majority of features of its wireless variant, the Eclipse litetouch Keyboard has been designed specifically for desktop operation. With its metal finish, top cabinet and quiettouch&trade; low profile backlit scissor keys; the Eclipse litetouch Keyboard proves an eye catching addition to any office or study setting.With the same touch sensitive LCD 3-in-1 touch panel as found on the wireless litetouch Keyboard, you can access media, surf the internet or perform office tasks at a touch of a button.a touch of ambienceLocated to the right of the physical scissor keys, the unique litetouch LCD 3-in-1 touch panel provides the user with unprecedented control over their digital life. With a single press, the LCD 3-in-1 touch panel switches between media mode, numerical-pad mode and &lsquo;MyEclipse&trade;&rsquo; mode, providing you with a host of commands which can be used to provide dedicated controls for a multitude of activities from replicating a simple office calculator to controlling a complex media center configuration.When the LCD 3-in-1 touch panel is set to MyEclipse mode, you can personalize the touch panel to access their favorite websites and applications. at a touch of a button. Displaying 12 pre-defined icons covering topics such as shopping, finance, health and entertainment, you can assign each icon with your favorite websites, applications, games, and much more.You can even allocate up to a maximum of three individual websites along with an application of your choice to each icon, all of which will open at the same time and all at the touch of just one button, ideal should you access multiple websites and applications when shopping or dealing with your online finance.In addition, the MyEclipse mode provides 5 numbered buttons which you can choose to cover any topic not already included in the pre-defined icons. Setting up MyEclipse is as easy as drag and drop.litetouch&trade; LCD touch-sensitive Media Panel.trueview&trade; backlit keys.Low profile quiettouch&trade; scissor keysSofttouch&trade; palm restSlim profile: A full sized keyboard for a compact spaceSystem Requirements:Bluetooth-enabled PC or Mac(Windows 7, Windows XP, XP64, Vista and Mac OS X)Other Products in the Eclipse Linewireless litetouch keyboardtouch mousemobile mouse", "title": "Eclipse Litetouch Keyboard", "price": 25.99, "imUrl": "http://ecx.images-amazon.com/images/I/41IzfPJjSTL._SX300_.jpg", "related": {"also_viewed": ["B001F51G16", "B00GLDVSNI", "B002SAJCYU", "B000VOE466", "B001IOHAVO", "B00I0S6SK0", "B000J43HJ8", "B00CEZQ8FA", "B00JXI97MM", "B00AQMUE30", "B008CXTX7S", "B003VAGXWK", "B00I9V8D92", "B00J2LIC44", "B00KTV2W6U", "B0068J1H7C", "B008YRITPO", "B005HNHRA6", "B00E1HIVG8", "B002VKMO0G", "B00DS3MPHM", "B00CKF6ACK", "B00H4DOFE8", "B006CSKLO4", "B00DHUUTEM", "B00KYKPL96", "B00426HI8U", "B00I8QACGA", "B00749OLBO", "B00749PLXQ", "B009SJR28W", "B002LB42NM", "B002RRLQIO", "B003Y7ZBDM", "B000H6AY6M", "B0083AWDP4", "B00FWK8UWI", "B00DR9V1T0", "B004N627KS", "B00GTG2XGS", "B009YZXOVE", "B002ZV51DI", "B0090ECASW", "B003VAK16O", "B00B9L816E", "B007F10V60", "B0074036MI", "B005IPKU20", "B004MF11MU", "B00A14ZV9K", "B00385VWKG", "B0099SMFVQ", "B00DQ5RGOY", "B00EKIQ4GM"], "buy_after_viewing": ["B008CXTX7S", "B003VAGXWK", "B001F51G16", "B005DKZTMG"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Keyboards"]]}