{"asin": "B001U0O5QE", "description": "Using the Eye-Fi Share Video SDHC wireless memory card, you can quickly and easily transfer your images from your camera to your computer--without cables or cradles. Simply turn your camera on near your home Wi-Fi network and upload your images. Then, share your memories with friends and family on an online sharing site. This card comes complete with four gigabytes of capacity, so you can shoot plenty of photos and videos without running out of space. Installation is simple and the card is compatible with most digital cameras on the market today, including Canons, Nikons, Casios, Sanyos, and more.OverviewThe Eye-Fi Share Video features:Convenientwireless transferof photos and videos from your camera to computer for easy backupEasytransferof photos and videos to your favorite online sharing siteSelective transfer of only the photos you wish to uploadAutomatic confirmationof photo uploadsAmple storage space with4GBof memorySimple installationFast Wireless Uploads of Your Photos and VideosThe Eye-Fi Share Video card makes transferring and backing up your photos and videos to your computer quick and hassle-free. Simply turn your camera on near your wireless home network, or other configured networks, and upload your photos and videos to your computer. No need for cables. Now your photos and videos are securely backed up with easy wireless transfer.Quickly Share Your Photos and Videos with Wireless TransferWith the Share Video card you can easily post your photos and videos to your favorite online sharing site. Simply turn your camera on near your home Wi-Fi network to transfer them to a site such as Flickr, Facebook, Picasa, or YouTube--there are over 25 to choose from.Receive Confirmation of Your Photo UploadsThere's no need to guess if your photos and videos have transferred to your online site with the Share Video card. You can be automatically notified by setting up an email, Facebook, or Twitter alert. You'll receive an automatic message when your images have uploaded.Stores up to 2,000 ImagesAlong with its impressive wireless capability, the Share Video card contains 4GB of memory. That's enough to handle up to 2,000 photos or 90 minutes of video. You won't be worrying about running out of space with this powerful little card managing the workload.Easy InstallationGetting started is quick and easy. The Setup Guide, included with your card, gets most users up and running in a matter of minutes.RequirementsSDHC-compatible digital cameraComputer with Windows XP/Vista/Win7 or Mac OS X 10.4, 10.5, 10.6100 MB of free spaceWi-Fi router compatible with 802.11 b/gBroadband Internet connectionInternet browser: Explorer 7 (Windows only), Firefox 2 and 3 (Windows and OS X), or Safari 3 (OS X 10.4 - 10.6)What's in the BoxEye-Fi Share Video 4GB, SDHC wireless memory card; Eye-Fi Manager software; USB card reader; and Setup Guide.Comparison Chart&nbsp;MEMORY CAPACITY2 GB&nbsp;&nbsp;&nbsp;&nbsp;4 GB&nbsp;&nbsp;&nbsp;8 GB&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;WIRELESS UPLOADSPhotosVideos&nbsp;&nbsp;RAW&nbsp;&nbsp;&nbsp;&nbsp;COOL FEATURESOnline Sharing&nbsp;Geotagging&nbsp;&nbsp;&nbsp;Hotspot Access&nbsp;&nbsp;&nbsp;Ad Hoc Transfers&nbsp;&nbsp;&nbsp;&nbsp;X2 ENGINESDHC Class 6&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;", "title": "Eye-Fi 4GB Share Video SDHC Wireless Flash Memory Card EYE-FI-4SV", "price": 39.95, "imUrl": "http://ecx.images-amazon.com/images/I/51%2B3zuGGwWL._SY300_.jpg", "related": {"also_viewed": ["B00CS4WPD6", "B003DV4234", "B002UT42UI", "B004U5QR62", "B00AKONZ3U", "B00FG8PPXI", "B00CRFK24K", "B00CS4WPHC", "B001AD0TGG", "B00A659ILQ", "B001U0O5QO", "B00DUTJ7JI", "B00BN2AJOQ", "B00AARIEVK", "B00A659IJI", "B00GEBTH80", "B001DKO7R8", "B0034XIMG4", "B00GEBTFNM", "B003DX3O6I", "B00CRFK4FC", "B000EMWBT2", "B000VJX7DW", "B00DR590OM", "B00ED74GXI", "B00AQUMZRA", "B0075SUKIC", "B007VGGIB6", "B003VNKNF0", "B00BEHQKPW", "B00B7N997O", "B007FGZ1V0", "B0096W1OKS", "B003VNKNEQ"], "buy_after_viewing": ["B00CS4WPD6", "B003DV4234", "B002UT42UI", "B0053TRH2M"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Memory Cards", "SD & SDHC Cards"]]}