{"asin": "B00026ENLE", "description": "Experience Middle-earth like never before inThe Lord of the Rings: The Battle for Middle-Earth, the firstThe Lord of the Ringsgame that puts you in command of a real-time, open world. Control the legendary heroes, massive armies, and epic campaigns of Middle-earth in over 25 missions based onall three films ofThe Lord of the Ringstrilogy. From waging all-out combat among the vast forces of good and evil to controlling your favorite heroes and characters to managing the troops and resources of your side, the fate of a living, breathing Middle-earth is in your hands.Key FeaturesFight the epic, sweeping battles from the Academy Award-winningThe Lord of the Ringsfilm trilogy from a whole new perspective--as commander of hundreds of soldiers and creatures.Control massive armies and interactive battlefields across the vast world of Middle-earth.Lead the forces of good or evil by controlling one of four unique groups, from the Riders of Rohan to the forces of Sauron, each with its own playing style, resource management, and base-building techniques.Take command of strategic territories across a highly detailed, 3D map of Middle-earth and turn the tide in the battle to control The One Ring.Forge new heroes, customize their abilities and powers, then lead them into battle where they'll gain experience and rank in their quest for victory.Watch your armies come to life as they express emotion--from anger to fear to triumph--when reacting to events and their surroundings.Make smarter and faster decisions in the heat of battle with an all-new intuitive, streamlined interface that gives you contextual control of your forces and structures.Challenge fellow rulers online in massive multiplayer battles.", "price": 199.95, "imUrl": "http://ecx.images-amazon.com/images/I/517FWVGH09L._SY300_.jpg", "related": {"also_bought": ["B000CA5FLW", "B000HAUO4A", "B000F1WGCY", "B000SOYG8U", "B0000BXIAK", "B003DNLDR0", "B0000C0Z0O", "B000YQ639M", "B000P5BSUQ", "B00009VE6E", "B000E2D3LC", "B0002VXW2K", "B00BQZ5EWW", "B001AZFSDS", "B000N4JEN2", "B000FJSIUA", "B001AVOJ5K", "B00006FXJG", "B000J18SR2", "B0002IWYGS", "B000Q8UPKQ", "B000VVEMXY", "B0002ILSGA", "B0002IQD1U", "B000FUONLM", "B0000CE1GK", "B00BQZ5F6C", "B000U850P2", "B000ETRTWY", "B001E6DG6Y", "B00HESEG8S", "B001HL3Q70", "B000MUJCDY", "B006ZPAYJ6", "B0001XOJAS", "B000GAOPAU", "B001AZFSDI", "B002BXN6GY", "B006NU6M5S", "B002RD6MV4", "B002SKDIKE", "B000J2ZS9C", "B005FN6A92", "B000AOIES6", "B00009VE6C", "B000BKIDZ8", "B000AAL4HI", "076154545X", "B002XNW6T0", "B000PIRVQI", "B0031MAI10", "B000FGA1US", "B0002UEDPG", "B00027CXEM", "B0018YXM3Y", "B001BZ2F56", "B000087PM3", "B005LXQLRW", "B0088MVOT8", "B002BSA2R0"], "buy_after_viewing": ["B000CA5FLW", "B000F1WGCY", "B0002VXW2K", "B000N4JEN2"]}, "salesRank": {"Video Games": 4258}, "categories": [["Video Games", "PC", "Games"]]}