{"asin": "B001CN9K6E", "related": {"also_bought": ["B00000JDF5", "B00I6NKP62", "B0016897GS", "B008IFXQIW", "B00000J1V5", "B004N6259G", "B0062KA4VM", "B009WC6RRC", "B0062K951C", "B002M3SHXA", "B004H1PMJC", "B004N625A0", "B001FWYGJS", "B000JV9LUK", "B00HR11DKQ", "B001UI4RTG", "B00BHZLHBI", "B004OA758C", "B000FNFSPY", "B00A29WCA0", "B009T8BCD8", "B004HG056M", "B008UY5WL0", "B00H8A2FVM", "B00FJ9F50C", "B00FO12XY6", "B00200K1TS", "B003Y5RYNY", "B004XC6GJ0", "B00DYQYLQQ"], "bought_together": ["B00000JDF5", "B00000J1V5"], "buy_after_viewing": ["B001FWYGJS", "B001UI4RTG", "B008IFXQIW", "B004N625A0"]}, "title": "Belkin Wireless G 4-Port Router", "price": 12.1, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31DliTlCyeL._SY300_.jpg", "brand": "BELKIN", "categories": [["Electronics", "Computers & Accessories", "Routers"]], "description": "Amazon.com Product Description With the Belkin Wireless G Router, you can quickly set up a wireless network for an apartment or small office, letting you share a broadband Internet connection with multiple computers. The Wireless G Router gives you the performance you need for handling all your basic networking applications, such as surfing the Web, emailing, and instant messaging..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The Belkin Wireless G Router:Creates a Wireless-G network with up to 54Mbps data throughput.Is backward compatible with 802.11b networks.Has four 10/100 Mbps Ethernet ports for wired connections.Easily create a Wireless-G network to share an internet connection with the whole family.View larger.The router also includes four wired Ethernet ports.View larger.Smart Design with Wired and Wireless ConnectionsThe Wireless G Router has a striking, vertical enclosure that is both handsome and space efficient. By standing vertically, the router takes up less desk space, giving you more room to work. The built-in external antenna provides the range necessary to easily cover an apartment or small office. Six LEDs for Power, Wired, Wireless, Modem, Security, and Internet let you know the status of your network at a glance, making it easy to troubleshoot any problems.G Wireless relies on 802.11g technology and provides a wireless speed of up to 54Mbps. This means that you can surf the Internet, check emails, and chat with friends from the comfort of your kitchen table or couch.You can also share networked peripherals such as a Wi-Fi printer, hard drives, and DVDs. The router is compatible with any 802.11g wireless products and is backwards compatible with 802.11b networks. But for maximum speed and range, the use of Belkin's G WirelessUSB Adapter,Notebook Card, andDesktop Cardare recommended.In addition to G Wireless, the router also has four 10/100 Ethernet ports at the back, giving you the option to plug in for a steady and secure, fast connection running at up to 100Mbps.Thanks to the strong built-in security, including support for WPA, WPA2, Wi-Fi Protected Setup, and 64-and 128-bit WEP encryption, you will be protected from hackers and intruders trying to gain access to your sensitive files. The router also supports VPN for making secure connections between home and office.Easy to Set UpBelkin designed the Wireless G Router to be as simple to use as possible. Simply connect your wireless router to your cable or DSL modem, plug the router in, and connect your computer to the router. That's it. To help monitor your network performance and usage, the router includes Personal Network Assistant software, which runs on Windows XP/Vista and Mac OS X 10.4/10.5.The Belkin Wireless G Router is backed by a 1-year warranty and includes free 24/7 technical support.What's in the BoxWireless G Router, quick installation guide, Personal Network Assistant CD, user manual on CD, power supply, RJ45 Ethernet cable.The vertical enclosure looks elegant and conserves space."}