{"asin": "B0038SQQ0Y", "related": {"also_bought": ["B001L0XJGA", "B0052SCU8U", "B00870ZHCQ", "B009DMFOVG", "B0061RJSWC", "B00DG54ARU", "B00CX5P8FC", "B003L1ZYYM", "B00DU0ZI8Q", "B00BGGDVOO", "B00HVQBYO2", "B00ELJVM5I", "B00552PDT6", "B009A6PJKQ", "B00DR0PDNE", "B00KBHX072", "B0049SCB2Y", "B008DW9H56", "B007I5BRIE", "B009DLX95U", "B00316263Y", "B00BEWHOQ6", "B00CKWI13O", "B003L1ZYYW", "B00CJGLBOW", "B000JE9LD4", "B007PY3ZPG", "B004GW25WY", "B005LJQPE0", "B009ZGK6QS", "B003XM1WE0", "B0015YRMXI", "B005LJQM3Y", "B0050SX0UY", "B000J2EN4S", "B00BIQER0E", "B00A2ORV5G", "B00BGAA29M", "B0031IIXW0", "B001TH7GSW", "B005LJQNQU", "B000N99BBC", "B0031TRZX2", "B001EPVOQY", "B005HXFARS", "B007I5JT4S", "B0060B7NCG", "B00CMQTTQG", "B004F9LVXC", "B00BGAA0SU", "B003C15798", "B005DKZTMG", "B00BGA9YZK", "B004OVECU0", "B0065BB7M8", "B00E3RH61W", "B008D6YZXG", "B006JKARZS"], "bought_together": ["B0052SCU8U", "B00870ZHCQ"], "buy_after_viewing": ["B0049SCB2Y", "B0049S6ZUS", "B00BGBU3X6", "B008D6YZXG"]}, "title": "HDMI switch, 5 in, 1 out, with remote control, Built-in Equalizer, Blue Jeans Cable brand", "price": 44.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31Wy23eHXRL._SY300_.jpg", "brand": "Blue Jeans Cable", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Distribution", "Selector Switch Boxes"]], "description": "HDMI Switch, 5 in, 1 out (5x1):This HDMI Switch is suitable for use in any system where you need to accommodate more HDMI sources than you have available HDMI inputs on your television or A/V receiver. Choice between the active inputs can be controlled either by way of the switch button on the front panel or by the included remote control. Because HDMI switching often involves extended distance runs, this switch also includes an active equalization circuit to help extend the working distance of the HDMI connection.Compatible with all HDMI Resolutions, Framerates, Standards and ProtocolsThis switch will accommodate a signal bandwidth up to 2.5 Gbps/channel (7.5 Gbps combined), which will cover any currently available HDMI resolution, frame rate, color depth, or other protocol or standard other than Ethernet over HDMI and Audio Return Channel. Accordingly, the switch is compatible with:-Resolutions: 1080p, 4kx2k, 1440p, 2160p, 720p, 1080i, 480p, et cetera;-Framerates: 24 fps, 30 fps, 60 fps; display refresh rates do not involve the signal in the HDMI connection so the switch is likewise compatible with all refresh rates, such as 120Hz, 240Hz, 360Hz, et cetera.-Other Features and Standards: 3D, Deep Color (10, 12, or 16 bit, or as they are sometimes called, 30, 36 or 48 bit), HDCP, TrueHD Dolby, DTS-HD, et cetera.-Devices: all HDMI-compliant devices will work with this switch, as will the vast majority of DVI-compliant devices (using, of course, a DVI-to-HDMI cable to connect).Supports additional IR functions with optional IR kit:An optional IR kit is available (enter \"B001L0XJGA\" in the search box to find it) which can be used either to (1) allow the switch to be triggered by a separate sensor, or (2) use a sensor at the display to relay IR signals down the HDMI cable to a remote location where those signals can be re-emitted to control the switch and other devices."}