{"asin": "B000QUYHIK", "description": "Hot on the heels of Brain Age: Train Your Brain in Minutes a Day!, the brain training phenomena grows with Brain Age 2! Seventeen all new, engaging activities designed to help work your brain and increase blood flow to the prefrontal cortex. Whether you&#146;re playing simple songs on a piano keyboard or monitoring the photo finish of a footrace, you&#146;ll love your new mental workout!Features17 brand-new activitiesKeep training: Up to four save files keep track of your improvementExpanded multiplayer: Compete with family and friendsWhat is Brain Age?Brain Age acts like a treadmill for the mind! Brain Age 2: Train Your Brain in Minutes a Day for Nintendo DS is a fun, rewarding game that helps you flex your mental muscles with quick activities that help keep your brain in shape. Brain Age is inspired by the research of Dr. Ryuta Kawashima, a prominent Japanese neuroscientist. His studies evaluated the impact of performing certain reading and mathematic exercises to help stimulate the brain.On your first day of exercise, you will take a series of tests and get a score that determines how old your brain is. This number is called your DS Brain Age. Perform daily exercises just minutes a day over weeks and months to get better at the exercises and lower your DS Brain Age!Why is brain training good for you?We all know as we grow older our bodies change and it becomes important to regularly exercise to maintain health and fitness. Our brain is no different. That's where Brain Age comes in.Dr. Elizabeth Zelinski, dean and executive director of University of Southern California&#146;s Leonard Davis School of Gerontology, says games like Brain Age can help keep older generations of Americans&#146; minds active. \"Americans can do a great deal to maintain and even improve their mental abilities,\" Zelinski explains. \"Aging is about taking on new challenges for our minds. Nintendo&#146;s Brain Age is a great way to do that.\"How does Brain Age work?The Nintendo DS Touch Screen lets you write your answers with a stylus, just as though you were writing on paper. Plus, the Nintendo DS's voice input identifies particular words you'll speak during games like the Stroop Test. Brain Age tracks your progression through each exercise with easy-to-read line charts. Use Brain Age each day to open new exercises to test your ability.Brain Age includes a fun calculation competition for friends and family&#151;it's a snap to download this minigame to as many as 15 DS systems using only one Brain Age 2 game card!Challenge yourself and find ways to stay sharp. With the simplicity of the Nintendo DS, and Brain Age's challenging and rewarding exercises, baby boomers and test-prepping kids alike can stimulate their brains!", "price": 22.29, "imUrl": "http://ecx.images-amazon.com/images/I/51ZPddSo58L._SX300_.jpg", "related": {"also_bought": ["B000EGELP0", "B000EGELQ4", "B000TTZMCS", "B0098F1Y3K", "B000ME25P2", "B001GT18H8", "B000VBIGJU", "B000V6I7TE", "B002TDIENG", "B001LNYM90", "B000Y3PE7C", "B000SQ5LOQ", "B002DOC93C", "B001D5DQJ8", "B001AZ7RH8", "B005GDED6S", "B003S2OO04", "B0029XAXZI", "B000T6Z73U", "B000SQ5LOG", "B000FW64ZS", "B001C58T5A", "B000ERVMI8", "B002AU0HZQ", "B000U5TVGY", "B000X25GWW", "B003S2L66Y", "B000MNOYVQ", "B003P9BIAY", "B000UCMI4Y", "B0009UBR3K", "B001F62U4M", "B000QJLQB2", "B008QLUSPM", "B000ZH55MG", "B008YAGTDU", "B0045YKOXK", "B000VXJEW6", "B005KP7EFO", "B001P1ZE68", "B003MUO5BU", "B000E9TBRK", "B0033BJS8S", "B002I0GU2M", "B0042A147M", "B000I10PY2", "B000U5W3IW", "B000TZI2FQ", "B001AZ7RHI", "B000HKGMKK", "B002EE5RD0", "B001NXCIUS", "B007W8S2GM", "B000JFJHQY", "B0033BJSDI", "B000BIZR72", "B000HKN3ES", "B000FO4KO8", "B0009YDS10", "B001T8W2LW", "B003IU1AHQ", "B0007D4MVS", "B003UVA4KC", "B0036KRP72", "B0019C6KC0", "B000HE9LL8", "B0050SVMCC", "B008YAGSAY", "B003V63V2O", "B000FUWCRY", "B0045IIQ4U", "B0006B0O9U", "B000FRV2UK", "B002KJCVYW", "B000A2R54M", "B000PE0HCM", "B008SBODGU", "B0042R90QC", "B001CJD0HI", "B000I10PYC", "B002PGGJI4", "B0013LTP6K", "B002I0EPBA", "B0056BE1C6", "B003QWYXPM", "B003O6E7DI", "B001290A3U", "B000O5FTIY", "B003BMJKI2", "B000NUBY0C", "B0019R4VEO", "B000S1MMDO", "B004J61WDU", "B0029X90NO", "B00B5U3588", "B000Q6ZLHA", "B005J3J5E0"], "bought_together": ["B000EGELP0", "B000EGELQ4"], "buy_after_viewing": ["B000EGELP0", "B0098F1Y3K", "B000EGELQ4", "B000T6Z73U"]}, "salesRank": {"Video Games": 9101}, "categories": [["Video Games", "Kids & Family", "Nintendo DS", "Games"], ["Video Games", "Nintendo DS", "Games"]]}