{"asin": "B003YH9DZ4", "categories": [["Electronics", "Camera & Photo", "Lenses", "Camera Lenses"]], "description": "In the pursuit to achieve the most outstanding image resolution in the 70-300mm class, Tamron&rsquo;s Anniversary lens - the SP AF70-300mm F4-5.6 Di VC USD - utilizes an advanced optical design that features an LD (Low Dispersion) and an XLD (Extra Low Dispersion) lens element made from specialized materials that prevent chromatic aberration. As a result, the SP AF70-300mm F4-5.6 Di VC USD (Model A005) boasts sharper contrast and greater descriptive performance than all others in its class.In addition, it is the first Tamron lens sporting a USD (Ultra Silent Drive), Tamron&rsquo;s very own auto-focus drive mechanism This USD mechanism delivers fast, making it a perfect telephoto zoom choice for photographing sports, racing, or other fast-moving subjects. The lens also boasts Tamron&rsquo;s proprietary VC (Vibration Compensation) image stabilization to assist in handheld photography, not only at long focal length ranges where blurring is common, but also under low-lit conditions, dramatically enhancing photographic freedom. This combination of best in class image resolution, Ultra Silent Drive and Vibration Compensation is a new achievement of Tamron technology culminating in the production of a premium 70-300mm lens.Get dynamic shots with Tamron's new 60th anniversary lensTamron SP AF 70-300mm Di VC USD FeaturesBest-in-Class Optical PerformanceHigh resolution thru use of XLD glassNew USD (Ultra Silent Drive) motor for fast and quiet AFVC anti-shake mechanism for steady shootingSP class specificationsDual format Di design for use on full-frame and smaller sensor cameras109-465mm equivalent focal length on APS-C camerasSuper Performance (SP) for Discriminating ShootersTamron SP (Super Performance) series is a line of ultra-high-performance lenses designed and manufactured to the exacting specifications demanded by professionals and others who require the highest possible image quality. In creating SP lenses Tamron&rsquo;s optical designers put their foremost priority on achieving superior performance parameters - they are all designed to a higher standard with little regard for cost constraints. As a result, Tamron lenses bearing the SP designation feature impressive and innovative designs that have established an enviable reputation for excellence among those knowledgeable photographers that demand the very best.A Full-Time Manual Focus Makes Fine Tuning EasyBBAR lens reduces reflectionAll Tamron lenses have high auto focus precision and are designed to capture subjects easily and in almost any situation, yet sometimes a photographer wants to fine-tune and make adjustments on the fly. The integration of a full-time manual focus offers just that: instead of fumbling with switches, photographers can from auto-focus to manual-focus by simply adjusting the focus ring. This feature helps the lens produce impressive results even in telephoto situations where the depth of field is narrow.Cleaner Crisper Images without Flare or GhostingThenewBBAR (Broad-Band Anti-Reflection) reduce the lens reflection and dispersion that cause ghosting and flare. The coating enhances light transmission in both the short and long wavelength ranges, ensuring excellent performance in all photographic conditions. Additionally, internal surface coatings are applied to cemented surfaces of all lens elements to deliver sharp, high-contrast images and flawless color re-production.Vibration Compensation (VC) Mechanism-Making Telephoto &amp; Low Light a New MediumThe actuator and algorithms, developed in-house at Tamron, provide the power that gives VC (Vibration Compensation) it's excellent tracking performance and smooth, stable viewfinder image. Tamron's VC mechanism provides a three-coil system, whereby the three driving coils activate the shake-compensating VC lens groups electromagnetically via three steel balls. The VC lens elements are held in place only by contact with the steel balls, achieving smooth movement with little friction, helping to eliminate the blur from camera shakes for clean shots night or indoors, or in macro and telephoto situations, hand held has never been this easy.VC on - VC offSpeed is Nothing if not StableFast and accurate without so much as a whisper. The SP 70-300mm F4-5.6 Di VC USD is the first to boast Tamron's new Ultra Silent Drive (USD). USD is Tamron's latest autofocus motor technology rotor, converting, converting ultrasonic waves into torque to quietly deliver a new level of focus precision and speed. Because it's still built on a rotor it's full time manual focus is as easy as ever-allowing the photographer smooth manual focusing without having to fumble with a switch. With advanced motor technology and newly developed software, Tamron's USD delivers a practical, precise, noiseless photographic experience at turbo speed. For those dynamic sports shots, moving vehicles, or fast moving subjects, there has never been a better option.Smooth manual focusing without having to fumble with a switchExtra Low Dispersion (XLD) LensExtra Low Dispersion (XLD) lens elements made from specialized ultra-high-grade glass allow Tamron lens designers to achieve much greater control over chromatic aberration (color fringing) and magnification aberrations, the two major factors that inhibit image quality enhancement. In combination with LD elements, XLD elements are used to achieve sophisticated lenses that deliver the highest possible contrast, the finest detail, and superior imaging performance throughout the entire zoom range.Full Frame Sensor for Ulitmate VersatilityThe SP 70-300mm F/4-5.6 DI VC USD is one of Tamron's Digitally Integrated (Di) designs. The Di series is the mark of Tamron lenses that are format-versatile since they can be used on Digital APS-C, full-frame and 35mm SLR cameras.Full Frame Digital SLR/35mm Film CameraAPS-C Size CameraAuto-focus/Manual-focus (AF/MF) Switch Mechanism on the Focus RingThe ability to switch quickly between auto-focus (AF) and manual-focus (MF) is a great asset in many types of shooting, especially sports and nature photography. This is easily accomplished with Tamron&rsquo;s ingenious AF/MF system. By simply sliding the focus ring back and forth between the two positions you can select either the AF or MF focusing position. In manual-focus mode Tamron lenses provide smooth, precise manual focusing by turning their wide, well-textured focusing rings.Technical SpecificationsModel: A005 (\"A005E\" seen on the lens is a generic optical lens design code and does not indicate mount compatibility)Focal length: 70-300mmMaximum aperture: F/4-5.6Angle of view (diagonal): 34&deg; 21'-8&deg; 15&rsquo;Lens construction: 17 elements, 12 groupsMinimum focus distance: 59.1\"Maximum magnification ratio: 1:4 (at f = 300mm: MFD 1.5m)Filter size (mm): &Oslash;62mmLength : 5.6\"Diameter: &Oslash;3.2\"Weight : 27.0 oz.No. of diaphragm blades: 9Minimum aperture: F/32-45Standard accessories: Flower Shaped Lens Hood", "title": "Tamron AF 70-300mm f/4.0-5.6 SP Di VC USD XLD for Canon Digital SLR Cameras", "price": 449.0, "imUrl": "http://ecx.images-amazon.com/images/I/41YjyPmPQuL._SX300_.jpg", "brand": "Tamron", "related": {"also_bought": ["B00004ZCJJ", "B001GN3SGS", "B0000BZL7S", "B00004ZCEF", "B0009R5NN8", "B001LMU78G", "B002L7FOX8", "B00009R9BT", "B002LVUIXA", "B00AWLRLYK", "B007SNP02K", "B0040JHVCC", "B001KNAZY2", "B000EXR0SI", "B0000A1G05", "B0018ZDGAC", "B00603RU9A", "B006Y0YZZ6", "B00007E7JU", "B00006I5WP", "B00AVBDGHM", "B00004ZCI3", "B002VPE1WK", "B00009R9BV", "B001CCAISE", "B0049XGNKK", "B001G7PIBC", "B007G5NNOW", "B0041MY32Y", "B00004ZCEQ", "B00004ZCJM", "B006JPMT0Y", "B00004ZCJI", "B00894YP00", "B00DMS0GTC", "B007RN5X6O", "B00JQ4HZPO", "B0014Z3XMC", "B000KL7K0M", "B0000BZLBQ", "B00009XVCZ", "B00017LSPI", "B0090BSSZO", "B001KELVS0", "B00B30N7AQ", "B00009R6KK", "B002NEGTTM", "B001PKY2J4", "B0045JAJR6", "B008TC1RS0", "B002JWYAXA", "B009B0MZ8U", "B00796D03C", "B003A6H27K", "0133571254", "B003VSGQPG", "B004FLJVXM", "B008BBKARI", "B00004ZCJK", "B0062W02C6", "B00BXA7N6A", "B00A35X6NU", "B009B0MZG2", "B00007GQLU", "B00CBQ5YOS", "B003Z6R33I", "B000CLNHXY", "B008MNLSBW", "B00HS8ZFXO", "B00796I546", "B003Y60DZO", "B005UFZ7F8", "B003V1YGT6", "B00BW6LW7G", "B005AY9278", "B00007LA0T", "B00004WCID", "B00A35WYJC", "B0037NX6JY", "B001G4NBTG", "B007M54E1M", "B002Z3LQVC", "B00660H6KU", "B0002YE6FY", "B004GITBSE", "B0034SURP8", "B00005061L", "B0002Y5WXE", "B00BCEJ0E0", "B007W5B59G", "B001G4PA36", "B007M54E08", "B004LEAYXY", "B00004ZCJG", "B002K3Z3E8", "B0083WYEHC", "B001LD51H2"], "bought_together": ["B00004ZCJJ", "B001GN3SGS"], "buy_after_viewing": ["B00004ZCJJ", "B0012UUP02", "B0007Y794O", "B000HDZAUA"]}}