{"asin": "B000EPNES6", "description": "Cast your gaze on the ultimate eye-opening experience: the new faster, bigger, and brighter iMacs. S tarting at under $1000, the most personal of personal computers comes out packing a powerful punch. That's thanks to the new 64-bit Intel Core 2 Duo processor, you'll find in each and every new iMac.The iMac's display pivots to whichever angle is best for you.All in the familyThe fastest iMac ever, the 24-inch iMac provides professional performance along with the convenience  of an all-in-one design. Like its 17-inch and 20-inch siblings, it features the new 64-bit Intel Co re 2 Duo processor with speeds ranging from 1.83 GHz to 2.33 GHz. The new processor delivers up to 5 0% more performance than the previous 20-inch iMac. It also doubles the amount of L2 cache, the twin  cores sharing 4 MB between them. The result? Turbocharged performance, making it easier--and more f un--than ever to work with digital photos, movies, music, and the web.The simple six-button Apple Remote gives you control over your music, movies, and photos from anywhere in the room--and it stows away neatly (and magnetically) on the side of your iMac when you're not using it.Dazzling DisplaysWhether you&#x92;re surfing the web, editing video, managing photos, or enjoying face-time with far-flung  friends, you'll thoroughly enjoy the lush visual experience of working on iMac. With excellent colo r saturation, all three models feature a cinematic 16:10 wide aspect ratio that's perfect for watchi ng movies. And iMac delivers a beautifully bright display with the new 24-inch model lighting the wa y. In fact, it&#x92;s a full 40% brighter than the 20-inch model.It's a wonderful iLifeiMac comes with iLife &#x92;06, a suite of easy-to-use applications that make the spectacular a regular p art of your everyday life. Enhance, organize and share your photos via iPhoto. Make an epic starring  your kid in iMovie. Turn your photo and movie creations into professional DVDs with iDVD. Create or iginal music in GarageBand, even if you can't carry a tune. Make podcasts and blogs. Then publish th em online via your .Mac account and the all-new iWeb.The ultimate see and sayThere's an iSight camera built into every new iMac, so you can start a video chat (or join one) at a  moment's notice. There's nothing extra to buy, nothing to attach, no cords to fumble with, no softw are to install or configure. Simply start up iChat AV, click your buddy's video icon and you&#x92;re read y to chat with sight and sound--with up to three friends at once. Proper attire suggested.Now showingWith iMac, you've got the best seat in the house. The full-screen Front Row media experience--with i ts intuitive menus, large text and brilliant graphics--lets you browse the music, photos, and videos  on your iMac as easily as you browse music on your iPod. And the new Apple Remote lets you do your browsing from anywhere in the room. So gather your friends and dazzle them with a slideshow of your vacation pics, a home movie or a DVD. iMac was born to entertain.", "title": "Apple iMac Desktop with 20&quot; Display MA589LL/A (2.16 GHz Intel Core 2 Duo, 1 GB RAM, 250 GB Hard Drive, SuperDrive)", "price": 51.52, "imUrl": "http://ecx.images-amazon.com/images/I/419BX6QHTGL._SY300_.jpg", "related": {"also_viewed": ["B002C74E9C", "B004YLCIC4", "B004YLCBRG", "B004YLCJ5K", "B00HC3YXRO", "B009NB8WRU"], "buy_after_viewing": ["B000PMGZDO", "B001265GI2", "B001V6YD2S"]}, "categories": [["Electronics", "Computers & Accessories", "Desktops"]]}