{"asin": "B0007XL43M", "description": "Don't let a sleeping family keep you from your new action adventure movie, DTS 5.1 concert, or online video game tournament by setting up these Pioneer wireless surround sound headphones. The SE-DIR800C phones, which connect to any 5.1-channel source--including a DVD player, game console, digital cable box, or satellite receiver--are equipped with Dolby Headphone technology, which produces up to five virtual loudspeakers in your head by directing and reflecting the sound from each channel. The effect is a stunning surround experience, far more dimensional than with typical headphones, and, some say, even better than with a high-performance surround speaker system. The audio is natural sounding and doesn't cause \"listener fatigue\" as do many other headphones. The phones also work with a variety of surround formats, including Dolby Digital, DTS, and Dolby Surround.Most conveniently, the SE-DIR800C phones are completely cordless. The small wireless transmitter connects to your source (DVD player, game console, etc.) and broadcasts a clear, strong signal via infrared technology to the headphones. Thanks to the wireless technology, you won't snag a headphone cord on furniture, your dog, your glasses, or anything else.The phones feature a trio of \"virtual room\" presets from which to choose. The options actually reproduce the sound of a playback system in up to three different listening environments based on the acoustic measurements of real rooms. The small room setting (DH1) re-creates a small, well-damped room with very little reverberation that's perfect for both movies and music-only recordings, while the medium room (DH2) is a more acoustically live (or \"wet\") room that's well suited to both formats as well (with moderate reverberation). Meanwhile, the large room setting (DH3) offers a bigger sound, more like the audio within a concert hall or movie theater.A final bonus stems from the onboard volume control. With a volume dial on the headphone itself, users can easily turn up the audio without getting out of the chair. The SE-DIR800C phones, which offer a transmission range of up to 26 feet, are an ideal choice for folks who live in busy households where people go to sleep early, or for anyone who wants a little audio privacy while watching movies or listening to music. The phones are backed by a 90-day warranty on parts and labor.What's in the BoxWireless headphones, transmitter, rechargeable AA batteries, charger, coaxial digital cable, two-way stand, user's manual.", "title": "Pioneer SE-DIR800C Wireless Headphones with Dolby Headphone Technology (Discontinued by Manufacturer)", "price": 299.99, "imUrl": "http://ecx.images-amazon.com/images/I/51uGxQadS9L._SY300_.jpg", "related": {"also_viewed": ["B002TLT10S", "B002TLT10I", "B004P15HD0", "B005LA53D8", "B0019D9TJA", "B000EGJTL6", "B00FJISYZQ", "B006ZNX81E", "B00J0XR10A", "B000CBLG2I", "B00475S0GK", "B00023C6SE", "B0007QN18U", "B002SOU2Y0", "B003ZLARRW", "B0001FTVEK", "B0076Z78AM", "B000Q8UBB4", "B004OXXE9I", "B00JSLXGJ4", "B00BVUAMYW", "B0026P4670", "B0038HX3S8", "B003ZL916U", "B003XCHCLC", "B00D2BZ1VM", "B00FJISYRY", "B00H1XKC2U", "B003O6N64Y", "B00GDFJB1K", "B00CIDAWA0", "B006W41X36", "B0007QKXYU", "B00J7UHVHE", "B00FJISZ0A", "B002PF2DEE", "B0001FTVEA", "B009A6CZYO", "B009A6D034", "B0036Z82PQ", "B00A3R3U2U", "B0076NDV0U", "B007RMNNN0", "B000PCEFXQ", "B00IWWD708", "B007K3SB6K", "B00CD1FB26", "B0033PROOY", "B00J95SC5M", "B007DCC7U4", "B000EULUKU", "B00BFO14W8", "B00BXE3IZ6", "B00H00OG7G", "B008U23F3E", "B000CBLG28"], "buy_after_viewing": ["B002TLT10S", "B002TLT10I", "B004P15HD0", "B0001FTVEK"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]]}