{"asin": "B000FSQD9Y", "description": "Eighteen years after the events of Heroes V, you become the young hero Sareth, trained in the art of magic and war in order to fight the prophecy of the Dark Messiah. But the revelations of your past may alter your course and reveal a path to the truth. Discover a new breed of action-RPG game powered by an enhanced version of Source Engine by Valve. Explore a secluded region of Ashan populated with fearless orcs, savage goblins, dreadful undead, elusive trolls, massive dragons, and many other creatures that defy nature's creation in both size and cunning. Become an expert warrior, mage, or assassin. Use a vast array of devastating weapons against huge, vicious creatures in a deep and captivating fantasy. Challenge the forces of evil in 12 huge levels and master over 30 weapons and a variety of devastating spells. Engage the enemy in intense melee combat with swords, bows, staffs, and daggers. Summon magic powers against the legions of darkness or sneak in the shadows to stalk nefarious creatures. It's heart-pounding action where success in combat will dictate destiny. Extend your gameplay experience without being limited to a single discipline. Learn powerful new spells and attacks using Dark Messiah Might & Magic's unique Skill Evolution System as you progress through the game. Use that to battle with up to 32 players in the revolutionary Crusade mode, which will allow you to gain experience and new equipment across dynamic online campaigns. Enlist with the humans or the undead and choose among five complementary character classes. Wage epic online battles, sprawling over multiple zones, from the dark Necromancer's lair at Nar-Heresh to the man-made splendor of Stonehelm.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51C5bdm0bEL._SY300_.jpg", "related": {"also_bought": ["B004M8FUMO", "B003ZULWQI", "B002V1GFHS", "B00ERDGMSA", "B0000CNUUP", "B0001X5YN4", "B000WCCURW", "B001B5U80K", "B001AH8YSW", "B00BU3WUU4", "B0050SZ0SY", "B005C2D2H4", "B00F4H2O6W", "B00EDJLXHI", "B005OGYVKU", "B001C4VU5C", "B004H80TUC", "B001LYGUB2", "B001D7798A", "B00178630A", "B000SKWLLI", "B00006IR4H", "B001QT8RGS", "B00005YWFY", "B0001MBCD6", "B001QA2TYS", "B00004OCXR", "B00002EIX4", "B000FAMQ3Y", "B000NJFMUQ", "B00007DCEB", "B000RPHJDO"], "bought_together": ["B004M8FUMO"], "buy_after_viewing": ["B002I0JJAW", "B004M8FUMO", "B0002BQN7Q", "B0047THYWC"]}, "salesRank": {"Video Games": 29642}, "categories": [["Video Games", "PC", "Games"]]}