{"asin": "B0009I4VE4", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Camera Bundles"]], "description": "Based on the award-winning image quality, high performance and user-friendliness of the Nikon D70, the D70s offers several refinements that will further enhance your digital SLR experience. For starters the D70s features a 6.1 effective megapixel Nikon DX format CCD that yields 3,008 x 2,000-pixel images that are suitable for making large prints, or for creative cropping to bring out detail. With a power-up time of a mere 0.2 seconds, this SLR is basically ready to shoot when you are. Pictures are processed and recorded extremely quickly, and preview images appear on the LCD monitor almost instantly.The top display shows critical exposure information.The D70s' connection ports are easily accessible.View larger.\"In the cockpit\": controls at the ready.View larger.Two-inch TFT LCD monitor.With the D70s, high-speed action photography is truly a reality. With the ability to shoot a rapid three frames per second (fps) for a continuous burst of 144 pictures, you'll never miss any action. And with shutter speeds that range from 30 seconds to 1/8000 second, or up to a 1/500-second flash synch speed, you'll be sure to have the flexibility you need to capture the action precisely as you want it.Best of all, the D70s employs the Nikon F lens mount for seamless compatibility with the comprehensive lineup of high-quality AF and AF-S Nikkor lenses that have long been favored by professionals around the world.Professional Quality with Point-and-Shoot SimplicityWhile the D70s offers many features you'd only expect in a professional-level SLR, the camera also supports many features that make picture-taking a breeze for anyone. The D70s features Digital Vari-Program selections that automatically optimize white balance, sharpening, tone (contrast), color, saturation and hue settings to best match the selected scene. Instead of having to worry about all the camera settings, you can have the option of choosing from one of several \"modes\"--such as Auto, Portrait, Landscape, Close Up, Sports, Night Landscape, or Night Portrait--that will deliver the optimum image for you according to the conditions. This means you can concentrate on capturing that special moment while leaving the details to the camera. And once you've taken your shots, Nikon's PictureProject user interface makes image management, editing and sharing easy and fun. Simply connect the camera to a computer to automatically import pictures. You can also quickly e-mail or auto enhance images, run slide shows, burn CD/DVDs, and access other commonly used functions easily and intuitively. With simple drag-and-drop steps, you can organize pictures into separate collections and quickly locate any file by name, keyword, or date.Among the many other features that make the D70s an ideal digital SLR solution are:Nikon-exclusive Silent Wave Motor for high-speed auto-focusing with accuracy and super-quiet operationInternal Focusing (IF) for smoother operation and great balanceThree Nikon ED glass elements, plus aspherical element for low distortion and minimized chromatic aberrationM/A mode for instant switching from auto-focus to manual Nikon D-Signal technology for enhanced flash and ambient exposure controlThe camera's included EN-EL3a rechargeable lithium-ion offers up to 2,500 shots per charge, and the large, two-inch TFT LCD monitor offers several playback options, including single frame, four or nine-image thumbnail display, zoom with scroll (up to 4.7x), automatic slide show, histogram indication and highlight point display. In short, the Nikon D70s delivers the professional-level quality an SLR of this class but with many of the convenient automated features that can make photography so fun.What's in the BoxD70s, rechargeable lithium-ion battery EN-EL3a, quick charger MH-18a, video cable, USB cable UC-E4, strap, body cap, eyepiece cap DK-5, rubber eyecup DK-20, LCD monitor cover BM-5, PictureProject CD-ROM.", "title": "Nikon D70S 6.1MP Digital SLR Camera (Body Only)", "price": 9.49, "salesRank": {"Camera &amp; Photo": 4600}, "imUrl": "http://ecx.images-amazon.com/images/I/51c-sSH2BaL._SX300_.jpg", "related": {"also_bought": ["B00005LEN4", "B0033ZDJ7A", "B002KEEGGS", "B000ERDPJ2", "B000W05O5O", "B00005Y3OM", "B004I59W9I", "B000YGIPR0", "0764596780", "B000T9251O", "B003HMVNU4", "B000W0BC7I", "B0009HN57E", "B000O161X0", "B001NXDB4A", "B00009R6VS", "B0009HAHD4", "B00065ANY2", "B0009GZAGO", "B00009R6JT", "B004DEKH84", "B000YHUOQY"], "buy_after_viewing": ["B0033ZDJ7A", "B00005LEN4", "B005DIYQA4", "B0029U7PZM"]}}