{"asin": "B003IE49T8", "related": {"also_bought": ["B008S08ADI", "B00H2D3N0M", "B009YCASUW", "B00GU945UQ", "B00CJD5HBI", "B00DRK73IM", "B00006B8BJ", "B00DYQYITG", "B000Q8UAWY", "B001TH7T2U"], "bought_together": ["B00BWF5U0M"], "buy_after_viewing": ["B004AIJE9G", "B008S08ADI", "B00BPEV1XK", "B004S4R5CK"]}, "title": "Sabrent Network Audio Video KVM Switch to DVI, PC to TV Multi-Display Video Adapter - USB 2.0 to DVI / VGA / HDMI, Audio / Video Networking / Virtual PC 1000 Mbps High Definition AV Adapter (USB-DAAH)", "price": 39.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31Ze0zSm70L._SX300_.jpg", "brand": "Sabrent", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Remote Controls", "Remote-Control Extenders"]], "description": "The Sabrent Network A/V  Display Adapter over Ethernet enables you to connect a Display  (monitor/LCD/projector), USB Keyboard/Mouse, and Speakers, to an  Ethernet port on a LAN Network so you can control up to 4 different  computers on that network. You can also perform presentations or display  DVD video across the network.Supports up to 2 USB devices. The network A/V adapter can be up to 100 meters away from your computer with LAN cable.FeaturesExtend or mirror video through a network to a DVI display and Audio.Compatible with Ethernet and USB 1.1/2.0 specification.Provides 2 x USB 2.0 ports to connect USB devices.Controls up to six DVI displays from a single computer.Display remote control.System requirements:Hardware Requirements: 3Ghz CPU with 1 GB RAM for optimal performanceOperating System: Windows XP 32 bits, Vista32/64 bits, Windows 7 32/64 bitsExtending through a USB port: Available USB 2.0 portExtending through a network: Available Ethernet port on home, business or office network*  The product supports only ONE connection at a time. It may be connected  directly to your computer via the mini USB port or to be used on your  network by connecting through the Ethernet port. Connecting both the USB  port and Ethernet port at the same time is not supported.Please use ONLY the Ethernet port or the USB port when establishing the connection.What's in the box?Network A/V AdapterPower AdapterEthernet CableUSB 2.0 CableQuick Installation GuideCD (Driver and User&rsquo;s Manual)DVI to VGA AdapterDVI to HDMI Adapter"}