{"asin": "B0035JJJPU", "description": "Featuring a built-in camera, superior sound, and convenient video-playback options, the Philips GoGear Cam 8 GB MP3 Player (SA2CAM08K/37) does it all. Its built-in camera lets you turn spontaneous events into memorable videos and photos, while trademarked FullSound technology offers enhanced audio quality. The compact GoGear Cam also features a 2.0-inch full-color display for easy navigation, a connection point for sharing media on your TV, extended battery life, and FM radio, all in a durable and stylish brushed-aluminum finish.GoGear Cam 8 GB MP3 Player (Gunmetal) SA2CAM08K/37At a glance:Built-in 2 MP camera for video recording and photo captureFullSound technology delivers rich, detailed audio8 GB memory holds 1800 songs; microSD slot for memory expansion2.0-inch, full-color display and convenient connection for TV-outputFM radio with RDS and 20 presetsPlays MP3, WMA, JPG, BMP, and MP4 files directlyFullSound technology restores details to compressed MP3 music files.View larger.Capture 2 MP photos and video, then view them on the 2-inch full-color display.View larger.microSD card slot offers added storage capacity.View larger.FullSound Technology Restores Rich Detail to MP3 MusicUsing Philips' innovative FullSound technology, the GoGear Cam allows you to experience distortion-free, CD-quality audio. Combining Philips' expertise in music reproduction with the latest Digital Signal Processor (DSP), FullSound restores details to compressed MP3 music files for an enhanced listening experience that includes rich, full bass, and improved clarity on both vocal and instrumental tracks.Integrated 2 MP Camera for Photos and VideoThe Cam is ideal for taking videos and photos on the go without having to worry about a bulky, expensive camera. With the ability to capture two hours of video, the Cam offers 2x digital zoom for video work and delivers MPEG4 + PCM 640x480 VGA 4:3 (.avi container) files.With the built-in microphone, you can record audio to accompany your videos. You can also use it for note taking. Audio files can be saved in MP3 format, and easily transferred to your computer with the included USB cable.The Cam also captures still photos, which are saved as 2 MP .jpeg files. It offers a variety of snapshot capture modes that add ambience to your photos, including black and white, sketch, special color, negative, and sepia modes, along with a standard auto exposure mode.Convenient Display and Composite TV-OutputA 2.0-inch full-color display makes it easy to view media files, while a folder-view navigation option lets you organize and view media files just like you do on your PC.Share your favorite flicks and clips with friends by using the Cam's composite TV-output that lets you play and share videos on the big screen of a TV. The Cam also offers slide-show playback of photo files, making your favorite albums portable.FM radio with RDS and 20 presetsUnlike many one-trick MP3 players, the Cam gives you access to FM radio, so you can catch the news, get traffic updates, and keep up with tunes that you haven't downloaded yet. The FM radio receiver is RDS-enabled, so it can pick up and display information about what you're listening to, including program details, song titles, and artist names. And the Cam lets you dial in 20 preset radio stations--you'll spend less time searching for signals, and more time listening.8 GB Memory and microSD Slot for Memory ExpansionThe 8 GB Cam holds up to 1800 songs, 2000 photos, or 32 hours of video. It also features a microSD card slot that allows you to expand the player's memory capacity to accommodate your growing media library.Extended Battery LifeThe Cam features an extensive battery life. A single charge offers up to 12 hours of audio playback or 4 hours of video playback, and a convenient low-battery indicator lets you know when it's time to recharge.Click theSongbirdto view a software screenshot.Manage Media Files with Philips Songbird SoftwarePhilips Songbird software is included with the Cam. Philips Songbird makes it easy to organize and play all your media files, and it syncs seamlessly with your Cam player. Ideal for uploading and sharing photos and videos, it's also designed to help you discover new artists and navigate media stores, services, and websites. This software works with PCs running Windows XP (SP3), Vista, or 7.The Philips GoGear Cam 8 GB MP3 Player is backed by a limited 90-day warranty.About PhilipsPhilips has a brand promise of \"sense and simplicity\" that encapsulates their commitment to understanding and catering to the desires and needs of consumers and customers. By putting end users front and center, Philips creates innovative products that are designed around people's needs and aspirations, and are both advanced and easy to use. With 60,000 registered patents, Philips is a global leader in innovation, and receives numerous international design awards every year.What's in the BoxGoGear Cam 8 GB MP3 Player, headphones, USB cable, and Quick Start Guide.GoGear MP3 Video PlayersGoGear RagaGoGear VibeGoGear AriazGoGear CamGoGear MuseCapacity4 GB4 GB8 GB8 GB16 GB8 GB8 GB16 GBHighlightsFullSoundFullSoundFullSoundFullSoundFullSound&nbsp;&nbsp;&nbsp;&nbsp;Surround for moviesEar-hook headphonesSoft rubber earbud headphonesSoft rubber earbud headphonesSoft rubber earbud headphonesSound-isolation headphonesLossless codec support (FLAC & APE) AudibleLossless codec support (FLAC & APE) AudibleLossless codec support (FLAC & APE) Audible&nbsp;Lossless codec support (FLAC & APE) Audible1.0-inch full-color display--reverse1.5-inch full-color display2.4-inch full-color display2.0-inch full-color display3.2-inch HVGA color display22 hour music playback24 hour music or 4 hour video playback45 hour music or 5 hour video playback2 hours video recording, 20 hour music playback, or 4 hour video playback24 hour audio or 5 hour video playback&nbsp;&nbsp;&nbsp;Composite TV-outHDMI video out, up to 720pFM radio, 20 presetsFM radio with RDS and 20 presetsFM radio with RDS and 20 presetsFM radio with RDS and 20 presetsFM radio with RDS and 20 presetsVoice recordingVoice recordingVoice recordingVoice recordingVoice recordingPhilips SongbirdPhilips SongbirdPhilips SongbirdPhilips SongbirdPhilips Songbird&nbsp;&nbsp;&nbsp;&nbsp;Touch Screen&nbsp;Album art displayAlbum art displayAlbum art displayAlbum art displayFolder viewFolder viewFolder viewFolder viewFolder view", "title": "Philips GoGear Cam 8 GB MP3 Player (Silver)", "price": 64.99, "imUrl": "http://ecx.images-amazon.com/images/I/41nojOb0LlL._SX300_.jpg", "related": {"also_viewed": ["B007B5TOZY", "B0035JJJQE", "B00IBR5QJY", "B0035JJJQY", "B007B5TPEY", "B004STY2Z8", "B007B5TOJK", "B00ECRRWTE", "B007B5TO4A", "B004M8SSTG", "B00ECRPOKS", "B00ECQUY2M", "B00EE1H7BQ", "B004M8STFY", "B004M8ST5O", "B00ECRRB8G", "B00BEWDP2I", "B002FL4QCK", "B001PR1ZMY", "B0076HNNHM", "B003ULP5PG", "B007BGGEOC", "B00EYYE60I", "B0041MMMWW", "B005FVNH04", "B004NBY4DQ", "B006MWB8PQ", "B002JPITXY", "B007V7XQ7E", "B0056G13F4", "B007B5TQQG", "B009K6ULV8", "B000WFZSBE", "B004EW0P9G", "B00HCMZ2SE", "B005FPT5DS", "B0041G62TW", "B002IPHA3U", "B004SKBHB4", "B003SE6I74", "B004J359ZK", "B0016763AW", "B001B4SUIS", "B00DE16F74", "B000CS7U1C"], "buy_after_viewing": ["B007B5TOZY", "B003C0Z01E", "B009RQW3BC", "B004M8STFY"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}