{"asin": "B00005BW7Q", "description": "The ambitiously namedXenosaga: Episode 1--Der Wille zer Machtis an epic-sized space opera that opens in the outer reaches of the galaxy. The story follows several space-dwelling citizens as they aim to unlock the secrets of the universe. The specifics of those secrets presumably will be revealed over subsequent editions of the Xenosaga series (after all, this is onlyEpisode 1)--but a vital clue is held in the elusive Zohar, a mysterious artifact that is aggressively sought by evil aliens. Without spoiling the plot's surprising twists, let's just say the game's German subtitle \"Der Wille zur Macht\" (translated as \"The Will to Power\") is a less-than-subtle ode to German philosopherFriedrich Nietzsche, who is considered as one of the precursors of existentialism.Like many conventional RPG titles,Xenosaga's gameplay balances between exploration and battle modes. The game designers have thankfully spared players from any ill-conceived random battle sequences. Instead, you can concentrate directly on your quest without the repetitious enemy battles.The designers also did a good job balancing a traditional RPG structure with complex themes. However, the game seems to go out of its way to casually integrate controversial (and frankly creepy) religious imagery into the context of the game. Some may find the game offensive and disturbing; others will likely find it intellectually stimulating.Namco promises about 80 hours of gaming--but a good portion of that is non-interactive full-motion video. While the stretched-out cutscenes do add considerable depth to the characters, they're often poorly paced and too long--one takes an alarming 30 minutes to unfold! The addition of more background music might have helped to pick up the pacing, since the obligatory soundtrack is strangely absent at some critical plot points.With impressive animation and unexpected plot points,Xenosaga: Episode 1--Der Wille zer Machtis easily one of the more enjoyable RPG titles to hit the PS2. While this isn't for the happy-go-lucky gaming crowd (seeKingdom Hearts), adult-minded gamers will likely be consumed by the darkness and devious delights offered within this twisted title.--Brett AtwoodPros:Complex characters and story themesNo random battle sequencesImpressive 3-D animationCons:Long, long, looooooooong cut scenes", "price": 61.75, "imUrl": "http://ecx.images-amazon.com/images/I/51SNCJYWV3L._SY300_.jpg", "related": {"also_bought": ["B0002CHJAA", "B000G82R20", "B0002GTFIK", "0744002397", "B0009A4EV2", "B00008KTRS", "B00006B5T8", "B000784XG2", "B00006LEMK", "B000F5IH2I", "B00007KQC1", "B000BKSGH8", "B00006LEM8", "B000G77X34", "B000G7X5P4", "B000038IFX", "B001C6GVI6", "B00005T7ZN", "B00006Z7HR", "B00004TC6E", "0744004691", "B00029QQNY", "B00024W1U6", "B00009YEJY", "B0009A4EUI", "B00004ZDFY", "B000TLU67W", "B00005T7ZP", "B00KVRK39A", "B000038ABO", "0744008301", "B000E0VMVM", "B000AVBFU8", "B0014CN2H6", "B0000296O5", "B000G7X5MM", "B000IONGU4", "B000FPGZUE", "B0002SQ0AY", "B001QTW2GY", "B00004Y57G", "B00004S9AF", "B000066TS3", "B00000JRSB", "B00008O0YD", "B000CC5CHW", "B00005TNI6", "B00004YRQA", "B0009A4ETY", "B002I0J4AM", "B00007KUUD", "B000R2YWEQ", "B00KWFCU4M", "B0009K7ESM", "B000784XEE", "B00004U5VK", "B0009XBWY6", "B00008W2R8", "B002DC8GW2", "B000M46V20", "B00004W4QJ", "B00002SVWG", "B000088KH9", "B001CM62UM", "B00025ETC8", "B0000A09EM", "B000FUG5TK", "B000FDOTIQ", "B000FIVC2W", "B001GMSHSI", "B00008URUA", "B000F8O1C0", "B001E7MMOK", "B000FIU1BK", "B00BY0G0YU", "B000DZTRHE", "B0002CHIWO", "B00019HNNM", "B00005MDZD", "B00005ME6O", "B00002R28C", "B0002IASJ8", "B001NCARPW", "B0045L3SNQ", "B001UIG6M2", "B000094M46", "B00GV4V8XC", "B00004YRQ9", "B00K85X1TE", "B0016C3260", "B0001A86EG", "B00007LV7Y", "B0000657SP", "B000NGQ26C", "B007CSF3GO", "B00006C28X", "B00005LOXE", "B00005NCCR", "B007RNWUC4", "B004CVWETI"], "bought_together": ["B0002CHJAA", "B000G82R20"], "buy_after_viewing": ["B0002GTFIK", "B001C6GVI6", "B0014CN2H6", "B000F5IH2I"]}, "salesRank": {"Video Games": 3893}, "categories": [["Video Games", "More Systems", "PlayStation 2"]]}