{"asin": "B007GMPZ9Q", "related": {"also_bought": ["B002EQ9O8C", "B0002K6XQI", "B008HY61K4", "B007E6GQ6K", "B0000BZOGY", "B00374GRXK", "B004AB4Z10", "0674066898", "B001B0DCOO", "B001AAOZNW", "0393050688"], "bought_together": ["B000YN01X4"], "buy_after_viewing": ["B003R5097E", "B007E6GQ6K", "B0002K6XQI", "B008HY61K4"]}, "title": "Targus Compact Rolling Backpack for Laptops up to 16-Inch/MacBook Pros up to 17-Inch, Black (TSB750US)", "price": 56.55, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41%2Bj8FSCzVL._SY300_.jpg", "brand": "Targus", "categories": [["Electronics", "Computers & Accessories", "Laptop & Netbook Computer Accessories", "Bags & Cases", "Backpacks"]], "description": "Targus Rolling BackpackTargus Rolling BackpackTake the Weight Off Your ShouldersWhether you need a cavernous backpack for getting around campus or a compact roller for an overnight business trip, the Targus Rolling Backpack combines the convenience of both bags into one versatile silhouette. With room for your laptop, a change of clothes, a tablet/iPad&reg;, and all your gear, this bag has what it takes to get you through your busy day.Super StorageIn addition to accommodating a 16\" laptop or even a 17\" MacBook&reg;, the Targus Rolling Backpack has a large compartment for storing books, documents and folders. In a separate section, there is a full workstation where you can store all your accessories, key fobs, pens and more. There are even two side pockets for additional storage. Have an iPad&reg; or tablet? No problem. There&rsquo;s a dedicated compartment for that too, protecting it from bumps and scratches. Elastic straps hold a change of clothes for the gym or an overnight excursion.workstation &amp; dedicated tablet/iPad storagespacious side pocketsroom for a change of clothesSeamless TransformationFully equipped with quiet roller wheels and a sturdy retractable handle, you&rsquo;ll be rolling your gear easily and comfortably. When you need to wear it as a backpack, there&rsquo;s no need to worry about getting dirty. A fold-away wheel cover keeps your clothes clean no matter what you happen to rollover. Unlike other backpacks, the Targus Rolling Backpack even remains standing upright when not in use.fold-away wheel coversturdy retractable handlestays standingRemarkably ComfortableComfort is key with any backpack, which is why the Targus Rolling Backpack is 20-percent lighter than equivalent bags on the market. Although quiet, durable wheels make it a great roller, it also features two supportive shoulder straps so that you can simply pick it up and go when rolling becomes inconvenient. The straps can also be tucked away when not in use. As with any Targus bag, the Rolling Backpack has been built to last and even comes with a Limited Lifetime Warranty.straps can be tucked awayquiet roller wheelslimited lifetime warranty"}