{"asin": "B00170823O", "description": "Dark Voidis a single player sci-fi action-adventure game for PlayStation 3 that is destined to change the way gamers think about third-person shooter combat. An adrenaline-fuelled blend of aerial and ground-pounding combat mechanics and cover systems headlined by the game's signature in-game items--the hooverpack and jetpack--in it players will experience 3D action like never before as they transition from ground to air combat, and back again whenever they choose..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Traditional 3rd-person combat.View larger.And on-command aerial action.View larger.An ancient evil to confront.View larger.StorySet in a parallel universe called \"The Void,\" inDark Voidplayers take on the role of Will, a down on his luck cargo pilot who crashes in the Bermuda Triangle, and is inexplicably transported to the alien dimension which is the mysterious Void. Here this unlikely hero is caught up in a desperate struggle for survival, joining forces with a rebel human group called The Survivors in their struggle against an ancient and hostile race known as the Watchers who have enslaved the humans of the Void for millenia. Will's main goal is to discover a way to get back to his own dimension, but in that he and the humans of the Void have a common enemy, it eventually seems that he may be destined for a higher calling as well.GameplayAction inDark Voidis a combination of aerial dog fighting and third-person ground combat that brings a thrilling new gameplay dynamic to the third-person shooter experience. Ground combat within the game is more or less standard to action in similar games. The aerial portion, is another thing entirely though, and is facilitated by a hooverpack and even more powerful jetpack with a mounted gun that Will is equipped with. Although there are other weapons in the game, these primary weapons allow players to hurtle through the Void at blistering speeds, shooting down anything that gets in their way. Available at anytime in the game after aquired, they epitomize 3D action by introducing a unique vertical combat system full of possibilities and bringing a whole new sense of tension and thrill to the player. In addition, if they so choose players can use their aerial capabilities to counter attacks leveled at them while on the ground and to deal with spatial issues that they may face throughout the game. But just becasue the hooverpack and jetpack are available at all times, this does not mean that they are always the best option. Through trial and error as well as experience with the devices, player's must determine their best uses for each situation.As a companion to its duel combat style,Dark Voidalso contains a duel cover mechanic. As with other aspects of the game's ground combat, players can expect convenient standard cover options, including a single button option to snap to cover against walls, etc. Cover options while using the hooverpack and jetpack are understandably more varied though, with players being able to utilize vertical cover options to shoot both up and down.Key Game FeaturesSci-Fi action/adventure combines aerial and on-foot combat for a totally unique third-person shooter experience.Will&rsquo;s jetpack delives total freedom of movement allowing players to race against UFOs in high-speed chases and rain death from above onto unsuspecting otherworldly foes.Speed and scale unmatched by any other action title: send Will zipping through tight corridors and then out into immense canyons and futuristic geoscapes.Gravity-defying vertical combat system, where moving up is the only way to bring your enemies down.Seemless transition between jetpack flight, ship-to-ship dog fighting and third-person shoot-&lsquo;em-up action all exists within the same level &ndash; not broken up into different areas.Unique grip system that allows the players to scale walls by jumping from surface to surface and hijack UFO&rsquo;s while in mid-air.Huge bosses that require fast reflexes and aerial barnstorming maneuvers to defeat.Developed by Airtight Studios, a new group featuring team members from theCrimson Skiesseries of video games.", "price": 41.27, "imUrl": "http://ecx.images-amazon.com/images/I/51D1PqOKLCL._SY300_.jpg", "related": {"also_bought": ["B002BRZ744", "B000KLNLUK", "B000K9OR4Q", "B000SQ5LQE", "B000R3CIV4", "B005185SDA", "B002BXJ9VA", "B00104KCF8", "B000ZK7ZOY", "B002DC8GKO", "B00319DX4M", "B001D7T2VC", "B007UM599S", "B00320JAWY", "B000ZK7ZOE", "B003DLQTYY", "B004BCZLQ6", "B001PKHRX2", "B0081B1O5A", "B000QAVV6G", "B000JLIYLC", "B001C4DKG4", "B001D5DQL6", "B003O6HAS2", "B004RIACMW", "B000ZK695U", "B004MXM7WU", "B000WJFZEA", "B000HCJD68", "B000V7KLKQ", "B0043QQNXK", "B001KY7GE8", "B000G7X5Q8"], "bought_together": ["B002BRZ744", "B005185SDA"], "buy_after_viewing": ["B005185SDA", "B002BRZ744", "B002DC8GKO", "B00320JAWY"]}, "salesRank": {"Video Games": 17201}, "categories": [["Video Games", "PlayStation 3", "Games"]]}