{"asin": "B001NXDC4O", "description": "With its stylish, curved-back ergonomic design, the 16 GB Cowon S9 Video MP3 player is quite the eye-catcher--and the perfect way to enjoy your favorite movies, TV shows, photos, and music on the go. With the S9 resting comfortably in your hand, you'll enjoy a vibrant 3.3-inch widescreen touchscreen display, Bluetooth support for wireless devices, a voice recorder with built-in microphone, FM radio/recorder, and plenty more, proving that the S9's beauty is way more than skin deep.An eye-catching way to enjoy your favorite movies, TV shows, photos, and music on the go.Click to enlargeorview controls.Song control buttons conveniently placed at the top of the S9.Click to enlarge.The S9's intuitive user interface makes using it a pleasure.Click to enlarge.Freely adjust the zoom with your fingertips.Click to enlarge.Get a quick preview of your videos before you watch.Click to enlarge.3.3-Inch AMOLED DisplayThe S9 boasts a 16-million color, 3.3-inch AMOLED display with a 480 x 272 pixel resolution. Thanks to the low-power display technology, the screen is viewable from virtually any angle. It looks great in the dark and even in direct sunlight. AMOLED turns electric signals into video 1,000 times faster than the speed of conventional LCDs, leaving no ghost images while playing motion pictures.Intuitive Touchscreen InterfaceCowon S9's interface has been optimized for its durable anti-scratch touchscreen, with gesture recognition features like zoom-able album art, pictures, and text; TrueType fonts for clear visibility at any zoom level; and more.Video PlayerThe S9 will play AVI and WMV video files, with codec support for Xvid SP/ASP and WMV9 SP/MP. Enjoy all your favorite clips and shows, and just tilt the unit to switch to 16:9 widescreen viewing.The S9 also makes browsing your content fun and easy. Preview thumbnail images of all your videos before choosing which one to watch. The \"Quicklist\" feature allows you to preview the files surrounding the one being played--check to see the next file in the queue, whether you're enjoying music or video.Finally, the S9 features a composite video out for sending your signal to your television.Music PlayerThe S9 is a full-featured music player with support for MP3, WMA, OGG, FLAC, WAV, and APE formats so you can stick to the format you like.Get detailed track info on the S9's screen with meta tag support, and view LDB 1.0 and 2.0 lyrics files while you listen.The S9's track control buttons are conveniently placed at the top of the device for easy access while carrying in your pocket--perfect for use on the bus or subway.JetEffect Music EnhancementDial in the perfect sound no matter what you're listening to, with Cowon's various enhancement tools:BBE: clarifies musicMach3Bass: enhances low-frequency bass spectrumMP Enhance: restores distorted digital music3D Surround: provides 3D sound effect5-Band EQ: customizable equalizer with adjustable band and bandwidth filterFM Radio and RecorderEnjoy your favorite FM radio programming, using the S9's unique \"jog shuttle\" touchscreen control for selecting stations. Store your favorites in up to 24 user presets, and record live radio for later listening.Photo and Document ViewerView or share slideshows of your favorite JPG images, and read your TXT (text) documents wherever you are.Bluetooth FreedomThe S9 features built-in Bluetooth 2.0 support (A2DP, AVRCP Profile) for use with various wireless devices. Get rid of those cables and enjoy the benefits.Digital Clock with AlarmSet an alarm to play your music or FM radio, and use the sleep timer to drift off to your favorite songs. You also can use the clock to schedule FM recording for a particular time.Voice RecordingRecord voice memos, lectures, meetings, or whatever else you need for later, using the built-in microphone. The S9 also supports line-in recording, for grabbing audio from external devices like CD players.Energy-Efficient EntertainmentThe S9 will give you up to 55 hours of music playback, up to 11 hours of video playback, and up to 350 hours of stand-by sleep mode on a single charge.Flash PlayerThe pre-installed Adobe Flash Player lets you enjoy Flash games and other utilities, along with the Flash content present on many websites.What's in the BoxCowon C9, earphones, USB 2.0 cable, manual CD, and quick start guide.", "title": "Cowon S9 16 GB Video MP3 Player with Touchscreen (Titanium Black)", "price": 34.99, "imUrl": "http://ecx.images-amazon.com/images/I/31Ln5mTDonL._SX300_.jpg", "related": {"also_viewed": ["B007R00TKM", "B00DE14T9U", "B008RK9XTO", "B00826L4G8", "B00826L4GI", "B005TOUS04", "B00E9O6C96", "B008RK9XGW", "B00DE15P0W", "B00DE16F74", "B00J6RVQJM", "B00EPFLJS8", "B004DHOHYQ", "B008Q0LRSK", "B00JD4YX1G", "B00963DPUY", "B00DE1787U", "B00I9E54IM", "B003ES5GWW", "B002JPITXY", "B0053KWDES", "B002JPITY8", "B0041G62VU", "B001V5J4KU", "B002MAPS6W", "B005XQ9WHI", "B001UHOBRU", "B0041G62TW", "B005MJU1QC", "B005P1VMLU", "B004W7EYIQ", "B00ECQUY2M", "B0070UFMOW", "B00EPFIMKQ", "B00JRGLX3G", "B00EE9B3LI", "B00I4Q9S32", "B002MAPSC6", "B002MAPT7U", "B0015L0T68", "B00D648BDA", "B00FF071I4"], "buy_after_viewing": ["B002MAPT7U", "B007R00TKM", "B002MAPS6W", "B00DE14T9U"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}