{"asin": "B000LKZ3GA", "related": {"also_bought": ["B000LKVB6Q", "B000LKVB52", "B00DJZ34TW", "B002FWTEYY", "B000LKZ3I8", "B000ZT12NK", "B0083GG4E4", "B002HI4PEK", "B0073I366M", "B00CGIRF8E", "B000JIN1H2", "B003V5V5J6", "B002E0S4UW", "B00503DQIA", "B004054PUM", "B00CFIDZZM", "B003SBZF1W", "B003JU9BBW", "B007P5T3Y2", "B00JW98SJK", "B004IRSSHI", "B003BLDTPS", "B003GADAN0", "B000CQ4D50", "B0019KCUMG", "B00FTC7BVK", "B003CN34VO", "B00196P9QO", "B000ARPKBM", "B006GKKO4A", "B001PICX42", "B00CEEYPOC", "B008XV6WTG", "B000TYF4DA", "B0045E0CCI", "B001M0G1XW", "B000ARPKBW", "B003ZXEBOK", "B005LUX3AI", "B001V76MFS", "B003GBEZBA", "B000FF9DV2", "B001PFK3UQ", "B0041MW7JK", "B003H694TC", "B004CQWWKY", "B002R5ARN6", "B0012JNRKS", "B0089PYRX4", "B00C5T5V7Q", "B0088W8HKC", "B000CONM86", "B000LTIDR2", "B00BJ6DZE2", "B007UZNS5W", "B009LHSWKS", "B00ASBOP9S", "B000AS1LH8", "B008JKU2CO", "B000KGW2BY", "B0041BSZGA", "B0073H4Q2G", "B000CS9ZWO", "B00C3YQ2LW", "B001BM4N72", "B00HC7639Q", "B001FA1LW0", "B008JA7FHO", "B001V78QZW", "B000CQ6KUG", "B001HTI5XC", "B005067TT4", "B001HTE5L8", "B007PE7ANY", "B0055WL2D2", "B00437CBWG", "B000E158ES", "B000DZDJM8", "B007EC857C", "B003LPMC3O", "B0032ZB03G", "B00HFQ2T06", "B000EQYSLC", "B000LL0R8I", "B008JKUBZM", "B001RVFDOO", "B00CIX6P1U", "B003ZXE80M", "B0081RNC4A"], "also_viewed": ["B002FWTEYY", "B000LKVB52", "B0073I366M", "B000LKVB6Q", "B0019KCUMG", "B00DJZ34TW", "B002HI4PEK", "B000ZT12NK", "B000LKZ3I8", "B001HTR4WA", "B001FA1LW0", "B00EENE5SM", "B004054PUM", "B0083GG4E4", "B00503DQIA", "B0019K981W", "B00FTC7BVK", "B0053HISDG", "B00CGIRF8E", "B000YAFJZW", "B0051G7M22", "B003ZS6CXS", "B00B7388J4", "B00CFIDZZM", "B00IXVCW8G", "B00CVU9HAG", "B007P5T3Y2", "B001I0X97M", "B006OBWHDW", "B00I4K42AM", "B00CHTV3J4", "B00112Z6G4", "B003GADAN0", "B009LHSWKS", "B00196P9QO", "B002E0S4UW", "B002N4AUH4", "B00H02HB76", "B004UB832C", "B00FTC3AG0", "B003SBZF1W", "B00IWOFB6Y", "B003V5V5J6", "B000CSEFQ0", "B00HABXKOA", "B003GBEZBA", "B004X4RVNI", "B003JU9BBW", "B00CHTUIX6", "B004L46ENS", "B00AEDZ2EM", "B001U00GBC", "B0052T7IK4", "B00JXNT7JK", "B0012C0X3O", "B001V76MFS"], "bought_together": ["B000LKVB6Q", "B002FWTEYY"]}, "title": "Horizon Organic Low Fat Milk, Chocolate, 8-Ounce Aseptic Cartons (Pack of 18)", "price": 28.49, "salesRank": {"Grocery & Gourmet Food": 5502}, "imUrl": "http://ecx.images-amazon.com/images/I/51Y0AgPBcfL._SX300_.jpg", "brand": "Horizon Organic", "categories": [["Grocery & Gourmet Food"]], "description": "Horizon Organic is committed to the long-term success of the organic community. We are passionate about the health of our families and our environment. We support family farmers and promote animal stewardship. Our strict and unwavering adherence to upholding the rigorous organic standards is a cherished part of our heritage. Organic is all we've done and it's all we'll ever do. It is with pride that we provide you with the best, great-tasting organic dairy products that make it easy for you to make a healthy difference in your life today and in the future.Horizon Organic was America&#x92;s first nationally distributed organic dairy brand. Since it was founded in 1991, the company has been a pioneer in the organic movement. Today, as the organic industry evolves, Horizon Organic continues to lead with insight, integrity and unwavering commitment to organic principles.Company Overview:Founded in 1991, Horizon Organic was America&#x92;s first national organic dairy brand.Together with other industry leaders, our founders played a key role in helping to develop the National Organic Standards and the USDA Organic Seal.We have pioneered practices for organic dairy farming and land stewardship, and are privileged to work with some of the industry&#x92;s top experts in land conservation, organic agriculture and animal welfare.Toward a Cleaner Planet:Our Idaho dairy was the first large certified organic dairy in the country, and now supports more than 30,000 organic acres (including the cropland supplying feed to our operations).On our Maryland farm, our organic practices have transformed previously mismanaged land with dangerously high phosphorous levels into permanent organic pasture.We sponsor numerous non-profit and trade organizations devoted to organic agriculture and related environmental causes: Farm Aid, Midwest Organic and Sustainable Education Service (MOSES), Help Wanted Organic Farmers Campaign, The Organic Center and others.We have been recognized with an EPA Green Power Partnership Award for our support of renewable wind energy.Support for the Family Farm:Through the Horizon Organic Producer Education (HOPE) program, we recruit and support hundreds of organic family farms across the country.80% of our milk is supplied by 363 certified organic family farmers from 18 states across the country. The balance of our milk comes from our two certified organic dairies in Idaho and Maryland.228 additional family farmers are in the process of converting to organic through the HOPE program.Farm Animal Welfare:On our company-owned farms and the farms of our partners, all of the animals that supply Horizon Organic milk enjoy the holistic benefits of organic management practices:A preventive approach to healthcare that minimizes illness by providing a sanitary environment, proper nutrition and compassionate, attentive daily care.Room to roam outdoors and to display natural behaviors.A 100% vegetarian, certified organic diet of active grazing during the growing season, supplemented by certified organic feed."}