{"asin": "B00007LVJD", "description": "InCommand & Conquer: Generalsgamers choose from three radically different fighting forces, build an army from the ground up, and seek out and destroy opposing players' armies and bases. Your three choices are the USA, the Chinese, and the Global Liberation Army (a group of freedom fighters/terrorists). Each force has unique strengths and weaknesses; Generals does a good job making the three forces differ in more than aesthetics. The USA has costly but technically advanced units along with a stunningly powerful Air Force, the Chinese have weak but cheap ground units that gain advantages when attacking in large groups, and the GLA has a ramshackle army that relies on stealth. Each force caters to a completely different style of play, and playing around to find the group that you'll like the most is a lot of fun.One of the game&#x92;s most important innovations is the Generals point system. This system allows both the player and his units to gain experience points for each enemy kill. Experienced units will become hardier and more dangerous, and the player will gain points to spend on new technologies or special attacks. Each force has its own selection of bonuses you can purchase in this manner, and more experienced generals have access to increasingly powerful items.Generalsis the first title in the Command & Conquer franchise to go fully 3-D, and it looks absolutely gorgeous. All of the models and environments in the game look really good, and it's both cool and useful to rotate the camera around to get different perspectives on the battlefield.  The tradeoff here is thatGeneralshas extremely high system requirements, and you're going to have to go evenhigherthan the posted minimum if you want consistently smooth gaming performance. In fact, you're probably going to have noticeable slowdowns if you're not running approximately the equivalent of a 1.5GHZ processor and a GeForce 3 or better.Ever since the release of the firstCommand & Conquergame in 1995, the C&C; franchise has practically defined real-time strategy gaming.  With a half dozen original titles and a handful of expansion packs released on a multitude of gaming platforms, any new C&C; game has some seriously large boots to fill.  Fortunately for gamers,Command & Conquer: Generalshas not only met those previous expectations, but raised the bar once again.--Jon \"Safety Monkey\" GroverPros:Great looking, fully 3-D graphicsAll 3 races are fun, yet fully distinct from each otherInnovative Generals point systemFun single-player campaigns; exciting multiplayer over Internet or LANCons:Very high system requirements", "price": 99.99, "imUrl": "http://ecx.images-amazon.com/images/I/515X9W3YCZL._SY300_.jpg", "related": {"also_bought": ["B0000C0YNT", "B0009FTMH8", "B001FLGEEE", "B000MG3LDA", "B0016BVY7U", "B0009J1JIY", "B000FJSIUA", "B0000CE1GK", "B002SKDIKE", "B000CPKIT6", "B002NIP6X8", "B000FUONLM", "B000E2D3LC", "B000SOYG8U", "B000J18SR2", "B0007GBBHI", "B00BQZ5F6C", "B0002L88HE", "B0006FZUH2", "B00004S653", "B00005A3I5", "B001RQWJ2S", "B00273Y7V6", "B0000CE1J2", "B0026EGO3A", "0761543554"], "buy_after_viewing": ["B0000CE1GK", "B000CPKIT6", "B0000C0YNT", "B001FLGEEE"]}, "salesRank": {"Video Games": 9261}, "categories": [["Video Games", "PC", "Games"]]}