{"asin": "B002FL4WYW", "description": "MaximalPower, Sold and Shipped by Amazon Direct, do not buy from any other 3rd party Sellers as products may be counterfeit. The Amazon.com is the only legal distributor for maximalpower.  Maximalpower DB PAN DMW-BCG10 Lithium-Ion battery for DMW-BCG10 Li-Ion Rechargeable Digital Camera Battery for Panasonic Lumix DMC-ZS1 DMC-ZS3 DMC-TZ6 DMC-TZ7 Compatible Models: Panasonic Lumix Digital Cameras &#x2013; DMC-ZR1, DMCZR1, ZR1, DMC-ZR3, DMCZR3, ZR3 DMC-ZS1, DMCZS1, ZS1, DMC-ZS1A, DMCZS1A, S1A, DMC-ZS1K, DMCZS1K, ZS1K, DMC-ZS1R, DMCZS1R, ZS1R, DMC-ZS3, DMCZS3, ZS3, DMC-ZS3K, DMCZS3K, ZS3K, DMC-ZS3S, DMCZS3S, ZS3S, DMC-ZS5, DMCZS5, ZS5, DMC-ZS6, DMCZS6, ZS6, DMC-ZS7, DMCZS7, ZS7, DMC-ZS8, DMCZS8, ZS8, DMC-ZS10, DMCZS10, ZS10 DMC-ZX1, DMCZX1, ZX1, DMC-ZX3, DMCZX3, ZX3 DMC-TZ6, DMCTZ6, TZ6, DMC-TZ6A, DMCTZ6A, TZ6A, DMC-TZ6K, DMCTZ6K, TZ6K, DMC-TZ6R, DMCTZ6R, TZ6R, DMC-TZ6S, DMCTZ6S, TZ6S DMC-TZ7, DMCTZ7, TZ7, DMC-TZ7K, DMCTZ7K, TZ7K, DMC-TZ7S, DMCTZ7S, TZ7S DMC-TZ8, DMCTZ8, TZ8, DMC-TZ10, DMCTZ10, TZ10, DMC-TZ18, DMCTZ18, TZ18, DMC-TZ19, DMCTZ19, TZ19, DMC-TZ20, DMCTZ20, TZ20. Made with Info-Chip, Fully Decoded, Use same as original. Shows time on LCD and charges. Maximalpower is trusted for its true capacities and high reliability, we back our products for 3 years warranty and 1 million us dollar liability insurance.", "title": "Maximalpower PAN DMW-BCG10 Battery for Panasonic", "price": 14.99, "imUrl": "http://ecx.images-amazon.com/images/I/41eXRNUduCL._SY300_.jpg", "related": {"also_bought": ["B002XFW62U", "B0034E2CNC", "B003WFWVSO", "B004GWJAF4", "B002KTL706", "B00728ZBA2", "B003VNKNEQ", "B001QFZMCO", "B005QEKYPQ", "B0049V0ZX8", "B0034E5ZMW", "B0073N2CTO", "B004KKZ0HE", "B00695S8VS", "B003EENZVK", "B005HNF01O", "B00814CAS2", "B00728ZBC0", "B004KKZ0HY", "B005QEKZRI", "B002W7RHOG", "B00E0HGMOC", "B003VNKNF0", "B003VNKNEG", "B003F7DWH8", "B002VEBZ48"], "bought_together": ["B003VNKNEQ"], "buy_after_viewing": ["B0049V0ZX8", "B0029ZA78O", "B003EENZVK", "B00E4T8XZC"]}, "categories": [["Electronics", "Camera & Photo", "Accessories", "Batteries & Chargers", "Batteries", "Camera Batteries"]]}