{"asin": "B000HCRVSK", "description": "Leading-edge performance, comfort, and style. Take advantage of all your PC's great media and communication capabilities in first-class comfort and style. Working with Windows Vista, the Cordless Desktop MX 3200 Laser makes it easy to access advanced features such as Dynamic Search and DocFlip. Enjoy ultra-precise navigation with the high-resolution laser mouse, and easy Internet call management with convenient one-touch controls.&nbsp;Enjoy premium comfort.Integrated soft-touch palm rest provides extra support and can help reduce fatigue.Benefit from a superior typing experience.The straight keyboard layout, featuring Zero-Degree Tilt, offers an extremely comfortable and natural typing experience. Full-travel keys maximize comfort, respond instantly, and are extremely quiet.Get down to the pixel.Logitech high performance laser mice track better on more surfaces. The sculpted design of the mouse fits comfortably in your hand.Features&nbsp;&nbsp;Dynamic search and zoomFind files faster. Use the touch-sensitive slider to explore Windows Vista folders and images quickly and precisely.&nbsp;Programmable hot-keysConvenient hot-keys instantly open applications, games, folders, or web pages. To customize, simply hold down the desired hot-key with a long press.&nbsp;High-performance laser mouseState-of-the-art laser technology delivers exceptional precision and control. Gently contoured sides and soft rubber grips offer enhanced support and comfort.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ready for Windows VistaThe &quot;Start&quot; key lets you get the most out of Windows Vista.&nbsp;One-touch Internet calling controlsAccess your favorite Internet calling application and start or end a call with a single touch.&nbsp;Integrated soft-touch palm restProvides premium comfort for extra support and can help reduce fatigue.Reliable, hassle-free wireless technology&nbsp;With Logitech SecureConnect&trade; technology, your keyboard and mouse have been pre-connected to the receiver to ensure hassle-free set-up and secure keyboard encryption right out of the box. The Plug-n-Play USB mini receiver provides added convenience for notebook computers.&nbsp;Extended battery life&nbsp;Sophisticated power management technologies mean that batteries can last up to 15 months for the keyboard and up to 6 months for the mouse. The convenient LED battery indicators flash when batteries need changing. The mouse features an On/Off switch to extend battery life even further.Mouse with Tilt Wheel plus DocFlipScroll horizontally or vertically. Click the wheel to move effortlessly between documents in 3D with Windows Vista. It has never&nbsp;been easier to cut and past between applications, compare documents, or check email.Informative built-in LCD&nbsp;Time, date, battery status and other great information is at your fingertips.One-touch searchFor quick and easy searching.System RequirementsPC with Windows XP, or Windows Vista1 available USB portCD-ROM drivePackage ContentsLogitech MX 3200 Cordless KeyboardLogitech MX 600 Laser Cordless MouseSecureConnect USB mini-receiver6&nbsp;AA alkaline batteriesCD with software, comfort guidelines, and help centerInstallation guideFull product support&nbsp;5-year limited harware warranty", "title": "Logitech MX3200 Cordless Desktop Laser (Black)", "price": 69.99, "imUrl": "http://ecx.images-amazon.com/images/I/4111NXCF2WL._SY300_.jpg", "related": {"also_bought": ["B0011FQUQG", "B0036E8V08", "B00CYX26BC", "B002RRPDA6", "B003VAHYNC", "B000A6PPOK"], "buy_after_viewing": ["B0036E8V08", "B003VANO7C", "B002HWRJBM", "B003VAGXZC"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Keyboard & Mouse Combos"]]}