{"asin": "B00585CLSQ", "related": {"also_bought": ["B00470C35E", "B00585CLR2", "B00F3F09NU", "B004M8ST3Q", "B002CQTYI4", "B004IMCVW6", "B00K5M6ARA", "B00G3ZI0UI", "B00FF1QNGY", "B00JAUKFRE", "B00C31MF0W", "B003XNOJEO", "B00A86QWN0", "B008L3JEQY", "B008U1MOM8", "B00I3W6FR4", "B004LHAW38", "B0098V1GDM", "B00I4I92C2", "B0088U6OZY", "B0035Y7ZJ2", "B00G6TPCN4", "B00J0NW4FW", "B006M49G80", "B00BR3O4CE", "B008L3KKBW", "B0077SL8GS", "B00DH1YFD2", "B0051S8SBO", "B00BAQKTOU", "B004VG6LDE", "B007TV88F2", "B009D9KP40", "B006VY8C6S", "B005NLQAHS", "B00G2BX616", "B00AOIM2CC", "B007TYUUPK", "B00I0DL2OC", "B0063N7OZ2", "B0076KBPNI", "B00542XWXG", "B00LJV9XR0", "B000WEMH4G", "B000I1EFKM", "B000CKVOOY", "B0085S0838", "B009O22ZH6", "B009QZH6JS", "B00F0IQTE8", "B00IBDOB5I", "B008AJNF78", "B00J3N7FRQ", "B00APLOM62", "B00FQ9IH3M", "B006SU0SX0", "B00H1OQYIA", "B009LY0LKU", "B009O4BXGS", "B0006IUW8G", "B006NZTZLQ", "B00ED4UAOA", "B0002BGELQ", "B009CCOI9Q", "B00065WPP2", "B004ETK0AI", "B00JNJPS4W", "B003O1UYHG", "B00B8M4IMK", "B001MSU1FS", "B00CBSGYZ4", "B00AOCSFYC", "B00755JMYS", "B00IL1DJCQ", "B00BCOHYNO", "B008UH8SRM", "B009SJR28W", "B0044BBOQK", "B007WTAJTO"], "bought_together": ["B00470C35E"], "buy_after_viewing": ["B00F3F09NU", "B00F0IQTE8", "B00EHQMZ6K", "B00A86QWN0"]}, "title": "Arkon Seat Rail Floor Car Truck Mount with 18 inch Gooseneck for iPad Air iPad 2 Samsung Galaxy Note 10.1 Galaxy Tab Pro 12.2", "price": 34.84, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41LqT6EJoCL._SY300_.jpg", "brand": "Arkon", "categories": [["Electronics", "GPS & Navigation", "GPS System Accessories", "Vehicle Mounts"]], "description": "The TAB-FSM car or truck seat rail floor mount can be used with all large tablets up to 10.1 inches in screen size, including the Apple iPad Air and iPad 4, 3, and 2, Samsung Galaxy Note 10.1, Galaxy Note Pro 12.2, Galaxy Tab Pro 10.1, and Galaxy Tab Pro 12.2, Kindle Fire HD 8.9, Google Nexus 10, and Sony Xperia Tablet Z. This mount package includes Arkon&#x2019;s Slim-Grip Ultra Universal Tablet Holder and a seat rail floor mount with 18&#x201D; flexible aluminum gooseneck. The tablet is held securely in place with the Slim-Grip Ultra spring-loaded holder, and can be inserted or removed from the mount with one hand. Included with the holder are 8 support legs (4 short and 4 longer versions). The top and bottom adjustable-leg design of the holder helps keep any side buttons and ports unobstructed. For most devices, the best mount holder configuration is to attach 2 short support legs on top and the 2 long support legs on the bottom of the holder. The car seat rail or floor mount is made of strong aluminum, and is ideal for those who need easy access to their tablets but prefer mounting them somewhere other than the windshield or dashboard. Use a socket wrench to install the mount to the car&#x2019;s seat rail. Loosen the passenger seat track bolt, insert the included seat track bolt bracket, and then retighten the bolt. Bend the 18&#x201D; gooseneck and rotate the swivel ball adapter head for 360&#xB0; rotation for exact positioning of the cell phone. Optional floor brackets are included for screwing the car dock directly into the floor of the vehicle. (Warning: Drilling into the vehicle&#x2019;s floor may damage the vehicle. Use caution and consult a mobile install professional to avoid drilling into any sensitive vehicle components.)"}