{"asin": "B003VJNPPE", "description": "In BriefThe second instalment in the RPG saga about the Witcher, Geralt of Rivia, features a thoroughly engrossing, mature storyline defining new standards for thought-provoking, non-linear game narration. In addition to an epic story, the game features an original, brutal combat system that uniquely combines tactical elements with dynamic action. A new, modern game engine, responsible both for beautiful visuals and sophisticated game mechanics puts players in the most lively and believable world ever created in an RPG game. A captivating story, dynamic combat system, beautiful graphics, and everything else that made the original Witcher such a great game are now executed in a much more advanced and sophisticated way.DEVELOPER: CD Projekt REDBrief Story DescriptionAfter helping to stop the rebellion undertaken by the Order of the Flaming Rose and saving King Foltest&rsquo;s life, Geralt became one of the central figures of political turmoil in the Kingdom of Temeria. Geralt continues to protect the King in the monarch&rsquo;s mission to bring peace to his state. The last bastions of the Order yielded to the royal army. The only remaining task is to pacify the rebellious castle of Baroness La Valette, who announced separation from the Kingdom. It&rsquo;s been a month since the attempted assassination of the king, when his army arrives at the gates of Baroness La Valette&rsquo;s fortress in preparation for the final battle. In the meantime, Geralt, stuck with Foltest, cannot begin his personal quest - to discover the origin and identity of the mysterious witcher-like assassin responsible for the attempt on the king&rsquo;s life - a quest that would answer many questions...Key FeaturesA truly epic, intense, emotionally charged adventure with non-linear game narration. Three independent plot lines with several alternative events are dependent on the player&rsquo;s choices and lead to multiple different game endings and several additional plot forks. This time gameplay time will be shorter than The Witcher 1, but more intense and packed with events.A complex, realistic and mature story touching upon subject matter seldom seen in other RPGs, told in a manner that is understandable and attractive to contemporary gamers. We investigate the assassinations of the rulers of the Northern Kingdoms and follow Geralt&rsquo;s personal theme, in which he&rsquo;s looking for his own identity. Gradually we learn how powerful forces influence our situation and what role they order us to play.Rich, mature dialogue as found in Andrzej Sapkowski&rsquo;s book series and The Witcher 1, presented in highly filmic cutscenes and dialogues sequences, thanks to a new game engine.New, improved system of flashbacks. Now the reminiscences of Geralt, in which we observe the link between our past choices with current actions, are realistically and smoothly woven into the gameplay.Sex and eroticism will be introduced in a much more realistic, involving and mature way, thanks to which sexual relationships are presented more credibly than in TW1.Unique, deep, consistent and rich game world established in a series of best-selling books by A. Sapkowski and recreated in the game to provide an incredible, believable story-driven experience.Believable, true-to-life characters with their own motivations and goals. During our journey we meet ordinary men, soldiers, rebels, powerful mages, rulers and their assassins. Depending on our decisions we meet different game characters, and our relationships shape further actions in the game.Highly varied, breathtaking locations, which thanks to the new engine create a cohesive, fully accessible world!Rich, living world in which every character has their own way of life and unique occupations. Our actions modify the relationship with the game-world population and, in the case of the main plot line, open or close the possibilities of interaction with the game world.Greater freedom of exploration to provide increased game realism and a wider range of new tactical options. Geralt will surmount barriers, jump over fences, scale walls and ascend rock formations.Premium Edition ContentsGAME DVDThe Witcher 2: Assassins of Kings game DVD.MAKING-OF DVDAll the cinematic materials related to game - trailers, dev diaries, gameplay footage, interviews and making-of exclusive video.OST CDAudio-CD with in-game music.ETUIBox with all the contents of The Witcher 2 Premium Edition.WORLD MAPA map of the game's world.GAME GUIDEThe Witcher 2 strategy guide for both novice and experienced role-playing fans.GAME MANUALA rulebook and interface explanation to help you get started.PAMPHLET AND COINA physical representation of one of the in-game items.PAPERCRAFTSTwo papercraft dolls - Geralt and one random character for collectors.DLCExtra in-game feature for download: The Ultimate Swordsman SuitSystem RequirementsMinimal Requirements:CPU: Dual-Core, 2,2 GHz.RAM: 1 GB (Windows XP), 2 GB (Windows Vista / Windows 7)GPU: nVidia GeForce 8800 / 512 MBOS: Windows XP / Windows Vista / Windows 7", "price": 17.32, "imUrl": "http://ecx.images-amazon.com/images/I/51fY9yaB%2BtL._SY300_.jpg", "related": {"also_bought": ["B001AH8YSW", "B000R2XJJK", "B002I0HKRQ", "B0044S8DA8", "B002V1GFHS", "B005C2D2H4", "B0047THYWC", "B004FYKWZU", "B0045ZB66I", "B001VJ4DHK", "B002I0IHIM", "B004HYIAPM", "B004H80TUC", "B002I0JJAW", "0804162972", "B002BS47YE", "B002V14VOC", "B003FSFSEW", "B00FUC6SZY", "B001B5U80K", "B00FB3UPB0", "B001IK1BWC", "B0065NP39E", "B005OGYVKU", "B003EZ1KGQ", "B00BU3WUU4", "B007TRXBJY", "B0050SZ836", "B0050SWTS8", "B003L8DXS4", "B002I0KO8I", "B002I0KOSI", "B005XFGZ4W", "B006P5RW3M", "B000FGA1US", "B002BXKJA0", "B000A76ZNO", "B00178631E", "B0050SZ0SY", "B001E8QA2E", "B00CJ7IUIQ", "B003P9C6EQ", "B003ICGL7I", "B0079NGSDO", "B009LWQ0H0", "B005G4CXPK", "B005EZ5GQO", "B003TIVSM4", "0307894622", "B00178630A", "B003GSZAOY", "B000SKWLLI", "B000WCCURW", "B003ZULWQI", "B004QEWVTO", "B00JB4WHWU", "B003BU77P2", "B00JUFT3I6", "B002I7KJ5O", "B002I0HJ68", "B001O4YSTU", "B00140P9BA", "B0012LGHZI", "B001Q96ZNU", "B001F0L81O", "B004FUGKSW", "B0016BVYAM", "B004ML9WKC", "B002C0VNQQ", "B00F4H2O6W", "B001UWGDPS", "B000E66CAM", "B001E2I4H4", "B001QRWE14", "B001TOQ8R0", "B002I0HJZO", "B002I0JAJ2", "B004M8FUMO", "B0013RC1W4", "B0058NY622", "B002I0HFNU", "B002I0JLEQ", "0744015421", "B00ERDGMSA", "B0001X5YN4", "B003O2182A", "B000ZKA0J6", "B004QRKWLA", "B00BMFIXZG", "B006ZPAXYW", "B007X1458W", "B007TGHM54", "B0010EK3SE", "0700099867", "B004DDIYP8", "B008IYCVK2", "B007H2V9W2", "0316029181"], "bought_together": ["B001AH8YSW"], "buy_after_viewing": ["B006P5RW3M", "B001AH8YSW", "B00ICWO1XA", "B004CJ8YTO"]}, "salesRank": {"Video Games": 13727}, "categories": [["Video Games", "PC", "Games"]]}