{"asin": "B000A5K5MI", "description": "The King of All Cosmos grew to stardom after taking all of the Prince's katamaris and replacing the stars. His fans knew no bounds and wished to see more katamaris fill the sky. The King of All Cosmos desired to appease all of their requests and recruited the Prince and his cousins to help. Now they are tasked with rolling up even more clumps, each larger and more different than the one before.Play as the Prince or as any of his cousins to complete the tasks given to you by the King's many fans. Travel to new locations and experience the great gameplay that helpedKatamaricapture the hearts of gamers everywhere. Bring a friend to share the joy with the new two-player co-op mode. Enjoy brand-new objectives while creating the biggest and best katamari ever.Features:The award winning gameplay returns. The quirky gameplay that captivated the gaming world returns as you continue to roll up anything and everything that gets in your way!Conquer the new levels with gusto. Experience all new levels and objects during the Prince's travels around the world. From rolling up starfish under the sea to picking up the Eiffel Tower, Katamari brings players to great new locations and sets them free to pick up anything and everything!Rolling is more fun with a friend. Share in the fun as you experience every level with a friend in the new two-player co-op mode.Roll up your friends in the new Battle mode. Make the world your battleground with an expanded Battle mode featuring three different stages.", "price": 16.98, "imUrl": "http://ecx.images-amazon.com/images/I/51fkjf1G1QL._SY300_.jpg", "related": {"also_bought": ["B0002Y2XXQ", "B000P297JI", "B0028A6UUY", "B000BLFE9K", "B00004YRQA", "B00KVRK39A", "B006FRNBB2", "B00004YRQ9", "B000066TS5", "B00005R5PO", "B000TLU67W", "B0000690ZE", "B00KWFY04A", "B0009A4EVM", "B000CFWHPY", "9629971372", "B003IOGPAO", "B00004TNB0", "B00005MA97", "B0009Z3K12", "B00009WAUB", "B0009XBWY6", "B006L1FAK2", "B000R3K4CE", "B00019HNNC", "B00009WAUK", "B0045L3SNQ", "B00184219U", "B00008VFBV", "B008CP6RWU", "B00GANWVJE", "B001AMTH1A", "B001G3B0HC", "B000UZVL9Y", "B000CC5J52", "B003ZCH7DI", "B006JKARU8", "B007A7UJ4S", "B0002EJ8FC", "B00007LV7Z", "B000641ZC2"], "buy_after_viewing": ["B0002Y2XXQ", "B0028A6UUY", "B000P297JI", "B000BLFE9K"]}, "salesRank": {"Video Games": 4193}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "More Systems", "PlayStation 2"]]}