{"asin": "B000X24ISU", "description": "Corsair Memory 650 Watt TX Series Power Supply The Corsair TX650W power supplies are engineered using advanced technology and components typically found with high performance power supplies. With design features such as a dedicated, single +12V rail offer the maximum compatibility with the latest system components. Energy eficient  circuitry capable of delivering greater than 80% eficiency ratings across 20%, 50%, and 100% load conditions make the TX family of PSUs is ideal for the value/quality consciousenthusiast. With a large 140mm (120mm on TX650W) diameter temperature-controlled fan that is ultra quiet, yet still more than suficient to cool the internals of the system, reliability and stability are no longer worries for the gamer, overclocker or enthusiast and high-end system builder. Features: * Supports ATX12V v2.2 standard and olderATX12V 2.01 spec * Ultra-quiet 120mm (140mm on TX750W) double ball-bearing fan delivers excellent airflow * 80%+ energy efficiency at 20%, 50% and 100% load condition for less heat generationand lower energy bill * 99% Active Power FactorCorrection provides clean and reliable power toyour system * Universal AC input 90264V automatically scans and detects the correct voltage *Dedicated single +12V rail offers maximum compatibility with latest components * Over Current/Voltage/Power Protection, Under Voltage Protection, and Short Circuit Protection provide maximum safety to your critical system components * Highquality capacitors provide uncompromised performance and reliability * Extra long cables support full tower size chassis * Dimension: 5.9\"(W) x3.4\"(H) X 5.9\"(L); * MTBF: 100,000 Hours", "title": "Corsair CMPSU-650TX 650-Watt TX Series 80 Plus Certified Power Supply", "price": 123.46, "imUrl": "http://ecx.images-amazon.com/images/I/51eOxQZ-4YL._SX300_.jpg", "related": {"also_bought": ["B00CO8TBOW", "B006EWUO22", "B00CRJSV9O", "B00CO8TBNS", "B00DHW4HXY", "B0033Z2BAQ", "B0036Q7MV0", "B00DBPKEOI", "B00966IREK", "B007SZ0E1K", "B007SZ0EOW", "B009O7YUF6", "B006I2H084", "B004QBUL1C", "B0088PUEPK", "B0000X0VCY", "B005T3GRNW", "B005O65JXI", "B004Q0PT3I", "B009NHAF06", "B004CRSM4I", "B00B2HH7G0", "B001FVI91U"], "buy_after_viewing": ["B0033Z2BAQ", "B0092ML0OC", "B005O65JXI", "B00E3W1726"]}, "categories": [["Electronics", "Computers & Accessories", "Computer Components", "Power Supplies"]]}