{"asin": "B0009PETYO", "description": "The Matrix: Path of Neofollows the story of the blockbuster motion-picture trilogy The Matrix, The Matrix Reloaded, and The Matrix Revolutions, and for the first time allows gamers to play as Neo and become \"the One\".Gamers play as Neo, but from the moment the game begins, how the situations play out, how they handle them, how they deal with the events, where they go, how people react to them--it's all up to the gamer. They may win where Neo failed or find another way to solve the problem--the path is now theirs to follow.As Neo, the choices the player makes to resolve each scenario and the resulting consequences may have a different result than the original films. Alternative scenarios filled with new characters, content, and storylines have all been written and planned by the Wachowski Brothers to expand the Matrix universe and overall gaming experience.Gamers assume the role of Neo from when, as Thomas Anderson, he gets the cell phone in the package from Morpheus, to the flying street battle in the rain against Agent Smith.Read codes, fly, run, and jump off wallsDodge bullets and master martial artsExperience true in-game Matrix physicsFeatures:Once again blurring the lines between Hollywood and interactive entertainment,The Matrix: Path of Neofeatures the likenesses of all of the films&#146; key actors--including Keanu Reeves (Neo), Laurence Fishburne (Morpheus), Carrie-Ann Moss (Trinity), Hugo Weaving (Agent Smith), and Jada Pinkett-Smith (Niobe).To truly immerse the gamer in the Matrix universe, the game features a \"Director&#146;s Cut\" of the original movie footage from all three films and The Animatrix as cinematic sequences to progress the story told from Neo&#146;s perspective. An exclusive toThe Matrix: Path of Neo,the footage was edited by Zach Staenberg, the Academy Award winning editor of The Matrix working side by side with the Wachowski Brothers.Re-creating the incredible ambience of being in the Matrix,The Matrix: Path of Neofeatures a full orchestral score playing in surround sound, developed to follow the action of the game. In addition, the games&#146; soundtrack features original songs by the bands that were featured in the Matrix films.Use martial arts, medieval weapons, and guns (lots of guns) to take on a variety of enemies, such as heavily armed SWAT officers; agents of the Matrix, including Agent Smith; and Exiles in the employ of the Merovingian. To help prepare for these battles, there are several training levels which Neo must complete.Enhanced \"Bullet Time\" special effects from the films; dodge bullets, jump off walls, and defy gravity and logic to recreate most memorable scenes.To re-create Neo&#146;s incredible range of movesThe Matrix: Path of Neoalso features a more sophisticated martial arts engine to give gamers the true feeling of being \"the One\".", "price": 15.0, "imUrl": "http://ecx.images-amazon.com/images/I/51B85V8KWXL._SY300_.jpg", "related": {"also_bought": ["B000088KH1", "B000099T2G", "B0007SL1ZI", "B00009VE6D", "B0000B0MNH", "B0001I9YHG", "B00006GSNZ", "B0009O7HVW", "B0009O7HVM", "B00008DHNL", "9629971372", "B0009351PM", "B0001AVZ5I", "B000TLU67W", "B0007PLKZM", "B0009R1T9K", "B0009SQF0C", "B00004YRQA", "B000FW4YOQ", "B0007OSLAA", "B00005U8TQ", "B000CQ75VY", "B00020V5B6", "B000095ZH5", "B0009351R0", "B00005CF9L", "B0002CNUN0", "B0009Z3HXI", "B00097CYZS", "B00008XKZZ", "B000UH6GEM", "B0006ZJPR8", "B000296DZ0", "B0002IQD1U", "B00019HNNM", "B000G6SPHI", "B0000A92KX", "B000930DOQ", "B00004YRQ9", "B000GPVUQ2", "B000067DPL", "B00009WAVD", "B001CLG6SG", "B00020BV2E", "B000FUUD8O", "B0009H7UJI", "B000F1YI3E", "B00005V6BE", "B0002ZHDCG", "B0009EHQVI", "B0008JILX6", "B0000C7GHG", "B0000A8VBZ", "B0009I6S0O", "B0000TSRA6", "B000RW3V34", "B0001ADAME", "B000NJH6PU", "B0009RG8DW", "B0006I5FL0", "B000E49SGE", "B00005OLX1", "B00005NN5A", "B002E1LIR2", "B00019AZBO", "B000066TS3", "B00006C28V", "B0009Z3HMY", "B00005ML10", "B001MW91IW", "B0002XL3BA", "B000088KH9", "B000GDJJQ2", "B0000AHOOK", "B0007ULFL6", "B000AS20D2", "B0009R1SZ0", "B0009HAYDC", "B000QB059Y", "B00006Z7I3", "B00009KO3L", "B000F0GX8I", "B0000A082Y", "B0009Z3HYW", "B0009R1SRI", "B0009JB4IY", "B000067DPC", "B0002RQ3ES", "B000HAUODG", "B0002CHJ64", "B000066TS5", "B0000A30R8", "B00008KUA8", "B000OPPBEQ", "B00009ZVHY", "B000B0RWWS", "B0009A4EVM", "B0011BE3KA"], "buy_after_viewing": ["B000088KH1", "B0008JILX6", "B000099T2G", "B000TLU67W"]}, "salesRank": {"Video Games": 11346}, "categories": [["Video Games", "More Systems", "PlayStation 2", "Games"]]}