{"asin": "B001RNNXQM", "description": "Wirelessly play your computer's audio; play and charge your iPod or iPhone; and enjoy crisp, immersive, room-filling sound with the Mint Studio. Combining the Mint Studio speaker system with its iPod/iPhone dock, the Mint USB Wireless Audio Transmitter for PC or Mac, and a handy remote control, the Mint Studio marries great sound with great value. Since it also boasts an audio mini-jack input for other audio sources, you can amplify pretty much anything that has a 1/8-inch mini-audio plug. Easily amplify your digital life with the Mint Studio.Easily amplify your digital life with the Mint Studio.Mint Studio USB Wireless Audio Transmitter FeaturesAutomatic Plug and Play--Plug the Mint USB Audio Transmitter into your PC's USB port, and your PC will automatically detect it and set the Mint USB as a default sound device. On Mac, just set up the sound preference.Unlimited Media Players--No limit on media players. Once the Mint USB Audio Transmitter is set up as your PC's default audio device, any audio from your computer will be streamed wirelessly to Mint Studio speaker system regardless of the type of players, such as iTunes, Windows Media Players, or various internet browsers for online music, including IE, firefox, Safari and Chrome.Uncompressed Wireless Streaming--Mint USB Audio Transmitter streams digital music as it is originally recorded. There is no compression for wireless streaming. It supports up to 32 PCM words at 96 kHz sampling rate.Wireless Operation Range--100 feet line of sight. Wireless range may vary depending on interference from obstructive objects.Multiple-Room Support--Mint Studio's Audio Transmitter streams audio wirelessly to up to three different Mint wireless receivers simultaneously within 100 feet line of sight. You can install up to three Mint Studio speakers in three different rooms in your house.Use the included remote to access all of Mint Studio's functions, along with the iPod's menu.Click to enlarge.USB Audio Transmitter for wireless, uncompressed sound from your PC.Click to enlarge.Mint Studio Speaker System FeaturesWireless Audio Receiving--With the built-in wireless audio receiver, Mint Studio speaker system receives uncompressed wireless audio contents from PC/Mac through the Mint USB Wireless Audio Transmitter.iPhone/iPod Dock---Mint Studio speaker system has a built-in dock for iPhones and iPods, and it charges the device while its docked.Auxiliary (Line-In) Port--1/8-inch mini stereo input jack to connect iPod shuffle, CD players, and MP3 players.Sophisticated Acoustics--Two 3-inch Hi-Fi full-range speakers, 15-Watt Texas Instrument class D amplifier, two high-output bass ports, and balanced EQ design generate ample party sound without distortion and pleasant everyday casual listening.Mint Studio Remote Control FeaturesUse the included remote to access all of Mint Studio's functions, along with the iPod's song and menu controls. Adjust volume, playback, and input modes for full control over your listening experience.What's in the BoxMint Studio Speaker System, Mint USB Wireless Audio Transmitter, Mint Remote Control, AC adapter, adapter power cord, user guide, warranty card", "title": "Mint Studio Wireless PC/Mac Speaker with iPod/iPhone Dock (Black)", "price": 199.99, "imUrl": "http://ecx.images-amazon.com/images/I/31JIobBCFIL._SX300_.jpg", "related": {"also_viewed": ["B0056H9KKI", "B00E6323XY", "B003VAHYXW", "B003VANOI6", "B00903HKIS", "B008JGR9MO"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}