{"asin": "B002OB4BKI", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]], "description": "Adorn your bedroom, living room, or office with contemporary flair. The ICF-CL75iP multifunction clock radio packs an array of innovative features into a space-saving design. View photos and videos on the 7-inch LCD screen, or slide out the retractable docking tray to charge or listen to your iPod or iPhone music. There's even a 7-5-2 day alarm for waking to the radio, iPod, iPhone, nature sounds, or a pre-recorded personal message. Additionally, this clock radio includes 1 GB of built-in memory, plus inputs for memory stick media, secure digital (SD) memory cards, and USB.Adorn your bedroom, living room, or office with contemporary flair.Easy-access dock slides out of sight when not in use.Customize with your own image backgrounds.7-Inch LCD ScreenUpon first glance, the most striking thing about the  ICF-CL75iP is its 7-inch LCD screen. Display the time in characters too large to miss, and customize the display with your own photos--added using USB, SD card, or memory stick media, and saved on the 1 GB of internal Flash memory.Your iPod and Then SomeThe easy-access dock charges your iPod or iPhone while you listen, and slides out of sight when not in use. For video-enabled iPods, you can enjoy video right on the LCD screen.In addition, since the ICF-CL75iP boasts 1 GB of memory and inputs for various storage media as mentioned above (USB, SD card, memory stick), you can enjoy media directly without an iPod--with support for MP3/WMA audio, MP4/AVI video, and JPEG images.AM/FM RadioTune into that weather forecast, morning show, or traffic report quickly with 20 FM and 10 AM preset stations.Dual AlarmGently fall asleep or wake up to five different built-in nature sounds, your iPod/iPhone, or the radio. \"7-5-2\" alarm settings allow for different wake times on weekdays and weekends, and you can even set up the \"fun wake-up\" feature so a particular photo and quick voice memo wakes you.In the case of a power interruption, the built-in lithium battery maintains the correct time, so you won't be late, and a sleep timer lets you drift off to your favorite tunes in intervals of 15, 30, 60, or 90 minutes.What's in the BoxSony ICF-CL75iP, AM loop antenna, Sony CR2032 lithium battery, dock adapters, and documentation.", "title": "Sony ICFCL75IP 30-Pin iPhone/iPod Clock Radio Speaker Dock with 7-Inch LCD Screen (Black) (Discontinued by Manufacturer)", "price": 83.43, "imUrl": "http://ecx.images-amazon.com/images/I/51X9VOnvW9L._SY300_.jpg", "brand": "Sony", "related": {"also_viewed": ["B00BQ4HROG", "B00BQ4HRG4", "B005GUAIJM", "B008V1PSTI", "B004VFCIIC", "B008Q7HHIC", "B001RB1XY8", "B003M8HWDA", "B004T0MW7Q", "B00BQ4HRE6", "B003DZ9Z78", "B002IT1BFO", "B002OB4BK8", "B0040GWXG4", "B00375MPA8", "B004T1Y8G8", "B005GUAIBU", "B004I8WH7E", "B005KQ2O2G", "B004SKBJ5S", "B004M8SU1C", "B00IEYHMPK", "B003LPUU92", "B001GNC7RY", "B001WLTI7W", "B008HFCI50", "B0069RZ044", "B003GHNQ0K", "B004NBZAI4", "B00H1ASWN4", "B00413VDYY", "B004OA6VZ0", "B009NPA0YY", "B00COHALOM", "B00B4MDN1G", "B00HF5TG8A", "B008RJUO2U", "B0040Z80SK", "B005HY4UG4", "B0035FCWBC", "B001RB1XXY", "B00HBJRV5K", "B001L9KMTI", "B007R66TZK", "B003E4PVJY", "B00IEYHMQ4", "B00BCA40U8", "B004HJ57VM", "B007NWULIY", "B00CY8IHU6", "B0035WTCVI"], "bought_together": ["B0097BEG08", "B009A5EIWC"], "buy_after_viewing": ["B00BQ4HROG", "B00BQ4HROG", "B00BQ4HRG4", "B00BQ4HRG4", "B005GUAIJM", "B00B7D4CS0"]}}