{"asin": "B00004THCZ", "related": {"also_bought": ["B008KWM562", "B0053V5MF4", "B0000AE66P", "B003USYPX2", "B00004ZCJI", "B0002Y5WZM", "B003Y60DZO", "B000TTCG8Q", "B0045DMA42", "B004J3V90Y", "B00007E7JU", "B00BCEJ0E0", "B0081TSZCC", "B00004WCGF", "B0057CPD1M", "B0080JH3YE", "B002K40R6G", "B0081TSZWC", "B00DZIFWRU", "B008YFXNE8", "B00GNHSXE4", "B00009R6UU", "B002VPE1WK", "B0040JHVCC", "B004LEAYXY", "B00007LA0T", "B004VTAVLE", "B00005K47X", "B0002Y5WZC", "B00CYLLF16", "B00BW6LWO4", "B005K1Y2GC", "B00DMS0LCO", "B00009R6TA", "B002EF5HDO", "B00CF5OHZ2", "B0061VIHV6", "B006Y0YZZ6", "B004NEJ7HQ", "B00FP1BQ1Q", "B003WD2SLQ", "B003Y06336", "B00BQ9FYRS", "B001TZWNF0", "B00GCGGFMS", "B003LZ5SM6", "B000ALLMI8", "B007N83VQM", "B007M54E1M", "B0081SS5C8", "B003VNKNF0", "B004Z4FBE2", "1118094980", "B0025Z7MAE", "B0056KCSCM", "B004M8SWBK", "B000TQPTTM", "B00BXA7N6A", "B00BW6LW7G", "B00FFZM8RI", "B007SXJ1VG", "B000FW1X4K", "B001T9N120", "B002KDQPWM", "B00E3K94T6", "B003U9VONA", "B001CCAISE", "B0064FS7HI", "B003Q9RERY", "B00004ZCJK", "B000V5K3FG", "B000TLVMIO", "B0040JHVC2", "B0002YE6FY", "B001KELVS0", "B00EEBC2Q6", "B00CV9MK4W", "B005AY9278", "B0057081DQ", "B004J3Y9U6", "B005KP473Q", "B00AA48GSE", "B0011NVMO8", "B007M54E08", "B005AYT6R4", "B00004ZCDI", "B001BPE3KQ", "B00DMFWMME", "B003USVBTS", "B00DQXJM6Q", "B007YCA6UG", "B00004ZCJG", "B009XJYYB0", "B004M8SWBU", "B000237C9M", "B004UTQRHW", "B00EE1ZH6I", "B001HJTK5Y", "B002ONSZPI"], "bought_together": ["B0053V5MF4", "B003USYPX2"], "buy_after_viewing": ["B003MOHM0C", "B0011NVMO8", "B008RYQPC8", "B0053V5MF4"]}, "title": "Canon EF 75-300mm f/4-5.6 III USM Telephoto Zoom Lens for Canon SLR Cameras", "price": 234.0, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41xWU7V7fIL._SY300_.jpg", "brand": "Canon", "categories": [["Electronics", "Camera & Photo", "Lenses", "Camera Lenses", "Digital Camera Lenses"]], "description": "This compact and lightweight EF 75-300mm telephoto zoom lens is ideal for shooting sports, portraits, and wildlife. The lens is distinguished by a newly developed micro ultra-sonic monitor (USM) that makes autofocusing quicker and quieter, along with an improved zoom mechanism that includes a silver ring on the front for a luxurious touch. The micro USM makes this version of the lens particularly suitable for applications that require a fast autofocus, such as sporting events or wildlife shoots. Best of all, the USM version shares many of the same features that makes the non-USM lens so popular, such as a compact size, a close focusing range, and accessory compatibility. As with all Canon lenses, this unit carries a one-year warranty.Focal length: 75-300mmMaximum aperture: 1:4.5-5.6Lens construction: 13 elements in 9 groupsDiagonal angle of view: 32 degrees (at 11 feet) to 8 degrees (at 15 feet)Focus adjustment: Front group rotating extension system with USMClosest focusing distance: 4.9 feetZoom system: Rotating typeFilter size: 58mmDimensions: 2.8 inches in diameter, 4.8 inches longWeight: 16.8 ouncesCompact and lightweight 4x telephoto zoom lens ideal for shooting sports, portraits, and wildlife. The newly developed Micro USM makes autofocusing quicker and quieter. The improved zoom mechanism also makes zooming smoother. The front part of the zoom ring now sports a silver ring for a luxury touch.With the addition of a Micro USM for faster and even quieter autofocus, this version of the EF 75-300mm is well-suited for sports and other applications requiring fast AF. The USM version shares the compact size, close focusing range, and accessory compatibility of the non-USM lens. For many advanced amateurs, the 75-300 range is ideal as a versatile entry into telephoto photography.Isolate the Interesting PartThe eye tends to see the whole rather than the individual parts. It also sees what&iacute;s near and not what&iacute;s far. By bringing attention to those things missed by the eye, you can create many interesting pictures. It could be the grimace of an athlete, the grill of a classic car, or a girl against a blurred background. Telephoto lenses can also compress images to give dramatic effects. You are limited only by your imagination."}