{"asin": "B002OOWC3S", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Input Devices", "Graphics Tablets"]], "description": "Combining intuitive design and versatility, the Bamboo Pen and Touch is a powerful creative workstation that lets PC and Mac users create digital art with an organic, hands-on feel. Using an innovative tablet and Wacom's \"Multi-Touch\" system, users can manipulate images and navigate the Web using simple gestures and finger taps. When combined with Wacom's pen-input technology, Pen and Touch allows you to write, doodle, and embellish with ease.Included pen features 1,024 levels of pressure sensitivity for precise drawings.Large, textured work surface and customizable keys give you artistic control.View larger.Multi-Touch lets you scroll, zoom, and rotate your screen with simple hand gestures.Sleek, Stylish, and Easy to UseMeasuring 9.8 by 6.9 inches, the Pen and Touch is compact enough to store comfortably in a laptop case. It features a large and responsive active area, providing enough workspace for even your most ambitious projects. For added convenience, four ExpressKeys provide quick access to user-defined shortcuts.The tablet comes with a battery-free pen with an easy-to-grip design, so you can have maximum control over your drawing. The work surface is textured, providing a pen-on-paper feel. It's also reversible, so you can use it comfortably whether you're right- or left-handed.The Pen and Touch is simple to set up. Simply plug the tablet into your computer via a USB port, install the provided drivers, and you're ready to go. You'll be doodling, writing, and painting in minutes.Enhance Creativity with Multi-Touch TechnologyWith the Pen and Touch, Wacom has implemented a new technology called Multi-Touch. Typically, tablets require you to use the stylus for navigation, but Multi-Touch provides a comfortable hands-on alternative. It allows you to quickly navigate through your computer with a single finger. You can also scroll, zoom, and rotate your screen with simple hand gestures. It's intuitively-designed and easy to use -- even if you're new to the touch experience.For precision work, you can use the included pen. When you use the pen, the screen will automatically recalibrate for more precise use. In your hands, the pen quickly becomes an all-purpose art tool. It features 1,024 levels of pressure sensitivity, allowing you to perform tasks ranging from fine hand-writing to wide-brush painting. You can add hand-drawn embellishments to your favorite photos, add life to your digital sketches, or provide a personal touch to your scrapbooking pages.First-Class Visual Editing SoftwareThe tablet also comes with a full suite of visual editing software, including Adobe Photoshop Elements 7.0 Win/6.0 Mac and Nik Color Efex Pro 3.0 WE3--valued separately at several hundred dollars.Pen and Touch is compatible with Windows 7, Windows Vista, Windows XP (Service Pack 2) and Mac OS X (10.4.8 or higher.) It requires a powered USB drive, a colored screen, and a CD/DVD drive.What's in the BoxBamboo Pen and Touch tablet, Bamboo pen, Quick Start guide, installation CD (includes driver software, interactive tutorial and user's manual), software DVD.", "title": "Wacom Bamboo Pen and Touch", "price": 75.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41Vy1ON%2BixL._SX300_.jpg", "related": {"also_bought": ["B004FK7MYS", "B003XQO38S", "B008TN81ZG", "B005S2FNC0", "B004DKS3C0", "B0089VGPII", "B002OOWC42", "B001NK395Y", "B0050CTUIQ", "B003XQO38I", "B006SYG6UA", "B005HGBEZ2"], "buy_after_viewing": ["B00EN27U9U", "B00EN27UC2", "B00EN27TCI", "B008I647MA"]}}