{"asin": "B003ZX8B2S", "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS"]], "description": "See the big, wide world with the large screen n&uuml;vi 1450LMT. It offers free Lifetime Maps and Traffic, multiple-point routing, lane assist with junction view to guide you through busy highway interchanges, pedestrian routing options and ecoRoute to find the most fuel-efficient route.See the big, wide world with the large screen n&uuml;vi 1450LMT.Traffic information is updated constantly, and map updates are available up to 4 times a year, with no subscription, fees, or expiration dates.EcoRoute calculates the most fuel-efficient route, tracks fuel usage and more.Simply tap the screen for your exact coordinates, the nearest address/intersection, and the closest fuel and emergency services.Extra-Wide, Feature-Rich GPS Navigator Lifetime Maps and TrafficIncludes Free Lifetime Map UpdatesWith free Lifetime Map and Traffic updates, you always have the most up-to-date maps, points of interest and navigation information available at your fingertips. Traffic information is updated constantly, and map updates are available for download up to 4 times a year. Both features are ready to go, right out of the box, with no subscription or update fees and no expiration dates.See Even MoreIt's easy to see where you're going on n&uuml;vi 1450LMT's 5-inch touchscreen display. View map detail, driving directions, photos and more in bright, brilliant color. With its big, bold display, you won't miss a thing.Navigate City TransitWith its enhanced pedestrian navigation capabilities, n&uuml;vi 1450LMT is the perfect travel companion for getting around town. Download optional cityXplorer content to help you navigate city public transit. Know where to walk, where to catch the bus, subway, tram or other transportation and how long it will take to get there. cityXplorer maps are available for select cities throughout North America and Europe. And with prices as low as $9.99, you'll have money left over to spend in the big city.Know the Lane Before It's Too LateNo more guessing which lane you need to be in to make an upcoming turn. Lane assist with junction view guides you to the correct lane for an approaching turn or exit, making unfamiliar intersections and exits easy to navigate. It realistically displays road signs and junctions on your route along with arrows that indicate the proper lane for navigation.Plan Aheadn&uuml;vi 1450LMT includes advanced navigation features to take the worry out of traveling. With route planning you can save 10 routes, specify via points and preview simulated turns on the 1450LMT's large screen. In addition, n&uuml;vi 1450LMT automatically sorts multiple destinations to provide an efficient route for errands, deliveries or sales calls. A trip log provides an electronic bread crumb trail of up to 10,000 points, so you can see where you've been on the map.Get Turn-by-Turn Directionsn&uuml;vi 1450LMT's intuitive interface greets you with two simple questions: \"Where To?\" and \"View Map.\" Touch the color screen to easily look up addresses and services and get voice-prompted, turn-by-turn directions that speak street names to your destination. It comes preloaded with detailed City Navigator NT street maps, nearly 6 million points of interest (POIs), 2-D or 3-D maps and the speed limit for most major roads in the U.S. Its digital elevation maps show you shaded contours at higher zoom levels, giving you a big picture of the surrounding terrain. With the 1450LMT's enhanced user interface, you can slide your finger to conveniently scroll between screens. You can also upload custom POIs. And with HotFix satellite prediction, n&uuml;vi calculates your position faster to get you there quicker.Go Beyond NavigationNavigation is just the beginning. n&uuml;vi 1450LMT saves you gas and money with ecoRoute--a green feature that calculates the most fuel-efficient route, tracks fuel usage and more. The 1450LMT includes many travel tools including JPEG picture viewer, world travel clock with time zones, currency converter, measurement converter, calculator and more. With photo navigation, you can download pictures from Garmin Connect Photos and navigate to them. With its \"Where Am I?\" emergency locator, you always know your location. Simply tap the screen to get your exact latitude and longitude coordinates, the nearest address and intersection, and the closest hospitals, police stations and fuel stations. The 1450LMT features Garmin Lock, an anti-theft feature, and is compatible with our free Garmin Garage where you can download custom voices and vehicles. Enhance your travel experience with optional plug-in microSD cards.What's in the Boxn&uuml;vi 1450Preloaded City Navigator NT North America (U.S &amp; Canada)Lifetime Maps and TrafficFM traffic receiver with vehicle power cable (vehicle power cable is traffic receiver)Vehicle suction cup mountUSB cableDashboard discQuick start manual", "title": "Garmin nuvi 1450LMT 5-Inch Portable GPS Navigator with Lifetime Map &amp; Traffic Updates (Discontinued by Manufacturer)", "price": 166.99, "imUrl": "http://ecx.images-amazon.com/images/I/41QNJqpZ6PL._SY300_.jpg", "brand": "Garmin", "related": {"also_bought": ["B004HPSI6M", "B002OL2MU4", "B004I5BUSO", "B0050JJU3E", "B0051DSBSO", "B009NWSKIA", "B002RL8H1Y", "B002I03UVQ", "B003Z59EW2", "B003Z56BZA", "B003ZX8B3W", "B002I05VRM", "B004EKEBNY", "9985511476", "B003ZX8B0U", "B002RS3SF2", "B000LRMS66", "B004HYGEOQ", "B0096DM9YC", "B00292BS12", "B001MU246A", "B003YBYPU8", "B003NREG7U", "B00422KZQG", "B004HPW0Y8", "B0015EWMX8", "B003ZX871I", "B008H6176U", "B001U0O7RQ", "B006JW6IHC", "B005IGVY6K", "B0051FWA7U", "B003DN7716", "B000L9TJXO", "B000F7857S", "B005IGVXO8"], "bought_together": ["B002OL2MU4", "B004I5BUSO"], "buy_after_viewing": ["B00AXX0I88", "B005DIBHCE", "B002OL2MU4", "B005DIBHA6"]}}