{"asin": "B000FRU0NU", "description": "Adding toHalo: Combat EvolvedandHalo 2, the epic saga continues withHalo 3, the amazingly anticipated sequel to the highly successful and critically acclaimedHalofranchise. In this third chapter of theHalotrilogy, Master Chief returns to finish the fight, bringing the epic conflict between the Covenant, the Flood, and the entire human race to a dramatic, pulse-pounding climax.Get ready. The Chief is back.HDR lighting, self-shadowing, and more makeHalo 3look and feel realistic.View larger.Mystery abounds with the return of Cortana.View larger.Earth is conquered. The Covenant is everywhere. Halo 3 promises to be an epic journey.View larger.Game developer Bungie announced thatHalo 3will be released for Microsoft's Xbox 360 sometime in 2007. The game was revealed to the world at the Microsoft press conference held at Grauman's Chinese Theater in Hollywood, CA in May 2006. To gamer's delight, the announcement was a complete surprise. The rumors have been abound for the past year, as everyone wondered when the next installment would be ready. Bungie and Microsoft did a stellar job keeping their lips sealed, and fans benefited from their first glimpse of the hallowed third and final installment.The short presentation was delivered in real-time on the Xbox 360 using the current version of theHalo 3game engine. That's right, no studio production video, Bungie and Microsoft delivered the real deal: what they showed at the announcement is what gamers will see when they play Halo 3 in 2007. The HDR lighting, self-shadowing, GPU-run particle system and many other effects are rumored to show up in full effect in the final game. Needless to say, the gaming community is salivating.CJ Cowan, Bungie's director of cinematics discussed one of the most startling moments of the presentation: the return of Cortana. \"Given the variety of character and story arcs at the end ofHalo 2, we wanted to boil down our announcement to a few key threads. Cortana and the Chief being a galaxy apart is a situation we haven't seen before, and is something that is a powerful component toHalo 3. We are using her transmissions in the demo to give the viewer a few subtle clues to her situation and state of mind, without revealing any specifics we want to save for the game itself.\"Graphically, the game closely follows in the tradition ofHalo 2, although it has been upgraded to take advantage of the Xbox 360's more prodigious visual abilities. As art direct Marcus Lehto explained, \"[The presentation] was intended to be an understated announcement ofHalo 3-- the tone is that of mystery and suspense -- the calm before the storm. I wanted to make sure that we reintroduced the Chief, showed that Earth was thoroughly conquered, with Covenant everywhere, and that there is a glorious, ancient artifact buried under the Earth's crust which will provideHalo 3with the epic journey which we all want.\"Taking full advantage of the power of Xbox 360,Halo 3expands on everything that has made the franchise great, adding a wealth of technical and gameplay advancements. The game design has evolved with next-generation, high-definition visuals, enhanced A.I., an advanced real-time lighting engine, and, of course, new weapons, characters, and challenges.Halo 3promises an unparalleled first-person shooter experience and, in the end, the most compelling and engrossing story in the franchise's history. Last, but certainly not least,Halo 3builds upon the unique social multiplayer experience and innovative, evolving online gameplay ofHalo 2. Rest assured, you'll still be able to run with your clan and battle with (or against) your buddies from coast to coast.", "price": 47.27, "imUrl": "http://ecx.images-amazon.com/images/I/51Oil1WlkiL._SY300_.jpg", "related": {"also_bought": ["B001HWB68K", "B002BSA20M", "B0050SYX8W", "B00008J7NZ", "B0050SYY5E", "B00GV8QTPU", "B0034JKYO6", "B00005NZ1G", "B00FKV8AK6", "B002I0H79C", "B004JSDQPU", "B0017HW5LM", "B0002A2S26", "B003ZSP0WW", "B000FRS9II", "B00D9EPI38", "B00503E8S2", "B000ZK9QD2", "B006HPLKK6", "B000FRU1UM", "B000TG530M", "B0016B28Y8", "B002EE5ROO", "B002I0H2AG", "B000OLXX86", "B002I098JE", "B007XVTR3K", "B00D9FQAM0", "B00FATRKOK", "B003JVKHEQ", "B00269QLI8", "B001A4MTGS", "B0050SYBL6", "B000ZK6950", "B002I0JGDM", "B002BRZ852", "0765367297", "B00BU3ZLJQ", "B000SQ5LQ4", "B000MKA60W", "B0012N3ZXS", "B000QY9C90", "B000ZKDOVW", "B000ZKDOV2", "B000RHZ9JI", "B000G7PMXC", "B005EZ5GZK", "B001AWIP68", "B000P297JS", "B001TOQ8MU", "B0050SYLRK", "B000A0EFJW", "B001SH7YMG", "B0050SYEYK", "B000P46NMK", "B0054OGCS6", "B00936K09S", "B000HCL5QO", "B00519C7CE", "B0050SYE40", "B007LQG9A6", "B005FDUSTA", "B000WPXQSQ", "B002BRZ8BQ", "B008I62AN8", "B0025KZV7A", "B003O6G5TW", "B004X56OU8", "B00E8FEJPU", "B0050SYV70", "B008RA5H8K", "B0050SY4DG", "B00BMFIXT2", "B005YR1VP2", "B003OAE79S", "B007MJSZDQ", "B00309S9YW", "B0050SWTAQ", "B0028IBTL6", "B001D7T2VM", "B004HYK956", "B00273Z9WM", "B003O6JJKY", "B008J16AP6", "B000F3AADE", "B003O6EB70", "B0050SYILE", "B00269DXCK", "B008B3AVNE", "B00A17JU1W", "B00009TW6R", "B008277M0Y", "B000OYKQBU", "B000FRVAD4", "B000TGDHW8", "B001TORSII", "B0022TNO7S", "B004FSE52C", "B002Q21X7Y", "B004HX1QFY"], "bought_together": ["B0050SYX8W", "B002BSA20M"], "buy_after_viewing": ["B0050SYX8W", "B002BSA20M", "B00008J7NZ", "B0050SYY5E"]}, "salesRank": {"Video Games": 331}, "categories": [["Video Games", "Xbox 360", "Games"]]}