{"asin": "B004HO59M4", "related": {"also_bought": ["B00479TG3C", "B00009KLAD", "B004VD34P0", "B0051QL7E6", "B007L4IFGO", "B002IKLJVE", "B001FA0AM2", "B003A4GZUC", "B0066J6EOU", "B0037TA83K", "B003VNKNEQ", "B0053IZEN2", "B003VNKNF0", "B0046WLBNS", "B001ISKNKA", "B002CGSYNU", "B004PJN82E", "B009DL0LOW", "B001QWCW48", "B00461GWJ2", "B0010C2HSA", "B004OI0NGK", "B005IBT1BK", "B005756IGS", "B004EC1YY6", "B003150B6O", "B004BBJ6JK", "B005FQSXFI", "B004S7W1RQ", "B004SDZ03M", "0470879505", "B00AD7ZAJG", "B004S7W1SK", "B00506040K", "B004PZNMKG"], "bought_together": ["B003VNKNEQ"], "buy_after_viewing": ["B003VNKNF0", "B0066J6EOU", "B00479TG3C", "B003VNKNEQ"]}, "title": "Olympus PEN E-PL2 12.3 MP CMOS Micro Four Thirds Interchangeable Lens Digital Camera with 14-42mm Lens (Black)", "price": 459.99, "salesRank": {"Camera &amp; Photo": 6938}, "imUrl": "http://ecx.images-amazon.com/images/I/41IVu5nzTgL._SX300_.jpg", "brand": "Olympus", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Compact System Cameras"]], "description": "The PEN E-PL2 continues the PEN family's legacy of a small, light and simple design, intuitive interface and DSLR image quality and expands your creative potential with new lens technology, Live Guide, new in-camera creative features, new auxiliary lenses, a new Close-Up Spotlight accessory (MAL-1) for macro photography and the new Olympus PENPAL Bluetooth accessory.  And the newly designed E-PL2's ergonomic body makes capturing amazing still images and HD video more fun than ever before.Olympus PEN E-PL2 HighlightsSmaller, silent kit lensThe E-PL2 comes with the new Movie & Still Compatible (MSC) ED m14-42mm f3.5/5.6 zoom lens. This new kit lens has a smooth, silent and quick inner focus mechanism to make it exceptionally fast and nearly silent when recording high-definition movie.New Live Guide for stills and moviesThe PEN E-PL2's Live Guide system takes the guesswork out of great photography and videography by allowing you to preview effects at the touch of a button. Want more vivid or muted color in your shot? Want warmer or cooler color? Want a brighter or darker subject, or a sharper or softer background? Simply select Live Guide and turn the wheel on the back of the camera to slide through numerous photographic and videographic effects. Make adjustments and watch the LCD as the effects are made live--before the image is captured!Face Detection with Eye Detect AFNail the focus every portrait photo, every time. The new face detection AF employs an \"Eye Detect AF\" that adjusts focus automatically on the subject's eyes during portrait shooting.3-inch high-resolution LCDThe E-PL2 provides an overall excellent user experience with a large, easy-to-view 3.0-inch 460,000-dot high-resolution LCD monitor and a control dial.Expand your creative horizons with built-in effectsOlympus appreciates that you may not have hours to spend retouching your images on the computer. The E-PL2 has improved Art Filters with selectable new Art Filter variations that allow users to customize each filter with different moods and effects and an Art Effect function to add various composition effects to the picture. Six Art Filters are incorporated including the new Dramatic Tone filter. With the E-PL2's Multiple Exposure you can shoot one shot, then another and combine them in real time, or capture both shots separately and combine them within the camera later. Choose from one of six background music tracks when playing an in-camera slideshow.Big sensor, not a big bodyAt the heart of the E-PL2 is a large-size image sensor that's the same sensor as the one inside the Olympus E-30 and E-620 Digital SLR models. The only difference between this sensor and what the pros use is that this big sensor is inside the much smaller body of the E-PL2. This high-performance 12.3-megapixel Live MOS image sensor (8 times larger than the average point-and-shoot camera sensor) delivers excellent dynamic range, accurate color fidelity, and state-of-the-art technology to reduce noise and capture fine image details in both highlight and shadow areas.HD movies made easyRecording HD movies with the E-PL2 is simple thanks to an easy-to-reach one-touch record button on the back of the camera body. If you're about to snap a photo and you realize a video would capture the spirit of the scene even better, simply press the record button and instantly you're capturing videos! Easily toggle back and forth between capturing stills and video by using your index finger to press the shutter button or your thumb to press the red record button. Having the ability to shoot still images and videos opens up a world of imaging possibilities.Additional FeaturesIn-body Image StabilizationSay goodbye to blurry images. In both still and movie modes - the E-PL2 Image Stabilization excels. The E-PL2's three-mode In-body Image Stabilization system compensates for up to three shutter speed steps in the still shooting modes with any of its interchangeable lenses: Mode 1 for general shooting, Mode 2 for creative high-speed horizontal capture, and Mode 3 for high-speed vertical capture. The camera's Mechanical Image Stabilization automatically compensates for camera shake in low-light situations or when using a telephoto lens. In the Movie Modes the advanced Electronic Image Stabilization tracts the images both vertically and horizontally to achieve clear sharp movies, matching the performance of the in-body IS.Built-in pop-up flashIlluminate low-light subjects, reduce red eye, and fill in dark areas. Set the built-in pop-up flash to auto or control the amount of light the flash emits.12.3-megapixel resolutionThe E-PL2's powerful 12.3 megapixel Live-MOS sensor packs a powerful high-quality imaging punch for such a compact camera, allowing you to capture more detail than ever before. The Live MOS image sensor delivers excellent dynamic range, accurate color fidelity and fine image details in both highlight and shadow areas.TruePic V Image ProcessorIn addition to more detail, the image sensor, combined with the next-generation TruePic V Image Processor, delivers excellent dynamic range, accurate color fidelity and reduced noise, all the way up to 3200 ISO.Dust Reduction SystemA Dust Reduction System assures spot-free images. Every time you turn on the camera, the patented Supersonic Wave Filter silently vibrates, flinging and collecting dust so that it cannot interfere with the picture imaging at any time.HD Movie with manual control, Art Filter Movie, and new Direct Movie buttonShoot movies at 30 frames per second, with high-quality sound, in 720p with available manual control over aperture and shutter speed. This new level of control allows you to express your vision exactly how you want in your HD videos. A Direct HD Movie Button switches you from still to movie mode with the press of a button. You can also capture HD video (720p) using one of the six Art Filters for more creative shooting options.Accessory portThe E-PL2 includes a port (AP2) for new accessories including the MAL-1 accessory light, the PENPAL Bluetooth accessory--which makes it easier than ever to share your images--as well as the VF-2 viewfinder, a detachable electronic viewfinder. The external accessory port also allows for connection with the new EMA-1 external microphone adapter for enhanced audio capture.PENPalThis Bluetooth accessory plugs into the camera's accessory port to easily save albums, send pictures from your PEN to a smart phone or another PEN. This makes it easier than ever to share images to sites like Twitter, Facebook and Flickr. When the information is sent, it includes shooting location to make geo-tagging easier than ever before.New, easy-to-use Live Guide controlSeeing the results before you shoot can change the way you take a picture. Want more vivid or muted color in your shot? Want warmer or cooler hues? Want a brighter or darker subject, or a sharper or softer background? Or maybe you want to capture the fast-moving action of your subject with a little artistic blur, or perhaps freeze the action? Simply set the camera to iAuto, press OK to engage Live Guide, then press the up and down arrows on the back of the E-PL2 to easily slide through numerous photographic effects. Make adjustments and watch the LCD as the effects are made live -- before the image is captured! Live Guide also features a Tips section on how to compose a shot or shoot kids, pets, flowers and more.22 Scene-Select modesFrom portraits to sunset shots, the E-PL2 is equipped with 22 Scene-Select modes for effortless picture taking, including Fireworks, Sunset, Children, Macro and Panorama, to name a few. Capturing beautiful portraits is easy with the ePortrait Mode that enables you to smooth your subject's complexion. There are even three scene modes that are specific to shooting with the new conversion lenses to optimize the performance of those lenses.iAuto with iEnhanceiAuto automatically identifies the scene you're shooting--portrait, landscape, night portrait, macro, or sport--and adjusts the settings to optimize results. iEnhance can be used in any mode, and automatically engages when using iAuto to enrich color in any subject, just as the human eye sees it.Micro Four Thirds mountThe Micro Four Thirds Mount on the E-PL2 provides many key benefits, including the effectiveness of a digitally designed image sensor, an ultra-compact design, and expandability and compatibility with all Micro Four Thirds Lenses and Four Thirds System Lens via the MMF-2 Adapter.Autofocus Live View with Autofocus TrackingKeep fast-moving and unpredictable subjects in focus. AF Live View displays subjects, in focus, on the LCD the instant the shutter is pressed half way. AF Tracking locks your subject into focus and adjusts focus and brightness whether you or your subject is moving.Media cardsThe E-PL2 is capable of recording video to SDHC and SDXC media cards to accommodate large files. (SDHC Class 6 cards are recommended.) Videos, stills and high-fidelity audio can also be output via HDMI cable--direct to any HD television."}