{"asin": "B000H1MRJO", "categories": [["Baby"]], "description": "An essential item for travel, sleepovers, nap time, and camping, the Regalo My Cot Portable Bed provides a safe, comfortable alternative to your child's bed at home. The portable, lightweight cot includes a convenient carry case and sets up and folds down in seconds. Parents can rest assured that this portable children's cot meets all current safety standards, thanks to its sturdy all-steel frame and a durable canvas bed liner.My Cot Portable Bed(Royal Blue)At a Glance:Age/Weight Requirements:2 to 5 years; up to 75 pounds and 52 inches tallWarranty:Limited, 90-dayLightweight Children's Cot for Easy TravelWhether your child is staying over at grandma's house or taking a nap at day care, the My Cot Portable Bed provides an ideal place to rest. The portable bed folds compactly for travel and stores easily into its fabric carry case. Weighing just four pounds, this bed quickly sets up whenever and wherever you need it. Plus, it can be used in outdoor settings, such as picnics at the park or a day at the beach.Comfortable, Sturdy FrameConstructed with an all-steel frame for safety and stability, the portable bed meets current safety standards. The bed liner is made from a sturdy canvas material with reinforced stitching for added durability. As an extra comfort feature, the portable bed includes a cotton fitted sheet that fits snugly over the frame and is machine washable.Portable and Easy to CleanThe portable bed measures 48 inches long, 26 inches wide, and provides a 7 inch clearance from the ground. It's ideal for use with children ages 2 to 5 years old that weigh up to 75 pounds and are less than 52 inches tall.The cot cover is machine washable, so it's quick and easy to clean after each use. The bed liner can be wiped down with a cloth and warm, soapy water.The Regalo My Cot Portable Bed (Royal Blue) is backed by a limited, 90-day warranty.About Regalo Baby: Products for the Most Important People in the WorldAll Regalo products are designed with a strong commitment to safety and convenience for parents and caregivers. Ranging from bed rails to booster seats, Regalo products are made from nontoxic materials that are certified by the Juvenile Products Manufacturers Association (JPMA) and meet the American Society for Testing and Materials (ASTM) standards wherever possible. Regalo is proud of its reputation in maintaining one of the best safety records for juvenile products.By donating products throughout the year, Regalo focuses on giving back to children's organizations such as the Make-A-Wish Foundation, the Kids in Distressed Situations, Inc. (K.I.D.S), and numerous nonprofit organizations that support struggling mothers.What's in the BoxRegalo My Cot Portable Bed (Royal Blue), carrying case, cot cover, and instruction guide.", "title": "Regalo My Cot Portable Bed, Royal Blue", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/512xqWBxRFL._SX300_.jpg", "brand": "Regalo", "related": {"also_bought": ["B0088UXLSW", "B005O4LEXE", "B000CSEE3O", "B005NIAJCS", "B0073TW4SC", "B00LW10470", "B008WN45TY", "B00A4KRRJ8", "B008OTNRTK", "B000KJBFC8", "B009JV34RC", "B00CEV9E64", "B008VPA76I", "B003F1FETS", "B00KDKKD1I", "B00CPLK09S", "B0075D2J2C", "B004C7S7AC", "0375822704", "B002CQTU8S", "B008EF1R7I", "B004M0YY0G", "B008MEC4S2", "B00CMQ7YZ4", "B004XVJLTS", "0395978351", "B000BXHPEU", "B004H0YHKS", "B009B1L3CS", "B003X4G55O", "B003D3NVPW", "B002IVTPIW", "B001ULCJFM", "B002XMRGMS", "B006DNLNPY", "B001TS6WWC", "B0070WGV9K", "B00364E1DE", "B002PB2HPS", "B00D9C2CDO", "B003BWAKJA", "B004ECJWK4", "B008K0TOOU", "0670059838", "B001EQ66WK", "B000CQ01GU", "B0054YZDWC", "B005DLCJX2", "B005GHMT06", "B00E8KJYNC", "B004N8C0RG", "B000H1IYXW", "B000KGRSZO", "B00F2MQ410", "B0058AFRZA", "B000197NXM", "B002HRFNVU", "B00GUPPGSA", "B001W2WKS0", "B00GIIIRVC", "B008CDR7LW", "B000IHJF60", "B006P05S2Y", "B001TSCDBQ", "B006JH1KSE", "B0081C9UOQ", "B005NMP6IG", "B005MQRI7U", "B000C41UDA", "B00C37PINW", "B0060JVU72", "B009TJ3J60", "B000HBMFRS", "1575421283", "B00CHGHZZ8", "B007QBEUA2", "B004XVJLU2", "B00178LYI6", "0060530898", "B000P3WPKK", "B00191QBM0", "B0009PAN7Q", "B000096M59", "B001UVJHY8", "B000XPWXK2", "B0030VJ79Q", "B009Z4W140", "B00ANJLSTA", "B00F16NQCM", "B004MDXS0U", "B00D840OP6", "B003U0O3B4", "B000056J7L", "B00IWP06V8", "B0044CZ63G", "B004PBN9BC", "B00HB0WN5C", "B00389VFH2", "B006ZVV0NO", "B003HS5JMQ"], "also_viewed": ["B005NIAJCS", "B0088UXLSW", "B009FRKXKG", "B001EQ66WK", "B0064IK264", "B00CPLK09S", "B008VUNBKC", "B006K18VKO", "B005O4LEXE", "B001NI6TBW", "B0075D2J2C", "B006P1BGGU", "B00K1ROF7Q", "B002IVTPIW", "B007RHLJ7M", "B005OHF2FM", "B008MZI7UU", "B00LH02D5W", "B005GHMT06", "B00006IV33", "B0073TW4SC", "B006UJLHMK", "B00KMZGWOQ", "B0043AK0O4", "B0092Q2SG2", "B008MZFV7W", "B004M0YY0G", "B008BWESBQ", "B0068IKYMM", "B00005BAIB", "B00CCKC108", "B004M110T8", "B003NY5PD2", "B00839K1IG", "B001O3XBAS", "B000P9IRJM", "B000HBILB2", "B008EF1R7I", "B0085YGTGW", "B003V3U9JK", "B003M5W2J2", "B0029AAUUY", "B000CSEE3O", "B004M0YXU2", "B00BGU41G2", "B004H0YHKS", "B000UCWXOY", "B000P6BGYI", "B0035TVUJI", "B00821SOQQ", "B0073WJACW", "B004L2JJ6E", "B0031ARQLC"], "bought_together": ["B0088UXLSW"], "buy_after_viewing": ["B005NIAJCS", "B009FRKXKG", "B0088UXLSW", "B00177BQIU"]}}