{"asin": "B000FRS9II", "description": "Gears of War, an Xbox 360 exclusive game that blends tactical action with survival horror, thrusts gamers into a deep and harrowing tale of humankind's epic battle for survival against the Locust Horde, a nightmarish race of creatures that surface from the bowels of the planet. The storyline plays out like a Hollywood blockbuster -- lead character Marcus Fenix pits advanced human technology against the overwhelming Locust Horde. Built around a revolutionary third-person tactical combat system and breathtaking, high-definition visuals from the Unreal Engine 3,Gears of Warimmerses you in a horrifying tale of war and survival.Gears of Waris harrowing tale that pits humankind against the Locust Horde.Marcus Fenix and his team battle nightmarish creatures.View larger.InGears of War, you must take cover to survive.View larger.Gears of Warpresents a focused and well-paced cinematic experience.View larger.The gameplay is focused on a fire team co-op so advanced that your A.I. teammates are indiscernible from human players. Voice recognition and real-time lip synching heighten the absorbing experience. The Unreal Engine 3 technology brings out the smallest details in the largest of battles. WithGOWyou're sure to experience a rich, dynamic world where characters spring to life. Speaking of life, the battlefield is a lethal place. To survive, you must suppress your enemy with blindfire, take cover in interactive environments, and use weapons and teammates to outwit your dreaded, inhuman foes. And with a title likeGOW, it would be shame if you couldn't get online and challenge live gamers. With the next-generation of Xbox Live, you'll be able to experience individualized matchmaking, view player statistics, earn player achievements, customize games, and build personalized gamer profiles.Gears of Warshined bright at Microsoft's pre-E3 press briefing, but a deeper demo at Microsoft's E3 booth revealed many of the game's mechanics.GOWis built with both the hardcore and casual gamer in mind. But, instead of selecting a difficulty level at the start of the game, GOW offers a choice at the beginning of each level. In the vein ofchoose your own adventure, you can select between a difficult or easy path. And it's not just a simple choice of battling tougher enemies; each path (explained by a comrade) represents additional content that is crucial to the storyline. After easing your way into the experience of the gameplay with the simpler paths, you can go back and test your skills on the more difficult routes and never feel like you've played through the areas before.Standing around in the open is likely to get you killed inGOW. You must use cover to survive. With a context sensitive A button function, you won't have to sweat memorizing cumbersome button combos. The A button will:Slam you into cover. As you approach cover inGOWsimply tap the A button to slide and make immediate use of cover.Vault you over the cover. Once you're in cover, pressing up and A will vault you over your cover to engage the opponent or next cover opportunity.Evade enemy fire. When you're forced to be out in the open, tapping the A button will engage a roll maneuver to evade enemy fire.Activate a \"Swat Turn.\" When taking cover on the side of a doorway, pressing the A button will spin your character from one side of the doorway to the other, helping avoid fire.Ripping a magazine free and replacing it in the midst of bloody combat is no easy task.GOWsimulates this difficult action by forcing you to perfect your reloading skills. To be effective in combat you'll need to allot for time to successfully reload your weapon. Do it well and the battle is yours; do it poorly and you may actually jam your gun. Time it perfectly and you'll earn a bonus with a temporary damage boost. ThoughGOWclearly showcases a sci-fi experience, its roots are in tactical, realistic combat scenarios. Therefore, running and gunning makes for seriously erratic shooting. Think about what you're doing. Unless wasting ammo is your goal, you better stop, aim, shoot, and then move on. Otherwise, the Locust Horde might swarm you and take your life.Gears of Warpresents a focused and well-paced cinematic experience, and nothing ruins that faster than a time-consuming exploration of every switch or button to find the elusive trigger to open a door. This game introduces a \"point of interest\" button that comes up on the screen so you can immediately interact with the necessary item to move forward in your gameplay.GOWcertainly offers drool-worthy graphics, but the mechanics have also received equal attention. Keep your eyes and ears on high alert for a release date, as Microsoft hasn't let the cat out of the bag on when gamers will be able to tackle this great-looking and great-playing title.", "price": 9.45, "imUrl": "http://ecx.images-amazon.com/images/I/51cKx1N2jRL._SY300_.jpg", "related": {"also_bought": ["B000ZK9QD2", "B002I0H79C", "B002GN8HU4", "B002I0H2AG", "B000FRU0NU", "B000G75AXY", "B000TG530M", "B000HCQK0A", "B001HWB68K", "B002BSA20M", "B000RHZ9JI", "B000WSE2WM", "B000G7PMXC", "B000FRVAD4", "B0050SYY5E", "B00269QLI8", "B000P46NMK", "B000OLXX86", "B000MKA60W", "B000TI836G", "B0050SYX8W", "B001QXNBJM", "B003O6G5TW", "B000F3AADE", "B000QY9C90", "B0016B28Y8", "B000ZK6950", "B000G7YRHO", "B001TOQ8J8", "B00008J7NZ", "B00503E8S2", "B000A0EFJW", "B000X1PE16", "B001AWIP68", "B0016BVYA2", "B000FRU1UM", "B00AYSV89K", "B000UU3SVI", "B002I0JGDM", "B0050SY4DG", "B00354NAYG", "B000R0SS3Y", "B003Q53VZC", "B0014CFO4K", "B000H94PVO", "B000WMEEB2", "B000C427NM", "B002BRZ852", "B00269DXCK", "B0010AYJXI", "B001D7T2VM", "B000HX1P72", "B000UUFQZE", "B0050SWVIQ", "B0009S4UOA", "B004XACA60", "B003H0CC2O", "B000FRVCAA", "B002EE5ROO", "B002DC8GKE", "B0009SQFHA", "B003JVKHEQ", "B00309U0M6", "B000ZK696O", "B000B6ML1Y", "B0023CBY4E", "B0017HW5LM", "B000OCXK6A", "B000O5DS32", "B003L8HQ7S", "B001TORSII", "B001U0CMUA", "B0050SY9WC", "B000KLNLV4", "B001SH7YMG", "B001UWGDC6", "B002V16T0Q", "B000OLSJLC", "B000R0RHA4", "B0050SYLRK", "B001D25M1Q", "B004PAGJOC", "B000JLIXIG", "B003O6G790", "B005THAX5Q", "B000SQ5LQ4", "B0012N3T3Y", "B0016NRS28", "B003GSZ9ZE", "B002BSA1MQ", "B0025KZV7A", "B000FQBF1M", "B002BRZ8BQ", "B004YVOCYG", "B000LSERQE", "B0050SYFM6", "B002WSR8BC", "B003C1I0CO", "B001ASJISG"], "bought_together": ["B000ZK9QD2", "B002I0H79C"], "buy_after_viewing": ["B002I0H79C", "B000ZK9QD2", "B004JSDQPU", "B002I0H2AG"]}, "salesRank": {"Video Games": 3188}, "categories": [["Video Games", "Xbox 360", "Games"]]}