{"asin": "B0029MAXS6", "description": "Xbox 360 Arcade console is everything needed for every member of your family to begin exploring the gaming and entertainment possibilities offered through Xbox 360, including family settings that allow parents to restrict game access for younger players. The Xbox 360 Arcade console comes with a wireless controller and 256MB of internal memory. It also features an HDMI output, so you can experience games, movies in the highest definition possible, up to 1080p (HDMI cable sold separately), and support for digital sound..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Everything you need to begin playing right out of the box.Everything you Need to Get Your Game OnThe Xbox 360 Arcade entertainment system is an affordable option, providing everything players need to get their game on and experience the best in digital entertainment right out of the box. The Xbox 360 Arcade system includes:Xbox 360 Arcade Console- Fun for one, fun for all, the Xbox 360 Arcade console brings family and friends together with games for any skill, style or talent. Plus, with game add-ons available like new songs and adventures, your fun goes on and on.Xbox 360 Wireless Controller- This award-winning, high-performance wireless controller features the Xbox Guide Button for quick, in-game access to friends and music. It has a range of up to 30 feet and a battery life of up to 30 hours on two AA batteries.256MB Storage- 256MB internal storage allows you to save games and store music, pictures, trailers, levels, demos and other content available from Xbox LIVE.*Xbox 360 Composite A/V cable- Maximize your Xbox 360 picture quality on standard-definition televisions using this S-Video connection for a noticeable image improvement over traditional composite connectors. Play high-quality audio with the included stereo connection or use the optical audio port for digital sound.Free Xbox LIVE Access- Xbox 360 Arcade owners can connect to Xbox LIVE for free using the Xbox LIVE Silver subscription included with every console and their broadband Internet connection. Here players will find free game trials and have immediate access to HD movies and Game Add-ons like songs and characters (all sold separately), so the fun never ends. In addition, you get a free one-month subscription to Xbox LIVE Gold. Xbox LIVE Gold offers the best in gaming and entertainment. Invite friends from all over to connect and play online multiplayer games or watch thousands of HD movies streamed instantly from Netflix.&dagger;Watch DVDs, listen to CDs and connect to Xbox LIVE for more entertainment and games.More About Xbox 360The Xbox 360 Entertainment SystemXbox 360 is entertainment well played. It&rsquo;s about fun, connections, bringing friends together, no matter where they are. You&rsquo;ll find the largest library&Dagger; of games with something for every skill and style. You can play with friends across the street or around the world on Xbox LIVE and extend your favorite games with add-ons like new songs, levels, characters and more. Plus you&rsquo;ll find thousands of HD movies and TV episodes available instantly from Netflix. It all adds up to the most bang for your entertainment buck. Jump in.Xbox LIVEXbox LIVE is the online game and entertainment service exclusive to Xbox 360. Connect for free through your broadband Internet connection to your LIVE Silver subscription, provided to you just by means of owning a Xbox 360 console, and you&rsquo;ll find game demos that allow you can try games before you decide the buy, as well as tons of free videos, trailers and more. Plus you&rsquo;ll have access to game add-ons like new songs, maps and other downloadable content (DLC) to extend the life of your favorite games. What&rsquo;s more, thousands of downloadable HD movies and TV episodes are available with the press of a button.Upgrade to Xbox LIVE GoldAn upgrade to an Xbox LIVE Gold membership allows you to experience the best in gaming and entertainment. Raise the curtain on your own instant movie night with thousands of HD movies and TV episodes streamed instantly from Netflix. Invite friends all over the world to connect, cheer and play online multiplayer games.&para; And as a Gold member, you&rsquo;ll enjoy exclusive Deals of the Week, special offers offered only to Xbox LIVE subscribers, that save you money and special sneak-peak game demos that give you early access to the newest and latest in gaming and overall digital entertainment.GamesXbox 360 redefines what games look like, sound like, feel like, and play like to engage you like never before. Every Xbox 360 title supports a minimum of 720p, and up to 1080p high definition resolution or 480p standard definition resolution, in 16:9 widescreen, with anti-aliasing so you enjoy smooth, movie-like graphics and multi-channel surround sound. Vibrant characters display depth of emotion to evoke more dramatic responses, immersing you in the experience.Digital EntertainmentAmplify your music, photos, video, and TV. Watch progressive-scan DVD movies and share your digital pictures with friends. Xbox 360 can also instantly stream the digital media stored on your MP3 player, Media Center PC, or any Microsoft Windows XP 2005 Edition-based PC.Family SettingsXbox 360 has the most robust Family Settings available to help adults by allowing them to set the rating level of games and movies that can be played on the console, (allowing all members of the household to enjoy Xbox in a user-appropriate environment.) It also lets system owners set the online and offline game experiences of children by selecting whether they can play online and whom they play with. And the Family Timer feature helps adults regulate how long kids can play their Xbox 360.* Microsoft Points required to shop Xbox LIVE Marketplace for games, add-ons, and media content (sold separately).&dagger; Xbox LIVE Gold membership and Netflix unlimited membership (sold separately) required for Netflix instant streaming. See Netflix Terms of Use for details about Netflix service.&Dagger; \"Largest library\" based on next generation consoles. Additional storage (sold separately) may be needed for game saves, Xbox LIVE Arcade games, content downloads, personal file storage, and additional enhanced functionality. A hard drive is recommended for LIVE, and is required for some features.&para; Xbox LIVE Gold required for online multiplayer. Xbox LIVE system requirements available at www.xbox.com/live. Hard drive recommended, and is required for some features.", "price": 261.95, "imUrl": "http://ecx.images-amazon.com/images/I/515O%2Bw4UzZL._SX300_.jpg", "related": {"also_viewed": ["B000PD0HQE", "B001NCDAV0", "B001F7AAFW", "B00D9EPI38", "B003O6JKLC", "B00FATRKOK", "B000V761SM", "B000RZXR0S", "B00BBU8VFY", "B000B6MLUA", "B003O6JJKY", "B000U9XBUM", "B00ACILQS0", "B00FATRKLI", "B00FATRKWM", "B005YR1VP2", "B009VS8G80", "B001FPBZBC", "B002I0HBC0", "B00D9FQAM0", "B003O6EETU", "B001FPFVD0", "B006QX0UOQ", "B006OV7O8U", "B000AXFKGQ", "B005M8GSAG", "B002RTO6DO", "B001ELWMHI", "B000BPLCDI", "B00865OIKY", "B005VBVQBU", "B003O6JIFA", "B001KKONBG"], "buy_after_viewing": ["B00D9EPI38", "B000PD0HQE", "B003O6JKLC", "B0050SYILE"]}, "categories": [["Video Games", "Xbox 360", "Consoles"]]}