{"asin": "B0007KQUP2", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Canon's new compact 3.2-megapixel PowerShot A510 digital camera with a powerful 4x optical zoom provides you with a comfortable introduction to the fun and freedom of digital photography.Named for their use of AA batteries, Canon's A-series digital cameras offer easy-to-use, high quality features to consumers looking to capture, save, and share meaningful memories, personal milestones and family functions.The next generation PowerShot A510 digital camera is 13 percent smaller and 10 percent lighter than its predecessor, yet it is equipped with a longer 4.0x 35-140mm (35mm format equivalent) optical zoom lens with Canon optics for sharp images. The new lens features all-glass construction and two aspherical elements in a seven-element formula.In order to make the camera smaller, Canon engineered the new PowerShot A510 model to accept SD media. Even with its small size, the camera sports a large 1.8-inch LCD screen for easy preview and review. It also includes Canon's exclusive DIGIC image processor for faster processing speed and excellent image quality with crisp, vibrant colors.The PowerShot A510 digital camera requires only two AA batteries, while providing the same number of shots (300 with LCD screen on) as previous models that used four batteries, thanks to reductions in power consumption made possible by improvements in key components and circuit design.Like its A75 predecessor, the PowerShot A510 digital camera is equipped with a nine-point AiAF \"smart\" autofocus system and 13 shooting modes. The standard shooting modes are Full Auto, Program, Manual, Shutter-priority, and Aperture-priority with additional modes including Portrait, Landscape, Night Scene, Fast Shutter, Slow Shutter, Special Scene, Stitch Assist, and Movie. The Special Scene mode, which makes it easy for beginners to achieve optimum results in many popular photo opportunities, has been enhanced with the addition of two new settings called Night Snapshot and Kids and Pets. The PowerShot A510 digital camera is also capable of recording movies with sound for up to three minutes per clip, making it perfect for capturing memories in motion.The new camera's grip is ergonomically improved, and the control layout is even easier to use than before. Other camera functions including self-timer and review have also been enhanced for greater creative flexibility.The DIGIC DifferenceImage quality is enhanced and improved as a result of Canon's proprietary DIGIC (Digital Imaging Integrated Circuit) image processor. DIGIC combines the roles of image processing and camera function control into one chip, resulting in faster display and write times for each image and lower power consumption, which extends battery life. Moreover, because DIGIC technology was designed specifically for use in digital cameras it is also capable of handling JPEG compression and expansion, memory card control, LCD/video control and processing gain control (control of CCD signal amplification), autoexposure, autofocus, auto white balance control, and most other functions.Print/Share ButtonLocated on the backside of the PowerShot A510 digital camera is the Print/Share button. This button simplifies and accelerates direct printing to compatible Canon and PictBridge-enabled printers and one-touch image transfer to Windows XP, Me, 2000, and 98 computers for use with image processing programs, uploading to the Internet, or as e-mail attachments. When the camera is connected to a compatible printer or computer, the Print/Share button illuminates to let the user know to press the Print/Share button to begin the printing or downloading process.Optional AccessoriesIn addition to its rich feature set, the PowerShot A510 digital camera is compatible with a wide variety of optional accessories including supplementary wide-angle (WC-DC52), telephoto (TC-DC52A) and close-up lenses (52mm Close-up Lens 250D). These accessories enhance the new camera's versatility and make it easier to use in specialized applications such as real estate and insurance photography. A waterproof case WP-DC60 is also available and can be used at depths up to 130 feet. The combination of the A510 digital camera with the WP-DC60 housing is great for family vacations at the beach, while skiing, or simply to protect the camera from the elements.What's in the Box:The PowerShot A510 digital camera kit includes Interface Cable IFC-400PCU, AV Cable AVC-DC300, Wrist Strap WS-200, SD MultiMediaCard MMC-16M and two AA-size Alkaline batteries as well as Canon Digital Camera Solution Disc Version 22, featuring the latest versions of Canon&#x92;s powerful software and ArcSoft PhotoStudio.", "title": "Canon PowerShot A510 3.2MP Digital Camera with 4x Optical Zoom", "price": 329.0, "salesRank": {"Camera &amp; Photo": 12158}, "imUrl": "http://ecx.images-amazon.com/images/I/41PA2EEWRYL._SX300_.jpg", "related": {"also_viewed": ["B0007MVHZS", "B00ETAU00C", "B000EMU888", "B0000645C9", "B00B5HE2UG", "B0007TJ5OG", "B0012YA4YK", "B000EMU4HS", "B00EVUOKDS", "B0011ZCDKS", "B00B7N9ABY", "B000NK3H4S", "B0073HSIY8", "B000HATNH4", "B00AWYMXZY", "B004MB9UMM", "B000NK3NBA", "B000AYGDWU", "B004J3V7RO", "B00EFILPHA", "B00B5HE3UU", "B000AYKV4G", "B00HLDFNKQ", "B00B5HE1SY", "B00908BQCY", "B00EFILR6E", "B003VTZE1M", "B003VTZE1W", "B00908BMVE", "B00B5HE2MO", "B00HQ4W3OE", "B001G5ZTLS", "B00AWYN0BU"], "buy_after_viewing": ["B0007MVHZS", "B004MB9UMM", "B005IAXVMG", "B003VTZE1M"]}}