{"asin": "B0002CHJAA", "description": "Imagine if Peter Jackson, instead of continuing his The Lord of the Rings epic in movie form, had decided to tell the story of The Two Towers through limited edition Bazooka Joe comics. The characters would all be there and the concepts behind the story would still be intriguing, but the delivery and execution would be devoid of grace or subtlety. If you're having trouble picturing that, just pick up a copy of Xenosaga Episode II and you will understand all too well. Despite my undying adoration of the first entry, I am sorry to report that this game is a dropped ball of Devil May Cry&nbsp;2&nbsp;proportions.Let's get one thing straight: This is not a bad RPG. It is, however, utterly disappointing in its mediocrity. Even ignoring the radiance of its predecessor, this game features some baffling design choices that seem specifically intended to make it frustrating. It contains a meager 25-hour critical path (one of the dungeons is even repeated!), jarring load times before each fight, and an absence of money or shops that leaves you with a constant shortage of necessary recovery items. I'm not against titles breaking from conventions, but these are some of the worst decisions outside of Charles Grodin's&nbsp;resume.Unfortunately, the area where Episode II has received the greatest attention is also where it falters the most. It sports a redesigned battle system that focuses much more on combined efforts rather than individual abilities. By stocking extra attacks and using the shared Boost gauge, the party can cooperatively unleash devastating combos. First you attack a sequence of zones on an enemy (which breaks its defense), then boost other characters into the action queue so they can take advantage of the weakened foe. Unfortunately, this method quickly becomes the only viable way to inflict damage on any enemy; whether it's a simple encounter or key boss fight, every battle is a pathetic routine of eating attacks as you build up your various gauges in preparation for the big assault.My favorite thing about the first Xenosaga was the way it systematically gave the finger to anyone who didn't devote themselves, body and soul, to taking in the whole experience. \"Oh, you don't want to watch the plot or figure out the skill system?\" the game seemed to say, \"Well toughen up, buttercup. It's a long ride.\" On the other hand, Episode II appears to be aimed squarely at the milquetoasts who couldn't handle the previous iteration, coddling and cooing \"Do you want a lolly, sweetheart?\" Where the series' balance (or imbalance) between story and action was once the subject of criticism, the frequency of amazing cutscenes is now all that redeems Episode II.Concept:Give loyal fans more philosophical puzzle pieces, but make them suffer along the wayGraphics:Despite some jaggies and Shion's new \"bus station skank\" style, it is a sleek and beautiful gameSound:The voice actor switch-ups are unfortunate (especially KOS-MOS), and the soundtrack frequently jumps between awe-inspiring and comically inappropriatePlayability:Increased accessibility comes at the expense of engaging customizationEntertainment:The ratio of \"pay attention time\" to \"play time\" is still uneven, but the action cutscenes rank among the very best in gamingReplay:Moderately HighRated:7.75 out of 10Editor:Joe JubaIssue:March 20052nd Opinion:I wish I had better news to share. But facts are facts, and the follow up to one of my favorite RPGs is a disappointment on many levels. Graphics, story, and jaw-dropping cinematics are thankfully not on the list of casualties &#8211; those remain truly top notch as they combine to exhibit expressive characters wrestling with interweaving themes of family, betrayal, and the nature of evil. It's too bad gameplay fails to be even remotely as complex. Combat is desperately shallow, especially in the lengthy mech sequences that show up in the second half of the time. The game-spanning series of side quests are contrived and drab, but you're forced to endure them to get some of the better power-ups. And when I started encountering frequent inane box puzzles, I nearly threw up my hands in existential, angst-ridden despair. The whole affair seems amateurish in comparison to the intricate original. So do I think Episode II has a lot of problems? Yes. Will it disappoint you as it did me? Probably. But if you're a fan of the original, do I still think you should play this one? As much as it's going to hurt &#8211; definitely.Rated:7.5 out of 10Editor:Matt MillerSubscribe to Game Informer--Amazon.com", "price": 212.69, "imUrl": "http://ecx.images-amazon.com/images/I/51EFTE269NL._SY300_.jpg", "related": {"also_bought": ["B000G82R20", "B00005BW7Q", "0744004691", "0744002397", "B0002GTFIK", "0744008301", "B000G7X5P4", "B00029QQNY", "B000038IFX", "B00006LEMK", "B00008KTRS", "B00006LEM8", "B000784XG2", "B00007KQC1", "B000E0VMVM", "B00005T7ZN", "B000F5IH2I", "B00006B5T8", "B00KVRK39A", "B00024W1U6", "B000G77X34", "B0009A4EUI", "B0009A4EV2", "B0002SQ0AY", "B000R2YWEQ", "B000AVBFU8", "B000BKSGH8", "B00006Z7HR", "B00KWFCU4M", "B000FPGZUE", "B000CC5CHW", "B000094M46", "B00005T7ZP", "B00004ZDFY", "B000G7X5MM", "B000TLU67W", "B001QTW2GY", "B000DZTRHE", "B000784XEE", "B00008O0YD", "B001C6GVI6", "B000IONGU4", "B000038ABO", "B001CM62UM", "B0014CN2H6", "B000FIVC2W", "B002I0J4AM", "B000G0O6CW", "B00019HNNM", "B00009YEJY", "B0009A4ETY", "B000FIU1BK", "B00004TC6E", "B002DC8GW2", "B0009K7ESM", "B001GMSHSI", "B001E7MMOK", "B00BY0G0YU", "B00I3DOZ8O", "B00007KUUD", "B000FDOTIQ", "B00004W4QJ", "B000FUG5TK", "B000E5N4RW", "B00000JRSB", "B000M46V20", "B000F8O1C0", "B00IZ9T9QE", "B0000A09EM", "B001CM0PJ6", "B0009XBWY6", "B00004Y57G", "B00JQI471A", "B0001A86EG", "B00K85X1W6", "B00KWFY04A", "B0009Z3KB2", "B000NGQ26C", "B000G7X5OK", "B000066TS3", "B0000296O5", "B00K6ZNX3K", "B00004XMRL", "B00KWEHBAG", "B0002CHIWO", "B00006FDLM", "B00008URUA", "B00LBAM588", "B00K85X1TE", "B00004RBQX", "B007CSF3GO", "B002DPUJCE", "B0002IASJ8", "B00002SVWG", "B0016C3260", "B006MBZZSI", "B001DT8FUE", "B002E6XY6K"], "bought_together": ["B00005BW7Q", "B000G82R20"], "buy_after_viewing": ["B00005BW7Q", "B000G82R20", "B0002GTFIK", "0744004691"]}, "salesRank": {"Video Games": 4716}, "categories": [["Video Games", "More Systems", "PlayStation 2"]]}