{"asin": "B005DIBHA6", "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS"]], "description": "Let n&uuml;vi 2595LMT lead the way with its big 5\" (12.7 cm) touchscreen  display and powerful navigation features. It includes FREE lifetime  traffic&sup1; and map&sup2; updates, voice activation and more.Navigate By Touch or By VoiceWith its innovative voice-activated navigation, you can control n&uuml;vi  2595LMT with your voice &mdash; allowing you to keep both hands on the wheel.  Simply wake up n&uuml;vi with a customizable voice command and begin  speaking menu options that are clearly displayed on the screen. When  you&rsquo;re stopped, you can still control the n&uuml;vi using its intuitive  touchscreen interface.Garmin Guidance 2.0 allows you to easily look up addresses and  services and be guided to your destination with voice-prompted,  turn-by-turn directions that speak street names. It comes preloaded with  maps for North America. It also comes preloaded with more than 8  million points of interest (POIs) and offers the ability to add your  own.Avoid Traffic Tie-upsWith lifetime traffic updates from 3D Traffic,  our most extensive traffic avoidance system, n&uuml;vi 2595LMT can help you  avoid delays. We check traffic conditions more than 2 billion times each  month, so you can easily reroute around congestion and arrive on time.Lifetime Map UpdatesWith FREE lifetime map updates, you always have the most up-to-date  maps, POIs and navigation information available at your fingertips. Map  updates are available for download with no subscription or update fees  and no expiration dates.Know the Lane Before It&rsquo;s Too LateNow there&rsquo;s no more guessing which lane you need to be in to make an  upcoming turn. Available in select metropolitan areas, photoReal  junction view makes unfamiliar intersections and exits easy to navigate.  When you approach an exit or interchange, n&uuml;vi 2595LMT will enter split  screen mode and show you a realistic depiction of junctions on your  route, complete with road signs and arrows that indicate the proper lane  for navigation.Go Beyond NavigationPoint-to-point navigation is just the beginning. Share information  and Live Services between n&uuml;vi 2595LMT and your compatible Android phone  with Smartphone Link.  n&uuml;vi 2595LMT also features a microSD&trade; card slot so you can store and use detailed cityXplorer&trade; maps or download custom voices and vehicles for free from the Garmin Garage&trade;.  Bluetooth&reg; connectivity lets you make and take hands-free calls, while  dual-orientation functionality lets you hold the n&uuml;vi vertically or  horizontally for added convenience driving or walking.The &ldquo;Where Am I?&rdquo; emergency locator provides your exact latitude and  longitude coordinates, the nearest address and intersection, and the  closest hospitals, police stations and more, while Enhanced Exit  Services tells you what services you&rsquo;re approaching on the highway.What's In The Boxn&uuml;vi 2595LMTPreloaded City Navigator NT North America (U.S., Canada, Mexico, Puerto Rico, U.S. Virgin Islands, Cayman Islands and Bahamas)Lifetime maps and traffic (indicated by &ldquo;LMT&rdquo; after model number on the box)3D traffic receiver with vehicle power cable (the vehicle power cable is also the 3D traffic receiver)Vehicle suction cup mountUSB cableQuick start manual&sup1;FREE lifetime traffic updates may not be transferred to another    person or another Garmin product. Lifetime traffic extends for the    useful life of your Garmin traffic receiver (as long as you own a    compatible Garmin GPS) or as long as Garmin receives traffic data from    its traffic supplier, whichever is shorter. A traffic receiver&rsquo;s  &ldquo;useful   life&rdquo; means the period during which the receiver (a) has the  required   technical capabilities to utilize current traffic data  service and (b)   is capable of operating as intended without major  repairs. Traffic   content not available for all areas. See traffic  coverage areas.&sup2;If you purchase a n&uuml;Maps Lifetime  subscription (sold separately   or bundled together with certain GPS  models), you will receive up to 4   map data updates per year, when and  as such updates are made available   on Garmin&rsquo;s website, for 1  compatible Garmin product until your   product&rsquo;s useful life expires or  Garmin no longer receives map data from   its third party supplier,  whichever is shorter. A product&rsquo;s &ldquo;useful   life&rdquo; means the period  during which the product (a) has sufficient   memory capacity and other  required technical capabilities to utilize   current  map data and (b)  is capable of operating as intended without   major repairs. A product  will be deemed to be out of service and its   useful life to be ended if  no updates have been downloaded for such   product for a period of 24  months or more. Unless otherwise stated, the   updates you receive under  the subscription will be updates to the same   geographic map data  originally included with your Garmin product when   originally  purchased. In some instances, your Garmin product might not   have  sufficient memory remaining for you to load an update to the map   data,  in which case you will need to either (a) select reduced map data    coverage for your updates, or (b) purchase separately a microSD&trade;/SD&trade;    card (if and as applicable to your Garmin product) and load all or a    portion of the map data coverage for your updates to the card and insert    the card into the microSD/SD card slot contained in your Garmin    product. If neither of the measures in (a) or (b) can be used to address    your product&rsquo;s lack of sufficient remaining memory, then Garmin may    conclude that the &ldquo;useful life&rdquo; of your product has expired. Garmin may    terminate your n&uuml;Maps Lifetime subscription at any time if you  violate   any of the terms of this agreement or your subscription. Your  n&uuml;Maps   Lifetime subscription may not be transferred to another Garmin  product.", "title": "Garmin n&uuml;vi 2595LMT 5-Inch Portable Bluetooth GPS Navigator with Lifetime Maps and Traffic", "price": 139.99, "imUrl": "http://ecx.images-amazon.com/images/I/51VRmcI-UrL._SY300_.jpg", "brand": "Garmin", "related": {"also_bought": ["B004I5BUSO", "B002OL2MU4", "B00DSRKTNA", "B00BB2NMJC", "B00INXAIDK", "B00INXAY9S", "B00AJFTHX2", "B008H6176U", "B00BXQ0370", "B0096DM9YC", "B00422KZQG", "B00GYDYV0C", "B00CRQUKQ4", "B001S2RCWI", "B004HYGEOQ", "B0035JL4V2", "B000LRMS66", "B007RMAS1K", "B005CWJAZ2", "B00B1OZ7OS", "B00F0CXAF0", "B00BGKQHQ4", "B00JAULSTI", "B001BZM998", "B00GK5YIIO", "B007KCV0RS", "B000BS6RF8", "B005HN1UIG", "B000MNA3BG", "B0015A6YN6", "B0017ZG538", "B0051FWA7U", "B00488G6P8", "B000F7857S", "B001EPX7N2", "B002KO5XVU", "B002IUG14O", "B003YJ8TVQ", "B0057ODG6Y", "B006SU0SX0", "B00D82O68Y", "B000S5Q9CA", "B00E055H5O", "B007BFKNUE"], "bought_together": ["B002OL2MU4", "B004I5BUSO"], "buy_after_viewing": ["B00AXX0I88", "B002OL2MU4", "B004I5BUSO", "B00AXZWG8Q"]}}