{"asin": "B0017XFP8G", "description": "Tom Clancy's HAWXfor PS3 puts you behind the throttle, in the fighter pilot's seat. As a member of the elite HAWX squadron, you'll find yourself manning cutting-edge aircraft, training on all the newest weapons, and carrying out dangerous top-secret missions set against the backdrop of a chaotic future, where private military companies (PMCs) are constantly putting your skills to the test and forcing you to defend your reputation as one of the top military pilots on Earth..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; } img.withlink {border:1px black solid;} a.nodecoration {text-decoration: none}Fly alone or work with other pilots.View larger.Let E.R.S. help you demonstrate your skills.View larger.Experience photo-realistic environments.View larger.Perform tricky maneuvers to try and escape brutal dogfights alive.View larger.Take on secretive, black-op missions all over the world.View larger.Shifting International Dynamics: The Hazards of PMC WarfareSet betweenTom Clancy's Ghost Recon Advanced Warfighter 2andTom Clancy's EndWarfrom the popular Ghost series,Tom Clancy's HAWXtakes place in a world where warfare is constantly evolving--a time when state-sponsored militaries lack the funds and personnel to modernize their forces and elite, private mercenary groups have grown in size and scope to pick up the slack.The Reykjavik Accords of 2012 defined the role of these PMCs in combat, and they made it fully legal for these groups to purchase from the international armaments market, leading to a shift in the structure of global military power. Over time, you'll do battle on the front lines of both sides as this shift reveals high-stakes arms threats and a terrifying glimpse of the future.HAWX: The Elite, High Altitude Warfare eXperimental SquadronYou'll begin the game as former U.S. Air Force Pilot David Crinshaw, assigned to provide air support for the well-known Ghost Recon team. You and your fellow HAWX pilots are some of the most highly-trained specialists in the world. Based out of Langley Air Force Base in Virginia, you're tasked with everything from testing secret and experimental aircraft weapon systems to carrying out combat and recon missions, training other top pilots, and attempting to capture enemy technologies.With the rise of the PMCs, your unique skills in higher demand than ever before. And with 49 playable planes available in game, plus additional planes available to some pilots through pre-order bonuses or VIP memberships, there's no shortage of sleek, fast, deadly aircraft at your disposal as you put your skills to use.An Iconic, Enhanced Reality System to Help You Deliver ResultsWhen you're in the midst of a firefight, E.R.S. in-game technology can help anyone survive, if you know how to take advantage of it. Featuring incoming missile detection, an anti-crash system, damage assessment, a tactical map, and weapons trajectory control, E.R.S. even allows you to issue orders to your squadron and other units, much like the iconic Cross-Com system in other Tom Clancy games. When you're getting started, you can ease into the rigors of flight and gain confidence by using a special assistance mode that offers support through the E.R.S. This mode can be switched off at any time, deactivating safety features and allowing you to perform advanced maneuvers.Cutting-Edge Realism and Innovative Multi-Player ModesWhether you're in a classic F15 Fighting Falcon or a new-generation Gripen, the controls and flight graphics are designed to keep you on your toes. And the game's photo-realistic environments have been created using detailed satellite data. When you pull back on the throttle to jet all over the world, you'll experience this authentic world from a variety of viewpoints.Game play options aren't limited either, with the campaign featuring solo and multiplayer options with seamless jump in/jump out functionality, and a PVP mode where players can challenge each other to dog-fights for bragging rights, earning experience points and cash, and unlocking additional weapons.", "price": 127.28, "imUrl": "http://ecx.images-amazon.com/images/I/61Hq9NTZiJL._SY300_.jpg", "related": {"also_bought": ["B003MUNFW0", "B003VKLA6O", "B005FYJB9M", "B001NY42J2", "B000HXDKA2", "B0057PERIY", "B001CXYMFS", "B000PS4XB4", "B00C3MKA30", "B0042GW7BI", "B00G9DFMDW", "B004XIQN1K", "B004EDJOYC", "B000M4KJ32", "B002ZJNWWC", "B001HZ30JA", "B005EZ5GW8", "B005EZ5H36", "B0085VIHQU", "B0050SXOD2", "B0037LVW9M", "B001COV1CY", "B006Y76HXM", "B002ELCV00", "B0002CHIUQ", "B000FQBF1M", "B008E6ZXMM", "B0016B28WU", "B001C4DKG4", "B000HGOHWO", "B000PS4X9G", "B000V1OUVI", "B0010EI6T2", "B002BRZ6UE", "B006JKARN0", "B000GA73O0", "B00149V3CU", "B002I0J82G", "B007XQY7E4", "B001QXNBNI", "B000MUW98O", "B000HCMR8E", "B00269QLH4", "B00109KMQ2", "B0050SWZHS", "B001TORSHO", "B000JLIYLC", "B00FQFFPZO", "B000N4MSAS", "B000WS97QI", "B003R7H5TC", "B00503E9FY", "B004HCYVO8", "B000RHZ9G6", "B001TOMQOY", "B00104KCF8", "B000FPOJOS", "B00G6MW4SM", "B001AWBYNE", "B000UU7VUC", "B00488PZ2S", "B002BSA1C6", "B0030CYE8O", "B0056WJA6C", "B000TG72TM", "B00149ILDO", "B0050SXGU8", "B002I0K6DG", "B003O6ECOM", "B003JVCA9Q", "B0016GABR4", "B002DC8GKO", "B00AJGVIBA", "B0086V5V8G", "B004L5SJ58", "B001441550", "B0076ZQSFI", "B001AZFSEW", "B000WJFZEA", "B003VWGBBG", "B003HFC22Y", "B002BRZ744", "B003GT8IL0", "B003P9FRGA", "B002I0J5YW", "B000ZK9QCS", "B0030F1DOO", "B004PFN52G", "B0056WJA4E", "B0050SX2MK", "B001UWGCW2", "B00170823O", "B003Q55YCU", "B0053BSOD6", "B0050SWSQQ", "B008BT80O0", "B0044SA734", "B0033PKTCS", "B000U1OOH4", "B0029CSOBY"], "bought_together": ["B003MUNFW0", "B001CXYMFS"], "buy_after_viewing": ["B003MUNFW0", "B003VKLA6O", "B0057PERIY", "B0042GW7BI"]}, "salesRank": {"Video Games": 12657}, "categories": [["Video Games", "PlayStation 3", "Games"]]}