{"asin": "B003ARSO08", "description": "The iP46 is a sleek speaker system that's ready to rock anytime, with SRS TruBass circuitry and four speakers in Reson8 chambers, for an exceptional audio experience. The retracting universal dock charges and plays iPhone and docking iPod models, and a rechargeable lithium-ion battery lets you enjoy music anywhere without worrying about batteries.A sleek and portable iPod docking speaker with a rechargeable battery.Click to enlarge.Convenient controls on top of the speaker.Ported speaker chambers and SRS TruBass processing help deliver great sound in a small package.Retracting Universal DockFits iPhone and docking iPod models, with no inserts needed. While connected via the AC adapter, the iP46 will charge your iPod.Rechargeable BatteryTake your music anywhere thanks to the iP46's rechargeable battery. Simply plug into an AC outlet to charge up--a charge indicator on top of the speakers will glow when it's ready.Fold It UpThe iP46 boasts a folding support and stand, along with the retracting iPod dock, to make it ultra-portable.SRS TruBassiHome utilizes DSP (digital sound processing) technology to give your music extra bass and clarity. SRS TruBass uses harmonics to make the bass from small speakers deeper and richer, so you get a more dynamic bass sound when you switch it on.Reson8 Speaker ChambersThe iP46 utilizes Reson8 speaker chambers. Reson8 is iHome's through-body ported speaker chamber technology. Porting speakers gives better bass response characteristics, and helps the iP46 deliver sound beyond its size.Universal 100-240V AC AdapterSwitching power supply works just about anywhere in the world to power your unit.Auxiliary InputListen to external audio sources like computers, CD players, or MP3 players using the auxiliary input.What's in the BoxiHome iP46 portable speaker system for iPod, AC adapter, and user's manual.", "title": "iHome iP46 Portable 30-Pin iPod/iPhone Speaker Dock", "price": 54.95, "imUrl": "http://ecx.images-amazon.com/images/I/41gziFvs3DL._SX300_.jpg", "related": {"also_bought": ["B008R68DFS", "B007JAQBZW", "B008HB8LIM", "B0013TPJ58", "B001G5Z82I", "B00AB2OQNO", "B00CSX2KFK", "B006H86GK2", "B009A5EIWC", "B009NZ6SZE"], "buy_after_viewing": ["B003VWW3Q8", "B007JAQBZW", "B001S0JZKW", "B00BDS0512"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}