{"asin": "B006MA9XXM", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]], "description": "The Brainwave HM5 studio monitor headphones provide for exceptionally accurate sound reproduction, their neutral sound signature replicate audio as it was intended to be heard. The HM5 feature an over the ear design which sits comfortably, providing an adequate seal that limits leakage. These closed dynamic monitor headphones are designed to give astounding sound for almost any genre of music and like all Brainwave the headphones have a simple but stylish look to them. Included in the package are two detachable cables, a short 1.3 meter cable that is intended to be used with a portable rig and a larger 3 meter cable for use in a home environment. The large 43mm CCAW drivers are surprisingly easy to drive, but they do benefit with mapping if used with a portable rig. Features: Neutral sound signature 1.2m and 3m detachable cables included, use with your portable rig or home rig Large, comfortable over the ear cups Specifications: Transducers/Drivers: Closed dynamic, 42mm Rated Impedance: 64ohms Sensitivity: 105dB at 1mW Frequency range: 10~ 26.5KHz Rated input power: 100mW Plug: 3.5 mm gold plated Cable length: 1.3 meters and 3 meter detachable cables 1 year warranty Included Accessories: 1 x 1/4Inch adapter 1 x extra set ear pads 1 x airplane adapter 1 x 1.3m detachable cable 1 x 3.0m detachable cable 1 x Instruction manual 1 x Warranty card", "title": "Brainwavz HM5 Studio Monitor Headphones", "price": 129.5, "imUrl": "http://ecx.images-amazon.com/images/I/41QfgEbza9L._SY300_.jpg", "brand": "Brainwavz", "related": {"also_bought": ["B00029MTMQ", "B0093PVTPS", "B005HJWWW8", "B004QVPGXK", "B0053KWDES", "B00FSA8VQ2", "B005VO7LG6", "B002Z9JWZS", "B00858I4F2", "B003UCESP8", "B00CICPMA6", "B0070UFMOW", "B003N0XDT4", "B00AE0IEHM"], "bought_together": ["B00029MTMQ"], "buy_after_viewing": ["B0093PVTPS", "B000ULAP4U", "B00HVLUR86", "B002Z9JWZS"]}}