{"asin": "B00GJFGDUQ", "categories": [["Electronics", "Car & Vehicle Electronics", "Vehicle Electronics Accessories", "Audio & Video Accessories", "Bluetooth Car Kits"]], "description": "iClever HimboxThis iClever Himbox Bluetooth car kit is developed for easy installation in motor vehicles to enable hands-free operation. With this kit, you can use the car stereo system to relish the music saved in your cellphone and answer incoming calls without having to pick up your phone. As a big bonus, this car kit is equipped with dual USB ports car charger, so while it is working you can have a digital device juiced up.Other Features:-Allows you to talk hands-free on your Bluetooth-enabled phone-Support AVRCP technology for easy-to-use music controls-Auto-connect with last paired device-Music player controls - Play, Pause, Previous song, Next song; Talking controls: Answer and reject calls, private call is available-Can also be used as a Bluetooth receiver to enable ordinary loudspeakers with Bluetooth functionality.(Powered via USB port)- Activates Siri when control button is pressed for 1~2 seconds; Note: If it is in sleep mode, you will need to press the control button twice (short-press to wake it up and then long-press for 1~2 seconds)- Automatically calls back the last outgoing call when control button is quickly pressed twice-Magnetic base is more easily detachable from the controller compared with sticky bases.Note:To connect this Bluetooth car kit to your car stereo system, it must be ensured that your car stereo has a 3.5mm Aux-In jack. Besides, for home entertainment, with this kit you may add Bluetooth connectivity to a loudspeaker without Bluetooth functionality.Package Content:- 1Bluetooth Car Kit- 1Bluetooth Car Kit Base- 1Car Charger with Dual USB power port- 1User Manual", "title": "iClever Himbox HB01 Bluetooth 4.0 Hands-Free Car Kit for Cars with 3.5 mm Aux Input Jack (Convenient Siri / Voice Activation, Dual USB Car Charger and Magnetic Base Included) - Black", "price": 35.99, "salesRank": {"Cell Phones & Accessories": 7539}, "imUrl": "http://ecx.images-amazon.com/images/I/41w5%2B22s5CL._SY300_.jpg", "related": {"also_bought": ["B00JK0G8KC", "B001EAQTRI", "B00007FGUF", "B009NLTW60", "B00GTGETFG", "B009ORPHYY", "B004CLYJ2I", "B000143C0K", "B009UEBQIM", "B00C28L6EW"], "bought_together": ["B001EAQTRI", "B00007FGUF"], "buy_after_viewing": ["B009NLTW60", "B001EAQTRI", "B00JK0G8KC", "B00I61P46A"]}}