{"asin": "B002JCSV5I", "related": {"also_bought": ["B0064U0YGK", "0470578947", "B002YOFR9Y", "B004KU827O", "B0041PJ9PC", "B003VNKNEQ", "B0039BPG1A", "B004B76430", "B00CV9MITY", "B00G4GJR3K", "B003P9W6VE", "B00J39C5MU", "B000NG67E4", "B0009HN57Y", "B00CV9MIEE", "B004LTF5RO", "B004JMZPJG", "B002Z8LDXI", "B002ONWJOG", "B005ERKVDU", "B004XWNDUA", "B003VNKNF0", "B009YTVIUE", "B00D5QPVUK", "B003L1ZYZ6", "B000O161X0", "B0061MRHZW", "B004DEKH84", "B003HMRRHM", "B002HZY5F2", "B00BJXZ4IU", "B008JRXH92", "B0041PJAJC", "B003L89SU6", "B0012OGF6Q", "B003D8O160", "0470582073", "B00006I5J7", "B00CV9M3GW", "B005ERKVC6", "B002MGQKCW", "B0049I48JI", "B000ZMCILW", "B00CDS9EKE", "B008BLRK4Y", "B003U3H5CK", "B0051G9ZTK", "B004LEAYXY", "B00CF5OHZ2", "B004LT9MNM", "B0033ZCXSG", "B000LWJ1ES", "B0026FCKAA", "B005OZ4BME", "B005PREXF6", "0205933807", "B001T9N120", "B00FEY212W", "B003VNKNEG", "B0083WY9RW", "B003ZSHNCC", "B002VPE1WK", "B0055I2K32", "B0037T6OBK", "B00004ZCJG", "B0056KENXO", "B003ZYF3LO", "B0037TEO3K", "B0080JH3YE", "B00A03LSYE", "B005KP473Q", "B0042X9LC4"], "bought_together": ["B003VNKNEQ"], "buy_after_viewing": ["B003ZYF3LO", "B003VNKNF0", "B007VGGFZU", "B003VNKNEQ"]}, "title": "Nikon D3000 10.2MP Digital SLR Camera with 18-55mm f/3.5-5.6G AF-S DX VR Nikkor Zoom Lens", "price": 444.0, "salesRank": {"Camera &amp; Photo": 1246}, "imUrl": "http://ecx.images-amazon.com/images/I/517%2BbpHK4HL._SX300_.jpg", "brand": "Nikon", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Camera Bundles"]], "description": "Breathtaking digital SLR image quality and easy operation highlight the 10.2-megapixel D3000--Nikon's friendliest DSLR ever. Compact and capable, the D3000 is compatible with a broad range of world-famous Nikkor lenses and includes the versatile 3x, 18-55mm Zoom-Nikkor with Silent-Wave Motor autofocusing and Nikon VR image stabilization to combat picture blur caused by camera shake for sharper handheld pictures. Special moments are captured faithfully at up to 3 frames-per-second and displayed on a bright, 3-inch LCD monitor. The D3000's split-second shutter response eliminates the annoyance of shutter lag. To further simplify picture-taking in special situations such as portraits, sports, landscapes, and more, the D3000 features icon-identified Scene Modes that deliver beautiful results automatically in otherwise complex situations. Additional Nikon technologies elevate picture quality and guard against picture-taking mistakes. Fast, accurate 11-point autofocus delivers razor sharpness. 3D Color Matrix Metering II and Nikon EXPEED image processing work with an exclusive Scene Recognition System for precise automatic exposures and rich, vivid color. Making the D3000 an even smarter choice are its exclusive Re-touch functions for creative fun and the onboard Guide Mode that's ready to lend a reassuring hand to take the pictures you've always wanted.Nikon D3000 Highlights10.2-megapixel DX-format Imaging SensorDelivers extraordinary image quality for breathtaking prints up to 20 x 30 inches.Includes 3x 18-55mm Zoom-Nikkor VR Image Stabilization LensLegendary Nikkor optical quality and fast, accurate autofocus means vivid color, striking contrast and crisp detail, while VR image stabilization assures your sharpest pictures ever.Compact DesignBeautifully styled--Ready to go where life takes you.Easy-To-Use--Featuring Nikon Guide ModeIntuitive controls and the on-board Guide Mode assist you every step of the way.Split-second Shutter ResponseEliminates the frustration of shutter delay, capturing moments that other cameras miss.Continuous Shooting up to 3 Frames-Per-SecondCapture fast action, precious moments and fleeting expressions confidently.6 Automatic Exposure Scene ModesJust set the Mode dial to Portrait, Landscape, Child, Sports, Close-up or Night Portrait for stunning results in otherwise challenging conditions.3-inch Color LCD MonitorBright, high-resolution, 170-degree wide-angle viewing for easy picture review and sharing.In-camera Image EditingThe Retouch Menu provides creative freedom, without the need for a computer, offering 13 easy editing functions, including Trim, Red-eye Correction and Soft Filter.Nikon EXPEED Image ProcessingAssures breathtakingly rich image quality, managing color, contrast, exposure, noise and speed.Automatic Image Sensor CleaningUltrasonic process and exclusive Airflow Control combats the accumulation of dust in front of the image sensor, safeguarding image quality shot after shot.11-point AutofocusFast and accurate autofocus delivers razor-sharp pictures.6 Personal Picture Control SettingsChoose from Standard, Neutral, Vivid, Monochrome, Portrait, or Landscape to apply a personal look and feel to your pictures.Active D-LightingRestores picture-enhancing detail in shadows and highlights.ISO sensitivity from 100-1600Exceptional results, even in challenging low-light situations.What's in the Box18-55mm f/3.5-5.6G AF-S DX VR Nikkor Zoom LensRechargeable Li-ion BatteryQuick ChargerEyepiece CapRubber EyecupUSB CableCamera StrapBody CapAccessory Shoe CoverSoftware Suite CD-ROM"}