{"asin": "B0019FJM7W", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]], "description": "The new Olympus E-520 digital single lens reflex (DSLR) camera delivers brilliant images thanks to advanced technologies that help take the blur out. Industry leading Image Stabilization built into the portable camera body compensates for movement so that images are sharp and blur-free with any lens and even at slow shutter speeds. Autofocus Live View brings subjects into sharp focus on the camera&#x92;s HyperCrystal II LCD. Together, these technologies produce amazing results, along with the following features that further expand the DSLR experience:In-Body Image Stabilization with Supersonic Wave Drive technology provides blur-free images when using any of the more than 30 digital-specific lenses;Face Detection Technology targets and locks on faces to ensure they are in focus and blur-free for amazing portraits;Shadow Adjustment Technology opens up detail in the shadows that other cameras would render too dark or underexposed while maintaining detail in the highlights; andPerfect Shot Preview enables photographers to view and select White Balance and Exposure Compensation effects right on the LCD, and see how the image will look before they even capture it.Evolt E-520 Highlights10-megapixel Live-MOS SensorGet amazingly detailed, colorful and clear images with the 10-megapixel Live-MOS image sensor. This high-resolution sensor captures all the detail needed to make large prints, or even crop without losing detail. The E-520 sensor's high dynamic range, accurate color rendition and low noise characteristics let you capture great images, even at high ISO settings.Enhanced In-Body Image StabilizationFor the first time, in-body Mechanical Image Stabilization has three modes for increased versatility. IS-1 mode for general shooting adjusts the sensor on both the X and Y axes to compensate for movement by the photographer so images stay sharp even at slow shutter speeds. To capture the motion of athletes and animals, and other moving subjects, the E-520 offers two specialized modes. IS-2 mode is ideal for capturing a racecar flying down the track, preserving the sense of motion while panning with the moving subject and holding the camera horizontally to dramatically portray the car&#x92;s high speed. For sharp images of moving subjects like a basketball player charging up the court, the IS-3 mode allows a photographer to hold the camera vertically while panning. The artistic effects of panning enhance the shot and render the player in sharp detail with blurred background.The Live View ExperienceThe portable E-520&#x92;s advanced autofocus Live View enables photographers to compose their images and bring them into sharp focus on the HyperCrystal II LCD -- just like a point-and-shoot camera. By simply pressing the shutter button halfway, subjects come into focus on the LCD, so when the perfect moment occurs it is easy to compose, focus and capture sharp images while viewing on the LCD. Live View makes it possible to shoot upward from a low angle for dramatic composition, in close for detailed macro photos of an exotic insect, or over a crowd of people at a tennis tournament.New and Improved HyperCrystal II LCDThe E-520&#x92;s viewable HyperCrystal II LCD is the key to its Live View capabilities. While some LCD screens force photographers to squint to preview images in bright sunlight or a dimly lit room, the E-520 features a large, bright 2.7-inch LCD display that incorporates new technology. It also offers twice the contrast for better viewing in extreme light conditions, a larger color gamut that displays a greater range of color detail, and a 176-degree viewing angle.Always Find a Face in the CrowdThe E-520&#x92;s Face Detection reduces the chance of blurred subjects in photography by distinguishing between people&#x92;s faces and the background. It tracks up to eight faces within the image area even if people are moving and automatically focuses and optimizes exposure for sharp, brilliant portrait pictures.In Sunshine or the Shadows, Never Miss a DetailShooting scenes with shadows can be tricky because of the extreme contrast between dark and bright areas. The E-520 addresses this challenge with Shadow Adjustment Technology that compensates for extreme contrast and maintains visible detail in both the shadow and highlight areas of the scene. Now users can preview and capture images showing the shadow detail they saw. This feature is also available in the Edit menu after the shot has been taken.Preview a Multitude of PossibilitiesPerfect Shot Preview enables users to preview and select from a variety of thumbnail previews of the photographic effects of white balance and exposure compensation adjustments live on the LCD before taking the photograph. It is an ideal way for novice users to learn about the effects of different photography techniques, visually, without having to scroll through menu options. With 20 preset scene-select modes for every imaginable shooting scenario from underwater photography to fireworks, and program, automatic modes and full manual controls, the E-520 offers a world of possibilities to photographers.Experience Life under the SeaOlympus will offer the PT-E05 optional underwater housing for the E-520 to allow photographers to document the richness of life in the depths. Capable of reaching depths of 130 feet underwater, the housing will ensure that divers will not miss an image during their journeys to the abyss. Special underwater scene modes on the E-520 will assure that the camera is set up correctly for underwater use.Wireless Flash CapabilitySometimes wireless flashes can help photographers cast the best light on their subjects and capture great images. For this reason, the E-520 is compatible with the Olympus FL-50R and FL-36R wireless electronic flashes that are designed exclusively for digital photography. When these flashes are used in combination with the E-520, wireless multi-flash photography is possible. The E-520 can control up to three wireless flash groups independently, with multiple flash units in each group.TruePic III for Image Clarity &amp; SpeedThe 10.1-megapixel E-520&#x92;s TruePic III Image Processor produces crystal-clear photos using all of the pixel information for each image to provide the best digital images possible for every photo with accurate color, true-to-life flesh tones, brilliant blue skies and precise tonal representation in between. TruePic III also lowers image noise by one step to reduce graininess in images shot at higher ISO settings, enabling great results in low-light situations.Dust Reduction System for Spot-Free ImagesLife moves too fast to spend time worrying about dust ruining the perfect image. Olympus&#x92; proven Dust Reduction System produces spot-free photos with the exclusive Supersonic Wave Filter. The patented ultrasonic technology vibrates to remove dust and other particles from the front of the image sensor and captures it on a special adhesive membrane every time the camera is turned on. These spot-free photos liberate users from hours spent retouching photographs at the computer or sending their cameras back to the manufacturer to remove dust trapped inside.Easy to Handle, Easy to OperateThe E-520 is extremely portable, measuring 5.35 inches (width) by 3.6 inches (height) and 2.68 inches (depth), excluding protrusions, and weighing 16.75 ounces (body only). The new camera has a classic penta-mirror design that is light and compact enough to shoot with all day. It features a comfortable ergonomic grip to ensure that the camera fits snugly in the hand. Beyond its portable size, the E-520 has an expanded menu for greater control and buttons on the body for quick and easy direct access to the most common settings. Accepting both CompactFlash Type I &amp; II, Microdrives and xD-Picture Cards, the camera provides a choice of data-storage options for enhanced flexibility, and it is possible to transfer image files from one card to the other right inside the camera.What's in the BoxE-520 body, USB cable, video cable, Li-Ion battery pack (BLM-1), Li-Ion battery charger (BCM-2), shoulder strap, Olympus Master software CD-ROM, manuals and warranty card", "title": "Olympus Evolt E520 10MP Digital SLR Camera with Image Stabilization (Body Only)", "price": 13.99, "salesRank": {"Camera &amp; Photo": 15051}, "imUrl": "http://ecx.images-amazon.com/images/I/51O75U4kG8L._SX300_.jpg", "related": {"also_viewed": ["B0015AUUFY", "B000NVXF26", "B0015ASYJ8", "B000BK39DE", "B001TX9P6W", "B001TXKQBK", "B0042X9MNM", "B000X1T3IQ", "B001K3JPRA", "B000SSLR5Q", "B0029U0WWU", "B00EQ07PG2", "B0000TU7I6", "B00061UHDS", "B002CGSYL2", "B003BR8BE6", "B000XCQ0LI", "B000BTFZMS", "B002CGSYKI", "B0007QKMQY", "B005JRIJWA", "B0006NAB9G", "B002GILU44", "B009DH437M", "B00370X0WA", "B004HO59M4", "B005EZKFBU", "B0066J6EOU", "B0099W56DQ", "B006ZAHN18", "B0035LBRJO", "B001CBKJGG", "B0096WDEQK", "B0091TC3OC", "B005EZTLM4", "B0096WDMGC", "B000Q639S8", "B005KYLG0E", "B004J2LMJ8", "B002JCSV5I"], "buy_after_viewing": ["B0015AUUFY", "B000W05O5O", "B001FO4QHI", "B001XX38KW"]}}