{"asin": "B0012Q72IY", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]], "description": "With an easy-to-use interface housed in a compact body, the new Pentax K200D contains all the advanced imaging technology of the award-winning K10D, but is designed for new digital SLR users who want a camera that will allow them grow as they learn about photography.  With 10.2 megapixels and a 2.7-inch wide-view LCD, the K200D features many of the award-winning advancements of the Pentax Series including:Auto Picture and Scene modes that offer shooting ease, while advanced modes, such as the Sv mode, allow photographers to grow with the camera.A weather and dust-resistant body, unique in this class of cameras, that allows photographers to keep shooting even in harsh conditions.Custom Image functions that allow users to select between six preset options and further adjust image processing, including saturation, hue, contrast and sharpness.  The K200D also offers an Expanded Dynamic Range function that allows users to gain more contrast and detail in bright settings.An improved Dust Reduction system that features the new Dust Alert function to pinpoint the exact location of dust particles for the photographer to remove.A Pentax-developed Shake Reduction (SR) system for sharp, blur-free images even under difficult shooting conditions, such as macro and telephoto photography or low light settings without a flash.Pentax K200D Digital SLR HighlightsHigh-quality image sensorThe K200D combines a large, high-performance 23.5mm x 15.7mm CCD image sensor with the sophisticated PRIME (Pentax Real Image Engine) as its imaging engine. With its approximately 10.2 effective megapixels, the K200D produces beautiful, fine-detailed images with subtle gradations and texture.Pentax Original Shake Reduction MechanismThe K200D is equipped with the Pentax-developed Shake Reduction mechanism, which reduces camera shake for sharp, blur-free images even under demanding shooting conditions, such as shooting with a telephoto lens, shooting in low light conditions or at night without supplementary flash illumination, or using extended exposures for sunset scenes. This innovative mechanism offers outstanding compensation equivalent to approximately 2.5 to 4 shutter-speed steps.  In addition, the lighter image sensor unit and refined data-control algorithm offer improved image stabilization over previous models.  Pentax Shake Reduction is compatible with existing Pentax interchangeable lenses.**Lenses compatible with this mechanism are: Pentax K-, KA-, KAF- and KAF2-mount lenses, screw-mount lenses (with an adapter); and 645- and 67-system lenses (with an adapter). Some functions may not be applicable with certain lenses.Versatile Auto Picture And Scene modesThe Pentax-developed Auto Picture mode automatically sets the most appropriate shooting mode (such as Portrait, Landscape and Macro) for a given subject or situation. Since the K200D not only sets an aperture and a shutter speed, but also adjusts white-balance, saturation, contrast and sharpness levels, the photographer can concentrate on image composition and shutter opportunity.  The K200D also offers eight Scene modes for easy shooting.  This include fun options such as sunset, food, pet, and museum modes.Large, 2.7-inch wide-view LCD monitorThe K200D features a large 2.7 inch color LCD monitor. The LCD&#x92;s wide-view design allows the photographer to check the monitor image from approximately 160 degrees both vertically and horizontally making image sharing immediately after capture easy. It even offers digital zooming of playback images up to 20 times for easy confirmation of focus.Dust-proof, water-resistant constructionThe K200D features an extremely reliable water-resistant, dust-proof construction, with special seals applied to 60 different parts of the camera body, including the shutter release button and switches/levers/dials. This dependable body makes it possible to use the K200D in the rain or dusty locations without worries.High-precision 11-point Wide-frame AFThe K200D&#x92;s advanced SAFOX VIII autofocus system features 11 sensor points (with nine cross-type sensors) to automatically focus on the subject with utmost precision, even when it is positioned off center. When the subject is captured in focus, the in-focus sensor point is automatically superimposed in red in the viewfinder for at-a-glance confirmation.Custom Image FunctionThe K200D is equipped with a new Custom Image function that lets the user select one of the six modes and adjust an image&#x92;s processing to their preference by automatically adjusting tone, saturation, contrast, and sharpness.  These modes include Natural, Bright, Portrait, Landscape, Vibrant, and B&amp;W image modes.  The photographer can make further fine-tuned adjustments to each setting.  The effect on each of the primary colors is shown in a radar-type display on the LCD panel.  The user can easily see the effect of their adjustments by using the digital preview option.Comprehensive Dust Removal system with prevention, removal and alerting devicesThe K200D features the user-friendly Dust Removal system to prevent dust from sticking to the surface of the CMOS image sensor (or low-pass filter).  The Pentax-original Super Protect (SP) coating, applied to the image sensor surface through vapor deposition of a fluorine compound, effectively prevents dust from sticking to the surface. In the next step, dust that may remain on the surface will be shaken off when the system shifts the image sensor at high speed. Finally, the dust that is shaken off the image sensor falls onto an adhesive strip positioned at the bottom of the unit, eliminating any possibility of the dust returning to the image sensor surface. This upgraded Dust Reduction system also offers a new Dust Alert function, which shows the user exactly where dust may be sticking to the sensor surface.Auto Sensitivity Control up to ISO 1600The K200D&#x92;s auto sensitivity control function automatically sets the optimum sensitivity up to ISO 1600, based on such data as the subject&#x92;s brightness level and lens focal length. Since this function allows the user to use faster shutter speeds in poor lighting situations (such as indoor sports events and night scenes), this feature helps photographers effectively reduce camera shake and prevent blurred images. For specialized applications, sensitivity may be set manually from ISO 100 to ISO 1600.Bright, clear viewfinderCombining a lightweight penta-mirror prism with Pentax-original finder optics and the acclaimed Natural-Bright-Matte focusing screen, the K200D&#x92;s viewfinder delivers a large, bright image with an approximately 96-percent field of view and an approximately 0.85-times magnification.Other FeaturesHigh-rigidity stainless-steel chassisChoice of 16-segment multi-pattern metering, center-weighted metering and spot metering to accommodate various photographic applications22 custom functions to personalize camera operationsApproximately 1,100 images can be taken when using AA size lithium batteries due to its energy saving design (4 Energizer Lithium batteries included with each camera)Compatibility with conventional SD and large-capacity SDHC memory cardsSimultaneous recording of RAW- and JPEG-format imagesRAW button for single-action image-file switchingEight digital filters for creative and artistic expressionsIn-body development of recorded RAW-format imagesCompatibility with SDM equipped lenses for quiet, extra-smooth autofocus operationPentax PHOTO Laboratory 3, RAW data processing software and Pentax PHOTO Browser 3, browser software, included on the accompanying CD-ROM", "title": "Pentax K200D 10.2MP Digital SLR Camera with Shake Reduction 18-55mm f/3.5-5.6 Lens", "price": 17.49, "salesRank": {"Camera &amp; Photo": 12162}, "imUrl": "http://ecx.images-amazon.com/images/I/41H6Y3ZfDPL._SX300_.jpg", "related": {"also_viewed": ["B00DBPKAI8", "B00DBPKBIM", "B0082OJ33Q", "B0082OJ3DQ", "B000SKQOSY", "B002OEBTC8", "B0028N7442", "B00DBPKBQO", "B000B8T6E2", "B0082OJ2VE", "B00861DI4U", "B0091T97J6", "B0082OJ2X2", "B00DBPKAA6", "B00DBPKAAG", "B00DBPKBK0", "B009W7WW26", "B0043M6F1E", "B002BSGUZ8", "B0042RTQPC", "B0012QCYNM", "B0082OJ2YG", "B0091TC3OC", "B00427Z7MI", "B0043M6F14", "B00061J2BQ", "B0099J8A2S", "B009APEUHK", "B0009U7MV6", "B009JPEISW", "B000G1DAKA", "B00DBPK97K", "B00DBPKAB0", "B000FU6L1W", "B001GAPHOC", "B0007WK8NK", "B0043RTLA6", "B00DBPK99S", "B00DBPKABA", "B0040RDT0M", "B0099J8BZE", "B00DBPK984"], "buy_after_viewing": ["B00B7ID99I", "B003VNKNF0", "B002FGTWOC", "B00133IY1A"]}}