{"asin": "B0068YRPDC", "description": "Meet Perch Small (S), your iPad 2 & iPad 3's perfect tabletop companion. Compact, portable, and just the right height, Perch (S) is ideal for the school desk, the office desk, the coffee table, the conference table, the kitchen countertop, and anywhere you'd like to enjoy the convenience of hands-free operation, at any viewing angle and with any orientation.Perch looks fantastic in white, and is just as durable as it is beautiful. A heavy-gauge steel base keeps your iPad 2 & iPad 3 firmly in position, a forged aluminum leg is lightweight but still plenty strong, and a rugged holder securely mounts your iPad 2 & iPad 3.Installing your device is easy; slide the left side in and snap the right side into place. That's it! Removal is just as easy. And Perch features a unique dual-axis hinge which allows for both tilts and rotations for complete customization of your viewing experience.Use Perch on the coffee table for YouTube surfing or movie watching. Set up your iPad 2 & iPad 3 and Perch like a monitor, and add a wireless keyboard for laptop-style operation. Use Perch as a recipe book in the kitchen, collaborate at a coffeehouse meeting, or explore digital curriculum in a one-on-one teaching session.Handsome and functional, Perch (S) is sure to be the iPad 2 & iPad 3 accessory you find uses for again and again.To install the new iPad (iPad 3) on Perch for iPad 2 holder, you will need to start the installation with the bottom of the holder first. Once you have the bottom two corners filled with the new iPad you can then proceed to push the other part into the holder. You will find all the ports and controls accessible on the holder.", "title": "IPEVO Perch Desktop Stand for iPad 2 &amp; iPad 4/3 3 - Black (S)", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/31t790hSJLL._SY300_.jpg", "related": {"also_bought": ["B005X4Q12E", "B003O91EUY", "B00EUMLYOK", "B007NDJ2J2", "B00EUMNQTG", "B0058OJRDY", "B0068YWN0C"], "buy_after_viewing": ["B0058OJRDY", "B006SRUNXS", "B000CKVOOY", "B003GAJ67Y"]}, "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Stands"]]}