{"asin": "B0006BKH3S", "description": "Why shuffle through stacks of CDs and tapes to find the song you want in the car when you can listen to the iPod? The Monster Cable iCarPlay Wireless Plus FM transmitter gives your car stereo great-sounding, wireless access to your entire iPod library, all while charging the portable jukebox to keep the music playing. Simply plug one end of the iCarPlay Wireless Plus into the 12-volt cigarette lighter and the other end into the dock connector on the bottom of your iPod. Once you select matching FM stations on your car stereo and the iCarPlay device, you're ready to roll. Your favorite music will transmit wirelessly to your car stereo using FM frequencies, and because it offers full FM tuning flexibility (excluding 87.7 and 87.9 MHz), you're guaranteed top-quality, interference-free sound. Meanwhile, Monster's Smart Digital Charging technology will rapidly charge your iPod when the power is low, and when its fully charged, the transmitter switches to a trickle charge to optimize the iPod's performance. You'll never have to worry about running out of power when using the iCarPlay. Additional features include three programmable \"favorite station\" preset buttons, an easy-to-ready LED display, and 24k gold contacts for maximum corrosion resistance and power transfer.iPod CompatibilityiPod nano 1G,iPod nano 2G,iPod mini,iPod 3G,iPod 4G (Clickwheel),iPod Color,iPod 5G/5.5G Video", "title": "Monster A-IP-FM-CH-PS Wireless FM Transmitter", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/41WP491463L._SY300_.jpg", "related": {"also_viewed": ["B000E43GOO", "B000H72MMU", "B002AQVO2U", "B002DW3YBA", "B000JLL112", "B001JIBM54", "B0087NBBD2", "B004B8GF7Y", "B003PPGOC0", "B00EUVB2C0", "B0098Y90PK", "B002AQVMMW", "B000BWACX2", "B008MF3Y2G", "B003EHT6YC"], "buy_after_viewing": ["B000E43GOO", "B000H72MMU", "B002AQVO2U", "B002DW3YBA"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Chargers", "Car Chargers"]]}