{"asin": "B00395YA6S", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Panasonic's Lumix DMC-ZR3 digital camera features powerful zoom within a remarkably slim and compact body. Newly added is an AVCHD Lite movie recording function to make the versatile camera even truly \"hybrid\".The new image processing technology \"Intelligent Resolution\" is incorporated in the Venus Engine HD II for ZR3. By detecting the signals whether they are at edges of the subject, they compose detailed texture or just a soft gradation first and give appropriate enhancement to the edges and textured areas respectively. Unlike the uniform enhancement of sharpness, it is possible to perform the optimum signal processing to give a whole image outstandingly natural clearness with fine detail.This technology is integrated in iA (Intelligent Auto) mode--a hallmark of Lumix cameras--working thoroughly while the camera is in the iA mode to enhance its potential in many aspects. The iA mode is also available in movie mode. It automatically selects the most suitable Scene mode and helps to correct handshake, focus and brightness problems--making the iA mode your one-stop solution to capture beautiful photos and movies.The powerful 8x optical zoom lens makes it easy to pull in subjects from far away a step closer compared to the conventional stylish point-and-shoot cameras. For an added boost, zoom power can be increased to 10x with the Intelligent Zoom function taking advantage of the Intelligent Resolution technology maintaining the picture quality even combining a digital zoom. The 25mm ultra wide-angle feature is ideal for both broad landscapes and tight indoor shots, letting photographers capture a wider view. The  14.1-megapixel high resolution CCD reproduce the detailed images corner to corner and affordable with trimming or even more powerful Extra Optical Zoom by using the center part of it.Notably the Sonic Speed AF in the ZR3 features its speed at the industry's fastest level. Combined with a high-speed start-up, this gives the ZR3 an ultra fast response that helps to catch even the most fleeting photo opportunities. The 2.7-inch large Intelligent LCD offers dynamic and clear view out of its small body. The battery life is also as powerful as approx. 330 pictures shooting thanks to the highly energy efficient image processing LSI, the Venus Engine HD II.With high-quality aluminum texture which resists fingerprints and soiling, the slim, compact, pocket-fitting size of ZR3 is packed with a host of functions for both photos and movies to be an ideal partner for traveling or for everyday snapshots.Lumix DMC-ZR3 Highlights25mm Ultra Wide-angle LensThe 25mm ultra wide-angle lens*has about twice the shooting area as a standard 35mm lens. This enhances all kinds of shooting situations, like when you're photographing a group of people at an indoor party or shooting a large structure or sweeping landscape while traveling.* Converted to standard 35mm camera equivalent, at the maximum wide position.10x Intelligent Zoom/16.9x Extra Optical ZoomThanks to the newly incorporated Intelligent Resolution technology, the Intelligent Zoom is available with the DMC-ZR3 which extends the zoom ratio by approx. 1.3x maintaining the picture quality even combining a digital zoom. This means the 8x optical can virtually extend to 10x equivalent. Furthermore, the Extra Optical Zoom function that extends zoom power to 16.9x*by using the center part of the large CCD to bring subjects even closer.*At 3-megapixel resolution or less.HD Movie in AVCHD LiteIn addition to Motion JPEG images, the DMC-ZR3 can record high-definition motion images in AVCHD Lite. It features almost double the recording time in HD quality compared with the conventional Motion JPEG format.Powerful 8x Optical ZoomThe DMC-ZR3 also lets you use zooming when taking motion pictures. Its powerful 8x optical zoom is ideal for capturing dynamic video clips of sports action or animals in nature.High Quality SoundThe DMC-ZR3 features Dolby Digital Creator to record high quality audio, so you can match the beautiful movies with outstanding sound.POWER O.I.S. (Optical Image Stabilizer) Shake DetectionJust about everyone has had the experience of taking a photo at night and hoping to capture all the memories and beauty, only to be disappointed at the poor result. The POWER O.I.S. (Optical Image Stabilizer)*nearly doubles the hand-shake correction power of conventional MEGA O.I.S. You get bright photos without blurring even from handheld shooting at slow shutter speeds. Panasonic's accumulated optical technologies, the MEGA O.I.S. has been incorporated into Lumix from the early stage of digital camera development. This helped show all digital camera users the absolute need for hand-shake compensation, and led to its prevalence throughout the industry. And now, Panasonic has worked on the low-frequency vibration hand-shake component, which is physically generated when pressing the shutter button or when shooting at night with a slow shutter speed.*The POWER O.I.S. is automatically turned on in the iA Mode and can be turned on or off in the Normal Picture Mode or some Scene Modes.", "title": "Panasonic Lumix DMC-ZR3 14.1 MP Digital Camera with 8x Optical Image Stabilized Zoom and 2.7-Inch LCD (Blue)", "price": 7.52, "salesRank": {"Camera &amp; Photo": 10928}, "imUrl": "http://ecx.images-amazon.com/images/I/51P7C4LMkLL._SY300_.jpg", "related": {"buy_after_viewing": ["B003VNKNEG", "B00728ZAGM", "B003VNKNEQ", "B003VNKNF0"]}}