{"asin": "B001COQW14", "description": "Set off on a journey to a tropical island where an array of fun activities await. In Wii Sports Resort, the sequel to the engaging Wii Sports, you'll discover a wide range of new sports and activities you can play anytime. Go head-to-head with your friends and family in the ultimate sports showdown set in a tropical paradise.Water SportsView largerSky DivingView largerCompete against friendsView largerAbout the Game:In Wii Sports Resort, you'll use your Wii Remote to literally swing into action. Perform realistic sports moves to take on the competition in activities that include Sword Play, Power Cruising (racing a water scooter) and Disc Dog, in which you'll toss a disc to an adorable, Mii-like dog. Become even more immersed in the action courtesy of the included Wii MotionPlus accessory, which attaches to your Wii Remote to provide even greater responsiveness and precision. With the game's easy-to-use controls, anyone can pick up a Wii Remote and leap into the game to experience all the heated competition and hilarity.Key Game Features:Engage in a wide range of exciting activities, including Sword Play, Power Cruising, and Disc DogSavor the escapism of the game's tropical island themeJump easily into the game no matter what your experience level thanks to easy pick-up-and-play controlsCompete against friends and family in thrilling sports showdownsIncludes the Wii MotionPlus accessory, which plugs into the base of your Wii Remote to provide a more responsive and realistic playing experienceFor 1 to 4 playersWii Sports ResortRequires Wii MotionPlus:You're in luck! This game includes one Wii MotionPlus accessory in the box with the game. You willl want additionalWii MotionPlusadd-ons for each additional controller you will use to play the game though. With the Wii MotionPlus accessory you can add even greater precision to every move you make within the game. With your motion-sensitive Wii Remote, you've swung into action, shaken things up, bowled people over, maybe even totally flipped out! Connect the Wii MotionPlus to your Wii Remote, and the accessory's additional sensors respond to the slightest motion of your wrist, allowing your most subtle movements to deliver impressive results on screen. Intuitive and easy to use, the Wii MotionPlus is compatible with a variety of Wii games to help you increase your accuracy and enhance your overall control.", "price": 160.38, "imUrl": "http://ecx.images-amazon.com/images/I/51ck3suI9zL._SY300_.jpg", "related": {"also_bought": ["B001TOQ8NO", "B002MQLPJ0", "B005IGPY48", "B0017Q4DGI", "B004V13D0I", "B0013E9HP6", "B0056C2LIG", "B002OL1KEI", "B003Q5J4NU", "B00B0W5U66", "B002WZH9HS", "B004WLRR4K", "B002GEKIOG", "B005IGQMPI", "B0009VXBAQ", "B00J44ERTI", "B001GIUWX0", "B0094X2066", "B001PO2BJI", "B003LDKIQ4", "B002BRZ9G0", "B0094X20IO", "B0013LTP5Q", "B002BSA3EM", "B0079V2S1W", "B002672Z80", "B002BS47JE", "B0045F8QDE", "B00C85T7F4", "B004IK24MU", "B004C34D2M", "B005EYG6EQ", "B0094X227I", "B000RL8G1W", "B004BWTO4G", "B000FQ9QVI", "B000IMWK2G", "B002CZ835U", "B001B1W3HA", "B003DSAT0C", "B000QD7BBM", "B001DO3NEW", "B003O6DZSQ", "B00B1ATURC", "B0039XZGXG", "B0094X221O", "B000SFK0SO", "B001MBUGLY", "B004CUOD70", "B000IMYKQ0", "B0094X28J0", "B002FG9MWE", "B004NT9WU8", "B000VJRU44", "B0051D96O2", "B00A4T384M", "B009M72E5Q", "B006AN894U", "B0094X1ZXU", "B001U2BMF4", "B000R3BNDI", "B001U2BMH2", "B002I0EOSE", "B000LSJKAM", "B002MGPAKU", "B0045F8QD4", "B005761GFA", "B003S2JI6O", "B0013OL0BK", "B004XV9EWW", "B00EZJAZB6", "B000OAO188", "B000FQ9YB0", "B00FLYZ7NU", "B002ECN43C", "B004N3FGHC", "B00F2ENJY8", "B002BSA388", "B002D2Y3IS", "B000SQ5LPU", "B002K9VIAU", "B001AMMZSC", "B0013B30SY", "B001NES3J2", "B00B0D0GMI", "B000XJNTNS", "B000YDIYFG", "B002KJ9XE8", "B00GBLVZRO", "B003OZZJGS", "B004WLRQAU", "B000R3BNE2", "B005FYJA52", "B005FEX576", "B00386VMZA", "B006ZPAYB4", "B009X3PB90"], "bought_together": ["B001TOQ8NO", "B002MQLPJ0"], "buy_after_viewing": ["B0017Q4DGI", "B005IGPY48", "B002MQLPJ0", "B001TOQ8NO"]}, "salesRank": {"Video Games": 3158}, "categories": [["Video Games", "Kids & Family", "Wii", "Games"], ["Video Games", "Wii", "Games"]]}