{"asin": "B0032AN4O4", "related": {"also_bought": ["B0080UTAQW", "B0014WJYOG", "B001CSPUF4", "B00FQVO3QA", "B001CSMJJE", "B001CSMJJ4", "B001DJ86CQ", "B0057GFPFC", "B0032GTLH2", "B0047NR3BA", "B000EUCRF2", "B00HM0IV8E", "B008I638AM", "B004DKZNO6", "B00404SUZ4", "B0000721Z3", "B00434C7R8", "B001DJ6CD6", "B001HL0NB2", "B001TH7GUA", "B009Z2LJPO", "B003HWRFN8", "B0062N2RFA", "B00E1XI8YW", "B009Z2Z8X8", "B001MSU1HG", "B00E1XI8YC", "B0048BJGQ6", "B00B5HE1SY", "B003VQR1UC", "B00E0IDMY4", "B009Z2YCQW", "B0043QGSZI", "B00C7NX3MK", "B0040RGBES", "B001MXLD4G", "B0098Y77OG", "B0083J7N78", "B00BCWA6TK", "B00CHYKVPQ", "B008YD1V6C"], "bought_together": ["B0014WJYOG"], "buy_after_viewing": ["B00FTG73SC", "B008I638AM", "B00HK8V4NC", "B00EHDZMGI"]}, "title": "Canon PIXMA iP2702 Inkjet Photo Printer (4103B002) with PP-201 Photo Paper", "price": 50.0, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41qn2jAku3L._SY300_.jpg", "brand": "Canon", "categories": [["Office Products", "Office Electronics", "Printers & Accessories", "Printers", "Photo Printers"]], "description": "If you&#39;re looking for a product with a sophisticated look and compact design that can print photo lab quality at a great value you need to look no further than the PIXMA iP2702 Inkjet Photo Printer.Get a sophisticated look and compact design that can print photo lab quality at a great value with the PIXMA iP2702 Inkjet Photo All-In-One.View largerThis stylish machine fits almost anywhere while you easily print beautiful, borderless1photos up to 8.5&rdquo; x 11,&rdquo; pages off the web through Easy-WebPrint EX2or documents all with amazing quality. This is made possible thanks to its FINE Cartridges which contain pigment black ink for laser-quality text and dye ink for smooth, natural photos. The ChromaLife100+ system enables your photos to last up to 3003years when using genuine Canon ink and paper and stored in archival-quality photo album. Printing and automatically correcting your photos has never been easier thanks to Auto Photo Fix II which can be accessed through the popular EasyPhoto-Print EX software. So you can make the most out of your photos and easily print as many as you want!Speed &amp; QualityTerrific Resolution:This level of quality is achieved by 4800 x 1200 maximum color dpi4thanks to Canon Full-photolithography Inkjet  Nozzle Engineering (FINE) with a patented print head firing ink droplets as  small as 2pl. This delivers superb quality and detail in both your business  documents and photos.High Performance Ink  Cartridges:These two genuine Canon ink cartridges contain specially  formulated inks for great document and photo quality. One is a Black cartridge  for laser-quality text and one is a multi-color cartridge for pictures. Both  are easy to use and replace.Fast  4&rdquo; x 6&rdquo;:Print a beautiful, borderless photo in approx. 55 seconds5!ChromaLife100+:This system combines enhanced FINE  print head technology with select genuine Canon photo papers and inks for  beautiful borderless photos that will last up to 300 years3when stored in an archival&#45;quality photo album.The PIXMA iP2702 prints a beautiful, borderless photo in approx. 55 seconds5!View largerEase of UseAuto Photo Fix II:This  built-in technology automatically categorizes your images  into one of five types - Portrait, Scenery, Night Scenery, Snapshot with  Scenery, and Snapshot with Night Scenery - then applies optimal image and  multi-zone exposure correction. So, unexposed areas of the photo will be  optimized, area by area and faces that are backlit and under-exposed will  automatically be brightened and color corrected to help ensure more accurate  skin tones for gorgeous images.Beautiful &amp; Borderless1:Print  photo lab quality from 4&rdquo; x 6&rdquo; up to 8.5&rdquo; x 11.&rdquo; &nbsp;ConnectivityUSB  2.0 Hi-Speed:Plug the cable into your computer for a super-fast connection  for your data transfers.Features&nbsp;What&#39;s in the Box?PIXMA iP2702 Inkjet Photo PrinterCross Sell SheetGetting StartedImportant Information SheetSetup Software & User&#39;s Guide CD-ROMWarranty CardPG-210 Pigment BlackCL-211 ColorPower CordBonus Paper (PP&#45;201, 5 Sheets)&nbsp;Disclaimers1.  Supported paper types for borderless printing are as follows: Photo Paper Pro Platinum, Photo Paper Pro II, Photo Paper Plus Glossy II, Photo Paper Plus Semi-gloss, Photo Paper Glossy and Matte Photo Paper.2.  Compatible with Microsoft Internet Explorer 7 in Windows Vista or XP only.  Not included on installation CD.  Requires Internet connection during installation.3.  Based on accelerated testing by Canon in dark storage under controlled temperature, humidity and gas conditions, simulating storage in an album with plastic sleeves. Canon cannot guarantee the longevity of prints; results may vary depending on printed image, drying time, display/storage conditions, and environmental factors.4.  Resolution may vary based on printer driver setting.  Color ink droplets can be placed with a horizontal pitch of 1/4800 inch at minimum.5. Print speed measured as soon as first page begins to feed into printer.  Copy speed is measured after the first page is ejected.  Output speed will vary depending upon a number of factors.6.  System requirements vary by application.7.  Warranty programs are subject to certain conditions and restrictions.software, document complexity, print mode, types of paper used and page coverage.8.  Specifications are subject to change.  All printer output and viewscreen images are simulated."}