{"asin": "B00F3T0DKK", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories"]], "description": "This portable and sleek PLEMO Magic Cube Bluetooth Speaker is your perfect companion while you are on the go. It allows you to stream music from any Bluetooth-enabled devices via wireless connection, including smartphones, touch screen tablets, laptops, and more. The line-in capability also enables you to connect the speaker directly to a non-Bluetooth-enabled device using the 3.5mm audio cable. The award-winning cube design is sure to make the speaker the focus of attention, and the sound of superb quality will definitely keep you and your friends entertained.Package Contents:PLEMO Magic Cube Bluetooth SpeakerUSB charging cable3.5mm Audio CableInstruction ManualSpecifications:Bluetooth Version: 3.0Working Frequency: 2.4 GHzOutput Power: 3 WSignal to Noise Ratio: 82 dBBattery Voltage: 3.7 VCharging Voltage: 5 VBattery Charge Time: ~2 hBluetooth Working Distance: 30 ftPlaytime: ~4-6 h, depending on the volumeCompatible With:The speaker is compatible with all devices that transfer sound via Bluetooth, or with a 3.5mm audio jack cable.Cell phones: Apple iPhone, HTC, Samsung Galaxy, Droid, Nokia Lumia, Google Nexus, Blackberry, etcTablets: Apple iPads, Google Nexus, Samsung Galaxy, Microsoft Surface, Blackberry Playbook, etcMP3 Players: Apple iPod etcLaptops: Apple MacBooks, Dell, Lenovo, Acer, HP, Sony, Toshiba, etcCD/DVD PlayersPC Desktops & iMacs", "title": "PLEMO Magic Cube Rechargeable Portable Bluetooth Wireless Speaker with 3.5mm Audio Port for iPhones, iPads, Android Cell Phones, Touch Screen Tablets, MacBooks, Laptop Computers, MP3 Players &amp; Portable CD/DVD Players, Black", "price": 24.99, "salesRank": {"Cell Phones & Accessories": 29690}, "imUrl": "http://ecx.images-amazon.com/images/I/41xumUMbb-L._SY300_.jpg", "related": {"also_bought": ["B00GSQARSU", "B00GJAJZN8", "B005EH8AQ0", "B00E084XRO", "B001Q80TCE", "B005GNPCJK", "B008N3R4F0", "B00DHEK0ME", "B00I3L4518", "B002EL2WZO", "B004SBAV2O", "B007M2ORU8", "B00FJILVDS", "B003X1BEKI", "B006I5MKZY", "B00GX9A06Q", "B00IKCI6X8", "B0089ZV1WY", "B009F4XM48", "B00FOUVRY4", "B007CK5S4Y", "B000VDVMIK", "B00E952W76", "B00C4Q61Z6", "B00I3L453G", "B002VX3RCW", "B00BKW2410", "B007WOKBRY", "B00E8CIGCA", "B00GZC35YK", "B002JIO2L4", "B001FWXJIW"], "bought_together": ["B00FJILVDS"], "buy_after_viewing": ["B00GZC35YK", "B00F5NE2KG", "B00FJILVDS", "B00H3JTT30"]}}