{"asin": "B001BTG3OQ", "description": "The SB-900 i-TTL Speedlight leads the Nikon Creative Lighting System by delivering the portability, power, and versatility to support any photographer's creative lighting imagination. The SB-900 works as a wireless standalone flash, or you can use it as a commander or wireless remote light source. In commander mode, the SB-900 controls up to three remote Speedlight groups and an unlimited number of compatible Speedlights, with four wireless channel options helping you manage wireless conflicts in multiple photographer environments. The flash also offers streamlined controls and menus, including a rotary select dial that sets key flash functions quickly, along with a prominent master and remote control switch to simplify wireless operation.Photographers working on zoom photos will appreciate the SB-900's expanded auto power zoom coverage, which ranges from 17 to 200mm in the FX format to 12 to 200mm in the DX format. Photographers also have the choice of three light distribution patterns: standard (for general illumination), center-weighted (for portraits), and even (for groups or interiors). Finally, the SB-900 automatically identifies mounted color gel filters and adjusts the camera's auto white balance setting (available with select Nikon digital SLR cameras). Other details include automatic FX/DX format identification; user-friendly firmware updating; flash tube overheat protection; and a drip-proof mounting foot cover.Technical SpecificationsGuide number: 34 meters/111.5 feet (ISO 100), 48 meters/157.5 feet (ISO 200)Electronic construction: Automatic Insulated Gate Bipolar Transistor (IGBT) and series circuitryFlash exposure control: Slow sync; red-eye reduction in slow sync; front curtain sync; rear curtain sync; rear-curtain slow sync; auto FP high-speed sync; FV lock flashLens coverage: 17 to 200mm (FX format, automatic mode); 12 to 200mm (DX format, automatic mode); 12 to 17mm (FX format, automatic mode with built-in wide-angle panel deployed); 8 to 11mm (DX format, automatic mode with built-in wide-angle panel deployed)Bounce function (tilt): Flash head tilts down to -7 degrees or up to 90 degrees, with click stops at -7, 0, 45, 60, 75, and 90 degreesBounce function (rotate): Flash head rotates horizontally 180 degrees to the left and right, with click stops at 0, 30, 60, 90, 120, 150, and 180 degreesMinimum recycling time: 4 seconds with alkaline-manganese (1.5 volts); 4.5 seconds with lithium (1.5 volts); 3 seconds with Oxyride (1.5 volts); 2.3 seconds with Ni-MH (2,600 mAh)Flash duration: 1/880 second at M1/1 (full) output; 1/1,000 second at M1/2 output; 1/2,550 second at M1/4 output; 1/5,000 second at M1/8 output; 1/10,000 second at M1/16 output; 1/20,000 second at M1/32 output; 1/35,700 second at M1/64 output; 1/38,500 second at M1/128 outputRequired power source: 4 AA-type batteries in the following types: alkaline-manganese (1.5 volts), lithium (1.5 volts), or Ni-MH (1.2 volts)ISO range: 100 to 6,400Optional power supply: SD-9 high-performance battery pack, SD-8A high-performance battery pack, or SK-6 power bracket unitReady light: YesMinimum number of flashes: 110 with alkaline-manganese (1.5 volts); 230 with lithium (1.5 volts); 190 with Ni-MH (2,600 mAh)Wireless flash modes: Off, master, master (repeating), remote, and SU-4Wireless communication channels: 4Wireless groups: 3Dimensions: 3 x 5.7 x 4.7 inches (W x H x D)Weight: 14.6 ouncesSupplied accessories: AS-21 Speedlight stand, SW-13H diffusion dome, SJ-900 color filter set, SZ-2 color filter holder, SS-900 soft case", "title": "Nikon SB-900 AF Speedlight Flash for Nikon Digital SLR Cameras", "price": 570.0, "imUrl": "http://ecx.images-amazon.com/images/I/41pmrI9ofvL._SY300_.jpg", "related": {"also_bought": ["B001J4HNF6", "B000VDCT3C", "B001T9NXA0", "B0045KGZOG", "B0050YG3CU", "B0002EMY9Y", "B0076AYNXM", "B00FOTF8M2", "B0034WR71G", "B000EOSHGQ", "B0095ZLP3C", "B000BYCKU8", "B00CXM03D2", "B003TYDBYQ", "B002JCSV8U", "B000VDCTCI", "B00005LEN4", "B001GCVA0U", "B0034WR19Y", "B00AN8U0Y0", "B006TAP096", "B002ZIMEMW", "B00D1KBG5Y", "B004XY65WQ", "B00BBQ8IDS", "B00004ZCJM", "B004TGZ7WM", "B008B14VAK", "B002JCSV6M", "B0042X9LC4", "B00CXLQKU8", "B00127VAW2", "B0049U477Y", "B000CRLBN6", "B0098TG67U", "B003Y30334", "B0013A1XDE", "B0000BZLBQ", "B00CKJ0LQC", "B007BD4BRC", "B00015GYU4", "B001CR63K6", "B0026FCKC8", "B001S2PPT0", "B003ZSHNE0", "B000144I2Q", "B00006JN3G", "B000GBERAM", "B004V4IWHY", "B003PEX8XE", "B00BI3WX9O", "0321966465", "B0099XGZXA", "B008FJJ66C", "B00005LENO", "B002SWIOOM", "B000VJX7DW", "B00005LEOH", "0817439560", "1933952997", "B001EO6W8K", "B004DUOGYE", "B00007EDZG", "B003WA0N70", "B0014Z5XMK", "B003QVWJM2", "160895451X", "B002T1OJZU", "B00004ZCI3", "B003WPTBAK", "B009C08UNS", "B007ODZYRK", "B001E4LC6C", "B004TJ6JH6", "B0042GZSNC", "B0014DNS06", "B001CADR0W", "B004Y1AYAC", "B002NU5UW8", "B000LQMKDS", "B003ZYF3M8", "B009DJ1THW", "B007DBJ2VM", "B000BY52NK", "B005OL2ID2", "B004YTCNJY", "B005S468WC", "B00ADG7H7K", "B0013A1XDY", "B00BPE6ERS", "B0007U00XK", "B00007EDZ7", "B00111UX40", "B007VGGIB6", "B005DP8YJG", "B0001WE6U2", "B001KNQ29E", "B003USS5JC", "B004AZ38Z0"], "bought_together": ["B001J4HNF6"], "buy_after_viewing": ["B0042X9L6A", "B0050YG3CU", "B003Y30334", "B002ZIMEMW"]}, "categories": [["Electronics", "Camera & Photo", "Flashes", "Shoe Mount Flashes"]]}