{"asin": "B0000503MO", "description": "The third title of the Gran Turismo series takes full advantage of the new PlayStation2 game engine, which is capable of rendering about 20 million polygons per second--roughly 10 times the number of total polygons of the series' previous installment,Gran Turismo 2. Real-time lighting forces your eyes to adjust to changing conditions, such as when a car rounds a turn and the sun comes out from behind a building to cause glare on the windshield. This makes the game harder, but more realistic. Heat rises off the ground and mist swirls around vehicles as they make their way across the racetrack.Gran Turismo 3also features more than 100 distinct cars, each with different statistics, including the Subaru Impreza Rally, Dodge Viper GTS-R, and Mazda's RX-7 RS. Computer-controlled opponents benefit from enhanced artificial intelligence; they don't act like baby ducks following their mother, but instead respond to other cars, the course, and the conditions in much the same way that real drivers would. Pressure a car, and it will pressure you back; cut one off in the early part of the race, and expect to receive similar treatment down the course. They don't drive perfectly, either; some will spin out and make other mistakes over the course of a race.", "price": 17.99, "imUrl": "http://ecx.images-amazon.com/images/I/516194EXX5L._SY300_.jpg", "related": {"also_bought": ["B0000A0MDV", "B000034DC7", "B00000DMAU", "B001MW91IW", "B0002IQCSY", "B0000C4M22", "B00005V6BE", "B000TLU67W", "B00006Z7HU", "B00004YRQA", "9629971372", "B00004YRQ9", "B000NW82O6", "B000G79YNQ", "B00006F2EP", "B0009J1IJO", "B00005NN5J", "B000056H2D", "B0000C7GHG", "B00009WAVI", "B0015ACX3Q", "B000RHZJK2", "B00005UOS7", "B000930DIM", "B000GPXS9Y", "B004AGYHUE", "B00005R5PO", "B0045L3SNQ", "B0007M2266", "B000FPOJOS", "B004S3KB6S", "B000MUPX4Q", "B001UIG6M2", "B00065QTT0", "B00083G5BW", "B000EMJA3M", "B00004U5VS", "B00004TKMB", "B001TORSHO", "B0013JHKU0", "B00020LZAC", "B00005MDZD", "B000FDMV54", "B000038ABK", "B0000E32Y9", "B00008NRM7", "B00005MO5E", "B0002I9ROU"], "bought_together": ["B0000A0MDV", "B001MW91IW"], "buy_after_viewing": ["B0000A0MDV", "B000TLU67W", "B006JKARN0", "B00000DMAU"]}, "salesRank": {"Video Games": 6471}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "More Systems", "PlayStation 2", "Games"]]}