{"asin": "B000GHLBUA", "description": "Super Monkey Ballfanatics rejoice!AiAi and all his friends have rolled their way onto Nintendo's new console with new mind-blowing puzzle levels and a wealth of new and exciting Party Games specifically designed to fully exploit the innovative Nintendo Wii controller. Other titles will have a difficult time matching the multitude of possible variations in game control as presented inSuper Monkey Ball: Banana Blitz.The Wii launches with one of the most popular Sega franchises!Colorful new levels allow for jumping with the Wii remote.View larger.Party Games can be played alone or with friends.View larger.Collect bananas to unlock game modes and new levels.View larger.In Party Games, use the Wii remote in new and exciting ways.View larger.Revolutionary controlYou've never played Super Monkey Ball like this before! Tilt, twist, roll, and jump all with the revolutionary Wii controller. The Wii's remote sensor picks up your every move as you slip and slide through colorful environments with the same tricky gameplay moves and colorful environments you know and love from the Monkey Ball series.The single-player puzzle levels in Super Monkey Ball: Banana Blitz have been innovatively designed to challenge gamers' skills like never before. For the first time in Super Monkey Ball, AiAi and his friends will have the ability to jump when players flick the Nintendo Revolution controller in an upward motion. The ability to jump has given game designers another dimension in which to expand the Super Monkey Ball gameplay experience and allows gamers a whole new way to interact with the franchise; this time in true three-dimensional fashion. Unlockable multiplayer games support one to four players and offer stiff competition. Think you've mastered the Wii controller? Put your money where your mouth is as you take on three friends in various match-based games of skill and familiar sports favorites.Many many mini-gamesThe Party Games, for which the Super Monkey Ball franchise is famous, return with more variety than ever and over 50 total. As an added bonus, all of the Party Games are unlocked the first time you spin up the game in your Wii. An abundance of new Party Games have been creatively designed to take advantage of the Revolution controller in a multitude of ways. Gamers will find themselves competing in a traditional game of ring toss, fighting aliens in space with \"Alien Attack,\" or even smacking pesky moles in a game of \"Whack-a-Mole.\" With each mini-game, players use the Super Monkey Ball: Banana Blitz's large library of Party Games is sure to inspire friendly competition anytime.New characters roll onto the sceneAiAi, MeeMee, GonGon, and Baby will be joined by new characters YanYan; a young, vivacious female monkey and Doctor; an older monkey with a past steeped in mystery due to his acute case of amnesia. The addition of YanYan and Doctor also marks another first for the Super Monkey Ball franchise, differing skill-set levels for each character. Each character will have strengths and weaknesses in categories such as acceleration, speed, and jumping ability. Even the size of the monkey ball and its weight will play a role in a character's performance in the game.Doctor is a mysterious old that drifted down to Monkey Island from an unknown origin. He suffers from amnesia and doesn't even remember his own name. However, he is a well-liked, smart inventor, and everyone in town knows him as Doctor. Doctor has the highest acceleration out of the whole gang, but it's probably aided by some sort of contraption he invented. Being a bit on the old side his jumping skills aren't what they used to be as well, but he is still a good monkey to play with.YanYan is a young girl that recently moved close to AiAi's neighborhood. She is a fearless girl, a master of the mightiest Monkey martial art of pugilism, Hachi-en-Ken. She might have fallen in love with AiAi and sometimes becomes very shy around him. YanYan is the highest jumper of the entire group. Her vivatious energy allows her to reach heights that are unusual for her size. If you like to jump, YanYan is the monkey to choose.", "price": 7.92, "imUrl": "http://ecx.images-amazon.com/images/I/517YE1NBPPL._SY300_.jpg", "related": {"also_bought": ["B002JCMYWY", "B000069BB0", "B00005QDQ1", "B004FEI752", "B000C4088S", "B004HM279O", "B00149IL9I", "B000FQ9QVI", "B0056C2LIG", "B0013E9HP6", "B000GJ0J24", "B001TERJD2", "B000JV78XC", "B003ZCH7DI", "B0018BEG9Q", "B000KUHR8S", "B000YDIYFG", "B000SFK0SO", "B001GIUWX0", "B002BH3N2W", "B001B093QA", "B002BRZ9G0", "B003ZHMMEM", "B000FQ9YB0", "B000YUYNTK", "B005FYJA52", "B000GEDN5E", "B000R3BNE2", "B000IONGVI", "B000ZKNAFW", "B005EYG6EQ", "B0058CA4S8", "B001O1QLDO", "B003M31RN6", "B000QD7BBM", "B001PO2BJI", "B001D8PFIK", "B0017XFP90", "B002K9VIAU", "B001B1W3KM", "B0017Q4DGI", "B000XUPBBU", "B002I0IIPY", "B0017HIIWW", "B000N0WBMM", "B004C34D2M", "B002BSA388", "B001KRPU4S", "B0094X2066", "B00009PS22", "B002EZL9SG", "B000OAO188", "B0039XZGXG", "B0045FGET2", "B000TGB4R8", "B000NKRJAG", "B000FW8E7O", "B00273ZAH6", "B002I0GEXM", "B0050SVGXM", "B004CUOD70", "B00006LU9B", "B001B1W3HA", "B001FEO74U", "B0026IUSXI", "B001BWRB94", "B004IK24MU", "B007MM9E42", "B003LDKIQ4", "B001AWFIW2", "B006L1FAK2", "B003O6FVN8", "B008E6ZXK4", "B002672Z80", "B0017WHQ34", "B003HO0QYQ", "B001UU1WRE", "B00E20STF2", "B0051873RE", "B005EHQJ2C", "B002BUSSTM", "B001MT4EWI", "B0015I2UKE", "B001PA0FD6", "B002AF4XDS", "B0050SVGU0", "B00291C04M", "B001CU4EMW", "B00DC7G2W8", "B0042VV5DY", "B001PA0FCM"], "bought_together": ["B002JCMYWY"], "buy_after_viewing": ["B002JCMYWY", "B00005QDQ1", "B000069BB0", "B001GIUWX0"]}, "salesRank": {"Video Games": 4109}, "categories": [["Video Games", "Kids & Family", "Wii", "Games"], ["Video Games", "Wii", "Games"]]}