{"asin": "B0012V3D3C", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The Sony DSC-W170 has all the comforts of an easy-to-use point-and-shoot, but its dazzling agility and sleek, compact body pack a powerful punch. It features an enviable 10.1 megapixels, Carl Zeiss 5x optical zoom lens, and all of the advanced shooting functions you expect from Sony. Face Detection and Smile Shutter technology helps elicit stunning detail from special moments, while Intelligent Scene Recognition lets you capture the mood as you remember it. Whether displayed on the 2.7-inch LCD screen or your HDTV, the DSC-W170 conveys your creative vision with precision and style.Cyber-shot DSC-W170 HighlightsHDTV compatibilityHigh-resolution images can be enjoyed in all their beauty simply by connecting the camera directly to a Sony Bravia HDTV or other compatible HDTV. This provides an excellent alternative to viewing photos as prints or on a computer monitor, and is ideal for users who want to share photos in the comfort of their living room. Optional HD solutions include a Cyber-shot cradle/charger with component cable output, or component cable directly to your HDTV.15 MB internal memoryEven if you forget your flash memory card, you can get the shot because 15 MB internal memory lets you capture a limited number of shots with in-camera convenience, then easily transfer your shots to a PC or optional Memory Stick Duo media.10.1-megapixel Super HAD CCDMore megapixels give you more detail and definition when you make big prints or crop in tight on your subject. The advanced Sony Super HAD (Hole Accumulated Diode) CCD design allows more light to pass to each pixel, increasing sensitivity and reducing noise.Carl Zeiss 5x optical zoom lens5x optical zoom gives you the power to get even closer to the action -- a real benefit for distant landscape views and dramatic portraits.9-point Auto FocusBecause an off-center subject can make your shot more interesting, a 9-point auto focus measures auto-focus at 9 precision points instead of 5 -- giving you greater creative freedom to compose your image.2.7-inch Clear Photo LCD displayA large, bright 2.7-inch Clear Photo LCD display includes an anti-reflective coating that provides for excellent visibility to help you compose, view, and share photos with superb clarity and color reproduction, even in bright sunlight.Memory Stick Duo media convenienceA built-in slot accepts optional Memory Stick Duo media or Memory Stick Pro Duo media -- the compact, high-capacity storage media that make it easily to upload photos to your PC and are compatible with millions of devices worldwide.16:9 High-Resolution modeIn addition to the standard 2-megapixel size, the convenient 16:9 aspect ratio shooting mode for HDTV display can now be shot in 7-megapixels, making it possible to obtain beautiful, high-definition prints with the same aspect ratio as HDTV.Automatic Macro shootingStandard Auto Focus now covers the macro focus range, eliminating the need to manually change focus modes for close-up photography. The Macro mode has not been eliminated, and enabling it accelerates Auto Focus when shooting at point-blank range.Burst modeYou can fire off three shots automatically at 1-second intervals (VGA standard mode) or 2-second intervals (full resolution mode) -- a great way to capture a child&#x92;s first steps or a pet&#x92;s best tricks.Convenient Photo modesTo adjust quickly for specific shooting situations, you can choose from several convenient photo modes, including Auto, Program Auto, and Scene Selections such as Twilight, Landscape, Soft Snap, Snow, High Sensitivity, and Beach environments.Dynamic Range OptimizationPowered by the exclusive Sony Bionz high-speed processing engine, Dynamic Range Optimization preserves image data in bright highlights and reveals more detail in shadows or backlit areas -- for great results even in difficult lighting conditions.Easy image managementTo help you find the right image among many, Date View mode and Favorites mode have been added to the standard Folder View. Date View mode displays a calendar view, while Favorites mode shows only user-selected images. Furthermore, you can filter photos by face types such as portrait, child, baby, and smile.Easy Shooting modeA simplified camera environment especially attractive to beginners or digital camera users who want to keep things simple, Easy Shooting provides easy-to-read, on-screen instructions and limits the number of camera settings to help prevent misuse of the camera while still providing excellent results.Face DetectionFace Detection technology automatically controls focus, exposure, color, and flash to help reveal faces in shadows, make skin tones look more natural, reduce red-eye, and eliminate harsh facial glare, so your photos bring out every expression on every face in every shot.Function GuideThis beginner-friendly function helps manage various functions and settings by displaying the description of chosen functions or settings on the LCD screen. The Function Guide can also be switched off.HD Slide Show with musicIt&#x92;s the high-definition viewing experience that makes photos more entertaining to watch, accompanied by your choice of visual effects and any of four preset musical selections stored in memory or your favorite music downloaded from PC to your camera for use as background music.High Sensitivity (ISO 3200) modeWith high sensitivity of ISO 3200, you can shoot effectively in low light without flash to preserve the mood, while the Sony Clear RAW Noise Reduction system helps suppress the color noise that can degrade low-light shots.In-camera retouchingAdd creative effects to photos after you shoot using any of 10 editing functions, including: Trimming, Red-Eye adjustment, Soft Focus filter, Unsharp Mask, Cross filter, Partial Color filter, Fish-eye filter, Retro, Radial Blur and Happy Face. The Happy Face effect uses photo retouching to put a smile on faces, with smile levels adjustable from 1 to 5.In-Camera Red-Eye ReductionIrritating \"glowing eyes\" can ruin even the most creative photos, but in-camera red eye reduction corrects your photos at the touch of a button to reduce lingering red-eye effect that other systems might miss.Intelligent Scene Recognition modeIntelligent Scene Recognition mode automatically detects six different types of scenes and selects the appropriate camera setting: Backlight, Backlight &amp; Portrait, Twilight, Twilight &amp; Portrait, Twilight with Tripod and Portrait. Intelligent Scene Recognition has two different modes, advanced and auto. Advanced mode takes two shots, one with the standard automatic settings and the other with optimized settings. Auto mode takes a single shot, arbitrarily deciding on the proper setting.MPEG Movie VX Fine modeCapture VGA (640 x 480) audio/video clips at a high frame rate (up to 30 frames per second), with the length of your video limited only by the capacity of your media.Multi-resizing functionResize your photos in-camera for virtually any purpose! Standard 4:3 images can be resized to widescreen 16:9 and 2 MP resolution for display on an HDTV. Conversely, high resolution, widescreen 16:9 images can be resized to 4:3 size with VGA (640 x 480) resolution -- perfect for sharing with friends and family via e-mail (internet connection required). A simple 4-direction touch-screen control also makes it easy to trim photos.Optical viewfinderIn addition to the LCD display, a built-in optical viewfinder lets you compose your photos in traditional rangefinder camera style, and also helps save battery power by turning off your LCD display.Photo MusicExpanding the HD Slide Show with Music feature, PhotoMusic combines images with music to produce fun and entertaining slide shows. The five standard visual effects (Simple, Basic, Nostalgic, Active and Stylish) have been supplemented for a total of eight effects. Additionally, the number of music tracks stored in the camera memory has been doubled from four to eight, and music playback time has been extended from three to five minutes per track. More personalized slide shows are also possible by transferring music from a PC to the camera.Photo TV HDPhotoTV HD compatibility allows the camera to be connected to a PhotoTV HD-capable Sony Bravia HDTV via the optional HD output adaptor, for highly detailed, high-definition color images displayed in unprecedented realism and full HD quality.Picture Motion Browser softwareSupplied software makes it easier to upload, organize, and search photos on your PC. When shooting photos using your camera and an optional GPS unit, the software even provides a convenient map view function that lets you sort photos by location and display their origin on a world map.Simple setup controlsA quick press of the Home button opens your user-friendly graphical interface -- and you can select functions by simply moving a cursor vertically or horizontally to the appropriate icon. Function names and the on-screen Function Guide display make it easier to learn camera setup operations.Smart Zoom featureThe Sony Smart Zoom feature intelligently \"crops into\" the central portion of interest in your photo, helping avoid the image degradation of other digital zooms.Smile Shutter modeSmile Shutter mode helps you capture smiles automatically as they happen. Used in conjunction with Face Detection technology, Smile Shutter is able to differentiate between children and adults, and can be set to automatically shoot a picture when your subject laughs, smiles, or even grins -- only when focus is fixed. You select the person to watch and the expression to catch -- your Cyber-shot camera does the rest!Sony Double Anti-Blur SolutionThe combination of Super SteadyShot optical image stabilization and high ISO sensitivity helps compensate for shaky hands, minimizes blur, and allow flash-free shooting to preserve the mood.Stamina Battery PowerProvides extended battery life and shooting capacity when using a fully charged Lithium Ion battery-- enough to cover a long weekend or a whole vacation.Super SteadyShot Optical Image StabilizationSuper SteadyShot Image Stabilization compensates for shaky hands and minimizes blur with optical sensors that detect camera movement and send correcting signals to a stabilization lens -- so there&#x92;s no need to crop in on your shot to reduce blur.Wide Zoom DisplayTo use the entire image area of the camera&#x92;s widescreen LCD and compatible HDTV screens, Wide Zoom automatically expands standard 4:3 images to 16:9.", "title": "Sony Cybershot DSCW170 10.1MP Digital Camera with 5x Optical Zoom with Super Steady Shot (Silver)", "price": 249.99, "salesRank": {"Camera &amp; Photo": 11701}, "imUrl": "http://ecx.images-amazon.com/images/I/51RM4QXwdJL._SX300_.jpg", "related": {"also_viewed": ["B001SEQPGK", "B001SEQPGA", "B00I8BIC9E", "B001SEQPGU", "B00I8BIBCW", "B0013TUG5G", "B001OI2LV8", "B00HNJWUBI", "B0012XZQDU", "B004H8FNNA", "B00AQDGAZK", "B00BBJO4Q0", "B000M4MLSS", "B00I58LVKC", "B0033VKKB2", "B00BN1OCCW", "B0076W0LNQ", "B00AQDGAKK", "B00AQDGCNA", "B001SER47O", "B00BBJIFWE", "B00HNJWUC2", "B001CCQN9M", "B003VTZE1W", "B006K555EU", "B000EGLXTW", "B002IPHIFA", "B006K554I2", "B003VTZE26", "B001O9ARCC", "B00AQDG99M", "B0013UGRYO", "B00BJ60VW6", "B00AQDGCIA", "B004H8FNKI", "B00BEHQLP6", "B00BEHQKPM", "B00BN1OBYG", "B007WT9E0O", "B00B5HE2MO", "B00728ZBA2", "B003VTZE1M"], "buy_after_viewing": ["B003F3ZBKI", "B0013AX2JM", "B00091S0WA", "B005HNF01O"]}}