{"asin": "B0017XMN7C", "description": "The JBL On Stage IIIP portable loudspeaker dock is the ideal travel partner. Imagine the convenience of taking the JBL On Stage IIIP speaker dock on the road or enjoying the sound right at your desktop. Connected to your iPod or iPhone, MP3 player, or other music source, it produces clean, powerful sound--while also charging your iPod or iPhone. With the help of the IR remote, you can take complete control of your music with the JBL On Stage IIIP loudspeaker dock.Enjoy your iPod or iPhone, view photos or videos, and listen to virtually any other auxiliary audio component, all through the JBL On Stage IIP system.Combines many proprietary technologies to provide the highest-quality sound, astonishing bass, and clear and accurate audio from any direction.Compatible with dockable versions of the iPod, including the iPod touch, iPhone, iPod classic 6G, and iPod nano 3G.Which Dock Is for You?JBL has been in the iPod dock business for a while, so it's no surprise that the company has crafted enough models to keep up with an ever-increasing army of iPod owners. Which one is right for you? Well, that depends on what kind of pod person you are:For the Power HungryFor those who seek more volume, theOn Stage 400IDshould be your first stop. At 2x15 watts, it's the loudest and largest of the bunch, and features an Atlas woofer for added bass. But size isn't everything--theOn Stage Microboasts the same wattage rating without the woofer.For the Weekend WarriorsThose who need a dock that they can take anywhere should investigate docks that can be powered by batteries. TheOn Stage Microruns on four AAAs, whereas theOn Stage IIIPandOn Stage IIIrun on six. Take your music to the beach, on camping trips, or wherever you can't bear to be without it.For the iPhone TechiesThe iPhone owner has a couple choices--if you can stand to put the thing down. TheOn Stage IIIPprovides a smaller and more portable option, or theOn Stage 200IDgives a bit more power. These two docks support all docking iPod models as well.For the Featurephiles or Heavy SleepersSome of us just aren't content with basic functionality; we need more buttons and more lights. Others just need a little nudge to wake up in the morning. If this is you, then the On Time200IDand400IHDare for you. Both feature an alarm clock and AM/FM radio, with the ability to wake up to your favorite song stored on your iPod (and then reject it with the snooze button). Of course, for the masochists, a classic buzzer is also available. TheOn Time 400IHDadds a dual alarm clock and HD radio to the mix, for a crystal-clear signal and a variety of text-based information (artist name, song title, weather alerts, school closings, etc.) scrolled across your screen.Something for EveryoneAll of these models feature a remote control for full iPod navigation, Evercharge topology to charge your iPod even when it's not connected to a PC or the system is turned off, a mini-jack for auxiliary devices, and the sleek design and solid performance you'd expect from JBL.CompatibilityThe JBL On Stage IIIP system is compatible with docking versions of the iPod, including the iPod touch, iPhone, iPod classic, and iPod nano 3G. A stereo mini jack connection also allows you to enjoy high-quality audio from a variety of other devices such as MP3 and CD players, desktop computers (all platforms), satellite radios, and laptops. Specific dockable iPod compatibility: iPod mini 1G; iPod nano 1G, 2G, 3G; iPod 3G, 4G, 5G, 5.5G, 6G; iPod touch; iPhone.Easy-to-Use Music and Navigation ControlsJust a touch of the music controls increases or decreases the volume. Using the navigation controls, browse songs, playlists, and photos; change tracks and settings; and more.Connection VersatilityThe JBL On Stage IIIP loudspeaker dock is a multimedia focal point. Enjoy your iPod, view photos or videos, and listen to virtually any other auxiliary audio component, all through the JBL On Stage IIIP system.Additional FeaturesIR remote--The JBL On Stage IIIP IR remote has several modes of operation. The Music mode allows you to control the volume, change tracks, fast forward, and fast reverse. The Navigation mode allows you to access menus on your mobile digital device just as if you were controlling the unit itself. You can search your music, watch your slideshows, and find and play your videos.Evercharge topology--The system charges your iPod/iPhone, even when it's not connected to a computer or if the system is off.Advanced TechnologyThe JBL On Stage IIIP loudspeaker dock combines many proprietary technologies to provide the highest-quality sound, astonishing bass, and clear and accurate audio from any direction.Odyssey transducers--The Odyssey drivers deliver accurate high frequencies while capable of low-frequency extension of four octaves, unlike traditional powered tweeters. This design provides a full, rich frequency response, from low bass to the highest highs.Slipstream port design--The port minimizes boundary layer separation, producing high-output bass with low distortion.COE (computer-optimized equalization)--The system equalization is computer-optimized to provide a rich, complete soundstage over a range of listening positions.OCT (optimized compression topology)--The proprietary compression technology ensures clean, accurate sound at high output levels.AEMS (advanced energy management system)--The automatic battery-saving shutoff will automatically put the system into sleep mode when there is no audio input. The system awakens with just a touch and resumes at the same volume level.Battery-powered--The JBL On Stage IIIP system uses most types of AA batteries. Six fresh AA batteries allow up to 12 hours of continuous play at normal listening levels. An amber LED flashes when the battery protection circuit senses that the batteries are low. JBL encourages the use of rechargeable batteries (e.g., NiMH), to reduce waste and help the environment.What's in the BoxJBL On Stage IIIP (Black), IR remote control, auxiliary audio input cable, power supply and cord, and adapters for iPod and iPhone.", "title": "JBL OnStage IIIP 30-Pin iPod/iPhone Speaker Dock", "price": 59.2, "imUrl": "http://ecx.images-amazon.com/images/I/414ImSgePlL._SX300_.jpg", "related": {"also_bought": ["B003BIFJOA", "B0016BQS12", "B00HZ4JLNG", "B0002DHN6Y", "B000TDTF22", "B0061HMPWM", "B004TEIMI0", "B004NNUEWY", "B006L2HBXA", "B001F7AHOG", "B000LRHWFI", "B00063NUVM"], "buy_after_viewing": ["B003BIFJOA", "B00AWRPIWQ", "B0016BQS12", "B003Y3BFB8"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}