{"asin": "B004HW73S4", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "It&rsquo;s Your Choice: LCD or Optical Viewfinder.An Optical Viewfinder makes capturing images simple and easy.WThe PowerShot A1200 digital camera gives you a choice that&rsquo;s getting increasingly hard to find on digital cameras today. It&rsquo;s equipped with an Optical Viewfinder in addition to the LCD screen. Many photographers prefer this classic, familiar option that lets you simply hold the camera to your eye and shoot.The camera&rsquo;s big, bright LCD screen gives you a wealth of important information about the shot. However, using it to compose and focus requires that you hold the camera away from your body. Many people do this with one hand, arms away from the body, effectively creating camera shake that can distort a shot. Using the Optical Viewfinder helps ensure that the camera is held steady.The great thing is that from shot to shot, whether you use the Optical Viewfinder or LCD screen is your choice.Everything&rsquo;s Easy.Smart AUTO intelligently selects the proper settings for the camera based on 32 predefined shooting situations.Just set the Canon PowerShot A1200 digital camera to Smart AUTO and you're ready for maximum enjoyment from your picture-taking every time. It's a relaxing and satisfying way to shoot because you can completely concentrate on your subject knowing that the camera has the technical details covered. Advanced Canon technology intelligently analyzes your situation and shooting conditions. Then it automatically selects an appropriate setting from 32 specially defined settings. So whether you're photographing flowers, a captivating sunset, or your friends at the park, you can be confident that you're getting dramatic, memorable images.Smart AUTOThe camera automatically selects the best shooting settings for optimal quality based on subjects and environmental factors to provide point-and-shoot simplicity.P ProgramAccess advanced exposure compensation features while shooting mostly automatically.Live View ControlEnables Brightness, Color, and Tone adjustments to your images using easy-to-understand controls.Creative FiltersThe Creative Filters mode dial setting provides easy access to special filter effect and scene modes.Fisheye EffectAdd a classic photo distortion without a fisheye lens.Miniature EffectGive images a miniature look with an effect that emphasizes perspective by blurring the top and bottom of the image.Toy Camera EffectSimulates photos taken with &ldquo;toy&rdquo; or pinhole cameras, darkening the image at the edges to create a vignette effect.MonochromeChoose from three single-tone effects: Black-and-White, Sepia, or Blue.Super VividSuper Vivid intensifies existing hues, saturating the scene with bright colors.Poster EffectPoster Effect combines several similar shades into one color, turning subtle gradations into eye-catching, scene-popping contrasts.EasyKeep the image quality as high as possible for fail-proof images.Blur ReductionBoosts sensitivity to enable faster shutter speeds, reducing the effects of camera shake and subject movement.PortraitThe camera sets a large aperture, focusing the subject and artistically blurring the background to make your subject &ldquo;pop.&rdquo;LandscapeFor front to back sharpness, the camera sets a small aperture.Kids &amp; PetsReduced focusing time freezes fast-moving subjects, so you won&rsquo;t miss those special shots.Smart ShutterThe camera automatically takes the photo when people smile, wink, or get into frame.Low LightFor high quality image capture in an amazing range of dimly-lit situations.BeachGet clear shots of people at a sunny beach without darkened faces.FoliageCapture brilliant shots of autumn foliage, greenery and blossoms.SnowShoot clear snow scenes without darkened subjects or an unnatural bluish tint.FireworksGrab brilliant images of skyrocketing fireworks.Long ShutterUse to blur moving subjects for artistic effect, ideal for urban night photography.Discreet ModeDisables flash, AF assist beam, and all camera sounds with one mode dial setting.In Still Images or 720p HD Video, Every Detail is Beautifully Preserved.Capture memories your way as either still images or in 720p HD video.PowerShot A1200 digital camera puts you in charge when it comes to saving your memories. Canon technology lets you capture beautiful still images no matter what your level of photographic experience. Portraits of people posing or in motion, outdoor shots in various weather situations, nighttime shooting and more: the camera handles them all with ease when you shoot in Smart AUTO. High megapixel counts let you blow up and crop your still images just as you please, with no loss in resolution or quality.Want to capture the good times in motion? Canon&rsquo;s 720p HD video gives your memories the quality they deserve. If you&rsquo;ve never shot video in high definition before, you&rsquo;ll be amazed at the difference it makes. 720p HD delivers stunning realism, capturing every detail with a level of clarity that, in playback, will bring you right back into the moment. Easy high definition videos from a compact still camera &ndash; now that&rsquo;s value!Loaded with Features, Packed with Value.This stylish, powerful A-Series camera has 12.1 Megapixels and 4x Wide-Angle Optical Zoom (28mm).With the PowerShot A1200 digital camera, dramatic, personal pictures have never been easier to shoot and share. This 12.1 Megapixel camera lets you create impressive large photos of family and friends you'll be proud to display. The high-resolution images taken by the PowerShot A1200 can be enlarged up to 13\" x 19\". The PowerShot A1200 digital camera has a 4x wide Optical Zoom lens (35mm film equivalent: 28&ndash;112mm) that let you capture up-close and memorable images.Get the Power Anywhere!This AA battery-powered camera enables you to easily power up on the go!Conveniently, you don't need to worry about running out or recharging of batteries with the PowerShot A1200 digital camera. Since AA-size batteries can be purchased at any store, simply get new ones locally.Shoot without Distractions.New scene mode: Discreet Mode disables the sound, flash and AF beam so you can still capture images in quiet areas.How many times have you found yourself in a situation where you wanted to take a picture, but were reluctant (or simply not allowed) to disrupt the setting with noise or flash? New Discreet Mode makes picture-taking possible in museums, at performances, anywhere light and sound would not be welcome. Simply turn the mode dial to Discreet, and the camera&rsquo;s sound, flash and AF assist beam will be disabled &ndash; without changing any other settings. If the camera senses low light, ISO speed will be automatically raised to get the best possible shot. You can even switch to playback mode to review still images or video, and the camera will remain muted.Photographic Artistry That&rsquo;s Easy for AnyoneCreative Filters offers fun and artistic ways to capture photos.Creative Filters Mode gives you lots of fun, easy ways to make your photography more creative. The camera does all the work &ndash; you simply choose an effect and shoot!Fisheye Effect imparts a fun, familiar curvilinear distortion to your image that&rsquo;s ideal for kids and pets. Miniature Effect plays with perspective, giving any shot the look of a world created in much smaller proportions &ndash; great for landscapes and city shots. When you shoot in Toy Camera Effect, you get the vintage effect of a first-generation camera, ideal for giving portraits a slightly distorted, unevenly saturated look of a picture you&rsquo;d come across in your attic. Monochrome lends a moody beauty to your photography, producing shots in Black &amp; White, Sepia or Blue. Super Vivid saturates colors to heighten the intensity and impact of any shot. Poster Effect takes away transitions between objects in the frame to give your image the high-impact look of a hand-painted poster.See the Image on a Big Screen.Large, clear 2.7-inch LCD makes taking and viewing images a breeze.The PowerShot A1200 digital camera has a large 2.7-inch LCD screen that gives you the big picture, whether you're shooting, reviewing or showing off your images. This high-resolution screen offers a crisp, clear and bright picture. It also features Night Display for easy viewing in low light.2.7-inch LCD Screen", "title": "Canon Powershot A1200 12.1 MP Digital Camera with 4x Optical Zoom (Black)", "price": 169.99, "salesRank": {"Camera &amp; Photo": 1041}, "imUrl": "http://ecx.images-amazon.com/images/I/41w658d5ZJL._SX300_.jpg", "related": {"also_bought": ["B003VNKNEG", "B001V9KG0I", "B005HNF01O", "B001OBVUQC", "B0075SUIEI", "B003VNKNEQ", "B003F7DWH8", "B0075SUIOS", "B000WQKOQM", "B0075SUII4", "B0045DT2CK", "B00AWYMXZY", "B0075SUITS", "B005POCF4U", "B002760XYS", "B000UZL0YU", "B003CJTQJC", "B0075SUHQC", "B004HW73QG", "B0073HSKAA", "B000VUVA62", "B007JRB0TC", "B004HW73R0", "B001W1BSM0", "B005RXH1WU", "B0075SUIZW", "B000MX48VM", "B0073HSK0K", "B0020ZDI5C", "B0075SUHKI"], "buy_after_viewing": ["B00AWYMXZY", "B003F7DWH8", "B003VNKNEQ", "B0075SUIEI"]}}