{"asin": "B000083CUA", "categories": [["Electronics", "Portable Audio & Video", "Radios", "Shortwave Radios"]], "description": "The Et&oacute;n Grundig FR200 Emergency Radio is the entry-level shortwave radio in Et&oacute;n's line of emergency radios. With a dependable hand-crank power generator that powers the unit's AM/FM/Shortwave radio and built-in LED flashlight, the lightweight and portable Grundig FR200 is an economical choice for anyone in the market for a radio that can be relied on in emergencies or in environments where there are limited power sources.Emergency lighting and radio tuning all in one compact package.View larger.The easy-to-read radio dial.View larger.The hand crank recharges the integrated rechargeable battery.An emergency light shines the way.Other models in Et&oacute;n's line of emergency radios that we tested include theGrundig FR250, a shortwave radio that also includes a flashing LED light, cell phone charger and siren; theGrundig FR300, which includes the emergency features of the FR250, but offers television and weather station tuning instead of shortwave; theGrundig FR 350, a water-resistant variation of the FR250; and theGrundig FR 400, a water-resistant variation of the FR300.Power When You Need ItAt the heart of all of Et&oacute;n's emergency radios, including the Grundig FR200, is an internal generator that recharges the internal Ni-MH battery pack and powers the radio and flashlight. According to the product manual, to achieve 40 to 60 minutes of uninterrupted power you must turn the crank at a rate of two revolutions per second for 90 seconds. In our test, after our initial 90 seconds of rigorous cranking, the FR200 powered right up and was still going strong with radio reception after an hour. At the hour mark, we briefly turned the flashlight on, and that too was at full force, with no perceivable drain on radio reception. The FR200 can also be powered via an AC adapter which, to our dismay, is not included, or from three AA batteries, also not included. The dynamo crank tucks itself nicely into the side of the radio and offers little resistance as you turn the handle. (Don't let the cranking requirements frighten you! A full 90 seconds of turning the crank can be tiring and may not be for everyone. With that in mind, we also recharged the radio with less than a minute of cranking and achieved over 40 minutes of continuous power.)Design and ControlsAt slightly more than a pound in weight, and with dimensions of 6.5 x 5.75 x 2.25-inches (WxHxD), the FR200 is designed to be tucked neatly into its handy nylon carrying case and can be easily stored in an emergency box, or packed neatly for a camping trip. An LED flashlight is set on the front of the radio, just to the side of the analog tuner. The flashlight is designed to help you down an unlit stairwell or enclosed hallway in a pinch, but the light is not directed or strong enough to help you much in a pitch-black forest or other open area. The radio and light can be operated simultaneously, though of course at the expense of power.The FR200 includes a handy strap on the top of the radio for easy carrying, and the tuning and volume knobs are set to the side. The mechanical controls are extremely visible and easy to use. The volume control is a bit difficult to finesse, while the tuning knob, on the other hand, which features a smaller concentric fine-tuning control knob, is much easier. An earphone jack is set into the back, and the telescoping antenna tucks neatly behind the handle strap. The radio's 2.5-inch speaker is set directly in front and offers reasonable audio quality for the radio's purpose. The tuner itself is not illuminated in any way, which makes sense for reasons of power conservation, but in a darkened environment, it's literally impossible to see. For an \"emergency radio,\" it seems that Et&oacute;n might have addressed this problem with a self-illuminated background or lettering, as they did with the FR250, FR300, FR350 and FR400 models.Tuning and BandsThe FR200 offers 14-band tuning -- AM, FM and 12 shortwave bands. Our AM reception was outstanding; we were quickly able to tune into every station we searched for. Reception for FM was also very good, though there was some extra fine-tuning on some of the stations. Our shortwave reception, however, was a mixed bag. We tested in the early and late evening, searching for signals in the more heavily populated SW1. While we found several signals during our test, honing in on them took a bit of finesse with the fine-tuning knob. And when we did find them, there was static and background noise with most of the signals.It became clear during our testing that the FR200 is an emergency radio, with several outstanding features that include shortwave reception; its shortwave functionality, however, is not its primary selling point. But for a basic, entry-level and economical emergency radio to use in a pinch or during an outing where access to electricity is an issue, the Grundig FR200 more than suits the bill.ProsCompact and lightweight; ideal for emergencies or travelClearly laid out functions and controlsExcellent internal power generatorConsTuning dial should be illuminated for darkened environmentsShortwave reception inconsistentShould include an AC adapterWhat's in the BoxFR200 radio, carrying case, and owner's manual.", "title": "Grundig FR200 Emergency Radio (Discontinued by Manufacturer)", "price": 43.55, "salesRank": {"Electronics": 37972}, "imUrl": "http://ecx.images-amazon.com/images/I/51PNGHN2WRL._SX300_.jpg", "related": {"also_viewed": ["B0006G0II2", "B001F0MNRM", "B0091JTU84", "B0051QJJ1E", "B000EDIKVO", "B003XL3BQI", "B005F5II1I", "B004FV4ND0", "B003A21DQA", "B001EUG3II", "B00IP046E8", "B000EIBVKG", "B000Q5APCC", "B001QTXKDI", "B007KFLVTM", "B002H0H310", "B001QVFMS2", "B000P0O12I", "B005OZJYZS", "B001QTXKE2", "B000EIDLWC", "B001QTXKF6", "B008DRA2GE", "B001QTXKEM", "B001F51GYI", "B0051PMWY6", "B00HMREOLK", "B0014T7W8Y", "B0016OVN1O", "B000B753CC", "B00GO1UV4E", "B001QTXKB0", "B0009IIE5G", "B007KFLV9W", "B000EIB03Y", "B007HSOAYU", "B0002AHRVI", "B0002AHRWW", "B007KFLVW4", "B00KSFDE6Y", "B003BYRKIW", "B000FTLCZI", "B00B4PJ524", "B004H9C4JK", "B000P0M99U", "B004H912FC", "B00ET8FP68", "B0014TCU9K", "B00006IS4X", "B003BYRKI2", "B00A81ICCE", "B001QTXKC4", "B007H3L24Q"], "buy_after_viewing": ["B007KFLVTM", "B008DRA2GE", "B001F1ZRAQ", "B00066Z9XG"]}}