{"asin": "B000PCBVA6", "description": "Amazon.com Product Description Building on the success of the TomTom ONE, the TomTom ONE XL ups the ante with a gorgeous widescreen, 4.3-inch display, and expanded traffic options that include GPRS- and optional RDS-TMC radio-based real-time traffic information. The TomTom ONE XL is a complete portable GPS vehicle navigation device with an incredible range of features.The TomTom ONE XL sports a crisp and bright widescreen display, so you can see even more of the road ahead.See a comparisonof the TomTom ONE and TomTom ONE XL screens.Navigate to millions of points of interest with ease.Powerful traffic services give you a big advantage on the commute home.View larger.Use TomTom PLUS services to stay abreast of key information.View larger.You betta' choose my voice, sucka!View larger.Like TomTom's other navigation systems, the ONE XL gives you coverage in all fifty of the United States, as well as Canada--all stored on 1 GB of internal memory.But it's not just the broad geographical coverage that makes the TomTom ONE XL special. The user-friendly design also puts it a step above other navigation systems. The crystal-clear multicolor display makes for exceptionally easy viewing of maps, routes, driving directions, and other traveling information, such as mileage and distance. Measuring 4.3 inches, the TFT display offers an expanded widescreen view of brilliant two- and three-dimensional graphics. The device also features 32 MB RAM and 266 MHz CPU, making it responsive and zippy. Using the USB port and the provided cable, you can use your PC to add your own points of interest. Memory expansion is made possible by an SD card slot.The ONE XL provides clear and accurate turn-by-turn voice instructions, so that you don't have to take your eyes off the road while your vehicle is on the move. Voice instructions are issued at a speed-sensitive volume, so as your vehicle's engine becomes louder or quieter as your speed changes, the volume adjusts itself accordingly, guaranteeing clear and easy listening. And because voice instructions are available in over 30 languages, just about anyone will find the TomTom ONE XL to be an invaluable system.With its touch-sensitive screen, the TomTom ONE XL puts programming and operation literally at your fingertips to make sophisticated technology simple. The built-in database offers thousands of points of interest for you to use as destinations or reference points as you plan your trip. The ONE XL will also provide a selection of available routes, giving you the option of avoiding toll roads or choosing between the quickest or the most scenic routes. The database includes zip codes to simplify your route selection, and for extra convenience, the ONE XL lets you save the addresses of frequent destinations, making route planning easier and faster than ever. Other display features include a compass mode to assist you with directional orientation, and an anti-glare screen for optimal viewing even in direct sunlight.For additional navigational features to assist with trip planning, the built-in Bluetooth connection provides access to TomTom PLUS subscription-based services, so that you can tune in to the latest traffic and weather conditions, as well as download additional city maps, voices, points of interest, and much more. The ONE XL adds to these capabilities with FM radio-based RDS-TMC traffic information as an available accessory (not included).Weighing less than 10 ounces and measuring 3.4 x 4.7 x 1.2 inches, the TomTom ONE XL can be easily installed in any vehicle. An included windshield suction mount holds it in place. Plus, with an operating temperature range of an icy -10 degrees to a sweltering 55 degrees Celsius (14 to 131 degrees Fahrenheit), the navigator is durable enough for New England winters or Arizona summers. The TomTom ONE XL is powered by an internal lithium ion battery that can be charged from your vehicle's cigarette lighter with the included 12-24V adapter.What's in the BoxTomTom ONE XL device, windshield mount, USB cable, cigarette lighter adaptor, adhesive mounting disk, documentation pack, and product code card.", "title": "TomTom ONE XL 4.3-Inch Bluetooth Portable GPS Navigator", "price": 14.95, "imUrl": "http://ecx.images-amazon.com/images/I/51NmqEooKzL._SY300_.jpg", "related": {"also_viewed": ["B001VEJEGK", "B004J4VYG2", "B000H866BM", "B003FSTAFK", "B002OL2NT4", "B001LK6XHM", "B003FSTAGY", "B004FWOECY", "B000U9WVW6", "B0014GXCBI", "B007M52QR6", "B0011ULQNI", "B003B3P2CY", "B0015F1L7A", "B004MYFTFG", "B00A7LULA6", "B004J4VYGM", "B004MYFTFQ", "B007M52EXM", "B007M4Z7GO", "B004MYFTE2", "B000OH63MI", "B00C9W1LT6", "B0015EWMX8", "B001H9NR2Q", "B004W1GQ92", "B002Y3IAVC", "B004MYFTEW", "B00AJXMWP4", "B003EG0200", "B007M52QEE", "B003B3P29W", "B00160GOR6", "B007PPYXOC", "B005LMWPYG", "B004MYFTEC", "B00BHAC85W", "B001U0O7T4", "B007M4Z60Q", "B00HK6CPVY", "B004MYFTF6", "B003FSTAHS", "B001P3O764", "B001H9O72K", "B00HTAUEUK"], "buy_after_viewing": ["B0016IGN2Y", "B007M52QR6", "B0057OCDQS", "B007M4Z7GO"]}, "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS"]]}