{"asin": "B00008Y0VN", "related": {"also_bought": ["B000V7AF8E", "155407147X", "B003HC89LU", "1931559430", "B000BYH8EQ", "0961320745", "1931559317", "0961320753", "B00DV6SI3Q", "B004ZGLM5W", "B005KP473Q", "B005H16S6M", "B001DELTLQ", "B00E0G3NRW", "0521153972", "B00BTBPCWA", "B00CTUXKWY", "1928771017", "B0000665V5", "B006U3ZJMK", "B00HM9TIS2", "B000I4JG26", "B004OUMTT2", "B0007UQNKY", "B006ZN4TZS", "B000051ZOA", "B0007UQNTU", "B0000A0AET", "B0002DHN6Y", "B00004TBLW", "B00B30MSCE", "B00I52MS4G", "B005CGIIE2", "B0002379UO", "B00CQY7BBO", "B0000XMWQW", "B000VZS2EU", "B004QF0A1Y", "B00006RH5I", "B000EQCVNY", "B00AR9TU0A", "B001D60LG8", "B004ZGN6MY", "B0072LAAA0", "B000ANCPNM", "B002XULCA2", "B00AMPJGMG", "B004N59OFU", "B002XQ2D8Q", "B007JRB0SS", "B00D6OHHEE"], "bought_together": ["B000V7AF8E"], "buy_after_viewing": ["B00B7LQ73U", "B000051ZOA", "B00CTUXKWY", "B00004TBLW"]}, "title": "Celestron SkyMaster Giant 15x70 Binoculars with Tripod Adapter", "price": 64.0, "salesRank": {"Camera &amp; Photo": 24}, "imUrl": "http://ecx.images-amazon.com/images/I/41ADnGTqmeL._SY300_.jpg", "brand": "Celestron", "categories": [["Electronics", "Camera & Photo", "Binoculars & Scopes", "Binoculars"]], "description": "Binoculars come in a wide range of shapes and sizes these days, and  an even wider range of prices.  It's easy to spend less than $100 or more  than $500 for what may appear to be, at least outwardly, comparable models.   While they may look the same, they are probably quite different on the  inside.Recently, the binocular market has seen a flood of giant binoculars at  prices that were unheard of just a few years ago.  In general, giant  binoculars are defined as those that magnify the view 10 times or more and  have 70-mm or larger front (objective) lenses.  It used to be that the least  expensive giant binoculars cost in excess of $150, even $200.  All that  changed not long ago, when the bottom fell out of the price cellar.  Now,  several companies import giant binoculars that sell for half that, or less.Celestron's 15x70 SkyMaster binoculars are one of the leaders in the  low-price giant binocular arena.  They certainly sound good on paper.  The  SkyMasters include multicoated optics and BaK-4 internal prisms, two  features that promise brighter, better images, and key points to look for  when judging a pair of binoculars.  They also come with an adapter for  attaching them to a photo tripod, which is a must to use them to their  fullest, and a soft carrying case.  But just because they are cheap doesn't  always mean they are worth the price.  Would it be better to save up for a  more expensive pair?To find the answer, I had an opportunity recently to judge the SkyMasters  against a pair ofFujinon 16x70 FMT-SX binoculars, one of  the finest pairs of giant binoculars sold today.  Like the SkyMasters, the  Fujinons feature BaK-4 prisms, but also have fully multicoated optics.  As a  general rule, superior coatings mean superior image sharpness and contrast.   But then, that should be expected, given that the Fujinons cost many times  more than the Celestrons.While the Fujinons were clearly the better performer, the Celestron  SkyMasters held up admirably.  Image brightness, quality, and contrast were  all remarkable considering their bargain price.  Although images were a  little soft across the outer 25% of the Celestron's field, the overall view  was impressive nonetheless.Some inexpensive binoculars have very sloppy focusing, causing the eyepieces  to tilt and shift.  Not so with the SkyMasters.  I found that their  center-focusing mechanism worked smoothly, with no apparently backlash or  wobble.  Eye relief (the distance you hold your eyes away from the eyepieces  to see the full field) is stated to be 18 mm, a good distance for higher  power binoculars and an important consideration if you must wear glasses  when viewing.  The SkyMasters are also light enough to support by hand for  short periods of time, although buyers would be well advised to mount them  on a sturdy photo tripod.The bottom line is, if you are considering a pair of giant binoculars,  whether for bird watching, stargazing, or another recreational use, and have  a limited budget, Celestron's giant 15x70 SkyMasters represent an excellent  value. --Phil Harrington, author ofStar WareandStar WatchPros:Exceptional value for the priceLight enough to support by handBaK-4 prismsMulticoated opticsCons:Outer 25% of the field is soft and a little blurryRequires a tripod to use for extended periods"}