{"asin": "B001GQYYSG", "categories": [["Electronics", "Computers & Accessories", "Data Storage", "Internal Hard Drives"]], "description": "It's easy to choose the world-class quality of a Western Digital hard drive. We&rsquo;ve not only designed a drive that's right for you, we've also made it simple to find. These drives are ideal for business, home use, or high performance desktops, and are available in capacities up to 2 TB. With our renowned leading-edge engineering, you'll always make the right choice with WD. And you'll never compromise on quality.The power of choice. The quality of WD.WD Caviar&reg; Blue&trade;Performance and reliability for everyday computing.Select true blue for reliable quality in everyday use.WD Caviar&reg; Green&trade;Cool, quiet.Select green for doing more with less energy consumption.WD Caviar&reg; Black&trade;Maximum performance for power computing.Select black when you demand the highest performance.WD Caviar Black &ndash; Maximum performance for power computing.WD Caviar Black drives combine a high performance electronics architecture with a rock solid mechanical architecture to deliver the perfect storage solution for your fully-loaded PC or maxed out gaming machine. Cool drive operation, no-touch head technology, and leading-edge vibration protection ensure enhanced reliability. And we back it all up with a 5-year limited warranty.Features at a glanceMaximum performanceUltra-cool and quietMassive 1 TB capacity5-years limited warrantyPower your PC with our top-of-the-line high-capacity drives.High Performance Electronics ArchitectureDual processor - Twice the processing power to maximize performance.32 MB cache - Bigger, faster cache means faster performance.Rock Solid Mechanical ArchitectureStableTrac - The motor shaft is secured at both ends to reduce system-induced vibration and stabilize platters for accurate tracking, during read and write operations.NoTouch ramp load technology - The recording head never touches the disk media ensuring significantly less wear to the recording head and media as well as better drive protection in transit.5 Year Limited WarrantyMassive Capacity- WD Caviar Black SATA drives are available in capacities up to 1 TB.View StableTrac demohere.Compatible- We perform tests on hundreds of systems and a multitude of platforms in our FIT Lab and Mobile Compatibility Lab to give our customers confidence that our drives will work in their systems.How this WD hard drive protects your dataData Lifeguard is an exclusive set of data protection features, including shock protection, an environmental protection system and real-time embedded error detection and repair. WD's Data Lifeguard technology automatically finds, isolates, and repairs problems that may develop over the life of a hard drive.Data Lifeguard Tools are software utilities designed for WD hard drives that work with the embedded Data Lifeguard features to make hard drive installation,diagnostics and repair both simple and worry-free.ShockGuard instantaneously protects the hard drive against damage from bumps and vibrations while it is running. This technology enables WD Caviar drives to achieve industry-leading shock specifications.Ideal ForPower computing applications such as multimedia, video and photo editing, and maxed out gaming computers.", "title": "Western Digital 500 GB Caviar Black SATA 3 Gb/s 7200 RPM 32 MB Cache Bulk/OEM Desktop Hard Drive - WD5001AALS", "price": 98.0, "imUrl": "http://ecx.images-amazon.com/images/I/51evy-2mcDL._SY300_.jpg", "brand": "Western Digital", "related": {"also_viewed": ["B008968L6M", "B00461G3MS", "B0036Q7MV0", "B001C271MA", "B000Q85WOK", "B00FJRS6FU", "B00DSUTX3O", "B001CW9NL2", "B004DMFAJ2", "B004CSIG1G", "B002OOWHYC", "B00COGDERY", "B000PED78S", "B00A2IM76K", "B005CT56R6", "B00DSUTWMQ", "B001EMZPD0", "B00DRA4F06", "B003YVJJ5Y", "B004CSIFFS", "B00B99JU5M", "B0088PUEPK", "B00461K1QW", "B00461E7JE", "B005T3GRNW", "B00B99JUBQ", "B00F3ZN2W0"], "buy_after_viewing": ["B008968L6M", "B0088PUEPK", "B00461G3MS", "B0036Q7MV0"]}}