{"asin": "B0035FZJKI", "related": {"also_bought": ["B001V9KG0I", "B0035FZJLW", "B003U8JXGQ", "B003D8ILZW", "B0091U8YYO", "B003VNKNEQ", "B003VNKNEG", "B00B5HE3AK", "B0037T6O2Y", "B0015DPJCA", "B004J3V8UU", "B005HNF01O"], "bought_together": ["B003VNKNEQ"], "buy_after_viewing": ["B003VNKNEQ", "B003U8JXGQ", "B00B5HE3AK", "B003VNKNF0"]}, "title": "Canon PowerShot SD1300 IS 12.1 MP Digital Camera with 4x Wide Angle Optical Image Stabilized Zoom and 2.7-Inch LCD (Silver)", "price": 210.0, "salesRank": {"Camera &amp; Photo": 2506}, "imUrl": "http://ecx.images-amazon.com/images/I/41eDq%2BYYvyL._SX300_.jpg", "brand": "Canon", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "It's all about the power of contrast. Color that defies convention. Sleek, gentle curves that merge art and technology into a camera designed to inspire. The PowerShot SD1300 IS Digital ELPH camera captures your world as much as it expresses your originality, with bold innovations that include remarkable low light performance. Everything looks right. Hold it, and everything feels right, too.PowerShot SD1300IS Highlights28mm wide-angle lens, 4x optical zoom and Optical Image StabilizerThe Canon commitment to innovation defines the excitement of the PowerShot SD1300 IS Digital ELPH with its 28mm wide-angle lens and 4x optical zoom that makes it easy to get the inspiring, emotive close-ups that will make your images lasting keepsakes.This magnificent lens gives you the power to shoot distant subjects with razor-sharp precision and stunning life-like color. So you can brilliantly capture a closer shot of a landscape, or a child's big smile.The PowerShot SD1300 IS Digital ELPH is equipped with the acclaimed Canon Optical Image Stabilizer, which automatically detects and corrects camera shake--one of the leading causes of fuzzy or blurred shots. Even when zoomed in, you can get the steady, crisp, brilliant images you'll be proud to shoot and share. And the Canon Optical Image Stabilizer technology is so convenient to use. It functions perfectly with or without a flash.Smart AUTO mode intelligently selects from 18 settingsJust set the Canon PowerShot SD1300 IS to Smart AUTO and you're ready for maximum enjoyment from your picture-taking every time. It's a relaxing and satisfying way to shoot because you can completely concentrate on your subject knowing that the camera has the technical details covered. Advanced Canon technology intelligently analyzes your situation and shooting conditions. Then it automatically selects an appropriate setting from 18 specially defined settings. So whether you're photographing flowers, a captivating sunset, or your friends at the park, you can be confident that you're getting dramatic, memorable images.Shooting ModesAdvanced presets for the best possible photos under certain conditions. With 15 Shooting Modes, you're ready for whatever shot comes your way.12.1-megapixel resolution makes it a breeze to print large size imagesWith the PowerShot SD1300 IS, dramatic, personal pictures have never been easier to shoot and share. This 12.1-megapixel camera lets you create impressive, large photos of family and friends you'll be proud display. The high-resolution images taken by the PowerShot SD1300 IS can be enlarged up to 13 x 19 inches.Bright, clear 2.7-inch PureColor System LCDThe PowerShot SD1300 IS gives you a large 2.7-inch LCD screen for excellent control when framing your shots. The Canon PureColor System LCD offers spectacular color, resolution and contrast even when viewed at an angle. The screen is highly durable and easy to see in any light with a scratch-resistant, anti-reflective coating. It also features Night Display for easy viewing in low light--a perfect feature for gathering friends and family around to see your images.Shoot in Low Light mode for dimly-lit situationsWith an ISO of 400-6400, the Low Light mode takes the Canon PowerShot SD1300 IS boldly into the shadows! Now even scenes notorious for having insufficient light, such as those lit by candles, fire, or street lamp, come through in fantastic color and clarity, with less noise. You can keep the feel of the scene intact without adding additional light, so the result will be scenes with the visual accuracy, depth and clarity you expect from a Canon camera.What's in the BoxPowerShot SD1300 IS Digital ELPH BodyLithium-ion Battery Pack NB-6LBattery Charger CB-2LYWrist Strap WS-DC7Digital Camera Solution CD-ROMUSB Interface Cable IFC-400PCUAV Cable AVC-DC400"}