{"asin": "B00000DMAR", "description": "Crash Bandicoot, the poster marsupial for PlayStation, is back. In this third installment of the popular action-game series, Dr. N. Trophy has built a time machine to collect the gems and crystals dropped by Dr. Neo Cortex. Joining this dastardly group is Dr. Cortex's boss Uka Uka, a freaky floating mask that is out to crush Crash. It is up to Crash and his sister, Coco, to conquer this threatening threesome and grab the goodies.Warpedoffers 25 levels of challenging solo action. If you have a dual shock controller, this game takes full advantage of its vibration feature, which is especially fun when a dinosaur is chasing Crash. The music is appropriate to the action and the controls are easy to use. But it's the graphics that make this a stand-alone title. A team of artists worked on this game to design seamless movement that is more like an interactive cartoon than a game.Novice gamers will enjoy this title for its ease of movement and challenging gameplay. Hardcore gamers will appreciate its hidden secrets and shortcuts. And how can you go wrong with Arabian cities, underwater worlds, medieval times, menacing frogs, pirate-head cannonballs, and creepy scorpions?Crash Bandicoot Warpedis a goofy game with enough fun features to satisfy both diehard and beginning gamers.--Kasty ThomasPros:Superior graphicsDual-shock capabilities fully utilizedHours of gamingCons:None!", "price": 69.99, "imUrl": "http://ecx.images-amazon.com/images/I/51uDBcdoqTL._SX300_.jpg", "related": {"also_bought": ["B00000I1BR", "B00000I1BQ", "B000034DCF", "B00000I1BF", "B00004U4R8", "B000034DC2", "B00004U4R9", "B00005NCCI", "B0015MMN6G", "B000K6TOK6", "B0045L3SNQ", "B00004XOWT", "B000029706", "B000PWAAAI", "B0015IXKSK", "B0001CJEJU", "B00000I1BS", "B00001XDK5", "B00001QHW9", "B00004TBGT", "B00000K1VK", "B000637T7S", "B00008NRM7", "B00006F2ZP", "B00001QER9", "B00005MA97", "B0007KTBB2", "B00000JNHJ", "B000TLU67W", "B000SMIUQQ", "B00004YRQ9", "B00000IG7T", "B000021Y5T", "B00001QED2", "B00002STJI", "B001TEYMRI", "B00002STJO", "B00005NISJ", "B00005NGLC", "B001MW91IW", "B00005R5PO", "B007UHQO6A", "B000034DC7", "B00002STIW", "B000066TS5", "B00001XDKD", "B00001ZWVR", "B00004YRQA", "B0032RDXHA", "B000GACEHQ", "B0000690ZE", "B00005NCAY", "B0062DIGA0", "B00001ZWXH", "B000R3O1HS", "B00000JQQH", "B00000IFKW", "B0000C7GHG", "B00000I1BV"], "bought_together": ["B00000I1BR", "B00000I1BQ"], "buy_after_viewing": ["B00000I1BR", "B00000I1BQ", "B0045L3SNQ", "B00005NCCI"]}, "salesRank": {"Video Games": 1557}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "More Systems", "PlayStation", "Games"]]}