{"asin": "B000OBJW1I", "categories": [["Electronics", "Home Audio", "Stereo Components", "Receivers & Amplifiers", "Component Receivers"]], "description": "You've spent lots of time researching the purchase of the widescreen HDTV that you've wanted. Did you know that the improved visuals are just part of the total experience? Sound is the other. Surround sound just like that in a movie theater. This receiver helps create a home-theater environment of superior caliber. It's got an AM/FM tuner like most receivers but it's optionally upgradeable to receive XM and Sirius satellite radio. Are you iPod savvy? An optional iPod dock lets you play it through this sound system. With HDMI and other connectors for all your audio and video sound sources, the Onkyo TX-SR705, with Lucasfilm THX Select and Dolby TrueHD, is the central control of your home's entertainment space. And you're #1.  1080p-compatible HDMI 1.3a digital video switching (3 in, 1 out); Analog-to-HDMI video upconversion; 480i (interlaced) to 480p (progressive) conversion via component video switching (3 in, 1 out); 3 optical (including 1 front panel), 3 coaxial digital in and 1 optical digital out; 5 audio/video inputs, including 1 front-panel input with composite and S-video, 4 rear-panel inputs with composite and S-video, 3 audio-only inputs (including phono)   Dual-room/Dual-source audio (powered and line-level stereo audio output for 2nd room; using powered 2nd-room output allows 5.1 home theater in main room)    Up to 40 AM/FM/XM/SIRIUS programmable station memory presets    Onkyo learning/multibrand remote helps replace the assembly of remotes to control your entire home-theater system   Unit Size - 17-1/8W x 6-7/8H x 14-13/16D    Onkyo USA limited warranty - 2 years", "title": "Onkyo TX-SR705 7.1 Channel Home Theater Receiver (Black) (Discontinued by Manufacturer)", "price": 5.99, "salesRank": {"Electronics": 84343}, "imUrl": "http://ecx.images-amazon.com/images/I/41P0TeJd%2B7L._SX300_.jpg", "related": {"also_viewed": ["B004TA9V7U", "B00HN1S44I", "B0077V88VI", "B004O0TRD8", "B007JOO4YS", "B00BLGUKBQ", "B00BLGUKEI", "B00BLGUKDE", "B00B981F4M", "B001GCUOEI", "B0077V8930", "B00ILCS182", "B004O0TRDI", "B002IKKFUA", "B007JF85WE", "B00505F01E", "B00CILJB0E", "B0077V88W2", "B000OBLARW", "B00CAAQHBE", "B007O5ATC8", "B0077V88YU", "B00CLXO14K", "B0081N916M", "B00B981F1U", "B007JF861O", "B00CO07C6E", "B008J834ZS", "B004NHCGJO", "B00IQ0SE22", "B009HB2USI", "B00BHC7ZTE", "B00JRTMOGS", "B005GNWHFM", "B007R8U5R6", "B00548SKH8", "B00CALM17C", "B00ILCS164", "B003R7KMSI"], "buy_after_viewing": ["B0077V88W2", "B003L1ZYYM", "B0077V8930", "B006U3O566"]}}