{"asin": "B0009Q4PH4", "description": "For over 12 years, Ultimate Ears has been designing custom ear monitor products for your favorite professional musicians for use on stage and in the studio. Musicians put their hearts, their souls, their breakups, their memories and their passions into every song and they count on Ultimate Ears products to get the most out of their music. Now Ultimate Ears has taken the same technology found in its custom personal monitors and developed a line of personal earphones for music fans, so that you too can hear music the way it is meant to be heard.Ultimate Sounds for Any Lifestylemetro.fi 2If you are a fashion-conscious, active commuter who wants to get better sound from your MP3 player or iPod than you&#x92;re getting with your player&#x92;s stock headphones, the metro.fi 2 was made for you. It gives you a full spectrum of sound in a stylish in-ear design that incorporates a universal fit kit to maximize your comfort and minimize the noise around you.  The passive noise-isolating design blocks out 16 dB of ambient noise, while the titanium-coated speaker and proprietary audio filters deliver a full, \"punchy\" sound.  The metro.fi 2 series is perfect for those looking for an entry-level step up from their portable audio player's stock headphones.super.fi 3The super.fi 3 Studio earphones give you studio-quality sound in a unique in-ear design that incorporates pro-style ear loops to keep your earphones in place and a universal fit kit. They seal your ear canal like the metro.fi 2, but block even more noise because the internal speaker is different. The super.fi 3 studio incorporates a proprietary balanced armature driver--the same technology found in hearing aids. Instead of pushing air to generate sound waves like your home speakers, a balanced armature is a coil that vibrates like a guitar sting. This driver gives you distortion-free, full-range audio clarity while the in-ear design provides up to 26dB of noise isolation for clearer sonic detail.  The super.fi 3 series is a great introduction to true audiophile headphones for those who are looking to get more out of their portable player.super.fi 4The super.fi 4 uses the same speaker technology and sound signature that is used in other Ultimate Ears professional monitors.  The noise isolating design reduces ambient interference and enhances quality of sound.  The custom tuned balanced armature/speaker is enclosed in a durable, lightweight aluminum housing.  The super.fi 4 features two wearing styles, cable down for casual listening and over-the-ear while exercising.  Accessories include a pocket-ready hard carrying case, comfortable silicone fit tips with small, medium, large and dual flange fitting options, and an airline attenuator for hearing protection when using an unstable sound source.super.fi 5The super.fi 5 uses the same speaker and sound signature used in other Ultimate Ears professional monitors. It offers a detailed, sonically rich experience that is perfect for all types of musical genres. The super.fi 5 utilizes a precision crafted top-fire armature to produce a remarkably full soundstage. The metallic silver body with UE logo is stylish, low profile and ideal for a person on the go. The earphones are color coded for easy left and right identification. Cables can be worn down for casual listening or over the ear for active lifestyles. Accessories include three sizes of soft silicone ear tips, two sets of Comply foam ear tips, a cleaning tool, and a pocket ready pebble-shaped case.super.fi 5 EBFor those who need a little more low-end response, the super.fi 5 EBs deliver the same professional-grade sound, noise isolation, and superb form factor as other earphones in the super.fi line--but with an increased bass sensitivity for deep and driving beats.  Precise audio filters and an encapsulated diaphragm subwoofer ensure that the bass stays tight and distortion-free, never muddy.  The super.fi 5 series' dual-driver technology makes these earphones ideal for studio-grade acoustic performance while delivering an increased \"thump\" for those who like to really feel their music. These earphones also include a metallic travel case.super.fi 5 ProThe super.fi 5 Pros are the closest you can get to the same professional-grade stage monitors custom-made by Ultimate Ears for stars like Madonna, Metallica, and Linkin Park.  Experience superior full-range sound, thanks to audio filters that shape the sound for maximum detail and passive crossovers that direct music totwo different driversfor precise audio reproduction.  This design incorporates one 13.5mm diaphragm for clear, non-muddy lows, and one precision balanced armature for detailed mids and highs.  These earphones also include a metallic travel case.triple.fi 10 ProIf the super.fi 5 series feels like being a musician in the studio, the limited edition triple.fi 10 series is like being a professional sound engineer.  If you want to hear every possible nuance and musical layer, then you need triple.fi 10 Pro earphones. These earphones offer one of the most sonically rich experiences humanly possible when listening to any style of music--when a guitarist slides their fingers along the strings or when a singer exhales, you will hear every detail. The triple.fi 10 Pro series is Ultimate Ears' latest technological breakthrough and the only professional earphone product withthree separate drivers--one for accurate bass, one for the critical vocal midrange, and one for crystal-clear highs. These earphones also incorporate all the best features that Ultimate Ears universal products have to offer, including pro-style ear loops that secure your earphones in place and a universal fit kit--plus a distinctive metallic blue finish that truly separates you from the pack. The triple.fi 10 Pro&#x92;s also come with a metallic protective travel case, sound attenuator and &#xBC;\" adaptor jack. Now your head is a world class recording studio. But don&#x92;t take our word for it--hear the difference for yourself.Getting the Ultimate Fit from Your Ultimate EarsJust ordered yourself some Ultimate Ears or already own a pair?  Click the image to the right to see a short tutorial on how to insert your Ultimate Ears to achieve the best seal for your ear-canal.  (The tutorial will open in a new window.)", "title": "Ultimate Ears Super.fi 5 Pro Earphones (White) (Discontinued by Manufacturer)", "price": 27.99, "imUrl": "http://ecx.images-amazon.com/images/I/410F0tfD0LL._SX300_.jpg", "related": {"also_viewed": ["B00D77KEEK", "B0019RBJOE", "B001CW13UQ", "B001DCBBHK", "B0094S35W4", "B0009Q4PIS", "B00JB66VX4", "B00373PE9Y", "B001MBLBXQ", "B000Y8Y8FG", "B003YKG2XC", "B003YKG2UK", "B006DIFXTG", "B003YKG2YQ", "B002LWOKJ2", "B001NTFAOS", "B008AOHG1Y", "B00EXN4GK0", "B006K556TY", "B004CXBJ6A", "B000JFHELE", "B00FJISZ28", "B003NSBKSM", "B003YKG2XM", "B00426DND4", "B004PNZFZ8", "B001DERZK0", "B005LTWXK0", "B000WAHFBK", "B005N8W27I", "B00FKXZE5I", "B000XPG2QI", "B000O8ENQK", "B006K55716", "B000JFJDAE", "B009ZNFEEU", "B00ELAM8NC", "B00591GIMY", "B006K556FI", "B00EXN5X3E", "B00FJISZFK", "B0007XGOTG", "B002OOWBWK", "B00G4V0QSK", "B00FIAYE40", "B00C1DULJE", "B003R0FJKG", "B00573S3RC", "B008G80FIU", "B003YKG2XW", "B006Y3IDX8", "B0042BXSMU", "B00ELAM8LE", "B00101XVH2"], "buy_after_viewing": ["B00D77KEEK", "B004PNZFZ8", "B006Y3IDX8", "B0019RBJOE"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]]}