{"asin": "B000088KH9", "description": "Tenchu: Wrath of Heavenis the third in the successful mission-based stealth series that first appeared on the PlayStation in 1998; few changes have been made to the basic format. Players can once again choose to be either Rikimaru, the silent sword-wielding assassin, or Ayama, the acrobatic younger ninja. Both characters pass through the same game world, but each has slightly different goals that take them on different routes. A third character can be unlocked later on.During the first mission, you're required to choose a number of weapons to aid you in your immediate tasks. Throughout the game, more and more weapons--from melee to ranged weapons--are added to your arsenal depending on your performance during each level; your chosen weapons dictate how you approach the mission goals. The silent approach is always encouraged, and there's a variety of graphically satisfying stealth kills that will only work if you remain elusive and strike unexpectedly and silently.Aside from the stealth kills, the game is a mixed bag in terms of its graphics. Light shimmers off your sword menacingly, but the environments are bland and repetitive, and the game fails to maximize on differences between light and dark areas in ways that might have added to the experience. Also, the stealth dynamic is made less challenging by the shortsightedness and slow reactions of the enemy guards and the iffy AI. Since guards give up searching for you within seconds and are unable to follow you through doors, this potentially atmospheric and tactical stealth game is actually just a hack-and-slash arcade romp. Multiplayer options are included, though, so if you feel the need for a more realistic opponent, you may want to call a friend.Tenchu: Wrath of Heavenis still an enjoyable experience despite its flaws. It&#x92;s just a shame that, after doing so much to establish and define the stealth-game genre, it fails to raise the bar or introduce any novel elements. The game feels more like an update of the first Tenchu, and while this is no bad thing, fans will probably be expecting more.--Chris Ryan, Amazon.co.uk", "price": 49.99, "imUrl": "http://ecx.images-amazon.com/images/I/516GXW2N27L._SY300_.jpg", "related": {"also_bought": ["B0007GDMFC", "B00004R8XR", "B00000I1BG", "B000066TS3", "B00006LEMX", "B00004U5VK", "B000NNFJQY", "B00004YRQA", "B00005BW7Q", "B000063RRN", "B000CQ75VY", "B00019HNNM", "B00026HZ1O", "B0009RG8DW", "B0007PLKZM", "B0002CHJ8C", "B00002STKS", "B0002ZHDCG", "B0002XL3BA", "B000E49SGE", "B0015MMN6G", "B00024W1U6", "B0000A09EM", "B0009XBWY6", "B001MW91IW", "B000056PJQ", "9629971372", "B0002B90OE", "B000B69E9G", "B00005J536", "B000935256", "B000G6SPHI", "B000TLU67W", "B0002CHIUQ", "B0009I6S0O", "B00000K2X5", "B0009O7HVW", "B000KCX9M4", "B0001ADAME", "B0002RQ3ES", "B0000A8VBZ", "B00004YRQ9", "B000IONGU4", "B0001NBNHU", "B00009XO59", "B0000TSR7Y", "B0009A4EV2", "B00015MFYI", "B00KVVO63U", "B00005MDZD", "B000WE8JES", "B00005ML10", "B00008XKZZ", "B0000TSRA6", "B000038AAP", "B00009MVJ7", "B0007XTNFS", "B0001VGFK2", "B000G7X5P4", "B00005NCCR", "B00009YEK1", "B000066JRQ", "B0000A03AG", "B001HTFQ0C", "B0007SL1ZI", "B000095ZH6", "B000F5IH2I", "B000FIVC2W", "B00005B70K", "B000FG65EE", "B00009KO3L", "B00006LELI", "B000A0EFJM", "B000BXKA38", "B00005ME6N", "B001J2SEXS", "B0000296O5", "B00009ZVHY", "B00005BIG7", "B0000664JF", "B00004TN1Z", "B00005ML0X", "B0000657SP", "B00005UNWC", "B0009HAYDC", "B000059Z8I", "B0002A6CPA", "B0009VQANG", "B00020BV2E", "B001CLG6SG", "B00005V9NH", "B00006LELA", "B0009PETYO", "B00J6DLPLK", "B00007KQC1", "B0045L3SNQ", "B00009KO3J", "B001383L36", "B00005TNI6", "B00005ME6O"], "buy_after_viewing": ["B00000I1BG", "B0007GDMFC", "B000NNFJQY", "B00006LEMX"]}, "salesRank": {"Video Games": 3578}, "categories": [["Video Games", "More Systems", "PlayStation 2"]]}