{"asin": "B0002XN3VS", "description": "Portable, reusable storage device.  The ultimate mobile storage solution for people on the go. Working on a presentation and need to take it with you? Want to share a new song, pictures, or video with your friends?  Simply copy the file onto your USB flash drive and take it with you. Easily transfer data, music and images from computer to computer.  Its ultra-compact design makes it easy to carry in your pocket, backpack or briefcase and you're good to go.  Integrated cap holder on the back prevents lost caps.  To access your data, simply plug into virtually any PC or MAC -- without the need for bulky cables or adapters. Access your files. Anytime. Anywhere.Also available in 2GB*, 4GB*, 8GB* and 16GB*.  All PNY USB drives come with free technical support and a 1-year warranty.Store, transport and share all your favorite documents, photos, music, videos and more.Access your data anytime, anywhere by simply plugging into virtually any PC or MAC.1GB Attach&eacute; USB 2.0 Flash DriveStore and share music, pictures and videos.Transfer data from computer to computer.Carry in your pocket, backpack or briefcase.Multiple Uses for Attach&eacute; USB Flash DrivesUse one for work, one for school and one for personal files, pictures, songs and videos.  Attach&eacute; flash drives allow you to store and carry all your business presentations, homework and personal documents.  Share your favorite songs with your friends, bring your favorite movie to watch on your laptop while on a business trip, share vacation pictures with co-workers and friends.Performance and CompatibilityHigh Performance USB 2.0 Flash Drive.  Compatible with most PC/MAC laptop and desktop computers with available USB 2.0 port (Backwards compatible to USB 1.0).What&rsquo;s in the Box1GB Attach&eacute; USB 2.0 Flash Drive, Insert card with Operating Considerations and Precautions.* Please note: For Flash Media Devices, 1 megabyte = 1 million bytes; 1 gigabyte = 1 billion bytes. Actual usable capacity may vary. Some of the listed capacity is used for formatting and other functions, and thus is not available for data storage.** 1X = 150KB/second*** Number of photos may vary by camera setting and camera manufacturer.**** Actual number of songs may vary based on file format, compression settings, and song length.", "title": "PNY P-FD1GBATT2-FS 1GB Attache USB 2.0 Flash Drive", "imUrl": "http://ecx.images-amazon.com/images/I/31JWFYeedhL._SY300_.jpg", "related": {"also_viewed": ["B003S6AXVO", "B003SGQQQU", "B00DYQYITG"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "USB Flash Drives"]]}