{"asin": "B000YDIYFG", "description": "BOOM BLOX, is the first game developed in collaboration between two giants of multimedia entertainment, Electronic Arts and director/producer, Steven Spielberg. Spielberg is obviously a master storyteller and so knows a thing or two about blockbusters, but he also no stranger to the gaming world. A long-time gamer himself, he conceived the original idea behind Lucas Art?s PC/Mac titleThe Dig, but busting theseBLOXis an entirely new concept.Fast &amp; wacky fun on your WiiEnjoy some crazy characters.View larger.Get to stackin' in 5 unique worlds.View larger.Create one-of-a-kind levels.View larger.Levels and Levels of FunA Puzzle/Action game inspired by Spielberg's own search for a game that he would enjoy playing with his own kids,BOOM BLOXis designed specifically with the strengths and versatility of the Wii in mind. In it players can look forward to a fast-paced gameplay blending the simplicity of the wildly popular block gameJengaand the crazy complexity of a Rube Goldberg machine--devices that although performing very simple tasks are designed to do it by the most complicated means possible.BOOM BLOXfeatures over three hundred levels, a variety of activities, a cast of over thirty wacky characters, and an easy-to-use in-game editor that allows players to express their creativity. It?s visceral gameplay is perfectly suited for the Wii?s interactivity. The action gets going fast and the fun never ends as you throw baseballs, blast lasers, save wacky animal characters, explore cool worlds and more!... making it the ultimate Wii blox-buster for 2008.Features:Throw, grab, and blast your way through 300+ levels- Use fun action gestures and crazy virtual tools (like bowling balls, baseballs and fire hoses) to destroy your way through over 300 brain-twisting challenges.Fast-paced Multiplayer Action- Fun for kids and the entire family,BOOM BLOXoffers action-packed interactive activities that takes Wii play to a new level of creativity and fun with single player, co-op, and versus gameplay. Up to 4 players at once.Over 30 Wacky Characters set in 5 Unique Worlds- Tackle the action and interact with entertaining characters such as the Blox-laying chickens or the baseball throwing monkeys, who bring personality to the Tiki, Medieval, Frontier, and Haunted themed environments.Make It Your Own/Share? Unlock characters, worlds, blox, and props throughout the game and use to build whatever you can imagine in Create Mode. You can virtually build anything you can dream up. Remix any level and share what you create with friends via WiiConnect24TM.Endless Play and Replay CombinationsBuilt upon a full real-time physics model, each player'sBOOM BLOXexperience can be as easy or difficult as you want it to be. Additionally, players can remix any level of the game in Create Mode using props, blocks, or characters that have been unlocked during the game. Players can also virtually build anything they can dream up. This makes for nearly endless play and replay options in what promises to be the latest must-have Wii title for the entire family.", "price": 60.96, "imUrl": "http://ecx.images-amazon.com/images/I/5120wA4BGBL._SY300_.jpg", "related": {"also_bought": ["B001TERJD2", "B000P297ES", "B000JV78XC", "B000NKRJAG", "B00149IL9I", "B000GEDN5E", "B003S2SQCQ", "B003ZCH7DI", "B000FQ9YB0", "B001TOMQVM", "B002FG9MWE", "B0017WHQ34", "B002EE7OKE", "B0050SVFB0", "B006L1FAK2", "B004CUOD70", "B002BRZ9G0", "B001KRPU4S", "B000OAO188", "B003JD7QYI", "B001GIUWX0", "B000GHLBUA", "B0039QWK0A", "B000FQBWAG", "B001DO3NEW", "B000SQ5LPU", "B001C58T46", "B0036KRP6S", "B000R3BNHE", "B002BS47L2", "B003ZHMMEM", "B0058CA4S8", "B008171AZ8", "B002I0IIPY", "B00166PY5I", "B005EIIBKY", "B0019R2QSM", "B004WLRR4K", "B001DTVKF6", "B0094X28J0", "B000LSJKAM", "B000ZKNAFW", "B004FEI752", "B000QD7BBM", "B002I0GEXM", "B005FYJA52", "B000QJLQCQ", "B0013E9HP6", "B000GUQJQ8", "B0013EF17O", "B000KUHR8S", "B0009VXBAQ", "B0056C2LIG", "B003O6DZSQ", "B0094X1ZXU", "B004C34D2M", "B000ZK6946", "B004W1IX1G", "B000UUWHS8", "B002BSA388", "B000SFK0LG", "B0094X20IO", "B002GEKIOG", "B001TOQ8K2", "B003M986XE", "B000FQ9QVI", "B003M31RN6", "B001CM0PR8", "B001B1W3HA", "B00273ZAH6", "B000SFK0SO", "B001FEO74U", "B001U2BMF4", "B002JCMYWY", "B0050SVGXM", "B009Q5XGO2", "B004EDJNU2"], "bought_together": ["B001TERJD2"], "buy_after_viewing": ["B001TERJD2", "B003ZCH7DI", "B002BSA388", "B002EE7OKE"]}, "salesRank": {"Video Games": 4805}, "categories": [["Video Games", "Kids & Family", "Wii", "Games"], ["Video Games", "Wii", "Games"]]}