{"asin": "B001XURPQI", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]], "description": "Canon&rsquo;s new EOS Rebel T1i is packed with features, both refined and new. In addition to its admirable performance with an all-new 15.1 Megapixel Canon CMOS sensor, DIGIC 4 Image Processor, a 3.0-inch Clear View LCD with anti-reflective and scratch resistant coating, and compatibility with the EOS System of lenses and Speedlites, the EOS Rebel T1i adds remarkable Full HD video capture at resolutions up to 1920 x 1080.An HDMI port allows for quick connections to high definition TVs and monitors for easy viewing of your stills and video. The entire operation is simple and easy even if you are a beginner. You&rsquo;ll have uncompromised EOS Digital performance with power and flexibility right in the palm of your hand.EOS Rebel T1i HighlightsNew 15.1-megapixel CMOS sensor with DIGIC 4 Image ProcessorCanon&rsquo;s CMOS (complementary metal oxide semiconductor) sensor captures images with exceptional clarity and tonal range and offers the most pixels in its class. It offers many of the same new technologies as used by Canon&rsquo;s professional cameras to maximize each pixel&rsquo;s light gathering efficiency. Its APS-C size sensor creates an effective 1.6x field of view (compared to 35mm format). Canon&rsquo;s DIGIC 4 Image Processor dramatically speeds up all camera operations for intuitive operation and offers improvements in both fine detail and natural color reproduction. It works in concert with the EOS Rebel T1i&rsquo;s image sensor to achieve unprecedented levels of performance in all lighting situations.14-bit A/D ConversionWith the EOS Rebel T1i, analog to digital signal conversion is executed by a 14-bit processor, which generates digital data with incredibly smooth tones. A feature that originally appeared in top-of-the-line pro digital SLR cameras, the 14-bit conversion gives incredibly smooth transitions from light to dark colors with far less risk of \"banding.\" A sky at sunset is a perfect example. With this rich 14-bit gradation, the EOS Rebel T1i offers RAW images of the highest quality that can be processed with Canon&rsquo;s Digital Photo Professional software. Even JPEG files, which are always finished at 8-bits per channel, use the full 14-bit conversion initially to generate the best possible color and tonal detail.Full HD video capture at 1920 x 1080 resolutionThe EOS Rebel T1i shoots brilliant video, even in full high definition. By simply selecting Movie mode on the EOS Rebel T1i&rsquo;s mode dial, the camera&rsquo;s 3.0-inch LCD lights up, and it's ready to go. Shooting is at a frame rate of 30 fps when shooting SD or HD quality video (640 x 480 and 1280 x 720 pixels, respectively) and at a frame rate of 20 fps in Full HD (1920 x 1080 pixels) recording. Sound is recorded through the camera&rsquo;s built-in microphone. Playback modes are simple to access, and all Live View AF features can be used in shooting video.Live View Function for stills and videoWith Live View Function on the EOS Rebel T1i, you can enjoy nearly every camera function available in normal shooting, all with the convenience of composing on the camera&rsquo;s brilliant 3.0-inch LCD monitor. You can zoom in and navigate the composition and there&rsquo;s even a grid overlay for architectural shots. Live View focusing modes include Quick mode, Live mode and Face Detection AF mode and these are easily selectable through the convenient Live View Function menu.Wide range ISO setting 100-3200The EOS Rebel T1i features a greatly expanded ISO range that makes shooting possible in situations previously impossible without flash. With an expanded setting to ISO 3200 (ISO expansion: 6400, 12800), along with the DIGIC 4 Image Processor&rsquo;s improved noise-reduction technology, your creative possibilities are nearly endless. Combine the EOS Rebel T1i with one of Canon&rsquo;s EF/EF-S lenses with Optical Image Stabilizer and watch your shooting possibilities expand even further.3.0-inch Clear View LCD (920,000 dots/VGA) monitorThe EOS Rebel T1i has a 3.0-inch high resolution LCD monitor that features 920,000 dots/VGA for far more detail than previous Rebel-series LCDs. It&rsquo;s the same screen found on professional models such as the EOS 5D Mark II. A number of features enhance usability: an anti-reflective and water-repellant coating provides a clearer and more smudge-resistant surface and screen brightness can be adjusted in 7 steps in accordance with ambient light.Auto Lighting Optimizer for superior highlight-shadow controlThe EOS Rebel T1i&rsquo;s Auto Lighting Optimizer is yet another image-quality tool that comes to the rescue in tricky lighting conditions. It can actually lighten dark areas of a scene while ensuring that bright areas maintain tonal detail. It&rsquo;s available in all shooting modes, including P, Tv, Av and Manual.Creative Auto goes a step beyond auto allowing controlEspecially for beginners looking to expand their photographic horizons, the EOS Rebel T1i offers Creative Auto mode. While basic settings are based on full automatic operation, shooting guides on the LCD screen enable you to make corrections based on simple to follow guidelines. In essence, with Creative Auto mode, you can learn about photography while taking stunning photographs.Compatible with over 60 Canon EF/EF-S lenses and most EOS System accessoriesEOS Rebel T1i is compatible with all Canon lenses in the EF and EF-S lineup, ranging from ultra-wide angle to super telephoto lenses. Canon lenses employ advanced optical expertise and micron-precision engineering to deliver unprecedented performance in all facets of the photographic process. Special optical technologies, such as Aspherical, ultra-low dispersion, or fluorite elements are featured in the universally acclaimed L-series lenses, and Canon&rsquo;s Optical Image Stabilizer technology is featured in select lenses, including the EF-S 18-55mm IS lens bundled with the EOS Rebel T1i, to minimize the effect of camera shake. With Canon lenses, you can truly maximize the quality and performance of the EOS camera.Flash PhotographyThe EOS Rebel T1i features Canon&rsquo;s acclaimed E-TTL II flash metering system. With any EX-series Speedlite, E-TTL II provides reliable flash output whether shooting fill-in flash pictures in sunlight or using flash in total darkness. With E-TTL II, the exact same 35-zone metering sensor used for measuring ambient light is also used for flash metering--giving even finer metering command of the image area. If you prefer a broader area for flash metering, there&rsquo;s a menu setting to change to \"Average\" flash metering--where the entire 35-zone area is measured evenly for flash exposure.T1i DSLR with optional SpeedliteSoftwareCanon EOS Digital Solution Disk (Version 20)The EOS Rebel T1i comes bundled with a Canon EOS Digital Solution Disk, which features powerful software programs designed to extend the EOS experience to the computer. These include Canon's EOS Utility (Version 2.6), Digital Photo Professional (Version 3.6), ZoomBrowser EX for Windows (Version 6.3), ImageBrowser for Macintosh OS X (Version 6.3), the Picture Style Editor (Version 1.5), PhotoStitch (version 3.2), WFT Utility (version 3.3). Each application is designed to perfect the captured images and streamline the digital workflow.Compatible Operating SystemWindows: Windows XP SP2 or SP3/ Windows Vista (all version except the Starter Edition)Macintosh: OS X 10.4 to 10.5EOS Utility (Version 2.6)for Macintosh or Windows handles the connection between the camera and computer, whenever they&rsquo;re connected via USB. It allows remote controlled shooting from the computer, handles downloading of images from the camera to the computer, and allows seamless linking to either Canon&rsquo;s ZoomBrowser EX/ImageBrowser or Digital Photo Professional software once images have been copied to the hard drive. Furthermore, it&rsquo;s used to upload settings back into a USB-connected camera.Digital Photo Professional (Version 3.6)is an image processing program that enables high-speed RAW image processing, high-speed previewing for real-time image adjustment and support for sRGB, Adobe RGB and Wide Gamut RGB color spaces. Because it&rsquo;s CMS (Color Management System) compatible, Digital Photo Professional allows for easy image layout and printing in Adobe RGB in conjunction with Easy-PhotoPrint and PictBridge printers. It also features the Dust Delete Data Detection tool for cleaner images.Picture Style Editor (Version 1.5)enables you to create custom Picture Style profiles that can be used to customize the appearance of JPEG and RAW images captured with EOS Digital SLR cameras. Picture Style files created with Picture Style Editor can be loaded into the EOS cameras that support Picture Style and may also be used when processing RAW images in Canon software applications Digital Photo Professional, ZoomBrowser EX (for Windows) and ImageBrowser (for Mac).ZoomBrowser EX (Version 6.3)for Windows and ImageBrowser (Version 6.3) for Mac OS X are the easy, user-friendly options for viewing and editing of JPEG and even RAW image files. Both allow viewing of numerous types of images including finished TIFF and BMP files. Both also have a variety of search options for finding images, allow re-naming of single images or batches of files, and offer a variety of options for printing without using a separate image-editing program.", "title": "Canon EOS Rebel T1i 15.1 MP CMOS Digital SLR Camera with 3-Inch LCD (Body Only)", "price": 599.0, "salesRank": {"Camera &amp; Photo": 1730}, "imUrl": "http://ecx.images-amazon.com/images/I/51hQYoHCkfL._SX300_.jpg", "related": {"also_bought": ["B003XMROKG", "B001B11GTQ", "B009F6X31S", "B00007E7JU", "B000V5K3FG", "B0023VWZ5C", "0470533897", "B004KUCHT8", "B0098KG91C", "B0015GADB4", "B0013UTW0U", "B0015WJTTK", "B000V9D5LG", "B003CQD10K", "B00006I53S", "B00AI07F1Y", "B005VALUGW", "B000237C9M", "B0011NVMO8", "B00543FWDI", "B008BYW04G", "B003CQB02Q", "B00358P4QO", "B002CXLQLA", "B00A47U22U", "B001M4XCHQ", "B00004THD0", "B003VNKNF0", "B0002Y5WXO", "B00005K47X", "B002CEVN7Q", "B00199R2WK", "B004W63XHU", "B000ALLMI8", "B006K5EWRQ", "B0019RGQVU", "B003Y60DZO", "B004WB8EYM", "B00009XVCU", "B000KNCB7C", "B003HMM240", "B003VNKNEQ", "B00006I53V", "B001KN74RI", "0470521287", "B002W4RPD2", "B005LW580O", "B00AO7DC9K", "B00E3K94T6", "B0053V5MF4", "B003EB0AXY", "B0080JH3YE", "B00004ZCJI", "B004RCNJ9Q", "B005QR59IA", "B00009XVCZ", "B0041PMD0A", "B002K40R6G"], "buy_after_viewing": ["B003VNKNF0", "B005LW580O", "B001B11GTQ", "B00007E7JU"]}}