{"asin": "B005CPGHAA", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Mice"]], "description": "Not only comfortable in use, Cobra goes further than the competition to offer additional value. With unquestioned ergonomic control and balance, the gaming community has welcomed the E-BLUE brand for everything they've done well and continue to explore. 4 Levels of DPI selection from a mouse that breaks the $20 price barrier, the Cobra is in a class of its own. An intelligent design features each primary button in the ideal location for the best. Everything is intuitive and the combination of the micro switch and special (extended) design of the clicking surface, you'll get the job done more swiftly than you have ever been able to before!For multi-purpose applications, including graphic design, animation or audio production, as well as standard web browsing, the Forward and Backward keys are totally useful. The designers of the Cobra from E-BLUE created a new surface coating material, which resists UV damage far better than mice than are not equipped. A specialized USB (another thing brought to us by engineers behind this mouse) allows for a secure connection, ensuring data transmission is never interrupted.Last but not least, especially when it comes to gaming mouse acceleration, the Optical Sensor featured in the Cobra is achieves a maximum of 16 G thanks to the AVAGO 5050 high gaming chipset. Cobra offers the best in ultra-high sensitivity, the result of which is precision tracking. Going the extra steps to bring you the best accuracy and performance, the Cobra mouse has built-in counterweights. The physical \"feel\" of the mouse is built for gamers who seek the ultimate control.Cobra offers the scaly skin (UV protection) and toughest, most-agile performance. There are no other comparable products available with such keen balance between price, features and aesthetic appeal!", "title": "E-3lue Cobra EMS109BK High Precision Gaming Mouse with Side Control 1600dpi", "price": 11.47, "imUrl": "http://ecx.images-amazon.com/images/I/41kTjw5EX%2BL._SY300_.jpg", "brand": "E-BLUE", "related": {"also_bought": ["B00D60ZI0S", "B009K7QB8O", "B000UEZ36W", "B00006HTZ0", "B00DU2CHE2", "B008CXTX7S", "B002VKMO0G", "B003ELVLKU", "B00ASPNYDM", "B00FWK8UWI", "B00I0S6SK0", "B00BBUCCKO", "B00BBSLITC", "B000UEZ37G", "B00F3L19KQ", "B001B077PO", "B00AJN9MAC", "B0076O7W04", "B00IWOMV62", "B005EOWBHC", "B000OGX5AM", "B0075W8DG4", "B005T3GRNW", "B006CSKLO4", "B00GLDVSNI", "B004QRKWLA", "B001FBHT34", "B00IAM78WS", "B005BZNDOO", "B0058DBSMI", "B003UE52ME", "B002ZV51DI", "B0033Z2BAQ", "B00004ZAGC", "B00KDCOL4G", "B00E88ZGNG", "B00000JRRD", "B0095P5K8I", "B005EJH6RW", "B000BSHGXA", "B004351H9G", "B00IDG3IDO", "B00CBQO930", "B005HJMQIS", "B00DJ3DWFK", "B00EUAFAF6", "B004FEXUP4", "B002LB42NM", "B00162KUII", "B0075CJ5ZW", "B005BZNEVQ", "B0088PUEPK", "B005O65JXI", "B002WLHPNK", "B00BFOEY4I", "B009O7YORK", "B005C31HC0", "B008XQEQT4", "B003L1ZYYM", "B0092ML1SC", "B004RFGALC", "B006KZ4IKW", "B003YVJJ5Y", "B00C3LVYEU", "B00DGOIO3W", "B00G505M4S", "B00BWF5U0M", "B00J8E93G6", "B006HXUXRY", "B009FC3YJ8", "B0015PWOK8", "B00HJOKCZI", "B004GZ0PGY", "B0046Y5Z5G", "B009O7YU56", "B004N8ZQKY", "B00D7BYMB2", "B001MSS6CS", "B00FTDIMSK", "B00H33SFJU", "B004HFKZAY", "B00IKF2H12", "B00DGHKK7M", "B0057Q4ADU", "B0079T2KHG", "B0027VT6V4", "B003VAHYQY", "B00H43HP7W", "B009O412AU", "B006I2H0YS", "B00HGLX8J6", "B0095VPBFY", "B00ALK3KEM", "B00E3W15P0", "B001TH7GUU", "B003EM8008", "B002ZIN9DU", "B00A14ZTWE", "B005WUUFBW", "B00B0TXEEY"], "bought_together": ["B000UEZ36W"], "buy_after_viewing": ["B00F3L19KQ", "B00E290JRE", "B00IAM78WS", "B005EJH6RW"]}}