{"asin": "B001D9IWIY", "description": "Manufacturer's Description -- August 18, 2008 Toshiba's new xDE (Extended Detail Enhancement) DVD player aims to save your DVD collection. First, the xD-E500 converts your standard DVDs from 480p to full 1080p resolution.&nbsp; But that is not all... oh no, that is not all. xDE uses a chipset with parameters specially developed for Toshiba and a combination of user-controlled picture improvement techniques including upconversion, edge enhancement, and color remapping to deliver a new level of near HD video quality from Standard DVDs.Full 1080p UpconversionVideo upconversion from 480p standard DVD resolution up to 1080p full HD resolution via HDMI takes your current DVDs to a new level, for an amazing viewing experience on today's HDTVs.Sharp ModeSharp Mode provides edge enhancement. By naturally enhancing the edge of a picture, the outline and detail of that picture becomes clearer and more detailed.Detail Enhancement improves the edge detail where necessary in the picture without added video noise. xDE technology can adaptively control each edge signal in a picture. If an edge signal is high, picture noise is created, on the other hand, when an original edge level is low, xDE technology adaptively enhances edge &amp; noise level, as needed&nbsp; Added noise reduction technology increases the effect of edge enhancement. The result is a sharper, more detailed image.", "title": "Toshiba XD-E500 Upconverting 1080p Extended Detail DVD Player", "price": 64.55, "imUrl": "http://ecx.images-amazon.com/images/I/31MnBZrP81L._SX300_.jpg", "related": {"also_viewed": ["B007F9XHAY", "B007F9XHBI", "B0039XRUBM", "B007BYLO4E", "B00A71YOQI", "B003EX0BVS", "B0087FQPP4", "B004LNMAAA", "B004CYWVAM", "B00FW7ATEI", "B008MWLHX2", "B003V8SPQE", "B0038JECKO", "B003ANVQWU", "B00817UWQ6", "B007S71NZO", "B006KIYHVY", "B004K1EOCA", "B008MWLHY6", "B0076R7FFI", "B003E4M4WQ", "B002CO6GUK", "B004BI6MVS", "B00AYB3OMG", "B00BFRKYVM", "B00269YAAO", "B009YWN926", "B000F2P0ZS", "B004G8HXXO", "B00C8SHXKW", "B0045PKK60", "B001IBHUU8", "B00B9JR5H2", "B003JN3ITA"], "buy_after_viewing": ["B007F9XHAY", "B007F9XHAY", "B007F9XHBI", "B00AWKC0JM", "B007S71NZO"]}, "categories": [["Electronics", "Television & Video", "DVD Players & Recorders", "DVD Players"]]}