{"asin": "B0010WG2H2", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Hubs"]], "description": "From the ManufacturerFree your phone service with ooma!ooma is the breakthrough device that frees your phone service. Acclaimed by The New York Times, The Wall Street Journal, USA Today, and Business Week, and featured as one of the year's hottest gadgets in Parade and In Style magazines, ooma offers the premiere home phone experience. Your one-time purchase of an award-winning ooma Hub device partners with your high-speed Internet and your home phones to deliver:Unlimited calling to any number in the USAll the features you've come to depend on, like caller-ID, call-waiting, and voicemailThe reliability and crisp acoustic performance of a landlineAccess to your voicemail from any phoneThe freedom to hear your voicemail and manage account preferences in the LoungeThe option to create voicemail notifications to email and mobile phoneLow-cost international rates starting at a penny per minuteEasy setup to get you up and dialing in no timeA 30-day money-back guarantee and an extendable one-year warrantyThe flexibility to keep your phone number or choose a new one anywhere in the USA 60-day free trial of ooma Premier (a $12.95 per month value)!Winner of the Hardware Innovator of the Year Award, 2007 Digital Life conferenceFeaturesSmart and stylish, ooma devices partner with your high-speed Internet and your home phones to free your phone service. Your one-time purchase eliminates monthly bills for US calling.You'll also get bundled features at no extra charge. Want more? Test drive our enhanced calling features with your 60-day free trial of ooma Premier! Click below to find out how ooma can enrich your home phone experience, while saving you serious cash each and every month.Images show the ooma Scout.Click hereto learn more about the Scout.Unlimited US CallingYour one-time purchase of an award-winning ooma Hub device frees your phone service. Call anyone, at any number, anywhere in the US without charge. Think how much you pay the phone company each year. Now imagine what you could do with all the money you save!Set-up is Easyooma has been designed with the customer in mind for an intuitive out-of-box experience. Most customers are up in dialing in about 20 minutes. If you&rsquo;ve got any questions, our online support site is loaded with dozens of articles, diagrams, tips, and facts. Something we didn&rsquo;t cover? No problem. Check out our lively customer forum or call a member of our support team.Bundled Featuresooma gives you all the calling features you&rsquo;ve come to depend on, including caller-ID, call-waiting, and voicemail. Only ooma takes them to a higher level.Online ooma LoungeThe ooma Lounge is your online destination for the ooma service. You can listen to messages, manage your account preferences, prepay for international minutes, even set up voicemail notifications to email and mobile devices, 24 hours a day.We&rsquo;ve got your numberWant to keep your phone number? ooma will move your number from your current phone provider for a one-time fee. Want something new? You can also choose a number in any calling area in the US without charge!Flexibility to keep a landlineooma gives you the flexibility to integrate a low-cost landline as a backup. This means you can keep your current phone number and enjoy the assurance of traditional 911 service and seamless coverage during Internet and power outages.Discover ooma Premier with your 60-day free trialooma Premier features include:Message screeningTired of scrambling to the phone only to hear another recorded message from an aging-celebrity-turned-political fundraiser? ooma stops telemarketers in their tracks. With ooma Premier, you can screen incoming messages just like you did with a traditional answering machine. And if it's an important call, you can pick up from the moment the phone rings through the end of an incoming call.Send to VoicemailReady to quit playing receptionist for your way-too-popular kids? When you subscribe to ooma Premier, you can select custom ring patterns for each of your personal numbers so you'll know which calls are for you.Three-way conferencingNeed to make dinner plans with two of your friends? We've got you covered. ooma makes three-way calling simple! Once you're on a call, press the second line button to make or take a second call. Press down both line buttons at once, and you've got yourself a conference call!Private VoicemailWant privacy from snooping family? With ooma Premier, you can assign personal numbers to ring on your very own ooma device. What's more, you'll get a password-protected voicemail account to hear your messages online. You can also set up personal voicemail greetings, customize privacy settings, and create instant voicemail notifications to email.Instant Second LineDo your kids have the gift of gab? No problem! When you sign up for ooma Premier, you&rsquo;ll get an Instant Second Line&trade; feature, which lets you make or take two simultaneous calls without the cost or hassle of installing a second line. So when your daughter's chatting with her BFF (i.e., best friend forever), simply pick up another phone and you&rsquo;ll get a fresh ooma dialtone.Do Not DisturbNeed a little peace and quiet? Simply press the envelope icon for two seconds and all your calls will roll into voicemail without ringing. You'll still see a blinking light when new messages come in. To deactivate Do Not Disturb, hold down the envelope icon for two more seconds.Personal numbers and voicemailooma makes it easy to add phone numbers for your home office and all the members of your family. Choose up to nine numbers anywhere in the US! Decide whether you want your numbers to ring and leave voicemail on all phones or just your personal ooma device.Ring patternsIsn't it time to quit playing receptionist for your way-too-popular kids? When you subscribe to ooma Premier, you can select custom ring patterns for each of your personal numbers so you'll know which calls are for you.How Do We Compare?Other phone companies nickel and dime you for local toll calls and long-distance, layering on mysterious fees, taxes, and surcharges for stuff you don&rsquo;t need. They bill you extra each month for caller-ID, call-waiting, and voicemail; features we, at ooma, believe are fundamental to your US calling rights.Your one-time purchase of an award-winning ooma Hub device frees your phone service. You'll get the voice quality and ease of a traditional landline. That's because we&rsquo;ve architected the ooma system to partner with your home phones and high-speed Internet to deliver state-of-the-art calling without monthly bills.There are no special handsets. No tricky calling codes to enter. No need to log onto a computer. Just pick up a phone and dial. It&rsquo;s that easy.And for those who demand more, you'll get a 60-day free trial of ooma Premier, so you can test-drive all of ooma&rsquo;s innovative features, like personal phone numbers and private voicemail for each member of your home, with lots more on the way.So if monthly bills are weighing you down, the answer is simple. Break free with ooma.", "title": "ooma Hub - VoIP Phone Device with No Monthly Phone Service Bills", "price": 344.99, "salesRank": {"Electronics": 70978}, "imUrl": "http://ecx.images-amazon.com/images/I/41CCqJg0UeL._SX300_.jpg", "related": {"also_viewed": ["B002O3W4LE", "B00I4XMEYA", "B00A14ZUGE", "B00A35WSEI", "B0010W84A0", "B001C1MGKI", "B0033AIW7M", "B00EDZK4TK", "B0086OGA0Q", "B00E5GDLLA", "B004LO098O", "B004NBZB2E", "B005TF1G86", "B00IZ77F2G", "B0045HE5DM", "B007D930YO", "B0045S2JE8", "B0045RMEPI", "B00BUV7C9A", "B00E1U2UBC", "B002O3W4LO", "B0062P7ISY", "B007P8I3K4", "B007P8I3L8", "B0061R1XI4", "B0011UXSHK", "B00D30Y9CE", "B00DVWWV0Q", "B0041ORNJ2", "B000GKD150", "B00JS8R332", "B003OB3ANQ", "B007R6F7PS", "B007EYY3XU", "B000HCX7UG", "B003B42ZBE", "B007PEIHKE", "B00B5HLP9C", "B001GDI8XQ", "B00DVWYRCQ", "B008VM7QWE", "B008MHTVXA", "B005H3WCFG", "B00AJHDZSI", "B004XC6GJ0", "B0036D9YKU", "B008MHQCA0", "B00013BO8I", "B0063K4NN6", "B009ZQFAWS", "B0036R9Z96", "B004JO4G5S", "B000FKP55K", "B00684PN54", "B004N4Q486", "B004N4Q44K", "B0073W71ZA"], "buy_after_viewing": ["B002O3W4LE", "B00I4XMEYA", "B00A14ZUGE", "B00A35WSEI"]}}