{"asin": "B006NNWZSI", "related": {"also_bought": ["B00HVT27OA", "B0081U0628", "B004YIFKRM", "B00433SNSQ", "B005YQY5TM", "B009O0FH6Y", "B00HC75GJE", "B002CVTTYI", "B004U7HY8U", "B005DSPLDA", "B003WU6KFO", "B005DSPLCQ", "B00E0E2DIE", "B00E055H5O", "B002M1DEM6", "B001GT4AA0", "B00920ZCDO", "B002VPE1QG", "B005QXX0MG", "B00DBV28TG", "B004NY9UXM", "B0038MWWBW", "B009OZUPUC", "B003NR57BY", "B004SBBD8U", "B006JRIDHK", "B00BQ8RM1A", "B000A6PPOK", "B00GTGETFG", "B005C31HC0", "B000H92ZLG", "B007T1CTDE", "B000J2EN4S", "B002J9HBSE", "B00EAS8KSW", "B0041Q38QM", "B000UEZ37G", "B00E83X9P8"], "bought_together": ["B003NR57BY"], "buy_after_viewing": ["B004YIFKRM", "B00EEBS9O0", "B006UUF27U", "B002J9HBSE"]}, "title": "Targus Legend IQ Backpack Fits up to 16-Inch Laptop, Black (TSB705US)", "price": 36.05, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/51Lnm3DuMmL._SY300_.jpg", "brand": "Targus", "categories": [["Electronics", "Computers & Accessories", "Laptop & Netbook Computer Accessories", "Bags & Cases", "Backpacks"]], "description": "Targus Legend IQ 16\" BackpackTargus Legend IQ 16\" BackpackRoom to Fit AllDesigned to fit up to 16-inch laptops comfortably, the Targus Legend IQ Backpack is the perfect fit for the on-the-go techie, who prefers to be on the cutting-edge of trends. Featuring multiple compartments for ample storage, this rugged backpack gives you room for all the things you need to tote    around&mdash;be it cross-campus, cross-town or cross-country.Well-designed ProtectionWhether it is with laptops, tablets, MP3 players,or digital cameras, your life is jam-packed with technology. The task of finding a spot for everything can be strenuous. Fortunately, your digital life can rest easy inside the Targus Legend IQ Backpack.  Not only does this backpack come with a large padded pocket to fit most laptops up to 16&rdquo;, but it also includes a separate tablet pocket with soft lining to keep your tablet protected from bumps and scratches. For added convenience, this backpack has a large compartment to store books, binders, documents and more.tablet pocketsoft lininglarge compartmentInstant TunesLike to carry your tunes wherever you go?No problem! The Targus Legend IQ Backpack comes with a smart little feature that lets you enjoy your music without those messy cords getting in the way. Inside the Legend IQ Backpack is a special media pocket with a built-in cord that covertly connects your media player to the headphone jack located on the shoulder strap. While your media player is tucked safely inside the backpack, you can still access your music by simply plugging your ear buds into the easily accessible headphone jack on the shoulder strap.  No cords, no fuss!media pocketbuilt-in cordheadphone jack locatedon the shoulder strapAccessory PackedQuick access compartments provide storage for all of the items that you may need at the ready, like your business cards, cell phone, memory cards or pens.  Plus, the handy key loop keeps your keys organized and easy to find.  There is also an extra zippered compartment on the front of the backpack for your wallet and a soft-lined pocket for glasses.To keep your extra essentials organized this stylish backpack has two large self-closing side pockets for items such as water bottles, cameras or other accessories.  And the zippered closure provides you with the extra peace of mind that your items won&rsquo;t accidently fall out.compartments provide storagehandy key loopextra zippered compartmentCarry ComfortablyThe back panel includes special details such as a mesh fabric which provides air ventilation for a cooler journey, a heavily cushioned back panel and two adjustable shoulder straps that provide extra comfort and ergonomic support.  Plus the Legend IQ backpack comes with the Targus Limited Lifetime Warranty, which provides you with the assurance that we will repair or replace your backpack should anything go wrong with its structure.cushioned back paneladjustable shoulder strapslimited lifetime warranty"}