{"asin": "B000UXZUZC", "description": "Maximize the power and potential of your home network with the HP EX470 MediaSmart Server, which enables you to conveniently centralize your files and access them from multiple PCs in your home. Based on AMD Live processing power, the MediaSmart Server enables you to back up your home's PCs as well as share and enjoy digital music, home videos and photos from any computer or entertainment system on a home network. The server also has the expandability to grow with your family's changing needs.The stylish HP MediaSmart Server easily fits into your living room or office decor.Its small size will fit on top of even the most crowded desk, and it offers wireless access when connected to a Wi-Fi router (via the Gigabit Ethernet port).This sleek, streamlined micro-tower design is perfect for use in the home office or the living room, and its perforated steel exterior panels provide cool, quiet operation. The EX470 MediaSmart Server features a 500 GB internal hard drive (SATA, 7200 RPM), 512 MB of installed DDR2 RAM, four hard drive bays for additional expansion using off-the-shelf SATA I or II hard drives, a Gigabit Ethernet port for ultra-fast networking (and connection to a wireless router), four USB 2.0 ports (1 on the front, 3 on the back) for connecting to additional hard drives, and an and an eSATA port for high-speed data transfer to external storage devices--up to 6 times faster than existing solutions.It's quick and easy to set up your HP MediaSmart Server and create up to 10 user accounts using the Microsoft Windows Home Server software. You can also open a predefined Guest account for additional file sharing capabilities. The HP MediaSmart Server also lets you set up your own secure personal web address to allow file access by remote users.Easily Enhance Your NetworkExpand your storage possibilities with the MediaServer's four hard drive bays.Every PC on your network will have the Control Center software, giving users the ability to browse shared folders on the HP MediaSmart Server, add photos to the HP Photo Webshare and perform an immediate backup of their computer. Set the access privileges for each user at the shared-folder level to allow Read/Write, Read Only or No Access. You also control the remote access privilege for each user. Approved users will then be able to remotely access shared files and even applications on their home PC through a secure connection from any Internet-connected PC.AMD LIVE Smarter Digital EntertainmentShare Your MediaUse included HP Photo Webshare software to easily and securely share photos stored on your HP MediaSmart Server with select friends and family. A quick link to Snapfish allows easy photo printing. Enjoy digital music, photos, video and files from any networked PC. Stream content directly to your home entertainment center using a digital media adapter (DMA). The DMA device accesses the media files and coordinates the streaming process between the HP MediaSmart Server and your entertainment device.Protect Your DataKeep your PC files safe with automatic backup for multiple PCs. You can customize the frequency of backups and how many backups are stored. Files accidentally deleted can be easily found on the backup image and copied to your PC. In the event of hard drive failure, the included HP PC Restore disc is all you need to return your PC and all your data to their original condition.Other FeaturesCentralize your iTunes music libraries and playlists on the server for playback to any PC or notebook running iTunes on your home network.Incremental backups: After initial backup, only changes are backed up.Efficient single copy backup: A single copy of each file is backed up, no matter how many computers that files resides on in your home network.Add an internal or external hard drive to the HP MediaSmart Server, indicate that you want to add the disk in the Windows Home Server Console, and the HP MediaSmart Server storage grows. No need to power down the unit or manage drive letters for multiple hard drives.Remote access compatibility: Microsoft Windows XP Professional, Media Center Edition 2004 or higher, or Windows Vista Ultimate or higherFile sharing compatibility: Microsoft Windows Vista, Windows XP Home or Windows XP Professional, Windows 2000 Professional SP4, Mac, OS X, Linux.Backup compatibility: Microsoft Windows Vista, Windows XPWhat's in the BoxHP MediaSmart Server, power cord, Ethernet cable, software installation disc, PC restore disc, server recovery disc, Quick Start and HP support guides.Important:The HP MediaSmart Server is not a stand-alone computer. You connect it to your networked computer system. No monitor is needed because its user interface is accessed from another computer.", "title": "HP EX470 MediaSmart Home Server (AMD Live, Windows Home Server, 500 GB Hard Drive)", "price": 65.94, "imUrl": "http://ecx.images-amazon.com/images/I/51yjoKfxx2L._SY300_.jpg", "related": {"also_viewed": ["B0050TVAWS", "B005KKJPCO", "B00GAIBC0I", "B00AKWUZ58", "B00307EL8M", "B009XOVKEY", "B00FE29IWK", "B00F6EK9J2", "B007JLDTRY", "B00DDXS936", "B00GJYNLKM", "B00G4JZ2T0", "B001AHLODY", "B00G4JZ42A", "B00G2HOP0G", "B00FJF4PK2", "B00BNI4EL4", "B00D02ASI4", "B004UBU3SY", "B00G4JZ30S", "B00FJF4S22", "B00CO0DDZS", "B00I2P82CS", "B00AMAJGOO", "B0048TWIX6", "B00CRB9CK4", "B007JLE84C", "B006C6E318", "B00I2P53NY", "B0047FL85U", "B00DDXS8C8", "B00FE2G79C", "B008DWAGPG", "B00IU0R23K", "B008NGL7JQ", "B005INAKGI", "B00DR7END8", "B00HK74G0G", "B00HK74G2Y", "B004I6IXC4", "B00BNI4CVG", "B00I2P56FE", "B00I2P57TO", "B007KWLXRK", "B00K6PCTCG", "B005EJLFNI", "B00G4CIPHS", "B00CO0DE0W", "B00EVVGAFI", "B00EVVGAD0", "B00G2HZNXO"], "buy_after_viewing": ["B0050TVAWS", "B00APP6694", "B003XIJ3MW", "B008JJLXO6"]}, "categories": [["Electronics", "Computers & Accessories", "Servers"]]}