{"asin": "B0011UK2HE", "description": "Pure music, pure control. Compatible with the iPhone and most iPods, Kensington's LiquidAUX delivers pure sound from any direct auxiliary connection.The steering wheel-mounted remote control means you have full control of your music--and your vehicle. The dock connector not only allows full access to your music library, but it simultaneously charges your device.The LiquidAUX is Apple-certified to Work with iPhone 1G and 3G and be Made for iPod.Installs InstantlySimply plug your iPhone or iPod into the car kit using a 3.5-mm audio cable, and then insert the kit into your auxiliary port. Within seconds, digital-quality sound will be pumping through your car's audio system.Fingertip ControlThe steering wheel-mounted remote control is designed to be mounted with the controls on the interior of your steering wheel. The remote conveniently lets you play, pause, and skip music files with just your thumb, allowing you to keep your hands on the wheel.CompatibilityKensington's LiquidAUX Auxiliary Car Kit is compatible with the iPhone (1G and 3G); iPod nano (1G, 2G, and 3G); all iPods (1G through 6G); and iPod touch. Note: An auxiliary port in your car is required for the LiquidAUX.The LiquidAUX is Apple-certified to Work with iPhone 3G.SupportBacked by Kensington's two-year warranty, the LiquidAUX also comes with free technical support.Important Note: Sound EffectsWhen using an auxiliary device in the car, you might hear a slight buzzing sound, engine noise, or high-pitched whine. That is because your car model has a grounding issue between the audio system and the power socket, which causes a whining or buzzing sound when you drive. This sound is not caused by your Kensington product; however, Kensington has an easy solution. Simply purchase an automotiveground loop isolatorfor your car that is compatible with a 3.5-mm jack. This simple tool will enable you to use your music in a safe, hands-free environment.Kensington can provide you with a ground loop isolator free of charge by calling Kensington's Technical Support team at 1-800-535-4242. Please provide the serial number of your LiquidAUX product when you call Technical Support, and the company will arrange to ship you the ground loop isolator.What's in the BoxLiquidAUX Auxiliary Car Kit, remote control, and 4-foot audio extension cable.", "title": "Kensington LiquidAUX Auxiliary Car Kit with Remote for iPod; iPhone 1G, 3G", "price": 13.63, "imUrl": "http://ecx.images-amazon.com/images/I/416XYoxsauL._SY300_.jpg", "related": {"also_viewed": ["B001EAQTRI", "B0031U1ATQ", "B0031U1AU0", "B000WKW6HS", "B003SX0O34", "B008XMV05G", "B000P5URM6", "B004CLYJ2I", "B001OI2VG8", "B009NLTW60", "B003TFDUJQ", "B004HJ35F2", "B00GJFGE3W", "B001L10OF8", "B002E9HHY2", "B001JL5WA2", "B00AOCSFYC", "B00CFS68M4", "B00727FE5U", "B00499DZJG", "B001QFXDA2", "B004KPLS7K", "B00490OVM0", "B008MF3Y2G", "B006FFCONA", "B008AGQMQC", "B00CAYAIL0", "B00824948U", "B000LP4RMG", "B0056399MG", "B007IXPJDA", "B009L55I2K", "B005LUKCX4", "B00GX71GNO", "B002IY598O", "B00GRVIXC8", "B003N3G7PS", "B003DPPYKK", "B0031U1ATG", "B00511PS3C", "B0038MA11U", "B0047T79VS", "B00IL7BWGA", "B009OBCAW2", "B004ZF39T0", "B00D901B4W", "B00B1HVI4I", "B007FHX9OK", "B004G1L52Q"], "buy_after_viewing": ["B001EAQTRI", "B009NLTW60", "B0031U1ATQ", "B0031U1AU0"]}, "categories": [["Electronics", "Car & Vehicle Electronics", "Vehicle Electronics Accessories", "Audio & Video Accessories", "Audio Car Mounts"]]}