{"asin": "B002R0JJYO", "categories": [["Electronics", "Computers & Accessories", "Monitors"]], "description": "Key Features:23-Inch 16:9 widescreen IPS LCD monitor for photographers, designers, CAD/CAM engineers, and medical applicationsIPS panel delivers superior image quality, accurate colors and high contrast ratio even at super wide viewing angles of 178&deg;Eco mode saves up to 40% energy while helping reduce your energy billSlim Bezel designed for multi-monitor applications4-port USB hub for easy connectivity of USB devices such as digital cameras, USB flash drives and mice100mmx100mm VESA compliant for 3rd party wall mount or monitor standsDVI and VGA inputs for diverse inputsHighest grade panel with the best pixel performance policy in the industryWhat is an IPS Panel?IPS (in-plane switching) technology is the highest performance panel technology available in the LCD displays. The specifications and details of IPS panel technology are considered best for high accuracy in color, contrast and wide viewing angles. IPS panels offer excellent picture reproduction and suitable for photography, graphics design, movie production, CAD/CAM engineering, medical and security applications. Illustrations below represent how an image on your screen will look even at extreme viewing angles of up to 178&deg;. With IPS panels, you will not have any color shifts or changes in the contrast ratio when you move the image across the screen or change your viewing angle.", "title": "ViewSonic VP2365WB 23-Inch IPS LCD Monitor", "price": 329.0, "salesRank": {"Computers & Accessories": 8120}, "imUrl": "http://ecx.images-amazon.com/images/I/31PBWS%2BQ%2BUL.jpg", "related": {"also_viewed": ["B0053YKE72", "B008RM235I", "B005LN1JEC", "B008DWITHI", "B00535CD5C", "B009F1HUMQ", "B003Y3BJ7S", "B008CJ1UV4", "B008DWH00K", "B004LXK8LI", "B008RM23ZI", "B005JN9310", "B0039648BO", "B00EZSUVHK", "B00B1IAL7W", "B00906HNZU", "B009H0XQRS", "B00906GBBC", "B00D601UC8", "B008CJ1UQY", "B005S0XYKK", "B009H0XQQY", "B006DDGIWM", "B009V8F700", "B003D1ADUU", "B00BN2BIUK", "B005NM8PB6", "B00EMB4L0I", "B00IEZGYI0", "B0088PU6GC", "B00HPR7JAU", "B008U06TZW", "B008A3KFB8", "B00302DNZ4", "B00EZSUWFG", "B00FUTDRWY", "B0013CD0DI", "B00GWFNMGG", "B00CMHQOJU", "B00AZMLIDQ", "B00D78QCYK", "B00ASHTZYM", "B00F0834T6", "B00FLTTLU0", "B009H0XQPA", "B005O9RPQE", "B00AWM12H6", "B005KYTPDO", "B00EMB4KVS", "B005F0IJR6", "B00EZSUVHU", "B00B2HH7G0", "B008RM1YQW", "B0058UUR6E", "B00EMB4KVI", "B00GBG5SPO", "B005BZNDOO", "B00BJ744F0"], "buy_after_viewing": ["B0053YKE72", "B008RM235I", "B005LN1JEC", "B005JN9310"]}}