{"asin": "B006UMM2BW", "related": {"also_bought": ["B007Q5JMQA", "B007S9U4OS", "128508456X", "B005WXQO3W", "B006ZCCH76", "B00AUIX8SI", "1907708871", "B006ZABR3S", "B006UN0SM6", "B0095MFAFO", "B0078IBO20", "B0083FILBY", "B0086KY61K", "B003VNKNF0", "B007Q1RBBC", "B006UMRL4U", "B00CV9MK4W", "B008NHTLKC", "B0066WEGEC", "B009Y929XE", "B007QY8PI2", "B006ZNBILG", "B007X5AGXG", "B000KZ7YDG", "B000050M6M", "B00DWIAVWY", "B00AUXK3TA", "B008WNN3I8", "B008RE66WW", "B00DUGZEWK", "B000KZD73W", "B007M54E1M", "B007WMNYY8", "B00AAGBJGI", "B007TS8XCI", "B00DVPG9JW", "B00009V4G9", "B004Q3C98S", "B0000BZL68", "B0064Q4GEA", "B00ANPCPSM", "B00IPQT6ZG", "B0065MMKTG", "B005Y1SYDU", "B004OR14HI", "B00IGHG774", "B0064T1D3O", "B0083WGXTO", "B00I58M1VK", "B004M8SWBK", "B008RE6AHI", "B00H4W2YDI", "B00IGHG5IU", "B005OATTV2", "B005NIXY52", "B007UN3L3I", "B004XIB9T6", "B00AY2PTKA", "B007Z5XMO4", "B0065MMK8W", "B007W4VJG6", "B009B0MY6S", "B00576ANLS", "B00BC80QEE", "B00CV9M5CY", "B005WXI3H2", "B00HK8ZBE0", "B00004ZCJI", "B008RE664A", "B0037FLUYU", "B00EZAYD4A", "B0039BPG1A", "B007UN382M", "B000H02B6O", "B007NDL54C", "B002KF0LGG", "B00EFILHB4", "1935763083", "B0098QHS7U", "B00HYAL84G", "B000067O7N", "B0070WU51U", "B00012FVYW", "B00C3C0SKK", "B007NDL56A", "B007HPOFIY", "B00007LA0T", "B007BJHETS", "B009CK43BQ", "B004OR14GY", "B007FH1KX2", "B0044BYKI4", "B00009R6K7", "B00DVNNFSM"], "bought_together": ["B003VNKNF0"], "buy_after_viewing": ["B00EFILHB4", "B003VNKNF0", "B00I58M1VK", "B006ZCCH76"]}, "title": "Canon PowerShot G1 X 14.3 MP CMOS Digital Camera", "price": 549.0, "salesRank": {"Camera &amp; Photo": 2563}, "imUrl": "http://ecx.images-amazon.com/images/I/41-rjg5GYbL._SX300_.jpg", "brand": "Canon", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The Pinnacle of PowerShotBright, fast and more creative than ever: advanced technologies come together for an exciting new camera that moves beyond anything the G-Series has seen before. The PowerShot G1 X digital camera will inspire advanced amateurs who have embraced the G-Series to explore new realms of photographic expression, and give pros an excellent camera that complements their creative demands.The new 1.5-inch High-Sensitivity CMOS sensor approaches DSLR size, with a light-sensitive area that&rsquo;s approximately 6.3 times larger than that of the PowerShot G12 digital camera. The new 14.3 Megapixel sensor, combined with a new lens and DIGIC 5 Image Processor, creates the HS SYSTEM that delivers image quality previously impossible in a compact camera, with beautiful blur, lower noise, and extraordinary resolution in low-light shooting and can shoot at ISOs of up to 12800. The PowerShot G1 X also has 14-bit RAW capabilities for even greater creative control and Full HD Video recording. Manual settings and operability inherited from EOS cameras impart a high-level shooting experience, and open the door to new creative possibilities. Substantive luxury defines the design: a neatly clarified sculpture with a firm grip, huge Vari-angle LCD and optical viewfinder.Canon DIGIC 5 Image ProcessorThe latest-generation Canon DIGIC 5 Image Processor brings phenomenal increases in processing speed and power. Improved chip architecture and algorithms deliver greatly expanded functionality with further refinement in image quality. Improved noise reduction produces clearer images when shooting in low light at high ISO speeds. Enhanced i-Contrast performance adjusts differences between light and dark areas to achieve even more natural-looking results. The faster processing speed also results in faster continuous shooting capability. The DIGIC 5 Image Processor also makes possible a new, highly advanced automatic white balance system. Whereas conventional white balance makes an overall adjustment based on a single type of light source, the new Canon Multi-Area White Balance analyzes several areas of the image to determine whether different adjustments are needed, for example, for the main subject and the background.Canon 1.5-inch, 14.3 Megapixel High-Sensitivity CMOS SensorCanon engineers developed a sensor for PowerShot G1 X digital camera that is nearly the size of an EOS DSLR camera&rsquo;s APS-C sized sensor, and built with a similar pixel structure&mdash;each pixel site is larger, allowing more light to be captured&mdash;giving the PowerShot G1 X a completely different level of image quality than compact cameras that have come before it. At 1.5 inches, the sensor is approximately 6.3 times larger than that of the PowerShot G12 digital camera. This heightened degree of sensitivity, along with 14.3 Megapixels, delivers several distinct advantages. Noise is dramatically reduced at high ISO speeds for clear low-light and nighttime shooting. Resolution at low ISO speeds is incredibly rich and precise. And, most atypically for a compact camera, the PowerShot G1 X digital camera allows you to create the intensely beautiful background blur that is the hallmark of DSLR cameras.&nbsp;Canon HS SYSTEMThe Canon HS SYSTEM lets you take bright, clear photos in an even wider range of shooting situations.Beautiful low-light shots are possible with minimal noise and maximum detail in highlight and shadow areas. The system is the result of two technologies brought together in PowerShot cameras: a high-sensitivity imaging sensor, which is able to capture more light; and the DIGIC Image Processor, which actively reduces noise with high-speed image processing. The 14.3 Megapixel Canon CMOS sensor in the PowerShot G1 X incorporates advanced light reception technology that enhances sensitivity. The new DIGIC 5 Image Processor provides a major boost in noise reduction, expanding the usable range to an amazingly high ISO 12800. The HS SYSTEM thus lets you use higher shutter speeds to capture clearer images with reduced noise and blur.Shooting and Recording Modes Including 14-bit RAW + JPEGThe PowerShot G1 X offers a host of shooting and recording modes ranging from fully automatic to fully manual, plus Full HD movies and full-resolution High-Speed Burst HQ at a maximum of 6 frames*. The camera recognizes 32 shooting situations, automatically optimizing settings for achieving the highest quality shots on the go. Alternatively, you can exert complete creative control over the look and feel of your images. 14-bit signal processing, just as in EOS series cameras, gives images notably rich detail and smooth gradation. Compared with 12-bit processing, 14-bit offers a 4x increase in RAW data, makes a visible impact, giving images rich detail in both highlights and shadows as well as smoother, more natural tonal gradation for outstanding image quality.*Continuous shooting speed is 4.5 fps.Canon Full HD Video Advantage&#x2028;In addition to the HS SYSTEM, the combination of the advanced CMOS sensor and DIGIC 5 Image Processor in the PowerShot G1 X digital camera makes it possible to shoot crisp, clear high definition video. Imagine the fun and excitement of being able to shoot spectacular 1080p Full HD video with stereo sound that you can later watch on your HDTV or download to your computer to share with family and friends. In addition to being able to shoot Full HD 1080p video at 24* frames per second, the PowerShot G1 X digital camera can also shoot 720p HD video at 30** frames per second.*Actual frame rate is 23.976 fps.**Actual frame rate is 29.97 fps.Dedicated Movie Button, Wind filter feature and Optical Zoom for easy video captureIt&rsquo;s never been easier to shoot videos with a PowerShot digital camera. The PowerShot G1 X has a dedicated moviebutton that lets you start and stop recording instantly. There is no need to go through layers of menus or operate switches or dials to switch to and from video recording mode. The camera is always ready to shoot stills or video whenever you want. The PowerShot G1 X also incorporates an electronic wind filter, which suppresses wind noise that can muffle or distort the sound. And unlike less sophisticated point-and-shoot cameras, the PowerShot G1 X lets you use the full range of optical zoom when you&rsquo;re shooting a video.HDTV Playback via HDMI with CEC SupportIt&rsquo;s easy to enjoy and share the videos you shoot with the PowerShot G1 X. Simply connect its HDMI terminal to your HDTV using an HDMI cable. And because the PowerShot G1 X supports HDMI-CEC technology, you&rsquo;ll be able to control the playback of your images and videos on any CEC-enabled HDTV using the TV&rsquo;s remote control. (CEC &ndash; Consumer Electronic Control &ndash; is part of the HDMI specification, enabling components in a system to communicate with one another.)"}