{"asin": "B000E39V9O", "description": "Make Skype Calls From a Regular TelephoneEnhance your Skype Internet Telephone Service with the DPH-50U Skype USB Phone Adapter. The Skype certified DPH-50U allows you to use your existing corded or cordless telephone to take advantage of Skype&#x92;s low cost calling features. Utilizing your existing telephone enables you to use your telephone&#x92;s built-in features such as speed dial, redial, mute and caller ID*. Using a cordless phone even unties you from your computer while making Skype calls. Best of all, there is no additional equipment to buy to start using the DPH-50U.Receive/Make Both Regular and Skype CallsThe DPH-50U allows you to accept both regular telephone and Skype calls from the same phone giving you added flexibility. When you are talking to someone on your regular telephone line and receive an incoming Skype call, you can easily switch lines to take the Skype call or vice versa, just like a regular call-waiting feature. You can also do a conference call between regular telephone and Skype lines. For added convenience, the DPH-50U includes helpful LEDs to indicate whether you are receiving a regular telephone or Skype call.Remote Calling FeaturesThe DPH-50U can be configured to forward incoming Skype calls to another destination such as your cell phone so that you never miss a call while you are away. The DPH-50U also includes a toll bypass feature that is ideal for the following two scenarios:The first scenario is when you are in the same geographical area as the DPH-50U and want to make an international call. You can call from your cell phone to the computer that the DPH-50U is connected to and make a low cost SkypeOut** international call.The other scenario is when you are traveling abroad and want to call someone who lives in your home area. You would simply make a Skype-to-Skype call to the computer where the DPH-50U is connected to and use your regular telephone line to make a local call.Easy to Install & UseThe DPH-50U includes two RJ-11 ports and a USB port to conveniently connect your regular phone line, telephone and computer, respectively. Since the DPH-50U receives power from the computer through the USB cable, it does not require a power adapter. The included software installs in minutes and allows you to easily and completely manage your Skype contact list and calling features. The DPH-50U is PC compatible.The DPH-50U Skype USB Phone Adapter combines the best of both worlds by allowing you to use all the great features of your existing telephone with the low cost advantages of the Skype Internet Telephone Service.*Your phone must be equipped with these features and/or may require additional service contract with your telephone service provider.**Applicable to service fees from Skype.", "title": "D-Link Skype USB Phone Adapter", "price": 54.99, "imUrl": "http://ecx.images-amazon.com/images/I/41TrX0YwiDL._SX300_.jpg", "related": {"also_viewed": ["B0060I17XA", "B005H3WCFG", "B007TH0X7C", "B004LO098O", "B000GKD150", "B000B8Y5PC", "B000HCX7UG", "B000JCU88S", "B000EW4XRA", "B003X0BK9O", "B004OA74MY", "B004BU8O9Y", "B00158UZTW", "B007D930YO", "B0007QOK9Y", "B000M51AYS", "B000BD88RS", "B001492T5U", "B000ND75FW", "B0026XTI0C", "B008X0N0H4", "B009669YMO", "B0091DR3O8", "B000YQ49H0", "B0045RMEPI", "B0041ORNJ2", "B002V45UEE", "B000IKGSRQ", "B000AMLTSU", "B004QBAAAY", "B008MHQCA0", "B0071NK10I", "B000HS2TSG", "B000F4Y6GK", "B00COXCMUC", "B00DP4YOJ6", "B000CRUZ2O", "B007EYY3XU", "B004FPS2KQ", "B00684PN54", "B000ELUXRK", "B008RZV2G6", "B00A14ZUGE", "B002C42PSW", "B000BVZ3BO", "B002O3W4LE", "B000HWZSV2"], "buy_after_viewing": ["B0060I17XA", "B005H3WCFG", "B007TH0X7C", "B004LO098O"]}, "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Network Adapters", "USB Network Adapters"]]}