{"asin": "B000BI2CIO", "categories": [["Electronics", "Home Audio", "Multiroom Digital Music Systems"]], "description": "Listen to your music anywhere in your home! It's never been easier to stream audio files wirelessly from your computer or laptop to your home stereo system. It's as simple as plug and play. Just plug the wireless transmitter into your PC, plug the music receiver into your stereo system, and press Play on the remote control. It's your music - anywhere!Easy to Set up:PlugPlug the USB music transmitter into a USB port on your PC.PlugPlug the music receiver to your stereo system.PlayFrom your PC, open your favorite playlist and press \"Play.\"EnjoySit back, relax and enjoy.Easy to control:Enjoy your digital music--in uncompromising digital audio quality--anywhere in your home. The Wireless Music System for PC works with your existing PC media player--and with any type of music: downloads, subscription services, and even Internet radio. It connects to any type of speaker system, whether it's your home stereo system or powered multimedia speakers, and everything youneed comes in the box!USB music transmitter(Shown with included desktop stand) Plugs directly into your computer.Music ReceiverConnects to either your home stereo or powered multimedia speakers.  Includes standard RCA and stereo-mini (3.5mm) jacks.Remote controlControl your music from your listening room.FeaturesEasy to set up.Everything you need is in the box.Use it with your existing media player software.No need to switch players!Listen to whatever you want.Supports all music formats, including purchased downloads, subscription services and Internet radio.Connect it to any type of speaker system.Use it with your home stereo or powered multimedia speakers.Enjoy and control music anywhere in your house.Wireless range extends up to 330 feet!Expand your system to multiple rooms.Music receivers for additional speaker systems are available.System RequirementsPC:Windows XP or Windows 2000 (SP3 or later)Available USB portSpeakers:Any home stereo system with stereo RCA input jacks, ORAny powered multimedia speaker system with a stereo-mini input jackRemote Control:Track control buttons work with any media player that supports multimedia keyboard commands, including (but not limited to):Windows Media Player 9 (and higher)Musicmatch 9.0 (and higher)iTunes 4 (and higher)RealPlayer 10 (and higher)WinAmp 5 (and higher)Package ContentsUSB music transmitter for PC (with desktop stand)Music receiver for stereo system (with AC adapter)Remote controlStereo RCA interconnect cablesSoftware CDQuick-start guide2-year limited warranty", "title": "Logitech Wireless Music System for PC", "price": 49.99, "salesRank": {"Electronics": 81542}, "imUrl": "http://ecx.images-amazon.com/images/I/417Q7G5JHEL._SY300_.jpg", "related": {"also_viewed": ["B002BDU95A", "B004VM1T5S", "B007RFMRBG", "B000E5E6KG", "B0000AJ3MM", "B00BBAXVJK", "B000QW9DPU", "B000HNJ96Q", "B001CROHX6", "B0013IWYHU", "B00011Y1MQ", "B000X1TS54", "B00K6KYC2Q", "B00I0Z427E", "B00LA6T0LS", "B00IQBSW28", "B007RFLJ92", "B003IR7GP4", "B00713RSE0", "B001VNBI2E", "B000GHWQ86", "B00IYUI0W8", "B009OBCAW2", "B002LARRDK", "B0047T79VS", "B00GIXRKEM", "B0036VO2B8", "B003FVAQM8", "B00E3FHXYO", "B00FB1NTP6", "B00395ZQMK", "B000VZL9C2", "B0084M8C8S", "B00HR4XSPQ", "B00E953OJQ", "B003N6SBFE", "B003FBQKZ0", "B008ALA2RC", "B00B9B4IYI", "B004YI9NTS", "B00GMFYM8I", "B000WMDFQ2", "B005N6ICXS", "B0085HOM4K", "B002LARRDA", "B00AG6NSNO", "B004K1EO7U", "B004K6LETQ", "B00DQUNODQ", "B001GXQOUU", "B004UR486G", "B00JCE14AU", "B006OT2WFM", "B00ISIFX0S"], "buy_after_viewing": ["B002BDU95A", "B004VM1T5S", "B00DR0PDNE", "B009OBCAW2"]}}