{"asin": "B00GV4UHDO", "description": "Households with multiple tablets and smartphones inevitably have chargers lying all over the house, which makes finding a place to charge your mobile devices inconvenient to say the least! The PowerShare Reactor eliminates such hassle by allowing you to charge up to four (4) devices all in one easy and convenient location. With one (1) 2.1Amp and three (3) 1.0Amp USB charging ports, the Reactor is always ready to charge your devices at maximum speed. Saving outlet space and featuring an attractive desktop or countertop design, you won't have to waste anymore time waiting for one device to charge in order to charge another, or aimlessly look for where you put that charger in your house. The PowerShare Reactor features surge-protection, making sure that your precious mobile devices are safe. The high-grade silicone tower is highly fashionable and is specially coated to limit dust collection. PowerShare Reactor is lightweight and portable, making it a great travel companion. Take it from the home or office on the road with you. Just remove the power hub from the silicone tower, wrap the power cable around the hub, stow and go. Or, you can tuck the power cord up into the bottom slot of the PowerShare for easy storage and toss PowerShare in your carry on bag or luggage.", "title": "CHIL PowerShare Reactor 5.1 Amp Multi-Device Home Charging Station - Teal (0212-4924)", "price": 44.99, "imUrl": "http://ecx.images-amazon.com/images/I/41vZv9fXqPL._SX300_.jpg", "related": {"also_viewed": ["B00GMVP6R8", "B00L9KKRCG", "B00ES4XFV0", "B00BHHBV5I", "B009CFMO0S", "B00HTQHENY", "B00DQKQ7U8", "B00FDLHY8M", "B003P2UMR6", "B008EH7F8Q", "B00858A3J2", "B00ES4XFX8", "B0091UBWQ6", "B00D63QAGG", "B003SVNK0U", "B009DCNP9O", "B004BFZ46K", "B00G7520WI", "B00DR1084C", "B002HEMXI4", "B00GYII81A", "B009SEHC8C", "B001FB6TUI", "B002MAEGYW", "B002MA9BKQ", "B00748X51M", "B002R5AMKO", "B00603S1SY", "B00BE6AAIQ", "B00AYACCAC", "B008EH7F8G", "B007WTHGL8", "B00M1XCV4W", "B008FERI4E", "B00EQMPZJO", "B00DVH62J2", "B0013G4KSS", "B00C59SN80", "B00H4PDH4U", "B0092HOHU6", "B009S4FLGW", "B00FFJDA12", "B0083BXPWS", "B00J9OH75Y", "B005F0MA9O", "B00797A7NW", "B008435JMO", "B00152OB4I", "B00GGKHN30", "B0052DHEIG", "B00CE6V4CG", "B005KSVU8S", "B0049K3VHG", "B00797A5GQ"], "buy_after_viewing": ["B00IBDOB5I", "B00GTGETFG", "B00GMVP6R8", "B00DVH62J2"]}, "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Chargers & Adapters"]]}