{"asin": "B002FQM5B4", "description": "The Logitech Wireless Drum Controller lets you unleash your inner rockstar. Fully adjustable drum heads and cymbals can be positioned to fit your reach and suit your style, helping you play faster and better. The quiet, responsive drum heads have a lively feel, won't distract you from the music, and are designed to let you take advantage of all the latest features of Guitar Hero--in the game and in the Music Studio. (Games sold separately.) You get a 2.4 GHz wireless USB receiver for PLAYSTATION3 and PlayStation2. Either way, setup is a cinch, and the connection is as steady as a drum beat. The controller sets up quickly and folds flat in seconds--open the box and start playing within minutes, and when the show is over, the set stows away easily.Unleash your inner rockstar. Play on drums or expand to a band.Used to be that the lead guitar got all the fame and attention. That's about to change. It's time for the drummer to step out of the shadows.There's a whole band on stage. And anyone who really knows music knows that the drummer is the backbone.Tap your foot to mark time with the bass. Keep the backbeat with the snare. Color up your riff with the tom toms. Crash down on the cymbals to release your Star Power. Then revel in the glory of a tune well played. You've earned it.So whether you're going for career gold as a drummer, or just want to mix it up, when it's your turn to grab the sticks, it's you and your Logitech Wireless Drum Controller. Because you're not playing, you're unleashing your inner rockstar.Key FeaturesFully adjustableThe drum controller was designed to be comfortable. Drum heads and cymbals can be positioned to fit your reach and suit your style, helping you play faster and better.Quiet, responsive controlsThe drum heads have a lively feel and barely make a sound. You'll hear more music and less controller.The hottest hardwareRock out on all the features of Guitar Hero&mdash;in the game and in the Music Studio. (Game sold separately.)&nbsp;PLAYSTATION 3 and PlayStation2 compatibilityYou get a 2.4 GHz wireless USB receiver for PLAYSTATION3 and PlayStation2. Either way, setup is a cinch, and the connection is as steady as a drum beat.&nbsp;Sets up quickly, folds flat in secondsJust open the box and start playing within minutes. And when the show is over, the set stows away easily. Roadies not required&nbsp;Hundreds of hours of battery lifeTwo AA batteries give you enough juice to perform a festival's worth of hits, encores included. The beat goes on, and on, and on...Suggested games for the Logitech Wireless Drum Controller for PLAYSTATION3 and Playstation2:Guitar Hero World TourGuitar Hero MetallicaGuitar Hero Smash HitsGuitar Hero 5Band HeroWhat's in the BoxPackage ContentsLogitech Wireless Drum ControllerWireless USB receiver for PLAYSTATION3 and PlayStation22 drum sticksQuick-start guide2 AA batteries1-year limited hardware warrantyGame sold separatelySystem RequirementsPLAYSTATION3 computer entertainment systemPlayStation2 computer entertainment system", "price": 11.99, "imUrl": "http://ecx.images-amazon.com/images/I/41YJAFpmp-L._SY300_.jpg", "related": {"also_viewed": ["B001NJL6QE", "B002EE0NB6", "B001Q9VSE6", "B0040795IC", "B000TT0KQ6", "B00381BKIY", "B001E2UGVQ", "B000TSX3TS", "B000TG92YK", "B0029Y058W", "B003RS8I92", "B001BXAC6W", "B002FQM5OG", "B0028ZNXE0", "B003N5VW1A", "B003RS1A7Y", "B000TTITLO", "B0042B3EOM", "B003N5ZYOG", "B004075HA2", "B0088MVQIM", "B000TSX3UC", "B002A9JH8U", "B001ABLHIC", "B002IT35Z8", "B001TOMR0M", "B000TSZADA", "B007T9NAHA", "B003N5VVDY", "B001ABN85C", "B002EE6T1E", "B001ABK1LQ", "B001BXACDA", "B001BX6MPM", "B001CS7MGO"], "buy_after_viewing": ["B001TOMR0M", "B002EE0NB6", "B001NJL6QE", "B0046MIL6S"]}, "salesRank": {"Video Games": 46123}, "categories": [["Video Games", "More Systems", "PlayStation 2", "Hardware", "Accessories"], ["Video Games", "PlayStation 3", "Accessories", "Controllers", "Drums"]]}