{"asin": "B0023ZK2TY", "categories": [["Electronics", "Camera & Photo"]], "description": "From the ManufacturerThe Fat Gecko suction cup mount allows users to secure cameras to motorcycles, cars, trucks, airplanes, or any other smooth, flat, non porous surface. The blend of rugged design and ease of use makes Delkin's Fat Gecko camera mount optimal for use in a multitude of situations. Fat Gecko's suction cups are so strong they can hold a eight pound camera and the double knuckle design and 2-inch extension tube allow for 360-degree tilt, 360-degree turn, and 360-degree rotation for all the best filming angles in any activity. The 1/4 x 20-inch tripod mounting screw means users can use virtually any digital still or video camera on the market. In addition, the suction cups use a quick release function to make attaching and detaching you camera easy and fast.With four adjustable joints and an optional extender bar, it's easy to set up shots over a windshield, around an instrument panel, on top of handlebars, or anywhere else that a standard tripod or camera mount wouldn't normally hold up - this is one extreme mount for extreme conditions.Fat Gecko Suction Mount FeaturesWorks With All CamerasThe 1/4 x 20-inch tripod mounting screw means you can use virtually any digital still or video camera on the market.Rugged Construction Durable For YearsSteel frame construction is rugged and durable in design and construction, this steel mount can withstand the most extreme turbulence.Expandable Mounting OptionsLoosen the top-most clamp to remove the standard 1/4 x 20-inch photo mounting screw and the Fat Gecko can adapt to mount an array of other devices, including GPS systems, aircraft antennas and more.Double Knuckle DesignAllows for 360-degree tilt, 360-degree turn, and 360-degree rotation for all the best filming angles in any activity - whether the mount is attached to an airplane canopy above your head or the side of your Ducati.Dual Suction CupsSecure cameras to any smooth surface including; motorcycles, cars, airplanes,and more. Fat Gecko's suction cups are so strong they can safely and securely hold a camera weighing up to eight pounds. With Fat Gecko you can use heavier, more advanced video cameras to provide the best footage possible.", "title": "Fat Gecko Camera and Camcorder Mount", "price": 56.7, "imUrl": "http://ecx.images-amazon.com/images/I/41Xdv1BosHL._SY300_.jpg", "brand": "Delkin", "related": {"also_bought": ["B00420ZC66", "B002RCLYXG", "B0061LLUHO", "B00GNGUMR6", "B0081KIVSO", "B00F19Q7AC", "B004TJ6JH6", "B00BC3CJ1M", "B00A86MMY8", "B00CDIGDGC", "B003ASPH48", "B007LTH1X2", "B007ZQ4KYO", "B00ISH33JW", "B00A3MY7L8", "B001BPE3KQ", "B006W3ZY1E", "B00BLAA4L8", "B0049XGNKK", "B000246ST6", "B000BH437S", "B000YB862E", "B00BU9GBNA", "B006R38IJY", "B004VS9G2U", "B006N5B9BK", "B00009XV3M", "B00139W0XM", "B005EJ5IRC", "B006EDQVQ4", "B006L1V9S4", "B00CSQYVWM", "B003BWD6W8", "B001FA0B2Q", "B0079U1N00", "B007RBME2M", "B0069WHUO2", "B00AAIPT76", "B001FA0B3U", "B00F19Q7YI", "B0007Q9PWQ", "B000OPB4U6", "B00HQPF7PU", "B0018LQVIA", "B002ZIMEMW", "B00C3QF4GY", "B00IN8I3XM", "B00AY0J4OY", "B00F3F0GLU", "B009PK9SBS", "B005FN6K3S", "B00F19Q2R0", "B0010SIAV2", "B007V5J5QC", "B00F3R8BK6", "B007OWQGTG", "B00GSEPKW0", "B005NJCF7E", "B00BU9D4MG", "B005005EEM", "B00803N2AY", "B00HNJWSH4", "B009PK9QGU", "B001JJCI5Q", "B00I3Y3A52", "B009PK9SB8", "B003Y35VJA", "B0075AL0P2", "B000KU5CN0", "B00E3XRMSI", "B00G34QGAU", "B007E4PUT6", "B009TCD8V8", "B005UF3G2Y", "B009QNKXTU", "B00139XOCI", "B00DFU9BRK", "B003VSGQPG", "B00I2VIR2M", "B001WB02Z4", "B00EDNXR1E", "B0045TKC7S", "B00DRGQETA", "B001KELVS0", "B0017U0BRE", "B00CXUT5ZG", "B0036BGJ2I", "B00BOGP6DK", "B00GBW809E", "B0041I8UAO", "B00BSXX2LM", "B00G0J3FRK", "B00CS825XM", "B004SNMNFA", "B003PBB4ME", "B003FPEA0I", "B001M4HTFM", "B006Z8C5AY"], "bought_together": ["B002RCLYXG"], "buy_after_viewing": ["B00F19Q7YI", "B003ASPH48", "B00585CLXG", "B00F19Q7AC"]}}