{"asin": "B000ACGQI8", "description": "No larger than a baseball and priced with affordability in mind, the StreetPilot i2 GPS navigation system is a great fit for commuters, college students, and corporate travelers looking to experience the ease and enjoyment of satellite navigation for the first time. Don't let the small size fool you; the i2 boasts many of the same powerful functions as Garmin's premium vehicle GPS navigators.The StreetPilot i2 features a unique and convenient click-to-enter scroll wheel and a back button that makes it easy to select a destination from the unit's menu-driven interface. It also offers voice-prompted turn-by-turn directions through a built-in speaker, and should you miss a turn, the i2 will automatically recalculate the route to put you back on course. And perhaps most conveniently, the unit moves easily from vehicle to vehicle thanks to the integrated suction cup mount, so you don't need to go through a cumbersome process each time you change cars.The StreetPilot i2 is the monochrome-screened version in the i-series.Voice prompts and a destination flag help you get to your next destination quickly and effeciently.A convenient click-to-enter scroll wheel and a \"back\" button make it easy to select a destination.To get you from point A to point B, the StreetPilot i2 includes a MapSource City Select North America NT DVD, which contains mapping detail of the entire U.S., Canada, and Puerto Rico. The DVD's nearly six million points of interest range from hotels and restaurants to gas stations and ATMs, along with local attractions such as amusement parks and museums. Simply load the City Select data onto the included 128 MB Transflash data card via a fast USB connection and you're set.As an added benefit, you can now import customized points of interest with the help of Garmin's free POI Loader software. For instance, you can upload safety cameras or school zones, and then receive a warning if you are traveling too fast in these areas. In addition, an optional proximity-alert feature notifies you of upcoming custom POIs.Maps are displayed on the i2's high-contrast backlit FSTN monochrome display, which includes a backlight for difficult lighting conditions. Motorists even have the choice of multiple perspectives--either a 3-D mapping angle or an overhead bird's-eye view. For added convenience, drivers can power the unit with either two AA batteries (six hours, typical use) or the included 12-volt adapter cable.The StreetPilot i2 measures 3 x 2.74 x 2.15 inches (W x H x D) and is backed by a one-year warranty on parts and labor.What's in the BoxStreetPilot i2, America's Lite Routable base map, City Select North America DVD, PC/USB cable, 12-volt adapter cable, vehicle suction-cup mount, dashboard adhesive disk, 128 MB Transflash data card, setup guide, user's manual.", "title": "Garmin StreetPilot i2 2.5-Inch Portable GPS Navigator", "imUrl": "http://ecx.images-amazon.com/images/I/41bKOeWIUQL._SX300_.jpg", "related": {"also_viewed": ["B0057ODOCA", "B00HK6CPVY", "B00AY7NSTY", "B0057ODG6Y", "B00C9W1LT6", "B0057OCS9A", "B00AY7NV0K", "B000A5T7AO", "B00AXZY42W", "B00BIZ0EY8", "B0057OCDQS", "B007M52QR6", "B007M52EXM", "B000OH63MI", "B00CRQUKQ4", "B00AXX0IC4", "B00AXZWG8Q", "B005DIBHCE", "B00AXX0IEC", "B00AXX0I88"]}, "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS"]]}