{"asin": "B001F0RPGG", "categories": [["Electronics", "Car & Vehicle Electronics", "Vehicle Electronics Accessories", "Radar Detectors"]], "description": "The Escort Passport 9500ix is an intelligent and effective radar detector. It detect all bands of speed enforcement radar (X, K, Ka, and Ku) from both front and rear, and its programmable GPS-enabled circuitry ensures you won't be caught off-guard by hidden speed traps or pesky speed cameras. It even eliminates annoying false alarms. The Passport's GPS system takes advantage of the same satellites used for GPS navigation to pinpoint your exact location and compares it to the detector's on-board database of red light and speed camera locations. As you approach a potential threat, the detector provides an instant audible and visual alert. Distinct audible, visual, and voice alerts provide a separate warning for each band of radar, as well as laser, and traffic safety warnings. The brilliant blue LED alpha-numeric display is easily read in direct sunlight, and features five selectable levels of brightness for optimum night or evening use.The 9500ix detects X, K, KA, and Ku bands of radar, and also alerts of speed cameras, red light cameras, and locks out annoying false alarmsTrueLock/GPS Filter: The False Alert EliminatorIt's no secret that radar detectors are susceptible to false alerts. Radar signals are used not only for speed radar guns, but also for everyday devices like the automatic door openers at your local grocery store or motion sensors for home and business alarm systems. But thanks to the 9500ix's GPS-powered TrueLock filter, you'll never have to worry about false alerts again. When you discover a false alert, simply press the \"mute\" button three times, and the 9500ix will record the exact radar frequency and GPS location in its memory, and ignore future alerts. However, if an actual speed enforcement threat should occur at that same location in the future, the 9550IX is intelligent enough to recognize the new radar frequency and will alert you in plenty of time.AutoLearn: Artificial Intelligence ProtectionThe 9500ix also features AutoLearn technology, an artificial intelligence that recognizes false alerts. The 9550ix scans for radar threats and&nbsp; associates the specific frequency of an alert to a specific GPS location. If the detector picks up a specific frequency from a flagged location three times, it will acknowledge that as a false alert and will lock the frequency and location out of future alerts, alerting you of its decision with a single beep and displaying the locked frequency band on the unit's LED screen. The 9550ix can also unlock specific signals to protect you from specific threats as well. If a particular frequency is no longer present at a flagged location, or if the frequency moves to a new location, say across the street or down the road, the Passport will unlock the signal. The AutoLearn feature can also be toggled off in the main menu.Press the \"Mark\" button to set a new speed trap location in the 9500ix's memory.The next time you approach the marked location, the 9500ix will alert you of the possible speed trap.Mark Location: Speed Traps, Red Light Cameras, Speed Cameras, and MoreThanks to an extremely comprehensive database, the 9500ix has the ability to alert you of speed cameras, red light cameras, and common speed traps across North America. The database is frequently updated, and Escort provides three months of downloadable updates for free.The internal red light and speed camera database is easily updated by connecting the 9500ix to your computer's USB port. The 9500ix includes 3-months of free updates from Escort.Red light cameras are triggered by sensors built into the road, and activated when they detect a vehicle passing through the intersection illegally. A photograph is taken of the car and a ticket is mailed to the vehicle's owner. These systems do not emit a radar signal and are therefore undetectable by most other radar detectors...but not the 9500ix. Thanks to intelligent design, the Passport recognizes an approaching red light camera system and visually and audibly alerts you of the threat.Speed cameras are just as sneaky, and there are multiple types: radar, laser, induction loop, and photo-based. Radar based cameras transmit a near-horizontal radar beam across traffic lanes, which is difficult for almost any detector to pick up from a long distance. Laser cameras are even more difficult to detect since the signal is so narrow and does not let off any radiated or leaked signals. Induction loop cameras are similar to red light cameras and do not emit a radar signal at all. Photo cameras similarly do not use radar or laser signals and use multiple time-stamped photos to recognize speeding vehicles. All four speed cameras are nearly impossible for any radar detector to protect against, which is why the GPS-equipped 9500ix is the perfect system to protect against all speed detection threats.Speed traps are pretty sneaky and are usually located to catch unsuspecting motorists off-guard...but not if you're equipped with the 9500ix. If you discover a clever speed trap location, simply press the \"Mark\" button on the detector and tell the 9550ix what kind of warning to assign to your Mark (Red Light, Speed Camera, Speed Trap, or Other). The next time you approach that exact location, the 9500ix will give you an alert either one-mile ahead if you're traveling above 50MPH or a half-mile if traveling under 50MPH.Variable Speed SensitivityNot only does the GPS protect you with location-based radar tracking, the 9500ix also uses GPS to measure your speed, and automatically varies the radar strength for optimal radar protection. When traveling at highway speeds, the Escort is on full alert with maximum radar sensitivity for the best possible performance. When you slow down to city speeds, the 9500ix tunes down the sensitivity of key radar bands to help eliminate false alerts. It's so intelligent, that most of the time you won't even have to use the TrueLock feature. Of course if you prefer maximum radar protection, this feature can be turned off by selecting Highway mode. The Passport can also be programmed to flash your speed on the radar's display when it detects a radar threat, allowing you to quickly and easily check your speed without having to look down at your speedometer.Users can switch on Expeter Meter or SpecDisplay for even greater radar signal information.Alerts and AudioAs you approach a radar source, the Passport 9500ix will alert you with a distinct audible alert for the particular band of radar as well as a visual alert on the blue LED display. Each radar has its own specific chirp that increases in rate as you get closer to a radar source, eventually leading into a solid tone when the source is at its strongest. A voice alert for each radar and laser warning can also be toggled on or off in the detector's menu. The LED display indicates which band of radar is hitting you and displays the signal strength via bar graph meter readout. If there happens to be more than one radar signal in the vicinity, the Escort will decide which signal is the greatest threat and give priority to whichever is more important. For instance, if you drive by a grocery store with X-band based automatic doors, and a police officer is on the next block using a Ka-based radar gun, even though the X-band signal is stronger, the Ka signal will take priority. Ka and Ku bands are almost exclusively used for speed enforcement, while X and now K bands are used for other purposes. If you're hit with POP/Instant-On radar or laser, the detector will signal a solid tone and maxed-out bar graph as these signals usually indicate an immediate threat.The visual alert can also be customized to provide more information by switching into \"Expert Meter\" mode. The Expert Meter is designed for more experienced radar detector users, and can display up to three radar sources on the display at once, with a four-bar signal strength meter for each. For the ultra-experienced radar user, the 9500ix can even display the exact frequency of the radar band being detected.Mute, AutoMute, and AutoVolumeIt's understandable that you probably don't want to listen to the audible alert's continuous tone once you're aware of a threat. Simply press the \"mute\" button on the top of the detector and the audible signal will mute for that particular instance. When the signal passes out of range, the 9500ix will turn its audible alert back on. AutoMute can also be activated in the detector's feature menu. Once an alert has been announced, the system will automatically turn down the audible alert to a user-selected level. The Passport 9500ix can also be set to automatically detect the ambient noise level in your car, and either turn up or turn down the detector's alert volume to compensate.The 9550ix is also perfect for motorcycles. A 3.5mm headphone jack located on the side of the detector can be used to pipe audible signals to a headphone or external speaker system.The included SmartCord features a yellow LED alert indicator and easy-to-reach mute button.Windshield Mount and Smart Power CordMounting the Passport 9500ix is a snap with the included windshield suction cup system. The mount is adjustable so you can get the perfect horizontal angle. Mounting the detector properly is important - it must have a clear view of the sky for maximum GPS signal reception. If you plan to use your 9500ix in more than one vehicle, consider picking up an additionalEscort suction cup mounting adapterfor each car. The Passport easily locks and unlocks from the mounting base with a press of a button.The 9500ix includes Escort's famous coiled SmartCord power adapter. So what makes the SmartCord so smart? The radar detector communicates a signal to the plug base, which can act as a secondary control center for the 9500ix. A yellow LED offers a visual alert and flashes to indicate the detected radar threat's signal strength. When using \"dark mode\" on the 9500ix, no alert is displayed on the radar's LED readout, but the SmartCord's flashing LED offers a visual indication of your radar threat that won't draw attention from outside eyes. The SmartCord also features a mute handy button, which can sometimes be a more convenient (and less obvious) reach than the detector's top-mounted mute button. Or for a more permanent installation, check out theDirectWire SmartCordor the more basicDirectWire kitfor hardwired installations.What's In the BoxEscort Passport 9500ix radar detector, coiled SmartCord power adapter, suction cup mounting system, user guide/quick reference card, and warranty information", "title": "Escort Passport 9500ix Radar/Laser Detector (Blue Display)", "price": 424.9, "imUrl": "http://ecx.images-amazon.com/images/I/31V5oPb0MpL._SX300_.jpg", "brand": "Escort", "related": {"also_bought": ["B0063N7OZ2", "B003PJ6QPQ", "B00CYSHUG8", "B00I4GT5XK", "B002J47Q3O", "B006074LT8", "B003DNSJPE", "B00HSVIOKC", "B001ODDBSU", "B00C3UG3LA", "B0003NN83U", "B006JJFP56", "B00B7NOMTY", "B0003NN81M", "B0002BGELQ", "B0003NN83K", "B0052ZI4WY", "B006MZFH28", "B008L2XYZC", "B004C2C1UO", "B001DSIMAI", "B003O73E0Y", "B00D3NXM2Y", "B00JG5ZMVC", "B00JFKE2MI", "B005VFXSVC", "B002GEBRAK", "B00E40QPX8", "B000U0Z2L2", "B00I0MWPXU", "B0016LE80K", "B00IH5VVHQ", "B003RQBKLC", "B00F474DVG", "B00HPM6E5Q", "B008DREON6", "B00AXX0IC4", "B00E5OUOCQ", "B003YJ8TVQ", "B000FPN8TK", "B000Z0HVHA", "B002OL2MU4", "B00AXX0IEC"], "bought_together": ["B0063N7OZ2", "B003PJ6QPQ"], "buy_after_viewing": ["B00GSNNWDA", "B0063N7OZ2", "B00DUCXFUC", "B003PJ6QPQ"]}}