{"asin": "B0001G6U3Y", "description": "Canon raises the stakes for professional photography with its EF 70-300mm f/4.5-5.6 DO IS USM telephoto lens with image stabilization. Thanks to a new triple-layered diffractive optical element (DO), this 70-300mm lens is less than 4 inches (10 cm) long. It can focus down to 4.6 feet (without rotating the front element) and a new zoom lock button keeps the lens safe and secure when not in use or used at the wide angle. A virtually silent ultra-sonic motor (USM) gives the lens extremely fast autofocus. The lens also includes Canon's Image Stabilization technology to dramatically reduce camera shake, compensating for approximately three stops in shutter speed without any perceptible increase in image blur. It's a great choice for professional photojournalists and serious advanced amateurs who need to contain the size and weight of equipment carried.DO ElementsUse of the new three-layer DO lens drastically reduces the overall length and weight of the lens system increasing the refractive power of each lens element and reducing the spaces between elements. It's approximately 26 percent shorter and 36 percent lighter than any lens of comparable specifications.Zoom lockThe EF 70-300mm lens features a zoom ring locking mechanism, locking the lens at its shortest total length. This helps to protect the lens from potential damage by preventing the zoom elements extending under their own weight, which might otherwise occur when the lens is mounted to a camera that hangs from a neck or shoulder strap.Image StabilizationThe lens incorporates Canon's Image Stabilization (IS) technology, compensating for approximately three stops without any perceptible increase in image blur when shooting static subjects or panning. This increases the range of circumstances in which hand-held photography is possible, limiting the need to carry a tripod.Fast AFA rear focusing ring type USM, high-speed CPU and new AF algorithms combine to give the lens extremely fast auto-focusing. The ring-type ultrasonic motor (USM) converts ultrasonic vibrational energy into rotational force to deliver high-speed, high-precision, super efficient and virtually noiseless auto focusing, with good holding torque for rapid response and accurate stopping. Full-time manual override is featured, removing the possibility of damage to the autofocus mechanism during manual focus. The lens has a minimum focusing distance of just 1.4m throughout the entire zoom range.Ready for Digital PhotographyThe lens shape and coatings have been optimized to suppress ghosting and flaring, making this lens ideal for use with digital cameras that are more susceptible to reflections off the recording media than are film cameras.Working with EOSThe drive pattern of the lens is tailored to specifically match that of the latest EOS range, extracting maximum benefit from the lens' speed advantage. The lens comes with a case LP1116 and an exclusive hood ET-65B for shading against unwanted direct light.", "title": "Canon EF 70-300mm f/4.5-5.6 DO IS USM Lens for Canon EOS Cameras", "brand": "Canon", "imUrl": "http://ecx.images-amazon.com/images/I/51lvDDk37JL._SY300_.jpg", "related": {"also_bought": ["B0007MXVH0", "B0000BZL68", "B00004ZCJI", "B00007LA0T", "B004OVE17Y", "B001KELVS0", "B00DMS0GTC", "B009B0MZ8U", "B00IT0AMBU", "B002NEGTSI", "B0000BZLBQ", "B002K450QI", "B00009R6WO", "B000EW8074", "B000JLM50I", "B00FP1BQ1Q", "B0000BZL83", "B008UGMLWQ", "B000PTFDYO", "B00BW6LXHA", "B001CCAISE", "B0000BZL9J", "B00A2BWBNQ", "B00894YP00", "B0007WK8KS", "B004QC6VAG", "B001G7PMM2", "B00009R9A1", "B008BBKARI", "B0000C4GEE", "B001ET6QFY", "B007NDL54C", "B00009R6WY", "B00004ZCI3", "B002KDS2BY", "B003980YK6", "B0000CBBNM", "B0000BZL8H", "B00004ZCJM", "B00BCWA6TK", "B008NFWDCM", "B007NDL56A", "B009EM694G", "B002ISXBFI", "B002NEGTTM", "B00675HL1S", "B006G5ZVA2", "B004V97MXE", "B002L6937C", "B00004WCID", "B00A2BWAKK", "B0037NX6JY", "B004OVE188", "B000NP46K2", "B000AZ57M6", "B000CLNHXY", "B0049H89F8", "B004863BV2", "B0040X4PQI", "B00009XVCZ", "B002CVU4G0", "B00BW6LW7G", "B001G4PA36", "B0043RTLNS", "B008NF8CEK", "B0076BNK30", "B00CV9MM3G", "B003Q9RERY", "B00A2BWBCM", "B00006I53S", "B005HWC6PI", "B00009R6WU", "B002VPE1WK", "B007G5NNOW", "B002WE4H8I", "B0049XGNKK", "B009PK9SBS"], "bought_together": ["B00004ZCJI", "B00007LA0T"], "buy_after_viewing": ["B0007Y794O", "B0040X4PQI", "B000B84KB6", "B00004ZCJI"]}, "categories": [["Electronics", "Camera & Photo", "Lenses", "Camera Lenses", "Digital Camera Lenses"]]}