{"asin": "B0011ZH0BK", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Compact and stylish, the Samsung S860 digital camera features a 3x optical zoom, a Samsung SHD lens, and Digital Image Stabilization (DIS) to help minimize the effect of camera shake and produce sharp, clear images, especially in low-light environments. You can also take advantage of advanced features such as Face Detection and Self Portrait mode.Face Detection technology makes taking pictures of family and friends a snap, as it detects up to nine faces and automatically adjusts focus and exposure to ensure better composition and image quality. Self Portrait mode is a unique functionality that takes the guessing out of taking a self portrait. By utilizing Face Detection technology, the S860 automatically detects the subject's face, adjusts focus and exposure, and will only allow a photo to be taken if the subject is centered in the frame.Face Detection technologySelf Portrait modeYou can also benefit from the camera's Function Description feature. Designed to reduce the intimidation factor of the cameras' various modes, Function Description automatically provides a brief and easy to understand description of each setting when scrolling through the cameras' menus, helping the end-user determine which setting is appropriate for their current shooting scenario.  Additionally, with 11 scene modes to choose from, including Night, Portrait, Children, Landscape, Close-Up, Sunset, Dawn, Backlight, Fireworks, Beach &amp; Snow, and Self Portrait, shooters can rest assured that they'll be able to effortlessly adjust the camera.The S860 also boasts a special effects \"E\" button, which gives users instant access to a host of creative controls, including options for resizing and rotating images, adjusting brightness, contrast and saturation levels, fixing red eye, and manipulating color such as saving captured images as B&amp;W, Sepia, Red, Blue, Green, and Negative. Users can also shoot video with the S860. Movie mode lets users capture video in one of two resolutions, 320x240 or 640x480, at 30 frames per second in AVI (MJPEG) format. Just as in still-picture mode, the DIS image stabilization system can be engaged to compensate for camera shake and to reduce blur.For maximum versatility, the S860 can be powered by two, readily available AA alkaline batteries, a considerable benefit for travelers and photographers on the go.Samsung S860 Highlights8.1 megapixels, 3x optical zoomThe Samsung S860 is a high-resolution digital camera that is equipped with a true-color filtered 8.1-megapixel CCD. This allows the Samsung S860 to produce even better images and take detailed photos for printing up to poster size. In addition, the Samsung S860 has a 3x optical and 3x digital zoom giving 9x total zoom when combined.DIS (Digital Image Stabilization) functionDIS technology prevents the degradation of image clarity and colour which is sometimes found in flash photography. With DIS the effects of image blur are reduced in lower light conditions.You can even take well exposed, sharper pictures in low light conditions without using a flash at all, which guarantees brighter and more natural pictures.Digital Image Stabilization in actionFace Detection AF &amp; AEWith the Face Detection AF &amp; AE function, the Samsung S860 enables the user to take better portrait pictures more easily. The function detects faces and automatically focuses on them; the brightness of the faces is adjusted optimally for beautiful portrait pictures.2.4-inch Intelligent LCDThe Samsung S860 has a 2.4-inch LCD with improved contrast and color reproduction for easy image framing and reviewing.11 Scene ModesYou have a choice of scene modes to help you get the perfect shot in any situation. By automatically adjusting the camera's setting according to the situation, you can be sure of getting great pictures effortlessly. The scene modes provided are Children, Landscape, Close-up, Text, Sunset, Dawn, Backlight, Fireworks, Beach & Snow, Night and Portrait.Function Description &amp; Photo Help GuideProvides a brief description of the main functions and different modes the camera has to offer.The different icons, scene modes and other features are described in simple and easy to understand terms to improve the interaction between the user and camera.A guided tour of how to take better images. Easy to follow tips instruct the user how to obtain excellent results.", "title": "Samsung S860 8.1MP Digital Camera with 3x Optical Zoom (Silver)", "price": 10.99, "salesRank": {"Camera &amp; Photo": 13163}, "imUrl": "http://ecx.images-amazon.com/images/I/4123MKECgnL._SY300_.jpg", "related": {"also_viewed": ["B00I8BIBCW"], "buy_after_viewing": ["B007BJHETS", "B005HNF01O", "B000P1O73A", "B004MB8302"]}}