{"asin": "B003656Q7C", "categories": [["Electronics", "Camera & Photo", "Bags & Cases", "Camera Cases"]], "description": "Description:The new, fast-access SlingShot AW series builds on the inventive design of the original and incorporates what many photographers are looking for: faster access, extra space for personal items, improved organization, and the ability to add a tripod. The SlingShot AW offers more volume in the upper compartment for extra accessories or personal items. A Hideaway Tripod Mount system with foldout holder and quick-release buckle secures a compact tripod to the side. The same inventive design&mdash;letting you quickly rotate to the front to access&mdash;remains a Sling Bags tried-and-true feature of this customer favorite. Also includes: a patented All Weather AW Cover; 3 SlipLock attachment loops; built-in microfiber cleaning cloth; and more.Hardware Capacity:DSLR (without grip) up to Nikon D90 or Canon 5D with attached standard zoom lens; 1-2 additional lenses or flash units and accessories (including a point-and-shoot camera); compact tripod or monopod; personal itemsSlingShot 102 AW:1.&nbsp;Original camera sling bag designAllows quick rotation from back to front to access camera, lenses and accessories without removing bag2.&nbsp;Increased volume throughout the slingProvides additional space for personal items and accessories in an upper compartment, stash pocket and front pocket3.&nbsp;Easy-glide zippersOffer smooth operation and fast access to all compartments4.&nbsp;Main camera compartment with updated divider systemAccommodates most popular DSLR models5.&nbsp;Hideaway Tripod Mount systemSecures a compact tripod or monopod to side of sling via a foldout holder, quick-release buckle and strap6.&nbsp;Ergonomic sling strapOffers a unique, comfortable way to carry gear7.&nbsp;SlipLock attachment loopsExpand carrying capacity by adding compatible pouches, cases and bags8.&nbsp;Two built-in memory card pocketsProvides easy-to-access extra memory on inside lid of main compartment9.&nbsp;Adjustable padded waistbelt10.&nbsp;Repositioned, built-in microfiber clothProvides convenient cleaning cloth that tucks into a mesh pocket and out of the way of camera&nbsp;Additional Features & Benefits:All weather AW cover protects camera gear and personal items from the elements and tucks away when not in use&nbsp;Airline carry-on compatible&nbsp;", "title": "Lowepro SlingShot 102 AW", "price": 58.08, "imUrl": "http://ecx.images-amazon.com/images/I/4193RZcvcQL._SY300_.jpg", "brand": "Lowepro", "related": {"also_bought": ["B0080JH3YE", "B0036AWR8E", "B007M54E1M", "B00006JN3G", "B0048IW030", "B000VZS2EU", "B003ENIC6E", "B0036AYTWG", "B00007E7JU", "B007NDL56A", "B00004ZCJG", "B00906D9YE", "B0000BZL7S", "B006Y0YZZ6", "B008A63Z26", "B00004ZCJK", "B00C1VEQFG", "B00017LSPI", "B00EY3YGBS", "B000ANCPNM", "B00820A7YY", "B00FXYTLIK", "B004OI0NGK", "B00FAYL1YU", "B00CSU5Q5O", "B00BW6LX20", "B00F5JV4NS", "B0042X9LCO", "B004861H7W", "B007VPS2RU", "B00AA48DVO", "B000YIWR8G", "B007YCA6UG", "B005Z3DWOI", "B00004ZCJI", "B007VGGIB6", "B004Q3C98S", "B00F5JHDZG", "B001S2PPT0", "B00BW6LWO4", "B00E9BYHJ6", "B0058I7CVE", "B00EQ07PG2", "B004J3V90Y", "B00AA48HPQ", "B00BCEJ0E0", "B001CCAISE", "B00009XVCZ", "B0053V5MF4", "B001D60LG8", "B009B0WREM", "B0096JZRBI", "B0084FM5JC", "B00DMS0LCO", "B005UG3KS8", "B0043D2L3Y", "B00EFILVQU", "B00CCKE4J4", "B002CGSYOO", "B0002YE6FY", "B00009R96C", "B009YE462G", "B0011NVMO8", "B009B0MZG2", "B0074WDFSQ", "B00B7ID9CU", "B00007LA0T", "B00009R6K7", "B00FXYT12G", "B004Y1AYAC", "B00F5E3N46", "B009F8UD6Y", "B00DN43UPM", "B000KKPN5C", "B007TNFT5M", "B007VWZVB8", "B004QC6VAG", "B004861K1A", "B00JVZ7TYK", "B00CXB63QO", "B0037NX6JY", "1305106679", "B004MKNJ98", "B0000BZL83", "B00005K47X", "B007M54E08", "B00309CJIE", "B00CH6ATMO", "B001KELVS0", "B003VNKNF0", "B004P13H4G", "B00CV9MKU6", "B000O161X0", "B00CV9MK4W", "B00A2BWBCM", "B004U28R86", "B00AWVG0J2", "B00007EDZG", "B0042X9L6A", "B000PTFDYO"], "bought_together": ["B0080JH3YE", "B007M54E1M"], "buy_after_viewing": ["B0036AWR8E", "B002ISXBFI", "B0036AYTWG", "B004JMZPJQ"]}}