{"asin": "B000V1VG4W", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The PowerShot SX100IS will inspire you with its with phenomenal 10x optical zoom... and so much more. There's the 8.0-megapixel CCD and Optical Image Stabilizer for shake-free shooting. Plus, the DIGIC III Image Processor with advanced Face Detection, Face Selector Button, and red-eye correction assure superb results every time. Auto ISO Shift and ISO 1600 make low-light shooting easy. The large Mode Dial lets you select Scene Modes or full manual control effortlessly.PowerShot SX100IS HighlightsPacked with Brilliant Features in a Compact BodyA new concept, the PowerShot SX100IS is compact and portable with streamlined controls. Take it everywhere, because inside is a level of photographic power that's truly impressive; 8.0 megapixels ensure deeply detailed images, giving you complete freedom to enlarge an image or any section of an image and crop it to your exact specifications.With DIGIC III, your images boast superior quality, the camera operates at top efficiency, and battery life is enhanced. What's more, DIGIC III enables Canon's Face Detection Technology and red-eye correction to give you better, more true-to-life people shots. Simply press the Shutter Button halfway down, and the camera automatically pinpoints the faces in the scene and chooses the ideal focus point. The camera controls exposure settings and flash to keep every face looking bright and natural. Red eyes can be corrected during playback.iSAPS Technology is an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the fast DIGIC III Image Processor to improve focus speed and accuracy, as well as exposure and white balance.Powerful Zoom, True-to-Life ImagingThe PowerShot SX100IS has a 10x optical zoom lens that makes it easy to get the inspiring, emotive close-ups that will make your images lasting keepsakes. This magnificent lens gives you the power to shoot distant subjects with razor-sharp precision and stunning lifelike color. So you can brilliantly capture a bird high atop a tree, a child's winning goal from across the stadium, or a school play from the last row. Plus, thanks to Canon's highly sophisticated Optical Image Stabilizer technology, even at maximum zoom every image is rock steady.The PowerShot SX100IS is equipped with Canon's acclaimed Optical Image Stabilizer Technology that automatically detects and corrects camera shake--one of the leading causes of fuzzy or blurred shots. Even when zoomed in, you can get the steady, crisp, brilliant images you'll be proud to shoot and share. And Canon's Optical Image Stabilizer Technology is so convenient to use. It functions perfectly with or without a flash.See the Image Beautifully with Wide Viewing AngleThe camera's 2.5-inch LCD screen gives you the big picture, whether you're shooting, reviewing, or showing off your images. This high-resolution screen offers a crisp, clear picture and wide viewing angle to make shooting, playback, and using the camera's menu functions especially convenient. Clear and bright, it also features Night Display for easy viewing in low light. And the convenience of using AA-size batteries means that no special power adapters or chargers are needed wherever you go.Canon Technology Maximizes Quality and PerformanceGenuine Canon Face Detection Technology sets the focus, exposure, and flash automatically, leaving you free to compose a group, capture an unguarded moment, or coax the perfect smile. Plus the new Face Selector Button lets you select the primary face.DIGIC III features Face Detection technologies, giving the you best possible results in any shooting situation. Face Detection AF/AE sets the focus point and exposure for the faces of your subjects. Face Detection FE adjusts the flash to correctly illuminate your subject to provide the best balance between your subject and the overall scene, eliminating the common problems of over- and underexposed faces.Red-eye correction detects and corrects red-eye during playback. In unusual cases where red-eye is not automatically detected, it can easily be corrected manually during playback mode.And new Face Selector AF enables you to lock on and follow a specific face. The selected subject is tracked wherever the face moves in the frame. Simply press the Face Selector Button; then the selected face is double-framed and tracked when the face moves in the frame.Life doesn't give you second chances to capture special times. That's why the PowerShot SX100IS features ISO 1600 and High ISO Auto settings that reduce the effects of camera shake and sharpen subjects in low-light situations, giving you greater shooting flexibility.Instant Creative ControlEasy-to-use Mode Dial with a wide range of shooting modes from fully manual to fully automatic, including Kids and Pets mode to capture fast moving objects.Now you're free to concentrate on what really counts--your subject. With the large simple-to-operate Mode Dial, all you have to do is turn to the setting that best matches the scene you're viewing through the lens. The PowerShot SX100IS does the rest. It chooses the perfect exposure, aperture, and flash. Or if you want to flex your creative muscles, choose Manual Control and do it all yourself. You've got special Scenes Modes to handle a wide range of common shooting situations--effortlessly.The Complete Print SolutionPrint/Share Button for easy direct printing and downloading, plus ID Photo Print and Movie Print with select PIXMA Photo Printers, CP, and SELPHY Compact Photo Printers.The PowerShot SX100IS's Print/Share button makes direct printing easier than ever. Simply connect the SX100IS to a Canon CP, SELPHY, or PIXMA Photo Printer or any PictBridge compatible photo printer, press the lighted Print/Share button and print! Also use the Print/Share button to transfer images to a computer (Windows and Macintosh).Print your own ID photos in 28 different sizes or use the Movie Print function to output multiple stills from a recorded movie on a single sheet with a Canon SELPHY Compact Photo Printer.What's in the box:PowerShot SX100IS digital camera, AA-size alkaline battery (x 2), 16MB SD memory card SDC-16M, wrist strap WS-200, Digital Camera Solution CD-ROM, USB interface cable IFC-400PCU, AV cable AVC-DC300", "title": "Canon PowerShot SX100IS 8MP Digital Camera with 10x Optical Image Stabilized Zoom (Black)", "price": 9.99, "salesRank": {"Camera &amp; Photo": 3334}, "imUrl": "http://ecx.images-amazon.com/images/I/4113T-DtjkL._SX300_.jpg", "related": {"also_bought": ["B001NDIZAK", "B0042SA5U6", "B005I6DVC0", "B001EQ4C8U", "B00006CFDO", "B000HARTYI"], "buy_after_viewing": ["B003VNKNEQ", "B00908BQCY", "B003VNKNF0", "B00EFILPHA"]}}