{"asin": "B000NDBRJC", "description": "Amazon.com Product Description When its time to back up and protect your digital content--photos, music, documents, and more--it doesn't get much easier than the Seagate Free Agent Desktop USB Portable Hard Drive. Simply plug it in to any power source, connect the USB cable to any computer, and you're ready to go. This hip-looking hard drive takes up less room on your desk than an ordinary stapler, giving you more space for your other desktop items.Powerful storage device with a sleek new design.Takes up less room on your desk than a stapler.Keep all your digital content in a safe and secure location.Portable Performance and SecurityIf you're still relying on your personal computer or back-up CDs or DVDs to store your digital content or vital personal or family documents, you're running an unnecessary risk. Your computer can only hold so many files and can crash at any time, leaving you helpless to access your content. DVDs and CDs have a place in archiving, but they get easily scratched and lost. It's too risky to store everything in your computer, and too time-consuming and cumbersome to have a drawer full of CDs or DVDs.Computers come and go, but your content should always be nearby. With up to 1000 glorious gigabytes, the Free Agent external hard drive is the best place to gather and access all of your important photos, movies, music, games and documents. Simply plug in the power and the USB cable and you&rsquo;re ready to go.The Seagate Free Agent is big enough to store a huge portion of your digital content in a safe and secure environment, but small enough to let you take that content with you wherever you go. In other words, having the Seagate Free Agent is like having your entire computer with you at all times, but in a package that's a small fraction of the space and weight of your computer.Designed to live peacefully in your home or office, the Free Agent external hard drive is extra quiet and takes up less room on your desk than a stapler. Even the cable ports are base-mounted to help keep your desk free of clutter. We even add a little bit of sophistication to your desktop with the unique espresso brown finish and molten amber illumination.The sleek and slim design of this hard drive--only measures 7.5 x 1.6 x 6.4-inches (H x D x W)--and a weight of less than four pounds. The Seagate Free Agent lets you transfer files seamlessly from your computer via its USB 2.0 connection at a brisk transfer rate of up to 480Mb/sec. The drive delivers a spindle speed of 7,200 RPM, giving you the high-speed performance you need to back your data up quickly and safely.The Seagate Free Agent is ready to use out of the box with a PC, but it can be made Mac-ready in a matter of minutes with Mac OS X's Disk Utility. This portable hard drive is already compatible with Windows Vista (as well as Windows XP and Windows 2000), allowing you to backup your content regardless of operating system upgrades.At this compact size, and with this high performance, you now have the ability to take your data with you anywhere you go, so your digital content finally has room to breathe. A five-year warranty is also included, giving you complete peace of mind.What's in the BoxFreeAgent Desktop drive, USB 2.0 cable, AC power adapter, and quick start guide.", "title": "Seagate ST302504FDA1E1-RK FreeAgent Desktop 250 GB 3.5&quot; USB 2.0 External Hard Drive", "price": 49.99, "imUrl": "http://ecx.images-amazon.com/images/I/313khZcT2zL._SY300_.jpg", "related": {"also_viewed": ["B005J7YCHG", "B000ND75C0", "B001FFU1GC", "B004CG4WOI", "B00834SJSK", "B006Y5UV36", "B0085JRRAY", "B00CI3BISU", "B009T0FGRE", "B0012GQZZU", "B004RX2KTK", "B00BOHNYTW", "B00829THO6", "B005J7YA4G", "B00829THH8", "B008R7FC74", "B00CGUMVHW", "B00H4XH5FY", "B00CGUMUGE", "B005J7YA50", "B005J7YAWI", "B005J7YAXC", "B005J7YA64", "B001FA064E", "B006Y5UV4U", "B0062FZ3PY", "B000ND75BG", "B00EAS8AA0", "B001FWCDQG", "B00CO1I2RQ", "B000NDBRKG", "B000ND75CU", "B00H4XH586", "B009HQHPB0", "B00BOHNYU6", "B00HFRWXV0", "B00847VJ06", "B001FWIDWY", "B005J7YBRW", "B00H4YGR48", "B00E83X9P8", "B00E3RH5W2", "B00H4XH5IG", "B00HFRWWAM", "B00CO1I29O", "B00ARJD56K", "B00834SJS0", "B00EAS8IYI", "B00ILALU9G", "B00CI3BLPA", "B00H4XH5GI"], "buy_after_viewing": ["B005J7YCHG", "B0030BMV9O", "B00E83X9P8", "B000ND75C0"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]]}