{"asin": "B001AGM2VI", "description": "Amazon.com Product Description The award-winning NETGEAR XAVB101 Powerline AV Ethernet Adapter Kit includes everything you need to extend a network connection using the electrical wiring in your home. With this kit, you can network your game consoles, PCs, DVRs, network storage devices, and other components without suffering from weak wireless signals or unsightly cables running through your home. If you're looking for a fast, easy, and reliable way to provide Ethernet connectivity to the farthest reaches of your home, then this kit is the perfect solution..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The NETGEAR XAVB101 Powerline AV Ethernet Adapter Kit:Includes two Powerline AV Ethernet adapters.Creates fast, 200 Mbps network connections using existing electrical lines.Uses 128-bit AES encryption for security.Doesn't require any software for set up or installation.Everything needed to make a network connection is included.View larger.Turn your home's electrical outlets into network connections.View larger.Plug-and-Play Setup Gets You Going FastA PC Magazine Editor's Choice, the Powerline AV is a snap to set up. Just plug one XAV101 adapter into an available electrical socket near your router, and connect your router to it. Then plug thesecond XAV101 adapter into any electrical socket that's located near the device you want to network. When you connect your device into the XAV101, it will be connected to your network.It's as simple as that. There's no software to install, no passwords to remember, and no configuration whatsoever. And you can easily create more network connections throughout your home by simply installing additional adapters.If you wish to make more network connections, you just have to purchase and connect additionalNETGEAR XAV101 Powerline AV Ethernet Adapters.Fast Network Connection for Media StreamingThe Powerline AV supports the Homeplug AV protocol and delivers up to 200 Mbps network speed, fast enough for high-quality HD video streaming, music streaming, gaming, and VoIP (Voice-over-Internet Protocol) telephone calls. The Powerline AV Ethernet adapter is perfect for devices such as TiVo, Slingbox, Xbox 360, Playstation 3, networked televisions, and more.Push-Button Security for Extra SafetyUnlike wireless connections, a Powerline network connection is secure. The XAV101 supports 128-bit AES encryption. Setting up a secure connection with the Powerline is as simple as pushing a button. And for the ultimate in convenience, the Powerline also features three different colored LEDs that give information on Power, Network Status, and Ethernet connections.Each adapter measures 2.83 x 3.86 x 1.57 inches (WxHxD) and is backed by a one-year warranty.What's in the BoxTwo Powerline AV Ethernet Adapters, 5-foot Ethernet cable, installation guide, setup CD, warranty card, support and information card.", "title": "NETGEAR XAVB101 Powerline AV Ethernet Adapter Kit", "price": 129.99, "imUrl": "http://ecx.images-amazon.com/images/I/31kM9PGO6OL._SX300_.jpg", "related": {"also_viewed": ["B00AWRUICG", "B006OOKT3Y", "B00AWRUIY4", "B0081FLFQE", "B0024G48VA", "B004C4XWN2", "B007ILFFS6", "B0001W8XQ0", "B00IBPLI48", "B0036R9YA6", "B001AZUTCS", "B009WG6JF8", "B009WG6K66", "B004D9V8C8", "B006JG5S6U", "B009WG6JJO", "B007ZT1PAI", "B008LTPEXU", "B006JG5S6K", "B00ARJN5WE", "B00D4SOF3S", "B0002IHP58", "B0036RFGKS", "B00CB2F65O", "B008F537KC", "B0087O6AQE", "B004YW7W1A", "B009ZRBXMI", "B004PA9PBQ", "B005O0R9UA", "B004DVEW8I", "B00CUD1M66", "B00CUD1KEU", "B0046SQ8VW", "B00EPGHHSS", "B00F0RC97A", "B0002MH3HO", "B00HSQAIQU", "B00CD0JSMG", "B0061308MA", "B001U0IO3O", "B00871SR68", "B002IKKF5K", "B009WG6JMG", "B00I0MKIB6", "B00I0MKIDO", "B005XUNWZ2", "B00D7GF5MM", "B00AOGZ80C", "B002J9G5XG", "B004RILLZO", "B00DQN3R80", "B003ULOZ5W", "B003VWY0VY", "B005GCSZE0", "B005GCSZD6", "B008BFAGIC"], "bought_together": ["B00000J1V5"], "buy_after_viewing": ["B00AWRUICG", "B006OOKT3Y", "B00AWRUIY4", "B0081FLFQE"]}, "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Network Adapters", "Powerline Network Adapters"]]}