{"asin": "B00DY2Y1OW", "categories": [["Electronics", "Camera & Photo", "Video Surveillance", "Surveillance Systems", "Surveillance DVR Kits"]], "description": "Monitor your home or business with levels of clarity and detail never before possible with Q-See's completely digital, high-performance 4 channel Network Video Recorder and IP camera bundle. The first do-it-yourself digital recorder of its kind, this bundle is pre-equipped with four Power Over Ethernet (POE) ports, eliminating the need to run a separate power cable or buy extra, expensive equipment, saving both time and money. The two included 720p high definition IP cameras connect directly to the NVR using the included 100-foot RJ-45 Ethernet cables which supply power to the cameras and video to the recorder. The two cameras deliver true high-definition recording, which results in fluid on-screen motion. The system can also accommodate up to two more 720p cameras, or be upgraded with 1080p cameras for even greater picture quality. The Q-See NVR's ultimate benefit is the flexibility it affords through its ability to operate and connect with remote IP cameras. This single NVR manages and records up to eight cameras simultaneously regardless of where each camera is located. In addition to the convenience of monitoring various properties, enjoy an extra layer of security by placing the NVR in a safe, low-risk location to limit access to the system and its critical recordings. Calibrated for color-rich image and clarity, the QC814-261-1 is the perfect digital surveillance solution for your home or business. Whether you need to monitor employees or just your backyard, this NVR & IP Camera bundle covers your needs with its flexibility and crystal clear quality.", "title": "Q-See QC814-261-1 4 Channel HD Digital NVR with 1 TB Hard Drive and 2 HD 720p IP Cameras (White)", "price": 704.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41kBKqP77dL._SX300_.jpg", "related": {"also_viewed": ["B009KPAR2M", "B00J5R9GGS", "B009F7EQPY", "B00ANII768", "B00DEQM1Q8", "B009HPBSGE", "B00GNJZIB8", "B00EVNVRM2", "B00FG19FXG", "B00CFF0M7O", "B00COY94BQ", "B00I2N6NVC", "B00H7OF2LY", "B00DEQMXX4", "B00K4PHFP4", "B00I2N6O20", "B00K3GQFDW", "B00F0SL5OM", "B00I2N6QOQ", "B00DWD7RO4", "B00EDTZJI2", "B008N234DW", "B00JD4T4J2", "B00EIJZV9O", "B00IEOEDSY", "B00I2GNBZA", "B00IAZ3KRC", "B00E6ALHH0", "B00IXI520Y", "B009P4QQPU", "B00J5V7WNI", "B00DY2Y5OI", "B00DEQLDDU", "B00D2M6HHS", "B00E44LDUO", "B00HG10XHQ", "B00I3DOZHK", "B00J97M1U2", "B0096HG6QU", "B009F7EQAY", "B00J8HV9QU", "B00JD4T4EM", "B00HN632F4", "B00GJYD9R2", "B007ULT41S", "B00EKF8A4E", "B00J9D4KJ6", "B00HN6345C", "B00GSKZAS8", "B00ECOF70S", "B00HG137OM", "B00FJHI9UM", "B00C6AOL8E", "B007ULT4KE"], "bought_together": ["B009KPAR2M"], "buy_after_viewing": ["B00I2GNBZA", "B00DWD7RO4", "B00F0SL5OM", "B009KPAR2M"]}}