{"asin": "B000EXRSVM", "description": "Amazon.com Product Description Is your computer loaded with photos, music, video, and all sorts of important files? If so, you should make extra room, back them up, and keep them safe on Western Digital's WDG1U5000 My Book Essential Edition 500 GB Hard Drive. This reliable, easy-to-use external hard drive is the perfect storage solution for all your precious digital assets.Save and back up all your digital assets with the My Book Essential Edition Hard Drive.View larger.Simple, easy-to-use design.Connects to your computer via USB 2.0 interface.View larger.The elegant case takes up very little space.Installation is a breeze because you don't really \"install\" anything -- just plug it in and it's ready to use. There is not even an installation CD because all the included software loads automatically from the hard drive the first time you plug it in. The My Book Essential is all about simplicity. Just plug it into your computer's USB 2.0 port and you're ready to start saving and backing up your files.But that's not all. Western Digital uses a smart design to make the My Book Essential look as good as it performs. The elegant case resembles a book and takes up very little space on your desk. Plus, it stacks horizontally and allows two or more drives to nestle neatly together like encyclopedias on a shelf. Inside the stylish exterior is an exceptionally fast, ultra-quiet, cool-running hard drive. Last but not least, the My Book Essential is equipped with free Google software that searches your drives, manages your photos, and simplifies Web searches.My Book Essential Edition Hard Drives are ideal for:Simple add-on storage for your files, music, photos and moviesAdding virtually unlimited storage with multiple USB 2.0 external hard drivesArchiving the music stored on your MP3 playerAdding plenty of space for digital video capture and editingSaving and organizing your digital photo collectionNote:For higher performance and automatic backup software, consider theMy Book Premium Edition 500 GB Hard Drive.What's in the BoxMy Book Essential 500 GB USB 2.0 external hard drive, USB cable, AC adapter with power cord, and quick install guide.", "title": "Western Digital My Book Essential Edition 500 GB USB 2.0 Desktop External Hard Drive WDG1U5000", "price": 8.4, "imUrl": "http://ecx.images-amazon.com/images/I/316MQDASC4L._SY300_.jpg", "related": {"also_viewed": ["B0030BBH5I", "B004RUTBIG", "B000XRK3LG", "B000XRMAOE", "B002JMWBRW", "B002QEBMB4", "B0038L3OWO", "B000EVOOO8", "B000WBQOZW", "B001F3YIMC", "B001SJVU6K", "B000WGSAAE", "B00E3RH5W2", "B00834SJSK", "B00F8ZQPWO", "B004CG4WOI", "B005J7YCHG", "B000EXTXSI", "B0062FZ3PY", "B002QEBMAK", "B000VZCEUI", "B0052L77QW", "B000XRI034", "B0041OSQB6", "B000EVOONY", "B002QEBMCI", "B0052L77SA", "B00834SJS0", "B006Y5UV4U", "B00834SJNA", "B00E3RH63A", "B002CZQ4GU", "B001UI49XA", "B002JMYCTC", "B00EAS8AA0", "B002QEBMBY", "B001BKZ8KK", "B005J7YA4G", "B006Y5UPZU", "B005PVXI3A", "B000WBJDUA", "B0062FZ2WS", "B003WV5DMO", "B006B9B2PQ", "B004SH5VQ4", "B00H98AXOE", "B008PQJWBE", "B0041OSAZS", "B00E83X9P8", "B00CO1I29O", "B006Y5UQ3Q", "B0042Z55RM", "B0041OSQBG", "B002KG2LOA", "B005J7YA64"], "buy_after_viewing": ["B0030BBH5I", "B00E3RH5W2", "B004RUTBIG", "B001MSU1HG"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]]}