{"asin": "B000BKN2Y0", "description": "The Garmin StreetPilot i5 Automotive GPS Navigator is preloaded with detailed maps of North America and is ready to use right out-of-the-box. Another great addition to the StreetPilot i-series, the StreetPilot i5 is a compact, inexpensive automotive GPS navigator that helps you get where you want to go while making driving fun.Main menu.View larger.Turn-by-turn directions.View larger.Review turns display.View larger.The StreetPilot i5 packs powerful GPS navigation and a color display into a compact, reasonably priced device.View larger.About the size of a baseball and priced to keep your pocketbook happy, the StreetPilot i5 is perfect for commuters, college students, and corporate travelers who are looking to experience the ease and enjoyment of GPS satellite navigation. Don't let its small stature fool you, though. Although it only weighs in at 5.3 ounces, the i5 has many of the same powerful capabilities as other premium Garmin automotive GPS navigators.The i5 features a unique and convenient click-to-enter scroll wheel and a Back button, which makes it easy to select a destination from the unit's menu-driven interface. This unit includes three-dimensional map graphics and provides voice-prompted, turn-by-turn directions through a built-in speaker. Toss your navigation worries out the window, because the i5 will automatically put you back on course if you miss a turn, and a detour function enables routing around traffic problems or road construction. Plus, if want to stay off the highways and blaze a scenic trail, the i5 lets you prioritize your choice of back roads or major highways. It is handy in any situation. and you can easily move the unit from vehicle to vehicle with the integrated suction-cup mount.The i5 comes preloaded with detailed maps of City Navigator North America NT. These maps feature full coverage of the entire United States, Canada, and Puerto Rico--including nearly six million points of interest (POIs) such as gas stations, ATMs, hotels, restaurants, and other attractions. You can plot up to 500 waypoints with names and an array of graphic symbols for customized, detailed navigation. This unit also comes with removable TransFlash data storage capability and is easy to connect to your PC through the USB interface.As an added benefit, you can even import customized points of interest with the help of Garmin's free POI Loader software. The sky's the limit with this software--you can even upload safety cameras or school zones to receive warnings if you are traveling too fast in these high-risk areas. In addition, an optional proximity-alert feature notifies you of your upcoming custom POIs.With a 32k-color, sunlight-readable TFT display with backlight, the i5 is easy to read in almost any light conditions. Motorists can choose from either a three-dimensional mapping perspective or the standard overhead bird's-eye view. For added convenience, drivers can power the unit with either two AA batteries (up to six hours of typical use) or the included 12-volt adapter cable.What's in the BoxStreetPilot i5, Americas Lite Routable basemap, City Navigator North America NT (preprogrammed), PC/USB cable, 12-volt adapter cable, vehicle suction-cup mount, dashboard adhesive disk, USB drivers CD, and quick reference guide.", "title": "Garmin StreetPilot i5 1.7-Inch Portable GPS Navigator", "price": 79.99, "imUrl": "http://ecx.images-amazon.com/images/I/514R0ZXGN8L._SY300_.jpg", "related": {"also_viewed": ["B0011ULQNI", "B000H866BM", "B0057ODOCA", "B00C9W1LT6", "B002OL2NT4", "B00HK6CPVY", "B001VEJEG0", "B001O7C574", "B0057ODG6Y", "B000A5T7AO", "B00BIZ0EY8", "B0007LJHVA", "B003DQVW00", "B00JB3P9K8", "B00C9W3WNO", "B000OH63MI", "B0002Y22VE", "B0057OCDQS", "B007T9LDU6", "B000NVZE5M", "B000B8AJ2U", "B0015EWMX8", "B0015F1L7A", "B00AY7NSTY", "B001U0O7QW", "B001S2RCWI", "B0057O9ABO", "B0050FXF52"], "buy_after_viewing": ["B0057ODG6Y", "B0057ODOCA", "B002OL2MU4", "B003ZX8B2S"]}, "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]]}