{"asin": "B000HZGQ9C", "description": "High-performance portable storage for your Mac and PC. Light and rugged, it&#x92;s easy to carry and no external power adapter is needed. Comes with sync & encryption and Google software.Pack up your office files and take them home. Carry thousands of songs or pictures. These drives are simple to use, light and easy to carry, and require no power adapter--they are powered directly through the USB cable.Key FeaturesEasy:Installation is a snap because you don't really \"install\" this drive; you just plug it in and it's ready to use. There is no CD to install; the included software loads from the drive the first time you plug it in.Smart:Powered by the USB bus, so no separate power supply needed.Ultra-portable:This ultra-portable drive fits easily in your pocket or purse, weighs only a few ounces and holds tons of valuable data.Synchronized and Secure:WD Sync synchronization and encryption software lets you save your critical data, and take it with you. Plug your drive into any PC, edit files, read e-mail, and view photos. Then sync all of your changes back to your home or office computer. (Windows only)Google software:Search your drive, manage your photos, and simplify Web searches with included Google software. (Windows only).Fast:5400 RPM hard drive &#x96; almost 24% faster than 4200 RPM drives.Stylish:Elegant glossy black case with soft-touch baseCompatible:Use with Windows and Macintosh computersIdeal ForCarrying important files and e-mail between work and home or on the roadSharing large files between office and home, between Mac and PCBacking up your existing notebook hard drive for extra data safety", "title": "Western Digital WDXMS1200TN Passport 120 GB USB 2.0 2.5-Inch Portable Hard Drive", "price": 69.87, "imUrl": "http://ecx.images-amazon.com/images/I/311KJRSEFTL._SY300_.jpg", "related": {"buy_after_viewing": ["B006Y5UV4U", "B006Y5UV4A", "B004CG4WOI", "B003LSTD38"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]]}