{"asin": "B000A3XRSO", "description": "Amazon.com Product Description Conveniently store your entire DVD library (or all your favorite CDs and Super Audio CDs) in the Sony DVPCX995V 400-disc, progressive scan Mega Changer--the perfect tool for organizing your media library as well as providing extraodinary high definition sound and video to your home theater. It up-scales video to high-definition (1080i/720p) resolution and transmits high quality audio through a High-Definition Multimedia Interface (HDMI). It also features a redesigned Disc Explorer on-screen graphic interface, providing intuitive and easy access to the expansive disc library. With the ability to conveniently house and sort through 400 media discs, this cool player can eliminate the need for racks and racks of CD and DVD storage.It features Sony's Precision Cinema Progressive circuitry, Dolby Digital and DTS 5.1 channel outputs, and also offers coaxial and optical digital outputs. It's compatible with DVD-RW/-R/+RW/+R, MP3, JPEG, CD-RW/-R, VCD and SVCD formats--so it can play just about any disc you have from movies and video to music. Other convenience features include multi-disc resume (40 discs), custom parental controls (on all 400 discs), playback memory (400 discs), background graphics that display on your TV while music plays, and a multi-brand remote control.Tech TalkHDMI (High-Definition Multimedia Interface).This is a lossless, uncompressed, all-digital audio/video interface to link any audio/video source (such as a set-top box, DVD player, or AV receiver) with your TV or monitor.Sony's Precision Cinema Progressive. This feature detects image changes at the pixel level versus other types that detect image changes at the scan line level. Separate algorithms are used to process the moving and still parts of an image to achieve sharper backgrounds and moving objects that are free from motion artifacts.SACD (Super Audio CD). Super Audio CD is a high-quality audio disc standard in which music is recorded in the DSD (Direct Stream Digital) format (where conventional CDs are recorded in the PCM format). Using a sampling frequency 64 times higher than PCM and with 1-bit quantization, the DSD format provides both a wide frequency range and a wide dynamic range across the audible frequency range, providing music reproduction that's extremely faithful to the original source.Sony's 3:2 Reverse PulldownDVD mastering introduces a common distortion when adjusting 24 frames-per-second movies to 30 fps video; 3:2 reverse pulldown digitally corrects this distortion, removing the redundant information to display a film-frame-accurate picture. Composite- and S-video outputs bring compatibility with nearly any television.Film and video use different numbers of framesConversion from 24 frames to 60 frames can cause motion blur, horizontal lines that flicker on and off, or an unnatural shimmer.3-2 pulldownThe traditional method for converting film images to video for television: Take one film frame and split it into three video frames. Then take another film frame and split it into two video frames. The video frames are classified as odd or even.DVD players and other electronics then take the 60-frames-per-second video, and send it to a TV for viewing.3-2 reverse conversionThe process of converting 3-2 video back to movie-quality images at 24 frames per second. This allows the DVD player to combine the correct film frames, reproducing the film's original picture quality and texture.Sony's Precision Cinema Progressive technologyPrecision Cinema Progressive technology uses a 12-bit video DAC (digital-to-analog converter) with high-bandwidth, 108 MHz processing to detect image changes at the pixel level, rather than at the level of whole scan lines. That makes this player's picture more faithful to the source--whether film or video--because it uses separate, optimized algorithms to handle different pixel behaviors. Separate algorithms are also used to process the moving and still parts of an image, resulting in sharp backgrounds with moving objects that are free from motion artifacts.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;What's in the BoxDVPCX995V DVD player, remote control, batteries, AV cord, printed instructions", "title": "Sony DVPCX995V 400-Disc DVD Mega Changer/Player (2009 Model)", "price": 14.89, "imUrl": "http://ecx.images-amazon.com/images/I/312ZY1WMF6L._SX300_.jpg", "related": {"also_bought": ["B009D5KSVO", "B002M78J70", "B0000DIK0U", "B00A6SZRT0", "B008JFUS0U"], "buy_after_viewing": ["B0000DIK0U", "B00006I5SQ", "B004RLOPE0", "B004NQU4YY"]}, "categories": [["Electronics", "Television & Video", "DVD Players & Recorders"]]}