{"asin": "B001G5ZTPY", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Manufacturer DescriptionAdvanced amateur photographers are a discerning group, and they&rsquo;ve flocked to Canon&rsquo;s G-Series for its ability to meet and exceed their demands. The third-generation PowerShot G10 is a stunning successor, loaded with uncompromising specs like 14.7 megapixels, a 28mm wide-angle lens, and Canon&rsquo;s new DIGIC 4 Image Processor for notably improved face and motion detection. This is a camera that supports and nurtures creativity, with a full range of shooting and recording modes and compatibility with exciting accessories including Speedlite flashes.PowerShot G10 Highlights14.7-megapixel resolution14.7-megapixel digital camera for the highest image qualityThe PowerShot G10 is equipped with a 14.7-megapixel CCD. Combined with unsurpassed DIGIC 4 image processing, this impressive pixel count delivers richly detailed photos that resonate with lifelike depth from shadows to highlights.An important benefit to the G10&rsquo;s lofty pixel count is the flexibility it lends to the editing process. With 14.7 megapixels of resolution, any portion of any shot is a great candidate for enlargement. Enlarge and crop as your creative vision demands, confident that the detail you need is there for you.High-powered 5x optical zoom with Optical Image Stabilizer plus a 28mm wide-angle lensThe camera is equipped with a long 5x optical zoom, and Canon&rsquo;s own Optical Image Stabilizer Technology keeps images steady and blur-free all through the zoom range--even in low light--by detecting motion and generating a corrective signal. Because it is an optical system, more corrective movement is allowed and there is no degradation of image quality.New DIGIC 4 Image Processor improves Face Detection, adds Servo AF, Face Detection Self-Timer and Intelligent Contrast CorrectionDIGIC 4 Image ProcessorCanon&rsquo;s proprietary DIGIC Image Processors have long set its cameras apart from the competition, and the new DIGIC 4 sets the bar even higher. Faster, more accurate noise reduction delivers better image quality, even at high ISO speeds.iSAPS Technologyis an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the advanced DIGIC 4 Image Processor to improve focus speed and accuracy, as well as exposure and white balance.A newFace Self-Timerautomatically detects an increase in the number of faces and makes the appropriate adjustments. For instance, to include photographer&rsquo;s face in a group shot, there&rsquo;s no need to rush in. Just put the camera on a stand or tripod, and specify Face Self-Timer, and the camera will wait for the photographer&rsquo;s face to get on-camera before it takes the shot. Motion Detection now tracks moving subjects in a much larger range, and the new Servo AF retains focus on a moving subject after the shutter button is pressed halfway -- allowing you to wait for the perfect shot without refocusing. Also, Face Detection and Motion Detection are markedly improved.Intelligent Contrast Correction in actionIntelligent Contrast CorrectionDIGIC 4 also makes possible the new i-Contrast (Intelligent Contrast Correction) system, which controls the compensation level in pixel units to brighten dark areas while leaving bright areas unchanged for better images where the main subject is dark, and more natural transition. The PowerShot G10 can even use i-Contrast in playback mode to adjust images that were shot without the setting activated.Red-eye Correctionprovides three options for removing red-eye from subjects in flash pictures.1) The Red-eye Correction during shooting actually identifies and corrects red-eye in human subjects as pictures are taken.2) The G10 can be set to automatically detect and correct red-eye during image playback.3) You can manually locate any red eyes in a scene during image playback on the LCD screen, and command the camera to remove them.Life doesn&rsquo;t give you second chances to capture special times. That&rsquo;s why the G10 features ISO 1600 and High ISO Auto settings that reduce the effects of camera shake and sharpen subjects in low-light situations, giving you greater shooting flexibility. ISO can be expanded to 3200 when you select ISO 3200 Special Scene mode.Full range of shooting and recording modes including RAW + JPEGThe PowerShot G10&rsquo;s RAW mode lets you shoot images without JPEG compression. It gives you clearer images and complete creative control in editing. RAW images are transferred directly to the computer where they can then be edited using image adjustment software or a processing application to adjust your images as you please. The camera can also be set to allow the simultaneous recording of both RAW and JPEG images while shooting.Also, with 26 Shooting Modes including 17 Special Scene Modes, you&rsquo;re ready for whatever shot comes your way.Large 3.0-inch PureColor LCD IIThe PowerShot G10 gives you an extra-large 3.0-inch LCD screen for excellent control when framing your shots. But size is only part of the story. Canon&rsquo;s PureColor LCD II offers more spectacular color, resolution and contrast even at an angle (compared to PureColor LCD). The screen is highly durable and easy to see in any light with a scratch-resistant, anti-reflective coating. It is a perfect feature for gathering friends and family around to see your images.A wealth of accessories including optional Speedlite flashesThe PowerShot G10 is compatible with the Speedlite EX series that is for all EOS series SLR cameras. Attach a Speedlite 580EX II to the hot shoe, then you can set and control the flash on the \"Flash Control\" menu in the camera. With the 580EX II, the G10 is given extra functions such as autoflash metering, FE lock and Flash exposure compensation; continuous shooting with external flash. Also Canon&rsquo;s Speedlite Transmitter ST-E2 enables you to have multiple slave flashes and wireless control. A Tele Coverter lens designed for the G10 and High-Power Flash designed for all PowerShot cameras are also available.Print/Share Button for easy direct printing and downloadingThe PowerShot G10's Print/Share button makes direct printing easier than ever. Simply connect the G10 to a Canon PIXMA Photo Printer or SELPHY Compact Photo Printer or any PictBridge compatible photo printer, press the lighted Print/Share button and print! Also use the Print/Share button to transfer images to a computer (Windows and Macintosh).Print your own ID photos in up to 28 different sizes or use the Movie Print function to output multiple stills from a recorded movie on a single sheet with a Canon SELPHY Compact Photo Printer.What's in the BoxPowerShot G10 Camera bodyNeck Strap NS-DC8Battery Pack NB-7LBattery Charger CB-2LZAV Cable AVC-DC300Interface Cable IFC-400PCUDigital Camera Solution Disk", "title": "Canon Powershot G10 14.7MP Digital Camera with 5x Wide Angle Optical Image Stabilized Zoom", "price": 499.0, "salesRank": {"Camera &amp; Photo": 4059}, "imUrl": "http://ecx.images-amazon.com/images/I/41C6ZZtLQlL._SX300_.jpg", "related": {"also_bought": ["B001G5ZTRM", "B001G5ZTV8", "1600595405", "B002LCT96Q", "0321679512", "B002TWYVVQ", "B008515KOM", "B009EJN2K8", "B002SK7UB2", "1435455355", "B001G5ZTSQ", "B0026MTCFY", "B001NJHZM8", "B001GN7A8A", "B004PX56TI", "B008514RSC", "B003HMRG2I"], "buy_after_viewing": ["B00EFILHB4", "B003VNKNF0", "B001G5ZTRM", "B003VNKNEQ"]}}