{"asin": "B007TSDQUM", "description": "The Accessorise (TM) Capacitive stylus pen works on all capacitive touch screens. This is the Latest and Newest Design in the market which is longer, skinnier, and easier to control and use.The dimensions are 5.06 in length, and the diameter of the capacitive rubber tip is no bigger than 1/2\" for improved and better accuracy. The rubber tip is durable and soft which will not scratch the screen. A removable tether is included with the stylus pen, which can be attached to the iPad by plugging it in the earphone jack, to carry the stylus pen with ease. The Accessorise (TM) Capacitive stylus pen is perfectly sized and shaped, and is designed to feel like a pen in the hand.Most people who purchase the iPad can start using their fingers right away to access the touch screen capabilities of the device.However, there are several reasons and advantages that you would want to use an iPad capacitive stylus pen:* Touch screens get dirty quickly when fingers are used on them, especially children's fingers!* Allows finer motor control, improving note-taking and sketching/drawing ability.* Many people find it easier to use touch screen keypads and buttons using a stylus as a finger substitute.* It doesn't cost a lot to purchase a capacitive stylus pen, and it can allow you to use the iPad in new and creative ways", "price": 0.88, "imUrl": "http://ecx.images-amazon.com/images/I/317sF-DbfEL._SY300_.jpg", "related": {"also_bought": ["B004HBK4T0", "B004HC2PA0", "B008YO0Q5S", "B00575OL6M", "B0092KRAXY", "B0092KRAXO", "B00BEL86A0", "B008U50ZUW", "B00BEL86WI", "B004O9A8FU", "B00E1L3LJ6", "B00FMGZ5CK", "B004GCJEZU", "B009BTMVMQ", "B00BPK597I", "B008M9XXZK", "B00B3O5CMS", "B007FXMOV8", "B00BFYUWZI", "B0023FTRUO", "B00AAKLF22", "B0085V7CHA", "B008MOHLVC", "B0059KTEBC", "B005GI2VMG", "B006PL97C0", "B002BBJMO6", "B00EL94Z4I", "B005QX7KYU", "B00G2SMMWI", "B005Y1CYSQ", "B007E36ZGO"], "buy_after_viewing": ["B00575OL6M", "B0092KRAXY", "B004GCJEZU", "B0092KRAXO"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Input Devices", "Digital Pens"], ["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Cases & Sleeves", "Cases"]]}