{"asin": "B003DQPE40", "description": "iPod touch users can now get GPS navigation* thanks to the built-in GPS receiver of the TomTom car kit and enjoy a full in-car experience; from safe and secure docking all the way to playing your favorite tunes over your car stereo.Give your iPod touch secure docking, GPS capability, and more.Specially designed mount fixes your iPod touch securely to your windscreen or dashboard.Built-in speaker for hearing instructions clearly.Line-out plug and USB port for charging.*Note: TomTom GPS application must be purchased separately. Requires compatible car audio system and audio cable.Built-In GPS ReceiverThe TomTom car kit has a built-in GPS receiver, which provides your iPod touch with the capability of a GPS device. The receiver gives your device a reliable signal - even when driving in high-rise urban areas.Secure DockingKeep your iPod touch secure while you're on the move. Our specially designed award-winning EasyPort mount attaches your iPod touch securely to your windscreen or dashboard--perfectly within reach. It lets you rotate the screen for exceptional widescreen route display. And it folds flat, so moving it from car to car is easy and simple.Clear Voice InstructionsWith built-in volume controls and its superior speaker, you'll hear every voice instruction loud and clear--so you'll never miss a thing.Charges iPod touch While DrivingAlways on the go? Dock your iPod touch in the mount to charge it as you drive, so it will always be fully charged and ready to go, wherever you're going next.Rotates for Optimal PositioningView your route in either portrait or landscape mode. The TomTom car kit rotates easily, in order to give you the view you prefer.Line Out for Music Playback*Enjoy the perfect driving soundtrack. Play all your favorite songs through your car's audio system with the optional audio cable*. It even fades music out when receiving calls and giving directions.CompatibilityWorks with the iPod touch 1st generation (8GB, 16GB, 32GB); iPod touch 2nd generation (8GB, 16GB, 32GB, 64GB); with iPhone OS 3.0 or later. Designed to work with the TomTom app for the iPhone and iPod touch.*Note: Requires iPod touch OS 3.0 or later.SpecsDimensions: 5 1/8\" x 2 3/4\" x 2\"Weight: 4.1 ozGPS receiver: SiRF star 3Speaker: 300 to 15 kHz/ 2.0 WattMicrophone: -44 +/- 3 dBvOperating temperature: 14 to 131 degrees FDock connector: 30 pin Apple connectorAudio out: 3.5mm audio outVolume control: YesPortrait/landscape support: YesWindshield and Dashboard mounting: YesiPod touch charging via CLA: YesWhat's in the BoxCar Kit for iPod touch, USB Car Charger, Adhesive Disks, DocomentationAbout TomTomFounded in Amsterdam in 1991, TomTom has established itself as a global leader in navigation by being an innovative company with a strong brand, clear customer focus, and high quality products and services.TomTom is the world's leading navigation solutions provider with navigation products sold in 30 countries and in over 20 languages. To further our commitment to car navigation, TomTom acquired Tele Atlas maps in 2008 so we can continually provide the most up-to-date maps and intelligent routing.We have our own mapping company!Did you know that every year roads change by up to 40% in high-growth areas? Tele Atlas manages this by using the world's most comprehensive systems to identify and incorporate these changes into our maps with unprecedented levels of speed and accuracy. All TomTom devices benefit from the Tele Atlas advantage--more coverage, more points of interest, and more freshness and accuracy.Why TomTom?At TomTom, we believe that personal navigation should be as easy and safe as possible. We develop smart technology that gives you straightforward solutions, innovations to make life easy.", "title": "TomTom Car Kit for iPod touch (compatible with 1st and 2nd Generation)", "price": 12.89, "imUrl": "http://ecx.images-amazon.com/images/I/41CQQ-ZWKVL._SX300_.jpg", "related": {"also_viewed": ["B0035Y7ZJ2", "B003YLS7AC", "B008J0ZSTQ", "B00BIZ0EY8", "B00HK6CPVY", "B003UES8D4", "B005I0JYUY", "B0066IUPS2", "B004MYFTFQ", "B002WN30IM", "B006M49G80", "B00171BFVO", "B007PPYXOC", "B00I5WEZ06", "B007M4Z60Q", "B007PSPQ7W", "B00G2BX616", "B004G1L52Q", "B007M52QEE", "B00F0IQTE8", "B00BHAC85W", "B007M4Z7GO", "B00AXX0I6A", "B00CRQUKQ4", "B00AXX0I7Y", "B00AXX0JOQ", "B00AXX0IC4", "B0057OCS9A", "B00AXZWG8Q", "B00AXX0IEC", "B004ZSGAMU", "B00AXX0I88", "B0057OCDQS", "B007FHX9OK", "B00DVFLJKQ"], "buy_after_viewing": ["B001H4B0AC", "B0035Y7ZJ2", "B003YLS7AC", "B00A46PWCG"]}, "categories": [["Electronics", "Car & Vehicle Electronics", "Vehicle Electronics Accessories", "Audio & Video Accessories", "Audio Car Mounts"]]}