{"asin": "B0029U0XF6", "description": "Expand your creativity with the revolutionaryHVL-F20AM compact external flash, which extends illumination range beyond the camera's built-in flash. Bounce flash enables shadow-less indirect lighting while TTL (through the lens) flash exposure is automatically controlled by your ? DSLR for easy and intuitive operation-all in an ultra-compact design which folds flat when not in use.FEATURES:Extends flash range beyond camera's built-in flash -Though compact and lightweight, the HVL-F20AM has a maximum range twice that of the built-in flash units on ?230, ?330 and ?380 cameras. This is represented as the guide number (GN) of 20 with a 50mm focal distance at ISO 100.Easy intuitive operation -Unlike most external flash units, the HVL-F20AM has no dedicated ON/OFF switch. Instead, power is automatically switched on simply by raising the flash unit into the shooting position. In addition, a switch on the side of the unit offers Indoor and Outdoor settings, making it easy to obtain flash illumination that suits the shooting situation. A charging lamp indicates when the flash is ready to fire.ADI Flash Metering System -The ADI (Advanced Distance Integration) flash metering system offers the optimum flash metering and automatic white-balance compensation regardless of the background conditions or the subject's reflectance. ADI flash metering works in combination with ? cameras and lenses that incorporate a distance encoder. When used with these lenses, the camera calculates a guide number to control TTL (through the lens) flash metering. This guide number is calculated according to distance from the subject, ambient light and pre-flash reflectivity of the subject and the background.Bounce flash enables shadowless indirect lighting -When set to", "title": "Sony HVLF20AM TTL Digital Flash for Sony Alpha Digital SLR Cameras", "price": 148.0, "imUrl": "http://ecx.images-amazon.com/images/I/41CYHm2OYuL._SY300_.jpg", "related": {"also_bought": ["B0097DFTDY", "B003OBUJIK", "1133597459", "B003MQWN40", "B005IKZU8O", "B005IHAIEI", "B0097DFRMC", "B005K8AUE8", "B000UPNQCY", "B0040RWN0O", "B003URJP5Q", "B007ZE9JD8", "B00836H2DQ", "B005IHAI8O", "B004YEZGIO", "B00FSB76XA", "B0029U0X24", "B00004ZCJF", "B003NRHAH8", "B00440D7S4", "B005NX7HY6", "B005IHAIKM", "B003Q0BPC8", "B003U2YCZE", "B0042GFYLI", "B0042GHI8U", "B0049WBZEK", "B001BRP0UG", "B003WO7MZC", "B0096W1P6G", "B00GSAEN4A", "B003UREE7K", "B00ENZRPG0", "B006BGSYXC", "B0000BZL2Y", "B0096W1P5W", "B003XP9G6S", "B0054I54JU", "B0012DHL10", "B007PCP47A", "B0099YS6WW", "0321968603", "B003LYKLCO", "B00FSB79KU", "B0096W1PG6", "1937538117", "B0096W1ONK", "B00CQF4TH2", "B005K8AUYI", "B00ENZRQH8", "B008IJ610S", "B008OMOEO4", "B0078ZYBP0", "B007PCP2OU", "B002MPPRNQ", "B0016120M8", "B0097DFR8G", "B00DQI00EY", "B000JC5GSK", "B0042UC5BG", "B005KG3KNI", "B00I8BICCG", "B009UOI9QY", "B001KNDWRY", "B00004ZCJH", "B009ECEZLK", "B007AJHGC4", "B0086UXT9K", "B005D6C14Y", "B005K8AUMK", "B004EBZZX8", "B0029U0X1A", "B0089KJSKQ", "B0051GXAYQ", "B00FRDUZUK", "B00GTXHQ8Q", "B003Y302CQ", "B0000BZL7S", "B006OGD8XK", "B008IYF3SO", "B00FSB799Q", "B00836H3M6", "B005JFWKKY", "B003VAMZK4", "B00BJGNRR2", "B000JC5SOM", "B002EASYPW", "B0058MJX3U", "1133597122", "B008B488DI", "B0012M1LEE", "B00564BXJC", "B000H02B6O", "B000DZH9H4", "B004FN1W2S"], "buy_after_viewing": ["B00BJGNRR2", "B0099YS6WW", "B0097DFTDY", "B003OBUJIK"]}, "categories": [["Electronics", "Camera & Photo", "Flashes", "Shoe Mount Flashes"]]}