{"asin": "B0000A0MDV", "description": "Are you searching for a driving game that offers more than just breakneck speed? Look no further than Gran Turismo 4. The most recent installment in this amazingly popular racing game brings realistic driving to a whole new level. With loads of new cars and a vastly improved physics engine, you'll be ready to tackle the roads in your favorite cars from the last century.The CarsAutomotive history is at your fingertips with Gran Turismo 4. You can select from over 700 cars, dating back nearly a century to the 1915 Ford Model T Tourer. From the United Kingdom's AC to Sweden's Volvo, you'll can choose from practically every car manufactured since 1915.Beyond the list of cars, GT4 sports a new and vastly improved physics engine. Offering even greater realism than its predecessors, the GT4 engine has been meticulously designed to cover every inch and turn of your driving experience. Using physics to calculate weight, speed, friction, and a host of other nuances, every car delivers performance with its own unique, precise handling and feel.This game isn't just about the cars, though -- it's also about the competition. The advanced, lifelike drivers compete with fervor unmatched even by some of your video game buddies. Fueled by the latest advances in artificial intelligence, your digital rivals will react to your every move with behavior modeled after actual professional racers.It may take you weeks to test drive all 700 available cars, but with Gran 4 you'll never truly run out of \"new\" vehicles. This game is equipped with a multitude of options to customize your favorite cars. Brakes, shocks, and engine components can all be upgraded. You can stylize your car with wings, rims, and color, and you can even change your oil. In short, you can do whatever needs to be done to keep your car tuned and looking hot for the next big race.The Human ElementGran Turismo 4 brings something completely new to your gaming experience. In the stands you'll find spectators who comes to life in 3D before your very eyes. They react with genuine human emotions to your every move, cheering as you pass, and snapping photographs as you cross the finish line. Your next pit stop will take place as if you were really there. You'll watch the process unfold in real-time as your crew rushes to change your tires and refuel your tank. But that's not all. With the new addition of convertibles, you are trulyinthe drivers seat. Your drivers will react with precise and fluid motions, and turn just as you would if you were behind the wheel. Gran Turismo has never looked so unbelievably real.The CoursesNot only does GT4 bring you the rare opportunity to drive hundreds of cars, it also offers you a vast collection of actual racing locations. Rip through the exotic Costa di Malfi in Capri, burn rubber through the urban jungle of Hong Kong, or throw up some serious dust at the Grand Canyon -- no matter where you decide to race, you'll love driving any of the game's fourteen tracks. Feeling nostalgic? With Gran 4, you can even race on some of your old, favorite tracks from previous editions.LAN PlayCompete against your buddies with the LAN play functionality of GT4. Connect up to three PlayStation 2 consoles and bring together up to six players in a racing frenzy that pits you against your friends. Each console will need a copy of Gran Turismo 4, the proper connecting cables, and all the standard gaming equipment. Once connected, you'll be ready for a life-like battle of driving abilities and mental toughness. With LAN play, the action has never been more intense or more realistic!", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51AmDdX%2BR0L._SY300_.jpg", "related": {"also_bought": ["B0000503MO", "B00006Z7HU", "B004Z4ZJMQ", "B000TLU67W", "B000EMJA3M", "B000G79YNQ", "B002I0H0SA", "B001MW91IW", "B00004YRQA", "9629971372", "B004S3KB6S", "B004F14XB2", "B00000DMAU", "B0038N09Q6", "B000034DC7", "B00004YRQ9", "B0015Z1I4G", "B0002IQCSY", "B000RHZJK2", "B008MO6BJU", "B0013JHKU0", "B0013KW1B2", "B000C4088I", "B0013OM528", "B0009J1IJO", "B0000C7GHG", "B000WE8JES", "B00005MDZD", "B00005R5PO", "B003OPX7K8", "B0032GTMEE", "B000GPXS9Y", "B00008NRM7", "B00008DHNV", "B001MW3TS0", "B003IMAML4", "B000A32O4W", "B0006JMLMK", "B000CC5CVI", "B00005V6BE", "B0000C4M22", "B000TYQL1O", "B0032GPYO6", "B0002HLKIC", "B00009WAVI", "B00647631I", "B003VJO0OY", "B000M4H6RE", "B0032GVBO8", "B002BWS5QG", "B0015ACX3Q", "B000RATCJI", "B000ANPQLU", "B002J9QIWY", "B00000IZS1", "B0045L3SNQ", "B000TP2V1M", "B00067MX98"], "bought_together": ["B000TLU67W", "B001MW91IW"], "buy_after_viewing": ["B000EMJA3M", "B0000503MO", "B001MW91IW", "B00004YRQA"]}, "salesRank": {"Video Games": 1787}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "More Systems", "PlayStation 2", "Games"]]}