{"asin": "B000ZK9QD2", "description": "The wait is over,Gears of War 2has arrived. Ever since the original was released, fans have clamored for this sequel. Developed exclusively for the Xbox 360 by Epic Games,Gears of War 2, which has already garnered several awards, picks up six months after the events of the blockbuster originalGears of War. Players are thrown back into the role of Marcus Fenix, leading the battle for humankind's survival against the Locust Horde. With innovative third-person tactical action gameplay and unsurpassed high-definition graphics,Gears of War 2is a must-have game for the Xbox 360..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Gears of War 2Players:Offline: 1-4Online: 10Gameplay Modes:Single player, competitive multiplayer, cooperative multiplayer, system link multiplayer, online multiplayer with voice support.Format:16:9 Widescreen on HDTV 480p, 720p, and 1080i.Gears of War 2 offers stunningly realistic, vast environments to play in.View larger.The enemies in Gear of War 2 are huge and downright nasty.View larger.Huge Environments, Bigger GameplayFor those who lovedGears of War,Gears of War 2builds upon it in every way, but with several major enhancements. There are more weapons, bigger vehicles, and more action. The enemies are more dangerous, and the total experiences is more immersive than ever. And with a revolutionary tactical combat system, the game will require not just fast reaction times and shooting skill, it will also challenge you to devise a strategy that will work against the enemies who exhibit smart AI.Jaw-Dropping, Realistic GraphicsJust asGears of Wardid the first time around,Gears of War 2ups the ante for graphical prowess. Combined with the sweeping vistas and evocative locales of Sera, where the story takes place,Gears of War 2offers jaw-dropping graphics that are made possible through advances in Unreal Engine 3. New visual effects include ambient occlusion, dynamic shadows, improved character lighting, the ability to render hundreds of on-screen characters simultaneously, improved water physics, additional blood and bullet decals, advanced destructible environments, new weather effects, and the introduction of fluid objects.Immersive, Gripping StoryTaking place six months after the end of the first game,Gears of War 2returns the cast of characters of the original, including Marcus Fenix and Dominic Santiago, as well as several newcomers.Novelist and comic book writer Joshua Ortega, who assisted with the writing, has created a story that is big on character development and personality. With a new in-game conversational camera system and multiple story arcs, the story is presented in a gripping cinematic style where characters gain an emotional depth that matches their realistic graphical representation.More Characters, Upgraded Vehicles, Badder WeaponsThose who were impressed by the originalGears of Warwill be in for a real treat. New characters such as Tai Kaliso, weapons like the burst pistol, and huge vehicles like the COG Centaur tank will give players a whole new dimension and scope of gameplay in both single-player and multi-player modes.Multiplayer Action with Xbox LIVE!Gears of War 2features a multiplayer mode that allows up to 10 simultaneous players for outstanding multiplayer fun. Taking full advantage of the Xbox LIVE service, which boasts 10 million gamers,Gears of War 2features both competitive and cooperative multiplayer gameplay. Setting up games is simple with LIVE, and you have the ability to drop in and out of co-operative campaigns at any time.Everything you loved about multiplayer in the original is back, including the classic death matches, but with this sequel there is an added emphasis on teamwork. New multiplayer game modes will require better coordination in order to win. The game also features voice support, so you can communicate with other players around the world -- whether you're on the same team or trash talking!Gears of War 2won several awards at E3 2008, where it was first presented, including Overall Best Shooting Game and Overall Best Graphics Technology of E3 2008 from IGN, as well as Best Action Game of E3 2008 from the Game Critics Awards.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/514Ec9fS6GL._SY300_.jpg", "related": {"also_bought": ["B000FRS9II", "B002I0H79C", "B001A4MTGS", "B002I0H2AG", "B000FRU0NU", "B002BSA20M", "B001HWB68K", "B000HCQK0A", "B000RHZ9JI", "B00AYSV89K", "B002DC8GKE", "B0050SYX8W", "B001TOQ8J8", "B0050SYY5E", "B00269QLI8", "B000TG530M", "B0050SY4DG", "B000F3AADE", "B000TI836G", "B000FRU1UM", "B003O6G5TW", "B002BSA1MQ", "B001AWIP68", "B000A0EFJW", "B00503E8S2", "B003JVKHEQ", "B003Q53VZC", "B000SQ5LQ4", "B002BRZ852", "B000MKA60W", "B001AWIOYG", "B0037LTTRO", "B000G75AXY", "B00269DXCK", "B002I0JGDM", "B000OLXX86", "B000WSE2WM", "B0025KZV7A", "B00008J7NZ", "B001QXNBJM", "B001E8VB3C", "B000H94PVO", "B00354NAYG", "B000FRVAD4", "B0016BVYA2", "B000P46NMK", "B004UDLRMS", "B000X1PE16", "B000QY9C90", "B0002SQ0BS", "B000FRVCAA", "B000WMEEB2", "B002I0JAVK", "B0017HW5LM", "B00309U0M6", "B0050SYLRK", "B0050SYFM6", "B0016B28Y8", "B003L8HQ7S", "B001SH7YMG", "B004QEV0MI", "B005C2D2MO", "B000ZK6950", "B000G7PMXC", "B000P297E8", "B000WEQL02", "B000CBVC0Y", "B0023CBY4E", "B002BRZ8BQ", "B003O6G790", "B0050SY5BM", "B000HX1P72", "B000UU3SVI", "B003C1I0CO", "B000HKGIOA", "B0022TNO7S", "B000LSERQE", "B001ASJISG", "B0050SY9WC", "B0086V5V9A", "B000XJO7A2", "B001REZLY8", "B0085CA8NY", "B002EE5ROO", "B001TORSII", "B005YR1VP2", "B004PAGJOC", "B003P9C6QY", "B00006JZQZ", "B000HCL5QO", "B002I0JA7E", "B000FQBF1M", "B007XVTR3K", "B0050SY77E", "B000ZK696O", "B0050SWVIQ", "B000R0SS3Y", "B0009S4UOA", "B0016NRS28"], "bought_together": ["B000FRS9II", "B002I0H79C"], "buy_after_viewing": ["B002I0H79C", "B000FRS9II", "B004JSDQPU", "B001A4MTGS"]}, "salesRank": {"Video Games": 2129}, "categories": [["Video Games", "Xbox 360", "Games"]]}