{"asin": "B001DTTCQA", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "From the ManufacturerCanon HD Video LensThe Canon HG20 AVCHD Hard Disk Drive camcorder sets a new standard for High Definition, delivering optimal image quality, long shooting times along with the extraordinary ease and versatility when viewing video on television or a computer. Capture amazing HD video with even greater detail and color reproduction with its innovative 24Mbps capability, and the addition of a video-capable SDHC card slot plus the extended 60GB internal Hard Disk Drive allows you to now record up to 22 hours of video onto the internal Hard Disk Drive so there&rsquo;s no need to worry about running out of space. And, like all Canon VIXIA camcorders, the HG20 features: a Canon HD video lens, FULL HD CMOS Sensor, and Canon&rsquo;s exclusive DIGIC DV II image processor. Create the look and feel of Hollywood movies with the 24p Cinema Mode and even use Canon&rsquo;s select Photo Grabbing function to capture still images from previously recorded video. If online video posting and sharing interests you, the HG20&rsquo;s 30p mode provides the perfect frame rate for the web and delivers clarity for fast-action subjects.The HG20 offers the unparalleled combination of Canon&rsquo;s exclusive SuperRange Optical Image Stabilizer to stabilize a wide range of movements and Instant AF for accurate focusing that&rsquo;s critical when shooting in HD. The HG20 features the latest HD technology, excellence in Canon optics and engineering in a compact, sleek design that delivers the high level of performance you&rsquo;ve come to expect from Canon.Canon HG20 HighlightsRecord Up to 22 Hours of High Definition Video to a 60GB Hard Disk DriveFor the first time from Canon comes a large-capacity hard disk drive camcorder. HG20 enables extended high definition videos to be recorded. There is no longer any fear of missing those precious scenes when replacing recording media. Enjoy the great convenience of no longer needing to purchase and carry recording media. And with the ability to record up to 22 hours of video without having to empty your camcorders&rsquo; hard drive; you can keep the action going for much longer than ever before.Genuine Canon 12x High Definition Video LensThe HG20 comes equipped with a 12x HD Video lens. An aspherical lens is used to help achieve low aberration and high resolution. The lens also features super spectra coating technology which lowers flare and ghosting. A gradation ND system is used for better exposure in bright shooting situations. This lens design creates true HD image quality.RGB Primary Color FilterWhether you're shooting video or photos, you will appreciate the HG20 stunning, high-definition image production. For rich, accurate color, the HG20 uses an RGB Primary Color Filter. It separates light into red, green, and blue color components, resulting in vibrant images with natural-looking tones similar to what you&rsquo;d obtain from 3CCD camcorders.Canon 3.3 Megapixel Full HD CMOS Sensor (1920 x 1080)The HG20 features a newly developed; Canon manufactured HD CMOS Image Sensor. Similar to its use in Canon's EOS Series Digital SLR Cameras, the CMOS Sensor reproduces high resolution images as true HD movies. Canon's HD CMOS Sensor acquires image information at 1920 x 1080 pixels. Canon&rsquo;s HD CMOS Sensor also features on-chip noise reduction technology. This low noise technology feature means that even in dimly-lit scenes, the signals from each pixel are as pure as possible, with minimal 'noise' or other aberrations.DIGIC DV II Image ProcessorDIGIC DV II is the latest generation of Canon's exclusive DIGIC DV signal processing technology designed specifically for HD. Thanks to DIGIC DV II image processing, the HG20 produces video with improved color reproduction -- especially in skin tones, and dark and light scenes. It also uses a hybrid noise reduction system that employs two types of noise reduction -- for images that are crystal clear. Since video and still images have different color requirements, DIGIC DV II HD digital signal processing ensures optimal image quality for both HD video and still images.1920 x 1080 Full HD RecordingThe Canon HG20 not only captures images in Full HD, but records and outputs 1920 x 1080 as well, so you get Full HD from lens to screen. Experience the ultimate in clarity and detail.Instant AF (Auto Focus)Instant AF is Canon&rsquo;s new and advanced autofocus system required for High Definition. Using a Hybrid Control system, the Instant AF makes it easy to focus on previously difficult subjects. It dramatically decreases the time it takes to achieve proper focus and increases accuracy especially in low-light and high-brightness situations.SuperRange Optical Image StabilizerThe HG20 features Canon&rsquo;s SuperRange Optical Image Stabilization (OIS). Utilizing a Hybrid detection method (combining vector and gyro detection method) corrects camera shake instantly for steady shots. And unlike other optical stabilization systems, Canon's Super Range OIS covers a wide range of movements while preserving image quality. It is even effective while taking photos.24Mbps RecordingOffers the highest bit rate in AVCHD for High Definition video that captures extraordinary lifelike tonal quality and exceptionally fine detail.24p Cinema Mode24p Cinema Mode is a feature demanded by professional filmmakers and previously, only available on pro-level camcorders. 24p Cinema Mode enables all aspiring movie makers achieve a professional 'film-look'. This mode is actually two different features, which can be used independently, or together, depending on the user&rsquo;s preference.1. The captured frame rate changes to 24p -- the same frame rate as movie film.2. The HG20 changes the color and tonal characteristics to make you feel like you are watching a movie in the theatre.30p Progressive Mode30p Progressive mode is a progressive format that is the perfect frame rate for the web because it delivers clarity for fast-action subjects. Plus, it is ideal for displaying crisp images on your home theatre system or computer monitor. Before now 30p was exclusively featured on pro-level camcorders but Canon now offers the widest frame rate options for every videographer. (Note: Records in 60i onto memory card.)Mini Advanced Accessory TerminalThe Advanced Accessory Shoe allows the use of additional accessories such as Canon's video light and directional microphone. Compared with Canon&rsquo;s original Advanced Accessory Shoe, the new version is 50% smaller in size.Intelligent Lithium-Ion BatteryThe remaining battery time is now indicated down to the minute, so you will never have to guess the recording time available.3.1 Megapixel PhotosBuilt directly inside your HG20 is a fully functional digital camera, capable of capturing stunning 3.1 Megapixel photos. You have the option of storing these pictures directly to the internal Flash Memory or the optional SDHC memory card.HDMI (High-Definition Multimedia Interface Terminal)HDMI Terminal transports high definition video signal with audio in one cable to your HD Television. The new standard in HD connection.2.7-Inch Multi-Angle Vivid Widescreen LCDThe HG20 is equipped with a Multi-Angle Vivid LCD. This screen offers two key advantages for easy, flexible operation.1. A wide viewing angle - view from any direction2. A wide color range - provide robust, accurate colorMicrophone Terminal with Audio Level ControlThe HG20 features a microphone terminal for attaching an external microphone. The audio level can be manually adjusted for greater flexibility. A level meter is shown in the LCD screen.One Touch Power ButtonPower your camcorder with a touch of a button just like a digital camera.Built-in Auto Lens CoverA built-in electronic lens cover automatically opens when the camcorder is turned 'On' and closes when turned 'Off'. There is no dangling lens cover to lose.Quick StartInstead of powering your camcorder off between shots, simply close the LCD to activate the Quick Start function which puts the camcorder in stand-by mode. Quick Start considerably reduces the power consumption of the battery and allows the user to return to recording mode in less than a second, so you&rsquo;ll never have to miss another special moment.Program AE ModeThe HG20 gives you a choice of settings that automatically result in the best exposure for different conditions. Scene modes include: Portrait, Sports, Night, Snow, Beach, Sunset, Spotlight, and Fireworks. Each adjusts your camcorder's settings to compensate for different lighting conditions and different subjects.Simultaneous Photo ShootingWhile shooting an HD movie, you can simultaneously capture photos to a memory card by simply pressing the photo button. It's perfect for anytime you don't want to miss a moment.Headphone TerminalThe audio/video terminal doubles as a headphone terminal for monitoring sound while recording.Focus Assist functionWhen shooting in high definition, a properly focused subject is more critical than ever. With one push of the Focus Assist Button (during manual focus setting), video zoom (that enlarges the on-screen image of your subject) is displayed. Not to worry, this is automatically cancelled when recording is started.It's easy to keep your HG20 levelfor more professional looking video. Simply press the Level Shot Control button, and a horizontal marker appears in your viewfinder. Then line up any horizontal lines in your shot to the marker and you know your camcorder is level. The Grid marker is also very convenient for setting up the special balance in your shots. And since background colors vary, you can select from two line colors to make the lines easily visible.Smooth Zoom ControlWith this innovative feature, you can always be sure of smooth, steady, professional looking zoom shots. Simply select one of three pre-set zoom speeds. You can also select variable so you can control the speed manually.3.1 Megapixel PhotosCapture stunning 3.1 Megapixel photos in 4:3 aspect ratio to an SD card (2.07 megapixel at 16:9).Photo GrabWith this professional level feature, capture photos during playback. With one push of a button you can 'grab a 2 Megapixel (1920 x 1080) still from your HD video footage. There is no need to worry about taking a photo while you&rsquo;re shooting.9 Point Ai-AF ModeAuto Intelligent Auto Focus ensures sharp images and gives creative flexibility. Even when your subject isn't in the center of the frame, the HG20&rsquo;s Ai-AF function will automatically select from 9 focus areas on screen to help bring images into sharp focus.Built-in FlashCapture superb images in low light and indoor photography settings.Histogram DisplayCommonly used in Canon&rsquo;s line of digital SLR cameras, the HG20 features a Histogram Display. With just one push of a button, the brightness information of a still image is revealed. This allows you to monitor image quality so you can make adjustments to improve the next shots.Print/Share ButtonFor fast and easy, one-touch printing of your photos at home, simply press the camcorder&rsquo;s Print &amp; Share Button. The button can also be used for one-touch downloading of your images to a computer.One Year Parts and Labor Limited WarrantyCanon&rsquo;s one year camcorder limited warranty provides protection long after other manufacturers&rsquo; warranties expire.", "title": "Canon VIXIA HG20 AVCHD 60 GB HDD Camcorder with 12x Optical Zoom", "price": 17.12, "salesRank": {"Camera &amp; Photo": 5841}, "imUrl": "http://ecx.images-amazon.com/images/I/41W0pMJSGsL._SX300_.jpg", "related": {"also_bought": ["B005BHX0A4", "B004THA2OE", "B002MTU5C0", "B0077QJ4CK", "B004TJ6JH6", "B0049VMMZ2", "B005Z4ROIW", "B003M8UR64"], "buy_after_viewing": ["B003VNKNF0", "B004THA2OE", "B00HLDFTRS", "B00HLDFTRS", "B0049VMMZ2"]}}