{"asin": "B0035WTVZA", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Serious photographers seeking the versatility and performance of a DSLR system without the bulk or expense now have the perfect solution in the shape of the new Fujifilm FinePix HS10.  The latest addition to Fujifilm's award-winning range of big zoom 'bridge' cameras offers an unprecedented feature set that combines a powerful Fujinon 30x (24-720mm equivalent) manual optical zoom lens with sophisticated photographic controls, advanced functionality and DSLR-like handling in a single compact, affordable unit.FinePix HS10 HighlightsPowerful LensWith a range that would require at least two or three bulky lenses on an SLR to capture the same zoom capabilities, the FinePix HS10's built-in Fujinon 30x Wide-Telephoto zoom lens encompasses nearly every photographic requirement in a single compact unit. Furthermore, because the lens and body on the FinePix HS10 are built as a closed unit, it eliminates the possibility of dust on the image sensor.30x optical zoom in action.The twist-barrel manual zoom control enables the photographer to make precision adjustments, and zooming is faster and more accurate than comparable powered zoom lenses in the same class of camera.The class-leading Fujinon 30x optical zoom covers a uniquely versatile 24-720mm (equivalent on a 35mm camera) range from true wide-angle to ultra telephoto. From sweeping landscapes, interiors and large group shots to distant sports or wildlife action, the FinePix HS10 can handle nearly any photographic challenge. In addition to the impressive zoom capabilities, the Fujinon lens ensures optical quality across the entire range.  Fujinon lenses are acclaimed by photographers, broadcasters (as the world's leading manufacturer of television camera lenses) and industrial users across the globe.  Fujinon lenses are also used in orbital satellites to capture high-resolution photos of the surface of the moon.Triple Image StabilizationTriple Image Stabilization combines a mechanically stabilized CMOS sensor with high ISO sensitivities and advanced multi-frame digital stabilization for total anti-blur protection.  Together these technologies reduce the blurring effect of both handshake and subject movement to provide sharp, clean and clear results even at the longest zoom settings or in the most challenging lighting conditions.High Speed, High DefinitionCapturing action with the FinePix HS10 is so easy it feels like cheating. Whether you're shooting stills or movie clips, the FinePix HS10's cutting-edge sensor and processing technologies open up a range of high speed capture modes and unique shooting possibilities.While shooting sports action or wildlife, or simply trying to keep up with fast-moving children, the FinePix HS10 will give users an edge with up to 10 frames-per-second of high speed continuous shooting* at the maximum 10-MegaPixel setting. The FinePix HS10's unique Best Frame Capture Mode means users don't need the reactions of a pro sports photographer to get professional results either; in this mode the camera continuously records images from the moment the focus is activated, then saves up to eight shots captured before the shutter button is released.Capture up to 10 frames per second.The FinePix HS10 also features a full HD movie mode (1080i) with stereo sound, and the camera's mini HDMI output allows users to easily display ultra clear high definition photographs and movies on high definition televisions. A new Super High Speed Movie function can freeze action and capture breathtaking movies at up to 1000 frames per second for amazing slow-motion movies that reveal the hidden world of events that normally occur in the blink of an eye.*10 fps up to 8 shotsAdvanced Modes, Limitless ExpressionThe FinePix HS10 boasts several unique features and modes designed to expand shooting possibilities and to take the work out of creating genuinely eye-catching images.Motion Panorama ModeCaptures an ultra-wide panoramic view in a single sweeping shot.  As the camera pans across the scene (left/right or up/down), the FinePix HS10 captures a series of shots in rapid succession.  The shots are then stitched in-camera to produce a seamless panorama.Motion Remover ModeRemove moving subjects from your shots.  This mode captures 5 images of a scene in quick succession; the five images are then analyzed and combined in-camera to produce a single image** where anything moving in the scene is removed.Multi-Motion Capture ModePreviously only possible with highly specialized equipment, this mode captures 5 images of a moving subject in rapid succession and combines them into a single composite image** containing multiple sharply-captured views of the subject motion.Multi-Frame Image StabilizationCombines high and low ISO exposures of the scene being photographed to reduce blur caused by camera shake without significantly increasing image noise. The FinePix HS10 also sports the remarkable 'Pro Low Light' mode, first seen on the FinePix S200EXR, which combines several exposures into a single image for ultra-low noise output in low light.** 2-megapixel output imageRemove moving subjects from your shots.Low Light PerformanceThanks to Fujifilm's award-winning sensor and processing technologies FinePix cameras have become market leaders in low-light performance, setting the standard for high sensitivity, low noise results in the most challenging shooting conditions. The FinePix HS10's BSI-CMOS sensor continues this tradition with an innovative new design that significantly increases the light gathering ability of every pixel, resulting in a 200 percent increase in sensitivity over a conventional CMOS sensor.  Combined with Fujifilm's image processing expertise the new sensor produces stunning richly detailed low noise images, even when shooting in very low light.The HS10's CMOS sensor delivers amazing low-light performance.The improved sensitivity isn't just for taking noise-free photographs at night: it also allows the use of high shutter speeds in daylight required when shooting at telephoto end of the FinePix HS10's 30x optical zoom, or when attempting to capture fast-moving subjects.  Photographers no longer need to worry about blurred pictures with such a long telephoto as they can rely on the FinePix HS10 to produce clear, sharp output even at higher ISO settings.A True Photographer's CameraAs well as a range of advanced automatic functions--including Fujifilm's acclaimed SR Auto mode--and scene modes designed to produce perfect 'point and shoot' results, the FinePix HS10 sports a full complement of sophisticated manual and semi-automatic shooting modes and photographic controls.  The extensive external controls give the more advanced photographer direct access to virtually every control they will need for uninterrupted shooting, and the body includes dedicated command buttons for quick and easy key functions such as ISO, white balance, focus and metering.The large command dial, manual focus ring, twist and zoom lens barrel, bright, clear electronic viewfinder, high quality tilting LCD screen and deep hand grip ensure the FinePix HS10 handles at least as well as a digital SLR, despite its compact dimensions.  AA batteries (ships with alkaline) provide excellent performance (up to 300 shots with Alkaline batteries) combined with the convenience of a universally available format when shooting for extended periods away from main power.Additional Features'Super Intelligent' Flash: The FinePix HS10 offers a flash control system which efficiently controls the level of flash for a given exposure to produce beautifully balanced flash illumination across the foreground and background.  Gone are the ugly washout shots where the subject is blasted with light and the background dark and unexposed.  Super Intelligent Flash is most useful in macro photography where the contrast between subject and background can be especially challenging, but is also effective for night and backlit photography.3.0-inch High-Contrast Tilting LCD and Electronic View Finder: The FinePix HS10 is fitted with a high contrast 230K-pixel 3.0-inch LCD and Electronic View Finder.  To improve user interaction with the camera, Fujifilm for the first time has included a clever sensor to the side of the EVF (Electronic Viewfinder) that automatically switches the picture between the EVF and the LCD screen when the eye is withdrawn.Face Detection and Automatic Red-eye Removal: To provide perfectly exposed and focused portrait shots, the FinePix HS10 is fitted with Fujifilm's latest Face Detection technology which is able to track up to 10 faces simultaneously, at almost any angle to the camera.  The system instantly corrects red-eye and then saves both the original and the corrected image file automatically.Combined RAW/JPEG shooting: The FinePix HS10 has the ability to shoot both a RAW and JPEG shot simultaneously.  RAW is for ultimate quality shots via post processing, JPEG is for great quality with no need for further post-production work.", "title": "Fujifilm FinePix HS10 10 MP CMOS Digital Camera with 30x Wide Angle Optical Zoom and 3-Inch LCD", "price": 399.99, "salesRank": {"Camera &amp; Photo": 6021}, "imUrl": "http://ecx.images-amazon.com/images/I/41myh0YDQyL._SX300_.jpg", "related": {"also_viewed": ["B004HO58OI", "B006T7QSVS", "B006T7QZ02", "B004HO58NO", "B00ATM1NBY", "B0007GIXS8", "B00BQU11JW", "B00ATM1MGA", "B00ATM1NAU", "B00BT1RS3G", "B006TR0FCQ", "B00AX12XTC", "B0035JD0DW", "B00CC9QTA2", "B006T7QRN2", "B00B5MUJTO", "B004G8Q61E", "B00HGE3CWG", "B006YP41I2", "B00B46XSC6", "B00HGE3CZI", "B001QENO7A", "B00ATM1MVU", "B0034XFG86", "B0091TC3OC", "B0011ZK6ZM", "B00HGE3C5I", "B00LI6ZSOS", "B00ANQD52Q", "B002IKLJU0", "B00ANCZO42", "B004HO58NY", "B0081IOD1K", "B0091T97J6", "B008MB6YX6", "B00HGE3CXU", "B0031RGEVS", "B001PKEJZQ", "B00DY2Y28M", "B00913NPYK", "B0090NZSM8", "B004FLL53Q", "B002HMCBEC", "B004M8SVGQ", "B006T7QWGO", "B0041RSPR8", "B005MTMFHU", "B008MB6ZX0", "B00B46XRN6", "B00E9R04OW", "B003WJR694", "B00B46XRI6", "B0034XIMG4", "B004M8SVHK", "B005F25IL4", "B0015ASYJ8", "B002LITT3I"], "bought_together": ["B003VNKNEQ"], "buy_after_viewing": ["B003VNKNF0", "B0039BPG1A", "B0091TC3OC", "B003VNKNEQ"]}}