{"asin": "B001AYCNIW", "categories": [["Electronics", "Computers & Accessories", "Monitors"]], "description": "Beautiful inside and out, the Samsung Touch Of Color T260HD LCD monitor is a great way to get the most out of your PC--as well as watch your favorite 1080p HDTV broadcasts. It features an embedded DTV tuner that enables you to watch digital HD broadcasts without a special receiving set. And with six image input terminals, you can connect several pieces of digital equipment to the T260HD and use them simultaneously. Two HDMI connections make your monitor a multimedia centerpiece. Additionally, SRS TruSurround XT is embedded to improve audio performance.The contrast between light and dark colors on the screen is what makes images stand out. The bigger the difference between light and dark images, the more vibrant images will appear. With an amazing dynamic contrast ratio of 10,000:1 you&#x92;ll enjoy sharper image quality that&#x92;s sure to catch your eye. You'll also make a style statement with Samsung's new Touch of Color design, which features a hint of color naturally blended into the traditional piano black frame.The T260HD is designed to be extremely efficient and uses up to a third less power than other monitors in its class. The unique SoftPower off function lets you put the monitor in standby mode right away, using just 0.3 W of power. It comes with a monitor stand that can tilt up to 20 degrees for optimal viewing and a full-feature remote control. The monitor's speakers reside underneath the screen and provide a total of 6 watts of audio power (3 watts per channel).The Samsung T260HD includes two HDMI connectors (one on the side) in addition to DVI, VGA, component video, and RF antenna inputs.SpecificationsScreen size: 26 inchesResolution: 1920 x 1200 pixelsBrightness: 300 cd/m&sup2; (candela per square meterResponse time: 5 milliseconds (ms)Viewing angle: 170 degrees horizontal, 150 degrees verticalHDMI audio/video input: 2 (1 on back, 1 on side)DVI video input: 1VGA video input: 1Component video input: 1 setAntenna input: 1 RFAudio input: 1 left/right analogAudio output: 1 SPDIF digital audioWhat's in the BoxSamsung T260HD monitor, monitor stand, power cord, D-sub (VGA) cable, remote control (with batteries), cleaning cloth, cable holding ring, quick start guide", "title": "Samsung Touch Of Color T260HD 25.5-Inch LCD HDTV Monitor", "price": 299.44, "salesRank": {"Computers & Accessories": 8602}, "imUrl": "http://ecx.images-amazon.com/images/I/41fpnNUrqlL._SY300_.jpg", "related": {"also_viewed": ["B00C18YUZU", "B00C18YT9M", "B001CD160M", "B007ILEHNU", "B00C18YTC4", "B00C18YQ8Q", "B00C18YTAG", "B00794ZVT0", "B00535CD5C", "B00IEZH06K", "B00CWJGGIM", "B005JN9310", "B00IEZGYNK", "B008DWH00K", "B00BJ744F0", "B00IEZGY2Q", "B00ARJNKRE", "B0043T7FHK", "B00G0TYBO6", "B0054IF6UM", "B00B332A9C", "B00B17C5KO", "B0043T7FKC", "B008A3KFB8", "B00BVIHTS6", "B0058UUR6E", "B007ZS3O62", "B004EBUZPQ", "B009H0XQPA", "B0098Y77N2", "B00B1IAL7W", "B00IEZGYI0", "B00IEZGWMS", "B00IEZGW8C", "B00AWM12H6", "B00C18YRSU", "B00DGYFDRC", "B007ILDWIG", "B00CMHQOJU", "B0043T34RK", "B00IZBQ460", "B00C18YQ5Y"], "buy_after_viewing": ["B00C18YUZU", "B003L1ZYYM", "B005JN9310", "B000ID7QNI"]}}