{"asin": "B004OBUFYW", "description": "Showcasing a vibrant 3-inch touchscreen with vivid colors and amazing clarity, the Archos Vision 30c is a sleek solution for portable media entertainment. A lightweight design means the Vision 30c is small enough to fit in your pocket, while the intuitive interface makes it easier than ever to enjoy your music, movies, and photos on the go. Tune in to your favorite FM radio stations, or record them directly onto the player to listen to later. With 8 GB of storage and up to 13 hours of battery life, this player is designed to keep you entertained anywhere you go.Vision 30c 8 GBAt a Glance:Sleek, lightweight design for maximum portability8 GB of storage space and up to 13 hours of battery life for long-lasting usePlays multiple music formats and FM radioVibrant video playback and picture display on 3-inch touchscreenWorks as a voice and radio recorder with internal microphoneLimited one-year warrantySlim design and up to 13 hours of battery life lets you enjoy your music on the go.View larger.Watch videos and view photos in vivid color on a 3-inch touchscreen.View larger.Slim, Light Body and 13-Hour Playback TimeCreated with maximum portability in mind, the Archos Vision 30c features a slim profile, measuring 3-9/10 by 2 by 3/10 inches (H x W x D), and weighs 1-9/10 ounces. The 3-inch touchscreen has a smooth, simple interface that allows you to effortlessly navigate through long lists of files. Delivering vivid colors, the Vision offers exceptional visual quality to complement its easy operation. A battery life of up to 13 hours ensures that you can use it all day long on a single charge.8 GB Storage Capacity and FM StreamingThe Vision 30c offers 8 GB of storage, so you can take plenty of music with you wherever you go. Enjoy all of your favorite songs and podcasts with optimal sound thanks to an integrated audio equalizer. With song title and album cover view, you can immediately recognize your music. In addition to playing MP3 files, the Vision supports WAV, OGG, FLAC, and APE formats.When you want a break from your music library, take advantage of the streaming FM radio option, which includes several station presets. Whether listening to local news, catching sports results, or enjoying some tunes, you'll appreciate the receiver's high-quality sound and reception.Watch Video and Display Photos on 3-Inch ScreenEquipped with a 3-inch touchscreen with 320-by-400-pixel resolution, the Archos Vision is ideal for video and picture playback. You can easily store and display photos on the Vision to relive those special occasions and share your memories with family and friends. The device supports JPEG and BMP photo formats. Add a touch of atmosphere to your photos by creating your own soundtrack for a slideshow.The Archos Vision is equipped to play AVI, MPEG-4, FLV, and RMVB video files. Thanks to a wide range of file compatibility, you can avoid the hassle of having to convert your video files before taking them with you. Ideal for traveling, the Vision can hold hours of video so you won't run out of things to watch.The screen on the Archos Vision also displays text files (.TXT) and lyric files (.LRC) for your music, so you can sing along to all of your favorite songs.Built-In Audio RecorderNeed to remember an important lecture or meeting, or want to capture a special occasion? With the Archos Vision 30c you can record it all. The Vision includes an internal microphone and ample storage space; record at any moment, store files on the device, and listen to them whenever you like. The Vision also allows you to record directly from FM radio, so you can enjoy that live DJ set or radio show time and time again.Compatibility and Warranty InformationThe Archos Vision is compatible with Windows, Mac, and Linux (with mass storage support) operating systems. It uses USB 2.0 high-speed interface for data transfer and recharging--simply drag your files from your computer onto the Vision and you're ready to go.The Archos Vision 30c is backed by a limited one-year warranty.What's in the Box:Archos Vision 30c player, USB mini B/A cable, earphones, and user guide.VIDEO/MP3 PLAYERSVision 15bVision 18bVision 20bVision 24bVision 30c 4GBVision 30c 8GBCapacity4 GB8 GB8 GB4 GB4 GB8 GBScreen Size &amp; Type1.5-inch color TFT1.8-inch color TFT2-inch color TFT2.4-inch color TFT3-inch touchscreen3-inch touchscreenScreen Resolution128 x 128 pixels128 x 160 pixels176 x 220 pixels320 x 240 pixels320 x 400 pixels320 x 400 pixelsBattery Lifeup to 22 hoursup to 18 hoursup to 15 hoursup to 12 hoursup to 13 hoursup to 13 hoursMeasurements(H x W x D)2.95 x 1.53 x 0.35 inches3.35 x 1.57 x 0.33 inches3.38 x 1.7 x 0.35 inches3.74 x 1.97 x 0.35 inches3-9/10 x 2 x 3/10 inches3-9/10 x 2 x 3/10 inches", "title": "Archos Vision 30c 8 GB Video MP3 Player with 3-Inch Touchscreen and FM Radio (Silver)", "price": 46.99, "imUrl": "http://ecx.images-amazon.com/images/I/410VnEkjWhL._SY300_.jpg", "related": {"also_viewed": ["B005FVNGRS", "B00ECQUY2M", "B00ECRPOKS"], "buy_after_viewing": ["B002MAPS6W", "B002TGEYOQ", "B0035PBHX6", "B004OBRBHQ"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}