{"asin": "B005Z3GINK", "related": {"also_bought": ["B000IN1I5A", "B008B9DU22", "B00EZXK05I", "B00CT9UGU4", "B00AIXY9CY", "B000FCES6K"], "bought_together": ["B000IN1I5A"], "buy_after_viewing": ["B00DO6WLX6", "B00K589F8A", "B00KHV6TIE", "B00IGUUYTI"]}, "title": "Ivation IVA-400 Waterproof Wireless Bluetooth Shower Speaker and Handsfree speakerphone for All Bluetooth Devices, BLACK", "price": 44.11, "salesRank": {"Cell Phones & Accessories": 11743}, "imUrl": "http://ecx.images-amazon.com/images/I/41dIJLCASFL._SX300_.jpg", "brand": "Ivation", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories"]], "description": "This Ivation waterproof speaker will change the way you bathe and shower forever! You can now listen to crystal clear audio streaming from any Bluetooth enabled device to this Wireless Speaker. In addition to enjoying your music and streaming audio, phone calls can also be answered from your Hipe speaker. The speaker will ring upon receiving an incoming phone call, If the call is answered the audio will fade out and when the call has ended the audio will resume playing where it left off. (IPhone Siri and Samsung S-Voice can also be activated by pressing the CALL button to play specific songs, take notes, make calls and plan schedules.) You can also steam media from your android via any audio APP like Pandora, Google Music and Music Hub. Features a full control panel that lets you remotely Play/Pause, Next/Back and Receive/Reject phone calls.NOTICE:&nbsp;This Speaker is designed for use in wet locations and can withstand high pressure water jet,BUT IT SHOULD NOT BE IMMERSED IN WATERFeatures:- Waterproof - Rated IPX6 - Can withstand powerful water jets.- Bluetooth V2.1 + EDR support A2DP, HSP, HFP, and AVRCP.- Echo cancellation and Noise suppression.- Rechargeable power bank inside, you can power your music device.- Run time: up to 25 hours.- Auto Pairing Feature: Pairs your device with the Ivation speaker automatically when it is in range of the speaker.- Compatible with any Bluetooth media player, phone, iPod, iPad, Android Devices, Samsung S-Voice, Google Music, Pandora and all other media APPS.- 2 features where updated 1: The battery was upgraded. 2: The phone volume is now leveled with the music volume.Specs- Dimensions: (WxHxD) 8 x 3.5 x 1.8\", with handle height is 6 1/8\"- Weight: 14 oz."}