{"asin": "B00005T3EM", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Surge Protectors"]], "description": "\"Polluted\" AC power can degrade the performance you expect from your home theatre components.Unless you live directly behind Hoover Dam, your AC power is most likely \"polluted\" by appliances sharing the same power line with your home theatre components. Electrical power tools, refrigerators, air conditioners, radio transmitters, cellular phones, microwave ovens - even your neighbor's freezer - all can generate electromagnetic interference and radio frequency noise which pollutes the AC power and degrades both audio and video performance. Plus, even your home theatre components can generate noise interference, adding more \"pollution\" to your AC power.As a result you'll hear a loss of dynamic range and resolution with a compressed soundstage and imprecise imaging. You'll see a lack of sharpness and color detail lessening the home theatre experience. And you'll never know how much of the essential drama is gone in the high performance picture and sound your system was originally designed to deliver.Monster's Clean Power&#8482; Circuitry filters out power pollution for more natural sound and better TV picture.Designed by world renown AC power expert Richard Marsh, Monster's Clean Power&#8482; Circuitry uses special filters to dramatically reduce electronic noise on your AC power line to give you the best possible sound and picture from your components. You'll see a more vivid picture and hear more natural sound with increased dynamic range and less noise - especially if your AC power is severely polluted. You'll get back the performance you never knew you lost.Stage1 Clean Power&#8482;Stage 1 Clean Power&#8482; Circuitry filters out noise interference on the AC power line so you can enjoy more natural sound and vivid picture performance from your home theatre components.Monster PowerCenters make life easier.Monster's FlatProfile&#8482; plug lets you push your furniture flush against the wall. With color-coded outlets and cord labels, you can avoid unplugging your VCR by mistake, cause it to blink \"12:00.\" And finally, a generous eight foot Monster power cord - the optimum length to reach most electrical outlets - is included.Maximize your system's protection.Now you can get protection from power pollution, surges, voltage spikes and inconvenience! Monster PowerCenters offer high performance solutions to today's technology challenges.", "title": "Monster Cable MP HTS 700 Home Theater PowerCenter With Coax , Cable TV, Antena, Satellite, And phone Line Surge Protection", "price": 46.74, "imUrl": "http://ecx.images-amazon.com/images/I/310FaHeuAtL.jpg", "brand": "Monster", "related": {"also_bought": ["B00003CWDG", "B00006343O", "B00003CWDH", "B0019EHU8G", "B00003CWDK", "B000E312X2", "B006U1YUZE", "B001LK6ZDY", "B0019HL8Q8", "B00003CWDQ", "B00752R4PK", "B003ILIFEG", "B006U3O566", "B0049II7W2", "B00006343N", "B000JE9LD4", "B0052SCU8U", "B001A5PDKQ", "B00316263Y", "B005GGTTZ0", "B001JI6CGS", "B004ETIKH8", "B0029HHIDY", "B003FW0WIK", "B003BKW2K2", "B0083SBJXS", "B0052606II", "B0027CTERY", "B001TH7GSW", "B001MZXUI6", "B00022OBYW", "B00006BBAC", "B003FVYXY0", "B007EHI1DK", "B002IC0YL8", "B00006BBAB", "B006ZH0M9Q", "B004LSNF04", "B004WR125O", "B000I5LACO", "B004H1PV2A", "B000WL6YY8", "B000J2EN4S", "B0012S4APK", "B008XBCJ34", "B007K9P7H0", "B000HPX46U", "B002WNAFSU", "B0076R7FWQ", "B001DW03B0", "B003L1ZYYM", "B000092TT0", "B004EBX5GW", "B0077V88W2", "B000HPV3RW", "B005LAIHY0", "B0077V88VI", "B006U1YVZ8", "B000BVCSMG", "B007REV4YI", "B000NMFCIA", "B004H1PV4S", "B0061RJSWC", "B004CLYJ0U", "B0015DYMVO", "B00793MIGK", "B0023RRRCM", "B007JF85VU", "B0002KVQBA", "B00CTSDDVO", "B00193U3O0", "B003L1ZYYW", "B005CLPP84", "B007I5JT4S", "B003FVX9FO", "B005LJQMZC", "B000Y9CP4Q", "B002HPNDDW", "B001C4BEOY", "B000IF51UQ", "B004LWZWGK", "B004QR56SE", "B005LJQNQU", "B003XM1WE0", "B008QZ5PY2", "B005FO43OU", "B00006B81E", "B001E1Y5O6", "B0041SRUJ6", "B0000668YX", "B000NQRE1E", "B00D7OMNXS", "B00867GJYK", "B0084IG7KC"], "bought_together": ["B0019EHU8G"], "buy_after_viewing": ["B000JE9LD4", "B00003CWDQ", "B00006343O", "B00003CWDH"]}}