{"asin": "B001498LIO", "related": {"also_bought": ["B00I499UVE", "B002HWRJY4", "B00IKMJ9B6", "B0041LYY6K", "B000W8UIZW", "B006V72AE0", "B003G2Z1M6", "B0036R9XRU", "B008HO9DK4", "B00I52A13Q", "B007OWY6P2", "B00F0DD0I6", "B0000BVYT3", "B00006RVPW", "B008HO9D7M", "B00IF0JAYE", "B00413PHDM", "B0085WN7YQ", "B001Q7X0Z8", "B000ZH98LU", "B00HQ883QW", "B008I646WG", "B007ZLGXA8", "B001MSU1HG", "B00FEEFPM0", "B005L9ZZ32", "B003VANO7C", "B00H09BOXQ", "B002RYYZZS", "B000R9AAJA", "B00C93JQXS", "B00008VFAF", "B005BZNDOO", "B009SPWJ98", "B00BP5KOPA", "B0019804U8", "B003Y24DEU", "B005ODHJFM", "B005H3I38Q", "B00H09BB16", "B0088PUEPK", "B00BWF5U0M", "B000Z80ICM", "B00FWK8UWI", "B001TH7GVE", "B003VAGXZC", "B008YAHW6I", "B0092ML0MY", "B0033Z2BAQ", "B005T3GRNW", "B00009V2QX", "B00A6TPHZS", "B006Y5UV4A", "B005O55U2Y", "B000FBK3QK", "B004713JLU", "B0092ML0OC"], "bought_together": ["B00IKMJ9B6"], "buy_after_viewing": ["B00I499UVE", "B003G2Z1M6", "B006V72AE0", "B000W8UIZW"]}, "title": "NETGEAR RangeMax Dual Band Wireless-N Adapter WNDA3100 v2", "price": 28.95, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31GcHknEv8L._SX300_.jpg", "brand": "Netgear", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Network Adapters", "USB Network Adapters"]], "description": "When you're ready to connect your desktop or laptop to a wireless hot spot or new Wireless-N network, the NETGEAR RangeMax Dual Band Wireless-N USB Adapter (WNDA3100) will get the job done with outstanding speed, minimal interference and robust connections. Featuring the latest dual band Wireless-N technology, the RangeMax Dual Band Wireless-N USB Adapter delivers exceptional range and speed of new Wireless-N devices while still offering backwards compatibility to older Wireless-G networks. This adapter will connect you to a Wireless-N network and let you surf, email, stream HD video, play on-line games, and even make Internet phone calls--simultaneously!.caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The NETGEAR RangeMax Dual Band Wireless-N USB Adapter:Lets your PC notebook connect to Wireless N networks and hotspots.Is backwards compatibile with Wireless-G networks and devices.Operates on both 2.4 GHz and 5.0 GHz bands to minimize interference.Is extremely portable--weighs less than one ounce.This highly portable adapter lets you connect to Wireless-N networks for long range and high speeds.View larger.Less Interference, Increased Range and Superior PerformanceWhen you use the RangeMax Dual Band Wireless-N USB Adapter to connect to a Wireless-N network, you can take advantage of the new technology's outstanding range and performance. Utilizing the latest dual band Wireless-N technology, when used with Wireless-N networks, can deliver more than 10 times the range and offer a throughput speed of up to 15 times greater than existing Wireless-G networks.Another notable advantage of dual band Wireless-N is that it works with up to 23 channels that operate on the 5GHz band. Wireless-G networks, on the other hand, operate on the 2.4-GHz band with only 3 channels, which is also home to some cordless phones, microwaves, and other devices that can cause interference. 5GHz Wireless-N avoids the interference that can interrupt Wireless-G networks, giving you greater reliability and performance. The RangeMax Dual Band Wireless-N USB Adapter turns your computer into a new dual band Wireless-N device, letting you connect securely to all new Wireless-N gateways, routers and access points. While the adapter is backwards compatible with any Wireless-G network or hot spot, its performance is optimized for use with theRangeMax Dual Band Wireless-N Router(WNDR3300), HD/Gaming 5 GHz Wireless-N Networking Kit (WNHDE111/WNHDEB111), RangeMax Next Wireless-N Routers (WNR834B,WNR854T Gigabit version).USB Connectivity for Immediate PerformanceOffering better speed and range than other USB Wireless-N adapters, the RangeMax Wireless-N Dual Band Adapter--when used to connect to a Wireless-N network--lets you wirelessly surf, email, stream HD video, on-line game, make Internet phone calls--at the same time!Depending on your Internet connection, the adapter can provide you with enough bandwidth to support quick music downloads, file sharing and HD multimedia applications.This convenient and highly portable adapter, which weighs less than an ounce and is about the size of a lighter, is designed for your Windows XP or Vista notebook or desktop PC and simply plugs into any USB port.What's in the BoxRangeMax Dual Band Wireless-N USB Adapter (WNDA3100), installation guide, resource CD, and warranty/support information card.The adapter is portable and easy to install, making it easy to use with all your computers."}