{"asin": "B0025VKUQ6", "description": "Take full advantage of your computer's music, multi-media, and gaming with the Altec Lansing BXR1221 Three-Piece Stereo Speaker System. Ideal for computers or MP3 players, the compact speakers and four-inch subwoofer combine to produce clear highs and a powerful bass while helping to keep your desk or workspace free from clutter. Thanks to Altec Lansing's Audio Alignment technology, the system's drivers, enclosure, and electronics are perfectly balanced, giving you the full, high-quality stereo sound your digital life demands.The four-inch subwoofer packs a big punch in a small size.View larger.Volume control is conveniently located on the top of the speaker.View larger.Audio Alignment Technology for Superb Accuracy and AlignmentThe BXR1221 relies on Altec Lansing's proprietary Audio Alignment technology to make sure all of the speakers' components work together to deliver your music the way it is meant to be heard. Audio Alignment technology offers the perfect balance of the three elements of the speaker system -- the drivers, enclosure, and electronics -- to ensure a natural, uncolored, and rich sound from your speaker system.The two-inch, full-range drivers and separate satellite speakers provide stereo imaging for more realistic sound when you're gaming or watching movies and videos. Thanks to its small footprint and compact size, the four-inch down-firing subwoofer can easily be tucked out of the way while still giving you deep, full tones.Designed to Fit Any Computer SystemThe speakers' elegant black enclosures and cloth grills are designed to complement your computer and peripherals. The speakers' small size -- each speaker measures only 3.7 inches in height and the subwoofer measures a mere 7.3 inches in height -- saves you valuable room on your desk and makes it easy to carry the speakers along with your laptop.The BXR1221 components are also shielded, so you can place them close to your monitor or phone without interference. Conveniently placed power and volume buttons put sound control within easy reach.About Audio AlignmentWhether it's the tiniest of ear buds or the most imposing of subwoofers, Altec Lansing has refined every detail of its speakers to provide you with the most accurate sound reproduction and quality. Audio Alignment ensures that your components work together to deliver your music the way it is meant to be heard, offering the perfect balance of your speaker system's drivers, enclosure, and electronics. For 70 years Altec Lansing has been refining this process, bringing your speakers to life with advanced technologies that make them sing.The BXR1221 speaker system is covered by a one-year limited warranty.What's in the BoxAltec Lansing BXR1221 speaker system (two satellite speakers and one subwoofer), power adapter, user's guide, and quick connect guide.", "title": "Altec Lansing BXR1221 2.1 Speaker System (Black)", "price": 16.99, "imUrl": "http://ecx.images-amazon.com/images/I/41imRnwfetL._SY300_.jpg", "related": {"also_bought": ["B0025VKUPW", "B0038W0NEU", "B004TMTRPY", "B0025VKUQQ", "B000SE6IV8", "B000I23TTE"], "buy_after_viewing": ["B0025VKUPW", "B0027VT6V4", "B0025VKUQQ", "B0025VKUQG"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]]}