{"asin": "B00CRZXUZI", "related": {"also_bought": ["B00CRZXV16", "B00CRZXV3O", "B001W3MMHI", "B007U7LZQ4", "B00CRZXSH8", "B001W32F02", "B003H5174S", "B00CRZXV52", "B007U7LZOG", "B00555TXMG", "B00804BEAI", "B0089U3VDQ", "B007U7LZQE", "B004MWL0J2", "B003GIS8TI", "B00DW1TUY6", "B007U7LZOQ", "B00AOHDC4A", "B004MWP3FO", "B00CRZXSGE", "B00134V4I4", "B00BRCN9TO", "B0036ZBEFG", "B001H0U86S", "B00DSE1ZJK", "B00J3ZZJL8", "B003GIS8TS", "B00CRZXX1Y", "B00804BE9E", "B003H4ZVH8", "B001W30E2S", "B008DFT7RQ", "B00J40068I", "B003JQV9LG", "B004MWI06I", "B0038ALXZ0", "B001H0SOI2", "B00B7YJ7NE", "B005XFTIIM", "B004MWN1AS", "B0089U3VN6", "B00491ORGO", "B00DW1U3CY", "B00CN8AI0E", "B0038APD60", "B005ZCY36K", "B001W3MMH8", "B004MWL0H4", "B005JU98NG", "B007U7LZQO", "B0080M1JJQ", "B00CRZXWZG", "B00ASJHH68", "B0089U3VPY", "B001U5R200", "B0041CJM70", "B00134OA0I", "076967559X", "B007U7M00E", "B0038AJKKK", "B00AHUKP9E", "0887431453", "B00CRZXS8W", "B0041CJM6G", "B00ASJHDK8", "B00ANTU9YA", "B00ASJHFVK", "B00134V53S", "B003GIS8T8", "B00138UY6I", "B00134RN70", "B001U5N5W4", "B001U5JD9I", "B001W2WKS0", "B001TKUXUC", "B00361XWDC", "B001COH3MQ", "B002LYD2M6", "B00ASJHIS0", "B0064MT1NK", "B00HHYF5AC", "B005IUIWB6", "B00804BDEA", "B00CN8AI2M", "B007CS1908", "B001U7NW20", "0913063029", "B004Z7H2EQ", "B004MWJLDY", "B00ASJHKE2", "B00CV7BX7E", "B00CP4J7OY", "B00A8Q0S6M", "B00CN8AGA6", "B00CG0CL1S", "B0084BPZO8", "B00EIBEORM", "B003Z6HSL0", "B004Z7H14M"], "also_viewed": ["B00CRZXV3O", "B001W3MMHI", "B007U7LZQ4", "B00CRZXSGE", "B00CRZXV16", "B00CRZXSH8", "B00CRZXV52", "B001W32F02", "B007U7LZOG", "B003H5174S", "B00DSE1ZJK", "B004MWL0J2", "B0089U3VDQ", "B007U7LZQE", "B00DW1TUY6", "B004MWN1AS", "B00AOHDC4A", "B003JQV9LG", "B004MWL0H4", "B00804BEAI", "B004MWP3FO", "B00CRZXX1Y", "B007U7LZOQ", "B00B7YJ7NE", "B00555TXMG", "B003GIS8TI", "B003GIS8TS", "B00DW1U3CY", "B007U7LZQO", "B005ZCY36K", "B00FAX9VGQ", "B00134V4I4", "B00FVGVWU0", "B00BRCN9TO", "B0089U3VPY", "B00138UY6I", "B003H4ZVH8", "B001H0SOI2", "B004MWI06I", "B0038ALXZ0", "B00804BE9E", "B00CRZXWZG", "B0036ZBEFG", "B00J40068I", "B001W30E2S", "B00CRZXS8W", "B00GTCKOCM", "B007U7M00E", "B00DGXTC2K", "B001U5JD9I", "B00J3ZZJL8", "B005XFTIIM", "B00H5HFEUM", "B00AOHDBRI", "B0041CJM70", "B00491ORGO", "B0038AJKKK", "B001H0U86S", "B0080M1JJQ", "B00AOHDC4U"], "bought_together": ["B00CRZXV3O", "B001W3MMHI"]}, "title": "LeapFrog LeapReader Deluxe Writing Workbook: Learn to Write Letters with Mr. Pencil", "price": 14.36, "salesRank": {"Toys & Games": 4696}, "imUrl": "http://ecx.images-amazon.com/images/I/511vfCxeVVL._SY300_.jpg", "brand": "LeapFrog Enterprises", "categories": [["Toys & Games", "Electronics for Kids", "Electronic Toys"]], "description": "Open a world of writing with the ultimate introductory handwriting set! LeapFrog&#x2019;s LeapReader Learn to Write Letters with Mr. Pencil Deluxe Activity Set gives kids ages 4-8 an introductory experience to writing more than 700 letters with interactive writing guidance and audio feedback. More than 40 hands-on activities review the key elements of writing the alphabet&#x2014;upper- and lowercase letters, proper stroke order, letter sounds and handwriting&#x2014;in a fun, interactive way. LeapReader Learn to Write Letters is designed to deliver the benefit of an integrated reading and writing experience.  Children can use the LeapReader to get word-by-word support while reading the story, then practice writing letters with interactive writing guidance on special mess&#x2013;free LeapFrog Writing Paper.  This product is for use with the LeapReader Reading and Writing System (sold separately).  This book is not compatible with the Tag Reader.Practice writing a flying V with Ziggy Zag and his electric guitar.Read along the fun story and get word-by-word support along the way!A Letter Perfect PerformanceJoin Dot and Dash as they form a band, tune up on writing skills and give a letter perfect performance at the Doodleburg Fun Fair! More than 10 Doodleburg characters lead the story and prompt writers to move and groove with LeapReader. Create curved letters&#xAC;&#xAC; with Curly Q and Loopy Lou, explore more linear letters with Straight-Up Sue and practice penmanship with Ziggy Zag. Jitterbug with Jimmy Jot, and learn about upper- and lowercase letters with dots! Don&#x2019;t forget about Curly Q and her singing, skateboarding sheep&#x2014;guaranteed to get the crowd to flock to the stage.The Write Stuff!New writers embark on an immersive learning adventure that teaches letter names, letter sounds and letter strokes with step-by-step interactive guidance that goes from basic lines to more complex strokes. Fun activities and games are incorporated into the experience, designed to keep children engaged as they build writing fluency. Watch their eyes light up as their upper- and lowercase letters magically appear on special, mess-free LeapFrog writing paper.  Children can build phonics and handwriting skills by touching LeapReader to letters and words and hearing them pronounced and sounded out.LeapFrog Learning DifferenceDesigned by in-house educational experts, LeapFrog LeapReader Reading and Writing system (sold separately) is grounded in the latest research for the richest possible learning experience. As a leader in educational entertainment, LeapFrog is trusted by parents to combine innovation with a breadth of play patterns to delight and expand learning horizons. Learn to Write Letters with Mr. Pencil reviews the key elements of writing the alphabet&#x2014;upper- and lowercase letters, proper stroke order, letter sounds and handwriting&#x2014;in a fun, interactive way. As children explore LeapReader books, parents can connect LeapReader to their computer and expand the learning with fun, free activities, plus printables and tips from experts that reinforce their school skill set. The LeapReader Reading and Writing System supports children&#x2019;s independent reading skills and confidence with print, along with comprehension activities that encourage children to make predictions, analyze characters and answer questions.What's In The Box?LeapReader Learn to Write Letters with Mr. Pencil Deluxe Activity workbook, plus 26 extra pieces of special mess-free LeapFrog Writing Paper to reinforce learning through repetition.The LeapReader library features more than 150 books, writing activities, audio books and songs. (Sold separately.)"}