{"asin": "B002WN30IM", "categories": [["Electronics", "Car & Vehicle Electronics", "Vehicle Electronics Accessories", "Audio & Video Accessories", "Audio Car Mounts"]], "description": "The Magellan Premium Car Kit transforms your iPhone into a complete in-car solution for GPS navigation. Simply place your iPhone in the cradle and connect the power. There's no need to remove your protective case--the cradle adjusts to your needs.Transform your iPhone into a complete in-car solution for GPS navigation.Click to enlarge.Secure, adjustable vehicle mounting.Works with any navigation or location-based app.Magellan Premium Car Kit for iPhone / iPod TouchRequires purchase of a navigation app. Sold separately.The Premium Car Kit lets you use great navigation apps like the Magellan RoadMate App for iPhone and iPod touch (2nd generation) and instantly enhances your navigation experience.This powerful, built-in receiver boosts GPS reception, ensuring accurate directions. Simply place your iPhone or iPod touch into the cradle and connect the power. The cradle even works with most turn- by-turn routing applications available today, including the Magellan RoadMate App for iPhone (sold separately).The Premium Car Kit connects via Bluetooth (iPhone only) to deliver a superior hands-free calling experience. The powerful, amplified speaker delivers crystal clear calls and turn-by-turn directions. No need to even remove your protective cover--the cradle adjusts to accommodate most cases or skins.Navigate in confidence with the Magellan Premium Car Kit!FeaturesBuilt-in GPS receiver enhances performanceA powerful, sensitive built-in GPS receiver provides faster and more accurate location information to your iPhone or iPod touchTurns your iPod touch into a GPS navigatorThe built-in GPS receiver adds GPS capability to your iPod touch (2nd generation)Fits hard shell cases or silicon skinsAccommodates most cases or skins for maximum flexibility when inserting into the cradleWorks with most navigation or location-based appsWhile optimized for the Magellan RoadMate app for iPhone, the cradle is compatible with most GPS navigation appsIn-car chargingThe cradle automatically powers and charges when connected. No need to worry about running out of battery.Noise-canceling, hands-free speakerphoneFull duplex speakerphone for crystal clear callsPowerful, amplified speakerUse the volume control for loud and clear voice guidanceSecure, adjustable vehicle mountingQuickly secure the cradle to your windshield or dashboard and easily adjust for portrait or landscape viewingAudio line out for music playback on your car stereoListen to your favorite tunes through your car's audio systemCar Kit CompatibilityiPhone 3G, 3GS, 4iPod touch 2G, 3GRequires iPhone OS 3.0 or later and purchase of navigation app (sold separately).What's in the BoxPremium GPS Car Kit, Vehicle Mount, Adhesive Disc, Vehicle Power Adapter, Getting Started Guide", "title": "Magellan Premium Car Kit for iPhone and iPod touch", "price": 79.0, "imUrl": "http://ecx.images-amazon.com/images/I/41CbzN6zelL._SY300_.jpg", "brand": "Magellan", "related": {"also_viewed": ["B00A46PWCG", "B008J0ZSTQ", "B00A46PYHY", "B003UES8D4", "B00AOCRO7Q", "B005I0JYUY", "B0035Y7ZJ2", "B008UV6YRO", "B0075PZGTS", "B00G2BX616", "B00FM47NBS", "B008IOQ3K6", "B007FHX9OK", "B003Y3BEV4", "B00JP0RTB4", "B00ESQ8NYM", "B00B1RU5E2", "B00KNMMY04", "B004M3BICU", "B002K9IPOC", "B003YLS7AC", "B0018YZ836", "B00GMJ5MDI", "B00BZWW3ES", "B00APTXMK6", "B00I0CFN1G", "B004EHZUYG", "B004VBBZ5I", "B005O5WSTW", "B003DQPE40", "B003SE6LD0", "B002YESWOQ", "B00EZ8BEK8", "B00E4WGT8C", "B008ENHLCA", "B0075PQM1Y", "B006M49G80", "B00AZKOWKO", "B005EWTJU6", "B00HF6CJWO", "B001QFXDA2", "B00IQR25VG", "B008VWNBBE", "B003Z4L68S", "B00B58DVHA", "B00B149NIE", "B00I9R8CF6", "B00JNJPS4W", "B009GXABJ2", "B00EXS506O", "B00D7KGLF8", "B00EA3PCFQ", "B004J75YLU", "B00AOCSFYC", "B002OR17LS", "B00FXSU43W", "B004R1IUMS", "B00IR5AXCA"], "bought_together": ["B00313U54O"], "buy_after_viewing": ["B007FHX9OK", "B008IOQ3K6", "B00A46PWCG", "B0099RGRT8"]}}