{"asin": "B001SEQN3K", "related": {"also_bought": ["B00006B7RM", "B001SEQN3U", "B00B1KKK2G", "B001J30FZM", "B005VAORIA", "B00B1KKZEE", "B005VAORH6", "B000Y9YJK4", "B006JH8T3S", "B007SHJIO2", "B00906E03I", "B00006B7RR", "B005VAORJO", "B005LKKNQA", "B00C2DZBC0", "B00000JRRD", "B00134BZP6", "B004ABO7QI", "B0036TGGW8", "B004ZEZBE2", "B009SPNLUE", "B000ANOY7M", "B000UXZQ42", "B003LVZO8S", "B008ALA6DW", "B004SP0WAQ", "B005DLDTAE", "B005BZNDOO", "B007KB0EGC", "B002GHBUTK", "B009SPWJ98", "B00CYX26BC", "B005G306I2", "B00BQ8RFAI", "B00B1KJK22", "B003NR57BY", "B003CP0OT2", "B00C28L138", "B000OOYECC", "B005GTNZUM", "B00B7FOQCK", "B003XM73P2", "B000HJ7AIY", "B003M2YDE2", "B008LTBJFW", "B000HPX46U", "B00E3W1726", "B003VANO7C", "B0083I7Y8W", "B000R9AAJA", "B005Y0G9ME", "B002TLTGM6", "B005JN9310", "B003L62T7W", "B002JFX02Y", "B00H09BOXQ", "B00BWF5U0M", "B004S4R5CK", "B003WUBIZQ", "B00BP5KOPA", "B004YW7WCY", "B00009WQSR", "B002HWRJBM", "B005QRA5IY", "B005LDLVAO", "B0007T27H8", "B007B6YPAM", "B00870ZHCQ", "B0043T7FXE"], "bought_together": ["B00006B7RM", "B005VAORH6"], "buy_after_viewing": ["B005VAORH6", "B00906E03I", "B005VAORIA", "B001J30FZM"]}, "title": "Plantronics .Audio 655 USB Multimedia Headset", "price": 24.95, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/413jLNn-9NL._SY300_.jpg", "brand": "Plantronics", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Headsets & Microphones"]], "description": "From the Manufacturer When it's time to take full advantage of your computer's media, the Plantronics .Audio 655 offers exceptional audial performance, thanks to dual 40-mm speakers that deliver rich, full-range digital sound. These USB headphones are lightweight and have soft ear cushions that offer the extended comfort you need for music and gaming, and a noise-canceling microphone with adjustable boom lets you make crisp and clear Internet calls.Volume controls are conveniently located on the headset itself.View larger.The adjustable boom mic features noise-canceling technology for clear conversations.View larger.Simple Setup with Plug-and-Play and Convenient Volume ControlsSetting up the .Audio 655 Headset is a cinch: just plug the USB connector into your PC and you're ready to go. With true plug-and-play functionality, the .Audio 655 requires no software to install and no complicated setup.Once connected, simply reach up to the controls located directly on the earpiece to change the volume.Outstanding Sound for Great Music, Gaming, and DVD ExperiencesPlantronics designed the .Audio 655 Headset to provide a full-spectrum audio experience. The headset has dual 40-mm speakers that provide full-range audio with clear treble and deep, rich bass. This means you'll enjoy an outstanding stereo performance when listening to digital music, and you'll enjoy great cinema-like sound when watching DVDs. The headset will also provide you with a great listening experience when you are playing games, listening to podcasts, and more.Additionally, the cushioned earpieces of the .Audio 655 block ambient noise for fewer distractions, so you can easily focus on your Internet calls or gaming.Clean and Clear Internet CallsEliminate noisy, hard to understand Internet calls with the .Audio 655 Headset. A noise-canceling, fully-adjustable, boom-style microphone transmits your voice clearly without the hiss of background noise. Whether you are using Skype or other Internet calling programs, your voice will sound crisp and clear.The headset also features Fast Mic Mute technology, so you can quickly mute the microphone by raising the boom. The .Audio 655 Headset makes Internet calls simple and lets you concentrate on your conversation, rather than on the hassles of complicated technology.Designed For Comfortable All-Day WearPlantronics designed the .Audio 655 Headset to be comfortable all day long. It features lightweight construction and an over-the-head design to prevent discomfort, as well as swivel-mounted, cushioned earpieces that softly cradle your ears. The adjustable headband allows you to find the perfect fit.The Plantronics .Audio 655 Headset is backed by a one-year warranty."}