{"asin": "B000K8YAKI", "description": "Adding toHalo: Combat EvolvedandHalo 2, the epic saga continues withHalo 3, the amazingly anticipated sequel to the highly successful and critically acclaimedHalofranchise. Master Chief returns to finish the fight, bringing the epic conflict between the Covenant, the Flood, and the entire human race to a dramatic, pulse-pounding climax. The Covenant occupation of Earth has uncovered a massive and ancient object beneath the African sands, an object whose secrets have yet to be revealed. Earth's forces are battered and beaten. The Master Chief's AI companion, Cortana, is still trapped in the clutches of the Gravemind, a horrifying Flood intelligence, and a civil war is raging in the heart of the Covenant. It's all been building to this--a desperate, final war that leads to a soul-shattering climax of epic proportions. Take control of Master Chief to defeat the Covenant and destroy the Flood as a measure to prevent the annihilation of the human race.Get ready. The Chief is back.HDR lighting, self-shadowing, and more makeHalo 3look and feel realistic.View larger.Mystery abounds with the return of Cortana.View larger.Earth is conquered. The Covenant is everywhere. Halo 3 promises to be an epic journey.View larger.The game was revealed to the world at the Microsoft press conference held at Grauman's Chinese Theater in Hollywood in May 2006. The announcement was a complete surprise. The rumors had run rampant, as everyone wondered when the next installment would be ready. Bungie and Microsoft did a stellar job keeping their lips sealed and fans benefited from their first glimpse of the hallowed third and final installment.The short presentation was delivered in real time on Xbox 360 using the current version of theHalo 3game engine. That's right--no studio production video, Bungie and Microsoft delivered the real deal: what they showed at the announcement is what gamers see when they playHalo 3. The HDR lighting, self-shadowing, GPU-run particle system, and many other features appear in full effect in the final game. Needless to say, the gaming community has been salivating.CJ Cowan, Bungie's director of cinematics, discussed one of the most startling moments of the presentation: the return of Cortana. \"Given the variety of character and story arcs at the end ofHalo 2, we wanted to boil down our announcement to a few key threads. Cortana and the Chief being a galaxy apart is a situation we haven't seen before, and is something that is a powerful component toHalo 3. We are using her transmissions in the demo to give the viewer a few subtle clues to her situation and state of mind, without revealing any specifics we want to save for the game itself.\"Graphically, the game closely follows in the tradition ofHalo 2, although it has been upgraded to take advantage of Xbox 360's more prodigious visual abilities. As art direct Marcus Lehto explained, \"[The presentation] was intended to be an understated announcement ofHalo 3--the tone is that of mystery and suspense--the calm before the storm. I wanted to make sure that we reintroduced the Chief, showed that Earth was thoroughly conquered, with Covenant everywhere, and that there is a glorious, ancient artifact buried under the Earth's crust which will provideHalo 3with the epic journey we all want.\"Taking full advantage of the power of Xbox 360,Halo 3expands on everything that has made the franchise great, adding a wealth of technical and gameplay advancements. The game design has evolved with next-generation, high-definition visuals; enhanced AI; an advanced real-time lighting engine; and, of course, new weapons, characters, and challenges.Halo 3promises an unparalleled first-person shooter experience and, in the end, the most compelling and engrossing story in the franchise's history. Last, but certainly not least,Halo 3builds upon the unique social multiplayer experience and innovative, evolving online gameplay ofHalo 2. Rest assured, you'll still be able to run with your clan and battle with (or against) your buddies from coast to coast.", "price": 70.94, "imUrl": "http://ecx.images-amazon.com/images/I/41ADGcaVH2L._SY300_.jpg", "related": {"also_bought": ["B0002A2S26", "B003IT6E8C", "B001HWB68K", "B001F6KSDM", "B0050SYY5E", "B0050SYEYK", "B0014CFO4K", "B00008J7NZ", "B000HCQJTC", "B00005NZ1G", "B002BSA20M", "B003O6G790", "B0034JKYO6", "0761556990", "B00KSQHX1K", "B000ETUF0W", "B00FKV8AK6", "B0017HW5LM", "B0050SYX8W", "B000930DA0", "B003O6JIFA", "B005K8LOA2", "0744012333", "B0050SYZS0", "B000B6ML1Y", "0761537449", "0761562885", "030789570X", "B003WFLGNK", "B001TOQ8PM", "0761544739", "B0014ET6EM", "B002WCLG48", "B008RA5H8K", "B002I0HCVK", "B00GV8QTPU", "B002Q3S9NY", "0785123725", "B005J67468", "0761561811", "0744013534", "1616553251", "B002WCLG3O", "B002I0H9JA", "B004JSDQPU", "B003O6EETU", "B008E6ZXRM", "B00DBCAT3W", "0765370123", "0765315734", "B002BSA1MQ", "0765323974", "B002I0H79C", "0765364670", "B0067KR316", "B009B8YZKS", "B000FRS9II", "B002Q21X7Y", "1465411593", "B00519C7CE", "B00269QLI8", "B000ZK9QD2", "B0016BTNTQ", "B002GN8HU4", "B0016B28Y8", "B000HX1P72", "B003O6HOAG", "B009B8YZIK", "B0054U53O4", "B003JVKHEQ", "B002I0JGDM", "B005J66WHA", "B00503E8S2", "B001RB6EL0", "B002VL2HA2", "0857685627", "0744012325", "0785140220", "B0041OWQUI", "B000P46NMK", "B001E22VQO", "B001A4MTGS", "B000VESHEQ", "0744014654", "B002V16T0Q", "B000RHZ9JI", "B003O6EEEK", "B0010AYJXI", "0756688698", "B000TG530M", "1781163243", "B0062VM8M4", "B00ECV4DBA", "B002I0HAC6", "B004ZGYZXS", "B002BXJ87K"], "bought_together": ["B0050SYY5E", "B001HWB68K"], "buy_after_viewing": ["B001HWB68K", "B0050SYX8W", "B0050SYY5E", "B002BSA20M"]}, "salesRank": {"Video Games": 11748}, "categories": [["Video Games", "Xbox 360", "Games"]]}