{"asin": "B000NK6DZI", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "With the PowerShot TX1, Canon takes a futuristic wish-list and makes it a reality. This is an Elph-sized camera with a whopping 10x optical zoom, that not only captures 7.1-megapixel images, but HD movies, too! The stylish vertical design in stainless steel houses plenty of premium advancements, including Image Stabilizer Technology, DIGIC III Image Processor, Face Detection Technology and automatic Red-eye Correction. And because you&#x92;ll want to take this compact wonder everywhere, it&#x92;s equipped with a built-in lens cover and tough new scratch-resistant, anti-reflective coating on the LCD screen.PowerShot TX-1 HighlightsDIGIC III Image ProcessorWith DIGIC III, you get images of superior quality, the camera functions at top efficiency and battery life is significantly enhanced. What&#x92;s more, DIGIC III enables Canon&#x92;s newly improved Face Detection Technology and Red-eye Correction to give you better, more true-to-life people shots. Simply press the Shutter Button halfway down, the PowerShot TX1 automatically pinpoints the faces in the scene and chooses the ideal focus point. To keep every face looking bright and natural -- without scary red eyes -- the camera controls exposure settings and flash, so every shot is just what you were shooting for.DIGIC III features Face Detection AF/AE, which finds multiple faces in the frame and sets the most suitable focus point, when the shutter button is pressed halfway. And an additional new feature, Face Detection FE adjusts the flash, based on a person&#x92;s face on the screen. Exposure and flash are controlled to ensure proper illumination of both the faces and the overall scene, eliminating the common problem of darkened or overexposed faces.Red-eye Correction detects and automatically corrects red-eye during playback for both regular and flash photography. In unusual cases where red-eye is not automatically detected, it can easily be corrected manually during playback mode from the LCD screen.iSAPS Technology is an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the fast DIGIC III Image Processor to improve focus speed and accuracy, as well as exposure and white balance.Full movie capabilitiesThe PowerShot TX1 is a powerful, highly-advanced tool for recording movies. You&#x92;ll experience the unprecedented HD clarity of 720P recording at 30 fps. The camera&#x92;s Face Detection AF feature for still images is also available in movie mode: faces are detected and properly focused for a measurable improvement in movie quality. Sound is recorded in stereo, and 1080i component video playback is available for a true HD experience.1.8-inch vari-angle, wide-view LCDPull out the wide-view LCD and turn as needed to get just the right angle for your images and movies. The screen&#x92;s highly durable new coating resists scratches and fingerprints and is easy to wipe clean. New anti-reflective coating keeps the picture clear and visible even in bright sunlight.ISO 1600 with ISO Auto ShiftThe PowerShot TX1 features ISO 1600 with ISO Auto Shift that increases the ISO sensitivity to where camera shake does not occur. Then camera shake can prevented and the ISO speed setting changes each time, automatically.Elegant all-metal construction with built-in lens capWhen you own a camera as compact as the TX1, you&#x92;ll want to take it everywhere. This camera is up tothe challenge with high-grade all-metal construction.The built-in ens cap opens when the camera is turned on and closes when the camera is turned off -- no worrying about scratches and smudges.Shooting modesWith 14 Shooting modes, including 7 Special Scene modes, you&#x92;re ready for whatever shot comes your way.AutoThe camera chooses all the settings so you can concentrate on your subject.ManualThe ultimate in creative control, you set ISO speed, exposure compensation and white balance.Color AccentChoose to retain a single color in your image while other colors turn monochrome.Color SwapSelect a color and replace it with a color you specify for special effects.Super MacroClose to almost touching distance to capture the subject detail.Stitch AssistBuild awe-inspiring panoramas by neatly aligning sequential images.MovieShoot in 720P HD (30 fps/30 fps LF), VGA (30 fps/30 fps LP), or QVGA (60 fps/30 fps).Special Scene ModesPortraitThe camera sets a large aperture, focusing the subject and artistically blurring the background to make your subject \"pop.\"FoliageCapture brilliant shots of autumn foliage, greenery and blossoms.SnowShoot clear snow scenes without darkened subjects or an unnatural bluish tint.BeachGet clear shots of people at a sunny beach without darkened faces.AquariumAchieve proper flash-free exposure and natural hues at indoor aquariums.IndoorReduce blur and improve color accuracy when shooting handheld indoors.Night SnapshotGet natural-looking pictures with brighter backgrounds and subjects lit by flash.The complete print solutionThe PowerShot TX1's Print/Share button makes direct printing easier than ever. Simply connect the TX1 to a Canon CP, Selphy or PIXMA Photo Printer or any PictBridge compatible photo printer, press the lighted Print/Share button and print! Also use the Print/Share button to transfer images to a computer (Windows and Macintosh).Print your own ID photos in 28 different sizes or use the Movie Print function to output multiple stills from a recorded movie on a single sheet with a Canon Selphy Compact Photo Printer.For desktop large-format printing, try one of the Direct Photo Printers that allow you to print without a computer in one of two ways: plug your compatible PowerShot camera into the Direct Photo Printer using the supplied USB interface cable, or simply insert a memory card into the supplied adapter. You can also connect the printer to your computer for more options. Print high-resolution, borderless images as postcards or 8.5 x 11-inch sheets within minutes.Compact Photo Printers let you produce versatile, fun 4 x 6-inch postcards, 4 x 8-inch wide greeting cards or credit card size prints in just two easy steps: connect and press/print. Control the printer right from your camera's LCD screen. You get durable, dye-sublimated prints quickly with or without borders. Assortedpaper types let you create mini or credit card size labels. You can even take select Compact Photo Printers to a party or an outdoor picnic using an optional rechargeable battery.", "title": "Canon PowerShot TX1 7.1MP Digital Camera with 10x Optical Image Stabilized Zoom", "price": 10.44, "salesRank": {"Camera &amp; Photo": 13457}, "imUrl": "http://ecx.images-amazon.com/images/I/41x979ls94L._SY300_.jpg", "related": {"also_viewed": ["B001CRBTDW", "B00065L5SU", "B00AW54ZF4", "B006K551HQ", "B002GYWJ3Y", "B00AW54ZGS", "B006UMMP8C", "B00728ZAHG", "B00CQ9T00E", "B00AR95H7U", "B003VTZE4Y", "B0043D4V8M", "B002LITT56", "B001OI2YTC", "B0002A4M4I", "B001SER44W", "B006L6ZU84", "B001SER46K", "B007ROW3KM", "B00114LG84", "B00HLDFTRS", "B0097CXFCC", "B00HUESJJI", "B00EFILHB4", "B00728ZBA2", "B00BB4UKOK", "B00EFILPHA", "B003QKBVYK", "B009B0MYSQ", "B00BB4ULZI", "B00ATE7W7G", "B00EFILNV8", "B00DM8R866", "B00FRHTSK4", "B00908BMVE", "B004ZGN6MY", "B007JRB0RE", "B003VNKNEQ", "B00AWYN0BU", "B009B0MZ1M", "B00BW6LW7G", "B003VNKNF0", "B004J3V90Y"], "buy_after_viewing": ["B001CRBTDW", "B003VNKNEQ", "B00065L5SU", "B000ANCPNM"]}}