{"asin": "B003D15K44", "related": {"also_bought": ["B002FFT8Z6", "B00KMRGF28", "B006DUDWXI", "B00BWF5U0M", "B007S642BW", "B0010HE6LG", "B0017T70B0", "B001B077PO", "B002782LTG", "B007MHFMMU", "B00CU2K6MS", "B0032GU1LW", "B0060WDI5Q", "B00CPIF4G0", "B003YT578O", "B00DDY8U02", "B00D6WF80G"], "bought_together": ["B002FFT8Z6", "B00BWF5U0M"], "buy_after_viewing": ["B00DBV28TG", "B006DUDWXI", "B0027C8M8G", "B002782LTG"]}, "title": "NEW Slim USB 2.0 External Slim USB 2.0 CD-ROM Drive for all Laptop notebook", "price": 12.56, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41i6mn5KhdL._SY300_.jpg", "brand": "AGPtek", "categories": [["Electronics", "Computers & Accessories", "External Components", "Optical Drives", "CD Drives"]], "description": "Need to load files, install programs or just play music from a CD-ROM disk to your netbook? Then you need one of our brand new External USB Powered CD Drives.This very sleek and slim CD-ROM Drive reader complements the portability of your netbook totally. It will power itself from your netbook power supply via the USB ports and needs No Heavy or Bulky AC/DC Adapters. If youre on the road or out and about and you need a totally portable CD-ROM drive then this is it!Included with this fantastic external CD-ROM drive are two USB cables. One is for the transfer of information from your drive to your netbook with the other to power your external drive from a separate USB port on your netbook. Also included is a Driver CD for Windows 98 and a small installation guide.This external USB powered CD-ROM drive will work with Microsoft Windows XP / Vista / 2000 / ME / 98 MAC.Features:No external power adapter required,so you can read CD-ROM, CD-R and CD-RW media in a completely mobile environment USB connectivity also offers easy installation to desktop and notebook computers Low power requirements - Minimal battery drain while the power is supplied by the USB port--no external power adapter requiredIt's super slim, lightweight, sturdy and attractiveUSB Portable CD-ROM Drive is built to travel easily and maximize desk spaceIt connects to your computer via a USB cable. Because the USB cable also supplies power to this device, so no external power supply is requiredPlug and Play, hot pluggable, and hot swappable features make this device convenient and easy to useExternal CD-ROM Drive24x maximum CD read speedUSB interface, USB 1.1/ 2.0 compliantData transfer rate up to 1.67 Mbytes/sec(max) when read/write the USB storage deviceWin 98SE/ME/2000/XP/Vista compatible"}