{"asin": "B005EV1R8Y", "description": "The PJD5133 is a high-performance SVGA 800x600 DLP projector with 2700 ANSI lumens and 3000:1 contrast ratio. With new slim design at only 3.2 inches height, makes it ideal to move from room to room on the campus or in the office.  This projector offers a variety of hardware and software features including HDMI, multiple PC and video input options, 1.1x manual optical zoom, vertical keystone correction, 120Hz/3D-ready, support HD video signal and integrated speaker. Filter-less design and energy-saving* eco mode provide for easy maintenance and reliable product life. The PJD5133's lightweight design is ideal for tabletop use or ceiling mounting in both classrooms and corporate offices.Key Features:2,700 ANSI lumens for clear and bright imagesBrilliantColor&trade; technology provides exceptional display qualityHDMI for true digital picture clarity6-segment color wheel design, auto source detection, support HD video signals &amp; integrated speaker3D-Ready &amp; up to 120Hz refresh rate powered by DLP&reg; Link TechnologyECO mode &amp; filter-less design for longer product life &amp; easy maintenanceNew slim design for easy mobilityOne of the best warranties in the business: 3 years on parts and labor, 1 year on lamp, and free 1st year Express Exchange&reg; service**Bright in virtually any settingUsing less watts per lumen than other comparable projectors. And with a 3000:1 dynamic contrast ratio, it&rsquo;s the bright choice for business, education and mobile presentersSettings where the PJD5133 is the perfect solution:Business - conference rooms, meetings, brainstorming, etc.Classrooms - lectures, videos, project presentations and even auditorium presentationsMobile presentations - ideal for the business travelers , on-the-road presentersBusinessEducationHomeDLP TechnologyAdvanced DLP (Digital Light Processing) technology allows you to experience crystal clear, razor-sharp and lifelike images with the same DLP technology that Hollywood relies on. For fast action, the response time is also on the order of 1,000 times faster than similiar LCD based projectors. And with no air filters to clean or change, the latest generation of DLP based projectors from ViewSonic offer amongst the lowest TCO (total cost of ownership) in the industry. Check out the TCO calculators athttp://www.viewsonic.com/viewschool/dlp-tco-calculator/BrilliantColor&trade; technologyColor is one of the most important characteristics of a good projection system, and the latest BrilliantColor technology delivers stunning all-digital clarity with lifelike color, sharp graphics and outstanding video. The sophisticated 6-segment color wheel enhances the yellow color performance that is key to accurate and vivid color reproduction. With multi-color processing, colors are richer and more vibrant with exquisite and precise detail.The HDMI AdvantageDelivers the best high-definition video and audio quality without losing any degradation. It's perfect for connecting to any high definition home entertainment devices like Blu-ray&reg; DVD players, HD gaming consoles and HD receivers.Packed with features6-segment color wheel design improves color performance and  accuracy to provide natural, vivid colorsAuto source detection senses the source input and syncs with your computer automaticallySupport wide range of digital signals from SD (480i/480p) to HD (720p/1080i/1080p)Integrated speaker ideal for multimedia applications, videos, audio-enabled presentations3D-Ready / 120Hz refresh rate powered DLP&reg; Link TechnologyWith support for TI&rsquo;s DLP Link technology, you&rsquo;ll have amazing 3D capabilities at your disposal. The projector&rsquo;s embedded emitter function means all that&rsquo;s required to unlock 3D capabilities is a pair of DLP Link compatible glasses, such as the optional ViewSonic PGD-250 active shutter glass kit*.Eco-mode saves money, power and helps the planetWith only a slight 20% decrease in brightness, the ECO-mode function can extend the life of your lamp by almost 50% and up to 6,000 hours in some cases. Other benefits of ECO-mode operation include reduced power consumption, as well as less heat and audible noise output. It&acute;s good for the environment and great for your budget. The ECO-mode function will definitely help lower your total cost of ownership (TCO).New Slim DesignAt only 3.2 inches height and lightweight 5.7 pounds, it&acute;s light and compact, making it ideal for mobility and portability.We&acute;ll help you calculate the distanceChoose a projector that fits your space, as well as your lifestyle and needs. Simply determine your desired image size and then cross reference on this chart to locate the required projection distance. An interactive distance calculator specific to each and every ViewSonic projector is also availablehereto help calculate desired image size and throw distance based on your screen size.Piece of mind with one of the best warranties in the businessBacked by our 20+ year reputation for quality and reliability, ViewSonic offers one of the industry&acute;s best overall projector warranty with 3-year limited parts, 1-year lamp and first year free Express Exchange&reg; service. Don&acute;t be fooled by seemingly longer warranties out there in the market that exclude the more vulnerable systems and moving parts.", "title": "ViewSonic PJD5133 SVGA DLP Projector - HDMI, 2700 Lumens, 3000:1 DCR, 120Hz/3D Ready, Speaker", "price": 349.99, "imUrl": "http://ecx.images-amazon.com/images/I/41ZVWGV-sNL._SX300_.jpg", "related": {"also_bought": ["B005NAX2Q6", "B0028YCR9I", "B00CVTLN8Q", "B000IJY8DS", "B000TUDOQ8", "B0033SC2SE", "B000HRYV38", "B0018MRK6Q", "B007KFMV3M", "B007X68CEK", "B000V1JUIG", "B000V1LX40", "B00028DAKW", "B004A7Z1OO", "B0002855KK", "B007KA07YM", "B004UG3BQK", "B0017S37IG", "B000B60LVG", "B007KA3K1O", "B000QSONTK", "B003NE67GG", "B004XGXGJE", "B00CETTH0Y", "B0035IV81E", "B000O5N5AI", "B00AO14KBU", "B003XM73P2", "B004G2VJM6", "B000QKKAPE", "B00A9S3OOC", "B001EPVOQY", "B000QDGDIY", "B000AMUL9S", "B005J0HRES", "B000F5NFTS", "B004GW25WY", "B005NAX3B0", "B007MYZE26", "B000IDC0K2", "B006U1YUZE", "B00AASENXC", "B0002861NK", "B003ICXDGU", "B0002861MG", "B000V1R966", "B004CADYDO", "B004A7Z1OE", "B000V6R2OK", "B006CT46DU", "B0018M7ZI4", "B000X2MBPC", "B000PHI820", "B000298U7Y", "B00316263Y", "B0006PKY5A", "B002GHBUTK", "B004A7Z1MG", "B0002L5R78", "B0002U1TJY", "B000B7NCRU", "B0029HHIDY", "B004YEFLGQ", "B004Q72PEM", "B003L1ZYYM", "B005LQ83EI", "B0019EHU8G", "B000MX5TQK", "B0027VT6V4", "B007I5JT4S", "B0085JBI6S", "B0072LEKMO", "B000HQJRA6", "B000I5LACO", "B0031TRZX2", "B004OBYYWG", "B006FKPLFS", "B000EGI7V4", "B0018MB9U4", "B004LDG9IO", "B001R0EVMA", "B0027NTUMC", "B002GHCOUY", "B000298U7O", "B006Y5UV4A", "B006WC7HO2", "B000B622KE", "B001IF252M", "B001E6CYCQ", "B000Q87LM6", "B004A7Z1MQ"], "also_viewed": ["B00A9S3OOC", "B00511ITEM", "B004UG3BQK", "B005J31BCY", "B004ULKUWI", "B00A9S3OMY", "B00ARW0OFM", "B004VELBAO", "B00C8H690I", "B00465W7EC", "B009PK2MNY", "B00BBM0664", "B00GMGDFPI", "B00ARW0NZI", "B00830RZ16", "B002AQQJTI", "B00CPV2TM4", "B003N349NU", "B00CY9PWJY", "B00F0DI8LK", "B002RL8IHM", "B003NMW1HC", "B008X1BV2Y", "B00BRM8YM6", "B0033PRQE2", "B002LARYMO", "B002G0CWSU", "B0046SQFZG", "B004XGXGJE", "B00IF1EQ6K", "B002QC17VG", "B002ZWU33U", "B004GVYJJC", "B00E87E1LK", "B00FYIFQ6G", "B00E4JEDWE", "B0058DFIL0", "B005J31BCO", "B00E87E1OM", "B0044UHJWY", "B004YRUDKM", "B00G87AW3E", "B00FWUQV92", "B00AX9Z5YO", "B00C92WOHO", "B00A0XLIH6", "B00CETTH0Y", "B00ITYLPSU", "B009EPSJXM", "B0085ZJTAE", "B009KG8VNS", "B002OEBMT8"]}, "categories": [["Electronics", "Computers & Accessories", "Video Projectors"]]}