{"asin": "B000P46NMA", "description": "Assassin?s Creedis the next-gen game developed by Ubisoft Montreal that will redefine the action genre. While other games claim to be next-gen with impressive graphics and physics,Assassin?s Creedmerges technology, game design, theme, and emotions into a world where you instigate chaos and become a vulnerable, yet powerful, agent of change.The setting is 1191 AD. The Third Crusade is tearing the Holy Land apart. You, Altair, intend to stop the hostilities by suppressing both sides of the conflict.You are an Assassin, a warrior shrouded in secrecy and feared for your ruthlessness. Your actions can throw your immediate environment into chaos, and your existence will shape events during this pivotal moment in history.Key FeaturesBe an Assassin: Master the skills, tactics, and weapons of history?s deadliest and most secretive clan of warriors. Plan your attacks, strike without mercy, and fight your way to escape.Realistic and responsive environments: Crowds react to your moves and will either help or hinder you on your quests.Action with a new dimension - total freedom: Eliminate your targets wherever, whenever, and however. Stalk your prey through richly detailed, historically accurate, open-ended environments. Scale buildings, mount horses, blend in with crowds. Do whatever it takes to achieve your objectives.Relive the epic times of the Crusades:Assassin?s Creedimmerses you in the realistic and historical Holy Land of the 12th century, featuring life-like graphics, ambience, and the subtle, yet detailed nuances of a living world.Intense action rooted in reality: Experience heavy action blended with fluid and precise animations. Use a wide range of medieval weapons, and face your enemies in realistic swordfight duels.Next-gen gameplay: The proprietary engine developed from the ground up for the next-gen console allows organic game design featuring open gameplay, intuitive control scheme, realistic interaction with environment, and a fluid, yet sharp, combat mechanic.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51oU5LaIJAL._SY300_.jpg", "related": {"also_bought": ["B009GZX49Y", "B00269DX5W", "B0050SXFKE", "B003L8DXOI", "B004YVOCV4", "B00BMFIXKQ", "B002I08RR8", "B008CP6MA2", "B008CP6RUW", "B007SRM5U6", "B003C1I06U", "B004J6I0YO", "B003O6EDSM", "B001SGZL2W", "B0016B28WU", "B002ZJNWWC", "B0055202HE", "B000FQ2DTA", "B002I0F5M8", "B009WI7VAS", "B0050SXVK8", "B000X1TC0U", "B007TYC8MI", "B001JKTC9A", "0761555579", "B001NIP3EG", "B0017ZIIK6", "B001D7T2VC", "B0050SWZHS", "B0050SWUTQ", "B0056WJA6M", "B000UW21A0", "B008PQU3E4", "B005C2D1YI", "B003O6E6NE", "B0050SXLQC", "B0050SXX88", "B0012N94WO", "B000HKP88C", "B002ELCUUG", "B002NN7AKU", "B002BRZ6UE", "B00503E9FY", "B008CP6Q6M", "B0088MVP3S", "B000WMEEBM", "B002I0J5UQ", "B000TVT7U4", "B003JVCA9Q", "B00BSECSP2", "B001NX6GBK", "B003O680RM", "B004HCYVO8", "B00309XHD0", "B003O6CBIG", "B00CJ7IUI6", "B001ASJIS6", "B0022TNO7I", "B000ZK7ZOE", "B007A7UJ4S", "B004EQCCI4", "B0030F1DOO", "B0050SXGU8", "B003O6E1JS", "B002I0K5NC", "B00BMFIXOW", "B002I0J6DC", "B004HYK8Y8", "B000P297EI", "B008CP6RWU", "B00IA2NYT4", "B007CM0K86", "B00DJ42BUQ", "B002I0J82G", "B000R39GPA", "B0050SXEM8", "B005VBVQDI", "B0015AARJI", "B0088MVOUC", "B005N4HBIW", "B002Z7BE24", "B003R7H5TC", "B0012N746W", "B001AWBYNE", "B000ZK9QCS", "B004HVKA9O", "B0050SX7BQ", "B004NRN5EO", "B0045U01OG", "B0084380ZM", "B00AYSV89K", "0761563237", "B0012N5MIO", "B00J48MUS4", "B000ZK9QC8", "B0042GW7BI", "B00B67ZTUW", "B00CMD78O4"], "bought_together": ["B009GZX49Y", "B0050SXFKE"], "buy_after_viewing": ["B00BMFIXKQ", "B009GZX49Y", "B0050SXFKE", "B00269DX5W"]}, "salesRank": {"Video Games": 981}, "categories": [["Video Games"]]}