{"asin": "B0002UM0JW", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Mice"]], "description": "The World's First Laser Mouse. With 20x the tracking power of optical sensors, the Logitech MX1000 Laser Cordless Mouse takes tracking precision to a revolutionary new level. Step up to laser and experience the next great advancement in mouse technology!If you thought smooth tracking optical sensors were an advancement over mechanical ball-based mice, let us introduce you to the mouse that takes precision and performance to a whole new level: the Logitech MX1000 Laser Cordless Mouse, the world's first laser mouse.Laser vs. OpticalNow optical is obsolete. And         your computing experience will never be the same.Featuring the Logitech MX Laser Engine, the MX1000 delivers a new pinnacle         of performance no optical mouse can match. With an incredible 20x more         sensitivity to surface detail -- or tracking power -- than optical, laser         can track reliably even on tricky polished or wood-grain surfaces. And         the MX1000 offers even more advanced features that will make you more         productive and more comfortable.20X Tracking PowerBy revealing significantly greater surface detail than optical mice, the         MX1000 laser mouse tracks precise on previously impossible-to-navigate         surfaces, such as highly polished or wood-grain surfaces.In tests on these demanding surfaces, the invisible laser light reveals         20 times greater detail when compared to its LED-based counterparts.The result is the MX1000 Laser         Cordless Mouse, a next-generation mouse that harnesses precision laser         light to track on surfaces where optical mice falter.FeaturesRechargeable:Rapid-charging base station makes sure the mouse           is always ready, and the lithium-ion battery never needs replacingFast RF cordless:Cordless performance that equals USB corded           connectionNew thumb-button controls:Universal page forward and back,           plus an application switch that quickly moves between open windowsSuperior grasp:Deep-sculpted thumb support for incredible           comfort, and outside finger grips for enhanced controlIlluminated 4-level battery indicator:Precisely monitor battery           strengthPowerful scrolling system:Wheel tilts for side-to-side scrolling,           Cruise Control rocker for speed-scrolling up and down, and zoom with           a click of the wheel", "title": "Logitech MX1000 Laser Cordless Mouse", "price": 283.0, "imUrl": "http://ecx.images-amazon.com/images/I/51GSWC1142L._SY300_.jpg", "brand": "Logitech", "related": {"also_viewed": ["B002HWRJBM", "B00BFOEY3Y", "B001DJ64C0", "B000HCT12O", "B000HCRVUS", "B000AY5Y5W", "B000IF80ZE", "B008J0ZOF4", "B003VAM32E", "B0000CEPDF", "B007XZX2K0", "B003TG75EG", "B000AY5ZIS", "B000TKHBDK", "B000QJ3DZE", "B004P3X4V0", "B0011FCV8W", "B00165XQWW", "B00E4MQODC", "B003NR57BY", "B009APC0R2", "B003YJC6II", "B001660084", "B0034XRDUA", "B001F7AP1Q", "B000GABCY2", "B00F9B1QK8", "B00CJD4HD2", "B000BFO4OC", "B000AOIP9O", "B004E2KO88", "B000BFNT2A", "B0006216BE", "B0058TDROE", "B006JRIDHK", "B002HWRJBC", "B005KSAHZU", "B0011FQUQG", "B002B3YCQM", "B00ADHY0OW", "B005CDM6AC", "B0007Z1M50", "B000ODN7VM", "B0082D5660", "B00HHZF1PU", "B007F5LYVM", "B0093HLUTQ", "B00B0TXEEY", "B002APDFA0", "B00DR8LB4Q", "B0054JGGGY", "B0001YGIB0", "B008AGF6UU", "B009VLRPCK", "B001DJ9GOS", "B000T8CWFE", "B005NB9RFK", "B00CBQO930", "B006YK0LSQ"], "buy_after_viewing": ["B002HWRJBM", "B003NR57BY", "B00BFOEY3Y", "B003TG75EG"]}}