{"asin": "B001VJ4DHK", "description": "Mass Effect 2is the sequel to BioWare's hit space-based role-playing game (RPG),Mass Effect. A single player adventure,Mass Effect 2allows players to continue the adventures of the fully customizable series hero, Commander Shepard, as you take on a whole new adventure and cast of supporting characters. Features new to this latest release in the franchise include the ability to import game save files from the originalMass Effectgame to continue the adventure in an unbroken fashion, a new damage system, a more flexible dialogue game mechanic and more..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }StoryTwo years after Commander Shepard repelled invading Reapers bent on the destruction of organic life, a mysterious new danger has emerged. On the fringes of known space, something is silently abducting entire human colonies. Now Shepard must work with Cerberus, a ruthless organization devoted to human survival at any cost, to stop the most terrifying threat mankind has ever faced. To even attempt this perilous mission, Shepard must assemble the galaxy&rsquo;s most elite team and command the most powerful ship ever built. Even then, doubters say it would be suicide. Commander Shepard intends to prove them wrong.The return of Commander Shepard.View larger.A new cast of characters.View larger.Along with familiar faces from the past.View larger.New damage and dialogue systems.View larger.Integration with original game.View larger.GameplayAn space-based action RPG like its predecessor, gameplay inMass Effect 2revolves around the player's particular version of Commander Shepard and continuing development of this character as the game proceeds. As the game opens a variety of character classes are made available to the player, with talents, both exclusive and general, associated with each. With experience these talents are leveled up, resulting in the unlocking of related abilities and/or entirely new talents. The player has the ability to customize their Commander Shepard in a number of ways including physical appearance, gender, and certain aspects of their personal history, with the rub being that these choices can influence things like available missions, dialogue choices with non-player characters (NPCs), and character background.Accompanying this main character are a number of preset supporting characters that the player can direct and develop relationships with, which again, will alter the outcome of the story. All the characters from the original game make an appearance inMass Effect 2, but the immediate characters surrounding Commander Shepard are new. Additional new features that players can expect to experience include new alien races; a more realistic damage system; a new heavy weapons system allowing for maximum damage; a regenerative health system; a dramatic increase in the number of character animations available to Shepard; and updates to the dialogue mechanic used when conversing with NPCs.Integration with the OriginalMass EffectMass Effect 2allows players of the originalMass Effectgame to import save games to continue the story of their own Commander Shepard. In doing this, the decisions that were made in the first game will affect the events of the second game. In addition, characters from the first game will return, as long as they were not killed off by the player in the first game. On the other hand, new players coming to the series for the first time inMass Effect 2will start a brand-new character, discover the events of the previous games as they progress and embark on a thrilling stand-alone adventure that does not require the previous game for play.Key FeaturesFuturistic Weapons- Choose from 19 different weapons, including devastating heavy weapons that can end a battle in seconds.Elite Specialists- Recruit up to a dozen of the galaxy's most dangerous operatives to help you in your mission. Train and equip your team to survive insurmountable odds.Explore the Galaxy- Scan planets to uncover unique secret missions in theMass Effectuniverse.Integration with OriginalMass Effect- Players of the firstMass Effectcan import save games to continue the story of their own Commander Shepard. New players will find a thrilling stand-alone adventure awaits them, a polished and action packed journey that surpasses the first game in nearly every possible way.Intense Third-Person Combat- Increased intensity with precision shooter controls to let you control the action and overcome insurmountable odds.New Damage System- New location based damage system allows for targeting of key weak points, blasting off limbs, igniting enemies, or crippling and disabling enemy troops.Character Customization- Choose a player class, customize your appearance, and tailor your own abilities and strengths. As you progress, so do Shepard&rsquo;s abilities.Improved Dialogue Mechanic- Improved NPC conversation system where Commander Shepard can take matters into your own hands &ndash; interrupting or using force to get the answer required.System Requirements:Minimum Specifications:Recommended Specifications:OS:Windows XP or Vista.Processor:2.4+ GHz Intel or 2.0+ GHz AMD2.6+ GHz Intel or 2.4+ GHZ AMDRAM:1GB+ (XP), 2GB+ (Vista)2GB+Disc Drive:8x DVD-ROM drive or betterHard Drive:12GB or moreVideo Card:NVIDIA GeForce 6 series (6800GT or better), ATI 1300XT or better (X1550, X1600 Pro and HD2400 are below minimum system requirements)NVIDIA GeForce 7900 GTX or higher. ATI X1800 XL series or higherSound Card:DirectX 9.0c compatible sound card and drivers &ndash; 5.1 sound card recommendedInput Device:Mouse and keyboard", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/5137BYvnUxL._SY300_.jpg", "related": {"also_bought": ["B00140P9BA", "B004FYKWZU", "B0015M0PYI", "B002I0HKRQ", "B002BS47YE", "B0016BVYAM", "B003GSZAOY", "B001Q96ZNU", "B001IK1BWC", "B003P9C6EQ", "B0047THYWC", "B003ICGL7I", "B0045ZB66I", "B003TIVSM4", "B005C2D2H4", "B005G4CXPK", "B002I0HJ68", "B0050SZ0SY", "B002BXKJA0", "B004H80TUC", "B002I0KOSI", "B000PS2XES", "B004FUGKSW", "B0019C4MU2", "B0050SZ836", "B002I0IHIM", "B004HYIAPM", "B0012LGHZI", "B003336KG4", "B0050SWTS8", "B001B5U80K", "B003ZULWQI", "B002BWONOY", "B000UU5T7E", "B003L8DXS4", "B0050SZES0", "B0044S8DA8", "B003FSFSEW", "B001O4YSTU", "B004ML9WKC", "B001TOQ8R0", "B001AH8YSW", "B005XFGZ4W", "B006P5RW3M", "B003VJNPPE", "B003O2182A", "B000X9FV5M", "B002I0JIQW", "B001UWGDPS", "B00BU3WUU4", "B0065NP39E", "B002V14VOC", "B00CJ7IUIQ", "B0016G88RO", "0307467066", "B00FB3UPB0", "034549816X", "B0042WXQ62", "B002V1GFHS", "B00178631E", "B003Q55Y5C", "B0029ZBZ0I", "B007BYWJ8Y", "B005OGYVKU", "B00006IR62", "0700099956", "B004QEWVTO", "B00B70WKUK", "B0010EK3SE", "B001E8QA2E", "B008E6ZXA4", "B0050SZ2EQ", "B002NIP2SM", "B0079NGSDO", "B005EZ5GQO", "B008IYCVK2", "B002XTYK9S", "B000MK694E", "B004D8QAAO", "B001LKM0EW", "B0000A1VER", "B007TRXBJY", "B0036CCNDG", "B0030MOXA8", "B0013RC1W4", "B004JQDI8M", "B002SU4QG4", "B002BWONIU", "B0000NSZMM", "0307891488", "B0029E1VGC", "0345520726", "B001KU7XMW", "B0014UGK4U", "B0016N4A7E", "B006O4YSJ0", "B00ENFVUGQ"], "bought_together": ["B00140P9BA", "B004FYKWZU"], "buy_after_viewing": ["B0050SZ980", "B00140P9BA", "B004FYKWZU", "B002I0HKRQ"]}, "salesRank": {"Video Games": 4087}, "categories": [["Video Games", "PC", "Games"]]}