{"asin": "B000F49RAA", "description": "The Logitech mm50 Portable Speakers for iPod utilize 3-inch pressure drivers to maximize bass and minimize distortion, creating the full experience of home audio for life on the go. The use of 3-D sound processing also widens the stereo effect, so that this system's sound seems to come from an area about two feet wider than the speakers themselves. The speakers are powered by an AC adapter or rechargeable Li-ion batteries, come with a credit card-sized wireless remote, and are easily compatible with all docking iPods. If you don't have an iPod with a dock connector, just use the auxiliary outlet.You also get a protective case and 2-year limited warranty that give you both security and peace of mind. Should you find yourself overseas with these speakers, the AC adapter is international voltage capable, truly letting you enjoy your iPod's music wherever you go. The Li-ion batteries last up to 10 hours, and you can charge both the speakers and your iPod simultaneously.What's in the Boxmm50 portable speakers, remote control, AC adapter, protective travel case, and user's manualiPod CompatibilityiPod nano 1G,iPod nano 2G,iPod mini,iPod 4G (Clickwheel),iPod Color,iPod 5G/5.5G Video", "title": "Logitech mm50 Portable Speaker System for iPods (Black)", "price": 113.95, "imUrl": "http://ecx.images-amazon.com/images/I/41VYnYY5ujL._SX300_.jpg", "related": {"also_viewed": ["B003VANOI6", "B001G5Z82I", "B000ARSLB8", "B001FWXDZQ", "B002I3OZ7G", "B000UPBUP4", "B000UPA82U", "B005KQ2O26", "B0017IZ8ZQ", "B008P5A5YI", "B003SX0NG2", "B003Z9L390", "B007TLFE0E", "B0014XKQY2", "B002I636XM", "B00EB2YDWO", "B001DLTDQC", "B005JW6WQU", "B003VAHYXW", "B008CHY7TS", "B007JAQBZW", "B009CWRVH2", "B00D5767ZM", "B000KE48CM", "B005EWB37S", "B00C2ALYII", "B001EXMEM4", "B003ARSO08", "B00B7D4CRQ", "B00GHY33SY", "B0094S35QU", "B00ALWIV12", "B00CMNZ01C", "B009A5EIWC", "B00F6AVFK8", "B0094S354W", "B00FSB6B2W", "B00EJDHC6Y", "B0089ZV1WY", "B007ROT8HI", "B00D5Q75RC", "B004HHICKC", "B007R6HUFI", "B007R6HUEE", "B004E10KI8", "B00D6OHHEE", "B006AXRR3Y"], "buy_after_viewing": ["B003VANOI6", "B007TLFE0E", "B001G5Z82I", "B00EB2YDWO"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}