{"asin": "B003B3P2C4", "description": "Get street smart with the TomTom XL 340TM--complete widescreen navigation, featuring Lifetime Traffic and Map Updates. Outsmart traffic and minimize delays with Lifetime Traffic Updates. Based on incoming traffic events, your device will suggest alternate routes. And, with Lifetime Map Updates you'll always drive with the latest and most accurate maps. On average, 15% of the road network changes each year, so it is important to have the most up-to-date maps. With the XL 340TM you'll always stay current.Complete widescreen navigation, featuring Lifetime Traffic and Map Updates.Expand your horizons with a 4.3\" extra-wide touchscreen.The award-winning Fold &amp; Go EasyPort mount folds into the back of the device for maximum portability.Switch on and go right out of the box. Spoken turn-by-turn instructions including street names will guide you to any address in the US, Canada, and Mexico--including more than 7 million preloaded points of interest. The TomTom XL 340TM is complete, widescreen navigation.Only TomTom has IQ Routes Technology* which shaves time off even the shortest trips by calculating the fastest route based on time of day you are traveling. You'll always drive the smartest, most efficient route while saving time, fuel and money. Advanced Lane Guidance** uses photorealistic images to bring even more clarity to complex multi-lane exits so you can be more confident on the road.With TomTom Map Share technology you can instantly modify street names, street direction, POIs, road speeds and turn restrictions on your own device. The \"Help Me!\" menu provides added safety features so you can easily access local emergency providers. The award-winning Fold &amp; Go EasyPort mount folds flat against the device, making it easy to take it with you from car to car.Maps of US, Canada &amp; Mexico with Map SharePreloaded with maps of the US, Canada and Mexico. TomTom has the most accurate maps and with TomTom Map Share technology you can instantly modify street names, street direction, POIs, and more on your own device and receive daily verified updates from TomTom. Spoken turn-by-turn instructions and 3D graphics will guide you to any address in the US, Canada and Mexico, worry free.Lifetime Traffic &amp; Map UpdatesEnjoy a lifetime of easy driving with two great features from TomTom. LIFETIME Maps guarantees you receive four new editions of your TomTom map each year to ensure that you are always navigating with the industry's most up-to-date map. And, LIFETIME Traffic sends updates to your TomTom every three minutes, so you can always steer clear of traffic delays and take the fastest route possible to your destination.7 Million POIsPreloaded with more than 7 million points of interest in over 60 destination categories. Easily find millions of gas stations, restaurants, hotels, ATMs and more on your route. Or, seek out a new tourist attraction, nightlife spot, or shopping center and navigate directly to it. Customize by adding your own points of interest.IQ Routes TechnologyTomTom IQ Routes Technology puts the driving experience of millions of TomTom users into your maps to shave time off even the shortest trips. Calculates the fastest route possible based on time of day. With TomTom IQ Routes you'll always drive the smartest, most efficient route. IQ Routes saves you time, fuel and money.Traffic isn't the same during Monday morning rush hour as it is on a lazy Sunday afternoon. Heavy traffic, rotaries, traffic lights, and even pedestrians can slow you down. The route you need changes depending on the day and time, so the shortest route isn't necessarily going to be the fastest. With TomTom IQ Routes you'll always drive the fastest route.Advanced Lane Guidance*TomTom Advanced Lane Guidance gives you extra clarity when navigating difficult junctions by showing you which lane to take, so you won't miss your turn or have to make sudden, dangerous lane crossings. Photorealistic images and a pulsing green arrow indicate exactly which lane to use, so you can go confidently.Spoken Street NamesAnnounces turn-by-turn directions aloud, including street and place names.4.3\" TouchscreenExpand your horizons with a 4.3\" extra-wide touchscreen. An additional 20% in size allows an expanded driving view and easier menu operation.Fold &amp; Go EasyPort MountThe award-winning Fold &amp; Go EasyPort mount provides maximum portability. The EasyPort mount folds neatly onto the back of the device, so both are small enough to fit into your pocket or bag. The EasyPort mount makes your device even more portable so you can take it with you wherever you travel.*Feature only available in the US and Canada**Feature available in the US onlyAll TomToms FeaturePlug &amp; Go--Works right out of the box.30 Day Latest Map Guarantee--Up to date, off the shelf.TomTom Map Share--Modify your own map and benefit from others' verified changes with TomTom Map Share.Help Me! Emergency Menu--Easily access local emergency providers such as police, fire stations and hospitals.TomTom HOME--Always up to date.Fuel Price Service (optional)--Know more, pay less.What's in the BoxXL 340TM GPS device, EasyPort mount, USB cable, adhesive disk, car charger w/ integrated traffic, and user guide + LT maps voucherAbout TomTomFounded in Amsterdam in 1991, TomTom has established itself as a global leader in navigation by being an innovative company with a strong brand, clear customer focus, and high quality products and services.TomTom is the world's leading navigation solutions provider with navigation products sold in 30 countries and in over 20 languages. To further our commitment to car navigation, TomTom acquired Tele Atlas maps in 2008 so we can continually provide the most up-to-date maps and intelligent routing.We have our own mapping company!Did you know that every year roads change by up to 40% in high-growth areas? Tele Atlas manages this by using the world's most comprehensive systems to identify and incorporate these changes into our maps with unprecedented levels of speed and accuracy. All TomTom devices benefit from the Tele Atlas advantage--more coverage, more points of interest, and more freshness and accuracy.Why TomTom?At TomTom, we believe that personal navigation should be as easy and safe as possible. We develop smart technology that gives you straightforward solutions, innovations to make life easy.", "title": "TomTom XL 340TM 4.3-Inch Portable GPS Navigator (Lifetime Traffic &amp; Maps Edition)(Discontinued by Manufacturer)", "price": 104.99, "imUrl": "http://ecx.images-amazon.com/images/I/51fH%2BF72mIL._SX300_.jpg", "related": {"also_viewed": ["B004MYFTFG", "B003B3P2BA", "B003FSTAFK", "B003FSTAGO", "B001VEJEGK", "B003FSTAFU", "B004MYFTF6", "B004MYFTEC", "B007M52QEE", "B003B3P2CY", "B003FSTAG4", "B007M4Z7GO", "B002OL2NT4", "B004MYFTE2", "B007M52QR6", "B0057ODG6Y", "B003B3P2BK", "B0057ODOCA", "B004MYFTFQ", "B004W1GQ92", "B003FSTAHS", "B004J4VYG2", "B003B3P29W", "B003FSTAGY", "B007PPYXOC", "B00C9W1LT6", "B007M4Z6FG", "B004MYFTEW", "B003BEDTBE", "B005LMWPYG", "B00AXZY42W", "B001VEJEG0", "B003CYKDQ2", "B00A7LULA6", "B003ZX8B0U", "B000PCBVA6", "B003ZX8B2S", "B004MYFTDS", "B005DIBH6A", "B0052D38UE", "B00AY7NSTY", "B00AJXMWP4", "B001LK6XHM", "B000H866BM", "B003ZHVBQM", "B0057OCDQS", "B005DIBHCE", "B007M52EXM", "B001VEJEGA", "B004FWOECY", "B00AY7NUW4", "B0015EWMX8", "B00BHAC85W", "B000F007JY", "B005DIBHA6"], "buy_after_viewing": ["B007M4Z7GO", "B004MYFTFG", "B0057ODG6Y", "B004I5BUSO"]}, "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS", "Trucking GPS"]]}