{"asin": "B004HFRA7A", "description": "Garmin's GTU 10 is a handy GPS locator that combines a web-based tracking service with GPS technology, letting you keep an eye on children, pets, property--anything you want. The GTU 10 lets you choose.Web-based GPS tracking for your lifestyle--keep an eye on children, pets, or property.Click to enlarge.Track What's ImportantHow It WorksThe GTU 10 is small, lightweight and waterproof. It easily attaches to a backpack, pet collar or whatever is important to you.When you purchase a new GTU 10, it comes with 1 year of Standard Tracking (coverage dependent on GSM wireless service within the U.S.), so you'll be ready to go once you register and activate it in your Garmin account.Then, you can view the location of your GTU 10 on a map from the friendly confines of your computer. For an added level of convenience, you can download the free Garmin Tracker app for your mobile device to compare your current location to the direction and location of your GTU 10. For the ability to automatically route to your GTU 10, you can use a Garmin n&uuml;Link! device.Using your computer or mobile device, you can also:Create up to 10 geofences (virtual boundaries) for your device. When your GTU 10 enters or exits a geofence, we can send you an email or text message notification.View track history of where your GTU 10 has been.Customize device settings for optimal performance, including low battery/powered off notifications to let you know when it's time to recharge or when the device has been turned off.Make It YoursAttach your GTU 10 to what you want to track.Your GTU 10 enters or exits a geofence that you set up.Garmin notifies you with an email or text message.You can also locate your GTU 10 on your computer or mobile device.The features of the GTU 10 are so flexible, allowing you to use it to fit your lifestyle:TravelersLocate luggage and belongings so nothing gets left behind or lost.ParentsTrack your children on their way to school to make sure they arrive safely.Pet OwnersReceive notifications when your pet exits a geofence so you can go track it down.RunnersLet friends or family track your whereabouts on your daily run, or your progress on race day.What's in the BoxGarmin GTU 10, USB Cable, Attachment Case, Adhesive Strip, Carabiner Clip, Owner's Manual", "title": "Garmin GTU 10 GPS Tracking Unit (Discontinued by Manufacturer)", "price": 96.41, "imUrl": "http://ecx.images-amazon.com/images/I/411wH%2BuPMPL._SY300_.jpg", "related": {"also_bought": ["B004M4TZF6", "B004K6L3AQ", "B00AWUXDW0", "B00AWUXEM4", "B001DDG8I6", "B002I05VRC", "B007WN4RL6", "B0006N72Y8", "B00BS4FDWW", "B00GRAM3AC", "B00AGOSQI8", "B00BS44FAS", "B00CS825XM", "B00C4UU2KW", "B00BS2UEAU", "B00BS4KUCK", "B00F19Q3T2", "B00CR6DXEA", "B00BS40S4A", "B00I82U7YQ", "B00BT0IVRO", "B003Y6E6IE", "B00GLJ7UVQ", "B00D8I3WB0", "B007UR212G", "B00FKZZQQS", "B00I3J4NG2", "B005HTH78W", "B00DJ78H1A", "B00GXMIRIQ", "B004PO4HF6", "B00GLH0A1A", "B009TCD8V8", "B00IHV5E00", "B00ESJFX38", "B00GNOMT7Y", "B007MXXGNQ", "B0015H1FAG", "B00HUZTX4W", "B00HBFTMPQ", "B00GP5ECGC", "B00FW78710", "B002DVBJTK", "B00G6CDDIW", "B00BS478WA", "B00GP5E9P6", "B00G7TLO4Y", "B00CZ5SBCC", "B00AKHV7RS", "B0002BGELQ", "B00BDBXANY", "B004RK2RAU", "B00BS4M4LU", "B006VHF9TI", "B00CVQ3XLY", "B00AAIPT76", "B00CVQ4FFM", "B00A6P0EBO", "B00I4N7KBW", "B00BS2HWJQ", "B007KMNWJ2", "B00G2VK0Q0", "B000H9E9UG", "B007Y7MPQ4", "B00D7VS7WW", "B0077I42S4", "B00E8JI5BU", "B00DU8CY58", "B00D8L2JHU", "B003YI94KM", "B00F2O3PY2", "B0047ZG1LQ", "B00EKPB9JM", "B001FYQO3W", "B00CUJXGS2", "B007UR20JK", "B0081Y6QC8", "B008WWC6FU", "B000GKEXK2", "B006R3231I", "B00C57OW7I", "B009QZH6JS", "B00F9FCW7K", "B00D8PPE46", "B005UWD0EG", "B00FAJF7XQ", "B00FKZYE70", "B00CYHZTDK", "B004H7WZV4", "B00BS4MUJQ", "B009PK9QGU", "B003CFATOC", "B00F8APYSA", "B00CGTN2N0", "B006P88VSE"], "buy_after_viewing": ["B0077I42S4", "B00C57QY5Q", "B00AKHV7RS", "B001FYQO3W"]}, "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]]}