{"asin": "B000R39GPA", "description": "TheStar Warssaga will continue inStar Wars: The Force Unleashed, a videogame developed by LucasArts, which casts players as Darth Vader's &quot;Secret Apprentice&quot; and promises to unveil new revelations about theStar Warsgalaxy. The expansive story, created under direction from George Lucas, is set during the largely unexplored era betweenStar Wars: Episode III Revenge of the SithandStar Wars: Episode IV A New Hope. In it, players will assist the iconic villain in his quest to rid the universe of Jedi - and face decisions that could change the course of their destiny.Join the Dark SideYou are Darth Vader's Secret ApprenticeView larger.Use The Force to disable your enemiesView larger.Artwork of the Jedi \"Maris\"View larger.As its name implies,The Force Unleashedcompletely re-imagines the scope and scale of the Force by taking full advantage of newly developed technologies that will be seen and experienced for the first time: Digital Molecular Matter (DMM), by Pixelux Entertainment, and euphoria by NaturalMotion Ltd. Paired with the powerful Havok Physics&#153; system, these new technologies create gameplay only possible on the new generation of consoles. DMM incorporates the physical properties of anything in the environment so that everything reacts exactly like it should - wood breaks like wood, glass shatters like glass, plants on the planet Felucia bend like plants on the planet Felucia would, and more. Meanwhile, as a revolutionary behavioral-simulation engine, euphoria enables interactive characters to move, act and even think like actual human beings, adapting their behavior on the fly and resulting in a different payoff every single time.Game Features:During the period between Episodes III and IV, players hunt Jedi in the role of Darth Vader's Secret Apprentice.Unleash and upgrade the Secret Apprentice's four core Force powers - Force push, grip, repulse and lightning - throughout the course of the game, and combine them for ultra-destructive, never-before-seen combos.Examples of unleashing the Force in ways never thought possible:The Secret Apprentice won't just Force push enemies into walls - he'll Force push enemies through walls.The Secret Apprentice won't just Force grip foes to throw them aside - he'll Force grip them in midair, zap them with lightning, then drop them to the ground to explode like a bomb.In addition to new adversaries created just for the game, such as fugitive Jedi and Force-sensitive Felucians, players will also confront and associate with familiar faces from the Star Wars films, including Darth Vader.Visit locations such as Episode III's Wookiee homeworld Kashyyyk and the floral Felucia, the junk planet Raxus Prime, plus an Imperial TIE fighter construction facility.The Force Unleashedis LucasArts' first internally developed title for next-generation consoles, and it represents the first in-game collaboration of talents and technology between LucasArts and Industrial Light &amp; Magic, two companies now finally under one roof at the new Letterman Digital Arts Center in San Francisco's Presidio district.The Force Unleasheddebuts Digital Molecular Matter from Pixelux and euphoria behavioral simulation from NaturalMotion Ltd.LucasArts is preparing an unprecedented promotional effort around the launch ofThe Force Unleashed, encompassing a full line of toys and game-based action figures from Hasbro, as well as a full publishing program from Dark Horse, Del Rey and Palace Press.Meet the CastThe Star Wars Saga will continue in 2008 with LucasArts' biggest-ever video game event. Set during the &quot;dark times&quot; between Episodes III and IV,Star Wars: The Force Unleashedportrays the previously untold story of Darth Vader's Secret Apprentice -- and now you can put a face to that mysterious character as well as the major supporting cast members as LucasArts unveils the actors set to star in The Force Unleashed.The New Technology ofThe Force UnleashedWithThe Force Unleashed, LucasArts not only introduces a new chapter in theStar Warssaga, but also two completely new and innovative technologies -- Digital Molecular Matter by Pixelux Entertainment and euphoria by NaturalMotion Ltd. These groundbreaking technologies combine with Havoc physics to create true next-gen gameplay and the Force like it's never been seen or experienced before.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/61ClzPWyTXL._SY300_.jpg", "related": {"also_bought": ["B0030F1DOO", "B003FMUMBM", "B002ABZDMM", "B0037UCT7C", "B000R39GGE", "B004BCZLQ6", "B001PKHRX2", "0761559167", "B007SRM5U6", "B000WQWPP0", "B001PKHRUK", "B003C1I06U", "B003DLQTYY", "B004MXQX66", "B009GZX49Y", "B001D7T2VC", "B000P46NMA", "B0007SL1ZI", "B00BMFIXKQ", "B002I0J6DC", "B000067DPL", "B008CP6MA2", "B004HCYVO8", "B0056WJA6M", "B001NX6GBK", "B005C2D1YI", "B002I0F5M8", "B00442MAFS", "B0081B1O5A", "B003ESHRL0", "B00C7103DO", "B001IK5TJI", "B00JQHU9RC", "B006Y76HXM", "B004FUI84G", "B0050SXFKE", "B002EZH804", "B004RIACMW", "B000X1TC0U", "B000UW21A0", "B001UWGCW2", "B005THAX6K", "B000ZK9QCS", "B004FS8LYK", "B005VKRGXI", "B0012NAPNQ", "B002ZJNWWC", "B00HNYWFMC", "B002I0K6DG", "B0050SXLQC", "B0030MQPQ8", "B00269DX5W", "B0050SX7BQ", "B00114XU60", "B005UDTTQ8", "B0088I7L76", "B000ZK7ZOE", "B0050SXGU8", "B0002B90SA", "B002BXJ9VA", "B003O6EDSM", "B0088MVOUC", "0307469093", "B002BRZ712", "B000K9OR4Q", "B0026IZU5Y", "B0050SXEM8", "B0012N94WO", "B003O6E6NE", "B007CM0K86", "B0044SA734", "B000Q6ZLKM", "B00CS9NJ1I", "B001D7T2XK", "B003O65UCK", "B001SGZL2W", "B008CP6Q6M", "B0015AARJI", "B000TG72TM", "B001G33V8S", "B002I0J82G", "B003DNLDUC", "B0086V5V8G", "B003O6E67A", "B0051TLAZ4", "B00FRESXSA", "B003O6HDRU", "B00JC9SWSC", "B000FQ2D5E", "B000FPOJOS", "B003ZSJ212", "B005N4HBIW", "B0038MUCPK", "B005185SDA", "B00BGA9V2Q", "B005TH6BD4", "B0030HM2WO", "0345511298", "B0016B28WU"], "bought_together": ["B0030F1DOO", "B002ABZDMM"], "buy_after_viewing": ["B0030F1DOO", "B0037UCT7C", "B00442MAFS", "B008CP6MA2"]}, "salesRank": {"Video Games": 1444}, "categories": [["Video Games", "PlayStation 3", "Games"], ["Video Games", "Xbox 360", "Games"]]}