{"asin": "B000Y4AH3C", "categories": [["Electronics", "Computers & Accessories", "PDAs, Handhelds & Accessories", "PDAs & Handhelds"]], "description": "Updating the popular N800, Nokia has made significant improvements on its predecessor with the N810 Internet Tablet while retaining much of what made the N800 such an easy-to-use mobile multimedia/communications device. The N810 augments the onscreen keyboard with a backlit, slide-out QWERTY keyboard, and it also adds a front-facing webcam, 2 GB of internal storage (expandable via memory cards up to 8 GB), and integrated GPS. Built to be constantly in use, you'll easily stay in touch with business associates, friends, and family thanks to its VoIP calling, instant messaging and email connectivity. And with stereo audio, multimedia support and a new ergonomic design, the Nokia N800 morphs into a portable Internet entertainment device, enabling playback of streamed and downloaded content wherever you roam.The Nokia N810 adds a slide-out QWERTY keyboard that makes it easy to compose email and quickly chat with your online buddies.In addition to Internet access and GPS, the N810 also offers wide compatibility for digital audio and video playback.The 4.1-inch touchscreen has an 800 x 400-pixel resolution with up to 65K colors. You can access controls and an onscreen keyboard, or slide-out the physical QWERTY keyboard at the bottom for even easier typing. The N810 provides 2 GB of onboard flash memory and 128 MB of RAM. It also offers a single expansion slot that is compatible with Secure Digital (SD), MultiMedia, miniSD, and microSD memory cards with a size limit of 2 GB. (Adapter required for miniSD and microSD.) You can add up to 8 GB of memory when using Secure Digital High Capacity (SDHC) cards. You can also connect the N810 to a PC using the included USB cable to update software and transfer files from the PC to the a memory card.For multimedia playback, the N800 is compatible with MP3 and WMA digital audio files, Real Audio streams, and video files encoded as AVI or MPEG4 (see specifications below for full compatibility list). The N810 has two integrated speakers as well as a 3.5mm headphone jack for personal listening.The main form of connectivity is Wi-Fi (802.11b/g), and hooking up to a network is as simple as connecting with a laptop. You can also use the integrated Bluetooth wireless connectivity to hook up with a cell phone that is compatible with online data services. When connected to either a WLAN network or to a cell phone, you can make calls using the built-in Internet telephony application as well as conduct video conferencing with the built-in Web cam.The Nokia N810 is powered by maemo Linux-based OS2008, which offers a highly customizable user interface and contains various features such as a Mozilla based browser with Ajax, Adobe Flash 9 and RSS feed reader, Bluetooth headset support as well as enhanced video and audio features. The refreshed Video Gizmo, Skype and Rhapsody applications highlight some of the most popular downloads available while Boingo Wireless, Earthlink and The Cloud enable Wi-Fi connectivity across thousands of different locations globally.Perfect for use on the go, the N810 includes an integrated GPS receiver and comes with preloaded maps that enable you to browse detailed locations, search for street addresses, find various points of interest (POI) as well as nearby Wi-Fi hotspots. You can also purchase an optional subscription to the Wayfinder Maps application for enhanced mobile navigation. Other features includeIntegrated VGA web cameraSupport for IMAP4, SMTP, and POP3 emailGames: chess, blocks, mahjong and marblesIntegrated desk standUniversal Plug and Play (UPnP)Universal Plug and Play (UPnP) technology means that the Nokia N810 will discover, interact with, and control other compatible home electronic devices. This includes PCs, media centers, home entertainment systems, new smart appliances, home automation systems, networked peripherals, and Web-based services. With compatible equipment, you can stream video from your Nokia device directly to your TV, or hear music tracks stored on your PC through your living room's sound system.SpecificationsInternal memory: 2 GBMemory expansion: SD memory cards up to 2 GB, MiniSD and MicroSD cards (used with extender), and SDHC cards up to 8 GBBattery life: Up to 4 hours of continuous usage with wireless LAN on; up to 10 hours of music playback (Wi-Fi turned off)Wi-Fi: 802.11b/gBluetooth: Version 2.0 + EDR (profiles supported: HID, FTP, DUN, GAP, SPP, HSP, SAP and OPP)Video formats: 3GP, AVI, WMV, MP4, H263, H.264, MPEG-1, MPEG-4, RV (RealVideo)Audio formats: MP3, WMA, AAC, AMR, AWB, M4A, MP2, RA (RealAudio), WAVPlaylist formats: M3U, PLS, ASX, WAX, WVX, WPLKeyboard language support: English, German, French, Italian, Spanish-Portuguese, Scandinavian and RussianDimensions: 2.83 x 5.04 x 0.55 inches (LxWxD)Weight: 7.97 ouncesWhat's in the BoxNokia N810, rechargeable battery (BP-4L), travel charger (AC-4), stereo headset (HS-48), car holder (CR-89), connectivity cable (CA-101), pouch, QuickStart guide.", "title": "Nokia N810 Handheld Internet Tablet - Titanium", "price": 49.01, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/512srEQhclL._SY300_.jpg", "related": {"also_viewed": ["B00295RBNI", "B000CSVZTU", "B001VY9H1W", "B0000AQFZ9", "B007SPUSIE", "B002OB49SW", "B000X1YL2Y", "B00118ETAC", "B002WB2P4O", "B0010PRA0C", "B004UBEBB4", "B001NJAT6C", "B000PEOLAG", "B001LJSRJK", "B003ZX7RL4", "B0046LTU9G", "B000PH9NNS", "B002X3I8PQ", "B002QEBX5E", "B001DN5030", "B000YUE340", "9043413585", "B000BI7NHY", "B000246GAM", "B003ZX7RNC", "B0002DV9DM", "B001BZJ54U", "B00DIILU3C", "B000W8ZS0M", "B001SEAOC6", "B002DYGVOA", "B0056BRXWQ", "B006FCAEA8", "B005Z32UI2", "B001PII4HW", "B0014KLFN6", "B00J9XQRFG", "B005HA3Y2O", "B002QEBM96", "B003DKWX6I", "B000ZGAQ80", "B007CVTQJG", "B00E52M516", "B002VBXR2O", "B003V4AJSU", "B00422SH20", "B00IUB9VWO", "B000MXF2IK", "B001CX5UAO"], "buy_after_viewing": ["B00E45043A", "B004OB0EBQ", "B0012Y2LLE", "B00295RBNI"]}}