{"asin": "B002I0JGDM", "description": "&nbsp;&nbsp;Product Description&ldquo;Fable III&rdquo; is the latest installment to the action packedand critically acclaimed Xbox 360 exclusive franchise that has sold more than six million copies. Fans new and returning will now embark on an epic adventure, where the race for the crown is only the beginning of your spectacular journey. Five decades have passed since the events of &ldquo;Fable II,&rdquo; and Albion has matured into an industrial revolution, but the fate of the kingdom is at peril. In &ldquo;Fable III,&rdquo; you will be called upon to rally and fight alongside your people, ascend to the seat of power, and experience the true meaning of love and loss. The choices and sacrifices you make while fanning the flames of revolution, and then as you rule as King or Queen or Albion, will lead to an ever evolving world of consequences that will be felt across your entire land. This sets the stage for unparalleled action and adventure that offers even more ways to fight and engage than ever before.Throughout your journey, you will encounter a colorful cast of characters that fans have come to expect from the off-beat style and humor in the &ldquo;Fable&rdquo; games. After determining whether these characters are your friends or foes, you will either join them or fight against them in explosive combat, alone or with a friend on Xbox LIVE&reg;* . In your quest to plant the seeds of revolution, seize power and rule over your kingdom, the choices you make will change the world around you, for the greater good or your own personal gain. Who will you become? A rebel without a cause, the tyrant you rebelled against, or the greatest ruler to ever live?Product Features&ldquo;Fable III&rdquo; features include the following:Be the hero and forge your own destiny. Story telling comes to life as &ldquo;Fable III&rdquo; puts you and your hero in the center of an epic journey that traces your rise from revolutionary to ruler and beyond, along with all the action, drama and humor. Interacting with the world of Albion has never been easier or more rewarding. The Expressions system offers an ingenious new Dynamic Touch feature that allows your hero to reach out and embrace a loved one, or exact retribution against those who have betrayed you. Your hero, your faithful canine companion and even your weapons now also evolve to extremes mirroring your morality and personal style of combat. The emotional connections players will develop in the world of &ldquo;Fable III&rdquo; will lead to someof the most memorable moments ever experienced in a game.Where blockbuster action meets adventure. Your journey spans from the streets of a thriving and industrialized Albion to the surrounding battlefields.The pioneering one-button combat system allows players to easily combine different styles in their arsenal &ndash; hand-to-hand melee attacks, long-range precision shooting and wickedly catastrophic spells &ndash; to advance the one-button combat mechanic to a full scale, thrilling level that offers infinite ways to engage, experiment and compete.Choice and consequence. A core tenet of the &ldquo;Fable&rdquo; franchise, players are presented with infinite choices and consequences that impact the world around them. Good or evil, loved or loathed, career versus family, or just you and your faithful canine companion &ndash; live the life you have always dreamed. More so than ever before, your choices lead to fa rmore profound outcomes that impact your every being. Whether it's deciding the outcome of minor squabbles or changing the direction of the entire kingdom, these key decisions will change the world forever.", "price": 3.03, "imUrl": "http://ecx.images-amazon.com/images/I/51mvLrUYWZL._SY300_.jpg", "related": {"also_bought": ["B002Q21X7Y", "B000FRVAD4", "B00DBCAT3W", "B0001UEHP8", "B0050SY8UK", "B0016NRS8M", "B005FDUSTA", "B002I0H79C", "0744012244", "0744010497", "B0047TG2R0", "B005C2D2MO", "B001D7T2VM", "B001HWB68K", "B000FRU0NU", "B004JHJHCC", "B004HYK956", "B0014ET6EM", "B0050SY4DG", "B0056WJA30", "B001NX4DUQ", "B000G7PMXC", "B0045ZIENQ", "B002I0JA7E", "B002BSA20M", "B004JSDQPU", "B0023CBY4E", "B001REZLY8", "B0050SYX8W", "B002DC8GKE", "B002I0H2AG", "B001IK1BJ0", "B004YVOCYG", "B0050SYBL6", "B006GHA8EE", "B003C1I0CO", "B00BRQN2EM", "B0044SA70M", "B002W5GI9I", "B004NRN5DU", "B003Q53VZC", "B004FYEZMQ", "B00309U0M6", "B000OLSJLC", "B000MKA60W", "B003O6E9EK", "B000XJNTPG", "B000ZK9QD2", "B003O6EB70", "B003O6EBRA", "B0025KZV7A", "B00CJ7IUGS", "B000FRS9II", "B0050SWVIQ", "B003O6G5TW", "B0050SYLRK", "B009WI7V9E", "B000TG72PG", "B000P46NMK", "B00149NCYW", "B003O6G47U", "B00D9EPI38", "B000F3AADE", "B005EZ5GNW", "B002GPPPS4", "B000WEQL02", "B007MJSZDQ", "B00269DXCK", "B004UDLRMS", "B000X1PE16", "B0065NP6NC", "B000HCQK0A", "B0028A6V7Q", "B0050SYV70", "B000W0XSZM", "0804161607", "B004XACA60", "B002BRZ8BQ", "B0010AYJXI", "B003FBL85W", "B000UU3SVI", "B00354NAYG", "B002I0K50U", "B003DNH95K", "B004QEV0MI", "B00FATRKOK", "B005VKRGXS", "B0050SYK44", "B003ZSP0WW", "B0022TNO7S", "B000R0SS3Y", "B00BMFIXT2", "B0044TD9HY", "B003S2MXRA", "B0085CA8NY", "B001LGFPSY", "B0034JKYO6", "B005N4HBE6", "B0030GBU32", "B0015HZLVA"], "bought_together": ["B002Q21X7Y", "B00DBCAT3W"], "buy_after_viewing": ["B002Q21X7Y", "B00DBCAT3W", "B000FRVAD4", "B00BMFIXT2"]}, "salesRank": {"Video Games": 750}, "categories": [["Video Games", "Xbox 360", "Games"]]}