{"asin": "B000TG530M", "description": "Call of Duty 4: Modern Warfare,the new action thriller from the award-winning team at Infinity Ward, the creators of the Call of Duty series, delivers the most intense and cinematic action experience ever.Armed with an arsenal of advanced and powerful modern-day firepower, players are transported to treacherous hotspots around the globe to take on a rogue enemy group threatening the world. As both a U.S. Marine and British S.A.S. soldier fighting through an unfolding story full of twists and turns, players use sophisticated technology, superior firepower, and coordinated land and air strikes on a battlefield where speed, accuracy, and communication are essential to victory.The epic title also delivers an added depth of multiplayer action providing online fans an all-new community of persistence, addictive, and customizable gameplay.Features:Authentic advanced weaponry: Featuring an available arsenal of more than 70 new and authentic weapons and gear from assault rifles with laser sites, claymore mines, .50 caliber sniper rifles, and M-249 SAW machine guns. With accessories like night-vision goggles and ghillie suits for maximum concealment,Call of Duty 4: Modern Warfarehas players locked and loaded to accomplish the mission.Coordinated assault and support: Delivering the most visceral action thriller ever, the title covers modern battle from the soldier to the satellite, where the need for air support is critical to success. The adrenaline rush deployment enlists gamers to fast-rope from tactical helicopters, ride in an armada of attack choppers, utilize jets to remove enemy strongholds, and even engage hostiles from thousands of feet above the ground inside a state-of-the-art aerial gunship.Cinematic-quality graphics and sound: Featuring stunning next-generation graphics, players will be drawn into the cinematic intensity ofCall of Duty 4: Modern Warfare.Amazing special effects, including realistic depth of field, rim-lighting, character self-shadowing, texture streaming, as well as physics-enabled effects, will enlist players into the most photo-realistic gaming experience. Combine the lifelike graphics and the realistic battle chatter with the Call of Duty award-winning sound design and players will face battle as they never have before.Unparalleled depth to multiplayer: Multiplayer builds from the success ofCall of Duty 2delivering a persistent online experience for greater community interaction. Featuring create-a-class options allowing players to customize gear that is best suited for play, to experience points enabling unlockables and perks, all the way to matchmaking and leaderboards for the latest in tracking,Call of Duty 4: Modern Warfare'smultiplayer is set to deliver easily accessible and addictive online play for all.", "price": 59.99, "imUrl": "http://ecx.images-amazon.com/images/I/51lSiG%2BtEWL._SY300_.jpg", "related": {"also_bought": ["B00269QLI8", "B001AWIP68", "B00503E8S2", "B000G7YRHO", "B003JVKHEQ", "B0009S4UOA", "B003O6G5TW", "B000FRS9II", "B001QXNBJM", "B002I098JE", "B000TI836G", "B000WSE2WM", "B000ZK9QD2", "B007XVTR3K", "B002I0H79C", "B002BSA20M", "B0050SYX8W", "B000FRU0NU", "B003Q53VZC", "B008B3AVNE", "B0001I9YE4", "B0050SY5BM", "B000FRU1UM", "B004XACA60", "B002I0HBZW", "B001TOQ8PM", "B001SH7YMG", "B00519C7CE", "B000XYUVAC", "B000P46NMK", "B0050SYILE", "B000MKA60W", "B002BSA1MQ", "B0008GJRQ4", "B000SQ5LQ4", "B003VWGBC0", "B001HWB68K", "B0009WPZMC", "B00320JDWG", "B000A0EFJW", "B004PAGJOC", "B0050SYY5E", "B000CBVC0Y", "B002GN8HU4", "B000WEQL02", "B000G7PMXC", "B002SRSQ72", "B002I0H2AG", "B000L3YRF0", "B00D9EPI38", "B003ZSP0WW", "B006VB2UNM", "B00269DXCK", "B00309U0M6", "B000FRVCAA", "B0050SYLRK", "B00EFFW0HC", "B003L8HQ7S", "B003R783IY", "B002I0JAVK", "B000UU3SVI", "B001JICM12", "B0076ZPYPI", "B002I0JK38", "B004YVOCYG", "B007V9NHM6", "B000ZK698C", "B003C1I0CO", "B004XIQMS4", "B005YR1VP2", "B0050SY77E", "B005EZ5GQY", "B00KQYEJE8", "B00COJ0TEM", "B000WPXQSQ", "B003JZT1OY", "B0012N3ZXS", "B003GSZ9ZE", "B0028IBTL6", "B001TORSII", "B00BMFIXT2", "B00149PCAO", "B002I0J998", "B000RI17FM", "B000RHZ9JI", "B000R0PLK2", "B001E93IWI", "B002DC8GMM", "B0037LTTRO", "B0017ZDGWG", "B00H6ENET2", "B0050SYV70", "B0025KZV7A", "B000BPLCDI", "B000B6ML28", "B000WMEEB2", "B005VBVQAG", "B0086V5V9A", "B00A80AAZW"], "bought_together": ["B00269QLI8", "B00503E8S2"], "buy_after_viewing": ["B00503E8S2", "B00269QLI8", "B002I098JE", "B001AWIP68"]}, "salesRank": {"Video Games": 1666}, "categories": [["Video Games", "Xbox 360", "Games"]]}