{"asin": "B001DWI4FM", "description": "Ready for the next dimension in gaming performance, custom tuning, and action? Then grab on to the Microsoft SideWinder X6 Keyboard&ndash;the powerful companion to the Microsoft line of award-winning SideWinder gaming mice. This breakthrough keyboard incorporates a host of powerful features, including a detachable key pad, ingame macro recording, a full media key set, automatic and manual mode/profile switching, two-color dimmable backlighting, and much more. Plus, at the touch of a button, it doubles as your high-performance keyboard for everyday computing.Features:&nbsp;&nbsp;&nbsp;Switchable Key PadFlexible design, choose right side or left side configuration. Switch between standard key pad and macro pad in gaming mode.&nbsp;Mode SwitchingManually toggle the keyboard from standard mode to either of two gaming modes.&nbsp;Macro KeysAssign up to 90 macros.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Cruise ControlUse Cruise Control to continue an action without having to hold down the key or keys assigned to the action. You can use Cruise Control with up to four keys at a time.&nbsp;WASD Gaming KeysHave front-face lighting for enhanced visibility.&nbsp;Two-Color Adjustable BacklightingLighting dial adjusts the brightness of the keyboard and key pad.&nbsp;Additional Features:Automatic Profile Switching:The keyboard detects the application you are running and applies your custom profile to the application.Media Keys:Play/Pause, Previous Track, Next Track, and Mute.Volume Control DialIn-Game Macro Record Button:Record any sequence of keystrokes&ndash;even standard chat messages. Macros are stored on your hard drive and can be easily shared.Quick Launch Key:Instant access to Microsoft Games Explorer (with Windows Vista) or IntelliType Pro keyboard properties (with Windows XP).&nbsp;&nbsp;System Requirements:Windows Vista/Windows XP100 MBPowered USB portCD drive&nbsp;&nbsp;", "title": "Microsoft Sidewinder X6 Gaming Keyboard with USB Port", "price": 63.0, "imUrl": "http://ecx.images-amazon.com/images/I/41NksWjt22L._SY300_.jpg", "related": {"also_viewed": ["B002ZV51DI", "B00BBUCCKO", "B001FA1SIM", "B001DWK4NC", "B00BCEK2LU", "B002RRLQIO", "B009SJR28W", "B00HKEI4HU", "B000GP844S", "B00BHSTXV6", "B004M3ECFU", "B00DQ5RGOY", "B00292OW1U", "B00F5VCV60", "B005NB9RUK", "B009K7QB8O", "B001NXDBI6", "B00FWK8UWI", "B0042AI466", "B00F8W9SWQ", "B008CXTW5G", "B00DS3MPHM", "B000VOE466", "B00F0DCH9Y", "B00AQMUE30", "B0090ECASW", "B00C0R59AW", "B00BCEK2M4", "B00JZC972Q", "B00DKXXAAQ", "B005S0KH7I", "B00A0EPNPI", "B001E5Q874", "B000TTQFIS", "B00IG3GPTS", "B00KCHQDS4", "B00DHUUTEM", "B00LATX6KG", "B00BBT94GA", "B00EKFDUE4", "B0083AWDP4", "B003VAK16O", "B00KQFWTVC", "B0042AG1D4", "B000AY0HTU", "B00HLXBGTS", "B000UHE8YM", "B00BBSLITC", "B001L5U18E", "B00GP3TZ3O", "B009C98NPY", "B0044DJYXS", "B00KQFWS4A", "B004WSKHRW", "B00CERXJNW", "B007Z1CW7Q", "B008U6SRYW", "B008YG0JEO"], "buy_after_viewing": ["B002ZV51DI", "B00BBUCCKO", "B000UEZ36W", "B00AQMUE30"]}, "categories": [["Video Games", "PC", "Accessories", "Gaming Keyboards"]]}