{"asin": "B00149V3CU", "description": "GRID&#x2122; Is all about the race- that period from lights to flag; full of tension, pressure, noise, and action.GRID will take players to beautifully realised and dramatic race locations over three continents to compete in an unprecedented variety of racing events. Packed with the most powerful race cars &#x2013; new and classic, circuit and drift &#x2013; players will compete to conquer the most prestigious official race tracks and championships and then go beyond to compete in challenging city-based competitions, through to road events and urban street races.In Europe, race gamers will compete on the greatest official tracks in prestige Marques including Aston Martin, Koenigsegg and Pagani. Iconic cities across the U.S. &#x2013; including San Francisco, Washington DC and Detroit and each with their own atmosphere and events &#x2013; play hosts to diverse street races. Here, high-performance V8 muscle cars set the pace in aggressive closely fought pack competitions.In the Far East, Japanese racing culture sets the tone where night races, including Drift racing, take drivers through neon illuminated cities and to outlying mountain roads. There is also the opportunity to compete in races that operate on the fringes of legality in the back streets and industrial areas of Yokohama.Key FeaturesIT'S ALL ABOUT THE RACE:Codemasters Studios' history of creating stellar racing titles, combined with AI and the ability of the EGO engine allow them to deliver GRID - a pure and cinematic race experienceA GREATER, MORE DIVERSE, WORLD OF RACING:New and classic, track and street &#x2013; conquer the greatest racetracks and then go beyond with road races and urban street competitionsJUMP BEHIND THE WHEEL OF SOME OF THE MOST EXCITING CARS:Exotics, imports and beefy muscle cars are all available to race in hugely varied events with grids of up to twenty cars aggressively competing for the leadTHREE DISTINCT RACING REGIONS:Europe, US and Japan are all beautifully designed, each with their own individual takes on racing: U.S.A &#x2013; In thunderous V8 muscle cars, race diverse courses on city streets in flat out, door banging racing action; Japan &#x2013; Reject traditional Western racing and drift over to Japan for action the fringes of legality in industrial areas and back streets from dusk 'till dawn; Europe &#x2013; Race the famous tracks dominated by Le Mans in some of the most technologically advanced cars ever created such as the Ferrari F430 GT, Lamborghini Murcielago GTR, Aston Martin DBR9, Koenigsegg CCXR and Porsche 911 GT3-RSREVERYTHING THAT COULD HAPPEN IN A RACE PROBABLY WILL:A GRID race tests a driver's skills at every turn -- crammed with high-impact moments such as, engine fires, tire blow outs, bump and runs, wild crashes involving flipping, spinning, and collisions with other cars and trackside objectsENHANCED EGO ENGINE DRIVES ALL NEW HIGH IMPACT CRASH DAMAGE AND SEQUENCES:Physics models will ensure that collisions and crashes yield the kind of spectacle that a Hollywood movie director would ask for. Slow motion will be used extensively to give replays the blockbuster treatmentONLINE RACING:Race your cars online in high-adrenaline multiplayer, multiple car eventsHighly Detailed VehiclesView ImageRace Online with Your FriendsView Image", "price": 108.23, "imUrl": "http://ecx.images-amazon.com/images/I/51h%2B%2B7wZz6L._SY300_.jpg", "related": {"also_bought": ["B001TORSHO", "B0093FO2TS", "B00JXDJVHS", "B00488PZ2S", "B002ACFYUM", "B000RI17CA", "B007NUQIGK", "B002AQLQM8", "B000QL0T36", "B000HCMR8E", "B00BJ60LEY", "B006JKARN0", "B0056WJA4E", "B000MUW98O", "B008BT80O0", "B000FPOJOS", "B0050SWSQQ", "B003R7H5TC", "B000MIP72G", "B00CRL9TU2", "B000JHMJDA", "B00FQCT1ZW", "B001OAKV1S", "B00170BV6E", "B003UT9XI8", "B0048C7S5G", "B000TP2V2G", "B0016MJ7P0", "B002EJVTC8", "B0033PKTCS", "B004K7AOYG", "B0083RDTA0", "B008YTAJLO", "B007YZ5QOO", "B008277M36", "B001NT9TK4", "B002I0K6DG", "B00FQFFPZO", "B002BSA1C6", "B0015HYPOO", "B00CTKHZH0", "B00E35C4H0", "B001AS4TTE", "B001441550", "B004DI5H26", "B004M8M30G", "B003171CEW"], "bought_together": ["B006JKARN0"], "buy_after_viewing": ["B006JKARN0", "B00JXDJVHS", "B0093FO2TS", "B0050SWSQQ"]}, "salesRank": {"Video Games": 6154}, "categories": [["Video Games", "Kids & Family", "PlayStation 3", "Games"], ["Video Games", "PlayStation 3", "Games"]]}