{"asin": "B002OHDFOA", "related": {"also_bought": ["B000IDCDZY", "B002ZU3MAS", "B008I21EA2", "B00EXK14S0", "B00BXKY9CQ", "B001D49TU4", "B006ZP8UOW", "B00FB1TBKS", "B00CWLRM3I", "B00H7KTRO6", "B0087O6AQE", "B007IL7AKM", "B00ERCAMM8", "B0081URL4Y", "B004HIGV5O", "B00D9S36CE", "B005QBXG18", "B006KH48VY", "B00F3KWZW8", "B00DSJA3G6", "B00ATZU9HA", "B00DCFXUIO", "B006JH8T3S", "B006JG5S6U", "B0090DX8O8", "B00006Y0CG", "B002JEB162", "B0000DFZ2U", "B0030TK3FA", "B004TLIVBG", "B0019804U8", "B00FUTDRWY", "B0000BVYT3", "B00DGEGJ02", "B000YCDU6U", "B00F0DD0I6", "B008D5TYGU", "B004ZJC9HE", "B006LQFHN2", "B005LDLVAO", "B003QXGXOA", "B007005364", "B001K42BJ8", "B001985SWW", "B00336G7FA"], "bought_together": ["B000IDCDZY", "B006ZP8UOW"], "buy_after_viewing": ["B004P8K24W", "B0061MU0A6", "B00452V66G", "B006ZP8UOW"]}, "title": "Linksys Wireless-N Internet Home Monitoring Camera", "price": 69.95, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31UgjdU3t9L._SY300_.jpg", "brand": "Linksys", "categories": [["Electronics", "Camera & Photo", "Video Surveillance", "Surveillance Cameras"]], "description": "See It, LiveThe Wireless-N Internet Home Monitoring Camera is designed to send live video to your home computers, or through the Internet to a web browser or smartphone anywhere in the world! This compact, self-contained unit lets you keep track of your home, your kids, your workplace -- whatever's important to you.A Camera That Stands AloneUnlike standard \"web cams\" that require an attached PC, the Internet Home Monitoring Camera contains its own web server, so it can connect directly to a network, over either Wireless-N or wired Ethernet. High-quality, high-framerate video compression creates a sharp, up to 640x480, video stream. View the real-time feed on your networked computers at home, on the Web, or on your web or RTSP-enabled smartphone when you're on the go.Greater Security at a GlancePerfect for keeping an eye on family, property, or anything important to you. The wireless connectivity and compact design makes for easy placement (mounted on a wall, or use the included desktop stand), so you can enjoy the peace of mind of reliable vigilance.Real-Time SecurityIn Security Mode, the camera sends an email with a short video attached to up to three recipients whenever it detects motion in its field of view. You can then log onto the live video stream if the situation warrants. Use the included Viewer &amp; Recorder utility to record the audio/video stream from multiple cameras to your local hard drive or shared network drive, &ldquo;live,&rdquo; or on a predetermined schedule. The camera can also record directly to a compatible NAS device.Choose Your AudienceYou can keep your video stream secure and private within your home network, or share it by creating password-protected accounts. Or simply stream your broadcast to the web for the world to see."}