{"asin": "B006OI3CTS", "description": "GAME OVERVIEWIn preparation for an impending threat, Sora and Riku enter the Sleeping Worlds to take the Mark of Mastery exam. They will face new enemies and make new friends in worlds they&apos;ve never set foot in. If they can successfully unlock seven Sleeping Keyholes and return to their world, they will retrieve a great power and be deemed true Keyblade Masters.Product DescriptionKINGDOM HEARTS 3D [Dream Drop Distance] is the latest entry in the beloved collaboration between Disney Interactive Studios and Square Enix, which has shipped over 17 million units worldwide. In this much-awaited follow-up to KINGDOM HEARTS II, players take control of both Sora and Riku as they look to become Keyblade Masters. The adventure will take them through Disney worlds never before seen in the series, and new gameplay features will elevate the acclaimed KINGDOM HEARTS experience to new heights.&nbsp;Key FeaturesPlayers will alternate taking control of the two most popular characters of the series, Sora and Riku.Creatures called Dream Eaters inhabit the Sleeping Worlds, and are split into two categories: Spirits and Nightmares.  There are over 50 types of Spirits that can become allies and fight alongside Sora and Riku.Spirits can be bred and nurtured, and will help Sora and Riku learn new commands and abilities.From La Cit&eacute; des Cloches (The Hunchback of Notre Dame) to The Grid (TRON: Legacy), every Disney world that Sora and Riku will visit is new to the series.Players can use their environment to perform Flowmotion: fast and effortless movements that can be tied to powerful finishing moves.Players can activate Reality Shift under certain conditions and execute various attacks by responding to Touch Screen commands. Each world will have a unique Reality Shift.Players can challenge others to Flick Rush matches, or use StreetPass to trade Link Portals, in which special combat challenges can be set or Spirits can be temporarily lent to other players.View largerView largerView largerView larger", "price": 71.68, "imUrl": "http://ecx.images-amazon.com/images/I/61B4qNvwnpL._SX300_.jpg", "related": {"also_bought": ["B001TD6SK8", "B002I08UPC", "0744014026", "B003O6E800", "B00AKIPBNS", "B00GV4V8XC", "B008SBZD5U", "B0053B66KE", "B002I092MM", "B0053B5RGI", "B002I08WVY", "B009LGO88E", "B002I0GZ5Y", "B00GANWVJE", "B009B1D7JK", "B0053BCML6", "B00E1A1SP6", "B008GEH9HO", "B0053BCO00", "B007R6U53C", "B00FXOP1JI", "B00I5LMSE2", "B0053BCP40", "B002I094AC", "B00136MBHA", "B007R4X3AG", "B0050SVMYA", "B0053BCMAC", "B00FS2XRIC", "B002I0EMBI", "B0088MVPFQ", "B004K6LQAS", "B00BQI3UQG", "B0045WL026", "B001E27DLM", "B00FXOP1MU", "B008GEH8LQ", "B00GX330XW", "B008HPAXZ2", "B003QWYX8E", "B0089X37NW", "B00B67ZS3U", "B00DWXUYN0", "B00CH923NE", "B00BLGWIRK", "B00K2O4O6U", "B001G3B0HC", "B005XD9VB8", "B009LEIUY4", "B00AYABWYE", "B00CFR7UC2", "B008A27UMG", "B002I09286", "B0009A4EVM", "B008OGWH3A", "B008CP6KG8", "B000GIXIPK", "B00BAWXD88", "B0090UYLUQ", "B00JGKYY4I", "B00DD0B1R0", "B00829H3E2", "B002ZQDAVI", "B002I0IVC4", "B000B69E96", "B00068O278", "B000Q6J51S", "B004K1EA5G", "B002I090AG", "B007BGUGVO", "B0009Z3K9E", "B00IVJ1M7M", "B00EZPCWWA", "B00GV4V8UK", "0804162654", "B006Y76HY6", "B0050SVNP8", "B00KI2OZ9M", "B0050SVPCO", "B0024ZT3XO", "B0056BDZXM", "B00KVRK39A", "B003FBL86Q", "B00B3TXJ14", "B00K848IH0", "B008OQTV7K", "B004CVWETI", "B008YTAJK0", "B00B67ZTUW"], "bought_together": ["B001TD6SK8", "B002I08UPC"], "buy_after_viewing": ["B00AKIPBNS", "B00GANWVJE", "B003O6E800", "B0053B5RGI"]}, "salesRank": {"Video Games": 255}, "categories": [["Video Games", "Kids & Family", "Nintendo 3DS", "Games"], ["Video Games", "Nintendo 3DS", "Games"]]}