{"asin": "B000TKHBDK", "description": "From the ManufacturerThe ultra-portable Logitech&reg; VX Nano Cordless Laser Mouse for Notebooks is always ready for use, thanks to the plug-and-forget nano-receiver, the world's smallest USB receiver*. Plug it into your notebook's USB port just once and forget about it.The Plug-and-Forget Nano-Receiver- plug it once and for all!&nbsp;Go very small:Logitech introduces the nano-receiver, the world's smallest USB receiver*.*When compared with other 27 MHz USB receivers for notebook mice commercially available as of March 1, 2007&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Plug it in once and forget it:Barely larger than the USB port to which it connects, the nano-receiver is so tiny that you can plug it into your notebook just one time and forget about it.Out of sight - and out of mind:Once plugged in, the nano-receiver can stay in your notebook. Wherever you are, open your notebook and start using your mouse immediately, without rummaging around for the receiver or constantly replacing it when moving from place to place. Your notebook slides safely into its bag with the receiver still attached. You don&rsquo;t have to worry about losing it or breaking it&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Hyper-fast Scrolling: Fly through long documents with the MicroGear&trade; Precision scroll wheel.A new concept in PC navigation, this revolutionary alloy scroll wheel operates in two distinct modes: Free-spin Mode for hyper-fast, nearly frictionless scrolling, or Click-to-click Mode for detailed navigation using an ultra-precise ratchet-scrolling mechanism. Fly through hundreds of pages &mdash; or move line-by-line &mdash; with more precision than ever before.&nbsp;Features&nbsp;&nbsp;&nbsp;Plug-and-Forget Nano-ReceiverPlug it into your notebook&rsquo;s USB port just once and forget about it. So small, it can remain plugged into your laptop at all times. With the 2.4 GHz digital nano-receiver, your mouse is always ready to use.&nbsp;Ultra-Portable DesignSlips easily into your notebook bag. A contoured shape and soft rubber grip add superior comfort.&nbsp;Hyper-Fast Scrolling&nbsp;Fly through long documents at hyper-speed with the nearly frictionless alloy scroll wheel, as first introduced with Logitech MX Revolution. Or shift instantly to precise, click-to-click scrolling.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Laser PrecisionExperience smoother cursor control on virtually any surface &nbsp;with laser technology. Outperforms optical mice&nbsp;Forward and Back ButtonsEffortlessly navigate the internet with forward and back buttons.&nbsp;Carrying CaseProtect your VX Nano with a convenient travel case and take it with you anywhere.&nbsp;System RequirementsPCWindows&reg; XP or Windows Vista&trade;Available USB portCD-ROM driveMacMac&reg; OSX 10.2.8 or laterAvailable USB portInternet connection (required for download of Logitech&reg; Control Center software)Package ContentsLogitech&reg; VX Nano &trade;&nbsp; Cordless Laser Mouse for Notebooks&nbsp;2.4 GHz&nbsp;nano-receiver&nbsp;Logitech&reg; SetPoint&trade; software CDUser's&nbsp;guide2 AAA BatteriesProtective PouchDesktop USB extension stand3-year limited warranty&nbsp;", "title": "Logitech VX Nano Cordless Laser Mouse for Notebooks (Black)", "price": 57.99, "imUrl": "http://ecx.images-amazon.com/images/I/31r0kQsoNPL._SX300_.jpg", "related": {"also_viewed": ["B0082D5660", "B007PJ4Q4A", "B002HWRJBC", "B00165XQWW", "B000HCRVUS", "B001660084", "B000GABCY2", "B00IHTZPA6", "B003TG75EG", "B003NR57BY", "B005KSAHZU", "B0034XRDUA", "B00325ME7W", "B001DJ7Y2O", "B002HWRJBM", "B007T1CTDE", "B001DJ64C0", "B000HCT12O", "B0002UM0JW", "B005KSAJXK", "B005NB9QE2", "B001F7ARTQ", "B00EEJWOFM", "B005KSAOKI", "B00807T4OI", "B002OGODA6", "B008PWHV02", "B008RN04BM", "B005KSAO6C", "B000RHZJN4", "B005DSPLCQ", "B003HC2FHE", "B006MBP7T0", "B006JRIDHK", "B000UY3NR8", "B004HIN8N2", "B002OGMNT4", "B002Y6CJJ8", "B009APC0R2", "B0093H4VSS", "B008JHOT12", "B004S3MO40", "B0046TAIUI", "B000QJ3DZE", "B002DPUUL4", "B00GKW62HW", "B000ZH7E5M", "B00DR8LB4Q", "B0035ERKYW", "B00DR8LA6U", "B000A6NUVA", "B004HIN7SI", "B005KSAG3S", "B003I4FHNA", "B0028K2TUO", "B00BZC31WQ", "B005DSPLDA"], "buy_after_viewing": ["B0082D5660", "B007PJ4Q4A", "B003NR57BY", "B002HWRJBC"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Mice"]]}