{"asin": "B000BK393Y", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]], "description": "Designed to be used by all photographers of any skill level, the E500's compact and durable body is packed with Olympus innovations like the exclusive Dust Reduction System for spot-free photos, 8 million pixels of detail for bright and colorful images, a TruePic Turbo Image Processor for fast response time, and an oversized, easy-to-view 2.5-inch HyperCrystal LCD.Exclusive Dust Free Technology for Spot-Free PhotosDust is all around us, and when swapping out a lens on a digital single-lens reflex camera there's a chance that a camera's electro-statically charged image sensor will attract micro dust that can ruin photos. Olympus's Dust Reduction System produces spot-free photos with the exclusive Supersonic Wave Filter, a patented ultrasonic technology that shakes at 35,000 vibrations a second to remove dust from in front of the camera sensor every time you turn the camera on. These spot-free photos liberate users from hours spent retouching photographs at the computer. The new Evolt E500, like all Olympus digital SLR cameras, is equipped with this exclusive user-friendly technology, and only Olympus has a solution to provide spot-free photography in a digital SLR.Detailed, Bright, and Colorful Photos with 8-Megapixel Image SensorThe E500 is loaded with an impressive 8 million pixels of detail, for bright colorful photos. The image sensor in the Evolt E500 is a high-performance Full Frame Transfer Kodak KAF-8300CE CCD that delivers improved dynamic range, low noise to capture fine image details in the highlight and shadow areas, as well as excellent color fidelity for brilliant colors.TruePic Turbo for Clarity and SpeedOlympus's TruePic Turbo Image Processor provides fast camera response, operation, and processing speed for more responsive camera operation. For faster burst rates, the TruePic Turbo processor addresses the dedicated 64 MB image buffer for up to four TIFF or RAW images at 2.5 frames per second, and unlimited burst mode with HQ JPEG images and extreme speed Compact Flash cards.Large, Easy-to-View 2.5-Inch HyperCyrstal LCD MonitorBig and bright with 215,250 pixels, the E500 has a 2.5-inch HyperCrystal LCD that offers many times the contrast of conventional LCD monitors, so captured images can be beautifully displayed in vivid color on the screen with exceptional clarity. Because photos are for sharing, the E500 LCD features a wide, 160-degree viewing angle on the vertical and horizontal axis, ensuring excellent visibility and beautiful image quality even when everyone huddles around the camera to see what you've created.The World's Largest Selection of Digital Specific LensesThe versatility of the Olympus E-System comes from delivering the largest selection of \"Designed-for-Digital\" lenses--more than any other manufacturer to date. Olympus's Zuiko Digital Specific Lenses come in a wide range of focal lengths for achieving the best image result, and impress with their spectacular clarity and edge-to-edge sharpness.Most other digital SLR cameras still use many traditional 35mm film lenses on digital bodies. But since those lenses are based on designs for film and not for pixels, they deliver insufficient light at the edges of a digital camera's image sensor. This can result in reduced sharpness and color definition, particularly when shooting with large apertures and wide-angle lenses. The E500 does not have this problem, because it accommodates the full line of interchangeable Zuiko Digital Lenses. These digital specific lenses are designed for digital capture with smart technology that allows the lenses to communicate with the camera to ensure the best possible image quality.Olympus dedicated digital optics coupled with the Evolt E500 render sharpness and contrast more consistently at any given f-stop. The lenses are matched to the Four Thirds System standard image sensor for the optimal balance between image quality, camera, and lens size, and expandability. With a wide array of digital specific lenses to choose from, it's easy to select the ideal lens to bring along when you don't want to lug a lot of heavy, bulky gear.Easy-to-Use, Easy-to-Handle Light and Ergonomic DesignCreating an affordable digital SLR that most anyone can pick up and start to use is about making it easier to operate. That means menus that make sense and buttons on the body that are easy to understand and operate; adding automatic settings for every imaginable situation; making the LCD big and bright enough so you can review a shot without squinting; and making it less of a chore to get images out of the camera and into your computer or printer. Moreover, at just 5.09 x 3.72 x 2.59 inches (W x H x D) and only 15.3 ounces, the Evolt E500 is light and compact enough to comfortably shoot with all day.You don't need a degree in photography to shoot like a pro with the E500. Just take it home, charge the Li-ion battery with the included charger, and begin taking photos. Instead of working to find the right settings for the subject, select from one of the camera's 25 Exposure Modes (Easy, Basic, and Creative) that make it easy to get the results you want, whenever and wherever you want them.To access the Easy Modes, simply turn the mode dial on the top of the camera to \"Scene\" and choose from a range of 15 pre-programmed Scene Select modes to achieve the optimal results for: Night Scenes, Fireworks, Sunsets, Beach and Snow, Children, Landscape, and more.Every Scene Select mode on the Evolt E500 provides a sample image and a description of what is happening to achieve the desired result. For example, choosing the Landscape setting reveals a sample of a landscape photo, and a text description of what the mode is displayed on the large, easy-to-read 2.5-inch LCD.The Flexibility of the Most Feature Rich Camera in its ClassOnce one feature is mastered, there are a seemingly endless number of other features just waiting to be explored. Because the E500 is designed for the ultimate user-friendly experience, you can choose to let the camera make all the decisions, or take control for a new level of customization and performance.5 Metering Modes:A new 49-Point Digital ESP Light Meter enables digital electro selective pattern metering for accurate exposures under the largest number of conditions. The Digital ESP can also be linked to the AF (auto focus) selection or independent of the AF selection for even more versatility. Olympus's widely acclaimed proprietary Digital ESP metering calculates the best light values under complex lighting conditions. Center-weighted metering is biased to the center of the viewfinder (cross) area. Spot Meter (2%) enables the most accurate metering for tough lighting conditions like backlit or spot lit. Highlight Spot Meter (2%) adjusts for predominantly white subject for correct exposure with detail. Shadow Spot Meter (2%) adjusts for a black subject, providing the correct exposure with detail.3 Color Modes: Vivid/Natural/Muted:Vivid mode produces photos with more highly saturated colors and higher contrast to optimize images when vivid shots are required. The Natural mode produces realistic color similar to those seen by the human eye and is the perfect choice for the discerning photographer looking for the most realistic photos. The Muted mode is ideal for those users who plan to heavily manipulate or edit their images with the included Olympus Master Software or with Adobe Photoshop.A Choice of Two Color Space Settings:Users can choose from two color space settings according to their needs: sRGB, which is the standard for computer monitor viewing and inkjet printer output, and Adobe RGB, which is widely used for commercial applications.9 Black and White Modes:Red, Yellow, Orange, and Green filters can be selected to replicate the same traditional film filters, enhancing the drama of the image in the Black and White shooting mode. In addition to Sepia tone, the Evolt E500 also offers users three tone effects: Blue, Green, and Purple for special results.Dual Card Slots:Users also benefit from two memory card slots--one for CompactFlash or Microdrive and another for xD-Picture Cards. Simply depress a button on the back of the camera to choose which card type to capture and copy images back and forth from one card to the other in playback.Support for High-Speed and High-Capacity Memory Media:The Evolt E500 supports 32-bit file formatting allowing the use of 2 gigabyte and larger CompactFlash, Microdrive, and xD media cards. The Evolt E500 also supports high-speed CF cards for faster operation in the burst mode.Simultaneous RAW and JPEG Image Recording:A choice of three image formats is offered: RAW, TIFF, and JPEG. If desired, image data can be simultaneously recorded in RAW and JPEG with the RAW+JPEG format.Contrast, Sharpness, and Tone Curve Controls:Contrast can be set to any of five levels, and sharpness can be set to any of seven levels. So whether you want pro-quality tonal fidelity or sharp vibrant colors, you can customize each image to suit their preference.White Balance:White balance settings from 3,000K to 7,000K can be set in 12 steps using button and dial controls, with +/- 7-step fine-tuning available for all settings. A one-touch white balance function allows users to store and retrieve up to four frequently used white balance settings at the touch of a button. By initially reading the light separately for the CCD, the camera can see a dramatic increase in speed without loss of accuracy.What's in the box:Evolt E500 digital camera body, USB cable, video cable, Li-Ion battery pack (BLM-1), Li-Ion battery charger (BCM-2), shoulder strap, Olympus Master Software CD-ROM, manuals, warranty card.", "title": "Olympus Evolt E500 8MP Digital SLR (Body Only)", "price": 9.99, "salesRank": {"Camera &amp; Photo": 2134}, "imUrl": "http://ecx.images-amazon.com/images/I/412FEYZZ8ZL._SX300_.jpg", "related": {"also_bought": ["B000E7VLN4", "B005IBP2WW", "B000Q639S8", "B00025HBPU", "B0006NAB9G"], "buy_after_viewing": ["B003VNKNEQ", "B0015ASYJ8", "B004VS64Y8", "B0044C1H5C"]}}