{"asin": "B0015DYMVO", "related": {"also_bought": ["B004SY5O5K", "B00E0FZSQC", "B000W9DJ1Q", "B005X9XW8K", "B000EU4HBO", "B00C0QEUCG", "B004MMEHKG", "B0002H4YUI", "B001UE7SC8", "B000J2EN4S", "B00IY9K72K", "B004SY9OVA", "B00166TT3G", "B001K40I7K", "B00E0P2GLM", "B00E7P7UHK", "B004SCSV2U", "B000JE7GPY", "B000IF51UQ", "B007YLEQ58", "B00002N7I2", "B00479FQCM", "B00E5ZJ68I", "B0080R95XI", "B001CZT4I6", "B00A8SXGKA", "B004C11192", "B004ZP74UA", "B00343NWCS", "B000Y0CL8K", "B009416CVC", "B000B75RDW", "B0054IH614", "B002EQ9O8C", "B00B3OA7R8", "B0084OPT8C", "B0019Z82WS", "B008PQAFTM", "B003GSKT2C", "B000GDAX6W", "B003GSKWOM", "B004C1021U", "B00HQ1GYS8", "B000OMWHBE", "B00006BBAC", "B0010XSKRG", "B00EK8BB6U", "B001TUZSBQ", "B00KEEGIQC", "B00DCKROK4", "B008RG9MKS", "B005MR57R2", "B004C0XZM4", "B009USAJCC", "B007YL6HY6", "B00013BL18", "B000JE9LD4", "B00KCV24LK", "B003MU9JZM", "B00006HU78", "B000BQT7B6", "B007IIT8KU", "B00KGBZ7UG", "B0097BEFYA", "B002HU27UW", "B00HVKR92Y", "B00FA4Y82W", "B0000CNR1L", "B00EI8SS4U", "B00C9CCLPE", "B007YLG14C", "B00IBDOB5I", "B007YKUWN4", "B004NS4A38", "B004ZP74UK", "B00F9S71YQ", "0935039279", "B000083KIH", "B000F9LRXA", "B0000AI0N1", "B000HPX46U", "B00920ZDWY", "B000OPPAQK", "B001DTHPEQ", "B0030CDEEY", "B000WO84Z2", "B000B6JC9S", "B000067RC4", "B003P0WLXG", "B000UHMITE", "B00IWA1MNE", "B002VPE1QG", "B001TUZSP2", "B00004W3ZP"], "bought_together": ["B004SY5O5K", "B000W9DJ1Q"], "buy_after_viewing": ["B0016IXEWG", "B004SY5O5K", "B00IY9K72K", "B00E0FZSQC"]}, "title": "Belkin 3-Outlet Mini Travel Swivel Charger Surge Protector with Dual USB Ports, 5 Charging Outlets Total (1 AMP / 5 Watt)", "price": 12.45, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31Gz4KpCCZL._SX300_.jpg", "brand": "BELKIN", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Surge Protectors"]], "description": "Whether you're crossing continents or just heading across town, the Belkin BZ103050-TVL Mini Surge Protector/Dual USB Charger is the type of travel companion that makes your life easier. Featuring three protected AC outlets, two protected, powered USB outlets, and a unique rotating plug design that lets you work in tight spaces, this compact surge protector lets you plug in and charge all your essential devices wherever you are.Mini Surge Protector/Dual USB ChargerAt a Glance:3 AC outlets and 2 powered USB portsComplete protection on all outlets360-degree rotating plug with 4 locking positionsIncludes mini-USB cable for charging phones, MP3 players, and other devicesLifetime Product and $75,000 Connected Equipment WarrantiesYou can easily slip this mini surge protector into your laptop bag or carry-on.Includes mini-USB cable for charging phones, MP3 players, and other devices.Convenient, Dependable Design for Worry-Free TravelHotel rooms, airport terminals, and coffee shops never seem to have enough power outlets to handle all your devices at once. With the Belkin Mini Surge Protector you no longer have to choose what to charge first.This surge protector acts as a power strip, letting you plug three AC devices into a single wall outlet. It is rated to handle 918 Joules and provides protection against power surges and spikes, since the smart traveler is looking for protection of essential gear and irreplaceable data, not just extra outlets.Two Powered USB Outlets Let You Charge More Devices EasilyIn addition to its three AC outlets, this surge protector features two protected, powered USB outlets, so you can easily charge your iPod along with other USB devices. These USB outlets do not transmit data and the surge protector cannot be used as a hub, but they do make it exceptionally easy to keep devices that are charged via USB interfaces up and running without blocking your computer's USB ports or the AC outlets that you need for bigger devices.Plus you may be able to leave long, tangle-friendly cords and clunky item-specific chargers at home, since this mini surge protector comes with a mini-USB cable. This is especially convenient now that many phones, including Blackberries and Motorola RAZR phones, feature USB power connections.Unique, Efficient Design with Rotating Plug for Added VersatilityIts compact, lightweight, and efficient design means that you can easily slip this mini surge protector into your laptop bag or carry-on, and because Belkin knows that working on the road often means trying to plug in despite awkward outlet or furniture positioning, a 360-degree rotating plug with four locking positions makes it easy to use this device in tight spaces.About Belkin International, Inc.Belkin offers a diverse product mix that provides people with seamless electronics integration in their homes, cars, and on the go. Founded in California in 1983, Belkin is a privately held company and the recognized leader in connectivity solutions, in addition to accessories for MP3 devices, computers, and more. We provide extensive solutions for networking, home theater-with our PureAV line of cables, power, and digital wireless accessories-and many more categories. Belkin's phenomenal growth has led to our expanding global presence. In addition to corporate headquarters in Los Angeles, we now have offices throughout Europe-in the United Kingdom, the Netherlands, and Germany, among others-and in the Asia Pacific region, including Australia, Shanghai, and our regional headquarters in Hong Kong.The Belkin Mini Surge Protector/Dual USB Charger is backed by a lifetime warranty and a $75,000 Connected Equipment Warranty.What's in the BoxMini Surge Protector/Dual USB Charger, mini-USB power cable, and user guide.Wall-MountedConnected Equipment WarrantyNumber of OutletsUSB PortsJoule RatingNetwork ProtectionPhone Line ProtectionCoax ProtectionPower Safety Shut DownOverload ProtectionCord LengthWarrantyMini$75,00032918NoNoNoYesYesWall-mountLifetime1-Outlet Wall-Mount$50,0001&nbsp;1045NoYesNoYesYesWall-mountLifetime6-Outlet Wall-Mount$50,0006&nbsp;1045NoYesNoYesYesWall-mountLifetime"}