{"asin": "B000VE4MM2", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Input Devices", "Trackballs"]], "description": "From the ManufacturerFinally, a Bluetooth enabled wireless trackball mouse that you can take anywhereNot enough room to use your mouse? The Kensington SlimBlade Trackball Mouse is a wireless mouse that can switch to trackball mode with a click of a button. Plus, Bluetooth connectivity offers up to 30 feet of range. No receiver needed, so you can free up those USB ports for other devices.Smart Features360 degree scrolling and Bluetooth connectivity:The SlimBlade Trackball mouse is a wireless mouse that delivers exceptional laser tracking on almost any surface. Kensington has incorporated innovative features in a wireless mouse to give you the best performance in every way.Free up that USB port for other devices because built in wireless Bluetooth connectivity means you can connect without a USB receiverOptical sensors, found in most traditional notebook mice, are not precise enough to work on certain surfaces. But a laser sensor senses movement at 1000 dots per inch--counting every move you make and providing precise, responsive cursor action on almost any surface.360 degree scrolling extends your scrolling power beyond standard 4 way scrolling. Scroll up/down/left/right and in a circular motion for efficient page viewing. Surfing the Web will never be the same!Trackball Mode:A trackball is essentially a mouse that is lying on its back. To move the cursor on your computer screen, you rotate the ball with your thumb, your fingers, or the palm of your hand. Because a trackball doesn&#146;t require physical movement, take advantage of trackball mode when you don&#146;t have enough surface space to move the actual wireless mouse. Plus, trackball mode provides added comfort since it requires less movement from your hands. The Kensington SlimBlade Trackball Mouse functions as a standard wireless mouse and a trackball mouse. Simply click the button at the top to switch to your desired mode.Battery Indicator:A fuel gauge indicator lets you know when it&#146;s time to change your batteries. The battery life will be good for up to 6 months. Never worry about turning your mouse on or off again--your wireless trackball mouse goes into sleep mode when your notebook does.Compatibility:Universal compatibility allows you to use this mouse with a Mac or a PC. This Kensington wireless mouse is also Vista certified.Thin profile:Thinner than average mobile mice, the SlimBlade Trackball Mouse is a wireless trackball and basic wireless mouse--all in one. Store this wireless mouse anywhere; thin enough to slip into a pocket or a small laptop bag.Selected for the 2008 CES Innovation Awards in the Computer Accessories category.What&#146;s int the box:SlimBlade Trackball Mouse, 2 AA batteries, instruction guideSpecsLaser mouse with 360 Scroll BallInstant Bluetooth connectivitySleep mode extends battery lifeFuel gaugeUp to 6 month battery lifeTrackball mode", "title": "Kensington SlimBlade Trackball Mouse with Bluetooth Wireless (Graphite) K72281US", "price": 34.44, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41C5st6zBFL._SY300_.jpg", "related": {"also_viewed": ["B0043T7FXE", "B0050SPZMK", "B001MTE32Y", "B00DWS0GJW", "B00006B9CR", "B000HEW0KW", "B00009KH63", "B000LB7G00", "B00FG7MZP0", "B00DWS1L64", "B00005NIMJ", "B002APDFA0", "B002OOWB3O", "B005T4HT24", "B00BZC31WQ", "B009KY58FE", "B00HR34WMK", "B008OEHPPM", "B004S214IS", "B00ESJS72C", "B0058SRNZ4", "B008OEHV6U", "B0057KL3QI", "B004N7146U", "B0093H4VSS", "B001MTE32O", "B009ZM75GG", "B004NQM68Q", "B001F42MKG", "B00556O4YC", "B0093H4WT6", "B008AGF6WS", "B008TYJC9E", "B000BDH2Y8", "B009VDSRJ8", "B00B272TO0", "B00EAK9Q3I", "B00005853Z", "B00DN27IUC", "B00DJ7FH7W", "B00DR8LA6U", "B00ESJPSWY", "B009CP4PIW", "B009JP461G", "B000UY3NR8", "B0038KLG5C", "B000G1D8HU", "B003N3JFWU", "B004OBYWD2", "B00CCE3BIA", "B0014DRXRA", "B006428K7I", "B00HFN6SBU", "B003AVN6C0", "B005HU0LX4", "B00FJRY168"], "buy_after_viewing": ["B0043T7FXE", "B0050SPZMK", "B00BZC31WQ", "B009KY58FE"]}}