{"asin": "B00740MR78", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Compact System Cameras"]], "description": "Pentax K-0Pentax K-01 Digital CameraPentax mirrorless body design is compatible with 25+ million Pentax K-mount lenses spanning decades.Large 16 megapixel APS-C sized CMOS image sensor with low noise image capture and multiple aspect ratios.Bright, high resolution 3 inch LCD with 920,000 dots.Full HD 1080p video capture at 30 FPS with h.264 compression (60 FPS at 720p) features outstanding video capture flexibility.Fast 6 FPS burst mode is ideal for fast-action photography.Shutter speeds from 1/4000 to 30 seconds and bulb with a silent shutter action.Flexible ISO range of 100-25600 ensures gorgeous noise-free imaging in any lighting condition.Focus peaking mode provides fast and accurate manual focusing for critical focus applications.In-camera HDR mode combines bracketed user-specified exposures into a single, perfectly blended still image.The new Pentax K-01 is another bold effort from the manufacturer that is known for pushing camera size, color, durability, and now, design, to the limit. The contemporary, timeless K-01 houses a full array of advanced functions and user-friendly features in a camera body with remarkable form and function.Marc Newson commissioned designPentax commissioned designer Marc Newson to develop the contemporary, timeless design of the Pentax K-01's body. Newson's retro-meets-contemporary design is evident in all elements of theK-01 including the product logo, camera strap (included) and start-up screen that appears when the K-01 is powered on. Buttons, shutter release and control levers are purposefully placed and accented with colors for instant recognition including a vibrant red button for Video Recording and a brilliant green for the Pentax Green button. The mode dial and power switch are made of high-quality aluminum alloy, while the memory card slot and grip connectors are covered with protective rubber. The design optimizes both form and function on a camera that is as suitable on a photo shoot as it is in a museum display that honors design as art.Exceptional image qualityThe Pentax K-01 is equipped with a newly developed CMOS image sensor measuring 23.7 millimeters by 15.7 millimeters. With approximately 16.28 effective megapixels, this sensor assures high-speed readout of image data signals. The K-01 also features a new &iexcl;&sect;PRIME M&iexcl;&uml; imaging engine to assure first-rate movie recording performance in a digital interchangeable lens camera. The K-01 offers an extra-wide sensitivity range &iexcl;X from ISO 100 to ISO 12800, or to ISO 25600 when expanded using a custom function &iexcl;X while minimizing digital noise at all sensitivity levels.Compatibility with every Pentax K-mount lense ever madeThe Pentax K-01 accepts a wide array of Pentax interchangeable K-mount lenses*so users may choose the most suitable lens for a particular subject or scene.*K-, KA- KAF, KAF2, and KAF3- mount lenses can be used with the Pentax K-01, while screw-mount lenses, 645-system lenses and 67-system lenses can be used with an adapter. Some functions may not be available on certain lenses.High-quality video recordingThe Pentax K-01 features Full HD video-recording function to capture high-quality movie clips in 1080p resolution (1920 x 1080 pixels). H.264 compression format offers a choice of frame rate (30, 25 or 24 frames per second) to accommodate user-specific applications. Two new features facilitate video recording:a video recording button for instant pushbutton startand a stereo microphone with audio gain control and wind noise suppression for more realistic soundVideo record options are flexible, offering the photographer to select aperture or shutter exposure control, and Pentax Shake Reduction helps stabilize captured video. Users may add personal touches to recorded clips using various Custom Image modes or record subjects in a series of video clips with the Interval Movie Shooting mode. The Pentax K-01 also comes with an HDMI terminal (which allows the user to simultaneously output both Full HD movie clips and stereo sound) as well as an external microphone input terminal.New-generation High Dynamic Range (HDR) modeThe High Dynamic Range mode (which produces one extra-wide-gamut blended photo from three images taken at different exposure levels) is accessible with a turn of the mode dial and allows users to select one of three exposure increments as well as the level of effect, while an automatic position adjustment function assures precise alignment of three images even when they are taken with a handheld K-01.Custom Image Modes and Digital Filters for personalized expressionThe Pentax K-01's Custom Image modes allow users to select the most appropriate finishing touch for a particular subject or scene to express the photographer's creative intention or taste. Two of the 11 Custom Images functions are Bleach Bypass to create a dramatic visual effect used in motion pictures and Cross Process to produce a fanciful image with unusual colors. The K-01 also features 19 distinctive digital filters including Miniature to convert an actual scene into an image full of miniature models for an unusual visual effect. Users may be more creative by applying multiple digital filters to a single image.Smooth, quiet, high-speed burst shootingThe Pentax K-01's high-speed burst shooting mode comes in handy when preserving the action of fast-moving subjects in a series of images, since it captures up to five images per second. With its mirrorless construction, the K-01 offers exceptionally silent mechanical operation that allows users to concentrate on photography even when shooting such subjects as stage performances.Large, wide-angle 3.0 inch LCD monitor with approx. 921,000 dotsThe Pentax K-01 features a large, easy-to-view, high-resolution 3.0 inch color LCD monitor with approximately 921,000 dots. The wide-view design assures a clear view of the monitor from approximately 170 degrees horizontally and vertically, which is useful in low- and high-angle shooting.Pentax-original Shake Reduction (SR) mechanism for sharp, blur-free imagesThe Pentax K-01 incorporates the Pentax-developed SR mechanism, which effectively reduces annoying camera shake by approximately four shutter steps. Usable with all compatible lenses, including those produced for film-format SLR cameras, this mechanism produces sharp, blur-free images even under demanding conditions that are prone to camera shake, such as when using a telephoto lens, shooting in the dark without flash illumination, or capturing landscapes in the twilight. Equipped with the Pentax O-GPS1 device (an optional GPS unit launched in June 2011), the K-01's SR system helps astrophotographers track and shoot celestial bodies.Effortless, user-friendly Auto Picture and Scene modesThe Pentax K-01 features the Pentax-original, user-friendly Auto Picture mode, which selects the most appropriate shooting mode for a given subject or scene from Portrait, Landscape, Macro and other distinctive shooting modes, while optimizing all camera settings, such as aperture, shutter speed, white balance, saturation, contrast and sharpness. This allows a new photographer to concentrate on image composition and shutter opportunity. The K-01 also offers 19 different Scene modes to help simplify the photography of challenging subjects or scenes such as Night Scene Portrait mode, Pet mode, and Backlight Silhouette mode. Users simply choose a corresponding icon on the camera's LCD monitor.Additional featuresTTL image-sensor metering, with a choice of multi-segment, center-weighted and spot modesContrast-detection autofocus system with 81 selectable focus pointsDR (Dust Removal) mechanism to shake off dust adhering to the surface of the CMOS image sensorCTE white-balance control mode to emphasize the predominant color of a particular scene, such as the sunsetA choice of four image size ratios (4:3, 3:2, 16:9 and 1:1) to accommodate different subjects and applicationsMulti-exposure mode (up to nine exposures on a single image), with an auto exposure compensation functionInterval shooting mode, useful in time lapse recording of landscapes and flowers/plants from an exact same location and angleCompatibility with the new-standard SDXC and UHS Speed Class 1 memory cardsSILKYPIX Developer Studio 3.0 for Pentax RAW image data development (developed by Ichikawa Soft Laboratory) included; in-camera RAW image development also availablePentax 40mm F/2.8 Interchangeable LensUltra low profile is only 0.36 inches thin at 1.8 oz.Fixed focal length 40mm prime lens is equivalent to 61mm in the 35mm format.Short 16 inch minimum focus distance.Maximum F2.8 aperture is ideal for existing light photography and creative depth of field applications.Nine rounded aperture blades produce extraordinarily smooth, natural bokeh.Pentax SP (Super Protect) coating on lens surface helps repel elements and aids in cleaning.Pentax KAFmount is compatible with current and past K-mount compatible cameras.The new smc Pentax-DA 40mm F2.8 XS interchangeable lens is the world's thinnest interchangeable lens.*The new 40mm combines with the Pentax K-01 camera body to deliver a unique compact system camera that is perfect for photographers who are as keen on design as they are on performance. Together, the K-01 and this 40mm lens system mark the intersection where high technology and high design meet.* The world's thinnest interchangeable lens for lens-interchangeable digital SLR cameras, as of February 1, 2012 (based on Pentax's research).Marc Newson commissioned designThe exterior of this ultra-slim new lens was designed by Marc Newson to complement the clean, contemporary design of the K-01 body.Easy-to-use, super-thin lensThis unifocal standard lens offers a focal length equivalent to 61mm in the 35mm format and measures a mere 9.2 millimeters thin (only 0.36 inches) making it the world&rsquo;s thinnest interchangeable lens. The ultra-thin design is highly portable and easy to store and carry. Designed with the acclaimed smc Pentax-DA 40mm F2.8 Limited lens in mind, the maximum aperture of the new lens is F2.8 to produce sharp, bright images in a wide range of applications, including snapshots, scenic photos, portraits, and even incident-light indoor shooting.Exceptional image-descriptionPentax conducted numerous image-quality tests of hundreds of images taken with this lens. Upon assessment, the lens offers outstanding optical clarity and subject reproduction characteristics. Rounded diaphragm blades produce a smooth, natural bokeh (out-of-focus) background effect.SP coating to block dirt and dustThe front surface of this lens is treated with SP (Super Protect) coating, an exclusive fluorine compound applied to the surface through a vapor deposition process. This SP coating not only repels dust, water and grease, but also makes it easy to wipe off stubborn stains such as fingerprints and cosmetics.SpecificationsLENS MOUNT:Pentax KAFFOCAL LENGTH:40mm (equiv 61mm)APERTURE:F2.8MIN APERTURE:F22LENS CONSTRUCTION:5 elements in 4 groupsANGLE OF VIEW:39&deg;MIN FOCUSING DISTANCE:1.31' (0.4m)MAX MAGNIFICATION:0.13XFILTER DIAMETER:27mmDIAPHRAGM CONTROL:Fully AutomaticNUMBER OF APERTURE BLADES:9MAX DIAMETER x MIN LENGTH:2.5 x 0.36\" (62.9 x 9.2mm)WEIGHT (W/O HOOD):1.8 ozNOTES:External appearance by renowned designer Marc Newson. SP (Super Protect) coating. \"World's thinnest interchangeable lens\" at time of introduction.", "title": "Pentax K-01 16MP APS-C CMOS Compact System Camera Kit with DA 40mm Lens (Black)", "price": 17.12, "salesRank": {"Camera &amp; Photo": 9859}, "imUrl": "http://ecx.images-amazon.com/images/I/410LjJIgFOL._SY300_.jpg", "related": {"also_bought": ["B004UR7250", "B000EOVOZW", "B0040RDT0M", "B0002B8180", "B002KEVCEM", "B004U6KIJS", "B000HB2TJ2", "B007OXY8H2", "B002MN94PU", "B0000BZL2Y", "B003G5A2RW", "B003VNKNF0", "B00861DI4U", "B00A0N4KIA", "B006WPB8A8", "B00AAQXGLE", "B00004ZCJF", "B0055P95W4", "B0082OJ33Q", "B006NQ9T34", "B005CMDOAO", "B0076397MQ", "B006NQ9SX0"], "buy_after_viewing": ["B003VNKNF0", "B0040RDT0M", "B007SQB896", "B00B7ID99I"]}}