{"asin": "B001UO0RKS", "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]], "description": "The widescreen n&uuml;vi 1350T adds free traffic alerts to the n&uuml;vi 1350. In addition, this ultra-thin GPS has preloaded maps for North America or Europe, announces streets by name, guides you to the proper lane for navigation, offers pedestrian navigation options and calculates a more fuel-efficient route with ecoRoute.Ultra-thin, affordable, feature-rich navigation with traffic alerts.Click to enlarge.With n&uuml;vi 1350T's widescreen display, you'll always get the big picture.Click to enlarge.Easy-to-use touchscreen interface.Click to enlarge.Preloaded with nearly 6 million points of interest.Click to enlarge.Includes a wealth of travel tools and more.Click to enlarge.Navigate City TransitWith its enhanced pedestrian navigation capabilities, n&uuml;vi 1350T is the perfect travel companion for getting around town. Download optional cityXplorer content to help you navigate city public transit. Know where to walk, where to catch the bus, subway, tram or other transportation and how long it will take to get there. cityXplorer maps are available for select cities throughout North America and Europe. And with prices as low as $9.99, you'll have money left over to spend in the big city.Take It With YouTwenty-five percent slimmer than other n&uuml;vis, you can take the ultra-thin 1350T anywhere. It easily fits in your pocket or purse, and its rechargeable lithium-ion battery makes it convenient for navigation by car or foot.Know the Lane Before It's Too LateNo more guessing which lane you need to be in to make an upcoming turn. Lane assist guides you to the correct lane for an approaching turn or exit, making unfamiliar intersections and exits easy to navigate.See MoreWith n&uuml;vi 1350T's widescreen display, you'll always get the big picture. View map detail, driving directions, photos and more in bright, brilliant color. Its sunlight-readable, 4.3-inch display is easy to read--from any direction.Get Turn-by-Turn Directionsn&uuml;vi 1350T's intuitive interface greets you with two simple questions: \"Where To?\" and \"View Map.\" Touch the color screen to easily look up addresses and services and get voice-prompted, turn-by-turn directions that speak street names to your destination. It comes preloaded with detailed City Navigator NT street maps, nearly 6 million points of interest (POIs), 2-D or 3-D maps and the speed limit for most major roads. Its digital elevation maps show you shaded contours at higher zoom levels, giving you a big picture of the surrounding terrain. With the 1350T's enhanced user interface, you can slide your finger to conveniently scroll between screens. You can also upload custom points of interest (POIs). And with HotFix satellite prediction, n&uuml;vi calculates your position faster to get you there quicker.Receive Free Traffic AlertsSteer clear of traffic with n&uuml;vi 1350T's integrated FM traffic receiver and free lifetime* traffic updates. Receive alerts about traffic delays and road construction that lie ahead on your route. Next, simply touch n&uuml;vi's screen to view traffic details or detour around the problem area.Go Beyond NavigationNavigation is just the beginning. n&uuml;vi 1350T saves you gas and money with ecoRoute--a green feature that calculates the most fuel-efficient route, tracks fuel usage and more. The 1350T includes many travel tools including JPEG picture viewer, world travel clock with time zones, currency converter, measurement converter, calculator and more. With photo navigation, you can download pictures from Garmin Connect Photos and navigate to them. It's also compatible with MSN Direct (receiver purchase and subscription required). With its \"Where Am I?\" emergency locator, you always know your location. Simply tap the screen to get your exact latitude and longitude coordinates, the nearest address and intersection, and the closest hospitals, police stations and fuel stations. The 1350T features Garmin Lock, an anti-theft feature, and is compatible with our free Garmin Garage where you can download custom custom voices and vehicles. Enhance your travel experience with optional plug-in microSD cards.What's in the Boxn&uuml;vi 1350, pre-loaded City Navigator NT for North America, lifetime traffic, FM traffic receiver with vehicle power cable, vehicle suction cup mount, and quick start manual.Compare all Garmin n&uuml;visClick the button below to compare by series, user type, and features.Visit Garmin.com athttps://www8.garmin.com/support/download.jspto get thelatest firmware updatesfor your n&uuml;vi to keep it current and performing at its best.*Lifetime traffic extends for the useful life of your Garmin traffic receiver (as long as you own a compatible Garmin GPS) or as long as Garmin receives traffic data from its traffic supplier, whichever is shorter. Traffic content not available for all areas. See www.navteq.com/rdstraffic for traffic coverage areas and www.garmin.com/traffic/fm/navteq.html for program License Agreement containing complete terms and conditions.", "title": "Garmin nuvi 1350/1350T 4.3-Inch Widescreen Portable GPS Navigator with Lifetime Traffic (Discontinued by Manufacturer)", "price": 129.99, "imUrl": "http://ecx.images-amazon.com/images/I/51wPgCo7aPL._SY300_.jpg", "brand": "Garmin", "related": {"also_bought": ["B002KO7R2I", "B002Z1J8R8", "B003DSCU72", "B002OL2MU4", "B002VPE21A", "B003ZX8B0U", "B003MX2UX2", "B0039LRQ8G", "B004I5BUSO", "B006HY0Z1M", "B001U0O7T4", "B002771V48", "B003ZX8B1E"], "bought_together": ["B002OL2MU4", "B004I5BUSO"], "buy_after_viewing": ["B005DIBHCE", "B0057OCDQS", "B0057ODG6Y", "B00BHSTWOY"]}}