{"asin": "B0006SST9U", "description": "Gaming&#146;s notoriously naughty squirrel--Conker--arrives on the Xbox with a bang in an all-new Xbox Live-enabled team-based shooter,Conker: Live and Reloaded.The game features intense Deathmatch and Campaign story-line modes via Xbox Live and System Link, and players can compete as one of six combat specialists across multi-mission campaigns covering Old War and Future War. The warfare promises to deliver the non-stop action, humor, and innuendos Conker is famous for.Also included is the critically acclaimed single-player game,Conker&#146;s Bad Fur Day,completely recreated for the Xbox with stunning graphics and unparalleled attitude.Features:Team-focused, story-driven, Xbox Live gameplay: Team-based gameplay is at the heart of this shooter, pitting the noble Squirrels against the evil Tediz. Players can choose from a variety of scenario-based missions featuring two unique campaigns--Old War and Future War--with each mission featuring its own distinctly challenging gameplay mode. Campaign story lines, comprised of multiple missions played progressively, bring an innovative and fresh approach to team-based shooters and Xbox Live, supporting up to 16 players.Elite squad action: Players choose from six character classes, including Skyjockey, Long Ranger, Grunt, Demolisher, Thermophile, and Sneaker, each with its own signature weapons and abilities. InConker: Live and Reloaded,team composition has strategic and tactical advantages and implications.Xbox Live gameplay: Team-based gameplay, innovative campaign story lines, and distinctive humor all make for a great experience on Xbox Live. Online players strategize, cooperate, and communicate as a team in Campaign mode, or venture out solo against buddies in Deathmatch. Players can earn war medals, rise through the ranks, secure unlockables, and download new maps.Massive arsenal for maximum carnage: Devastating weapons include camera-guided rockets, an acid thrower, and loads of grenade types. Operate five types of vehicles including Sky Steed, Mule Bomber, R-Hog, Toad, and Tankus, and various types of equipment such as anti-infantry sentries, medi-guns, and a snoop camera. Special abilities allow players to disguise themselves or feign death and sneak up on unsuspecting foes to unload a demoralizing array of attacks.Twisted and irreverent world of Conker: Over-the-top humor, characters, and gameplay dominate in every way with rude wit, lewd innuendoes, and ridiculous violence. The juxtaposition of the characters, Squirrels and Tediz, and their world is at the heart of the humor. The expressions, exclamations, and special effects bring out the true Conker flavor.Wildly bizarre single-player adventure: The critically acclaimed single-player gameConker&#146;s Bad Fur Dayis now on Xbox, fully recreated with amazing graphics and enhanced profanity. The game is full of hilarious situations, movie pastiches, off-the-wall puzzles, and crazy characters in an offbeat world, including horny bees, voluptuous sun flowers, singing piles of poo, and even Death himself.", "price": 99.42, "imUrl": "http://ecx.images-amazon.com/images/I/517W97DA4BL._SY300_.jpg", "related": {"also_bought": ["B001ELWMHI", "B00008J7NZ", "B000067DPM", "B00004U1R2", "B00006LU9C", "B000BC1UZ6", "B00005V5LO", "B00006IJIS", "B00005NZ1G", "B00006JC3S", "B0006ZJPSC", "B0002B90SA", "B0006I5I58", "B0000C7GH4", "B0000A1OG8", "0761543422", "B00097IA88", "B0002CHJ2S", "B0000C6EDL", "B0006BK5AI", "B00005O0I7", "B00005NZ1K", "B0001UEHP8", "B000031KJT", "B00006LEMQ", "B0007PIEAQ", "B00002ST4U", "B000A0IBLK", "B00002STEZ", "B00009M987", "B00KWF366S", "B000084318", "B0008JILX6", "B00006IJIW", "B0002ILS1K", "B00009W5WB", "B0000C6EDM", "B00006LELI", "B00009U146", "B000E61G4O", "B0000C6FJ3", "B000066JRN", "B0000DJX7I", "B00008XKZM", "B00005Y3ZW", "B00005NZ1I", "B00006409Z", "B0007ZD79E", "B00002STGN", "B00065HIR2", "B00020BV1A", "B00005O628", "B0002A6CQY", "B00005Q8LR", "B00005RKO7", "B0016CQ0Q4", "B00082ZQZY", "B00KSR396C", "B00269DXXO", "B00005V5MZ", "B0000657SP", "B001I020CW", "B0050SYY5E", "B00009KX7C", "B000F3Z59S", "B000B6ML1Y", "B00005O0I8", "B0007PIEA6", "B0009O7HUI", "B000087L4G", "B0019SY1D4", "B00002STH0", "B000095ZH0", "B000B2YR74", "B0007OGDHS", "B00005Q8JN", "B00006LELH", "B003VBK1E0", "B0007P8FN2", "B0002CHJAA", "B0009351RK", "B000G0HJ3K", "B000G82R20", "B00006JZQZ", "B00000DMB5", "B000784XIA", "B0002ILS1U", "B00000K2R6", "B00002ST27", "B0002SQ0BS", "B00005YDNZ", "B00008G75X", "B00067AVSS", "B00006JBS7", "B0007ZD794", "B00007F8PB", "B00H51BJ0C", "B000620PSY", "B00005TN7U", "B000087R8F"], "bought_together": ["B00008J7NZ"], "buy_after_viewing": ["B00004U1R2", "B0001UEHP8", "B00005NZ1G", "B00005NZ1K"]}, "salesRank": {"Video Games": 2765}, "categories": [["Video Games", "More Systems", "Xbox", "Games"]]}