{"asin": "B000SATCUQ", "description": "Amazon.com Product Description The TomTom GO 720 Color GPS Navigation System with Mapshare is one of the newest, and most advanced GPS navigators to date, from one of the most trusted names in vehicle navigation. The GO 720 features a high-quality finish with an extremely elegant and slim design that allows it to not only complement any car's interior, but also fit perfectly and easily in your hand or shirt pocket so it can go anywhere you do. Despite its sleek and portable size, the TomTom GO 720 is packed full of all the functionality you need to easily get where you are going, as well as a ton of features to make your trip as safe and enjoyable as possible.Enjoy great functionality, including Map Share technology, traffic information, and a built-in FM transmitter.View larger.View top.View back.Fits perfectly in your car, hand, or pocket.View larger.The Tom Tom provides an optimal navigation view while providing extensive information.View larger.Check current weather and road conditions for places you're visiting.View larger.Top-Notch User Interface and SoftwareThe GO 720 is operated via an award-winning, intuitive user interface, and is ready to go right out of the box so as soon as you switch it on you can start using it. This navigator comes with the latest and most complete maps of the USA and Canada pre-installed for door-to-door navigation anywhere across the North American continent. Providing easy and quick access to extensive information such as building footprints and live traffic information, the unit includes multiple information options for personalization to your needs. What's more, the 720 is fully future proof, with new maps and free software upgrades available through TomTom's \"Home\" service so you'll never be out of date.Simple, Easy NavigationTomTom's GO 720 uses a 4.3-inch, extra-wide, touch-screen LCD display that features anti-glare technology for easy viewing even in direct sunlight. Realistic and clear visual instructions are provided with high-quality 3D graphics, while spoken instructions tell you where you need to go in your own language. Using the latest technology, the 720 provides you with fast and accurate positioning, with fast route calculation and automatic re-calculation so it's virtually impossible to get turned around. You can even record your own navigation instructions, for either places you know best, or for planning out trips in advance based on the recommendations of others.The GO 720 is as safe as it is convenient, and comes with a host of safety preferences. This unit helps ensure safe and efficient driving by doubling as a hands-free kit via Bluetooth technology, which is becoming essential as more states pass laws against driving while talking into a handset. With dual microphone support and a built-in high-quality speaker your phone calls are as clear as a bell, and with convenience features such as automatic call pick-up you can truly concentrate on your driving. However, if for some reason your concentration does lapse, this device includes a selectable speeding alert to keep you from accruing expensive tickets.Extra FeaturesThe GO 720 is full of functionality, such as a tip feature, a customizable status bar, an extensive guided tour, and even a 'Help me!' menu, so it guides you through its usage as much as to your destination. It also features a personalized shortcut menu, 'current location icon' options, and millions of POIs (points of interest) so you can find what you need wherever you are like a lifetime local was riding shotgun. Taking navigation beyond just convenience, the 720 lets you play your music wirelessly over your vehicle's stereo system via its built-in MP3 player and FM transmitter. Now you can enjoy your music on the 720, all while seamlessly providing navigation instructions and still handling your hands-free phone calls. This amazing navigation device even provides you with a document viewer and photo viewer, so you can take your work with you or instantly download and enjoy your holiday photos wherever you go.TomTom Plus ServicesThe TomTom GO 720 is compatible with TomTom Plus services that allow you to check the current weather and road conditions on your route, and get up to five-day forecasts for places your visiting. This feature also allows you to take advantage of buddies functionality, TomTom Plus traffic, and the easy download of additional voices. What's more, as a new addition to the TomTom line-up, the 720 comes with TomTom MapShare technology. TomTom Map Share technology not only lets you add to, update, and personalize your maps instantly, but also share them with others so all your family and friends know the latest changes in your area. You can also download others' changes daily as one of many online services.TomTom's GO 720 comes complete with TomTom Home software, an internal high-quality rechargeable lithium ion battery, and the capability to share content directly between other compatible TomTom GO devices. A Bluetooth remote control is available as a separate accessory. The 720 is also backed by a manufacturer's limited warranty.What's in the BoxTomTom GO 720 navigation device, windshield mount, desk dock with USB cable, car charger, CD-rom with software and user's manual, quick-start guide, accessory/PLUS leaflet, TomTom safe driving leaflet, and warranty information.", "title": "TomTom GO 720 4.3-Inch Widescreen Bluetooth Portable GPS Navigator", "imUrl": "http://ecx.images-amazon.com/images/I/51tezsf8z7L._SX300_.jpg", "related": {"also_viewed": ["B004J4VYG2", "B00160GOR6", "B001LK6XHM", "B004MYFTFG", "B000SSUHSO", "B004W1GQ92", "B0015F1L7A", "B003FSTAGY", "B001VEJEGK", "B001P3O764", "B000OH63MI", "B007M52QR6", "B002OL2NT4", "B004MYFTFQ", "B001H9O72K", "B000PCBVA6", "B003FSTAFK", "B004MYFTEW", "B004J4VYGM", "B007M4Z6FG", "B001VEJEGU", "B0057ODOCA", "B00BHAC85W", "B00A7LULA6", "B00C9W1LT6", "B005LMWPYG", "B007M4Z60Q", "B007M4Z7GO", "B00AJXMWP4", "B0014GXCBI", "B003FSTAHS", "B000H866BM", "B004MYFTF6", "B004FWOECY", "B004MYFTE2", "B0057ODG6Y", "B003B3P2CY", "B00CRXI2BW", "B00HTAUEUK", "B00HK6CPVY", "B007M52EXM", "B00BIZ0EY8", "B000F007K8", "B003FSTAH8", "B002DMK1R0"]}, "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]]}