{"asin": "B001UADEPC", "categories": [["Electronics", "Home Audio", "Stereo Components", "Receivers & Amplifiers", "Component Receivers"]], "description": "From the Manufacturer Add the Pioneer VSX-1019AH-K 7-Channel A/V Receiver to your home theater system and experience superior sound and a stunning picture from all of your entertainment sources. With features such as HDMI 1080p upscaling and the ability to simultaneously play music in one room and movies in another, this A/V receiver will quickly become the hub of your home entertainment center. And as a \"Works with iPhone\" certified receiver, you can use it to play music, movies, and photos from your iPhone.VSX-1019AH-KIntegrated Technologies:Related Products:BDP-320 Blu-ray Disc PlayerDV-420V-K Multi-Format 1080p Upscaling DVD PlayerThe VSX-1019AH-K lets you control and play your iPhone's music, movies, and photos on your home theater system.View larger.View demoof how the VSX-1019AH-K works intelligently with the iPhone for an outstanding experience.The Best Picture and Sound--From Any SourceThe VSX-1019AH-K supports the latest HDMI video technologies such as x.v.Color and Deep Color so your Blu-ray Disc&reg; movies and other high-definition sources will look great on your HDTV. Using advanced technology, the VSX-1019AH-K will upscale DVDs so that when you view them on your HDTV, you'll have a crisper, higher-resolution, and more beautiful picture than ever before, breathing new life into your old movies.4 HDMI inputs and 1080p upscaling provides great viewing no matter the source.A full complement of connections, including 4 HDMI inputs, lets you connect all your home theater components.View Connections.Seehow Pioneer's exclusive PQLS virtually eliminates jitter during CD playback.The receiver also provides outstanding sound to match the stunning picture with an amplifier that delivers 120 watts of power to each of the seven channels. The VSX-1019AH-K supports a wide variety of surround sound formats including Dolby&reg; TrueHD, DTS-HD&reg; Master Audio, Neural-THX&reg; Surround, and much more, so you'll be able to hear every loud explosion and soft footstep whether it's in front of you or behind you. Additionally, you can fine-tune the sound with features such as Advanced Multi-channel Acoustic Calibration, Symmetric EQ, Standing Wave Control, and Phase Control.Certified for Use with the iPhoneThe VSX-1019AH-K is a member of the first family of A/V receivers to be \"Works with iPhone\" certified. It gives you the option to enjoy everything your iPhone offers, including music, movies, photos and calling features. The receiver's front USB input and included cable make connecting your iPhone easy. When connected, the receiver charges your iPhone automatically.While you're enjoying your music, your TV will display album information and album art, and your music and movies will automatically mute when you receive an incoming phone call, so there's no need to switch your iPhone to airplane mode. And in addition to controlling music and movies directly from your iPhone, the VSX-1019AH-K also lets you control your iPhone with the remote and an intuitive on-screen menu.The receiver features Pioneer's exclusive Advanced Sound Retriever technology, which restores lost data in compressed music files. What this means is that when you're playing music from your iPhone, iPod or other MP3 player, you'll have music that sounds more like the artist originally intended. And with Auto Level Control, the VSX-1019AH-K makes sure the volume stays where you want it from song to song.Ample Connections for All of Your HD MediaThe VSX-1019AH-K receiver includes all the connections you need to control your HD multimedia devices. The receiver features 4 HDMI inputs and 2 Component inputs to connect Blu-ray Disc players, gaming consoles, Satellite, cable TV and more. So regardless of what source you're using, the VSX-1019AH-K will connect to it with ease.An A/V input on the receiver's front panel lets you watch movies from a video camera or other portable device without having to reach for a rear input. Other connections include 4 composite inputs, a pair of component video inputs, 2 coaxial inputs, 2 optical inputs, and a 5.1 multi-channel audio input.Enjoy Multiple Sources in Multiple RoomsWith the VSX-1019AH-K you can keep everyone in your household happy. Watch your favorite Blu-ray Disc title on your HDTV in your living room while someone else listens to his/her favorite tracks from an iPod or other digital music player in the kitchen.Fresh, Colorful and Intuitive Graphical User InterfaceTo make things as simple as can be, the VSX-1019AH-K includes a preprogrammed remote and features a new graphical user interface that has easy-to-navigate color menus and quick access to all the functions you need.The VSX-1019AH-K also has 63 tuner presets, so you can quickly dial in your favorite music channel. Additionally, you can add SIRIUS&reg; satellite radio to the dedicated input for even more entertainment options. (subscription sold separately)The VSX-1019AH-K is backed by a one-year warranty.Advanced Sound Retriever technology restores lost detail from compressed music for a better music experience from MP3 players.What's in the BoxPioneer VSX-1019AH-K 7-Channel A/V Receiver, remote control, and iPhone connection cable.Amplifier ChannelsiPhone/iPod Music, Photo, VideoAdvanced Sound Retrieverx.v. Color &amp; Deep ColorPQLSAnalog to HDMI Video Up-Conversion1080p Video Up-ScalingHDMI Terminals In/OutAV (Composite) In/OutAudio In/Out (Tuner Inc.)Component In/OutDigital In/OutVSX-1019AH-K7Multi4/13/14/12/14/-VSX-919AH-K7Multi3/13/14/12/13/-VSX-819H-K52ch3/13/13/12/13/-VSX-519V-K52ch2/13/13/12/13/-", "title": "Pioneer VSX-1019AH-K 7-Channel Home Theater Receiver (Black) (Discontinued by Manufacturer)", "price": 496.99, "salesRank": {"Electronics": 53821}, "imUrl": "http://ecx.images-amazon.com/images/I/41V459vYx%2BL._SX300_.jpg", "related": {"also_viewed": ["B00ITHKJCK", "B004M8RPBI", "B00BKXCKPY", "B00EPU3B4S", "B007L8Q75G", "B007O5ATM8", "B00BKXCKPO", "B007O5ATC8", "B004O0TRD8", "B007O5ATGO", "B0077V88W2", "B00BKXCKRC", "B00BHC7ZTE", "B005FAREJ0", "B005ETJVUM", "B00B981F4M", "B004M8RPB8", "B00JR6GJLW", "B00BLGUKEI", "B007R8U5R6", "B00HZE2WW8", "B0077V88VI", "B004NHCGJO", "B007X6RV5Q", "B004M8RPAY", "B0077V8930", "B007R8U5QW", "B00B7X2OW6", "B0081RNO52", "B00D4MQ0UU", "B00ITHKKRE", "B00B981F1U", "B007JF85VU", "B00B981F38", "B00548SKH8", "B0077V88YU", "B004QOA92A", "B005E1HWN8", "B00J356C0K", "B008BDBPT8"], "buy_after_viewing": ["B001TH7GSW", "B00BHC7ZTE", "B00BHC7ZTE", "B0077V8930", "B0052SCU8U"]}}