{"asin": "B0013AV4M4", "related": {"also_bought": ["B0000CD7K9", "B0012TLZNE", "B001LGDWE8", "B000AAM1YI", "B001KMRN0M", "B000F2DE8S", "B002I0GZ5Y", "B00BM7OJZM", "B000BOLHH0", "B00083JQY0", "B000XO2S9Y", "B0007TS24U", "B000UA0LXQ", "B005IF00ZM", "B000E0OCR8", "B00309UA0S", "B0007VDF2C", "B001N2EVPE", "B002BS47TE", "B002OJ7E40", "B000FFISV8", "B001HWF1OA", "B000TTZI0E", "B000LEFKXC", "B003DV5WUG", "B000FYZS6M", "B0014X7SQ6", "B002Q6XZGC", "B002TK3GH8", "B004BC5NA0", "B002BSC57U", "B00113X7YQ", "B001TD6SN0", "B000AM8RQM", "B0045SE9XC", "B002BS47WG", "B000UZH7P6", "B001TOQ8T8", "B00175GC40", "B00168PFFK", "B0019C6KAC", "B00542XG96", "B001FA0BAI", "B004I1IG0S", "B0036BINXQ", "B003DS4Z6Q", "B00005A4X6", "B0002Z456I", "B001RK2ZBO", "B000ASBKHE", "B000R3BN4M", "B000FZYY3E", "B000ERVLZC", "B0041PO3OY", "B0027CTURI", "B0018C6WH4", "B0009350CQ", "B0001AU7SY", "B0009WPZPY", "B006K554BE", "B000SH3XFY", "B002F87WEW", "B001F513VO", "B004Z4ZJGC", "B000165C10", "B003DSCXFQ", "B0069R5A8A", "B0032GWZXE", "B0032GNX3A"], "bought_together": ["B0000CD7K9"], "buy_after_viewing": ["B0012TLZNE", "B001GXI4LM", "B000XO2S9Y", "B0000CD7K9"]}, "title": "Sony 2 GB Memory Stick PRO Duo Flash Memory Card MSMT2G", "price": 16.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/51jIBo-zO7L._SX300_.jpg", "brand": "Sony", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Memory Cards", "Memory Sticks"]], "description": "This Sony 2 GB Memory Stick Pro Duo / MS pro duo is for you to expand the memory capacity for your compatible device like cell phone, PDAs, digital camera, music players, gaming devices and more cool devices that are with a MS pro duo slot available. It is ideal for storing media-rich files such as music, videos, and photographs. FEATURES: High storage capacity for storing essential digital content such as high quality photos, videos, music and more Slot compatibility: Memory Stick Pro Duo slot and Memory Stick Pro slot when used with an adaptor (NOT include) Memory Stick PRO Duo is half the size of a standard-size Memory Stick PRO media and it offers the same technologies including high speed data transfer, built-in Magic Gate, and high capacities. High Speed Memory Stick PRO Duo fits directly into new and upcoming Sony digital cameras and camcorders. SPECIFICATIONS: Memory Capacity: 2 GB Memory type: Memory Stick PRO Duo / MS pro duo Brand: Sony Adapter not included. IMPORTANT NOTE: 2GB is the physical memory storage capacity, actual available memory capacity is little smaller because of pre-setting card system files. Holding by the edges, insert memory card into digital device slot. Do not apply pressure to the center of the card. Memory can only be inserted one way. Refer to your device's user manual for more instructions. Compatible With Canon ES80"}