{"asin": "B002ATY7JE", "description": "Metroid Prime 3: Corruptionset a new standard for first-person motion controls in video games. Now it's bringing those controls to the rest of the celebrated series, allowing players to experience the entire Metroid Prime story arc with the peerless precision of the Wii Remote. Nintendo announces Metroid Prime Trilogy, a new premium three-game collection for the Wii console that bundles all three landmark Metroid Prime games onto one disc and revamps the first two installments with intuitive Wii Remote controls, wide-screen presentation, and other enhancements.Updated HUDView larger.Refined Control SchemeView larger.Upgraded GraphicsView larger.The Ultimate Metroid Prime ExperienceMetroid Prime fans, prepare to be happy--the celebrated series from Retro Studios has gotten a deluxe treatment on the Wii console. All three games in the trilogy have been crafted into one package, with a newly implemented exclusive title menu with direct access to any of the three titles. Not only that, but players can also earn awards by collecting tokens through their progress across the trilogy, making for an ideal award system.Key Game Features:Three incredible games from the Metroid Prime universe in one packageMetroid Prime 1 and 2 have a new refined control system to match Metroid Prime 3Premium tin caseCollectable tokens are awarded while progressing through the trilogyMetroid Prime 1 and 2 have new features and improvements such as 16x9 wide-screen presentation, and improved HUD system to accommodate the new pointer control, some graphic improvements, and newly added new difficulty levels.Upgraded to a Refined Control SystemBothMetroid PrimeandMetroid Prime 2: Echoes games have been updated with the refined control system ofMetroid Prime 3: Corruption. Moving is done with the Control Stick and the Nunchuk&trade; controller, while the Wii Remote&trade; controller controls the Arm Cannon's crosshairs, allowing the player to smoothly and more accurately aim by pointing at the screen. The camera will move where the player points, making for more intuitive control, and allowing players to look around and attack while moving. Three different sensitivity settings allow everyone from beginners to FPS veterans to find a response speed to their liking. In addition to the new control, the Nintendo GameCube games have new features in the Wii versions and improvements such as 16x9 wide-screen presentation, improved HUD system to accommodate the new pointer control, some graphic improvements, and newly added new difficulty levels.", "price": 236.48, "imUrl": "http://ecx.images-amazon.com/images/I/5193GCCuISL._SY300_.jpg", "related": {"also_bought": ["B002BSC4ZS", "0761563229", "B007RNWUC4", "B0009Z3MQ0", "B00006M3R6", "B00012BSJ4", "B00KWF803C", "B00KWEHBAG", "B004WLRQMI", "B00KWF366S", "B002EE7OKE", "B000U34SYQ", "B0094X1ZXU", "B001HB7K6I", "B002I08CSW", "B007CSF3GO", "B00KWF38AW", "B002BSC54I", "B000Z9A95M", "B006QRNKOO", "B00KWJ4JW4", "B000X25GW2", "B002BSA388", "B000P46NKC", "B00KWFCUNS", "B0019SY1D4", "B00KWG4HG0", "B0094X28J0", "B005FYJA52", "B00269DXR0", "B00009PS24", "B00KWFCU4M", "B008GFZV6Y", "B00002SVEM", "B002I0GEHI", "B00DC7G2W8", "B00269DXXO", "B003ZCH7DI", "B00005Q8M4", "B0049DYNNO", "B00I5LMSE2", "B002TLTBN0", "B001TOMR0C", "B002I0GF72", "B002BRZ9AG", "B0000A09EN", "B0002ILS1U", "B00712Y28Q", "B002E6XY6U", "B00DC7G1WE", "B009AFLXQQ", "B00002SVFV", "B0009Z3K9E", "B000FQBPDU", "B0009UBR3A", "B00KVRK39A", "B001YHX4B0", "B005EHQJ2C", "B003O6FW6E", "B00DC7O77A", "B00B2QL2Y4", "B004CHLNWQ", "B00GV4V8YQ", "B000L9NPGG", "B00BORFD9Q", "B001CTL5GQ", "B00DD0B0BM", "B000FQ9R4E", "B000GIXIPK", "B000FQBPCQ", "B00GANWVJE", "B0017KIBAI", "B00GV4V8XC", "B001TOQ8UW", "B009EWHKAI", "B00KWFY04A", "B002I0IIPY", "B00DC7G0GG", "B00AKIPBNS", "B002FG9MWE", "B000FQ9QVI", "B0050SVGW8", "B002CZ3SLO", "B0002A6CPK", "B00CAY50CW", "B000RF7164", "B001TOMQVC", "B00K848IH0", "B003ZHMMEM", "B002I094AC", "B003FBL86Q", "B008AU4YEA", "0804163448", "B00BMFIXEW", "0307469468", "B00009KO3S", "B00005Q8LR", "0804161380", "B00CTKHXFO"], "bought_together": ["B002BSC4ZS"], "buy_after_viewing": ["B002BSC4ZS", "B00G2GD6TS", "B00DC7G2W8", "B000FQBPDU"]}, "salesRank": {"Video Games": 3496}, "categories": [["Video Games", "Wii", "Games"]]}