{"asin": "B001ET5O70", "categories": [["Electronics", "GPS & Navigation", "GPS System Accessories", "Vehicle Mounts"]], "description": "This universal bean bag dashboard mount allows you to mount your navigation device on the dashboard of your vehicle. Non-skid backing and safety anchor ensure it stays in place. Can be easily removed and stowed away leaving no sign of a navigation device in the car. Compatible with all TomTom devices and fits most cars.What's in the BoxBean Bag dashboard mount, adhesive safety hook, cleaning pad, installation posterAbout TomTomFounded in Amsterdam in 1991, TomTom has established itself as a global leader in navigation by being an innovative company with a strong brand, clear customer focus, and high quality products and services.TomTom is the world's leading navigation solutions provider with navigation products sold in 30 countries and in over 20 languages. To further our commitment to car navigation, TomTom acquired Tele Atlas maps in 2008 so we can continually provide the most up-to-date maps and intelligent routing.We have our own mapping company!Did you know that every year roads change by up to 40% in high-growth areas? Tele Atlas manages this by using the world's most comprehensive systems to identify and incorporate these changes into our maps with unprecedented levels of speed and accuracy. All TomTom devices benefit from the Tele Atlas advantage--more coverage, more points of interest, and more freshness and accuracy.Why TomTom?At TomTom, we believe that personal navigation should be as easy and safe as possible. We develop smart technology that gives you straightforward solutions, innovations to make life easy.", "title": "TomTom GPS Dashboard Mount for TomTom GPS Navigators", "price": 14.95, "imUrl": "http://ecx.images-amazon.com/images/I/51I2ctQk0NL._SY300_.jpg", "brand": "TomTom", "related": {"also_bought": ["B007PPYXOC", "B007M4Z7GO", "B001OWE4SM", "B007M52QR6", "B004MYFTFQ", "B00BHAC85W", "B008JE6VAW", "B008H66BH0", "B004MYFTEW", "B00139U9XU", "B00BHABL1O", "B0015N0FGK", "B0050PKKKK", "B00I9UKS6O", "B00BHSTWOY", "B00AJXMWP4", "B005MIZYOW", "B00INXAY9S", "B00171BFVO", "B001S2R8E0", "B004MYFTFG", "B006W4CF24", "B004V3KD4U", "B001H4B0AC", "B00I9UKRZ6", "B00486U368", "B005JSM95W", "B004V3KD4K", "B002I007IA", "B004MYFTF6", "B007M4Z6FG", "B00INXAWMC", "B004I5BUSO", "B00A7LULA6", "B006W4MVZK", "B00885FSFQ", "B00BQM8S2S", "B007M52QEE", "B0037BVSCI", "B004V3KCIC", "B002I05VRC", "B005619HAW", "B002I03UVQ", "B004V3KCIM", "B0050JK3PS", "B003VKXI14", "B005JZTICM", "B0006ZQ4E0", "B00INXAIDK", "B0012BO3NQ", "B00F0CXAF0", "B000U5TUWE", "B001763SRI", "B00INXAKTC", "B001EPX7N2", "B00H4PDH4U", "B00CRQUKQ4", "B002OL2MU4", "B00INXAJ0W", "B003Z4TPPO", "B00HPM6E5Q", "B004UW0EMS", "B000E13BVA", "B0051FWA7U", "0984692126", "B004CLYJ0U"], "bought_together": ["B007PPYXOC"], "buy_after_viewing": ["B004V3KCIM", "B00CRQUKQ4", "B007PPYXOC", "B001H4B0AC"]}}