{"asin": "1400532655", "related": {"also_bought": ["B0069ZFYCY", "B005HM8BRU", "B004XKZ1UC", "B007H564NS", "B008I659JA", "B008I64S4W", "B00IKMJQ28", "B005HBTCC4", "B004WGKTRM", "B004YW5406", "B00IKML608", "B0071U6Y2A", "B007MY4K9E", "B004D1OBFW", "B00DXY3COG", "0594033926", "B0071U6XDK", "B007YDAAHO", "B008RDQWQI", "B005HM8BTI", "B0079VOE3W", "B009L3EKVW", "B008I64R5W", "B0071U6WYU", "B0032UP32K", "B007YDAB6O", "1400501784", "B00AZR9YVO", "1400501466", "B00620MJOM", "B00AZRHYKW", "B00AUKGBE4", "B006L38YTY", "B004N8PICA", "B00502ZH6K", "B00AUKH7C4", "B00FAS7ASW", "B0087UBS4M", "B00CPV1RDG", "0594033896", "B00DXY3B6K", "B004C3KHSG", "B0034ZPC7Y", "B008I64SF6", "B0069QPC0W", "140053271X", "1400698987", "1400532736", "B004H6JO6E", "B007YDAARE", "1400501776", "B004XFZKLM", "B008EZFFI0", "B00EM3WGYY", "B002BBJMO6", "B0093W3B3O", "B00B2ZAH0A", "B00530GZC4", "B00A7L668C", "B00B97BC7S", "B00BN1Q7DO", "B004ZAA3YO", "B004UGLBV2", "B00AUKI6H4", "B0034ZRAW4", "B00AAKLIIS", "B00AZR962G", "B00BBO3VWI", "B00CKWQHN0", "B00AFXKID6", "B00884BPUE", "B00E9IAQ1C"], "bought_together": ["B005HM8BRU", "B007H564NS"], "buy_after_viewing": ["1400501784", "140053271X", "B005HM8BRU", "1400501474"]}, "title": "Barnes &amp; Noble Nook Color eReader", "price": 113.99, "salesRank": {"Electronics": 3308}, "imUrl": "http://ecx.images-amazon.com/images/I/51lBXZsMsGL._SY300_.jpg", "brand": "Barnes &amp; Noble", "categories": [["Electronics", "eBook Readers & Accessories", "eBook Readers"]], "description": "Barnes & Noble Nook Color eReaderStunning 7-inch color touchscreen; Magazines & newspapers in rich color; Kids'books come alive; Over 2 million titles at your fingertips; Get social, surf the web, play games, even listen to music.Features:* Color Touchscreen: Nothing brings your reading to life like our VividViewTM Color Touchscreen. The rich high resolution backlit display uses more than 16 millioncolors to illuminate stunning images and crisp text for easy reading day or night.* Built-in Wi-Fi: NOOKcolor lets you go beyond reading with our built-in Wi-Fi connection. Surf the web, check your email, read a favorite blog or search Google it's all just a touch away.* Share and Recommend: The exclusive LendMe app lets you lend and borrow books from friends, all with just a few taps. You can also share passages and recommend books right from the page you're reading via Facebook or Twitter. * Make it Yours: From designing your home page to personalizing your bookshelves or choosing just the right font, NOOKcolor lets you create a customized reading experience that you can really call your own. * Just for You: Get ideas for books you'll love with our exclusive NOOKbook Personal Shopping. Our expert booksellers will make recommendations based on books you like, so you can enjoy one great read after another. * Fun with NOOKextras: Kick back and have a little fun with the growing array of exclusive NOOKextras. Crossword puzzles, Sudoku, Chess and Pandora internet radio are among the fun additions to the NOOKcolor experience. * A Library Without Limits: With 8GB of space and expandable memory, your library has virtually no limits. Hold thousands of books, magazines, newspapers, kids' books, songs and photos. And our Lifetime LibraryTM makes sure all your reading is safely stored so you always have access to it, anytime, anywhere.* Read in Style: A full range of high-quality accessories to enhance your NOOKcolor experience. Cover"}