{"asin": "B00006I5WJ", "categories": [["Electronics", "Portable Audio & Video", "Radios"]], "description": "The Tivoli Model One has been praised far and wide for its high-quality sound, small size, and cool, retro styling. We got our hands on a sample unit and came away impressed, just as many others have. Anyone who wants a compact, stylish radio with surprisingly good sound should give the Model One a look.DesignIn many ways, the Model One is the culminating achievement of famed audio engineer Henry Kloss's long career. Designed from the ground up by Kloss, who passed away in 2002, the radio exudes understated class and elegant simplicity. We received the Platinum Series Model One, which features a hand-lacquered, high gloss dark walnut cabinet that is simply gorgeous. According to Tivoli, the genuine wood casing isn't just for looks as it provides \"an acoustically inert housing\" that maximizes the speaker's sound quality. At just over 8 inches wide, 4.5 inches high, and 5.25 inches deep, the Model One is about the size of a toaster turned on its side-- plenty small to fit on a desk, dresser, or nightstand.The Model One's single rotary dial handles tuning for both AM and FM stations. It feels sturdy and smooth in the hand. The dial is designed to move between stations at a speed that is a bit slower than the speed at which the user turns the knob-- a 5 to 1 ratio, to be exact. This \"ratio\" dialing technique makes it far easier to tune stations accurately and quickly. It's a nice touch that sets the unit apart from other desktop radios.The tuner band selection and volume dials are easy to control. Plus, they're well designed for hands of all sizes. A small LED power indicator, as well as an LED that helps determine signal strength, are positioned between the dials. We liked the light-colored face and dark lettering printed on the Platinum Series model we reviewed; it made for easy operation in dimly-lit rooms. The Model One's single, 3\" driver is protected by a handsome metal speaker cover. Tivoli adds that the speaker is enhanced by a \"multi-stage frequency contouring circuit that adjusts the speaker's output over half-octave increments.\" The result, Tivoli claims, is \"musically accurate tonal balance and bass response.\"The back of the unit features a coaxial antenna jack for the included FM antenna wire. While the Model One also has an internal FM antenna, Tivoli recommends using the supplied external one for tricky tuning in locales with a lot of stations crammed together. There's a handy switch for switching between the internal and external antennae. A standard 3.5mm headphone jack is also provided, as is a 3.5mm auxiliary line in port for plugging in your iPod or other music device. If you want to use the Model One as a component tuner-- not a bad idea given the overall quality and accuracy of the tuning circuitry-- Tivoli has provided a 3.5mm output port. The back panel also sports separate ports for AC and DC power, making the unit a great choice for boating or RV use.Listening PleasureAs with the TivoliiPalportable speaker system, we were initially skeptical about the performance of a small, one-speaker unit that only offers monaural sound. The reality is that most small two-speaker systems don't allow you to place the speakers very far apart anyway, and the Model One's rich, resonant sound more than made up for its lack of true stereo separation. Plus, the Model One is a single, elegant box with no annoying speaker cords.While the Model One isn't designed to provide earth-shattering sound at high volume, it produces surprising clarity and fullness at normal listening levels. When turned all the way up, the unit's rich sound persists and we suspect that Tivoli engineered the Model One's volume level to max out before any distortion arises. If you don't need a lot of volume, the Model One delivers. As with the iPal, we were left scratching our heads and wondering how such great sound could come from such a little box.The Model One's tuning accuracy is also impressive; we were able to dial in stations we didn't even know existed. Tivoli says this is due to the unit's discrete-component FM tuner technology, which was originally developed for cellular telephones. Whatever Tivoli has done here, they did it right; closely-spaced stations are a breeze to tune.ProsCompact form factorExcellent soundSupremely accurate tuningConsNot engineered to produce extremely high volume levels", "title": "Tivoli Audio Model One AM/FM Table Radio, Hunter/Maple (Discontinued by Manufacturer)", "price": 85.02, "salesRank": {"Electronics": 73277}, "imUrl": "http://ecx.images-amazon.com/images/I/41xUTeXeTiL._SX300_.jpg", "related": {"also_viewed": ["B00IGXENR4", "B009DJEKJG", "B009DJO02S", "B009DJJJR4", "B009DJPOBY", "B009DJROOE", "B001BGGD8A", "B00006I5WM", "B0009ZAA4M", "B0009ZAA4C", "B0002HA7OK", "B0009ZAA42", "B003U4R5LA", "B0000DHVOO", "B000ABTP8W", "B0040IZGSO", "B008B3U5MQ", "B009OCBBJY", "B00DN50WWU", "B009OCBBGW", "B00FHB3UKY", "B009DKUJZ4", "B009O6XZ26", "B003U4LGII", "B003U4NEKQ", "B00EDQ31HG", "B00DN50YMS", "B009DKSLZO", "B009DKQES0", "B000083GPS", "B007S71MY6", "B00FFE80GW", "B009DKTL4O", "B000EDVT9E", "B0043VDAV8", "B005GTO0DI", "B00CTSNSW8", "B003JJ217E", "B00GR0MD8Y", "B0047S3ULC", "B003XQLUGQ", "B003UB2K9A", "B008OJ35WE", "B00094OSU0", "B00EDQ5Z8Y", "B00E7UYC3A", "B00372YKY0"], "buy_after_viewing": ["B001BGGD8A", "B009DJJJR4", "B0009ZAA4M", "B009DJEKJG"]}}