{"asin": "B001CM62UM", "description": "Thanks to Square-Enix, the original Star Ocean has finally made it to the United States in the form of Star Ocean: First Departure. A PSP remake of Star Ocean, which was never released in the U.S., First Departure adds several new elements, including all new backgrounds and a tweaked battle system, while still preserving the exciting storyline and themes of the original.Star Ocean: First Departure has been given new artwork and animated cut-scenes.View larger.Enter battle with basic melee attacks, special arts, or spellsView larger.In battle, you can control a character while the AI handles your teammates.View larger.Back to the BeginningIt is Space Date 346, and in a sleepy town on the planet Roak, defense-force members Roddick, Millie, and Dorn are on yet another dull patrol when a mysterious plague begins turning people to stone. Fortunately, Ronyx and Ilia, members of a Terran Alliance reconnaissance mission, beam down to the surface just in time. They explain that the plague is actually a biological weapon, and they take the defense-force to the space vessel to discuss how to save Roak from this mysterious attack.The majority of this role-playing game (RPG) actually takes place in the past, because the party realizes that the only way to save the people of Roak is to collect a particular genetic sample from the Roak of old. The game play of First Departure is fairly traditional RPG that has you moving about the world map on your journey, traversing towns and dungeons, progressing the plot as you go.Choose the Right StrategyYou enter battle either using basic melee attacks, special arts that require MP points and that can grow more powerful with use, or spells that also require MP points but take time to cast and can be interrupted before completion.Tactics let you set strategy commands for your characters before they enter battle and can be changed in the middle of battle. All characters will fight according to their set strategy, with different situations requiring different strategies.Private actions are sometimes offered as a character approaches a town on the world map. These private actions depend on timing as well as which characters you have with you as you enter town.. The outcome of these private actions will affect subsequent private actions, for better or worse.All New Artwork and New CharactersStar Ocean: First Departure uses a slightly altered version of the engine used for Star Ocean: The Second Story, but with many similar features. However, the pre-rendered backgrounds and 3D battle fields have been given new artwork and animated cut-scenes, and new playable characters have been added.First Departure has been given a much more dynamic battle system, letting you control a character while the AI handles your teammates. During battle, characters can move freely about the field, executing normal attacks with the X button, and performing special attacks with the L or R triggers. What's more, you can switch characters at any time with a quick press of the Circle button.First Departure also features an item creation system that lets you create new weapons and items to help you in battle, and an extensive skill system for developing your character as you play. You can boost certain party attributes, spending SP on skills to increase your fighters' speed in battle, for example, or spend points that develop your item creation ability and raise your character's strength.", "price": 54.99, "imUrl": "http://ecx.images-amazon.com/images/I/51uOnvu-21L._SY300_.jpg", "related": {"also_bought": ["B001CM0PJ6", "B002E6XY6K", "B000G0O6CW", "B000CI83LI", "B000R37S78", "B000NPTOTK", "B0014X7SQ6", "B000NPOGWK", "B004BV5O0U", "B000SSPH3E", "B000R39IKI", "B004LLRYOY", "B000OOOISM", "B003YVK5T8", "B001V7UX1W", "B0002GTFIK", "B002I0GZ5Y", "B003O21OWY", "B0045U4U52", "B006YMG92G", "B00523VFJU", "B00356GVRW", "B001KMRN0M", "B002I0J4AM", "B001TD6SN0", "B002I0GXWO", "B004R0TR0S", "B006O3Z2ZA", "B003Q9RG9K", "B000TTZI0E", "B001IB1YOQ", "B000R37S00", "B008BERJEM", "B003WTR2QQ", "B004CVR8K8", "0744010713", "B000B4SVHY", "B000G7X5P4", "B0012FHYS8", "B002EQFXZA", "B000G82R20", "B000HKIPGE", "B00KVRK39A", "B00B2QL2Y4", "B005EYJ4PO", "B00304SAJQ", "B000VIPJ0W", "B001NJKHWI", "B000ASBKHE", "B002I0GKIQ", "B0002CHJAA", "B00005BW7Q", "B001HWF1OA", "B00004RBQX", "B002BS47TE", "B0007UDYU6", "B000FZ1YV4", "B00000K39I", "B004CVWETI", "B000HKMG14", "B001COTC3E", "B004I8EEMU", "B003WIWQF4", "B000FUG5TK", "B00J6DLPLK", "B001ATAIH0", "B000FM0SHS", "B000R2YWEQ", "B002CZ3SEQ", "B001C3N0P6", "B0010YOQIW", "B000AVBFU8", "B002DMJ0RM", "B001TIFML4", "B001TOMR6Q", "B007CSF3GO", "B00APBF8A6", "B00B67ZTUW", "B003VMWR14", "B00168PFFK", "B00D87TCN8", "B000HQG5FG", "B002I0EH6I", "B00008KTRS", "B004HVKABW", "B0029ZUPSQ", "B00BY0G0YU", "B000CBCVEU", "B000FPGZUE", "B00C1ZBFTW", "B003U3UXUQ", "B001QTW2GY", "B00GV4V8XC", "B000G7X5MM", "B00006LEM8", "B001GMSHSI", "B000CBCVEK", "B000784XG2", "B001GXI4LM", "B0016C3260"], "bought_together": ["B001CM0PJ6", "B001KMRN0M"], "buy_after_viewing": ["B001CM0PJ6", "B003YVK5T8", "B00356GVRW", "B0014X7SQ6"]}, "salesRank": {"Video Games": 9783}, "categories": [["Video Games", "Sony PSP", "Games"]]}