{"asin": "B00604YSNK", "related": {"also_bought": ["B002IKLJVE", "B006FKR1PG", "B004OZMZKK", "B00598CUFQ", "B006ZQI1VS", "B001ISKNKA", "B005AIR2TE", "B0043VE29C", "B003VNKNF0", "B005J5TZWK", "B0057LX9H8", "B0000BZL1P", "B002LARVXQ", "B0068MK32E", "B0049IOPFK", "B00009R96B", "B00004ZCJE", "B0055N2L22", "B0058PL9QG", "B005J5TZVG", "B004DOUOI2", "B007248ES2", "B00843ERMW", "B009SGB3KS", "B005TOU804", "B009DL0LOW", "B00DJS830Y", "B0052M1FU0", "B00489Q1WU", "B004Q3C98S", "B0043VE28S", "B008MD3RNY", "B003VNKNEQ", "B000A1SVXC", "B00004ZCJG", "B0061GS1OO", "B007M54E08", "B0037FLUYU", "B0054EPPZM", "B002L72ANK", "B003G49V70", "B00B7X1WA6", "B0000BZL47", "B00009R6JT", "B00009R98A", "B0058PL9R0", "B0028Y5GKK", "B007G5NNOW", "B007M54E1M", "B0065I3XEG", "B000H02B6O", "B008MB71IS", "B00009KLAD", "B008XM03YA", "B0094BAYWA", "B009EEK828", "B007V551P6", "B008BBI6TC", "B00669O3XY"], "bought_together": ["B003VNKNF0"], "buy_after_viewing": ["B003VNKNF0", "B00B7ID99I", "B008CVHLT2", "B00728ZBA2"]}, "title": "Panasonic Lumix DMC-GX1K 16 MP Micro 4/3 Compact System Camera with 3-Inch LCD Touch Screen and 14-42mm Zoom Lens (Black)", "price": 499.0, "salesRank": {"Camera &amp; Photo": 6757}, "imUrl": "http://ecx.images-amazon.com/images/I/41Nu2UZ2bdL._SX300_.jpg", "brand": "Panasonic", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Compact System Cameras"]], "description": "Panasonic Lumix DMC-GX1 16 MP Micro 4/3 Compact System CameraSuperb Image Quality and Performance Combined with a Premium DesignPanasonic is pleased to announce the addition of the DMC-GX1 interchangeable lens system camera as part of the LUMIX G Micro System as part of the new premium mirror-less line up - DMC-GX1 featuring high image quality and stunning performance in both response and function.LUMIX G Micro System realizes high-quality photo images with real-to-life details through excellent resolution, image rendering and color reproduction. Taking full advantage of the 16.0-megapixel Live MOS sensor and Venus Engine, images to be shot in low-lit situations at max. 12800 high ISO sensitivity setting is stunningly clear with highly sharp resolution.Precision Contrast AF system of LUMIX G Micro System gains even higher speed realizing approx. 0.09 second of Light Speed AF.* Consecutive shooting is also improved for 4.2 fps in 16.0-megapixel full resolution.The DMC-GX1 records 1920 x 1080 full-HD video with stereo sound in AVCHD format which is superior in both compression efficiency and friendliness with AV equipment for playback. Advanced AF system including practical full-time AF and tracking AF is available in video recording so that every photographer can enjoy high quality video recording with minimum ease.As a camera from the new premium line of LUMIX G Micro System, the external design of the camera has been developed with no compromising on grip, dial, coating - everything to detail. The hot shoe on the top lets you attach the optional tilt-shift Live View Finder (DMW-LVF2) of approx. 1.4x (approx. 0.7x**), 1,440,000-dot equivalent, 100% field of view. It is now compatible with UHS-I standard for the SDXC/SDHC Memory Card taking its advantage to extend performance.Available in silver and black, the DMC-GX1 offers luxurious comfort in shooting experience with a stunning performance and a host of functions, to be a great partner that is always in your sight, in your mind.* The time for focusing on the subject is measured with LUMIX G X VARIO PZ 14-42mm / F3.5-5.6 ASPH. / POWER O.I.S (H-PS14042) to move the lens position to \"2m\" from \"infinity\" position. The zoom position is in wide end. Panasonic measurement method** 35mm camera equivalentHigh Image Quality for an Interchangeable Lens System CameraLUMIX G Micro System realizes high-quality photo images with real-to-life details through excellent resolution, image rendering and color reproduction; high-grade lens and precision AF achieves high resolution, optimal balance of resolution and noise reduction achieves lifelike image rendering and high precision auto exposure and white balance with live light metering results in the faithful color reproduction.The 16.0-megapixel Live MOS sensor plays a big role in high quality image rendering. With the dedicated circuit which reads out signals with minimum noise, the level of noise is significantly suppressed by more than 66%. Notably max. ISO 12800 is available with DMC-GX1. In shooting at high ISO setting, S/N value is improved by approx. 200% compared with the conventional 12.1-megapixel sensor. The sensor performance improves by 6db at ISO 3200 and max. 9db at ISO 6400, resulting in the dramatically flawless picture without noise.In addition to the high-speed signal processing with its 3 CPUs, the image processor Venus Engine boasts its excellent performance with an adoption of noise reduction technology for even higher quality of image. By separating chromatic noise from luminance noise even more accurately by applying the optimal noise reduction to each, you can capture clear and beautiful images even when shooting at high ISO sensitivity levels. By preventing the color mixture which tended to occur around the edges, any chromatic noise, not only in the gradation part but also in the edge part, are described clearly. The engine also provides selective noise reduction to the outline part to let it have more naturally-balanced curve without deterioration of the resolution. In addition, the spot-type noise which can be often seen in the dark area of the picture taken in low light situation or color bleeding on high luminance area generated by the chromatic aberration. Details are kept by optimum synthesizing of the data which is processed with resolution-priority for edge part and NR-priority for smooth part of a picture*. The result is a picture with stunning clarity if shot in low-lit situations. Furthermore, optimization of the parameter contributes to the increase of resolution.* In a single shot at ISO3200 or higher. Not available with iA and iA Plus modeAdvanced AF SystemAll cameras of LUMIX G Micro System adopt Contrast AF for its focus system. The Phase-difference AF system is susceptible to mechanical margin of error. However, in Contrast AF system, focusing is controlled by the image sensor so that no mechanical margin of error occurs to achieve precise focusing. Compared with the Phase difference system AF, the Contrast AF boasts higher accuracy especially in shooting with bright lens with small F value. (e.g. the accuracy of Contrast AF is approx. 90% while Phase difference AF is approx. 60% at F1.4.)The DMC-GX1 features the approx. 0.09 second of ultra high-speed Light Speed AF* which is achieved by reducing the detection time for focusing by the synchronization of the lens and the sensor at 120 fps. Not only the accuracy but also the speed excels by far than the high-end DSLRs with Phase difference AF with the advanced Contrast AF system in DMC-GX1.The newly added focus mode AFF (AF Flexible) locks on the focus when shutter button is half-pressed, however, if the subject moves, the focusing is reset to get the best results.Combined with the Touch AF control, setting and focusing at the subject is incredibly easy and quick, never missing the spur-of-the-moment. Taking further advantage of Contrast AF, the DMC-GX1incorporates Full-area focusing which makes it possible to set focus on any point in the field of view. Frame composition is free and intuitive combining the touch-screen operation.The touch-control system of DMC-GX1 immediately lets users to set focus to the subject by just touching it on the large, 460,000-dot wide-viewing angle LCD and you can even release the shutter. Once you lock on the subject by a touch, the camera tracks the subject with the AF tracking function even if it moves. Just a touch on the screen lets you select the part and the size of AF area with the 1-area AF. The 1-area AF in Face Detection even allows you to set finer focus on the eyes while capturing human face bright and clear. The Multi-area AF with 23 AF areas allows you to set a group of AF point according to the composition. In addition, Pinpoint AF function is incorporated in DMC-GX1 allowing more precise focus setting by further enlarging the focusing area. It assists, for example, setting focus right on the pupil in an eye.In the MF assist mode, you can enlarge the part by just a touch to select 1x, 4x, 5x or 10x and smoothly move the part by dragging it on the screen. The 4x enlarged view is displayed on the framing screen making it possible to setting fine focus while composing the whole picture at the same time. * The time for focusing on the subject is measured with LUMIX G X VARIO PZ 14-42mm / F3.5-5.6 ASPH. / POWER O.I.S (H-PS14042) to move the lens position to \"2m\" from \"infinity\" position. The zoom position is in wide end. Panasonic measurement methodEasy Manual Control with a Variety of Shooting Assist FunctionsDespite its outstanding compactness, the operation on DMC-GX1 is smooth and easy with optimum layout of control buttons and the mode dial, turn-and-press dial and dedicated function buttons. The function the user changes its setting can be assigned to the 2 external buttons and 2 menus in the software tab for direct reach. In addition, a total of 4 custom setting patterns can be memorized to the camera (1 on C1 for direct switch and 3 on C2).Now the DMC-GX1 comes with Level Gauge which lets the camera detect the horizontal/vertical angle of view with its internal level working with the acceleration sensor. Photos shot in a portrait aspect will be automatically displayed vertically whatever lens is used.The newly incorporated One Push AE adjusts exposure with a single press of Fn (Function) button when it is over/under exposure. It is especially useful in shootin outdoor with open aperture or indoor with fast shutter speed."}