{"asin": "B001C6GVI6", "description": "Shin Megami Tensei: Persona 4is a console role-playing game (RPG) for Sony's PlayStation 2. Chronologically the sixth installment in the Persona series,Persona 4is a suspenseful countryside murder mystery with multiple twists and turns in the plot that will have you guessing all the way to the end.Chronologically the sixth installment in the Persona series, Persona 4 is a suspenseful murder mystery.View larger.The silent male protagonist wields a two-handed sword weapon.View larger.Using Mayonaka TV, you can phase into the television set and enter a shadowy world.View larger.game play and style are similar to Persona 3, but there are plenty of new twists and additions.View larger.Myth and Occult Mixed with Contemporary JapanMegami Tensei was originally based on the novel series Digital Devil Story by Aya Nishitani. A major franchise in the RPG genre, MegaTen games take place in the contemporary or near-future Japan, mixing occult and cyberpunk elements. The games feature mythological references from multiple mythologies, and the player is often asked to make moral or philosophical choices that affect the game's storyline and ending.The silent male protagonist who represents the player in Persona 4 attends Yasogami High School with Chie, Yosuke, and Yukiko. His entire personality and name is decided and portrayed by the player's in-game actions and decisions. He wields two-handed sword type weapons, but unlike Persona 3, he doesn't use alternative weapons.Mysterious Murders AboundPersona 4 takes place in a rural town named Inaba where mysterious murders occur whenever there is fog after heavy rain. The town has a television channel that airs only at midnight called Mayonaka TV, during which it is said that one can see their \"other half\" while staring at the screen. After hearing about a recent unsolved murder, some characters realize that they had witnessed the murder victim while watching Mayonaka TV.The protagonist discovers that during midnight when the channel is on, his body can phase into his television set, using the set as a gateway to another world infested with shadows. Mayonaka TV and the town murders seem so connected that it's possible that the victims may in fact victims of Mayonaka TV itself. The characters decide to solve the mysterious murders by exploring the hidden world of Mayonaka TV.Brand-New Yet Familiar game playPersona 4's game play and style are similar to the popular Persona 3. Players familiar with Persona 3 will quickly recognize the social links and dungeon crawling game play, as well as the engine itself. The battles also have some similarities, such as the One More system, All-out attack, and the AI controlled support characters.However, unlike Persona 3, characters can be set to take commands from the player, new glasses allow characters to see through the heavy mist inside Mayonaka TV, and tarot cards can be shattered to summon the characters' respective Persona. Other changes include an increase in player stats from three to five, and the removal of health status, allowing players to explore dungeons continuously.Let the Action BeginBattle-wise, Persona 4 lets you directly control the actions of other party members and continually exploit an enemy's weakness. Post-battle card shuffles have added Arcana Chance, which bring you good or bad status depending on the Arcana. Battles now occur after school instead of at midnight, like in Persona 3, giving the player less time in which to do social activities. This turns out to be significant because Social Links now have a greater effect on battle.At higher levels, the player's allies progress from occasionally protecting the protagonist from a deathblow, through occasionally offering follow-up attacks, to eventually allow the persona of the corresponding ally to evolve into another persona. And persona can retain or even lose weaknesses and can be immune to certain kind of magic attacks. All allies who have their corresponding Social Link levels maxed out now have a chance to survive an otherwise fatal attack, leaving them with one remaining HP.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51UTQTqkPaL._SY300_.jpg", "related": {"also_bought": ["B0014CN2H6", "B00024W1U6", "B00008KTRS", "B000784XG2", "B007B7BI8S", "B007B7BHJ8", "B00009YEJY", "B00KVRK39A", "B000FPGZUE", "B00356GVRW", "B00004YRQA", "B000TLU67W", "B0009A4EV2", "B000IONGU4", "B0002GTFIK", "B00005BW7Q", "B000G7X5MM", "B0009XBWY6", "B001QTW2GY", "B00523VFJU", "B0009A4EVM", "B00005ME6O", "B00004Y57G", "B000F5IH2I", "B00AGCP3VS", "B009Q6F5FE", "B000FPM4WC", "B00006LEMK", "B0002RQ3ES", "B0002Y2XXQ", "B00005TNI6", "B002VA593A", "B001V7UX1W", "B004P7VGF2", "B00KBD4T9Y", "B00005LOXE", "B0054J1LBO", "B001MW91IW", "B001QTW2HS", "B00004YRQ9", "B00KBD4SJA", "B008DL4MSO", "0979884861", "B000066TS5", "B007W8S2MG", "B002I0J4AM", "B00I462XXO", "B00005MDZD", "B002I09286", "B000F8O1C0", "B000G82R20", "B00019HNNC", "B0016C3260", "1926778456", "B0000C7GHG", "B00C1ZBFTW", "B004P6IVPQ", "B00002R28C", "B006VB2V7W", "9629971372", "B0009A4EUI", "B00004TC6E", "B000R2YWEQ", "B0002CHJAA", "B0045L3SNQ", "B00006B5T8", "B00APBF8A6", "B00DVPMVIU", "B00004ZDFY", "B000CC5CHW", "B00007KQC1", "B00KVRK3EU", "B0009A4ETY", "B003VR5PPY", "B00136MBHA", "B00GOOSTFE", "B00005Q8M4", "B000BKSGH8", "B0002B90OE", "B009ZPSBFM", "B000AVBFU8", "B000B69E9G", "B00000JRSB", "B00004S9AF", "B0013JHKU0", "B00008URUA", "B008R7BXUO", "B000WE8JES", "B00006LEM8", "B00D87TCN8", "B00E8ZK3EG", "B00005T7ZN", "B000G6SPHI", "B0032GTMEE", "B000E49SGE", "B009UL2C06", "B000G7X5P4", "B00KWFY04A", "B000GABTVS", "B000GACEHQ"], "bought_together": ["B0014CN2H6", "B00024W1U6"], "buy_after_viewing": ["B0014CN2H6", "B00KVRK39A", "B007W8S2MG", "B00024W1U6"]}, "salesRank": {"Video Games": 755}, "categories": [["Video Games", "More Systems", "PlayStation 2"]]}