{"asin": "B00169N0BK", "categories": [["Electronics", "Camera & Photo", "Accessories", "Digital Camera Accessories", "Accessory Kits"]], "description": "Designed especially for professional photographers and passionate hobbyists, the ColorMunki Photo is an all-in-one spectrophotometer that allows you to adjust and match colors between devices. The ColorMunki is the only device you need to calibrate your computer monitors, projectors, and printers so that the color you see on screen is precisely the same as the color you'll get in print. With ColorMunki, you'll finally be able to stop wasting ink, paper, and valuable time with trial-and-error color correction, and enjoy the benefits of precise color from the beginning.With ColorMunki, what you see on the screen is what you get in print.ColorMunki measures your monitor's color display and records a color profile.Scan a printed color chart to correct colors and match them to your monitor's display.Optimize Your Colors to PerfectionAs a photographer, you know perfect color is essential.  But with today's complex digital imaging workflows, getting colors to match between devices can be a challenge.  ColorMunki simplifies this challenge with its easy-to-use interface and self-guided system, streamlining the process while still delivering optimal results. In just minutes, you'll be able to synchronize your monitor's colors with the colors of your printer or projector.Create and Store Color Profiles for Dependable ResultsTo calibrate your monitor, all you have to do is point the ColorMunki's sensor at the screen and allow it to measure the colors your screen displays. The device will then compare the measured colors with \"ideal\" colors, and create a color profile accordingly.Printer profiling is easy, too. By using RGB and CMYK printer profiling technology, the ColorMunki is able to deliver a high-quality profile in seconds. Simply scan a printed test chart with the device, and ColorMunki will detect your printer's coloration tendencies and dynamically correct them. You can even use ColorMunki to optimize your color profile based on images for black-and-white, sepia tones, flesh tones, and more.ColorMunki also features AppSet software, which allows it to interact with a variety of different design applications. Once you've finished creating a color profile, AppSet will automatically synchronize it with any of the following programs: Adobe Photoshop CS3, Adobe InDesign CS3/4, QuarkXPress 8, CorelDRAW Graphics Suite X4, and Corel Painter X. You'll be able to digitally manipulate colors with more confidence than ever before.Share Your Art with the WorldColorMunki comes complete with software that allows you to customize your color palette, giving you maximum artistic control over your photos. It will automatically extract colors from any image you choose, then generate an accurate palette for you to work with. Alternately, you can manually grab colors with the spot color measurement function and create a palette of your own. Then, when you're ready to use your custom palette, ColorMunki will automatically synchronize it with your favorite design applications.Once your images have been color-corrected, you can share them using ColorMunki's DigitalPouch feature. Simply drag and drop them into the pouch, \"zip\" it up, and send. The recipient doesn't need any special software installed: they'll be able to view the images along with the embedded color profiles in a self-contained viewing window. The program even provides a warning to recipients whose monitors aren't profiled, so you can ensure that your clients are viewing your work as it's meant to be viewed.What's in the BoxBlack ColorMunki spectrophotometer, ColorMunki profiling software, ColorMunki Photo ColorPicker and DigitalPouch software, Interactive Training DVD, ColorMunki protection bag/monitor holder, Quick Start Guide, and USB power cord.", "title": "X-Rite CMUNPH ColorMunki Photo", "price": 449.0, "imUrl": "http://ecx.images-amazon.com/images/I/51vVEyDc4RL._SY300_.jpg", "brand": "X-Rite", "related": {"also_bought": ["B002NU5UW8", "1454702451", "B00006B7P4", "B0098HGNLQ", "0321908457", "B00IAYFDIC", "B000N2VE7I", "B008CASNSQ", "B004BFKGYK", "B00113A2S0", "B00ALMJT04", "B000J3MQQE", "B0089INHZ0", "B004L62KPC", "B000J3JI2E", "B000L9M2LU", "B000J3HET8", "B000UWYJXM", "B000J3HCXG", "B004TGZ7WM", "B001ENW61I", "B004L3DEZ0", "B001JQLH8I", "B005KEL4BU", "B004L3FIPY", "B001CUF958", "B000P1BEFE", "B002PLQ7LI", "B004L3KJVW", "B00827MK3S", "B004L3KJTO", "B0095F5BCS", "B004L3DEY6", "B001441YFQ", "1937538249", "B002N9DREC", "B004L3HH80", "B0055MBQOW", "B007FEFQDA", "B00CMHQOJU", "B000J3JI2Y", "B000JLO31C", "B00007DTD2", "B00HYAL88W", "B004L62KRK", "B004L3FGK6", "B0063AAWWC", "B0009BX0AM", "B001EX38MO", "B004IZN3RK", "B00EZ8BEXK", "B000J3L3KY", "B00CLKOWVA", "B005BV100C", "B000B57HFA", "B007C0VHTE", "B000J3MQQO", "B0062N2RFA", "B007V9N5R8", "B001T9NXA0", "B002N9DRCE", "B000BTCJNG", "B001OKBLEE", "B001KNP3MQ", "B00BWV72O8", "B00FSB75ZO", "B00006B7P6", "0321934407", "B007FH1KX2", "0240806492", "B0024NKJZ2", "B00009UTIP", "1933952318", "0321968700", "B005KCJQJO", "B00BP1W52Y", "B000GU9I6Q", "B00CH6AWOY", "B00004Z613", "B00009NDCX", "B008AZJXDM", "B005PCDSBQ", "B00007DTD3", "B000CRLBN6", "1584282207", "B003VTBF42", "B000IBPD0S", "0321839579", "B001KELVS0", "B00BBQ8ICY", "B000J3MOOS", "B007FH1KAU", "B0040609WO", "B001DIG46M", "B00CNZTPGA", "B001M4HXB2", "B001AHALEC", "B00B1WAZ8S"], "bought_together": ["B002NU5UW8"], "buy_after_viewing": ["B0055MBQOM", "B002NU5UW8", "B0055MBQOW", "B007V9N5R8"]}}