{"asin": "B0018RUCJ8", "imUrl": "http://ecx.images-amazon.com/images/I/31F0IBlqdrL._SX300_.jpg", "description": "Is your online gaming experience fast, powerful, and hassle-free? Or are you struggling with wireless dead spots and frozen graphics, or tripping over the Ethernet cable running from your living room to bedroom? The latest Powerline technology solves these headaches, by combining the flexibility of wireless home networking with the stability and speeds of a wired connection. And best of all, it's a very simple way of creating a home network that uses the electrical wiring already in your home.Turn any plug in your house into a gaming network connection with the Actiontec MegaPlug AV Powerline Gaming Kit. Perfect for PC, Xbox, Playstation and Wii gamers, it features a very fast up to 200 Mbps speed, very low ping rates under 3-milliseconds, and instantly connects the gaming console to your Internet connection. To use with the Wii, an USB to Ethernet adapter is required.HomePlug is faster than 54G WirelessWhile the 802.11g standard supports a maximum bandwidth of 54 Mbps, most users are lucky to get 20 Mbps. In contrast, HomePlug AV can deliver a theoretical maximum speed of 200 Mbps, and most users can enjoy speeds of 85 Mbps -- many times faster than their broadband connection. In addition, HomePlug networks have very low latency (less than three milliseconds, depending on gaming configuration).HomePlug is more reliable than wireless networkingWireless networks are prone to dead zones, weak signals, and fluctuating speeds. And they're subject to interference from common elements in any household -- walls, cordless phones, microwaves, other wireless devices, and more. The HomePlug Powerline technology offers a stable connection wherever there's an electrical outlet, including the basement and corner room on the second floor.HomePlug is easy to setupLiterally plug in and go! While a wireless network can be difficult to setup (especially when dealing with lengthy WEP Keys), Powerline networking offers a simple alternative. All you need to do is plug a HomePlug-to-Ethernet adapter into an outlet and attach it to a router via an Ethernet cable, and then connect another adapter to your gaming console or computer. HomePlug uses the existing electrical wiring, so there's no need to run Ethernet cables or drill. And considering most homes have more than 44 outlets, chances are you can find an outlet exactly where you want to game.", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Network Adapters", "Powerline Network Adapters"]], "title": "Actiontec HLE200AV0-01GK MegaPlug 200 Mbps Powerline HomePlug A/V Gaming Adapter Kit (White)"}