{"asin": "B001REZLY8", "description": "Vault-Tec engineers have worked around the clock on an interactive reproduction of Wasteland life for you to enjoy from the comfort of your own vault. Included is an expansive world, unique combat, shockingly realistic visuals, tons of player choice, and an incredible cast of dynamic characters. Every minute is a fight for survival against the terrors of the outside world &ndash; radiation, Super Mutants, and hostile mutated creatures. From Vault-Tec, America&rsquo;s First Choice in Post Nuclear Simulation.PUBLISHER: Bethesda SoftworksDEVELOPER: Bethesda Game StudiosRELEASE DATE: 10/13/2009PLATFORM: Xbox 360&trade; / PLAYSTATION&reg;3 systems, Games for WindowsGENRE: Post Nuclear Role-PlayingWith Fallout 3 Game of the Year edition, experience the most acclaimed game of 2008 like never before. Create a character of your choosing and descend into an awe inspiring, post-apocalyptic world where every minute is a fight for survival. Fallout 3 Game of the Year Edition includes the original game as well as all five of the Fallout 3 Game Add-on Packs:&nbsp;Awards:Included Add-on Packs:Operation AnchorageEnter a military simulation and fight in the liberation of Anchorage, Alaska from its Chinese Communist invaders.&nbsp;The PittTravel to the post-apocalyptic remains of Pittsburgh and become embroiled in a conflict between slaves and their Raider masters.Broken SteelIncrease your level cap to 30, and finish the fight against the Enclave remnants alongside Liberty Prime.&nbsp;&nbsp;Point LookoutEmbark on a mysterious and open-ended adventure in a huge, murky swampland along the coast of Maryland.&nbsp;Mothership ZetaDefy hostile alien abductors and fight your way off of the alien mothership, orbiting miles above the Capital Wasteland.&nbsp;images and screenshots &copy; 2009 Bethesda Softworks LLC. All Rights Reserved.About Bethesda SoftworksBethesda Softworks, part of the ZeniMax Media Inc. family of companies, is a premier developer and worldwide publisher of interactive entertainment software. Titles from two of the world&rsquo;s top development studios &ndash; Bethesda Game Studios and id Software &ndash; are featured under the Bethesda Softworks label and include such blockbuster franchises as DOOM&reg;, QUAKE&reg;, The Elder Scrolls&reg;, Fallout&reg;, Wolfenstein&trade; and RAGE&trade;.For more information on Bethesda Softworks&rsquo; products, visit www.bethsoft.com.Fallout and Fallout: New Vegas are trademarks or registered trademarks of Bethesda Softworks LLC in the U.S. and/or other countries. All Rights Reserved.", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/51U4qg95yIL._SY300_.jpg", "related": {"also_bought": ["B0065NP6NC", "B005FDUSTA", "076156327X", "B005C2D2MO", "B009WI7V9E", "B00CJ7IUGS", "B0050SYV70", "B003O6EB70", "B005N4HBE6", "B0028IBTL6", "B004HYK956", "B000MKA60W", "B0050SYBL6", "B00BMFIXT2", "B00EVWZHLK", "B0050SYK44", "B000OLXX86", "B000TG72PG", "B002I0JA7E", "B00309U0M6", "B00F4GSAYI", "B0022TNO7S", "B00HV0MNKW", "B0050SY77E", "B004NRN5DU", "B002Q21X7Y", "B0050SWVIQ", "B009KG96GO", "B0050SYX8W", "B007V2LMAM", "B0050SYILE", "B0016BTNTQ", "B0041OWQUI", "B007SRM5MO", "B0010AYJXI", "B003C1I0CO", "B0050SYLRK", "B001SH7YMG", "B0050SY9WC", "B000R0PLK2", "B00354NAYG", "B0044SA70M", "B00BRQN2EM", "B00319DX4W", "B008E6ZXRM", "B002BRZ8FW", "B0047TG2R0", "B0050SY4DG", "B005EZ5GNW", "B0076ZPYPI", "B002BSA1MQ", "B002DC8GKE", "B000P46NMK", "B004ML7WOK", "B001V9PTVE", "B0016BVYA2", "B003GSZ9ZE", "B004FSE52C", "B00DJ42EC6", "B000F3AADE", "B008LW4SBQ", "B001D7T2VM", "B001A4MTGS", "B000ZKDOV2", "B0045EI7I4", "B00ERDGMT4", "B00CPKUV7K", "B000BI3QK2", "B0013RATNM", "0307469948", "B004JSDQPU", "B00DBCAT3W", "B002I0H2AG", "B0085CA8NY", "B00ICWO1XA", "B002I0J9M0", "B0056WJA30", "B001CMIUYS", "B000FRU1UM", "B00D7NQP9M", "B0086V5V9A", "B00320JDWG", "B005VBVQAG", "B002I098JE", "B0037LTTRO", "B002I0H79C", "B0015HZLVA", "B007UM59AC", "B008XMSRKC", "B001REZLXE", "B00C71034I", "B003VWGBC0", "B0016NRS28", "B001D25M1Q", "B005YR1VP2", "B0017ZDGWG", "B00EVWYF0E", "B0016NRS8M", "B004P6IVPQ", "B000B6ML1Y"], "bought_together": ["B0065NP6NC", "B00BMFIXT2"], "buy_after_viewing": ["B0065NP6NC", "B00BMFIXT2", "B005C2D2MO", "B004HYK956"]}, "salesRank": {"Video Games": 237}, "categories": [["Video Games", "Xbox 360", "Games"]]}