{"asin": "B0034XGLLM", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Nikon's compact, fast, and stylish Coolpix S6000 combines 14.2 effective megapixels with an incredible 7x optical Zoom-Nikkor ED glass lens for stunning prints as large as 20x30 inches. Take amazing movies with HD (720p) quality and an incredible, bright 2.7-inch LCD makes it easy to compose and share pictures and movies. The Coolpix S6000, with Nikon's EXPEED image processing concept and 4-way VR Image Stabilization System, takes incredible pictures, incredibly easy. The Coolpix S6000 has Nikon's New Smart Portrait System which; automatically detects your subjects face, takes a picture when they smile, can soften the skin tone, and warns you if they blinked.Quick response, a powerful 7x zoom and a sleek design for flexible picture-taking and beautiful photosThe stylishly compact Coolpix S6000 blends an ultra fast start-up time, the powerful reach of a 7x zoom, and a variety of automated shooting functions that maximizes the image quality and performance benefits of Nikon's innovative EXPEED digital image-processing concept. The Coolpix S6000's sleek design ensures photographers to capture beautiful photos in stylish elegance.The Coolpix S6000 packs a 14.2 megapixel image sensor and a precision 7x zoom, Nikkor ED glass lens into the thinnest body in its class.*With 28mm wide-angle coverage and macro shooting from as close as 3 cm (1.2 in.), this new lens enhances the creative possibilities of the Coolpix S6000.The Coolpix S6000 delivers high-speed auto focus performance and an ultra-fast start-up time within approx. 0.75 seconds that enables users to preserve those once-in-a-lifetime expressions.* Among compact cameras equipped with an optical 7x zoom lens with wide-angle capability measuring 30mm (35mm format equivalent) or less as of December 29, 2009 (according to research conducted by Nikon Corporation).Nikon Coolpix S6000 Feature HighlightsEXPEED digital imaging technologyNikon's smarter approach to digital imaging technology. From image capture to processing, Nikon's comprehensive EXPEED digital imaging concept encompasses the entire picture-taking operation. EXPEED is much more than a processing engine; it is a revolution in digital photography.High-Definition movie recordingEntertain audiences with movies that capture the impact of the scene with HD. The Coolpix S8000 can shoot up to 1.5 hours*of HD movies (720p) with sound at 30fps. HDMI output is also available for easy in camera playback on your TV or computer.*Recording stops automatically after 29 minutes. This figure is based on in-house testing standards and stated for recording at 25&deg;C with a fully charged EN-EL12 battery. Actual results may vary greatly depending on factors that include differences in ambient temperature, and the amount of zoom and autofocus operations used.Four advanced image stabilization features ensure sharper resultsVR image stabilization in actionCompensating for the effects of camera shake to realize sharper results and contribute to a more reassuring shooting experience, lens shift VR stabilization frees you to enjoy capturing special moments without worrying about slight hand movements. High ISO 1600 capability at any image size up to its maximum of 4320 x 3240 pixels allows faster shutter speeds when shooting in low light or capturing fast-moving subjects. Motion Detection automatically controls shutter speed and the ISO setting to compensate for subject movement as well as camera shake. Advanced flash control enables natural and beautiful flash photos even when subjects are backlit or when shooting telephoto by enhancing ISO sensitivity, rather than opting for slower shutter speeds. With advanced flash control, users can shoot with more flexibility in the night and when subjects are far away.2.7-inch, 230k-dot TFT LCD featuring Nikon's Clear Color DisplayThe high quality 2.7-inch Clear Color Display for the Coolpix S6000 features an ultra wide-viewing angle, anti-reflection coating, and screen brightness adjustment. The monitor's structure greatly reduces reflection and improves visibility outdoors for a more vivid, clearer image preview and playback.Nikon's Smart Portrait System with Skin SofteningAs part of Nikon's Smart Portrait System, a series of advanced functions help produce consistently great portraits. The Skin Softening function ensures smooth skin tone on the face of subjects by leveraging built-in face-detection technology. Automatically detecting as many as 12 faces in the shot, Face-priority AF helps produce satisfying portraits by adjusting focus and exposure. Smile Timer helps to faithfully record precious moments by automatically releasing the shutter when the subject smiles. Blink Warning alerts the photographer when it suspects that a subject has blinked, while the Blink Proof function shoots five sequential frames, then saves the one in which the subject's eyes are wide open. In-Camera Red-Eye Fix Red-Eye Fix automatically corrects perceived red-eye effect before saving the image to memory.Subject TrackingSubject tracking automatically detects a human face and then continues to track and focus on that subject. Particularly useful when capturing children as they move naturally, Subject Tracking even functions if the subject moves out of the frame and returns within three secondsNikon Coolpix S6000 Other FeaturesMacro shooting from as close as 3 cm (1.2 in.)16 scene modes for optimized shooting in various settingsScene Auto SelectorD-LightingQuick RetouchAuto Sort functionApprox. 32 MB of internal memoryUSB charging via Charging AC Adapter EH-68P/EH-68P (AR) or PCHDMI connectivityWhat's in the BoxEN-EL12 Rechargeable Li-ion BatteryEH-68P AC Adapter/ChargerUC-E6 USB CableEG-CP14 Audio Video CableAN-CP19 StrapCoolpix Software Suite CD-ROM", "title": "Nikon Coolpix S6000 14 MP Digital Camera with 7x Optical Vibration Reduction (VR) Zoom and 2.7-Inch LCD (Black)", "price": 249.99, "salesRank": {"Camera &amp; Photo": 10695}, "imUrl": "http://ecx.images-amazon.com/images/I/41Kr-RtVhEL._SX300_.jpg", "related": {"also_viewed": ["B0073HSI3E", "B001DO15J2", "B00AY6Y2YK", "B00427ZLRO", "B004M8SVEI", "B0073HSHVM", "B00HQ4W6W8", "B005IGVXJS", "B005IGVXO8", "B0073HSHZI", "B00AY6Y1NC", "B00HQ4W7D6", "B00HQ4W76I", "B00EZAYD4A", "B0073HSHJY", "B0073HSI6Q", "B000V1VG5G", "B00AR5FJNQ", "B00AY6Y2JU", "B00BUQ4D3S", "B00B7N9BRW", "B00BOZCSQE", "B00IA9LVOC", "B00HQ4W58I", "B0034XIMG4", "B00IA9LOZS", "B004M8SVF2", "B001QFZNPA", "B00ECGX9NS", "B00B7N9B1S", "B00B7O1CY6", "B001DO2XWA", "B005IGVXSO", "B005IGVXRU", "B0034XIM82", "B0041RSPRS", "B00AY6Y35I", "B004M8SVBG", "B002LITT56", "B00AQDG9BA", "B0075SUHQC", "B00B7O2ZTW", "B006K552CU", "B00HQ4W61E", "B008V0H284", "B00427ZLS8", "B00BOZCUG2", "B00ATM1MHO", "B00HQ4W5HO", "B006UMM1UO", "B00B5HE32I"], "buy_after_viewing": ["B007MB0WRG", "B004VRQNS6", "B005HX14LE", "B0073HSI3E"]}}