{"asin": "B000GA73O0", "description": "Call of Duty 3delivers the intensity of being closer than ever to the fury of combat during the Normandy Breakout, the historic campaign that made the liberation of Paris possible and brought the Allies a step closer to Berlin. With advanced high-definition graphics, detailed character animations, and explosive on-screen action,Call of Duty 3delivers the most immersive and cinematically intense war experience to date.Immersive, pulse-pounding action in the heart of Normandy. Can you handle the fog of war?Vehicles add a new dimension.View larger.Expansive and varied terrain.View larger.Team-based multiplayer combat.View larger.Game StorylineThrough a seamless narrative that delivers the rush of unrelenting battle and breathtaking action, players assume the roles of four ordinary Allied soldiers; American, British, Canadian and Polish, and are thrust onto an authentic, living battlefield for an unprecedented variety of combat situations, as the campaign to liberate Paris ensues.GameplayAn all-new close-quarters battle mode allows players to fight hand-to-hand, improvise explosive devices, disarm traps, and execute a host of other battlefield situations that require cunning and rapid reflexes to survive. Meanwhile, the next-generation game design allows for multiple attack routes that let players decide how to confront the enemy.Each unique mission path requires special tactics, from sniping and demolition, to all-out head-on clashes, providing for a truly organic game that is never the same twice. There's also a new multiplayer mode that allows for combined arms and team-based combat.Gameplay is further enhanced by the incredible graphics power of the PlayStation 3. You'll experience photo-realistic graphics and fast, smooth action that makes the experience of battle all the more immersive.MultiplayerThe multiplayer mode provides unprecedented depth and variety by allowing up to 16 players to battle it out online with the option of single or split-screen Internet play. Gamers have the choice to play as infantry or commandeer multiple-occupancy vehicles, including tanks, jeeps, and motorcycles with side-cars, leading to unique mobile combat roles for all-out, multiplayer mayhem.Call of Duty 3also offers soldier classes, each with class specific abilities, and a ranking system for truly diversified squad combat, and hours of multiplayer, and single player fun.", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/61iAg9FmzNL._SY300_.jpg", "related": {"also_bought": ["B001AWBYNE", "B000PS4X9G", "B0016B28WU", "B00269QLH4", "B000N4MSAS", "B000M4KJ32", "B000TG72TM", "B002ZJNWWC", "B000WS97QI", "B00503E9FY", "B003JVCA9Q", "B007E5Y8UC", "B008E6ZXMM", "B004L5SJ58", "B00AJGVIBA", "B0050SWZHS", "B00G9DFMDW", "B005GM3XVA", "B000YYR3D4", "B003VWGBBG", "B00109KMQ2", "B00320JAWY", "B002DC8GKO", "B002I0J82G", "B005EZ5GW8", "B002ELCV00", "B004EDJOYC", "B00C3MKA30", "B008B3AVPC", "B00519C7JC", "B0008GJRRS", "B001CRM3YQ", "B001NY42J2", "B001C4DKG4", "B001AWDFUY", "B000HGOHWO", "B007XVTR5S", "B003O6CBIG", "B0009S4UOA", "B0001I9YGC", "B008F20ED8", "B0050SXGU8", "B000JLIXIG", "B0037LVW9M", "B001ASJIRC", "B00149ILDO", "B003VKLA6O", "B00JQHU9RC", "B000P46NMA", "B0057PERIY", "B00G6MW4SM", "B00CWYYLH0", "B000PS4XB4", "B0050SXOD2", "B001QXNBNI", "B00D2EGWDA", "B000FQBF1M", "B002BRZ6UE", "B003VJRIQG", "B00269DX5W", "B000UW21A0", "B005FYK2HW", "B004HCYVO8", "B00EFFVZP0", "B003MUNFW0", "B0020KZZHG", "B003VKLAAU", "B008PQU3E4", "B007V9NHMQ", "B0015AARJI", "B002I0K6DG", "B0022TNO7I", "B004PFN52G", "B0012FHWX0", "B006Y76HXM", "B000WJFZEA", "B003L8DXOI", "B0042GW7BI", "B000087L4E", "B003O6E67A", "B005EVFQH2", "B003H0CBYS", "B001D7T2VC", "B001UWGCW2", "B001E8VB6O", "0744009499", "B0050SXFKE", "B001RTCOWA", "B0029ZMIGS", "B000X2SGRY", "B005DKMCCG", "B002AS9SE4", "B0050SXLQC", "B00A83050O", "B000XJNTQ0", "B00BMFIXKQ", "B003O6E6EI", "B000HCJD68", "B002I0JBL4", "B000V7KLKQ"], "bought_together": ["B001AWBYNE", "B0016B28WU"], "buy_after_viewing": ["B001AWBYNE", "B000PS4X9G", "B003O6CBIG", "B00503E9FY"]}, "salesRank": {"Video Games": 2544}, "categories": [["Video Games", "PlayStation 3", "Games"]]}