{"asin": "B0012N746W", "description": "Tomb Raider: Underworld for PlayStation 3 by Eidos resumes where Tomb Raider: Legend left off. This installment introduces a new, interactive playing environment that gives players a chance to immerse themselves more fully into the game. Players once again take the role of Lara Croft as she explores such wide-ranging places as the Arctic, Mexico, and beneath the Mediterranean Sea..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Lara's environment is now much more realistic and interactive.View larger.And now she can hold onto a ledge with one hand and fire a gun with the other.View larger.Interactive Worlds Introduces Realistic gameplayUnlike the previous games in the series, Lara's environment is now much more realistic and interactive. Footprints will be left in mud, for example, but only until it rains and then they will wash away. Lara's shirt will also get wet, and she's more likely to lose her grip if she is standing on a slippery, rain-soaked ledge. When the sun comes out, her shirt will dry and the slippery surfaces regain their friction.In Underworld, Lara also has a lot more flexibility in how she makes her way through a level, as there is often more than one way to get from here to there. She can now climb walls with texture and rocky outcroppings to reach areas she previously wouldn't have been able to access.All of these additions have been made to give the game a non-linear, open feel. Players can interactive with the environment by doing things they find to be intuitive, and the game will respond in an appropriate way. When Lara interacts with trees, for example, she will push aside leaves using either one or two hands depending on whether or not she's holding something. These details give a lifelike, immersive sensation to the game.New Melee Combat SystemUnderworld introduces a new melee combat system that requires players to strategically strike with offensive, defensive, and evasive maneuvers. Lara can now attack enemies with different punches, kicks, knees, and other acrobatic onslaughts. Items lying on the ground, such as poles that were previously walked on, can be picked up and swung at enemies. Players can also perform a greater variety of actions with weapons; for example, Lara can now hold onto a ledge with one hand and fire a gun with the other.Realistic Enemy and Animal AIThe AI in Tomb Raider: Underworld has also taken a big step forward--both enemies and animals now make independent decisions based on their surroundings, employ ambush and squad tactics when fighting, and will retreat if deemed necessary.With updated graphics and a more immersive and realistic gameplay, Tomb Raider: Underworld will have both fans and newcomers excited about the newest installment in this popular video game-pinup franchise.Tomb Raider: Underworld is loaded with a new melee combat system, various weapons, and smarter AI for both enemies and animals.", "price": 14.49, "imUrl": "http://ecx.images-amazon.com/images/I/51APQpHsqgL._SY300_.jpg", "related": {"also_bought": ["B0030GBU2I", "B0009VRSJ6", "B004FS8LYK", "B004UDB9SA", "B000N0WBL8", "B002I0J5JW", "B0012N94WO", "B00006BMQB", "B001ASJIS6", "B00001ZT9E", "0761560777", "B002I0JBL4", "B001AWDFUY", "B000QAVV6G", "B0050SXLQC", "B00004U1R6", "B00B59L9T6", "B003P9FRGA", "B002ZJNWWC", "B0012N5MIO", "B0022TNO7I", "B0023CBZ70", "B004EQCCI4", "B002EZH804", "B001QXNBNI", "B002I0H2G0", "B00000DMB4", "B001JKTC9A", "B0017ZIIK6", "B003H0CBYS", "B000HKP88C", "B000JLIXIG", "B00163LW7K", "B000R39GPA", "B00269DX5W", "B000P46NMA", "B00503E9FY", "B000FII8KQ", "B003DLQTYY", "B002I0F5M8", "B000006RGR", "B000K9OR4Q", "B004J6I0YO", "B003O6HDHA", "B000UW21A0", "B001NX6GBK", "B001AZFSEW", "B003GT8IL0", "B001NIP3EG", "B000GPXSCQ", "B000FQ2D5E", "B002BSA1C6", "B0037LVW9M", "B004LM37FI", "B001E8VB6O", "B003O6ECOM", "B002I0K5NC", "B003O6E1JS", "B005DVAB0A", "B003R7H5TC", "B005YR308S", "B0036FDHT2", "B0021TVYCG", "B0014UGK8G", "B003O6E6EI", "B002DC8GKO", "B002I0J5YW", "B003VKLAAU", "B000KLNLUK", "B0050SXOD2", "B002BRZ6UE", "B002I0F5I2", "B006ZTHFPS", "B00149MEVY", "B002BRZ744", "B0050SXYIC", "B003O6E67A", "B000XJK40O", "B000QU1BEI", "B008XMSR6G", "B004BCZLQ6", "B007SRM5U6", "B000ZK9QCS", "B0087Y3DSW", "B001ASJIRC", "B00354NANC", "B000ZK7ZOE", "B00319DX4M", "B003O6E3QY", "B003L8DXOI", "B001TOMQOY", "B003Q55YCU", "B002ELCV00", "B001SGZL2W", "B002I0K6DG", "B002NN7AKU", "B00005ME6N", "B000FPOJOS", "B00BG6ZHK0", "B0055202HE"], "bought_together": ["B004FS8LYK"], "buy_after_viewing": ["B002I0J5JW", "B004FS8LYK", "B00BMFIXKQ", "B004Y376S8"]}, "salesRank": {"Video Games": 5183}, "categories": [["Video Games", "PC", "Games"], ["Video Games", "PlayStation 3"]]}