{"asin": "B0009RML8S", "description": "Amazon.com Product Description.caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The NETGEAR SC101 Storage Central offers:An easy and inexpensive way to share hard drive space over a network.Great expandability with room for two hard drives.A 10/100 Mbps Ethernet port for fast data transfers.Options for drive mirroring and spanning.Included backup software.The NETGEAR SC101 Storage Central is an expandable storage system that allows shared access by all computers on your network. With space for two IDE hard drives, you can set the device up to mirror each other so you have a backup of all your files in case either one fails.There is room for two hard drives inside the SC101.View larger.Excellent Value and Easy SetupUnlike other network-attached storage (NAS) devices, the SC101 does not come with any drives but requires you to purchase your own. This allows for considerable cost savings. Opening up the SC101 only requires turning a latch that can be done with a quarter; no tools are needed. Attach the power connectors and IDE cables, set the jumpers, and slide the drive into place, and that's it.After the hard drives are installed, plug the device in, attach it to the network, and install the included software. The software guides you through setup step by step. When everything is ready to go, it looks like a new hard drive has been installed on your PC and you use it just as you would any other hard drive. Backup software is included for users who don't already have their own preferred software. Please note that the SC101 is only compatible with Windows machines and won't work with Macs or Linux.Outstanding Performance with Various Storage OptionsThe SC101 connects to your network via a 10/100 Mbps Ethernet connection for fast data transfers. When you connect two drives to the device, you have the option of having them \"mirrored\" or \"spanned.\" Mirrored storage lets you keep two copies of every file, one on each drive, so that everything is backed up in case of drive failure. When two drives are set to span, they appear as one volume so they are easy to work with and the device will automatically find your data across both drives.The front panel has three LEDs to let you know the status of the power, hard disk and network at a glance. The NETGEAR SC101 Storage Central is backed by a 1-year warranty.What's in the BoxSC101 Storage Central, resource CD, power adapter, Ethernet cable, installation guide, SmartSync Pro Backup Software CD, and warranty/support information card.", "title": "NETGEAR SC101 Storage Central", "price": 84.92, "imUrl": "http://ecx.images-amazon.com/images/I/41TF33RNE2L._SX300_.jpg", "related": {"also_viewed": ["B00DW1UNS8", "B004UBU3SY", "B001L1I7C0", "B005TJLU24", "B004JHXWDC", "B00CO0DE0W", "B001OC5J9U", "B001M5V0YC", "B0040NPGP2", "B005IULTI4", "B00DIO9M1S", "B000JOZAQG", "B001W6Q6FY", "B0001FSCZO", "B008DWAGPG", "B00JKM0A36", "B002WRIBN2", "B002UUPWP6", "B00597E938", "B005GM1Q1O", "B000HKM24K", "B00BXAVDLQ", "B00B5Q79EI", "B003X26VV4", "B0047T7PTO", "B005XDGJB8", "B00BNI4A90", "B0089V4WOC", "B0093NUFVE", "B003IT6YFU", "B001S08YT0", "B004AA0QO6", "B005EJLFNI", "B0037NYKW6", "B00439GMJ2", "B002UAPHS8", "B00HX7HS5I", "B000ED12IM", "B0063E3ZPO", "B007JLDTRY", "B00CO0DH6S", "B00G9X5N18", "B00BNI4AWM", "B0007IG23Y", "B0036SDJ3I", "B00A694ZRE", "B00CRB9CK4", "B00B5Q7B78", "B00ARB5FPM", "B00DIO9N8A", "B00BMQ3LKM"], "buy_after_viewing": ["B00DW1UNS8", "B004UBU3SY", "B0093NUFVE", "B00439GMJ2"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "Network Attached Storage"]]}