{"asin": "B000LRMR26", "categories": [["Electronics", "Computers & Accessories", "Computer Components", "CPU Processors"]], "description": "Amazon.com Product Description  Four computing cores in a single processor give multitasking users the ultimate edge in efficiency and performance&mdash;no matter what software application they are running. With a quad-core processor, multimedia experiences are faster and more responsive as video transfers, image rendering, data compression, and intense gaming applications are streamlined to process seamlessly with remarkable speed. As a result, demanding users can accomplish more in less time.Amazon.com Product DescriptionFour computing cores in a single processor give multitasking users the ultimate edge in efficiency and performance&mdash;no matter what software application they are running. With a quad-core processor, multimedia experiences are faster and more responsive as video transfers, image rendering, data compression, and intense gaming applications are streamlined to process seamlessly with remarkable speed. As a result, demanding users can accomplish more in less time.Intel&reg; Core&trade;2 Quad-Core Processor Product HighlightBy including up to 8MB of shared L2 cache and Front Side Bus speeds of up to 1066 MHz, the Intel&reg; Core&trade;2 Quad processor pushes the technological innovation envelope farther than ever before. For demanding users, this means the latest and most advanced software applications will open and work faster with excellent responsiveness. When used with the latest multimedia software and next-generation games, dropped frames, long waiting times and stuttering performance are history.Intel TechnologyIntel&reg; Wide Dynamic Execution.Enables the delivery of more instructions per clock cycle for shorter execution times and improved energy efficiency&mdash;accomplish more simultaneously and with greater efficiency.Intel&reg; Intelligent Power Capability.Turning off portions of the processor when they aren't being used improves overall energy efficiency and reduces heat production, resulting in a quieter, more energy efficient system.Intel&reg; Smart Memory Access.Increasing available data bandwidth means more multitasking with less slowdown&mdash;run more demanding applications simultaneously and accomplish more in less time.Intel&reg; Advanced Smart Cache.Placing data closer to the processing cores improves platform responsiveness and performance with a wide range of applications.Intel&reg; Advanced Digital Media Boost.Accelerates performance with a broad range of applications including video, speech and image, photo processing, encryption, financial, engineering and scientific applications.MultimediaWith professional-grade photo, music and HD video editing software readily available for consumers, it's becoming increasingly popular to create, edit, and share entertainment with friends and family. Unfortunately, these same applications are notoriously performance hungry. Built to handle the most demanding software, the four cores of this Intel processor help ensure that when you're working with high-resolution photos, exporting your next audio mashup, or editing HD-quality home movies, your computing platform will be able to keep pace with your creative muse.MultitaskingA computing platform featuring the Intel Core 2 Quad processor maximizes processing efficiency, allowing users to juggle multiple projects in multiple applications without experiencing the slowdown typically seen with traditional single-core processors. As a result, work and creative projects will get done sooner.GamingNext-generation gaming is more than just pretty environments and smooth motion. Behind the incredible visual realism of waterfalls or the unlucky ricochet of a bullet are intense, high-speed calculations of asset streaming, terrain generation, 3D rendering, and physics effects. When running select next-generation games, each of the cores in the Intel Core 2 Quad processor can be dedicated to individual processes, resulting in smoother, more lifelike graphics and further blurring the line between virtual and reality.", "title": "Intel Core 2 Quad Q6600 Quad-Core Processor, 2.40 GHz, 8M L2 Cache, LGA 775", "price": 7.92, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/51CJ6OTtJtL._SY300_.jpg", "related": {"also_bought": ["B000VSHT3C", "B000OGX5AM", "B001CCGYU0", "B001ISJ964", "B004LT6O56", "B00IOS6EAU", "B003BFNYK4", "B005OJRGYA", "B0028Y4S9K", "B0026P7226", "B0036WTB18", "B00180DQP2", "B0011A4UZE", "B000YAVGL8", "B002654FQM", "B0027P9C9G", "B004MU8VCS", "B000IEO964", "B000EWJYYW", "B001FVI91U", "B0002EQU6C", "B000GGQCIC", "B004LT8MN8", "B0009PTBZ6", "B004WJRBUW", "B0088PUEPK", "B000GS2QX0", "B0012M32N2", "B002YIG9AQ", "B00A3VOA3O", "B004Z9XG0I", "B005QT7ZBC", "B004Z5GRW6", "B000OCUS7Y", "B00AZ9T3OU", "B000TGK05A", "B002D2H9W0", "B000Z70DVO", "B006O2AVFW", "B002CIDIPW", "B000Q85WOK", "B0089KJRLG", "B005CT56R6", "B004X6ABTM", "B0019NKGR4", "B007Z3T5JC", "B000I3P07C", "B001QSD5GQ", "B000R99ESI", "B000CDLCGG", "B002G392ZI", "B00115U2TW", "B000SOVVUQ", "B0042IEVD8", "B00606OHQQ", "B000SSUHO8", "B0092ML1SC", "B008AJKIN2", "B00D3F7CFK", "B0030DL37I", "B007ZW2LY4", "B0033Z2BAQ", "B005B0A6ZS", "B000MJ31TG", "B00BQ8RM1A", "B005O65JXI", "B005T3GRNW", "B00E3W15P0", "B0026ZPFCK", "B0049MPQA4"], "buy_after_viewing": ["B000OGX5AM", "B00180DQP2", "B000TGK05A", "B0019NKGR4"]}}