{"asin": "B002673XJA", "description": "InStar Trek Online, the Star Trek universe appears for the first time on a truly massive scale. In this massively multiplayer online game from Cryptic Studios, players can pioneer their own destiny as Captain of a Federation starship. Or, they can become a Klingon Warlord and expand the Empire to the far reaches of the galaxy. Players will have the opportunity to visit iconic locations from the popular Star Trek fiction, reach out to unexplored star systems, and make contact with new alien species..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Take command as a Federation Captain or Klingon warlord.View larger.Customizable yet classic Star Trek ship classes.View larger.More than 6 races to choose from.View larger.Ground and space combat.View larger.With episode missions, every moment spent playingStar Trek Onlinewill feel like a new Star Trek episode in which you are the star. Immerse yourself in the future of the Trek universe as it moves into the 25th century: a time of shifting alliances and new discoveries.Adventure in the Final FrontierExplore strange new worlds and seek out new life and new civilizations in a vast, expanding universe. Establish contact with new races, discover resources and uncover mysteries that will influence Star Trek's future. In 2409,Star Trek Onlineexists in a timeframe beyond even the latest movies, so everything you experience will be brand new, but still based on all the fiction you love.You Are the CaptainStar Trek Onlineis the first AAA MMO to feature space and ground combat at launch. Missions will take you and your friends into the depths of space, across exotic planets, and even inside starships. As the Captain of your very own ship, it's up to you to lead your crew on missions that span a number of locations. You call the shots, no matter where you are. When you're in space, you direct the action - be it in the middle of a high-tension battle, where you can maneuver in 3-D space and fire a vast array of weaponry at your enemies, or as you enter warp to explore parts of the galaxy never before documented. On the ground, you lead your away team across exciting terrain, interacting with allies and battling enemies. Every Captain commands five subordinates on the ground, all of which can be directed to act in any manner you choose. Can you lead them safely through dangerous locales?Total CustomizationUsing Cryptic&rsquo;s Total Customization technology, every ship you command can be customized by you, from its color to its construction. Your ship will retain a Star Trek \"feel,\" but it will also represent your style. What&rsquo;s more, anyone can create their own species inStar Trek Online, meaning you can tell your own story about how you came to be in the galaxy and leave your mark on the Star Trek universe.Built by Veterans with You in MindStar Trek Onlineis developed by Cryptic Studios, creators of the massively successfulCity of HeroesandCity of Villains. It&rsquo;s built on the Cryptic Engine, a core technology that means Cryptic game designers can focus less on a game&rsquo;s nuts and bolts and more on creating a game that captures Star Trek&rsquo;s essence, guaranteeing that both longtime fans of Star Trek and people new to the universe will feel at home.System Requirements:Minimum Specifications:Recommended Specifications:OS:Windows XP SP2 / Windows Vista / Windows 7 (32 or 64-bit)Processor:Intel Core 2 Duo 1.8 Ghz or AMD Athlon X2 3800+Intel E8400 Core 2 Duo or AMD Athlon X2 5600+RAM:1GB2GBDisc Drive:6X DVD-ROM driveHard Drive:8GB or moreVideo Card:NVIDIA GeForce 7950 / ATI Radeon X1800 / Intel HD GraphicsNVIDIA GeForce 8800 / ATI Radeon HD 3850+Sound Card:DirectX 9.0c Compatible SoundcardInput Device:Mouse and keyboardNetwork:Internet broadband connection required for online play", "price": 25.28, "imUrl": "http://ecx.images-amazon.com/images/I/51Xy%2BrmotkL._SY300_.jpg", "related": {"also_bought": ["B002X92W8E", "B001CWXAP2", "B003XX9KMA", "B000035Y9O", "B001TOQ8X4", "B0039ZKI5U"], "bought_together": ["B002X92W8E"], "buy_after_viewing": ["B002X92W8E", "B007ZQJN1Y", "B00005RVN8", "B001CWXAP2"]}, "salesRank": {"Video Games": 15282}, "categories": [["Video Games", "PC", "Games"]]}