{"asin": "B0014WJ78E", "description": "As DVD playback made the PlayStation 2 more than just a game machine, hefty multi-media features make the Sony PlayStation 3 an even more versatile home entertainment machine. Features such as video chat, Internet access, digital photo viewing, and digital audio and video will likely make it the central component of your media set-up. Still, it is first and foremost a game console--a powerful one at that. Now you can own this powerful console and start playingMetal Gear Solid 4: Guns of the Patriots, right out of the box!Under the Hood of the PS3The PS3 features IBM's \"Cell\" processor and a co-developed Nvidia graphics processor that makes the system able to perform two trillion calculations per second. That's approximately 320 times more calculations per second than the PS2. Along with the traditional AV and composite connections, it also boasts an HDMI port, which delivers uncompressed, unconverted digital picture and sound to compatible high-definition TV and projectors. The system is capable of 128-bit pixel precision and 1080p resolution for a full HD experience.Bundled Playstation 3 Includes80GB Hard DriveVoucher for a free download of thePainminigame from the PlayStation StoreMetal Gear Solid 4: Guns of the Patriotsgame includedDualshock 3 Rumble Wireless ControllerStill the best man for the jobView ImageContinued Engrossing StorylineView ImagePlaystation 3 FeaturesBlu-Ray is the New WaySony's PlayStation 3 games are encoded onto the Blu-Ray disc media format, which can hold six times as much data as traditional DVDs. This increase in capacity--combined with the awesome power of its processor and graphics card--promises mind-blowing games once developers have learned how to fully harness the new console's power. The PS3 supports CD-ROM, CD-RW, DVD, DVD-ROM, DVD-R, DVD+R formats. In addition, PlayStation 3 system software update version 2.20 and up includesBD Live support. With this you can now play discs that support Blu-ray Disc Profile 2.0 (BD-LIVE) and you can also connect to the Internet while playing discs that support this format so that you can obtain additional features. Features that are available vary depending on the software in use.The Dualshock 3 Rumble Wireless ControllerThe Dualshock 3 Rumble wireless controller for the PlayStation 3 system provides the most intuitive game play experience with pressure sensors in each action button and the inclusion of the highly sensitive SIXAXIS motion sensing technology. Each hit, crash and explosion is more realistic when the user feels the rumble right in the palm of their hand. It can even detect natural movements for real-time and high precision interactive play, acting as a natural extension of the user&rsquo;s body. Dualshock 3 wireless controller utilizes Bluetooth technology for wireless game play and the controller&rsquo;s USB cable to seamlessly and automatically charge the controller through the PlayStation 3 system at anytime.Plays All PlayStation GamesThe PlayStation 3 will be backward compatible with PlayStation and PlayStation 2 games, which means you'll be able to play all your favorite games without keeping all the old systems. The console will have slots for Memory Stick Duo, an SD slot and a Compact Flash memory slot. It comes with a pre-installed hard disc drive, which allows you to save games as well as download content from the Internet.Included in this bundle Metal Gear Solid 4!Metal Gear Solid 4: Guns of the Patriots, is a next-gen experience complete with top-of-the-line graphics and surround sound designed for theSony PlayStation 3. Featuring the most revealing display of Kojima Production's premier title,MSG4details the world where Snake must under go his final mission. In a world overrun by private military companies (PMCs), wars are no longer fought over nations or ideologies. Instead, the wars of the future are micro-managed by overarching PMCs, right down to the bullet. New gadgets and abilities fuel Snake's journey deep into the enemy domains of the Middle East, South America, and beyond. New gear includes \"Metal Gear Mk. II,\" the ultimate reconnaissance tool, and \"Solid Eye,\" which gives Snake real-time information on enemies and his surroundings. Joined by a familiar cast of characters, Snake must once again return to the battlefield to confront his lifelong rival, Liquid Ocelot, who is manipulating the world's wars from the one world where soldiers will always have a place. But Liquid Ocelot is not the only one who will be able to manipulate the world's wars--Snake can destabilize opposing forces by working behind the scenes, supporting the local militia as they fight PMCs, creating a smokescreen that allows Snake to move freely within the war-zone.OnlineCalling it \"an always on, always connected device,\" SCEI's chief technical officer Masa Chatani said the PS3 would be constantly in touch with a \"PlayStation World\" network \"fundamentally based on community, communication commerce, and content.\" Technically, the infrastructure is there to make that connection. The PS3 supports 10BASE-T, 100BASE-TX, 1000BASE-T Ethernet, as well as IEEE 802.11 b/g wireless networking protocols.", "price": 284.99, "imUrl": "http://ecx.images-amazon.com/images/I/519pv-kCqbL._SX300_.jpg", "related": {"also_bought": ["B0009VXAM0", "B001COU9I6", "B00GOOSTJ0", "B004XACA60", "B000FQ2D5E", "B00009WAUD", "B00005BW7Q", "B003O6E3C8", "B001C6GVI6", "B000R0PLK2", "B0015Z1I78", "B005J730WO", "B0065NP05G", "B00000JRSB", "B000FQ2DTA", "B007A7UJ4S", "B004HYK956", "B002GJRQSC", "B002I0J4AM", "B002I0J8FI", "B008CP6Q6M"], "buy_after_viewing": ["B00HD4R5YU", "B0009VXAM0", "B00CTKHXFO", "B001COU9I6"]}, "salesRank": {"Video Games": 14826}, "categories": [["Video Games", "PlayStation 3"]]}