{"asin": "B0029ZBZ0I", "description": "Experience the thrill and terror all over again withResident Evil 5, now for PC. Featuring Chris Redfield of the originalResident Eviland new partner Sheva Alomar, a West African agent of the Bioterrorism Security Assessment Alliance (BSAA), this sci-fi survival game is staged in a remote desert colony packed with hordes of fast-moving, quick-thinking enemies that represent a whole new breed of evil. It features an exciting two-player co-op mode, new costumes, an improved Mercenaries Mode with multiple times as many enemies than the console version of the game, and another first, stereoscopic 3D out of screen effects..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Co-op play with a new character.View larger.Explosive action.View larger.A new level of terror.View larger.Stereoscopic 3D graphics.View larger.Hot in-game costumes.View larger.Improved Mercenaries Mode.View larger.StoryFrom the ashes of old conflicts, a new terror arises. The Umbrella Corporation and its crop of lethal viruses have been destroyed and contained. But a new, more dangerous threat has emerged. Years after surviving the events in Raccoon City, Chris Redfield has been fighting the scourge of bio-organic weapons all over the world. Now a member of the Bio-terrorism Security Assessment Alliance (B.S.A.A.), Chris is sent to Africa to investigate a biological agent that is transforming the populace into aggressive and disturbing creatures. Joined by another local BSSA agent, Sheva Alomar, the two must work together to solve the truth behind the disturbing turn of events.Exciting Two-Player Co-op ModeThe new cooperative gameplay element focuses on the realities of a dual-agent mission, highlighting the ways in which Redfield and Alomar must work together to survive the unexpected, while still allowing them to split up and work alone. To help you maximize the potential of this setup, two-player online and off-line co-op modes ensure that you have options when aligning yourself with a partner.Stereoscopic 3D with the PC VersionPC gamers will get the ultimateResident Evilpackage in the new PC version as new features will include NVIDIA's new GeForce 3D Vision technology (wireless 3D Vision glasses sold separately). Fans that pick up the PC version ofResident Evil 5will be the first to experience stereoscopic 3D out of screen effects as their living rooms are transformed into the world of Kijuju. Infected Majini coming at players from every angle, dust flying in and out of screen and the scariest bosses to date are taken up a notch.Resident Evil 5for PC represents a whole new level of fear that players will never forget. Stereoscopic 3D is also supported in all of the game's cut scenes - an industry first.An Unprecedented Level of FearCo-producer and series veterans Jun Takeuchi (Lost Planet) and Masachika Kawata (Resident Evil 4Wii Edition,Resident Evil: Umbrella Chronicles) unleash an unprecedented level of fear for the next generation inResident Evil 5, the sequel to one of the highest-rated video games in history according to Metacritic.com and Gamerankings.com. Promising to revolutionize the series by delivering an unbelievable level of detail, realism and control,Resident Evil 5is certain to bring new fans to the series. These incredible changes to both the gameplay and world ofResident Evilmake this a must-have game for gamers across the globe.Key FeaturesTwo Playable Characters&ndash; Chris Redfield, protagonist of the originalResident EvilandResident Evil: Code Veronica, returns and is joined by new playable character Sheva Alomar, an African BSAA agent tasked with investigating the epidemic.Two Player Online Co-op&ndash; New cooperatively-focused gameplay revolutionizes the way thatResident Evilis played. Chris and Sheva must work together to survive new challenges and fight dangerous hordes of enemies.Next Generation of Fear&ndash; Features groundbreaking graphics that utilize an advanced version of Capcom&rsquo;s proprietary game engine, MT Framework, which powered the hit titlesDevil May Cry 4,Lost PlanetandDead Rising.\"Quick-Select\" Inventory System&ndash; Improved inventory system allows items to be traded between characters. To add to the intensity, all inventory management is done in real time; items can even be assigned to the directional pad for instant access.New Control Schemes&ndash; Features new modernized third-person action game control variations as well as the return of the traditionalResident Evil 4control schemes.New Enemies Bring New Challenges&ndash; Enemies boast increased speed and intelligence, making them as dangerous alone as they are in groups.Powerful New Weapons&ndash; The number of weapon variations has been greatly increased providing new ways to keep enemies at bay.Fear Light as much as Shadow&ndash; Lighting effects provide a new level of suspense as players attempt to survive in both harsh sunlight and extreme darkness.System Requirements:Minimum Specifications:Recommended Specifications:OS:Windows XP / Vista.Processor:Intel Pentium D Processor or higher, AMD Athlon64 X2 or higher.Intel Core 2 Quad Processor or higher, AMD Phenom X4 or higher.RAM:XP: 512MB or more / Vista: 1GB RAM or more.XP: 1GB or more / Vista: 2GB RAM or more.Disc Drive:DVD9 compatible drive.Hard Drive:8.0GB or more.Monitor:800 &times; 600 or higher.1280 x 720 or higher.Video Card:256MB VRAM*3 or more, DirectX 9.0c/Shader 3.0 or higher, *1 NVIDIA GeForce 6800 series or higher, *2 ATI Radeon HD 2400 Pro or higher.512MB VRAM*3 or more, NVIDIA GeForce 9800 series or higher, ATI Radeon HD 4800 or higher recommended.Sound Card:DirectX 9.0 or higher.Input Device:Mouse and keyboardGamepad (Xbox 360 controller for Windows recommended).Other:A broadband Internet connection is required for online play.*1 Operations on board fall outside the scope of the warranty. Also, when VRAM is used in common with the main memory, it falls outside of the warranty.*2 Other than NVIDIA GeForce 7300 series.*3 Outside of warranty when used with main memory.", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/51sYTX4VjlL._SY300_.jpg", "related": {"also_bought": ["B000EPP6UA", "B00B70WKUK", "B005APTHJK", "B003GSZAOY", "B001E8QA2E", "B004H80TUC", "B00B4QY1SG", "B002BS47YE", "B002EE1PBS", "B003ICGL7I", "B0030MOXA8", "B001Q96ZNU", "B002BXKJA0", "B002I0HKRQ", "B002I0HJ68", "B005G4CXPK", "B001O4YSTU", "B003Q55Y5C", "B001AWIP0Y", "B003P9C6EQ", "B0016BVYAM", "B002ZJPYHS", "B0012LGHZI", "B000QTD07K", "B0019C4MU2", "B004D8QAAO", "B00BU3WUU4", "B0050SZ0SY", "B001VJ4DHK", "B005C2D2H4", "B0014UGK4U", "B003FSFSEW", "B003L8DXS4", "B0050SWTS8", "B004ML9WKC", "B0000524PQ", "B002V14VOC", "B002I0IHIM", "B004FYKWZU", "B002NIP2SM", "B00006I02Z", "B004PFS9TU", "B005XFGZ4W", "B001AWBYRA", "B0013RC1W4", "B0017UGFBK", "B002I0GKA4", "B001BNFQKO", "B00178631E", "B00006C2HA", "B000NV8F58", "B00KSQHX1K", "B001CC8UBG", "B002BRYXRQ", "B001AH8YSW", "B008E6ZXA4", "B00503EAG2", "B0079NGSDO", "B0012N5EQE", "B0044S8DA8", "B00002SUDC", "B002ABZE8U", "B00140P9BA", "B002I0KOSI", "B000U88T28", "B002NQ4820", "B007XVTR12", "B004FUGKSW", "0700099956", "B002I0HJZO", "B0058AD0RM", "B004QRKWLA", "B00BPANZ60", "B001UWGDPS", "B000COCAJI", "B002I0HFNU", "B00C7103JI", "B004CD9X2W", "B0050SZ2EQ", "B005THAX60", "B003JVF728", "B00ERDGMSA", "B001LKM0EW", "B0016N4A7E", "B001HBEGHO", "B003ZULWQI", "B002I0KO8I", "B007PR0IA8", "B000X9FV5M", "0700026398", "B0047THYWC", "B0045ZB66I", "B0016Q4UJE", "0744015367", "B005RY6X14", "B003EZ1KGQ", "B000MK694E", "B00CPKUV9I"], "bought_together": ["B000EPP6UA", "B00B70WKUK"], "buy_after_viewing": ["B00B70WKUK", "B000EPP6UA", "B001FSJ9N0", "B001O4YSTU"]}, "salesRank": {"Video Games": 11381}, "categories": [["Video Games", "PC", "Games"]]}