{"asin": "B0001NBNGG", "description": "The creepy tale of a possessed Japanese village (Hanuda) told through the eyes of ten playable characters in combination with some impressively innovative gameplay&nbsp;features should totally make my day&nbsp;&#8211; but playing Siren turns out to be sadly different than I was expecting.The game's two big features: sightjacking (where you see through the eyes of other characters) and the Link Navigator (which manages the plot's order of events) sadly don't add to the player's experience enough to justify their problematic existence.Sightjacking is more fun to mess around with than it is helpful to the player. Watching the paths of roaming enemies can offer useful information, but the stealth mechanic is so simplistic that the data is rarely necessary. In many situations, being seen by enemies is something that you can't avoid or recover from &#8211; they will find you, and they will kill you. This is fine by me, but when the only stealth-orientated skill that is offered is a painfully slow crawl (and a distracting yell, which had little to no effect that I could perceive), it doesn't make me want to be all that sneaky. There isn't a sound meter, no real way to know if enemies can see you or not (like a vision cone or shadow meter), and very little chance of distracting them with diversions. It is more fun and more efficient to just run through levels and see what happens than to use the sightjacking feature to suss out a plan of attack.Which leads to discussion of the game's other big feature, the Link Navigator. Siren's storytelling plan sounds like a survival horror Real World season: Pick 10 characters to escape the apocalypse and find out what happens over 3 days through 78 missions &#8211; you could call it Siren: Hanuda. The complication is that the order of events is jumbled and the Link Navigator is supposed to help you keep track. What this means, from a player's point of view, is that the game's story doesn't really get its hook into you &#8211; not even in the first few hours. The tales are too disjointed, the characters too many, and the plot too slow in getting going.The more conventional aspects of this game like sound design and graphics are also something that people will have mixed feelings about. The creatures' insane, maniacal laughs are honestly unnerving, and therefore good for this game. The graphics look to be actual pictures of the characters' faces and lend a realistic, but still skewed version of each person &#8211; they're detailed, but strangely flat. I think that this is a nice subtle touch, but others may disagree.I really, really wanted to like Siren, but in the end, I just didn't have much fun or feel like the innovative parts of the game were used to their advantage. It has good ideas, and I'm glad to see experimentation in survival horror, but this should be chalked up as a failed test in the genre.Concept:Navigate a horrific village as ten different charactersGraphics:Muddy and jerky&#xC2;&#xA0;&#8211; but it fits with the disjointed feel of the gameplaySound:The best part of this game, the sound effects are creepy and (for lack of a better word) ickyPlayability:The context-sensitive menu system is&#xC2;&#xA0;counter-intuitive and the stealth mechanics are pretty archaic and basicEntertainment:I really need a reason to care in a game this cerebral and slow-paced, and Siren doesn't give it to meReplay:ModerateRated:6.25 out of 10Editor:Lisa MasonIssue:May 20042nd Opinion:From a conceptual standpoint, Siren is chock-full of ingenuity, and is a soaring success when it comes to the delivery of unusual ideas. Forming a mental bond with your attackers so that you see the surroundings from their perspective is a great idea that leads to some unnerving situations. This gimmick only goes so far, however. I found its functionality, and the entire gameplay package for that matter, to be clunky, and above all, frustrating. I grew so disenchanted with trying to pick up enemy sight that I avoided using this technique whenever I could. I love the episodic approach to storytelling &#8211; but the execution of gameplay bothered me to no end.Rated:5.75 out of 10Editor:Andrew ReinerSubscribe to Game Informer--Game Informer Review", "price": 20.52, "imUrl": "http://ecx.images-amazon.com/images/I/416SVK5SPTL.jpg", "related": {"also_bought": ["B00005BW7M", "B00005V9NH", "B0009UC6AI", "B0000AI1KK", "B000XPJ026", "B0007WWYLY", "B0011BE3KA", "B0001Y7404", "B00001XDUB", "B00005ME6O", "B000095ZH6", "B000NIJ35W", "B00024W1TM", "B0000A8VBZ", "B00007LV7Y", "B000B69E9G", "B0000TSRA6", "B0009R1TGS", "B0002Y2XXQ", "B00005Q8M4", "B00005ML0X", "B00005ME6N", "B00008KTRS", "B000FPM3HS", "B0007L8GPI", "B00020LZAW", "B000066RKC", "B0009I6S0O", "B0007LY3ZK", "B00000K1VE", "B00005ML10", "B003O6HDHA", "B00020BV24", "B00AMA4L4E", "B0009351R0", "B0002CHJ00", "B0050SXAIG", "9629971372", "B000038ABO", "B00149MEVY", "B000TLU67W", "B0002RQ3ES", "B002CZ3SLO", "B0002CHJ64", "B00000I1BY", "B00004YRQA", "B00432O50W", "B000067DPL", "B0007OGDIC", "B00005ME8S", "B00004YRQ9", "B00024W1U6", "B003GT8IL0", "B0000C7GHG", "B00004TC6E", "B000FPGZUE", "B00004Y57G", "B002CZ7FW2", "B000066TS3", "B0000A09EM", "B000784XG2", "B00007UHPJ", "B0001ADAME", "B00005J536", "B00004ZDFY", "B00002STJN", "B0000690ZE", "B0009SQFHA", "B00069FK00", "B00004U5VK", "B00024W1T2", "B000034DMG", "B004FZ9822", "B00005MDZD", "B0009Z3K9O", "B00008DWT6", "B00000I1BS", "B000099T2E", "B008XMSR6G", "B0014CN2H6", "B002WSR8BC", "B000088KH9", "B00000JRSB", "0744003822", "B00004W4QJ", "B00009KO3L", "B00006GSNX", "B00005MA97", "B0002A6CQY", "B002AB7TX8", "B000066JRQ", "B00005NCCR", "B004L9YS22", "B000E991PC", "B00005OLX1", "B0007GDMFC", "B00000I1BK", "B00006ZCD1"], "buy_after_viewing": ["B0011BE3KA", "B0009UC6AI", "B00005BW7M", "B00005V9NH"]}, "salesRank": {"Video Games": 15003}, "categories": [["Video Games", "More Systems", "PlayStation 2", "Games"]]}