{"asin": "B0006A7X36", "description": "You're probably familiar with the alphabet of the wireless world--802.11b, g, and a--but another letter is right around the corner: n. While the 802.11n standard still has yet to be finalized, Belkin's Pre-N router gives us a taste of what's in store for the future of wireless... sort of (more on that below). The Belkin Pre-N is backwards compatible with 802.11b/g wi-fi cards and super-sizes them with some of theproposed, but not final, features of 802.11n and applied them to its Pre-N Router, which also doubles as a 4-port Ethernet router. It's touted to both extend range and greatly improving wireless throughput capacity to a maximum 108 Mbps (megabits per second) speed.However, this is all theoretical, in a sense, due to the fact that routers never achieve the maximum throughput they're rated at (802.11b at 11 Mbps and 802.11g at 54 Mbps). But how does the Belkin Pre-N even hope to double this theoretical maximum? MIMO. That's Multiple Input, Multiple Output, which is an antenna technology that adds a third antenna to the one or two that your current router already has. With this added antenna, the Belkin Pre-N is able to send more data packets at one time, thus increasing the speed of transmission.As mentioned above, Belkin is using technology and standards that have been proposed for 802.11n. But since nothing has been finalized, Belkin is ultimately guessing at what may come down the pike, and the Pre-N router is not guaranteed to work with the final 802.11n standard when it arrives in another year or so. Why, then, should you invest in pre-release technology with iffy chances of operability in the future? Because, thanks to its backward compatibility with 802.11b/g, it can be used to fill in the gaps of your wireless network today.We tested the Belkin Pre-N in our home using a PowerBook G4 with an AirPort Express (54g) card, and we were able to compare performance to a Belkin 54g wireless access point (F5D7130), which we've used at home now for over a year. Upon connecting the Ethernet cable from our DSL modem into the Pre-N, then turning on AirPort to receive a signal, we were surprised to find nothing but an error message when selecting the Pre-N.  Unfortunately, the Easy Install Wizard (found on the included CD-ROM) does not work with the Mac OS (despite being advertised to), and Mac users will have to use the \"Alternate Setup Method\" as described in the user manual--i.e., the Web-based configuration tool (which you should access initially via Ethernet cable to one of the router's ports). Setup was pretty simple, and we began to pick up the wireless signal strong and clear immediately.As we began surfing, we didn't experience wholesale speed increases in our testing, the download times (using the FireFox browser for the Mac) felt somewhat springier. Our main test of accessing the New York Times front page (with a schload of images and graphically heavy ads) took 7 seconds with the Pre-N but closer to 8 seconds with our 54g access point.The eye-opening difference came in coverage, and not just in long-distance browsing. We were duly amazed at the broad reach we got in signal, with steady, speedy downloads of QuickTime movie trailers as far as 150 feet away from the router in our neighbor's yard. When testing the control Belkin 54g access point, we couldn't even get a signal on our front stoop. But it was the blanket coverage of our home that impressed us the most. Our access point was notorious for producing inexplicable dead spots in our home (smallish at about 900 square feet), and the Belkin Pre-N covered those completely.If you have a Windows-based PC, you'll experience even faster speeds and more of an expansive reach with Belkin's MIMO-enabled Pre-Nnetwork adapterorPC card. But even if you don't pop for the extra gear, you'll still be quite satisfied with the marginal speed increase and the improved coverage area that the Pre-N provides. And it will certainly whet your appetite for the full release of 802.11n.--Agen G.N. SchmitzPros:Great coverage and broad reach for 802.11b/g-compatible PCsAdded speed and extended range if using Belkin's Pre-N network adapter and/or PC cardWorks with both Windows and Mac OS-based PCsCons:Mac users will have to set up the router manually via Web-based toolPricier than other wireless 4-port routers, due to speed advancements", "title": "Belkin F5D8230-4 Wireless 802.11x Pre-N Router", "price": 122.39, "imUrl": "http://ecx.images-amazon.com/images/I/41XBPST3ZEL._SY300_.jpg", "related": {"also_viewed": ["B004N6259G", "B008BGYJSO", "B004N625AA", "B005CUVPMK", "B004N625A0", "B00DLYD31A", "B007IL764W", "B004N625AK", "B004T9RR6I", "B001UI4RTG", "B00D9S36CE", "B007IL72CI", "B0019EQ1RW", "B008BGYJSE", "B008982LFW", "B00BHJWBEQ", "B00C4OAPBE", "B004N6259Q", "B00DWFPDNO", "B0045HG53K", "B00AAU54TW", "B0009K9FZW", "B007IL6OR2", "B008RV51EE", "B004T9RR4A", "B002HWRJY4", "B000BTL0OA", "B002WBX5ES", "B008IFXQIW", "B00BUSDVBQ", "B0045HHTGW", "B003Y5RYNY", "B002YLAUU8", "B001CN7EQ2", "B001AZP8EW", "B00HEX851C", "B0088CJT4U", "B008PV5LJQ", "B008I21EA2", "B0049YQVHE", "B0041LYY6K", "B001FWYGJS", "B00FK1E46U", "B006QB1RPY", "B004XXMUCQ", "B0098QV038", "B008ABOJKS", "B007IL7AKM", "B00E98O7GC", "B0087NZ31S", "B00EXK14S0", "B00FB45SI4", "B00AJHDZSI", "B004XC6GJ0"], "buy_after_viewing": ["B006QB1RPY", "B008ABOJKS", "B00A3YN0Z0", "B007IL7AKM"]}, "categories": [["Electronics", "Computers & Accessories", "Routers"]]}