{"asin": "B000P708NM", "related": {"also_bought": ["B0002UB2K0", "B00009V2YV", "B00176T9OY", "B0001OHH0Q", "B000P0RPNA", "B004OVE61U", "B003DMIGQC", "B003FGWF04", "B00009V2YP", "B004YWB2DE", "B002VMKU1O", "B008N2O2GK", "B00020S7XK", "B007T13LD6", "B006QF3TW4", "B0078WMSZ8", "B00D454KAO", "B004YV99DA", "B000023VW2", "1569759294", "B0013DQY4O", "B00BSYCZZ0", "B0086UBL2M", "B00FHRADQ2", "B00LVDZDXY", "B004NBZLJ2", "B00009V2QV", "B006E0QAFY", "B0010O748Q", "B0016OEV7C"], "bought_together": ["B00009V2YV", "B00176T9OY"], "buy_after_viewing": ["B00176T9OY", "B00009V2YV", "B003DMIGQC", "B003FGWF04"]}, "title": "Midland HH50 Pocket Weather Radio", "price": 14.76, "salesRank": {"Electronics": 3898}, "imUrl": "http://ecx.images-amazon.com/images/I/41f2smKLeQL._SY300_.jpg", "brand": "Midland", "categories": [["Electronics", "Portable Audio & Video", "Radios", "Weather Radios"]], "description": "The Midland HH50 Pocket Weather Alert Radio is the ultimate in straight-forward, simple access to emergency information. Skillfully constructed with the finest components, the Midland HH50 is built with all solid-state circuitry mounted on a rugged, printed circuit board to provide you with reliable and trouble-free performance for years to come.The pocket-sized Midland HH50 radio broadcasts all hazards alert weather brought to you by the National Oceanic and Atmospheric Administration (NOAA), for around-the-clock severe weather information. For added safety, this unit has an automatic alert system that turns it on in event of dangerous weather or civil emergencies, so you don't miss anything crucial. The HH50 features a weather alert test button that allows you to confirm the weather alert function on the radio is working properly at all times, even without any live broadcasts.Midland's HH50 radio is constructed to be water resistant, so it can be used in most any environment, and has a six-inch telescoping antenna that provides crystal-clear reception from virtually anywhere. This radio includes an automatic scan function so that as soon as it is turned on, it searches out and locates the strongest weather broadcasts currently available. Durable and compact, this radio runs on three AAA batteries, and is backed by a manufacturer's three-year warranty."}