{"asin": "B002EWD02C", "description": "Ashan is a world of legendary peoples. Proud Elves guard the emerald forests of Irollan... Mighty Knights rule the fiefs of the Griffin Empire... Studious Wizards survey the oasis-strewn deserts of the Silver Cities... The grim Necromancers worship in the wastelands of Heresh...and the ravenous demons are immured in Sheogh, their prison world.    During certain lunar eclipses the walls of Sheogh weaken and demons burst forth, plunging Ashan into war. And since the dawn of times, the demon legions have been repelled by the allies thanks to a powerful artifact known as the Blade of Binding.    Once again the armies of Sheogh are coming and the Blade will be wielded...     Your journey in the world of Might and Magic will be punctuated with riddles, extraordinary encounters and epic battles against creatures searching for some fresh hero blood. Your hero will travel thanks to a node system, so watch your step as some of these nodes might trigger special actions, hide terrifying traps or even legendary treasures such as forgotten artifacts or secret units.    To stand a chance against your enemies, your hero will have to equip magical artifacts and build up the most powerful army. Your army will be composed of Core, Elite and Champion units, each of them having specific sizes, strengths and abilities. It&#x2019;s up to you to choose wisely each of these units combined to the appropriate artifact and work out the best strategy to wipe out your enemies.    While roaming around Ashan or winning battles, you will discover new artifacts and gather different types of resources such as Ore, Gold and Blood Crystals. These earnings can be used to buy new Elite or Champion units for your army through specific Creature Dwelling buildings. Make sure to look everywhere as you will be able to unlock and collect powerful hidden units and artifacts!    You will be confronted with many challenges such as defeating the enemy heroes by crossing their armies in standard battles or launching into special challenges and Boss fights where your strategic skills will be put to a severe test. Finally, you can solve puzzle battles and get powerful rewards by finding the right combination and wipe-out the enemy in a limited number of turns.", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/619rEMhSazL._SX300_.jpg", "related": {"also_bought": ["B001TOMR6Q", "B002EE5RKI", "B002I0EH6I", "B002AF4XI8", "B004CVWETI", "B000GHG9VG", "B001E27DLM", "B00136MBHA", "B001CU4EJ0", "B000HE9LL8", "B0009Z3K9E", "B002L0G58I", "B000GIXIPK", "B001A01FD0", "B000SSQPU8", "B002TDIEDG", "B0012NWBH4", "B003S55EX2", "B000WMEEC6", "B002I09286", "B001H8Y7DA", "B003UI518A", "B001QTW2HS", "B003OQ4AHQ", "B003O8EDUS", "B000FW4OHS", "B005C2QSDY", "B002EE5RD0", "B001P1ZE68", "B0054J1LBO", "B009LEIUY4", "B002DC8GWW", "B001O1PAMC", "B00184219U", "B000UV2M64", "B000UZVL58", "B00139U8QI", "B00171NYHM", "B001NJMMHG", "B001NJRR7G", "B000IOM45C", "B001C4J62Q", "B000W08A0U", "B002I0GKIQ", "B000YFIRI8", "B00AKIPBNS", "B0089X37NW", "B0016CP3B2", "B00DZIX39E", "B001NJKHWI", "B003IOGPAO", "B001QTW2IC", "B002AU0HZQ", "B00GV4V8XC", "B003FBL86Q", "B000GABOTU", "B000B69E96", "B000NVKZ06", "B000H3OBFU", "B000G0O6CW", "B0050SVOXE", "B0018YDKAE", "B004L4G8UC", "B001FS8BDE", "B001BEX7PO", "B0009XEC02", "B001AF1NVY", "B001G9F9JQ", "B002I08WVY", "B001YHVA84", "B0050SVKRY", "B003O6E7DI", "B004BV5O0U", "B001V135P4", "B009B1D7JK", "B000R37S78", "B0050SVP4W", "B006O3Z2ZA", "B0019QEXZC", "B0010YOQIM", "B000QTD05W", "B003O21OWY", "B0033BJS9M", "B000GH3PYA", "B006JSY5EY", "B0053B0DI0", "B007RUY1NS", "B000E9TBRK", "B003Y73B2U", "B001QLC2YY", "B00GANWVJE", "B0033BJSDI", "B00BJH11D8", "B008BERJEM"], "bought_together": ["B001TOMR6Q", "B002I0EH6I"], "buy_after_viewing": ["B002I0EH6I", "B001TOMR6Q", "B00GV4V8XC", "B004CVWETI"]}, "salesRank": {"Video Games": 8234}, "categories": [["Video Games", "Kids & Family", "Nintendo DS", "Games"], ["Video Games", "Nintendo DS", "Games"]]}