{"asin": "B000DZMC3K", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Digital photographers will take sharper, more vivid pictures and see their results in abigway with the new 5-megapixel FinePix V10 digital camera.The FinePix V10 is the first model in Fujifilm's 2006 digital camera line-up to use Real Photo Technology. Like its 2005 predecessors with Real Photo Technology, the FinePix V10 does an outstanding job of removing graininess or \"noise\" from its digital pictures. Image noise, much like static in a television signal, reduces a picture's sharpness. The noise problem is compounded when digital pictures are shot at higher light sensitivities, which can vary depending on lighting conditions.At 3 inches, the V10's LCD is one of the largest in the ultracompact camera category.With Real Photo Technology, the FinePix V10 generates less noise than similar digital cameras and can therefore take pictures at light sensitivities as high as 1600 ISO at full resolution. Higher sensitivities open the door to a host of user benefits when combined with quicker shutter speeds. Those benefits include less shake and blur due to hand and subject movement as well as more detailed and natural-looking pictures taken in low-light environments.The V10 is a mere .9 inches wide. (Shown here from top.)With the FinePix V10 and Real Photo Technology, users can keep the lights off during the \"Happy Birthday\" song and still capture a clear picture without disrupting the mood with a camera flash. To help determine whether or not to use flash for a particular scene, the FinePix V10 has a Natural Light and With Flash function. This mode shoots two images in succession, first without and then with flash. This convenient function provides an on-the-spot comparison that helps the user decide whether the FinePix V10 will produce the highest-quality photo with flash or without.Without Real Photo Technology (above) and with (below).The features and benefits of the FinePix V10 don't end with Real Photo Technology. The most noticeable physical feature of the FinePix V10 is the camera's enormous LCD. At 3 inches, the FinePix V10's LCD is one of largest in the ultracompact camera category. It gives the user an ideal platform for framing subjects or for sharing just-taken photos. Plus, the LCD has a number of features that ensure peak viewing performance regardless of scene lighting.Glare is often a problem when LCDs are used in direct sunlight or a brightly lit room. To combat glare, the LCD of the FinePix V10 employs a special amplification layer that boosts the strength of the LCD and makes it easier to see. The FinePix V10's LCD is also very \"smart,\" as it automatically \"gains up\" or brightens in dimly lit environments. And with a stout 230,000 pixels, this reinforced LCD is not short on resolution.The high resolution of the FinePix V10's LCD comes in handy when the user selects one of the four fun video games available on the camera. A nice secondary feature for a camera whose focus is on taking great pictures, the games--Number Puzzle, Break Out, Shooting Game, and Maze--are ideal diversions for a traveler during a long layover, a passenger on an interstate road trip, or a weary driver stuck in line at the Department of Motor Vehicles.One of four games available on the V10.Spotlight features of the FinePix V10 include:Real Photo Technology featuring a five-megapixel Super CCD HR sensor working in tandem with the critically acclaimed RP Processor for sharper photos and more vivid color reproduction with less noise than in comparable camera models.A 3.4x optical zoom lens from world-renowned lens manufacturer, Fujinon, which provides broadcast-quality lenses for television and movie production. The lens on the FinePix V10 widens to f2.8, a setting that allows additional light to hit the Super CCD. This enables the FinePix V10 to shoot at faster shutter speeds, and a quicker shutter reduces camera shake due to hand movement as well as blurring caused by moving subjects.A 30-frame multi-frame playback mode for viewing groups of photos.The V10 features a 30-frame image playback mode.Six scene modes ensure precise and correct camera settings for a variety of shooting environments and conditions. These settings help the user maximize picture quality even in the most difficult picture-taking situations.What's in the BoxFuji V10 digital camera, USB cable, AV cable, hand strap, NP-40 Li-ion battery, 16 MB xD Picture Card, FinePix Viewer, ImageMixer VCD2 LE for FinePix, Raw file converter LE, and user manual.", "title": "Fujifilm Finepix V10 5.1MP Digital Camera with 3.4x Optical Zoom (Gun Metal Grey)", "price": 4.89, "salesRank": {"Camera &amp; Photo": 13765}, "imUrl": "http://ecx.images-amazon.com/images/I/51xdtORu0jL._SX300_.jpg", "related": {"buy_after_viewing": ["B007Z9R1I8", "B003VNKNEQ", "B005HNF01O"]}}