{"asin": "B005G81E9M", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "Product DescriptionWith the Kodak PlayFull Waterproof Video Camera, everyone can get  720p HD video in a small, affordable package. Pop it in a pocket or  purse so it&#x2019;s ready whenever you need it. And the PlayFull  Waterproof Video Camera can get wet or take a tumble and still come  back for more. When the fun is done, the Share button and pop-out  USB arm make it simple to e-mail videos directly to friends or  upload to your favorite sharing sites1. It&#x2019;s the everyday  HD video camera that you&#x2019;ll never go anywhere without.(Requires SD card to operate, not  included with with white model)Small, sleek profile&#x2014;big HD video&#x2022;&#xA0;&#xA0; &#xA0;Take 720p HD video just about anywhere and  everywhere&#x2022;&#xA0;&#xA0; &#xA0;About the size of a credit card&#x2014;lightweight and  durable&#x2022;&#xA0;&#xA0; &#xA0;The sleek design lets you slip it into any  pocket or purseSolid design stands up to everyday  use&#x2022;&#xA0;&#xA0;&#xA0;Waterproof*:  Up to 10 ft under water for up to 2 hours and the underwater white  balance mode gives true-to-life colors in the pool or under the  waves&#x2022;&#xA0;&#xA0;&#xA0;Dustproof**: The muddiest,  dustiest, sandiest conditions are no match for the PlayFull  Waterproof&#x2019;s rugged design.&#x2022;&#xA0;&#xA0;&#xA0;Drop-proof***: Bumps and bruises  go with the territory&#x2014;the PlayFull Waterproof can even take a fall  from 5 ft.* IEC 60529 IPX8 compliant** IEC 60529 IP6X compliant*** MIL-STD-810F, shock equivalent (onto plywood)Just press to impressThe world&#x2019;s only cameras with 3-step sharing.11.&#xA0;&#xA0; &#xA0;Just press Share when in review mode2.&#xA0;&#xA0; &#xA0;Choose your favorite sharing destination,  e-mail address, Facebook, YouTube, and more3.&#xA0;&#xA0; &#xA0;Connect your camera to your computer or insert  your memory card then your pictures and videos are automatically  uploaded to those destination(s)Kodak&#x2019;s Share button:&#x2022;&#xA0;&#xA0; &#xA0;Works with your camera&#x2019;s built-in Kodak Share  Button App software&#x2022;&#xA0;&#xA0; &#xA0;Automatically share when you connect to a PC1&#x2022;&#xA0;&#xA0; &#xA0;Tag to the largest number of social networks&#x2022;&#xA0;&#xA0; &#xA0;Shares to multiple social networks and e-mail at  the same timeVideo  Features&#x2022;&#xA0;&#xA0; &#xA0;Get sharper videos and less blur thanks to  built-in digital image stabilization&#x2022;&#xA0;&#xA0;&#xA0; Smart face tracking technology&#x2014;the camera  detects and locks onto faces, then ensures great exposure around  them&#x2022;&#xA0;&#xA0; &#xA0;Get great close-up shots with macro mode  (automatic detection or user selectable)&#x2022;&#xA0;&#xA0; &#xA0;See more details and accurate colors with  incredible lowlight performance&#x2022;&#xA0;&#xA0;&#xA0; Record up to 10 hours of HD video with  expandable SD/SDHC card slot2&#x2022;&#xA0;&#xA0; &#xA0;HDMI port with cable gives you the option to  debut your videos in full glory on your HDTV&#x2022;&#xA0;&#xA0; &#xA0;It doesn&#x2019;t matter if you own a MAC or a PC&#x2014;the  Kdoak PlayFull Waterproof Video Camera is compatible with both&#x2022;&#xA0;&#xA0; &#xA0;The optional remote control makes it easy to  comfortably enjoy your videos and picturesModes/LCD Features&#x2022;&#xA0;&#xA0; &#xA0;Black and white, sepia&#x2022;&#xA0;&#xA0; &#xA0;High saturation&#x2014;bright, bold colors&#x2022;&#xA0;&#xA0; &#xA0;70&#x2019;s film&#x2014;muted colors, slightly greenish cast,  and a little graininess for a retro look&#x2022;&#xA0;&#xA0; &#xA0;The bright 2.0 in. LCD automatically adjusts to  the lighting conditions around you&#x2022;&#xA0;&#xA0;&#xA0; LCD Glare Shield feature lets you see your  screen even in ultra-bright sunlightWhat's In the Box&#xA0;&#xA0;&#xA0; &#x2022;&#xA0;&#xA0;&#xA0; KODAK PlayFull Waterproof  Video Camera&#xA0;&#xA0;&#xA0; &#x2022;&#xA0;&#xA0;&#xA0; Wrist strap&#xA0;&#xA0;&#xA0; &#x2022;&#xA0;&#xA0;&#xA0; User Guide&#xA0;&#xA0;&#xA0; &#x2022;&#xA0;&#xA0;&#xA0; Arcsoft Media Impression  Software for Kodak and Kodak Share Button App (both on-camera, PC  only)(Requires SD card to operate, not  included with with white model)1All models of digital still and video cameras  manufactured in 2011 or later.2Record about 20 min per 1 GB at 720p HD at 30 fps.  Actual results may vary.", "title": "Kodak PlayFull Waterproof Video Camera (White)", "price": 17.12, "salesRank": {"Camera &amp; Photo": 1673}, "imUrl": "http://ecx.images-amazon.com/images/I/31a0mDOG1xL._SY300_.jpg", "related": {"also_bought": ["B000UZL0YU", "B0027E4GCU", "B004H3XNB4", "B004IRTMTQ", "B004FLL5AO", "B004FLL5AE", "B003UFU76Y", "B001UKS150", "B003VNKNEQ", "B006RG23JC", "B004GJURHM", "B001767QPS", "B004FLL5BI", "B003VWU2WA", "B002XPHQ02", "B0062WZ3RK", "B0054STATA"], "buy_after_viewing": ["B004FLL5AE", "B003VNKNF0", "B004FLL5AO", "B003VNKNEQ"]}}