{"asin": "B001DJ7Y2O", "description": "Now You Have One Less Thing to CarryWhen you need to grab your laptop and take it to another room or into a meeting, just slide your V550 Nano onto its dock and go. The Clip-and-Go dock makes it easy to attach your mouse to your laptop, and because the wireless nano-receiver is so small, you can leave it plugged into your laptop all the time. With the V550 Nano, you can keep one hand free to grab that all-important cup of coffee.Key FeaturesClip-and-Go Dock That Lets You Snap Your Mouse Onto Your LaptopNow you have one less thing to carry around your home or office. The Clip-and-Go dock attaches easily to your laptop, so when you're ready to move, just clip your mouse onto the dock and go. And the mouse turns off automatically when attached, helping save battery life.url's used in the movietext used in the moviesaved from url=(0013)about:internetExtra-Long Battery Life (Up to 18 Months) and Low-Battery IndicatorAdvanced battery management technologies mean that batteries will last up to 18 months. That's a year and a half before you need to change batteries. And the convenient LED battery level indicator notifies you when batteries are low.Plug-and-Forget Nano-Receiver That's So Small, It Stays in Your LaptopThe wireless nano-receiver is small enough to stay in your laptop and even when you pack your laptop away--so it's easy to just plug the receiver in and forget about it.Hyper-Fast Scrolling for Flying through Documents and Web PagesThe hyper-fast scroll wheel lets you fly through documents and Web pages in just seconds. One spin and you'll never go back to an ordinary scroll wheel.Advanced 2.4 GHz Cordless Technology for More Robust, Reliable PerformanceLogitech's new 2.4 GHz cordless wireless technology gives you more robust, more reliable performance than previous-generation technologies and with virtually no delays or drop-outs.Superior Laser Precision for Smoother Tracking on Virtually Any SurfaceLogitech's advanced laser technology works smoothly and effortlessly on virtually any surface, giving you a level of control many times more precise than an optical mouse.What's in the BoxPackage ContentsLogitech V550 Nano Cordless Laser Mouse for Notebooks2.4 GHz Plug-and-Forget Nano-ReceiveTwo Clip-and-Go docks (silver and black)Two AA alkaline batteriesDesktop USB extension standClip-and-Go dock storage boxTwo cleaning wipesClip-and-Go dock removal toolQuick-Start GuideThree-year limited hardware warrantyFull product supportSystem RequirementsPC with Windows XP, Windows Vista or Macintosh computer with Mac OS X (10.3.9 or above)1 available USB port", "title": "Logitech V550 Cordless Laser Mouse for Notebooks", "price": 24.99, "imUrl": "http://ecx.images-amazon.com/images/I/4115AweNdOL._SY300_.jpg", "related": {"also_viewed": ["B0082D5660", "B00FVF73A4", "B000TKHBDK", "B00165XQWW", "B003HC2FHE", "B001660084", "B002Y6CJJ8", "B000GABCY2", "B002HWRJBC", "B000UY3NR8", "B007PJ4Q4A", "B003NR57BY", "B0098QVV7I", "B000HCRVUS", "B00DR8L7M2", "B004YAVF8I", "B003I4FF1O", "B0093H4VBU", "B007T1CTDE", "B000HCT12O", "B000UY4XQI", "B005DSPLCQ", "B00DR8LB4Q", "B005HQ5138", "B00325ME7W", "B002APDFA0", "B0085QDE68", "B007PJ4Q3Q", "B00DR8LA60", "B005HQ514C", "B002HWRJBM", "B003I4FF2I", "B0093H4VSS", "B003TG75EG", "B00FK1HMLY", "B000RB8OFU", "B005KSAG3S", "B004ZEZBE2", "B005GB31PE", "B00F4JOP0S", "B005EJH6Z4", "B0098QVVGY", "B00AG0TOGA", "B0058OU8VY", "B004HIN8N2", "B003I4FF2S", "B007PJ4Q4U", "B007PJ4PLY", "B001DJ64C0", "B0035ERKYW", "B006MBP7T0", "B003PBZNF8", "B001DHECXA", "B005KSAHZU", "B005DSPLDA", "B0034XRDUA", "B00E7IPN0I", "B000G1D8HU"], "buy_after_viewing": ["B003NR57BY", "B0082D5660", "B002HWRJBM", "B00FVF73A4"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Mice"]]}