{"asin": "B001NEK0P2", "categories": [["Electronics", "Computers & Accessories", "Webcams"]], "description": "Enjoy Superior Video Chat with Friends and FamilyAlways look sharp with autofocus lensLook sharp no matter how much you move around. Live! Cam Optia AF is the only PC webcam with an autofocus lens, 2.0mp sensor, and Plug and Play functionality. Simply plug the webcam to your PC's USB port and be amazed!Look Your BestWhether you're chatting on the web, recording a new video blog, or snapping photos, you'll want to look your best. Creative's Live! View technology automatically selects the best setting for you so that your image always looks sharp and vivid. The Smart Face Tracking feature keeps you in the frame and looking sharp no matter how much you might move around.Record video to your PC--perfect for posting a video blog, uploading to the Internet, or creating a home movie. You won't look grainy or fuzzy using Live! Cam Optia AF. A high quality 2.0mp (1600x1200) sensor, Live! View technology, and auto tuning give you video quality you may not expect from such a compact webcam.Sound Your BestThe Live! Cam Optia AF incorporates Creative's superior audio technology by using a set of built-in adaptive array microphones. The dual microphones and Creative's exclusive Live! Audio technology cancels out background noise, so all you hear is pure voice over the Internet.Have Some Fun with Your WebcamLive! Doodling, live interaction!Just like a real doodling board, you can use your mouse as a digital pen and doodle on your video image. Give your friends a big laugh when they see whiskers coming out of your face.Video Effects from Creative's Advanced Video FXChange the face of instant messaging! So you've heard all about video effects - the special effects like snowflakes, masks, eye glasses, hairdos, etc. that you add to your video image while chatting online. But wait, what about having a beautiful backdrop behind you like the Eiffel Tower or Sydney Opera House? Plus, you can morph your image into water ripples, blow bubbles out of your mouth, or simple become invisible. You can do all this with Creative's extensive, free collection of video effects and more.Exclusive Voice Effects from Creative's Advanced Audio FXLet them hear you, in so many ways! Don't just doodle and morph your image, do something about your voice! Now with Creative's exclusive Audio FX technology, you can talk like a chipmunk, a robot, or a duck. You can even sound like a 5 year-old kid with squeaky high-pitched voice or an 80 year-old man with quivering low-drone voice. Try it to believe it!Get Much More....Exclusive Parental ControlCreative stands by safe online chat! Live! Cam Optia offers exclusive parental control that is not found on any other webcam. You can enable parental control during setup. Simply create a login and password so that the next time someone uses the webcam, it requires your password before streaming live video over the Internet. Parental control, smart face tracking, and other software features require the CD software installation.Greater viewing flexibility and privacyLive! Cam Optia AF's multi-axis swivel rotates to almost any viewing angle at up to 270&deg;. Plus, the embedded image sensor detects camera rotation at 90&ordm; or above, so that your image is always upright. When you need privacy, simply rotate the camera downward (the lens faces down). This will automatically deactivate the webcam without disconnecting it from your PC.Smooth video, uninterrupted live chatExperience smooth, full motion 30 frames per second digital video and top quality images with hi-speed USB 2.0 throughput. Live! Cam Optia is also backward compatible and works with any USB 1.1 connection.Say goodbye to mounting woesLive! Cam Optia fits easily to almost anything - notebook displays, CRT monitors and flat panel displays. Or simply let it rest comfortably on a table or other flat surface.", "title": "Creative Labs Live! Cam Optia AF 2.0MP Webcam with Autofocus Lens", "price": 49.89, "imUrl": "http://ecx.images-amazon.com/images/I/31Yhu4R6KqL._SX300_.jpg", "brand": "Creative Labs", "related": {"also_viewed": ["B006JH8T3S", "B004431UBM", "B00K11RI6W", "B004FHO5Y6", "B004ABO7QI", "B0096KSBB0", "B004WO8HQ4", "B009CPC6QA", "B0092QJRPC", "B003M2YT96", "B004YW7WCY", "B000UY1OMY", "B0040X3EG0", "B002UBPBTC", "B0067MK1TU", "B0040508OY", "B004ABQAFO", "B003LVZO92", "B00CRJWW2G", "B004H1MCKY", "B000O0M5EA", "B0083I7Y8W", "B003LVZO8S", "B000RZQZM0", "B00372567A", "B008ZVRAQS", "B002MCZJ78", "B0082BS5K6", "B003LVZO88", "B0015TJNEY", "B0058GK55Q", "B003LVZO8I", "B00D1A5OR0", "B0043PIZYG", "B000LIJ566", "B002DW0VT8", "B005OA3BSY", "B002XN7C6W", "B007B62C5C", "B0080CE5M4", "B005BZNEKM", "B00442XOPS", "B001AOK7KI", "B002OHOF08", "B005PPODFI", "B002OO18NS", "B009ZN03AA", "B00HZI0Y0Q"], "buy_after_viewing": ["B006JH8T3S", "B0092QJRPC", "B004431UBM", "B00K11RI6W"]}}