{"asin": "B000AY5Y5W", "description": "Extreme cordless performance. The Logitech G7 laser cordless mouse delivers extreme cordless performance with a 2000 dpi laser engine for blinding speed and precision response. The G7's full-speed, bidirectional USB connection sends a blazing 500 reports/second* over 2.4 GHz wireless for a bulletproof connection. Dead batteries won't stop you mid-mission, thanks to a five-level power indicator and twin hot-swappable Li-ion battery packs that recharge while you're racking up points. Use Logitech's SetPoint software to customize your mouse with advanced features such as game detection and adjustable sensitivity (including independent x- and y-axis settings). The programmable tilt wheel adds an unprecedented level of control and gaming power.Features2000 dpi laser engineAn ultrahigh resolution engine churns images at an astounding 6.4 megapixels per second. A massive (30-pixel by 30-pixel) sensor array and precision laser technology allow the G7 to deliver best-in-class performance and tracking.Full-speed USB + 2.4 GHz cordlessFour times faster than conventional mice, USB delivers blazing speed and instant acceleration. With a five times** stronger connection, 2.4 GHz wireless bulletproofs the G7 against lags and interference dropouts.Two fast-swap ultralight Li-ion packsRecharging doesn't have to mean pausing the action. In the default gaming power mode, the battery life will last up to two and a half days for average game play.***Battery-level indicatorThe five-level gauge tells you exactly how much game time remains.Polytetrafluoroethylene (PTFE) gaming feetForget sticky workarounds--the G7's durable polytetrafluoroethylene feet give the ultrasmooth glide you want in a gaming mouse.In-game sensitivity switchingThe G7 provides instant access to three sensitivity levels--400 dpi, 800 dpi, and 2000 dpi--before driver installation. Shift from pixel-precise targeting to fast-twitch maneuvers, without pausing the action.* For Windows&reg; 9x and ME users only, the Logitech SetPoint software will limit the report rate to 125 reports/second. ** Compared to conventional 27 MHz wireless. *** Based on an average of 4 hours of game play a daySystem RequirementsIBM or compatible PCWindows 98, 2000, Me, XPUSB portTechnical SpecificationsTracking resolution: 2000 dpiImage processing: 6.4 megapixels/secondMax. acceleration: 20gMax. speed: 45-65 inches/second (depending on surface)USB data format: 16 bits/axisUSB report rate: 500 reports/secondSleep mode: disabledPackage ContentsLogitech G7 laser cordless mouse2 Li-Ion battery packsCharging stationUSB dongleCD with SetPoint softwareInstallation guideThree-year warranty", "title": "Logitech G7 Laser Cordless Mouse", "price": 70.28, "imUrl": "http://ecx.images-amazon.com/images/I/41Q6YQAJGQL._SY300_.jpg", "related": {"also_viewed": ["B00BFOEY3Y", "B00E4MQODC", "B0002UM0JW", "B000AOIP9O", "B003VAM32E", "B000ODN7VM", "B000AY5YI4", "B00E19SMGK", "B0000CEPDF", "B00F9B1QK8", "B000HCT12O", "B00CJD4HD2", "B001DJ64C0", "B002HWRJBM", "B000BFNT2A", "B005NB9RFK", "B0093HLUTQ", "B003OXPVEU", "B0007Z1M50", "B000T8CWFE", "B003TG75EG", "B001DWK4NC", "B003NR57BY", "B001BPWXA8", "B000UHE8Y2", "B00BCEK2LA", "B000HCRVUS", "B00165XQWW", "B001FA1SIM", "B001NTFATI", "B0034XRDUA", "B007XZX2K0", "B0054JGGGY", "B00B0TXEEY", "B006JRIDHK", "B00B312UDU", "B00FZVW8RC", "B0081KKE4I", "B00CDINUTK", "B0055QZ216", "B002J9GDXI", "B0011FCV8W", "B005KSAHZU", "B00AAS88K6", "B00AAQRNQ8", "B00IRHE892", "B00ADHY0OW", "B003ZMF26W", "B000EXRSWG", "B00I5TZOB8", "B00006HZ0K", "B00DPC015E", "B00BEEFNV2", "B008U6SS1E", "B002JTWODG", "B000ZH7E5M", "B00FGP99KG", "B003HC2FHE", "B0082D5660", "B001F7AP1Q"], "buy_after_viewing": ["B00BFOEY3Y", "B003NR57BY", "B002HWRJBM", "B00E4MQODC"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Mice"]]}