{"asin": "B0032JRRWU", "related": {"also_viewed": ["B004HW73RA", "B004HW73QQ", "B004HW73R0", "B0011ZCDKS", "B003DL2MB8", "B004HW73QG", "B001EQ4C4E", "B0032JRRWK", "B004S3LEWI", "B00AWYN182", "B001SER48I", "B0075SUFXW", "B004HW73PW", "B00B5HE3IW", "B0075SUFSC", "B001SER46K", "B00EFILR6E", "B00B5HE2UG", "B003ZSHNG8", "B0075T7NW2", "B004HW73S4", "B0075SUEOM", "B00908BQCY", "B00AWYN0BU", "B0076W0LNQ", "B000EMWBV0", "B004J41T7Q", "B000HARTYI", "B001EQ4C80", "B000EMWBT2", "B0075SUH5S", "B0075SUFLE", "B00B5HE3NW", "B001SER4BK", "B00EFILSOU", "B00HLDFQU8", "B001SER48S", "B000NK8EWI", "B0011ZK6PC", "B0075SUK6O", "B001SER47Y", "B004I7II82", "B004HW73OS", "B004J3V8UU", "B003VTZE26", "B00B5HE32I", "B001SER47O", "B00BW6LTG0", "B0012YA4YK", "B00B5HE1SY", "B00I58LZ80", "B00BW6LUL4", "B00AQDGAPK", "B004J3X5VA", "B0075SUHQC", "B0032JRRZM"], "bought_together": ["B001OBVUQC"], "buy_after_viewing": ["B003VNKNEQ", "B004I7II82", "B003VNKNF0", "B0032JRRZM"]}, "title": "Canon PowerShot A3100IS 12.1 MP Digital Camera with 4x Optical Image Stabilized Zoom and 2.7-Inch LCD (Blue)", "price": 279.0, "salesRank": {"Camera &amp; Photo": 6286}, "imUrl": "http://ecx.images-amazon.com/images/I/41iZMvxg5fL._SX300_.jpg", "brand": "Canon", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "There's nothing more satisfying than taking great pictures! And with the Canon PowerShot A3100 IS, it's so effortless. The 12.1-megapixel resolution and 4x optical zoom with Optical Image Stabilizer ensure radiant, detailed images. Plus, you've got an advanced DIGIC III Image Processor with evolved Face Detection Technology and the Face Detection Self-timer for extraordinary control and performance. New scene modes give your images a professional feel. There's the Face Detection Self-timer for extraordinary control and performance and Smart AUTO lets you handle challenging conditions with ease. Plus this trim, fashionable camera is yours in three stunning colors.12.1-megapixel resolutionCanon PowerShot A3100 IS HighlightsPowerful A-Series camera with 12.1 megapixels, 4x optical zoom with Optical Image Stabilizer and DIGIC III Image ProcessorWith the PowerShot A3100 IS, dramatic, personal pictures have never been easier to shoot and share. This 12.1-megapixel camera lets you create impressive large photos of family and friends you'll be proud to display. The high-resolution 4000 x 3000-pixel images taken by the PowerShot A3100 IS can be enlarged up to 13 x 19 inches.The PowerShot A3100 IS has a 4x optical zoom lens that makes it easy to get the inspiring, emotive close-ups that will make your images lasting keepsakes. This magnificent lens gives you the power to shoot subjects with razor-sharp precision and stunning lifelike color. So you can brilliantly capture a shot of a sweeping landscape, or a child's big smile.The PowerShot A3100 IS is equipped with Canon's acclaimed Optical Image Stabilizer Technology that automatically detects and corrects camera shake--one of the leading causes of fuzzy or blurred shots. Even when zoomed in, you can get the steady, crisp, brilliant images you'll be proud to shoot and share. And Canon's Optical Image Stabilizer Technology is so convenient to use. It functions perfectly with or without a flash.Lithium-ion batteryThe Canon PowerShot A3100 IS uses a newly developed rechargeable lithium-ion battery. This compact, powerful battery helps make it an incredibly lightweight and slim camera. Charge-up is quick and easy, so the PowerShot A3100 IS will be ready and waiting for those special moments.New Scene Modes deliver more creative freedomThe Canon PowerShot A3100 IS gives you even more creative freedom by including new modes made to get the kind of images people talk about. Super Vivid captures the colors you see with your mind's eye, saturating the scene with intense colors. Turn drab scenes into exciting compositions, when dull pinks blaze into brilliant fuchsia and off-yellows suddenly burn bright and hot. Even dark colors become richer with Super Vivid. Sunsets and floral scenes turn into bursts of color, and get your photo noticed.Poster Effect combines several similar shades into one color, turning subtle gradations of color into eye-catching, scene-popping contrasts across your image for a unique artistic look.18 Shooting ModesAdvanced presets for the best possible photos under certain conditions. With 18 Shooting Modes including Scene Modes, you're ready for whatever shot comes your way.Smart AUTO will do the work for you by intelligently selecting the proper settingsJust set the Canon PowerShot A3100 IS to Smart AUTO and you're ready for maximum enjoyment from your picture taking every time. It's a relaxing and satisfying way to shoot because you can completely concentrate on your subject knowing that the camera has the technical details covered. Advanced Canon technology intelligently analyzes your situation and shooting conditions. Then it automatically selects an appropriate setting from 18 specially defined settings. So whether you're photographing flowers, a captivating sunset, or your friends at the park, you can be confident that you're getting dramatic, memorable images.Low Light mode in actionLow Light mode for improved shooting in dim lightingWith an ISO of 400-3200, the Low Light mode takes the Canon PowerShot A3100 IS where no A-Series has gone before--into the shadows! Now even scenes notorious for having insufficient light, such as those lit by candles, fire, or street lamp, come through in fantastic color and clarity, with less noise. You can keep the feel of the scene intact without adding additional light, so the result will be scenes with the visual accuracy, depth and clarity you expect from a Canon camera.Large, bright 2.7-inch LCDThe PowerShot A3100 IS's large 2.7-inch LCD screen gives you the big picture, whether you're shooting, reviewing or showing off your images. This high-resolution screen offers a crisp, clear and bright picture. It also features Night Display for easy viewing in low light."}