{"asin": "B001PKHRUK", "description": "The X-Men saga continues with theX-Men Origins: Wolverinevideo game for the PlayStation 3, based on the feature film of the same name. Unleash the fury of Wolverine and see how it all began. With cinema-style graphics and sound, and unstoppable action and excitement,X-Men Origins: Wolverinewill have you on the edge of seat as you slash, slice, and stab your way through level after level of intense, epic gameplay..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } img.withlink {border:0px black solid;} a.nodecoration {text-decoration: none}The realistic graphics will have you feeling like you're watching a movie.View larger.Wolverine's real-time regeneration powers keeps you going for more action.View larger.Use your claws to slice up your opponents.View larger.X-Men and Wolverine fans will recognize scenes from the comic book.View larger.Cinema-Style Graphics and SoundWith incredibly detailed graphics and stellar sound effects, you'll feel as though you're watching a full-feature movie, only you'll be playing it on your PS3.X-Men Origins: Wolverinetakes you back to the \"birth\" of Wolverine when the fury was first unleashed. Battle your way through levels of relentless action that feature jaw-dropping graphics that are suitable enough for the big screen.You'll encounter extremely detailed combat situations throughout this game, including battling enemies at 30,000 feet in the air with no parachute, all on your way to hunt down the secrets of Weapon X.Relentless Combat and Epic GameplayTake on the enemy as only Wolverine can using his indestructible adamantium claws to defeat even the toughest adversaries. With over 100 custom moves and attacks, reflex quick-kills, and long-range lunge attacks, you have enough destruction power at your fingertips for even the most intense combat situations.Battle the meanest, toughest bosses that Wolverine has ever faced, including the gigantic 200-foot tall Sentinels, grotesque Wendigos, and the sinister Leviathans. Use Wolverine's real-time regeneration powers to mend bone and muscle tissue for non-stop fighting action and seemingly impossible risk-taking.Special Rage Powers and Feral SensesTake advantage of Wolverine's rage power to unlock devastating special moves, combos, and contextual attacks that are sure to ravage anything in his path. Plus, you can utilize Wolverine's animal-like Feral Senses to expose the enemy's weaknesses and provide you with a tactical advantage against them. You can also use this unique animal instinct to solve puzzles and discover escape routes throughout your journey.Experience true-to-character authenticity and unrelenting action as you slice and dice your way through incredibly detailed graphics and cinematic sequences that are sure to satisfy any mutant-loving gamer.X-Men Origins: Wolverineis a satisfying action game with plenty of special moves, evil villains, blood and gore, unstoppable action, and so much more.", "price": 100.5, "imUrl": "http://ecx.images-amazon.com/images/I/61gu21pmrfL._SY300_.jpg", "related": {"also_bought": ["B004RIACMW", "B004LM37FI", "B004BCZLQ6", "B008LW4SCU", "B00114XU4C", "B004MXM7WU", "B003ESHRL0", "B001811BTO", "B005VKRGXI", "B001UW9ZW6", "B000GA75TI", "B004VMXBEU", "B00114XU60", "B000R39GPA", "B0029MAXR2", "B0030HM2WO", "B000NJFMFQ", "B002WDL516", "B007SRM5U6", "B001NX6GBK", "B005UDTTQ8", "B0076ZQSFI", "B0050SX2MK", "B00C7103DO", "B002I0K898", "B000HWX418", "B003C1I06U", "B007TYC8MI", "B000XJNTQ0", "B002I0J8FI", "B003PHLT8W", "B0030F1DOO", "B0056WJA6M", "B00BFU8IEE", "B003VKLAAU", "B0081B1O5A", "B0088I7L76", "B002EZH804", "B004FUI84G", "B004MXQX66", "B005C7R950", "B001D7T2VC", "B0050SXGU8", "B00149ILDO", "B002W5GIB6", "B002BRZ744", "B004J6I0YO", "B002I0H2G0", "B008CP6Q6M", "B008XMSR6G", "B0012NAPNQ", "B000XJLQ24", "B004EW948E", "B004FS8LYK", "B002I0J6KU", "B00170823O", "B00FRESXSA", "B0050SWUTQ", "B0001I9YHG", "B000ZK7ZK8", "B000P297EI", "B001E7MMNG", "B002I0J6DC", "B004HCYVO8", "B000UW21A0", "B000K9OP2A", "B002I0K5NC", "B00320JAWY", "B002I0K7H6", "B00354NANC", "B0017ZIIK6", "B000WQWPP0", "B000KLNLUK", "B0016GC9D8", "B005DKMCCG", "B001ASJIS6", "B001UWGCW2", "B001URRH0S", "B00B59L9T6", "B0022TNO7I", "B000WCT1KQ", "B00309XHD0", "B0086V5V8G", "B00104KCF8", "B001TOMQSK", "B0082SIBN0", "B003P9FRGA", "B001YHX4B0", "B000X1TC0U", "B000QAUGH6", "B003S2MXQG", "B004ML44Y6", "B00163LW7K", "B00432O50W", "B000O3IS48", "B00KVRK39A", "B005VBVQDI", "B006ZTHFPS", "B007CM0K86"], "bought_together": ["B004RIACMW", "B005VKRGXI"], "buy_after_viewing": ["B008LW4SCU", "B004RIACMW", "B004MXM7WU", "B003ESHRL0"]}, "salesRank": {"Video Games": 5040}, "categories": [["Video Games", "PlayStation 3", "Games"]]}