{"asin": "B00728ZAEY", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The Lumix DMC-ZS15 features a versatile 24mm ultra-wide angle and powerful 16x optical zoom LEICA DC VARIO-ELMAR lens with 32x Intelligent Zoom. It also features a large, 3.0\" (7.5cm), 460K-dot TFT LCD Display.Panasonic Lumix ZS15 HighlightsLEICA DC VARIO-ELMAR LensWith a newly-redesigned lens system, the ZS15 features a new mechanical structure and optical system to further improve image quality and with Nano Surface Coating technology, it offers stunning image clarity with minimized ghosting and flare.Amazing Picture QualityFeaturing a newly developed 12.1-megapixel High Sensitivity MOS sensor, the ZS15 is able to provide amazing image quality. Coupled with the advanced image processor Venus Engine, the ZS15 features high speed, high sensitivity image recording. High speed burst shooting at 10 fps in full resolution and Light Speed AF allows you to capture even the most fleeting photo opportunities.Full HD RecordingWith the ability to record high-res, Full HD 1920 x 1080 60p videos in AVCHD Progressive (MPEG-4) format or (30p in MP4), the ZS15 is able to produce extremely clear video details, even when subjects are moving quickly.", "title": "Panasonic Lumix ZS15 12.1 MP High Sensitivity MOS Digital Camera with 16x Optical Zoom (Silver)", "price": 349.0, "imUrl": "http://ecx.images-amazon.com/images/I/3124joVTAqL._SX300_.jpg", "brand": "Panasonic", "related": {"also_bought": ["B004BFC260", "B0049V0ZX8", "B005HNF01O", "B003VNKNEQ", "B0029ZA78O", "B0063I46QM", "B0032G618O", "B005POCF4U", "B005RXH1WU", "B003VNKNEG", "B003F7DWH8", "B005X64OQW", "B003VNKNF0", "B002WE4HE2", "B0047EL5D6", "B0037FLUYU", "B008C4E9VW", "B007M54E08", "B00E0HGMOC", "B007VPXLM6", "B00728ZBC0", "B00728ZBA2", "B001V9KG0I", "B00ABOP3AC", "B007SOENDQ"], "bought_together": ["B003VNKNEQ"], "buy_after_viewing": ["B00728ZBA2", "B003VNKNEQ", "B003VNKNF0", "B0049V0ZX8"]}}