{"asin": "B000RQHAUA", "description": "With the Apple TV, you'll have instant access to a whole world of entertainment. Whether you want to rent HD movies, buy HD TV show, listen to your iTunes music collection, or show off your photos, Apple TV will bring all of it into your living room and onto your television without any computer required.Choose from the largest selection of on-demand HD movies.Put more HD on your HDTV.HD movies. HD TV shows. HD podcasts. With Apple TV, they&rsquo;re all on demand. You get instant access to newly released Hollywood hits and popular classic and library titles, including the largest selection of on-demand HD movies. And now you can also purchase and watch your favorite TV shows in brilliant HD one day after they air.The largest selection of on-demand HD movies.Apple TV gives you instant access to the largest selection of on-demand HD movies. Choose a movie, and in minutes, you&rsquo;re watching the opening credits with theater-like Dolby Digital 5.1 surround sound. HD rentals start at $3.99, and you have 30 days to start watching. Hit Play, and it&rsquo;s yours to watch as many times as you want in 24 hours.The elegant Apple TV lets you instantly access a world of entertainment.View larger.Despite the small size, Apple TV has a full complement of outputs.View larger.Rent or buy standard-definition&nbsp;movies.Choose from the most popular Hollywood titles, from comedy to drama, romance to classics, independents to thrillers. Standard-definition movie rentals are $2.99 for library titles and $3.99 for new releases. Short films &mdash; including popular Pixar animated shorts &mdash; are only $1.99. And if you like the movie you just rented, you can make it a permanent part of your digital collection. Movie purchases start at $9.99, and most titles are available the day they&rsquo;re released on DVD.Play your music through your home&nbsp;theater&nbsp;system.With Apple TV, iTunes syncs wirelessly to your TV, so all the music you&rsquo;ve collected can now be played on the best speakers in your house. The new Genius feature studies your iTunes library to automatically create a playlist of songs that go great together. You can also browse and buy music videos on the iTunes Store. And sync songs and videos purchased on Apple TV to your computer and iPod or&nbsp;iPhone.Now appearing on HDTV: Your photos. YouTube&nbsp;videos.&nbsp;And podcasts, too.Your photos deserve a bigger stage. And Apple TV puts them on your widescreen TV, where everybody can see them in stunning high definition. Select My Photos to browse photos that are on your Mac or PC. You can also access your Flickr or MobileMe galleries. And you no longer have to gather around a computer screen to see YouTube videos and podcasts &mdash; Apple TV plays them big and bold on your TV&rsquo;s spectacular&nbsp;screen.Lots of Features in a Small PackageThe Apple TV features a 160GB hard drive for storing content locally, and has an HDMI port, component video, optical audio, analog RCA stereo audio, 10/100BASE-T Ethernet, USB 2.0, and 802.11n wireless networking. All this in an elegant box that measures just 7.7 by 7.7 x 1.1 inches (WxDxH). A remote control is included so you can navigate all your choices from the comfort of your couch.System RequirementsApple TV requires a Mac (running Mac OS X 10.3.9 or 10.4.9 or later) or PC (running Windows XP Home or Professional (SP2) or Vista), iTunes 7.6 or later (iTunes 8.0.1 recommended), and either an Airport Extreme, Wi-Fi 802.11b, 802.11g or 802.11n wireless network (wireless video streaming requires 802.11g or 802.11n) or 10/100BASE-T Ethernet network.Apple TV is backed by a one-year warranty.What's on the BoxApple TV, remote, power cord, documentation.Apple's legendary ease-of-use makes the Apple TV fun and easy to use.", "title": "Apple TV MB189LL/A with 160GB Hard Drive [OLD VERSION]", "price": 102.49, "imUrl": "http://ecx.images-amazon.com/images/I/31rdF7cC79L._SY300_.jpg", "related": {"also_bought": ["B005MQPW5U", "B000MQNMQ6", "B008D96Z8Q", "B001FA1NK0", "B0050QJUP0", "B002OXGYQU", "B000VZ3JLG", "B000BQYM0W", "B002TPFNXS", "B00CH643A8", "B007I5JT4S", "B008ALA2RC", "B00DR76YJO", "B0064GHP1G", "B007882RB2"], "buy_after_viewing": ["B007I5JT4S", "B003L1ZYYM", "B002TPFNXS", "B000BQYM0W"]}, "categories": [["Electronics", "Television & Video", "Streaming Media Players"]]}