{"asin": "B000AYKUUQ", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "As the Powershot flagship, the Powershot SD550 maintains the style and sophistication for which Powershot is renowned--the elegant 'perpetual curve' design returns. And as ever, the functionality behind this new Powershot model is as stunning as the camera itself. The cameras boasts DIGIC II processing, and a massive 2.5-inch LCD. The Powershot SD550 has 7.1-megapixel resolution and comes with 3x optical zoom.Style statementEach Canon Powershot is a statement in style, and the Powershot SD550 is no exception. The sleek lines and graceful feel of the Powershot SD550's all-metal perpetual curve body embraces Powershot luxury.Large LCD with wide viewing angleThe camera features an oversize 2.5-inch LCD display, while retaining all key controls and preserving a sleek and slim body. The large LCD with wide viewing angle makes it easier to view and share images and movies during playback. The big LCD also makes it easier for the user to frame their shot and view menus, and is adjustable to 15 levels of brightness. New slide show functions allow review of images with stylish and contemporary transition effects applied in camera to create impressive slide shows with minimum user effort.UA elements and megapixels for bigger printsThe Powershot SD550 operates with 7.1-megapixel resolution, which can give photo-quality 15 x 20-inch prints. The Powershot SD550 lens is constructed with 7 elements in 5 groups and includes two Ultra High Refractive Index Aspherical (UA) elements for true-to-life colors and crisp, high-contrast images.DIGIC II ProcessorThe SD550 features DIGIC II--Canon's renowned processor that ensures images have superb resolution and color quality, as well as giving improved camera performance overall. With 9-point AiAF, the camera automatically focuses on the subject, even when it is off-center. iSAPS intelligence ensures that the camera assesses the scene and adjusts the settings to achieve the optimum results. Three methods of exposure control can be selected, evaluative, center-weighted, and spot, and the ISO can be set to Auto, 50, 100, 200, or 400. For rapid downloading of images, the Powershot SD550 utilizes a USB 2.0 Hi-Speed interface.Shooting modes and special effectsThe Powershot SD550 covers a wide range of photographic situations by providing users with 15 or 14 different shooting modes, respectively. A selection can be made from Auto, Manual, Portrait, Landscape, and Night Snapshot modes, or from the scene modes that now include an underwater setting, allowing users to take full advantage of the optional Waterproof Case WP-DC80 (not included--must be purchased separately). Underwater mode adjusts the white balance specifically for underwater shots, allowing capture of the most authentic colors and minimizing any blue cast.My Colors allows the expansion of creativity in digital photography. Special effects such as Color Swap or Custom Color, which allows users to select their preferred color balance for any given shot, can be performed in-camera and viewed on the LCD while shooting stills and movies. These effects could previously only be achieved using PC software after shooting.Intelligent orientation sensorThe Powershot SD550's Intelligent Orientation Sensor recognizes when the camera is rotated from horizontal to vertical, automatically rotating stored images for correct playback.To help keep the camera level with the horizon and to assist with image composition, users can also opt to display gridlines on their LCD.Other user interface options have been enhanced or added, including the new world time zone display. This allows the user to set home and destination country time zones, as well as animated displays and improved warnings for camera shake. The camera menu can also be displayed in 22 different languages.More than just photosThe Powershot SD550 records high quality VGA movies; users can select between VGA and QVGA at 30 or 15 frames per second. Continuous filming is available until the file size has reached 1 GB or 60 minutes--whichever is reached first. A fast frame rate of 60 frames per second is available, allowing for slow-motion playback. Digital zoom can be employed whilst shooting, and for added effect, My Colors may also be used. Compact Movie mode, or QQVGA (160 x 120/15 frames per second), is designed to make sharing movies via e-mail as simple as possible.Printing imagesWhen used in combination with Canon's new Compact Photo Printer Selphy CP710 and Canon's Ink and Paper Set (KP-108IP), prints can be produced for just 30 euro cents each. Printing via a Selphy CP Compact Photo Printer also allows the user to print handy ID prints and movie prints.When connected to the latest range of PictBridge compatible PIXMA printers (also released today) image enhancement is possible with functions including Noise Reduction and Vivid Photo as well as the new Face Brightener feature.Printing of images without having to connect to a PC is made simpler via the Print/Share button, which also acts as an easy upload button for Windows XP and Mac OS X.Comprehensive softwareThe Powershot SD550 comes bundled with the following Canon software:ZoomBrowser EX 5.5, PhotoRecord 2.2 (Windows), ImageBrowser 5.5 (Macintosh):For easy image download, storage and retrieval, as well as management of image layout and printing.PhotoStitch 3.1:Creates stunning panoramas and can be used with Windows and Macintosh.Movie Edit Task:For editing and enhancement of movie footage. Also included is PhotoStudio, the photo manipulation software by ArcSoft.Purchasers of the Powershot SD550 are eligible for membership of Canon iMAGE Gateway, where they can upload images and customize their camera settings.The bundled software supports Windows 98 (SE), ME, 2000 (SP4), XP (SP1/3) and Macintosh OS X v10.2-v10.3. The camera supports PTP for driverless transfer to supported Windows XP or Macintosh OS X.What's in the boxPowerShot SD550 body, Lithium battery pack NB-3L, battery charger CB-2LU, 32 MB SD memory card SDC-32M, wrist strap WS-700, Digital Camera Solution CD-ROM, USB interface cable IFC-400PCU, audio-video Cable AVC-DC300", "title": "Canon Powershot SD550 7.1MP Digital Elph Camera with 3x Optical Zoom (Beige)", "price": 9.99, "salesRank": {"Camera &amp; Photo": 10942}, "imUrl": "http://ecx.images-amazon.com/images/I/511XH3S5HNL._SY300_.jpg", "related": {"also_viewed": ["B000EMWBV0", "B0009GZSSO", "B001SER48S", "B000GHVZQ0", "B000Q3043Y", "B000AYJDD6", "B00009VT1T", "B001SER492", "B001SER49M", "B001SER49C", "B000EMWBT2", "B0001656FW", "B0075SUIEI", "B000NK6J6Q", "B0075SUG8Q", "B001SER4A6", "B001SER47O", "B006UMM1AY", "B001SER47Y", "B0000BV1LG", "B006UMM15O", "B00BERFUAS", "B005AVMEGM", "B0075SUII4", "B0012Y6AY8", "B0012YA6P2", "B005II5OLY", "B00B5HE3AK", "B00B5HE3UU", "B000NK8EWI", "B0075SUG3Q", "B006UMM1F4", "B0075SUJ4W", "B003ZSHNGS", "B000EVLS4C", "B0007TJ5OG", "B0007TJ5AK", "B0012YC7AE", "B00I58LZRG", "B00I58LVKC", "B0075SUHWG", "B000AYGDIO", "B00AWYN0ME", "B0075SUGKO", "B00AWYN0BU", "B0075T7NW2", "B00HLDFNKQ", "B004HW73SO", "B0075SUHQC", "B00B5HE3IW"], "buy_after_viewing": ["B0001656FW", "B003VNKNEQ", "B003F7DWH8", "B004H3XNB4"]}}