{"asin": "B004U78628", "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories"]], "description": "Some things are meant to go togetherEasily switch between tablet and PC mode with the docking station designed especially for the Eee Pad Transformer. The station not only extends the tablet's battery life up to 16 hours1but also features added functionalities which include a near full-sized QWERTY keyboard, a multi-touch touchpad, 2 USB 2.0 ports, and a 4-in-1 SD card reader.View largerKey FeaturesEnhance productivity with the docking station's 92% sized QWERTY keyboard that adds additional 6.5 hours of battery life, to instantly turn the Transformer into PC mode with up to 16 hours of battery life.14-in-1 SD card reader lets users transfer files between their devices and the tablet quickly, easily and safely.Large sized multi-touch touchpad is not only comfortable to use but supports intuitive gesture inputs.Connect mice, keyboards, USB memory sticks and USB HDDs to the tablet with the docking station's 2 USB 2.0 ports for enhanced computing experience.Relax, ASUS Has You CoveredRanked as the #1 most reliable PC brand by 3 independent sources2, readers and editors alike choose ASUS as their trusted notebook and netbook. We tirelessly strive to exceed expectations of quality to ensure you an unmatched peace of mind every time you start your PC.We also back our commitment with the industry's most comprehensive warranty.1 year North America warrantyFree one-way standard shipping24/7 tech supportWhat's in the BoxTF101 Tablet Docking StationUser manualSpecificationsInput/Output:2 x USB 2.0Card Reader:1 x 4-in-1 Card Reader / MMC / SD (SDHC/SDXC)Battery:24.4 W/h Li-polymer battery (up to 6.5 hours)1Dimensions:10.67\" x7.28\" x 1.1\" inches (W x D x H)Weight:1.41 lbs (with battery)Color:Espresso&copy; 2011 ASUS Computer International. All Rights Reserved. ASUS is a registered trademark of ASUSTeK Computer. All specifications and terms are subject to change without notice. Please check with your supplier for exact offers on selected models. Products may not be available in all markets. Product may not be exactly as shown in photos. All trademarks are registered to their respective companies. ASUS shall not be liable for technical or editorial errors or omissions contained herein.1Actual battery life varies with usage. Operation lifetime subject to product model, normal usage conditions and configurations.2Rated number 1 Windows-based PC maker in PCMag.com's Service & Reliability Report 2010. Rated number 1 PC brand according to SquareTrade, the leading direct-to-consumer warranty company (for more information visit http://www.squaretrade.com/pages/laptop-reliability-1109/ ). Rated number 1 reliable PC maker in Q2 2010's RESCUECOM report http://www.rescuecom.com/2010-2nd-Quarter-Computer-Reliability-Report.htmlCheck Out Other Great ASUS ProductsASUS Index Sleeve - BlackWhen docked, your Eee Pad Transformer is not just a tablet, it is also a very capable notebook style PC. Don't leave home without a sleeve protecting your Transformer. Check out this water-repellant textured leather sleeve with an soft sued interior.ASUS Index Sleeve &ndash; PinkWhen docked, your Eee Pad Transformer is not just a tablet, it is also a very capable notebook style PC. Don't leave home without a sleeve protecting your Transformer. Check out this water-repellant textured leather sleeve with an soft sued interior.ASUS RT-N13U Wireless N Router (with USB)Upgrade your network to faster performance and broader range with this EZ to setup wireless N router. You can even share an all-in-one printer with the peers in your network.ASUS VE248H 24-Inch LED Monitor24\" 1920x1080 - 24\" LED Monitor with 10,000,000:1 ASUS Smart Contrast Ratio - Full HD with HDMI - 2ms Response Time", "title": "Asus Eee Pad Transformer TF101 Mobile Docking", "price": 129.98, "imUrl": "http://ecx.images-amazon.com/images/I/41NtrXnUowL._SX300_.jpg", "brand": "Asus", "related": {"also_bought": ["B005JFIS50", "B004U78J1G", "B004U78JT8", "B008G2GBN4", "B006379D0W", "B006X0ZYQ6", "B007GJR7GS", "B007LI1UOE", "B005OUE8R2", "B00CFIDQZG", "B008FOR3Q2", "B005BNWKD6", "B0089RLGEA", "B005G2F3FE", "B005PAINXQ", "B0058OU7EC", "B007Q4VP9I", "B007PBGQ6Y", "B005A96Y74", "B009HK30V0", "B007Q4W47A", "B007Q4WMSG", "B007IFAP6Y", "B004ZMICYA", "B00JMBDMDU", "B007SHJIP6", "B0093OWEOE", "B0058OTXK6", "B005E8NPM8", "B007WAO0AM", "B00685ZDB2", "B006ENZXCM", "B005FVDVIW", "B007QUBYDY", "B0083E7Z6C", "B007K94I2U", "B00ACGMKCI", "B00ADGX756", "B00E58MMSQ", "B007LI2QJW", "B005ORQ350", "B00918TZ94", "B005EC3REU", "B008FH1R0W", "B008TO3PSS", "B005FVDVKA", "B009YJ7IV2", "B007ZE257U", "B007Z0GAY8", "B009O6XJB8", "B005GYDJ58", "B0064VN7F4", "B007QUHFGY", "B0056K5CKW", "B00FNF7PSC", "B007P4YAPK", "B00104XCVO", "B009L0F3IO", "B0088V3ZVO", "B008MPE58S", "B0080MW8O6"], "bought_together": ["B008G2GBN4"], "buy_after_viewing": ["B008G2GBN4", "B007GJR7GS", "B00CFIDQZG", "B007LI1UOE"]}}