{"asin": "B00005NN5G", "description": "The best extreme-sports game ever gets even better inTony Hawk's Pro  Skater 3. The elements that made the last two games a success are back:  tight controls, deep trick system, a wide selection of skaters (including Tony  Hawk, Bucky Lasek, Rodney Mullen, Chad Muska, Elissa Steamer, and others), and a  slick soundtrack (featuring the Ramones, Red Hot Chili Peppers, Motorhead,  KRS-One, Redman, and more). Adding to the already brilliant formula is a new trick,  updated graphics, and Internet play.InTony Hawk's Pro Skater 2, players were introduced to the manual--a  move that greatly revolutionized the series' gameplay. This installment  introduces the revert, and while it isn't as significant an addition as the  manual, it does add another layer to the already deep trick system. The game  features solid graphics, but a level of detail was sacrificed in order to make  the game's levels so large. There are a few frame skips and polygon clips, but  these occasions are rare and do not overshadow the stellar gameplay.Career mode is as deep as ever, with eight objective-filled levels. In this  single-player mode, players traverse their way through some brilliantly designed  courses to achieve high scores, find the letters to the word \"skate,\" find  hidden videotapes, and interact with level-specific objects. Two players can  participate in the five multiplayer minigames, which include king of the hill,  horse, and trick attack. Up to four players can join Internet or LAN games  through the use of the PS2 Network Adapter or numerous USB devices. Supported  USB Ethernet adapters include LinkSys EtherFast USB100TX, D-Link DSB-650TX, SMC  EZNET-USB 2102, and SOHOware NUB100. Supported USB modems include Zoom FaxModem  2985L, Pocket NetSurfer NMT00700, MultiTech MT5634ZBA, and Actiontec  USB56012-01CW. USB keyboards are also supported, enabling players to type trash online.We tested Internet play using the LinkSys and a DSL modem; the action was very  smooth with no noticeable lag. On its own, this is a top-shelf title, but  considering its Internet capabilities, there's no reason for fans of sports,  action, and platform games not to ownTony Hawk's Pro Skater 3. This game  will satisfy them all.--Raymond M. PadillaPros:First Internet-capable PS2 gameTight, addictive, outstanding gameplayGargantuan levels and plenty of objects to interact withCons:Some minor graphics glitches", "price": 24.0, "imUrl": "http://ecx.images-amazon.com/images/I/51xtLqSmIdL._SY300_.jpg", "related": {"also_bought": ["B00006IJJE", "B0000A082Y", "B00004TEXU", "B0002CNUN0", "B00001QED2", "B0009Z3HMY", "B001IV0Y7O", "B00005NUJ3", "B00009WAVI", "B00004U5VF", "B00004YRQ9", "B00005J536", "B000TEJFK8", "B00005ML0Z", "B0002RQ3ES", "B0000696CZ", "B00005CF9L", "B00004YRQA", "B000TLU67W", "B00005O0I2", "B0001VGFK2", "B000G810DC", "B0000664JF", "B000KCX9M4", "9629971372", "B0000A0MDV", "B0009SQF0C", "B00005ML10", "B00006GSNX", "B0002IQC8E", "B00006JN5H", "B00005BK7X", "B00005BIG7", "B0002CHJ8C", "B0000503MO", "B000095ZH5", "B0000B0MNH", "B000G6SPHI", "B0045L3SNQ", "B00000I1C1", "B0002XL3BA", "B0000C4M22", "B0000A8VBZ", "B00005OLX1", "B0002Y2XXQ", "B0002IQCSY", "B00020LZAM", "B00005NOFU", "B00005NOD6", "B00005U8TQ", "B000099T2E", "B000B69E9G", "B00005NN5A", "B00020BV2E", "B00009ZVHY", "B00004TBGT", "B00005R5PO", "B0009351R0", "B000066TS5", "B0009O7HVM", "B0015MMN6G", "B000F0GX8I", "B0007PLKZM", "B000930DIM", "B00005V6BE", "B00075GLU6", "B0000C7GHG", "B00005NCCI", "B0006ZJPR8", "B00006F2ZP", "B00005NCCR", "B00009VE6D", "B00000I1BF", "B001ABN93I", "B000006RGS", "B00020LZBG", "B00019AZBO", "B00005NOFS", "B0002RQ3KC", "B000TYQL1O", "B000FW87AI", "B0002EJ8FC", "B0009I6S0O", "B0002B90OE", "B00005V6BB", "B0032GTMEE", "B00175GC4K", "B0000690ZE", "B00005V6B9", "B0001ADAME", "B00004U5VS", "B000EHQDA0", "B001MW91IW", "B0002B90OO", "B00000DMAR", "B00008H2IW", "B000GA966I", "B00005MA97", "B0000AHOYR", "B0009350BW"], "bought_together": ["B0000A082Y"], "buy_after_viewing": ["B0002CNUN0", "B0000A082Y", "B00006IJJE", "B00004TEXU"]}, "salesRank": {"Video Games": 4945}, "categories": [["Video Games", "More Systems", "PlayStation 2", "Games"]]}