{"asin": "B005I6DVC0", "related": {"also_bought": ["B003F7DWH8", "B005N1QL54", "B003VNKNEQ", "B003VKYQQA", "B006IW81K0", "B00F0XS1V2", "B004W4J830", "B002I03UPW", "B00F0XRQGS", "B0039BPG4C", "B00908BQCY", "B003CJTQJC", "B007JRB0SS", "B003VNKNF0", "B004DBE080", "B00A3XCXRC", "B002FU6K9I", "B003ZSHNG8", "B0039BPG1A", "B00006CFDO", "B004TRR3NM", "B00BT80QH4", "B007JRB0TC", "B00339NINQ", "B00DUGZDJ4", "B004NPWFP6", "B004RP2VNI", "B00DUGZEWK", "B007M51J42", "B00AQDGCNA", "B007Y4NWQE", "B0020ZDI5C", "B00812K4V4", "B004H3XNB4", "B003IHV6YG", "B008V0H284", "B00JHKSN5I", "B003VKR8O2", "B00CWNMR5Y", "B002MKGDPW", "B007BJHETS", "B000FGNM6I", "B004EFT2BU", "B00AWYMXZY", "B0000DC4EL", "B000XSA60I", "B00F0XRFAK", "B00B7ID97A", "B00EFILR6E", "B003VNKNEG", "B001W1BSM0", "B003SP4QAE", "B0062FZ3PY", "B00B5HE1SY"], "bought_together": ["B003VNKNEQ", "B003F7DWH8"], "buy_after_viewing": ["B00EFILR6E", "B003VNKNEQ", "B003VNKNF0", "B00EFILPHA"]}, "title": "Canon PowerShot SX150 IS 14.1 MP Digital Camera with 12x Wide-Angle Optical Image Stabilized Zoom with 3.0-Inch LCD (Black)", "price": 123.0, "salesRank": {"Electronics": 1653}, "imUrl": "http://ecx.images-amazon.com/images/I/41DeTbM4a0L._SX300_.jpg", "brand": "Canon", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Memory-Making Made EasyDiscover how simple and easy it is to be creative and shoot memorable photos and videos of your favorite subjects with the PowerShot SX150 ISdigital camera. Its compact size makes it convenient to carry around everywhere to capture those special moments that can happen anytime! Sporting a stylish design, it comes in two great colors: Black and Red. 14.1 Megapixels deliver stunning image detail and enable you to make beautiful large prints. 12x Optical Zoom lets you get close to distant subjects, while the 28mm wide-angle capability makes this camera great for photographing large groups of people and scenic landscapes. Advanced technologies, such as Intelligent IS and Smart AUTO, make it easy and effortless to capture gorgeous still images and HD video. It all makes the PowerShot SX150 IS the perfect camera to capture the good times, wherever you might be.Precision Canon Optics12x Optical Zoom with 28mm Wide-Angle LensThe PowerShot SX150 IS features a powerful Genuine Canon 12x Zoom Lens that delivers outstanding optical performance and versatility. With precision engineering and decades of leadership in optical technologies, Canon has created a bright, wide-angle lens that provides an extraordinary 12x zoom range. The lens starts at 28mm wide-angle and extends to 336mm telephoto (35mm equivalent), giving you tremendous coverage and reach. The telephoto end lets you capture subjects from a considerable distance, while the 28mm wide-angle makes it easy to shoot sweeping landscapes, large groups of people and tall buildings. Moreover, this superlative lens incorporates innovative designs that enable it to fit the compact profile of the PowerShot SX150 IS and perform at high speed with low power consumption.Optical Image StabilizerHandheld shooting can often lead to camera shake, making photos and videos blurry. Canon&rsquo;s Optical Image Stabilizer is a sophisticated system that uses lens-shift technology to correct for unwanted camera movement. It makes handheld photography more practical in more shooting situations, providing excellent image quality in many difficult situations: outdoors at dusk, inside without a flash, and even at the telephoto end of the zoom range without a tripod. For still photos, it enables shooting at slower shutter speeds, accommodating more low-light shooting situations than ever before without having to boost ISO sensitivity. With camera shake and vibration reduced, you get a sharper, steadier image. And because it is an optical system, there is none of the image degradation typical with electronic image stabilizers.Powerful Performance for Better Images14.1 Megapixel SensorA 14.1 Megapixel sensor delivers beautiful photos with fine detail and brilliant color. The high resolution ensures superb image quality even when cropping or making very large prints.&nbsp;&nbsp;&nbsp; &nbsp;Canon DIGIC 4 Image ProcessorCanon DIGIC Image Processors have set the standard for functionality and performance since their groundbreaking introduction in 1999. With each successive generation, DIGIC processors have brought elevated performance and powerful new features to PowerShot digital cameras. The DIGIC 4 processor has ushered in a new level of picture quality and accelerated processing, making possible features such as high-speed continuous shooting, Full HD video and Face Detection Self-timer. New, more powerful noise reduction algorithms also provide improved low-light capture.A Smarter Camera Means Better Photos and VideosSmart AUTOThe PowerShot SX150 IS features Smart AUTO &ndash; sophisticated Canon technology that makes getting that great shot as simple as pressing the shutter button. Smart AUTO automatically detects scenes by assessing various factors in both the background and the subject. Detected scenes are analyzed using 32 predefined shooting situations. The camera then makes optimal settings to ensure the best possible image capture, whether you&rsquo;re shooting stills or video. Smart AUTO also includes Advanced Subject Detection, which allows the camera to detect and track non-human moving subjects like animals and vehicles. With Smart AUTO, all you have to do is frame your shot and capture away.Shooting Modes/Special Scene ModesSmart AUTOThe camera automatically selects the best shooting settings for optimal quality based on subjects and environmental factors to provide point-and-shoot simplicity.Kids &amp; PetsReduced focusing time freezes fast-moving subjects, so you won't miss those special shots.PortraitThe camera sets a large aperture, focusing the subject and artistically blurring the background to make your subject &ldquo;pop.&rdquo;ManualYou have complete contrl of exposure, selecting both aperture and shutter speed manually.&nbsp;&nbsp;&nbsp;Low LightFor high quality image capture in an amazing range of dimly-lit situations.Toy Camera EffectSimulates photos taken with \"toy\" or pinhole cameras, darkening the image at the edges to create a vignette effect.Poster EffectPoster Effect combines several similar shades into one color, turning subtle gradations into eye-catching, scene-popping contrasts.BeachBeach Get clear shots of people at a sunny beach without darkened faces.FireworksGrab brilliant images of skyrocketing fireworks.Aperture-PriorityYou set the aperture, controlling depth-of-field. The camera automatically selects the shutter speed.&nbsp;&nbsp;&nbsp;ProgramAccess advanced exposure compensation features while shooting mostly automatically.Fisheye EffectAdd a classic photo distortion without a fisheye lens.Shutter-priorityYou select the shutter speed to stop or blur action, and the camera finds the appropriate aperture. With slow exposure times, Canon's noise reduction system activates to ensure low image noise.MonochromeChoose from three single-tone effects: Black-and-White, Sepia, or Blue.Color AccentChoose to retain a single color in your image while other colors turn monochrome.FoliageCapture brilliant shots of autumn foliage, greenery and blossoms.LandscapeIncreases depth-of-field for sharp and sweeping landscape shots.&nbsp;&nbsp;&nbsp;Movie DigestRecords a video clip before capturing a still image and then combines one day&rsquo;s worth of clips into a video.Smart ShutterThe camera automatically takes the photo when people smile, wink, or get into frame.Discreet ModeDisables flash, AF assist beam, and all camera sounds with one mode dial setting &mdash; so you can capture images in quiet areas.Miniature Effect for Movies &amp; StillsEmphasizes perspectives for a miniature effect by blurring upper and bottom portions of the image.Super Vivid SuperVivid intensifies existing hues, saturating the scene with bright colors.Color SwapSelect a color and replace it with a color you specify for special effects.SnowShoot clear snow scenes without darkened subjects or an unnatural bluish tint.iFrame MovieThe Apple&reg; movie format, iFrame, makes it easier and quicker to import and upload videos while retaining high image quality.MovieRecord video in stereo sound. Unwanted scenes can be deleted in playback mode.Easy ModeIn Easy mode, shooting is simple and relaxed&mdash;the camera handles all the settings automatically.Turn Any Moment into an HD Video MemoryCanon HD Video Advantage&#x2028;The PowerShot SX150 IS lets you record spectacularly detailed 720p HD video at 30* frames per second with clear stereo sound. Imagine the fun and excitement of being able to shoot high definition video whenever you want, then downloading the videos to your computer to watch or share with family and friends.*Actual frame rate is 29.97 fps.Dedicated Movie Button, Wind Filter and Optical Zoom While ShootingIt&rsquo;s never been easier to shoot videos with a PowerShot digital camera. The PowerShot SX150 IS has a dedicated movie button that lets you start and stop recording instantly. There is no need to go through layers of menus or operate switches or dials to switch to and from video recording mode. The camera is always ready to shoot stills or video whenever you want. The PowerShot SX150 IS also incorporates an electronic wind filter, which suppresses wind noise that can muffle or distort the sound. And unlike less sophisticated point-and-shoot cameras, the PowerShot SX150 IS lets you use the full 12x range of optical zoom when you&rsquo;re shooting a video without sacrificing HD video resolution.iFrame Movie SupportWith the PowerShot SX150 IS, you can also shoot video in the Apple iFrame format, which is a computer-friendly standard that speeds up importing and editing of videos. It keeps file sizes small, making it more convenient to upload or e-mail high-quality videos. The iFrame format enjoys native support in compatible Mac and Windows video applications, making it unnecessary to perform time-consuming and often quality-degrading conversions.A Steady Image Is a Beautiful ImageIntelligent ISThe latest advance in Canon Optical Image Stabilization technology, Intelligent IS analyzes camera movement and applies the best shake correction method for the shooting situation. For stills, the system automatically selects among Normal, Panning, Macro (Hybrid) and Tripod IS modes. When shooting video, the system automatically selects among Dynamic, Powered, Macro and Tripod IS modes. With Intelligent IS, you can concentrate on image capture, letting the camera make the most effective IS settings to assure the steadiest possible image.NormalCorrects for a wide range of camera movement when shooting stills.PanningPanning motion is detected so that IS does not interfere with desired camera movement.HybridCorrects for shift-type camera shake, which typically occurs in macro (close-up) shooting.DynamicEffective for video shooting at wide-angle focal lengths, eliminating the unwanted shaking that typically occurs while walking.PoweredCompensates for hand movement when shooting video at the telephoto end of the zoom range, where camera shake is magnified.TripodWhen tripod use is detected, the Image Stabilizer is stopped because it is not needed.See the Image in a Big ScreenLarge 3.0-inch LCDThe camera's high-resolution (230,000 dots) 3.0-inch LCD gives you the big picture, whether you're shooting, reviewing or showing off your images. This high-resolution screen offers a crisp, clear picture to make shooting, playback and using the camera's menu functions especially convenient. Clear and bright, it also features Night Display for easy viewing in low light.Power on the GoAA Battery PoweredRecharging batteries can often be an inconvenience, especially when traveling in foreign countries. With the PowerShot SX150 IS, you&rsquo;ll never need special power adapters or chargers because it&rsquo;s powered by two AA batteries that are widely available around the world.Easier, More Enjoyable PhotographyFace Detection TechnologySpecial Scene ModesBest Image SelectionWhat&rsquo;s in the Box&bull; PowerShot SX150 IS Body&bull; 2 AA-size Alkaline Batteries&bull; Wrist Strap WS-800&bull; USB Interface Cable IFC-400PCU&bull; Digital Camera Solution CD-ROM"}