{"asin": "B00328HR76", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Capture stunning low-light images and sweeping panoramic views with the DSC-HX5V featuring an \"Exmor R\" CMOS Sensor. Plus catch fast action shots with up to 10 frames per seconds shooting. Full HD Movie Mode records amazingly detailed video and a 25mm equivalent wide angle 10x high-zoom G Lens allows you to take captivating images.Frame your shots on a 3-inch LCDSony DSC-HX5V Highlights3.0-inch Clear Photo LCD display (230k pixels)Compose and show off your images on the large 3.0-inch (230K) Clear Photo LCD display, which features a special anti-reflective coating for sharp visibility, even in bright sunlight.10x (25mm) professional-quality optical zoom G-LensG lenses are used in top of the line digital single lens reflex (DSLR) cameras and advanced pro-sumer HD Camcorders. Capture the action up close with the 10x optical zoom, and with the 25mm equivalent wide angle lens the HX5V even allows you to capture more of the scenes in landscape or group portraits.10.2-megapixel, back-illuminated \"Exmor R\" CMOS image sensorThe DSC-HX5V features a 10.2-megapixel \"Exmor R\" CMOS image sensor that brings out the full resolving power of the camera's wide angle G lens to deliver extremely fast speed, high resolution, and stunning low-light sensitivity with improved image clarity and drastically reduced grain. In addition, the combined \"Exmor R\" CMOS sensor and BIONZ image processor delivers extremely fast 10fps, Anti Motion Blur, Hand-held Twilight and 1080i movie modes.Anti-Motion Blur ModeCapture cleaner and sharper images in low light for non landscape shots. When set in Anti-motion Blur Mode, the DSC-HX5V captures six images in a fraction of a second with higher shutter speed and combines the data from all six to create a single image of extraordinary detail and eliminate subject blur, beyond the capability of traditional cameras.Intelligent Sweep Panorama ModeCapture expansive landscapes with Intelligent Sweep Panorama Mode. Press shutter and sweep and the camera does the rest, continuously, shooting images and in one second stitching them together. This model even detects faces and moving subjects to stitch intelligently different widths to avoid subject distortion.Handheld TwilightCapture cleaner and sharper night shots without using a tripod. When set to Handheld Twilight Mode, the DSC-HX5V captures six images in a fraction of a second with one press of the shutter, and combines the data from all six to create a single image of extraordinary detail and low noise. With these modes, you can capture images in low light, without flash, beyond the capability of traditional cameras.Capture 10 frames per second at full 10.2-megapixel resolutionHigh Speed Shooting (10fps)The HX5V can capture full 10.2-megapixel resolution images at up to 10 fps, helping to ensure you never miss the decisive moment. What's more, the HX5V employs a mechanical shutter that helps reduce distortion when continuously shooting moving subjects.1080i AVCHD Movie ModeRecord movies in 1080i AVCHD high definition at 60i. The AVCHD format captures a high degree of detail and smooth movement, and when footage is burned to disc, can be played back on Blu-ray Disc players, Sony PlayStation3 systems and compatible PCs and HDTVs.HDMI outputThe High-Definition Multimedia Interface (HDMI) is a compact audio/video connector interface for transmitting uncompressed digital streams. HDMI connects digital audio/video sources such as a compatible camcorder, Blu-ray Disc player, a personal computer, a video game console, or an AV receiver to a compatible digital audio device and/or video monitor such as a digital television (DTV).DVDirect DVD recorder compatibleWith AVCHD capabilities the DSC-HX5V is compatible with the DVDirect DVD recorder, allowing automatic playback of high definition footage. Simply insert your Memory Stick media into the DVDirect DVD recorder and enjoy your movies shot in high definition. (Recorder and media sold separately)HD MP4 Movie ModeMP4 is a popular format for high definition video that compresses the size of your audio and video, making your media files small enough to easily transfer to your compatible PC or Mac. MP4 is also highly compatible with the Web, so you can effortlessly upload your media to popular photo or video-sharing Web sites like Photobucket or YouTube. (Compatible PC with internet capability required).Active ModeOptical SteadyShot image stabilization with Active Mode represents the next step forward in Sony image stabilization technology, and allows the camera lens a greater range of motion for a superior level of image smoothness. Now you can capture smooth movies on your camera while on the move.Optical SteadyShot image stabilizationOptical SteadyShot image stabilization uses a built-in gyro sensor to detect camera shake and automatically shifts the lens to help prevent blur without sacrificing image quality.GPS and CompassAn integrated GPS receiver and compass record the location and direction of every shot you take and let you view your images on a map with compatible computer and internet applications, so you can remember where you took your favorite shots.TransferJet technologyTransferJet technology, developed by Sony and advanced and promoted by consortium of 18 other companies, allows you to transfer files between two TransferJet enabled devices just by touching them together, without the hassle of hunting for cables or the complication of pairing.BIONZ Image ProcessorThe BIONZ image processor delivers the high resolution and fast performance you expect from a Sony digital camera. Fast processing enables unique Sony features such as Sweep Panorama, Handheld Twilight, Antimotion Blur, HDR, etc to take and combine multiple images in less than a second to create wide panoramic images. Images have reduced grain and appear less washed out.Backlight Correction HDRShooting high-contrast scenes can often lead to washed out backgrounds and details lost in shadow. Backlight Correction HDR helps correct for this by taking two pictures at different settings and processing the best elements of both into a single image.Self-Portrait TimerSelf-Portrait Timer helps take the guesswork out of self portraits by utilizing Face Detection technology to recognize when your face enters the frame. Once the camera detects your face, it triggers a 2-second timer, and then snaps a picture.Intelligent Auto (iAuto) modeUnlike traditional auto mode, Intelligent Auto (iAuto) mode thinks for you, recognizing scenes, lighting conditions, and faces, and adjusts settings resulting in clearer images, faces with more natural skin tone, and less blur. By incorporating advanced features such as Intelligent Scene Recognition, Face Detection technology, and Optical SteadyShot image stabilization, iAuto mode lets you take advantage of the latest Sony Cyber-shot technology without leaving auto mode. Whether you're shooting landscapes, capturing a beautiful flower, or taking pictures at an in-door birthday party or wedding shower, iAuto mode will optimize your camera's settings to help ensure you come away with a great shot.Intelligent Scene Recognition (iSCN) ModeIntelligent Scene Recognition (iSCN) Mode automatically detects eight different types of scenes and, within just 1/30th of a second, selects the appropriate camera settings: Backlight, Backlight Portrait, Twilight, Twilight Portrait, Twilight using a tripod, Portrait, Landscape, and Macro. iSCN has two modes: Auto and Advanced. In Auto Mode, the camera takes a single shot using the optimal settings.High Sensitivity Mode (ISO 3200)High ISO allows for faster shutter speed, so you can take photos indoors or in low light without the need for a flash. In addition to High Sensitivity Mode (ISO), you can select up to seven ISO settings (Auto, 100, 200, 400, 800, 1600, 3200) when shooting in Program Auto Mode to adjust sensitivity to your shooting conditions.Face Detection helps ensure you focus on the right subjectFace Detection technologySony's Face Detection technology can automatically distinguish between children and adults. Face Detection technology detects up to eight individual faces and adjusts flash, focus, exposure, and white balance to help deliver crisp, properly lit images of family and friends.Motion DetectionMotion Detection, along with Face Motion Detection adjusts ISO sensitivity and increases the shutter speed when movement is detected, reducing blur in moving subjects and faces.Anti-blink FunctionIt's frustrating to think you've captured that perfect shot, only to review it later and discover one of your subjects blinked just as you pressed the shutter. When the camera is set to Soft Snap, the Anti-blink function captures two images, recording only the photo with less squinting or blinking. If a blink is detected in other shooting modes, a warning will be displayed after you take the shot.Smile Shutter technologySmile Shutter technologySmile Shutter technology captures a smile the moment it happens. Simply press the Smile Shutter button and the camera does the rest. You can also select adult and child priority and indicate the degree of Smile Detection Sensitivity. Intelligent Scene Recognition can be used together with Smile Shutter mode. This means that beautiful smiles can be captured with settings optimized for the particular scene, even in difficult conditions such as twilight and backlighting.Scene ModesThe DSC-HX5V features 10 convenient scene modes: High Sensitivity, Twilight, Twilight Portrait, Soft Snap, Landscape, Beach, Snow, Fireworks, Advanced Sports Shooting, Gourmet, Pet.Intelligent AFThanks to Intelligent AF technology, capture fleeting moments like a child's adorable expression with the ultra-quick AF which locks focus in as little as 0.3 seconds.Scene ModesThe DSC-HX5V offers 8 diverse scene modes for various settings. Modes include: Backlight, Backlight Portrait, Twilight, Twilight Portrait, Twilight using a tripod, Portrait, Landscape and Macro.Easy Shooting ModeWith Easy Shooting Mode, even beginners can take great photos. In Easy Shooting Mode, easy-to-understand basic instructions are displayed on the LCD screen and the camera switches to all automatic settings, removing several function choices and allowing you to focus on just your subject. Since this mode works together with Intelligent Scene Recognition, the camera selects the optimum setting for each scene. In addition the easy mode simplifies preview mode.Function GuideThis beginner-friendly optional function helps navigate through the various functions and settings displaying the description of chosen functions or settings on the LCD screen.PHOTOMUSICPHOTOMUSIC combines images with music (4 tracks, 5 minutes per track) to produce fun and entertaining slide shows with standard visual effects (Simple, Nostalgic, Active, and Stylish). Select from pre-loaded tracks on the camera or transfer your own from your compatible computer (sold separately).Viewing modesFind your photos using the simple folder or calendar viewing modes.In-Camera Retouching ToolsRetouch and enhance your photos on the go with in-camera Trimming, Red-Eye Correction, and Unsharp Masking functions.PhotoTV HDBring your photos to life and enjoy highly detailed, high definition images with PhotoTV HD-capable Sony BRAVIA HDTVs. PhotoTV HD fine tunes settings on your PhotoTV HD enabled BRAVIA HDTV, such as sharpness, gradation, and color to display images that look more like printedLithium-ion batteryIncluded lithium-ion battery provides added convenience with longer lasting power than alkaline batteries.Media card slotFor convenient storage and sharing of your images, the DSC-HX5V accepts Memory Stick Duo/Memory Stick PRO Duo/Memory Stick PRO-HG Duo media (sold separately).SD Card FunctionalitySony SD memory cards are the perfect solution for storing and sharing your digital content such as high-quality photos, videos, music, and more.Includes Sony PMB (Picture Motion Browser) Software ver. 5.02Sony Picture Motion Browser software offers a simple, intuitive way to transfer, sort, and view your video and still images on your compatible PC. In addition, multiple output options let you burn your memories to DVD (sold separately), as well as take advantage of one click upload to a number of popular video and photo sharing sitesIncludes Sony PMBP (Picture Motion Browser Portable) softwareWith the pre-installed Picture Motion Browser (PMB) Portable software the DSC-HX5V makes it easy to pre-select videos and images in the camera and conveniently upload them from the camera to a compatible PC and popular Internet sharing sites without the need for any additional software or install.", "title": "Sony Cyber-shot DSC-HX5V 10.2 MP CMOS 10x Wide-Angle Zoom Digital Camera with Optical Steady Shot Image Stabilization and 3.0 Inch LCD", "price": 17.49, "salesRank": {"Camera &amp; Photo": 3339}, "imUrl": "http://ecx.images-amazon.com/images/I/41x6o5vDbAL._SX300_.jpg", "related": {"also_bought": ["B00091S0WA", "B005DITH8U", "B0036GK3DO", "B003EEPS0G", "B003EENZC4", "B00308WFVQ", "B0034HDRH4", "B003PVCTWS", "B000MDZKUU", "B000BOLHH0"], "buy_after_viewing": ["B00CDIK48U", "B00CDIK48U", "B00B7ID99I", "B003VNKNEQ", "B003VNKNF0"]}}