{"asin": "B00170M64K", "description": "The LaCie Hard Disk 301315U 1 TB eSATA/FireWire 400/USB 2.0 External Hard Drive, Design by Neil Poulton is a sleek, sophisticated hard drive that offers high-speed performance and style to your desktop. With universal compatibility and a compact size, this portable drive lets you easily back-up and share your music, photos and video files with your friends and family..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The Lacie Hard Disk 1 TB eSATA/FireWire 400/USB 2.0 External Hard Drive, Design by Neil Poulton:Has 1 TB of disk space.Features eSATA, FireWire 400, and USB 2.0 interfaces for utmost speed and compatibility.Uses a fanless design for near-silent operation.Features a drive with 7200 RPM and 8 MB of cache for maximum performance.The gorgeous, minimalist case was designed by Neil Poulton.View larger.Three connection interfaces offers true universal compatibility and speed.View larger.Beautiful, Stunning DesignDesigned by internationally acclaimed designer Neil Poulton, the Hard Disk features sleek and sophisticated styling. The case is entirely black with a fashionable, mirror-polished finish. A cool, blue LED strip on the bottom casts an ambient glow. The ultra-minimalist look will blend perfectly into home entertainment setups and workstations.But don't think the design is just about looking good. Built to optimize heat dissipation so that it can operate without a fan, the drive is also designed for convenience and portability. At just 4.6 x 1.8 x 7.6 inches (WxHxD) and weighing barely two pounds, it can be easily transported into your briefcase, allowing you to shuttle files between your home and office, or move your work between your laptop and desktop with ease.More Space for More MediaWith 1 TB of disk space, the Hard Disk can store up to 70 hours of DV video, 270,000 songs, or over a million photos. Instead of having all this data stored on an internal drive on your desktop computer that can't be moved around, imagine being able to carry your entire digital media collection with you on your travels. You can also use the drive to back up your computer files for extra security.Fast Performance and Exceptional CompatibilityWith three connection interfaces, you'll be able to get the hard drive up and running quickly with your computer at home, your laptop at work, and just about any computer you need to connect to. The eSATA interface allows for a blistering 1.5 Gbps data transfer speed, perfect for video editing and other intensive work. FireWire 400 is also supported, which has long been a favorite of Mac users and provides 400 Mbps speeds. The nearly universal USB 2.0 interface is supported as well, and offers a transfer rate of up to 480 Mbps.The LaCie Hard Disk works with both Macs and PCs and is simple to setup. It's plug and play and offers automatic formatting with LaCie Setup Assistant with customizable features. The hard disk features a rotational speed of 7200 RPM and has a cache of at least 8 MB, providing performance that won't keep you waiting for your files to backup or your media to play.The drive is compatible with Windows 2000, XP, and Vista, as well as Mac OS 10.3 or higher. Included in the box is LaCie's 1-Click Backup Software (Windows and Mac), as well as LaCie SilverKeeper Backup Software (Mac) making backups an easy and painless process.The LaCie 1 TB eSATA/FireWire 400/USB 2.0 Hard Disk, Design by Neil Poulton is backed by a 2-year limited warranty.About LaCieEstablished in France in 1989, LaCie is a leading manufacturer of computer peripherals for Windows, Apple and Linux users. With offices and plants in the USA, Canada, Japan, Australia, Europe, Singapore and Hong Kong, LaCie develops and manufactures external storage solutions and color monitors that help professionals and everyday people easily manage their digital lives. LaCie has differentiated its products through original designs and leading-edge technology.What's in the BoxLaCie hard disk, USB 2.0 cable, eSATA cable, FireWire 400 cable, external power supply, quick install guide, LaCie utilities (preloaded on drive), user's manual, backup software.", "title": "LaCie Hard Disk 1 TB FireWire 400/USB 2.0/eSATA External Hard Drive, Design by Neil Poulton 301315U", "price": 15.4, "imUrl": "http://ecx.images-amazon.com/images/I/3186U1zbkZL._SX300_.jpg", "related": {"also_viewed": ["B0010YWPZ8", "B0058VIXBY", "B001KFH6K6", "B00CO1HUGU", "B005C2BNJI", "B002LZV0B0", "B00829TIIQ", "B00352LSYW", "B0012GTJXU", "B0058VIWTM", "B00829THH8", "B00CO1I2C6", "B00A3U8JV4", "B009VQ7KPM", "B0042KFLJE", "B00829TIEU", "B0055Q2VS8", "B00AK9ZT98", "B00AX9ZAHG", "B00655YT9C", "B00BTCWZW4", "B005C2BNKM", "B009GXI3QU", "B009PK6VWM", "B003DTK1HC", "B002LITG7M", "B009HQHPB0", "B008SA63Y6", "B00965HKK8", "B00H4XH5FY", "B0000CDJPQ", "B00829THEG", "B0078T11QS", "B00AN5PUSE", "B0050SI9W8", "B00E6N9GS4", "B004IYJX0M", "B004IYJX1G", "B009VQCHS2", "B005ELBSWO", "B0073SQ4P2", "B00829THK0", "B005KT2FYK", "B00BTCWZWE", "B00BTF2ENQ", "B00GE97LLC", "B004E9SGUO", "B008SA69L8", "B008SA6A1C", "B00AJJIWG6", "B007A1FXUO", "B00H4XH5GI", "B00H4XH5IG", "B004QGXOOI"], "buy_after_viewing": ["B0078T11QS", "B00834SJS0", "B00E83X9P8", "B0010YWPZ8"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]]}