{"asin": "B0052B9QOI", "description": "Why get a TouchTec II Pen when there are so many other choices?  We were the first to market with this product back in 2009 (Pat Pend PCT/US2010/040361), not one of the copy cats, and have used our extensive customer feedback to develop and deliver a great solution. TouchTec Pens offer a premium ball point pen and stylus for the iPad and other capacitive touch devices.  With a high-end look and natural, weighted feel of a real pen, we enhance your capabilities for drawing, sketching and note taking on an iPad or other tablet PCs and paper, too. \nSimple but elegant, the TouchTec Pens offers users a premium experience for note taking, sketching, drawing, and other forms of creative expression. The TouchTec Pen is highlighted by its sophisticated design and balanced weighting.\nWe offer two different tip sizes, 6mm and 8mm diameter so you can chose what works best for you. Combining ergonomic comfort and a firmer feel, the TouchTec Pen and Stylus offers a premium ink and digital inking experience for handwriting notes, highlighting text, editing documents, drawing, sketching and much more.\nTouchTec Pens brings a more accurate and precise way to take notes in meetings and classroom settings, or to sketch out rough ideas while on the go. For example, users can improve their input experience with numerous applications developed for iPad, such as PenultimateTM and Notes Plus for note taking and Autodesk SketchBook Mobile for sketching needs.", "price": 29.96, "imUrl": "http://ecx.images-amazon.com/images/I/31NXGdtr7dL._SX300_.jpg", "related": {"also_bought": ["B005KSS5VI", "B008CO9PZC", "B004Z3KOAE", "B006Y38SWY", "B0064REJ3C", "B0076POAPS", "B007E36ZGO", "B007XXLPHE", "B006VW6FQE", "B007PFYHHU", "B008EYCTDK", "B009UUA1CI", "B004Z3K2O2", "B0064X1HFE", "B007BISX7Q", "B008A20FVE", "B006K27DC0", "B004BSF1I8", "B007FXMOV8"], "buy_after_viewing": ["B00931K1QK", "B0064REJ3C", "B007FXMOV8", "B00CA66YGQ"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Input Devices", "Graphics Tablet Styluses"]]}