{"asin": "B000BWACX2", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "FM Transmitters"]], "description": "The Griffin 9501-TRIPCB iTrip Auto FM Transmitter and Auto Charger for iPod combines Griffin's renowned FM transmitter technology with an integrated charger. Designed specifically for use in the car, the iTrip Auto powerfully transmits clear music from your iPod through your car stereo, while the large, easy-to-read backlit LCD screen affords quick, precise station selection and status at a glance.The Griffin 9501-TRIPCB is the most versatile iTrip to date, accommodating every dock connector iPod, including the iPod nano and fifth-generation iPod videos. The iTrip Auto uses the audio line out from the iPod's dock connector and optimizes the output volume, allowing speaker volume to be controlled solely from the car stereo controls, without having to adjust the iPod's volume level. This unit features all the innovations of its predecessors, including selectable LX and DX modes for best-quality audio under real-world conditions, best-possible RF technology, and Griffin's world-class industrial design.The Griffin iTrip Auto is constructed with a built-in FM stereo antenna and a high-stability crystal oscillator with phase-lock loop control. This unit can operate anywhere from the 88.1 to 107.9 MHz frequencies, with a frequency response ranging from 50 Hz to 15 KHz, at a range from 10 to 30 feet. The 9501-TRIPCB is powered by an included 12-volt cigarette lighter power adapter that features an easily replaceable fuse through which it also charges your iPod. This unit comes in black, weighs 0.6 ounces, measures 0.49 x 2.84 inches (W x D) with a total length of 33.47 inches (including the cord), and it's backed by a manufacturer's limited one-year warranty.iPod CompatibilityiPod nano 1G,iPod nano 2G,iPod mini,iPod 3G,iPod 4G (click wheel),iPod color,iPod video 5G/5.5G.", "title": "Griffin iTrip Auto FM Transmitter and Auto Charger for iPod (Black)", "price": 19.57, "imUrl": "http://ecx.images-amazon.com/images/I/31RUXEAR3OL._SY300_.jpg", "brand": "Griffin Technology", "related": {"also_bought": ["B0009QU7US", "B003II9MPA", "B001DQL66M", "B000WKPHHO", "B001LYOGRM", "B001HN6JK4"], "bought_together": ["B0009QU7US"], "buy_after_viewing": ["B001DQL66M", "B001HN6JK4", "B003II9MPA", "B000WKPHHO"]}}