{"asin": "B000JO7PIM", "description": ".caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; }An anodized aluminum top and polished stainless steel back. Five eye-catching colors. A larger, brighter display with the most pixels per inch of any Apple display, ever. iPod nano stirs up visual effects from the outside in.And it'll wow you for hours. Play up to 5 hours of video or up to 24 hours of audio on a single charge. All that staying power and a wafer-thin, 6.5-mm profile makes iPod nano one small big attraction.Cover FlowIf a picture says a thousand words, think of what all the album art in your collection might say. With Cover Flow on iPod nano, you can flip through your music to find the album you want to hear. Use the Click Wheel to browse music by album cover, then select an album to flip it over and see the track list.In addition to listening to music you can now enjoy TV shows, movies, video podcasts, and more.View iPod nano dimensions.The iPod nano comes in a host of exciting new colors.Play up to 5 hours of video or up to 24 hours of audio on one charge.View larger.MusicUse the Click Wheel to adjust volume, navigate songs, browse in Cover Flow, or explore the Music menu by playlist, artist, album, song, genre, composer, and more. Want to mix things up? Click Shuffle Songs. iPod nano makes your music look as good as it sounds, thanks to its bright color display.MoviesBuy movies from the iTunes Store and you can sync them to your iPod nano to watch anywhere, anytime. Up to 5 hours of video playback means you can watch two movies back to back. And for your viewing pleasure, the 320-by-240-pixel display--with a whopping 204 pixels per inch--is 65 percent brighter than before.TV ShowsThere's always something good on iPod nano. Browse thousands of episodes of your favorite TV shows on the iTunes Store, buy them for just $1.99 each, then sync them to your iPod nano. Watch last night's episodes this morning, or buy a whole TV series and play a pocket-size marathon.PodcastsThe iTunes Store features thousands of free video and audio podcasts, including indie favorites and offerings from such big names as ABC News, Comedy Central, ESPN, PBS, NPR, and many more. Browse and subscribe to podcasts, then sync them to your iPod nano. You can even play video podcasts on TV using an optional Apple component or composite AV cable.AudiobooksThe digital shelves of the iTunes Store are stocked with thousands of audiobooks--including exclusives like the entire Harry Potter series--so you can catch up on your reading wherever iPod nano takes you. iPod nano even recognizes where you left off reading and bookmarks your place.GamesPut hours of fun at your fingertips. iPod nano comes with three games--Vortex, iQuiz, and Klondike--and you can download more from the iTunes Store for $4.99 each. All iPod games are designed specifically for the iPod interface. And all of them look great on the 2-inch color display.PhotosiPod nano holds up to 7,000 photos you can sync from your Mac or PC via iTunes. Use the Click Wheel to scroll through photo thumbnails. To see a photo full screen, click the center button. You can even view your photo slideshows--complete with music and transitions--on a TV using an optional Apple component or composite AV cable.ExtrasCalendars, contacts, and a screen lock appear in the Extras menu, along with a few more handy items. Take the world clock, for example. Spin the Click Wheel to choose different clocks for cities all over the world. For workouts, use the built-in stopwatch to log your best times.", "title": "Apple iPod nano 4 GB 3rd Generation (Silver)  (Discontinued by Manufacturer)", "price": 162.95, "imUrl": "http://ecx.images-amazon.com/images/I/21qb6grULjL.jpg", "related": {"also_bought": ["B000YZCF5Y", "B000Y3R5HY", "B0077DWGE6", "B000W2MW7U", "B001670IM6", "B000XUL0EW", "B000GQ5U08", "B001RY5U94", "B000EP4TWQ", "B002SNGDQW", "B000VXT1B0", "B0016P15E8", "B002AYIWT0", "B0077DWTLQ", "B000VXPEC0", "B000WOGA6C", "B00166YXN2", "B000JO3N3S", "B001BFENH4", "B003TYUDSI", "B00G7478I0", "B00G74FNUK", "B003TYNSQW", "B000VLVG42", "B001FA1NCI", "B0010YQ4TQ", "B003L18Z8E", "B000XRZ9UQ", "B000XUQZEM", "B0002OZXHO", "B0047I5TP2", "B001FA1O0O", "B000KE48CM", "B003SX0NFI"], "buy_after_viewing": ["B000JO3N3S", "B0097BEDTC", "B000EP4TWQ", "B000JO7T7E"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}