{"asin": "B0000BVGOM", "description": "Unreal Tournament 2004is a multiplayer first person shooter that combines the kill-or-be-killed experience of gladiatorial combat with cutting-edge technology. Ten game modes, both team-based and \"every man for himself,\" provide even the most hardcore gamer with palm-sweating challenges through unbelievably detailed indoor arenas and vast outdoor environments. As the ultimate techno-gladiator of the future, players will take their fates into their hands, battling against up to 32 other players online in action-packed, frag-filled arenas.Guns. Lots of guns.Reload, rev up and ride out. The new Tournament is faster, higher and meaner. Land and air based vehicles take combat to a new level; while an arsenal of new weaponry, daunting arenas and battlefields and the challenge of the Assault and Onslaught modes make the gladiator blood sport of the future a brand new experience. Buckle up; it&#146;s gonna be one hell of a ride!New ModesAssault Mode - Assault mode returns! Redesigned forUT2004, this fan-favorite mode sees teams face-off to defend and attack fortified bases, from fast-moving trains, barreling across an arid alien desert to a Skaarj mother ship, poised to attack the human home world.Onslaught Mode- Onslaught mode takes team combat to the next level! Opposing teams are pitted against each other to capture and hold strategic points in order to attack and destroy the enemy power core. Taking place in massive outdoor environments, here is where vehicular combat comes into its own. Flying and driving machines take combatants to the frontline and gigantic mobile battle stations serve as a platform from which to launch devastating attacks.VehiclesTake a spin in armor-plated luxury.Rev-up and ride out in an array of land-, air-, and space-based vehicles that play critical roles in a successful combat strategy in Assault and Onslaught. With vehicles ranging from single man fighters to five man behemoths,Unreal Tournament 2004provides players with plenty of choices when shopping for a mechanized implement of destruction.LevelsDocking Bay 94 it isn't.More than 95 maps will be available immediately, including more than 45 brand new maps for all existing game play modes as well as new modes of play. Vast outdoor environments, deep space combat areas and tightly packed indoor techno-arenas are all waiting for the latest entrants to the Tournament.WeaponsThe entire smorgasbord of frag-dealing weaponry fromUnreal Tournament 2003returns for the experienced player to wield masterfully against new contestants. Those armaments are joined by three new implements of doom: the Mine layer, which disperses spider-like bombs that chase and harass any enemy that comes within range; the anti vehicle rocket launcher, or AVRiL, which deals out a payload of massive rockets tuned to seek and destroy enemy mechanized units; the Grenade Launcher, which launches timed explosives that will bounce on the ground and stick to enemies and enemy vehicles, only to be triggered by the weapons altfire command; and, the return of the notorious Sniper Rifle from the original Unreal tournament, completely redesigned and upgraded to make heads roll.New CharactersMeet new, interesting people--and kill them.Unreal Tournament 2004introduces 32 new characters on four new teams: The human Thunder Crash, lead by Tournament hero, Malcolm; the Robotic Corrupt, lead by an upgraded Xan Kriegor; the Iron Skull, a team of merciless Skaarj warriors; and the Hellions -- reckless human mercenaries and pirates who delight in the thrill of the kill.New TechnologyUnreal Tournament not only brings new content for hardcore fans to relish, it also delivers a tremendous technology update over its predecessor, delivering a faster, slicker, deeper experience than ever before. New technological features include:Voice-over IP support - command and coordinate. Give orders, rally your troops or talk smack with the enemyVoice recognition - give orders to bots; no more typing when you should be fightingCompletely redesigned menus, including a new server browser with right-click menus and many brand-new configurable featuresImproved AI: vehicle control, advanced dodging and wall-dodging, improved aim, better team coordinationDeeper single player mode with comprehensive team management options, challenge matches, multiple endings and moreIntegrated map vote and match set-up for Internet play UnrealTV - a proxy broadcast system allowing a huge number of spectators to watch a match live over the InternetPixomatic software renderer allowing incredible performance with no 3D card required- PlayUT2004on your laptopA re-designed HUD, improved weapon effects (bullet decals, incredible explosions), improved first person weapon rendering and innumerable improvements for mod authors, new announcer voices, rendering optimizations...the list goes on!", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/51YD336EYAL._SY300_.jpg", "related": {"also_bought": ["B000GRB4G6", "B000065SQJ", "B00009TW6R", "B001TM3NXE", "B001E6DG6Y", "B00006C2HA", "B00004YC3U", "B00005Y4Q1"], "bought_together": ["B000GRB4G6"], "buy_after_viewing": ["B000GPVUUS", "B000GRB4G6", "B000O5K3TO"]}, "salesRank": {"Video Games": 8378}, "categories": [["Video Games", "PC", "Games"]]}