{"asin": "B00CG0CL1S", "related": {"also_bought": ["B007U7M0WC", "B007U7M0L8", "B0084BPZO8", "B00H5HFEUM", "B00BP48U6Q", "B009PLLF9K", "B007U7M022", "B00D38UBJ6", "B0088LQZOI", "B00CP4J7OY", "B004Z7H14M", "B0089RPUH4", "B004MWN0Y0", "B00BRCNAE8", "B007U7M02C", "B007CS1908", "B008DFT7RQ", "B00D1HK3S8", "B007U7M0KE", "B0038AR75K", "B004MWP390", "B0038AT564", "B004Z7H1OW", "B00CKH6AGE", "B00CG0CM3U", "B00CN8AI2M", "B0038APBDA", "B00CN8AGA6", "B00CS1WDBI", "B007U7M0LI", "B007U7M0WM", "B00AOHDC5E", "B009PLLFAO", "B0090A5EHA", "B00CXG0Z5Y", "B00CG0CMBM", "B0038AJIMK", "B004Z7H2EQ", "B007CS1Z2K", "B007CS1LCE", "B007U7M0KY", "B00EDOD5CY", "B00CN8AGCO", "B00CN8AG9C", "B0038AR53E", "B00AOHDC6I", "B007CS0U6C", "B007U7M0V8", "B00AZ2Y2EI", "B007FDBD92", "B007SA2QCA", "B000FGCY8K", "B007U7M144", "B00BDMN3VC", "B007U7M14Y", "B0038ANO3O", "B009PLLFAE", "B00A152LXI", "B00CN8AGCE", "B00CG0CL2M", "B00CV7BX9C", "B0061J30VU", "B00DSR9X5U", "B004GJXJLS", "B00CN8AGE2", "B0038AJKPU", "B00FAA1QZ8", "B0038AJKPK", "B00CN8AHVY", "B00EDODR5O", "B00KNT6TZI", "B0038APDAG", "B00BGYR39U", "B007U7M0K4", "B0088LQZYS", "B002743856", "B00H5HFEQ6", "B00F0DPVZQ", "B00GTCKO90", "B00H5HFERA", "B0089RPUHE", "B0090A5ECA", "B00BGYRSTU", "B0038APDDS", "B007U7M0VS", "B0038ANOC0", "B004MWL07O", "B00CG0CMEO", "B00EZ6QVSK", "B0038AR4VM", "B004MWHZX2", "B0049QNX32", "B00CV7BX3S", "B007FDBELY", "B008DFTBGI", "B00555TX76", "B00EIBEORM", "B00CRZXUZI", "B00BZ8KN94", "B0044XKJVY"], "also_viewed": ["B0084BPZO8", "B007U7M0L8", "B007U7M0WC", "B00BP48U6Q", "B00H5HFEUM", "B00D38UBJ6", "B009PLLF9K", "B0089RPUH4", "B007U7M022", "B004Z7H1OW", "B00BRCNAE8", "B004MWN0Y0", "B007U7M02C", "B00D1HK3S8", "B0038AT564", "B004MWP390", "B0038AR75K", "B004MWL07O", "B007U7M0KE", "B00CG0CMBM", "B007CS1908", "B007U7M14Y", "B004Z7H2EQ", "B007CS1LCE", "B0038AR53E", "B00CG0CM3U", "B009PLLFAO", "B007SA2QCA", "B00H5HFEQ6", "B0038AJKPU", "B00CG0CMEO", "B00KNT6TZI", "B00BGYR39U", "B00AOHDC6I", "B007FDBD92", "B0038APDAG", "B00AOHDC5E", "B00CG0CL2M", "B0038AJIMK", "B004Z7H14M", "B007FDBELY", "B0088LQZOI", "B009PLLFAE", "B0089RPUHE", "B0038AR4VM", "B007U7M0V8", "B00CP4J7OY", "B004GJXJLS", "B00DW1U3CY", "B00DW1TUY6", "B00CN8AGCO", "B00DGXTC2K", "B00CRZXX1Y", "B0038ANOC0", "B007CS0U6C", "B00GTCKO90", "B0038APDDS", "B00CXG0Z5Y", "B00AOHDC4U", "B00CS1WDBI"], "bought_together": ["B0084BPZO8", "B007U7M0WC"]}, "title": "LeapFrog Explorer Sesame Street Solve it with Elmo, Abby and Super Grover 2.0 Learning Game", "price": 10.0, "salesRank": {"Toys & Games": 2245}, "imUrl": "http://ecx.images-amazon.com/images/I/510IHkfbU9L._SY300_.jpg", "brand": "LeapFrog Enterprises", "categories": [["Toys & Games", "Electronics for Kids", "Electronic Toys"]], "description": "Join Super Grover 2.0 on three super missions to help Elmo and Abby in Sesame Street: Solve It with Elmo, Abby and Super Grover 2.0! From driving a go-kart full of chickens to balancing pigs in a boat, little learners discover their own super powers of observation and investigation as they laugh and learn with Sesame Street. Children are introduced to essential STEM (Science, Technology, Engineering, Mathematics) concepts featured in engaging videos borrowed from their favorite show. Plus, they take part in a variety of activities that reinforce what they learn. Works with LeapPad Ultra, LeapPad2, LeapPad2 Power, LeapPad1, LeapsterGS  and Leapster Explorer (sold separately).Use a lever to launch Super Grover 2.0 into a tree of toys!Experiment with weight and balance to keep Abby&#x2019;s boat afloat.Learning SkillsLittle learners use their super science savvy as they experiment with their favorite Sesame Street friends! They rescue Elmo&#x2019;s toys from a tree while learning about levers and weights; help Abby&#x2019;s pig pals stay afloat by experimenting with weight and balance; and engineer a go-kart so that Elmo can give a lift to a flock of chickens. They play with a magnet to see what objects it attracts, and discover STEM concepts through engaging videos that help them complete their super missions. Last, but certainly not least, children earn stickers to decorate and build the mysterious Mega Machine. Then, they put the machine into action to see what it does! Sesame Street: Solve It with Elmo, Abby and Super Grover 2.0! is designed to teach early STEM skills in an interactive environment and is appropriate for children ages 3 to 5 years.The LeapFrog DifferenceDesigned by in-house educational experts, in conjunction with Sesame Street Education Research Outreach, Sesame Street: Solve It with Elmo, Abby and Super Grover 2.0! is grounded in the latest research for the richest possible learning experience. &#x201C;Created specifically for preschoolers, Solve It with Elmo, Abby and Super Grover 2.0! combines various topics in science, technology, engineering and mathematics to create an integrated, age-appropriate STEM learning experience. It provides early exposure to STEM topics that are engaging with just the right amount of challenge to foster their budding powers of investigation, observation and experimentation.&#x201D; - Clement C., Sesame Street, LeapFrog Learning ExpertInnovative Learning ApproachA curriculum packed with science-related subjects explores: physical science; technology and engineering; simple machines; magnetism; problem solving; and logic and reasoning. Everything from interactive gameplay that helps children build skills to visual details that deliver important messages is included to provide an age-appropriate experience for preschoolers. &#x201C;Through engaging gameplay, young children explore STEM concepts, develop an understanding of how things work and build critical thinking skills by helping their Sesame Street friends balance a boat, use a lever and engineer a go-kart.&#x201D; - Dr. Rosemarie Truglio, Senior Vice President of Education and Research, Sesame Workshop.What's In The Box?Sesame Street: Solve It with Elmo, Abby and Super Grover 2.0! includes game cartridge and Parent Guide & Instruction Book.Explorer learning games work with LeapPad Ultra, LeapPad2, LeapPad2 Power, LeapPad1, LeapsterGS and Leapster Explorer (sold separately)."}