{"asin": "B002I0EMUO", "description": "Product OverviewFrom the critically acclaimed director, Hideo Kojima, a new 3D   experience re-imagined from one of the most popular Metal Gear Solid   titles from the    past, comes METAL GEAR SOLID SNAKE EATER 3D.In the aftermath of the Second World War, the world was torn in two   between East and West. It was the beginning of a new era- the Cold War.October 16, 1962. The President of the United States received word   that the Soviet Union had deployed nuclear missiles in Cuba. The world    trembled in fear as the prospect of nuclear war loomed ever closer.   After days of tense negotiations, the Soviets finally agreed on the 28th   to withdraw their missiles from Cuban soil. With the resolution of this   incident, later to be known as the Cuban Missile Crisis, it    seemed that humanity had survived yet another threat to its existence.However, there was a secret condition in the deal that put an end to   the crisis. Nokolai Stepanovich Sokolov, a Soviet scientist who had   defected    to the West, was to be sent back to the Soviet Union. The U.S.   government agreed to this stipulation, and returned Sokolov back to his   native    land. Little did they know that Sokolov was to be the designer of a   nightmarish weapon. Now, with Sokolov back in their hands, the Soviets    are ready to resume its development. If this weapon is completed, it   will mark the beginning of a new age of fear.August 1964. Realizing at last the urgency of the situation, the CIA   forms a plan to recapture Sokolov. They dispatch the covert FOX unit    to Sokolov's research facility, located to the south of the great   Soviet fortress of Groznyj Grad. Led by former SAS member Major Zero,   FOX is a    next-generation special-forces unit that operates both as a   specialized combat group and as a covert intelligence outfit. The FOX   unit's modus    operandi is to send a single agent, backed by radio support from afar,   into enemy territory to carry out solo sneaking missions.August 24. A lone soldier swoops down from out of the blue. The man's code name is Naked Snake.FeaturesExperience an all-new re-interpretation of Metal Gear Solid 3: Snake Eater, previously released on      PlayStation 2 with over 4 million copies sold, in 3D for the first time ever.Auto-stereoscopic 3D viewing capability that endeavors to create a rich jungle world with natural depth in      settings of trees, rock/stone, water and more.'Photo Camo' system utilizing the built-in camera technology of the   hardware bringing customized stealth      and camouflage options to the player. By snapping a photo in the   real world, players will be able to use the same image as a camouflage   pattern      applied to Snake's uniform within the game.Utilizing the Gyro Sensor, players will become one with Snake   through specialized tilt mechanics throughout      the game design. As Snake climbs trees, or traverses bridges and   other environmental obstacles, players will be in danger of falling   based on the      balancing of the system.An intuitive menu utilizes the touch screen for quick and easy equipping of items and weapons.", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/61CoKVKEeJL._SX300_.jpg", "related": {"also_bought": ["B0050SVLI2", "B004L491A6", "B009LGO88E", "B002I0H1DY", "B004L4G8UC", "B0058H7AJO", "B002I0IVC4", "B003O6E800", "B00C71033E", "B002I094AC", "B0052WG9II", "B004K1EA5G", "B00B3TXJ14", "B009B1D7JK", "B002I0GKA4", "B002I092MM", "B006OI3CTS", "B00GANWVJE", "B00AKIPBNS", "B004K6LQAS", "B0053BCO00", "B00GV4V8XC", "B0053BCMAC", "B0053BCP40", "B0053B0DI0", "B0088MVPFQ", "B003FBL86Q", "B00CH923NE", "B0050SVKRY", "B0050SVPCO", "B004K1EA5Q", "B00I5LMSE2", "B000CBCVFE", "B00E1A1SP6", "B00K2O4O6U", "B00C1ZBFTW", "B0057PERH0", "B006Y76HY6", "B002I08VXI", "B0053B5RGI", "B0053B66KE", "B002I0EMBI", "B00BAVQGS8", "B00FXOP1JI", "B00KVRK39A", "B00GX330XW", "B00BQI3UQG", "B00269DXR0", "B007BGUGVO", "B002I08VDI", "B008HPAXZ2", "B0050SVL3M", "B002BS47TE", "B00KWEHBAG", "B001CRM3RI", "B00JM3R6M6", "B00B59L9YG", "B007YZ5QPS", "B0053BCML6", "B003VR5PPY", "B0029ZMIGS", "B00CFR7UC2", "B000FRV2UK", "B008OGWH3A", "B005EYRAUK", "B0088MVOTS", "B0089X37NW", "B0088MVOH0", "B008GEH8LQ", "B00BLGWIRK", "B005C2QSDY", "B00L3LQ4B4", "B00KWFY04A", "B004UDLUXY", "B008XHCLFO", "B007FMSDU0", "B00L3LQ1FI", "B002I08WVY", "B003WFLGNA", "B00DD0B1R0", "B000HKMG14", "B008GEH9HO", "B00DWXUYN0", "B00CAY50CW", "B00FXOP1MU", "B00DC7G3Q8", "B008CP6KG8", "B002I0H0FS", "B00GV4V8UK", "B007R4X3AG", "B007PX6MFM", "B001AWIP8G", "B0000A09EN", "B00CM7TCGM", "B001E27DLM", "B00DWXV07E", "B000UZVL58", "B00KVMHVQ8", "B0009Z3K9E", "B000BXKA38"], "bought_together": ["B009LGO88E"], "buy_after_viewing": ["B0050SVLI2", "B002I0IVC4", "B002I0H1DY", "B00AKIPBNS"]}, "salesRank": {"Video Games": 2565}, "categories": [["Video Games", "Nintendo 3DS", "Games"]]}