{"asin": "B00548QAPC", "categories": [["Electronics", "Computers & Accessories", "Tablets"]], "description": "Experience the freedom to play games, watch HD movies, social network and more on your Acer Iconia Tab&mdash; now in pocket-size! The small handheld design of the A100 with stunning 7&rdquo; display makes this Tablet the perfect size to take on the go, and conveniently fits in your jacket pocket or purse to help maintain your busy life! This multi-functional tablet is the perfect immersive gaming device, mini movie theater, portable photo album, endless book collection, personal planner, social network connection and more!br/Key Features7&rdquo; HD Multi-Touch Display:(1024 x 600) resolution, 16:10 aspect ratioNVIDIA&reg; Tegra&trade; 2 Dual Core Mobile Processor1GB DDR2 MemoryNVIDIA&reg; GeForce&reg; GPU8GB Internal StorageMicroSD memory card slot up to 32GBDolby&reg; Mobile TechnologyDual Analog MicrophoneDual Speaker802.11b/g/n Wireless(802.11n 2.4GHz only)Bluetooth&reg; 2.1+EDR1- Micro USB 2.0 Port1- USB 2.0 Port1- Micro HDMI&trade; Out(with support for 1080p &amp; Dual Displays)5MP Rear Facing Camerawith Auto Focus and single LED flash2MP Front Facing CameraSensors:G-Sensor, E-Compass, L-Sensor, Gyro-meterRechargeable Lithium-ion polymer BatteryUp to 4-hours battery life for Video Playback via Wi-FiUp to 4.5-hours battery life for Video Playback on systemLearn MoreThe latest Android Experience in Pocket size!The Acer&reg; Iconia Tab A100 is designed to enrich your mobile life with its compact 7\" size that easily fits in your pocket or purse providing a rich and vibrant experience on the go. The orientation-less multi-touch screen display ensures optimal on-screen viewing from every angle - up and down or left to right.The latest build of Android&trade; Honeycomb&trade; operating system provides enhanced audio and visual support, smoother streaming and file transfers, resizable app widgets and more! The Android&trade; Market lets you choose from thousands of your favorite apps to customize your A100 Tab ANY way you want.This tablet has the power you want, in the portable size you need for your busy life on the go. Showcasing a stunning 7-inch 16:10 multi-touch screen (1024 x 600 resolution) while offering convenience, versatility and speed.The stylish Iconia Tab A100 with smooth, rounded edges and lightweight design fits comfortably in one hand- and with all the fun features you'll definitely be hooked!Your Portable Entertainment CenterNVIDIA&reg; Tegra&trade; 2, the first mobile dual-core CPU brings the fastest, most visually-rich tablet experience, and extreme multitasking for effortless multimedia enjoyment. Enjoy the best Web experience with up to two times faster browsing, full Adobe&reg; Flash&reg; support*, and console-quality gaming with an NVIDIA&reg; GeForce&reg; GPU.Discover all the amazing things you can do on your Iconia Tab A100! The 5 point multi-touch display and gyro meter control give you a gaming experience on par with the best consoles. Download the latest HD games from the Android Market place for hours of fun!This latest Honeycomb OS now supports Google Apps! Rent the latest flicks with Google Movies and listen to your personal play lists with Google Music in great Dolby&reg; Sound! Port this whole entertainment experience to your big screen TV in full 1080p HD glory through the micro-HDMI&trade; port.The battery provides up to 4.5-hours of cable-free battery life giving you the freedom to experience fast web browsing, email, view photos and HD videos, play high-end games and read ebooks wherever you may be!Unique Extras that Make Life Easy.Thanks to the Micro-USB 2.0 port and the Micro-SD slot, the Iconia Tab gives you the ability to connect USB flash drives, USB media card readers and even a portable hard drive. The expansion opportunities are endless.Snap photos, record videos or enjoy online chats with the 5MP autofocus rear-facing camera and 2MP front-facing camera. Quick access to camera settings allow you to easily share on your social media accounts.SocialJogger lets you stay in touch with friends and the latest buzz by placing Facebook&reg; and Twitter in one place! Check updates in a single glance and scroll through endless feeds with the innovative jog dial.Acer Clear.fi&trade; allows you to manage, store, share, and enjoy media between any Clear.fi enabled devices, in any room throughout your home.Acer Sync&reg; lets you wirelessly synchronize your contacts, calendar, photos and video clips between your Acer Tab and PC.", "title": "Acer Iconia TAB A100-07U08U 7-Inch Tablet (8GB)", "price": 219.99, "imUrl": "http://ecx.images-amazon.com/images/I/41PE-s0-y%2BL._SX300_.jpg", "brand": "Acer", "related": {"also_bought": ["B006Y455OW", "B00DMMKB52", "B005EVS2D2", "B006W4GNT0", "B0068RHJS0", "B005TP4LV0", "B005HM8BX4", "B005OB1XEM", "B006905U5A", "B005LIDFCQ", "B006XGCQ2U", "B00813XGL8", "B005OB3QTM", "B004XZL980", "B006Y455JW", "B006DVFZQY", "B007Y3FYWU", "B002BBJMO6", "B007Y3EWZ0", "B007PX48NA", "B006906ZAO", "B006XGCQ48", "B00FYHPVPI", "B007P4VOWC", "B009M4X7Z0", "B004OB0EBQ", "B003UH0Z9Q", "B005QX7KYU", "B007KFXIDE", "B001L1H0SC", "B004UL34EY", "B009AEPTDA", "B004UL34VW", "B005VAOPZU", "B005XU4GHA", "B006NNQND6", "B0068RJ4PG", "B0075W8BZC", "B0068RG3E6", "B007RG70I0", "B00BCPIFC2", "B007ZZAMAQ", "B0055D67HW", "B006Y455DS", "B006ZAHMZA", "B005SSU1U8", "B004G60AD6", "B00BR5FZPC", "B001F7AJKI", "B003WGJYCY", "B005E2LX28", "B004QZASJ8", "B007H9ZGWY", "B007M50PTM", "B004M5H660", "B005HM8BYS", "B006OKZ33Y", "B006OKYJ20", "B005HM8BVG", "B00B0AXWWW"], "bought_together": ["B006Y455OW"], "buy_after_viewing": ["B006Y455OW", "B007Y3FYWU", "B007Y3EWZ0", "B007JX3J40"]}}