{"asin": "B000N50S5Y", "description": "For people looking to step up to full 1080p resolution in a 46-inch flat-panel LCD, Samsung's 2007 model LNT4661FF is a good choice. Besides offering full 1080p resolution the LNT4661F also features a 10,000:1 dynamic contrast ratio for rich blacks and subltle texture display, an 8ms response time panel for smooth motion, hidden side speakers, an NTSC tuner, and 3 HDMI ports.Compared to other Samsung ModelsThe primary differences between Samsung's LNT4661F and the step-up LNT4665F LCD HDTV is in the contrast ratio and video processing power. The pricier LNT4665F offers a 15,000:1 dynamic contrast ratio compared to this model's 10,000:1 ratio, and also offers full 10bit video processing over this model's 8 bit system. The more expensive model should display finer gradients of shading making for more detail in darker scenes. The video processing difference should ensure smoother  motion in fast moving scenes for the LNT4065F.Video ProcessingThe Samsung Digital Natural Image engine (DNIe) Video Enhancer refines all analog NTSC and wideband video inputs for an overall improvement in picture quality. DNIe improves contrast, white level, picture detail and incorporates digital noise reduction to improve lower quality video inputs. The 3D Y/C digital comb filter constantly analyzes the three dimensions of picture height, picture width, and picture changes-over-time to dramatically reduce edge image artifacts while improving transition detail.ConnectionsHDMI (version 1.3):3 (1 CEC cabaple)Component video:2 (Y, Pb, Pr)S-Video input:1 side/1 rearA/V inputs:1 side/1 rearPC inout:1Headphone Jack:1USB 2.0:1Audio FeaturesHigh-quality virtual surround sound can be experienced with just the speakers built into the TV. SRS TruSurround XT technology delivers an amazing, simulated 3D effect with clear dialog and powerful bass through hidden side speakers. TruSurround XT audio adds three audio enhancement technologies to produce an amazingly immersive sound experience.Dialog Clarity brings movie dialog into Focus during the playback of any surround-encoded material to make speech much clearer and crisper.TruBass creates incredible deep rich bass allowing a person to perceive significantly deeper, richer low bass tones that are far beyond the physical low frequency capabilities of the speaker itself.The SRS WOW feature widens the soundstage by processing standard two-channel stereo material as well as multi-channel encoded material for a dramatic improvement in the playback of any stereo audio over a two-speaker system.What's in the box:Samsung LNT4661F 46-inch 1080P LCD TV, remote control, 2 AAA batteries, Power Cord, cleaning cloth, owners manual, warranty card.", "title": "Samsung LNT4661F 46-Inch 1080p LCD HDTV", "imUrl": "http://ecx.images-amazon.com/images/I/413J4mG5dyL._SX300_.jpg", "related": {"also_viewed": ["B000NVLQ72", "B0077E49PO", "B00093IIRA", "B001BMIOHW", "B001GTT0VO", "B000MX05GO", "B00BD8TMIO", "B00BD8SZLE", "B0071NWYP8", "B00BB9OOFG", "B00ID2HGQ8", "B00BCGRLUI", "B00CALLZK6", "B0078LSTWU", "B0071O4ETQ", "B00BXF7JAA", "B00ID2HI8O", "B00C5B18CQ", "B00BP5N498", "B00BB0ZTJA", "B00BB0ZTM2", "B00DOPGO2G", "B00I94IR8G", "B00BB0ZTMM", "B00BB0ZTO0", "B00ID2HIJS", "B0074FGNJ6", "B00BGGDVOO"]}, "categories": [["Electronics", "Television & Video"]]}