{"asin": "B000G7PMX2", "description": "Red Steelis an exclusive Wii launch title that takes full advantage of the innovative Wii Remote and Nunchuk controllers and puts players directly into the action-packed first-person experience with the weapon in their hand - literally. An engaging storyline unfolds as you learn that your fianc&eacute; has been kidnapped and her father - a Japanese mafia kingpin - murdered by a rival gang. The only way to save your loved one and defend your honor is to journey from Los Angeles to Japan and confront the Tokyo underworld. By learning the ancient art of Japanese fighting with your katana and the focused precision of modern firearms, you will progress and adapt yourself to this foreign environment, where skills alone may not guarantee you victory.Ubisoft gives players unparalleled control in this innovative Wii title.Can Scott defeat the powerful Yakuza?View larger.Use the Wii Remote to execute delicate but deadly sword moves.View larger.Your pistol is directly controlled by the Wii Remote while you aim on-screen.View larger.Firearms rotate to match your particular aiming style.View larger.An epic tale awaitsRed Steelis an action-packed first-person experience for the Nintendo Wii that will put the weapon in your hands like never before. The engaging storyline opens in Los Angeles, as Scott Monroe and his fianc&eacute;, miyu, arrive at a high-class restaurant. Scott is to meet Miyu's father, Isao Sato, an important business man from Tokyo. Suddenly, the restaurant erupts in a hail of gunfire as a group of Japanese mobsters (known as Yakuza) attack and try to kidnap Sato. Scott manages to save his future father-in-law. The Yakuza attackers run off, taking Miyu instead.Scott soon learns that Isao Sato is the Oyabun, the Godfather of one of Tokyo's largest Yakuza families. The attack in the restaurant marks the end of a truce between rival clans that Sato had guaranteed. The Yakuza wanted to kill Sato and find his sword, the Katana Giri. The legendary sword was once used to punish dishonorable Godfathers, and has since become a symbol of peace. Sato was mortally wounded in the attack, but before he dies, he passes the sword to Scott in exchange for a promise to rescue and take care of his daughter. Scott has no chioce but to head to Japan and try to find Miyu.Once in Japan, Scott seeks out Otori, a reformed Yakuza and an expert in the art of sword fighting. A friend to Sato and a man of honor and tradition, Otori reluctantly agrees to help. Otori trains Scott in the art of the sword. Meanwhile, another man named Harry Tanner teaches Scott all about the Japanese Underworld. Harry runs a night club popular with the Yakuza, and he uses his many connections to help Scott on his quest.Eventually, Scott uncovers the man behind the attack of his father-in-law and the kidnapping of his fiance, a power-hungry young Oyabun named Tokai. With his mistress, Mama San (the head of the Geisha district and a female gang of Yakuza), Tokai seeks to take control of the entire Tokyo mafia. However, his real intentions are much darker and more mysterious.With Otori's help, Scott must convince the Godfathers of all the remaining clans to join him in stopping Tokai. Kenzo, leader of the Financial Clan, Tetsuo, boss of the Game Fighting Clan, along with the heads of all the other clans - all powerful men, all harbor their own agendas and ambitions. Scott must convince them all to join him in stopping Tokai, but who can he really trust?Control the action like never beforeRed Steeluses the Nintendo Wii controller in ways not previously seen in a console action game. By turning the Wii Remote itself into your gun or blade, players can shoot and slice their way through Red Steels ample story mode. When first equipped with a firearm, the Wii Remote will automatically sense the location and direction of your hand and aim the on-screen weapon similarly. As you rotate your wrist to add flair and style while picking off enemies, the on-screen weapon will mimic your movements.Equipping the sword is even more impressive. When Scott has the sword at his disposal, the Wii Remote becomes a sharp Kitana as players literally slash at their enemies and run them through. The play style is incredibly immersive, and lends a realistic element to action games that isn't often seen. As Scott becomes more comfortable with his weapons, so too does the player, and the moves they can pull off with the Katana improve in both accuracy and speed.Multiplayer swordplayAs if an impressive story line and immersive control weren't enough,Red Steelalso boasts a number of local multiplayer modes. In these modes, players can challenge friends to split screen battles in various locales to see who the real master is. Try a sword only battle royale without cover and the ability to heal. Or, set up a tactical battle with pistols and flanking schemes for you and 3 of your closest enemies. Whether teaming up or going \"every man for himself,\"Red Steelmultiplayer offers a fun diversion to the title's main story.Red Steelis an impressive Wii launch title from one of the most innovative publishers making console games today. From its opening cinematic to its realistic and quick-paced swordplay, Red Steel is a riveting and engrossing title worthy of Wii owner's time and attention. After a few hours of mowing down enemies with your side-mounted pistol and whisper-quiet Katana slices, you'll wonder why action titles aren't all this simple and fun to play.", "price": 10.5, "imUrl": "http://ecx.images-amazon.com/images/I/513YH5YXQPL._SY300_.jpg", "related": {"also_bought": ["B001TOMR0C", "B0019SY1D4", "B000X25GW2", "B001HKPUKC", "B002BRZ9AG", "B000P46NKC", "B00269DXR0", "B000P297F2", "B000RF7164", "B002EE7OKE", "B002BSC4ZS", "B002E6XY6U", "B001ET07O0", "B001TOMQVC", "B001P5HM64", "B002MBQA18", "B007CSF3GO", "B002BSC4RQ", "B0020H46D8", "B000FQ9QVI", "B00269DXXO", "B000XPMU1O", "B002BRYXOO", "B000WCQWR6", "B001SI39E2", "B003AI7THQ", "B002I0GEXM", "B000R4809W", "B000FQ9YB0", "B001HTFQ0C", "B00149IL9I", "B000Z9A95M", "B000R3BNHE", "B003O6FW6E", "B00B2QL2Y4", "B001D7T2WQ", "B002CZ3SLO", "B003GB4UXI", "B003JD7QYI", "B00113T0VA", "B000FQBPCQ", "B003ZCH7DI", "B000NIJ35M", "B000NDFFFE", "B002EE5SAC", "B001C58T46", "B004WLRQMI", "B001CU4EMW", "B000GPW2QO", "B002HJQSQW", "B003O6H7X0", "B002OL1KEI", "B000GQ1NK4", "B005EHQJ2C", "B0037M2SOY", "B001HB7K6I", "B000MUSG4U", "B000FQBWAG", "B0030GBU8W", "B005EIIBKY", "B000NJH6ZA", "B0013E9HP6", "B001AWIP7M", "B003WY86NE", "B00B59L9YG", "B002D2DQL8", "B002BRZ9G0", "B000NNDN1M", "B008171AZ8", "B002BSA388", "B000GJ0J1A", "B005EIIS4S", "B001D8TQ44", "B002I08CJG", "B007UMD1EI", "B00006IJJK", "B00CAY50CW", "B0017WHQ34", "B00117PPME", "B00503E9UO", "B000HCQK0A", "B000NVKZ06", "B003N3HEU0", "B0010YOQIC", "B00006LELI", "B002BSC54I", "B000QSE7FK", "B000YDIYFG", "B000GHLBUA", "B002EZLA5I", "B002I0GD06", "B0050SVGW8", "B000N60GTG", "B000KUHR8S", "B005C2QSDY", "B001BWRBB2", "B001DO3NEW", "B000MF51L6", "B005FYJA52", "B000W5Y49G"], "bought_together": ["B001TOMR0C", "B0019SY1D4"], "buy_after_viewing": ["B001TOMR0C", "B0019SY1D4", "B000X25GW2", "B000P46NKC"]}, "salesRank": {"Video Games": 11884}, "categories": [["Video Games", "Wii", "Games"]]}