{"asin": "B0038OLL2Q", "categories": [["Electronics", "Portable Audio & Video", "Cassette Players & Recorders"]], "description": "Turn your tapes into MP3s and listen on your computer, iPod, in the car, or in the palm of your hand! TAPE EXPRESS + is a portable, handheld USB tape player that works with all kinds of tapes. It has an easy-to-use USB connection for sending the music on your tapes right into your computer where it's instantly turned into MP3 files. You can listen to MP3s on your computer, load them onto your portable music player, or record them onto a CD and listen in your car. Rediscover those old songs with TAPE EXPRESS +! TAPE EXPRESS + is designed with your on-the-go life in mind. Its portable design fits in virtually any bag and enables you to play and transfer music anywhere. It runs on battery or USB power when connected to your computer for easy operation wherever you go. TAPE EXPRESS + comes with ION's exclusive EZ Converter software. This powerful, yet easy-to-use program guides you through transferring your music and can even integrate with your iTunes Music Library. In addition to transferring your tapes, TAPE EXPRESS + has an audio output that enables you to listen on the included headphones, or connected to your stereo or other speaker system for hours of enjoyment. It can play chrome or normal cassette tapes. Reconnect with the music on your old tapes anywhere you go with TAPE EXPRESS +. iPod and iTunes are trademarks of Apple Inc., registered in the U.S. and other countries.", "title": "ION Tape Express Portable Analog To Digital Cassette Converter with Headphones", "price": 43.99, "imUrl": "http://ecx.images-amazon.com/images/I/41LxGIohciL._SY300_.jpg", "brand": "ION Audio", "related": {"also_bought": ["B002MT7JFQ", "B00004Z5IE", "B002YVAT72", "B00886XQHM", "B0002DHN6Y", "B005P4OH7I", "B002L6I9Z4", "B00886XQNQ", "B00GQZIBLS", "B0002CZVBE", "B00ABAZ5M2", "B0042F3JCK", "B0088DXS14", "B0029QRA1U", "B004LLMAWU", "B0093CHZ8G", "B0002DV6J4", "B007C9P3PO", "B000KFB4PK", "B000ZKNGE2", "B00168PIQ6", "B00EVWX7CG", "B004TAFJXK", "B006RG23JC", "B00139YMUQ", "B000VG802I", "B0002EKEHS", "B00791R1BO", "B0090EC5NC", "B00GP6XN3Y", "B00BNQT36W", "B004NNUEWY", "B004JPJHL0", "B007HMCQBA", "B00B5P23SG", "B00C74HKF0", "B00ADXLBS4", "B00GIDADP0", "B0029U2YSA", "B000UZ0VTU", "B00012F6A6", "B0030Z95B2", "B000VM60I8", "B005ARQV6U"], "bought_together": ["B002MT7JFQ"], "buy_after_viewing": ["B00ADXLBS4", "B00BNQT36W", "B005NGJLYW", "B002MT7JFQ"]}}