{"asin": "B00002SVFQ", "description": "F-Zerodelivers the excellent play control you've come to expect in a game from Mr. Miyamoto and his team at Nintendo. You can bank with the R Button and tip down your nose while making jumps. You'll need all the control you can get, too, as you roar through the twists and turns ofF-Zero's 15 deviously difficult courses. There are four hover cars to choose from, each with its own strong points and weak points. Most beginners find the durability and handling of the Fire Stingray easiest to use (despite poor acceleration), but veteran players will often choose the more-balanced Blue Falcon.Strategy plays a big part in this speedfest. In this one-player racing game you will need to find shortcuts, elude hazards and snag power-ups if you want to beat your savvy competition. Keep an eye out for sand, land mines, magnets and other trouble spots, but always be ready to get a boost from a speed or jump plate. You'll earn one Super Turbo per lap, and part of the strategy is knowing when to use it.When originally released in 1991,F-Zero's graphics were light years ahead of most of the competition. It still impresses mightily, thanks to innovative use of Mode 7 scrolling that immerses you in the adrenalin-pumping action.Sonically,F-Zerois one of the best SNES titles. Driving techno music and top-notch sound effects, including the hum of your car's turbines unwinding, relentlessly propel the action. The aggressive artificial intelligence of your rivals never allows you to ease up.", "price": 279.99, "imUrl": "http://ecx.images-amazon.com/images/I/41I1DZDdabL._SX300_.jpg", "related": {"also_bought": ["B00002SVFR", "B000035Y3B", "B00002STXQ", "B00002SVFV", "B000035Y21", "B00002STYC", "B00002SVFZ", "B00002STXN", "B000035Y6C", "B000035Y6D", "B000HFGKN4", "B000035Y1Q", "B000050FBJ", "B00002STZH", "B00002SVG2", "B000J3O194", "B00004TN2T", "B000GU49P6", "B002KJ02ZC", "B00002SVG0", "B003Y7RB76", "B00002SVFX", "B000035Y0L", "B00002STX3", "B00005AV8W", "B00002SUCV", "B00002STH5", "B000035Y5P", "B00002STXG", "B000035Y2Q", "B00002SVG3", "B000035Y08", "B005WMIR4C", "B000035XYT", "B000035Y7N", "B000035Y5K", "B000035Y78", "B00004SVYE", "B00004SVYF", "B001VDZN3O", "B00004SVXP", "B000035Y6B", "B00002SU0D", "B00004SVV9", "B00000K4KO", "B000035Y5G", "B00004SVV8", "B00004SVXQ", "B000A7I71C", "B000JLXW6E", "B000H29ZPM", "B00002SV55", "B0002ST1YQ", "B00002STXL", "B000035Y09", "B000035Y6H", "B00004SVS5", "B005GSRPG8", "B0002Y6A58", "B00004SVVT", "B0009P58HG", "B00BEZY2I6", "B00004SVXV", "B0012NZK8G", "B00004SVS3", "B00004TMTK", "B00002ST7F", "B000FJEV06", "B00004SVNL", "B00004SVXW", "B0009VRFFS", "B00005AV8O"], "buy_after_viewing": ["B00002STXQ", "B001VDZN3O", "B00002STXN", "B002KJ02ZC"]}, "salesRank": {"Video Games": 6872}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "More Systems", "Super Nintendo"]]}