{"asin": "B000TME35W", "description": "From the Manufacturer Samsung&rsquo;s BD-P1400 is a perfect centerpiece to your media environment, providing the features you need for a fulfilling entertainment experience. Advanced Blu-ray playback technology gives you crisp, clear images, while added picture quality adjustment lets you set sharpness and noise reduction to your liking. HDMI v1.3 lets you experience richer colors. Dolby&reg; Digital Plus and Dolby TrueHD compatibility completes the HD experience.CD and DVD CompatibleSamsung&rsquo;s Blu-ray Disc Player offers state of the art viewing with CD and DVD playback compatibility. Even as you take advantage of the latest video and audio advances, you can still enjoy all your existing media content.1080p with 24Hz OutputView scenes as they were meant to be seen. The Blu-ray movie title&rsquo;s original source (1080p/24Hz) output means you&rsquo;ll enjoy the film picture quality.Seamlessly Connect Your Digital DevicesWith High-Definition Multimedia Interface (HDMI&trade; version 1.3), a single cable transfers the full power of the Blu-ray Disc Player&rsquo;s high-definition video and audio signal to your HDTV and other digital devices. Version 1.3, standard in the BD-P1400, transfers deeper color and higher resolution, and handles the new, compressed audio formats. Another plus: Your room is freed from the unsightly tangle of multiple cords and cables.Dolby Digital Plus and Dolby True HDImmerse yourself in sound. The BD-P1400 supports the new Dolby Digital Plus Audio format &mdash; the next generation in sound. It also supports uncompressed PCM Audio and Legacy dts 5.1 Dolby Digital. Dolby TrueHD is Dolby&rsquo;s next-generation lossless technology developed for high-definition disc-based media. Dolby TrueHD delivers tantalizing sound that is bit-for-bit identical to the studio master,* unlocking the true high-definition entertainment experience on next-generation discs.Anynet + Ready TVYou're in full command with the BD-P1400. Anynet+ delivers streamlined, one-touch control over all your Anynet compatible connected devices such as the TV, AV Receiver, and Home Theater. You can operate all of them with a single remote control that enables commands to be passed among devices within the system. A true \"plug and play\" product, it comes with a Consumer Electronics Control (CEC) feature that lets you operate Samsung HDMI products with a single remote control.One RemoteTrust Samsung to make home entertainment a seamless and exhilarating experience. Thanks to High-Definition Multimedia Interface (HDMI&trade;) with Consumer Electronic Control (CEC), just a click of a single remote control accesses any digital device in your SAMSUNG home entertainment system., and laptops. HDMI is the best performing interface for displaying an HD source on an HDTV.", "title": "Samsung BD-P1400 1080p Blu-Ray Disc Player", "price": 50.99, "imUrl": "http://ecx.images-amazon.com/images/I/31DZFmStX1L._SX300_.jpg", "related": {"also_viewed": ["B00G4TTQQK", "B00I83T0DO", "B00KB9VBCQ", "B0058VBZ50", "B00803FNAG", "B00FF9SVWA", "B009YWN926", "B00IBR189Q", "B00FL4EWEK", "B00KC0R4XO", "B00HPMCPJK", "B00ICDAAX4", "B0076R7F62", "B004N85YBA", "B001URWAYG", "B00EUY59Z8", "B004E276Z2", "B00D8M59QW", "B00ECQABDY", "B0076R7FFI", "B00BQHFRM2", "B00BQ3EGPU", "B00C0R46J2", "B007X4KN94", "B00BFDHV9E", "B003QP41EW", "B003ANVQWU", "B007BYLO4E", "B00B9JR5EU", "B005NEZDUA", "B00F9YYHW4", "B00KLG978O", "B00752R4S2", "B001V9LA44", "B004QXLNUS", "B00CPEU8H4", "B003AJ9L3A", "B0089PPLQG", "B001A4LVYY"], "buy_after_viewing": ["B00EUY59Z8", "B00EUY59Z8", "B00IBR189Q", "B00G4TTQQK", "B003L1ZYYM"]}, "categories": [["Electronics", "Television & Video", "Blu-ray Players & Recorders", "Blu-ray Players"]]}