{"asin": "B001NTFATI", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Mice"]], "description": "Tuned for the way you playDeveloped with personalization in mind, the G9x Laser Mouse is the most customizable mouse Logitech has ever built. With an unprecedented number of adjustable features, gamers can tune their mouse settings for better performance, fit, feel and looks.Providing precision at any hand speed (up to 150 inches per second on most popular gaming-mousepad surfaces), the G9x extends the promise of the award-winning Logitech G9 Laser Mouse with its next-generation laser sensor. Featuring on-the-fly adjustable dpi from 200 to 5000 dpi, the G9x makes it easy to go from pixel-precise targeting to lightning-fast maneuvers without pausing the action.Get the gear to suit your gameplay. Play with the best.Key Features2 interchangeable gripsThe G9x comes with Wide Load and Precision grips that let you choose the fit and feel that's best for your playing style. The Wide Load grip's satin feel and fuller shape offer extra comfort. The Precision grip's DryGrip technology and compact shape give you exceptional fingertip control.Next-generation gaming laserGives you game-changing precision at any hand speed.* On-the-fly adjustable dpi to go from pixel-precise targeting (200 dpi) to lightning-fast maneuvers (up to 5000 dpi) without pausing the action. And Full-Speed USB (for up to 1000 reports/sec).* Up to 150 inches per second on most popular gaming-mousepad surfaces.Onboard memoryLets you program up to five ready-to-play profiles (for keyboard macros, dpi settings, and LED colors), so you can take your personalized settings when you're on the go. Profiles are stored directly in onboard memory.** Download of Logitech SetPoint software required for initial profile setup.Weight-tuning systemPrefer a heavier or lighter mouse? The G9x gives you up to 28 grams of extra weights that you can mix-and-match for personalized feel and control.** Contains small parts which may pose a choking hazard to children.Custom-color LED displayLets you match your mouse to your PC, your game, your style. LEDs light up to show your mouse dpi and profile settings. Choose the color of your LEDs from a wide color spectrum.MicroGear Precision Scroll WheelDual-mode scroll wheel provides precise click-to-click scrolling that's perfect for weapon selection in games. Or, switch to frictionless hyper-fast scrolling to fly through long Web pages.Suggested games for the Logitech G9x Laser Mouse:World of Warcraft: Wrath of the Lich KingWarhammer Online: Age of ReckoningAge of Conan: Hyborian AdventuresThe Lord of the Rings Online: Mines of MoriaLeft 4 DeadCall of Duty: World at WarCrysis WarheadFallout 3Brothers in Arms: Hell's HighwayCommand and Conquer: Red Alert 3Check out the G-SERIES&nbsp;&nbsp;from Logitech:", "title": "Logitech G9X Programmable Laser Gaming Mouse with Precision Grips", "price": 182.0, "imUrl": "http://ecx.images-amazon.com/images/I/31vcP9sYhtL._SX300_.jpg", "brand": "Logitech", "related": {"also_bought": ["B000UEZ36W", "B002J9G5AE", "B005S0KHIC", "B002ZV51DI", "B00IRHE892", "B002NIGDX0", "B009C98NPY", "B000UEZ37G", "B003VAK16O", "B004RJJMBI", "B000UHE8YM", "B001NXDBI6", "B00CD1FC6G", "B008PFABI8", "B003VANOFY", "B001O5CCQK", "B002R0DX14", "B007SZ0E1K", "B00BCEK2M4", "B00B2HH7G0", "B002R0DX1E", "B002RRLQIO", "B001NEK2GE", "B00BF9MZZI", "B000UVRU6G", "B005QUQP94", "B00BBUCCKO", "B00029MTMQ", "B009NB8WR0", "B009ZN2NH6", "B00B1KJK22", "B008OQTGBQ", "B000V7ARAU", "B003DA4D2U", "B0036Q7MV0", "B007VDOOBU", "B004Z0XS0K", "B0036WTBFY", "B009NB8WRU", "B003CWEXWO", "B001F51G16", "B00CO8TBQ0", "B004F38Y7Y", "B00CJD4HD2", "B005O65JXI", "B006RG23JC", "B003V8SPQE", "B008U5ZNIG", "B00CERXJNW", "B007SZ0EOW", "B009NHAF06", "B003PJ6QW4", "B006HIKIG0", "B008PFDUW2", "B008Q7HUR0", "B0033Z2BAQ", "B007CMYZ14", "B000HTDBWI", "B008O515CK", "B001J4ZOAW", "B005M2KQUA", "B000W6IY6O", "B004YHXXHC", "B005L38QLQ", "B000EGEX4E", "B007ZT2E1C", "B007VDKLLM", "B008I647AM", "B004Q0PT3I", "B005U8XJO6", "B000H6AY6M", "B002R0DX0U", "B00906HM6K", "B009NB8WTI", "B00AAS888S", "B006ZS5ATM", "B006JH8T3S", "B004CRSM4I", "B002CQU12C", "B0094NXBZ0", "B00BFOEY3Y", "B000OGX5AM", "B009NHAEXE", "B0068INSUM", "B00606DWSK", "B0091QOCNA", "B004QRKWLA", "B004LPZBD6", "B002J9GDXI", "B006EWUO22", "B003VAM32E", "B0088PUEPK", "B00A4ZXE40", "B00EB7UITQ"], "bought_together": ["B000UEZ36W"], "buy_after_viewing": ["B00IRHE892", "B000UEZ36W", "B00AAS888S", "B00BCEK2LA"]}}