{"asin": "B002BDU95A", "categories": [["Electronics", "Computers & Accessories", "Computer Components", "Internal Sound Cards"]], "description": "From the Manufacturer The Creative Labs Sound Blaster for iTunes Wireless Audio Transmitter and Receiver Bundle provides everything you need to wirelessly stream music from your computer to your home stereo system. Setup is easy, so you can enjoy your music right away, wherever you want it.Wirelessly stream music from your computer to anywhere room in your home.View larger.A dedicated wireless connection ensures great audio fidelity no matter where you stream music.Other products in the Creative Wireless Ecosystem:Sound Blaster X-Fi Notebook ExpressCard 34Wireless Receiver with RemoteGigaWorks T20W Series II Wireless SpeakersEnjoy a Premium Wireless Sound System in Just SecondsThe Sound Blaster for iTunes Wireless Audio Transmitter and Receiver Bundle makes creating a wireless sound system a snap. It includes both a transmitter and receiver. Once you connect your sound system to the receiver, you'll have everything you need to listen to your music anywhere in your home.Simply plug in the transmitter to a USB port on your PC or Mac, and you're ready to stream music. No cables, no network configuration--just music wherever you want it in your house. Since the transmitter is so small, you can easily use it with your different computers, whether they're desktops or laptops, giving you access to all your music libraries. In addition to iTunes, the transmitter also supports Windows Media Player, Pandora internet radio, Rhapsody, and all media players.Setting up the receiver is also a snap. The back of the receiver has connections for stereo RCA cables and a 1/8-inch mini jack. Just hook it up to a stereo system, powered speakers, or headphones, and you're ready to go.Stream Your Music to Four Different RoomsBy adding Sound Blaster Wireless Receivers or Speakers, you can enjoy your music in multiple rooms. The system allows you to add up to four receivers, and the included software makes managing your playback functions easy, giving you individual control over each component. An included remote adds further convenience, letting you manage your music from across the room.The Creative Wireless Ecosystem: Music Where You Want ItThe Sound Blaster for iTunes Wireless Audio Transmitter and Receiver Bundle is part of Creative Lab's Wireless Ecosystem that also includes the GigaWorks T20W Series II Wireless Speakers, and Sound Blaster X-Fi Notebook ExpressCard 34.By adding GigaWorks T20W powered speakers to your system, you can enjoy your computer's music in any room without the need for an additional receiver. You can add additional Sound Blaster wireless receivers and speakers, giving you the ability to stream music into virtually every room in your home. The transmitter includes software that makes managing your playback functions easy, giving you control over music in any area of your home.Dedicated Wireless Connection for Outstanding PerformanceUnlike other streaming audio systems, Sound Blaster Wireless does not piggy back on your home's network. In fact, the Sound Blaster system uses a dedicated wireless connection, so you don't even need a home network or wireless router to use it. The system communicates via a 2.4 GHz RF transmission, has a range of up to 100 feet, and supports recording and stereo playback at up to 16bit/48kHz. Forget 802.11g connections that break up and stutter--with Sound Blaster, you'll always have clear, uninterrupted music.X-Fi Technology Reclaims Lost Detail for Great SoundThe Sound Blaster for iTunes Wireless Audio Transmitter features Creative's award-winning X-Fi audio technology, so you will not only have wireless music, but you will also have an improved listening experience. X-Fi enhances audio from music and movies by restoring details lost in compression, expanding them to a surround-sound experience. Additionally, support for X-Fi CMSS-#D, EAX 4.0, and OpenAL means realistic gaming audio over headphones (for PCs only).The Creative Labs Sound Blaster for iTunes Wireless Audio Transmitter and Receiver Bundle is backed by a one-year warranty.What's in the BoxSound Blaster Wireless for iTunes USB sound card, Sound Blaster Wireless Receiver, remote control, power adapter, audio cable (1/8-inch to stereo RCA), installation CD, and quick-start leaflet.Enjoy music from your digital library anywhere in your home without the need for wires.", "title": "Creative Labs Sound Blaster Wireless Audio Transmitter and Receiver Bundle", "price": 49.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41e42NtYLIL._SX300_.jpg", "related": {"also_bought": ["B001VNBI2E", "B002BDU93C", "B002Q86FOO", "B001BS3A3E", "B001S14DYO", "B001RNOHDU", "B0002J1LES", "B0044DEDC0", "B0060SXDRI", "B004J2TPSI", "B004VM1T5S", "B00713RSE0", "B0049P6OTI", "B000Q8UAWY", "B004JK7D3Y"], "bought_together": ["B001VNBI2E"], "buy_after_viewing": ["B00E953OJQ", "B00FB1NTP6", "B00713RSE0", "B001VNBI2E"]}}