{"asin": "B000KA7PD0", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Mice"]], "description": "Amazon.com Product Description When you place your hand on the Microsoft 69K-00001 Natural Wireless Laser Mouse 6000 for the first time, you'll wonder how you've ever managed without it. Offering an unmatched package of ergonomic design, accuracy, style, and advanced features, this mouse is designed to conform to your hand in its most relaxed position. This breakthrough design with a tilted, elevated hand position is designed to reduce pressure the carpal tunnel and wrist, and it will give you the comfort and performance that you deserve.The Natural Wireless Laser Mouse 6000 is ergonomically designed to conform to your hand in its most relaxed position and is loaded with advanced features.The battery-life indicator warns you when the battery is running low.Smooth 4-Way ScrollingFeaturing high-definition laser technology, the Microsoft 69K-00001 offers laser precision as you scroll through your files. Smoother tracking means less strain on your hands and wrists, and higher responsiveness means you'll quickly notice an increase in your productivity. The mouse also offers four-way scrolling, adding even greater efficiency and comfort to your work. The entire scroll wheel tilts from side-to-side and reacts to how quickly you roll the wheel for smooth, accurate maneuverability. For example, imagine yourself working with a super-wide spreadsheet loaded with data. With the Laser Mouse 6000 you can tilt the wheel from side-to-side to scroll right and left without having to click-and-drag the application's tiny scroll bar or arrows. And if your desktop is cluttered with too many items to find what you're looking for, don't fret. This mouse has a built-in Instant Viewer -- just click the scroll wheel button to display your open windows, then point and click to select.The MagnifierIf you work with loads of digital imagery, you'll love the mouse's magnification feature. With this feature, it appears that you have a magnifying glass pressed against the screen. With a simple press-and-hold motion, the Magnifier enlarges the area of your screen that fits inside the lens. You can easily adjust both the size of the lens and the level of magnification. So when it's time to touch-up photos or fine-tune detailed tasks, the Magnifier will quickly become your best friend. (The magnifier works with most programs, but it is not compatible with Direct 3D API in full-screen mode, media players, OpenGL, or Layered Windows. Also, if you're using Mac OS X, the Magnifier enlarges text and images on the entire screen.)Battery LifeThis mouse also features advanced Microsoft technologies that help prolong the life of your batteries, which means that you can spend more time working and less time running back and forth to the store. The 69K-00001 automatically enters standby mode when it's inactive for a set length of time, which minimizes unnecessary battery drain. In addition, the light in the mouse's optical sensor illuminates only as brightly as necessary to provide optimal tracking power. And although it is inevitable that your mouse will eventually run out of juice, the Laser Mouse 6000 comes equipped with a battery life indicator that warns you when the battery is running low.As the name implies, this mouse is completely wireless, which means you'll never have to hassle with cords again. Loaded with five customizable buttons, you'll have quick access to the media, programs, and files you use most often right at your fingertips. The mouse's ergonomic design features soft rubber material and a shape that feels as natural as a handshake. With a sophisticated form, the Laser Mouse 6000 has a cutting-edge look that will complement today's latest technology. So if you work with a computer that runs Windows XP/2000, has an available USB port, and 45 MB of free hard disk space, the Microsoft 69K-00001 could be the mouse you've always wanted.", "title": "Microsoft Natural Wireless Laser Mouse 6000", "price": 289.98, "imUrl": "http://ecx.images-amazon.com/images/I/41xZFGLVMPL._SX300_.jpg", "brand": "Microsoft", "related": {"also_bought": ["B000Q6UZBM", "B000A6PPOK", "B006P2594Y", "B004SUIM4E", "B004M3XDAA", "B00427TAIK", "B002HWRJBM", "B00CKYGN3W", "B0002CE0XO", "B00006B9CR", "B003AU0FLQ", "B005ZLTNN4", "B0039O2SEA", "B00D68ZVY8", "B0011FCV8W", "B00DE83RSC", "B0006VJE82", "B005HU0LX4", "B005OCQBKM", "B0089ZLENA", "B004V94FFW", "B00028ONIA", "B001GAOHOI", "B0083YDJTO", "B000AMJC2K", "B0009Y2WI0", "B004C9QSU6", "B000SR120M", "B009RV2EOI", "B002VR6A9K", "B0016OV5MQ", "B005J7Y99W", "B000UCZILE", "B00E3W16OU", "B0036E8V08", "B005YR1PV2", "B003NR57BY", "B00D4C6NEI"], "bought_together": ["B000A6PPOK"], "buy_after_viewing": ["B00D68ZVY8", "B00CYX54C0", "B00BIFNTMC", "B002HWRJBM"]}}