{"asin": "B007IVW15Q", "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Cases & Sleeves", "Cases"]], "description": "The elegant Detour 360 is a unique, rotating stand/case for the iPad (2nd generation, 3rd generation, or 4th generation) that couples ultimate protection with functional styling. The case is designed to snap onto the iPad easily and allow you the freedom to quickly open and close the case when you're on the move, rotate the screen horizontally and vertically in one simple motion, and position the screen at two convenient viewing angles. The sturdy, leather style exterior protects the iPad from bumps and bruises, while the plush microfiber interior cushions the screen from scratches and scrapes. The Detour 360 case provides easy access to all ports and buttons and is \"smart-enabled,\" utilizing the wake/sleep function of the iPad when the case is opened/closed. This case boasts a professional look and a level of versatility that translates easily from the boardroom to a working lunch to leisure time at home. Devicewear is a registered trademark for Devicewear, LLC and no other seller is authorized to sell this iPad case on Amazon. Please watch out for counterfeiters selling this iPad3 case. Devicewear is a registered trademark of Devicewear, LLC. If you buy from any other seller, you will most likely receive a counterfeit product.", "title": "Devicewear Detour 360 Rotating Black Vegan Leather Case for iPad 2/3/4 Case with On/Off Switch (DET-IP3-BLK)", "price": 33.74, "imUrl": "http://ecx.images-amazon.com/images/I/418IijwwzpL._SX300_.jpg", "brand": "Devicewear", "related": {"also_bought": ["B00ADE3XXY", "B0059KTEBC", "B004RDWVUS", "B007PA1K84", "B004TLH7C0", "B008BVZXUM", "B00AT4WOMO", "B004WYA852", "B008UHKTCY", "B00GNGG5AO", "B00A10D00Q", "B00GNGKZ64", "B00B2N7B60", "B00G4EBO24", "B008UHK3KM", "B00DY6KZ2A", "B004N62HZI", "B009W9APU0", "B00E3VRZQ4", "B0013FRNKG", "B004SBBD8U", "B005D6Y16K"], "bought_together": ["B0059KTEBC"], "buy_after_viewing": ["B007PA1K84", "B008BW17JM", "B004N62HZI", "B008BVZXUM"]}}