{"asin": "B0009QZDL6", "related": {"also_bought": ["B002ZIMEMW", "B005NJIWYY", "B004AZ38Z0", "B002NU5UW8", "B00GUQJZCW", "B001AHALEC", "B00017LSPI", "B0053EBFBQ", "B005KEL4NI", "B00009XV3M", "B00HWMG44U", "B001KNP3MQ", "B001ENW61I", "B007LTH1X2", "B00BQ5UO1S", "B003UOIMAS", "B00I9GYG8O", "B001AXKY70", "B000NFIW98", "B004TJ6JH6", "B001KELVS0", "0756692423", "B00009UTL1", "B007FH1KX2", "B007FH1LJU", "B006TF37H8", "B00C3KP4U6", "B0083Z6R4W", "B00J44LP6G", "B00IYUCXZS", "B000Y021NA", "B000XB9GV0", "B000UMX7FI", "B005MWKKPG", "B00551636O", "B006TZE0UQ", "B004TGZ7WM", "B001196MG0", "B003Y2KCAY", "B00452V288", "B007G5NNOW", "B007FH8MS8", "B003Y2KC7W", "B005GMV4CU", "B003TLAMV4", "B002CTFNAY", "B003PFKIEK", "B0000B3OUR", "B002P32990", "B000OPB4U6", "B0002GFOSU", "B007RBME2M", "B00A35X6NU", "B005KEL4BU", "B00009UTZA", "B0010CP5DY", "B0019SHZU0", "0321934318", "B00A4EAJAI", "1608955702", "B001GCUO8Y", "B0064T1LWC", "B00HPAPFNU", "B000QDRRIE", "B0055P56V8", "B001WB02Z4", "B00AY0J4OY", "B0049XGNKK", "B00BUXERJQ", "B0007Q9PWQ", "B001QWBM62", "B00JDYPWMU", "B003WA0N70", "0321862694", "B007NDL56A", "B00IAYFD0K", "B001M4HXB2", "B00009R6VZ", "B0009BX0AM", "B004X4UZB8", "B00I3Y3A52", "B004G3NW5M", "B00CXUT5ZG", "1608952789", "B0080JH3YE", "B005J6S840", "B00BBQ8IDS", "B009ZWL940", "B001M4HTAW", "B00FJ0RGD0", "B00E1QXN7Q", "B0000BZL9J", "B004I53EX8", "B007FEFQDA", "B000NM5M8K", "B00EZI194E", "B004YA24WO", "B000YB862E"], "bought_together": ["B002ZIMEMW", "B004AZ38Z0"], "buy_after_viewing": ["B00ATYYPTE", "B001KNP3MQ", "B00HT9MA1W", "B007FH8MS8"]}, "title": "Lastolite LL LR1250 12-Inch Ezybalance Card -Grey/White", "price": 29.75, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31kositoJ0L._SX300_.jpg", "brand": "Lastolite", "categories": [["Electronics", "Camera & Photo", "Accessories", "Batteries & Chargers", "Adapters"]], "description": "The EzyBalance ''point and shoot'' allows you to concentrate on the important part of photography, composition and ''capturing the moment.'' This handy double sided ''pop up'' 18% grey/white card simplifies the complex technical issues surrounding exposure and color correction when working in different lighting conditions. This provides a major benefit when working under pressure at events such as weddings or fashion shows.Key Features:&nbsp;&#x2022;&nbsp;&nbsp; Triple re-enforced stitch line - Over 30 stitches per inch ensures steel rims won't be popping out of the rim tape&nbsp;&#x2022;&nbsp;&nbsp;Collapses to a third of opened size - Close down to a convenient size for portability&nbsp;&#x2022;&nbsp;&nbsp;Pre and Post capture color correction - Can be used to white balance digital cameras or fix color on digitized images&nbsp;&#x2022;&nbsp;&nbsp;Pre and post capture exposure control - Can help determine exposure for cameras or fix exposure on digitized images&nbsp;&#x2022;&nbsp;&nbsp;Collapsible/Reversible/Cleanable - Two wipe clean surfaces in one size makes it easy to take with you&nbsp;&#x2022;&nbsp;&nbsp;Can be used with all digital and film cameras - Not limited to only high-end cameras can be used on throw away film cameras all the way up to large format camerasWhite Balancing the CameraThe EzyBalance features a unique focusing target to enable the camera to focus on the card and take the necessary readings for an accurate white balance setting. Many cameras struggle to actually focus on a plain white or grey area. Have your subject hold the EzyBalance and select the Custom White Balance setting on your camera (refer to your camera manual for instructions). Zoom in so that the EzyBalance fills the entire frame of your camera and take a reading off of the card (refer to your camera manual for instructions).Your white balance is now set so you can re-take the shot with the correct exposure and color balance.BeforeAfterPost Capture - Exposure and Color BalancingThe EzyBalance can also be used as an accurate reference point for post capture manipulation in Adobe Photoshop&#xAE; (and other software packages). All you need to do is take the first shot with the card in the photograph each time you shoot in a different lighting situation.Open the image in Photoshop and use the \"levels\" adjustment window.&nbsp; Select the Grey Eye Dropper and click on the card. Poor exposure and color balance will automatically be corrected. Save these changes as a new action, and apply the action to the remainder of the images from your shoot. All images are then automatically adjusted for you.BeforeAfter"}