{"asin": "B001CM0PR8", "description": "If you were given the keys to your own community, what would you do? Go fishing, collect shells or watch fireworks with friends? Build a snowman, exchange presents with family or decorate your house for the holidays? Take a trip to the city, go on a shopping spree or visit friends from all over the globe? InAnimal Crossing: City Folk, life moves at a relaxed pace, but the world brims with endless possibilities.Build your own communityEnjoy mini-games against friends.View larger.Get to know your neighbors.View larger.Play at all hours of the day.View larger.Feel free to have company over.View larger.GameplayYou make the whole story, as you and up to three other players move into a town and just live life. Befriend your animal neighbors, decorate your house with cool furnishings, fill up your wardrobe, get to know the local wildlife, hop on a bus to visit the new city and just explore the world. There are a million different ways to play. Every charming animal character has a personality: some are grouches while others are chatterboxes. And there's no final goal or high score to hit. The game keeps going for as long as you want to play, and your town will always be there when you return. Move into town, buy a house and then do whatever you want. Time and seasons pass as they do in the real world, so there's always something different happening. Collect more than 2,400 items, go fishing for rare and interesting fish, catch all kind of cool bugs, dig up dinosaur fossils and buried treasure, hang out with other players or spend the day in the city. There's so much to do, and you have all the time in the world to explore it all.DS Suitcase ModeThe DS Suitcase lets you carry your character from your Wii console to a friend's, thus giving people without an Internet connection the ability to experience multiplayer modes. Additionally, you can move your character fromAnimal Crossing: Wild Worldon Nintendo DS and play as him/her inAnimal Crossing: City Folk.Key Game FeaturesThere's Always Something New To Do: In the living, breathing world ofAnimal Crossing: City Folk, days and seasons pass in real time, so there's always something to discover. Catch fireflies in the summer, go trick-or-treating on Halloween or hunt for eggs on Bunny Day. If you're in the mood for something a little faster paced, take a bus to a new urban city area that's unique toAnimal Crossing: City Folk. There you can catch a show at the theater or check out the sales at Gracie's boutique. But if you don't show your face back home for too long, your neighbors will miss you.Play With and Hear Up to Four Friends: Up to four people from your household can live and work together to build the perfect town. Design clothes and patterns, write letters and post messages on the bulletin board for each other, or play online using your broadband connection and invite up to three friends to visit your town using Nintendo Wi-Fi Connection. With the new optional Wii Speak microphone (sold separately), it's like you're all in the same room. The microphone sits atop the sensor bar and picks up the conversation of everyone in the room to encourage a more inclusive experience.Get to Know Your Neighbors: The heart ofAnimal Crossing: City Folkis building relationships with the animals in your town as well as with other players. Befriend your animal neighbors by exchanging letters, gifts and favors. Animals can also move from town to town, bringing their memories and stories from their old towns with them. And since animals are notoriously loose-lipped, they spill all the juicy details.Express Your Personal Style: Customize your town, your house and yourself by collecting bugs, fish, fossils, art, furniture, clothes and accessories. You can also go to the salon in the city to change your hairstyle and get a Mii makeover. Plus, if you design clothes in the tailor's shop, animals will wear them and maybe even bring them to other towns.Your NeighborsFamiliar faces such as K.K. Slider, Tom Nook, Blathers and Mr. Resetti all appear, as well as a bunch of new characters like Festivale host Pav&eacute; and Bug-Off judge Bud. Many characters who occasionally visited your town in previous Animal Crossing games have now set up permanent shop in the city, so you can see them anytime.Special Powers, Weapons, Moves &amp; Features:Use the Wii Remote pointer to type letters, use items, draw designs for clothing or wallpaper, drag clothing or items onto your characters, interact with animals or objects, or lead your character around the world. Use Nintendo Wi-Fi Connection to hang out in real time with up to three of your friends. You can also send them e-mails and text messages from the game. Play at different times of the year to experience different activities, holidays and seasons. And when visiting a friend in another country, experience the holidays native to their culture.Nintendo Wi-Fi ConnectionUp to four people can play together in real time via Nintendo Wi-Fi Connection. The host opens his or her gate to allow friends into the town, where they can perform all sorts of activities: fish, write letters to townsfolk, shop at the store, swap items, play hide-and-seek ... anything. Up to four players can interact in real-time, communicating via text chat, mic chat and emoticons.WiiConnect24:Using WiiConnect24, you can buy and sell items to friends by participating in silent auctions, view actual players' homes in the Happy Room Academy office or send letters to other players' towns.", "price": 54.25, "imUrl": "http://ecx.images-amazon.com/images/I/61UUwCpgc2L._SY300_.jpg", "related": {"also_bought": ["B001EZ8IBS", "0761561196", "B0009Z3MQK", "B00006FWTX", "B0018RYC9Y", "B000FQ9QVI", "B002OKUELE", "B002HJYKG2", "B0009VXBAQ", "B001GIUWX0", "B003ZCH7DI", "B001HB7KAO", "B0053BCML6", "B000Q4SREG", "0307897079", "B000LSJKAM", "B002BUUMNC", "B005FYJA52", "B002GEKIOG", "B00K361W6M", "B002BSA388", "B004WMM2NA", "B002BS47L2", "B0050SVGW8", "B000NNDN1M", "B000YDIYFG", "B00282WKEW", "B0009YDS0Q", "B0094X2066", "B000WINB56", "B00JM3R6M6", "B00273ZAH6", "B002BRZ9G0", "B004C34D2M", "B002I0GEXM", "B0018SRLGE", "B0019R4VCQ", "B00AZQGZVM", "B000GHLBUA", "B0013E9HP6", "B00DC7G2W8", "B000OAJKI4", "B0094X28J0", "B006QRNKOO", "B004MNDCTC", "B005QWYKOE", "B002JCMYW4", "B006L1FAK2", "B0045F8QDE", "B0050SVGU0", "B00F03Y0SU", "B000FUWCRY", "B002DY9KAM", "B000066JRN", "B007ZZGLMO", "B000IMWK2G", "B00E9GQX02", "B002I08UPC", "B0081716P2", "B0094X221O", "B000FRV2UK", "B007MM9E4C", "B005EHQJ2C", "B004JKZUJI", "B000A15K0Y", "B00GBLVZR4", "B0000E5U6M", "B0094X20IO", "B0017Q4DGI", "B004IK24MU", "B0015MMN6G", "B00559XGG6", "B0013OL0BK", "B00G0OYHCW", "B003ZHMMEM", "B0041TD3O6", "B002672Z80", "B004W1IX1G", "B009APQGMW", "B0007D4MVS", "B0081X5TV8", "B00BS520SG", "B002BSC54I", "B000E36ONK"], "bought_together": ["B001EZ8IBS"], "buy_after_viewing": ["B004WMM2NA", "B0053BCML6", "B00006FWTX", "B0009Z3MQK"]}, "salesRank": {"Video Games": 2363}, "categories": [["Video Games", "Kids & Family", "Wii", "Games"], ["Video Games", "Wii", "Games"]]}