{"asin": "B000FDOTN6", "description": "The 2007 edition of EA's unstoppable football franchise--Madden NFL 07. In its 17th installment, you control the running game like never before. For the first time ever, step up as the lead blocker to create a hole, and then take control of the tailback and smash through, overpower, or slash away from would-be tacklers as you fight for every yard. Innovative rushing controls give you a game-breaking ground attack featuring all-new jukes, cutbacks, and the distinct running styles of your favorite backs.Features:Lead-blocker control: throw the perfect block and create a running lane with all-new lead blocking control, and then take command of the tailback and rip off a big gain.NFL Superstar: Hall of Fame mode: Play your way to the Pro Football Hall of Fame by taking complete control of any position on the field. Your actions on and off the field determine your impact on the game.Run like the players run with the all-new highlight stick: Bust out player-specific running styles matching those of real NFL players (e.g., smaller backs slash to break tackles, while bigger runners bowl over defenders in the open field). All-new jukes, cutbacks, and power moves.Additions to Franchise mode: scout collegiate prospects with the all-new NFL Draft Scouting System and the College All-Star Game, or watch players around the NFL impact their teams with the new Franchise Player Roles feature.Team-specific defensive playbooks: for the first time, use actual plays from your favorite team's defensive playbook to shut down the running game, pressure the quarterback, or force key turnovers.Online play: climb the leaderboard as you take on your biggest rivals from coast-to-coast in Play Now or Session Match games.Plus:The season begins in mini-camp (XBOX 360 only):Create a player then build up his attributes by running him through skill-based, combine-type mini-games. In the off-season use Mini-Camps to condition players or rehab injuries to get back on the field faster.Madden gamer level (XBOX 360 only):Track your career accomplishments in Franchise mode to earn Madden Gamer Points, and then wager your rewards against the computer or against live online opponents to reach the ultimate reward--the NFL Hall of Fame.Replay challenge (XBOX 360 only):Throw the red flag and challenge any play. Overturned calls or plays \"that stand\" have a huge effect on the outcome of every game.", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/519WVW0M3ML._SY300_.jpg", "related": {"also_bought": ["B000P0QJD2", "B0009WPZMC", "B0012N5MUC", "B001UU1WTC", "B002I0JB6E", "B000FDOOEA", "B000P0QJQO", "B003O6EAM6", "B000GJTAVK", "B0015E4G4G", "B001S86IRW", "B002C7TFJQ", "B000LXNJPE", "B003IMGC2C", "B000E260LM", "B00386ZE6I", "B001B0BB3S", "B001LX4BMI", "B00009IM2C", "B00020V4NK", "B000B7Q4BQ", "B004P8GL60", "B002VAWXO8", "B000GEBV1W", "B000M5KPYY", "B000TGB4QO", "B0000690ZV", "B006VB2UNM", "B000GE8OYE", "B00AY1CT4U", "B00004U5VN", "B001EYUTU2", "B000QMUZES", "B0018Z2PXQ", "B000GEDLME", "B000FDMV54", "B000FDOTYU", "B001D7T2XA", "B002WW68C8", "B00005NZ1Q", "B004CDGG4U", "B000GJX700", "B001AZ7RLE", "B00118T6G4", "B00009IM29", "B0053BKSTO", "B002BCOC3G", "B000NIJ36G", "B000B7Q4CA", "B000JHH85Y", "B002I0JK38", "B0002IJY2U", "B0018421C2", "B006VB2UO6", "B000NA6M2C", "B000FW8FK0", "B000QMUZAM", "B002BSA2LQ", "B000F0UT38", "B007M6W38W", "B0014FMHE2", "B001B0BB56", "B000GPXS7Q", "B000S1MMEI", "B001D25M1Q", "B00083G5BW", "B002I0J4FW", "B000V1OUUE", "B003V63V2E", "B003ZSP0WW", "B000P0QIM4", "B002I0HAC6", "B00002SUM1", "B000P0XA3O", "B003A0VUHY", "B00C710AZ0"], "bought_together": ["B000P0QJD2", "B0012N5MUC"], "buy_after_viewing": ["B000P0QJD2", "B001UU1WTC", "B0012N5MUC", "B002I0JB6E"]}, "salesRank": {"Video Games": 5411}, "categories": [["Video Games", "Kids & Family", "Xbox 360", "Games"], ["Video Games", "Xbox 360", "Games"]]}