{"asin": "B0009HMN6S", "description": "LapWorks offers 4 Laptop Desks to choose from - each one for a different purpose for your mobile computing needs.The LAPTOP DESK 1.0 is a heavy duty lap tray only, the LAPTOP DESK 2.0 is also a heavy duty lap desk that is also a typing stand, the ULTRALITE LAPTOP DESK is our super thin and under a pound lap desk and the FUTURA LAPTOP DESK is our stylish laptop desk.For those who just want a strong, durable, and portable lap tray to make their mobile computing experience comfortable and ergonomic, the Laptop Desk 2.0 is an excellent choice. It acts as a physical barrier to protect your lap from the notebook's heat source and reduces overheating in your notebook by up to 20%. The LTD 2.0 is also a 5-position incline typing stand to improve your typing ergonomics. The Laptop Desk 2.0 can easily fit into your backpack or laptop bag for quick transport.The Laptop Desk 2.0 has a companion accessory called the MouzPad. It's a 6\" x 9\" snap-on, snap-off extended mousing surface that adds an extra 3\" to the units overall length. To order both units together search for \"LTD20.CMOPK\".NOTE: The Laptop Desk 1.0 and Laptop Desk 2.0 are our heavy-duty lap desks made of Polycarbonate plastic - the same material used to make bullet-proof glass. They are proven to support the weight of a 12 lb. bouncing bowling ball and designed to lock into a completely flat plain for your notebook computer.To achieve the \"locking\" in flat mode you will feel some resistance when opening the unit. To overcome the resistance simply open and close the unit quickly 10 to 15 times. This practice warms up the material and reduces the opening resistance substantially.The Laptop Desk 2.0 color scheme is black Polycarbonate plastic and black no-slip rubber. Opened flat the 2.0 measures 20-1/2\" long by 11\" wide by 3/8\" thick. Folded in half it measures 11\" by 10-5/8\" by 5/8\" thick and weighs 1 lb 6 oz.", "price": 39.95, "imUrl": "http://ecx.images-amazon.com/images/I/311zTRrylCL.jpg", "related": {"also_bought": ["B001B8WNI2", "B00BIULEJC", "B004CQGAYS", "B004I1GHY0", "B0090NNFHS", "B00544BT2A"], "bought_together": ["B00BIULEJC"], "buy_after_viewing": ["B002WER27Q", "B002Q893CK", "B00FZM93C4", "B0084NQGGC"]}, "salesRank": {"Software": 2135}, "categories": [["Electronics", "Computers & Accessories", "Laptop & Netbook Computer Accessories", "Bags & Cases"]]}