{"asin": "B000OE2OPG", "description": "Take your media everywhere with the versatile Cowon D2 4GB Portable Media Player. Featuring a 2.5-inch LCD touchscreen, wide video and audio file format support, audio recording via internal microphone or line-in jack, FM radio, clock/alarm, TV output, and more, all in an ultra-portable package.A high-profile feature set in a compact form factor.Use the TV Output for sharing your videos and images.Compact Size. Jumbo View.The D2's touch-sensitive, 16-million color 24-bit LCD 2.5\" LCD screen maximizes your viewing experience. Enjoy finer details and richer colors from your movies and images. Also, sharing memories with your loved ones has never been easier. Watch it, read it, view it on your big screen TV or high-resolution monitor using the TV output.Touch screen interface.Use the D2's stylus touchpen for navigating your player's contents. It also doubles as a kickstand for extended viewing. The \"Virtual Click\" overlay navigation function lets you enjoy the convenience of navigating through the other contents in your player while watching video. Detailed information such as file size, pixel, format can be viewed while browsing through files. The direct searching feature allows you to move instantly to the position you've clicked on from the progress bar while you're playing music or movies.Format FreedomDon't limit yourself. The D2 will play MP3, WMA, OGG, FLAC, APE and WAV file formats. ID3 support lets you browse your files by artists, genres, and albums. Use the screen to view lyrics while listening to your favorite tunes. Enhance your experience with customizable EQ, bass boost, and stereo effects. The MP Enhance feature compensates for sound quality lost in compression. Cowon's JetAudio VX software is used to create high-compression files for quality playback on COWON D2, and use Jetshell to play and manage your multimedia libraryThe stylus doubles as a stand for extended viewing.Plenty of RoomIn addition to the on-board 4 GB of storage, the D2 supports SD, MMC, and MMC-plus flash memory via the built-in SD card slot. You will never run out of memory. Transfer files freely from/to other digital devices such as digital camera, PDA, and more.Hours of PowerThe D2's rechargeable battery provides up to 10 hours of video, and up to 52 hours of music on a single charge. Wherever you go, free yourself from worrying about interruption of your music. The D2 can be charged via USB cable or standard wall adaptor.Recording FeaturesThe built-in microphone optimized for voice recording can be used to easily record meetings and lectures. Line-in recording capability allows recording of sound output from CDP, MD, TV and other playback devices. Use the clock to schedule recording of FM Radio.Take Your Data, TooCOWON D2 is automatically recognized as a removable disk when you connect it to your PC via the USB cable. USB 2.0 that supports transmission of max. 40 Mbps speed.What's in the BoxCowon D2, Stylus, Earphones, USB Cable, AC Adapter, QuickGuide, Installation CD.", "title": "Cowon D2 4 GB Portable Media Player (Black)", "imUrl": "http://ecx.images-amazon.com/images/I/41kNOWeh7DL._SX300_.jpg", "related": {"also_viewed": ["B00E9O6C96", "B001V5J4KU", "B008RK9XTO", "B002JPITY8", "B007ZRM14E", "B00ECQUY2M", "B00DE15P0W", "B00DE14T9U"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}