{"asin": "B004PAGJNS", "description": "The island of Banoi is a lush, tropical paradise in the South Pacific where its flagship Royal Palms Resort serves as the ultimate getaway for vacationers with money to burn. However, all good things must soon come to an end - and the picturesque resort falls into madness, carnage and chaos after a mysterious and contagious zombie outbreak claims its once peaceful atmosphere. Cut off from the rest of the world, only four individuals who strangely find themselves immune to zombification have the power to protect the remaining survivors from the horrors of the island, to discover what's really going on and find a way to escape before their own fatal ends.&nbsp;&nbsp;&nbsp;&nbsp;Gameplay HighlightsIn keeping with an atmosphere of desperation and survival by any means, Dead Island focuses on serious,first-person actiongameplay with a close-quarter,immersive melee focus.Dead Island'sseamless 4 player co-op multiplayerseeks to provide the most immersive multiplayer experience to date. Players can drop in and out of each other's games at any time with no loss of progress as well as the ability to continue on alone or with others.Withthousands of weapons in-gameto collect, from simple wooden bats to fire-axes to heavy rifles, Dead Island is a collector's dream. This in combination with Dead Island'sweapon customization systemwill enable the player to craft the ultimate weapon to ensure their survival.The ability to enhance and develop your character usingRPG-like elementsincluding an XP/leveling system and un-lockable skill trees put the power in your hands to create and play a unique protagonist.Dead Island's damage system gives an unprecedented visual detail of the effects of each attack on enemies pushing the boundaries of visualized gore.With anopen-world setting, Banoi is filled to the brim with things to do and objectives to tackle, allowing a fresh way to advance both the characters and story at the same time and providing for endless replay value.", "price": 59.99, "imUrl": "http://ecx.images-amazon.com/images/I/61WF0T27osL._SY300_.jpg", "related": {"also_bought": ["B0091KKHJ4", "B00886WO7A", "B00354NANC", "B0050SXX88", "B001SGZL2W", "B0012N94WO", "B001NX6GBK", "B004EQCCI4", "B0050SXLQC", "B002I0K5NC", "B005C2D1YI", "B002EE1P2W", "B003JVCA9Q", "B002I0F5M8", "B004918C4M", "B000HKP88C", "B0036FDHT2", "B00309XHD0", "B0050SX9VO", "B00503E9FY", "B002ZJNWWC", "B0050SXGU8", "B000WMEEBM", "B001ASJIRC", "B0028IBTLG", "B004UDB9SA", "B0050SX2MK", "B000FQBF1M", "B002I0K6DG", "B004QEWVLC", "B001NIP3EG", "B002NN7AKU", "B0050SWUTQ", "B002BRZ6UE", "B003O6E67A", "B001JKTC9A", "B0017ZIIK6", "B000JLIXIG", "B003O6E6EI", "B00198PO5I", "B002I0J82G", "B00269DX5W", "B000ZK9QCS", "B00269QLH4", "B00AYABWY4", "B000UW21A0", "B00163LW7K", "B003GT8IL0", "B0050SXFKE", "B0050SWZHS", "B003L8DXOI", "B004HYK8Y8", "B003O6KWZK", "B000X1TC0U", "B0022TNO7I", "B008J16APQ", "B000P46NMA", "B001D7T2VC", "B00EPIG606", "B0012N5MIO", "B0023CBZ70", "B001RTCOWA", "B00CP1URD2", "B004FUI84G", "B002BSA1C6", "B002I0K6Q8", "B002I0J5UQ", "B006ZTHFPS", "B004ML44Y6", "B003Q55YCU", "B002TDIEEK", "B0050SXKU4", "B008CP6RUW", "B001E8VB6O", "B003O6CBIG", "B003FBL85M", "B0016B28WU", "B00BMFIXKQ", "B0030CYE8O", "B0050SXOD2", "B0045U01OG", "B0053BQU4G", "B00319DX4M", "B003P9FRGA", "B002I0H2G0", "B002I0GX88", "B003C1I06U", "B004EDJOYC", "B002I0J5YW", "B004FS8LYK", "B0088I7L76", "B001TOMQOY", "B0085CA8QG", "B00B59L9T6", "B007CM0K86", "B001B1W3GG", "B008XMSR6G", "B004FYJFNA", "B0012NAPNQ", "B007TYC8MI"], "bought_together": ["B00886WO7A"], "buy_after_viewing": ["B0085CA8QG", "B00886WO7A", "B0050SXX88", "B00BMFIXKQ"]}, "salesRank": {"Video Games": 2566}, "categories": [["Video Games", "PlayStation 3", "Games"]]}