{"asin": "B00032AVN6", "categories": [["Electronics", "Security & Surveillance", "Security Sensors"]], "description": "The GE 51107 Personal Security Alarm Kit includes everything you need to help secure your home, including a deluxe door alarm with a four-digit keypad and three independent window alarms. Best of all, there's no wiring or drilling required for installation. This simple-to-use, cost-effective security solution helps protect you and your family against home invasions thanks to each of the 120-decibel alarms, loud enough to make a would-be intruder think twice about entering through your doors or windows..caption {font-family: Verdana, Helvetica neue, Arial, serif;font-size: 10px;font-weight: bold;font-style: italic;}ul.indent {list-style: inside disc;text-indent: 20px;}table.callout {font-family: Verdana, Helvetica, Arial, serif;margin: 10px;width: 250;}td.callout3-c26 {height: 100 percent;background: url('http://g-ecx.images-amazon.com/images/G/01/th/content_26/Q2_2009/c26-jasco-callout.png') repeat-y;border-left: 0px solid #999999;border-right: 1px solid #999999;padding: 10px;width: 250px;}ul.callout {list-style: inside disc;text-indent: -5px;font-size: 12px;line-height: 1.5em;}h5.callout {text-align: center;}img.withlink {border:1px black solid;}a.nodecoration {text-decoration: none}The GE 51107 Personal Security Alarm Kit Features:Deluxe door alarm with a four-digit keypad for entering a custom codeThree window alarmsEasy installation that requires no wires or drilling120-dB alarms for maximum protectionChime mode that sounds each time a door or window is openedA 120-decibel alarm warns you of unexpected visitors and deters would-be intruders.View larger.This kit includes three window alarms, along with a door alarm, batteries, and double-sided tape.View larger.Easy to Install and Requires No WiringThe GE51107 Personal Security Alarm Kit couldn't be any easier to install. Simply mount the deluxe door alarm and any of the window alarms using either double-sided tape or screws (included). Next, check that the batteries are fresh using the battery test switch or low battery indicator. It's that easy! There's no wiring involved, so the kit is simple for anyone to install.You set your own pin with a 4-digit keypad.View larger.The system is also extremely easy to use. The door and window alarms feature a contemporary design with easy access buttons and controls for simple operation. This straightforward concept makes using the GE51107 alarm kit intuitive, no matter what your technological skills may be.120-Decibel Deluxe Door Alarm with Keypad for Peace of MindThe deluxe door alarm features a four-digit keypad for programming your custom pin, to secure any door in your home. The unit mounts easily with the included mounting plate. No measuring or messing with templates. Using the included double-side tape or screws, simply attach the mounting plate in the desired location and snap the door alarm into place--it's that simple. And best of all it requires no wiring.Using the deluxe door alarm is a breeze. You can select instant or delayed alarms with the flip of an easy-access switch. In the 'Away' mode, you have 45 seconds to exit your home after you arm the system. When you get back home, simply open the door and deactivate the alarm within 30 seconds by entering your custom four-digit code. The 30-second delay helps to eliminate false triggering of the alarm. When you're home, simply select 'Home' mode for an instant alarm.With a 120-decibel siren, the GE51107 Wireless Alarm System Kit is loud enough to alert you or your neighbors of a possible break-in. The siren is sure to scare any intruder, and will give you plenty of warning to alert the authorities and get your family to safety.When not in 'Alarm' mode, all the alarms in the Alarm Kit offer a chime setting that alerts each time a door is opened. This is a great safety feature if you have small children that may make their way outside unsupervised.Three Window Alarms for Added SecurityThe GE51107 Personal Security Alarm Kit also includes three independent window alarms, each with a built-in 120-decibel alarm for even greater home security. With no wires required for installation, protecting any window in your home is as easy as attaching the window alarm to your window with screws or double-sided tape (included). Each window alarm features an on/off/chime switch for easy operation and a battery-test switch for checking battery life. Each alarm requires four LR44 batteries (included) that last up to a year.What's in the BoxDeluxe door alarm with four-digit keypad, three window alarms (batteries included), and mounting hardware.", "title": "GE Personal Security Alarm Kit", "price": 19.47, "imUrl": "http://ecx.images-amazon.com/images/I/41LXaFBhzeL._SY300_.jpg", "brand": "GE", "related": {"also_bought": ["B00178HMCI", "B0014A4JWU", "B000VY0HGM", "B004D8NZ52", "B0000YNR4M", "B002DNE5JE", "B00032CIJQ", "B002B2K1IG", "B0002YUX8I", "B00CDCIP00", "B002S5NJOE", "B0050IP0Y8", "B001D27YC6", "B003XTTIIK", "B000VY7T5E", "B008NXFKLK", "B002675V9A", "B004T4X7U8", "B00BZB97AM", "B001RUEWUQ", "B006ZAFI56", "B002OXQSDE", "B0083QY1TY", "B0013V6S4M", "B00186URTY", "B00JR2V0SS", "B00032ATTW", "B005EP3EH2", "B00404EIQ4", "B005BCL66Y", "B00AE930WW", "B00510OPG4", "B003C7UA0I", "B002YGW3L2", "B005E04MK0", "B00GUBJJ96", "B003CWK4JK", "B008X099PQ", "B000H4C6FG", "B001GS4LU0", "B002M4MVG8", "B002P6EQPW", "B000BQWICQ", "B0000645RH", "B000NCWNG4", "B008X099Z6", "B00515FRG6", "B003S5SOLG", "B0013V8K98", "B0007P2D08", "B00H0FO6BC", "B00BD4YXC8", "B0089OORW6", "B0009V2LU2", "B00FPE6UN2", "B00379ABX2", "B00GWLVRG2", "B00CYA1PGC", "B00EPCNA9C", "B001CZ9MRY", "B00D0Z0JWQ", "B009FGS6LA", "B0061MU0A6", "B002E6RERU", "B000XBMP5E", "B00CWRXEVG", "B00CR0JAT8", "B00BCCNZ7K", "B00A1D90Q6", "B001LJKLT4", "059044736X", "B006O6ADIS", "B00EP6I6QU", "B0052SF0LO", "B000FXW24O", "B004NKSPR8", "B001FD4VNI", "B006ZP8UOW", "B00EGFKOZ6", "B002B3WOW6", "B006LYHED0", "B00004Z4A8", "B004P8K24W", "B001PBYQHG", "B002FCGI8Y", "B00BTKGHDE", "B002OY80OI", "B0007P2CAE", "B002UD5HJO", "B0009SUF08", "B00GWLVR9O", "B00002ND64", "B0000DASUA", "B000GOZZJG", "B001G0MATM", "B0013DQY4O", "B005TE2M5S", "B0034MY2Z0"], "bought_together": ["B00178HMCI", "B004D8NZ52"], "buy_after_viewing": ["B00178HMCI", "B0014A4JWU", "B008NXFKLK", "B0000YNR4M"]}}