{"asin": "B00DE0EPCM", "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Screen Protectors"]], "description": "Protect Your Investment! Why Thousands of People Choose the iSmooth LG Optimus G Pro Screen Protector: Protects this powerful phone against scratches and damage to the part of the phone that's REQUIRED for use: the easily-damaged glass screen It is made from the highest-quality Japanese PET Film for the clearest, longest-lasting screen protection Backed by the ONLY HD screen protector Free Lifetime Replacement Guarantee The iSmooth LG Optimus G Pro Screen Protector Kit Includes: Three (3) Ultra Clear HD Screen Protectors One (1) Large Premium Microfiber Cleaning Cloth Four (4) Dust Removal Stickers One (1) Installation Instruction Card The iSmooth LG Optimus G Pro Screen Protector Easy Install Video iSmooth's Screen Protector Promise(TM) Bubble-free guarantee Screen protector will stay on your device and outlast the use of your phone World's easiest installation: guaranteed easier installation than ANY competing screen protector or your money back Fanatical customer support: we promise to make your experience with iSmooth one you'll love iSmooth creates ONLY the highest-quality accessories for your mobile device investments. We know you want to protect what you own and we're here to help. Every package includes detailed installation tips and instructions as well as a link to our installation video which will show you step-by-step instructions to install your protector bubble-free, the very first time. All of the iSmooth Screen Protector are backed by the iSmooth Lifetime Replacement Guarantee.", "title": "LG Optimus G Pro Ultra Clear Premium High Definition (HD) Screen Protector by iSmooth - 3-Pack - AT&amp;T - Easy Bubble-Free Installation, BONUS Video - Hassle-Free Lifetime Guarantee - Protect Your Investment", "price": 7.28, "imUrl": "http://ecx.images-amazon.com/images/I/41sV6AQm7XL._SY300_.jpg", "brand": "iSmooth", "related": {"also_bought": ["B00DCAX5L6", "B00D1XA71U", "B00CO00P7C", "B00ECWP5FC", "B00DOI1WB6", "B00CTHQATM", "B00CXZI7EG", "B00BMRXWHI", "B00CBTPOGS", "B00D617EWW", "B00CW1N4P8", "B00D1XB72S", "B00CTHQ6NC", "B00CTHQ6SC", "B00E3JCWP0", "B00CUNJYLG", "B00CTHQ9K2", "B00CTHQ5EM", "B00BMRXYGW", "B00BGELLIO", "B00E0CRTXA", "B00COPRHT6", "B00ECWP5IE", "B00F01M04I", "B00D615T2Y", "B00EO7FLRM", "B00D616SLA", "B00BJS9LPM", "B00C7FFTX4", "B00C7FFE4S", "B00COJN4EO", "B00D9J81TG", "B00HCRSATC", "B00EQMKLMU", "B00CTHQ5AQ", "B00DXD5V7I", "B00D6169IW", "B00DSS4UVG", "B00F13M6S0", "B00F13M6MQ", "B00DD9MS3W", "B00DC929P0", "B00FDX4U1E", "B00F61JLF8", "B00F01M05W", "B00E3JCB60", "B00DXD61WW", "B00DL1K5N2", "B00DCAYUB0", "B00DEVORLK", "B00DUFFW6E", "B00DC2DQCW", "B00AGABISW", "B009QZH7BU"], "bought_together": ["B00DCAX5L6"], "buy_after_viewing": ["B00DD9MS3W", "B00D3SF9NY", "B00GHD28BS", "B00CUNJYLG"]}}