{"asin": "B000U6XE7U", "categories": [["Electronics", "Home Audio", "Stereo Components", "Speakers"]], "description": "Now Any Speakers Can Be Cable-FreeWhy aren&rsquo;t wireless speakers commonplace? The problem is ensuring a reliable signal that&rsquo;s free from  interference in homes full of potentially conflicting devices. The risk of signal interference exists because  the only broadcast space available for wireless systems is the 2.4GHz frequency, the same one used by Wi-Fi  routers, Bluetooth devices, digital cordless phones and even microwave ovens. Because it&rsquo;s such a widely used  frequency, it has been difficult to create wireless speaker systems that can operate free from signal  interference.KEF has developed a remarkable solution that combines signal transmission, reception and processing  technologies that at last makes high-performing wireless speakers a reality: the KEF Wireless System. Superb  signal reliability is delivered with CD-quality sound that is a match for even the most demanding audio systems.  Set-up is simple and you can locate your speakers almost anywhere in the room. The KEF Wireless System is  compatible with the full range of KEF speakers, but can also be used with most other speaker brands. If the  problem of hiding lengthy cables has restricted where you put your loudspeakers, now you&rsquo;re free.", "title": "KEF Universal Wireless System (Black) (Discontinued by Manufacturer)", "price": 269.0, "salesRank": {"Electronics": 147862}, "imUrl": "http://ecx.images-amazon.com/images/I/41RBnb7KZPL._SY300_.jpg", "related": {"also_viewed": ["B001GXQOUU", "B008BNO40U", "B000VEP3XO", "B003F7R7SI", "B000I5PGLU", "B00GC8T5VY", "B0049Z89MS", "B004K6LETQ", "B00814NSQ0", "B004CX9L4M", "B0029LHVO6", "B004CXBJHY", "B00A4V22G0", "B003IR7GP4", "B00AXYKF30", "B004TML09K", "B00GC8THKI", "B007JGAVUM", "B007JGAVWU", "B004Q6L6JI", "B0015EDVVU", "B00CFEXF2O", "B00C27S3WG", "B00CGY4PAO", "B00CFEXGDM", "B008TCW2LG", "B004AOZANE", "B005N6ICXS", "B006U1YV4E", "B0077V88V8", "B00BD7UVPI", "B00BLGUKEI", "B00DQMJE7E", "B003R6U6HG", "B004VM1T5S", "B000289DC6", "B00BLGUKFC", "B000OG88NQ", "B001202C44", "B00IQBSW28", "B00B7X2OTY", "B001AVRD62", "B00ID2HGP4", "B003B8VBJ2", "B0049P6OTI", "B00CAAJDP6"], "buy_after_viewing": ["B001GXQOUU", "B003L1ZYYW", "B008BNO40U", "B000VEP3XO"]}}