{"asin": "B00005UNWB", "description": "The publishers ofGrand Theft Auto IIIare back with another game  geared towards a mature audience. But fans ofGTA IIIshould note that  whileState of Emergencycontains adult themes and extremely violent  gameplay, that's pretty much where the similarities end. WhereasGTA IIIwas about creating a deep experience unlike any other video game,SOEis  a throwback to arcade beat-'em-ups likeSmash TVandDouble  Dragon. However, the game takes the genre to a new level with mind-blowing  graphics.InState of Emergency, you play as one of five selectable characters  that's going up against the Corporation--a tyrannical group that has the city in  an iron grip. The city is in a state of disarray and the citizens are rebelling.  Amazingly, up to 250 characters can riot onscreen at once. It's shocking that  the developers were able to render so many moving characters while keeping a  smooth frame rate. Basic gameplay consists of picking up numerous weapons and  objects to cause as much damage as humanly possible. Providing context to the  mindless violence are the revolution and chaos modes. The former is the game's  story mode and features more than 175 missions, while the latter is a  single-session mode with a few variations.For the most part, the game is an enjoyable cacophony of senseless violence, but  there are some flaws. Although the revolution mode boasts an impressive number  of missions, they do get repetitive. The game screams for a multiplayer mode,  but it's strictly one player. In spite of these flaws, the game remains  addictive and fun. It bears repeating that gamers looking for anotherGTA  IIIwill not find it here: this game provides an arcadelike experience  that's excellent, but in a very different way. Parents should note that this  game carries a Mature rating for its blood, violence, and gore.--Raymond M.  PadillaPros:Amazing number of characters onscreen simultaneouslySimple beat-'em-up gameplayA vast arsenal with which to inflict damageCons:Missions get repetitiveNo multiplayer modeBland soundtrack", "price": 24.23, "imUrl": "http://ecx.images-amazon.com/images/I/41XGWK253WL.jpg", "related": {"also_bought": ["B000CMOLFG", "B00005OLX1", "B00005J536", "B0001ADAME", "B00005J32C", "B0001AVZ5I", "B00004UFRD", "B000KCX9M4", "B00005ML10", "B0000696CZ", "B000NIJ35W", "B0000A92KX", "B0000A8VBZ", "B0007PLKZM", "B00004YRQA", "B00005CF9L", "B00004UFRI", "B000NGWFX6", "B000TLU67W", "B0009SQF0C", "B000095ZH6", "B00009WAVI", "B00006Z7I3", "B0000664JF", "B00005NUJ3", "B0001VGFK2", "B000M4H6RE", "B0022TNO6E", "B000066TS3", "B00008DHNL", "B0000VSH3G", "B00005BIG7", "B00007D02V", "B00005NN5G", "B0000A09EM", "B000088KH1", "B00005NN5A", "B00004U5VF", "B00006GSNX", "B00005O0I2", "B0000A03AI", "B00004U5VJ", "B000930DLO", "B00020LZBG", "B00000DMAR", "B0000A03AE", "B000099T2H", "B000A32O4W", "B0002EJ8FC", "B00097CYZS", "B0009Z3HXI", "B0002IQCSY", "B0000A082Y", "B0002IQI0Q", "B000E5N4SQ", "B0000A03AG", "B000277J00", "B0000B0MNH", "B00008XL08", "B001MW91IW", "B00069FK00", "B000056SNY", "B000B69E9G", "B0009PETYO", "B0045L3SNQ", "B00004TEXU", "B000066JRQ", "B0002GTFIU", "B0009UUQGE", "B00005V9NI", "B0007ULFL6", "B000099T1Y", "B0009351R0", "B0000503MO", "B00004WLQV", "B0009VQANG", "B000EHQDA0", "B0000TSR4C", "B00005B70Y", "B00006LEMX", "B0002XL3AG", "B00004YRQ9", "B00005ML0Z", "B000069BCR", "B0000631VL", "B00005Q8M4", "B00009WAVD", "B00019HNNC", "B00005YVTO", "B000R37S78", "B0002XL3BA", "B00005ML0X", "B0007M221Q", "B000930DOQ", "B00005NOFH", "B00000K3X9", "B00023B1SU", "B0000859TO"], "bought_together": ["B000CMOLFG"], "buy_after_viewing": ["B0000A8VBZ", "B00007KE6D", "B00006Z7I3", "B000NIJ35W"]}, "salesRank": {"Video Games": 16467}, "categories": [["Video Games", "More Systems", "PlayStation 2"]]}