{"asin": "B009FPUBBE", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]], "description": "The Accessorise Your Life (TM) Portable Bluetooth Wireless Mini Speaker System is an extraordinary audio device. It offers the right balance between sound quality and portability.The AYL BSPM001 can be connected to listen music with Bluetooth wireless or 3.5mm headphone connector. Its powerful built-in amplifier produces exceptional sound while its high capacity battery facilitates up to 10 hours continuous playback on a single fully charge.Enjoy and share your music, movie and games, presentation, anytime and everywhere.Compatible with all audio player and multimedia devices with a Universal 3.5mm Audio Jack, connects to your multimedia device through the standard 3.5mm Audio SocketThe portable Bluetooth wireless mini speaker can be put into a purse, computer bag, or backpack for easy carry around and travel.Connect to your iPad, iPhone, iPod touch, MP3/MP4/MP5 Player, Mobile Phone, Games Console, Netbook, Desktop, Laptop, Android and other portable devices for a truly remarkable experience indoors and outdoors!Package Includes:1 Accessorise Your Life (TM) Portable Bluetooth Newest Version 4.0 Wireless Mini Speaker1 USB Cable with two 3.5mm Audio Jack1 Universal charging USB Cable1 User Guide1 Accessorise Your Life (TM) Soft Black Velvet Pouch3 Year Worry Free Warranty", "title": "Winter Clearance Sales! BLuetooth speaker only for $20.99!! AYL Portable Bluetooth Wireless Version 4.0 Rechargeable Mini Speaker System for iPhone/ PC / Cell Phone / Tablet / Car /MP3 Player (Silver / Blue) with Built-In Speakerphone", "price": 16.99, "salesRank": {"Cell Phones & Accessories": 14782}, "imUrl": "http://ecx.images-amazon.com/images/I/51TggveH3wL._SX300_.jpg", "related": {"also_bought": ["B00DJNCS6O", "B004C51HRY", "B007OYAVLI", "B0073FE1F0", "B006K3IE36", "B00FJILVDS", "B004HHICKC", "B004B8GF7Y", "B002TSA948"], "bought_together": ["B0073FE1F0"], "buy_after_viewing": ["B006K3IE36", "B00FJILVDS", "B0083UU1OO", "B007OYAVLI"]}}