{"asin": "B000YQ6DIS", "description": "Amazon.com Product Description The Monsoon HAVA Titanium HD WIFI lets you extend your home theater experience, both within your home and beyond! With WiFi built in, the HAVA accepts an HD video source and wirelessly streams it throughout your home in DVD-quality video. You can also watch and control programming on any PC or mobile phone with a broadband Internet connection..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The Monsoon HAVA Titanium HD WiFi:Wirelessly streams your HD television programming through your home network.Automatically adjusts the encoding for smooth video delivery depending on your network bandwidth.Lets you watch local programming on your cell phone or from anywhere else you have broadband Internet.Has additional USB port that can support an external hard drive for PVR recording.You'll have control of your A/V components from your computer, complete with customizable virtual remote.View larger.Wireless networking is built-in, so you can stream your video throughout your home without any cables.View larger.Wirelessly Stream Live Programming Around Your HouseBy connecting your HD video source to the HAVA Titanium HD WIFI, you can wirelessly stream live television to multiple PCs around your house using your home network. The video is streamed wireless via an 802.11g network, and the Titanium HD WIFI automatically adjusts the encoding based on dynamic calculation of the bandwidth to ensure smooth video to all clients on the network. In addition to the wireless, there are also wired Ethernet connections available.Programming comes in at DVD-quality wherever you are in your home, and multiple users around your house can watch/record the same program at the same time thanks to VBooster Multicast technology.View Television Remotely From Virtually AnywhereThe HAVA Titanium HD WIFI allows you to watch your local television programming, or programming from another connected A/V device, from anywhere in the world with a broadband Internet connection. As you are watching, other members of the household can also watch the same programming on the home network. You can even remotely control the settings for virtually any A/V device, including PVRs, satellite TV, and digital cable boxes; a customizable virtual remote will show up on screen allowing for complete control of the device. It's like having a remote control that works everywhere!Works as a PVR!The HAVA Titanium HD can also function as a PVR. You can record, pause, fast forward, and rewind live TV right on your computer. Recorded shows are stored on your PC's hard drive, or on an external USB drive (sold separately). After you've recorded shows, you can burn them onto DVD for archiving or viewing during those instances when you don't have an Internet connection. The HAVA works out of the box with Microsoft MCE, or you can install the included PVR software for non-MCE PCs.Using the HAVA mobile player software, you can watch television on your cell phone.Compatible with Windows XP, Vista and Media Center PCs and NotebooksWhen you connect HAVA Titanium HD WIFI to your network, you are in essence creating a virtual TV tuner for Media Center PCs. This eliminates the need for a separate TV tuner card, and the need for any hard-wired cable connection.Two USB Ports for UpgradeabilityThe Titanium HD WIFI has two built-in USB ports, allowing for upgrade possibilities. The wireless functionality is provided by a USB 802.11g dongle, and this can be optionally upgraded with a USB 802.11n dongle to stream higher quality video. You can also connect an external USB hard drive for use with recording shows.High-Quality ViewingBy employing the standard MPEG-2 format, the HAVA Titanium HD WIFI achieves the best possible video quality over a home wireless network. (Of course, you can also view using wired connections if you have any computers that lack wireless capability.) Television programming that is streamed through your home network boasts DVD-quality clarity. The video is also simultaneously encoded with the MPEG-4 standard, which has a higher compression and allows for remote viewing over a broadband Internet connection by a single client.Thanks to the VBooster technology, all the users on the home network can experience high-quality video. While watching video, users can simultaneously use the Internet for regular uses such as web browsing, email, chatting, printing, transferring files, etc. The encoding is automatically adjusted based on the available bandwidth to ensure steady and smooth video all the time.The HAVA Titanium HD requires a home network with either a 10/100 base-T router with an available Ethernet port or a wireless connection, a broadband Internet connection (300Kbps upstream recommended) for remote viewing, and a PC with Windows XP/Vista and a minimum of an Intel Pentium 1.2 GHz CPU, 512MB of RAM for XP and 1GB of RAM for Vista, 75 MB of disk space for the HAVA software, an Ethernet connection or 802.11g wireless capability, DirectX 9-class video card, and an audio output.The HAVA Titanium HD WIFI is backed by a 1-year warranty.What's in the BoxHAVA Titanium HD WIFI unit, two composite cables, Ethernet cable, power adapter, IR blaster cable, two component cables, 802.11g wireless dongle, quick start guide, software CD.Stream television to computers in your home, or to your cell phone wherever you are.", "title": "HAVA Titanium HD TV Device with Wi-Fi", "price": 34.31, "imUrl": "http://ecx.images-amazon.com/images/I/31iq9Nzg8%2BL._SX300_.jpg", "related": {"also_viewed": ["B009FU8BR0", "B004M189OM", "B002AVXDWE", "B0089L4TL8", "B00LIP10KK", "B000VXKD8K", "B005LMWPNM", "B001EZRJZE", "B000IVDIL4", "B009FU8BTI", "B004HO58SO", "B004HKIB6E", "B00GY0UB6I", "B005L9ZZ32", "B000IVDTSG", "B005LS5WS6", "B00GY0UB54", "B005O88CUS", "B0010Y414Q", "B000HBEKJE", "B005FPT38A", "B00198MYB0", "B005E99A8K", "B004JOQSEA", "B00GGVPKKC", "B00BF2M21C", "B007FEEO3S", "B005KOZNBW", "B008RWHC0E", "B005KY3XN2", "B000VA3SYE", "B005H3AU1Y", "B00HA4ORMQ", "B000AMLXHW", "B0002EXJ8Y", "B00009UHXR", "B001Z5140O", "B00BW0XXZ6", "B0018LX0DY", "B0092U3TKC", "B000BGOWIE", "B00630WKGI", "B008TZJ126", "B00AWC51DW", "B00H4FDK9C", "B002UOUQ08", "B0066O1DI2", "B00I482L2K", "B00EEOSZK0", "B0096KLQN0", "B00I2ZBD1U", "B000YQ496G", "B006ZSMGTE", "B007NJ6S9S"], "buy_after_viewing": ["B00DR0PDNE", "B009FU8BTI", "B009FU8BR0", "B004M189OM"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories"]]}