{"asin": "B005SAKW9G", "related": {"also_bought": ["B00D7BYMB2", "B00HGLX8J6", "B00I6BJATW", "B00A14ZTWE", "B00D12OAVE", "B00F6S10MI", "B00HJOKCZI", "B004JM1ZG8", "B0092ML1SC", "B00FJRS6FU", "B00CO8T9VC", "B00F3ZN2W0", "B00AAJ0ZGK", "B00B3WTWXU", "B0092ML0MY", "B006QB1RPY", "B00HPQ0NE0", "B0088PUEPK", "B00HJOJJ6Q", "B00ALYORA4", "B0033Z2BAQ", "B00H7Z7XA6", "B00CUSUV0O", "B00E3W15P0", "B00FCE2YE4", "B00EUUKVXM", "B0049YQVHE", "B00A14ZT8I", "B00F6S10DC", "B00FB45SI4", "B002BH3Z8E", "B00IDG3PRI", "B00FK1E46U", "B005O65JXI", "B00FLMKN6I", "B00H09BB16", "B00K8HNGXS", "B00ALK3HF4", "B005BZNDOO", "B001G0WPLK", "B001NLV4TQ", "B00E3W1726", "B00HRFS1GQ", "B008ABOJKS", "B000OGX5AM", "B009O7YORK", "B00D2CO8WO", "B00I0MKMG2", "B00A14ZT6U", "B0086DCU6A", "B00CO8TBOW", "B00IKMJ9B6", "B006YG9E7O", "B00EUAFAF6", "B00KPRWAX8", "B00DKXXAAQ", "B00AJHDZSI", "B00CRJSX5Q", "B008V9959O", "B00DMJI9TA", "B00DQ5RGOY", "B00EDSI7QO", "B006YG9EEW", "B00213KL5I", "B002UVNW5W", "B00339X1EM", "B006EWUO22", "B00004Z5D1", "B00DWFPDNO", "B008RJZQSW", "B004SUO068", "B00BP5KOPA", "B008OUKZZI", "B00IDWFN4U", "B004KY719A", "B00F6S0XL2", "B000UEZ36W", "B0050119O0", "B00DBPKEOI", "B00CZ58WUI", "B004QBUL1C", "B00G6TAAWC", "B0037TO5C0", "B0092ML0OC", "B00BQ8RM1A", "B00BQ4F9ZA", "B0098FSJ92", "B00AX9Z6MU", "B001R4BT1M", "B00BCXF6O4", "B00FW6T36Y", "B005UBNJ48", "B00F6S10KK", "B00HMRHC6Y", "B005T63BJM", "B007HSKSMI", "B005T3GRNW", "B00CD1FC6G", "B006WAGG14", "B005ARQV6U"], "bought_together": ["B00FJRS6FU", "B00D7BYMB2"], "buy_after_viewing": ["B006QB1RPY", "B002UVNW5W", "B007ZWL1ZE", "B00FB45USW"]}, "title": "Asus Dual Band (2.4GHz 300Mbps/5GHz 300Mbps) Wireless-N USB Adapter with Graphical Easy Interface (USB-N53)", "price": 39.0, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31E4H8NzCfL._SX300_.jpg", "brand": "Asus", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Network Adapters", "USB Network Adapters"]], "description": "ASIN# B005SAKW9GUSB-N53 Dual-Band Wireless-N AdapterPut fast and compatible dual band internet performance in the palm of your hand with the powerful USB-N53 wireless adapter. Better than most built-in notebook Wi-Fi, other external adapters, and rivaling the speed of many dedicated PCI Express cards, this wireless adapter features an intuitive, easy-to-use interface to get the best signal strength and customize settings. Setup is also made easy with plug-and-play, CD-free installation.Other adapters make you choose from either 2.4GHz or 5GHz, so if you want fast speed of the 5GHz stream you have to sacrifice the compatibility that the 2.4GHz offers. But the USB-N53 dual-band capability allows for concurrent, simultaneously 2.4GHz and 5GHz streams to give you the best of both worlds. Beautiful, light, and equipped with ASUS' exclusive networking features, the USB-N53 eliminates the need for a PCIe network card or on-board Wi-Fi &ndash; only requiring a single free USB port. With the included mini USB extension cord, adjust the antenna to receive the strongest signal.This wireless adapter lets you wireless connect other devices to it as an Internet access point with the Software AP. The graphical user interface, EZ UI, centralizes all wireless information into one place with useful real-time information on signal strength and data throughput. The WPS Push Button simplifies secure connections with a single push of a button that detects even hidden routers and internet access points and prompts for passcode access. Additionally, the WPS push button effortlessly syncs to another device with the USB-N53 if both buttons are pressed together.Key FeaturesDual-band 2.4 GHz and 5 GHz connection signals with speeds up to 300Mbps(N600) for best wireless performanceIncluded USB extension cablelets you easily adjust the antenna for the best signal strengthEasy-to-use centralized EZ UI graphical user interfaceprovides useful connection information in real timePlug-n-surf installationfor quick, straightforward installationSoftware APturns into a wireless access point for other devicesWPS functioninstantly and securely connects to routers and internet access points"}