{"asin": "B0042VSTZQ", "categories": [["Electronics", "Computers & Accessories", "Data Storage", "USB Flash Drives"]], "description": "The ultimate card for professional photographers.  Professional photographers need Flash memory they can count on for even the most demanding shoots. CompactFlash Ultimate 600x offers sustained write speed ratings of up to 600x, making it Kingston&#x2019;s fastest card to support high-end digital cameras and devices. It&#x2019;s designed to deliver superior results with fast data transfer and support for continuous shooting.  The CompactFlash 600x card features ultra-fast rates of up to 90MB/sec. read and write, so you can capture more continuous, high-resolution images in less time than with traditional CompactFlash memory cards. For added peace of mind, CompactFlash Ultimate comes with a bonus download of data recovery software from MediaRECOVER to let you recover lost or deleted files and restore corrupt files on Windows or Mac systems.  To ensure that Kingston Flash memory solutions are among the performance leaders in their class, Kingston engineers select high-performance controllers as part of each card&#x2019;s design. Each card is 100-percent tested and you can rest assured that each and every CompactFlash Ultimate card has received a perfect score.  Available in capacities up to 32GB*, CompactFlash Ultimate offers plenty of room for capturing and storing high-definition video and high volumes of images in RAW, JPEG, TIFF and other large file formats. As with all Kingston Flash cards, CompactFlash Ultimate cards are backed by a lifetime warranty, free live technical support and the legendary reliability that makes Kingston the leader in memory.", "title": "Kingston Digital CompactFlash Ultimate 600x 16 GB Flash Drive CF/16GB-U3", "price": 31.97, "imUrl": "http://ecx.images-amazon.com/images/I/51dYoa-PCZL._SX300_.jpg", "brand": "Kingston", "related": {"also_bought": ["B001KELVS0", "B007XC99JQ", "B006G5ZVA2", "B007FH1KX2", "B001NXDB4A", "B005ES0YYA", "B002WE4H8I", "B003RLJVYK", "B0041MY32Y", "B005DECJBQ", "B007DBJ2VM", "B0093HGDVG", "B0058GZWXQ", "B006JINI5G", "B00FSG1INY", "B0093HGD2K", "B00461J0J6", "B000NP46K2", "B004AQ95A6", "B001FO4QHI", "B004UTQRHW", "B002NEGTTW", "B00004ZCJM", "B000T9251O", "B00BXA7N6A", "B0049XGNKK", "B00005K47X", "B00E1JEICC", "B00007B4DM", "B00004ZCJI"], "bought_together": ["B001KELVS0"], "buy_after_viewing": ["B001FO4QHI", "B0093HGDVG", "B002WE4H8I", "B000BNY64C"]}}