{"asin": "B004Q7JRJI", "description": "Intel Desktop Board DH67BLB3 Media Series is based on the Intel H67 Express Chipset and supports Second Generationeration Intel Core processors, including the Intel Core i7 and Intel Core i5 processors and other Intel processors in the LGA1155 package. The Second Generation Intel Core processors feature Intel Turbo Boost Technology and enhanced Intel Hyper-Threading Technology, which provide exceptional computing performance needed for the latest in gaming and media applications. The Intel Desktop Board DP67BL is equipped with built-in capability to adjust processor frequency and memory frequency for Intel Core processors with tuning capability to maximize computing performance as determined by the user. The Intel Desktop Board DP67BL offers premium features such as dual-channel DDR3 1333 MHz memory with four connectors (32GB max), Intel Rapid Storage Technology for RAID 0, 1, 5, and 10, Intel High Definition Audio with 7.1 surround sound and multi-streaming capability, and an integrated Intel PRO 10/100/1000 Network Connection in a low-power design. The Intel Desktop Board DP67BL is designed with a wide range of 1.2 V to 1.8 V memory voltage control to maximize memory DIMM compatibility. Two onboard SATA 3.0 ports promise a new level of performance with 6.0 Gb/s link speed between storage devices and the host. Two back-panel SuperSpeed USB 3.0 ports address the needs of higher performance connections between the PC and increasingly sophisticated peripherals by offering a higher transferring rate of 5.0 Gb/s. Legacy features such as one PCI connector provide backward compatibility for peripherals. The Intel Desktop Board DP67BL features Intel Rapid Storage Technology and supports RAID 0, 1, 5, and 10. Intel Rapid Storage Technology provides new levels of protection, performance, and expandability for desktop platforms.", "title": "Intel Desktop Board Media Series LGA 1155 DDR 1333 Micro-ATX Form Factor - BOXDH67BLB3", "price": 7.92, "imUrl": "http://ecx.images-amazon.com/images/I/51XWv%2Bsc-6L._SY300_.jpg", "related": {"also_bought": ["B004KZDV8E", "B003N8GVUY", "B003ZDJ42O", "B004EBUXIA", "B004EBUXHQ", "B001G0WPLK", "B004JEVGMO", "B00461G3MS", "B0087EVHVW", "B005LLBBSS", "B008F65MO0", "B003O8J11E", "B004SPW7T0", "B006B7R9PU", "B0057FRTPW", "B007S9Q04G", "B007SZ0EHE", "B004DDI0IE", "B002YIG9AQ", "B004W2JKWG", "B004GGUAUE", "B007SZ0E1K", "B004CRSM4I", "B007SZ0ECE", "B000GQMHBI", "B0033Z2BAQ", "B005LLBJ9Y", "B002K27KW2", "B002UOR17Y", "B0083U94D8", "B001EYV690", "B00461LT6S", "B0093H8H8I", "B007SSH3J8", "B0036Q7MV0", "B005LTU54Q", "B0088PUEPK", "B005X64OA8", "B004FA8NNW", "B002G1YPHK", "B0037TO5C0", "B004DHNAGM", "B00698WMYO", "B004FA8NOQ", "B004Q0PT3I", "B004W2JKZI", "B007EHKXS6", "B0093H8NBY", "B002K23V1Q", "B006EWUO22", "B004VFJ9MK", "B00H09BOXQ", "B0049MPQA4", "B004MU8VCS", "B003O2KEPC", "B0039L50J8", "B005CT56R6", "B009654JW0", "B004IZN3K2", "B005869A7K", "B003ZM7YTA", "B004JO10RU", "B0085IZVKI", "B003NREDC8", "B0055LGG3Y", "B0009JZSKO", "B004LB5AZY", "B0093H8GQG", "B004S5CCP4", "B0057Q4ADU", "B007R9CRGW", "B00461K1QW", "B007P71J9W", "B0093H8MTW", "B005LTU6VI", "B0094NXBZ0", "B007R1FH3K", "B007SZ0EOW", "B005LIDU5S", "B007SZ0EJW", "B005T3GRN2", "B009NHAF06", "B005T3GRNW", "B00461E7JE", "B008D1JOLE", "B0064VP70W", "B005CT56XU", "B0026ZPFCK", "B000O8I474", "B0012QLUAK", "B003SALVN4", "B001IZ7MHU", "B000OGX5AM", "B0051YS85O"], "buy_after_viewing": ["B000OGX5AM", "B0088PUEPK", "B0033Z2BAQ", "B009GUXU52"]}, "categories": [["Electronics", "Computers & Accessories", "Computer Components", "Motherboards"]]}