{"asin": "B0025ZH43O", "description": "Overview:World&rsquo;s Most Advanced Tracking &mdash; Go More Places Than Optical or Laser. Take the Microsoft&reg; Wireless Mobile Mouse 6000 anywhere. With revolutionary BlueTrack Technology&trade;, you can work more places than ever before, including on granite countertops, carpets&mdash;even on a wood table or a rough, unfinished park bench.&nbsp; Stylish design for portable computing, now with a Nano transceiver.Features:&nbsp;&nbsp;&nbsp;Plug-and-Go TransceiverLeave the Nano Transceiver plugged in when you&rsquo;re on the go, or stow it    in the mouse.&nbsp;Reliable WirelessExperience a reliable connection and virtually no interference with    Microsoft 2.4 GHz wireless.&nbsp;Advanced ProductivityWork more efficiently with 5 customizable buttons and 4-way scrolling.&nbsp;Additional Features:10-Month Battery Life3-Year Limited WarrantyWhat is BlueTrack?Microsoft&rsquo;s proprietary BlueTrack Technology&trade; works on more surfaces than both optical and laser mice. It uses high-angle imaging optics to generate an accurate picture of the surface.Now track more accurately on:GraniteCarpetWoodSystem Requirements:Windows&reg; 7, Windows Vista&reg;, Windows XP (excluding Windows XP 64-bit)Mac OS X v10.2x3 &ndash;10.5x100 MB30 MB1 AA Alkaline Batteries (included)You must accept License Terms for software download.Internet access may be required for certain features. Local and/or long distance telephone toll charges may apply.Software download required for full functionality of all features.*BlueTrack Technology does not work on clear glass or mirrored surfaces.", "title": "Microsoft Wireless Mobile Mouse 6000 - Black", "price": 99.99, "imUrl": "http://ecx.images-amazon.com/images/I/41zkL4aKOjL._SY300_.jpg", "related": {"also_bought": ["B001B8EUEW", "B008XB0JNG", "B004L0NP48", "B00519UZM8", "B002DPUUL4", "B002JCSCYS", "B002VR6A9K", "B00D68ZVY8", "B006P2594Y", "B0021Y73W6", "B005058AGQ", "B001IOHAVO", "B004HVW0ZQ", "B008B6ONWQ", "B001F7ARTQ", "B00519TSG2", "B00BZC31WQ", "B0031SEMBQ", "B00DRK73IM", "B000A6PPOK", "B00009ESKH", "B007TMYTK4", "B004JO16KG", "B00F4RASK6", "B006JH8T3S", "B004SUIM4E", "B005HU0LX4", "B0013CED4I"], "bought_together": ["B001B8EUEW"], "buy_after_viewing": ["B002DPUUL4", "B008XB0JNG", "B00BZC31WQ", "B003NR57BY"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Mice"]]}