{"asin": "B00000I1BR", "description": "Let me go on record and say that I was never a fan of the original Crash Bandicoot. Even though Crash was disarmingly cute and fuzzy, and even though the game's graphics were just about as good as they got in those days, the frustrating design of the game made playing it such a painful experience that I still have flashbacks when I see small marsupials on the Discovery Channel. But just one short year after his debut, Crash is back in a sequel that is so far superior to the original that I'm willing to forget the mistakes of the past.The new storyline is simple: A very gullible Crash is corralled into collecting crystals for the evil Dr. Cortex and gems for the terrible N. Brio. There are 25 levels in all; each level contains an easy-to-find crystal and hard-to-earn gems. Instead of being forced to approach the game in a strictly linear fashion, you progress through a series of five warp rooms. Each warp room contains five levels, which you are free to tackle in any order. After you have found the crystals in each level, you can progress to the next warp room. This system of warp rooms is a great innovation; it's clear how to progress in the game, and yet you have the option of moving to a different level if you're hopelessly frustrated with one area. Best of all, you can save your game in the warp room at any time (a big improvement over the original game's horrific save system).A lot of variety is packed inside this game. You'll navigate through simple run-and-jump areas, try to outrun a very mad polar bear, work your way through sewer systems, and even fly around with a jet pack. Within each level, the basic gameplay is similar to the original Crash: Running, jumping, and spinning are still the order of the day. Even though most levels are set in a semi-3D environment, Crash Bandicoot 2 is a platform game, plain and simple. The graphics are in a league of their own among PlayStation games, and the music couldn't be better. Unlike the original, Crash 2 is rarely frustrating enough to make you want to throw your controller at the TV. In fact, some expert gamers might find Crash to be a little on the easy side.There are only two real problems with Crash Bandicoot 2. First, the semi-3D setup is sometimes hard to navigate, and you'll find yourself missing jumps because you're unable to judge distances properly. Secondly, the game is just plain cheap at times; in some areas you must sacrifice many lives until you memorize a level's layout.In any event, these problems are balanced out by the game's excellent gameplay and intelligent design. Crash Bandicoot 2 is a topnotch platform game. If you're a fan of the genre, you owe it to yourself to check this title out. -- John Broady--Copyright &copy;1999 GameSpot Inc. All rights reserved. Reproduction in whole or in part in any form or medium without express written permission of GameSpot is prohibited. GameSpot and the GameSpot logo are trademarks of GameSpot Inc.--GameSpot Review", "price": 69.99, "imUrl": "http://ecx.images-amazon.com/images/I/51d8ifuF-xL._SX300_.jpg", "related": {"also_bought": ["B00000I1BQ", "B00000DMAR", "B000034DCF", "B00000I1BF", "B000034DC2", "B00005NCCI", "B00004U4R8", "B00004U4R9", "B0015MMN6G", "B0045L3SNQ", "B000K6TOK6", "B00004XOWT", "B000029706", "B000PWAAAI", "B00000I1BS", "B0001CJEJU", "B00005MA97", "B00001QHW9", "B00000JNHJ", "B000637T7S", "B00006F2ZP", "B0015IXKSK", "B001MW91IW", "B000TLU67W", "B00001QER9", "B000SMIUQQ", "B00001XDK5", "B0018YDK8Q", "B00000K1VK", "B001TEYMRI", "B00005R5PO", "B00008NRM7", "B00001QED2", "B0007KTBB2", "B000GACEHQ", "B000TTXL9E", "B0000C7GHG", "B00004SPYF", "B000034DC7", "B00004TBGT", "B00005NISJ", "B00000IG7T", "B00004YRQ9", "B0000690ZE", "B00002STIW", "9629971372", "B000066TS5", "B000ECX0FQ", "B00005NGLC", "B000021Y5T", "B0062DIGA0", "B007UHQO6A", "B00005V6BP", "B000R3O1HS", "B00000JQQH", "B00001ZWXH", "B00004YRQA", "B000038ABJ", "B000066BZ2", "B00005NN7B", "B00006LU9B"], "bought_together": ["B00000I1BQ", "B00000DMAR"], "buy_after_viewing": ["B00000I1BQ", "B00000DMAR", "B000034DCF", "B00000I1BF"]}, "salesRank": {"Video Games": 2358}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "More Systems", "PlayStation", "Games"]]}