{"asin": "B0054U8UGW", "categories": [["Pet Supplies", "Small Animals", "Houses & Habitats", "Cages"]], "description": "Midwest Ferret Nation Double Unit with Stand Ferret Cage-Find this Spacious Ferret Cage and Multi-Level Rat Cage Online at petco.comDesigned with ferrets, rats and other small animals along with their pet parents in mind, the Midwest Ferret Nation Double Unit with Stand Ferret Cage makes an excellent home for your favorite furry friend. After closely observing how ferrets play, eat, sleep interact, Midwest specifically developed this ferret or rat cage to attend to a small pet's every need for maintaining a contented, happy and safe lifestyle. Intended to be the best environment for small animal pet companions as well as the most user-friendly ferret cage around, this Midwest Ferret Nation cage is a complete and feature-filled small animal habitat that provides the ultimate living environment for ferrets, rodents and many other small pets.This Midwest Ferret Nation Double Unit with Stand Ferret Cage features full width double doors that provide maximum accessibility for easy cleaning and feeding. It also has a wide expansive shelf and full width plastic pan floor to provide a spacious play area and to prevent dangerous falls. Designed with convenience in mind, this special Midwest ferret cage includes ferret-proof dual-locking door latches that provide secure, easy one-handed operation. Meanwhile, it has shelves that have removable plastic trays for easy cleaning and are height adjustable so you can tailor the ferret or rat cage to your pet's needs. This ferret home also has multiple attaching points for adding hammocks, tubes, toys and other accessories that are sold separately. The ramps, included with this small animal cage, feature reversible happy feet ramp covers, which are angled appropriately to promote your ferret's safety. Constructed from a sturdy square tube frame and wire, the Midwest Ferret Nation Double Unit with Stand Ferret Cage has an attractive gray quartz hammertone finish that is bound to blend in with practically any type of interior or exterio", "title": "Midwest Ferret Nation Double Unit with Stand Ferret Cage, 36&quot; L X 25&quot; W X 62.5&quot; H", "price": 193.49, "salesRank": {"Pet Supplies": 19414}, "imUrl": "http://ecx.images-amazon.com/images/I/41cdlCDXzfL._SY300_.jpg", "related": {"also_bought": ["B0002DJL0K", "B007ZOC1BU", "B004ZU0IPI", "B007ZN5TN8", "B0002DINIQ", "B0006DQGCC", "B004UL3FCU", "B000EFV9YM", "B0002ARPJ2", "B004UL3EUI", "B0002DJM40", "B001OVF158", "B00203SK0W", "B004VVY49M", "B007ZOC1R4", "B007ZN5TWO", "B000HGB8YO", "B00176AZA6", "B000FPL0FE", "B000BL0BK2", "B0002AROVQ", "B0002ARQ14", "B007U0MWE0", "B0002DHM4C", "B0002ASAYG", "B003G411K0", "B0027J9H6K", "B00176F466", "B001AT9N3A", "0470139439", "B004UKZE7A", "B000HHJH82", "B003G432F2", "B0002ASBF4", "B000JMG72O", "B001OVF1WG", "B004YCEH1I", "B004UL3F7U", "B0010P3E0M", "B000F6SFUG", "B000F4SNNM", "B0002ARQ1Y", "B000HHLSAW", "B0002ASBAY", "B001OV9EF6", "B004UL3FG6", "B004VE5FO2", "B0024EAFL4", "B004UKZE6Q"], "also_viewed": ["B000QFMYWQ", "B001NJ0DAY", "B000F4OX0E", "B007ZOC1BU", "B0054U8U26", "B001W8TZ8W", "B001NJ0DAE", "B00HZC5CRC", "B000F4SNNM", "B001UGMWPO", "B004X1A232", "B004G1B61Q", "B004ZU0N6M", "B004H9LHRK", "B007ZOC1R4", "B008FONT2Y", "B004GASVAQ", "B007TTL3A6", "B000I1QYQ0", "B007RZCOEQ", "B001W8S4M0", "B001W8MDKO", "B0002ASAYG", "B004HXMI10", "B007ZOC11K", "B00203SK0W", "B00C333HIY", "B004VWX8ZW", "B00E4WL6O4", "B001ATBPQS", "B0002DJL0K", "B0002DJ29A", "B002X2NBNQ", "B0002AROVQ", "B0085W9CL8", "B0006DQGCC", "B007ZN5TN8", "B0002ASBAY", "B004ZU0IPI", "B00HZB1AHO", "B004UL3EUI", "B0002ARP2O", "B0002DJM36", "B000EFV9YM", "B004ZRF6NU", "B003AOY56S", "B00176AZA6", "B00CETSHN2", "B003G411K0", "B000CQBV8M", "B0002DINIQ", "B001D71EQ8", "B009QAGXBU", "B00CEQKPFS", "B001TI6GDW", "B004HQPSM8", "B0002DJM40"], "bought_together": ["B0002DJL0K", "B007ZN5TN8"]}}