{"asin": "B001CCLBSU", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Panasonic's Lumix DMC-FZ28 digital camera boasts a premium 27mm wide-angle Leica lens with an 18x optical zoom, ideal for tight indoor shots and long-distance action photos.  The 10.1-megapixel digital camera also features an enhanced Intelligent Auto Mode (iA), with the new AF (auto focus) Tracking function, making it easier for photographers at any level to shoot sharp, well-focused photos, even when the subject is moving -- making it ideal for action shots.The AF Tracking function, the latest component to be added to Panasonic&#x92;s iA system, allows users to lock focus on a moving subject. The camera then automatically tracks the subject as it moves, keeping it in focus without the need to hold the shutter halfway down.   AF Tracking makes it easier to capture moving subjects and spur-of-the-moment action shots.  The AF Tracking technology also improves Face Detection (up to 15 faces), by providing continuous adjustment of the focus and exposure, even if the face is turned away from the camera.In addition to the AF Tracking functionality, Panasonic&#x92;s other iA technologies include:Intelligent Exposure: Helps prevents photos from being under- or over-exposed by instantly analyzing the framed image and adjusting the brightness in areas that are too dark because of dim lighting, backlighting or the use of the flash. The camera will automatically adjust the brightness accordingly.Digital Red-eye Correction: This feature helps to eliminate the red-eye problem that sometimes results when taking flash shots at night.  Incorporated into the camera, the built-in flash emits a small preliminary flash before the main flash, detects red-eye and will digitally correct it.MEGA O.I.S.: Gyrosensors detect hand-shake and the lens system shifts to compensate, helping to prevent hand-shake from creating a blurry image.Intelligent ISO: Determines if the photo subject is moving and changes the ISO setting and shutter speed accordingly, thus giving a blur-free photo.Intelligent Scene Selector: Senses the ambient conditions, recognizes the shooting environment and will automatically select the appropriate scene mode from: Scenery, Portrait, Macro, Night Portrait or Night Scenery mode.  This intuitive technology, helps the consumer use the most common scene modes that are built into the camera, but often go unused, without making any manual adjustments.Face Detection: Detects faces in the frame (up to 15 faces), even if they are moving, and selects optimal focus and exposure settings so portraits come out clear.Quick AF (Auto Focus): Starts focus on the subject by just pointing the camera at the subject, thus minimizing the AF time.The high-quality, high-performance Venus Engine IV supports a faster response time, allowing the camera to shoot 2.5 shots per second at full resolution and 13 shots per second in High-Speed Burst mode.  In High Sensitivity mode, the FZ28 can shoot up to ISO 6400 in extremely low-lit situations.  The Lumix DMC-FZ28 also is equipped with a 2.7-inch large, high resolution LCD with 230,000 pixels, and a high resolution electric viewfinder equivalent to 201,600 pixels.The DMC-FZ28 also features High Defintion (HD) video capabilities with a resolution of 1280 x 720p at 30fps.  Still photos can also be shot in a 16:9 aspect ratio for optimal full-screen viewing on a HDTV.  Panasonic VIERA Plasma or LCD HDTVs also feature an integrated SD Memory Card slot, allowing users to easily view photos by simply inserting the SD Memory Card into the convenient SD Card slot built into the TV.  Consumer can also enjoy watching videos in HD quality and view still images by connecting the DMC-FXZ28 via an optional Panasonic component cable (DMW-HDC2).Additional features of the Panasonic Lumix DMC-FZ28 include:Image Leveling: When a captured image \"leans\" to the right or left because the camera was held at a slight angle when the photo was taken, the Image Leveling function rotates the image to straighten it and crops the unnecessary edges. No computer needed!Scene Modes: The DMC-FZ28 offers a total of 37 scene modes to respond easily to any shooting situation. The new Pin Hole and Film Grain modes add unique, film camera-like effects and ambiences to images.  Additionally, the actual effects of the scene mode can be viewed on the LCD before taking the shot.Flash: Reaches a distance of 8.5 meters at the wide setting and 5.4 meters at the telephoto setting (ISO AUTO).SILKYPIX Developer Studio 3.0 SE: Software application comes bundled with the DMC-FZ28 for editing and developing images in the RAW file format.", "title": "Panasonic  Lumix DMC-FZ28K 10MP Digital Camera with 18x Wide Angle MEGA Optical Image Stabilized Zoom (Black)", "price": 489.77, "salesRank": {"Camera &amp; Photo": 5104}, "imUrl": "http://ecx.images-amazon.com/images/I/31iUqbloG2L._SX300_.jpg", "related": {"also_viewed": ["B00DY2Y28M", "B002IKLJU0", "B003WJR694", "B003WJR68U", "B005F25IL4", "B008MB6ZX0", "B000TM7GD8", "B008MB6YX6", "B00BEPWHSI", "B006ZNYSX6", "B009WS2NGK", "B000A7XSSY", "B001CCJOGG", "B001G5ZTZO", "B000GHVZQ0", "B000MWVMRG", "B001GSGH2K", "B00728ZAHG", "B005058BTW", "B00301TADY", "B00ENLB1T6", "B0096DK1W4", "B002LITT42", "B001QFZMCO", "B00E52ZJDM", "B003WJR69E", "B001DO15J2", "B008OQG8CG", "B000M4KXK6", "B003I95ASC", "B001CCLBSA", "B000EBK3FW", "B000V1VG5G", "B00728ZBA2", "B007R7DTRK", "B00HZDAUOQ", "B004H8FND0", "B00176BDD4", "B00BEHRQB4", "B0011ZK6OS", "B001P06Q66", "B008MB719C", "B00I9OPF2W", "B005MKB5M0", "B001GSBJU0", "B0011ZK6ZM", "B00B2QK2H2", "B003MPOLX2", "B008MD3RE8", "B000CP4ML6", "B00728ZBC0", "B00CFCTDMC", "B006K551TO", "B005TGKX9S", "B006T7QRN2", "B008MB71IS", "B004KDVNZO"], "buy_after_viewing": ["B003VNKNEQ", "B003VNKNF0", "B0039BPG1A", "B00DY2Y28M", "B00DY2Y28M"]}}