{"asin": "B009YT6PPC", "description": "Convert HDMI to VGA the Easy and Inexpensive WayThe HDMI to VGA Converter is your affordable solution for transferring HDMI signal into VGA and Audio signal. The Converter gives you the freedom to use HDMI devices with your existing VGA display devices, including computer monitors and projectors. You can avoid costly and unnecessary upgrades of your VGA devices with this simple unit.The HDMI to VGA Converter can be used with a large range of HDMI devices, including computers, gaming consoles, set-top cable boxes, DVD and Blu-Ray players, and Apple TV. Just hook up your HDMI device to the Converter. Then hook your VGA display to the Converter. A wide selection of resolutions are possible with the conversion, up to high-definition 1080p.And because of the included 3.5mm audio cable port, the HDMI to VGA Converter is your best choice for converting audio from your Apple TV. Apple TV has two audio-out options: an optical audio port and HDMI. This limits your options because optical audio ports are usually only found on high-end devices, while many other audio devices (like speakers) don't have HDMI. With the Converter, you have a simple way to transfer Apple TV audio signal to any device with a standard 3.5mm jack, avoiding bulky or expensive alternatives and multiplying your audio options.You can even use the Converter in conjunction with Apple's Digital AV Adapter to project iPad or iPhone content. Plug in the iPad's power cord into the Digital AV Adapter, and you'll be able to power your device while presenting material. This is great for long presentations.An AC adapter is included with your purchase, but many HDMI devices provide sufficient power to make a separate adapter unnecessary.The HDMI to VGA Converter is the hassle-free little box with the big ability to save you time and money.", "title": "IPEVO HDMI to VGA Converter for Apple TV, Wireless Mirroring with Airplay on iPad, iPhone, iPod touch &amp; Mac - Convert HDMI signal to VGA and Audio signal", "price": 31.0, "imUrl": "http://ecx.images-amazon.com/images/I/41aisubkXgL._SY300_.jpg", "related": {"also_bought": ["B0082AFROO", "B007I5JT4S", "B0064GHP1G", "B00870ZHCQ", "B003O55U8K"], "buy_after_viewing": ["B0082AFROO", "B007I5JT4S", "B00CW8PNBE", "B003L1ZYYM"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Video Converters"]]}