{"asin": "B002ZLOR56", "description": "Go Beyond the OrdinaryPushing the envelope of conventional netbook performance, the Eee PC 1201N Seashell breaks from traditional standards to deliver premium HD entertainment on-the-go. With an ASUS Dedicated Graphics Engine (DGE) powered by revolutionary NVIDIA ION graphics and a dual-core Intel Atom processor never before seen in an Eee PC, this multimedia netbook delivers standout HD quality and multitasking efficiency with Windows 7 Home Premium.The Eee PC 1201N boasts a 12.1-inch HD widescreen, 750GB ASUS Hybrid Storage, full-size chiclet keyboard, stereo speakers, and other robust media features that let you enjoy rich entertainment in a thin-and-light, compact design.   The Eee PC 1201N fits any situation.  From its Eee core, it embodies the essence of traditional Eee PCs, &ldquo;to learn, work, and play&rdquo; &ndash;and takes it a step further.LearnThe Eee PC 1201N is ideal for any learning environment. Its space-saving design and scratch-resistant Infusion finish combine to make it the perfect addition to today&rsquo;s mobile student&rsquo;s backpack.  It&rsquo;s small enough to comfortably fit any desk with room to spare, but is still large enough for all your word processing and productivity needs.  The Eee PC 1201N strikes a perfect balance between form and function.WorkTired of boring, bulky business laptops that keep dying throughout the day?  The stylish Eee PC 1201N will help you re-discover office computing in a new light with its spacious full-size chiclet-style keyboard, ultra-slim design, and mobile efficiency.  Stay unplugged longer through long meetings and power through work applications.  Its multitasking dual core Atom processor handles multiple programs on the fly, and, with 750GB of hybrid storage, you get an incredible amount of space to hold your work files and documents.PlayThe Eee PC 1201N is one of the only netbooks equipped to handle casual gaming.  With a dual core Atom processor and ASUS Dedicated Graphics Engine (DGE), powered by NVIDIA ION graphics, the Eee PC 1201N plays most of your favorite games on-the-go.  Optimized for mobile prowess, it outlasts ordinary, less compact and less portable, gaming laptops.  With the Eee PC 1201N, you can break free from under-powered netbooks and enter a new realm of netbook gaming.Key Features12.1-inch LED-backlit HD widescreen for HD-quality visuals wherever you are(Learn more)ASUS Dedicated Graphics Engine (DGE) powered by NVIDIA ION graphics accelerator for a premium HD experience (Learn more)Powered by an Intel Atom N330 dual-core processor for excellent multitasking Eee PC performance(Learn more)HDMI connectivity for streaming Full HD video and digital sound to you HDTV or home theater(Learn more)Built-in Wi-Fi N and Bluetooth 2.1 for wire-free surfing and entertainment(Learn more)750GB Hybrid Storage: 250GB hard drive plus 500GB ASUS WebStorage*(Learn more)2GB of DDR2 system memory for smooth computing with pre-loaded Windows 7 Home Premium(Learn more)ASUS Super Hybrid Engine for extended battery life and boosted performance(Learn more)Full-size chiclet keyboard for comfortable use(Learn more)Multi-touch trackpad for intuitive control(Learn more)Integrated webcam and microphone for video chatting with your friends and familyF9 easy recovery for convenient and easy system reinstallationWarranty: 1 year global warranty and 30-day Flawless Display Guarantee: If a single bright dot is found, a free panel replacement is guaranteed within 30 days of original purchaseLearn More about the Eee PC 1201NImmersive Multimedia FeaturesThe Eee PC 1201N boasts a 12.1-inch HD widescreen, stereo speakers, HDMI connectivity, so you can enjoy movies, videos, and pictures in the high-quality you desire.  With a display resolution up to 1366 x 768, experience crisp, true-to-life visuals while streaming content on-the-go.  Plus, with its LED-backlit screen, &ndash;you get longer battery life for long flights or movies.HDMI ready, the Eee PC 1201N can connect to compatible TVs and directly stream 1080p HD video with true-fidelity 7.1 audio.With ASUS DGE coupled with NVIDIA CUDA technology to upscale standard-definition multimedia files into high-definition cinema &ndash;you get sharper images and a more vivid picture in real-time.ASUS Dedicated Graphics Engine - Turn Up the VisualsWith the energy-efficient Intel Atom processor and ASUS DGE powered by NVIDIA ION graphics, the Eee PC 1201N is your own personal mini-HD entertainment center &ndash;delivering full 1080p HD playback capability via HDMI.NVIDIA CUDA technology further boosts the Eee PC 1201N&rsquo;s ability to work with visual content and enjoy casual gaming by accelerating graphic-intensive tasks such as light video editing and video conversion.NVIDIA ION BenefitsNVIDIA CUDA technology to accelerate demanding applicationsPremium DirectX 10 graphics with advanced digital display connectivityPremium Windows experience with Windows 7 Home PremiumDual-Core Processing Power With Enhanced Battery LifeInfused with a dual-core Intel Atom processor, the Eee PC 1201N gives you more multitasking power than single core processors.  Plus, the exclusive ASUS Super Hybrid Engine (SHE) lets you instantly switch and optimize power options for the task at hand.So whether you want to enhance your systems performance or promote energy-saving mobility, the ASUS SHE ensures that you stay in complete control of your Eee PC 1201N so you can take your multimedia experience further than ever before.To switch between profiles for more battery life or performance, all you need is to press the Super Hybrid Engine hotkey above the keyboard.Comfort on-the-goThe Eee PC 1201N has more surface area for a wider, more comfortable palm rest. The ergonomic chiclet keyboard is full-size and has concave keys that direct your finger to the center of the surface&mdash;a distinctive feature that actually improves typing accuracy.Weighing less than 3.5 lbs, the thin and light Eee PC 1201N is concise and compact so you can effortlessly use it on the plane or in any other tight space with room to spare.The multi-touch trackpad lets you easily zoom in and out to view photos or read documents by simply sliding two fingertips together or apart.  You can also easily scroll in windows without using a mouse by sliding two fingertips up or down the trackpad.Massive Storage for Your Media LibraryNot only does the Eee PC 1201N have a 250GB hard drive, it also comes with 500GB of free ASUS WebStorage* for a total of 750GB of storage capacity.ASUS WebStorage makes it easy for users to share their media with friends and family via a simple drag and drop interface.Now you can back up your data online, and have access to your important data anywhere with an internet connection.Your Portable Work, Learn and Play CompanionConnect, communicate, and explore online, anytime, anywhere, with your Eee PC 1201N. Featuring the latest generation Wi-Fi technology, 802.11n, that is five times faster than 802.11b/g for quick downloading and streaming of large multimedia files.With built-in Bluetooth support, your Eee PC 1201N lets you easily transfer data between Bluetooth-enabled devices.  Plus, a built-in web camera and microphone let you Skype with your friends with crisp video and crystal clear sound.Eee PC with Windows 7 &ndash;Life Made EasierExplore the great new features of Windows 7 with the Eee PC 1201N.  Featuring optimized energy-saving features and easy-to-use shortcuts, the Windows operating system is redesigned to give you an enhanced user experience making your everyday tasks simpler than ever before.Plus, Windows 7 has easy network sharing that helps you instantly get connected to Wi-Fi hotspots and networking hubs.  Share more with friends and surf the Web better with Windows 7 and the Eee PC 1201N.Windows 7 Home Premium makes it easy to create a home network and share all of your favorite photos, videos, and music.  And you can watch shows for free when and where you want with Internet TV on Windows Media Center.  Get the best entertainment experience with Windows 7 Home Premium.Get more features with Windows Anytime Upgrade.It&rsquo;s the best way to add features to Windows 7, takes as few as ten minutes, requires no software or downloads, and you&rsquo;ll keep your existing programs, files, and settings.  Windows will walk you through the simple upgrade process.Customer Warranty &ndash;The Industry's Most Complete Netbook Care Package1 year global warranty30-Day Flawless Display Guarantee: If you discover one defective bright dot within 30 days of purchase, ASUS will replace the panel at no cost6 months battery warranty24/7 tech supportWhat's in the BoxEee PC 1201N (black)Power AdapterUser ManualWarranty CardSpecificationsOperating System:Windows 7 Home PremiumDisplay:12.1-inch LED-Backlit WXGA display (1366 x 768)CPU:Intel Atom N330 Dual Core processor (1.6 GHz)GPU:NVIDIA ION GraphicsWireless Data Network:WLAN 802.11b/g/n (draft 2.4GHz n) and Bluetooth V2.1 + EDRMemory:2GB DDR2, 2 x SODIMM slotStorage:250GB HDD + 500GB ASUS WebStorage*Camera:0.3 megapixelAudio:Hi-definition stereo speakers, high-definition audio CODEC, MicrophoneStorage Cards:2-in-1 MMC, SD(SDHC) flash card slotInput/Output:1 x VGA port (D-sub 15-pin for external monitor), 1 x HDMI, 3 x USB 2.0 ports, 1 x LAN RJ-45, 2 x audio jacks (Headphone &amp; Mic-in)Battery Pack:5 hours**, 6-cell Li-Ion battery&dagger;Dimensions:11.54 (W) x 8.11 (D) x 1.06~ 1.30 (H) inchesWeight:3.22 lbsColor:Black* Complimentary one-year 500GB ASUS WebStorage trial. Please visit www.asuswebstorage.com for more details. Specifications are subject to change without prior notice. Please visit www.asus.com for more information.** Operation lifetime subject to product model, normal usage conditions and configurations. For more information, please visit http://eeepc.asus.com/global/computing.html . The estimated maximum battery life in Windows 7 is measured with MobileMark 2007.&dagger;  To recharge using the AC power adapter, power plug must be fully pushed into the power socket on the Eee PC until it clicks firmly into place.All specifications and terms are subject to change without notice. Please check with your supplier for exact offers on selected models. Products may not be available in all markets. Product may not be exactly as shown in images.Check Out Other ASUS Notebook Computers and AccessoriesASUS Eee PC Seashell Optical Mouse - BlackIts slim and sleek design makes the Eee PC Seashell Optical Mouse the perfect accessory for your Eee PC Seashell.ASUS BX700 Bluetooth Laser MouseThe ASUS BX700 Bluetooth laser mouse offers freedom of movement, as well as dong away with wire clutter with Eee PC 1201N's built-in Bluetooth receiver.ASUS Slim External Optical Drive/DVD WriterCreate and read CDs or DVDs with speed, style, and simplicity with the ASUS Slim External Optical Drive and your Eee PC.ASUS UL30A-X5 Thin and Light LaptopLooking for great battery life and processing power? Check out the Amazon exclusive thin and light UL30A-X5 laptop.", "title": "ASUS Eee PC Seashell 1201N-PU17-BK 12.1-Inch Black Netbook - 5 Hours of Battery Life", "price": 7.97, "imUrl": "http://ecx.images-amazon.com/images/I/41fp3jCj5vL._SX300_.jpg", "related": {"also_viewed": ["B004GLO90Q", "B004GLKT2I", "B00BQH8QTI", "B00CWISC5I", "B0071N3AYC", "B007F88V5Q", "B009AANCKG", "B00AAIC5S2", "B004J2JGQO", "B008XKHG9W", "B005J2E2US", "B00CPIF4G0", "B00CS5J99S", "B00COQK8QY", "B0032ALW5C", "B004PY0908", "B0071N6AC6", "B00HZT1TK4", "B00HZT1UFS", "B00AW4NXOO", "B00C8ZUXPC", "B0030T17DW", "B00HZT1TWW", "B004GLQV6G", "B00BB9OXK2", "B00G1YKHES", "B004HKIIF8", "B00HZT1T5E", "B00GWVNK8A"], "buy_after_viewing": ["B004J2JGQO", "B004GLO90Q", "B007F88V5Q", "B004GLKT2I"]}, "categories": [["Electronics", "Computers & Accessories"]]}