{"asin": "B00005AV8W", "description": "A dark shadow is spreading over the N64. Count Dracula has once again weakened the seals of his tomb, and the Belmont family is getting anxious.In the latest crusade against the forces of evil, players can choose between two brave vampire-slaying characters. Young Reinhardt Schneider, like his predecessors in the celebrated vampire-hunting Belmont family, will rely primarily on his whip. The other character is Carrie Fernandez, a young woman skilled in the ways of magic and spell-casting. Both are on the hunt for the dreaded Dracula and his devoted legions of vampires. You play a game all the way through with the character you've chosen, concluding with his or her own ending. Each character has an individual route to travel, and to see all of the areas you will have to complete the game using both characters.The passage of time and, especially, the fall of night, play a prominent role in the game. Players will have to search castles filled with dark corners, winding staircases, and other gloomy places. Daytime is the right time for exploring, but be on the lookout for vampires lurking in the shadows.Once the sun goes down, though, you should exercise extreme caution. When night falls, more creatures come out to play, and they become more aggressive as well. Some tasks are impossible to perform unless it is the correct time of day. A clock will allow players to calculate the time and plan their explorations accordingly.Konami has planted many cinematic sequences throughout the game. These scenes are surprisingly creepy, and may make you decide not to pick up your controller at night. Enemy characters are designed to terrify, ranging from the traditional horde of skeletons to half-woman, half-spider mutants. There are some gruesome bosses lurking in the darkness, as well. You will have to defeat Dracula in three different time periods, but don't expect the passage of time to improve his disposition.Reinhardt and Carrie will both have analog control, with different animation sequences for walking, jogging, and running. Reinhardt's whip works on a targeting system. When gruesome enemies are threatening, a green crosshair appears on the screen. If an enemy crawls, slithers, or slides within range of the whip, the target lets you know by turning red. The target automatically hovers over nearby enemies, so once it turns red you are guaranteed of a successful strike.Castlevaniahas 28 different areas to explore and four different special items at your disposal to fight the forces of evil. An eerie soundtrack tops off the package, creating a satisfying game that takes you on a unique adventure through spooky surroundings.", "imUrl": "http://ecx.images-amazon.com/images/I/51PQ8MJFQWL._SY300_.jpg", "related": {"also_bought": ["B00004SVO2", "B00004SVYF", "B00004SVXW", "B00004SVSS", "B0009VRFFS", "B00004SVXQ", "B00004SVS3", "B00004SVYE", "B00004SVV8", "B00005AV8O", "B00004SVV9", "B00004SVR9", "B000HFGKN4", "B00004SVYQ", "B00004SVV4", "B00004SVV7", "B0006TNCEG", "B000FJEV06", "B00004SVS9", "B00004SVS5", "B00004SVNB", "B0002ST1YQ", "B00004SVOG", "B00004SVYH", "B00004SVXV", "B000UCF9TA", "B00002STXN", "B000MFOOLY", "B00004SVPT", "B000FUIS40", "B00004SVVT", "B00004SVNS", "B00004SVW4", "B00002SVFQ", "B00004SVYI", "B00004SVNL", "B00004SVTT", "B00002SVFV", "B00002STXQ", "B000TGKU7I", "B00004SVXP", "B000L8L1E0", "B00004SVTL", "B000TUZCQI", "B00002STYC", "B00AO7ZTZK", "B00004SVTO", "B000I1ZIQC", "B00004SVYP", "B0007V0Y1C", "B00004SVVP", "B000035Y09", "B00002SVFR", "B006457FUI", "B00005C7P7", "B001VDZN3O", "B00004SVXA", "B000035Y7H", "B00EAM862S", "B00004SVX9", "B00004SVVN", "B000VA5Y1Y", "B000035Y6C", "B00001OWYW", "B0002Z1PZW", "B00004SVVF", "B000035Y6D", "B00002SVG0", "B000H29ZPM", "B002DLOM6C", "B00002SVFX", "B00002SVFZ"], "buy_after_viewing": ["B00004SVXW", "B00004SVV9", "B00004SVV8", "B00004SVYF"]}, "salesRank": {"Video Games": 5840}, "categories": [["Video Games", "More Systems", "Nintendo NES", "Games"]]}