{"asin": "B004HO596K", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "Shoot high-definition video from either hand using the Samsung Q10 SwitchGrip Full HD Camcorder. With the SwitchGrip design, you can turn the Samsung Q10 upside down and switch hands without worrying about missing any of the action. BSI CMOS technology dramatically reduces image noise and distortion, while the OIS Duo function compensates for even the slightest hand or body movements. Other features include one-button operation, an intuitive Smart Touch 3.0 touchscreen interface, and 10x optical zoom.Q10 SwitchGrip Full HD CamcorderAt a Glance:SwitchGrip function so you can hold the camcorder in either handOne-touch operation makes recording HD video simple and easySmart Touch 3.0 display with drag-and-scroll functionalityBSI CMOS technology for reduced image noise and distortionOIS Duo feature for steady videos, even while you're walking or moving10x optical zoom and a 20x digital zoom for versatile rangeOne-year limited warranty on parts and laborInnovative SwitchGrip function lets you operate the camcorder with either hand.View larger.Travel without the hassle of batteries -- simply connect to your computer's USB port to recharge.View larger.High-Definition Video from Either Hand with SwitchGripThe Samsung Q10 features a SwitchGrip function, giving you the flexibility to hold the camcorder in either hand. The built-in G-magnetic sensor quickly recognizes when the camcorder and its LCD display are turned and which hand is holding the camcorder.As a result, you can hold the Q10 with whichever hand is more comfortable or gives you the best vantage point.Features one-touch easy operation.View larger.Smart Touch 3.0 Display Provides Easy OperationThe Samsung Q10 comes with an intuitive Smart Touch 3.0 display with the same drag-and-scroll functionality found in smartphones and other mobile devices. For the Q10, Samsung eliminated many confusing or unnecessary buttons, thus streamlining operation. You can turn it on simply by flipping open the LCD screen. Twisting and opening the screen automatically sets the camcorder to playback mode.CMOS Sensor for Optimal Video QualityWith its advanced BSI CMOS technology, the Samsung Q10 dramatically reduces image noise and distortion and enhances recording quality during low-light conditions--whether you're at a birthday party in a dimly lit restaurant or at home recording your child's first steps.Steady Videos with Optical Image StabilizerThe Samsung Q10 comes equipped with Optical Image Stabilizer (OIS) Duo, a feature that allows the camcorder to automatically compensate for even the slightest hand or body movements, resulting in steadier videos. What's more, the OIS is able to maximize the stabilizing area while minimizing shaking, so you can take crisp videos every time, even while you're walking or moving around.Recharging Made Easy Using USBWith the Samsung Q10, you can travel without the hassle of carrying around a cumbersome charger or an extra set of batteries. Simply connect the camcorder to a computer's USB port, turn on the computer, and your camcorder will begin recharging.Product and Warranty InformationThe Samsung Q10 is equipped with a 10x optical zoom lens and a 20x digital zoom lens. It measures 2.1 by 1.7 by 4.7 inches (H x W x D) and weighs 0.4 pounds.The Samsung Q10 is backed by a one-year limited warranty on parts and labor.What's in the BoxCamcorder, battery, A/C power adapter, Audio/Video cable, USB cable, User Manual CD, and quick start guide.", "title": "Samsung HMX-Q10 HD Camcorder Ultra Compact with 10x Optical Zoom (Black)", "price": 23.99, "salesRank": {"Camera &amp; Photo": 3412}, "imUrl": "http://ecx.images-amazon.com/images/I/315G2PwjHYL._SX300_.jpg", "related": {"also_bought": ["B005KDIGAI", "B004QJXPFS", "B003VNKNF0", "B004QPCANU", "B003VNKNEQ", "B0037T6O2Y", "B005JT25E6"], "buy_after_viewing": ["B005KDIGAI", "B003VNKNF0", "B00DQYAT1C", "B00ALRL2CW"]}}