{"asin": "B00005RD71", "description": "The Elder Scrolls III: Morrowindis an epic, open-ended single-player game where you create and play any kind of character you can imagine. Be the hero embarking on an epic quest or a thief rising to leadership of his guild. Be a sorcerer developing the ultimate spell of destruction or a healer searching for the cure to a plague. Your actions define your character, and your gameplay changes and evolves in response to your actions. Confront the assassins' guild, and they take out a contract on you; impress them, and they try to recruit you instead. No two sagas are the same in the world of Morrowind.Players can choose to follow the intriguing main story line or set off to explore the province of Morrowind and the many interesting people and exotic locations it contains. Vast cities and remote villages dot the landscape, each with its own unique look and feel. Hundreds of quests and adventures await as you interact with characters and learn more. Regardless of whether you play a murdering assassin or a noble knight, the game holds endless possibilities and allows you to revisit the main story line at any time.With Morrowind, the Elder Scrolls character system is coupled with an increase in the world's richness of detail. Utilizing advanced 3-D technology, Morrowind features hyperrealistic textures and polygon counts, real-time shadows, vast landscapes, skeletal-based animation, and a complete weather system. Gameplay is further extended with the inclusion of The Elder Scrolls Construction Set, which allows players to modify and add to Morrowind in any way they see fit. Change character or creature attributes and skills, introduce new weapons or dungeons into the game, or create entire new worlds to explore.", "price": 6.93, "imUrl": "http://ecx.images-amazon.com/images/I/517TY212CNL._SY300_.jpg", "related": {"also_bought": ["B000V9C9FO", "B005EZ5GQO", "B00009M97K", "B0000CNUUP", "B004HYIAPM", "B000924J1A", "B006O4YSJ0", "B002BXKJA0", "B000BNKBCI", "B00027CXEM", "B001V9PTVE", "B000NGRIDI", "B00009ECGK", "B00009MGVF"], "buy_after_viewing": ["B0000CNUUP", "B006O4YSJ0", "B00E9I1FPI", "B005FDUSTA"]}, "salesRank": {"Video Games": 15288}, "categories": [["Video Games", "PC", "Games"]]}