{"asin": "B004Q7J4W8", "categories": [["Electronics", "Computers & Accessories", "Routers"]], "description": "Experience wireless power, speed and security with this Cisco Valet Plus M20 802.11n Broadband Router. This Cisco Valet Plus M20 is a broadband router with firewall, wireless access point, and four-port Ethernet switch all in one. Use the Valet Plus M20 to share your broadband connection at home with wired and wireless devices. The Valet Plus M20 is compliant with IEEE 802.11n specifications to provide maximum data transfer rates of 300 Mbps while also maintaining backward compatibility with Wireless-b and Wireless-g devices. The Cisco Valet Plus M20-RM features an included Easy USB Setup Key that holds the setup software, making deployment of a wireless network fast and easy with nearly any computer equipped with a USB port. It also supports Wi-Fi protected setup support for addition setup options.In addition, this Cisco Valet Plus M20-RM is designed to help safeguard your wireless communications from hackers and other Internet attacks with its Firewall, WPA2, WEP and Wireless MAC Filtering security features. Order today.", "title": "Cisco Linksys Factory Refurbished M20 Valet Plus Wireless N Router - 802.11b/g/n", "price": 36.49, "salesRank": {"Electronics": 21109}, "imUrl": "http://ecx.images-amazon.com/images/I/41GgnBonbiL._SX300_.jpg", "related": {"also_bought": ["B003B41XYO", "B002UXRED6", "B003B4AVSS", "B004Q7A3QO", "B004QWVY8A", "B00695LU5O", "B004QWUEAY", "B0041CSLVI", "B009RRZ36I", "B006W2SYF8", "B002JIMZU4", "B003CY0QL4", "B003V360NY", "B0007PRAX8", "B003YJAZZ4", "B005S0KHIC", "B003B4AVRE", "B004QS4OF4", "B006CQR7CK", "B00AAU54TW", "B003VYEYE0", "B0054NMD7G", "B001VEK1E4", "B006YB9082", "B006GQYSFA", "B001QUA6RA", "B005YZZJDY", "B001IKKIVW", "B002WWHO0I", "B005S0BYQ6", "B005M21TBA", "B00DEF49I2", "B0057FOBJ4", "B004XC6GJ0", "B00134JNJG", "B004BQVACG", "B006C2DV5G", "B006GQYSDC", "B004444O4G", "B002M3SHXA", "B00023433U", "B0043EV20Q", "B004MU8VCS", "B003KWO3UI", "B008I646WG"], "buy_after_viewing": ["B005S0BYQ6", "B003B4AVSS", "B004Q7A3QO", "B009RRZ36I"]}}