{"asin": "B004HYFX0C", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Sony DSC-H70With 16x optical zoom, incredible low light performance, full 1080x60p HD movie capabilities, and innovative features like, high speed linear auto focus, 3D image capabilities, and backlight correction to catch even the smallest details in high contrast shots, the Sony DSC-HX9V will renew your passion for photography.Sony DSC-HX9V Feature Highlights16.1 Megapixel Back-illuminated &ldquo;Exmor R&rdquo; CMOS Image SensorThe DSC-HX9V features a 16.2 megapixel &ldquo;Exmor R&rdquo; CMOS image sensor that brings out the full resolving power of the camera&rsquo;s Sony G lens to deliver extremely fast speed, high resolution, and stunning low-light sensitivity with improved image clarity and drastically reduced grain. In addition, the combined &ldquo;Exmor R&rdquo; CMOS sensor and BIONZ image processor delivers extremely fast up to 10fps, Anti Motion Blur, Hand-held Twilight and 1080p movie modes.43.0-inch XtraFine LCD display&nbsp;&nbsp;&nbsp;3.0-inch XtraFine LCD display with TruBlack technology (921K dots)&nbsp; gives you deeper blacks and more color in your display, all while being thinner than most LCDs.Compact camera with 16x optical zoom&nbsp;&nbsp;&nbsp;The Sony 16x optical zoom G lens brings distant subjects super close for great outdoors, sports, and travel photos. The compact size makes it easy to take along in a pocket, purse, or backpack.Full HD 1080/60p&nbsp;&nbsp;&nbsp;Record crystal clear movies at the highest resolution available with capabilities for 60p in 1080 Full HD. This provides stunning, fast motion video with less distortion for playback on your Blu-ray Disc players, Sony PlayStation 3 systems and compatible PCs and HDTVs.Backlight Correction HDR&nbsp;&nbsp;&nbsp;Don&rsquo;t miss a single detail in high contrast shots. The built in backlight correction analyzes the image and automatically adjusts accordingly to give you a perfectly lit shot. Backlight Correction HDR helps correct for this by taking three pictures at different exposure settings and processing the best elements of each into a single image for more natural looking shots.3D still image and 3D panorama&nbsp;&nbsp;&nbsp;Produce awe-inspiring images with 3D still image and 3D Sweep Panorama capabilities.4Photos will take on a new dimension of creative capabilities for viewing the world in a whole new way.High resolution iSweep Panorama mode&nbsp;&nbsp;&nbsp;With high resolution iSweep Panorama mode just press the shutter, pan the landscape and let the camera do the rest. It automatically links together each frame to produce a high resolution panoramic image&nbsp;&nbsp; providing the ability to zoom in on small details. This model even detects faces and moving subjects to stitch intelligently different widths to help avoid subject distortion.Hi-speed Linear Focus&nbsp;&nbsp;&nbsp;Life moves fast, your camera&rsquo;s focus needs to move just as fast. The Hi-speed linear focus achieves dramatically clearer images with an auto focus that moves just as fast as your life.Background Defocus&nbsp;&nbsp;&nbsp;DSLR photographs are often beautiful because they blur the background, putting the emphasis on the subject. Now our point-and-shoot cameras can deliver this signature DSLR benefit. The system takes two shots, identifies the background and applies a defocused background keeping the subject crisp and clear.Superior Auto Mode&nbsp;&nbsp;&nbsp;Get cleaner, more dynamic pictures and fewer missed shots. The camera automatically recognizes the correct scene mode, then quickly shoots and combines up to six shots to produce images with greater clarity, optimum dynamic range using backlight correction HDR technology and lower image noise using 6 shots layering technology. Superior Auto intelligently detects 33 scenes for still images and 44 scenes for movies, making it easy to get the best shot.Digital Zoom&nbsp;&nbsp;&nbsp;Capturing the right shot at the right moment has never been so easy. Digital zoom brings the action up close to get that perfect shot, every time.Optical SteadyShot image stabilization&nbsp;&nbsp;&nbsp;Optical SteadyShot image stabilization uses a built-in gyro sensor to detect camera shake and automatically shifts the lens to help prevent blur without sacrificing image quality.Soft Skin Mode&nbsp;&nbsp;&nbsp;Portrait subjects will love the results. Soft Skin mode recognizes skin tones and reduces the appearance of blemishes and wrinkles without affecting the rest of the shot.", "title": "Sony Cyber-shot DSC-HX9V 16.2 MP Exmor R CMOS Digital Still Camera with 16x Optical Zoom G Lens, 3D Sweep Panorama and Full HD 1080/60p Video", "price": 9.95, "salesRank": {"Camera &amp; Photo": 1773}, "imUrl": "http://ecx.images-amazon.com/images/I/41wTuKbdGSL._SX300_.jpg", "related": {"also_bought": ["B000MDZKUU", "B0049XR5MK", "B00336EHAM", "B0032GWZXE", "B004Y4ZR7E", "B003VNKNF0", "B005DITH8U", "B0037TA83K", "B006TK19I2", "B004Y4ZKZS", "B007NZNG42", "B00170MYIS", "B003VNKNEQ", "B004NSYYFM", "B004RBXVZY", "B0051V7XK8", "B003I8ZWTA", "B006NOW6M2", "B000MDY7K4", "B004WP92NK", "B000BOLHH0", "B00DM8R866", "B005HNF01O"], "buy_after_viewing": ["B0051V7XK8", "B00CDIK48U", "B00CDIK48U", "B00B7ID99I", "B003VNKNF0"]}}