{"asin": "B0012NWBH4", "description": "Advance Warshas been reborn. Set amid a world in chaos and boasting new characters and settings, the latest game in the series features a gritty look, an engaging storyline and online battles and map trading. It's the most stunningAdvance Warsever.New COs and units, realistic graphics and a new environment bring the world ofAdvance Warsto life like never before. After a cataclysmic meteor strike exterminates 90 percent of the population, the survivors must battle barbarians, disease and megalomaniacal strongmen who seek only to secure their own power.Strategy fans will rejoice over the long-awaited inclusion of online play, which promises to add almost unlimited depth and replay ability. Hop on Nintendo Wi-Fi Connection and battle against a friend halfway across the world, or use the powerful map editor to create, trade and battle on custom maps.Game storyline:Advance Wars: Days of Ruinfeatures a new group of COs and supporting characters, as well as a new setting. After a terrible asteroid strike that leaves few survivors, the world is in chaos. Toxic dust clouds are choking out the food supply. New diseases strike without warning. Terror runs rampant as people do whatever is necessary for their own survival. Against this background, one small band fights to restore human dignity in a world gone mad, but the mission seems impossible. Their own country is being led by a dictator. Their former enemy thinks only of revenge. And behind the scenes, a scientist with unbelievable power dreams of eliminating the human race once and for all.Game-play Modes:Single-player: Players battle their way through a lengthy campaign and the twists and turns of the main story.Free Battle: Players challenge themselves or up to three friends on more than 170 two-, three- and four-player maps. When playing with friends, players use one Nintendo DS and pass it among players.Battle: Fight up to three other players on more than 170 maps via local wireless communication or Nintendo Wi-Fi Connection. Each player must have his or her own game card.Design Room: Players use the touch screen to design their own maps, controlling every aspect from troop placement to terrain features.Trade Maps: Link to a friend via local wireless communication or Nintendo Wi-Fi Connection and swap topographical masterpieces.Special powers/weapons/moves/features:Multiplayer has always been the backbone of theAdvance Warsgame play, and the addition of playing via Nintendo Wi-Fi Connection makes it even better. Here's a brief overview of the online experience:Exchange Friend Codes with a close circle of military geniuses, then declare war against one of them over Nintendo Wi-Fi Connection. While battling, players can communicate with each other using full voice chat.Players pit their skills against the world as they take on random players. They can choose to fight against people of their own skill level or engage whoever dares to take them on.Advance Wars: Days of Ruincontains one of the most robust map-creation systems ever seen. Use the stylus to paint and create the perfect map, then send it to a friend for a test run. It's easy, fun and very, very addictive.", "price": 30.74, "imUrl": "http://ecx.images-amazon.com/images/I/513inAUc1oL._SY300_.jpg", "related": {"also_bought": ["B0009XEC02", "B00008YMZV", "B001O1PAMC", "B00005MDZZ", "B001A01FD0", "B001TOMR6Q", "B002I0EH6I", "B001E27DLM", "B004CVWETI", "B00AKIPBNS", "B001CU4EJ0", "B0009Z3K9E", "B002EWD02C", "B000GIXIPK", "B002I0GKIQ", "B000SSPI4C", "B00136MBHA", "B001H8Y7DA", "B001NJMMHG", "B001NJKHWI", "B003FBL86Q", "B001TOQ8UW", "B00GV4V8XC", "B001AF1NVY", "B000B69E96", "B000HE9LL8", "B002I09286", "B003O8EDUS", "B00184219U", "B000FRV2UK", "B000I10PY2", "B005C2QSDY", "B001TOQ8WU", "B000UZVL58", "B000GABOTU", "B007RUY1NS", "B004L4G8UC", "B0007ZSHOY", "B00L3LQ4B4", "B0009K7ESC", "B0009R1SQY", "B003O6E800", "B000WMEEC6", "B0054J1LBO", "B004K6LQAS", "B000SSQPU8", "B002AU0HZQ", "B00HXEWGY4", "B001B0BB2Y", "B0009Z3MQ0", "B003S55EX2", "0804163448", "B009LEIUY4", "B002BRWU8U", "B00KVRK39A", "B002TDIEDG", "B000U5W3IW", "B000KRXA28", "B002EE5RKI", "B002BS4834", "B0050SVNP8", "B0050SVOXE", "B001PYD0KW", "B0089X37NW", "B003IOGPAO", "B00B67ZS3U", "B002I094AC", "B00171NYHM", "B001QLC2YY", "B001QTW2IC", "B000IOM45C", "B000B8J7K0", "B00GANWVJE", "B0053B0DI0", "B00139U8QI", "B000R37S78", "B0050SVNSU", "B009B1D7JK", "B0053BCML6", "B000Q6J51S", "B0010YOQIM", "B0009Z3LGQ", "B000JLL3UQ", "B002I0EMBI", "B000Q6ZLMA", "B003YVK5T8", "B0007D4MVS", "B001C4J62Q", "B001TD6SK8", "B000TU4M4Q", "B000GABTVS"], "bought_together": ["B0009XEC02", "B00005MDZZ"], "buy_after_viewing": ["B0009XEC02", "B00AKIPBNS", "B001A01FD0", "B001O1PAMC"]}, "salesRank": {"Video Games": 11590}, "categories": [["Video Games", "Kids & Family", "Nintendo DS", "Games"], ["Video Games", "Nintendo DS", "Games"]]}