{"asin": "B0056ENTVC", "related": {"also_bought": ["B005DDNKME", "B005CG1XH6", "B007E4WQSO", "B005NJCFRE", "B005J5TZWK", "B005THHP0C", "B001ISKNKA", "B003VNKNF0", "B004N238NW", "B0050K0Y4C", "B005IHWXSW", "B003VNKNEQ", "B005VT0N48", "B002IKLJVE", "B0043VE292", "B0043VE29C", "B00AD7XUIO", "B00BU7B074", "B00489Q1WU", "B00CV9MHYU", "B006QS4ALK", "B008J3BYA0", "B00AD7YBIM", "B002PK1FZM", "B0052M1FU0", "B0039BPG1A", "B005J5TZQ6", "B009SGB3KS", "B0057LX9H8", "B002UXRED6", "B00009R96B", "B00004ZCJE", "B0058DGWCE", "B005FDH1UO", "B0051GXC8K", "B003Y2XN9G", "B0000BZL1P", "B00004ZCJG", "B006JSSFZO", "B005ZP6Z4A", "B005REKI1U", "B002LARVXQ", "B004N6ZTQ2", "B0093P0V2A", "B0054EPPZM", "B0032MVQJM", "B003150B6O", "B00658R96Y", "B0054YVA8S", "B005CUC8BW", "B002HZY5F2", "B003Y2WUJ0", "B003WJR69E", "B00ADQHIEW", "B007M54E08", "B002WE4HE2", "B009KUKY6Q", "B004Q3C98S", "B009DL0LOW", "B005KK40ZQ", "B00C97ZZ4S", "B004G8QSTO", "B00BU7BMOA", "B00ADQHJDW", "B004K34MUC", "B00005OP2Z", "B0043VE28I", "B003VNKNEG", "B005NJNPA0", "B001KNAWZ4", "B0041RRMR2", "B00BFWWAQE", "B00004ZC8Y", "B00DJS830Y", "B004J2LMJ8", "B0066J6EOU", "B006W2SYF8", "B008R6F6HG", "B00HIKBW1G", "B002U4RRTG", "B004OR14GY", "B00604YTFM", "B005M2PDK8"], "bought_together": ["B003VNKNF0", "B0039BPG1A"], "buy_after_viewing": ["B003VNKNF0", "B00C97ZZ4S", "B00728ZBA2", "B00B7ID99I"]}, "title": "Panasonic Lumix DMC-GF3KK 12 MP Micro 4/3 Compact System Camera with 3-Inch Touchscreen LCD and 14-42mm Zoom Lens (Black)", "price": 269.0, "salesRank": {"Camera &amp; Photo": 1522}, "imUrl": "http://ecx.images-amazon.com/images/I/51uxbkE6y-L._SX300_.jpg", "brand": "Panasonic", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Compact System Cameras"]], "description": "Panasonic LUMIX DMC-GF3Panasonics LUMIX DMC-GF3 realizes all the features you want from a bulky DSLR interchangeable lens camera, only it accomplishes this in an ultra compact point-and-shoot camera body about as wide and tall as a typical smart phone yet is lightweight and simple to master.Mode Access via Touch-Enabled LCD or Mode Thumb WheelThe DMC-GF3 provides a traditional DSLR-like experience without the need for complicated external mode dials, yet provides intuitive and quick access to common modes like Program, Shutter and Aperture Priority, Manual via a touch-enabled LCD that operates much like a smart phone. Additional quick access touch-enabled settings include three Customizable Modes that get you to your favorite camera setup quickly, multiple Scene Modes and the new LUMIX Creative Control Mode. The DMC-GF3 provides a dedicated video button that can be used to switch to video capture quickly without changing modes.At the heart of the DMC-GF3s simplified functionality is a large 3.0-inch LCD (460k- dot) that allows for intuitive touch control of menus and most shooting, focusing, playback and effects controls. Menus can be customized using simple drag-and-drop actions like those on most touch-enabled smartphones. This allows for a custom user interface, giving Quick Menu access to functions that can be tailored to any users expertise level. Even the shutter can be triggered from the touch-enabled LCD by simply touching the subject you want focused and captured. Using the touch-screen operation, a user can lock onto a subject, enabling AF Tracking in both still and video modes. When youre ready to shoot, the subject will be in focus and ready to capture.For those who miss the tactile feel of a traditional DSLR mode dial, the DMC-GF3 offers an innovative mode thumb wheel that quickly cycles though all available modes with visual feedback provided on the large 3 touch-enabled LCD.Available Scene Modes:Portrait, Soft Skin, Scenery, Architecture, Sports, Peripheral Defocus, Flower, Food, Objects, Night Portrait, Night Scenery, Illuminations, Baby, Pet, Party and Sunset, which can all be controlled from the intuitive touch-enabled LCD.Built-in FlashThanks to a 6400 ISO, the DMC-GF3 shoots well under low light even without a flash. But there are times when a flash provides desired enhancements. So, like most DSLRs, the DMC-GF3 provides a built -in pop-up flash for added light during low-light shooting.Lens Options and 3D CaptureLUMIX G Series Compact System Cameras utilize the Micro Four Thirds (MFT) System lens mount. MFT offers greater size and weight reduction in the lens without compromising lens performance and clarity. The LUMIX G MFT System offers a selection of 12 high performance fixed focal length and variable aperture G Vario zooms, including a highly versatile 3D lens capable of capturing both 2D and 3D images at the same time. There are lens adaptors available for mounting older Leica M and Leica R lenses, including older LUMIX full Four Thirds lenses. An innovative 14-140mm HD G Vario lens provides the best of video and still-image shooting with a long 10x range and near silent high-speed focusing. When connected to the DMC-GF3, ultra fast focusing and auto subject track AF can be achieved.Many LUMIX MFT lenses come with MEGA O.I.S. (Optical Image Stabilization) built-in. This feature helps prevent blurring from hand-shake. Working together with the cameras Intelligent ISO Control, which reduces motion blur by adjusting the ISO sensitivity if the subject moves, youre sure to capture images that are sharp.Dust Reduction SystemAs with many interchangeable lens cameras, dust on the sensor reduces image clarity. To eliminate this potential, the DMC-GF3 has a Dust Reduction System that uses a supersonic wave filter in front of the Live MOS sensor. Vibrating vertically around 50,000 times per second, the filter repels dust and other particles effectively.HD Video CaptureThe LUMIX DMC-GF3 also shoots 1080/60i High Definition video using the AVCHD format (sensor output 30 fps). It offers a built-in mono microphone and includes a wind-cut function that further enhances the sound as it helps reduce noise caused by background wind. An audio meter can be displayed on the LCD for monitoring audio levels. Captured video can be played back in High Definition via an optional HDMI mini cable directly to an HD-compatible TV, or played directly on Panasonic VIERA TVs via the SD card. New near silent focusing features offered in several LUMIX Micro Four Thirds lenses help keep lens noise at bay, while the touch-enabled LCD allows you to automatically keep active subjects in focus with touch-enabled subject AF Tracking.Faster, Accurate Pinpoint FocusingContrast Detection Auto Focustechnology used in point-and-shoot and new mirrorless Compact System Cameras now approaches the speeds that were once only available from traditional professional-level DSLRs. The DMC-GF3 now offers the new LUMIX Light Speed Auto Focus technology developed for the highly regarded GH2. LUMIX Light Speed AF locks onto a subject quickly so you wont suffer from shutter lag frustration.Contrast Auto Focusingalso offers greater shot accuracy due to fewer hardware components needed vs. traditional DSLR phase difference systems, thus fewer pictures will suffer from system focusing errors (e.g., the accuracy of Contrast AF is approx. 90% at F1.4, while Phase Difference AF is approx. 60%).&nbsp;Select the Pinpoint AF from the menu.Touch the point for auto focusing.Enlarge the image to finely adjust the point.Focus and shoot with the touch shutter.Manual control over focus is available in the DMC-GF3 and now features a quick 4x magnification feature. By simply touching the subject, that subject is then enlarged in a small window, allowing you to keep the rest of the image in view as a framing reference. Beyond 4x, that small window fills the monitor so even more control over focus fine-tuning can be achieved. This handy feature is available from both the MF Assist (Manual Focus) and AF + MF focus modes.The DMC-GF3 now offers a large LCD touch-focus area, enabling touch-focus control from any part of the image as seen on the LCD. Unlike traditional DSLRs that limit the number and position of focus points, the DMC-GF3 uses the entire image sensor and can even fine-tune focus with a new fine-tuning Pinpoint AF feature. When Pinpoint AF is enabled, the image is enlarged, allowing for pixel-level setting of the focus area desired. Once set, the DMC-GF3 will use this fine-tuned focus point to produce a sharp, detailed image.Intelligent Auto and Intelligent Auto Plus (iA, iA+)The DMC-GF3 has advanced functions that will satisfy experienced photographers, yet is easy enough for beginners to use comfortably in both photo and video recording modes with iA (Intelligent Auto) Plus. In the new iA Plus Mode, the defocusing area, exposure control and white balance can be adjusted visually for scenes where a slight manual adjustment may produce a more desired result.Defocus: the background defocus can be adjustedColor: the white balance can be adjusted from red color to blue colorBrightness: the exposure compensation can be adjustedColor and EffectsWith LUMIX Creative Control Mode, accessed from the Mode dial at the top of the camera, an expressive look to the image can be achieved without the need for complicated post-processing software. Common effects can be achieved via the touch-control menu as a pre-setting in an easy-to-understand what you see is what you get experience. Effects include: Expressive, Retro, High Key, Sepia, High Dynamic and now, Miniature Effect.Using the LUMIX Photo Style Mode, popular color effects can be achieved. These settings can be further enhanced with fine-tuning of Contrast, Sharpness, Saturation and Noise Reduction. Color effects include: Standard, Vivid, Natural, Monochrome, Scenery, Portrait and Custom.Venus Engine FHDThe new LUMIX Venus Engine FHD offers vastly improved compensation for electronic noise under low light and shadows where higher ISOs typically add grain to the image. Circuitry on the large DSLR sized 12.1-megapixel sensor further reduces low-noise signal problems at the pixel level and at the amplifier circuit level. As a result, higher ISOs with much lower noise can be achieved. This means faster action-stopping shutter speeds in low light, and a maximum achievable ISO of 6400.The new Venus Engine FHD uses new Intelligent Resolution technology to sharpen edge detail without softening fine detail. In addition to maximizing edge and fine detail, the Venus Engine offers Intelligent D-Range Control. Intelligent D-Range Control enables maximum capture of the images full range of brightness, without blown-out highlights and muddying shadows"}