{"asin": "B0034XIL60", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Make memories and share joy with Nikon's new high-resolution Coolpix L22 and its 12.0 effective megapixels, 3.6x zoom and huge, bright 3.0-inch LCD. Nikon's 3-way VR Image Stabilization System automatically detects subject movement and adjusts the shutter speed and ISO to compensate for camera shake and minimize image blur. The camera's Easy Auto Mode with Scene Auto Selector simplifies your picture-taking experience by letting camera automatically select the best setting to get great pictures. Nikon's Smart Portrait System will; fix red-eye, detect faces, fire the shutter when your subject smiles and warn you if they blink, to get you great portraits.Carefree operation and high performance combined for consistently great picturesCombining the precision optics of a Nikkor lens with the image quality and performance benefits of Nikon's innovative EXPEED digital image-processing concept, the Coolpix L22 is a quality compact digital camera that combines high performance with outstanding operating ease.Intuitive and automated operation ensures carefree command over the high performance features of the Coolpix L22. Activated in Easy Auto Mode, Nikon's Scene Auto Selector makes capturing special moments as easy as turning on the camera and shooting without worrying about any settings. Electronic VR image stabilization, Motion Detection, Nikon's BSS (Best Shot Selector) function and ISO 1600 capability help ensure sharper results in lower light, or when capturing fast-moving subjects.The Coolpix L22 is powered by AA size/R6 batteries, for the added advantage of being able to pick up a new set in virtually any corner of the world. The Coolpix L22 provides reassuring freedom from any worries about recharging or running out of power when a special shutter chance presents itself.The large high-resolution 3-inch LCD monitor offers a bright image that is a pleasure to view, even outdoors. Controls are sized and placed to ensure intuitive operation. For example, dedicated buttons on the back of the body make it easy to switch between shooting and playback modes. And the contours of the large thumb rest and the body itself assure a solid grip. Design is just one aspect of the Coolpix L22 that combines beauty and functionality.Nikon Coolpix L22 Feature HighlightsEXPEED digital imaging technologyNikon's smarter approach to digital imaging technology. From image capture to processing, Nikon's comprehensive EXPEED digital imaging concept encompasses the entire picture-taking operation. EXPEED is much more than a processing engine; it is a revolution in digital photography.Intelligent automation contributes to carefree shootingEasy Auto Mode simplifies photography by taking control of settings; just turn on the camera and shoot freely. Activated in Easy Auto Mode, Nikon's Scene Auto Selector eliminates the need to manually select a scene mode to match the shot, making it faster and easier to capture the moment in beautiful fashion. The Coolpix L22 and L21 use this intelligent function to analyze the subject and its surrounding settings and automatically select the most appropriate scene mode to achieve optimal results.Advanced image stabilizing features*help ensure sharper resultsNikon's Electronic VR image stabilization and Motion Detection compensate for subject movement as well as camera shake. Nikon's original BSS (Best Shot Selector) function automatically shoots a series of sequential frames and saves the one with the sharpest focus.* The camera selects and uses only the features required to optimize each image.Nikon's exclusive Smart Portrait SystemAutomatically detecting as many as 12 faces in the shot, Face-priority AF helps produce satisfying portraits by adjusting focus and exposure. Smart Portrait Mode*helps to faithfully record precious moments by automatically releasing the shutter when the subject smiles. Blink Warning displays an alert when it suspects that a subject has blinked. In-Camera Red-Eye Fix automatically corrects perceived red-eye effect before saving the image to memory.*The Smart Portrait Mode function for the Coolpix L22, L22 and L21 operates in the same fashion as the Smile Mode function for other models.Nikon Coolpix L22 Other FeaturesMacro shooting from as close as 5 cm (2 in.)ISO 160016 scene modes for optimized shooting in various settingsD-LightingTwo movie modes with soundApprox. 19 MB of internal memoryWhat's in the BoxLR6/L40 (AA-size) alkaline batteries x2UC-E6 USB CableAN-CP19 StrapCoolpix Software Suite CD-ROM", "title": "Nikon Coolpix L22 12.0MP Digital Camera with 3.6x Optical Zoom and 3.0-Inch LCD (Red-primary)", "price": 159.0, "salesRank": {"Camera &amp; Photo": 2011}, "imUrl": "http://ecx.images-amazon.com/images/I/415cOCbeyML._SX300_.jpg", "related": {"also_bought": ["B000UZL0YU", "B000P1O73A", "B0055UF6R2", "B001PKEJYM", "B001OBXVXM", "B00F0XRFAK", "B005FYK4ZC", "B001OC3YB0", "B004M8SVAM", "B005006V4E", "B002DS7NJI", "B003IYFXG6", "B00B7N9CB2"], "bought_together": ["B000UZL0YU"], "buy_after_viewing": ["B00B7N9CB2", "B003VNKNEQ", "B0055UF6R2", "B00HQ4W3EO"]}}