{"asin": "B00CRZXV16", "related": {"also_bought": ["B00CRZXUZI", "B00CRZXSH8", "B00CRZXV3O", "B001W3MMHI", "B007U7LZQ4", "B00CRZXV52", "B007U7LZQE", "B001W32F02", "B007U7LZOG", "B003H5174S", "B0089U3VDQ", "B00CRZXSGE", "B00804BEAI", "B004MWL0J2", "B00AOHDC4A", "B00DW1TUY6", "B004MWP3FO", "B0036ZBEFG", "B001W30E2S", "B007U7LZOQ", "B003GIS8TI", "B00555TXMG", "B00BRCN9TO", "B004MWL0H4", "B003H4ZVH8", "B003GIS8TS", "B00134V4I4", "B00138UY6I", "B00CRZXX1Y", "B001H0SOI2", "B001H0U86S", "B00491ORGO", "B00CN8AI0E", "B008DFT7RQ", "B005XFTIIM", "B0038ALXZ0", "B0089U3VN6", "B004MWI06I", "B00804BE9E", "B001W3MMH8", "B0038APD60", "B00DSE1ZJK", "B0089U3VPY", "B00134RN70", "B004MWN1AS", "B00J40068I", "B003JQV9LG", "B00J3ZZJL8", "B00B7YJ7NE", "B00DW1U3CY", "B005JU98NG", "B007U7LZQO", "B00ASJHH68", "B005ZCY36K", "B00134V53S", "B00CRZXWZG", "B0041CJM70", "B003GIS8T8", "B00ASJHKE2", "B00ASJHIS0", "B007U7M00E", "B001U5JD9I", "B00134OA0I", "B00CV7BX9C", "B00CRZXS8W", "B0038AJKKK", "B00AIL48TK", "B0041CJM6G", "076967559X", "B00361XWDC", "B0080M1JJQ", "B00138NL8G", "B003HI3B80", "B00138UYOU", "B00AOHDBRI", "B003UXDNQ2", "1602680930", "B00ASJHIIU", "B001TKUXUC", "B00HHYF5AC", "B001COH3MQ", "B00ASJHDK8", "B00AHUKLES", "B00CN8AGCO", "B00D38UBJ6", "B00CN8AI2M", "B001W2WKS0", "B004PHE924", "B0038APD3S", "B002XDQITE", "0761149619", "B0044WVH5M", "B00CV7BX7E", "B002BJGYJO", "B00DCWM1N2", "B004Z7H2EQ", "B00361XWCI"], "also_viewed": ["B00CRZXV3O", "B00CRZXUZI", "B001W3MMHI", "B007U7LZQ4", "B00CRZXSH8", "B00CRZXV52", "B007U7LZOG", "B004MWL0J2", "B003H5174S", "B00DSE1ZJK", "B001W32F02", "B007U7LZQE", "B00DW1TUY6", "B0089U3VDQ", "B007U7LZOQ", "B00CRZXSGE", "B00CRZXX1Y", "B004MWP3FO", "B00DW1U3CY", "B004MWL0H4", "B00AOHDC4A", "B004MWN1AS", "B0089U3VPY", "B003GIS8TI", "B00CRZXWZG", "B003GIS8TS", "B007U7LZQO", "B00555TXMG", "B00804BEAI", "B00FVGVWU0", "B00B7YJ7NE", "B00DGXTC2K", "B00138UY6I", "B00BRCN9TO", "B00804BE9E", "B004CTOXPS", "B003JQV9LG", "B00GTCKOCM", "B0036ZBEFG", "B005ZCY36K", "B001H0SOI2", "B00AOHDC4U", "B001U5JD9I", "B00AOHDBRI", "B00H5HFEUM", "B00134V4I4", "B003F1FETS", "B00FAX9VGQ", "B001W30E2S", "B005XFTIIM", "B00J40068I", "B003H4ZVH8", "B004MWI06I", "B00CG0CL3G", "B00CRZXS8W", "B00J3ZZJL8", "B0038ALXZ0", "B00GTCKO90", "B00BEIKRBY", "B00491ORGO"], "bought_together": ["B00CRZXUZI", "B00CRZXV3O"]}, "title": "LeapFrog LeapReader Writing Workbook: Learn to Write Numbers with Mr. Pencil", "price": 15.49, "salesRank": {"Toys & Games": 15330}, "imUrl": "http://ecx.images-amazon.com/images/I/51Zi4T5PniL._SY300_.jpg", "brand": "LeapFrog Enterprises", "categories": [["Toys & Games", "Electronics for Kids", "Electronic Toys"]], "description": "Build early math skills with a trip to the Doodleburg Games! LeapFrog&#x2019;s LeapReader Learn to Write Numbers with Mr. Pencil Activity Set introduces kids ages 4-8 to early mathematics and number writing.  More than 40 hands-on activities present elements of mathematics&#x2014;number writing, addition, subtraction, shapes, patterns and the function of zero&#x2014;in a fun, interactive way. LeapReader Learn to Write Numbers is designed to deliver the benefits of an integrated reading and writing experience. Children can use the LeapReader to get word-by-word support while reading the story, then practice writing numbers with interactive writing guidance on special mess?free LeapFrog Writing Paper.  This product is for use with the LeapReader Reading and Writing System (sold separately). This book is not compatible with the Tag Reader.Learn to write numbers with interactive audio support!Learn about addition and subtraction through fun activities.Get in the GamePlay a very important role in the Doodleburg Games by helping reporter Dianne Inkwell keep score. Line up with athletes in lanes 1, 2 and 3, and trace the race! Aim for the bull&#x2019;s-eye on the archery range, and practice writing the numbers 1-6. Join a game of Snow Ball with Addy and Linus, and keep an eye on numbers 7-9. Count from 1-20 to help Mr. Pencil connect the dots, and draw a fan to cheer on the athletes. Trace shapes to draw a race car, and help Molly measure different heights and lengths. Along the way Diane Inkwell misplaces her pen, but luckily children have a record of the players&#x2019; scores that they wrote with their very own LeapReader!Count on Learning FunWith LeapReader and Learn to Write Numbers with Mr. Pencil Activity Set, children explore basic addition and subtraction and learn to write numbers with proper stroke order. Voiced Doodleburg characters guide the learning and get writers in the game. Step-by-step audio support provides instant feedback and guidance as children practice their handwriting and number writing on special, mess-free LeapFrog writing paper. As new writers form each number, the instruction goes from basic lines to more complex strokes. Fun activities and games are incorporated into the experience, keeping children engaged as they build writing fluency.The LeapFrog DifferenceDesigned by in-house educational experts, LeapFrog LeapReader Reading and Writing system (sold separately) is grounded in the latest research for the richest possible learning experience. As a leader in educational entertainment, LeapFrog is trusted by parents to combine innovation with a breadth of play patterns to delight and expand learning horizons. Learn to Write Numbers with Mr. Pencil reviews key elements of mathematics&#x2014;number writing, addition, subtraction, function of zero and counting in a fun, interactive way. Children build phonics and number recognition skills by touching LeapReader to numbers and words and hearing them pronounced and sounded out. As children explore LeapReader books, parents can connect LeapReader to their computer and expand the learning with fun, free activities, plus printables and tips from experts that reinforce their school skill set. You&#x2019;ll have access to their writing progress and get personalized skill insights. LeapReader reading and writing systems support children&#x2019;s independent reading skills and confidence with print, along with comprehension activities that encourage children to make predictions, analyze characters and answer questions.What's In The Box?LeapReader Learn to Write Numbers with Mr. Pencil Activity workbook, plus 25 extra pieces of special mess-free LeapFrog Writing Paper to reinforce learning through repetition.The LeapReader library features more than 150 books, writing activities, audio books and songs. (Sold separately.)"}