{"asin": "B002LBGB1S", "description": "Total entertainment, in one box. -- The Xbox 360 Elite Holiday Bundle is the total entertainment experience, with two great games included this holiday season: Lego Batman: The Videogame and PURE. With the Xbox 360 Elite, you can watch thousands of HD movies and TV episodes at the press of a button, including titles streamed instantly from Netflix.* Download Game Add-ons like songs, maps, levels and characters. Plus, with 120GB of storage, there&rsquo;s plenty of room to extend your fun.View larger.View larger.View larger.View larger.Why to BuysGet two great games included this holiday season: LEGO&reg; Batman&trade;: The Videogame and PURE&reg;120GB HDD to download games, HD movies and TV episodes.*Sleek black console with matching wireless controller and headsetHD ready - with an HDMI port (HDMI Cable sold separately)What&rsquo;s in the Box?Xbox 360 Black ConsoleLEGO&reg; Batman&trade;: The Videogame (Rated \"E10+\" for Everyone 10+)PURE&reg; (Rated \"E\" for Everyone)Xbox 360 Black Wireless ControllerXbox 360 120GB Hard DriveStandard Xbox 360 Composite A/V cableXbox 360 Black HeadsetEthernet CableXbox LIVE MembershipProduct DescriptionThe Xbox 360 Elite Holiday Bundle is a great value with two great games included, a massive hard drive, an HDMI port (HDMI cable sold separately), a black wireless controller and headset, and a premium black finish. With three powerful core processors and full surround sound, the console redefines what games look like, sound like, feel like, and play like to engage you like never before. Every Xbox 360 game title supports a minimum of 720p, and up to 1080p high definition resolution or 480p standard definition resolution, in 16:9 widescreen.Product features:LEGO&reg; Batman&trade;: The Videogame (included):Play as Batman and his sidekick Robin as you build, drive, swing, and fight your way through Gotham City. Then jump into the story from the other side and play as Batman&rsquo;s foes! There&rsquo;s no rest for the good (or the evil!). (Rated \"E10+\" for Everyone 10+)PURE&reg; (included):Take off-road racing to a new level. Experience pure adrenaline and emotion as you execute incredible aerial tricks and death-defying massive jumps. (Rated \"E\" for Everyone)Xbox 360 120GB Hard DriveThe 120GB detachable hard drive allows gamers to save their games and store television shows, movies, music, pictures, trailers, levels, demos and other content available from Xbox LIVE Marketplace. Xbox 360 Wireless Controller (black) This award-winning, high-performance wireless controller features the Xbox Guide Button for quick, in-game access to friends and music. It has a range of up to 30 feet and a battery life of up to 30 hours on two AA batteries. Xbox 360 Headset (black) Now available in black, the headset lets gamers strategize or trade taunts while playing games and send voice messages to friends on Xbox LIVE.Xbox 360 Composite A/V cableMaximize your Xbox 360 picture quality on standard-definition televisions using this S-Video connection for a noticeable image improvement over traditional composite connecters.Xbox LIVE&reg;Connect to Xbox LIVE for free and you&rsquo;ll find free game trials and have immediate access to HD movies and Game Add-ons like songs and characters (all sold separately) so the fun never ends. Included with your console is a one month subscription to Xbox LIVE Gold. Xbox LIVE Gold is the best in gaming and entertainment. Invite friends from all over to connect and play online multiplayer games or watch thousands of HD movies streamed instantly from Netflix.*Free Netflix trialSee how easy it is to stream movies instantly to your console from Netflix, many in high definition.* Microsoft&reg; Points required to shop Xbox LIVE Marketplace for games, add-ons, and media content (sold separately). Xbox LIVE Gold membership and Netflix unlimited membership required for Netflix instant streaming. See Netflix Terms of Use for details about Netflix service. Xbox LIVE Gold required for online multiplayer. Xbox LIVE system requirements available atwww.xbox.com/live. Largest library based on next generation consoles.", "price": 261.95, "imUrl": "http://ecx.images-amazon.com/images/I/511o8%2BtU2NL._SX300_.jpg", "related": {"also_viewed": ["B000PD0HQE", "B00FATRKOK", "B00D9EPI38", "B003O6JKLC", "B00BBU8VFY", "B003O6JJKY", "B005YR1VP2", "B001F7AAFW", "B000V761SM", "B00FATRKLI", "B000B6MLUA", "B00FATRKWM", "B009VS8G80", "B000RZXR0S", "B00D9FQAM0", "B001NCDAV0", "B000U9XBUM", "B0096KEMUY", "B00ACILQS0", "B001FPFVD0", "B005M8GSAG", "B003O6JLZ2", "B00EZFVPBE", "B001FPBZBC", "B00LV5XHIK", "B001ELWMHI", "B004REDT3A", "B00GZ9ESEE", "B0096KENEO"], "buy_after_viewing": ["B00D9EPI38", "B000PD0HQE", "B005YR1VP2", "B003O6JKLC"]}, "categories": [["Video Games", "Xbox 360", "Consoles"]]}