{"asin": "B001APM444", "description": "Whether a diehard fan of the Grand Old Game, or someone who has never even seen a ball, bat or glove in your life,Mario Super Sluggersturns your living room into a rocking, socking baseball extravaganza. Staring the ever-lovable Mario and over 40 of his friends from the Nintendo universe,Mario Super Sluggersbuilds on the social-gaming fun and movements millions have learned from playingWii Sportsand turns even newcomers to gaming or sports titles into full-fledged baseball fanatics in a matter of minutes.A whole new ball gameCome to bat as a captain Mario.View larger.Go ape in the outfield.View larger.Be ready to bring the heat.View larger.Prepare for fielding challenges.View larger.GameplaySet in the diverse environments of 'Baseball Kingdom,' this is a game that is easy to learn and compulsively addictive, but that also can be made to be as challenging as you want it to be. When you are a rookie go on the offensive by swinging the Wii Remote to smack singles, doubles, triples or even home runs; while when playing defense simulating a pitching motion to toss the ball over the plate. As you grow more confident in your skills, you can choose to attach a nunchuck controller while playing defense to control outfielders for an extra challenge. And regardless at what level you play at always remember thatMario Super Sluggers' nine mini-games are always an option. So, when you need a break from organized play, just grab a few friends and take the mound in a pitching challenge or swing for the fences in the home run derby.In addition, sinceMario Super Sluggerssupports up to four players, with enough controllers, you can go two on two in epic battles. As you traverse the Baseball Kingdom, put together your \"all star\" team made up of your favorite Nintendo characters including the games five captains. Each of these has different abilities and temperament making them as valuable as they are difficult in the right or wrong situation. The result is a take on the American Pastime that you and your family will have a hard time putting down.Multiple Game ModesBaseball should be a social game, so whether you are by yourself or surrounded by friends, there's aMario Super Sluggersgame for every occasion.Challenge: Trek across Baseball Kingdom in this singleplayer. mode. Defeat characters in a variety of baseball-related challenges to persuade them to join your team. Once you've assembled an all-star team for the ages, throw down with the baddest baseballer in town: Bowser! The singleplayer. Challenge Mode is a sports fan's dream.Explore the rich and varied landscape of Baseball Kingdom as you gather teammates for your fight against Bowser. From lush tropical jungles to modern urban landscapes, each area of the kingdom is a new experience.Like high-powered free agents, the characters inMario Super Sluggerswon't join just any old team-they want to play for a winner. When you find a new character, he or she will test your skills on the field. Only by besting them in hitting, pitching and fielding contests can you get them to join your side.In Challenge Mode, you can control one of five captains, each with personal special powers. Yoshi can jump through manholes, Wario has the power of magnetism and Donkey Kong can climb vines and shatter barrels.Exhibition: Hit the field and try your luck with a team of your choice. You can play against either the computer or up to three other players.Mini-game: Challenge yourself or take on up to three other players in nine mini-games. From home run contests to pitching duels, you'll have more fun than a rookie at his first spring training.Toy Field: Battle against three other players in a hitting and fielding extravaganza. You can set your turn limit and the skill level of your computer opponents, or just play against friends.Training: Learn the ropes in an extensive tutorial mode.Special Powers, Weapons, Moves &amp; FeaturesMario Super Sluggersisn't your typical baseball game. From special moves to obstacle-filled stadiums, there's always something new around the corner for players on the field to deal with. Just a few of the goodies you'll find out on it's fields of play are:Special Moves: All of the captains have unique Star Skills that allow them to perform special moves while pitching or batting. Mario can turn his fastball into a fireball, Daisy can create a flower garden in the outfield and Luigi can turn infield hits into a raging tornado. Non-captains can also use Star Skills to put a little extra mustard on hits or pitches.Chemistry: Just as in real sports, certain characters inMario Super Sluggershave a special connection on the field. Known as chemistry, this connection allows players to make spectacular leaping catches, gun down speedy base runners and use items to interfere with fielders.Stadiums: There are nine unique stadiums in the game, everything from an ice-filled castle to an urban cityscape. Many stadiums can be accessed at both day and night, allowing you to play a doubleheader under the lights.Wii Nunchuk: Experienced gamers can also attach the Nunchuk controller for a more advanced gaming experience.", "price": 64.99, "imUrl": "http://ecx.images-amazon.com/images/I/51%2Bl-GYUV8L._SY300_.jpg", "related": {"also_bought": ["B0032Z3POI", "B000INV44U", "B001O1QLDO", "B003O6H8CK", "B000FQ9QVI", "B008171AZ8", "B000R3BNE2", "B001SIFNXW", "B0009XEC0C", "B000NNDN1M", "B005EIIS4S", "B000LSJKAM", "B002BSA388", "B001GIUWX0", "B004XV9EWW", "B000XUPBBU", "B000641ZC2", "B003ZHMMEM", "B0050SVGU0", "B00009PS22", "B002BRZ9G0", "B0050SVGXM", "B0017R5SY8", "B0013E9HP6", "B004WLRR0E", "B005FYJA52", "B0017Q4DGI", "B001DO3NEW", "B002BH3N2W", "B000R3BNHE", "B000FQ9YB0", "B0009VXBAQ", "B000XJNTNS", "B00006HBTW", "B0017HIIWW", "B002WJI64E", "B004W1IX1G", "B004C34D2M", "B005EHQJ2C", "B002VB0XCQ", "B0016OVBG6", "B00118T6FU", "B0094X1ZXU", "B003ZY5NTG", "B002EE7OKE", "B00859SFBO", "B000U34SZA", "B007BGUGVO", "B002GEKIOG", "B002I08ESA", "B000TU1P3C", "B005JR5SYM", "B002L93F0A", "B00CRUAUXS", "B002672Z80", "B0041TD3O6", "B003ZCH7DI", "B00DOZRSPI", "B002K9VIAU", "B00149IL9I", "B000GHG9V6", "B000W5Y49G", "B0085NLEBS", "B0013EF17O", "B0053BCO00", "B001C58T46", "B0050SVGW8", "B001PO2BJI", "B00G0OYHCW", "B00009WAUD", "B006SRSYV6", "B00DC7G0GG", "B00CH923NE", "B00GHJ6X8G", "B009C02OKI", "B00DC7G2W8", "7506010607", "B00DC7O77A", "B0053BCP40", "B0053BG26C", "B00D7UHT0E", "B0094X2066", "B001TOQ8K2", "B0053B5RGI", "B002D2Y3IS", "B00AKIVBU0", "B00ARCWQOO", "B0039XZGXG", "B0086V5UF0", "B007PVHMCG", "B00CPESTR0"], "bought_together": ["B000INV44U", "B000FQ9QVI"], "buy_after_viewing": ["B004WLRR0E", "B000INV44U", "B003ZHMMEM", "B001GIUWX0"]}, "salesRank": {"Video Games": 2884}, "categories": [["Video Games", "Kids & Family", "Wii", "Games"], ["Video Games", "Wii", "Games"]]}