{"asin": "B000NWIOM6", "related": {"also_bought": ["B0037258ZU", "B000Q8UAWY", "B004CLYIZ6", "B006P93BAG", "B0009WRIUY", "B005JQF8IY", "B004W2OQPM", "B000IU11MS", "B00194E8WW", "B0006B47SO", "B003FBI9KY", "B002LVUG2S", "B00186VM7U", "B001WJ5AJ4", "B003FSSXYY", "B007EEKGXG", "B0041HYB9E", "B0007UA2QA", "B000N52KSW", "B000BHQ5JC", "B003FBG88E"], "bought_together": ["B000Q8UAWY"], "buy_after_viewing": ["B005C31HC0", "B0084V5FOI", "B002NU5O9C", "B002MU1ZRS"]}, "title": "Belkin F5L001 Laptop Cooling Pad", "price": 29.23, "salesRank": {"Electronics": 27647}, "imUrl": "http://ecx.images-amazon.com/images/I/41I-vRtvnCL._SY300_.jpg", "brand": "BELKIN", "categories": [["Electronics", "Computers & Accessories", "Laptop & Netbook Computer Accessories", "Cooling Pads"]], "description": "If you own a laptop, you know all about heat. Because today's notebooks rely on fast processors to do the job, they generate a lot of heat, with much of it landing directly in your lap. Some laptops can have a \"normal\" operating temperature as high as 120 degrees Fahrenheit! Not only is that unsafe and uncomfortable, it can also wear your laptop down, cause it to crash unexpectedly, and reduce its overall life expectancy.The Belkin Laptop Cooling Stand is designed to cradle your laptop in cooling comfort.Now you can be more comfortable while you work.A single high-capacity fan, which is powered by a USB port on your laptop, sits in the middle of the cooling stand.View larger.Hot air is channeled out to the left and right sides of your laptop.View larger.The USB cable is neatly tucked away in a storage compartment on the bottom.View larger.Belkin's Laptop Cooling Stand relies on a patented wave design and ergonomic features that will not only help protect your laptop by keeping it cool, but will also increase your comfort while you work. As part of Belkin's laptop@home line of accessories, the Laptop Cooling Stand is designed to help you to take full advantage of the benefits your laptop has to offer-- comfortably, economically, and stylistically.Twice the Cooling Power, Half the ConsumptionIn contrast to most other laptop coolers that use two fans to suck warm air from the laptop's bottom, the Belkin's Laptop Cooling Stand relies on the natural flow of heat and air circulation to do the hard work and needs only one fan to do the trick. Instead of drawing the laptop heat down to push it out, the stand takes full advantage of natural air flow and heat's natural tendency to rise by pushing the hot air upward through the channel and away from your laptop.The single high-capacity fan, powered by a USB port on your laptop, sits in the middle of the cooling stand, and hot air is channeled out to the left and right sides of your laptop. The result is heat dissipation that's equal to a two-fan solution but that uses less than half the power. And because the fan is USB-powered, you won't have any bulky batteries or adapters (which can also both add heat!) to weigh you down. You simply place your laptop on the stand, pull the USB cable out of the convenient storage compartment, and plug it into your computer. The stand will take care of the rest.Computing in Comfort and StyleMeasuring 12.6 x 11.6 x 1 inches (W x D x H), the Belkin Laptop Cooling Stand is designed for 15.4-inch or smaller laptops. To prevent slippage, the stand features rubber pads on the feet, and a small plastic panel folds out from the bottom of the stand that elevates the rear for better ergonomics. The gentle slope reduces wrist strain, and by raising the screen height, it also reduces neck strain that is common to laptop users.Unlike the industrial gray and metallic appearance of other cooling stands, the Belkin Laptop Cooling Stand offers an attractive, gently sloped look that you'll be proud to show off as you work. The stand's thin profile means that you can easily slide the stand into your notebook bag as you travel from meeting to meeting, or caf&eacute; to caf&eacute;. And weighing a mere 22 ounces, you'll hardly notice that it's in your bag."}