{"asin": "B00E3FHXYO", "description": "Blows away the music critics! Music that even impresses audiophiles.With its built-in apt-X technology, the BrightPlay Home HD Bluetooth receiver delivers the highest quality sound.More value packed into this device than all the rest. Beats the competition in head-to-head comparisons.Among the popular brands on the market, listeners single out the BrightPlay Bluetooth receiver as the best of class.Enjoy your tunes no matter where you are in just moments. Versatile and easy setup.With both 3.5 mm and RCA jacks, connecting to your sound system is a breeze.Outstanding Bluetooth range.Stream your music from as far away as 30 feet, depending on local conditions. Throw a BIG party with no worries about the music.Connect 2 devices simultaneously and have a DJ battle with a friend!Have two devices connected at the same time so you and a friend can play songs from your own phones without having to, disconnect, reconnect, and kill the party.WeCare at BrightechAt Brightech, we stand behind all our products 100%. That's why we offer an industry leading 3-year satisfaction guarantee on all of our Bluetooth receivers. If for any reason you are not completely satisfied with your order, please contact us via email and you're done!", "title": "Brightech - BrightPlay Home HD&trade; Bluetooth 4.0 Music Receiver / Adapter with apt-X Technology for CD Quality Sound - Adds Bluetooth Functionality to Non-Bluetooth Sound Systems. Stream Music with Startling Clarity from your Mobile Device to Speakers and Stereos - Connect 2 Devices Simultaneously and Have A DJ Battle with a Friend!", "price": 34.99, "imUrl": "http://ecx.images-amazon.com/images/I/41%2BBpCgpNML._SX300_.jpg", "related": {"also_bought": ["B00HZVPD72", "B00JAZGSXY", "B00IZC34H6", "B009OBCAW2", "B00JK0G8KC", "B00006JPDI", "B0049P6OTI", "B00GMFYM8I", "B000FHBEFS", "B00713RSE0", "B00E174RTS", "B00I053I5G", "B0085HOM4K", "B005K2TXMO", "B002MP5JX4", "B00EACWS4U", "B00IHWOBVC", "B00H00VLZQ", "B0001VHARY", "B000I23TTE", "B00EE18O7W", "B0002FUOR2", "B0029HHIDY", "B00DQUNODQ", "B00DIGD604", "B0001VHARE", "B008UG6GCC", "B00390IT7O", "B00378KMF0", "B00C2P61FO", "B006LW0WDQ", "B005DL2OVE", "B009NLTW60", "B00026BQJ6", "B009EADB08", "B001EAQTRI", "B004B8GF7Y", "B00GTGETFG", "B007Q45EF4", "B0044YPN0A", "B00BWS87WW", "B004YEFLGQ", "B008I640HW", "B00IBDOB5I", "B008NCD2LG", "B00F0H88SY", "B00D82O68Y", "B001KVZU94", "B00KINSDK8", "B00GHUHMUS", "B006U1VH2S", "B00B9B4IYI", "B00DR0PDNE", "B004YDUZ22", "B008AGQMQC", "B005NGLTZQ", "B005WM3ALC", "B004G7O1PI", "B00378KMEG", "B00971XFPA", "B00F25Z0FS", "B003QKS4Z4"], "bought_together": ["B009OBCAW2", "B0049P6OTI"], "buy_after_viewing": ["B009OBCAW2", "B00IQBSW28", "B00IZC34H6", "B00HZVPD72"]}, "categories": [["Electronics", "Home Audio", "Stereo Components", "Speakers", "Speaker Systems"]]}