{"asin": "B003UT2C4U", "categories": [["Electronics", "Computers & Accessories", "Monitors"]], "description": "ASIN# B003UT2C4UBeautiful High Definition VisualsFrom gaming to movie watching to Web surfing, enjoy bigger, brighter, and an all-around better visuals from the 27-inch ASUS VE276Q Full HD monitor at home or in the office. With ASUS Smart Contrast Ratio (100,000:1), experience bright whites and dark blacks that bring photos and scenery to life. 2ms Trace-Free Technology ensures smooth motion playback by delivering precise visual detail during fast-moving scenes. The VE276Q is built with user-friendly features such as AI Light that automatically detects surrounding light and adjusts screen brightness to help your eyes comfortably adapt to the display's lighting. Splendid Video Intelligence Technology lets you easily optimize screen color and contrast to your preference by instantly selecting from one of the six preset scenarios. Boasting a host of ports including HDMI and DisplayPort, the VE276Q connects to various PCs, gaming consoles, and other devices. The VE276Q has an understated yet sophisticated VESA-mountable design with built-in speakers and clean cable management to ideally fit any home or office setting.Key Features27-inch Full HD displayfor crisp high-definition image quality (Learn more)ASUS Smart Contrast Ratio technology with 100,000:1 contrast ratiodynamically adjusts between black and white for sharper and brighter visuals (Learn more)2ms Trace Free Technologydelivers incredible detail for smooth motion playback during fast-moving scenes(Learn more)AI Lightautomatically detects the lighting environment and adjusts display brightness to prevent your eyes from having a blinding sensationSplendid Video Intelligence Technologylets you optimize color and contrast to your liking from the six preset color modes and three skin tone modes via the Splendid hot key (Learn more)Clean cable management designfor a clutter-free appearance in any setting (Learn more)Built-in stereo speakersfor rich audio quality (Learn more)3 year system warranty, 3 year panel warrantyLearn MoreFull 1080p HD BrillianceView largerThe 27-inch Full HD 1080p VE276Q display is perfect for watching HD movies, playing games, and viewing photo albums. Its 2ms Trace-Free Technology (gray to gray) ensures accurate detail and fluid motion for fast-moving scenes. ASUS Smart Contrast Ratio (100,000:1) dynamically fine-tunes between black and white to sharpen images and accurately reproduce images as intended.Optimize to Your LikingView largerWhether you're viewing photos, watching movies, or surfing the Web, the VE276Q comes with exclusive Splendid Video Intelligence Technology that lets you easily adjust color and contrast to your preference in a simple push of a button. With a total of six color preset modes and three skin tone modes, customize image settings for an entirely personalized visual experience.Sensibly Sophisticated DesignView largerThe VE276Q has a streamlined design that's as practical as it is stylish. Its narrow frame gives additional screen real estate and offers a more seamless appearance when placed adjacent to other monitors&mdash;ideal for using multiple display technology via the DisplayPort. Plus, built-in stereo speakers provide sound when connected to either the HDMI or the audio out port, delivering sound with no external speakers. VESA mountable, the VE276Q fits nicely on walls and, thanks to its cable management, hides wires for a clean simple appeal.ASUS &mdash; World Leader in TechnologyASUS is the world leader in motherboards and graphics cards, and is one of the fastest growing of the top 10 notebook brands. The ASUS product portfolio includes monitors, notebooks, Eee PCs, motherboards, graphics cards, and much more. In 2009, ASUS products won 3,268 distinguished awards thanks to the innovative user-centric technologies such as Splendid Video Intelligence Technology&mdash;included in every LCD monitor and notebook.ASUS Warranty3 years LCD monitor warranty3 year panel warranty2-way free standard shipping for repairsComplementary ASUS Rapid Replacement (cross-shipping)What's in the BoxASUS VE276Q LCD MonitorDVI CableVGA CableAudio CablePower Cord &amp; AdapterQuick Start GuideWarranty Information CardSpecificationsPanel:TFT LCDPanel Size:27-inch WidescreenTrue Resolution:1920 x 1080Pixel Pitch:0.311mmBrightness(Max):300 cd/m2Contrast Ratio (Max):100,000:1 (ASCR)Display Color:16.7MViewing Angle (CR&gt;=10):170&deg;(H)/160&deg;(V)Response Time:2ms (Gray-to-Gray)Video Features:2ms Trace Free TechnologySplendid Video Intelligence TechnologySplendid Video Preset Modes (6 modes)Skin-Tone Selection (3 mode)HDCP supportAudio Features:Stereo speakers 3W x 2 stereo RMSConvenient Hotkey:Splendid Video Preset Mode SelectionAuto AdjustmentBrightness AdjustmentVolume AdjustmentInput SelectionPC Video Input:Display Port/ DVI-D/ D-Sub / HDMI 1.3PC Audio Input:3.5 mm mini-jackAnalog Signal Frequency:30 ~ 83kHz(H)/ 56 ~ 76 Hz(V)Digital Signal Frequency:30 ~ 83KHz(H)/56 ~ 76 Hz(V)Power Consumption:Normal &lt; 70 W; Power Saving Mode &lt; 1 WChassis Colors:BlackTilt:+20&deg;~ 5&deg;VESA Wall Mounting:100mm x 100mmSecurity:Kensington lockPhys. Dimension (W x H x D):25.31 x 17.54 x 8.66 &ndash;inchesWeight (estimated):15.87 lbsRegulation Approval:UL/cUL, CB, CE, EuP, FCC, CCC, BSMI, Gost-R, C-Tick, VCCI, PSB, EK, J-MOSS, Taiwan Green Mark,RoHS, WEEE, WHQL&copy; 2011 ASUS Computer International. All Rights Reserved. ASUS is a registered trademark of ASUSTeK Computer. All specifications are subject to change without notice. Color and bundled software versions are subject to change without notice. Brand and product names mentioned are trademarks of their respective companies. Product may not be exactly as shown in photos.Check Out Other Great ASUS ProductsVG236H 3D Vision LCD Monitor (kit included)Featuring NVIDIA&reg;3D Vision&trade;technology that reinvents your movies, videos, and games for the third dimension. This all-inclusive 3D bundle includes four components that provide everything you need to easily connect to a compatible PC1 and start enjoying 3D in brilliant HD splendor.ASUS Skype Video Phone Touch SV1TSA truly revolutionary technology, the ASUS Skype Video Phone Touch allows you to make unlimited video Skype calls at a touch without a computer or additional hardware or software.ASUS RT-N16 Wireless N Router (with 2x USB)Upgrade to more range, speed and coverage with the ASUS RT-N16 wireless N router. Loaded with features such as AiDisk and Multifunction printer server, RT-N16 serves as the ultimate wireless networking router for your home or small office.ASUS VW266H LCD Monitorfeatures a 25.5-inch 1920x1200 LCD screen that supersedes Full HD 1080p resolution. Its extra large resolution and ASUS Trace Free 2ms response time makes it ideal for immersing yourself in the latest games with the sharpest details and clarity, even for fast motion action video playback.", "title": "Asus VE276Q 27-Inch Full-HD LCD Monitor with Integrated Speakers", "price": 239.5, "salesRank": {"Computers & Accessories": 6659}, "imUrl": "http://ecx.images-amazon.com/images/I/41ylwKDp6CL._SY300_.jpg", "related": {"also_viewed": ["B0043T34RK", "B0043T7FHK", "B005BZNDHQ", "B005NM8PB6", "B003LD1QRY", "B00302DNZ4", "B0099XBO5E", "B0098Y77N2", "B003D1ADUU", "B00EIRFYS4", "B005LN1JEC", "B009HNEBLK", "B00B17C5KO", "B00IQCRLZG", "B00BUI44US", "B0058UUR6E", "B00DX64DCY", "B00CMKOVPQ", "B00IZBIMLK", "B00FE6DNM2", "B0063BM5NK", "B005JN9310", "B00906HM6K", "B008A3KFB8", "B007HSKSP0", "B009H0XQQY", "B008RM23ZI", "B00G5AEZOQ", "B00CLZ04VW", "B00A46Y6DW", "B005BZNDS0", "B00DBVPOZG", "B009H0XQPA", "B007BZ1092", "B004EFUOY4", "B00CCILAIO", "B00EMB4K54", "B00JTEV47Q", "B00BIBB1KI", "B008DWH00K", "B00B2HH7G0", "B007ZS3O62", "B009AENEVO", "B00JPK046Q", "B001LYWBOM", "B00C18YTC4", "B00IEZGY7G", "B00C841QOA", "B00IEZGY2Q", "B009C3M7H0", "B00B332A9C", "B0077CT8K2"], "buy_after_viewing": ["B0043T34RK", "B0043T7FHK", "B0058UUR6E", "B003L1ZYYM"]}}