{"asin": "B00000J2W7", "description": "All of your favorite Nintendo characters have come together to answer the question: who is king of the Nintendo hill? The format can aptly be described asSuper Mario KartmeetsMortal Kombat, which makes for an odd, yet addictive game. The object is to throw, punch, smash, or blast your opponents off the edge of the beautifully rendered, themed arenas. Numerous power-ups, weapons, and surprises help or hinder the melee. Your eventual goal is to fight your way through to a bizarre final boss character. Victory in this battle rewards you with another character to play, such as the scene-stealing Pok&eacute;mon, Jigglypuff.From Star Fox's laser pistol to Link's hook shot, each character's trademark special abilities are utilized to knock one another off the screen. The game does a great job balancing the characters' widely differing powers so that no one character has an insurmountable advantage. The sound and animations are also dead-on: Donkey Kong is a huge, cartoonish ape, while Link is much more detailed and realistic. And Pikachu's famous thunder shock attack is accompanied by a fearsome yell of \"PIKA!\"Unlike most fighting games,Super Smash Bros.allows you to team up with a computer partner and take on other teams in both single and multiplayer modes. But the most fun is had when four human players play in a battle royale. The game quickly becomes a scene of incredibly fun chaos: picture Mario beating up on Luigi, while Donkey Kong is chased by a scampering, sledgehammer-wielding Pikachu. It's the perfect party game.--Hugh ArnoldPros:Great characters: Mario, Luigi, Pikachu, Kirby, Donkey Kong, Link, Star Fox, Yoshi, and moreSimple gameplayComputer partner optionColorful arenasCons:Limited number of arenas", "price": 399.95, "imUrl": "http://ecx.images-amazon.com/images/I/61Yxhx%2B5B4L._SX300_.jpg", "related": {"also_bought": ["B00000DMAX", "B005GTNBGK", "B00002DHEV", "B005DI7N7W", "B000PJHAD6", "B00000F1GM", "B005GTND0E", "B005GTNC8W", "B00000IFRI", "B00000ID61", "B000QHOHHE", "B00003OTI3", "B00002STEZ", "B000046Q7Q", "B00004U1QY", "B00002STH0", "B00005AW1W", "B003UI5GLC", "B00000INR2", "B002TK1PX0", "B00000DMAQ", "B000Y0CHX4", "B00004U1R1", "B000YOCGUO", "B00005M8TL", "B0015OG4G4", "B000F9JFXE", "B000058BCU", "B00002STFH", "B000021Y2Z", "B00003E4EB", "B00004R9I4", "B000031KJM", "B00004S9AA", "B00004R9IB", "B00856304Y", "B00004SWLT", "B00000K1AF", "B00004U1R3", "B000046S41", "B00000JHPD", "B003ZU0PHU", "B00001QES1", "B00000J2OO", "B0046CZX78", "B007SJMEHI", "B00002STH5", "B00004S9A7", "B002J44BXW", "B00002STI2", "B0009Y808Q", "B00000DMAO", "B000JVM256", "B00AFJMFJA", "B00000ID60", "B00000K2G9", "B00HM3QANO", "B0013KR3QA", "B00005C4IE", "B00005ME6D", "B00HM3QAZW", "B00002STXG", "B00004S9A2", "B00004WLMA", "B000038A6U", "B00002STHX", "B00005249D"], "bought_together": ["B00000DMAX", "B005GTNBGK"], "buy_after_viewing": ["B002TK1PX0", "B00000F1GM", "B00000DMAX", "B00002DHEV"]}, "salesRank": {"Video Games": 801}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "More Systems", "Nintendo 64", "Games"]]}