{"asin": "B0031NF116", "description": "This stylish, remote controlled mini MP3 Alarm Clock Radio is great for waking up to your favourite tunes, improving those tinny laptop speakers or making mobile phone mp3's sound like they're supposed to.With USB in, an SD card reader and 3.5mm audio input this little music box can make MP3's from almost any source sound great. Just in case your phones not covered, August have even included a 2.5mm to 3.5mm adaptor and a Sony Ericson headphone to 3.5mm adaptor in the box.3 different wake up modes are available for the alarm, you can choose to be beeped awake, woken by MP3 or to have the Radio come on first thing in the morning. And as the time is backed up by 2xAAA batteries, unexpected power cuts shouldn't leave you fiddling around resetting times.For portable use, the internal battery is good for approximately 5 hours of playback, great for an afternoon by the sea or to keep you entertained by the barbeque.Small yet surprisingly powerful, the device weighs in at just 525g and its dimensions are: 130x90x95mm, small and light enough for carrying in a rucksack or picnic hamper.", "title": "August MB300 Mini Wooden MP3 Stereo System and FM Clock Radio, with Card Reader, USB Port &amp; AUX Jack (3.5mm Audio In), 2 x 3W Powerful Hi-Fi Speakers and Built-in Rechargeable Battery", "price": 18.99, "imUrl": "http://ecx.images-amazon.com/images/I/51lrfqyDupL._SY300_.jpg", "related": {"also_bought": ["B00CBD65X0", "B000FGNM6I", "B00CBD65TY", "B00CBD65WG", "B0081ELP5G", "B00A8GY5VG", "B00A8H4XTY", "B00EDBED64", "B00CBD65Z8", "B00A8GY59I", "B00DL2OFKK", "B00CBD65TE", "B00DL2J9UG", "B00633U7CO", "B0089RRK36", "B009Z8IX7K", "B00C5HXR9W", "B007NE6WFS", "B00GMQ0XIA", "B00B0XK58I", "B005FYNSPK", "B00FBJ55DC", "B000WQKOQM", "B00CJJ2224", "B0043L32KC", "B00DL2LLHU", "B0012Y2LLE", "B00200K1TS", "B007JRB0TC", "B0002D01KO", "B001S2PJ3W", "B001CQT0X4", "B00IWOJS9A", "B000GB0G7A", "B005C7STJ0", "B00DYQYLQQ"], "bought_together": ["B000FGNM6I"], "buy_after_viewing": ["B00CBD65WG", "B004VF4D9E", "B00EDBED64", "B0081ELP5G"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}