{"asin": "B004D268RA", "related": {"also_bought": ["B0088W7OHE", "B0067H6JGY", "B0067H6KP4", "B005OLQA36", "B004DK57M4", "B00B2G03K8", "B004RRBREA", "B00J7ONIOK", "B00B2G03JY", "B004DK79A2", "B005M2GJ5Q", "B00B2G03IA", "B004DK8QS6", "B005OLPFXC", "B005M332A0", "B00F1D56HI", "B00J7PL9F4", "B001P97U58", "B00J7PAZMM", "B00CG0EEXG", "B0045VHFMG", "B005M32MV0", "B00ILN5QC0", "B005M31I4C", "B00J7MGTGQ", "B003156NHU", "B00J2H9FGW", "B005PLQGUC", "B001F51W10", "B00J7N7L08", "B00JJDIH9A", "B00J8KSYOC", "B00JE18VQ6", "B0072ATQ9M", "B005OLQJGE", "B00DNE8UC0", "B001CTQMIC", "B001OOLF82", "B00BUDMJDW", "B004M97HIS", "B007UZNS5W", "B001ECQ41W", "B00LBEJOKG", "B009AAYV2E", "B0035G072M", "B005M2GKJG", "B00CAP0HJM"], "also_viewed": ["B005OLQA36", "B0067H6JGY", "B0067H6KP4", "B004DK57M4", "B0088W7OHE", "B00B2G03IA", "B00CRJL3HQ", "B004DK79A2", "B00B2G03JY", "B00F1D56HI", "B00J2H9FGW", "B005MZDSMK", "B004DK8QS6", "B005M3255I", "B00EZWS2C2", "B001ET7BF8", "B00ILN5QC0", "B00B2G03K8", "B005M332A0", "B00JIRRTYG", "B009YX923K", "B005M2EIRM", "B00FZESMKG", "B005M34XOY", "B00EFRVQKM", "B00B2FXLSA", "B00GSSDHCG", "B004W24LQ6", "B00J7OD2W8", "B00J3AUOEU", "B005IHTJU2", "B00DDSBI1G", "B005M31I4C", "B003XUMQ7E", "B005M2H57M", "B00J7PAZMM", "B00J03AMNS", "B00D1BD4KS", "B0027TUK7A", "B005M2HS0Q", "B005M2INAK", "B0045VHFMG", "B00J7N7L08", "B00E4MS4TO", "B000NFGT4I", "B004EKNFXQ", "B000QUJ1O0", "B0088W8EAU", "B00J7ONPO8", "B005OLQEL4", "B00016QYOO", "B006X1KW1W", "B00J7ONIOK", "B00JMB9WG6", "B008HBMRIC", "B000NT2EE8", "B000F35SAE", "B001FB5H60", "B005OLPKD2", "B004RRBREA"], "bought_together": ["B0067H6JGY", "B0067H6KP4"]}, "title": "Neutrogena Naturals Purifying Facial Cleanser, 6  Ounce, (Pack of 2)", "price": 14.87, "salesRank": {"Beauty": 11998}, "imUrl": "http://ecx.images-amazon.com/images/I/31aabX%2BmYdL._SY300_.jpg", "brand": "Neutrogena", "categories": [["Beauty", "Skin Care", "Face", "Cleansers"]], "description": "Neutrogena Naturals offer skincare products that harness the power of naturally occurring bionutrients to deliver safe and effective results. No harsh chemical sulfates, parabens, petrochemicals, dyes, or phthalates are included. Neutrogena has created pure, high-quality natural ingredients for balanced beauty from the skincare experts you trust.Purifying Facial CleanserAt a Glance:No harsh chemical sulfates, parabens, petrochemicals, dyes, or phthalatesRinses clean without pore-clogging residueContains Willowbark bionutrients to penetrate deep into pores and detoxify skinBionutrients for healthy-looking skinNeutrogena multi-disciplinary expertsjoined forces to discover effective naturalskincare ingredients.Neutrogena Naturals Purifying Facial CleanserThis face wash contains natural salicylic acid found in Willowbark bionutrients to penetrate deep into pores to detoxify skin and help remove dirt, oil and makeup, while rinsing clean without pore-clogging residue.WillowbarkNative to Europe, Asia, and North America, Willowbark is rich in bionutrients, such as Vitamins C, B, and E. It is also a natural source of salicylic acid, known to detoxify skin. Used for centuries by Greek, Chinese, and Egyptian civilizations to treat a range of ailments, Willowbark contains a beta hydroxy acid cultivated today for its detoxifying properties.Naturals that WorkBy merging the clinically proven expertise of Neutrogena with the best of what nature has to offer, Neutrogena is able to bring you the best of both worlds-natural skincare that really works. They've always been committed to creating products that work, and now they're bringing that commitment to natural skincare.The result? Safe, pure products that meet Neutrogena's standards for healthier, more beautiful-looking skin.BionutrientsBionutrients are highly concentrated chemical compounds found in nature that are essential for healthy-looking skin. Just like nutrients in your body are essential for health, naturally derived bionutrients can be used to promote healthy-looking skin.The benefits of bionutrients have been shown to promote healthy-looking skin by adding essential nutrients and supporting the skin's own natural functions for replenishment and detoxification. They are the foundation of healthy-looking skin and the root of Neutrogena's natural approach.Walking the WorldNeutrogena Naturals has recruited a team of technology scouts on a single mission: to scan the globe in search of time-tested solutions and ingredients from natural sources.Finding the right natural components is the most critical step in creating natural products that work. Neutrogena's team examined thousands of plants to find bionutrients essential for skin health.What's in the BoxNeutrogena Naturals Purifying Facial Cleanser&nbsp;Fresh Cleansing + Makeup RemoverCompletely removes makeup and gently cleanses for refreshingly clean skin.Purifying Facial CleanserGently removes impurities and improves complexion for fresh, clear skin.Willowbark bionutrient rich cleanser detoxifies skin.Purifying Pore ScrubGently scrubs away impurities that can build up in pores to improve complexion for fresh, clear skin.Lip BalmVitamin E bionutrient balm nourishes and soothes with essential moisture.Face and Body BarAvocado &amp; Olive Oil bionutrient rich bar gently cleanses and conditions skin.Trademark Information:Neutrogena&reg;"}