{"asin": "B000TTTJ36", "related": {"also_bought": ["B001DBF07S", "B000NAXC6Q", "B001TH7GUU", "B000ESN9GA", "B000NB2BGC", "B00BDW6D7I", "B008XVAVAW", "B00BWF5U0M", "B00EYXZI4M", "B002DUCF8A", "B000M0WALA", "B005DKZTMG", "B003MTTJOY", "B00DZLSEVI", "B00C28L6XI", "B00DBV28TG", "B00FG7N3F6", "B005NGQWL2", "B002KKYXSI", "B008ZGKWQI", "B003L137Y6", "B008TCUXLW", "B000JE9LD4", "B00E1GGE40", "B00GM0OZ4O", "B001E1Y5O6", "B000JV3CKA", "B000Q8UAWY", "B001MSU1FS", "B00BP5KOPA", "B009SQQF9C", "B00D601UC8", "B003M0NURK", "B008ALA6DW", "B00871Q5PI", "B002FFZGCU", "B0043T7FXE", "B004S5H30I", "B00B7GV802", "B00007AP2O", "B007WTHGL8", "B00BG8WW2Y", "B009UEBQIM", "B003NR57BY", "B001MSS6CS", "B001985SWW"], "bought_together": ["B001TH7GUU", "B00BWF5U0M"], "buy_after_viewing": ["B00DQFGJR4", "B00BWF5U0M", "B000Q8UAWY", "B003Z4G3I6"]}, "title": "Belkin 2 in 1 USB 2.0 7-PORT HUB", "price": 13.06, "salesRank": {"Electronics": 1110}, "imUrl": "http://ecx.images-amazon.com/images/I/413G0rZKZ-L._SX300_.jpg", "brand": "BELKIN", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Hubs"]], "description": "Featuring the ability to transform from a compact four-port travel Hub into a stable desktop Hub then back again, the Belkin Hub-to-Go USB 2.0 7-Port Hub (F5U706) lets you connect up to seven peripherals through a single open port on your PC or Mac. Ideal for use with essential system components including printers, storage drives, cameras, and scanners, the versatile Hub-to-Go supports both USB 2.0 and USB 1.1 devices. In addition, plug-and-play installation makes adding it to your existing system quick and easy.2-in-1 USB 2.0 7-Port HubAt a Glance:Unique design separates into 4-port travel Hub and 4-port desktop Hub7 downstream USB 2.0 ports with transfer rates up to 480MbpsCompatible with both USB 2.0 and USB 1.1 devicesConvenient plug-and-play installationBacked by a lifetime warrantyThe hub transforms for both desktop and portable use.View larger.Plug-and-play installation gets you up and running quickly.View larger.High-Speed Convenience with Seven USB 2.0 PortsWhen both pieces are connected on your desk, the Belkin Hub-to-Go USB 2.0 7-Port Hub features seven USB 2.0 downstream ports for fast, efficient data transfers at rates of up to 480Mbps. And it's backward compatible with USB 1.1 devices, which means you can keep older-generation peripherals up and running while maximizing the high-speed performance of new devices. You get smooth access to big files, and quick transfer of high-resolution photos and video.Ideal at Home, in the Office, or on the RoadThe Hub-to-Go is designed to give you three potential ultra-fast Hub setups in one. Its four-port travel Hub disconnects from the base to make using mobile USB devices--including mice, flash drives, external CD/DVD players, and cameras--as easy on the go as at home. For added convenience, a rotating connector on the travel hub works to keep adjacent ports free for optimal use, and it's slim enough to easily slip into your laptop bag.The sturdy desktop base can be used on its own as a four-port Hub or with the travel Hub conveniently plugged in on top, which provides seven ports for all your USB-connection needs. It also features a tray to store paper clips, post-its, and flash drives in one convenient place, minimizing clutter.Plug-and-Play InstallationA plug-and-play setup gets the seven-port Hub-to-Go up and running quickly and easily. Simply connect it to your computer using the included USB cable, follow the on-screen directions, and start connecting devices.System Requirements and Warranty InformationThe Hub-to-Go works with a broad range of systems. For PC Users, it supports use with Windows 98, 2000, ME, XP, or Vista. For Mac Users, it supports OS 9 to OS 10.The Belkin Hub-to-Go USB 2.0 7-Port Hub is backed by a lifetime warranty.What's in the BoxHub-to-Go USB 2.0 7-Port Hub: base tray hub and detachable travel hub, AC power adapter, USB cable, and manual.USB HubsUSB 2.0 4-PortUltra-Mini HubHi-Speed USB 2.04-Port HubHi-Speed USB 2.0 7-Port Lighted Hub (Black)Hi-Speed USB 2.0 7-PortLighted HubHi-Speed USB 2.0 7-PortMobile HubPorts44777USB 2.0YesYesYesYesYesUSB 1.1YesYesYesYesYesUSB PoweredYesNoNoNoNoAC PoweredNoYesYesYesYesUSB HubsUSB 2.04-Port HubUSB 2.0 PlusHub (4 Port)USB 2.0 Plus7-Port HubHigh-Speed USB 2.07-Port Hub2-in-1 USB 2.07-Port HubPorts44777USB 2.0YesYesYesYesYesUSB 1.1YesYesYesYesYesUSB PoweredNoNoNoNoNoAC PoweredYesYesYesYesYes"}