{"asin": "B002OOWCA6", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Mice"]], "description": "If you're looking for a mouse that rises to any occasion, try the Verbatim Easy Riser&#153; Bluetooth Notebook Laser Mouse.  Ultra-slim and designed to fit into tight spaces, it also lets you adjust the height of the mouse to fit your hand more comfortably using a switch on the underside of the mouse. This Easy Riser&#153; mouse is compatible with Bluetooth-enabled Macs and PCs for a cord-free and receiver-free experience after a quick set-up. With its high-resolution laser technology, the Easy Riser&#153; mouse offers smooth, precise tracking.  It also offers energy-efficient sleep modes that save batteries and software that allows you to assign a function to the scroll wheel to make your work easier.  See for yourself how well the Verbatim Easy Riser&#153; Bluetooth Notebook Laser Mouse fits your bag and your hand.Product SummaryThe Verbatim Easy Riser&#153; Bluetooth Notebook Laser Mouse is ultra slim and designed to fit into tight spaces. It lets you adjust the height of the mouse to fit your hand more comfortably using a switch on the underside of the mouse. This mouse is compatible with Bluetooth-enabled Macs and PCs for a cord-free and receiver-free experience after a quick set-up.With laser technology, the Easy Riser&#153; Bluetooth Notebook Laser Mouse offers precise tracking for smoother cursor movement. It also offers energy-efficient sleep modes that save batteries and software that allows you to assign a function to the scroll wheel to make your work easier.FeaturesAdjustable Height-The Verbatim Easy Riser&#153; Bluetooth Notebook Laser Mouse is ultra slim and lets you adjust the height of the mouse to fit your hand more comfortably using a switch on the underside of the mouse.Sleep-Mode-The Easy Riser&#153; Bluetooth Notebook Laser Mouse offers sleep-modes designed to extend the life of your batteries. Depending on the amount of time left unused, the mouse will successively move through 3 different sleep-modes than use less battery power than the one before.Laser Technology-This mouse is designed with laser technology for smooth, precise tracking.Programmable Scroll Wheel-To make your work easier, you can assign a function to the scroll wheel using the software CD included with the mouse.Bluetooth-The Easy Riser&#153; Bluetooth Notebook Laser Mouse is compatible with Bluetooth-enabled Macs and PCs for a cord-free and receiver-free experience.  Simply set-up the mouse on your Mac or PC, and you're ready to begin using your mouse.Tips for Getting StartedUsing the Easy Riser&#153; Bluetooth Notebook Laser Mouse is simple:1. Remove the mouse from the package2. Insert the 2 AAA batteries included with the mouse3. Confirm that your mouse is turned on4. Set up your mouse as a new Bluetooth device on your computerInsert the Software CD into your Mac or PC to assign a function to the scroll wheelYou're ready to adjust and go!About VerbatimFor 40 years, Verbatim has been providing technology you can trust with an impressive selection of removable storage media and computer peripherals, including a wide range of CD, DVD and High Definition video products. Verbatim also offers an array of lightning fast desktop and portable hard drives, USB flash drives, stylish, feature-rich mice and keyboards, and a broad range of replacement laser toner cartridges. Buy Verbatim and you get innovation, security, and reliability - and that means peace of mind.What's in the Box?1 Easy Riser&#153; Bluetooth Notebook Laser Mouse, Software CD, Quick Start Guide, 2 AAA batteries", "title": "Verbatim Easy Riser Bluetooth Notebook Laser Mouse, Silver/Black 96991", "price": 21.03, "imUrl": "http://ecx.images-amazon.com/images/I/31XYbBYbPSL._SY300_.jpg", "brand": "Verbatim", "related": {"also_viewed": ["B00BZC31WQ", "B004OBYWD2", "B009KY58FE", "B00DN27IUC", "B000G1D8HU", "B004DI7DFU", "B003N3JFWU", "B008OEHPPM", "B00ESJPSWY", "B009FD55SU", "B002G9J3MO", "B002APDFA0", "B008AGF6WS", "B00DJ7FH7W", "B006428K7I", "B00DN27H58", "B00DN27IIY", "B00ESJS72C", "B008OEHV6U", "B00DN27JDS", "B00GMATFBC", "B00HGQWJS2", "B00DHEMB76", "B00DN27I5W", "B001715BIC", "B00EQ0FECE", "B005T4HT24", "B000Q7V0W4", "B000UY3NR8", "B00EAK9Q3I", "B002NU5O8I", "B000UY4XQI", "B002DW94K0", "B00BTK9LL4", "B00DR8LA6U", "B00704IXEY", "B004OBZ0GU", "B009FD4VRQ", "B009VUJEL6", "B00F8LBQ0E", "B00FG7MZP0", "B00519UZM8", "B008TYJC9E", "B009AELU06", "B007X3VEX4", "B003YT56WG", "B009VDSRJ8", "B00B272TO0", "B00HSCOKWW", "B001MTE32O", "B008AGF696", "B007X3VECU", "B000BDH2Y8", "B000TG4BA0", "B00ADHY0OW", "B0013IQL4C", "B00DR8LA60", "B0035ERKYW"], "bought_together": ["B0096M8VR2"], "buy_after_viewing": ["B00BZC31WQ", "B004OBYWD2", "B009KY58FE", "B008OEHV6U"]}}