{"asin": "B001UQ6E4Y", "related": {"also_bought": ["B008EGQBRI", "157912366X", "1598695444", "0521153972", "B003VKQCQ2", "0521781906", "0448412535", "0547132808", "155407147X", "B0007UQNV8", "1426310145", "0920656668", "054713178X", "0615826717", "B00006LSVL", "B004OUMTT2", "B00008Y0TM", "1931559309", "B006YTQ7B2", "B0000XMWQW", "B00006RH5I", "B0000665V6", "0792259351", "B000HGJJ7W", "B004KMC0UC", "B0000XMUWS", "B000237C9M", "B000BURAP2", "B000NOU54O", "B008M0NDRM", "B0055DZ3EK", "B00CIXVITO", "1426310366", "B00CQHZ12W", "B000EUHKUE", "B000YFSZU8", "0800788036", "B00DQ9RM2Q", "B0009O1J0C"], "bought_together": ["157912366X", "1598695444"], "buy_after_viewing": ["B00I0S77Z0", "B00FM4A108", "157912366X", "B001TI9Y2M"]}, "title": "Celestron 21024 FirstScope Telescope", "price": 49.95, "salesRank": {"Camera &amp; Photo": 312}, "imUrl": "http://ecx.images-amazon.com/images/I/41lAK2twV9L._SY300_.jpg", "brand": "Celestron", "categories": [["Electronics", "Camera & Photo", "Binoculars & Scopes", "Telescopes", "Reflectors"]], "description": "FirstScope Telescope (item #21024)FirstScope Telescope - General FeaturesHigh quality Dobsonian style stand with a 76 mm reflector optical tube make FirstScope an ideal entry level astronomical telescope.Portable and lighweight table-top design makes it easy to store, transport and setup your FirstScope TelescopeFirstScope is very easy to observe with, the user simply navigates the night sky by moving the tube in the direction of their desired object.Stylish and decorative design makes FirstScope a wonderful keepsake for anyone interested in astronomy.DetailsFirstScope pays tribute to the men and women who brought us one step closer to understanding the universe around us!In 1609, world-renowned Italian scientist, Galileo Galilei, introduced an elementary telescope to the growing astronomy community which sparked interest into the mysterious night sky for centuries to come. Four centuries later, Celestron offers the portable FirstScope Telescope. The FirstScope pays tribute to Galileo Galilei and many of history&rsquo;s most notable astronomers and scientists by displaying their names around the optical tube. We honor the contributions of these men and women, who brought us one step closer to understanding the universe around us.The FirstScope is a wonderful keepsake for anyone interested in astronomy. This quality Dobsonian style telescope features a 76 mm aperture reflector optical tube. FirstScope is an ideal entry level astronomical telescope. It is very easy to observe with, the user simply navigates the night sky by moving the tube in the direction of their desired object, making the viewing experience a snap! The compact design makes it easy enough to take with you on your next outdoor adventure. FirstScope is also stylish enough to be a decorative fixture on your bookshelf or desk.SpecsOptical Design:Dobsonian ReflectorAperture:76 mm(2.99 in)Focal Length:300 mm(11.81 in)Focal Ratio:3.95Eyepiece 1:20 mm(0.79 in)Magnification 1:15 xEyepiece 2:4 mm(0.16 in)Magnification 2:75 xWeight:69 oz(1956.12 g)2-year Telescope WarrantyCELESTRON TWO YEAR LIMITED WARRANTYA. Celestron warrants your telescope to be free from defects in materials and workmanship for two years. Celestron will repair or replace such product or part thereof which, upon inspection by Celestron, is found to be defective in materials or workmanship. As a condition to the obligation of Celestron to repair or replace such product, the product must be returned to Celestron together with proof-of-purchase satisfactory to Celestron.B. The Proper Return Authorization Number must be obtained from Celestron in advance of return. Call Celestron at (310) 328-9560 to receive the number to be displayed on the outside of your shipping container.All returns must be accompanied by a written statement setting forth the name, address, and daytime telephone number of the owner, together with a brief description of any claimed defects. Parts or product for which replacement is made shall become the property of Celestron.The customer shall be responsible for all costs of transportation and insurance, both to and from the factory of Celestron, and shall be required to prepay such costs.Celestron shall use reasonable efforts to repair or replace any telescope covered by this warranty within thirty days of receipt. In the event repair or replacement shall require more than thirty days, Celestron shall notify the customer accordingly. Celestron reserves the right to replace any product which has been discontinued from its product line with a new product of comparable value and function.This warranty shall be void and of no force of effect in the event a covered product has been modified in design or function, or subjected to abuse, misuse, mishandling or unauthorized repair. Further, product malfunction or deterioration due to normal wear is not covered by this warranty.CELESTRON DISCLAIMS ANY WARRANTIES, EXPRESS OR IMPLIED, WHETHER OF MERCHANTABILITY OF FITNESS FOR A PARTICULAR USE, EXCEPT AS EXPRESSLY SET FORTH HEREIN. THE SOLE OBLIGATION OF CELESTRON UNDER THIS LIMITED WARRANTY SHALL BE TO REPAIR OR REPLACE THE COVERED PRODUCT, IN ACCORDANCE WITH THE TERMS SET FORTH HEREIN. CELESTRON EXPRESSLY DISCLAIMS ANY LOST PROFITS, GENERAL, SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES WHICH MAY RESULT FROM BREACH OF ANY WARRANTY, OR ARISING OUT OF THE USE OR INABILITY TO USE ANY CELESTRON PRODUCT. ANY WARRANTIES WHICH ARE IMPLIED AND WHICH CANNOT BE DISCLAIMED SHALL BE LIMITED IN DURATION TO A TERM OF TWO YEARS FROM THE DATE OF ORIGINAL RETAIL PURCHASE.Some states do not allow the exclusion or limitation of incidental or consequential damages or limitation on how long an implied warranty lasts, so the above limitations and exclusions may not apply to you.This warranty gives you specific legal rights, and you may also have other rights which vary from state to state.Celestron reserves the right to modify or discontinue, without prior notice to you, any model or style telescope.If warranty problems arise, or if you need assistance in using your telescope contact:CelestronCustomer Service Department2835 Columbia StreetTorrance, CA 90503Tel. (310) 328-9560Fax. (310) 212-5835Monday-Friday 8AM-4PM PSTNOTE: This warranty is valid to U.S.A. and Canadian customers who have purchased this product from an authorized Celestron dealer in the U.S.A. or Canada. Warranty outside the U.S.A. and Canada is valid only to customers who purchased from a Celestron's International Distributor or Authorized Celestron Dealer in the specific country. Please contact them for any warranty service."}