{"asin": "B0012Y6HC8", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]], "description": "For stunning photography with point and shoot ease, look no further than Canon&#x92;s EOS Rebel XSi. The EOS Rebel XSi brings staggering technological innovation to the masses. It features Canon&#x92;s EOS Integrated Cleaning System, Live View Function, a powerful DIGIC III Image Processor, plus a new 12.2-megapixel CMOS sensor and is available in a kit with the new EF-S 18-55mm f/3.5-5.6 IS lens with Optical Image Stabilizer. The EOS Rebel XSi&#x92;s refined, ergonomic design includes a new 3.0-inch LCD monitor, compatibility with SD and SDHC memory cards and new accessories that enhance every aspect of the photographic experience.Canon EOS Rebel XSi HighlightsNew Technology for Outstanding Images12.2-megapixel APS-C Size CMOS sensorNew Canon 12.2-megapixel CMOS sensor and DIGIC III image processorCanon's CMOS (complementary metal oxide semiconductor) sensor captures images with exceptional clarity and tonal range, and offers the most pixels in its class. It offers many of the same new technologies to maximize each pixel's light gathering efficiency that were first seen with the professional EOS-1D Mark III model.  It's an APS-C size sensor (22.2 x 14.8mm), and there's an effective 1.6x increase in the lens&#x92;s marked focal length when attached. Canon&#x92;s DIGIC III Image Processor dramatically enhances image quality and speeds up all camera operations for intuitive operation. It works in concert with the EOS Rebel XSi&#x92;s sensor to achieve unprecedented levels of performance in all lighting situations.14-bit A/D converterWith the EOS Rebel XSi, analog to digital signal conversion is executed by a 14-bit processor, which generates digital data with incredibly smooth tones. Formerly a feature only present in top-of-the-line pro digital SLR cameras, the 14-bit conversion gives incredibly smooth transitions from light to dark colors, with far less risk of \"banding.\" A sky at sunset is a perfect example. With this rich 14-bit gradation the EOS Rebel XSi offers RAW images of the highest quality that can be processed with Canon&#x92;s Digital Photo Professional software. Even JPEG files, which are always finished at 8-bits per channel, use the full 14-bit conversion initially to generate the best possible color and tonal detail. Another huge benefit of the 14-bit conversion is the Highlight Tone Priority option, which allows critical shooters to increase the level of detail in bright areas of a scene up to one stop, without affecting overall exposure.Auto OptimizationThe EOS Rebel XSi&#x92;s Auto Optimization is yet another image-quality tool that comes to the rescue in tricky lighting conditions. It can actually lighten dark areas of a scene while ensuring that bright areas maintain tonal detail.  It's now available in all shooting modes, including P, Tv, Av, and Manual.DIGIC III image processorDeveloped to maximize performance between the capture and recording stages of digital photography, the EOS Rebel XSi&#x92;s latest-generation DIGIC III Image Processor works in concert with Canon&#x92;s CMOS sensor to achieve even higher levels of performance. The entire electronic system is totally redesigned, giving the camera its incredible combination of speed and image quality. Digital noise is significantly reduced in shadow areas, and color reproduction is superior.Speedy, Precise OperationExcellent performance with 3.5 fps continuous shooting, up to 53 full-resolution JPEGs or 6 RAW images in a burstThe EOS Rebel XSi operates with such effortless speed that operation is nothing short of intuitive.  With instant startup times, speedy autofocus and minimal shutter lag, the EOS Rebel XSi is one of the fastest cameras available today.  It can shoot up to 3.5 frames per second, in bursts of 53 JPEGs or 6 RAW files, so you&#x92;ll never, ever, miss a shot.See the image in large LCD with Live View FunctionThe EOS Rebel XSi has a huge, bright 3.0-inch TFT LCD monitor with 230,000 pixels and a viewing angle of 170 degrees. It&#x92;s perfect for Live View composition or viewing camera settings like AF, ISO, Metering, AF Point selection and flash options. And the maximum brightness of the EOS Rebel XSi LCD monitor is about 30-percent greater than its predecessor, which is a big benefit when you're using the camera in bright sunlight.Live View FunctionLive View Function enables you to view your subjects directly on the huge 3.0-inch LCD monitor. It's easy to magnify any part of the scene 5x or 10x for precise manual focus. And now, there are two ways to use Autofocus along with Live View Function in the EOS Rebel XSi. You can even choose a grid overlay, perfect for keeping straight lines in your subject straight in your pictures. In the studio, Live View Function can be used remotely via a computer through the EOS Rebel XSi&#x92;s USB connection.Fast 9-point AF system, and two types of AF during Live View FunctionThe EOS Rebel XSi has a high-precision 9-point wide area AF sensor for fast, accurate focus even in dim lighting. It has a number of focus modes, including One-Shot AF, AI Focus AF, AI Servo AF and Manual.  In Live View Function, the EOS Rebel XSi has two AF modes: Quick mode, which uses the camera's standard 9-point AF system, and Live mode, which is a contrast-based AF system that reads the sharpness of subjects right from the imaging sensor, and can be overridden by pressing the AF mode selection button. A familiar feature in PowerShot cameras, Live mode AF uses similar technologies to achieve focus, while Quick mode is more appropriate for capturing action or for shooting in low light.Compatible with compact SD and SDHC memory cardsThe EOS Rebel XSi is the first EOS Digital SLR camera to use popular SD and SDHC memory cards only.  Compact, inexpensive and available in increasingly large capacities, SD and SDHC memory cards are a perfect complement to the EOS Rebel XSi&#x92;s compact and lightweight body design.Advanced Features for Advanced PhotographyNew advanced features include spot metering, external flash settings on the camera&#x92;s menu, and a new higher-magnification viewfinderThe EOS Rebel XSi&#x92;s 35-zone evaluative metering system with improved white balance analyzes light based on each zone in the viewing area, enabling the camera to choose the overall best exposure for the entire scene. It now features a spot meter, which reads a tiny area (about 4 percent) of the picture for extremely precise metering. It also provides Center-weighted average metering and partial metering for accurate exposure no matter the situation. The EOS Rebel XSi also has an improved, high magnification viewfinder that provides a larger overall view, and increased brightness and clarity. And the EOS Rebel XSi has a Display-Off sensor that automatically turns the LCD monitor off whenever the camera is at the photographer's eye. All relevant shooting information, including ISO, is displayed right in the viewfinder so it&#x92;s easy to change settings without moving the camera away from the eye.EOS Integrated Cleaning SystemPhotographers who must change lenses in dusty environments will find the advanced Canon EOS Integrated Cleaning System a tremendous time saver. Dust that settles on the sensor surface is removed using ultrasonic vibration. This Self Cleaning Sensor Unit routine is automatically activated whenever the camera is powered on or off. (It can also be manually activated.) A special collar positioned around the sensor collects the loosened dust. Dust particles can also be automatically removed via software. By shooting a plain white subject, the photographer can acquire dust position data that is transmitted along with the image (whether JPEG or RAW). Canon Digital Photo Professional (DPP) version 3.3 or later software can be used to manually or automatically erase the dust spots. It's not one feature, it's a built-in system to minimize the effect of dust in high-resolution digital images.Self Cleaning Sensor UnitA key element of minimizing dust is preventing it from clinging to the front surface of the imaging sensor. To combat against this, the EOS Rebel XSi features a Canon-designed Self Cleaning Sensor Unit. The low-pass filter at the front of the sensor shakes off dust automatically with ultrasonic vibrations, removing dust from the sensor assembly. The EOS Rebel XSi has a new coating on the front surface of the low-pass filter, to increase its resistance to dust sticking to the sensor.Dust Delete Data DetectionDust that may still remain on the front of the sensor can also be erased with software included in Digital Photo Professional (DPP) Version 3.3 or later software. A simple test shot of a plain, white object can be taken, using a menu setting. This Dust Delete Data image is analyzed in-camera, and the location and size of any remaining dust is added to any subsequent pictures taken. This data is transmitted along with the image, whether JPEG or RAW, and can be either manually or automatically erased in Canon&#x92;s DPP version 3.3 and later software. This added software option ensures the cleanest possible image, perfect for printing or archiving.Picture Style settingsWith the EOS Rebel XSi&#x92;s Picture Style technology, photographers can change the look of their digital photographs. Color, saturation, sharpness and contrast settings create noticeable variation in the saved image. Changing a Picture Style setting is almost like a 35mm film user switching from one type of color film to another. In addition to six preset Picture Style settings, Canon offers additional downloadable \"Picture Style Files,\" that can be installed into your camera for even more imaging options at your fingertips.Highlight Tone PriorityThis vital Custom Function lets photographers get even better detail in bright highlights, even in contrasty lighting conditions. It&#x92;s beneficial for nearly any type of picture, from mid-day shots on a safari to portraits in sunlight, where a user may encounter bright highlight areas where he or she wants to preserve details.  Finally, there&#x92;s no impact on the camera&#x92;s shooting speed or burst rate when Highlight Tone Priority is engaged. It takes full advantage of the EOS Rebel XSi's new 14-bit per channel conversion, meaning there are 16,384 distinct colors from darkest to lightest in each color channel.Shooting and Sharing Made EasyIncludes EF-S 18-55mm f/3.5-5.6 Image Stabilizer lensThe Canon EF-S 18-55mm f/3.5-5.6 IS zoom lens features the wide-angle to mid-range zoom flexibility of its non-IS predecessor with the significant advantage of Canon's true optical, lens-shift image stabilization system that yields up to a full four stops of image-shake correction.Fully compatible with over 60 EF/EF-S Lenses and a wide range of EOS System accessoriesEOS Rebel XSi is compatible with all Canon lenses in the EF and EF-S lineup, ranging from ultra-wide angle to super telephoto lenses. Canon lenses employ advanced optical expertise and micron-precision engineering to deliver unprecedented performance in all facets of the photographic process. Special optical technologies, such as Aspherical, ultra-low dispersion, or fluorite elements are featured in the universally acclaimed L Series lenses, and Canon's Optical Image Stabilizer technology are featured in select lenses to minimize the effect of camera shake. Through Canon lenses, photographers can truly maximize the quality and liberating performance of the EOS Rebel XSi.Flash PhotographyThe EOS Rebel XSi features the acclaimed E-TTL II flash metering system. With any of the flashes in the EX Speedlite line, E-TTL II provides reliable flash output whether shooting fill-in flash pictures in sunlight, or using flash in total darkness. With E-TTL II, the exact same 35-zone metering sensor used for measuring ambient light is also used for flash metering -- giving even finer metering command of the image area. If you prefer a broader area for flash metering, there's a menu setting to change to \"Average\" flash metering, where the entire 35-zone area is measured evenly for flash exposure.The Canon Speedlite 430EX is the ideal step-up accessory for powerful flash shooting with the EOS Rebel XSi. It has excellent flash power (maximum guide number of 141 ft./43m at ISO 100), and is the perfect way to get great flash pictures when you can't get right up to the subject. The 430EX is also great for bounce flash, with its tilting and swiveling flash head.  It automatically zooms the flash head to cover lenses ranging from 16mm up to 105mm or longer with the EOS Rebel XSi. Of course, it works with the camera to provide full E-TTL II automatic flash exposure. And the 430EX has a powerful AF-assist beam, which allows the camera to autofocus even in total darkness on subjects as far as 32 ft. from the camera.Included SoftwareCanon EOS Digital Solution Disk (Version 17.0)The EOS Rebel XSi comes bundled with an updated Canon EOS Digital Solution Disk, which features powerful software programs designed to extend the EOS experience to the computer. These include Canon's ZoomBrowser EX for Windows (Version 6.1), ImageBrowser for Macintosh OS X (Version 6.1), Digital Photo Professional (Version 3.3), the totally new Picture Style Editor (Version 1.0), Canon&#x92;s EOS Utility (Version 2.2), RAW Image Task (Version 2.8), PhotoStitch, and PTP TWAIN Driver. Each application is designed to perfect the captured images and streamline the digital workflow. ZoomBrowser EX v.6.1 and Digital Photo Professional v.3.3 for Windows are compatible with the new Windows Vista operating system.Digital Photo Professional (Version 3.3)is an image processing program that enables high-speed RAW image processing, high-speed previewing for real-time image adjustment and support for sRGB, Adobe RGB and Wide Gamut RGB color spaces. Because it&#x92;s CMS (Color Management System) compatible, Digital Photo Professional allows for easy image layout and printing in Adobe RGB in conjunction with Easy-PhotoPrint and PictBridge printers. It also features the Dust Delete Data Detection tool for cleaner images.EOS Utility (Version 2.3) for Macintosh or Windowshandles the connection between the camera and computer, whenever they&#x92;re connected via USB. It allows remote controlled shooting from the computer, handles downloading of images from the camera to the computer, and allows seamless linking to either Canon&#x92;s ZoomBrowser/ImageBrowser or Digital Photo Professional software once images have been copied to the hard drive. Furthermore, it&#x92;s used to upload settings back into a USB-connected camera.ZoomBrowser EX (Version 6.1) for Windows and ImageBrowser (Version 6.1) for Mac OS Xare the easy, user-friendly options for viewing and editing of JPEG and even RAW image files. Both allow viewing of numerous types of images including finished TIFF and BMP files. Both also have a variety of search options for finding images, allow re-naming of single images or batches of files, and offer a variety of options for printing without using a separate image-editing program.RAW Image Task (Version 2.8) for Windows/MacintoshThis software is an integrated component of ZoomBrowser EX (Windows) or ImageBrowser (Mac). It allows processing of RAW images from EOS cameras, including the new EOS Rebel XSi, with a variety of adjustment possibilities.  These options, as well as the overall color, contrast and \"look\" of RAW Image Task, closely mimic the characteristics of Canon&#x92;s in-camera JPEG processing.What's in the BoxCanon Rebel XSi camera, EF-S 18-55mm f/3.5-5.6 Image Stabilizer lens, rechargeable battery pack and charger, USB and video cables, a neckstrap, an EOS Solutions Disk CD, and a 1-year Canon U.S.A., Inc. limited warranty", "title": "Canon Digital Rebel XSI 12.2 MP Digital SLR Camera with EF-S 18-55mm f/3.5-5.6 IS Lens (Silver)", "price": 17.12, "salesRank": {"Camera &amp; Photo": 11302}, "imUrl": "http://ecx.images-amazon.com/images/I/51%2BQuA5n7ZL._SX300_.jpg", "related": {"also_viewed": ["B001XURPQS", "B0007QKMQY", "B001XURPQI", "B005LW580O", "B001CBKJGG", "B0007QKN22", "B004J3Y9U6", "B000I1ZWRW", "B0029U0WWU", "B001KAK1LW", "B005Z3DWKW", "B00CCGZ9L0", "B000NVXF26", "B00GDWJTRY", "B004MN00C4", "B005Z3DWIY", "B0029U0WY8", "B004J3V90Y", "B005Z3DWHK", "B000BK39DE", "B004M170YC", "B003MAKXMA", "B0002XQJFA", "B003ZYF3LO", "B00JVZ7TYK", "B0002XQI2E"], "buy_after_viewing": ["B003VNKNF0", "B004J3Y9U6", "B004J3V90Y", "B0039BPG1A"]}}