{"asin": "B00005Q8M0", "description": "Normally, Nintendo contract players such as Mario, Pikachu, Link, Donkey  Kong, Bowser, and Kirby are generally happy and well-mannered, but inSuper  Smash Bros. Melee, the pleasantries get thrown out and the gloves (except  for Mario's) come off. This update of the N64 favorite features these and other  video game icons in furious, yet utterly absurd fisticuffs that usually make for  a smashing good time. Just make sure you have at least one human opponent to  pound on.Starting off with 14 characters (an additional 11 are waiting to be unlocked),  the game has a pretty standard premise--let Nintendo's stars beat on each other  until the timer runs out. However, a lot of emphasis is put on knocking  opponents off ledges while avoiding the same fate. In typical Nintendo manner,  there are quite a few power-ups to assist you in the melee. The actual combat  isn't as intricate as in other fighting games; however, the ultra-cartoony  layout of the many, many arenas sometimes adds a strategic element not usually  found in similar titles.Super Smash Bros. Melee's strength lays in the mayhem created in  four-player fights. The camera does an excellent job of positioning itself so all  combatants are constantly visible. Also,Meleesports some of the best  visuals seen in a Nintendo product. All the characters are highly detailed, and  the movements of each are smoothly infused with personality. Donkey Kong lumbers  and Princess Peach fights with grace.As the multiplayer mode is the key reason for this game's existence, the  single-player mode is decidedly weak. The game features an adventure mode that plays  somewhat like an old-school, side-scrolling Mario game. Sadly, despite its good  looks, its gameplay is rather uninspired. This game is clearly at its best when  there are two or more players with controllers in their hands.--Mark  BrooksPros:Fantastic graphics and sound keep the action upbeatMany new characters and other goodies to unlockCons:Single-player experience is comparatively weakToo cute for a few folksAdventure mode is boring", "price": 119.99, "imUrl": "http://ecx.images-amazon.com/images/I/51JVNG4P1DL._SY300_.jpg", "related": {"also_bought": ["B00012D0SG", "B00005QEFD", "B000ARPXU0", "B00006IJJI", "B00009WAUD", "B0017KIBAI", "B00005QEFF", "B002L8W5V6", "9861019731", "B002L93F0A", "B00095KU5G", "B0000E5U6I", "B000066JRN", "B000A15K0Y", "B000AQA9UA", "B00006IJJK", "B000L9NPGG", "B002FY4AOG", "B00005Q8LR", "B0009UBR3A", "B0000E5U6K", "B0002Y5180", "B0000D9SQ6", "B002C5BMFI", "B00006DY1M", "B000UY2TJG", "B000084318", "B00008H2IS", "B000N1IZOO", "B00006FWTX", "B0002ILS24", "B000B8J7JQ", "B0000A0O28", "B0009XEC0C", "B000UQCER6", "B004CHLNWQ", "B0002ILS1K", "B00009PS24", "B00205DV7C", "B00005BOSF", "B000641ZC2", "B0002A6CQ4", "B002L94TLY", "B00009WAUB", "B000070IWB", "B00006HBTW", "B00006966U", "B000FQ9R4E", "B0002ILS1U", "B00009WAUF", "B00007UHDI", "B000067QW2", "B000090W86", "B0006I5FKQ", "B00005YXRM", "B00005QDPZ", "B0009VXBAQ", "B00AKIVBU0", "B0000A2Y96", "B001AI7CF2", "B000095ZHA", "B005SZ02IM", "B001VB72BC", "B00000J2W7", "B0000E5U6J", "B000EHPQMG", "B00008URUB", "B00006IJJC", "B00005QDQ1", "B00006LU9B", "B00005ULXN", "B0009XSMNA", "B00006JN5O", "B000ARJI88", "B00006LELI", "B00005QEFL", "B00006N5T8", "B000E36OVM", "B00007IRC5", "B000UZPFQ4", "B000ZEX9OU", "B000X37732", "B00433XWFU", "B0000AHOON", "B00009PS22", "B0089NVTDM", "B002L921S2", "B0000E5U6N", "B00008DHLV", "B0009Z3MGA", "B002GCJOC0", "B0001YYNL2", "B00019AZC8", "B00K6Z4SUM", "B00005QEFG", "B00009YEKA", "B0000A03CX", "B000620PSY", "B00006599U"], "bought_together": ["B000ARPXU0", "B00012D0SG"], "buy_after_viewing": ["B000FQ9R4E", "B0017KIBAI", "B000ARPXU0", "B002L8W5V6"]}, "salesRank": {"Video Games": 415}, "categories": [["Video Games", "More Systems", "GameCube", "Games"]]}