{"asin": "B0035FZJHQ", "related": {"also_bought": ["B00CV9MK4W", "B003CVLTCW", "B003VNKNF0", "0470768819", "B0002Y5WZM", "0321733916", "B004VTAVLE", "B00004WCGF", "B00HZUKMRO", "B006Y0YZZ6", "B00CV9M5CY", "B00007E7JU", "B005Y1SYQ2", "B004E64TV2", "B0011NVMO8", "B0083EPC80", "B00BCEJ0E0", "B003Y58IXO", "B00393THEK", "B008H0AGEA", "B003ASSEHU", "B003USYPX2", "B001I3X3HU", "B006FKS8TO", "B003DWXST2", "B0053V5MF4", "B007NUPXTS", "1435457668", "B00005K47X", "B00CV9MKJ2", "B003VNKNEQ", "B0082RT1BM", "B000V7AF8E", "B004KUCHT8", "B003UNRHF0", "B00004ZCJI", "B004UTQRHW", "B0037NZ2MI", "B0058DX862", "B00CAE8PM4", "B007W6WLFW", "B00BAJ9Y2K", "B002GYPS3M", "B0061VIHV6", "B00004THD0", "B00480V3IQ", "B003PBB4ME", "B004JM6FYK", "B008LQVNMO", "B00093ESSI", "B001XURPQS", "B0016ARZ9C", "B004Q3C98S", "B002KLY9I6", "B00006JPD5", "B003Y60DZO", "B0056IY5IE", "B008YL8GLW", "B002VPE1WK", "B007M54E1M", "B00BQ9FY0A", "0470648635", "B0037NX6JY", "B005KP473Q", "B001TZUS98", "B003HLSMNG", "B00B7ID99I", "B003LZ5SM6", "B00HIKBW1G", "B003A281AG", "B000V9D5LG", "B0079U1N00", "B004XIB9T6", "B005EM6G7U", "B003TCF1YG", "B007M54E08", "B0057CPD1M", "B004TJ6JH6", "B00570DFYQ", "B005GMWNY8", "B0037TEO3K", "B0045DMA42", "B001CCAISE", "B00004THCZ", "B0089Q1HCC", "B00009R6TA", "B004ZGLM5W", "B0070WU51U", "B0050BO5WS", "B00B7ID9CU", "B002NEGTT2", "B002P3KY7Y", "B0080JH3YE", "B001D60LG8", "B003JJQMD8", "B0039BPG1A", "B004J3V90Y", "B00009XVCZ"], "bought_together": ["B003VNKNF0"], "buy_after_viewing": ["B003VNKNF0", "B004J3V90Y", "B0053V5MF4", "B004J3Y9U6"]}, "title": "Canon EOS Rebel T2i DSLR Camera with EF-S 18-55mm f/3.5-5.6 IS Lens (OLD MODEL)", "price": 699.99, "salesRank": {"Camera &amp; Photo": 763}, "imUrl": "http://ecx.images-amazon.com/images/I/41QdMAw60lL._SY300_.jpg", "brand": "Canon", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Camera Bundles"]], "description": "The new flagship of the EOS Rebel line, Canon EOS Rebel T2i brings professional EOS features into an easy to use, lightweight digital SLR that's a joy to use. Featuring a class-leading 18.0-megapixel CMOS image sensor and increased light sensitivity for low light photography, the EOS Rebel T2i also has an advanced HD Movie mode for gorgeous Full HD movies. Able to capture up to 3.7 frames per second, it's ready to go the minute it's picked up. Advanced Live View, a new wide-area screen, plus features like Canon's brilliant Auto Lighting Optimizer and Highlight Tone features ensure brilliant photos and movies, easily. With some of the most advanced features of any digital SLR, it's simply the best Rebel Canon has ever created.EOS Rebel T2i Highlights18.0-megapixel CMOS (APS-C) sensor and DIGIC 4 Image ProcessorThe EOS Rebel T2i has an 18.0-megapixel CMOS sensor that captures images with exceptional clarity and tonal range and offers more than enough resolution for big enlargements or crops. This first-class sensor features many of the same new technologies as used by professional Canon cameras to maximize each pixel's light-gathering efficiency. Its APS-C size sensor creates an effective 1.6x field of view (compared to 35mm format).DIGIC 4 Image ProcessorThe Canon DIGIC 4 Image Processor dramatically speeds up the entire EOS Rebel T2i's camera operations for intuitive operation and offers improvements in both fine detail and natural color reproduction. It works in concert with the EOS Rebel T2i's CMOS Image Sensor to achieve phenomenal levels of performance in nearly any situation.Capture stunning shots in low light.ISO 100-6400 (expandable to 12800) for shooting from bright to dim lightThe EOS Rebel T2i features an expanded ISO range that makes shooting possible in situations previously unthinkable without flash. With an ISO rating up to 6400 (expandable to ISO 12800), along with the DIGIC 4 Image Processor's improved noise-reduction technology, creative possibilities abound. Combine the EOS Rebel T2i with one of Canon's EF or EF-S lenses with Optical Image Stabilizer and the shooting possibilities for both movies and stills expand even further.Improved EOS Movie mode with manual exposure controlDesigned for the evolving, tech-savvy user, the EOS Rebel T2i features HD Video capture technologies--manual exposure control for more creative control, for example--borrowed directly from professional Canon SLRs to capture stellar video with all the benefits of shooting with an SLR. By shooting video with the EOS Rebel T2i, photographers as well as filmmakers can take advantage of the creative features native to SLR cameras. Along with its manual controls, the EOS Rebel T2i allows for full use of Canon EF and EF-S lenses, including Macro and Fisheye, providing a plethora of shooting options once reserved only for still photography. The resulting HD video is a standout in its beautiful depth-of-field characteristics and remarkable capture capability under poor lighting conditions. In a first for EOS cameras, a Movie Crop function is included: An SD-quality movie (640 x 480) can be cropped to the equivalent of about 7x magnification of regular shooting.Video can be captured at a number of resolutions and frame rates for numerous applications. It can capture 1920 x 1080 Full HD video at frame rates of 24 (23.976), 25 or 30 (29.97) frames per second, for up to 4GB per clip. Movies are saved as MOV files and can be viewed in Full HD through the EOS Rebel T2i's HDMI output. Other recording sizes include HD at 1280 x 720 (50/60 (59.94) fps) or SD/VGA at 640 x 480 (50/60 (59.94) fps). The EOS Rebel T2i has a built-in microphone for simple mono recording and stereo sound can be recorded through a self-powered external microphone.Enhanced 63-zone, Dual-layer metering system, and 9-point AF systemThe EOS Rebel T2i features Canon's newest Dual-layer sensor, with 63-zones. By measuring not only the amount of light, but also taking into account color and luminosity, this new system delivers a very high level of accuracy for better results every time. Since the metering sensor has a color measurement function, exposure errors and focus errors caused by different light sources are minimized; the EOS Rebel T2i gives stable exposure from shot to shot in situations where light changes, such as sports on a cloudy day, or indoor holiday scenes.Additionally, the EOS Rebel T2i has a high-precision, 9-point AF system utilizing a high-precision, f/2.8 cross-type center point. The 9-point AF system uses both normal and high-precision focus depending on the aperture and available light. The 9 focus points can be chosen automatically or manually selected.Wide 3.0-inch (3:2 aspect ratio) Clear View LCD monitorThe EOS Rebel T2i has a high-resolution 3.0-inch Clear View LCD monitor that features 1.04 million dots/VGA for spectacular detail. It also has the same aspect ratio (3:2) as the camera's sensor, making for clear and easy Live View composition. An anti-reflective and water-repellant coating provides a clearer and more smudge-resistant surface and screen brightness can be adjusted in 7 steps in accordance with ambient light.New Quick Control Screen buttonThe EOS Rebel T2i's refined button layout includes a dedicated button that directs the camera immediately to the Quick Control screen, where it's simple to navigate among any number of settings, including ISO, Exposure and Flash Exposure compensation, drive mode, white balance, image quality and much, much more.Improved layout with dedicated Live View/Movie shooting buttonWithout the need to navigate through a bunch of menus, the EOS Rebel T2i transitions effortlessly between still and movie mode. By pressing the Live View/Movie button, a situation that had required menu access with other cameras, still images can change to a movie shoot and vice versa. It's literally as simple as the press of a button.3.7fps continuous shooting up to approximately 34 JPEGs or approximately 6 RAWThe EOS Rebel T2i can shoot up to 3.7 frames per second (fps) for up to approximately 6 consecutive RAW files or approximately 34 full-resolution JPEGs. Shooting at speeds of up to 1/4000 sec., the EOS Rebel T2i can capture even rapidly-unfolding scenes with ease.New compatibility with SDXC memory cardsThe EOS Rebel T2i is compatible with both SDXC memory cards for greater storage capacity and with Eye-Fi SD cards, which are outfitted with a Wi-Fi transmitter (IEEE 802.11b/g) and internal antenna for wireless, high speed transfer of images. With an Eye-Fi card installed, the EOS Rebel T2i can display the Eye-Fi's connection status and error notes with ease, for fully functional wireless uploading of images directly from the camera.*Canon cameras are not guaranteed to support Eye-Fi card functions, including wireless transfer. In case of an issue with the Eye-Fi card, please consult with the card manufacturer. The use of Eye-Fi cards may not be available outside the United States and Canada, please contact the card manufacturer for territory availability.Compatible with the full line of Canon EF and EF-S lensesEF LensesThe EOS Rebel T2i is compatible with all Canon lenses in the EF lineup, including compact and lightweight EF-S lenses, ranging from ultra-wide angle to super telephoto lenses. Canon lenses employ advanced optical expertise and micron-precision engineering to deliver outstanding performance and deliver beautiful results. Special technologies like the Canon Image Stabilizer technology in select lenses helps to minimize the effect of camera shake, effectively adding up to four stops of light. With a dizzying array of lenses perfect for travel, sports, still life and everything in between, photographers can truly maximize the quality and performance of their EOS Rebel T2i with superlative Canon optics.SoftwareCanon EOS Digital Solution Disk (Version 22.0)The EOS Rebel T2i comes bundled with a Canon EOS Digital Solution Disk, which features powerful software programs designed to extend the EOS experience to the computer. These include Canon's EOS Utility (Version 2.8.0), Digital Photo Professional (Version 3.8.0), ZoomBrowser EX for Windows (Version 6.5.0), ImageBrowser for Macintosh OS X (Version 6.5.0), the Picture Style Editor (Version 1.7.0), MovieEdit Task (Win/Mac, Version 3.4.1) PhotoStitch (Windows Version 3.1.22/Mac Version 3.2.4), Memory Card Utility (Windows Version 1.3.0/Mac Version 1.2.3), WFT Utility (Win/Mac, Version 3.5.1), and Original Data Security Tools 1.8.0 (Win). Each application is designed to perfect the captured images and streamline the digital workflow.Compatible Operating SystemWindows: Windows XP SP2 or SP3 / Windows Vista (all version except the Starter Edition) / Windows 7 32-bit and 64-bit versions. Macintosh: OS X 10.4 to 10.5EOS Utility (Version 2.8.0)for Macintosh or Windows handles the connection between the camera and computer whenever they're connected via USB. It allows remote controlled shooting from the computer, handles downloading of images from the camera to the computer, and allows seamless linking to either Canon's ZoomBrowser EX/ImageBrowser or Digital Photo Professional software once images have been copied to the hard drive. Furthermore, it's used to upload settings back into a USB-connected camera.Digital Photo Professional (Win/Mac, Version 3.8.0)is an image processing program that enables high-speed RAW image processing, high-speed previewing for real-time image adjustment and support for sRGB, Adobe RGB and Wide Gamut RGB color spaces. Because it's CMS (Color Management System) compatible, Digital Photo Professional allows for easy image layout and printing in Adobe RGB in conjunction with Easy-PhotoPrint and PictBridge printers. It also features the Dust Delete Data Detection tool for cleaner images.Picture Style Editor (Win/Mac, Version 1.7.0)Canon's Picture Style Editor enables you to create custom Picture Style profiles that can be used to customize the appearance of JPEG and RAW images captured with EOS Digital SLR cameras. Picture Style files created with Picture Style Editor can be loaded into the EOS cameras that support Picture Style and may also be used when processing RAW images in Canon software applications Digital Photo Professional, ZoomBrowser EX (for Windows) and ImageBrowser (for Mac).ZoomBrowser EX (Version 6.5.0)for Windows and ImageBrowser (Version 6.5.0) for Mac OS X are the easy, user-friendly options for viewing and editing of JPEG and even RAW image files. Both allow viewing of numerous types of images including finished TIFF and BMP files. Both also have a variety of search options for finding images, allow re-naming of single images or batches of files, and offer a variety of options for printing without using a separate image-editing program.What's in the BoxEOS Rebel T2i BodyEF-S 18-55mm f/3.5-5.6 IS LensEyecup Ef (Not shown)Wide Strap EW-100DBIIIUSB Interface Cable IFC-130UAV Cable AVC-DC400STBattery Pack LP-E8Battery Charger LC-E8EOS Digital Solution Disk and Instruction Manuals\"Great Photography is Easy\" Booklet and \"Do More with Macro\" Booklet (not shown)"}