{"asin": "B005JT8OT6", "related": {"also_bought": ["B005N6ZAT2", "B004QVPGXK", "B003UCESP8", "B000ULAP4U", "B004I6HOQA", "B00009MJKC", "B005HJWWW8", "B00HVLUR86", "B008EKON56", "B00BF6IKL4", "B0018MI5F6", "B003UCC78I", "B009NE7B06", "B009A7BP3U", "B005EV38AE", "B0042A8CW2", "B00B6QXWIY", "B000EHCYBC", "B0001ARCFA", "B004LGNB0A", "B00B0FR2QO", "B004QVNS0S", "B00001P4XH", "B006Y3IDX8", "B0022ZN7OC", "B000EIWCFE", "B007GC4L7S", "B003X1BEKI", "B0002SDAIY", "B00IIJ6W4S", "B000WJEORY", "B009EEGVY2", "B0053KWDES", "B00GCDJBMM", "B00E9O6C96", "B001TKTHFY", "B00474YRE0", "B0093PVTPS", "B000R2PC2M", "B009UEBQIM", "B004LTEUDO", "B005HTZJBY", "B004FEEY9A", "B00GTGETFG", "B008R4PR86", "B00475K64E", "B000067RC4", "B00001P4ZH", "B001UE6I0G", "B004LUJGSW", "B0070UFMOW", "B004MMEI8W", "B009QZH7BU", "B005DK08X6", "B00CEB5QU2", "B002HJ9PTO", "B00029MTMQ", "B001NAUAXI", "B00DVH62J2", "B000AJIF4E", "B0049P6OTI", "B00006BBAB", "B004TJ6JH6"], "bought_together": ["B005N6ZAT2"], "buy_after_viewing": ["B005HJWWW8", "B004QVPGXK", "B0053KWDES", "B005N6ZAT2"]}, "title": "FiiO E6 Headphone Amplifier with Micca Y Cable", "price": 28.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41jus3N%2BvKL._SY300_.jpg", "brand": "Fiio", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphone Accessories", "Amps"]], "description": "FiiO E6 is a Portable Headphone Amplifier designed to improve the sound quality and volume of any portable audio source such as MP3 players, iPods, personal media players, mobile phones, laptops, notebooks/netbooks, or portable CD players. It is an upgraded model of the popular E5 Headphone amplifier. The E6 retains all of the advantages of the E5 while adding new features and a substantial boost in performance, all inside a very small and stylish case. With built-in volume controls, the E6 can be used with the line-level output of audio sources for even better sound quality.Compared with the E5, the E6 offers higher gain, additional bass boost levels, input sensitivity adjustment to handle \"hot\" source signals, and a lock switch to prevent unintended button presses. As a result, the E6 provides superior sound qualilty and works even better with high impedance headphones. Three EQ profiles are available for flat and two bass-boost levels, allowing additional flexibility in obtaining optimal tonal match with different headphones.Key Features and Benefits- Robust design handles high impedance and low sensitivity headphones- Easy to carry and use both indoors and outdoors- Increases music player's battery life- Enhanced amplifier design with high S/N and low distortion- Very high PSRR for superior supply noise rejection- Electronic volume control for ultra low noise- Three EQ profiles: flat, bass boost 1, and bass boost 2- Built-in rechargeable battery provides up to 10 hours of normal use- Mini USB charger port can be used with any USB power source- Replaceable clip attaches to clothing, bags, and etcSpecifications- Output Power: 150mW (16Ohm), 16mW (300Ohm)- SNR: >=95dB (A weighted)- Distortion: <0.009%(10mW)- FR: 10Hz ~ 100kHz- Impedance: 16Ohm ~ 300Ohm- Battery: LiPo- Play time: 10hr- Size: 41mmx40.2mmx9mm- Weight: 16g"}