{"asin": "B0001ADAME", "description": "Drawing inspiration from Sergio Leone's classic spaghetti westerns and Clint Eastwood's hard-boiled, serape-clad performances, Red Dead Revolver stands tall with a conceptual basis that the video game industry has not vested a lot of interest in, yet many have yearned for. There are few things sweeter in this world than getting the opportunity to step into the boots of the pale rider and the quickest gun in the west. This is essentially what Red Dead Revolver offers.All of the staples that we've come to recognize from films of this ilk (even the horse operas) are included in some fashion. You'll ride horseback and leap onto a runaway train, exchange fisticuffs in a bar brawl, and stare death in the eye in a high noon showdown. Thematically, developer Rockstar San Diego has hit the nail right on the head. You really do feel like the toughest cowboy to ever step foot in the west. Grainy graphical filters and era-specific camera effects are also used to make the cutscenes feel like the films that this game pays tribute to. Continuing its streak of wowing gamers with brilliant soundtracks that perfectly accompany the atmosphere of the game, Rockstar has decked this game out with an incredible selection of songs reminiscent of spaghetti western master Ennio Morricone.While it sounds like the perfect game up until this point, Red Dead Revolver has a hobble in its strut when it comes to the delivery of gameplay. Granted, you will find yourself smiling wryly at the outrageous missions and scenarios that you'll get yourself into, but you never really feel like you have your feet firmly under you. Each mission comes and goes at such a rapid pace that I will go out on a limb and say that the game doesn't necessarily have levels, but moreover pockets of intense action. In this regard, it's all about the big moment and payoff. Exploration is limited and the environments are usually fairly small. The same goes for the delivery of playable characters. You'll spend most of your time as Red, but will control five other characters throughout your quest. Each one has a different attack and Bullet Time-esque special move. Again, however, you play as this character for 30 seconds to a minute, then move on. I just never really felt a connection with the characters or their surroundings.As you would expect, the majority of gameplay is dedicated to running around and blowing vermin to kingdom come. The execution of this is commendable, and is very much in line with the Max Paynes of the world. Although just split-screen, multiplayer is surprisingly addictive and loaded to the hilt with extras that players can unlock throughout the game with cash earned along the way.I really enjoyed the time I spent with this title, yet walked away wishing that it had a little bit more meat on its bones. If you find satisfaction in mindless action games in the tradition of Max Payne, you'll surely get your fill with Red Dead Revolver.The EdgeThe Xbox version puts a bullet right between the eyes of the PlayStation 2. Not only does it run at 60Hz (twice the framerate of the PS2), it features 480p widescreen, twice the sound memory (on the PS2 you'll hear up to three ricochet sounds, whereas on Xbox you'll hear upwards of six to nine), and double the texture resolution. With hard drive caching the game loads twice as fast, as well. As if the technical edge wasn't enough of a reason to invest in the Xbox version, it's also Live Aware, and comes packaged with an exclusive multiplayer level (the Coliseum). Without the slightest hint of doubt, the Xbox version gets The Edge.Concept:Clean up the west as a merciless cowboy in this heavily influenced spaghetti western gameGraphics:The character models are not the most detailed, but the environments look nice and I love the cameraworkSound:A remarkable soundtrack lures players into the vibe of the westPlayability:Unnaturally short levels and satisfactory run and gun actionEntertainment:The stages should have been longer, but replay is abundant in the number of unlockables and enjoyableReplay:ModerateRated:8 out of 10Editor:Andrew ReinerIssue:June 20042nd Opinion:Buck up, cowpokes. All y'all cowboys that been hankerin' for a good ole fashioned western, you best get ready to draw. Red Dead Revolver is without a doubt one of the finest titles to tap the often barren landscape of old west games. With a straight flush of soaring production values, the game offers a completely immersive gallop through the sights and sounds of an old cowboy flick. Chapters are short and fast paced, with a remarkable variety of challenges. Anything you've ever seen in a western movie you'll see here, from the duel at high noon to the high speed train robbery to the sleazy saloon girls. You are constantly unlocking new game features, which helps to drive the action forward. Combat is definitely more stylistic than it is technically perfect. The gun targeting system is generally well implemented, but frustrating at times &#8211; particularly with fast moving opponents. But if the old west strikes your fancy, I reckon you'd be a coot not to pony up the cash and take a shot at Red Dead Revolver.Rated:8.5 out of 10Editor:Matt MillerSubscribe to Game Informer--Game Informer Review", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51J2CCX1TTL._SY300_.jpg", "related": {"also_bought": ["B0009Z3HYW", "B0000A8VBZ", "B0009SQF0C", "B000GVYYFK", "B0009351R0", "B0009EHQVI", "B00020LZAW", "B0033T1UWW", "B00005OLX1", "B000NIJ35W", "B000930DLO", "B0002XL3BA", "B000B69E9G", "B0000A92KX", "B000KCX9M4", "B000YYR3D4", "B0008GJRRS", "B000G6SPHI", "9629971372", "B000NGWFX6", "B001MW91IW", "B0001I9YGC", "B00005O0I2", "B00008DHNL", "B0009I6S0O", "B000GPVUQ2", "B000UH6GEM", "B000G7YX14", "B00009ZVHY", "B000TLU67W", "B000EHQDA0", "B0001AVZ5I", "B00004YRQA", "B0009O7HVM", "B001CLG6SG", "B00JA81WQE", "B0000696CZ", "B0000TSRA6", "B000F0GX8I", "B000G79YNQ", "B0000A0MDV", "B00004U5VK", "B001RTCOWA", "B0009VQANG", "B000277J00", "B00006Z7HU", "B0009Z3HXI", "B0002IQC70", "B0007PLKZM", "B00005J536", "B000QAVV70", "B00020BV2E", "B0000A03AG", "B0002CNUN0", "B00005UNWB", "B002I0H0SA", "B000930DOQ", "B0009A4EVM", "B00005NCCR", "B004S3KB6S", "B00004YRQ9", "B00005BIG7", "B00097CYZS", "B0007SL1ZI", "B001AZFSEM", "B000A32O4W", "B00005NN5J", "B0002RQ3ES", "B0002CHIUQ", "B0001VGFK2", "B000N0WBL8", "B0000B0MNH", "B00020LZAM", "B000066TS5", "B0000690Z9", "B00019HNNM", "B000HKKPZ8", "B0002IQCSY", "B00009WAVB", "B00005R5PO", "B00006LELA", "B00009WAVI", "B003OPX7K8", "B000Q6CZYM", "B002BWS5QG", "B0032GTMEE", "B000066JRQ", "B00020LZBG", "B000067DPL", "B001AWDG44", "B00005ME8S", "B00011V8EA", "B001SGZL2W", "B004918C4M", "B0015ACX3Q", "B0007ULFL6", "B0000B0MNC", "B00005NUIZ", "B000QB059Y", "B0007OGDIC"], "bought_together": ["B0009Z3HYW"], "buy_after_viewing": ["B0009SQF0C", "B000TLU67W", "B000KCX9M4", "B000EHQDA0"]}, "salesRank": {"Video Games": 4859}, "categories": [["Video Games", "More Systems", "PlayStation 2", "Games"]]}