{"asin": "B00125KR1E", "categories": [["Electronics", "Computers & Accessories", "Webcams"]], "description": "Compare All TrendNet SecurView Internet CamerasTRENDnet SecurView Wireless Internet Surveillance Camera TV-IP110W transmits real-time high quality video over the Internet. View your camera from any Internet connection. Complimentary SecurView camera management software provides advanced monitoring of up to 16 cameras to protect what you value most.This stylish and compact Internet camera provides crystal clear MJPEG video streams.Mount the wireless camera on most surfaces with an included mounting kit. Intuitive software features motion detection recording, email alerts*, and scheduled recordings. The camera&rsquo;s brilliant image quality, intuitive setup and complimentary software make it ideal for your home or office.* Does not support SSL** 32-bit only. &nbsp;Monitoring multiple cameras will require a high performance CPU and graphics cardNetworking SolutionKey FeaturesQuick Plug and Play installationSupports TCP/IP networking, SMTP Email*, and HTTPHigh quality MJPEG video recording with up to 30 frames per secondRecord streaming video to your computerCompatible with wireless g and b devicesAdvanced encryption mode include WEP, WPA-PSK(TKIP), WPA2-PSKSupports still image snapshot to FTP or Email*Motion detection with Email notification*Control two adjustable motion detection windows with just-in-time snapshotSupports time stamp overlayFree SecurView&trade; software: view and record up to 16 cameras simultaneously **3-year warranty* Does not support SSL** 32-bit only. &nbsp;Monitoring multiple cameras will require a high performance CPU and graphics cardWhat's in the BoxTV-IP110W, CD-ROM  (Utility &amp; User's Guide), Multi-Language Quick Installation Guide, 1.8 m/5.9 ft. Cat. 5 Ethernet Cable, Power Adapter (12V, 1.5A)Warranty3-year limited warrantyFull SpecificationsImage SensorSensor1/4&rdquo; Color CMOS SensorResolution640 x 480 PixelFixed Lensf: 4.6mm, F: 2.6 (Board Lens)Viewing Angle60 DegreeMinimum Illumination0.5LuxVideo/Image SettingVideo FormatMJPEGImage Frame Rate30fps @VGA, QVGA, QQVGAFrame Rate Setting1 ~ 30fpsZoom3 x Digital ZoomCompression Ratio Setting5 LevelsResolution640 x 480, 320 x 240, 160 x 120Exposure Control, White Balance, Gain ControlAutomaticImage SettingAdjustable Brightness, Contrast, SaturationFlip ImagesVertical/HorizontalLight Frequency50Hz, 60Hz or OutdoorCommunicationLAN10/100Mbps Auto MDIXProtocolHTTP, FTP, TCP/IP, UDP, ICMP, DHCP, NTP, DNS, DDNS, SMTP, PPPoE, UPnPWirelessStandardIEEE802.11b/gSecurity64/128bit WEP (HEX/ASCII),WPA-PSK(TKIP/AES), WPA2-PSK (TKIP/AES)Antenna2dBi detachable Reverse SMA Connector&nbsp;Hardware SpecificationsSystemCPUARM9 baseRAM16Mbyte SDRAMROM4Mbyte NOR FlashOSLinuxSystem Requirement (Web Configuration)CPU350MHz or aboveMemory256MB RAM or above512MB RAM or above (Windows Vista)Resolution800 x 600 or aboveBrowserInternet Explorer 6.0 or aboveSupported OSWindows 7, Vista, XP, 2000System Requirement (SecurView&trade;Software)CPUPentium 4 1GHz or aboveMemory512MB or aboveResolution1024 X 768 or aboveSupported OSWindows 7 (32-bit), Vista (32-bit), XP (32-bit), 2000Physical /EnvironmentDimension70 x 100 x 57mm (2.67 x 3.94 x 2.95 in.)WeightCamera: 125g (4.4oz.)Stand: 135g (4.76oz.)Power5VDC, 2.5A External Power AdapterPower Consumption6 Watts (Max)LEDsPower (Orange), Link (Green)LED Enable/Disable SupportTemperatureOperation: 0&ordm;C ~45&ordm;C (32&ordm;F ~ 113&ordm;F)Storage : -15&ordm;C ~ 60&ordm;C (14&ordm;F ~ 140&ordm;F)&nbsp;&nbsp;Compare All TrendNet SecurView Internet Cameras", "title": "TRENDnet SecurView Wireless Internet Surveillance Camera TV-IP110W (Silver)", "price": 62.99, "imUrl": "http://ecx.images-amazon.com/images/I/41qGg4UamHL._SY300_.jpg", "brand": "TRENDnet", "related": {"also_viewed": ["B007FGH7FS", "B009UOLJ20", "B004UBSHQO", "B0010OXEDU", "B007FGH6WM", "B009SUUEO0", "B007FGH6Y0", "B00I3GKMOC", "B002OHDFOA", "B007FGH79O", "B007FGH7DK", "B007FGH78A", "B007FGH6YU", "B007FGH7AI", "B00452V66G", "B00I3GKM06", "B00CL8FA4A", "B00C9KOWA8", "B0018DJF4K", "B007FGH76W", "B004P8K24W", "B002ADV6QM", "B00FB69DSS", "B00HXAV36A", "B006ZP8UOW", "B00539KLSY", "B00F3KWZW8", "B00J4I6VZW", "B007FGH708", "B0046710G6", "B003X9IOB2", "B00I3GKMC4", "B000WHEA3E", "B0092KZ9AA", "B001IBFSJ8", "B006G8HSGO", "B00BIX0ZSA", "B00CR0JAT8", "B00F5CTTAU", "B00DV84FYA", "B00H8OE9V2", "B0006JO0X8", "B00724H73U", "B009JOXXJS", "B00GR9JI06", "B006I0KL6Y", "B00CL8F98W", "B003CFATT2", "B002ADO42K", "B00ELF8NJK", "B0061MU0A6", "B000RZUUWG", "B004T9Y0MW", "B00466X9SY", "B00FWD090Q", "B00AYO96I4", "B002OB4A0O", "B00EL6YJME"], "buy_after_viewing": ["B006ZP8UOW", "B004P8K24W", "B007FGH7FS", "B009UOLJ20"]}}