{"asin": "B001FVLTNA", "description": "The Earthmate PN-40 is a high-sensitivity, high-performance, bright-color-screen handheld GPS that offers an unrivaled selection of display options including up-to-date DeLorme Topo USA topographic maps, color aerial imagery, USGS 7.5-min. topographic quad maps, and NOAA nautical charts.The Earthmate PN-40 is a high-sensitivity, high-performance, bright-color-screen handheld GPS that offers an unrivaled selection of display options.Aerial Imagery in the Palm of Your HandSerious PerformanceNew--Blazing-fast, high-sensitivity 32-channel STMicroelectronics Cartesio chipsetNew--Dual-core processor for instantaneous map and satellite imagery redraws, even with large aerial imagery files and multiple maps layers360&iexcl; raster rotation sets the PN-40 apart from other common GPS handhelds. With 360&iexcl; rotation road, building, and other images really are on your left or right as you look at the map and walk, bike or driveNew--3-axis electronic compass with included accelorometer performs when held in any position&Ntilde;while in motion or standing stillNew--Sensitive barometric altimeter for reliably accurate altitude readingsWAAS-enabled for accuracy within 3 metersNew--Now supports SDHC high-capacity SD cards (up to 32 GB) for fast and direct map transfer from the included maps discsSerious MapsIncluded. Comes with three discs containing detailed hybrid topographic and street maps of the entire USA. You do not need anything else to hike, geocache, or navigate the backcountry. It's all in the box.Also Included: Sample Certificate. A $40 certificate is included for downloading sample supplementary datasets. Take a \"test drive\" with any of the supplementary datasets DeLorme offers: high-resolution aerial imagery, USGS 7.5-Minute Quad Map, NOAA Nautical Charts, and more..And for Only $29.95! Then, once you're convinced, subscribe to the NEW DeLorme Map Library for only $29.95 per year. Get all the USGS Quads, NOAA nautical charts and high-resolution color aerial imagery to layer WITH your topo and street maps for only $29.95! No hidden charges.Serious ToughThe PN-40 is waterproof to the IEC 529 IPX7 standardDesigned to function in high-humidity environments, including consistent humidity levels over 90%, and in the rainThe PN-40 has been rigorously tested to function in high-vibration conditions such as off-road drivingOperating temperature range for the PN-40 is -20 degrees C to +75 degrees C. The PN-40 should function in extreme cold as well as rapidly-changing temperature environmentsSerious ValueNo one else offers COMPLETE U.S. hybrid, routable Topographic and Street maps WITH your initial purchaseIn addition, for the extremely low price of $29.95 annually, subscribe to the DeLorme Map Library of downloads for all the USGS 7.5-minute Quads, NOAA nautical charts, and Hi-Resolution Aerial Imagery you want. All downloads are accessed through the convenient NetLink tab of your DeLorme softwareSerious Quality, Service &amp; SupportAnd as if the PN-40, Included Topo and Detailed Street Map and the huge values of the MapLibrary Subscription were not enough, you get serious DeLorme quality:Renowned DeLorme-Quality MapsQuality Geospatial EngineeringQuality Hardware EngineeringQuality U.S.-Based Customer ServiceQuality U.S.-Based Technical Support and Open Online GPS User FormsWhat Else Should I Know?High-Performance TechnologyFeatures STMicroelectronics Cartesio chipset and updated DeLorme firmware for amazing signal acquisition and retention, map scrolling and redraw--even with multiple layers of imagery, topo and street maps.Multiple Views of the Same GPS LocationOn-device data layering lets you select which map or imagery type to see of your GPS location. Switch among data types to gain a comprehensive view of where you are--it's revolutionary and provides a whole new level of geographic detail.Bright Color ScreenWorks in bright sunlight to total darkness. Sharp&uml; brand screen featuring the latest transflective screen technologies to maximize visibility under a variety of lighting conditions.Rugged and WaterproofConforms to IPX-7 waterproof standard with impact-resistant rubberized housing for a solid grip. Concealed battery compartment with SD card slot. Includes two AA batteries.Easy Exchange of Maps, Tracks, and WaypointsExchange routes, tracks and waypoints between the GPS and Topo USA (two-way transfers).Extensive On-Device Memory1-GB of internal flash memory available in addition to the pre-loaded world base map. Holds up to ten tracks (10,000 points per track); 1,000 user-defined waypoints; and 50 routes. SD slot also available.Comes with three discs containing detailed hybrid 1:100k topographic and street maps of the entire USA. You do not need anything else to hike, geocache, or navigate the backcountry. It's all in the box.Complete Detailed U.S. Street and Topographic Maps IncludedDetailed U.S. Street &amp; Topographic MapsCut &amp; transfer custom map packages of the exact coverage you wantDetailed vector-based maps created from the USGS topographic data &amp; the latest DeLorme U.S. street &amp; trail networkU.S. land cover including bodies of water, wetlands, forests, mountains, glaciers, grasslands, rock cover &amp; moreContour lines with elevation numbersFully routable when combined with the corresponding Regional Highway mapBy default, saved map packages include data zoom levels 8-17 (which translates to a scale of 4 miles through 40 ft). Saved maps display all roads, land cover, and contoursThe DeLorme World Base Reference MapPreloaded on the Earthmate GPS PN seriesHigh-level map includes country borders, highways &amp; major roadsDisplays interstates and major highways at scales of 500 miles to 8 milesCreated by DeLorme's staff of professional cartographersSample Map Library DownloadsEach purchase comes with a Certificate for $40 worth of FREE Supplementary Data DownloadsWhat's in the BoxEarthmate GPS PN-40 handheld GPS Receiver With Pre-Loaded Worldwide Highway and Major Road Basemap, DeLorme PN-40 Edition Topo USA 8 Software, Certificate for $40 Worth of Sample Supplementary Data Downloads, USB Data-Transfer Cable, Neck Lanyard, 2 AA Batteries, Getting Started Guide, Owners' Manual", "title": "DeLorme Earthmate PN-40 Waterproof Hiking GPS", "price": 169.85, "imUrl": "http://ecx.images-amazon.com/images/I/41HdgVWIVlL._SY300_.jpg", "related": {"also_viewed": ["B00313JX4W", "B00313JX56", "B000CSOXTO", "B0031QNPAC", "B002G1YPIO", "B003IHV6XW", "B003IHV6YG", "B00542NV32", "B00542NVDW", "B003CYKYVQ", "B006ZGB58Y", "B004JU0E2G", "B003IHV6Z0", "B0029LDDPM", "B002G1YPIE", "B0029LL5IY", "B003Y5H17I", "B00AXUXRUC", "B0055NQWZO", "B00542NVS2", "B00BX7TJ2O", "B000PDV0CE", "B002QBSYOA", "B0055NQXB2", "B0062NEHOO", "B00128HHZA", "B003XU78OU", "B00HWL9AR4", "B00AXUXRSE", "B00HWL9BQ4", "B00AXUXRVG", "B000PDR1LS", "B007QS4YG0", "B00B2F4O86", "B002EOSQII", "B001690VC6", "B00AXUXRSO", "B0050SNCN4", "B004XJER3U", "B003XU78PE", "B000VRFXC2", "B000BGVYYE", "B000064184", "B000PDR230", "B007QS4YFG", "B000OEZSXQ", "B00FMUYZ0E", "B003I86PJG", "B000CSWHCY"], "buy_after_viewing": ["B00542NVDW", "B003IHV6Z0", "B00313JX4W", "B00313JX56"]}, "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]]}