{"asin": "B00HFFDDLG", "categories": [["Electronics", "Home Audio", "Stereo Components", "Speakers", "Bookshelf Speakers"]], "description": "Don't let Mother Nature spoil your plans! Enjoy your music for hours in any setting.Listen to up to six hours of sound using Bluetooth and 10 hours with a wired connection even in difficult and harsh environments-like some of the best parties!Crank it up for maximum enjoyment! Fill rooms with solid sound.Although small, this Remix5 Bluetooth speaker delivers enough punch to fill most medium-sized rooms.We've made using this speaker as easy as pie. NFC greatly simplifies and speeds up pairing.Near Field Communication (NFC) gives you the power to \"one-touch\" pair your speaker with your Bluetooth devices. Your music is important--not fussing with setup!Set it down, pair it up, hit play and walk away. Rugged construction guards your speaker.Built-In protection against splashes, dust and drops gives you peace of mind no matter where you're at. Enjoy your music with no worries.WeCare at BrightechAt Brightech, we stand behind all our products 100%. That's why we offer an industry leading 5-year satisfaction guarantee on all of our Bluetooth speakers. If for any reason you are not completely satisfied with your order, please contact us via email and you're done!", "title": "Brightech Remix5&trade; - Ultra Rugged Design - Water-Resistant and Shockproof Bluetooth Speaker with NFC Tap &amp; Play Technology - Now You Can Take Great Music Anywhere! - Perfect for Outdoor Events", "price": 29.95, "salesRank": {"Electronics": 9711}, "imUrl": "http://ecx.images-amazon.com/images/I/51sp4n6AWTL._SY300_.jpg", "related": {"also_viewed": ["B00K589F8A", "B00KYMCJF8", "B00G9EWBAI", "B00JF0D8SC", "B00JF0D7RE", "B00HWT08ZO", "B00IQ92L4K", "B00GMTN96U", "B00JF0D8AK", "B00BQO56Z8", "B00KOW7PFC", "B00IWHBXTK", "B00CHU6EWO", "B00IWFHS3W", "B00E4L1EJW", "B00E4L1EX8", "B00E3F4XHY", "B00J3L8RA2", "B00J5Z4VCO", "B00L3ZQ0KA", "B00KLZTV6S", "B008MG5V80", "B00FQCOXJG", "B00IKKQKWE", "B00DQGCSBE", "B00JE8GV6G", "B00GYFGCOI", "B00IRFGKK4", "B00IKN2W3M", "B00FWMZY9S", "B00B71FJU2", "B00KOW7PAW", "B00JGGQ10W", "B00L5UBOZO", "B00J5DGDCM", "B00JF0D6Q6", "B005D91G38", "B00JUOS87E", "B00E3F4WUM", "B00HWSXXKC", "B00HIUL1JO", "B00E3F4XGU", "B00I3L4518", "B00HU5L13I", "B00HRI3J3I", "B00F51C6S8", "B00E3F4XLA", "B00L3599SA", "B00J8EUG3K", "B00JTR18OC", "B00KLUKGJE", "B00K303NYM", "B00CSDMWGW", "B00G625GE6", "B00IWHBXSQ", "B00HFFBPO8", "B00GZC35YK", "B00KHH20HW", "B00K0VLADU", "B008JGR9MO"], "buy_after_viewing": ["B00K589F8A", "B00KYMCJF8", "B00JF0D8SC", "B00G9EWBAI"]}}