{"asin": "B000TKHGL2", "description": "Logitech is touting an advancement in comfort and usability design with its ergonomic, cross-platform Cordless Wave keyboard. There might be some marketing hyperbole to this claim, but after a week of typing with the Wave, I'm not sure that I could live without it. (This Cordless Desktop Wave also includes the ambidextrous LX8 scroller laser mouse.)Like other ergonomic keyboards, the Wave includes an elevated palm rest, though not as extreme as the platforms of old. It's also covered in a lightly padded vinyl upholstery that feels soft yet firm under the wrist, as well as a Goldilocks amount of tackiness (i.e., not too slippery, not sticky, just right). The keys are also positioned in a gentle U-shaped arc that nearly escapes the eye, but is apparent once you set your wrists down and start typing.Contoured, wave-shaped key design conforms naturally to your fingers.But the biggest design innovation that the Wave introduces comes from its name--the keys undulate across the board in a wave-shaped contour that mimics the changing lengths in your own digits. The keys are at their highest on the outside at the A and Enter keys (which, if you're a touch typist, is where your little fingers are positioned), and the keys trough to their lowest point at D and K (where the longer middle finger resides) before rising slightly at the G and H keys. The keys have a maximum distance variation of 4mm, and the spacebar mimics the wave contour of the keyboard design.As someone who writes for a living, my computer keyboard is one of the most important tools I have and one that I'm connected to for hours every day. I've gone through many models over the years to get just the right one, and I currently use theMatias Tactile Proon my Mac as it provides some of the best keystroke feedback I've found (which is the polar opposite to the frustratingly squishy keyboards that came with my HP and Apple PCs).While the rolling contour of the keyboard layout was barely perceptible, my fingertips took to the Wave easily. It felt like each key was indeed designed specifically to fit the finger that was mapped to tap it. And the keys combine a springy action with a final tap that's not too loud, but both tactile and audible enough for instant feedback. As my week of testing progressed and my fingers grew more accustomed to the Wave, I actually felt as if my typing was both more accurate than on the Tactile Pro as well as a touch faster.From an ergonomic standpoint, the Wave's gradual curve isn't immediately noticeable, but after a few days I found my elbows weren't hunched next to my body as they were with the straight keyboard, freeing both wrists and shoulders from strain. That said, if you require more substantial ergonomics for your typing (such as the curve and height of the Microsoft Natural), you might be disappointed by the relative flatness of the Wave.The Delete key has been elongated and the Insert/Help key moved above..The Wave has a fairly standard extended keyboard design, with one change that I cheered but could easily be jeered by others. The Home/Delete/End/Page Up & Down keys is switched to a vertical orientation, and the bane of my typing life--the Insert key (also the Help key on the Mac), which I often hit mistakenly when hunting for the Delete key--has been moved up (moving into the Scroll Lock key position) and replaced by an elongated Delete key. Another handy feature is onscreen notification of when you hit the Caps Lock key (another one of my touch typing transgressions).The keyboard is supplemented by a plethora of system-specific feature buttons--including Flip 3D, Gadgets and Media Center in Windows Vista (aka, Expose, Dashboard, and Front Row on the Mac)--as well as quick access to your selected audio program and full playback controls (including volume). All functions can be customized using the included Logitech Setpoint utility (or Control Center within the Mac's System Preferences).The Desktop Wave package is completed with the inclusion of the symmetrically designed LX8 laser scroller mouse, which can be used by either righties or lefties. The comfortably curved sides are supplemented by a rubbery finish that's easily gripped. It's more compact than the Microsoft Intellimouse we've been using, though just a bit heftier. That said, it glided easily over our desk's surface and was very precise once we configured the tracking speed. Both mouse and keyboard connect to your PC via a wireless USB dongle that looks like a flash thumbdrive. Its small size makes it easy to pack along with the mouse for work while on the go, and it also comes with a dock for desktop use. Both mouse and keyboard are powered by two AA batteries.When I began reviewing the Cordless Wave, I wasn't looking for a new keyboard. But thanks to its excellent typing action, unique comfort features--from the contoured design of the keys to the padded wrist rest--and the plethora of customizable functions right at the tip of the finger, it's time to part ways with my old keyboard.--Agen G.N. SchmitzPros:Innovative contoured design of the keys conform naturally to your finger lengths, excellent typing actionPadded vinyl wrist rest adds soft comfort and allows easy movementLoads of function and multimedia buttons, all customizable using included softwareCross-platform, including compatibility with special features in Windows VistaLaser mouse is symmetrically designed, for use by both righties and leftiesCons:Shifting of some keys might annoy some, but delight othersMight seem flat to those who need more substantial ergnomics", "title": "Logitech Cordless Desktop Wave Set", "price": 49.99, "imUrl": "http://ecx.images-amazon.com/images/I/41F0XKX8YSL._SY300_.jpg", "related": {"also_viewed": ["B003VAHYNC", "B0036E8V08", "B001DJ9GOS", "B004XLA1R4", "B0011FQUQG", "B002MMY4WY", "B002B4P788", "B00CIZPXRU", "B006HIFZMW", "B002JCSCYS", "B000Q6UZBM", "B0076KQRXG", "B004E2P5VO", "B000CR1V5O", "B001F51G1G", "B000A6PPOK", "B000GAMMBO", "B0002CE0XO", "B007BPKHJ6", "B003VANO7C", "B0002CE0XY", "B000TUK47U", "B00CYX54C0", "B001B8EUEW", "B002KQ5KVG", "B00CYX53QW", "B0040QMBAM", "B004SUIM4E", "B00I14395A", "B00CYX26BC", "B003VAGXZC", "B0071U0F3Y", "B0073YHEZU", "B008OEHS04", "B0076KUTKS", "B003NREDC8", "B00BP5KOPA", "B002XK7T6I", "B00655BBGG", "B001B8EOMU", "B005CMQIVG", "B007XZTKWO", "B009A5AZ8I", "B0002GRU1O", "B00ACC0P0Q", "B005S0YO0O", "B0097CSZJ0", "B002HWRJBM", "B009ZNBJK8", "B003UNOZVE", "B000MQYBTI", "B0000642RX", "B005770DJE", "B000LVJ9W8", "B005HU0LX4"], "buy_after_viewing": ["B003VAHYNC", "B0036E8V08", "B003VANO7C", "B00BP5KOPA"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Keyboard & Mouse Combos"]]}