{"asin": "B0014Z29U4", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Connectors & Adapters"]], "description": "A premium quality High Speed HDMI Cable suitable for use in HDTV, Home Theater, and business class projector based applications. Features gold-plated connectors, molded strain-relief, and Mylar-foil shielding. Cable constructed using the high quality material for best contact connection between HDMI equipment's. Fully HDCP compliant to provide highest level of signal quality. Compatible with: multiple audio formats from stereo to multi-channel sound. Transfer Digital Audio and Video signals at warp speed of 5 Gigabits per second approximately! A superb cable with excellent audio-visual transfer properties that deliver signal without compromising purity and balance. Digital video doesn't get any better than this! Features: Gold-plated connectors for highest signal transfer rate and resistance in corrosion. Large gauge PVC jacket provides maximum shielding against wear and tear and extreme temperatures. Reinforced quad-layer braided shielding and Mylar-foil shielding provides utmost protection against RF and EM interference. Molded strain-relief design lessens plug/socket pressure. Designed to meet all HDMI standards. Supports 480i, 480p, 720p, 1080i, 1080p resolution. Color: Black. Cable Length: 3 FT / 1 M. NOTE: Even though HDMI cables support Hot Plug Detection, improper usage might result in resetting / restarting both devices, or even may cause damage to the devices. Therefore, we do not suggest Hot Plug action for any HDMI cables. Please make sure both input and output devices are off when plugging or unplugging HDMI cables.", "title": "eForCity 227744 2-Pack 3-Feet High Speed HDMI for HDTV/DVD Player", "price": 4.11, "imUrl": "http://ecx.images-amazon.com/images/I/41xHiFg4-JL._SY300_.jpg", "brand": "eForCity", "related": {"also_bought": ["B00B46XUQU", "B0040G5KY6", "B001JTQUYG", "B0014Z29OU", "B002L2V8GA", "B000QKKAOU", "B004GJQGKY", "B008D6YZXG", "B000UHTST2", "B000UHQVOW", "B001EPVOQY", "B000O5U150", "B001VO4MOY", "B0018DQYQ2", "B0020426AG", "B005TCENZ2", "B000IJY8DS", "B003WOCIEM", "B00B2CGUPY", "B0014Z29SQ", "B006C6IXNM", "B001NY45S0", "B00264NZWS", "B000M87F0I", "B0030BZDUI", "B0089DSLMY", "B000O5N5AI", "B001VNHPPS", "B0090QJ9V6", "B007PY3ZPG", "B0035B4LJM", "B002L329IU", "B003LMN5N8", "B000FKDML4", "B0002L5R78", "B009DQJ8X2", "B009LVVTSQ", "B003V1UH3U", "B00DR0PDNE", "B0030AZ44O", "B005BOGI4C", "B00BGGDVOO", "B000I23TTE", "B0052SCU8U", "B000W96H3I", "B00CJHXY0U", "B00DF7PKX2", "B001TH7K74", "B005CHMZAO", "B004ZH62PQ", "B008D66RAU", "B005QWH4QA", "B003E2T13S", "B000SJQB24", "B00FX6ST8G", "B003O1UYHG", "B0088HP93A", "B00004Z5L8", "B005HXFARS", "B00BEWF4R2", "B000N99BBC", "B001TH7GSW", "B007NLEF3W", "B005GGTTZ0", "B000AA2RCY", "B007I5JT4S"], "bought_together": ["B00B46XUQU"], "buy_after_viewing": ["B00B46XUQU", "B00870ZHCQ", "B009DMFOVG", "B0014Z29OU"]}}