{"asin": "B00CG0CKVE", "related": {"also_bought": ["B001W35I8I", "B002QNM8NQ", "B00804BCK0", "B0084BQ02E", "B00CZBHQ5E", "B00DCWM1N2", "B0038AJYSS", "B00DGXTC2K", "B00GTCKOCM", "B001W2WKS0", "B005ZCY36K", "B00804BDCM", "B00B7YJ7NE", "B00CRZXSGE", "B00AOHDC5Y", "B004MWN1AS", "B007U7LZQO", "B004MWN0G8", "B00AOHDBRI", "B005IUIWB6", "B001539JEO", "B00DCWM2ZE", "B005I0DUN6", "B00CMCCAH0", "B009W2ST6Y", "B00804BDEA", "B00804BE8A", "B0064MT1NK", "B00CRZXV3O", "B0041CJM6G", "B004MWJM0G", "B00C3WXKPA", "B007XVYSBG", "B0041CJM70", "B001U7NW20", "B00CP4J7OY", "B004T33K6A", "B00AOHDC5E", "B0027CS7BS", "B0044UHJ4W", "B001W3MMHI", "B00CQHYXNA", "B00CMNX5YG", "B00CRZXWZG", "B00CG0CKXW", "B00CMNX7VM", "B007RDGK1Q", "B0084BPZJ8", "B003DKKKTK", "B004MWN3SS", "B00804BCLY", "B00I19QQFA", "B00CRZXUZI", "B007XVYPS2", "B004Z7H14M", "B007U7M0KE", "B0089U3VDQ", "B009YQJ37M", "B00DCWM1M8", "B002WUVVLI", "B003LPUCG8", "B001TKUXUC", "B007XVYSDE", "B00361XWDC", "B00GTCKO90", "B0088LQZOI", "B004AC6PXA", "B00CQHYZ6K", "B006GYLL8Y", "B007GE75HY", "B004UU9ZAW", "B00AETVU60", "B00804BEB2", "B009TJ3J60", "B00BH0G9NE", "B00CN5Y0HY", "B007U7M02C", "B004MWK25U", "B00CRZXV16", "B00178LYI6", "B005DLCJX2", "B003Z6HSL0", "B00B35KKEW", "B001BKX0V4", "030797586X", "B0038AR53E", "B001GZXYFG", "B004XATEJ6", "B001D0C70C", "0763644765", "B009UPUC36", "B00005BZM6", "B00CS16EKO", "B004PHE924", "B000284ZNI", "0312510810", "B002LYD2M6", "B00CQHYWK4", "B000JJK9EY", "B001W32F02"], "also_viewed": ["B001W35I8I", "B00CZBHQ5E", "B00GTCKOCM", "B00DW1TUY6", "B00DW1U3CY", "B00DGXTC2K", "B005ZCY36K", "B00H5HFEUM", "B00AOHDC4U", "B002KZW8TE", "B00804BCK0", "B0084BQ02E", "B00GTCKO90", "B00CRZXX1Y", "B00CRZXV52", "B004MWN1AS", "B00DCWM2ZE", "B00804BEB2", "B00804BE8A", "B00804BDCM", "B00CRZXSGE", "B004MWN0G8", "B00CV7BX7E", "B00DSE1ZJK", "B007U7LZQO", "B00D38UBJ6", "B00CK2EPF2", "B00CRZXV3O", "B0038AJYSS", "B00DCWM1N2", "B00CRZXWZG", "B00B7YJ7NE", "B0084BPZJ8", "B007U7LZQ4", "B001W3MMHI", "B007U7LZOG", "B007U7M0L8", "B002QNM8NQ", "B00AOHDC5Y", "B001W2WKS0", "B004MWL0J2", "B00CRZXUZI", "B00804BDEA", "B0089RPUH4", "B00AOHDBRI", "B00CS1WDBI", "B00CRZXV16", "B0089U3VDQ", "B00DCWM1M8", "B003H5174S", "B004MWJM0G", "B0084BPZO8", "B0089U3VPY", "B00CRZXSH8", "B007U7LZQE", "B00CRZXS8W", "B009PLLF9K", "B00BZAFPOK", "B00CG0CL1S", "B00DCWM2Z4"], "bought_together": ["B001W35I8I", "B002QNM8NQ"]}, "title": "LeapFrog Read with Me, Scout", "price": 23.77, "salesRank": {"Toys & Games": 14855}, "imUrl": "http://ecx.images-amazon.com/images/I/51fm45GspQL._SY300_.jpg", "brand": "LeapFrog Enterprises", "categories": [["Toys & Games", "Electronics for Kids", "Electronic Toys"]], "description": "Watch your little one light up with LeapFrog Read With Me Scout and a complete set of 5 colorful books! This adorable introduction-to-reading experience is designed by our learning experts to inspire and entertain early readers everywhere! Read With Me Scout provides cuddly story-time experiences that help lay the foundation for a rewarding lifelong love of reading. The plush puppy pal makes reading fun with five interactive, read-aloud books narrated by Scout. Scout responds to every pet, pat, hug and kiss&#x2014;press a button on Scout&#x2019;s collar to start reading and pat his head to turn the page. Scout loves to sing, too! Switch into Sleepy Time Mode when it&#x2019;s time to snuggle and listen to relaxing stories and 8 minutes of lullabies. Start your child&#x2019;s reading journey on a cuddly note with an interactive plush toy that helps children develop reading comprehension skills to get them on a path to reading.Build reading skills with a cuddly friend!Scout asks more than 70 engaging questions.Learning SkillsTurn reading time into an exciting new experience with this groundbreaking toy loaded with storybooks, music, lullabies and interact-and-respond activities. Read With Me Scout is specifically designed to provide leading-edge early reading curriculum. Whether you&#x2019;re supplementing the precious time spent reading with your child or providing a new enriching activity, Read With Me Scout helps build a range of cognitive skills. Each of the five storybooks is designed around a unique core curriculum covering the bases from patterns and rhyming to narrative and concept. Scout asks more than 70 questions prepared by early reading experts to encourage active engagement and to build important comprehension skills. The play-based curriculum is designed to delight and entertain, and is appropriate for children ages 2 to 5 years.LeapFrog DifferenceResearch has demonstrated that the most effective read-aloud experiences are interactive.  In other words, children learn best when they are actively involved in asking and answering questions, drawing inferences and making predictions. Read With Me Scout was specifically developed to bring this interactive experience to kids in a magical way to develop key comprehension skills. As your child reads along with Scout, 70+ spoken questions and audio-responses help build comprehension skills that will get your little one on the path to reading success. &#x201C;From reading aloud to reading along, Read With Me Scout reflects best practices in early reading instruction that helps your child develop important language and comprehension skills critical for success in preschool and beyond.&#x201D; -Clement C., LeapFrog Learning ExpertInnovative Learning ApproachDiscoveries abound when Scout reads out loud! Read With Me Scout includes five different book genres that offer a range of ways to build early reading skills as your child is exposed to different storytelling concepts  The Pattern Book includes rhymes, refrains and repetition to encourage children to predict what comes next; the Narrative Book takes children through a storyput together with characters, settings and a sequence of events; the Learn-About Book helps reveal our world through reading, and reinforces the concept that print carries meaning; in the Rhyming book, children learn about the sounds of language while building phonological awareness; and the Concept Book explores concepts like colors to label and classify new information.What's In The Box?Read With Me Scout plush learning toy (batteries included), 5 board books, Parent Guide & Instruction Book.Includes 5 interactive educational board books: Pattern Book: Let&#x2019;s Go Camping, Narrative Book: Let&#x2019;s Find Scout&#x2019;s Toy!, Concept Book: Let&#x2019;s Have a Party!, Rhyming Book: Let&#x2019;s Cheer Up Eli! and Learn-About Book: Let&#x2019;s Learn About the Weather!"}