{"asin": "B001542X5K", "categories": [["Electronics", "Camera & Photo", "Lenses", "Camera Lenses", "Digital Camera Lenses"]], "description": "The Sigma 120-400mm telephoto zoom lens covers a telephoto range of up to 400mm, letting you bring almost any subject close for short-perspective shots. The lens employs Sigma's original Optical Stabilizer (OS) function, which gives you access to shutter speeds approximately four stops slower without blurring the image. As a result, you can capture low-light, long-distance shots such as football plays, wildlife profiles, and landscape scenes without using a tripod for each photo. In addition, the lens incorporates a Hyper Sonic Motor (HSM) for quick, high-speed autofocusing, along with a rear focus system that guarantees optimum image quality throughout the entire zoom range. And photographers will love the three special low dispersion (SLD) glass elements, which correct for chromatic aberration, and the super multilayer lens coating, which reduces flare and ghosting. Other details include a minimum focusing distance of 59.1 inches, a maximum magnification ratio of 1:4.2, and support for optical 1.4x EX DG APO and 2x EX DG APO tele converters.SpecificationsFocal length: 120-400mmMaximum aperture: f/4.5-5.6Lens construction: 21 elements in 15 groupsAngle of view: 20.4 to 6.2 degreesNumber of diaphragm blades: 9Minimum aperture: f/22Minimum focusing distance: 59.1 inchesMaximum magnification: 1:4.2Filter size: 77mmHood type: BayonetMount: NikonDimensions: 3.6 inches in diameter and 8 inches longWeight: 61.7 ouncesWarranty: 1 year", "title": "Sigma 120-400mm f/4.5-5.6 AF APO DG OS HSM Telephoto Zoom Lens for Nikon Digital SLR Cameras", "price": 969.0, "imUrl": "http://ecx.images-amazon.com/images/I/41lKBFdh1DL._SY300_.jpg", "brand": "Sigma", "related": {"also_bought": ["B00004ZCJM", "B00004ZCI3", "B000BH5OW6", "B00009R9EO", "B00603RTC8", "B004QC6VAG", "B00443RRVY", "B0045KGZOG", "B0076AYNXM", "B001F6TXME", "B00006I5JC", "B005UG3KS8", "B00BI9X7UC", "B0043RTLNS", "B00906D9YE", "B007ORX8ME"], "bought_together": ["B00004ZCJM", "B00004ZCI3"], "buy_after_viewing": ["B001542X64", "B00004ZCJM", "B00009R6M3", "B003A6H2Y8"]}}