{"asin": "B000QU1QVG", "description": "High-Speed Reader for Professional Photographers  Lexar offers high-performance Professional UDMA readers designed to help professional photographers and advanced photo enthusiasts maximize their post-production workflow speed. Lexar Professional UDMA Readers are ideal for use with high-speed cards, and provide incredibly fast download speeds when paired with a UDMA card&#x2014;so you can maximize your workflow and minimize your post-production time. The Lexar Professional UDMA FireWire 800 Reader is a high-performance reader with a stackable design that allows for concurrent downloads from multiple cards. Fully compatible with both UDMA CompactFlash (CF) and standard CF memory cards, the reader provides versatility and the ability to leverage blazing-fast UDMA CF card speeds.  Save Time and Improve Workflow  High-Speed Downloads. The Lexar Professional UDMA FireWire 800 Reader supports the FireWire 800 interface with data transfer rates of up to 800Mb/sec (or 100MB/sec)&#x2014;twice as fast as traditional FireWire 400 which satisfies the demand for faster transfer rates from card to computer. When paired with a blazing-fast Lexar Professional UDMA card,the reader is performance optimized to deliver blazing fast read/write speed from the card.  Innovative, Stackable Design. Lexar Professional UDMA FireWire 800 Readers have an innovative stackable design that allows up to four readers to be daisy-chained together for concurrent downloads. This unique feature lets you configure the readers to your specific needs, and allows you to streamline your productivity and drastically accelerate your workflow capabilities. The stackable design makes it ideal for boosting productivity in a photo studio environment.  Enhance Your Business. Lexar is the brand trusted by professionals. When used in conjunction with a UDMA CF card, the reader's high-speed performance allows you to reliably improve workflow and drastically accelerate download speeds from card to computer-saving you time and money", "title": "Lexar CompactFlash FireWire 800 Card Reader RW034-001", "price": 14.95, "imUrl": "http://ecx.images-amazon.com/images/I/41e-g-cX1HL._SX300_.jpg", "related": {"also_viewed": ["B0056TYRMW", "B007FEFQDA", "B005ES0YYA", "B000I04WWY", "B00109Y2DQ", "B001NS0OZ4", "B000GLRPGK", "B003CKC8W8", "B000YBH4YU", "B008VQ2YUY", "B009D79VH4", "B008OZF9SQ", "B00BBD7NFU"], "buy_after_viewing": ["B0056TYRMW", "B007FEFQDA", "B00EJ8CKPC", "B005ES0YYA"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Memory Card Readers"]]}