{"asin": "B001UW9ZW6", "description": "The largest army of super heroes in gaming is Back. The highly anticipated sequel to 2006'sMarvel:Ultimate Alliance, heralded as the best Marvel super hero game of all time, and selling more than 4 million units worldwide, is finally here withMarvel: Ultimate Alliance 2. Inspired by the acclaimed Marvel civil war storyline, this action-RPG delivers once again on a colossal cast of characters, thrilling gameplay and impassioned alliances. This next-gen gaming experience leaves the fate of the Marvel universe and humankind, in your hands. Lines are drawn. Sides are chosen. And the ultimate question remains: Whose side are you on?.caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Choose a side in the Marvel civil war.View larger.Create your ultimate team.View larger.Combine abilities into Fusion powers.View larger.StoryThe Marvel universe is being torn apart. You and your team of Marvel super heroes help Nick Fury launch a secret pre-emptive strike against Latveria and Lucia Von Bardas only to have to thwart her retalitaory attack on New York City.Coupled with other super hero incidents, public sentiment turns against super heroes. The Superhuman Registration Act becomes law and super heroes must register as weapons of mass destruction, and become licensed government agents with the United States government. Lines are drawn as Iron Man leads the pro-registration faction, while Captain America spearheads the stand on anti-registration. You must pick a side and fight to determine the fate of the universe and humankind. So, whose side are you on.Playable CharactersMarvel Ultimate Alliance 2will feature a wide array of playable heroes and villains, some of which are available from the beginning of the game, while others will need to be unlocked. Although the final list was not available at publishing time, some of the faces from the Marvel universe that players can count on seeing include: Daredevil, Green Goblin, Human Torch, Invisible Woman, Hulk, Captain America, Iron Man, Luke Cage, Mr. Fantastic, Deadpool, Juggernaut, Thing, Spider-Man, Storm, Songbird, Thor, Iron Fist, Wolverine, Venom and Gambit.GameplayAs with the originalMarvel Ultimate Alliance, the new version of the game is an action RPG in which players create their own fighting team made up of four super heroes/villains. The makeup of teams can be changed as the player chooses, and characters can be leveled up as they gain experience and the game progresses. In addition, the separate powers of super heroes can be combined, or \"fused,\" resulting in unique abilities that are devastating in combat. The game contains over 250 of these fused powers that only await the right combination in battle to be released.Key Game FeaturesCreate and Customize Your Ultimate Team- Assemble your dream team from the Marvel universe and select from over 24 playable heroes and villains, each with specialized powers.Cooperate with Your Ultimate Alliance- Take full advantage of the Marvel universe by playing Cooperative Mode with up to four friends, both online and offline.Choose a Side in Marvel&rsquo;s Civil War- Pick a side in the ultimate ideological rift that could yield irreparable consequences for the super hero community. You can choose to support the pro-registration side and defend national security, or throw your support behind the anti-registration cause and fight for personal liberties.Fight Fear with Fusion- Combine super hero powers for devastating results. Team up with Human Torch and Thor to create a spectacular fiery tornado. Over 250 unique fusions arm you with an unimaginable arsenal for unprecended battles.Wield Next-Gen Superpower in Fully Destructible Environments- Demolish and interact with everything in your path. Pummel your enemies by launching crushed cars, lamp posts, machinery and anything else that you can pick up in your way.Online Support- Enjoy multiplayer, voice and voice messaging support via PlayStation Network.", "price": 238.19, "imUrl": "http://ecx.images-amazon.com/images/I/61mJc7SpIsL._SY300_.jpg", "related": {"also_bought": ["B000GA75TI", "B004MXM7WU", "B001PKHRUK", "B004RIACMW", "B003ESHRL0", "B0009O7HVW", "B00114XU4C", "B001811BTO", "B008LW4SCU", "B0001I9YHG", "B004VMXBEU", "B0088I7L76", "B002I0K898", "B005C7R950", "B004LM37FI", "B005VKRGXI", "B00C7103DO", "B002BRZ744", "B000WQWPP0", "B001BTPRKC", "B002WDL516", "B00FRESXSA", "B00B98HBTA", "B00K2O4O5G", "B0044SA734", "074401087X", "B000ZK7ZK8", "B00KJ8UPD0", "B003DNLDUC", "B004J6I0YO", "B000G7YX4G", "B007SRM5U6", "B003O6G1L4", "B004FUI84G", "B002I0K6Q8", "B004BCZLQ6", "B008SBZD5U", "B004LWEK7C", "B0045ZIEPY", "B003FBL85M", "B001ASJIS6", "B000HWX418", "B00BGA9V2Q", "B00K3W8Y9Y", "B00104KCF8", "B003IEBO9Q", "B003C1I06U", "B00IZ9T9QE", "B00KB6NSXO", "B001CBW18U", "B004EW948E", "B003S2MXNE", "B00JUFT3HW", "B001YHX4B0", "B000OPPR22", "B008EAWXA8", "B00319DX4M", "B0009H7UJI", "B00JUFT3I6", "B00J22636W", "B0017ZIIK6", "B001AZFSDI", "B00BJH11FQ", "B003H0CBYS", "B00CTKHXFO", "B0009351PM", "B0088MVOUC", "B0065NP05G", "B0030HM2WO", "B000R39GPA", "B007TYC8MI", "B0012NAPNQ", "B008CP6MA2", "B002I0J6KU", "B00D87TCN8", "B001TOMQSK", "B0030F1DOO", "B002I0F5M8", "B004ML44Y6", "B000WJFZEA", "B004FS8LYK", "B0088MVP3S", "B00006LEM1", "B000X1TC0U", "B006Y76HXM", "B000HKMPVA", "B0047TLIBU", "B0029MAXR2", "B007XYBUBE", "B000G82KU4", "B00B59L9T6", "B0009JB4IY", "B003O6E620", "B0057PERNE", "B007CM0K86", "B000XJK40O", "B006ZPAYD2", "B000ZK9QCS", "B00BRQN2H4"], "bought_together": ["B000GA75TI", "B004MXM7WU"], "buy_after_viewing": ["B000GA75TI", "B001811BTO", "B003ESHRL0", "B001PKHRUK"]}, "salesRank": {"Video Games": 2935}, "categories": [["Video Games", "PlayStation 3", "Games"]]}