{"asin": "B000HGQJZW", "description": "Pack in the sports, movies and games with an amazing backlit 40\" picture1, amplified and enhanced surround sound, and the convenience of sleep timer and picture freeze. Plug in your PC and up to 7 other components&#x97;including HDMI&#x99;&#x97;to create the full entertainment experience. And enjoy the quality and style that can only come from a Bravia&#x99; TV.Feature ListBRAVIA Engine&#x99; Full Digital Video Processor:BRAVIA&#x99; V-Series LCD televisions use Sony's BRAVIA Engine&#x99; full digital video processor for crisp and clear images. Several special picture enhancement technologies are integrated into the processor to create better gradations and details, enhance contrast, dynamically improve color, and reduce image flicker.Full HD 1080:There are a lot of ways to define high-definition but BRAVIA Full HD means you&#x92;re getting the best resolution that high-definition has to offer consumers. With Sony BRAVIA V-Series HDTVs, Full HD 1080 means 1920 x 1080 pixels and 1080p video inputs. Your lifestyle demands the best in high-definition and with BRAVIA Full HD 1080 products you get it.1920 x 1080 Panel Resolution:When it comes to high-definition TV the pinnacle of performance is achieved by using 1920 x 1080 display panels. And BRAVIA V-Series televisions have them. Full HD 1920 x 1080 panel resolution with over 2 million pixels (more than twice that of 720p HDTV) is exactly what you need to reproduce the 1080p content that can be delivered by our cutting edge 1080p Blu-ray disc&#x99; player. And working with BRAVIA Engine&#x99; PRO everything from standard definition and high definition is upconverted to 1080p for a picture so real it&#x92;s like you&#x92;re actually there.Live Color Creation System:Decades of television know how allow us to realize that an LCD TV is more than just the panel; it&#x92;s actually a system. Uncompromised picture quality starts with combining carefully chosen components and circuits to optimize system quality, among these are the color creation and processing functions. That&#x92;s what Live Color Creation is all about. It starts with the BRAVIA Engine&#x99; PRO video processing system, which enhances primary colors and corrects half-tone colors for natural overall color. Next, a WCG-CCFL backlight using Sony&#x92;s phosphor formula delivers a specific spectrum of light designed to work with our specially formulated color filters. The combination of these three components creates deep, deep blues and natural greens for overall colors that draw you right into the picture itself.High Contrast Ratio:Sony uses a dynamic backlighting system called ACE (Advanced Contrast Enhancement) on BRAVIA V-Series TVs. ACE automatically senses the APL (Average Picture Level) of the video signal and adjusts the intensity of the backlight for improved contrast. VESA test and measurement methods are applied yielding a contrast ratio of used 7000:1. This number represents the widest possible ratio between black and white contrast levels. Sony also measures their BRAVIA televisions with a more stringent method that measures the amount of black and white levels that can appear on the screen at the same time. This method yields a more real world measurement of 1300:1HDMI&#x99; and PC Connectivity:Designed for maximum versatility, Sony&#x92;s BRAVIA V-Series LCD TVs are equipped with a comprehensive range of input interfaces. The HDMI (High-Definition Multimedia Interface) is the first industry-supported, uncompressed, all-digital audio/video interface. HDMI technology supports enhanced or High Definition video, together with multi-channel digital audio to provide matchless image and sound reproduction. BRAVIA V-Series TVs include (2) HDMI 1080/60p inputs. The PC input (HD-15-pin) offers easy connection to your PC, allowing you to use your high resolution BRAVIA V-Series Digital TV as a computer monitor.", "title": "Sony Bravia V-Series KDL-40V2500 40-Inch 1080p LCD HDTV", "price": 379.0, "imUrl": "http://ecx.images-amazon.com/images/I/513rnlQbGsL._SX300_.jpg", "related": {"also_viewed": ["B004HYG9T6", "B00AWKBZQQ", "B00J58HU6K", "B00HPMCO46", "B00ICWNM9O", "B00LEWO8LU", "B008HYQ7ZI", "B00BB0ZTO0", "B00BB0ZTJA", "B00KVLQURA", "B004HYG9SW", "B00BP5N498", "B008KECFRO", "B00HPMCNXI", "B00AWKBZOI", "B00CALLZK6", "B00I0S70J8", "B004NP1E9E", "B00AEP8TG8", "B00723QKVQ", "B00IXLJ234", "B00HNDFZ0W", "B006U1VGW4", "B00BF9MZY4", "B00GMM94CK", "B0035ER1IW", "B009IBXEH8", "B00I94ISS0", "B00IN2WDIY", "B00GKKI4Q6"], "buy_after_viewing": ["B00BB0ZTJA", "B00BB0ZTJA", "B00BB0ZTO0", "B0012S4APK", "B0019D0Y4E"]}, "categories": [["Electronics", "Television & Video"]]}