{"asin": "B000IHGJ50", "description": ".caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; }The 1 GB iPod shuffle lets you wear up to 240 songs on your sleeve. Or your lapel. Or your belt. And now it's available in your choice of remixed colors. Clip on iPod shuffle and wear it as a badge of musical devotion.ControlsiPod shuffle pays respect to its bigger siblings with a circular control pad that puts the \"go\" in ergonomic. Click the center button to play and pause. Click the outer buttons to move back, skip forward, and adjust volume.Pop the iPod shuffle into the included dock and sync with iTunes.View iPod shuffle dimensions.The shuffle switch lets you mix up the iPod contents, or play playlists in the order you want.View larger.ClipThanks to a built-in clip, iPod shuffle goes with anything. Clip it to your sleeve, lapel, coin pocket. No matter where you wear it, iPod shuffle speaks volumes about your style.Shuffle switchEmbrace your inner rebel: Flip the shuffle switch to mix up iPod shuffle's contents. Flip it again to play your handpicked playlists and albums in the order you synced them from iTunes.Battery indicatorGreen means go, amber means you're low, and red means you've almost hit zero. But with up to 12 hours of battery life, the iPod shuffle may keep rocking even longer than you do.Headphone jackThe headphone jack does double-duty as a dock connector. Flip iPod shuffle upside-down and drop it into the included dock. Connect the dock to your Mac or PC for a quick sync and charge. Away from your computer? Charge on the go with the optional Apple USB power adapter.", "title": "Apple iPod shuffle 1 GB Silver (2nd Generation)  (Discontinued by Manufacturer)", "price": 59.95, "imUrl": "http://ecx.images-amazon.com/images/I/31LbNoI3I8L._SX300_.jpg", "related": {"also_bought": ["B001FA1NSC", "B000PB4BPO", "B001FA1NR8", "B000NU4OTA", "B000EPHQNA", "B0013BC7XS", "B0013BE8AI", "B000QHHBRC", "B001FA1NRI", "B0030BZO1Q", "B000IK5Z8E", "B000Z9PGFA", "B000QHOB4S", "B0002ZAILY", "B000IHL38I", "B000MVHRRQ", "B002HR1GEI", "B001FA1NUU", "B0030LVHM6", "B000SZPSC2", "B0010SLTU6", "B0012LWG9O", "B000H0QIDG", "B000EPJL1A", "B00354QSKY", "B009QXCA6E", "B00DP7JETI", "B000EP4TWQ", "B0097BEEW8", "B004A7TAAK", "B006I0FMFY", "B003DT0IE8", "B002M3SOMO", "B001FA1NUK", "B001FA1NVO", "B00BK09JEM", "B008F4ZR6A", "B0097BEEDM", "B00BJ5BNZG", "B0062GM0YA", "B0097BEECI", "B000W3RU9Y"], "bought_together": ["B000NU4OTA"], "buy_after_viewing": ["B000NU4OTA", "B0097BEECI", "B0097BEEW8", "B001FA1NR8"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}