{"asin": "B005YQY5TM", "related": {"also_bought": ["B004NY9UXC", "B00507NAYQ", "B0001EMM10", "B00IMTQ6I6", "B002VPE1QG", "B004YIFKRM", "B00DXFF6QC", "B0058PZFVG", "B002P4J3YI", "B00IKF2H12", "B0079T2KHG", "B002HWRJBM", "B006NNWZSI", "B005MR4UV6", "B00006IFAO", "B0002YVBC0", "B00E3W1726", "B003VAHYNC", "B0000DK7AI", "B0002YY9PG", "B0036E8V08", "B0043T7FXE", "B00DPC015E", "B008I649KA", "B00939KFOU", "B00E3W16OU", "B003BXMK8I", "B009QZH6JS", "B00E3W19MO"], "bought_together": ["B004NY9UXC", "B00507NAYQ"], "buy_after_viewing": ["B00507NAYQ", "B004YIFKRM", "B0001EMM10", "B006NNWZSI"]}, "title": "Targus Demolition Backpack Designed to Fit up to 17.3-Inch Laptop, Black (TSB220US)", "price": 95.0, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/51x2bI98k3L._SY300_.jpg", "brand": "Targus", "categories": [["Electronics", "Computers & Accessories", "Laptop & Netbook Computer Accessories", "Bags & Cases", "Backpacks"]], "description": "Targus Demolition BackpackDemolition BackpackLarge and Spacious &ndash; Perfect for Travel,Work and Outdoor UseWherever you go, you carry everything with you and you need the space to store it all. Designed to fit up to 17.3&rdquo; laptops and boasting a stylish yet durable design, the Demolition Backpack features more space for storage, added protection and is designed for comfort. It is perfect for those who travel frequently and the perfect backpack for rugged outdoor use.Sturdy and ProtectiveLooking for a bag that is durable and secure? This deluxe backpack features a padded laptop compartment that protects your laptop at all times and has a dedicated protective pocket to store your tablet/eReader. Let&rsquo;s not forget the little things&mdash;the soft, interior scratch-resistant lining allows you to store fragile accessories such as glasses, mobile phone and other items without thinking twice. Made of a durable material, the Demolition has a water-resistant bottom panel with thick industrial zipper pulls and a sturdy, molded handle. An anti-shock base adds more protection to your valuables from impact.padded laptop comartmentsoft, interiorscratch-resistant liningthick industrial zipper pullsMore Space, More StorageAlways wanting more?  Need more space to store things and more room to take what you need?  Look no further than the Demolition Backpack from Targus. This spacious backpack not only has the dedicated tablet/eReader compartment, but also features a document compartment, zippered mesh pocket and two accessory pockets. Dual-sided mesh pockets are ideal for water bottles and small accessory items, and there is an exterior zippered accessory compartment for additional storage. The Demolition is the ideal solution for carrying more without the bulk.zippered mesh pockettwo accessory pocketpockets are ideal forwater bottlesComfortableWith any backpack, comfort is key. For an extra-large backpack, the Demolition has an ergonomic padded back panel with a waist buckle and padded adjustable shoulder straps. The waist buckles help distribute weight evenly and the padded straps are made of a light, breathable material. Plus the Demolition backpack comes with the Targus Limited Lifetime Warranty, which provides you with the assurance that we will repair or replace your backpack should anything go wrong with its structure.padded back panelwaist buckleslimited lifetime warranty"}