{"asin": "B0003QER82", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Remote Controls", "TV Remote Controls"]], "description": "A good universal remote may control an entire home entertainment system, but more often than not, it also looks like the instrument panel of the space shuttle, with dozens of intimidating and confusing keys. Enter the Logitech Harmony 659 remote, which is not only simple to program and use, but also consolidates a user's preferences for watching TV, viewing movies, or listening to music into three clearly labeled buttons. Simply press the Watch a Movie, Watch TV, or Listen to Music button to activate all the appropriate equipment--including surround sound components--and the remote does the rest. The device will automatically switch to your favorite settings for each component, while offering you a host of customized controls on its interactive LCD screen. It's called Smart State Technology, and it puts you and your family back in control of your home theater system.The remote is an ideal choice for families with kids, though in many cases, it's the grownups that will find the simplicity most appealing. Like many other universals, the remote lets you assign tasks to individual buttons. However, unlike most other remotes, it also lets you create new functions to specifically match your component, such as when controlling multi-angle playback or zoom on a DVD player. To do this, merely connect the Harmony remote to your computer through the USB port, install the included CD software, walk through the Web wizard's step-by-step setup process, and start programming. Once you enter the model numbers of your components and answer a few easy questions about personal preferences, you'll soon be able to control a complex home theater setup without any hassles of frustrations. The Harmony 659 also includes a learning port, which picks up commands from other infrared remote controls to simplify setup even further. And should the setup process ever get too confusing, the remote includes a handy Help button that guides you through common troubleshooting steps--the only remote on the market to do so.The Harmony 659 is compatible with everything from surround sound systems to satellite and digital cable boxes to DVD players. As a further enticement, Logitech includes two free months of TV listings. For the computer setup to work properly, users will need to own USB-equipped computers running Windows 98 SE, 2000, Me, or XP or Macintosh OS X 10.2 or later.What's in the BoxHarmony 659 remote control, software installation CD, USB cable, four AAA batteries, quick-start guide.", "title": "Logitech Harmony H-659 Advanced Universal Remote Control (Black) (Discontinued by Manufacturer)", "price": 159.99, "imUrl": "http://ecx.images-amazon.com/images/I/41T7H4MD48L._SY300_.jpg", "brand": "Logitech", "related": {"also_viewed": ["B004OVECU0", "B002IC0YLS", "B003JSLP54", "B004OVECUA", "B000EUGX70", "B00093IIRA", "B000IMSK8Y", "B0000TNZDK", "B005FO43OU", "B0038OMEQI", "B000BDG3HU", "B003IZFCFW", "B00182F1SU", "B00119T6NQ", "B00IAKLM54", "B00J7KM5X4", "B009EIUH6G", "B00I54C0GA", "B004U605FK", "B004UKRRD4", "B005O81U9S", "B00066FHHO", "B000623HE8", "B00BQ5RYI4", "B000CS1TLE", "B001F51G1Q", "B000GD3J3G", "B00BQ5RY1G", "B000FL9E6K", "B000II6YEA", "B001KC08AE", "B0003QER8C", "B002IC0YL8", "B002N1J7DU", "B0003QER7S", "B00267S7XW", "B000CCXCYC", "B001M5U5AC", "B000FL9E6U", "B001KC08A4", "B004HB2X3U", "B001HKLA60", "B0007N5XPW", "B003W8DZ1S", "B003UVVGHW", "B0003QER5U", "B001HA51Z6", "B001G6LTL6", "B003FST9EC", "B001M56DI0", "B008XTURU8", "B00AP61HYM", "B000T4OWO2", "B00701Q2R2", "B000ILIHTC", "B003TX2N14"], "buy_after_viewing": ["B004OVECU0", "B002IC0YLS", "B003JSLP54", "B004OVECUA"]}}