{"asin": "B0030CHI14", "description": "The USB 3.0 Interface Card for PCI Express IFC-PCIE2U3 quickly adds SuperSpeed USB 3.0 functionality to your PC,  offering a simple and convenient way to upgrade your desktop PC for use with SuperSpeed USB 3.0.SuperSpeed Transfer RatesThe USB 3.0 Interface Card for PCI Express IFC-PCIE2U3 quickly and easily adds SuperSpeed USB 3.0 functionality to your PC.   USB 3.0 is the latest generation of USB technology, boasting enhanced transfer rates of up to 5 Gbps*.  SuperSpeed USB offers  unparalleled performance compared to the standard USB 2.0, delivering the quick transfer and storage of all your files.   Buffalo&rsquo;s USB 3.0 Interface Card for PCI Express is a simple solution for connecting to and using USB 3.0 devices on your PC.   In addition to supporting USB 3.0 devices, IFC-PCIE2U3 is backward compatible with USB 2.0 devices, offering connection to either  of the two available ports.  USB 3.0 Interface Card for PCI Express is the best way to upgrade your current PC for use with  SuperSpeed USB 3.0.Key Features and BenefitsSuperSpeed USB 3.0:accelerated file access and transfer speeds, up to 5 Gbps*Boost Your Peripheral Capability:USB 3.0 PCI Express interface card with 2 portsThe New Standard for USB:Connect any USB 3.0 devices to your PCBackward Compatible:Works with USB 2.0 devicesFree 24/7 Tech Support:US-based tech support for life of the productExpand your Storage:Great for connecting external USB 3.0 hard drives such asBuffalo DriveStation USB 3.0 HD-HXU3USB 3.0 PCI Express Interface Card IFC-EC2U3/UC is backed by a one-year limited warranty and lifetime 24/7 US based technical support.What&rsquo;s in the BoxUSB 3.0 PCI Express Interface Card IFC-EC2U3/UC, Setup CD-ROM with Drivers, Quick Setup Guide, Internal Power Cable, Low Profile Slot Cover and Warranty Statement* 5 Gbps is the maximum transfer rate derived from the specifications of the Universal Serial Bus 3.0 and the ExpressCard. Actual transfer rate will vary depending upon environmental factors. Data rate, features and performance may vary based on the configuration of your system and other factors.", "title": "Buffalo Technology SuperSpeed USB 3.0 PCI Express 2-Port Interface Card IFC-PCIE2U3", "price": 32.93, "imUrl": "http://ecx.images-amazon.com/images/I/31ELwtw4TPL._SX300_.jpg", "related": {"also_viewed": ["B00JFR2I2C", "B005ARQV6U", "B007N90KXI", "B00E59W1G8", "B007SJGGAE", "B005IVABWI", "B002XVVIQE", "B00DNUBN78", "B00F0F349Y", "B002VY53ZK", "B005HVPYNU", "B00FXMGC5M", "B00AM32HYW", "B00DZWOT6G", "B00A20KIXW", "B008IPXOWU", "B002VVQ58M", "B00EH8V9QA", "B00J4EZE4U", "B003MVJG8Q", "B00HQY5C9M", "B007KJ1TGS", "B00JM14XWO", "B00ARJN5G0", "B005INYP7I", "B005LC2MLC", "B00GG5GMKK", "B00A524ESC", "B007L5K14W", "B004MEZ4GK", "B009NJV5L2", "B00965J5T2", "B009YDO05U", "B00CHYOQIE", "B00J8F6KAC", "B00H48WWDE", "B00J8DUK4Q", "B00AWP9LMG", "B00F0FXPQG", "B00FDLKDGW", "B008BZAVVE", "B009SKB5HA", "B008KEPWMY", "B007YDJJFS", "B003NR59XU", "B003HIXOPU", "B00C3X982S", "B005B0A6ZS", "B00AXJW7Y0", "B00CFH69U6", "B00DKWSC1E", "B006BG47RO", "B00HJZEA2S", "B004GF1PC2", "B005D69QD8", "B005G2JFMG", "B00DSXG4YW", "B0079XWPDQ", "B00GN6ZHTO", "B00IJQCY7E"], "buy_after_viewing": ["B00JFR2I2C", "B005ARQV6U", "B007N90KXI", "B00E59W1G8"]}, "categories": [["Electronics", "Computers & Accessories", "Computer Components", "Network Cards"]]}