{"asin": "B007FQUEZ8", "description": "Product OverviewFrom the critically acclaimed director, Hideo Kojima,Metal Gear Solid HD Collectionfor PlayStation&reg;Vita includes two of the most   popular Metal Gear Solid titles from the past in true HD. Featuring bothMetal Gear Solid 2: Sons of LibertyandMetal Gear Solid 3: Snake Eater, the HD Collection offers gamers a chance to experience the epic gameplay, design and storytelling of the MGS   franchise with all-new features including optimized controls designed to take full advantage of the Vita's touch-screen capabilities, a rebalanced user   interface, along with trophies and game-saves that can be shared via TRANSFARRING (save data sharing) with the PS3 version ofMGS HD Collection.The \"Metal Gear Solid (MGS)\" series is the seminal work of Hideo Kojima, Japan's master game creator, and the progenitor of the stealth action game   genre. With more than 31 million units sold to date, the Metal Gear series has become a global phenomenon. The player controls a secret agent from an   elite special forces unit who is sent on solo stealth missions through enemy installations, vast jungles, and sometimes even the thick of battle.   Alone and surrounded by the enemy, even a special forces agent will find it tough to come out alive. But that is the secret behind the series'   popularity-the cerebral challenge of figuring out how to avoid combat, and the thrill of sneaking through enemy territory undetected.Along with the gameplay, the MGS series is also known for its storyline, which blends seamlessly with the gameplay. The scenarios are based on   extensive research and incorporate the drama of actual developments in society. These elements have made MGS what it is today: a mature work of   entertainment that transcends national borders and the confines of video games, and one of the leading products of the Japanese content business.FeaturesTwo Epic Games in One -Featuring hours of endless fun, play through two of the treasured classics in the Metal Gear Solid universe withMetal Gear Solid 2: Sons of LibertyandMetal Gear Solid 3: Snake EaterOptimized Controls -Utilize the PS Vita's unique touch-screen controls to battle enemies while traversing the landscapesFinely Tuned Interface -Tweaked, rebalanced user interface helps maximize the users efficiencyAn Inimitable Universe- Experience some of the greatest gaming design, storytelling and presentation of all-time with the heroic Metal Gear Solid universeTransfarring- Continue your saved game no matter where you are by transferring your trophies and save-game data back and forth from your PlayStation&reg;3 and     the PlayStation&reg;VitaMETAL GEAR SOLID 2: SONS OF LIBERTYAfter the Shadow Moses incident, technological data on the nuclear-armed walking tank Metal Gear leaks onto the black market. Solid Snake and his   allies form the anti-Metal Gear NGO \"Philanthropy\" and set out in pursuit of a tanker carrying a new Metal Gear prototype. But Snake falls into a trap   set by former FOXHOUND member Ocelot, and is believed lost along with the tanker at the bottom of the Hudson River. Two years later, the Big Shell, an oil   spill cleanup facility constructed on the bay, is taken over by terrorists led by a man claiming to be the long-lost Solid Snake. The government sends   Raiden, a new recruit in the new FOXHOUND, to infiltrate the Big Shell and rescue the US President, who is held hostage inside... The underlying theme of this   second entry in the series is \"memes,\" or cultural genes.METAL GEAR SOLID 2 Accolades:\"PSM\" February issue/PSM10 Award Ranking 1st Place5th Annual AIAS (Academy of Interactive Arts &amp; Sciences) Interactive AchievementAwards /Outstanding Achievement in Sound Design\"Dengekiou\" May issue 2001 Dengekiou Game Software Grand Prix /Heat Up Award\"Dengekiou\" May issue 2001 Dengekiou Best Creator Award/Director Grand Prix\"EDGE\" May issue (Awards Special Issue) / Innovation of the Year(Britain) European Computer Trade Show AWARD/Console Game of the Year France(Germany) GAMES CONVENTION/Game of the Year Award(Germany) GAMES CONVENTION/Action Adventure Award6th Annual CESA GAME AWARDS/GAME AWARDS YEAR 2001-2002 Excellence AwardElectronic Entertainment Expo 2001/Console Game Grand PrixElectronic Entertainment Expo 2001/Best Adventure GameElectronic Entertainment Expo 2000/Best CreationElectronic Entertainment Expo 2000/Best VisualsElectronic Entertainment Expo 2000/Best Adventure GamePS AWARD02/Best Programming AwardPS AWARD02/Best Design AwardPS AWARD02/Best Planning AwardPS AWARD02/Best Sound Award\"Dengekiou\" Game Software Grand Prix 2001/Heat Up Award\"Dorimaga\" Reader Race/ \"Meiyo Meiba\" Award 20012001 E3 Game Critics Awards /Best Console Game2001 E3 Game Critics Awards /Best Action/Adventure Game2000 E3 Game Critics Awards /Special Commendation for GraphicsGame Developers Choice Awards /Excellence in AudioGame Informer.com/ Innovation of the Year awardGame Spot 2001 Game of the Year Awards /Best MusicGame Spot 2001 Game of the Year Awards /Biggest SurpriseGame Spy 2001 Game Awards /Best Action/Adventure GameGame Spy 2001 Game Awards /Reader's PS2 Game of the YearGame Spy 2001 Game Awards /Best In-Game CinematicsGame Spy.com/Best Force FeedbackIGN/Editors' Choice Award (Number 9)IGN.com Best of 2001/Best GraphicsIGN.com Best of 2001/Best SoundIGN.com Best of 2001/Best StoryMETAL GEAR SOLID 3: SNAKE EATERThe story shifts back in time to 1964, the height of the Cold War. Naked Snake-the man who would later become the legendary mercenary known as Big   Boss-heads into Soviet territory to help the scientist Sokolov defect to the West. But the mission ends in failure due to the betrayal of Snake's   mentor and mission advisor The Boss, a female soldier known as \"the Mother of Special Forces.\" The Boss defects to the Soviet Union, taking a miniature   nuclear warhead with her as a gift, which her new hosts promptly launch at a Russian research facility. Naked Snake heads once more into the Soviet   Union on a mission to kill The Boss... The third MGS game tells the story of men and women who struggle to remain loyal even while their fates are at   the mercy of the ever changing political \"scene.\"METAL GEAR SOLID 3: SNAKE EATER Accolades:9th Annual CESA Game Awards/Excellence Award8th Annual CESA Game Awards/Game Awards Future awardGaming Convention Germany/Best PS2 GameGerman \"Official PlayStation2 Magazine\" E3Awards /Best of E3US Game Site \"GameSpot\" Best of E3 2003 /Must See Movie #1US Game Site \"GameSpot\" Best of E3 2003 /Best PS2 Game Award7th Annual CESA Game Awards/Game Awards Future awardFamitsu Award 2004/Platinum Palace InductionIGN Best of 2004/Best Overall Action GameIGN Best of 2004/Best Overall StoryIGN Best of 2004/Best PS2 Use of SoundIGN Reader's Pick/Top 100 Games of All Time (Number 10)GameSpot Best of 2004/Best StoryGameSpot Best of 2004/Best Sound EffectsGameSpy Game of the Year 2004 Awards /4th Best Overall Game of 2004GameSpy Game of the Year 2004 Awards /2nd Best PS2 Game of 2004GameSpy Game of the Year 2004 Awards /Most Amazing ComebackGame Audio Network Guild 2005/Best Original Vocal Song - Pop : \"Snake Eater\"", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/51t0E1siraL._SY300_.jpg", "related": {"also_bought": ["B00G237L7Y", "B0050SW8OS", "B0050SWYTC", "B00HD4R5RW", "B007BJNR6C", "B007W8S2MG", "B0074LJ3CE", "B007VJ06Q6", "B005UDTT7C", "B0050SW1WW", "B006NYWLLI", "B0050SWR6M", "B00IPTUJ8G", "B006ZPAY46", "B00ANGVXDY", "B00F27JGVA", "B006JKASAC", "B00C7103C0", "B00CMD7574", "B003O6EATE", "B00HLT0YT0", "B00E8JZILA", "B0050SW93S", "B0050SW2NA", "B00BI9MDSO", "B002I0H09Y", "B002I0K1Y0", "B006FRMVIQ", "B006PP404Q", "B00FJWNSXK", "B006JKASCK", "B006JKARP8", "B0071NH8B8", "B005WPG6DS", "B0073ESYZO", "B002I0GZHW", "B006476318", "B007UM59AM", "B006VB2W0S", "B007FMSDUK", "B006JKARPS", "B00B7ELWAU", "B006WJ6YH6", "B007GYBTGW", "B00D7QXAY2", "B00ANGVXN4", "B00H45K6LW", "B0050SW1JK", "B0050SX0UY", "B008277M0E", "B006MO221S", "B00JFCA6V2", "B006WQR39M", "B006DS7D2G", "B006PP41Q8", "B00ICWO2CA", "B006PP4136", "B0072A4JVW", "B0050SW8AC", "B0088MVOD4", "B00IIB2K2Y", "B006FRNASG", "B00BAWXCP2", "B00HD4R5YU", "B009791CW0", "B00CD90R7M", "B00KVVO63U", "B0050SW4OC", "B00J00BLRM", "B00FZ24MZM", "B006VB2W08", "B0079V29EI", "B007H4YXJG", "B00JK00S0S", "B00JYE8L22", "B007AJZ5PY", "B0073ESZ58", "B006JKAS6G", "B00GHIPFDG", "B00EPFEUKM", "B00KVRK39A", "B00K85X1TE", "B00E4SC30O", "B00I3DOZ8O", "B00G6S2N8W", "B00H51BJBG", "B00IB8IOQU", "B00BAWXD7E", "B00DVPMVIU", "B00K5UZMFI", "B00KWFY04A", "B00G9X4YRM", "B0073ESYLS", "B0072LGI42", "B00FQCT1T8", "B006JKARZS", "B0084ZYHLQ", "B006VE40JQ"], "bought_together": ["B00HD4R5RW", "B007W8S2MG"], "buy_after_viewing": ["B007W8S2MG", "B00HD4R5RW", "B006JKASAC", "B00G237L7Y"]}, "salesRank": {"Video Games": 2049}, "categories": [["Video Games", "PlayStation Vita", "Games"]]}