{"asin": "B00387G6R8", "related": {"also_bought": ["B008I647MA", "B00DMJI9TA", "B0083J8DKE", "B00AJHDZSI", "B004XC6GJ0", "B001QUA6RA", "B002HAJQGA", "B007HIMJS4", "B00DWFPDNO", "B00C2H0YUA", "B006QB1RPY", "B009SIDMNM", "B00E3W15P0", "B0036VO632", "B007PEIHKE", "B00H09BOXQ", "B001EVGIYG", "B005SHQ644", "B0035G0J98", "B000FBK3QK", "B00006RVPW", "B005EORRBW", "B0000BVYT3", "B001S2PJO6", "B00EQWUZM6", "B007D930YO", "B0034JSYZ2", "B0055PKSG6", "B000YM4HNU", "B00A121WN6", "B009SPWJ98", "B00GE1DHNQ", "B004UBPCPI", "B00A0VCHQE", "B000N99BBC", "B000BKUSS8", "B006YG9EEW", "B005H4CDF4", "B00008AWL4", "B008JJLZ7G", "B002MZW5JU", "B00684PN54", "B00EPGKS4S", "B000VIA4CA", "B000OFXKFI", "B002HXW984", "B00B502WQ4", "B00F3ZN0CC", "B0019804U8", "B00G9BN6AA", "B000FI9VU2", "B00FK1E46U", "B008IFXQFU", "B00DTPYT78", "B0000AZK4D", "B0092TG310", "B003KP8VSK", "B000784H4K", "B003CJQ69A", "B00461G3MS", "B002QAUN2M", "B00939KKX6", "B005LDLVAO", "B004EHSV4W", "B0000AZK72", "B0007T27H8", "B003VANO7C", "B002K0TU2C", "B0033Z2BAQ", "B002UVNW5W", "B009K1PYG0", "B002SZEOLG", "B00008AWL3", "B005UWD0EG", "B004LT6O56", "B009CPC6QA", "B00BS92DCK", "B001CY0P7G", "B0092ML1SC", "B004GHMU5G", "B0066DV06I", "B003BU0EKW", "B00BQ8RM1A", "B0049KV52E", "B007B5YUMQ", "B008X3JHJQ", "B00E3RH5W2", "B00939KFOU", "B007SJGGAE", "B005CT56R6", "B00KFAGCWK", "1587143852", "B003MTTJOY", "B007VP83BU", "B00BQ4F9ZA", "B001PS9E5I", "B000QZ3UG0", "B004I5UDO6", "B000I97FHY", "B008ABOJKS"], "bought_together": ["B008I647MA"], "buy_after_viewing": ["B006QB1RPY", "B0049YQVHE", "B00FK1E46U", "B00AJHDZSI"]}, "title": "ASUS (RT-N16) Wireless-N 300 Maximum Performance single band Gaming Router: Fast Gigabit Ethernet, support USB-Hard Drive and Printer and Open source DDWRT", "price": 84.95, "salesRank": {"Electronics": 1060}, "imUrl": "http://ecx.images-amazon.com/images/I/41igL5wjgYL._SX300_.jpg", "brand": "Asus", "categories": [["Electronics", "Computers & Accessories", "Routers"]], "description": "Wireless N Surfing, Scanning, and Printing All with One RouterASUS RT-N16 provides users with high performance wireless N connectivity, lightning fast Gigabit Ethernet, and incredible versatility. Whether you choose to use is as a print server, BitTorrent hub, FTP storage, ultra-fast Wireless N router, or all of the above at the same time, it's an all-in-one router you'll wonder how you used to manage without it.Right out of  the box, the RT-N16 gets you up and running in only five clicks through its  simple 3-step CD-free installation. And thanks to its streamlined EZ Quality of  Service (EZQoS), you can effortlessly optimize bandwidth for gaming, video  calls, downloading or whatever else you choose. Download Master is a BitTorrent  client that shifts download duties from the PC directly to the router-attached  storage via the two onboard USB ports. This allows you to download and share  files wherever you have Internet access without going through a PC. For even  more convenience, &nbsp;ASUS AiDisk transforms  a connected USB device into an FTP server for remote transfers. Plugging in a  USB All-in-One printer, you can share both printer and scanner functions  between all networked PCs.The ASUS RT-N16  also features 300Mbps throughout on a 2.4GHz wireless band, four standard  10/100/1000 LAN Ethernet ports, and one inbound Ethernet port.&nbsp;Key FeaturesSleek wireless N (300Mbps) routerdelivers up to 14x faster speeds and 6x farther range than 802.11g routers1(Learn more)Gigabit Ethernet for high performance LAN networkingEZ User Interface (EZ UI) with a simple 3-step setupgets you up and running within minutes(Learn more)EZ Quality of Service (EZQoS) Bandwidth Management givesyou a simple way to optimize Internet speeds for gaming, browsing, file sharing, and VoIP/ media streaming (Learn more)Built-in printer serverfor sharing All-in-One USB printers within your home or office (Learn more)EZ Switchlets you quickly enable router, repeater, or AP modes directly with a flip of a switchAiDiskis your personal FTP server that you can access anywhere you have the Internet (Learn more)Download Masterlets you download from the Bit Torrent site to the connected USB storage device directly thru the router without having to leave your PC on (Learn more)Learn MoreFaster Transfers. Wider Coverage.View largerExperience up to 14x faster Internet and up to 6x wider connection ranges compared to previous generation wireless G routers with the ASUS RT-N16 wireless N router.1Whether you're streaming HD video or video chatting with a friend, wireless N connectivity lets you do more faster. And where other routers fail to connect when placed far away, the RT-N16 router gives you the wireless freedom to roam even further and enjoy high-speed networking nearly anywhere in your home or office.  Get bandwidth on demand with EZ Quality of Service (EZQoS) to dynamically set Internet speed priority for browsing, online games, Internet applications (such as Bit Torrent), and voice/video streaming. The EZQoS is simplified for ease of use &ndash; just click on the image you want to set and it adjusts instantly.Easy, Quick Setup in a User-Friendly InterfaceView largerThe RT-N16 features EZ UI, a simplified user interface for quick setup, access to Internet-enhancing utilities, and a helpful troubleshoot guide that users at all levels will appreciate.Quick 3-Step Internet SetupThe moment you connect the RT-N16 you will automatically be guided through an easy 3-step, manual-free setup.1.  Plug the router in your network and wall socket2.  Complete the installation wizard3. Open your favorite browser and start surfingYour Entire Network in One PictureView largerWithin the EZ UI, you can see your entire network all at once with real-time status updates for each connection. This simplified network map makes it easy to check for any issues with connections to other PCs or printers and manage your network settings.Your Personal All-in-One Print ServerView largerPrint, scan, and share directly from connected USB printer, scanners, and storage devices via the RT-N16's USB port. With the wireless printer server function built into the RT-N16, you can centralize your printing and scanning for your entire home or office network into one location.For a current printer support list,  please clickhere.The Ultra Versatile Download MasterView largerThe RT-N16 router sets itself apart from ordinary routers by offering Bit Torrent and FTP server functionalities.BitTorrentShare your  movies, music, games, and other files with the  included Download Master application that utilizes the BitTorrent P2P protocol for  downloading and seeding Torrents to and from the connected USB storage device. What&rsquo;s  more, you can shut off your PC after setting up a torrent file to continue the  download, PC-free. Download Master also lets you customize how you choose to  share with custom bandwidth allocations when seeding.FTPCreate your own personal FTP Server with ASUS AiDisk located within the EZ UI, and upload or download files from the connected USB storage device to any Internet-accessible PCs. Perfect when you forget documents at home or when sharing large files, FTP access grants you the ability to safely secure and access your treasured data through your router. This feature can also work without having to leave your PC on.What's in the BoxRT-N16 routerEthernet CableApplication CDPower Adapter (12V 1.25A)Quick Starter GuideSetup GuideWarranty Information CardSpecificationsEthernet Port:WAN: 1 x RJ45 for 10/100/1000 Base T; LAN: 4 x RJ45 for 10/100/1000 Base T; Support 802.3 with max bit rate 10/100/1000Mbps, support auto cross-over function (MDI-X)Host Processor:CPU: BCM4718; FLASH: 32MB; DDR2: 128MBUSB:2 x USB 2.0 portsAntenna:3 x external antennaPower Adapter:AC inputL 100V ~ 240V (50~60Hz)Operating Frequency:2.4GHzData Range:802.11n Draft: up to 300Mbps ; 802.11g: 6, 9, 12, 18, 24, 36, 48, 54Mbps; 802.11b: 1, 2, 5.5, 11MbpsOutput Power:15~17dBm (g mode), 17~19dBm (b mode), 12~17dBm(n mode)Encryption and Authentication:Supports Open System, Shared Key, 64/128-bit WEP, WPA-Personal, WPA2 Personal, WPA-Auto-Personal, WPA-Enterprise, WPA2-Enterprise, WPA-Auto-Enterprise,  Radius with 802.1x&copy; 2010 ASUS Computer International. All specifications and terms are subject to change without notice. Please check with your supplier for exact offers on selected models. Products may not be available in all markets. Product may not be exactly as shown in photos. (1) Maximum wireless signal rate derived from IEEE Standard 802.11g and draft 802.11n specifications. Actual data throughput will vary. Network conditions and environmental factors, including volume of network traffic, buildings materials and construction, and network overhead, lower actual data throughput rate. Environmental factors will adversely affect wireless signal range. Wireless range and speed rates are relative performance measurements based on the wireless range and speed rates of a standard Wireless G product. Maximum throughput based on draft 802.11n devices.Check Out Other Great ASUS ProductsASUS USB-N13 Wireless-N AdapterAdd a speedy Wireless N 300Mbps connection to your PC with this USB wireless-N adapter. It is quick to setup and has the benefits of wireless N's extended range for staying connected further than a wireless-G adapter.ASUS PCE-N13 - Wireless N PCI-Express AdapterAdd a wireless-N PCI-Express adapter to your desktop and the blazing fast speed of your network without wires. This versatile adapter can also be made into a wirelss Access Point for sharing Internet connection with other PC's.ASUS TS Mini SOHO Server (500GB Storage)The new ASUS Small Office Home Office (SOHO) Server TS mini helps you centralize your files to improve data management, enhance media streaming, and better utilize home networks. The 500GB version offers 500GB of internal storage, 500GB of ASUS WebStorage and much more.ASUS O!Play Air - Wireless N TV HD Media PlayerThe ASUS O!Play Air takes multimedia enjoyment to the next level with wireless 802.11n support. Access your favorite music, movie, and photo collection from the attached storage devices, or stream them right from the HTPC, media servers or home PCs on your network."}