{"asin": "B000XJNTNS", "description": "Drivers, start your engines!Nintendo is bringing Mario and his friends with their finely tuned racing machines back and this time to the Nintendo Wii. With 3 different control styles and a Wii Wheel included in the box,Mario Kart Wiiis bound to be the best in the series. The worldwide race is on with a whole new set of tricks, tracks, and ways to play! Place first in Grand Prix circuits or clear skill-based missions.Mario Kart Wiidraws on courses and battle arenas from every game in the series ? not to mention tons of new ones ? the true king of the Mushroom Kingdom racing circuits will finally be crowned.Wii Wheel Included!New Intense Tracks and TricksView larger.Cool new car designsView larger.Mario and his friends are back and ready to race once again inMario Kart Wii! Experience new tracks, enhanced Wii graphics, extraordinary gameplay and much more! Place first in Grand Prix circuits or clear skill-based missions to open up increasingly difficult and thrilling circuits. Players can have multiplayer races on any open courses or battle in arenas. Also included withMario Kart Wiiis the Wii Wheel! Now you can feel like your Mario and steering to avoid obstacles and doing incredible stunts - in the safety of your home of course.Game Features:The Wii Wheel transforms the Wii Remote&trade; controller into a steering wheel that feels natural in anyone's hands, while the Wii Remote and Nunchuk&trade; controller offer a classic control style for theMario Kartveteran. In either configuration, players can perform speed-boosting tricks with a shake of the Wii Remote.Players can race as their favorite Nintendo character, or even as themselves!Mario Kart Wiilets players race with their personalized Mii&trade; characters. And racers will see other Mii characters they have created cheering from the sidelines on some race courses.Players can compete with up to three friends in their living room. Or challenge up to 11 opponents via Nintendo Wi-Fi Connection in the biggestMario Kartrace yet. All tracks and modes of play are available via Nintendo Wi-Fi Connection, and players can visit theMario KartChannel to compete in tournaments, check rankings, see when their friends are playing and download ghost data.Cruise new tracks and arenas or tour classic courses fromSuper Mario Kart&trade;, Mario Kart&reg; 64, Mario Kart&reg;: Super Circuit&trade;, Mario Kart&reg;: Double Dash!!&trade;andMario Kart&reg; DS. Tired of riding on four wheels? Bust out one of the new motorbikes for special tricks and techniques.CharactersNintendo favorites Mario&trade;, Luigi&trade;, Peach&trade;, Yoshi&reg;, Donkey Kong&reg;, Wario&trade;, Bowser&trade; and Toad&trade;, plus a host of new faces-including your own! Get into the game and put your Mii&trade; character behind the wheel.Special Powers/Weapons/Moves/FeaturesWhether racing around an obstacle-filled track or battling in an arena, drifting and tossing items are the keys toMario Kartsuccess. Players can shake the Wii Remote while launching off a ramp to pull off a trick that will temporarily boost their speed. When riding a bike, players can gain additional speed by flicking the Wii Remote up and popping a wheelieNintendo Wi-Fi Connection:Keeping in the tradition ofMario Kart, Nintendo has pushed multiplayer racingeven further utilizing the Wii's built in Wi-Fi Connection. There are two options for races and battles over Nintendo Wi-Fi Connection: up to 12 people via Nintendo Wi-Fi Connection or up to 10 people via Nintendo Wi-Fi Connection with two people playing locally.", "price": 32.73, "imUrl": "http://ecx.images-amazon.com/images/I/51PYW1FCetL._SY300_.jpg", "related": {"also_bought": ["B0013B30SY", "B001PO2BJI", "B002B7E3B2", "B004WLRQ2S", "B002BRZ9G0", "B002RD2WJ0", "B0041JR3VK", "B000IMWK2G", "B002MGPAKU", "B002672Z80", "B0017Q4DGI", "B000FQ9QVI", "B0094X28J0", "B0009VXBAQ", "B003ZHMMEM", "B004M8K9AW", "B002BSA388", "B005FYJA52", "B009M72E5Q", "B000LSJKAM", "B0094X2066", "B00AFYAUYW", "B0026IUSXI", "B004C34D2M", "B004W1IX1G", "B000R3BNDI", "B00D7UHT0E", "B00AX5CCV2", "B0045FGET2", "B002D2Y3IS", "B0045F8QD4", "B002MWSY3O", "B000NNDN1M", "B002GEKIOG", "B002BH3N2W", "B0013E9HP6", "B004WLRR4K", "B004EI1RZG", "B0011V2HR6", "B0050SVGU0", "B000SFK0PW", "B0094X227I", "B0053BG26C", "B004ZWPBWG", "B001GIUWX0", "B000W5Y49G", "B00FLYZ7NU", "B000QD7BBM", "B003X1R29K", "B0013OL0BK", "B004IK24MU", "B000R3BNE2", "B0086V5UF0", "B00FLYZIM0", "0761559701", "B0045FCKVI", "B0094X1ZXU", "B00293IKQC", "B002MQLPJ0", "B0050SVHRC", "B001DTVKF6", "B002HT63TE", "B007VIYQVI", "B000KRXAGE", "B000OAO188", "B0094X221O", "B001APM444", "B001COQW14", "B00AXI9WEE", "B001U2BMH2", "B005QWYKOE", "B0058SHMXM", "B003O6FV8S", "B000GEDN5E", "B0050SVGXM", "B002I08DQI", "B0094X20IO", "B006ZPAYB4", "B001DO3NEW", "B000N60GPK", "B00DC7G2W8", "B001SIFNXW", "B003Q5J4NU", "B002BS47JE", "B00G0OYHCW", "B000ZKBJYG", "B004XV9EWW", "B002HOVOXO", "B0088I8M10", "B005IGPY48", "B003WOFXEY", "B0041TBNBQ", "B002I0IIPY", "B00D6NPFDK", "B005FCZHZQ", "B0041TD3O6", "B001TOQ8NO"], "bought_together": ["B001PO2BJI", "B002BRZ9G0"], "buy_after_viewing": ["B001GIUWX0", "B001PO2BJI", "B00DC7G2W8", "B002MGPAKU"]}, "salesRank": {"Video Games": 1772}, "categories": [["Video Games", "Kids & Family", "Wii", "Games"], ["Video Games", "Wii", "Games"]]}