{"asin": "B002VAWXO8", "description": "The eighth game in theMLB 2Kseries,MLB 2K10celebrates the immortal battle on the baseball diamond between pitcher and batter. Featuring a combination of an extensive updating of features from earlier games in the series, alongside a range of new play options designed to heighten the experience of both the player on the mound and at the plate,MLB 2K10is a baseball gaming experience not to be missed. Additional features include, new pitch selection and batter's swing functionality, multiple game modes &#151; including franchise and career modes &#151; and a variety of multiplayer options..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Raise your stats in the box with Batter's Eye technology .View larger.Dominate on the mound with improved via Insider Edge stats.View larger.Cue fielding and basepad actions.View larger.Multiple modes and gameplay options.View larger.Better Pitching Through AnalyticsAs in the previous release in theMLB 2Kseries, pitching inMLB 2K10requires a combination of analysis of scouting reports and hurling technique on the mound. Scouting reports are based on 2K Games' exclusive \"Inside Edge\" data service, which provides up-to-date information on AI representations of real batters across a wide range of data points. With this players can make an educated guess as to their best chances using particular pitches against a particular batter based on everything from the current count, whether it is a night or day game, to how far into the season it is. Pitching technique is centered around a gesture pitching mechanism, where in players deliver pitches through specific controller inputs using face buttons and/or the analog stick. With regards to this, the difference this time around is that in addition to these enacting inputs,MLB 2K10incorporates a push button pitch selection system. Players must still input the correct series of gestures for the pitch they intend, which are more difficult for more complex pitches, but this new push button step also provides the game with precise information as to what pitch you intend to throw. With is extra information, which the game uses as a baseline for compiling analytics, players can see where their gestures for particular pitches are off, and correct them as need be.An Improved Hitting Experience with \"Batter's Eye\"Players' experience at the plate has also been improved inMLB 2K10through a combination of data and new features. Just as with pitchers, batters have access to 2K Sports' \"Insider Edge\" data to help them make better decisions in specific game situations based on a variety of stats related to themselves if playing as a representative of a real MLB player, or the pitcher they face. But the new feature that completely changes the batters experience in \"Batter's Eye.\" With this, highly skilled batters can get occasional, spilt second views of what the pitch is going to be. Used in conjunction with new batting functionality like defensive and contact swings, batters can potentially fend off pitches until the count is in their favor, and/or they are ready to make an educated guess at what the pitch is going to be and swing accordingly. As with the pitching analytics available in defensive positions, offensive players have access to a batting analyzer at the push of a button to figure out what they are doing wrong and right at the plate.Fielding and BaserunningOf course baseball isn't just about initial conflict between pitcher and hitter, soMLB 2K10gives you all you need to finish the play from any place on the field. Fielding and baserunning inMLB 2K10features easy controls and tons of great animations just as in earlier releases, but in this most recent version players can also now cue up the actions of their players while on defense, or from the basepads with simple controller inputs. In the case of fielders, once the defensive player is selected, simply press the face button for the appropriate base or cutoff man you want. Once your man makes the stop, he will throw to your chosen spot automatically. This is a big help, especially when trying to turn a quick double play, or in the case of a ball that makes it all the way to the wall. Cueing up the actions of base runners is just as easy. For example, in the event of a full count where you want to send your runners regardless of the pitch, or during a steal attempt, simply select your base runner(s) and use your game controller's trigger to set events in motion. If you change your mind you can just as easily send them scrambling back with a the same trigger.Key Game FeaturesTotal Control Pitching&ndash; Based on each pitcher&rsquo;s mechanics and official scouting reports, Total Control Pitching lets you put the ball exactly where you want it&ndash;provided you keep a close eye on your pitch count.Total Control Hitting&ndash; With Total Control Hitting you can time your swing to hit for power, put the ball in play or take a defensive cut. Batter&rsquo;s Eye uses a hitter&rsquo;s real-life eye rating to help you identify fastballs, breaking balls and off speed pitches before they get to the plate.Play Like the Best&ndash; True-to-life player rating system, signature styles and a new motion model ensure every pitch, swing, catch, throw, steal and slide looks and feels like you&rsquo;re at the ballpark.Updated Franchise Mode- Improve your team from the warm days of spring training to the chill of the October Classic, with the option to jump into online leagues whenever you choose.Become a Living Legend in My Player Mode&ndash; With My Player Mode you can create a player, choose your team and then play your way into the Hall of Fame.Hurry-Up Baseball- Skip all the cutscenes, animations, replays and commentary between plays with the push of a button, making for a quicker game.Authentic Presentation with MLB Today&ndash; MLB Today delivers real-time scores, standings, news and stats to ensure timely commentary that reflects what&rsquo;s actually going on in the Majors.Inside Edge Stats&ndash; Use Inside Edge to scout players, assess strengths, weaknesses and tendencies, and then exploit them to get the upper hand.Up-to-date Commentary- Enjoy up-to-date analysis and color commentary by Gary Thorne, Steve Phillips and now John Kruk.", "price": 21.14, "imUrl": "http://ecx.images-amazon.com/images/I/51g7%2BTi6kzL._SY300_.jpg", "related": {"also_bought": ["B001LX4BMI", "B002C7TFJQ", "B004CDGG4U", "B00118T6G4", "B001UU1WTC", "B003IMGC2C", "B0025KZV84", "B003HF4QIM", "B002I0JB6E", "B000M5KPYY", "B00386ZE6I", "B001S86IRW", "B000LXNJPE", "B003O6EAM6", "B004WL4LWQ", "B004P8GL60", "B000E260LM", "B00647630Y", "B002I0JK38", "B002BCXALQ", "B001D7T2XA", "B0012N5MUC", "B003KZOXZ0", "B000P0XA3O", "B007M6W38W", "B001R3UX4M", "B001AZ7RLE", "B00386VN0E", "B006VB2UO6", "B002DC8GMW", "B0050GGW60", "B000GJTAVK", "B0018421C2", "B0048C8VKM", "B000P0QJQO", "B000TGB4QO", "B000FDOTN6", "B0036EBAHY", "B0015E4G4G", "B006VB2UNM", "B003LDKHZ6", "B00ARCWQOO", "B002BSA2LQ", "B000QMUZES", "B000GE8OYE", "B001B0BB3S", "B001B0BB56", "B003ZSP0WW", "B003O6N2NY", "B000P0QJD2", "B000GPXS7Q", "B002BCOC3G", "B0014FMHE2", "B000FRVCAA", "B001AZ7RK0", "B000FW8FK0", "B007YZ5QQM", "B00075GLUG", "B005GSRCZ2", "B0013FWZGI", "B001M5RRO4", "B000QMUZAM", "B000HWX44U", "B007FTE33O", "B000XUPBEW", "B000RI17GG", "B0038N9WPU", "B006D3JWR0", "B0009WPZNG", "B00D9EPI38", "B002WEZ1GA", "B000B6ML28", "B00DWXV1DM", "B00164TDUC", "B002WSR8DA", "B00AY1CT4U", "B003O6JKLC", "B0017HPE7E", "B0009WPZMC"], "bought_together": ["B002C7TFJQ", "B003IMGC2C"], "buy_after_viewing": ["B004CDGG4U", "B00647630Y", "B00ARCWQOO", "B00118T6G4"]}, "salesRank": {"Video Games": 4046}, "categories": [["Video Games", "Kids & Family", "Xbox 360", "Games"], ["Video Games", "Xbox 360", "Games"]]}