{"asin": "B000066TS5", "description": "Ever wondered what would happen if the worlds ofFinal Fantasyand Disney collided? It&#x92;s an odd concept to be sure, but from the most schizophrenic of acorns the mighty gaming oak ofKingdom Heartshas grown. Legendary role-playing game makers Square have been given unprecedented liberties with the entire Disney universe and have created a game featuring everything fromThe Nightmare Before ChristmastoThe Little Mermaid. This is odd enough in itself when you have characters as disparate as Tarzan and Donald Duck teaming up, but becomes majorly freaky when Square thrown in a variety of their own characters such as Cloud, Squall, and Aeris from the variousFinal Fantasygames. But this incongruity has one side benefit in that the storyline behind the game is by necessity rather vague, which seems to have stopped Square from filling three CDs full of their usual New Age whining about Mother Earth. Instead they&#x92;ve spent even more time on the graphics, and the end result is a quite stunning 3-D cartoon.As for the gameplay, it may come as a surprise to learn that it doesn&#x92;t actually feature, as all theFinal Fantasygames do, turn-based combat. Instead it's essentially a scrolling beat-'em-up-cum-platformer with exactly the kind of complicated Square-style knobs you&#x92;d expect. The game may be a little shallow, but it&#x92;s an impressive artistic achievement and to be quite frank any title that allows you to magically summon Bambi out of thin air to attack evil demons of the underworld has got to be worth some sort of recommendation.--David Jenkins", "price": 52.5, "imUrl": "http://ecx.images-amazon.com/images/I/51MtbYNRAiL._SY300_.jpg", "related": {"also_bought": ["B0009A4EVM", "B001G3B0HC", "B000TLU67W", "B001MW91IW", "B00004YRQA", "B0000C7GHG", "0744001986", "9629971372", "B00005R5PO", "B0013KW1B2", "B00004YRQ9", "B000WE8JES", "B0013JHKU0", "B0000690ZE", "0744005264", "B000GACEHQ", "B000IZAQD8", "B0002Y2XXQ", "B002DGG9KY", "B00000I1BR", "B00005MDZ8", "B00006F2EP", "B0045L3SNQ", "B000TYQL1O", "B0032GTMEE", "B0002EJ8FC", "B0009IB6KQ", "B00005NUJ3", "B001UIG6M2", "B00000DMAR", "B006OI3CTS", "B0007KTBB2", "B00004U8QX", "B002J9QIWY", "B0009F3E1I", "B00006FWUU", "B0032GPYO6", "B00005MA97", "B00004TNB0", "B00067MX98", "B00005MDZD", "B00005U8TQ", "B00006F2ZP", "B000CFWHPY", "B000SEU92W", "B0000AHRPM", "B00004U4R9", "B008SBZD5U", "B0045WL026", "B0015MMN6G", "B004S3KB6S", "B003V8E2O8", "B0038N09Q6", "B002ZQDAVI"], "bought_together": ["B0009A4EVM", "B001G3B0HC"], "buy_after_viewing": ["B0009A4EVM", "B008SBZD5U", "B001MW91IW", "B0013KW1B2"]}, "salesRank": {"Video Games": 532}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "More Systems", "PlayStation 2"]]}