{"asin": "B000GUHOYE", "related": {"also_bought": ["B0012YXF1O", "B00008Y0U5", "B00006RH5I", "B006YTQ9KQ", "B0000665V1", "B0000665V6", "B0007UQNV8", "B000237C9M", "B006YTQ7B2", "B0000665V7", "B0002379UO", "B0040H2LWE", "B006ZN4VE2", "B003VL8D2M", "B006YTQBEU", "B00006LSVL", "B0006O4DR6", "B0000665V4", "B004KMC0UC", "B0000665V5", "155407147X", "B00009X3V8", "B00009X3UV", "B000KNCB7C", "B0000665UZ", "B000TGVA90", "1852337141", "B00893PX66", "B00008Y0TM", "B0048JJH5S", "B0006NAS7G", "B00008Y0TP", "B00009X3VA", "B006YTQ4SI", "B0007T27H8", "B0007UQNWW", "B00425S1H8", "B00EB7812C", "0521153972", "B007B9NV8Q"], "bought_together": ["B0012YXF1O", "B00006RH5I"], "buy_after_viewing": ["B0012YXF1O", "B00006RH5I", "B000GUKTDM", "B000GUFOBO"]}, "title": "Celestron NexStar 5 SE Telescope", "price": 699.0, "salesRank": {"Camera &amp; Photo": 2267}, "imUrl": "http://ecx.images-amazon.com/images/I/41X1xKrViuL._SY300_.jpg", "brand": "Celestron", "categories": [["Electronics", "Camera & Photo", "Binoculars & Scopes", "Telescopes", "Catadioptric"]], "description": "Celestron's NexStar 5 SE computerized telescope combines excellent optics and easy computerized GoTo tracking in a convenient portable size. The standard equipment tripod and mount feature easy no-tool setup, and the package even includes a student version of \"The Sky\" planetarium software for your computer.The excellent optics of Celestron's classic C5 Schmidt-Cassegrain telescope have been updated with premium Starbright XLT optical coatings. This telescope consistently delivers crisp, high contrast views of the moon, the planets, and brighter deep space objects. The standard equipment 25mm plossl eyepiece produces a magnification of 50x, powerful enough to show the rings of Saturn, the cloud bands of Jupiter, and the changing face of the Lunar disk. Optional eyepieces can be added to bring out significantly more detail. I like to use a12.5mm plossl(100x magnification) or a7.5mm Ultrascopiceyepiece (166x) for high power views of the planets. With the 7.5mm Ultrascopic eyepiece I can usually see the Cassini Division in Saturn's rings and cloud bands on the planet itself. I like to use a32mm plossleyepiece for great low power views of deep space highlights like the Orion Nebula or the Double Cluster in Perseus.The NexStar 5 SE package also includes a sturdy adjustable tripod, a motorized alt-azimuth mount, and the NexStar hand held computer controller. You won't need a GPS receiver or star charts to operate this telescope. The SkyAlign procedure is easy to use, and experienced observers will like the two-star align and solar-system align options because they are even quicker to set up. The steel tripod and alt-azimuth mount provide a solid base for the NexStar 5 SE. Vibration is not a problem, even while focusing at high power. The computerized tracking is also very good, easily keeping planets in the field of a high power eyepiece. The disadvantage of a computerized telescope, of course, is battery consumption. I like to use a rechargeableCelestron Power Tankbecause the standard AA alkaline batteries only last a few hours.This telescope is perfect for visual observing, and allowed me to capture some sweet images of the moon and planets using aCelestron NexImageweb-cam. For long exposure deep space photography, however, I'd take a look at Celestron's Advanced Series equatorial telescopes such as theC6 N-GT--Jeff PhillipsPros:Excellent opticsLight and portableComputerized GoTo trackingCons:Short battery lifeToo light for deep space photographySuggested Options:Celestron Nine-Piece Accessory KitCelestron Power Tank BatteryCelestron NexImage Webcam"}