{"asin": "B0035FZJM6", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Decidedly slim and sleekly refined, the PowerShot SX210 IS packs a feature set that reads like a wish list. The 14.1-megapixel CCD joins a 14x 28mm wide-angle zoom for imaging power to spare. Frame your shots in the bright 3.0-inch widescreen PureColor System LCD, with the Low Light mode for sharp images in dimly-lit situations.It also captures stunning HD movies with Dynamic mode for enhanced image stabilization when shooting movies using wide-angle settings. Capture smooth HD video (720p) with stereo sound for a truly natural, high quality HD experience. The PowerShot SX210 IS not only goes wherever you do, but takes your photography and video to a whole new place, too.PowerShot SX210IS HighlightsPowerful 14x optical zoom with Optical Image StabilizerWith the PowerShot SX210 IS's powerful 14x optical zoom, you'll get up-close fast, handy at sports and school events as well as everyday creative shooting. And with Optical Image Stabilizer, camera shake is greatly reduced even when shooting while walking, helping to ensure clarity and acuity in all your images.Improved Dynamic mode for enhanced image stabilizationCanon technology helps to ensure your high definition movies are as shake-free as your stills. When shooting movies at wide-angle settings, the PowerShot SX210 IS uses the advanced Dynamic mode to greatly reduce camera shake that can occur when you are shooting while walking. Your HD movies play back steadily and without jerky movement.14.1-megapixel resolution will generate 16.5 x 23.4-inch printsFor all its easy operability, the PowerShot SX210 IS nevertheless has a formidable feature set. 14.1-megapixel resolution delivers a wealth of detail to every image, and allows you to crop and enlarge any portion of your shot freely, up to poster-sized 16.5 x 23.4-inch prints.28mm wide-angle lens to capture more in your frameThe 28mm wide-angle lens captures more in every frame, and gives your photography more flexibility. Everyone fits in a family gathering shot. You'll capture more image in every shot, and add greater depth to your overall photography.3.0-inch wide PureColor System LCDThe PowerShot SX210 IS's high resolution (230,400 dots) 3.0-inch wide PureColor System LCD gives you the big picture, whether you're shooting, reviewing or showing off your images. This high-resolution screen offers a crisp, clear picture to make shooting, playback and using the camera's menu functions especially convenient. Clear and bright, it features Night Display for easy viewing in low light.HD shooting capability at 720p with stereo sound plus HDMI outputThe PowerShot SX210 IS lets you record video in beautiful high definition (1280 x 720 pixels). The camera also makes it easy to enjoy HD movies (and still photos) on your HDTV with a mini-HDMI connector for direct connection to a high-definition TV monitor. You'll enjoy the HD experience with no degradation of image or audio in the signal, plus the ability to display up to 130 still images at once.The PowerShot SX210 IS also includes spectacular movie functionality. With the Movie button, simply push and you can start shooting video and never miss the perfect moment. When shooting movies, you can get up close with the 14x optical zoom for riveting detail and realism, from the overall appearance to facial expressions! And the camera's Smart AUTO technology that helps ensure the perfect still image works to bring that same quality to your movies.DIGIC 4 Image Processor with evolved Face Detection TechnologyCanon's most advanced image processor, DIGIC 4, delivers evolved Face Detection Technology that keeps every face in every photo looking its very best. The technology finds and tracks the faces of moving subjects until you're ready to shoot, then delivers perfect focus. In addition, exposure, flash and white balance are compensated, so that faces exhibit natural skin tones and backgrounds are properly exposed.iSAPS Technologyis an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the advanced DIGIC 4 Image Processor to improve focus speed and accuracy, as well as exposure and white balance.Face Detection Self-timerautomatically detects an increase in the number of faces and makes the appropriate adjustments. For instance, to include the photographer's face in a group shot, there's no need to rush in. Just put the camera on a stand or tripod, specify Face Detection Self-timer, and the camera will wait for the photographer's face to get on-camera before it takes the shot. Motion Detection tracks moving subjects in a much larger range, and the Servo AF retains focus on a moving subject after the shutter button is pressed halfway--allowing you to wait for the perfect shot without refocusing.Intelligent Contrast CorrectionDIGIC 4 also makes possible the i-Contrast (Intelligent Contrast Correction) system, which controls the compensation level in pixel units to brighten dark areas while leaving bright areas unchanged for better images where the main subject is dark, and more natural transition. The PowerShot SX210 IS can even use i-Contrast in playback mode to adjust images that were shot without the setting activated.Red-eye Correctionprovides three options for removing red-eye from subjects in flash pictures.1) Red-eye Correction during shooting actually identifies and corrects red-eye in human subjects as pictures are taken.2) The PowerShot SX210 IS can be set to automatically detect and correct red-eye during image playback.3) You can manually locate any red eyes in a scene during image playback on the LCD screen, and command the camera to remove them.Life doesn't give you second chances to capture special times. That's why the PowerShot SX210 IS features an ISO 1600 setting that reduces the effects of camera shake and sharpens subjects in low-light situations, giving you greater shooting flexibility. ISO can be expanded up to 6400 when you select Low Light mode.New scene modes for more creative shootingThe Canon PowerShot SX210 IS offers creative effects similar to those found in professional lenses. Miniature Effect creates an illusion where very large objects appear in miniature proportions. Turn soaring cityscapes into a scene in seemingly dollhouse-like proportions.Fisheye Effectuses barrel distortion to warp the image around the center, giving a distinctive curvature effect to the photo. The curvilinear images produced by Fisheye Effect can suggest the curve of the Earth, the inside of a dome, or the image you see through the peephole of a door.With an ISO of 400-6400, the Low Light mode takes the Canon PowerShot SX210 IS bravely into the shadows--literally! Now even scenes notorious for having insufficient light, such as those lit by candles, fire, or street lamp, come through in fantastic color and clarity, with less noise. You can keep the feel of the scene intact without adding additional light, so the result will be scenes with the visual accuracy, depth and clarity you expect from a Canon camera.The Canon PowerShot SX210 IS also has Smart Shutter technology, which detects faces in the scene and releases the shutter automatically in response to the appearance of an additional face, or when a smile or sassy wink occurs. These technologies help to make your photography less rushed and more natural, so getting the perfect shot is even easier.Smart AUTO mode intelligently selects from 22 settingsJust set the Canon PowerShot SX210 IS to Smart AUTO and you're ready for maximum enjoyment from your picture taking every time. It's a relaxing and satisfying way to shoot because you can completely concentrate on your subject knowing that the camera has the technical details covered. Advanced Canon technology intelligently analyzes your situation and shooting conditions. Then it automatically selects an appropriate setting from 22 specially defined settings. So whether you're photographing flowers, a captivating sunset, or your friends at the park, you can be confident that you're getting dramatic, memorable images.Shooting ModesAdvanced presets for the best possible photos under certain conditions. With 12 Shooting Modes plus 11 Special Scene Modes, you're ready for whatever shot comes your way.Servo AF/AE continues to focus and track subjectIn PowerShot SX210 IS's Servo AF mode, Auto Exposure (AE) functionality is linked to the Auto Focus (AF) frame, creating a sophisticated Servo AF/AE that delivers sharp focus and proper exposure of subjects on the move.Now you can wait for the shot you want, with no need to reframe and refocus. With the shutter button pressed halfway, Servo AF/AE will continue to focus and track your subject as the moment you want to capture approaches. Press the shutter fully, and you've got your shot--with tight focus and perfectly calibrated exposure.Smart Flash ExposureSmart Flash Exposure is a technology that can produce excellent flash exposures across a wide range of conditions, and helps ensure against over- or under-exposed images. The detail and color of your photo remain intact and truer to life even in challenging lighting.What's in the BoxPowerShot SX210 IS BodyLithium-ion Battery Pack NB-5LBattery Charger CB-2LXWrist Strap WS-DC9Digital Camera Solution CD-ROMUSB Interface Cable IFC-400PCUAV Cable AVC-DC400ST", "title": "Canon PowerShot SX210IS 14.1 MP Digital Camera with 14x Wide Angle Optical Image Stabilized Zoom and 3.0-Inch LCD - Black", "price": 17.12, "salesRank": {"Camera &amp; Photo": 1737}, "imUrl": "http://ecx.images-amazon.com/images/I/410qYKCsBjL._SX300_.jpg", "related": {"also_bought": ["B000M3LSOM", "B001V9KG0I", "B003CQB37S", "B003Y0ND20", "B0049XEE88", "B003VNKNEQ", "B0073HSHJY", "B0033VKKB2", "B005MM3WTC"], "buy_after_viewing": ["B003VNKNF0", "B003VNKNEQ", "B0075SUK14", "B000EVS4YE"]}}