{"asin": "B002MRRU6G", "categories": [["Electronics", "Television & Video", "Streaming Media Players"]], "description": "The FreeAgent DockStar network adapter allows you to share your digital life with anyone, anywhere. Dock a FreeAgent Go drive or connect a USB storage device to the FreeAgent DockStar network adapter and your content will be accessible by any networked computer in your home. Following service activation, access content on your FreeAgent DockStar network adapter remotely through a clean web-based interface and invite friends to view your files or upload theirs. Simply type in their email addresses and they will receive an email linked to the folders you chose to share with them through your FreeAgent DockStar network adapter. Integrate with your favorite social media sites and keep your friends in the loop with easy-to-publish RSS feeds.HighlightsFile sharing at its simplest with a clean, modern web-based interface.Access files from any networked PC or Mac in your home.Activate service and access and share files with friends, over the internet &mdash; no special software required.Enables friends to upload content as well, creating a comprehensive share space.Appears as a local drive whether in the home or accessed through the internet, for simple drag-and-drop access.Dock a FreeAgent Go&trade; drive or connect up to three USB storage devices.Send pictures straight from your iPhone&reg; to the FreeAgent DockStar network adapter.Gigabit Ethernet connectivity.Dock SpecsDimensions: 3.39 in L x 3.35 in W x 1.50 in D (86.00 L x 85.00 W x 38.21 D mm)Weight: 1.11 lbs (0.50 kg)Box SpecsDimensions: 7.00 in L x 5.25 in W x 2.25 in H (177.80 L x 133.35 W x 57.15 H mm)Weight: 1.08 lbs. (0.49 kg)Inside the BoxDockStarPower AdapterEthernet Cable1-Year Warranty", "title": "Seagate FreeAgent DockStar Network Adapter STDSA10G-RK (White)", "price": 45.68, "salesRank": {"Electronics": 60662}, "imUrl": "http://ecx.images-amazon.com/images/I/31uKYZuZJ7L._SX300_.jpg", "related": {"also_viewed": ["B006I5MKZY", "B005C31H34", "B003IT6YFU", "B005GM1Q1O", "B005IULTI4", "B002DH40ZY", "B001OC5J9U", "B000QSN3O6", "B00594BR4A", "B00776V3DI", "B0037NYKW6", "B001GDLYAU", "B0033WSDR4", "B005DB6NG6", "B00004SB96", "B004TDY924", "B003STVG80", "B003KGBBRW", "B005TJLU24", "B0047T7PTO", "B004UBU3SY", "B00DW1UNS8", "B005XDGJB8", "B00597E938", "B0058DN1Q4", "B0053GBB5Y", "B0093I4KRO", "B0001FSCZO", "B0035JCI6M", "B003ELOSI2", "B00EVVGAFI", "B00EVVGAD0", "B007JLDTRY", "B00439GMJ2", "B008U68UHG", "B004XP9BK8", "B003X26VV4", "B001M5V0YC", "B00BB7TU8Y", "B007KWLXRK", "B00ARB5FPM", "B00G9X5N18", "B0093NUFVE", "B00EHDTQQ0", "B00ARB5FNE", "B00G9X5NFO", "B004IYJWVC", "B00CRB9CK4", "B00CO0DE0W", "B00EHDNAOE", "B0099TX7O4", "B00B2AS8CE", "B004E3XP42", "B0045JLPMO"], "buy_after_viewing": ["B006I5MKZY", "B005C31H34", "B003IT6YFU", "B005GM1Q1O"]}}