{"asin": "B005INAVHQ", "related": {"also_bought": ["B00515FRG6", "B00BM9NT6K", "B004D8NZ52", "B002OXQSDE", "B00CWRXEVG", "B005EP3EH2", "B003XTTIIK", "B008HIT2ZG", "B002DNE5JE", "B00407YAAK", "B002602N34", "B00078E31W", "B000XBMP5E", "B00DH1KUWM", "B002M4MVG8", "B00470GWBK", "B0013Q1XTM", "B005INAU90", "B004T4X7U8", "B001V7EFH0", "B003NVMHM2", "B007IQWUT8", "B006OAO894", "B001FY0WDK", "B003XTRU58", "B002OY80OI", "B009FGS6LA", "B003FM6HIE", "B00DLL7Z1C", "B00004Z4BV"], "bought_together": ["B004D8NZ52", "B002OXQSDE"], "buy_after_viewing": ["B003XTTIIK", "B000XBMP5E", "B00515FRG6", "B004D8NZ52"]}, "title": "Defender PH301 Imitation Dome Security Camera with Realistic Flashing Red LED", "price": 9.99, "salesRank": {"Camera &amp; Photo": 1133}, "imUrl": "http://ecx.images-amazon.com/images/I/31d6JLH8D%2BL._SY300_.jpg", "brand": "Defender", "categories": [["Electronics", "Camera & Photo", "Video Surveillance", "Surveillance Cameras", "Simulated Cameras"]], "description": "All-in-one Deterrent Camera The PH301 imitation security camera is an easy way to deter intruders or vandals and make your property appear to have a robust security system. The ABS plastic housing make it look like a real, functioning camera. This camera can also be used in combination with a functioning security system to heighten the effectiveness. Customers, neighbors and visitors will all think that you have a robust video surveillance system.   Flashing Red LED This imitation camera has a flashing Red LED so looks just like the real thing. Use it in your business or home to help prevent vandalism and theft! The design of the PH301 is based on an actual camera, making it a realistic crime prevention investment. Make people think twice about stealing or doing damage to your property. Use it to help prevent and deter suspicious activity by placing the security camera in a noticeable area.   Place the Camera Anywhere You can easily mount the PH301 on virtually any surface and aim it using the adjustable bracket. This makes the imitation camera incredibly easy to use and adaptable to many locations.   Weather Resistant Housing for a Long Product Life Deter suspicious activity inside and outside with this camera. The imitation camera is made of ABS plastic for durability and will not rust. This makes the PH301 incredibly versatile and practical for convenience stores, parking lots, apartments, entrances, and many other places!   Designed like a Real Camera Built to resemble a functioning security camera, this product is versatile for your convenience and peace of mind. The ABS plastic and cable make it look identical to a real camera and is a cost effective crime prevention investment. Pair the PH301 with any of our security systems for an affordable solution and a more robust-looking system."}