{"asin": "B000EXU4YK", "description": "Amazon.com Product Description The Garmin StreetPilot c550 GPS Vehicle Navigator represents theultimate in GPS performance and simplicity. This portable navigator comes ready to go right out of the box with preloaded maps and a wealth of options. Delivering the same easy to use and affordable navigation as Garmin's c300 series of vehicle navigators -- including a simple touchscreen interface, automatic route calculation, turn-by-turn voice-prompted directions, and over six million points of interest -- the StreetPilot c550 also offers Bluetooth wireless technology with hands-free calling, an integrated traffic receiver, an MP3 player, and much more.The StreetPilot c550 delivers high-end GPS navigation, and is easy to use right out of the box.Navigation is easy with a touchscreen interface, voice-prompted directions, and more.View larger.Compatible with Bluetooth wireless phones for hands-free calls.View larger.Advanced Wireless and GPS TechnologyAt the heart of the StreetPilot c550 is a high-sensitivity WAAS-capable GPS receiver by SiRF that provides outstanding acquisition times and the ability to maintain a strong signal under heavy foliage and near city skyscrapers. This means you'll always know precisely where you are. Meanwhile, an automotive-grade, sunlight-readable, 2.8 x 2.1-inches (WxH) anti-glare TFT LCD touch-screen display offers easy readability. With dimensions of 4.4 x 3.2 x 2.2-inches (WxHxD), and at about nine ounces in weight, the StreetPilot c550 features a streamlined design that will fit easily on any dashboard with the included vehicle suction mount. The unit also features Garmin Lock -- an advanced anti-theft feature that disables the unit from performing any functions until you type in a specific four-digit PIN or take the unit to a predetermined location.The StreetPilot c550 also includes Bluetooth technology integrated with a microphone and dual speakers that lets you make hands-free mobile phone calls on a compatible Bluetooth wireless phone. You can view incoming calls on your c550, and simply tap the screen to answer. Just speak into the built-in microphone while staying focused on your driving. In addition, you can retrieve and dial numbers from your personalized phone book or the phone's call history log. You can also make calls from the more than six million points of interest database -- which includes hotels, restaurants, stores, and much more.Another feature unique to the c550 is its integrated traffic capabilities. The c550 includes the GTM 20, an integrated FM TMC traffic receiver with a free three-month trial subscription (for U.S. customers only). The GTM 20 notifies you of traffic conditions, construction and weather delays, and automatically suggests alternative routes. The navigator also comes with preloaded maps of North America and includes automatic routing, 2D or 3D map perspective, and turn-by-turn voice directions that speak street names -- making navigation as easy as it gets. An included MP3 player lets you enjoy music from your digital collection while you drive, and an included SD memory card expansion slot means that you can load optional software, such as language and travel guides -- making travel even easier and more entertaining than ever.What's in the BoxStreetPilot c550, Preloaded City Navigator NT for North America or Europe (full coverage), FM traffic receiver with vehicle power cable, Real-time traffic services, Vehicle suction cup mount, Dashboard disk, USB cable, Carry case, Quick reference guideProduct DescriptionThe portable StreetPilot c550 comes ready-to-go right out of the box with plenty of options. This navigator delivers the same, easy-to-use, affordable navigation as our popular selling c300 series with many enhancements. Garmin Lock anti-theft feature that disables the unit from performing any functions until you type in a specific 4-digit PIN or take the unit to a predetermined location. Features exclusive to the StreetPilot c550 include Bluetooth technology integrated with a microphone and dual speakers for hands-free mobile phone calls on a compatible phone. View incoming calls on your c550, and simply tap the screen to answer. Just speak into the built-in microphone while staying focused on your driving. Bluetooth wireless technology for hands-free calling Voice announces streets by name Configurable car icons Preloaded maps for all of North America Fingertip touch-screen interface Look up addresses and points of interest Choose 2D or 3D map perspective Upload custom POIs, including alerts for speed zones and safety cams Add optional software with SD memory card expansion slot Voice - Navigation instructions and warnings with TTS (text-to-speech) Waypoints - 500 with name and graphic symbol Trip computer - Resettable odometer, timers, average and maximum speeds Phone book - Stores contact numbers from paired phones that support book transfer GPS Performance Receiver - SiRFstarIII high-sensitivity GPS receiver Interfaces - USB 2.0 full-speed Power Input - 12/24v Dc Usage - 15w maximum at 13.8v Dc Battery life - up to 8 hours Unit Dimensions - Width 4.4 x Height 3.2 x Depth 2.2 inch (11.3 x 8.2 x 5.6 cm) Unit Weight - 0.59 pounds (269 grams)", "title": "Garmin Streetpilot C550 3.5-Inch Bluetooth Portable GPS Navigator", "price": 13.5, "imUrl": "http://ecx.images-amazon.com/images/I/51EH%2BYSYh4L._SX300_.jpg", "related": {"also_viewed": ["B000F78582", "B003HNTJZO", "B0007LJHVA", "B000A5T7AO", "B000OH63MI", "B001ELJ9QK", "B0057ODG6Y", "B000NVZE5M", "B0057ODOCA", "B0027NTYD2", "B0015EWMX8", "B0057OCDQS", "B00HVUEGVQ", "B000F7857S", "B0011ULQNI", "B001U0O7T4", "B0057OCS9A", "B00AXZY42W", "B00AY7NSTY", "B00AXZWG8Q", "B00AXX0I7Y", "B000H866BM", "B00BIZ0EY8", "B005DIBHCE", "B00AY7NUYC", "B002Q064MU", "B009B5C1N4", "B00HPPWOEI", "B00D45DNJI", "B001ELJ9P6", "B0066IUPS2", "B003ZX8B1E", "B00HK6CPVY", "B005VZT3HU", "B00AXX0JP0"], "buy_after_viewing": ["B000F78582", "B000F7857S", "B003HNTJZO", "B0057OCDQS"]}, "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS"]]}