{"asin": "B002NO7PWC", "related": {"also_bought": ["B001KELVS0", "B006G5ZVA2", "B002NEGTTW", "B007FGYZFI", "B007FH1FZ0", "B003RLJVYK", "B007FGZ1V0", "B0056TYRMW", "B007M54E1M", "B00009XVCZ", "B002O3MVYO", "B003BM7X6I", "B0049XGNKK", "B00GGM6LUO", "B000A1SWOA", "B00EZEBVE6", "B001NS0OZ4", "B002O3KVSC", "B007109ZA8", "B00GGM6NCK", "B0076BNK30", "B0062EUE54", "B005DEHVC8", "B007FH1KX2", "B0016XIQ1U", "B002OP7OPI", "B005IMFX2K", "B001G5ZTLS", "B000I1YIDQ", "B000AZ57M6", "B00009R6WY", "B005ES0YYA", "B00009XVA3", "B004K8WPUQ", "B001KBZ3P0", "B0095PTKMA", "B002CWQTXG", "B007XC99JQ", "B004AH10K8", "B002NEFL8W", "B004TJ6JH6", "B00494XZ1Y", "B007FEFQDA", "B00007B4DM", "B0056MPVZ6", "B00F3BLMLW", "B003FHNDF4", "B0093HGF32", "B00004ZCI2", "B00093ESSI", "B007NDL56A", "B008BYO1E8", "B00A2BWAKK", "B0033PRWSW", "B006JINI5G", "B00004ZCI3", "B001QWBM62", "B0000BZLBQ", "B004AQ95A6", "B00013MSUQ", "B002ZIMEMW", "B001GVRYRO", "B0000BZLAD", "B009GZMFQW", "B005TFU7X6", "B006JPJHN6", "1285084535", "B003I7BGH8", "B00004ZCJI", "B003Y34AK6", "1118169115", "B008FUZ06G", "B000I2JI80", "B008T2U0BU", "B003YM58XK", "B00009XV3M", "B003Y30334", "B0039ZGZAW", "B0093HGEKG", "B00DVUSE9K", "B005D2JE2A", "B007B5Q5HY", "B0000A1G05", "B00009R6VZ", "B000BYCKU8", "B002WE4H8I", "B00004ZCJM", "B00005061C", "B0076AYNXM", "B0043RTLNS", "B00017LSPI", "B005BSKKGU", "B0009QZDL6", "B009S94HSU", "B0000BZL9J", "B00ECEVEP0"], "bought_together": ["B001KELVS0"], "buy_after_viewing": ["B00EZEBVE6", "B002WE4H8I", "B00GGM6LUO", "B001KELVS0"]}, "title": "SanDisk 32 GB Compact Flash Memory Card SDCFX-032G-X46 (Black)", "price": 174.95, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/51YhXKhizPL._SX300_.jpg", "brand": "SanDisk", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Memory Cards", "CompactFlash Cards"]], "description": "The SanDisk Extreme CompactFlash Memory Card provides professional-grade performance so you can get exactly the shots you want. With up to 60 MB/s* read/write speeds, the SanDisk Extreme CompactFlash Memory Card will keep up with your advanced digital SLR wherever you go--it's tested to work in different types of adverse conditions.SanDisk Extreme CompactFlash 32GB** Memory CardAt a Glance:32 GB storage capacity for advanced digital and video camerasSuper-fast read/write speeds of up to 60 MB/s*Power Core Controller for better efficiency and performanceBacked by a limited lifetime warranty1Designed for professionals who shoot the highest quality RAW photos and high-definition videos.View larger.SanDisk Extreme CompactFlash Memory CardsPower Core Controller for Outstanding PerformanceThe SanDisk Extreme CompactFlash Memory Cards feature Power Core Controller and Enhanced Super-Parallel Processing Technology, which distributes image data across the card more rapidly and efficiently to take whatever your camera's buffer can dish out. The card features read/write performance speeds of up to 60 MB/s to capture more continuous burst shooting. It is UDMA-5 enabled and works in all UDMA modes.Enough Capacity for Any AdventureThe SanDisk Extreme CompactFlash Memory Cards were designed for professionals who shoot the highest quality RAW photos and high-definition videos, and need the large storage capacities that these files demand. The SanDisk Extreme CompactFlash card comes in capacities up to 32 GB so you won't need to worry about running out of space.Designed for Extreme EnvironmentsSanDisk designed the solid-state cards to work in adverse environments, so you can travel anywhere with them. The cards have an RTV silicon coating that provides added protection, and are backed by rigorous stress, shock, and vibration tests. They are designed to perform from -13 to 185 degrees Fahrenheit, so whether you're in the desert or the Arctic tundra, you'll take the shots you want.About SanDiskSanDisk Corporation is a Silicon Valley-based S&amp;P 500 and Fortune 500 company. It is a global leader in flash memory cards--from research, manufacturing, and product design to consumer branding and retail distribution. SanDisk holds more than 1,700 U.S. patents and more than 1,100 foreign patents.SanDisk pioneered the CompactFlash card format and co-invented the SD format. SanDisk has the rights to manufacture and sell every major flash memory card format.The SanDisk Extreme CompactFlash memory card is backed by a lifetime limited warranty1.What's in the BoxSanDisk Extreme CompactFlash Memory Card (32 GB) and plastic jewel case.Photo CapacityCapacity12 MP JPEG(3 MB+)14 MB+RAW File32 GB8,0001,92016 GB4,0009608 GB2,0004804 GB1,000240&nbsp;or&nbsp;Video CapacityCapacityHD2Video (1280x720x30fps)&nbsp;32 GB5 hours, 48 minutes16 GB3 hours, 15 minutes8 GB1 hour, 26 minutes4 GB43 minutes&nbsp;&nbsp;&nbsp;*Up to stated speed, based on SanDisk internal testing. Performance may be lower depending up on host device. 1 megabyte (MB) = 1 million bytes. X =150KB/sec.**1 gigabyte (GB) = 1 billion bytes. Some capacity not available for data storage.1Thirty-year warranty in regions not recognizing lifetime limited warranty.2HD (1280x720x30fps) and 3D video support may vary based upon host device, file size, resolution, compression, bit rate, content and other factors. See www.sandisk.com/HD+Approximations: results vary based on file size, resolution, bit rate, content host device, pre-loaded files and other factors."}