{"asin": "B00005Q8LY", "description": "As stranded, miniature spaceperson Olimar, you must find the missing 30  parts your spaceship needs to get you back home. The parts are scattered across  a forested area crowded with giant (when compared to our hero's size) animals  and other hazards. Our hero stumbles across a race of part-animal, part-plant,  all-bizarre creatures he names Pikmin. Olimar has to learn how to lead the  Pikmin around the forest as he uses the abilities of the different-colored  Pikmin to overcome the many obstacles in his path.Learning when and how to make the best use of your Pikmins' skills and traits is  the essence of the game. You can control up to 100 Pikmin at a time while  figuring out which Pikmin are best suited for a particular task. Some are better  fighters, while others can survive in water or handle explosive bomb rocks.  However, even the best Pikmin herder will have to sacrifice a few of the  plant-headed beasts for the greater good. It's the making of new strategies to  minimize losses that makesPikminchallenging and fun.For a first-generation GameCube title, the graphics, sound, and music are  fantastic and show an awesome amount of detail. Though it's noPok&eacute;mon, this game should appeal to wide-eyed younger gamers as  well as seasoned vets. The controls are intuitive and feel perfect for the  standard GameCube controller. However, learning to position the camera can be a  tad frustrating during some of the more tense moments, as it has only a few  magnification levels and needs constant adjustment.The biggest obstacle Olimar faces is time. He has only 30 days (each day is  about 15 minutes in real time) in which to find the necessary parts. While this  keeps the pace of the game up, some may find such limits somewhat frustrating,  as it means there will be a lot of repetition and rethinking of strategy. It  also means that diligent gamers may findPikmina rather short game.At the end of your gaming day,Pikminis one of the best games on the  GameCube.--Mark BrooksPros:Very innovative and originalGorgeous graphicsGreat sound and musicAmazing blend of action and strategyCons:Time limit causes players to repeat tasksExperienced strategy gamers may findPikminends too quicklyDifficult to control camera during tense moments", "price": 297.06, "imUrl": "http://ecx.images-amazon.com/images/I/51S2M92HAHL._SY300_.jpg", "related": {"also_bought": ["B000620PSY", "B00006FWTX", "B000066JRN", "B00005Q8LR", "B00012D0SG", "B000084318", "B000ARPXU0", "B00009WAUD", "B00005QEFD", "B0002ILS1K", "B000L9NPGG", "B00005ULXN", "B00005QEFF", "B0002ILS24", "9861019731", "B00009WAUB", "B000E36ONK", "B0081716P2", "B000A15K0Y", "B0000A2Y96", "B0001YYNL2", "B00006IJJI", "B00005QDQ1", "B00009WAUF", "B004CHLNWQ", "B002L8W5V6", "B000641ZC2", "B00009PS22", "B00008URUB", "B00095KU5G", "B0009Z3MGA", "B002C5BMFI", "B00006YXLE", "B00006HBTW", "B00006LEMY", "B0000A03CX", "B00006LU9B", "B000AQA9UA", "B00006DY1M", "B000U34SYQ", "B000B8J7JQ", "B000UQCER6", "B0002CHIWO", "B000069BB0", "B001AI7CF2", "B0017KIBAI", "B001KN51HI", "B000070IWB", "B00009M98D", "B000X37732", "B0009XEC0C", "B0000VSH40", "0761537511", "B004P4YIB4", "B0009XSMNA", "B0009PM8V0", "B003X0CGJW", "B002L93F0A", "B0000E5U6K", "B001CTL5GQ", "B00005R5PZ", "B0009SQFGQ", "B001PLYWX4", "B0000A0O28", "B0000E5U6M", "B00019AZC8", "B00005BOSF", "B001KN51FA", "B00009VE5I", "B000NNDN1M", "B002FY4AOG", "B00002STEZ", "1930206402", "B00006IKCD", "B00005Q8LV"], "bought_together": ["B000620PSY", "B000066JRN"], "buy_after_viewing": ["B001CTL5GQ", "B000620PSY", "B0081716P2", "B000ARPXU0"]}, "salesRank": {"Video Games": 3052}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "More Systems", "GameCube", "Games"], ["Video Games", "PC"]]}