{"asin": "B001L4GNLE", "categories": [["Home & Kitchen"]], "description": "LIMITED TIME SPECIAL: GET A FREE EXTRA OZONE PLATE AND EXTRA FILTER WITH EVERY UNIT!!  Working in conjunction with its carbon washable filter system, our air purifier pulls in unclean air from the rear, first passing through the carbon filter which removes airborne particles as small as 0.3 microns. This filter also acts to deodorize any unpleasant odors. Air then passes through the inner PCO cell, further filtering airborne contaminants as small as 0.2 microns.\n\nThe anion emitters, now moved forward of the fan to the front panel, release trillions of negative ions into your home, attaching themselves to dust particles, and dropping them straight to the floor. This advanced function is ideal for eliminating dust, bacteria, animal dander, and other harmful particles that float in the air. Left behind is fresh oxygen rich air, perfect for those suffering from allergies, asthma, and respiratory problems.\n\nThe sterilizer function turns on the units blue UV-C lamp to incinerate ninety nine percent of microorganisms like bacteria, mold spores, mildew, fungi, viruses, yeast, and airborne germs as they pass through the unit.\n\nWhen you need to eliminate offensive odors in your home, the Purifier function creates activated oxygen (ozone) in safe and effective levels based upon the square footage of your home. Perfect for eliminating tobacco smoke odors, cooking odors, chemical/cleaning agent odors, paint odors, etc. The activated oxygen will also sanitize pollution embedded in walls, ceilings, floors, carpets, furniture, clothing, countertops....all surfaces in your home. Using the AWAY MODE, your unit can be set on a timer so it will operate the Purifier function at its maximum strength for a set number of hours, then shut off automatically. Return home to fresh, clean, oxygen rich air....provided only by the 4 advanced technologies of the Green Air Machine!!  Does not meet California requirements, cannot be shipped to California.", "title": "Green Air Machine Air Purifier Ozone Generator Fresh Alpine Cleaner", "price": 259.0, "salesRank": {"Home &amp; Kitchen": 65035}, "imUrl": "http://ecx.images-amazon.com/images/I/51N7HBvD2cL._SY300_.jpg", "related": {"also_bought": ["B002YPGRO2", "B0009PSJ22", "B0083J992K", "B005E1CW9W", "B00370BLLM", "B005OH9IQG", "B005OH5CX4", "B004FGNTYE", "B0083J98LW", "B0060SHSRE", "B007Y9RBX4", "B008JIQAO0", "B000U204W2", "B0013Y0BJW", "B00028ZM3A"], "also_viewed": ["B004FGNTYE", "B00370BLLM", "B008JIQAO0", "B0060SHSS8", "B005DZ7SGQ", "B00FQS78Z6", "B005ANZBK6", "B0060SHSRE", "B005LXNWGA", "B0083UIXLW", "B00JAP7388", "B00L7L0YB6", "B00BY0CNKK", "B00AXBMUYU", "B008052OIS", "B00804ZBLQ", "B00IME1R2G", "B00E97GMHA", "B008056F88", "B005K09J3E", "B000QDLKDM", "B001RUS05E", "B001J2GNW2", "B005E1CW9W", "B00DNHUZ0M", "B006TKFG9A", "B00CF4OMP8", "B0067D7CKU", "B002YPGRO2", "B002A9JHB2", "B005OH9IQG", "B00GB8KO38", "B00K7120B4", "B00E9HHQTS", "B005E1CM4M", "B004WT39QW", "B00FBMJK9Y", "B00A9PTSFO", "B00GM34H4Y", "B00FSRBZPE", "B000HVTC5G", "B004VGIBZK", "B007QMIQZ6", "B005OH5CX4", "B00K7120DC", "B00A1LMEAC", "B00APO426E", "B004VGIGVY", "B00BWYO53G", "B002SHCEVG", "B00021703C", "B00D4C7V3U", "B00AX669CO", "B007Y9RBX4", "B00440EKRG", "B00BP9HWKQ", "B00007E7RY", "B008CQO62W"], "bought_together": ["B002YPGRO2", "B0009PSJ22"]}}