{"asin": "B000VJRUKS", "description": "Celestron 400X Laboratory Biological Microscope. For entry - level microscopes, it's in a class of its own! Reveal the magic in everyday objects! The texture of each rock, the fragile wings of an insect, or the veins of a leaf... all magnified in magnificent detail. You open your child up to a whole new intriguing world from the moment they open the box. Dollar-for-dollar, it might be the best entry-level Scope available. Where cheap-o beginner microscopes typically utilize plastic components and flimsy construction, Celestron's 400X Microscope is precision made with metal components, and includes a condenser and diaphragm, which beginner scopes rarely include. And it's amazingly powerful, up to 400X to reveal details you never knew existed. For performance and quality on a tight budget, Celestron is at the head of the class! Details: 40X / 100X / 400X magnification; 10X eyepiece, with 4X, 10X and 40X objective lenses; Precision all-metal body; Fully coated optics for top clarity, contrast and brightness; Microscope head: monocular, adjustable 0-60 degrees; Includes 5 prepared slides: intestine, honey bee mouth parts, corn stem, year tilia stem, and winter jasmine leaf; 50 mm (2\") mirror illumination for extra-bright image picture; Condenser and 5-disc diaphragm built-in; Coarse and fine focus knobs; Eyepiece F.O.V.: 12 degrees; Stage: Plain, 110 mm x 120 mm; Weighs 5 lbs. Order yours today! Celestron Laboratory Biological Microscope.", "title": "Flip Video Tripod", "price": 39.0, "imUrl": "http://ecx.images-amazon.com/images/I/31oo8mNr8oL._SX300_.jpg", "related": {"also_bought": ["B001B5CVNC", "B0040702HA", "B0041LXANI", "B0040702IE", "B00272MT3A", "B0023B14TK", "B002R5AM7W", "B00272MT3U", "B001O94GNS", "B001HSOFI2", "B0019I2AYG", "B0040702HU", "B0023B14U4", "B0040702I4", "B004AP96FQ", "B002FTII94", "B002DM6W2I", "B001U5R9YE", "B0040702HK", "B002R5AM7C", "B0023B14UE", "B003FMUPA0", "B001U7CBNQ", "B003N7NPF4", "B0023B14TU", "B005GTAH4O", "B001S0PWWC", "B0040702IY", "B0040702IO", "B0019I2AW8", "B004IIZY9W", "B000V1PXMI", "B0016BXRB6", "B0023CLK3O", "B004YM4HGS", "0470879165", "B003ZHV978", "B00272MT26", "B002OT4NN0", "B0049U3XQK", "B0016BVKAQ", "B0048FU2GU", "B0049OK1HU", "B001CUS3MY", "B003Y0SG22", "B004KMOVTU", "B004RL1PLQ", "B004PIJ41E", "B0043CWU22", "B004Q22H5Y", "B00CV9MITY", "B00009RUCH", "B0013CBGFW", "B000FPGP4U", "B001B2ZJAW", "B003VNKNF0"], "bought_together": ["B001B5CVNC", "B0040702HA"], "buy_after_viewing": ["B002DM6W2I", "B00272MT3A", "B001B5CVNC", "B003N7NPF4"]}, "categories": [["Electronics", "Camera & Photo"]]}