{"asin": "B0016GC9D8", "description": "The year is 2009. Worldwide political tensions are at a breaking point when a commercial airliner is shot down by a U.S. missile over Eastern Europe, killing all aboard. The U.S. government claims no involvement, and dispatches Agent Michael Thorton to investigate and bring those responsible to justice. As the first modern day spy role-playing game, Alpha Protocol offers unprecedented control over the development of Thorton&rsquo;s abilities and his interactions with other characters. Upgrade skills such as physical combat, weapons mastery, cutting-edge technology and even seduction as you grow in experience and complete missions.Choose your combat styleView larger.Sneak up on your enemiesView larger.Arsenal of WeaponsView larger.SynopsisIn the near future, worldwide political tensions are at a breaking point when a commercial airliner is shot down by a U.S. missile over Eastern Europe, killing all aboard. The U.S. government claims no involvement, and dispatches Agent Michael Thorton to investigate and bring those responsible to justice.As the first modern day spy role-playing game, Alpha Protocol offers unprecedented control over the development of Thorton's abilities and his interactions with other characters. Upgrade skills such as physical combat, weapons mastery, cutting-edge technology and even seduction as you grow in experience and complete missions.Key Game Features:Customizable Spy &ndash; Players continually develop their spy with advanced close-combat techniques, lethal marksmanship, the ability to wield ingenious spy gadgets, and much more.Multiple Paths to Choose From &ndash; With no right or wrong decisions, players can constantly change the storyline based on the choices they make. Will they let a terrorist escape to follow a lead, or eliminate targets against the mission agenda? Demanding decisions are challenging and many.Revolutionary Interaction System &ndash; With the Alpha Protocol &ldquo;Ripple Effect&rdquo; system, players can interact with allies and enemies in a variety of ways. Their choices will dynamically change the storyline and unlock new missions, weapons and alliances.Complete Choice of Combat Style &ndash; An arsenal of weapons with a plethora of customizable add-ons allows players to create a personalized weapon load out for every mission. Cutting-edge technology, stealth maneuvers, ballistic explosives and more can be discovered and used!No Time to Spare &ndash; Every decision and interaction in Alpha Protocol is made with a time-limit that steadily ebbs away. Players must think fast, act urgently, and then prepare for the consequences!Real Modern-Day Setting &ndash; Players can live out real-world espionage within rich international settings such as Rome, Moscow, Taipei, and Saudi Arabia.Developed by RPG Masterminds, Obsidian Entertainment &ndash; Founding Obsidian members have worked on RPG blockbusters including KOTOR II, Neverwinter Nights 2, Baldur&rsquo;s Gate, Planescape Torment, and Fallout.Dynamic Dialogue SystemThe Dynamic Dialogue System allows you to forge your own path within Alpha Protocol by determining the state of your relationships with the other characters in this high stakes espionage world. You'll have to think quickly when you're periodically given 2-4 stances to take during your interations with colleagues and enemies, uncovering a worldwide conspiracy through anything from suave sweet nothings to intimidating informants with brute force.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51aOlNBvu0L._SY300_.jpg", "related": {"also_bought": ["B003P9FRGA", "B001UWGCW2", "B004EW948E", "B00149ILDO", "B0050SX2MK", "B002DC8GKO", "B002I0K5NC", "B0014UGK8G", "B000QU1BEI", "B00354NANC", "B00320JAWY", "B0023CBZ70", "B003O6HDRU", "B00170823O", "B004HCYVO8", "B0021TVYCG", "B0047TLIBU", "B00DJ42BUQ", "B004ML44Y6", "B0022TNO7I", "B000NGP1R8", "B000HGOHWO", "B003Q55YCU", "B003H0CBYS", "B003O6HE0Q", "B0076ZQSFI", "B001C4DKG4", "B000KLNLUK", "B002ZJNWWC", "B002I0JBL4", "B000ZK7ZOY", "B002BRZ744", "B005TH6BD4", "B005185SDA", "B00104KCF8", "B002BXJ9VA", "B0056WJA6C", "B000ZK695U", "B003O6EDSM", "B003FBL85M", "B0012N3T3Y", "B000UUATJ2", "B000SQ5LQE", "B00319DX4M", "B0044SA734", "B000QAVV6G", "B002ELCV00", "B000FQBF1M", "B001RTCOWA", "B003O6G1L4", "B001D7T2VC", "B002I0J5YW", "B003O6E6EI", "B002I0H2G0", "B008XMSR6G", "B0086V5V8G", "0744010934", "B004EDJOYC", "B000K9OR4Q", "B00432O50W", "B00198PO5I", "B003GT8IL0", "B000R3CIV4", "B003S2MXQG", "B0050SXGU8", "B007UM599S", "B001CSPRJI", "B0085CA8QG", "B001TOMQOY", "B002BRZ6UE", "B001COV1CY", "B001KY7GE8", "B0012NAPNQ", "B00576U7W8", "B003O6E67A", "B00309XHD0", "B004MXM7WU", "B0037LVW9M", "B00109KMQ2", "B00CWYYLH0", "B004L5SJ58", "B002I0J5UQ", "B001CBW1A8", "B000XJLQ24", "B004UDB9SA", "B005C2D1YI", "B000G7X5Q8", "B0045ZIEPY", "B0081B1O5A", "B004NRN5EO", "B00BU3WVM6", "B0065NP05G", "B004WL4LOY", "B0050SWUTQ", "B002I0J8FI", "B008E6ZXTA", "B0050SXX88", "B001CRM3YQ", "B0056WJA6M"], "bought_together": ["B003P9FRGA"], "buy_after_viewing": ["B00320JAWY", "B00BMFIXKQ", "B0050SX2MK", "B0050SWZHS"]}, "salesRank": {"Video Games": 6733}, "categories": [["Video Games", "PlayStation 3", "Games"]]}