{"asin": "B00163ROMC", "description": "Featuring a wide array of cinematic effects, action packed life-or-death battles, and graphics that will make your skin crawl, Deadly Creatures for Wii exposes you to the brutal realities of life in the desert. And you better be ready to defend yourself because you're about to take on this vast, dangerous world from the perspective of two deadly critters with a history of giving even the most stalwart people the creeps: the scorpion and the tarantula..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Experience 360-degree access to detailed, unforgiving environments.View larger.Witness a story of human greed from two distinct perspectives.View larger.Fast action and stunning combo moves keep creature battles challenging.View larger.Combat rattlesnakes and other deadly predators.View larger.Deadly, Motion-Controlled Combat with Wii TechnologyYour Wii controller gives you the ability to move stealthily and attack quickly, just like the real creatures these characters are based on. Each animal has a unique mode of operating, which means that the two interconnected narratives behind this game each offer their own distinctive challenges to conquer.As the armored, action-oriented scorpion, you'll string together stinging blows into deadly combo moves that culminate in cinematic finishes and decimate your opponents. Playing as the sneaky tarantula requires a little more finesse--you'll find yourself leaping from above onto your nemesis, throw out neatly aimed shots of webbing to paralyze your prey, and finishing creatures off with your devastating fangs.Wild Enemies and a Sinister Back StoryIt takes skill and composure to master the moves the scorpion and tarantula have at their disposal. And, even after you think you've got every move down, you'll find you need to learn methods, since these life-and-death struggles take place between you and a huge array of vicious, hazardous creatures, including wolf spiders, rattlesnakes, Gila Monsters, Tarantula Wasps, black widows, mantises, enemies of your own species, rats, and even humans.Beyond the immediacy of fighting for survival, this game features a story of greed and betrayal in the human world. Slowly unveiled from the disparate perspectives of the two headline creatures, this evolving storyline helps keep even advanced players engaged and guessing at the implications of their own actions.Explore Brutal, Unforgiving EnvironmentsWhichever creature you're playing as, you'll have 360-degree access to a wide range of 3D environments based in the harsh Sonoran Desert. You'll explore a gloomy maze of thorny brambles, forgotten underground tunnels filled with rusting pipes, an above ground wasteland packed with people's garbage, and even a desolate gas station. Each arena promises to challenge your skills as a hunter and a survivor in its own way, while unique angles and a sense of scale that turns small, familiar objects into major obstacles help make these environs especially prickly.", "price": 39.99, "imUrl": "http://ecx.images-amazon.com/images/I/51S4p7y6ffL._SY300_.jpg", "related": {"also_bought": ["B002E6XY6U", "B002BS47L2", "B000RW3V70", "B001TOMQVM", "B0019SY1D4", "B001TOMR0C", "B002CZ3SLO", "B0017WHQ34", "B002BRYXOO", "B002BRZ9AG", "B000WINB56", "B001TOMQVC", "B001HB7K6I", "B00423HNMO", "B003JD7QYI", "B002EE7OKE", "B00B2QL2Y4", "B000X25GW2", "B001TOQ8OI", "B003O6H7X0", "B007CSF3GO", "B00IZ9T9QE", "B001ET07O0", "B002FG9MWE", "B000Z9A95M", "B001P5HM64", "B001TOQ8K2", "B000P46NKC", "B005FEX576", "B005EIIBKY", "B00269DXXO", "B002BHSPXO", "B0018YDKC2", "B000R1A0L6", "B002I08CSW", "B003GB4UXI", "B0058CA4S8", "B006L1FAK2", "B004FRVDUU", "B001HKPUKC", "B001TERJD2", "B00149IL9I", "B00BAWXCRU", "B00BORFD9Q", "B003O6FW6E", "B00269DXR0", "B000UW1YBW", "B00897Z27C", "B003V3O4A0", "B002ATY7JE", "B000WQ1UME", "B000RF7164", "B00AMA4L4E", "B00HI3KEBM", "B003M31RN6", "B0089X37NW", "B003PHLT8W", "B003S2SQCQ", "B000P297ES", "B001KRPU4S", "B001C58T46", "B002DC8GWC", "B000P297F2", "B0013LT1K0", "B009CLBY0I", "B001PBDBNQ", "B000FQBPDU", "B002EE5SAC", "B000XPMU1O", "B000TU1IH0", "B000RW3V3E", "B000WCQWR6", "B0050SVFB0", "B000XJNTQ0", "B003WY86NE", "B0030GBU8W", "B00117PPME", "B000NDFFFE", "B00B59L9YG", "B00CHYOP94", "B000SH3XCW", "B000K9OP2A", "B00139U8TU", "B007RNWUC4", "B005J5K9UW", "B002WDL51Q", "B00005Q8M4", "B000JV78XC", "B002BRYIJY", "B002I0GF72", "B005S9EJVY", "B003ZCH7DI", "B001CM0PR8", "B0039QWK0A", "B00DV16N6U", "B008HHTD6A", "B003O6HGHM", "B00DC7G0GG", "B009EWHKAI", "B004WLRQMI"], "bought_together": ["B000RW3V70", "B002BS47L2"], "buy_after_viewing": ["B000RW3V70", "B002BS47L2", "B00423HNMO", "B000WINB56"]}, "salesRank": {"Video Games": 5144}, "categories": [["Video Games", "Wii", "Games"]]}