{"asin": "B001AMSPQI", "categories": [["Electronics", "Home Audio", "Stereo Components", "Receivers & Amplifiers", "Component Receivers"]], "description": "From the ManufacturerOnkyo's TX-8255 A/V Stereo Receiver: Getting Back to the Basics for the Sake of Audio QualityWhile new technologies come and go, the fundamentals of competent receiver design remain constant. It is best to think of it in simple terms: a power supply, an input stage, a driver stage, and an output stage that all combine to amplify signals without any loss in quality. The current that actually drives the loudspeakers comes from a power source via the receiver's power supply. You can never underestimate the importance of the power supply, and all other audio processing functions cannot rule over good solid amplification. This is the direction Onkyo has taken with the TX-8255. Built for those people who value the benefits of time-proven amplification design, the TX-8255 takes core Onkyo technology--and an array of features you'll actually use--to bring you a no-nonsense stereo receiver that will deliver audio and radio signals with agreeable quality.Superb DesignThe TX-8255 includes Onkyo's exclusive Wide Range Amplifier TechnologyWith its continued excellence in sound reproduction, Onkyo has once again created a versatile stereo receiver for the music lover in you. The TX-8255 stereo receiver offers superb functionality and dual-room capability that will be hard to match. Onkyo exclusives like Wide Range Amplifier Technology (WRAT), discrete output stage circuitry, massive power transformer, and heavy-duty extruded heat sink offer the cleanest signal on the market. Most of the receiver's audio processing is handled automatically, with little intervention on your part. However, it is so advanced; its discrete output reproduces music with unmatched sonic clarity and dynamic power.This receiver features a high-end design approach encompassing everything from its massive power transformer design and high-current, low-impedance drive to discrete output circuitry and minimal use of negative feedback. This enables the receiver to combine tighter bass, superb transient response and enhanced presence at any volume level. Remote Interactive (RI) capability enables you to simply connect your iPod to your receiver through Onkyo's RI Dock option for the iPod (DS-A2). Your iPod effectively becomes another Onkyo component flowing through the TX-8255.In a NutshellThe TX-8255 is a 2 x 50W (@ 8 ohms) stereo receiver capable of delivering breathtaking stereo sound. It features 5-sets of audio inputs, 2-sets of audio outputs, individual treble, bass, and balance controls, Remote Interactive (RI) port, A/B speaker switching, banana plug speaker posts, and an AM/FM tuner. Because of the high efficiency of its design, this powerful receiver produces exceptional sound quality, and clarity in every audible detail. With speaker A/B selectors and dedicated speaker terminals, this receiver offers the capability to send audio to a second room. In addition, the built-in IR port enables multi-room distribution with optional control systems.What&rsquo;s in the box:Onkyo TX-8255 2-Channel Stereo Receiver (Black), Remote Control, AM Loop Antenna, FM Wire Antenna and 2-Years Parts and Labor Warranty.Technical SpecificationsStereo RMS Power: 50W per channel x 2, into 8 ohmsDynamic Range: 135W per channel x 2, into 2 ohms, 105W per channel x 2, into 4 ohms, 70W per channel x 2, into 8 ohmsNo. of Channels: 2Speaker Selector: YesAM/FM Tuner: Yes, with 40 presetsInput Analog Audio: - x5 Sets (RCA)Input Phono: - x1 Set (RCA)Input FM Antenna: - x1Input AM Antenna: - x1Output Analog Audio: - x2 Sets (RCA)Output Headphone: - x1 (1/4\" Phone)Output Speakers: - x4 Sets (Binding Post)IR Input/Output Port x1 (Mini)RI Port x1 (Mini)", "title": "Onkyo TX-8255 Stereo Receiver (Discontinued by Manufacturer)", "price": 159.0, "salesRank": {"Electronics": 19456}, "imUrl": "http://ecx.images-amazon.com/images/I/41E%2BsSRVcUL._SX300_.jpg", "related": {"also_bought": ["B00GYCX2ZI", "B0000EZ1KK", "B008NCD2LG", "B0029HO66G", "B004UR487A", "B000OG4E1G", "B00192KF12", "B00167340E", "B0029HHIDY", "B002S1CJ2Q", "B002GYTPAE", "B004NQU4YY", "B006LW0WDQ", "B000CDHQK2", "B000OG88KY", "B00067OS0A", "B0037VZUPO", "B00006JPDI", "B002JP4Z96", "B008872SIO", "B00531KWL8", "B008I64B1W", "B004YEBK66", "B000OG6I6A", "B00EE18O7W", "B004MM5YIU", "B0048XFL18", "B0006VMBHI", "B000KULLM6", "B001JY9MB4", "B008NCD2S4", "B007XTE6YW", "B0090CVJZ4", "B0040L3DAO", "B000KMZKTO", "B00006I5SB", "B000UZ66YY", "B004UR485M", "B003L9HDHU", "B0002KVQBA", "B001VIYYCK", "B002GYTPB8", "B00EKJQLSC", "B00004Z5CP", "B009IUIV4A", "B004YEFLGQ", "B00009QORL", "B004YDUZ22", "B00E7H8GG2", "B009OBCAW2", "B004VM1T5S", "B000V2UBSI", "B0097JLQVC", "B009GUQZ9U", "B004MEWZE4", "B002RJLHB8", "B00ALYI3JU", "B000I1IG8Y", "B0000BVME4", "B00378KMEG", "B0077V8930", "B0026RHPSU", "B001MM797M", "B00066XTBA", "B006BUVOZ8", "B004UR486G", "B0040718U0", "B00006BMQT", "B0056IB3DY", "B0001VGFKW", "B0047T79VS", "B0093F4ROI", "B000WKW59C", "B000000XB9", "B0000669JL", "B000P0528K", "B0025KVLTC", "B0002J1TUE", "B00AWKC0JM"], "buy_after_viewing": ["B00EE18O7W", "B004UR486G", "B0077V8930", "B006U1VH2S"]}}