{"asin": "B00005LE6Z", "categories": [["Electronics", "Camera & Photo", "Lenses", "Camera Lenses", "Digital Camera Lenses"]], "description": "Lens-making is an art--Nikon artisans craft Nikkor optics from the finest materials, taking pride in adding their intellect and technique to bring the world's finest lenses to life. They push the leading edge of lens-making in their effort to provide the \"glass\" that makes the world's greatest pictures.AF Nikkor lenses work with Nikon SLRs for optimal performance, even the very latest. The Nikon 24mm f2.8D AF Wide-Angle Nikkor is a compact ultra-wide-angle lens constructed with superb optical design for architecture, wedding, and landscape photography. It features 84-degree (61-degree with Nikon DX format) picture coverage with edge-to-edge sharpness. The Close Range Correction (CRC) system provides high performance at both near and far focusing distances, for distortion-free pictures as close as one foot.Nikon Super Integrated Coating ensures exceptional performanceTo enhance the performance of its optical lens elements, Nikon employs an exclusive multilayer lens coating that helps reduce ghost and flare to a negligible level. Nikon Super Integrated Coating achieves a number of objectives, including minimized reflection in the wider wavelength range and superior color balance and reproduction. Nikon Super Integrated Coating is especially effective for lenses with a large number of elements, like our Zoom-Nikkors. Also, Nikon's multilayer coating process is tailored to the design of each particular lens. The number of coatings applied to each lens element is carefully calculated to match the lens type and glass used, and also to assure the uniform color balance that characterizes Nikkor lenses. This results in lenses that meet much higher standards than the rest of the industry.Close-Range Correction systemThe Close-Range Correction (CRC) system is one of Nikon's most important focusing innovations, for it provides superior picture quality at close focusing distances and increases the focusing range. With CRC, the lens elements are configured in a \"floating element\" design wherein each lens group moves independently to achieve focusing. This ensures superior lens performance even when shooting at close distances.Distance informationD-type and G-type Nikkors relay subject-to-camera distance information to AF Nikon camera bodies. This then makes possible advances like 3D Matrix Metering and 3D Multi-Sensor Balanced Fill-Flash. Note: D-type and G-type Nikkors provide distance information to the following cameras: Auto exposure; F6, F5, F100, F90X, F80, F75, F70, F65, F60, F55, F50, Pronea S, Pronea 600i, D2 series, D1 series, D100, and D70s/D70. Flash control; F6, F5, F100, F90X, F80, F75, F70, D2 series, D1 series, D100, and D70s/D70 cameras.What's in the Box:Lens, 52mm snap-on front lens cap, rear lens cap LF-1.", "title": "Nikon 24mm f/2.8D AF Nikkor Lens for Nikon Digital SLR Cameras", "price": 359.95, "imUrl": "http://ecx.images-amazon.com/images/I/31V895M0CGL.jpg", "brand": "Nikon", "related": {"also_bought": ["B00005LE72", "B00009R96C", "B0000BZL47", "B00004ZCJG", "B00005LENO", "B0099XGZXA", "B006TAP096", "B00007EDYT", "B00FOTF8M2", "B0045KGZOG", "B00005LEN4", "B00005LELD", "B00005LE75", "B00005LEOH", "B0045TYDNC", "B0042X9L6A", "B0076AYNXM", "B00AN8U0Y0", "B0031CS83U", "B00BI9X7UC", "B0042X9LC4", "B001G4NBSC", "B004Y1AYAC", "B000EOSHGQ", "B00007EDZG", "B0000BZL3G", "B00005NPWK", "B00017LSPI", "B001GCVA0U", "B00BYQ4MOE", "B002L72ANK", "B001S2PPT0", "B00005LEOC", "B00006I5J7", "B00004ZCAU", "B0050YG3CU", "1937538451", "B001UG57RY", "B004YW79F4", "B00GD1KCAI", "B007NDL56A", "B0095ZKUD8", "B009IVXMM0", "B008B14TQ6", "B009CQKGSO", "B009VZOK0Q", "B00006JN3G", "B00004ZCAT", "B0000BZL8H", "B001T9N0RQ", "B000BYCKUI", "B000BYCKU8", "B00009XW3O", "B0083WYFWG", "B0099Y1QM4", "B0007M6GI6", "B00FSG1INY", "B00CV9MPW4", "B00009R98A", "B0037KM0XA", "B000CDA802", "B005PCDSBQ", "B00AA48HPQ", "B00006I5J4", "B00004ZCJM", "B00603RS9W", "B00DNADZME", "B000VDCT3C", "B002SXNXUG", "B00E42U1UE", "B000CMNL52", "B000KZ70JE", "B000A6EXNO", "B003HC8VA4", "B000HJPK2C", "B00005LE77", "B001F6TXME", "B001G4QXLE", "B00007EDYY", "B0033UQM6K", "B00004ZCB4", "B007G3DQI2", "B006ISEJ9Q", "B00DMFWMME", "B00EHSLQ2M", "B00443EN2U", "B009DJ1THW", "B00004ZCJK", "B0095ZLP3C", "B009DJ1OFY", "B000KKPN5C", "B00005LEOK", "B007M54E1M", "B003UOIMAS", "B003ZSHNEA", "B0043D2L9S", "B001A472LA", "B002JCSV8U", "B00CH6AWOY", "B000VJX7DW"], "bought_together": ["B00004ZCJG"], "buy_after_viewing": ["B001S2PPT0", "B004Y1AYAC", "B00005LEN4", "B00005LE71"]}}