{"asin": "B0077AOALQ", "categories": [["Electronics", "Computers & Accessories", "Laptop & Netbook Computer Accessories", "Bags & Cases", "Backpacks"]], "description": "Targus 16&rdquo; Sport 26L BackpackTargus 16&rdquo; Sport 26L BackpackBusiness CasualFor those who spend their days at the office, afternoons at the gym, and weekends enjoying the great outdoors, you need a bag that can keep up; something with a sporty yet casual look that has room for your laptop and all your gear. The Targus Sport 26L Backpack was designed specifically for anyone with an active lifestyle. With its youthful style, extreme durability, and a place for all your gear and devices, the Sport 26L Backpack is made to fit all your activities.Pockets for EverythingYour active lifestyle forces you to carry plenty of gear throughout your busy day, including a laptop, a tablet, an MP3 player, or digital camera. Trying to find a place for everything is easier said than done. With the Targus Sport 26L Backpack, you can rest assured that you&rsquo;ll finally have a place for everything in your digital life. A large padded pocket is designed to fit laptops up to 16&rdquo;, and there&rsquo;s a separate sleeve specifically for your iPad. A zippered stash pocket on the front panel hides compartments for all the smaller items your need for the classroom or the boardroom. The top of the bag also features a soft-lined pocket for sunglasses or other small accessories.pocket for sunglassesdedicated iPad&reg; pocketlaptop protectionBuilt-in DurabilityFinding a bag that&rsquo;s just as tough as it is stylish is no easy feat. But every inch of the Targus Sport 26L Backpack has been designed to keep up with you as you head from the office, to the gym, to that weekend hiking trip. The entire bag is made of ripstop material which is very difficult to tear or puncture. Despite offering extreme durability, the Sport 26L&rsquo;s construction is ultra-lightweight, ensuring it won&rsquo;t weigh on your commute. Subtle accents add to the bag&rsquo;s long-lasting character, including tactile rubber zipper pulls and strong reflective piping on the front, which also provides greater visibility for walking on campus at night, or when waiting for the evening train.durable exteriortactile zipper pullsreflective pipingTake Your Tunes With YouLike to carry your tunes wherever you go? No problem! The Targus Sport 26L Backpack comes with a smart little feature that lets you enjoy your music without those messy cords getting in the way. Inside the Sport 26L Backpack is a special media pocket with a built-in cord that connects your media player to the headphone jack located on the shoulder strap. While your media player is tucked safely inside the backpack, you can still access your music by simply plugging your ear buds into the easily accessible headphone jack on the shoulder strap. No cords, no fuss!media pocketbuilt-in cordheadphone jack onshoulder strapCarry ComfortablyComfort is key for anyone with an active lifestyle. That&rsquo;s why the Targus Sport 26L Backpack was designed to complement your daily journey, and not complicate it. Two ergonomic, padded shoulder straps and a padded back panel will ensure comfort even after hours of wear. No need to worry about being overburdened either. Despite offering spacious interior pockets, the bag is very lightweight. And, since it&rsquo;s backed by the Targus Limited Lifetime Warranty, you&rsquo;ll also have peace of mind should anything go wrong with its structure.adjustable shoulder strapscushioned back panellimited lifetime warrranty", "title": "Targus Sport 26L Backpack for Laptops up to 16-Inch TSB712US (Black)", "price": 27.99, "imUrl": "http://ecx.images-amazon.com/images/I/41Mo2iuCSlL._SY300_.jpg", "brand": "Targus", "related": {"also_viewed": ["B006NNWZSI", "B004YIFKRM", "B0001H27PS", "B005YQY3AS", "B00024ENVG", "B00BZC0LLA", "B001GT4AA0", "B004UBU42Y", "B0057V9HPQ", "B0081U0628", "B0029L9YHI", "B005YQY5TM", "B007TIYYNU", "B004UBULPO", "B004Z5363O", "B00507NAYQ", "B0081U068C", "B00CGWNKVQ", "B00CGWNCGE", "B003WU6KFO", "B00EEBS9O0", "B00CGWNK2U", "B00C6RL9AU", "B00HXAV7KM", "B00007LTAI", "B0021AFMPK", "B0001EMM10", "B000EZYKMA", "B00IKDNSIK", "B0055YB5IC", "B006UUF27U", "B00005T3H5", "B00BJFVCD4", "B005GFE9ME", "B001OC5JKY", "B00FWVGY48", "B003WUBM3O", "B002J9HBSE", "B00024VTKO", "B002WC7RI2", "B002OHDIWY", "B00856YHQE", "B004N1IIY2", "B00BW0QC72", "B008RY6W1C", "B00BPNJVW4", "B002VJJS74", "B003HIXPJA", "B007IW0HJC", "B008HY62OO", "B001BHQSCK", "B00A0IICZ2", "B00I3JXZZ2", "B008HY60AA", "B004AM624C", "B00FWV1IGW", "B00A2ZQN5Y", "B00A0IICY8"], "bought_together": ["B009K916ZK"], "buy_after_viewing": ["B006NNWZSI", "B004YIFKRM", "B00507NAYQ", "B0001H27PS"]}}