{"asin": "B004AA0U56", "categories": [["Electronics", "Camera & Photo", "Flashes", "Macro & Ringlight Flashes"]], "description": "POLAROID \"LED\" LIGHTING SOLUTIONSRegardless if you shoot your videos with a pocket size \"Flip\" style unit, a still camera with video mode or HD-capable digital SLR, you'll immediately appreciate what our LED Light Bar lighting solutions add to your videos.Thanks to our \"Daylight Tuned\" pure white LED's, you enjoy the same kind of 'daytime-white' light the pros do-at a fraction of the cost. More than great lighting Polaroid LED's are also designed for versatility.Case in point, thanks to their exclusive integrated expansion mounts they're \"stackable\" so you can combine them to 'build\" a wall of light. In addition, our compact LED & Infra-Red models are rechargeable so they provide about an hour of quality illumination with no worries about wires or wall outlets.Plus, our top of the line unit features a built in dimmer so you can adjust the lighting level to exactly what's needed for a particular shooting situation-video or still. That's because our cool running LED lights are designed for \"always on\" use, rapidly becoming the pro's choice for portraiture or any situation where controlled light is key.If you're looking for a more traditional lighting solution, our camcorder video light is a \"single bulb\" solution that delivers a full 3 watts of  illumination that's color balanced to produce even, natural results.For brilliant videos and stunning stills, give Polaroid Lighting Solutions a shot", "title": "Polaroid Studio Series Rechargeable 36 LED Light Bar For Camcorders, Digital Cameras &amp; SLR's", "price": 39.99, "imUrl": "http://ecx.images-amazon.com/images/I/51UL2rxWqnL._SX342_.jpg", "brand": "Polaroid", "related": {"also_viewed": ["B00DO79NA4", "B008X3NGHU", "B009OMRU0S", "B009HU6RI8", "B00K7146TS", "B004TJ6JH6", "B00FJ0RGD0", "B00CCUYSPY", "B00COGKPLM", "B00AZFE5DS", "B00K7146S4", "B008X3NGR0", "B00JWLUQYI", "B00CBAVWG8", "B00FVRURAK", "B004VFGVB2", "B003ENSG42", "B00IN4981W", "B00CF0TJXC", "B008X3NGFC", "B0067S8IZ8", "B00G4PFVUY", "B00KAF1ZJU", "B004JZI78O", "B00K7146RU", "B00DVUSE9K", "B003UOOZAY", "B00ESJIFX8", "B00IN49830", "B00JNRW950", "B00IEK469O", "B00IN4983K", "B00E4LFP0G", "B00KA6SOQ6", "B004ECQTMI", "B008MARBI4", "B00KIFANJU", "B008UNAK0E", "B00IPD4DHU", "B003LTB8GM", "B00HI3EZDU", "B00CKXYEVQ", "B00IN4984O", "B00IN497ZE", "B005Y4H3YI", "B00AR7YRGE", "B00686PZYG", "B00GW9JWAW"], "buy_after_viewing": ["B004TJ6JH6", "B00CF0TJXC", "B002A92OVM", "B00B7ID99I"]}}