{"asin": "B0000AJMPK", "description": "Counter-Strike, the world's most popular online action game and first-person shooter for the PC, makes its console debut exclusively on Xbox and Xbox Live.Counter-Strike for Xboxfeatures single-player missions, taking place over a gritty realistic counterterrorist world. It allows gamers to challenge other players in team-based multiplayer games on Xbox Live and System Link.Counter-Strike for Xboxwill be the most graphically advanced version of the game to date, showcasing the technical prowess of Xbox, including immersive and intense multiplayer action on Xbox Live. In addition, players will benefit by strategizing and communicating with their teammates via the Xbox Live Communicator headset.Features:Intense Xbox Live multiplayer action: Gamers can battle real players throughout the world with Xbox Live, strategizing and communicating with up to 15 other players. A unique player-ranking system will allow gamers to select games with equal-caliber opponents, while Xbox Live helps ensure cheat-free playing fields. System Link functionality will also be available.Xbox enhancements and exclusives: Players will be treated to new graphically enhanced missions from Counter-Strike: Condition Zero, as well as new, exclusive content designed only for Xbox. Players can engage in the usual favorites, such as Bomb Defuse and Hostage Rescue, as well as play the new single-player component.Realistic counterterrorist experience: Players will experience a deep and involving counterterrorism world, where danger abounds. Lead an elite team through the jungles of Asia, the cold regions of Eastern Europe, and the unbearable humidity of Colombia.Real-life weapons and gadgets: Players can choose from more than 25 real-life weapons, including shotguns, sniper rifles, pistols, and other military artillery. New gadgets include a riot shield, blowtorch, and fiber optic camera, bringing new strategic elements to the Counter-Strike world.Downloadable content: New downloadable content will be available via Xbox Live.Note: major credit card required for Xbox Live monthly membership fee", "price": 10.99, "imUrl": "http://ecx.images-amazon.com/images/I/517P1V6XNQL._SY300_.jpg", "related": {"also_bought": ["B00005NZ1G", "B000B2YR74", "B0009351RK", "B00008J7NZ", "B000087L4G", "B001ELWMHI", "B00019AZA0", "B0002A2S26", "B000069BCN", "B000AOEV6A", "B00006JZQZ", "B00078W0BM", "B0001UEHP8", "B00019AZAK", "B00012TIW8", "B000067DPD", "B000G82DDS", "B000784XIA", "B00005RCQ5", "B00005O0I9", "B0006BK5AI", "B0001KUE7S", "B00020BV0Q", "B00019HNN2", "B00008DHNN", "B00006F2ZQ", "B0000C6EDM", "B000930DLY", "B0002CHIZ6", "B0001AVSH8", "B0001ADAMO", "B00008G764", "B000B6MLZK", "B0002SQ0BS", "B00006409Z", "B000AX21VI", "B0001DI6FM", "B001I020CW", "B0002IZICK", "B00005OWBL", "B000784XGM", "B000088KH4", "B00008S7XI", "B000FDOTYU", "B00009X3SY", "B000093NQH", "B0002CHJA0", "B0000640A9", "B00097IA88", "B0000A082T", "B0002CHIWY", "B00006C28Y", "B0001JXQ5Q", "B000ARJI9C", "B00008XKZM", "B0002CTTQC", "B0000C6EDL", "B00095LEEW", "B0007ZD79E", "B0009Z3IWS", "B00129I75I", "B000F2JUOK", "B000FW6MFK", "B0009N1KD4", "B000O5K3TO", "B000088KH3", "B0000C4M23", "B000GPXSA8", "B0016CQ0Q4", "B00005ME8S", "B00005RKO7", "B000093NQN", "B00008KTNE", "B0007OGDHS", "B00020BV1A", "B00006LU9L", "B0007ULF8O", "B00006C28W", "B0002IQC8Y", "B00067AVSS", "B00009X3V0", "B000160MCO", "B0009Z3HZQ", "B0009Z3LHK", "B00006LEMQ", "B000095ZH0", "B0000A92KZ", "B0009PAUJM", "B00005RCQJ", "B000GE8OYY", "B00005NZ1I", "B00006JC48", "B0001I9YE4", "B00005R6YX", "B00008NRMA", "B000067DPM", "B0006I5I58", "B0009VQANQ", "B002BSA2LQ"], "bought_together": ["B00008J7NZ"], "buy_after_viewing": ["B00008J7NZ", "B00005NZ1G", "B001ELWMHI", "B000AOEV6A"]}, "salesRank": {"Video Games": 19430}, "categories": [["Video Games", "More Systems", "Xbox", "Games"]]}