{"asin": "B0001DJT7G", "related": {"also_bought": ["B002O0FXH4", "B003BVM3NC", "B008G48DW4", "B000S75D66", "B000X7GF40", "B001E5E0D8", "B000CNY6UK", "B003BVO1K0", "B0001RT1OS", "B009DILDY2", "B004STBG7U", "B0000CF3Q6", "B001802PIQ", "B00B44AT8O", "B000BU5KJK", "B005GTWCTM", "B0002KZUNK", "B0001IXA4Y", "B000SOLUBQ", "B001E5DYT4", "B003SRKSRC", "B000CRD4AO", "B000BP8JFM", "B00067WBU4", "B0002JZCF2", "B001804CLY", "B001E5E0CE", "B000VOCQPW", "B005ARH074", "B00AQ0D5YW", "B00196WXNG", "B000SOLUCU", "B0032XJFAS", "B00133O0G8", "B000SDKDM4", "B007F183LK", "B001E5DYSU", "B008FOF86E", "B002GWKVA4", "B0001XRNEM", "B000MR6I9I", "B000FDL588", "B001EQ5ERI", "B004EPSHK2", "B001E5E0DI", "B004N71J7O", "B0001RT2C4", "B0000CFSS5", "B007PDDDWC", "B000XR2GMK", "B000E8BFP2", "B0069ENT9K", "B0016CBMYY", "B000CRH4FK", "B000H6AX0E", "B000FNK3Z4", "B00AETU4WQ", "B00BCLANP8"], "also_viewed": ["B000CNY6UK", "B0000CF3Q6", "B008G48DW4", "B004STBG7U", "B00067WBU4", "B0000AN3QN", "B0000AN3QI", "B00067WCM6", "B0032XJFAS", "B000ND3QN2", "B00LIE8TXM", "B000SSQ7EW", "B0000CFSS5", "B000FDL588", "B0002MIETK", "B0001SJH2I", "B0002MI972", "B000AA89GW", "B00IEHNOEK", "B00IEHKWY0", "B00KYG2LXY", "B0030LX198", "B000TDDVL8", "B001BKL8C2", "B002O0FXH4", "B001QMLETW", "B000BY58JS", "B001J1RVJM", "B003BVM3NC", "B008FOF86E", "B00009W5F0", "B000S75D66", "B000CRD4AO", "B000BIA62I", "B000SSMS72", "B001IHY622", "B002GWKVA4", "B000BYE6AA", "B001J1L59E", "B000BI2SG0", "B000NJHN30", "B0009Q1DSS", "B00263JWBW", "B002EWANQS", "B00585DOIM", "B000BU5KJK", "B003QVDRSC", "B00IEHPVJ6", "B00263JWD0", "B000BYCQF2", "B006KRZJXU", "B00J5CJCUS", "B002MB762A", "B000V6Y0F4", "B0023B14VS", "B001II0JIG", "B00C9GRRV8"], "bought_together": ["B002O0FXH4"]}, "title": "Bialetti 6988 Brikka Stovetop Percolator, 4-Cup", "price": 54.99, "salesRank": {"Kitchen & Dining": 12257}, "imUrl": "http://ecx.images-amazon.com/images/I/41VDTd4OIJL._SY300_.jpg", "brand": "Bialetti", "categories": [["Home & Kitchen", "Kitchen & Dining", "Home Brewing & Wine Making", "Beer Brewing"]], "description": "The Bialetti Brikka allows you to enjoy special coffee every day without leaving the comfort of your kitchen. The Brikka system revolutionized the stovetop espresso maker by preparing the espresso with 'crema&#x201D;. With the special pressure-controlled system that regulates the pressure of water flowing through the coffee grounds you can now enjoy the rich and intense flavor of a creamy coffee. Featuring an opening lid that allows the condensation to escape, flip-up top and side-pour spout provide added convenience. This stovetop brewer makes four 2-ounce cups of espresso in 4-5 minutes. Made of durable polished aluminum this pot features Bialetti's distinctive eight-sided shape that allows it to diffuse heat perfectly to enhance the aroma of your coffee. To use; fill the lower chamber with cold water just below the valve. Insert the funnel and fill it with ground espresso (do not tamp). Remove any coffee grounds on the edge of the funnel. Tightly screw the upper part of the pot on the base. Avoid using the handle for leverage. Select burner size to fit the bottom of pot. For gas stovetop, make sure the flame is not larger than bottom of pot. The flame should not come around the sides of the pot. Place pot on the stovetop until the water boils and coffee begins to come out of the center post. There will be a gurgling sound during this process. After 2 to 3 minutes, a small amount of coffee will trickle out and then you will hear a puffing noise. The froth will form in 3-4 seconds. When the top of the pot is full of coffee, remove from stove. Before pouring coffee, stir it in the upper chamber with a small spoon to equalize all the different coffee layers for optimum flavor. Note that the max boiler capacity is slightly more than the final output since there is always a little water left in the boiler after brewing. Bialetti is the world's most recognized and beloved Italian coffee company. Bialetti coffee makers have become iconic and has allowed millions of consumers to enjoy great Italian coffee that once was only available in cafes and restaurants. Bialetti's passion remains in making superb coffee simple. Made in Italy."}