{"asin": "B001GIPSA2", "description": "The Asus Eee PC 1000HA provides the power of a full-sized laptop in a compact body with an extra-large 10-inch screen, and is now powered by the latest Intel mobile processor. Designed specifically for mobile devices, the 1.6 GHz Intel Atom processor uses a brand new design structure new hafnium-infused circuitry--which reduces electrical current leakage in transistors--to conserve energy, giving you more time away from the wall outlet. Coupled with the ASUS exclusive Super Hybrid Engine, you'll also enjoy up to 7 hours of battery life with this Windows-powered laptop.The advantages of a full-sized laptop in a compact netbook with 10-inch screen. Seelarger version.Much more compact than a standard-sized notebook and weighing just over 3 pounds, the Eee PC 1000HA is perfect for students toting to school or road warriors packing away to Wi-Fi hotspots. The Eee PC 1000HA also features a 160 GB hard disk drive (HDD), 1 GB of RAM, 1.3-megapixel webcam integrated into the bezel above the LCD, 54g Wi-Fi networking (802.11b/g), Secure Digital memory card slot, multiple USB ports, a VGA output for connecting to a monitor.It comes preinstalled with the Microsoft Windows XP Home operating system, which offers more experienced users an enhanced and innovative experience that incorporates Windows Live features like Windows Live Messenger for instant messaging and Windows Live Mail for consolidated email accounts on your desktop. Complementing this is Microsoft Works, which equips the user with numerous office applications to work efficiently.The new Eee PC 1000HA has a customized, cutting-edge Infusion casing technology in Fine Ebony. Inlaid within the chassis itself, the motifs are an integral part of the entire cover and will not fade with time. The Infusion surface also provides a new level of resilience, providing scratch resistance and a beautiful style while out and about.It's also equipped with the ASUS Super Hybrid Engine for automatic detection and adjustments of CPU frequency, voltage, and LCD brightness to minimize system noise and power consumption to save up to 15 percent power consumption, or to maximize system performance according to individual needs.For journalists, photographers and other professionals who need to use a computer in the field to create, to communicate and to collaborate with other colleagues, the Eee PC's combination of power, extreme portability and rugged build makes it the ideal computing solution. The keyboard is 95 percent the size of standard notebooks, making it more comfortable to type for larger hands.It's also a great choice for young students, and it includes two modes of intuitive graphic user interface design to accommodate both experienced and inexperienced PC users. The Eee PC also handles your digital images, movies, and music as well as Internet radio.Nicely light at just 51 ounces (3.2 pounds), the Eee PC 1000HA has a 10-inch wide TFT LCD with a 1024 x 600-pixel resolution (WXGA)--making it more comfortable on eyes than its predecessor. In addition to its wireless LAN, it also offers wired Fast Ethernet (10/100) connectivity. You get three USB 2.0 ports, a VGA output for connecting to external monitors, headphone and microphone jacks, and a Secure Digital (SD) memory card slot (compatible with MMC memory cards). It's equipped with a 1.3-megapixel webcam (placed in the bezel above the LCD) and integrated microphone, allowing you to snap still photos of yourself while on the go for sending via email or join video chats with friends and family.Battery-Sipping ProcessorThe Intel Atom processor uses a brand new design structure that packs in 47 million transistors into a single chip sized at just 22mm (0.87 inches), and it uses just 2.5 watts of power--less than 1/10 of the 35 watts used by an Intel Core 2 Duo processor--for excellent battery management. This 1.6 GHz Atom N270 processor also includes a power-optimized front side bus of 533 MHz for faster data transfer on demanding mobile applications and a 512 KB L2 cache (which temporarily stores data).Together with the exclusive ASUS Super Hybrid Engine, you'll enjoy a longer battery lifespan of up to 7 hours, allowing you to stay in touch and be connected for a longer period of time while on-the-go. It offers a choice of performance and power consumption modes for easy adjustments according to your computing needs. The Super Hybrid Engine toggles between the following three modes:High Performance Mode (high performance with some power savings)Super Performance Mode (maximum performance)Power Saving Mode (maximum power savings and minimum noise)Online Storage from ASUSWith this Eee PC, ASUS also provides 10 GB of online storage (easily accessible via a desktop icon), which enables you to download up to 5 GB of data per day. It also provides secure file encryption and accessibility from both Windows and Linux platforms. Whether you want to share images with friends and family or store big business presentations, you can now access your data with ease and not worry about space constraints. The Eee Storage service is complimentary for the first 18 months, and it must be registered within the first 6 months after date of purchase.The Eee PC with Windows Home XP operating system provides a familiar interface.SpecificationsOperating system: Windows XP HomeInternal memory: 160 GB hard disk drive (HDD)RAM: 1 GB DDR2Processor: 1.6 GHz Intel AtomMemory expansion: Slot for MMC/SD(SDHC) cardsScreen: 10 inches, 1024 x 600 pixels, LED backlightNetworking: 54g Wi-Fi (802.11b/g), 10/100 Fast EthernetBluetooth connectivity: NoPeripheral connectivity: Three USB 2.0External video: One VGAExternal audio: One headphone and one microphone portWebcamera: Yes, 1.3 megapixelsBattery: 6 cells (6600 mAh), up to 7 hoursWeight: 3.19 pounds (51 ounces)Dimensions: 10.5 &times; 7.5 &times; 1.5 inchesWhat's in the BoxASUS Eee PC 1000HA, AC adapter, printed operating instructions. It's backed by a 1-year warranty on parts and labor.ZBD from ASUSAll Eee PC&rsquo;s come with ASUS&rsquo;s ZBD (Zero Bright Dot) guarantee. If the purchaser discovers one bright dot within 30 days of purchase, ASUS will replace the panel without cost to the purchaser.", "title": "ASUS Eee PC 1000HA 10-Inch Netbook (1.6 GHz Intel ATOM N270 Processor, 1 GB RAM, 160 GB Hard Drive, 10 GB E-Storage, XP Home, 6 Cell Battery)", "price": 399.99, "imUrl": "http://ecx.images-amazon.com/images/I/41HCBx9yOtL._SX300_.jpg", "related": {"also_viewed": ["B00BQH8QTI", "B0071N3AYC", "B00BQH8R9M", "B0071N6AC6", "B00COQK8QY", "B001KYPE6U", "B00COZRNX6", "B00CS5J99S", "B009P7LL2A", "B0030T17DW", "B0071N3BJ6", "B00D0TFM38", "B00AAIC5S2", "B00HZT1T5E", "B00J2T6RM0", "B008D9HZ62", "B005FF341C", "B00251BKCO", "B002UEC3AY", "B002TOPS98", "B00K5WEO0K", "B008XKHG9W", "B007582KGM", "B005DIPSQ0", "B009AANCKG", "B00IAYFAGC", "B0030KZ2GE"], "buy_after_viewing": ["B002UEC3AY", "B001KYPE6U", "B0080DR1T2", "B00BQH8QTI"]}, "categories": [["Electronics", "Computers & Accessories"]]}