{"asin": "B000U89KGW", "categories": [["Electronics", "Car & Vehicle Electronics", "Vehicle Electronics Accessories", "Radar Detectors"]], "description": "The Valentine One is one of the highest performing radar detectors on the market. One reason for this is multiple radar antennas! The only other detector with two radar antennas is the Bel STi Driver, but in the STi both antennas face forward. In the Valentine One, there is one forward antenna and one rear-facing antenna. Using this combination of antennas, it effectively tells you the band and strength of the radar signal, along with the number of \"bogeys,\" or radar units being detected. It will also tell you what direction the signal is coming from, and provide the best rear detection out of every other windshield-mounted detector on the market. Even when this sounds too good to be true, there's more. The Valentine One has excellent laser reception, consistently appearing at the top of tests in this category. In addition to the super high-performance of Valentine's detector, this model will never become obsolete. The very first Valentine detectors from 1992 look identical to the ones today, and can be sent in to Valentine to be updated with the latest hardware and software (charges may apply). If you decide on a Valentine One, you'll be in good hands with the same detector for the rest of your life.", "title": "Valentine One Radar Detector", "price": 484.98, "imUrl": "http://ecx.images-amazon.com/images/I/4151tXk6JuL._SX300_.jpg", "brand": "valentine one", "related": {"also_bought": ["B0063N7UGA", "B0030EOODW", "B00HSVJ25S", "B006074LT8", "B0027RJC2G", "B0065LWCYA", "B00JG5XY2G", "B0062PO02Q", "B00917KZIK", "B001DSIMAI", "B006G1PHLY", "B00I4GRVTK", "B00JG5RHLK", "B006G1OHE2", "B00C3UG3LA", "B005VFXSVC", "B001F0RPGG", "B003LL1JUA", "B00FFRSWYE", "B0002BGELQ", "B000OUSP12", "B00GTUIKMK", "B0058WKOUQ", "B008N04DC0", "B000FRLO9Y", "B000C19DNM", "B00AX49VBW", "B00G4DMS34", "B000PB8CQI", "B00ARF44N2", "B00F19Q7YI", "B00F9FCW7K", "B0026IBZSK", "B003TTL0TE", "B00F3F0GLU", "B009GDHYPQ"], "bought_together": ["B0063N7UGA", "B006074LT8"], "buy_after_viewing": ["B001F0RPGG", "B00E40QPX8", "B0065LWCYA", "B0063N7UGA"]}}