{"asin": "B00000K3X9", "description": "After several years in video game retirement, Sonic the Hedgehog returns as the star of a graphically stunning 3-D adventure game that blows away every other game in the genre. Sonic is joined by five of his friends in a massive quest that spans over 50 game levels filled with remarkable visuals and a pulsating soundtrack. Taking full advantage of the unprecedented processing power of the Dreamcast, Sega's development crew, Sonic Team, has designed several gravity-defying game levels that will keep gamers hooked.Our favorite level is Windy Valley, which requires you to survive the stormy perils of a tremendous tornado. This tyrant of nature chases you relentlessly before ultimately sucking you into the air and up through its eye. During the chase, the tornado manages to tear up just about everything on the screen. This dizzying visual spectacle moves so fast that you will literally hold on to the game controller for dear life.Assuming you survive the tornado, there are several more challenging areas to conquer, including a level that requires you to snowboard directly in the path of a fast-approaching avalanche. During the Emerald Coast level, you will race across a precarious dock as a killer whale attacks from below, destroying the wood planks underneath your feet while you attempt to outrun the crazed creature.We also liked the numerous mini-games scattered throughout this title. When you least expect it,Sonic Adventuretosses in some old-fashioned arcade action, such as pinball or bumper car racing. In between, you can raise virtual pets, known in the game as \"Chao.\" These characters, which are saved using the optional Visual Memory Unit (VMU), can be combined with other Chao characters exchanged between friends or downloaded via the Internet.Gamers looking to show off the strong processing power of the 128-bit Dreamcast will definitely want to pick up this title. Simply put,Sonic Adventure's graphics surpass those of any other game currently available on any home video game system. Let the Sonic assault begin.--Brett AtwoodPros:Strong replay valueStunning graphicsBonus virtual pet gameSix different game charactersCons:May be too fast-moving for some playersAwkward camera angles can inhibit gameplay in some areas", "price": 8.0, "imUrl": "http://ecx.images-amazon.com/images/I/61HTWWED4HL._SX300_.jpg", "related": {"also_bought": ["B00000K2R4", "B00004SA3J", "B000059Z7G", "B000IVF2VS", "B00000K2R6", "B002GC5YMY", "B00004R8V4", "B00000K13K", "B001QVDSRO", "B00005A775", "B00002EQAP", "B00HPU96FI", "B00004SA3U", "B00004T4XI", "B00004T4XO", "B00000K11O", "B00004SR5M", "B000035XKJ", "B000A7I7M6", "B00000K2R5", "B000VZICX6", "B00002971H", "B000028U2F", "B0002J1NWS", "B00004SA3R", "B00004T4XM", "B00000K4BX", "B00004S99M", "B00005CDR8", "B0007MZWQS", "B00004S9WU", "B00002ST7F", "B00004UFFV", "B000SL4IIG", "B00004UFFP", "B00005ME69", "B00004SA3K", "B001CYBXMC", "B00005ME6A", "B00004WKKC", "B000034DLH", "B00002STUI", "B00004TEQD", "B00000K2R8", "B00000TBQQ", "B00004YMZV", "B00004TTTU", "B00KX7672U", "B00000K2R7", "B0009OGJ02", "B00001P4QN", "B00002SVFQ", "B00004SR5N", "B00L3LQ4B4", "B002FY0CM0", "B0018N1DNG", "B00005C4GR", "B00002STXN", "B00000K4CC", "B00004SVYQ", "B00004U4QA"], "buy_after_viewing": ["B00000K2R4", "B00004SA3J", "B002GC5YMY", "B000059Z7G"]}, "salesRank": {"Video Games": 9871}, "categories": [["Video Games", "More Systems", "Sega Dreamcast", "Games"]]}