{"asin": "B00449KSKK", "description": "- New46mm Altura Photo Snap-On Lens Cap- Fits any lens with a 46mm filter thread; manual or autofocus, digital or film.- Easy to use. Quickly attaches to the front of your camera lens.- Protects your delicate lens from dust, dirt, and scratches.- Made of high impact plastic for extra durability.- Your camera's lens thread size will be marked somewhere on the lens barrel. This number is always preceded by a &quot;&quot; (diameter) symbol. For example: 46 = 46mm lens thread size.- A must have accessory for every photographer's kit!- PremiumMagicFiber Microfiber Cleaning Cloth- Ultra gentle! Extremely fine microfiber leaves zero scratches, streaks or marks. Safe for all lenses.- Features special saw tooth pattern edges. Other sellers' cloths have unfinished edges that will fray easily, the weave becoming undone and threads pulling out easily. Our microfibers are made with premium materials and designed to the highest standard of quality.- Ideal for cleaning oil and dirt off eyeglasses, iPhone/iPad and other touch screens, binocular lenses, digital SLR and other camera lenses, GPS devices, and other delicate optics.- Clean without the need of soaps or detergents. Wipe down kids' toys, cribs, stainless steel counters and other areas you want to keep chemical free.- Great value for your money. Reusable and long lasting. No more paper towel and tissue waste.- Extremely handy! Keep one in your office, home office, laptop bag, camera bag and car.- Size: 6 x 7 inches (15cm x 18cm)- Each microfiber is individually and neatly packed in it's own polyurethane plastic bag for long term safekeeping.", "title": "46MM Altura Photo Snap-On Front Lens Cap for PANASONIC Lumix G Series DMC-GX7 DMC-GF6 DMC-GF5 DMC-G6 DMC-G5 DMC-GH3 Compact Cameras or other Cameras with a 46MM Filter Thread Lens + MagicFiber Microfiber Lens Cleaning Cloth", "price": 3.99, "imUrl": "http://ecx.images-amazon.com/images/I/514rXNV1e1L._SY300_.jpg", "related": {"also_bought": ["B00IAS60VM", "B0052M1FU0", "B00603RU18", "B0000BZL1P", "B00H6BU3J4", "B00I3J4NG2", "B004LO7WGG", "B0084FM5JC", "B009DL0LOW", "B0058PL9QG", "B00BS4KUCK", "B0057LX9H8", "B00E87OITK", "B003Y2WUJ0", "B001ISKNKA"], "bought_together": ["B00IAS60VM"], "buy_after_viewing": ["B005KK40ZQ", "B0071UHPTQ", "B0052M5MXG", "B008I5ZPB8"]}, "categories": [["Electronics", "Camera & Photo", "Accessories", "Lens Accessories", "Lens Caps"]]}