{"asin": "B001G5ZTZO", "related": {"also_bought": ["B004A2BX2S", "1928873901", "B001G5ZU0I", "B0056MHRMG", "B002LITT3I", "B003GGN2SM", "B0049UX7WA", "B0039BPG1A", "B003VNKNEQ", "B00330O2U8", "B004KIGGRE"], "bought_together": ["B003VNKNEQ"], "buy_after_viewing": ["B003VNKNF0", "B003VNKNEQ", "B0039BPG1A", "B002LITT3I"]}, "title": "Canon Powershot SX10IS 10MP Digital Camera with 20x Wide Angle Optical Image Stabilized Zoom", "price": 648.88, "salesRank": {"Camera &amp; Photo": 4814}, "imUrl": "http://ecx.images-amazon.com/images/I/41ZKW9pmZVL._SX300_.jpg", "brand": "Canon", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Whether the action is fast or slow, close up or far away, you&#x92;ll always get the shot you want with the PowerShot SX10 IS. This camera puts you on the cutting edge of advanced technology, with an incredibly powerful 20x optical zoom, 10-megapixel resolution, and new DIGIC 4 Image Processor for high-performance face and motion detection.PowerShot SX10IS Highlights20x optical zoom in actionStay close to the action with a 20x Optical Zoom, wide-angle lens and Optical Image StabilizerThe PowerShot SX10 IS is equipped with a 20x optical zoom lens with a focal length of 5.0-100mm (35mm film equivalent: 28-560mm) that allows you to shoot any scene from wide-angle to telephoto. The camera uses a VCM (Voice Coil Motor) for high-speed, quiet, energy-efficient lens movement with precise control. Focal length is conveniently indicated on the lens barrel.The lens is optimized to fully exploit its zoom length and wide shooting angle in concert with the camera&#x92;s high 10.0-megapixel resolution. UD glass effectively suppresses chromatic aberration, while enhanced negative refractive power ensures that distortion at the wide-angle is also corrected. Further aberration is controlled with the inclusion of a double-sided aspherical glass-molded lens and ultra-high refraction index lens.Powerful 10.0-megapixel resolution for greater printing and editingThe PowerShot SX10 IS is equipped with many of the same features as a higher-end camera: an ultrapowerful zoom, eye-popping resolution and advanced picture-improving technology. 10.0 megapixels of resolution give your photography incomparable depth and ensure that any section of any shot can be enlarged and cropped with no loss in quality when you edit the image and even in large printout. It creates crisp, clear 13 x 19-inch posters.2.5-inch Vari-angle LCD for flexible viewing at nearly every angleThe camera&#x92;s 2.5-inch LCD screen gives you the big picture, whether you&#x92;re shooting, reviewing or showing off your images. This high-resolution screen offers a crisp, clear picture to make shooting, playback and using the camera&#x92;s menu functions especially convenient. Clear and bright, it also features Night Display for easy viewing in low light. It also has an electronic viewfinder that provides sharp images when you shoot close-up with Super Macro shooting mode.New DIGIC 4 Image Processor improves Face Detection, adds Servo AF, Face Detection Self-Timer and Intelligent Contrast CorrectionDIGIC 4 Image ProcessorCanon&#x92;s proprietary DIGIC Image Processors have long set its cameras apart from the competition, and the new DIGIC 4 sets the bar even higher. Faster, more accurate noise reduction delivers better image quality, even at high ISO speeds.iSAPS Technologyis an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the advanced DIGIC 4 Image Processor to improve focus speed and accuracy, as well as exposure and white balance.A newFace Self-Timerautomatically detects an increase in the number of faces and makes the appropriate adjustments. For instance, to include photographer&#x92;s face in a group shot, there&#x92;s no need to rush in. Just put the camera on a stand or tripod, and specify Face Self-Timer, and the camera will wait for the photographer&#x92;s face to get on-camera before it takes the shot. Motion Detection now tracks moving subjects in a much larger range, and the new Servo AF retains focus on a moving subject after the shutter button is pressed halfway -- allowing you to wait for the perfect shot without refocusing. Also, Face Detection and Motion Detection are markedly improved.Intelligent Contrast CorrectionIntelligent Contrast CorrectionDIGIC 4 also makes possible the new i-Contrast (Intelligent Contrast Correction) system, which controls the compensation level in pixel units to brighten dark areas while leaving bright areas unchanged for better images where the main subject is dark, and more natural transition. The PowerShot SX10 IS can even use i-Contrast in playback mode to adjust images that were shot without the setting activated.Red-eye Correctionprovides three options for removing red-eye from subjects in flash pictures.1) The Red-eye Correction during shooting actually identifies and corrects red-eye in human subjects as pictures are taken.2) The SX10 IS can be set to automatically detect and correct red-eye during image playback. 3) You can manually locate any red eyes in a scene during image playback on the LCD screen, and command the camera to remove them.Life doesn&#x92;t give you second chances to capture special times. That&#x92;s why the SX10 IS features ISO 1600 and High ISO Auto settings that reduce the effects of camera shake and sharpen subjects in low-light situations, giving you greater shooting flexibility. ISO can be expanded to 3200 when you select ISO 3200 Special Scene mode.MovieSnap mode lets you capture high-resolution still images while shooting a movieWith Movie Snap, you&#x92;ll never miss a perfect still shot just because you&#x92;re in the middle of shooting a movie. Simply press the shutter to record a high-resolution still. The PowerShot SX10 IS supports the MOV video format which reduces data volume by approximately 60 percent. This allows you to record longer movies while maintaining optimal image quality.A wide range of shooting modes to capture anythingNow you&#x92;re free to concentrate on what really counts--your subject. With the large, simple-to-operate Mode Dial, all you have to do is turn to the setting that best matches the scene you&#x92;re viewing through the lens. The PowerShot SX10 IS does the rest. It chooses the perfect exposure, aperture and flash. Or, if you want to flex your creative muscles, choose Manual Control and do it all yourself. You&#x92;ve got Special Scenes Modes to handle a wide range of common shooting situations--effortlessly.With 24 Shooting Modes including 11 Special Scene Modes, you&#x92;re ready for whatever shot comes your way.Print/Share Button for easy direct printing and downloadingThe PowerShot SX10 IS's Print/Share button makes direct printing easier than ever. Simply connect the SX10 IS to a Canon PIXMA Photo Printer or SELPHY Compact Photo Printer or any PictBridge compatible photo printer, press the lighted Print/Share button and print! Also use the Print/Share button to transfer images to a computer (Windows and Macintosh).Print your own ID photos in up to 28 different sizes or use the Movie Print function to output multiple stills from a recorded movie on a single sheet with a Canon SELPHY Compact Photo Printer.What's in the BoxPowerShot SX10 IS Camera BodyLens CapLens Hood LH-DC50Neck Strap NS-DC44 AA-type Alkaline BatteriesStereo Video Cable STV-250NInterface Cable IFC-400PCUSolution DiskUser Guide"}