{"asin": "B0035AN31A", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "FM Transmitters"]], "description": "Find the best station for your FM Transmitter&mdash;with a little help from your iPod Touch or iPhone&rsquo;s GPS.Now you can listen to your iPod Touch or iPhone music through your car stereo and quickly find the best FM station with the help of your iPod&rsquo;s GPS system and location-based user feedback. TuneCast Auto Live combines ClearScan Technology with Belkin&rsquo;s ClearScan Live iPod Touch/iPhone app to provide the best FM station recommendations wherever you drive.The Only FM Transmitter with GPS-Assisted Station LocatorTuneCast  Auto Live is the only FM transmitter with GPS-assisted scanning, for  the best audio quality for your drive. The ClearScan Live app is  available free through iTunes&mdash;just download and launch the app from your  iPhone. You&rsquo;ll get the best FM scanning technology at the push of a  button, and station recommendations from other TuneCast Auto Live users  in your area based on your GPS coordinates. You can also contribute to  the quality of ClearScan Live's recommendations by rating how well  stations work where you are.Control at Your FingertipsControl  your FM transmission and music seamlessly from your iPhone screen&mdash;no  need to fumble with separate FM buttons. ClearScan Live lets you display  the current FM frequency and control the transmitter directly from your  device.Don&rsquo;t worry if you don&rsquo;t have an iPod Touch or iPhone&mdash;TuneCast Auto  Live also works with iPod Nano and Classic. ClearScan Technology  lets iPod users scan for the best FM frequency without an app. TuneCast  Auto Live&rsquo;s high-contrast backlit display lets you see the station  clearly, and the tactile buttons make it easy to control.TuneCast Auto Live also has two programmable preset buttons and a PRO setting for optimizing audio and boosting volume.Arrive Fully ChargedThe dock connector charges through your car's 12-volt lighter outlet to keep your device fully charged while playing.", "title": "Belkin Tunecast FM Transmitter for Apple iPod, iPhone 3, iPhone 3G, iPhone 4, and iPhone 4S", "price": 39.49, "imUrl": "http://ecx.images-amazon.com/images/I/41aoYHsviAL._SY300_.jpg", "brand": "BELKIN", "related": {"also_bought": ["B003ZZ26OK", "B007FHX9OK", "B0016LE80K", "B00H7WNB3M", "B00006IBO5", "B004JRY402"], "bought_together": ["B007FHX9OK"], "buy_after_viewing": ["B00HIATW04", "B001DQL66M", "B003ZZ26OK", "B00JP5QAWI"]}}