{"asin": "B00000K10U", "description": "The first Dreamcast installment in the Resident Evil series,Code:  Veronicais \"survival horror\" at its finest. Unmatched in its ability to  convey a persistent feeling of dread--and scare the pants off of you ever so  often--this is one of those hard-to-put-down games that will keep you up for  several nights on end.The fourth chapter in the dark Resident Evil epic,Code: Veronicadelves  further into the machinations of the sinister Umbrella Corporation, once again  pitting players against zombies and other horrifying mutations created by  Umbrella's biotechnological viruses. Players begin the game as Claire Redfield,Resident Evil 2's college-girl-turned-zombie-killer, and later control  Chris Redfield, the beefcake cop from the original game. There's more strategy  required here than in the previous games, as Claire's actions have a direct  impact on Chris. For example, playing a trigger-happy Claire that uses every  health-restoring item in sight will call for some fancy footwork on the part of  brother Chris.While the basic game design here is largely unchanged from that of its  PlayStation predecessors,Code: Veronicafeatures many visual  refinements--including exquisitely detailed 3-D character graphics, roaming  camera viewpoints, and spectacular atmospheric and lighting effects--that  greatly enhance the cinematic feel of the game. Equally high production values  are evident in the game's excellent use of ambient and dynamic sound effects.Upon completingCode: Veronica, players are rewarded with \"Battle Game,\"  a timed slaughterfest that can be played in third- or first-person point-of-view  and has rewards all its own.--Joe HonPros:Engrossing storyline and well-developed charactersCinematic Dreamcast-enhanced graphics and excellent sound effectsChallenging, first-rate gameplay\"Battle Game\" greatly increases replay valueCons:Despite nonfixed camera angles, viewpoint can still be awkward at timesLess than perfect controls", "price": 8.0, "imUrl": "http://ecx.images-amazon.com/images/I/51XWRQH4WKL._SX300_.jpg", "related": {"also_bought": ["B00000K2R4", "B00004SA3J", "B00000K125", "B00000K3X9", "B0000488VP", "B00004S99R", "B000IVF2VS", "B00004KHAE", "B00004S99S", "B00HPU96FI", "B000059Z7G", "B00004KHAG", "B00000K4BU", "B00000K2R6", "B0000568U1", "B00004S99N", "B00004R8V4", "B00004SWL9", "B00005LOYC", "B00004WLVV", "B00001P4Y6", "B00004T4XJ", "B00004SR5M", "B002GC5YMY", "B0000541Z7", "B000055YVY", "B00005A775", "B0000488VO", "B00001ZWUQ", "B000028U2E", "B00004UDVL", "B001QVDSRO", "B00006LELI", "B00004U62B", "B00004TEXF", "B000A7I7M6", "B00000I1BY", "B0000657SP", "B00000K117", "B00004YMZY", "B00000K10O", "B00004KHDM", "B00000K2R5", "B00000K115", "B000059Z7H", "B00000K4C7", "B00004T4XI", "B0000488VR", "B00000K13K", "B00004R9FG", "B00002971H", "B00004SA3R", "B00002EQAP", "B000034DMG", "B00004SR5H", "B00004S99M", "B00000K2G7", "B00004SA3U", "B0002A6CQ4", "B00004R9FI", "B00004WMVL", "B00004RC1Y", "B0019LMXAY", "B00004WFZQ", "B0007L8GPI", "B00005CDR8", "B00002SV0U", "B000035YBP", "B0000TSRA6", "B00002970R", "B00000K11O", "B00004T4XM", "B000034DLH", "B00000K119", "B000VZICX6", "B000035YBQ", "B00004WMVK", "B00004RBOV", "B0000488VT", "B000056FLL", "B00004W4S2", "B000035XR9", "B00005CFHM", "B00004TEQE", "B00002SWF8", "B008FPMBNG", "B002GCFI2K", "B00000K4BX", "B00000K11D", "B00269DXXO", "B000058513", "B00005AYE6", "B000053VWB", "B00004XOM2", "B00001X50M", "B00004SW21", "B000028U2F"], "buy_after_viewing": ["B00004SA3J", "B00000K2R4", "B000IVF2VS", "B00004S99R"]}, "salesRank": {"Video Games": 7471}, "categories": [["Video Games", "More Systems", "Sega Dreamcast", "Games"]]}