{"asin": "B00008DHNL", "description": "True Crime: Streets of L.A.is aGrand-Theft-Auto-esque action/driving/shooter that allows you to take control of Nick Kang, a cop out to solve a strange rash of crimes and solve his father's mysterious murder. The game treats itself like a movie, with frequent dialogue and cinematics, a soundtrack filled with some of rap's heavy hitters, and some surprising voiceover talent, like Christopher Walken and Snoop Dogg.The missions given to you tend to involve shooting up or beating up (there is a big distinction between gun fighting and kung fu) a room full of bad guys, or simply have you racing against the clock in your car. In between, you can roam around and solve simple street crimes (mugging, car jackings, etc), or earn upgrades for your driving, shooting, and fighting abilities. The upgrade mechanism is important because while it's an entertaining way to add new gameplay elements several hours in, the early game leaves you with so few moves that the game is hard, or worse, boring. The game also features a Good-Cop/Bad-Cop karma system that rewards or punishes you for doing the right or wrong thing. Arrest criminals in non-lethal manner to get better endings, or terrorize the populace and have both citizens and police turn on you.While it can be an entertaining take on theGrand Theft Autogenre,True Crimetends to suffer from hit and miss execution. For every compelling game element, there's another equally awful one. There are several mission types that are completely devoid of any fun, melee fighting favors button mashing even after the nearly-useless string of upgrades, and the controls and camera seem to work against you more often than for you. Ultimately, hardcoreGrand Theft Autofans and the infinitely patient may be in for a treat, but everyone else is advised to think twice about this game.--Jon \"Safety Monkey\" GroverPros:Variety of mission types keeps game from getting overly repetitiveKarma system and plenty of alternate cinematics add to replay valueExcellent voice work and above average graphicsCons:Controls feel sloppy and the camera will make you want to punch out your TVCertain mission-types are just plain boringMelee fighting favors button mashing over thought-out, timed attacks", "price": 12.99, "imUrl": "http://ecx.images-amazon.com/images/I/51EH7DRRGTL._SY300_.jpg", "related": {"also_bought": ["B0009Z3HXI", "B0007PLKZM", "B00005OLX1", "B0001VGFK2", "B00006Z7I3", "B0000696CZ", "B000930DLO", "B0002IQCSY", "B0009351R0", "B0009SQF0C", "B0000A8VBZ", "B000F0GX8I", "B0001ADAME", "B0009VRSIC", "B00005CF9L", "B000EHQDA0", "B000KCX9M4", "B00005O0I2", "B0000TSRA6", "B000EMJA3M", "B0000A92KX", "B0009Z3HYW", "B0000A03AG", "B00009WAVD", "B000088KH1", "B00007D02V", "B00005J32C", "B0006ZJPR8", "B000TLU67W", "B0006I5FL0", "B00020V5B6", "B00097CYZS", "B0009EHQVI", "B0009PETYO", "B000B69E9G", "B001CLG6SG", "B000AOEUPC", "B000NGWFX6", "B0000C7GHG", "B001MW91IW", "B00005U8TQ", "B00005YXW7", "B000E5N4SQ", "B00020BV2E", "B000HAUODG", "B000095ZH5", "B0009R1T9K", "B00009ZVHY", "B00020LZAW", "B0000A082Y", "B00004YRQA", "B00005NN5A", "B0007SL1ZI", "B000930DOQ", "B000NIJ35W", "B0002CTTQM", "B0007L8GPI", "B0001AVZ5I", "9629971372", "B0007M221Q", "B00019AZBO", "B00006JN5H", "B00004YRQ9", "B0000B0MNH", "B0002CNUN0", "B0000TSR4C", "B000NJH6PU", "B0002IQD3I", "B00005J536", "B00005BK7X", "B0002J9UBY", "B000099T2G", "B000069BD9", "B00006GSNZ", "B00004UFRI", "B0002XL3BA", "B0000ARQMW", "B000Q6CZYM", "B00005ML10", "B00005V6BB", "B002I0H0SA", "B0000VSH3G", "B000FW300K", "B000HKKPZ8", "B0009O7HVM", "B004S3KB6S", "B00009VE6D", "B00004TNDE", "B000G6SPHI", "B00009XS6J", "B0009350BW", "B00005ME6N", "B00005NN5J", "B00005NUIZ", "B000G79YNQ", "B0000A0MDV", "B000099T2H", "B000GVYYFK", "B0008GJRRS"], "bought_together": ["B0007PLKZM"], "buy_after_viewing": ["B0009Z3HXI", "9629971372", "B0001ADAME", "B0001VGFK2"]}, "salesRank": {"Video Games": 8962}, "categories": [["Video Games", "More Systems", "PlayStation 2", "Games"]]}