{"asin": "B001FSKDWG", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Compact System Cameras"]], "description": "With the G1, Panasonic has developed an entirely new-concept digital camera that takes even greater advantage of the compactness and light weight inherent in the Four Thirds System Standard. By increasing the number of electrical contacts between camera body and lens, Panasonic has also increased camera expandability and maximized the future potential of the G1, including compatibility with future features. In addition, the versatile G1 accepts not only Micro Four Thirds System interchangeable lenses, but also conventional Four Thirds System lenses (when an optional adapter is mounted). This means that users can continue to use Four Thirds lenses they already own.The G1 is the world's first camera to employ the new Micro Four Thirds System standard. Together with an innovative mirror-less structure that also dramatically downsizes the camera body, the LUMIX G Micro System achieves a dramatic portability and ease of use by an adoption of electronic Full-time Live View Finder instead of conventional optical viewfinder. Despite the G1's ultra-compact design, it comes fully equipped with features that assure outstanding ease of use, made possible by the contrast AF system. The G1 also boasts iA (Intelligent Auto) mode, a feature that took the world by storm in Lumix digital compact cameras. iA mode brings together a full range of functions - led by AF Tracking , Face Detection, Intelligent ISO Control and Intelligent Exposure - that together let users take strikingly beautiful photos with maximum ease every time they shoot. The G1 breaks new ground in styling too, overturning SLR camera conventions by giving users a variety of body colors to choose from. For people who have been hesitant about moving up to an SLR camera, the G1 is a perfect fit. It is a small, sophisticated, easy-to-use camera that will greatly expand any user's photographic capabilities.The G1's Live MOS sensor gives users the benefits of Full-time Live View both when viewing the Free-Angle LCD and when looking through the viewfinder. Other new conveniences made possible by the contrast AF include 1-area-focusing, AF Tracking, and a preview functions that show the photographer how changing the shutter speed (and other settings) will affect the photograph. The large 3.0-inch free-angle LCD, with its 100 percent field of view and sharp 460,000-dot resolution, lets the photographer check even fine details when composing an image or viewing a shot just taken.Behind the G1's exceptional image quality is a 4/3-type 12.1-megapixel Live MOS sensor that boasts a wide dynamic range and low power consumption, plus Panasonic's new Venus Engine HD imaging processor, with its superb noise reduction performance and expandability represented by HDMI output capability. Because dust entering the body is a concern with all interchangeable lens cameras, Panasonic equipped the G1 with a Supersonic Wave Filter as part of a Dust Reduction System designed to prevent dust and other foreign matter from adhering to the image sensor.In addition to accepting Micro Four Thirds lenses, the G1 can be fitted with a mount adapter that allows the use of standard Four Thirds lenses. This greatly expands the assortment of lenses available to users. They can choose lenses from a variety of manufacturers and in a variety of combinations, for virtually unlimited photographic capabilities. A wide range of special accessories is available too. The G1 also is equipped with a mini HDMI output terminal for easy connection with other AV devices. With features like these, the G1 gives users a host of photographic and entertainment possibilities to explore.The stylish Lumix DMC-G1 is an entirely new kind of digital camera with an unprecedented feature set. Especially for people who have never before used an interchangeable lens camera, and for those who have tried one but didn't find it comfortable, the easy-to-use G1 can open the door to a world of fun, beauty and unlimited creative possibilities.Panasonic Lumix DMC-G1 HighlightsUltra compact Digital Interchangeable Lens Camera: Made Possible by the Micro Four Thirds System StandardWith the G1, Panasonic introduces an innovative mirror-less structure that dramatically downsizes the camera body. The G1 is far more compact than conventional SLR camera on the market, thanks in large part to the Micro Four Thirds System, a new standard for interchangeable lens cameras. This new system has made it possible to reduce the flange back distance (between the mount and the image sensor) to approx. 20 mm--half the 40 mm specified in the Four Thirds System. The outside diameter of the mount is also reduced, by about 6 mm.The Micro Four Thirds System makes it possible to downsize not only the camera body, but the lenses too--particularly wide-angle lenses and high-power zoom lenses--while maintaining the superior image quality characteristic of the 4/3 image sensor. The G1's ground-breaking structural design forever dispels the notion that an interchangeable lens camera has to be big and heavy--a drawback that's deterred many people from switching to an digital SLR. Even with its generous 3.0-inch LCD, the G1 is extremely compact--and there is absolutely no compromise in function or performance.Size comparison: G1 vs. L10Another attractive feature that separates the G1 from conventional digital SLR cameras is the choice of body colors. While traditionalists can choose the standard black body, others will enjoy the appealing blue and red colors available. With its exceptional mobility and features, the G1 offers a new style of photography; with its design and color selection, it offers a new sense of camera style.Full-time Live View and Contrast AFWith the G1 users enjoy the advantages of Full-time Live View not only when viewing the LCD, but when using the electronic viewfinder too. The G1's viewfinder system retains the outstanding viewability of an optical viewfinder and can also display information about camera settings that the user can see without taking his or her eye from the subject. This is one of the ways Full-time Live View uses digital technology to give the photographer useful new features and functions. In addition to a mirror-less structure, the G1 features a high-resolution 1,440,000-dot equivalent Live View Finder.A clever built-in eye sensor automatically switches on the viewfinder when the user looks into it, then switches it off and turns on the 3.0-inch high-resolution 460,000-dot LCD (which boasts a wide viewing angle) when the user looks away from the viewfinder. The 60-frames-per-second Live View is made possible by the Live MOS sensor, which takes signals directly from the image sensor and sends them continuously to the LCD, in real time. You can use either auto focus or manual focus while using the Full-time Live View.Both the Live View Finder and LCD provide a 100 percent field of view. This allows the user, when composing a shot, to check the framing accurately from corner to corner.The G1 introduces a new Contrast AF function that is not only accurate and easy to use, but also very fast. Users can choose from a wide range of AF modes, including multiple-area AF with up to 23 focus areas, 1-area AF with a selectable focus area, Face Detection, and AF Tracking. In the 1-area AF mode, the AF frame size can be changed by simply turning a dial. The G1 also has a Quick AF function that begins focusing as soon as the user aims the camera--no waiting for him or her to press the shutter button halfway. This provides a quicker focusing that can help capture the subject before the crucial moment passes. Continuous AF keeps the subject in focus at all times.  With the G1's many auto focus modes, there's an option that's just right for any shooting situation.High-resolution Live View Finder and Free-angle 3-inch 3:2 460,000-dot LCDA large, clear, easy-to-see LCD, that rotates 180 degrees horizontally and 270 degrees vertically is upgraded both in size and resolution to be 3.0-inch with 460,000-dot high resolution to offer even more comfortable view for both monitoring when shooting and for playing back the results. Extraordinary 3:2 aspect of the LCD on DMC-G1 is familiar to those who are used to analog film cameras. The G1 is designed for easy viewing, no matter where your photographic pursuits take you. When the lighting around you changes, the LCD changes too. The Auto Power LCD function automatically boosts brightness by as much as 40 percent, depending on the shooting condition. The LCD monitor remains easy to see at all times. This helps make framing a shot with Full-time Live View even easier.The DMC-G1's Live View Finder has the large 1.4x (0.7x on 35mm equiv.) magnification and the 100-percent field of view as the optical viewfinders on high-end digital SLR cameras. This, plus the 1,440,000-dot equivalent resolution, makes it easy to shoot the exact image the camera sees. Surprisingly, when you look into the viewfinder, a sensor automatically turns the Live View Finder on and the LCD off. You enjoy smoother, easier shooting without having to switch the setting of display.Sure and easy framing in real time with approximately 100 percent field of viewIn addition, customize the camera to fit your shooting preference by changing the display style or switching to a full-screen display. The user enjoys a seamless 60fps Live View both on the LCD and LVF. The G1's Live View Finder, which is based on a field sequential system that uses RGB 3-independent sequential illumination to produce 180 fps for each of the three colors, gives the user a clear, natural and comfortable view when framing a shot. The LCD can swivel 180 degrees horizontally and 270 degrees vertically, giving the user the flexibility to take low-angle and high-angle shots easily and comfortably. The DMC-G1 also features the Quick Menu, so you can make a variety of settings without taking your eye from the Live View Finder.Great Photography Is Not Only from Professional Photographers Anymore--Intelligent Auto ModeWhen you don't know which mode will give you the best shooting results, or when a sudden photo opportunity pops up and you don't have time to make any settings, simply choose iA (Intelligent Auto) mode and let the camera do it all for you. This advanced mode includes MEGA O.I.S. to detect hand-shake, Intelligent ISO Control to detect subject movement, Face Detection to detect faces in the frame, Intelligent Scene Selector to detect scene conditions, Light Detection to detect the brightness level, and AF Tracking to continually track a moving subject and keep it in focus. These six functions work automatically and simultaneously in iA Mode to optimize your settings, making it easier than ever to take beautiful photos every time.Shake Detection--MEGA O.I.S.(Optical Image Stabilizer)MEGA O.I.S., implemented in the lens, compensates for the blurring caused by hand-shake. Even slight hand-shake movement is accurately detected by a sampling frequency of 4,000 times per second, and compensated to produce sharp, clear images. It also works for zoom shots and macro shots, which are especially susceptible to hand-shake, and lets you shoot in dimly lit rooms or evening illumination, without a flash, to preserve the mood.Motion Detection--Intelligent ISO ControlThe Intelligent ISO Control function detects subject movement and automatically adjusts the ISO setting and shutter speed to best suit the movement and light conditions. When it detects subject motion, it automatically raises the ISO setting and increases the shutter speed to prevent motion blur. On the other hand, when the subject is still and no movement is detected, it takes beautifully natural photos with a low ISO setting. Intelligent ISO Control gives you stunning images with ease because there is no need for complicated settings.Light Detection--Intelligent ExposureThe Intelligent Exposure function increases the exposure only in under-exposed areas by detecting the brightness level part-by-part in the picture. If the background includes the sky, which tends to be easily washed out, the camera automatically adjusts the aperture and shutter speed to keep the setting slightly under-exposed to prevent wash-out while brightening the darkened area by increasing the ISO only in that area. If the background of an indoor portrait receives insufficient lighting from a flash and becomes dark, the ISO sensitivity is raised in only the low-lit area to make it brighter without causing graininess in the subject's face. When Intelligent Exposure is turned on, the icon changes from white to yellow. In addition, you can adjust the effect in three levels in normal shooting mode: high, normal, and low.Face Detection AF/AEFace Detection--Face Detection AF/AEThe Face Detection function detects faces and automatically optimizes the focus and exposure settings. It prevents the blurry faces that happen when the camera focuses on something in front of or behind the subject, and keeps faces from appearing dark when shooting indoors or against the light source. It detects up to 15 faces at a time, making it extremely convenient for group photos. Once the camera detects a face, Face Tracking follows it even when the subject moves around. This makes it easy to capture the person's face quickly if he or she is moving. It is also equipped with Digital Red-eye Correction. The camera takes care of the red-eye effect that often happens when shooting with a flash, to ensure attractive facial expression always.Scene Detection - Intelligent Scene SelectorWhen the camera's in iA (Intelligent Auto) Mode, the Intelligent Scene Selector automatically sets the Scene Mode to either Scenery, Portrait, Close-up, Night Portrait or Night Scenery. The camera judges it from the various detection results such as focusing distance, inclusion of human face and brightness level of the circumstance. You are free from annoying settings every time scene changes when taking pictures with these most frequently used Scene Modes to get beautiful results even before you know it.Subject Detection--AF TrackingSimply focus on your subject, then press the shutter button to activate AF Tracking. Even when you remove your finger from the shutter button, the camera continues to automatically keep your moving subject in focus. This keeps the focus sharp and blur-free when shooting active children or pets, as well as when capturing sports scenes or subjects in a moving object. It minimizes the shutter time lag so you won't miss those spur-of-the-moment shots, and helps to give you truly beautiful photos always.The user can activate all of these useful, convenient shooting-assist functions by simply selecting iA mode. This makes the DMC-G1 the ultimate, super-versatile automatic camera for capturing clear, beautiful, mistake-free photos with ease despite its high quality image rendering capability as a system camera.A Host of Creative OptionsMy Color Mode is a special option that gives free rein to the user's creativity. In My Color mode you can freely adjust the color, brightness and saturation parameters, while checking the Full-time Live View image to see how those adjustments affect the picture. This makes it easier and more fun to create interesting, expressive images. Adjust the settings that best suit the shooting conditions and your expressive intent, and then enjoy your own photography.Furthermore, the DMC-G1 provides options of picture taste with the function called Film Mode. Each analog film has its characteristics such as with color, contrast, gradation and which affects on the outcome of the picture, in other words, it is one of the ways of expression. With the DMC-G1, the Film Mode allows you to choose the one that takes the best advantage of the scene or the subject you take out of a total of nine film modes including Standard, Dynamic, Nature, Smooth, Nostalgic, Vibrant, Standard B/W, Dynamic B/W and Smooth B/W, with capability of fine adjustment of contrast, sharpness, saturation and noise reduction. Users can also shoot the same scene in 3 different films using the new Multi Film mode. All these settings can be confirmed before you take the picture and the result is always as you intended.The Full-time Live View lets the users check the outcome image in advance after adjusting the shutter speed, aperture or white balance. The white balance can be adjusted in the area of two-axis of coordinates precisely. And also the white balance bracket in 3 pictures either along with A(amber)-B(Blue) axis or G(Green)-M(Magenta) axis is now available for G1.High Image Quality as an Interchangeable Lens System CameraThe 4/3-type 12.1-megapixel Live MOS sensor featured in the DMC-G1 offers the best of both worlds--the superior image quality of a CCD sensor, and the lower power consumption of a CMOS sensor. New technology that makes it possible to read 4 channels of data simultaneously also helps the G1 deliver 60 frames-per-second Full-time Live View images, while faithfully reproducing high-resolution images with fine detail and rich gradation.For the image processing LSI, the new Venus Engine HD features exceptionally advanced signal processing capabilities. This sophisticated LSI separates chromatic noise from luminance noise and applies the optimal noise reduction to each, so you capture clear and beautiful images even when shooting at high ISO sensitivity levels. The Venus Engine HD also provides independent gradation control for each of the R, G and B colors, so even delicate color nuances are reproduced faithfully.  Linking smoothly with the Live MOS sensor, the Venus Engine HD records stunning high-resolution 12-megapixel images with exceptional accuracy. Signals containing a large amount of image data are sent from the Live MOS sensor to the high-resolution Live View Finder, resulting in the 1.44 million-dot equivalent sharp clear images at 60 fps. The Venus Engine HD also supports an extensive range of functions, including HDMI output.If dust or other foreign matter gets inside the camera when you're changing lenses, it could cling to the image sensor and show up as a spot in your photos. The Dust Reduction System in the LUMIX DMC-G1 helps eliminate this possibility by placing a supersonic wave filter in front of the Live MOS sensor. Vibrating around 50,000 times per second, the filter repels dust and other particles.Superb Expandability for More FunThe DMC-G1 and LUMIX G Micro System is compatible with any interchangeable lens that complies with the Four Thirds Standard. This gives you access to the entire range of Four Thirds lenses. And a stream of new Micro Four Thirds lenses will be announced in the future, giving you a large, diverse line of high-performance lenses to add to your photographic toolbox. With the LUMIX G Micro System and the growing assortment of lenses becoming available, your expressive possibilities are unlimited. The DMC-G1 is a system camera with a wide variety of options to choose from to match your shooting situations and style.High-Definition NetworkingThe G1 has an HDMI output terminal. When the G1 is connected to an HDMI-compatible TV via an HDMI mini cable (purchased separately), the user can easily enjoy a slideshow of photos taken with the G1. When the G1 is connected to a VIERA TV that has VIERA Link capability, the TV's remote control unit can be used to run the slideshow.Other Convenient FeaturesWhen using the G1 in manual focus mode, the frame will automatically enlarge by around 5x or 10x (magnification can be altered by the front dial) for easy viewing in the Live View Finder or high-resolution LCD with Manual Assist function. This lets the user frame the shot with greater ease and accuracy. The movable guide lines make it easy to check the horizontal and vertical positioning of the subject and scene, no matter how the shot is being composed.The Quick Menu has further evolved as an interface in the G1. The newly enhanced menu screen makes it easier to use the G1's advanced functions, while simply rotating the turn-and-push device (front dial) lets the user select and enter settings with a single finger, without having to look away from the viewfinder. Most settings can be made in this way. The new My Menu tab automatically stores the five most recently used menu items, for quick, easy retrieval. The custom setting function can also be used to register a shortcut for a frequently used function; the function can then be activated by pressing the Down button of the cursor key. The color of the LCD information display screen can be changed in three colors. These features make the G1 easier to operate while also giving the user a way to customize his or her camera.About the Lumix G Micro SystemPanasonic is pleased to announce a brand-new digital interchangeable lens camera system--the LUMIX G Micro System. It is based on the new Micro Four Thirds System standard that greatly reduces camera size and weight to further enhance the inherent advantages of the original Four Thirds System standard for digital interchangeable lens cameras.The world market for digital interchangeable lens cameras continues to grow at a steady pace, yet there is a widespread notion that digital SLR cameras are large, heavy and hard to use resulting in a preference for compact cameras. Panasonic has now made it possible to develop digital interchangeable lens camera that comply with the new Micro Four Thirds System standard and feature greater compactness and lighter weight, based on a concept of further extending the possibilities of the Four Thirds System standard. The new Micro Four Thirds System products will join today's Four Thirds System products to provide customers with even higher levels of performance in a digital interchangeable lens camera.The features that clearly set the Micro Four Thirds System standard apart from the Four Thirds System standard: approx. 50 percent shorter flange back distance (mount-to-sensor distance), approx. 6mm smaller lens mount outer diameter and electrical contacts in mount increased from 9 to 11. In essence, not only the camera unit but also the Micro Four Thirds lenses are smaller, and this is particularly true for the wide-angle and high-power zoom lenses. The number of electrical contacts between the lens and the camera body is also increased in the new Micro Four Thirds System, to allow a variety of new features and system functions in future models. The Micro Four Thirds System will also allow users to continue using their present Four Thirds System lenses on Micro Four Thirds System bodies by adding a mount adapter. Together with an innovative mirror-less structure that also dramatically downsizes the camera body, the LUMIX G Micro System achieves a dramatic portability and ease of use by an adoption of electronic Full-time Live View Finder instead of conventional optical viewfinder.Combining superb image quality and unprecedented mobility, LUMIX G Micro System will change the way you see the world around you, and the role that photography plays in your life. Panasonic is committed to creating a new photographic culture by introducing innovative, high-performance cameras and lenses for this new generation standard.What's in the BoxPanasonic Lumix DMC-G1 body, Lumix G Vario 14 - 45 mm F3.5 - F5.6 ASPH.Mega OIS lens, BLB13PP Lithium-Ion battery pack, DE-A49B battery charger, AC cable, Video cable, USB connection cable, Software CD, Strap, Lens hood, Lens cap, Lens rear cap, Lens storage bag, Body cap, Manuals", "title": "Panasonic Lumix DMC-G1 12.1MP Micro Four Thirds Interchangeable Lens Digital Camera with Lumix G Vario 14-45 mm f/3.5-5.6 ASPH Mega OIS Lens (Black)", "price": 429.99, "salesRank": {"Camera &amp; Photo": 9000}, "imUrl": "http://ecx.images-amazon.com/images/I/51nfCsET%2B1L._SX300_.jpg", "related": {"also_viewed": ["B008MB71IS", "B003AOAXL4", "B003BR8BE6", "B0056ENTVC", "B005058BTW", "B005058B60", "B007R7DTRK", "B0058SDGW8", "B0058SDG5A", "B0058SDGJG", "B008MD3RNY", "B003CFB0MM", "B004J2LMJ8", "B00604YTFM", "B000IWXTY4", "B008MB6YX6", "B00C97ZZ4S", "B002CGSYL2", "B00CFCTDD6", "B007R7HUAM", "B002IKLJUK", "B0054YVA8S", "B004KUJHFK", "B0054YVA5Q", "B00554Z9G6", "B0035LBRJO", "B00BREQQV0", "B00DY2Y28M", "B009B0WREM", "B002IKLJV4", "B00EH5UGR6", "B007SQB896", "B005EZKFBU", "B005J5TZZ2", "B004A8ZQIO", "B00FY42JYW", "B008MB6ZX0", "B00E65VEFU", "B0015ASYJ8", "B00604YTH0", "B000BK39DE", "B00604YSNK", "B00G237L8I", "B00HZDAUOQ", "B0043VE28I", "B00604YTD4", "B00CFRCXRO", "B004HO59M4"], "bought_together": ["B00CV9MJFW", "B003VNKNF0"], "buy_after_viewing": ["B0039BPG1A", "B003VNKNF0", "B008MB71IS", "B00B7ID99I"]}}