{"asin": "B003LVZO8S", "related": {"also_bought": ["B000UXZQ42", "B008I646WG", "B00IKMJ9B6", "B001TH7GUU", "B000R9AAJA", "B003CP0OT2", "B005VAORH6", "B00BWF5U0M", "B00BFOEY4I", "B004YW7WCY", "B007SHJIO2", "B00906E03I", "B0027VT6V4", "B00B3P1IGG", "B002KL0VY2", "B005BZNDOO", "B002OO18NS", "B00CJD5HBI", "B00BP5KOPA", "B0083I7Y8W", "B006JH8T3S", "B001TH7T2U", "B00HFQG09C", "B004WO8HQ4", "B000UEZ36W", "B0036E8V08", "B00HJOKCZI", "B00J8E92M6", "B0079XWMEI", "B008I64LC6", "B00EZ9XKCM", "B003VANO7C", "B003H4QPJQ", "B00HLUZX7M", "B005DKZTMG", "B00E3W1726", "B0019804U8", "B002D3B97U", "B0088PUEPK", "B001TI9Y2M", "B006DIA77E", "B006W41W7S", "B002DS4HTM", "B003L137Y6", "B001S2RCXW", "B00G57BN1M", "B002KO9JB0", "B0046U6DTC", "B00DKXXAAQ", "B00E3W19MO", "B005BZNDS0", "B0025VKUPW", "B00IDG3IDO", "B00CO8TBOW", "B001MSU1FS", "B0000BVYT3", "B0000CEPC8", "B003NR57BY", "B009UEBQIM", "B00EPAVKP0", "B00006IFIR", "B006WAGGUK", "B00E3W15P0", "B0036RA5EA", "B003VAGXZC", "B00CRJWW2G", "B000FNFSPY", "B00D2CO8WO", "B00C28L6XI", "B0038ZTZ3W", "B003L1ZYYM", "B004FHO5Y6", "B004QRKWLA", "B000ZH98LU", "B00B7GV802", "B002XJN0KI", "B00D601UC8", "B00H09BB16", "B003E71E24", "B003RCEAB8", "B00E83X9P8", "B004C9M7UG", "B007FNF5IC", "B0033Z2BAQ", "B00002EQCW", "B003VANOFY", "B008JJLW4M", "B003ELVLKU", "B009NB8WTI", "B004C9P9TM", "B00006BBAC", "B00H09BOXQ", "B000068O3B", "B0092ML0OC", "B000J2EN4S", "B009C98NPY", "B007KB0EGC", "B0016OV5MQ", "B00ALYOPSS", "B005EORRBW"], "bought_together": ["B008I646WG"], "buy_after_viewing": ["B004WO8HQ4", "B006JH8T3S", "B004FHO5Y6", "B004YW7WCY"]}, "title": "Logitech HD Webcam C310", "price": 31.49, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41QNcbkM9OL._SY300_.jpg", "brand": "Logitech", "categories": [["Electronics", "Computers & Accessories", "Computer Components"]], "description": "FeaturesSay it bigger. Say it better. High definition video up to 720p, a wide-angle lens and autofocus for picture quality that's simply amazing. Video chat, blog, stream and upload to Facebook in just one click. The term 'webcam' doesn't quite do it justice. Logitech Fluid Crystal Technology gives you smooth, fluid video. Crystal clear images. Rich colors.Simple video calling in fluid HD 720pThe smoothest HD video calls with more video frames per second than other HD webcamsFree, easy HD calls on included Logitech Vid HD or your preferred IM serviceLearn moreSnap and share crisp, clear picsSend family and friends high-quality digital photos, software enhanced up to 5-megapixels.Look just right even in bad lightLogitech RightLight2 technology corrects for poor lighting, so family and friends see you clearly&mdash;even in dim light or shadowy backlight.Sound good even in a noisy roomFriends hear you clearly with a noise-cancelling mic, positioned on the front of the camera for best voice pickup.Upload HD videos to Facebook in one clickRecord HD 720p videos, then launch them to Facebook or YouTube in one quick clickPolish your videos with included Magix video and photo editorLearn moreFlat-out versatileUniversal clip attaches the webcam securely to your laptop or LCD monitorSleek flat-panel design looks great with any setupExpress yourself with Logitech Video EffectsAdd extra fun to your video calls with effects like neon splashes and fish-eye distortions.CompatibilityPackage contentsWebcam with 5-foot cableLogitech webcam software with Logitech Vid HDUser documentation2-year limited hardware warrantyWorks withsupports Windows Vista, Windows 7 (32-bit or 64-bit) or Windows 8Basic requirements:1 GHz512 MB RAM or more200 MB hard drive spaceInternet connectionUSB 1.1 port (2.0 recommended)For HD 720p video calling and recording on Logitech Vid HD:2.4 Intel GHz Core 2 Duo2 GB RAM200 MB hard drive spaceUSB 2.0 port1 Mbps upload speed or higher1280 X 720 screen resolutionCompareWhich Logitech HD Webcam is right for you?GoodBetterBest&nbsp;What to look forHD Webcam C310HD Webcam C510Webcam C905Webcam Pro 9000QuickCam Orbit AFHD Pro Webcam C910Video + Photo QualityHD resolutionHD 720pHD 720pHD 720pHD 720pHD 720pFull HD 1080p16:9 widescreenPhoto resolution5MP8MP8MP8MP8MP10MPFocus typeAlways focused*Always focused*Premium AutofocusPremium AutofocusPremium AutofocusPremium AutofocusLens typePlastic lensPlastic lensHigh-precision Carl Zeiss glass lensHigh-precision Carl Zeiss glass lensHigh-precision Carl Zeiss glass lens with motorized pan and tiltHigh-precision Carl Zeiss glass lensAuto light correctionAudio QualityBuilt-in mic with noise cancellationDual mics for stereo audioSpecial Features1-click video upload to YouTube and FacebookVideo effectsStandardPremiumPremiumPremiumPremiumPremium360-degree rotational camera&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Portable design&nbsp;Fold-and-go webcam plus carry caseCarrying case&nbsp;&nbsp;&nbsp;Face TrackingCompatibilityWorks with Windows XP, Vista, 7*40 cm and beyond"}