{"asin": "B00006LEM9", "description": "For even the mildest fans, anything related to this beloved book deserves top-notch treatment. Vivendi's officially authorizedThe Lord of the Rings: The Fellowship of the Ringfalls disappointingly short of that goal. The game is intriguing enough (credit the source material) to play through entirely--once. For the cost of the game, you are guaranteed a reasonably pleasurable 10 hours of gameplay. After that, it will likely sit on your shelf.There are good things in this game: the RPG mechanics are fine (at various points in the story you play as Frodo, Aragorn, and Gandalf), the visuals are beautiful in parts, and certain aspects of game design are fantastic (Gandalf's magic-casting stands out). Little touches make it appealing to true fans, like when Aragorn receives the repaired Sword of Elendil, and it glows during fighting. It would be a great game for even non-LOTRfans to play, since a good deal of backstory is provided in lengthy cinematics throughout the game.Fellowship's greatest asset, of course, is the story itself, as well as the bevy of villainous creatures that provide great boss-fight material. I'm sure many other gameswishedthey had a Balrog to offer.But the story deviates strangely from the book in order to satisfy the format of an RPG game. The final boss-fight (which we won't spoil here) is completely unrelated to anything devised by J.R.R. Tolkien, and it seems hollow, strange, and unsatisfying. The puzzles sprinkled throughout the game are random and often frustrating, as is your first encounter with the Ringwraiths (inevitably, you die many times--too steep a difficulty curve right out of the gate). This game is still strongly recommended, but with many caveats. Proceed with caution and you're likely to enjoy yourself. Expect a masterpiece and you'll be wishing you saved your money for a different PS2 title.--Jennifer BuckendorffPros:Great story and great characters (of course)Missions that require problem-solving as well as combatGorgeous mapsGetting to play as GandalfCons:Painfully long cutaway scenesCheesy endingOften-tedious fights", "price": 16.99, "imUrl": "http://ecx.images-amazon.com/images/I/517D88J9DGL._SY300_.jpg", "related": {"also_bought": ["B00006GSNZ", "B00009VE6D", "B0002IQD1U", "B00008XPJH", "B002C1100O", "B00006IJJM", "B00004YRQA", "B001AZFSDI", "9629971372", "B00021HBP4", "B000088KH1", "B0007SL1ZI", "B003DNLDUC", "B000O5RHZW", "B003DLQTYY", "B00005U8TQ", "B000TLU67W", "B0000CDZBC", "B0000C7GHG", "B0002XL3BA", "B00004YRQ9", "B0001VNNE8", "B00005R5PO", "B00005V9NK", "B000MUU5MG", "B0009Z3HYW", "B000930DQ4", "B00004U5VI", "B000067DPK", "B0001NE48U", "B00006GSNX", "B0009R1SZ0", "B000067DPL", "B00005Q8IR", "B000G6SPHI", "B00008DHNV", "B0009I6S0Y", "B0009A4EVM", "B0001ADAME", "B00005OLX1", "B0000TSRA6", "B00006JN5H", "B00020LZAM", "B0001I9YGC", "B00004ZDFY", "B00009WAVD", "B0000B0MNH", "B0000690ZE", "B00006C28Z", "B00006F2EP", "B00020LZBG", "B00005J536", "B000099T2E", "B00009VE6E", "B00005V6BB", "B0007OSLAA", "B000066TS3", "B00005NCAM", "B001UWGAQA", "B0000690Z9", "B002ABZDQI", "B000099T1Y", "B0009R1T9K", "B0001AVZ5I", "B0008GJRRS", "B00000IZ8A", "B00005O0I2", "B000930DLO", "B0000A8VBZ", "B000099T2G", "B0009O7HVM", "B00005NN7B", "B009PJH47Y", "B000QB059Y", "B000N60GPU", "B00000I1BF", "B000TYQL1O", "B000F0GX8I", "B00005UNWC", "B00005NCC9", "B00005NCCR", "B0033T1UWW", "B0015MMN6G", "B0009PETYO", "B00004W4S4", "B000066TS5", "B0007L8GPI", "B000G77WPS", "B00008G7DU", "B001MW91IW", "B000FW4YOQ", "B00004TBGT", "B0000A082Y", "B001VLFCVE", "B00020BV1A", "B00009WAVB", "B0015ACX3Q", "B00007KQE9", "B00009MVJ7", "B00005B70K"], "bought_together": ["B00009VE6D"], "buy_after_viewing": ["B00009VE6D", "B00006GSNZ", "B0002IQD1U", "B001MW91IW"]}, "salesRank": {"Video Games": 14003}, "categories": [["Video Games", "More Systems", "PlayStation 2"]]}