{"asin": "B007BYLLNI", "categories": [["Electronics", "Camera & Photo", "Bags & Cases", "Camera Cases"]], "description": "Xcenior Series shoulder bag is the modern professional photographer's studio on the go, delivering impressive performance in all of the key areas. It has a large capacity to keep an array of gear organized. It's a standout protector, too, with an innovative multi-layered interior and anti-shock bottom. Busy photographers can pack a complete set of gear and tote it from shoot to shoot with ease. With great security and highly comfortable features, Xcenior stands out as one of the best on the market. Beyond its sleek, attractive design, Xcenior takes protection seriously. Anti-scratch, moisture-resistant fabric on its bottom keeps gear protected from dust and water. It has a molded, semi-solid exterior. It also boasts a tripod carrying system. A full-size tripod stays ultra safe by conveniently securing to Xcenior's sturdy handle and holding snugly against the bag with two adjustable straps. Unlike other shoulder bags, Xcenior is customizable, too, with dividers with hook-and-loop fasteners. Photographers can tailor it to fit their exact needs, which may change depending on the scenario and gear. There are numerous pockets on all sides and on the interior to keep all of accessories stored organized. A side-hanging system enables you to attach lens cases and pouches. Its rain cover conveniently tucks away for use when needed. Also features a bonus accessory pouch and memory card sleeve. Security is also a top priority for Xcenior, too, with three secure points on the upper part of the bag, so you're assured your expensive gear is safe. Xcenior is shockingly comfortable to carry, even when fully loaded. An anti-slip shoulder strap evenly distributes weight on your shoulder and its innovative padded t-shaped handle provides reliable support.", "title": "VANGUARD Xcenior 36 Photographic Equipment Bags", "price": 214.99, "imUrl": "http://ecx.images-amazon.com/images/I/41l5GRGGk5L._SY300_.jpg", "brand": "Vanguard", "related": {"also_viewed": ["B0064X5QOM", "B00EALRAGM", "B008S94LQO", "B00CF5OHZ2", "B008S94LRS", "B00004X10B", "B00K0BYLNQ", "B00EALR9UE", "B00004X10C", "B008S94KQK", "B008S94NZ8", "B003EE5WYI", "B00452UX9W", "B0067WURIU", "B0048IW030", "B0064X5QM4", "B007BYLM7S", "B00200K2UG", "B0064X5R0U", "B0080JH3YE", "B008S94L9G", "B008S94L8W", "B005FIBBWI", "B00B7Y7PS8", "B00EALR73S", "B0000CCVC9", "B000MULXPY", "B003656Q7C", "B00452UX8S", "B00452UX9C", "B003WKOENO", "B00004X107", "B002Q0WMB2", "B004TA6Y8O", "B00B7Y7F3I", "B007NDL54C", "B000YIYQ30", "B0002Y5WZC", "B005CTN53S", "B002I9OBQA", "B000YA33DC", "B001APJZ50", "B002PU9SQU", "B000EXM06U", "B007NDL56A"]}}