{"asin": "B001CBKJGG", "related": {"also_bought": ["0470433922", "B002CEVN7Q", "B0015WJTTK", "B0013ISYK6", "B001B11GTQ", "B0023VWZ5C", "B003VNKNEQ", "B00CV9MJU2", "B003CQD10K", "B00004THD0", "B003Y58IXO", "B001MX41VS", "B002CXLQLA", "B0015GADB4", "B003XMROKG", "B005SEESI8", "B003VNKNF0", "B0000XMUKK", "B0011NVMO8", "B003CLODC0", "B006K5EWRQ", "B007XOYBE2", "B007A3ZATG", "B00004WCGF", "B0000665V6", "B002NUW1XO", "B000237C9M", "0596154526", "B00007E7JU", "B00CV9M4L6", "B0041PMD0A", "B005VALUGW", "B00358P4QO", "B0053V5MF4", "B001KAK1LW", "B0002Y5WZM", "B000FW1X4K", "B003WD2SLQ", "B008YCP9FC", "B000V5P90K", "B009F6X31S", "B00AI07F1Y", "B00554PCDG", "B000V1VG5G", "B004KUCHT8", "B0039BPG1A", "B003Y60DZO", "B005LT2ENG", "B004LEAYXY", "B007JRB0RE", "B0041RSPRS", "B000Z0YECU", "B00551636O", "B000AM7CJ0", "B003USYPX2"], "bought_together": ["B003VNKNEQ"], "buy_after_viewing": ["B003VNKNF0", "B002CXLQLA", "B004J3Y9U6", "B001B11GTQ"]}, "title": "Canon Rebel XS DSLR Camera with EF-S 18-55mm f/3.5-5.6 IS Lens (Black)", "price": 475.0, "salesRank": {"Camera &amp; Photo": 924}, "imUrl": "http://ecx.images-amazon.com/images/I/412bsbUXyBL._SX300_.jpg", "brand": "Canon", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]], "description": "For perfect photos, fast and simple, there's nothing better than Canon's new EOS Rebel XS. With powerful features including a 10.1-megapixel CMOS sensor, Canon's DIGIC III processor, fast shooting and more, it's a digital powerhouse. With simple, easy-to-use controls, a compact design, a 2.5-inch LCD monitor, and Live View Function, it's a beginner's dream come true.Canon EOS Rebel XS Highlights10.1-megapixel CMOS sensor10.1-megapixel CMOS sensorCanon&#x92;s CMOS (complementary metal oxide semiconductor) sensor captures images with exceptional clarity and tonal range, and offers the most pixels in its class. It offers many of the same new technologies first seen in Canon&#x92;s professional EOS-1D Mark III to maximize each pixel's light gathering efficiency. It&#x92;s an APS-C size sensor (22.2 x 14.8mm), and there's an effective 1.6x increase in the lens&#x92;s marked focal length when attached. Canon&#x92;s DIGIC III Image Processor dramatically enhances image quality and speeds up all camera operations for intuitive operation. It works in concert with the EOS Rebel XS&#x92;s sensor to achieve unprecedented levels of performance in all lighting situations.DIGIC III Image ProcessorDeveloped to maximize performance between the capture and recording stages of digital photography, the EOS Rebel XS&#x92;s DIGIC III Image Processor works hand in hand with Canon&#x92;s CMOS sensor to achieve even higher levels of performance. The entire electronic system is totally redesigned, giving the camera its incredible combination of speed and image quality. Digital noise is significantly reduced in shadow areas, and color reproduction is superior.Auto Lighting Optimizer in actionAuto Lighting OptimizerThe EOS Rebel XS&#x92;s Auto Lighting Optimizer is yet another image-quality tool that comes to the rescue in tricky lighting conditions. It can actually lighten dark areas of a scene while ensuring that bright areas maintain tonal detail. In addition, it can increase contrast in \"flat\" lighting, such as overcast days. It&#x92;s now available in all shooting modes, including P, Tv, Av, and Manual.Picture Style settingsWith the EOS Rebel XS&#x92;s Picture Style technology, photographers can change the look of their digital photographs. Color, saturation, sharpness and contrast settings create noticeable variation in the saved image. Changing a Picture Style setting is almost like a 35mm film user switching from one type of color film to another. In addition to six preset Picture Style settings, Canon offers additional downloadable \"Picture Style Files\" that can be installed into your camera for even more imaging options at your fingertips.High-speed, wide-area 7-point AF with center cross-type sensorsThe EOS Rebel XS features a high-speed, wide area 7-point AF system. It can focus using One-Shot AF mode, AI Focus AF, AI Servo AF and Manual. The center, cross-type focus point operates flawlessly in lower-light and lower-contrast settings. In Live View Function, the EOS Rebel XS can focus manually, with 5x or 10x magnification for focusing clarity.Capture up to 3 frames/secondExcellent performance with 3.0 fps continuous shootingThe EOS Rebel XS operates with such effortless speed that operation is nothing short of intuitive. With instant startup times, speedy autofocus and minimal shutter lag, the EOS Rebel XS is one of the fastest cameras available today. It can shoot up to 3.0 fps (frames per second), in bursts of up to 514 JPEGs or 5 RAW files, so you'll never, ever miss a shot.Large 2.5-inch LCD monitor with Live View FunctionThe EOS Rebel XS has a bright 2.5-inch TFT LCD monitor with 230,000 pixels and a viewing angle of 170 degrees. It&#x92;s perfect for Live View composition or viewing camera settings like AF, ISO, Metering, AF Point selection and flash options. And the maximum brightness of the EOS Rebel XS&#x92;s LCD monitor is about 30 greater than its predecessor, which is a big benefit when you're using the camera in bright sunlight.Live View FunctionLive View Function enables you to view your subjects directly on the 2.5-inch LCD monitor. It&#x92;s easy to magnify any part of the scene 5x or 10x for precise manual focus. And now, there are two ways to use Autofocus along with Live View Function in the EOS Rebel XS. You can even choose a grid overlay, perfect for keeping lines in your subject straight in your pictures. In the studio, Live View Function can be used remotely via a computer through the EOS Rebel XS&#x92;s USB connection, and the included EOS Utility software.Quick mode/Live modeIn Live View Function, the EOS Rebel XS has two AF modes: Quick mode, which uses the camera&#x92;s standard 7-point AF system, and Live mode, which is a contrast-based AF system that reads the sharpness of subjects right from the imaging sensor, and can be overridden by pressing the AF mode selection button. A familiar feature in PowerShot cameras, Live mode AF uses similar technologies to achieve focus, while Quick mode is more appropriate for capturing action or for shooting in low light.The target area for Live Mode AF is at the center by default, but it can be moved around most of the picture area with the cross keys on the back of the camera.EOS Integrated Cleaning SystemPhotographers who must change lenses in dusty environments will find the advanced Canon EOS Integrated Cleaning System a tremendous time saver. Dust that settles on the sensor surface is removed using ultrasonic vibration. This Self Cleaning Sensor Unit routine is automatically activated whenever the camera is powered on or off. (It can also be manually activated.) A special collar positioned around the sensor collects the loosened dust. Dust particles can also be automatically removed via software. By shooting a plain white subject, the photographer can acquire dust position data that is transmitted along with the image (whether JPEG or RAW). Canon Digital Photo Professional (DPP) version 3.3 or later software can be used to manually or automatically erase the dust spots. It&#x92;s not one feature, it&#x92;s a built-in system to minimize the effect of dust in high-resolution digital images.Self Cleaning Sensor UnitA key element of minimizing dust is preventing it from clinging to the front surface of the imaging sensor. To combat against this, the EOS Rebel XS features a Canon-designed Self Cleaning Sensor Unit. The low-pass filter at the front of the sensor shakes off dust automatically with ultrasonic vibrations, removing dust from the sensor assembly. The EOS Rebel XS also has a coating on the front surface of the low-pass filter, to increase its resistance to dust sticking to the sensor.Dust Delete Data DetectionDust Delete Data DetectionDust that may still remain on the front of the sensor can also be erased with software included in Digital Photo Professional (DPP) Version 3.3 or later software. A simple test shot of a plain, white object can be taken, using a menu setting. This Dust Delete Data image is analyzed in-camera, and the location and size of any remaining dust is added to any subsequent pictures taken. This data is transmitted along with the image, whether JPEG or RAW, and can be either manually or automatically erased in Canon&#x92;s DPP version 3.3 and later software. This added software option ensures the cleanest possible image, perfect for printing or archiving.Canon's lightest and most compact EOS Digital SLR to date (as of July 2008)Measuring 4.96 x 3.8 x 2.4 inches and weighing in at under 16 oz., the EOS Rebel XS is indeed the smallest digital Rebel ever produced. Its lightweight and compact design does not, however, leave out controls and displays one would expect from an EOS Digital camera. The EOS Rebel XS has the full array of buttons and controls found on the Rebel XSi, plus a 2.5-inch, 230,000-pixel LCD monitor, which is perfect for composing in Live View mode, or reviewing photos already recorded onto the camera&#x92;s SD/SDHC memory card.Compatible with compact SD and SDHC memory cardsCompact, inexpensive and available in increasingly large capacities, SD and SDHC memory cards are a perfect complement to the EOS Rebel XS&#x92;s compact and lightweight body design.Compatible with over 60 Canon EF/EF-S lenses and most EOS System accessoriesEF & EF-S LensesThe EOS Rebel XS is compatible with all Canon lenses in the EF and EF-S lineup, ranging from ultra-wide angle to super telephoto lenses. Canon lenses employ advanced optical expertise and micron-precision engineering to deliver unprecedented performance in all facets of the photographic process. Special optical technologies, such as Aspherical, ultra-low dispersion, or fluorite elements are featured in the universally acclaimed L Series lenses. And Canon&#x92;s Optical Image Stabilizer technology is featured in select lenses to minimize the effect of camera shake. Through Canon lenses, photographers can truly maximize the quality and liberating performance of the EOS Rebel XS.Flash PhotographyThe EOS Rebel XS features the acclaimed E-TTL II flash metering system. With any of the flashes in the EX Speedlite line, E-TTL II provides reliable flash output whether shooting fill-in flash pictures in sunlight, or using flash in total darkness. With E-TTL II, the exact same 35-zone metering sensor used for measuring ambient light is also used for flash metering - giving even finer metering command of the image area. If you prefer a broader area for flash metering, there&#x92;s a menu setting to change to \"Average\" flash metering -- where the entire 35-zone area is measured evenly for flash exposure.The optional Canon Speedlite 430EX II is the ideal step-up accessory for powerful flash shooting with the EOS Rebel XS. It has excellent flash power (maximum guide number of 141 ft./43m at ISO 100), and is the perfect way to get great flash pictures when you can&#x92;t get right up to the subject. The 430EX II is also great for bounce flash, with its tilting and swiveling flash head. It automatically zooms the flash head to cover lenses ranging from 16mm up to 105mm or longer with the EOS Rebel XS. Of course, it works with the camera to provide full E-TTL II automatic flash exposure. And the 430EX II has a powerful AF-assist beam, which allows the camera to autofocus even in total darkness on subjects as far as 32 ft. from the camera.SoftwareCanon EOS Digital Solution Disk (Version 17.0)The EOS Rebel XS comes bundled with an updated Canon EOS Digital Solution Disk, which features powerful software programs designed to extend the EOS experience to the computer. These include Canon&#x92;s ZoomBrowser EX for Windows (Version 6.1), ImageBrowser for Macintosh OS X (Version 6.1), Digital Photo Professional (Version 3.3), the totally new Picture Style Editor (Version 1.0), Canon's EOS Utility (Version 2.2), RAW Image Task (Version 2.8), PhotoStitch, and PTP TWAIN Driver. Each application is designed to perfect the captured images and streamline the digital workflow. ZoomBrowser EX v.6.1 and Digital Photo Professional v.3.3 for Windows are compatible with the new Windows Vista operating system.Digital Photo Professional (Version 3.3)is an image processing program that enables high-speed RAW image processing, high-speed previewing for real-time image adjustment and support for sRGB, Adobe RGB and Wide Gamut RGB color spaces. Because it&#x92;s CMS (Color Management System) compatible, Digital Photo Professional allows for easy image layout and printing in Adobe RGB in conjunction with Easy-PhotoPrint and PictBridge printers. It also features the Dust Delete Data Detection tool for cleaner images.EOS Utility (Version 2.3)for Macintosh or Windows handles the connection between the camera and computer, whenever they&#x92;re connected via USB. It allows remote controlled shooting from the computer, handles downloading of images from the camera to the computer, and allows seamless linking to either Canon&#x92;s ZoomBrowser/ImageBrowser or Digital Photo Professional software once images have been copied to the hard drive. Furthermore, it&#x92;s used to upload settings back into a USB-connected camera.ZoomBrowser EX (Version 6.1)for Windows andImageBrowser (Version 6.1)for Mac OS X are the easy, user-friendly options for viewing and editing of JPEG and even RAW image files. Both allow viewing of numerous types of images including finished TIFF and BMP files. Both also have a variety of search options for finding images, allow re-naming of single images or batches of files, and offer a variety of options for printing without using a separate image-editing program.RAW Image Task (Version 2.8) for Windows/MacintoshThis software is an integrated component of ZoomBrowser EX (Windows) or ImageBrowser (Mac). It allows processing of RAW images from EOS cameras, including the new EOS Rebel XS, with a variety of adjustment possibilities. These options, as well as the overall color, contrast and \"look\" of RAW Image Task, closely mimic the characteristics of Canon&#x92;s in-camera JPEG processing.What's in the BoxRebel XS body, EF-S 18-55mm 1:3.5-5.6 IS lens, Eyecup Ef, Wide Strap EW-100DBIII, Video Cable VC-100, USB Interface Cable IFC-200U, Battery Pack LP-E5, Battery Charger LC-E5, EOS Digital Solution Disk and Instruction Manuals, \"Great Photography is Easy\" Booklet and \"Do More with Macro\" Booklet"}