{"asin": "B001AZUTCS", "related": {"also_bought": ["B00000J1V5", "B006OOKT3Y", "B00000JDF5", "B00002EQCW", "B00004Z5H3", "B001QVQ7JU", "B00AWRUICG", "B007OWY6P2", "B0000BVYT3"], "bought_together": ["B00000JDF5", "B00000J1V5"], "buy_after_viewing": ["B00AWRUICG", "B006OOKT3Y", "B00AWRUIY4", "B0081FLFQE"]}, "title": "Netgear 85Mbps Powerline Network Adapter Kit - XETB1001", "price": 74.95, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31mwb2%2BxhXL._SX300_.jpg", "brand": "Netgear", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Network Adapters", "Powerline Network Adapters"]], "description": "From the Manufacturer You can create a network connection anywhere in your home with the NETGEAR 85 Mbps Powerline Network Adapter Kit XETB1001. It includes everything you need to create a network connection using your home's electrical wiring, so you can connect your computer and networkable accessories to your home network anywhere you have a power outlet, whether it is in the basement or the attic.Easily set up a fast, secure network throughout your home.View larger.Create a network connection wherever you have an electrical outlet.View larger.Create a Network Connection Anywhere in Your HomeBy harnessing the electrical wiring in your home to transmit data, the Powerline lets you create network connections practically anywhere in your home, in places where a wireless signal can't reach and where it would be difficult to run an Ethernet cord. This network adapter kit is perfect for connecting game consoles, network storage devices, Slingboxes, and more.Plug-And-Play Gets You Going Quick and EasyThe Powerline Network Adapter Kit is a snap to set up. This kit includes two XET1001 Adapters so you'll have everything you need to create a single connection. Just plug one adapter into an available electrical socket near your router, and connect your router to it. Then plug the second adapter into any electrical socket that's located near the device you want to network. When you connect your device into the adapter, it will be connected to your network.It's as simple as that. There's no software to install, no passwords to remember, and no configuration whatsoever. And you can easily create more network connections throughout your home by simply installing additionalXET1001 adapters.The adapter is HomePlug 1.0 compliant, making it compatible with the NETGEAR XE104, XEPS103, XE102, WGXB102, and other HomePlug 1.0 devices.Fast, Secure Network ConnectionsThe Powerline XET1001 Adapter features speeds of up to 85 Mbps, fast enough for media streaming, downloading large files, and other bandwidth-heavy applications. Data is encrypted so you can be sure your private data is secure.For added convenience, the Powerline features three LEDs that give information on power, network status, and Ethernet connections at a quick glance.Each NETGEAR XET1001 Adapter measures 1.6 x 2.8 x 3.9 (WxHxD). The NETGEAR 85 Mbps Powerline Network Adapter Kit XETB1001 is backed by a one-year warranty.What's in the BoxTwo Powerline adapters, two Ethernet cable, installation guide, setup CD, warranty card, support and information card.Related NETGEAR Products to Enhance Your ExperienceNETGEAR XAVB101 Powerline AV Ethernet Adapter KitKit includes two adapters to create a network connection using power linesDelivers up to 200 Mbps throughputPlug and play installation requires no software&nbsp;NETGEAR XAV101 Powerline AV Ethernet AdapterAdapter uses existing electrical wiring in your home to create a network connectionDelivers up to 200 Mbps throughputPlug and play installation requires no software"}