{"asin": "B000WBJDUA", "description": "Your baby's first step, your wedding in Bali, all your milestones--all captured in digital photos and video. What could be more important? Store them safely and keep them backed up on the Western Digital WDH1CS10000N My Book Home Edition 1 TB external hard drive.My Book Home Edition is easy to set up and easy to use. Installation is a snap because you don't really install this drive, you just plug it in and it's ready to use. There is no CD to install; the included software loads from the drive the first time you plug it in. Automatic backup allows you to save a copy of your photos to an online sharing service, duplicate your email and contacts to your iPod, and back up all your precious files to your My Book. Set it and forget it; every time you save something it's automatically backed up.The triple interface system provides flexibility and performance with connections for ultra-fast eSATA, FireWire 400, and USB 2.0. The eSATA interface gives you speed comparable to a state-of-the-art internal hard drive, while the FireWire connection delivers a high-performance interface that is perfect for Macintosh computers. USB 2.0 is also available for convenience and compatibility among multiple computers.My Book Home Edition takes no more space than a paperback book. Collect two or more and they nest neatly together like volumes on a shelf. This external hard drive also turns itself on and off with your computer, while Safe Shutdown prevents the drive from being powered down until all your data has been written. (Works with the USB and FireWire connection only.)This  drive is designed to save power by going into standby mode after 10 minutes of inactivity. When you're ready to use it, it wakes up automatically. My Book enclosure's heat-dissipating design with Morse Code also prevents heat buildup, a notorious data killer. How cool is that?The My Book Home Edition offers:Continuous and automatic backup of your important digital assets.Extra storage for your computer.An archive of the music stored on your MP3 player.Plenty of space for digital photo and video capture and editing.What's in the BoxWDH1CS10000N external hard drive, USB cable, FireWire cable, AC adapter, and quick install guide.", "title": "Western Digital My Book Home Edition 1 TB USB 2.0/FireWire 400/eSATA Desktop External Hard Drive", "price": 169.0, "imUrl": "http://ecx.images-amazon.com/images/I/312xOyi3nwL._SY300_.jpg", "related": {"also_viewed": ["B003MVZ60S", "B00E3RH5W2", "B000VZCEUI", "B0041OSQB6", "B002JMYCTC", "B00EMDP09M", "B0042Z55RM", "B001FWEETK", "B0041OSQBG", "B003MRI398", "B004O77CT2", "B002QEBMB4", "B001UI49XA", "B002LZV0B0", "B00CR9Q3AS", "B0052L77SA", "B00CO1HUGU", "B002VLYK0M", "B001E06W8O", "B00CI3BLPA", "B00834SJNA", "B002RL8IH2", "B00E3RH63A", "B004QGXOOS", "B00CR9Q7FY", "B00CGUMSZC", "B000WGSAAE", "B008GOZZAC", "B004QGXOOI", "B0010YWPZ8", "B00E83X9P8", "B000XRK3LG", "B000FJQWJ4", "B008R7FC74", "B0056YNA2U", "B002LITG7M", "B0090A8TX6", "B0018Y4YWW", "B004E9SGUO", "B00DFX6AKS", "B004QGXOP2", "B00834SJS0", "B002JSTDTK", "B00CR9Q7H2", "B00CGUMULO", "B00BTF2ENQ", "B003B8PPEY", "B00829TIIQ", "B0038L3OWO"], "bought_together": ["B000ENUCR4"], "buy_after_viewing": ["B003MVZ60S", "B00E83X9P8", "B00E3RH5W2", "B00834SJS0"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]]}