{"asin": "B00006BXBS", "related": {"also_bought": ["B008O7K9FW", "B00006D2Q1", "0764549707", "B00007K7JE", "B00001N2QU", "0764589121", "B00000JBO3", "B0099RI7JQ", "161729084X", "B0006ZZGZI", "B00000JF55", "1617290777", "B00005LA9D", "1118592158", "B00000JF53", "1895997135", "B00IQBSVWY", "B004NBZB2Y", "1572227214", "1572229446", "0321641485", "B004NBZAYS", "1572227966", "B00DXOS27S", "B0001EMM0G", "032119991X", "0321836960", "0764524984", "B0001EMM0Q"], "bought_together": ["B008O7K9FW", "B00001N2QU"], "buy_after_viewing": ["B0099RI7JQ", "B008O7K9FW", "B00001N2QU", "0764549707"]}, "title": "Texas Instruments 94327 Ti Graphlink USB", "price": 15.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31X0KEAR6KL._SX300_.jpg", "brand": "Texas Instruments", "categories": [["Electronics", "Accessories & Supplies", "Office Electronics Accessories", "Calculator Accessories"]], "description": "Expand your handheld capabilities--get connected! The TI Connectivity Kit is the unique bundling of TI Connect software and a TI Connectivity Cable USB for Windows/Mac. Take your TI technology farther when you take advantage of this connectivity solution. Both the software and the cable work with your computer, TI handheld, data collection technology, and TI-InterActive! to get you connected and keep you connected. You can do so much more when you get connected.TI Connect software is the new-generation link software, which takes TI handheld technology to a new level of handheld, computer, and Internet connectivity. Downloading and transferring data, Operating System (OS) updates, Handheld Software Applications (Apps), and programs are easier than ever before. No more worrying about downloading the TI-GRAPH LINK software for each type of TI handheld. TI Connect software is one universal application that is compatible with many handhelds.Features:Capture multiple screen images and use them in tests, presentations and quizzes.Drag and drop all data types in one consistent manner.Download handheld Software Applications to use your TI handheld in more classes.Back up the data from your TI handheld to your computer.Download games to your TI handheld.The TI Connectivity Cable USB for Windows/Mac and TI Connect software are compatible with the TI-73 Explorer, TI-83, TI-83 Plus, TI-83 Plus Silver Edition, TI-89, TI-92, TI-92 Plus and Voyage 200. The kit will not work with the TI-82, TI-85, or TI-86; for these calculators, use a TI Connectivity Cable Serial (black or gray) and TI-GRAPH LINK software. (The TI Connectivity Cable USB for Windows/Mac does not work with any version of TI-GRAPH LINK.)The product does not include a CD, to download the latest version of TI Connect please visit &lt; education.ti.com/go/software &gt;."}