{"asin": "B001EYU8FI", "description": "Able Planet NC200: The Power of LINX at an Affordable PriceAble Planet made its mark in the portable audio field at the 2007 International CES trade show, where its LINX Audio technology won the Most Innovative Embedded Technology Award. Since then they have won over 16 Awards and significant praise from consumers and top experts alike, all who rave about the phones' ability to eliminate almost all background noise while offering superior sound quality. Ideal for everything from iPods, home stereos and portable DVD players, with full, rich sound that shuts out such extraneous sounds as airplane engines, bus motors, and background conversations.The Clear Harmony NC200 is an exciting new entry level product that lets you step up into quality noise-canceling headphones without breaking the bank.  Enjoy the latest technology at an affordable price and convenient foldable size. The NC200 features an adjustable headband, superior sound quality and clarity, patented LINX Audio technology, inline volume control for easy adjustment to safe listening levels, and state of the art active noise cancelation.What Critics Are Saying\"You can hear the difference up in the higher frequencies of your music. These 'phones are very comfortable, especially for people with big heads.\"--Josh Quittner,Time Magazine, \"Top 25 Must-Have Travel Gadgets\"\"&#x85;Able Planet&#x92;s Sound Clarity unit is a big leap forward in quality. And it won&#x92;t break the bank. The lightweight earphones  are comfortable, and the stereo sound is good &#x96; in fact a lot better than good, providing both clear speech and full rich background sound.\"--Jay Palmer,Barron's\"We put the Clear Harmony headphones up against the Bose QuietComfort 3 headphones for side-by-side tests, all of which the former handily won.\"--Russ Fischer,Laptop MagazineLINX Audio Technology", "title": "Able Planet NC200 Foldable Noise Canceling Headphone (Discontinued by Manufacturer)", "price": 47.99, "imUrl": "http://ecx.images-amazon.com/images/I/51D1aPHt8ML._SY300_.jpg", "related": {"also_viewed": ["B002PHM0V8", "B0067WBJS2", "B000OQUMKI", "B001EYU3L2", "B000R6SYKU", "B003UGVQHW", "B0050FAJJC", "B002HUURWC", "B007SY4QTW", "B00372YKMM", "B00A7ZAOTA", "B00009RDIF", "B00FYWCL2E", "B00A9E3OKK", "B008K1Q528", "B005FVDTAW", "B000AP05BO", "B004VLKZ5Y", "B002LK2QJK", "B004JRYLG4", "B007136B7U", "B007K4TN02", "B000OMKR8E", "B009923WIW", "B003UBKDB2", "B00007056H", "B009KNO1IU", "B00BSXRBGE", "B00062PN6I", "B004Z57YJQ", "B000U07C1U", "B00HSCJ48C", "B0013P3ZOE", "B002HWJT1A", "B0058GNVAW", "B000KQQUQW", "B007MJSKJU", "B00BPIYIBS", "B00A823IDG", "B000NUYW92", "B0054JJ0QW", "B004E0OK6M", "B0002T3UQ0", "B005N8W1MO", "B003LPTAYI", "B004WODP20", "B004RKVXXM", "B005YR0X4W", "B009QFG5X6", "B0007XJSQC", "B007G95FJE", "B00G6QBCWC", "B0081XAXXM", "B00007E7C8"], "buy_after_viewing": ["B002PHM0V8", "B0067WBJS2", "B0054JJ0QW", "B007G95FJE"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]]}