{"asin": "B00IRBY2R6", "categories": [["Beauty", "Bath & Body", "Bath", "Minerals & Salts"]], "description": "Try This Gentle, Rejuvenating Bath Soak And Watch Your Skin Transform Into Something So Beautiful You Will Never Think Of A Normal Bath Again!Cleopatra, the Queen of the Nile, was one of the most beautiful women in history. She had radiant, soft and glowing skin. Her secret was that she bathed daily in milk to nourish her skin. By combining milk with genuine Dead Sea salt, vitamins and essential oils, you'll find that our milk bath soak does the same thing - and a lot more:It Nourishes And Conditions Your Skin And Hair- Calcium Lactate acts as a moisturizer and rejuvenator. It also inhibits the pigmentation of the skin (including age spots and freckles) by limiting the formation of tyrosinase;- the active milk proteins nurture the skin leaving it with a soft, milky glow;- Vitamin E, Almond and Olive Oils have regenerative power over hair and skin tissue and maintain its natural tone.It Soothes Upset Skin, Reduces Inflammation And Swelling- the Dead Sea salt minerals and the Chamomile extract bring instant calm and relief to both skin and achy muscles- it also reduces the effects caused by skin conditions such as Acne, Psoriasis or EczemaIt Has A Wonderful, Relaxing Lavender AromaYou'll feel really pampered when this comforting scent fills your nostrils. It calms your senses and helps you to sleep better.Convenient And Easy To Use- it doesn't give you headaches- it doesn't contain menthol or other discomfortable ingredients- it dissolves quickly- it doesn't stain the tubDue To High Demand We Run Out Of Inventory Often. Order Now To Avoid Disappointment!", "title": "Lavender Dead Sea Salts &amp; Milk Bath Soak &#9733; Organic Spa Recipe - A Blend Of Pure Essential Oils, Vitamins, Minerals And Milk Proteins &#9733; A Great Gift For Men &amp; Women &#9733; Revive In A Rich, Creamy Bath That Calms Your Senses And Nourishes Your Skin", "price": 14.97, "salesRank": {"Beauty": 20069}, "imUrl": "http://ecx.images-amazon.com/images/I/41Vm9qgT4cL._SY300_.jpg", "related": {"also_bought": ["B00CPT8HF4", "B00DTEYUEQ", "B00H1Y8AXW", "B008MP481M", "B00GHP7546", "B00G5XNG0C", "B00FYWOGUE", "B0016AV2BE", "B000VYHG9S", "B00014DIKE", "B00AMO22SM", "B00FS08IQ0", "B00GEPFJV0", "B00GED7ZM8", "B001DJ9WAQ", "B004VPMPN0", "B00BWC0E42", "B0019LRYQW", "B00FLW2IJ8", "B00H96O270", "B0001YJIGW", "B00176AOKM", "B00H4OID1I", "B00CQKWTP6", "B001AIFGMS", "B00B62SPTY"], "also_viewed": ["B00CPT8HF4", "B00B5Z9E3S", "B00DTEYUEQ", "B00014DIKE", "B00GED7ZM8", "B00FYWOGUE", "B00GHP7546", "B00FLW2IJ8", "B00FS08IQ0", "B00H1Y8AXW", "B0042QUHPG", "B008KFP2BO", "B003V5574U", "B005U5JPM4", "B0016AV2BE", "B00H4OID1I", "B000VYHG9S", "B00G5XNG0C", "B00AMO22SM", "B00DTEZIXI", "B004V9HTD2", "B00IMHXI1Q", "B004GINGOY", "B00IXWS5AE", "B00H92QAWO", "B001DJ9WAQ", "B00GEJSCBK", "B00H4OTNGW", "B008ZEAVCK", "B008MP481M", "B004VPMPN0", "B001MQ9VFG", "B00GEPFJ9M", "B005143C2S", "B004GIMUL4", "B00H6TAH7Y", "B00B5YIPKC", "B00E3UQ05C", "B004ZMTK1Y", "B00GEPFJV0", "B00BRXMFAC", "B00IXZ3M8Q", "B0034ZGZR0", "B002BHHX8M", "B00A7WFCXG", "B00H96O270", "B004UPZRNG", "B008AIKD1A", "B00347MP72", "B0099AL074", "B00B4ZG2MK", "B004GITYJU", "B004GIS7PW", "B00BPF9CYE", "B00JNH0DTE", "B000KU930S", "B00028O0HE", "B009V5R454", "B00BR30KBI"], "bought_together": ["B008MP481M"]}}