{"asin": "B00009ZY5C", "related": {"also_bought": ["B0002ZPIOQ", "B002UKZ9K4", "B000EIOQBM", "B00009UHYC", "B00120WRSU", "B00008V3EE", "B000M9EREE", "B00008NJEP", "B001BGGD8A", "B00008N9M7", "B0084CCDWE", "B00395ZQMK", "B00005T3EZ", "B00EIB70N2", "B000BOKML2", "B0093F4ROI", "B004YEBK66", "B0025L6880", "B00005T3EY", "B000MBUSD6", "B00IQBSW28", "B00J8JQ8NC", "B00EZGB4Y6", "B0051YCQ8E", "B000I1IG8Y", "B000HDMUV2", "B006U1VH2S", "B001TH7GSW", "B0006VMBHI", "B005GTO0DI", "B009OBCAW2", "B0097JLQVC", "B003L1ZYYM", "B003O1UYHG", "B00CJGIWIA"], "bought_together": ["B0002ZPIOQ", "B000EIOQBM"], "buy_after_viewing": ["B00EIB70N2", "B00008V3EE", "B000EIOQBM", "B00008NJEP"]}, "title": "Terk Technology AM/FM Radio Antenna", "price": 14.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/61PP911GeuL._SY300_.jpg", "brand": "Terk", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Antennas", "Radio Antennas"]], "description": "Based on the common-sense notion that stereo owners want to listen to music, not static, Terk Technology's AM/FM+ antenna is an ideal fit for casual and intense music fans alike. The antenna, which connects to virtually any radio or receiver, captures a crisp, high-end signal that far surpasses those of in-the-box competitors. Most receivers and rack systems come with \"T\" wire dipole antennas for FM reception, which provide marginal reception at best and are highly susceptible to noise and interference. The AM/FM+, by contrast, is omnidirectional, meaning it receives signals equally from all directions to ensure topnotch reception wherever your equipment is located. In addition, the device incorporates specialized noise-reducing elements to trim static to an absolute minimum, so listeners can enjoy clear signals from as many stations as are within range.The AM/FM+ is simple to connect and use--just plug it into your radio or receiver and you're set. The device comes complete with matching transformers for 75 ohm and 300 ohm antenna inputs. In addition, the AM/FM+'s compact design blends with almost any d&#xE9;cor. Listeners have the option of placing the antenna on or next to a component or mounting it on the wall. The latter option not only offers a unique look, but it may improve reception as well. It also separates the antenna from other audio components and electronics, which may reduce noise and interference.What's in the BoxAM/FM+ antenna, 75 ohm transformer, 75 ohm to 300 ohm matching transformer, user's manual."}