{"asin": "B002OL2NT4", "description": "The TomTom XXL 540S is complete navigation in a XXL widescreen device. Switch on and it's ready right out of the box. Spoken turn-by-turn instructions, including street names, will guide you to any address in the U.S., Canada, and Mexico--including more than 7 million pre-loaded points of interest.Complete navigation in a XXL widescreen device.Click to enlarge.EasyPort mount folds neatly onto the back of your device.Click to enlarge.Advanced Lane Guidance uses photorealistic images to bring even more clarity to complex multi-lane exits.Click to enlarge.Complete XXL Widescreen Navigation and Spoken Street NamesIQ RoutesIQ Routes technology* gives you the fastest route every time by using actual average speeds of travel on your route to calculate your trip rather than only posted speed limits, so you'll always travel the smartest route.Advanced Lane GuidanceAdvanced Lane Guidance** uses photorealistic images to bring even more clarity to complex multi-lane exits so you can be more confident on the road.5-Inch TouchscreenAn extra-wide 5-inch touchscreen helps you find your way, worry-free.TomTom Map ShareTomTom has the most accurate maps, and with TomTom Map Share technology, you can instantly modify street names, street direction, POIs, road speeds, and turn restrictions on your own device.Get HelpWith the \"Help Me!\" menu, there are added safety features so you can easily access local emergency providers.EasyPort MountThe award-winning Fold and Go EasyPort mount folds flat against the device, making it easy to take with you from car to car.The XXL 540S is complete, widescreen navigation.*Feature only available in the U.S. and Canada**Feature available in the U.S. onlyWhat's in the BoxTomTom XL 540S device, EasyPort mount, USB cable, adhesive disk, car charger, and user's guide.", "title": "TomTom  XXL 540S 5-Inch Widescreen Portable GPS Navigator (Discontinued by Manufacturer)", "price": 114.99, "imUrl": "http://ecx.images-amazon.com/images/I/41NEQl4IBDL._SX300_.jpg", "related": {"also_bought": ["B002IY35GM", "B001ET5O70", "B001OWE4SM", "B001H4B0AC", "B001VEJEGK", "B00BB2NLVQ", "B003FSTAGY", "B003QO6A1U", "B0006ZQ4E0", "B00171BFVO", "B004V3KCIM", "B00BQM8S2S", "B001S2R8E0", "B003B3P2CY", "B0050JK3PS", "B0087IMWUS", "B0002SQVX0", "B004KED8CO"], "bought_together": ["B001ET5O70", "B001OWE4SM"], "buy_after_viewing": ["B007M4Z7GO", "B00BHSTWOY", "B0057OCDQS", "B003FSTAGY"]}, "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS", "Trucking GPS"]]}