{"asin": "B002BA596W", "description": "The Altec Lansing FX3021 Expressionist PLUS provides clear, powerful sound in a sleek, modern package that looks great on any desk. This compact system, complete with subwoofer, is easy to set up and is perfect for any personal desktop or laptop computers and MP3 players. Moreover, the Expressionist PLUS is available at a price that won't break the bank.The Expressionist PLUS's sleek design complement any decor.View larger.The 5.25-inch subwoofer provides satisfying deep bass that you can feel.View larger.Big, Detailed Sound Made SimpleThe Expressionist&trade; PLUS gives you full-spectrum sound from a small package. Don't let the system's small size fool you, though. With 33 watts RMS of total continuous power, the Expressionist PLUS can fill even a large room with satisfying sound.1. Independently control the bass output.2. Volume controls are located on satellites.3. Easily adjust to find audio sweet spot.4. Use AUX IN to connect another source.The three-part system comprises two satellites and a subwoofer. The satellites use precision-engineered 2-inch drivers that offer pin-point imaging and crystal-clear sound on the high end. The 5.25-inch subwoofer delivers the deep bass that provides that good, necessary rumble for the low end.Audio Alignment Technology for Superb Accuracy and SoundThe Expressionist PLUS relies on Altec Lansing's proprietary Audio Alignment&trade; technology to make certain that all of the speakers' components work together to deliver your music the way it is meant to be heard. Audio Alignment technology ensures the perfect balance of the three elements of the speaker system--the drivers, enclosure, and electronics--to provide a natural, uncolored, and rich sound from your speaker system.Compact, Stylish Design Puts Controls at Your FingertipsThe Expressionist PLUS has a stylish, piano-black look that fits any decor, and its smart design details make operation intuitive and easy. The round subwoofer, no bigger than a small Frisbee disk, is intended to sit on the desktop.  A fingertip knob on the subwoofer gives you independent control of the bass output and lets you tailor the optimum balance between sub and satellites.  Mounted on an adjustable aluminum base, each satellites can be aimed to find that audio sweet spot no matter where you're sitting.Controls for the system&rsquo;s power and volume are conveniently located on the speakers themselves, making adjustments just an arm's reach away. And with an added AUX IN jack, you can easily connect another source, such as a portable CD, DVD, or MP3 player, and enjoy full-spectrum music.The Altec Lansing FX3021 Expressionist PLUS is backed by a one-year warranty.What's in the BoxExpressionist PLUS speaker system, 3.5-mm audio cable, power adapter, and quick connect guide.", "title": "Altec Lansing Expressionist-PLUS FX3021 2.1 Speaker System", "price": 42.99, "imUrl": "http://ecx.images-amazon.com/images/I/31pegXBnG-L._SX300_.jpg", "related": {"also_viewed": ["B002FU5QLQ", "B00EZ9XKCM", "B0038W0NEU", "B0025VKUR0", "B0025VKUQQ", "B001IWOBA4", "B002TLSTGA", "B0025VKUQG", "B001IZYV3S", "B008X1BVH4", "B002FU5QM0", "B003CP0OT2", "B002FU5QMA", "B0051U7D0E", "B009XGH2HG", "B00AFQZ4AU", "B00EZ9XKDG", "B0025VKUPW", "B00JC31RUS", "B001RNOHDU", "B000IF4788", "B0028N6YH0", "B002HWRZ2K", "B00K5NYNWS", "B0056BPUQC", "B0027VT6V4", "B00BZ7MALY", "B00JC31RVC", "B00CD1PTF0", "B00ENMYSAE", "B000068P8R", "B0041QBAIA", "B0042F3K9W", "B00GXW0LFI", "B00646KQOY", "B00711MUTA", "B007PXV2KM", "B00BZ7MATG", "B00F8HRSN2", "B003VAHYTG", "B0097OUESI", "B00ESKS9L0", "B0015C30J0", "B00005BC0J", "B007PXV2K2", "B000HZDF8W", "B00006B9W1", "B004N31D9W", "B004N35EEM", "B002FU5QMK", "B002Q88CGI"], "buy_after_viewing": ["B002FU5QLQ", "B00EZ9XKCM", "B0027VT6V4", "B0038W0NEU"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]]}