{"asin": "B0009S4UOA", "description": "When the originalCall of Dutywas first released, the had a big impact on both consumers and critics alike, and it quickly rose to become one the top games in its class.Call of Dutydid this by having well-designed campaigns and an intuitive feel, complemented by immersive sound effects and an enjoyable multiplayer option.Call of Duty 2not only stays true to these strengths but has improved upon many other aspects of gameplay as well. If the originalCall of Dutyleft you wanting more, this sequel will more than satisfy your hunger.Fight off waves of invading German troops and Panzer tanks in Moscow.View larger.Race around in your own tank with others at your side in North Africa.View larger.Scale the cliffs of Pointe du Hoc with the Army Rangers.View larger.Just as in the original,Call of Duty 2has you working your way through WWII across three interwoven campaigns. As a private in the Russian army, you will fight off waves of invading German troops and Panzer tanks in Moscow and Stalingrad. Once you finish the Russian campaign, you'll go up against Field Marshal Rommel's troops in the deserts of North Africa. As part of this campaign, you'll race around in your own tank with others at your side, and later you'll be tasked with calling in air strikes against enemy tanks. The final campaign has you in the role of an American corporal in Europe, but unlike most WWII games, you won't perform a D-Day landing on Omaha or Utah Beach. InCall of Duty 2, you have to scale the cliffs of Pointe du Hoc with the Army Rangers amidst a hail of artillery and machine gun fire, giving you a true appreciation of the time-honored saying, \"War is Hell!\"Call of Duty 2is a thinking-gamer's first-person shooter of medium difficulty. While there are many reflexive elements, the game quite often requires you to consider the tactics of the situation in order to survive. While you can probably blow through the game in 10 hours on the regular setting, the more difficult settings require you to be much more thoughtful about your approach to the different scenarios. Your teammates in battle neither finish your fight, nor simply provide enemy fodder, while the enemy AI (artificial intelligence) is quite clever. If you are too meek, you will find yourself pinned down by aggressive fire while the enemy lobs grenades at you until you're decimated.Unlike the its predecessor,Call of Duty 2doesn't give you a health bar. Instead, as you are hit by more and more fire, your screen grows increasingly red around the border, and your character begins to grunt and pant. This is your signal that it's time to find some cover in order to recuperate before you continue. Another major improvement is the enhanced smoke grenades, which not only look great but can be used effectively in battle to obscure your path from tanks or machine-gun nests as you make your way to an objective.WhileCall of Duty 2has received an ESRB T (teen) rating -- meaning there are no gratuitous blood and guts splashing all over the screen -- this is still war, and there are enemies that will try to drag themselves to safety after being hit, only to be bludgeoned to a screaming death by your fellow men-at-arms. And like its older brother,Call of Duty 2offers the standard deathmatch, team deathmatch, capture-the-flag, and search-and-destroy multiplayer modes. However, this version offers a new option called \"headquarters,\" which most closely resembles the \"crazy king\" version of king-of-the-hill in Halo 2. Shifting headquarter points appear and must be captured in order to start building points, only to be overrun by the other side in order to halt that point gain. This version of the multiplayer mode is not only extremely fun, but it requires teams to adapt on the fly.Unlike the original, in this sequel you can skip forward from one mission to the next once you've cleared a campaign. The game also auto-detects 16:9 and 16:10 wide-screen ratios, as well as the sometimes tricky 5:4 ratio for LCD monitors. As the user, you can make use of a good set of performance tweaking functions, or you can allow the game to determine the optimal ratio, based on your system. With the addition of actual war footage as introductions to each campaign, and famous war quotes at the end of the scenes,Call of Duty 2has everything you need to lose yourself in the middle of the biggest war in history of the world.--This text refers to an out of print or unavailable edition of this title.", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/51Uc2jS8-GL._SY300_.jpg", "related": {"also_bought": ["B000G7YRHO", "B000XYUVAC", "B001AWIP68", "B0001I9YE4", "B000PE0HBS", "B0016B28Y8", "B0008GJRQ4", "B00269QLI8", "B000TG530M", "B003JVKHEQ", "B00503E8S2", "B000KGD1GO", "B000WSE2WM", "B0034JKYO6", "B000MQCT2E", "B000TI836G", "B000A0EFJW", "B003O6G5TW", "B000BLM5Q0", "B0017HW5LM", "B001QXNBJM", "B005GM3Y5U", "B000FRU0NU", "B00095LEEW", "B0050SY5BM", "B003VWGBC0", "B00G6MW5CC", "B00519C7CE", "B008E6ZXT0", "B002I098JE", "B008B3AVNE", "B000OCXK6A", "B000LXIO6I", "B007XVTR3K", "B001OAKV3G", "B000FRS9II", "B000GA73O0", "B001HWB68K", "B000O5DPJE", "B000CEXDVW", "B00BU3ZLJQ", "B008AEE02M", "B000WEQL02", "B003ZSP0WW", "B000P46NMK", "B00EVWYF0E", "B0009Z3IWS", "B002BSA20M", "B002I0H79C", "B001NJ6AWO", "B000A0XSP4", "B003Q53VZC", "B000ZK9QD2", "B003VKLA6E", "B000G7PMXC", "B000B7Q4BQ", "B000P297JS", "B0000C6EB4", "B000M4M7BO", "B000CBVC0Y", "B001AWIOYG", "B000CQNWH0", "B005EZ5GQY", "B000YYR3D4", "B000ZKDOV2", "B0050SYY5E", "B000FRU1UM", "B003C1I0CO", "B002IGIW1I", "B001NY42JC", "B003P9C6QY", "B006D3JX10", "B004UDLRMS", "B0009S4UOK", "B000H94PVO", "B00006JC48", "B000X25GX6", "074401347X", "B000BLNFPA", "B008E6ZXRM", "B0017ZDGWG", "B00008J7NZ", "B0058VI1SO", "B000GV4JQE", "B00009X3SY", "B0009WPZMC", "B00K31MN6U", "B001CRQYBO", "B00BMFIXT2", "B001EYUTU2", "B000C427NM", "B0050SYLRK", "B002I0J9M0", "B001TOQ8PM", "B007SRM5MO", "B000G7X0AO", "B0001I9YGC", "B000E260LM", "B000B90GD6"], "bought_together": ["B000G7YRHO", "B001AWIP68"], "buy_after_viewing": ["B001AWIP68", "B000G7YRHO", "B007XVTR3K", "B00269QLI8"]}, "salesRank": {"Video Games": 2669}, "categories": [["Video Games", "Xbox 360", "Games"]]}