{"asin": "B0040IUI46", "related": {"also_bought": ["B008I647YS", "B004XC6GJ0", "B004T0BJ7A", "B0018BQR84", "B00AJHDZSI", "B00DR0PDNE", "B007YV0UQW", "B002XL2HVO", "B0041HLT80", "B008KRLZCW", "B003L1ZYYM", "B00DIFIO8E", "B00BUCLVZU", "B00F5NB7MW", "B004YCTVIW", "B0006TJ7HM", "B00E98O7GC", "B0041OOG9M", "B005DKZTMG", "B00GJ7Y7MU", "B00EEOSZK0", "B0012S4APK", "B00BGGDVOO", "B0000AI0N1", "B000UWD9OW", "B00CX5P8FC", "B006SU0SX0", "B00EPMG4X6", "B00AZSZYTO", "B000BOA2D0", "B00IF0JAYE", "B00BP5KOPA", "B000WYVBR0", "B00M0GM6F4", "B001UI4RTG", "B004GNGID0", "B00INNP5VU", "B00DIFIM36"], "bought_together": ["B008I647YS"], "buy_after_viewing": ["B004XC6GJ0", "B00AJHDZSI", "B001FWYGJS", "B00IF0JAIU"]}, "title": "ARRIS / Motorola SURFboard Gateway SBG6580 DOCSIS 3.0 Wireless N Cable Modem - Retail Packaging", "price": 119.98, "salesRank": {"Electronics": 71}, "imUrl": "http://ecx.images-amazon.com/images/I/51sEpd5%2BceL._SY300_.jpg", "brand": "Motorola", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Modems"]], "description": "Ultra-fast Internet and Wireless N at your fingertips &ndash; NEW lightning fast technology lets you surf up to 8x faster than traditional cable modems.The Motorola SURFboard SBG6580 eXtreme Wireless Cable Modem Gateway unleashes the next wave of broadband technology at exceptional speeds with high-performance Wireless N networking and a 4-port Gigabit Ethernet router. The SBG6580 is up to 8 times faster than DOCSIS&reg; 2.0 broadband cable modems making it capable of reaching data rates up to 300 Mbps. That makes gaming, shopping, downloading, working, high-quality voice and video conferencing, and peer-to-peer networking applications &mdash; far more realistic, faster, and efficient than ever before. In addition to the lightning fast speeds, the SBG6580 includes an 802.11n wireless access point with dual band capabilities, as well as a 4-port Gigabit Ethernet router. The SBG6580 delivers your complete personal media experience, at lightning-fast broadband speed. So what are you waiting for?Motorola SURFboard&reg; eXtreme Wireless Cable Modem GatewayEasy to Install, Activate, and Use &ndash; Includes a Wi-Fi Wizard and a Wi-Fi pairing button.Delivers a realistic gaming experience wirelessly &ndash; watch as games come to lifeNext Generation DOCSIS&reg; 3.0; backwards compatible to DOCSIS 2.0Up to 8x faster than DOCSIS 2.0 cable modemsEnhance your interactive gaming experienceStream HD video throughout your network &ndash; wired or wirelesslyEasy to install and simple to use with Motorola&rsquo;s setup wizard and Wi-Fi pairing buttonSecure and protect your data and privacy with a built-in, commercial-grade firewallWatch as games come to life.HighlightsCapable of downloading up to 8000 times faster than 56k analog phone modemsCapable of downloading up to 8 times faster than DOCSIS 2.0 broadband cable modemsDOCSIS&reg; 3.0 CertifiedEnables a myriad of advanced multimedia services:- Access real-time online games; new heights in realism and speed - wirelesslyFaster music downloads; one song or the entire albumShare digital photos, home movies and other multimedia effortlessly over the Internet or over your Wi-Fi networkDownload high-definition movies to your PC or watch as streaming mediaWindows&reg;, Macintosh&reg;, and UNIX&reg; compatibleSupports Advanced Encryption Services for data, as activated by your operatorFeatures a four-port 10/100/1000Base-T Gigabit Port for incredible wired network speeds: enjoy lag-free network gaming and faster file transfersWireless N Networking with Dual Band Wi-FiIntuitive, easy to read front panel operational status LEDsUse your current Internet BrowserNo additional software requiredSlim design saves desk space1-year limited warrantyWhat&rsquo;s in the BoxInside the Box - Motorola SBG6580 SURFboard eXtreme Wireless Cable Modem Gateway,Motorola&rsquo;s Wi-Fi Wizard & Installation CD-ROM,Quick start guide,Ethernet cable,Power adapter and cord,Install sheet,Warranty card"}