{"asin": "B000UV4EU6", "description": ".caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; }Bring your media with you wherever you roam with the Creative Zen 4GB player. Watch 16 hours of videos, enjoy up to 1,000 of your favorite songs or share hundreds of photos with your friends. And do it all on a device that's about the width of a credit card.A razor sharp 2.5-inch display makes your photos and videos come to life. See the Zenin detail.Small size. Big features. All in the palm of your hand.View larger.Add even more storage capacity via the SD card slot.View larger.DesignThe Zen sports a 2.5-inch TFT color display with 320 x 240-pixel resolution and support for up to 16.7 million colors. This razor sharp display is packaged in a device that weighs just 2.1 ounces and measures 3.26 x 2.16 x .44 inches (W x H x D). The internal battery powers the Zen for up to 25 hours of continuous audio playback and up to five hours of continuous video playback. Use the Zen's SD slot to expand your portable media library with music, photos and videos stored on your SD card. There's also a handy built-in microphone for capturing notes on the go.FeaturesLoad up up your favorite songs, as well as your album art, and get going with the Zen. The device supports iTunes Plus tracks from the iTunes store and MP3 and WMA tracks. Subscription and pay-per-download music services are supported, as well. Discover, save, and play millions of songs when subscribing to services such as Yahoo Music Unlimited and Napster To Go. You can even tune into your favorite stations with the Zen's FM radio. The radio allows you to save up to 34 presets.The Zen has you covered when it comes to video, too. The device supports MJPEG, WMV9 and--with transcoding--MPEG1 and 2, MPEG4-SP, DivX 4 and 5, and XviD. Enjoy purchased movies and TV shows from online services, such asAmazon Unboxand Walmart.com. Watch home videos. Even load your Tivo To Go movies and TV shows onto your Zen.Additional features include a clock and alarm function, volume restriction, eight equalizer settings, and a USB hard drive mode, which allows you to drag and drop files directly to and from your Zen. The Zen can also function as a handy organizer, allowing you to synchronize with Microsoft Outlook and display your contacts, calendar, and tasks.What's in the BoxZen player, earphones, USB 2.0 cable, installation CD, and quick start guide.A slick user interface makes it a snap to enjoy your media.", "title": "Creative Zen 4 GB Portable Media Player (Black)", "price": 34.99, "imUrl": "http://ecx.images-amazon.com/images/I/41xG46ZZW%2BL._SX300_.jpg", "related": {"also_viewed": ["B004EW0P9G", "B000CS7U1C", "B000IF4TPY", "B0002BRMNA", "B003G4ZQV0", "B001CB0RSG", "B005MJU1QC", "B00ECQUY2M", "B008G5ZAGU", "B002MAPS6W", "B00IBR5QJY", "B000IBNXX2", "B009K6ULV8", "B002JPITXY", "B002MAPT7U", "B008RK9XTO", "B005FVNGRS", "B007M6EYU2", "B00ECRRB8G", "B0044ZFXS6", "B00EE1H7BQ", "B008NNYF9I", "B00ECRPOKS", "B001EQ0HAW", "B007R00TKM", "B002MAPSC6", "B002JPITY8", "B002MAPRYU", "B00400TGEC", "B005FVNH04", "B005FVNGRI", "B007B5TPEY", "B00EPFLJS8", "B000EPLP3C", "B0035JJJQE", "B005BJQTDC", "B0041MMMWW", "B007B5TO4A", "B00963DPUY", "B0047Q7LSW", "B007V7XQ7E", "B0076HNNHM", "B000EA8U12", "B00264Z6AM", "B004EVV3L6", "B0041G62VU", "B00FF071RK", "B007B5TOJK", "B00DE14T9U"], "buy_after_viewing": ["B002MAPT7U", "B002MAPS6W", "B004EW0P9G", "B0045DT3A6"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}