{"asin": "B00005A1KZ", "description": "The Rio Volt portable MP3-CD player grants free listening across  standard audio CDs as well as the MP3 and WMA (Windows Media Audio) files that  you've recorded to CD-Rs and CD-RWs, letting you enjoy over 20 hours of digital  audio from one CD (or around 250 songs). Plus, Rio Volt's large backlit LCD  supports both ID3 tags and CD Text, simplifying song identification from any  compatible disc, while 120-second antishock circuitry guards your listening  almost anywhere.While the Rio Volt is the first portable CD player in the family of Rio digital  audio players, the manufacturer was thinking ahead: the device supports firmware  upgrades to accommodate future digital audio formats.Amazingly, the Rio Volt sports a playback time of up to 15 hours on two AA  batteries (included), making it the first disc player we know of that can't play  a single CD in its entirety. Don't fret, however--you'll find an AC/DC adapter  in the box in case you want to listen to all 250 tracks of a single disc in one  sitting.The ID3 text display includes track number, song name, artist name, folder  (album title), and overall playing time. The Rio Volt also lets you navigate  through directories and search for tracks one by one or in blocks of 10.A sleek eight-function remote control lets you operate the Rio Volt while it's  tucked away in its carrying case or even in a backpack. The Rio Volt comes  bundled with RealNetworks music management software and Adaptec CD-burning  software for use on your PC or Macintosh.Audio features include adjustable equalization curves with five presets (normal,  jazz, rock, classical, ultrabass), repeat and shuffle play modes, and  programmable playlists.The Rio Volt comes with a 1-year warranty on parts and labor.", "title": "RioVolt SP100 Portable CD/MP3 Player with 120 Second Anti-Shock", "price": 73.99, "imUrl": "http://ecx.images-amazon.com/images/I/51AKERBP4PL._SX300_.jpg", "related": {"also_viewed": ["B000MVJ1M0", "B003JD6LVW", "B000CBB4MK", "B000MVGBFA", "B000CBB4N4", "B005OMSUOC", "B00393K1LI", "B003O6PXS6", "B00F3JCR4A", "B002MAPT7U"], "buy_after_viewing": ["B0008G1VCC", "B003O6PXS6", "B000F763NG", "B003CYMHJS"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}