{"asin": "B001VZ1W5U", "description": "Panasonic's DMP-BD70V combines a high quality image with enhanced networking functions, including Panasonic's VIERA Cast internet functionality for enjoying online entertainment from YouTube, Amazon VOD, and more. Play back your favorite Blu-ray discs, VHS tapes, CDs, DVDs and more, and enjoy up-conversion to 1080p with formats of lower resolutions. The DMP-BD70V also lets you take advantage of 7.1 channel Blu-ray surround sound, and enhances the sound quality of CDs and other sources.A high quality image with enhanced networking functionsClick to enlargePHL Reference Chroma Processor PlusDeveloped in collaboration with Panasonic Hollywood Laboratory, this high image processing technology reproduces clear, vivid colors that are faithful to the original film.High-Def AudioRecognizing that audio is important to the overall entertainment experience, Panasonic's three 2009 Blu-ray Disc players feature a high definition audio decoder (Dolby Digital Plus, Dolby TrueHD, DTS-HD Master Audio Essential) to take advantage of the exceptionally high quality 7.1 channel surround sound now integrated in Blu-ray Discs.96kHz Surround Re-MasterThis function enhances the sound quality of CDs and other sources, and even improves the quality of the multi-channel audio data on Blu-ray Discs and DVDs.View rear connectionsClick to enlargeFull-function remote includedClick to enlargeFormat-FriendlyThe DMP-BD70V distinguishes itself as the world's first dual deck VHS-Blu-ray player, providing the consumer with a video product that features multi-format playback allowing the user to play VHS, CD, DVD and 1080p high definition Blu-ray Discs. The BD70V allows for premium 1080p up-conversion for all video formats.VIERA CASTVIERA CAST technology is now available in Panasonic's 2009 Blu-ray players. The internet enabled technology lets the consumer access the internet without the need of either an external box or a PC and enjoy entertainment from sites like Amazon VOD, YouTube, Google's Picasa Web Album, Bloomberg and more. The DMP-BD70V also includes an SD Memory card slot and USB slot, so you can view and share both digital still images and HD video recorded with an HD camcorder in the AVCHD format.4:4:4 TechnologyIn order to produce the ultimate picture quality, Panasonic's Blu-ray players employ high precision 4:4:4 signal technology, which working in tandem with PHL Reference Chroma Processor Plus processes each pixel of the Blu-ray Disc video signal in the horizontal direction, to compliment vertical direction processing. P4HD (Pixel Precision Progressive Processing for HD) is another technology that contributes to the superior picture quality of the Blu-ray players. P4HD processes more than 15 billion pixels per second and applies the optimal processing to every pixel. Panasonic's Blu-ray players further utilize 16-level motion detection to categorize the image motion of each pixel into one of 16 levels; diagonal processing to detect diagonals and correct the pixels accordingly; 1080p up-conversion to up-convert content recorded in the 480i/p or 720p format to 1080p. The Blu-ray players also provide 1080/24p output, thereby reproducing cinema images from a Blu-ray Disc and DVD in their original 24p form with no need for conversion. This allows the user to enjoy cinema images in the same format used in cinema with a 1080/24p compatible TV.Lower Power ConsumptionPanasonic's 2009 Blu-ray players use Auto Power Stand-By, a function that automatically turns off the player when you return to TV operation using the VIERA Link menu. In addition, the Stand-by Power Save automatically turns off the player's Quick Start function. When VIERA is turned on, Quick Start also turns on. In addition, the development of the UniPhier single chip LSI makes it possible to pack an entire video signal processing circuit onto a single chip. This helps lower power consumption, reduces the number of parts needed and allows for a more compact design.What's in the BoxPanasonic DMP-BD70V, Remote control (batteries included), A/V cable, Power supply cord", "title": "Panasonic DMP-BD70V Blu-ray Disc/VHS Multimedia Player", "price": 155.26, "imUrl": "http://ecx.images-amazon.com/images/I/41oKorCqQVL._SY300_.jpg", "related": {"also_viewed": ["B001T6K7G6", "B001DZFYPW", "B000NTME98", "B001V9LA44", "B008Q60VZ4", "B0014F9U6U", "B00I8VUL3E", "B00EOV3H4C", "B0038KN114", "B001UCJVJI", "B000NDO744", "B006H8WFU2", "B001VYZVBC", "B00EO3A9A0", "B005UITDT6", "B003AJ7ODY", "B00K6AERT4", "B0057YAVZS", "B00005YV4G", "B00CCILYDA", "B004LNFJCQ", "B0021YZ4EK", "B0038KR8WM", "B004OF9XMI", "B00752R4QO", "B002RUJB3S", "B001BVY1A2", "B000Y634SU", "B000ASGFRE", "B00004TEUK", "B00752R5Z4", "B007WF1IMK", "B00LNAJ1ZQ", "B004M8SBFW", "B00752R4PK", "B000F4EJH6", "B003Y814M8", "B00004VW2A", "B00080FPSY"], "buy_after_viewing": ["B001T6K7G6", "B001DZFYPW", "B00AWKC0JM", "B00EUY59Z8", "B00EUY59Z8"]}, "categories": [["Electronics", "Television & Video", "Blu-ray Players & Recorders", "Blu-ray Players"]]}