{"asin": "B005IHAIEI", "related": {"also_bought": ["B005IHAI8O", "B0042GFYLI", "B00836H2DQ", "1133597459", "B003NRHAH8", "B003OBUJIK", "B005NX7HY6", "B005K8AUE8", "B0096W1PG6", "B0096W1P5W", "B003U8Q7TC", "B0096W1ONK", "B005IHAIKM", "B0049WBZEK", "B003U2YCZE", "B00B20OYUO", "B0000BZL2Y", "B003MQWN40", "B003WO7MZC", "B003URJP5Q", "B006OGD8XK", "B007ZE9JD8", "B0097DFRMC", "B0078ZYBP0", "B0054I54JU", "B005KG3KNI", "B00ENZRPG0", "B00004ZCJF", "1937538117", "B0029U0XF6", "B003Q0BPC8", "B006BGSYXC", "B005K8AUYI", "B00EPWC30O", "B007I9CBI0", "B0040RWN0O", "B00BPBHX30", "B003X1FSCS", "B00BPZD0M4", "B0000BZL7S", "B00BJGNRR2", "B00JUFC25C", "B00B20OYVS", "B005D6C14Y", "B00BQXL5CM", "B007AHVOQ0", "B0042UC5BG", "B004G77W4A", "B005K8AUHA", "B008IJ610S", "B003Y2YE3A", "B00B7ID9CU", "B0040AJ97Q", "B005N3TPJQ", "B00FSB7432", "B004YEZGIO", "B00HNJWSDS", "B007AJHGC4", "B006GPZ28I", "B005ODKCH4", "B00440D7S4", "B004U28R86", "B00CV9ML5U", "B003OBUJD0", "B00FSB79KU", "B0051GXAYQ", "B00603RXHE", "B002N1WACA", "B00BQXL6HQ", "B00AY2PSK6", "B004NE4OKQ", "B0086UXT9K", "B00FRDUZUK", "B00CV9M6U0", "B0068NVR14", "B007PCP2OU", "B007ZEARPW", "B0096W1OCG", "B0099YS6WW", "B00FSB76XA", "B001KNDWRY", "B004EBZZX8", "B00BUK2O80", "B00B7ID99I", "B00BCGMHC0", "B004VA0IP2", "B0016120M8", "B000L0F31U", "B00870NQRO", "B00I8BICCG", "B003Y302CG", "B00FSB799Q", "B0010C2HSA", "B007ZDFFR8", "B00FSB79FU", "B00004ZCJE"], "bought_together": ["B003OBUJIK"], "buy_after_viewing": ["B0096W1OKS", "B00I8BICB2", "B00B7ID99I", "B00I8BICCG"]}, "title": "Sony NEX-7 24.3 MP Compact Interchangeable Lens Camera - Body Only", "price": 883.51, "salesRank": {"Camera &amp; Photo": 4565}, "imUrl": "http://ecx.images-amazon.com/images/I/41m%2B1bAWv8L._SX300_.jpg", "brand": "Sony", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Compact System Cameras"]], "description": "More than a pocket camera, the 24.3 megapixel NEX-7 exceeds expectations. Here's performance that would give most DSLRs camera envy, including interchangeable lenses, a 2359K dot OLED eye-level TTL viewfinder, up to 10fps shooting, and outstanding Tri-Navi 3-dial manual control. HD movies are superb with Full 1920 x 1080 resolution at 60p, 60i and 24p.DSLR quality in your pocketHere's the same APS-C sensor size as a DSLR, with higher resolution than most DSLRs and the interchangeable lenses that make DSLRs so attractive. Yet the camera is about half the size and weight of a typical DSLR camera. Removing the conventional mirror box and viewfinder makes it possible.24.3 MP; best-in-class resolutionYou get incredible detail and gorgeous enlargements thanks to a 24.3 megapixel sensor. It's the highest resolution among pocket cameras as of August 2011.World's first OLED viewfinderThere's never been anything quite like the Tru-Finder OLED electronic viewfinder. For size, speed and brightness even after sunset, this is a gem. This eye-level, through-the-lens, viewfinder begins with 2359K dots for amazing resolution and high contrast ratio for incredible depth. OLED reduces motion blur to a bare minimum. You can also see the results of camera adjustments in real time with superb color and detail.Up to 10 fps shootingCapture the decisive moment in sports and get the ideal baby photo. Up to 10 fps continuous shooting at full 24.3 MP resolution with exposure and focus fixed at the first frame. Standard continuous shooting at up to 2.5 fps.DSLR-class APS C image sensorSensor size is the key to picture quality. The APS C class sensor provides gorgeous imaging with 58% more area than Micro Four-Thirds sensors and an amazing 13 times the area of a point &amp; shoot image sensor.Full HD Movies at 60p/60i/24pCapture HD Movies in your choice of super-smooth 60p, standard 60i or cinematic 24p, all at Full HD 1920x1080 resolution. AVCHD codec delivers stunning picture quality. MP4 codec offers smaller files for easier upload to the web.HD movies with full manual controlNow you don't need to surrender control when you shoot HD movies. Enjoy the full expressive potential of Program, Shutter Priority, Aperture Priority or Manual (P/A/S/M) control in HD movie mode.Tri-Navi manual controlPerfect for experienced shooters, Tri-Navi control gives you three separate control dials for direct, hands-on access to three settings at a time. As just one example, the dials can set aperture, exposure compensation and ISO.Built-in pop-up flash Enjoy the convenience of flash photography everywhere you go. Guide Number 6.Hot shoe for &alpha; system flashesTake your photography even further with access to the entire range of Sony &alpha; system flashes and flash accessories.Accepts A Mount lenses via adaptors Both the LA-EA1 and EA2 adapters (sold separately) allow you to attach the full range of Sony A mount lenses.Phase Detect AF with adaptorThe LA-EA2 lens mount adaptor (sold separately) is the world's first with Sony's award-winning Translucent Mirror Technology. This provides super-fast and accurate Phase Detection AF when used with Sony A mount lenses.Tiltable 3.0\" LCDSony's 3.0\" Xtra Fine LCD monitor has 921K dots for superb resolution. The TruBlack screen includes a special resin layer to suppress internal reflections, increasing contrast compared to conventional LCDs. Sunny Weather mode boosts visibility even further. Tilts down 45&deg; and up 80&deg; to frame high- and low-angle shots that would otherwise be hit-or-miss.Object Tracking AFLocks onto a specified object and maintains focus even as the subject moves. Unpredictable subjects stay in focus even while zooming. You can concentrate on composition without worrying about focus.World's shortest release time lagHelps ensure that the image you want is the image you get. Once auto focus occurs, release time lag is the delay between fully pressing the shutter release and when the camera actually starts taking the picture. Long lag makes it harder to capture fast-moving objects. The Sony NEX-7 boasts the shortest release time in the world (as of August 2011) at only 0.02 seconds,Accepts Sony E-mount lensesCompatible with Sony's expanded line of E Mount lenses. These smaller, lighter lenses are specifically designed for &alpha; compact interchangeable lens cameras. Opens up a world of creative options.Peaking functionManual focus becomes much easier because peaking highlights the edges that are in focus in your choice of three colors (white, red, or yellow). This is especially helpful during macro or portrait photography where your focus setting can make or break your shot.3D Sweep Panorama ModeCapture vast scenic vistas and 16:9 shots in spectacular 3D. As you sweep across the panorama, the camera records separate right-eye and left-eye images that make landscapes come alive on your 3D television. Records both JPEG and MPO file formats.Sweep Panorama ModeCapture expansive landscapes automatically. Press the shutter, sweep vertically or horizontally. The camera does the rest, continuously shooting images and stitching them together.6-image layeringLeverages the fast BIONZ processor to capture six images in a fraction of a second, and then combine the data. The result is an incredible single image that controls blur in Anti-Motion Blur mode or gets cleaner, sharper nighttime pictures in Hand-held Twilight mode.Auto HDRHigh Dynamic Range (HDR) photography captures more scene contrast than a single exposure can handle by combining the best highlight detail from one shot and the best shadow detail from another for one incredible shot. (Recommended for still subjects.)P/A/S/M modes for video and stillsEnjoy a full range of controls for video and still shooting from the beginner's iAUTO mode to P/A/S/M: Program, Aperture Priority, Shutter Priority and Manual. On-screen prompts help you refine your skills, build your confidence and exercise greater creative control.Intelligent Auto FocusPre-focuses as you compose the shot, further reducing focusing time to a bare minimum.iAUTO modeUnifies and simplifies Sony intelligent technologies. Takes advantage of Intelligent Scene Recognition, Face Detection technology, and Optical SteadyShot image stabilization without leaving auto mode so you always get the best shot.BIONZ image processorThe brain of the camera is a Sony's BIONZ image processor substantially upgraded for the demands of 24.3 megapixel photography. Chroma noise reduction delivers high-resolution, low-noise photos even at ISO 16000 sensitivity. Also enables fast processing for up to 10 fps continuous shooting of data-intensive 24.3 MP images, 2D/3D Sweep Panorama modes and 6-image layering.Dynamic Range Optimizer (DRO)Improves results with backlit subjects and recovers details hidden in shadows. Settings include Auto, Level with a choice of five operating levels and Off.Accepts non-Sony lenses via adaptorYou can use the camera with a universe of lenses from Canon, Nikon, Leica, Olympus and others. The success of Sony's NEX series, combined with the ultra-short 18 mm flange back distance has inspired third-party manufacturers to provide lens adaptors. In addition, Sony has disclosed the E Mount specification to Carl Zeiss, Cosina, Sigma and Tamron.25-point Auto Focus25 sensors cover a very wide area of the scene, for accurate focusing even when the subject is far from the center of the frame.HDMI output Enjoy HD movies and stunning still images on a compatible HDTV. The camera includes an HDMIoutput.Stamina battery power for up to 400 shotsTake up to 400 shots on a single charge with Sony lithium ion Stamina battery power (using LCD monitor). Sony's InfoLITHIUM battery system enables you to see the percent of power remaining, so you can keep shooting in confidence.Sony Exmor CMOS sensorSony Exmor technology uses column-parallel A/D converters for high resolution and high frame rates. Double noise reduction minimizes image noise, even in low light.11 Picture Effect modesDiscover innovative ways to make your images and videos pop. These include Posterization, Pop Color, Retro Photo, Partial Color, Soft High-key, High Contrast Monochrome, Toy Camera, Soft Focus, HDR Painting, Rich-tone Monochrome, and Miniature.Ultrasonic anti-dust systemDust on the image sensor leads to blemishes in the picture. To protect the sensor, Sony incorporates an advanced ultrasonic system, which effectively shakes dust off the sensor surface."}