{"asin": "B005HM0SNA", "related": {"also_bought": ["B004TLH7C0", "B00CGUCBVI", "B00D856NOG", "B001KYU4BU", "B0041HFUWG", "B00GSC6HDI", "B001KBY6CQ", "B0019TGO6U", "B008DKCQUG", "B00AQQXF0U", "B00F8FLEPC", "B00E9GHR4S", "B005MKH1XC", "B000CKVOOY", "B00752ZKU6", "B00842FL1Y", "B002BP4MVA", "B008BW5RVQ", "B00IK05RV4", "B000GAWZAW", "B0064REJ3C", "B00CB7T52O", "B003XNB7U8"], "bought_together": ["B004TLH7C0"], "buy_after_viewing": ["B005MKH1XC", "B004W697ES", "B00ANAHMVC", "B004TLH7C0"]}, "title": "IPEVO PadPillow Pillow Stand for iPad mini, iPad 4, iPad 3, iPad 2, iPad 1, Nexus and Galaxy - Light Khaki", "price": 26.77, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41mb1j78--L._SY300_.jpg", "brand": "Ipevo", "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Stands"]], "description": "Cushy, comfy, cozy-PadPillow pillow stand is designed to keep you and your iPad comfortable. A soft, huggable pillow lets you rest any generation of iPad on your lap or stomach for all those times you'd prefer to skip the desk. PadPillow provides ultimate versatility for your iPad use, all with the comfort of your own body in mind. PadPillow is designed for you, not just your iPad. The pillow is comprised of two triangular sections connected with a soft hinge. Fold the sections out to the extended position, which is perfect for the floor, a lounge-style chair, or lying in bed. Rest PadPillow and the iPad on your legs, and you control the viewing angle with the bend of your knees. The extended position also gives you space for a Bluetooth keyboard, along with a comfy wrist support. Alternately, fold PadPillow's sections together for a compact pillow great for your lap, the couch arm, or the chair next to you. In this position, a raised leather label acts as a simple stopper for the iPad, which rests at an ideal angle for all your multimedia applications. Soft foam is complemented by an equally soft, 100% cotton cover. The stonewashed denim cover is as comfortable as that old favorite pair of jeans, and is removable and machine-washable. PadPillow is so, well, cushy, you could use it as a pillow for your head after you finish using your iPad. Don't confine your tablet computing and ebook reading to the desk or table. Free your iPad and take comfort computing to a new level with PadPillow. NOTICE TO CUSTOMERS: The PadPillow Pillow Stand for All Generations of iPad was previously known as Cushi Pillow Stand. As we transition to new packaging, some customers may receive packaging materials containing the Cushi name. The product you receive is identical in features and functionality. We regret any confusion during this transition."}