{"asin": "B001ASJIRM", "description": "Far Cry 2 by Ubisoft is the anticipated sequel to the award-winning original that brings players into the beautiful and hostile world of Africa. Far Cry 2 for Xbox 360 features open-ended gameplay that allows you to play the game whichever way you choose, with the choices you make affecting where the game leads you..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Far Cry 2Players:Offline: 1Online: 16Multiplayer Modes:Deathmatch, Team Deathmatch, Capture the Diamond, UprisingFormat:Native 720p high-definition output.Far Cry 2 brings you to Africa where you'll explore the savannah and the jungle.View larger.Far Cry 2 features real-time night-and-day cycles.View larger.Outstanding GraphicsUbisoft developed the Dunia Engine specifically for Far Cry 2. Among other things, the Dunia Engine delivers realistic, interactive environments, special effects, real-time night-and-day cycles, and smart enemy AI.Expansive, Realistic EnvironmentFar Cry 2 is set in a fictional region of Africa where you are caught between two rival factions at war. The Ubisoft team spent a lot of time filming and photographing in Africa to get all the details of the landscape and native wildlife. The result is a huge gameplay area that is 50 square kilometers, taking players into and out of the jungle and savannah. Wild animals such as zebras, buffalo, gazelle are encountered during the game, with both players and enemies allowed to interact with them.Far Cry 2 features an incredible level of detail and realism, with a minimal in-game interface to detract from immersion. For example, players will need to navigate the world using an in-game map and navigation system, weapons will disintegrate over time, and fires will spread and propagate.Each of the actions a player takes is reflected in the environment and changes the content of the game. To fulfill your mission, you need to play the enemies against each other, using both strategy and skill.Huge Range of Weapons and VehiclesFar Cry 2 offers gamers a wide range of weapons, from a machete for hand-to-hand combat, to a sniper rifle that can stealthily pluck off enemies from afar. As weapons disintegrate over time, they might jam or even explode in your hand.There are also a large range of vehicles such as gliders, trucks, cars, and boats that will let you fly, drive, slide, and hover over the open landscapes.Multiplayer Options for up to 16 PlayersFar Cry 2 supports up to 16 players and has four gameplay modes: Deathmatch, Team Deathmatch, Capture the Diamond, and Uprising. Players can choose from six different classes in multiplayer, each with its own set of pros and cons. Just as in the single-player mode, multiplayer games will feature dynamic elements, making each session unique.You can explore the world of Far Cry 2 from inside a car or flying on a glider.", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/6121Z3EtIDL._SY300_.jpg", "related": {"also_bought": ["B000CQNWH0", "B0050SYV70", "B00KAED6RU", "B002BSA1MQ", "B002V16T0Q", "B00354NAYG", "0761559337", "B000HKGIOA", "B000WSE2WM", "B0050SY77E", "B000HX1P72", "B002I0JA7E", "B000QCU9I0", "B005C2D2MO", "B0085CA8NY", "B001REZLY8", "B000FZZ5UA", "B000WMEEB2", "B001UWGDC6", "B000CBVC0Y", "B000C427NM", "B00163LW7A", "B0013RATNM", "B00BU3WWOS", "B003O6N2TI", "B0076ZPYPI", "B00886WO5W", "B002I0K50U", "B00G6MW5CC", "B004FSE52C", "B003O6EB70", "B000SQ5LQ4", "B0014ULQB2", "B000G7PMXC", "B003GSZ9ZE", "B000PE0HBS", "B00309U0M6", "B00DJ42EC6", "B0002CHIZ6", "B000V1OUV8", "B008E6ZXRM", "B001SH7YMG", "B0022TNO7S", "B003Q53VZC", "B000TI836G", "B000G75AXY", "B000RHZ9JI", "B000R0SR9E", "B002I0HAC6", "B000HCQK0A", "B000F3AADE", "B001CRQYBO", "B0016BVYA2", "B000KLNLV4", "B004PFS9OK", "B000H94PVO", "B0065NP6NC", "B000X1PE16", "B0050SY5BM", "B000MKA60W", "B0050SYLRK", "B0086V5V9A", "B003P9C6QY", "B003O6G47U", "B003H0CC2O", "B008AEE02M", "B000G7YRHO", "B000P46NMK", "B001QXNBJM", "B0009SQFHA", "B000OCXK6A", "B00149ILCK", "B004PAGJOC", "B0050SWVIQ", "B009WI7V9E", "B001D7T2VM", "B0050SYK44", "B002C0VNVG", "B001AWIP68", "B000ZK698C", "B004ML7WOK", "B000WQWPOQ", "B002SRSQ72", "B002DC8GEK", "B000WEQL02", "B003O6G5TW", "B000O5DS32", "B004YVOCYG", "B000OLXX86", "B0050SY9WC", "B0041OWQUI", "B002BRZ8BQ", "B00A8306C6", "B003L8HQ7S", "B002I0H79C", "B001OAKV3G", "B004QEV0MI", "B00AA4FDTY", "B003VWGBC0", "B004NRN5DU"], "bought_together": ["B0050SYV70", "B0050SYILE"], "buy_after_viewing": ["B0050SYV70", "B00BMFIXT2", "B0022TNO7S", "B0050SXX88"]}, "salesRank": {"Video Games": 4108}, "categories": [["Video Games", "Xbox 360", "Games"]]}