{"asin": "B003B4CU3M", "description": "Corel Paint it! gives you a whole new way to do more with your photos. This easy and fun photo painting software takes your favorite photo memories and magically transforms them into unique paintings, right before your eyes! Simply choose a painting style, press start, and watch as your photo automatically changes into a beautiful painting. Then, explore a range of fun effects to make it truly yours. Paint it! provides endless entertainment for kids and adults alike...and the end is just the beginning! Save, print, share or frame your photo art creations. Voila, it's your life, automagically painted!This easy and fun photo painting software takes your favorite photo memories and magically transforms them into unique paintings.Click to enlarge.Play with the Fire Brush, Fairy Dust, Pattern Pen, Leaf Brush and other fun effects to spice up your photo painting in seconds.Click to enlarge.All of the painting presets pick up color, intensity and lightness from the original photo, then apply brushstrokes in the style that you choose.Click to enlarge.FeaturesSit back and watch Corel Paint it! transform your photo into a painting, right before your eyes! Whatever your hobby, interest, skill level or motivation, Corel Paint it! lets you create beautiful photo art in just minutes. It&rsquo;s easy and fun, and your masterpieces will be perfect for jazzing up that scrapbook, family album, greeting card or any other visually creative endeavor.Personal, painted art in minutesAutomatically turn your photos into beautiful paintings that uniquely express your favorite moments in life.An authentic, hand-painted look&mdash;effortlesslyCreate an authentic-looking photo painting every time with smart auto-painting technology that mimics how a real artist would paint.Fun for all ages and skill setsProduce beautiful, personalized results, whatever your age or experience.Easy creative effectsPlay with the Fire Brush, Fairy Dust, Pattern Pen, Leaf Brush and other fun effects to spice up your photo painting in seconds.Compatible with popular photo-editing softwareOpen photo files that were created in other programs and, once you&rsquo;ve worked your magic, save your new paintings in a format that can be opened and shared anywhere. Your original photo file is always preserved.The end is just the beginningSave, print, publish or frame your painted memories to share with others so the magic lives on!Turn Your Photo Into a PaintingIt all starts with a photo. Whether it's a snapshot of a baby or other loved ones, a cherished pet or a stunning landscape, all you have to do is choose a photo to get started. Then simply pick a painting style.Painting stylesThe Photo Painting panel is located on the right side of the workspace and provides several preset painting styles. All of the painting presets pick up color, intensity and lightness from the original photo, then apply brushstrokes in the style that you choose.Oil--applies a combination of short dabs and longer brushstrokes to produce the color and texture of oil paintImpressionist--applies short and very visible brushstrokes to create the illusion of movement and lightModern--applies bold brushstrokes and adds vibrance to colors to produce an abstract reinterpretation of a photoIllustration--applies a wide variety of brushstrokes to produce an illustration-style paintingDetailed Watercolor--applies a translucent wash to produce the smooth, soft effect of watercolor paint on your photoWatercolor Sketch--applies a combination of drawn lines and watercolor brushstrokes that add depth, texture and contrastColored Pencil--applies fine-tipped colored pencil strokesPencil--applies graphite pencil strokes that appear to be drawn by handPen and Ink--applies sketchy strokes with a pen and black ink that appear to be drawn by handPastel--applies colored pastel strokes that appear to be drawn by handWhat's IncludedCorel Paint it! for Mac OS or WindowsGetting Started Guide (PDF)Help files (HTML)", "price": 40.7, "imUrl": "http://ecx.images-amazon.com/images/I/51CaIEIiQnL._SY300_.jpg", "related": {"also_viewed": ["B003WVFAO0", "B00EOI2SR2", "B008TN81ZG", "B000WCQCE4", "B00DT04I9W", "B008MR2EGG", "B00EOI2TD0", "B006WVR9GY", "B00DT04HWU", "B002J9V9BO", "B00ANH074Y", "B008MR2GKA", "B00EOQZB0A", "B00IVFDZBC", "B004YHXXHC", "B00H56FRYQ", "B00EOQZB4G", "B00EN27TCI", "B00EN27U9U", "B00EN27UC2"], "bought_together": ["B003WVFAO0"], "buy_after_viewing": ["B003WVFAO0", "B00EOI2SR2", "B008TN81ZG", "B000WCQCE4"]}, "salesRank": {"Software": 3192}, "categories": [["Electronics", "Computers & Accessories", "Computer Components"], ["Software", "Design & Illustration", "Illustration"]]}