{"asin": "B00019HNNM", "description": "The close of a trilogy is a touchy thing. Miramax's slasher pic Scream 3 highlighted the role of each part: Chapter one sets the rules. Chapter two bends the rules. And chapter three throws them all out the window in favor of taking the story full circle.Which brings us to the third part of the Onimusha trilogy, subtly titled Demon Siege. In the first of many switches from the franchise's usual MO, there are three playable characters &#8211; Jean Reno's Jaques, the first Onimusha's Samanosuke, and Parisian military woman Michelle. Each offers wildly different play mechanics, and this coupled with the game's time warp storyline (more on that later) offers needed variety to a survival horror franchise that was never really know for its fear factor.Each character will upgrade their weapons and skills through the course of the game (much less so for Michelle, as she's playable for far less of the game than the other two) in the usual fashion&nbsp;&#8211; collecting souls. Without a combo-laden combat system, Demon Siege relies heavily on timing and strategy to master each of the three warriors. This mechanic is very reminiscent of Enter the Matrix for two reasons: minimal button presses result in onscreen action that looks very, very cool. Two, the timing of action is far more crucial than combos. The difference is that Demon Siege is just a much better game &#8211; the enemies offer more variety, the control is more precise, and the elemental weaponry is extremely varied.While some action hardcores will likely fault the game for its simple control scheme, most will appreciate it for the satisfaction it brings to the screen. Kicking a demon away so you have better range with the Ball and Chain of Doom (my name for it, not the game's) is quite cool, after all. Just keep in mind that plot and combat play equal roles in the Onimusha universe, and each are doled out fairly.On the story side of things, Demon Siege has that dual time period hook. How well is the idea executed? Well, Paris really looks like Paris; and without being able to experience feudal Japan firsthand, all I can say is that it looks beautiful in the game. The plot unfolds at a lightning pace and requires players to use one character (in one time period) to do something, which has an effect on the other character (in the other time period). Switching frequently, the game's pace is so well crafted that there are few places that seem to be a pause &#8211; you'll always want to do that next thing.What I really like about this game is that I always felt like I was getting a new weapon, going to a new area, or fighting a new boss (most of which are ferociously tough, by the way). There was no drag for me. That, and kicking Genma butt made me look badass. Personally, I wouldn't want anything else for my favorite samurai/horror sendoff.Concept:Craft a compelling, edge-of-your seat action game to conclude the Onimusha seriesGraphics:3D backgrounds don't mean that players have camera control, but it does mean that everything looks really greaSound:The score alternates between totally inspired and super cheesy &#8211; but it does fit the gamePlayability:Timing is the key to success and I rarely felt robbed, so it did what it was supposed toEntertainment:Demon Siege is one of the most cinematic games to date, and I soaked up every second gratefullyReplay:HighRated:9 out of 10Editor:Lisa MasonIssue:June 20042nd Opinion:The final chapter of the Onimusha trilogy radiates excitement and is the very definition of epic. The opening CG cinematic is so detailed and explosive that I wouldn't be surprised if George Lucas started handing out pink slips to the ILM crew. I know this clip is only a few minutes in length, but it is worth the price of admission alone. Further justifying that you absolutely need to add this title to your library, the gameplay is equally exquisite and is brimming with non-stop intensity. The methods with which you dispose of your assailants remain simplistic and true to the series. Plus, the battles are much larger in scope, the pacing of levels is relentless, and the visuals that you breathe in are all the more majestic. This truly is game development at its finest. While I would have liked to see more interaction in the environments, and depth in the combat, I really couldn't ask for a better conclusion to one of the PlayStation 2's finest series.Rated:9.25 out of 10Editor:Andrew ReinerSubscribe to Game Informer--Game Informer Review", "price": 19.5, "imUrl": "http://ecx.images-amazon.com/images/I/51MJR1K0DRL._SY300_.jpg", "related": {"also_bought": ["B000066TS3", "B00004U5VK", "B000CQ75VY", "B0009RG8DW", "B0000TSR7Y", "B0009XBWY6", "B00005V5MZ", "B00005NCCR", "B0002CHJAA", "B000FDOTIQ", "B00007E1OA", "B00005TNI6", "B000088KH9", "B00005BW7Q", "B00009KO3L", "B00024W1U6", "B000E49SGE", "B00019HNNC", "B00004YRQA", "B00005ME6N", "B00009YEK1", "B00005ML10", "B000TLU67W", "B000B69E9G", "B000G82R20", "B0002RQ3ES", "B00005B70K", "B00004ZDFY", "B001C6GVI6", "B0001A86EG", "B000FIVC2W", "B000935256", "B00009ZVHY", "B000F5IH2I", "B000FPGZUE", "B0002A6CPA", "B000056SNY", "B0009A4EVM", "B001UIG6M2", "B000G6SPHI", "B001QTW2GY", "B0001ADAME", "B00006LEMX", "B0000A09EM", "B0000A8VBZ", "B00005OLX1", "B00K85X1TE", "B00029QQNY", "9629971372", "B0002XL3BA", "B001MW91IW", "B0007XTNFS", "B0009PETYO", "B0009UC6AI", "B00001ZWMV", "B00006LELI", "B00JQI471A", "B000A0EFJM", "B000CSUKY6", "B0000696CZ", "B00006LEMK", "B0009A4EV2", "B00005ME6O", "B00005Q8IR", "B0007L8GPI", "B000JLIXI6", "B0000664JF", "B00008RUYZ", "B000069D39", "B000E0VMVM", "B0009R1T9K", "B0000657SP", "B0009R1TGS", "B000095ZH6", "B000063RRN", "B00006B5T8", "B00008URUA", "B00006LEM8", "B0001HAI68", "B00007KQC1", "B000G0O6CW", "B00005UNWC", "B00007LV7Z", "B000066JRQ", "B00020LZAM", "B0002GTFIK", "B00005V6B9", "B0009A4ETY", "B0001NBNHU", "B00004WLQV", "B0002CHJ8C", "B00005NN5J", "B00004U5VF", "B00005ML0X", "B000R2YWEQ", "B00007LV7Y", "B000G7X5P4", "B00009XO59", "B00KVRK39A", "B000066TS5"], "bought_together": ["B000066TS3", "B00004U5VK"], "buy_after_viewing": ["B000066TS3", "B00004U5VK", "B000CQ75VY", "B0009RG8DW"]}, "salesRank": {"Video Games": 7367}, "categories": [["Video Games", "More Systems", "PlayStation 2", "Games"]]}