{"asin": "B000U9TXJ0", "description": "ThePSP is the first truly integrated handheld entertainment system designed to handle multiple applications &#x97; music, video, communication, and wireless networking, with games as its primary driver. PSP brings an unparalleled gaming experience to a handheld platform, allowing users to enjoy 3D games, with high-quality, full-motion video, and high-fidelity stereo audio. With graphics rendering capability comparable to that of PlayStation&#xAE;2, PSP features a 4.3-inch wide screen, high-resolution TFT display. PSP also adopts a newly developed, proprietary compact but high-capacity (1.8GB) optical disc, Universal Media Disc (UMD), as its storage medium.* ThePSPDaxterEntertainment Pack- Ice Silver contains: The Sony PSP - Ice Silver, AC power cord, AC adaptor and battery,1GB Memory Stick Pro,Daxterthe game, andFamily GuyUMD.Check out the PSP features in depth below:Games|Movies/Video|Music|Photos|Internet|LocationFree&#xAE; TV|Tivo-To-Go&#x99;|RSS|Online GamingWhat&#x92;s in play this season.Dazzling widescreen LCD brings gaming to lifeHundreds of games that let you take your gaming on the goUnique content created specifically for the PSP&#xAE; systemDiverse genres &#x97; and all created with portable gaming in mindPlay games anytime, anywhere on the PSP system&#x92;s dazzling, widescreen LCD. Games are playable off a UMD&#x99; (Universal Media Disc), which load when inserted into the system. If your PSP system hasn&#x92;t been updated,  the game software will update your PSP system&#x92;s firmware as well.See more topics.The silver screen, conveniently resized.Choose from hundreds of movies and TV shows to watch, spanning diverse genres and viewing choicesTake your entertainment with you on the go by placing your downloaded videos on Memory Stick Duo&#x99;Here&#x92;s How it Works.Use the Use the PSP Media Manager to easily place videos on your PSP System&#x92;s Memory Stick Duo.PSP Media Manager will search your PC for videos, and then convertAlternatively, watch full-length movies and TV shows off a UMD&#x99;.See more topics.Let the music move you &#x97; anywhere.Place your MP3 collection on Memory Stick Duo and take your music with you everywherePlays MP3, WAV, WMA, ATRAC3+, and MP4 formatsHere&#x92;s How it Works.You can add MP3&#x92;s (or other music format files) to your Memory Stick Duo for play on your PSP system.Simply attach your PSP to your PC through a USB cable &#x97; making the PSP an external drive.You&#x92;ll then be able to copy your MP3s onto your Memory Stick Duo (make sure that your Memory Stick Duo is formatted for use on  your PSP and that you place your music files in the folder labeled Music).Then just plug your headphones in, go to Music on the PSP system&#x92;s XMB&#x99; (XrossMediaBar) menu and select your song.See more topics.Take your photos and slide shows to go.Place your photos on your Memory Stick Duo and view them on the LCD screenBeam photos to friends via Wi-FiSet up a slideshow to show friends and family your photo collectionHere&#x92;s How it Works.It&#x92;s easy to place photos on your PSP system!Attach your PSP to your PC through a USB cable &#x97; which will make the PSP an external drive.You&#x92;ll then be able to copy your photos (JPG, TIFF, PNG, GIF, or BMP formats) to your Memory Stick Duo (make sure your Memory Stick Duo is formatted for use on your PSP and that you place your photos in the folder labeled Photo).You can then go to the Photo icon on the PSP system&#x92;s XMB and select the photo that you&#x92;d like to view.You can also beam photos to a friend in the vicinity who has a PSP. Make sure that both of your PSP systems have the Wi-Fi switch set to On.The photo &#x91;Receiver&#x92; should go to the Photo icon on the PSP system&#x92;s XMB, select the location to save the photo and press.Select &#x91;Receive&#x92;.The photo &#x91;Sender&#x92; should go to the photo to be sent and press.Select &#x91;Send&#x92; and press.The photo will be beamed via Wi-Fi to your friend&#x92;s PSP.See more topics.Got a hot spot? Get some cool stuffAccess the Internet from any accessible hotspotFor exclusive PSP downloadable demos and content, visitwww.us.playstation.com/pspHere&#x92;s How it WorksTo access the Internet on your PSP system, first make sure that you are at an accessible hotspot and that your Wi-Fi switch is set  to ON.If you are at a new location, you&#x92;ll want to select the WWW icon on your PSP system&#x92;s XMB screen, and then follow instructions to set up a New Connection.Once you have tested this connection, select the WWW icon from your PSP system&#x92;s XMB screen again.Pressand thento access the URL bar, or scroll over to the Bookmarks icon (noted by the &#x91;heart&#x92; icon) and select a site.If accessing through the URL bar, after pressing, the on screen keyboard will pop up. Enter the desired website URL and your PSP will connect you to that site. Once the web page is shown, pressto hide the toolbar.See more topics.LocationFree TVWatch live TV, DVR content or your DVD player content on your PSP system from anywhere in the world via an accessible hotspotConnect your compatible TV, DVD player, DVR, Camcorder, or PC to the LocationFree Base Station. Then enjoy your favorite TV shows, movies, created video, and more where and when you want on your PSP &#x97; wherever wireless connectivity allowsHere&#x92;s How it WorksTo connect to your LocationFree TV base station through your PSP, make sure you have installed firmware update 2.80 or later and that your Wi-Fi switch is set to On.Go to the LocationFree icon underneath the Network icon on your PSP system&#x92;s XMB menu. (If you have not set-up a connection  yet, your PSP will take you through the process.)Register your PSP with the LocationFree TV base station by pressing the &#x91;Setup Mode&#x92; button on the base station.Select the LocationFree TV icon under the Network icon on the XMB menu and press.Select a public wireless LAN service (if outside the home) or &#x91;LocationFree AP&#x92; (if inside the home). Now you can enjoy your favorite TV shows, DVR or DVD content from the road! For further set-up information, go towww.sony.com/locationfree.See more topics.TiVo-To-Go&#x99;Watch recorded TV content downloaded to your Memory Stick DuoTiVo-To-Go&#x99; service costs $24.95 (one time flat fee) and converts recorded TiVo content to the correct PSP system formatCheckwww.tivo.com/tivotogofor more informationHere&#x92;s How it WorksTo access your TiVo content for playback on your PSP, your TiVo Series2&#x99; must be connected to your home network (connecting it  to your PC).Next, go towww.tivo.com/tivotogoto download the TiVo Desktop Plus software. This will allow your PC to convert the TiVo files  to a PSP readable format. TiVo charges a one-time fee of $24.95 for this service, payable via their website.When TiVo Desktop Plus has been downloaded, click the box in the &#x91;Preferences&#x92; menu to ensure files are converted to PSP  format.Transfer the shows you wish onto your PC. The PC will then automatically convert the files into PSP readable files and place in  a separate portable downloads folder.You&#x92;ll then need to connect your PSP to your PC via the USB cable &#x97; which will turn the PSP into an external drive. Make sure  your Memory Stick Duo has been formatted for use on the PSP and that you have updated your PSP system&#x92;s firmware to version 2.80 or  later. From there, you&#x92;ll be able to enjoy your TiVo content on your PSP!*Mac users can convert their TiVo Series2 programs for PSP as well using Roxio Toast 8 -- seehttp://www.tivo.com/mactivotogo/for details.See more topics.RSSEnjoy audio and video RSS (podcasts) downloaded to your PSP system &#x97; anywhere you goCheck out PlayStation Mayhem and other RSS content on the RSS page through the official PSP websiteHere&#x92;s How it WorksStart the web browser (see Internet section for more information).Select a webpage that offers RSS-distributed content.Select the icon for the RSS-distributed content.Select YES and then press. You have now created an RSS channel for that webpage. To access this content, simply go to  the channel under the RSS menu.See more topics.Battle others in intense online gaming at home or through complimentary 6 month access at any T-Mobile HotSpot*Here&#x92;s How it WorksTo play anyone in your local vicinity (up to 50 feet away), simply make sure your Wi-Fi switch is set to the On position, and  follow the game&#x92;s instructions on how to connect. Both PSP systems must have a copy of the game to play.To play online, make sure you're at an accessible hotspot (at home or T-Mobile HotSpot), and set your Wi-Fi switch to the On  position.Ensure you have set up a new connection and then follow the game&#x92;s on screen instructions to access the game lobby and find  people to play!Checkwww.us.playstation.com/psp/to view T-Mobile HotSpot  compatible games.For detailed instructions on installing the necessary firmware update required for T-Mobile HotSpot online gaming, go to:www.us.playstation.com/psp/downloads/systemupdate/*Available through March 28, 2008. PSP must be updated to System Update v.3.30 or later.Check out more upcoming games athttp://www.us.playstation/psp/See more topics.", "price": 249.95, "imUrl": "http://ecx.images-amazon.com/images/I/51AEpJfNmIL._SY300_.jpg", "related": {"also_bought": ["B000G79XQO", "B002DGNLFK", "B001TOQ8T8", "B00168PFFK", "B000ASBKHE", "B0051U7BZG", "B002SD94AY", "B000E0OCR8", "B001T8S62Q", "B0015A8RQ8", "B001O11A80", "B0067SACS4", "B000H0SGV8", "B0007TS24U", "B000FW6HPU"], "bought_together": ["B000ASBKHE", "B00168PFFK"], "buy_after_viewing": ["B001KMRN0M", "B000E0OCR8", "B000G79XQO", "B001GXI4LM"]}, "salesRank": {"Video Games": 8205}, "categories": [["Video Games", "Sony PSP", "Consoles"]]}