{"asin": "B00030097G", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Input Devices", "Graphics Tablets"]], "description": "From the ManufacturerIntuos3 gives you the power to quickly and professionally edit photos and create digital artwork by turning on the full power of Adobe Photoshop, Corel Painter, and over 100 other leading software applications. Intuos3 tablets now put ExpressKeys and Touch Strips right at your fingertips for convenient keyboard shortcuts, scrolling, zooming, brush size control, and more. And if you're using a widescreen display or multiple monitors, the new Intuos3 6x11 and 12x19 are designed just for you.Wacom's pen-abled technology gives you the natural feel and superior performance of Wacom's patented cordless and battery-free tablet technology. You'll find that using an Intuos pen, mouse, and tablet gives you more control, comfort, and productivity. Alternating between the comfortable Grip Pen and the ergonomic five-button Intuos3 mouse reduces repetitive motion. It's an easy and natural way to work.Every point on the tablet has a matching point on the screen. When youmove your pen over the tablet the cursor moves in precisely the same way on the screen.Using a pen tablet is easyIt's easy to use a pen tablet because every point on the tablet has a matching point on the screen. When you move your pen over the tablet the cursor moves in precisely the same way on the screen. Where you touch your pen tip to the tablet is where you click.Pressure sensitivityThe Intuos3 Grip Pen gives you the power of pressure-sensitive control. Pressure sensitivity lets you control your software tools by changing how hard you press the pen tip to the tablet surface. Using pressure sensitivity you can dynamically control things like brush size, opacity, and more.New Intuos3 tabletErgonomic design with sloping, contoured palm rest for comfortMultiple cord positions for greater workspace flexibility8 ft. cable allows you to kick back while you workEnhanced electronics for twice the resolution (5,080 lpi)Available in six sizes: 4x5, 6x8, 6x11, 9x12, 12x12, and 12x19 for a perfect fitNew Intuos3 Grip Pen1,024 levels of tip and eraser pressure sensitivity for controlCushioned, contoured grip with programmable DuoSwitch for comfort and productivityPatented cordless, battery-free technology for a natural feel and superior performanceMulti-position pen stand to keep your pen handyTilt sensitivity for even more controlNew ExpressKeys and Touch StripsStrategically placed programmable ExpressKeys and Touch Strip for convenienceExpressKeys are \"chordable\" and can be used for mouse clicks, modifier keys, and keyboard shortcutsFinger-sensitive Touch Strip for quick scrolling, zooming, and moreNew Intuos3 Five-button MouseBall-free and optics-free for smooth, accurate trackingAmbidextrous low-profile design with just the right feelPatented cordless, battery-free technology for superior performance and reliabilityFive programmable buttons with fingerwheel for flexibility and controlThe Intuos3 grip pen offers 1,024 levels of tip and eraser pressuresensitivity for control.", "title": "Wacom Intuos3 6 x 8-Inch Pen Tablet", "price": 305.95, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41VN48GYEDL._SX300_.jpg", "related": {"also_bought": ["B00083Y85C", "0955153077", "B009U5D8HI", "B00066K4UY", "B0006698PG", "B00CYX26BC", "B0044RUSZM", "B003JZNZR8", "B002LJRKN8"], "buy_after_viewing": ["B00EN27U9U", "B00EN27UC2", "B00EN27SHY", "B00EN27TCI"]}}