{"asin": "B001SEQN3U", "related": {"also_bought": ["B00B1KKZEE", "B001SEQN3K", "B005GTNZUM", "B005VAORIA", "B005GTO07O", "B00465UNYI", "B001J30FZM", "B000NOR89Y", "B00906E03I", "B005VAORH6", "B0058OA0BW", "B008NP76FQ", "B00B1KKK2G", "B003VAGXZC", "B000J4WPW8", "B0011N01XG", "B004WO8HQ4", "B0001V3AVY", "B000UXZQ42", "B00BBFRN8K", "B009ZJ3MUM", "B0083I7Y8W", "B0053FE422", "B0017K6BD2", "B006JH8T3S", "B003VANO7C", "B00BP5KOPA", "B004C9M7UG", "B003VANOFY", "B00BWF5U0M", "B00HR78S2Q", "B004S4R5CK", "B004AF9II6", "B004C9QST2", "B00EXPNFUA", "B009HNEBLK", "B004SP0WAQ", "B00000JRRD", "B005BZNDOO", "B007JR5304", "B003VGUGBS", "B009H0XQRS", "B000A6PPOK", "B0006HUQZ6", "B008ALA6DW", "B005EJH6Z4", "B0012YVGOW", "B003NR57BY", "B003TG75EG", "B007Q45EF4"], "bought_together": ["B001SEQN3K", "B005VAORH6"], "buy_after_viewing": ["B005GTNZUM", "B003VANOFY", "B00B1KKZEE", "B005GTO07O"]}, "title": "Plantronics Audio 995 Wireless Stereo Headset", "price": 59.95, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41c%2BZ7583TL._SY300_.jpg", "brand": "Plantronics", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Headsets & Microphones", "PC Headsets"]], "description": "Freely roam from away your desk while making Internet phone calls or listening to your favorite music with the Plantronics .Audio 995 Stereo Headset. This lightweight, ultra-comfortable headset delivers full-spectrum stereo with a 40-foot wireless range. The headset also features on-ear controls for iTunes and Windows Media Player, so you can control your music without being tethered to your desk.With a 40-foot range, you won't be tethered to your desk while making Internet calls or listening to music.View larger.Plug-and-Play Wireless FunctionalitySet up is as simple as can be: just plug the wireless USB adapter into your computer's USB port and you're good to go. There's no software to install, no configuration, no hassles. Once plugged in, you'll be able to roam up to 40 feet from your desk without interrupting your PC calls or music. And thanks to the convenient on-ear controls, the .Audio 995 lets you skip tracks and adjust volume on iTunes and Windows Media Player remotely.Outstanding, Full-Range Audio QualityThe .Audio 995 features dual 40 mm speakers that deliver crisp, clean treble with deep, rich bass. The sound is so clean and rich that you won't believe it's wireless. Whether you're listening to music, playing a game, or watching your favorite DVD, you'll hear every detail.Make Crisp and Clear Internet CallsExperience exceptional call quality when you use the .Audio 995 to make Internet calls with Skype or other Internet phone services. The person you're talking to will also hear you with superior clarity thanks to the headset's noise-canceling microphone, which is designed to reduce background noise. And thanks to the Fast Mic Mute feature, you can quickly mute the microphone by simply raising the boom.Smart, Adjustable Design for All-Day ComfortThe .Audio 995 sports a lightweight design that stays comfortable all day and all night, making it perfect for listening to music during all-night study or marathon gaming sessions. The adjustable headband lets you customize the fit, and the soft, swivel-mounted speakers cushion the ears comfortably.The Plantronics .Audio 995 Headset is backed by a one-year warranty.What's in the BoxWireless Stereo Headset, USB wireless receiver, USB charging cableGet up and away from your desk and roam around with the .Audio 995."}