{"asin": "B002W6Z80C", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The subject may not realize the photo has already been taken. With the GR DIGITAL, that is the kind of quick shooting you will find paired with superb image quality. The new 28mm/F1.9 lens features outstanding brightness. A convergence of sophisticated image processing capabilities and comprehensive shooting functions: GR DIGITAL III. Sparking an explosion of photographer creativity, a new legend is born.Ricoh GR III Digital HighlightsThe photographer's ideal lens: 28 mm/F1.9 GR LensAs photography lovers themselves, the developers focused all their passion and creative vision on the creation of a new lens of unprecedented power: the 28 mm/F1.9 GR Lens. If image quality is the priority, set a lower-than-ever ISO sensitivity. If capturing a shutter chance is the priority, set a higher-than-ever shutter speed. F1.9 expands the freedom and scope of your photographic expression.Pride of the GR series: Superb optical performanceSo how was this lens able to control the various types of aberrations that increase as the aperture increases? While maintaining a basic configuration optimized for thin storage, frame aberration was reduced by adding two elements in one group to the rear. In addition, three special low-dispersion lenses were used to achieve high resolution and contrast while minimizing color aberration. The use of two high-precision aspherical lenses made distortion almost unnoticeable. In order to create this ultra-high-precision and high-performance lens, highly precise manufacturing processes and an exclusive control system were newly developed. It was dedication and tenacity that gave birth to this jewel of a lens.MTF chartSuperior backlight performanceGhosting is one of the causes of image quality deterioration. To eliminate the problem, all of the individual lenses that are part of the GR lens have been covered with the multi-coating optimum for each. To minimize the small residual reflection striking the CCD, we also ran original simulations repeatedly to determine optimum conditions for lens curvature, etc. As a result, we successfully suppressed ghosting, particularly that caused by off-screen light sources such as the sun.GR ENGINE III for low-noise, high-resolution imagesNewly developed image processing engine GR ENGINE III enables precise noise reduction by processing the signal close to its CCD-output state. Various types of noise are effectively reduced while maintaining resolution and color saturation. Color reproduction and tonal gradation performance has also been significantly improved.10-megapixel high-sensitivity CCD and AFEWith the new CCD, rather than increasing the number of pixels, we have about doubled sensitivity compared to the previous model (GR DIGITAL II). Even at ISO 200, imaging performance is at or above the old ISO 100 level. This higher ISO sensitivity makes a clear difference in image quality.Suppressing whiteout to create \"high-reality\" images: Pixel output interpolation algorithmControl whiteout with the pixel output interpolation algorithm, Ricoh's original image processing technique. Comparing the output of each pixel, the algorithm interpolates image data in whiteout areas. This expands dynamic range by up to +1 EV equivalent. Using this extensive data to generate the JPEG, even for 8-bit (256-tone) images, it is possible to create a more \"real\" look with less whiteout than in the past.Effective solution for mixed light sources: Multi-pattern auto white balanceIn scenes mixing multiple light sources--such as sunlight and shadow, ambient light and flash--the optimum white balance of each is determined by segmenting the image. For both subject and background, you get well-balanced coloration closer to what you saw while shooting.Fast AF is strong in low-light situationsSmooth, quick AF is possible even in low-light scenes where contrast detection is necessary and focusing is generally slow. The excellent focusing response enhances shooting.Full Press Snap to grab that shutter chanceWith this quick-shooting function, AF operates when the shutter release button is pressed half way, but for a one-push full-press, the photo is taken at a set focal distance. (1m/2.5m/5m/8). This distance setting can be easily changed. Since the AF does not operate for a one-push full press, you will not miss the moment.Don't let that shutter chance get away: Pre-AF functionEven if the shutter release button is not pressed half way, focusing follows the subject&rsquo;s movement. The pre-AF action accelerates focusing time.RAW evolution: Continuous shooting and high write speedWith the expansion of buffer memory, continuous shooting of up to five images is possible even for RAW. This facilitates bracketing as well as the shooting of quickly moving subjects. The RAW card write speed has also been accelerated (under 3 seconds per image). These specs will help reduce your \"shooting stress.\"Freedom of expression with framing and light: AE/AF target shiftFocus and exposure settings can be done at designated points on the screen. These AE and AF targets can be shifted either alone or together in order to do Spot AE and Spot AF. This increases framing and light-expression freedom in situations such as tripod shooting where the camera cannot be moved for AE or AF lock and macro shooting where precise focusing is demanded due to shallow subject depth of field.Shutter speed priority AE newly added: Extensive exposure modesShutter speed priority has been added to the existing modes (program shift, aperture priority, etc.). It is useful when you want to manipulate motion, such as when stopping subject movement or creating a feeling of energy in a panning shot.New macro mode system controls field curvatureMinimum shooting distance is approx. 1 cm. A new system was adopted in which one part of a lens group which does not move during normal focusing is shifted into a special position for close-up photography. This corrects the field curvature that tends to be a problem in close-up shooting with retro-focus wide-angle lenses. The result is superb imaging power across the entire photo.Images with a naked-eye impression: Dynamic range double shotThis function prevents overexposure and underexposure in high-contrast scenes. For reproduction of both light and dark areas, two images with different exposures are shot in succession, and the properly exposed portions of each are automatically combined. This expands dynamic range to a maximum equivalent to 12EV, creating an image with a close to naked-eye impression.Aspect ratio 1:1 square format modeShooting aspect ratio 1:1 photographs, the square format will expand your creative enjoyment with the fresh feel of the framing and the strong subject presence produced by limiting the image field. This format is also convenient for blog use.Image quality parametersIndividual color settings have been added to the image settings. For each color (orange, green, sky blue, red, and magenta), hue and saturation can be set at five levels so you get the coloration you want. In addition, with the \"vivid\" setting, you can easily shoot intense high-saturation images.Flash synchro settingThe expressiveness of a photograph can change greatly depending on flash timing. If you want to be sure to catch a fleeting portrait expression, select \"1st Curtain,\" and if you want to create a natural light trail in a dark scene, select \"2nd Curtain.\" Even in bright scenes, this can help you record natural-feeling movement for moving subjects.Manual flash amount settingFlash amount can be set at 12 levels from full flash to 1/64, enabling you to balance flash intensity for both subject and background brightness. The subject's expression and presence can be emphasized while the background is obscured. Fine tune the settings to fit the ambient light conditions and your creative intentionsLevel compensationImage brightness and contrast can be corrected in the camera itself after shooting. With AUTO, you leave the subtle adjustments up to the camera. With MANUAL, you can freely and intuitively adjust brightness and contrast using the histogram. The corrected image is saved as a new file so the original is still available, and the two can be compared.Three types of bracketingThree automatic bracketing functions are provided. With auto bracketing, you can select exposure intervals from 0.3EV to 0.5EV. White balance bracketing is convenient when precise coloration is important and when shooting with a distinctive light source. Color bracketing enables you to obtain color and black-and-white images for two very different impressions of the same scene. In all cases, the multiple images are generated from a single shot so you can get the feeling you are after without missing any shutter chances.3.0-inch VGA LCD for beautiful displayLCD panel visibility was further improved with VGA high resolution and an expansive 3.0-inch size. The sRGB comparison for color reproduction range is 100%. This has significantly improved the visual reality of the image during framing, the ability to search images and check shooting data, and the ease of making function settings.Electronic levelWhen shooting landscapes and night scenes, visual clues for finding the level position can be missing or hard to see. The electronic level is very effective at such times. You can quickly find the precise level position, which will give a feeling of stability to the image. When the external viewfinder is attached, the level sound can be used to determine if the camera is tilted.My SettingsBy just turning the mode dial, you can use My Settings to instantaneously switch to many different shooting functions. The number of sets which can be assigned has been increased to three so you can handle a wider range of shooting situations and creative intentions.My Settings BoxUp to six My Settings sets can be stored in the My Settings Box. Then you can just choose the set you need and quickly assign it to MY1, MY2, or MY3. You can also name each set yourself to make it easy to choose the correct one.Direct operation enhanced with two Fn buttonsThere are now two Fn (function) buttons for one-push access to necessary functions. Assign frequently used functions to each to increase direct operability.Operation function customizationTo give the individual photographer the most natural operation feel, functions can be assigned to the up-down dial and the ADJ. lever. Increase shooting/playback flexibility by creating intuitive operations that minimize finger movement.One-push playback enlarged viewIn playback mode, you can display images at a previously defined magnification by just pushing the ADJ. lever once. This eliminates the inconvenience of having to change magnification level by level. Setting a magnification suitable to recorded image size and intended print size will speed up your image checking.Three grid guidesIn addition to the 3 x 3 grid, a 4 x 4 grid with diagonal lines and 2 x 2 grid with central visual field have been added. Choose the best grid for your subject: diagonal lines will clearly show the image center for building/product photography and a 2 x 2 grid can be helpful for capturing a moving subject.GR Design: Excellent portability and grip feelThe GR DIGITAL III inherits a traditional design born to carry out the camera's true mission of always being ready for the next shutter chance and reliably recording the result. Keeping the same pocketable form and hand-clinging grip, careful attention was given to enhancing operability and quality.Magnesium body for superior reliabilityA light and highly rigid magnesium alloy is used for a body that has strong shock resistance and durability. It also has excellent heat radiation and magnetic shielding characteristics, important features for a digital camera. This is a camera that can stand up to a photographer's \"hard use,\" providing both reliability and high operation precision.", "title": "Ricoh GR DIGITAL III 10 MP CCD Digital Camera with 28mm f/1.9 GR Fixed Lens and 3-Inch LCD", "price": 612.19, "salesRank": {"Camera &amp; Photo": 13287}, "imUrl": "http://ecx.images-amazon.com/images/I/41yq%2B7TFLiL._SX300_.jpg", "related": {"also_viewed": ["B00CGY4N7Y", "B005MOWRXM", "B00GXJ2G7W", "B003M5H7Q0", "B005NGLWSK", "B00B46A1AS", "B00B46A1A8", "0500289077", "0821225227", "B00BOZ1XA6", "B005KBB79C", "0500543992", "B0043RS864", "B00931S35G", "B002W6Z1JK", "B008MB719C", "B009AYJQ2U", "B00B5P5XUG", "B00ATM1MHO", "B001CCLBSA", "B002MUAEX4", "B003WJR69E", "B008XGS9G0", "B0095F5AFQ", "B004G8QSTO", "B00AV3XH9W", "B0013DCOZC", "B001BKUTMW", "B00FPKDPXY", "B003UYU3MS", "B007SQB896", "B00889ST2G", "B00CFCTDMC", "B00427ZLRO", "B00EZAYD4A", "B009B0MY6S", "B0090SLE30", "B00FPKDQ1A", "B00FY6TSCG", "B002W6Z1JA", "B00EYTM3FS", "B006UV6YMQ", "B00ATM1MVA", "B006UMM2BW", "B008FH4L7S", "B00BFQ33B6", "B00604YTFM", "B005BG0IWS", "B0042VJCXY", "B001W3429E", "0300167814", "8857200612", "B00DCM0DVE", "B00HYAL88W", "B003ZSHNGS"], "buy_after_viewing": ["B00CGY4N7Y", "B005MOWRXM", "B00CFCTDMC", "B00CFCTDMC", "B008MB719C", "B008MB719C"]}}