{"asin": "B004Q3RE4W", "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Stands"]], "description": "Use and view your iPad comfortably anywhere in your home with the Belkin ViewLounge. Featuring a weighted beanbag base, the ViewLounge secures your iPad on soft or uneven surfaces like a bed or sofa armrest. Use it with or without an iPad case in either landscape or portrait mode. Easily adjust the angle of your iPad to switch between typing and watching videos. With an attractive design that lends itself to any home decor, the ViewLounge is a stylish and practical solution that will help you get the most from your iPad.ViewLoungeAt a Glance:Beanbag base secures iPad on soft, uneven surfacesGrippable texture adds stabilityPortable, compact designDesigned for iPad but compatible with most other tabletsBacked by a limited one-year warrantyWeighted base with grippable texture secures your iPad to uneven surfaces.View larger.Free your hands for easy typing by resting your iPad on the base.View larger.iPad Stand Designed for LoungingThe Belkin ViewLounge makes it easy to rest your iPad on uneven surfaces like the armrest of a couch or the corner of your bed, so you can use your iPad in comfort. With its weighted beanbag base, the ViewLounge conforms to virtually any surface. A grippable texture ensures the stand rests securely--even on soft surfaces. Easily move your iPad from seat to seat and room to room thanks to the ViewLounge's compact, portable design.Fully Adjustable for Versatile ViewingThe ViewLounge allows you to use your iPad in both landscape and portrait modes, making it easy to type out messages, surf the Web, and watch videos while you lounge.The stand is also fully adjustable, letting you control the precise angle of your iPad. Adjust it to a 90-degree angle for watching movies, or simply rest your iPad on the rubber base for easy typing. By allowing you to keep one or both of your hands free, the ViewLounge is an essential tool for getting the best possible tablet experience.Designed for iPadThe ViewLounge is designed specifically for the iPad and is compatible with the 16GB, 32GB, and 64GB models. It is also compatible with most tablets from other brands.The Belkin ViewLounge is backed by a one-year limited warranty.What's in the BoxViewLounge stand and instruction manual.", "title": "Belkin ViewLounge for Apple iPad 2 / 3rd Generation, HD, 1080P, WiFi, 4G LTE, AT &amp; T, Verizon", "price": 1.99, "imUrl": "http://ecx.images-amazon.com/images/I/41PXEAchGOL._SY300_.jpg", "brand": "BELKIN", "related": {"also_viewed": ["B005MKH1XC", "B004W697ES", "B005HM2L4O", "B00AN9LVAQ", "B00ANAHMVC", "B00FZM92UW", "B005HM49IU", "B007NFBJAK", "B007W0HLKS", "B0076POAOE", "B005HM0SNA", "B005740O28", "B00D0DDR7C", "B003IGNUL4", "B008DKCQUG", "B0077JAFJS", "B006ZN1CA8", "B007GO2OPW", "B006MVX5B2", "B0095PEF70", "B007GO31EU", "B006ZN1C8U", "B001KYU4BU", "B00C5MNCAG", "B00E77V7NG", "B00D856NOG", "B0050W632W", "B009N8WS5U", "B00FZM92Z2", "B00AAJDOYA", "B006ZN1C7Q", "B00867YG6I", "B0041HFUWG", "B00FZM93L0", "B00G4R4DGK", "B00BTGOZNW", "B00GBUJ0A4", "B0019TGO6U", "B006ZN1CBC", "B009DYGHB0", "B00B37ZI88", "B00DG6M9OA", "B006ZN1C6C", "B00EXL5HLE", "B009H864UQ", "B0049V8ZBM", "B000X4K292", "B00AP6RIEU", "B005NHTG6O", "B003GAJ67Y", "B00D0RF672", "B00E77V7JA", "B005X4ZBDE", "B00GSC6HDI", "B007C0YB1K", "B0043538VG", "B00GBUIXBQ", "B00E77V7M2"], "bought_together": ["B0053NBLFW"], "buy_after_viewing": ["B005MKH1XC", "B004W697ES", "B005HM2L4O", "B00D856NOG"]}}