{"asin": "B002HOPUPC", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "Define yourself in high definition.It&rsquo;s small enough to fit in a pocket, but why would you ever want to put it there? Whether out on the town or just hanging with friends, the Kodak Zi8 Pocket Video Camera captures every experience in stunning 1080p HD video. Stay in focus while you&rsquo;re on the move with integrated image stabilization. Then kick back and watch all the action on your HDTV or share your scene on YouTube with the built-in USB. The Zi8 pocket video camera has all you need to define yourself in high definition.Product FeaturesTake full HD 1080p videos wherever you goGet sharper videos and less blur thanks to built-in image stabilizationPremiere your videos in the palm of your hand with the vivid 2.5-inch color LCDNo cables to worry about&ndash;just swing out the USB arm to upload, share and chargeGet a new perspective&ndash;take amazing 5 MP 16:9 widescreen HD still picturesShare on Facebook and YouTube with ease&ndash;built-in software makes editing and uploading simpleCompatible with PC and MAC (Use with Apple iLife Suite of products) operating systemsCompatible with iTunes for syncing with Apple TV, iPhone and iPod DevicesPlenty of room for more&ndash;record up to 10 hours of HD video (Record ~20 min per 1 GB at 720p HD at 30 fps) with the expandable SD/SDHC Card slot that can hold up to 32 GBCapture your friends in their best light with smart face tracking technologySee more details and accurate colors in low lightMake audio awesome&ndash;the external microphone jack lets you record in stereoBe ready for the big screen right out of the box with complementary HDMI cableRecord from a distance or play back on your TV with ease with available remote controlGrab attention and define your style with the ultra-compact design, stunning looks, and a range of colorsWhat's in the Box:Kodak Zi8 Pocket Video CameraKLIC-7004 Li-Ion Rechargeable BatteryAdapter and cable for battery chargingHDMI and AV cablesWrist strapUser&rsquo;s GuideArcSoft MediaImpression Software for Kodak (on-camera)", "title": "Kodak Zi8 Pocket Video Camera - Black", "price": 17.12, "salesRank": {"Camera &amp; Photo": 1309}, "imUrl": "http://ecx.images-amazon.com/images/I/4184zEQgyqL._SY300_.jpg", "related": {"also_bought": ["B002YEUBEK", "B002FECHQ4", "B002HJ9PTO", "B00006HOLL", "B000SIFHZM", "B002YEWW6U", "B0055OPNQ2", "B007IWVTZ8", "B001S0PWWC", "B0045TFBBK", "B003VNKNF0", "B00487PGG4", "B002T3FEJI", "B001R6SRMO", "B007VI3S1M", "B00BV9ZQKS", "B002MGL25C", "B0052OYS5M", "B00006I523", "B003GRKXDS", "B002HZJ1T2", "B002MGT0UG", "B006L6ZU84", "B002DUCRXS", "B003PJNVWC", "B000MYPPPE", "B009YC78BY", "B0058MJX4O", "B002IVPUJA", "B00006JPD8", "B000BTAH62", "B0007N55K0", "B0007L8BQW", "B000ANGNN0", "B002DM6W2I", "1599184400", "B002GYPS3M", "1440511411", "B003Y31CAC", "B0040702HA", "B003VTZE4Y", "B0091TTW3M", "B002YLV5EI", "B003I7KRR8", "B000EVSLRO", "1933356057", "1599184516", "B00004UFRO", "B000BKOFLY", "B0016ARZ9C", "B003NWOU94", "1599185016", "B001C1PQO6", "006227306X", "1599181819", "B0055QBI5A", "B003VNKNEQ", "B006XY636W", "B004MKNJ84", "B0056B7FO2", "B0002EXF38", "B004TJ6JH6", "B004ZGN6MY", "B007V5J5QC", "B007R7EFOG", "B0030GZG4G", "B00861Z6L8", "B001E63B78"], "buy_after_viewing": ["B003VNKNF0", "B006L6ZU84", "B002HJ9PTO", "B003VTZE4Y"]}}