{"asin": "B001KWFBG0", "description": "Tokyo Under Siege. A Modern-Day Ninja for a 21st Century Enemy.A parasite has mysteriously appeared, unleashing a wave of destruction &ndash; mutating humans into vicious, savage creatures. The disease has reached the shores of Japan and into the heart of Tokyo. As modern-day ninja Ken Ogawa, swing, fly, and slice your way into extreme action to save humankind from obliteration.Overview:Step into the dark and mysterious world of Ninja Blade, where gamers will be given the epic task to defend Tokyo and ultimately humanity itself from a horrific, genetically mutating disease.High atop the towering skyscrapers of modern-day Tokyo, Ken Ogawa and his team of skilled ninjas are deployed to destroy the infected monster horde and stem the spreading disease as humanity hangs in the balance. Matters quickly take a turn for the worse as Ken and his team are betrayed from within their own ranks. After narrowly escaping death, Ken is left to fight the daunting battle alone while also attempting to understand the motivations behind his father&rsquo;s betrayal..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url('http://g-ecx.images-amazon.com/images/G/01/videogames/detail-page/callout-bg.png') repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px }Players:1 PlayerSave File Size:256 KBFormat:16:9 Widescreen on HDTV 720p/1080i/1080pAudio:In-Game Dolby DigitalCOMBAT BOSSES WITH SPECIAL ABILITIES.View larger.EXTREME ACTION.View larger.QUICK-TIME EVENTS.View larger.Armed with an extensive arsenal of specialized ninja weapons, tools and skills including the powerful forces of Ninja Vision and todom&eacute;, players must fight insurmountable odds, and once again bring peace and order to Tokyo.Features:Unique Ninja abilities:To help defeat the genetically mutated monsters, players will have the special abilities of Ninja Vision and Todom&eacute; at their fingertips. Enabling &ldquo;Ninja Vision&rdquo; will allow players to detect and analyze potential enemy weak points, secret paths, and hidden information within the environment. Beware though, while using &ldquo;Ninja Vision,&rdquo; characters become susceptible to excess damage. Todom&eacute; is a special attack that destroys an enemy character&rsquo;s core (heart), by dealing a fatal wound. Balanced and calculated use of both these abilities will be critical to progressing through the game.Variety of weapons, tools and Ninjutsu:Specialized Ninja powers offer an enticing array of options. Varied environments force players to think strategically about which set of weapons and tools will be most effective at conquering their way through different levels. Everything from dual wielding swords, to grapple wire hooks, to grenades each have distinctive features and characteristics, so choose wisely! Ninjutsu is a special power that results in an explosive electrical force to either stun enemies or protect oneself from attack. Only true Ninja Masters can achieve this technique.Interactive quick-time events:Scattered throughout integral parts of the storyline, characters will come across various quick-time events where players will have the opportunity to directly interact with in-game cut-scenes. Quick reflexes will be rewarded as players interact with controller buttons as directed on screen during intense battles.Modern Realism:Ninja Blade offers a fresh twist to the classic ninja saga by basing all 3D gaming maps directly from the actual skyscrapers and building tops in modern day Tokyo.", "price": 39.99, "imUrl": "http://ecx.images-amazon.com/images/I/51lgTMptEUL._SY300_.jpg", "related": {"also_bought": ["B000ZK696O", "B005DVAB1Y", "B0058VI0SU", "B003O6E7AG", "B0016NUZFU", "B004EW7LSY", "B001E7MMNQ", "B000KLNLV4", "B000P8WOMO", "B000NNFJQY", "B001BC948U", "B007UMD1EI", "B004L9WGDA", "B000B6ML1Y", "B0014G98WA", "B001UWGDC6", "B002GPPPS4", "B004ML7WOK", "B003O6HGHM", "B000HCQK0A", "B003H0CC2O", "B00319DX4W", "B0050SY9WC", "B000FLZEXM", "B000R0SS3Y", "B003WY86NE", "B000XJO78Y", "B001D25M1Q", "B002W5GI9I", "B004A88W8K", "B0023CBY4E", "B001YI0Z2U", "B005VBVQAG", "B0030GBU32", "B004LWEKCM", "B00KWFY04A", "B003P9C6QY", "B00432O4VM", "B00KVLZ00I", "B0043B5SLI", "B00BFU8IBC", "B00KWEHBAG", "B000XJS00K", "B000C427NM", "B000H94PVO", "B0056WJA30", "B003O6G47U", "B000QW9D14", "B000ICV996", "B002DC8GEK", "B00KVR4HEC", "B00C3MK9BS", "B003O6E9EK", "B003GSZ9ZE", "B002I0H79C", "B0016NRS28", "B003NSECW8", "B007IFMFYE", "B001PKHRVE", "B0050SY4DG", "B007UM59AC", "B003BE6OZC", "B002BRZ8FW", "B003S2MXRA", "B000ZK9QFK", "B005TH6BD4", "B001NX4DUQ", "B002I0JA7E", "B008XMSRKC", "B0054INKZK", "B003FBL85W", "B005J5K9EI", "B00BAWXDJM", "B000WQWPOQ", "B003ZFVD6W", "B000R0SR9E", "B00354NAYG", "B000ZJVDA2", "B0042VX73U", "B002C0VNVG", "B0028A6V7Q", "B000GPVUOY", "B003E6VK5Q", "B00KSQHX1K", "B00L3LQ1FI", "B0029MAXR2", "B001ASJISG", "B0010AYJXI", "B0093FMS3U", "B004MXQ3DY", "B000P297E8", "B004FUL9YW", "B0076ZPYPI", "B00163LW7A", "B004VMXAWS", "B000SH3XD6", "B0022TNO7S", "B000B6ML0U", "B0014ULQB2", "B003PHLTDC"], "bought_together": ["B005DVAB1Y", "B000ZK696O"], "buy_after_viewing": ["B005DVAB1Y", "B000ZK696O", "B000NNFJQY", "B0058VI0SU"]}, "salesRank": {"Video Games": 10240}, "categories": [["Video Games", "Xbox 360", "Games"]]}