{"asin": "B000SDLNKA", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]], "description": "The Studiophile AV 30 compact powered speakers make it easy to enjoy full, rich sound even when space is limited. They're designed with the same critically acclaimed technology that has made M-Audio monitors popular in recording studios around the world. The Studiophile AV 30 speakers deliver clear, crisp highs and deep lows, along with superior clarity and imaging. Designed for the traveling musician or multimedia enthusiast, the Studiophile AV 30 system is the perfect audio upgrade for desktop production systems, portable video games, personal DVD players and more.Compact powered speakers that provide full, rich sound even when space is limited.Click to enlarge.Rear RCA inputs (along with a convenient front mini jack).Bass boost for enhanced low-frequency response.Top-Notch Sound--Anywhere, AnytimeThe Studiophile AV 30 speakers feature the same core technology used in all of M-Audio's acclaimed professional monitors. Designed for a variety of mobile and desktop applications where space is at a premium, the speakers include audiophile-grade amplifier architecture as well as RCA and 1/8-inch mini inputs, making them compatible with practically all professional and consumer audio products. In addition, dedicated 3/4-inch ferrofluid-cooled tweeters and 3-inch composite woofers work with built-in crossovers to ensure optimal fidelity.Extended Low EndThe Studiophile AV 30 speakers allow you to get the most out of today's urban/dance music, movies, and video games. Unlike the \"acoustically challenged\" plastic found in many speakers in this price range, the Studiophile AV 30s feature dense wood cabinets, bass reflex design and an integrated bass boost switch to deliver tight, accurate low-frequency response.Magnetically Shielded for Audio/Video ProductionThe Studiophile AV 30 speakers are magnetically shielded and designed to coexist with all manner of electronic equipment without interference, making them perfectly suited for video editing and multimedia work.OptImage III TechnologyM-Audio's proprietary OptImage III wave guide improves overall detail and clarity while minimizing sound issues that can plague other compact speakers. The system works by improving the overall efficiency of the tweeter as well as time-aligning the drivers. This ensures that the sound from each driver reaches the listener at the same time, guaranteeing precise stereo imaging and accurate response.What's in the BoxTwo Studiophile AV 30 Speakers, 1/8-Inch Stereo Mini-to-RCA Audio Cable, Power Cable, 1/8-Inch Stereo to 1/8-Inch Stereo Audio Cable, Tinned Bare Wire Audio Cable for Right Speaker, Acoustic/Traction Pads, Owner's Manual", "title": "M-Audio Studiophile AV30 Professional Reference Speakers", "price": 79.99, "salesRank": {"Musical Instruments": 24688}, "imUrl": "http://ecx.images-amazon.com/images/I/41%2Bdvybr1xL._SX300_.jpg", "related": {"also_bought": ["B0041OSWUG", "B0002CZW0Y", "B000068O17", "B0002Z82XA", "B0002GIRP2", "B000978D58", "B001AYONXU", "0240815807", "B002PAZZ9E"], "buy_after_viewing": ["B0051WAM64", "B0051WAM1O", "B0027VT6V4", "B0049P6OTI"]}}