{"asin": "B002DOO1VA", "related": {"also_bought": ["B006GTKSHY", "B00K7P74GQ", "B0029ERWH4", "B005UL1B34", "B00K7PMA60", "B001C6H6F8", "B003DVNKU0", "B008FX7B9M", "B005UKRRKG", "B00GIEKIVS", "B003K16T1K", "B004M7WKKK", "B00HKA110G", "B008GOR6O0", "B0072CSNSU", "B0061KQF2K", "B002TPQPEE", "B0061KQEVW", "B00DA4CW22", "B004X1QY20", "B0092SVTGA", "B004HSO124", "B003K16T06", "B005UKOXMG", "B00K8RMV0M", "B00HF6SJVY", "B00IOWYHJ6", "B00KVBZAXK", "B006Z5K3FG", "B002QFGKUQ", "B008LC4IU2", "B009VXY05S", "B004DGKTEO", "B006HCJXBM", "B00H1SW3RC", "B00GP3ZUAQ", "B008FX4LO0", "B00FORO1P4", "B00IKBGQAE", "B00B4BNYKM", "B003K16SYI", "B00B58DLY8", "B003EBNLIA", "B00D3KUJO6", "B00BMW24TU", "B00GR4TPW2", "B00GZIHP3G", "B00373HS7K", "B00H83298S", "B007OX0RBS", "B00D3KR1P6", "B003ZS8MDQ", "B00IIFVJZ4", "B0009QZZ4Q", "B00ID5PRQQ", "B00EOFEKF8", "B007GMJ8Z8", "B00D3L2Y5C", "B002ON11RW", "B00KR26VFE", "B00HWR1OZ4", "B00HJ7TNPA", "B005UL3LVY", "B004BCT860", "B00FORNVGO", "B00IHQQGKM", "B00E7LQHZ0", "B0068Y0EXK", "B00942W51C", "B0034KYDPG", "B006R1FKJ2", "B00ITQCL4U", "B00KBKRX2C", "B00FORNYMU", "B00K67AQN8", "B008B2Z94Q", "B002CMYX16", "B00KW3CDMI", "B00D3KXYS4", "B002XGWPHK", "B002QANC2A", "B00LX4QHT0", "B00D3KXNNU", "B00F64LT1O", "B005X2F7KI", "B00IUCVSA6", "B004TSFE6Y", "B00IMW3ITI", "B00CVDTMI0", "B003K16T4M", "B00EU897AM", "B00EL1HZ34", "B004GNMP0U", "B000MIR7TM", "B009Q1YPVY", "B00373DIYM", "B00J3IFAA0", "B004TSFE28", "B00HUAO7ZM", "B00GOVKPWC"], "also_viewed": ["B0067F8BBM", "B00EYZR3E8", "B00H1SW3RC", "B0061JQY40", "B006YFRE90", "B0061YSLKA", "B00BMARRIA", "B00B8P5CTA", "B0062W4J8Y", "B005IHSO2Q", "B0095BGU6I", "B00FVGS3W0", "B005IHS8KY", "B00KN04CD8", "B00J921XM4", "B0064X6DC6", "B001HKR6WM", "B00H2QJ1Z0", "B0062W4J6Q", "B0088AR2IM", "B00KWSCOZO", "B00GJXGMT0", "B00JQV5P1S", "B008148R8E", "B00ELAA8NY", "B00JFLRCOW", "B00BWB3YTA", "B00KXOLTD0", "B00J00OP5W", "B00IZZ7RTO", "B0029ERWH4", "B00J9KN1I0", "B00CXDVRU4", "B00C3TPXE4", "B00CMZ4JTE", "B00H2YL8W6", "B003G0UO48", "B00BJOXW9M", "B00C7WPEMI", "B0032DHP6O", "B00L0R8KK4", "B006GTKSHY", "B00GJ4X3MI", "B00IEUCFGA", "B00CEAB0DA", "B00HWR1OZ4", "B00K8TSM1M", "B0047SCT8W", "B00HHP7UH2", "B005IHSBJM", "B00I46E8DC", "B0092LDWVW", "B00JL7AQES", "B00EJMLM66", "B00K7P74GQ", "B00BK5XNKS", "B00LY4V0NM"], "bought_together": ["B006GTKSHY"]}, "title": "SHANY Studio Quality Natural Cosmetic Brush Set with Leather Pouch, 24 Count", "price": 26.99, "salesRank": {"Beauty": 937}, "imUrl": "http://ecx.images-amazon.com/images/I/51B18YD6cdL._SY300_.jpg", "brand": "SHANY Cosmetics", "categories": [["Beauty", "Tools & Accessories", "Bags & Cases", "Cosmetic Bags"]], "description": "The SHANY Studio-Quality Natural Cosmetic Brush Set with Leather Pouch (Set of 24 Brushes, Goat and Badger Hair) provides professional-grade tools for all of your makeup applications. Made from natural animal hair, this set includes 24 soft, durable brushes ranging from large fan to small angled styles. The brushes apply makeup evenly and are easy to clean. For easy storage and portability, the brushes come packaged in a handy black organizer.Studio-Quality Natural Cosmetic Brush Set with Leather PouchAt a Glance:Complete set of 24 brushes for all cosmetics application needsNatural animal hair is soft, durable, and does not hold colorEasy to clean and dryConvenient storage pouch with soft lining for easy organization and travelSizes range from large fan to small angled stylesHandmade from natural goat and badger hair for smooth application.View larger.Complete Set of 24 Professional-Grade BrushesThis brush set offers you a professional makeup artist's tool kit for use at home. With a complete range of sizes and styles, you'll be able to find the right brush for the job. The set includes essential shadow, foundation, and powder brushes in multiple sizes, as well as liner, concealer, smudge brushes, and a dual eyebrow brush/lash comb.For added convenience, the most often-used brushes are duplicated so you can dedicate one set to pale pastels or neutrals and the second set to dark, vivid hues. And all of the brushes feature a long, easy-to-grip handle for precision during application.Handmade from Animal Hair for a Soft, Silky FeelThe cosmetics brushes are made from natural goat and badger hair, so they are soft and silky on top, yet firm and durable on the bottom. The brushes allow you to apply colors smoothly, while pigment does not cling to the hairs after application, so you can blend and reuse colors without cleaning every time.Handmade with care, each brush in the set is engraved with the SHANY logo.Easy to Clean and DryYou do not need to clean these brushes frequently, but when you do wash, it's easy--simply run the brushes under warm water, clean them with your favorite shampoo, and rinse thoroughly. You can let your brushes air dry or use a hair dryer for quicker results. Brushes should be cleaned once before first use.Convenient Storage Pouch for Organization and TravelFor easy organization, the brushes are packaged in a black folding pouch that you can easily toss into your gym bag or suitcase. Extendable trays in the pouch offer additional storage space for extra items, like your favorite jar ofSHANY Mineral Eye Sparkle Eye shadow (Set of 40 Jars)(sold separately). The soft interior lining provides padding to keep the brushes safe during travel.Each individual brush arrives packaged in a clear plastic wrap to protect it from dirt and dust.About SHANY: Sleek. Sexy. Breathtaking.With a commitment to high quality, SHANY creates a variety of makeup kits, cases, and accessories. Offering easy accessibility to professional-quality makeup and accessories for at-home users, SHANY assembles and hand-selects every item in their assortment of makeup collections. All shadows are formulated with a natural mineral oil base and packaged in recyclable plastic. SHANY is a proud member of People for the Ethical Treatment of Animals (PETA), and does not test any makeup on animals. No animals are harmed to create these natural brushes.What's in the BoxOne SHANY Studio-Quality Natural Cosmetic Brush Set with Leather Pouch (Set of 24 Brushes, Goat and Badger Hair).Cosmetic Brush SetsStudio-QualityNatural CosmeticBrush SetEco-NaturalCosmetic Brush SetProfessionalCosmetic Brush Set&#xA0;"}