{"asin": "B000A4AVQO", "description": "Amazon.com Product Description All your videos, photos, and music on the big screen. Sound like a good idea? The folks at D-Link have made it easy with the DSM-520 MediaLounge Wireless HD Media Player. And when it comes to video, this device kicks it up a serious notch by supporting HD video streamsGood looks on the outside, and the power to deliver all your media -- including HD video -- from your computer to your home entertainment system.See a detailed view.The DSM-520 is ready to handle most major media formats.-- delivered directly from your computer to your home entertainment system. Enjoy all your digital content from the comfort of the living room with the DSM-520 -- and do it all wirelessly, as the device supports high-speed 802.11g wireless technology. Of course, you can also use a wired ethernet connection if you like.Formats GaloreThanks to the DSM-520's support for a wide range of media formats, it's ready to handle virtually all of your media, including high-definition video in either Windows Media Video 9 or MPEG-4 format. Enjoy videos with resolutions of up to 1080i from your high-definition television for the best picture quality. Plus, D-Link has partnered with premium online service providers to offer access to a vast array of online radio stations and music download services. You can use the Windows Media Connect feature of Window XP SP2 to playback files protected by Windows Media Digital Rights Management (WMDRM) on the DSM-520. Or, access your entire library of premium downloaded songs and videos directly from the device.The DSM-520 integrates seamlessly into your home network and entertainment system.View larger.Picture PerfectFor compatible television systems, the DSM-520 features a High-Definition Multimedia Interface (HDMI) connection. HDMI offers a pure digital connection for both audio and video. Other video connectors include component, S-video, and composite output, ensuring compatibility with virtually all televisions. Meanwhile, optical and coax audio connectors provide clear digital output and support surround sound when used with a compatible A/V receiver. Enjoy your entire music library in high fidelity from your home entertainment system, rather than from your PC speakers.Good Looks and ExpandabilityA sleek 17-inch black aluminum chassis with smoked mirror front panel houses the DSM-520, and the stylish unit blends in perfectly with your other home entertainment devices, making your home theater setup complete. Plus, the DSM-520 includes a USB 2.0 port in the front panel for instant access to music, photos, and videos stored on removable USB flash drives or hard drives. Simply insert a USB drive filled with photos into the DSM-520 to showcase them on your home entertainment center. You can also attach a USB hard drive to expand the storage capabilities of the DSM-520. Your stored files on the USB drive can be easily accessed from the unit's user-friendly interface.Easy SetupA built-in Setup Wizard makes setting up the DSM-520 simple. Configuring the wireless settings is made even easier with Windows Connect Now. Simply run the Wireless Network Setup Wizard from Windows XP SP2, and transfer the wireless settings to the DSM-520 using a USB flash drive.What's in the BoxDSM-520 Wireless HD Media Player, remote control (2 AAA batteries included), ethernet cable, A/V composite cable, S-video cable, detachable Antenna, CD-ROM with software and manual, and quick installation guide.", "title": "D-Link  Wireless HD Media Player", "price": 149.99, "imUrl": "http://ecx.images-amazon.com/images/I/31%2BLLJRxHkL._SX300_.jpg", "related": {"also_viewed": ["B00882OHL0", "B0001WXTF0", "B008NO9RRM", "B00JXFM75Y", "B0042RA8C2", "B0042SDDXM", "B00EYO241Q", "B008CBQSKU", "B008YDUTRO", "B00A9FYL2Y", "B0092T3E3A", "B005KOZNBW", "B00GY0UB6I", "B00GGVPKKC", "B00CH643A8"], "buy_after_viewing": ["B005KOZNBW"]}, "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Network Transceivers"]]}