{"asin": "B000EJVWGS", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The Fujifilm FinePix F30 6.3MP Digital Camera is a revolution in point-and-shoot digital cameras for consumers. With full-resolution ISO equivalency speeds as high as 3200 -- a setting previously reserved for advanced consumer and professional digital camera models -- the F30 takes crystal clear photographs where other cameras would deliver blurry images. Higher light sensitivities allow this camera to shoot with faster shutter speeds, which lessens the likelihood of blurry pictures caused by ever-active children, fidgety pets, dim ambient light, or an unsteady camera hand.A 3x optical zoom lens brings you closer to your subjects when you want to catch important details. Take acloser lookat the FinePix F30's functions.Sized to slip into a pocket or purse, the F30 might be diminutive, but the extra-large 6.3 megapixel resolution is more than enough for high-quality standard 4x6-inch prints. However, if you'd like to make larger prints, or alter an image with photo editing software, the extra-resolution is a valuable asset. An extra-large, 2.5-inch (230,000 pixel) LCD monitor fills the back of the camera. With convenient features like Auto Brightness and an anti-glare, low reflection CV (Clear View) film, the monitor provides comfortable composition and viewing of photos whether in dim interiors or under bright sunlight. The responsive FinePix F30 is ready when you are, with a super-fast start-up time (1.4 seconds), a shooting interval of 1.5 seconds, and a shutter release time lag of a minimum of 0.01 seconds.The class-leading performance of FinePix F30 is due in large part to the second generation of Real Photo Technology. This Fujifilm photographic achievement is a combination of Fujifilm's Super CCD sensor, its proprietary RP Processor, and a world-class lens from Fujinon. The camera's 3.0x optical zoom lens has a focal range equivalent to 36-108mm on a 35mm camera. Combined with a 6.2x digital zoom, this camera offers a 18.6x total zoom range that brings you closer to your subjects than ever before. Fujinon, Fujifilm sister company, produces these high-quality optics that are used by broadcasters, astronomers, scientists, the military and others to bring their subjects closer with crisp, clear image quality.Fujifilm has also added a helpful \"Picture Stabilization\" mode dial setting to the F30. This easy-to-identify, automatic setting lets the camera choose the correct light sensitivity -- ISO equivalents up to 3200 -- and best matching shutter speed for the highest quality digital pictures.In the past, high ISO equivalencies such as 3200 (or even 1600 and 800), had been off-limits to compact consumer digital cameras, but not any more. In addition to Picture Stabilization, the F30 combats the high-ISO, low-picture-clarity problem with the sixth-generation Super CCD sensor that produces less noise than its predecessor, and an RP Processor II that is finely tuned to remove even more noise. The end result is the FinePix F30: a camera that produces sharp pictures, full of rich color with dramatically less image noise, even in the lowest of lights.A 2.5-inch LCD display makes it easy to frame great shots.Another innovation of the FinePix F30 that works in tandem with Real Photo Technology and higher ISOs is the Fujifilm flash system called i-Flash. More advanced than similar flash systems, the i-Flash can accurately detect the subtle lighting differences within a scene, and then light the subject accordingly with a wider range of flash intensities. This is accomplished with an adjustment to the flash's intensity based on a variety of factors, such as subject position in the frame, subject size, ambient light, and backlight intensity. So, even if the subject is off center and standing under a street light, the i-Flash system will expose the subject properly.i-Flash is a tremendous asset to any photographer, particularly when shooting in low-light -- subjects look more natural in front of backgrounds full of bright and clear detail. However, the i-Flash difference is most apparent in portraits, delivering realistic facial tones without the washed-out look so often associated with flash photography. Basically, this smart flash control system recognizes conditions, and determines the optimum flash output to give you superb results.Ever run out of digital storage just at the wrong moment? Not with the F30. With 10 MB of built-in storage you'll never have to miss that special shot. Think of it as your internal insurance policy for those great, not-to-be missed photo opportunities. Amazingly easy to operate, all you have to do is switch-on the FinePix F30, and you'll be ready to shoot. Controls have been arranged for easy, fingertip operation giving you quick access to all the camera's great exposure modes and scenes. The full range of exposure modes includes auto, aperture-priority AE, shutter priority AE, manual, movie, picture stabilization, and scene position modes; plus, a generous selection of 15 preset scene positions that include underwater, sunset, snow, fireworks, party, museum and more. Whatever the situation, the FinePix F30 makes it a snap to get great results.Additional features include super macro mode; 30 fps movie recording with monaural sound for capturing quick, digital video snippits; a FinePix Photo button for one-touch access to frequently used settings (image size, ISO sensitivity, and FinePix color mode); continuous shooting mode; a USB interface for PC connectivity; a video output for your TV monitor (NTSC/PAL) to display photographs on your television; FinePix Viewer software; PictBridge compatibility; and an xD-Picture card compatible slot. The FinePix F30 is powered by an included NP-95 rechargeable battery and can take approximately 500 pictures on a single battery charge.What's in the BoxFujifilm FinePix F30 digital camera, NP-95 rechargeable battery, AC-5VC AC power adapter, hand strap, USB cable, A/V cable, and FinePix Viewer CD-ROM.", "title": "Fujifilm FinePix F30 6.3 MP Digital Camera with 3x Optical Zoom", "price": 299.0, "salesRank": {"Camera &amp; Photo": 11416}, "imUrl": "http://ecx.images-amazon.com/images/I/41NQ5rpMnfL._SX300_.jpg", "related": {"also_viewed": ["B000EMWBV0", "B0007Y791C", "B000GHVZQ0", "B000I1ZWRW", "B0009GZSSO", "B00009VT1T", "B000V5P90K", "B000HGMX5M", "B000AYJDD6", "B00B46XSDK", "B0009GZAGO", "B00B46XSC6", "B0002XQI2E", "B00EFILPHA", "B00HQ4W3OE", "B00ATM1MHO", "B00889ST2G", "B001R23JMQ", "B005KBB79C", "B000Q3043Y", "B0007QKN22", "B000AYKUUQ", "B0073HSH08", "B00ATM1NAU", "B00728ZBA2", "B00ATM1MGA", "B003WJR69E", "B002O1AH5Q", "B00B46XRN6", "B00AV3XH9W", "B009B0MZ1M", "B005IGVXJS", "B008MB719C", "B00728ZBC0", "B0043RS864", "B006YP41I2", "B00DM8R866", "B00BEHQKPW", "B00B7N9CWG", "B004J41T7Q", "B00EFILR6E", "B00ATM1MVU", "B0073HSIY8", "B0090SLE30", "B000NK3H4S", "B00C6XQXT6", "B00BOZCSQE", "B00FP1HOB2", "B006T7QRN2", "B00EFILHB4"], "buy_after_viewing": ["B00728ZBA2", "B003VNKNF0", "B002O1AH5Q", "B003VNKNEQ"]}}