{"asin": "B0011ZK6PC", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Camera Bundles"]], "description": "Color communicates. It introduces you before you say a word, making the Canon PowerShot SD1100 IS Digital Elph the ultimate image-maker. Five fashion-forward hues expressed in pure aluminum add a new burst of excitement to Canon&#x92;s Perpetual Curve design. Of course, a camera that brings out the best in you also delivers Canon&#x92;s most advanced technology features. Call it style with substance, for a new level of picture taking pleasure.PowerShot SD1100 IS Digital Elph Highlights8.0-megapixel Digital Elph with 3x optical zoom and optical image stabilizerWith 8.0-megapixel technology at its heart, the PowerShot SD1100 IS Digital Elph brings you high-resolution images that maintain their sharpness and vivid impact even when they&#x92;re enlarged and cropped. The 3x optical zoom is a clear winner when it comes to getting up close and personal. And Canon&#x92;s invaluable Optical Image Stabilizer reduces the blur of camera movement, even in tricky, low-light situations.With Canon's Face Detection WB (right), skin tones are not affected by overall lightingEnhanced Canon Face Detection TechnologyCanon's powerful Face Detection Technology delivers even better results with the new SD1100 IS Digital Elph. The Face Detection Technology continues to recognize faces in a scene, and concentrate exposure (daylight or flash) and focus upon them. But the SD1100 IS Digital Elph adds more: Face Detection WB means the camera concentrates upon faces when calculating white balance for the best possible skin tones. Face Select and Track lets the SD1100 IS Digital Elph user highlight one face among several in a scene, and the camera concentrates on that person, even as they move around the scene. Face Detection Technology is a powerful contributing factor in Canon's new Motion Detection Technology.Motion Detection Technology automatically reduces blurLife doesn&#x92;t stand still for picture-taking. That&#x92;s why Canon included its advanced Motion Detection Technology in the PowerShot SD1100 IS Digital Elph. This sophisticated feature works in the background to instantly evaluate how fast your subject is moving. Then it automatically selects and sets the optimal exposure and ISO settings to keep everything looking sharp and clear.Automatic exposure and ISO settings help to reduce blur when your subjects are in motionWhen you need higher ISOs for action-stopping shutter speeds, Motion Detection Technology provides it. But when no movement is detected, it allows lower ISOs for excellent color and detail. So whether you&#x92;re shooting a bride walking down the aisle, a ballet recital or even a child&#x92;s soccer game, you can relax and shoot with confidence knowing you&#x92;ve got the picture you intended.Selectable Shooting modesWith 18 Shooting Modes including 9 Special Scene Modes, you&#x92;re ready for whatever shot comes your way.2.5-inch PureColor LCD II for bright, accurate colorThe PowerShot SD1100 IS Digital Elph gives you large 2.5-inch LCD screen for excellent control when framing your shots. Canon&#x92;s PureColor LCD II offers more spectacular color, resolution and contrast even when viewed at an angle (compared to PureColor LCD). The screen is highly durable and easy to see in any light with a scratch-resistant, anti-reflective coating. It also features Night Display for easy viewing in low light -- a perfect feature for gathering friends and family around to see your images.DIGIC III Image Processor for sharper images and improved functionalityWith DIGIC III, your images boast superior quality, the camera operates at top efficiency and battery life is enhanced. What&#x92;s more, DIGIC III enables Canon&#x92;s Face Detection Technology and Red-eye Correction to give you better, more true-to-life people shots. Simply press the Shutter Button halfway down, and the camera automatically pinpoints the faces in the scene and chooses the ideal focus point. The camera controls exposure settings and flash to keep every face looking bright and natural. Red-eye Correction can be handled in-camera, in two ways. The entirely new Red-eye Correction during shooting uses the Face Detection Technology to recognize and remove red-eye from flash images as they're taken, before the file is written to the memory card. It's also possible to correct red-eye during image playback, using simple settings in the SD1100 IS Digital Elph's menu.iSAPS Technologyis an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the fast DIGIC III Image Processor to improve focus speed and accuracy, as well as exposure and white balance.Red-eye correctionRed-eye Correction provides three options for removing red-eye from subjects in flash pictures.The new Red-eye Correction during shooting actually identifies and corrects red-eye in human subjects as pictures are taken.The SD1100 IS Digital Elph can be set to automatically detect and correct red-eye during image playback.The user can manually locate any red eyes in a scene during image playback on the LCD screen, and command the camera to remove them.High ISOThe PowerShot SD1100 IS Digital Elph features ISO 1600 and High ISO Auto settings that reduce the effects of camera shake and sharpen subjects in low-light situations, giving you greater shooting flexibility.The Complete Print SolutionThe PowerShot SD1100 features a Print/Share button for easy direct printing and downloading, plus ID Photo Print and Movie Print with select Pixma photo printers and Selphy compact photo printers.The PowerShot SD1100 IS Digital Elph's Print/Share button makes direct printing easier than ever. Simply connect the SD1100 IS Digital Elph to a Canon Pixma photo printer or Selphy compact photo printer or any PictBridge compatible photo printer, press the lighted Print/Share button and print! Also use the Print/Share button to transfer images to a computer (Windows and Macintosh).Print your own ID photos in 28 different sizes or use the Movie Print function to output multiple stills from a recorded movie on a single sheet with a Canon Selphy compact photo printer.", "title": "Canon PowerShot SD1100IS 8MP Digital Camera with 3x Optical Image Stabilized Zoom (Blue)", "price": 129.0, "salesRank": {"Camera &amp; Photo": 4754}, "imUrl": "http://ecx.images-amazon.com/images/I/41Je5B0XHZL._SX300_.jpg", "related": {"also_viewed": ["B001SER492", "B001SER49C", "B001SER49M", "B001SER48S", "B001SER4A6", "B00I58M192", "B001C20816", "B0035FZJKI", "B0075SUII4", "B0035FZJL2", "B000AYGDIO", "B0075SUHGC", "B0035FZJKS", "B000NK8EWI", "B0035FZJLC", "B004HW73SO", "B0075SUIEI", "B004HW73S4", "B0035FZJJO", "B004HW73QQ", "B00B5HE3IW", "B004HW73QG", "B001SER47O", "B001SER47Y", "B004J3V7RO", "B0075SUHA8", "B00B5HE3NW", "B0035FZJLM", "B004J3Y9ME", "B000NK6J6Q", "B001EQ4C4E", "B0035FZJJ4", "B003F3ZFVS", "B000Q30420", "B006UMM15O", "B000EN0K94", "B000NK8L6W", "B000EMU888", "B000EMWBT2", "B00AWYN0BU", "B00B5HE3AK", "B00I58LVKC", "B0075T7NW2", "B0032JRRXE", "B0075SUH5S", "B004J3V8UU", "B00B5HE32I", "B00AWYN182", "B001SER48I"], "buy_after_viewing": ["B001C20816", "B003VNKNEQ", "B003F3ZFVS", "B003VNKNF0"]}}