{"asin": "B00000JBLH", "categories": [["Office Products", "Office Electronics", "Calculators", "Scientific"]], "description": "If you bought yourself a financial calculator during the 1980s, chances are it was this bad boy. Nothing has changed since its introduction--it still uses Reverse Polish Notation (RPN), is easy and versatile in programming, and has a thin, sturdy casing. Certainly, there's been newer, fancier calculators introduced since, but there's something to be said for the quality of classics.The HP 12C's functions include all the basics--such as calculating APR, NPV, and IRR--and statistics are a snap. For students new to financial calculators, this is an excellent place to start. For the most part, the manual reads like a minitextbook, walking you through sample problems and situations followed by graphs and tables demonstrating the technique--and you can even check your results. The section on creating programs does seem to be written for the technically ignorant, addressing in detail how you could possibly benefit from using programs, but it'll still help you get the job done.In general, it's a bit slower than newer models, just like last year's computer isn't as speedy as today's new release. On the plus side, it's just 3 by 5 inches and slips easily into a pocket. The bottom is printed with a few little cheat notes for common functions, which is nice for quick reference. The HP 12C's one-year warranty and available tech-support line offer reassurance this little workhorse will continue to be an industry standard for years to come.--Jill LightnerPros:Pocket sizeThorough and simple instruction manualCompetitive priceCons:Calculates more slowly than modern machinesWhat's in the BoxCalculator, user's manual, installed batteries and carrying case", "title": "HP 12C Financial Calculator", "price": 51.94, "imUrl": "http://ecx.images-amazon.com/images/I/415w5D26yVL._SX300_.jpg", "brand": "HP", "related": {"also_bought": ["B00HOKKBN0", "1598441280", "1572226226", "0136065805", "0132744376", "1423208595", "142773819X", "B000FVNX2Q", "0132992477", "0324305486", "1881071057", "0073368695", "B0002ABA8E", "1423216318", "B0000CAQ0C", "1111972206", "0078034647", "1423218175", "B0017T6S1I", "B008I638AM", "B000F78JYC", "B000MK4RAM", "B00AMEZDK6", "B00000JZKB", "B001PLII3E", "B0001EMLZW", "B000PU1LIU", "B002GHBUTK", "B00ANALFDI", "0451205367", "B000MK2PZ6", "B000GAUUWW", "B0006HWRK8", "B0013DQY4O", "B00D48ZK3W"], "also_viewed": ["B000FVNX2Q", "B0002ABA8E", "B00000JZKB", "B005EIHAZG", "B00009WNV9", "B0028271E6", "B00443J4EC", "B0000YVENS", "B0000CAQ0C", "B00005ATSO", "B005EIG3MW", "B0001EMLZW", "B0037YOMWS", "B00HOKKBN0", "B00000JBLB", "B00000JBLK", "1598441280", "B0009OMTPG", "B00000JBLQ", "B001BCRRX4", "B0070B4ULW", "B000TDRHG8", "1572226226", "B005TLBW0M", "B009279PGM", "B000IHTEES", "1423208595", "B009H956M2", "B009H955ZU", "B00272C1MY", "B005IUJ2EC", "B00DJGPXBI", "B002NWIAYQ", "B001D4XAMM", "B0009FHR4I", "B0002S9KGA", "B004E2INY0", "B00000JBMH", "B000GTPRPS", "B005KU3ZFC", "B00CMWCT26", "B0021FU2O6", "B00K5JTZBQ", "1936362848", "B000669496", "B001UHYXA0", "B0033UPU2W", "B000VJ0CDU", "B004J6GSXE", "B0006YZQOA", "B001BUM0RO", "B0006YZQQ8", "1937404072", "B00000JBNX", "B0000DK6G9"]}}