{"asin": "B0007Z1M50", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Mice"]], "description": "Tuned for the way you playThe Logitech MX 518 optical gaming mouse gives gamers a precision advantage. Its 1800 dpi optical engine delivers pinpoint accuracy for precise targeting and high-speed handling. A sculpted comfort grip helps reduce strain, and slick polytetrafluoroethylene (PTFE) feet glide smoothly across almost any surface, with no skips. This durable fit and finish allows for longer, harder play. In-game sensitivity switching lets you easily control cursor speed and responsiveness without ever having to interrupt your game. Advanced software allows you to easily customize your mouse to every game you play, and eight programmable buttons provide added control and efficiency.Get the gear to suit your gameplay. Play with the best.Key FeaturesCustomizable buttons and controlsInstant, one-click changes to dpi - from 400 to as high as 1600Slick gaming feet reduce friction and noiseContoured grip designed for comfortLogitech MX performance optical engineSuggested games for the Logitech MX 518 Gaming Mouse:World of Warcraft: Wrath of the Lich KingStarcraft II: Wings of LibertyWarhammer Online: Age of ReckoningAge of Conan: Hyborian AdventuresThe Lord of the Rings Online: Mines of MoriaLeft 4 DeadCall of Duty: World at WarCrysis WarheadFallout 3Brothers in Arms: Hell's HighwayCommand and Conquer: Red Alert 3Check out the G-SERIES&nbsp;&nbsp;from Logitech:", "title": "Logitech MX 518 High Performance Optical Gaming Mouse (Metal)", "price": 124.98, "imUrl": "http://ecx.images-amazon.com/images/I/41BQVE1SXZL._SY300_.jpg", "brand": "Logitech", "related": {"also_bought": ["B000V7ARAU", "B000UEZ36W", "B0055QZ216", "B00BCEK2LA", "B000UVRU6G", "B002NIGDX0", "B00CJD4HD2", "B002J9GDXI", "B000OOYECC", "B009C98NPY", "B000H6AY6M", "B000LVJ9W8", "B00C2DLRV4", "B002ZV51DI", "B003ZG9T62", "B00CXI1EI4", "B00C2RPW8O", "B002B3YCQM", "B000A6PPOK", "B008PFDUW2", "B00DHW4HS4", "B005JN9310", "B000CMS0XU", "B008PFABI8"], "bought_together": ["B000UEZ36W"], "buy_after_viewing": ["B00BCEK2LA", "B000UEZ36W", "B00CJD4HD2", "B00AAS888S"]}}