{"asin": "B004RJJI7Q", "description": "Featuring an intuitive layout and slim profile, the Archos Vision 18b is a sleek and affordable solution to your portable music needs. The Vision 18b holds 8 GB of data and offers up to 18 hours of music playback. A 1.8-inch TFT screen lets you enjoy videos and display your favorite photos with the push of a button. With FM radio capabilities and a built-in voice recorder, the Archos Vision 18b has all the features you need to enjoy a wide variety of media on the go.Vision 18b 8 GBAt a Glance:Slim, lightweight design for maximum portability8 GB of storage space and up to 18 hours of battery life for long-lasting usePlays multiple music formats and FM radioSupports video playback and picture display on 1.8-inch screenWorks as a recorder with internal microphoneLimited one-year warrantySlim design and up to 18 hours of battery life lets you enjoy your music on the go.View larger.Watch videos and display pictures in vivid color on a 1.8-inch TFT screen.Slim, Light Body and 18-Hour Playback TimeDesigned for maximum portability, the Archos Vision 18b features a slim profile, measuring 3.35 by 1.57 by 0.33 inches (H x W x D), and weighs less than 1 ounce. An intuitive layout makes the Vision remarkably easy to use, and a battery life of up to 18 hours ensures that you can use it all day long on a single charge.8 GB Storage Capacity and Streaming FM RadioThe Vision 18b offers 8 GB of storage, so you can take plenty of music with you wherever you go. In addition to playing MP3 files, the Vision supports WAV, FLAC, and APE formats. Its music library displays your files by artist, album, and song title for ease of use.When you want a break from your stored music, take advantage of the streaming FM radio, which includes several station presets. Whether listening to local news, catching sports results, or enjoying some tunes, you'll appreciate the receiver's high-quality sound and reception.Watch Video and Display Photos on 1.8-Inch ScreenEquipped with a 1.8-inch color TFT screen with 128-by-160-pixel resolution, the Archos Vision supports video and picture playback. You can easily store and display photos on the Vision to relive those special occasions and share your memories with family and friends. The device supports JPEG and BMP photo formats.Take music videos, funny YouTube clips, and more with you anywhere. The Vision supports MPEG-4 and AVI video files.The screen on the Archos Vision also displays lyric files (.LRC) for your music, so you can sing along to all of your favorite songs.Built-In Audio RecorderNeed to remember an important lecture or meeting, or want to capture a special occasion? The Vision includes an internal microphone and ample storage space, so you can record at any moment, store files on the device, and listen to them whenever you like.Compatibility and Warranty InformationThe Archos Vision is compatible with Windows, Mac, and Linux (with mass storage support) operating systems. It uses USB 2.0 high-speed interface for data transfer and recharging--simply drag your files from your computer onto the Vision and you're ready to go.The Archos Vision 18b is backed by a limited one-year warranty.What's in the BoxArchos Vision 18b player, USB mini B/A cable, earphones, and user guide.VIDEO/MP3 PLAYERSVision 15bVision 18bVision 20bVision 24bVision 30c 4GBVision 30c 8GBCapacity4 GB8 GB8 GB4 GB4 GB8 GBScreen Size &amp; Type1.5-inch color TFT1.8-inch color TFT2-inch color TFT2.4-inch color TFT3-inch touchscreen3-inch touchscreenScreen Resolution128 x 128 pixels128 x 160 pixels176 x 220 pixels320 x 240 pixels320 x 400 pixels320 x 400 pixelsBattery Lifeup to 22 hoursup to 18 hoursup to 15 hoursup to 12 hoursup to 13 hoursup to 13 hoursMeasurements(H x W x D)2.95 x 1.53 x 0.35 inches3.35 x 1.57 x 0.33 inches3.38 x 1.7 x 0.35 inches3.74 x 1.97 x 0.35 inches3-9/10 x 2 x 3/10 inches3-9/10 x 2 x 3/10 inches", "title": "Archos Vision 18b 8 GB Video MP3 Player with 1.8-Inch Screen and FM Radio (Black)", "price": 34.99, "imUrl": "http://ecx.images-amazon.com/images/I/41IKHmh5xSL._SY300_.jpg", "related": {"also_viewed": ["B008RK9XTO", "B00ECQUY2M", "B002GHBW0W"], "buy_after_viewing": ["B002MAPT7U", "B0035PBHX6", "B002TGEYOQ", "B004OBRBHQ"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}