{"asin": "B000E6G9RI", "description": "The Sennheiser CX300 provides accurate tones for tunes throughout the dynamic frequency range. With a 112dB Sound Pressure Level, you can lock out background noise and revel in the pleasure of listening to your music. And Sennheiser has been and is on the forefront of delivering great sound from audio systems great and small. Elevate your listening to transcendental pleasure with the Sennheiser CX300 earphones. Sennheiser is the acknowledged world leader in headphone-transducer technology. These CX 300 headphones are Sennheiser's leading introduction to in-ear-canal earphones. The CX 300 model is ideal for use with portable MP3, CD, MD, DVD players and many other portable devices with 3.5mm headphone sockets. Soft Silicone-Rubber Ear adapters in three different sizes are included to ensure a perfect fit, high wearing comfort and an excellent attenuation of ambient noise. Get away from the daily noise and surround yourself with private audio. The CX300 is the best partner for your player, your ears, and you. Dynamic Transducer Carrying Pouch Sennheiser Color - Black", "title": "Sennheiser CX300-B In-Ear Stereo Headphone (Discontinued by Manufacturer)", "price": 32.5, "imUrl": "http://ecx.images-amazon.com/images/I/31ARuzt2dtL._SX300_.jpg", "related": {"also_viewed": ["B001EZYMF4", "B005EIVKLQ", "B001EZUQ5E", "B001RNO8ZC", "B005QXAAOC", "B001RNO8ZW", "B005EIVL5G", "B005EIVL74", "B004ZLUZOG", "B000VRBLMS", "B0035Y1T4E", "B004ZLV02C", "B000E1FYQA", "B001EZWO5O", "B002EL4MXY", "B004HD4L2E", "B002REBVU0", "B001EZWNWS", "B0034L72G2", "B001GSX7R8", "B00B4RCHWW", "B008V6T1IW", "B005HP3OB0", "B005S3H836", "B008X9Q0JK", "B002FFL1QK", "B00ISL3PPU", "B0035JKJAE", "B001FWYXF0", "B005HJ38OO", "B00BHSTXSY", "B0018Z7EIM", "B00E4LGVUO", "B0038W0K1G", "B0035JKJC2", "B004PNZFZ8", "B0050MM40C", "B004IK2EAW", "B0046ZSWX2", "B002YO8WRI", "B005TOV0OM", "B0045NDF2S", "B005920DVA", "B004S7Q8CA", "B0038W0K2U", "B001V9LPT4", "B001MQ3CCO", "B009QV3NBM", "B003EM8008", "B004OBZ2XQ", "B00AWLEAH6", "B009E6J8U4", "B007VEQ2UU", "B0038W0K2K", "B008FLWPKO"], "buy_after_viewing": ["B001EZYMF4", "B005EIVKLQ", "B003EM8008", "B001EZUQ5E"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]]}