{"asin": "B000BWZY7Q", "description": "Blizzard Entertainment took online role playing by storm with their hit title,World of Warcraft. With mind-boggling improvements in graphics, gameplay networking, and interface -- really every category -- this game became the crown prince of the genre. World of Warcraft players will be excited by the approaching release of the new expansion pack:World of Warcraft: The Burning Crusade. This pack expands the already massive, award-winning multiplayer online role-playing game by tremendous bounds, adding new races, lands, battlegrounds, professions and items, and much, much more. Although no release date has been set, here is sample of what you can expect fromThe Burning Crusade.The Burning Crusade is the highly anticipated, unreleased expansion pack for Blizzard's \"World of Warcraft.\"What lies in Medivh's tower?View larger.Blood Elves emerge as a new race in The Burning Crusade.View larger.The Blood Elves seek the golden destiny that has been promised to them.View larger.Warcraft's newest continent: Outland.View larger.Once a beautiful land, Outland has been ravaged by war.View larger.Outland is a vital strategic location.View larger.The expansion pack features an increase in the level cap to 70. There are two new playable races, including the magical Blood Elves that you can read more about below. The other race has not yet been released by Blizzard. There will be new starting zones in Quel'Thalas and beyond. Another eye-opening addition is the entirely new, unexplored continent of Outland that is reachable through the Dark Portal. Plus, you'll find many new high-level dungeons to explore in Azeroth, Outland, and elsewhere that will substantially boost gameplay. There are new flying mounts in Outland; tons of new and dangerous monsters (including epic world bosses); hundreds of new quests and items; and even a new profession: Jewelcrafting. Of course this isn't the end of the list -- this is just a glimpse of what Blizzard has planned for their unreleased expansion pack.The New Story, the Rumors, and MoreSeveral years have passed since the Burning Legion's defeat at Mount Hyjal and the races of Azeroth have continued to rebuild their once shattered lives. With renewed strength, the heroes of the Horde and Alliance have begun to explore new lands, and have broken through the Dark Portal to investigate the realms beyond the known world. In this expansion pack,The Burning Crusaderefers to the Burning Legion's ongoing efforts to destroy life on Azeroth. To date, the Burning Legion's exploits have been documented inWarcraft IIIand in theWar of the Ancientsnovel trilogy. As part of the expansion pack, players will now be able to travel through the Dark Portal to confront the Legion on otherworldly battlefields.Although only one race has been revealed, Blizzard has announced plans to unveil details about possible additional races at a later date. On the other hand, many details have been released about the new continent, Outland. Players last visited Outland inWarcraft III: The Frozen Throne, alongside Illidan as he conquered the Pit Lord Magtheridon's domain. Players will also gain access to Quel'Thalas, the region to the northeast of the Forsaken lands, where the Blood Elves reside. Blizzard says that this expansion pack holds even more new areas that are ripe for player exploration -- additional details will be revealed in the months ahead.Blizzard also has plans to add new dungeons and battlegrounds with the expansion, though the exact number has not yet been determined. One upcoming dungeon that has players excited is Karazhan, which is located within Medivh's tower. Because Medivh has played such a central role in Warcraft lore, Blizzard is convinced that longtime players will be especially interested in seeing what Karazhan contains. As for battlegrounds, Blizzard has released very little information. However, they have announced plans to make some of the battles from the past accessible through the Caverns of Time.Blood Elves: The New RaceThousands of years ago, the exiled Highborne landed on the shores of Lordaeron and founded the enchanted kingdom of Quel'Thas. These high elves, as they called themselves, created a fountain of vast, magical energies within the heart of their land -- the Sunwell. Over time, they grew dependant on the Sunwell's unstable energies, regardless of the bitter lessons they'd learned in ages past.During the Third War, the villainous Prince Arthas invaded Quel'Thalas and reduced the once-mighty realm to rubble and ashes. His undead army decimated nearly all of the high elven population. In addition, he used the Sunwell's energies to resurrect a powerful undead Lich, Kel'thuzad, thereby fouling the Sunwell's mystical waters. The few elven survivors, realizing that they had been cut off from the source of their arcane power, grew increasingly volatile and desperate.In the midst of the elves' darkest hour came Kael'thas Sunstrider, the last of Quel'Thalas' royal bloodline. Kael, as he was commonly known, knew that the remnant of his people would not long survive without the nourishing magic that once empowered them. Renaming his people \"blood elves\" in honor of their fallen countrymen, Kael taught the survivors how to tap into ambient mystical energies -- even demonic energies -- in order to sate their terrible thirst for magic. In search of a new destiny for his people, Kael'thas ventured to the remote world of Outland where he encountered the fallen night elf, Illidan. Under Illidan's watchful eye, Kael and his blood elves regained much of their former power.Unfortunately, the blood elves practice of embracing demonic energies caused their former comrades in the Alliance to shun them. Thus, the remaining blood elves on Azeroth look desperately to the Horde to help them reach Outland where they can reunite with Kael'thas and achieve the golden destiny he has promised them.Outland: The New ContinentOnce the beautiful homeworld of the orcs, all that remains of Draenor is the scattered wastes of Outland. Following the Second War, the Alliance invaded Draenor by crossing through the Dark Portal. To their horror, they discovered that Ner'zhul -- the dark warlord of Horde -- had constructed a series of new gateways that could lead the beaten Horde to newer, unspoiled worlds. As the Alliance forces closed in around him, Ner'zhul opened his gateways as a means of escape. However, his plan backfired and the gateway's clashing energies resulted in a massive catastrophic explosion that ultimately ripped the world of Draenor to pieces.Nearly thirteen years later -- towards the end of the Third War -- the fallen night elf, Illidan, discovered that huge chunks of Draenor still existed, floating upon the astral winds of the Twisting Nether. After his defeat at the hands of the evil Prince Arthas, Illidan fled to the remnants of Draenor and dubbed them \"Outland.\" He quickly seized control of the chaotic region and sealed the last of Ner'zhul's gateways.Though he is the undisputed ruler of the ravaged land, Illidan lives in fear that he will be discovered by his powerful enemies -- most notably Arthas, the new Lich King, and the remaining Lords of the Burning Legion. For now, Outland is home to a number of scattered draenei tribes, primitive orcs, and powerful, arcane creatures of the Nether itself. Agents of the Burning Legion have also targeted the region as a vital strategic location in their unending Burning Crusade to scour all life from the universe.What else can expected? Blizzard has tantalized Warcraft players with the brief glimpse intoThe Burning Crusade'sstoryline. Will these heroes find friends or foes? What dangers and rewards lie in wait beyond the Dark Portal? And what will they do when they discover that the demons they thought were vanquished have returned to renew their terrible Burning Crusade? These and other questions will remain unanswered until the gameplay can be explored by role-playing Warcrafters.System RequirementsMinimumRecommendedOperating SystemPC: Microsoft Windows XP or Windows Vista (with latest Service Packs)Mac: Mac OS X 10.4.11 or newerCPUPC: Intel Pentium 4 1.3 GHz or AMD Athlong XP 1500+Mac: PowerPC G5 1.6 GHz or Intel Core Duo processorPC: Dual-core processor, such as Intel Pentium D or AmD Athlong 64 X2Mac: Intel 1.8 GHz processor or betterGraphics HardwarePC: 3D graphics processor with Hardware Transfor and Lighting with 32 MB VRAM, such as an ATI Radeon 7200 or NVIDIA GeForce2 class card or betterMac: 3D graphics processor with Hardware Transform and Lighting with 64 MB VRAM, such as ATI Radeon 9600 or NVIDIA GeForce Ti 4600 class card or betterPC: 3D Graphics processor with Vertex and Pixel Shader capabilities with 128 MB VRAM, such as an ATI Radeon X1600 or NVIDIA GeForce 7600 GT class card or betterMac: 3D graphics processor with Vertex and Pixel Shader capability with 128 MB VRAM, such as ATI Radeon X1600 or NVIDIA 7600 class card or better.MemoryPC: 512 MB (1 GB for Vista)Mac: 1 GBPC: 1 GB (2 GB for Vista)Mac: 2 GBHard Drive Space15 GB of free spaceAll Platform RequirementsKeyboard and mouse, required for controls. Other input devices not supported. Active broadband Internet connection required to play.", "price": 15.08, "imUrl": "http://ecx.images-amazon.com/images/I/51nCGBzcGyL._SY300_.jpg", "related": {"also_bought": ["B000VJTJNE", "B000067FDW", "B002I0HKIU", "B0050SZBP6", "B00FRESQYG", "B00063BLG8", "B009716ESA", "B005L38QHA", "B00IFRH6JS", "B00009ECGK", "B000H96C9M", "B00005V9Q1", "B003O6N74S", "B00DU2CHE2", "B0050SZDAO", "B000PC9ZQS", "0744014336", "B004HYIAPM", "B003A09RBK", "B00008ODBQ", "0744013100", "B00002CF9M", "B00001IVRD", "B003O6CACS", "B0040RHMAK", "B000PSSYFU"], "bought_together": ["B000VJTJNE", "B002I0HKIU"], "buy_after_viewing": ["B0050SZBP6", "B00FRESQYG", "B000VJTJNE", "B002I0HKIU"]}, "salesRank": {"Video Games": 9068}, "categories": [["Video Games", "Mac", "Games"], ["Video Games", "PC", "Games"]]}