{"asin": "B004XZL980", "description": "The Acer&reg; Iconia Tab A500-10S16u provides the ultimate tablet experience with a gleaming 10.1\" touch-screen and attention grabbing metallic design fueled by top-of-the-line technology and the  latest build of Android \"Honeycomb\" OS. The A500 delivers powerful tablet performance and effortless multimedia enjoyment in a flash! Have fun with Google Apps like Google Movies and Google Music, connect to social networks, play full-version games in console-quality, browse the Web in accelerated speeds and so much more.br/Key Features10.1&rdquo; HD Multi-Touch Display:(1280 x 800) resolution, 16:10 aspect ratioNVIDIA&reg; Tegra&trade; 2 Dual Core Mobile Processor1GB DDR2 MemoryNVIDIA&reg; GeForce&reg; GPUeMMC: 16GB on boardMicroSD memory card up to 32GBDolby&reg; Mobile TechnologyDual Analog MicrophoneDual Speaker802.11b/g/n Wireless(802.11n 2.4GHz only)Bluetooth&reg; 2.1+EDR1- Micro USB 2.0 Port1- USB 2.0 Port1- Micro HDMI&trade; Out(support Dual Display)5MP Rear Facing Camerawith Auto Focus and single LED flash2MP Front Facing CameraSensors:G-Sensor, E-Compass, L-Sensor, Gyro-meterRechargeable Lithium-ion polymer BatteryUp to 8-hours battery lifeLearn MoreThe Latest Android Tablet Experience!Experience crisp, clear HD content anywhere!The Acer&reg; Iconia Tab A500-10S16u is designed to maximize content enjoyment, providing a rich and vibrant experience on the user-friendly 10.1\" multi-touch screen display, while the orientation-less design ensures optimal on-screen viewing from every angle - up and down or left to right.The latest build of Android&trade; Honeycomb&trade; Operating System combined with Acer UI brings a whole new level of interactivity- you can personalize your Tab by easily resizing apps widgets that are most important to you! In addition, the Android Market lets you choose from thousands of apps and games, making your Tab uniquely yours.This latest OS now supports Google Apps! Rent the latest flicks with Google Movies and listen to your personal play lists with Google Music in great Dolby Sound! Port this whole entertainment experience to your big screen TV in full 1080p HD glory through the micro-HDMI&trade; port.Experience crisp, clear HD content anywhere! The 10.1\" HD multi-touch display features an astounding 1280 x 800 resolution, 16:10 aspect ratio and advanced flash support, displaying all your HD content in crystal-clear form.Thanks to the USB 2.0 port and the Micro-SD slot, the Iconia Tab gives you the ability to connect USB flash drives, USB media card readers and even a portable hard drive. The expansion opportunities are endless giving you more time to be a master multitasker.The Power to PlayEnjoy console-quality gaming and fun with preloaded full versions of games!NVIDIA&reg; Tegra&trade; 2 brings the fastest, most visually-rich tablet experience, and extreme multitasking for effortless multimedia enjoyment.  Enjoy the best Web experience with accelerated browsing with full Adobe&reg; Flash&reg; support* and get your heart racing in console-quality gaming with an NVIDIA&reg; GeForce&reg; GPU.Are you ready for serious gaming? This is the first mobile device to bring an arcade-like gaming experience with 10 point multi-touch control for high-level gaming that&rsquo;s on par with the best game consoles.  And with preloaded full versions of top games like Electronic Arts &lsquo;Need for Speed: SHIFT&rsquo; and Gameloft &lsquo;Let&rsquo;s Golf&rsquo;, let the fun begin immediately!The battery provides up to 8-hours of cable-free battery life giving you the freedom to experience the web, email, view photos and HD videos, play high-end games and read ebooks wherever you may be!Stunning Design &amp; Unique ExtrasStay fully connected with friends and the latest buzz wherever you go.Stand out with the Iconia Tab A500 designed with an aluminum casing that provides a cool, metallic tactile sensation, while the high-gloss anodized finish with textured engraving portrays sophistication. Additionally, the smooth, rounded surface ensures comfortable handling.Snap photos, record videos or enjoy online chats with the 5MP autofocus rear-facing camera and 2MP front-facing camera the easily share on line.SocialJogger puts your social life in one place so you can check updates from your Facebook&reg; and Twitter contacts in a single glance! Enjoy face-to-face video chats and more with the 5MP rear-facing and 2MP front-facing camera.Acer Clear.fi&trade; allows you to manage, store, share, and enjoy media between any Clear.fi enabled devices, in any room throughout your home.Acer Sync&reg; lets you wirelessly synchronize your contacts, calendar, photos and video clips between your Acer Tab and PC.USB ports and Micro-SD card allow for expansion and enhance connectivity.", "title": "Acer Iconia Tab A500-10S16u 10.1-Inch Tablet Computer (Aluminum Metallic)", "price": 5.39, "imUrl": "http://ecx.images-amazon.com/images/I/518PsXrA2rL._SX300_.jpg", "related": {"also_bought": ["B005DCVGWG", "B005E2LX28", "B004YPK5ZW", "B005M0ICKI", "B005CL106U", "B005HXM0PI", "B004VPLY1E", "B005GYDIZE", "B00813XGL8", "B007Y3EWZ0", "B00590TXSG", "B006XGCQ2U", "B008KGO4MG", "B007JWUP52", "B00AU00USM", "B005TP4LV0", "B00548QAPC", "B007Y3FYWU", "B004U78J1G", "B003UH0Z9Q", "B005M7B8BG", "B007H9ZGWY", "B005MJAVJ4", "B0051OKO42", "B0061OVOQI", "B004YHOUCO", "B00DTMA6WI", "B0045FM6SU", "B00A5UFIW0", "B00569ZNUW", "B00BIOVZ38", "B0067PLM5E", "B007JX3J40", "B0052P6DQI", "B004U78JT8", "B008MOHP5Y", "B0083PR7N2", "B008RDROWE", "B005PVXI80", "B00D02AHEO", "B0054KSPWG", "B004Y06OCU", "B007ZZAMAQ", "B0054ENB7Q", "B004SBI2PW", "B0058LTTUS", "B0056K5D92", "B006Y455OW", "B0057WU5UG", "B00AO0BIJ8", "B006XGCQ48", "B004JQN670", "B007RG70I0", "B007P4YAPK", "B005SSW18S", "B007BV1Y7E", "B007P78J68", "B0067PLNRQ", "B004YHOUDI", "B009LL9U50", "B0073YBGCC", "B008EFS8S4", "B0054KS6TI", "B004YHOUC4", "B004M5QPFI", "B0076MPDFW", "B0072ZXB8O", "B006W95VHU", "B006G40LEY", "B006ZU59SM", "B006G40IWY", "B007RG7WTW", "B008RRAY68", "B003WGJYCY", "B00D3F9H62", "B008F4NL04", "B00G3OGIOO", "B007M50PTM", "B005QX7KYU", "B0098O9TB0"], "buy_after_viewing": ["B007Y3EWZ0", "B007Y3FYWU", "B00I054WFQ", "B007JWUP52"]}, "categories": [["Electronics", "Computers & Accessories", "Tablets"]]}