{"asin": "B001TD6SN0", "description": "Celebrating the 20th year of the renowned franchise,Dissidia Final Fantasyfor PlayStation Portable brings together the largest collection ofFinal Fantasycharacters ever in a fighting-styled game where players must choose their allegiance between good and evil, as they utilize the more than twenty playable characters available..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }StoryPlayers, prepare to profess your allegiance to either Cosmos or Chaos...Cosmos is the goddess of harmony, while Chaos is the god of discord. Reigning from distant realms, the two gods had gathered warriors from all lands to lead them in savage war. At one time Cosmos and Chaos were of equal in strength. It was believed that their conflict would last forever. However, the balance is now broken. Those who answered Chaos' call created an inexhaustible force. And under vicious attack without relent, the warriors fighting for Cosmos started to fall one by one. The conflict that has continued for eons is now about to end in Chaos' favor...The world has been torn asunder, sinking into a vortex of disorder. As for the few surviving warriors&hellip; their fates have yet to be determined.Battle for Cosmos or Chaos.View larger.A wealth of playable characters.View larger.Wield special weapons and items.View larger.GameplayFeaturing action very similar to other games in theFinal Fantasyseries,Dissidia Final Fantasyconsists of one-on-one combat either against a human or AI opponent where the goal is to reduces your opponent's hit points to zero. This is done through a series of attacks and battle features which must be balanced against the player's status and that of the opponent faced. In addition, the game also features \"EX Mode\" which increases the power of existing attacks. This mode can be activated in a variety of ways, both related to combat and chance.CharactersDissidia Final Fantasyfeatures characters from both sides of the struggle from each of the games in theFinal Fantasyseries. Although favorites will soon be found, the storyline of game's main campaign requires players to assume the role of each of these characters at one point or another in order to attain ultimate success. All told the game contains twenty-two total playable characters fromFinal FantasythroughFinal Fantasy XII; evenly split between heroes and villains. In addition, players can also look forward to playing as a few secret characters unlockable in the game. Regardless of the character, players will find that each will become more powerful as they gain experience in battle, have access to different costumes and in most cases are able to transform into different physical forms in specific modes and wield fully customizable. See all 22 and their previousFinal Fantasyappearances below:", "price": 53.07, "imUrl": "http://ecx.images-amazon.com/images/I/51iHlzgJ-vL._SY300_.jpg", "related": {"also_bought": ["B002I0GXWO", "B0014X7SQ6", "B002I0GZ5Y", "B000SSPH3E", "B001KMRN0M", "B000NPTOTK", "B004LLRYOY", "B000NPOGWK", "B0045U4U52", "B001HWF1OA", "B00356GVRW", "B003YVK5T8", "B001GXI4LM", "B000F2DE8S", "B000R37S78", "B000G0O6CW", "B001CM62UM", "B000FDOTIQ", "B000CI83LI", "B000R37S00", "B000R3BN4M", "B000ASBKHE", "B004OP65CY", "B002E6XY6K", "B002BS47TE", "B000QTD05M", "0744011426", "B001CM0PJ6", "B007ZH9OFI", "B005EYJ4PO", "B000CBCVF4", "B001TIFML4", "B0010EF0UK", "B004BV5O0U", "B003O21OWY", "B00523VFJU", "B003VMWR14", "B000UZH7P6", "B000OOOISM", "B003WTR2QQ", "B001COTC3E", "B003V3O4A0", "B000SSQPU8", "B000HKMG14", "B0010YOQIW", "B0009XBXQ8", "B000R3K4CE", "B000G79XQO", "B000HKIPGE", "B0013AX2JM", "B002BS47WG", "B00168PFFK", "B000H0SGV8", "B002I09830", "B0007V46JI", "B000E0OCR8", "B000CBCVEK", "B000GABOTU", "B0007V804U", "B000VIPJ0W", "B001YYQ9SS", "B000E0OCQY", "B003L51GW2", "B000R39IKI", "B0045SE9XC", "B001V7UX1W", "B000BNMOFU", "B00004Y57G", "B002DGNLFK", "B001CB9VSS", "B0007UDYTW", "B004I8EEMU", "B001TILU88", "B005T3GSBS", "B00008URUA", "0744010241", "B001N2EVPE", "B000TTZI0E", "B000F5IH2I", "B000UA0LXQ", "B00K2O4O6K", "B002CZ3SEQ", "B000Q6ZLKM", "B003Q9RG9K", "B006O3Z2ZA", "B00DUANBQM", "B00KVRK39A", "B000VIUNZI", "B00002R28C", "B001TOQ8T8", "B001TD6SK8", "B0010YOQIM", "B001F513VO", "B000LEFKXC", "B0000296O5", "B000BLFE9K", "B008I628DK", "B00005TNI6", "B00008RUYZ"], "bought_together": ["B002I0GXWO", "B0014X7SQ6"], "buy_after_viewing": ["B002I0GXWO", "B0014X7SQ6", "B002I0GZ5Y", "B001KMRN0M"]}, "salesRank": {"Video Games": 3666}, "categories": [["Video Games", "Sony PSP", "Games"]]}