{"asin": "B003FMUP2I", "description": "Designed for music lovers who desire a seamless mix of style and sound, the MuzxDNA Mesh earphones keep you comfortable so you can stay plugged in to your music for as long as you wish. Featuring a sleek, stylish look, these earphones provide clean highs and serious bass for a well-balanced, natural sound--all at a very affordable price. Part of the innovative MuzxDNA line, and geared for both music and multimedia, the Mesh earphones are a must-have for any music lover.MuzxDNA MeshAt a glance:Stylish, comfortable design for serious music lovers9 mm audio drivers for full-range, balanced soundStreamlined profile for long-term comfortSnugFit design shuts out external noiseiPod and iPhone compatibleSnugFit tips for ultimate comfort and acoustic clarity.View larger.iPod and iPhone CompatibleMuzxDNA Mesh earphones are made for hardcore music lovers--the ones who see their favorite songs as extensions of themselves, and an expression of their individuality. The earphones are engineered for superior sound so you can get the best performance out of your iPod, iPhone, or portable MP3 player.Full-Range, Balanced SoundFeaturing nine-millimeter drivers for full-range, balanced sound, the Mesh earphones deliver superb sound quality. And the compact, comfortable earbuds shut out external noise so you can enjoy a truly immersive audio experience.Ultimate Sound GuaranteeWe're passionately proud of our sound! If you do not feel these are the best sounding earphones for the price, simply return them within 30 days from time of purchase.*Extended ComfortIn addition to excellent sound quality, the Mesh earphones offer all-day comfort whether you're commuting to work, exercising, or just hanging out. The streamlined profile lets you listen for as long as you want, whenever and wherever you want. And with ample cable length and a sliding cable adjuster, you can quickly and easily plug into your favorite tunes or multimedia on the go.Even better, the earphones come with three sizes (small, medium, and large) of silicone ear tips so you can find the optimum fit.About Altec Lansing: 70 Years of Audio InnovationFor more than 70 years Altec Lansing has been shaping the history of sound delivery and is viewed by many to be one of the world's most innovative and valuable audio brands. The company boasts a unique history of invention that includes the introduction of the first \"talkie\" film speakers, the first set of desktop computer speakers, the first iPod docking station, and the first \"Works with iPhone\" speaker system. Altec Lansing LLC is headquartered in Milford, PA.* Offer good only for sales in the United States. For more information, go to www.alteclansing.com/ultimatesoundguarantee.What's in the BoxOne pair of MuzxDNA Mesh earphones and six-piece fit kit with silicone tips (SM, MD, LG).", "title": "Altec Lansing MZX106W Mesh Headphones (White and Black)", "price": 19.95, "imUrl": "http://ecx.images-amazon.com/images/I/31hEmginhWL._SY300_.jpg", "related": {"also_viewed": ["B001GUNJPG", "B004H1VKJ8", "B003FMUP3M", "B00945906M", "B00518DE2W", "B006Z01UAI", "B003FMUP32", "B00518DEN6", "B0094A09F8", "B001GUPEMW", "B003FMUP2S", "B005AFP1AY", "B001TDKP9I", "B009994N3S", "B001W2GAAY", "B001TK3ACK", "B00794VFG8", "B002M78JA2", "B00AJHCJ2Q", "B004PEIG12", "B001EZUQ5E", "B004PEIG76", "B005M1KO1C", "B003CP0KCS", "B004ZLUZGY", "B004RE3YU8", "B00510ERKI", "B003EM8008", "B0078JSD28", "B004PEIGIK", "B004PEIGPS", "B004PEIH5M", "B004PEIHRK", "B004PEII4M", "B00HXTHFJA", "B001GUVBJC", "B00H09GORW", "B002AWZC7W", "B003EM800S", "B007136D46", "B00510ERXU", "B005VEZ4KQ", "B003ELYQHK", "B007136E0O", "B003ELYQJI", "B0038W0K2K", "B001EZYMF4", "B0011TS8LM", "B003EM2WAW", "B00E4LGVUO", "B005VEZ4JW", "B003ELYQGG", "B004XXQI1U", "B000IG66VS", "B003EM6AOG"], "bought_together": ["B003FMUP2S"], "buy_after_viewing": ["B001GUNJPG", "B003FMUP2S", "B004H1VKJ8", "B003EM8008"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]]}