{"asin": "B002L6HE9G", "description": "Redesigned for music and Multi-Touch, iPod nano is smaller and lighter than ever. You can clip it to your sleeve, jacket, or running shorts and keep your favorite songs at your fingertips-along with the Genius feature, a built-in FM radio, pedometer, and more. And the anodized aluminum finish in six bright colors makes this new design even more brilliant.Upgradeable to nano 1.2 SoftwareThis sixth-generation iPod nano is now upgradeable to Apple's new nano 1.2 software. Simply connect to iTunes and upgrade, and you'll be able to access the newer features. These include the ability to navigate with large icons displayed one at a time, a choice of 18 different clock face designs, and the ability to track your steps, distance, pace, and time while exercising, without the need for a separate shoe sensor or receiver.Redesigned for music and Multi-Touch, iPod nano is smaller and lighter than ever.Click to enlarge.Music. Feel the beat.Your greatest hits. And taps. And swipes.The best things in life have a soundtrack, and that's where iPod nano shines. The Multi-Touch display lets you experience your music in a new way. Tap to play anything you want to hear. Swipe the Home screen to browse your music by songs, albums, artists, playlists, genres, or composers. You can even rearrange the icons on your Home screen so your music is organized just how you like.Clip on some tunes.With the new built-in clip, you can walk, run, ride, or dance with your favorite songs on your sleeve (or pocket, jacket, or bag). The album art of the song you're listening to fits perfectly on the display.Play all day. And all night.The built-in rechargeable lithium-ion battery gives you up to 24 hours of nonstop music. So when you clip on an 8GB or 16GB iPod nano, you'll have plenty of tunes to make it through your commute, your workout, and beyond.Shake it up.Now for something completely random. Give iPod nano a shake and it shuffles to a different song in your music library. Shake to Shuffle is perfect for when you're not in any particular music mood. You never know what you're going to hear, and you'll always be pleasantly surprised.Genius. The music mixmaster.Built-in clip.1.5-inch Multi-Touch color display with 240-by-240-pixel resolution.8 and 16 GB models in new anodized aluminum colors: silver, graphite, blue, green, orange, pink.Your own personal DJ.Say you're listening to a song you love and you want to stay in the groove. Just tap Genius. It finds other songs on your iPod nano that go great together and makes a Genius playlist for you. For more song combinations you wouldn't have thought of yourself, create Genius Mixes in iTunes and sync the ones you like to your iPod nano. Then tap the Genius Mixes icon and rediscover songs you haven't heard in a while--or find music you forgot you even had.FM radio. Touch that dial.Radio nano.Ride the airwaves on iPod nano. The FM tuner shows the artist, song, or program you're listening to. Just tap to see the radio controls, flick the radio dial to change stations, and tap to set your favorites.Live Pause.If you need to take a break from listening, don't miss a minute of radio time with Live Pause. Tap to pause a song or show, then tap again to continue where you left off. You can rewind as far back as 15 minutes or fast-forward to catch up to the live broadcast.Fitness. Meet your new personal trainer.Clip and go. And go. And go.The new iPod nano design actually helps keep you fit. It's portable and wearable, which makes it runnable, walkable, and workout-able. Clip it on and control your music with just a tap or swipe of a finger, so you can stay focused without fumbling around. For your run, walk, or trip to the gym, a little iPod nano goes a long way.Stay fit with every step.iPod nano doubles as a pedometer, which makes it the ideal exercise partner. It keeps track of your steps and helps you meet your fitness goals. Just clip it on and walk on. You can create a daily step goal and check your progress when you upload all your data to the Nike+ website.Rock your workout.With the Nike + iPod Sport Kit (sold separately), iPod nano keeps you motivated from warm-up to cooldown on your run or in the gym. Lace up a pair of Nike+ running shoes and clip on your iPod nano. You'll watch the miles unfold and hear real-time voice feedback along with your favorite songs. In the gym, connect iPod nano to a Nike + iPod compatible cardio machine. It records your pace, time, and distance as you work out and rock out.iTunes. For your iPod-playing pleasure.Everything you need to be entertained.iTunes is the best way to fill your iPod nano with the latest music, podcasts, audiobooks, and more. It's also the best way to browse and organize the ever-expanding digital media collection on your Mac or PC. Everything you buy on the iTunes Store--and any music from CDs you import--appears in your iTunes library. You can make your own playlists, create Genius playlists, choose Genius Mixes, and sync it all to your iPod nano. And you can download iTunes free.The world's #1 music store.Load your iPod nano with your favorite tunes. Or browse over 13 million songs and discover even more. You can search by artist name, song, or album title and handpick exactly the songs you want. Want some help finding new music? The Genius sidebar recommends new music based on the songs you already love. When you find something that sparks your interest, listen to the free 30-second preview. Click once to buy the song and it starts downloading instantly. It's the fastest, easiest way to build a digital music collection for your iPod nano.AccessibilityBuilt-in accessibility.iPod nano comes with accessibility features that help people with disabilities enjoy music, audiobooks, and more.VoiceOveriPod nano features VoiceOver, the world's first gesture-based screen reader. Touch the screen to hear a description of the item under your finger, then double-tap, drag, or flick to control iPod nano. Use the optional Apple Earphones with Remote and Mic to control your music without looking at the screen. VoiceOver tells you the name of the song or artist--and it speaks 29 languages.White on BlackIf you prefer higher contrast, iPod nano lets you change the display to white on black. Use the White on Black feature in any application, as well as on the Home screen.Mono AudioIf your hearing is limited in one ear, turn on Mono Audio to route audio into both earbuds so you can hear both channels in either ear.What's in the Box8GB iPod nano (Graphite), Apple Earphones, Dock Connector to USB Cable, Quick Start Guide and Important Product Information", "title": "Apple iPod nano 8 GB Graphite (6th Generation) (Discontinued by Manufacturer)", "price": 162.95, "imUrl": "http://ecx.images-amazon.com/images/I/31Y0LgzMWLL._SX300_.jpg", "related": {"also_bought": ["B0046E47IM", "B004FEEZHQ", "B004UIC948", "B00529PYU0", "B004FEEZMQ", "B007PEBRAG", "B0048O0WKW", "B0067LGN4S", "B004QBKPJK", "B0084JCGV0", "B002L6HECS", "B004ALEDA8", "B00529MQVU", "B004FP1QUE", "B0084JCGWY", "B0044CWG0M", "B004E2UXNO", "B004YTQ4UI", "B004RD4KBG", "B0077CDC22", "B004YTQ41M", "B002L6HEA0", "B0071U6WHW", "B007B5YD50", "B002L6HEAU", "B004CR8ZQ8", "B004FEEZKI", "B0043JDU56", "B005KOK9JI", "B004A81PLG", "B0037TA8AS", "B004FEEZJ4", "B004CQZVX4", "B0045VQ0AE", "B004O8Q6UM", "B004N943OS", "B007Z0FVXO", "B004AGUI34", "B0043GW820", "B0045LYVJ6", "B002M3SO1U", "B00IKMI26Y", "B0041SWQ5O", "B00FF3CYS8", "B005MQ0EJE", "B00BWJSF28", "B004C1RSM6", "B0043JKHRU", "B004CR906M", "B00FF3CYOC", "B00D77ERKC", "B004B9TBJW", "B00IKMI1EW", "B002L6HEBE", "B0037T6OHO", "B003VKXMGK", "B002M3SO0G", "B004FEEZJY", "B002L6HEBY", "B00IKMMDFA", "B004SH40BQ", "B0097BEDPG", "B0097CZJEO"], "buy_after_viewing": ["B002L6HECS", "B002L6HEA0", "B002L6HEBE", "B004FEEZHQ"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}