{"asin": "B00AR0M7ZE", "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Cases & Sleeves", "Cases"]], "description": "Enhance the utility and convenience of your iPad Mini with the lightweight and durable Wireless Keyboard Case by SHARKK brands. Serving as both a fully functional keyboard and as a rotating stand, this case is the perfect accessory for any work or home environment.Additionally, the slim case design allows for easy transportation inside a purse or briefcase.Contemporary DesignSleek and stylish, the Wireless Keyboard Case has a rubberized matte feel while the rotating stand is made of brushed aluminum.The keys themselves are made of ABS with a Chocolate Key design.Keyboard FeaturesIn addition to the overall added convenience of the case, the keyboard itself features whisper quiet keys, classic Apple layout and IOS commands.While the case is design to work only with an iPad Mini, the keyboard may be used with any Bluetooth compatible device.Please Note:Due to system limitations, the Keyboard does not currently support the Search and Photo View Mode hot keys on devices using iOS 7.Also note that the devices native Auto correct feature will be disabled while the keyboard is in use.SHARKKThe SHARKK Lifestyle Brand is pleased to be able to offer a wide range of consumer accessories across many different product categories. Keyboards, Tablet and Phone Cases, Speakers and Wallets are but a few of the items that make up our extensive online catalog.Here at SHARKK, the quality of our products and the satisfaction of our customers are the two greatest passions of our enterprise, as we endeavor to bring you top quality items at competitive prices.", "title": "SHARKK&reg; Apple iPad Mini Keyboard (Black) / iPad Mini Retina Bluetooth Keyboard Case Cover Stand For 7.9 Inch New Mini iPad 2 With 360 Degree Rotating Feature And Multiple Viewing Angles. Folio Style with IOS Commands. For the First Gen iPad Mini and the iPad Mini 2 Retina", "price": 36.0, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41-VayHZF%2BL._SY300_.jpg", "related": {"also_bought": ["B0095UZYQ6", "B009QQMEEY", "B008THTWIW", "B00GR1I242", "B00FS0EE40", "B00746W9F2", "B00746W3HG", "B0068SV23W", "B00A4LAZMS", "B00GQDBS7O", "B00GNKRFEA", "B009UZ3TF4", "B00F4SU6FM", "B00C19U4EK", "B00GQDAFKA", "B00GQDBZUY", "B00746W5EM", "B00GRACUXM", "B008MOHLVC", "B00746W6X2", "B009X21N1G", "B009SKNWOY", "B00G3J8EZ0", "0972556192", "B00F9P2DFQ", "B004M5QPBM", "B0059KTEBC", "B00AUBXHRC", "B00DR0JD94", "B008RDI0TU", "1451186908", "B00B15JZQS", "1934465542", "B00GH0N1LM", "1451193785", "1609133609", "B00A9LVCKW", "B009XJX952", "B00ET9YYS2", "B0064REJ3C", "B005JL5046", "1118728262", "0912912065", "B004M5QPFI", "B00A7O9ZDC", "B00FO0V5L4", "B005HMO6A6", "B00BJVJV9A", "B00GFIEQWO", "B000P6MSOU", "B00A8LPVLY", "B00746WEUC", "B00267SFDE", "B00ANALFDI", "B009A5204K", "B000SKF9VW", "B00A8OWGT6", "B004GCJEZU", "B004XC6GJ0"], "bought_together": ["B009QQMEEY"], "buy_after_viewing": ["B008RDI0TU", "B00GAYC3SW", "B00BJVJV9A", "B00GH0N1LM"]}}