{"asin": "B000V1BDIG", "related": {"also_bought": ["B000V1DJBU", "B000V1GPL6", "B005ILYUOS", "B00HHGPLCW", "B00HHGPKZK", "B007BETSM4", "B0050IJBDO", "B0071Y6MR8", "B00HHGTM4K", "B00DNKJT1U", "B00HHGPLDQ", "B007ED6H12", "B0072F6ISY", "B0072F6I8Y", "B00HHGTN76", "B00HHGPKR8", "B00HHGXIHC", "B0037W6PJS", "B000IHGVFI", "B00HHGPKPA", "B00HHGPL2W", "B000IOSS8Y", "B00HHGTMNG", "B00DM14TYC", "B005FTLIB6", "B0062CW1BG", "B005N7YWX6", "B0000635WI", "B000OZI8HS", "B000XV7ORI", "B005MI648C", "B000JVA80C", "B00B58E5W0", "B00BV8C73S", "B001X4Z1N8", "B000V1BDMM", "B000W3XEQM", "B001LF2VUA", "B000V1BDLI", "B008X7JBPM", "B000NDCHNW", "B00HHGTO2U", "B00BR04QIE", "B003CT36NE", "B0007XXPHA", "B0060BI79E", "B00HHGTNOO", "B001VC995S", "B00I1ATZFM", "B000OFNDOQ", "0553381466", "B003BEDU2M", "B000JVCBBG", "B00JEB99A8", "B0077HK17Q", "B000IHC6G6", "B001EHI316", "B0060BI87A", "B001FWZ1NI", "B005G4YCHW", "B000V1GPM0", "B0037W6PK2", "B0000BYAG0", "0761152121", "B003DGZRNS", "B002K6F7CS", "B0024KMZZC", "B0036BU9FQ", "1594203334", "B002B46H6Y", "B001FWXKMM", "B00295MQLU", "B002QYW8LW", "B0007CQ726", "B00488PS1G", "B002TLU5JO", "B0029PT4KG", "B002VK977O", "0345479092", "B00AIVN89G", "B008N1057Q", "1889392448", "B00HPS5EK6", "B001NBMYD6", "B000GUZC2A", "B00E36RNUW", "0553381156", "B00IIJ80VQ", "B00I0418PY", "B009QXDE32", "B004UF1P3M", "B009YR19NW", "B000BLKJ5E", "B005RT9KXM", "B004XWHBH6", "B00JPSUE68", "B000ZKE4AM"], "also_viewed": ["B00HHGPLCW", "B00HHGPKZK", "B000V1GPL6", "B00HHGTO2U", "B000V1DJBU", "B0060BI79E", "B005ILYUOS", "B0050IJBDO", "B007BETSM4", "B00HHGPKR8", "B0071Y6MR8", "B00HHGPLDQ", "B00HHGTM4K", "B00HHGTMNG", "B00HHGXIHC", "B007ED6H12", "B000IOSS8Y", "B00HHGPL2W", "B00HHGTN76", "B000IHGVFI", "B000GA99EC", "B00HHGTNOO", "B000JVA80C", "B00J4GRPZY", "B0037W6PJS", "B00HHGPKPA", "B00BV8C73S", "B000OZI8HS", "B0016BCS9S", "B0077HK17Q", "B000V1BDMM", "B0060BI87A", "B000OZF998", "B00DNKJT1U", "B00DM14TYC", "B002K4L0OE", "B006QXBCNY", "B00112RH9I", "B005FTLIB6", "B000V1GPM0", "B008N06RAG", "B00HHGPLNQ", "B0055NDLTY", "B002B46H6Y", "B0072F6I8Y", "B00B58E5W0", "B001X4Z1N8", "B005P0GLMQ", "B0037W6PK2", "B00HCLO4AM", "B00HNQE9LU", "B004W7QVYQ", "B0029PT4KG", "B00I1ATZFM", "B00HPS5EK6"], "bought_together": ["B000V1DJBU", "B00HHGPKZK"]}, "title": "Belli Elasticity Belly Oil, 4 fl. oz.", "price": 34.95, "salesRank": {"Beauty": 15991}, "imUrl": "http://ecx.images-amazon.com/images/I/31M91FEGf2L._SY300_.jpg", "brand": "Belli", "categories": [["Beauty", "Skin Care", "Body", "Moisturizers", "Oils"]], "description": "Belli Elasticity Belly Oil offers a luxurious blend of ingredients that nourish your skin while protecting against stretch marks. This product features Gotu Kola extract, Vitamin E, and Collagen Hydrolysates--ingredients that have been shown to decrease the risk of stretch marks by 39 percent. And with calming lavender and sweet almond, Belli Oil is sure to sooth tired moms-to-be.Belli Takes the Worry out of Pregnancy SkincareThe last thing any expectant mother wants to worry about is her skin. As a mom-to-be, pregnancy should be a time for excitement, not a time for agonizing about the challenges of a changing body. Luckily, Belli has taken the worry out of pregnancy skincare by creating a complete line of products that are specially formulated to address your needs as an expectant mom, especially the need to know that you are making the healthiest choices for your baby.Proven Protection Against Stretch marksDuring the second and third trimesters of your pregnancy, your uterus will grow rapidly, stretching the skin over your abdomen. This rapid growth may tear your skin's inner connective tissues, resulting in stretch marks on your belly. Normal pregnancy growth may also increase fat deposits in your breasts, hips, thighs, and buttocks, and may result in scarring of those areas.Affecting 90 percent of all women, stretch marks may seem like an unavoidable part of motherhood, but luckily there are things you can you can do to minimize your risk. Published research on stretch mark prevention shows that a combination of Gotu Kola extract, Vitamin E, and Collagen Hydrolysates decreases the risk of acquiring stretch marks by about 39 percent and decreases the severity of any stretch marks that do form. All of these ingredients can be found in Belli Pregnancy's Elasticity Belly Oil, along with the relaxing aromas of lavender and almond oil.Pampering for Mom, Protection for BabyWhile many topical ingredients are thought to be safe during pregnancy, a large number are linked to harmful effects that occur after repeated or high exposures. Some examples include Vitamin A, salicylic acid, benzoyl peroxide, certain sunscreens, and even aloe vera. While your skin blocks many skin care ingredients from entering your body, small amounts of some ingredients are still absorbed into your bloodstream. Once there, they can cross the placenta and reach your growing baby.This is why Belli screens each ingredient to exclude chemicals that have been linked to birth defects and pregnancy-related problems. As the only line in the world to do so, Belli also allergy tests all of its products and ensures they are free of synthetic dyes, phthalates, and paraben preservatives.What's in the Box:One four-ounce bottle of Belli Elasticity Belly OilAbout BelliBelli supports expectant and new mothers by providing soothing, balanced skin products that pamper and protect. Three skincare collections--Belli Pregnancy, Belli Motherhood, and Belli Baby--address the specific needs of each stage while giving thoughtful attention to the safest formulations. Belli's goal is to support and encourage new mothers, inspiring self-confidence and greater safety in both pregnancy and parenting."}