{"asin": "B005H7MXZ6", "description": "A larger screen without the price tag, the 10&rdquo;Velocity Micro Cruz T410is perfect for multimedia lovers and fans of Android in search of a more robust experience without sacrificing mobility. Capacitive touch screen, front facing camera, Android 2.3, 802.11n wifi, 1GHz Cortex A8 processor, a premium software suite, and content via the Amazon Kindle for Android and Amazon Appstore for Android create an amazing feature set at a remarkable value. A fully licensed version of Adobe Flash Player 10.3 brings the best of the web right in the palm of your hand. Backed by Velocity Micro&rsquo;s expert US-based support.Android 2.3 (Gingerbread) is fast, stable, and compatible with the largest library of applications of any Android versionPreinstalled apps provide quality content right out of the box.10&rdquo; Capacitive Touch ScreenThe T410 features a brilliant 1024x600 resolution 10&rdquo; capacitive touch screen for a richer experience when using apps, viewing pictures, reading books, or watching video.Premium Content PortalsPreinstalled withKindle for Androidapplication for access to the largest selection of the books people want to read, in full color &ndash; no need to repurchase your Kindle book collectionTake full advantage of your T410&rsquo;s powerful hardware with applications from theAmazon Appstore for Android&ndash; access over 7,000 prequalified apps and a new free paid app every day!Design/HardwareThe T410 squeezes tons of features and ultra-fast performance into a thin, sleek design with small bezels and a quality feel comparable with the more expensive competition. Key features of the high end hardware include:Fluid navigation with the1GHz Cortex A8 processorBuilt in speakerfor a complete multimedia experienceFront Facing Camera&ndash; Video Chat with friends and family from the comfort of any wifi hotspotIntegrated microphone&ndash; includes voice recording softwareMobile Multimedia HubThe T410 makes a great on-the-goVideo Playercompatible with MPEG-4, FLV, and H.264/H.263 filesJust like your own personal juke box, the T410 holds andplays your favorite musicfiles. Compatible with MP3, WAV, and OGG filesShow off yourdigital photosor create slideshows with just a tapWebFull web browser brings the internet right to your hands. Browse mobile or full webpages from the comfort of your sofaGet the best of the web including streaming video and games natively withAdobe Flash Player 10.3installedAccess your personal and corporate emailwith Android&rsquo;s included email clientBest of the web on a brilliant 10\" screenKey Applications PreinstalledThe T410 comes preinstalled with an application suite designed to give you great functionality right out of the box:Games- Angry Birds Rio, Chess, Checkers, Solitaire, and moreQuickOffice&ndash; This full version of QuickOffice allows you to view PDFs and view/edit Word, Excel, and Powerpoint documents from anywhere!OI File Manager&ndash; View, move, copy, and save files to the Android system&rsquo;s folders without syncing to a desktopAndroid 2.3Fast, stable, and compatible with the largest library of applications of any Android version,Android 2.3 (Gingerbread)provides users with all of the best features of the Android OS.Connectivity and ExpandabilityThe T410 comes preinstalled with an application suite designed to give you great functionality right out of the box:Fast and reliableWireless-N networking (802.11b/g/n)&ndash; access home networks and wifi hotspots with just a few tapsmicroSD card slotcompatible up to 32GB. Offers virtually unlimited storageMicro USB portA Premium LegacyCruz is the premier brand of Android based tablets from the foremost builder of finely crafted desktops in North America, Velocity Micro. All Cruz products are built with the same attention to detail and expert craftsmanship that have made Velocity Micro famous amongst PC enthusiasts for years. Since our first review in 2003, no other PC builder has been able to match Velocity Micro in value, performance, and quality. Those are the ideals that Velocity Micro was founded on. That is the premium legacy that comes with the Cruz.The T410 is sleek, affordable, easy to use, and engineered to attract attention.100% US Based SupportAll Velocity Micro Cruz tablets are covered by non-tiered, in-house support, 100% based in the USA along with a 1-year parts and labor warranty. A call placed to our expert support team will never be routed anywhere offshore. Not ever.Specs10&rdquo; TFT Slim Capacitive Touch Display16:9 1024x600 Pixel DisplayAndroid 2.3 (Gingerbread)512MB RAM4GB Built-in Storage (expandable via mSD)802.11 b/g/n wifiFront Facing CameraWhat&rsquo;s in the BoxCruz T410, User's Manual, Quick Start Guide, Micro USB cord, AC Adapter", "title": "Velocity Micro Cruz Tablet T410 - 10-Inch Android Tablet with Flash", "price": 16.94, "imUrl": "http://ecx.images-amazon.com/images/I/41tjMgOTqCL._SX300_.jpg", "related": {"also_bought": ["B0076S4ZG4", "B00CUKWCQS", "B0048NBPQS", "B006XOLEV6", "B009XFOY7S", "B00BNOFW14", "B00CUI5IT8", "B00CUKRKTM", "B004M5H660", "B004I0FK6M", "B00H4WIMK2", "B002BBJMO6", "B00853SSHG", "B003WGJYCY", "B0058POH1U", "B00BTMDZPU", "B004OB0EBQ", "B00GXEDPEU", "B0045I8E42", "B005MJ6LH0"], "buy_after_viewing": ["B00BNOFW14", "B006XOLEV6", "B009SD74H2", "B00DW9YGV0"]}, "categories": [["Electronics", "Computers & Accessories", "Tablets"]]}