{"asin": "B00006JN5O", "description": "James Bond 007: NightFireis a worthy sequel to 2001's outstandingAgent Under Fire. The game retains the overall look of its predecessor--including some familiar recurring characters and gadgets--but is designed to feel more like an actual Bond movie than a video game. After the familiar \"gun barrel\" opening shot, you're introduced to the game via a pre-credits action sequence through the streets of Paris that leads into an original theme song, complete with surreal imagery.The pacing of the game is natural, with each objective leading smoothly to the next. You even get to holster your PPK, don a tuxedo, and infiltrate a cocktail party at your adversary's mansion, making small talk with his henchmen, flirting with female party guests, and eavesdropping on secret conversations. Of course, within minutes you'll be shooting your way out of the place and making a daring escape in true 007 fashion, including Bond's trademark one-liners. The storyline combines espionage, action, and innuendo in just the right proportions to evoke a real Bond movie atmosphere.The game's overall playability is improved by some nice attention to detail, not the least of which is the addition of smarter and less predictable villains (they can hear you coming, they communicate with each other, and they're better at utilizing cover and sneaking up behind you). You also have more tactical options (there are many ways to reach each objective, so the game is very replayable) as well as a better arsenal of gadgets and weapons. And best of all, the multiplayer mode incorporates classic characters from many Bond movies. More than any other 007 game to date,NightFirewas designed with the die-hard Bond fan clearly in mind.--Maile BohlmannPros:Well-developed storylineAuthentic Bond movie atmosphereGreat graphics, sound, and musicSmart, crafty villainsWide range of controller settingsCons:Pre-credits action sequence is far too easyThey still don't have Bond's voice quite right (Maxwell Caulfield?!)Fans of nonstop action might not appreciate the extended cutscenes(This review refers to the PlayStation2 version of this game)", "price": 158.32, "imUrl": "http://ecx.images-amazon.com/images/I/51FFQ9YZ5BL._SY300_.jpg", "related": {"also_bought": ["B00005V3EX", "B00009X3V2", "B000930DOG", "B00006AVB1", "B0002I9RQ8", "B00009WAUD", "B00012D0SG", "B00005Q8M0", "B00008H2IS", "B00005R5PZ", "B002L8W5V6", "B000088KH2", "B000ARPXU0", "B00005QEFD", "B00009PS22", "B00009VE6B", "B00005QDPZ", "B0000A1OG4", "B00009X3V1", "B000AQA9UA", "B000UQCER6", "9861019731", "B00006IJJI", "B00008G8IA", "B0009Z3I0K", "B0009350BM", "B000066JRN", "B000095ZHA", "B00009X3VB", "B00006IJJC", "B00006JZDV", "B00005QEFF", "B00006966U", "B000B8J7JQ", "B00007UHDI", "B00005Q8LG", "B00006IJJK", "B00095KU5G", "B0002ILS1U", "B0000A0834", "B000L9NPGG", "B002L93F0A", "B0000E5U6I", "B0002ILS24", "B00007E1OC", "B000069BB0", "B000641ZC2", "B00006599P", "B0002Y5180", "B00095LEDS", "B000067DPN", "B0002A6CQ4", "B00006HBTW", "B000646MLQ", "B000A15K0Y", "B0001B167O", "B0008GJRT6", "B000EHPQMG", "B00005U8TI", "B00006LU9B", "B0000A0O28", "B00006599U", "B00006FWTX", "B000084318", "B002C5BMFI", "B0006ZJP7I", "B0002I9RQI", "B00009PS24", "B00005V3EY", "B0002IQOPU", "B00005QDQ1", "B000UZPFQ4", "B00005Q8M4", "B0009UBR3A", "B00009WAUB", "B00009WAUH", "B004CHLNWQ", "B000067K2D", "B00005ULXN", "B0000690XL", "B0000657SP", "B0009XEC0C", "B00005Q8LR", "B0000E5U6K", "B00009WAUF", "B0001OK7V2", "B00005BOSF", "B000UY2TJG", "B00006LEMP", "B00005YVTY", "B00015MFWK", "B00205DV7C", "B00005Q8LV", "B0009O7HWQ", "B0017KIBAI", "B0000E5U6J", "B000083JTS", "B0000A09EN"], "bought_together": ["B00005V3EX", "B00009X3V2"], "buy_after_viewing": ["B00005V3EX", "B00009X3V2", "B00012D0SG", "B000930DOG"]}, "salesRank": {"Video Games": 3795}, "categories": [["Video Games", "More Systems", "GameCube", "Games"]]}