{"asin": "B0025VKUQQ", "related": {"also_bought": ["B00IKMJ9B6", "B000SE6IV8", "B008I64LC6", "B0025VKUQG", "B000I23TTE", "B001E6BUKI", "B008I646WG", "B001B8QUS6", "B0001Y8UI4", "B006DA34VI", "B0045JHJSS", "B0088PUEPK", "B00215LFZQ", "B002FQJW4W", "B00ALK3KEM", "B005BZNDOO", "B00E3W1726", "B00FWK8UWI", "B0025VKUPW", "B004LTEUDO", "B00BWF5U0M", "B00834SJS0", "B009H0XQRS"], "bought_together": ["B00IKMJ9B6"], "buy_after_viewing": ["B0027VT6V4", "B0025VKUPW", "B002HWRZ2K", "B0025VKUQG"]}, "title": "Altec Lansing VS2621 2.1 Channel Speaker System", "price": 49.18, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31qvzlyEgqL._SX300_.jpg", "brand": "Altec Lansing", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]], "description": "Offering a bold and striking design, the Altec Lansing VS2621 speaker system delivers enhanced stereo sound, giving your games, movies, and music added depth and realistic sound. Optimized for computers and MP3 players, these speakers also give you the ability to expand your listening options through a front auxiliary input. Each stereo satellite features dual three-inch speakers matched with dual-tuned three-inch passive radiators for deeper low notes and sharper highs and mids. A compact subwoofer fills in the low notes for realistic sound and impact that you can both hear and feel. Thanks to Altec Lansing's Audio Alignment technology, the system's drivers, enclosure, and electronics are perfectly balanced, giving you the full, high-quality stereo sound your digital life demands.The side-firing subwoofer lets you hear and feel those big explosions.View larger.Controls are conveniently located for easy access.View larger.Stellar Sound and Striking LooksWith its striking, contemporary design, the VS2621 offers a bold visual statement, and the system's well-rounded sound grabs your ears. Each angled enclosure houses two three-inch speakers -- one active driver for the highs and mids and one passive speaker for improved bass response. The compact package gives you improved clarity and quality over integrated laptop speakers as well as striking looks that will complement any desktop setup.Side-Firing Sub Adds Bass, Not ClutterMeasuring only 4.9 x 10.3 x 8.8 inches (W x D x H) the compact design of the separate subwoofer keeps your work area tidy. But don't let its size fool you -- you'll know it's there when the explosions in your games and movies rattle the room, or the bass in your favorite track hits with just the right amount of power.Front Controls Within Easy ReachWith separate front-mounted knobs for power, volume, and tone, you have quick access for dialing in the perfect sound to match your music. The auxiliary input jack lets you use the VS2621 system to listen to your CD player, MP3 player, or digital music device without unplugging the speakers from your computer.Audio Alignment Technology for Superb Accuracy and AlignmentThe VS2621 relies on Altec Lansing's proprietary Audio Alignment technology to make sure all of the speakers' components work together to deliver your music the way it is meant to be heard. Audio Alignment technology offers the perfect balance of the three elements of the speaker system -- the drivers, enclosure, and electronics -- to ensure a natural, uncolored, and rich sound from your speaker system. The VS2621 system is optimized for computers and digital media, giving new life to your music and multi-media files.About Audio AlignmentWhether it's the tiniest of ear buds or the most imposing of subwoofers, Altec Lansing has refined every detail of its speakers to provide you with the most accurate sound reproduction and quality. Audio Alignment ensures that your components work together to deliver your music the way it is meant to be heard, offering the perfect balance of your speaker system's drivers, enclosure, and electronics. For 70 years Altec Lansing has been refining this process, bringing your speakers to life with advanced technologies that make them sing.What's in the BoxAltec Lansing VS2621 speaker system (two satellite speakers and one subwoofer) and quick connect guide."}