{"asin": "B003EYVEZE", "description": "Connect with friends and family in high-quality video with the sleek, portable Philips SPZ6500/27 Notebook webcam. This compact webcam delivers sharp, detailed video. It also features dual, built-in microphones with noise-cancellation technology--you'll get clear conversation without distracting background noise. It will seem like your friends and family are right there with you. Lightweight and designed for mobility, the webcam makes it easy to connect with everyone from everywhere.Notebook webcamSPZ6500/27At a glance:Skype High Quality Video certified2-megapixel images for sharp video8-megapixel photos; built-in autofocusAudio-beaming technology reduces background noiseCompact, portableIncludes by-pack clamp and 1-hour free SkypeOut voucherThe Skype-certified Notebook webcam provides high-quality video with true 2-megapixel images.View larger.Attaches easily to computer monitors with included by-pack clamp.View larger.Skype High Quality Video CertifiedSkype, a provider of free video calling and instant messaging, has certified the Philips SPZ6500/27 Notebook webcam for high-quality video and sound. The webcam is automatically recognized by Skype to generate exceptional video quality. You can now enjoy video chat in VGA, which is four times clearer than the resolution offered by previous models, as well as two times smoother. Additionally, a one hour free SkypeOut voucher is included. You can share more of your life with your friends and family.Sharp Video with Digital Natural Motion and Pixel Plus 2The Notebook webcam provides high-quality video with true 2-megapixel images. The webcam utilizes Philips' Digital Natural Motion technology to eliminate the shuddering effects of moving picture content. At the same time, Pixel Plus 2 technology enhances image detail, so you'll experience vivid, life-like video. And with a wide-angle lens that increases your field of view, it's easy to bring all your friends and family into the picture.Detailed, High-Resolution PhotosIn addition to video, the Notebook webcam can capture still photos with eight-megapixel (software enhanced) resolution--enough for printing poster-sized images. The quick autofocus lens, used for both video and photos, ensures that your shots are crisp and clear without the need for manual adjustment.Dual Mics for Clear ConversationsWith built-in, dual, directional microphones, the Notebook webcam delivers natural stereo sound for all your web-chatting. The Philips-patented audio-beaming technology creates a virtual noise- and echo-free zone, so only your voice is captured, while other distracting sounds are eliminated. In addition, superior noise reduction technology ensures that conversation is easy to understand in both quiet and noisy environments.Compact Design Ideal for TravelThe compact Notebook webcam is easy to pack and carry. The scratch-resistant protective lens cover keeps it safe from bumps and jostles. Also, with its by-pack clamp for mounting on notebooks and monitors, the webcam can be set up quickly and easily.About PhilipsPhilips has a brand promise of \"sense and simplicity\" that encapsulates their commitment to understanding and catering to the desires and needs of consumers and customers. By putting end users front and center, Philips creates innovative products that are designed around people's needs and aspirations, and are both advanced and easy to use. With 60,000 registered patents, Philips is a global leader in innovation, and receives numerous international design awards every year.The Philips SPZ6500/27 Notebook webcam is backed by a one-year limited warranty.What's in the BoxPhilips SPZ6500/27 Notebook webcam, additional by-pack clamp, and 1 hour free SkypeOut voucher.", "title": "Philips SPZ6500/27 Notebook Webcam", "price": 65.83, "imUrl": "http://ecx.images-amazon.com/images/I/41aqNLHwWHL._SX300_.jpg", "related": {"also_viewed": ["B006JH8T3S", "B004431UBM", "B004FHO5Y6", "B00CRJWW2G", "B004WO8HQ4", "B00150SZF6", "B0096KSBB0", "B0080CE5M4", "B004YW7WCY", "B003M2YT96"], "buy_after_viewing": ["B006JH8T3S", "B004431UBM", "B004FHO5Y6", "B00372567A"]}, "categories": [["Electronics", "Computers & Accessories", "Webcams"]]}