{"asin": "B009A6CZYO", "related": {"also_bought": ["B000I23TTE", "B0083J7EM2", "B009Q88W0W", "B009AGTC3Q", "B004C4WPXA", "B0040FHB6C", "B00BVT4M30", "B0001FTVEK", "B003OND0N4", "B001TH7GSW", "B000I94FAE", "B000067RC4", "B005K2TXMO", "B001B8QUS6", "B0001FTVEA", "B009A6CZ26", "B005DIRI6I", "B0045DNX48", "B001B4TTWO", "B001MVZN26", "B007I5JT4S", "B000068O3T", "B002TLT10I", "B0061VZQWO", "B00BFDHVAS", "B002JINY90", "B0016LC5VY", "B0052SCU8U", "B0074FGR74", "B00IAVDPSA", "B00002N8CZ", "B0030VBQGS", "B00DU0ZI8Q"], "bought_together": ["B000I23TTE"], "buy_after_viewing": ["B0001FTVEK", "B000ENRQ3M", "B002TLT10I", "B009A6CZ26"]}, "title": "Sony MDRRF985RK Wireless RF Headphone, Black", "price": 73.95, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41JDRwAYS4L._SY300_.jpg", "brand": "Sony", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]], "description": "Untangle your mind and relax with crisp, personal audio without wires. They also feature a comfortable headband and long battery life up to 25 hours. Best of all, one simple setup is all it takes to achieve optimal RF signal reception and you're on your way to cordless freedom. General information manufacturer Sony corporation: general information manufacturer part number mdrrf985rk: general information manufacturer website address Sony: general information brand name Sony: general information product model mdr-RF985rk: general information product name wireless stereo headphone system: general information product type headphone: miscellaneous package contents wireless stereo headphone system Rechargeable Lithium-Ion rechargeable battery: warranty limited warranty 1 year: technical information connectivity technology wireless: technical information wireless technology rf: technical information wireless operating distance 150 ft.: technical information sound mode stereo: technical information minimum frequency response 10 Hz: technical information maximum frequency response 22 kHz: technical information connector plating nickel plated: technical information features tangle-free cable, corrosion resistant: battery information Rechargeable Lithium-Ion rechargeable battery: battery information maximum battery run time 25 hour: earpiece design over-the-head: earpiece type binaural: earpiece controls power switch: earpiece driver type ferrite: earpiece driver size 1.57\": earpiece sensitivity 100 db.: interfaces/ports host interface mini-phone: physical characteristics color black: physical characteristics form factor ear-cup: physical characteristics weight (approximate) 10.59 ounce:"}