{"asin": "B001NIP3EG", "description": "Follow-up toBioShock, 2K Games' critically acclaimed and commercially successful 2007 release,BioShock 2is a first-person shooter set in the fictional underwater city of Rapture. As in the original game,BioShock 2features a blend of fast-paced action, exploration and puzzle-solving as players follow varying paths through the overarching storyline based on the decisions that they are forced to make at various points in the game. In addition to a further fleshing out of the franchise's popular storyline, players can look forward to new characters, game mechanics, weapons, locations and a series first, multiplayer game options..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }The new power in Rapture.View larger.Duel wield plasmids &amp; weapons.View larger.New choices as Mr. B.View larger.Franchise first multiplayer options.View larger.The StorySet approximately 10 years after the events of the originalBioShock, the halls of Rapture once again echo with sins of the past. Along the Atlantic coastline, a monster &#151; somehow familiar, yet still quite different from anything ever seen &#151; has been snatching little girls and bringing them back to the undersea city. It is a Big Sister, new denizens of Rapture who were once one of the forgotten little girls known as Little Sisters, known to inhabit the city's dank halls. No longer a pawn used to harvest ADAM, the dangerously powerful gene-altering lifeblood of Rapture, from the bodies of others and in turn run the risk of being harvested herself, the Big Sister is now the fastest and most powerful thing in Rapture. You, on the other hand are the very first Big Daddy, in fact the prototype, that for some reason has reactivated. You are similar to the Big Daddies familiar from the originalBioShock, but also very different in that you possess free will and no memory of the events of the past ten years. The question is, as you travel through the decrepit and beautiful fallen city beneath the waves, hunting for answers and the solution to your own survival, are you really the hunter, or the hunted?Gameplay and MultiplayerInBioShock 2players will take on the role of the original Big Daddy, not that of game one protagonist, Jack. As a Big Daddy you will have access to all the strengths and weapons of a standard Big Daddy, including the drill and rivet gun. More importantly you also possess free will and the ability to use plasmids and gene tonics &#151; genetic modifications allowed for through ADAM, a stem cell harvested from conquered enemies, or sea slugs outside the Rapture air lock, and powered by the in-game injectable serum known as EVE, which can be found, captured or purchased. Plasmids and gene tonics provide a wide range of aggressive and passive abilities which can be upgraded and arranged for quick use. The ability to use plasmids and tonics gives you a decided edge over other Big Daddies and most other denizens of Rapture, excluding the powerful Big Sisters. In addition, due to their role as a Big Daddy, players will experience a new relation to the Little Sisters. Upon defeating standard Big Daddys you are given the familiar choice as to whether to harvest or adopt them. Harvesting gains you ADAM immediately, but could alter your path through the game, while adopting makes you responsible for Little Sisters, who then accompany you through Rapture, but also provide aid and warning in times of danger. Additional gameplay features include: new plasmids, weapons and the ability to combine these two.The game also features the anticipated multiplayer modes. Several of these are team-based, allowing up to 10 players. Within these players are provided with a rich prequel experience that expands the origins of theBioShockfiction, and allows you to play as one of several characters pulled from Rapture's history before the events of the first game.Key FeaturesThe Big Sister- No longer just something to be harvested or not, the Big Sister is the most powerful resident in Rapture.You Are the Big Daddy- Take control with the original prototype Big Daddy, and experience the power and raw strength of Rapture&rsquo;s most feared denizens as you battle powerful new enemies.New Plasmids- New plasmids such as \"Aero Dash\" allowing for bursts of speed over short distances, and \"Geyser Trap\" a stream of water used as a jump pad and electrical conductor, join the ample list of Plasmids from the original game.New Game Mechanics-BioShock 2contains many new gameplay mechanics. Just a few of these are: the ability to wield plasmids and weapons simultaneously; flashback missions detailing how you became the Big Daddy; the ability to walk outside the airlocks of Rapture to discover new play areas, and many more.New Locations- Just a few of the locations and environments debuting inBioShock 2are Fontaine Futuristics, headquarters of Fontaine's business empire and the Kashmir Restaurant.Evolution of the Genetically Enhanced Shooter- Innovative advances bring new depth and dimension to each encounter, allowing players to create exciting combinations to fit their style of gameplay.Return to Rapture- Set approximately 10 years after the events of the original BioShock, the story continues with an epic, more intense journey through one of the most captivating and terrifying fictional worlds ever created.Genetically Enhanced Multiplayer- Earn experience points during gameplay to earn access to new weapons, plasmids and tonics that can be used to create hundreds of different combinations.Experience Rapture&rsquo;s Civil War- Players will step into the shoes of Rapture's citizens and take direct part in the civil war that tore Rapture apart.See Rapture Before the Fall- Experience Rapture before it was reclaimed by the ocean and engage in combat over iconic environments in locations such as Kashmir Restaurant and Mercury Suites, all of which have been reworked from the ground up for multiplayer.", "price": 14.99, "imUrl": "http://ecx.images-amazon.com/images/I/51ZcZFl3BQL._SY300_.jpg", "related": {"also_bought": ["B001B1W3GG", "B003O6E6NE", "B005C2D1YI", "B00309XHD0", "B000X1TC0U", "B0050SX9VO", "B0050SXX88", "B002I0K5NC", "B0022TNO7I", "B00HV0MNEI", "B00354NANC", "B003O6EDSM", "B00269DX5W", "B000P46NMA", "B000WMEEBM", "B004FUI84G", "B004ML44Y6", "B007CM0K86", "B003L8DXOI", "B007SRM5U6", "B000UW21A0", "B002I0H2G0", "B0012N94WO", "B002I0J5UQ", "B00BMFIXKQ", "B001SGZL2W", "B0050SXGU8", "B0028IBTLG", "B007TYC8MI", "B008CP6RUW", "B004EQCCI4", "B0085CA8QG", "B0036FDHT2", "B001JKTC9A", "B00F3F2VGI", "B003H0CBYS", "B0076ZQSFI", "B000ZK9QCS", "B004NRN5EO", "B0050SXLQC", "B005N4HBIW", "B001NX6GBK", "B008CP6MA2", "B008CP6RWU", "B000FQBF1M", "B0086V5V8G", "B00BU3WVM6", "B005DVAB0A", "B009GZX49Y", "B005185SDA", "B002NN7AKU", "B00B59L9T6", "B0050SXFKE", "B002BRZ6UE", "B00C7103DO", "B0050SWUTQ", "B002I0J8FI", "B0037LVW9M", "B000UU7VUC", "B003O6E67A", "B003O6KWZK", "B008XMSR6G", "B002I0J5YW", "B000ZK7ZOE", "B004FYJFNA", "B001D7T2VC", "B0012N3T3Y", "B000HKP88C", "B005THAX6K", "B00319DX4M", "B004FS8LYK", "B003C1I06U", "B00DWXV1B4", "B008E6ZXTA", "B0055202HE", "B003GT8IL0", "B000GKCI4A", "B004PAGJNS", "B002I0F5M8", "B003O6E3C8", "B001E8VB6O", "B003P9FRGA", "B002I08RR8", "B00170823O", "B001J944YY", "B004UDB9SA", "B000FPOJOS", "B0081B1O5A", "B004QEWVLC", "B002I0GX88", "B005GM3XVA", "B0050SX7BQ", "B00576U7W8", "B004HYK8Y8", "B0012N746W", "B00503E9FY", "B00DT55P94", "B00BRQN2H4", "B001CRM3YQ"], "bought_together": ["B003O6E6NE", "B007CM0K86"], "buy_after_viewing": ["B003O6E6NE", "B009WI7VAS", "B001B1W3GG", "B00BMFIXKQ"]}, "salesRank": {"Video Games": 2227}, "categories": [["Video Games", "PlayStation 3", "Games"]]}