{"asin": "B00127VF68", "description": "Amazon.com Product Description Slim, lightweight, and easy to use, Transcend's T.sonic 850 combines a bright 1.8-inch color TFT display with a compact, portable design. Whether you're on a long trip, at the gym, or just making your daily commute, the T.sonic 850 will keep you thoroughly entertained with 8 gigabytes of music, videos, photos, or electronic books. The T.sonic 850 also features a recordable FM radio with 20 station presets and an advanced voice recorder with built-in microphone for recording personal memos, class lectures, company meetings, and more.Keep yourself thoroughly entertained with 8 gigabytes of music, videos, photos, or electronic books.Click to enlarge.Watch movies and videos on the go.Click to enlarge.Includes protective silicone cover.Click to enlarge.Available in 4 GB white and 8 GB black models.Click to enlarge.Enjoy Your Music Anywhere, AnytimeThe T.sonic 850 provides 22 hours of nonstop music playback and supports MP3, WMA, and WAV formats, including WMA-DRM10 subscription music files.It also boasts a few features you won't find in many players, like the A-B repeat function (which allows you to continuously replay a designated section of a track), variable track playback speeds, and a sleep mode (which will power off the 850 after 15, 30, or 60 minutes). And naturally, you can dial in the EQ--the 850 features seven equalizer settings, including one customizable user setting.Take Your Entire Photo Album with YouT.sonic 850's high-resolution screen and slideshow screensaver is perfect for viewing your favorite pictures. Pull up JPG and BMP format images for sharing anytime.A Movie Theater in Your PocketTransfer full-length movies and video clips to the T.sonic 850 for convenient, portable viewing. Just use the included Transcend Media Converter software to convert to the \".mtv\" format, and you're good to go.Listen to Your Favorite Radio StationsT.sonic 850 is equipped with a crystal-clear recordable FM radio with 20 station presets. Pull up your favorite stations in a snap, and if you want to save it for later, just hit record--the 850 features FM recording.Read Novels Without Turning a Single PageLeave your books at home and use the T.sonic 850 to read all of your favorite e-books or other text documents while on the go. The text feature also lets you display lyrics for karaoke-style fun.Create Memorable Voice RecordingsClass lectures, important meetings, or personal memos can be recorded at the touch of a button with T.sonic 850's digital voice recorder enhanced with voice activity detection (VAD) technology for high-quality gapless recordings.Take Your Files with YouThe Hi-Speed Mini USB 2.0 port ensures easy computer connectivity and fast file transfers. An added plus is the ability to use the 850 as a USB flash drive for carrying/transferring files.Real-Time ClockDisplays local and world times.What's in the BoxTranscend T.sonic 850 8 GB Video MP3 player (Black), Protective Silicone Cover, Neck Strap, Software CD, Earphones, USB Cable, Quick Start Guide, Warranty Card.", "title": "Transcend T.sonic 850 8 GB Video MP3 Player (Black)", "price": 74.19, "imUrl": "http://ecx.images-amazon.com/images/I/31Ssi67ItfL._SX300_.jpg", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}