{"asin": "B000CNPAAA", "related": {"also_bought": ["B000JKUOIY", "B0050IYI7I", "155407147X", "B0010PGGWU", "B0015WS8KQ", "B0000665V5", "B00008Y0U5", "B0000665V7", "B0040H2LWE", "B0000665V8", "1554073448", "B0012YXF1O", "B00006RH5I", "B006YTQBEU", "1931559430", "1852337141", "B006YTQ9KQ", "B0007UQNXG", "1931559317", "B0000665V6", "B0007UQNWW", "B00008Y0VN", "B0006NAS7G", "B0007UQNV8", "1928771017", "0521153972", "B006ZN4VE2", "B0007UQNTU", "B000GUFOC8", "B0000665UZ", "B0001PNJXO", "B000GUKTDM", "B000A3OPTE", "B0006O4DR6", "B0000ALKAN", "0961320753", "B006YTQ7B2", "B00339QKW2", "B0000665V1", "B00009R7RJ", "B00080L42K", "B0007UQNY0", "B003VL8D2M", "B0000ALKAM", "B000237C9M", "B008XEGXMO", "B0052PJF5E", "B00009XVHZ", "B0014HODWE", "B0002379UO", "B001TI44FE", "1554077931", "1554073685", "1441906029", "0596100604", "B00008BFWB", "B00006LSVL", "B00009X3UU", "0486234711", "B006YTQABO", "B0014HMAZQ", "157912366X", "1931559309", "B0069VY9CO", "0764584650", "B00009X3V8", "B00008Y0TM", "B006MX03Q0", "B004QF0A1Y", "B000I4JG26"], "bought_together": ["B000JKUOIY", "155407147X"], "buy_after_viewing": ["B001UZHASE", "155407147X", "B00008Y0VN", "B0010PGGWU"]}, "title": "Celestron SkyScout Personal Planetarium", "price": 391.97, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41Qx0KtX60L._SX300_.jpg", "brand": "Celestron", "categories": [["Electronics", "Camera & Photo", "Accessories", "Telescope & Microscope Accessories", "Telescope Accessories"]], "description": "The SkyScout is a revolutionary handheld device that uses advanced GPS technology with point and click convenience to identify thousands of stars, planets, constellations and more.IdentifySimply point the SkyScout at any star in the sky and click the target button. The SkyScout will tell you what object you are looking at.LocateTo locate a star or planet, select the object's name from the menu and follow the directional arrows through the viewfinder. SkyScout tells you when you are on target. It's that easy!LearnOnce you have targeted an object the real fun begins. The SkyScout includes entertaining and educational audio and text information, including facts, trivia, history and mythology about our most popular celestial objects. A fun learning tool for all ages, the SkyScout personal planetarium puts the knowledge of an expert astronomer in the palm of your hand.SkyScout featuresIdentifies celestial objects with the click of a button.Locates over 6,000 stars, planets and constellations from built-in celestial database and provides scientific information for each object.Provides comprehensive text and audio descriptions providing history, mythology and other entertaining information for the most popular objects.Tonight's Highlights: a customized list of the 20 best objects to view for your exact date, time and location anywhere in the world.Constellation lessons: if the star you identify or locate is part of a constellation like the Big Dipper, you can actually take a guided tour through all the stars in that constellation and even see an onscreen map of the constellation.Built-in field guide includes:Introduction to astronomy: a six part audio lesson on the origin and history of astronomyGlossary of terms: text defining popular astronomy terms including planets, comets, galaxies and moreGreat Astronomers: text bios on some of the world's greatest astronomers including Galileo, Einstein and CopernicusMan-made space objects: text description of some of the coolest objects man has sent into space including the International Space Station, the Hubble Space Telescope and the Space ShuttleComet guide: text descriptions about history's most famous comets including Halley's Comet and Comet Hale-BopSD card slot: for optional Sky Tour audio presentations that provide hours of entertainment on a variety of topicsUSB port: allows database to be updated with new objects as they are discovered, comets, etc.Simple enough for all ages:  just turn it on and it's ready to useBuilt-in help menu: includes a quick start instruction guide for using the SkyScoutBring it anywhere: compact and light design makes it easy to carry and durable construction makes it safe for rugged environmentsBacked by Celestron's 2-year warranty"}