{"asin": "B001HWB68K", "description": "Developed exclusively for Xbox 360 by acclaimed developer Bungie,Halo 3: ODSTis a new, stand-alone expansion to theHalosaga that lets players experience the events leading up to the epic story told inHalo 3through the eyes of an entirely new character the ODST (Orbital Drop Shock Trooper), as they search for clues leading to the whereabouts of their scattered squad and the motivations behind the Covenant's invasion of New Mombasa. The game adds a new dimension to an all-encompassing universe that gamers around the world have known and loved since the release of the firstHalogame in late 2001..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }New hero, old enemy.View larger.Join the ODST.View larger.Stunning cinematics.View larger.New co-op multiplayer mode.View larger.New Campaign, New Hero, New TacticsMuch more than an expansion,Halo 3: ODSTallows players to explore dangerous new ground, search the dark, abandoned streets of New Mombasa for clues, and fight back against the Covenant invasion from multiple perspectives. Dropping in as \"the rookie,\" a new member of an elite squad of Orbital Drop Shock Troopers (ODST) sent into New Mombasa on a classified recon mission, you'll be armed with specialized weaponry and upgraded technology, including silenced weapons and a VISR enhanced vision mode.Separated from your squad, you'll have to scour the city for clues in order to learn what happened to Buck, Dare, Dutch, Mickey, and Romeo. As you collect new clues, you&rsquo;ll experience the story from their perspectives, fighting through the occupied city hours earlier.A New Way to Play: 4-Player Co-op FirefightDrop feet first into a new way to playHalowith the cooperative campaign mode, Firefight. Form a squad of your friends over System Link or Xbox LIVE and put your skills to the ultimate test against the invading Covenant war machine for glory, high scores, and achievements. Do battle in multiple environments, on foot or in vehicles, and against increasingly difficult waves of Covenant attackers whileHalo 3's skull modifiers progressively activate to up the ante.After the Firefight, relive and review every last kill you earned and see how your high scores and stats stack up against your friends' and the community overall using Bungie.net's persistent online stats and Firefight leaderboards.3 NewHalo 3MapsThree all-new maps make their debut forHalo 3's traditional, chart-topping multiplayer. Heretic, Longshore, and Citadel drop in alongside the originalHalo 3multiplayer maps, all packed in and playable from one standalone disc. Twenty-four maps in all, including the Heroic, Legendary, Cold Storage, and Mythic Map Packs, provide a peerless multiplayer experience, near limitless content creation and customization via the Forge and Sandbox, and a slew of new multiplayer achievements forHalo 3.New Challenges and AchievementsFor the first time, Recon Armor for use inHalo 3multiplayer will be made available to players who complete the \"Road to Recon\" challenge. Earn all seven of the Vidmasters, a series of Xbox LIVE achievements that spanHalo 3's Campaign and Multiplayer andHalo 3: ODST, and then visit your Bungie.net Service Record with a linked gamertag to enable your sweet new set of digital duds.If you already ownHalo 3, you can get started now by collecting the \"Annual\" campaign achievement and the \"7 on the 7th\" and \"Lightswitch\" multiplayer achievements in matchmaking. And, if you've already downloaded the Mythic Map Pack, you can collect the hidden skulls on Assembly, Orbital, and Sandbox today.Community Features4-Player co-op experience over Xbox LIVE or System Link, screenshots, saved films, customHalo 3multiplayer map and game variants via the Forge&hellip;all of the award-winning features included inHalo 3are packed intoHalo 3: ODSTwith an extra 1,750 available achievement points piled on for good measure. AndHalo 3: ODSTintroduces an all-new single player experience with new characters, new weapons and technology, and the frenetic cooperative experience, Firefight, an entirely unique way to playHalo.Bungie.net IntegrationWhat good is winning if you can't brag about it to your friends? Extend your gaming experience beyond the console with Bungie.net's expansive integration. All of your lifetime stats are aggregated into your online Service Record - every last kill, every single medal, and your entire collection of career post game carnage reports, plus robust charts, graphs, and leaderboards allow you to instantly see how you stack up against the rest of your squad and theHalo 3: ODSTcommunity at large.Invitation to theHalo: ReachBetaAs an added benefit of buyingHalo 3: ODSTplayers receive an invitation to participate in theHalo: Reachmultiplayer beta due to hit Xbox LIVE in 2010.Halo: Reachis Microsoft Game Studios and Bungie's upcoming prequel to the events of the originalHalo: Combat Evolvedgame. Based on Eric Nylund's novel \"The Fall of Reach,\" it is packed with details surrounding the origins of the Sparten II soldiers, of which Master Chief was only one of many and the beginnings of the conflict with the Covenant and the Flood. If you want in, hold onto your copy ofHalo 3: ODSTand stay tuned to Bungie.net and Xbox.com for more details.", "price": 14.99, "imUrl": "http://ecx.images-amazon.com/images/I/51ICIAyG50L._SY300_.jpg", "related": {"also_bought": ["B000FRU0NU", "B002BSA20M", "B0050SYY5E", "B0034JKYO6", "B00008J7NZ", "B0050SYX8W", "B00GV8QTPU", "B00005NZ1G", "B0017HW5LM", "B00FKV8AK6", "B003IT6E8C", "B002I0H79C", "B004JSDQPU", "B000K8YAKI", "B000FRS9II", "B0002A2S26", "B002I0H2AG", "B004GWW0H4", "B00269QLI8", "B000ZK9QD2", "B008RA5H8K", "B000OLXX86", "B0016B28Y8", "B001A4MTGS", "B001F6KSDM", "B000UU3SVI", "B002I098JE", "B0050SYBL6", "0765370123", "B005THAX5Q", "B00503E8S2", "B0050SY4DG", "B009WI7V9E", "B003O6G5TW", "B0050SWVIQ", "B0050SYEYK", "0765367300", "B003O6EB70", "B00770KR7W", "B002BRZ852", "B001REZLY8", "B000HCQK0A", "B000RHZ9JI", "B000ZK6950", "B000MKA60W", "0765364670", "B001TOQ8J8", "B00KSQHX1K", "B00269DXCK", "B005J5K9EI", "B000FRU1UM", "B00DBCAT3W", "B000B6ML28", "B000UKZ20S", "B006WQR3GA", "B006HPLKK6", "B00309U0M6", "B00D9EPI38", "B00IU3MSF4", "B002BSA2LQ", "B00FDQQD6Q", "B000X1PE16", "B002W5GI9I", "B001AWIP68", "B0050SY9WC", "B002I0JGDM", "B00F4GSAYI", "B00H6T0N1E", "B002I0HBZW", "B000QY9C90", "B000WSE2WM", "B000FRVCAA", "B00EVWZHLK", "B002BSA1MQ", "B000TI836G", "B008E6ZXRM", "B000FRVAD4", "B005VQ76U0", "B0022TNO7S", "B000SQ5LQ4", "B003L8HQ7S", "B0014CFO4K", "B001TOQ8MU", "B0015HZLVA", "B007P0X7IA", "0765367319", "B000P46NMK", "B005C2QSDY", "B000QW9D14", "B003ZSP0WW", "B00EVWYF0E", "B00320JDWG", "B001DTHT6U", "B005LBDOLA", "B007V2LMAM", "B00C71034I", "B005C2D2MO", "B001UWGDC6", "B007UMD1EI", "B005FDUSTA"], "bought_together": ["B002BSA20M", "B000FRU0NU"], "buy_after_viewing": ["B000FRU0NU", "B0050SYX8W", "B002BSA20M", "B00008J7NZ"]}, "salesRank": {"Video Games": 438}, "categories": [["Video Games", "Xbox 360", "Games"]]}