{"asin": "B00006HYKM", "related": {"also_viewed": ["B001UI4RTG", "B004Y5FBNI", "B00008SCFL", "B00005ARK3", "B005276QSQ", "B00006B9H9", "B00004SB92", "B004NBZ98K", "B003NZSX7G", "B0001MQSB2", "B006GDTTM0", "B002YLAUU8", "B0041LYY6K", "B00007KDVI", "B002HWRJY4", "B002RYYZZS", "B0062KA4VM", "B00008ZPJU", "B00C4OANW0", "B0040IUI46", "B001CN9K6E", "B0036R8FCO", "B001GF4SME", "B004N6259G", "B00IF0JAYE", "B00C1TSFH8", "B004N625AA", "B003CFATMY", "B00IF0JAIU", "B0062K951C", "B00D35XKW4", "B008IFXQIW", "B00005T6GZ", "B004H1PMJC", "B001AZP8EW", "B00005NWVJ", "B007KZQM9G", "B000QD7B6W", "B004T9RR7C", "B006QB1RPY", "B003B4AVSS", "B00F3JI47Y", "B00HEX851C", "B000069K98", "B00005NOKT", "B0042X3F76", "B000WIK61I", "B004XC6GJ0", "B004PA2B6C", "B00E37JODK", "B0000C0XS0", "B009SPNO1K", "B003CFATSS", "B00AJHDZSI", "B0000TW3RE", "B0014J07R2", "B002M3SJ6U"], "buy_after_viewing": ["B001UI4RTG", "B00D35XKW4", "B004XC6GJ0", "B001FWYGJS"]}, "title": "Netgear MR814 802.11b Wireless 4-Port Cable/DSL Router", "price": 99.0, "salesRank": {"Electronics": 78504}, "imUrl": "http://ecx.images-amazon.com/images/I/313NP4R703L._SX300_.jpg", "brand": "Netgear", "categories": [["Electronics", "Computers & Accessories", "Routers"]], "description": "Amazon.com Product Description When you connect your cable or DSL modem to the Netgear MR814 wireless router, you'll enjoy wired or wireless Internet access for all your computers, and you'll be assured of protected communications on your home or small office network. This three-in-one router, switch, and wireless access point allows you to share your Internet connection, files, and printers with other computers on the network.You'll be surfing the Web in minutes with Install Assistant to guide you through each step and onscreen help that's there when you need it. The unique Smart Setup wizard automatically detects your ISP connection type, saving you time and effort. Lighted, front-panel icons display status at a glance. The router works with PCs, Macs, and virtually all Ethernet devices.A sophisticated network address translation (NAT) firewall protects against Internet hackers, while a virtual private network (VPN) pass-through allows users secure access to corporate networks. Powerful encryption (40-, 64-, or 128-bit) protects against eavesdroppers, and address authentication restricts connections to specific wireless adapters--only those you approve are allowed to use your network. E-mails notify you of Internet activity, and content logging and filtering limit access to inappropriate Web sites.Roam your home and office with the freedom of a Wi-Fi notebook computer. Distribute MP3s, digital movies, and photos with ultrafast, wired LAN ports capable of speeds of 200 Mbps. Preprogrammed port-forwarding setups simplify playing multiplayer games and hosting Internet services. Share a single broadband connection with up to 253 users to give everyone simultaneous access to the Internet. The Netgear wireless router provides a powerful 2 dBi detachable antenna for longer wireless range, and delivers double the memory and a 50-percent-faster CPU than many popular routers.The Netgear MR814 comes with a three-year warranty.See a detaileddiagramof how to integrate the Netgear MR814 into your home network."}