{"asin": "B00ABDIIW8", "description": "Super Sized screenDo you feel there is not funny when you and your friends to play the game because the screen is too small?An wonderful movie can not be shared with others as the screen isn't big?Do you feel pain of eyes when you keep staring at a small screen?Haha..I guess you are looking for a Super Sized screen to watch all your favorite DVD and digital media?You have found your match!DVD Player with a stunning 13.3-Inches clear and vivid display,it will make you feel like you are watching in a cinema. Large screen can provide large screen imagine,rich color,high-resolution display also can solve all your problem270SwivelThe screen rotate 270 degrees,also horizontal rotate for 180 degrees,make it perfect for your home,car,plane or any place.Flip the rotation of the screen can give you the best viewing experience of maximum AngleCompatible with a Wide Range of Disc FormatsIt built-in DOLBY ecoder supporting MPEG-4 video decoding.It also compatible with most DVD/DVDR/DVDRW/VCD/MP3/CDRW/JPEG/DIVX,and you can even play your digital music burned to a CD-R,allowing you to enjoy your MP3-format files through the playerSupport USB/SD card/MS card/MMC cardIt is great that we can watch our favorite movie or listen to the MP3 music by the USB flash drive or SD card. How wonderful does it support SD card, MS card and MMC card direct playMobile DVD playerAre you looking for a DVD player can be watched without always connect the power charger? Yes,this is the best choice. This player built-in super power polymer lithium battery for up to 2 hours continuous play once it was fully chargedNote: This DVD Player just support Analog TV Not Digital TV&#x3000;", "title": "DBPOWER 13.3 Inch Portable DVD Player,270 Degree Swivel Screen, Support Analog TV/USB/Card Reader/ Game/FM Radio,Swivel LCD,RMVB,Built-In Rechargeable Battery", "price": 105.98, "imUrl": "http://ecx.images-amazon.com/images/I/51tEDSUgwxL._SY300_.jpg", "related": {"also_bought": ["B00IKMHSW8", "B00GYCWY70", "B008I641D0", "B00CHHGWZG", "B00AIG9L06", "B00005ASOO", "B000EHCYBC", "B008S08HJ0", "B000P5FH5I"], "bought_together": ["B008I641D0"], "buy_after_viewing": ["B00CHHGWZG", "B008S08HJ0", "B008I641D0", "B00CWWEU82"]}, "categories": [["Electronics", "Portable Audio & Video", "Portable DVD Players"]]}