{"asin": "B000WPXQSQ", "description": "Retaining the wit and deep gameplay of the previously released PS2Bullytitle,Bully: Scholarship Editiontakes place in the fictional New England boarding school of Bullworth Academy and tells the story of 15-year-old Jimmy Hopkins as he experiences the highs and lows of adjusting to a new school. Capturing the hilarity and awkwardness of adolescence perfectly,Bully: Scholarship Editionpulls the player into its cinematic and engrossing world set in the most vile and sadistic setting yet in a Rockstar videogame: the schoolyard. Laugh and cringe as you stand up to bullies, get picked on by teachers, play pranks on malicious kids, win or lose the girl, and ultimately learn to navigate the obstacles of the fictitious Bullworth Academy.Bully: Scholarship Editioncomes to the Xbox 360, boasting new content, next generation graphics, and two player mini-games that make this title appealing to previousBullyplayers and a whole new audience.New Content8 new missions, 4 new classes, hilarious new characters, added two-player mode, new unlockables, new rewards and achievements.VarietyWith 82 missions, 45 lessons, loads of mini games and collectibles, Bully provides over 30 hours of entertainment.CharactersOver 100 voiced characters to socially interact with among several social groups: jocks, nerds, preppies, greasers, teachers, townies, carnies and of course girls.ChoiceYou?re in charge. Decide whether you have a positive or negative effect when interacting or accepting missions; you can say hello to fellow classmates or deliver mean wedgies.Technological Upgrades:Use of next gen-graphical techniques including high resolution textures and dynamic lighting &amp; shadow system.Faster frame speed makes the game smoother and more responsive.Recreated and updated over 3000 textures and character models by hand to bring up to next gen standards.Improved full screen effects, including dynamic glow FX, improved depth of field, and heat and fire FX.Textures uprezzed by 4x over the originalBullyfor PS2.More pedestrians and vehicles are able to load at once which improves the visual variety of the game.Mini-games, including classes are easily accessible through the menu system.", "price": 52.91, "imUrl": "http://ecx.images-amazon.com/images/I/51Ni93jDbvL._SY300_.jpg", "related": {"also_bought": ["B0076ZPYPI", "0744009715", "B002I0HBZW", "B000ZK698C", "B0050SYILE", "B000BLM5PG", "B000HCQK0A", "B0010AYJXI", "B0022TNO7S", "B004QEV0MI", "B0050SYV70", "B008LW4SBQ", "B000ZKDOV2", "B000FRU1UM", "B0019MLWL4", "B0009SQFHA", "B005N4HBE6", "B001SH7YMG", "B003C1I0CO", "B003KM38EK", "B00BRQN2EM", "B000F3AADE", "B002BRZ852", "B000C427NM", "B003O6EB70", "B000XJO7A2", "B0045EI7I4", "B002EE5ROO", "B000R0PLK2", "B001E7MMNQ", "B005C2D2MO", "B002WSR8BC", "B001GJ306U", "B000G7PMXC", "B002V16T0Q", "B008J16ARY", "B002QHDKE8", "B0019R4VFS", "B00CV5ZNFO", "B00CLF832E", "B00149PCAO", "B002I0K50U", "B000MKA60W", "B0000A8VBZ", "B00BMFIXT2", "B00DBCAT3W", "B000PC4FYK", "B004HYK956", "B0050SY4DG", "B000FRVAD4", "B002I0JGDM", "B003O6G47U", "B00BG6ZHL4", "B000TG530M", "B00C71034I", "B002I0JAVK", "B002I0J9M0", "B000AX21VI", "0744012546", "B0050SYLRK", "B004CD9X2C", "B000HX1P72", "B001FEO72M", "B0009WPZM2", "B0085L2T14", "B0007ZD79E", "B005J5K9EI", "B0023CBY4E", "B000FZZ5UA", "B000SQ5LQ4", "B002I0H79C", "B0013RDX7Q", "B002I098JE", "B000OLXX86", "B006GHA8EE", "B00432O4VM", "B0025KZV7A", "B000NNFJQY", "B00319DX4W", "B000B6ML1Y", "B002DC8GKE", "B004FUL9YW", "B001ASJIRM", "B000XJNTPG", "B007Z3UUF0", "B007XVTR3K", "B000CRSBLQ", "B001CBW18K", "B003O6E9EK", "B0016NRS8M", "B00163LW7A", "B001D25M1Q", "B00269DXCK", "B0050SYOOA", "B004FSE52C", "B00AV0D9P2", "B002I0HAC6", "B000R0URWE"], "bought_together": ["B0050SYILE"], "buy_after_viewing": ["B0009SQF0C", "B0050SYILE", "B005N4HBE6", "B00BMFIXT2"]}, "salesRank": {"Video Games": 4108}, "categories": [["Video Games", "Xbox 360", "Games"]]}