{"asin": "B00AA3R3YI", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Headsets & Microphones", "PC Headsets"]], "description": "hile stereo audio is great for recorded music and television, when it comes to FPS gaming you really need more audio directionality, so you can hear when someone is ahead of you, behind you, or even overhead. In short, you need a Dolby 7.1 channel audio system, such as this 7.1 Channel Dolby Digital Amplified Gaming Headset from Monoprice!The headset is designed to connect to PC, Playstation 3, and Xbox 360 gaming systems, and comes with all the necessary cables and connectors. It supports both analog 2-channel and digital 7.1 channel Toslink (optical) input and is certified by Dolby for use with Dolby Digital 5.1, Pro Logic IIx, and Dolby Headphone modes.The headset uses a USB connection for microphone communications on the PC and PS3, or a 3.5mm TRRS plug for the Xbox 360 and Smartphones. It comes with two boom microphones, one designed for gaming and the other for mobile hands-free use with Smartphone. Additionally, it supports the Xbox Live Communication standard.The Digital to Analog Converter (DAC) creates the necessary phasing of the audio signal to the headset to produce a clear and accurate 7.1 channel soundstage, which provides the necessary audible queues you need to excel at FPS gaming. The DAC also allows for separate volume control over each of the 8 audio channels, so you can adjust it for the perfect soundstage balance.Although this audio system comes with only the single headset, the system supports up to two headsets. The headset from our Entry-Level Amplified Gaming Headset (PID 9770) can be used as the second headset for this system. Although the Entry Level system is not designed for 7.1 channel audio, the headset can produce a 7.1 channel soundstage using the DAC's internal phasing circuitry.", "title": "Monoprice 7.1 Dolby Digital Amplified Gaming Headset for Xbox 360, PS3 and PC (109770)", "price": 99.99, "imUrl": "http://ecx.images-amazon.com/images/I/41MbvJQ5liL._SX300_.jpg", "brand": "Monoprice", "related": {"also_viewed": ["B003VANOFY", "B002ZS6Y64", "B00275C2L6", "B008EQ1FVU", "B006W41X2C", "B006W41X18", "B00CQ35C1Q", "B00EXPNFQO", "B008KH7NZA", "B0057S9SYY", "B00F3SIIQ2", "B005T3GQLA", "B00A55U60O", "B00ICNUJGW", "B00ICOE8KE", "B00B1MVNG6", "B00C2B2Y9A", "B0057S9JQ6", "B00I9HARMC", "B00LN0O0VG", "B0057SDCLY", "B00CKFYAEA", "B005OMW1FG", "B00IAYJEP0", "B00EXPNFUA", "B00I9GZZGG", "B005HO1ULM", "B006ZS5ATM", "B00K08NLLW", "B006W41X36", "B00886XQNQ", "B00B1KJK22", "B00EXPNGCM", "B00EPAVKP0", "B00HV0I70M", "B00886XQO0", "B005KAK2FI", "B00B1MVNJI", "B00E5UHSYW", "B00AR1LX9O", "B007CS9WYI", "B001O5CCQK", "B00C2B355W", "B00ESESLQ4", "B006W41W4Q", "B002Q8IHEK", "B00BDS415I", "B00AUF6L80", "B00AA3R0MI", "B008HB4CXU", "B0042Y2F76", "B00EV00MZ8", "B00D96BO7K", "B00HV03GE4", "B006W41W3M", "B005QUQP7G", "B005FKT70O", "B008Y1KLME", "B00F3TSFKA"], "buy_after_viewing": ["B003VANOFY", "B00E5UHSYW", "B00EXPNFUA", "B00D96BMV8"]}}