{"asin": "B0041RRNBM", "description": "The EVGA GTS 450 FPB (Free Performance Boost) edition dominates the competition with more than 2x the DirectX 11 geometry processing power for unparalleled game realism in the hottest titles. GeForce your rig and gear up with the latest industry leading technologies like high performance NVIDIA GeForce drivers and incredibly realistic NVIDIA PhysX in-game effects.The EVGA GTS 450 features 192 CUDA cores, a high speed GDDR5 memory interface with 1GB onboard and full DirectX 11 support providing unrivalled performance and breathtaking image quality. Specifications include the GTS 450 (822 MHz core clock) chipset, 1024MB (1GB) of 0.5ns GDDR5 memory with a 3608 MHz memory clock and 57.7 GB/second memory bandwidth, 128 bit memory interface, 1645 MHz Shader Clock, 192 CUDA cores, and PCI Express 2.0 compatibility. Additional features include Microsoft DirectX 11 support, NVIDIA PhysX and NVIDIA PureVideo HD technologies, NVIDIA 2-way SLI readiness, NVIDIA 3D Vision Ready, NVIDIA CUDA technology with CUDA C/C++, DirectCompute 5.0, and OpenCL support, PCI-Express 2.0 support, OpenGL 4.0 support, Dual Link HDCP capability, and Microsoft Windows XP/Vista/7 support. Connections are 1 Mini-HDMI 1.4a connector and 2 Dual-Link DVI connectors. Package includes the EVGA Driver/software disc with EVGA Precision Tuning utility, 1 DVI to VGA adaptor, 1 6-pin PCI-E power adapter, and a one year warranty with a second year free if registered within 30 days at www.evga.com.", "title": "EVGA GeForce GTS 450 FPB (Free Performance Boost) 1024 MB GDDR5 PCI Express 2.0 2DVI/Mini-HDMI SLI Ready Graphics Card, 01G-P3-1450-TR", "price": 149.99, "imUrl": "http://ecx.images-amazon.com/images/I/51GdaCtfTBL._SY300_.jpg", "related": {"also_viewed": ["B00966IU4M", "B009M3UL9G", "B0041RRNDK", "B0046HAW7Y", "B008RIEOBS", "B00847LDKC", "B004S5CCP4", "B0086UXQES", "B00942TJXY", "B008Y8PNRA", "B003VKGZSM", "B008Y8PON8", "B0089KJRLG", "B007Z3T5JC", "B009T0FDR2", "B008Y8PNQQ", "B00FONIODI", "B00847TOLC", "B0086UXQIE", "B0089NPK28", "B009SPJ7PW", "B0083YIGVU", "B0062CWKCQ", "B00942TJFC", "B008AXRODA", "B0088TKS3Y", "B00966IU9W", "B00966IOYS", "B00549HZ7S", "B008AJKIN2", "B0083YIGXI", "B0085MPDJ8", "B00IDG3NDY", "B003EEMFTS", "B003V8AW92", "B004B8VL64", "B000MQICZ2", "B0088TKS20", "B0085MQNX8", "B00847TPH0", "B00FLMKHLO", "B00DYSV4KU", "B0049MPQA4", "B007RFYEQW", "B0096JZZ1U", "B0050I1PHO", "B004W3F9XO", "B004L9LT2Y", "B00A0HZOEA"], "buy_after_viewing": ["B009O7YU56", "B00966IREK", "B00966IU4M", "B00H09BB16"]}, "categories": [["Electronics", "Computers & Accessories", "Computer Components", "Graphics Cards"]]}