{"asin": "B0014ET6EM", "description": "Beginning as a penniless street-urchin your destiny is to become Albion's greatest Hero. But will your power lie in kindness or cruelty? Choose your own path to glory and experience how those choices change you and the world forever. A new life, a unique adventure - every time!&nbsp;Limited Collector's Edition includes:Bonus DVD- Includes new 'Making-of Feature' with Peter Molyneux and the team at Lionhead Studios and art galleryBonus In-Game Content (Requires LIVE account)- Includes \"The Hall of the Dead\" Dungeon, \"The Wreckager\" Legendary Cutlass Weapon and Spartan armor and energy sword48-hour Xbox LIVE Gold Trial Card -With Xbox LIVE Gold, players can show off their individual hero by inviting friends into their unique version of Albion or they can visit their friends' Albion, and earn additional gold, experience and renown to take back into their own&nbsp;Click the above images for a larger view&nbsp;Game Overview:Fable II will be a true sequel to the wildly successful original that sold more than 3 million copies, offering even more choices and building on the core gameplay theme of Fable where players&rsquo; every decision continually defines who they become. Fable II is an action role-playing game that truly allows players to live the life they choose in an unimaginably open world environment..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url('https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/callout-bg.png') repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px }Fable II - Limited Collectors EditionPlayers:1 Player2 Player Co-opSave File Size:10 MBFormat:16:9 Widescreen on HDTV 720p/1080i/1080pAudio:Custom SoundtracksIn-Game Dolby&reg; DigitalRoads Are For Chumps - Explore the landscape and openly roam the countryside in a world 10 times the size of the original Fable.Click to view largerShare the Experience - Dynamic co-op play allows for friends and family to join your games at any time online and off, and share your world.Click to view largerIt's All Up to You - Man or woman, good or evil, career and family or just you and your faithful canine companion - live life your way.Click for a larger viewSet 500 years after the original, &ldquo;Fable 2&rdquo; will provide gamers with an epic story and innovative real-time gameplay, including a massive amount of freedom and choice to explore a vast collection of dungeons, catacombs and caves in the world of Albion.Features:Choices, consequences:Fable II expands upon the scope and depth of the Xbox&reg; classic by creating a wider, more complex kingdom of limitless choices and consequences. Players can play as a man or woman, get married, have children, and live a life of their own design&mdash;all leading to different consequences.A land far, far away:Revisit the newly expanded world of Albion more than 500 years after the events of the original, where you are free to openly roam the countryside. For the right price, every house, hut, dungeon, and castle is for sale. See how the world grows and changes in incredible and unique ways in response to your decisions, as you rediscover Albion as if for the first time.Fight with ease:The new combat system allows players to truly master hand weapons such as swords and maces, ranged combat weapons including crossbows and guns, and an entirely new magic system. Mix combat styles and become everything from a master swordsman to a skilled ranger to an evil magic wielder, each utilizing a different single button on the Xbox 360&reg; controller.A hero's best friend:Your canine companion acts as friend, compass and protector. Feed your pooch and he will love you unconditionally, creating a bond that sets up emotion-filled journeys throughout the magical world.Experience the world together:For the first time in any next-generation RPG game, experience the expansive and immersive world with friends, using the new and exciting Dynamic Co-op Mode, bringing the long-awaited multiplayer function to the world of Fable II.External mini-games earn in-game gold:Lionhead Studios Ltd. provides an unprecedented experience to gamers through Xbox LIVE&reg; Arcade. Start earning in-game currency for Fable II later this year, even before the game's release to retail, by downloading and playing an Xbox LIVE Arcade title consisting of three mini-games. The Xbox LIVE Arcade title will allow gamers to purchase weapons, armor, and more for their hero. This first-of-its-kind experience can only be found on Xbox LIVE Arcade.", "price": 117.32, "imUrl": "http://ecx.images-amazon.com/images/I/51tbUGxukhL._SY300_.jpg", "related": {"also_bought": ["B002I0H7U6", "B002I0JGDM", "B00DBCAT3W", "B0001UEHP8", "0804161607", "0744010500", "B0050SY8UK", "B000K8YAKI", "B00KVQ78B2", "0744010497", "074401252X", "0441020062", "B0014CFO4K", "B000HCQJTC", "B004D9Q170", "B0041OWQU8", "B0002A2S26", "B0002IZICK", "B003UZ49PY", "B000QW9D14", "B005YR1VP2", "B00FS2XRIC", "B00EGMXTI8", "B002I0JFN8", "B00FYIXMHQ", "B0028A6V7Q", "B001CMJAP6", "B00GZ1GUT8", "B0016BTNTQ", "B000FRU0NU", "B000R0SS3Y", "B000B6ML1Y", "B00008XKZM", "B000HCQK0A", "B0044SA70M", "B00AA4FDT4", "B0050SYZS0", "B000K8ZTK8", "B0015HZLVA", "B00BJH11FQ", "B001REZLY8", "B000PD0HQE", "B001PKHRVE", "B001F6KSDM", "B001HWB68K", "B007ZQJN1Y", "B007SRM5MO", "B004A88W8K", "B000SQ5LQ4", "B004HC3NEM", "B00005NZ1G", "B0045ZIENQ", "B0050SYEYK", "B000F3AADE", "1937007405", "B007B5RIYI", "B0010AYJXI", "B0047TG2R0", "B00DNTRKDA", "B005185SDA", "B000ZKDOVW", "B000G75AL6", "0744012244", "B008E6ZXRM", "B001NX4DUQ", "B002I09286", "B0050SY4DG", "B0050SYY5E", "B00D9EPI38", "B007N90IG2", "B000R0URCE", "B002GPPPS4", "B001D7T2VM", "B002I0JA7E", "B00309XHD0", "B0050SXCQ6", "B001CMIUYS", "B001TOQ8UW", "B003O6EBRA", "B007UM59AC", "B0050SYBL6", "B007A7UJ4S"], "bought_together": ["B002I0JGDM", "B00DBCAT3W"], "buy_after_viewing": ["B00DBCAT3W", "B002I0JGDM", "B0001UEHP8", "0804161607"]}, "salesRank": {"Video Games": 13573}, "categories": [["Video Games", "Xbox 360", "Games"]]}