{"asin": "B00I054WFQ", "categories": [["Electronics", "Computers & Accessories", "Tablets"]], "description": "Product DescriptionA Touch CoolerThe beautiful Acer Iconia A1-830 is crafted from  premium materials for a sleek look and solid feel. It features a fast Intel&reg; CPU for smoother graphics rendering, a brilliant IPS* display that allows a  wide viewing angle, two speakers for a powerful audio experience, and a metal  back cover and mid-frame for added strength. Whether you&rsquo;re  browsing the web, watching a movie or playing the latest game, the Acer Iconia  A1-830 is everything you need in one handheld device to effortlessly navigate  your world.&nbsp;&nbsp;A Stylish Companion with Solid AppealWith  a premium feel that sets it apart, the Iconia A1-830 is ready for wherever life  takes you. Its clean, simple design fits perfectly in one hand and its sturdy metal cover and mid-frame are ready for action. Its elegant, silver-gray color and smooth finish looks  beautiful. The metal back cover gives a premium feel, while the metal mid-frame  ensures it can take life&rsquo;s knocks. &nbsp;&nbsp;The narrow bezel design reveals more, so reading your favorite book or playing the latest game is even more compelling. It's small enough to fit in your hand, yet has a larger screen and viewing area than a 7-inch tablet.&nbsp;Packing every feature you need into a beautiful, clean and simple design, the Acer Iconia A1-830 is still less than 0.32 inches thin. At only 0.83lbs., this tablet fits perfectly in your hand making it comfortable when reading e-books or browsing your favorite websites.Proven PerformanceConfidently navigate your world with the new Acer Iconia A1-830 in your hand. It's powerful Intel&reg; dual-core processor loads your favorite webpages lightning fast and makes the latest games look amazing. With super-low power consumption and up to 7.5 hours of battery life, you can also look forward to being entertained even longer when you&rsquo;re on the go.The  Android&trade; Jelly Beanoperating  system puts everything you need for searching, communicating, traveling,  shopping and more in the palm of your hand. You can use all the Google apps you  know and love, plus there are more than  700,000 apps and games available on Google Play. &nbsp;&nbsp;Captivate Your Senses&nbsp;&nbsp;Brighten your View of the World! IPS technology* provides a wider viewing angle of up to 178 degrees, ensuring images are bright and colors are consistent from every angle. The screen also features excellent touch resistance &mdash; a tap of the display reveals zero ripple effects.Expand your view of the world. The perfectly  sized display features a 4:3 aspect ratio. The larger viewing area, in  comparison to 16:10, provides a better web browsing experience.Two  speakers provide realistic and lifelike sound for enjoyment anytime,  anywhere.&nbsp; Listening to your favorite  music, watching a movie or playing the latest game is now much more immersive.&nbsp;&nbsp;&nbsp;PRODUCT VIEWS1&nbsp;&nbsp;2 MP camera2&nbsp;&nbsp;Microphone3&nbsp;&nbsp;Micro USB port4&nbsp;&nbsp;3.5 mm combo audio jack5&nbsp;&nbsp;Power button6&nbsp;&nbsp;Volume up/down button7&nbsp;&nbsp;microSD&trade; card slot8&nbsp;&nbsp;5 MP camera9&nbsp;&nbsp;Dual speakersSIZEDimensions5.45&rdquo; x 7.99&rdquo; x 0.32&rdquo;Weight0.83 lbsBATTERYCapacity4000 mAhBattery lifeHD video playback: Up to 7.5 hoursPROCESSINGCPUIntel&reg; Atom&trade; processor Z2560 1.6 GHzRAM/ROMRAM: 1 GB LPDDR2eMMC: 16 GBIMAGINGCameraRear camera: 5 MPFront camera: 2 MPSCREENDisplay7.9-inch LED-backlit LCD with IPS technology*1024x768 resolution4:3 aspect ratioWide viewing angle of up to 178 degreesTouch technologyCapacitive, 5-point touchCONNECTIVITYWireless LAN802.11b/g/nBluetooth&reg;3.0GPSGPS / GLONASSUSBMicro USB 2.0INPUT&nbsp; / OUTPUTSensorsG-sensorAudio3.5 mm combo audio jackMicrophoneTwo speakersEXPANSIONmicroSD&trade; card slotUp to 32GBOSAndroid&trade;Android&trade; 4.2 Jelly Bean", "title": "Acer Iconia A1-830-1633 7.9-Inch Tablet (Silver)", "price": 132.65, "imUrl": "http://ecx.images-amazon.com/images/I/41xs%2BPmJnzL._SY300_.jpg", "brand": "Acer", "related": {"also_bought": ["B00IHQ04O6", "B00HQOUOPO", "B00JGQDUWY", "B00IR0Y9MA", "B00J7I548E", "B00L1KZ5RQ", "B00J2RYMTW", "B00JXDIU3O", "B00CVD9M3A", "B00IHQAL30", "B00IHQAL3K", "B00JCSJ7XM", "B00JBMC64Q", "B00JXDIU5M", "B00JOF10SS", "B00IHQAL4E", "B00KAVSU6U", "B00JXDIU20", "B00IHQAL7G", "B00KU0W7BA", "B00JBMC4MA", "B00C76JYMK", "B00E83462I", "B00ICO6BVS", "B00DW2T2A2", "B00KAVSJJ8", "B00K1ZZYEG", "B00JGEXGLG", "B00JXCRWTI", "B00JKL8958", "B00JKL8944", "B00E4RVARM", "B00KAVSNF8", "B00JXCRX8I", "B00JKL899E", "B00JKL89A8", "B00IG323BM", "B00KNCA6F4", "B00JOUXHOS", "B00KNCA36G", "B00JBMC5F6", "B00K1F4YNI", "B00BR5FZPC", "B00J2RYE0E", "B00E4COERU", "B00EP6R3K0", "B009QZH7BU", "B00FFVYSE8", "B00H3QTTME", "B00KAVSQXC", "9966635270", "B00IK45USU", "B00K81O3K4", "B00I3YPKZA", "B00GXNLJL2", "B00DYQYLQQ", "B00FFVYSKW", "B0046XAROG", "B00FFVYSMK", "B006FQQQDI", "B00HWMPRNY", "B004G7D0EG", "B00C4PFDBA", "B00F72JW8M", "B00DKFF386", "B00CRNTDII", "B007KFXIDE", "B00HFMNZP8", "B007XZM6VG", "B00A29WCA0", "B00CES44EO", "B00HJC3GRG", "B00F3SOJ7O", "B00ET9L9U8", "B006CHML4I", "B00F3J4B5S", "B00K0S2J1A", "B003WGJYCY", "B002BBJMO6", "B00HAHFQL4", "B00IVPU786", "B00GM0OZ4O", "B00E37T58Y", "B00HQZGZ38", "B00EY6RJKA", "B005QX7KYU", "B00200K1TS", "B00FO12XY6", "B00BV1MVJ0", "B00I2LRLPG", "B00B4GGW5Q", "B006PJUO6K", "B009QZH7D8"], "bought_together": ["B00IHQ04O6", "B00CVD9M3A"], "buy_after_viewing": ["B00JGQDUWY", "B00CVD9M3A", "B00J8DL78O", "B00L1KZ5RQ"]}}