{"asin": "B000GIXIPK", "description": "Celebrating 20 years of vampire hunting action, the legendaryCastlevaniaseries is back with an all-new action packed adventure. Take control of two  heroes, Jonathan Morris, a vampire killer and his close friend Charlotte Orlean, a girl with tremendous magical ability. Amidst the chaos of World War II,  two mysterious sisters emerge, and design a plan to resurrect Dracula. Join Jonathan and Charlotte as they attempt to thwart the terrible plan to resurrect  Dracula.Fight vicious bosses as you play the character of Jonathan and  Charlotte.Choose which character you want to control on the fly.Explore the depths of the castle.Seek out the evil  Brauner.Game StorylineInCastlevania: Portrait of Ruin, players take on the role of Jonathan Morris and  Charlotte Orlean. During World War II, many lost souls from the global conflict were left to wander the world in search of salvation. Desperate to escape  their terrible plight, they sought to resurrect Dracula's Castle from the rubble of society, assisted by two mysterious vampire sisters. Now Jonathan and  Charlotte must work together to confront the two vampire sisters, and ensure that this villainous catastrophe is not unleashed on the world.GameplayEvolving the action-adventure gameplay that has been the series' trademark for 20 years,Castlevania: Portrait of Ruinlets players switch  freely between Jonathan and Charlotte as they proceed on their heroic mission, each with their own strengths, abilities and style of play. Players can now  utilize powerful combination attacks in which both characters unleash the full extent of their combat abilities to decimate the game's more than 100  different enemies and bosses. In their quest to stop Dracula's resurrection, Jonathan and Charlotte can collect and use different weapons, equipment, and  items to increase their overall skill level and acquire new abilities.As mentioned before, players can switch freely between both characters, a  necessary option to win the game. For instance, you need to analyze certain situations and carefully choose to play either Jonathan or Charlotte in order to  successfully battle against the vampire army. The two characters can also combine their powers to pull-off powerful combo attacks. Their combined abilities  are needed in certain parts of the castle in order to progress through the game.The game has two different endings. Both endings involve the prevention  of Dracula's resurrection, however only one actually involves the defeat of Brauner. Different choices allow for a uniquely diverse gameplay experience.Castlevania: Portrait of Ruinsupports the Nintendo Wi-Fi Connection with a limited cooperative play mode feature. There is an online shop mode used through  Wi-Fi as well. Players are able to put their items up for sale in a realistic marketplace. And perhaps best of all, when another player buys the item, the  selling player gains the money but doesn't lose the item.", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/51bf54WWD-L._SX300_.jpg", "related": {"also_bought": ["B001CU4EJ0", "B0009Z3K9E", "B003FBL86Q", "B002I0H1DY", "B00005BJ9G", "B000GABTVS", "B000QTD05W", "B005C2QSDY", "B001E27DLM", "B001TOMR6Q", "B000UZVL58", "B00008KU9T", "B00006F2ZR", "B00136MBHA", "B000CC196K", "B000R37S00", "B003VR5PPY", "B000GABOTU", "B002I0EH6I", "B001NJMMHG", "B004CVWETI", "B00171NYHM", "B00184219U", "B00KVRK39A", "B003UI518A", "B002I0GKIQ", "B001AF1NVY", "B001CU4EMW", "B000B69E96", "B000IOM45C", "B003S55EX2", "B002EWD02C", "B0009Z3K9O", "B0000A09EM", "B000Q6J51S", "B000FRV2UK", "B001A01FD0", "B00012BSJ4", "B0054J1LBO", "B002BS4834", "B0009Z3MQ0", "B000HE9LL8", "B00006M3R6", "B0050SVOXE", "B00GV4V8XC", "B001TOQ8UW", "B000JLL3UQ", "B0006TO2HM", "B003IOGPAO", "B001TD6SK8", "B001NJKHWI", "B0052WG9II", "B001TOQ8WU", "B0089X37NW", "B002VA593A", "B002AU0HZQ", "B002I094AC", "B002TDIEDG", "B002DC8GWW", "B001O1PAMC", "B0017HRZ26", "B00C1ZBFTW", "B000WCE9XK", "B001V135P4", "B000B8J7K0", "B003O6E7DI", "B002I09286", "B003O8EDUS", "B0009K7ESC", "B0009XEC02", "B003O6E800", "B003YVK5T8", "B00KWFY04A", "B0009XBWY6", "B00I5LMSE2", "B00B2QL2Y4", "B0033BJSDI", "B000FW4OHS", "B0012NWBH4", "B0019SY1D4", "B0016B4EEA", "B001QTW2HS", "B000SSQPU8", "B006OI3CTS", "B000GHG9VG", "B000CBCVFE", "B0088MVP3S", "B0050SVOHA", "B002I08WVY", "B00AKIPBNS", "0744010489", "B00GANWVJE", "B00019HNNC", "B000HE7KZC", "B002DY9KKM", "B001HB7K6I", "B001CRM3RI", "B002E6XY6U", "B00B67ZS3U", "B007CSF3GO"], "bought_together": ["B001CU4EJ0", "B0009Z3K9E"], "buy_after_viewing": ["B0009Z3K9E", "B001CU4EJ0", "B005C2QSDY", "B001TOMR6Q"]}, "salesRank": {"Video Games": 3403}, "categories": [["Video Games", "Nintendo DS", "Games"]]}