{"asin": "B002BDU89M", "description": "The Tivax HiRez7 Portable Seven-Inch Digital TV puts your favorite shows and movies in the palm of your hand. Perfect for toting around the house, taking on camping trips, or using as an emergency TV, the HiRez7provides portable entertainment in any environment. With this palm-sized television, over-the-air digital channels look great, and it offers many options for adding sources for your digital music, movies, photos, and more.The HiRez7offers:7-inch color screen.Integrated USB port and memory card reader.Built-in ATSC tuner for receiving over-the-air signalsYou May Also Want to Consider:Tivax HiRez7-DS Docking StationA built-in memory card reader lets you play popular digital media files.View larger.Enjoy digital TV whether you're at home, on camping trips, or traveling.View larger.Entertainment at Home and On the GoWeighing just one pound and measuring a compact 8.3 x 5.4 x 1.1 inches (WxHxD), the HiRez7goes anywhere you go for an easy way to enjoy TV, movies, music, and more. Use the portable TV at home, setting it up in whichever room you are working in. For instance, you can watch the game while you tinker in your garage without taking up valuable workspace.You can also add the HiRez7to your home's emergency kit so that you're be prepared for power outages and other emergencies. With this portable TV close at hand, you will be able to stay informed about disaster news and weather reports.Bring the HiRez7on trips and keep your kids entertained. Use the built-in parental control to regulate what television shows they watch or load your favorite videos onto the TV. The built-in 3.5-millimeter headphone jack and included headphones make the HiRez7a great companion for road trips. And for airplanes, it has an integrated USB port and memory card reader, so you can take your favorite shows with you and enjoy them as you travel.Please note that digital reception in the United States is poor when the TV is moving, such as in a vehicle. For best digital reception, the TV must be stationary.Digital-TV ClarityThe HiRez7's built-in ATSC digital tuner receives an over-the-air signal, and its magnetic antenna gives you great reception, so you can watch all your local channels on the bright, crisp, seven-inch screen that provides digital-TV clarity. The HiRez7also works with most cable hook ups, and its built-in stereo speakers offer great sound.Battery-Powered PortabilityWith the HiRez7, you can stay mobile for up to 120 minutes using the included Li-Ion rechargeable batteries. If you're on a road trip, you can conserve your TV's batteries by using the 12-volt car power adapter; if you're spending a day around the house, you can use the home power adapter and save battery power. A screen saver option also helps you extend battery life.Another option is theTivax HiRez7-DS Docking Station(sold separately), which gives you added mobility and extended playtime. The docking station accepts either 8 AA or 2 Li-Ion batteries and recharges the TV's batteries. Even when there's no power outlet nearby, you can connect your TV to the docking station for up to 150 minutes of extra playtime. The docking station also features speakers for enhanced audio.Enjoy Music, Movies, and Photos Everywhere You GoThe HiRez7plays many popular digital files, including JPEG, MP3, AVI, MPEG 1/2/4, and DivX, which means you can watch movies or listen to your favorite tunes using the HiRez7's optional USB cable. There's a built-in SD/MS/MMC card reader for even more entertainment options, and you can also use the TV as a large photo viewer to share your digital pictures with friends and family. The included A/V cables allow you to connect to a DVD player or gaming console and use the TV as an external monitor.An antenna, remote control, and car charger are all included.The Tivax HiRez7is covered by a one-year warranty.About TivaxTivax and its parent company, Michley Electronics, manufacture top-quality electronics that make life easier. Always a great value, their products are found in many OEM applications or on store shelves under famous brand names.What's in the BoxTivax HiRez7Seven-Inch Portable Digital TV, magnetic antenna, A/V cables, remote control, instruction manual, power adapter, car adapter, earphones, and Li-Ion batteries.", "title": "Tivax HiRez7 Portable 7-Inch Digital Widescreen TV (2009 Model)", "price": 79.99, "imUrl": "http://ecx.images-amazon.com/images/I/410YAcPt-IL._SX300_.jpg", "related": {"also_bought": ["B002ISTLKW", "B001FB568E", "B002T4M9FE", "B004JEVMJG", "B005Y1TNEE", "B000RKN4OM", "B00EZ51ZQY", "B002UXRXEG", "B009YR00MI", "B001RQ2YF0", "B005GREK8K", "B001APXO5C", "B00164H4AI"], "bought_together": ["B002ISTLKW", "B001FB568E"], "buy_after_viewing": ["B007FEEZ00", "B005GREK8K", "B00DTZNCCQ", "B002G0PYEE"]}, "categories": [["Electronics", "Portable Audio & Video", "Portable & Novelty TVs"]]}