{"asin": "B00CDY0DSA", "description": "HooToo HT-CR002 is an external USB 3.0 combo which combines USB 3.0 hub with super speed card readers. With this plug-n-play device you can enjoy 10 times faster data transfer rate than USB 2.0. The super speed card readers can support over 50 types of flash memory media cards.Compatible Card Type:SDXC (up to 2TB), SDHC, SD, CF, High-Speed CF(UDMA), MS, M2, Micro SDHC, Micro SD, UHS-ISpecifications:- USB Ports: 3 USB 3.0 ports- Card Slots: 4 slost.SD, CF, MS,Mircro SD/M2.- Power: 5V/2A PSU;- Compatibility: Backwards compatible with USB 2.0 and 1.1 devices.- Dimension:L*W*H 3.31*2.24*0.94 InOperation Environment:Windows XP, Vista, 7, 8, Mac OS X or laterPackage Includes:1*USB 3.0 HUB + Card Reader;1*5V/2A PSU; 1*USB 3.0 Cable;1*User ManualNote:- Users  using older versions of Windows XP or Mac OS X may need to install operating  system upgrades/patches to support the exFAT file system of many high capacity cards of 64GB or higher- Data transfer rates are subject to the speed of memory card itself. Currently only the SDXC, Micro SDXC and high-speed CF (CF+/CF 2.0/CF3.0/CF4.0/CF4.1 standard) cards can transfer at USB 3.0 speedHooToo Superior Product QualityWe only supply superior quality products. All of our products are brand new and manufactured by ours large hi-tech factories. All products strictly follow the standards of CE, FCC and RoHS, and are carefully inspected by a responsible QA team before packaging.", "title": "HooToo&reg; HT-CR002 External USB 3.0 Multi-in-One Card Reader (4 Memory Slots, Genesys GL3220 Chipset) &amp; SuperSpeed USB 3.0 3-Port Hub (VIA VL810 Chipset, 5V/2A Power Adapter, 3 feet USB 3.0 Cable), can read &amp; write: SDXC, SDHC, SD, CF, High-Speed CF, High-Speed MMC, MS, Micro SD, TF, Micro SDHC, M2 Cards", "price": 24.99, "imUrl": "http://ecx.images-amazon.com/images/I/41OuhI37BeL._SX300_.jpg", "related": {"also_bought": ["B00C7RXR72", "B00DGBL6W6", "B00821FDI8", "B005H3Q55E", "B009JI2KQ6", "B00C3X982S", "B0037ECAQ8", "B00IIJ6W4S", "B005ARQV6U", "B008EQYRRY", "B008ZGKWQI", "B009D79VH4", "B0088PUEPK"], "bought_together": ["B00C7RXR72"], "buy_after_viewing": ["B00EHC7USC", "B00BSED7S4", "B005ES0YYA", "B009D79VH4"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Memory Card Readers"]]}