{"asin": "B001G5ZTWM", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "When you&rsquo;re ready to experience a higher level of pacesetting technology and image brilliance, the PowerShot SD990 IS Digital ELPH is ready for you. One glance at the sleek sculptured profile, and you know this is a camera driven by design and features. Style without compromise is the perfect complement to the ELPH model&rsquo;s most advanced feature lineup--engineering leadership that opens your eyes and imagination to the real potential and boundless pleasures of photography.PowerShot SD990 IS Highlights14.7 megapixels deliver outstanding detailPowerful curves house a 14.7-megapixel Digital ELPHThe PowerShot SD990 IS Digital ELPH is all about firsts. It&rsquo;s the very first ELPH to offer you the contemporary cool of pure black--making the boldest camera contours seem even more dramatic. When classic style reflects your fashion sense, indulge in the satiny glow of silver tone. Both are the very image of photography at its best, featuring megapixels that&rsquo;s the highest resolution among Digital ELPH to capture every detail of the world around you. There&rsquo;s never been a better time to think big, knowing that every enlargement will be sharper and more full-of-life than you&rsquo;ve ever experienced before.3.7x optical zoom with Optical Image Stabilizer for blur-free shootingThe PowerShot SD990 IS Digital ELPH has 3.7x optical zoom. A zoom opens up a world of possibilities in your photography, and thanks to innovative Canon engineering, it&rsquo;s housed in a camera that&rsquo;s sized to go everywhere with you. With many cameras, hand-held shots taken at the long end of the zoom can be marred by blur. The SD990 IS Digital ELPH incorporates Canon&rsquo;s exclusive Optical Image Stabilizer. The technology detects and effectively cancels camera shake, for clear, sharp images every time.3.7x optical zoom in actionOptical viewfinder plus large high-quality 2.5-inch PureColor LCD IIThe PowerShot SD990 IS Digital ELPH gives you large 2.5-inch LCD screen for excellent control when framing your shots. Canon&rsquo;s PureColor LCD II offers spectacular color, resolution and contrast even when viewed at an angle. The screen is highly durable and easy to see in any light with a scratch-resistant, antireflective coating. It also features Night Display for easy viewing in low light--a perfect feature for gathering friends and family around to see your images.New DIGIC 4 Image Processor improves Face Detection, adds Servo AF, Face Detection Self-Timer and Intelligent Contrast CorrectionDIGIC 4 Image ProcessorCanon&rsquo;s proprietary DIGIC Image Processors have long set its cameras apart from the competition, and the new DIGIC 4 sets the bar even higher. Faster, more accurate noise reduction delivers better image quality, even at high ISO speeds.iSAPS Technologyis an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the advanced DIGIC 4 Image Processor to improve focus speed and accuracy, as well as exposure and white balance.A newFace Self-Timerautomatically detects an increase in the number of faces and makes the appropriate adjustments. For instance, to include photographer&rsquo;s face in a group shot, there&rsquo;s no need to rush in. Just put the camera on a stand or tripod, and specify Face Self-Timer, and the camera will wait for the photographer&rsquo;s face to get on-camera before it takes the shot. Motion Detection now tracks moving subjects in a much larger range, and the new Servo AF retains focus on a moving subject after the shutter button is pressed halfway -- allowing you to wait for the perfect shot without refocusing. Also, Face Detection and Motion Detection are markedly improved.Intelligent Contrast CorrectionDIGIC 4 also makes possible the new i-Contrast (Intelligent Contrast Correction) system, which controls the compensation level in pixel units to brighten dark areas while leaving bright areas unchanged for better images where the main subject is dark, and more natural transition. The PowerShot SD990 IS Digital ELPH can even use i-Contrast in playback mode to adjust images that were shot without the setting activated.Red-eye Correctionprovides three options for removing red-eye from subjects in flash pictures.1) The Red-eye Correction during shooting actually identifies and corrects red-eye in human subjects as pictures are taken.2) The SD990 IS Digital ELPH can be set to automatically detect and correct red-eye during image playback.3) You can manually locate any red eyes in a scene during image playback on the LCD screen, and command the camera to remove them.Life doesn&rsquo;t give you second chances to capture special times. That&rsquo;s why the SD990 IS Digital ELPH features ISO 1600 and High ISO Auto settings that reduce the effects of camera shake and sharpen subjects in low-light situations, giving you greater shooting flexibility. ISO can be expanded to 3200 when you select ISO 3200 Special Scene mode.A Wide Range of Shooting Modes to Capture AnythingWhen you don&rsquo;t want to control the shots, the PowerShot SD990 IS Digital ELPH offers the satisfying option of Quick shooting mode. The camera&rsquo;s LCD screen turns off and the viewfinder displays the scene while framing. When the moment you want to shoot the focused moving subject comes along, this feature makes lag time shortest to capture the subject quickest. If the camera focuses on faces, the faces are also detected in the frame.With 21 Shooting Modes including 16 Special Scene Modes, you&rsquo;re ready for whatever shot comes your way.Print/Share Button for easy direct printing and downloadingThe PowerShot SD990 IS Digital ELPH's Print/Share button makes direct printing easier than ever. Simply connect the SD990 IS Digital ELPH to a Canon PIXMA Photo Printer or SELPHY Compact Photo Printer or any PictBridge compatible photo printer, press the lighted Print/Share button and print! Also use the Print/Share button to transfer images to a computer (Windows and Macintosh).Print your own ID photos in up to 28 different sizes or use the Movie Print function to output multiple stills from a recorded movie on a single sheet with a Canon SELPHY Compact Photo Printer.What's in the BoxPowerShot SD990IS Digital ELPH bodyWrist Strap WS-DC7SD Memory Card SDC-32MBattery Pack NB-5LBattery Charger CB-2LXAV Cable AVC-DC400Interface Cable IFC-400PCU (USB)Solution Disk", "title": "Canon Powershot SD990IS 14.7MP Digital Camera with 3.7x Optical Image Stabilized Zoom (Black)", "price": 599.0, "salesRank": {"Camera &amp; Photo": 7591}, "imUrl": "http://ecx.images-amazon.com/images/I/41g2GNuOYhL._SX300_.jpg", "related": {"also_viewed": ["B0075SUII4", "B001SER47Y", "B00HV6KL3W", "B0075SUIEI", "B004HW73SO", "B0075T7NW2", "B001SER48S", "B002LITT42", "B00AWYMXZY", "B001SER492", "B00I58LVKC", "B0011ZK6OS", "B002LITT3S", "B0091T97J6", "B000EMWBV0", "B001SER47O", "B00728ZAFS", "B005IGVXJS", "B0075SUK14", "B004HW73S4", "B00427ZLRO", "B001G5ZTYA", "B0035FZJKI", "B000Q30420", "B0011ZK6PC", "B0075SUKBO", "B00BOYFX30", "B001SER4BK", "B0035FZJJ4", "B001SER46A", "B0076W0LNQ", "B0075SUJBA", "B002LITT5Q", "B000N44XPG", "B002LITT7E", "B002CGSYL2", "B002LITT56", "B004J41T7Q", "B006UMM1AY", "B000AYGDIO", "B00728ZBA2", "B009B0MYSQ", "B00AWYN0BU", "B00B5HE3UU", "B001OMI29Y", "B004J3V8UU", "B0013TUG5G", "B00B46XLT6", "B005I6DVC0", "B006UMM1Y0", "B00HLDFNKQ", "B001SER49M", "B004J3YCGM", "B00EFILNV8"], "buy_after_viewing": ["B003VNKNF0", "B003VNKNEQ", "B00AWYMXZY", "B000NK5Z8Y"]}}