{"asin": "B001RNOHDU", "related": {"also_bought": ["B0028N6YH0", "B000067RBT", "B001S14DYO", "B00004Z5CP", "B009Q88Q76", "B00EVWX8R0", "B00A14ZT8S", "B004G3WCNK", "B009H0XQQY", "B00E3W1726", "B006YG9EEW", "B006V9AUMC", "B00IKMJA3S", "B006JH8T3S", "B007GMPZ0A", "B00429N18S", "B0088PUEPK", "B00CO8TBOW", "B0083J8DKE", "B00C7RIL3C", "B005H3Q59U", "B00F3ZN0CC", "B00E3W19MO", "B00AJHBBOI", "B009ZN2NH6", "B0036E8V08", "B003NREDC8", "B00BCEK2LA", "B000OGX5AM", "B0033Z2BAQ", "B0046TR4IW", "B000JE9LD4", "B005BZNDS0", "B002GHBUTK", "B00EZ9XKCM", "B00EB7UIRS", "B00H09BOXQ", "B0041BT21M", "B00CO8TBQ0", "B00DMCVKMU", "B004LU1U2M", "B000JEC7CQ", "B005T3GRLY", "B00B7JLZUC", "B000UEZ36W", "B001E1Y5O6", "B009UEBQIM", "B00BQ8RM1A", "B002HWRJBM", "B007PJ4PN2", "B004CAGDUA", "B00EB7UIXM", "B004RORMF6", "B00CRJWW2G", "B00ALK3KEM", "B00007FGU7", "B006QB1RPY", "B001TH7GUU", "B003L1ZYYM", "B007NJ0S1W", "B005O65JXI", "B000AJIF4E", "B0019EHU8G", "B004GUS4XK", "B003NR57BY"], "bought_together": ["B000067RBT", "B00004Z5CP"], "buy_after_viewing": ["B0028N6YH0", "B001S14DYO", "B00CD1PTF0", "B0027VT6V4"]}, "title": "Creative GigaWorks T20 Series II 2.0 Multimedia Speaker System with BasXPort Technology", "price": 81.65, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41roQHWFtzL._SY300_.jpg", "brand": "Creative Labs", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]], "description": "Creative GigaWorks T20 Series II 2.0 Multimedia Speakers put depth in your music and soundtracks without adding clutter to your desk. The sleek, compact speakers produce realistic sound without a bulky subwoofer thanks to BasXPort technology and a two-way speaker design for clear mids and highs. You can even add to your entertainment options by connecting your MP3 or CD player to the front auxiliary input.The woven glass fiber cone drivers and cloth dome tweeters provide broad, crisp audio.These space-saving satellite speakers have a two-way design to deliver robust sound.View larger.Audio to Complement Your Music and MoviesIt's no secret that the small speakers built into most laptops and desktop computers leave a lot to be desired. The GigaWorks T20 Series II Speakers allow you to get the most from your movies, music, and gaming by providing rich, complete sound.A woven glass fiber midrange speaker works together with a cloth dome tweeter to create a high-quality sound delivery system. BasXPort technology produces the deep tones for impact when playing games, watching movies, or listening to your music.Small Speakers That Deliver Big SoundIf your desk space is at a premium, you'll appreciate the T20 Speakers' sleek design. Each speaker generates a powerful, robust sound from 28 watts of total power. A 50 Hz to 20 kHz frequency response and 80 dB signal-to-noise ratio mean that these speakers cover the sound spectrum with efficiency, producing clear, precise highs, mids, and lows.Convenient Control and ExpandabilityDial in the perfect sound to match your needs with the front-mounted bass, treble, and volume controls. A front auxiliary input allows you to plug in your digital music device or CD player, making it easy to listen to your digital music library. And a headphone jack lets you enjoy music and movies without disturbing those around you.Each Creative GigaWorks T20 Series II Speaker measures 3.3 x 9 x 5.6 inches (WxHxD) and weighs 1.1 pounds (2.2 pounds total).What's in the BoxGigaWorks T20 Series II Speakers (left, right), stereo-to-stereo audio cable (6 ft.), dual RCA-to-stereo audio TV adapter, power supply adapter, Quick Start leaflet.The sleek T20 adds style to your sound system and its surroundings."}