{"asin": "B000AP05BO", "description": "Slip on a pair of QuietComfort 2 headphones and hear your music come alive. Decades of Bose research combine with their Acoustic Noise Cancelling headphone technology to deliver the ultimate in audio performance. This award-winning technology electronically identifies and reduces the unwanted noise around you (on buses or trains, in the office, even at home). So you hear more of what you want to hear ? and less of the tiresome sounds that have so often distracted you. Proprietary TriPort headphone technology also helps give you incredible headphone audio performance while keeping the design compact and streamlined. QuietComfort 2 headphones are lightweight and comfortable, and whether you take them on a trip or to the office, they will fold flat to store easily in a bag or briefcase. A single detachable audio cable gives you easy access to portable players, home stereos and in-flight entertainment systems, all with less tangling than two-cable designs. That same cable can be removed so your headphones can go cordless when you simply want the benefits of noise reduction Features:  Bose Acoustic Noise Cancelling headphone technology. These patented technologies electronically identify and reduce unwanted noise while faithfully preserving the music, speech or silence that you desire. Bose Acoustic structure of the TriPort headphone. This proprietary system utilizes three small ports in the earcups to produce a rich audio performance that?s remarkable for headphones this small. QuietComfort ear cushions. Proprietary cushion design establishes a critical acoustical seal between the headphones and your head, enhancing noise reduction and helping to maximize sound quality. &nbsp; &nbsp;", "title": "Bose QuietComfort 2 Acoustic Noise Canceling Headphones (Old Version)", "price": 269.0, "imUrl": "http://ecx.images-amazon.com/images/I/41YrfM6%2BIvL._SY300_.jpg", "related": {"also_bought": ["B0073UIS40", "B0073H2WP4", "B0080BK4I4", "B009IV5Z34", "B005CSPHYY", "B005KJMTXM", "B008VM84NY", "B005C1U8QS", "B0054JJ0QW"], "buy_after_viewing": ["B0054JJ0QW", "B0073H2WP4", "B0080BK4I4", "B0081XAXXM"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]]}