{"asin": "B001DZJVO2", "description": "The convenient all-in-one Toshiba 15LV505 LCD TV with integrated DVD player.Jack pack on the back.Key Features15.6-inch widescreen, TFT LCD displaythat's great for viewing standard, high-definition programming. The display also features a 250 cd/m2 brightness rating, 500:1 contrast ratio, and a 5ms response time.Native 720p HD resolution(1366 x 768)170-degree horizontal viewing anglefor easy viewing from the side (150-degree vertical viewing angle).Built-in slot-loading DVD playerthat's also compatible with DVD-R/RW, standard audio CDs, and CD-R/RW media. Other features include digital picture zoom, fast scan, slow motion, and multi-camera angle selection.Play MP3 files burned to discDolby Digital and DTS compatible outputmulti-channel audio experience and unsurpassed three-dimensional audio performance rivaling the best movie theaters. You can also connect this TV to a DTS-compatible receiver/decoder via its digital audio output for playback of high-resolution multi-channel DTS-encoded DVDs and CDs.Bottom mounted stereo speakerswith bass and treble controlsCinema Mode for brilliant playback of films on DVDColorStream HD component video inputdelivers a clean picture to your TV via three cables (color-labeled in green, blue, red; also referred to as Y/Pb/Pr) and keeps all of the picture elements separate, increasing color resolution.V-Chip parental controlsClosed captioningTri-lingual onscreen menusin English, French and SpanishIncluded remote controlMeets ENERGY STAR 3.0 certificationsConnectionsComponent: 1 (with 1 pair of left/right analog audio inputs)Composite A/V: 1 (with 1 pair of left/right analog audio inputs)S-Video: 1RF antenna input: 1Digital audio output: 1Headphone jack: 1DimensionsTV with stand: 15.84 x 12.61 x 5.52 inches (WxHxD); 7.7 poundsWhat size TV should you get?Learn MoreCOMMENT: ==========================================Which Size HDTV is Right for My Room?With standard-definition TVs, the rule used to be that viewers would feel comfortable watching a set from a distance of 3 to 6 times the screen size in inches. With HDTV, the resolution is so much better that you can sit closer to a larger TV without noticing the pixels. So with HDTVs, the rule tends to be you can sit anywhere from 1.5 to 3 times the screen size (in inches) for the best experience.If you know the size of the room you have already, where you want to sit, and where your new HDTV should go once you get it, you can figure out the size HDTV you should get.Minimum size = Viewing distance/3Maximum size=Viewing distance/1.5&bull;&bull;&bull;&bull;&bull;&bull;&bull;&bull;&bull;&bull;&bull;&bull;&bull;&bull;&bull;&bull;&bull;&bull;&bull;&bull;&bull;&bull;&bull;&bull;&bull;&bull;&bull;&bull;&bull;&bull;&bull;&bull;&bull;&bull;&bull;&bull;Toshibas new line of LCD TV combination models delivers a convenient all-in-one entertainment experience that can be integrated into any room of the house, whether its the kitchen, bedroom or home office. Focusing on functionality and versatility, Toshibas full line of feature-packed LCD TV combos is available in 15, 19, 22 and 26-inch screen sizes (measured diagonally), and each of these space-saving sets features a thin profile and a design for the style-conscious consumer. With the February 2009 digital TV transition quickly approaching, many consumers are in the market to purchase a new digital TV to replace an old analog set. Toshibas LCD TV combination lineup includes a built-in digital tuner in every model. In addition to the extensive features detailed above, all of Toshibas new LCD TV combination models will meet ENERGY STAR 3.0 certifications. Petite and packed with features, the 15LV505 LCD TV/DVD combo is a great addition to kitchen counters, spare rooms, or dorm rooms. The portable size makes it easy to enjoy movies anywhere in your home. Features: * 1366 X 768 Pixel resolution * Built-in slot loading DVD player that plays DVD/DVD-R/DVD-RW/CD/CD-R/CD-RW/VCD * Built-in ATSC/NTSC/QAM digital tuning * Wide aspect ratio", "title": "Toshiba 15LV505 15.6-Inch Widescreen LCD TV with Built-in DVD Player (Black)", "price": 170.12, "imUrl": "http://ecx.images-amazon.com/images/I/41PnibuYtRL._SY300_.jpg", "related": {"also_viewed": ["B008O5112Y", "B00DQXUX4G", "B005GM6H8G", "B003WZFYYW", "B00369T01W", "B00406YHLI", "B002RGDZ1Q", "B00HLOC52Y", "B00BCGRZ04", "B00FR6SQFS", "B005Z44QSI", "B005GNR9G4", "B00865OIUO", "B00BLH1UG4", "B003OBOBY8", "B004YOGN4A", "B004MFFD2Y", "B0057INQX8", "B00BCRZN6G", "B0075W97NW", "B007DCBHMI", "B008AXRW78", "B00BLH1UE6", "B00I13L25K", "B00FR6SP4K", "B002G0PYEE", "B00BCS0WY8", "B0057WXA6C", "B007FEEZ00", "B00DB9OONG", "B003LYNDSI", "B00HZI0XNE", "B0071CVTAK", "B005EKJC78", "B003L0QEX8", "B0007Y6AI0", "B004HG056M"], "buy_after_viewing": ["B00BCGRZ04", "B00BCGRZ04", "B00DQXUX4G", "B008O5112Y", "B005GM6H8G"]}, "categories": [["Electronics", "Television & Video", "TV-DVD Combinations"]]}