{"asin": "B0002SQ0AY", "description": "Any game featuring a hero with an extreme bowl cut is going to have to try a little bit harder to endear itself to the gaming community. Fortunately, with outstanding gameplay trumping its predecessor and a plot to rival today's global power struggles, Suikoden IV covers more than enough ground to compensate for the fashion follies of its nameless hero (\"Buster\" in my playthrough. Try it. It works). From the little touches like dilated pupils and oddly satisfying death animations to the grand world-enveloping storyline, Suikoden IV is a unique and gratifying RPG experience for gamers seeking something a little different.As fans of the series have come to expect, the battle system for Suikoden IV has been entirely reworked. Though characters can still perform combo attacks with each other, the pairing system from the previous game has been scrapped in favor of a more traditional four-person lineup, with each warrior acting individually. To give the combat a little more variation, you'll occasionally have fights that depart drastically from the standard form: Ship battles have you firing your rune cannons across a grid-based battlefield, and the one-on-one duels (think \"Rock, Paper, Scissors,\" but with swords) make a return. Though these additional combat styles are simplistic, they are still great fun, and a welcome deviation from the normal pattern.With the numerous entertaining battles and engaging story, part of me wants to wholeheartedly recommend Suikoden IV, but it gets hamstrung in a couple of important places. First of all, with the advent of recorded dialogue, the whole \"silent hero\" concept has ceased to be endearing, and instead makes every story point surrounding him awkward. The supporting cast typically won't even do the \"What was that? You want us to attack?\" work-around, which renders your main hero a strangely mute non-presence in the events determining his fate.Perhaps the biggest detriment to Suikoden IV can best be characterized by Milhouse Van Houten's immortal utterance: \"When are they going to get to the fireworks factory?\" There are always exciting events just looming on the horizon, but many require bouts of oceanic exploration before they unfold. Here's the problem: your ship moves like a landmass with sails, and random encounters spring up every five seconds or so. This means that every time you need to go exploring, the game is artificially extended by about 45 minutes because of the inordinate amount of time it takes to traverse even a small expanse of the ocean.Fortunately, between these bouts of tedium (which aren't a constant problem), the story progresses at a respectable clip, with plenty of revelations and a steady influx of new members to keep your party interesting. Add to that several moments in the story that will leave you staring at your screen slack-jawed in awe, and you have an outstanding adventure that rewards you well for your perseverance. Wisely borrowing elements from classics like Final Fantasy X and Chrono Cross, at its best moments Suikoden IV sits right up there with the most outstanding RPGs ever created.Concept:Another 108 Stars of Destiny are in desperate need of rallying. Get crackin'!Graphics:Crisp, colorful visuals (especially running in 480p) and a stunning oceanic setting puts this entry leagues ahead of its predecessorsSound:The score is beautiful, and the addition of voice acting (except for the silent hero) breathes life into the worldPlayability:The new battle system is fast and fun, but controlling your ship is like driving a soggy sweaterEntertainment:When it's good, it's amazing. When it's bad, it utterly stifles the urge to continue playingModerateRated:8.5 out of 10Editor:Joe JubaIssue:February 20052nd Opinion:While not as emotionally charged as the triptych tale of its predecessor, Suikoden IV's story lures you in with uncertainty and the sinking feeling that a terrible fate will befall your character and the world. The inclusion of excellent spoken dialogue helps flesh out the characters, but for some reason, Konami opted to keep the lead character silent. This absolutely drove me nuts. People are conversing with him, why is he just standing there? Your main character may seem like a ghost at times, but Konami did a tremendous job with the supporting cast. Combat has also improved dramatically, and thankfully, Konami has ditched the horrendous teammate system from the previous iteration. I love how the Rune of Punishment has a backlash, and combo attacks are always fun to watch. Ship battles are a bit simple, yet are a nice addition, and nothing beats questing for all 108 of the Stars of Destiny. Once again, Konami has crafted one of the finest RPGs to date. Don't miss it.Rated:8.75 out of 10Editor:Andrew ReinerSubscribe to Game Informer", "price": 46.01, "imUrl": "http://ecx.images-amazon.com/images/I/512DSKE0VQL._SY300_.jpg", "related": {"also_bought": ["B00006LEMK", "B000CC5CHW", "B0009Z3KB2", "B00001X50L", "0744004780", "B0002GTFIK", "B0009A4EUI", "B000G7X5P4", "B000R2YWEQ", "B00002STPG", "B00006LEM8", "B000G77X34", "B0009A4EV2", "B00005T7ZP", "B000AVBFU8", "B00005BW7Q", "B0002CHJAA", "B000DZTRHE", "B00007KQC1", "B000784XG2", "B000BKSGH8", "B000G82R20", "B00005T7ZN", "B000G7X5MM", "B00004ZDFY", "B00006FDLM", "B00008KTRS", "B00008W2R8", "B000F5IH2I", "B00006Z7HR", "B001H8Y7DA", "B00029QQNY", "B00006C28X", "B00024W1U6", "B000E0VMVM", "B0001A86EG", "B000FPGZUE", "B000TLU67W", "B000IONGU4", "B00000K39I", "B001E7MMOK", "B000NGQ26C", "B0009K7ESM", "B0009A4ETY", "B000FUG5TK", "B00004TC6E", "B00005TNI6", "B00005LOXE", "B00008URUA", "B002I0J4AM", "B000FDOTIQ", "B001QTW2GY", "B000CSUKY6", "B000F8O1C0", "B001UIG6M2", "B00004S9AF", "B00009MVJ7", "B00006B5T8", "B00004RBQX", "B00019HNNC", "B000006OVE", "B0009PKDP8", "0804163448", "B0000296O5", "B000R36ABS", "B000784XEE", "B0015HZLVA", "B00005OLWB", "B00004YRQA", "B000E5N4RW", "B001GMSHSI", "B00004XMRL", "B00D87TCN8", "B000OQ1XAQ", "B0002IASJ8", "B000TIPWI8", "B0014CN2H6", "B000784XGW", "B00005MA97", "B0007XTNGW", "B001C6GVI6", "0744007577", "B00024W1UG", "B000R37S78", "B0015ACX3Q", "B000239DZ8", "B0009XBWY6", "0744006465", "B00004SPW9", "B0009A4EVM", "B0000CDZBC", "B000066TS5", "B000641ZEU", "B00000IM2T", "B001G3B0HC", "B00004Y57G", "B004TMGZ9K", "B0007CGBDG", "B0001XAO4S"], "bought_together": ["B00006LEMK", "B000CC5CHW"], "buy_after_viewing": ["B00006LEMK", "B0002GTFIK", "B000CC5CHW", "B0009Z3KB2"]}, "salesRank": {"Video Games": 4050}, "categories": [["Video Games", "More Systems", "PlayStation 2", "Games"]]}