{"asin": "B000QY9KIS", "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]], "description": "DriveWire is the ideal solution for transferring the data from a desktop or notebook PC to a new hard drive in a few easy steps. It makes what can otherwise be a daunting and tricky process, painless and easy. DriveWire is bundled with Apricorn's \"Upgrade Suite\" which features the award winning \"EZ Gig IV\" cloning software for Windows and \"Shirt Pocket's SuperDuper!\" for Mac. When used together, DriveWire makes it easy to transfer your OS, data, applications, documents, address books, e-mail, settings and preferences - from the old drive to a new drive, in few easy steps. Start by attaching the new 2.5\" or 3.5\" hard drive to the appropriate connector on DriveWire's cable head. Then connect the AC power adapter and the USB cable. Now, boot up your computer using the \"Upgrade Suite\" bootable CD and make and exact clone of the old drive onto a new drive. After the transfer is completed, install the new hard drive into the desktop or notebook, and the computer will boot up just like normal. DriveWire includes: Apricorn's Upgrade Suite with EZ Gig IV Cloning & Upgrade software for Windows and Shirt Pocket's SuperDuper! for Mac, a hybrid adapter that connects to any 2.5\" , 3.5\" IDE/PATA or SATA Hard Drive, USB 2.0 cable (USB 1.1 compatible) and high quality UL Listed power adapter. This unique adapter provides a SATA connector for the new style drives as well as 44 pin connector for a 2.5\" Notebook IDE/PATA Hard Drive and 40 pin connector for a standard 3.5\" IDE/PATA Hard Drive, allowing you to connect a hard drive to any desktop or notebook computer with a USB 2.0 port. This is the perfect solution for anyone needing immediate or temporary access to a Hard Drive. You won't need to buy a different enclosure for every Hard Drive or worry about whether or not you have enough power through your USB ports run the device. Because DriveWire is guaranteed to safely provide all the power you need and it is compatible with all of today", "title": "Apricorn DriveWire USB 2.0 to IDE/PATA/SATA Universal Hard Drive Adapter ADW-USB-KIT (Red)", "price": 35.92, "imUrl": "http://ecx.images-amazon.com/images/I/41kjh8%2B2QrL._SX300_.jpg", "brand": "Apricorn", "related": {"also_bought": ["B001OORMVQ", "B001AAVA08", "B005C983NA", "B000J01I1G", "B00BD30MZG", "B00HJKP220", "B0001Y8UCU", "B0088PUEPK", "B005CT56R6", "B003CHANJG", "B003U3LUOY", "B005JFUI6M", "B00EDLYAZI", "B0010494TS", "B00425S1H8", "B001PBQ9K8", "B002BH3Z8E", "B00EFRME1C", "B007PODI1W", "B00DSUTWMQ", "B00AWLRLYK", "B009NB8WRU", "B00DSUTVYK", "B00E3W19MO", "B009GUXU52", "B00CPGYNV4", "B00CPGWL7C", "B00B99JUBQ", "B005OTPVMY", "B003CFATR4", "B004I5UDO6", "B003MTTJOY", "B00DTPYT78", "B00E3W1726", "B004CJ8DNG", "B00C2CA3N8", "B000UO6C5S", "B00DSUTX3O", "B00E9MD700", "B00006RVPW", "B00BQ8RM1A", "B007I5JT4S", "B009KZ20D6", "B00JHKSMIG", "B008JJLZ7G", "B00DZYEXPQ", "B008EQZ25K", "B00H09BOXQ", "B005QXX0MG", "B003XS9DY0"], "bought_together": ["B001OORMVQ", "B001AAVA08"], "buy_after_viewing": ["B000J01I1G", "B00CPGYNV4", "B001OORMVQ", "B000UO6C5S"]}}