{"asin": "B00232YRJ8", "description": "This compact high-performance telephoto zoom lens incorporates Sigma&#x2019;s own Optical Stabilizer function. The lens incorporates SLD (Special Low Dispersion) glass in the front lens groups and is equipped with an inner focusing system to provide high image quality throughout the entire zoom range. The incorporation of HSM (Hyper-Sonic Motor) ensures quiet and high-speed auto focus. The OS (Optical Stabilizer) function effectively eliminates the effects of camera shake so subjects can be easily and clearly seen in the viewfinder as well as in the image. It allows the use of shutter speeds up to 4 stops slower than normal for steady, handheld photography. For Sony and Pentax mounts the built-in OS System allows the photographer to see the stabilized image in the viewfinder and can be used as an alternative with cameras having built-in image stabilization. The Super Multi-Layer Coating reduces flare and ghosting and provides high contrast images throughout the entire zoom range. This lens has a minimum focusing distance of 43.3inches (110cm) throughout the entire zoom range and a maximum magnification ratio of 1:4.5. An inner focusing system eliminates front lens rotation, making it suitable for use with circular polarizing filters.", "title": "Sigma 50-200mm f/4.0-5.6 DC IF SLD Optical Stabilized (OS) Lens with Hyper Sonic Motor (HSM) for Nikon Digital SLR Cameras", "price": 246.95, "imUrl": "http://ecx.images-amazon.com/images/I/51t2PrqGWKL._SY300_.jpg", "related": {"also_viewed": ["B0001VQ12Y", "B000BONMMI", "B0001VQ13I", "B0012X61U2", "B000AM7CJ0", "B000ALLMI8", "B000A0UHXU", "B0012X43P2", "B0009HN57Y", "B000O161X0", "B0012UUP02", "B00005V8S9", "B005QJOIP8", "B008RYQPC8", "B0015U95SW", "B000NOSCGW", "B002M3SOQK", "B0011NVMO8", "B005SC9FU6", "B001PGXEGA", "B000B8T6DI", "B00066EK4A", "B0000CCW64", "B003ZSHNCC", "B008B4893M", "B00005V8R8", "B0007WK8MQ", "B00005Y3OM", "B0009XQPJI", "B00HS3DTBE", "B000NOSCGM", "B000CE8IVM", "B000HDZAUA", "B001PGXEH4", "B002ZNJB2S", "B006YDTLX4", "B000V6MSRG", "B00AXZYY86", "B0007U0GZC", "B008B48AAE", "B00AXZZ034", "B004FN1W2I", "B0007WK8N0", "B004FLJVXM", "B003MOHM0C", "B001FB6PJI", "B000HJPK2C", "B0007U0GYS", "B00004XONF", "B0018ZDGAC", "B003980YK6"], "buy_after_viewing": ["B000O161X0", "B0011NVMO8", "B008B4893M", "B00004ZCJI"]}, "categories": [["Electronics", "Camera & Photo", "Lenses", "Camera Lenses", "Digital Camera Lenses"]]}