{"asin": "B000NK8EWI", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Canon looked to the very first Elph for inspiration when designing the PowerShot SD1000 Digital Elph, and came up with a quintessential iteration of the icon: slim, clean-lined and fully flat. Inside, the SD1000 Digital Elph looks only to the future: 7.1 megapixels, a 3x optical zoom and advanced DIGIC III ensure top-quality images, while focus is fast and sharp and red-eye is automatically corrected. The large and more colorful LCD screen now has a tough, anti-reflective coating that makes it as durable as it is beautiful.PowerShot SD1000 Highlights1x zoom/3x zoomSlim, stylish 7.1-megapixel digital Elph with 3x optical zoomGreat design is just part of the PowerShot SD1000 Digital Elph story. Inside is all the power you need to capture the moments of your life - beautifully.The 7.1-megapixel CCD records a wealth of detail - enough to let you enlarge and crop at will. Images are rich and sharp with lifelike depth. The camera's Genuine Canon 3x optical zoom not only gets you in close, but performs with all the clarity and brilliance you'd expect from the world's leader in advanced optics technology.DIGIC III image processor with improved Face Detection and Red-eye CorrectionWith DIGIC III, you get images of superior quality, the camera functions at top efficiency and battery life is significantly enhanced. What's more, DIGIC III enables Canon's newly improved Face Detection Technology and Red-eye Correction to give you better, more true-to-life people shots. Simply press the Shutter Button halfway down, and the PowerShot SD1000 Digital Elph automatically pinpoints the faces in the scene and chooses the ideal focus point. To keep every face looking bright and natural - without scary red eyes - the camera controls exposure settings and flash, so every shot is just what you were shooting for.Face Detection AF/AEfinds multiple faces in the frame and sets the most suitable focus point, when the shutter button is pressed halfway. And an additional feature, Face Detection FE adjusts the flash, based on a person's face on the screen. Exposure and flash are controlled to ensure proper illumination of both the faces and the overall scene, eliminating the common problem of darkened or overexposed faces.Face Detection in actionRed-eye Correctiondetects and automatically corrects red-eye during playback for both regular and flash photography. In unusual cases where red-eye is not automatically detected, it can easily be corrected manually during playback mode from the LCD screen.iSAPS Technologyis an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the fast DIGIC III Image Processor to improve focus speed and accuracy, as well as exposure and white balance.Vivid, high-resolution 2.5-inch PureColor LCDThe camera's 2.5-inch LCD screen gives you the big picture, whether you're shooting, reviewing or showing off your images. This extra-durable, high-resolution screen with tough scratch-resistant coating on the anti-reflective, PureColor LCD screen offers a crisp, clear picture to make shooting, playback and using the camera's menu functions especially convenient. Clear and bright, it also features Night Display for easy viewing in low light.ISO 1600 and High ISO Auto to reduce image blur and expand low-light shooting capabilityThe PowerShot SD1000 Digital Elph features new ISO 1600 and High ISO Auto settings that reduce the effects of camera shake and sharpen subjects in low-light situations, giving you greater flexibility for shooting.Five movie modes including 30 fps VGA, Time Lapse and Fast Frame RateWith a highly flexible movie mode, you can create the movie that's perfect for any application. Select from VGA (640 x 480 pixels) and QVGA (320 x 240 pixels), with frame rates of 30 fps and 15 fps for recording up to 1 hour or 4GB. Also choose from Fast Frame Rate (QVGA; 320 x 240 pixels) recording at 60 fps for up to 1 minute, Compact Movie Mode (QQVGA; 160 x 120 pixels) recording at 15 fps for up to 3 minutes, and Time Lapse (640 x 480) recording at 1 or 2 sec. intervals. The PowerShot SD1000 Digital Elph supports the USB 2.0 Hi-Speed standard, so you'll enjoy the fastest possible data transfer speeds when using a USB 2.0 Hi-Speed compatible computer.Print/Share button for easy direct printing and downloadingThe PowerShot SD1000 Digital Elph's Print/Share button makes direct printing easier than ever. Simply connect the SD1000 Digital Elph to a Canon CP, Selphy or Pixma photo printer or any PictBridge compatible photo printer, press the lighted Print/Share button and print! Also use the Print/Share button to transfer images to a computer (Windows and Macintosh).Print your own ID photos in 28 different sizes or use the Movie Print function to output multiple stills from a recorded movie on a single sheet with a Canon Selphy compact photo printer.Direct photo printersFor desktop large-format printing, try one of the direct photo printers that allow you to print without a computer in one of two ways: plug your compatible PowerShot camera into the direct photo printer using the supplied USB interface cable, or simply insert a memory card into the supplied adapter. You can also connect the printer to your computer for more options. Print high-resolution, borderless images as postcards or 8.5 x 11-inch sheets within minutes.Compact photo printersCompact photo printers let you produce versatile, fun 4 x 6-inch postcards, 4 x 8-inch wide greeting cards or credit-card size prints in just two easy steps: connect and press print. Control the printer right from your camera's LCD screen. You get durable, dye-sublimated prints quickly with or without borders. Assorted paper types let you create mini or credit card size labels. You can even take select compact photo printers to a party or an outdoor picnic using an optional rechargeable battery.", "title": "Canon PowerShot SD1000 7.1MP Digital Elph Camera with 3x Optical Zoom (Silver)", "price": 11.49, "salesRank": {"Camera &amp; Photo": 3961}, "imUrl": "http://ecx.images-amazon.com/images/I/41u7BeZvDpL._SX300_.jpg", "related": {"also_viewed": ["B003F3ZFVS", "B001SER48S", "B001SER492", "B001SER49M", "B000NK6J6Q", "B0035FZJKI", "B0012YC7AE", "B0007TJ5OG", "B001SER49C", "B000Q30420", "B0036T0X6S", "B001SER4A6", "B0036STI56", "B0011ZK6PC", "B0035FZJJ4", "B001SER47Y", "B000EMWBT2", "B0012Y6958", "B001SER47O", "B0075T7NW2", "B0035FZJKS", "B006UMM15O", "B00AWYN0BU", "B00B5HE3AK", "B000ENPDSW", "B0011ZK6OS", "B000M4KXCO", "B0012Y6AY8", "B000NK6INU", "B000AYJDD6", "B0007TJ5AK", "B006UMM1AY", "B00I58LZRG", "B00AWYN0ME", "B00AWYN182", "B00B5HE3IW", "B00065L5TE", "B000EN0K94", "B00HLDFNKQ", "B004J41T7Q", "B0012Y84AG", "B0075SUJBA", "B0075SUIEI", "B004J3ZV62", "B005MTME3U", "B005II5OLY", "B00I58LVKC", "B0007VPFI4", "B004M8SVBG", "B000V1VG4W", "B0035FZJJE", "B00EFILNV8", "B004HW73QG", "B00449BNDG"], "buy_after_viewing": ["B003F3ZFVS", "B003VNKNEQ", "B00AWYN0BU", "B003VNKNF0"]}}