{"asin": "B003JQLI9O", "description": "Streaming internet content is easy with the ViewSonic&reg;NexTV&reg;VMP75 Full HD 1080p network media player. Enjoy movies, videos, music and photos from your storage devices or access  content from YouTube, Live365, ShoutCast internet radio, Flickr and more. Now you can access the Netflix streaming platform with your Netflix subscription to access thousands of movies and TV shows instantly. The NexTV VMP75 supports a full range of the most popular video, audio and image formats and can be connected to your home entertainment system. With its web browsing capability (not available for rich Flash content) and custom RSS feeds, your connected TV experience is greatly expanded.Key Features:Ultimate entertainment Full HD 1080p playback from external storage devices or streaming media from home networks &amp; the InternetStream unlimited movies &amp; TV shows instantly &amp; directly to your living room HDTV from Netflix video on demandAccess thousands of videos, internet radio stations and photos with one easy click &nbsp;&nbsp;Multiple connectivity options include Ethernet, HDMI, composite, S/PDIF, USB, eSATA and optional Wi-Fi accessEasy network set up and file sharing using DLNA &amp; UPnPEnjoy rich media content with ultra fast file transfer speeds via the eSATA port &nbsp;Integrated web browser (not available for rich Flash content) for Internet surfing and custom RSS feeds for instant news and world affairsKeep up with social networking sites like Facebook, Twitter and moreSupports the most popular video and audio formats including DTS &amp; DOLBY for surround sound systemsFeature rich intuitive remote control includedStream unlimited movies and TV shows instantly with Netflix&reg;Netflix members can enjoy thousands of movies and TV episodes instantly streamed directly to your TV with the Netflix Video On Demand service. It is easy to set up an Instant Queue with your favorite movies or TV shows through your NexTV VMP75. Simply click the Netflix icon on NexTV&rsquo;s on-screen menu to access the new Netflix 2.0 interface. It's that simple.A full range of format supportWith the support of the most popular video, audio and image formats, the NexTV VMP75 offers an unrivaled and ultimate entertainment viewing experience. Additionally, with the support of DTS and Dolby, you can enjoy digital media in full surround sound with your home A/V system.Formats supported include:Video:MPEG1 (AVI/MKV/TS/DAT/MPG/MPEG/VOB), MPEG2 (MKV/DAT/MPG/MPEG/VOB/ISO/IFO/TS/TP)/M2TS, MPEG4 (AVI/MP4/MKV/MOV/WMV/ASF), DivX 3/4/5/6 Xvid (AVI/MKV/MP4/MOV), H.264/AVC (TS/AVI/MP4/MKV/MOV/FLV)/M2TS, VC-1 (TS/AVI/ASF/WMV)/M2TS, WMV9 (ASF/WMV)Audio:MP3, MPEG Audio, Dolby Digital, DTS, WMA, WMA Pro, PCM, LPCM,  FLAC, WAV, AAC, HE-AAC,  OGG, MKA,VORBISPhoto:JPEG,  GIF, PNG, BMP,  TIFFSubtitles:SRT, SMI, SUB, SSA,  IDX+SUB, IDX, AAS, TXT", "title": "Viewsonic NexTV VMP75 1080p Network Media Player - Stream Netflix, Internet radios/videos &amp; access to Twitter, Facebook w/free HDMI cable", "price": 39.95, "imUrl": "http://ecx.images-amazon.com/images/I/31B8uRICc1L._SY300_.jpg", "related": {"also_viewed": ["B00AXXOBEK", "B002N3DIC4", "B007NJ6S9S", "B003I6718M", "B005MJWGJC", "B00A9FYL2Y", "B00882OHL0", "B00ACEKQIA", "B0092U3TKC", "B00BG5CBRS", "B00F37K6VS", "B00AXXOBEU", "B006FNCWSY", "B007XZCH9W", "B006LEYQK4", "B0042SDDXM", "B00KNDHD54", "B00011Y1MQ", "B008C0BUZO", "B0096KLQN0", "B008YDUTRO", "B005MR6CNK", "B00JXFM75Y", "B009B5FLKY", "B00IJ142J2", "B003AAHB4U", "B0079LGGZ6", "B005KFHVES", "B0017W3WDC", "B00JI7ZW2M", "B002XVBAKI", "B003D0WIQS", "B0042RA8C2", "B004OVEYTO", "B00G6BC57S", "B00KAU8W14", "B002KG0JMG", "B0032CI80W", "B00IIVH2AE", "B003FBQKZ0", "B00CTEV9SW", "B007KEZMX4", "B002MCZJ3C", "B00A7YCSRM", "B008NO9RRM", "B00F4SEOIW", "B000GHWQ86", "B008CBQSKU", "B000VEMJFY", "B005KOZNBW", "B009SDNHNW", "B005O29F1O", "B0030FXIQK", "B00395ZQMK", "B00H71T8P8"], "buy_after_viewing": ["B008NO9RRM", "B008YDUTRO", "B003FBQKZ0", "B00BGGDVOO"]}, "categories": [["Electronics", "Home Audio", "Radios", "Internet Radios"]]}