{"asin": "B001NDYTKA", "description": "This kit provides 375 Watts of continuous lighting and it is a very good start for beginners. Entire kit sets up in minutes, and very easy to operate.Light StandVersatile, Hardworking & LightweightBlack anodized aluminumStable & Quick SetupMaximum Height: 1900 MM, 78 inchesMinimum Height: 810 MM, 32.4 inchesMaximum Load Capacity 2.5KG, 9.9 lbsClosed Length: 805 MM, 32.2 inchesMounting Stud 5/8 inchesMini Light Stand:High quality aluminum, pressure die-cast aluminumBlack anodized aluminumMaximum 2.6ft heavy duty light standSolid quick release leversEasy set upPart Number: WF-W801Max Height: 660 MM; Min height: 380 MM, Folded height: 390 MM,Max tube diameter: 23.5 MM, Load Capacity: 2.5 KgOne-year factory warrantyLighting Bulb:Average Life: 10,000 HoursApproximate Incandescent Equivalent: 125 Watt, total output is 375 WattSave 90 Watt in EnergyFlicker-FreeE26 standard screw-in baseCRI (Color Rendering Index ) > 84Designed for 120V/60 HZUL listed, Energy Star compliantBulb size: 6.37in Length, 2.68in Diameter, 2.36in Base Width, 2.70in Base LengthLight Socket:The adapter swivels in all directions so you, or your stand, don&rsquo;t have to get the light where you need it even with difficult angles. Max holds 105 Watt light bulbs.Soft Umbrella:Works well to diffuse the light from any flash creating a soft even light for your subject. Light-weight and easy set up.", "title": "CowboyStudio Photo and Video Studio Umbrella Continuous Lighting Light Kit- 27 feet Stands, 1 Mini Stand and Carry Case", "price": 56.0, "imUrl": "http://ecx.images-amazon.com/images/I/41n8NiVR%2BGL._SY300_.jpg", "related": {"also_bought": ["B001TSMJDS", "B0033YXVWE", "B002ZIMEMW", "B0019SHZU0", "B004LONG0W", "B00BISL11U", "B002IX56RE", "B003PQJ6EC", "B0041DKGPQ", "B0058PRZJ6", "B004L75BGQ", "B00K8TSM1M", "B00L7CUI3E", "B004AZ38Z0", "B002HJ9PTO", "B0058L24O6", "B0019HZQPM", "B005AKF3ES", "B00366WLZ2", "B000W07Y5M", "B004TJ6JH6", "B006JH8T3S", "B004HR42LK", "B003VCW6G0", "B002ZIVKAE", "B007H5JT80", "B003PEX8XE", "B0034WR71G", "B000UE50O2"], "bought_together": ["B002ZIMEMW"], "buy_after_viewing": ["B003WLY24O", "B005FHZ2SI", "B002ZIMEMW", "B003Y31FHC"]}, "categories": [["Electronics", "Camera & Photo", "Lighting & Studio", "Photo Studio"]]}