{"asin": "B00728Z9JA", "related": {"also_bought": ["B0058W3R82", "B0075805RI", "B003VNKNEQ", "B005HNF01O", "B0029EB3OC", "B002W7RHOG", "B0058VAY8Y", "B007P7FO02", "B0037TA7TU", "B009R375L8", "B003VNKNF0", "B005POCF4U", "B0037TA7QS", "B004VMG304", "B008C3U3TK", "B0075W15CS", "B0088OUAYQ", "B009R374GO", "B003VNKNEG", "B003F7DWH8", "B002I03UQG", "B005RXH1WU", "B006WUGZJW", "B006JO1YWY", "B00CV9LG06", "B007O328TM", "B002WE4HE2", "B001N82JIE", "B00A3I2X1I", "B00APQJROO", "B003O8G7PC", "B001N85YIG", "B0096T8YJU", "B007SOEMWI", "B007M54E08", "B001V9KG0I", "B0047EL5D6", "B002763PWU", "B006JO1YVU", "B00B29V7VY", "B002HZY5CU", "B006JO1YW4", "B000HGMX5M", "B0072B5CP8", "B0037T6O1U", "B0037FLUYU", "B007JRB0SS", "B007JRB0RE", "B00ATE7W7G", "B00728ZBB6", "B007JRB0TC", "B0074VWLUU", "B007PJVRCY"], "bought_together": ["B003VNKNEQ"], "buy_after_viewing": ["B00728ZBA2", "B003VNKNF0", "B003VNKNEQ", "B003F7DWH8"]}, "title": "Panasonic Lumix SZ7 14.1 MP High Sensitivity MOS Digital Camera with 10x Optical Zoom (Black)", "price": 179.99, "salesRank": {"Camera &amp; Photo": 919}, "imUrl": "http://ecx.images-amazon.com/images/I/315EuHUsjmL._SX300_.jpg", "brand": "Panasonic", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The Lumix DMC-SZ7, a part of the Lumix SZ-Series of digital cameras combines a powerful 10x optical zoom with a 25mm ultra-wide angle LEICA DC VARIO-ELMAR  lens, in a slim and compact body, making it extremely portable and easy to carry.  The Lumix SZ7 has 14.1 megapixels and can also shoot full-High Definition,  1920 x 1080 60i videos and with Light Speed AF, it has a super-fast focus response time of approximately 0.1 second &ndash; making it easy to capture spontaneous  must-have photos.Panasonic Lumix SZ7 HighlightsShooting ModesThe Lumix SZ7 features two new shooting modes &ndash; Miniature Effect and Panorama Shot.  In Miniature Effect mode, the peripherals are defocused while saturation  and contrast is emphasized to make the picture like a diorama. Video recorded in Miniature Effect mode is played back in 10x fast-forwarding, making it  comical and fun to watch*1. Panorama Shot makes it possible to shoot a horizontal or vertical panoramic image by taking consecutive shots and then overlaying  the photos for the effect of a panoramic photo.   Furthermore, the Lumix SZ7 feature Creative Retouch which includes six filters -Toy Effect, Soft Focus  Dynamic Monochrome, Expressive, High Key and Retro, each of which give the photo a more artistic look. This camera also features an Auto Retouch function  that adjusts contrast and brightness to give the photo a different look &ndash; all with a single press of the button.*1 Sound will not be recorded with [MINIATURE EFFECT] in Creative Control Mode and approximately 1/10 of the time period is recorded. (If you record for 10  minutes, the resulting motion picture recording will be approximately 1 minute long)iA (Intelligent Auto) ModeTo help ensure that the Lumix SZ7 is easy to use, it features Panasonic's popular iA (Intelligent Auto) mode. In iA mode, a suite of technologies are  automatically engaged and the camera chooses the best setting based on the shooting environment. For instance, iA includes the new High Dynamic Range,  Intelligent Handheld Nightshot and Motion Deblur together with AF Tracking, Intelligent ISO Control, MEGA O.I.S., Face Recognition, Intelligent Scene  Selector and Intelligent Exposure.Additional Features3.0-inch Intelligent LCD that automatically adjusts the backlight based on the environment's lightingMOS sensor to support full-HD videoUSB power charging in addition to the conventional AC power supply3D Photo Mode allows the user to take 20 panning shots and then the camera automatically selects the two most suitable images &ndash; one for the right eye and  one for the left eye &ndash; to synthesize a 3D composite.Dedicated video record button which lets users instantly start recording a video without having to make any extra settings. Additionally, the full 10x  optical zoom is available in video recording modeHigh-quality stereo sound via Dolby&reg; Digital Stereo Creator accompanies the realistic HD videos. The stereo zoom microphone comes with zoom noise  reduction system, and the Wind Cut function helps to block noise from background wind"}