{"asin": "B000NOSCGM", "description": "The Sigma 18-200mm high-zoom-ratio lens is designed exclusively for Canon digital SLR cameras and is capable of covering a wide range of focal lengths, from wide-angle to telephoto. Two Special Low Dispersion (SLD) glass elements and two hybrid aspherical lenses correct for all types of aberrations, letting Sigma house the extended-range super-zoom lens in a compact and lightweight body that measures 70mm in diameter and 78.1mm long and weighs a mere 14.3 ounces. The new lens coating, meanwhile, reduces flare and ghost--a common problem shared by many digital cameras--while also creating an optimum color balance. Other details include a minimum focusing distance of 45cm (17.7) at all focal lengths, a high zoom ratio of 11:1, and a maximum magnification of 1:4.4.The lens design incorporates an inner focusing system that prevents the front of the lens from rotating, making it particularly suitable for using circular polarizing filters and petal-shaped lens hoods. In addition, the overall length of the lens never changes during focusing, making the lens convenient to handle and easy to use. Finally, the lens's zoom lock switch eliminates \"zoom creep\" during transport--a convenient addition when traveling. The lens, which includes a metal mount, is backed by a one-year warranty.", "title": "Sigma 18-200mm f/3.5-6.3 DC AF OS (Optical Stabilizer) Zoom Lens for Canon Digital SLR Cameras", "price": 399.0, "imUrl": "http://ecx.images-amazon.com/images/I/41mTVG1-svL._SX300_.jpg", "related": {"also_viewed": ["B008B48AAE", "B005QJOIP8", "B00HS3DST2", "B0007U0GYS", "B001PGXEH4", "B00HS3DTBE", "B005SC9FU6", "B0007WK8MQ", "B000NOSCGW", "B001ET6QFY", "B0007U0GZC", "B0007XD4LC", "B001DYE1B6", "B002NEGTT2", "B001546MNE", "B001PGXEGA", "B004FLJVXM", "B008B4893M", "B0011GGNQ2", "B0015U95SW", "B0002Y5WXO", "B002NEGTTM", "B00006I53S", "B001DYC0CS", "B000AM7CJ0", "B0009XQPJI", "B002M3SOQU", "B00066EK40", "B008DGO7Y8", "B00INAI7WW", "B000ALLMI8", "B0007U00XU", "B000BY52NU", "B0011NVMO8", "B008RYQPC8", "B001JDLMSG", "B000V5K3FG", "B000HZYOT6", "B000AZ57M6", "B003A6H27K", "B008UGMLWQ", "B00HIP5L1I", "B005H1XC7A", "B00AXZYY86", "B000V6MSRG", "B00HS3DV8K", "B000JDJJ82", "B0000A1G05", "B002JCSV8A", "B0007Y794O", "B00004THD0"], "buy_after_viewing": ["B008B48AAE", "B005QJOIP8", "B00004ZCJJ", "B00004ZCJL"]}, "categories": [["Electronics", "Camera & Photo", "Lenses", "Camera Lenses", "Digital Camera Lenses"]]}