{"asin": "B00G335A58", "description": "SummaryThe iPad Air is beautiful. Why dress it up in a clunky plastic case?.&nbsp;Instead, consider the KAVAJ Berlin case for your iPad Air. It's thin and sleek, just like your iPad Air. It's made of 100 percent genuine leather, which is soft and elegant. It even smells like fantastic leather!We've paid attention to the details here: For example, we've built in magnets that let your iPad Air \"wake\" and \"sleep\" when you open and close the case. Inside, a thin barely-there leather frame keeps your iPad Air secure while showing off its colorThe KAVAJ Berlin case in black is an elegant sophisticated approach to protecting your iPad Air.HighlightsBeautiful, soft, rich 100 percent genuine leatherSuper-thin, adds almost no additional size to your iPad AirBuilt-in magnet technology lets your iPad Airwake and sleep when you open and close the caseAn extra-strong Velcro strip keeps your iPad Air securely inside our caseFull access to all ports and buttonsMaterials:Exterior: 100 percent genuine leather in blackInterior: Soft, sweet flannelIncluded in delivery:1 x KAVAJ \"Berlin\" case for the new iPad Air (iPad Air not included)Compatible with the iPad Air", "title": "KAVAJ iPad Air leather case cover &quot;Berlin&quot; for the new Apple iPad Air black - genuine leather with stand-up feature", "price": 49.9, "imUrl": "http://ecx.images-amazon.com/images/I/311XSTVHOZL._SX300_.jpg", "related": {"also_bought": ["B0099S7N0Y", "B00EL94Z4I", "B009VK276K", "B007IFVSPG", "B0099S7MJG", "B00G335DGY", "B00G2Y77RW", "B00G2Y4WNY", "B00G2X1VIY", "B00G2TK76A", "B00G2Y5YIG", "B00GW5VRO0", "B00ATM9T2O", "B00G3359AE", "B00G5N0ZZQ", "B008MOHLVC", "B00G3J8EZ0", "B00B2N7B60", "B00CKG61WI", "B009WHV3I0", "B00G2XRVNS", "B00FAMAQQG", "B00G3J8EDM", "B00G1YKHH0", "B00GP4CW24", "B00EZ9XG62", "B00J8ZJCUW", "B00IBDOB5I", "B009CP4PIW", "B009WQOS1U", "B00EL93M3S", "B00DY6KZ2A", "B00B3OA7R8", "B008GRONV6"], "bought_together": ["B00EL94Z4I", "B00G2TK76A"], "buy_after_viewing": ["B00EL94Z4I", "B00G335DGY", "B00G3359AE", "B00ATM9T2O"]}, "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Cases & Sleeves", "Cases"]]}