{"asin": "B000P297E8", "description": "Fans of the &#145;Hack and Slash&#146; wing of the Action genre are more than likely familiar with the single player, gothic-flavored action of Capcom&#146;sDevil May Cryfranchise. The first three games in the series are centered on the sword play and gun slinging of demon hunter and long-time hero, Dante, but in the most recent release,Devil May Cry 4, players are thrown a changeup, as doubt is cast on the once unquestionable motives and actions of Dante by a new, yet somehow familiar hero, Nero.Supernatural action with styleNero has all the Demon fighting tools.View larger.Demons rightly fear his \"Devil Bringer\" arm.View larger.There's bad blood between Nero and Dante.View larger.Dante's artful skill with the new Lucifer Weapon.View larger.Meet the New Kid in Town - NeroNero resembles Dante and Dante&#146;s estranged twin brother Virgil, familiar to players from earlier games in the series. This might be more than a just a coincidence--you&#146;ll have to play through the game to find out for sure--but what is certain is that like Virgil, Nero has a serious problem with Dante; one that can only end badly for one of them.AsDMC4opens players not only witness, but participate in Nero&#146;s trial by fire as he is unexpectedly forced to go head-to-head with Dante. The youngest, but most promising new member of the land of Fortuna&#146;s \"Holy Knights,\" the military arm of the \"Order of Maken,\" an organization pledged to destroy all demons as well as defend the memory and worship of Sparda, the historical Dark Knight who rebelled against the Dark Emperor to champion the fate of humanity, the Holy Knights highly respect Dante, who is a direct descendent of Sparda. This makes what Nero and players of the game must do all the more difficult, but no less necessary. A tutorial for learning and developing Nero&#146;s skills as well as serving as the game&#146;s first boss battle, playing as Nero, players must hold their own against the legendary demon hunter before they can proceed further into the game. But be prepared for Dante to return later in the game.The World ofDevil May Cry 4Just as in previous installments in theDMCseries, the world players explore inDevil May Cry 4is lavishly gothic, feeling both ancient and modern simultaneously and is peopled by demons and demon hunters. In this dangerous world player&#146;s weapons are sometimes all they can count on. Although you begin your journey playing in the role of newcomer Nero, players will also have the opportunity to play as Dante, Both character&#146;s arsenals of weapons and abilities are impressive, but not too difficult to master. See the partial list of both character&#146;s weapons and abilities below:Nero\"Devil Bringer\" Arm: Integrated into Nero&#146;s right arm, it is a mystery even to Nero, but quickly reveals itself as a very effective weapon against demons, especially the largest among them.Red Queen: Effective at when swung at high speeds, this sword has a motorcycle handle base that sprays flammable liquid on enemies when squeezed.Blue Rose: Used for long range attacks, this pistol has two barrels which can be fired at once with armor piercing force.The Exceed System: Allows Nero to charge up his sword with a throttle effect, revving up to three levels with powerful attack options.DanteForce Edge: Sharp and indestructible, this sword is a memento from his father Sparda, and was used to defeat the ancient enemy Mundus and seal the gateway to the underworld.Ebony &amp; Ivory: Dante&#146;s twin .45 caliber companion pistols. They are Dante&#146;s trusty companions as he battles supernatural evils.Beowulf: Double gauntlets and greaves hold a flashing power to strike down enemies at close distances.Active Style Change System: These allow Dante to switch between fighting styles and weapons on the fly, producing crazy combo possibilities that players will need to master.Leveling up of both characters is done throughDMC&#146;s traditional orb collection system which can happen at any point in the game, while weapons and abilities are upgradable at the completion of levels through the new \"Proud Souls\" system. In addition the game&#146;s deep combo system rewards players for &#145;stylishly&#146; dispatching enemies by mixing and matching the weapons that they use in attacks, so it pays for players to get to know the arsenals.New Characters and EnvironmentsJoining Nero and Dante as they battle demons and each other throughout the game&#146;s next-generation enhanced environments are a wide array of non-player characters both old and new to theDevil May Cryseries. Familiar faces from the past like Trish and Lady will be there as well as new characters like Kyrie to illustrate Nero&#146;s side of the story in the demon-filled landscapes of Fortuna and continue the legacy of fast paced, rich action players have come to expect from theDevil May Cryuniverse.Additional Collector's Edition Content:Heavy-duty metal game case with protective sleeveTheDevil May CryAnimated SeriesVolume 1 (4 full length episodes)More than 2 hours of contentLearn more about the world ofDevil May CryBonus DVDArt galleryGame soundtrack\"Making of\" videoDownloadable PC content--This text refers to an out of print or unavailable edition of this title.", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/51YvbLOP2vL._SY300_.jpg", "related": {"also_bought": ["B005VBVQAG", "B007UM59AC", "B001NX4DUQ", "B001D7T2VM", "B002GPPPS4", "B001YI0Z2U", "B0056WJA30", "B001ASJISG", "B002BRZ8FW", "B000ZK696O", "B00432O4VM", "B0050SY4DG", "B005DVAB1Y", "B003O6G47U", "B004ML7WOK", "B00149MEWI", "B005EZ5GNW", "B00309U0M6", "B000ZK6950", "B002I0H79C", "B005J5K9EI", "B00B59L9VO", "B004UDLRMS", "B00319DX4W", "B003O6HGHM", "B000ZK9QD2", "B002BSA1MQ", "B008XMSRKC", "B005C7R8I8", "B0050SWVIQ", "B005C2D2MO", "B000X1PE16", "B000F3AADE", "B003GSZ9ZE", "B000XJNTPG", "B006KYYP06", "B002I0JA7E", "B001UWGDC6", "B003H0CC2O", "B000P46NMK", "B00ENWZAI8", "B001D25M1Q", "B003O6CACS", "B002I0JGDM", "B004NRN5DU", "B0016B8Q6M", "B004CD9X2C", "B0047TG2R0", "B0030GBUCS", "B0050SY9WC", "B00354NAYG", "B003P9C6QY", "B003C1I0CO", "B000R0SR9E", "B005X50JWQ", "B0010AYJXI", "B0085CA8NY", "B000SH3XD6", "B003O6EBRA", "B00269DXCK", "B000C427NM", "B007IFMFYE", "B007UMD1EI", "B0022TNO7S", "B002EE5ROO", "B000QW9D14", "B0050SYV70", "B000CQNWH0", "B000KLNLV4", "B0050SY77E", "B000ZKDOVW", "B00F4GSAYI", "B003FBL85W", "B0009UC68U", "B000UUFQZE", "B002I0H2AG", "B004FUL9YW", "B003L8HQ7S", "B0088MVP2Y", "B004L9WGDA", "B0050SYLRK", "B0058VI0SU", "B000FRS9II", "B001E7MMNQ", "B000B6ML0U", "B006GHA8EE", "B004YVOCYG", "B001A4MTGS", "B0076ZPYPI", "B002V16T0Q", "B006ZTHGCK", "B0023CBY4E", "B000HCQK0A", "B001TOQ8J8", "B000XJS00K", "B008LW4SBQ", "B00B59MXDM", "B009BA4DVM", "B003PHLTDC", "B0050SYY5E"], "bought_together": ["B005VBVQAG", "B007UM59AC"], "buy_after_viewing": ["B005VBVQAG", "B007UM59AC", "B003O6EB70", "B0050SY4DG"]}, "salesRank": {"Video Games": 4227}, "categories": [["Video Games", "Xbox 360", "Games"]]}