{"asin": "B00322OOXM", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "Compare All 2010 Canon CamcordersCanon's VIXIA HF S200 Flash Memory Camcorder, with two SD memory card slots, offers Canon's most sophisticated feature set to date - blurring the line between consumer and professional. Canon's superlative proprietary imaging technologies help deliver video and 8.0 megapixel photos with incredible detail and lifelike color. Touch &amp; Track allows you to achieve sharp focus and precise exposure for any subject, simply by touching the generous 3.5\" High Resolution (922,000 dot) Touch Panel LCD. Native 24p Mode perfectly matches the frame rate of film. And 5.1-Channel Surround Sound ensures your audio complements the stunning realism of your video.Flash MemoryThe VIXIA HF S200 can record crisp, high definition video directly to two SD memory card slots, but it gets even better. With Relay Recording, the camcorder automatically switches video recording from one SD memory card to the next available SD memory card, when the first card becomes full. It will be easier than ever to capture that late game play or the exact moment those first steps are taken.You'll also have the flexibility of copying video from one card to the other. That makes it easy to insert the card into your computer or HDTV's card reader and view your recorded footage immediately.MXP and FXP modes record in 1920 x 1080 and require a Class 4 or higher SDHC Card.The advantages of flash memory go beyond the added recording time. You'll also appreciate the quick response time, because there are no moving parts. Press the record button and your VIXIA HF S200 starts recording video faster than you've ever seen before. In addition, when you review, you'll have quick access to your footage.Another plus is the VIXIA HF S200's low power consumption rate, allowing your battery to last longer. It's just what you need so you don't miss that pivotal play on the field or the moment when they say \"I do.\"While we certainly hope you keep your VIXIA HF S200 securely in your hand while shooting, if it happens to slip, or you accidentally knock it against something, you'll be happy to know that flash memory makes your camcorder more shock-resistant than other recording storage systems. It also minimizes the chance of data loss if there is damage to your recording media or to the moving parts found in other camcorders.Stunning Image QualityA Genuine Canon 10x HD Video Lens delivers unsurpassed image quality and a smooth background for professional-looking results. The Canon Exclusive 1/2.6\" 8.59-megapixel Full HD CMOS Image Sensor captures video at 1920 x 1080 resolution and photos with astonishing detail, while Canon's Exclusive DIGIC DV III Image Processor provides the ultimate in color and imaging performance, with enhanced reproduction of difficult to capture purple and blue tones. Exceptionally lifelike tone and detail are captured thanks to 24Mbps Recording, which offers the highest bit rate in AVCHD. Even when shooting in extended telephoto range, the VIXIA HF S200's built-in 1.7x Digital Tele-converter retains excellent image quality. The VIXIA HF S200 not only captures images in Full HD, but records and outputs at 1920 x 1080 as well, so you get Full HD, from lens to screen.Dynamic SuperRange Optical Image Stabilization with Powered ISVIXIA HF S200 features Canon's proprietary Dynamic SuperRange Optical Image Stabilization which provides continuous adjustment throughout the entire zoom range to correct a broad range of motion. Extra compensation is applied at wide-angle focal lengths to eliminate unwanted shaking common when walking while shooting. Together with the latest development, Powered IS, you'll find an even higher level of compensation for subtle hand movement at the telephoto end of the zoom range. And it's easy to engage Powered IS. Simply press or hold the Powered IS button on the touch panel LCD.Instant AFAnother critical objective when shooting in high definition is achieving a very sharp focus. The VIXIA HF S200 camcorder features Canon's revolutionary Instant AF focusing system which offers a dramatic improvement in auto focus speed and accuracy (compared to traditional auto focus systems). The Instant AF feature uses an external sensor, in combination with Canon's auto focus system, to help significantly decrease the time it takes to find focus, even in low light conditions. This system achieves focus instantaneously, reducing focus \"hunting.\" The benefits of Instant AF are especially seen in high brightness and night shooting situations. With Instant AF, it's possible to capture fast, accurate focusing, even when following a moving subject.And because a properly focused subject is more critical than ever with HD, the VIXIA HF S200 also features Focus Assist. This helps in capturing your subject in razor-sharp focus. It works by providing a 2x magnification of your subject (when you start recording, this assistance is automatically cancelled). This is a feature normally found in professional broadcast-quality cameras. Another sophisticated control available on the VIXIA HF S200 is color peaking, which enhances the edges of your subject to aid in focusing.3.5\" High resolution Touch Panel LCD ScreenThe VIXIA HF S200 features a 3.5\" High Resolution Touch Panel LCD Screen which provides a large, expansive area for fast and easy menu navigation right at your fingertips. Boasting a resolution of 922,000 dots, the screen delivers exceptional detail and brilliant color for more accurate and enjoyable viewing. You'll also have Touch &amp; Track, which allows you to get precise focus and exposure on any subject - whether it's people, vehicles, etc. by selecting your choice right on the touch panel LCD. To add to its versatile capabilities, the VIXIA HF S200 also features a viewfinder for use in extreme bright light situations.Smart AutoSmart Auto makes shooting great video easier than ever before. Using the power of Canon's DIGIC DV III Image Processor, the VIXIA HF S200 intelligently detects and analyzes faces, brightness, color, distance, and movement, then automatically selects the best settings for the scene. Whether you are capturing a sunset, a day at the beach, or a fast-paced soccer game, Smart Auto delivers exceptionally accurate results.Touch &amp; TrackTouch &amp; Track delivers precise focus and exposure on any subject - people, pets, vehicles and more. Simply select your point of interest on the touch panel LCD, and you will have your subject in sharp focus, regardless of where in the frame it moves during the shot &ndash; and, the exposure will be perfectly adjusted for subject and conditions. Touch &amp; Track is also the default setting, ready when you turn the camcorder on. For more creative control, you can also choose to adjust focus or exposure independently by turning off Touch &amp; Track, and turning on Touch Focus or Touch Exposure.Genuine Canon Face DetectionThe same high quality Face Detection technology used in Canon digital cameras is available in Canon high definition camcorders. Up to 35 faces can be tracked automatically, ensuring razor-sharp focus and natural, accurate exposure. Of the faces tracked, 9 detection frames can be displayed at one time.In fact, the system is so intelligent that it will recognize faces turned downwards or sideways. In addition, a specific face may be selected as the main subject for continuous tracking. This feature is convenient in searching for clips which feature that specific subject's face. In search and playback, use of the Face Index will display those frames with the chosen face as a thumbnail in each shot in which it appears. Your selected face can also be linked as a timeline to further identify footage containing your subject.Advanced Video SnapshotAdvanced Video Snapshot allows you to capture the highlights of a once in a lifetime trip or a family milestone with the same ease as taking photos. Simply record a series of short video clips &ndash; or select your favorite clips while in Playback Mode &ndash; and blend in your favorite background music to create an exciting movie that will grab everyone's attention. This version of Advanced Video Snapshot allows selectable recording times of 2, 4, or 8 seconds. Additionally, audio from an external source, such as an MP3 player, can be played along with the Snapshot movie and playback can be controlled from that source.Easy Web SharingHD-to-SD Downconversion allows you to convert recorded high definition video to standard definition files while safely preserving the original HD video. These standard definition files make it even more convenient to edit, share video online, or create a DVD. The downconverted video can be transferred to your computer via traditional methods - i.e. USB connection, card slot - or wirelessly to sharing sites with an Eye-Fi SD memory card.The VIXIA HF S200 is compatible with Eye-Fi SD Memory Cards. It's possible to wirelessly transfer your downconverted video and photos to your computer, or upload them directly to online sharing sites in a few simple steps. Insert an Eye-Fi SD Memory Card into an SD card slot on the camcorder, configure your computer to select the target site (e.g., Facebook, YouTube, Shutterfly, Flickr) and you're ready to share your standard definition files with family, friends, and the world!Canon camcorders are not guaranteed to support Eye-Fi card functions (including wireless transfer). In case of an issue with an Eye-Fi card, please check with Eye-Fi, Inc. Outside of the United States and Canada, government approval is required to use Eye-Fi cards in many countries or regions. Without approval, use of the card is not permitted. If it is unclear whether the card has been approved for use in the area, please check with Eye-Fi, Inc.8.0 Megapixel CameraSince Canon is acknowledged as a world leading maker of digital cameras, it's not surprising that the VIXIA HF S200, in addition to being a brilliant camcorder, is also a superb 8.0 megapixel digital camera. Once again, Canon delivers features and technology that advance convenience and capability. The VIXIA HF S200's Dual Shot makes it easier than ever to capture both video and photos. You'll even be able to shoot 6.0 megapixel photos while shooting video at the same time with Simultaneous Photo Recording.Auto Intelligent Auto Focus (AiAF) ensures sharp images and gives creative flexibility. Even when your subject isn't in the center of the frame, the VIXIA HF S200's 9-Point AiAF will automatically select from 9 metering frames on the screen to help bring images into sharp focus.You can also choose from a range of exposure modes including Auto AV (aperture priority), TV (shutter priority), and P (program).For optimal exposure, the VIXIA HF S200 offers selectable metering patterns: Evaluative, Center-Weighted Average, and Spot. The AE Bracketing feature of the VIXIA HF S200 automatically takes three versions of the shot with 'dark,' 'normal' and 'light' settings in &frac12; exposure steps so you may choose the one that best suits you.The VIXIA HF S200 can capture a rapid succession of photos, just like the motor drive on a digital camera. Shoot up to 3 frames per second in the Continuous Mode, or a blazing 5 frames per second in the High Speed Continuous Mode.For the advanced digital photographer, the VIXIA HF S200 comes with a Histogram Display &ndash; a feature found in Canon's line of digital SLR cameras. The display allows you to see the brightness information of your still images, so you can adjust your exposures as you shoot.With the Level Marker feature, it's easy to keep your camera level for more professional-looking photographs. The VIXIA HF S200's Grid Marker feature lets you compose your shot accurately, according to the grid in your viewfinder. Choose from two different colors for the grid to ensure that you see the grid, no matter what the background color of your shot is.The versatile VIXIA HF S200 even lets you capture a still image from an already recorded movie. While playing the movie in your camcorder, simply press the photo button to capture a 1920 x 1080 photo onto an SD card. Additionally, the VIXIA HF S200 allows you to capture 30 photos from one second of video.Your VIXIA HF S200's built-in flash lets you capture superb photos indoors and in low light conditions. The VIXIA HF S200 also features red-eye reduction.Print/Share allows you to connect your camcorder directly to select Canon printers or any PictBridge-compatible printer with the supplied USB cable and with a touch of the Print/Share button, print directly from your VIXIA HF S200. Print/Share also makes it easy to transfer your photos to your computer.You can also easily burn DVDs of your photos taken with your VIXIA HF S200 as it is compatible with Canon's DW-100 DVD Burner. A one-cable connection is all it takes to send the files across and, with the click of a few buttons, your photos are ready to share with all.Native 24p Mode / 24p Cinema Mode / 30p Frame ModeThe VIXIA HF S200 offers selectable frame rates to match both your lifestyle and creative vision.Native 24p Mode allows 24 frames per second &ndash; exactly the same capture rate as film &ndash; to be captured and recorded. This is a big advantage for serious filmmaking work enabling you to achieve the ultimate cinematic experience.24p Cinema Mode enables all aspiring moviemakers to achieve a professional \"film-look.\" You can change the camcorder's frame capture rate to 24p (recorded at 60i), which provides the appearance of the same frame rate as movie film. In addition, you can use the VIXIA HF S200's CINEMA setting, which changes the color and tonal characteristics, evoking the look and feel of a movie shown in a theater. For added flexibility, these settings can be used together or independently.You would normally have to look to professional video cameras in order to have a sophisticated tool like 30p Progressive Mode at your command. In addition to the standard interlaced video frame rate of 60i, you may choose to set the VIXIA HF S200 to capture video in 30p, (30 progressive frames, recorded to 60i) which is particularly useful for footage to be used on the Internet. It's also excellent for action and sports shots and additionally, this setting gives enhanced quality to still images captured after recording.TerminalsTo maximize the usefulness and versatility of the VIXIA HF S200, you'll find a range of terminals to extend the capabilities of your camcorder. A built-in LANC Terminal provides an easy connection to both Canon and third-party wired remote controllers. The Mini Advanced Accessory Shoe allows you to attach optional Canon accessories such as the VL-5 Video Light, DM-100 Directional Stereo Microphone, or SM-V1 5.1-Channel Surround Microphone. Easy, one-cable connectivity to your HDTV is yours through the VIXIA HF S200's HDMI Terminal which also supports CEC and x.v.Color. The built-in Microphone terminal with manual audio level control and Headphone terminal provide exceptional audio flexibility.\"x.v.Color\" and \"x.v.Color\" logo are trademarks of Sony Corporation.AudioFor the ultimate home theater experience, 5.1-Channel Surround Sound* allows you to capture audio quality that matches the stunning realism of your high definition video. Since sound is captured from all directions through five different pickup sensors, your home movies will look and sound more lifelike than ever before.The Automatic Attenuator feature prevents high volume distortion and optimizes audio quality in situations when sound levels quickly change, such as when loud music plays in the background. It automatically keeps the audio clean and even.* Optional Canon SM-V1 5.1-Channel Surround Microphone requiredAdditional FeaturesProfessional Shooting Assist Functions provide an exceptional level of control:Enhanced zebra pattern indicates \"blown out\" or high brightness areas to help you set the proper exposure.Color peaking enhances the edges of your subject to aid in focusing.Custom key allows functions including exposure, focusing, assist functions, mic volume level or AGC limits to be assigned to a custom key. Assist functions make it possible to change zebra and peaking settings.Color bars with reference tone help to set proper color and audio levels when editing video.Gain control allows you to lower the dB value to ensure that dark scenes can be shot with the correct level of darkness.Approximately 100% area display gives you a complete view in the LCD of the scene being shot - no need to worry that areas in the margins are being left out.Intelligent Lithium-Ion Battery accurately indicates remaining battery time down to the minute.Built-in video light enhances your ability to shoot in low light conditions.Pixela ImageMixer 3SE Video Editing Software is bundled with the VIXIA HF S200. You can easily perform a variety of functions, including AVCHD Editing in which you can trim, reorder, and combine scenes, as well as add music, titles, and transitions. This software also allows you to play your AVCHD movies on your computer and will also let you share copies of your movie with friends and family through flash memory to hard drive copying. Transfer and store your movie onto your computer's hard drive with the software and easily convert your high definition video to standard definition video as well.Pixela ImageMixer 3SE will also assist you in converting video to the optimum resolution for transmission over the Internet.With the Pixela ImageMixer 3SE Disc, you can burn your edited video onto Blu-ray discs, AVCHD DVDs (which play in AVCHD compatible Blu-ray disc players), or onto standard definition DVDs. And to complement the VIXIA HF S200's Video Snapshot feature, a music CD containing royalty-free soundtracks is also provided.* The bundled application is compatible with Windows XP and Windows Vista.DVD Burner CompatibleYou can also easily burn DVDs of the video shot with your VIXIA HF S200 as it is compatible with Canon's DW-100 DVD Burner. A one-cable connection is all it takes to send the files across and with the click of a few buttons, your videos will be burned to an AVCHD disc for play in a compatible DVD player.AVCHD discs containing scenes recorded in MXP mode cannot be created with the optional DW-100 DVD Burner.Compare All 2010 Canon Camcorders", "title": "Canon VIXIA HF S200 Full HD Flash Memory Camcorder &amp; Pro Manual Control", "price": 17.12, "salesRank": {"Camera &amp; Photo": 4828}, "imUrl": "http://ecx.images-amazon.com/images/I/41vPDn18PFL._SX300_.jpg", "related": {"also_bought": ["B00178T5V4", "B0049VMMZ2", "B005BHX0A4", "B003JCLLH2", "B00139XOCI", "B009HU6RI8", "B0019BGDJG"], "buy_after_viewing": ["B003VNKNF0", "B0039BPG1K", "B00HLDFTRS", "B00HLDFTRS", "B004THA2OE"]}}