{"asin": "B001N2MUD4", "description": "rom the ManufacturerGarmin International's n&uuml;vi 885T is a GPS navigator and personal travel assistant featuring voice-activated navigation and lane assist with junction view. Navigate with confidence while n&uuml;vi directs you to the preferred lane while driving. Also, see realistic images of upcoming junctions where available.This advanced model feature voice-activated navigation and lane assist with junction view.Click to enlarge.n&uuml;vi 885T builds upon the features of the 855 by adding dynamic content from MSN Direct. You'll benefit from traffic updates, flight status, advanced weather (now includes Doppler radar), gas prices, enhanced movie listings, stock info, news, local events and send to GPS feature for trip planning (3-month trial subscription included). Also, take advantage of hands-free calling when paired with a compatible Bluetooth phone.The n&uuml;vi 885T offers full coverage mapping for the United States, Canada and Puerto Rico. The preloaded map data features nearly six million points of interest, including hotels, restaurants, gas stations, ATMs and attractions. The map data is provided by NAVTEQ, a world leader in premium-quality mapping.Garmin's n&uuml;vis pack top of the line features into a slim form factor.Lane assist guides you to the correct lane for an approaching turn or exit, making unfamiliar intersections and exits easy to navigate.Click to enlarge.Junction View gives you a photo-realistic screen that shows you both the road detail as well as the signs as you will see them on the road.Click to enlarge.Speak commands and get on-demand travel info from MSN Direct with n&uuml;vi 885T. This widescreen navigator features voice-activated navigation, preloaded maps, hands-free calling and an FM transmitter--plus real-time local weather, traffic, movie times, gas prices, stock information, local news and events. Like the rest of the wide n&uuml;vi 800-series, you can navigate with your voice for on-the-go convenience.Speak Commandsn&uuml;vi 885T not only tells you where to turn but listens to your spoken commands. With n&uuml;vi's innovative speech recognition, you safely control n&uuml;vi's interface with your voice--allowing you to keep both hands on the wheel. Simply press the button on the remote (which attaches to the steering wheel) to activate speech recognition and begin speaking menu options. n&uuml;vi even recognizes shortcut phrases for popular functions. Tell n&uuml;vi \"Find Address\" and speak an address to start navigating.Get Enhanced MSN DirectWith next-generation dynamic content from MSN Direct, n&uuml;vi 885T is one resourceful personal travel assistant. Using the included receiver and free trial service to MSN Direct, you can check the weather, avoid traffic backups, compare local gas prices, get enhanced movie listings, stock information, news and local events when you travel with your unit. Even plan trips from the convenience of your computer, via Windows Live Local, and wirelessly send locations to n&uuml;vi 885T.Free 3 month trial subscription to MSN Direct services, activation instructions provided*MSN Direct Traffic Receiver included in the boxExtended MSN Direct service subscriptions available for purchase: 12 months for $49.95 + tax (visit MSN for further details)Notice: MSN Direct service will be available only until January 1, 2012.See MoreWith n&uuml;vi 885T's widescreen display, you'll always get the big picture. View map detail, driving directions, photos and more in bright, brilliant color. Its sunlight-readable, 4.3-inch display is easy to read--from any direction.Navigate With Easen&uuml;vi 885T comes ready to go right out of the box with preloaded City Navigator NT street maps and millions of points of interest (POIs) such as hotels, restaurants, fuel stations, ATMs and more. Speak a menu option or touch the color screen to enter a destination, and n&uuml;vi takes you there with 2-D or 3-D maps and turn-by-turn voice directions. It even announces the name of exits and streets so you never have to take your eyes off the road. In addition, n&uuml;vi 885T accepts custom points of interest, such as school zones and safety cameras and lets you set proximity alerts to warn you of upcoming POIs.Where Am I?Keep track of yourself and your car with n&uuml;vi 885T. Just speak or tap \"Where Am I?\" to find the closest hospitals, police stations, fuel stations, nearest address and intersection. Also see your exact latitude and longitude coordinates. n&uuml;vi 885T even remembers where you parked. It automatically marks your position when you remove it from the windshield mount, so you can navigate with n&uuml;vi on foot and find your way back to your vehicle. Perfect for unfamiliar spots and crowded lots such as amusement parks, stadiums and malls.With the POI loader program users can set up proximity alerts for school zones, safety cameras, create custom POIs and more.Click to enlarge.A handy MP3 player lets you play songs stored on SD memory cards.Enjoy a richer navigation experience using pictures as a guide with Garmin Connect Photos.Click to enlarge.Plan Aheadn&uuml;vi 885T includes advanced navigational features to take the worry out of traveling. With route planning you can save 10 routes, specify via points and preview simulated turns on its wide screen. In addition, n&uuml;vi 885T automatically sorts multiple destinations to provide an efficient route for errands, deliveries or sales calls. It also displays speed limits for highways and Interstates. A trip log provides an electronic bread crumb trail of up to 10,000 points, so you can see where you've been on the map.Make Hands-free CallsTalk about worry-free driving. For hands-free calling, n&uuml;vi 885T integrates Bluetooth wireless technology with a built-in microphone and speaker. Just pair it with your compatible Bluetooth phone and talk hands-free through the 885T while staying focused on the road. Simply speak or dial numbers with n&uuml;vi's touchscreen keypad to make a call.Take It With Youn&uuml;vi 885T's high-sensitivity internal (non flip-up) antenna gives it a sleeker, thinner design than other gps units, making it easy to slip in your pocket or purse. Its rechargeable lithium-ion battery makes it convenient for navigation by car or on foot.Go Beyond NavigationNavigation is just the beginning. n&uuml;vi 885T includes many \"must have\" entertainment and travel tools including MP3 player, audio book player (subscription to Audible.com required), JPEG picture viewer, currency converters, Garmin Games, alarm clock and more. With the included wireless FM transmitter, you can hear audio, including voice prompts, MP3s and audio books, through your vehicle's stereo. It's compatible with optional FM traffic alerts and comes with Garmin Lock, an anti-theft feature. Download custom vehicles that show your location on the map from our free Garmin Garage. With photo navigation, you can download Google Panoramio pictures via our Garmin Connect Photos website and navigate to them. Enhance your travel experience with optional plug-in microSD cards such as Garmin Travel Guides for detailed data on attractions.Search for locations on Google Maps or Mapquest, then transfer the addresses directly to your Garmin GPS navigator.Navigate by Photo with Garmin Connect PhotosUsing Garmin's Connect Photos Web site, you can choose from millions of geo-located photos provided by Google's Panoramio photo sharing community and download them to the n&uuml;vi for a richer navigation experience using pictures as a guide.Choose from Panoramio's collection of photos from around the world.Easy to use interface displays photos on Google Maps.Search for photos by location name or map area boundary.Transfer photos directly from Garmin Connect to device with the Garmin Communicator.View photos in Google Earth.Supports Internet Explorer 6+, Firefox 2+, Safari 3+ on Windows and Mac.Send Addresses Directly from Google Maps or MapquestItching to try out a new restaurant, or setting off on a road trip to locate the best toffee apples on the East Coast? Now, it's easy to search for locations on Google Maps or Mapquest, then transfer the addresses directly to your Garmin GPS navigator.Hook up your Garmin to the computer via its USB portSearch for the location you wantClick the Send link in the info window for the address. That will bring up a popup \"Send to\" form.Pick GPS, then pick Garmin and hit the \"Send\" button.The address will instantly transfer to your Garmin device, The point will be saved as one of your favorites, and you can navigate to it or view it on a map just like with any other favorite.The process does require a small plugin, which you can get at Garmin's website. You can send business addresses to your Garmin device from these countries: Austria, Belgium, Canada, Denmark, Finland, France, Germany, Great Britain, Italy, Netherlands, Norway, Sweden, Switzerland, and the United States.Other FeaturesAuto time zone--n&uuml;vi will automatically adjust your time zone while navigatingDEM maps--show you shaded terrain contours at various zoom levelsTrip computer records mileage, max speed, total time and moreBuilt-in travel kit includes features such as picture viewer, world clock, currency and measurement converters and calculatorHigh-speed PC connectivity using USB 2.0 mass storageConfigurable vehicle icons--select fun, customized icons from www.garmingarage.comStandard headphone and microphone jacksmicroSD card slot for optional mapping and data storageWhat's in the Boxn&uuml;vi 885t, preloaded City Navigator North America NT, remote for voice activation with battery, vehicle suction cup mount, MSN Direct receiver/vehicle power cable, lithium-ion battery, USB cable, dashboard disc, quick start manual.Visit Garmin.com to get thelatest firmware updates for your n&uuml;vito keep it current and performing at its best.Which n&uuml;vi is Best for You?Note: All n&uuml;vis come with detailed NAVTEQ maps containing more than 6 million pre-loaded point of interest locations.", "title": "Garmin n&uuml;vi 885/885T 4.3-Inch Widescreen Bluetooth Portable GPS Navigator with Speech Recognition", "price": 173.24, "imUrl": "http://ecx.images-amazon.com/images/I/515c1iMQGzL._SX300_.jpg", "related": {"also_viewed": ["B00AXX0I88", "B005DIBHA6", "B00AXX0IC4", "B001OMGVII", "B001PN37LA", "B00407238G", "B002LVUQYQ", "B00AXX0JOQ", "B004MYFTFG", "B004MYFTFQ", "B005DIBH4M", "B00AXX0IEC", "B003ZX871I", "B003ZFZ3YU", "B002771V48", "B006SOLITY", "B00FMUYYZA", "B005DIBFYE", "B005DIBHCE", "B003EYVHH4", "B003ZX8B3W", "B0090C7A2A", "B00IUO7PHE", "B00AXX0JP0", "B000OH63MI", "B003ZX8B1E", "B00AXX0I6A", "B002PNWFXA", "B00AXX0JNW", "B0057OCDQS", "B005LMWPYG", "B001ELJ9QK", "B001U0O7RQ", "B00AXZWG8Q", "B00D7F0JVU", "B0057ODG6Y", "B008M59RUO", "B004MYFTDI", "B000F78582", "B0011ULQNI", "B005DIBH6A", "B002RL8H1Y", "B00KXDK1KS", "B006SOLIV2", "B007PPYXOC", "B001ELJ9P6"], "buy_after_viewing": ["B00AXX0I88", "B000F78582", "B005DIBHA6", "B00AXX0IC4"]}, "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]]}