{"asin": "B000F4C2AM", "description": "Record your home movies and your favorite TV programs easily to DVD disc with the Panasonic DMR-ES15S progressive scan recorder/player, which provides ultimate flexibility in recording media options. You can choose write-once DVD+R and DVD-R discs or rewritable DVD-RW/+RW and DVD-RAM discs (the latter being a great choice for temporary storage of recorded material as it can be rewritten more than DVD-RW). It's easy to record TV programming with the built-in analog TV tuner with RF pass-through. In addition to standard DVD movie and CD audio discs and its compatible recordable formats, the DMR-ES15S can play back CD-R/RW, dual layer DVD-R/+R, and VCD disc formats as well as JPEG, and MP3 digital formats.Panasonic's Time Slip function consists of two features designed to give you added flexibility and control when making DVD recordings: Chasing Playback and Simultaneous Record &amp; Play. With Chasing Playback, you don't have to wait for an entire program to be recorded before watching it from beginning to end. This feature allows you to watch a program that's currently being recorded from any point that's already been recorded--while continuing to record the live program in progress. Simultaneous Record &amp; Play allows you to record a program onto a disc while simultaneously watching any other program that's previously been recorded on the same disc.You can set your recorder to one of five different recording speeds, each varying in recording quality and length. EP mode yields the most recording time, LP &amp; SP modes provide less recording time with higher quality recording, and XP mode gives you the highest quality recording. There's also the FR (Flexible Recording) mode that lets you record with the best picture quality possible for the recording time and remaining space on the disc.The Direct Navigator feature makes it easy to find a previously recorded program on a disc. A list of recording dates, times, channels and (user-entered) titles are shown on screen. With the Playlist Playback function, you can perform simple non-linear video editing using, such as rearranging the order of scenes, skipping over unwanted scenes, or copying selectionsJump directly to any spot on a disc and begin playback or recording right away with the Rapid Random Access function when using DVD-RAM discs. Even if there is no sequential area of empty space available, this DVD recorder can record data on available space throughout the rest of the disc. You will also avoid searching for a blank spot to start recording, or accidentally recording over desired material.Enjoy a great picture on you flat screen LCD or plasma HDTV using the component video output, and immersive surround sound via the optical digital audio output for Dolby Digital and DTS home theater effects. It also offers a FireWire port (also known as IEEE1394 or i.Link) for direct connection to a digital video camcorder, enabling you to download footage directly to disc. The full lineup of video and audio connections includes:RF Input: 1Composite video/audio input: 2 (1 front)Composite video/audio output: 1S-Video input: 2 (1 front)S-Video output: 1Component video output: 1Digital audio output: 1 opticalTech TalkComponent video(also called Y/Pb/Pr) features a three-jack video input, which provides separate connections for luminance (Y), blue color difference (PB) and red color difference (PR). This results in increased bandwidth for color information, resulting in a more accurate picture with clearer color reproduction and less bleeding than you would get with S-Video or composite (RCA yellow video plug) connections. You will need a separate RCA left/right audio cable for sound.What's in the BoxDVD recorder/player, remote control (with batteries), AV cable, RF cable, power cord, one DVD-RAM disc, printed operating instructions", "title": "Panasonic DMR-ES15S DVD Recorder with DV Input (2005 Model)", "price": 155.26, "imUrl": "http://ecx.images-amazon.com/images/I/31MZX0JVSKL._SX300_.jpg", "related": {"also_viewed": ["B0038JECKY", "B0014F7Z94", "B005DC203K", "B0031WRG56", "B00009KXA3", "B0014F9U6U", "B004QIPKNY", "B000NWZP5U", "B0014176XI", "B000F4EJH6", "B009WROL6G", "B003DPKOKK", "B005QC6J4S", "B004VFHR3I", "B001TOD3KK", "B000O3IH9O", "B001T6K7G6", "B00EO3A9A0", "B00AKZ76JS", "B009L04DCQ", "B00092HNOA", "B000SML2BQ", "B00FMHLIXY", "B00JQOQCD0", "B008VKZHSG", "B000ASGFRE", "B001CBXEDG"], "buy_after_viewing": ["B0038JECKY", "B001T6K7G6", "B009WROL6G", "B0014F7Z94"]}, "categories": [["Electronics", "Television & Video", "DVD Players & Recorders", "DVD Recorders"]]}