{"asin": "B003L8DXOI", "description": "Assassin's Creed: Brotherhoodis an epic action game for PlayStation 3 set across a blend of present and historical time periods, that places the player in the role of the leader of a Renaissance-era guild of assassins out for vengeance against the remnants of the Knights Templar. Set primarily in Rome, this sequel to the critically acclaimedAssassin's Creed IIfeatures returning characters from the previous game and includes new features such as the ability to command members of your guild in combat, a new arsenal of weapons and multiplayer game support in which players can assume different assassin characters..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Command the members of your assassin's guild in single player and become them in multiplayer.View larger.Explore the glory and faded grandeur of Renaissance-era Rome.View larger.StoryLive and breathe as Ezio, a legendary Master Assassin, in his enduring struggle against the powerful Templar order. He must journey into Italy&rsquo;s greatest city, Rome, center of power, greed and corruption to strike at the heart of the enemy. Defeating the corrupt tyrants entrenched there will require not only strength, but leadership, as Ezio commands an entire brotherhood of assassins who will rally to his side. Only by working together can the assassins defeat their mortal enemies and prevent the extinction of their order.Multiple Ways to PlayExpanding on the game world woven across the first two games in the franchise,Assassin's Creed: Brotherhoodprovides players with multiple ways to play. In single player mode you take on an engrossing campaign playing as Ezio, the hero fromAssassin's Creed II, who has now risen to the level of Master Assassin. Here players scour the expansive environment of Renaissance-era Rome, tasked with ridding the Eternal City of the continuing stain of the Templars and in the process ensuring the survival of the guild of assassins. You are not in this alone though. Additional AI members of your guild are at your command, and can be summoned to your aid if need be. In addition to this, for the first time in theAssassin's Creedfranchise players can compete with other would-be assassins in multiplayer action. In multiplayer modes players choose from a range of Assassin characters, each with their own backstory, unique weapons and assassination techniques. Choose your assassin character, utilize the virtual reality capabilities of Abstergo Industries' Animus technology and match your skills against other assassins from around the world. There's no time like now to join the Brotherhood.Deadly Weapons ArsenalAssassin's Creed: Brotherhoodfeatures a wide variety of weapons, depending on the mode of play. In single player players primarily utilize Ezio's weapons of choice, the hidden blade and crossbow, while in multiplayer modes players gain access to a wide variety of weapon, depending on the character they choose to play as. Examples of this include: the Axe, wielded by the Executioner; the Fan, used by the Courtesan; the Syringe, the tool by the Doctor; the Dagger, used by the Priest; the Switchblade, carried by the Prowler; and the Claw, used by the Nobleman.Key Game FeaturesAs Ezio, a legendary Master Assassin, experience over 15 hours of single player gameplay set in the living, breathing, unpredictable city of Rome.Recruit and train promising young Assassins. Deploy them across the city as you see fit, or call upon them to aid you in your quests.Collaborate with real historical characters such as Leonardo DA Vinci, Niccolo Machiavelli and Caterina Sforza.Use your hard-won currency to revitalize the crumbling capital city. Rally the citizens to your cause and unlock extra factions and missions.Swiftly eliminate your enemies using tools such as poison darts, parachutes, double hidden blades, hidden guns, and an advanced flying machine at your disposal.Choose from multiple authentic character classes, each with their own signature weapons and killing moves. With richly-detailed maps and a wide variety of unique multiplayer modes, you&rsquo;ll never fight the same way twice.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/61t6eDyoQXL._SY300_.jpg", "related": {"also_bought": ["B004YVOCV4", "B00269DX5W", "B002I08RR8", "B000P46NMA", "B0050SXFKE", "B00BMFIXKQ", "B002I0H2G0", "B0022TNO7I", "B002I0F5M8", "B00503E9FY", "B005C2D1YI", "B0012N94WO", "B0036FDHT2", "B0050SXLQC", "B002NN7AKU", "B001NX6GBK", "B000FQBF1M", "B002I0J5UQ", "B000HKP88C", "B0050SXX88", "B000ZK9QCS", "B00198PO5I", "B005GM3XVA", "B004FUI84G", "B004HYK8Y8", "B0050SXVK8", "B0086V5V8G", "B00C7103DO", "B007SRM5U6", "B001NIP3EG", "B001D7T2VC", "B007TYC8MI", "B002ZJNWWC", "B003P9FRGA", "B0050SWZHS", "B0016B28WU", "B002I0J82G", "B003O6CBIG", "B002BSA1C6", "B002BRZ6UE", "B0081B1O5A", "B002I0K5NC", "B0050SX9VO", "B001E8VB6O", "B003C1I06U", "B000UW21A0", "B000WMEEBM", "B0037LVW9M", "B006ZTHFPS", "B001SGZL2W", "B003JVCA9Q", "B008CP6MA2", "B0088I7L76", "B000FPOJOS", "B003O6E67A", "B006VB2UMI", "B000X1TC0U", "B004EQCCI4", "B0050SXGU8", "B0076ZQSFI", "B004PAGJNS", "B004BCZLQ6", "B0050SXKU4", "B0055202HE", "B002I0J8FI", "B001JKTC9A", "B0050SXEM8", "B0050SWUTQ", "B005THAX6K", "B002I0J5YW", "B000P297EI", "B0085CA8QG", "0307469697", "B009GZX49Y", "B0017ZIIK6", "0761555579", "B001QXNBNI", "B000ZK695U", "B005JGC5BC", "B004HCYVO8", "B0012N3T3Y", "B002I0K6DG", "B004NRN5EO", "B008J16APQ", "B00163LW7K", "B004L5SJ58", "B0050SX2MK", "B000ZK7ZOE", "B004918C4M", "B002I0GX88", "B000WS97QI", "B001UWGCW2", "B007CM0K86", "B003O6ECOM", "B004UDB9SA", "B0045U01OG", "B0050SXOD2", "B001ASJIS6", "B0056WJA6M", "B00269QLH4"], "bought_together": ["B00269DX5W", "B004YVOCV4"], "buy_after_viewing": ["B009GZX49Y", "B00BMFIXKQ", "B0050SXFKE", "B00269DX5W"]}, "salesRank": {"Video Games": 1167}, "categories": [["Video Games", "PlayStation 3", "Games"]]}