{"asin": "B00C0Z5CYW", "categories": [["Beauty", "Skin Care", "Sun", "Skin Protection"]], "description": "We formulated melansol 100% natural sunscreen SPF-30 as an extreme sunscreen for very fair skin during lengthy sun exposure and not for casual daily use. Because of the active ingredient, titanium dioxide, lies on top of your skin to safely reflect or scatter UV light, it will have a slight whitening effect when applied. MelanSol SPF-30 is broad spectrum--tested high for both UVA and UVB filtering. It reflects up to 97% of UV light and is recommended during lengthy sun exposure for skin that always burns and never tans. We recommend melansol SPF 10 for a daily wear sunscreen. All melansol skin care products are certified 100% natural by the npa. All ingredients have been awarded the natural products association (npa) green seal. The green seal certifies that each ingredient, and the way it was processed before being included in the formula, is completely 100% chemical free. MelanSol SPF 30 protects better because it has natural antioxidant technology. This technology soaks into your skin to detoxify free radicals, which helps prevent sunburn, sagging skin, wrinkles, age spots, non-melanoma skin cancer, and slow skin aging. The additional natural ingredients condition, hydrate, nourish, rejuvenate, and help skin repair. Peace of mind and optimum health is priceless, so use this soothing sunscreen generously all over your face and body, especially around your eyes. People love it because it doesn't burn their eyes. MelanSol SPF-30 starts protecting the moment it's applied, has a light citrus fragrance that dissipates in a few minutes, and is water resistant for up to 40 minutes. Check out our complete list of ingredients--not just the ones we think you will recognize.", "title": "MelanSol 100% Natural Sunscreen SPF 30, 3.4 Ounce", "price": 29.99, "salesRank": {"Beauty": 120538}, "imUrl": "http://ecx.images-amazon.com/images/I/41ILKoPFYwL._SX300_.jpg", "related": {"also_bought": ["B00C0YP71Q", "B00BZZCNHM", "B00C0Y03VU", "B00C0CVAY6", "B00C1006ZG", "B00AEFSUTE", "B001FVIRHQ"], "also_viewed": ["B001FVIRHQ", "B004L5NBSS", "B00D4A1CF0", "B0051O0BG8", "B0016BM9WY", "B002RZY5CK", "B001DJDPZY", "B0051PLB1Q", "B0088W9AYO", "B00KS27JFY", "B004TSHPMK", "B001FOUVE0", "B004BYR13K", "B00C0YP71Q", "B00C0CVAY6", "B00C0Y03VU", "B0088W8IN8", "B005F69YLU", "B005MXAFH8", "B00BZZCNHM", "B002C8A0FI", "B000N2ZYGU", "B003II53Z8", "B00JKPO5J8", "B003Z0JLDE", "B000FCY95A", "B001B9RGVU", "B001ON0EXU", "B007Y8OOSU", "B0012ZMBDQ", "B001GFDQS6", "B007YJVGXU", "B003Z0NHA2", "B001A47C38", "B0025KOR8O", "B001ANOOOE", "B004U5EQ1K", "B004FUUMJK", "B00HNNQLZ0", "B00DJWNBXY", "B00AH8FASM", "B00HX2C72W", "B0055M466W", "B00BYDAH3M", "B00ENOE34S", "B007Y7X4KU", "B000WUHSGM", "B00KZU0N7A", "B003VPK4NY", "B000GZNGLE", "B003X5B81Y", "B004OXEQ4U", "B00H48JXL8", "B004BYUQG4", "B001FPT64U", "B0058KE01M", "B0063A42GE"], "bought_together": ["B00C0YP71Q", "B00C0Y03VU"]}}