{"asin": "B00551XMWC", "categories": [["Electronics", "Accessories & Supplies", "Blank Media", "BD-R Discs"]], "description": "Blu-ray Disc is the next-generation optical disc format that was developed to enable recording and playback of high-definition video (HD) as well as storing large amounts of data. A single-layer Blu-ray Disc can hold 25GB which can be used to record over 2 hours of HDTV. Blu-ray uses a blue-violet laser to read and write data while current optical disc technologies such as DVD use a red laser. The shorter wavelengths of the Blu-ray technology make it possible to record more data on the same space. These discs are safeguarded by Philips' super hard coat which protects against everyday wear and tear. With the rapid growth of HDTV Blu-ray will meet the consumer demand for recording HD programming and is expected to replace VCRs and DVD recorders over the ing years.Features: Super fast recording speeds. Extra-tough coating protects the disc Philips Blu-ray discs have a cover layer of unrivalled toughness and uniformity protecting the discs vital recording layers. Philips Blu-ray discs are far superior to standard CDs and DVDs. High capacity recording 25GB on one disc is more than 5 times the capacity of a standard DVD Preserve your valuable data on DVD Reliable qualified media ensures you data will be preserved Stores up to 135 Minutes of high definition video To keep pace with the growing popularity of high-resolution video single-layer Blu-ray discs provide you with the storage capacity for up to 135 minutes of HD video. If you record at normal DVD quality you can store more than 5.5 hours of video. Error correction system which ensures recording and playback reliability Blu-ray discs offer an advanced error correction system much more powerful than in CDs and DVDs ensuring maximum protection of your data and video. Stable inorganic coding layers further insure reliability The recording layers are made from highly stable inorganic layers that are unaffected by exposure to light ensuring longevity of the disc. This type of inorgani", "title": "PHILIPS BD-R25GB 6X Blu-Ray SM Cake - 25 Pack - Computer Accessories", "price": 10.95, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41J-bckFHVL._SY300_.jpg", "related": {"also_bought": ["B005TFI72O", "B00AO1XFM0", "B007YWMCA8", "B007VPGL5U", "B007A9NSR6", "B004ZMG55I", "B004LB0K0Y", "B009GGC4B2", "B0074BPFW6", "B008CNXXM4", "B00471HK0Q", "B004DNA0HI", "B007581HIO", "B0083TGZFO", "B003WO7XP6", "B007ILBJAY", "B009KXE4VO", "B005GU0BLC", "B002SY5GRS", "B0051UY168", "B004VS8VA8", "B003AXW2YQ", "B008M1B3R8", "B000U0HRKG", "B004S6315S", "B004VSA7GO", "B004Q9YPYI", "B006X2HD2M", "B008YQAFMK", "B0075WEPJI", "B0056DV0L4", "B000UWX70S", "B00A4ZXE40", "B003S51GUC", "B004DNEZUG", "B000F7JIYM", "B004DTVJG8", "B002LU80QS", "B005T3GRLY", "B000U0E08I", "B00834SJU8", "B006LG9R4M", "B007REV4YI", "B00465XLWO", "B006M6Q97O", "B006U1YUZE", "B001BXS4LW", "B003ZDNZT2", "B0013DO3BU", "B001TOD7MO", "B00CTSDDVO", "B00DUHUPCS", "B001D8OGOO", "B003WO0DNA", "B002S4027C", "B009DZLVN8", "B002Q7IKYS", "B00AXYQGKG", "B005T3GRN2", "B00632U162", "B0013TUV6A", "B004LHJD4M", "B000U0HRJM", "B004DN7PBW", "B008H3SW4I", "B005AT3F1W", "B0026CN0KW", "B002WCOZUU", "B001B96HLU", "B000067S60", "B001TOD7ME", "B007SZ0EOW", "B001QUA6RA", "B00305N48C", "B009XU13H2", "B00081A2KY", "B0036Q7MV0", "B008HV6MSI", "B004W2JL2A", "B0009WU65I", "B000NQRE1E", "B005GWAWZA", "B008XBCJ34", "B005HMKKH4", "B004GF1PC2", "B005ARQV6U", "B005LAIHY0"], "buy_after_viewing": ["B007A9NSR6", "B00471HK0Q", "B00AO1XFM0", "B007VPGL5U"]}}