{"asin": "B00427ZLRO", "related": {"also_bought": ["B0042RUSYU", "1454701358", "B0090878BW", "B003VNKNEQ", "B004GJ0EC0", "B004J037PC", "B004NL1E8E", "B00FXYTLIK", "B005IGVXJS", "B004KIEJK0", "B00489NETI", "B0058DXA0G", "B00CV9MIEE", "B004FYCGJU", "B006424N60", "B003VNKNF0", "B003ZYF3M8", "B007URHT00", "B0046K16TO", "B003L1ZYZ6", "B00007EDZG", "B002132LEM", "B004VHULS4", "B0090SVDEK", "B0042RUSXG", "B0052H7XAQ", "B0042RUSWW"], "bought_together": ["B003VNKNEQ"], "buy_after_viewing": ["B003VNKNF0", "B003VNKNEQ", "B005IGVXJS", "B00EZAYD4A"]}, "title": "Nikon Coolpix P7000 10.1 MP Digital Camera with 7.1x Wide Zoom-Nikkor ED Lens and 3-Inch LCD", "price": 369.0, "salesRank": {"Camera &amp; Photo": 3735}, "imUrl": "http://ecx.images-amazon.com/images/I/41GvAVfUeBL._SX300_.jpg", "brand": "Nikon", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The Nikon Coolpix P7000 is a compact, high-performance digital camera offering superb image quality and precise imaging control. An ideal traveling companion to your DSLR, the Coolpix P7000 will be found in gadget bags of advanced amateurs and pro-shooters alike. Powered by Nikon's leading-edge technology, the P7000 is designed for no-limits shooting. In low-light or tricky light, for fast-moving subjects, dramatic landscapes and detailed close-ups, here's a camera capable of keeping pace with your imagination to deliver your take on your world.Superbly designed for swift, sure and comfortable handling, the P7000 features 10.1 megapixels engineered on a large 1/1.7-inch CCD Sensor. Coupled with the new Nikon EXPEED C2 imaging engine and a versatile 7.1x optical 28-200mm Wide Zoom-Nikkor ED glass lens, the Coolpix P7000 has been designed from the ground up to deliver outstanding image quality. Giving photographers both control and creative options, the P7000 offers RAW file capability. Plus, low-light performance is enhanced with an ISO sensitivity range up to 6400 at full resolution. A bright 3-inch, 921,000-dot Clear Color Display with electronic Virtual Horizon Indicator and an optical viewfinder provide bright, provide clear viewing and image sharing. The Coolpix P7000 also offers HD movie recording with zoom, autofocus and stereo sound recording, a variety of creative control functions. The Nikon Coolpix P7000 unleash your creativity!Nikon Coolpix P7000 HighlightsSuperior Image Quality10.1-megapixel, large 1/1.7-inch CCD sensor for stunning images.7.1x Wide-Angle Optical Zoom-Nikkor ED Glass Lens. Versatile 28-200mm lens ranges wide to capture landscapes, zooms in to get close to the action. In the Nikkor tradition of precision optics, the high-quality ED glass lens delivers superb color and razor-sharp results.5-way VR Image Stabilization SystemOptical VR Image Stabilization by lens shift minimizes the effects of camera shake.Hybrid VR Image stabilization by lens shift and electronic VR.Motion Detection automatically detects moving subjects and adjusts shutter speed and ISO to compensate for camera shake and subject movement.High ISO up to 6400 at full resolution for optimum results when shooting in low light or photographing fast-moving subjects.Nikon's Best Shot Selector (BSS) automatically takes up to ten shots while the shutter is pressed, then selects and saves the sharpest image.RAW file function compatible with Mac&reg; and Windows&reg;.EXPEED C2 continues to expand the possibilities of photography with improved levels of image quality, fine detail and processing speed. Custom-optimized for each Coolpix model, Nikon's renowned digital image processing engine ensures outstanding images.Advanced Functions3-inch Ultra-High Resolution (921,000-dot) Clear Color Display for still images and movies that come alive with rich detail and improved contrast. The large LCD's wide viewing angle and anti-glare coating make it easy to compose, view and share pictures.Large Optical viewfinder with diopter adjustment dial.Remote control operation with optional wireless ML-L3.Optional Wide Angle Converter (WC-E75A) for 21mm coverage (requires UR-E22 adapter ring)Creative ControlDial controls for key functions including ISO, white balance, bracketing, exposure compensation and more.PSAM (Program, Shutter, Aperture, Manual) exposure control, custom function control.ISO can be set as high as 6400 at full resolution; 12,800 in Low noise Night Mode (3-Megapixel).Tone Level Information provides photographers with 9 levels of grey scale information about the scene for fine exposure analysis according to user's creative needs.In-camera editing functions include Exposure Compensation, Coolpix Picture Control, Noise Reduction Filter, Quick Retouch, DLighting and Active D-Lighting.Electronic Virtual Horizon Display enables precise leveling of the camera in landscape or portrait orientation during LCD monitor shooting.Coolpix Picture Control can be customized for Image Sharpening, Contrast, Saturation, Filter Effects, and Tone.HD Movie RecordingHD (720p) Movie with Stereo, Mic Input Jack and HDMI Output. Records at 30 fps with Zoom, Autofocus and stereo sound. Mic Input Jack allows for optional microphone to be used during recording and HDMI output allows easy in-camera playback or convenient playback on HD-TV or computer.High-Speed PerformanceUltra-fast start-up, autofocus and shooting.Subject Tracking tracks a moving subject to ensure sharp focus.Shoot Continuously up to 45 pictures at approx. 1.3 fps at full resolution.Interval Timer Shooting captures images at specified time intervals Convenient FeaturesSmart Portrait SystemSmile Timer automatically releases the shutter when your subject smiles.In-Camera Red-Eye Fix automatically corrects most instances of red-eye as you shoot. You may never see red-eye again.Face-Priority AF. Nikon's face-finding technology automatically detects up to 12 faces.Skin Softening smoothes skin tones at three different levels for optimal portraits; can be applied while shooting or during playback.Built-in Flash plus i-TTL Flash function when used with optional Nikon Speedlight System.18 Scene Modes, including Scene Auto Selector, for optimized shooting in a variety of settings and situations.Scene Auto Selector automatically recognizes the scene you're shooting and selects the most appropriate scene mode; offers six scene modes plus auto.Macro shooting as close as 0.8 inches.350 still shots (approx.) with supplied EN-EL 14 Li-ion rechargeable battery."}