{"asin": "B000OHYIDE", "description": "Here's a solid detector from Whistler, with basic detection minus unneeded bells and whistles. Get total band protection with a simple icon display, city and highway modes, quiet mode, and other features, along with Whistler exclusives like the can&rsquo;t-miss Twin Alert Periscopes.Basic detection minus unneeded bells and whistles.Click to enlarge.Whistler's exclusive Twin Alert Periscope provides an added attention-getting visual alert.Includes windshield mount.Total Band ProtectionProvides complete band coverage of all Laser, Radar, VG-2, and Safety Radar bands.Icon DisplayThe XTR-140 display offers easy-to-read icons to indicate power, city mode, radar band identification, and signal strength.Twin Alert PeriscopeWhistler's exclusive Twin Alert Periscope provides an added attention-getting visual alert, with two extra LEDs flashing on and off when the unit alarms.Three City Modes and Highway ModeHighway mode provides full audio and visual warning of laser/radar systems while maintaining full sensitivity. Highway mode is the default setting of all Whistler's laser/radar detectors. City mode helps reduce the annoyance of automatic door openers and burglar alarm alerts by providing an initial alert (same distance as Highway Mode), then remaining quiet unless the signal strength becomes very strong. When the signal increases, the unit will alert briefly to notify you of the change in signal strength.Quiet/Auto Quiet ModesPressing QUIET before a signal is detected engages Auto Quiet Mode, which automatically reduces the audio level after the initial warning to a low audio level setting. Pressing QUIET during a radar/laser encounter silences audio alerts, while allowing visual alerts to keep you informed.Alert PriorityWhen two or more signals are received at the same time, the alert priority is: Laser, VG-2, Speed Radar, Safety Radar.Example: If X band is alerting, then suddenly a VG-2 signal is detected, the VG-2 warning will override the X band alert.Vehicle Battery Saver ModeThe Vehicle Battery Saver Mode automatically shuts off your detector within three hours if you forget to turn it off. The timer is reset if the detector is turned off or unplugged, or any button is pressed before the six hours have expired. The detector will alert you with an audible and visual warning before it shuts off.Patented VG-2 Cloaking TechnologyThe VG-2, also known as a \"radar detector detector,\" is a special receiver used by police to detect signals radiated by a radar detector. The XTR-330 alerts you its presence, and thanks to Whistler's patented VG-2 cloaking technology, it also provides undetectability.What's in the BoxWhistler XTR-140 laser/radar detector, windshield mount, power cord, and user's manual.", "title": "Whistler XTR-140 Laser/Radar Detector with Exclusive Twin Alert Periscopes", "price": 44.89, "imUrl": "http://ecx.images-amazon.com/images/I/41qHGpfnntL._SX300_.jpg", "related": {"also_bought": ["B001DSIMAI", "B000FED6NO", "B00BQSVKI6", "B00C3UG3LA", "B003JIAA4Q", "B0025QQMIG", "B00E40TGA2", "B00FAUJNZS", "B0017W86FG", "B001S0I26K", "B005VFXNEE", "B004T0BJ7A", "B00BYAXKQ6", "B00AJSJE3C", "B000EEP5Y8", "B0016LE80K", "B000EVU8J8", "B0009X8O2E", "B00B7TESWY", "B0034XQXB0", "B0028MOOJG", "B00AWUDEMO", "B001CGW338", "B003RQBKLC", "B004RO3QOM", "B00813YLZS", "B004RO3QPQ", "B000N4UQL6", "B001TE5V0U", "B000BZATW8", "B0011URFRE", "B00CRGRIBE", "B0018NB3OK", "B002C3T8Q0", "B00691WMJG", "B000XT30G4"], "bought_together": ["B001DSIMAI", "B000FED6NO"], "buy_after_viewing": ["B004RO3QPQ", "B004RO3QOM", "B0017W86FG", "B001UALXG4"]}, "categories": [["Electronics", "Car & Vehicle Electronics", "Vehicle Electronics Accessories", "Radar Detectors"]]}