{"asin": "B002HEWA28", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Encased in a beautifully sculpted metal shell with a double coated lacquer finish and measuring only 22.7mm thick, the FinePix F70EXR offers several enhancements over its predecessor, the FinePix F60, and boasts marked improvements over competing long-zoom digital cameras, particularly in the areas of design, image quality and capture technology.FinePix F70EXR HighlightsSuper CCD EXRLong zoom compact cameras, as opposed to standard compact digital cameras, typically use a smaller sensor that is vulnerable to difficult lighting conditions since light has a harder time reaching the CCD sensor. To mitigate this vulnerability, Fujifilm has introduced its award-winning EXR technology into the FinePix F70EXR, allowing for significant improvement in image quality against the competition.Introduced earlier this year with the FinePix F200EXR, Fujifilm's EXR technology uses the human eye as the basis for the perfect camera sensor, creating a Super CCD sensor capable of registering excellent levels of detail when switched to its HR (High Resolution) mode. The FinePix F70EXR is also capable of offering excellent quality in low light and superb highlight detail in contrast light when switched to its SN (High Sensitivity and Low Noise) mode and DR (Wide Dynamic Range) modes respectively.EXR ModesAn advanced feature on the FinePix F70EXR, 'EXR Auto' helps take the guesswork out of setting the camera by doing it for you.  EXR Auto is a sophisticated set of program modes that can automatically detect six different types of scenes - Portrait, Landscape, Macro, Backlit Portrait, Night, and Night Portrait. The camera will recognize the scene and optimize focus, color balance, exposure, flash and sensitivity and will automatically switch the sensor to HR, SN or DR mode depending on the lighting conditions of the scene.  By using EXR Auto, users can let the camera do all the hard work and concentrate more on getting the best shot possible.Multi Frame Technology: Pro Focus Mode / Pro Low-light ModeNew Fujifilm EXR digital cameras, including the FinePix F70EXR will offer several new shooting modes that combine the power of Super CCD EXR with Multi Frame Technology to enable users to capture exceptional images that rival the most expensive professional D-SLR cameras.Typically, one of the ways to distinguish 'D-SLR' photography from 'compact' photography has been the use of 'wide aperture' to create mood and depth in a picture. These 'professional' shots are now possible on the FinePix F70EXR, which uses Pro Focus Mode to combine two or three burst shots together. Through complex digital imaging technology, a crisp shot of the subject is synthesized against a defocused background and foreground. Ideal for portraiture, nature photography or any subject that needs 'lifting' from its background, the FinePix F70EXR Pro Focus Mode provides satisfying professional results at the touch of a button.Meanwhile, Pro Low-light Mode is applied to solving the problems of noisy low light shots.  With current cameras, it is possible to achieve relatively blur-free low light shots using high ISO and CCD shift mechanical image stabilization.  However, high ISO settings typically come at a cost, as the ISO 1600 setting will invariably produce distracting and ugly noise. In Pro Low-light Mode, the camera will take bursts of four high sensitivity images using Pixel Fusion Technology[*1] in quick succession.  With Multi Frame Technology, the 1st, 2nd, 3rd and 4th images are overlapped to create one image with extremely low noise.Super Slim 10x Zoom LensIn conjunction with the Super CCD EXR sensor, the FinePix F70EXR features a Fujinon 10x optical zoom lens that produces crisp high resolution results throughout the focal range, from 27mm wide-angle to 270mm telephoto.  The lens of the FinePix F70EXR features Super EBC Coating that keeps ghosting and flare to minimum to allow for optimal picture quality.1x, 5x, 10x optical zoomFilm Simulation ModesSimilar to other high-end FinePix models, the FinePix F70EXR offers five different film 'modes' to allow the photographer full creative expression to explore a variety of pre-set color and contrast modes designed around Fujifilm's most famous film emulsions. The modes are:Velvia/Vivid mode for rich and luscious landscapesPROVIA/Standard mode for excellent, sharp, standard photographyASTIA/Soft mode for soft, fine, smooth tonalityBlack &amp; White mode captures the dramatic honesty of your image in black and whiteSepia mode creates a sense of nostalgia with the warm brown \"antique\" tones of SepiaIn the Provia, Velvia and Astia modes, the dynamic range can now be set to 800% to improve and highlight details further.1) FinePix F70EXR LCD, 2) Conventional LCDNew 'Super Intelligent' FlashThe FinePix F70EXR offers a radically improved flash control system which efficiently controls the level of flash for a given exposure to produce beautifully balanced flash illumination across the foreground and background.  Gone are the ugly washout shots where the subject is blasted with light and the background dark and unexposed.  Super Intelligent Flash is most useful in macro photography where the contrast between subject and background can be especially challenging, but is also effective for night and backlit photography.New High Contrast LCDThe FinePix F70EXR is fitted with an improved high contrast 230K-pixel 2.7-inch LCD.  The high contrast LCD is a considerable benefit in bright light, and means that the camera can be pitched  at various shooting angles to enable framing of awkward shots.  Viewable at 160 degrees both vertically and horizontally, the LCD is bright and clear for beautiful rendition of shots in playback.Dual StabilizationLong zoom cameras need stabilization more than any other compact, with handshake and subject movement a particular problem in low light at telephoto range.  The FinePix F70EXR reduces blur to a minimum by deploying Picture Stabilization to automatically increase shutter speeds to freeze action, and CCD Image Stabilization to counteract the problems of handshake.  By cleverly combining these two, blur is reduced to an absolute minimum.Face detection with instant red-eye correctionFace Detection 3.0 and Automatic Red-eye RemovalTo provide perfectly exposed and focused portrait shots, the FinePix F70EXR is fitted with Fujifilm's latest Face Detection technology which is able to track up to 10 faces simultaneously, at almost any angle to the camera. The system instantly corrects red-eye and then saves both the original and the corrected image file automatically.What's in the BoxLi-ion battery NP-50, Battery charger BC-45W, Hand strap, USB cable for the FinePix F70EXR, AV cable for the FinePix F70EXR, CD-ROM, Owner's manual.", "title": "Fujifilm Finepix F70EXR 10MP Super CCD Digital Camera with 10x Optical Dual Image Stabilized Zoom and 2.7 inch LCD", "price": 5.99, "salesRank": {"Camera &amp; Photo": 9127}, "imUrl": "http://ecx.images-amazon.com/images/I/41od3U787RL._SX300_.jpg", "related": {"also_viewed": ["B002LITT3S", "B001QENO7A", "B002LITT3I", "B0075SUIEI", "B001PKEJZQ", "B001P06Q66", "B0075SUII4", "B00BOYFX30", "B0011ZCDKS", "B00KMCYJ3A", "B00728ZAFS", "B001QFZM4W", "B00AWYMXZY", "B0095F5AFQ", "B006T7QSV8", "B001SER44W", "B002LITT56", "B001R23JMQ", "B0011ZK6ZM", "B0011Z23XK", "B00HV6KL3W", "B000P6I4XO", "B001CCLBSA", "B00728ZBA2", "B0013TUG5G", "B00CFCTDMC", "B00I58LVKC", "B00HV6KJPM", "B004HW73S4", "B003ZSHNG8", "B000J6E1LY", "B00ATM1MUG", "B00FP1HOB2", "B00BHQ5NVM", "B0091T97J6", "B00HZE2PYI", "B00B46XSDK", "B0095F5AFG", "B002LITT42", "B005KBB79C", "B006ZAHMPA", "B00DSLEK4A", "B00ATM1LY8", "B0075SUK14", "B004NBZ8DQ", "B001OI2LV8", "B0034XFG86", "B00B5MUJ58", "B0091TC3OC", "B00I6ZSLCU", "B0011ZK6PC", "B00CFCTGFG", "B00HV6KIDA", "B00HV6KIA8", "B00HV6KJM0", "B00ATM1NAU", "B00FPKDPXY"], "buy_after_viewing": ["B003F7DWH8", "B003VNKNF0", "B007BJHETS", "B006T7QSV8"]}}