{"asin": "B0033160U2", "description": "Take your files and applications anywhere! The pocket-sized USB powered Iomega&reg; Prestige&trade; Portable Hard Drive, Compact Edition requires no external power supply &#8212; just plug it in and go.At A Glance Side Bar - set align to right or left depending on where you want it to appear. width = 250px. Images should be 240px wide or lessPrestige Portable Hard Drive,Compact EditionAt a Glance:Up to80,000* Songs(MP3s)Up to128,000* Digital PhotosUp to123* hoursof DVD VideoUp to39* hoursof HD VideoEnd of At A Glance Side BarStart Environmental Side BarThe portable drive for every lifestyle &#8212; Easy, compact, and perfectEnd Environmental Side BarAt just over 4 inches long, the super-compact, lightweight Iomega&#174; Prestige&#153; Portable Hard Drive, Compact Edition is perfect to carry in your pocket, backpack or laptop bag. It requires no external power supply &#8212; just plug it in and go. And with the Drop Shock&#153; feature, the Prestige Portable Hard Drive is rugged enough to safely store data for travel environments. Iomega&#174; Protection Suite includes Trend Micro&#153; Internet Security, EMC&#174; Retrospect&#174; Express Backup software, Iomega QuikProtect, and MozyHome&#153; Online Backup service at no additional cost. (software available via easy download). This is a great travel companion that lets you take your files, photos and music anywhere.Compact&#8212; Super-compact drive easily fits in a pocket, laptop bag, or backpack; One of the smallest portable hard drives in the marketplace!Easy-to-use&#8212; Simple USB 2.0 interface with no external power supply requiredDurable&#8212; Sturdy aluminum construction; Drop Shock&#153; technology on all models; 3-year limited warranty with product registrationSecure&#8212; Iomega&#174; Protection Suite included at no additional cost. Software available via easy download.Iomega Protection Suite IncludedYour data and your computer are both secure with Iomega's Protection Suite of software.Receive a full suite of software solutions when you purchase Iomega Prestige Portable Hard Drives! Iomega now includes Trend Micro&#153;, Iomega QuikProtect, EMC&#174; Retrospect&#174; Express Backup software, and MozyHome&#153; Online Backup service to protect your data and your computer.A free 12 month subscription of the Trend Micro&#153; Internet Security software is included to protect your PC with anti-virus, anti-spyware, 2-way firewall, and web security protection; Plus, choose Iomega QuikProtect for simple scheduled file-level backup or choose EMC&#174; Retrospect&#174; Express or Express HD to back up your entire computer. You can also choose MozyHome Online Backup for the convenience of backing up with 2GB online capacity free! The MozyHome Online Backup service means you can restore your most important data from any computer with Internet access, at any location.ContentsPortable Hard DriveUSB 2.0/power cableQuick Start GuideIomega Protection Suite (software download)3-year limited warranty with product registrationSystem RequirementsBuilt-in USBPC:Microsoft&#174; Windows&#174; XP; Windows Vista; Windows 7 (32-bit)256MB RAM or higherMac:Mac OS X 10.4 - 10.612MB RAMDrive must be reformatted for use with Mac (instructions included).* Contents refers to number of songs, photos, or hours of video, calculated as follows &#8212; Songs (MP3): 128 kbps bit rate using 11:1 compression ration, 4 min/song; Digital photos: 2.5MB per JPG photo using 6 megapixel camera; DVD Video: 5.5 Mb/s (2.597 GB/hr) data rate; DVD Video: 8.3 GB/hr recording rate for 720p or 1080i output. These examples are for illustrative purposes only. One gigabyte (GB) = one billion bytes. Your results may vary.", "title": "Iomega Prestige 320 GB USB 2.0 Portable  External Hard Drive 34807", "price": 120.0, "imUrl": "http://ecx.images-amazon.com/images/I/21Sr2gQ7V%2BL.jpg", "related": {"also_viewed": ["B001DCELO0", "B00834SJSK", "B005J7YCHG", "B004NIDHXC", "B004NIAG5E", "B003GALRIA", "B006B9B2PQ", "B004L9M4C8", "B002BWOO2K", "B00BOHNYU6", "B00CGUMVHW", "B004NIL33I", "B00BOHNZ0A", "B00H98AXOE", "B009733EZY", "B0058VIWTM", "B00D695GS8", "B007FQNLR6", "B001FA064E", "B006Y5UPZU", "B002JSQ97Y", "B007FQNKRC", "B005CP2OAC", "B006Y5UV4U", "B00BOHNYTW", "B0085JRRAY", "B00H4YGR48", "B00D695IF4", "B00E83X9P8", "B005EWTL7C", "B001CBNH4C", "B0028Y4QEC", "B000ND75C0", "B00FF90BSW", "B00HFRWWAM", "B00EAS8AA0", "B0062FZ3PY", "B00CGUMSZC", "B006Y5UV4A", "B00CO1I2FS", "B00H4XH5FY", "B00EAS8MWQ", "B005FYNSZA", "B00EAS8M0S", "B00812F7O8", "B005J7YBRW", "B00H4XH5IG", "B00E055H5O", "B00CE5QOIG"], "buy_after_viewing": ["B001DCELO0", "B00834SJSK", "B005J7YCHG", "B001FA064E"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]]}