{"asin": "B000N5WPQY", "related": {"also_viewed": ["B004H4X6Z6", "B000PDUC6Y", "B000FIY9MC", "B0018D6CVO", "B000BQYB0S", "B0030BG1HC", "B004X5K9S6", "B002IC1CBO", "B000H1UAU2", "B00D3KJN3O", "B006Z63KBY", "B00AW72V58", "B007PQNEQ4", "B0042ZCIWW", "B00BFRB6X2", "B006Z63KX2", "B004JMZH2G", "B00CMUEIHW", "B004R8VFZK", "B000MV7WQM", "B00BJ2FQEI", "B004QHFNO6", "B000FIY9OU", "B00008Z9ZD", "B001733FUQ", "B000FIY9Q8", "B0030BG1HM", "B00BFRB6AK", "B00BMJ1R5A", "B0079DH4O6", "B00BFRB6WI", "B0040RV364", "B00BFRB6BY", "B004J17F36", "B00B58EJ9E", "B00BFRB6D2", "B00H1U1SIU", "B00EOMCM6A", "B00845MJI4", "B00BFRB5BK", "B00IS180VE", "B00BFRB6CI", "B000FIWVIG", "B007WQBELE", "B004T9EJVO", "B000N5064C", "B003D7SH66", "B00BGKSP9Q", "B004J17F2M", "B0030BG1IG", "B00BRQ05II", "B002ECYRH4", "B00BFRB6A0", "B00CLCO6PA", "B00B1T0KLI", "B007PQNNKG", "B00004R9R2", "B003AOBT7Q"], "bought_together": ["B000FIWVIG"]}, "title": "Mantis 7250-15-02 3-Speed Electric Tiller/Cultivator with Border Edger and Kickstand", "price": 329.0, "salesRank": {"Patio, Lawn & Garden": 50630}, "imUrl": "http://ecx.images-amazon.com/images/I/410S8ATTulL._SY300_.jpg", "brand": "Mantis", "categories": [["Patio, Lawn & Garden", "Lawn Mowers & Outdoor Power Tools", "Tillers"]], "description": "You'll be ready to garden all year round with the Mantis 7250-15-02 Three-Speed Electric Tiller/Cultivator. With a powerful,  engine, durable tines, and compact profile, the Mantis Electric Tiller/Cultivator is ideal for creating new gardens, tilling in narrow rows and raised beds, or along fences. With the help of the included border-edger accessory and convenient kickstand, the Mantis Electric Tiller/Cultivator will help you maintain a bountiful garden for years to come.Featuring a border-edger, kickstand, and folding handles, this electric tiller/cultivator makes garden maintenance easier than ever.With a powerful engine, this toolis ideal for creating new gardens.View larger.Powerful but Easy to ControlDon't be fooled by the small, compact design of the Mantis Electric Tiller/Cultivator. Though it weighs a mere 21 pounds and has a width of only nine inches, the Mantis is powerful, thanks to its three-speed electric motor.A reliable push-button primer will get you started, but the tines won't move until you squeeze the throttle. Once you've activated the throttle, the patented serpentine tines spin at up to 240 RPM to break through sod--even hard clay--tilling down to a depth of 10 inches.The Mantis Electric Tiller/Cultivator makes it easy to maintain your garden. Simply reverse the tines to shallow-cultivate depths of up to three inches--it's much faster than using hand tools. And because it tills a nine-inch-wide path, this tool is especially useful in tight spaces and hard-to-reach areas. That's a real advantage for raised-bed gardeners.Convenient, Versatile, and DurableThe Mantis Electric Tiller/Cultivator features folding handle bars which make it convenient to store in a garage or tool shed.And with the included border-edger accessory and optional attachments (sold separately), the Mantis Electric Tiller/Cultivator can be used beyond the confines of your garden. Its lightweight design, convenient carrying handle, and adjustable kickstand make it portable, so adding an accessory such as a lawn aerator could potentially keep you busy all summer and into the fall.The Mantis Electric Tiller/Cultivator's durable one-piece cast gear box is designed to last. Additionally, the tines are guaranteed against breakage for the lifetime of the tool.What's in the BoxThree-speed electric tiller/cultivator with serpentine tines, border-edger accessory, and kickstand.Patented serpentine tines spin at up to 240 RPM to break through sodand even hard clay, tilling down to a depth of 10 inches.View larger."}