{"asin": "B0002SAE56", "description": "Share your music while on the road with the Harman JBL on Tour portable speaker system, which features an integrated protective cover that slides open to reveal a pair of full-range speakers. The slightly curved chassis measures 7 by 1.4 by 3.5 inches (W x H x D) when closed. When open, the cover shifts focus to serve as a stand, pointing the speakers upward to produce optimal sound on a flat surface. The system is compatible with most portable audio players thanks to its stereo mini-jack connection, which hooks up to such devices as the iPod, iPod mini, and a variety of other MP3 players, CD players, desktop computers, and laptops. The JBL on Tour is also easy to control, with a touch volume pad that both manages the volume and mutes the sound when desired. The speakers also remember the previous volume setting once the system shuts down.Unlike many portable speaker systems, the JBL on Tour prides itself on its steady bass and clear, accurate audio. The device employs Harman's digital amplifier technology and Odyssey aluminum-domed transducers to deliver a full, rich frequency response that extends from low bass notes to high-end tones. In addition, the system uses computer-optimized equalization to improve the soundstage and an advanced energy management system that keeps the unit from wasting battery power during use. Additional features include gripping rubber feet below the speakers, an audio input cable, and a universal AC adapter. When used as a portable system, the JBL on Tour provides more than 24 hours of continuous play on four AAA batteries. The device also includes a low battery alert.What's in the BoxJBL on Tour speaker system, audio input cable, AC adapter, user's manual.", "title": "JBL OnTour Portable Music Box", "price": 1.99, "imUrl": "http://ecx.images-amazon.com/images/I/4135QJE60AL._SY300_.jpg", "related": {"also_viewed": ["B00F5IV0GU", "B005FMBVLA", "B000BQ57BU", "B000BRV60A", "B007E4AER4", "B007E4AERY", "B003Y3BFB8", "B007E4A8NO", "B007E4A8CK", "B0062S88OY", "B008N5FBX0", "B0096T7U04", "B00F8HRSN2", "B0096T7TQE", "B009AXVM6E", "B0098FAH7O", "B00JGN4V1G", "B009INNQL0", "B00C2ALYII", "B00F8HRTCC", "B0092PDT20", "B00DQAPJSY", "B0064IIEPU", "B009AWT01Y", "B0064IIFPO", "B00JVHDMAI", "B00E64GUGY", "B006MPQ3BW", "B00B5RP0C0", "B00BLCLUQO", "B0043TB7OC", "B00DZS0YGO", "B00644JO9O", "B00BNIO4H8", "B009XGH2HG", "B0017XMN7C", "B000HZDF8W", "B008VMT2EE", "B00F8JEJKK", "B00BLCLVD6", "B009AYLDSU", "B00CHSLY30", "B0007XU370", "B00C4Q61Z6", "B00BPV4W8E", "B00GZC35YK", "B00I8SSFH6", "B000U2G6VA", "B00B5QNFUK", "B00CD1PTF0", "B00H3JTT30", "B005PUZOYM", "B00CNZP7H6", "B00B5QNGN6", "B00BNIO88I", "B00001WRI4"], "buy_after_viewing": ["B00F5IV0GU", "B0094S354W", "B009SNJ0NS", "B005FMBVLA"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]]}