{"asin": "B003HGHR82", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "The Aiptek 3D-HD High Definition 3D Camcorder gives you the power to record in eye-popping 3D. Featuring dual-HD sensors, the Aiptek 3D Camcorder captures high-definition videos and stills that work with most major brand 3D televisions. Also, you can play back and view your 3D recordings instantly on the built-in 3D LCD preview screen without the need for polarized glasses.Aiptek 3D-HDAt a Glance:Works with the new 3D TVs, PCs, and laptops using nVidea 3D VisionDual 5MP sensors capture 3D videos and stills in HDSimple, one-touch recordingLCD preview screen offers 3D viewing without glassesHDMI output for direct connection to HDTVsSupports SDHC cards up to 32GBAfter recording with the 3D-HD, view all your photos and videos on thePortable 3D Photo and Video Display(sold separately).The 2.4-inch LCD screen gives you a 3D view--without the need for glasses.View larger.Dual HD lenses and sensors allow for 3D recording.View larger.Easy, One-Touch High Definition Recording in 3DWith the Aiptek 3D-HD High Definition 3D Camcorder, you don't have to sacrifice visual quality for 3D recording. The 3D-HD features dual 5MP sensors that give you pristine videos and photos in 3D. The dual sensors capture two different viewing positions simultaneously, each of which has a resolution of 640 x 720p. When these two images are overlapped, they create a 3D effect that approximates the HD resolution of 1280 x 720p.Recording with the 3D-HD is simple, as all of its features are just a touch away. One touch of a button is all it takes to record videos in 3D. Touch another button to take snapshots. Yet another button lets you play back your videos and pictures.3D Live View DisplayThe 2.4-inch LCD preview screen on the 3D-HD utilizes Parallax Barrier technology to give you a 3D view without the need for any special red-and-blue glasses. You can watch footage in 3D live as you record it, or use the LCD for instant 3D playback.Play Back Recording on 3D HDTVs, Computer Monitors, and MoreThe 3D-HD records in the MP4 format, which is compatible out of the box with most new 3D HDTVs. And if you have NVIDIA 3D Vision technology on your PC or laptop, you can capture, edit, and play back all of your 3D recordings using the state-of-the-art Active Shutter 3D Technology.With the included software, you can even play back 3D recordings on your standard HDTV or computer. The software lets you convert your videos to the 3D \"Anaglyph\" format, which is the classic 3D technology that requires red-and-blue glasses. Once you've converted your videos or photos to this format using the software, simply use polarized glasses to view your 3D creations on standard HDTV or computer monitor.Upload Your 3D Videos to YouTubeYouTube now supports 3D video playback at 720p, an ideal fit for recordings made with the 3D-HD. Included software lets you upload directly to YouTube with a click of the button, so sharing your 3D videos with friends and family has never been easier.Optional Portable 8-Inch 3D Display for Instant ViewingAiptek optionally offers thePortable 3D Photo and Video Displayfor viewing of 3D photos and videos. The display features an 8-inch LCD screen with a Parallax Barrier that lets you view all the 3D movies and photos you captured with the 3D-HD, and without the need for glasses. You can also easily switch between 3D and 2D modes to view all your media. The 3D Display supports photo slideshows so you can share all your favorite memories with your family and friends. It also has built-in internal memory, as well as a SDHC slot that supports SDHC cards up to 16 GB for hours of video and thousands of photos. A built-in rechargeable lithium polymer battery lets you take the 3D Display wherever you go and use it for hours without having to plug it in.Compact, Easy-to-Carry Size Goes EverywhereYou'll never miss a moment with the 3D-HD. It lets you record in both 3D and 2D, so you can leave your other cameras at home. It measures just 4.6 x 2.8 x 0.9 inches and easily slips into your bag or pocket. It also features an ergonomic design that fits nicely in the palm of your hand for comfortable long-term use.HDMI Output and Built-in USBThe 3D-HD features an HDMI output that lets you connect it directly to your HDTV, 3D HDTV, or other monitor for video and photo playback. There is also a built-in USB port so you can easily connect to your PC to download videos and photos for viewing or editing.Accepts up to 32GB SDHC CardsThe 3D-HD has no internal storage and supports SDHC cards up to 32GB for plenty of recording. A built-in microphone picks up audio.System RequirementsMicrosoft Windows XP SP2, Vista, or above; Mac OS X 10.4 and above; Pentium 4 3.2 GHz and above; Direct X 9.0c or above; 1GB RAM (2GB recommended); video card with 256MB of RAM; CD-ROM; available USB port; Quick Time 7.4 or above.The Aiptek 3D-HD High Definition 3D Camcorder is backed by a one-year manufacturer's warranty.What's in the Box3D camcorder, lithium ion battery, AC charger cable, USB cable, HDMI cable, user's guide.", "title": "Aiptek 3D-HD High Definition 3D Camcorder (Black/White)", "price": 179.0, "salesRank": {"Camera &amp; Photo": 9284}, "imUrl": "http://ecx.images-amazon.com/images/I/41sGn-bjUlL._SY300_.jpg", "related": {"also_bought": ["B001CCWJBS", "B004T7VI2Y", "B003ZHV70M", "B005OZP85I", "B003HGHR8C", "B004HN2U7W", "B003VNKNF0", "B00007FY66"], "bought_together": ["B003VNKNF0"], "buy_after_viewing": ["B003VNKNF0", "B003ZHV70M", "B004H8FNCQ", "B005OZP85I"]}}