{"asin": "B002OMB7FE", "description": "This \"mechless\" receiver from Dual Electronics does away with mechanical playback entirely--no discs, no cassettes--just your digital music collection on USB devices or SD cards, your favorite digital music player through the auxiliary input, or some AM/FM radio.An affordable mechless receiver for music fan with a large collection of MP3/WMA files.Connect USB devices, SD cards, or via the auxiliary input jack.View a feature diagram.Click to enlarge.USB/SD PlaybackThe XR4110 features a convenient front-panel USB (1.1) port, for playback of your favorite MP3/WMA files. Connect USB devices with up to 16 GB capacities, and access hours of programming.Right next to the USB port is a slot for SD cards. Support for SD cards is also 16 GB, giving you yet another storage option for your MP3s and WMAs. SD cards are even more convenient for quickly swapping out, for an almost infinite amount of music right there in your glove compartment.Auxiliary InputOf course, most folks with a substantial digital music collection also have a favorite iPod or other MP3 player. The standard 3.5-mm mini jack aux input lets you connect and enjoy it. And yes, you can even hook up a portable CD player if you wanted some good old-fashioned skipping playback.AM/FM RadioListen to your favorite morning show or catch up on the traffic, news, or weather with the built-in AM/FM tuner. Eighteen FM and 12 AM presets let you instantly pull up your favorite stations.Blue DisplayThe XR4110 features a brilliant blue four-character display, along with matching blue button illumination.Preamp OutputsThe XR4110 has 60 watts of total power (15 watts x 4 channels), but if you'd like a little more, a pair of 2V preamp outputs is included for system expansion.One-Year WarrantyDual offers a one-year warranty on parts and labor.What's in the BoxDual XR4110 receiver, mounting sleeve, wiring harness, antenna, trim ring, and user's manual.", "title": "Dual XR4110 In-Dash MP3, WMA, AM/FM Receiver with Front Panel USB, SD Card, and 3.5mm Aux Inputs (Gray)", "price": 38.34, "imUrl": "http://ecx.images-amazon.com/images/I/41kADc2isyL._SX300_.jpg", "related": {"also_viewed": ["B00BEU3FUW", "B008S0DJMU", "B004U299S8", "B00B5MUJPS", "B00C86P0HC", "B007B631RA", "B00KAQ14NQ", "B009RIK26I", "B00EPY0JD0", "B0078XGE3Y", "B00IFEFMBA", "B001P7SMAW", "B00AJXPPXU", "B004HJ3AKC", "B004S50WPG", "B004D39CH2", "B00BQME6LU", "B009YKG0K6", "B00335SEJS", "B009AVT34E", "B0078XHOWO", "B0071LSAR6", "B006B1BXCQ", "B004S4XKRO", "B00BKV3HFI", "B004EG6L18", "B00BCOHFBU", "B004J2X886", "B005OW4D2U", "B0072LF6T0", "B004HJ3FH0", "B004HJ5B7W", "B00IP0T314", "B00B65J5B8", "B00H4G1BIS", "B0072LCB5M", "B007VLET08", "B0043I7U12", "B006KKS7XQ", "B00HQD09EG", "B007HMOP5K", "B0013CE47E", "B00AAR0M38", "B00CWEK0T8", "B00IVEH1K4", "B00BIF0XTE", "B005BUDSGW", "B004HJ7A80", "B002KF420C", "B0091V0A9U", "B00012O6RK", "B004S50YJ0", "B004HJ5GAO"], "buy_after_viewing": ["B004S50WPG", "B0078XGE3Y", "B0071LSAR6", "B00BEU3FUW"]}, "categories": [["Electronics", "Car & Vehicle Electronics", "Car Electronics", "Car Audio", "Digital Media Receivers"]]}