{"asin": "B000EVM5DU", "description": "Putting the power of Windows Live Messenger at your fingertips, the Microsoft LifeCam VX-6000 takes instant messaging with family and friends to a new level of sight and sound by offering great video and crystal-clear audio with acoustic noise cancellation.The LifeCam VX-6000 features one-touch access to Windows Live Messenger.Enjoy megapixel resolution, a wide angle lens, and a 3x digital zoom.Plus, you get advanced features, such as automatic face tracking software and low-light adjustment, so you feel like you're right there. The VX-6000 also adds several key enhancements over the LifeCamVX-3000, including high definition video capabilities, a wide angle lens, a 3x digital zoom, and a high-speed USB connection.View a comparisonof the LifeCam VX-3000 and VX-6000.The Microsoft LifeCam VX-6000 is optimized for Windows Live Messenger, which is used by the largest worldwide instant messenger community with over 200 million users. Three key features give you a superior Windows Live Experience. First, the Windows Live Call Button makes it easy to start a video call. Simply press the button to see who's online, and you're on your way to a video call. Second, with the LifeCam Dashboard you can access video effects and control your webcam from the Windows Live Messenger window. Lastly, with One-Touch Blogging, a single click allows you to upload to Windows Live Spaces, an \"online scrapbook\" that lets you easily post blogs, photo albums, and personal music lists.The VX-6000's automatic face tracking software, which takes advantage of the camera's pan, tilt, and zoom controls, follows you so you don't disappear off-screen. The VX-6000's wide angle lens lets you fit more people on screen so everyone can join in the fun. Alternatively, the 3x digital zoom brings you so close that it's almost like sitting opposite the other person. The camera's high definition sensor makes it possible to experience true 1.3 megapixel video and 5.0 interpolated megapixel photos.The camera automatically adjusts for low-light conditions for improved video quality, and a built-in unidirectional microphone with acoustic noise cancellation provides crystal-clear audio. Video effects give you a fun way to express yourself, and last but not least, the camera's universal attachment base fits on most monitors, including flat screens. Alternatively, the camera can sit directly on your desk.Note that while the VX-6000 is optimized for use with Windows Live Messenger, Microsoft LifeCams also work with other instant messaging programs, such as Yahoo Messenger and AOL Instant Messenger.", "title": "Microsoft LifeCam VX-6000 Webcam  (Gray)", "price": 67.99, "imUrl": "http://ecx.images-amazon.com/images/I/51JWNCE33RL._SY300_.jpg", "related": {"also_bought": ["B000EVM5DK", "B000GEU6TA", "B00GY2GHAK", "B002C6DA4I", "B0027JIIKQ", "B0084JMCF0"], "buy_after_viewing": ["B000EVM5DK", "B006JH8T3S", "B0096KSBB0", "B008ZVRAQS"]}, "categories": [["Electronics", "Computers & Accessories", "Laptop & Netbook Computer Accessories"]]}