{"asin": "B000EOPQ7E", "related": {"also_bought": ["B008AOH1O6", "B0002CZW0Y", "B00840353W", "B007IQRD72", "B000H18RYS", "B006JH8T3S", "B00ED56OP8", "B00D78W20I", "B00ACFAULC", "B0081CRJRQ", "B0053ODOY2", "B0002H0H4A", "B00BKWKVHE", "1384719342", "B00DFUEZZI", "B00CFXH4S6", "B0002E3FCO", "B002VA464S", "B008YTAGGW", "B004YW7WCY", "B006DIA77E", "B00JE3N0OC", "B0011E63A0", "B00BWF5U0M", "B00F890KXU", "B008ZT8QKO", "B0042A8CW2", "B003LVZO8S", "B00ADR2DTG", "B000GAZ4NC", "B00CRJWW2G", "B000978D58", "B0007XJSQC", "B009K7QB8O", "B0002D03ZW", "B0012AUHXW", "B0002L5R78", "B004FEEY9A", "B000ULAP4U", "B004OAFO0I", "B00HBN6T1I", "B001TH7GUU", "B005BZNDS0", "B00BBUCCKO", "B004EKAJ1M", "B001TGTDFM", "B001D7UYBO", "B0033Z2BAQ", "B000UEZ36W", "B0051M6IPI", "B00E3W1726", "B009SJR2BE", "B005O65JXI", "B00AAS888S", "B00K11RI6W", "B004WO8HQ4", "B004ZGN6MY", "B003M0NURK", "B0088PUEPK", "B00E1D2LTA", "B006EWUO22", "B003OBZRPU", "B00B2HH7G0", "B009WA4EBU", "1423204212", "B005BZNDOO", "B003ZSN600", "B001NEK2GE", "B0001ARCFA", "B00IDG3IDO", "B009SJR278", "B0027VT6V4", "B0087UPRMQ", "B00CO8TBQ0", "B0096KSBB0", "B003K1EYM6", "B0081ZBNI4", "B0044RUSZM", "B00HVLUR86", "B0096PLB9O", "B001TH7T2U", "B009C98NPY", "B0025VKUPW", "B00H09BB16", "B009AP23NI", "B003L137Y6", "B00CO8TBOW", "B000OGX5AM", "B007HSKSMI", "B00DKXXAAQ", "B005H3Q59U", "B009EWHKAI", "B009O7YUF6", "B00CZIQXBA", "B004QRKWLA", "B00DQFGJR4", "B0089NVTDM", "B006YG9EEW", "B00E055H5O"], "bought_together": ["B008AOH1O6"], "buy_after_viewing": ["B006DIA77E", "B002VA464S", "B008AOH1O6", "B001R76D42"]}, "title": "Blue Microphones Snowball USB Microphone (Textured White)", "price": 57.0, "salesRank": {"Musical Instruments": 303}, "imUrl": "http://ecx.images-amazon.com/images/I/51jJvEcsVzL._SX300_.jpg", "brand": "Blue Microphones", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Headsets & Microphones", "PC Microphones"]], "description": "Create studio-quality recordings with Blue Microphone's Snowball, a USB microphone with exceptional sound-capture capabilities. Using Blue Microphone's award-winning dual-capsule and circuit design, the Snowball produces crisp, clean recordings that are free of feedback and distortion. A unique pattern switch allows you to toggle between three different settings, giving you the flexibility to record vocals, instrumental music, podcasts, interviews, and more. With a plug-and-play design that is both Mac and PC compatible, the Snowball requires no additional drivers and is ready to record straight out of the box.The Snowball USB MicrophoneAt a Glance:Ideal for recording music, podcasts, live chat, and moreAward winning dual capsule and circuit designIncludes adjustable mic stand and USB cableMac and PC compatibleDual-capsule technology facilitates sophisticated recording techniques.View larger.Sleek, modern design and adjustable tripod let you record in style.Three Different Pattern Modes for Versatile RecordingUsing Blue's proprietary dual-capsule technology, the Snowball can record a wide range of situations. Its multiple pattern capability makes it an ideal choice for recording music, podcasts, Skype conversations, and live chat. Depending on what kind of sound you are recording, you can choose from three distinct pattern modes:Cardioid mode:Well-suited to podcasts, sung vocals, and other voice work, cardioid mode records sound sources that are directly in front of the microphone. It delivers a rich, full-bodied sound.Cardioid mode with -10 dB PAD:The same as cardioid mode, except with a -10 dB attenuation that helps you capture louder sounds with higher fidelity.Omnidirectional mode:Omnidirectional mode picks up sound equally from all directions. It is best used in situations when you want to capture the ambience of \"being there\"--like a live recording of a band's performance.Innovative Design Makes Recording EasyWith a visual design inspired by classic recording equipment, the Snowball's stylish, retro aesthetic will complement any computer system. Its metal grille and white frame recall the look of old-timey microphones.The Snowball comes with an adjustable tripod that lets you position the microphone in relation to the sound source, improving sound quality. It also features an LED indicator, which glows red when the microphone is powered.Hassle-Free SetupThe Snowball requires no complicated drivers to operate; simply plug it into your computer's USB port with the included USB cable, calibrate the microphone with your operating system, and you're ready to record.The microphone is compatible with Windows 7, Windows Vista, Windows XP (Home and Professional), and Mac OS X (10.4.11 or higher), and requires a minimum of 64 MB of RAM.The Snowball USB Microphone is backed by a two-year limited warranty.What's in the BoxSnowball USB Microphone, adjustable stand, USB cable, and instructions.Choose from one of three attractive colors and start recording music, podcasts, live chat, and more."}