{"asin": "B00IVEHCVW", "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Cycling GPS Units"]], "description": "Bike Computer for Competing, Connecting and NavigatingIn-ride competitions through Garmin Connect&trade; segmentsOn-road or off-road navigation and points of interest with preloaded Garmin Cycle MapInput a distance and choose from up to 3 round-trip ride optionsInstant uploads to Garmin Connect&trade; Mobile to analyze and shareConnected features&sup1;: incoming call and text alerts&sup2;, live tracking, sending/receiving courses, social media sharing, weatherWhether you are riding to improve your own personal  best or see where you stand against the pros, Edge 1000 lets you  connect, compare and compete. Turn every ride into a race by competing  on Garmin Connect segments and seeing real-time results on your Edge,  including alerts for segment start and finish and leaderboard rankings.  The segments feature keeps you motivated and helps you push for  continual improvement.Own the RoadAlong with in-ride challenges and connected features, Edge 1000  offers advanced bike-specific navigation and mapping capabilities. The  preloaded Garmin Cycle Map includes OSM (Open Street Map) content with  routable road and bike paths, elevation data, points of interest and  address search. Mapping data is stored onboard the Edge, so your access  to navigation and performance capabilities isn&rsquo;t dependent on cell  coverage, and map updates are free.Know Where to GoNow you can explore more, on and off road, thanks to this device&rsquo;s  round-trip routing feature. Simply enter how far you want to ride, and  Edge 1000 calculates up to 3 cycling-friendly routes. You can even  review the elevation profiles before making your selection. It also  offers a new route planner capability that allows you to create routes  directly on the Edge 1000 using the map, POI and segments you&rsquo;ve  downloaded from Garmin Connect. Again, you can preview the elevation  profile of your custom route before you roll. If you do get off course  or want to end your ride sooner, Edge can always guide you back to start  or calculate the most direct route and provide turn-by-turn directions  to get you back.At Your FingertipsEdge 1000 features a 3-inch high-resolution color touchscreen display  with dual orientation. It has an ambient light sensor that  automatically adjusts the screen brightness to changing light conditions  to improve visibility. Unlike your smartphone, the display is optimized  to work with gloves and in the rain&sup3;. You can customize your training  pages with up to 10 data fields and use activity profiles to allow for  easy transitions when you switch cycling activity, such as road,  mountain or touring.Advanced Performance AnalysisEdge 1000 is compatible with ANT+&trade; sensors, including speed, cadence,  heart rate and compatible weight scale. It&rsquo;s the first Garmin bike  computer that integrates with Shimano Di2 electronic shifting systems4to display your current gear on the screen. Edge 1000 is also compatible with ANT+ power meters, including Vector&trade;,  our unique pedal-based power meter that measures total power,  left/right balance and cadence. A preloaded power-based workout on Edge  1000 allows you to calculate your functional threshold power (FTP), from  which you can base your power training zones. The 1000 offers a  training calendar and is compatible with advanced workouts, which you  can plan, schedule and upload from Garmin Connect.Smartphone ConnectivityWhen paired with your smartphone and the Garmin Connect&trade; Mobile  app, Edge 1000 offers a suite of connected features, including live  tracking, incoming call and text alerts, social media sharing, weather,  wireless uploads and sending/receiving courses and segments. As soon as  your ride is complete, the data can be automatically sent to Garmin  Connect via Bluetooth&reg; or Wi-Fi&reg;. This lets you stay connected and  instantly share the details of your ride with friends, family and social  media contacts. LiveTrack allows your friends and family to follow your  races and training activities in real time. Invite followers using  email or social media, so they can view your live data on a Garmin  Connect tracking page. Once they get your email invite, they can click  to follow and see your stats and location on the map.&sup1;When paired with your Bluetooth&reg;  or Bluetooth Smart Ready phone; contact your service provider to verify  if your phone is compatible. The Bluetooth word mark and logos are  registered trademarks owned by Bluetooth SIG, INC. Wi-Fi&reg; is a  registered trademark of Wi-Fi Alliance Corporation.&sup2;iPhone&reg; 4s or later. iPhone is a trademark of Apple Inc., registered in the U.S. and other countries.&sup3;Water-rated to IPX7; ANT+ wireless connectivity does not work underwater.4Compatible with Shimano Di2 electronic shifting systems with Shimano D-Fly Data Management function.", "title": "Garmin Edge 1000 Bundle", "price": 699.99, "imUrl": "http://ecx.images-amazon.com/images/I/41eR5gWLBvL._SY300_.jpg", "brand": "Garmin", "related": {"also_bought": ["B00JQGWQGU", "B00JLMRREK", "B00JW6O6SK", "B00JM6DKUA", "B00KQYH65M", "B00JQGWSXQ", "B00JQGWUES", "B00INXAU1K", "B00K7J2PCA", "B002I05VX6", "B00K7J2QHY", "B0096855IO", "B0042ESTSK", "B00K7J2PYS", "B00EOHUVTU", "B008F9GAH0", "B00GRL58EE", "B00EPKM8RO", "B00D05CCKS", "B00FZ5BJ8W", "B00CXYMAEK", "B00APBMNQ8", "B00IKNDDNK", "B008H5ZORY", "B004DRA3SK", "B00CM381SQ", "B00DQV6L6C", "B004DR7HWA", "B000L47VYI", "B001S98NLU", "B00IPC7CKQ", "B00FZ5KQ3Q", "B00IUCE5HO", "B000G72384", "B0028YRJE6", "B005G210V0", "B00ITI5CWQ", "B00BI9X1QM", "B00H9IFSH6", "B00FBYYBZA", "B000BFNOT8", "B005QY7Y86", "B00EOGMKF4", "B00781XC1I", "B00BLOYHBC", "B00EOGIZNU", "B00BCUYPLM", "B00ALV5VZW", "B0042WGO3Y", "B000IZGFCE", "B009XGHAC8", "B008R5LZ2M", "B002VTQSR2", "B00HFPOXM4", "B008H5JWL8", "B00811WQT8", "B00APBMNR2", "B000OZFJS4", "B006BACP6A", "B00FBYY5KG", "B000FIAU8O", "B00FBYYC90", "B008KWDKRK", "B0011ZEJKK", "B00470TALO", "B001B6RJG0", "B00FSDRKXO", "B0072CUN92", "B00E1NQ3DU", "B0041O5X8A", "B002NU6J1Y", "B004JKK75A", "B003A0AFI4", "B00AZ2NY2Y", "B00I3J4NG2", "B00D9NW32I", "B0043839FS", "B00264GKVQ", "B000EX6IJK", "B00KX2J1LY", "B00BMARC30", "B009P3MOF2", "B007KJD73Q", "B000BO3BME", "B005FZZNKW", "B003LVHZ4O", "B004U2JR8K", "B002KT4276", "B00DM1BDKU", "B00DHM5BXY", "B001QW1L72", "B004HZQ6IE", "B00A8E0R0G", "B00LFQ3GQ8", "B001B6N70M", "B000BS02LS", "B000FIE4AE", "B000F7Z0KI", "B00IKREJ84", "B0042ESTQW"], "bought_together": ["B00JQGWQGU", "B00JLMRREK"], "buy_after_viewing": ["B00JM6DKUA", "B00JQGWQGU", "B0096855IO", "B00APBMNR2"]}}