{"asin": "B005IN09GO", "description": "InCarCables 4ft Aux-In Cable With Durable Stepped ConnectorLooking for a way to use your iPod, iPhone, smartphone, mp3 player or tablet (kindle) with your car or home stereo? InCarCables' high-quality, gold-plated aux-in cable is the perfect solution!Simply plug one end into the headphone socket of your device and the other into the jack in your car (or home stereo), and you're set! The sound quality is excellent and the cable's durability makes it much longer lasting than cheaper versions!This new slimline cable with a stepped connector is a recent addition to our bestselling range. It is designed to locate firmly in devices, even with cases fitted (see above pictures, click to enlarge). Works great with iPhone 4 and iPhone 5 cases!This cable length (4 feet) is our most popular size, ideal for those sat anywhere in the car!FeaturesThe cables have a robust design with dual molded, ergonomically designed connecters, made from quality touch plastic. This means they last longer, are easy to hold and are durable enough for usage in the car or at home.The cables have 24k gold plated 3.5mm plugs and a low loss wire core to ensure great sound quality that lasts. All cables are made without the use of hazardous substances (RoHS compliant)CompatibilityThe cables are compatible with car or home stereos which have a 3.5mm aux input fitted (see pictured input above). Most new cars have these inputs - they look like headphone sockets and are normally located in the stereo unit, glove box, armrest or center console. Still unsure? Send InCarCables a message through Amazon, and we'll check.Our cable is compatible with ALL iPods, ALL iPhones (including iPhone 5), All iPads and any mp3 player, smartphone or tablet (kindle / kindle fire) with a normal headphone socket! It will even work when cases are fitted (see pictures.)", "title": "InCarCables Car and Home Stereo 1.2m AUX-IN Cable 3.5mm for iPod, iPhone, Smartphone and Mp3 Players", "price": 7.99, "imUrl": "http://ecx.images-amazon.com/images/I/31LTp64xYjL._SX300_.jpg", "related": {"also_bought": ["B006SU0SX0", "B00622AG6S", "B007FHX9OK", "B009SYZ8OC", "B00B1HVI4I", "B0031U1ATG", "B0097BEFYA", "B00B3OA7R8", "B004LTEUDO", "B00B8MMZY8", "B00K7ENS5S", "B00ACIFLCM", "B00G67FD6W", "B00HSV2FSY", "B00FA4Y66U", "B005UNFRU0", "B008ALV0V4"], "buy_after_viewing": ["B004LTEUDO", "B0031U1ATG", "B005UNFRU0", "B008LCYII4"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Cables & Interconnects", "Audio Cables", "Stereo Jack Cables"]]}