{"asin": "B009CQNPYQ", "description": "Finally, a light and lean computing machine with touch: the Aspire V5 Series Notebook.  At only 1\" slim and super light, this Notebook packs potent power and graphics and even features an optical drive and handy LAN/VGA combo port, while integrating a touchscreen for exciting hands on navigation. The elegant design sports silky surfaces and takes full advantage of the touch capabilities of Windows&reg; 8 so you can experience efficiency hands-on as you open and close programs, browse online, and breeze through photo albums&mdash;using nothing but your fingers.br/Key Features15.6\" HD Widescreen CineCrystal&trade; LED-backlit Display:(1366 x 768) resolution; 16:9 aspect ratioMulti-touch screen, supporting 10 finger touch3rd Generation Intel&reg; Core&trade; i5-3317U Processor 1.7GHzwith Turbo Boost Technology up to 2.6GHzWindows 8Intel&reg; HD Graphics 4000with 128MB of dedicated system memory6GB DDR3 Memory500GB 5400RPM SATA Hard Drive8X DVD-Super Multi Double-Layer Drive2-in-1 Digital Media Card Reader802.11b/g/n Wi-Fi CERTIFIED&trade;Bluetooth&reg; 4.0+HS1.3MP HD Webcam(1280 x 1024)Optimized Dolby&reg; Advanced Audio&reg; v2 audio enhancementTwo Built-in stereo speakers2- USB 2.0 Ports1- USB 3.0 Port1- HDMI&trade; Portwith HDCP Support4-cell Lithium-Ion Battery (2500mAh)Up to 5-hours battery life5.3 lbs. | 2.4kg &lt;\\strong&gt;system unit onlyLearn MoreHands on Navigation with TouchExperience a new type of navigation on the stunning 15.6\" Widescreen 10-point multi-touch Display. The frameless edge-to-edge design keeps this Notebook super slim and provides a large area for touch interactions as well as a full web browsing experience.10 Points Multi-Touch Display makes your digital life more intuitive, more electric, more fun! Experience efficiency hands-on as you open and close programs, browse online, and breeze through photo albums&mdash;using nothing but your fingers. Simply scroll, flick, pinch and rotate motions to accomplish your tasks quickly.Windows 8 has been re-imagined to be all about you. Put what matters most right on your Start screen, and get instant access to your people, apps, sites and more, so you can spend less time searching and more time doing.  And with a combination of the touch display and the new Windows 8 you get a fast and fluid working environment.  Quickly zoom in or out to customize your view and group, label, and rearrange apps on your Start screen.Slender, yet Full-FeaturedAt less than 1\" thin, the V5 Series Notebook is slender and light while still housing a built-in slim DVD drive, making it 30% slimmer than traditional PCs that feature DVD drives.  The new touchpad with large working area and enhanced sensitivity makes for a better working experience.Outfitted with 3rd Generation Intel&reg; Core&trade; i5 Processor, the V5 Notebook lets you see and feel the difference in your movies, photos, and games smoothly and seamlessly with a suite of visual enhancements built into the processor.  Enjoy the thrill of an automatic burst of speed when you need it with Intel&reg; Turbo Boost Technology.  And with Dolby&reg; Advanced Audio&reg; v2 this PC delivers a crisp, clear cinematic surround sound experience over its built-in speakers.Backlit Keyboard adds a cool subtle glow to your typing experience that not only looks good, but helps guide your fingers while typing in dimly lit areas.When the 15.6\" fails to satiate your visual appetite, the HDMI&trade; output lets you pipe HD content and high quality audio to an external monitor or big screen HDTV via a single cable.Instant CommunicationAcer Instant Connect gets you to the web in 4x faster than conventional notebooks by remembering previous Wi-Fi spots you've visited!  So when they're in range, it instantly connects you to the Internet- no waiting required!Have crystal-clear video chats with friends and family and snap still pictures, all in HD, with the advanced HD Webcam. Its high pixel density delivers amazing image quality in 24 frames per sec.Built-in 802.11b/g/n Wireless provides the freedom to roam to hot spots while Bluetooth&reg; technology lets your wirelessly connect to other Bluetooth-enabled devices such as phones, printers and hand-held organizers, eliminating the need for a tangled wire.With AcerCloud your PCs storage IS your Cloud storage with wireless access to your photos, music, videos and documents -- wherever you are, on any PC, on all your devices!SocialJogger lets you stay in touch with friends and the latest buzz by placing Facebook&reg; and Twitter in one place!  Check updates in a single glance and scroll through endless feeds with the innovative jog dial.", "title": "Acer Aspire V5-571P-6642 15.6-Inch Touch Screen Laptop (Silky Silver)", "price": 729.99, "imUrl": "http://ecx.images-amazon.com/images/I/41jYlYNTWGL._SX300_.jpg", "related": {"also_bought": ["B007EJ25Y4", "B004NY9UXM", "B00C2WH8MC", "B001V7RF9U", "B005ERKWW0", "B009FX7CGS", "B004FI11C4", "B00B3PFPOC", "B00E6J2SN8", "B00AM7MM84", "B002J9HBIO", "B00CWIT34C", "B00AVYPP7S", "B007Y91RX4", "B007KB5VMY", "B00K0HMR8G", "B009LTUB9G", "B00DKFFG06", "B00AEL9XZS", "B005QXX0MG", "B00D3F7H0K", "B00AVYPMGW", "B005IPKVNS", "B008ZE60VG", "B00AO1XI4U", "B00337D8U6", "B0040J3G9E", "B00AVYPLWW", "B00HLT0YT0", "B00507NEBA", "B004AQZLJK", "B007PJ4Q4A", "B009F1IHZK", "B003VSTDFG", "B003NR57BY"], "bought_together": ["B004NY9UXM"]}, "categories": [["Electronics", "Computers & Accessories", "Laptops"]]}