{"asin": "B002R5AM7C", "related": {"also_bought": ["B000VJRUKS", "B001B5CVNC", "B001U5R9YE", "B0041LXANI", "B002DM6W2I", "B00272MT3A", "B0040702HU", "B002R5AM7W", "B001HSOFI2", "B0023B14TK", "B0040702IE", "B0040702HA", "B0023B14TU", "B001O94GNS", "B0033PZRV6", "B00272MT26"], "bought_together": ["B000VJRUKS", "B001B5CVNC"], "buy_after_viewing": ["B001B5CVNC", "B0023B14TK", "B003VNKNF0", "B001HSOFI2"]}, "title": "Flip MinoHD Video Camera - Brushed Metal, 8 GB, 2 Hours (2nd Generation)", "price": 349.99, "salesRank": {"Camera &amp; Photo": 1925}, "imUrl": "http://ecx.images-amazon.com/images/I/31DFvDHTrdL._SY300_.jpg", "brand": "Flip Video", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "MinoHDOverviewAll-new MinoHD is the world's sleekest HD camcorderSlim, sleek design fits in any pocket or purse--perfect for shooting video on the goCaptures 120 minutes of stunning HD video on 8 GB of built-in memory; no additional memory neededSimple user interface--power on and press record to start capturing HD video in momentsConvenient flip-out USB arm plugs directly into your PC or Mac to launch pre-loaded FlipShare softwareFlipShare software makes it easy to email videos, edit individual clips, make custom movies, capture still-image snapshots, and upload video to Facebook, YouTube and other sharing sitesLarge, 2-inch anti-glare color display to play back and delete videosInternal Lithium-ion battery recharges through built-in USB; also recharges when connected to Flip Video Power Adapter (not included)HDMI output (mini-HDMI connector) makes it easy to watch your videos on your HDTVAll-new design features a unique brushed-metal front and soft, rounded edgesFeatures a flat-back panel with touch-sensitive, backlit buttonsVideo: 16:9 widescreen, HD 720p (1280 x 720) at 30 frames per seconds (fps) progressive scan; recorded as MP4 filesFlip MinoHDHighlights&nbsp;The World's Sleekest HD Camcorder Is Now Even BetterWith the all-new Flip MinoHD, it's now even easier to capture incredible HD video and share it with the world. MinoHDfeatures 120 minutes of record time, so you'll never have to miss another minute. A super-slim, pocket-sized design means you can take your MinoHDwith you everywhere you go. And a large, 2-inch anti-glare display lets you enjoy your videos directly on your camcorder. Plus, MinoHDcomes pre-loaded with FlipShare software, which makes it easy to organize, create and share your videos.&nbsp;Sleek, Pocket-Sized DesignSuper-sleek MinoHDfeatures an all-new design, complete with a unique, brushed-metal front and soft, rounded edges. Plus, MinoHDis slim and small enough to fit into any pocket or purse, meaning you can take it with you wherever you go. Whether you're enjoying an adventurous vacation, hitting the town with friends, or just taking it easy at home, your MinoHDwill let you capture all the action.Incredible HD VideoMinoHDmay be small, but it produces incredible HD video, even in low-light situations. Capture up to 120 minutes of video that will look crisp and vibrant on your HDTV. Plus, premier AAC audio means your videos will sound clearer than ever, too. And included HDMI output makes it simple to enjoy your videos on your HDTV.Easy to UseLike all Flip camcorders, the new MinoHDis incredibly easy to use. Power on, press record, and start capturing high-quality HD video within seconds. It's really that simple. When you're ready to share your video, flip out the signature USB arm and connect to your PC or Mac to launch pre-loaded FlipShare software.Pre-Loaded FlipShare SoftwareMinoHDcomes pre-loaded withFlipShare software, which makes it easy to organize, create and share your videos:Organize your videos.Drag and drop your videos into folders you've created, or use the automatic date-stamped folders.Create custom movies.Make movies featuring your favorite video clips, and add your own music to provide a more personal touch.Capture still-image snapshots.Use enhanced freeze-frame capabilities to grab a snapshot from any of the thirty frames that comprise each second of your video.Share privately.Send videos to your friends and family using attachment-free emails. Or create private Flip Channels to share your videos with specific groups of friends and family.Share with the world.Publish your videos directly to Facebook, YouTube and other sites, all with the click of a button.Manufacturer Alert:We have resolved an issue that some Amazon.com customers experienced previously, in which a small percentage of Flip MinoHD Camcorders experienced difficulty connecting to USB ports in certain computers. This was not a problem with the camcorder itself, but rather the result of a tight fit between the MinoHD's USB arm and the USB ports in these computers. MinoHD 2nd Generation Camcorder units currently available for sale by Amazon.com should not experience any \"tight-fit\" problem when connecting the camcorder&rsquo;s USB arm to a computer. If you are experiencing this issue on a camcorder purchased previously, please contact Flip Video Customer Support at 888-222-6689, and a representative will be able to further assist.Recommended Accessories:"}