{"asin": "B000BNDEZY", "categories": [["Electronics", "Computers & Accessories"]], "description": "Great for Wireless Online Gaming! Connect to PlayStation 2, XBox, Slingbox!The Buffalo AirStation High Power Wireless Ethernet Converter is an extremely versatile wireless client adapter. Use it to wirelessly connect gaming consoles, desktops, notebooks, media players, printers, Unix workstations, and any other devices with Ethernet ports. With a built-in four port switch, up to 4 devices can be simultaneously connected to the Ethernet Converter for instant wireless connectivity. The Ethernet Converter supports AOSS&#x99;, allowing you to configure a secure wireless connection with the push of a button, and offers the advanced security for WPA (TKIP, AES). Once the simple browser-based setup or AOSS&#x99; is complete, the Ethernet Converter can be moved from one device to another without reconfiguration. You can even add an optional Buffalo antenna for extended range and performance.FeaturesHigh Power Wireless increases performance by up to 70% and extends range by up to 50%802.11g Wireless 125* High-Speed Mode (Turbo G) transfer rates when used with 125* High-Speed Mode&#x99; (Turbo G) Access Points or Wireless RoutersFour built-in 10/100 ports for up to 4 simultaneous wired devicesEasy and Secure Wireless Connections with AOSS&#x99;Can be used horizontally or verticallyCompatible with 802.11b and 802.11g wireless routers and access pointsSimple web browser configuration, no drivers neededCan be moved from device to device without reconfigurationEnhanced security with WPA (TKIP, AES) and standard 64/128-bit WEPWorks as a high-speed wireless gaming adapter", "title": "Buffalo Technology AirStation Turbo G High Power Wireless Ethernet Converter ( WLI-TX4-G54HP )", "price": 74.6, "salesRank": {"Electronics": 109451}, "imUrl": "http://ecx.images-amazon.com/images/I/4140Q213J2L._SX300_.jpg", "related": {"also_viewed": ["B008LTPFG6", "B004UAKCS6", "B001QVN2NE", "B003KPBRRW", "B005N6XBDO", "B007CO5DZ4", "B005O88CY4", "B00BZQLBG0", "B000AOKTJ8", "B0062K5JAI", "B0056VP0KS", "B006P191F8", "B007ZT23ZE", "B005KN1YV6", "B005OIB6XI", "B003ZM17R0", "B00008WMBT", "B006V72AHC", "B00KGGHYWK", "B005CSOE1G", "B001769K3O", "B00IB8IVDQ", "B008140GOC", "B006WU2LCC", "B007KZQM9Q", "B00FX38A56", "B00I0MKIDO", "B007PTCFFW", "B002YETVVE", "B002FB684E", "B00A66WJWK", "B0096239G0", "B004FMI3DA", "B00009X6DT", "B006DEBYWU", "B005WKIKA0", "B0096239FG", "B00HK8V0YK", "B00H4WMZ1O", "B00HQ883QW", "B00HHRP11C", "B009MIGCW6", "B000051QDD", "B0034CL3MA", "B00FRMAOIO", "B009OZUPUC", "B00416Q5KI", "B004YAYM06", "B004UBU8IE", "B00HZWOQZ6", "B0077BB3VA", "B00BBD7NFU", "B004EGI3CI", "B00794RDVY", "B005FDXMJS", "B003ZM17RK", "B0087NZ31S", "B002SZEOLG"], "buy_after_viewing": ["B008LTPFG6", "B004UAKCS6", "B001QVN2NE", "B005KN1YV6"]}}