{"asin": "B0047T79VS", "categories": [["Electronics", "Portable Audio & Video", "CB & Two-Way Radios", "Accessories", "Antennas"]], "description": "With the Belkin Bluetooth Music Receiver, you can wirelessly connect your iPhone or iPod touch to your home stereo or stand-alone speakers. When you pair a Bluetooth-enabled device with your home speakers, you'll not only enjoy superior music quality, but also the convenience of a wireless connection. Change music tracks or skip to another artist from the comfort of your sofa. Freedom from docks and cables means that you'll have complete control.BluetoothMusic ReceiverAt a Glance:Play your iPhone/iPod touch music wirelessly through your home stereoCompatible with most A2DP stereo Bluetooth-enabled devicesControl your playlist without leaving the sofaPairs with up to six devicesPlay music from your iPhone/iPod touch wirelessly through your home stereo.Play your music wirelessly from up to 33 feet away.View larger.Play the Music of Your iPhone/iPod touch Wirelessly Through Your Home StereoEnjoy the convenience of a wireless connection while listening to your favorite tunes. With the innovativeBluetoothMusic Receiver, you can appreciate the superior sound of your home speakers while controlling your playlist from the comfort of your sofa. Say goodbye to the hassle of cables, docks, and cradles, and play your iPhone or iPod touch wirelessly through your stereo. With Bluetooth 2.0 technology, you'll get reliable, high-quality sound.Simple and Easy Wireless Set-UpGetting started with theBluetoothMusic Receiver is easy. The Receiver itself connects to your home stereo or speakers using the included 3.5mm-to-RCA or 3.5mm-to-3.5mm cable. You can then pair your Bluetooth-enabled device with the Receiver wirelessly from across the room in your sofa or favorite chair. The Receiver stays connected up to 33 feet away, giving you plenty of freedom to move about as you choose.Connect up to Six Different DevicesThe Receiver will store information for up to six different devices, making it easy for you to connect your friends' or family members' devices and enjoy their music.Low Profile, Elegant DesignThe discreet and elegant design of the Receiver will complement any home stereo system. Its small, unobtrusive footprint fits easily next to your stereo or speakers.About Belkin International, Inc.Belkin offers a diverse product mix that provides people with seamless electronics integration in their homes, cars, and on the go. Founded in California in 1983, Belkin is a privately held company and the recognized leader in connectivity solutions, in addition to accessories for MP3 devices, computers, and more. We provide extensive solutions for networking, home theater--with our PureAV line of cables, power, and digital wireless accessories--and many more categories. Belkin's phenomenal growth has led to our expanding global presence. In addition to corporate headquarters in Los Angeles, we now have offices throughout Europe--in the United Kingdom, the Netherlands, and Germany, among others--and in the Asia Pacific region, including Australia, Shanghai, and our regional headquarters in Hong Kong.The BelkinBluetoothMusic Receiver is backed by a one-year limited warranty.What's in the BoxBelkinBluetoothMusic Receiver, power adapter, user manual, 3.5mm-to-RCA cable, and 3.5mm-to-3.5mm cable.Belkin iPod Accessories - Music ReceiverF8Z492-PBluetooth v 2.1YesCompatibilityCompatible with all devices enabled with A2DP stereo BluetoothRCA-to-3.5mmYes3.5mm-to-3.5mmYes", "title": "Belkin F8Z492-P Bluetooth Music Receiver (Discontinued by Manufacturer)", "price": 26.39, "imUrl": "http://ecx.images-amazon.com/images/I/31Gswo6POtL._SY300_.jpg", "brand": "BELKIN", "related": {"also_bought": ["B00EABK4L0", "B0049P6OTI", "B00AY1K50U", "B00CSJHCH0", "B00IL7BWGA", "B008AGQMQC", "B00AG6NSNO", "B00CBCGAL8", "B0035JL35O", "B009OBCAW2", "B00C2P61FO", "B00D4FD7LC", "B00EBGF46Y", "B000QSPO3Y", "B00C4MT274", "B0029HHIDY", "B004B8GF7Y", "B001F0RO2G", "B007NEBBA4", "B001AH8HL6", "B00BQO4TXS", "B000I23TTE", "B001EAQTRI", "B0094G44PS", "B00I0MKMBW", "B00DR0PDNE", "B00419ZRZ4", "B003ZX4RD0", "B004WR125O", "B001P2VV50", "B00A71CMDU", "B004CLYJ2I", "B009NLTW60", "B00GX71GNO", "B001CXXDBM", "B000N5UW96", "B007WH7S4A", "B0001VHARE", "B00F25Z0FS", "B008YS1YQO", "B00ANDHBNS", "B000K8MV86", "B006U1VH2S", "B00727FE5U", "B0070Z87YO", "B003VPAF56", "B000J5N1WA", "B0001VGFKW", "B003971B9K", "B000A5S926", "B0002GUBIS", "B00E3FHXYO", "B007TUSXEY", "B00512Z86I", "B006FPQQQQ", "B00GZGQBTM", "B001E1JKFU", "B003MQO96U", "B001B3M9YK", "B000OF92KA", "B002P6EQPW", "B0082CFIVY", "B00005202U", "B0001VHARY", "B004EBX5GW", "B00BB8ZIQQ", "B002RMPHMU", "B00FRQVJTS", "B008O16FH4", "B00HZVPD72", "B00068F15K", "B000P9IRFQ", "B0049IZMUW", "B007Q45EF4", "B00004UE8E", "B00IQBSW28", "B000GTOUG0", "B005A0B7CA", "B00GJFGDYC", "B0077IPRAG", "B0015XIPN0", "B0006DONOK", "B0056IB3DY", "B00ATZJ606", "B0032ANC8M", "B004QWOSLK", "B002U4OEDS", "B000P3WPHI", "B0001VHARO", "B00GE1DHNQ", "B007QIXSVM", "B00BQ5RY1G", "B005QB24LQ", "B00B1HVI4I", "B002JIMZU4", "B008UG7PDQ", "B0094CX0NO", "B0042DIZTE", "B005LJQNQU"], "bought_together": ["B0049P6OTI"], "buy_after_viewing": ["B009OBCAW2", "B00IQBSW28", "B009NLTW60", "B008AGQMQC"]}}