{"asin": "B00020BV0Q", "description": "Maybe you've heard this one before: as a battle-hardened badass, it is your job to explore an expansive free roaming environment by stealing vehicles and using overpowered assault weapons to clear your path. Of course, the landscape is also peppered with various characters eager to assign you missions and reward your efforts. Sound like a tune you've been dancing to for a while? Though you may not find Mercenaries incredibly original or compelling, it gets a ton of mileage out of the fact that it is always fun to watch things explode. Always.Set in a politically unstable North Korea (with several foreign powers vying for supremacy), Mercenaries puts you in the shoes of one of three elite soldiers-for-hire. Though each character technically has particular strengths, the effect they have on actual gameplay is negligible &#x96; any character can use any weapon and drive any vehicle. Fortunately, there is a ton of each to experiment with, leading to some truly hilarious carnage. I especially loved flying around in a helicopter, lowering a winch to grab a passing civilian car, and then slinging it into enemy fortifications. Then again, it's hard to beat that warm feeling you get after brutalizing an international criminal and leaving him lying handcuffed and prone next to some C4.Though I certainly enjoyed dinking around like this for a while, Mercenaries banks on the appeal of wholesale destruction rather than genuinely engaging gameplay. Though it is to be commended for trying to expand the standard \"cruise around doing missions\" experience, the things it adds don't really contribute much. For instance, though the concept of warring factions and fluctuating loyalties is cool, it is painfully weak in execution. If you work with the Chinese, you cheese off the Russian Mafia. However, if you bribe them, then everything is fine again. In other words, who you work for and who you blow up doesn't have any real repercussions; if you've got cash, you've got friends.Much like the impressive and abundant explosions the game contains, whatever spark of interest Mercenaries may ignite quickly fizzles out due to lackluster mission objectives, flat story and characters (though Matthias, the Swedish merc, has some funny moments), and a generally derivative feel. Like the boring guy the girl always dumps in romantic comedies for the dynamic and spontaneous \"Mr. Right,\" Mercenaries can temporarily fill a void in your life, but you won't want to hang on to it forever.Concept:Run and gun while pledging your allegiance to whoever has the deepest pocketsGraphics:Apart from some really pretty particle effects, nothing stands out visuallySound:The game's high point. The mayhem is accompanied by a rousing and majestic scorePlayability:Great job giving each vehicle a unique feel, but none of them are particularly fast or fun to driveEntertainment:Your enjoyment directly depends on how long you can stand the \"go here and kill these people\" formulaReplay:ModerateRated:7.5 out of 10Editor:Joe JubaIssue:February 20052nd Opinion:If developer Pandemic's Full Spectrum Warrior restricted players to the confining box of military tactics, then Mercenaries takes the blinders off and lets gamers step out into a wider world. Full Spectrum Warrior was a game of robotic toy soldiers, and Mercenaries also lacks a soul as it plays the part of rebel without a cause. I had fun running and gunning with each double and triple cross, but at the end of the day, the title remained a flittering butterfly (albeit one packed with anti-tank missiles), with no one aspect really grabbing my imagination or lifting Mercenaries above being a collection of generic action missions. I will say this: Kudos to Pandemic for allowing enough wiggle room in the title's design to give you the freedom to complete jobs for all the competing sides without breaking the game. After all, you are a professional with a job to do, and Mercenaries makes it a fun day at the office.Rated:7.75 out of 10Editor:Matthew KatoSubscribe to Game Informer", "price": 93.73, "imUrl": "http://ecx.images-amazon.com/images/I/51BC882W0ML._SY300_.jpg", "related": {"also_bought": ["B000QCU9I0", "B00097IA88", "B0009351RK", "B000088KH4", "B001ELWMHI", "B0002SQ0BS", "B00006LELH", "B00019HNN2", "B00008J7NZ", "B00005NZ1G", "B000067DPM", "B0006ZJPSC", "B0001ADAMO", "B000B2YR74", "B00008G75X", "B0001UEHP8", "B0001DI6FM", "B00020BV2E", "B0008GJRQ4", "B004AGYHUE", "B000G82DDS", "B00020BV1A", "B0007SL202", "B00082ZQZY", "B0006I5I58", "B0006BK5AI", "B00006JC48", "B00019AZA0", "B000B6MLZK", "B000FW6MFK", "B0001JXQ5Q", "B00005BZCH", "B000095ZH0", "B00012TIW8", "B0002IQC8Y", "B0001I9YE4", "B0001KUE7S", "B0007ZD79E", "B00019AZAK", "B0009O7HUI", "B00008KTNW", "B0002ILSH4", "B000AOEV6A", "B00067AVSS", "B00006JZQZ", "B0009Z3HZQ", "B00095LEEW", "B0009VQANQ", "B000087L4G", "B000AX21VI", "B001I020CW", "B00006LU9C", "B00006JC3S", "B000069BCN", "B00005U8TR", "B0001AVSH8", "B000784XIA", "B00006C296", "B0007OGDHS", "B00008XKZM", "B000QAVV6G", "B00009ZVHR", "B0008JILX6", "B0000TSR4W", "B000F2JUOK", "0761547495", "B0002EJ852", "B000HVDEQO", "B0007PIEAQ", "B00006C28W", "B0007PLKZW", "B00009X3SY", "B0009PQ0IM", "B00005RKO7", "B0000DJX7I", "B0000A92KZ", "B00006IJIS", "B00005OWBL", "B0000AJMPK", "B000FDMV9U", "B000093NQH", "B0006I5FLU", "B0008FU15G", "B000088KH3", "B0009R1T9U", "B0000A1OG8", "B000A0IBLK", "B0002CHJA0", "B000930DA0", "B00008G886", "B000G80MOU", "B00005NZ1K", "B00006JN5J", "B00008DHNZ", "B002K8Y23G", "B0000C4M23", "B00006409Z", "B00005NZ1X", "B0009O7HUS", "B0002GTFJO"], "bought_together": ["B000QCU9I0"], "buy_after_viewing": ["B000QCU9I0", "B00020BV2E", "B0009351RK", "B00008J7NZ"]}, "salesRank": {"Video Games": 6959}, "categories": [["Video Games", "More Systems", "Xbox", "Games"]]}