{"asin": "B001TCJFCM", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Cables & Interconnects", "Video Cables", "HDMI Cables"]], "description": "Our HDMI Cables are high quality cables that will do exactly what you need an HDMI cable to do. Simply put, they will cleanly transport the signal from your Blu-Ray player, PS3 or X-Box to your television without degrading the picture. And if your Blu-Ray player or game console happens to transmit 120hz, they will not get in the way of that either. Our HDMI cables are CERTIFIED Category 2 by HDMI Authorized Testing Center to meet or exceed todays most advanced HDMI standard. Unlike category 1 cables, which are only guaranteed to throughput 1080i resolution, our HDMI cables are certified category 2, which means they are guaranteed to throughput 1080p. Please visit the HDMI.org website to learn more about the advantages of high speed category 2 cables. Category 2 cables offer the most advanced performance to date and are a technological step up from Category 1 cables. Offering support for 120Hz refresh rates, 48-bit Deep Color, and Ultra-High Speed 10.2gbps transfer rates, Version 1.3b Category 2 cables will support the most advanced features of todays equipment. Perfect for Playstation 3 and Blu-Ray equipment. We utilize 28 gauge premium cable, 24K gold plated connectors and dual Ferrite cores for maximum noise reduction. This premium HDMI cable will enable home theater and gaming equipment to perform at its highest level.", "title": "High Speed HDMI Cable, 6 feet  (Colors may vary)", "price": 5.69, "imUrl": "http://ecx.images-amazon.com/images/I/41gaGYGAp7L._SY300_.jpg", "brand": "MIG", "related": {"also_bought": ["B00FO12XY6", "B001CHM3VO", "B0083J7E9A", "B00IKMHQ7K", "B000M87F0I", "B001XILMEG", "B00IIVH2AE", "B00B46XUQU", "B000NJH592", "B005GGTTZ0", "B00FL4EWEK", "B005EZTUMU", "B00BGGDVOO", "B008I640HW"], "bought_together": ["B00FO12XY6", "B0083J7E9A"], "buy_after_viewing": ["B00FO12XY6", "B003L1ZYYM", "B00870ZHCQ", "B000NJH592"]}}