{"asin": "B0006TIA02", "categories": [["Electronics", "Computers & Accessories", "Routers"]], "description": "Push the limits of basic networking technology and experience the evolution in networking. Wirelessly share broadband Internet, boost network performance, and stay competitive in your online games with D-Link's new cutting-edge GamerLounge Wireless 108G Gaming Router, powered by GameFuel Priority Technology.GameFuel technology optimizes your network for gaming performance.See the DGL-4300 in detail;frontandrear.The D-Link DGL-4300 Wireless Gaming Router intelligently manages and automatically prioritizes network traffic to better execute bandwidth-sensitive applications including VoIP and multimedia applications. It also features enhanced wireless technology for optimal range and connectivity--up to 108Mbps bandwidth, pre-configured ports to accommodate up to 256 policies for games and applications, and customizable settings to add or modify new applications or game configurations.Other features include multi-tasking between other applications without degradation in game connection, high-Performance CPU to support thousands of concurrent connections--ideal for P2P applications and multiplayer interactivity. Meanwhile, a firmware upgrade notification feature keeps your new D-Link Gaming Router up to date.What's in the BoxDGL-4300 Wireless 108G Gaming Router, detachable antenna, CAT5 ethernet cable, power adapter (5V, 2.5A), mounting kit, vertical stand, CD-ROM with manual, and installation guide.", "title": "D-Link DGL-4300 Wireless 108G Gaming Router", "price": 122.39, "salesRank": {"Electronics": 71299}, "imUrl": "http://ecx.images-amazon.com/images/I/41L8S0FHDKL._SX300_.jpg", "related": {"also_viewed": ["B006QB1RPY", "B00DDK1QUC", "B00F0DD0I6", "B000Z7AKGC", "B003Q9CI48", "B00C9VB318", "B00KF93DBO", "B0081TXJ28", "B000LIFB7S", "B009V00K3W", "B0049YQVHE", "B009UZZW1S", "B0068ALVAO", "B00J8NCVX4", "B0088CJT4U", "B008HO9DK4", "B007KZQMO6", "B008ABOJKS", "B007IL6OR2", "B005DIPWFC", "B00BYRPPAS", "B00K91DB7Y", "B00B0CQCCC", "B00CIE0RK4", "B008DWCRQW", "B001UI4RTG", "B00C9V0OBI", "B00CCIL9NU", "B002HWRJY4", "B000GVTX6U", "B007IL7AKM", "B008RV51EE", "B00FK1E46U", "B00HKEI3DA", "B00BUSDVBQ", "B002OMX0XQ", "B008LTPFG6", "B0081TXIXI", "B00387G6R8", "B004PA2B6C", "B0010TEOLQ", "B000QD7B6W", "B00EM5UFP4", "B00KWHMR6G", "B000BTL0OA", "B00FB45SI4", "B00CL58K0Y", "B00D69747O", "B004T9RR4A", "B0019EQ1RW", "B006TZM6XO", "B0050SLU6K", "B00D8AMKKC", "B0041LYY6K", "B001FWYGJS", "B003Y5RYNY", "B00EXK14S0", "B00K3EPYP4"], "buy_after_viewing": ["B006QB1RPY", "B00DDK1QUC", "B00F0DD0I6", "B008HO9DK4"]}}