{"asin": "B001OI2Z4Q", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "The Canon VIXIA HV40 is one of the latest additions to our large family of HD camcorders. For those seeking the ultimate in HD video quality, we bring a host of Canon Exclusive features you won't find anywhere else - from our own 2.96-megapixel Full HD CMOS image sensor and advanced DIGIC DV II image processor, delivering breathtaking detail and the best in color reproduction, to SuperRange Optical Image Stabilization and Instant Auto Focus to give you the ultimate control demanded by High Definition. With the Genuine Canon 10x HD video zoom lens and a host of other advanced features the VIXIA HV40 is sure to be your choice in High Definition camcorders. If you wish to continue to use your existing Standard Definition equipment, the VIXIA HV40 has both SD and HD recording modes.  The VIXIA HV40 is easy to use and delivers the high level of performance you've come to expect from Canon. Our vast experience with photographic and broadcast television cameras brings you the optical excellence, advanced image processing, superb performance, and the latest in technological advancements you expect. The VIXIA HV40 is the premium quality High Definition video tape camcorder for sophisticated and discerning videographers.Canon VIXIA HV40 HighlightsThe Image Quality of HD VideoThe VIXIA HV40 is the HD camcorder to go along with everything else in your HD world. It captures true 1080 High Definition resolution video in 16:9 format, using MiniDV cassette tapes. The VIXIA HV40's true 16:9 widescreen HD image is made for your HD widescreen TV. High Definition and widescreen are the future. Be sure you invest in that future with Canon's VIXIA HV40.At the same time, the VIXIA HV40 gives you the flexibility to record in SD (standard definition) mode, too. That means you can enjoy the ultimate in HD video and photo quality, and still shoot SD video for viewing on your non-HD equipment.Genuine Canon 10x HD Video LensSince 1934, Canon has been producing exceptional photographic lenses that are synonymous with unsurpassed optical performance. Because of Genuine Canon Optics, every Canon broadcast lens, 35mm film camera, digital camera and camcorder assures brilliant optical quality - and the VIXIA HV40 is no exception.The VIXIA HV40 comes with an outstanding High Definition video lens - a 10x HD Genuine Canon Optical zoom. It's the lens you need to record long shots of your child on the soccer field, wide shots of beautiful landscapes, and everything in-between. And because it comes with three pre-set zoom speeds, you always get smooth, steady, professional-looking zoom shots.Super spectra coating technology results in images with minimal flare and ghosting. Plus, the lens' aspheric design reduces aberration and increases resolution, ensuring crisp, sharp video and enhancing the HD image quality. As well, a new gradation ND system gives you better exposures in bright shooting situations.Canon Exclusive: Canon 2.96-megapixel Full HD CMOS Image SensorThe VIXIA HV40 features a Canon designed and manufactured CMOS image sensor. The CMOS image sensors in Canon's EOS Series Digital SLR cameras result in outstanding digital photographs. In the VIXIA HV40, the CMOS sensor reproduces high-resolution images at 1920 x 1080 resolution with Full HD information in video images.Compared to a CCD, the VIXIA HV40's CMOS's high color resolution and advanced color reproduction gives brilliant results. It also features Canon's proprietary noise reduction technologies for crisp, sharp images. Low noise technology also means that even in dimly lit scenes, the signal from each pixel is as pure as possible, with minimal noise or other aberrations. It's the ideal sensor for HD.The VIXIA HV40 uses an RGB Primary Color Filter with Bayer Placement Pattern that separates light into red, green and blue color components. This results in vibrant images with deep, rich, accurate color and natural-looking tones similar to what you'd obtain from 3CCD camcorders. In addition, it is the Bayer pattern that delivers sharp, high definition images without creating false colors. As an added benefit, the CMOS sensor provides outstanding image capture in low light conditions.Canon Exclusive: DIGIC DV II Image ProcessorDIGIC DV II is the second generation of Canon's exclusive DIGIC DV signal processing technology. Designed specifically for HD, DIGIC DV II ensures optimal image quality. It also ensures optimal image quality for still images, even though video and still images have different color requirements. DIGIC DV II is just another one of Canon's advanced technologies that make the VIXIA HV40 an exceptional performer.Thanks to DIGIC DV II image processing, the VIXIA HV40 produces video with improved color reproduction - especially in skin tones, and dark and light scenes. It also uses a hybrid noise reduction system that employs two types of noise reduction - for high definition images that are crystal clear.Plus, DIGIC DV II enables improved continuous shooting of digital photographs with the VIXIA HV40. You can shoot five (3.1 Megapixel) still images per second, and enjoy faster processing of your images to your memory card (1.4x normal card; 2.5x Hi Speed card). It also helps lower power consumption for longer battery life.Canon Exclusive: SuperRange Optical Image StabilizationCanon's innovative SuperRange OIS combines gyro and image sensors to give image stabilization through a wider range of camera motions. Some image stabilization systems correct one type of camera motion or vibration better than another. But Canon's SuperRange OIS corrects for a wide range of camcorder motion: the fast vibration you'd experience while recording from a moving car; the medium-speed motion of hand-held recording; and the slower motion of body sway. No matter what you're recording and how you're recording it, the VIXIA HV40's stabilization design corrects camcorder shake instantly. SuperRange OIS also delivers steady images when shooting at long focal lengths.SuperRange OIS in actionIn addition, SuperRange Optical Image Stabilization keeps your shot steady without a loss in image quality - something that can't be said for electronic image stabilization. And image stabilization isn't just for video; you can even use it for taking sharper, clearer digital photographs with your VIXIA HV40. Thanks to Canon's expertise, it's easy to eliminate one of the telltale signs of amateur video and photography.Canon Exclusive: Instant AF (Auto Focus)Since it is critical to achieve very sharp focus when shooting in High Definition, the VIXIA HV40 camcorder features Canon's revolutionary Instant AF focusing system. It offers a dramatic improvement in auto focus speed and accuracy (compared to traditional autofocus systems).The Instant AF feature uses an external sensor, in combination with Canon's autofocus system, to help significantly decrease the time it takes to find focus, even in low light conditions. This system achieves focus instantaneously, reducing focus \"hunting.\" The benefits of Instant AF are especially seen in high brightness and night shooting situations. With Instant AF, it's possible to get fast, accurate focusing, even when following a moving subject.Native 24p ModeThis is a feature previously found only on Canon's professional camcorders. Native 24p Mode allows 24 frames per second, instead of the standard 60i, to be captured and recorded. It is a must for serious filmmaking work, as 24 frames per second is the frame rate of film.24p Cinema ModeAs an alternative, 24p Cinema Mode enables all aspiring moviemakers to have another way to achieve a professional \"film-look.\" You can change the camcorder's frame capture rate to 24p (recorded at 60i), which provides the appearance of the same frame rate as movie film. In addition, you can use the VIXIA HV40's CINE setting, which changes the color and tonal characteristics, evoking the look and feel of a movie shown in a theater. For added flexibility, these settings can be used together or independently.Normal mode vs. Cinema mode30p Progessive ModeUntil quite recently, you'd have to look to professional video cameras in order to have this sophisticated tool at your command. In addition to the standard interlaced video frame rate of 60i, you may choose to set the VIXIA HV40 to record 30p Progressive Frame Rate. This is particularly useful for footage you plan to upload to the Internet for sharing. In addition, this setting gives enhanced quality to still images captured after recording. 30p Progressive Mode is also excellent for capturing quick action shots and sporting events.60i vs. 30pBuilt-in 3.1-megapixel Digital CameraCanon's advanced image processing technology means your HD camcorder is also a high performance digital camera capable of capturing stunning 3.1-megapixel photos to a miniSD card. It's like having an HD camcorder and digital still camera - all rolled into one. What's more, the VIXIA HV40's many advanced photo features make it a camera that rivals other state-of-the-art digital cameras. With Canon technology, it's not just video and photos - it's the best of both.2.96-megapixel Full HD CMOSThe same Canon Exclusive 2.96-megapixel Full HD CMOS image sensor that ensures sharp, vivid HD video also gives you brilliant digital photographs. Like the CMOS image sensors in Canon's EOS Series digital SLR cameras, the VIXIA HV40's image sensor results in outstanding digital photographs. It gives an impressive resolution of 1920 x 1440 for sharp, crisp still images.Canon DIGIC DV II Image ProcessorThe DIGIC DV II Image Processor, a Canon Exclusive, enables improved continuous shooting of digital photographs with the VIXIA HV40. You can shoot five (3.1 Megapixel) still images per second, and enjoy faster processing of your images to your memory card (1.4x normal card; 2.5x Hi Speed card).Focus FeaturesAuto Intelligent Auto Focus ensures sharp images and gives creative flexibility. Even when your subject isn't in the center of the frame, the VIXIA HV40's AiAF will automatically select from 9 metering frames on the screen to help bring images into sharp focus.Since it is critical to achieve very sharp focus when shooting in High Definition, the VIXIA HV40 camcorder features Canon's revolutionary and exclusive Instant AF focusing system. It offers a dramatic improvement in auto focus speed and accuracy (compared to traditional auto focus systems). The Instant AF feature uses an external sensor, in combination with Canon's auto focus system, to help significantly decrease the time it takes to find focus, even in low light conditions. This system achieves focus instantaneously, reducing focus \"hunting.\" The benefits of Instant AF are especially seen in high brightness, and night shooting situations. It's even possible to achieve fast, accurate focusing, even when following a moving subject. And because a properly focused subject is more critical than ever with HD, the VIXIA HV40 also features Focus Assist. This helps in capturing your subject in razor sharp focus (when you start recording, this assistance is automatically cancelled).Auto Exposure ModesLike any good digital still camera, the VIXIA HV40 lets you choose from a range of exposure modes. Auto mode automatically sets the exposure, letting you concentrate on your subject. AV (aperture priority) mode lets you control depth of field by letting you choose the aperture. TV (shutter priority) mode lets you select the shutter speed for sharp action shots. In P (program) mode, the camcorder adjusts camera settings automatically.Program AE ModeYour life happens everywhere, so the VIXIA HV40 gives you settings that automatically result in the best exposure settings for different conditions and different subjects.Portrait mode ensures shallow depth of field for a pleasing background to your shots of friends and family. Sports mode stops the action with faster shutter speeds. Night mode is designed to give you great shots after the sun goes down. Snow and Beach modes compensate for bright surroundings and give you the proper exposure on your subject. Sunset mode results in vibrant, well-exposed colors for one of the toughest subjects to capture. Use Spotlight mode when your child is on stage and in the spotlight - literally - and you want to make sure the exposure is right for them. And, Fireworks mode records brilliant images of another tough subject - the holiday fireworks display.Simultaneous Photo RecordingWith the VIXIA HV40, you can record HD video and capture a 2 Megapixel photo to a memory card - simultaneously. Simply press the photo button while recording and you've got an e-mail ready digital photo to share with friends and family.Histogram DisplayFor the advanced digital photographer, the VIXIA HV40 comes with a Histogram Display - a feature found in Canon's line of digital SLR cameras. The display allows you to see the brightness information of your still images, so you can adjust your exposures as you shoot.Level and Grid MarkersWith the Level Marker feature, it's easy to keep your camera level for more professional-looking photographs. Line up any horizontal lines in your shot - such as the horizon - to the marker and you can be sure your camcorder is level.The VIXIA HV40's Grid Marker feature lets you compose your shot accurately, according to the grid in your viewfinder. You can even choose from two different colors for the grid. This ensures that you see the grid, no matter what the background color of your shot.Still Capture from TapeThe versatile VIXIA HV40 even lets you capture a still image from an already recorded movie. While playing the movie in your camcorder, simply press the photo button to capture a 1920 x 1080 still frame on a miniSD&trade; card. It's another way the VIXIA HV40 lets you enjoy and share your precious memories.Built-in FlashYour VIXIA HV40's built-in flash lets you capture superb photos indoors and in low light conditions.Custom KeyHave the same kind of creative input as the pros do! You can assign commonly used functions to one button on the camcorder for quick and easy access. Functions available to choose from include Exposure Lock (On/Off), Auto/Manual Focus, and Auto/Manual Microphone Level Control.Canon Exclusive: 2.7-inch Multi-Angle Vivid Widescreen LCDThe 2.7-inch Multi-Angle Vivid Widescreen LCD on the VIXIA HV40 lets you see more of what your camcorder is recording. Using a hard coat AR surface and improved color reproduction, the scene in the viewfinder is more accurate to what you're capturing in the camcorder. An added benefit of this Canon Exclusive is the wider range of viewing angle possible with this LCD screen. With less glare and deeper contrasts, groups of people can gather around it and see the image displayed more clearly than ever before.Advanced Accessory Shoe TerminalAnother pro-level feature of the VIXIA HV40 is the Advanced Accessory Shoe Terminal on the camcorder. Attach available extras such as a Canon VFL-1 video light or a Canon DM-50 Directional Stereo Microphone without additional wires or batteries. It's a sure way to help raise the production values of all your videos.HDMI TerminalWith the VIXIA HV40, sharing your High Definition video on your HD television is easier than ever. Only a single cable connects your camcorder to your TV for the highest quality playback (video and audio). You, your friends and family will truly experience home theater excellence, straight from your VIXIA HV40 - with no noticeable loss in image quality.Brilliant VideoCanon Exclusive - 2.96 Megapixel Full HD CMOSCanon's own CMOS sensor reproduces high-resolution images at 1920 x 1080 resolution with full HD information in video images. Compared to a CCD, the VIXIA HV40's CMOS's high color resolution and advanced color reproduction gives brilliant results. It is also unique in featuring Canon's proprietary noise reduction technologies for crisp, sharp images. Low noise technology also means that even in dimly lit scenes, the signal from each pixel is as pure as possible, with minimal noise or other aberrations. It's the ideal sensor for HD.In addition, the VIXIA HV40 uses an RGB Primary Color Filter that separates light into red, green and blue color components. This results in vibrant images with deep, rich, accurate color and natural-looking tones similar to what you'd obtain from 3CCD camcorders.Canon Exclusive - Canon DIGIC DV II Image ProcessorThanks to the DIGIC DV II image processor, a Canon Exclusive, the VIXIA HV40 produces video with improved color reproduction - especially in skin tones, and dark and light scenes. It also uses a hybrid noise reduction system that uses two types of noise reduction, for high definition images that are crystal clear.Variable Zoom Speed ControlAnother sure sign of amateur video is the unsteady zoom shot. But with the VIXIA HV40's zoom control, you simply select one of three pre-set zoom speeds for smooth, steady, professional-looking zooms.Level and Grid MarkersWith the Level Marker feature, it's easy to keep your camera level for more professional-looking video. Line up any horizontal lines in your shot - such as the horizon - to the marker and you can be sure your camcorder is level.The VIXIA HV40's Grid Marker feature lets you compose your shot accurately, according to the grid in your viewfinder. You can even choose from two different colors for the grid. This ensures that you see the grid, no matter what the background color of your shot.Low Light PerformanceSome of the most magical shots are taken at the end of the day or long after the sun has set. You won't miss any of them, thanks to the VIXIA HV40's bright Mini Video Light. The light lets you shoot subjects in color in low light up to 4.9 feet away. So, whether it's a shot of a sleeping baby, or a group of friends on a candle-lit terrace at night, the VIXIA HV40 captures all the moments you want to record.Edit and Share Your VideoYou can edit and share your video with the VIXIA HV40. Once you're connected to your computer, DV streaming and ultra-fast transfer of movies is a breeze. And because the VIXIA HV40 uses the IEEE 1394 protocol, there's no loss of picture or audio quality in the process. You'll want to share your brilliant HD memories with friends and family, and the VIXIA HV40 makes it fast and easy.Share Your PhotosYour VIXIA HV40 comes with a variety of features that make it simple to share your still photos.Print/SharePrint/Share turns your VIXIA HV40 into a photo lab in the palm of your hand. Simply connect your camcorder directly to select Canon printers or any PictBridge-compatible printer with the supplied USB cable. Then, with a simple touch of the Print/Share button, print directly from your VIXIA HV40 without going through a computer.Print/Share also makes it easy to transfer your still images to your computer. Simply connect your VIXIA HV40 and your computer, press the Print/Share button and your photos are downloaded to your computer.miniSD Memory Card CompatibleThe VIXIA HV40 makes it easy to store digital photos on an optional miniSD Memory Card. Popularly used in today's newest cell phones and half the size of a standard SD card, the miniSD Card offers the benefit of high-capacity storage in a very small size.Additional FeaturesAnalog-Digital ConverterThe Built-in Electronic Lens Cover means you never have to go looking for your lens cover again. Turn your camcorder on and the lens cover automatically opens. Turn it off, and the cover closes.Playback of 60i/30p/24p Video.USB 2.0 Full Speed Terminal for fast transfer of photos.Analog-Digital Converter lets you share the precious video memories you have stored on analog videotapes. Simply feed the analog signal from your TV, VCR or analog camcorder to your VIXIA HV40 to convert the signal to digital for recording on DV tape. Or use your VIXIA HV40 as a signal converter by connecting it between an analog device and another digital device.Wireless Remote Control lets you operate your VIXIA HV40 from a distance, so you won't be left out of the picture.1 Year Parts And Labor Limited Warranty provides protection long after other manufacturers' warranties expire.What's in the BoxVIXIA HV40 CamcorderBattery Pack BP-2L13Compact Power Adapter CA-570Wireless Controller WL-D87Component Cable CTC-100/SStereo Video Cable STV-250NUSB Interface Cable IFC-400PCUDigital Video Solution Disk", "title": "Canon VIXIA HV40 High Definition Camcorder", "price": 899.0, "salesRank": {"Camera &amp; Photo": 5761}, "imUrl": "http://ecx.images-amazon.com/images/I/41%2BjHRDcydL._SX300_.jpg", "related": {"also_bought": ["B001P8XVK2", "B0001ZA4PA", "B001ST31Y4", "B002K4K39M", "B001SSTGSU", "B002NUW0BM", "B001ELQTTA", "B000AAZQM2", "B0039GKJ1W", "B001KN6WL2", "B00005LD4W", "B001DABPPK", "B001TH7GVY", "B00005NIMR", "B000I5YZL2", "B0000632H7", "B001P95FZ0", "B002RWJGTU", "B002DVAW0W", "B002I05VNG", "B001T9O5VG", "B00CHW7MMI", "B00139XOCI", "B0001CXRXY", "B000TLXCDW", "B002GYPS3M", "B000NJD13G", "B007ZDHDRS", "B00004Z6HJ", "B00CV9MM3G", "B008T17W9O", "B007CYJ4WM", "B003F3WCS2", "B00006B8C3", "B00AWZFHG0", "B0026DUP5E", "B006IE7XZM", "B005JT24ZG", "B0007U9SOC", "B005Y1SYQ2", "B002U5MFX8", "B008RXYOKY", "B000VW6HHM"], "buy_after_viewing": ["B00114PN1U", "B001P8XVK2", "B001P95FZ0", "B00AWZFJ22"]}}