{"asin": "B000O9GGLY", "categories": [["Electronics", "Computers & Accessories", "Webcams"]], "description": "From the ManufacturerQuickCam Deluxe for Notebooks makes it easy to \"be home\" when you're away on business with dramatically simplified video calling. Small in size but big on performance, this made-to-travel webcam features a high quality glass lens and RightLight Technology for clear video calls - even in dim light. And with free one-click-to-call Logitech Vid software, staying in touch \"in person\" is easier than ever.Be home from miles away with picture-perfect, portable video calling.Who says you can't be in two places at once? You're a road warrior. And with QuickCam Deluxe for Notebooks, you can be in your hotel room in London&#8212;and be home for a goodnight kiss&#8212;in one click. This made-to-travel webcam works with free Logitech Vid software for clear, crisp, dramatically simplified video calling. No hassles. No waiting to have quality face time with the people you love back home. Watch your little girl's latest dance moves. Check out your son's new weird-science project. Blow a goodnight kiss to your sweetie. Logitech makes it easy to be there in real-life clarity and detail so you don't miss a single giggle or smile.Introducing Vid, Logitech's fast, free and easy new video calling software.It's about time video calling became easy for anyone to use. With new Logitech Vid software and the QuickCam Deluxe for Notebooks, you get a sharp and clear, yet dramatically simplified, video calling experience. It's the &quot;one-click-to-call&quot; software solution that works seamlessly with any new or existing Logitech webcam. And it's free for you and anyone you call.Easy set up", "title": "Logitech QuickCam Deluxe for Notebooks (Silver)", "price": 41.97, "imUrl": "http://ecx.images-amazon.com/images/I/41iJrcXrPGL._SY300_.jpg", "brand": "Logitech", "related": {"also_viewed": ["B003LVZO8S", "B000RZNI4S", "B000BBYH8O", "B000NB2GF8", "B000TGAVSQ", "B0007ZFLYI", "B000RZQZM0", "B004431UBM", "B00519B4YG", "B002QUZNOK", "B003LVZO88", "B0043PIZYG", "B004FHO5Y6", "B004CYLARC", "B00K11RI6W", "B0092QJRPC", "B00372567A", "B002GP7ZTG", "B000UY1OMY", "B0016JMS90", "B001DWI1F0", "B004H1MCKY", "B004YW7WCY", "B004WO8HQ4", "B009E47ZDI", "B005FYEKRK", "B00006LIOM", "B002ACQDEI", "B003JZC7AE", "B004FLJ4YI", "B002GP7ZT6", "B008GWPC1Q", "B005BZNEKM", "B0015TJNEY", "B009CPC6QA", "B009KG9FUQ", "B003M2YT96", "B004FK04M0", "B000VCTHM4", "B0007NIJBC", "B004ABO7QI", "B008ZVRAQS", "B0096KSBB0", "B003LVZO8I", "B003LVZO92", "B0052T8X3U", "B0009BBBM6", "B009H4Q6YY", "B001M53FX6", "B0019WF4FE", "B006JH8T3S", "B002DW0VT8", "B002GP7ZTQ", "B005E3U5X0", "B00465SJMQ", "B0040QE98Y", "B000GOUE7Y", "B0015BYS74"], "bought_together": ["B000RZNI4S"], "buy_after_viewing": ["B003LVZO8S", "B004FHO5Y6", "B000RZNI4S", "B004WO8HQ4"]}}