{"asin": "B00006GEX2", "description": "From the makers ofAge of Empirescomes a strategy game where the line between history and mythology has been blurred. InAge of Mythologyheroes do battle with monsters of legend, and the gods intervene in the affairs of mortal men.Age of Mythologyplayers wage war as leaders of a Greek, Norse, or Egyptian civilization with a customized pantheon. Players use human armies and diplomacy, progress through development ages, enhance military and economic performance with improvements, and manage economics through resource gathering and trade. Mythology enters the mix when players call upon the gods to act on their behalf or reinforce their armies with more than 20 mythological creatures such as jackal-headed Egyptian warriors or mighty minotaurs.Age of Mythology's revolutionary 3-D engine provides the game with gorgeous environments featuring lifelike rolling terrain, beautiful waves and water, realistic sunlight, and lush forests. The units roaming these environments are incredibly detailed, move naturally over the terrain, and come to life through hundreds of fluid animations. Amazing special effects change the look of this beautiful world when the gods get involved: all grows dark as an eclipse takes effect, funnel clouds twist and grow as a tornado sends buildings spinning toward the heavens, and meteors streak in from the heavens to send people and armies flying.An entertaining tutorial, an intuitive interface, and logical game rules allow anyone to quickly and easily learn to play. Once started, there is a lot to explore: an epic 36 scenario single player campaign, easy-to-use multiplayer gaming online, single player games against the challengingAge of MythologyAI opponents, more than 15 different random map types that help make the game infinitely replayable, nine highly differentiated civilizations, multiple difficulty levels to allow players of any skill level to have an enjoyable game, and a fully functional scenario editor.Age of Mythologyoffers something for everyone: a fun game for any playing style or skill level.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51ZSRSZ3A3L._SY300_.jpg", "related": {"also_bought": ["B000P5BSUQ", "B0000C4CLZ", "B000AB603U", "B00005N9A7", "B0049WF6FY", "B00008KA4E", "B000J13GKQ", "B00002NDRY", "B00004VP4M", "B000U92L8A", "B00001LDC8", "B002L6HJCI", "B0018YXM3Y", "B000ETRTWY", "B000EDPQMU", "B00000K4MC", "B002MUO6CE", "B002SKDIKE", "B0002ZO2UM", "B003VLKJ6U", "B0007GBBHI", "B000YQ639M"], "bought_together": ["B000P5BSUQ", "B0049WF6FY"], "buy_after_viewing": ["B000P5BSUQ", "B000J18SR2", "B0049WF6FY", "B000PWWL64"]}, "salesRank": {"Video Games": 17725}, "categories": [["Video Games", "PC", "Games"]]}