{"asin": "B00006GSO0", "description": "The Simshas much in common withTony Hawk's Pro Skater: There's a great emphasis trial and error, it encourages personalized solutions to problems, and overall success comes down to both balance and timing. Also, like the Tony Hawk games,The Simsis a very addictive game.Players micromanage the lives of a family of virtual people and influence the outcome of their lives, be it success or something akin to a nervous breakdown. The bestselling PC version of the game has, in recent years, been upgraded with elements like parties, pets, and vacations, but this iteration is closer to the basic formula.You start the game living with Mom in a one-story suburban house. You are immediately presented with certain life tasks, such as fixing the TV and making lunch, which are aligned with the skills you'll need for the game's main challenge--keeping your sims in balance on eight conflicting categories. For example, eating will have an impact on your sim's hunger rating, but it will also impact his bladder rating. You'll have to make sure that he keeps himself and the house clean, that he sleeps to restore his energy, and that he also has time to keep himself entertained. The free will option lets your sims coast a bit, and you can also save time by stacking tasks together. Time passes at the rate of about one minute per second in the game, but you can fast-forward sim time when you need to, such as when they're sleeping.The controls are justifiably complex, but adjusting to them is not difficult. You see your sims from an overhead perspective that you can both rotate and zoom. You direct their actions by moving a line cursor to where you want them to go or to what object or person with which you want them to interact.The game is surprisingly funny. Neglect your sims and they'll shout and wave their arms to get your attention. Allow one's energy to get too low and he or she will likely collapse and sleep right where they were standing. When that happens, Mom is likely to serve them dinner on the floor.Gamers may find that it takes a while to get the hang ofThe Sims' style and control scheme. Stick with it and you may find real time fast-forwarding by.--Porter B. HallPros:Interesting, open-ended gameplayLots of quirky humorTwo-player split-screen optionCons:Can be frustrating for those unfamiliar with strategy gamesControls take some getting used toLong save times", "price": 101.17, "imUrl": "http://ecx.images-amazon.com/images/I/51Y66M8GRPL._SY300_.jpg", "related": {"also_bought": ["B0000ARQMW", "B000AOEUPC", "B0002IQD3I", "B000QAVV6Q", "B000GQ1FVG", "B001MW91IW", "B0001VGFK2", "B000TLU67W", "B0000696CZ", "B00004YRQA", "B00008NRM7", "B0000C7GHG", "B0009SQF0C", "B0000A082Y", "B00005ME6N", "0761540989", "9629971372", "B0002RQ3I4", "B003KMCHTC", "B000GI7LOO", "B00004YRQ9", "B0002FQVEW", "B00005NCCI", "B000EHQDA0", "B000KCX9M4", "B0000AHRPM", "B00005BZC7", "B000095ZH5", "B00004W4WI", "B000B69E9G", "B000TYQL1O", "B00005O0I2", "B000066TS5", "B0054IUWSI", "B0002XL3BA", "B0002IQCSY", "B000930DLO", "B00005NN5A", "B000N0WBL8", "B0000TSRA6", "B00005V6BP", "B00005R5PO", "B000GACEHQ", "B00008DHNL", "B000GVYYFK", "B00023B1SU", "B00000DMAR", "B000G79YNQ", "B004E0I8II", "B00005TNI6", "B000F0GX8I", "B0000503MO", "B00005MDZ8", "B00000IZS1", "B0028ZNWNC", "B0002EJ8FC", "B000RHZJK2", "B00005OLX1", "B0007SL1ZI", "B000QB059Y", "B00097CYZS", "B00008URUA", "B004S3KB6S", "B001PKHRVO", "B001ABN93I", "B000KQ51XA", "B0015ACX3Q", "B0000B0MNH", "B0009A4EVM", "B002BWS5QG", "B00006F2ZP", "B0009O7HVM", "B0013KW1B2", "B000099T2K", "B0002CNUN0", "B00067MX98", "B001N74CXK", "B00005U8TQ", "B000BAVN14", "B00006FWUU", "B000069D39", "B00020LZAW", "B0009Z3HXI", "B00005Q8IR", "B0000A0MDV", "B000GPVUQ2", "B0006I5FL0", "B0000640A2", "B000IZAQD8", "B000SMIUQQ", "B000SEU92W", "B0009VRSIC", "B0038N09Q6", "B00006Z7HU", "B00000I1BQ", "B00006BMQB", "B000GDJJP8"], "bought_together": ["B0000ARQMW", "B000AOEUPC"], "buy_after_viewing": ["B000AOEUPC", "B0000ARQMW", "B000GQ1FVG", "B000QAVV6Q"]}, "salesRank": {"Video Games": 4516}, "categories": [["Video Games", "More Systems", "PlayStation 2", "Games"]]}