{"asin": "B00009WAVI", "description": "It's you against the mountain.SSX 3challenges gamers to drop in and conquer a massive, living mountain rife with ego-crushing challenges and gravity-bending thrills. Sporting an all-new open-ended gameplay structure, gamers are free to ride anywhere gravity takes them, seamlessly boarding from one event to the next as they begin their assault on the mountain's three larger-than-life peaks.Gamers will need to overcome everything the mountain throws at them-from fierce lightening storms and breathtaking vertical drops to serpentine slope style courses and earth-swallowing avalanches-on their quest for the ultimate adrenaline rush. The mountain presents gamers with a world of open vistas and fresh powder for out of bounds exploration, filled with trick venues, rail parks, racecourses, and half-pipes with new tricks to master and new competitors to leave in the dust.More than two years in the making,SSX 3is a massive sequel toSSXandSSX Tricky, the games that started the EA SPORTS BIG brand. Buckle up your bindings as a returning veteran or fresh-faced rookie. Get ready to take on other riders-and the biggest challenge yet-the Mountain itself.Key FeaturesConquer the Mountain: The larger-than-life mountain is your playground, your racetrack and your launch pad. Three massive peaks offer thrilling new opportunities for exploration, competition, and good old-fashioned showboating. Beat all three peaks and you're in for an epic half-hour ride down the face of the entire mountain.Go Anywhere: No menus. No restrictions. The mountain is an open canvas for gamers to explore-seamlessly ride from event to event, with no load times and no set path for gamers to follow. Hundreds of collectables, secrets, and shortcuts await.More Tricks: Gamers will have access to a massive arsenal of new Uber Tricks and special moves-from handplants to board presses. A new three-tiered Uber Trick system now includes one-footed Ubers, rail-based tricks and signature moves for each character. A new combo system allows for nearly endless combos that can run the length of the entire mountain.Characters: Four new characters join six returning favorites. Mac, Elise, Zoe, Moby, Psymon, and Kaori are back, and they're joined by the crazy Swede Viggo, mountain man Nate, 12 year-old phenom Griff, and the talented and sexy Allegra.Rich, Natural Graphics: A team lead by an Oscar-nominated visual effects artist has created the most immersive, stunning visual SSX experience to date. Capturing moments of both sublime scenic beauty and heart-pounding natural disaster,SSX 3blends subtle environmental effects like glistening snow and swaying trees with the trademark SSX graphic flash and attitude.Soundtrack: An adrenaline-charged soundtrack delivers bleeding-edge tracks and tomorrow's hits from artists including the X-Ecutioners, Felix Da Housecat, Queens of the Stone Age, N.E.R.D., and many more.Big Challenges: Gamers will find 150 unique hidden challenges, designed to test their speed, skill and style as they explore untamed backcountry areas.Customization and Rewards: Win BIG and you'll be rewarded.SSX 3let's players level up character abilities, win killer gear, stock their trophy room and buy mp3s for personal play lists and much, much more.", "price": 13.0, "imUrl": "http://ecx.images-amazon.com/images/I/51Y5JVM0Z8L._SY300_.jpg", "related": {"also_bought": ["B00005NUJ3", "B000AOEUOI", "B00004U5VS", "B00005CF9L", "B00005V6BE", "B0000A0MDV", "B00006Z7HU", "B0006I5FL0", "B0006ZJPR8", "B00004YRQ9", "B00020LZC0", "B0002Y2XXQ", "B000930DIM", "B000TLU67W", "B001MW91IW", "B00004YRQA", "B0002IQCSY", "B000056H2D", "9629971372", "B000G79YNQ", "B0000503MO", "B0000VSH3G", "B00005R5PO", "B000066TS5", "B002I0K5W8", "B00008NRM7", "B000C4088I", "B000EMJA3M", "B00005BK7X", "B0000C4M22", "B00004TNB0", "B0013KW1B2", "B0009A4EVM", "B0002HLKIC", "B000MF6X04", "B0000C7GHG", "B000GURLIS", "B00075GLUG", "B000038ABJ", "B0002RQ3I4"], "buy_after_viewing": ["B002I0K5W8", "B00005NUJ3", "B00004U5VS", "B000AOEUOI"]}, "salesRank": {"Video Games": 4649}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "More Systems", "PlayStation 2", "Games"]]}