{"asin": "B002LITT3S", "related": {"also_bought": ["B000OF2F36", "B001MJKSS2", "B005I6DVC0", "B004DBE080", "B003ZSHNG8", "B00200K1SY", "B001EQ4C8U", "B002CSNVOA", "B0035FZJMG", "B00176BDD4", "B0031RGEVI"], "bought_together": ["B000OF2F36"], "buy_after_viewing": ["B003ZSHNG8", "B003VNKNF0", "B003VNKNEQ", "B00908BQCY"]}, "title": "Canon PowerShot SX120IS 10MP Digital Camera with 10x Optical Images Stabilized Zoom and 3-inch LCD", "price": 249.99, "salesRank": {"Camera &amp; Photo": 2953}, "imUrl": "http://ecx.images-amazon.com/images/I/51FVBjR2mxL._SX300_.jpg", "brand": "Canon", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "A big, easy zoom. Everything about the PowerShot SX120 IS is easy. The Smart AUTO feature makes every shot picture-perfect. An impressive 10x Optical Zoom with Optical Image Stabilizer keeps you sharp and steady. There&rsquo;s even an Easy Mode that makes shooting super simple.PowerShot SX120 HighlightsSmart AUTO detects and analyzes faces, brightness, colors, distance, and movementJust set the Canon PowerShot SX120 IS to Smart AUTO and you're ready for maximum enjoyment from your picture taking every time. It's a relaxing and satisfying way to shoot because you can completely concentrate on your subject, knowing that the camera has the technical details covered. Advanced Canon technology intelligently analyzes your situation and shooting conditions. Then it automatically selects an appropriate setting from 18 specially defined settings. So whether you're photographing flowers, a captivating sunset, or your friends at the park, you can be confident that you're getting dramatic, memorable images.Easy Mode makes capturing images as easy as 1-2-3Even if you've never picked up a camera before, with Canon's new Easy Mode you can take inspiring, dramatic pictures that will impress everyone. Once you choose Easy Mode, the PowerShot SX120 IS handles all the details automatically. It automatically sets every camera control, including the flash, to reduce blur and improve image quality. So you get pictures that are bright, clear and natural just by pushing a button. Best of all, you can relax and concentrate on what really counts--your subject.With 20 Shooting Modes including 8 Special Scene Modes, you're ready for whatever shot comes your way.10x optical zoom in actionHigh-powered 10x optical zoom with Optical Image StabilizerThe PowerShot SX120 IS has a 10x Optical Zoom lens that makes it easy to get the inspiring, emotive close-ups that will make your images lasting keepsakes. This magnificent lens gives you the power to shoot distant subjects with razor-sharp precision and stunning lifelike color. So you can brilliantly capture a bird high atop a tree, a child&rsquo;s winning goal from across the stadium or a school play from the last row. Plus, thanks to Canon&rsquo;s highly sophisticated Optical Image Stabilizer Technology, even at maximum zoom, every image is rock steady.The PowerShot SX120 IS is equipped with Canon&rsquo;s acclaimed Optical Image Stabilizer Technology that automatically detects and corrects camera shake--one of the leading causes of fuzzy or blurred shots. Even when zoomed in, you can get the steady, crisp, brilliant images you&rsquo;ll be proud to shoot and share. And Canon&rsquo;s Optical Image Stabilizer Technology is convenient to use. It functions perfectly with or without a flash.DIGIC 4 Image ProcessorWith DIGIC 4, your images boast superior quality, the camera operates at top efficiency and battery life is enhanced. What&rsquo;s more, the DIGIC 4 Image Processor enables Canon&rsquo;s Face Detection, Motion Detection Technologies and Red-eye Correction to give you better, more true-to-life people shots. Simply press the shutter button halfway down, and the camera automatically pinpoints the faces in the scene and chooses the ideal focus point. The camera controls exposure settings and flash to keep every face looking bright and natural. The camera also selects and sets the optimal exposure and ISO settings automatically to keep everything looking sharp and clear. Red-eye Correction can be handled in-camera, in two ways. The Red-eye Correction during shooting uses the Face Detection Technology to recognize and remove red-eye from images as they're taken, before the file is written to the memory card. It's also possible to correct red-eye during image playback, using simple settings in the PowerShot SX120 IS menu.iSAPS Technologyis an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the fast DIGIC 4 Image Processor to improve focus speed and accuracy, as well as exposure and white balance.DIGIC 4 featuresFace Detection Technology, giving you the best possible results in any shooting situation. Face Detection AF/AE sets the focus point and exposure for the faces of your subjects. Face Detection FE adjusts the flash to correctly illuminate your subject to provide the best balance between your subject and the overall scene, eliminating the common problems of over and underexposed faces.Face Detection WBmeans the camera concentrates upon faces when calculating white balance for the best possible skin tones. Face Select and Track lets you highlight one face among several in a scene, and the camera concentrates on that person, even as they move around the scene. Face Detection Technology is a powerful contributing factor in Canon's Motion Detection Technology.Simply press the Face Selector Button, then the selected face is double-framed and tracked when the face moves in the frame.Motion Detection Technologyworks in the background to instantly evaluate how fast your subject is moving. It automatically selects and sets the optimal exposure and ISO settings to keep everything looking sharp and clear. This feature provides higher ISOs when you need it for action-stopping shutter speeds. But when no movement is detected, it sets lower ISOs for excellent color and detail.Life doesn&rsquo;t give you second chances to capture special times. That&rsquo;s why the PowerShot SX120 IS features an ISO 1600 setting that reduces the effects of camera shake and sharpens subjects in low-light situations, giving you greater shooting flexibility.Red-eye Correctionprovides three options for removing red-eye from subjects in flash pictures.1) The Red-eye Correction during shooting actually identifies and corrects red-eye in human subjects as pictures are taken.2) The PowerShot SX120 IS can be set to automatically detect and correct red-eye during image playback.Large 3.0-inch PureColor System LCDYou&rsquo;ll want to have your PowerShot SX120 IS with you wherever you go, and a slim new design makes it easy. Subtly rounded for an easy grip, the camera exudes modern elegance and simplicity. The back panel&rsquo;s neat, intuitive interface includes a luxuriously big 3.0-inch PureColor System LCD screen. And the PureColor System LCD screen&rsquo;s quality is as impressive as its size: you&rsquo;ll get an exceptionally clear, bright view of all your shots, and enjoy a conveniently wide viewing angle for showing off your pictures to friends and family.AA battery powered camera enables you to easily power upConveniently, you don&rsquo;t need to worry about running out of batteries or having to recharging them. Since AA-size batteries can be purchased at any store, simply get new ones locally--wherever you go, no special power adapters or chargers are needed.What's in the BoxPowerShot SX120 IS BodyAA-size Alkaline Battery (x2)SD Memory Card SDC-32MBWrist Strap WS-800Digital Camera Solution CD-ROMUSB Interface Cable IFC-400PCUAV Cable AVC-DC400"}