{"asin": "B000FFIL92", "related": {"also_bought": ["B0037TKJNO", "B000N2XM4Q", "B005P0JNZ8", "B004PVAJ7O", "B0085010YW", "B00822Y04U", "B000OLCX8C", "B0073MXRTO", "B000N8R0EI", "B00DFVD6FC", "B004RNMX3I", "B00FZ00GJU", "B000KIT6MK", "B002E0UE8C", "B002C4KMN2", "B0030HVEN2", "B0088KYXKC", "B009N8GFIG", "B005MGAGMO", "B00D60ZSSU", "B000KHU8KU", "B00872PDAA", "B002E0UEBE", "B0035CCDPU", "B004AFKYDE", "B00DUQDIKU", "B003U7WC9M", "B000FPN8TK", "B000BJ7WNS", "B007MJGX4O", "B00FQ24602", "B006B3PXJ8", "B001L048WO", "B003ULFXWQ", "B004XEKNFG", "B003ULJJN0", "B00HWF7IYM", "B002XQ2D8Q", "B00091SDR2", "B000V5X826", "B000293XLM", "B002N62EW6"], "also_viewed": ["B00DFVD6FC", "B0037TKJNO", "B000N2XM4Q", "B004PVAJ7O", "B005P0JNZ8", "B00D16KVI6", "B0085010YW", "B000S6CCJ8", "B00325SO8U", "B0030HVEN2", "B00HJQSKOG", "B007TIU150", "B002C4KMN2", "B0073O3U44", "B00IJBQMIQ", "B00AY7CJL2", "B002KAMLDM", "B007L9RKFG", "B00LNTZ0B6", "B002T1TUHC", "B000RXW07Q", "B003U7WC9M", "B00FZ00GJU", "B001FB6IJK", "B0006DNR0Q", "B000N4TR84", "B00IJBQMEU", "B00D16KVJ0", "B000OLCX8C", "B0030I4UGE", "B0067MBEJ6", "B004AFKYDE", "B00ELNHTSS", "B001RBEPJS", "B009N8GFIG", "B000N8R0EI", "B00HJQSKOQ", "B00325L8HE", "B000XEN1LS", "B001AQQJ2Q", "B000XEQEQ2", "B0053EZ6KW", "B00EIK7ZW4", "B006UHALWY", "B000N351IA", "B002YGP6TI", "B002E0UE8C", "B00872PDAA", "B0007IJE0W", "B00GPUH6SI", "B0030HRU26", "B00822Y04U", "B00CORK5CK", "B00B1VVDTE", "B0030HPYB0", "B00EIJ5MA2", "B00325UO24", "B004XN8RWI", "B0033QRME0", "B0009F4OIK"], "bought_together": ["B0037TKJNO", "B000N2XM4Q"]}, "title": "Numi Organic Tea Flowering Gift Set in Handcrafted Mahogany Bamboo Chest: Glass Teapot &amp; 6 Flowering Tea Blossoms", "price": 26.99, "salesRank": {"Grocery & Gourmet Food": 982}, "imUrl": "http://ecx.images-amazon.com/images/I/51HepEZKjhL._SX300_.jpg", "brand": "Numi", "categories": [["Grocery & Gourmet Food"]], "description": "Numi's vision is to inspire well-being of mind, body, and spirit through the simple art of tea. Numi elevates the tea experience through quality, creativity, and authenticity. We are grateful to those who contribute to our tea journey, and we hope to have a positive impact on all members of our \"Communitea\"--from farmer to packer to our fellow tea drinker. Conscientious of the impact of our actions, we aspire to be environmentally responsible and globally sustainable by using recyclable and biodegradable packaging and sustainable bamboo in our merchandising.The Numi JourneyIn the fall of 1999, brother and sister Ahmed and Reem had a vision-to revive the serenity, creativity, and comfort that is inspired by the simple art of tea. Both artistic souls and world explorers, the two siblings have combined their belief in the transcendental properties of tea with their individual passions for photography, art, and culture. The result of this blend was Numi Tea, a refreshing and innovative selection of teas and teasans that awaken the palate, inspire the soul, and gracefully enhance water's unique potential.The brother and sister duo behind Numi TeaAhmed, the master alchemist behind Numi's blends, discovered the calming simplicity of tea and herbal teasans while living in Prague, Czech Republic, where he co-owned and ran two teahouses. A distinguished photographer, Ahmed used his artistic and intuitive nature as a foundation for his innovative and artisan approach to the blending of teas.Fluent in English, Arabic, French, German and Czech, Ahmed is a citizen of the world; each pot of Numi tea is an amalgamation of his worldly cultural knowledge, his in-depth understanding of teas, and his appreciation for quality.Ahmed's sister Reem has a background that is almost as diverse as the selection of Numi teas. Before the advent of Numi, Reem, a biomedical engineer, moved to Italy to nurture her artistic aspirations. Reem has exhibited her artwork around the world in San Francisco, New York City, Melbourne, and Florence. But you don't need to be a globetrotter to admire her artwork--Reem's original paintings are also exhibited on each one of Numi's packages. Inspired by her brother's photos and by the meditative nature and timeless essence of tea, Reem painted Numi's artwork using oil on small tin plates, with imagery that evokes a slower, more contemplative way of being. Reem believes that tea, like art, has a universal essence and is a portal for self-reflection.What started as a dream in Reem's small Oakland apartment moved to a lovely 25,000 squrare-foot space on the Oakland waterfront and has progressed into an exciting and delicious journey. Since its beginning, Numi has carved a distinct path in the U.S. tea world by introducing exotic teas such as Rooibos (Red Tea), Lemon Myrtle, Honeybush, and Dry Desert Lime, and also by offering full-leaf tea in teabags, without added oils or flavorings. Numi continues to pave the way and set new tea trends, most recently with its creation of the hand-sewn and handcrafted \"Flowering Teas.\""}