{"asin": "B000NB05MO", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Hubs"]], "description": "Featuring a sleek white finish, the Belkin USB 2.0 Plus 4-Port Hub (F5U304-WHT) lets you connect up to four peripherals through a single open port on your PC or Mac. Two top-load ports offer easy access for thumb drives and card readers, while two side drives are ideal for printers, scanners, and other more substantial devices. Also offering cord management and a truly minimal footprint, this Hub supports USB 2.0 and USB 1.1 connections, and plug-and-play installation makes adding it to your existing system quick and easy.USB 2.0 Plus 4-Port Hub (White)At a Glance:Compact design weighted to stay in place and upright4 USB 2.0 downstream ports including 2 top-loading portsCompatible with both USB 2.0 and USB 1.1 devicesConvenient plug-and-play installationOver-current protection guards computer and peripheralsBacked by a lifetime warrantyTwo top-loading ports provide quick access.View larger.High-Speed Convenience with Four USB 2.0 PortsThe Belkin USB 2.0 Plus 4-Port Hub features four USB 2.0 downstream ports for fast, efficient data transfers. In addition, it's backward compatible with USB 1.1 devices, which means you can keep older-generation peripherals up and running while maximizing the high-speed performance of new devices.Cord Management for Reduced ClutterCompact and elegant, the Plus Hub offers a unique configuration with two of its downstream ports situated on the top of the case, providing extremely easy access when you're using thumb drives, USB lights, media readers, and other portable peripherals. The remaining two ports are located on the side, and are positioned for optimal use with the Plus Hub's integrated cable-management feature. This unique design also includes an internal weight and stay-put pads to keep it upright and anchored securely on your desk.Cord-Free Power with Over-Current ProtectionThe Plus Hub requires no external power supply for use with most devices, which means an even further reduction of cord tangles and desk clutter. In addition, convenient LEDs make monitoring its power status easy.And the smart design also works to prevent damage to your expensive computer and USB devices by providing over-current protection.Plug-and-Play InstallationA plug-and-play setup gets the four-port Plus Hub up and running quickly and easily. Simply connect it to your computer using a USB cable (sold separately), follow the on-screen directions, and start connecting devices.System Requirements and Warranty InformationThe Plus Hub works with a broad range of systems. For PC users, it supports use with Windows 98, 2000, ME, XP, or Vista. For Mac Users, it supports OS 9 to OS 10.The Belkin USB 2.0 Plus 4-Port Hub is backed by a lifetime warranty.What's in the BoxUSB 2.0 Plus 4-Port Hub, AC power adapter, and manual.USB HubsUSB 2.0 4-PortUltra-Mini HubHi-Speed USB 2.04-Port HubHi-Speed USB 2.0 7-Port Lighted Hub (Black)Hi-Speed USB 2.0 7-PortLighted HubHi-Speed USB 2.0 7-PortMobile HubPorts44777USB 2.0YesYesYesYesYesUSB 1.1YesYesYesYesYesUSB PoweredYesNoNoNoNoAC PoweredNoYesYesYesYesUSB HubsUSB 2.04-Port HubUSB 2.0 PlusHub (4 Port)USB 2.0 Plus7-Port HubHigh-Speed USB 2.07-Port Hub2-in-1 USB 2.07-Port HubPorts44777USB 2.0YesYesYesYesYesUSB 1.1YesYesYesYesYesUSB PoweredNoNoNoNoNoAC PoweredYesYesYesYesYes", "title": "Belkin USB 2.0 4-Port Hub, White", "price": 15.0, "imUrl": "http://ecx.images-amazon.com/images/I/41zHCQzyZnL._SY300_.jpg", "brand": "BELKIN", "related": {"also_bought": ["B003K1EYM6", "B000NAXC6Q", "B000NB2BGC", "B002VA464S", "B00D4K8SBQ", "B003MTTJOY", "B009SQQF9C", "B004L9KLT6", "B000Q8UAWY", "B000NAXC6G", "B005DVF15A", "B003VNKNEG", "B0002CZW0Y", "B00C8NNZ36", "B0002H0H4A", "B00DG9D6IK", "B009GUVZOK", "B00008VFAF", "B008TCUXLW", "B003NREDC8", "B0068RKK18", "B001TH7T2U", "B005UUY2HC", "B008XVAVAW", "B003UE52ME", "B000MYIIRG", "B003HHK576", "B008ALAHA4", "B001TH7GV4", "B007PEIHKE", "B001TH7GUU", "B000067RMT", "B009SPL2K0", "B0052SCU8U", "B005DLDTAE", "111846446X", "B000J2EN4S", "B008LTBJFW", "B002QEBMCI", "B000HPV3RW", "B000CRFOMK", "B003ELVLKU", "B0015DYMVO", "B00009V2QX", "B005FYNSZA"], "bought_together": ["B003K1EYM6"], "buy_after_viewing": ["B000NB2BGC", "B003K1EYM6", "B000Q8UAWY", "B00D4K8SBQ"]}}