{"asin": "B001H9O6QW", "description": "Product DescriptionSansa&reg; Clip 4 GB MP3 PlayerClip it on and rollFor the movers and the shakers who want to shed the baggage of a bigger MP3 player&mdash;it&rsquo;;s time to get the skinny on the Sansa&reg; Clip player. Offering five colors to choose from, this lightweight MP3 player delivers major sound for its matchbox size, and storage capacity of up to 2GB*. And with its smart design, you can clip your Sansa&reg; Clip player to your bag, pants or sleeves, allowing you to enjoy all the perks of an MP3&mdash;hands-free.ListenKeep up to 1,000*** songs at the ready wherever you go. Or tune into FM radio for news and fresh music anytime.RecordWith the built-in microphone, you can record memos, lectures or all those unexpected, mic-worthy moments throughout your day. When you're ready, transfer your files to your PC for listening and sharing.Get togetherThe Sansa&reg; Clip player plays MP3, WMA, secure WMA and Audible file formats. Connect via USB cable to your computer for charging or synchronizing.Sort it outA compact MP3 player with a screen, the Sansa&reg; Clip player makes navigation simple, so you can sort your music, FM stations and audio books ease.So what's in the box?Sansa&reg; Clip MP3 player, Clip accessory, USB 2.0 transfer cable, earphones, promotional inserts, and quick start guide.* 1 gigabyte (GB) =1 billion bytes. Some capacity not available for data storage.** Based on continuous playback at 128kbps; actual life and performance may vary depending upon usage and settings; battery not replaceable.*** Approximation based on 4-minute songs at 128kbps.Choose Sansa&reg;, a smarter way to playSansa&reg; products are brought to you by SanDisk, the minds behind flash memory. Around the world, wherever people take pictures, listen to music, use cell phones&mdash;or do much of anything at all with digital devices&mdash;you&rsquo;;ll probably find SanDisk products. Maybe that&rsquo;;s why, after more than 20 years in the business, SanDisk has never stopped innovating.END", "title": "Sandisk Sansa Clip 4 GB MP3 Player (Black)", "price": 34.99, "imUrl": "http://ecx.images-amazon.com/images/I/41uRsq-RUNL._SX300_.jpg", "related": {"also_viewed": ["B002MAPT7U", "B002MAPS6W", "B002MAPRYU", "B002MAPSC6", "B000VIHFZ4", "B001JIDEXW", "B00HCMZ19Y", "B00400TGEC", "B0015L0T68", "B005FVNGRS", "B004COIBFG", "B00HCMZ2SE", "B009PO32AM", "B005FVNH04", "B003ZUGKHY", "B00HCMZ0OK", "B00BJNHGRM", "B005FVNGRI", "B005FVNGZU", "B004M8SSTG", "B0041G62R4", "B000ETTFRG", "B00D1ZXVDY", "B005FVNGZA", "B007B5TQQG", "B005FVNGZK", "B007B5TOZY", "B0015L0T3G", "B007V7XQ7E", "B00HCMZ4H8", "B005FVNGS2", "B00ECRPOKS", "B00HCMZ1OY", "B002MAPSQM", "B000XQT4PI", "B00ECQUY2M", "B008V64N3K", "B00CE3YJCQ", "B00H3E5KT2", "B00JQI6C72", "B00IH4R306", "B004SKBHB4", "B004CSY96W", "B00ECRRB8G", "B000IM5GBS", "B00ECRRWTE", "B000MQH9MO", "B000ETXOC8", "B00AF40U5G", "B009RQW3BC", "B000BONJXU", "B0015L451I", "B00KCV52S2", "B00BG13P9K"], "buy_after_viewing": ["B002MAPT7U", "B005FVNGRS", "B002MAPS6W", "B002MAPRYU"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}