{"asin": "B000EP4TWQ", "description": "A thinner design, stylish colors, a brighter display, hours of battery life--just about the only thing that hasn't changed on the Apple 2 GB iPod Nano is the name. Your music says a lot about you, and so should your Nano. The super-slim design--0.26-inches thin and a light 1.41 ounces--says you always have room for music, 500 songs, in fact. Durable anodized aluminum says you won't let the rough and tumble of everyday life ruin your groove. And the attractive colors says whatever you want.A colorful music ensemble.The iPod Nano measures up nicely.New aluminum design, same small size.The iPod Nano ships with newly-designed earbuds.Use iTunes to import your CDs, shop for songs on the iTunes Store, and then sync them to your iPod Nano. Possibly the world's coolest photo album, iPod Nano can hold tens of thousands of snapshots, and even play audiobooks and podcasts. And whether you're exercising, commuting, or taking a road trip, the iPod Nano delivers hours and hours of battery life to keep you rocking. While it can't stop the rain, iPod Nano might make your day a bit bright, 40-percent brighter to be exact. Album art pops and slideshows stun on the iPod Nano's dazzling, now-brighter display. That means everything looks just as good as it sounds.Music, Podcasts, and AudiobooksFinding and playing music on your iPod Nano is simple. Menu options let you browse by artist, composer, album, song, genre or playlist. Want to mix things up? Simply click Shuffle Songs. iPod Nano makes your music look as good as it sounds, thanks to a 1.5-inch color display. Album art appears alongside your song titles, so you can see your music as you play it. And when you dare to wear iPod Nano, that display guarantees you'll say a lot without saying a word.The iTunes Store features thousands of free podcasts--radio-type shows you subscribe to--including indie favorites and offerings from big names such as, ABC News, Comedy Central, ESPN, PBS, NPR, and many more. Browse and subscribe to podcasts, then sync them to your iPod Nano and listen anytime. All your podcasts appear in their own menu on your iPod Nano, so they're easy to navigate.The digital shelves of the iTunes Store are stocked with thousands of audiobooks, including such exclusives as the entire Harry Potter series. Download what you want, sync to your iPod Nano and catch up on your reading the audio way. Just like podcasts, you can browse audiobooks in their own menu on your iPod Nano. And your Nano automatically recognizes where you left off reading and bookmarks your place, so it is easy to dive back into the story. You can even change the reading speed to suit you--this is a perfect feature for learning a new language.Photos, Settings, and ExtrasIf you can fill your iPod Nano with photos, then you've got a ton of images at your disposal. iPod Nano holds thousands of photos that you can sync from your Mac or Windows PC via iTunes. Use the Click Wheel to scroll through photo thumbnails the same way you scroll through song titles. To see a photo full-screen, just click the center button. You can even view photo slideshows, complete with music. Just select Slideshow Settings, choose the time between slides, transition effect, music, and then start the show.This next-generation iPod Nano lets you customize menus, check capacity, change your language, change how your Nano sounds, and more, all from the easy-to-use Setting menu. Click About to see how many songs are on your iPod Nano and how much room you have left. Click Main Menu to select what items appear in your Main Menu, tweak the built-in equalizer, or set a maximum volume limit--everything you need to personalize your Nano, from backlight timer to audiobook speed, appears in Settings.And, lastly, your iPod Nano is loaded with extras. Everything from calendars, contacts, and the World Clock appear in the Extras menu, along with a few more handy items. Take the Screen Lock, for example. Spin the Click Wheel to choose a four-digit combination and protect your iPod Nano from prying eyes. If you forget your combo, you can reset it at your next sync. Or use the built-in stopwatch to log your best times at the gym. And when it's finally time to play, iPod Nano features four fun games: Music Quiz, Solitaire, Brick, and Parachute.What's in the BoxApple 2 GB iPod Nano, earphones, USB 2.0 cable, dock adapter, and quick start guide.", "title": "Apple iPod nano 2 GB Silver (2nd Generation)  (Discontinued by Manufacturer)", "price": 162.95, "imUrl": "http://ecx.images-amazon.com/images/I/31G01AY9NXL._SY300_.jpg", "related": {"also_bought": ["B001JM55CQ", "B000BNJWQE", "B000GAAP8Q", "B004N78XSW", "B000KI8FZY", "B0030LSFL2", "B001FA1NEG", "B000JO7PIM", "B000VLVG42", "B002P4YXI4", "B000IHGJ50", "B002L6HDQA", "B004LHOCC0", "B00E9IUNQ0", "B002RSU80U", "B002L6HEA0", "B001FA1ND2", "B0012JCYPC", "B001FA1O0O"], "buy_after_viewing": ["B000JO7PIM", "B000GAAP8Q", "B002MAPT7U", "B001FA1NCI"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}