{"asin": "B0029LDDPM", "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]], "description": "The navigator with the photographic memory--Oregon 550t combines rugged outdoor touchscreen navigation with a 3.2 megapixel digital camera. Add preloaded U.S. topo maps, along with high-sensitivity GPS, barometric altimeter, 3-axis electronic compass and microSD card slot. The result? A multipurpose device that will make your biggest adventures even more memorable.Oregon 550t combines rugged outdoor touchscreen navigation with a 3.2 megapixel digital camera.Click to enlarge.3.2 megapixel autofocus digital camera with 4x digital zoom.Click to enlarge.Preloaded with U.S. topographic data for the continental U.S. and a worldwide basemap with shaded relief.Click to enlarge.3-inch diagonal, sunlight-readable, color touchscreen display.Click to enlarge.Take Pictures and Save LocationsCapture locations and memories with Oregon 550t's 3.2 megapixel autofocus digital camera with 4x digital zoom. Each photo is automatically geotagged with the location of where it was taken, allowing you to navigate back to that exact spot in the future. Snap and view pictures in landscape or portrait orientation. With 850 MB of internal memory, you'll never miss a photo opportunity. To store online, simply connect Oregon 550 via USB and log into my.Garmin.com to upload and store your photos at Picasa, a popular online photo sharing community for friends and families around the world. For more storage, insert a microSD card; you can even view pictures from other devices on microSD with Oregon's picture viewer.Touch and GoOregon 550t makes rugged navigation effortless with a tough, 3-inch diagonal, sunlight-readable, color touchscreen display. The interface is easy to use, so you&Otilde;ll spend more time enjoying the outdoors and less time searching for information. Both durable and waterproof, Oregon 550t is built to withstand the elements. Bumps, dust, dirt, humidity and water are no match for this rugged navigator.Explore the TerrainOregon 550t comes with built-in U.S. topographic data for the continental U.S. and a worldwide basemap with shaded relief--all the tools for serious climbing or hiking. Map detail includes national, state and local parks and forests, along with terrain contours, elevation information, trails, rivers, lakes and points of interest.Get Your BearingsOregon 550t has a built-in 3-axis tilt-compensated electronic compass, which shows your heading even when you&Otilde;re standing still, without holding it level. Its barometric altimeter tracks changes in pressure to pinpoint your precise altitude, and you can even use it to plot barometric pressure over time, which can help you keep an eye on changing weather conditions. And with its high-sensitivity, WAAS-enabled GPS receiver and HotFix satellite prediction, Oregon 550t locates your position quickly and precisely and maintains its GPS location even in heavy cover and deep canyons.Find FunGo paperless with Oregon 550t by quickly downloading information from Geocaching.com for up to 5000 caches, such as location, terrain, difficulty, hints and description. No more manually entering coordinates and paper print outs. Slim and lightweight, Oregon is the perfect companion for all your outdoor pursuits.Share WirelesslyWith Oregon 550t you can share your waypoints, tracks, routes and geocaches wirelessly other Oregon and Colorado users. Now you can send your favorite route to a friend to enjoy or the location of a cache to find. Sharing data is easy. Just touch \"send\" to transfer your information to similar devices.What's in the BoxOregon 550t, AA battery charger, 2 AA NiMH batteries, carabiner clip, USB cable, owner's manual on disk, and quick start manual", "title": "Garmin Oregon 550T 3-Inch Handheld GPS Navigator with 3.2MP Digital Camera (U.S. Topographic Maps)", "price": 444.44, "imUrl": "http://ecx.images-amazon.com/images/I/51CM5FNbdTL._SY300_.jpg", "brand": "Garmin", "related": {"also_bought": ["B005Q0CUUC", "B00EGHH99S", "B001DG206C", "B001ECRAWO", "9985511824", "B00DWKIRUK", "B005C8U032", "B00INXAJ0W", "B00INXARCM", "B002TLD7H6", "B001O5UCWQ", "B001DDG8I6", "B005C8VAV8", "B0012MI7QE", "B002I05VU4", "B00AL2CGOA", "B008RM7CJK", "B001ULDANC", "B00HQD0ITW", "B001IYZPKW", "B00E3Y7MCI", "B002QS9MKI", "B00HQCYAG0", "B001RYK0JE", "B0055NQXB2", "B002ZU4YS2", "B002MIT5ZE", "B0041JLXW0", "B003FXWX54", "B000I2HJ1S", "B0068CLI8C", "B008RM7BG4", "B001AQOHOI", "B00CHEJP6C", "B003IHV6YG", "B00INXAKJC", "B00542NVDW", "B008RM7A5Q", "B003VKZD6C", "B001RYFYYK", "B008RM7BYQ", "B0040PHKJU", "B00D0B7HUM", "B000XDGJQI", "B004HIVFDC", "B009SKY806", "0899976506", "B0027531JI", "B00542NVS2", "B002MIUPOY", "B002KO5XVU", "B0012MLJTQ", "B00664KXGA", "B007D21TB2", "B003I86PJ6", "B00487OAE8", "B0000996BA", "B000SMVQK8", "B006ZGMEXY", "B008RM7BSM", "B0092ZMXBS", "B001E7S5BO", "B001WMFYH4", "B006WGA01K", "B0030BB44C", "B00DPNCMQ4", "B000FEXZGW", "B00C8S8S4W", "B00J0RC5JI", "B005F387NY", "B000H7N26A", "B00AR04OI2", "B0050SNCPC", "B00B1QUF8O", "B005SPCJ74", "B003TZBE94", "B006QF3TW4", "B00152RKK0", "B000W0RQ8C", "B000P6BGYI", "B00D454AWC", "B000FEWA6S", "B00422KZQG", "B003LDKNZ0", "B00GVJDIEY", "B00ENDROMW", "B006H1YTA8", "B008CL24SA", "B00BAZ7LP6", "B00LVDZDXY", "B0025VKUPM", "B00FHRADQ2", "B009QZH7BU", "B002IAL1IK", "B00D2I79FG", "B00E3OL5U8", "B001Q3KLP4"], "bought_together": ["B005Q0CUUC", "B00EGHH99S"], "buy_after_viewing": ["B003IHV6Z0", "B003IHV6YG", "B00542NVDW", "B00AXUXRSE"]}}