{"asin": "B001R4BTLC", "description": "Amazon.com Product Description The Nextar SNAP5 with 5-inch touch-screen display is a space-saving 0.7-inch thick GPS navigation system--with Nextar's advanced magnetic docking station. The SNAP5 comes with built-in stereo speakers and text-to-speech (English) technology and offers maps of the entire US and all of Canada.The Nextar SNAP5 with 5-inch touch-screen display that provides interfacing capability while map is being viewed.Large, clear, colorful images of maps from all 50 states and Canada are shown on the SNAP5s' 4:3 TFT touch-screen display. Maps are provided on one 2GB SD card for easy installation. Text-to-speech technology clearly pronounces road names in English. Software support is provided for English, French, and Spanish, the three most spoken languages in the covered areas. A special automatic night mode offers additional screen lighting for easy-on-the-eye viewing. Voice-guided directions with turn-by-turn voice prompts are clearly audible through built-in stereo speakers.Users will have no trouble locating any number of hotels, shopping centers, gas stations, and restaurants along their routes, as the SNAP5 provides millions of points of interest. If a user misses a turn, a new route is recalculated instantly. Digital map data is supplied by Tele Atlas, a leading global provider of digital maps and dynamic content that power many of the world's most essential navigation and location-based services.The SNAP5 also has the capability to play MP3 files and display JPEG images (a required SD card for these functions is not included). Addresses for favorite destinations can be stored for easy access. Other features include 2D and 3D map-viewing modes, a SD card slot for additional memory, and a built-in antenna. A lightweight, built-in rechargeable Lithium-Ion battery supplies power.Stylish and space-saving 0.7-inch thick GPS navigation system.Adjustable mount for your windshield or dashboard.Key SNAP5 FeaturesTouch-screen display: Provides interfacing capability while map is being viewedBuilt-in speaker: No extra wires or speaker to connect3D building display: Buildings can be shown in 3D to serve as landmarks, helping the driver know exactly when to turnText-to-Speech: Safety feature that allows driver to keep eyes on the road while getting directions; clearly pronounces names of streets encountered during drivePoints of Interest: Name or description of a specific location that user may find useful or interesting; generally indicated by an icon on the mapLithium -Ion Battery: Lightweight, holds charge longer, and does not suffer from memory effect compared to similar batteriesSD card slot: Provides additional memory and is used for MP3 playing or JPEG image viewingDay and Night modes: Night mode offers additional lighting on screen for easier viewingMP3 playing: Allows driver and/or passengers to listen to favorite MP3 files while in vehicleJPEG viewing: View photos and other graphics while in vehicleFavorite address storage: Quick, easy way to find addresses of frequently visited destinationsRoute recalculation: Instantly changes route if driver misses turnBuilt in antenna: Ensures reception of signal without running additional wiresStylus: Allows user to point more accurately than using a finger to small areas on the display screenWhat's in the BoxNextar SNAP5 5-inch GPS Navigation System, AC Adapter, Car Adapter, USB cable, Pouch, Mounting cradle, Dashboard mount disk, Mounting Bracket, 2GB SD cardAbout NextarNextar in the categories it chooses to enter, the products that it develops and in the manner in which it goes to market desires and strives to be nothing short of Bold and New. Bold--the categories, products and retail avenues that are the most salient and relevant of the day. New--utilizing the newest technologies in dynamic, salient, relevant and yet affordable products and placing these products in the highest volume traditional and, as or more importantly, non-traditional consumer electronic retail.", "title": "Nextar SNAP5 Super Slim 5-Inch Portable GPS Navigator", "price": 19.19, "imUrl": "http://ecx.images-amazon.com/images/I/51X0NzBwZlL._SY300_.jpg", "related": {"buy_after_viewing": ["B002OL2MU4", "B0057OCDQS"]}, "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]]}