{"asin": "B0036UUST4", "description": "Capture videos to your handheld devices or submit to YouTube with clicks! With MyGica's EZgrabber2, you can capture all the video clips from your video source devices such as VHS/VCR/DVD/DV camcorder before they disappear by using bundled software. with the \"push to start push to stop\" button will help you to record the selected clips easily which you are watch the movies playing on your video device, when you find clips which you want to capture, just push the button of the EZgrabber2, it will be automatically recorded to hard disk, when the clips go to unwanted record part, just push the button once more, the file will automatically stop and automatically give a name by software. You just repeat pushing the button; you will get all the clips you want. Also you can convert any video files and customize your favorite video files. Then you can edit the captured video files, adding titles, music, and a lot of transitions. As easy as drink a cup of coffee, you can burn all the edited contents into DVD/VCD/SVCD, or send them to your handheld devices, like iPod, PSP and other mobile phones, or just submit them to YouTube, share with others.Features:* Extremely high quality digitizing chipset inside, more clear, rich color and sharp video* Convert recorded files to iPod video, PSP and other mobile phones (not all)* Burn edited files onto DVD, VCD, and SVCD...* Capture video source from VHS, V8, and Hi8...* Submit video files to YouTube* USB device, easy to installSpecifications:* USB 2.0 PnP Interface, USB video/audio transfer (Proviesion)* Automatic NTSC/PAL detection* Capture the Video directly into MPEG 4 / 2 / 1 Format* Capture Video Source from VHS, V8, Hi8, etc.* Support Still Image Capture in JPEG or BMP formatPackage Contents:* EZgrabber2 USB2.0 Capture Device* A/V multi-cable* Installation Manual* Video Capture/Editing Software CD", "title": "Mygica EZgrabber2 USB 2.0 Video Capture Adapter Device", "price": 30.99, "imUrl": "http://ecx.images-amazon.com/images/I/41fQSQeS4vL._SY300_.jpg", "related": {"also_bought": ["B001U8VL9K", "B003L1AI8O", "B00012F6A6", "B0049960BQ", "B000RZUUWG", "B002LRMOPO", "B000X1SE90", "B00603S1OS", "B000M52X62", "B000BLJE8W", "B0036VO2BI", "B002H3BSCM", "B000YM2OIK", "B0044XIQIW", "B000V0DY7U", "B006MPRFJQ", "B000VIA4CA", "B002NZTHEU", "B000P8X65S", "B002R7JPGE", "B002DW0VT8"], "buy_after_viewing": ["B000VM60I8", "B0019SSSMY", "B009A41KLU", "B0029U2YSA"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Cables & Interconnects", "Video Cables", "HDMI Cables"]]}