{"asin": "B000GABCY2", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Mice"]], "description": "Amazon.com Product Description  Be more productive&mdash;wherever you use your laptop. With expectional comfort, great performance and enhanced reliability, the Logitech V450 Laser Cordless Mouse for Notebooks is your perfect notebook companion. The ergonomic design with soft rubber grips provides both superior comfort and hand support in a compact shape. Laser tracking delivers smoother, more responsive cursor control than standard optical mice, and the micro-receiver stores inside the mouse, turning it off to save batteries for transport.Features:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Storable, wireless micro-receiver&nbsp;Plug-and-play USB micro-receiver tucks away neatly&nbsp;inside&nbsp;the mouse for easy transport and shuts your mouse off to save power.&nbsp;Ergonomic comfortSoft&nbsp;rubber grip, finger grooves, and contoured shape offer support and effortless control with either hand.&nbsp;Laser precisionOutperforms optical mice. Laser technology delivers smoother cursor control and precision tracking on virtually any surface.* You'll be more productive--whenever you use your laptop.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Side-to-side scrolling + zoomTilt Wheel Plus Zoom is perfect for viewing digital photos and spreadsheets. Instantly zoom in and out; scroll horizontally or vertically.&nbsp;Unsurpassed battery lifeKeeps on going with up to one year of battery life**, minimizing the hassle of changing batteries&nbsp; Use the &quot;On/Off&quot; button to save even more power. Battery&nbsp;indicator light, visible from&nbsp;the top of the mouse,&nbsp;eliminates surprises.&nbsp;&nbsp;Uninterrupted cordless performance&nbsp;Experience a powerful and reliable signal with 2.4 GHz Digital Cordless. No delays or dropouts even in the busiest wireless environments.System Requirements:IBM or compatible PCWindows 98, 2000, Me, or XPUSB portMacintosh systemMac OSX 10.2.8+USB portPackage Contents:Logitech V450 Laser Cordless Mouse for Notebooks&nbsp;2.4 GHz micro-receiverInstallation guideLogitech SetPoint software CD (for Windows-based PC&nbsp;)2 AA batteries3-year limited warranty&nbsp;", "title": "Logitech V450 Cordless Laser Mouse", "price": 22.95, "imUrl": "http://ecx.images-amazon.com/images/I/41CSC3QAZCL._SY300_.jpg", "brand": "Logitech", "related": {"also_bought": ["B001660084", "B00165XQWW", "B00000JRRD", "B002MMY4WY", "B007B5S52C", "B003NR57BY", "B004SUIM4E", "B002B3YCQM", "B0000365QL"], "bought_together": ["B00000JRRD"], "buy_after_viewing": ["B003NR57BY", "B007T1CTDE", "B001660084", "B005DSPLDA"]}}