{"asin": "B007FELOZO", "categories": [["Electronics", "Portable Audio & Video", "CB & Two-Way Radios", "Two-Way Radios"]], "description": "Weatherproof: With an IP-54 rating, the MT series flaunts its weatherproof ID design making it ideal for protection not only from dust, but from wet weather conditions be it snow or rain splashes. Its emergency alert feature, built-in LED flashlight and NOAA weather alert channels provide a total emergency preparedness communication solution. Talkabout Clear: Boasting a high efficiency class D amplifier, the MT series radio delivers enhanced sound quality by reducing distortion at high volumes. Extra Power: Push-To-Talk Power Boost, when activated, allows you to extend the transmission range by increasing the transmitter power output while saving battery life when no power boost is necessary. Hands-Free Communication: When you are hiking up a steep mountain trail, you really need to keep your hands free to brace the rocky terrain. With iVOX acting like a speakerphone and allowing hands-free communication, you can keep on moving without stopping to answer a call. Easy Charge: Designed to fit every lifestyle, the MT352 allows you the convenience of charging many distinct ways. Use the provided mini-USB charger for portable convenience, great for charging at home or to take along to recharge in a hotel. While on the go, you can use our mini-USB car charger. If you are not on the move, the desktop charger is a good option, or simply use a mini-USB PC cable to charge from your PC when no power outlet is available. If none of these options are available, you can simply drop in standard alkaline batteries and you're ready to start talking. Silent Signals: The VibraCall silent vibrating ringer is especially useful for locations where ringing can be intrusive. This feature is also great when noise from a sporting event would drown out your ring tone. MT352R includes: 2 radios, 2 NiMH rechargeable battery packs, 2 belt clips, 1 Y cable wall adapter with 2 mini-USB connectors, 1 Emergency Preparedness checklist sheet, 1 user guide, 1 accessories sheet.", "title": "Motorola MT352R FRS Weatherproof Two-Way - 35 Mile Radio Pack - Silver", "price": 74.89, "imUrl": "http://ecx.images-amazon.com/images/I/51Asg62nbvL._SY300_.jpg", "brand": "Motorola", "related": {"also_bought": ["B00BG2BCOO", "B00000JD34", "B00942OFVU", "B0092OW2VK", "B00009M6TG", "B00000JCT8", "B00000JCTO", "B009SJTZAU", "B008I64R5W", "B004H0VTM2", "B00COH1NLM", "B00CN4TMOG", "B00BG2BCPI", "B008IYFJEW", "B0092OTWPY", "B004PGM9PO", "B00IKML52C", "B00006JHZ0", "B001CBRTTG", "B001UE6MJ8", "B006QF3TW4", "B0092OIQ9M", "B00CZA396U", "B008CL24SA", "B001RMQ5IG", "B001BCNTHC", "B001DI8DEI", "B0072LAAA0", "B00AWTD7HM", "B00ITI054G", "B005L7BWD6", "B004YWELBE", "B002TT5P1E", "B004T18WJW", "B00D2SQ6W8", "B004H48L3S", "B0094JURGK", "B00LVDZDXY", "B004DT6TEK", "B001J5H92C", "B001VO6GY8", "B005IDQW3S", "B005NGMJLY", "0882663917", "B000WXX0JS", "B0017CV9FK", "1616083905", "B003KTLRUA", "B003DPVERM", "B0086UAF9M", "B000H7N26A", "B0086UBR8K", "B004NBZLJ2", "0061733199", "B007BF50O8", "B00BSG81OM", "B000F285EG", "B001WJ51NY", "B000FEXZGW", "B005UNPM3M", "B000WZCSTO", "B004T194VC", "B00EPLFB9K", "B000G7WRBC", "0452295831", "B00AMPJGMG", "B001QC31G6", "B0026OOS60", "B0068UV4MO", "B000NJ6EZ8", "B001ID4ZY0", "B0010O748Q"], "bought_together": ["B00BG2BCOO", "B00000JD34"], "buy_after_viewing": ["B001UE6MJ8", "B0072LAAA0", "B001WMFYH4", "B004PGM9PO"]}}