{"asin": "B002LLK5CO", "description": "Microsoft MapPoint 2010 gives you the power to visualize business data, communicate insights with instant impact, and integrate maps into the work you do in Microsoft Office. Get trip routing and turn-by-turn directions to easily plan better trips.Use new Map Settings to customize features of your map.Click to enlarge.Detailed driving directions keep you on track. Put in multiple addresses and MapPoint will optimize your route.Click to enlarge.More than 300 pushpin images--includes those from previous versions of MapPoint.Click to enlarge.MapPoint 2010Updated maps--New geographic and demographic dataCustomize map settings--Choose whether cities, highways, local roads and parks show on your mapMore pushpin images--Includes those from previous versions of MapPointGPS ready--Send your route to your GPS device*Data mapping--Use maps to visualize the meaning of your dataCreate territories--Define your own delivery or sales areasProgramming--Build custom solutions and Office add-insProduct FeaturesMapPoint helps you visualize your business data:Create maps using custom Map Settings to display your data with only the details you want to appear. Easily turn labels on or off, change font style or map style.Dramatically improve decision-making by bringing clarity to tabular data.Use information-rich maps to illuminate important data relationships, identify business trends, and illustrate opportunities.Create sales territories and share performance maps to clearly visualize, analyze, and communicate business information.Combine business data with included demographics to target potential customers and focus decisions.MapPoint helps you streamline your travel:Arrive on time.Detailed directions--voice** and text-prompted--make it easy to follow your route.Optimize your trip.Quickly calculate mileage, drive time, and expenses in advance.Navigate with ease.Plan your trip on your PC and then print, or send your route to your GPS device.*MapPoint makes it easy to use maps in combination with your Microsoft Office documents:Seamlessly integrate maps into the work you do in Excel, Word, PowerPoint and Office.Tell a story, visually.Insert maps into Word documents and PowerPoint presentations to illustrate everything from sales performance and customer locations to new business opportunities.Tap into existing data sourcesCreate maps from data stored in current versions of Office Excel, Office Access, Microsoft SQL Server, or other database sources.Extend your business.Take advantage of the extensible MapPoint object model to build custom business solutions such as fleet tracking and business intelligence.* Exporting to GPS must be done via MSN&reg; Direct (subscription required) or via USB. Separate download of free plug-in may be required. Not all GPS devices are supported. Visit www.microsoft.com/mappoint/devices for more information.** GPS device sold separately. GPS functionality requires a GPS device that supports NMEA 2.0 or later and an available USB port.", "price": 299.95, "imUrl": "http://ecx.images-amazon.com/images/I/51izFvEzalL._SY300_.jpg", "related": {"also_viewed": ["B007RFW2BQ", "B004PBI16K", "B007RFW1NA", "B0043SWBUW", "B002DHLVII", "B002LLR87E", "B0017W6EWS", "B000WR2F3G", "B000O8RS5S", "B0036Z0NW6"], "bought_together": ["076451623X"], "buy_after_viewing": ["B007RFW2BQ", "B004PBI16K", "076451623X", "B007RFW1NA"]}, "salesRank": {"Software": 1935}, "categories": [["Electronics", "Computers & Accessories", "Computer Components"], ["Software", "Education & Reference", "Maps & Atlases"]]}