{"asin": "B001CHHVCU", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Cases"]], "description": "The new PowerLink USB Adapter for iPhone is a convenient three-in-one device that most any iPhone or iPod user would find handy. The PowerLink combines a USB memory stick for storing files, a 30-pin cable for syncing your iPhone/iPod, and a charger with a built-in rechargeable battery.Get Extra Power Away from HomeTake PowerLink with you for emergency power for your iPhone or iPod with 30-pin dock connector. It's easy to use: Just connect PowerLink to your iPhone/iPod, and switch on PowerLink's power. PowerLink boasts a 270mAh Lithium-Ion battery that provides 500mA powering current to the iPhone or iPod. That's equal to about 25 minutes of talk time on an iPhone. (Note:The PowerLink does not actually charge the iPhone or iPod; it powers the devices as an external battery pack.)When it's time to recharge, PowerLink's internal battery can be charged from any computer with a USB port or through a USB power adapter. During charging, each LED takes approximately one hour to light up. It takes approximately three hours to fully charge the PowerLink's battery.Use as Flash DriveSee that USB connector? PowerLink works just like any other USB flash drive--simply plug it into any computer's USB port and use it to take your files with you. It provides 2 GB, but it's also available in other capacities.Use as Sync Cable AdapterWhile connected to your device, PowerLink works just like a regular iPhone/iPod data sync cable to transfer files and data through iTunes, or to charge the iPhone/iPod through a computer. A USB extension cable is included for use with a desktop computer.What's in the BoxPowerLink, USB female extension cable, User's Guide", "title": "Macally PowerLink Emergency Battery Pack with 2 GB Pen Drive for iPod and iPhone (Black)", "price": 6.18, "imUrl": "http://ecx.images-amazon.com/images/I/41SqfqSI0iL._SY300_.jpg", "brand": "Macally", "related": {"also_viewed": ["B009A5YP0W", "B00AVTDBGA", "B004HT6TS2", "B005O252GG", "B00GWOG0CK", "B00GYH4IX8", "B0041RSDXE", "B00GUF2A2K", "B0014CA7VU", "B008LYU2K0", "B00GMCLHZM", "B0068RKK18", "B007KFAFZ8", "B00DBX371C", "B00HR78S2Q", "B0041Q38NU", "B004TS1J18", "B004CI906G", "B00CSFCYFY", "B005FYNSZA", "B007JR5368", "B00DYQYJ0E", "B002FU6KF2", "B00DYQYJ3Q", "B004TS1J1S", "B004TS1J1I", "B0073FE1F0", "B00EF1OGOG", "B00FA4Y82W", "B00E98O7GC"], "buy_after_viewing": ["B0013G8PTS", "B002PAQYEE", "B003ZBZ64Q", "B0035R2QS4"]}}