{"asin": "B00002DHEV", "description": "Nintendo first dabbled in video games during the industry's early years of the mid-'70s. Generations of successful gaming console releases through the years led to the much-hyped 1996 launch of Nintendo 64, a system that represented a giant evolutionary leap in video game technology. Within the first three days of launch, hundreds of thousands of gamers hunkered down withMario 64, considered by many to be one of the greatest video games ever created. Even today, the system's excellent design continues to host an ever-expanding library of breakthrough games.Nintendo 64's popularity among younger gamers is no surprise. Well-respected games featuring such long-lived and much-loved personalities as Mario (of arcade classicDonkey Kongfame), Zelda, andBanjo-Kazooieare easy to learn and offer enormous replay value. But times are a' changin' and the system's ever-growing library of titles has expanded into every genre of games imaginable, including games better-suited for older gamers. In fact, some of the most acclaimed--in some cases, groundbreaking--games available on any platform today are packed onto N64's old-school cartridges.Under the system's hood, its appeal to the young certainly didn't produce a less mature gaming machine. On the contrary, the 64-bit system boasts impressive graphics, stereo sound, and numerous accessory enhancements, including a high-resolution pack that boosts graphics to awe-inspiring resolutions.Start your library withGoldeneye 007,Mario 64,Banjo Kazooie,Legend of Zelda: The Ocarina of Time, andStar Wars: Episode One Racer--these titles represent a decent start to any N64 cartridge library.With the recent launch of Sega's Dreamcast system, Nintendo 64 is being left behind as the leader in video game technology. And with newer game systems featuring CD-based games, the system's expensive cartridge format is proving itself an archaic and unconventional storage format. But, at a sub-$100 recommended retail price, innovative accessory enhancements and a great library of games keep the system's rabid fan base satisfied, if not eager for Nintendo's next evolutionary step.--Eric Twelker", "price": 3.99, "imUrl": "http://ecx.images-amazon.com/images/I/511sAEynSEL._SX300_.jpg", "related": {"also_bought": ["B00000F1GM", "B00000DMAX", "B000F9JFXE", "B005GTNBGK", "B000PJHAD6", "B002TK1PX0", "B003UI5GLC", "B00005M8TL", "B005GTND0E", "B005DI7N7W", "B005GTNC8W", "B00003OTI3", "B00000J2W7", "B00002STEZ", "B00000INR2", "B000Y0CHX4", "B007SJMEHI", "B00000ID61", "B00000IFRI", "B00002STH0", "B000QHOHHE", "B00000DMAQ", "B00004U1R1", "B0015OG4G4", "B00856304Y", "B003ZU0PHU", "B000YT1VMS", "B00002STFH", "B00001QES1", "B00004R9IB", "B00000J2OO", "B000021Y2Z", "B002J44BXW", "B000058BCU", "B00000ID60", "B00004SWLT", "B000031KJM", "B00004S9A7", "B00004S9AA", "B002GCK960", "B000038A6U", "B000046Q7Q", "B00004U1QY", "B00000DMB9", "B00000JHPD", "B00B7NLV6Q", "B000JVM256", "B0046CZX78", "B0013KR3QA", "B00001WRJO", "B000046S41", "B00000K2G9", "B00005AW1W", "B00002SUZ5", "B000RJOAP0", "B00004WLMA", "B002TK5I6K", "B001767WT8", "B00002STI2", "B00001P4VO", "B000035Y6D", "B00002STXQ", "B00005AQRH", "B00001OX4T", "B00004U1R3", "B00000K39K", "B002TJZUG4", "B00002970G", "B00000DMAO", "B003DK353S"], "buy_after_viewing": ["B002TK1PX0", "B00000F1GM", "B00000DMAX", "B00000J2W7"]}, "salesRank": {"Video Games": 440}, "categories": [["Toys & Games", "Electronics for Kids"], ["Video Games", "More Systems", "Nintendo 64", "Hardware", "Consoles"]]}