{"asin": "B00A1DJO12", "description": "The Universal Tablet Stand and Smartphone Mount that fits in your pocket!\n\nSmart-MountTM is an ultra-portable ergonomic mounting system designed to increase comfort for all mobile device users. The ultra-portable system allows for quick and secure mounting and releasing of a device with just the pinch of two fingers. It's universal design securely mounts the smallest smartphones up to the largest tablets - guaranteed! Mount your iPhone, iPad, iPod, Kindle, Galaxy, Nexus 7, Nook, and every other iOS, Windows, and Android mobile device - past, present, and future!\n\nThe adhesive pad is a one-time application and not meant to be reapplied/restuck.  The ideal use is to mount the ratcheting clip onto a plastic or TPU case that fits your specific device.  It can be mounted directly to your device but that is not recommended.\n\nFor adhesive removal: Use dental floss, fishing line, or similar strength string.  Hold the string with two hands and floss/slice with a back and forth motion.  This will cut through the adhesive then you can easily remove the remaining with your finger. \n\nThe ratcheting clip can be reused however a new adhesive pad would need to be applied.", "title": "Clip-Case Universal Smartphone Mount and Ergonomic Tablet Stand (Tripod Mount Kit) for iPhone iPad iPod Galaxy Droid Kindle Nook", "price": 14.99, "imUrl": "http://ecx.images-amazon.com/images/I/41TuVPTXBnL._SX300_.jpg", "related": {"also_viewed": ["B008VI7ORA", "B008UH8SRM", "B0042J6VUS", "B005LY553M", "B00CU7H6NK", "B00A9AKY02", "B00CXGF84M", "B00B149NIE", "B00CW9CDOS", "B00CTUOV7C", "B007EICZTU", "B00C7J5ZC0", "B005I5DJU0", "B009GHYLKS", "B00HD1PCHU", "B00CMXF6NE", "B007NFJN0I", "B007L7R5K8", "B00CPK46TY", "B007NFI656", "B00J2GFQLQ", "B00K0H995U", "B00FS5L9D4", "B00B0GSADW", "B009GHYMB6", "B00CXH4ENM", "B005LY980S", "B00HFRYAGQ", "B008BOSOEG", "B00CCJ4U0S", "B00HX77HWW", "B00DIJD7XM", "B005LY9FVU", "B005LY5CWG", "B00HF0FOU4", "B0056C4WN8", "B00BZX152I", "B00DRG4YB0", "B004ZGN6MY", "B00CR74FLO", "B0056C4VRK", "B009GY5XD0", "B00B9KGYBE", "B004OAFO0I", "B000V7AF8E", "B00AG6M8JY", "B005NG8SZK", "B004ZGLM5W", "B00D856NOG", "B000EVSLRO", "B000EFIJTA", "B005KP473Q"], "bought_together": ["B007EICZTU"], "buy_after_viewing": ["B00C7J5ZC0", "B007NFJN0I", "B008VI7ORA", "B007NFI656"]}, "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Stands"]]}