{"asin": "B0000CE1UO", "description": "Shure's E2c in-ear headphones are tiny, lightweight, and designed to sonically outperform most ear-bud-style headphones. The E2c's unique, relatively affordable design comes from Shure's years of collaborating with professional musicians. With high-energy drivers in distinctive enclosures, the E2c produces high-quality sound with excellent isolation from background noise.The E2c's speakers are constructed with studio-grade components, producing exceptional audio clarity. Their in-ear design, using supplied flex sleeves, naturally blocks background noise. This permits lower listening volumes in loud environments--critical in safeguarding your hearing during performance or other activities. No batteries or extra equipment are needed for sound isolation.Because every ear is different, E2c earphones come with 3 pairs (small, medium, large) of flex sleeves and 3 pairs (small, medium, large) ultra-soft flex sleeves to ensure a personalized fit. These disposable foam sleeves gently compress to fit in the ear canal. Once in the ear, the foam expands to form a tight seal. Once tightly sealed, the sleeves hold the earphones firmly in place.The E2c's cables pass behind the ear--out of sight and out of the way for comfort and discretion. Weighing only 1 ounce, the E2c is lightweight and comfortable enough for any portable listening application. The set comes with a soft, stylish, compact, and zippered carrying case, which allows for an easy, tangle-free way to store your earphones.What's in the BoxEarphones, 2 triple-flange sleeves, 3 pairs (small, medium, large) of flex sleeves, and 3 pairs (small, medium, large) ultra-soft flex sleeves (kit 90XC1371, with cleaning tool), a soft carry case (80B8232), a user's manual, and warranty information.", "title": "Shure E2 Sound Isolating Earphones", "price": 299.99, "imUrl": "http://ecx.images-amazon.com/images/I/31Q3E9aVvQL.jpg", "related": {"also_viewed": ["B004PNZFZ8", "B001NH0V1M", "B001DX9EE6", "B000E5GKW8", "B00426DND4", "B003NSBKSM", "B0001NNLHK", "B000O8ENQK", "B00EWOK09G", "B001LEH7LE", "B000VHUE0S", "B003NVMDYY", "B0013JH30M", "B000UF0BWM", "B0007XGOTG", "B0013JT3XC", "B003NSBKT6", "B0050L5VO4", "B0000CE1VP", "B0019RBJOE", "B009ZNFEEU", "B003NSBKSW", "B00DIUGW6A", "B00FYZZ4PW", "B0043241X8", "B000NDHIKY", "B003NVM89Y", "B0015PN3W6", "B005019Y24", "B00EXN4GK0", "B000XPG2QI", "B0024N8GAW", "B00E8QI4AK", "B00FYZSTVS", "B00029U0XQ", "B001DCBBHK", "B00EANUQ4S", "B003IHUHGE", "B00530ZHW8", "B00A16BT4E", "B004CXBJ6A", "B0031RG33C", "B001V9LPT4", "B0058XPFJU", "B007TCXGVC", "B001TDKMLE", "B005N8W27I", "B005Y7TTRE", "B001MBLBXQ", "B002QL3CX8", "B000TV1O3M", "B0015PN3X0", "B000NDLJNG", "B002DP1FTU", "B000WAHFBK", "B00275F2GS", "B000NIOVWC", "B00FKXZE5I"], "buy_after_viewing": ["B004PNZFZ8", "B001NH0V1M", "B001LEH7LE", "B001DX9EE6"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]]}