{"asin": "B001HBH1B2", "description": "Buttkicker Adds Extra Kick to Your Home TheaterStandard 5.1 home theater was  revolutionary in  its day. But as moviemakers, game designers and special effects artists have  pushed  the envelope standard home theater has struggled to keep up. Not any  more. By adding a ButtKicker to  your existing home theater, you'll feel the  action just as the director intended. Your new ButtKicker  wireless kit sends  bass &mdash; accurately, powerfully, musically &mdash; directly into your couch, chair or  seat.  The result is a connection to the action that standard 5.1 home theater can't touch.Power That's Wireless and Easy to Set UpThe ButtKicker wireless kit sends  bass &mdash;  accurately, powerfully, musically &mdash; directly into your couch, chair or  seat.The Amplifier  puts out 300 watts at 4 ohms and features a USB style plug-in  connector to  accept and power the RF Receiver.Turn down the volume and crank-up the feeling by turning your home theater into a  ButtKicker-powered home theater.It&rsquo;s WirelessThe ButtKicker  Kit  features an easy to use wireless RF Transmitter and Receiver so that you can  send the audio signal  from your A/V processor or TV to the ButtKicker amplifier  and ButtKicker Advance unit.&nbsp; Installation  is  a breeze and all the cables and wires you need are included.Remote ControlThis convenient Remote  Control (IR) allows you to adjust the intensity of the ButtKicker  system from  the comfort of your Couch or Chair. The Remote Control also features three  preset EQ  settings to optimize the performance of the ButtKicker system for  movies, music and gaming.All New ButtKicker AdvanceThe ButtKicker Advance is a  powerful and  accurate low frequency audio transducer that is built with  patented technology and is powerful enough to  shake an entire couch.Easy &amp; Versatile Mounting OptionsThe  ButtKicker Advance can be used with the Chair / Couch Mounting Bracket so  that it can be easily slid  under the one leg of your couch.The ButtKicker Advance  features a universal mounting  plate enabling the unit to be attached to both  vertical and horizontal surfaces and used on all types of  furniture and  seating. You can also mount the ButtKicker Advance inside the couch and out of   sight.Mounting Plate with Rubber IsolatorsSimply attach the   ButtKicker Advance to the &ldquo;Chair / Couch Mounting Plate&rdquo; using the included  hardware (even the wrench)  and place it under one leg of your furniture.&nbsp; Five additional rubber isolators are included  to be place  under the other legs of your furniture to maximize the  effectiveness of the ButtKicker Advance and to  reduce any vibration from being  transmitted throughout the rest of your home or apartment.All New ButtKicker Power AmplifierThe totally new BKA300-4 amplifier features  BASH technology that is powerful,  reliable and wireless.&nbsp; The Amplifier  puts out 300 watts at 4 ohms  and features a USB style plug-in connector to  accept and power the RF Receiver.&nbsp; &ldquo;Line  in / out&rdquo;  connectors allow multiple units to be hard wired together and the &ldquo;IR  in / out&rdquo; connectors allow  multiple units to be used wirelessly and controlled  by a single Remote Control. The optional base stand  allows for vertical  mounting and it ideal for placing the amplifier out of sight behind your   furniture.", "title": "ButtKicker BKA300 Wireless Home Theater Kit with ButtKicker Advance and Power Amplifier", "price": 599.99, "imUrl": "http://ecx.images-amazon.com/images/I/51Zk6ubMmOL._SY300_.jpg", "related": {"also_bought": ["B00A4V24M2", "B0002GY7QA", "B0006FK42I", "B006U3O566", "B001NT9TK4", "B00CP4IKHE", "B005PPOBQE", "B00DI5AXNI", "B00ENFVS5Y", "B009LRR5AQ", "B00BB9OWN0", "B003FVX9FO", "B00224ZDFY"], "buy_after_viewing": ["B0006FK42S", "B009ZEAWVO", "B000AOTLP6", "B00A4V24M2"]}, "categories": [["Electronics", "Television & Video", "AV Receivers & Amplifiers"]]}