{"asin": "B001V5J7OI", "description": "From the ManufacturerLG LH40(August 29, 2009)Think there&rsquo;s no such thing as an affordable 1080p TV with great features and technology?&nbsp; You&rsquo;ll think again when you take a look at the LH30.&nbsp; It delivers a stunning picture in Full HD 1080p and LG&rsquo;s innovative Core Technologies deliver an enhanced audio and video experience.&nbsp; With the LH30, affordability doesn&rsquo;t mean compromise. It means getting a great HDTV&mdash;period. See for yourself.Innovative TechnologiesDouble the DetailMake all your favorite sports, TV shows, movies, and video games more realistic.&nbsp; Get nearly double the pixel resolution of standard HD with Full HD 1080p Resolution. (Learn more)Like Night and DayIt&rsquo;s easy for details to get lost in the shadows.&nbsp; 50,000:1 Contrast Ratio allows for deeper blacks and greater picture detail, especially in darker scenes. (Learn more)Core TechnologiesFind the Perfect PictureGetting your picture looking great is easier than ever with Picture Wizard.&nbsp; Enables easy self-calibration with your remote by providing on-screen reference points for key picture quality elements. (Learn more)Audio Should be Heard, Not SeenThe slim-silhouette Invisible Speaker Systemdelivers a look and audio that are equal parts clean and polished. (Learn more)Hear Every WhisperGet audio the way it was meant to be heard.&nbsp; Clear Voice II enhances and amplifies the frequency range of the human voice to help keep dialogue audible when background noise swells. (Learn more)Customized EnjoymentSports, cinema and video games can all be heard and seen as they were meant to be with AV Mode II. (Learn more)Other FeaturesWatch Like A ProIt's ISFccc Ready for professional calibration.&nbsp; A more personalized viewing experience awaits, if you're so inclined. (Learn more)Smart EnergyConserve money and energy.&nbsp; With an Energy Star 3.0 rating, you can be green and save green. (Learn more)Bring Theater to the CouchDon't feel like making it out to the multiplex? 24P Real Cinema gives you a movie-theater-experience right in your own home. (Learn more)Connect with Crystal Clear ColorHook up your HD devices and get the Full HD experience.&nbsp; 3 HDMI V.1.3. Deep Color inputsgive you the rich hues and HD picture you want. (Learn more)Versatile TechnologyLCD televisions offer a greater variety of sizes, are generally more energy efficient than Plasma and work wonders for video games and computer graphics. (Learn more)Learn MoreFull HD 1080p ResolutionEnjoy enhanced picture quality over standard HDTV with almost double the pixel resolution.&nbsp; See sharper details like never before.&nbsp; Just imagine a Blu-ray disc or video game seen on your new LG Full HD 1080p TV.50,000:1 Contrast RatioGreat picture needs a great contrast ratio, which is defined as the ratio between the bright whites and dark blacks being displayed.&nbsp; With the superior 50,000:1 Contrast Ratio, you will experience deeper blacks and greater picture clarity, especially in shadowy scenes.Picture WizardGet easy self-calibration with on-screen reference points for key picture quality elements such as black level, color, tint, sharpness, and backlight levels.&nbsp; Take the guesswork out of picture adjustments with this simple-to-use feature.&nbsp; It's not actually magic, but it will sure seem that way.Invisible Speaker SystemYou won&rsquo;t believe what you&rsquo;re hearing.&nbsp; Fine-tuned by renowned audio expert Mr. Mark Levinson, LG TVs utilize a unique, hidden speaker system that delivers a clean, polished look with a wider sound field.&nbsp; Where some sound systems and speakers only project their best audio towards the center of a room, the Invisible Speaker System projects great sound throughout.Clear Voice IIAutomatically enhances and amplifies the sound of the human voice frequency range to help keep dialogue audible when background noise swells.&nbsp; Can also be personalized with a new 12-step adjustment level&mdash;putting you in control.AV Mode IIQuickly and easily select from one of three AV modes for \"Cinema,\" \"Sports,\" or \"Games\" to enjoy optimized HDTV picture and audio quality easily set with a convenient button on the remote control.ISFccc ReadyLG&rsquo;s ISFccc Ready HDTVs contain the detailed standards necessary for professional calibration of brightness, contrast, tint, sharpness, color levels, and much more to meet local lighting conditions for both day and nighttime viewing.&nbsp; Settings are added to preset modes for easy access from your LG remote.Contemporary DesignThe perfect hint of transparency is added to the glossy black frame to add elegance to any room in the houseSmart Energy SavingIn addition to adhering to the new Energy Star 3.0 guidelines, LG HDTVs have energy-saving options like the ability to choose settings for different types of programming. Now you can save the world from the comfort of your couch.24P Real CinemaStay in for the theater.&nbsp; Enjoy a true cinema-like experience in your own home with movies the way they are meant to be seen. LG&rsquo;s Real Cinema technology precisely displays 24p source frames on your screen, the same as on a movie screen.&nbsp; If you love movies, you&rsquo;ll love Real Cinema.HDMI V.1.3 with Deep ColorMake installation of any enabled device a snap.&nbsp; Get 10.2Gbps of bandwidth for deeper colors and more to take advantage of the best Full HD experience.&nbsp; HDMI V.1.3 connectivity lets you prepare yourself for tomorrow&rsquo;s technology today.Which Size HDTV is Right for My Room?With standard-definition TVs, the rule used to be that viewers would feel comfortable watching a set from a distance of 3 to 6 times the screen size in inches. With HDTV, the resolution is so much better that you can sit closer to a larger TV without noticing the pixels.&nbsp; So with HDTVs, the rule tends to be you can sit anywhere from 1.5 to 3 times the screen size (in inches) for the best experience.&nbsp; If you know the size of the room you have already, where you want to sit, and where your new HDTV should go once you get it, you can figure out the size HDTV you should get.Minimum size = Viewing distance/3Maximum size=Viewing distance/1.5Go back to list of all featuresWhy LCD?LCD displays deliver increasingly higher contrast ratios along with bright, crystal-clear images that look great in a variety of lighting conditions.&nbsp; They're available in sizes that fit any space, at prices that meet any budget.&nbsp; Many LCD HDTVs also have new features that can significantly reduce power consumption.&nbsp; So whether you enjoy movies, sports or video games, there's an LCD HDTV just right for you.There's an LG LCD for everyoneLH85 Series (47-inch47LH85or 55-inch55LH85)*If you want an LCD HDTV that goes beautifully almost anywhere in the house, without any wires or clutter, LH85 is for you.&nbsp; Wireless, uncompressed Full HD 1080p transmission allows you the freedom to place your HDTV almost anywhere.LH55 Series (37-inch, 42-inch, 47-inch, or 55-inch class sizes*)Sports lovers, gaming fanatics, and thrill junkies now have their perfect TV.&nbsp; TruMotion 240Hz virtually eliminates motion blur in fast-paced action for a crystal clear picture.&nbsp; Bring the action closer to real life and enjoy it like it was meant to be seen.LH50 Series (42-inch42LH50or 47-inch47LH50)*Ever imagine that you would be able to access instant entertainment from the Internet that streams directly to your HDTV&mdash;without ever using a computer? You can.&nbsp; LH50's NetCast Entertainment Access** makes tapping into Internet entertainment content easy, fast and enjoyable.LH40 Series (32-inch32LH40, 37-inch37LH40, 42-inch42LH40, 47-inch47LH40, or 55-inch55LH40)*A television built for almost anyone's interests or needs.&nbsp; Full HD 1080p, robust features and Energy Star rating make this an all-around great HDTV.LH30 Series (32-inch32LH30, 37-inch37LH30, 42-inch42LH30, or 47-inch47LH30)*Superb 1080p HDTV resolution can be available on almost any budget when you consider the LH30.&nbsp; Stylish, economical Full HD that offers multiple features and a rich experience.LH20 Series (42-inch, 37-inch, 32-inch, 26-inch, 22-inch, or 19-inch class sizes*)A feature-rich HD experience that comes in sizes that fit almost any room in the house and prices that fit almost any budget.&nbsp; It&rsquo;s a great way to get into HD.LU55 Series (19-inch, 22-inch, or 26-inch class sizes*)Big entertainment can come in small packages.&nbsp; A stylish, Full HD 1080p choice for smaller spaces like the kitchen or kids' rooms.*actual diagonal measurement**Internet connection required and sold separatelyFind the Right TV for YouLH85 Series(55-inch, 47-inch)", "title": "LG 32LH30 32-Inch 1080p LCD HDTV, Gloss Black (2009 Model)", "price": 249.0, "imUrl": "http://ecx.images-amazon.com/images/I/41cvfIdj6HL._SX300_.jpg", "related": {"also_viewed": ["B0074WVSL2", "B004VRJ3EW", "B0037KLELE", "B006ZH0J30", "B00BB0ZTM2", "B00BB0ZTMM", "B00JG3VJ9I", "B004EBUZPQ", "B0071O4ETQ", "B0078LSTWU", "B00F9YYOR2", "B00BCGRXD8", "B00I0S72JQ", "B004OBZ1W8", "B0074FGNJ6", "B00BB0ZTJA", "B00723QKVQ", "B00BCGRX9M", "B00EGLQWP6", "B0071O4EZK", "B00JPJFV42", "B00BB0ZTLI", "B0055QYJM4", "B007PXV310", "B005RQMP5K", "B004VRJ3KQ", "B001VKYAKE", "B00I0S70C0", "B00J58HU6K", "B00I0S70GQ", "B00BB0ZTO0", "B00IGXEAQI", "B00BCGRXI8", "B001VKYAL8", "B008HYQ7ZI"], "buy_after_viewing": ["B00BB0ZTM2", "B00BB0ZTM2", "B00BB0ZTMM", "B00BB0ZTMM", "B0078LSTWU", "B0071O4ETQ"]}, "categories": [["Electronics", "Television & Video", "Televisions", "LCD TVs"]]}