{"asin": "B001TSCF96", "related": {"also_bought": ["B0009PUQ8M", "B0035RQLIA", "B002HU086C", "B000EH0NLK", "B006JH1NB8", "B00CGQE7GE", "B006JH1KSE", "B005JSYEZ0", "B000HBGSMQ", "B00LM57S3E", "B00CGQE8UE", "B000HBIL9O", "B000HJ7CLY", "B008G3Z8U0", "B00LW10470", "B00BZ4PPD2", "B00005OU9D", "B0068REHQC", "B00E09BERU", "B000E24HKS", "B0018S4XIS", "B00495THJW", "B00363WZY2", "B00168XMD2", "B00GVJDI8A", "B000O71L6Q", "B00DVA5MXQ", "B0002Z3NPC", "B00CGQXFUS", "B00363PRK6", "B005VMG5S8", "B00F4E7N1G", "B000LC84PK", "B00GVKAKZ8", "B0009PUQ50", "B00IO2DQOS", "B00FF3AK52", "B0010YZ4HE", "B0055QFUO0", "B0000B15HP", "B000HBMFRS", "B001LF3FR8", "B000OC0AWW", "B00F3M5D2K", "B00CHHU2FM", "B00GVJM0A2", "B0068BFIU2", "B0053R2MEW", "B0039PV1QK", "B000HBGSP8", "B00IHX26X6", "B00KDWOGI2", "B00339C3RI", "B000M7RRU2", "B00L9F78LE", "B00DFZYZFI", "B000P9F1EQ", "B00CHHMWGO", "B002IVAL1C", "B000FIAPZW", "B001TSCDBQ", "B00LW10E1G", "B009B1L3CS", "B000A6V8FU", "B00363X1IG", "B004I7MUF4", "B007HI23PI", "B00CGQE3JU", "B009UC7KCU", "B00168YEQ6", "B007ZV6TYI", "B00JXNRLMU", "B00C37PGK2", "B00AU6AVLW", "B0033990PG", "B0009PUR5E", "B00CHHQAMG", "B00GPEKBPE", "B004E4GBFG", "B0053WM5G2", "B000P9IRKQ", "B00CGQED9A", "B0035RQLIU", "B00GVL5EI0", "B00CN0FNUC", "B0053JX5SW", "B00168XMB4", "B009UC76VA", "B004D3A064", "B004Q4K04M", "B00DII7CTI", "B001Y8PT5I", "B007I7FHJW", "B00CPLK09S", "B000W7BHJY", "B000HBILB2", "B004M0YY0G", "B000P9D0GC", "B000YU3MME", "B0009QFS5W"], "also_viewed": ["B000W7BHJY", "B003QUT9OE", "B001TS6WWC", "B002PB2HPS", "B003R7PU6W", "B004E4AW1K", "B004E4ERIY", "B00HZ4KI4C", "B00C37OFWW", "B00EHKP1AI", "B002PAWK7O", "B005DS5XIS", "B002PB0DZO", "B00BZ4PPD2", "B00C37OWQG", "B00C37PINW", "B00EHKOV86", "B00EHKOU9Q", "B006GJ8Q7S", "B00C37PGK2", "B00BZ4PYLK", "B00EHKOZFU", "B003ASVBDY", "B007OJW7QU", "B004TMODZS", "B001O5L2ES", "B00F5X1XRQ", "B00C37NS8E", "B00BQ43A60", "B00BA06BRU", "B00E0BYK8S", "B00F68J4HG", "B00CGNDOFM", "B004THETNE", "B00BZ4PLVS", "B00DGSWHNQ", "B00A8E2M40", "B00I558X10", "B00EHKOYH4", "B003R7PU30", "B002PB0DVS", "B002PAT60S", "B00D0DKRAW", "B005T442LA", "B00DVZFK9M", "B0009PUQ8M", "B00BQ3SZ7U", "B0052QMZXC", "B00A8E2IRQ", "B00EULC1WK", "B00BPZCIL8", "B00KABTBAO", "B00EMKD3GM", "B00CS7HOZM", "B005T40KUW", "B008KRNTSU", "B00F20HCKE", "B0064XF6UQ", "B003O5V7FK"], "bought_together": ["B0009PUQ8M", "B002HU086C"]}, "title": "Coleman Montana 8 Tent", "price": 149.56, "salesRank": {"Sports &amp; Outdoors": 194}, "imUrl": "http://ecx.images-amazon.com/images/I/31vEUb6M52L._SY300_.jpg", "brand": "Coleman", "categories": [["Sports & Outdoors", "Outdoor Gear", "Camping & Hiking", "Tents", "Family Camping Tents"]], "description": "A hinged door provides easy entry and exit, and a touch of at-home convenience.Ideal for outdoorsy families and extended camping trips, the Coleman Montana 8 Tent offers a full feature set for a fun family camping experience. It sleeps up to eight comfortably, thanks to a generous 16-by-seven-foot (W x D) layout and spacious center height of six feet, two inches.An innovative hinged door makes for easy in-and-out, and a vented Cool-Air Port and privacy vent window help improve airflow and keep things fresh. A convenient electrical-access port lets you run a cord from your device in the tent to a power supply outside, and an interior gear pocket keeps things organized.The tent's modified dome structure includes a covered front porch and wings for plenty of outdoor living space. Setup is fast and simple, thanks to shock-corded poles, continuous pole sleeves, an exclusive pin-and-ring design, and InstaClip attachments. Stake and pole bags, as well as a convenient storage and carry bag with instructions sewn in, are also included.Coleman's WeatherTec SystemThis proprietary series of interworking features keeps the weather where it belongs&#xFFFD;outside the tent&#xFFFD;at all times.Leak-free Seams:In addition to fully-taped rainfly seams, the rainfly covers doors and windows, and incorporates easy-to-use Velcro frame attachmentsWeather-resistant Fabric:Coated polyester fabric combined with anti-wicking thread, webbing, and zippers are designed to keep you dryProtected Seams:Inverted floor seams dramatically increase weather resistance by hiding needle holes inside the tent, away from the elementsWaterproof Floors:Welding technology strengthens the tent floor and eliminates needle holesZipper Protection:Zipper cuff adds protection from the elements to the doorWind Strong Frame:Engineered to be a stronger, more wind-responsive frame by using redesigned poles and guy-out triangles to anchor tents and increase performanceSpecifications75-denier polyester taffeta fly68-denier polyester mesh inner tent1,000-denier polyethylene floor11-millimeter fiberglass polesThe Coleman Limited WarrantyColeman has been in business for more than 100 years, and continues to produce high-quality, affordable tents, lanterns, table-top stoves, and more. All Coleman products have a warranty against defects in material and workmanship, and the Montana 8 Tent includes a limited one-year manufacturer's warranty.About Coleman Outdoor ProductsMore than 100 years ago, an entrepreneurial young man named W.C. Coleman had an idea for manufacturing better lanterns in Wichita, Kansas. A century later, Coleman's current catalog features a wide-ranging array of products that make spending time outside a pleasure. The company crafts coolers that keep food and drinks cold for days, airbeds that are comfortable and won't deflate during the night, a complete line of bright and long-lasting LED lights, powerful portable grills that cook with an authentic open-grill flame, and more."}