{"asin": "B000OH63MI", "description": "Amazon.com Product Description With a gorgeous widescreen display, the Garmin n&uuml;vi 650 GPS Personal Travel Assistant is your answer to the call of adventure. A sleek navigator and a keen travel assistant, the n&uuml;vi 650 is preloaded with highly detailed City Navigator NT road maps for the entire United States, Canada, and Puerto Rico. This map database features nearly six million points of interest (POIs), including hotels, restaurants, gas stations, ATMs, and attractions, and the data is provided by NAVTEQ, a world leader in premium-quality mapping. Step up to then&uuml;vi 660if you want to take advantage of Bluetooth connectivity, an integrated traffic receiver, and an FM transmitter.The n&uuml;vi 650 features a colorful widescreen and is preloaded with highly detailed City Navigator NT road maps.The device includes many entertainment and travel tools.A 4.3-inch display with a touch screen interface makes it easy to select destinations, play MP3s, and more.This preloaded navigator brings all this fantastic map data to your fingertips with a super-bright, 4.3-inch widescreen display for improved map viewing, day or night. Use the touch screen interface to select destinations, look up POIs, and play your favorite MP3s and audio books.The device comes ready to go with automatic routing, 3D or 2D map perspective viewing, and turn-by-turn voice directions that speak street names. It also supports configurable vehicle icons. These fun, customized car-shaped icons come in a variety of colors to add a personal touch to your vehicle's position on the map. With this GPS system on board you'll be prepared to steer clear of traffic with an optional FM TMC traffic receiver. If you choose this add-on feature, The n&uuml;vi 650 will receive alerts about traffic tie-ups and road construction that might lie ahead on your route.The n&uuml;vi 650 includes many \"must-have\" entertainment and travel tools, including digital music and audio book playback, a JPEG picture viewer, currency converters, and more. All these great features make the n&uuml;vi 650 a complete Personal Travel Assistant.Note:Optional software for language translation, detailed travel guides, and savings programs allow you to customize your n&uuml;vi to fit your travel needs.What's in the Boxn&uuml;vi 650 GPS navigation system, preloaded City Navigator North America NT data, vehicle suction cup mount, vehicle power cable, dashboard disk, USB cable, and quick reference guide.Which n&uuml;vi is Best for You?Note: All n&uuml;vis come with detailed NAVTEQ maps containing more than 6 million pre-loaded point of interest locations.", "title": "Garmin n&uuml;vi 650 4.3-Inch Portable GPS Navigator", "price": 209.99, "imUrl": "http://ecx.images-amazon.com/images/I/51LTEeQ1NiL._SY300_.jpg", "related": {"also_viewed": ["B0015F1L7A", "B001ELJ9P6", "B00BIZ0EY8", "B00C9W1LT6", "B0011ULQNI", "B001ELJ9QK", "B00HK6CPVY", "B0057ODOCA", "B0057ODG6Y", "B0066IUPS2", "B003WNOOFE", "B0015EWMX8", "B00GRS8NYO", "B000H866BM", "B000PCBVA6", "B007JJVYEQ", "B000W6EUOE", "B000NVZE5M", "B0057OCDQS", "B002M78EA2", "B00AXZY42W", "B00AY7NSTY", "B0007LJHVA", "B00AXX0JNW", "B0021L9C0A", "B00DW14I66", "B004W1GQ92", "B0057OCS9A", "B00HLYAI4Q", "B001UO0RKS", "B003ZX8AZQ", "B003EG0200", "B001S2RDGS", "B001FL3XW0", "B001LK6XHM"], "buy_after_viewing": ["B0057ODG6Y", "B0057OCDQS", "B00AXZWG8Q", "B00AXZY42W"]}, "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]]}