{"asin": "B002FU5QLQ", "related": {"also_bought": ["B000SE6IV8", "B000I23TTE", "B00IKMJWY0", "B003CP0OT2", "B006JH8T3S", "B003NR57BY", "B003VANO7C", "B004O9R1ZK", "B00EZ9XKCM", "B00CYX54C0", "B00847TYYO", "B003VAHYNC", "B00IKMJ9B6", "B005BZNDOO", "B0000BZNTE", "B002GHBUTK", "B00EMB4L0I", "B008ZGKWQI", "B0043T7FXE", "B00C28L138", "B00DR8LB4Q", "B000IF4788", "B005BZNDS0", "B00134BZP6", "B0036E8V08", "B002BH3Z8E", "B004MF11MU", "B00006RVPW", "B00H09BOXQ", "B0012YLTR6", "B008I646WG", "B004E2RCWE", "B004YW7WCY", "B0000BVYT3", "B00A9S3OOC", "B009K916ZK", "B000R9AAJA", "B005H3I38Q", "B0028N6YH0", "B0033Z2BAQ", "B00AWRTXVS", "B00BP5KOPA", "B005M1IFD6", "B000HRYV38", "B00E3W1726", "B004OA6VUA", "B004WO8HQ4", "B00B2HH7G0", "B007NJ0S1W", "B003NREDC8", "B000JE9LD4", "B003X7TRWE", "B000UD3LPI", "B000UD4LIY", "B009Q88W0W", "B003L1ZYYM", "B000067RC4", "B008LTBJFW", "B001TH7GUU", "B001E1Y5O6", "B0098Y77U0", "B002JCSCYS", "B0007T27H8"], "bought_together": ["B000SE6IV8", "B000I23TTE"], "buy_after_viewing": ["B00EZ9XKCM", "B003CP0OT2", "B0027VT6V4", "B000IF4788"]}, "title": "Logitech Compact Speaker System Z320 for Notebooks", "price": 48.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41-OSU0yFDL._SX300_.jpg", "brand": "Logitech", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]], "description": "From the Manufacturer Your music, videos and games are stored on your notebook. The Speaker System Z320 brings them all to life in Logitech 360-degree sound. Unlike traditional desktop speakers that focus all the sound only in one direction, Logitech projects sound evenly in all directions. So you get the full, clear listening experience all around the room--not just in front of the speakers. Small in size but big in sound, these are the perfect notebook speakers for listening to your digital tunes in any room. And with 10 watts of power, you'll hear every note, beat and blast.Rock the room with little speakers that sound bigYour room isn't just a room. It's your office, bedroom, dance floor, screening room and game arcade. And because you don't just listen to music when you're sitting at your computer, the Speaker System Z320 floods every corner of your room with Logitech 360-degree sound. No dead spots, missing high notes or dropped-out bass thumps. You hear every note and nuance from every spot in the room. It's sound dispersed so clearly and evenly in all directions, you feel like you're in your music, movies and games.Key FeaturesTraditional desktop speakers focus sound in one listening &ldquo;sweet spot&rdquo;Logitech 360-degree sound fills every corner of the roomMost notebook speakers are designed to sound good only when you're sitting directly in front of them. But as soon as move away from the speakers to read in bed, chill in your over-stuffed corner chair or play with your cat on the floor, that fat music track can sound pretty thin. Problem solved.Logitech 360-degree speakers project sound evenly in all directions for a full-room sweet spot&nbsp;Unlike traditional speakers that use only a forward-firing driver, Logitech satellite speakers combine both forward- and backward-firing drivers. Result? Sound is dispersed more evenly and over a wider range of space. Deep bass, mid-range tones, crisp high notes&#8212;they all stay together, all around the room. So you experience concert-hall quality sound that envelops you, even if you're playing air guitar behind the speakers.&nbsp;Compact, contoured design for big sound and style in a small spaceYour desktop holds a lot of stuff. So you need a speaker system that won't take up much of your precious workspace. This compact system is just what your crowded desktop ordered. Just under 8-inches high, these sleek speakers frame your notebook nicely without asking for much space. No clutter. No hassles. Just plug them in and fill every corner of your room with audio nirvana.&nbsp;10 watts (RMS) of power for a rich sound experienceGo ahead. Turn up the volume. These little speakers deliver enough crisp, clear sound to do justice to your favorite rock anthem. Your games will come alive with detailed sound that ratchets up the intensity. And your small-screen movies and videos will engulf you with a bold sound experience.&nbsp;The perfect notebook companion for filling any room with your musicThrowing a party in the living room or out back on the deck? The music part is covered. These small, lightweight speakers are easy to move to any room. Just bring your notebook to the party room, plug in the speakers, pick your playlist and start dancing.Enhance your listening experience with great Logitech products.Logitech Speaker System Z323Transport yourself into your music, movies, and games with the 30-watt (RMS) Logitech Speaker System Z323. With 360-degree sound, the Z323 speakers help project audio evenly in all directions, so you get a great listening experience throughout the room.Ultimate Ears SuperFi 4 Noise Isolating EarphonesFeaturing the same speaker technology and sound signatures used in our higher-end products, these compact earphones deliver detailed bass with crisp and clean mids and highs.Ultimate Ears MetroFi 220 Noise Isolating EarphonesMore than just a pretty package, the MetroFi 220 earphones give you clarity, smooth range, and deep bass in a sleek and comfortable design.What's in the BoxPackage ContentsLogitech Speaker System Z320Power supplyQuick-start guide2-year limited hardware warrantySystem RequirementsWindows XP, Windows Vista, or Mac OS X 10.3.9 or laterSound card or 3.5 mm audio out"}