{"asin": "B000HAVVKG", "categories": [["Electronics", "Camera & Photo", "Video Surveillance", "Surveillance Cameras"]], "description": "This technologically advanced wireless electronic remote switch can control virtually everything in your house with just the push of a button. Control lamps, radios, or other electrical devices from up to 100 feet away, even through walls and floors, with this radio frequency wireless remote control. The receiver plugs directly into any three-prong outlet, and provides a remote switched three-prong outlet to allow radio frequency on &amp; off control for a wide variety of electrical devices. The control unit, with keychain, is more than small enough to fit into your pocket, but its signal will work up to 100 feet away from the receiver even from inside your car.The possibilities for the wireless power switch are endless. Use it to power on kitchen appliances. Start your morning coffee brewing before you even head downstairs and have it waiting for you as soon as you reach the breakfast table. It's ideal for those hard-to-reach plug-ins like lights and computer outlets. The kids left the television on and you don't feel like getting out of a comfortable chair to turn it off? Just one handy button and you're in charge.Common UsesTurn lights on and off remotely, never walk into a dark room again, easily investigate a noise in the middle of the night, have the lights in your house on before you even step through the front door, no need to get off the couch, warm up kitchen appliances first thing in the morning!Ideal ForGarages, kitchens, basements, businesses, entryways, front doors, backyards, offices, warehouses.Easy Plug &amp; Play InstallationPlug receiver into wall outlet. Plug device to be controlled into receiver. That's it you're done! No wiring necessary!", "title": "SVAT WRC101 Wireless Remote Control Power Outlet Outdoor On/Off Switch with 100 Feet Range", "price": 19.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41VEI1Lo4NL._SX300_.jpg", "related": {"also_bought": ["B001Q9EFUK", "B000BQRHMM", "B001DF2QDK", "B00008X5D5", "B004DJ9EL0", "B002A7XXIM", "B001F7ZVXS", "B005TQNP70", "B0041B6ZL2", "B007PZB908", "B005Y4C992", "B0055QM9NA", "B000JTHNCA", "B003US46ZE", "B008B4TNT6", "B007VT64S0", "B001RLUMYK", "B006EUHRK6", "B003ZTWYXY", "B00DQELHBS", "B007PZBAAW", "B000FH89EM", "B00B4538JU", "B000667QL4", "B001CD5U7W", "B001AYKN84", "B0002UPIOQ", "B00BB2MMNE", "B00DQ2KGNK", "B002EVOAMM", "B00405F862", "B000CRFOMK", "B000A3CIUW", "B000V1PAZS", "B0033AHK6Q", "B002BSGUCG", "B002UG1B0U", "B003XFUKWM", "B005BV0DD2", "B005MMSTNG", "B000V1LX0O", "B0026MTCRM", "B001BBKNI6", "B000HJBE68", "B00004WKI3", "B00164QJJ0", "B007JRDT96", "B000BQU576", "B0019FATKG", "B00GVKSTAQ", "B002X796IA", "B00004R9VZ"], "bought_together": ["B001Q9EFUK"], "buy_after_viewing": ["B001Q9EFUK", "B000BQRHMM", "B00E5VEBK0", "B001DF2QDK"]}}