{"asin": "B00007LTBA", "categories": [["Electronics", "Computers & Accessories", "Routers"]], "description": "Now the popular D-Link Xtreme G wireless just got faster, while maintaining   adherence to the IEEE 802.11g standard.A new free firmware upgrades D-Link 802.11g Xtreme G products to deliver the   Industry&#8217;s fastest performance, up to 15 times faster than 802.11b. At   108Mbps data bandwidth the 802.11g D-Link Xtreme G DI-624 with enhanced 108   delivers excellent and consistent data rate throughput.The D-Link Xtreme G with enhanced 108 features         the industry&#8217;s first default 108Mbps &quot;Dynamic Mode&quot; that         allows clients to always operate at the highest possible speeds while         automatically identifying and recognizing other D-Link Xtreme G products         for highest performance capability and seamless access to the wireless         network in a homogenous environment.Extensive performance and interoperability testing using standard based         methods including NetIQ&#8217;s Chariot software reveals a significant         increase in performance of the D-Link Xtreme G over other 802.11g based         competitors.The D-Link Xtreme G DI-624 with 108 Mbps upgrade employs five cutting-edge         hardware-based compression technologies to achieve a significant boost         in performance within the 2.4 GHz frequency range.&nbsp;Packet Bursting:The packet bursting technique puts           more data into a single transmission, allowing more raw data to be stuffed           into each packet and as a result not only delivers much more data, but           also executes this process with less traffic on the network. Packet           bursting transforms lengthy binary code into simple equations, resulting           in an overall reduction in the number of 1s and 0s being sent over the           network. It is also the technique defined as one of the methods for           performance improvement in the IEEE 802.11e QOS draft standard.Fast Frames:The fast frames technique enhances           data throughput by increasing the number of bits sent per data frame           and accelerating the timing of a data frame with a dynamic transmit           optimizations. This technology enhances the Packet Bursting capability           synergistically to provide accelerated performance results. The fast           frames technique is also based on the 802.11e QOS draft standard.Hardware Compression and Encryption:Xtreme G uses           the Atheros AR5002 chipset which employs special engines to compress           and encrypt data. These hardware engines operate in real-time to enhance           throughput by implementing standard algorithms and compressing data           prior to transmission and after reception.Multi-Channel Bonding:Multi-Channel Bonding embraces           two radio channels simultaneously. It collapses the available channels           from 12 to 6 for increased bandwidth on the available channels. Single           and double channels are not run at the same time. This technology senses           single channel and dual channel frames and negotiates time-based solutions           with priority on single channel processing.Select Mode:Select Mode gives users the option of           locking the Xtreme G products into a Static mode (instead of the default           Dynamic mode) for even higher performance within a complete D-Link 108Mbps           Xtreme G environment.&nbsp;The D-Link 802.11g DI-624 Xtreme G features robust security to protect         the wireless network from intruders, complying with the latest wireless         networking security protocols, including WEP encryption and Wi-Fi Protected         Access (WPA) support for both 802.1x and WPA-PSK. The DI-624 is also capable         of supporting the government-grade AES encryption and upcoming 802.11i         standards.In addition to being the industry&#8217;s fastest wireless network solution,         It includes management settings and policy-based content filtering for         advanced network management. Filters can be set based on MAC address,         IP address, URL and/or Domain Name.&nbsp;The D-Link Xtreme G DI-624 with 108 upgrade is ideal for creating a fast and   affordable wireless network, delivering the industry&#8217;s fastest wireless   network performance. D-Link Xtreme G is also the only 802.11g solution with   108Mbps mode that remains fully interoperable and compatible with all 2.4GHz   devices, capable of creating one homogenous network environment for the multi-vendor   environment.IMPORTANT NOTE:This 108 Mbps firmware upgrade is currently   available for revision C (1 antenna) only. Firmware for upgrading to 108 Mbps   is not yet available for Revision A &amp; B.", "title": "D-Link DI-624 Wireless Cable/DSL Router, 4-Port Switch, 802.11g, 108Mbps", "price": 12.46, "salesRank": {"Electronics": 33212}, "imUrl": "http://ecx.images-amazon.com/images/I/31FMWMRM8ZL._SX300_.jpg", "related": {"also_viewed": ["B008IFXQIW", "B0001PFQ08", "B001CN9K6E", "B000QD7B6W", "B0062K951C", "B007FECGS8", "B006TZM6XO", "B0000BZO58", "B000069K98", "B002VJL0OS", "B003IZBHYW", "B00E92LIQU", "B0011WBJTW", "B005IB6PLO", "B004UBW3SW", "B001FWYGJS", "B001F7HLRC", "B000LIFB7S", "B004TGHI9W", "B00005ARK3", "B004AXDFFA", "B003Y2VWXK", "B000OWNPVK", "B0006TIA2U", "B001V72S06", "B00894WP4S", "B00BS49ZF8", "B002V75U7I", "B00KZE3B7U", "B0029LRYMK", "B0093IPJKQ", "B00008SCFL", "B0081HD3PI", "B00004SB92", "B0000C0XS0", "B00HN0RB4I", "B00E37JFH0", "B00895BUPC", "B0062KA4VM", "B00006HVDH", "B0081TXJ28", "B000WGXF3Q", "B001UI4RTG", "B004H1PMJC", "B0037D51FQ"], "buy_after_viewing": ["B008IFXQIW", "B001FWYGJS", "B006TZM6XO", "B00A3YN0Z0"]}}