{"asin": "B004U403S6", "categories": [["Electronics", "Home Audio", "Stereo Components", "Receivers & Amplifiers", "Component Receivers"]], "description": "Enhancing the home theater experience, the Denon AVR-1312 5.1 Home Theater Receiver blends quality performance and convenient features. Offering the latest inputs, this powerful receiver features advanced processing that brings out the best in your Blu-ray/DVD players, game consoles, and other entertainment devices. The AVR-1312 supports high-resolution audio formats, including Dolby TrueHD and DTS-HD, for a dynamic surround-sound listening experience. It also supports HDMI v1.4a, allowing you to get the most out of 3D content. Enhanced by convenient digital inputs, including a dock connectivity option for iPod and iPhone, the AVR-1312 serves as a quality foundation for your home theater system.AVR-1312 5.1Home Theater ReceiverAt a Glance:Equal power amp design with five discrete 75-watt*channelsHDMI v1.4a supports all 3D formats and Audio Return ChannelFour HDMI inputs for added connectivityGUI overlay and remote control for easy operationBacked by a two-year warrantyEqual power amplifier design offers true reproduction of original sound.View larger.Features four 1.4a HDMI ports for vibrant 3D visuals.View larger.Quick Selection buttons let you select video and music sources effortlessly.View larger.Premium Audio Technologies for Superb Surround SoundFully compatible with current HD audio formats, the Denon AVR-1312 5.1-Channel A/V Receiver provides powerful, theater-quality surround sound. It ensures maximum audio performance with multiple technologies:Equal Power Amp Design:Each of the AVR-1312's five 75-watt*channels is powered by its own discrete circuit. This allows the receiver to reproduce original sound more faithfully than conventional models, which use integrated circuits.High-Definition Audio Support:The AVR-1312 features support for Blu-ray high-resolution audio formats, including Dolby TrueHD and DTS-HD Master Audio. These formats play back sound with exceptional fidelity, providing a more realistic listening experience.Full HD SupportWith four HDMI inputs, the AVR-1312 allows you to route multiple high-definition devices--like game consoles and Blu-ray players--to your TV. It also allows you to connect all of your devices to your TV with a single HDMI cable, reducing cable clutter.Vivid 3D Visuals with HDMI v1.4aThe AVR-1312 comes equipped with HDMI v1.4a, allowing you to make the most of several premium video features:3D Pass-Through:With the advent of 3D media, it is important to own a receiver that recognizes 3D video signals. The AVR-1312 is able to pass through 3D signals from your Blu-ray player, ensuring that the 3D effect doesn't get lost in translation. It also recognizes signals from 3D television broadcasts.Deep Color and x.v.Color Support:The AVR-1312 also supports Deep Color and x.v.Color content, which can display a larger color range than standard-definition schemes. The result is a more lifelike, vibrant picture.Stereo Mini Jack and iPod ConnectivityWith the front-side stereo mini jack, the AVR-1312 supports audio playback from any portable audio player. This receiver can also be used with the Denon Networked Control Dock (sold separately) for network streaming or docking your iPod/iPhone. A compressed audio restorer guarantees that standard MP3 playback is crisp and clear.GUI Overlay and Remote Control for Simple OperationWith its intuitive button layout, the AVR-1312 is designed for ease of use. The front panel is smartly organized, featuring clearly labeled buttons and onboard controls for volume and source. In addition, its on-screen display provides quick information about your system's settings.The AVR-1312's simple remote control is easy to use, giving you more flexibility in controlling your home theater.Product and Warranty InformationThe receiver measures 6-3/8 by 17-1/8 by 15-3/64 inches (H x W x D), and weighs 19 pounds.The Denon AVR-1312 5.1 Channel A/V Home Theater Receiver is backed by a two-year warranty.What's in the BoxAVR-1312 5.1-Channel A/V Receiver, remote control, AA batteries, AM loop antenna, FM indoor antenna, and owner's manual.*75 watts per channel (20Hz-20kHz, 8 ohms, .08&#37; THD), 110 watts per channel (1kHz, 6 ohms)", "title": "Denon AVR-1312 5.1 Channel A/V Home Theater Receiver", "price": 194.99, "salesRank": {"Electronics": 39857}, "imUrl": "http://ecx.images-amazon.com/images/I/31GHuwng%2BWL._SX300_.jpg", "related": {"also_bought": ["B0029HHIDY", "B001AVRD62", "B0002KVQBA", "B0019EHU8G", "B00005T3BD", "B002RMPHMU", "B0002L5R78"], "buy_after_viewing": ["B00B7X2OW6", "B00B7X2OV2", "B0077V8930", "B0029HHIDY"]}}