{"asin": "B0046A9RA4", "description": "The Sony XNV-770BT A/V Receiver with Navigation delivers incredible audio and video picture quality, with integrated navigation from TomTom. With the most accurate maps and over 1 million more miles of road in the US than others, plus features like USB 1-Wire connections and Bluetooth technology, you're ready for the road trip of a lifetime--not to mention your daily commute.Incredible audio and video picture quality and integrated navigation from TomTom.Click to enlarge.Incredible Audio/Video Picture Quality7-Inch Touchscreen DisplayThe high-resolution TFT (WVGA) 7-inch touchscreen display that will inform and entertain you, making everything easier to control with gesture command and on-screen touch buttons. Separate audio and video power supply circuits provide added clarity.TomTom navigation provides the most accurate maps with over 1 million more miles of road in the US than other GPS brands.Bring the TomTom Navigation Module from your car and connect to your computer via USB for updates.Control everything easily with gesture command and on-screen touch buttons.USB 1-Wire ConnectivityConnect, charge, and control your iPod, iPhone, Walkman player or other compatible USB devices via the USB 1-Wire on the rear of the unit. You can also view metadata like song title and artist on the front display.Integrated Bluetooth TechnologyTaking calls and enjoying streaming audio has never been easier with the XNV-770BT A/V Receiver with Navigation featuring Bluetooth technology. Connect compatible devices and easily choose between Hands Free and Phone Book Access or Audio Streaming.Plays DVDs/CDs and Digital FilesThe XNV-770BT A/V Receiver with Navigation accepts just about every digital format you'd want on the road. The XNV-770BT can playback CD or DVD and MP3/WMA/AAC/JPEG/MP4 (Simple Profile) CODEC files.Satellite Radio/HD Radio ReadyThe XNV-770BT integrates seamlessly with Satellite Radio and HD Radio using Sony Bus adaptors so you can receive digital satellite radio or HD Radio broadcasts.Advanced Sound Engine With EQ7The Advanced Sound Engine uses EQ7 equalizer, adjustable LPF/HPF crossovers, Listener Position calibration, DM+ advanced sound restoration, Rear Bass Enhancer, and Center Stage Optimizer to create an ideal in-car listening environment.Integrated Navigation from TomTomThe Sony XNV-770BT A/V Receiver with Navigation features TomTom navigation and delivers incredible audio and video picture quality. TomTom is the only company to incorporate real world, real-time feedback, providing the most accurate maps available.Preloaded Maps of US and CanadaTomTom navigation provides the most accurate maps with over 1 million more miles of road in the US than other GPS brands.One Year Free Map UpdatesEnsuring that the digital map content remains completely up-to-date. Included in the box provides 4 verified US and Canada map updates for the first year.TomTom Home SoftwareTomTom Home makes it easy to get new software, download new maps, access free content and more. Simply bring the exclusively designed TomTom Navigation Module from your car and connect to your computer via USB.IQ RoutesTomTom IQ Routes Technology puts the driving experience of millions of TomTom users into your maps to shave time off even the shortest trips. Calculates the fastest route possible based on time of day. With TomTom IQ Routes you'll always drive the smartest, most efficient route. IQ Routes saves you time, fuel and money.Traffic isn't the same during Monday morning rush hour as it is on a lazy Sunday afternoon. Heavy traffic, rotaries, traffic lights, and even pedestrians can slow you down. The route you need changes depending on the day and time, so the shortest route isn't necessarily going to be the fastest. With TomTom IQ Routes you'll always drive the fastest route.Advanced Lane Guidance*TomTom Advanced Lane Guidance gives you extra clarity when navigating difficult junctions by showing you which lane to take, so you won't miss your turn or have to make sudden, dangerous lane crossings. Photorealistic images and a pulsing green arrow indicate exactly which lane to use, so you can go confidently.Spoken Street NamesWhen driving to your destination, the XNV-770BT will announce turn-by-turn directions, including street and place names.6 Million Points of InterestPreloaded with the locations of millions of gas stations, restaurants, hotels, hospitals and more.QuickGPSfixGPS data that predicts satellite positions and enables quicker GPS pick-up. Faster satellite pick-up means quicker start to the journey.Help Me! Emergency Resources MenuComprehensive Help Me! menu to assist in any emergency. Quickly obtain address information to the nearest help location (hospital, police station, etc.). First aid guide also provides info on what to do if an accident occurs.*Feature only available in the US and CanadaWhat's in the BoxSony XNV-770BT A/V Receiver with Navigation, RM-X170 Wireless Remote, CD-ROM (Application Disc), Installation Hardware, Microphone, Navigation Module, User's Manual, Installation ManualAbout TomTomFounded in Amsterdam in 1991, TomTom has established itself as a global leader in navigation by being an innovative company with a strong brand, clear customer focus, and high quality products and services.TomTom is the world's leading navigation solutions provider with navigation products sold in 30 countries and in over 20 languages. To further our commitment to car navigation, TomTom acquired Tele Atlas maps in 2008 so we can continually provide the most up-to-date maps and intelligent routing.We have our own mapping company!Did you know that every year roads change by up to 40% in high-growth areas? Tele Atlas manages this by using the world's most comprehensive systems to identify and incorporate these changes into our maps with unprecedented levels of speed and accuracy. All TomTom devices benefit from the Tele Atlas advantage--more coverage, more points of interest, and more freshness and accuracy.Why TomTom?At TomTom, we believe that personal navigation should be as easy and safe as possible. We develop smart technology that gives you straightforward solutions, innovations to make life easy.", "title": "Sony XNV770BT 7-Inch Touch Screen Bluetooth AV receiver with TomTom Navigation (Discontinued by Manufacturer)", "price": 549.99, "imUrl": "http://ecx.images-amazon.com/images/I/51Y8TG7gOOL._SX300_.jpg", "related": {"also_bought": ["B0049LBJ56", "B001EAWNVY", "B0032FOJSE", "B000K4V4X8", "B003D3NEEU", "B0017S9NLQ", "B005GUB5NK"], "buy_after_viewing": ["B0049LBJ56", "B00B4PJC9K", "B003D3NEEU", "B006Y444T4"]}, "categories": [["Electronics", "Car & Vehicle Electronics", "Vehicle Electronics Accessories", "Audio & Video Accessories", "Antennas"]]}