{"asin": "B001DHLC3S", "categories": [["Electronics", "Computers & Accessories", "Routers"]], "description": "The Wireless N Home Router TEW-652BRP allows you to create a secure high performance wireless N network with 12x the speed and 4x the coverage of wireless G. Quickly install the Wireless N Home Router and then use a Wireless N Adapter to connect a laptop or desktop at the touch of a button with one-touch Wi-Fi Protected Setup (WPS) technology. The latest in wireless encryption and a double firewall safeguard your data. Advanced antenna technology (MIMO) delivers expansive coverage and minimizes wireless dead spots. A quick and intuitive installation process, remote management capabilities and a 3-year limited warranty make this kit well suited for your most demanding networking needs.Router FeaturesWi-Fi compliant with IEEE 802.11n and IEEE 802.11b/g standardsFour 10/100 Mbps Auto-MDIX LAN port and one 10/100 Mbps WAN port (Internet)Supports Cable/DSL modems with Dynamic IP, Static IP, PPPoE, PPTP, L2TP &amp; BigPond connection typesHigh-speed up to 300 Mbps data rate using IEEE 802.11n connectionTwo external antennas support high speed performance and great coverage with MIMO technologyFirewall features Network Address Translation (NAT), and Stateful Packet Inspection (SPI) protects against DoS attacksSupport Wi-Fi Protected Setup (WPS) for easy connectionUniversal Plug and Play (UPnP) and Application Level Gateway support for Internet applications such as email, FTP, gaming, remote desktop, Net Meeting, telnet and moreProvides additional security of enable/disable wireless SSID, Internet Access Control (MAC Address, Domain &amp; IP Filtering)Easy management via web browser and remote managementSupports 64/128-bit WEP, WPA/WPA2 and WPA-PSK/WPA2-PSKWorks with Windows 95/98/NT/2000/XP/2003 Server/Vista, Linux and Mac OSCoverage up to 330 feet indoorCoverage up to 980 feet outdoor3-year warrantyWhat's in the box:TEW-652BRP, multi-language quick installation guide, CD-ROM (driver/user's guide), power adapter (5V DC, 2.5A), Cat 5 Ethernet cable (5-feet), USB cable (5.7 inches).", "title": "TRENDnet 300 Mbps Wireless N Home Router TEW-652BRP (Black)", "price": 17.99, "salesRank": {"Electronics": 47262}, "imUrl": "http://ecx.images-amazon.com/images/I/419cXLjUofL._SY300_.jpg", "related": {"also_viewed": ["B0062KA4VM", "B000QD7B6W", "B00E37JODK", "B0062K951C", "B00979B8D8", "B006TZM6XO", "B00DS2RKV4", "B002YLAUU8", "B003Y5RYNY", "B0019EQ1RW", "B001FWYGJS", "B005B111II", "B0032L85J2", "B001P9XHHI", "B0081TXJ28", "B0037D51FQ", "B002WBX7TQ", "B002VJL0OS", "B00D8AMKKC", "B004AXDFFA", "B007KZQM9G", "B007FECGS8", "B00GEBZJ00", "B00F2EL39Q", "B004N625A0", "B0098QV038", "B00B0CQCCC", "B000Z3U1P6", "B001UI4RTG", "B006C2DV5G", "B0085WN7YQ", "B008RV51EE", "B0050SLU6K", "B0042X3F76", "B000LIFB7S", "B004N625AA", "B00008SCFL", "B0062K5JAI", "B00BKFYIP2", "B0058NN6CS", "B0081HD3OO", "B008IFXQIW", "B007KZQM9Q", "B006OOKT3Y", "B00FXQUR86", "B001AZP8EW", "B002RYYZZS", "B0045HHTGW", "B009RRZ36I", "B0039KFS2S", "B0055EXMII", "B0014IYZDK", "B004MODQOC", "B004N6259G", "B004T9RR6I"], "buy_after_viewing": ["B0062KA4VM", "B001FWYGJS", "B001P9XHHI", "B004TGHI9W"]}}