{"asin": "B0026ZPTR6", "description": "DDR2 and DDR3 are the next generations of DDR memory. They feature faster speeds, greater bandwidth, lower power consumption and enhanced thermal performance. Although DDR2 and DDR3 modules are the same physical dimension as DDR modules, the plug-in connector configuration is different and as such DDR2 and DDR3 modules are not compatible with PCs requiring DDR modules, and vice-versa. 4GB (2x2GB) DDR3 1333MHz PC3-10666 Desktop DIMM DDR3 is the next generation of DDR memory. DDR3 memory features faster speeds, greater bandwidth, lower power consumption and enhanced thermal performance. Although DDR3 modules are the same physical dimension as DDR2 and DDR modules, the plug-in connector configuration is different and as such DDR3 modules are not compatible with PCs requiring DDR2 modules, and vice-versa. Boost the performance of your PC. PNY memory upgrades will prove to be an outstanding value now and in the future. PNY manufactures DDR2 memory upgrades rated at PC2-3200, PC2-4200, PC2-5300 and higher. They are compatible with desktop and notebook computers and processors including Intel&#x2019;s Pentium, Celeron, Centrino, AMD&#x2019;s Athlon and Sempron Socket AM2 processors, and others. PNY upgrade modules are compatible with systems from Apple, Compaq, DELL, Gateway, HP, IBM and over 5000 other systems. Boost the performance of your PC. PNY memory upgrades will prove to be an outstanding value now and in the future.  Lifetime warranty  Free 24-hour technical support Easy to install Compatible With: DDR3 PC3-10666 (1333 MHz Bus Speed)", "title": "PNY Optima MD4096KD3-1333 4GB Dual Channel Kit DDR3 1333 MHz PC3-10666 Desktop DIMM Memory Kit", "price": 43.74, "imUrl": "http://ecx.images-amazon.com/images/I/41zbosWukrL._SY300_.jpg", "related": {"also_bought": ["B004KZDV8E", "B005PX3UYA", "B0057FRTPW", "B001G0WPLK", "B000GQMHBI", "B000V6T5HW", "B00782U10W", "B00461G3MS", "B002SRQ214", "B002YIG9AQ", "B008F65MO0", "B004Q0PT3I", "B00A0HZOEA", "B002UDK9U6", "B0083B6HEQ", "B005AKK02S", "B004MU8VCS", "B002G1YPHK", "B0095VPBM2", "B0033Z2BAQ", "B007A44T42", "B003O8J11E", "B007R9CRGW", "B005LTU54Q", "B004W2T2U6", "B000BSJGL0", "B005869A7K", "B006B7R9PU", "B009654JW0", "B0054OWT0G", "B002Q2M8KK", "B005LTU6VI", "B005WUUFBW", "B0092ML1SC", "B0097WLXW6", "B00461K1QW", "B005LLBBSS", "B006MCSGZQ", "B0088PUEPK", "B005OJRGYA", "B005CT56R6", "B0040BPHJO", "B003ZDJ42O", "B000EY5F5C", "B001BN3548", "B004CRSM4I", "B004D7NAOO", "B005SEB336", "B007SZ0E1K", "B000I2C80K", "B008G9V60K", "B009HP42J4", "B0058HUQJ0", "B003NREDC8", "B001R4BT1M", "B0039L50J8", "B009FC3YJ8", "B001ISJ964", "B008IDLHE4"], "buy_after_viewing": ["B001R4BT1M", "B0088PUEPK", "B004DDI0IE", "B003N8GVUY"]}, "categories": [["Electronics", "Computers & Accessories", "Computer Components", "Memory"]]}