{"asin": "B00KIMX4EY", "description": "Description:Mpow Streambot Y Wireless In-Car Bluetooth FM Transmitter unleash your cell phone, get rid of the shackles of cables.Multifunctional design, User-friendly design with Mpow FM transmitter, makes Hands-free calls, enjoy clear music, GPS voice navigation, charge your device all can be easily done ON THE GO. The transmitter also comes with the adjustable neck design to compliment any vehicle nicely. The strong compatiability makes it work with all the cell phone which suports bluetooth function. It is really a perfect accessory for an ON-THE-GO Lifestyle driver. Mpow Streambot Y has also got a very good rating from the specialist atCNETCar Tech.Features:Multifunctional design and User-friendly design, makes it Talk, Charge and Play music on the go!Easy to control. Equipped with On-Board Volume, Play Settings and Phone Controls.Make and Receive Calls on your Phone Hands-Free while driving! Enhanced Voice Detection Microphone makes hands-free calls easy while driving.DC Stabilizer and Fully Articulating Head Provides a Perfect Fit in Nearly ANY Car!Suitable for the car without AUX portSpecification:Bluetooth profiles: HSP, HFP A2DP and AVRCP.Radio Type: FM FrequencyFrequency Range: 88.1-107.9MHzInterval: 0.1MHzBluetooth Range: Up to 30 feet (to get the best audio quality, we recommend to use the bluetooth transmitter within 20 feet.)Input voltage: DC 12~24VOutput voltage: DC 5V, 1APackage Included:1 x Bluetooth FM Transmitter(phone is not included)1 x User's ManualWarranty:Every MPOW Product includes an 18-month, worry-free Guarantee!", "title": "Mpow&reg; Streambot Y Wireless Bluetooth FM Transmitter Radio Adapter Handsfree Car Kit with Hands-Free Calling, Music Control, and Charging Port for iPhone 5S 5 5C 4S 4 iPod, Android cell phone, MP3 Players and other devices", "price": 36.99, "imUrl": "http://ecx.images-amazon.com/images/I/41uMJljTPuL._SY300_.jpg", "related": {"also_bought": ["B00JNJPS4W", "B008AGQMQC", "B00HBLZ538", "B002Q3ZFJ0", "B007FHX9OK", "B00I0DL2OC", "B00K4VQZCM", "B00D901B4W", "B000BKJDKM", "B00BMYQTYE", "B009OBCAW2", "B00H7WD5G0", "B00DVKORXC", "B004BSNNY2"], "bought_together": ["B00JNJPS4W"], "buy_after_viewing": ["B003PPGOC0", "B00HBLZ538", "B00I60488G", "B00GJFP0IM"]}, "categories": [["Electronics", "Car & Vehicle Electronics", "Vehicle Electronics Accessories", "Audio & Video Accessories", "Bluetooth Car Kits"]]}