{"asin": "B0000EI9VR", "description": "The remarkably small and lightweight iHP-120 plays over 600 hours of digital music. Within the sleek magnesium body lies a rechargeable battery that delivers up to 16 hours of life, a built-in FM tuner, an ultra-fast USB 2.0 connection and an intuitive interface that makes it easy to find any song.Features20 GB of internal storageHolds over 600 hours of digital music*Built in rechargeable lithium-ion batteryUp to 16 hours of battery lifeSupports MP3, WMA, ASF, OGG and WAV music filesUltra-fast USB 2.0 transfers (up to 40 times faster than USB 1.0)Integrated FM tunerIntuitive music navigationReal-time MP3 encoding (no PC required)Store or transfer files of any typeExtra-large, 8-line, backlit LCDLine-in and Line-out jacksOptical input and outputUpgradeable to future formats and featuresDimensions: Approximately 60 millimeters (W) by 19 millimeters (D) by 105 millimeters (H)Weight: Approx. 160 grams*Over 600 hours of music based on Windows Media format at 64 kbps.What's in the boxiHP-120 Digital Music Player, iRiver earphones , backlit remote control with 4-line display, carrying case (with belt loop), installation software CD, AC adapter, USB 2.0 cable, line-in cable, and printed user manual.", "title": "iriver H120 20GB MP3 Jukebox", "price": 34.99, "imUrl": "http://ecx.images-amazon.com/images/I/41H8RMTZSWL._SX300_.jpg", "related": {"also_viewed": ["B00DE14T9U", "B00DE16F74", "B00A6LX0F0", "B007R00TKM", "B00IBR5QJY", "B00DE1787U", "B002X7873A", "B007B5TOZY", "B001BW3ZSK", "B0002BRMNA", "B009K6ULV8", "B002JPITXY", "B0041MMMWW", "B005ER3SCG", "B00ECQUY2M", "B00826L4G8", "B000CS7U1C", "B008RK9XTO", "B0015L0T68", "B00D648BDA", "B008RK9XGW", "B00EPFLJS8", "B0076HNNHM", "B002MAPS6W", "B00963DPUY", "B00826L4GI", "B00ECRPOKS", "B00E9O6C96", "B00ECRRWTE", "B00I4Q9S32", "B00DE15P0W", "B00024VTKE", "B007B5TPEY", "B004M8STFY", "B002MAPT7U", "B0041G62VU", "B00JTOC286", "B00I9E54IM", "B00EE1H7BQ", "B004DHOHYQ", "B004STY2Z8", "B001EWDFCI", "B0035PBHRM", "B00A46Y4ZC"], "buy_after_viewing": ["B002MAPT7U", "B002MAPRYU", "B009QZH7BU", "B002MAPS6W"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}