{"asin": "B004H8FNJ4", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Sony DSC-WX10Sony DSC-WX10 &ndash; incredible power in a compact package. With powerful features like Full HD movie for high quality movies, low light performance for improved image clarity, 10 fps to capture the precise moment, and backlight correction to capture the detail in high contrast shots.Sony DSC-WX10 Feature Highlights16.2 Megapixel Back-illuminated &ldquo;Exmor R&rdquo; CMOS Image SensorThe DSC-WX10 features a 16.2 megapixel &ldquo;Exmor R&rdquo; CMOS image sensor that brings out the full resolving power of the camera&rsquo;s Carl Zeiss Vario-Tessar lens to deliver extremely fast speed, high resolution, and stunning low-light sensitivity with improved image clarity and drastically reduced grain. In addition, the combined &ldquo;Exmor R&rdquo; CMOS sensor and BIONZ image processor delivers extremely fast 10fps, Anti Motion Blur, Hand-held Twilight and 1080i movie modes3.2.8-inch Clear Photo LCD Plus display&nbsp;&nbsp;&nbsp;Compose and show off your images on the large 2.8-inch Clear Photo LCD Plus display, which features a special anti-reflective coating for sharp visibility, even in bright sunlight.Full HD 1080@60i&nbsp;&nbsp;&nbsp;Record crystal clear movies at the highest resolution available with capabilities for 60i in 1080 Full HD. This provides stunning, fast motion video with less distortion for playback on your HD TV5.7x (24mm) Professional-quality optical zoom G-LensG lenses are used in top of the line digital single lens reflex (DSLR) cameras and advanced pro-sumer HD camcorders. Capture the action up close with the 7x optical zoom. A wide angle of 24mm allows you to take wider shots of the scene or group in crowded spaces.Backlight Correction HDR&nbsp;&nbsp;&nbsp;Don&rsquo;t miss a single detail in high contrast shots. The built in backlight correction analyzes the image and automatically adjusts accordingly to give you a perfectly lit shot. Backlight Correction HDR helps correct for this by taking three pictures at different exposure settings and processing the best elements of each into a single image for more natural looking shots.Background Defocus&nbsp;&nbsp;&nbsp;DSLR photographs are often beautiful because they blur the background, putting the emphasis on the subject. Now our point-and-shoot cameras can deliver this signature DSLR benefit. The system takes two shots, identifies the background and applies a defocused background keeping the subject crisp and clear.Manual operation&nbsp;&nbsp;&nbsp;Sometimes automatic just won&rsquo;t do. The manual operation function puts the control back in your hands to get the shots that you want, how you want them. Make minor adjustments to white balance, Aperture Priority and&nbsp; Shutter Priority.3D still image&nbsp;&nbsp;&nbsp;Produce awe-inspiring images with 3D still image and 3D Sweep Panorama capabilities4. Images will take on a new dimension of creative capabilities for viewing the world in a whole new way.Optical SteadyShot image stabilization&nbsp;&nbsp;&nbsp;Optical SteadyShot image stabilization uses a built-in gyro sensor to detect camera shake and automatically shifts the lens to help prevent blur without sacrificing image quality.iSweep Panorama&nbsp;&nbsp;&nbsp;With iSweep Panorama just press the shutter, pan the landscape and let the camera do the rest. It automatically links together each frame to produce a panoramic image. This model even detects faces and moving subjects to stitch intelligently different widths to help avoid subject distortion.Superior Auto Mode&nbsp;&nbsp;&nbsp;Get cleaner, more dynamic pictures and fewer missed shots. The camera automatically recognizes the correct scene mode, then quickly shoots and combines up to six shots to produce images with greater clarity, optimum dynamic range using backlight correction HDR technology and lower image noise using 6 shots layering technology. Superior Auto intelligently detects 36 scenes for still images and 44 scenes for movies, making it easy to get the best shot.Hi-speed Linear Focus&nbsp;&nbsp;&nbsp;Life moves fast, your camera&rsquo;s focus needs to move just as fast. The Hi-speed linear focus achieves dramatically clearer images with an auto focus that moves just as fast as your life.Digital Zoom&nbsp;&nbsp;&nbsp;Capturing the right shot at the right moment has never been so easy. Digital zoom brings the action up close to get that perfect shot, every time.Soft Skin Mode&nbsp;&nbsp;&nbsp;Portrait subjects will love the results. Soft Skin mode recognizes skin tones and reduces the appearance of blemishes and wrinkles without affecting the rest of the shot.Natural Flash&nbsp;&nbsp;&nbsp;Conventional point-and-shoot camera flash shots just don't capture colors the way the eye sees them. Natural Flash mode takes a reference shot without flash and then uses that reference to correct the color, for far more lifelike images.HDMI output&nbsp;&nbsp;&nbsp;The High-Definition Multimedia Interface (HDMI) is a compact audio/video connector interface for transmitting uncompressed digital streams. HDMI connects digital audio/video sources such as a compatible camcorder, Blu-ray Disc player, a personal computer, a video game console, or an AV receiver to a compatible digital audio device and/or video monitor such as a digital television (DTV). Easily connect your Cyber-shot camera via HDMI cable to any compatible HDMI compatible device to easily enjoy and upload content5.Smile Shutter technologySmile Shutter technology captures a smile the moment it happens. Simply press the Smile Shutter button and the camera does the rest. You can also select adult and child priority and indicate the degree of Smile Detection Sensitivity. Intelligent Scene Recognition can be used together with Smile Shutter mode. This means that beautiful smiles can be captured with settings optimized for the particular scene, even in difficult conditions such as twilight and backlighting.Face Detection technologySony&rsquo;s Face Detection technology can automatically distinguish between children and adults. Face Detection technology detects up to eight individual faces and adjusts flash, focus, exposure, and white balance to help deliver crisp, properly lit images of family and friends.Motion DetectionMotion Detection, along with Face Motion Detection adjusts ISO sensitivity and increases the shutter speed when movement is detected, reducing blur in moving subjects and faces.Anti-blink FunctionIt&rsquo;s frustrating to capture the perfect shot, only to review it later and discover subjects blinked during the photo. When the camera is set to Soft Snap, the Anti-blink function captures two images, recording only the photo with less squinting or blinking. If a blink is detected in other shooting modes, a warning will be displayed after you take the shot.Sweep Multi Angle Mode&nbsp;&nbsp;&nbsp;In Sweep Multi Angle mode, the camera takes 15 images at different angles as it sweeps across the scene. By tilting the camera during playback, the camera&rsquo;s Gyro Sensor detects motion and displays the image in a 3D-like view on the camera&rsquo;s LCD.Compatible with PC and MAC Systems&nbsp;&nbsp;&nbsp;The high definition, AVCHD, video captured with the DSC-WX10 can be used with the provided Picture Motion Browser software2for PC and iMovie (sold separately) for Mac systems.Includes Sony PMB (Picture Motion Browser) Software ver. 5.5Sony Picture Motion Browser software offers a simple, intuitive way to transfer, sort, and view your video and still images on your compatible PC. In addition, multiple output options let you burn your memories to DVD&nbsp; using an external&nbsp; DVD burning device (sold separately), as well as take advantage of one click upload to a number of popular video and photo sharing sites (such as Facebook and Sony&rsquo;s Personal Space). Using the new 5.5 version also enables playback of 3D images taken on the Cyber-shot camera.Includes Sony PMB Portable software2&nbsp;&nbsp;&nbsp;With the pre-installed Picture Motion Browser (PMB) Portable software2the DSC-WX10 makes it easy to pre-select videos and images in the camera and conveniently upload them from the camera to a compatible PC and popular Internet sharing sites6without the need for any additional software or install.PMB requires Microsoft Windows XP SP3/ Windows Vista SP2/Windows 7 environments not supported. Not supported by Mac OS.&nbsp;Uploading directly to the web requires PMB Portable software and USB cable (included), and PC with internet connectivity. Windows XP SP3 64-bit and Starter Edition and Windows Vista Starter Edition environments not supported.Movie recording is limited to 29 minute segments.3D viewing requires 3D HDTV, a high speed HDMI cable (supporting at least 10.2 Gbps) connection and 3D glasses (all sold separately).HD Viewing requires an HD output adapter cable (VMC-MD3) and compatible HDTV, both sold separately.Requires compatible wireless access point(s).&nbsp; Some features may rely on Internet services.", "title": "Sony DSC-WX10 Cyber-Shot 16.2 MP Exmor R CMOS Digital Still Camera with 7x Wide-Angle Optical Zoom G Lens and Full HD 1080/60i Video (Black)", "price": 9.99, "salesRank": {"Camera &amp; Photo": 1775}, "imUrl": "http://ecx.images-amazon.com/images/I/41NFLw9t2mL._SX300_.jpg", "related": {"also_bought": ["B00091S0WA", "B003VNKNEQ", "B000MDZKUU", "B004J3X5RE", "B005C95MUC"], "buy_after_viewing": ["B003VNKNEQ", "B003VNKNF0", "B00AQDGAPK", "B00AQDGAPK", "B00B7ID99I"]}}