{"asin": "B002NIP6X8", "description": "Command &amp; Conquer 4: Tiberian Twilightis the final installment in the Tiberium Saga of the long-running real-time strategy (RTS) PC game franchiseCommand &amp; Conquer. Centered around the infamous faction based struggle for, and simultaneous protection from the valuable, but dangerous energy source known as Tiberium,C&amp;C 4features classic RTS gameplay based in resource management, unit creation and battlefield strategy. Add to this new features including 5-on-5 online multiplayer support, a mix of new and classic units and exciting RPG lite gameplay elements, and you have a worthy final release in a series that over the years has epitomized the RTS genre..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Classic RTS gameplay mixed with RPG like elements.View larger.The final game in the Tiberium saga.View larger.New bottom of screen asset/map view.View larger.10-player online multiplayer battles.View larger.StoryIn the year 2062, humanity found itself on the brink of extinction. Tiberium, the mysterious, alien crystalline structure that infested Earth for decades and caused years of relentless conflict between the Global Defense Initiative and the Brotherhood of Nod, was close to rendering the planet uninhabitable. In the midst of this crisis, Kane, Nod's prophetic leader, emerged from seclusion to deliver GDI the message that he had developed a system that could control Tiberium and harness its power. But he could not build this \"Tiberium Control Network\" without GDI's cooperation. Thus, the two opposing factions&mdash;GDI and Nod&mdash;found themselves in a desperate and unlikely alliance to stop Tiberium from extinguishing mankind.Now, after 15 years, the network is nearly complete. Tiberium is under strict control and the revitalized Earth is on the cusp of a new age of prosperity and progress. It is only now that the world's citizens begin to seriously ponder why Kane chose to help, and what he will want in return. Kane. GDI. Nod. Tiberium. How will it end? These questions and more lead to the dramatic final act of the 15-year Tiberium saga inCommand &amp; Conquer 4: Tiberian Twilight.GameplayCommand &amp; Conqueris a real-time strategy gaming franchise, andCommand &amp; Conquer 4: Tiberian Twilightis no exception. Players assume color-coated versions of the GDI or Nod factions and uncover segments of the map, where they must manage Tiberium and other resources in their possession or that they they mine or commandeer in the field. Other factions occur in the game, but are not playable, and different single player campaigns are available to players depending on which of the two factions are chosen. The energy that Tiberium crystals possess is used in the manufacture and upgrading of mining and combat units, weapons and support infrastructure in preparation for impending conflicts with other players on the same map that are doing the same. Each faction has its own distinct unit types, both land and air based, which although unique, are overall more or less balanced against those of opposing faction. In addition, certain units can be captured on the battlefield and used to supplement your arsenal. The overarching task though is to combine the right number and type of units with the right battlefield strategy for the conflict and terrain at hand.Historically,C&amp;Cmatches have been won by completely eliminating all enemy units that stand against you. Although there is certainly plenty of this withinTiberian Twilight, the game also is different in that players need not eliminate all enemy units, instead capturing control nodes throughout the game and holding them for a minimum amount of time. Doing so leads to earning enough points to win the match.Tiberian Twilightalso differs from earlier games in the series with the addition of certain RPG game elements. Players overall orientation within their chosen faction is class based, with units falling generally in offensive, defensive or support classes depending on your play style. These units can be upgraded with experience points, which are gained through success against enemy units, with more advanced enemy units earning the conquering player more points, and thus potential unit upgrade opportunity.5-on-5 Online MultiplayerCommand &amp; Conquer 4: Tiberian Twilightallows PC gamers to team up and battle like never before. Join your fellow commanders online and tackle your opponents in the biggest C&amp;C multiplayer to date, featuring 5 vs. 5 objective-based battles. Choose your favorite class and take online strategy action to the next level as you conquer objectives while pummeling your enemies. In addition, an all-new party system lets you move with your party of friends from one online battle to the next.Key Game FeaturesThe Epic Conclusion to the Tiberium Saga- Kane returns in the thrilling conclusion to one of gaming's longest running storylines, told through gritty live-action cinematics. Choose to take on the campaign solo or team up with a friend and play cooperatively.Persistent Player Progression- The more enemy units you destroy, the more experience points you earn to progress your player profile. Level up to unlock new units, powers, and upgrades to make your army more powerful.Always on the Move- For the first time ever in the C&amp;C series, a massive, mobile, all-in-one base, The Crawler, lets you pack up and move your base with your army for a new layer of strategic depth. Build units as you move across the field, and deploy whenever and wherever you choose.Choose Your Class- Choose from three unique classes from both GDI and Nod, each with its own specialized units and powers, for more strategic and combative options that match your play style of choice. Offensive, Defensive, or Support classes-which will you pick?Online Multiplayer Support&ndash; Sign on for 5-on-5, online objective based battles which also features an all-new party system that lets you move with your party of friends from one online battle to the next.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51vV0vq-3IL._SY300_.jpg", "related": {"also_bought": ["B001FLGEEE", "B0016BVY7U", "B000YJ09QW", "B000MG3LDA", "B000CPKIT6", "B002BXN6GY", "B000FJSIUA", "B000U8AYOO", "B000ZKA0J6", "B0031MAI10", "B0000CE1GK", "B000FNA2QY", "B0095C0I4W", "B000SOYG8U", "B002L6HJCI", "B000J18SR2", "B000NSH4YY", "B003TIVSM4", "B0000CE1J2", "B000YDIYEW", "B001Q96ZNU", "B0015QFHCE", "B0009J1JIY", "B002SKDIKE", "B00009ECGK", "B00000DMA8", "B000U850P2", "B00007LVJD", "B00001IVRD", "B001RQWJ2S", "B000Q8UPKQ", "B00GPH7Y8S", "B002I0KP4G", "B001AH8YSW", "B00473Y6VA", "B002GJMGNM", "B006ZPAYJ6", "B004H48VFQ", "B00178631E", "B003BJ09QM", "B000MG09XA", "B00022Q0RI", "B00GPH7W26", "B000YJ3TR8", "B00F4H2O6W", "B000P5BSUQ", "B0044S8DA8", "B000FGA1US", "B005C7R95K", "B000AB603U", "B000FOVJVA", "B005UI8V6C", "B00001LDCK", "B003O2182A", "B004M8FUMO", "B002V16T92", "B005M0KSIM", "B002BS47YE", "B002BRYXRQ", "B0049WF6FY", "B0007GBBHI", "B00F3F2UJ6", "B0050SWTS8", "B00BQZ5EWW", "B0050SZ980", "B00005QJDS", "B0000C0YNT", "B00178630A", "B001VJ4DHK", "B001AZ7RJ6", "B002I0JAJ2", "B001CC8UBG", "B0000A1VER", "B001V9PTVE", "B001F6HJIY", "B0050SZ0SY", "B000R2WI0G", "B00005N7YK", "B0050SZ0JI", "B002I0HJ68", "B0018KM6GM", "B000WCCURW", "B000083JXD", "B003VJNPPE", "B00ENFVUGQ", "B001C4VU5C", "B0017TFLBQ", "B003ICGL7I", "B001HL3Q70", "B00BQZ5F6C", "B001B5U80K", "B006P5RW3M", "B000NV8F58", "B004HYIAPM", "B0050SZ836", "B002CZQ4Z6"], "bought_together": ["B000YJ09QW", "B0016BVY7U"], "buy_after_viewing": ["B001FLGEEE", "B000CPKIT6", "B0016BVY7U", "B0095C0I4W"]}, "salesRank": {"Video Games": 9004}, "categories": [["Video Games", "PC", "Games"]]}