{"asin": "B002I08DQI", "description": "To make gaming as accessible to people of all ages and all abilities, Nintendo wanted to create a controller that was as inviting as it was sophisticated- the result is the Wii Remote. Nintendo fused the global familiarity of a remote control with the sophistication of motion-sensing technology to come up with an input device that differentiates the Wii from any other console that has come before it. Now Nintendo is making this revolutionary device available in black.Revolutionary controlSporting the dimensions of a small traditional remote control, the wireless Wii Remote is a multifunctional device that is limited only by the game designer's imagination. The magic of the Wii Remote's design lies within; acellerometers inside the controller body measure movement in all directions and at all speeds. In a tennis game, it serves as your racket as you swing your arm for a long forehand or a quick and hard backhand. In a 4x4 driving game it serves as a steering wheel, allowing you to swerve to avoid obstacles or pickup power-ups. In first-person shooters, the Wii Remote acts as a firearm that you can point directly at an on-screen enemy. The list of potential uses is enormous, and the light weight of the Wii Remote allows gamers to play for hours without feeling fatigued.As comfortable as it is functionalThe Wii Remote is equally comfortable in right and left hands and houses just the right number of buttons for gaming- not so many that new players will get confused, but enough so that Wii games don't feel constrained. On the face of the remote are the D (or \"plus\") pad, a large \"A\" button which is used for major on-screen actions, and two small options buttons. Between the game buttons are a plus and minus buttons (which often act as \"forwards\" and \"back\"), as well as a \"Home\" button to engage the Wii home screen to change settings or check remote battery levels. On the back side of the controller is a trigger-like \"B\" button, perfect for timing releases.Wii MotionPlusSimple. Intuitive. Easy to use. Connect the Wii MotionPlus accessory to your Wii Remote controller to increase accuracy and enhance play control on compatible games. Look on the back of Wii Game Disc WiiMotion Plus detailspackaging to see which games are specially designed for use with Wii MotionPlus. Wii MotionPlus contains additional sensors that make the Wii Remote respond to the slightest movement, motion, or twist of the wrist. Wii MotionPlus must be used with a Wii Remote, which is sold separately.", "price": 46.98, "imUrl": "http://ecx.images-amazon.com/images/I/41FjiN%2B%2B17L._SY300_.jpg", "related": {"also_bought": ["B0094X1ZXU", "B00293IKQC", "B009M72E5Q", "B004WLRQ2S", "B003X1R29K", "B0030BF1QO", "B003EH0BQ4", "B001GIUWX0", "B002BRZ9G0", "B004IK24MU", "B003Q5J4NU", "B0027IS82K", "B000IMYKQ0", "B002BSA3EM", "B0045F8QDE", "B004W1IX1G", "B002MGPAKU", "B0049WQPOK", "B003YLWJLA", "B002OL1KEI", "B0030BF1QE", "B0094X28J0", "B00D7UHT0E", "B004NT9WU8", "B0056C2LIG", "B001PO2BJI", "B005FYJA52", "B0094X2066", "B003SVTEUK", "B003ZHMMEM", "B0013E9HP6", "B0017Q4DGI", "B000R3BNDI", "B000FQ9R4E", "B009AFLXQQ", "B0045FEE3A", "B0041T9L2Y", "B003LDKIQ4", "B001UAAX60", "B004C34D2M", "B002BSC54I", "B0045FEENK", "B003O6DZSQ", "B005QWYKOE", "B002TLTBN0", "B0053BG26C", "B000IMWK2G", "B00BHISQMI", "B000FQBPCQ", "B00A878J5I", "B0086V5UF0", "B006QRNKOO", "B002RD2WJ0", "B00116R70I", "B000KRXAGE", "B001TOQ8NO", "B00A878KWU", "B002BSA388", "B004WLRR4K", "B005IGQMPI", "B001AMO1D4", "B009YZNR3Y", "B0094X221O", "B002BSC4ZS", "B0024MJ8XC", "B007VIYQVI", "B00G0OYHCW", "B004M8K9AW", "B0041JR3VK", "B002BRYXOO", "B002MQLPJ0", "B004WLRQMI", "B00DC7G0GG", "B002ECN43C", "B0088I8M10", "B0050SVGU0", "B0026IUSXI", "B002BH3N2W", "B00434FED2", "B007RNWUC4", "B009AGXH64", "B0013B30SY", "B004WLRQAU", "B000LSJKAM", "B00ER8HHDO", "B002I0K3M0", "B001TOMR0C", "B004JKZUJI", "B005JR7FRA", "B00AJZNUUI", "B00DJYK9L4", "B000X2RKOO", "B00FLYZ7NU", "B001SIFNXW", "B00897Z240", "B007MM9E42", "B000XJNTNS", "B00A878J4E", "B009NRO1J2", "B002MWSY3O"], "bought_together": ["B0094X1ZXU"], "buy_after_viewing": ["B0094X28J0", "B0094X1ZXU", "B00DC7G2W8", "B00FLYZ7NU"]}, "salesRank": {"Video Games": 5246}, "categories": [["Video Games", "Wii", "Accessories", "Controllers", "Remotes"]]}