{"asin": "B0017QQQAE", "related": {"also_viewed": ["B0044DEDCA", "B00EZT7RE4", "B0044DEDC0", "B004275EO4", "B001D1PWGM", "B004Y0ERRO", "B00E7QA9E0", "B00K1OOGRI", "B0046B9O9W", "B0054L8GVK", "B00030099O", "B005FKT70O", "B009NVS6KS", "B002LM0U2S", "B0000DBMEU", "B004HXGJ3S", "B00DDXOEUS", "B00F7120TQ", "B009WN7QT4", "B008AH9U6K", "B007I58XOA", "B002LITGHM", "B001BS3A3E", "B000095IMS", "B00J2JATL0", "B000W7PNZI", "B0060SXDRI", "B00K85XT8W", "B009ISU33E", "B000IZ96LQ", "B00JKBMXCI", "B000J1F1BI", "B001LIMH6U", "B000KW2YEI", "B00J2JAUXM", "B00K1VAYN6", "B0001OZ2K8", "B006SF68P2", "B001E25KDK", "B009346RSS", "B0027EMHM6", "B00EO6X4XG", "B002651ZNI", "B00GTACPAS", "B009XDWUCQ", "B0045JHJSS", "B000IZAN4K", "B0036VO4X4", "B0036VO4XO", "B00EO6X7PG", "B0006OC16G", "B00ENF7LUA", "B0093L6SCG", "B008XF7IHW", "B007TMZ1MY", "B006W41X36", "B00654PUPA"], "buy_after_viewing": ["B0044DEDCA", "B00EZT7RE4", "B0044DEDC0", "B004275EO4"]}, "title": "Creative Labs USB Sound Blaster X-Fi Surround 5.1 Audio System SB1090", "price": 39.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/418C6fHWDTL._SY300_.jpg", "brand": "Creative Labs", "categories": [["Electronics", "Computers & Accessories", "Computer Components", "Internal Sound Cards"]], "description": "Designed for use with desktop and laptop computers, the Creative Sound Blaster X-Fi Surround 5.1 USB 2.0 Audio System gives your music and movies Xtreme Fidelity. By using a USB 2.0 connection, the X-Fi Surround 5.1 can be connected to virtually any computer. The system delivers full cinematic surround sound, 3-D audio, and realistic environmental effects to your music, movies, and games.Sound Blaster X-Fi Surround 5.1At a Glance:USB 2.0 interface for easy setup and connectionsX-Fi CMSS-3D creates nine virtual speakers when using stereo headphonesX-Fi Crystalizer restores lost detail in compressed music and audioRealistic gaming effects with EAX ADVANCED HDTHX-certified for great cinematic surround-sound experienceA USB 2.0 interface makes connecting the X-Fi Surround 5.1 a breeze.View larger.Versatile USB 2.0 Connection for Easy SetupThe Sound Blaster X-Fi Surround 5.1 connects to your computer via a USB 2.0 connection,including any laptop, desktop, or notebook computer. You don't have to worry about opening up your computer's external casing, and you can even use the X-Fi Surround 5.1 with multiple computers. For exceptional audio, simply connect the system to an available USB port and you're all set.Positional 3-D AudioWhether you're using headphones or speakers, Creative's X-Fi CMSS-3D technology delivers outstanding surround sound. When used with a pair of headphones, X-Fi CMSS-3D creates nine virtual speakers for exceptional surround effects, letting you feel like you're sitting in the best seat of a movie theater. You'll get an advantage during games, too, with the ability to locate enemies by sound before they see you.When used with multichannel speakers, you'll be able to hear exactly where the audio cues are--even between speakers. Voices will be right in front of you and ambient sound will surround you, just like a live performance. CMSS-3D works with both desktop stereo speakers and full surround speaker systems.X-Fi Crystalizer Restores Lost DetailsX-Fi Crystalizer technology restores the audio detail that is lost in compressed audio files so you'll regain vibrancy and clarity in your music and movies. Highs and lows that were lost are enhanced, so whether you're listening to cymbal crashes or wailing guitars, you'll hear the music as it was meant to be heard.Realistic Sound Effects for GamingWith support for EAX ADVANCED HD technology, the X-Fi Surround 5.1 delivers rich environmental effects for an especially immersive gaming experience. You'll hear bullets whizzing by your headand experience explosions that seem to shake the whole room.And if you're using Windows Vista, Creative ALchemy technology restores surround sound to DirectSound3D games for an exceptional gaming experience.Intense Cinematic Sound for MoviesThe X-Fi Surround 5.1 delivers THX-certified surround sound for a cinematic experience right at your computer. Cyberlink PowerDVD software is included (via free download) and supports DTS and Dolby Digital-EX decoding for an unmatched DVD movie-watching experience.System RequirementsMicrosoft Windows 7, Vista, or XP (Professional x64 Edition, Service Pack 2 or Media Center Edition); Intel Pentium 4 1.6 GHz, AMD Athlon XP 2000+, or equivalent processor; available USB port (USB 2.0 recommended); 256 MB RAM (512MB RAM for Windows Vista); 600 MB of free hard disk space; CD-ROM or DVD-ROM drive; headphones or amplified speakers; internet connection to download PowerDVD software.What's in the BoxUSB Sound Blaster X-Fi Surround 5.1 sound card, USB cable, installation CD, Quick Start leaflet, and stereo RCA to 1/8 jack adapterCreative Sound Blaster Sound Cards (External)Looking for internal sound cards from Creative?Clickhere.Sound BlasterX-Fi Go!Sound Blaster X-Fi Surround 5.1General Info:Connection TypeUSBUSB 2.0SNR for Playback>= 96dB100dBSpeaker/Headphone SupportStereoStereo to 5.1Music and Movies:24-bit Sound QualityX-Fi CrystalizerX-Fi CMSS-3DTHX CertifiedDolby Digital Live and DTS Connect (Win Vista Only) EncoderDTS & Dolby Digital Decoding via free PowerDVD DownloadGames:EAX SupportEAX 4.0EAX 4.0X-Fi CMSS-3D Headphone SurroundHardware Accelerated for Better PerformanceHardware OpenAL and DirectSound3D Support64MB X-RAM"}