{"asin": "B001OQC0IO", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "The new SMX-F34 is Samsung's next generation YouTube-compatible compact digital camcorder. Building on the SC-MX20 camcorder, the SMX-F34 offers additional features and functionality, including built-in memory, digital still photo capability, and Samsung&rsquo;s 42x Intelli-Zoom. Significantly more reliable than a standard digital zoom which negatively affects the quality of the image, Intelli-Zoom allows you to go beyond the camcorder&rsquo;s 34x optical zoom without sacrificing image quality.The SMX-F34 features a memory card slot for SD/SDHC and also offers 16GB of internal flash memory. Samsung is the first digital imaging company to apply H.264 compression to standard definition video, which considerably extends record times. Thanks to H.264 compression, users can record up to eight hours of standard definition video directly to the camcorder&rsquo;s internal flash memory without having to rely on a memory card. Samsung&rsquo;s new image processor also reduces power consumption, which translates to longer battery life. On a single charge, consumers can record up to three hours of uninterrupted video -- ideal for when you wish to shoot for extended periods of time.Featuring a high-performance 680K pixel CCD sensor, the SMX-F34 delivers a resolution of 720x480 and also incorporates Samsung&rsquo;s new image processor which drastically enhances the overall digital imaging experience for the end user. Samsung&rsquo;s new image processor yields higher-quality video, 3-D Noise Reduction, Face Detection for up to five subjects, a brighter 2.7 inch LCD display, as well as H.264 compression.The SMX-F34 is also the ideal camcorder for the YouTube videographer. Featuring a Web &amp; Mobile shooting mode, you can set the SMX-F34 to record in the exact format and resolution required by YouTube, resulting in faster upload times. By selecting the Web &amp; Mobile mode, the camcorder&rsquo;s resolution is automatically adjusted to 640x480 (H.264 / AAC / MP4) and optimized for use on Web sites. Furthermore, unlike other camcorders, users can easily import video from the SMX-F34 and play it on MP3 players and other portable multimedia players supporting H.264, without having to convert the files.The SMX-F34 features a dedicated Photo mode that allows consumers to use the camcorder as a digital camera, snapping 800x600 resolution images. The SMX-F34 also offers added flexibility when it comes to zoom. Featuring Samsung&rsquo;s intuitive 42x Intelli-Zoom, users can go beyond the camcorder&rsquo;s 34x optical zoom without sacrificing image quality. When coupled with the camcorder&rsquo;s high-quality, Schneider lens, and improved Advanced Image Stabilization, you can rest assured that you&rsquo;ll be able to capture life the way you see it, with stunning color and clarity.", "title": "Samsung SMX-F34 Flash Memory Camcorder w/16GB Memory &amp; 42x Intelli-Zoom (Black)", "price": 149.99, "salesRank": {"Camera &amp; Photo": 10341}, "imUrl": "http://ecx.images-amazon.com/images/I/418-mA1JqAL._SX300_.jpg", "related": {"also_viewed": ["B00BB4UKOK", "B007261BNU", "B0032UWTGI", "B004H8FNB2", "B00BB4ULZI", "B004HO596K", "B0032UWTIG", "B0032UWTQI", "B006IUV73K", "B004HO596A", "B004H8FN9E", "B0072B5E4M", "B004GKLW70", "B0032UWTMM", "B003DZ122E", "B001QWEZ4S", "B00EI49S3E", "B00DI7B1V4", "B00HNJWWK2", "B003JJEFBY", "B006NT43IW", "B003DZ1224", "B004GKLW84", "B0072B5CNU", "B0084L9ZVM", "B0036VO7FE", "B00127Y984", "B003OR4HOQ", "B00HPZKPX0", "B00114LG7U", "B002FB6380", "B007ROW3KM", "B00DI7B2UY", "B00AR95H7U", "B00AR95FP4", "B008RFA2VW", "B007LK5S0E", "B006K551HQ", "B00HNJWWGG"], "buy_after_viewing": ["B00BB4UKOK", "B003VNKNF0", "B003OR4HOQ", "B0039BPG1A"]}}