{"asin": "B00354NANC", "description": "RAGE&reg; is a groundbreaking first-person shooter set in the not-too-distant future after an asteroid impacts Earth, leaving a ravaged world behind. You emerge into this vast wasteland to discover humanity working to rebuild itself against such forces as bandit gangs, mutants, and the Authority &ndash; an oppressive government regime that has a special interest in you in particular. Featuring intense first-person shooter action, breakneck vehicle combat, an expansive world to explore and jaw-dropping graphics powered by id&rsquo;s revolutionary id Tech&reg; 5 technology, RAGE promises an experience like no other.&ldquo;id once again proves why it runs at the front of the shooter pack&hellip; RAGE is the real deal&rdquo;&ndash;EGM&ldquo;RAGE is set to be one of the most visually appealing games we&rsquo;ve ever seen.&rdquo;&ndash; Joystiq&ldquo;RAGE has absolutely made it onto my &lsquo;most anticipated games&rsquo; list.&rdquo;&ndash; G4TV&ldquo;Cars, guns, gadgets, mutants &ndash; it&rsquo;s hard to figure out what RAGE doesn&rsquo;t have.&rdquo;&ndash; OXM UKPUBLISHER: Bethesda SoftworksDEVELOPER: id SoftwareANTICIPATED RELEASE DATE: 10/4/2011PLATFORMS: Xbox 360&trade; / PLAYSTATION&reg;3 /Games for WindowsGENRE: First-Person ShooterSTORY:Fearing a planet-wide extinction from a massive asteroid headed towards Earth, world leaders are faced with the inexorable task of ensuring human survival. Left with few alternatives, life-sustaining pods filled with select people are buried deep beneath the earth&rsquo;s surface. You are one of the chosen members of these modern day arks and abruptly enter the RAGE universe after surfacing alone. Leaving you to your own devices to stay alive in a world filled with those who prefer you dead, RAGE combines powerful storytelling with heart-pounding action.KEY FEATURES:Visceral 1st-person gunplay and explorationTake on bandit gangs and hordes of mutants using an arsenal of exotic weapons and special items, such as wingsticks, personal turrets, sentry bots, and remote-controlled bomb cars.Frenetic 3rd-person vehicular mayhemBurn rubber across the wasteland in your very own super buggy! Upgrade and customize your car with special parts, paint jobs and weapons, then test your skills as you battle four-wheeling bandit clans and participate in deadly races.Three ways to play for unlimited actionImmerse yourself in a rich story-driven single-player experience, grab a friend for exclusive co-op modes, or go online for all-out multiplayer mayhem.An expansive experienceBeyond the first-person action and vehicle combat, RAGE&reg; offers a world open to explore, with unique characters, side quests, and a compelling storyline.Graphics that have to be seen to be believedPowered by id&rsquo;s cutting-edge new id Tech 5 engine, new Megatexture technology brings the vast wasteland to life in never-before- possible detail with action running at up to an astounding 60 frames per second.images and screenshots &copy; 2011 id Software LLC. All Rights Reserved.About Bethesda SoftworksBethesda Softworks, part of the ZeniMax Media Inc. family of companies, is a premier developer and worldwide publisher of interactive entertainment software. Titles from two of the world&rsquo;s top development studios &ndash; Bethesda Game Studios and id Software &ndash; are featured under the Bethesda Softworks label and include such blockbuster franchises as DOOM&reg;, QUAKE&reg;, The Elder Scrolls&reg;, Fallout&reg;, Wolfenstein&trade; and RAGE&reg;.For more information on Bethesda Softworks&rsquo; products, visit www.bethsoft.com.&copy; 2011 id Software LLC, a ZeniMax Media company. Bethesda, Bethesda Softworks, ZeniMax and related logos are registered trademarks or trademarks of ZeniMax Media Inc. in the U.S. and/or other countries. RAGE, id, id Software, id Tech and related logos are registered trademarks or trademarks of id Software LLC in the U.S. and/or other countries. All other trademarks or trade names are the property of their respective owners. All Rights Reserved.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/61ZaGenQT0L._SY300_.jpg", "related": {"also_bought": ["B003H0CBYS", "B001UWGCW2", "B002DC8GKO", "B003P9FRGA", "B0085CA8QG", "B003O6E67A", "B008E6ZXTA", "B0050SXGU8", "B002BRZ6UE", "B0012N3T3Y", "B002I0JBL4", "B004ML44Y6", "B005C2D1YI", "B0014UGK8G", "B0016GC9D8", "B00170823O", "B000JLIXIG", "B002I0K5NC", "B0050SX2MK", "B00BU3WVM6", "B001NX6GBK", "B00163LW7K", "B0022TNO7I", "B003GT8IL0", "B002BRZ744", "B0050SXX88", "B009JBFF9C", "B000NGP1R8", "B001NIP3EG", "B000SQ5LQE", "B00309XHD0", "B0028IBTLG", "B0065NP05G", "B0056WJA6M", "B00867NC0E", "B002ZJNWWC", "B000WMEEBM", "B000FQBF1M", "B001ASJIRC", "B004PAGJNS", "B000UU7VUC", "B002I0J5UQ", "B003Q55YCU", "B0050SX9VO", "B002I0K6DG", "B00886WO7A", "B004EQCCI4", "B0043M64GK", "B00320JAWY", "B0050SWZHS", "B000RHZ9G6", "B004EW948E", "B00104KCF8", "B001CRM3YQ", "B003O6KWZK", "B001D7T2VC", "B0050SWUTQ", "B003FBL85M", "B002BXKJ6O", "B003O6E6NE", "B002ELCV00", "B000KLNLUK", "B005185SDA", "B00576U7W8", "B00319DX4M", "B0041OWQTO", "B0021TVYCG", "B0012NAPNQ", "B000WS97QI", "B0044SA734", "B0037LVW9M", "B002I0H2G0", "B0076ZQSFI", "B00CWYYLH0", "B004FUI84G", "B00B59L9T6", "B0050SXEM8", "B007CM0K86", "B00198PO5I", "B00269DX5W", "B000JLIYLC", "B002EE1P2W", "B005N4HBIW", "B008CP6MA2", "B000HKMPVA", "B001ASJIS6", "B007TYC8MI", "B0012N94WO", "B00KAED6SY", "B003O6HE0Q", "B005GM3XVA", "B001QXNBNI", "B008XMSR6G", "B0023CBZ70", "B0086V5V8G", "B001TOMQOY", "B0050SXZ7W", "B002I0K7H6", "B000X1TC0U", "B004FS8LYK"], "bought_together": ["B0085CA8QG", "B007CM0K86"], "buy_after_viewing": ["B0085CA8QG", "B0050SXX88", "B00BMFIXKQ", "B008E6ZXTA"]}, "salesRank": {"Video Games": 2756}, "categories": [["Video Games", "PlayStation 3", "Games"]]}