{"asin": "B0012BI26K", "description": "With the n&uuml;vi 800 series, Garmin adds smooth speech recognitionto its bestselling line of sleek portable GPS navigators. As with all n&uuml;vis, you get a slim, pocket-sized navigator with a gorgeous display, detailed NAVTEQ maps that let&nbsp; you search by name for more than 6 million points of interest like stores, restaurants or hospitals, and an easy, intuitive interface. All of the 800-series navigators also feature a rich array of features including spoken directions in real street names, integrated traffic receivers, MP3 player and photo viewer, and an FM transmitter that will play all the n&uuml;vi's audio, including voice prompts, MP3s, audio books, and more, directly through your vehicle's stereo system.&nbsp; The top-of-the-line n&uuml;vi 880 adds Bluetooth for hands-free phone calls, an integrated traffic receiver and enhanced MSN Direct content with traffic data, real-time gas prices, movie times and more.Key Features/BenefitsVoice Recognition -- Just tell it what you're looking for (Learn more)Enhanced MSN Direct Content -- find the cheapest gas nearby, see how fast traffic is moving, get local weather forecasts, event information and more (Learn More)Easy to use interface (Learn More)Integrated Antenna for a slim form factorPre-Loaded Maps for North America with 6 million searchable points of interest (POIs), plus add your own custom POIs (Learn more)Multi-Destination Routing -- tells you the best way to get to a lot of different places in one trip (Learn More)Bluetooth for hands-free phone calling capability (Learn More)FM Transmitter lets you hear spoken navigation prompts, MP3s or audio books through your car's stereo systemWhere Am I? -- instantly shows you all of the emergency services nearby (Learn More)Where's My Car? -- never forget where you parked again (Learn More)Widescreen -- gives you a better idea of what's around you (Learn More)microSD card slot -- store extra maps, travel guides, photos or MP3sPhoto Viewer and MP3 Player (Learn More)Customize Your Onscreen Vehicle Icon (Learn More)Garmin Lock (Learn More) -- keep others from using your navigatorPhoto Navigationlets you upload geo-coded photos from a phone, geo-coding camera or photo site and navigate to them. (Learn more)Send addresses directly to your Garmin fromGoogle MapsorMapquestWhich n&uuml;vi is Best for You?:Click hereto see a quick, simple comparison of features for all Garmin nuvi GPS navigatorsLearn MoreEasy to Use Right Out of the BoxOne of Garmin's key product philosophies is, \"to make extremely complex technology easy to use for anyone right out of the box,\" and perhaps nowhere is that better exemplified than in the user interface for Garmin's portable navigation devices.Garmin's interface is a key to their success and one of the things that makes their devices such a pleasure to use. Simple controls and sub-screens make it easy to enter or search for destinations and get data about your trip.Voice RecognitionUsable voice recognition is something we've been waiting to see for a&nbsp; long time. Reaching over to type out directions on your GPS isn't just difficult, it can feel downright dangerous. There's even a warning on every GPSnotto do it. But who has the time to sit still and punch in a destination? Well, now you can have your hurry and your directions too.The n&uuml;vi 800s aren't the first GPS navigators to offer voice recognition, but the level of flexibility they offer sets a new standard for simple and intuitive use.The device comes with a little remote control that mounts on your steering wheel. It has two buttons. One is, \"listen.\" The other is, \"stop listening\". Hit the \"listen\" button to start voice recognition. Then you can speak any of the words that appear on the display, and the device will understand, or you can ask questions based on most points of interest. Say,\"find nearest Italian restaurant,\"for example, and you&rsquo;ll get a list of nearby spots. Say\"go to\"and name of the one you want, and you get turn-by-turn directions to dinner. The n&uuml;vi 880 also knows the names of many large business brands, so you can just say,\"find place, Starbucks,\"if that's your coffee mojo.Of course, if you know the address you want to go to, you can say that too, and the n&uuml;vi will give you directions, all without having to reach over to the dashboard and touch it.Speech recognition is available for American English, British English, European French, European Spanish, German, Italian, and Netherlands Dutch languages.Enhanced MSN Direct Content (9-month free subscription)An integrated receiver allows you to access enhanced dynamic content from the MSN Direct service. Check the weather, avoid traffic backups, compare local gas prices, get enhanced movie listings, stock information, news and local events when you travel with your unit. Even plan trips from the convenience of your computer, via Windows Live Local, and wirelessly send custom to your n&uuml;vi.Free 9 month trial subscription to MSN Direct services, activation instructions providedMSN Direct Traffic Receiver (GDB 55) included in the boxExtended MSN Direct service subscriptions available for purchase: 12 months for $49.95 + tax (visit MSN for further details)Widescreen -- See More of What's AroundThe super-bright, 4.3-inch (diagonal) touchscreen display gives is anti-glare for ease of viewing during the day and automatically changes its color profile for easy viewing at night or in dim light. It offers 2d or 3D perspective views.The widescreen format gives you 70% more actual screen area than a 3.5-inch screen. Primarily this translates into a better view of the area through which you are driving. This is especially useful in showing you what parks, restaurants, ATM, gas stations, etc. are nearby, or in letting you know whether a detour is a good idea. Also, the device itself is larger, meaning controls on the screen are more widely spaced and somewhat easier to push.Wider screen lets you see more of what's around. Compare these actual size views of a 3-inch (diagonal) screen", "title": "Garmin nuvi 880 4.3-Inch Widescreen Bluetooth Portable GPS Navigator", "price": 79.99, "imUrl": "http://ecx.images-amazon.com/images/I/51nBmpaULpL._SX300_.jpg", "related": {"also_viewed": ["B0057OCDQS", "B001N2MUD4", "B001OMGVII", "B005DIBHA6", "B00AY7NSX0", "B003ZX8B3W", "B00HU7F6PA", "B00AXZWG8Q", "B00HK6CPVY", "B003ZX871I", "B0057ODG6Y", "B004MYFTFG", "B006SOLITY", "B0057ODOCA", "B001PN37LA", "B00AXX0I88", "B00AY7NUW4", "B0011ULQNI", "B001U0O7RG", "B00EE2CKWQ", "B00FMUYYZA", "B005DIBHCE", "B002RL8H1Y", "B002771V48", "B005DIBH6A", "B003ZX8B2S", "B00C9W1LT6", "B00AY7NSTY", "B0057OCS9A", "B00AXX0JP0", "B00AXZY42W", "B005DIBFYE", "B003ZFZ3YU", "B00BIZ0EY8", "B00AY7NV0K", "B0015EWMX8", "B001U0O7QC", "B008K4RT8O", "B003ZX8B1E", "B00AY7NT2U", "B00AXX0JOQ", "B00AXX0I7Y", "B00HVUEGVQ", "B001U0O7SA", "B00AXX0IC4", "B00GRS8NYO", "B00AY7NUYC", "B004MYFTFQ", "B00DW14I66"], "buy_after_viewing": ["B0057ODG6Y", "B0057OCDQS", "B00AXX0I88", "B00AXZWG8Q"]}, "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]]}