{"asin": "B00008SCFL", "categories": [["Electronics", "Computers & Accessories", "Routers"]], "description": ".caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The NETGEAR WGR614 54 Mbps 802.11g Wireless Router offers:802.11g wireless network router for home and office.Four RJ-45 Ethernet ports for wired networking.Configurable network security including double firewall for extra protection.The NETGEAR WGR614 54 Mbps 802.11g Wireless Router lets you easily set up a wireless network in your home so you can share a single internet connection with everyone in your household or office at speeds up to 54 Mbps.The WGR614 offers speeds up to 54 Mbps with the 802.11g wireless standard.View larger.Beautiful Design and Easy SetupThe WGR614 is a very attractive unit about the size of a small paperback with a silver exterior and rounded edges. An included plastic stand lets you stand the router on its edge to take up less space.The WGR614 makes it easy for even a novice to set up a wireless network: just plug the included Ethernet cable from your internet connection into the router and insert the included CD into any computer on the network, which will provide step-by-step instructions. The WGR614 employs a web-based interface for configuration, and the router will automatically do the initial setup by getting your DNS settings and determining your IP address. The firmware is also upgradeable via the web interface so you can be sure your router will always be up-to-date.Fast and SecureSupporting the 802.11g standard, the NETGEAR WGR614 offers wireless data speeds of up to 54 Mbps, making it possible to share a broadband internet connection, stream music without hiccups, watch videos with less load time, and videoconference without problems. Downloading files is up to five times faster than it was with 802.11b. If you still have computers that use 802.11b, don't fret as the router is backwards compatible with the older wireless standard and can be set so all your computers can connect to the network and the WGR614 will automatically figure out the connection type and work accordingly.In addition to wireless access, there are four 10/100 Mbps RJ-45 Ethernet ports in the back for connecting computers to the network via a faster, wired connection.The WGR614 offers many security options to ensure your data is private. Double firewall protection keeps your network shielded from outside attacks. To ensure the security of your wireless data, both 40/64-bit, 128-bit, and 152-bit (802.11g only) WEP encryption is available, as well as WPA (Wi-Fi Protected Access). You can also use MAC address authentication to allow only authorized users onto the network.Keep Tabs on KidsThis router is an especially good choice for parents as it allows settings to log all sites that are visited, lets you block specific sites based on whether it contains specific keywords, and lets you set time schedules for certain computers to work.The NETGEAR WGR614 54 Mbps 802.11g Wireless Router is backed by a 1-year warranty.What's in the BoxWGR614 54 Mbps 802.11g Wireless Router, power adapter, Ethernet cable, setup CD, vertical stand, warranty/support information card.", "title": "Netgear WGR614 Wireless-G Router", "price": 63.99, "imUrl": "http://ecx.images-amazon.com/images/I/316aUZ4HFPL._SY300_.jpg", "brand": "Netgear", "related": {"also_bought": ["B000JV9LUK", "B004H1PMJC", "B002M3SHXA", "B00DMH1XL8", "B0028N6VNW", "B001AZP8EW", "B0009IRUKG", "B001UI4RTG", "B003B48UNG", "B0009N544A", "B006GDTTM0", "B002VJL0OS", "B002V41X2M", "B004N6259Q", "B004XC6GJ0", "B004N6259G", "B00894WP4S", "B0085MRFVW", "B00000JDF5", "B006UK3K06", "B008I646WG", "B00002EQCW", "B0000BVYT3"], "bought_together": ["B000JV9LUK"], "buy_after_viewing": ["B001UI4RTG", "B004XC6GJ0", "B001FWYGJS", "B002RYYZZS"]}}