{"asin": "B000MF7L50", "description": "Now you can easily receive door-to-door directions while staying on top of the weather, traffic and other localized information with the new Garmin StreetPilot c580 Auto Navigator with MSN Direct. The StreetPilot c580 comes loaded with convenient features such as hands-free calling, preloaded maps and an MP3 player, and then on top of all that provides you with dynamic content from MSN Direct.The new StreetPilot c580 lets you get localized information with dynamic content from MSN Direct, making it one of the most resourceful navigators available. Using the included receiver and free trial service to MSN Direct, you can check your local weather, avoid traffic backups, compare local gas prices, and even check movie times and locations, all while you travel. Easy and virtually fool-proof to use, the MSN Direct receiver is plug-and-play portable so you can quickly connect to your navigator unit when you are out and about.Despite being loaded with features, the StreetPilot c580 still allows you to navigate with ease. This unit comes ready to go right out of the box with preloaded NavTeq City Navigator NT street maps, including a hefty points of interest (POIs) database with hotels, restaurants, fuel stops, ATMs and more. Simply touch the super-bright, sunlight-readable color screen to enter a destination, and the c580 takes you there with either 2D or 3D maps and turn-by-turn voice directions. This navigator voice even announces the name of exits and streets so you never have to take your eyes off the road, and can concentrate on your driving to keep yourself and your loved ones safe. In addition, the c580 accepts custom points of interest (POIs), such as school zones and safety cameras, and lets you set proximity alerts to warn you of upcoming POIs that require your special consideration such as speed zones and safety cameras.Speaking of keeping you safe, the StreetPilot c580 lets you make hands-free calls so you can talk freely during your worry-free driving. By integrating Bluetooth wireless technology with a built-in microphone and speaker, you can pair your c580 with any compatible Bluetooth phone and talk hands-free while staying focused on the road. You no longer have to fumble with your phone's handset to answer a call or dial a number, just tap the c580's screen and you're instantly connected. And with 1-touch dialing for your POIs, you can quickly and conveniently call ahead to make reservations or get needed information.Completely portable, the StreetPilot c580 conveniently moves from vehicle to vehicle with an easy, adjustable mount. This navigator has a compact size that makes it convenient to take along on business trips or use in rental cars, and also comes with a rechargeable lithium-ion battery for out-of-car route planning.In addition to all of this functionality, the StreetPilot c580 is packed full of other features that make it the perfect navigator. Its high sensitivity, WAAS-enabled GPS receiver acquires satellites quickly and maintains signals even under heavy foliage or near skyscrapers. This unit also comes with an MP3 player so you can take your favorite music with you, Garmin Lock as an anti-theft feature to keep you investment safe, and configurable vehicle icons that let you select car-shaped graphics to show your location on the map. What's more the StreetPilot c580 allows you customization via optional software such as Travel and Savers guides on plug-and-play SD cards.The c580 lets you view, navigate and operate it via its anti-glare, bright color display through its fingertip touch-screen interface, which measures 2.8 x 2.1 inches (W x H), and has a resolution of 320 x 240 pixels. As a whole, the c580 measures 4.4 x 3.2 x 2.2 inches (W x H x D), and weighs only 9.0 ounces. The rechargeable lithium-ion battery that comes with this unit provides you with an on-the-go battery life of eight hours.What's in the BoxGarmin StreetPilot c580, City Navigator NT maps for North America (preloaded, full coverage), MSN Direct receiver with integrated vehicle power cable, 1 year of free MSN Direct service, vehicle suction cup mount, dashboard disk, USB cable, carrying case, and quick reference guide, and owner's manual.Notice: MSN Direct service will be available only until January 1, 2012.", "title": "Garmin StreetPilot c580 3.5-Inch Portable GPS Navigator with MSN Direct", "price": 11.99, "imUrl": "http://ecx.images-amazon.com/images/I/41bvsV8-S2L._SY300_.jpg", "related": {"also_viewed": ["B0057ODOCA", "B0007LJHVA", "B000OH63MI", "B0057OCS9A", "B003HNTJZO", "B007M52QR6", "B000F78582", "B00AXX0I7Y", "B000PCBVA6", "B00AY7NSTY", "B00AY7NUW4", "B0057ODG6Y", "B0057OCDQS", "B00HU7F6PA", "B002PNWFXA", "B00AXX0I6A", "B005VZT3HU", "B0027NTYD2", "B005DIBHA6", "B001U0O7QC", "B005DIBHCE", "B00AXZY42W", "B00AXZWG8Q", "B00AXX0JOQ", "B00AY7NUYC", "B00AXX0IEC", "B00AXX0IC4"], "buy_after_viewing": ["B0027NTYD2", "B0057ODG6Y", "B000F78582", "B0057OCDQS"]}, "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS"]]}