{"asin": "B003VTZ0DY", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Cables & Interconnects", "USB Cables"]], "description": "Compliant to USB 3.0 SuperSpeed specifications; extend your USB 3.0 connection! Just plug-and-play for hard drive enclosures, printers, modems, cameras, and other SuperSpeed USB peripherals. This cable provides a transfer rate of up to 4.8 Gbps when connected with a USB 3.0 compliant host and device. Foil and braid shielding reduces EMI/RFI interference and twisted pair contruction helps reduce crosstalk thus ensuring SuperSpeed, error-free data transfer. Protective overmolded connector is color-coded blue to highlight USB 3.0 connectivity compatibility. Please Note: USB 3.0 (4.8 Gbps) provides TEN TIMES the capability of USB 2.0 (480 Mbps); it also provides up to 900 mA power instead of the 500 mA available with USB 2.0. Type A connections are backwards compatible to USB 2.0 and even USB 1.1. Finally, while USB 2.0 cables will work with USB 3.0 devices (at the lower USB 2.0 transmission speed and power), you won't enjoy the SuperSpeed of USB 3.0 without connecting with USB 3.0 cables! PC and Mac compatible. USB 3.0 technology provides 4.8 Gbps. Backwards compliant with high speed USB 2.0 devices (480 Mbps) as well as USB 1.1. Great for applications requiring SuperSpeed data bandwidth. In order to receive the benefits of the USB 3.0 specification, the source and device must be USB 3.0 compliant. Warranty: Lifetime", "title": "C2G / Cables to Go 54177 USB 3.0 A Male to Micro B Male Cable, Black (2 Meter/6.5 Feet)", "price": 5.84, "imUrl": "http://ecx.images-amazon.com/images/I/41lHS6%2BmUJL._SY300_.jpg", "brand": "C2G", "related": {"also_bought": ["B003VTZ0D4", "B009AR2MD2", "B003VTZ0AW", "B005HMKKH4", "B002UHJ1II", "B003KGBBRW", "B005HVPYNU", "B008EQZ25K", "B003YNS0SY", "B002XVVIQE", "B003VTZ07U", "B00B7FOQCK", "B005AS337Y", "B003YNS0W0", "B002R9CQYK", "B00B3P15M8", "B00505EZZ6", "B00B7GAE98", "B00DDK1QUC", "B003VTZ070", "B006Y5UV4A", "B005H3Q55E", "B00B9KOCYA", "B00829THLE", "B008ZGKWQI", "B00821FDI8", "B008EQYRRY", "B0064QP554", "B0056TYRMW", "B0042Z55RM"], "bought_together": ["B003VTZ0D4", "B005HMKKH4"], "buy_after_viewing": ["B003VTZ0D4", "B008EQZ25K", "B00BCY1AA2", "B005H3Q57M"]}}