{"asin": "B0000AOWVP", "description": "Add wireless freedom, stylish looks, and one-touch features to your desktop with the Wireless Optical Desktop Pro keyboard and mouse combination. This desktop package features customizable keys, optical mouse technology, and a comfortable, ergonomic design. The Wireless MultiMedia keyboard's split, gently sloped shape encourages a natural hand, wrist, and forearm position for maximum comfort. Also, your digital media activities are within easy reach--start, play, and navigate music and video clips with the touch of a button. Customizable hot keys let you quickly start Messenger, Mail, Internet, and Calculator programs. And get one-touch access to files stored in the My Documents, My Pictures, and My Music folders in Windows. Perform common tasks right from your keyboard--press a button to open, close, and save documents, send and forward e-mails, put the computer to sleep, log off, and more. Press the F LOCK key to toggle between standard and enhanced function key commands.The mouse's wider, clear scroll wheel allows you to comfortably move through documents and Web pages quickly without clicking the scroll bar. Accelerated scrolling reacts to how quickly you roll the wheel, saving you time and effort. And the optical sensor replaces your mouse ball, for accuracy and precision--no mouse pad needed. It's ambidextrous, too--whether you control it with your right or left hand, the wireless optical mouse is shaped for comfort.Both the keyboard and mouse work within six feet of the included receiver, even if your computer is out of sight. The pair comes with a three-year warranty.", "title": "Microsoft Wireless Optical Desktop Pro v2.0", "price": 330.0, "imUrl": "http://ecx.images-amazon.com/images/I/41HGB6A7T2L._SX300_.jpg", "related": {"also_viewed": ["B000Q6UZBM", "B00CYX54C0", "B000A6PPOK", "B004SUIM4E", "B00CIZPXRU", "B0002CE0XO", "B0076KQRXG", "B000CR1V5O", "B0002CE0XY", "B000TKHGL2", "B0000642RX", "B002JCSCYS", "B00CYX26BC", "B003VAHYNC", "B007BPKHJ6", "B005CMQIVG", "B000GAMMBO", "B0076KUTKS", "B00CYX53QW", "B000TUK47U", "B002MMY4WY", "B004E2PIV6", "B001DJ9GOS", "B008OEHS04", "B004XLA1R4", "B000MQYBTI", "B002XK7T6I", "B000T9B6D2", "B0036E8V08", "B003UNOZVE", "B000H14IDC", "B001B8EUEW", "B007W7UZGS", "B005RCVNJ8", "B000LVJ9W8", "B00HF5GMXC", "B000AB2FR0", "B004E2P5VO", "B002VR6A9K", "B001B8EOMU", "B005MJDYTS", "B005ZLTNN4", "B000KA7PD0", "B005HU0LX4", "B00BIFNTMC", "B000H12IAC", "B0052J98AC", "B0011FQUQG", "B005RCV9Q0", "B00D68ZVY8", "B0011FHSGW", "B000BH4G4S", "B004V94F5C", "B006HIFZMW", "B004SUO1R6", "B0009ZBRS0"], "buy_after_viewing": ["B000Q6UZBM", "B003VAHYNC", "B00CYX54C0", "B000A6PPOK"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Keyboard & Mouse Combos"]]}