{"asin": "B001TUYTZM", "description": "The small Intuos4 pen tablet is perfect for limited desktop areas or for those who want a highly portable, professional level tablet that fits comfortably in a laptop bag. To achieve its compact size, the small size has two fewer ExpressKeys than all other sizes of Intuos4 pen tablets, and no illuminated displays. Instead of the illuminated displays, a \"show settings\" ExpressKey function provides an on-screen, pop-up display showing the ExpressKey configuration.Like all Intuos4 tablets, the Intuos4 small features Wacom's new tip sensor technology to deliver an even finer level of control.  You can initiate pen pressure control with only a single gram of pressure and a feather-light touch.  With 2048 levels of pressure sensitivity and realistic pen tilt recognition, the Intuos4 pen simulates like never before the natural feel and accuracy of working with traditional brushes, pens, and markers.Professional photographers, designers and artists agree: Intuos4 pen tablets speed production time for photo editing, design and art creation. When working with digital assets, there isn't a more natural tool than a pen for increased comfort and control.Intuos4 redefines the Intuos pen tablet experience, thanks to a new design and new features inspired by members of our professional creative community.What's New with Intuos4Slightest NuanceFeaturing Wacom's new Tip Sensor, Intuos4 now captures the slightest nuance of pen pressure, starting with only a single gram of force.Switches, Where You Want ThemUser-defined switches are preset to \"right-click\" and \"double-click\" or can be set to your most commonly used functions.Working Under PressureWith 2048 levels of pressure sensitivity, Intuos4 gives you the creative power to dynamically adjust exposure, brush size, line weight, opacity, and more.Ergonomic AhhhsIntuos4 is the most comfortable Intuos tablet yet. The slim-profiled tablet has gently sloping, easy glide palm rests that provide complete support for working on all areas of the tablet.Natural FeelThe Intuos4 Grip Pen features a new contoured barrel designed to minimize grip effort, reduce stress to your hand and wrist, and otherwise emulate the feel of your favorite writing instrument.Peek InsideThe new pen stand not only functions as a convenient pen holder, but also provides a handy twist-off storage compartment containing pen nibs and a pen nib removal tool.Who Says You Can't Take ShortcutsSet up your ExpressKeys to activate your own unique, time-saving shortcuts and modifiers in each of your applications.See your settings change in the illuminated display areas as you switch between applications.Your Settings at a GlanceOn the Small tablet, just press the default ExpressKey to display the settings on screen.A Turn for the BetterThe finger-sensitive Touch Ring provides intuitive control of scrolling, zooming, brush size, canvas rotation or layer selection. A central toggle button allows you to control up to four different functions in each application.Software, No LessIntuos4 owners are entitled to download their choice from a selection of titles by industry leaders such as Adobe&reg;, Autodesk&reg; and Corel&reg;.ReversibleThe innovative, ambidextrous design of Intuos4 allows you to maximize the productivity of both your hands. Having the ExpressKeys and Touch Ring on the same side of the tablet ensures that they are perfectly positioned for use with the hand that is not holding the pen.Many AccessoriesTo complement your Intuos4, choose from a variety of accessories including the Grip Pen, the Classic Pen, 6D Art Pen, Airbrush, Inking Pen, Pro Accessory Kit and more.Use your Intuos4 tablet's new features:Quickly and professionally edit photos and create digital artwork with natural pen controlNew pen tip sensor technology lowers activation force and captures every nuance of pen pressure2048 levels of pen pressure sensitivity for precise pressure controlUser-defined ExpressKeys&#153; & multi-function Touch Ring put time saving shortcuts, modifiers, scrolling, zooming, and more at your fingertips.Custom radial menus for rapid navigationNew Precision Mode simplifies detail workWhat's in the BoxIntuos4 small pen tablet, Intuos4 Grip Pen, Intuos4 mouse, pen stand, ten replacement nibs (five standard nibs, one flex nib, one stroke nib, and three hard felt nibs), nib extractor, 2.5m USB cable, Quick Start Guide, installation CD (includes tablet driver software and electronic user manual)", "title": "Wacom Intuos4 Small Pen Tablet", "price": 227.17, "imUrl": "http://ecx.images-amazon.com/images/I/21sgNIvpSCL._SX300_.jpg", "related": {"also_bought": ["B003ICXCWA", "B002BH4QAA", "B004XTWTUI", "B005KB8H7M", "B003JZNZQY", "B003JZNZR8", "B008I648B0", "B0076HMDQO", "B003IZHG6K", "B008TN81ZG", "B00BBQ8IDS", "0615272819", "B00ANH074Y"], "buy_after_viewing": ["B00EN27U9U", "B00EN27ULS", "B0076HMDQO", "B00EN27SHY"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Input Devices", "Graphics Tablets"]]}