{"asin": "B001E78UQY", "description": "Manufacturer's Description (April 9, 2009)The Haier HLT71 portable LCD TV gives you the ability to enjoy your favorite television programs anywhere, any time--in your home or away. Watch the morning news without having to get out of bed, or while sun bathing in the back yard. Does someone else have dibs on the TV room? Pull out your HLT71, and you've got your own TV room. This handy little portable TV has a 7-inch LCD screen that switches between a 16:9 and 4:3 aspect ratio. It has a built-in ATSC/NTSC tuner with detachable antenna enabling you to receive crisp reception of your favorite channels - even after the digital-to-analog switch in June 2009. The HLT71 connects to other devices with an audio/video jack and coaxial output. Watch with others using the built-in twin speaker system, or plug your headphones into the included jack to enjoy your favorite programs without disturbing those around you. The rechargeable Li-polymer battery offers up to 2.5-hours of life between charges -- enough time to watch an entire movie or several episodes of your favorite show without a recharge. The HLT71 includes an AC power adapter, a car adapter and a Remote Control.Note:Reception of over the air signal depends on your location. Lack of reception does not indicate a defective product, but merely a weak transmission signal. Try moving the unit to another location, or connecting to cable, satellite, external or an indoor antenna", "title": "Haier HLT71 7-Inch Handheld LCD TV (2009 Model)", "price": 76.99, "imUrl": "http://ecx.images-amazon.com/images/I/41CltfEj8sL._SX300_.jpg", "related": {"also_bought": ["B002AR6258", "B001U5XLIC", "B003KV3R1K", "B001W8WEGC", "B0079U1N00", "B007FEEZ00", "B006L1V9S4", "B000RKN4OM", "B0041I8UAO", "B000CNPK3M", "B0051YCQ8E", "B005005EEM", "B000YB862E"], "buy_after_viewing": ["B007FEEZ00", "B001U5XLIC", "B002G0PYEE", "B00DTZNCCQ"]}, "categories": [["Electronics", "Portable Audio & Video", "Portable & Novelty TVs"]]}