{"asin": "B0038W0N8G", "description": "When you need a compact stereo system for your iPhone or iPod, but still want exceptional sound quality, Altec Lansing has you covered with the iMT320 inMotion Compact. The inMotion Compact folds as small as a book for easy portability, and it packs a punch with dual drivers that deliver rich, well-balanced sound whether you're at home or on the road.The inMotion&#0174; iMT320At a Glance:Dock is compatible with the latest iPhone and iPod models.Compact design for great portability.Elegant cover protects the speakers and doubles as a stand.Vivid audio and powerful bass.The inMotion Compact folds as small as a book for easy portability.Compact Stereo System for iPhone and iPodThe inMotion Compact is the smallest member of Altec Lansing's inMotion line. When folded, it's as slim as a book, so you can easily take it with you and enjoy the music of your iPhone or iPod wherever you are. The inMotion Compact also features a distinctive design with an attached wrap-around cover. The soft, luxurious cover protects the speakers and also doubles as a stand.For added convenience, push-button volume controls are integrated directly into the speaker's design.Get Outstanding SoundThe inMotion Compact delivers outstanding sound for your iPhone and iPod. With dual drivers and front firing ports that provide enhanced low-frequency sound, the iMT320 delivers a rich audio experience everywhere you go.The inMotion Compact features a dock that is compatible with the latest iPhone and iPod models, including the iPhone 3GS. It also features \"Works with iPhone\" certification, which means that the music will pause automatically when you receive a call. You won't have to switch your iPhone to airplane mode to get exceptional audio, nor will you have to worry about the annoying GSM buzz that you often get from other speakers.Auxiliary Input Jack for Connecting Other DevicesIf you have other devices that you'd like to use with the inMotion Compact, the integrated 3.5mm input jack lets you connect a second device, such as a computer, CD, DVD, or MP3 player.Runs on Either AC Power or BatteriesWhether you're listening to music at home or on the go, the iMT320 will keep you rocking. The iMT320's universal dock will recharge your iPod or iPhone while you're listening to music, and it can be powered by either an AC adapter or four AA batteries (not included) when an outlet is not available.About Altec LansingFor more than 70 years, audiophiles have recognized Altec Lansing as one of the world's most valuable and innovative audio brands. Headquartered in Milford, Pennsylvania, the company boasts a unique history of innovation that includes the introduction of first talkie film speakers, the first iPod docking station, and the first \"Works with iPhone\" speaker system. Altec Lansing makes a wide range of audio systems for the home and office, a line of headphones for personal listening, and the popular line of inMotion speaker systems for portable digital players.The iMT320 inMotion Compact is backed by a one-year limited warranty.What's in the BoxThe inMotion Compact speaker system, miscellaneous adapters for iPhone and iPod, AC power adapter, andquick connect guide.", "title": "Altec Lansing IMT320 30-Pin iPod Speaker Dock", "price": 69.0, "imUrl": "http://ecx.images-amazon.com/images/I/417ziDJO0iL._SY300_.jpg", "related": {"also_bought": ["B0081OKNVI", "B0086T8DEW", "B009C7HGE0", "B00007KDX6", "B001F7AHOG", "B002I636XM", "B005UNFRU0", "B000HDONV2", "B004LTEUDO", "B0097BEE9Q"], "buy_after_viewing": ["B002I636XM", "B003VANOI6", "B003SX0NG2", "B007JCNOHI"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}