{"asin": "B003XDU2Y0", "categories": [["Electronics", "Camera & Photo", "Tripods & Monopods", "Complete Tripods"]], "description": "DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\"vanguard_aplus_html_templateQuite possibly the most flexible tripod/ball head pair in the world, Alta Pro 263AGH is everything you need for out-of-this-world photography. Voted Best Accessory 2010 by the Technical Images Press Association (TIPA), Alta Pro tripods have unmatched versatility and stability, enabling more angle possibilities than ever before. This kit also comes with VANGUARD&rsquo;s GH-100 pistol grip-style ball head, which allows for 360-degrees of panning movements, as well as -32 to +90 degrees of side-to-side tilt and -8 to +0 degrees back-to-front tilt movement all around.VANGUARD Alta Pro 263AGH Lightweight Aluminum Tripod with GH-100 Pistol Grip Ball Head HighlightsWhat&rsquo;s your angle?Alta Pro enables more angle possibilities than ever before. Its innovative Multi-Angle Central Column (MACC) System allows users to move the central column from zero to 180-degree angles in variable vertical and horizontal positions, making macro-photography and special wide-angle shots a breeze. The Instant Swivel Stop-n-Lock (ISSL) System securely repositions the central column in one quick, simple movement while maintaining the tripod&rsquo;s stability. Its legs are also individually adjustable to 25, 50 and 80-degree angles, making it perfect for macro photography, uneven terrain and even more creative freedom.Unshakable foundationAlta Pro features solid-yet-lightweight aluminum alloy legs with quick flip-leg locks, patented premium magnesium die-cast canopy and a hexagon-shaped central column for extra stability. It also has non-slip, spiked rubber feet for changing terrains and a removable hook for hanging camera accessories or additional weight for even more stability.Get a gripWhat&rsquo;s more, Alta Pro 263AGH comes equipped with VANGUARD&rsquo;s innovative GH-100 pistol-grip style ball head. With ball head precision and an ergonomic, grip style handle, you can position your camera however you want with one hand, freeing you to make camera adjustments with your other hand. By setting GH-100&rsquo;s Friction Control, you can lock in your gear, and then quickly release it by depressing the trigger mechanism. GH-100 also gives you 360-degrees of full panoramic positioning with a 72-point click system in 5-degree increments. GH-100&rsquo;s handle itself can also be rotated to any of eight positions, giving you complete control over your gear.Other highlightsLightweight aluminum alloy legsIncludes tripod bagBubble level on GH-100Great for macro photographyProduct specificationsExtended Height: 68.5 inchesMinimum Extended Height: 56.125 inchesMacro Height: 10.375 inchesFolded Height: 28.5 inchesWeight: 5.84 lbsMaximum Loading Capacity: 13.2 lbsNumber of Sections: 3Diameter of Leg: 26mm", "title": "Vanguard Alta Pro 263AGH Aluminum Tripod with GH-100 Pistol Grip Ball Head", "price": 199.99, "imUrl": "http://ecx.images-amazon.com/images/I/41KfQ%2BhGRPL._SY300_.jpg", "brand": "Vanguard", "related": {"also_bought": ["B004G736N6", "B001DQRB9I", "B00017LSPI", "B00BXA7N6A", "B002DW99H8", "B002ZIMEMW", "B0049XGNKK", "B0080JH3YE", "B005FRI50K", "B00551636O", "B009SJ7UWU", "B00JQ4HZPO", "B00FP1BQ1Q", "B001F6TXME", "B00BP1W52Y", "B005KEL4NI", "B00004ZCI3", "B00HTWFB6U", "B007NDL56A", "B00004WCID", "B00HVTSTI8", "B0000BZL8H", "B007L44LBW", "B0045KGZOG", "B00007EDZG", "B0076BNK30", "B001KELVS0", "B003TYDBYQ", "B00419A8P8", "B0099Y21ZA", "B003Y30334", "B008RBD2YA", "B00009XVCZ", "B002NEGTSI", "B003WGNPKQ", "B004MD13YI", "B0093AMVEG", "B00HS8ZFXO", "B000A40M22", "B0062W02C6", "B0037NX6JY", "B00908IFAU", "B00EE1ZH6I", "B002KDS2F0", "B00004ZCJM", "B0083Z6R4W", "B003L1ZYZ6", "B008525TFQ", "B0034WR19Y", "B008XW7T8I", "B002K42W4Q", "B0095ZKUD8", "B004BFXBXI", "B004YW79F4", "B00FN10ALA", "B004TGZ7WM", "B00GUQJZCW", "B005RG99OU", "B007FH1KX2", "B00004X10B", "B004BFZHO4", "B00G9G76PQ", "B0099SGFZI", "B007FEFQDA", "B00BCEJ0E0", "B00CH6ATMO", "B007M54E1M", "B0006ZSR40", "B00CYVNX0W", "B001KNP3MQ", "B00796I546", "B0090BSSZO", "B001S2PPT0", "B000EOSHGQ", "B00FFZM8RI", "B00AJD15PC", "B008FBMSWY", "B005TFU8CG", "B00827MK3S", "B003QA0MWW", "B0034WR71G", "B00004ZCIC", "B0048IW030", "B005XOIFNW", "B0000BZL47", "1285084535", "B002S9KDKS", "B0092TMFTO", "B0000BZLAC", "B004AZ38Z0", "B00F5UY9XE", "B009B0MZ8U", "B00021EE4U", "B00IAYFD0K", "B007FGYZFI", "B009EM694G", "B003G40EGC", "B003UOIMAS", "B00009UTL1"], "bought_together": ["B004G736N6", "B001DQRB9I"], "buy_after_viewing": ["B003WKOENO", "B003XDU2XQ", "B003SQEAY0", "B003BQ1D4C"]}}