{"asin": "B002MAPS6W", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]], "description": "There's so much more to love when you play with a SanDisk Sansa Clip+ MP3 player. With eight gigabytes of storage, this tiny player lets you listen to up to 2000 songs in stunning audio quality. It boasts a wide array of outstanding features, including an FM radio, long-life battery, and integrated voice recorder. And with its expandable memory card slot, you can add pre-loaded microSD, slotRadio or slotMusic cards, so you can listen to your favorite music, podcasts and audio books without having to access a computer or wait for downloads.SanDisk Clip+ MP3 PlayerAt-a-Glance:Easy-- Large OLED screen makes it easy to choose songs and playlists.Tiny-- Ultra-compact design with integrated clip makes it easy to take everywhere  you want to go.Expandable-- In addition to the internal storage, a memory slot lets you add a microSD, microSDHC, slotMusic, or slotRadio card for more music options.An expansion card slot lets you easily add more music. (Blue version shown.)View larger.The Sansa Clip+ MP3 Player plays MP3, WMA, secure WMA, Audible, Ogg Vorbis, and FLAC music files.View larger.Tiny MP3 Player with Big SoundBrought to you by SanDisk, the global leader in flash memory cards, the Sansa Clip+ MP3 player offers distinctively big sound and a wide array of features packed into a tiny, ultra-compact design.The Sansa Clip+ MP3 player, recipient of an August 2009 CNET Editors' Choice award, is built to bring your music to life. The player features solid-state flash memory for skip-free playback, making it ideal for working out with, and with MP3 quality for a rich, full-bodied sound. Whether you're a jazz aficionado or a classic rocker, the Sansa Clip+ MP3 player will ensure that your music comes through loudly and clearly.The Sansa Clip+ MP3 player supports the most popular audio formats, including MP3, WMA, secure WMA, Audible, Ogg Vorbis, and FLAC.Expandable Memory Slot for slotMusic and slotRadio CardsThanks to the Sansa Clip+ MP3 player's expandable memory card slot, you don't have to rely on your computer or the Internet to listen to the music you love. Simply insert a preloaded microSD or microSDHC card, and you'll be ready to play music, podcasts, or audio books in seconds--with no waiting for downloads and no computer required.You can also use the memory slot to add slotMusic or slotRadio cards for even more music options.  slotMusic and slotRadio cards let you instantly enjoy your favorite music without being dependent on a computer or Internet access.slotMusic cards include a full album of your favorite artist and have plenty more room to add music from your own music library. Simply choose your favorite artist and slotMusic cards will give it to you straight from the package to your eardrums.And with select slotRadio cards, you'll get 1,000 songs&Dagger; preloaded onto a card. Each card features handcrafted playlists and hundreds of artists from top music charts. Whether you want Rock, Hip-hop, Country -- there's a slotRadio card that will get you movin' and groovin'.(Note: microSD, microSDHC, slotMusic, and slotRadio cards are sold separately. Visit sandisk.com for details about slotMusic and slotRadio cards.)The Clip+ comes in three colors.(Click your favorite.)Just Clip and GoEverything about the Sansa Clip+ MP3 player is designed with your active lifestyle in mind. About the size of a matchbox, it weighs less than an ounce and features an integrated clip that secures firmly to your clothing for easy, hands-free portability, making it the ideal MP3 player to take on your morning runs or afternoon workouts.A large, bright, easy-to-read OLED screen and searchable menus make it easy to choose playlists or songs, while the long-life rechargeable battery offers up to 15 hours&dagger; of continuous playback.In addition to all the great digital music features, the Sansa Clip+ MP3 player includes an integrated digital FM tuner with 40 presets for listening to sports, talk radio, or your favorite music stations at the gym. It also has a built-in microphone for recording your latest and greatest thoughts on the go.The Sansa Clip+ MP3 player is backed by a limited one-year warranty.What's in the BoxSansa Clip+ MP3 player, USB 2.0 transfer cable, earphones, and quick-start guide.Sansa Clip+ MP3 Player CapacityCAPACITY8 GB*Up to 2000 songs**Based on 3.5 minute songs4 GB*(Black,Blue,Red)Up to 1000 songs**Based on 3.5 minute songs2 GB*Up to 500 songs**Based on 3.5 minute songs* 1 gigabyte (GB) = 1 billion bytes. Some capacity not available for data storage.** Approximations: results will vary based on file size, resokution, compression, bit rate, content, host device, pre-loaded files and other factors. See www.sandisk.com&dagger; Based on continuous playback at 128kbps MP3; actual life and performance may vary depending upon usage and settings; battery not replaceable.&Dagger; These slotRadio cards contain songs pre-programmed in music playlists for unlimited playback with slotRadio card compatible devices only. Visit slotRadio.com for slotRadio compatible devices. Much like radio, these songs are played in sequence and cannot be rewound or re-arranged, yet individual songs can be skipped as often as you want. Song and playlist files cannot be copied or viewed (for example on a PC).", "title": "SanDisk Sansa Clip+ 8 GB MP3 Player (Black)", "price": 64.99, "imUrl": "http://ecx.images-amazon.com/images/I/41CLr7EAH0L._SY300_.jpg", "brand": "SanDisk", "related": {"also_bought": ["B001BFLS4U", "B002ODQJKQ", "B002W9GN12", "B002Y32Z2C", "B003VKZEL6", "B002Y32Z8G", "B002YFY4Y2", "B002Y3139I", "B002XATU5Q", "B002W9NEA0", "B00168NF7U", "B00IKMM972", "B002Y32Z5O", "B002YFUN56", "B009QZH7BU", "B001HLFAD8", "B002YFY4YC", "B000BFHWXM", "B000IMYAVU", "B00APVAPEK", "B00APVAO3C", "B002VC3K5C", "B002V8M6HO", "B003EM8008", "B005DHKRVC", "B009QZH7D8", "B001BCFL5U", "B00APVAOQE", "B004G7D0EG", "B005ZMF6RU", "B005ZUNW46", "B007KFXIDE", "B00HCMZ2SE", "B00488G6P8", "B005FVNH04", "B007KWBOXI", "B005HJWWW8", "B00DYQYLQQ", "B005ZMHIJE", "B00479SVBU", "B009PNXZFA", "B003CJTR82", "B000WH6H1M", "B0012Y2LLE", "B000IG66VS", "B00ECQUY2M", "B008SFSIXU", "B003ZUGKHY", "B004G60AD6", "B007ZN5MNA", "B00CCMKPO0", "B00JQI6C72", "B001F6YRNO", "B0015AFVBC", "B0038W0K2K", "B004JRYLG4", "B007XZM6VG", "B009QZH6JS", "B005FVNGZK", "B003WGJYCY", "B001FOSX9U", "B005FVNGRS", "B00DYQYLP2", "B004S464WM", "B00004T8R2", "B004LTEUDO", "B00200K1TS", "B008EODGHS", "B00FPOCE4G", "B001UEBN42", "B003DKL57G", "B008YFWH3G", "B004HHICKC", "B0054IGXDQ", "B00D42A16E", "B004VGIGVY", "B004WODP20", "B00AQIULD2"], "bought_together": ["B002ODQJKQ"], "buy_after_viewing": ["B009QZH7BU", "B009PNXZFA", "B005FVNH04", "B003ZUGKHY"]}}