{"asin": "B00IP8IBYG", "description": "Interface:5V/2.4A USB Charging Port, Intelligent Charge; Output: 5V/2.4AThe perfect companion for mobile powerOur mobile USB charger is the best alternative to charge electronic devices such as iPad, iPhone, other cellphones and anything with USB charging mode! The smart IC chip is compatible with Apple, Samsung, LG, HTC and many more renowned brands&rsquo; products. Perfect for on the go: battery low? Just plug it in and charge your device!Fast and Reliable for External BatteryGuaranteed fast recharging with 2.4 amps: 10% faster than other standard chargers that only reach a speed of 2 amps!Design meets TechnologySimple design for best functionality! Our charger has an excellent solid structure against overload and over-heating to ensure correct and safe operation at all times.Please Note1) Don&rsquo;t expose the charger to intensive sunlight. The charger is not suitable for operations in high temperature environments, as they strongly affect the output performance.2) When the USB charger is deactivated, please detach all connections. If a charging is in progress, the device and the battery shall generate some heat.Package Content1x Inateck One Port USB charger1x manual", "title": "Inateck&reg; 12W 5V/ 2.4A 1-Port Compact USB Wall Charger USB Portable Charger All-In-One Travel Charger for iPhone, Kindle, iPad, iPod, Smartphones, 5V Tablets, Bluetooth Speakers and Other USB-Powered Devices", "price": 8.99, "imUrl": "http://ecx.images-amazon.com/images/I/31BzzKyia0L._SY300_.jpg", "related": {"also_viewed": ["B00HJJPYXS", "B00KL806PK", "B00K4XC8EO", "B00JX8AH8K", "B00JO6GQLS", "B00J80TRY8", "B00AVXA2SQ", "B0073FCPSK", "B00K0D6GR8", "B00K9S353M", "B00LEVR098", "B00HPTTZDC", "B00LO1OC7Q", "B00HQY35SM", "B00L619698", "B00HPTU0OU", "B00BNQTIRQ", "B00KHP6UVQ", "B00B8L36A6", "B00E5XV0Q6", "B00FQW133K", "B00JOX1UPS", "B00JO6GPU0", "B00IZOU1KM", "B00FQVZOSQ", "B00FCM81G6", "B00KCV6F5Q", "B00A3TCWSG", "B00FF7GUQG", "B00HZF6UD4", "B00H1HIZ2A", "B00J5DS8NE", "B00H4P7LWE", "B00HC8OFCC", "B00ITDSN5Y", "B00FCM7YIW", "B00EI8SS4U", "B00D10GQW2", "B00KNPIE3W", "B00JO6UF6K", "B004DHV84S", "B00IB1BBF8", "B00IJU0K2Q", "B00KVCLDI0", "B00HPTU00E", "B00K04AIEY", "B0091SD3CE", "B00KQGDTN8", "B00K1KTTYW", "B00GSNNWDA", "B00CPK7U60", "B00D10GRKI", "B00E95OT6I"], "buy_after_viewing": ["B00EI8SS4U", "B00HJJPYXS", "B00KL806PK", "B0073FCPSK"]}, "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Chargers & Adapters"]]}