{"asin": "B0002IQCSY", "description": "The deepest, most authentic tuner experience ever. Discover the living, breathing world of tuner culture inNeed for Speed Underground 2, the sequel to the best-selling racing game of 2003, and the latest blockbuster installment in the legendary Need for Speed franchise.FeaturesFree-Roaming City: Explore a massive city divided into five distinct, interconnected neighborhoods, ranging from serpentine suburban hills to an intense downtown grid. A complex series of drivable freeways connect the neighborhoods together.Emergent Gameplay: Want to make a name for yourself in the underground? You'll need to find it first. Races can happen anywhere and at any time and as players encounter rivals on the street they'll be clued into where they can buy the hottest upgrades or enter the most elite events.New Gameplay Modes: Three new gameplay modes are added to last year's circuit, drift and drag competitions, challenging gamers to hone their skills in a number of driving disciplines.Performance Tuning: Tune every aspect of your car's performance with hundreds of licensed aftermarket performance upgrades and then fine-tune everything from the gear ratio to the suspension for the ultimate ride.The Hottest Cars: More than thirty of the most sought-after tuner cars are available from the hottest manufacturers - from Mitsubishi Motors, Nissan, and Toyota to Ford and Volkswagen, if they're hot on the street, they're in the game.Visual Customization: With more than twice the visual customizations of last year's game, there are literally billions of car combinations available to gamers. Featuring audio upgrades, scissor doors, spoilers, headlights, side skirts, roof scoops, hoods, rims, wide body kits, neon and more, if you can trick it out in real life, you can trick it out inNeed for Speed Underground 2.Environmental Variety: Each of the five distinct neighborhoods inNeed for Speed Underground 2feature a unique look and feel, including varied driving conditions and track types. Road surfaces, real-time weather effects, and environmental hazards will keep gamers on their toes as they race from dusk till dawn.Online: Gamers can put their reputation on the line, challenging the world's best racers online over Xbox Live.", "price": 35.64, "imUrl": "http://ecx.images-amazon.com/images/I/515S7X1V0EL._SY300_.jpg", "related": {"also_bought": ["B0000C4M22", "B000GPXS9Y", "B000EMJA3M", "B00005V6BE", "B000RHZJK2", "B0000A0MDV", "9629971372", "B000TLU67W", "B001MW91IW", "B00006Z7HU", "B00004YRQ9", "B0000C7GHG", "B0000503MO", "B00004YRQA", "B0013JHKU0", "B00005CF9L", "B0006ZJPR8", "B004S3KB6S", "B0002J9UBY", "B00009WAVI", "B0013KW1B2", "B000GQ1FUM", "B00005BK7X", "B002BWS5QG", "B00005B70T", "B000C4088I", "B0032GTMEE", "B000IZAQD8", "B000G79YNQ", "B0006JMLMK", "B00005U8TQ", "B00005V6BP", "B0000VSH3G", "B000JHMJDA", "B0002HLKIC", "B00005NN5J", "B00005NCCI", "B0038N09Q6", "B0006I5FL0", "B000HAUODG", "B000MIO1GY", "B00008NRM7", "B00005NUJ3"], "buy_after_viewing": ["B0000C4M22", "B000EMJA3M", "B0000A0MDV", "B001MW91IW"]}, "salesRank": {"Video Games": 1460}, "categories": [["Video Games", "More Systems", "PlayStation 2", "Games"]]}