{"asin": "B001IZYV2E", "description": "With its well-regarded inMotion system, Altec Lansing has raised the bar again with the iM600USB, offering full play and chargeability for all iPod models with a 30-pin connector. Featuring a myriad of exciting technologies, the iM600USB offers big, crystal-clear sound, and it folds up compactly for easy portability..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The Altec Lansing inMotion iM600USB:offers incredible musicality and clarity with deep bass;folds up compactly to offer great portability;provides a dock for your iPod, charging it while playing music; andfeatures a built-in FM tuner.With Expanded Sound Stage technology, the speakers sound further apart than they really are for a bigger soundstage.View larger.View Remote.Superior Sound in a Small PackageEmploying dual two-inch neodymium drivers that are optimized for high-frequency sound, the iM600USB offers unmatched musicality and clarity. Despite its compact size, the bass is punchy and has good extension, and with Altec Lansing's Expanded Sound Stage (ESS) technology, the speakers will sound further apart than they actually are, for a greater stereophonic image.Elegant Design Matches the iPodThe iM600USB sports a distinctive thin and elegant glossy-black look. A spring-loaded button deploys the speaker's stand and reveals the iPod dock, power button, and volume controls.Your iPod perches front and center, resting at an angle to display the current track information and album art while recharging. If your iPod model has the alarm clock and sleep timer features, they will work seamlessly with the iM600USB.Various docking adapters are included, making the iM600USB compatible with most iPods. Also, an auxiliary input lets you connect any CD, DVD, or MP3 player using a stereo mini-plug.Built-in FM TunerIf you get bored with the songs on your iPod, the iM600USB has a built-in FM tuner, letting you listen to your favorite music and talk radio. Near the top of the unit is an LCD that displays the current FM frequency; buttons on top provide tuning controls. The tuner also features a memory for four presets and a telescoping antenna for better reception.Change the Music from Across the RoomA small remote control is included, letting you change the musical selection from across the room. A storage slot built into the system itself makes it easy to store the remote, preventing you from losing it behind couch cushions and other inconvenient places.Take Your Music To-GoWith a compact size that folds closed to a mere 11 x 1.7 x 6 inches (W x D x H), and weighing only 2.1 pounds, the iM600USB is easy to take with you to the beach, on vacation, or wherever else you're going. The built-in rechargeable Li-ion battery lets you listen to more than 7 hours of continuous play. An AC adapter is included for connected listening and recharging the battery.The Altec Lansing iM600USB is backed by a one-year warranty.What's in the BoxiM600USB speaker system, wireless remote, iPod docking adapters, power supply, user's guide, and quick connect instructions.The iM600USB will provide enough big sound to keep your party rocking.", "title": "Altec Lansing inMotion iM600 USB-Charging Portable Speaker System with FM Receiver for iPod (Black)", "price": 69.0, "imUrl": "http://ecx.images-amazon.com/images/I/51Mco2C69eL._SX300_.jpg", "related": {"also_viewed": ["B002I636XM", "B008H7MHD6", "B005IVL0UA", "B0038W0N8G", "B008BLDI4U", "B004TS2AP2", "B002I636YG", "B005IVL0SM", "B004TS2AOS", "B0014XKQY2", "B005IVL0U0", "B0041Q38R6", "B002I3OZ7G", "B001K4YWCW", "B003VANOI6", "B003ZQYVVK", "B001FWXDZQ", "B000XPG2YU", "B004TS2AO8", "B00BQ4HRG4", "B00BU92TN6", "B005GUAIJM", "B004MF5676", "B000EVQ3PQ", "B005OYR9D8", "B002OB4BK8", "B003VX1EF8", "B007JCNOHI", "B002O3W3Y2", "B000PBQZMG", "B001G5Z82I", "B0013N3T7O", "B001DLTDQC", "B003SNITOA", "B004TMTRYU", "B002I529AY", "B00KPGUJUK", "B005CPBYGM", "B005GUAIBU", "B00CZ7LN8O", "B003SX0NG2", "B00JYQOXAO", "B0015AQLJI", "B000R6QAHO", "B002Y5XQYG", "B00E3HVNTI", "B009I7XCYM", "B006WVX1JI", "B00BQ4HRE6"], "buy_after_viewing": ["B002I636XM", "B008H7MHD6", "B003VANOI6", "B008DUJEIS"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}