{"asin": "B0012JCYPC", "description": ".caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } .caption2 { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; }iPod touch has always been an amazing iPod. With great new applications, now iPod touch is even better. Watch a movie you rented from iTunes. View rich HTML email with graphics and photos displayed inline. Open PDF, Microsoft Word, and Microsoft Excel attachments. With Maps, find your location and get directions from there. See where you are on a map, a satellite image, or a combination of both. Make Web Clips for your Home screen so you can visit your favorite websites in just one tap. Fill up to nine Home screen pages with Web Clips and arrange them however you like. Browse YouTube videos, follow your stocks, check the weather, and take notes. With the new iPod touch, tap into even more.Glide through albums with the iPod touch's amazing Cover Flow technology. ViewiPod touch dimensions.Browse the Web with the included Safari browser. Or fire up a YouTube video and enjoy the show.The iPod touch responds to your movements; turn it sideways and your video is presented in widescreen mode.Incredibly thin at just 8 millimeters.The mail application lets you view rich HTML email with graphics and photos displayed inline, as well as PDF, Microsoft Word, and Microsoft Excel attachments.Rearrange the icons on your Home screen. Even change the Dock.Mark specific locations, find the best route between them, and search for points of interest along the way with Maps.Music, Movies, and MoreFlick through album covers and find your music. Download and watch your favorite movies, rentals, TV shows, and more from the iTunes Store. Tap into thousands of photos. All using incredible multi-touch technology on a beautiful 3.5-inch display.MusicIf a picture says a thousand words, think of what all the album art in your collection might say. With Cover Flow on iPod touch, flick through your music to find the album you want to hear. When you do, just tap the cover to flip it over and display a track list. Another tap starts the music. Even view the lyrics while you're listening to the track.VideoThe 3.5-inch display gives you video like you've never seen on a portable device. Watch your favorite movie or rental from the iTunes Store. Catch up on TV shows anywhere. Enjoy video podcasts. Play music videos. All using multi-touch technology. With a tap, bring up onscreen controls to play/pause and view by chapter. Turn your iPod touch to switch between widescreen or full screen.PhotosiPod touch holds up to 20,000 photos you sync via iTunes. Flick to scroll through thumbnails. Tap to view full screen. Rotate for landscape format. Or perform some sleight of hand by opening two fingers to zoom in. You can even play slideshows, complete with music and transitions. Set any photo as your wallpaper to personalize your iPod touch . . . with a touch.iTunes Wi-Fi Music StoreWith iPod touch, discover new music anywhere. Its built-in wireless capability gives you access to the iTunes Wi-Fi Music Store, where you can buy songs with a tap. Browse New Releases, What's Hot, Genres, and Top 10 songs. Or find exactly what you're looking for with a quick search. Tap a song to preview it, tap Buy to purchase it. Even redeem your iTunes gift cards and gift certificates. All from anywhere you happen to be.Starbucks MusicYou walk into a Starbucks. Order your latte. While you wait, you hear a song wafting from the loudspeakers. You love it. So you get out your iPod touch and buy it over Wi-Fi. Just like that. The iTunes Wi-Fi Music Store on iPod touch tells you what's playing in select Starbucks and lets you buy it along with other featured Starbucks content. So you can sip, shop, and listen.Home ScreenMake the iPod touch Home screen your own. Change what's in the Dock. Rearrange the icons. And make room for even more. You can add up to eight Home screen pages and fill them with Web Clips.InternetSurf the web. Send email. Get directions and find your location with Maps. Check stocks, weather, and more. iPod touch is not just an amazing iPod. It's the Internet in your pocket.SafariiPod touch is the only iPod with wireless access to the web. Safari is built in, so you see websites the way they were designed to be seen. Search the web using the touchscreen keyboard. Zoom in and out by tapping the multi-touch display. Switch between portrait or landscape view, depending on how you hold your iPod touch. Sync your bookmarks. Better yet, add them to your Home screen. iPod touch can automatically create a Web Clip on your Home screen from any of your favorite websites. So just one tap takes you directly there.YouTubeGot a bit of a YouTube addiction? iPod touch feeds it from anywhere with a special YouTube player built right in. Watch featured videos, check out the most viewed, search for something specific, then bookmark your favorites for future reference. It's all the fun of YouTube--pocket-size.MailiPod touch is the first iPod with Mail. And it's the best email you've ever seen on a handheld device. This mail application lets you view rich HTML email with graphics and photos displayed inline, as well as PDF, Microsoft Word, and Microsoft Excel attachments.MapsGet directions and check traffic with Google Maps. Even find yourself, wherever you are. Using some local Wi-Fi networks (if Wi-Fi is turned on), iPod touch finds your approximate location and gives directions from there. Mark specific locations, find the best route between them, and search for points of interest along the way. With a hybrid map and satellite view, you can see major street names on top of satellite images.WidgetsWidgets are small, incredibly handy applications you can use every day. Three of the most useful widgets now live front and center on your Home screen:WeatherGet a five-day weather forecast, including highs and lows, for cities around the world. Save your favorite locations so you can check the weather anytime.NotesTake notes, make a to-do list, or jot down a reminder using the easy-to-use touch keypad. Then save or email them.StocksCheck your stocks and track the market over one day, one week, one month, three months, six months, one year, or two years.High TechnologyiPod touch features the same revolutionary interface as iPhone, the most advanced software ever engineered, and state-of-the-art technology. With the multi-touch display, you can control everything using only your fingers. If you rotate your iPod touch from portrait to landscape, the accelerometer automatically changes the way the content is displayed. And with wireless technology, you can connect to the Internet from any Wi-Fi network, anywhere you are.Multi-touchiPod touch features the same revolutionary interface as iPhone. Built to take full advantage of the large 3.5-inch display, the multi-touch interface lets you control everything using only your fingers. So you can glide through albums with Cover Flow, flick through photos and enlarge them with a pinch, or zoom in and out on a section of a web page. And iPod touch features a touchscreen QWERTY keyboard perfect for browsing the web in Safari, getting directions on a map, searching for videos on YouTube, finding music on the iTunes Wi-Fi Music Store, or adding new contacts.Ambient Light SensorThe iPod touch display has an ambient light sensor that automatically adjusts brightness to suit the ambient light in your surroundings. The result? A better experience for you and battery-saving efficiency for iPod touch.WirelessConnect to the Internet anywhere there's a Wi-Fi network. Send email from a coffee shop. Surf the web at the airport. Browse, buy, and download music from the iTunes Wi-Fi Music Store at select Starbucks locations or other wireless hot spots in your area. iPod touch finds wireless networks and connects you to the Internet.AccelerometerAn accelerometer detects when you rotate iPod touch from portrait to landscape, then automatically changes the contents of the display, so you immediately see the entire width of a web page, your music in Cover Flow, or a photo in its proper aspect ratio.Read Kindle Books on the iPod touchRead Kindle books on your iPod touch.No Kindle required.Get the best reading experience available on your iPhone or iPod touch.No Kindle required.Access your Kindle books even if you don't have your Kindle with you.Automatically synchronizes your last page read between devices with Amazon Whispersync.Adjust the text size, add bookmarks, and view the annotations you created on your Kindle.Don't have a Kindle?Get yours here.Shop for Books on the Kindle Store on Your iPod touchBuy a book from the Kindle Store, optimized for Safari, on your iPod touch or iPhone and get it auto-delivered wirelessly.Search and browse more than275,000 books, including more than 107 of 112New York Timesbestsellers.FindNew York Timesbestsellers and new releases for $9.99, unless marked otherwise.Get free book samples; read the first chapter for free before you decide to buy.Books you purchase also can be read on a Kindle.Kindle newspapers, magazines, and blogs are not currently available on the iPod touch or iPhone.What's in the Box8 GB iPod touch, earphones, USB 2.0 cable, dock adapter, polishing cloth, stand, quick start guide.", "title": "Apple iPod touch 8 GB (1st Generation)  (Discontinued by Manufacturer)", "price": 203.5, "imUrl": "http://ecx.images-amazon.com/images/I/41NybZ2C66L._SY300_.jpg", "related": {"also_bought": ["B003YUIL0Y", "B000X22HJW", "B001FA1NZK", "B002SN8X3S", "B001JEKWX6", "B003YUMDNK", "B003YUKMDI", "B003D2DVFS", "B000VXVHUS", "B0012JCZYM", "B002M3SOBU", "B0062GM1US", "B001JEKWWW", "B007Z0GFPM", "B000XHS4SK", "B002FP9PLI", "B004ZLV4JG", "B001J85BS8", "B001JEM23Y", "B003KVKKBA", "B001JEM23O", "B002SNGE7K", "B002SN78ZC", "B002M3SOC4", "B002SNK5RU", "B001FA1O0O", "B008H2GD40", "B0012JNQYK", "B007Z0FKNU", "B00078ZGTA", "B001FA1NZU", "B00517CEUQ", "B002C7481G", "B0062GLZ6Y", "B002M3SOCE", "B005GS3C2O", "B00365F6IM", "B00365F6LE", "B0097BEF0O", "B000EP4TWQ", "B0015RB39O", "B002C74BNG", "B008BR4L2W", "B0097BEFI6"], "buy_after_viewing": ["B002M3SOBU", "B001FA1NZK", "B001FA1NZU", "B0020OYUL4"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}