{"asin": "B00CM1BN5G", "related": {"also_bought": ["B00D9N7P80", "B00DFB8R1A", "B00DNKPMF2", "B00EL9Z1AU", "B00DMMKB52", "B005QX7KYU", "B00E4SI55G", "B00DJOBDGE", "B00FJ3R524", "B00BMU12WC", "B00JOI6FZ8", "B00G1YJ5B4", "B00E6TYDKE", "B009AEPJ8U", "B00ECU78XG", "B00KHA5G6G", "B004M5QPBM", "B00BFYH11Q", "B00FAI9XNW", "B00F2ENTYI", "B00DTPQC6O", "B00HWHQKFI", "B00FEE7B1I", "B00932N46S", "B00C4PFDBA", "B00E4RZU00", "B0023FTRUO", "B00DUSMWGE", "B004M5H6D8", "B00E4RZQM2", "B00E6TZRA4", "B0081CRXGI", "B00D3F9H62", "B0098O9TB0", "B005GI2VMG", "B00DESEGC8", "B00CRXZPAS", "B009P7JJEC", "B00E2S1UTG", "B009SJNR3G", "B00E2S4A5M", "B00B4GGW5Q", "B00E0GNWMS", "B00E4RXD04", "B00AI1N9FY", "B005ERKYI2", "B007JX3J40", "B00EEXZ5U4", "B007X15HKC", "B00AA6OVLI", "B00DVFLJDS", "B009TLA7P4", "B003765X38", "B009QZH7BU", "B004M5QPDK"], "bought_together": ["B005QX7KYU"], "buy_after_viewing": ["B005QX7KYU", "B00FEE7B1I", "B00B4GGW5Q", "B00D9N7P80"]}, "title": "Acer Iconia W3-810-1600 8.1-Inch 32 GB Tablet (Silver)", "price": 266.01, "salesRank": {"Electronics": 12062}, "imUrl": "http://ecx.images-amazon.com/images/I/41JjNWOGJaL._SY300_.jpg", "brand": "Acer", "categories": [["Electronics", "Computers & Accessories", "Tablets"]], "description": "The Acer&reg; Iconia W3 Series puts desktop PC productivity in a tablet, so you can work on the go more conveniently than ever.  At 8.1\", it is compact enough to hold in one hand, yet sports a screen big enough for comfortable viewing. With Microsoft&reg; Office Home and Student 2013 and sporting 8-hours of battery life, this tablet keeps you in touch and productive while traveling, at work or play. Rounding out this premium mobile-productivity package are Windows 8 and a robust Intel&reg; processor.br/Key Features8.1\" 1280 x 800 resolution, high-brightness (300-nit):with integrated 5-Point multi-touch screen, supporting finger touch and image auto rotationWindows 8Intel&reg; Atom&trade; Dual-Core Processor Z2760 1.5GHzwith Intel&reg; Burst Technology up to 1.8GHz2048MB of LPDDR2 800 MHz Onboard memory chip supportIntel&reg; Graphics Media Acceleratorwith 64MB of dedicated system memory32GB Internal StorageHigh-definition audio supportTwo Built-in Stereo SpeakersIntegrated Digital Microphone802.11a/b/g/n WirelessBluetooth&reg; 4.0 + EDR1- Micro USB 2.0 Port1 - Micro-HDMI&trade; with HDCP supportMicroSD memory slot up to 32GB(SDHC 2.0 compatible)2MP Rear-Facing Camera2MP Front-Facing CameraSensors:Gyroscope, E-Compass, G-Sensor, Ambient light sensor2-Cell Li-Polymer BatteryLearn MoreIntroducing the World&rsquo;s First 8&rdquo; Windows TabletThe Acer&reg; Iconia W3 is the first 8\" tablet with Windows 8 for a smooth, hands-on multimedia, 5-point multi-touch experience. The exceptional 8\" display makes you feel what you see with consistent and accurate colors from wide viewing angles.A true multi-user tablet, the W3 breathes life into movies and games, lets you enjoy reading and picture editing, and provides easy access to personal apps and settings via live tiles, plus access to the Windows Store to add even more. The W3 also comes with Microsoft&reg; Office Home and Student 2013 so you can edit Word, Excel and PowerPoint docs on the go.Windows 8 has been re-imagined to be all about you. Put what matters most right on your Start screen, and get instant access to your people, apps, sites and more, so you can spend less time searching and more time doing. Windows 8 is smooth, intuitive, and designed to let you do what you want, the way you want.Productivity On-the-Go with Office!With MS Office Home and Student 2013, You're in control of getting things done and delivering amazing results according to your schedule.  Edit Word, Excel, PowerPoint and OneNote documents on the go, at the office, home, or school.The Iconia W3 syncs across all your Windows 8 devices, so what you need is always there for a universal experience. Opt for the full-size Bluetooth&reg; keyboard that snaps to the back of your tablet, and the W3 becomes as productive as a notebook, while preserving tablet mobility.Bring your files because there's a microSD&trade; card slot built in. Port your whole experience to your big screen TV in full HD glory through the Micro-HDMI port. The W3 also features a Micro-USB port for sharing and expanded storage capacity.You'll enjoy high-quality face-to-face chats thanks to the built-in 2MP front and rear-facing cameras and 802.11b/g/n wireless, while Bluetooth&reg; technology lets you wirelessly connect to other Bluetooth-enabled devices such as phones and printers, eliminating the need for cables. Acer Instant Connect gets you to the web in 4x faster than conventional notebooks by remembering previous Wi-Fi spots you've visited!With AcerCloud, your PC's storage IS your Cloud storage with wireless access to your photos, music, videos and documents&mdash;wherever you are, on any PC, on all your devices! With Acer Always On technology, simply press it and it&rsquo;s on and updated, just like a phone.8 Hour TaskmasterCompact enough to hold in one hand, yet big enough for comfortable reading, web browsing and video enjoyment, the W3 houses a powerful Intel&reg; Atom Dual-Core processor for optimum performance and reliability.With enough battery life for up to 8 hours of 720p video playback, you have the entire day to do what you want&mdash;check the morning news, update your social media at lunch, and watch a movie in the evening.Matched with a large 16:10 display, the W3 is ideal for HD entertainment on the way or getting some serious work done without scrambling for a power outlet."}