{"asin": "B001PKHRTG", "description": "Metallica and Guitar Hero fans rejoice:Guitar Hero: Metallicahas landed for PlayStation 3. LikeGuitar Hero: Aerosmithbefore it,Guitar Hero: Metallicawill focus on the career and songs of Metallica. With 28 Metallica songs and 21 other songs that influenced the band, fans will love playing guitars, drums, and singing vocals alongside Kirk Hammett, Lars Ulrich, James Hetfield, and Robert Trujillo..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } img.withlink {border:0px black solid;} a.nodecoration {text-decoration: none}The band looks incredibly life-like thanks to motion capture technology.View larger.In Expert Plus mode, you'll play double bass pedals like Lars Ulrich.View larger.without image borderPlay gigs in famous real-life venues like The Forum.View larger.Rock out to your favorite Metallica tracks.View larger.Follow the Career of Metallica and Play as Your Own UpstartGuitar Hero: Metallicais similar toGuitar Hero World Tourin that you play a full suite of instruments. When the game starts, you're the new band on the block with aspirations of opening for Metallica. The game goes back and forth between performances by Metallica and performances of songs that influenced Metallica by your band. The band was motion captured so you'll recognize their unique motions on screen and style of playing.As you progress in the game, you'll start to unlock bonus features such as videos of old Metallica performances, backstage photos, and \"Metallifacts,\" which enables different trivia to show up while a song is playing, similar to VH1's Pop-Up Video.Metallica Recordings from Original Masters and More Via DownloadGuitar Hero: Metallicafeatures 49 songs in total, 28 Metallica songs, and 21 songs that are favorites of the band and have influenced them. The Metallica songs are sourced from original masters so you'll have the best audio quality available. You'll also be able play downloadable content from their latest album, Death Magnetic.Game Difficulty Goes from One All The Way Up to ElevenMetallica exhibit technical prowess while performing, and this game goes from Beginner all the way to Expert Plus difficulty. Hardcore gamers will not be disappointed. You'll have to play guitars, drums, and sing, and in the \"Expert Plus\" difficulty, you'll have to plug in a second bass pedal for double bass pedal drum work.Real-Life VenuesAs you go on tour, you'll be playing venues small and large, and you might recognize some that you've been to. Famous venues that played a part in Metallica's career such as The Stone and the Hammersmith Odeon are included in the game and have been duplicated with great detail.Grab Your Friends and Play TogetherMultiplayer is part of what made Guitar Hero such a hit and it is no different here. Gather your friends and family, and jam Metallica tunes together. The game also features Metallica-specific power ups for competitive multiplayer. For example, \"Fade to Black\" will black out your opponent's notes, and \"Trapped Under Ice\" will freeze their whammy bar.Create Your Own MusicThose familiar withGuitar Hero World Tourwill welcome back the Music Studio, where you can create new music and then upload and share them through the GHTunes service. The Music Studio inGuitar Hero: Metallicagives you Metallica specific tones such as Hetfields' ESP Truckster guitar, as well as Metallica drum sounds. Songs made in Metallica and World Tour are compatible with each other through the GHTunes service.Guitar Hero: MetallicaTrack ListAll Nightmare LongBatteryCreeping DeathDisposable HeroesDyers EveEnter SandmanFade To BlackFight Fire With FireFor Whom The Bell TollsFranticFuelHit The LightsKing NothingMaster of PuppetsMercyful Fate (Medley)No Leaf CloverNothing Else MattersOneOrionSad But TrueSeek And DestroyThe Memory RemainsThe Shortest StrawThe Thing That Should Not BeThe UnforgivenWelcome Home (Sanitarium)Wherever I May RoamWhiplash", "price": 91.23, "imUrl": "http://ecx.images-amazon.com/images/I/613lG9UplwL._SY300_.jpg", "related": {"also_bought": ["B0028ZNXE0", "B003N5VVDY", "B0028ZH7EC", "B001UWMZZ0", "B001ABK1LQ", "B0013ZEMRS", "B001IKC3QA", "B00381BKIY", "B001KAMZ8E", "B003N5VW1A", "B001GPEHEI", "B0028ZNWQE", "B001TOMQRG", "B000TG92YK", "B0029Y058W", "B000TSZADA", "B001BXA9AG", "B0039R62GW", "B000TTITLO", "B002A9JH8U", "B002M2N9NY", "B001NJL6QE", "B001Q9XT7A", "B001ZE3G7E", "B003N5ZYOG", "B001ABN834", "B001TOMR0M", "B001ABN82K", "B003RS8I92", "B000TSX3UC", "B002AO7DTK", "B001M5I4GO", "B003VWGBFM", "B001OBRFHU", "B001Q9VSE6", "B000TT0KQ6", "B001F03MRW", "B002EE6T1E", "B003RS1A7Y", "B006ZTHFPS", "B000PS1TG6", "B000OPPR2C", "B000XJLQ24", "B0053BSOD6", "B007YZ5QOO", "B003JETPHS", "B0050SXLQC", "B002EE0NB6", "B000GDPHAE", "B001DAVT06", "B0050SXX88", "B006JKARN0", "B008CP6MA2", "B001RTS528", "B00GYVPJ0A", "B00IMVRVC4", "B003M986ZM", "B0093FO2TS", "B002Z7BE24", "B00FQCT1ZW", "B00I9UVY30", "B0028ZJ4O8", "B008277M36", "B000FII8KQ", "B0050SWSQQ", "B001QKTWTI", "B001BXAC6W", "B00BJ60LEY", "B007XVTR5S", "B00309XHD0", "B0050SXFKE", "B0022TNO7I", "B007TYC8MI", "B001NX6GBK", "B000WQZ7WS", "B0017KCUAK", "B002X8NAOA", "B001N791HC", "B0042GW7BI", "B002I0J82G", "B00HRUQARI", "B00002ZMNV", "B003QOWPNM", "B0015AARJI", "B003O6CBIG", "B008E6ZXTA", "B007CM0K86", "B003O6KWZK", "B0050SWR6M", "B0050SX1JO", "B0050SXVK8", "B003RRTXLA", "B0050SWZHS", "B00D4AK17A", "B0012N94WO"], "bought_together": ["B003N5VVDY", "B001ABK1LQ"], "buy_after_viewing": ["B001IKC3QA", "B001ABK1LQ", "B003N5VVDY", "B0028ZH7EC"]}, "salesRank": {"Video Games": 7234}, "categories": [["Video Games", "PlayStation 3", "Games"]]}