{"asin": "B0000CEOYI", "description": "From the Manufacturer The super-slim iPod defines what a digital music player should be. It&rsquo;s lighter than two CDs, can hold up to 10,000 songs, thousands of digital photos and works as a personal voice recorder. Now you can sync with iTunes for Mac and Windows at blazing speeds, and take your entire music collection with you wherever you go.15 GB, 20 GB and 40 GB ModelsAt just over half an inch thick, the iPod fits comfortably in the palm of your hand and slips easily into your pocket -- and your life. Merely 5.6 ounces, it weighs less than two Compact Discs, and even many cell phones. And yet the iPod gives you a huge 15GB, 20GB or 40GB hard drive -- big enough to hold 10,000 songs. Do the math: that&rsquo;s four weeks of music played continuously, 24/7 -- or one new song a day for the next 27 years.The new iPod sports a sleeker design and an improved interfaceThe iTunes Music Store. Now for Mac and Windows.Build a collection of music on your iPod with songs downloaded from the iTunes Music Store. Choose from hundreds of thousands of songs you can preview and buy with just one click. The iTunes Music Store stays open 24/7 -- right on your Mac or Windows PC. Within a minute of finding a song you like, you can own it. You can make unlimited playlists, burn individual songs to CD as many times as you like and take all your music on your iPod wherever you go.Autosync your iPod with Mac and WindowsiTunes 4 lets you organize your music on your Mac or Windows PC and automatically transfer it to iPod. Whether you&rsquo;ve ripped your CD collection to mp3 or AAC, bought music from the iTunes Music Store or made your own track with GarageBand, you can take it with you wherever you go. Your iPod offers high-speed transfer from your Mac or PC. In fact, you can move an entire album from your computer to your iPod in seconds flat. With the industry&rsquo;s only true Auto-Sync, your iPod is always up-to-date, mirroring the latest changes you&rsquo;ve made in iTunes. And if your collection on your computer is bigger than iPod, you can let iTunes automatically choose a selection of songs to fill it up.Ahead-of-the-curve DesignIts hassle-free functionality and stunning, well-considered design place iPod far ahead of the curve and the competition. The Touch Wheel makes scrolling through an entire music collection quick and easy, and the all-touch interface enhances durability and sensitivity. With an LCD screen and buttons that feature a backlight for clear visibility in low-light conditions, iPod is designed for easy one-handed operation. So the best way to take an entire music collection anywhere is now even better.iPod makes all the right connectionsHigh FidelityDesigned to give you the best portable digital music experience ever, the iPod delivers the highest sound quality from i nput to output. iPod supports the most popular audio formats -- including MP3 (up to 320 kbps), MP3 Variable Bit Rate(VB R) and WAV -- giving you access to a wide range of audio file types. And iPod is the only portable digital music player that supports the AAC format used by the iTunes Music Store for Mac and Windows. AAC features CD-quality audio in smaller file sizes than MP3, so that even more songs fit on your iPod.All That And MoreThe iPod features a sleep timer, so you can fall asleep to your music. And with the iPod&rsquo;s alarm clock, you can choose either an alarm tone or your favorite music to wake you up.The iPod lets you do a whole lot more, including contacts, calendar and to-do lists. iPod also includes Music Quiz, Solitaire, Brick and Parachute, four great games you can play anywhere (a feature you&rsquo;re sure to appreciate the next time you&rsquo;re standing in line or waiting for someone). You can even use your own music as the soundtrack to a game.iPod also includes a notes reader that lets you download text-based information and read it on the screen. This way you can have the information you need -- on everything from restaurant reviews to nightlife guides, and from news articles to exercise routines -- at your fingertips.", "title": "Apple iPod 40 GB White M9245LL/A (3rd Generation)  (Discontinued by Manufacturer)", "price": 229.99, "imUrl": "http://ecx.images-amazon.com/images/I/316NVDRJHAL._SY300_.jpg", "related": {"also_viewed": ["B0002OZXGU", "B0002OZXHO", "B0007KX4TC", "B0002ZAEY0", "B000EPNDEG", "B000A3WS84", "B000A3WS20", "B00005S0M5", "B000A3WS16", "B000EPHPPE", "B000A3WS8O", "B000932AKQ", "B000JO1380", "B000JO1MU4", "B0001A99MO", "B000JLKIHA", "B000EPHR0C", "B000JO3N3S", "B00KA3HLOK", "B000JO7PIM", "B0002ZAEYK", "B000EP4TWQ", "B0012S7GRY", "B0002BRMNA", "B001FA1O0E", "B0056BUVES", "B002SN777G", "B000EPHP4U", "B001F7AHOG", "B001F7AHXM", "B00KA3BP6K", "B000IJVETY", "B000XUQZEM", "B0001A99LA", "B00JQI6C72", "B001OBU400", "B000FMZE7W", "B00EZOK8B8", "B0000D8LSW", "B001FA1NDW"], "buy_after_viewing": ["B0002OZXGU", "B000A3WS84", "B0002OZXHO", "B00009KO0B"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}