{"asin": "B0045F5CXQ", "description": "- NewEW-83H Dedicated Altura Photo Lens Hood.- A perfectCanon EW-83Hreplacement.-Compatibility:- Canon EF 24-105mm f/4L IS USM- Canon EF 24-70mm f/4L IS USM- The addition of a lens hood can help prevent flares-those circles of light that can accompany images where a strong light source is just outside the frame.- This dedicated lens hoods is designed to match the specific focal length of the lens it was designed for.- Made of high impact plastic for an extremely solid and lightweight feel.- Lens hoods are one of the most important accessories you can purchase to improve the quality of your photos, and usually the most overlooked by beginner and amateur photographers.- Lens hoods also have the added benefit of providing extra protection to your lens from accidental bumps or scratches.- Easy to use bayonet mount attaches to your lens for a tight and secure fit. Just twist on or off. No wobbling or cross-threading.- Handy reversible design allows you to attach the hood in reverse for easy storage in your bag.- PremiumMagicFiber Microfiber Cleaning Cloth- Ultra gentle! Extremely fine microfiber leaves zero scratches, streaks or marks. Safe for all lenses.- Clean without the need of soaps or detergents. Wipe down kids' toys, cribs, stainless steel counters and other areas you want to keep chemical free.- Great value for your money. Reusable and long lasting. No more paper towel and tissue waste.- Extremely handy! Keep one in your office, home office, laptop bag, camera bag and car.- Size: 6 x 7 inches (15cm x 18cm)- Each microfiber is individually and neatly packed in it's own polyurethane plastic bag for long term safekeeping.", "title": "EW-83H Dedicated Altura Photo Lens Hood for Canon EF 24-105mm f/4L IS USM, EF 24-70mm f/4L IS USM Lenses (Canon EW-83H Replacement) + MagicFiber Microfiber Lens Cleaning Cloth", "price": 6.99, "imUrl": "http://ecx.images-amazon.com/images/I/41jiWT68TaL._SY300_.jpg", "related": {"also_bought": ["B00BD2Y9L0", "B00004ZCI3", "B009B0MZG2", "B0049XGNKK", "B007SXJ26A", "B00004ZCJM", "B000AZ57M6", "B001CCAISE", "B0062W02C6", "B004JMZPK0", "B00009R6TA", "B00007GQLU", "B009JS61MK", "B002K40R84", "B002WE4H8I", "B005AY9278", "B00BCEJ0E0", "B0071RSYPI", "B0000BZLBQ", "B002L60TTI", "B00004ZCIC", "B007G5NNOW", "B0080JH3YE", "B009JCL55Y", "B00543FWDI", "B004V97MXE", "B00AW6HB7C", "B007NDL56A", "B008BYO1E8", "B005AYT6R4", "B0049H89F8", "B00004ZCJG", "B00004XOM3", "B00AVBDGHM", "B002K450QI", "B002YVRGPA", "B0058I7CVE", "B00007LA0T", "B0000BZLAC", "B001KELVS0", "B0062EUE54", "B004AH10K8", "B002K3Z3E8", "B000CLNHXY"], "bought_together": ["B00004ZCI3", "B00004ZCJM"], "buy_after_viewing": ["B009OO71WS", "B000B6A4S6", "B002K40R84", "B00D53LT72"]}, "categories": [["Electronics", "Camera & Photo", "Accessories", "Lens Accessories", "Lens Hoods"]]}