{"asin": "B004XRSLB6", "description": "Introducing the lastest Slim Premium Litchi Grain Multifunction Leather Motorola Xoom Case from Acase Products line- This is the best case you have ever had with your lovely Motorola xoom. You buy a Motorola Xoom but you can`t find a suitable case for\nit. Acase know what you need!Acase spend countless hours ensuring this new design case is totally fit for Motorola Xoom.The Acase multifunction Litchi Grain leather case for Motorola Xoom is perfect for daily usages and travels! The exterior of this case is made of litchi grain leather, which is light-weight and can provide the Motorola Xoom a total protection from scratches and small impacts. The microfiber protect your Motorla Xoom without any scratches and no residues falling on to the screen. In the mean time you could still enjoy it`s perfectly thinness and nice look.This perfectly design give your Xoom a snug fit without adding any bulk to it, which is a great match with the slender design of the Xoom.The grooves on the microfiber part of the case offer the Motorola Xoom multi viewing angles, now you are able to type an email or watch a movie without holding the Xoom all the time!.You can still access all of the Motorola Xoom's features! You can put your Xoom into any other bag or case without having to worry about not fitting! The choice solution in Xoom mobile protection!Compatible with the Motorola Xoom Android Tablet!!!Try it - from the best Tablet Case manufacture to add additional protector to your newest Motorola Xoom", "title": "Acase Slim Leather Folio Case with Built-in Stand for Motorola Xoom (Black)", "price": 7.99, "imUrl": "http://ecx.images-amazon.com/images/I/41ZaC%2BVzoxL._SY300_.jpg", "related": {"also_bought": ["B0045FM6SU", "B004QISZX6", "B00513HAEA", "B005EC0HXE", "B004M8RWDE", "B004M8RWDO", "B004M8RWCU", "B004M8RWCK", "B00576STJ6", "B004M8RWB6", "B004L9MBH6", "B00462QTA8", "B004QS84UU", "B00513H3D8", "B004M8RWD4", "B004P551BE", "B0064VNC1S", "B004ZHWGCO", "B004XMW96Y", "B006LPRXJE", "1118088352", "B004M8RWBQ", "B004XX9HNG", "B00CVDQON6", "B00652CYPG", "B0064VNCFY", "B00FQ7MNSE", "B004UAG6WC", "B008KQ6V8Q", "B005LFXBKA", "B004S748UY", "B0054Z6GMW", "B00502ZGYI", "B008FRPE9M", "B005GGBYJ4"], "buy_after_viewing": ["B004M8RWCK", "B005I643XG", "B004QS84UU", "B004XMW96Y"]}, "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Cases & Sleeves", "Cases"]]}