{"asin": "B0013AHADQ", "categories": [["Electronics", "Computers & Accessories", "Monitors"]], "description": "HP w2408 Vivid Color - A premium perfect monitor for your PC that provides vibrant colors, convenience, personalization and height adjustment options. The HP w2408 provides richer, more vibrant colors as it uses high quality panels that can cover more of the color gamut. It's easy for you to connect your USB devices, with the built in four (4) USB Ports. The BrightView widescreen panel with 5 ms response time offers brilliant picture quality, and the built-in ambient light sensor means that the monitor's image adjusts automatically to your environment. Dual inputs support true digital (HDMI) and traditional analog (VGA) signals. HDCP-enabled for optimum viewing of High Definition content (High-Bandwidth Digital Content Protection). Double hinge base allows height adjustment from the youngest to oldest viewer to view comfortably. Rotate from regular mode to portrait to view long documents or web pages on your PC. My Display provides one touch adjustment for brightness, color and contrast. Quick View modes change work environments easily and quickly. Integrated speakers and keyboard parking keeps your desktop clutter-free. Personalize your monitor with Easy Clip by clipping on photo holders, cameras, and accessories. My Display provides one touch OSD adjustment for brightness, color and contrast. The wide aspect ratio and high resolution bring gaming, videos and internet surfing brilliantly alive when you plug into your HP PC. Fast response time makes gaming even more enjoyable! Unpacked dimensions, max position: 19.7(h) x 23.1(w) x 11.38(d)", "title": "HP W2408H 24-inch Widescreen LCD Monitor", "price": 265.0, "salesRank": {"Computers & Accessories": 11060}, "imUrl": "http://ecx.images-amazon.com/images/I/51aY-5cfkuL._SY300_.jpg", "related": {"also_viewed": ["B00139S3U6", "B008PBXKG2", "B008R52DP0", "B001LYWBOM", "B000OK6T9W", "B00CM0QW2G", "B00B7XYVV8", "B004G8QO5C", "B005NM8PB6", "B003U4IROY", "B007ILDUOW", "B007SIC654", "B005O9RPQE", "B0077E48FA", "B007M4UUF2", "B00847TYYO", "B00B3FTM7S", "B0081VNAUM", "B007ILDWPO", "B00B332A9C", "B00B17C5KO", "B004KKGF1O", "B004ZMH65Q", "B00B3329WA", "B008C0UA4G", "B008DWH00K", "B00GJO7GOE", "B009AENEN2", "B009AENEVO", "B0098Y77OG", "B005X5KEWG", "B00ITORJRQ", "B00AYA7NBA", "B0085H662G", "B003D1ADUU", "B0045JFTXU", "B005JN9310", "B00AWKBZ0C", "B009AENE78"], "buy_after_viewing": ["B005JN9310", "B003L1ZYYM", "B00B2HH7G0", "B00847TYYO"]}}