{"asin": "B000KGD1GO", "description": "Brothers In Arms Hell's Highwaybrings the critically acclaimed squad-based      WWII shooter into the next generation of gaming with amazing graphics and      sound, new cutting-edge gameplay features, and a totally redesigned online      component. Delivering on the franchise's compelling story, unrivaled authenticity      and intense squad-based action,Brothers InArms Hell's Highwaydrops you into Operation Market Garden, the largest paratrooper operation      in World War II. Lead Matt Baker, Joe Hartsock and the rest of the 101st Airborne      Division as they fight to open \"Hell's Highway\" in a daring bid for a quick      end to the war in Europe.The Next-Gen of WWII actionTake command as Sgt. Matt Baker.View larger.Engage in large scale battles.View larger.Or house-to-house combat.View larger.Experience the life of a soldier.View larger.Utilze fully-destructable cover.View            larger.Precision shots yield 'quick kill' points.View            larger.Operation Market Garden: The Story of Hell's HighwayOperation Market Garden was a real-life Allied offensive designed to destroy Nazi Germany before Christmas, 1944. The plan was ambitious - it was largest airborne invasion in the history of the world. The plan was to capture a corridor through Holland to punch through the German lines. Paratroopers of the 101st Airborne and other divisions dropped from the sky in mid-September to seize and hold the corridor by surprise. The surprise attack was a bust. Hitler's best units were in the area and immediately counter-attacked and crushed the corridor.Meet the SquadAlthough players see the chaos of Operation Market Garden exclusively through the eyes of Sgt. Matt Baker,Hell's Highwayis squad-based and as such players will direct, interact with, and get to know all the members of the 101st Airborne in intimate detail. Some of the characters return from earlier games in the series, while others are brand new. Regardless, each has his own personality, history and attitudes towards the plight the squad finds themselves in as they seek to survive a bold, but doomed plan. Some of the dog faces players will encounter are include:Name &amp; Rank: Sgt. Matt BakerPreferred Weapon: M1 RifleBio: With his experience from          the battles of Normandy, Baker enters Holland fully accepting the mantle          and responsibilities of squad leader. However, the loss of half his original          squad still weighs heavily on him and he will not let any more of his          men die.Name &amp; Rank: Sgt. Joe          \"Red\" HartsockPreferred Weapon: M1A1 ThompsonBio: A corporal under Baker's command, he was promoted to Sergeant          after the battle in Carentan. Unlike Baker, Red understands the realities          of war and is prepared to make the tough decisions required of a squad          leader. All he can do is minimize the casualties.Name &amp; Rank: Pfc. Mike          DawsonPreferred Weapon: M1A1 ThompsonBio: Though a newcomer to the squad, Mike served with the 502nd          PIR in Normandy. He believes in fate and is interested in the story of          Baker's \"cursed pistol.\" His inquiries have made him a pariah,          as the other members would rather not re-live those events.Name &amp; Rank: Cpl. Tom          ZanovichPreferred Weapon: M1918A2 B.A.R.Bio: The \"old man\" and veteran of the squad, Zanozich          served in the French Foreign Legion before enlisting in the U.S. Army.          Despite all the combat he's seen, Tom has a strong sense of humor - even          when the situation doesn't exactly call for it.Name &amp; Rank: Cpl. Sam CorrionPreferred Weapon: M1A1 ThompsonBio: Corrion was a corporal with Baker and Hartsock before Normandy,          and much to his dismay, is still a corporal. Sam excelled as a foreman          in the saw mill back home, and believes that he could perform better than          either of his compatriots, if only given a chance.Key Features:Brothers In Arms Hell's Highway- Next Generation: The classic authentic, squad-based combat series explodes on next-generation hardware, offering unprecedented graphics and features.New Story, New Setting: Follow Matt Baker, Joe Hartsock and the rest of the 101st Airborne Division in \"Operation Market-Garden\" as they fight to open famous \"Hell's Highway\" in a daring bid for a quick end to the war.Live the life of an Enlisted Man: Get orders from HQ, go on patrol, spot the enemy and set up a devastating ambush. For the first time, finding the enemy before they find you is part of the challenge.Unprecedented Character Design: Lifelike characters look, talk, move and think with incredible realism. Game characters interact with the player and each other like true brothers in arms, trading ammunition, helping wounded allies and civilians, working together to man team-operated weapons, and more.Rich Cinematic Experience: As the squad leader, you interact with and get to know your brothers. Each character has his own personality, unique story and background, and grows through the game.Powerful New Units Under Your Command: Players can use or command combined arms teams - machine gun crews create intense fire, bazooka crews destroy buildings and tanks, and mortar crews pound the enemy from a distance.Step Into the Boots of a Soldier: Hit the dirt and get prone, rip grenades from your chest and hurl them at your enemies. See and feel the blast of nearby explosions.Completely New Multiplayer Experience: Fight major multiplayer battles with dozens of players on each side; all the intensity and accessibility of Deathmatch meshed with the squad-based gameplay that helped makeBrothers In Armsfamous.Destroyable Cover: Keep your men moving and choose your cover wisely - simulated with real physics, weapons will damage, dent, scorch and destroy the world around you.There's only one way out of hell, and that's through it. To the Allied paratroopers who fought to capture and hold the bridges and roads of Holland targeted in Operation Market Garden the price was the lives of their brothers in arms. To them the corridor became known as Hell's Highway. It was the the last great Nazi victory. It was simply hell for Sgt. Matt Baker and his squad. Relive their courage and heroism inBrothers in Arms: Hell's Highway.Brothers in Arms: Hell's Highway:  The Colonel Antal InterviewSince 1985, when it dropped into the WWII division of the popular tactical/strategy shooter genre withBrothers in Arms: Road to Hill 30, theBrothers in Armsseries has consistently met with critical acclaim and gamer praise. This was a tough mission to accomplish, but it did so by focusing compelling squad-based tactical gameplay against the backstory of a fictional squad within the US Army's 101st Airborne Division as they battle through a historically correct re-creation of the events of the Allied invasion of Europe during WWII. This type of realism is more or less unheard of in the video game world and can only be provided by someone who really knows their stuff. Enter Colonel John Antal, US Army (Ret.).Vice President of Knowledge Operations and Military and Historical Director at Gearbox Software, developers of theBrothers in Armsseries, Colonel Antal is an Airborne-Ranger officer, and a published author of scores of magazine articles, as well as several fiction and nonfiction books on military topics. Most importantly for the subject at hand though, he is also a major force behind the development of theBrothers in Armsseries. Recently I was able to catch up with him and ask some questions regarding the newest title in that line,Brothers in Arms Hell's Highway.Colonel John Antal, US Army (Ret.) in Kandahar, Afghanistan in September, 2008 during a visit with the paratroopers of the 101st Airborne (Air Assault) DivisionAmazon.com/games: The modern military is full of cutting edge technology, but I'm sure that some readers will be surprised to hear that a career military man, such as yourself, plays such a pivotal role in the development and marketing of a video game. How did this come about? And did you have any video game experience prior to theBrothers in Armsfranchise?Colonel Antal: I just returned from a ten day visit with US and NATO troops in Afghanistan, and I can report to you that when Soldiers are not fighting, they are training for the next fight.  The more time Soldiers spend training in realistic simulated battles, the less blood spilled in battle. During my thirty years in the US Army, I trained thousands of Soldiers using constructive, virtual and live military simulations. Once I retired, it was an easy leap for me to switch my experience with military simulations into value-added content for video games.Amazon.com/games: I know you've probably been asked this question a thousand times, but let's make it a thousand and one. Operation Market Garden, the WWII allied offensive thatHell's Highwayis based on culminated in a German victory. Why make a video game based on a defeat?Colonel Antal: Market Garden was not a complete success, but war is fought at many levels. At the squad level, war is about fighting for the next hill, hamlet or road junction. Victory and defeat is very clear in a squad - when the battle is over you either have won and lived, or have lost and most of your comrades are dead or wounded. InBrothers in Arms, Hell's Highway, we created a historical fiction that is true to the real history of the battle in ways no other game has approached. The true story of the battle for Hells Highway is dramatic and a worthy story.  If we told only stories of victories, we wouldn't be telling true historical fiction. War is about victory AND defeat, gain and loss. Telling both is part of being true to the actual history.Amazon.com/games: As a follow-up to this, because this game is based on a very real and in many senses, tragic event for the forces involved and the civilian population, was there more pressure to stick to the facts in this game in order to get things right? And if so how did your team ensure this?Colonel Antal: Yes. We have done our best to make the game the most authentic WWII experience ever. Our goal is to put you in the boots of a true-to-life squad leader in the 101st Airborne during the fight for Hell's Highway. This game addresses the true history of the Battle for Hell's Highway, uses realistic tactics and requires you to lead a rifle squad in ways that no other game has ever done.Amazon.com/games: The game's story is centered around the events of an American squad, but since Operation Market Garden was an allied offensive, will players get to control, or even better, play as other allied forces? And will there be any playable German characters?Colonel Antal: The player will play as an American, Staff Sergeant Matt Baker. If you want to learn more about the British, the Dutch Resistance and the Germans, read my companion novel to the game, \"Brothers in Arms, Hell's Highway\", published by Ballantine Books, Random House. There will also be a history book out in January 2009 that explains the battle for Hell's Highway in day-to-day detail with maps, historical photos, screenshots from the game and much more. Shop for the Colonel's companion novel, \"Brothers in Arms, Hell's Highway.\"Amazon.com/games: I've read thatHell's Highwaywill contain a whole new multiplayer experience. Can you shed some light on how this experience is different from what previous games in the series offered?Colonel Antal: Multiplayer is really exciting. Our multiplayer design is different from other games because it brings squad game play on-line. We created a team based game, where the team-based aspect is about squad organization. The game will select (or players will vote on) a commander on each team. There can be up to 20 people in the game, 10 per team. The teams will go after objectives in each map that will be resolved in rounds.Amazon.com/games: A common criticism in squad-based games is that    AI enemies engaged in singleplayer modes are too easily outwitted, which is    obviously something that should not happen on a real battlefield. Was dealing    with this a consideration in the development ofHell's Highway?Colonel Antal: Yes, the team did a good job at creating a robust enemy AI that is clearly a tough opponent. Players will be excited about this feature.Amazon.com/games:Hell's Highwaywill feature a wide variety of weapons, not only used by US forces, but also those of allied troops and the Germans. Are all of these usable by any character and if so does each have specific ammo?Colonel Antal: All the small arms -- pistols and rifles -- will be useable, as well as most of the crew served weapons (like machine guns). Players can choose from semi-automatic rifles such as the M1-Carbine and M1-Garand, to machine guns such as the M1A1, bazookas such as the M9A1 and pistols. To check out all the weapons you can use and see them in action, check out the website (www.brothersinarmsgame.com in 'the game' section).Amazon.com/games:Hell's Highwayis the firstBrother in Armstitle to come to Next-Gen platforms. How much has the visual clarity made possible on these platforms helped in the series' ongoing quest for authenticity?Colonel Antal: The visual clarity is stunning in this game. It makes use of the Unreal 3 Engine technology to deliver incredibly realistic, authentic and cutting-edge 3D environments. The game also has unprecedented character design - with lifelike characters who look, talk, move and think with incredible realism.Amazon.com/games:Hell's Highwayis the third game in the series featuring Sgt. Matt Baker, and now Sgt. Joe Hartsock. These two have differing views on the acceptable costs of war and have traded off command duties in the last two games. InHell's Highwayboth lead separate squads, but Sgt. Baker appears to be front and center. Will the game feature the ability to play as either sergeant? And regardless, is this dichotomy of outlook regarding command as much an attempt at realism in the field as anything else in the game?Colonel Antal: The player will play the role of Baker. The story of Baker and Hartsock, and their different approaches to leadership is a vital part of the story that I many of our fans will find intriguing.Amazon.com/games: I don't recall tanks playing too much of a role in earlierBrothers in Armsgames, but one of the nicer videos I've seen indicated that they might be prominent inHell's Highway. This seems a nice touch considering that Operation Market Garden's objective was to secure a path for armored units crossing into Germany. What exactly will players be able to do with tanks and what other new units and/or changes to the control scheme can players expect to see?Colonel Antal: The player will be able to fight as part of a Sherman Firefly crew and will be able to battle German Panzers head to head.Amazon.com/games: When last I sawHell's Highwaydemoed, one of the things that stood out in my mind was the destructibility of environments and cover. Considering that the game in filled with weapons of varying destructive power, I thought this was a fantastic and natural addition. Can you give a few details on this for our readers?Colonel Antal: Destructible cover allows the player greater tactical    flexibility. Now you can create a flank by blowing away flimsy cover that would    normally block your maneuver. The destructible cover system was modeled using    real physical properties and behaviors, so weapons will actually damage, dent,    scorch and destroy the world around you. It's a great addition to the game that    gives players a truly authentic experience.Amazon.com/games: Having grown up myself watching movies likeA Bridge Too Far,The Guns of Navarone/Force 10 From Navarone,Where Eagles Dare,The Dirty Dozen,Kelly's Heroes,The Longest Day, etc. I've often wondered why the events of WWII have not been more heavily mined for game subject matter. With the continued success of theBrothers in Armsfranchise and others, as well as the power of Next-Gen technology, do you see this changing?Colonel Antal: I strongly believe that powerful, dramatic human stories provide an exciting medium for video games. WWII was a vast WORLD WAR with countless powerful, dramatic, human stories. Anyone who is bored with WWII hasn't studied the war in depth. The stories from WWII have importance relevance to us today and are archetypical examples of the moral dilemma of war. No sane person wants war, but if you value life and liberty, sometimes you are forced to fight. I expect that we will be telling these stories and incorporating them into our games for many years to come.Amazon.com/games: Since the framework of theBrothers in Armsseries is the allied invasion of German-occupied Europe and the battles that would eventually make up the march towards Berlin/the race to beat the Red Army there, can players expect to see more from Sgt. Baker and his squad in the future, perhaps at the Battle of the Bulge and beyond?Colonel Antal: As long as I have anything to do with it, the answer is YES.Amazon.com/games: Finally, because it's interesting to pick the brains    of people behind the games, do you mind telling our readers what games you are    playing and/or what you are reading these days? Also, I know that you have authored    several fiction and nonfiction books as well as articles. Are you working on    anything new that you might want to tell us about?Colonel Antal: I'm an Airborne-Ranger and have been a combat officer all my adult life. I pretty much like to play anything with WAR in the title!Many thanks to Colonel Antal for taking taking some time to give us his insights  into the impact that the historical events of WWII, as well as actual combat tactics,  have played in the creation ofHell's Highwayand theBrothers in Armsfranchise as a whole. We wish him, Gearbox Software and Ubisoft much success with  the new game and look forward to the next installment in theBrothers in Armssaga, where players may find the Screaming Eagles of the 101st Airborne fighting  their way to Berlin and an eventual rendezvous with VE day.--Tom Milnes, Freelance Contributor", "price": 28.7, "imUrl": "http://ecx.images-amazon.com/images/I/61gHe5Ex-hL._SY300_.jpg", "related": {"also_bought": ["B000PE0HBS", "B0009Z3IWS", "B000WSE2WM", "B0002CHIWY", "B000G7YRHO", "B000TI836G", "B0009S4UOA", "B000OCXK6A", "B003Q53VZC", "B001OAKV3G", "B001AWIP68", "B008E6ZXT0", "B000O5DPJE", "B00095LEEW", "B000XYUVAC", "B004PFS9OK", "B00009X3SY", "B000A0XSP4", "B001RTCOWK", "B0050SY5BM", "B005EZ5GQY", "B000X25GX6", "B002IGIW1I", "B000BLM5Q0", "B00320JDWG", "B000R0RHPY", "B0001I9YE4", "B00006JC48", "B001CRQYBO", "B001QXNBJM", "B00A8306C6", "B001D25M1Q", "B000SFK0NO", "B0050SYPV2", "B000WEQL02", "B000ZK698C", "B00069BV7G", "B0008GJRQ4", "B002SRSQ72", "B003VWGBC0", "B00G9DFLP6", "B00G6MW5CC", "B002BSA1MQ", "B000SFK0MU", "B0009Z3IXC", "B000M4M7BO", "B001UWGDC6", "B003JVKHEQ", "B000A0EFJW", "B0016B28Y8", "B000G7PMXC", "B001ASJISG", "B0016NRS96", "B00149ILCK", "B001TOQ8MU", "B000RHZ9JI", "B000ZK9QD2", "B000FRS9II", "B001NY42JC", "B00269QLI8", "B000H94PVO", "B003VKLA6E", "B0009WPZM2", "B000GV4JQE", "B0058VI1SO", "B0020KXYPG", "B001ASJIRM", "B000CBVC0Y", "B0050SY9WC", "B002V16T0Q", "B004EW7LSY", "B000R0RHA4", "B000LXIO6I", "B00163LW7A", "B000SQ5LQ4", "B0042GW7C2", "B000BLNFPA", "B0047S4642", "B0050SY77E", "B0010AYJXI", "B003P9C6QY", "B000ZK9QFK", "B005EZ5GUU", "B008AEE02M", "B00354NAYG", "B001HWB68K", "B001TOQ8J8", "B0023CBY4E", "B0091D2T8S", "B002I0HBZW", "B000GPVUOY", "B004UDLRMS", "B003S2MXRA", "B003O6E9T0", "B0037LTTRO", "B0030GBUCS", "B0050SYV70", "B000WCN8IW", "B000HCQK0A", "B000O5DS32"], "bought_together": ["B000PE0HBS"], "buy_after_viewing": ["B000PE0HBS", "B0009S4UOA", "B000G7YRHO", "B000TI836G"]}, "salesRank": {"Video Games": 4776}, "categories": [["Video Games", "Xbox 360", "Games"]]}