{"asin": "B00C1006ZG", "related": {"also_viewed": ["B001FWXJ4G", "B00CQ7XQY2", "B000052XQK", "B005Y4SXD8", "B00JS68C9I", "B00C7KTJFS", "B0010H0QFG", "B00BZZCNHM", "B00C0Y03VU"], "bought_together": ["B00BZZCNHM", "B00C0YP71Q"]}, "title": "MelanSol 100% Natural Sunburn Relief Gel, 3.4 Ounce", "price": 29.99, "salesRank": {"Beauty": 256939}, "imUrl": "http://ecx.images-amazon.com/images/I/31WnApuNp-L._SY300_.jpg", "brand": "MelanSol&reg;", "categories": [["Beauty", "Skin Care", "Sun", "After Sun"]], "description": "Sunburn and sun stressed skin is something you never expect, however, when it does occur, having effective chemical free relief that strikes at the heart of what is causing your pain and suffering is priceless. MelanSol sunburn relief gel is formulated with strong natural antioxidant technology that immediately soaks in and eliminates free radicals that have overrun your body's natural ability to protect itself from them. When the free radicals are gone, your pain, suffering, redness, and hot skin will greatly diminish. If you apply this gel as soon as the sunburn has occurred, you will greatly limit, or even eliminate, the amount of peeling you experience in the days afterwards. It contains a good amount of aloe, yet aloe alone is not enough. The 15 natural ingredients in melansol have been hand selected because they are natures best at controlling inflammation, rejuvenating and repairing skin, and eliminating the cause of your painful condition. This formula is also highly effective on sun stressed skin, skin irritations, contact dermatitis, skin inflammation, eczema, and psoriasis. The average sunburn product relies on chemicals combined with lidocaine, a topical analgesic that numbs your skin so you don't feel so bad. You might feel better, however, because you haven't eliminated the real cause of the sunburn, the excessive amount of free radicals, your skin damage will continue without being halted. A common sense sun care plan should always include an effective 100% natural sunburn solution and melansol is one of the best. Its convenient travel size tube is light and easy for any trip. Keep it on your boat, in your beach or sport bag, under your medicine cabinet, just about anywhere so it's ready to assist you when you need it. For increased hydration, use melansol sunburn relief gel together with melansol 100% natural moisturizer."}