{"asin": "B004U9USEA", "description": "Enjoy a rich, brilliant viewing experience wherever you roam with the Android-powered Samsung Galaxy Tab mobile tablet--a powerful, entertainment device ideal for home or on the go. Weighing just 1 pound, it features a vibrant 7-inch touchscreen display with 3D-like graphics, speedy 1 GHz processor, and the Android 2.2 operating system--all in a sleek and compact form factor.The exceptional 7-inch screen is designed for reading books and magazines, watching movies, playing games, and more (seelarger image).With integrated Google technology, the Galaxy Tab brings one-touch access to the popular Google mobile services millions use every day, including Google Search by voice, Google Maps with Street View, Gtalk, YouTube, Picasa, and contacts/calendar synchronization. And through Android Market, you'll get access to thousands of useful applications, widgets and fun games to download and install on your phone, with many more apps being added every day.The Galaxy Tab offers full support for Adobe Flash Player 10.1 for accessing Flash-enabled websites, watching video and playing games, and with built-in support for ultra-fast Wireless-N Wi-Fi, the Galaxy Tab's portable screen is ideal for watching the latest movies and entertainment.It's outfitted with a rear-facing camera for photo capture and sharing as well as a front-facing camera for video chat using the pre-loaded Qik voice and video app. The Galaxy Tab is also pre-loaded with the Kindle for Android app for reading your Kindle books on the go, Slacker Radio for listening to free, streaming personalized radio, and the Asphalt 5 HD driving game (learn moreabout these apps below).Designed to fit in one hand, typing messages or notes is simple and easy with the Galaxy Tab's virtual QWERTY keyboard with Swype technology, which allows you to input text faster and in a more intuitive way with one continuous finger motion across the screen keyboard. Other features include Bluetooth 3.0 wireless connectivity for hands-free devices and stereo music streaming, microSD memory expansion, HDMI video output (via optional dock), and up to 8 hours of battery power.Perfectly sized for your hand (seelarger image).Samsung Social HubOffering one-stop shopping for all your updates, the Samsung Social Hub all your social networking services, messages, personal and business e-mail, calendars and contacts. It's built around Messaging and Contacts, both of which initiate the sending and receiving of information--whether it is e-mail, instant messaging, social network updates or SMS messages. Additionally, calendar information from portal calendars, such as Google Calendar, and social networking services are displayed together in one calendar with two-way synchronization.The familiar text messaging experience is enhanced with group messaging and \"reply all\" functionality for up to 10 contacts, a threaded conversations format, a consolidated inbox, and enhanced multi-media display.Seelarger image.Key FeaturesIntegrated GPSfor navigation and location-based services7-inch multi-touch interface(1024 x 600-pixel resolution)Powered by the Android operating system(version 2.2) with deep integration of Google services, access to thousands of apps via the Android Market, and support for Adobe Flash 10.1.1 GHz Samsung Hummingbird processorspeeds up everything--from playing games to watching shows to opening files from work.Virtual keyboardSwype input systemallows you to input text faster and easier by gliding your finger around the keyboard, moving from letter to letter in one continuous motion. The Swype technology then calculates what word you're intending to type (learn morebelow).Samsung Social Hub provides one stop for all your updatesintegrates all your social networking services, messages, personal and business e-mail, calendars and contacts.3-megapixel rear-facing camerawith flash captures still images and video that that can be edited, uploaded, and shared.1.3-megapixel front-facing camerafor video chatMulti-format media playercompatible with MP3 and AAC music files plus DivX, XviD, MPEG4, H.263, and H.264 video files.Ultra-fast Wireless-N Wi-Fi networking (802.11b/g/n)for accessing home and corporate networks as well as hotspots while on the go.Next-generation Bluetooth 3.0 connectivityprovides faster throughput while minimizing on power requirements. It's compatible with new Bluetooth 3.0-enabled devices as well as backward compatible with older Bluetooth-enabled peripherals such as headsets and printers. It includes profiles for communication headset, hands-free car kits, and the A2DP Bluetooth profile--enabling you to wirelessly stream your music to a pair of compatible Bluetooth stereo headphones or speaker dock.Memory expansion via microSD card slotwith support for optional cards up to 32 GB.Vital StatisticsThe Samsung Galaxy Tab weighs 13.4 ounces and measures 7.48 x 4.74 x 0.47 inches. Its 4000 mAh lithium-ion battery is rated at up to 7 hours of battery life. It runs on the 850/900/1800/1900 MHz GSM/GPRS/EDGE frequencies.COMMENT: Service Section ==========================Pre-loaded Apps on the Samsung Galaxy TabKindle for Android:Pre-installed on the Galaxy Tab, the Kindle for Android application lets you shop for hundreds of thousands of books in the Kindle Store, including New York Times Best Sellers and new releases from $9.99. Use Amazon's Whispersync technology to automatically synchronize your last page read, bookmarks, annotations, and more across your various devices --- including Kindle, Kindle DX, PC, Mac, iPad, iPhone, iPod touch, BlackBerry and Android phones.Slacker Radio:With millions of songs from thousands of artists, Slacker is the best way to discover new artists and hear your favorite music. Listening to Slacker is as easy as selecting one of over 120 DJ-programmed genre stations or searching for your favorite artist or song. As you listen, you can tell Slacker what you like and don't like with the click of a button. Get the ultimate in music discovery while you listen with detailed artist biographies, in-depth album reviews and more. Upgrade to Slacker Radio Plus for unlimited skips, ad-free listening, complete song lyrics and more for only $3.99/month.Asphalt 5 HD (Gameloft):Get in, start up and punch it in the fastest cars ever created by some of the most prestigious manufacturers. Everything you've ever dreamed of doing behind the wheel is here in stunning HD graphics that put you right in the driver's seat. Take a ride in over 30 of the fastest, most prestigious cars you've ever dreamed of, from manufacturers like Ferrari, Lamborghini, Audi and Ducati. Challenge yourself to 8 different racing events including Drift Contest, Cop Chase, Time Attack, Duel Mode, Last Man Standing and EscapeSwype KeyboardAn alternative to the Android virtual keyboard, the Swype virtual keyboard allows you to input text by swiping the finger with one continuous finger or stylus motion across the screen keyboard. Based on testing, speed and accuracy are equal to or better than the traditional keyboard-tapping method. You can activate the Swype keyboard by pressing and holding in a text field, wait for popup to appear, click Input Method, and then select Swype.", "title": "Samsung Galaxy Tab (7-inch, 16GB, Wi-Fi)", "price": 352.07, "imUrl": "http://ecx.images-amazon.com/images/I/41yoP5hk0ML._SY300_.jpg", "related": {"also_bought": ["B004BCPYFE", "B004DBAT2Q", "B0047EM82I", "B004BHDZIW", "B007P4VOWC", "B005N130Y4", "B00HWMPSJC", "B007YUISN0", "B006MNTRJY", "B00636FQ86", "B00FJ92RYO", "B004DB7ZZK", "B007M50PTM", "B004OB0EBQ", "B0053HSZQG", "B004MEZ3H0", "B00D4CVZCI", "B006DQWIKK", "B004684KTY", "B00DVT373E", "B007KFXIDE", "B00D02AG7C", "B00AZ38EIM"], "bought_together": ["B0047EM82I"], "buy_after_viewing": ["B00D02AGU4", "B00HKEI3I0", "B00J8DL6UI", "B00J8DL78O"]}, "categories": [["Electronics", "Computers & Accessories", "Tablets"]]}