{"asin": "B00824948U", "related": {"also_bought": ["B009GHYMB6", "B00A3WRM5G", "B008BSCWXQ", "B00D2BZVDA", "B00C7J5ZC0", "B00FS5L9D4", "B009NX2EU4", "B00AAKO646", "B009WRNSF6", "B00CTUOSYS", "B007NFJN0I", "B00CW9CDOS", "B00JK5OW8C", "B009WHV3BM", "B00EO4A7L0", "B008EQFI86", "B00AAL0QLW", "B00G8TIRMA", "B007NFI656", "B009WQOS1U", "B005LY553M", "B007EICZTU", "B0056C4WN8", "B00CPK46TY", "B00FMF2DOO", "B00IBDOB5I", "B00DCFPW3A", "B00H4YHXN2", "B008A8851U", "B00CMXF6NE", "B00CXGF84M", "B008UH8SRM", "B009GHYM0M", "B00GTGETFG", "B00CTUOV7C", "B00I0BBN1G", "B00GUAIB1Y", "B00CQVKSK8", "B004URTJ6U", "B00HQO5VJ8", "B00GUPPGSA", "B00D856NOG", "B007B6YPAM", "B001EAQTRI", "B00HGLOQ24", "B00B3OA7R8", "B00BHHBV5I", "B000YK1JAG", "B00GX71GNO", "B00004WCCL", "B002HU27UW", "B009K916ZK", "B001B8QUS6", "B002VPE1QG", "B002NU5OAQ", "B00HMDYH2U", "B00DF2485S", "B004K2WZS4", "B003SE6LD0", "B004LTEUDO", "B002BZH2LM", "B000P0PF9G", "B0058MJX4O", "B00J53T9WS", "B007QFATEO", "B00CSJ50HY", "B0042ESTSK", "B00HX40Q3C", "B00BHN05H2", "B008TLE1P2", "B004C9O6T6", "B009SYZ8OC", "B008O6R5ZK", "B004GUS4XK", "B005KWPJ04", "B00B3Y4FAS", "B00FB5RBJM", "B004YEBK66", "B00006IBLN"], "bought_together": ["B009GHYMB6"], "buy_after_viewing": ["B00A3WRM5G", "B00JK5OW8C", "B00DL4CH2G", "B009GHYMB6"]}, "title": "Satechi BT MediaRemote Bluetooth Multi-Media Remote Control for iPhone, iPad &amp; iMac, MacBook Air, MacBook Pro, MacBook, and Mac Mini", "price": 39.99, "salesRank": {"Electronics": 1401}, "imUrl": "http://ecx.images-amazon.com/images/I/41JrNk-ufuL._SY300_.jpg", "brand": "Satechi", "categories": [["Electronics", "Computers & Accessories", "Laptop & Netbook Computer Accessories", "Chargers & Adapters"]], "description": "Compact and lightweight, Satechi BT Media Remote is the ultimate multi-media companion for your Bluetooth iOS device. Enjoy the convenience of controlling your iPhone or iPad media wirelessly whether it is connected to your TV, dock station or car stereo.Multi Media Remote ControlConnected to your TV, a dock station or car stereo you can, play, pause, forward, rewind and mute or adjust the volume of music or video content on your iPhone or iPad from upto 33 ft. away.Bluetooth 3.0BT Media Remote supports Bluetooth 3.0 HID, Class II profile. It is compatible with: iPhone, iPad & other OS compatible devices (iMac, MacBook Air, MacBook Pro, Mac mini, iPod Touch iOS 4 or higher, etc.)Siri ActivationThanks to the Home button on BT Media Remote, you do not need to reach your iPhone to activate Siri while you are driving or jogging. Just long press the Home button on the remote and it works.Camera Remote ShutterThe volume up button on BT Media Remote will trigger the Camera app to take a photo just like a camera remote shutter. This means you can place the iPhone on a tripod or stand, and snap a blur-free shot. The remote is also perfect for group shots, where you can be included!!6 Months Battery LifeBT Media Remote powers with two CR-2025 coin cell batteries and boasts up to 6 months battery life.Presentation RemoteBT Presentation Remote works with Keynote on Bluetooth enabled Mac computers. You can start the presentation with play button, and go to next and previous slides with forward and rewind buttons.What's in the BoxSatechi BT Media Remote, User ManualNOTE:Only controls Keynote on Mac OSX computers (not iOS devices). Please search for the Satechi Bluetooth Smartpointer; this device is capable of controlling Keynote in iOS."}