{"asin": "B000A6NV0U", "description": "With high-definition optical technology, four-way scrolling, comfort for righties and lefties, customizable buttons, and more, the Microsoft Comfort Mouse 3000 is the perfect upgrade to your existing mouse. An integrated scroll wheel lets you scroll through documents and Web pages more quickly and easily with this ergonomic, four-button mouse. Plus, the new Magnifier lets you easily enlarge and edit details.Zoom in on your work with the innovative Magnifier.Use the scroll wheel to scroll horizontally and vertically.Microsoft High-Definition TechnologyWhether you're working on a document, perusing a Web page, or playing the latest video game, you can enhance your performance with the Comfort Mouse 3000's high-definition technology. It delivers more precision and responsiveness while offering smoother tracking on more surfaces than ever before. To put it simply, it's the most advanced tracking system available.Full TiltScroll up and down and side to side more smoothly, efficiently, and easily with the innovative four-way tilt wheel. It's simply a more efficient way to navigate documents, spreadsheets, and Web pages. The entire scroll wheel tilts from side to side, acts as a button, and reacts to how quickly you roll the wheel to enable smooth, accurate maneuverability. For example, if you're working with a super-wide worksheet, you can tilt the wheel from side to side to scroll right and left, without clicking tiny scroll arrows.All Hands WelcomeLefties rejoice! The Comfort Mouse 3000 is made to be used in either hand, making it highly versatile. No matter which hand you use, customizable buttons offer quick access to the media, programs, and files you use most often.", "title": "Microsoft Comfort Optical Mouse 3000", "price": 19.95, "imUrl": "http://ecx.images-amazon.com/images/I/41YTCx3idgL._SX300_.jpg", "related": {"also_bought": ["B000A6NUU6", "B0009ZBRS0", "B001OAR26K", "B000A6PPOK", "B004V94FFW", "B004SUIM4E", "B00A1702Z0", "B004SUILFO", "B004V94F5C", "B003ELVLKU", "B005ELS9RG", "B000A6NUVA", "B005058AE8", "B0096KE5GA", "B004MWVLY6", "B000098XIJ", "B003BEDPHW", "B00902BFGC", "B003UT2E8E", "B00000JRRD", "B009SPWCFY", "B005DLDTAE", "B003HFCDLY", "B0013ITQA8", "B002B3YCQM", "B003FXM4IA", "B004W2JL2A", "B0039L50J8", "B003BEDPHM", "B002G9OZXG", "B002ZIN9DU", "B00006HTZ0", "B0019804U8", "B003BEDPI6", "B004SUO3VK", "B003B4BBFK", "B003Y3BJ7S", "B00002EQCW", "B00002QUKU", "B000Q8UAWY", "B005OCQBKM", "B0007T27H8", "B0000BVYT3", "B0017D5Z40", "B003L62T7W", "B001TH7T2U", "B003FOWIXK", "B0036Q7MV0", "B004W6JOYG", "B002DPUUL4", "B005058AHU", "B0000X0VCY", "B005JN9310", "B000R9AAJA", "B003Y24DEU", "B001TH7GUU", "B008XB0JNG", "B001IF252M", "B004W2JL3Y", "B001MSU1HG", "B005B9A2DU", "B004TS1J1I", "B001F42MKG", "B001F51G16", "B000FBK3QK", "B00H09BOXQ", "B0043T7FXE", "B005ARQV6U", "B006Y5UV4A", "B005HMKKH4", "B003NR57BY", "B00006RVPW"], "buy_after_viewing": ["B000A6NUU6", "B002B3YCQM", "B00A1702Z0", "B00902BFGC"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Mice"]]}