{"asin": "B001MLZKAQ", "description": "A \"must have\" accessory for all NetBook users. The SAMSUNG 8X Tray load External Slim DVD Writer is designed to provide the highest quality DVD functionality in a sleek design that is not much larger than the CD/DVD itself. Simply plug it into your USB port and you are ready to watch movies, install software, copy photos, play music or do anything that you desire. Furthermore, this model supports both 12 cm &amp; 8 cm discs. And the Manual Disc Eject function can let the disc ejected even when the power is off.USB Powered. No need for an AC Adapter.Automatically updates firmware to support latest mediaWhat Is It For and Who Needs It?Add the SAMSUNG 8X External DVD Writer to a Netbook, laptop, or desktop and users gain high-speed CD/DVD read/write functionality in an ultra-slim package.Convenience and SimplicityWith features like Easy eject, auto updates and USB power, users are assured of extreme ease of use.The SAMSUNG 8X External Tray Load DVD Writer. Performance and Style at Your FingertipsThe SAMSUNG 8X External Tray Load DVD Writer's Buffer Under Run Technology prevents buffer under run which occurs in high-speed writing when the speed is faster than the data transfer. Because of this technology, multi-tasking is possible while data is being written on the drive, thus improving the user's productivity. Buffer Under Run Technology also enables high speed writing in low performance PCs.Key FeaturesFull DVD drive power in an ultra-slim package. Perfect for Netbook users.Samsung quality that users can count on.What's in the BoxSAMSUNG 8X External Tray Load DVD Writer, USB Cable, Nero Software Suite, Manual", "title": "Samsung USB 2.0 8x DVD Writer External Optical Drive SE-S084B/RSBN", "price": 46.0, "imUrl": "http://ecx.images-amazon.com/images/I/312yT3uBUEL._SX300_.jpg", "related": {"also_viewed": ["B00DBV28TG", "B009QBIZ60", "B005KQ0S8S", "B008X0TX0W", "B009ZMV0RG", "B004ZMVQRA", "B00AW5E9MI", "B009ZMV0F8", "B004K2Z4MS", "B00C2AMK2M", "B00AWRTXVS", "B00IP99CRU", "B00448ABGM", "B0018LO1R8", "B003M0NT1M", "B002C1BBU8", "B008AJLPYS", "B004W88SBE", "B003N3BLAO", "B0027JPO6C", "B007WLP0BY", "B009NRPKVU", "9573212919", "B004CFDJ2A", "B00GD78R3Q", "B005N2UE2O", "B006HUMYCO", "B009X0FQNY", "B006DUDWXI", "B002782LTG", "B00632SOD4", "9573212900", "B00C3AW5SA", "B003AVGN5M", "B0027C8M8G", "B001TVAU0E", "B001U02JZ8", "B00IYAXBAO", "B009661Y8G", "B002B7I49E", "B001UDVUNW", "B003AVAUC4", "B006B7R9BY", "B0032GU1LW", "B001ECT5K4", "B005HN1ED2", "B001UDTTJE", "B003DM0W8W", "B003YT578O", "B006DUJ9NA", "B0027CEMW6", "B00A64SIXQ"], "buy_after_viewing": ["B00DBV28TG", "B009QBIZ60", "B008AJLPYS", "B005KQ0S8S"]}, "categories": [["Electronics", "Computers & Accessories", "External Components", "Optical Drives", "DVD Drives"]]}