{"asin": "B005GQG7IC", "description": "Protect your favorite gadgets with a screen protector! Guards against scratches, smears, dust and dirt, and keeps your LCD screen in perfect condition. This LCD Screen Protector provides a full coverage from dust and scratches. Screen protectors provide crystal-clear visibility and do not interfere with touch-screen operation. Fits the Toshiba Thrive 10.1 Touch Screen Tablet screen. Easy to apply and can be removed and washed for reuse, without leaving residue behind!Includes: 3 Pieces Anti-glare Toshiba Thrive 10.1 Touch Screen Tablet Screen ProtectorPLEASE NOTE: Matte material protectors do produce a slight pixellation of the screen, as this is the natural effect created by the Matte (anti-glare) frosted texture. It is simply an unavoidable 'Law of Physics'. You will see this pixellation on all anti-glare screen protectors from all brands (many of which are noticeably more extreme than ours).If you require a perfectly 'crystal clear' screen to enjoy the device's screen to its full extent, we strongly recommend purchasing our (glossy surface textured) Crystal Clear edition instead (B005GQG1A6)", "title": "GreatShield Ultra Anti-Glare (Matte) Clear Screen Protector Film for Toshiba Thrive 10.1 Touchscreen Tablet (3 Pack)", "price": 10.95, "imUrl": "http://ecx.images-amazon.com/images/I/41UxZCDRwvL._SY300_.jpg", "related": {"also_bought": ["B0052P6DQI", "B004YIFP04", "B004YIFOZK", "B004YIFOP0", "B005FW56WA", "B004YIFODM", "B005HFF65C", "B004YIFOPK", "B004YIFODW", "B004YIFOOG", "B004YIFP0E", "B007DKYLVY", "B0072MPDZQ", "B005MN4NS0", "B004YIFOE6", "B004YIFOEG", "B005JDUMCO", "B004YIFOPU", "B005HL4Z5S", "B004JQN670", "B0069R0MB0", "B005DIP2Z2", "B004YIFONM", "B009TJVWFK", "B005ZVVLNY", "B005MN4N4Y", "B00GD84OBO", "B00620MROY", "B0063BWUKI", "B004YIFOZ0", "B005U1C6ZQ"], "bought_together": ["B004YIFP04", "B004YIFOPK"], "buy_after_viewing": ["B004YIFP04", "B004YIFOPK", "B00620MROY", "B005HL4Z5S"]}, "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Screen Protectors"]]}