{"asin": "B001IOHAVO", "description": "Built-to-last, the HP Wireless Elite Keyboard (model FQ480AA) provides a full featured keyboard that combines style and high-tech key design to deliver an ultra-thin design and silent operation.The ultra-thin and stylish HP Wireless Elite Keyboard.Features &amp; SpecificationsHigh-tech design:The black finish and silver accents along with the low profile key design offers a distinctive style. The reduced foot-print design saves desktop spaceSilent operation:High-tech scissor switch keyboard design offers a quiet experience.Wireless freedom:Free yourself from wires with wireless keyboard--up to 32 feet. Advanced 2.4 GHz wireless technology for less delays or dropouts. The included wireless USB mini-receiver installs effortlessly and eliminates clutter. Wireless mini-receiver has connect light and PC status blue-LEDGet more control:Control your entertainment experience with a comprehensive set of multimedia keys.Convenient access for multimedia controls3-buttons for easy volume controlHP TouchSmart PC hot keysEnergy efficient:Conserve energy with PC sleep button. Monitor battery level with convenient on screen battery level indicator. Long battery life (keyboard -- 12 months typical)Easy to keep clean:Spill resistant keyboard for easy cleaning.Adjustable keyboard height with 2 different positions2.4 GHz USB wireless receiverCompatible with Microsoft Windows XP, Windows Vista, or Windows 7Compatible with HP PCs and non-HP PCs1 year limited warrantyWhat's In The BoxHP Wireless Elite Keyboard, USB wireless receiver, batteries, software CD and documentation", "title": "HP Wireless Elite Keyboard", "price": 59.99, "imUrl": "http://ecx.images-amazon.com/images/I/31dUeTejgSL._SY300_.jpg", "related": {"also_bought": ["B009T8BCD8", "B0072NZ292", "B008AGF6WS", "B005HNHRA6", "B006YK0LSQ", "B004URDE5M", "B008AGF696", "B00CG5L8Y4", "B008AGF664", "B005NIFB7G", "B00B8DQV92", "B00CG5L916", "B003NR57BY", "B0043T7FXE", "B00BWF5U0M", "B008AGF6SM", "B00556O4YC", "B005EJH6Z4", "B009CP4PIW", "B0002LCZNC", "B006GQHRU8", "B007T1CTDE", "B004FKBZ8M", "B002HWRJBM", "B004S4R5CK", "B00006HO37", "B00B17C5KO", "B00B332A9C", "B007PJ4PN2", "B004N627KS", "B005H3I38Q", "B00158Q2OY", "B00DR8LB4Q", "B00DX5CY6C", "B007ZS3O62", "B0055Q5R9I", "B00B0TXEEY", "B00004Z5RA", "B003TG75EG", "B00196T0LE", "B000FDR47E", "B005H3Q59U", "B003ELVLKU", "B005BZNDOO", "B00BIFNTMC", "B0000365QL", "B003VAGXZC", "B004JO16KG", "B006ZZGEUO", "B00AI8LI1O", "B002LK2F2I", "B001TH7T2U", "B00009V2QX"], "bought_together": ["B009T8BCD8"], "buy_after_viewing": ["B005HNHRA6", "B005NIFB7G", "B00BP5KOPA", "B007PJ4PN2"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Keyboards"]]}