{"asin": "B003FSTAGY", "description": "The TomTom XXL 550 is complete 5-inch widescreen navigation--and, since TomTom has the industry's most accurate and dependable maps, you'll have access to one million more miles of roads than you would using other GPS brands. Navigate to any location in the US, Canada or Mexico--or directly to one of 7 million preloaded points of interest. Finding your way has never been easier, using TomTom's new EasyMenu and spoken turn-by-turn instructions including street names.Complete 5-inch widescreen navigation.Expand your horizons with a 5-inch extra-wide touchscreen.The award-winning Fold &amp; Go EasyPort mount folds into the back of the device for maximum portability.Only TomTom has IQ Routes*. This exclusive technology evaluates routes based on actual traffic speeds, rather than posted speed limits, and will recommend the fastest route for the time of day. You'll always be directed to the quickest, most efficient route. Advanced Lane Guidance** provides extra clarity when navigating difficult junctions by showing you which lane to take, so you won't miss your turn or have to make dangerous lane crossings. Photorealistic images and a pulsing green arrow indicate exactly which lane to use.Eighteen percent of the nation's road information changes every year. With TomTom's exclusive Map Share On-Demand Updates, you have the ability to update your own map instantly or download verified updates from other drivers. Update your TomTom daily or whenever you wish.The \"Help Me!\" menu lets you travel with peace of mind. It provides added safety features so you can easily access local emergency providers such as police, fire stations, and hospitals. The \"Where Am I?\" feature pinpoints your exact location so you can accurately communicate it to emergency resources.The award-winning Fold &amp; Go EasyPort mount folds neatly onto the back of the device, so both are small enough to fit into your pocket or bag.Maps of US, Canada &amp; MexicoTomTom is known the world over for the accuracy and extensive coverage of its maps. TomTom maps include 1 million more miles of road than other GPS brands and have been rated highest in terms of quality and reliability.EasyMenuEasily access all of TomTom's powerful features through its simple and intuitive two-button menu. Just a tap gets you started, and easy-to-follow commands and recognizable icons lead you through a quick start-up process to get you on the road in no time.7 million Points of InterestComes preloaded with more than 7 million points of interest in over 60 categories. Easily find millions of gas stations, restaurants, hotels and more on your route. Or, seek out a new tourist attraction, nightlife spot or shopping center and navigate directly to it. Customize by adding your own favorites.IQ Routes*Despite posted speed limits, traffic traveling along a road at 8 a.m. moves at a different pace than it does at 2 p.m. Actual traffic speed is affected by rush hour, traffic light changes, pedestrian traffic, day of the week, and more. Only TomTom offers exclusive technology that evaluates routes based on actual traffic speeds, rather than posted speed limits, and will recommend the fastest route for the time of the day.Advanced Lane Guidance**TomTom provides extra clarity when navigating difficult junctions by showing you which lane to take, so you won't miss your turn or have to make dangerous lane crossings. Photorealistic images and a pulsing green arrow indicate exactly which lane to use.Announces Street NamesKeep your eyes on the road while your TomTom announces turn-by-turn directions, including street and place names.5-Inch TouchscreenExpand your horizons with a 5-inch extra-wide touchscreen. A wide screen allows an expanded driving view and easier menu operation.Fold &amp; Go EasyPort MountThe award-winning Fold &amp; Go EasyPort mount provides maximum portability. It folds neatly onto the back of the device, so both are small enough to fit into your pocket or bag and can be taken with you wherever you travel.Traffic Update Service* (Optional)Outsmart traffic. Optional traffic receiver accessory keeps you up-to-date on traffic conditions to minimize potential delays. Based on incoming traffic information, your TomTom will recalculate travel time and suggest alternate routes. Traffic updates available in the US and Canada.*Feature available in the US and Canada only**Feature available in the US onlyAll TomToms FeaturePlug &amp; Go--Works right out of the box.30 Day Latest Map Guarantee--Up to date, off the shelf.TomTom Map Share--Modify your own map and benefit from others' verified changes with TomTom Map Share.Help Me! Emergency Menu--Easily access local emergency providers such as police, fire stations and hospitals.TomTom HOME--Always up to date.Fuel Price Service (optional)--Know more, pay less.What's in the BoxTomTom XXL 550 device, EasyPort mount, USB cable, adhesive disk, car charger, and user guideAbout TomTomFounded in Amsterdam in 1991, TomTom has established itself as a global leader in navigation by being an innovative company with a strong brand, clear customer focus, and high quality products and services.TomTom is the world's leading navigation solutions provider with navigation products sold in 30 countries and in over 20 languages. To further our commitment to car navigation, TomTom acquired Tele Atlas maps in 2008 so we can continually provide the most up-to-date maps and intelligent routing.We have our own mapping company!Did you know that every year roads change by up to 40% in high-growth areas? Tele Atlas manages this by using the world's most comprehensive systems to identify and incorporate these changes into our maps with unprecedented levels of speed and accuracy. All TomTom devices benefit from the Tele Atlas advantage--more coverage, more points of interest, and more freshness and accuracy.Why TomTom?At TomTom, we believe that personal navigation should be as easy and safe as possible. We develop smart technology that gives you straightforward solutions, innovations to make life easy.", "title": "TomTom XXL 550 5-Inch Portable GPS Navigator (Discontinued by Manufacturer)", "price": 104.99, "imUrl": "http://ecx.images-amazon.com/images/I/41OZsY300RL._SX300_.jpg", "related": {"also_bought": ["B0050JK3PS", "B00BB2NLHA", "B002IY35GM", "B00BB2NLVQ", "B005DIZX1U", "B00IO299MQ", "B0096DM9YC", "B001ET5O70", "B001H4B0AC", "B002OL2NT4", "B001VEJEGK", "B003B3P2CY", "B0037BVSCI", "B007M4Z7GO", "B003ZX8B3W", "B001P3O764", "B001OWE4SM", "B004RCWG40", "B00171BFVO", "B00CRQUKQ4", "B004MYFTEW", "B008H66BH0"], "buy_after_viewing": ["B007M4Z7GO", "B007M52QR6", "B0057OCDQS", "B0057ODG6Y"]}, "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]]}