{"asin": "B001HSOFI2", "related": {"also_bought": ["B000VJRUKS", "B001B5CVNC", "B0041LXANI", "B002DM6W2I", "B0040702HU", "B0040702IE", "B00009RUCH", "B002R5AM7C", "B0016BXRB6", "B00272MT3A", "B0023B14TK", "B0040702I4", "B002R5AM7W", "B004AP96FQ", "B00BRDBI1O", "B001QZ5PDK"], "bought_together": ["B000VJRUKS", "B001B5CVNC"], "buy_after_viewing": ["B001B5CVNC", "B0041LXANI", "B0040702I4", "B000VJRUKS"]}, "title": "Flip MinoHD Video Camera - Black, 4 GB, 1 Hour (1st Generation)", "price": 199.95, "salesRank": {"Camera &amp; Photo": 1908}, "imUrl": "http://ecx.images-amazon.com/images/I/31LQ7YAWO0L._SY300_.jpg", "brand": "Flip Video", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "Introducing Flip MinoHDFlip MinoHD provides you the power of self-expression, enabling you to shoot and share your stories with the world.MinoHD Overview:Weighing only 3.3 ounces, MinoHD is the world&rsquo;s smallest HD camcorderSuper-slim, super-sleek design that fits into any pocket or purseSimple user interface features one-touch recording and digital zoom, making HD video easier and more fun than everHolds 60 minutes of HD-quality video on 4 GB of built-in memory; no tapes or additional memory cards requiredConvenient flip-out USB arm plugs directly into your computer to launch built-in FlipShareTMsoftwareBuilt-in FlipShare software lets you easily email videos, edit individual clips, make custom movies, capture still photos from video, and even upload video to sharing sites like YouTube and MySpaceInternal Li-ion battery recharges through built-in USB arm while you're plugged into your computerProduces incredible HD 720p (1280 x 720 resolution at 30 frames per second; 16:9 widescreen) video you'll be able to enjoy on your HDTVRecords high-quality H.264 videos that work with most video-playing applications, including Windows Media Player, QuickTime Player, and iTunesWatch videos instantly on TV with included connector cableInstant playback, pause, fast forward, rewind, zoom, and delete functionsThe World's Smallest HD CamcorderFlip MinoHD puts the power of HD video in your pocket. Flip MinoHD offers all the signature Flip Video features you love&mdash;sleek design, simple user interface, flip-out USB arm, rechargeable internal Li-ion battery, built-in editing and sharing software, instant uploads to YouTube and MySpace&mdash;plus stunningly crisp, clear HD-quality video.&nbsp;Weighing only 3.3 ounces and featuring a slim, sleek design that fits into any pocket or purse, super-small Flip MinoHD lets you capture life in HD anywhere you go.Flip MinoHD HighlightsClick here for an interactive tourStunning HD VideoFlip MinoHD is the world&rsquo;s smallest HD camcorder. But, in this case, small in size translates to high in quality. Flip MinoHD produces vibrant HD 720p (1280 x 720, 16:9 widescreen) video that can be enjoyed on any HDTV. Flip camcorders have earned a reputation for high-quality video, and MinoHD combines that signature Flip quality with the latest in HD technology. Its 4 GB of built-in memory lets you capture an hour of brilliant HD video, even in low-light situations. Plus, premier AAC audio means your videos will sound clearer than ever.The Power of HD in Your PocketFlip MinoHD offers the same features that have made Flip Mino a huge hit. Weighing only 3.3 ounces, Flip MinoHD features a super-sleek, super-portable design that truly puts the power of HD video in your pocket.This portability allows you to capture HD video almost anywhere you go: a morning hike, a lazy afternoon at the park, a late-night party, and everything in between. Like other Flip Video camcorders, MinoHD offers a simple user interface with one-touch recording, making it easier and more fun than ever to take HD-quality video. Simply power on and press record, and you&rsquo;ll be capturing HD video in seconds. When it&rsquo;s time to edit or share your videos, flip out the USB arm and connect to any Mac or PC to launch the built-in FlipShare software.Click here to learn more about FlipShare softwareBuilt-in FlipShare SoftwareMinoHD comes pre-loaded withFlipShare software, which makes it easy to organize, create and share your videos:Organize your videos.Drag and drop your videos into folders you've created, or use the automatic date-stamped folders.Create custom movies.Make movies featuring your favorite video clips, and add your own music to provide a more personal touch.Capture still-image snapshots.Use enhanced freeze-frame capabilities to grab a snapshot from any of the thirty frames that comprise each second of your video.Share privately.Send videos to your friends and family using attachment-free emails. Or create private Flip Channels to share your videos with specific groups of friends and family.Share with the world.Publish your videos directly to Facebook, YouTube and other sites, all with the click of a button.Recommended Companion Products and Accessories:"}