{"asin": "B000WOIFO2", "description": "The HipCase for the iPod touch is a folio-style case that gives you complete body protection, a padded flip-up cover with hidden inner pocket, a leather-covered belt clip, and total iPod access--all in one sleek leather package.The Ultimate Case for iPod touchConstructed of fine-quality leather and featuring a soft fabric-lined interior, the HipCase surrounds your iPod touch with sophisticated protection. Flip open the padded cover to reveal a hidden pocket--perfect for credit cards, IDs, or cash. Even when closed, you'll find access to the earbud jack as well as to the dock connector--which means you can plug in and sync your iPod without having to remove it from your HipCase.The The HipCase's sturdy, leather-covered belt clip ensures that your iPod touch will always be within easy reach. And with its clean lines and stylish construction, the HipCase is the perfect accessory--from a suit and tie to jeans and a T-shirt. Clipped securely to your belt or your backpack, the HipCase protects your iPod touch in style.What's in the BoxBlack DLO HipCase Folio for iPod touch.", "title": "DLO HipCase Leather Folio Case for iPod touch 1G, 2G, 3G (Black)", "price": 14.99, "imUrl": "http://ecx.images-amazon.com/images/I/31NX8DWWkVL._SY300_.jpg", "related": {"also_viewed": ["B001IZ8FTE", "B004Z788JO", "B004U8G20A", "B001U7EKKI", "B005ZWBLRO", "B001GEVUQC", "B0082FM0BM", "B0081SIXP2", "B000VXVHRQ", "B000WLWBI6", "B0084HRGVW", "B001JJRDVU", "B002ICN1GS", "B002CVTQ2S", "B009AJFUOI", "B0073K4DCG", "B0086U3QBQ", "B0041NPZE8", "B004SK62XW", "B000WLXO9Q", "B002RJPJ6C", "B001GEY0Y6", "B000CLGODY", "B002QCIHSM", "B005DOUASA", "B000WOK1Q2", "B001L5JJTQ", "B002AF5184", "B002SNGCAY", "B00CHQ3HZA", "B001AEED8U", "B003E4TOPG", "B002SN8X3S", "B0086U3QIO", "B003E4VR0G", "B0037OOF0W", "B009O6XJT0", "B004JPG4PW", "B000VXVHUS", "B00C2SNLHM", "B001GPCU1U", "B009QTCKU4", "B002M3TLHQ", "B00C3XCNFW", "B007CGFAPK", "B000Y9LWDG", "B002H9LNGW", "B0012JCYPC"], "buy_after_viewing": ["B001IZ8FTE", "B004Z788JO", "B001JJRDVU", "B004U8G20A"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Cases"]]}