{"asin": "B0001FSCZO", "categories": [["Electronics", "Computers & Accessories", "Data Storage", "Network Attached Storage"]], "description": "Network Storage Link for USB 2.0 Disk Drives Easily Add Storage Space to Your NetworkNow you can quickly and easily add gigabytes of storage space onto your network with the Network Storage Link from Linksys. This tiny network appliance connects USB 2.0 hard drives directly to your Ethernet network.You can connect up to two stand-alone USB disk drives of any size, and access them from anywhere on your network. You can even plug a USB flash disk into the Network Storage Link, for a convenient way of accessing your portable data files. The Network Storage Link can also be set up so that your storage devices are accessible from the Internet -- files can be easily downloaded via your web browser. Your files can be available publicly, or create password-protected accounts for authorized users.Installation of the Network Storage Link is simple -- just plug it directly into your 10/100 Ethernet network, and attach your USB 2.0 hard drives or flash disk. It can self-configure to your network via DHCP or you can use the built-in utility to manually configure it. With the speedy USB 2.0 interface, you'll get quick response times with even your largest files.The Network Storage Link features built-in disk utilities, accessible through your web browser. You can format new disk drives, and scan drives for errors. The built-in backup program lets you schedule full, incremental, or synchronization backups of your network drives to the Network Storage Link, or vice versa. It will even send you an email message when a hard drive gets nearly full, completely full, or has an error.The Network Storage Link is a fast, simple, flexible and economical way to add storage to your network.", "title": "Cisco-Linksys Storage Link for USB 2.0 Disk Drives NSLU2", "price": 47.95, "imUrl": "http://ecx.images-amazon.com/images/I/41XEWAYEK7L._SY300_.jpg", "brand": "Linksys", "related": {"also_viewed": ["B005C31H34", "B005IULTI4", "B0037NYKW6", "B001OC5J9U", "B0047T7PTO", "B00594BR4A", "B005TJLU24", "B00DW1UNS8", "B005GM1Q1O", "B00004SB96", "B003IT6YFU", "B004UBU3SY", "B002LB8XFK", "B006I5MKZY", "B0093NUFVE", "B000QGTNWY", "B0009RML8S", "B0036SDJ3I", "B00776V3DI", "B005XDGJB8", "B008DWAGPG", "B0058DN1Q4", "B007JLDTRY", "B004TDY924", "B004IYJWVC", "B00597E938", "B005PVXI0S", "B000QSN3O6", "B00CO0DE0W", "B005PVXH18", "B0040NPGP2", "B0048TWIX6", "B003STVG80", "B00439GMJ2", "B00B2AS8CE", "B002WRIBN2", "B002MRRU6G", "B0048L62I6", "B003SU4BXQ", "B00HX7HS5I", "B005DB6NG6", "B00CRW1CRO", "B00EVVGAFI", "B00G9X5N18", "B00CRB9CK4", "B004JHXWDC", "B00DIO9M1S", "B00CF9VFSU", "B005EJLFNI", "B00CO0DH6S", "B00EVVGAD0", "B000JOZAQG", "B00BNI4A90", "B00AQM8586"], "buy_after_viewing": ["B005C31H34", "B00EVVGAFI", "B006I5MKZY", "B005IULTI4"]}}