{"asin": "B00267S7TQ", "related": {"also_bought": ["B003APPG56", "0470539690", "B003USS5JC", "B000O161X0", "B006JGXOSY", "B0026FCKAA", "B003L89SU6", "B0009HN57Y", "B002P9FOUU", "B008TWHCB6", "B0069R7FFQ", "B0049I48JI", "B00006I5J7", "B0082RT1OE", "B005FYK9NO", "0321659430", "B005Y1SYQ2", "B0061MRHZW", "B003L1ZYZ6", "B003HMTE3C", "B003VNKNEQ", "B004QKUISO", "B00CV9MKJ2", "B003VNKNF0"], "bought_together": ["B003VNKNEQ"], "buy_after_viewing": ["B003VNKNF0", "B00006I5J7", "B003VNKNEQ", "B008TWHCB6"]}, "title": "Nikon D5000 12.3 MP DX Digital SLR Camera with 18-55mm f/3.5-5.6G VR Lens and 2.7-inch Vari-angle LCD", "price": 769.0, "salesRank": {"Camera &amp; Photo": 1499}, "imUrl": "http://ecx.images-amazon.com/images/I/41cIkiUKeOL._SX300_.jpg", "brand": "Nikon", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]], "description": "From the ManufacturerA remarkable blend of simplicity and highly-advanced DSLR capabilities, the compact and powerful D5000 offers breathtaking 12.3-megapixel image quality, along with a flexible, Vari-angle, Live View monitor for fresh picture-taking perspectives. Nikon&rsquo;s EXPEED image processing further enhances performance, contributing to split-second shutter response and continuous shooting at up to 4 frames-per-second to capture fast action and precise moments perfectly.The D5000&rsquo;s 24-fps HD D-Movie mode with sound captures video clips with amazing clarity--offering new and exciting creative opportunities. Fast, accurate 11-point autofocus with 3D Tracking, teamed with famous NIKKOR optics, assures incredible image sharpness, while active image sensor cleaning combats annoying dust automatically. Featuring a convenient built-in flash, 19 automatic exposure Scene Modes to make the impossible easy and 23 Custom Setting options to fit your preferences, as well as 14 in-camera image retouching functions, the D5000 is the perfect DSLR, beginning with performance to meet your picture-taking tomorrows.Outfit includes the 3x AF-S DX NIKKOR 18-55mm f/3.5-5.6G VR lens with image stabilization and legendary NIKKOR optical quality.Nikon D5000 Highlights12.3-megapixel DX-format CMOS image sensorCoupled with Nikon's EXPEED image processing and NIKKOR optics, breathtaking picture quality is assured.3x Zoom AF-S DX NIKKOR 18-55mm f/3.5-5.6G VR lens includedLegendary NIKKOR optical quality features Nikon VR image stabilization for added sharpness.D-Movie Mode with soundRecord 720p HD movie clips enhanced by NIKKOR interchangeable lens quality and versatility.Vari-angle color LCD monitorPosition the 2.7-inch monitor freely for fresh shooting perspectives. Screen flips inward for safe keeping.19 Auto-exposure Scene ModesCapture stunning photos in challenging picture-taking situations including Sunsets, Candlelight, Silhouette, Portrait, Landscape, Beach/Snow, and more.One-button Live ViewEasy Live View access offers 4 autofocus modes, including Face Priority AF.Continuous shooting as fast as 4 frames-per-secondCombined with fast power-up and split-second shutter response, decisive moments are captured easily without annoying shooting lag.Low noise ISO sensitivity from 200 to 3200Engineered for exceptional low-light shooting.Built-in image sensor cleaningEffective 4-frequency, ultrasonic sensor cleaning keeps images spot free.11-point autofocus system with 3D Focus TrackingFast and accurate autofocus delivers razor sharpness.Auto Active D-LightingRestores lost shadow and highlight detail in high contrast exposures&mdash;Selectable and Auto modes available.In-camera Retouch image editingCreative in-camera image editing, featuring Soft Filter, Straighten, Color Outline Effect, Perspective Control, Red-eye Correction, Image Overlay, Monochrome and more&mdash;all without a PC.Picture Control Settings for personal image controlStandard, Neutral, Vivid, Monochrome, Portrait, Landscape and 9 customizable settings.Nikon 3D Color Matrix Metering IINikon&rsquo;s renowned 420-pixel RGB 3D Color Matrix Metering II, teamed with the exclusive Scene Recognition System, evaluates each scene for unmatched exposure accuracy.Durable, high precision shutterTesting to over 100,000 cycles assures precision and long shutter life.GPS geo-taggingGP-1 GPS unit (optional) automatically identifies and records every image&rsquo;s latitude, longitude and altitude, with satellite time-of-day."}