{"asin": "B00ATM1MVA", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The Joy of Photography&mdash;Take Your Passion for Photography to the Next LevelSince the age of film photography, the history of  FUJIFILM has paralleled the path of the professional photographer. Our  story is the endless pursuit of unparalleled photographic expression,  and the X series was born. What is the meaning of a camera or photos in  your life? Now you can hold the answer to explore the depths these  questions. FUJIFILM X. It is the promise of unprecedented photographic  pleasure.Pursuit of Image Quality&nbsp;&mdash;Commitment to Uncompromising Image Quality&mdash;The high-quality FUJINON lens, the larger sensor,  and the processor - each device is the product of our commitment to  uncompromising quality in every detail. Each exploits the full potential  of the other, achieving an optimum balance that enhances their total  performance. This is the FUJIFILM way &mdash; a development approach that has  produced breakthrough after breakthrough in image quality. FUJIFILM X.  It is the promise of ultimate image quality.Exploration of New Angles on Photography&mdash;Subject Through the Viewfinder&mdash;Experience photography with the viewfinder that  incorporates the cutting edge of FUJIFILM technology! Through the  viewfinder, your eye finds the freedom to compose your shot in a wide  field of view and the luxury of a bright, clear view of the scene. Here  is the pleasure of focusing on your subject, and the endless fascination  of exploring the scene from every angle. FUJIFILM X Series. It is the  promise of discovery of a new world through the viewfinder.Quality &amp; Operability&nbsp;&mdash;The Joy of Sharing Every Moment with Your Camera&mdash;The tactile pleasure whenever you hold it and  operate the controls. The delight of its styling with a timeless  attraction. Your growing attachment to this instrument every time you  venture out together. These are qualities that cannot be measured, and  the difference is the passion and experience of FUJIFILM. FUJIFILM X. It  is the promise of a camera that transcends the definition of a  photographic instrument and opens your senses to a world of  possibilities.The design of the FUJIFILM X100S prioritizes &ldquo;photographing&rdquo;The FUJIFILM X100S employs numbered dials for  aperture, shutter speed and exposure compensation and is equipped with a  viewfinder that allows you to select your composition. The design of  the FUJIFILM X100S resembles the cameras of the film age, and there is  wisdom that has been passed down behind it. This gives the FUJIFILM  X100S commonality that transcends the ages. The FUJIFILM X100S is  designed to enable you to &ldquo;quickly&rdquo; capture that moment you wish to  document.Optical Design with a Priority on PerformanceThe simple all-glass lens configuration (6 groups/8  elements) is designed around a single high-performance double-sided  aspheric lens. Uncompromising image quality is assured by the  application of multi-layer HTC-EBC(High Transmittance Electoron Beam  Coating) coating and other technologies. The result is perfectly  balanced optical excellence promising low aberrations, sharp resolution  and faithful color reproduction.New Intelligent Hybrid AF brings your scene into focus in only 0.08 sec*.Equipped with both the super fast phase detection  AF system, and contrast AF for accurate focusing in dark scenes,  Intelligent Hybrid AF instantly switches to the optimal focusing system.  Applying the fastest algorithm depending on the subject and scene,  Intelligent Hybrid AF can bring your subject into focus in the blink of  an eye &mdash; only 0.08 sec*. at its fastest speed so those priceless moments  will never escape your lens.Versatile FunctionsReplicate FUJIFILM's acclaimed color reversal photo films with Film Simulation.Just like choosing the ideal film for your creative  direction, this powerful mode lets you simulate the film color and  tonal qualities of FUJIFILM's acclaimed color reversal films: the  natural look of PROVIA, the dramatic tonality and vivid colors of  Velvia, and the soft tones and beautiful skin color reproduction of  ASTIA. Faithfully reproducing Fujichrome color quality loved by  professional photographers, Film Simulation transforms your vision into  masterpieces of color expression. You can also replicate the timeless  beauty of monochrome film photography with a selection of monochrome  filters.&ldquo;Studio Ready&rdquo; Professional Color Negative Film Modes for Perfect PortraitsEvery detail captured with gentle tonality.Enjoy the exceptional definition of Full HD Movie Shooting!Full HD Movie (1920 x 1080) mode offers 60fps for  smoother capture of the action in full high definition detail. Shooting  movies at the high bit-rate 36Mbps results in enhanced image quality and  clarity that reveals every detail from individual leaves in the trees  to subtle changes in facial expression. You can also take advantage of  Monochrome and the vivid color expression of other Film Simulation  modes, and exploit the brightness of the lens to shoot movies with a  stunning &ldquo;bokeh&rdquo; effect.3x Digital Zoom Movie ShootingJust press the Playback Zoom In Button any time  while shooting to switch to 3x digital zoom, tripling the lens focal  length to 105mm (35mm format equivalent).Leading the way to the ultimate image quality.APS-C 16M X-Trans CMOS II Sensor &amp; EXR Processor IIThe extreme resolution of FUJIFILM's bespoke APS-C  16M X-Trans CMOS II sensor with OLPF-less architecture. The clarity of  the signal achieved by the optimization of every aspect of its  processing circuitry. The enhanced image quality produced by the  powerful EXR Processor II.", "title": "Fujifilm X100S 16 MP Digital Camera with 2.8-Inch LCD (Silver)", "brand": "Fujifilm", "salesRank": {"Camera &amp; Photo": 195}, "imUrl": "http://ecx.images-amazon.com/images/I/51POFQTHzWL._SX300_.jpg", "related": {"also_bought": ["B004EC20Y4", "B005HNNJXA", "B0000BZL2Y", "B00AY74JTW", "B00E259GCC", "B00CWF63S4", "B000GGCHUO", "B00HVXVY18", "B007FLQ8D0", "B009LMCAXI", "1937986209", "B002KEYYCE", "B004QBQAXU", "B008KFY16Q", "B005CRHM5C", "B004NROYUS", "B0000BZM1F", "B00D0O9QC6", "B004MME69S", "B00CV9MMUE", "B002O1AH5Q", "B005FY2DZG", "B004OVE16U", "B0001TSSM2", "B007NDL56A", "B00576ANLS", "B00DZIFWSY", "B00GV14H92", "B007A2KCEU", "B00G8KF7BI", "B0059VMH5G", "B00B0N2BZ8", "B00CDJSIMS", "B003WE9MCI", "B00CWF7ZSQ", "B00D86UQWK", "B0083F2QP6", "B00HA20A9M", "0321984390", "B00C0OGR7Y", "B00BMK9U76", "B00CDJT30O", "B00GAPWYPI", "B004KU0RJK", "B00CK32PFI", "B004MME6A2", "B00D62VZBW", "B00004ZCJF", "B008SP6BWA", "B00CV9M808", "B004QLHYXU", "B004OR15K4", "B00009R7ZL", "B00JR6UU7Q", "B0099RPEVU", "B00C7SDLU4", "B001FA09ZA", "B007NDL54C", "B00HA236FC", "B00GVMCR2A", "B002N1WACA", "B004861KKQ", "B004TA70SC", "B005BTKQTA", "B007NDL56U", "B00CJ0X6NW", "B0090CF57M", "B00JCJO5QU", "B00C9USP8I", "B00D86W060", "B00CDJZ8GM", "B001642YXK", "B00017LROK", "B0090XWU8S", "B008SP6M5Q", "B00FG8PPXI", "B007M54E1M", "B00004ZCA5", "B0069RZ0Y4", "B008OD1BNK", "B00GUGL3HM", "B009X0EO00", "B00D72NRM6", "0321929500", "B00BMKB5JW", "B00HYAL88W", "B004V4OJSU", "B0051GN88O", "B00JDYCWRI", "B00004ZC9L", "B005OLZBYA", "B009IV32AM", "B00ARAAWPQ", "B006W1J3OK", "B0084G3FKE", "B00K7O2DJU", "B005BOSHKU", "B00004ZC9Y", "B00E259GQI", "B00CS4WPHC"], "bought_together": ["B004EC20Y4", "B0000BZL2Y"], "buy_after_viewing": ["B0000BZL2Y", "B004EC20Y4", "B005HNNJXA", "B008KFY16Q"]}}