{"asin": "B00005YTYJ", "description": "WithGrand Theft Auto III, Rockstar proves that not all  developers are concerned with toning down the violence in their games.  This sequel is even more bloody, violent, and sadistic than its popular  predecessors, offering up an enormous 3-D city in which nearly any  criminal act is possible. Players are free to steal cars, beat up the  local population for their money (or weapons), make time with  prostitutes, or simply roam to their heart's content. Those seeking  more structure can embark on dozens of plot-driven missions or steal  cars that let them play minigames. Nab a cop car and go on vigilante  missions. Grab a cab and play a deadly version ofCrazy Taxi.  Take a fire truck and earn money putting out fires. The game just never  gets boring.As in real life, there are consequences for your criminality. As your  random acts of mayhem mount up, the police start hounding you,  eventually calling in SWAT trucks, the FBI, and even the army if you  continue down the path of destruction. Shaking these pursuers is easily  the most fun part of the game, especially when a bunch of friends are  packed in the room to witness your narrow escapes.Grand Theft Auto IIIis fine-tuned to near perfection in every  category. All the vehicles, from slick sports cars to lumbering dump  trucks, handle exactly as you'd expect and smash apart realistically  when abused. The three islands in the game are rendered in terrific  detail considering their size, and are packed with traffic,  pedestrians, and hidden jumps. The audio is equally amazing.  Pedestrians talk, cops scream at you, and you can tune in nine  different radio stations whenever you are in a car. It all adds up to a  monumental achievement: the rare console game for adults that manages  to get everything right.--T. Byrl BakerNote: This review refers to thePlayStation2 versionof  this game.Pros:Offers an enormous world for players to exploit, rendered in  staggering detailEqually fun whether you go on plot-based missions or run around as  a freelance crookCons:Ultraviolence, foul language, and adult situations mean you'll want  to keep this far away from kidsIt takes too long to get from one island to another, making some  missions tedious", "price": 47.99, "imUrl": "http://ecx.images-amazon.com/images/I/51XRKCKVRZL._SY300_.jpg", "related": {"also_bought": ["B00008JODN", "B0009IX7K8", "B001BNFQKO", "B000BD1AFA", "B0007LA9C6", "B0000A1VER", "B001DUG0NC", "B0036FBERE", "B0016BVY7U", "B000B63RSA", "B000WYLZ12", "B002I0KOSI", "B0016Q4UJE", "B0001PKC0M", "B004RLH5CY", "B000FSS8MO", "B0006FJVUE", "B0034LAC4Q", "B000RPHJDO"], "bought_together": ["B00008JODN", "B0009IX7K8"], "buy_after_viewing": ["B00008JODN", "B001BNFQKO", "B000BD1AFA", "B0009IX7K8"]}, "salesRank": {"Video Games": 22280}, "categories": [["Video Games", "PC"]]}