{"asin": "B00GSEOV7U", "categories": [["Electronics", "Computers & Accessories", "Laptops"]], "description": "Chromebooks are a unique class of mobile computing devices, designed specifically for Web-based tasks. They differ from traditional laptops in a few important ways:Chromebooks run Web-based apps, not traditional PC applications.Chromebooks are designed to be connected to the Internet. You can create documents and spreadsheets or edit photos on a Chromebook using Google apps designed for these purposes. The Chrome operating system will not load and run traditional PC software like Microsoft Office and Adobe Photoshop. However, files created in these applications can be viewed and edited using Google apps on your Chromebook or cloud-based applications like Microsoft's Office web apps.You store your files in the Cloud, not on the machine.To help make them thin and light, Chromebooks are built without large-capacity drives. So instead of storing your documents, videos, and photos on your computer, you save them to Google Drive (Google's Cloud-based storage service). Your files are password-protected and secure, and you can access them anywhere there's an Internet connection. If you know you'll want access to a file or photo offline, however, you can easily save it to the built-in solid-state drive. Acer extends its industry-leading Chromebook line by adding touch! Packing up to 7.5 hours of battery life this Chromebook starts in seconds, is powered by the latest Intel processor based on Haswell micro-architecture and now features an intuitive 10-point touch display. Tap and swipe your way through the world whether its running your favorite Google app, watching videos, playing games, exploring the Internet, or just getting work done.Key Features11.6\" HD Widescreen LED-backlit DisplayMulti-touch screen, supporting 10-finger touchIntel Celeron Processor 2955U(1.4GHz, 2MB L3 cache)Haswell micro-architectureGoogle Chrome Operating System32GB SSD Drive2048MB DDR3L SDRAM MemoryIntel HD Graphicswith 128MB of dedicated system memoryAcer InviLinkTM NplifyTM 802.11a/b/g/n(MIMO Dual-Band 2.4Ghz &amp; 5GHz) Wireless LANBluetooth 4.0Built-in HD WebcamTwo built-in stereo speakers1- USB 3.0 Port1- USB 2.0 Port1- HDMI PortFull-size Acer FineTip KeyboardMulti-Gesture Touchpad3-Cell Li-Polymer BatteryUp to 7.5-hours Battery Life2.98 lbs.| 1.35 kg(system unit only)Learn MoreIntroducing Acer's First Chromebook with TouchAcer introduces its first Chromebook with touch, the C720P. Enjoy the benefits of a Chromebook (fast boot times, automatically updates and multiple layers of security) with high performance, great battery life and an 11.6\" touch display making interaction with the Chromebook natural and intuitive.The 10-point multi-touch display makes your digital life more intuitive, more electric, more fun! Experience efficiency hands-on as you run your favorite Google apps or browse through your photos, videos, music and documents from anywhere--using nothing but your fingers.The Chrome OS has custom gestures built-in, so you can naturally browse through web pages, scroll through Google docs and edit photos with the tip of your finger.  Seamlessly tap, swipe, and pinch to zoom in the same way you would interact with a tablet.The 11.6\" HD display enables students and families to enjoy the Chromebook outside in sunlight for classwork, reading, playing games and more. Crisp resolution brings family closer during video chats, and a tilt angle of up to 145 degrees brings the best view whether you're sitting or lying down. Want bigger?  Extend your view to your big screen via the HDMI port.Thin, Light and PowerfulThe Acer C720P Chromebook measures only 0.78-inches thin and weighs only 2.98 pounds making it easy to take to class, meetings or anywhere.Powered by an Intel&reg; Celeron&reg; processor, the Acer C720P delivers a great experience on the web. It can load content-rich webpages quickly and easily, provide crisp video playback, and enable you to multitask effortlessly by allowing multiple pages to run at the same time. And up to 7.5 hours of battery life gives you all day for productivity and fun.Feel safe sharing your C720P Chromebook with friends, family and even the occasional guest. Each user has their own login, files, apps and settings, so you never have to worry about anything getting messed up by someone else.Ready for Work or PlayChromebooks come with popular Google products built in: Search, Gmail, YouTube, and Hangouts, so you can work, play, and stay connected right out of the box.  Create documents, spreadsheets, presentations and drawings with apps like Google Docs, Zoho and SlideRocket. Enjoy full screen video chat with up to nine friends using Google+ Hangouts.The Chrome Web Store offers thousands of free apps, themes, and extensions to help you make the most of your Chromebook. Watch movies, play games or get work done (if you really have to).  The Chromebook will keep it all fresh with automatic updates.Enjoy up to 100GB of free storage on Google Drive the first 2 years after purchase. Securely store and access your photos, music, videos, documents and more from anywhere - it's simple.The Acer C720P Chromebook stays connected with dual band Wi-Fi. It also comes with 12 free Gogo Inflight passes so you can stay online even when you're not on the ground.Your Chromebook comes with 12 free Gogo in-air Internet passes (estimated $150 value, redeemable for two years after Chromebook purchase) usable on continental U.S. flights of participating airlines", "title": "Acer C720P-2666 Chromebook (11.6-Inch Touchscreen, 2GB)", "price": 368.19, "imUrl": "http://ecx.images-amazon.com/images/I/51D1Z4NmknL._SX300_.jpg", "brand": "Acer", "related": {"also_bought": ["B00CD8ADKO", "B00D2YJ1II", "B00DUN2PBQ", "B007KOS3OY", "B007Y91QY4", "B00HUVUWLY", "B00HUWASC6", "B00HUW54PM", "B00HUW9KBG", "B00GK6ZJFO", "B00DUGZFA6", "B00GRMZ37U", "B00EZ2E8NO", "B00FNPD1VW", "B00HUWCP36", "B001ENYQT8", "B003WCAX5A", "B00DR0PDNE", "0789751380", "B00HUW23MY", "B00E3EALS0", "B009PIORNE", "B00GQRFBSW", "B00KD5RUN2", "B00HUWDXLE", "B004NY9UV4", "B00IT1WJZQ", "B001251IT4", "B00IJD3QTC", "B00GNL7WLA", "B00HUWEWNC", "B007ZSP2FI", "B00HRO3IBA", "B00FGOTC0Y", "B004NY9UUU", "B00GZ1GV3I", "B00HKU68RW", "B00HUWBPCS", "B00GN5U5N8", "B00FJXVRM8", "B004LL9MO4", "B004S3G5JK", "B00ACVHKSC", "B009M8BU50", "B00G3QKVS6", "B00IKCI6X8", "B00DU0ZI8Q", "B007T1CTF2", "B00CX5P8FC", "B0093162QS", "B009LL9VDG", "B00CF5ETH8", "B005DSPLDA", "B00AQM8586", "B00F0W1RIW", "B00484IEJS", "B003MTTJOY", "B0081TYO72", "B00812F7O8"], "bought_together": ["B00CD8ADKO"], "buy_after_viewing": ["B00FNPD1VW", "B00CD8ADKO", "B00GZ1GV3I", "B007Y91QY4"]}}