{"asin": "B004M8ST5O", "description": "With the Philips GoGear Ariaz 8GB MP3 Player, it's easy to enjoy rich sound and all the media you can pack in. This portable 8GB MP3 player includes Philips FullSound technology for a richer audio experience and sound isolation headphones for exceptional sound on the go, or use the built-in speaker for share your music with others Enjoy a vast array of entertainment options with a 2.4-inch full color screen, Philips Songbird for limitless musical exploration and easy synchronization, and remarkably long music (36 hours) and video (5 hours) playback. The Ariaz also offers a Smart Shuffle feature so you can listen to the music you like the most first, a folder view feature and voice recording capabilities, and supports FLAC and APE formats, for the best possible digital audio experience.GoGear Ariaz 8GBAt a Glance:Portable 8 GB player with sound isolation headphonesExtended music (36 hours) and video (5 hours) playbackFull-color 2.4-inch, high-resolution display for crisp video and imagesVoice recording capabilities and FullSound technology90-day limited warrantyThis long-lasting player allows you to listen to 36 hours of continuous music playback, or watch video for up to a full 5 hours.View larger.Sound isolation headphones let you hear greater music detail at a lower volume than is possible with normal headphones.View larger.Extended Play Times for On-the-Go EnjoymentForget about the hassle of having to recharge your MP3 player's battery constantly. This long-lasting player allows you to savor your favorite tunes for up to a whopping 36 hours of continuous music playback or watch video for up to a full 5 hours--all on a single charge. Now you can sit back and listen to music all day long or watch the equivalent of three movies back-to-back wherever you go.2.4-Inch, High-Resolution Screen for Vivid ImagesA 2.4-inch, high-resolution display offers excellent video quality and crisp, vivid images. Together with a full color menu, the large screen makes for easy navigation of media files for a complete multimedia experience.FullSound for Richer, Fuller AudioThe Ariaz uses Philips' FullSound technology so you can experience near-CD quality music without any distortion. Based on an audio post-processing algorithm, FullSound combines Philips' expertise in music reproduction with the power of the latest generation Digital Signal Processor (DSP). The result is fuller bass with more depth and impact, boosted voice and instrument clarity, and rich detail.View larger.Sound Isolation Headphones Minimize Environmental NoiseSound isolation headphones let you hear greater music detail at a lower volume than is possible with normal headphones. These headphones have an angled acoustic design that creates a perfect seal between the ambient sound source and the ear canal, thus eliminating unwanted background noise while delivering sound directly to your ears. Even at a moderate volume setting, you can still discern music detail without noise distractions from the environment. Earphone sleeves are available in three sizes to provide the best fit.Songbird: One Program to Discover, Play, and SyncThe Aria comes with access to Songbird, a simple, easy-to-use program that lets you discover and play all your media, and sync it seamlessly with your MP3 player. Its intuitive and powerful music management features let you discover new artists and music styles directly in the program through music and media stores, services, and websites. Play your own library and media from the Internet and seamlessly sync all of it from your PC to your MP3 player.Voice Recording OptionsVoice recording converts your Ariaz player into a handy dictation machine. Besides playing music or listening to radio, you can also record notes, reminders for work or school, shopping lists and phone numbers, or even song lyrics.Time-Saving Folder View FeatureThe Ariaz includes a folder view feature, an optional directory feature that lets you view all the files on your player as if it were a computer. Once you select folder view, opening any supported file (like music, pictures, or video) is as easy as selecting the file and hitting play.FM Radio with RDS and PresetsRDS (Radio Data System) is a communications protocol standard that allows digital information to be transmitted over FM radio broadcasts. RDS-enabled FM radio receivers can display useful information that includes station identity, program details, and song title and artist. With this feature, you can store a desired station as a preset channel on your Ariaz player. You can store up to 20 preset radio stations and quickly access your favorite stations without having to tune the frequencies.Audible.Com Access for More Entertainment OptionsBeyond music and video entertainment, the Ariaz lets you enjoy digital audiobooks, magazines, radio shows, stand-up comedy, and more available for download at Audible.com. Listen to books in the car, at the gym, or around the house. At Audible.com you can browse and sample over 75,000 selections, including the latest best sellers and timeless classics.Warranty InformationThe Ariaz is backed by a limited 90-day warranty.What's in the BoxGoGear Ariaz Player, headphones, and QuickStart manual.GoGear MP3 Video PlayersGoGear VibeGoGear AriazGoGear MuseCapacity4 GB8 GB8 GB16 GB8 GB16 GBHighlightsFullSoundFullSoundFullSoundFM radio with RDS and 20 presetsFM radio with RDS and 20 presetsFM radio with RDS and 20 presetsSoft rubber earbud headphonesSoft rubber earbud headphonesSound-isolation headphonesLossless codec support (FLAC & APE) AudibleLossless codec support (FLAC & APE) AudibleLossless codec support (FLAC & APE) Audible1.8-inch full-color display2.4-inch full-color display3.2-inch HVGA color display24 hour music or 4 hour video playback36 hour music or 5 hour video playback24 hour audio or 5 hour video playbackVoice recordingVoice recordingVoice recordingPhilips SongbirdPhilips SongbirdPhilips SongbirdFolder viewFolder viewFolder viewAlbum art displayAlbum art displayAlbum art display&nbsp;&nbsp;Surround for movies&nbsp;&nbsp;HDMI video out, up to 720p&nbsp;&nbsp;Touch Screen", "title": "Philips GoGear Ariaz 8 GB MP3 Player", "price": 46.99, "imUrl": "http://ecx.images-amazon.com/images/I/41Xj1-bSoLL._SY300_.jpg", "related": {"also_viewed": ["B007B5TPEY", "B007B5TOZY", "B0035JJJQE", "B00IBR5QJY", "B004M8SSTG", "B007B5TOJK", "B004M8STFY", "B0035JJJQY", "B007B5TO4A", "B001F50UIQ", "B004STY2Z8", "B00KPM2RIG", "B00ECRPOKS", "B00ECQUY2M", "B007V7XQ7E", "B002MAPS6W", "B000WFZSBE", "B00ECRRWTE", "B009RQW3BC", "B002JPITXY", "B001PR1ZMY", "B00BEWDP2I", "B0058TKZZS", "B00ECRRB8G", "B00EE1H7BQ", "B005BJUZOG", "B007BGGEOC", "B0056G13F4", "B004XT6IZK", "B003ULP5PG", "B0035PBHX6", "B001EWDFCI", "B002MAPT7U", "B003ULP5QA", "B00G46TW8U", "B005JPLQPY", "B005FVNH04", "B000ETTFRG", "B0049MM3GY", "B0041MMMWW", "B000NFNPW2", "B002IPHA1W", "B004SKBHB4", "B00EFS143A", "B001F50UHM", "B002MAPSC6", "B00CHEJP7Q", "B00JQI6C72", "B002MAPRYU"], "buy_after_viewing": ["B002MAPS6W", "B002MAPT7U", "B007B5TPEY", "B00ECRRWTE"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}