{"asin": "B000GAO91K", "related": {"also_bought": ["B00196497O", "B00119TL2W", "B001JU81ZG", "B004GU3YXU", "B00H3E6R1M", "B00856TSCC", "B0012C2GFM", "B0012C7VLG", "B002DTHZT0", "B00E253XSA", "B00H583M6Y", "B00DUOA6AW", "B005F4EACU", "B005IR3D90", "B003JN0OAQ", "B0013TM9UQ", "B00AQFGLAW", "B009AH7OU8", "B000GAT6MM", "B001EQ5IOW", "B000F4WR16", "B002VLZ83A", "B000FFLHSY", "B00E253XS0", "B00EKLPLU4", "B006Z9ACMG", "B000GGPK0I", "B00ARM7Q2G", "B003384642", "B004XESNRQ", "B001EO5Q64", "B000GAT6NG", "B00FFBFOXM", "B0014UEEXY", "B0019LTGOU", "B0019LWU2K", "B005K4PZOM", "B009324C0U", "B002VLZ81M", "B00433YTRA", "B00CKF24L6", "B0014UAHQW", "B00FIUITDM", "B00028Q450", "B00DAI76TC", "B0013OUK6Q", "B004VLVJB8", "B0014M1VR4", "B003QDRJXY", "B0017WG180", "B0019LRYQW", "B000X9WXSU", "B008RJMXPQ", "B0038B3AAK", "B007S6Y7FI", "B0015P54R8", "B002CPVTH4", "B002HI1LSI", "B005P0WOZE", "B00GMBUBVO", "B00D9NV1NU", "B00EHSTTDU", "B000ELP5KA", "B0039ITKR4", "B007SIG5HY", "B002N0PY8S", "B004BKP6WM", "B000JNAMJ2", "B00098IHVC", "B0041W52TM", "B003V7XNRQ", "B00IP42FBA", "B001RRH814", "B00DS842HS", "B000W0HA7Y", "B003AYEHMU", "B00C7V58CU", "B001VNGO9G", "B000LKX6R8", "B004VLVJP4", "B000XPB60U", "B00563E6ZG", "B005EYSKQS", "B0019GVYR2", "B0026RCMAG", "B008YFWH3G", "B00FH3DWAU", "B00415Y7V8", "B0019LRNVS", "B000NDME6C", "B001CGX3ZK", "B00EHQQ1A6", "B001D0UHOA", "B00020HV1E", "B0015C0S5O", "B002S1U7RU", "B000SWTKV0", "B0073W96PS", "B0009EYIQ4", "B00G0Q5V0M"], "also_viewed": ["B00AR82R4W", "B00119TL2W", "B004VQHKM0", "B00196497O", "B005F4EACU", "B004XESNRQ", "B00H583M6Y", "B0016B1WSG", "B00ARM7Q2G", "B00AN8NL8C", "B00CQ7WCV0", "B007CYVANI", "B00FRQZZUW", "B003X1QT9Y", "B00EVU3YDU", "B005F4EFMA", "B00433Q04A", "B004UKJDY0", "B00H3E6R1M", "B001E5E1LO", "B005LNA5VK", "B00E253XS0", "B002DTHZT0", "B00DUJXTLU", "B0066VLDQC", "B00FFBFOXM", "B00H57HC34", "B00IMEEW0U", "B0012C7VLG", "B004QNIC1G", "B001JU81ZG", "B00LFAIL3W", "B00C04BKUS", "B00E253XSA", "B00A1UU4AU", "B0035XHZNY", "B004GU3YXU", "B0016B4080", "B00FNZ3018", "B00DBB4A5Q", "B00J44N9TC", "B00JRCW942", "B00IRI2QPY", "B006Z9ACMG", "B007X4JIX6", "B00ELNCF0A", "B0012C2GFM", "B00IYV0HZU", "B00DUK0D6I", "B001EO5Q14", "B00016XDVG", "B00856TSCC", "B00LN7BDLO", "B001E11PEE", "B00JMY625C", "B0082B5NSI"], "bought_together": ["B001JU81ZG"]}, "title": "Nutiva Organic Hemp Oil, 24-Ounce Bottle", "price": 5.46, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41QYAv1-JFL._SY300_.jpg", "brand": "Nutiva", "categories": [["Health & Personal Care", "Vitamins & Dietary Supplements", "Herbal Supplements"]], "description": "Nutiva began in 1999 as an idea in the mind of John W. Roulac, the author of four books on home composting and industrial hemp. Nutiva is the third successful business John has founded since jump-starting the modern home-composting movement in the early 1990s with his best-selling book,Backyard Composting. That book has sold more than a million copies worldwide.Nutiva is an innovative leader in the health food industry.Since 1999, we have operated as a values-driven company dedicated to nourishing people and planet.We're building a business characterized by high standardsin all aspects of our company, from the organic farms that grow our foods, through the production, packaging, and transportation of our products, to the Nutiva associates who communicate with our retailers and the people who enjoy our products.Our watchwords--nutritious superfoods, healthier people, and a sustainable planet--express our commitment to move beyond conventional food industry practices to embrace a bigger picture that supports the long-term well-being of humanity as a whole.Nutiva's purpose is to produce the highest-quality organic superfoods,providing superior nutritional value to our customers while supporting sustainable agricultural practices and a fair return to the farmers on whom we depend. We donate 1% of our sales to groups that promote sustainable agriculture.We educate people worldwideon current developments in nutritional science, organic farming, green energy, and fair trade practices within the global economy.At Nutiva, we continually innovateso that we can better contribute to the health and happiness of our customers as well as the sustainability of our planet.Hemp was cultivated in China more than 6,000 years ago, from a wild plant that grew in central Asia.A Nutritional PowerhouseHempseed is considered by leading researchers and medical doctors to be one of the most nutritious food sources on the planet. Shelled hempseed is packed with 33% pure digestible protein and is rich in iron and vitamin E as well as omega-3 and GLA. A recent report funded by the Canadian government states that hemp protein comprises 66% high-quality edistin protein, and that hempseed contains the highest percentage of this of any plant source. Unlike soy, hemp is not genetically modified, and it doesn't contain the anti-nutritional qualities commonly found in soy.Got Your EFAs today?Because the human body produces no Essential Fatty Acids (EFAs), it is important that EFAs be consumed on a regular basis. It is estimated that more than 90% of Americans take in too little of one of the most important EFAs--omega-3--which is found in flax, walnuts, deep-water fish, and hempseeds. EFAs are the \"good fats\" that doctors recommend as part of a healthy, balanced diet. The quality of omega-3 is vital, and can be diminished by oxygen, heat, and light. Thus consume the freshest seeds possible and store them in a dark, cold environment such as a refrigerator. Nutiva obtains its seeds exclusively from Canada, and we date all our products. Great nutrition never tasted so good."}