{"asin": "B003O6EE4U", "description": "&nbsp;&nbsp;Xbox 3604GB Console with KinectProduct DescriptionThe Xbox 360 4GB Console with Kinect. Kinect brings games and entertainment to life in extraordinary new ways &ndash; no controller required. Easy to use and instantly fun, Kinect gets everyone off the couch moving, laughing and cheering. See a ball? Kick it. Control an HD movie with a wave of the hand. Want to join a friend in the fun? Simply jump in. Wi-Fi is built-in for easier connection to the world of entertainment on Xbox LIVE, where HD movies and TV stream in an instant. Xbox 360 is more games, entertainment and fun.Product FeaturesKinect Sensor:With the Kinect sensor, you can experience gaming like never before. Easy to use and fun for everyone, the Kinect sensor utilizes revolutionary full-body tracking to put you in the center of the fun. This amazing new technology allows the sensor to recognize your body and mirror your movements in the game, making you the controller. With Kinect Xbox 360 now has the best controller ever made &ndash; YOU.Built-in Wi-Fi:The new Xbox 360 is the only console with 802.11n Wi-Fi built-in for a faster and easier connection to Xbox LIVE. Stream HD movies and TV or download games from Xbox LIVE in 1080p and 5.1 surround sound from anywhere in the house. Compatible with b/g/n networks.Xbox LIVE:Xbox LIVE brings a world of entertainment to you. Instantly watch movies and TV streaming from Netflix. In crystal-clear HD, or download game add-ons like new levels, characters, maps and songs. Easily jump right into online multiplayer fun and play along with friends around the world. Plus, get your favorite music from Last.fm, connect with friends on Facebookand post Tweets on Twitter. Xbox LIVE is your connection to more games, entertainment and fun.Xbox 360 Wireless Controller (black):This award-winning, high-performance wireless controller features a range of up to 30 feet and a battery life of up to 30 hours on two AA batteries.More ports:Connect more accessories and storage solutions with added USB ports. Now with a total of 5, (3 back/2 front) you&rsquo;ll find more places to plug and play. Plus, in addition to the standard Ethernet port and HDMI output, we&rsquo;ve added an integrated optical audio out port for an easier connection to the booming sound of your A/V receiver.Kinect Adventures game:Float in outer space. Experience the thrill of roaring rapids. Tackle mountaintop obstacle courses and dive into the deep to explore a leaky underwater observatory &mdash; all from your living room. With Kinect Adventures, you are the controller as you jump, dodge and kick your way through exciting adventures set in a variety of exotic locations. Rated &ldquo;E&rdquo; for Everyone.What&rsquo;s In The Box?Xbox 360 4GB S ConsoleKinect Sensor for Xbox 360Kinect Adventures game - rated &ldquo;E&rdquo; for EveryoneXbox 360 Black Wireless ControllerXbox 360 Composite A/V cable (standard definition)1 year limited warranty on consoleGame DescriptionKinect AdventuresPublisher:Microsoft Game StudiosDeveloper:Good Science StudioFormat:DVD compatible with Kinect for the Xbox 360 video game and entertainment systemGenre:ActionESRB Rating:E for EveryoneFloat in outer space. Experience the thrill of roaring rapids. Tackle mountaintop obstacle courses. And dive into the deep to explore a leaky underwater observatory &mdash; all from your living room. With Kinect Adventures, you are the controller as you jump, dodge and kick your way through exciting adventures set in a variety of exotic locations.* Download tokens included in marked packages at launch, at participating retailers, while supplies last. 80 MB required to download from Xbox LIVE.* Microsoft Points required to purchase games, add-ons and media content (sold separately). Instant on HD in full 1080p available with select videos; requires HDMI cable, HDCP compliant 1080p display, minimum 4 mbps broadband speed. Xbox LIVE Gold membership and Netflix unlimited membership required to instantly watch movies streaming from Netflix. See Netflix Terms of Use for details about Netflix service. Xbox LIVE Gold membership required for online multiplayer, video chat, Facebook, Twitter and Last.fm. Xbox LIVE Gold membership and Zune Pass subscription required for Zune Pass. Broadband internet required.", "price": 24.31, "imUrl": "http://ecx.images-amazon.com/images/I/51EKidYBcdL._SX300_.jpg", "related": {"also_bought": ["B003ZSP0WW", "B0050SWALO", "B004I5EE46", "B002I0JBVY", "B0086V5UEG", "B00D8S4GNS", "B00BU3ZLJQ", "B0050SYUAS", "B0050SYYEK", "B006ZPAYMI", "B002I0K3Z2", "B0050SYYTK", "B0083J9R1I", "B0061PAZUS", "B0050SYZ2G", "B0053BG122", "B002I0H27E", "B005FLRUCU", "B008BERH08", "B0043B5SKE", "B004HHIB8U", "B0088I8M0Q", "B002I0HCNI", "B0081AWTZA", "B008J16AHE", "B0042YM9GI", "B002I0H9WM", "B002I0JC72", "B002I0J8RQ", "B005IU8A5O", "B00273Z9WM", "B003UT9XJM", "B000FRU1UM", "B004U4C2R6", "B004XV6ST4", "B003S2SQFS", "B007VIYQVS", "B0050SYXSW", "B004T7PWZ8", "B007WPM8XS", "B0050SW9OC", "B005EW6IV4", "B008FHL56S", "B0058SHO5I", "B00821HMDM", "B0050SYS5A", "B00ER8HHIO", "B0052VPDMM", "B0053BG370", "B004UMAPRW", "B004XIQMS4", "B0053OMR5Y", "B004U9T6FM", "B007YZ5QQM", "B002BSA2LQ", "B002I0HEI6", "B0057PERWU", "B0064VQDK0", "B00D4AK5TY", "B0050SYILE", "B0060SNS1O", "B004LWVHIM", "B00936K09S", "B003R783IY", "B008E6ZYFI", "B00AXI9WFS", "B00C710AZ0", "B004S0PNGY", "B002I0H95E", "B002I098JE", "B003TJVKAS", "B003TJTX2K", "B0049PBOKW", "B007MZUFW4", "B008U2XJP8", "B00DJYKAPY", "B002I0H7K6", "B007LQG9A6", "B005EYG6K0", "B003O6JKLC", "B0050SYX8W", "B0058LTDZY", "B005XO9FRM", "B0017ZDGWG", "B00AY1CT4U", "B00E8RVPZ0", "B00DWXV1DM", "B006ZPAYGE", "B0050SYPV2", "B0056BE0ZY", "B007SRM5MO", "B009XD5YV0", "B00EFRNG0A", "B00D9FQ9CQ", "B007M6W38W", "B008OQTRYW", "B008E6ZXRC", "B002BSA298"], "bought_together": ["B003ZSP0WW", "B00BU3ZLJQ"], "buy_after_viewing": ["B00FATRKWM", "B003ZSP0WW", "B00BU3ZLJQ", "B00D9FQ9CQ"]}, "salesRank": {"Video Games": 1791}, "categories": [["Video Games", "Xbox 360", "Games"]]}