{"asin": "B000ZK696O", "description": "There's only one warrior brave enough to avenge his clan: Ryu Hayabusa. Guide him on a mission to save the entire human race inNinja Gaiden II. Follow Ryu through an extensive Story mode and struggle to survive in a world filled with peril. From Tokyo to New York to the demon-filled crevices of the Netherworld, you'll go to dangerous lengths to reclaim justice for the fallen. Traditional and improved versions of Ryu's primary weapons create a new action-packed twist on this exciting series. Your actions will decide the fate of mankind &mdash; can you prevent destruction at all costs?Key FeaturesExhilarating ninja action: Assume the role of a ninja warrior and experience an all-new combat system that requires skill and mastery of your full arsenal of weapons, including Obliteration Techniques allowing you to quickly and stylishly finish off an opponent. In addition to a variety of brutal new primary weapons and enhanced versions of previous favorites,Ninja Gaiden IIfeatures unique acrobatic combat and attacks used not only by Ryu Hayabusa but also by his formidable enemies.Easy to play, hard to master: Ninja Gaiden II&rsquo;s new auto-healing system featuring semi-permanent damage restored at save points is the natural evolution of the franchise&rsquo;s distinctive gameplay, and introduces a new twist to managing health. Featuring a newly implemented auto-healing functionality and save point system, as well as an extensive story mode and multiple difficulty levels available from the start of the game, the gameplay is accessible to more casual players and challenging to even the most demanding gamers.Massive content and engrossing story: The themes of revenge and friendship in Ninja Gaiden II give rise to a series of dramatic events to create a truly compelling story. From Tokyo to New York and to the Netherworld, the story leads you through a lengthy, action-packed story mode as you skillfully maneuver Ryu Hayabusa through a demonized world fraught with peril and danger. In addition to the single-player campaign, upload Karma scores to Xbox LIVE leaderboards and participate in an all-new Master Ninja Tournament.Realistic graphics in next-generation gaming: Built from the ground-up from Team Ninja's in-house gaming engine for Xbox 360,Ninja Gaiden IIrepresents the best in amazing visuals, responsive control, and thrilling combat with an extensive assortment of ninja weaponry.Battle Huge BossesView ImageEngrossing StorylineView ImageSynopsisNinja Gaiden IImakes its long-awaited debut on Xbox 360 as the blockbuster action-packed sequel to Ninja Gaiden. Ninja Gaiden II features a new and improved game engine, developed from the ground up exclusively for Microsoft and Xbox 360 by Team Ninja and legendary game developer Tomonobu Itagaki, creator of the famed Dead or Alive franchise.Guide Ryu Hayabusa on a mission to avenge his clan and prevent the destruction of the human race. Armed with an assortment of ninja weaponry, help Ryu to skillfully maneuver through a world fraught with peril and danger.Ninja Gaiden IIfeatures an all-new gameplay engine, new auto-health regeneration system, levels, adventures, enemies, and thrilling combat with an extensive assortment of ninja weaponry, representing a true evolution of the highly popular franchise.", "price": 32.65, "imUrl": "http://ecx.images-amazon.com/images/I/51Ed-IX42GL._SY300_.jpg", "related": {"also_bought": ["B005DVAB1Y", "B00BFU8IBC", "B00008KTNW", "B0009UC68U", "B001KWFBG0", "B001YI0Z2U", "B000P297E8", "B002GPPPS4", "B000FLZEXM", "B005VBVQAG", "B001NX4DUQ", "B007UM59AC", "B003PHLTDC", "B002I0H79C", "B001ASJISG", "B0029MAXR2", "B002BRZ8FW", "B0050SY4DG", "B000O3IS48", "B002BSA1MQ", "B000FRS9II", "0761559396", "B000NNFJQY", "B00354NAYG", "B000ZK9QD2", "B005J5K9EI", "B0009WPZPE", "B000ZJVDA2", "B0022TNO7S", "B007H45BSI", "B00432O4VM", "B000SQ5LQ4", "B0056WJA30", "B000HCQK0A", "B00D9ILYJG", "B0030GBUCS", "B000F3AADE", "B001D7T2VM", "B000ZK6950", "B000C427NM", "B001L18RIE", "B002I0JAVK", "B000XJO7A2", "B000WQWPOQ", "B004A88W8K", "B00BFU8IEE", "B003H0CC2O", "B0016NRS28", "B000P46NMK", "B001E7MMNQ", "B001BP4JY6", "B00319DX4W", "B000FRU0NU", "B001UWGDC6", "B00309U0M6", "B007SRM5MO", "B000X1PE16", "B002I0K50U", "B0000AI1KE", "B000WSE2WM", "B000QW9D14", "B00KSQHX1K", "B0012N3ZXS", "B004FUL9YW", "B00149NCYW", "B002DC8GEK", "B000HKGIOA", "B0050SWVIQ", "B0016B8Q6M", "B00163LW7A", "B000ZK9QFK", "B002TDIEE0", "B003IE9V28", "B003GSZ9ZE", "B001QXNBJM", "B000Q36UJQ", "B000HX1P72", "B002W5GI9I", "B000CBVC0Y", "B0058VI0SU", "B0050SY77E", "B000R0URCE", "B0016BVYA2", "B004L9WGDA", "B0009Z3I0A", "B006ZTHGCK", "B000KLNLV4", "B002BSA20M", "B004JSDQPU", "B004UDLRMS", "B004FSE52C", "B002GN8HU4", "B0015HZLVA", "B000XJS00K", "B005DVAB0A", "B000B6ML1Y", "B005C2D2MO", "B0076ZPYPI", "B000FRVAD4", "B000UKZ20S"], "bought_together": ["B005DVAB1Y", "B00008KTNW"], "buy_after_viewing": ["B005DVAB1Y", "B0029MAXR2", "B002GPPPS4", "B00BMFIXT2"]}, "salesRank": {"Video Games": 5127}, "categories": [["Video Games", "Xbox 360", "Games"]]}