{"asin": "B00008OE5I", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "With the PowerShot S50, Canon updates the compact yet powerful S45 with a 5-megapixel sensor. Nestled between the ultratiny Elph models and the  feature-packed PowerShot G models, the PowerShot S50 combines most of the portability of the former with nearly every advanced feature of the latter. In addition to its high-resolution imagery, the PowerShot S50 also features a 3x optical zoom, movie mode with audio, and nine-point Artificial intelligence Auto Focus (AiAF).Optics and ResolutionThe PowerShot S50 has a  5-megapixel sensor with a maximum resolution of 2,592 x 1,944 pixels, enough detail for 4-by-6-inch to 20-by-30-inch (poster size) photos. It also features a 3x optical zoom and 4.1x digital zoom for a total 12.3x zoom.Canon's powerful DIGIC image processor provides a huge capacity for complex assessment of the scene to be captured. The PowerShot S50 uses information from the zoom position, scene brightness, and other systems to determine what sort of subject is being photographed in order to optimize AF speed, exposure accuracy, and white balance performance.For beginners, the camera is point-and-shoot simple. Just twist the dial to Auto and start snapping pictures. The PowerShot S50 offers a myriad of setting options, including three light metering modes, white balance presets with two positions for custom settings, exposure and focus bracketing, manual focus and AF lock, aperture and shutter-speed priority, and adjustable  ISO-equivalent sensitivity.Storage and TransferImages are stored on CompactFlash memory cards and the memory slot is compatible with CompactFlash Type II cards as well as Microdrives. The included 32 MB card holds approximately 21 images at the Large/Fine setting.Movie ModeShoot up to three minutes of MPEG video with sound, editing controls, and VCR-like playback. The movies aren't camcorder quality, but they're fun and convenient, and they're perfect as e-mail attachments. The camera can also attach voice memos or sound files of up to 60 seconds to each image.More FeaturesThe PowerShot S50 features 13 shooting modes, including  subject-based modes and semi-auto modes such as aperture priority. A fast sequence mode allows a maximum frame rate of 2 frames per second, maintained for up to eight images.The nine-point AiAF lets you focus your subject no matter where it appears in the viewfinder. For more freedom, FlexiZone AF/AE let you select which part of the frame you wish to focus on without moving your camera.Other features include:Large 1.8-inch LCD monitor.Built-in flash with auto, on, off, manual, slow-synch, and red-eye reduction modes.Ability to save an image in RAW format even when it was shot in a JPEG mode.The Intelligent Orientation Sensor displays your images properly rotated during playback on the LCD screen and your computer screen.To print your photos at home, the PowerShot S45 connects directly to Canon's bubble jet direct printers S830D and S530D, and card photo printer CP-100.Power, Size, and ContentsThe camera is powered by Canon's proprietary rechargeable lithium-ion battery pack NB-2L (included). It measures 4.4 x 2.3 x 1.7 inches and weighs 9.2 ounces. This package includes the PowerShot S50 digital camera, 32 MB CompactFlash card, battery and battery charger (CB-2LT), USB and AV cables, wrist strap, and ArcSoft Camera Suite CD-ROM and USB drivers for Windows and Mac.", "title": "Canon PowerShot S50 5MP Digital Camera w/ 3x Optical Zoom", "price": 499.99, "salesRank": {"Camera &amp; Photo": 14633}, "imUrl": "http://ecx.images-amazon.com/images/I/41710SW1C4L._SX300_.jpg", "related": {"also_viewed": ["B009B0MZ1M", "B001EYU71I", "B000Q3043Y", "B0000645C9", "B0033ZFKP4", "B00009W5FF", "B000V1VG5G", "B005I6DVC0", "B000J6FTUQ", "B002LITT42", "B0007QKMQY", "B005IGVXJS", "B002NEGTT2", "B005MTMFHU", "B000BO3CW8", "B000AYGD8E", "B0090SLJ1C", "B00028CECM", "B000AYGDIO", "B00AWYMXZY", "B00005QFZF", "B0007TJ5OG", "B00EFILNV8", "B009B0MY6S", "B00EFILHB4", "B000EMU888", "B006UMM2BW", "B00728ZBA2", "B000EMWBV0", "B00908BQCY", "B00AV3XH9W", "B0075SUK14", "B00DQHZYXM", "B005MTME3U", "B00EZAYD4A", "B00009R6WU", "B00AWYN0BU", "B0073HSH8U", "B003VTZE1M", "B002WE4H8I", "B0012YA85A", "B00B5HE1SY", "B00C7EPVHY", "B00CFCTDMC", "B00908BMVE", "B00B5HE3UU", "B00BW6LUL4", "B009B0MYSQ"], "buy_after_viewing": ["B002IEVVE0", "B000BO3CW8", "B009B0MZ1M", "B000I6QWP8"]}}