{"asin": "B001AZFSDS", "description": "Middle-Earth stands on the brink of destruction, and you must unite to either save it, or destroy it, in The Lord of the Rings: Conquest. With every race bound to this fate, all you have to decide is what to do with the time given to you, and choose your allegiance..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Join the battle for Middle Earth in Lord of the Rings: Conquest.View larger.Fans of the books and movies will love roaming the game world.View larger.All Your Favorites Come to LifeDeveloped by Pandemic Studios and published by Electronic Arts for Microsoft's Xbox 360, The Lord of the Rings: Conquest allows gamers to make the choice between good and evil. Those who side with good will get to follow Frodo's journey through Middle-Earth, playing in battles inspired by both the books and the movies. Or join evil to find out what may have happened if Frodo had failed to destroy the One Ring, as you fight your way with Sauron back across the map in an attempt to destroy Rivendell, the Shire, and all that is good in the world.You can play as a warrior, scout, mage or archer.View larger.The online multiplayer mode allows for massive battles with up to 16 of your friends.View larger.Building off the model Pandemic used with Star Wars: Battlefront, Lord of the Rings: Conquest provides you with a first and/or third person shooter style of game that not only lets you command strategy, but also lets you control the players in the center of the action. Participate in the Battle of Isengard as an Ent or fight Saruman at Orthanc as Gandalf himself. Take on the Nazgul as Aragorn while still protecting Frodo, or battle at Pelennor as a Rohirrim cavalry soldier. And that is just for the good guys!In Conquest you will have to play many different characters in order to win. And it isn't always such a balanced match, as you will find yourself destroying towering siege engines and taking on hulking oliphaunts with your companions. You can choose to play all the heroes you love, or fight as a Nazgul tasked with killing Frodo and stretch your powerful wings as the Balrog himself in your battle for Moria.Pick Your Own Style of PlayIn the game, you'll be able to play as one of four different character classes. Choose the melee-based Warrior or Scout for up-close action, or pick the Archer or Mage to perform devastating ranged attacks. There is also talk of a 'special' class called the Guardian to give gamers a third choice. But don't worry about getting locked in, as you can actually change which character class you're playing on the fly, in the middle of the game's various objective-based missions.Each class of characters has its own strengths and weaknesses, as well as unique special abilities. Playable units range from grunt soldiers, which are the weakest, to captains, which are the strongest AI units in the game other than the heroes. You also get to order in air strikes using either eagles or fellbeasts. Even better, players will be able to mount the occasional horse, unless they've chosen evil, in which case they will have to master the skill of riding a fearsome warg.Multiple Modes for Endless FunAs in Battlefront, Lord of the Rings: Conquest has enormous competitive multiplayer modes, including Conquest, Capture the Flag, and Hero Deathmatch. In addition to these classics, Conquest adds a Ring Bearer mode, in which one player tries to stay alive as Frodo against a host of ringwraiths, and Stronghold in which you fight on various maps in a Risk-style battle for territories. Fortunately, you won't be limited to roaming around with only your teammates, however, as battles occur in large scale with non-player combatants joining in the fray.Conquest allows online play with up to 16 players for massive battles with all your friends, or in two-player cooperative mode. Players can also play locally with up to four players competitively, or two-player co-op on a split screen. When in the game itself, fans will get the thrill of hearing Howard Shore's score for the films accompanying the action, and both good and evil campaigns are narrated by Hugo Weaving, who played Elrond in the movies.You can choose to play either good or evil, each with different endings.", "price": 170.54, "imUrl": "http://ecx.images-amazon.com/images/I/51H-rNjHVAL._SY300_.jpg", "related": {"also_bought": ["B000F1WGCY", "B003DNH95K", "B00007E1OB", "B00009VE6E", "B0009O7HUI", "B003FBL85W", "B0088MVOES", "B0001DI6FM", "B000R0URCE", "B0047S4642", "B001UWGBC8", "0761560386", "B00GY4OBB0", "B0002ILSGA", "B00BMFIXT2", "B002BSA20M", "B000WCN8IW", "B005THAX5Q", "B00020BV1A", "B0030EU3TG", "B00006GSNZ", "B003ZSP0WW", "B0030GBUCS", "B000QCU9I0", "B004HYK956", "B00ICWO14Y", "B004Z4ZJZS", "B00009VE6D", "B00026ENLE", "B00G9DFLP6", "B003O6E9EK", "B0016NRS8M", "B000SH3XD6", "B0050SYX8W", "B000Q7TGL6", "B00GMFKYH6", "B00AYSV89K", "B00B59MXDM", "B0044SA70M", "B002DC8GKE", "B00EVWYF0E", "B003BE6OZM", "B001TOQ8MU", "B004RIACPY", "B002DC8GEK", "B000ZK9QD2", "B00G6MW5CC", "B0032LTVWW", "B00ALNKHDQ", "B000ZKBJXC", "B00008J7NZ", "B002EZOQVI", "B001SBUBJU", "B000WMEEAI", "B000X25GX6", "B00005OWBL", "B00006IZKO", "B000P46NMK", "B002I0JAVK", "B00BU3ZLJQ", "B005N64U52", "B0037UCTCW", "B003PHLTDC", "0547154119", "B006Y76I86", "B0047TG2R0", "B0043QSR5C", "B000PE0HBS", "B00309S9YW", "B00EXJM3P4", "B001E8VB3C", "B0050SYLRK", "B00EVWZHLK", "B000067DPM", "B00CJ7IUGS", "B00B98HF1O", "B000KLNLV4", "B000MAFXTQ", "B000QS1K46", "B005FDUSTA", "B000G7PMXC", "B002I0J9M0", "B001CB9VSS", "B002W5GI9I", "B000WCN7G0", "B00008KTNH", "B007SRM5MO", "B000654ZK0", "B004NRN5DU", "B000WPXQSQ", "B00269QLI8", "B006GHA8EE", "B00AY1CT4U", "B0050SYV70", "B00005JMX6", "B004BD1DWG", "B004L2L2FA", "B001AWIOYG", "B00C71034I"], "bought_together": ["B003DNH95K", "B0088MVOES"], "buy_after_viewing": ["B003DNH95K", "B000F1WGCY", "B00BMFIXT2", "B0088MVOES"]}, "salesRank": {"Video Games": 3788}, "categories": [["Video Games", "Xbox 360", "Games"]]}