{"asin": "B003WJR694", "related": {"also_bought": ["B0039BPG1A", "B004GK3TBC", "B003VNKNF0", "B003VNKNEQ", "B004FSBIZY", "B004TNKI5G", "B001UE6N74", "B0071SRFV6", "B002IKLJU0"], "bought_together": ["B0039BPG1A", "B003VNKNF0"], "buy_after_viewing": ["B003VNKNF0", "B0039BPG1A", "B00DY2Y28M", "B00DY2Y28M", "B00I9OPF2W"]}, "title": "Panasonic Lumix DMC-FZ40 14.1 MP Digital Camera with 24x Optical Image Stabilized Zoom and 3.0-Inch LCD - Black", "price": 429.0, "salesRank": {"Camera &amp; Photo": 3614}, "imUrl": "http://ecx.images-amazon.com/images/I/41DH-G4kJsL._SX300_.jpg", "brand": "Panasonic", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The Panasonic Lumix DMC-FZ40 is a feature-packed, hybrid digital camera, combining a powerful 24x optical zoom and creative manual operations to offer photographers of all levels the opportunity to take crisp, artistic photos and High Definition (HD) videos. This 14.1-megapixel model features a 25mm ultra-wide angle Leica DC Vario-Elmarit lens and a new image processing system which achieves high picture quality for both still images and videos.Panasonic Lumix DMC-FZ40 HighlightsIntelligent Resolution technologyThe Lumix FZ40 features Intelligent Resolution technology which leads to optimum signal processing, giving images outstanding natural clarity, specifically focusing on the finer details. The Sonic Speed Auto Focus (AF) and high-speed start-up found on the FZ40 are at the industry's fastest level, helping users to catch even the most fleeting photo opportunities.Improved, intuitive manual and creative controlsThe Lumix FZ40 has upgraded intuitive manual and creative controls including the new jog dial which helps to elevate the camera's operability. The jog dial is a focus button which allows users to change settings quickly including shutter speed and aperture, depending on the shooting conditions. Additionally, the new My Color mode which has been popular on Lumix G Micro System cameras is available in both still and movie modes, and gives users creative freedom with a suite of options, including new Pin Hole, Film Grain, High Dynamic and High Dynamic B&amp;W.Intelligent Auto (iA) modePanasonic's hallmark Intelligent Auto (iA) mode automatically selects the most suitable Scene mode and remembers previously-registered faces. And the intuitive system also includes POWER Optical Image Stabilizer (O.I.S.), featuring double the repression power compared to that of Panasonic's previous image stabilization system, MEGA O.I.S. This system helps to eliminate blur resulting from hand-shake, a common problem when pressing the shutter button while taking photos or shooting video.HD movies in AVCHD LiteUsers can now enjoy easy shooting of HD movies in AVCHD Lite with double the recording time in HD quality compared with the conventional Motion JPEG format. Additionally, a separate and dedicated button located on the top of the camera allows users to instantly begin recording in video mode--so switching between capturing still photos and video is quick and seamless.Additional Features3.0-inch 230,000-dot Intelligent LCD with 100% field of viewHigh energy efficiency which extends the battery life up to 580 shots (CIPA) per chargeNew Video Divide function with which users can separate a video they've shot into two sections to shorten or delete any unwanted partsWind Cut function blocks out noise from background wind when shooting in video modeWhat's in the BoxDMW-BMB9 Lithium-Ion BatteryBattery Charger DE-A83BAUSB CableA/V CableLens Hoodlens Cap w/ StringShoulder StrapSoftware CD-ROM1-Year Panasonic Warranty"}