{"asin": "B0000DJX7I", "description": "Praised for brilliant scripts and open-ended gameplay, vilified for unapologetic violence and mature themes,Grand Theft Autohas deservedly become one of the most popular game franchises in history. This double pack contains the full versions of bothGrand Theft Auto IIIandGrand Theft Auto III: Vice City, enhanced for Xbox. Xbox gamers can rejoice that the grand king of video games--The Sopranoswith a gamepad--is finally available on the big black box.Grand Theft AutoWithGrand Theft Auto IIIRockstar proves that not all developers are concerned with toning down the violence in their games. This sequel is even more bloody, violent, and sadistic than its popular predecessors, offering up an enormous 3-D city in which nearly any criminal act is possible. Players are free to steal cars, beat up the local population for their money (or weapons), make time with prostitutes, or simply roam to their heart's content. Those seeking more structure can embark on dozens of missions driven by a genuinely interesting crime-story plot or steal cars that let them play minigames. Nab a cop car and you can go on vigilante missions. Grab a cab and you can play a deadly version ofCrazy Taxi. Take a fire truck and you can earn money putting out fires. The minigames are a good way to unwind after a particularly difficult mission. With so much to do, the game just never gets boring.As you'd expect, there are consequences for criminality. As your random acts of mayhem mount up the police start hounding you, eventually calling in SWAT trucks, the FBI, and even the army if you continue down the path of destruction. Shaking these pursuers is easily the most fun part of the game, especially when a bunch of friends are packed in the room to witness your narrow escapes.Grand Theft Auto IIIis fine-tuned to near perfection in every category. All the vehicles, from slick sports cars to lumbering dump trucks, handle exactly as you'd expect and smash apart realistically when abused. The three islands in the game are rendered in terrific detail considering their size, and are packed with traffic, pedestrians, and hidden jumps. The audio is equally amazing. Pedestrians talk, cops scream at you, and you can tune in nine different radio stations whenever you are in a car. It all adds up to a monumental achievement: the rare console game for adults that manages to get everything right.--T. Byrl BakerGrand Theft Auto III: Vice CityHow big is this game? Even publicists for other games end up talking aboutVice Citywhen they call our office, babbling in the same helplessly intoxicated way that afflicts everyone who plays it. The achievement ofVice City(which, as everyone knows by now, is set in the 1980s and offers an all-new, Miami Vice-inspired story) is not only that it manages to live up to an absurd level of expectation, but that it takes the game places that fans of its predecessorGrand Theft Auto IIInever dreamed of, and that it achieves this astonishing level of innovation without losing anything that madeGTA3the bestselling PS2 game of all time.After a brilliant homage to the era of the Commodore 64 in the opening credits, the first thing you'll notice is the improved graphics, which are smoother and more detailed, and--with effects like neon lights reflected on rain-slick streets, and intense Florida sunlight--have a lush, tropical look that immediately gives you a strong sense of place. The architecture is more fabulous by tenfold, with art deco buildings, high-rise hotels, and believably seedy back alleys. The control scheme is essentially the same as inGTA3, but the cars handle much better, and in pedestrian mode there is a new crouch move. You will have access to fast, great-handling cars right away, as opposed toGTA3which made you unlock the second island before you could get your hands on any respectable wheels. This game has such riches to offer that there is no need to be chintzy with the vehicles.Cops are more vigilant this time--minor offenses like whacking innocent bystanders will more often than not get you a two-star wanted level--and are harder to elude (though they still can't seem to climb stairs or negotiate sharp turns). So while free-roaming exploration is as fun as ever, there is more incentive to perform the missions instead of randomly raising hell. Not that that's a bad thing: even lazy criminals like myself (inGTA3, I would rather toss hand grenades into traffic than follow orders from some rude Mafia boss) will be quickly caught up in the vivid characters and hilarious, fascinating story, in which you play an acid-washed-jeans-wearing thug named Tommy Vercetti. Where inGTA3missions were blocky, schematic affairs only nominally connected to the story, this time tasks move the story briskly along and deftly blend cinematics and game action. For example, there is a scene of a character throwing Tommy a gun, at which point you are suddenly thrown back into the action and must make an instant decision about whom to trust and what to do.There are more, and more detailed, indoor environments, including a hotel, police station, and mall (a slight downside to this is that some of the more elaborate indoor environments require load times). The layout of the city, with tons of backyards, narrow alleys, and fire escapes, encourages creativity when eluding pursuit, as does greater access to rooftops. Get your motorcycle up the fire escape and a whole new world of action is possible, including... well, use your imagination.This overview barely scratches the surface of theVice Cityexperience, its colorful explosion of music, clothes, combat, and brilliant voice acting, not to mention the plot twist midway through the game that changes the very nature of the game itself. Though it was the outrageous, amoral violence that got all the press, the essential genius ofGTA3was its intoxicating blend of script and open-ended action. InVice Citythis is--to use a clich&#xE9; that is for once apropos--taken to a whole new level.--David StoeszPros:Open-ended gameplay; player can chose to be relatively law-abiding or engage in wanton virtual destructionVaried missionsBrilliant scripts with Hollywood voice actingRocking sound track (also available in our Music store)Xbox-enhanced graphicsCons:As theThe Sopranosof games,GTA 3draws unwanted attention from overzealous legislatorsNo multiplayer", "price": 161.71, "imUrl": "http://ecx.images-amazon.com/images/I/512AW0XX1RL._SY300_.jpg", "related": {"also_bought": ["B0007ZD79E", "B000AX21VI", "B0000A92KZ", "B00005NZ1G", "B00005RCQ5", "B001ELWMHI", "B0007PLKZW", "B0001ADAMO", "B0045EI7I4", "B00006JZQZ", "B00008J7NZ", "B0002SQ0BS", "B0000C7GH4", "B0002ILSH4", "B00008KTNW", "B000B2YR74", "B001JFTDLM", "B0006ZJPSC", "B00082ZQZY", "0744004292", "B0001JXQ5Q", "B0000A082T", "B000095ZGZ", "B000FRU1UM", "B0001UEHP8", "B00008DHNN", "B00005U8TR", "B00005BZCH", "B0009350C6", "B002DC8GMM", "B001I020CW", "B0009351RK", "B00097IA88", "B00006JN5J", "B000E61G4O", "B000G82DDS", "B0002IQC8Y", "B0000C4M23", "B0002CHIWY", "B0001KUE7S", "0744001943", "074400098X", "B00005RKO7", "B0008JILX6", "B00020BV0Q", "B00019AZA0", "B000930DP0", "B000EMJA3C", "B0002CHIZ6", "B000095ZH0", "0744003555", "B0006SST9U", "B0007PIEAQ", "B00005O628", "B00005V6BJ", "B0050SYILE", "B0000AI1KE", "B0007M226G", "B0050SYY5E", "B00007UHEQ", "B00012TIW8", "B00008XKZM", "B000067DPM", "B0009Z3HXS", "B00005OWBL", "B00006C28W", "B000AOEV6A", "0744009332", "B0009KQOPG", "B0002VYPEE", "B0076ZPYPI", "B000088KH3", "B000FDMV9U", "B004AGYHUE", "B000930DLY", "B0009O7HUI", "B000FYZS6M", "B002K8Y23G", "B0001DI6FM", "B00009YFU2", "B00019AZAK", "B0009UC68U", "B00006LEM3", "B0002IJY2U", "B0002A2S26", "B0006ZJPRI", "B00005O0I8", "B00006FWU7", "B00009X3V0", "B000088KHF", "B0007OSLOG", "B0009Z3HNS", "B00019HNN2", "B0009VRSJQ", "B000ERVM0Q", "B00020V5AW", "B000HVDEQO", "B0007P8FN2", "B000NGWFX6", "B0006I5I58"], "bought_together": ["B0007ZD79E", "B00008J7NZ"], "buy_after_viewing": ["B001JFTDLM", "B0007ZD79E", "B0045EI7I4", "B0050SYILE"]}, "salesRank": {"Video Games": 5540}, "categories": [["Video Games", "More Systems", "Xbox", "Games"], ["Video Games", "PC"]]}