{"asin": "B000087HF8", "related": {"also_bought": ["B001KADGMI", "B002DUD72S", "B000G71A1U", "B00A2G0IIG", "B002DUD7I2", "B002DUD6UQ", "B0018G4ZEW", "B00A3ABXSA", "B002DUD71Y", "B002DUD6VA", "B000ZER1TO", "B002DUD6TW", "B005RCDW8S", "B002DYIZEO", "B001HBJ0ZC", "B0015QSW4O", "B000GOT54C", "B002DUD6SS", "B00AAI6KR4", "B0018G3KCK", "B000G724BU", "B0000DD5Z1", "B002DYIZEE", "B00E0NM8ZS", "B002SG7NAO", "B002DYIZH6", "B0018G3HPK", "B0013OXD38", "B005VOOOM0", "B00906HUJE", "B003A00W9G", "B003CN5NO0", "B0027XWS7Q", "B000G719EI", "B00DNH5OZS", "B002DUD76E", "B00D9AN87A", "B001KABV52", "B002DYIZCQ", "B0050QP536", "B005JASX2I", "B001G7PJAC", "B0027Z8VES", "B002FTT1G8", "B000GP5HP2", "B0041HM8CG", "B000EQW3ZA", "B0075JMQ2E", "B007UZNS5W", "B000G6ZEBS", "B000QSNYGI", "B00819XXQU", "B00K2RJAR0", "B002FK37M6", "B003607ZNG", "B0016QALBU", "B000GX4A98", "B00D8DZFPQ", "B008ELO6KC", "B0089YIQGO", "B002Z08RIA", "B003P87IUO", "B0007MW2ZW", "B007S6Y6VS", "B004EMNER6", "B00505EZYW", "B00GLXKDPC", "B000GP5HJI", "B0015RAHUU", "B004RKJLFE", "B002DYJ0K2", "B000A6V8FU", "B00HK61L3C", "B001MIZMP2", "B00FFY8PZS", "B00074T848", "B002RL8FD4", "B007LAHS2K", "B00I0DI0Z6", "B0019RLJV2", "B00074T85W", "B002NPCML0"], "also_viewed": ["B000G71A1U", "B0015QSW4O", "B002DUD6SS", "B002DUD72S", "B002DUD6RO", "B002DUD6UQ", "B00AAI6KR4", "B0015QSW9E", "B000NVFB2I", "B002DUD7I2", "B00A2G0IIG", "B00L82RO0I", "B00DJOWY6C", "B002DUD6TW", "B00A3ABXSA", "B002DUD9XA", "B000G724BU", "B000RZ90LS", "B002DUD6V0", "B00DX7MVKY", "B008LEBNY4", "B002LMVUCM", "B002DUD6U6", "B002DUD6SI", "B000PXXI4M", "B000RZDJGU", "B002DUD6TM", "B002DUD73C", "B002SG7NAO", "B000G719EI", "B000QSNYGI", "B003YQV0A6", "B002DYIZH6", "B000G75YPI"], "bought_together": ["B001KADGMI", "B002DYIZEO"]}, "title": "CytoSport Muscle Milk, Chocolate, Gluten Free, 2.47 Pound", "price": 27.36, "salesRank": {"Health & Personal Care": 1305}, "imUrl": "http://ecx.images-amazon.com/images/I/419t%2BcKctkL._SY300_.jpg", "brand": "Cytosport", "categories": [["Health & Personal Care", "Sports Nutrition", "Protein", "Powders", "Blends"]], "description": "CytoSport Muscle Milk is a great-tasting, lactose free protein drink mix featuring high-quality dairy proteins, functional fats, carbohydrates, and 20 vitamins and minerals to help fuel exercise recovery.CytoSport Muscle Milk ChocolateAt a Glance:Premium, multisource proteins for a rich source of amino acidsLactose freeGluten freePolyunsaturated and monounsaturated fats for essential fatty acidsNaturally rich in amino acids20 vitamins and mineralsIncredible tasteA precise blend of proteins, carbs, and functional fats ideal for exercise recovery.View larger.NFL stars Clay Matthews and Andre Johnson use Muscle Milk to train and compete.View larger.Muscle Milk Powder: Nature's Lean-Muscle ProteinWhen Muscle Milk was first introduced, CytoSport attempted to emulate human mother's milk, one of nature's most anabolic, complete and balanced foods. In doing that, Muscle Milk created a new category of protein products while setting a new standard for both taste and performance.Loaded with amino acids--the building blocks of muscle tissue.View larger.Multisource Protein Blend Supplies Amino AcidsMuscle Milk contains a precise blend of caseinates, milk proteins, and whey to create a constant supply of amino acids--the building blocks of muscle tissue.LeanLipids Provide Functional FatsThe LeanLipids found in Muscle Milk provide functional fats, which are more likely to be burned for muscle energy and heat than stored as fat. Medium-chain triglycerides (MCTs), the pre-digested \"fast-burning fats,\" help provide the caloric energy needed to fuel exercise and recovery. Polyunsaturated and monounsaturated fatty acids from canola and sunflower oils provide essential omega-3, -6, and -9 fatty acids.Carbohydrates for Exercise RecoveryMuscle Milk provides a blend of carbohydrates that includes dietary fiber to fuel exercise recovery and improve protein utilization.Vitamins and Minerals Plus GlutamineMuscle Milk also contains 20 essential vitamins and minerals per serving. Additionally, Muscle Milk is naturally rich in glutamine, which supports muscle recovery. All this in a great-tasting protein drink you can enjoy any time.Muscle Milk Frequently Asked QuestionsQ: When is the best time to take Muscle Milk?A: The premium protein blend and macronutrients in Muscle Milk make it ideal to support post-workout recovery. Additionally, Muscle Milk may be used as a protein-enhanced meal replacement option or before bed to provide muscle tissue with a rich supply of amino acids while sleeping.Q: Who can use Muscle Milk?A: Muscle Milk can be utilized by anyone leading an active lifestyle to support exercise recovery or used by anyone looking to increase their daily protein intake.Q: What types of proteins are in Muscle Milk?A: Muscle Milk contains dairy-based proteins derived from milk, including caseinates, milk protein, and whey.Q: Is Muscle Milk lactose free?A: Yes. All Muscle Milk powders are lactose free.What's in the BoxCytoSport Muscle Milk Chocolate (2.47 pounds).Try all of the delicious Muscle Milk flavors:Vanilla CremeChocolateStrawberries 'n CremeBanana CremeCookies 'n CremeMocha Latte1 pound2.47 pounds4.94 pounds1 pound2.47 pounds4.94 pounds1 pound2.47 pounds4.94 pounds1 pound2.47 pounds4.94 pounds2.47 pounds4.94 pounds2.47 poundsOrange CremeBlueberries 'n CremePeanut Butter ChocolateChocolate Caramel PecanChocolate MaltDark Chocolate2.47 pounds2.47 pounds2.47 pounds2.47 pounds2.47 pounds2.47 poundsChocolate MintCinnamon BunCake BatterCookie DoughWhite Chocolate MousseStrawberry Banana2.47 pounds2.47 pounds2.47 pounds2.47 pounds2.47 pounds2.47 poundsBrownie BatterPeach MangoNatural Vanilla CremeNatural Real ChocolateNatural Fresh Strawberry&nbsp;2.47 pounds2.47 pounds2.47 pounds2.47 pounds2.47 poundsTrademark Information:Muscle Milk&reg;LeanLipids&trade;"}