{"asin": "B004SPVZKW", "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Cases & Sleeves", "Cases"]], "description": "Ridiculously over-engineered? Or the perfect case for your iPad no matter where you're headed?  We think it's a little bit of both.  Simply put, the Griffin Survivor Case is the most protective case we've ever built.  Tested and certified to meet or exceed US Department of Defense Standard 810F, Griffin's Survivor Military-Duty Case is designed from the inside out to protect your iPad from extreme conditions ... dirt, sand, rain, shock, vibration and a host of other environmental factors.  Survivor is built on a shatter-resistant polycarbonate frame clad in rugged, shock absorbing silicone. A built-in screen protector seals your Multi-Touch display from the outside environment, while plugs seal the dock connector, camera lens, headphone port, hold switch and volume controls. The included stand clips on, then folds open for landscape viewing and typing.  Survivor is independently tested and verified to meet or exceed environmental testing standards for blown rain, blown dust and grit, vibration, shock, temperature and humidity.  Griffin Technology began designing and manufacturing technical solutions with an innovative flair in 1992. They have since grown to become one of the largest providers of accessories for personal computing and digital media. Griffin's approach has given birth to some of the best known accessories in the digital entertainment and personal computer markets, including the iTrip family of FM transmitters and the groundbreaking Evolve Wireless Sound System. Today, Griffin designs, manufactures and delivers useful and fun solutions for digital entertainment and personal computing to people in the Americas, Europe, and Asia, through major retailers and online.What's in the box: Technology Survivor Extreme-Duty Case for iPad 2 & new iPad (Black), Position Heavy-Duty Detachable Clip and 1-Year Limited Warranty.", "title": "Griffin GB02480 Survivor Extreme-duty Military case for the new iPad (4th Generation), iPad 3 and iPad 2, Black", "price": 54.99, "imUrl": "http://ecx.images-amazon.com/images/I/414fkuEfoML._SY300_.jpg", "brand": "Griffin Technology", "related": {"also_bought": ["B007XOQ3BQ", "B00FXL45Z2", "B00BXJTKGM", "B009VXH3UW", "B00ENZDZMS", "B002BBJMO6", "B009W8YQ6K", "B0085M1LL2", "B009W9JG78", "B0055Q9NH0", "B003D8GAA0", "B0013FRNKG", "B00B7MR1P2", "B0047DVW7Q", "B0047DVWZS", "B009W9APU0", "B00FXL49X0", "B004WYA852", "B00APD5DR2", "B00746UR2E", "B009W9HHN8", "B00DPN3XZ8", "B00838L1MM", "B008UHK3KM", "B008UHKTCY", "B008TW0EWA", "B00FEE7KMI", "B0047DVWLW", "B0081TFH00", "B00BUSELRE", "B009W9AEOM", "B00042LC9M", "B00A83I8G2", "B004V68IQ2", "B001S4OTS6", "B007IV7KRU", "B00409E4JK", "B00DRK73IM", "B008427D88"], "bought_together": ["B002BBJMO6"], "buy_after_viewing": ["B007XOQ3BQ", "B007IV7KRU", "B008TW0EWA", "B00H40VLDY"]}}