{"asin": "B000E5GKW8", "description": "In sleek black, to go with some of today's newest MP3 and other audio players.  Originally developed for professional musicians, the E2c combines Dynamic MicroDriver speaker technology with a sound isolating design to deliver rich, full-range sound while blocking outside noise -- ideal for enhancing your listening experience with portable MP3, DVD, and CD players as well as all other audio sources.  The E2c's in ear design works like an earplug to block background noise naturally. This enables you to listen comfortably at lower volumes -- even in loud environments. And unlike bulky headphones utilizing active noise cancellation technology, no artifacts are introduced into your listening experience. Sound isolating earphones are also much smaller and don't require batteries.  The E2c's speakers are constructed with studio-grade components, producing outstanding audio clarity that allows you to hear your music like never before.  The E2c's cables pass behind the ear - out of sight and out of the way -- to provide a more comfortable, discreet fit.  Plus, the E2c comes with a stylish, compact carrying case. The cable spool inside provides a convenient, tangle-free way to store your earphones.", "title": "Shure E2c-n Sound Isolating Earphones (Black) (Discontinued by Manufacturer)", "price": 49.0, "imUrl": "http://ecx.images-amazon.com/images/I/41J0655J4ML._SY300_.jpg", "related": {"also_viewed": ["B004PNZFZ8", "B00EWOK09G", "B0000CE1UO", "B0001NNLHK", "B00426DND4", "B0050L5VO4", "B003NSBKSM", "B0007XGOTG", "B0000CE1VP", "B000XPG2QI", "B009ZNFEEU", "B000UF0BWM", "B000O8ENQK", "B000VHUE0S", "B003S3RFIQ", "B001LEH7LE", "B003NSBKT6", "B009E6J8U4", "B001V9LPT4", "B001LNO722", "B003NSBKSW", "B000XP8DJC", "B003I65U4E", "B00029U0XQ", "B00DIUGW6A", "B0043241X8", "B0019RBJOE", "B005N8W27I", "B00E8QI4AK", "B0015PN3W6", "B00001W0DI", "B0094S35W4", "B003NVM89Y", "B000WAHFBK", "B00FYZSTVS", "B005W1DSU6", "B004HD4L1U", "B000NDLJNG", "B0013JT3XC", "B0012UUL0Q", "B0046HADYQ", "B00FYZZ4PW", "B007TCXGVC", "B00FJISZFK", "B00275F2GS", "B0031RG33C", "B00264GYMG", "B000MPNUE6", "B005N8W23C", "B001DX9EE6", "B001NH0V1M", "B00ISL3PPU", "B00DAPQTTS", "B00373PE9Y", "B006K557BQ", "B0035JKJ68", "B005XSBNG4", "B0013JH30M"], "buy_after_viewing": ["B004PNZFZ8", "B001LEH7LE", "B00EWOK09G", "B001NH0V1M"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]]}