{"asin": "B00009MK3T", "description": "Our most affordable headphones offer proof that high-performance sound can come in a very lightweight package. TriPort headphones deliver the full spectrum of your music whether you're plugged into a computer or on the go with a portable media device. Their ergonomic design keeps them remarkably comfortable and lightweight, even as proprietary Bose headphone technology reveals the rich acoustical landscape of your music.Bose sound. To goWith Bose technology, you don&#x92;t have to compromise the quality of your audio just because you&#x92;re listening through a pair of headphones. Our acoustic equalization techniques deliver the rich nuances of your music that conventional headphones often lose. You hear the intricate notes of an acoustic guitar, the full range of vocals and even the beat of a drum with greater clarity and impact. TriPort&#xAE; headphone technology faithfully reproduces deep, full low notes without requiring the artificial bass boost function found on many portable players.Comfortable fit includedAdvanced ergonomics and lightweight design define the stylish TriPort headphones. Soft ear cushions gently fit around your ear for comfortable listening. A thin, adjustable headband has several head size settings and the earcups swivel for a better fit. An additional benefit of Bose TriPort headphone technology is that it helps reduce headphone size without sacrificing performance, resulting in a total weight of only five ounces.TriPort headphones put it all together: high-performance sound, comfortable fit and stylish design in one affordable audio experience.What's in the box1 pair of headphones, Extension cord, 1/4\" stereo phone adapter, 1 headphone plug, Drawstring carry bag.", "title": "Bose TriPort Around Ear Headphones (Old Version)", "price": 17.99, "imUrl": "http://ecx.images-amazon.com/images/I/41zT3cUX5%2BL._SX300_.jpg", "related": {"also_viewed": ["B009BXX8II", "B008VM84NY", "B00478O0JI", "B005586PT2", "B000HWV8QG", "B002LK2QJK", "B005KJM30G", "B0091EBU28", "B00IUICOUS", "B00EZLDG4C", "B0081X1R8C", "B008YUNHK8", "B005KJMTXM", "B005KJJKVG", "B00FWO4U32", "B00IUICOR6", "B00IUICOHG", "B000AP05BO", "B00IUICOK8", "B0057XZSMA", "B00KRZSJ2O", "B005KJJOEY", "B006LOKNYW", "B0054JJ0QW", "B00IUICOF8", "B00915OV1E", "B002M38I2U", "B00FVGSE2E", "B0057XZSF2", "B00IUICQ1U", "B003LPTAYI", "B00IUICQ9M", "B00CD1FB26", "B0081XAXXM", "B000065BPB", "B007BY3PNW", "B00GP3RXJW", "B0059F3EXG", "B00KMQ7XMU", "B0007XJSQC", "B005N8W1MO", "B000G36GOK", "B005CSPHYY", "B003XU6H8I", "B000AJIF4E", "B00007E7C8", "B009A7BP3U", "B0073H2WP4", "B001EYU3L2", "B00G6QBCWC", "B009A6D1NI", "B004RF9X70", "B0065VKQ34", "B00H711YRS"], "buy_after_viewing": ["B009BXX8II", "B008VM84NY", "B00478O0JI", "B00007E7C8"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]]}