{"asin": "B0083PR7N2", "description": "See the difference for yourself with the Acer ICONIA Tab A700 Series. Stunning 1920 x 1200 resolution brings your movies, Web- browsing, gaming and more to life - see every detail in brilliant clarity and detail. The quad-core processor delivers unbelievable power for fast performance and smooth multitasking while productivity boosting apps let you work harder than ever, the A700 can handle it. With up to 13 hours of battery-life*, enjoy your day like you were meant to, all day long. Acer takes the tablet experience to new limits with the ICONIA Tab A700, now you can enjoy rich multimedia and easily complete tasks - wherever your day takes you.br/Key Features10.1&rdquo; Full HD Multi-Touch 1080p Display:(1920 x 1200) resolution, 16:10 aspect ratioAndroid&trade; 4.0 Operating System (Ice Cream Sandwich)NVIDIA&reg; Tegra&trade; 3 Quad Core Mobile Processor (1.3GHz)Super 4-PLUS-1&trade; Quad Core with Battery Saver Core1GB DDR2 MemoryUltra Low Power (ULP) High Performance 12-core NVIDIA&reg; GeForce&reg; GPU32GB internal storageMicroSD memory slot up to 32GB SDHCDolby&reg; Mobile 3 (upgradable to Dolby Mobile 3+)Stereo SpeakersDual-Analog Microphone802.11b/g/n WirelessBluetooth&reg; 2.1+EDR1- Micro USB 2.0 Port1- Micro-HDMI&trade; Out(with support for 1080p, dual displays and 5.1 channel surround sound)5MP Rear-Facing Camera with Auto FocusFront-Facing HD CameraSensors:G-Sensor, E-Compass, L Sensor, Gyro-meterRechargeable Lithium-ion polymer BatteryUp to 11-hours of Video Playback via Wi-fi(1)(1) Battery life varies depending on product specifications, tablet settings and applications or features launched.Up to 13-hours of Video Playback one system(2)(2) Battery life varies depending on product specifications, tablet settings and applications or features launched. Video Playback on system (Not streaming Wi-fi off)Color: BlackLearn MoreSee Your Entertainment DifferentlyStarting with its gorgeous 10.1\" Full HD (1920 x 1200) multitouch screen for the ultimate 1080p movie, gaming and browsing experience, the ICONIA Tab A700 is a visual delight. Its slim and curved design&mdash;in silver or black&mdash;includes a textured back cover that's soft to the touch, subtly making all your entertainment activities even more pleasurableEnjoy hours of diversions with friends and family or on your own with great preloaded apps. Get endless reading material with Kindle and entertainment anywhere with Netflix. Groove to your personal playlists with Google Play Music, and get into the action with any of the thousands of games available on the Google Play Market.Dolby&reg; Mobile 3 brings compelling surround sound and cinematic impact to movies, shows and videos. Your music comes through with concert quality thanks to clear, crisp and well-balanced sound featuring unfettered highs and extended bass.Go even bigger by easily connecting to your HDTV via the Micro-HDMI out port, delivering support for 1080P, dual displays and 5.1 channel surround sound for crisp high-quality visuals and high-fidelity audio through a single cable. (Cable sold separately)See the Power of Quad-CoreAndroid 4.0 (Ice Cream Sandwich), the latest version of the Android OS for tablets. builds on what people love most about Android. Experience its refined interface, improved communication and calendaring tools, new voice input engine, great photo features, easy multitasking and deep interactivity&mdash;all ready at your touch.NVIDIA&reg; Tegra&trade; 3 quad-core processing and an ultra low power (ULP) NVIDIA&reg; GeForce&reg; GPU deliver the world&rsquo;s only 4-Plus-1&trade; mobile quad-core CPU and 12-core graphics performance. The four central cores give you amazing response for demanding applications like video editing and console-quality gaming, and a fifth battery-saver core handles your simpler tasks. Twelve-core graphics powers the 224ppi, 800:1 contrast, 10-point touchscreen, or use dual displays or HDMI&reg; to HDTV.Check the morning news, update your social media at lunch, and book a restaurant reservation in the evening: The 13 hours of battery life give you all-day freedom.See Productivity Openly!Get more done! Polaris Office 3.5 lets you read and edit documents in high resolution. Like having your own personal assistant, the Evernote app helps you remember everything. And the Android browser lets you save webpages for later.Acer makes tasks easy, without wires! Acer Print connects wirelessly to a variety of Wi-Fi printers to generate documents, photos and more with the push of a button.The unique interactive Acer Ring allows you to customize your tablet experience by selecting your most common used applications and keeping them in one spot. Bring fun control to your favorite apps and tools- all within reach. Launch the ring by tapping the double circle located in the system bar. It will open up a series of key apps, key settings, bookmarks, or contextual menu options. Easy as that!Noise suppression and acoustic echo cancellation make HD video calls seem like talking face to face. Google Search is easy with improved voice recognition. And Bluetooth&reg; makes file transfer to your equipped PC and devices quick and cord free.With its Micro-USB 2.0 port, the Iconia Tab A700 gives you the ability to connect USB flash drives, USB media card readers and even a portable hard drive. Plus, the microSD&reg; slot lets you extend your files and libraries onto multiple microSD cards.", "title": "Acer ICONIA Tab A700-10k32u 10.1-Inch Tablet (Black)", "price": 13.99, "imUrl": "http://ecx.images-amazon.com/images/I/51gYyLihrGL._SY300_.jpg", "related": {"also_bought": ["B00A5UFIW0", "B00DMMKB52", "B0088KA7LQ", "B008EYH8LI", "B007Z1MJYW", "B008K9IX66", "B008R3MNJ8", "B00H7FRCDY", "B00ATY90Z8", "B008DMFITU", "B008OC9YEO", "B005BYL7WK", "B008G6Q4R8", "B008DMF7M8", "B00IK1626W", "B00D3F9H62", "B0089MABKU", "B009XDWRH4", "B00GZI4JKI", "B00BTMEIM4", "B009HPGO7M", "B00C7XG48U", "B00BIOVZ38", "B008R3I8RY", "B00DTMA6WI", "B008ELH3NY", "B004XZL980", "B00BXOYQPW", "B00ECU78XG", "B00GZ1PS00", "B007SP3746", "B005TP4LV0", "B005E2LX28", "B00ACC0PGA", "B004VPLY1E", "B0097MX02C", "B009QZH7BU", "B004C3HZCC", "B0091L7D90", "B008JCVF1Y", "B008G6Q4TQ", "B005QX7KYU", "B008MOHP5Y", "B008YA6QDI", "B007XZM6VG", "B00CES44EO", "B0060AU5MW", "B004C4SHQY", "B00AE9DIR4"], "buy_after_viewing": ["B00H7FRCDY", "B00A5UFIW0", "B00DXFDHV8", "B004XZL980"]}, "categories": [["Electronics", "Computers & Accessories", "Tablets"]]}