{"asin": "B001VEJEG0", "description": "The TomTom ONE 140-S is complete navigation. Switch on and go right out of the box. Spoken turn-by-turn instructions, including street names, will guide you to any address in the United States, Canada, and Mexico--including more than 7 million preloaded points of interest.Complete navigation and spoken street names.Click to enlarge.The Fold &amp; Go EasyPort mount folds flat against the device, making it easy to take it with you from car to car.Click to enlarge.IQ Routes Technology* gives you the fastest route every time by using actual average speeds of travel on your route to calculate your trip rather than only posted speed limits, so you'll always travel the smartest route. Advanced Lane Guidance* uses photorealistic images to bring even more clarity to complex multi-lane exits so you can be more confident on the road.TomTom has the most accurate maps, and with TomTom Map Share technology, you instantly can modify street names, street direction, POIs, road speeds, and turn restrictions on your own device. With the \"Help Me!\" menu, added safety features enable you to easily access local emergency providers.The Fold &amp; Go EasyPort mount folds flat against the device, making it easy to take it with you from car to car.The ONE 140-S is complete navigation.*Features only available in the United States and Canada.TomTom ONE 140-S FeaturesMaps of United States, Canada, and Mexico with TomTom Map ShareSpoken Street Names7 million POIsIQ Routes TechnologyAdvanced Lane GuidanceFold &amp; Go EasyPort MountAll TomToms FeaturePlug &amp; Go--Works right out of the box.Preloaded Points of Interest--Easily find millions of gas stations, restaurants, hotels, and more on your route.30-Day Latest Map Guarantee--Up to date, off the shelf.TomTom Map Share--Modify your own map and benefit from others' verified changes with TomTom Map Share.Help Me! Emergency Menu--Easily access local emergency providers, such as police, fire stations, and hospitals.TomTom HOME--Always up to date.Traffic Ready--Optional RDS-TMC traffic receiver accessory keeps you up-to-date on traffic events to minimize potential delays.Fuel Price Service (optional)--Know more, pay less.Why TomTom?TomTom believes that personal navigation should be as easy and safe as possible. TomTom develops smart technology that gives you straightforward solutions, innovations to make life easy.Easy to UseAward-winning navigation softwarePlug &amp; goBest Maps30-Day Latest Map GuaranteeModify your own map and benefit from others' verified changes with TomTom Map ShareBest RoutingQuickGPSfixTraffic readyLeader in SafetyHelp Me! emergency resources menuSafety preferences menuWhat's in the BoxONE 140S GPS device, EasyPort mount, USB cable, adhesive disk, car charger, and user guideAbout TomTomFounded in Amsterdam in 1991, TomTom has established itself as a global leader in navigation by being an innovative company with a strong brand, clear customer focus, and high-quality products and services.TomTom is a leading navigation solutions provider with navigation products sold in 30 countries and in over 20 languages. To further its commitment to car navigation, TomTom acquired Tele Atlas maps in 2008 so that the company can continually provide the most up-to-date maps and intelligent routing.TomTom has its own mapping company!Did you know that every year, roads change by up to 40% in high-growth areas? Tele Atlas manages this by using the world's most comprehensive systems to identify and incorporate these changes into our maps with unprecedented levels of speed and accuracy. All TomTom devices benefit from the Tele Atlas advantage--more coverage, more points of interest, and more freshness and accuracy.What's in the BoxONE 140-S 140 Device, Fold &amp; Go EasyPort Mount, Adhesive Mounting Disk, USB Cable, Cigarette Lighter Adaptor, Documentation Pack", "title": "TomTom ONE 140-S 3.5-Inch Portable GPS Navigator", "price": 79.9, "imUrl": "http://ecx.images-amazon.com/images/I/51eu%2BoE3IqL._SX300_.jpg", "related": {"also_viewed": ["B0014GXCBI", "B001H9NR2Q", "B004W1GQ92", "B000H866BM", "B001LK6XHM", "B001H9O72K", "B001VEJEGK", "B003B3P2C4", "B000U9WVW6", "B004MYFTE2", "B004MYFTFG", "B004MYFTEW", "B003FSTAGY", "B007M52QR6", "B000P3ZPC0", "B007M52QEE", "B007M4Z6FG", "B004J4VYG2", "B000PCBVA6", "B004MYFTF6", "B0021L9C0A", "B002VK2R5I", "B000FW7UH4", "B007M4Z60Q", "B0057ODG6Y", "B0057ODOCA", "B002OL2NT4", "B003EG0200", "B003FSTAFK", "B00AJXMWP4", "B007M52EXM", "B00172RI2I", "B0016ORQDI", "B00016HXYE", "B004QD2RLM", "B001VEJEGA", "B003B3P2BK", "B007M4Z7GO", "B003FSTAHI", "B004MYFTFQ", "B00BIZ0EY8", "B004FWOECY", "B0015F1L7A", "B003CYKDQ2", "B008BL2JOA", "B00I9UKRZ6", "B0088CLUVK", "B001H9O71Q", "B003BEDTBE", "B00BHABL1O", "B004MYFTEC"], "bought_together": ["B00172RI2I"], "buy_after_viewing": ["B0057ODG6Y", "B0037BVSCI", "B007M4Z7GO", "B00AXZWG8Q"]}, "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]]}