{"asin": "B0056KEPVO", "description": "- NewAltura Photo Lens Cap Keeper Holder- Easy to use: The small adhesive button sticks onto the front of your lens cap. The elastic loop on the other end expands to fit around the barrel of your lens. The lens cap will remain attached, hanging from your lens.- Lightweight and durable.- Works with all types of lens caps; center-pinch and snap-on.- Purchase one for all your lens caps and never lose a cap again!- PremiumMagicFiber Microfiber Cleaning Cloth- Ultra gentle! Extremely fine microfiber leaves zero scratches, streaks or marks. Safe for all lenses.- Features special saw tooth pattern edges. Other sellers' cloths have unfinished edges that will fray easily, the weave becoming undone and threads pulling out easily. Our microfibers are made with premium materials and designed to the highest standard of quality.- Ideal for cleaning oil and dirt off eyeglasses, iPhone/iPad and other touch screens, binocular lenses, digital SLR and other camera lenses, GPS devices, and other delicate optics.- Clean without the need of soaps or detergents. Wipe down kids' toys, cribs, stainless steel counters and other areas you want to keep chemical free.- Great value for your money. Reusable and long lasting. No more paper towel and tissue waste.- Extremely handy! Keep one in your office, home office, laptop bag, camera bag and car.- Size: 6 x 7 inches (15cm x 18cm)- Each microfiber is individually and neatly packed in it's own polyurethane plastic bag for long term safekeeping.", "title": "Altura Photo Lens Cap Keeper Holder + Premium MagicFiber Cleaning Cloth", "price": 3.99, "imUrl": "http://ecx.images-amazon.com/images/I/41rxROXykpL._SY300_.jpg", "related": {"also_bought": ["B0048IW030", "B00006I5J7", "B005SN72AA", "B0057081DQ", "B0078IL6K0", "B004B76430", "B00449T9D2", "B008LRC4MQ", "B0080JH3YE", "B002CGSYNU", "B00CV9MLLO", "B00BW6LZ5K", "B0096SZNPE", "B005K8AUE8", "B00A6MMOY2", "B002HINLN6", "B00AO7DC9K", "B00AY7ZRS4", "B00004ZCJJ", "B00009MK5M", "B00009R9A1", "B008B48AAE", "B0012M1LEE", "B00004ZCJI", "B0000BZL47", "B007G5NNOW", "B00795A63A", "B0056KENXO", "B00D6S126E", "B00A9YWAIM", "B00F5JV4NS", "B00006I5JC", "B00DMFWMME", "B00603S0A8", "B005OUQXD4", "B00006JN3G", "B004JMZPJG", "B005KK41UA", "B003L1ZYZ6", "B004N1Z01Q", "B00906D9YE", "B0062W02C6", "B00004ZCJG", "B00028A1Z4", "B0069R7FFQ", "B000ANCPNM", "B002VPE1WK", "B007M54E08", "B007M54E1M"], "bought_together": ["B00006I5J7", "B0080JH3YE"], "buy_after_viewing": ["B00CCKE4J4", "B0048IW030", "B000NHZSHK", "B0080JH3YE"]}, "categories": [["Electronics", "Camera & Photo", "Accessories", "Lens Accessories", "Lens Caps"]]}