{"asin": "B0006ZJPSC", "description": "After the incredible success and acclaim ofStar Wars: Knights of the Old Republic, BioWare knew they had some serious shoes to fill. The wait is finally over! From BioWare and the Microsoft Game Studios comes the ambitious and head-turning role playing game, Jade Empire.The game's designers have crafted an entirely new and unique world inspired by ancient Chinese myths and legends. In the primeval, arcane setting of the Jade Empire, you'll train under your master's watchful gaze and learn the mystical and magical powers of ancient martial arts. You'll travel widely -- from the rugged mountains of the Land of Howling Spirits to the luxuriant gardens of the Imperial City--as you make your way on your quest. Powerful human and supernatural foes will stand in your way, but with practice you'll learn to overcome your most powerful enemies. And as you venture forth through Jade Empire, you'll be challenged with questions that will ultimately lead you to discover the darkest secrets of the world.The game begins when a series of sinister events disrupt the peaceful harmony of an isolated martial arts school. You'll be forced to confront a slew of shady characters, evil warlocks, demonic beasts, and other atrocious villains that protect the Jade Empire's deepest secrets.Jade Empire offers you the chance to become a martial arts master. You'll assume the identity of one of six different characters and begin developing your skills. Each character has a unique appearance, voice, and fighting style. As you progress in the game, you'll decide whether to adopt the ways of good or evil, and your choices will affect your reputation.Jade Empire matches the frenetic pace and fury of Hong Kong cinema. As you progress in the game, you'll upgrade your combat ability and learn new, specially tailored moves for your character. Only by mastering your moves and defeating the most powerful enemies will you earn your place as a master in the world of Jade Empire.", "price": 34.49, "imUrl": "http://ecx.images-amazon.com/images/I/61TP6BB578L._SY300_.jpg", "related": {"also_bought": ["B000067DPM", "B0001UEHP8", "B0002B90SA", "B00019HNN2", "B0007PIEAQ", "B0006I5I58", "B00009ZVHR", "B00008G75X", "B001ELWMHI", "B00006IJIS", "B0009UC68U", "B0002IZICK", "B00006LU9C", "B00008XKZM", "B00020BV0Q", "B0009351RK", "B0002SQ0BS", "B00005NZ1G", "B00065W7CS", "B00009XS68", "B00009M7Q8", "B0000AOE9K", "B00L3LQ4B4", "B000E61G4O", "B000B2YR74", "B00006JC3S", "B00008KTNW", "B0000C7GH4", "B0000A1OG8", "B00009M987", "B000W0XSZM", "B00005EBAA", "B000A0IBLK", "B004AGYHUE", "B0002CHJ2S", "B00097IA88", "B0000AI1KE", "B00005Y404", "B00KWFCU4M", "B00005NZ1K", "B0002HDSZU", "B00009ZVHU", "0761547207", "B0007PIEA6", "B00005OWBL", "B0007OGDHS", "B000095ZH0", "B0002ILSGA", "B00005V5LO", "B00009VE6E", "B0006SST9U", "B0006BK5AI", "B004JHJHCC", "B00006LELH", "B0000DJX7I", "B0007SL202", "B000ZJVDA2", "B00008V6TF", "B00KWF803C", "B00008J7NZ", "B000784XIA", "B00006C296", "B0009Z3KAI", "B00019AZAK", "B00005RCQJ", "B0016CQ0Q4", "B000BC1UZ6", "B00008G886", "B00012TIW8", "B000F2JUOK", "B000087L4G", "B0009R1TAO", "B00009YEJR", "B00006JZQZ", "B0010AYJXI", "B0000A92KZ", "B001I020CW", "B00005RCQ5", "B0000D1J1T", "B0001KUE7S", "B000AX21VI", "B0002EJ852", "B00006LEMQ", "B00020BV1A", "B0009VQANQ", "B00008H2IU", "B0044SA70M", "B00129I75I", "B001IK1BJ0", "B00019AZA0", "B000QW9D14", "B00008XKZH", "B000HCQK0A", "B00DBCAT3W", "B000K9OP2A", "B00006409Z", "B000WCN7G0", "B000AMKYV8", "B000093NQN", "B000641ZCM"], "bought_together": ["B000067DPM", "B0002B90SA"], "buy_after_viewing": ["B0007P8FN2", "B000067DPM", "B0001UEHP8", "B001ELWMHI"]}, "salesRank": {"Video Games": 6449}, "categories": [["Video Games", "More Systems", "Xbox", "Games"]]}