{"asin": "B003FMUP32", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]], "description": "Designed for active listeners who desire a seamless mix of fashion and function, the MuzxDNA XY earphones keep you comfortable so you can stay plugged in to your music for as long as you wish. Featuring a low-profile, round-the-head wearing style, the XY earphones offer a secure fit--even during an intense workout. The earphones provide clean highs and serious bass for a well-balanced, natural sound--all at a very affordable price. Part of the innovative MuzxDNA line, and specially designed for an active lifestyle, the XY earphones are a true must-have for any music lover.MuzxDNA XYAt a glance:Fashionable, comfortable design for serious music lovers9 mm drivers for full-range, balanced soundRound-the-head wearing style for active listenersSnugFit design shuts out external noiseiPod and iPhone compatibleNeckband wearing style gives you full motion freedom.View larger.iPod and iPhone CompatibleMuzxDNA XY earphones are made for hardcore music lovers--the ones who see their favorite songs as extensions of themselves, and an expression of their individuality. The earphones are engineered for superior sound so you can get the best performance out of your iPod, iPhone, or portable MP3 player.Full-Range, Balanced SoundFeaturing nine-millimeter drivers for full-range, balanced sound, the XY earphones deliver superb sound quality. And the compact, comfortable earbuds shut out external noise so you can enjoy a truly immersive audio experience.Ultimate Sound Guarantee:We're passionately proud of our sound! If you do not feel these are the best sounding earphones for the price, simply return them within 30 days from time of purchase.*Extended Comfort for an Active LifestyleIn addition to excellent sound quality, the XY earphones offer amazing all-day comfort whether you're going for a run, practicing Yoga, or lifting weights. The innovative design features a low-profile, round-the-head wearing style that gives you freedom of motion. An innovative Active Ball pivot joint on one ear connects to a second earpiece behind the head so you can move unrestricted. And with ample cable length and a sliding cable adjuster, you can quickly and easily plug into your favorite tunes or multimedia on the go.Even better, the earphones come with three sizes (small, medium, and large) of silicone ear tips so you can find the optimum fit.About Altec Lansing: 70 Years of Audio InnovationFor more than 70 years Altec Lansing has been shaping the history of sound delivery and is viewed by many to be one of the world's most innovative and valuable audio brands. The company boasts a unique history of invention that includes the introduction of the first \"talkie\" film speakers, the first set of desktop computer speakers, the first iPod docking station, and the first \"Works with iPhone\" speaker system. Altec Lansing LLC is headquartered in Milford, PA.* Offer good only for sales in the United States. For more information, go to www.alteclansing.com/ultimatesoundguarantee.What's in the BoxOne pair of MuzxDNA XY earphones and six-piece fit kit with silicone tips (SM, MD, LG).", "title": "Altec Lansing MZX126W XY Headphones", "price": 9.72, "imUrl": "http://ecx.images-amazon.com/images/I/41Cc1bqJGyL._SY300_.jpg", "brand": "Altec Lansing", "related": {"also_viewed": ["B003FMUP3W", "B00518DE2W", "B001GUNJPG", "B003FMUP2S", "B003FMUP3M", "B004H1VKJ8", "B00518DEN6", "B00945906M", "B006Z01UAI", "B005AFP1AY", "B001GUVBJC", "B0094A09F8", "B00510ERKI", "B003FMUP2I", "B00A7WA7A4", "B001TDKP9I", "B006Z01V0W", "B004I73NUU", "B009WX8ARQ", "B001EZUQ5E", "B00I053NQ0", "B0078JSDCS", "B0078JSD1E", "B001W2GAAY", "B002AWZC7W", "B00BBDL3W4", "B008Y5GHCI", "B006K556QM", "B001TK3ACK", "B000IG66VS", "B001GS8G0G", "B00I053MU2", "B007U66T66", "B00G0J7LXY", "B0043ZWJHU", "B007CTNZW2", "B0069HW3GW", "B004PEIG12", "B000Y8Y8FG", "B005Q22MI0", "B003EM8008", "B00DDPZ5N6", "B00DIGAFBW", "B004OBZ2XQ", "B004ROGUNG", "B004S60G24", "B00FPFG4DC", "B005VEZ4KQ", "B004PEIG76", "B001GUPEMW", "B003VNKKS0", "B004ROGUMC", "B005DOOJ1E", "B004ROGUN6", "B003CP0KCS", "B006Y3IDX8", "B00AJHCJ2Q"], "bought_together": ["B003EM8008"], "buy_after_viewing": ["B003FMUP3W", "B00518DE2W", "B001GUNJPG", "B003EM8008"]}}