{"asin": "B002FB7IX4", "description": "Klipsch Image S2:  Concert-Quality Sound Without the Concert PriceCheaper than a standard concert ticket, Image S2 in ear headphones let you go \"live on stage\" with your favorite artists anytime, anywhere. Plus, they&rsquo;re so comfortable you&rsquo;ll never get tired of wearing them.Precise, comfortable fit for long-term wearSuperior noise-isolating designDelivers smooth sound with great bassDurable, built-in strain reliefWorks with iPod, iPhone and other MP3 devicesThese extremely affordable, sound isolating earphones go above and beyond what you&rsquo;d expect from the stock earbuds that come with your MP3 player or music phone.In fact, you&rsquo;ll find Klipsch in ear headphones are far superior to other brands&mdash;delivering unequaled comfort, noise isolation, musical accuracy and bass. Furthermore, Klipsch has managed to take its decades of research and development experience to value engineer the Image S2, while staying true to its audiophile heritage.&nbsp;&nbsp;Amazing Comfort and FitMade just for you, the Image S2&rsquo;s exclusive soft and flexible oval ear tips naturally fit the contours of your ear canals, providing comfortable long-term wear as well as producing a perfect acoustic seal. A good seal minimizes outside noise, also known as noise isolation, and allows you to enjoy your music at lower, safer volumes.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;These headphones come with three different sizes of washable ear tips: small, medium and large single flange designs. So light and narrow, they are almost impossible to feel inside your ears.&nbsp;Premium SoundAt the heart of every Klipsch product is over 60 years of audio expertise beating strong. Our commitment to no-compromise performance has made us the preferred choice of top cinema operators, a leader in stereo and home theater sound and now a premium name in headphones.The Image S2 delivers strikingly realistic sound through the use of a single, moving coil driver (or mini speaker) per channel. These drivers cover a wide frequency range with dynamic detail. From heart-pounding bass to spine-tingling guitar riffs, you won&rsquo;t miss a beat.&nbsp;&nbsp;Added FrillsAvailable in a beautiful piano black finish, the Image S2 makes quite a fashion statement. It carries a two-year warranty and works with the iPod, iPhone and other portable devices that feature a standard 3.5mm headphone jack. A cloth &ldquo;Snap tite&rdquo; carrying pouch is also included in the purchase.Helpful HintsHow do I know if I have a good seal?When no music is playing, your voice should sound louder and ambient noise should sound quieter, very similar to wearing a pair of ear plugs. Creating a tighter seal is simple. Insert the ear tip (while connected to the nozzle) into the ear canal, gently rotate it left and right and then slightly pull it back. This adjustment eliminates virtually all external noise so you can play your music at a lower volume, for a longer period of time, without experiencing ear fatigue.Why am I not getting enough bass response?It&rsquo;s probably because you don&rsquo;t have a good ear seal. Be sure to try out the various ear tip sizes. You may also want to try pulling the ear tip out slightly, as it may have collapsed.Why are Image ear gels oval-shaped instead of round?When Klipsch started studying three-dimensional ear impressions, it was discovered that nearly everyone has an oval-shaped ear canal. The company couldn&rsquo;t believe that no one else had yet considered the anatomical shape of the ear canal when designing in-ear headphones. Aside from their comfort value, our oval ear tips load quickly and easily into the ear canalsas well as virtually disappear from view.", "title": "Klipsch Image S2 Comfort-Fit Noise-Isolating Earphones (Discontinued by Manufacturer)", "price": 34.34, "imUrl": "http://ecx.images-amazon.com/images/I/41uczlmTLvL._SX300_.jpg", "related": {"also_bought": ["B007RM0X38", "B0043M9ATI", "B00304AADU", "B0044TXDSE", "B000WAHFBK"], "buy_after_viewing": ["B0043M9ATI", "B008X9Q0JK", "B008X8HZZO", "B0044TVYWG"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]]}