{"asin": "B002BRZ744", "description": "The next installment in the popularLost Planetaction series,Lost Planet 2is a third-person shooter which continues the story of humanity's futuristic struggles and attempts at colonization on the planet E.D.N III. A blend of new RPG elements and features that made the original game a huge success, including massive boss battles against the alien Akrid creatures, rugged terrain, mech warfare and dynamic multiplayer support,Lost Planet 2is sure to please both new and longtime fans of the franchise alike..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }A huge weapons arsenal.View larger.Massive Akrid bosses.View larger.New Vital Suit warfare.View larger.Co-op with split-screen functionality.View larger.StoryLost Planet 2, offers deeper insight into the world of E.D.N III, the fictional NEVEC (Neo-Venus Construction) Corporation's attempt to control the flow of Thermal Energy (T-ENG), that is the key to survival on the harsh planet, and the uncertain fate of mankind as they battle the huge insect creatures known as Akrid. A decade has passed since the events of the first game, and the face of E.D.N. III has changed dramatically. Terraforming efforts have been successful and the ice has begun to melt, giving way to lush tropical jungles and harsh unforgiving deserts. Players will enter this new environment and follow the exploits of their own customized snow pirate on their quest to seize control of the changing planet.GameplayLost Planet 2, like the original game in the series, is a third-person shooter featuring huge boss battles, challenging terrain and the ability to pop in and out of battle mechs, known in-game as Vital Suits. The primary difference in gameplay this time around hinges on the inclusion of RPG gameplay elements. Players can now customize many of the aspects of their playable snow pirate, including his physical attributes, clothing and to a certain extent, weaponry and gestures. Players will control these customized heroes across 6 interconnected episodes, creating a truly unique and interactive experience that changes depending upon the actions of the players involved. With this concept, players will have the opportunity to engage in the story in a much more dynamic way as plot threads evolve from different players' perspectives.MultiplayerBeyond the deep single player mode,Lost Planet 2is loaded with extensive multiplayer modes and play options. This includes 16-player online versus action, as well as a 4-player online co-op support and two-player split-screen functionality in local co-op play. In addition, the intense and action packed campaign mode allows for 4-player online co-op play to clear mission objectives with friends, unlockable weapons and the ability to resurrect fallen comrades.Weaponry and GadgetsNo action game would be complete without an arsenal of weaponry, and to that endLost Planet 2comes loaded with a huge variety of hardware for players to unleash on unsuspecting enemies. Machine guns, shotguns, rocket launchers, lasers, sniper rifles, grenades and a host of other weapons are scattered across the game. However,Lost Planet 2's biggest weapons come on two legs: the heavily armed and armored robotic Vital Suits return in greater numbers and variety than the first game. There are Vital Suits that transform into other vehicles, and even some that hold up to three players and take multiple players to operate. Also, the grappling hooks that made the gameplay inLost Planeta true 3D experience are back, allowing gamers to gain tactical advantage by quickly scaling buildings.Key Features4-player Co-op Action- Team up to battle the giant Akrid in explosive 4-player cooperative play. Teamwork is the player's key to victory as team members are dependent on each other to succeed and survive.Split-screen Functionality- Share yourLost Planet 2adventure with a friend locally with split-screen co-op play.RPG Elements- In addition to RPG elements like character customization, and experience points, the single player game evolves based on players decisions and actions.Deep Level of Character Customization- Players will have hundreds of different ways to customize their look to truly help them define their character on the battlefield both online and offline. Certain weapons can also be customized to suit individual player style.Beautiful Massive Environments- Capcom's advanced graphics engine, MT Framework 2.0 brings the game to life with the next step in 3D fidelity and performance.Massive Scale of Enemies- Players skill on the battlefield and work as a team will be tested like never before against the giant Akrid. Players will utilize teamwork tactics, new weapons and a variety of vital suits (VS) to fight these larger-than-life bosses.Rewards System- Players will receive rewards for assisting teammates and contributing to the team's success.Multiplayer Action- Multiplayer modes and online ranking system via PlayStation Network.Exciting New Vital Suit Features- Based on fan feedback, theLost Planet 2team has implemented an unbelievable variety of Vital Suits and new ways to combat VSs. The new VS system will have a powerful impact on the way the player takes to the war zone inLost Planet 2.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/61Gbr9JWw3L._SY300_.jpg", "related": {"also_bought": ["B00104KCF8", "B007UM599S", "B00170823O", "B005185SDA", "B003P9FRGA", "B0050SX2MK", "B003S2MXQG", "B004EW948E", "B002BXJ9VA", "B002BRZ6UE", "B001UWGCW2", "B0050SXGU8", "B000K9OR4Q", "B002DC8GKO", "B0043QQNXK", "B00309XHD0", "B00576U7W8", "B00354NANC", "B003H0CBYS", "B004ML44Y6", "B000NGP1R8", "B003GT8IL0", "B003FBL85M", "B000X1TC0U", "B008XMSR6G", "B00320J6W8", "B0050SWUTQ", "B000R3CIV4", "B003O6E67A", "B00319DX4M", "B0050SXEM8", "B0014UGK8G", "B001D7T2VC", "B003O6G1L4", "B0012N3T3Y", "B0021TVYCG", "B00320JAWY", "B000RHZ9G6", "B001C4DKG4", "B0056WJA6M", "B004UDB9SA", "B0037LVW9M", "B0050SXZ7W", "B0022TNO7I", "B003O6HE0Q", "B0047TLIBU", "B004FUI84G", "B0050SXLQC", "B002Z7BE24", "B002I0K6DG", "B00B59L9T6", "B00109KMQC", "B00163LW7K", "B002I0K5NC", "B000ZK695U", "B000JLIXIG", "B0050SWZHS", "B002EE1P2W", "B005THAX6K", "B001TOMQOY", "B009JBFF9C", "B000KLNLUK", "B0044SA734", "B000WJFZEA", "B0029MAXR2", "B0016GC9D8", "B000ZK7ZOY", "B001YHX4B0", "B002ZJNWWC", "B008PQU3E4", "B004WL4LOY", "B006Y76HXM", "B0081B1O5A", "B001CBW18U", "B004EDJOYC", "B005DVAB0A", "B001NX6GBK", "B00B59MXGY", "B004L5SJ58", "B0056WJA6C", "B000SQ5LQE", "B000HWX418", "B0023CBZ70", "B002I0J6KU", "B000P297EI", "B003O680ZY", "B003PHLT8W", "B004FS8LYK", "B002I0J6DC", "B005GM3XVA", "B003O6ECOM", "B004NRN5EO", "B002I0J8FI", "B000V1OUVI", "B003DNLDUC", "B005C2D1YI", "B003O6KWZK", "B004LWEK7C", "B000WS97QI", "B000HKMPVA"], "bought_together": ["B00104KCF8", "B007UM599S"], "buy_after_viewing": ["B007UM599S", "B005185SDA", "B00BMFIXKQ", "B005C2D1YI"]}, "salesRank": {"Video Games": 5705}, "categories": [["Video Games", "PlayStation 3", "Games"]]}