{"asin": "B001TCJI7E", "description": "From the ManufacturerManufacturer's Description (June 10, 2009)Enjoy your favorite movies on the road with the DVP-FX930 portable DVD player. Boasting a large 9-inch, high-resolution widescreen display and up to six hours of battery life, this portable device is ideal for long flights and car rides. Conveniently located touch keys and a 180-degree swivel and flip screen make it a breeze to operate and watch your favorite flicks. And when you want more than movies, this portable DVD player lets you view your personal photo albums and plays your CDs or MP3s. You can even share audio and video with a friend via two built-in headphone jacks. The FX930 is available in black, blue, red, pink and white.A full-featured portable DVD player that's perfect for long flights and car rides.Click to enlarge.9-Inch, High-Resolution, Widescreen MonitorEnjoy entertainment on the go with the Sony DVP-FX930 portable DVD player, featuring a nine-inch, high-resolution screen (800 x 480 resolution) and widescreen display.6-Hour Rechargeable BatteryWith up to six hours of battery life, the Sony DVP-FX930 portable DVD player lets you watch approximately three full-length movies before having to recharge.180 Swivel and Flip MonitorA convenient180-degree swivel and flip screen allows you to watch your DVDs from almost any angle.Touch Keys on Bezel for Easy OperationEasy-to-access touch keys are conveniently located on the frame surrounding the player's screen.Multiple Format Disc PlaybackView movies and photos and listen to music with multiple format playback.A convenient 180-degree swivel and flip screen allows you to watch your DVDs from almost any angle.Click to enlarge.Ultra-portable at under two pounds.Click to enlarge.Available in Five ColorsThe DVP-FX930 series comes in five colors to complement the player's stylish design. Choose classic black or select a stunning blue, red, pink, or white player.Two Built-In Headphone JacksShare your entertainment with friends and family with two built-in headphone jacks.Dual Sensors for Enhanced Remote Control UseDual sensors on the player let you operate the remote control from various angles.Car Adaptor IncludedIncluded car adaptor helps make sure your DVD player is always ready to go no matter how long the road trip.Disc ResumeWith disc resume, you can boot up a DVD where you left off.A/V Input and OutputPlug the DVP-FX930 into your TV using the A/V output and it instantly becomes a standard DVD player.12-bit/108MHz Video DACEnjoy a pristine picture every time you play a DVD with 12-bit/108MHz Video DAC (Digital to Analog Conversion). The DAC technology minimizes digital artifacts and fine picture gradation for an image that's closer to the original source.What's in the BoxSony DVP-FX930 9\" Portable DVD Player (Black), Remote Control (RMT-D191), Rechargeable Battery Pack, AC Adaptor (AC-FX160), Car Battery Charger (DCC-FX160), Owners Manual, A/V Cable", "title": "Sony DVP-FX930 9-Inch Portable DVD Player, Black", "price": 449.99, "imUrl": "http://ecx.images-amazon.com/images/I/41XAuM6xiqL._SX300_.jpg", "related": {"also_bought": ["B0058AFS0O", "B000RECQOM", "B000F7VKL6", "B000MUXVZO", "B002AR62NA", "B000FML9NA", "B002AR1M4Y"], "bought_together": ["B0058AFS0O"], "buy_after_viewing": ["B007F9XHCM", "B008S08HJ0", "B003CY0SR6", "B003CHMCXG"]}, "categories": [["Electronics", "Portable Audio & Video", "Portable DVD Players"]]}