{"asin": "B001WAKSCW", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Compact System Cameras"]], "description": "The new Panasonic DMC-GH1 is called a Creative HD Hybrid because it records not only high-quality photos but also high definition 1080/24p or smooth 720/60p HD (High Definition) movies in AVCHD format. Continuous AF can be used while recording movies, to further boost operating ease.Taking advantage of its system camera design, the DMC-GH1 features the potential for unlimited photo expression by allowing the use of different lenses for specific shooting situations and subjects. High-quality sound recording with Dolby Digital Stereo Creator and a host of other creative options, including manual settings, giving the DMC-GH1 even greater versatility.Supporting the DMC-GH1's powerful full-HD movie recording function is a newly developed 12.1-megapixel high-speed Live MOS sensor and the Venus Engine HD image processor, which features two CPUs for outstanding processing capability. The new LUMIX G VARIO HD 14-140mm/F4.0-5.8 ASPH./MEGA O.I.S., which is a versatile 10x zoom interchangeable lens, was designed for movie recording by including a silent and continuous auto focusing function and seamless aperture adjustment.The DMC-GH1 also features D-SLR photo quality. Its newly developed Live MOS sensor renders images with minimal noise even when using high ISO sensitivity. The multi-aspect ratio function of the sensor allows photos to be taken using a 4:3, 3:2 or 16:9 aspect ratio, all with the same angle of view.In addition to its high levels of performance for both photos and movies, the DMC-GH1 incorporates the iA (Intelligent Auto) mode, a hallmark of LUMIX cameras that now includes Face Recognition, a function that \"remembers\" faces once the faces are registered.When a familiar face appears in the frame, the camera will prioritize the focus and exposure to capture it beautifully. This clever function makes it easy to get sharp and clear photos of special subjects in a group of people. iA mode is also available in movie recording. It automatically selects the most suitable scene mode and helps to correct hand-shake, focus and brightness problems -- making it a one-stop solution for capturing beautiful photos and movies.Operating ease is an important element of the LUMIX G Micro System identity, and it is highly evident in the DMC-GH1. For example, the clever design of the DMC-GH1 helps to prevent missed shooting opportunities for both photo and movie recording. To start recording a movie during shooting photos, the user simply presses a special, one-touch movie recording button. Most of the settings used for photo shooting carry over to movie recording without requiring any additional setting.Panasonic Lumix GH1 HighlightsTechnological advantages for 1080/24p full-HD movie recording in the AVCHD formatThe LUMIX DMC-GH1 is an advanced photographic tool for recording not only great photos but also beautiful full-HD movies. In addition to Motion JPEG images, the DMC-GH1 can record high-resolution full-HD 1920 x 1080 movies at 24 fps (frames per second) or smooth HD 1280 x 720 movies at 60 fps in AVCHD (MPEG-4/H.264) format.The AVCHD format can record almost twice the footage in HD quality than the conventional Motion JPEG, using the same SD card. A special, separate button on the back lets the user instantly start recording movies while shooting photos without any having to make any extra settings. There are always two options to record spur-of-the-moment scenes -- high-quality photos or movies. The user can simply choose the one that saves precious memories most beautifully.The LUMIX G VARIO HD 14-140mm/F4.0-5.8 ASPH./MEGA O.I.S. kit lens boasts a focal length of 28-280mm (35mm camera equivalent) and supports the continuous AF function of the contrast AF system for both photos and movies. Panasonic considers this function to be indispensable for movie recording from a practical point of view. This lens is also designed for movie recording use by minimizing the mechanical sound generated by the continuous AF/AE action.The newly developed 12.1-megapixel 4/3-type Live MOS sensor is capable of high-speed 4-channel readout to support full-HD movie recording. This sensor is also advantageous for photo recording with a high signal to noise ratio thanks to a new circuit structure that is totally unaffected by the noise generated in each of the circuits. It results in clear pictures even when taken at high ISO sensitivity. The sensor also allows images to be taken at three aspect ratios--4:3, 3:2 and 16:9--with same angle of view.The LUMIX DMC-GH1 also features the Venus Engine HD image processor. The two CPUs in this imaging engine dramatically speed up processing while achieving exceptional noise reduction performance. The Venus Engine HD's excellent energy efficiency supports long-time AVCHD movie recording, and allows the output of both images and sounds via HDMI.In addition to recording HD movies--a host of options enhance creativityThe LUMIX DMC-GH1 concept goes much further than simply recording HD movies. Apart from the movie recording capability of conventional digital cameras, the DMC-GH1 also features a Creative Movie mode, which lets the user set the shutter speed and aperture manually to make even more impressive movies.Changing the shutter speed brings special effects to movies, which is especially suitable for shooting fast-moving subject. The ability to control the aperture is convenient when there are several subjects at different distances and it is desired to have each of them stand out. Creative Movie mode gives the user a wider range of expressive possibilities to explore.The movies also come with the high-quality stereo sound of Dolby Digital Stereo Creator, the global standard for superior audio recording. For more creative sound recording, an optional stereo microphone (DMW-MS1) is available. A Wind Cut function blocks out most of the noise from background wind even on breezy days.iA (Intelligent Auto) mode operates for both photos and moviesWhile featuring a host of creative options to enhance both photo and movie recording, the LUMIX DMC-GH1 also includes the iA (Intelligent Auto) mode that Panasonic developed to give LUMIX cameras the ultimate in operating ease and to reduce shooting mistakes. In iA mode the camera does all the work, leaving the user free to compose shots and capture the moment. All the user has to do is aim and shoot even in situations that normally require complicated settings.For photo shooting, the DMC-GH1 further advances this mode with the inclusion of Face Recognition, an advanced Face Detection function that recognizes faces that the user has registered prior to shooting. Once a face is registered, this function will recognize it whenever it appears in the frame. The camera will then display the name that was specified for the person and prioritize the focus and exposure so that the registered face is bright and in sharp focus.In addition to the advanced functions mentioned above, the iA mode inherits the fundamental functions that users need in a good digital still camera. These include MEGA O.I.S., which helps prevent blurring from hand-shake, and Intelligent ISO Control, which reduces motion blur by adjusting the ISO sensitivity if the subject moves as the shot is taken. AF Tracking is also available, which lets the DMC-GH1 lock onto any subject and keep it in focus even if it moves - making it easy to get beautiful, clear shots when a great photo opportunity suddenly arises.Intelligent Exposure optimizes the exposure for each part of an image, preventing blocked shadows and blown highlights and helping ensure that gradation and details are reproduced beautifully. Intelligent Scene Selector automatically detects the five most common shooting situations -- Portrait, Night Portrait, Scenery, Night Scenery and Close-up and switches to the appropriate Scene mode.The LUMIX DMC-GH1 now makes the popular iA mode available for movie recording. The Optical Image Stabilizer (O.I.S.) helps prevent blurring from hand-shake when using the high-powered zoom. Face Detection automatically detects a face in the frame and adjusts the focus, exposure, contrast, and skin complexion to record it beautifully.Intelligent Exposure continually checks the ambient light level and adjusts the exposure setting as conditions change, to prevent blown highlights and blocked shadows. Intelligent Scene Selector automatically switches between Normal, Portrait, Close-up, Scenery, and Low Light modes according to the situation to optimize visual quality.The LUMIX G Micro System identityWith the LUMIX DMC-GH1, Panasonic has developed an entirely new concept in digital cameras that comply with the Micro Four Thirds System standard by taking even greater advantage of the compactness and light weight that are made possible by eliminating the mirror box. By increasing the number of electrical contacts between the camera body and the lens, the camera's expandability is also dramatically increased to maximize future potential.The LUMIX G Micro System&rsquo;s 1,440,000-dot equivalent Live View Finder retains the outstanding viewability of an optical viewfinder and can also display information about camera settings that the user can see without taking his or her eye from the subject. A clever built-in eye sensor automatically switches on the viewfinder when the user looks into it, then switches it off and turns on the free-angle 3.0-inch large 460,000-dot high-resolution LCD (which boasts a wide viewing angle) when the user looks away from the viewfinder.The 60-frames-per-second Live View is made possible by the Live MOS sensor, which takes signals directly from the image sensor and sends them continuously to the LCD, in real time. Both the Live View Finder and LCD provide a 100% field of view. This allows the user, when composing a shot, to check the framing accurately from corner to corner.The contrast AF system adopted by the LUMIX DMC-GH1 is not only accurate and easy to use, but also very fast. Users can choose from a wide range of AF modes, including multiple-area AF with up to 23 focus areas, 1-area AF with a selectable focus area, Face Detection, and AF Tracking.To deal with dust and other foreign matter entering the body when changing lenses, a Supersonic Wave Filter is built in as part of a Dust Reduction System designed to prevent matter from adhering to the image sensor.Other options to enhance the fun of photographyThe wide range of options available for the LUMIX DMC-GH1 let users customise and personalise their camera. An option for photo shooting lets the DMC-GH1 reproduce a square image with a 1:1 aspect ratio in addition to the 4:3, 3:2 and 16:9 multi-aspect ratios.My Color mode, which was popular in the DMC-G1, is a special option that gives free reign to the user's creativity. In My Colour mode, the colour, brightness and saturation parameters can be freely adjusted while checking the Full-time Live View image to see how the adjustments affect the picture.This makes it easier and more fun to create interesting, expressive images. The user can adjust the settings that best suit the shooting conditions and his or her expressive intent, for greater photographic control.The DMC-GH1 also offers a Playback mode that allows the user to play 'only still images,' 'only motion images,' or 'both'. When choosing to play 'only motion images,' it is even possible to play AVCHD and Motion JPEG videos separately.Photos and movies can also be played back together with an attractive seamless effect and background music in the LUMIX DMC-GH1's new Slideshow mode that takes advantage of its large, high-resolution LCD. Using an optional mini HDMI cable, slideshows can be shared in stunning HD video and audio quality on an HDTV with family and friends.HD photos and HD movies with VIERA Link networkingBoth still images and AVCHD-format motion images recorded on SD Memory Cards are easy to view on a Panasonic VIERA TV with dynamic full-HD resolution. The user simply inserts the card into the VIERA Image Viewer (SDHC/SD card slot) on a VIERA TV or DIGA Blu-ray Disc Player to play the content.Alternatively, an optional mini HDMI cable can be used to output still and motion images recorded with the LUMIX DMC-GH1 directly to the TV for easy VIERA Link operation. This makes it possible to take maximum advantage of the camera's playback functions, including slideshows in which both still and motion images are played sequentially, or calendar displays and so on. Operation using only TV&rsquo;s remote controller is super-easy.Rich options for expandabilityIn addition to LUMIX G lenses, the LUMIX DMC-GH1 and LUMIX G Micro System can use any interchangeable lens that complies with the Four Thirds standard via an optional mount adapter. This gives the user access to the entire range of Four Thirds lenses. And a stream of new Micro Four Thirds lenses will be announced in the future, providing a large, diverse line of high-performance lenses for the user's photographic toolbox. With the LUMIX G Micro System and the growing assortment of lenses becoming available, the expressive possibilities are unlimited.", "title": "Panasonic DMC-GH1K 12.1MP Four Thirds Interchangeable Lens Camera with 1080p HD Video", "price": 17.12, "salesRank": {"Camera &amp; Photo": 11295}, "imUrl": "http://ecx.images-amazon.com/images/I/41iZ8UAwujL._SX300_.jpg", "related": {"also_viewed": ["B0028Y5GLO", "B00404D39M", "B003AOAXL4", "B0043VE27Y", "B0043VE26U", "B0043VE31O", "B001FSKDWG", "B009B0WREM", "B004A8ZQIO", "B002MUAEX4", "B00CFCTDD6", "B005058BTW", "B00I9GYG8O", "B005058B60", "B004A8ZQJS", "B00604YTFM", "B003WJR68U", "B001ET5U92", "B008MB71IS", "B001FSKDWQ", "B0056ENTVC", "B008MD3RNY", "B00843ERMW", "B002IKLJV4", "B00FY42JYW", "B001BJDX7Q", "B0054YVA8S", "B001G5ZTLS", "B002IKLJVE", "B009SGB3KS", "B00C97ZZ4S", "B002EGDFD2", "B002NEGTTW", "B0043RS864", "B00CFCTH14", "B003MAKXMA", "B00836H2BI", "B005OGR3DM", "B0035FZJHQ", "B003WJR694", "B001CCLBSA", "B00GD796N6", "B007R7DTRK", "B00HPQ0A16", "B0043VE28I", "B00HPQ09NA", "B0074WDEY6", "B00E87OITK", "B0035LBRJO", "B00AQNRXDS", "B009SGB3KI", "B0035FZJI0", "B00EPWC2WI"], "buy_after_viewing": ["B003VNKNF0", "B0028Y5GLO", "B00404D39M", "B007LTH1X2"]}}