{"asin": "B00126T6HO", "categories": [["Electronics", "Computers & Accessories", "Routers"]], "description": "Amazon.com Product Description.caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The NETGEAR RangeMax Wireless-N Gigabit Router WNR3500 offers:4-port Gigabit switch for blazing fast wired network performance.Automatic Quality of Service (QoS) ensures reliable Internet, voice, video, and gaming applications.8 internal antennas for maximum coverage and range.The NETGEAR RangeMax Wireless-N Gigabit Router WNR3500 lets you easily set up a blazing fast network with both wired and wireless connections. Everyone in your home or office can share a single Internet connection, and connect to their network, at speeds up to 1000 Mbps wired, and 300 Mbps wireless, letting you stream music, video, make Internet phone calls, video conference, and surf the web -- all at the same time.The WNR3500 has a Gigabit Ethernet backbone for maximum speeds.View larger.Easy SetupThe WNR3500 makes it easy for even a novice to set up a wireless network: just plug the included Ethernet cable from your LAN into the device and insert the included CD into any computer on the network. The Smart Wizard will lead you through easy step-by-step instructions, and will automatically detect and configure your router for virtually all ISP connections. A stand is included for vertical placement options.The WNR3500 employs a web-based interface for configuration for compatibility with any computer with a web browser. Setup is secure using Wi-Fi Protected Setup (WPS), and the \"Push 'N' Connect\" eliminates the need to remember or input security password keys.New Technology Means Blazing Speeds and Backwards CompatibilityThe WNR3500 complies with the latest Wireless-N draft specification, which allows for wireless speeds up to 300 Mbps. By utilizing patented metamaterial antenna technology, the WNR3500 offers a speed and range far surpassing the older Wireless-G standard. Eight internal antennas ensure maximum coverage and range throughout your office or home.If you still have computers that use Wireless-G or Wireless-B, don't fret--this router is backwards compatible with the older wireless standards and can be set so all your computers can connect to the network.By using Gigabit Ethernet for the backend, you'll be certain that the router is receiving data at the highest possible speeds, preventing the input from become a bottleneck. Four Gigabit RJ-45 Ethernet ports in the back allow you to have wired connections to the network that blaze along at 1000 Mbps.For users who already have a wireless network set up, the WNR3500 can be configured as a repeater for extending the range of the existing network.Security Made EasyThe WNR3500 offers many security options to ensure your data is always protected and remains private. Double firewall protection keeps your network shielded from outside attacks and also prevents Denial of Service (DoS) attacks. The WNR3500 supports WiFi Protected Access (WPA2-PSK, WPA-PSK), and 64-bit and 128-bit WEP encryption for Wireless-B/G networks. Additionally, you can set security through MAC address authentication, allowing only authorized users onto the network.The NETGEAR RangeMax Wireless-N Gigabit Router WNR3500 is backed by a 1-year warranty.What's in the BoxWNR3500 RangeMax Router, power adapter, Ethernet cable, stand, setup CD, and warranty/support information card.", "title": "NETGEAR RangeMax Premium Wireless-N Gigabit Router (WNR3500)", "price": 29.99, "salesRank": {"Electronics": 16642}, "imUrl": "http://ecx.images-amazon.com/images/I/41Y4QJiIsXL._SY300_.jpg", "related": {"also_viewed": ["B002RYYZZS", "B001UI4RTG", "B000Z3XXR4", "B007ZIFICU", "B00KFD0O9E", "B002HWRJY4", "B00895BUPC", "B00008SCFL", "B001AZP8EW", "B004UV4LOQ", "B00BRCZYO2", "B0085WN7YQ", "B0041LYY6K", "B005CKM36C", "B007CMHILS", "B008HO9DK4", "B00IJYGICI", "B0085WVQDK", "B005AOHA8G", "B0081TXJ28", "B005KG44V0", "B0098QV038", "B00E37JODK", "B0049YQVHE", "B008KRLZCW", "B007KZQM9G", "B0062KA4VM", "B002YLAUU8", "B008RV51EE", "B000LIFB7S", "B004T9RR6I", "B00D8AMKKC", "B00HEX851C", "B00HOGY5W2", "B000QD7B6W", "B004T9RR4A", "B004LA8BVU", "B00387G6R8", "B001FWYGJS", "B006QB1RPY", "B00IF0JAYE", "B0050SLU6K", "B0058NN6CS", "B00HC0ZDOE", "B00AAU54TW", "B007IL72CI", "B0040IUI46", "B00IF0JAIU", "B001F7HLRC", "B00DZJU6B6", "B00EM5UFP4", "B007ZEQFG2", "B007IL764W", "B00JFHKCT8", "B00F3ZN536", "B0081H8TRA"], "buy_after_viewing": ["B002RYYZZS", "B001UI4RTG", "B004XC6GJ0", "B0085WN7YQ"]}}