{"asin": "B007OLJDZG", "description": "Satechi Audio Cube is a compact Bluetooth stereo speaker system that combines exceptional audio performance and convenient portable design. It connects wirelessly to your smart phone, tablet, notebook, allowing you to listen to your music in high quality audio.Portable DesignBeing wireless means it's as portable as your phone. Compact unique design enables easy to carry around your home, office or outside.Dynamic Sound with 2x2 Watts Built in SpeakerStereo sound is outputted through Audio Cube's dual-channel speaker system. Each channel outputs two watts to provide optimum sound quality. Its compact enclosure contains large speakers that significantly enhance low-end bass frequencies.Bluetooth ConnectionIntegrated BluetoothTM allows you to connect your computer, smart phone, or tablet and play music wirelessly for a range of up to 32'. Audio playback can be controlled with Audio Cube's multi-function buttons: play/pause, next/previous track, and volume up/down.Built-in Audio ConnectionThe auxiliary port allows you to connect audio devices to Audio Cube with the included cable. It can also be used as an extended speaker for existing systems, such as a home audio system.USB ChargingThe built-in rechargeable lithium-ion battery is powered through the USB charging port which can be connected to a computer or a wall adapter. Audio Cube can last up to 6 hours of playback time on a full charge.What's in the BoxSatechi Audio Cube Speaker, Charging Cable, Audio Cable, User's Manual", "title": "Satechi ST-69BTS Audio Cube Portable Bluetooth Speaker System for iPhone / Android Smartphones / iPad / Tablets / Macbook / Notebooks / Samsung Galaxy / Nokia Lumia / HTC and other smartphones and tablets", "price": 39.99, "imUrl": "http://ecx.images-amazon.com/images/I/41bAhgSxvDL._SY300_.jpg", "related": {"also_bought": ["B004X71HXU", "B008FSEA0K", "B0088TAZ2S", "B005ALWKDY", "B0043WDNRI", "B0089ZV1WY"], "bought_together": ["B004X71HXU"], "buy_after_viewing": ["B00BNFPXIU", "B00GZC35YK", "B009AYLDSU", "B00D6OHHEE"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]]}