{"asin": "B000V1VG2E", "related": {"also_viewed": ["B00AWYMXZY", "B0011ZCDKS", "B0075SUIEI", "B000HATNH4", "B002LITT3S", "B000AYJDD6", "B001EQ4C8U", "B000HAOVC6", "B000V20R28", "B003ZSHNG8", "B0032JRRXE", "B004IFYWR0", "B000V1VG4W", "B0075T7NW2", "B00EFILR6E", "B000NK3H4S", "B000V1VG5G", "B006UMM1J0", "B000NK8EWI", "B0009GZSSO", "B0075SUII4", "B000EMWBV0", "B004J3YCGM", "B005II5OLY", "B0075SUIZW", "B000Q3043Y", "B002LITT3I", "B00908BQCY", "B0075SUK14", "B004HW73QG", "B00I58LVKC", "B0075SUITS", "B000HARTYI", "B0075SUIOS", "B000EMWD9U", "B004HW73S4", "B000Q30420", "B006UMM1AY", "B006UMM15O", "B000EMU888", "B009B0MZ1M", "B00EFILPHA", "B006UMM1F4", "B004HW73SO", "B005I6DVC0", "B001SER44W", "B00908BMVE", "B00BW6LTG0", "B004J3V8UU", "B0075SUK6O", "B004LB4SAM", "B00EFILHB4", "B0012YC7AE", "B008V0H284", "B00I58LZRG", "B00BOZCSQE", "B001SER4BK"], "buy_after_viewing": ["B00AWYMXZY", "B003VNKNEQ", "B003F7DWH8", "B003VNKNF0"]}, "title": "Canon PowerShot A720IS 8MP Digital Camera with 6x Optical Image Stabilized Zoom", "price": 469.98, "salesRank": {"Camera &amp; Photo": 5635}, "imUrl": "http://ecx.images-amazon.com/images/I/41DvrPURJLL._SX300_.jpg", "brand": "Canon", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Manufacturer DescriptionThe PowerShot A720 IS is the quintessential A Series camera in a popular line that matches high-end image quality with fun, easy-to-use features that deliver excellent cost performance. Top-notch specifications include 8.0-megapixel resolution and a long 6x optical zoom with Optical Image Stabilizer Technology for sharp images throughout the zoom range. Canon's DIGIC III Image Processor offers advanced Face Detection technology and Red-eye Correction for fantastic images. Even expand your creative possibilities with wide-angle and telephoto converter lenses.PowerShot A720IS Highlights8.0-megapixel resolution, high-power 6x optical zoom with Optical Image StabilizerTop-notch core specifications allow the PowerShot A720 IS to produce a level of image quality that&rsquo;s fully competitive with that of much higher-end cameras. A full 8.0 megapixels of resolution ensure rich depth and detail, and let you enlarge and crop images freely.1x zoom/6x zoomThe camera is equipped with a genuine Canon 6x optical zoom to get you up close when it counts. Canon&rsquo;s sophisticated Optical Image Stabilizer Technology keeps your shots blur-free, even in low light and at the long end of the zoom range. Miniature gyroscopic sensors detect motion, then send a corrective signal, effectively reducing camera shake.DIGIC III Image Processor with Genuine Canon Face Detection TechnologyWith DIGIC III, your images boast superior quality, the camera operates at top efficiency and battery life is enhanced. What&rsquo;s more, DIGIC III enables Canon&rsquo;s Face Detection Technology and Red-eye Correction to give you better, more true-to-life people shots. Simply press the Shutter button halfway down, and the camera automatically pinpoints the faces in the scene and chooses the ideal focus point. The camera controls exposure settings and flash to keep every face looking bright and natural. Red eyes can be corrected during playback.DIGIC III features Face Detection technologies, giving the you best possible results in any shooting situation. Face Detection AF/AE sets the focus point and exposure for the faces of your subjects. Face Detection FE adjusts the flash to correctly illuminate your subject to provide the best balance between your subject and the overall scene, eliminating the common problems of over- and underexposed faces.Face Detection in actionRed-eye correctiondetects and corrects red-eye during playback. In unusual cases where red-eye is not automatically detected, it can easily be corrected manually during playback mode.iSAPS technologyis an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the fast DIGIC III Image Processor to improve focus speed and accuracy, as well as exposure and white balance.Easy-to-use Mode Dial with a wide range of shooting modesWith a simple Mode Dial, the PowerShot A720 IS makes it easy to access the features of the camera you&rsquo;ll use most. Select a scene mode, and the camera automatically sets shooting parameters to get you the best possible shot in that situation. You can also access Stitch Assist, Auto, Movie and Manual modes from the Mode Dial. And the convenience of using AA-size batteries, no special power adapters or chargers are needed wherever you go.With 19 Shooting Modes including 7 Special Scene Modes, you&rsquo;re ready for whatever shot comes your way.Compatible with a wide range of accessories including wide-angle and telephoto lens convertersThe PowerShot A720 IS is compatible with many of shooting accessories such as wide and tele converter lenses, High-Power Flash designed for all of the PowerShot models. Also, a waterproof case is available for your underwater shooting.Print/Share button for easy direct printing and downloadingThe PowerShot A720 IS's Print/Share button makes direct printing easier than ever. Simply connect the A720 IS to a Canon CP, Selphy or Pixma Photo Printer or any PictBridge compatible photo printer, press the lighted Print/Share button and print! Also use the Print/Share button to transfer images to a computer (Windows and Macintosh).Print your own ID photos in 28 different sizes or use the Movie Print function to output multiple stills from a recorded movie on a single sheet with a Canon Selphy Compact Photo Printer.Direct photo printersFor desktop large-format printing, try one of the direct photo printers that allow you to print without a computer in one of two ways: plug your compatible PowerShot camera into the direct photo printer using the supplied USB interface cable, or simply insert a memory card into the supplied adapter. You can also connect the printer to your computer for more options. Print high-resolution, borderless images as postcards or 8.5 x 11-inch sheets within minutes.Compact photo printersCompact photo printers let you produce versatile, fun 4 x 6-inch postcards, 4 x 8-inch wide greeting cards or credit card size prints in just two easy steps: connect and press/print. Control the printer right from your camera's LCD screen. You get durable, dye-sublimated prints quickly with or without borders. Assorted paper types let you create mini or credit card size labels. You can even take select compact photo printers to a party or an outdoor picnic using an optional rechargeable battery."}