{"asin": "B001A4LVYY", "description": "Revel in astounding HD clarity with the BDP-S350 Blu-ray Disc player. The most noticeable additions to this year's model are the Ethernet port that lets you download firmware updates directly to the player, and -- with one of those firmware updates -- access web contetent encoded to Blu-ray discs via BD-Live, compatibility with the Bonus View feature of select Blu-ray movies, and a USB port that allows you to add more storage to access the growing number of special features that will be available given the immense storage capacity of Blu-ray discs themeselves. This player also outputs a Full 1080/24p True Cinema picture,&nbsp; and upscales your existing DVD collection to 1080p when using an HDMI connection. Dolby TrueHD capability delivers lossless sound that is true to the original studio master. Bringing it all together is the new icon based Xcross Media Bar, which provides simple navigation of the player's menu system.Key FeaturesTrue 1080p Output (Learn more)Dolby TrueHD compatible (Learn more)Ethernet connection for BD-Live Compatibility and firmware updates (Learn more)USB Port Allows More Storage for Access to More Special Features, Like Bonus View (Learn More)Higher Bit Rates mean less video compression (Learn more)Emmy-Award Winning Xross Media Bar Interface (Learn More)Bravia Sync for Easy Connectivity (Learn More)Learn MoreMore PictureSee Everything Your HDTV Can Show You with Full HD.6 Times the Picture Data on DVDsSee everything your HDTV can show you. Blu-ray Disc's Full HD 1080p resolution produces over 2 million pixels per frame to produce a razor-sharp picture with unmatched depth and clarity that takes full advantage of the capabilities of today's 1080p HDTVs. That's six times the picture data contained on DVDs, which are encoded at only 480p.24p True Cinema Video OutputMost of all Hollywood movies are shot at 24 frames per second, and Blu-ray Disc movies are mastered at 24 frame per second, so it is only fitting that the Sony Blu-ray Disc Players can output your films at 1080/24p for a true film-like experience at home. Of course, Sony Blu-ray Disc Players can also output at 1080/60p for more traditional HDTV sets on the market. Either way Sony has you covered for the best picture possible in Full 1080p.Backwards compatible and UpscalingAll existing Blu-ray Disc players will play your standard DVD collection without a problem. And with built-in 1080p video upscaling, they'll look even better.More BitsIn the digital world, picture quality is not just about resolution, but also about bit rates. The higher the bit rate, the more data that is processed, typically resulting in higher video quality. DVDs have a maximum video bit rate of about 10 megabits per second (Mbps). In comparison, Blu-ray Disc is capable of video bitrates up to an incredible 40 Mbps. The bottom line, higher bit rates allow for the least amount of data compression for HD video that looks closest to the original video source.More SoundThe BDP-S350 is compatible with Dolby TrueHD, Dolby&#x92;s next-generation lossless technology developed for high-definition disc-based media. Dolby TrueHD delivers tantalizing sound that is bit-for-bit identical to the studio master, unlocking the true high-definition entertainment experience on next-generation discs. When coupled with high-definition video, Dolby TrueHD offers an unprecedented home theater experience that lets you enjoy sound as stunning as the high-definition picture.Delivers enthralling studio-master-quality sound that unlocks the true high-definition entertainment experience on next-generation discs.Offers more discrete channels than ever before for impeccable surround sound.Compatible with the A/V receivers and home-theaters-in-a-box (HTIBs) of today and tomorrow.Dialogue normalization maintains the same volume level when you change to other Dolby Digital and Dolby TrueHD programming.Dynamic range control (Night mode) enables you to customize audio playback to reduce peak volume levels (no loud surprises) while experiencing all the details in the soundtrack, enabling late-night viewing of high-energy surround sound without disturbing others.Xross Media BarXross (pronouncedCross) is Sony's Technical-Emmyaward-winning graphic user interface for Sony WEGA and BRAVIA televisions and PS3 and PSX game systems. The interface features category icons spread horizontally across the screen that organize the viewing options (TV, Music, Internet, Tools, etc...). When a category icon is selected on the horizontal bar, a vertical bar appears showing the viewing options within that category. Using the directional pad on your remote, you can easily maneuver horizontally from category to category, then scroll vertically through individual viewing options to easily navigate through the wide range of programming available on today's televisions.BD-LiveBD-Live is a Blu-ray feature that enables you to access&nbsp; special content via an internet-connected Blu-ray player. Because it's not coded into the disc, BD-Live content is always updated, always fresh. With BD-Live, your Blu-ray disc is different every time you view it.Check out the latest previews,&nbsp; download special scenes, exclusive features and ringtones, and participate in online communities or games.As BD-Live continues to grow and expand, even more features will become available, customizing features and content to your location or preferences. Now, your disc kMore SpaceBlu-ray Disc has 5x more storage capacity than DVD, which allows more content to fit on the disc. The extra storage capacity also means more room for special features like inline navigation, Bonus View, interactive games, deleted scenes, director commentary and moreNavigate to special features, other scenes, or settings without leaving the content you are watching.Bonus View lets you watch special features and commentary inline without leaving the movie.x.v Color", "title": "Sony BDP-S350 1080p Blu-ray Disc Player", "price": 142.0, "imUrl": "http://ecx.images-amazon.com/images/I/21t9n3r0iDL._SX300_.jpg", "related": {"also_viewed": ["B001URWAYG", "B001FN3ZRQ", "B0036WS4CA", "B001V9LA44", "B006U1YUZE", "B005NEZDUA", "B006U1YVZ8", "B002K8Q41Y", "B006775ETW", "B004K1EOCA", "B000VSWCRK", "B00CYMJXYG", "B0091VAHIO", "B00HPMCO6O", "B00AWKC0JM", "B00HJP71YC", "B00AWKC0EC", "B009UXEOIW", "B00IHJ1LU4", "B00HPMCO4Q", "B00AWX6EYQ", "B00BQ3EGPU", "B003FW0LR2", "B00HPMCPJK", "B0038KV0BM", "B00CWDCGPA", "B00LBENEFM", "B001GAOYCS", "B004LNFJCQ", "B001A5NGZU", "B00752R4Y6", "B001NTV6A0", "B009AHQ8C8", "B004N85YBA", "B00HPMCO14", "B00EUY59Z8", "B00B9JR5H2", "B004T6VT74", "B00FF9SVWA", "B00IJH4J4Y"], "buy_after_viewing": ["B00AWKC0JM", "B00EUY59Z8", "B00EUY59Z8", "B003L1ZYYM", "B00AWKC0EC"]}, "categories": [["Electronics", "Television & Video", "Blu-ray Players & Recorders", "Blu-ray Players"]]}