{"asin": "B000VIT0G6", "categories": [["Electronics", "Computers & Accessories", "Routers"]], "description": "The 300Mbps Wireless N Gigabit Gaming Router incorporates the latest wireless and Gigabit networking technology to increase speed, range, security and reliability. The router provides unsurpassed gaming and network experience and performance.Advanced antenna and 802.11 N technology increases wireless data range and coverage. Enjoy lag-free gaming and file transfers on your wired Gigabit computers via the built-in Gigabit switch. This router features a powerful firewall and advanced wireless encryption for secured transmissions. Quality of Service (QoS) prioritization provides a seamless gaming and multimedia streaming experience. Increased speed, throughput and range make it the perfect solution to fulfill your gaming needs.Additional FeaturesWi-Fi compliant with IEEE 802.11n and IEEE 802.11b/g standards4 x 10/100/1000Mbps Auto-MDIX Gigabit LAN port and 1 x 10/100/1000Mbps Gigabit WAN port (Internet)Supports Cable/DSL modems with Dynamic IP, Static IP, PPPoE, PPTP, L2TP and BigPond connection typesSupports Router AP mode and Bridge modeBuilt-in 3 external antennas support 300Mbps high speed performance and great coverageFirewall features Network Address Translation (NAT), and Stateful Packet Inspection (SPI) protects against DoS attacksTraffic control with virtual servers, special applications, gaming services and Ubicom StreamEngine featureUPnP (Universal Plug and Play) and ALGs support for internet applications such as email, FTP, gaming, remote desktop, NetMeeting, telnet, and moreProvides additional security of enable/disable wireless SSID, internet access control (services, URL and MAC filtering)Supports multiple and concurrent IPSec, L2TP and PPTP VPN pass-through sessionsSupports Static Routing &#x96; RIPv1 announcerEasy management via web browser (IE 6.0 or above, Firefox, Opera, Netscape) and remote managementSupports 64/128-bit WEP (for 11b/g), WPA/WPA2 and WPA-PSK/WPA2-PSKCompliant with Windows 95/98/NT/2000/XP/2003 server/Vista, Linux and Mac OSCoverage up to 150 meters (500ft.) indoor (depending on the environment)Coverage up to 400 meters (1300ft.) outdoor (depending on the environment)Networking Solutions", "title": "TRENDnet 300Mbps Wireless N Gigabit Router TEW-633GR (Piano Black)", "price": 29.67, "salesRank": {"Electronics": 94822}, "imUrl": "http://ecx.images-amazon.com/images/I/41OGwosJS2L._SY300_.jpg", "related": {"also_viewed": ["B00D8AMKKC", "B0062KA4VM", "B0098QV038", "B008RV51EE", "B00E37JODK", "B003Y5RYNY", "B000Z3XXR4", "B00BUSDVBQ", "B001UI4RTG", "B0044YU60M", "B002YLAUU8", "B001FWYGJS", "B0088CJT4U", "B000Z3U1P6", "B0001FXLUA", "B000PLSAII", "B000BTL0OA", "B000LIFB7S", "B001P9XHHI", "B0019EQ1RW", "B00C1DN6ZA", "B007KZQM9Q", "B000N99BBC", "B008ABOJKS", "B006QB1RPY"], "buy_after_viewing": ["B006QB1RPY", "B008IFXQIW", "B001FWYGJS", "B002YLAUU8"]}}