{"asin": "B0042X9LC4", "related": {"also_bought": ["B0098TG67U", "B00D1KBG5Y", "B0088LPGFW", "B001S2PPT0", "B00005LEN4", "B004OHJ1M8", "B0045KGZOG", "B005EP2VHQ", "B0095ZKUD8", "B00436G2OU", "B00573YYWA", "B00CV9MKU6", "1435459423", "1933952806", "B002JCSV8A", "B001EO6W8K", "1435459989", "111801202X", "B0049U478S", "B000ZMCILW", "B009DJ1OFY", "B004Y1AYAC", "B008TWNN46", "B000BY52NU", "B0042X9L6A", "B003L1ZYZ6", "B007M54E1M", "B00CV9M6BO", "B0069R7FFQ", "B001955P8W", "B000O161X0", "B0013A1XDE", "B002VPE1WK", "B0098TAGHQ", "B00004ZCJG", "B00007EDZG", "B00ECGX8FM", "B009DJ1THW", "B005K7JLLW", "B001GCVA0U", "B007ORX8ME", "B006TAP096", "B0015U95SW", "B0095ZLP3C", "B004YW79F4", "B000EOSHGQ", "B008B14VAK", "B005UG3KS8", "B003ZSHNCC", "B008B4893M", "B00005LE6Z", "B00CV9ML5U", "B002332KC8", "B004PE69YI", "B00CTCIQEO", "B003V06YA6", "B00005LEOH", "B005MRXRGA", "B00005Y3OM", "B0080JH3YE", "B008GSJGVW", "B00004ZCGW", "B00004ZCJM", "B00004ZCJJ", "B004KU827O", "B000HJPK2C", "B001ET5U92", "B000KKPN5C", "B0026FCKC8", "B003Y0631I", "B00004ZCJK", "B0012GDOQS", "B007NDL56A", "B001F6TXME", "B00005LEOO", "B0079M711S", "B00AXZZ034", "B007M54E08", "B00HQ4W4PC", "B0000BZL47", "B000LWJ1ES", "B00156OZ68", "B00BXA7N6A", "B003A6NU3U", "B0014Z5XMK", "B000BY52NK", "B001TZUS98", "B00021EE4U", "B000BYCKUI", "B0049I48JI", "B00009R96C", "B00009R98A", "B00005LENO", "B0045TYDNC", "B0002EMY9Y", "B00CEEVSHY", "B0049FVMF4"], "bought_together": ["B001S2PPT0"], "buy_after_viewing": ["B00BI9X7UC", "B001S2PPT0", "B007M54E1M", "B007NDL56A"]}, "title": "Nikon D7000 DSLR (Body Only) (OLD MODEL)", "price": 709.0, "salesRank": {"Camera &amp; Photo": 589}, "imUrl": "http://ecx.images-amazon.com/images/I/51x2%2BvRf-xL._SX300_.jpg", "brand": "Nikon", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]], "description": "D7000Meet the new Nikon D7000, a camera ready to go wherever your photography or cinematography takes you. Experience stunning images with sharp resolution and smooth tonal gradation, thanks to the 16-megapixel DX-format CMOS image sensor and a powerful EXPEED 2 image processing engine. Take advantage of its wide ISO range of 100 to 6400 (expandable to 25,600) and its incredibly low levels of noise. Expect your images tack-sharp and accurately exposed, thanks to the camera&rsquo;s 39-point AF and Scene Recognition System using a 2,016-pixel RGB matrix metering sensor. And with an approx.&nbsp; 0.052-second release time lag and approx. 6 frames-per-second shooting, you won&rsquo;t miss a moment.&nbsp;You&rsquo;ll see exactly what you&rsquo;re capturing with the approx. 100% frame coverage viewfinder, and for those who want to shoot both stills and movies, the D7000&rsquo;s D-Movie capabilities now include Full HD 1080p capture with full-time autofocus and manual exposure. All of this advanced imaging technology is kept safe beneath the magnesium alloy covering the top and rear chassis of a compact body, whose sealing has been severely tested against moisture and dust. The D7000 is ready to shoot indoors and out, and at 150,000 cycles tested, the camera&rsquo;s durable shutter unit helps you keep shooting. Combine all this with the unmatched NIKKOR lens lineup and Creative Lighting System and you have everything you need to explore your imagination to its fullest. Where can creative freedom like this take you? Find out, with the D7000.D7000 HighlightsStunning image details: 16.2 effective megapixelsWhether you want to make large prints or crop tightly in an image, the D7000 delivers the resolution you need. At its heart is a DX-format CMOS image sensor with 16.2 effective megapixels, optimally engineered to gather more quality light through sharp NIKKOR lenses.&nbsp; Coupled with 14-bit A/D conversion (12-bit selectable), the D7000 produces stunning images that are richer in tone and detail than previously possible in DX format. The A/D conversion happens within the sensor, thereby maintaining exceptional image integrity without sacrificing shooting speed or energy efficiency. Combine these with the agile DX format and its signature 1.5x focal length telephoto potential and you can begin to see where this kind of shooting power can take you.Improved image quality and speed: EXPEED 2 image processing engineSometimes you want to capture the subtle tones of a sunset. Other times you want to freeze the action. The D7000 delivers both, thanks to the newest generation of image processing engine, EXPEED 2, which performs multiple tasks with more speed and power. Expect smoother tonal gradations, even in difficult shadows and highlights, for a greater sense of depth in your images. Shoot continuously at 6 frames per second so you can capture the action you&rsquo;ve been missing. Focusing performance such as face recognition in Live View mode is also further improved, letting you concentrate on your composition.Standard ISO 100 to 6400, expandable to ISO 25600 equivalentWith improved pixel quality of the image sensor comes a wider ISO range from the DX-format &mdash; ISO 100 to 6400 has now become standard with the D7000, enabling you to handle a wider range of lighting situations: from the bright and sunny outdoors to low-lit evenings and interiors. Nikon&rsquo;s renowned noise reduction technology has been upgraded even further. Throughout the range, the D7000 delivers sharp images with minimized color noise. And thanks to the higher processing speed, even when High ISO noise reduction is activated, you can keep shooting continuously without stress. Quality high-ISO performance can also enhance a lot for movie shooting, allowing you to capture the mood of a scene using only available light.Capture Full HD 1080p D-Movie with full-time autofocus and manual exposureThe D7000 welcomes in a new era of movie capture: Full HD 1080p and movie editing functions for exceptional cinematic reproduction and quality. In addition to smooth-moving images, the camera can compensate for distortion and other image-degrading problems. Besides auto exposure mode, the D7000 offers manual exposure mode, which locks in the exposure value when shooting scenes with varying contrast levels, such as when panning from a bright window to a dark interior. Aside from a built-in monaural microphone, the D7000 incorporates an external microphone jack for high-quality stereo sound recording options.Improved quality in highlight and shadow: Active D-LightingNikon&rsquo;s exclusive Active D-Lighting offers the ability to preserve details in the highlights and shadowy areas of images shot in high-contrast scenes.Whether you&rsquo;re dealing with bright skies and a dark foreground or deep shadows where you can&rsquo;t use a flash, the EXPEED 2 image processing engine renders those scenes with smoother tones &mdash; even at its highest settings. Simply select Auto in Active D-Lighting mode and the camera can adjust to the scene&rsquo;s contrast levels or bracket them into three frames of varying strength levels. Even when Active D-Lighting is activated, you can still maintain the continuous shooting rate.&nbsp;Now even more precise: The Scene Recognition SystemThe D7000 incorporates a built-in exposure-metering sensor with a far larger pixel count than any other D-SLR camera before it. The 2,016-pixel RGB sensor reads the scene&rsquo;s brightness and colors more accurately, and then applies this reading to optimize not only exposure, but also autofocus, white balance and i-TTL flash calculations &mdash; all in mere milliseconds prior to the actual exposure. With more pixels, the D7000 can recognize even smaller subjects &mdash; both moving and stationary. The newly improved Scene Recognition System delivers better photographs in every way.Wide-area coverage, powerful 39-point AFThe D7000&rsquo;s strategically positioned 39 AF points cover a significantly wide area of the frame, giving you flexible compositional possibilities. The nine AF points in the center utilize powerful cross-type sensors &mdash; especially useful when you need tack-sharp focus such as with portraits and macro work. And unlike other manufacturers&rsquo; systems, the D7000&rsquo;s nine cross-type sensors work with all AF NIKKOR lenses f/5.6 or faster. The D7000 offers a variety of AF area modes, including dynamic-area AF using 9, 21, 39 points. Switch between the three, depending on the predictability of your subjects&rsquo; movement, and the selected AF point and surrounding points will track your intended subject automatically.There is also 3D tracking, which continuously follows moving subjects within the 39 AF points, indicating the activated AF point in the viewfinder. Utilizing Nikon&rsquo;s Scene Recognition System, Auto-area AF properly judges the main subject within 39 AF points and focuses on it. Therefore, no matter what the situation or composition calls for, the D7000&rsquo;s autofocus system will be ready to meet your focus needs.39-point AF & 2,016-pixel RGB sensorStay focused on what matters most.Sophisticated AE with highlight analysisAfter the incredibly accurate 2016-pixel RGB sensor reads a scene&rsquo;s lighting information such as brightness and colors, the D7000 cross-references what it sees with imaging data from 30,000 real-world shooting situations. This way, the renowned 3D Color Matrix Metering II delivers exposure results that are faithful to how you see light and shadow interplay, even in difficult lighting situations. This intelligent metering technique also delivers exceptionally accurate i-TTL flash exposures, and it all happens within milliseconds for both speed and precision.Informed auto white balance (AWB)Based on its massive collection of shooting data compiled from various light sources, the D7000&rsquo;s intelligent AWB algorithm renders white as truly white &mdash; even when shot under a wide range of light sources, including the difficult mercury vapor lighting. The D7000 also carries another AWB mode that maintains incandescent warmth in your images.Contrast AF for live view and D-MovieLive View and D-Movie users can rejoice, because with the D7000, face-priority AF is now faster and more powerful than ever. Up to 35 people can be. For moving subjects such as pets, subject-tracking AF keeps them in focus. Normal-area AF is recommended for pinpoint focus and wide-area AF for handheld shooting. All are effective both for Live View shooting and movie recording.6 Frames Per Second Shooting up to 100 ImagesSay farewell to missed opportunities. The D7000 incorporates a new driving mechanism to conduct its remarkably fast and precise mirror movements, giving you an approx. 0.052 second release time lag and an approx. 0.13 second start-up time. What&rsquo;s more, you can continuously shoot at approx. 6 frames per second at both 14-bit and 12-bit A/D conversion for RAW shooting.Rugged and protected: compact magnesium alloy body and sealing against dust and moistureWith a top and rear cover of durable magnesium alloy, the D7000 is ready for the outdoors. Nikon engineers paid meticulous attention to where exterior parts join by employing durable sealing against moisture and dust. The compact body has also undergone severe environmental tests to prove its rugged reliability.Approx. 100% frame coverage viewfinderWith approximately 100% frame coverage in the viewfinder, what you see is what you exactly capture. The specially coated glass pentagonal prism and precision-crafted finder screen offer not only a bright viewfinder image, but also enable you to easily confirm when a subject is in focus.Precision and durability: 150,000 cycles tested shutter unitThe D7000 has a shutter speed range of 1/8000 to 30 seconds, with a top flash synchronization speed of 1/250 second. And just like with professional models, the shutter unit is tested for 150,000 cycles in severe conditions, proving precision and durability.Intuitive operation: strategically located dials, buttons and switchesEach and every control on the D7000 has been strategically placed for streamlined operation. The exposure mode dial and release mode dial are stacked on the same axis for easier access. Two new user settings can be assigned to the exposure mode dial. The release mode dial now offers a quiet shutter release mode for near-silent operation and one-touch Live View and movie recording are now possible, thanks to a newly designed switch and button structure.921k-dots, 170-degree viewing angle, 3-inch LCD monitorThe D7000 features an expansive 3-inch VGA LCD monitor with reinforced glass. Its approx. 921k-dot resolution assures clear, detailed display of images, which proves invaluable when confirming focus or assessing image sharpness. The wide 170&deg; viewing angle and bright display make it easy to review images or confirm menu settings when shooting outdoors.Electronic Virtual HorizonEspecially useful for landscape shooting, the virtual horizon indicated in the LCD lets you know when the camera is level. The virtual horizon can also be displayed during Live View shooting.Twin SD card slots (cards not included)Two memory card slots offer a number of advantages: sequential recording; recording the same images simultaneously on two cards; recording RAW and JPEG separately onto two different cards; and duplicating images from one card to another. It&rsquo;s also possible to designate a specific card with more memory for use at the time of movie recording.Intelligent power managementAfter carefully scrutinizing every aspect of the camera&rsquo;s circuitry, Nikon engineers have designed the D7000 for maximum performance with minimized power usage. With the newly designed Rechargeable Li-ion Battery EN-EL15, 1,050 frames* can be taken on a single charge.*With EN-EL15, based on CIPA standards.Nikon Creative Lighting SystemThe D7000 has a built-in pop-up flash that covers a 16mm lens perspective without vignetting. The flash is fully compatible with the Nikon Creative Lighting System (CLS) and delivers well-balanced flash exposures thanks to the innovative i-TTL flash control. The built-in flash also offers Commander mode to trigger remote flash units when using Advanced Wireless Lighting. The dual advantages for i-TTL technology and wireless capability make sophisticated remote flash control simple and inspiring. One simple remote flash from the side using the SB-900, SB-700 or SB-600 creates more texture, dimension and mood in ways that available light cannot. For more sophisticated creative effects, the small and intelligent SB-700 has been designed to make the control of remote multiple flashes even easier.Picture Control: PortraitYou can transform the look of an image simply by selecting from the camera&rsquo;s Picture Control menu. Choose from the following settings: Standard, Neutral, Vivid, Monochrome, Landscape, and Portrait. You can even adjust parameters such as sharpness and saturation and then save them as Custom Picture Controls.Optional Multi-Power Battery Pack MB-D11The dedicated battery pack MB-D11 ensures longer battery power. You can expect more than 2,010 shots*. The MB-D11 is equipped with a shutter release button, command dials and a multi-selector useful for vertical composition shooting. It also provides better camera balance when a long telephoto lens is used.*With two EN-EL15 (one in camera and one in MB-D11), based on CIPA standardsViewNX 2 &mdash; Your imaging toolboxBrowse and organize images easily and efficiently with ViewNX 2. This bundled, all-in-one software helps you view, edit, store, and share both photos and movies. Attach labels to your images for simpler searching and browsing, or choose from an array of editing functions such as resize, crop, rotate, straighten and auto red-eye correction. You can even delete scenes from movies taken with your D7000. ViewNX 2 also works effortlessly with Nikon&rsquo;s photo-sharing website, my Picturetown, making uploading and viewing your images more enjoyable than ever."}