{"asin": "B008V4TFDK", "description": "eneloop 2nd Generation Battery Charger Sanyo MQN06 NiMH Battery Charger\nThe new 4 Position eneloop battery AC charger.  SANYO's advanced rechargeable battery technology allowing NiMh batteries to last longer than ever before! Eneloop batteries provide excellent performance-to-cost advantages over both conventional alkaline and other rechargeable batteries. Unlike disposable batteries which can only be used only once and are wasteful to the environment, the new eneloop batteries can be recharged up to 1,500 times. They comepre-charged and can be used immediately out of the pack. eneloop batteries deliver reliable battery performance when you need it the most!\n\nCharge Once and Use Years Later - eneloop batteries offer exceptional shelf life so you can use your rechargeable batteries when and where you need them most. You can charge your eneloop batteries once, store them away for up to three years and use them at a moment's notice. After charging eneloop batteries they will maintain 75% of their capacity for up to three years. They are ready to be used immediately right out of the pack.\n\nClean Energy - Great for the Environment - Each year, Americans deposit 8 billion disposable batteries into landfills! eneloop batteries can be recharged up to1,500 times, which means that the purchase and use of a single eneloop cell can keep many hundreds of batteries from entering landfills! eneloop battery cells are completely recyclable which reduces the impact on the environment. They can be recycled free of charge at any of the 50,000+ Rechargeable Battery Recycling Corporation (RBRC) recycling centers near you.\n\n-Charge 4AA, 4AAA or 2AA and 2 AAA NiMH rechargeable batteries\n-Charges 2 or 4AA 2000 mAh in 7 hours\n-Charges 2 or 4AAA 800 mAh in 6 hours\n-Input 100-240V AC 50-60 Hz 8W\n-Retractable AC Plug", "title": "SANYO Eneloop 4-Position Ni-MH Rechargeable Battery Charger White", "price": 6.95, "imUrl": "http://ecx.images-amazon.com/images/I/51%2BPDOFR3qL._SY300_.jpg", "related": {"also_bought": ["B004SB1TD4", "B004UG41XW", "B005ILYG4M", "B004UG41W8", "B009RPBEEK", "B0050DO1B6", "B003I7BGH8", "B009RQJM3Y", "B0050J4ZGQ", "B005VTEWB8", "B008OC043Y", "B005LMJUDU", "B005C2Z68M", "B006Z77XX4", "B00E1JEICC", "B00478GE1U", "B00B21PBJG", "B004W8Z3IK", "B000IV2WAW", "B003US4L4K", "B004RP2VNI", "B009LU9128", "B005ILYG5Q", "B0058GZWXQ", "B007SR145I", "B009WW7Z3W", "B000IV2YLY", "B000LNI5VC", "B003OR3H7Y", "B0054JJ0QW", "B002V88HFE", "B00ECAP5BS", "B002V8C3W2", "B008LTJJJA", "B002UQWGM2", "B004UAG77G", "B00691WMQE", "B00D8K4G54", "B0035UOO72", "B000IV0REA", "B008ASBFM6", "B00B51D6NQ", "B004UAG77Q", "B003EJ1QL6", "B005DF4ZVM", "B007OSD9UO", "B00EDOCN7C", "B00ECAP0BI", "B00ECAP5QI", "B002TZRZA2", "B0079M711S", "B005IQRMN4", "B0045WGWCE", "B003OR3HBU", "B0035TMJGQ", "B0034WR19Y", "B0035TQE6M", "B007FH1KX2", "B0042X9L6A", "B000RSOV50", "B000CRFOMK", "B0050YG3CU", "B009LU9150"], "buy_after_viewing": ["B004SB1TD4", "B004RP2VNI", "B005ILYG5Q", "B005ILYG4M"]}, "categories": [["Electronics", "Accessories & Supplies", "Batteries, Chargers & Accessories", "Power Converters"]]}