{"asin": "B0015KYV3Q", "description": "Amazon.com Product Description With the SanDisk Sansa Fuze, you canfuseyour portable entertainment, featuring 8 GB of storage. Listen, watch, and play all day with 24 hours of battery life and room for up to 2,000 songs**. Watch your favorite video clips on the Sansa Fuze's 1.9-inch color screen. Measuring just 0.3 inchesthin, the Sansa Fuze marks the next wave of music and video players.Your portable music machine with 8 GB of storage. (Click image to view larger.)The MicroSD/SDHC memory card slot means storage possibilities are essentially unlimited. (Click image to view larger.)Smaller than a credit card and as thin as a pencil, the new Sansa Fuze MP3 player looks great--and has the brains to match. (Black player shown here; click image to view larger.)Audio PlayerSmaller than a credit card and as thin as a pencil, the new Sansa Fuze MP3 player looks great--and has the brains to match. With room for up to 2,000 songs**, you can listen all day long. Jam to FM radio with 40 preset stations, play with the built-in voice recorder, and listen to your favorite audiobooks wherever you go. And with 24 hours of battery life, you're free to listen, watch, and play all day--literally.Watch Your Favorite VideosThe Sansa Fuze comes with 8 GB of built-in memory enough to store 5 hours of video playback. Watch your favorite TV video clips from wherever you are. To ensure speedy file transfers, the unit features a USB 2.0 connection. Simply connect the player to a PC, and start dragging files from your Windows Media Player 10 or 11 applications.Expanded CapacityWith an option to extend the capacity, its MicroSD/SDHC memory card slot means storage possibilities are essentially unlimited. Expand your music collection, show albums of photos up to 4000 images*, and watch your favorite videos on those long trips.Compatible FormatsThe player supports MPEG4 video files and audio files saved in MP3, secure and unsecured WMA, WAV, Audible, and Overdrive file formats.FM RadioIf you're feeling like a break from your own tunes, or want to dial in the TV frequency at the gym, use the digital FM tuner. Save your favorites on the 40 user presets.Voice RecorderUse the voice recorder with built-in microphone to take memos, record meetings or lectures, or capture whatever else you might feel inclined to point a microphone at. When you're ready, transfer your files for listening on your PC.What's in the BoxSanDisk Sansa Fuze 8 GB MP3 player (silver), earphones, USB 2.0 cable, quick start guide* 1 gigabyte (GB) = 1 billion bytes; some of the listed capacity is used for formatting and other functions; thus, it is not available for data storage** Based on continuous audio playback at 128 kpbs MP3; video playback at 512 kbps/ MPEG 4; photos based on 1.7 MB average file size; battery life and performance might vary depending upon usage and settings; battery not replaceable.", "title": "SanDisk Sansa Fuze 8 GB Video MP3 Player (Silver)", "price": 46.99, "imUrl": "http://ecx.images-amazon.com/images/I/41BuOeiwE9L._SY300_.jpg", "related": {"also_bought": ["B001ECP666", "B001C48HTO", "B001SI7NIK", "B0012Y2LLE", "B001RI95NW", "B0015L451I", "B0015L0T3G"], "buy_after_viewing": ["B002MAPS6W", "B002MAPT7U", "B0041G62TW", "B005FVNH04"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}