{"asin": "B00387EW1K", "description": "Experience Verbatim's performance-driven Acclaim--this USB portable hard drive is one of the smallest in the industry. Compact and stylish, Acclaim features a sleek piano-      black finish and storage capacities of 320 and 500 GB. Acclaim is compatible with all USB connections and includes Turbo USB software and Nero BackItUp software that provides customizable automatic data     protection and restore. Acclaim boasts special bonuses from Norton Online Backup and eMusic as well as a 7-year limited warranty.FeaturesDesign- the Acclaim is one of the smallest and best looking hard drives in the industry. The compact size works great for on-the-go storage. The sleek finish adds style and elegance to your PC  accessories.Warranty--Bonus! Extended 7-year limited warranty!Verbatim manufactures our hard drives to meet our strict quality standards.--Please see details on Verbatim.com  We stand behind the quality of our products-and our warranty proves it!Compatibility- The Acclaim portable hard drive is compatible with both Windows and Mac operating systems and  can be used with all USB ports.Nero BackItUp Software- The Acclaim portable hard drive includes Nero BackItUp Software for Window  only and offers full system backup and restore functions, the ability to schedule automatic backup by date/time and an encrypted backup option with password control.Bonus $25 Value!Free trial of Norton Online Backup & Emusic 35 songs.Tips for Getting StartedUsing Acclaim is easy:1. Remove the Acclaim drive from the box2. Connect the  included USB cable to the drive and then to your computer3. The Acclaim drive will mount automatically and a new icon appears on the desktop (Mac) or in My Computer (Windows)Now you're ready to  transfer and protect your files.What's in the Box1 Acclaim Hard Drive pre-loaded with Turbo USB Software &amp; Nero BackItUp SoftwareUSB CableQuickstart  GuideQuicklinks to eMusic and Norton Online BackupAbout VerbatimVerbatim provides technology you can trust-we've done so for over 40 years. Our products include an  impressive selection of removable storage and computer peripherals, featuring a wide range of highly acclaimed CD, DVD and Blu-ray media products. Verbatim also offers an array of lightning fast desktop and  portable hard drives, USB flash drives, memory cards, stylish, feature-rich mice and keyboards and a broad range of replacement laser toner cartridges. Buy Verbatim and you get innovation, security and reliability -and that means peace of mind.", "title": "Verbatim Acclaim 320 GB USB 2.0 Portable External Hard Drive 97164 (Piano Black)", "price": 8.78, "imUrl": "http://ecx.images-amazon.com/images/I/41YR%2BlJRGnL._SX300_.jpg", "related": {"buy_after_viewing": ["B008I647AM", "B00834SJSK", "B0046RE21G", "B0046A8MSM"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]]}