{"asin": "B000063XHF", "categories": [["Home & Kitchen", "Kitchen & Dining", "Small Appliances", "Ice Cream Machines"]], "description": "Rather than heading down to the local Dairy Queen for a  soft-serve cone, use the Arctic Twister to make custom soft-serve ice  cream at home. Using the Arctic Twister is not as ambitious as making  ice cream from scratch: simply buy your favorite ice cream, sherbet, or  frozen yogurt and swirl in the toppings of your choice to make your own  original flavor. The dispenser can handle almost any topping you can  think up, from the healthy (nuts, granola, fruit, and cereal) to the  decadent (sprinkles, chocolate chips, M&Ms;, cookies, and candy  bars).Once the five pieces of this easy-to-assemble appliance are in place,  remove the lid and layer your ice cream with candy, nuts, etc. Replace  the lid, turn on the power, and start pumping the handle on the lid to  get your ice cream churning. But don't delay in getting your cone  positioned under the spout--once your soft-serve treat begins spiraling  out, you want to be ready to catch it. In one run, the dispenser twirls  enough ice cream for three cups, cones, or bowls. Cleanup is easy as  all components of the dispenser are plastic and safe to wash in the top  rack of the dishwasher. A great dessert idea for kids' parties,  ice-cream socials, or summer picnics, the Arctic Twister is covered by  a one-year limited warranty.--Cristina Vaamonde", "title": "Black &amp; Decker IC200 Arctic Twister Ice Cream Mixer", "price": 49.99, "salesRank": {"Kitchen & Dining": 115694}, "imUrl": "http://ecx.images-amazon.com/images/I/31FMD0CQDQL._SY300_.jpg", "related": {"also_viewed": ["B000F94GPQ", "B009S2J066", "B002LARFX2", "B0048UE84C", "B0038OMF30", "B00532A6YK", "B00008SJXO", "B003R4NE5E", "B000TVNI7M", "B0002AU0YE", "B000M9OUMS", "B009S2J04S", "B0000BVQND", "B004RSAQQY", "B003R4Q5GY", "B00HK8YOYI", "B00LIEBWV8", "B00BIUDPNK", "B00HK8YOX4", "B0001CRRDK", "B001CGW338", "B002R9D86K", "B000MR14I8", "B00AZMO2Y8", "B00HK8YOY8", "B00F3AFQ1K", "B005083ECS", "B00GCT7URO", "B0006ONQOC", "B00DGQVTNW", "B0087FR6W0", "B003KYSLMW", "B008J9YG1S", "B001SAU2N6", "B000BVX244", "B00KKJUE8O", "B000H433D0", "B00008YSLM", "B00CH3VZDE", "B009YX15M6", "B000BXJY0S", "B00HK8YP0Q", "B005Q92KTE", "B008IGEWH0", "B003FA830G", "B004FL2260", "B009446890", "B004MK8434", "B0046ZJAUQ", "B007685900", "B0000DIL75", "B00400882I", "B00DGQVTLE", "B0009A0N4E", "B00004X135", "B00E3E3EDE"]}}