{"asin": "B00BMGTAQ6", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphone Accessories", "Amps"]], "description": "Main Product Features:   Maxell's Noise Redux headphones offer two distinct denatures:  noise cancellation and sound amplification.  The Active noise cancelation function could effectively reduce up to 85% of ambient noise, making listening to music more enjoyable and free from the outside noise.  The double insolated cup design provides full ear coverage, excellent comfort and effective outside noise isolation.  Amplifier Features:   The Maxell&#x2019;s Noise Redux combines noise cancelling technology with amplified sound.  Sound quality is enhanced through the amplified large-scale 40mm speaker for heavier bass and clear crisp high notes.  The amplifier improves bass at 80Hz by 8db and high notes at 10kHz by 3db.  Headphone Features:   Unique three stage design allows for convenient switching between amplifier, noise cancelling, and unpowered headphones based on personal preference. The adjustable headband design allows the ear cup and headband to fit closely to the head to ensure comfort even after prolonged use.    Included storage case protects headphones and makes them more convenient for traveling.    Batteries are provided for out of the package use.  Battery life can reach up to 60 hours of play time.  (You may continue to use the headphones without batteries even though noise cancelling and amplifier function will not work).   Suitable for watching movies or listening to music on an airplane, train, bus, or any place with environmental noise.", "title": "Maxell HP/NC-V Noise Redux Headphones (190208)", "price": 88.2, "imUrl": "http://ecx.images-amazon.com/images/I/419tn94QU7L._SY300_.jpg", "brand": "Maxell", "related": {"also_viewed": ["B00915OV1E", "B000U07C1U", "B00BSXRBGE", "B007SY4QTW", "B001EYU3L2", "B00375MWE2", "B00BBDKXNY", "B00DOP3KBY", "B000KQQUQW", "B00372YKMM", "B005YR0X4W", "B00DL1XH1O", "B00KBOVAEK", "B00000J1EJ", "B009A6D1NI", "B005ZNHDYS", "B002HWJT1A", "B000629GES", "B0089I0YQK", "B00DJ3ZZ4G", "B000051SD1", "B0031RG832", "B007G95FJE", "B005N8W214", "B007G973VM", "B003C0GTH8", "B003WV8PKG", "B00007E7C8", "B002LK2QJK", "B002VPDOH8", "B007K4TN02", "B000065BPB", "B005N8W1MO", "B0013OWPV4", "B007BY3PMI", "B007G96VW4", "B0092T7Z9O", "B0043M9AU2", "B00004Z6Q6", "B00001P4ZH", "B00BPIYIBS", "B00H0PWF06", "B00FYWCL2E", "B0028E4SF4", "B002PHM0V8", "B003VNKKUS", "B0007XFGAE", "B003X1BEKI", "B00HVLUQW8", "B0028N78C0", "B0013P3ZOE", "B004RKVXXM", "B00G6QBCWC", "B00D8HPYXA", "B004WZVO68", "B005FU5L40", "B0096QYNRA"], "buy_after_viewing": ["B00915OV1E", "B000065BPB", "B000065BPB", "B0054JJ0QW", "B000U07C1U"]}}