{"asin": "B00006I02Z", "description": "In many ways, creating a sequel toHalf-Lifeis an unenviable task.  After all, the goal is to craft not just any ordinary game, but an improvement to a title that is widely considered to be the high water mark for first person shooters.  Fortunately, Valve does not disappoint on their sophomore effort.Half-Life 2picks up exactly where its predecessor leaves off, with gamers stepping once more into Gordon Freeman's HVAC suit as he awakes at some indeterminate time in the future, now apparently in the employ of the mysterious G-Man.  Humanity has been sold out to alien forces, and your job is to escape their thrall and lead the resistance to victory.HL2's key successes are in a few critical areas, the first of which is the new physics & graphics engine, called Source.  People and objects fall, fly, tip over, float, and break in an extraordinarily realistic fashion, and in-game puzzles often require you to use simple applications of physics to progress. Second, an elaborate facial structure system coupled with excellent voice acting make for some of the most believably human NPCs in gaming history.  This is no small thing; you will find yourself actually caring about the characters who surround you, even those that are normally regarded as cannon fodder.  Third, the level design exhibits a subtle brilliance, which frequently fools you into feeling like you're making your way through an organic environment and not a forced linear path.  These elements combine to form one of the most truly immersive experiences ever captured on a PC.This gaming bliss comes at a cost, however.  If your computer isn't running the latest and greatest hardware, you may find yourself turning down a lot of the slick graphics to keep the machine from choking.  Also, at the time of this writing the only two bundled multiplayer games are a barely updated version ofCounter-StrikeandHL2 DeathMatch.Counter-Strike: Sourceis every bit as fun as the original, but the DeathMatch is lackluster and contains only a handful of uninspired maps.Overall,Half-Life 2is a smashing success, every bit worthy of the prestige and respect that the franchise has been awarded.  This is absolutely a game that every computer gaming enthusiast is going to want to have in their collection.-- Jon \"Safety Monkey\" GroverPros:Advanced graphics and physics system provide highly immersive experienceBelievable, expressive non-player charactersFun, realistic level designCons:Requires a very fast computer to play with all bells & whistles onDeathMatch mode has few maps and is not terribly entertaining", "price": 11.99, "imUrl": "http://ecx.images-amazon.com/images/I/51ZBQR9HBBL._SY300_.jpg", "related": {"also_bought": ["B001440YD4", "B00001KUII", "B000CQIDTC", "B0029ZBZ0I", "B00006FXIN", "B00006C2HA", "B001Q96ZNU", "B008E6ZXA4", "B000PS2XES", "B002I0HKRQ", "B000AOE4BM", "B000B63RSA", "B0000C6EB4", "B000EPP6UA", "B001CC8UBG", "B000ID1AKI", "B00140S21O", "B001E6DG6Y", "B00269QLJ2", "B0000A1VER", "B0016BVYAM", "B00503EAG2", "B00005BIQK", "B000X9FV5M", "B00006IR62", "B000MK694E", "B00002CF96", "B003GSZAOY", "B002BXKJA0", "B003O6CB6S", "B002BS47YE", "B003ICGL7I", "B005C2D2H4", "B00000DMAE", "B000FJSIUA"], "buy_after_viewing": ["B000ID1AKI", "B000PS2XES", "B002I0JIQW", "B001440YD4"]}, "salesRank": {"Video Games": 16736}, "categories": [["Video Games", "PC", "Games"]]}