{"asin": "B000EWD4TS", "description": "SanDisk's Cruzer Micro makes data transfer fast and simple. Its hi-speed USB 2.0-certified for data transfers at up to 480 Mbps (also compatible with USB 1.1, at a more modest 12 Mbps). Its 2GB capacity lets you store important data, pictures, music, and other files on a device little bigger than a few sticks of gum, then readily transfer them to your laptop or desktop. Making an important presentation? Walk into the room with your laser pointer and a Cruzer Micro.The Cruzer Micro offers higher storage capacity than floppy disks and other removable media, faster transfer rates, and better file security through CruzerLock. CruzerLock encrypts your individual files, keeping them safe and secure from prying eyes. Simply choose a personal password, select the file that you want to encrypt, and let CruzerLock do the rest. (CruzerLock is Windows-only; local administrator privileges required for Windows 2000 and XP.)For most users, the Cruzer Micro is plug and play, with no drivers required. (A Windows 98SE driver is available online at sandisk.com.) Many USB flash drives obstruct the port adjacent to it, making it difficult or impossible to use two USB devices at once. The ultra-small, ultra-thin Cruzer Micro won't cramp your style--no matter how tight things may get.Cruzer Micro now ships with U3 smart technology. Co-invented by SanDisk, U3 technology gives you the ability to carry your files AND your software on a secure USB drive. You can have your wallpaper, preferences, favorites, profiles, and more - everything you need for a familiar computing experience on any PC, wherever you go.Includes Skype exclusively on all Cruzer Micro USB flash drives. Make voice and video calls from PC to PC anywhere in the world.The new retractable USB port eliminates the need for caps and protects your USB connector.", "title": "SanDisk 2 GB Cruzer Micro ( SDCZ6-2048-A10, Retail Package)", "price": 49.3, "imUrl": "http://ecx.images-amazon.com/images/I/31SBYSQZZZL._SX300_.jpg", "related": {"also_viewed": ["B003O2S080", "B007JR531I", "B005GWQRWM", "B000NWWT3G", "B0032O3MB0", "B00DW4L7EE", "B005IW0APU", "B001N0RJQO", "B00542UYFA", "B000EFBM3K", "B00E3R0S12", "B002LVUN6M", "B003YCOMG4", "B007JR532C", "B00DYQYIZU", "B004TS1J1S", "B004TS1J18", "B00DYQYJ3Q", "B00DYQYITG"], "buy_after_viewing": ["B003O2S080", "B007JR531I", "B005GWQRWM", "B004TS1J18"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "USB Flash Drives"]]}