{"asin": "B001MVKZOC", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Wireless Access Points"]], "description": "Adding wireless access to your existing wired network is as simple as plugging in the Netgear WN802Tv2 Wireless-N access point to your switch or router. The wireless speeds will be blazing fast and much faster than your Internet connection so you don't need to worry about it slowing you down even at the edge of its wireless range where speeds are lowest. You'll be able to download movies quickly, and your gaming and VoIP calls will work without latency thanks to QoS which allows you to prioritize data traffic. And because the WN802Tv2 supports all types of wireless devices, including your older legacy 802.11b/g devices, you don't have to upgrade the rest of your system to enjoy the exceptional speeds and range of Wireless-N.Add blazing fast wireless access to your existing wired network easily.View larger.On the back of the access point, you'll find a power and ethernet port.View larger.Minimizes Download and Streaming TimesWhether you're downloading the latest hit single or streaming an episode of your favorite television show, you won't have to wait as long or experience frustrating pauses thanks, thanks to the ultra-fast speeds that Wireless-N delivers. This 802.11n, or Wireless-N, access point, delivers up to 15x faster download speeds and coverage up to 5x greater than Wireless-G. Wireless-N standard will revolutionize the way you experience the Internet.The WN802Tv2 is designed with multiple internal antennas that ensure you always have optimal performance, enhancing your network's range and the reception of weak signals. By using Gigabit Ethernet to connect to the network, the access point also maximizes wireless-to-wired performance, giving you the fastest speeds possible.The WN802Tv2 supports the IEEE 802.11n draft version 2.0 standard, so it will work with all 802.11n draft 2.0 certified notebooks, and is backwards compatible with IEEE 802.11g and 802.11b standards, so all your older wireless devices will still work on your new network.Automatic Network Prioritization Makes Life EasierWith a Wireless-N network, you don't have to stop your file downloading while you're on a VoIP call. Thanks to Wi-Fi Multimedia (WMM), the WN802Tv2 automatically prioritizes traffic so that time-sensitive applications such as VoIP calls and audio and video streaming is put ahead of file downloads and web surfing. The WN802Tv2 also offers supports for Wi-Fi Multimedia Power Save that helps save up to 40-percent of the battery life of WMM-PS devices that are connected to the access point.Business Class Security Keeps Out SnoopersTake comfort in your network's security with the WN802Tv2's support for Wi-Fi Protected Access (WPA2-PSK, WPA-PSK), WEP 64-, 128-, and 152-bit encryption for 802.11b/g, wireless access control, MAC address authentication, and 802.1x RADIUS support with EAP TLS, TTLS, PEAP.The access point measures a compact 1.4 x 7 x 5.1 inches (WxHxD) and includes a vertical stand for convenient placement.The NETGEAR WN802Tv2 Wireless-N Access Point is backed by a three-year warranty.What's in the BoxWireless-N access point, power adapter, Ethernet cable, stand, resource CD, installation guide, and warranty/support information card.", "title": "NETGEAR N300 Wi-Fi Access Point with Gigabit Ethernet Port (WN802T)", "price": 111.31, "imUrl": "http://ecx.images-amazon.com/images/I/31tM-kluCkL._SY300_.jpg", "brand": "Netgear", "related": {"also_bought": ["B0000BVYT3", "B00006RVPW", "B0002CWPW2", "B003QQ0NIY", "B00062WV9U", "B00023DRLO", "B0002CWPOK", "B002HWRJY4", "B002JTXA4I", "B00002EQCW", "B00D7GH7O6", "B00I5W5M12", "B000063UZW", "B00002EQCS", "B00BK0YRZS", "B004DJ99PG", "B003VWZE7S", "B005KG44V0", "B002MZW5JU", "B003HF8SL8", "B00ERJXTE4", "B0048U3FMS", "B007ED7V7G", "B00HEX851C", "B00BGTPQO4", "B00358MP02", "B00F0DD0I6", "B004C3ZPEW", "B0019804U8", "B0002A9U7M", "B00006B9H6", "B003Y24DEU", "B004DJ7QBK", "B0002A9RFM", "B00B5Q7AIS", "B0036Z0NZI", "B007SVFLP8", "B005584UQC", "B002MZUNXU", "B000FW60FW", "B002RYYZZS", "B0038ZTZ3W", "B00461G3MS", "B005SSQHTM", "B006V72AHC", "B002LITFTG", "B00H09BOXQ", "B007R73BI2", "B008WJ6ISY", "B0087BIM3Q", "B007RLFM7G", "B001OZODBW", "B008HO9DK4", "B00D78QCYK", "B0036TGGW8", "B009ZRJGYK", "B009SPWJ98", "B00315VPL4", "B002YK8WMC", "B003EE12EC", "B0045JFTXU", "B003KPHYBA", "B004XXMUCQ", "B000M0WALA", "B0081H8TRA", "B001D1UTC4", "B003NVMG6Y", "B00C04SXY4", "B0011A4UZE", "B00D601UC8", "B000QYEN1W", "B0044GJ516", "B00006B9HO", "B00EM5UFP4", "B004SUO1R6", "B001CY0P7G", "B0057BOO4A", "B003KPBRRW", "B0098Y77U0", "B001AZP8EW", "B009WUP8VA", "B003LD1U8Y", "B00847UWUE", "B009UEZ9XA", "B002MAPSA8", "B004YAYM06", "B003AUAXRC", "B006MI6M7E", "B0099F823E", "B003CNZ9WG", "B0049MPQA4", "B00H09BO2M", "B005ORP1JO", "B00DGH08OC", "B001QUA6R0", "B001OZFCI0", "B004I2JRIW", "B003KP8VSK", "B0039L50J8", "B0006NMRVQ"], "bought_together": ["B0000BVYT3"], "buy_after_viewing": ["B003QQ0NIY", "B008WJ6ISY", "B004UBU8IE", "B00F0DD0I6"]}}