{"asin": "B0035FCWBC", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]], "description": "iHome's first \"app-enhanced\" speaker dock for the iPhone OS that combines an interactive app with a dedicated bedside alarm clock, providing users the most connected and engaging sleep experience available.iHome's first \"app-enhanced\" speaker dock for the iPhone OS.Click to enlarge.Alarm Clock Speaker System for iPhone and iPodWake or Sleep to iPod or iPhoneStart or end your day just the way you want it to sound, with your favorite playlist. If no iPod or iPhone is docked, the unit will revert to a buzzer alarm.Whether buzzer or iPod, the alarm volume is gently increased, so as not to jar you out of sleep too forcefully. A snooze button is included, of course, with a default time of 9 minutes, adjustable up to 29.Sleep FunctionThe sleep timer lets you sleep to the music currently playing on your iPhone/iPod before shutting off at a chosen time. 90, 60, 30 and15 minute settings. The volume is gradually decreased once time is up.Modern, low-profile design.iHome app-enhanced models work with iHome apps to use the iOS touch-screen interface, internet connectivity, and extensive interactive capabilities.Charge Your DeviceThe iA5's Universal Dock charges your iPhone or iPod while it's docked. Enjoy your music all you want, your iPhone or iPod will end up fully charged.Backup BatteryThrow in three AAA batteries and you'll have a battery backup, handy for still making it work in the event of a power outage.Time SyncInstantly sync the iA5's clock time to always-current iPhone time settings in seconds.Great SoundiHome's Reson8 speaker chambers and specially designed high-end drivers deliver astounding clarity, depth and power. Basic bass and treble controls let you dial in the sound you're after.Aux-In JackListen to aux audio sources (e.g., computer, CD player) using the 3.5mm auxiliary audio input.App EnhancementThe iA5 is solid on its own, but really shines when you pair it with iHome's iPod touch/iPhone apps, available for free from the iTunes store. iHome app-enhanced models work with iHome apps to use the iOS touch-screen interface, internet connectivity, and extensive interactive capabilities. You can also use the apps to directly update the firmware of select iHome models, improving support and user experience.iHome+SleepiHome+Sleep is an interactive sleep lifestyle app for iPhone and iPod touch users. In addition to a full screen clock--with weather, iPod controls, and photo backgrounds--the app introduces Sleep Cards, a fresh way to encapsulate personal bedtime and wakeup settings such as alarms, music selection, social updates, personal reminders and much more. Turn any iOS device into an advanced alarm clock when you use iHome+Sleep, a free music alarm clock app.iHome+RadioWhen local radio is not enough, connect to thousands of internet radio stations around the world. This Internet radio music app for iPhone and iPod touch lets you global radio stations no matter where you live, complete with storable presets.What's in the BoxiHome iA5 App-Enhanced Alarm Clock Radio, Universal Voltage Adapter (100-240 volts, 50/60 Hz), User's Manual, iHome App Quick Start Guide", "title": "iHome iA5 App-Enhanced 30-Pin iPod/iPhone Alarm Clock Speaker Dock", "price": 41.5, "imUrl": "http://ecx.images-amazon.com/images/I/41XQvshVjFL._SX300_.jpg", "brand": "iHome", "related": {"also_viewed": ["B00BQ4HROG", "B001RYK2Q0", "B004I8WH7E", "B004NBZAI4", "B00HBJRV5K", "B003VWW3Q8", "B00DV7AH1Q", "B003B82R4U", "B003GAMD4C", "B003M8HWDA", "B00BDS0512", "B004OA6VZ0", "B004I8WH7O", "B00BQ4HRG4", "B003VX1EF8", "B004T0MW7Q", "B00AB2OQNO", "B00C6F0BK6", "B00B4MDN1G", "B004I8WH74", "B00E3VLB28", "B002IT1BFO", "B00COHALOM", "B008Q7HHIC", "B009NZ6SZE", "B004SKBJ5S", "B00080FO4O", "B008HFCI50", "B00IGD54BS", "B00B7D4CS0", "B00HF5TG8A", "B00BQ4HRE6", "B001L9KMTI", "B00KMFQIEU", "B004NBZA98", "B004T1Y8G8", "B004VFH7G0", "B0040GWXG4", "B004UBONK8", "B002OB4BKI", "B000Z9UY2K", "B004X69BFW", "B00CQJYWWK", "B003DZ9Z78", "B00D2CXV22", "B00B7D4CRG", "B003ARSO08", "B0069RZ044", "B009RYPL1S", "B005D6P182", "B003LPUU92", "B0043M66XQ", "B002EL4PPY", "B00FNJGLRO", "B00DJ69XFA", "B001RB1XY8"], "bought_together": ["B009A5EIWC"], "buy_after_viewing": ["B00BDS0512", "B00BQ4HROG", "B00BQ4HROG", "B00DJ69XFA", "B00BQ4HRG4", "B00BQ4HRG4"]}}