{"asin": "B0002EXJ8Y", "related": {"also_bought": ["B0002EXJ98", "B000C1Z0HA", "B00009UHXR", "B00J5O7BMC", "B0014KKV7W", "B005H3AU1Y", "B008TCW2LG", "B005N6ICXS", "B00BDYJDOQ", "B000I94FAE", "B003ID6XN4", "B005N6ID7S", "B005L9ZZ32", "B001R1RF86", "B000V0DY7U", "B000RJJ0XW", "B005N0CRT4"], "bought_together": ["B0002EXJ98", "B000C1Z0HA"], "buy_after_viewing": ["B008TCW2LG", "B00FB1NTP6", "B000C1Z0HA", "B0002EXJ98"]}, "title": "RF Link AVS-5811 5.8GHz Wireless Audio/Video Sender with IR Remote Control Extender", "price": 106.96, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41iyQNIZ8AL._SY300_.jpg", "brand": "Connect Gear", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Remote Controls", "Remote-Control Extenders"]], "description": "The average home entertainment system once consisted of a TV, stereo, and maybe a cable box. Now a modern system may also include a DVD player, satellite receiver, surround sound amplifier, digital video recorder, and an HD tuner, along with a PC designed to serve as a digital hub for certain audio/video functions. The RF Link AVS-5811 takes A/V technology to the next logical step by wirelessly transmitting audio and video signals from these components to any nearby TV, monitor, or stereo system, letting you enjoy vivid video and hi-fi stereo sound anywhere in the house. The A/V sender effectively lets you send signals to components located upstairs, several rooms away, or elsewhere without running bulky, space-consuming cables in the walls or under the floorboards. With the AVS-5811, viewers can watch simultaneous DVD or satellite programming on upstairs and downstairs TVs, or listen to their favorite tunes on stereos in three different rooms--all without wires. They can also use the sender to watch live video from a camcorder or CCD camera in a remote location, whether for security or entertainment purposes. Users who edit video or capture footage from TV programs on their computers will also find plenty to like about the device, as they can easily send the video from their Macs or PCs directly to a living room TV for viewing.The AVS-5811 comes with a 5.8 GHz wireless transmitter and a receiver with four selectable channels. Unlike more common 2.4 GHz transmitters, the AVS-5811 doesn't share a band with Bluetooth devices, cordless phones, 801.11b wireless LAN networks, and microwave ovens, ensuring a sharp, interference-free video signal. The four channels are also a bonus, as it lets users set up multiple transmitters and receivers in the same area without cross-channel noisiness. In addition, the sender includes a built-in IR remote extender that controls components from a distance, so a user can mute the bedroom TV while relaxing on the living room sofa, for instance. The sender features an NTSC/PAL video system and transmits to distances as great as 400 feet without obstructions. It's also relatively compact at 6.5 by 4.13 by 10.5 inches (W x H x D).What's in the BoxTransmitter, receiver, two A/V RCA cables, two AC power adapters, IR mouse (remote extender), user's manual."}