{"asin": "B000ZK7ZOE", "description": "From game developer Sucker Punch, creators of the award-winningSly Cooperseries, and publisher Sony comesinFAMOUS. The first open-world title exclusively for the PlayStation 3,infamousis a single player action/adventure that places you in the role of once regular guy, Cole, who in the aftermath of a horrific catastrophe finds himself not only alive, but developing a fantastic array of superpowers. Going from ordinary to extraordinary overnight isn't something to take lightly. With these powers does one exact revenge? Protect the innocent? Or perhaps, dabble in a little of both? The choice is yours ininfamous.caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Everyman turned superhero Cole.View larger.Devastating electricity-based powers.View larger.Go anywhere open-world design.View larger.An organic urban environment.View larger.StoryEmpire City was a run of the mill metropolis, until one day a massive explosion rips through six square blocks of its bustling downtown real-estate, seemingly leveling everything and everyone in its path. Yet after the dust had cleared, at the center of the blast crater is a lone man, Cole. He is in a coma, but has survived the event and neither he nor the world will ever be the same.An everyday guy doing his best to make ends meet, Cole had been a bike messenger. Just before the blast he had been sent to ground zero to deliver a package. In the aftermath of the catastrophe, he awakes to find that somehow he has gained strange electrical powers. Empire City is in shambles though. Riots have erupted, breeding chaos and emboldening powerful criminal gangs hungry for power and profit. In the panic that follows the city is quarantined from the mainland, and television broadcasts packed with damning security camera footage link Cole to the scene of the explosion. Cole is now a wanted man, but his extraordinary electricity-based powers and perhaps a semblance of responsibility for the well-being of Empire City are growing. Who is really responsible for the blast though? As an evolving mystery unfolds, Cole must learn how to wield his newfound powers as he searches for the real culprits behind the blast in an attempt to rescue Empire City from complete anarchy.GameplayBuilt around open-world gameplay where the player decides how to deal with both criminal gangs bent on destruction and devastated citizens who need help, action ininfamouscontains the standard mix of mission play, in which players are given specific goals and activities to meet, and free play scenarios, where you can wander Empire City doing what they will. In both, developing and learning to control Cole's electricity-based powers is crucial. Cole can not actually generate energy, so these powers are based on energy manipulation instead. This manipulation comes in three basic forms: discharge of energy at living or inanimate targets in either diffused or precise bursts; generation of energy shields used as protection against the weapons or special powers of enemies; and the infusion of objects with time-delayed destructive energy for use as grenades or mines. As impressive as these powers are they do have drawbacks though. Because electricity can cause combustion, Cole can not wield firearms and can be hurt by items he blows up. Also, like anything electrically driven, his abilities require a power source. In the damaged, but not destroyed Empire City, these sources can be found throughout the gameplay area, but players must note that certain actions drain energy faster than others and that enemies will become aware of your need of a power source as the game proceeds and accordingly attempt to destroy those sources.This need for power also provides a major illustration of the game's morality system. As battles rage throughout the gameplay area and power sources become either scarce or destroyed, Cole is faced with the ethics of his 'bio-draw' ability. Through this he can harvest electrical energy from living organisms. This will provide the energy needed to survive in a pinch, but may also have consequences as to how the game develops over both the short and long-term. In addition to this, players will also face similar game-changing choices in dealing with more casual scenarios involving the citizens of Empire City. As well intentioned as a hero may be, in many cases he is just as likely to be hated as he is to be praised. Choice is the deciding factor in this, and that resides squarely on the shoulders of players ininfamousKey Game Features:Be a Hero- Take on the role of Cole, an everyday guy and urban explorer, who develops a wide range of electricity-based powers. Learn how to adapt to Cole&rsquo;s evolving powers in an attempt to save Empire City and its people.Super Powers- Feel what it is like to discover, grow and use a wide range of electricity-based super powers (good or bad); and grasp the responsibility that comes from being so powerful.Epic Battles- Experience what it is like to be a true hero, taking responsibility for every action, as players battle against powerful iconic villains.Open Dynamic World- Coupling rich powers with a reactive environment and population, experience complete freedom to explore a deep, open interactive city. Players will be challenged to decide if they choose to save or destroy Empire City.Urban Exploration- Scale the cityscape to discover new vantage points and employ a vertical combat system. Utilize Cole&rsquo;s climbing skills to go where most people can not, opening up a variety of offensive and defensive combat options.Organic City Ecology- Watch the citizens and city react and evolve depending on players&rsquo; actions. Events will unfold based on the role players take in them, creating broader reactions in the city&rsquo;s people and environment.", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/61EKPmB1JxL._SY300_.jpg", "related": {"also_bought": ["B002I0GX88", "B000UW21A0", "B001JKTC9A", "B000WQWPP0", "B000JLIXIG", "B002I0F5I2", "B004EQCCI4", "B000ZK9QCS", "B001SGZL2W", "B0012N3T3Y", "B008CP6RUW", "B004FUI84G", "B008CP6MA2", "B005C2D1YI", "B000HKP88C", "B002ELCUUG", "B0055202HE", "B000FQBF1M", "B000X1TC0U", "B0050SXX88", "B000P46NMA", "B002NN7AKU", "B005YR308S", "B002I0J5UQ", "B003O6E67A", "B0050SXLQC", "B000FQ2D5E", "B007CM0K86", "B00198PO5I", "B0050SX7BQ", "B0050SXFKE", "B006JKAS16", "B007TYC8MI", "B004FYJFNA", "B001D7T2VC", "B0012N5MIO", "B00269DX5W", "B00309XHD0", "B003O6E6NE", "B000UC5ML0", "B002I0J5FG", "B007SRM5U6", "B002I0J6DC", "B001B1W3GG", "B003O680RM", "B000FQ2DTA", "B0088I7L76", "B00BMFIXKQ", "B002EE1P2W", "B0050SWUTQ", "B0076ZQSFI", "B002I0F5M8", "B0050SWZHS", "B002I0K5NC", "B002I0K6DG", "B005185SDA", "B002I0H2G0", "B0012N94WO", "B008XMSR6G", "B004NRN5EO", "B002CZ38KA", "B002I0J5YW", "B005N4HBIW", "B00170823O", "B0050SX9VO", "B002I0J4VQ", "B0022TNO7I", "B008PQU3E4", "B0055L9BFO", "B0050SXVK8", "B002I0J82G", "B003L8DXOI", "B007XVTR5S", "B009JBFF9C", "B001E8VB6O", "B005DVAB0A", "B004P7VGF2", "B004HYK8Y8", "B003VUO6H4", "B004J6I0YO", "B0036FDHT2", "B00C7103DO", "B001NIP3EG", "B008CP6RWU", "B00275A7LI", "B003O6E1JS", "B003P9FRGA", "B00319DX4M", "B00B59L9T6", "B003JVCA9Q", "B001NX6GBK", "B00503E9FY", "B001ASJIS6", "B002EZH804", "B001IK5TJI", "B002ZJNWWC", "B009GZX49Y", "B007A7UJ4S", "B003O6EDSM", "B0050SXI6K"], "bought_together": ["B002I0GX88"], "buy_after_viewing": ["B008CP6Q6M", "B002I0GX88", "B000UW21A0", "B0055202HE"]}, "salesRank": {"Video Games": 1288}, "categories": [["Video Games", "PlayStation 3", "Games"]]}