{"asin": "B001CEYYFK", "description": "For those who need the fastest wireless connection, the Belkin N+ Router will have you flying down the fast lane. Thanks to the 802.11n Draft 2.0 technology that provides up to 300 Mbps of data throughput, and a wide variety of high-performance features, the N+ Router is the ideal choice for demanding Internet users..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The Belkin N+ Router:Supports latest 802.11n Draft 2.0 technology for speed up to 300 Mbps.Uses smart MIMO antenna technology for extended range.Features built-in USB port for connecting storage devices.Is backwards compatible with older wireless networks.Connect your desktop or notebook to a network wirelessly at speeds up to 300 Mbps.View larger.Compatible with 802.11n Draft 2.0 for Incredible PerformanceUsing the latest, 802.11n Draft 2.0 technology, the N+ router offers outstanding range thanks to smart MIMO (multiple-input and multiple-output) technology. This router offers enough range to easily cover most homes or office spaces.With data throughput of up to 300 Mbps, the N+ Router can handle media-intensive applications that take up large amounts of your bandwidth. The router will easily handle high-demand network activity such as streaming music and HD video, playing games online, downloading large files, and making Internet phone calls, all without hiccups or slowdowns.If even this isn't fast enough, the N+ router also has four gigabit Ethernet ports for ultra-fast wired connections.Backwards Compatibility for Ultra ConvenienceThe N+ router is backwards compatible with all Wireless-G and 802.11b networks and devices, which means that you can continue to use your current computers and peripherals that are on the older standards.Keep Your Network Safe and PrivateWith support for Wi-Fi Protected Security, you can ensure that your wireless network is safe and secure with a single button push. In addition to Wi-Fi Protected Security, the N+ router also supports 256-bit WPA/WPA2-Personal, and 64-bit and 128-bit WEP encryption to ensure that your data is protected.Easily Share Storage with Your Whole NetworkThe router features a USB port that allows you to connect a USB storage device, such as a hard drive or thumb drive, and share its contents with all the computers on the network. With an attached storage device, you can store music, videos, and photos in a central location for everyone on the network to share and access.Elegant, Informative DesignFeaturing an elegant and smart vertical design, the N+ Router saves space and looks good on your desk. LED icons let you know at a glance the status of the connection, if security is enabled, if USB storage is being accessed, and other useful information. There's also a \"Download Speedmeter\" Bar of LEDs that constantly measures the download speed of your network.The Belkin N+ Router is backed by a 1-year warranty and includes free 24/7 technical support.Winner of the CNET Editors' Choice AwardWhat's in the BoxN+ Wireless Router, quick installation guide, user manual on CD-ROM, power supply, Ethernet cable.There's enough bandwidth for video and music streaming, gaming, and other network heavy applications.", "title": "Belkin Wireless N Router (Black)", "price": 60.99, "imUrl": "http://ecx.images-amazon.com/images/I/312H7K8zRVL._SY300_.jpg", "related": {"also_viewed": ["B006TZM6XO", "B001CNCQO2", "B004N625AA", "B003ESQ77A", "B008BGYJSO", "B0050SLU6K", "B004N6259Q", "B005CUVPMK", "B005DIPWFC", "B006SVV6HG", "B004N625AK", "B004N6259G", "B0049YQVHE", "B0045HHTGW", "B001CN9K6E", "B004N625A0", "B006QB1RPY", "B0052UQYZI", "B004T9RR6I", "B001UI4RTG", "B002HWRJY4", "B004T9RR4A", "B001FWYGJS", "B0041LYY6K", "B008HO9DK4", "B0088CJT4U", "B0098QV038", "B008RV51EE", "B00B0CQCCC", "B005SAKW7S", "B003CJTNJ0", "B007IL6OR2", "B004T9RR7C", "B003Y5RYNY", "B0045HG53K", "B007KZQMO6", "B004U6NS5Y", "B001CN7EQ2", "B008982LD4", "B00BUSDVBQ", "B00008ZPJU", "B002YLAUU8", "B007FECGS8", "B000BTL0OA", "B008PV5LJQ", "B008ABOJKS", "B007IL72CI", "B00DWFPDNO", "B000U78XOS", "B0081TXJ28", "B00BJMZAUS", "B001AZP8EW", "B00KFD0O9E", "B008982LFW", "B00C4OAPBE", "B00BHJWBEQ", "B000LIFB7S", "B00A3YN0Z0", "B001V72S06"], "buy_after_viewing": ["B00A3YN0Z0", "B006QB1RPY", "B0049YQVHE", "B006TZM6XO"]}, "categories": [["Electronics", "Computers & Accessories", "Routers"]]}