{"asin": "B000MW3YE0", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The DMC-TZ3 boasts 7.2 megapixels and a large, 3.0-inch LCD, and goes a step beyond their predecessor by featuring a 28mm wide-angle Leica DC Vario-Elmar lens. While the 10x zoom lets you take close-up shots even when you cannot move closer to your subject, the wide-angle lens is helpful in situations where you cannot step back or move away from the subject. With the TZ3, you can capture portraits of people with expansive scenery or large structures in the background, and you can zoom in or out to magnify a distant subject when desired.Able to shoot from 28mm at the wide end to 280mm telephoto, this fit-in-your-pocket camera is fully equipped for any photo shooting situations you are likely to encounter on a journey. The TZ3 also incorporate the Intelligent Image Stabilization system, which comprises two features, Mega O.I.S. (Optical Image Stabilizer) and Intelligent ISO Control, that together make it easy to capture beautiful photos every time you shoot. Mega O.I.S. compensates for the effects of hand-shake, making it possible to capture clear, crisp photos indoors, at night, or when taking macro close-ups or using high-powered zooming -- situations in which hand-shake is most likely to be a problem. Even Mega O.I.S., however, cannot suppress the motion blur caused by a subject moving as the photo is being snapped. That's where Intelligent ISO Control comes in. In this system, the camera's Venus Engine III image-processing engine detects whether the subject is moving and, as necessary, raises the ISO setting and shutter speed according to how fast the subject is moving and the light conditions. This happens automatically, so you can shoot without the bother of adjusting settings every time conditions change. Lumix and its powerful Intelligent Image Stabilization system do all the work for you. You enjoy easy, trouble-free shooting in any situation and get the satisfaction that comes with capturing clear, beautiful images.Panasonic's Extended Optical Zoom function provides additional magnification to 15x when taking photos with 3-megapixel resolution. Also, the multi-aspect-capable CCD provides a larger recording area than ordinary 7.2-megapixel cameras, making it possible to capture images from 28mm to 280mm with any of three aspect ratios -- 4:3, 3:2 or 16:9.Other features that improve usability and convenience include a Clipboard function that holds information, several new scene modes, and a Direct Print feature that allows quick, easy printouts. Also, the lens cap is now built into the camera itself and serves as an automatic protective barrier. Around 12.7 MB of built-in memory is provided, and the camera is compatible with large-capacity SDHC memory cards. Battery life has been extended, with the result that the TZ3 can take around 270 shots on a single charge (CIPA). Add these features up, and you can see why the DMC-TZ3 is perfect for capturing images you'll want to remember forever, such as the people you meet and places you visit on a trip.DMC-TZ3 Highlights28mm wide-angle Leica DC lens and 10x optical zoom in a compact, stylish bodyThe 7.2-megapixel DMC-TZ3 packages a 28mm wide-angle Leica DC Vario-Elmar lens with 10x optical zoom into a stylish, compact body. Comprising 11 elements in nine groups, including an ED (extra-low dispersion) lens and three aspherical lenses, this advanced lens unit passes Leica's stringent standards and delivers an exceptional optical performance. The 28mm wide-angle lens makes it easy to fit the whole group into a photo indoors or to capture dynamic wide-perspective shots of a sweeping landscape or large architectural structure. Further, in 3-megapixel resolution mode, the Extended Optical Zoom function provides additional magnification, extending the zoom power from 10x to 15x by using the center part of the CCD. Using this feature in combination with the 4x digital zoom provides a total zoom factor of up to 60x.Intelligent Image Stabilization: Mega O.I.S. for hand-shake, plus Intelligent ISO Control for motion blurPanasonic drew on its cutting-edge lens technology to invent Mega O.I.S. (Optical Image Stabilizer), an optical image stabilizer that prevents blurring from shaky hands -- the leading cause of blurry images. In Panasonic's Mega O.I.S., sensors act at a frequency of 4,000 times per second to accurately detect even slight camera movement, such as from unsteady hands, and a corrective lens in the O.I.S. lens unit is shifted to compensate. With Mega O.I.S., it is easier than ever to capture clear, sharp, beautiful images when shooting telephoto shots, indoor portraits, illuminated night scenes or even the scenery you see from a train window.While hand-shake is the single biggest cause of blurry images, it is not the only one. Another problem is the motion blur that can occur when a subject moves as the shot is being snapped. Incorporating Panasonic's Intelligent ISO Control, Lumix cameras are the first in the world to fight motion blur. This system detects whether or not the subject is moving. If it is, the system automatically raises the ISO setting accordingly, allowing the camera to shoot at a higher shutter speed. If the subject is not moving, the camera shoots at a low ISO setting and captures beautiful, natural-looking images. Intelligent ISO Control is included as one of the corrections in certain scene modes used to shoot subjects that are often moving, such as Sports, Baby and the newly added Pet mode. Simply select the mode that best suits the subject, and Intelligent ISO Control provides the optimal corrections, making it easy to capture crisp, clear photos.With Intelligent Image Stabilization -- Mega O.I.S. to compensate for hand-shake plus Intelligent ISO Control to prevent motion blur -- Panasonic has taken image stabilization a leap forward and equipped the new Lumix TZ3 with the industry's most advanced countermeasures against blurring.High-quality, high-performance image-processing LSI: Venus Engine IIIThe TZ3 features the Venus Engine III, Panasonic's advanced image-processing engine that can record at a sensitivity setting as high as ISO 1250 with full resolution. Noise reduction is also greatly improved, with picture noise removed in stages during image processing. First, critical noise is roughly undraped and chromatic noise and luminance noise are separated. The chromatic noise, which has a greater effect on picture quality, is then selectively suppressed to a substantial degree.With its multi-task image-processing capability, the Venus Engine III also boasts outstanding response time. Shutter release time lag is as short as 0.006 second and the shutter interval is as short as 0.5 second. This fast response makes it easy to capture sudden, spur-of-the-moment shots. In burst shooting mode, the TZ3 can fire off three shots per second at full resolution. Both models also allow unlimited consecutive shooting -- you can continue snapping shots until the SDHC/SD memory card is full. Thanks to the energy-efficient Venus Engine III imaging engine, the TZ3 offers a long battery life despite its large, bright LCD. The TZ3 can also take around 270 shots (CIPA) on a single battery charge.Capture up to 3 frames per second in burst mode28mm wide-angle with multiple aspect ratiosConventional cameras generally use almost the entire CCD area when recording an image, and the angle of view may be altered regardless of the photographer's intention. The TZ3, however, incorporates a 1/2.35-inch CCD with a total of 8.50 megapixels. This CCD, which is larger than those in conventional 7-megapixel class cameras, can reproduce images shot with the lens set from 28mm to 280mm in any of three aspect ratios -- 4:3, 3:2 or 16:9 -- so you can always capture dynamic, richly expressive shots with a wide perspective.Large 3.0-inch LCD with advanced features for easy shooting and playbackThe TZ3 boasts a large, easy-to-see 3.0-inch LCD with outstanding 230,000-pixel resolution. Taking advantage of its big screen and high resolution, the TZ3 provides a dual image playback feature that lets you display two images at the same time, one above the other, and compare them. Also, to make image playback more entertaining, the TZ3 offers an amusing new Slide Change Effect feature in place of the monotonous frame-by-frame advance.Dual image playback displays two images at onceAlso, the pixel-mixed readout method used by the CCD automatically increases the brightness of the live image on the LCD, making it much easier to shoot in low lighting. Thanks to the Power LCD function, which boosts the LCD backlighting by 40 percent, even shooting outdoors in bright sunshine is no longer a problem. The High Angle mode, which can be accessed quickly and easily via a dedicated button, makes the LCD screen extremely easy to view when the camera is held high, such as to shoot over a crowd.Record clear, bright, wide-aspect VGA motion images -- ideal for widescreen viewingIn addition to recording standard VGA (640 x 480) motion images at 30 frames per second, the TZ3 can record stunning wide-aspect VGA (848 x 480) motion images at 30 frames per second. These 16:9 motion images look extremely impressive on a wide-screen TV. The pixel-mixed readout method used by the CCD enhances image brightness, so the pictures you see are clear, bright and beautiful.The TZ3 also offers an exceptional function that lets you select and display thumbnails of nine sequential frames from a motion image. This would be useful, for example, to analyze the way you swing a golf club or tennis racquet.A variety of features for the perfect travel companion In addition to outstanding basic specifications, a host of traveller-friendly functions make the TZ3 the ideal travel companion. The camera body has been reduced in size to be more stylish and compact, and the lens cap is now incorporated into the body as a built-in automatic lens barrier.The TZ3 also offers a new Clipboard function that lets you use the camera to hold and retrieve useful information on a trip. For example, you can quickly and easily take shots of a map or train schedule, and view them when needed. A wide variety of scene modes, including the new Pet and Sunset modes, also make it easy to get beautiful photos in a range of photographic situations. When used with the optional marine case housing, Underwater mode allows underwater shooting with optimal automatic settings that capture subjects and the surrounding water in beautifully natural colors.Other great travelling features include the Travel Date Setting, which, once you have preset the date of your departure, records and displays the images in chronological order of your trip, and the World Time Setting, which lets you set the times and dates for 74 locations around the world.The fun continues even when the shooting is doneWith the TZ3, the enjoyment of photography doesn't end when you're done shooting for the day. One additional function that broadens the fun of photography is Direct Print mode. To select it, simply turn the mode dial on the camera top. Then use a USB cable to connect the camera to a Pictbridge-compatible printer, and you're ready to print beautiful photos. Print all the images you shot or only your favorites, and make one copy or multiple copies as you wish. When you turn the mode dial, the mode selected is indicated on the LCD. This lets you change the mode to recording, playback or direct printing without taking your eyes off the subject.Also interesting is the new Date Stamp function. In addition to showing the date a photo was taken, the TZ3 can show on which day of the trip a photo was taken. They can also stamp your baby's age in months on a photo, after you've taken the shots. These dates, which can be helpful when making a photo album, can be stamped on photos whether you print them yourself at home or have a photo shop do them.", "title": "Panasonic Lumix DMC-TZ3K 7.2MP Digital Camera with 10x Optical Image Stabilized Zoom (Black)", "price": 9.99, "salesRank": {"Camera &amp; Photo": 2909}, "imUrl": "http://ecx.images-amazon.com/images/I/41V9ne5uwRL._SX300_.jpg", "related": {"also_viewed": ["B0011Z8CCG", "B001QFZMCO", "B004HW7KC8", "B00728Z8U0", "B00ATE7SZM", "B00ATE7TIS", "B004KKZ0HY", "B004NBZ8DQ", "B00395WIXA", "B001O1GEU4", "B00814CAS2", "B000F1TD2A", "B00728Z8TG", "B001QFZM6U", "B00695S8VS", "B00728ZAFS", "B00B46XLT6", "B00728ZAHG", "B006ZAHMWI", "B00728Z9M2", "B00728ZBA2", "B0011Z44KA", "B000E18BTM", "B00C7NX3MK", "B00ATE7W0I", "B000MWVMRG", "B0012Y6AY8", "B00728Z9JA", "B000GHULTM", "B004HW73QG", "B000RERSXG", "B0007WIC1K", "B00B46XLTG", "B00ATE7W7G", "B00JWVILUY", "B001CCLBSA", "B006ZAHN8Q", "B00C7NX884", "B0002J6M6A"], "buy_after_viewing": ["B003VNKNEQ", "B000F1TD2A", "B00728ZBA2", "B005HNF01O"]}}