{"asin": "B0048L62I6", "categories": [["Electronics", "Computers & Accessories", "Data Storage", "Network Attached Storage"]], "description": "LinkStation Pro&trade; DuoShared Network StorageLS-WVL/R1High Speed Shared StorageDual Drive RAID NASQuick Swap Hard DrivesActive Directory SupportNovaBACKUP&reg; IncludedFree WebAccess ServiceAccess Data with iOS AppsMultimedia ServerBitTorrent&reg; DownloaderLinkStation Pro Duo LS-WVL/R1 RAID Network Attached Storage hard drive array offers instant storage expansion and file access on your home or  home office network and over the Internet. Twice as fast as a standard NAS, LS-WVL  features a high-speed, 1.6 GHz processor with DDR3 for maximum  transfer speeds up to 72 MBps. Plug it into any network Ethernet port or into the back of your wireless router and access it on any networked computer  in your house. While on the go, use Buffalo&rsquo;s free WebAccess service for remote access to your files over the Internet from any standard Web browser,  on select Android&trade; phones and download the free WebAccess i apps from the App Store to access and share files from your iPhone&reg;, iPod touch&reg; and iPad&reg;. Included NovaBACKUP&reg;  Professional software for Windows&reg; and Time Machine&reg; support provide a whole home backup solution for every PC and Mac&reg; on your network. LinkStation  Pro Duo makes central storage and backup easy.Network Attached StorageConnect LinkStation Pro Duo to any Ethernet port or to the back of your wireless router and instantly access storage from any computer on the network.  Store or back up digital photos, MP3s and documents on one hard drive and access it from any computer simultaneously.Shared folders can be accessed by everyone on the networkProtect private folders and files from unauthorized accessBack up every computer on your home network to one location2-Drive RAID StorageLinkStation Pro Duo features two hard drives configured in RAID 1 Mirroring. It provides automatic and continuous data protection as  data is mirrored onto both drives, protecting data in the event of a drive failure. If a drive fails, simply replace the failed hard drive  and the RAID 1 mirror will automatically rebuild. LinkStation Pro Duo can also be configured in RAID 0 Striping mode, combining both hard  drives into a single, large capacity and high performance data volume offering maximum capacity. In RAID 0, if a single hard drive failure  occurs, all data is lost.High SpeedOptimized for maximum transfer speed, LinkStation Pro Duo utilizes an upgraded processor and RAM, offering greater than 2X the data transfer  speed of competing devices.1.6 GHz processor speedDDR3 RAMTransfer speeds up to 72 MB/sWhole Home BackupFive copies of NovaBACKUP Professional for Windows and a built-in Time Machine Server allow for back up of all PCs and Mac computers in your  home to a central, always available storage device. Put an end to moving USB drives between multiple computers.Free WebAccess ServiceAccess and share your files quickly and securely from anywhere over the Internet with a standard Web browser and on select Android phones.   BuffaloNAS.com makes sharing and accessing remote files easy. It even resizes your photos for optimized streaming over the Internet.  WebAccess  also accommodates mobile devices including Apple mobile devices and some Android phones by using a specially formatted version of WebAccess.Access Data From Your iPod touch, iPhone or iPadFree Buffalo WebAccess i apps on the Apple App Store allow you to access your LinkStation and those of friends and family. Upload photos  and videos to an authorized LinkStation or access terabytes of multimedia files and documents directly from your Apple mobile device or a computer.Multimedia ServerAn integrated DLNA Certified&trade; server streams multimedia content to any DNLA or uPnP A/V media playback device such as PS3&trade;, Xbox 360&reg;, many  network enabled TVs, digital photo frames, etc.BitTorrent&reg; DownloaderPowered by the leading BitTorrent client, uTorrent, LinkStation Pro Duo can download any BitTorrent files automatically without your computer running.   Simply paste a torrent URL into the LinkStation uTorrent application and then shut down your computer.Key Features and Benefits:Shared Storage:Store or back up files from multiple PCs, laptops or Mac computers in one central locationRAID 0 and RAID 1 Support:Get maximum reliability with automatic data mirroring in RAID 1 or maximum storage with two striped hard drives in RAID 0Quick Swap Drives:Easily accessible drives for quick replacementSilent Operation:Noiseless fan design ensures reliable and silent operationActive Directory Support:Join to an existing Active Directory Domain for Windows user authentication and folder level permissionsFree WebAccess and WebAccess i apps for iPod touch, iPhone and iPad:Access and share your photos, music, videos or data files with friends, family and colleagues over the Internet with any standard Web browser or on your iPod touch, iPhone or iPad for free.DLNA Certified and iTunes&reg; Servers:Stream content directly to any DLNA compatible media player or use LinkStation Pro as a content source from within your iTunes applicationBitTorrent Client:Download digital content over the Internet directly to your LinkStation Pro DuoNovaBACKUP Professional:Includes an easy-to-use, complete backup solution for up to 5 of your home and home office Windows PCsTime Machine Compatibility:Use the LinkStation Pro Duo with Time Machine backupUSB 2.0 Port:Attach a printer to the network, add a USB hard drive for additional storage or backup or connect to a UPS for AC power failure managementECO-Minded:With the power savings feature, you regulate the power usage of your LinkStation at predetermined times, shutting the unit down and reducing energy consumptionNo Annual or Monthly Fees:Free to use features and services, including WebAccess with iPhone and iPad support, or to add multiple users and groupsNetwork Servers:FTP and print servers included with the firmwareDirect Copy:Plug in your USB hard drive or camera to quickly offload picturesFree 24/7 Tech Support:US-based tech supportBuffalo&rsquo;s LinkStation Pro Duo LS-WVL/R1 is backed by a one-year limited warranty and lifetime 24/7 US based technical support.What's in the BoxLinkStation Pro Duo LS-WVL/R1, Setup CD-ROM, Quick-Setup Guide, Ethernet Cable, AC Adapter, Warranty Statement", "title": "BUFFALO LinkStation Pro Duo 2-Bay 2 TB (2 x 1 TB) RAID High Performance Network Attached Storage (NAS) - LS-WV2.0TL/R1", "price": 311.82, "imUrl": "http://ecx.images-amazon.com/images/I/41YccbZVJ8L._SY300_.jpg", "brand": "Buffalo Technology", "related": {"also_bought": ["B008I64BWQ", "B00365MF5E", "B0000BVYT3", "B0042TW3J6", "B0019804U8", "B001QUA6RA", "B001985SWW", "B008I64BIK", "B004GHMU60", "B004XXMUCQ", "B00008AWL3", "B00H09BOXQ", "B003Y24DEU"], "bought_together": ["B008I64BWQ"], "buy_after_viewing": ["B00365MF5E", "B008JJLZ7G", "B008JJLW4M", "B00CO0DE0W"]}}