{"asin": "B003VUO6H4", "description": "The fourth generation of hardware released for the PlayStation 3 entertainment platform, the PlayStation 3 160GB system is the next stage in the evolution of Sony's console gaming powerhouse. Loaded with a mix of multimedia features and functions available on earlier PlayStation 3 models, as well as a series of new advancements and refinements, the PlayStation 3 160GB system is destined to push the envelope in the realm of Next-Generation entertainment..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }What's Under the HoodAs with previous models, the PlayStation 3 160GB system features an IBM \"Cell\" processor and a co-developed NVIDIA graphics processor that together allow the system to perform two trillion calculations per second. Yet the 160GB system manages to improve on this with its 45nm version of the processor, which although running at the same 60+nm speed as previous PS3 versions, uses less energy. This makes the unit's smaller size and quieter fan possible. Along with the traditional AV and composite connections, the 160GB system also boasts an HDMI (High-Definition Multimedia Interface) port, which delivers uncompressed, unconverted digital picture and sound to compatible high-definition TVs and projectors. (The system is capable of 128-bit pixel precision and 1080p resolution for a full HD experience) This console also provides for an extreme sound experience by supporting Dolby Digital 5.1, DTS 5.1, as well as Linear PCM 7.1. Finally, it features cross connectivity with your PC network and PlayStation Portable (PSP) and its pre-installed, 160GB hard disc drive allows you to save games as well as download content from The Internet. Unlike other models of the PlayStation 3, the 160GB system does not offer backwards compatibility.", "price": 27.79, "imUrl": "http://ecx.images-amazon.com/images/I/51Q2xrhtJWL._SX300_.jpg", "related": {"also_bought": ["B008XWCX6Q", "B007M6W3A0", "B002I0H738", "B0015AARJI", "B00GHJ6X8G", "B00CD90R72", "B008I62AYC", "B002I0J4VQ", "B001SGZL2W", "B000Y1MOIQ", "B008P9IO2Y", "B00JQHU9RC", "B002BSA1C6", "B002I0K780", "B003WY86L6", "B004X56PWK", "B0040546HY", "B002GJRQRS", "B006VB2UMI", "B002OLV32M", "B005UI9BT8", "B00AEX81SG", "B008SBZD5U", "B00AY1CT3G", "B00D73DLRQ", "B006JKARN0", "B0083J9T8E", "B002TK3GYG", "B00A750QIE", "B007A7UJ4S", "B0050SWSQQ", "B002GJRQSC", "B002I0K6DG", "B000S0C2UI", "B003O6E3C8", "B00FAQICJ0", "B003V4AK8E", "B000K1CS5Y", "B005T5OBWY", "B00C710AQO", "B001G33V8S", "B007FTE33E", "B003U7WCEM", "B0053OLY9O", "B006JKAS16", "B005ZL5XRO", "B003O6JKLC", "B00D4AK17A"], "bought_together": ["B008XWCX6Q"], "buy_after_viewing": ["B003VUO6LU", "B002I0J4VQ", "B00IA2NYT4", "B00AEX81SG"]}, "salesRank": {"Video Games": 336}, "categories": [["Video Games", "PlayStation 3"]]}