{"asin": "B001ENOZY4", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]], "description": "Fusing 12.3-megapixel image quality inherited from the award-winning D300 with groundbreaking features, the D90's breathtaking, low-noise image quality is further advanced with EXPEED image processing. Split-second shutter response and continuous shooting at up to 4.5 frames-per-second provide the power to capture fast action and precise moments perfectly, while Nikon's exclusive Scene Recognition System contributes to faster 11-area autofocus performance, finer white balance detection and more.,br&gt; The D90 delivers the control passionate photographers demand, utilizing comprehensive exposure functions and the intelligence of 3D Color Matrix Metering II. Stunning results come to life on a 3-inch 920,000-dot color LCD monitor, providing accurate image review, Live View composition and brilliant playback of the D90's cinematic-quality 24-fps HD D-Movie mode.Outfit includes the 5.8x AF-S DX Nikkor 18-105mm f/3.5-5.6G ED lens with VR image stabilization and legendary Nikkor optical quality.Nikon D90 DX Digital SLR HighlightsNikon Digital SLR image qualityThe D90 incorporates a newly developed DX-format CMOS image sensor with technology directly inherited from the D300, Nikon's DX-format flagship. With its 12.3 effective megapixels and extraordinarily high signal-to-noise ratio, the D90 delivers low-noise images with detail and tonal gradation beyond your expectations, while Nikon's Integrated Dust Reduction System works to free image-degrading dust particles from the sensor's optical low-pass filter.Nikon's comprehensive EXPEED technology is engineered to make the most of the sensor's rich, 12.3-megapixel data. The result--color, detail and high-speed processing inspired by the groundbreaking D300. The D90's image-processing engine produces high-resolution pictures at remarkable speeds, better enabling high-speed continuous shooting. EXPEED also contributes to the outstanding performance of other powerful features, including Live View and the new Face Detection System.The D90 captures up to 4.5 images per second. Accurate 11-point autofocus is now even faster and more intelligent, aided by Nikon's exclusive Scene Recognition System. The unique Nikon 420-pixel 3D Color Matrix II Metering system, now enhanced by EXPEED image processing technologies, delivers extraordinary exposure accuracy -- immediately evident when reviewing images on the D90's super-density 3-inch 920,000-dot color LCD monitor.New D-Movie Mode Features 720p HD cinematic qualityA new idea for D-SLRs, the D90 offers a movie function, allowing you to shoot movies in three different motion JPEG formats: 320 x 216 pixels, 640 x 424 pixels and 1,280 x 720 pixels. Now you can capture life's moving moments with added drama by using many of Nikon's NIKKOR lenses, including the AF DX Fisheye 10.5mm f/2.8G ED and the Micro-NIKKOR lenses. The shallow depth of field can give your movies a more creative and emotional impact. An additional benefit is the D90 image sensor, which is much larger than a typical camcorder for higher image quality and exceptional high ISO performance during low-light shooting.5.8x AF-S DX Nikkor 18-105mm f/3.5-5.6G ED VR includedFamous Nikkor optical quality in a compact, versatile design, featuring Nikon VR image stabilization.Continuous shooting as fast as 4.5 frames-per-secondThe D90 captures crucial moments thanks to its impressive 0.15-second start-up time, 65-millisecond shutter-release time lag (CIPA standard) and ability to shoot at 4.5 frames a second for up to 100 shots*.Low noise ISO sensitivity from 200 to 3200The D90 gives you the freedom to shoot in a remarkably wide variety of lighting conditions, including dimly lit scenes, without worrying about image-degrading noise. ISO can be raised as high as Hi 1 (ISO 6400 equivalent) or lowered to Lo 1 (ISO 100 equivalent).3-inch super-density 920,000-dot color LCD monitorThe D90's 3-in., approx. 920k-dot LCD monitor provides unprecedented quality of image display. A wide 170-degree viewing angle makes it easy to confirm focus after shooting or during Live View.Built-in image sensor cleaningEffective 4-frequency, ultrasonic sensor cleaning frees image degrading dust particles from the sensor's optical low pass filter.11-point AF system with Face PriorityThanks to Multi-CAM 1000 autofocus module, the D90's 11-point AF system has fast and precise autofocus coverage across the frame with the most sensitive AF sensor operating from the center.In addition, the D90 has versatile AF-area modes to handle most shooting situations. The center focus point can be switched from normal to wide according to the movement of the subject.One-button Live ViewWith the D90's Live View function, you can shoot effectively without looking through the viewfinder. Simply press dedicated Live View button for instant access. Three contrast-detect AF modes let you focus on any point in the frame.Nikon 3D Color Matrix Metering II with Scene Recognition SystemNikon's renowned 420-pixel RGB 3D Color Matrix Metering II, teamed with the exclusive Scene Recognition System, evaluates images, referencing an on-board database of over 30,000 photographic scenes, for unmatched exposure accuracy.Advance Scene ModesWhen you're not sure which camera settings are appropriate, simply rely on the Advanced Scene Modes. Just turn the mode dial to the appropriate icon: Portrait, Landscape, Close-up, Sports or Night Portrait. Unlike traditional scene modes, the D90 will automatically optimize the exposure, image processing, Active D-Lighting, and Picture Control to get the most out of your subject matter. What's more, the D90 has exceptional low-noise performance and accurately adjusts the camera settings whether VR (Vibration Reduction) is activated or not, so you can expect beautiful, crisp images, even in many low-light scenes.Auto Active D-LightingDetails in the shadows and highlighted areas of your photos are often lost when strong lighting increases the contrast between the bright and dark areas of your image. Nikon's unique Active D-Lighting technology accurately restores these important details by localizing tone control while you shoot. Choose from four levels, including the new Extra High. Active D-Lighting can be used manually or set to Auto mode. It is also possible to bracket your pictures to get one with Active D-Lighting and one without.Durable, high-precision shutterReliability is not a luxury--it's a necessity. That's why Nikon subjected numerous D90 shutter mechanisms to grueling 100,000-cycle shutter-release tests with the unit fully assembled in the camera.Built-in, Pop-up FlashThe D90 is equipped with Nikon's i-TTL flash control, renowned for consistently accurate and balanced flash exposures. The built-in flash has an 18mm lens coverage and works as a wireless commander, controlling up to two independent groups of an unlimited number of remote Speedlights and providing incredible creative lighting control--on location or in the studio.In-camera image editingCreative freedom stems from exclusive in-camera image editing, featuring Fisheye effect, Straighten and Distortion Control as well as D-Lighting, Red-eye Reduction, Image Overlay, Monochrome and more.HDMI CompatibleYou can enjoy both still images and movies shot with the D90 via HDMI (High-Definition Multimedia Interface) with the global-standard digital A/V signal transfer. HDMI Mini connector is employed.GPS geo-taggingThe optional GP-1 GPS unit provides automatic real-time geo-tagging.", "title": "Nikon D90 12.3MP DX-Format CMOS Digital SLR Camera with 18-105 mm f/3.5-5.6G ED AF-S VR DX Nikkor Zoom Lens", "brand": "Nikon", "salesRank": {"Camera &amp; Photo": 1312}, "imUrl": "http://ecx.images-amazon.com/images/I/51whvQ9lrsL._SX300_.jpg", "related": {"also_bought": ["0470457724", "B003QRS8LM", "B0049I48JI", "1933952504", "B005DIYQA4", "B003UVCWLG", "B003VNKNF0", "B00004ZCJK", "1934148644", "B00005LEN4", "B005HBN3R4", "B001VO83A8", "B00CV9ML5U", "B0090Y9OPE", "B00CV9MKU6", "1435458591", "B001TZUS98", "B004KU827O", "B006B2OMEQ", "B000BYCKU8", "B002HZY5GG", "B00CHGRDD2", "B006KXN76A", "B0069R7FFQ", "B000HJ5N2Y", "B0029TZYFQ", "B00007EDZG", "B000A2TEWS", "B00005Y3OM", "B003ZSHNCC", "B00AD7Y1L4", "B002Z8LDXI", "B0049VZ4XE", "B0041PJAJC", "B00301MY14", "B001PNJM8C", "B0029U7PZM", "B0042X9L6A", "B005SN72EQ", "B001EO6W8K", "B000GRHP4G", "B0058OGZIY", "B002VPE1WK", "B009YTVIUE", "B001S2PPT0", "B001GSDONU", "B0000BVDM7", "1598639056", "B003L1ZYZ6", "B00D5NLVBQ", "B004DTXFXS", "B0080JH3YE", "B00208COF4", "B00CV9MLLO", "B005UG3KS8", "B00DC2ZDCI", "B005AFQLQC", "B00005LENO", "B00803F41O", "B004JMZPJG", "B00004ZCFQ", "B005Y1SYDU", "B00064XR64", "B00004ZCJG", "B00D5NU40U", "B0096SZNPE", "B00CV9M6U0", "B00301QKUA", "B001F6TXME", "B0049D7FHK", "B00AA48DVO", "B003VNKNEQ", "B000O161X0", "B006YDTLX4", "B00CF5OHZ2", "B008G19EZC", "B0051G9ZTK", "B002DW99H8", "B000KJQ1DG", "B00007EDY5", "B002DW96M6", "B001G1ZPV6", "B004I59W9I", "B000HJPK2C", "B004DEKH84", "B000EOSHGQ", "B004Y1AYAC", "B0012X43P2", "B003HMPBO8", "B00D8KN15A", "B0012OGF6Q", "B005197472", "B001UE6N88", "B0009GZAGO", "B000ZMCILW", "B003Y30DOS", "B003UV38NW", "B00AD7YI2Q", "B004FN1W2I"], "bought_together": ["B003VNKNF0"], "buy_after_viewing": ["B003VNKNF0", "B007M54E1M", "B005DIYQA4", "B00005LEN4"]}}