{"asin": "B007RTACDM", "description": "Compact light weight USB-to-Wired-Internet Adapter for Android tablets that support Ethernet. Works \"Plug-N-Play\" with Android versions 3.2 and up. There is no installation procedure, and no need to install drivers.  Just plug it in to your Android tablet for wired internet access. Requires a full size USB port on your tablet or on your tablet's docking station. Also works with Micro-OTG or Mini-OTG ports by adding BobjGear OTG adapter cable. Works with Toshiba THRiVE dock and ASUS Transformer keyboard dock.  Works with NetBooks, Notebooks, UltraBooks, MacBook Air Lion and Mountain Lion 10.6 or above. Works with Nexus 7 and 10 1st generation (Not Nexus 7 II). Works with Windows 8 \"x86\" processors (Intel and AMD). Will not work with Windows 8 RT, (i.e. Microsoft Surface type Tablet.)  Works with Samsung's new PRO line of Android Tablets, Tab PRO and Note PRO.  All other models of Samsung Tablets DO NOT support this Ethernet adapter.  Works with Android \"Stick Computers\" such as MK802, MK808 and UG802. Some Sticks may need a powered USB hub.\nCompliant with USB Standards 1.0, 2.0, 3.0.  This adapter is USB powered; no external power needed. \nDrivers included for other than Android.  RoSH, CE, FCC compliant.\n\nEXCEPTIONS: This adapter does not work with Android Phones.  This Adapter will not work if the tablet manufacturers have not included an Ethernet (wired internet) capability in their version of the Android Operating System. For this reason, the following ANDROID tablets can not use this adapter: Nexus 7-II, Samsung Tablets (except PRO series), ACER, Lenovo, Sony, Coby-Kyros. Toshiba models \"Thrive7\", AT200\" (ExciteLE) will not work with this adapter.  This adapter will not work with Windows 8 \"RT\" Version.\n\nThis adapter will not \"Enable\" a tablet that is not configured to work with Ethernet. If you are uncertain if your tablet supports Ethernet, please consult your manufacturer or your applicable web forum.", "title": "BobjGear USB to RJ45 Compact Fast Ethernet Adapter made for Android Tablets; also works with Ultrabooks, Windows, Linux, Mac, ChromeOS, Android TV Sticks MK802, MK808, UG802, UG007, iMito, Favi. EXCEPTIONS listed in Description below. BobjGear One Year Adapter Limited Warranty Included.", "price": 17.99, "imUrl": "http://ecx.images-amazon.com/images/I/31kPaKoXwvL._SX300_.jpg", "related": {"also_bought": ["B00AWL6G8W", "B008L0G1TU", "B0098X39L2", "B00AZR1TG2", "B009XU6N54", "B008N3BTWY", "B00932N46S", "B00AKXE59E", "B009YPYORM", "B00DFEXXPM", "B00CXAC1ZW", "B00BFYH11Q", "B00EOL1BO0", "B00J2N0GB4", "B00EK9OSAA", "B003VSTDFG", "B00GM0OZ4O", "B00DA3V4JK", "B00B4GGW5Q", "B00CR6OVSM", "B005QX7KYU", "B00H3DJAWG", "B00CZ73M5G", "B0059UGY42", "B00484IEJS", "B00007IFED", "B00G10XQCC", "B00CGYAGL6", "B001NLV4TQ", "B007PTCFFW", "B00DSUTG4U", "B00HWMPROS", "B003M0NURK", "B00ECBY5VS", "B00G6ZW5VA", "B00B2166BS", "B000X2QRK2", "B009QZH7BU", "B00ADN6FOO", "B005518J6Q", "B00BVXG3GU", "B00EB70PXA", "B005GGBYJ4", "B00ALSZNLW", "B00BBD7NFU", "B00CFHVVZY", "B009XE6JY0", "B00HWMPSK6", "B005GI2VMG", "B00GNJAYUI", "B005PAINXQ", "B00EZ2E8NO", "B00FWLWKLY", "B00IDV60ZC", "B0054L8N7M", "B004D5RFCE", "B005DKZTMG", "B009SQQF9C", "B00C3YEWTG", "B00C452XFO", "B00CPRVF5K", "B00B9996LA", "B00FGOTC0Y", "B0081TDJAU", "B007X15HKC", "B00E1HIVG8", "B00EAM863M", "B00006RVPW", "B00002EQCS", "B0032IBYXO", "B00HTAH3KY", "B00FGKXY9S", "B001OZOCHW", "B00AQM8586", "B00BALK9CM", "B00EUWT9SS", "B000N99BBC", "B00BWF5U0M", "B00F2BC6UE", "B00DVFLJDS", "B00002EQCW", "B00841AGCO", "B003MTTJOY", "1449596622", "B00ACVI202", "B009X3UW2G", "B003JQL0S8", "B009QZH6JS", "B00425S1H8", "B000FNFSPY", "B00EZL1IQA", "B00H09BOXQ", "B00GU1GPLG", "B00G26XWDI", "B00GTGETFG", "B00CPAAHIS", "B00DU7I75K"], "bought_together": ["B00AWL6G8W", "B008L0G1TU"], "buy_after_viewing": ["B00484IEJS", "B00BBD7NFU", "B003VSTDFG", "B00007IFED"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "USB Flash Drives"]]}