{"asin": "B00166N6SA", "description": "The freedom ofThe Sims 3will inspire you with endless creative possibilities and amuse you with unexpected moments of surprise and mischief. Create millions of unique Sims and control their lives. Customize their appearances and personalities. Build their homes - design everything from exquisitely furnished dream homes to quaint cottages. Then, send your Sims out to explore their ever-changing neighborhood and to meet other Sims in the town center. With all-new quick challenges and rewarding game play,The Sims 3gives you the freedom to choose whether (or not) to fulfill your Sims' destinies and make their wishes come true.Create like never before.New seamless neighborhoods.View larger.New create a Sim and personalities.View larger.Extreme home customization.View larger.Key Game Features:New Seamless, Living NeighborhoodExplore the ever-changing neighborhood&mdash;and take your Sims to meet friends in the park, go on a date at the bistro, visit neighbors&rsquo; homes, converse with less-than-savory characters in the graveyard and more. Who knows what might happen?Admire the natural beauty of the beach, the mountains, and more.New Create a Sim FunctionalityCreate any Sim you can imagine with easy-to-use design tools that allow for unlimited customization of facial features, hair color, eye color, and more.Fine tune your Sims&rsquo; body shape from thin to curvy to muscular.New Personality TraitsCreate over a million different personalities with traits such as evil, insane, kleptomaniac, romantic, and more.Influence the behaviors of your Sims with the traits you&rsquo;ve chosen. Will you create a neurotic romantic with a heart of gold, or a geeky super-genius with an evil streak?New Unlimited CustomizationEveryone can customize everything&mdash;design and build your dream house and decorate it to fit your Sims&rsquo; personalities.Customize everything from floors to d&eacute;cor, shirts to sofas, wallpaper to window shades.New Gameplay That&rsquo;s Rewarding and QuickFace short and long-term challenges and reap the rewards.Your Sims can pursue random opportunities to get fast cash, get ahead, get even, and more.Choose whether, or not, to fulfill your Sims&rsquo; destinies by making their wishes come true. Will your Sims be thieves, rock stars, world leaders? The choice is yours.Get Connected and Share Your Creations withThe Sims 3Online CommunityGet free bonus content&mdash;download Sims, outfits, furnishings, houses and more.Create and Share Sims, houses, movies and more with anyone.JoinThe Sims 3community to share ideas with fans ofThe Simsfrom around the world.System Requirements:Minimum Specifications:OS:Windows Vista (SP1)/Windows XP (SP2)Mac OS X 10.5.7 Leopard or higherProcessor:Vista - 2.4 GHz P4 or equivalent/XP - 2.0 GHz P4 or equivalentIntel Core Duo ProcessorRAM:Vista - 1.5 GB/XP - 1GB2GBDisc Drive:8x DVD ROM or faster8x DVD ROM or fasterHard Drive:Vista &amp; XP - 8 GB or moreAt least 6.1 GB of hard drive space, with at least 1 GB additional space for custom content and saved games.Video Card:128 MB Video Card with support for Pixel Shader 2.0. Supported video cards include: NVIDIA GeForce FX 5900, FX 5950, 6200, 6500, 6600, 6800, 7200, 7300, 7600, 7800, 7900, 7950, 8400, 8500, 8600, 8800, 9600, 9800, GTX 260, GTX 280 (GeForce FX unsupported under Vista); ATI Radeon 9500, 9600, 9800, X300, X600, X700, X800, X850, X1300, X1600, X1800, X1900, X1950, 2400, 2600, 2900, 3450, 3650, 3850, 3870, 4850, 4870; Intel Extreme Graphics GMA X3x00 series.ATI X1600 or Nvidia 7300 GT with 128 MB of Video RAM, or Intel Integrated GMA X3100.Other:Laptop versions of chipsets above may work, but may run comparatively slower.* This game will not run on PowerPC (G3/G4/G5) based Mac systems, or the GMA 950 class of integrated video cards.", "price": 18.99, "imUrl": "http://ecx.images-amazon.com/images/I/51cPdrVL51L._SY300_.jpg", "related": {"also_bought": ["B0054IV0A2", "B004UJNN5G", "B008AT68UE", "B00BGGIWZM", "B00A39IEMY", "B008QLUTHO", "B00C4PCCL4", "B003WU3CDW", "B003AMOK9M", "B002NILFB0", "B00CTKHYEE", "B006FBFNBE", "B002WF12XK", "B003TS6Q8A", "B006VB2UQ4", "B00C0K4YL4", "B006D3JT0U", "B002I0KOLA", "B001444IN6", "B0050SYZX0", "1476797455", "B00000K4MC", "B00009WNZA", "B001BZ2F56", "B00CW3E87Y", "B001AIR1F8", "B000KQQUMQ", "B000O5DY0E", "B000FKBCX4", "B00077VDS4", "B002SMJ414", "B003KM98NK", "B002IAX4PI", "B00CBM1PF4", "B0012DPHKW", "B002WVBEH8", "B00EFRN2IQ", "B008MO6AQO", "B004X56OU8", "B003KM38EK", "B00EFRN2KY", "B0027C8M8G", "B00503E8S2", "B002QHDKE8", "B001EWNEC4", "B000FRU1UM", "B0009A4EVM", "B001PIY49O", "B00DBV28TG", "B001CDEUBO"], "bought_together": ["B0054IV0A2", "B00BGGIWZM"], "buy_after_viewing": ["B0054IV0A2", "B00BGGIWZM", "B00C4PCCL4", "B008AT68UE"]}, "salesRank": {"Video Games": 351}, "categories": [["Video Games", "PC"]]}