{"asin": "B00322PYZO", "description": "Eee PC 1005PE-PThe 10.1-inch Eee PC 1005PE-P Seashell with Windows 7 Starter shines as the ideal Eee PC for the traveler looking for outstanding wireless connectivity and efficient Eee PC performance.  Thanks to the exclusive ASUS Super Hybrid Engine and high-density battery, you can take this mobile phenom wherever you choose and enjoy up toan incredible 14 hours of unplugged freedom.*The Eee PC 1005PE-P is encased in a smooth pearlescent shell that captivates onlookers and features the next generation Intel Atom N450 processor for extraordinary battery life.  Plus, it gives you extended comfort with a chiclet keyboard, large palm-rest, and multi-touch trackpad. For more convenience, the Eee PC 1005PE has hotkeys placed above the keyboard &ndash; granting you quick access to Wi-Fi and control of the ASUS Super Hybrid Engine that instantly optimizes system performance for the task at hand.  Throw in a generous 250GB hard drive with 500GB of ASUS WebStorage** and you get the ability to store, share, and access your important data anytime, anywhere.ASUS worked closely to make your Windows 7 experience better with groundbreaking utilities such as FastBoot and LocalMe.  With ASUS FastBoot technology, this Windows 7-enabled Eee PC starts up fast so you wait less and do more.  LocalMe is a GPS-like application that when connected to the internet provides easy access to local areas and gets you where you want to be.Miles ahead of its competition, the Eee PC 1005PE-P provides unsurpassed battery life and superior portability that liberates you from wall chargers and brings you into the next generation of mobility.Key FeaturesUp to 14 hours of unplugged all-day computingto go further than ever before* (Learn more)ASUS Super Hybrid Engine(SHE) innovatively saves battery life and boosts performance (Learn more)Intel Atom N450 processoris now even more power efficient in combination with ASUS SHE750GB Hybrid Storagefor convenient storage on-the-go 250GB HDD + 500GB ASUS WebStorage** (Learn more)10.1-inch LED-backlit Color-shine displayuses less energy for longer use  (Learn more)92-percent full-size chiclet keyboardfor a comfortable and precise typing experience (Learn more)Multi-touch trackpadfor intuitive and quick control (Learn more)Stunning looks and convenient mobility with seashell design weighing a mere 2.8 lbs1GB system memory(easily upgradable to 2GB)High speed Wi-Fi networking(802.11 b/g/n @ 2.4GHz) +Bluetooth 2.1+ EDR for wire-free mobility (Learn more)Windows 7 Starterfor the most reliable and simplest Windows operating system to date (Learn more)Integrated webcam and digital microphonefor video/voice conversations with your friends and familyF9 easy recoveryfor convenient and easy system reinstallation (Learn more)Warranty:1 year global warranty and 30-day Flawless Display Guarantee: If a single bright dot is found, a free panel replacement is guaranteed within 30 days of original purchaseLearn MoreGet up to an Amazing 14 Hours of Battery LifeOnly ASUS has the innovative ASUS Super Hybrid Engine (SHE) that gives you ultimate control of your Eee PC 1005PE-P. With a hot key above the keyboard, you can instantly command the processor to run faster for more performance or conserve speed to prolong battery life. Matching it with the latest Intel Atom N450 processor, it provides even more battery life than ever before on any Eee PC.Through its innovative design, the ASUS SHE utility combined with a high-density 6 cell battery, a power-saving display, and an energy-efficient Intel Atom N450 processor deliver up to 14 hours of battery life &ndash;the longest to ever be featured on an Eee PC.  Imagine enjoying 14 hours flying from New York to Tokyo with your favorite movies and music on a single charge.   Imagine 14 hours of wireless freedom and productivity all-day and night- from the bus ride to school, to the time your Eee PC tucks you in at night.Never again will you scramble to find an outlet or wish you had brought a wall charger, the Eee PC 1005PE-P gives you a reassured peace of mind with mobile power to last nearly all day long.Get the Big Picture in a Small FrameThe Eee PC 1005PE-P features the latest generation of LED-backlit technology for ultra-thin, ultra-bright, and energy-efficient portability and versatility.  A brilliant 10.1-inch LED-backlit Color-shine display makes reading documents and surfing the Web comfortable and easy.With a 1024 x 600 resolution screen, you can coast through most of your favorite web pages without having to resize your browser or scroll left and right. The 1005PE-P also features a brilliant Color-Shine glossy display technology normally found on high-end notebooks so your movies, games, and photos are displayed in true and vibrant colors.But what good is a beautiful display when it is not flawless. ASUS offers the Eee PC 1005PE a 30-day flawless display guarantee. If you discover one defective bright dot within 30 days of purchase, ASUS will replace the panel at no cost.Strikingly Comfortable. Perfectly Concise.Flawlessly smooth, the Eee PC 1005PE-P Seashell draws its inspiration from the curvature of an ocean seashell.  Its lustrous and glossy exterior is crafted by In-mold Roller (IR) technology for a stylish yet scratch-resistant surface that&rsquo;s perfect for everyday use.  The eye-catching Eee PC 1005PE-P is specially designed to be ultra compact so you can use it in the smallest areas with ease.  Its portable size makes it perfect during long airplane trips, classroom desks, or boardroom meetings.The Eee PC 1005PE-P Seashell comes with a 92-percent full-size chiclet keyboard with a spacious palm rest that&rsquo;s ergonomically designed to reduce fatigue and offer a more comfortable experience during prolonged use.  It also features a user-friendly multi-touch trackpad that helps you navigate documents and web pages.  With a simple touch of your fingertips, you can effortlessly scroll up and down, and zoom in and out, so that every detail is brought front and center with ease.Easy ConnectivityThe Eee PC 1005PE-P Seashell connects you to your wireless world with built-in 802.11 b/g/n Wi-Fi connectivity and Windows 7 Starter to deliver definitive wireless accessibility.  Plus, its integrated Bluetooth V2.1 + EDR gives you the flexibility and convenience to sync your most commonly used Bluetooth devices.A spring-loaded Plug-and-Play flash card slot (MMC/SD/SDHC) expands your storage capability so you can view and share your digital photos, videos, and external data files instantly.  A built-in 0.3 megapixel webcam and a digital microphone combine to give you clear video conferencing so you can have clear on-the-go video chats with family and friends.Even More StorageThe Eee PC 1005PE-P hard drive has been expanded to give you 250GB of storage capacity and comes with an additional 500GB of ASUS WebStorage, a free and secure database to store your treasured data.ASUS WebStorage allows you to easily share and safeguard your movies, music, and files, so you can access them anywhere in the world that has an internet connection.  Create and share additional user accounts that let you securely and safely share your precious stored files, videos, music and more, with friends and family.Quick Recovery with Just One KeyThe Eee PC 1005PE-P makes system reinstallation simple with a built-in recovery program that can restore your system to its original factory settings by simply pressing F9 three times during start-up.Coupled with ASUS WebStorage, you can easily back-up your data prior to system recovery to pick up wherever you leave off without a hitch.Eee PC with Windows 7 &ndash;Life Made EasierExplore the great new features of Windows 7 Starter with the Eee PC 1005PE-P.  Featuring optimized energy-saving features and easy-to-use shortcuts, the Windows operating system is redesigned to give you an enhanced user experience making your everyday tasks simpler than ever before.  Plus, Windows 7 has easy networking sharing that helps connect you instantly to Wi-Fi hotspots and networking hubs.  Share more with friends and surf the Web better with Windows 7 and the Eee PC 1005PE-P.Windows 7 Starter makes Eee PCs easier to use because it puts less between you and what you want to do &ndash; less waiting, less clicking, less hassle connecting to networks.  Starter combines the latest in reliability and responsiveness with the familiarity and compatibility of Windows.A Brand that Sparked a Revolution - The First NetbookIn 2007, the Eee PC forever reshaped the definition of mobile computing.Birthed from the creativity and engineering brilliance of ASUS innovation, it soon became the must-have netbook across the globe.  Following that year, the Eee PC brand grew into a full portfolio of highly sought-after mobile and compact PCs with one goal &ldquo;to make people&rsquo;s lives easier.&rdquo;The first netbook to market, ASUS has continued to lead this developing category with the longest battery life, exclusive features, and world-class design.  Today, Eee products are the upmost symbol of how innovative technology can bring excitement and convenience to every person it touches.Customer Warranty &ndash;The Industry's Most Complete Netbook Care Package1 year global warranty6 months battery warranty30-Day Flawless Display Guarantee: If you discover one defective bright dot within 30 days of purchase, ASUS will replace the panel at no costFree one-way standard shipping24/7 tech supportWhat's in the BoxEee PC 1005PE-P Seashell (Black)Power Adapter &dagger;User ManualWarranty CardRecovery DVD / Support CDSpecificationsOperating System:Windows 7 StarterDisplay:10.1-inch LED-Backlit Display  (1024 x 600) with Color Shine glossy finishIntel CPU:Intel  Atom N450Wireless Data Network:802.11b/g/n  (@ 2.4GHz) &amp; Bluetooth V2.1 + EDRMemory:1GB  (upgradeable to 2GB)Hybrid Storage:250GB  HDD + 500GB ASUS WebStorageCamera:0.3M PixelsAudio:Stereo  Speakers, High-Definition Audio CODEC, Built-in digital microphoneStorage Cards:2-in-1  MMC, SD(SDHC) flash card slotInput/Output:1 x  VGA connector, 3 x USB 2.0 ports, 1 x LAN RJ-45, 2 x audio jacks: Headphone  &amp; Mic-inBattery:Up to 14  hours high-density Li-Ion battery *Dimensions:10.31  (W) x 7.01 (D) x 1.02~1.44 (H) inchesWeight:2.80  lbs (with battery)Color:Black* Operation lifetime subject to  product model, normal usage conditions and configurations. For more information, please  visit http://eeepc.asus.com/global/computing.html. The estimated maximum  battery life in Windows 7 is measured with MobileMark 2007.** ASUS  WebStorage is a complimentary trial service for 1 year after registration.  Actual storage capacity varies by model.&dagger; To recharge using the AC power adapter, power plug must be fully pushed into the power socket on the Eee PC until it clicks firmly into place.Note: This Eee PC features a glossy finish chassis. Reflections in photos may vary. Color of the chassis is single-toned.All specifications and terms are subject to change without notice. Please check with your supplier for exact offers on selected models. Products may not be available in all markets. Product may not be exactly as shown in images.Check Out Other ASUS Notebook Computers and AccessoriesASUS Eee PC Seashell Optical Mouse - BlackIts slim and sleek design makes the Eee PC Seashell Optical Mouse the perfect accessory for your Eee PC Seashell.ASUS BX700 Bluetooth Laser MouseThe ASUS BX700 Bluetooth laser mouse offers freedom of movement, as well as dong away with wire clutter with Eee PC 1201N's built-in Bluetooth receiver.ASUS Oxygen Blue 10-inch Netbook Carrying BagMade of extremely light, durable and protective Neoprene fabric, this official ASUS sleek Oxygen carrying bag is tailored to perfectly fit your Seashell Eee PC.ASUS Slim External Optical Drive/DVD WriterCreate and read CDs or DVDs with speed, style, and simplicity with the ASUS Slim External Optical Drive and your Eee PC.ASUS UL30A-X5 Thin and Light LaptopLooking for great battery life and processing power? Check out the Amazon exclusive thin and light UL30A-X5 laptop.", "title": "ASUS Eee PC Seashell 1005PE-PU17-BK 10.1-Inch Black Netbook (Up to 14 Hours of Battery Life)", "price": 16.49, "imUrl": "http://ecx.images-amazon.com/images/I/41mW4g-n4LL._SX300_.jpg", "related": {"also_viewed": ["B0071N3AYC", "B00BQH8QTI", "B00BQH8R9M", "B002TBAFAI", "B0033Q3QLS", "B00COZRNX6", "B00CM1AAOG", "B00HZT1TK4", "B00HZT1T5E", "B00FCK20SI", "B00FU83YWS", "B00HQZGZ38", "B00CPIF4G0", "B00FEE7B1I", "B00FNPD1VW", "B00GZ1GV3I", "B00FFJ0HUE"], "buy_after_viewing": ["B0033Q3QLS", "B004NY9UV4", "B0030IY0Q4", "B003VMIYMK"]}, "categories": [["Electronics", "Computers & Accessories"]]}