{"asin": "B00232YR3E", "description": "An upgrade to its predecessor, the 18-50mm F2.8-4.5 DC OS HSM is a lens dedicated to digital SLR cameras with APS-C size image sensors offering a large aperture and Sigma&#x2019;s Optical Stabilization. Once again, Sigma has also engineered the built-in OS function, an anti-shake system, for Sony and Pentax mount allowing the photographer to see a stabilized image in the viewfinder. The combination of the large aperture of F2.8 and anti-shake function makes capturing exceptional photos in low light achievable, and the wide angle is well suited for indoor photography. Two SLD (Special Low Dispersion) glass elements and three Aspherical lenses provide excellent correction for all types of aberrations. The Super Multi-Layer Coating reduces flare and ghosting. Designed with inner focusing and inner zooming systems, high image quality is assured throughout the entire zoom range. The overall length of the lens does not change during focusing and zooming ensuring convenient handling. This lens has a minimum focusing distance of 11.8 inches (30cm) throughout the entire zoom range and a maximum magnification ratio of 1:4.1. The incorporation of HSM (Hyper Sonic Motor) ensures a quiet and high speed auto focus.", "title": "Sigma 18-50mm f/2.8-4.5 SLD Aspherical DC Optical Stabilized (OS) Lens with Hyper Sonic Motor (HSM) for Pentax Digital SLR Cameras", "price": 6.99, "imUrl": "http://ecx.images-amazon.com/images/I/51EVcAPRQXL._SY300_.jpg", "related": {"also_viewed": ["B004HD577M", "B002BSGUZ8", "B006IQ3W0U", "B0007YZLFS", "B0013DFZNK", "B00AXZZ0XY", "B00861DI4U", "B0043RTLA6", "B0042RTQPC", "B000NO5QV6", "B003A6H27K", "B0001DBZKK", "B000ELC666", "B000JDJJ82", "B00AXZZ034", "B001NEK2R8", "B0099ORFFG", "B0007WK8NK", "B002BSGUZI", "B0000501TL", "B00FKLQ0LW", "B00156OZ68", "B001AZ8N6M", "B0000A1G05", "B0012QE4DK", "B000ANGXW6", "B002LVUIXA", "B000EXR0SI", "B006MI1XLE", "B008B489RS", "B000B8T6E2", "B00AXZYY86", "B0082OJ2YG", "B0008032NY", "B003VSGZ4S", "B000FG6CME", "B0007YZLEO", "B00067ILIA", "B00061J2BQ", "B002ZNJB32", "B003A6NU3U", "B0015CRAZA", "B001955P8W", "B00BW6LVW2", "B008B48AAE", "B0007YZLIK", "B00077KMXG", "B0082OJ2X2", "B00DBPKAI8", "B000ALLMI8", "B004FRYIMA", "B000B8AF9W"], "buy_after_viewing": ["B004HD577M", "B0040RDT0M", "B000V5K3FG", "B00861DI4U"]}, "categories": [["Electronics", "Camera & Photo", "Lenses", "Camera Lenses", "Film SLR Lenses"]]}