{"asin": "B00163LW7A", "description": "Confront terrors both known and unknown in a explosive battle for survival with F.E.A.R 2: Project Origin for Xbox 360. This action-packed follow-up to Monolith Productions's award-winning supernatural shooter F.E.A.R. begins where the previous game left off. This time, you'll come up against Alma's powers from the perspective of special forces operator Michael Becket. After an enormous explosion has devastated the city of Auburn, you'll quickly discover that what seemed like an ordinary mission to retrieve and interrogate Genevieve Aristide is anything but..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Ghoulish supernatural enemies give F.E.A.R. 2: Project Origin a horrific, cinematic feel.View larger.You'll explore and do battle in the dark corners of the ruined city of Auburn.View larger.An enhanced graphics engine offers more dramatic effects.View larger.Improved enemy AI means you'll need better tactics.View larger.Project Origin Run Amok: Alma's BackgroundFans of the first game will be familiar with the suspenseful story surrounding the psychic Alma, a peculiar and disturbing odyssey that adds depth to her devastating quest for revenge and immediacy to gameplay. Origin began as a secret military project run by the Aramacham Technology Corporation (ATC) . In an experiment run by Alma's own father, her DNA was used to create two clones that possessed her impressive psychic powers in an attempt to engineer a telepathic military commander. In the end, the research team became worried about the dangers of Alma's powers, and they tried to kill her.While her heart stopped beating and her physical body died, her psychic energy continued to exist, and she manifested herself in many forms, including both a child and a deformed adult figure that betrays the gruesomeness of her ordeal. Due to a string of events tied to both her clones, Alma has escaped the disastrous explosion of the last game and the facility where she was held, and the haunting manifestations of her power are at work all around you, adding an unpredictable, nightmarish quality to the world.Strange Events in a Supernatural SettingIn order to get anywhere in the rubble of the city of Auburn, you'll need to survive firefights, stay calm in the face of surprisingly graphic events, and uncover the terrifying and mysterious nature of your real enemies. Your character's phenomenal reflexes allow the much-talked-about slow motion effect from the original title to persist here, giving you an edge in combat and adding to the unique nature of your perspective.Improved Details and Enemy AIAn enhanced graphics engine means more detailed environments to explore and better effects. The vast destruction in the city opens up a huge variety of spaces and enhances the other-worldly feel of your mission, and you better be ready to stay on guard because all-new enemies powered by improved AI don't just act more realistically than their predecessors, they employ advanced combat tactics and know how to use the environment against you. But they aren't the only ones with more resources at their disposal--additional world interaction enhancements allow you to create cover and protect yourself or remove obstacles from your path.While it may be the horrific action and the details that first catch your eye, the tactical demands and the way story elements are slowly unveiled promise to help keep you interested as gameplay wears on. And for those times when you're not in the mood for a prolonged single-player campaign, this title also offers the ability to battle with or against friends in multiplayer mode.", "price": 33.95, "imUrl": "http://ecx.images-amazon.com/images/I/51mdIH%2BJf6L._SY300_.jpg", "related": {"also_bought": ["B000HKGIOA", "B003GSZ9ZE", "B000V1OUV8", "B000XJO7A2", "B0009SQFHA", "B001UWGDC6", "B000R0SR9E", "B00309U0M6", "B000HX1P72", "B000C427NM", "B000H94PVO", "B002V16T0Q", "B000X1PE16", "B002BSA1MQ", "B001CRQYBO", "B004ML7WOK", "B003H0CC2O", "B005EZ5GNW", "B001ASJIRM", "B008E6ZXRM", "B003P9C6QY", "B000RHZ9JI", "B0010AYJXI", "B000O5DS32", "B00354NAYG", "B00149MEWI", "B0050SWVIQ", "B000CQNWH0", "B003O6G47U", "B000ZK9QD2", "B00ICWO1XA", "B004EW7LSY", "B002I0H79C", "B001NX4DUQ", "B000KLNLV4", "B00B59L9VO", "B004UDLRMS", "B000FRS9II", "B002DC8GEK", "B003S2MXRA", "B000TI836G", "B009WI7V9E", "B004FUL9YW", "B001ASJISG", "B00BU3WWOS", "B0056WJA76", "B000A0EFJW", "B003DZ4F64", "B0022TNO7S", "B000ZK696O", "B007V2LMAM", "B00C3MK9BS", "B002WSR8BC", "B002I0JA7E", "B001E7MMNQ", "B000G7PMXC", "B000MKA60W", "B000WSE2WM", "B0053BSN82", "B000SQ5LQ4", "B000XJS00K", "B003O6N2TI", "B0085CA8NY", "B0016BVYA2", "B000G75AXY", "B000PE0HBS", "B000ZK6950", "B001TOQ8J8", "B0050SY4DG", "B005VBVQAG", "B000F3AADE", "B001D7T2VM", "B001HWB68K", "B000LXIO6I", "B0056WJA30", "B0050SY9WC", "B002BRZ852", "B005C2D2MO", "B001A4MTGS", "B0025KZV7A", "B008XMSRKC", "B0014ULQB2", "B0050SY77E", "B000OCXK6A", "B007UM59AC", "B000R0RHA4", "B00269QLI8", "B000KGD1GO", "B001YI0Z2U", "B002Z7BE1U", "B00319DX4W", "B000OLSJLC", "B001RTCOWK", "B000B6ML1Y", "B000WEQL02", "B004NRN5DU", "B001D25M1Q", "B004CD9X2C", "B001L18RIE", "B000CBVC0Y"], "bought_together": ["B000HKGIOA", "B003GSZ9ZE"], "buy_after_viewing": ["B003GSZ9ZE", "B000V1OUV8", "B000HKGIOA", "B00309U0M6"]}, "salesRank": {"Video Games": 3607}, "categories": [["Video Games", "Xbox 360", "Games"]]}