{"asin": "B001FA1NZ0", "description": "The third-generation iPod shuffle is the talk of the music world. Not just because it's incredibly small--half the size of the previous generation. And not just because it holds up to 1,000 songs and supports multiple playlists. It's the talk of the town because it's the only music player in the world that talks to you. The new VoiceOver feature lets iPod shuffle tell you what song is playing and who's performing it. It also tells you the names of your playlists. With VoiceOver--and with the controls conveniently located on the earbud cord--it's even easier to navigate your music. You can do it without taking your eyes off your run, your ride, or whatever you're doing.The iPod shuffle 3G is the first music player that talks to you.Click to enlarge.The iPod shuffle 3G: The First Music Player That Talks to YouWorld's Smallest Music PlayerUltra-Compact, Ultra-SleekIts compact, anodized aluminum design is nearly half the size of the previous iPod shuffle and smaller than a AA battery. But don't be fooled by its diminutive nature. It might be small on the outside, but it holds a lot on the inside. With iPod shuffle now available in 4 GB capacity, you can take up to 1,000 songs with you anywhere. And with the controls located where you can quickly access them, it's also easier to use.Most WearableThe iPod shuffle comes with a brilliant stainless steel clip that lets you securely wear your music no matter where you are. Clip it to your workout gear when you're at the gym. Clip it to your backpack or belt when you're on the go. If you want, you can even clip it out of sight. Whether you're walking, running, cycling, or skiing, you'll always have your favorite songs and playlists with you.Your Music Library to GoStore More MusicIt's hard to believe that something so small could carry so much music. But now that the iPod shuffle has 4 GB, you have plenty of room to store up to 1,000 songs. Load up all the music you want, and hit the road for as long as you like. Slide the switch to \"Shuffle,\" and get ready for the most unpredictable ride of your life. Or slide the switch to \"Play in Order\" to hear your playlists from start to finish.Multiple PlaylistsYou've probably made multiple playlists in iTunes. You have one for your commute, another one for the gym, and then a few more for just chilling out. Now, with the iPod shuffle 3G, you can sync them all and take them wherever you go. Up to 4 GB gives you plenty of room to hold a playlist for every occasion--which means you'll always have the perfect mix to match your activity or mood. And with VoiceOver telling you the name of each playlist, you can easily switch between them and find the one you want. You also can have audiobooks and podcasts on your iPod shuffle. Audiobooks will be put into separate playlists automatically, and podcast episodes will be grouped together in a Podcasts playlist.Nearly half the size of the previous iPod shuffle and smaller than a AA battery.Click to enlarge.Includes Apple earbud earphones with remote and mic as well as an iPod shuffle USB cable.Click to see how controls work.Easy Access ControlsYou'll find controls for the new iPod shuffle in two locations. On the right earbud cord, you'll find the controls that let you interact with your music. And on the top of the iPod shuffle, there's a switch that lets you choose to shuffle, to play your songs in order, or to turn off your iPod shuffle.Using the Apple Earphones with RemoteAll the controls you need to interact with your music--adjusting volume, changing songs, switching playlists, and hearing song titles and artist names--are built into the Apple Earphones with Remote. You control the iPod shuffle by pressing the top, center, or bottom button on the control. This makes it easy to navigate your music and activate the VoiceOver feature, without taking your eyes off what you're doing.The first time you set up VoiceOver on your computer, iTunes automatically downloads and installs the VoiceOver Kit.Click to enlarge.Three-Way SwitchThe new iPod shuffle now has a stainless steel switch with three positions that let you choose how you want to listen to your music. Slide it to the left to shuffle your songs. Slide it to the middle to play your songs in order. Or slide it to the right to turn everything off.Also, an LED on the top of the iPod shuffle displays such things as syncing and battery status.Introducing VoiceOverVoiceOver is the exciting new feature that makes iPod shuffle the first music player that talks to you. It entirely changes the way you browse and navigate your music. Say you're listening to a song and want to know the title or the artist. With the press of a button, VoiceOver tells you--without interrupting your music. But the fun doesn't stop with songs. For the first time ever on an iPod shuffle, you can have multiple playlists, and VoiceOver announces their names, too. So you can easily find the right mix without taking your eyes off your run, your ride, or whatever you're doing.How It WorksA lot of work has gone into creating an iPod shuffle that not only talks, but says the right things. It all begins with iTunes and its seamless integration with iPod. iTunes reads your song information, then uses the new VoiceOver Kit to generate the announcements for the songs, artists, and playlists on your iPod shuffle. You'll hear different voices depending on what type of computer system you use when you sync your iPod shuffle. If you sync it with a PC or with a Mac running Mac OS X Tiger, you'll hear the English voice included in the VoiceOver Kit. And since Mac OS X Leopard already has an amazing English voice built in, that's the one you'll hear when you sync your iPod shuffle with a Mac running Leopard.Multiple LanguagesYour music library may have songs from all over the world--a love song from France, a bolero from Spain, a pop tune from Japan. Luckily, VoiceOver speaks in 14 languages. iTunes automatically selects the language and best voice for your song titles and artist names. It looks at song data, like the title, artist, and album information, then applies intelligent algorithms to choose the right language. For example, iTunes recognizes the song \"Ya Viene el Sol\" by Ozomatli as a Spanish song, so your iPod shuffle will automatically speak that song title and artist name in Spanish. If you'd prefer to hear song titles and artist names spoken in a specific language, you can change the designated VoiceOver language in iTunes. Just select one or more songs, choose Get Info from the File menu, and then select the VoiceOver language in the Options pane.Environmental Status ReportiPod shuffle embodies Apple's continuing environmental progress. It is designed with the following features to reduce environmental impact:Brominated flame retardant freePVC freeHighly recyclable aluminum enclosureSmaller, more compact packaging (40% smaller, 33% lighter)VoiceOver KitThe first time you set up VoiceOver on your computer, iTunes automatically downloads and installs the VoiceOver Kit, which enables your iPod shuffle to speak in 14 different languages:Chinese (Mandarin)CzechDutchEnglishFrenchGermanGreekItalianJapanesePolishPortugueseSpanishSwedishTurkishWhat's in the BoxiPod shuffle (silver), Apple Earphones with Remote, iPod shuffle USB cable (1.8 inches), Quick Start guide", "title": "Apple iPod shuffle 4 GB Silver (3rd Generation)  (Discontinued by Manufacturer)", "price": 119.68, "imUrl": "http://ecx.images-amazon.com/images/I/31aNKssD-KL._SX300_.jpg", "related": {"also_bought": ["B00359F2V0", "B002K4GBEI", "B001FA1NZA", "B002AHHZAY", "B0039YOZWI", "B003D853I0", "B002RL9WDQ", "B002CVTU56", "B002NU6J1Y"], "bought_together": ["B00359F2V0", "B002K4GBEI"], "buy_after_viewing": ["B00359F2V0", "B0097BEEW8", "B003D853I0", "B008F4ZR6A"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}