{"asin": "B0065YG1LW", "categories": [["Toys & Games", "Learning & Education", "Science", "Microscopes"]], "description": "Get the best gear in one place with the National Geographic Outdoor Exploration Gear Pack!  This Amazon.com exclusive comes complete with a pair of Expedition Shoe Lights, a 4-in-1 Explorer Navigation Tool, a 3-in-1 Expedition Magnifier, 3 Activity Field Guides, and a sturdy sack pack to store all of your gear.Unique snap-on dual-mode shoe lights!National Geographic Outdoor Explorer Toys.Adventure Awaits!There's so much to do with the great tools in your Outdoor Exploration Gear Pack! In addition to the gear, the pack includes engaging activity guides with fun ideas to do while exploring. You can learn the first steps in becoming a meteorologist with the 4-in-1 Navigation Tool.  Go on an exciting nighttime critter hunt while wearing your Expedition Shoe Lights. Start your own collection of unique rocks by using the 3-in-1 Expedition Magnifier; perfect for extracting and viewing some newly found \"gems\".  All this and more is waiting for you in this action filled gear pack! With the Outdoor Exploration Gear Pack and other National Geographic Outdoor Explorer toys, you can embark on your journey to becoming an avid explorer of the great outdoors.Gear Up!The Outdoor Exploration Gear Pack comes equipped with some of the most innovative exploration tools around! First, the 3-in-1 Expedition Magnifier is made with future archaeologists in mind, with a large viewer and excavation tools that store perfectly in the magnifier&rsquo;s handle.  Next, with the 4-in-1 Explorer Navigation Tool you can check the temperature with the thermometer, find out what direction you're headed in with the real compass, signal friends with the signal mirror, and announce your location with the whistle. Last, with the unique dual-mode Expedition Shoe Lights that attach to your shoes, you can light a clear path on the trail as darkness falls while keeping your hands free for other important tasks.  All of these exploration tools can be stored in the exclusive National Geographic Explorer Academy sack pack. This is one set that will top any young explorer's list!National GeographicSince its inception in 1888, when the National Geographic Society was created for the \"increase and diffusion of geographic knowledge,\" it has supported the work of the world's most intrepid scientists and boldest explorers. Over the years, the Society has awarded more than 10,000 grants for exploration, research, and conservation efforts. Their constant exploration of the world has illuminated the need to protect the Earth's many resources for the future, resulting in a rededicated mission to inspire people to care about the planet. Most important, National Geographic's net proceeds support the exploration, conservation, research, and educational programs that make a better understanding of the world possible.What's In The Box?1 pair of Expedtion Shoe Lights, 4-in-1 Explorer Navigation Tool, 3-in-1 Expedition Magnifier, Sack Pack, and Activity Field Guide.4-in-1 Explorer Navigation Tool and 3-in-1 Expediton Magnifier with real dig tools!", "title": "Uncle Milton National Geographic Outdoor Explorer's Pack", "price": 36.97, "salesRank": {"Toys & Games": 48873}, "imUrl": "http://ecx.images-amazon.com/images/I/41ILJBNnKqL._SY300_.jpg", "related": {"also_bought": ["B006C8MJZI", "B006C8MKES", "B00COLHMYK", "B006C8MK2A", "B007CJJVH0", "B0039WN9FE", "B006C8MKNO", "B006C8MK6Q", "B006C8MJRQ", "1559715995", "B003AQBBW2", "B00BJ4JX22", "B000Z45O2K", "B006C8MKHK", "B007CJJVEI", "B000CKE8WE", "B006C8MJUS", "B006C8MJHG", "B007CJJVNE", "B003AQBBV8", "B001CWGI92", "1559716746", "1559717025", "B007CJJW42", "B001FY2VDO", "B007CJK05C", "B00BJ4JX54", "B000BKHYQC", "B003M4QCLM", "0753459019", "B0002VLCZO", "B0046LVS2S", "1550745395", "0761133194", "B000TCZYE6", "B00CQHZ12W", "B0012IZ96O", "0486410595", "1559716274", "155971624X", "B000JQ3A7A", "1426310943", "B003R68WF4", "1559716282", "0395978351", "0545085365", "1426307683", "1590309553", "B0007ACV8C", "B0076TRVK0", "B008MQDH40", "B008ELH1EA", "1559715936", "1589976991", "B007MGBSL0", "B009IYD7PO", "B002YQL0X4", "B00CIXVITO", "B000HGJJGI", "B000BURAP2", "0800788036", "B000EUHKUE"], "also_viewed": ["B006C8MJZI", "B006C8MKES", "B000CKE8WE", "B006C8MKHK", "B006C8MJUS", "B006C8MK2A", "B003AQBBW2", "B00COLHMYK", "B009R9F78A", "B006C8MJHG", "B0039WN9FE", "B00BJ4JX22", "B006C8MK6Q", "B006C8MKNO", "B0044ZKPKW", "B001FY2VDO", "B00D9DEDM6", "B0012J4BRQ", "B001CWGI92", "B004GX2MSK", "1559715995", "B007CJJVH0", "B006C8MJRQ", "B007CJJVNE", "B007CJJVEI", "B00CI4PO0M", "B0006MY74C", "B006UF6KLC", "B00BJ4JX5E", "B00021Z2FK", "B0016M16UY", "B00BM4N8X4", "B001B8NHLE", "B004PBSIAO", "B00DUEB0XE", "B008IY93YO", "B007CJJWDI", "B006UF6KM6", "B000Z45O2K", "B0046LVS2S", "1559717025", "B000JQ3A7A", "B003AQBBV8", "0753459019", "B00742Q5OC", "B0002VLCZO", "B001OTBFQY", "B007CJK05C", "B000BKHYQC", "B003R68WF4", "B000TCZYE6", "B001ALLMX2", "B000ERAIW4", "B006UF6KL2", "B007CJJZMG", "B0000696CO", "B000MSY7U4", "1559716746", "B00CQHZ12W"], "bought_together": ["B006C8MJZI", "B006C8MKES"]}}