{"asin": "B00141AYIC", "description": "Manufacturer's Description -- March 24, 2008 A sleek design with hidden speakers keep Samsung's Series 4 large flatpanel HDTVs one of the best 720p HD options around. Upgrades over last year's models include a 6ms response rate that's faster than many more expensive 1080p models for smooth motion even with fast-moving sports and action movies, and a higher dynamic contrast ratio of 10,000:1 (up from 8,000:1 last year) for deep blacks and crisp lines.Please note that this description applies to Series 4 models 32 inches or larger. Models 26 inches and smaller have slightly different specifications.Features OverviewNew--10,000:1 dynamic contrast ratio: up from 8,000:1 on 2007 models (Learn more)New--6ms response time:down from 8ms on 2007 models thanks to a new high-speed liquid crystal178-degree viewing anglefrom all four axes with Super Patterned Vertical Alignment (Learn more)3 HDMI 1.3 ports: Simplay compliant (Learn more about Connectivity)DNIe Digital Natural Image Engineimproves the picture by enhancing the contrast, detail, and white balance (Learn more)Clear paneltechnology for deeper blacks and more vibrant colors (Learn more)Hidden speakers with SRS TruSurround XT audio(Learn more)Wide Color Enhancertechnology and Cold Cathode Fluorescent Lamp (CCFL) offer a wider color range (Learn more)Entertainment Modes:for sports, games, and moviesV-Chipsystem allows blocking of rated TV and movie programs determined by the parent to contain objectionable content.Trilingualon-screen displays in English, Spanish or French.Variable sleep timerto turn the TV off in varying time intervals.Auto wall mount compatible:3-dimensional operation via TV&rsquo;s remote control; no external IR receiver required.Swivel standincluded1 year parts and 1 year labor warranty(90 days parts and labor for commercial use), with in-home service, backed by Samsung toll-free supportStep Up FeaturesSeries 5: Full 1080p HD; up to 30,000:1 dynamic contrast ratio; 5 ms response time; USB 2.0 port:connect devices directly to your HDTV--view JPEG photos or MPEG movies or easily listen to your MP3 player through your HDTV's audio system or your home theater systemSeries 6: 50,000:1 dynamic contrast ratio; AutoMotion Plus 120Hzimage interpolation for smoother motion; 4ms response time;Transparent and Opaque Color (TOC) bezel; Ethernet port with; Infolink free RSS feeds; 4 HDMI 1.3 ports; Compatible with Samsung's Home Digital Media Adapter for playback and navigation of Internet and stored PC multimediaSeries 7: Internal flash memory (1GB) with pre-loaded interactive contentsuch as cooking recipes, children's entertainment, HD artwork and more;Integrated wooferfor an enhanced audio experience;DLNA-Compatible:for better interoperability with electronics, computers and mobile devices from many different manufacturers (Learn more)Series 8:super-slim 1.9-inch thick profileWhat size TV should you get?Learn MoreSuper Clear PanelSamsung enhances the clarity of select LCD HDTVs by replacing the light-diffusing plastic face of traditional LCD HDTVs with a&nbsp; natural black panel with a clear anti-glare shield. Reduced reflection of external light creates a new dimension in image clarity, highlighting black and darkened areas, enabling vibrant, more compelling colors and a brighter, clearer picture.&nbsp; Black will never again appear grayish. Black details will show in vivid black even in dark scenes.The latest version of Samsung&rsquo;s breakthrough super clear panel technology makes colors appear more vibrant and blacks even deeper than ever. Enhanced films reduce glare and optimize off-angle viewing.10,000:1 Dynamic Contrast Ratio/500 nit Brightness10,000:1 Dynamic Contrast Ratio will give you a superb picture, with whiter whites, blacker blacks and subtle gradations in between. As two of the most important determining factors in overall picture quality, contrast and brightness levels achieve new heights in this latest generation LCD panel. Samsung&rsquo;s new LCD TV&rsquo;s give the most stunning realistic picture quality ever.Note:models 26 inches or less have lower contrast ratios32-inch, 37-inch, and 40-inch models = 10,000:1 dynamic contrast ratio26-inch model = 5,000:1 dynamic contrast ratio19-inch and 22-inch models = 3,000:1 dynamic contrast ratioDigital Natural Image EngineDNIe The Samsung Digital Natural Image engine. This exclusive Samsung technology dramatically improves the picture by enhancing the contrast, detail, white balance and reduces.Wide Color Enhancer/Cold Cathode Fluorescent LampThe NTSC (National Television Systems Committee) has established the color standards all TVs in America try to meet. And typical LCD TVs only meet about 72% of this standard. Samsung LCD HDTVs use Cold Cathode Fluorescent Lamp back lights to give you 92% coverage of the NTSC standard, ensuring truer, more breathlessly vivid colors.Samsung&rsquo;s exclusive Wide Color Enhancer technology delivers more brilliant colors, even in bright areas of the picture where blues and greens are washed out on conventional screens. The system displays wider color reproduction, showing you truer colors &ndash; the fresh green of spring foliage, the intense blue of the summer sky.ConnectivityA wide variety of multimedia devices can be connected to the set through three Simplay compliant HDMI 1.3 inputs (2 rear, 1 side), and the handy HDMI-CEC feature lets you control all your CEC-enabled peripherals using just one remote.Connect HD digital devices like disc players, game consoles, and satellite dish components into the 2 rear connections and use the side-mounted input for cameras, camcorders, and laptops. HDMI is the best performing interface for displaying an HD source on an HDTV.Once connected, users can easily access device menus and manage and display content through the newly redesigned Wheel Key Remote control and the HDTV&rsquo;s sophisticated content management interface.All Connections3 HDMI (High-Definition MultimediaInterface) 2 rear/1 sideComponent video: 2 rear (Y, Pb, Pr)A/V inputs: 1 rear/ 1 sideS-Video: 1 sidePC D-sub: 1 rearOptical sound out: rearRS232: rearRF antenna inputs: rearHeadphone jack: sideSuper Patterned Vertical AlignmentSamsung&rsquo;s Super Patterned Vertical Alignment (SPVA) panel provides a 178-degree viewing angle from all four axesAudio FeaturesTruSurround is a patented SRS technology that solves the problem of playing 5.1 multichannel content over two speakers. TruSurround delivers a compelling, virtual surround sound experience through any two-speaker playback system, including internal television speakers and headphones. It is fully compatible with all multichannel formats up to 5.1 channels. High-quality virtual surround sound can be experienced with just the two hidden, downward-firing side-mounted 2.2-channel dome speakers built into the TV.SRS TruSurround XT technology delivers an amazing, simulated 3D effect with clear dialog and powerful bass.TruSurround XT audio also adds three audio enhancement technologies to produce an amazingly immersive sound experience.Dialog Clarity brings movie dialog into Focus during the playback of any surround-encoded material to make speech much clearer and crisper.TruBass creates incredible deep rich bass allowing a person to perceive significantly deeper, richer low bass tones that are far beyond the physical low frequency capabilities of the speaker itself.The SRS WOW feature widens the sound stage by processing standard two-channel stereo material as well as multi-channel encoded material for a dramatic improvement in the playback of any stereo audio over a two-speaker system.Stereo broadcast reception is offered for MTS and SAP with 181-channel capacity. A sound leveler keeps audio volume consistent during channel changing.Which Size HDTV is Right for My Room?With standard-definition TVs, the rule used to be that viewers would feel comfortable watching a set from a distance of 3 to 6 times the screen size in inches. With HDTV, the resolution is so much better that you can sit closer to a larger TV without noticing the pixels. So with HDTVs, the rule tends to be you can sit anywhere from 1.5 to 3 times the screen size (in inches) for the best experience.If you know the size of the room you have already, where you want to sit, and where your new HDTV should go once you get it, you can figure out the size HDTV you should get.Minimum size = Viewing distance/3Maximum size=Viewing distance/1.5", "title": "Samsung LN32A450 32-Inch 720p LCD HDTV", "price": 369.99, "imUrl": "http://ecx.images-amazon.com/images/I/31AtrYmXMtL._SX300_.jpg", "related": {"also_viewed": ["B0074FGNJ6", "B0078LSTWU", "B004VRJ3KQ", "B0071O4ETQ", "B00BCGRZ22", "B00BB0ZTMM", "B0071NWYP8", "B00BCGRXD8", "B00BB0ZTM2", "B00I94IRC2", "B00BB0ZTO0", "B00HZI0Y0Q", "B0074FGR74", "B00BGA9WK2"], "buy_after_viewing": ["B0074FGNJ6", "B0078LSTWU", "B0078LSTWU", "B003L1ZYYM", "B001DPNRT2"]}, "categories": [["Electronics", "Television & Video", "Televisions", "LCD TVs"]]}