{"asin": "B00006LU9L", "description": "Set in the year 2008,Ghost Reconis a Tom Clancy-inspired war game that puts you in command of a Special Forces unit pitted against Russian ultranationalists trying to rebuild the former Soviet Union. Although the story arc is grand in scale (in keeping with Clancy's style), the game doesn't involve you in the war's major battles. You'll actually spend most of your time behind enemy lines--rescuing downed fighter pilots, knocking out enemy patrols, ambushing armor columns.You control a six-man squad, divided into two teams, and you have the opportunity to handpick your squad members (and their equipment) after each mission briefing. You can switch your point of view to any of the six active soldiers--the soldier you control automatically becomes the leader of his team, while the other team operates according to orders you give via a map interface. Thus, you can move one team into a covering position, leave them with orders to provide cover fire, and then lead the other team in to reach your objective. Or, break up your squad and try to achieve two objectives simultaneously.The level of detail and realism is incredible, right down to the way the soldiers communicate in hushed tones and with gestures. The complexity of the game requires an elaborate controller setup that takes a while to get used to (luckily there are plenty of training missions designed to help you learn the multitude of movement, weapons, and command functions). Once you get the hang of it, you'll find it's worth the time spent in boot camp.--Maile BohlmannPros:Incredible graphics and realismWide array of tactical options integrates strategy into the actionMissions are diverse and challengingCons:Controls are complicated, hard to master, and sometimes counterintuitiveDramatic music and \"drill sergeant\" narration between missions is pretty campyEnemy soldiers sometimes behave too predictablyNote: This review refers to the PlayStation2 version of this game.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51EZ6GW7Y5L._SY300_.jpg", "related": {"also_bought": ["B000093NQH", "B0002CHJA0", "B0009PQ0IM", "B00008G764", "B00025EJ1E", "B000A0EFJW", "B001ELWMHI", "B000LXIO6I", "B00005NZ1G", "B0007DGB4E", "B000E4E9F4", "B00006JZQZ", "B000B2YR74", "B000G7PMXC", "B0001DI6FM", "B0008GJRQ4", "B0037LTTRO", "B0009Z3IZ0", "B00012TIW8", "B00008J7NZ", "B00008DHNZ", "B0000CGB1B", "B000F2JUOK", "B00006JC3S", "B0002SQ0BS", "B0000A92KZ", "B00006JC48", "B0009351RK", "B000G82DDS", "B000067DPM", "B00005RCQ5", "B000087R8F", "B00006LELH", "B000069BCN", "B0016CQ0Q4", "B000ZK9QD2", "B0000AJMPK", "B00095LEEW", "B0000V48KM", "B0002A2S26", "B00009X3SY", "B00EVWYF0E", "B0002CHIZ6", "B000X25GX6", "B000087L4G", "B0000C7GH4", "B00006C28Y", "B000SQ5LQ4", "B0007SL202", "B000H59XQU", "B0001AVSH8", "B0001I9YE4", "B00008DHNN", "B000FRVAD4", "B000088KH3", "B0001ADAMO", "B0006BK5AI", "B000E61G4O", "B004AGYHUE", "B0009O7HUI", "B00006N5SZ", "B0014ULQB2", "B0007OSLOG", "B000EGETL6", "B00097IA88", "B000FRS9II", "B00005BX7K", "B0000C4M23", "B00009X3V0", "B000UUFQZE", "B00005O0I8", "B00006F2ZQ", "B0002VYPEE", "B000CBVC0Y", "B000RHZ9JI", "B00006C260", "B000OCXK6A", "B0009Z3IY6", "B000CEXDW6", "B002I0JGDM", "B0016B28Y8", "B000MKA60W", "B00009YEJP", "B0000631WA", "B0007M2220", "B00008S7XI"], "bought_together": ["B000093NQH", "B0002CHJA0"], "buy_after_viewing": ["B0002CHJA0", "B000093NQH", "B0009PQ0IM", "B0037LTTRO"]}, "salesRank": {"Video Games": 13320}, "categories": [["Video Games", "More Systems", "Xbox", "Games"]]}