{"asin": "B000MWVMRG", "description": "The new long-zoom Panasonic Lumix DMC-FZ8 boasts 12x optical zoom (equivalent to 36-432mm on a 35mm film camera), coupled with Panasonic's Extra Optical Zoom function that provides additional magnification up to 18x when taking photos with 3-megapixel resolution, and also features a 7.2-megapixel CCD and Intelligent Image Stabilization system now available in all new Panasonic Lumix models.The stylish DMC-FZ8 has a large, 2.5-inch LCD for easy viewing while monitoring and during image playback and it has been redesigned to include a multi-purpose joystick for improved usability and simplified exposure compensation.  The joystick control allows a host of additional settings, such as manual focus and exposure, to make for quick and easy shooting.Along with easy operation, the DMC-FZ8 also features the Panasonic LSI Venus Engine III, an advanced image-processing engine that can record at a sensitivity setting as high as ISO 1250 with full resolution -- greatly improving noise reduction, with picture noise removed in stages during image processing. With its multi-task image-processing capability, the Venus Engine III also has outstanding response time with a shutter release time lag as short as 0.005 second, and the shutter interval as short as 0.6 second. This fast response makes it easy for users to capture sudden, spur-of-the-moment shots.Lumix DMC-FZ8 Highlights12x Optical Zoom Leica DC Vario-Elmarit LensFeaturing a 12x optical zoom Leica DC Vario-Elmarit lens (equivalent to 36mm to 432mm in a 35mm film camera), the compact DMC-FZ8 is a great camera to take everywhere you go. Shoot beautiful photos anytime you feel the urge, and be sure to bring the DMC-FZ8 along on family trips. With the 18x extended optical zoom (35mm equivalent: 648mm) feature, you've got the power to shoot remarkable close-ups from a long distance, for uses such as bird watching.12x optical zoom in a compact bodyThe DMC-FZ8 features the 12x Leica DC Vario-Elmarit lens - a small, lightweight lens that packs the same zoom power as a big, clunky 400 mm-class film camera lens. This 12x optical zoom lens is super-bright too, at f/2.8 to f/3.3 with a focal length of 6 to 72 mm (equivalent to 36 mm to 432 mm in a 35 mm film camera). You've got all the power and flexibility you need to take beautiful shots from telephoto to wide angle and macro.Up to 18x Extended Optical ZoomDesigned for uses like bird watching, where you need maximum telephoto capability, the Extended Optical Zoom employs the central of the CCD to further extend the powerful 12x optical zoom when a resolution of less than 7.2-megapixel is used. This lets you extend the zoom ratio to 18x for 3-megapixel or less images.2-speed zoomThis new function allows you to control the zoom operation in two speeds, Low and High, with the zoom lever. Rotate the lever a small amount for slow zooming, and a larger amount for high-speed zooming. This makes it easy to zoom in and out quickly when you need to, or to slow down for finer zooming control.Zoom ResumeHave you ever had this happen? You set the zoom right where you want it and you're waiting to shoot, but the Power Save function suddenly turns the power off. Or, you've made the zoom setting, but the battery runs out and the power is cut. Or perhaps you've just taken a shot and turned off the power, and you decide you want to re-shoot at the same zoom setting. This is when you need Zoom Resume. It stores the zoom position (magnification) in memory, so you can shoot with the same zoom setting once the power is turned on again. This helps make sure you don't miss those great shooting opportunities.432mm, f/3.1 shots with a beautiful soft focusThe CCDs used in most digital cameras have much smaller light-receiving areas than film does, so photos tend to have a high depth of field. This means that everything in the photo -- including objects in the foreground and background -- is in focus. The DMC-FZ8 takes advantage of 12x zoom capability (35mm equivalent: 432mm) and f/2.8 to f/3.3 aperture to a level of expression that you cannot get with conventional digital cameras. You can snap photos that capture the subject in a clear, sharp focus while giving the background a beautiful soft focus.Tele MacroEven at 12x zoom, it is possible to take as near as 1 meter from the subject when you select the Macro button. You can take macro shot with easy posture and beautifully soft focused background.Intelligent Image StabilizerPanasonic invented the Mega O.I.S. (Optical Image Stabilizer) system to fight against hand-shake, the major cause of blurry images. This system, which takes advantage of Panasonic's outstanding lens technology, has long been incorporated into the Lumix range of cameras. In addition, the DMC-FZ8 compensates for the other major cause of blurry images -- subject movement. The Intelligent ISO Control function, made possible by the Venus Engine III, detects subject movement and adjusts the ISO setting and shutter speed to best suit the movement and light conditions automatically. Together, they form Intelligent Image Stabilizer, which makes it easy for anybody to take crisp, clear photos in just about any situation. It's automatic, so you can leave everything to the camera.Mega O.I.S. for preventing blurry shots caused by hand-shakeThe Mega O.I.S.(Optical Image Stabilizer) compensates for the blurring caused by hand-shake. It is now featured on the entire Lumix range, and is highly popular with users around the world. Even slight hand-shake movement is accurately detected by a sampling frequency of 4,000 times per second, and compensated to produce sharp, clear images. This is true, of course, for zooming and macro shots, which are especially susceptible to hand-shake, but it also lets you shoot in dimly lit rooms or evening illumination, without a flash, to preserve the mood. In short, it lets anybody take beautiful, blur-free shots with ease.Intelligent ISO Control prevents blurry shots caused by moving subjectsWhen the Intelligent ISO Control (I.I.C.) in Lumix cameras detects subject motion, it automatically raises the ISO setting and increases the shutter speed to prevent motion blur. On the other hand, when the subject is still and no movement is detected, it lets you take beautifully natural photos with a low ISO setting. Have you ever mistakenly used a high ISO setting to take a photo of a subject standing still? If so, you may remember the noisy, grainy result. Or, if you have tried snapping a moving subject at a low ISO setting, your photo was probably spoiled by motion blur. Intelligent ISO Control gives you stunning images with ease because there is no need for complicated settings.The DMC-FZ8 also makes it easy to select the I.ISO (Intelligent ISO Control) Mode right from its new mode dial. This makes it possible to raise the sensitivity all the way to ISO 1250, or to limit it to ISO 400 or ISO 800. I.ISO Mode gives you exactly the kind of image quality you are looking for.Blur IndicatorBlur Indicator lets you confirm that the camera is precisely detecting hand-shake and motion blur separately.Venus Engine IIIThe Venus Engine III in the DMC-FZ8 allows high-sensitivity recording up to ISO 1250 at full resolution. The noise reduction system is also greatly improved while maintaining high resolution. It removes noise at the processing stages in series. First, critical noise is roughly undraped and the chromatic noise and the luminance noise are separated so they can each go through a supplemental noise reduction process that appropriately minimizes the remaining noise.Super-fast shutter responseWe slashed the release time lag to 0.005 second minimum by increasing both the circuit speed itself and the point at which the shutter release signal is detected. We also shortened the shutter interval to around 0.6 second (minimum). These improvements help make Lumix an extremely quick, responsive camera that's a pleasure to use.Long battery life -- up to 380 picturesDespite the significantly increased performance of the camera, the Venus Engine III consumes only 80 percent of the power utilized by the Venus Engine II and is able to achieve a longer battery life of approximately 380 pictures on a single charge.Full Manual OperationAdjust the exposure and shutter speed any way you want. On top of full manual control, the DMC-FZ8 gives you a host of functions that make it easy to capture artistic or expressive photos, including a user-friendly joystick, high-resolution electronic viewfinder, and Selectable Auto Focus Area.Full manual control and easy joystick operationThe easy-to-use joystick operation and good design, which were part of the highly acclaimed trademarks of the predecessor, are inherited by the DMC-FZ8. The joystick was incorporated to facilitate operational ease and thereby get the best technical advantage of the multitude of functions offered by the camera. With the joystick it is possible to set focus, aperture and shutter speed manually.Mode Select with joystick control (P/A/S/M)You can select Program AE, Aperture Priority AE, Shutter Speed Priority AE, or Manual Exposure Mode by simply turning the dial. This opens the door to a host of creative possibilities. Move the joystick up or down to easily set the parameter of each item. When you set the dial to manual exposure, move the joystick right or left to select the aperture and shutter speed.Program ShiftYou can use Program Shift in Program AE Mode to keep the exposure fixed while changing the combination of shutter speed and aperture. This function lets you choose the exposure setting yourself to capture exactly the image you want.Direct exposure compensationIn Program AE, Aperture Priority AE, and Shutter Speed Priority AE Modes, you can retrieve the exposure compensation value and manually adjust it in the range of -2 EV to +2 EV, in 1/3 EV steps, directly with the joystick.Manual Exposure AssistWhen you choose to set the exposure manually, this function shows how much your setting differs from the setting the camera considers optimal.Manual FocusSelect manual focus with the focus select button on the top of the camera, and use the joystick for super-smooth focusing.Movable MF AssistThe image in the center of the LCD or EVF can be enlarged during manual focus for easier focusing.MF1: The part of the image in the center of the frame is enlarged. This lets you adjust the focus while composing the entire frame.MF2: The entire frame image is enlarged. This is helpful for macros and other shots that require extra-precise focusing.Movable MF Assist: This lets you move the part that is enlarged by the MF Assist function to any area of the frame you want.Quick setting with joystickYou can quickly shortcut to frequently functions, such as light metering, AF Mode, white balance settings, ISO sensitivity settings, image size settings and compression formats by simply pressing and holding down the joystick, even while monitoring your subject on the LCD.Bright, high-resolution LCDThe DMC-FZ8 boasts a large, 2.5-inch LCD with full 207,000-pixel resolution for comfortable viewing both while monitoring shots and playing back the results. The pixel-mixed readout method used by the CCD automatically increases the brightness of the live image on the LCD, making it much easier to shoot in low lighting. Thanks to the Power LCD function, which boosts the LCD backlighting by 40 percent, even shooting outdoors in bright sunshine is no longer a problem. The High Angle mode, which can be accessed quickly and easily via a dedicated button, makes the LCD screen extremely easy to view when the camera is held high, such as to shoot over a crowd.Large, high-resolution, electronic viewfinderThe viewfinder is also large and clear, with a 0.44inch size and 188,000-pixel resolution. Located directly on top of the lens, it is designed for easy use and fast, accurate framing.AF MeteringTo match the shooting situation and subject's position, the user can select from five auto-focusing methods: Multi-point, 3-point high-speed, 1-point high-speed, 1-point normal-speed, and spot.Multi-point AFYou can use the joystick or cursor button to quickly select any of six AF area patterns that combine 3 to 5 of the camera's 11 distance metering points.3-point high-speed AFThis mode prevents the system from mistakenly focusing on the area between two subjects in a horizonal composition.1-point high-speed AFThe AF time has been dramatically reduced to achieve outstanding focusing.1-point AFAlthough screen-freeze in high-speed AF is now minimized, you can select this mode to totally eliminate it when you are focusing on a fast-moving subject.Spot AFThis mode keys the focus to a small area within the frame.Selectable AF areaWhile using 1-point, 1-point high speed AF mode and spot AF mode, you can specify a point out of 11 AF points. You can thereby enjoy free framing shooting even with the subject not at the center.Continuous AFClear, sharp focus even for moving subjects.Focus / AE lockThe focus and exposure values that were automatically set when the lock button was pressed are maintained. The focus lock can be used even during manual focus in addition to auto focus. This means that there are no more worries about accidentally changing a delicate focus point after you have worked hard to get it just right.Mode dial -- Mode position displayAs you operate the dial, large animated icons are displayed. In addition to Macro Mode and Tele-macro Mode, you can choose Simple Mode and let the camera take care of everything, use Playback Mode to view or process the shots you've taken, or select Direct Printing Mode for direct connection to a printer. This single, easy-to-understand mode dial lets you easily switch between shooting, viewing, and printing.Scene ModeVersatile Scene Modes are another great Lumix feature. And the Scene Mode list display makes them even easier to select. You can choose from a total of 19 situations, including the unique DMC-FZ8 Panning mode, the new Sunset and Pet modes, and the Aerial Photo mode, for settings that match your subject. Animated moving icons make mode selection even easier and more fun.Two Axis White Balance AdjustmentChoose from seven white balance settings: Auto, Daylight, Cloudy, Shade, Halogen, Flash, and White Set. When there are several different light sources and it's difficult to get the exact coloration you want, you can also adjust with a reference to the horizontal axis for amber to blue and vertical axis for green to magenta.**White Balance Adjustment is not possible in Auto ModeMega Burst Consecutive ShootingJust keep the shutter button pressed to fire off consecutive shots of a moving subject or a person's changing facial expression. Then save only the best ones. With a digital camera, you can just delete any shots you don't want. In addition, the Unlimited Consecutive Shooting function lets you continue shooting until the memory card is full.The focus and exposure are fixed at the first frame.3-image capturing in self-timer (10sec)Now, the self-timer is able to take three consecutive shots. Never again will you have to reset the self-timer because somebody blinked. Just choose the best one from the three consecutive shots.27MB internal memoryTake photos even when you don't have an SD/SDHC Memory Card on hand. The built-in memory holds up to 27 MB of image data, which you can later copy to an SD/SDHC Memory Card or PC. You can also copy images from a memory card or PC to the built-in memory, and view them on the LCD anytime you like.Select from 3 aspect ratiosThe aspect ratio is easily selectable between 16:9 wide, 3:2, and conventional 4:3 to shoot in the framing aspect that best suits the photo's composition or purpose of use. You can shoot images in the wide 16:9 format and save them onto an SD/SDHC Memory Card. Then insert the card into a TV equipped with an SD/SDHC card slot to view them in perfect, wide-screen size. Some TVs will display the images in stunning high definition.Motion Picture ModeThe DMC-FZ8 lets you shoot smooth moving pictures at 30 fps, complete with sound, in WVGA or VGA size. You can also shoot at 10 frames/sec to reduce the file size.9-cutout images from motion imagesA motion image can be cut out as a still image in motion image playback. And you can also archive a 9-cutout still image.Date stampYou can also print the date on your photos. In addition to the ordinary recording date, you can choose Baby or Pet mode from among the Scene Modes to print the age of a child or pet by inputting the birthdate in advance, or use the Travel Date Setting to print which day of the trip each photo was taken on. These dates, which can be helpful when making a photo album, can be stamped on photos whether you print them yourself at home or have a photo shop do them.RAW format compatible and included software for editingYou can get original image data, recording the image directly from the CCD without any image processing. SILKYPIX Developer Studio 2.0SE software utility lets you develop RAW data files. For example, you can develop RAW data to create an image with the effect you were trying to capture when you took the shot. You get high-level basic image processing abilities that give you control over such things as unnatural edges from saturated color borders, false colors in structures with intricate detail, and chromatic noise in photos taken at high sensitivity settings. This utility provides a unique combination of high resolution and extraordinary color separation performance.", "title": "Panasonic Lumix DMC-FZ8K 7.2MP Digital Camera with 12x Optical Image Stabilized Zoom (Black)", "price": 554.0, "imUrl": "http://ecx.images-amazon.com/images/I/41d-B%2BQi4YL._SX300_.jpg", "related": {"also_viewed": ["B002IKLJU0", "B000TM7GD8", "B000EBK3FW", "B000GHVZQ0", "B003WJR68U", "B00DY2Y28M", "B004HO58NO", "B00E52ZJDM", "B001QFZMCO", "B008MB6YX6", "B003WJR694", "B000A7XSSY", "B008MB6ZX0", "B00B2QK2H2", "B009WS2NGK", "B000Q3043Y", "B005F25IL4", "B0035WTVZA", "B006ZNYSX6", "B0056ENTVC", "B001CCLBSU", "B000E0DZH6", "B00728Z8U0", "B00ATE7SZM", "B00395YA90", "B000ENN9BK", "B00728Z9JA", "B001U3ZUWO", "B005I6DVC0", "B001QENO7A", "B000EMWBV0", "B001OI2LV8", "B0011ZK6ZM", "B0011Z8CCG", "B001CCTPFQ", "B001PK8FHE", "B001G5ZTZO", "B0011EA9GE", "B000V1VG4W", "B00HZDAUOQ", "B001CCLBSA", "B00KOUIBZW", "B006ZOU9P6", "B0007GIXS8", "B001FSKDWG", "B00061S2OO", "B004KKZ0HY", "B00728Z8TG", "B003966MRM", "B0091TC3OC", "B0081IOD1K", "B00395WIXA"], "buy_after_viewing": ["B006ZOU9P6", "B000CP4ML6", "B006ZNYSX6", "B003VNKNF0"]}, "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]]}