{"asin": "B001NPDA44", "description": "The Belkin Neoprene Sleeve Case for Amazon Kindle 2 protects your Kindle from bumps and scratches, keeping your ebook reader looking new and working great. With a slim, good-looking design, this soft and durable neoprene case keeps your Kindle protected during your travels while minimizing additional bulk and weight for easy portability.Keep your Kindle 2 looking new with the Neoprene Sleeve Case.View larger.Small Size, Big ProtectionBelkin's Neoprene Sleeve Case features a slim, form-fitting design that maintains the Kindle's convenient portability so you can take your collection of ebooks wherever you go.The Neoprene Sleeve Case is made of neoprene, the same material used in wetsuits, and has thick padding all around protecting it from shock and scratches, so you'll feel confident carrying your Kindle 2 around. The case protects the reader's large screen, so you won't have to worry about scratching it up and ruining your reading experience. And you'll notice when you're zipping the case up that the zippers themselves are padded to prevent scratching the Kindle. Belkin has covered every detail for you with this protective sleeve.Simple, Effective Design Offers Quick AccessThe Neoprene Sleeve Case is designed so you can retrieve and put away your Kindle 2 quickly and easily. The case has two zippers configured in a unique asymmetrical design that provides easy access from both the top and the side. If you're on the train or bus, you'll be able to get your Kindle out for a quick read and put it away when your stop is approaching.", "price": 69.0, "imUrl": "http://ecx.images-amazon.com/images/I/51qkQshWhjL._SY300_.jpg", "related": {"also_viewed": ["B00F6E8OUS", "B004JXVOD6", "B00F6E8TO4", "B005TJMI5W", "B002Y27P6Y", "B004SD1XB0", "B004SD1ZPY", "B00F6E8RIM", "B00F6E8QL0", "B0067UUE5S", "B006ALR3OE", "B0067US1R6", "B00GIY960C", "1441308598", "B00F6E8SRC", "B0062H71SO", "B00474N7NW", "B006ALQD6S", "B0068ABH3K", "B005HSG446", "B00H9XFU3S", "B009UHC6JW", "B007TYW68Y", "B004SD1YRI", "B0026RHUQC", "B005QI5DZI", "B00F6E8MSM", "B007MLLKDG", "B00HVRJV9G", "B004SD1Z90", "B006ZBWVIC", "B0098QDGS0", "B008NPADYM", "B00H9XFUVK", "B005S8ND9O"], "buy_after_viewing": ["B007HCCNJU", "B004SD1XB0", "B00F6E8OUS", "B004JXVOD6"]}, "categories": [["Electronics", "eBook Readers & Accessories", "Covers"], ["Electronics", "eBook Readers & Accessories", "Sleeves"], ["Kindle Store", "Kindle Accessories", "Covers", "Kindle Covers (2nd Generation)"]]}