{"asin": "B00134VVKU", "description": "Coby's MP305-2G is an all-in-one MP3 player and USB drive, squeezing an LCD display, an FM radio, and a walth of other features into an ultra-portable \"thumb drive\" form factor. Sync with no cables necessary, and fill it up with 2GB of your favorites.2GB of music, FM radio, and more.Click to enlarge.Thumb drive form factor is ultra-portable and requires no cable for sync.Coby stereo earphones included.Brilliant DisplayThe MP305-2G features a high-contrast LCD display with seven-color backlight. View ID3 song info, radio station, and other playback info quickly and easily.Play Your Digital MusicPlay back your favorite MP3 or WMA audio files, along with copy-protected WMDRM10 available from many subscription services. ID3 tag information like artist, track, and title info will be displayed if included with the files.Integrated FM RadioCheck up on your local news, enjoy your favorite morning show, or tune into the FM transmitters at the gym with the built-in FM radio. Add your favorite stations to memory presets for instant access.Mobile StorageThe MP305-2G looks like a thumb drive, and it's happy to behave as one. Take some files with you for easy transfer, using the player as USB storage. Enjoy plug-and-play support with Windows 98SE and upward, as well as Mac OS X and newer.USB 2.0Quickly transfer your files using a USB 2.0 connection. As an added bonus, the MP305-2G requires zero cables, since it has its own USB connector. A USB extension cable is included, however, in case your ports are inconveniently located.AAA PowerPower the MP305-2G with a single AAA battery (included). You'll get about 8 hours of life out of each battery, but it might be a good idea to pick up a rechargeable AAA/charger.What's in the BoxCoby MP305-2G, Stereo Earphones, AAA Battery, USB Extension Cable, User's Manual", "title": "Coby 2 GB USB-Stick MP3 Player with LCD and FM Radio (Black) (Discontinued by Manufacturer)", "price": 28.47, "imUrl": "http://ecx.images-amazon.com/images/I/41Wz6Ml5k5L._SY300_.jpg", "related": {"also_viewed": ["B0035PBHS6", "B0035P4BXO", "B005Q6MX7G", "B00BTLN5OC", "B000G122KO", "B006OSFPZC", "B000E873QM", "B00AWKFXTQ", "B000BP50AY", "B00176SYZE", "B0014CABAW"], "buy_after_viewing": ["B0035PBHRM", "B00AQRXEPK", "B002MAPT7U", "B0035PBHS6"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}