{"asin": "B00HTPHK5W", "related": {"also_bought": ["B007Q45EF4", "B0083J7E9A", "B00HR4XSPQ", "B00E174RTS", "B009ZIILLI", "B004B8GF7Y", "B00DQUNODQ", "B00I4C5QQE", "B00FLKW0JI", "B00F25Z0FS", "B00713RSE0", "B00FZLV9G8", "B004T0CEBK", "B00DOP3NPW", "B00DJ83070", "B00HX0RTMC", "B00HX0RTTU", "B005Z5HT2M", "B00C0QEUCG", "B00AWIPITS", "B00CBNG10C", "B001TVAU0E", "B002BH3I9U", "B00CSIOLXY", "B00D6OHHEE", "B00AJHBBOI", "B00GTGETFG", "B00CKIFPQY", "B00GJFGE3W", "B0047Y1HMK", "B008JGR9MO", "B0082D5660", "B00AHU2U7O", "B000083KIH", "B009A6CZYO", "B009QZH6JS", "B00DR0PDNE", "B000I23TTE", "B00I0SCD72", "B00JNJPS4W", "B004GF8TIK", "B00GWR373M", "B008AGQMQC", "B00AVLOHJ8", "B002VPE1QG", "B0073FCPSK"], "bought_together": ["B007Q45EF4"], "buy_after_viewing": ["B00I4C5QQE", "B00E0GRRR4", "B00AWIPITS", "B00AVLOHJ8"]}, "title": "Photive BTH3 Bluetooth 4.0 Headphones with Built-in Mic and 12 Hour Battery. Includes Hard Travel Case. 2014 New Release", "price": 69.95, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41ZAnQEvXVL._SY300_.jpg", "brand": "Photive", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]], "description": "Photive Bluetooth Stereo HeadphonesListen to your favorite tunes with the Photive PH-BT3 wireless headphones designed with the latest Bluetooth 4.0 technology. This multifunctional pair of headphones will deliver amazing sound quality and lasting comfort. Featuring a lithium ion battery that will give you up to 12 hours of uninterrupted playtime, and charges completely in only 3 hours. The lightweight, slim design of the PH-BTH3 headphones also makes it an excellent travel companion. The headphones come with their own hard travel case.&bull; Bluetooth 4.0- Advanced CSR Bluetooth 4.0 technology. Stream your music wirelessly up to 33ft.&bull; Premium sound- Uncompromising sound quality. 40 mm drivers for excellent bass, precise treble and clear mid tones. Youll hear every satisfying note of your music at its best.&bull; 12 Hour Lithium-ion rechargeable battery- Enjoy hours of uninterrupted music, podcasts, phone calls and movies before the next charge.&bull; On Board Controls- Control your music quickly and easily with controls located on the headphone.&bull; Easy Pairing- Pairs easily, no code needed&bull; 3.5mm Aux input- Includes and a 3.5mm stereo cord for quick and easy connections to devices without Bluetooth.Included AccessoriesUSB charging cableHard Travel Case3.5mm Audio CableUser's guideWarranty1 Year Parts and Labor"}