{"asin": "B002BSA2LQ", "description": "Whether it's an exotic sports car like the new Audi R8 V10, a classic American muscle car like the Ford GT or a hot Asian import like the Nissan 370Z, everyone has a dream car. Now you can drive that dream with Turn 10's latest racing epic. Exclusively for Xbox 360,Forza Motorsport 3unites the racing game genre, making it possible for everyone to experience the thrill of the world's most exotic and exquisite cars..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }400+ customizable cars.View larger.100+ international tracks.View larger.Amazing in-car detail.View larger.New game modes &amp; events.View larger.Live the most realistic racing experience ever as you take the wheel of more than 400 of the most-beloved cars on over 100 renowned real-world tracks and exotic road courses from around the globe. With breathtaking high-definition graphics and the most advanced vehicle performance modeling in a video game,Forza Motorsport 3includes a host of driving assists and adjustable skill levels to make the game a gripping pick-up-and-play experience for audiences of all ages and skill levels.Your escape into the world of car culture inForza Motorsport 3doesn't stop at the track. Turn 10 is a proven leader in user-generated content creation in games.Forza Motorsport 3further fuels the imaginations of its already thriving community of painters, tuners and photographers with improved customization tools and brand-new ways to share creations with the world via Xbox LIVE.* Xbox LIVE makes your journey into theForza Motorsportcommunity and the world of user-generated content easy and fun. A love of cars lives in all of us.Forza Motorsport 3is the automotive playground we've all been waiting for.Key Game FeaturesWhere Dreams are Driven: The Cars and TracksFeaturing the latest and greatest production offerings as well as the world&rsquo;s fastest and most exotic street cars,Forza Motorsport 3offers more than 400 fully customizable and tunable cars from over 50 of the world&rsquo;s leading manufacturers. Whether your passion is classic American muscle cars, European roadsters, purpose-built race cars or high-tech Asian imports,Forza Motorsport 3puts you in the cockpit of the cars you love. In addition to the return of world-famous tracks from previousForza Motorsportgames, including Suzuka, N&uuml;rburgring Nordschleife and the Sebring International Raceway,Forza Motorsport 3invites you to conquer the corners on more than 100 tracks, including some of the most beautiful road courses in the world. New environments like the gorgeous mountainous Montserrat region in Spain, the rugged Amalfi Coast in Italy and the American Southwest are presented in such majestic detail that you might find yourself pulling over just to take it all in.The Look and Feel of a Modern Racing GameForza Motorsport 3is the definitive racing game. The appreciation of the automobile inForza Motorsport 3is due in large part to the team&rsquo;s attention to detail. This is why automotive engineers from manufacturers like Audi and champion race teams like Peugeot as well as experienced computer graphics specialists from across Microsoft Corp. have all teamed up with Turn 10 to makeForza Motorsport 3the most beautiful and realistic racing game ever made. All 400-plus cars in the game have been built with more than 10 times the amount of polygons asForza Motorsport 2. This includes painstakingly researched cockpits and interiors for every vehicle. But realism isn&rsquo;t just about pretty graphics. Turn 10 takes realism to new heights, leading the industry with the most advanced physics model, artificial intelligence and damage calculations. Whether it&rsquo;s the differences in how each car handles through the corners, how the engines sound at top speed or how different tires and upgrades impact your car&rsquo;s performance, you&rsquo;ll find yourself leaning into your turns as if you were really behind the wheel of your favorite ride.It&rsquo;s Easy to Go for a SpinForza Motorsport 3redefines the racing genre. Simulation games can be too hard for some players.Forza Motorsport 3rises above the distinction between simulation and arcade games. Using a myriad of cutting-edge driving and gameplay assists such as auto-braking, gameplay rewind and auto-tuning,Forza Motorsport 3delivers an experience where everyone can have fun behind the wheel, regardless of your skill and dexterity. Whether you&rsquo;re a newcomer or a seasoned racing game pro,Forza Motorsport 3caters to how you drive and evolves with you over time as your skills increase.Express Your Car PassionUser-generated content and Xbox LIVE. Painters and tuners will once again be able to showcase creativity through the celebrated Livery Editor, Auction House and deep tuning garage inForza Motorsport 3. The car is literally the artistic canvas as some of the world&rsquo;s most creative car painters and designers find new layers of depth and freedom to create shocking visual masterpieces before sharing them with others over Xbox LIVE.* Each car inForza Motorsport 3is fully upgradable, allowing gear heads to take on the challenge of turning a Honda Civic into a supercar killer. New Xbox LIVE Leaderboards celebrate not only the greatest racers but also the most prolific car tuners and painters in the community.New Game ModesForza Motorsport 3is an epic racing game featuring more content and more ways to play than any racing title today. An innovative single player season mode puts you through a completely personalized racing calendar that includes more than 200 different events, including Circuit, Oval, Drag, Drift and Timed Events. No two calendars are the same; they react to the cars you love and the races you enjoy most. In addition, the online multiplayer mode* gains an all-new game rules editor. This gives players a never-ending variety of ways to play with friends. Whether you&rsquo;re a speedster, dragster, drifter, painter, tuner or just a lover of cars,Forza Motorsport 3is the definitive racing game for you.* Xbox LIVE Gold account required for online multiplayer gameplay.", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/416kPwurjOL._SY300_.jpg", "related": {"also_bought": ["B0050SY0L2", "B000FRVCAA", "B003O6E986", "B001DTHT6U", "B0056WJA7Q", "B003R783IY", "B0047EIRIM", "B003VWGBD4", "B000B6ML28", "B005NH6NMY", "B003ZSP0WW", "B000BQUV5M", "B000UKZ20S", "B0050SWTAQ", "B00D9EPI38", "B0048C8VKM", "B00DAG165Y", "B000GPZSBK", "B003UT9XII", "B00BU3ZLJQ", "B0043QL2FE", "B004AGYHUE", "B006ZPAYMI", "B00488PZ1E", "B001TOMQTY", "B00C710AZ0", "B004M8NR7E", "B004WL4LWQ", "B007M6W38W", "B00647630Y", "B002I0JC72", "B006VB2UNM", "B003IMGC2C", "B007YZ5QQM", "B002I0JBVY", "B000MKA60W", "B00FATRKWM", "B004Z4ZJZS", "B008277M0Y", "B004T7PWZ8", "B000ZKBJY6", "B002I0JB6E", "B00AY1CT4U", "B000VBIGK4", "B004LWVHIM", "B0050SYYTK", "B008BT80UY", "B002I0J9M0", "B003O6EE4U", "B0046CC4R0", "B0050SYZ2G", "B003O6EAM6", "B007VIYQVS", "B000RI17FM", "B003TJVKAS", "B004X56OU8", "B00DWXV1BE", "B005JQ05N2"], "bought_together": ["B003ZSP0WW"], "buy_after_viewing": ["B003O6E986", "B0047EIRIM", "B003ZSP0WW", "B000FRVCAA"]}, "salesRank": {"Video Games": 1935}, "categories": [["Video Games", "Kids & Family", "Xbox 360", "Games"], ["Video Games", "Xbox 360", "Games"]]}