{"asin": "B002SFDJMQ", "description": "The Roku player instantly delivers HD-quality movies and TV shows directly to your TV over the Internet. The affordable Roku player is compact, easy to set up and intuitive to use.The Roku comes with everything you need to start watching within minutes of opening the box - the standard yellow, white and red cables, both Wi-Fi and Ethernet are built in, wireless remote and batteries. Start watching instantly anywhere you have a TV and a high-speed Internet connection.More than 50,000 titles are currently available from Amazon Instant Video and Netflix, with many available in HD.&nbsp;The Wall Street Journal, CNET, WIRED, and other publications have given the Roku player overwhelmingly positive reviews.For even better audio and video using the Roku player with your HDTV, home theater or A/V receiver, look for theRoku digital video player plus premium cable pack.As Easy As 1 - 2 - 31. Wired or Wireless, The Choice is YoursYou can connect the Roku player to the Internet using most broadband providers (such as a cable modem or DSL connection.) You need at least 1.2 Mbps to watch movies instantly on the Roku digital video player with decent quality. The faster your connection, the better the quality (although this rule-of-thumb peaks out at about 5mbps). Use the built-in Wi-Fi capabilities to connect to your wireless network, or use the Ethernet port for a wired connection. It's easy either way.2. Connect to Virtually Any TV, New or OldThe player comes complete with everything you need to get connected right away. It even includes the standard yellow, white and red cables. Or use the HDMI or component connections with your new HDTV.3. Control is at your Fingertips and Easy to UnderstandThe Roku player is easily controlled using the handy included remote. Choose the item you want to watch, play, fast-forward, rewind, pause and resume play later, just like watching a DVD.Watch Netflix Movies and TV Episodes InstantlyNetflix instant streaming ready Netflix members can now easily access over 12,000 movies and TV shows &ndash; including some new releases and hundreds of options in HD &ndash; instantly from Netflix over the internet. Netflix members can watch as much as they want and as often as they want without paying more or impacting the number of DVDs they receive. Start watching movies and TV episodes instantly in as little as 30 seconds.Roku Player is Netflix Members' #1 Rated Streaming DeviceIf you are like most Netflix customers and on a Netflix Unlimited plan (any plan that costs $8.99 a month or more), there are no limits to how much you can watch instantly. You can watch as much as you want. There is no extra charge for online viewing, and of course you still get DVDs by mail.Fill Your Instant QueueUse the Netflix site to browse a growing library of over 12,000+ instant movies and TV episodes &ndash; including hundreds in HD. Place choices in your Instant Queue, add more whenever you want, and keep them as long as you like.&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;Choose and Watch on your TVFrom your couch, use your remote to browse your Instant Queue and choose something to watch. Pause, fast-forward, rewind, or watch a favorite over and over &mdash; just like owning a DVD.SpecificationsNetworking:&nbsp; Wi-Fi (802.11b/g) with WEP, WPA, and WPA2 support; 10/100 Ethernet (RJ-45)Video Outputs:Composite video, S-Video, Component video (Y/Pb/Pr), HDMIVideo Modes:16:9 HD (720p), 16:9 anamorphic (480p), 4:3 standard (480i)Audio Output:Stereo (L/R RCA), Digital Optical (Toslink), Digital over HDMIRemote Control:NEC protocol, supported by various universal remotesPower Input:5V, 1.5A provided by included AC adapterPower Consumption:5 watts peak, 3 watts in standbySize:5 x 5 x 1.75 inches (130 x 130 x 41 mm)Weight:11 oz (300 grams)", "title": "Roku HD-XR Player", "price": 94.47, "imUrl": "http://ecx.images-amazon.com/images/I/41cPSfXyppL._SX300_.jpg", "related": {"also_viewed": ["B002U6EWPG", "B00426C55G", "B001PIBE8I", "B00426C56U", "B007KEZMX4", "B005JACJ50", "B005DOUJL8", "B005CLPP8E", "B005CLPP84", "B000RFURG0", "B00F5NB7MW", "B0042SDDXM", "B005MR6CNK", "B0092QV9GM", "B00BGGDVOO", "B00AXXOBEK", "B00F5NB7JK", "B006M6VG5Y", "B005P58DEK", "B00I9GW9VU", "B00IIVH2AE", "B00FO12XY6", "B00F7STLL4", "B00AM0ESC4", "B0000DH8HH", "B00HIYXU5I", "B00CBYYKKY", "B0092S2TPA", "B009VXUFLG", "B008BDBPTS", "B007NJ6S9S", "B00AXXOBEU", "B0092U3TKC", "B00LFLPUIK", "B009SDNHNW", "B0042RA8C2", "B00GK0QMS8", "B006WB27G6", "B00B6K5QZW", "B00DVEG2F4", "B00EPFNITG", "B00J7YWOT0", "B009D5Q82M", "B005MJWGJC", "B00KNDHD54", "B00GHGMCN4", "B00E955HKA", "B007BI2C2I", "B00INNP5VU", "B00GUPZ7JS", "B00B9D2QXQ"], "buy_after_viewing": ["B00BGGDVOO", "B00F5NB7JK", "B003L1ZYYM", "B00FO12XY6"]}, "categories": [["Electronics", "Television & Video", "Streaming Media Players"]]}