{"asin": "B000A0EFHY", "description": "Acclaimed game creator Michel Ancel and the Montpellier studio collaborate with triple Academy Award winning filmmaker Peter Jackson and visual-effects company Weta Ltd. to developPeter Jackson&#146;s King Kong,a video game that will capture the imagination, vision, and emotion of the epic film. Delve deeper into the film experience through alternative viewpoints designed to immerse the player into the action and truly \"feel\" the tension of the adventure.Features:Unprecedented alternating gameplay: battle for survival on Skull Island in first-person as Jack Driscoll and experience the staggering power of King Kong in third-person taking on massive beasts.Cinematic quality: by integrating Weta assets directly into the game engine, and taking a true cinematic approach, from both a visual and audio perspective, players are thrust directly onto the Skull Island where the dark jungles, over-sized environment, and lurking danger become reality.Cooperate with your expedition team: Each team member plays a crucial role and complements each other with valuable skills and abilities. The player relies on them and vice-versa to succeed. The unique resource management system keeps the action seamless and plausible while keeping items, weapons, and assets readily available.The power of King Kong: King Kong is one of the most powerful of all the creatures on Skull Island and players will learn first-hand what it means to be feared, respected, and dominant. Kong will use both his agility and his raw, brute strength by any means necessary to battle enemies and navigate though the perils of Skull Island.Experience all key movie moments and more: journey through the explosive action of all the key movie moments, as Jack and Kong, and even explore the beautifully rendered mysterious jungle environments not seen in the film.Engage in climactic battles: intense and unbelievable battles with all creatures featured in the film challenge players&#146; nerves and skills in fighting the savage beasts created by Weta--some of which are exclusive to the game.Film cast likeness and voice: full immersion into the dynamic King Kong universe realized via inclusion of film cast member&#146;s likenesses and voice-over.", "price": 16.25, "imUrl": "http://ecx.images-amazon.com/images/I/51WHQ2GM1KL._SY300_.jpg", "related": {"also_bought": ["B0007ULFL6", "B0000B0MNH", "B00005U8TQ", "B000TLU67W", "B00006599O", "B0007SL1ZI", "B000FW4YOQ", "B0000696CZ", "B000EMJA3M", "B000CFKXYQ", "B0009O7HVM", "B000NJH6PU", "B0009Z3HXI", "B00004YRQA", "B0001VGFK2", "B001QRWE1O", "B000RW3V7U", "B000FW87AI", "B0009SQF0C", "B0002XL3BA", "B00097CYZS", "B000067DPL", "B00011V8EA", "B000QB059Y", "B0007OSLAA", "B00006RHM0", "B000NJH6RS", "B000IZAQD8", "B0007RDM5Q", "B0009PETYO", "B000EHQDA0", "B0001DHQP8", "B0002CHIUQ", "B0009351R0", "B00004YRQ9", "B002E6XXWU", "B000277J00", "B00009ZVHY", "B0001ADAME", "B000KCX9M4", "B00005OLX1", "B0009EHQVI", "B00009P9IW", "B0009Z3HYW", "B0001NE48U", "B000UH6GEM", "B000086JYK", "B0002GTFIK", "B000GPVUQ2", "B0002CHJ3M", "B00005V6BP", "B0000TSRA6", "B000GDJJP8", "B00020LZAM", "B000G6SPHI", "B001814QDW", "B000930DLO", "B0009R1T9K", "B0008GJRRS", "B0000A0MDV", "B0002RQ3I4", "B000069BCR", "B001UIG6M2", "B0001I9YGC", "B000CRSBLG", "B00005V6BE", "B00004UFRI", "B00114XU5Q", "B0001AVZ5I", "B0002IQCSY", "B00009ZVHW", "B00005NCC9", "B0007PLKZM", "B0002ZHDCG", "B000M4H6RE", "B000F0GX8I", "B0015ACX3Q", "B00067MX98", "B0009351PM", "B001MW91IW", "B00008URUA", "B0002IQC70", "B00026RFI2", "B00006C28Z", "B000RHZJK2", "B004S3KB6S", "B00005O0I2", "B00004U5VF", "B0009JB4IY", "B0009R1TGS", "B000A0EFJM", "B000066TS5", "B00006AMZR", "B0000640A2", "B00008XPJH", "B00020LZAW", "B000ERVLZ2", "B000GQ1FVQ", "B0033T1UWW", "B0009Z3K9O"], "bought_together": ["B0007ULFL6", "B000TLU67W"], "buy_after_viewing": ["B0007ULFL6", "B000CFKXYQ", "B000TLU67W", "B0038N09Q6"]}, "salesRank": {"Video Games": 11629}, "categories": [["Video Games", "More Systems", "PlayStation 2"]]}