{"asin": "B0000645C9", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Inch for inch and ounce for ounce, Canon's PowerShot S200 Digital Elph  packs more power into less space than virtually any other digital camera,  stuffing a feature-packed, 2-megapixel camera with 2x optical zoom into a  diminutive brushed-metal case that slips easily into a purse or pocket.ResolutionLike last year's S110, the S200 features a 2-megapixel sensor for sharp prints  at sizes up to 8 by 10 inches. With cameras of up to 5 megapixels now on the  market, some enthusiasts were hoping the Elph would make  the jump to 3 megapixels, but it appears that Canon still believes 2 megapixels  remains the best balance between performance and price for most consumers. We  tend to agree. If you regularly print your photos at sizes larger than 8 by 10  inches, you'll probably want a camera with higher resolution and more manual controls than the Elph  offers--we recommend Canon's 3-megapixel S30 or 4-megapixel S40.OpticsA 2x optical zoom lens (35-70mm equivalent) aids in photo composition, and an  additional 2.5x digital zoom (5x total) further magnifies your image. Remember,  however, that digital zoom reduces the sharpness and detail of your image, so  it's best used sparingly. Two systems help ensure your pictures will be  perfectly focused, even in challenging conditions: a multizone autofocus works  even when the subject of your photo isn't in the center of the scene, and in  low-light situations (a particular weakness of many digital cameras), a  focus-assist lamp sends out a small patterned beam to help the camera accurately  determine distance. If you're hoping for a more powerful zoom, the S330 Elph has  a 3x zoom and slightly larger dimensions but is otherwise nearly identical.More FeaturesThough it's primarily designed as a point-and-shoot, the S200 includes several  advanced features for photographers who want more creative control, including  exposure compensation, low-light manual shutter speeds, manual ISO and white  balance, and stitch assist, plus black-and-white, sepia, vivid, and neutral  modes.A movie mode captures video clips with sound. Depending upon resolution, these  clips can last from 2 to 60 seconds. The limited length and resolution of these  clips guarantees that this feature won't replace your camcorder, but it's  perfect for when you just want to capture a quick movie and e-mail it to a  friend or relative. In addition, you can add up to 60 seconds of audio to each  still picture you take.PowerThe S200 uses a proprietary lithium-ion rechargeable battery, and both the  battery and the charger are included. Though the new NB-1LH looks identical to  (and is interchangeable with) the NB-1L batteries shipped with previous Elph  models, the new battery holds 840 mAh of energy, a 23 percent increase. Because  the battery is unique to the Elph cameras and can be nearly impossible to find  when on the road, we strongly recommend getting a spare if you're planning to  take the camera on extended outings.Storage and TransferImages are stored on standard Type I CompactFlash cards. Consider the included 8  MB card a starter capacity, since its 12-picture limit means you'll need to  return to your computer often to transfer images and free up the card for more  pictures. A 128 MB card is a great size for this camera, storing around 200  images. To transfer images to your computer, simply attach the included USB  cable between your PC and your camera. Your computer should automatically  recognize your camera and let you move the pictures to your hard drive.PrintingCanon has introduced a series of printers designed to work directly with the  S200. Using these printers, no computer is required--simply connect the camera  to the printer and start printing. The CP-10 produces credit-card-sized prints,  and the CP-100 makes 4-by-6-inch prints. Both use continuous-tone technology for  results that are indistinguishable from traditional photos. Of course, photos  from your Elph can also be printed on any home computer system with an inkjet  printer, sent off for online processing, or simply enjoyed on your computer  screen.SizeAt just 3.4 by 2.2 by 1.1 inches and 6.3 ounces, the S200 is even smaller than  its predecessor, making it one of the smallest zoom digital cameras on the  market.Contents and Recommended AccessoriesThe package includes the S200 camera, NB-1LH battery with CB-2LS charger, AV and  USB cables, wrist strap, software suite, and 8 MB memory card.Everything you need to get started is included in the box, but we strongly  recommend the addition of a larger memory card (a 128 MB card holds around 200  images), a spare NB-1L battery, and a compact carrying case (to protect the  brushed-metal finish and keep pocket lint out of the viewfinder).--Shane  BurnettPros:Ultraportable size makes it easy to bring alongPicture quality is excellent, even in low-light situationsNew features, a better battery, and slightly smaller size are improvements  over last year's S110Cons:2-megapixel sensor is adequate for most users but starting to look low by  today's standards8 MB card is too small for more than occasional use", "title": "Canon PowerShot S200 2MP Digital ELPH Camera w/  2x Optical Zoom", "price": 47.99, "salesRank": {"Camera &amp; Photo": 13170}, "imUrl": "http://ecx.images-amazon.com/images/I/41GMHSQ7JGL._SX300_.jpg", "related": {"also_viewed": ["B00EFILNV8", "B009B0MYSQ", "B00EP70UN6", "B009B0MYLS", "B00CBYMWNQ", "B00HLDFQE4", "B005MTME3U", "B008XGS9G0", "B00I58M26Y", "B00HLDIG0A", "B00BFQ33B6", "B00HLDFQU8", "B0032JRRWK", "B003ZSHNGS", "B009AYJQ2U", "B00CFCTDMC", "B0075SUG8Q", "B0095F5AFQ", "B00005JAD8", "B00ETB8BD4", "B00IA9LMNW", "B00AWYN1O6", "B00B5HE3UU", "B004J3V7RO", "B00FPKDQ1A", "B00BW6LTG0", "B00FPKDPXY", "B002LITT42", "B00BOZCU08", "B00HLDFNKQ", "B00EFILHB4", "B00B46XSDK", "B005MTMEKI", "B0035FZJM6", "B00BOZCSQE", "B0075SUK14", "B00AQDGAPK", "B00AWYN0BU", "B00IGFFZR4", "B00BEHQKPW", "B00AWYN182", "B004HW73QQ", "B0073HSH08", "B00889ST2G", "B006UMM2BW", "B00I58M2VE", "B00HV6KLP0", "B0095F5AFG", "B001SER48S", "B005KBB79C", "B006UMM1J0", "B00I58M192"], "buy_after_viewing": ["B003VTZE1M", "B000NK5Z8Y", "B000M4C8T0", "B007M51J42"]}}