{"asin": "B0041RSPRS", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Feast your eyes on an updated G Series digital camera: The G12. It's ready to impress the advanced amateurs who have always celebrated the G Series. The G12 is still loaded with powerful technologies that has made the G Series cameras so renowned, like the Canon HS SYSTEM, 2.8-inch Vari-angle PureColor System LCD, and RAW + JPEG image modes. Now, this flagship camera paves the way with these new upgrades like 720p HD Video with stereo sound to get crystal clear footage, multiple aspect ratios, High Dynamic Range, Electronic Level, Tracking AF, a Front Dial and much more to give you even more creative control than before!Canon PowerShot G12 Highlights10.0 Megapixel sensor combined with the DIGIC 4 Image Processor creates Canon's HS SYSTEMThe PowerShot G12 employs the HS SYSTEM by combining a powerful 10.0 Megapixel CCD sensor and Canon's DIGIC 4 Image Processor. Thanks to this technological advancement, the G12 is dramatically more sensitive than cameras with identical megapixel counts, and delivers spectacular images with minimal noise. Increased sensitivity demands a higher ISO speed, and the PowerShot G12 delivers with a new maximum setting of ISO 3200. Blur and camera shake are notably reduced for the ultimate in sharpness and clarity.In addition, a new Low Light mode lets you capture images in an astonishing range of conditions. The camera automatically adjusts the ISO speed from ISO 320 to ISO 12800 in relation to ambient brightness, subject movement and camera shake.Shoot 720p HD video in stereo sound and play back on an HDTV via the HDMI outputThe PowerShot G12 lets you record video in beautiful high definition (1280 x 720 pixels). The camera also makes it easy to enjoy HD videos (and still photos) on your HDTV with a mini-HDMI connector for direct connection to a high-definition TV monitor. You'll enjoy the HD experience with no degradation of image or audio in the signal, plus the ability to display up to 130 still images at once.The PowerShot G12 also includes spectacular video functionality. When shooting video, you can get up close with the 5x Optical Zoom for riveting detail and realism, from the overall appearance to facial expressions! And the camera's Smart AUTO technology that helps ensure the perfect still image works to bring that same quality to your video.Shooting and recording modes including RAW + JPEGThe PowerShot G12's RAW mode lets you shoot images without JPEG compression. It gives you clearer images and complete creative control in editing. RAW images are transferred directly to the computer where they can then be edited using image adjustment software or a processing application to adjust your images as you please. The camera can also be set to allow the simultaneous recording of both RAW and JPEG images while shooting.Canon's Hybrid IS compensates for angular and shift camera shake during close-up shootingThe PowerShot G12 is equipped with Canon's highly advanced Hybrid IS function, which corrects camera shake from two sources to deliver sharp, blur-free images even when you zoom in close to your subject.Hybrid IS employs both an angular sensor and an accelerometer, enabling it to suppress both the blur caused by the angle of the camera and the \"shift blur\" that happens when your subject moves parallel to the camera, a problem that is especially noticeable at large zoom factors.With the ability to produce clear, steady images in all situations and at any zoom length, the PowerShot G12 is the camera you'll want to take everywhere.2.8-inch Vari-angle LCD with 461,000 dots plus an optical viewfinderThe PowerShot G12 gives you a large 2.8-inch PureColor System LCD screen for excellent control when framing your shots. But size is only part of the story. Canon's PureColor System LCD offers spectacular color, resolution and contrast even at an angle. The screen is durable and easy to see. It is a perfect feature for gathering friends and family around to see your images.5x Optical Zoom with Optical Image Stabilizer, plus a 28mm Wide-Angle LensThe camera is equipped with a long, 5x Optical Zoom, and Canon's own Optical Image Stabilizer Technology keeps images steady and blur-free all through the zoom range--even in low light--by detecting motion and generating a corrective signal. Because it is an optical system, more corrective movement is allowed and there is no degradation of image quality.The G12 is a highly versatile camera with a wide-angle zoom lens that reaches all the way from 28mm at the wide end to 140mm at the telephoto end (35mm format equivalent). You'll capture more image in every shot, and add greater depth to your overall photography.Optional accessories including Speedlite flashes, underwater housing and Tele-Converter Lens are availableThe PowerShot G12 is compatible with the Speedlite flash series intended for all EOS series SLR cameras. Attach a Speedlite flash to the hot shoe, then you can set and control the flash on the \"Flash Control\" menu in the camera. With a Speedlight, the G12 is given extra functions such as autoflash metering, FE lock and Flash exposure compensation; continuous shooting with external flash. Also Canon's Speedlite Transmitter ST-E2 enables you to have multiple slave flashes and wireless control. A Tele-Converter lens designed for the G12, Filter Adapter FA-DC58B and WP-DC34 Waterproof Case is also available.High Dynamic Range scene mode combines multiple shots into one pictureShooting in high contrast environments can often result in photos with overexposed and underexposed sections. So to tackle this problem, Canon developed the High Dynamic Range shooting mode to make select PowerShot cameras even more intuitive. Under High Dynamic Range* the camera will shoot three different exposures in a succession (underexposed, overexposed and normal) and then merge them into a single image. Underexposed areas are combined with the overexposed and vice versa, resulting in an evenly detailed image with flattering shadows and highlights.*Tripod is required.What's in the BoxPowerShot G12 Camera bodyLithium-ion Battery Pack NB-7LBattery Charger CB-2LZNeck Strap NS-DC9AV Cable AVC-DC400STUSB Interface Cable IFC-400PCUDigital Camera Solution CD-ROM", "title": "Canon G12 10 MP Digital Camera with 5x Optical Image Stabilized Zoom and 2.8 Inch Vari-Angle LCD", "price": 779.0, "salesRank": {"Camera &amp; Photo": 1643}, "imUrl": "http://ecx.images-amazon.com/images/I/41EW9HDWNdL._SX300_.jpg", "related": {"also_bought": ["B001NJHZM8", "B000KZ7YDG", "1435459504", "B002LITT5G", "B004PX56TI", "B004YGMTNC", "1454701366", "B001G5ZTRM", "0321771613", "B002HZW6YE", "B0046CA2K6", "B0041RSPSW", "B003VNKNEQ", "B003VNKNF0", "B0026MTCFY", "B001GN7A8A", "B001R4BTIA", "B00009V4G9", "B0046CA2RE", "B008515KOM", "0615992722", "B0047PFZC2", "B001E3XLZS", "B0002DF0FU", "B002CXIA78", "B001G5ZTSQ", "B001Q3VFHC", "B004Q3C98S", "B0037T3634", "B001G5ZTTK", "B004EMZ1X6", "B009B0MY6S", "B004DBE080", "B002TWYVVQ", "B004DLGL4G", "B004GYUP92", "B001W0XZYA", "B000P3ZADE", "B004OGKXPI", "B004PCGPWG", "B006QRSCQA", "B000KZD73W", "B000V1VG5G", "B007M54E08", "B0037FLUYU", "B004ATO68Y", "B004AV3EAI", "B002LCT96Q", "B0037T6OBK", "B004W2XCBQ", "B0062N2RFA", "B0000DCW2V", "B00012FVYW", "B004M8SWBK", "B0023EXKO4", "B003VNKNEG", "B0046CBE3U", "B00009MK5M", "B001GCVA0U", "B002WE4HE2", "B0039BPG1A", "B008MAZT56", "B0087N0YWG", "B00004ZCKZ", "B002EF5HDO", "B007SVKY0A", "B005HNF01O", "B002G12OBO", "B001W1BSM0", "B00CV9MKJ2", "B004J3X5RE", "B00BF0ZQDK", "B000Y9TZ9Y", "B004XIB9T6", "B003P3MCXW", "B007M54E1M", "B004J3YCGM", "B001CBKJGG", "B005MTMFHU", "B007I5JT4S", "B0042221E0", "B00004WCID", "B0068FYUTS", "B0032QIEYS", "B0046CDE9C", "B0068FXDQO", "B00488BQ9E"], "bought_together": ["B003VNKNF0"], "buy_after_viewing": ["B00EFILHB4", "B003VNKNF0", "B001G5ZTRM", "B006ZCCH76"]}}