{"asin": "B0013FNZ1M", "description": "Stylishly and intelligently designed for your on-the-go digital lifestyle, Apple's MacBook is the perfect confluence of affordability, innovation, and powerful computing. This latest iteration of the MacBook line (model MB404LL/A) gets a boost of speed from Intel's latest 45-nanometer Penryn series processors, which also helps to reduce power requirements and save on battery life. You'll enjoy quick and nimble multitasking thanks to the 2.4 GHz Core 2 Duo processor, and this MacBook also features an extra-large 250 GB hard drive and 2 GB of installed RAM (which can be upgraded to 4 GB). The 13.3-inch glossy widescreen display provides the perfect combination of pixels and portability, and the integrated 802.11n Wi-Fi LAN enables computing freedom from wires and compatibility with older 802.11b/g routers as well as the faster throughput of Apple's Airport Extreme.Measuring 1.08 inches thin and weighing only 5.0 pounds, the MacBook cuts a slim profile on any desk (or in any backpack or briefcase).Measuring a mere 1.08 inches thin and weighing in at only 5.0 pounds, the MacBook cuts a slim profile on any desk (or in any backpack or briefcase). A durable polycarbonate shell in black keeps it ready for the rough and tumble of everyday life. It also offers a unique keyboard design that sits flush against the bed for a sleeker, lower profile. Other standard Apple \"extras\" includes a built-in iSight video camera and Apple's magnetically connected MagSafe power adapter, which safely disconnects when under strain.It's pre-loaded with Apple's Mac OS X 10.5 Leopard operating system, which enables easy backup of your most important data via Time Machine, a redesigned desktop that helps eliminate clutter. It also comes with the iLife '08 suite of applications--including iPhoto, iMovie, Garageband, and iTunes--and the newest version of the fast-loading Safari web browser. Other hardware features include an 8x combo Superdrive (for burning dual-layer DVDs as well as CDs), built-in Gigabit Ethernet for high-speed networking, Bluetooth 2.0+EDR (Enhanced Data Rate), a FireWire 400 port, DVI video output, and Intel GMA X3100 graphics processor with 144 MB of shared memory.Apple InnovationsThe magnetically connected MagSafe power adapter breaks cleanly away, without damage to either the cord or the MacBook, if you trip over the cord.With two-finger scrolling, the trackpad becomes a fast track to wherever you want to go.One of Apple's most celebrated innovations is the MagSafe power adapter connector with offers a magnetic connection instead of a physical one. So, if you happen to trip over a power cord, you won't send MacBook flying off a table or desk--the cord simply disconnects, without damage to either the cord or the system. As an added nicety, this means less wear on the connectors.Cleverly integrated above your MacBook display is an iSight camera, providing easy video chat capability when using iChat. You can also snap photos in Photo Booth to send via e-mail, as well as record videos and then edit them in iMovie before uploading them to web sites.The trackpad can tell if you've got one finger on the pedal, or two. With two, you can easily scroll around your documents or open contextual menus. When you need right-click functionality, simply open \"Keyboard and Mouse\" in System Preferences and enable the secondary click preference. Opening and closing your MacBook is also a pleasure, thanks to a magnetic latch that catches without a catch. And because it's a magnet, there are no moving parts to snag, jam, or break.Intel Core 2 Duo ProcessorExperience improved energy efficiency, expanded wireless connectivity, and amazing battery life with the 45nm Penryn series Intel Core 2 Duo T8300 processor, which has a 2.40 GHz processor speed, super-fast 800 MHz front-side bus (FSB), and a large 3 MB L2 cache. (An L2, or secondary, cache temporarily stores data; and a larger L2 cache can help speed up your system's performance. The FSB carries data between the CPU and RAM, and a faster front-side bus will deliver better overall performance.)The new hafnium-infused circuitry--which reduces electrical current leakage in transistors--conserves even more energy, giving you more time away from the wall outlet. With a substantial 3 MB of shared L2 cache, data and instructions can be kept close to the two processor cores, greatly increasing performance and allowing the entire system to work more efficiently. And, because the processor cores share the L2 cache, either can use the entire amount if the other happens to be idle.Hard Drive and MemoryThe 250 GB Serial-ATA (SATA) hard drive (5400 RPM) quickens the pace with a higher speed transfer of data--akin to FireWire and USB 2.0. The 2 GB of PC5300 DDR2 RAM (two SO-DIMMs of 1024 MB) have an industry-leading 667 MHz speed, and the RAM capacity can be increased to 4 GB.Wireless ConnectivityThe built-in 802.11n wireless networking provides up to five times the performance and twice the range of 802.11g, but it's also backward-compatible with 802.11a/b/g routers, enabling you to communicate with the a wide variety of Wi-Fi resources. It works seamlessly with the new AirPort Extreme with 802.11n. Use the built-in Bluetooth wireless technology to connect to your PDA or cell phone, synchronize addresses, or download pictures from your cell phone. You can also use a wireless headset for iChat audio chats and VoIP calls as well as quickly share files with a colleague.Display and GraphicsWhether you're working on a Keynote presentation or watching a movie before you catch a flight, every document, video, and photo on your MacBook will look sharp on the glossy 13.3-inch widescreen display. With pixel-perfect 1280-by-800 resolution, it's great for viewing and working with media. Video is powered by the Intel Graphics Media Accelerator X3100, which provides 144 MB of DDR2 SDRAM shared with main memory. It features Intel Clear Video Technology, which delivers outstanding video playback with sharper image quality, increased clarity, and enhanced visual quality of interlaced content on progressive displays.Video Conferencing with Built-in iSightArtfully placed in the display bezel is an iSight camera, which enables easy video conferencing as well as allows you to snap pictures of yourself and create video podcasts. Using the iChat AV application, video conferencing is integrated into your iChat buddy list, so initiating a video conference is a breeze. iChat also lets you hold audio chats with up to 10 people and provides high-quality audio compression and full-duplex sound so conversation can flow naturally. For video podcasting, you can record a short clip using the iSight camera, then use iWeb to create a video blog entry or post your GarageBand-recorded podcast.Other Features8x slot-loading SuperDrive with the following write speeds: 8x DVD&plusmn;R; 4x DVD&plusmn;R DL (double layer); 4x DVD&plusmn;RW; 24x CD-R; 10x CD-RWMini-DVI port for video output (VGA adapter and mini-DVI to DVI adapter sold separately)Built-in stereo speakers and omnidirectional microphoneCombined optical digital audio input/audio line inCombined optical digital audio output/headphone outTwo USB 2.0 ports, one FireWire 400 portBuilt-in full-size keyboard with 78 (U.S.) or 79 (ISO) keys, including 12 function keys, 4 arrow keys (inverted \"T\" arrangement), and embedded numeric keypadSolid-state scrolling trackpad for precise cursor control; supports two-finger scrolling, tap, double-tap, and drag capabilitiesKensington cable lock slotMeets ENERGY STAR requirementsMeasures 12.78 x 8.92 x 1.08 inches (WxDxH) and weighs 5 poundsConnect to your network, a desktop monitor and all your peripherals with two USB 2.0, one FireWire, one DVI video output, and one Gigabit Ethernet.Preloaded with Leopard, you'll enjoy enhanced productivity and a clutter-free desktop (thanks to the redesigned 3-D Dock with Stacks).Preloaded with Leopard and iLife '08The biggest Mac OS X upgrade ever, the Mac OS X 10.5 Leopard operating system features over 300 new features, including:Time Machine, an effortless way to automatically back up everything on a MacA redesigned Finder that lets users quickly browse and share files between multiple MacsQuick Look, a new way to instantly see files without opening an applicationSpaces, an intuitive new feature used to create groups of applications and instantly switch between themA brand new desktop with Stacks, a new way to easily access files from the DockMajor enhancements to Mail and iChatLeopard's new desktop includes the redesigned 3-D Dock with Stacks, a new way to organize files for quick and easy access with just one click. Leopard automatically places web, e-mail and other downloads in a Downloads stack to maintain a clutter-free desktop, and you can instantly fan the contents of this and other Stacks into an elegant arc right from the Dock. The updated Finder includes Cover Flow and a new sidebar with a dramatically simplified way to search for, browse and copy content from any PC or Mac on a local network.Time Machine lets you easily back up all of the data on your Mac, find lost files and even restore all of the software on their Mac. With just a one-click setup, Time Machine automatically keeps an up-to-date copy of everything on the Mac. In the event a file is lost, you can search back through time to find deleted files, applications, photos and other digital media and then instantly restore the file.The MacBook also comes with the iLife '08 suite of applications that make it easy to live the digital life. Use iPhoto to share entire high-res photo albums with anyone who's got an e-mail address. Record your own songs and podcasts with GarageBand. Break into indie filmmaking with iMovie and iDVD. Then take all the stuff you made on your MacBook and share it on the web in one click with iWeb.Included SoftwareMac OS X v10.5 Leopard (includes Time Machine, Quick Look, Spaces, Spotlight, Dashboard, Mail, iChat, Safari, Address Book, QuickTime, iCal, DVD Player, Photo Booth, Front Row, Xcode Developer Tools); iLife '08 (includes iTunes, iPhoto, iMovie, iDVD, iWeb, GarageBand); Microsoft Office 2004 for Mac Test Drive; iWork '08 (30-day trial)What's in the BoxMacBook, 60W MagSafe Power Adapter, AC wall plug, and power cord, lithium-polymer battery, install/restore DVDs, printed and electronic documentation.", "title": "Apple MacBook MB404LL/A 13.3-inch Laptop (2.4 GHz Intel Core 2 Duo Processor, 2 GB RAM, 250 GB Hard Drive) Black", "imUrl": "http://ecx.images-amazon.com/images/I/4154PrAYs%2BL._SX300_.jpg", "related": {"also_viewed": ["B002QQ8EKO", "B002C7489S", "B004FK3QWK", "B0013FLU96", "B002C7446A", "B00578N1JM", "B001P05NKG", "B003GSLU3E", "B0017J7T7A", "B002QQ8H8I", "B0047DVVZO", "B002C7458M", "B005788TW6"], "buy_after_viewing": ["B004NELCLU", "B002QQ8EKO", "B003V0NXBO", "B002UHADYY"]}, "categories": [["Electronics", "Computers & Accessories", "Laptops"]]}