{"asin": "B000SQ5LQE", "description": "About HazeSet in the year 2048 in a world where governments have outsourced military operations to private military corporations (PMCs), you play as Shane Carpenter, a newly enlisted soldier seeking fulfillment and thrills by fighting for a good cause. As the leading PMC, Mantel Global Industries offers an array of cutting-edge military equipment, including a high-tech arsenal of vehicles, deadly weaponry, and the performance-enhancing drug Nectar.Your conflict begins in a war-torn country where you have been sent to fight a vicious rebel faction, the Promise Hand. At first all is well, but things quickly begin to look a little strange.Expose the truth, switch sides, and break away from Mantel.Evolve from a ruthless high-tech Mantel Trooper to a cunning Promise Hand rebel.Uncover the truth, switch sides, and break away from Mantel&#146;s manipulative grip when you join your former enemies, the Promise Hand.Features:Impeccable FPS (first-person shooter) credentialsFrom the developers of the critically acclaimedTimeSplittersseries and the publishers ofGhost Recon Advanced WarfighterandFar Cry.Play both sides of the warEvolve from a ruthless high-tech Mantel Trooper to a cunning Promise Hand rebel, each featuring distinct game systems, weaponry, and abilities.You'll be equipped with the most advanced gear and deadliest weapons.Under the influence, a Mantel trooper is empowered by Nectar.Experience the power of a Mantel TrooperYou'll be equipped with the most advanced gear and deadliest weapons and empowered by Nectar, Mantel&#146;s battlefield-optimized performance-enhancing medication that lets you boost your fighting abilities and experience the highs and lows of drug-laden warfare. Perform fighting abilities such as Nectar Focus, Nectar Foresight, and Melee Blast.Expose the truth, switch sides, and break away from Mantel&#146;s controlJoin up with your former enemies, and lead the rebels against the Mantel army. Use your knowledge of your former teammates&#146; weaknesses and new abilities and techniques such as Play Dead, Weapon Stealing, and the deadly Nectar Grenade.Cutting-edge gaming technologyExclusively developed for the PLAYSTATION 3 system featuring the Disparity Rendering System, which shapes players&#146; views of the world on and off Nectar. Haze also features an entirely streaming experience and the Conspire AI System, in which all enemy behaviors are entirely dynamic--nothing is scripted.State-of-the-art multiplayer modesFire up your console for online battles and choose from a variety of online modes, including furious four-player co-op action. Play as both Troopers and Rebels and unveil hidden secrets from the single-player campaign.", "price": 9.95, "imUrl": "http://ecx.images-amazon.com/images/I/518wrFCoBOL._SY300_.jpg", "related": {"also_bought": ["B000K9OR4Q", "B00170823O", "B000R3CIV4", "B002DC8GKO", "B001C4DKG4", "B005185SDA", "B000HGOHWO", "B000JLIYLC", "B000KLNLUK", "B002BRZ744", "B000QAVV6G", "B002BXJ9VA", "B000ZK7ZOY", "B000WS97QI", "B002I0K6DG", "B000K9OP2A", "B000SQ5LNM", "B000WJFZEA", "B001COV1CY", "B004L5SJ58", "B000ZK7ZOE", "B000O5FULU", "B001D5DQL6", "B00104KCF8", "B007UM599S", "B000M4KJ32", "B000FPOJOS", "B004BCZLQ6", "B003O6E620", "B000N4MSAS", "B00320JAWY", "B000UW1YBW", "B00109KMQ2", "B00319DX4M", "B004UDB9SA", "B003O6E3QY", "B001ASJIS6", "B000ZK695U", "B0053B7ICO", "B004UCX0VU"], "bought_together": ["B000K9OR4Q"], "buy_after_viewing": ["B000K9OR4Q", "B00170823O", "B005185SDA"]}, "salesRank": {"Video Games": 7818}, "categories": [["Video Games", "PlayStation 3", "Games"]]}