{"asin": "B0023NVS30", "description": "The iHM7 from iHome is the perfect stereo speaker system for your iPod, iPhone, Macbook, or any other laptop or MP3 player. These speakers attach magnetically in a capsule shape for ultimate portability, then separate and extend for surprisingly big stereo sound in small package.Fold Up and GoThe iHM7 features a pair of collapsible speakers connected by a spring system. When you want to use them, you just give them a quick twist, and the speakers extend. The rubberized paint texture gives them a great look and soft feel, perfect for frequent use.When folded up, the speakers attach magnetically for portability, in a capsule shape. A protective carry case and cord wrap are also included for added convenience.Audio JackConnect most any audio device thanks to the standard 3.5-mm audio jack: all iPod/iPhone models, MP3 players, CD players--you name it. An audio cable is also supplied, in case you don't have one lying around.Great for LaptopsThe iHM7 is perfect for enhancing the movie/music experience on laptops. Throw it in your laptop bag and you'll have a convenient speaker system wherever life takes you, with a little more \"oomph\" than those built-in laptop speakers.Great SoundThe iHM7 boasts a custom-tuned vacuum bass design, allowing it to deliver a low-frequency response and overall sound beyond its size.USB ChargingWith long-lasting li-ion rechargeable batteries built in, the iHM7 gives you plenty of playback time. When you do need a charge, grab the included USB cable and connect to any USB port, such as those on your computer, and you'll be set.What's in the BoxiHM7 Speaker System (Purple), 3.5-mm audio cable, USB cable, and user's manual.", "title": "iHome iHM7 Rechargeable Mini Speaker for iPod (Purple)", "price": 12.99, "imUrl": "http://ecx.images-amazon.com/images/I/41WT6Vf%2BfrL._SY300_.jpg", "related": {"also_viewed": ["B004OA733E", "B004OA6VZU", "B00BCMHZLC", "B00343HAJ4", "B004OA714U", "B00B2IRCLE", "B00BCMI0Q6", "B002ZAVVHY", "B0082E9K7U", "B00343DNJK", "B00BCMI084", "B0094FZF9I"], "buy_after_viewing": ["B004SNDC50", "B002XNO7FQ", "B004OA733E", "B001UEBN42"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}