{"asin": "B000MGGTY8", "categories": [["Electronics", "Computers & Accessories"]], "description": "Amazon.com Product Description The Hauppauge 1178 WinTV-HVR-1600 includes dual TV tuners to let you watch both digital and analog television on your PC, in a window or full screen. With PVR software and built-in hardware for MPEG-2 encoding, you can also record television onto your computer for viewing later without slowing down your computer..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The Hauppauge 1178 WinTV-HVR-1600 offers:Dual TV tuners to watch digital and analog television signals.Compatible with ATSC and QAM digital TV, and analog cable TV signals.Dbx-TV stereo decoding for spectacular sound.Built-in MPEG-2 hardware encoding.Dual tuners lets you watch both digital and analog signals.View larger.Watch High-definition Digital TV on Your ComputerWith dual format TV tuners, the WinTV-HVR-1600 lets you watch ATSC digital TV as well as QAM digital TV and analog cable TV. ATSC digital TV, which typically requires an antenna for reception, is the over-the-air HDTV standard for North America. ATSC broadcasts range in resolution from standard definition up to the high definition 1080i format. (To check the ATSC digital transmissions in your area, input your zip code at titantv.com.)The WinTV-HVR-1600 also lets you watch and record QAM channels, which are unencrypted digital channels broadcast by your local cable operator. If you don't have access to digital television channels yet, you can also watch regular analog cable television. And with the included remote control, you can control your cable TV or satellite set top box.In addition to high-definition video, the card also features a dbx-TV stereo decoder for great TV sound. The card has Composite/S-Video and audio inputs that allow for connecting VCRs or cable/satellite set top boxes.Your Own Personal Digital Video Recorder!With the included software, you can easily record TV shows to your hard disk using MPEG-2. Several recording options are available depending on your playback needs; higher quality video requires more disk space. Generally, 5 gigabytes of disk space is used per hour of ATCS digital TV recordings.. Thanks to the built-in hardware MPEG-2 encoder, your PC continues to run at full speed even while recording.The WinTV application offers an elegant interface to watch TV in a window or full screen.View larger.With the WinTV-Scheduler software, easily schedule the recordings of your favorite television shows daily, weekly, or just once. You can then play back the recordings at your leisure, burn them onto CD or DVD for playback on another computer or your television, or with video editing software (not included), you can edit the shows. This is great for saving favorite movie clips, or of your favorite teams dramatic last-second win or your favorite player's grand slam.The Hauppauge 1178 WinTV-HVR-1600 plugs into a PCI slot and is compatible with Windows Vista, XP with Service Pack 2, and Windows XP Media Center Edition. With XP-MCE and Vista, you can add the WinTV-HVR-1600 as either the primary or secondary TV tuner. The Microsoft Media Center application supports up to two TV tuners so you can watch on channel while recording another.What's in the BoxWinTV-HVR-1600 PCI card, IR remote control receiver, IR Blaster (remote control), CD-ROM with WinTV software.", "title": "Hauppauge 1178 WinTV-HVR-1600 Internal Hybrid TV Tuner/Video Recorder", "price": 72.41, "salesRank": {"Electronics": 99166}, "imUrl": "http://ecx.images-amazon.com/images/I/41Y9yioQIiL._SX300_.jpg", "related": {"also_viewed": ["B0014YFC18"], "buy_after_viewing": ["B0014YFC18", "B004HO58SO", "B001E2T6Y4", "B001E2V7R8"]}}