{"asin": "B0047Q9GT4", "description": "Android 2.1 connects to the world though the touch of a fingertip. The Kyros Tablet is a powerful and flexible Internet and Entertainment solution that features a generous 7\" screen with intuitive touchscreen controls powered by the Android 2.1 operating system. Browse the web wirelessly or enjoy media on a sleek and stylish media device. Enjoy 1080P HD videos, photos, music, and more in the comfort of your living room when connected to your TV via HDMI. The Kyros has 4GB of built-in internal memory and features a microSD card slot for upgrading the capacity to up to 16GB. It also allows you to wirelessly access the Internet through a hi-speed networking support and includes more than a dozen built-in applications, each one identified by an icon. Among the included apps are an alarm clock, browser for surfing the web, calculator, email, gallery for viewing and playing videos, music and video player for launching the mobile YouTube browser page to watch Internet videos and more! In addition, the Kyros offers two unique apps, the Aldiko E-Book, for downloading and reading thousands of e-books (which supports the ePub standard) and AppsLib, to browse, download and install apps from the AppsLib marketplace for a complete mobile Internet solution. Features Large 7 inch Resistive Touchscreen Connect to the Internet wirelessly Browse the web and check e-mail Watch videos on YouTube Integrated flash memory Built-in 4GB internal memory microSD card slot(upgrade up to 16GB) Connect and enjoy Full 1080p on your HDTV via a HDMI cable Discover and download apps to play games, check the weather, listen to the radio, and more with AppsLib Download and read thousands of books with the included Aldiko E-book reader application View pages in portrait or landscape with automatic orientation detection Full-size USB connection enables keyboard of your tablet USB 2.0 Hi-speed for fast file transfers Rechargeable lithium-polymer battery", "title": "Coby Kyros MID7015-4G 7-Inch Android  Internet Touchscreen Tablet - Black", "price": 7.42, "imUrl": "http://ecx.images-amazon.com/images/I/41wYALCb92L._SY300_.jpg", "related": {"also_bought": ["B004OB0EBQ", "B001L1H0SC", "B0075W8BZC", "B005HUH88K", "B002BBJMO6", "B004J2NVDI", "B0075W8D7I", "B0093XTHI6", "B0093XTHHM", "B007B31IYQ", "B004ICWW7U", "B004MBRJ8E", "B00AV1UZA8", "B007HF8UCQ", "B004ICS0YO", "B0016RNX2I"], "buy_after_viewing": ["B004OB0EBQ", "B0093XTHI6", "B00BQ4H31S", "B007SDFPZW"]}, "categories": [["Electronics", "Computers & Accessories", "Tablets"]]}