{"asin": "B003GBRXKU", "categories": [["Electronics", "Computers & Accessories", "Monitors"]], "description": "Introducing the world&rsquo;s first 27&rdquo; LCD monitor with 1ms response time. The VX2739wm boasts a huge 27&rdquo; screen, Full HD 1080p resolution, a sleek design and diverse connectivity options. The VX2739wm is perfect for movies and gaming with its best in class 1ms response time for virtually blur free motion. Connect to your favorite devices with the built in HDMI and 4xUSB ports. It is the perfect display for your game console, cable/satellite box or your DVD/Blu-ray device. Enjoy spectacular images with its 100,000:1 dynamic contrast ratio, and incredible sound with the built in SRS Premium sound. For those that are conscious about their power consumption the VX2739wm also allows users to choose ECO mode for up 35% energy savings. Place it on your desk or mount it on your wall for flexible placement. Best of all, be rest assured your investment will be well protected with ViewSonic&rsquo;s incredible pixel performance guarantee and a full 3-year warranty.Key Features:27-Inch LCD monitor with super-fast response time for gamers, entertainment enthusiasts, movie producers, and graphic designers1ms response time for virtually blur free motion1080p Full HD resolution with 16:9 aspect ratio for perfect image reproductionHDMI, DVI and VGA inputs provide diverse connectivity options4-port USB hub for easy connectivity of USB devices such as digital cameras, USB flash drives and miceIntegrated speakers with SRS Premium Sound for high quality sound experience200mmx100mm VESA compliant for wall mount or monitor standsHighest grade LCD panel with the best pixel performance policy in the industryWhat is 1ms response time?Response time in monitors refer to the amount of time a pixel (dot) takes to go from black to white and back to black again. It is measured in milliseconds (ms). The lower the number, the faster the pixels can change, reducing the ghosting or streaking effect you might see in a moving or changing image such as in games and movies.Common response times range anywhere from 14ms to 5ms. Monitors that are designed for faster applications feature response times as fast as 2ms. These monitors are ideal for gamers, video enthusiasts, engineers and movie production houses.Slow (higher) response timeFast (lower) response timeAnother first from Viewsonic!Being one of the technology leaders in the display industry, Viewsonic was the first to introduce an LCD monitor with 2ms response time back in 2005. Today, ViewSonic is here again to introduce the World&rsquo;s first 27&rdquo; monitor with 1ms response time delivering the long-awaited good news to gamers and video enthusiasts everywhere.Full HD 1080p resolution and 16:9 aspect ratioThe VX2739wm features a 27\" widescreen with 1920x1080 resolution that is capable of displaying a native Full HD 1080p image. Today, devices that can display Full HD content output are getting more and more common. However, without a native Full HD display, you will not be able to experience the picture clarity and the details of the 1080p content you view.The Viewsonic VX2739wm&rsquo;s 27\" panel offers another new trend in the LCD panel market, the16:9 aspect ratio. This new aspect ratio not only natively supports Full HD 1080p content, but displays Full HD without distortion. For example, a 1920x1200 resolution monitor will also support Full HD 1080p but it will either stretch to fit into a full screen or would show blank side bars to avoid distortion. With a 16:9 aspect ratio panel, you will get the most out of your HD content since it is natively designed in this format.The Power of HDMIHDMI is one of the most powerful and widely available communication standards that connects digital audio/video sources such as set-top boxes, DVD players, personal computers (PCs, laptops), video game consoles such as the PlayStation 3 and XBOX 360, and AV receivers to compatible digital audio devices, computer monitors, and digital televisions. With just one cable, HDMI supports any TV or PC video format, including high-definition video and up to 8 channels of digital audio. This powerful technology comes standard in VX2739wm. This way, you can connect your monitor to your desktop or laptop computer and work, surf the web or play games. Or you can connect it to your gaming console and enjoy the large 27&rdquo; screen, 1ms response time time and  integrated speakers. You can even connect it to a cable box or a satellite receiver and watch TV on your monitor!  Although the monitor doesn&rsquo;t have a tuner to receive the TV signals from the air, HDMI +receiver box combination gives you the same TV experience.  And another great example of the countless video sources you connect to is a Blu-ray DVD/CD player.ComputerGaming consoleCable/satallite receiverDVD/Blu-ray playerPair it with a ViewSonic or Mac computerOne of the key advantages of the VX2739wm  is its diverse connectivity options making it flexible to be paired with a PC or a Mac computer. ViewSonic, a leader in displays, has recently announced a full line of PC products, including notebooks, netbooks, PC Minis and all-in-one PCs. Now you can hook up a Viewsonic ViewBook or a PC Mini as well as a MacBook or a Mac Mini to the VX2739wm and enjoy a full 27\" widescreen with 1ms super fast response time!", "title": "ViewSonic VX2739WM 27-Inch 1920x1080 Full HD Monitor", "price": 245.98, "salesRank": {"Computers & Accessories": 6889}, "imUrl": "http://ecx.images-amazon.com/images/I/51xNSXCyTfL._SX300_.jpg", "related": {"also_viewed": ["B008A3KFB8", "B0043T34RK", "B0099XBO5E", "B00B17C5KO", "B00906HM6K", "B009H0XQPA", "B00CMKOVPQ", "B0098Y77OG", "B00E26IRA8", "B00A46Y6DW", "B00AVYNS7M", "B008RM23ZI", "B009HNEBLK", "B00B2HH7G0", "B005BZNEVQ", "B005BZNDS0", "B005BZNDOO", "B00BP5KOPA"], "buy_after_viewing": ["B008A3KFB8", "B008RM23ZI", "B003L1ZYYM", "B0098Y77N2"]}}