{"asin": "B003BEDTBY", "description": "The TomTom GO 740&middot;TM LIVE is ultimate widescreen navigation featuring Lifetime Traffic and Map Updates, and so much more. Real-time information saves you time, money and stress. The TomTom GO 740&middot;TM LIVE automatically accesses live traffic feeds, updated fuel prices, Local Search powered by Google, Weather, and more--so you can stay in the know on the go. Real-time LIVE services work right out of the box via a built-in wireless data connection.* Three months of service included.Complete widescreen navigation featuring Lifetime Traffic and Map Updates--and much more.Save time, money and stress with real-time information from TomTom's LIVE service.Speak instructions (over 130 commands) and make/receive calls with compatible Bluetooth phones.You'll always outsmart traffic with Lifetime Traffic Updates. Based on incoming traffic events, your device will suggest alternate routes to minimize delays. And, with Lifetime Map Updates you'll always drive with the latest and most accurate maps. On average, 15% of the road network changes each year, so it is important to have the most up-to-date maps. With the GO 740&middot;TM LIVE with Lifetime Traffic Updates and Maps, you'll always stay current.Just enter your destination address with voice recognition or on the touchscreen and start driving anywhere in the US and Canada. The TomTom GO 740&middot;TM LIVE guides you door to door with turn-by-turn spoken instructions, including street names.Only TomTom has IQ Routes Technology which shaves time off even the shortest trips by calculating the fastest route based on the time of day you are traveling. You'll always drive the smartest, most efficient route. Advanced Lane Guidance* uses photorealistic images to show you exactly which lane to take in complex multi-lane exits so you can be more confident on the road.With TomTom Map Share you can instantly modify street names, street direction, POIs, road speeds and turn restrictions on your own device. The \"Help Me!\" menu lets you easily access local emergency providers. And, the GO 740&middot;TM LIVE makes driving even safer with Bluetooth handsfree calling***.The TomTom GO 740&middot;TM LIVE is the ultimate connected car navigator.LIVE Services (3 months included)Save time, money and stress with real-time information.TomTom Traffic--View live, real-time traffic information on your TomTom GO.Fuel Prices--Get the latest fuel prices on your route or in your area. Locate the lowest priced fuel and navigate directly to it.Local Search powered by Google--Find countless shops and businesses wherever you are and navigate directly there.Weather--Your TomTom GO receives local and five-day forecasts so you can make plans based on the latest weather.Safety Camera Alerts--Know where safety cameras are located for safer, more relaxed driving.Lifetime Traffic &amp; Map UpdatesEnjoy a lifetime of easy driving with two great features from TomTom. LIFETIME Maps guarantees you receive four new editions of your TomTom map each year to ensure that you are always navigating with the industry's most up-to-date map. And, LIFETIME Traffic sends updates to your TomTom every three minutes, so you can always steer clear of traffic delays and take the fastest route possible to your destination.Maps of US &amp; Canada with TomTom Map SharePreloaded with maps of the US and Canada. TomTom has the most accurate maps and with TomTom Map Share technology you can instantly modify street names, street direction, POIs, and more on your own device and receive daily verified updates from TomTom. Spoken turn-by-turn instructions and 3D graphics will guide you to any address in the US and Canada, worry free.Voice RecognitionSpeak instructions to your GO 740 LIVE with over 130 commands.Spoken Street NamesAnnounces turn-by-turn directions aloud, including street and place names.Bluetooth Handsfree CallingMake and answer phone calls safely while driving, with your compatible Bluetooth mobile phone.IQ Routes TechnologyTomTom IQ Routes Technology puts the driving experience of millions of TomTom users into your maps to shave time off even the shortest trips. Calculates the fastest route possible based on time of day. With TomTom IQ Routes you'll always drive the smartest, most efficient route. IQ Routes saves you time, fuel and money.Traffic isn't the same during Monday morning rush hour as it is on a lazy Sunday afternoon. Heavy traffic, rotaries, traffic lights, and even pedestrians can slow you down. The route you need changes depending on the day and time, so the shortest route isn't necessarily going to be the fastest. With TomTom IQ Routes you'll always drive the fastest route.Advanced Lane Guidance*TomTom Advanced Lane Guidance gives you extra clarity when navigating difficult junctions by showing you which lane to take, so you won't miss your turn or have to make sudden, dangerous lane crossings. Photorealistic images and a pulsing green arrow indicate exactly which lane to use, so you can go confidently.*Feature only available in the US and Canada**Feature available in the US only***Compatible mobile phone required.All TomToms FeaturePlug &amp; Go--Works right out of the box.30 Day Latest Map Guarantee--Up to date, off the shelf.TomTom Map Share--Modify your own map and benefit from others' verified changes with TomTom Map Share.Help Me! Emergency Menu--Easily access local emergency providers such as police, fire stations and hospitals.TomTom HOME--Always up to date.Fuel Price Service (optional)--Know more, pay less.What's in the BoxGO 740TM live device, windshield mount, USB cable, adhesive disk, car charger with integrated traffic, and user guide with lifetime maps voucherAbout TomTomFounded in Amsterdam in 1991, TomTom has established itself as a global leader in navigation by being an innovative company with a strong brand, clear customer focus, and high quality products and services.TomTom is the world's leading navigation solutions provider with navigation products sold in 30 countries and in over 20 languages. To further our commitment to car navigation, TomTom acquired Tele Atlas maps in 2008 so we can continually provide the most up-to-date maps and intelligent routing.We have our own mapping company!Did you know that every year roads change by up to 40% in high-growth areas? Tele Atlas manages this by using the world's most comprehensive systems to identify and incorporate these changes into our maps with unprecedented levels of speed and accuracy. All TomTom devices benefit from the Tele Atlas advantage--more coverage, more points of interest, and more freshness and accuracy.Why TomTom?At TomTom, we believe that personal navigation should be as easy and safe as possible. We develop smart technology that gives you straightforward solutions, innovations to make life easy.", "title": "TomTom GO 740TM LIVE 4.3-Inch Bluetooth Portable GPS Navigator (Lifetime Traffic &amp; Maps Edition)", "price": 129.99, "imUrl": "http://ecx.images-amazon.com/images/I/51m5CC5XF4L._SY300_.jpg", "related": {"also_viewed": ["B007M4Z7GO", "B004MYFTFQ", "B001P3O764", "B007M52QR6", "B007M52QEE", "B004MYFTFG", "B004MYFTEW", "B00HK6CPVY", "B004MYFTF6", "B00AXZY42W", "B007PPYXOC", "B00AJXMWP4", "B0057ODG6Y", "B004MYFTEC", "B00160GOR6", "B00BHAC85W", "B005LMWPYG", "B00AY7NUW4", "B007M4Z6FG", "B001VEJEGU", "B002OL2NT4", "B00BIZ0EY8", "B007M52EXM", "B004J4VYG2", "B00BHSTWOY", "B003BEDTBE", "B00I9UKS3M", "B0057OCDQS", "B004MYFTDS", "B00AP7R9DY", "B004MYFTDI", "B003FSTAGO", "B003B3P2C4", "B00486U368", "B0057ODOCA", "B005DIBHA6", "B00DW14I66", "B0054J8BWQ", "B00AY7NSTY", "B003ZHVBQM", "B0057OCS9A", "B00CRQUKQ4", "B00297J5C6", "B004W1GQ92", "B00AXZWG8Q", "B003ZX8B3W", "B0066IUPS2", "B003FSTAHS", "B003B3P29W", "B007M4Z60Q", "B00CP1VBEG", "B004MYFTE2", "B003FSTAFK", "B003FSTAGY", "B00AXX0IEC", "B00AXX0I88", "B00DUYKY40"], "buy_after_viewing": ["B005DIBHA6", "B007M4Z7GO", "B004MYFTFQ", "B002OL2MU4"]}, "categories": [["Electronics", "Car & Vehicle Electronics", "Car Electronics", "Car Video", "In-Dash DVD & Video Receivers"]]}