{"asin": "B00000IFRI", "description": "Mario Party is the first of several Mario games planned for this year that are being created by developers outside of Nintendo. In this case, the developer is Hudson, a company best known for the Bomberman series, while the others are HAL Systems, the creator of the Kirby line (which is handling the Mario fighting game, Smash Brothers), and Hot Shots Golf maker Camelot (which is doing Mario Golf). Each of the games' focus plays to what the developers know best, in this case, Hudson's knowledge of good multiplayer game modes gleaned from producing countless incarnations of Bomberman, the seminal party-game series.How do they do that? By setting up Mario Party as a video game take on a traditional board game. One to four players compete against each other (and computer opponents if there are fewer than four humans present) for coins, stars, and bonus points. Instead of going the route of Monopoly's little dog and top hat assortment, Mario Party offers a handful of Mario characters for use as \"game pieces\" such as Mario, Yoshi, Wario, Peach, Donkey Kong, and Luigi. Each of the title's boards is based on the series as well (Donkey Kong has a jungle stage, Yoshi an island, and so on), and each differs in prominent ways. Once the characters and board are chosen, you vie for the order you'll proceed through the game by stopping a rotating number block, which reappears at the beginning of each turn to decide how many spaces you'll move. Plain spaces provide a number of coins, while specially marked spaces will draw you into bonus minigames (explained fully later) or introduce you to friendly or unfriendly nonplayer characters such as Toad, Shy Guy, and Boo. The one you least want to bump into is of course Bowser, who will either steal coins from you outright or engage you in forced minigames where you don't gain any coins if you win, and you lose coins if you lose. The main goal is to have the largest total number of stars at the end of a game, which can be bought along the way from Toad or by paying off a Boo to steal one from one of your opponents (this costs more than twice the regular 20-coin amount but is much more fun).The minigames are the Mario Party features that most take advantage of the title not being set on a flat plate of cardboard. You enter at the end of each round or by landing on marked spaces on the board. The games come in various shapes and sizes and in configurations of every player against the others, two vs. two, or three against one. Of the 50 in all, the most noteworthy examples are probably the Bobsled Run (which is reminiscent of the snow race in Super Mario 64, but with two characters sharing a sled), Face Lift (you try to drag around a mushed face a la Super Mario 64's intro), Mario Bandstand (a distant cousin of Parappa the Rapper), Lava Boardin' (you race down a collapsing platform and jump over obstacles), and Cash Bash (one player is dressed up as Bowser, and the others hit him with hammers and steal his coins). Some are skill based, while many require button mashing or joystick twirling. The winner or winners gain coins, while the losers pay out or just leave with what they came into the game with - nothing more, nothing less.Playing with a group of friends makes this game shine. There are enough random elements at work that enable huge upsets to happen about once every other round (which continues straight up to the end when bonus stars are given out that can nudge second- or third-place players to the forefront), and going after the lead player or teaming up against the computer is superfun - especially when you're trying to garner stars for the collective total (get enough and... things happen). On the negative side, some of the minigames aren't very fun to play in the multiplayer mode because of control or perspective problems, or because they're just plain boring - but that's to be expected with the sheer number of games. Meanwhile, the games that are enjoyable to play in multiplayer are nowhere near as good in the single-player mode. Really, it's that multiplayer competitive spark of screaming at and/or cheering for your friends that injects life into these often-simple little games, and without it, they're just simple little games. The single-player mode seems thrown in the way multiplayer modes seem thrown in most other games. Mario Party is intended to be played with a group of friends, and for those people who can really take advantage of that, this game is a must-buy. The less-social gamer might want to rent. --Joe Fielder--Copyright &copy;1999 GameSpot Inc. All rights reserved. Reproduction  in whole or in part in any form or medium without express written permission of GameSpot is prohibited. GameSpot and the GameSpot logo are trademarks of GameSpot Inc.--GameSpot Review", "price": 289.95, "imUrl": "http://ecx.images-amazon.com/images/I/513bv0mySHL._SX300_.jpg", "related": {"also_bought": ["B000046Q7Q", "B00005AW1W", "B00000DMAX", "B00000J2W7", "B00000F1GM", "B005GTNBGK", "B00002DHEV", "B005GTND0E", "B00002STH0", "B00002STEZ", "B005GTNC8W", "B005DI7N7W", "B00003OTI3", "B000PJHAD6", "B00004U1QY", "B00002STFH", "B00000ID61", "B00000DMAQ", "B000QHOHHE", "B00004U1R3", "B00000K1AF", "B003UI5GLC", "B000031KJM", "B00000JHPD", "B00004SWLT", "B000YOCGUO", "B00005M8TL", "B002TK1PX0", "B00000INR2", "B000Y0CHX4", "B000F9JFXE", "B007SJMEHI", "B0015OG4G4", "B00002STI2", "B000021Y2Z", "B00004R9IB", "B00004R9I4", "B00003E4EB", "B000058BCU", "B00004S9AA", "B00001QES1", "B00000J2OO", "B00005AQRH", "B0046CZX78", "B00004S9A7", "B000JVM256", "B00004U1R1", "B00000DMAO", "B00856304Y", "B00002STHX", "B00000ID60", "B0009Y808Q", "B003ZU0PHU", "B000ZEX9OU", "B00002STH5", "B0000A0O28", "B00006HBTW", "B000038A6U", "B000AQA9UA", "B000046S41", "B00004U1QX", "B00004WLMA", "B00AFJMFJA", "B00002970G", "B00000K4E1", "B000YT1VMS", "B0017I3H0O", "B00001OX4T", "B00004U4QP", "B00000IPDS"], "buy_after_viewing": ["B000046Q7Q", "B00000F1GM", "B005GTNBGK", "B00002DHEV"]}, "salesRank": {"Video Games": 1931}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "More Systems", "Nintendo 64", "Games"]]}