{"asin": "B000BC38K6", "description": "With over 6 million units sold and unprecedented critical acclaim from fans and press around the world, Sid Meier'sCivilizationis recognized as one of the greatest PC game franchises of all-time. Now, Sid Meier and Firaxis Games take this incredibly fun and addictive game to new heights by adding new ways to play and win, new tools to manage and expand your civilization, all-new easy-to-use mod capabilities and intense multiplayer modes and options.Civilization IVcomes to life like never before in a beautifully detailed, living 3D world that elevates the gameplay experience to a whole new level.Sid Meier's Civilization IVhas already been heralded as one of the top games of 2005, and a must-have for gamers around the globe!FeaturesCiv 4features beautiful 3-D worlds with fully animated unitsCiv IV comes to life! - Beautiful 3D world with dozens of fully animated units (including culturally unique units) and totally customizable armies. Detailed cities and wonders will appear on the map. Wonder movies are back!Greater Accessibility and Ease of Play - An easy-to-use interface will be immediately familiar to RTS and action game players, and newcomers to the series will be able to jump in and play. Multiplayer -LAN, Internet, PBEM and Persistent Turn-Based Server (PTBS or Pitboss) offer players all-new strategies and ways to play when competing or cooperating with live opponents.Team Play - Whether playing multiplayer or single player, team play offers a new way of setting locked alliances that result in shared wonder effects, visibility, unit trading and shared territory that delivers a plethora of new strategic and tactical options.Mods and Community Tools - Designed from the ground up for modability, the game contains a powerful map editor with XML and Python support.Choose Your Leader - Many Civs now have 2 leaders from which to choose, with each Leader having traits that provide various bonuses to the player and lots of replayability.Civics - With the discovery of new techs, civic options can become available. Freedom of speech or slavery? Hereditary rule or open elections? This creates endless government choices and possibilities!Religion - Now there are 7 religions in the game that are unlocked through researching. When unlocked, the religion spreads through a player's empire allowing them to use the religion to help manage happiness, gain gold and create Great Prophets.Great People - As the player uses specialists they gain Great People points in the city that is utilizing the specialists. Great People include the Artist, Tycoon, Prophet, Engineer, and Scientist. They can be used to get free techs, start Golden Ages, or join a city to increase its output.Promotions - Each unit has a promotion path that emphasizes specific unit traits. Promotions include bonuses to Attack/Defend on specific terrains/features, movement bonuses, sight/visibility bonuses and increased withdrawal chances.Tech Tree - Flexible Tech tree allows players more strategic choices for developing their civilizations along unique paths.More Civs and all new Units and Improvements to enhance and grow your empire.Faster-Paced Fun - Gameplay has been streamlined for a tighter, faster and more compelling experience.In-Game Movies - Civ IV will have over 70 in-game movies and animated sequences.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51VWJK9HZPL._SY300_.jpg", "related": {"also_bought": ["B000PCLBE2", "B000FHGA4S", "B000RHFZTM", "B0038TT8QM", "B0026EGO3A", "B00029QR7O", "B005M0KSIM", "B001F637T4", "B002M78NM6", "B00005N9A7", "B00005JC8D", "B000AB603U", "B00004VXAZ", "B000E2D3LC", "B00AZGC3VI", "B000EDPQMU", "B002SKDIKE", "B00006IR62", "B0000C0YW2", "0375826688"], "bought_together": ["B000PCLBE2", "B000FHGA4S"], "buy_after_viewing": ["B0026EGO3A", "B000RHFZTM", "B005UKT826", "B005M0KSIM"]}, "salesRank": {"Video Games": 10681}, "categories": [["Video Games", "PC", "Games"]]}