{"asin": "B0095BWGIE", "description": "AINHOA is an award-winning series of professional beauty products for use in the comfort of your home.  Pleasurable, convenient, made from the highest quality ingredients, these are Spa-quality products at affordable prices. Ainhoa has been available in the worlds&#x2019; finest hotels and spas for over 15 years, offering luxurious treatments using their products.  Whether you want daily use products or an intense treatment, whatever your skin type; the stunning Ainhoa range has the right products for you.  Treat yourself today and enter the exclusive world of Ainhoa. SPECIFIC EXTREME range of daily skin care uses Plant Stem Cells which offer the potential to constantly create new skin cells. These products contain the amazing Hyaluronic Acid, our body's natural lubricant. Also rich in Keratinocytes, which provide the skin with a barrier against environmental aggressors and can auto-renovate where required. Obtained from Halophyte plants which grow in aggressive conditions where they adapt to salt and water stress and they bring this environmental resistance to the skin. SPECIFIC EXTREME products contain Marine DNA which helps to rejuvenate and regenerate skin cells.  Anti-Oxidant Vitamin E promotes free radical scavenging and allows for the retention of water, Collagen and Elastin. The Stem Cells are assimilated into tissue and used intelligently where most needed, re-establishing the skin's health and vitality. SPECIFIC EXTREME Extreme Pack contains two wonder products for you to use at home. Extreme Eclat Instant for day use to provide an immediate lifting and tightening effect; Extreme Extreme Plus Repair for night-time regeneration. Both are presented in a stunning silver click-pen and are easy to use.  For skin with expression lines aged 30 years and upwards. See individual products for full descriptions. A fantastic set for yourself or as a gift. Ainhoa products that compliment this range include: LUXE Cleansing Milk & Facial Tonic, LUXE Day and Night Cream.", "title": "AINHOA Specific Extreme Pack", "price": 96.95, "salesRank": {"Beauty": 663871}, "imUrl": "http://ecx.images-amazon.com/images/I/41wO%2B-cl1eL._SY300_.jpg", "brand": "AINHOA", "categories": [["Beauty", "Skin Care", "Face", "Treatments & Masks"]]}