{"asin": "B00B1M1B3G", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]], "description": "BLKBOX POP360 Ready to Play Bluetooth Portable/Wireless Speaker with Rechargeable Battery. Quality Sound. Wherever/Whenever.Convenience and QualityDo you have your smartphone or bluetooth device? Then you're ready to play!No more bulky speakers or electronics with multiple incompatible plugs.  Enjoy powerful sound from today's best portable speaker.Pairs wirelessly with Android, Apple and Blackberry devices, or to tablets and laptops.Compact and PowerfulNo Bluetooth? No Problem! Built-in 3.5mm jack works with all other devices.Advanced audio delivers 360 degrees of clarity and pop-up on/off feature with built in LED is sure to impress.Pair and PlayBLKBOX POP360 will save to your smartphone or tablet and be instantly accessible any time you want to listen to music.Pop up the top, and play your music! Nothing  to physically connect or dock.On-The-Go DesignBLKBOX POP360 is light and small enough to carry in a small bag, purse or backpack.Rechargeable lithium battery gives you up to 8 hours of usage time.Battery life is clearly displayed as the built in LED goes from blue to red.What's in the Package?One (1) 1- BLKBOX POP360 Speaker with built in 3.5mm auxiliary cable;  Instruction manual.Full 100% Satisfaction GuaranteeIf for any reason you are not satisfied email us and we will make the situation right.We stand behind our products and will do what is necessary to ensure your satisfaction.Shipping Fulfilled By AmazonFast, Traceable shipping when ordering from Amazon.com", "title": "Wireless Bluetooth Speaker- BLKBOX POP360 Hands Free Bluetooth Speaker With 360 Degree Sound - For iPhone 5, 4S, 4, 3GS, iPads, Bluetooth Android Phones, Samsung Galaxy Note, Galaxy S3, Galaxy S2, Galaxy Nexus, HTC One X and all other Smart Phones, Tablets and Computers", "price": 21.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41CrM57Y46L._SY300_.jpg", "related": {"also_bought": ["B00D5DK4G4", "B00JK6MQEI", "B009EQZMZY", "B00IB1QC7K", "B007D6JW3A", "B007R6HV4S", "B0027MF964", "B00GJIDXG0", "B003U6Y1OC", "B0062BXBVG", "B003TQMCAS", "B00B7D4CS0", "B00FUV7OP8", "B000BKBYWW", "B008JGR9MO", "B007SZ1SJW", "B004HHICKC", "0836218051", "B00DLUYSPO"], "bought_together": ["B00D5DK4G4"], "buy_after_viewing": ["B00FJILVDS", "B00EJDHC6Y", "B008JGR9MO", "B00F5NE2KG"]}}