{"asin": "B0000C4M22", "description": "Enter the world of urban street racing and high performance tuner cars with the latest title in the hit Need for Speed series:Need for Speed Underground. Take on today&#146;s most popular tuner cars from Mitsubishi Motors, Subaru, Toyota and many more, building the ultimate street machine by earning cash to pay for custom body kits and a host of licensed car performance mods. But just creating a custom street racing machine will not get you to the top; it takes a certain amount of attitude and razor sharp driving skills to compete in the tough world of urban racing.A number of diverse events set in gritty, nighttime environments make up the heart of street competition. Players become complete street racers by perfecting skills in each event by nailing the perfect shift in drag racing and by putting their street cred on the line, racing through the city streets at all hours of the night.Prove you belong in the elite street racing circles, work your way up the underground rankings and take on the best of the best in each discipline.Key Features:Twenty fully customizable, licensed cars are included in the game from Mitsubishi Motors, Subaru, Toyota, and many more.Several unique racing events will be featured in the game including the following: Drag Racing--Explode off of the line with three other racers, on the brink of control, as you race for the finish line. Street Racing--Heat up the cold city streets with some high octane, high speed racing, finding the fastest lines through a variety of open city racecourses.Hundreds of ways to customize your ride. Pick from major aftermarket parts manufacturers including AEM Inc., Audiobahn, Bilstein, Dazz Motorsport, DC Sports, Eibach, Enkei, GReddy Performance Products Inc., HKS, Holley, Injen, Jackson Racing, MOMO, Neuspeed, Nitrous Express Inc., O.Z, PIAA, Skunk2 Racing, Sparco, StreetGlo, and Turbonetics Inc.Need for Speed Underground&#146;s amazing graphics will immerse gamers in the world of after hours street racing. The diverse urban nighttime environments are modeled after a variety of highly detailed real-world urban landscapes. A new sensation of speed has been created in the game by the award winning Need For Speed team and an OSCAR nominated Hollywood visual effects expert.Over 100 unique events give racers the opportunity to earn cash, buy more upgrades, and unlock cars and tracks while increasing their street reputation.A diverse collection of high-octane music keeps the game rolling.Online support for up to 4 players.", "price": 79.33, "imUrl": "http://ecx.images-amazon.com/images/I/514KXC4R2JL._SY300_.jpg", "related": {"also_bought": ["B0002IQCSY", "B00005V6BE", "B000GPXS9Y", "B000RHZJK2", "B000EMJA3M", "B0000A0MDV", "B000TLU67W", "B0000503MO", "B001MW91IW", "B0000C7GHG", "B00005NUJ3", "9629971372", "B00005CF9L", "B00004YRQA", "B00004YRQ9", "B00006Z7HU", "B000038ABK", "B008BCZQL2", "B004S3KB6S", "B000GQ1FUM", "B002BWS5QG", "B0013KW1B2", "B0002J9UBY", "B0013JHKU0", "B00005NN5J", "B00008NRM7", "B003IMAML4", "B00005U8TQ", "B00005B70T", "B000JHMJDA", "B001UU1WLA", "B000056H2D", "B000ERVLZ2", "B00009WAVI", "B0006JMLMK", "B00006JC46", "B0000VSH3G", "B00488PZ2S", "B001TORSHO", "B0000E3D8T", "B0002IQOOQ", "B001MW3TS0", "B000066TS5", "B003V8E2O8", "B00005MDZD", "B0007KTBB2", "B0006I5FL0", "B0006ZJPR8", "B000CN750I", "B000GACEHQ", "B0032GTMEE", "B000MUPX4Q", "B000930DIM", "B000Z59HMM"], "bought_together": ["B000GPXS9Y"], "buy_after_viewing": ["B0002IQCSY", "B000GPXS9Y", "B0002FGFHU", "B0002ILSH4"]}, "salesRank": {"Video Games": 2658}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "More Systems", "PlayStation 2", "Games"]]}