{"asin": "B002M3SJ6U", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Modems"]], "description": "The Environmentally-Friendly Motorola SURFboard Wireless Cable Modem GatewayWhy tie yourself down? Feel good about purchasing a \"green\" product and build your own wireless network with this high-speed 802.11 b/g access point. Get more out of your time online with its improved wireless capabilities. Surf the Web and view pages quickly, download video with blazing speed and play online games faster than your opponents with this SURFboard Wireless Cable Modem Gateway. Up to 100 times faster than traditional dial-up. No dialing up &#x2013; no phone line required. Easy-to-install and simple-to-use. The best news is that this product was built and packaged in a responsible and  mannerMotorola - 2.4GHz Wireless-G Cable Modem GatewayA home network enables you to share information between two or more computers. You can connect your home network to the Internet through the cable TV system. The SBG901 supports 30% Wireless Acceleration using Xpress&#x2122; and Afterburner&#x2122; technology with internal antennas and acts as the central connection point between your computers and the Internet. It directs (routes) information between the computers connected to your home network. A built-in cable modem transmits information between your home network and the Internet. An SBG901: &#x2022; Combines four separate products &#x2014; a DOCSIS&#xAE; cable modem, IEEE 802.11 b/g wireless access point, Ethernet 10/100Base-T connections, and firewall &#x2014; into one compact unit &#x2022; Enables you to create a custom network sharing a single broadband connection, files, and peripherals, with or without wires &#x2022; Provides easy to use Installation Wizard to setup home network.Easy to Install, Activate, and Use[Watch as games come to life.]Product FeaturesEnvironmentally-FriendlyAll packaging products are made from recycled materialsThe shipping carton is made of recycled corrugated material100% of package contents is created from recycled materialsEnergy Star CompliantSmaller Power Supply (PWB) for reduced environmental impact802The mobility of a wireless LAN and simplicity of \"No New Wires\" technologySupports 30% Wireless Acceleration using Xpress&#x2122; and Afterburner&#x2122;Internal bi-directional antennas provide improved wireless coverage and reduces the risk of breakageImproved Wireless throughput, >23 Mbps, or >34 with AccelerationEasy-to-use, multi-language Installation Wizard enables quick connectivity and wireless security set upBroadband Internet access is always on, always connected10/100 BaseT Ethernet connectivity compatible with almost any PC or Mac network-ready systemBackward compatible with 802.11b equipmentUpdated, space saving enclosure with internal antennaEnhanced security with Wi-Fi protected access and up to 128-bit WEP encryptionNew GUI for easy customer set up and managementEthernet cable includedNote: Ask your cable company if they support DOCSIS cable modems. DOCSIS (Data Over Cable Service Interface Specification) is the industry standard for cable-based Internet access service1-year limited warrantyWhat&#x2019;s in the BoxInside the Box - Motorola SBG901 SURFboard Wireless Cable Modem Gateway, CD-ROM containing Installation Wizard and User Guid, Ethernet cable, Power adapter, Warranty card", "title": "ARRIS / Motorola SURFboard Gateway SBG901 DOCSIS 2.0 Wireless G Cable Modem - Retail Packaging", "price": 128.99, "salesRank": {"Electronics": 8817}, "imUrl": "http://ecx.images-amazon.com/images/I/41oiP05VnOL._SY300_.jpg", "related": {"also_bought": ["B0040IUI46", "B00IKMJA3S", "B004QK7HI8", "B004DP2TC0", "B000JV9LUK", "B005UWD2YY", "B007YV0UQW"], "buy_after_viewing": ["B0040IUI46", "B004XC6GJ0", "B00IF0JAIU", "B00AJHDZSI"]}}