{"asin": "B000WMEEBM", "description": "A sci-fi/action RPG from acclaimed developer Gearbox,Borderlandscombines the best in first-person action gaming with elements of a traditional role-playing game (RPG). The excitement of this hybridization is further magnified by the game's groundbreaking content generation system which allows for a near-endless variety in missions, environments, enemies, weapons, item drops and character customization, making the game's single player, multiplayer and online campaigns not to be missed..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }FPS/RPG hybrid gameplay.View larger.Literally thousands of weapons.View larger.Vehicular combat.View larger.StoryIn a distant future, the planets at the outer edges of the galaxy have become a beacon to fortune seekers and those yearning for a better life off world. But there are no guarantees in deep space. Pandora, one of these distant planets, was reported to be rich in untapped mineral wealth, and so drew many hoping to get rich quick, but in the end little was found beyond the scattered ruins of a past alien civilization. With nothing to gain, any who could soon abandoned Pandora, leaving those who remained to deal with the lawlessness of a world gone bust, and the mystery of the long-dead alien civilization. But as chaotic as these times were, there were worse days yet to come. After several years the planet's huge orbit slowly brought it near to its sun and once unknown and horrifying creatures sprang from their long hibernation to terrify the stranded colonists. The only hope of the colonists seems to be a vault discovered in the side of a mountainside, rumored to contain alien technology and secrets about Pandora. Will this discovery be the colonist's salvation or their end? Discover their fate inBorderlands.GameplayAs in a traditional RPG,Borderlandsis built around the continual leveling of characters as they delve into quests. These quests include both story-driven adventures and side quests that offer players rewards such as items exclusive to quest completion and/or forward movement of the story. Players can look forward to action set in both single player and multiplayer modes--including co-op play--as well as vehicular combat, literally thousands of different types of weapons that change each time you play and randomly generated maps and map features.Playable CharactersBorderlandsfeatures several playable characters, each with its own unique backstory, abilities and skills. Skills can be leveled up, allowing for improvement of things like health, accuracy with weapons and capacity for items. In addition to this, characters possess unique skill tree development, ensuring that each will develop differently regardless of time spend leveling them up.Key Game FeaturesCo-op Design-Borderlandsis built from the ground up to be an exciting, intuitive cooperative experience for up to four players simultaneously that rewards players who work together and invest in co-op skills. Split screen is also supported.FPS Gameplay- In this role-playing shooter, choose one of four distinct characters, each with their own individual skill sets. As your character grows throughout this fast-paced FPS, you choose and customize your abilities to suit your style of play.Art Style- The game's distinctive art style combines traditional rendering techniques with hand-drawn textures to paint a bold and eye-catching spin on the FPS genre.Vehicular Combat- Jump behind the wheel and engage in high-speed vehicle-to-vehicle combat, complete with spectacular explosions and road-killed Skags.Frontier Planet- Search the wasteland planet of Pandora for the legendary alien vault. Fight your way through bandits, discover nine native (and aggressive) creatures, and help the few settlers on the planet in your search for a Vault rumored to contain a great prize - if it even exists.Gun Lust- Choose from literally hundreds of thousands of weapons, each with their own manufacturers, specifications, and advantages. The revolutionary content generation system guarantees that you'll find almost infinite tools of destruction to suit your play style.Online Multiplayer Support-Borderlandssupports 2-4 players via PlayStation Network.", "price": 14.99, "imUrl": "http://ecx.images-amazon.com/images/I/51pkC4vxDJL._SY300_.jpg", "related": {"also_bought": ["B0050SX9VO", "B00354NANC", "B005C2D1YI", "B001B1W3GG", "B001NIP3EG", "B0028IBTLG", "B009WI7VAS", "B003O6E6NE", "B00309XHD0", "B0085CA8QG", "B000UU7VUC", "B002I0K5NC", "B00ERDGMO4", "B004HYK8Y8", "B0050SXX88", "B001SGZL2W", "B001NX6GBK", "B00269DX5W", "B003P9FRGA", "B000JLIXIG", "B0012N94WO", "B000X1TC0U", "B00163LW7K", "B003O6E67A", "B0012N3T3Y", "B002I0J5UQ", "B001D7T2VC", "B004PAGJNS", "B003O6EDSM", "B003H0CBYS", "B004FYJFNA", "B002I0J5YW", "B004EQCCI4", "B000P46NMA", "B001JKTC9A", "B0022TNO7I", "B003O6E3C8", "B003L8DXOI", "B000V1OUVI", "B003C1I06U", "B00503E9FY", "B000ZK9QCS", "B007SRM5U6", "B0050SXGU8", "B00319DX4M", "B0044SA734", "B00198PO5I", "B001UWGCW2", "B0050SXFKE", "B002I0H2G0", "B00DJ42BUQ", "B002BRZ6UE", "B002I0J82G", "B0016PZYLS", "B003O6G1L4", "B003JVCA9Q", "B002ELCUUG", "B004918C4M", "B002DC8GKO", "B002I0JBL4", "B000GKCI4A", "B0023CBZ70", "B008CP6MA2", "B0050SXEM8", "B001ASJIS6", "B001TOMQOY", "B007CM0K86", "B000ZK7ZOE", "B00BMFIXKQ", "B000RHZ9G6", "B0021TVYCG", "B000HGOHWO", "B0050SWUTQ", "B00269QLH4", "B002I0F5M8", "B004NRN5EO", "B005185SDA", "B003GT8IL0", "B000HKP88C", "B000FQBF1M", "B00IA2NYT4", "B0050SXYIC", "B00JQHU9RC", "B0012N5MIO", "B004QEWVLC", "B00BBU5WJ2", "B000TVT7U4", "B002NN7AKU", "B001D7T2X0", "B001BP4JY6", "B003O6KWZK", "B007TYC8MI", "B00320JAWY", "B008XMSR6G", "B009JBFF9C", "B002BRZ744", "B00BGA9V2Q", "B0050SXLQC", "B000FII8KQ", "B002Z7BE24"], "bought_together": ["B0050SX9VO", "B003O6E6NE"], "buy_after_viewing": ["B0050SX9VO", "B00ERDGMO4", "B003O6E6NE", "B00F3F2VGI"]}, "salesRank": {"Video Games": 2665}, "categories": [["Video Games", "PlayStation 3", "Games"]]}