{"asin": "B00020LZBG", "description": "The third installment of the Ratchet & Clank franchise incorporates new elements of gameplay not seen previously in the series, including online and offline multiplayer capabilities that will appeal to a wide variety of players.Ratchet and Clank: Up Your Arsenalreturns gamers to Planet Veldin, the setting of the originalRatchet & Clank, where the duo set off on a gripping new adventure through a multitude of diverse planets to fight for galactic peace. Players can earn up to 20 weapons (including online and offline) with up to four levels of upgrades for most weapons, plus new high-tech gadgets to help them through their journey.After word spreads of Ratchet and Clank's recent conquest inRatchet & Clank: Going Commando, Clank finds himself recognized as an interstellar robot of mystery and intrigue after starring in his own television series, Secret Agent Clank. While Ratchet is dismayed by his new sidekick status, the feelings are put aside when the twosome is called together by the Galactic President to bring peace to the universe. They find themselves traveling back to Planet Veldin to battle Dr. Nefarious, a robotic supervillain who has devised a diabolical scheme to wipe out all organic life in the galaxy. To reach his goal, he has instructed the Tyhrranoids, a race of multi-eye aliens to annihilate the organics. However, while Dr. Nefarious is aware that if the Tyhrranoids are successful, they will end up causing their own extinction, the Tyhrranoids are not aware of this danger.To fight back, Ratchet and Clank are able to recruit Captain Qwark, a favorite from previous games, out of retirement to lead the Q-Force, an unlikely band of heroic space cadets comprised of some of the most memorable characters from the Ratchet & Clank franchise. This includes Helga, the robotic seductress; Big Al, a techno-geek with the ability to encrypt technology systems; and Skidd McMarxx, a former hoverboarding champ and pro slacker turned spy. Together with the Q-Force, Ratchet and Clank set off on another hilarious interstellar romp to uncover the schemes of the sinister Dr. Nefarious and keep the galaxy safe for organic life.The Starship Phoenix, headquarters for the Q-Force, is the flagship in the fight against Dr. Nefarious and serves as a key information hub. The Starship is also where players can expect to receive new missions and training, and purchase armor and weapons. In addition, players will gain access to new vehicles, like the Turbo Slider or Hovership, to compete in races and combat enemies in intense battlefield missions. Refined intuitive enemy artificial intelligence means non-playable characters behave more intelligently by gathering information about their environments and forthcoming attacks, ultimately providing the player with more challenging gameplay.The multiplayer gameplay featured inRatchet & Clank: Up Your Arsenalis naturally suited for both the offline and online universe because it includes the variety of weapons, gadgets, vehicles and gameplay made famous throughout the Ratchet & Clank franchise. For those who want to experience the split screen multiplayer capabilities, up to four players can play offline, while the multiplayer online mode accommodates up to eight players over a broadband connection. In addition, six new levels are introduced for online play, featuring several elements that encourage team-based activities in modes such as capturing an enemy's base. For example, destructible environment obstacles in battlefield environments create strategic gameplay decisions and general mayhem. Commandeering multiple vehicles further encourages strategic co-op gameplay by allowing players to work together as one person navigates the vehicle while the other works its weapon's arsenal.In order to promote community gameplay, voice communication is supported online via the USB headset (for PlayStation2), allowing players to communicate with fellow team members during online games, either in-game or in the main lobby. The lobby area features an online friends list, allowing players to be matched up based on their gameplay statistics and will offer the ability to select from a variety of player skins.", "price": 78.98, "imUrl": "http://ecx.images-amazon.com/images/I/515FSBMN1HL._SY300_.jpg", "related": {"also_bought": ["B000099T2E", "B00006GSNX", "B0009I6S0Y", "B00020LZAM", "B00127VDVK", "B000099T1Y", "B00005R5PO", "B0009F3E1I", "B00004TNB0", "B0000690ZE", "B001VLFCVE", "B002DGG9KY", "B001MW91IW", "B000066TS5", "B000G6SPHI", "B000TLU67W", "B00004YRQA", "B0009A4EVM", "9629971372", "B0009I6S0O", "B00009ZVHY", "B0000C7GHG", "B0009O7HVM", "B0002XL3BA", "B0002RQ3I4", "B00004YRQ9", "B004S3KB6S", "B00005TNI6", "B0013JHKU0", "B0000A0MDV", "B0002Y2XXQ", "B000056C34", "B00008URUA", "B0032GTMEE", "B000B69E9G", "B0002IQC8E", "B0013KW1B2", "B000034DC2", "B00009VE6D", "B000E991PC", "B00005NCCI", "B000TYQL1O", "B0000AHRPM", "B001G3B0HC", "B0009SQF0C", "B0045L3SNQ", "B000F5IH2I", "B00005V6BE", "B00000I1BR", "B0000C4M22", "B000FUUD8O", "B0002CNUN0", "B00005U8TQ", "B00005J536", "B00026RFI2", "B00009WAVI", "B000095ZH5", "B000034DCF", "B000WE8JES", "B001AWDG44", "B0001CJEJU", "B0015Z1I4G", "B00008NRM7", "B000GACEHQ", "B000QB059Y", "B00005NUJ3", "B002BWS5QG", "B000IZAQD8", "B00020LZAW", "B00006F2ZP", "B0007SL1ZI", "B00000DMAR", "B0002IQCSY", "B00097CYZS", "B00005V6B9", "B000KCX9M4", "B00000I1BF", "B00004U4R9", "B000CFWHPY", "B00000I1BQ", "B0009350BW", "B000YYR3D4", "B001CLG6SG", "B0032GPYO6", "B0002RQ3ES", "B0009EHQVI", "B000FDDN2E", "B000ECX0FQ", "B000G79XQO", "B000066JRQ", "B000G7YX14", "B000TGQLYE", "B0007KTBB2", "B00008DHNV", "B00006JC4A", "B00005NN5G", "B00004U8QX", "B00004U5VF", "B0033T1UWW", "B00006Z7HU"], "bought_together": ["B000099T2E", "B00006GSNX"], "buy_after_viewing": ["B00006GSNX", "B000099T2E", "B0050SXI6K", "B0009I6S0Y"]}, "salesRank": {"Video Games": 2504}, "categories": [["Video Games", "More Systems", "PlayStation 2"]]}