{"asin": "B004K6O3C6", "categories": [["Electronics", "Computers & Accessories", "Monitors"]], "description": "ViewSonic&acute;s new VA1948m-LED widescreen monitor features a LED backlit 19\" thin bezel display with integrated speakers. The VA1948m-LED is mercury-free and offers a full HD 1440x900 resolution. This beautiful display has a 10,000,000:1 Dynamic Contrast Ratio, DVI and VGA inputs, 5ms response time, and a VESA mountable glossy finish design. The VA1948m-LED features an automatic aspect ratio adjustment, which senses the input single and will not stretch a 4:3 signal but instead, it will position the image in the middle of the screen with side bars. With a 3-year warranty, Energy Star 5.0 certification, the industry&acute;s best pixel performance policy, and energy saving Eco mode, the VA1948m-LED is a great long-term investment.Key Features:19\" widescreen LED backlit monitor; great value for small office, home office applications, corporations, government and educationUp to 50% power savings over a traditional CCFL 19\" monitorResolution with 16:10 aspect ratio for perfect image reproductionConnectivity options with DVI with HDCP and VGA inputsMultimedia enriched with integrated stereo speakers100mm x 100mm VESA compliant for wall mount or monitor standsHighest grade panel with the best pixel performance policy in the industryWhat is a LED monitor?The term \"LED monitor\" generally refers to a monitor with a LCD panel and a LED backlight. A typical LCD monitor uses cold cathode fluorescent lamps (CCFL) as a light source to illuminate the LCD panel. In an LED backlit monitor, white LEDs (Light Emitting Diodes) are used as the light source. LED backlights provide the following benefits:About 50% less power consumption compared to traditional CCFL monitor10,000,000:1 MEGA Contrast RatioMercury-free backlightLow EMI (Electro Magnetic Interference)Slimmer designWeight reduction&nbsp;Cold Cathode Fluorescent LampLED: Light Emitting Diode&nbsp;Save cash and save the planetWith its mercury free backlight and low energy consumption, the Energy Star 5.0 certified VA1948m-LED saves your electricity bill. The savings of LED can add up to thousands of dollars saved for large install bases, such as big corporate buildings or schools. The savings can be as dramatic as $20,000 in five years!MEGA dynamic contrast ratioOne of the great features of VA1948m-LED is its ability to dim the backlight completely for pure darkness during dark scenes, such as a night shot in a movie. Contrast ratios refer to the ratio of the brightest color to the darkest color. With traditional CCFL backlit displays, contrast ratios are limited to the fluorescent lamp&acute;s ability to dim, in order to reproduce darkness. However, with the LED backlight, each LED has the ability to completely shut-off allowing for a near infinite ratio of black to white contrast. The end result is true blacks that result in greater overall image quality.Pair it with a ViewSonic or Mac computerOne of the key advantages of the VA1948m-LED monitor is its diverse connectivity options, making it flexible to be paired with a PC or a Mac computer. ViewSonic has recently announced a full line of PC products, including PC Minis and all-in-one PCs. Now you can hook up any Viewsonic PC as well as a MacBook&reg; or a Mac Mini to the VA1948m-LED and enjoy a full 19\" widescreen with LED backlight!", "title": "Viewsonic VA1948m-LED 19-Inch Widescreen LED Monitor (Black)", "price": 104.39, "salesRank": {"Computers & Accessories": 9869}, "imUrl": "http://ecx.images-amazon.com/images/I/51TyzHQScWL._SX300_.jpg", "related": {"also_bought": ["B00AGQ4WHA", "B008FC8DFY", "B003HFCDLY", "B00D78QCYK", "B00443WABQ"], "buy_after_viewing": ["B00D601UC8", "B00AGQ4WHA", "B00D78QCYK", "B001TH7T2U"]}}