{"asin": "B001UQ6F5M", "description": "LG BD390(August 17, 2009)It&rsquo;s time to expect more from a Blu-ray player than just stunning Full HD 1080p. Way more. Feast your eyes on the first LG Network Blu-ray Disc Player with both NetCast Entertainment Access and Integrated Wi-Fi Connectivity. That means thousands of movies, shows and online videos straight to your TV from any wireless Internet connection. Streaming entertainment services like CinemaNow, Netflix and YouTube are at your fingertips, whenever you want them. LG BD390 has virtually endless entertainment built-in and it can be tapped into from any available Wi-Fi connection.Features and TechnologyLess Clutter. More Possibilities.Cut loose from messy wires. Integrated Wi-Fi Connectivity lets you tap into BD390&rsquo;s streaming services from the Internet almost anywhere you have a Wi-Fi connection. (Learn more)Entertainment On TapThe end of &ldquo;there&rsquo;s nothing on&rdquo;. NetCast Entertainment Access lets you stream instant, and virtually endless, entertainment from CinemaNow, Netflix and YouTube. It&rsquo;s direct to your TV from the Internet&mdash;no computer required. (Learn more)Enjoy It At Its BestWhy would you want anything but the best picture possible? Make the most of your HDTV. Blu-ray disc playbackdelivers exceptional Full HD 1080pvideo and audio performance. (Learn more)Making Old Just Like NewNo need to go out and replace your old DVD collection. Even your standard DVDs look better on Blu-ray with Standard DVD Up-Scaling.(Learn more)Capture The Silver ScreenEver wish movies looked more like they do in the theater? Wish no more. With Cinema Mode, you can watch movies the way they are meant to be seen. (Learn more)Don&rsquo;t Just Hear It. Feel It.Great picture needs great sound. Blu-ray&rsquo;s superior audio performance lets you listen in Full HD and supports up to 7.1 channels of surround sound in the latest formats. (Learn more)No More Waiting To WatchWhen you&rsquo;ve decided on a movie, you don&rsquo;t want to sit around waiting for it to load. Express Reaction Startupeliminates annoying load times. (Learn more)Your Personal FavoritesIt&rsquo;s time to bring your favorite music files, digital photos, and videos from your computer straight to your TV. With MyMedia, it&rsquo;s easy. (Learn more)Memories On The Big ScreenWant to view a highlight reel of your family vacation in the comfort of your living room? You can with USB 2.0 Media Plus. (Learn more)Get More From Your MoviesWant to hear real time commentary from your favorite movie director? You could do that, and a lot more, with BD Live. (Learn more)Learn MoreIntegrated Wireless ConnectivityConvenient connectivity to your wireless home network allows BD390 to deliver you NetCast Entertainment Access and BD Live features, even in rooms where broadband connections can&rsquo;t reach. All you need is an active Wi-Fi signal&mdash;it&rsquo;s that simple.Netcast EntertainmentNow buying a Blu-ray player from LG can also mean getting access to virtually endless entertainment and services from the Internet. Want to watch your favorite action film? If you have an LG Network Blu-ray Disc Player with NetCast Entertainment Access and an Internet connection, select an onscreen service and you&rsquo;ll be enjoying it in moments. Tapping into virtually endless entertainment from the Internet no longer requires a computer or messy wires. This is the future of entertainment, and it&rsquo;s available now with LG.Cinema NowNow Hollywood&rsquo;s latest hits can be viewed any time you want. With CinemaNow, LG consumers can get instant access to pay-per-view movies from major studios directly to any LG Network Blu-ray Disc Player. Find major release titles, along with broadcast and cable television programs. The entire premium content catalog can be browsed directly and selections can be watched instantly. CinemaNow and LG have redefined what can be expected of digitally available entertainment.Netflix: Unlimited ViewingMake the most of the extensive offerings on Netflix. Users with a subscription can sit back and enjoy unlimited instant access to over 12,000 Netflix movies and TV episodes* streamed directly to their TV set. Most movies and TV episodes appear in standard definition and many selections are not new releases.*Netflix subscription required and sold separately.YouTubeNow you can watch everything on YouTube right in your living room. Blu-ray players with NetCast give you unlimited, direct access to the millions of Web videos available through YouTube, whenever you want them. All you need is an active Internet connection. Watch that one fellow making a fool of himself over and over again.&nbsp;The Best PictureThis next generation optical disc format brings you the highest Full HD 1080p experience. That means it allows you to get the best picture quality available from your HDTV and even improves old DVDs with 1080p Up-Scaling, improving standard DVD picture quality so they look their best in Full HD.The Best CapabilitiesBlu-ray utilizes the latest laser technology, offering up to 5 times the digital capacity of traditional DVDs. More space means more room for cool features and extra content.Standard DVD Up-ScalingIt&rsquo;s not just Blu-ray discs that look great on a Blu-ray player. Standard DVD Up-Scaling delivers exceptional image quality from standard DVDs to near full HD picture quality. That means even your older movies and shows look better on an LG Blu-ray player.Cinema ModeStay in for the theater. Enjoy a true cinema-like experience in your own home with movies the way they are meant to be seen. LG&rsquo;s Cinema Mode precisely displays 24p source frames on your screen, the same as on a movie screen. If you love movies, you&rsquo;ll love LG&rsquo;s Cinema Mode.Superior Audio PerformanceBlu-ray lets you enjoy the best sound available from your movies and shows. Supports surround sound up to 7.1 channels with Dolby Digital Plus, Dolby TrueHD and dts-HD Advanced Digital Out technologies.Express Reaction StartupSome Blu-ray players can take what seems like an eternity to load your Blu-ray disc. With Express Reaction Startup, the quick start-up and quick opening tray will have your movie loaded and ready to play before you even hit the couch.MyMediaGives you access to videos, photos and music from your home network through this DLNA-certified media player. Your digital collections are now within easy reach and simple to view in the comfort of your living room.USB 2.0 Media PlusBring your digital library to life on your television with USB Media Plus. View family photos, watch videos and listen to music from USB storage devices.BD LiveNow you can tap into live chats, trivia games and newly developed content right from your Network Blu-ray Disc Player. Coupled with a high-speed Internet connection, BD Live allows you to take advantage of interactive experiences, exclusive downloads and tons of extra features.What's in the BoxLG BD390 Unit, Remote Control, Owner's Manual", "title": "LG BD 390 Network Blu-ray Disc Player (2009 Model)", "price": 7.27, "imUrl": "http://ecx.images-amazon.com/images/I/3181MAYNICL._SX300_.jpg", "related": {"also_viewed": ["B004OF9XMI", "B0089KJPM2", "B0036WS4CA", "B0038KR8WM", "B005DII6DC", "B00793MIJM", "B00BD7UVKI", "B004ZP756S", "B00793MIGK", "B001URWAYG", "B00BD7UVHG", "B004N85YBA", "B00752R4PK", "B0036WT1V8", "B005NEZDUA", "B001V9LA44", "B00IAELTKI", "B00FF9SVWA", "B00IAELTK8", "B00F9YYHSI", "B00752R4QO", "B00AYB3OMG", "B00BD7UVO4", "B00ECQABDY", "B00EUY59Z8", "B00ABU7Y26", "B008PIIM6S", "B00G4TTQQK", "B00AWX6EYQ", "B004BLK24S", "B00AWKC0JM", "B001A4LVYY", "B00HPMCO4Q", "B0076R7F1M", "B00BFDHVAS", "B0076R7F62", "B00BQ3EGPU", "B009YWN926", "B006U1YUZE"], "buy_after_viewing": ["B002ITNY6S", "B003L1ZYYM", "B00AWKC0JM", "B00BD7UVO4"]}, "categories": [["Electronics", "Television & Video", "Blu-ray Players & Recorders", "Blu-ray Players"]]}