{"asin": "B002DMK1R0", "description": "The premium Magellan Maestro 4700 GPS device boasts the acclaimed and exclusive OneTouch favorites menu and an ultra-slim 4.7-inch color touch screen. Preloaded NAVTEQ maps and six million points of interest for the United States, Canada, and Puerto Rico make the Magellan Maestro 4700 GPS product ideal for both business trips and vacations. Easy-to-use premium features, such as AAA TourBook, voice command, highway lane assist, predictive traffic, and Bluetooth compatibility for hands-free calling, give you confidence on the road and deliver an exceptional navigation experience.Exclusive OneTouch Favorites MenuEasily bookmark favorite destinations and searches with personalized bookmarks so you can find them anywhere you travel. Find your favorite cafe or restaurant in any city with a single touch. The Magellan Maestro 4700 device definitely delivers \"your favorites at your fingertips.\"Exclusive AAA TourBook GuideNo membership required. Invaluable to anyone who travels, the AAA TourBook guide, which contains information on all 50 states and Canada, is built into your Magellan Maestro 4700 and provides ratings and descriptions on AAA approved places to stay, play, dine, and save.4.7-inch Touch ScreenThe wide, ultra-slim 4.7-inch color touch screen shows your position on the unit including map route, destination, ETA, Points of Interest (POI), OneTouch favorites, street names, and more--all at a glance. The large 4.7-inch screen is 16% larger than a 4.3-inch screen.6 Million Points of Interest (POI)Easily find whatever service you need. Gas stations, restaurants, hotels, ATMs, and hundreds of other businesses are intuitively categorized and searchable from the built-in POI database.Voice CommandSafely navigate hands-free by speaking a variety of commands to control the Maestro 4700. You can \"Go Home\" or find the \"Nearest Gas\" just by using your voice.Highway Lane AssistRealistic highway signs point you in the right direction when approaching interchanges and exits, ensuring that you'll choose the correct lane well before your next turn.Bluetooth CompatibilityEasily make or receive calls using a compatible cell phone and even synch up to 1000 numbers directly from your phone. Plus, the noise cancelling microphone keeps road noise down so you are heard clearly.Predictive TrafficIt automatically analyzes past traffic patterns when creating a route to help you avoid known delays, saving you time and making your journey less stressful. Choose to stay on your current route or go with the new less-traveled route.Highway Exit POI SearchSearch for gas stations, restaurants, hotels, and more near upcoming highway exits.QuickSpell with SmartCity SearchEnter destinations with only a few touches. QuickSpell with SmartCity searchhelps you quickly enter addresses and narrow location searches, making destination entry easy.Multi-destination RoutingPlan a trip with multiple stops in the order you want, or have it optimized for the most efficient route. Easily reorganize, add, or remove destinations.Spoken Street Name GuidanceHear street names and directions for a clear understanding of when to make the next turn, while you keep your eyes on the road.&#xA0;3D LandmarksVisual cues, such as stadiums and bridges, let you navigate safely and easily.Find your CarEasily remember the location of your car in parking lots, airports, malls, universities, amusement parks, or stadiums. When your day is done, the Maestro 4700 will automatically guide you to your car.&#xA0;NAVTEQ MapsTravel the entire United States, Puerto Rico, and Canada with all the maps you need, pre-loaded on your device.What's in the Box?Magellan Maestro 4700 GPS receiver; pre-loaded maps of United States, Canada, and Puerto Rico; windshield mount; adhesive disc for dash mounting; vehicle power adapter; USB cable; user handbook.Visit MagellanGPS.com for thelatest software update for your Maestro 4700to keep it current and performing at its best.", "title": "Magellan Maestro 4700 4.7-Inch Bluetooth Portable GPS Navigator", "price": 142.99, "imUrl": "http://ecx.images-amazon.com/images/I/41lUoN3ggOL._SX300_.jpg", "related": {"also_viewed": ["B003ZHVBQM", "B0054J8BWQ", "B002LITI70", "B001VEIYAC", "B0082XN57W", "B003CYKYVG", "B0052D38UE", "B005HH35EY", "B0015F1L7A", "B003CYKYV6", "B000V4PZCI", "B00CH3FRG0", "B00HK6CPVY", "B000OH63MI", "B00BIZ0EY8", "B003ZUXVQW", "B003CYKYUW", "B007TSERYG", "B0021L9C0A", "B0050VEH1M", "B007TSESFO", "B004MYFTFG", "B003CYKYUC", "B003ZUXVQM", "B0057OCDQS", "B00J9Z35MW", "B0082XN4PA", "B004MYFTFQ", "B0057ODG6Y", "B0057ODOCA", "B0082XN57M", "B003CYKYU2", "B005FPT5MY", "B0052D38UO", "B000V4X26O", "B00AXX0JNW", "B00JB3P9K8", "B001ELJ9P6", "B00AXX0IEC", "B00DBD682W", "B00AXZWG8Q"], "buy_after_viewing": ["B003ZHVBQM", "B0054J8BWQ", "B002IKKFHS", "B00AXX0I88"]}, "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]]}