{"asin": "B0009Q1IE2", "description": "In the mid-21st century, a barbaric alien race called the Strogg launched a massive invasion on Earth. Originally believed to be an attempt to strip the planet of its natural resources, humans soon discover that the Strogg are simply after only the human remains of those they kill. Through a horrific process, the limbs and flesh of the fallen are fused with metal and machinery to create the monstrosities that are the alien Strogg.Defeat the Strogg on their own turfThe Strogg and humans battle for years on Earth, but as resources become depleted, Earth mounts a counter-assault on the Strogg homeworld. The first assault force is launched from the fleet and encounters overwhelming resistance--most of the drop-ships are destroyed by the Strogg homeworld's massive defense weapon known as \"The Big Gun.\" However, one surviving Marine breaks through and is able to destroy the big gun and ultimately defeat the Strogg leader, the Makron. But the war did not end there.You are Matthew Kane, a member of the elite Rhino Squad and part of the next massive invasion that spans across the entire Stroggos planet. Equipped with hi-tech weapons, vehicles and teamed with Earth's top marine squadron you soon realize that this war is far from over. In fact, your worst nightmare is soon realized when you discover that the only way to defeat the Strogg is to become one of them.", "price": 97.62, "imUrl": "http://ecx.images-amazon.com/images/I/5182EJXNYNL._SY300_.jpg", "related": {"also_bought": ["B00006C2HA", "B000GPVUUS", "B008E6ZXA4", "B0007II11K", "B000028U28", "B003ICGL7I", "B000GRB4G6", "B000BKYQVI", "B001Q96ZNU", "B00080LSOY", "B000ARB5MA", "B001CC8UBG", "B002BS47YE", "B0050SZ0SY", "B000BHQZAQ", "B002I0JAJ2", "B002V14VOC", "B0007ZLJNU", "B002I0IHIM", "B0000ZUGZ4", "B005C2D2H4", "B000PS2XES", "B00005N7YR", "B00000K3QV", "B00005OBQB", "B007H2V9W2", "B000BVKQWA", "B000Q1MVSC", "B000065SQJ", "B000H1AGA6", "B00005KAY0", "B000GC5V1U", "B004XH7HFC"], "bought_together": ["B00006C2HA", "B008E6ZXA4"], "buy_after_viewing": ["B008E6ZXA4", "B000GPVUUS", "B000GRB4G6", "B00CPKUV9I"]}, "salesRank": {"Video Games": 7381}, "categories": [["Video Games", "PC", "Games"]]}