{"asin": "B004JJU6I4", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Memory Cards", "SD & SDHC Cards"]], "description": "Shoot as a pro and enjoy great performance and transfer speeds with SanDisk Extreme Pro SDHC UHS-I Memory Cards. With read/write speeds of up to 45 MB/s*, the SanDisk Extreme Pro SDHC Memory Cards allow you to enjoy professional continuous burst-mode shooting and capture fast-action Full HD1and 3D video. Ideal for professionals and enthusiasts who need exacting performance, SanDisk Extreme Pro SDHC Memory Cards let you get the most out of your DSLR or HD camcorder.SanDisk Extreme Pro 8GB SDHC UHS-I Memory CardAt a Glance:8 GB SDHC memory card for use in advanced digital cameras and HD camcordersUp to 45 MB/s* read/write speeds; UHS Speed Class 1 enabled for Full HD1video speedPower Core Controller for better efficiency and performanceBacked by a limited lifetime warranty2Designed for professionals and enthusiasts who shoot the highest quality RAW photos and high-definition videos.SanDisk Extreme Pro SDHC Memory CardComes in Capacities Up to 32 GB to Store All Your FilesThe SanDisk Extreme Pro SDHC Memory Cards were designed for professionals and enthusiasts who shoot the highest quality RAW photos and high-definition videos, and need the large storage capacities that these files demand. The SanDisk Extreme Pro SDHC card comes in capacities up to 32 GB, so you'll find a card with the capacity you need.Fast, Efficient Performance with Power Core ControllerProfessionals and enthusiasts who want to get the most out of their advanced equipment will love the SanDisk Extreme Pro SDHC Memory Cards. The cards feature fast read/write speeds of up to 45 MB/s* to capture more shots in continuous burst shooting and let you keep up with Full HD and 3D video recording.The SanDisk Extreme Pro SDHC Memory Cards are engineered with SanDisk's Power Core Controller, which distributes image data across the card more rapidly and efficiently for better performance. The cards are UHS Speed Class 1 enabled for capturing fast-action video in full high definition.Reliable and Durable Even in Extreme EnvironmentsSanDisk designed the solid-state Extreme Pro SDHC memory cards to work reliably in adverse environments, so you can travel anywhere for your shots. The cards have error correction code and data safe management algorithms to ensure data integrity.SanDisk Extreme Pro SDHC Memory Cards are waterproof+and tested to withstand up to 72 hours in salt or fresh water to a depth of 1 meter. They are also shock and vibration proof+, and can withstand up to 500Gs of shock+. Additionally, the cards are magnet proof+and X-ray proof+, so they won't be affected by an airport's X-ray machine.The SanDisk Extreme Pro SDHC Memory Cards are designed to perform from -13 to 185 degrees Fahrenheit, so whether you're in the desert or the Arctic tundra, you'll get the shots you want.Built-in Write Protection and Data Recovery SoftwareThe SanDisk Extreme Pro SDHC Memory Cards have a built-in write-protect switch to help prevent accidental data loss. And for added protection, the card includes a one-year downloadable offer for RescuePRO data recovery software, which can bring accidentally deleted images back to life.SanDisk also includes the added protection of secure online backup (up to 2 GB optionally available) offered by SanDisk's online backup partner, YuuWaa.About SanDiskSanDisk Corporation is a Silicon Valley-based S&amp;P 500 and Fortune 500 company. It is a global leader in flash memory cards--from research, manufacturing, and product design to consumer branding and retail distribution. SanDisk holds more than 1,700 U.S. patents and more than 1,100 foreign patents.SanDisk pioneered the CompactFlash card format and co-invented the SD format. SanDisk has the rights to manufacture and sell every major flash memory card format.The SanDisk Extreme Pro SDHC Memory Card is backed by a limited lifetime warranty2.What's in the BoxSanDisk Extreme Pro SDHC Memory Card (8 GB) and jewel case.Photo CapacityCapacity12 MP JPEG(3 MB**)14 MB** RAW File32 GB8,0001,92016 GB4,0009608 GB2,000480&nbsp;or&nbsp;Video CapacityCapacityHD2Video (1280x720x30fps)&nbsp;32 GB5 hours, 48 minutes16 GB3 hours, 15 minutes8 GB1 hour, 26 minutes1Thirty-year warranty in regions not recognizing lifetime limited warranty.2Full HD (1920x1080x30fps), HD (1280x720x30fps) and 3D video support may vary based upon host device, file size, resolution, compression, bit rate, content and other factors. See www.sandisk.com/HD*Up to stated speed, based on SanDisk internal testing. Performance may be lower depending up on host device. 1 megabyte (MB) = 1 million bytes. X =150KB/sec.**Approximations: results vary based on file size, resolution, bit rate, content host device, pre-loaded files and other factors.+Proof icons shown apply to SD, SDHC, microSD and microSDHC card formats up to 32 GB only, see sandisk.com/proof for additional information.", "title": "SanDisk Extreme Pro 8  GB SDHC Flash Memory Card SDSDXP1-008G", "price": 31.99, "imUrl": "http://ecx.images-amazon.com/images/I/51vrY8PX7CL._SY300_.jpg", "brand": "SDKSK9", "related": {"also_bought": ["B007NDL542", "B005LFT3GG", "B007NDL56U", "B004KV9THA", "B007M54E08", "B004OHJ1M8", "B007DBJ2XA", "B0090CF57M", "B004KU0RJK", "B0042X9LCO", "B0098TG67U", "B00006JN3G"], "bought_together": ["B007M54E08"], "buy_after_viewing": ["B007NDL56A", "B007NDL542", "B007M54E1M", "B007NDL56U"]}}