{"asin": "B00AXX0I88", "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS", "Trucking GPS"]], "description": "Bright Displayn&uuml;vi 2597LMT has a bright 5.0\" display with dual-orientation capabilities, for use horizontally or vertically.Detailed Maps with Free Updatesn&uuml;vi 2597LMT arrives loaded with detailed maps of North America. With  free lifetime&sup1; map updates, your routes are sure to reflect the most  up-to-date maps, POIs (points of interest) and navigation information.  New maps are available for download up to 4 times per year, for the life  of your device, with no fees.With so much data, n&uuml;vi 2597LMT makes it easy to find addresses and  millions of POIs such as businesses, stores, restaurants and other  destinations. n&uuml;vi 2597LMT arrives preloaded with POIs, so there&rsquo;s no  need for you to enter that address information. Just select one &mdash; or  many &mdash; and navigate there, quickly and easily. You also have the ability  to add custom POIs to your n&uuml;vi 2597LMT.Garmin Trafficn&uuml;vi 2597LMT features Garmin Traffic to help you spend more time on the move. With Garmin Traffic, your  driving map remains onscreen at all times. Traffic alerts appear to the  side of your map and messages are spoken, too. Garmin Traffic can give  details about the situation, such as how many minutes of delay to expect  and if there are any possible detours. It can even confirm whether or  not you are on the fastest route. Garmin Traffic is voice activated, so  it responds to spoken requests. Lifetime traffic&sup2; entitles your n&uuml;vi  2597LMT to receive free traffic information for its entire useful life.The Power of Your Voicen&uuml;vi 2597LMT has the luxury of voice-activated navigation. Speak, and  your device intelligently responds; your hands can remain safely on the  wheel. Of course, you can also navigate using the touchscreen  interface.Garmin Real Directions&trade; with Garmin Real Voice&trade;n&uuml;vi 2597LMT redefines &ldquo;spoken turn-by-turn directions&rdquo; with Garmin  Real Directions, easy-to-understand driving directions that guide like a  friend, using recognizable landmarks, buildings and traffic lights. No  more stress from trying to read street names. Garmin Real Voice is  refined speech technology that sounds more like a natural, friendly  voice. Garmin Real Directions and Garmin Real Voice are features that  are only available in our line of GPS navigators.Bluetooth&reg; CompatibleSync a Bluetooth-enabled device, such as your smartphone, to n&uuml;vi  2597LMT for hands-free calling through its integrated microphone and  speaker. Safely stow your phone in a glove compartment, pocket or purse  and still make and take calls without moving your hands from the  steering wheel or your eyes from the road.Smartphone Link CompatibleSmartphone Link is a free mobile app that connects your n&uuml;vi 2597LMT with your Android&trade;  smartphone. When paired, your n&uuml;vi 2597LMT can use your phone&rsquo;s  existing data plan&sup3; to share information &mdash; such as where you parked,  POIs and your destination.Smartphone Link also gives you access to Garmin Live Services&#x2074;,  useful real-time information such as weather and traffic conditions.  Garmin Live Services are available free and by subscription.Comprehensive Driving Guidance You See and HearActive Lane Guidance with voice prompts prepares you to drive through  an exit or interchange with confidence. As you approach, an animated  model uses brightly colored arrows to indicate the proper lane needed  for your route; a friendly voice offers additional help. Bird&rsquo;s Eye  junction view offers a detailed view of interchanges, looking down as if  from overhead. photoReal junction view realistically displays junctions  and interchanges along your route, including the surrounding landscape.  Brightly colored arrows indicate the proper lane to drive. n&uuml;vi 2597LMT  also depicts real road signs as they appear along your route.More Information at a Glancen&uuml;vi 2597LMT keeps your driving map onscreen at all times and  additional information appears alongside. For details, simply ask or  touch the screen. As you drive your route, Up Ahead constantly informs  you of nearby services, including restaurants, fuel stations, hospitals  and stores.n&uuml;vi 2597LMT displays speed limit, current speed and accurate time of  arrival. With a quick glance, you can read the name of your current  street. n&uuml;vi 2597LMT also shows school zone warnings.One-stop Device ManagementUse Garmin Express to keep your n&uuml;vi up-to-date. Garmin Express makes it easy to update  maps and software, transfer favorites to and from devices, and install  free custom vehicles and voices.What's in the Box:n&uuml;vi 2597LMPreloaded City Navigator&reg; NT for North AmericaLifetime maps&sup1; and traffic&sup2; (indicated by &ldquo;LMT&rdquo; after model number on the box)Lifetime traffic antenna/vehicle power cable (vehicle power cable is the traffic antenna)Vehicle suction cup mountUSB cableQuick start manual&sup1;If you purchase a n&uuml;Maps  Lifetime subscription (sold separately or bundled together with certain  GPS models), you will receive up to 4 map data updates per year, when  and as such updates are made available on Garmin&rsquo;s website, for 1  compatible Garmin product until your product&rsquo;s useful life expires or  Garmin no longer receives map data from its third party supplier,  whichever is shorter. A product&rsquo;s &ldquo;useful life&rdquo; means the period during  which the product (a) has sufficient memory capacity and other required  technical capabilities to utilize current map data and (b) is capable of  operating as intended without major repairs. A product will be deemed  to be out of service and its useful life to be ended if no updates have  been downloaded for such product for a period of 24 months or more.  Unless otherwise stated, the updates you receive under the subscription  will be updates to the same geographic map data originally included with  your Garmin product when originally purchased. In some instances, your  Garmin product might not have sufficient memory remaining for you to  load an update to the map data, in which case you will need to either  (a) select reduced map data coverage for your updates, or (b) purchase  separately a microSD&trade;/SD&trade; card (if and as applicable to your Garmin  product) and load all or a portion of the map data coverage for your  updates to the card and insert the card into the microSD/SD card slot  contained in your Garmin product. If neither of the measures in (a) or  (b) can be used to address your product&rsquo;s lack of sufficient remaining  memory, then Garmin may conclude that the &ldquo;useful life&rdquo; of your product  has expired. Garmin may terminate your n&uuml;Maps Lifetime subscription at  any time if you violate any of the terms of this agreement or your  subscription. Your n&uuml;Maps Lifetime subscription may not be transferred  to another Garmin product.&sup2;FREE lifetime traffic updates  may not be transferred to another person or another Garmin product.  Lifetime traffic extends for the useful life of your Garmin traffic  receiver (as long as you own a compatible Garmin GPS) or as long as  Garmin receives traffic data from its traffic supplier, whichever is  shorter. A traffic receiver&rsquo;s &ldquo;useful life&rdquo; means the period during  which the receiver (a) has the required technical capabilities to  utilize current traffic data service and (b) is capable of operating as  intended without major repairs. Traffic content not available for all  areas. See traffic coverage areas.&sup3;User&rsquo;s data plan charges, if  any, will apply. Contact your mobile service provider for more  information about your service plan&rsquo;s data and roaming rates.&#x2074;Subscription may be required.", "title": "Garmin n&uuml;vi 2597LMT 5-Inch Bluetooth Portable Vehicle GPS with Lifetime Maps and Traffic", "price": 173.0, "imUrl": "http://ecx.images-amazon.com/images/I/5124gm5veeL._SY300_.jpg", "brand": "Garmin", "related": {"also_bought": ["B004I5BUSO", "B002OL2MU4", "B00CO8UIF8", "B00BB2NMXI", "B00CWNT69O", "B00INXADT4", "B00BXQ0370", "B00INXAKTC", "B0035JL4V2", "B007RMAS1K", "B00422KZQG", "B00F0CXAF0", "B000LRMS66", "B00B5TELRI", "B00DTV2IPC", "B00DMLO5LY", "B001OMYA0O", "B001S2RCWI", "B0096DM9YC", "B00CRQUKQ4", "B004HYGEOQ", "B00C7C6BGQ", "B00BCPYPVC", "B00I0073WA", "B00BGKQHQ4", "B00GYDYV0C", "B001CZCYBU", "B00JAULSTI", "B00C8EQ96K", "B000BS2V44", "B003N73S9M", "B005NJJWVG", "B001S2R8E0", "B002T0EK64", "B00B7DUAU4", "B008H6176U", "B003RQBKLC", "B0015A6YN6", "B0055XNWJI", "B00AXX0JOQ", "B0051FWA7U", "B004UPZVSC", "B00GOX22WQ", "B002KO5XVU", "B00236XLA0", "B00AXX0IC4", "B00F474DVG", "B008FCAA2S", "B008EODGHS", "B00H1KMTAQ", "B009QZH7BU", "B00AJSIVWW", "B009QZH7D8", "B004MDXS0U"], "bought_together": ["B002OL2MU4", "B004I5BUSO"], "buy_after_viewing": ["B005DIBHA6", "B002OL2MU4", "B00AXZWG8Q", "B004I5BUSO"]}}