{"asin": "B0041ORN6U", "related": {"also_bought": ["B0041ORN9M", "B0041ORN92", "B0041ORNCY", "B0001Q5SV4", "B0041ORN8I", "B004OA721C", "B0009JR5SM", "B00CRB53CU", "B004GHMU5G", "B004Z9301I", "B004GHMU5Q", "B0000ANEX9", "B008JJLW4M", "B004RB4LOY", "B007UQRPO6", "B004GHMU60", "B00077INZU", "B00C2DL96W", "B00EHBERSE", "B00BHZJMB0", "B004OA6VUA", "B004XXMUCQ", "B001DW8J5C", "B001B1DV0S", "B00CPRVF5K", "B000BMZHX2", "B007SU0L7C", "B00E46Y8ZE", "B000JLF4FG", "B007R1SIY0", "B00CM9K7E6", "B0007OGTGS", "B004HIN9RM", "B00D80J2XU", "B008CWW6VY", "B00CYSYYU8", "B0041ORNFQ", "B005EORRBW", "B00DGH08OC", "B007JLE84C", "B0041ORNFG", "B000XJLLKG", "B005H4CDF4", "B0009B0K3W", "B0007T27H8", "B00006RVPW", "B007SDHAJ6", "B00BS92DCK", "B005TJD0T0", "B0042WCFI2", "B007HIMJS4", "B00E3W19MO", "B0013KCLQC", "B00HEM5KRA", "B004H8FSQM", "B00HEMDYLY", "B003K1NFY4", "B003A7LKOU", "B00425S1H8", "B0041ORNDI", "B007UQROJC", "B003SAYZGY", "B00C4U030G", "B00GAIMXR4", "B0060RUVBA", "B00CUYOGRM", "B001PS9E5I", "B0000AZK72", "B0009JR5LO", "B004GHMU6A", "B004496TFS", "B008ALA6DW", "B0028H1G9C", "B00C2DLRV4", "B008D74UN0", "B009VBSRJK", "B001CY0P7G", "B001DW296C", "B003N3DU3K", "B0010DGMXA", "B00CXU1NHY", "B00C2B81K6", "B0049KV52E", "B008JJLZ7G", "B0093CBTOM", "B005S2KPPU", "B004GHMU4M", "B0002DV0CM", "B004CIBQ4K", "B00DUYCU7E", "B007OWYB7U", "B00006MJFL", "B004T01KOC", "B008B8CVTQ", "B0002DV0G8", "B001AZP6O4", "B00DUYDOJ2", "B000JVTTPM", "B00HM9J6NY"], "bought_together": ["B0041ORN9M"], "buy_after_viewing": ["B0041ORN92", "B004GHMU5G", "B004OA721C", "B00006RVPW"]}, "title": "Cisco SG300-10 10-port Gigabit Managed Switch (SRW2008-K9-NA)", "price": 190.98, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31tb9Ztbv5L._SX300_.jpg", "brand": "Cisco", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Switches"]], "description": "The Cisco SG 300-10 Switch is an affordable, high-performance, easy to manage device that&rsquo;s designed specifically for small businesses. This compact 10-port managed switch boosts network performance and supports high-bandwidth applications for an efficient, productive workplace. Part of the Cisco 300 Series of switches, the SG 300-10 provides energy-saving, security, and advanced network features to support a small business network. And a limited lifetime warranty with next-business-day advance replacement protects your investment.Built-in security and advanced networking features support business-class data, voice, security, and wireless solutions.10 Gigabit Ethernet ports provide fast, reliable access to applications and network resources.Fast, reliable acces to the resources you needWith 10 10/100/1000 ports and two combination mini-GBIC ports, the SG 300-10 Switch allows you to connect small office devices, such as computers, printers, and wireless access points, and multiple switches to each other, giving employees fast, reliable access to the resources they need. Gigabit Ethernet connectivity provides optimal network performance, ensuring availability of your business-critical applications. The SG 300-10 Switch also provides the flexibility you need to interconnect a variety of devices across your network, including voice, security, and wireless solutions. In addition, this device offers several advanced networking features, including support for Layer 3 switching between VLANs for advanced traffic management as well as IPv6, remote management, and dual images support.Built-in security keeps your network and data safeThe SG 300-10 includes a number of security features that let you tightly control access to your network, safeguarding the integrity of your data. Using access control lists (ACLs), you can authenticate and regulate new connections to your network, keeping unwanted users away from your business-critical information. With this device, you also can segment your network and provide a secure section for visitors by using the integrated guest VLAN capability. In addition to strong security features, the SG 300-10 Switch provides business-class communication capabilities, such as support for IP telephony. If you already have IP phones connected to your company&rsquo;s network, the switch will automatically configure the phones with the correct VLAN and quality-of-service (QoS) parameters to prioritize voice traffic.The Cisco SG 300-10 Switch is easy to configure and manage; in addition, energy-saving technology reduces power consumption.It just works so you can focus on your businessThe SG 300-10 is a switch that&rsquo;s been designed to conserve energy, which will save you money. The switch uses low-power chipsets and other &ldquo;green&rdquo; features to help protect the environment and optimize power consumption without compromising performance. And a fanless design further reduces energy costs while enabling quieter operation. Cisco designed the SG 300-10 Switch to be easy to configure and to manage. Intuitive browser-based tools and mass deployment capabilities speed setup and reduce the amount of time you need to spend on network management tasks, such as QoS traffic prioritization. Cisco provides a limited lifetime warranty with next-business-day advance replacement (where available), software updates, and telephone technical support free of charge for the first 12 months. Also, the SG 300-10 is backed by the Cisco Small Business Support Service, an affordable three-year subscription-based plan that provides peace of mind and additional investment protection.Features include:10 ports of Gigabit Ethernet (10/100/1000) connectivity deliver excellent performance for high-bandwidth applications2 combination mini-GBIC ports support fiber-optic or Gigabit Ethernet uplink connectivity, allowing you to easily connect switches around the workplaceIntegrated IP telephony support automatically configures connected IP phones with the correct VLAN and quality-of-service (QoS) parameters to prioritize voice trafficAdvanced security features, including access control lists (ACLs) and guest VLANs, allow users to tightly control small business networksEnergy-efficient features such as low-power chipsets and a fanless design help reduce power consumption and enables quieter operationLimited lifetime warranty provides next-business-day advance replacement (where available), software updates, and one year of free telephone technical supportWhat's in the BoxCisco SG 300-10 SwitchPower cordMounting hardwareSerial cableCD-ROM with user documentation (PDF)Quick-start guide"}