{"asin": "B004UG3BQK", "description": "ViewSonic's PJD5123 is a high-performance SVGA 800x600 DLP projector with 2,700 ANSI lumens and 3000:1 contrast.  This projector supports PC and HD video signals and projects clear, bright images in most lighting conditions.  With a new slim design at only 3.2 inches height, making it ideal for moving from room to room on the campus or throughout the office.  Texas Instruments&acute; BrilliantColor&trade; technology delivers brilliant, true-color and high contrast images for viewing presentations, charts, or video.  The PJD5123 offers a variety of hardware and software features including multiple PC and video input options, 1.1x optical zoom, auto vertical keystone correction, 120Hz/3D-Ready, support HD video signals, and integrated speaker.  Filter-less design and energy-saving ECO-mode provide for easy maintenance and longer product life.  For increased security, a PIN lock feature allows you to set a password to prevent unauthorized use. The PJD5123 is perfect for tabletop, ceiling mounting or taking on the road.Key Features:Supports up to 120Hz frame rates and 3D ready DLP&reg; technology2,700 ANSI lumens for clear and bright imagesBrilliantColor&trade; technology provides exceptional display qualityAuto vertical keystone correction, support HD video signals and Integrated speakerNew slim design 3.2 inches height and lightweight 5.7 lbs, ideal for portabilityFilter-less design and ECO-mode for easy maintenance and longer product lifeIdeal for classrooms, conference rooms, mobile business presentations and home entertainmentOne of the best warranties in the business: 3 years on parts and labor, 1 year on lamp, and free 1st year Express Exchange serviceBright in virtually any settingUsing less watts per lumen than other comparable projectors. And with a 3000:1 dynamic contrast ratio, it&acute;s the bright choice for business, education, mobile and home presenters.Settings where the PJD5123 is the perfect solution:Business - conference rooms, meetings, brainstorming, etc.Classrooms - lectures, videos, project presentations and even auditorium presentationsMobile presentations - ideal for the travelling salesmanHome entertainment - watching the big game or movie, sharing vacations or family gatherings and hardcore gamingBusinessEducationHomeBrilliantColor&trade; technologyColor is one of the most important characteristics of a good projection system, and the latest BrilliantColor technology delivers stunning all-digital clarity with lifelike color, sharp graphics and outstanding video. The sophisticated 6-segment color wheel enhances the yellow color performance that is key to accurate and vivid color reproduction. With multi-color processing, colors are richer and more vibrant with exquisite and precise detail.DLP TechnologyAdvanced DLP (Digital Light Processing) technology allows you to experience crystal clear, razor-sharp and lifelike images with the same DLP technology that Hollywood relies on. For fast action, the response time is also on the order of 1,000 times faster than similiar LCD based projectors. And with no air filters to clean or change, the latest generation of DLP based projectors from ViewSonic offer amongst the lowest TCO (total cost of ownership) in the industry. Check out the TCO calculators athttp://www.viewsonic.com/viewschool/dlp-tco-calculator/DLP&reg; 3D technologyWith support for TI&acute;s DLP Link technology, you&acute;ll have amazing 3D capabilities at your disposal. The projector&acute;s embedded emitter function means all that&acute;s required to unlock 3D capabilities is a pair of DLP Link compatible glasses, such as the optional ViewSonic PGD-150 active shutter glass kit.Eco-mode saves money, power and helps the planetWith only a slight 20% decrease in brightness, the ECO-mode function can extend the life of your lamp by almost 50% and up to 6,000 hours in some cases. Other benefits of ECO-mode operation include reduced power consumption, as well as less heat and audible noise output. It&acute;s good for the environment and great for your budget. The ECO-mode function will definitely help lower your total cost of ownership (TCO).New Slim DesignAt only 3.2 inches height and lightweight 5.7 pounds, it&acute;s light and compact, making it ideal for mobility and portability.We&acute;ll help you calculate the distanceChoose a projector that fits your space, as well as your lifestyle and needs. Simply determine your desired image size and then cross reference on this chart to locate the required projection distance. An interactive distance calculator specific to each and every ViewSonic projector is also availablehereto help calculate desired image size and throw distance based on your screen size.Piece of mind with one of the best warranties in the businessBacked by our 20+ year reputation for quality and reliability, ViewSonic offers one of the industry&acute;s best overall projector warranty with 3-year limited parts, 1-year lamp and first year free Express Exchange&reg; service. Don&acute;t be fooled by seemingly longer warranties out there in the market that exclude the more vulnerable systems and moving parts.", "title": "ViewSonic PJD5123 SVGA DLP Projector  120Hz/3D Ready, 2700 Lumens, 3000:1 DCR", "price": 299.99, "imUrl": "http://ecx.images-amazon.com/images/I/41-cng7W7%2BL._SX300_.jpg", "related": {"also_bought": ["B0028YCR9I", "B000V1JUIG", "B000V1LX40", "B006FIBVKE", "B00CVTLN8Q", "B000HRYV38", "B000TUDOQ8", "B000X2MBPC", "B004XGXGJE", "B000QSONTK", "B00028DAKW", "B005EV1R8Y", "B000EUELBA", "B0002855KK", "B000V1R966", "B0033SC2SE", "B000B7NCRU", "B00A9S3OMY", "B000V1O1J4", "B00006ID2Y", "B0018MRK6Q", "B001IF252M", "B0002861NK", "B002GHBUTK", "B002UBPBTC", "B002WUVAVE", "B0018M7ZI4", "B004O9R1ZK", "B004OBYYWG", "B003NE67GG", "B001A8664K", "B004A7Z1OO", "B000V0DY8Y", "B0035IV81E", "B00CMVWRME", "B000RHJUJ8", "B0018MI5F6", "B006CT46DU", "B000IDC0K2", "B007KA07YM", "B0007QKN22", "B003CGOTJW", "B0002855K0", "B00029338A", "B001R0EVMA", "B002HU39BS", "B000FI2EAG", "B000HQJRA6", "B007X68CEK", "B005H3I38G", "B004W6JOYG", "B00A9S3OOC", "B006FKTR3U", "B007SM7O2U", "B008FC8DFY", "B005HRLPPA", "B000R9AAJA", "B000V1PAWQ", "B000Y7T5UU", "B009K916ZK", "B004KSQANO", "B000FPGP4U", "B002HK61VS", "B000IJY8DS", "B0002MQGKO", "B005J7YA3W", "B006Y5UV4A", "B004YRUDKM", "B003VNKNEQ", "B00450DVDY", "B001879OEC", "B003Y3BJ7S", "B009PK2MNY", "B0002AHT0M", "B007P4VOWC", "B003O55U8K", "B005PYD2RE", "B0027VT6V4", "B000IF4788", "B0001EMA80", "B003NREDC8"], "buy_after_viewing": ["B00A9S3OOC", "B00A9S3OMY", "B00CVTLN8Q", "B000TUDOQ8"]}, "categories": [["Electronics", "Computers & Accessories", "Video Projectors"]]}