{"asin": "B0000AAAPF", "description": "The iPod has helped revolutionize the way people store and listen to music, but it's not particularly car-friendly. Unless your car stereo includes a cassette deck (increasingly rare) or an auxiliary input (more common among newer stereos) combined with the appropriate adapter, you simply haven't had the means to play your extensive iPod library through your car speakers. Several companies, however, have sought to fill this void by releasing a product called an FM transmitter, which broadcasts iPod tunes through FM airwaves. Griffin Technology is among the category leaders with its iTrip, a discreet little device that fits unobtrusively on top of the iPod model. The iTrip isn't confined to car stereos--it plays on almost any FM radio--but because most home stereos and boomboxes have auxiliary inputs, it's most popular as a car accessory.The iTrip is designed to broadcast to any empty FM frequency on the dial of any radio, at home or in your car.Design and SetupThe iPod is loaded with impressive features, but it's also an Apple product, which means that looks matter. A lot. And Griffin clearly recognizes this, because the company has released several iTrips designed to match specific iPod models, and each is among the sleekest FM transmitters on the market. Plus, the device measures less than an inch tall and exactly as wide as the iPod it sits on, so it takes up almost no extra space--an important feature to people who value the iPod's portability.&nbsp;The iTrip is designed to broadcast to any empty FM frequency on your dial--depending on where you receive the best reception--but it's only configured to play at 87.9 MHz right out of the box. That means a little setup is required using the included CD-ROM and iTunes. Fortunately, the installation is painless and takes only a few minutes. The installer adds a playlist to your iPod (through iTunes) called iTrip Stations, which consists of a series of short audio files that correspond with all available FM frequencies.Features and PerformanceThe iTrip performs best when tuned to an FM frequency that plays nothing but static, with no audible words or music. Finding a good frequency is fairly easy, but it requires your full attention, so it's best to do so while parked. We tested the iTrip on three separate frequencies in a mid-size market with varying success. The sound was generally good in two of the frequencies, less so in the third. This remained true whether the iPod sat next to the radio, in the backseat, or under a stack of newspapers. While driving through bad FM reception areas, the iTrip received a bit of static, but it usually passed in a couple of seconds.The iTrip is designed more for convenience than elite audio performance, so listeners shouldn't expect CD-quality sound. When tuned to a clear frequency, it's about on par with the average FM station. If the volume is turned high, users might notice a slight hiss through the speakers, but engine hum and road noise will generally cover that up. However, listeners who value top-quality sound--especially people with expensive speaker systems that pick up every minor flaw--might instead want to add an auxiliary input to their car stereos to get the most from their iPods.The main drawbacks to the iTrip are fairly minor, but will bother some users. First, the iTrip Stations playlist is stored as part of your overall music library, meaning the individual audio files can emerge during shuffle play--and the sound isn't pleasant. Listeners can remedy this by creating a new playlist with their entire music libraries minus the iTrip Stations files. Second, the iTrip draws its power from the iPod battery. This is both a plus and a minus, because it means you don't need to keep buying new AAA batteries every week, but you also won't receive as much power from each iPod charge. If this bothers you, consider purchasing an auto charger, which powers your iPod or iPod mini through the cigarette lighter adapter while you drive. Third, the iTrip isn't great for long road trips through crowded regions, because the available FM frequencies might change every 40 or so miles (or less), making it necessary to frequently re-tune the iTrip. On the flip side, it's great for long drives through the country.Ultimately, the iTrip is a good value. The convenience will please iPod fans who have been clamoring for a way to play their music in the car. Audiophiles might want to look elsewhere, but most other listeners should be satisfied.--Rivers JanssenProsMakes iPod music library accessible to anyone with an FM radioSimple, easy-to-follow controls using iPod click wheelSound quality is solid, though not terrificConsSometimes requires frequent re-tuning to find the best FM frequencyHard to find good frequency in crowded urban areasiTrip audio files emit unpleasant noise when chosen for shuffle play, though problem is fixableWhat's in the BoxThe iTrip white FM transmitter, an installation CD-ROM, and a user's manual.", "title": "Griffin iTrip FM Transmitter for iPod mini; iPod classic 3G, 4G (White)", "price": 24.99, "imUrl": "http://ecx.images-amazon.com/images/I/01XHXM562JL.jpg", "related": {"also_viewed": ["B002RL8UO8", "B001DQL66M", "B003SX0O2A", "B003TFDUKK", "B000BWACX2", "B003II9MPA", "B001HN6JK4", "B000WKPHHO", "B004BO2H20", "B001LYOGRM", "B00GMYB3O0", "B00AFYDAP8", "B001DQT40M", "B00AFYFPAG", "B00448A5P4", "B0001F22PA", "B000OQB76G", "B000BMXJR8", "B00EUVB2C0", "B000WKPHI8", "B00312W9YO", "B0035AN31A", "B00DEWBM1W", "B002S4Z2NQ", "B002AQVMMW", "B00K9QLJA0", "B002S9E3LI", "B0098Y90PK", "B00ENY0ZLS", "B0002WTK48", "B00GLPG03Y", "B00KESBI2W", "B001IWOBLI", "B0040GY35S", "B000E43GOO", "B00CGVG8B6", "B001QIXDNG", "B001F32OKK", "B000R5NJCE", "B0002F4EO6", "B0087NBBD2", "B000BREQN4", "B00E530TQ8", "B00IHQLL48", "B003ZZ26OK", "B00HIATW04", "B003EHT6YC", "B003PPGOC0", "B004JRY402", "B00120GMD6", "B00IFUOB6G", "B00GRQQ0JQ", "B003JOCR14", "B00G530060", "B000CSP8IO", "B000H72MMU", "B000OTF6G0", "B002DW3YBA"], "bought_together": ["B000JLG5ZY", "B0015RB39O"], "buy_after_viewing": ["B002RL8UO8", "B001DQL66M", "B00DEWBM1W", "B003SX0O2A"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "FM Transmitters"]]}