{"asin": "B000DZH4D8", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "From the Manufacturer  You want your memories to last forever--that's why you've taken the time to shoot them. And you want to shoot in widescreen format to get everything you can out of your new widescreen TV or home theater system.So, why is the way you record widescreen images so important? Because you want an imagemadefor widescreen, not adapted for widescreen. Because every HD television is widescreen--widescreen is the future.The story of how we do it may be a bit technical, but the result is clear to see. Canon camcorders use the entire width of the image sensor to capture video in true 16:9 format. What difference does this make? It's simple. With more pixels captured, you get better image quality. Other camcorders force the wider picture into a smaller space on the sensor--giving you a less true image, with fewer pixels and lower quality. With a Canon camcorder, your videos of your travels will let you relive great memories.In addition, the viewfinder on your Elura 100 will display the image in a letterbox view. From side to side and top to bottom, what you see is what you get. Or, you can view your widescreen shot in the Elura 100's large, 2.7-inch LCD screen. Either way, there isn't the guessing or extra work in looking at an image that's distorted like a funhouse mirror.To make it even easier, a widescreen button lets you switch from standard 4:3 to 16:9 widescreen HR at the touch of your finger. You can also use the widescreen feature with the camcorder's advanced image stabilization. All of the Eluras let you shoot as wide as your widescreen TV. Why shouldn't your camcorder shoot as wide as your widescreen TV? It should--and our competitors can't match the widescreen you get from your Canon Elura 100.Remember--widescreen is the future. And Canon's widescreen HR is true widescreen that's picture perfect.Because of genuine Canon optics, the name Canon is synonymous with unsurpassed optical performance. Brilliant optical quality is part of every Canon broadcast TV camera, 35mm film camera, and camcorder--and the Elura 100 is no exception.The Elura 100's lens is precisely matched to the camcorder's CCD and features a unique spectral coating that reduces flare and ghosting. The lens is a powerful 20x optical zoom. Combined with the camcorder's powerful 800x digital zoom, the Elura 100 gives you an impressive range of focal lengths (3.0-60mm). You always have the perfect lens, whether you're trying to capture a wide shot of the lake, a group shot at your daughter's wedding, or a telephoto shot at your child's recital.Advanced Image Stabilization correctscamera shake instantly.Image StabilizationCanon's Advanced Image Stabilization is another reason you get unsurpassed optical performance from your Elura 100. Shoot fast action like sporting events, or your child's birthday party, or the view from your boat. Image stabilization corrects camera shake instantly and makes all your video memories a joy to watch.At the heart of the Elura 100 is a powerful 1.33-megapixel CCD that delivers sharp and vibrant images. The performance of the CCD is combined with Canon's exclusive DIGIC DV signal processing circuit to give you both vivid video and brilliant digital photography. Because video and still images have different color requirements, the Elura 100's DIGIC DV circuit processes the two signals differently. The result is video maximized for viewing on monitors or with video projection. DIGIC DV is just part of Canon's DoubleShot technology that gives you the best of both video and digital photography.Level Shot ControlThe Elura 100 Level Shot feature gives you horizontal and center markers in your viewfinder to help keep your camcorder level and your subject centered. For perfect shots, simply turn on Level Shot and make the horizon parallel to the horizontal marker in the viewfinder. For perfectly composed shots, use the center marker to place your subject in the center of the frame.Smooth Zoom ControlNot only do you get a wide zoom range with the Elura 100, you can also get Smooth Zoom Control. Simply select from 3 pre-set zoom speeds and Smooth Zoom does the zooming for you--giving you steady, professional-looking zoom shots every time.Mega Video LightTwin LEDs take over when the light gets low, so you can keep on shooting.Low-Light PerformanceYou don't have to put your Elura 100 away when daylight fades or when the only illumination comes from birthday candles. The camcorder's Auto Slow Shutter function lets you shoot with slow shutter speeds for enhanced low light performance.Stunning Digital PhotographyWith Canon's DoubleShot technology, you get the best of both video and digital photography. That means the Elura 100 is a MiniDV camcorder that's also a great digital camera. With it's 1.33-megapixel CCD, you get brilliant digital photographs you'll want to share with friends and family. Plus, Canon's exclusive DIGIC DV signal processing circuit processes still images differently from video images, ensuring that they're maximized for viewing on computer monitors and as prints.Plus, a variety of photo features make the Elura 100 a great digital camera:9-Point Ai-AFA feature found on more expensive camcorders, Auto Intelligent Autofocus ensures sharp images and gives creative flexibility. Even when your subject isn't in the center of the frame, the Elura 100's 9-point Ai-AF will bring it into sharp focus.Motor Drive ModePerfect for capturing sports and other fast action, Motor Drive Mode lets you shoot a series of still images.Progressive PhotoCanon's Progressive Photo feature gives you sharper detail in your digital photography.Autoexposure BracketingIt can be difficult to get the right exposure under tricky light conditions--like when your subject is standing against an especially dark or light background. Auto Exposure Bracketing increases your chances of getting your shot by automatically making three different exposures of the same shot--one at normal exposure, one underexposed and one overexposed.Simultaneous Photo RecordingCapture great still images while you shoot video.Special Scene ModesFor great results in a variety of shooting conditions, your Elura 100 features scene modes. Depending on the lighting and subject, select from: EASY, P, Portrait, Sports, Night, Snow, Beach, Sunset, Spotlight, or Fireworks. The Elura 100 chooses the settings that will give you the best results.Image EffectsThree different image settings are available depending on your subject: Vivid, Neutral, and Skin Detail.Perfect ExposuresA handy omni-selector joystick includes useful features like exposure lock.Exposure LockWith a push of the Elura 100's convenient omni-selector joystick, you can lock your exposure settings, then recompose your shot. For example, you can lock your exposure while zoomed in on your subject. Then, even if you zoom out and include a very bright or dark background, your Elura 100 will still be giving your subject the right exposure. Also, by shifting the omni-selector left or right, you can adjust your exposure by up to +/-11 stops (+/-2.75 EV).Metering ModesThree different metering modes give you the right exposure under different lighting conditions. Evaluative metering sets the exposure based on the entire frame. Center-weighted average sets the exposure according to the lighting in the center portion of the frame. And Spot sets the exposure according to the lighting within a specific area in the frame--perfect for subjects in front of a very dark or light background.Firewire/IEEE 1394 DV TerminalSharing your video is easy because the Elura 100 comes equipped with an IEEE 1394 DV terminal. Known as Firewire or iLink, the connection is a high-speed, digital interface that ensures virtually no loss of video or audio quality when transferring videos to a computer. Simply use a DV cable to connect your Elura 100 to your computer's DV terminal and your favorite recorded moments will be transferred with all their original quality.Motion JPEG ModeWith the Elura 100's motion JPEG mode, you can record movie clips directly to the camcorder's memory card, transfer it to your computer, and e-mail it or stream it over the web.", "title": "Canon Elura 100 MiniDV Camcorder", "price": 5.09, "salesRank": {"Camera &amp; Photo": 4247}, "imUrl": "http://ecx.images-amazon.com/images/I/41F55CCG7XL._SX300_.jpg", "related": {"also_viewed": ["B00CHFW32E", "B00123Q8VY", "B0024UJLRW", "B0084IKM0I", "B0032HOH0W", "B000M4F9GO", "B000E0DU4O", "B000DZH4CO", "B000M4MT58", "B0001BVHL4", "B0007D9B9G", "B00006JQQ5", "B000M3IND6", "B003M4UC2C", "B00114LG8E", "B0007M3PK8", "B001144JRO", "B005GR3040", "B000E0K7EK", "B001OI2ZKA", "B000093UDP", "B00012F6A6", "B000BP3OI4", "B006IUV73K", "B00114PN1U", "B00BB4UKOK", "B0007M3PJO", "B0001BW0TC", "B0014GX98Y", "B000H7MHFC", "B005T6DYZ8", "B0001GCAWE", "B000M4JDQQ", "B002EVP85K"], "buy_after_viewing": ["B001TH7GVY", "B00012F6A6", "B003L4P872", "B000M4MT58"]}}