{"asin": "B001OMH1O6", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "The JVC Everio GZ-HD300 captures video to a 60 GB hard disk drive -- it also features a 1/4.1-inch, 3.05-megapixel CMOS image sensor and full HD recording--full 1920 x 1080 resolution--to maintain native 1920 x 1080 resolution through playback, enabling output of a 1080p 60fps progressive signal to make the most of high-end HD displays. Using the same GENESSA processing technology used in JVC HD televisions, conversion to 1920 x 1080 at 60fps provides seamless natural video, free of motion judder during fast action activities, jaggy lines on angles and moir&eacute; patterns on fine details when zooming. 1920 x 1080 HD discs played back via the camera from the optional JVC CU-VD50 Share Station are also converted to 60fps progressive.For sharing, the Everio HD300 makes it easy to watch videos on an iPod or iPhone by exporting videos to the user&rsquo;s iTunes library with the new One Touch Export function provided by bundled software for Windows. This joins the One Touch Upload function for uploading to YouTube, for 2009 a feature available on all Everio camcorders, and One Touch DVD Creation function for easy archiving and sharing by disc, a long-time Everio feature.The Everio GZ-HM200 is also equipped with HDMI V.1.3 with x.v.Color. Among the colors that the human eye can see, x.v.Color technology, based on the xvYCC color standard, can display 100 percent compared to about 55 percent with sRGB. So when connected to an x.v.Color compatible HDTV, the pristine world of high definition can be enjoyed to its fullest.A new Konica Minolta HD lens, developed especially for Everio, provides a high-performance \"eye\" for the capture of Full HD resolution images, and also delivers a high optical zoom ratio of 20x which is among the highest for HD camcorders.JVC&rsquo;s new HD Gigabrid Premium video engine not only applies advanced image processing to optimize image quality, it also contributes to a 30 percent reduction in power consumption compared to previous Everio models, and also enables approximately 2.5-times faster creation of DVD discs for standard definition or AVCHD DVDs from HD Everio.All HD Everios now feature the new AVCHD UXP mode with an unprecedented bit rate of up to 24Mbps to deliver more detailed, sharper images with less noise. UXP mode is ideal for storing to Blu-ray or an external hard disk drive. All the recording modes for HD Everio models--UXP, XP, SP, and EP--use Full HD 1920 x 1080 resolution.Further contributing to high quality video on all HD Everio models is Face Detection technology, which automatically detects faces within the image being recorded to accurately adjust focus and exposure for sharp, beautiful images.Everio FeaturesAll 2009 Everios--HD, G series and S series--make sharing and watching videos easier than ever. New for this year is the One Touch Export function that allows Everio videos to be imported into iTunes and loaded into an iPod or iPhone. All 2009 Everios also offer One Touch DVD burning and the One Touch Upload function that JVC introduced to users in 2008 as a new and convenient way to upload videos to YouTube.To use any of the three functions, simply connect Everio to a PC using the supplied USB cable. Then, the user chooses one of three buttons on the Everio: UPLOAD, EXPORT, or DIRECT DVD (DIRECT DISC for HD Everio models). Pressing the button will launch the appropriate Windows PC application that comes bundled with Everio, and the user simply follows the simple on-screen prompts. With just a few mouse clicks the process of uploading to YouTube, exporting to iTunes, burning to disc or transferring to an external hard disk drive will be completed. For uploading to YouTube, the user can perform an in-camera edit of any length video to fit the 10-minute YouTube limit.For disc based archiving, there is an alternative to using a PC. JVC offers the CU-VD50 Direct DVD Burner/Player as an option, which allows burning of Everio videos to a DVD disc without having to use a PC. When used with HD Everio, this solution can create AVCHD DVDs that are playable on many Blu-ray players.The new Everio MediaBrowser software supplied with all Everio models is a Windows application providing an easy-to-search calendar-type graphical interface for indexing and finding video files. Thumbnail images of recorded videos and stills are superimposed on the calendar so it&rsquo;s easy to see when any scene was recorded. The Everio MediaBrowser also allows easy playback, simple cut editing, and \"Decomotion\" to spruce up recorded footage with animated graphics for upload to YouTube. It also supports Export to iTunes, Upload to YouTube, burning to disc or transferring to HDD. The Everio MediaBrowser software supplied with HD Everio models supports burning to Blu-ray disc in addition to DVD.Another new feature found on all Everio camcorders is Digest Playback, which offers an easy and entertaining way to check the content residing on Everio&rsquo;s HDD or SD/SDHC card. The function automatically selects highlight scenes from among the recorded content using JVC&rsquo;s proprietary algorithm and plays back what looks like a \"coming attractions\" trailer for a movie. Sixty minutes of footage is condensed into five minutes of highlight scenes.Other Everio features have been enhanced for 2009. Laser Touch Operation has been updated to allow control of zooming and recording using either the Laser Touch scroll bar or buttons next to the LCD screen, as well as by the standard zoom lever and REC button. And as before, Laser Touch makes it easy to browse through thumbnail images of recorded scenes and access menu selection. Power-linked operation, long offered by JVC, goes a step further this year. Simply opening the LCD monitor automatically opens the built-in lens cover and powers up the camcorder. Closing the LCD also closes the lens cover and shuts down the power. With Quick Restart, recording can start in about one second after the LCD is re-opened.In addition to performance and convenience, the 2009 Everio line offers plenty of style and shooting comfort. A new design features elegant curves, a silver-framed LCD and a comfortable angled grip with a new dual use strap. The strap can be used in the usual camcorder fashion, supporting the user&rsquo;s hand when shooting, or it can be extended and used as a wrist strap like the type on most digital still cameras.", "title": "JVC Everio GZ-HD300 60GB High-Def Camcorder (Black)", "price": 3.75, "salesRank": {"Camera &amp; Photo": 14366}, "imUrl": "http://ecx.images-amazon.com/images/I/41F0oEf3w5L._SX300_.jpg", "related": {"also_viewed": ["B00AWZFIUU", "B00AW54Z4K", "B006YVMA5C", "B00AW54Z7C", "B00AR95FPO", "B00127Y984", "B00CQ9T00E", "B006NT43IW", "B00HLDFSQK", "B00HLDFTRS", "B00HPZKQJS", "B00AWZFJ22", "B00AR95H7U", "B005MMII96", "B00HNJWWL6", "B00AR95ENW", "B00HNJWVKI", "B0011ZK72Y", "B00HNJWWK2", "B00AR95FRM", "B00AR95FP4", "B00AR95H0W", "B00AW54YWS", "B006UMMP2I", "B006K5507M", "B00HPZKQWA", "B004LB5AJK", "B00BB4UKOK", "B00AR95H4S", "B0032FPY06", "B006K551HQ", "B0072B5E2Y", "B006UMMP8C", "B0031RGKZI", "B00IFABA3S", "B003DZ1224", "B007261BNU", "B00C3R14J4", "B0072B5E4M", "B00AWZFHG0", "B00AR95HV6"], "buy_after_viewing": ["B002QAPBWO", "B003VNKNF0", "B003A5TX82", "B004H6PANK"]}}