{"asin": "B001COV1CY", "description": "MAGis a massively multiplayer online first-person shooter that is unique in a variety of ways. A PS3 exclusive,MAGallows up to 256 players aligned with different private military corporations (PMCs) to battle each other at the same time across a global battlefield. Within this persistent game world players engage in campaign and mission play that elevates their character from the ranks of a lowly grunt, all the way up through the intricate command structure of the in-game officer corp. Along the way players players experience in-depth character customization, a robust leveling system and large-scale MMO shooter gameplay that makes MAG a game not to be missed by fans of the shooter genre..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }256-player MMO shooter gameplay.View larger.A robust and flexible leveling system.View larger.A unique command system.View larger.A persistent battlefield game worldView larger.Extensive character customization.View larger.StoryIn the near future, governments are supposedly at peace, but a shadow war, fought by private military corporations, is raging. You, along with a myriad of comrades and enemies alike &#151; up to 256 in all &#151; are dropped into this unprecedented war. To start off you must prove yourself as a member of your 8-man squad, fighting for one of the PMCs. With enough experience you may even become an elite fighter or earn the right to lead a squad, platoon or ultimately an entire army of players. Can you, will you follow orders? Either way your destiny and those of 255 other fighters awaits on the battlefield ofMAG.GameplayInMAGplayers take on the role of a member of a private military corporation (PMC), in a fictional Earth future. Like most MMO games, as well as some modern shooters, the ultimate goal of action is the leveling up of your character, in this case through success in combat against other factions made up of individual online players. At the initial level players choose the PMC they will be aligned with, the physical characteristics of their character, initial available weaponry, etc. and hit the battlefield with other squad members within a persistent online environment. Along the way you will utilize a diverse skill tree to develop your character's abilities and skills at tactics and weapons using experience points that are accumulated in campaign and mission play in the name of your faction. These points are given out in various increments for all manner of action, whether that be objective completion, or individual actions in combat. Once characters reach a certain level they are eligible to take on command duties. These duties range from leading an eight-man squad, all the way to overall command of more than 100 online players. Orders are communicated and strategy developed via voice chat and other functionality. Success in command positions allows for access to special \"leadership bonuses\" that not only can improve your abilities, but also in many cases, that of the individuals and units under your command.So, how does one give orders to human individuals online? Just as you would to AI (artificial intelligence) characters. The beauty ofMAGis that players are free to ignore orders issued by superiors at any time. Experience point totals, the nuts and bolts of character leveling, are higher for successes achieved through orders that follow the chain of command though. War, especially that featuring multiple factions, can be fought in many ways, and in MMO gameplay world ofMAGit's up to you to decided the path you'll follow.Private Military Corporations (PMCs)Bound by the terms of the terms of the Millennium Accord, which prevents defense forces from crossing borders, nations with theMAGgame world turn to the services of Private Military Corporations (PMCs) to secure interests abroad. The leading PMCs compete for contracts across the globe. Each of these maintains its own battlefield philosophy and approach to military operations. It's up to each player to choose his/her loyalty. Some of the factions players can expect to see include:RavenBased in Vienna, Austria, Raven Industries, GmbH provides specialized military services using precise, cutting-edge equipment and advanced tactical coordination.S.V.E.R. (Seryi Volk Executive Response)S.V.E.R is based in Grozny, in the Chechen Republic. Unconventional in their look and a fierce fighting style, S.V.E.R operative consist of former soldiers and private citizen, some with rumored criminal backgrounds.ValorFounded by former US Army officers, Valor Company, Inc. offers an experienced team of veterans drawn from US, British and Mexican forces. The company is headquartered in the Alaskan wilderness.Key FeaturesMassive Action&ndash; For the first time ever, fight up to 256 real players online.Command Structure&ndash; Think leadership is in your blood? Use your advanced skills and experience points to take charge of your PMC's forces, becoming a squad, platoon or even army commander.Unique Leveling System- A robust and flexible leveling system awarding experience points for both mission-critical and non mission-critical actions on the battlefield.Persistent World&ndash; Missions and campaigns appear around the world as the missions ebb and flow.Choose Your Faction&ndash; Three distinct PMCs to choose from, each with their own history, personality and style.Customization&ndash; Customize your character as well as weaponry and pursue a wide variety of combat specialties from elite fighter to a general of an army.", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/61%2BmUSxP05L._SY300_.jpg", "related": {"also_bought": ["B004L5SJ58", "B002I0K6DG", "B002DC8GKO", "B001C4DKG4", "B002I0K6X6", "B002I0K622", "B003UF24SI", "B0053B7ICO", "B002I0J8KS", "B005185SDA", "B000FPOJOS", "B002I0J51U", "B0050SXUT0", "B000M4KJ32", "B000K9OR4Q", "B002I0K74Y", "B000SQ5LQE", "B00AJGVIBA", "B002I0K7DK", "B000WJFZEA", "B000QAVV6G", "B00109KMQ2", "B000JLIYLC", "B000WS97QI", "B003S55EWI", "B0030CYE8O", "B004EQCCI4", "B0017XFP8G", "B004UPP6NW", "B004UDB9SA", "B001D7T2X0", "B004P7EUPA", "B002BRZ744", "B003O680ZY", "B000HGOHWO", "B003IMGC9U", "B000UW21A0", "B000KLNLUK", "B003R7H5TC", "B000GA73O0", "B003O6E3QY", "B002BXJ9VA", "B006JKARN0", "B003O6HAS2", "B003O6ECOM", "B004DI5H26", "B003URSUSE", "B000ZK7ZOE", "B0045Y19IO", "B004JMSBGU", "B0050SX1JO", "B00320JAWY", "B003O6E2TM", "B003C1I06U"], "bought_together": ["B002I0K6DG", "B002I0K6X6"], "buy_after_viewing": ["B002I0K6DG", "B001C4DKG4", "B004UCX0VU", "B002I0K6X6"]}, "salesRank": {"Video Games": 8102}, "categories": [["Video Games", "PlayStation 3", "Games"]]}