{"asin": "B001UI2FPE", "related": {"also_bought": ["B001FWYGJS", "B001UI4RTG", "B00A3YN0Z0", "B0085WN7YQ", "B0041LYY6K", "B002HWRJY4", "B00723PZ2G", "B005S0BYQ6", "B006TZM6XO", "B008HO9DIG", "B006QB1RPY", "B00895BUPC", "B003U29AWO", "B0049YQVHE", "B00AAU54TW", "B0040IUI46", "B008I646WG", "B00J5DS8NE", "B008HO9DK4", "B000JV9LUK", "B008I647AM", "B0088CJT4U", "B0034CSUZ8", "B004T9RR4A", "B004XC6GJ0", "B0087NZ31S", "B00DB9WCR6", "B007IL7AKM", "B00BGGDVOO"], "bought_together": ["B001FWYGJS"], "buy_after_viewing": ["B004XC6GJ0", "B00AJHDZSI", "B0040IUI46", "B00IF0JAYE"]}, "title": "Motorola SB6120 SURFboard DOCSIS 3.0 eXtreme Broadband Cable Modem", "price": 119.96, "salesRank": {"Electronics": 949}, "imUrl": "http://ecx.images-amazon.com/images/I/41WCMP399qL._SX300_.jpg", "brand": "Motorola", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Modems"]], "description": "Ultra-fast Internet at your fingertips &ndash; NEW lightning fast technology lets you surf up to 4x faster than traditional cable modems.The Motorola SURFboard SB6120 eXtreme Cable Modem unleashes the next wave of broadband technology at exceptional speed. The SB6120 is up to 4 times faster than DOCSIS&reg; 2.0 broadband cable modems making it capable of reaching data rates up to 150 Mbps. That makes gaming, shopping, downloading, working, high-quality voice and video conferencing, and peer-to-peer networking applications &mdash; far more realistic, faster, and efficient than ever before. The SB6120 delivers your complete personal media experience, at lightning-fast broadband speed. So what are you waiting for?Motorola SURFboard&reg; eXtreme Cable ModemEasy to Install, Activate, and Use.Delivers a realistic gaming experience &ndash; watch as games come to lifeNext Generation DOCSIS&reg; 3.0; backwards compatible to DOCSIS 2.0Up to 4x faster than DOCSIS 2.0 cable modemsEnhance your interactive gaming experienceEasy to install and simple to useWatch as games come to life.HighlightsCapable of downloading up to 2000 times faster than 56k analog phone modemsCapable of downloading up to 4 times faster than DOCSIS 2.0 broadband cable modemsDOCSIS&reg; 3.0 CertifiedEnables a myriad of advanced multimedia services:- Access real-time online games; new heights in realism and speedFaster music downloads; one song or the entire albumShare digital photos, home movies and other multimedia effortlessly over the InternetDownload high-definition movies to your PC or watch as streaming mediaWindows&reg;, Macintosh&reg;, and UNIX&reg; compatibleSupports Advanced Encryption Services for data, as activated by your operatorFeatures a 10/100/1000Base-T Gigabit Port for incredible wired network speeds: enjoy lag-free network gaming and faster file transfersIntuitive, easy to read front panel operational status LEDsUse your current Internet BrowserNo additional software requiredSlim design saves desk space2-year limited warrantyWhat&rsquo;s in the BoxInside the Box - Motorola SB6120 SURFboard eXtreme Cable Modem,Quick start guide,Installation CD-ROM,Ethernet cable,Power adapter and cord,Install sheet,Warranty card"}