{"asin": "B002I636YG", "description": "The Altec Lansing MIX Digital Boombox Speaker System was developed for the \"DJ lifestyle\" -- for those people who know music and like to pick the play list to liven their scene. Multiple people can jack in their iPhone, iPod or other music device, and the MIX lets you toggle between sources on-the-fly. There's a 30-pin dock connector for the iPhone/iPod and two front-facing 3.5mm jacks so everyone can enjoy their tunes. The result? A party!MIX iMT800 Digital Boombox Speaker System offers:Retro \"Boombox\" styling with advanced digital performanceInputs for iPhone/iPod, and two additional aux-in jacksBrightly lit LCD display for track informationBig natural bass, enhanced with XdB technologyAC and battery poweredUniversal dock is compatible with both iPhone and iPod, and recharges while it plays your tunes.View larger.High-contrast LCD lets you know your beat, track, artist, album and station display.View larger.Booming Stereo SoundOf course, the combo of \"DJ\" and \"party\" requires loud and booming sound, and the MIX will deliver. Loaded with a 5.25-inch side-firing subwoofer and 5.25-inch tuned passive radiator, the MIX pumps out big natural bass, further enhanced with XdB technology for extra heavy punch. The sound is complete with a pair of 3-inch full-range drivers, a pair of 1-inch silk dome tweeters in a horn-loaded configuration. Beyond looking cool, the front-facing horns are engineered to disperse the high frequencies -- which are otherwise highly directional -- for great sound throughout the entire room. Quite frankly, the MIX gets loud.The MIX also features a brightly lit LCD display that tells you the track, artist and album being played from your docked iPhone or iPod. Also, FM station data is displayed when the radio is playing.Tailored EQThe MIX has various EQ options that allow the user to tailor or personalize the sound. The simplest and most familiar is an adjustment of separate bass and treble controls. For more technical tuning, a digital 7-band graphic equalizer allows custom cutting or boosting of specific frequencies. Or, there are four EQ presets where just a touch of a button will tune the EQ for specific music genres, either for rock, pop, hip-hop or simply flat.FM Radio TunerFor entertainment beyond the iPhone and iPod, the MIX has an FM radio tuner with four station pre-sets.Moves with the PartyTrue to its retro boombox roots, the MIX runs on AC or battery power. You'll always know how much battery life you have because the MIX will tell you on its display. You can expect up to 30 ours of play with eight \"D\" sized batteries. And, the MIX has nicely weight-balanced handles so you can take it on the road or around the house just as easily.Thoughtfully Designed Remote ControlBetween parties the remote control stows away in its own cubby so it can always be easily found. At party time, use the clip-on carabineer so the remote is always handy to command the jams. The remote allows you to toggle between all of your music sources, including the FM radio and lets you control the on/off power, volume minus, volume plus, track back, track forward, EQ, play/pause, and the four preset buttons. The four preset buttons are used for both the FM preset mode and the EQ preset mode.The MIX is covered by a one-year limited warranty.What's in the BoxMIX stereo speaker system, remote control, AC power adapter, two (2) 3.5mm connection cables, Apple universal well inserts, and user's guide.", "title": "Altec Lansing inMotion MIX iMT800 Portable Digital Boom Box for iPhone and iPod", "price": 300.0, "imUrl": "http://ecx.images-amazon.com/images/I/41p8p%2B3NQcL._SX300_.jpg", "related": {"also_viewed": ["B002I636XM", "B0038W0N8G", "B003VANOI6", "B004TS2AO8", "B005IVL0UA", "B004TS2AP2", "B008BLDI4U", "B003ZQYVVK", "B005IVL0SM", "B004I44F3C", "B00JYQOXAO", "B00BUC3H20", "B005IVL0U0", "B00644JO9O", "B002I529AY", "B007TG8OX8", "B004VUKX34", "B003SNITOA", "B002I3OZ7G", "B0014XKQY2", "B006MPQ3BW", "B001G5Z82I", "B00IJSAYJW", "B00CRVEAPQ", "B00CY36LAE", "B00I7QPTVO", "B005KSZ430", "B0064IIFPO", "B004WMH9RY", "B001K4YWCW", "B00DXYDBPG", "B003SX0NGC", "B004TS2AOS", "B005TUQSSE", "B004I44EXI", "B008VMT2DK", "B00EWGSEVK", "B000MSS5YS", "B00CMNZ01C", "B008RUF5DC", "B0064IIEPU", "B003SX0NG2", "B001ELK2NY", "B001FWXDZQ", "B005CPBYGM", "B00BLCLVD6", "B008GVQSRY", "B00D2EPBKA", "B003LNNOCO", "B00FQJ9MCC", "B002I3OZ6W", "B00DXYDBRO"], "bought_together": ["B001AYIRH8"], "buy_after_viewing": ["B002I636XM", "B0038W0N8G", "B003VANOI6", "B004TS2AO8"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}