{"asin": "B003C1I06U", "description": "Recognized as one of the best games of 2009,Batman: Arkham Asylumis a single player, third-person action/adventure in which the Dark Knight takes on his greatest challenge yet when he is trapped by arch rival, the Joker, within Gotham City's facility for the criminally insane, Arkham Asylum. The specialBatman Arkham Asylum: Game of the Year Editionfor PlayStation 3 ratchets the crime-fighting action up even further with an innovative new technology which allows you to play and watch in 3D with two sets of TriOviz glasses compatible with all standard and high definition TV sets. Also included are access to challenge maps that allow you to play as the Joker, and four additional standard challenge maps..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Kick it in combat gameplay.View larger.And stealth action.View larger.Match wits with and play as The Joker.View larger.Utilize utility belt gadgets.View larger.Take on dangerous bosses.View larger.StoryBatman: Arkham Asylumfeatures an original story penned exclusively for the game by famous Batman author and five-time Emmy award winner, Paul Dini, whose credits include \"Lost\" season one and \"Batman: The Animated Series.\" As the game begins Batman is personally delivering his nemesis, The Joker, to the asylum at Arkham Island, but he is uneasy. Although the Arkham asylum is well fortified, he has a nagging feeling that all is not well, which proves to be the case when seconds after turning The Joker over to the guards, the master criminal breaks free of his captors. Even more surprising than this quick turn of events is the revelation that it was never The Joker's intent to escape the vault-like facility, but instead to trap Batman there. Surrounded by an asylum full of dangerous criminals, many of which he put there and all at the beck and call of the Joker, can Batman survive and discover what is behind the Joker's intricate plot?GameplayInBatman: Arkham Asylumplayers strap on the gadget-heavy utility belt of the Caped Crusader. Gameplay here is a combination of both the knuckle crunching rush of hand to hand combat as you take on the hordes of thugs that infest Arkham Asylum, and stealth gameplay in which you must dispatch individuals from the shadows. Players can expect an engrossing single player campaign in which Batman continually moves forward to face the henchmen, bosses and traps that The Joker has set for him. With regards to opponents, in addition to The Joker who you will hear more than you see, the dark walls of Arkham also hold familiar villains from the the Batman criminal universe including Harley Quinn, Victor Zsasz and Killer Croc, that you will have to deal with, but don't expect a one-dimensional experience. As players progress from environment to environment within Arkham they will have to use varying combinations of muscle, detective skills, gadgetry and a certain degree of light RPG-like leveling of Batman's skills, arsenal and physical characteristics to survive and discover what The Joker's underlying scheme is.In addition to the story-driven single player campaignArkham Asylumalso contains various additional play modes. These include an arcade styled combat mode where players accumulate points by engaging hordes of thugs in a hand to hand slugfest across a series of maps, in which Batman's physical strength and agility play a major role. The key here is to chain together as many attacks as possible due to the fact that with each successful combo players increase the point multiplier associated with their actions. The game also features a time-based stealth mode where players must hone their ability to strike silently from the shadows. This gameplay, referred to as 'Invisible Predator' utilizes the Dark Knight's skill with gadgets like the grapple tool, batarang and explosives. These allow for vertical/horizontal mobility, the ability to quickly strike from above and at a distance and to take out enemies and create distractions, even through walls. But remember that Batman works solo and is not superhuman. Your enemies will congregate around trouble areas and work as a team against you, so you must be silent, plan your attacks wisely, strike quickly and discover the value of encouraging fear within enemies.Key FeaturesExperience the game in a whole new way with Game of the Year Edition extras including: Access to the playable Joker character (in the PS3 version only) and the Joker Challenge maps and 4 additional standard challenge maps.Utilize the unique FreeFlow combat system to chain together unlimited combos seamlessly and battle with huge groups of The Joker's henchmen in brutal melee brawls.Investigate as Batman, the world's greatest detective, by solving intricate puzzles with the help of cutting edge forensic tools including x-ray scanning, fingerprint scans, 'Amido Black' spray and a pheromone tracker.Face off against Gotham's greatest villains including The Joker, Harley Quinn, Victor Zsasz and Killer Croc.Become the Invisible Predator with Batman's fear takedowns and unique vantage point system to move without being seen and hunt enemies.Choose multiple takedown methods, including swooping from the sky and smashing through walls, and use the predator camera get a closer look at the action.Explore every inch of Arkham Asylum and roam freely on the infamous island, presented for the first time ever in its gritty and realistic entirety.Experience what it's like to be Batman using batarangs, explosive gel aerosol, the Batclaw, sonar resonator and the line launcher.Unlock more secrets by completing hidden challenges in the world and develop and customize equipment by earning experience points.Enjoy complete superhero freedom in the environment with the use of Batman's grapple to get to any place you can see, jump from any height and glide in any direction.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/615h7xVEW6L._SY300_.jpg", "related": {"also_bought": ["B007SRM5U6", "B00C7103DO", "B002I0F5M8", "B008CP6MA2", "B003O6EDSM", "B00309XHD0", "B0088I7L76", "B009GZX49Y", "B005N4HBIW", "B000X1TC0U", "B000P46NMA", "B0050SXFKE", "B008CP6Q6M", "B00BMFIXKQ", "B007TYC8MI", "B003O6E6NE", "B001SGZL2W", "B008CP6RUW", "B000ZK9QCS", "B000UW21A0", "B0045U01OG", "B009WI7VAS", "B0050SWUTQ", "B0017ZIIK6", "B004EQCCI4", "B002I0H2G0", "B00IA2NYT4", "B0022TNO7I", "B002I0J5UQ", "B0012N94WO", "B00269DX5W", "B005C2D1YI", "B0050SXX88", "B006ZTHFPS", "B002I0F5I2", "B007CM0K86", "B0050SXLQC", "B000HKP88C", "B002I0J5JW", "B0055202HE", "B005VBVQDI", "B000WMEEBM", "B000R39GPA", "B000P297EI", "B0085CA8QG", "B003O6E3C8", "B003O6CBIG", "B004FS8LYK", "B002I0J8FI", "B004NRN5EO", "B004HYK8Y8", "B008CP6RWU", "B0030F1DOO", "B00HNYWFMC", "B00319DX4M", "B00FJWNSS0", "B00DJ42BUQ", "B003O6KWZK", "B003JVCA9Q", "B0050SXKU4", "B002BRZ6UE", "B0056WJA6M", "B002I0J5FG", "B001NIP3EG", "B003O6E67A", "B005185SDA", "B003L8DXOI", "B000FQ2D5E", "B008LW4SCU", "B0050SX9VO", "B00CJ7IUI6", "B001YHX4B0", "B005YR308S", "B00B67ZTUW", "B007A7UJ4S", "B000ZK7ZOE", "B006ZPAYD2", "B004BCZLQ6", "B003O6E620", "B004RIACMW", "B0016C3260", "B000FPOJOS", "B001JKTC9A", "B002I0K5NC", "B004J6I0YO", "B00ERDGMO4", "B002I0J6DC", "B002I0J82G", "B004P7VGF2", "B002I0J4AM", "B000UU7VUC", "B002TDIEEK", "B00DFT92MU", "B002ELCUUG", "B0050SXGU8", "B004X56PWK", "B008SBZD5U", "B000ZK9QC8", "B005VKRGXI"], "bought_together": ["B007SRM5U6", "B00C7103DO"], "buy_after_viewing": ["B007SRM5U6", "B00C7103DO", "B001E8VB6O", "B007CM0K86"]}, "salesRank": {"Video Games": 905}, "categories": [["Video Games", "PlayStation 3", "Games"]]}