{"asin": "B0034XFG86", "related": {"also_bought": ["B004O4JRKW", "B003D8OS9A", "B0039BPG1A", "B0058DXA4C", "B0026T3TJM", "B003VNKNEQ", "B004SE2R8W", "B004M8SVHK", "B003VNKNF0", "B003D8OS7C", "B005FYK4ZC", "B004M8SVDE", "B008V0H284", "B008V0HFG8", "B004O4G3RC", "B0029TMXEQ", "B00B7N9B1S", "B001PKEJZQ", "B001LQPVSS", "B001RCTATW", "B005OGQZ0Y", "B004O4HTDE", "B004O4N3RA", "B0093OVKVC", "B0090SLKFM", "B0073HSH8U", "B0073HSJV0", "B006ZBYTMI", "B002LLSX6E", "B004M8SVFM", "B0034XIMG4", "B001M213E2"], "bought_together": ["B003VNKNEQ"], "buy_after_viewing": ["B003VNKNF0", "B0039BPG1A", "B0058DXA4C", "B003VNKNEQ"]}, "title": "Nikon Coolpix P100 10 MP Digital Camera with 26x Optical Vibration Reduction (VR) Zoom and 3-Inch LCD (Black)", "price": 379.0, "salesRank": {"Camera &amp; Photo": 3961}, "imUrl": "http://ecx.images-amazon.com/images/I/51KKo6a4hLL._SX300_.jpg", "brand": "Nikon", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Zoom closer, shoot faster, and do more with Nikon's Coolpix P100, with its new CMOS sensor, 10.3 effective megapixels and incredible 26x optical Zoom-Nikkor ED glass lens. The cameras huge bright 3.0-inch high-resolution HVGA (460k-dot) vari-angle LCD and Electronic Viewfinder makes it easy to compose and share your pictures. Shoot Full HD (1080i) video with stereo sound as well as high-speed 10fps shooting at full resolution.Nikon's 5-way VR Image Stabilization System takes incredible pictures, incredibly easy. Nikon's Smart Portrait System; automatically detects your subjects face, takes a picture when they smile, smooth out skin tones and warns you if they blinked.True versatility with a 26x optical zoom, 26mm wide-angle capability, and superb image qualityCoolpix P100, a new compact digital camera model that offers an impressive focal range, wide-angle coverage, and exceptional image quality. Incorporating the precision optics of a Nikkor lens and the image quality benefits of Nikon's innovative EXPEED digital image-processing concept, the Coolpix P100 is a tool that brings flexibility and fun to photography.A new 26x zoom, Nikkor ED glass lens for the Coolpix P100 covers a broad focal range of 26mm wide-angle through 678mm super-telephoto (35mm format equivalent). It even covers macro shooting ability from as close as 1 cm (0.4 in.). The compositional freedom of this versatile reach and range is further enhanced by a 3-inch vari-angle high resolution Clear Color Display that can be tilted as much as 90 degrees upward or 82 degrees downward.Nikon Coolpix P100 Feature HighlightsEXPEED digital imaging technologyNikon's smarter approach to digital imaging technology. From image capture to processing, Nikon's comprehensive EXPEED digital imaging concept encompasses the entire picture-taking operation. EXPEED is much more than a processing engine; it is a revolution in digital photography.Backside illumination CMOS sensor for advanced performanceThe Coolpix P100 enables images of exceptional quality even when shooting in night scenes or in dark indoor situations. Thanks to the new backside illumination CMOS sensor, which increases the amount of light that each pixel receives, resulting in improved sensitivity and noise reduction.The advanced performance of the new CMOS image sensor brings in-camera Backlit Scene HDR (High Dynamic Range) imaging to the Coolpix P100. HDR merges some images of the same scene to create an image with a range of tonal detail that could not be captured in a single photo. Night Landscape mode also benefits from a function that combines a series of consecutive shots taken at a fast shutter speed into a single, clearer image when taking handheld shots at night.  Further extending its potential as a versatile photographic tool, the Coolpix P100 features high-speed shooting. This capability allows users to shoot consecutive images in maximum size 3648 x 2736 (10M) at a rapid 10-fps (approx.). Other high-speed options include Sport Continuous Mode (120-fps) and Pre-shooting Cache.3-inch vari-angle 460k-dot TFT LCD featuring Nikon's Clear Color Display and electronic viewfinderIn addition to its 3-inch high-resolution vari-angle LCD featuring Clear Color Display with anti-reflection coating, the Coolpix P100 features the versatility of an electronic viewfinder that further enhances compositional freedom and accuracy under all lighting conditions. The vibrant 3.0-inch 460k-dot VGA display offers twice the clarity and detail of standard cameras for stunning image reproduction.High-Definition movie recordingEntertain audiences with movies that capture the entire impact of the scene with Full HD. The Coolpix P100 can shoot up to 2 hours*of Full HD movies (1080p) with stereo sound with its conveniently positioned Movie-record button. Both the camera's optical zoom and autofocus functions continue to be available while filming. A stereo microphone optimally mounted on top of the camera accurately captures audio. The HS movie function provides the added benefit of recording movies that can be played back in slow motion or fast motion.*Recording stops automatically after 29 minutes. This figure is based on in-house testing standards and stated for recording at 25&deg;C with a fully charged EN-EL5 battery. Actual results may vary greatly depending on factors that include differences in ambient temperature, and the amount of zoom and autofocus operations used.Five advanced image stabilizing features*help ensure sharper resultsCompensating for the effects of camera shake to realize sharper results and contribute to a more reassuring shooting experience, Image sensor shift and Electronic VR (Vibration Reduction) frees you to enjoy capturing special moments without worrying about slight hand movements. High ISO 3200 capability at any image size up to its maximum of 3648 x 2736 pixels allows faster shutter speeds when shooting in low light or capturing fast-moving subjects. Motion Detection automatically controls shutter speed and the ISO setting to compensate for subject movement as well as camera shake. And, Nikon's original BSS (Best Shot Selector) function automatically shoots a series of sequential frames and saves the one with the sharpest focus.* The camera selects and uses only the features required to optimize each image.Nikon's Smart Portrait System with Skin SofteningAs part of Nikon's Smart Portrait System, a series of advanced functions help produce consistently great portraits. The Skin Softening function ensures smooth skin tone on the face of subjects by leveraging built-in face-detection technology. Automatically detecting as many as 12 faces in the shot, Face-priority AF helps produce satisfying portraits by adjusting focus and exposure. Smile Timer helps to faithfully record precious moments by automatically releasing the shutter when the subject smiles. Blink Warning alerts the photographer when it suspects that a subject has blinked, while the Blink Proof function shoots five sequential frames, then saves the one in which the subject's eyes are wide open. In-Camera Red-Eye Fix Red-Eye Fix automatically corrects perceived red-eye effect before saving the image to memory.Four exposure modes P, S, A and MThe Mode Dial provides quick access to the rich creative possibilities offered by advanced Programmed Auto [P], Shutter-priority Auto [S], Aperture-priority Auto [A], and Manual [M] exposure modes.Innovative Active D-Lighting functionEnabled during shooting, Active D-Lighting is a unique technology that adds light and detail where necessary while leaving correctly exposed areas untouched to produce significantly improved images with a more natural-looking finish.Nikon Coolpix P100 Other Features17 scene modes for optimized shooting in various settingsScene Auto SelectorSubject TrackingOptimize image (including monochrome filter effect)Active Zoom1:1 size formatDistortion ControlQuick RetouchApprox. 43 MB of internal memoryUSB charging via Charging AC Adapter EH-68P/EH-68P (AR) or PCHDMI connectivityWhat's in the BoxEN-EL5 Rechargeable Li-ion BatteryEH-68P AC Adapter/ChargerUC-E6 USB CableEG-CP14 Audio Video CableAN-CP21 StrapCoolpix Software Suite CD-ROM"}