{"asin": "B000WS97QI", "description": "Sometimes the gratitude of a nation just isn't enoughSet in the near future, theBattlefield: Bad Companysingle-player campaign drops gamers behind enemy lines as part of a squad of four soldiers - risking it all to go AWOL on a personal quest. Featuring a dramatic storyline flavoured with attitude,Battlefield: Bad Companyleads gamers far from the traditional frontlines on a wild ride with a group of renegade soldiers who decide that sometimes the gratitude of a nation just isn&rsquo;t enough. TheBattlefield: Bad Companycinematic single-player experience captures the freedom and intensity of the Battlefield series&rsquo; multiplayer sandbox gameplay in a dynamic world where nearly everything is destructible. Players have total freedom to be daring and innovative, adapting to and tackling challenges in unexpected Battlefield-style ways. Create sniping positions by blowing out a piece of a wall or drive your tank straight through a small house. The ever-changing battlefield forces players, their teammates and enemies to react accordingly.The game also features the all new, objective based multiplayer game mode \"Gold Rush\", supporting 24 players online. Play as attackers and defenders and make full use of the tactical destruction as well as the unique vehicle experience ofBattlefield: Bad Company.Battlefield: Bad Companyis the first game built from the ground up for next-generation consoles using DICE&rsquo;s bleeding-edge Frostbite game engine, delivering unrivalled graphics, effects and gameplay.Risk it all to go AWOL.Key FeaturesWar, your way-Battlefield: Bad Companyenvironments are highly destructible, meaning that there are few safe points to hide. Gamers can shape the battlefield to match their play style &ndash; the possibilities are literally endless.Genre-defining multiplayer- Support for 24 players online in a world designed to take full advantage of the game&rsquo;s massively destructible environments.New vehicles, weapons and toys- Land, air or sea, dozens of new tools are waiting for explosive experimentation. Battlefield: Bad Company gives gamers the building blocks to get creative and usher in a new era of their own &ldquo;Battlefield moments&rdquo;.Cinematic single-player experience- A deep campaign loaded with attitude follows a wayward band of ordinary soldiers who risk it all on a quest for personal gain.Frostbite&trade; game engine- DICE&rsquo;s Frostbite game engine raises the bar for next-gen gaming, with stunning HD graphics that bring characters, vehicles, and environments to life like never before.Cinematic single-player experienceView ImageGenre-defining multiplayerView ImageB CompanyWelcome to the 222nd Army battalion, B-company. This is where the Army rakes together all the insubordinates, hellraisers and troublemakers that won&rsquo;t fit in any other unit. When the Rangers and Deltas are too expensive to waste, these guys are the first ones in.They&rsquo;re called &ldquo;Bad Company&rdquo;; a mismatched bunch of rejects selected to serve their country as cannon fodder. This isn&rsquo;t the kind of outfit a lot of soldiers would join voluntarily. Getting transferred to &ldquo;the B&rdquo; is a punishment and a way for the generals to put all their rotten eggs in one basket.No one starts out in Bad Company. But for some, this is where they end up.", "price": 65.44, "imUrl": "http://ecx.images-amazon.com/images/I/51SCrkNxBuL._SY300_.jpg", "related": {"also_bought": ["B001QXNBNI", "B003VWGBBG", "B005GM3XVA", "B002ZJNWWC", "B000M4KJ32", "B002I0J82G", "B000GA73O0", "B000N4MSAS", "B000PS4X9G", "B001AWBYNE", "B000TG72TM", "B00269QLH4", "B000HGOHWO", "B0016B28WU", "B000RHZ9G6", "B0050SWZHS", "B00109KMQ2", "B003JVCA9Q", "B00503E9FY", "B005JGC5BC", "B000FQBF1M", "B003Q55YCU", "B00163LW7K", "B000QAVV6G", "B0010EI6T2", "B004EDJOYC", "B004PFN52G", "B0037LVW9M", "B002BRZ6UE", "B004L5SJ58", "B00320JAWY", "B00G9DFMDW", "B00354NANC", "B003H0CBYS", "B000JLIXIG", "B002ELCV00", "B001ASJIRC", "B000HKMPVA", "B008OQTU6C", "B0012N3T3Y", "B005EZ5GW8", "B0050SXGU8", "B001TOMQOY", "B001RTCOWA", "B0023CBZ70", "B000M5KT5Y", "B0014UGK8G", "B001C4DKG4", "B002DC8GKO", "B0050SX2MK", "B001CRM3YQ", "B001UWGCW2", "B002I0K6DG", "B003P9FRGA", "B002BRZ744", "B000SQ5LQE", "B00EFFVZP0", "B000HWX418", "B0050SXOD2", "B00AJGVIBA", "B000P46NMA", "B003GT8IL0", "B000ZK7ZOE", "B000V1OUVI", "B001COV1CY", "B001OAKV4K", "B000O5FUKQ", "B000KLNLUK", "B00G6MW4SM", "B00HQY8LRM", "B0049HQB9Y", "B003L8DXOI", "B0056WJA6C", "B007E5Y8UC", "B001NX6GBK", "B00104KCF8", "B001ASJIS6", "B002EZH804", "B00149ILDO", "B003O6E6EI", "B0050SXEM8", "B00C3MKA30", "B000UUATJ2", "B00269DX5W", "B000R3CIV4", "B0030GBU2I", "B000MUW98O", "B008E6ZXMM", "B005185SDA", "B000X1TC0U", "B0050SXX88", "B005THAX6K", "B002NN7AKU", "B001E8VB6O", "B004HCYVO8", "B00170823O", "B000HXDKA2", "B001D7T2VC", "B00519C7JC", "B0076ZQSFI"], "bought_together": ["B003VWGBBG", "B002I0J82G"], "buy_after_viewing": ["B003VWGBBG", "B002I0J82G", "B002ZJNWWC", "B001QXNBNI"]}, "salesRank": {"Video Games": 10327}, "categories": [["Video Games", "PlayStation 3", "Games"]]}