{"asin": "B001KURYAS", "description": "Hear your opponents before you actually see them, and fire off crisp, clear orders during your next line of attack, with the Plantronics GameCom 777 Surround Sound Gaming Headset. Bringing true 5-channel Dolby Surround Sound to all your gaming and PC audio experiences, this lightweight and comfortable gaming headset keeps you on your game with a wide range of features, including powerful 40mm speakers, a hidden, noise-canceling mic boom, and in-line volume and mic-mute controls..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The Plantronics GameCom 777 offers:Dolby Headphone for true 5.1 surround sound.A built-in, concealed boom mic for communications.In-line volume adjustment and mic mute.The headset's lightweight but durable construction keeps you comfortable even after extended wear.View larger.Enjoy true 5.1 surround sound by plugging the jacks into the included Dolby USB sound card.View larger.Hear Your Enemies Before You See ThemToday's games are more cinematic than ever, and having the right audio experience is critical. Using the GameCom 777 Surround Sound Gaming Headset featuring Dolby Headphone Technology allows you to play the game they way the developers intended for it to be experienced.5.1 Dolby Headphone technology gives you the surround effects of a five speaker setup by using digital signal processing and electronically simulating five virtual speakers in a virtual room. What this means for you is that you'll experience true surround sound that feels more natural and \"out of head.\" And what this means for your opponents is that they'd better watch out because with this headset, you'll know exactly where they're lurking at every moment.To experience the full Dolby Surround Sound experience, simply plug the GameCom 777's microphone and headphone jacks into the Dolby USB sound card. But if necessary, you also have the option of listening in full stereo (non-surround) using the analog connection.Comfort for Your All-Night Gaming SessionsEven during an all-night gaming session, the GameCom 777 will stay comfortable, thanks to a lightweight frame that redistributes pressure and prevents fatigue. Specially designed earpods help redistribute pressure for maximum comfort, and the headset's open-ear design lets sound in, so you can still stay connected to your surroundings during your gameplay.But don't let the lightweight design fool you. Plantronics developed the GameCom 777 with a military-grade design and extra-strength cables, so even if you take out your gaming frustrations on it, it'll keep on performing.Concealed, Noise-Canceling MicrophoneA hidden mic boom swings down when you need to communicate with others, whether it is to coordinate a midnight raid on a town or simply to talk trash. Featuring noise-canceling technology, you'll be heard loud and clear no matter what is going on around you. As an added benefit, the hidden boom doesn't get in the way of your food or drink while you're gaming, and with it hidden you won't look like you're a call center operator.For the ultimate in convenience, the headset also has in-line volume adjustment and mic-mute controls, so you can make adjustments on the fly without having to fiddle with your computer's on-screen controls, saving you time.About Dolby Headphone TechnologyDolby Headphone technology creates an immersive gameplay environment, allowing listeners to hear every window smash, feel every explosion, and experience every wipeout as if it's really happening. Dolby Headphone technology also improves listening comfort, preventing \"listener fatigue\" that often accompanies the typical 2-channel stereo headphone experience.The Plantronics GameCom 777 Surround Sound Gaming Headset is backed by a one-year warranty.What's in the BoxHeadset with microphone, Dolby 5.1 USB adapter.The open-ear design lets outside sounds in.", "title": "Plantronics GameCom 777 Surround Sound Gaming Headset with Dolby Technology", "price": 71.2, "imUrl": "http://ecx.images-amazon.com/images/I/41193DE1mrL._SY300_.jpg", "related": {"also_viewed": ["B00B1KJK22", "B003NVMDYY", "B006ZS5ATM", "B001E45XT4", "B00GIAWTJG", "B00B1KJWE8", "B008QVQXYM", "B00F3SIIQ2", "B005OMW1FG", "B00A55U60O", "B001O5CCQK", "B002J9HCV0", "B006ZS5AQA", "B00CQ35C1Q", "B009HW15UG", "B00BFOEY4I", "B008EQ1FVU", "B00K7ZIH30", "B004BZN9DA", "B003N636VI", "B00275C2L6", "B00F3TSFKA", "B00ICOE8KE", "B0071JXCNA", "B008Y1KK6Q", "B0041OQKIC", "B000UP83SQ", "B003VANOFY", "B001J30FZM", "B00EUY5A7A", "B0087ZMAUS", "B0087ZMATE", "B005HO1ULM", "B005QUQP7G", "B002DS4HTM", "B00IAYJEP0", "B0038W0OIK", "B00HLUZXAY", "B00EXPNFUA", "B002Q8IHDQ", "B00D6JBZBK", "B00JC8397C", "B00I9GZZGG", "B006W41X2C", "B00EXPNFQO", "B009SJR2BE", "B005HGBDBM", "B00EPAVKP0", "B002ZS6Y64", "B004GGNOJI", "B006W41W7S", "B008O510Y8", "B005L38SGY", "B00DPJBT9E", "B00HLUZX7M", "B00ICNUJGW"], "buy_after_viewing": ["B00B1KJK22", "B006ZS5ATM", "B003NVMDYY", "B004SP0WAQ"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Headsets & Microphones", "PC Headsets"]]}