{"asin": "B0007TFLLC", "description": "The era of no-compromises handheld gaming has arrived. Get ready for immersive, 3D gaming on a console that is poisedto change the way we think about portable devices. With wireless internet, video and digital music playback, and incredible data storage and connectivity options, the Sony PSP--or PlayStation Portable--is a complete solution for the mobile digital lifestyle. Sony has hit the mark by combining both horsepower and groundbreaking features into a package that weighs just a hair more than half a pound.DesignThe PSP's exceptional performance comes from a 333 MHz processor that dwarfs the speed of competing handheld consoles. Add this polygon-pushing muscle to 4 MB of fast DRAM and 32 MB of embedded RAM, and you've got a device with graphics rendering capabilities close to that of the PlayStation2. And because no game is complete without audio, the PSP is generously appointed with built-in stereo speakers, as well Dolby Digital 7.1 surround sound capability. Sony has also pulled out all the stops with the PSP display. The bright, 4.3-inch LCD sports a 16:9 aspect ratio and 480 x 272 pixel resolution--plenty of real estate for heavy gaming action and widescreen-format movies. All of this is powered by a removable, and rechargeable, lithium-ion battery.Screen machine: The 4.3-inch display sports a 16:9 aspect ratio and 480 x 272 pixel resolution. Movies and games on the go have never been more gorgeous.From a controls perspective, the PSP is made for gaming. If you're familiar with a PlayStation controller, you'll be a pro at the PSP's controls in no time. Directional buttons, as well as an analog stick are provided. Meanwhile, the familiar left and right shoulder buttons, as well as triangle, circle, cross and square buttons are integrated into the device's slim case. Finally, home, select, and start buttons give you quick access and control over the PSP's important functions.To have and to hold: The PSP's easy-to-master controls are cleverly integrated into the device's slim profile.Supported MediaAt the heart of the PSP is a new, proprietary media format known as the Universal Media Disc, or UMD. Each UMD can hold 1.8 GB of data, enough room for rich and complex games. UMDs, which are housed in a protective cover, slide into the rear of the PSP. Sony has declared the UMD an open format for developers and media content owners, so movies, music and other media are on the horizon from third parties. Sony has also signed on many popular game developers for the platform, so a deep library of titles is on tap.While the UMD is great for read-only media such as games and movies, Sony solves the problem of data storage with the addition of a Memory Stick Duo slot. With Memory Stick Duo media, you can store your saved games, downloaded online content, personal video and audio files, and more. When you want access to these files from your PC, simply use the PSP's USB 2.0 port to turn the device into a fast portable media drive. Then, drag and drop files such as your photos, MP3s, and videos onto the PSP, just as you would any other removable storage device. The PSP ships with a 32 MB Memory Stick Duo, and additional media with higher storage capacities are available.Major media: Sony's PSP-compatible Universal Media Disc (UMD) can hold 1.8 GB of data.ConnectivityThe PSP blows away the competition in the connectivity department. Indeed, the PSP's ability to connect to the internet, and to other PSPs and USB-based peripherals, is a real advantage. At the top of the list is Wifi connectivity, or IEEE 801.11b. Use this wireless internet standard to connect to other gamers around the world for hot multiplayer action--all from your couch, or your local Wifi hotspot. As mentioned, the PSP's USB 2.0 port is great for PC connectivity, but it also opens the PSP up for a whole range of future peripherals. Sony has plans for the PSP in other ways, too; the unit's infrared port speaks of remote control capabilities in the near future.A Digital CompanionIf you haven't already guessed, Sony has positioned the PSP to be much more than a gaming device. Out of the box, the device is ready to serve as a portable video player and photo viewer. By using the new H.264 MPEG-4 video standard, Sony obviously has its eyes on making the PSP a robust video device with support for feature length movies and more. In addition, the PSP offers a great way to transport and share your photos in JPEG format. And let's not forget the music. Load up your favorite MP3-encoded songs onto a Memory Stick Duo and you've got a portable audio powerhouse. The device also supports Sony's ATRAC audio codec, so you can play songs acquired from Sony's Connect Online Music Store. Sony even ships a nifty pair of earbuds--complete with an inline remote control-- with the PSP.What's in the BoxPSP device, AC adapter, battery pack, 32 MB Memory Stick Duo, earbud headphones with remote control, soft case and hand strap.", "price": 126.93, "imUrl": "http://ecx.images-amazon.com/images/I/41J70RTZHXL._SX300_.jpg", "related": {"also_bought": ["B002I0GZ5Y", "B0009350CQ", "B000R3BN4M", "B00168PFFK", "B000ASBKHE", "B000E0OCR8", "B000H1R0D2", "B0007TS24U", "B007M6W36Y", "B001KMRN0M", "B000HASW0I", "B002SD94AY", "B001W6JFMK"], "buy_after_viewing": ["B001KMRN0M", "B000ASBKHE", "B000F2DE8S", "B00DUANBQM"]}, "salesRank": {"Video Games": 21364}, "categories": [["Video Games", "Sony PSP", "Consoles"]]}