{"asin": "B0089IHBE8", "related": {"also_bought": ["B004UW0EMS", "B0000AHO92", "B00AZ43MGU", "B00GZM6FBU", "B00006881R", "B00E914II6", "B00I1781BY", "B0007LXQBW", "B008AHTO20", "B00856RURM", "B00GRGU358", "B004BU4UTM", "B000E9U9MG"], "bought_together": ["B0000AHO92"], "buy_after_viewing": ["B00GZM6FBU", "B00E914II6", "B00I1781BY", "B00GRGU358"]}, "title": "T-lock Incoming PRO Call Blocker with LCD Display and Blacklist", "price": 38.79, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41a2wvpanGL._SX300_.jpg", "brand": "Pro Call Block", "categories": [["Electronics", "Accessories & Supplies", "Telephone Accessories", "Caller ID Displays"]], "description": "This modern and eco-friendly incoming call block device can block number (s) from annuance callers in the Blacklist (or block number list). Up to 1,500 telephone numbers (up to 16 digits each) can be easily added to Black list memory by simply clicking a button. It also stores 100 incoming calls, and 50 outgoing calls. Besides phone calls, junk faxes can also be blocked to prevent waste of paper. *** Features include: * FSK/DTMF dual system compatible (requires Caller ID service to work properly); * Large storage - Stores up to 1,500 telephone and fax numbers in blacklist memory;  * Easy to Use - Simply press a button to store telephone and fax numbers in \"Blacklist\"; * Works worldwide with any analog phone line, and most VOIP lines (tested on Vonage, Comcast, MagicJack); * Line Powered - It does not require any external power supply or batteries (please ignore battery compartment); * EEPROM technology prevents losing stored numbers when disconnected from the telephone line;  * Stores up to 100 sets of income phone numbers and 50 sets outgoing phone numbers; * Blocks telephone numbers with up to 16 digits; * LCD display has 4 levels of brightness; Desk/Wall mountable.  ***Applications: This is the ideal solution to increase productivity and privacy in households & workplaces. Stop answering unwanted calls, including call from Telemarketers, Politicians, Junk faxes,  Charity/nonprofit organizations, Research companies conducting polls/surveys,  Collection agents, banks, lawyers, hospitals, credit cards companies, and many more! ....(U.S. Federal Government sponsored \"Do Not Call\" registry program does not apply to politicians, non-profit, research organizations). Now shipping the latest version!  Includes free technical support and 1-Year extended warranty (exclusively offered by HQTelecom) which adds accidental damage such as water spills, LCD failures, stuck buttons, and other accidental damages."}