{"asin": "B003WJR69E", "related": {"also_bought": ["B0047WTGMU", "B0045XAIFU", "B0049PP02K", "0964987597", "B004J44TUU", "B004VC3BP4", "B0039BPG4C", "B004GWUYYU", "B002IKLJUU", "B003VNKNEQ", "B005BKH7UA", "B003Y5N8RU", "B0050DZA4S", "B0037TA7Z4", "B004BWCNYY", "B004FZ8HTW", "B008KQ0MMC", "B0051PLOQ8", "B003VNKNF0", "B004G8QSTO", "B004LTNZKS", "B003VKX28I", "B008I6V7VE", "B008MB719C", "B00508WALO", "B001RCTATM", "B0047EL5D6", "B007VWHYZO", "B0048KK1KC", "B006RC0ZI2", "B004Q3C98S", "B0054RJQT0", "B004K34MUC", "B007M54E08", "B007IF7XKK", "B0050SWMCG", "B005I6DUKS", "B008MB70TI", "B004XKAY7W", "B008C7BWRI", "B00012FVYM", "B0042VJCXY", "B00805XF9U", "B0037FLUYU", "B0081YPUT8", "B004J3X5RE", "B002QCP19K", "B0050SWMN0", "B00A3Z3D4C", "B009K4QYWU", "B003VNKNEG", "B009RGVP20", "B005HNF01O", "B0068M8U06", "B001GNC7Q0", "B004BNONVE", "B000H02B6O", "B007Y4NWQE", "B002G12OBO", "B002WE4HE2", "B004HQD6FO", "B007M54E1M", "B006EKJ8UI", "B000EVSLRO", "B000FUO1BY", "B006W2SYF8", "B0037T3634", "B004GLBX00", "B0069S8VM6", "B008NB2WO0", "B007HU3G6Q", "B0049XE5AA", "B007HU8AY4"], "bought_together": ["B003VNKNEQ"], "buy_after_viewing": ["B008MB719C", "B008MB719C", "B003VNKNF0", "B0051PLOQ8", "B009MI4GY2"]}, "title": "Panasonic Lumix DMC-LX5 10.1 MP Digital Camera with 3.8x Optical Image Stabilized Zoom and 3.0-Inch LCD - Black", "price": 649.0, "salesRank": {"Camera &amp; Photo": 2111}, "imUrl": "http://ecx.images-amazon.com/images/I/41cGE7YRg3L._SX300_.jpg", "brand": "Panasonic", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The Panasonic Lumix DMC-LX5 is a unique compact digital camera offering photo enthusiasts the ideal way for capturing professional-quality photos and High Definition (HD) video. With an ultra-bright F2.0 ultra-wide-angle 24mm Leica DC Vario-Summicron lens, the Lumix LX5 minimizes image distortion, resulting in stunning, true-to-life images with outstanding resolution and detail.The 24mm wide angle lens offers extraordinarily large viewing space and now the optical zoom is extended to 3.8x (90mm) making the LX5 even more versatile.The F2.0 lens is twice as bright as a F2.8 lens, making it easy to produce beautiful photos with a soft-focused background thanks to the shallow depth of field provided by the extra light.In addition to the newly-designed lens, the Lumix LX5 features an image processing engine that combines technologies resulting in professional-quality photos, especially in low-light situations. Like its predecessor, the Lumix LX5 features the highly-acclaimed 10.1-megapixel CCD, but it has an expanded dynamic range by increasing the sensitivity and the saturation.Panasonic Lumix DMC-LX5 HighlightsVenus Engine FHD image processorThe newly developed Venus Engine FHD image processor enables higher-speed, higher-performance while compiling the Intelligent Resolution technology. The triple CPUs in this imaging engine dramatically speeds up processing while achieving exceptional noise reduction performance. With its high-sensitivity CCD and the brightness of the lens, minimum illumination of the Lumix LX5 is as low as 3 lux while shooting video.The predecessor DMC-LX3 played a big role to cease the pixel count war by adopting 1/1.63-inch CCD for 10.1-megapixel recording to realize the unprecedented picture quality with a compact digital camera and even to establish a new premium compact camera category in the market. The CCD in the LX3, which was highly acclaimed from specialists worldwide, is redesigned to achieve further expansion of dynamic range by increasing the sensitivity by approx. 31% and the saturation by approx.38% compared to the LX3. It is made possible by the improvement of on-tip-lens design with larger light concentration and VCCD expansion while deepening the photo diode to manage richer signal more effectively.The result is a high resolution, noise-less pictures even in high sensitivity recording and richly reproduced gradation in highly contrasted situations with the exquisitely wide dynamic range. Taking advantage of the high sensitivity CCD and the brightness of the lens, minimum illumination of DMC-LX5 is as low as 3 lux in movie recording.Record HD videos in AVCHD LiteIn addition to Motion JPEG images, the DMC-LX5 can record high-definition motion picture in AVCHD Lite. It features almost doubling the recording time in HD quality compared with the conventional Motion JPEG format. The picture quality is greatly enhanced thanks to the newly added Intelligent Resolution technology.The LX5 also features Dolby Digital Creator to record high quality audio.In movie recording, the DMC-LX5 goes further than simply recording HD movies. Apart from the movie recording capability of conventional digital compact cameras, the DMC-LX5 also features a Creative Movie mode, which lets the user set the shutter speed and aperture manually to make even more impressive movies. Changing the shutter speed brings special effects to movies, which is especially suitable for shooting fast-moving subject. The ability to control the aperture is convenient when there are several subjects at different distances and it is desired to have each of them stand out. My Color mode is also available in movie recording.Ergonomic design for easy controlThe Lumix LX5 has also been redesigned externally--with a thicker grip making it easier to hold and a newly-incorporated turn-and-push jog dial achieves various selection and setting more quickly. The Lumix LX5 also features a hot shoe, which allows for the attachment of a wide-variety of accessories, such as an optional Live View Finder which helps shooting under strong daylight with high visibility or an external flash. The 1:1 square format setting is added in the aspect ratio option which can be selected with the switch at the side of the lens barrel.Additional FeaturesThe 3.0-inch large 460,000-dot high resolution Intelligent LCD also redesigned by adopting High CRI (Color Rendering Index) backlight LED to greatly increase the color reproduction, making it more visible both in shooting and playing back images in any conditions from at dark night to under bright sunlight.Battery life is extended to shoot 400 photos (CIPA) per a single charge.A wide-variety of optional accessories, including a Live View Finder (DMW-LVF1), External Optical View Finder (DMW-VF1), Wide Conversion Lens (DMW-LWA52), Conversion Lens Adaptor (DMW-LA6), MC Protector (DMW-MC52), ND Filter (DMW-LND52), PL Filter: DMW-LPL52, External Flashes, Leather Case (DMW-CLX5) and a Battery Pack (DMW-BCJ13).What's in the BoxLX5 digital camera, battery charger, battery pack, AV xable, USB cable, shoulder strap, CD-ROM, lens ring front, hot shoe cover, lens cap, lens cap string"}