{"asin": "B003DZ9Z78", "categories": [["Electronics", "Home Audio", "Radios", "Clock Radios"]], "description": "This convenient, bedside iPod dock/clock radio from Sony is just what you need to wake up to songs on your iPod or iPhone. The space-saving design is perfect for your nightstand, and you can choose between the radio, iPod, or buzzer to start your day. An adjustable brightness level ensures you won't be distracted while trying to fall asleep.Wake to your iPod, radio, or buzzer.A space-saving, nightstand-friendly iPod dock alarm clock.View a control diagram.Click to enlarge.Charge While You Listen--or While You SleepYour iPod or iPhone will charge while docked to help you avoid a drained battery, whether you're listening or not. When you wake up ready to go, your device will be, too.Enjoy FM RadioA built-in digital FM tuner lets you catch up on the news, check the weather, or take in your favorite morning show while you get ready for your day. Pull up your favorites in an instant, with 20 presets.Not Too Faint, Not Too Bright--Just RightThe high, medium, and low brightness settings ensure you can easily read the display during the day or night, without being distracted while trying to fall asleep.Alarm OptionsWake up to your iPod, iPhone, the radio, or an old-school buzzer. If you can't bear to get up just yet, the alarm features a programmable snooze from 10 to 60 minutes.Sleep TimerThe sleep timer lets you drift off to your favorite tunes on iPod or the radio, adjustable to 15, 30, 60, or 90 minutes.Backup BatteryTo keep accurate time, a CR2032 battery provides a backup power source. You'll still be on time in the event of a power outage.What's in the BoxSony ICF-C05iP, AC power adapter, dock adapters, and documentation.", "title": "Sony ICFC05IP 30-Pin iPhone/iPod Clock Radio Speaker Dock (Black) (Discontinued by Manufacturer)", "price": 49.95, "imUrl": "http://ecx.images-amazon.com/images/I/51ZvyBkWOhL._SY300_.jpg", "brand": "Sony", "related": {"also_bought": ["B007KWXHCY", "B008R68DFS", "B00BQ4HROG", "B00COHALOM", "B00IEYHMIM", "B009CWRVH2"], "bought_together": ["B007KWXHCY"], "buy_after_viewing": ["B00BQ4HROG", "B00BQ4HROG", "B00HBJRV5K", "B00538NGEG", "B00BDS0512"]}}