{"asin": "B004HO58OI", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Fujifilm's FinePix HS20EXR is a high quality, advanced function SLR-styled long-zoom camera built for the professional or enthusiast photographer, but also easy enough for even a first time user. Improving on the excellence of its predecessor, the FinePix HS10EXR, the FinePix HS20EXR features a new 16-megapixel EXR-CMOS sensor, a powerful FUJINON 30x manual optical zoom (24mm-720mm equivalent) lens, a tilting 3.0-inch high contrast LCD with a electronic viewfinder featuring a \"heads up\" sensor that automatically changes from LCD to EVF, and countless features serious photographers seek for versatility and performance.With a new EXR-CMOS sensor powered by Fujifilm's EXR processor engine, the possibilities for photo enthusiasts are endless with the FinePix HS20EXR. The camera delivers high speed continuous shooting at 8 fps at full resolution for 8 frames, high speed movies at 320fps, captures full panoramic photos with Motion Panorama 360&deg; and full HD Movies at 1080p with an HDMI output connector and has the ability to shoot in RAW, JPEG or RAW &amp; JPEG modes, and in full manual mode. The HS20EXR also has an optional remote release cable and is compatible with two automatic Fujifilm external flashes that meter \"through the lens\" for more functionality.Fujifilm FinePix HS20EXR HighlightsHigh Speed and SensitivityThe newly-developed EXR Processor and EXR-CMOS sensor in the HS20EXR allow for pristine images to be taken in fast-shooting situations or in low-light environments. The combination of the two technologies creates a fast transfer circuit for quick process and reading of files for high speed shooting and Full HD movies, and the EXR-CMOS sensor itself, where the wiring layer and photo diodes are reversed, creates higher sensitivity for taking impressive images in low light conditions.1. EXR CMOS Sensor 2. EXR Processor 3. Fujinon LensIntelligent ProcessorWith the improved intelligent processor, taking photos can't get much easier. The GUI, with its new rich user interface that dramatically improves the appearance and searching functions of menus, might be one of the first things you notice, but the most notable benefits are speed and image quality. Additionally, the FinePix HS20EXR can now recognize an impressive 27 scenes. While shooting, the camera configures each scene and recognizes the perfect setting and automatically takes the best quality picture, with a single touch of a button.EXR TechnologyThe EXR technology adds further versatility by modifying its behavior according to the lighting condition. Users can either let the EXR Auto mode choose the correct setting itself, or pick from three manually selected options:High Resolution Prioritycan be used when you're after exceptional image quality.High ISO &amp; Low Noise Prioritycan be used in low light conditions where the combination with the BSI sensor makes for superb results.Dynamic Range Prioritytakes two pictures and combines them to provide a range of up to 1600%.With these unique sensor combinations, capturing great pictures has never been easier.Capture Moving SubjectsThe FinePix HS20EXR's strong mix of sensor and processing technologies allows breathless action shots to be captured, and the continuous full resolution shooting at 3fps, 5fps, 8fps or 11fps at 8-megapixel resolution, will make sure the action is stopped in its tracks. The FinePix HS20EXR also eliminates the need to worry about slow auto focusing or shutter lag. The new solution's contrast Auto Focus system takes approximately 0.16 seconds (minimum) to focus.A 30x Zoom LensWith a 30x zoom range covering focal lengths from a super-wide 24-720mm (35mm equivalent), the FinePix HS20EXR is ready for anything. Boasting high quality FUJINON optics, the manual zoom lens is now even easier to operate thanks to a reduction in the size of the flashgun. Zooming through the range can be done quickly and precisely to ensure perfect framing for every shot.The FinePix HS20EXR also is equipped to fight blurring, a common problem when using longer focal lengths. Dual Image Stabilization combines a mechanically stabilized CMOS sensor with high ISO sensitivities for total anti-blur protection. Together these technologies reduce the blurring effect of both handshake and subject movement to provide sharp, clean and clear results even at the longest zoom settings or in challenging lighting conditions.Dual image stabilization sets the HS20 apart from conventional digital cameras.HD Movie CaptureThe FinePix HS20EXR offers an impressive level of video functionality. With the ability to capture movies in true, full 1080p HD quality, the FinePix HS20EXR delivers high sensitivity with low noise for movies captured in low lighting. In addition, movie files (.MOV) are captured with H.264 high profile compression for smaller file sizes without sacrificing quality. With a mini-HDMI output connector, it is easy to connect and view images on your HDTV (HDMI cable not included).High Speed MoviesVersatility is further increased thanks to the High Speed Movie options, which include capture at an incredible 320 fps. With features like this, even the fastest moving subjects can be captured and watched in slow motion.One Touch ControlsThe FinePix HS20EXR sports a full complement of sophisticated manual and semi-automatic shooting modes and photographic controls. The extensive external controls give the more advanced photographer direct access to virtually every control they will need for uninterrupted shooting, and the specially designed chassis includes dedicated command buttons for quick and easy key functions such as ISO, white balance, focus and metering. The large command dial, manual focus ring, twist and zoom lens barrel, bright, clear electronic viewfinder, high quality tilting LCD screen and deep hand grip ensures the camera handles well. AA batteries (ships with alkaline) provide excellent performance (up to 300 shots with Alkaline batteries) combined with the convenience of a universally available format when shooting for extended periods away from main power.Additional FeaturesRAW / RAW+JPEG shooting: The FinePix HS20 has the ability to shoot both a RAW and JPEG shot simultaneously. RAW is for ultimate quality shots via post processing, JPEG is for great quality with no need for further post-production work.Motion Panorama 360&deg;: The sensor extends the sweep range to 360&deg; (shots can also be taken vertically). Combined with high quality Fujifilm printing, sweeping and impressive scenes can be taken, showing fine detail, low noise and high resolution at 180&deg;, 240&deg; or full 360&deg; panoramic ranges.Purple Fringing Reducer/Corner Resolution Enhancer: The EXR processor has the capability to spot and reduce purple color fringing, most common on dark subjects against light backgrounds. In addition, the EXR processor improves the resolution at the corners of an image for more uniform image sharpness.Super Intelligent Flash: The FinePix HS20EXR offers a flash control system which efficiently controls the level of flash for a given exposure to produce beautifully balanced flash illumination across the foreground and background. Super Intelligent Flash is most useful in macro photography where the contrast between subject and background can be especially challenging, but is also effective for night and backlit photography.Multi-Bracketing: The FinePix HS20EXR has 3 bracketing functions useful for high level photography: Film Simulation Bracketing (which automatically sets Film Simulation to PROVIA, Velvia and ASTIA for simultaneous capture of 3 frames), Dynamic Range Bracketing (which automatically sets dynamic range to 100%, 200% and 400% for simultaneous capture of 3 frames) and AE Bracketing (which automatically sets exposure range to even, under and over for simultaneous capture of 3 frames).Face Recognition: Users can register up to eight (8) faces, along with names, birthdays and categories, and the HS20EXR will prioritize focus and exposure right on the faces of those special people. Users can also use Image Search to view images of a registered person.Face Detection and Automatic Red-eye Removal: To provide perfectly exposed and focused portrait shots, the FinePix HS20EXR is fitted with Fujifilm's latest Face Detection technology which is able to track up to 10 faces simultaneously, at almost any angle to the camera. The system instantly corrects red-eye and then saves both the original and the corrected image file automatically.PhotoBook Assist: Photo book Assist lets you select and organize images in your camera to create a digital photo book. You can download the photo books to your computer using MyFinePix Studio software that is included.", "title": "Fujifilm FinePix HS20 16 MP Digital Camera with EXR BSI CMOS High Speed Sensor and Fujinon 30x Wide Angle Optical Zoom Lens", "price": 329.77, "salesRank": {"Camera &amp; Photo": 4741}, "imUrl": "http://ecx.images-amazon.com/images/I/51wNMb4ZAeL._SY300_.jpg", "related": {"also_bought": ["B004M5SXPI", "B0039BPG1A", "B0040Z484U", "B004YTU9CM", "B005H0OU72", "B003VNKNF0", "B005GXLGWM", "B003VNKNEQ", "B00CV9MITY", "B005H0OU3Q", "B005H0OTMS"], "buy_after_viewing": ["B0039BPG1A", "B003VNKNF0", "B00ATM1MGA", "B003VNKNEQ"]}}