{"asin": "B006UV6YMQ", "related": {"also_bought": ["B006UL00R6", "B006UL00U8", "B007EMOOK4", "B0092MD6S0", "B007MV7H8S", "B006UL010W", "B007JGAR8S", "B007A2KCEU", "1937538141", "B007JGAR8I", "B009L1HC2I", "B0084G3FKE", "B007EZJGXQ", "B00CNZTPGA", "B00EZ8BEXK", "B008AQ7AFY", "B00HK8Z9AG", "B007NLU8CE", "B008PZ16TQ", "B00HVXVX0K", "B009VUBWH0", "B00CDJT30O", "B00ERD2QEO", "B00HYAL88W", "B007YPED8O", "B008BBI6RY", "B007YPJMAI", "B0000BZL0U", "B00C9USP8I", "B00DZZHPHI", "B007YPVVES", "B00DCM0DUU", "B0000BZL47", "B004KU0RJK", "B007NDL56A", "B007MV7GJS", "B00BMK9U76", "B005LFT3MA", "B009VVHNNG", "B00843ES1C", "B007YPUXGU", "B007NDL56U", "B004MME6A2", "B0000BZL7S", "B007MQ7VWK", "B00CDJSIMS", "B008X1C16O", "B00D86UQWK", "B004OVE174", "B00ATM1MVA", "B0000BZL68", "B009FRD7RC", "B00CQ65Q2I", "B0092MD5ZE", "B00804UT90", "B00FPKDSGS", "B00FPKDPF2", "B005WQR2QM", "B0092MD5V8", "B00K8ROO6G", "B007EMOQS4", "B00K7O2DJU", "0321929500", "B007MS55HQ", "B00CV9MM3G", "B004OVE17Y", "B00I44EUBO", "B00I7WLFZM", "B004XYZI0Q", "B008KFY16Q", "B00BMKB5JW", "B00COJSPGG", "B004NROYVM", "B009UN6OIU", "B005LFT3QG", "B0000BZL2Y", "B004QBQAXU", "B00FRDUZUK", "B00D62VZBW", "B003JFMRQS", "B007NDL542", "1937538311", "B0080F66YQ", "B008S7BOFM", "B008BBI72I", "B009OIR6BK", "B009VUBXBA", "B001EMMZP6", "B007YP9OJ2", "B001K9I9IU", "B004NROYUS", "B009X0EO00", "B0000BZM1F", "B008BBI7D2", "B004Q3Q9OS", "B00G8KF7BI"], "bought_together": ["B006UL00R6", "B007EMOOK4"], "buy_after_viewing": ["B00B7ID99I", "B004EC20Y4", "B00HYAL88W", "B0096W1OKS"]}, "title": "Fujifilm X-Pro 1 16MP Digital Camera with APS-C X-Trans CMOS Sensor (Body Only)", "price": 999.0, "salesRank": {"Camera &amp; Photo": 895}, "imUrl": "http://ecx.images-amazon.com/images/I/41XUN9mY1pL._SX300_.jpg", "brand": "Fujifilm", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Compact System Cameras"]], "description": "The Fujifilm X-Pro1 features a 16-megapixel APS-C X-Trans CMOS sensor, a brand-new X lens mount, Hybrid Multi Viewfinder and three prime lenses (sold separately).Fujifilm X-Pro 1 HighlightsSetting new standards in image resolutionFUJIFILM have developed a new CMOS sensor called the X-Trans CMOS. The X-Trans CMOS sensor is capable of delivering resolution that is parallel, if not superior, to a full frame sensor. The new color filter array paves the way for an ideal sensor that does not need an optical low-pass filter.  While the optical low-pass filter is indispensable for the reduction of moir&eacute; and false color generated by conventional sensors, it also degrades resolution. FUJIFILM has developed a new color filter array that is inspired by the random arrangement of fine film grain, removing the need for an optical low-pass filter to solve moir&eacute; and false color issues. In the array, RGB pixels are arranged in 6x6 pixel sets with high aperiodicity (randomness). Increasing the degree of randomness eliminates the fundamental cause of moir&eacute; and false colors &ndash; a problem that occurs in conventional arrays when shooting stripes and other repeating patterns. The presence of an R, G and B pixel in every vertical and horizontal pixel series minimizes the generation of false colors and delivers higher color reproduction. As a result of using a film-inspired array, a more powerful EXR Processor Pro is required to process the image signal data. This development will maximize the full potential of the X-Trans CMOS sensor and deliver high speed and high precision image processing.Prime FUJINON XF lenses deliver the highest image qualityFujinon lenses have long been associated with delivering high quality images, with optics used for both broadcast TV and medium format cameras. Now the expertise borne out of this enviable optical heritage has been put into lenses for the FUJIFILM X-Pro1. Three compact XF Fujinon fast aperture prime lenses will be sold separately. The \"XF18mmF2 R\", \"XF 35mmF1.4 R\" and \"XF60mmF2.4 R Macro\" all offer precise control over depth-of-field and deliver excellent out-of-focus bokeh thanks to the design of the molded aperture diaphragm blades. The blades are curved to create a circular image at all aperture settings, while the very edges of each blade are meticulously rounded off rather than simply cut off, which delivers a sharper image. In addition, the solid feel of the high-quality metal barrel and detailed exposure setting in 1/3 step increments using the aperture ring fuel your desire to capture more photos with every shot.FUJIFILM original \"X-Mount\" maximizes lens performanceSpecifically designed to maximize the mirrorless design of the body the X-Mount has a short flange back distance of just 17.7mm. This means the rear lens elements are as close as possible to the sensor. The wide opening allows the lens to be mounted deeper within the body &ndash; up to 7.5mm (approx) from the mount surface &ndash; reducing the back focus distance of each lens to the minimum possible, thus achieving high resolution all the way to the edge of the image.Hybrid Multi ViewfinderFUJIFILM's revolutionary Hybrid Viewfinder first appeared in the X100. With its ability to instantly switch between an Optical Viewfinder and Electronic Viewfinder the Hybrid Viewfinder has added a new dimension to the pleasure of composing photographs. For the brightest viewing image, and to keep shutter lag to a minimum, users should choose the Optical Viewfinder. Those wanting focus confirmation, exposure information, white balance information and depth of field indicators should switch to Electronic Viewfinder. The Electronic Viewfinder provides an excellent \"Live View\" of your composition. This fusion of technologies allows users to enjoy composing their images through a bright viewfinder, but has the option to overlay vital picture taking information should this be required. Changing between the two viewfinders is simple, thanks to the switch on the front of the X-Pro1 body. When attaching a FUJINON XF-series lens on X-Pro1, both the viewfinder magnification and bright frame size automatically switch to support the lens focal length. Viewfinder magnification switches to 0.37x for the 18mm lens, and to 0.60x when the 35mm or 60mm lens is mounted, letting you compose your shot with the bright, crystal clarity of an optical image. The X-Pro1 also gives you the freedom to manually set a focal distance and switch between viewfinder magnifications.Cutting edge technology in a beautiful camera bodyThe top and base are made from die-cast aluminum alloy which, combined with high quality touches like precise engraving on the top-plate and hand-enamelled lettering on the lenses, underlines the fact that the entire X-Pro1 system is built without compromise.This eye for detail extends to the shutter speed dial and exposure compensation control that is precision milled from solid metal. Details like the shutter speed dial lock mechanism and the recessed exposure compensation dial are designed to prevent accidental movement of settings. The knurled finish on the sides of the dials feature rows of minutely milled squared pyramids for superb grip and confidence.\"Made in Japan\" confirms that every part of the construction has had to meet FUJIFILM's highest standards.The lightweight, precision-milled lens hood (included with the lens) has been exclusively designed and machined from aluminum for the FUJINON XF lens. It's compact size delivers superb light shading performance in a design that perfectly matches X-Pro1 styling.Diameters of the aperture ring and focus ring of the 3 Fujinon XF-series interchangeable lenses are only slightly larger than the barrel for sleek uniformity of design. Precision machined from metal, the reassuring click of the aperture ring at each setting and the comfortable torque resistance when operating the focus ring enhances the shooting experience.The X-Pro1's leather-like finish designed for a quality look and durability. The synthetic leather offers resistance to the elements and high durability, while an original manufacturing process produces a texture with the look and feel of authentic leather.The X-Pro1 has been designed with the photographer's comfort in mind. The natural fit of the eyepiece provides excellent shielding from light leakage. A dioptric adjustment lens can also be attached.Extending FUJIFILM's photo film legacyIn film cameras, multiple exposures is the unique photographic technique of superimposing one image on another by double exposing a single frame of film. Through advanced digital processing the X-Pro1 can simulate this technique - just select Multiple Exposure mode and take your first shot. By viewing it in the Hybrid Multi Viewfinder or on the LCD screen, you can see how the finished multiple exposure will look and precisely frame the second shot.Further enhancements have been made to the Film Simulation modes with the new Professional Color Negative Film Modes (Pro Neg. Std and Pro Neg. Hi) designed for X-Pro1 users working in the studio. If you'd like to shoot the same scene in a variety of Film Simulation modes, the X-Pro1 offers Film Simulation bracketing, along with AE, Dynamic and ISO bracketing.FUJIFILM has also included Film Simulation modes, where the X-Pro1 simulates the colors and tonal qualities of popular FUJIFILM emulsions. These include the vibrant colors of Velvia, the softer skin tones of ASTIA and the natural look of PROVIA.Enhance Monochrome Expression with Color Filters - Replicating the effects of monochrome film photography the X-Pro1 lets you use color filters to expand your photographic interpretation. Heighten contrast with the yellow filter and red filter or brighten greens and deepen reds with the green filter. Just as professional film photographers once selected a filter and printing paper to complement their creative vision, you can easily fine tune image quality with these filters. For those after a more nostalgic theme there's a sepia filter too."}