{"asin": "B0010QPX4G", "description": "Get the power of a full-sized laptop in the ultra-compact ASUS Eee PC 2G Surf, which offers a full QWERTY keyboard, 7-inch screen, and preinstalled Linux operating system. (This laptop is also compatible with the Microsoft Windows XP operating system.) You'll be able to stay connected to email and the Internet easily thanks to the Wi-Fi LAN (802.11b/g). Because it uses flash memory instead of a hard drive (with 2 GB of storage), the Eee PC is optimal for weathering rough handling and sharing space in overstuffed bags. This 2 GB Surf model does not include an integrated Webcam.With a rapid start-up time, the Eee PC is always ready to get into action.The 2G Surf comes in a number of colors:blush pink,galaxy black, sky blue, andlush green.For the students and professionals, the Eee PC comes with a powerful selection of software to maximize personal productivity--over 40 built-in applications. The Open Office suite of software enables the user to open, edit and create documents, presentations, spreadsheets and databases that are compatible with Microsoft Office. For journalists, photographers and other professionals who need to use a computer in the field to create, to communicate and to collaborate with other colleagues, the Eee PC's combination of power, extreme portability and rugged build makes it the ideal computing solution.It's also a great choice for young students, with a built-in Dictionary that's great for homework, and it includes two modes of intuitive graphic user interface design to accommodate both experienced and inexperienced PC users. The Eee PC also handles your digital images, movies, and music as well as Internet radio.No technical manual required with the specially designed, user-friendly, and intuitive graphic interface.Compact and highly portable at just 32 ounces, the Eee PC 2G has a 7-inch wide color TFT LCD with an 800 x 480-pixel resolution (WXGA). Under the hood is a 800 MHz Intel Mobile CPU with integrated Intel graphics processor, 512 MB of RAM (not expandable), and 2 GB of solid-state flash memory. With the dependable solid-state disk, you get unparalleled shock-protection and reliability. In addition to its wireless LAN, it also offers wired Fast Ethernet (10/100) connectivity. The Eee PC includes software for Web browsing (Firefox), email, OpenOffice 2.0 for creating and editing word processing documents and spreadsheets, and a suite of other productivity software to help keep you on track.You get three USB 2.0 ports, a VGA output for connecting to external monitors, headphone and microphone jacks, and a Secure Digital (SD) memory card slot. The Eee PC measures 8.9 x 6.5 x 1.4 inches, and it weighs 32 ounces. The 4-cell, 4400 mAh battery provides up to 2.8 hours of battery life (depending on usage). It's backed by a 1 year warranty for parts and labor (6 months for battery).SpecificationsInternal memory: 2 GB solid state diskMemory expansion: slot for MMC/SD(SDHC) cardsRAM: 512 MB DDR2Processor: 800 MHz Intel Mobile CPUOperating system: Linux (supports Windows XP)LCD: 7 inches, 800 x 480 pixelsNetworking: 54g Wi-Fi (802.11b/g), 10/100 Fast EthernetPeripheral connectivity: three USB 2.0External video: one VGAExternal audio: one headphone and one microphone portWebcamera: noBattery: 4400 mAhBattery life: up to 2.8 hoursWeight: 2 pounds (32 ounces)Dimensions: 8.9 x 6.5 x 1.4 inches", "title": "ASUS Eee PC 2G Surf (7-Inch Display, Intel Mobile Processor, 512 MB RAM, 2 GB Hard Drive, Linux Preloaded) Sky Blue", "price": 79.99, "imUrl": "http://ecx.images-amazon.com/images/I/411ipAJcCLL._SY300_.jpg", "related": {"also_viewed": ["B00AAIC5S2", "B00BQH8QTI", "B00FAUGGPS", "B00KDQYLA6", "B00HRO3IBA", "B00FJXVRM8", "B009LL9VDG", "B00FNPD1VW"]}, "categories": [["Electronics", "Computers & Accessories", "Laptops"]]}