{"asin": "B003TFEHHU", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphone Accessories", "Earpads"]], "description": "Pain in the EarOne of the best ways to listen to music from portable media and home media devices is through in-ear headphones. Their small design makes them more portable and less cumbersome than bulky on-ear headphones. However, in-ear headphones can be ill-fitting in your ear, causing them to let in outside noise, let out sound, slip out of, or even cause discomfort in your ears with materials that do not make a perfect seal.The right eartip needs to provide the best possible sound, stay in place during workouts, and be comfortable to wear while you are enjoying your music....Its All in the TipsMonster SuperTips feature proprietary materials and engineering to deliver performance you won't get from any other eartip. With SuperTips, you'll get deeper, tighter bass and a more dynamic range all with comfort that stays in place.Here More Music and Less NoiseSupertips form a perfect seal in your ear to block sound from coming in or going out creating an ideal acoustic chamber in your ear. This optimized listening environment isolates and seals out outside noises providing an incredible music experience. All you hear is music...Ordinary foam eartips absorb sound waves, deaden bass and decrease accuracy before they reach your ear. SuperTips' feature a constrained layer that keeps sound waves undistorted and clean from speaker to eardrum to provide the cleanest, most accurate sound possibleComfort Everywhere You GoThe portability of in-ear headphones makes them perfect for working out, bike riding, running, or even sleeping on that long flight. When performing these activities, comfort is as important as sound quality. Monster SuperTips pliable gel and ultra-soft foam materials conform easily to the shape of your ear canal. This makes for a comfortable fit that reduces ear fatigue, and stay in place during activities, letting you listen for hours...Freedom of ChoiceNever tried SuperTips before? Then the sampler pack is for you. The right fit is the difference between good and great sound. The sampler pack comes with all sizes of both gel and foam SuperTips so you can try them all out. Once you discover which SuperTips works best for you, replacement kits are available with six&nbsp; pairs of your size plus a bonus revolver eartip case.For super-critical audiophile listeningDeeper, tighter bassSilicon shell is easier to cleanPliable and comfortable gel filled designMonster constrained layerFor active listenersSuper comfortableSoft-as-a-pillowConforming foam for better \"grip\" to stay in placePerfect for exercising", "title": "Monster MH TIP IE-G S Gel SuperTips Replacement Kits 6 Pr. Gel SuperTips", "price": 14.98, "imUrl": "http://ecx.images-amazon.com/images/I/41bf9C1M8cL._SY300_.jpg", "brand": "Monster", "related": {"also_viewed": ["B00B2A1OD4", "B00BCRCTY0", "B001RB24UA", "B00DD2BZRY", "B00DBAM0CM", "B007BWCDYQ", "B00GEPT8EO", "B002NTMHU2", "B00BCRDJ8A", "B001LNO722", "B00DBAAGZK", "B00BOTPPL0", "B0055XIB1W", "B00BX0TEEE", "B004HKIADS", "B00B2FXB6M", "B00DEUZPF8", "B002IEE9D0", "B006VJQ2OM", "B004923LQK", "B00B2A3GRG", "B006XFUPD8", "B00D77KEEK", "B00A9Z593Y", "B004XW2NEW", "B00F2GZM46", "B001DXGBII", "B00A44UIP4", "B006XGMQIE", "B00GJPIZ52", "B002UXRED6", "B004Y79BOQ", "B007P55G0W", "B00AQU2VLA", "B0015PN3W6", "B00304AADU", "B002P7DBCK", "B002EL4RIY", "B00GEPFGJA", "B003YKG2XC", "B002OOWBWK", "B002TW7DJI", "B002EL4RIO", "B006CRVZB8", "B00BCRGQJE", "B00AQU2W2I", "B00FNXC18S", "B00858I4FC", "B001NH0V1M", "B00AD7GY3C"], "buy_after_viewing": ["B00B2A1OD4", "B001RB24UA"]}}