{"asin": "B001FW9QGQ", "description": "With its huge capacity and sleek design, the FreeAgent&reg; Desk storage solution delivers a powerful yet simple way to help safeguard all your photos, music, videos, and documents. Included, easy-to-use   software helps keep your information safe and private with automatic data backup and encryption of your important files and folders. Environmentally smart utilities help save energy by putting your FreeAgent   drive in sleep mode once it has been idle for 15 minutes. And you can take advantage of its flexibility to lie on its side or stand vertically to maximize your workspace.Durable brushed metal finish, dynamic display lightingEasy-to-use encryption, password-protect critical files.Modern DesignWith its huge capacity and sleek design, the FreeAgent&reg; Desk storage solution delivers a powerful yet simple way to help safeguard all your photos, music, videos, and documents.SecurityIncluded, easy-to-use software helps keep your information safe and private with automatic data backup and encryption of your important files and folders.Dual orientation to maximize space, easily stackable, energy efficientSpace Saving and Energy EfficientEnvironmentally smart utilities help save energy by putting your FreeAgent drive in sleep mode once it has been idle for 15 minutes.  And you can take advantage of its flexibility to lie on its side or stand   vertically to maximize your workspace. Plus, multiple drives can easily stack on top of each other.Key FeaturesConveniently store all your photos, music, videos and documents in one place thanks to generous storage capacity.Enjoy a sleek, modern design that offers the choice of horizontal or vertical orientation to complement your desktop environment.Easily protect your data with automatic backup software.Keep your important files and folders private with powerful software encryption technology.Sync content between your FreeAgent Desk drive and other portable drives so you&rsquo;ll always have your current versions wherever you are.Experience fast data transfer with a USB 2.0 interface.Get started quickly with pre-loaded software. No CDs!Save energy with an environmentally smart utility that can put your drive in sleep mode once it has been idle for 15 minutes.Enjoy peace of mind with a 5-year limited warranty from the worldwide leader in storage solutions.What&rsquo;s in the BoxFreeAgent&reg; | Desk external hard drive, FreeAgent software pre-loaded on drive (Windows only), Quickstart guide, Base stand, Attachable feet, USB cable and Power supply.    END", "title": "Seagate FreeAgent Desk 500 GB External Hard Drive - Silver (ST305004FDA2E1-RK, Recertified)", "price": 90.35, "imUrl": "http://ecx.images-amazon.com/images/I/31WRSg52fpL._SY300_.jpg", "related": {"also_viewed": ["B004RX8MRO", "B001FWCDQG", "B0045JLPOM", "B001SJVU6K", "B00829THK0", "B000ND75C0", "B001UI49XA", "B003BLQHN4", "B00834SJSK", "B006Y5UV4U", "B009T0FGRE", "B003ELOSHI", "B005J7YCHG", "B003ELOSI2", "B006Y5UV4A", "B000VZCEUI", "B007QQ45NE", "B002QEBMAK", "B008R7FC74", "B0045JLPMO", "B0041OSAZS", "B00BOHNZ0A", "B00H4XH586", "B006Y5UQ3G", "B006Y5UQ3Q", "B002QEBMB4", "B00BOHNYTW", "B001QCDYZO", "B0030BMV9O", "B001FWIDWY", "B002COI60I", "B00829TIEU", "B00EAS8I3O", "B002JMWBRW", "B00HFRWXV0", "B006Y5UPZU", "B001FWIE1Y", "B002QEBMBY", "B000EVOOO8", "B00H4XH5IG", "B002CZQ4GU", "B003ELOSJG", "B005PVXI3A", "B006Y5UV2M", "B0085JRRAY", "B00834SJNA", "B004SGJCCO", "B00CI3BIWQ", "B000XRK3LG", "B001HAMNSY", "B00D695IF4", "B00829THQE", "B00E83X9P8"], "buy_after_viewing": ["B00E83X9P8", "B004RX8MRO", "B00CI3BISU", "B00EAS8AA0"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]]}