{"asin": "B000IMSK8Y", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Remote Controls", "TV Remote Controls"]], "description": "Harmony 670: Designed for Your Digital Video RecorderDesigned specifically for Digital Video Recorder (DVR)&nbsp;users,&nbsp;the Harmony&reg; 670&nbsp;features convenient controls that make it easy to command TiVO&reg;. and other popular DVRs.&nbsp; Essential buttons including &quot;Record,&quot; &quot;Play,&quot; &quot;Pause,&quot; &quot;Advance,&quot; &quot;Rewind,&quot; &quot;Skip Forward,&quot; &quot;Skip Back,&quot; and a directional pad are&nbsp;centrally located,&nbsp;and convenient &quot;Sound&quot; and &quot;Picture&quot; buttons help you tame tough configurations&nbsp;such as&nbsp;switching aspect ratios or sound modes.&nbsp;Harmony's activity-based control makes it easy to manage your entire home entertainment system; just press&nbsp;a conveniently color-coded activity button (&ldquo;Watch Movie&rdquo;), and the remote will power on your TV, DVD, stereo receiver, set all the inputs and even press &quot;Play&quot;!&nbsp;There's also a handy &ldquo;Help&rdquo; button so that anyone from the kids to the babysitter can access programming.1. Easy to set up:Just connect your Harmony remote to your computer and the Web wizard walks you step-by-step through a simple set up. Enter in your model numbers for your components, then answer a few easy questions about how you &quot;Watch TV&quot; or &quot;Watch a DVD&quot; You'll be controlling even the most complex system without any of the hassles of elaborate macro-programming.2. Easy to use:The Harmony Remote is the world's only remote with Smart State Technology&reg; activity control. Just press one of the Activity buttons, such as &quot;Watch TV&quot; or &quot;Listen to Music,&quot; and your Harmony Remote automatically sets up your entertainment system, without you ever having to program a &quot;macro.&quot;3. Easy to get help:With the Harmony remote, you don't have to know anything about your entertainment system to operate it. No sound? No picture? No problem! There's even a handy &quot;HELP&quot; button to guide you through simple troubleshooting and get you back in control.4.&nbsp;Never out of date:&nbsp;The Harmony Remote device database is constantly updated with new components and fine-tuned settings.&nbsp; Simply connect it to your computer using its USB interface, and your remote is updated automatically!&nbsp;&nbsp;&nbsp;Features&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Color-coded activity controlsA single press configures your television, stereo, DVD player, or other device required for the selected activity.&nbsp;Designed for DVRsThe most commonly-accessed controls are located centrally, for easy access at thumb's reach.&nbsp;&nbsp;&nbsp;Backlit keysEasy to see; easy to use. No more fumbling for the correct button to play, pause, mute or change aspect ratios.&nbsp;Get the Logitech Harmony Adapter for PLAYSTATION 3. Finally, control movies on your PS3 &mdash; drama free.Wish you could control all your movies, music, games and entertainment gear &mdash; including your PLAYSTATION 3 &mdash; with one remote? Wish granted.Add one touch PS3 control to any Harmony remote with the new Logitech Harmony Adapter for PLAYSTATION 3. Now your entire entertainment system and every PS3 command is at your fingertips. Want to watch a DVD or Blue-ray Disc movie? Play a game? Turn the console on or off? Easy. Just press one button on the remote to experience instant entertainment gratification.Which Harmony Is Right For You?Find out what other Logitech Harmony Advanced Universal Remotes fit your audio &amp; video set-ups. Browse more Harmony remotes and see which one is right for you.Harmony 510Simple, one-button access to your movies, music, and more.Harmony 670Simple control of your DVR and Tivo.Harmony 700Simple control that's always charged and ready for your entertainment.Harmony OneSimple, stylish touch-screen control of your entertainment.Harmony 900Complete control of devices you can't see.Harmony 1100Personalized control of your home theater system.Control FeaturesHarmony 510Harmony 670Harmony 700Harmony OneHarmony 900Harmony 1100Number of devices supportedUp to 5Up to 15Up to 6Up to 15Up to 15Up to 15LCD displayBlack and whiteBlack and whiteColor screenColor touch-screenColor touch-screen3.5&quot; color touch-screenActivity-based   controlsLayout optimized for DVD/TiVo&nbsp;&nbsp;Contoured design to fit comfortably in your hand&nbsp;&nbsp;&nbsp;&nbsp;Customizable screen for more powerful personalization&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;RF   support for control of devices inside cabinets&nbsp;&nbsp;&nbsp;&nbsp;Easy-to-install   RF System for RF connection&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;RF   wireless extender for RF connection&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Available separatelyPower ManagementHarmony 510Harmony 670Harmony 700Harmony OneHarmony 900Harmony 1100Battery operated&nbsp;&nbsp;&nbsp;Rechargeable&nbsp;&nbsp;With cableWith docking stationWith docking stationWith docking stationWith Every Harmony RemoteHarmony 510Harmony 670Harmony 700Harmony OneHarmony 900Harmony 1100Simple online setup with PC or MacGrowing database of 225,000+ entertainment devices so you know Harmony will work with your devices today and tomorrowLive support if you hit a snagA handy help button so you're never stuck1-year warrantySystem SupportHarmony 510Harmony 670Harmony 700Harmony OneHarmony 900Harmony 1100Windows XP, Vista, 7Mac OS X (10.3 or later)System RequirementsWindows&reg; systemMicrosoft Windows&reg; 2000 or XPUSB portCD-ROM driveInternet accessMacintosh&reg; systemMac OS X 10.3 or laterUSB portCD-ROM driveInternet accessPackage ContentsLogitech&reg; Harmony&reg; 670 remote control&nbsp;&nbsp;USB cableInstallation CDInstallation guide4 AAA batteries1-year warranty", "title": "Logitech Harmony 670 Universal Remote (Discontinued by Manufacturer)", "price": 188.99, "imUrl": "http://ecx.images-amazon.com/images/I/41ZWS3055GL._SY300_.jpg", "brand": "Logitech", "related": {"also_viewed": ["B004OVECU0", "B002IC0YLS", "B004OVECUA", "B000EUGX70", "B00093IIRA", "B00182F1SU", "B00119T6NQ", "B003JSLP54", "B001F51G1Q", "B000CS1TLE", "B0003QER82", "B002IC0YL8", "B000BDG3HU", "B0038OMEQI", "B005O81U9S", "B003W8DZ1S", "B004U605FK", "B00I54C0GA", "B005FO43OU", "B000GD3J3G", "B003IZFCFW", "B009EIUH6G", "B00BQ5RYI4", "B00IAKLM54", "B000II6YEA", "B001M5U5AC", "B0003QER7S", "B000623HE8", "B00J7KM5X4", "B001KC08AE", "B00BQ5RY1G", "B00066FHHO", "B004UKRRD4", "B0003QER8C", "B000FL9E6K", "B001G6LTL6", "B001KC08A4", "B001HA51Z6", "B005O81U8Y", "B000FL9E6U", "B003AM8S3G", "B000CCXCYC", "B003UVVGHW", "B0000TNZDK", "B00267S7XW", "B007FIPSXE", "B000ILIHTC", "B009VJUEJS", "B001HKLA60", "B003DNS88W", "B00385XUG0", "B003B72GIS", "B006ZTH35U", "B00FV2UK9I", "B0003QER5U", "B000VAXSFS", "B003B70C0C"], "buy_after_viewing": ["B004OVECU0", "B002IC0YLS", "B00BQ5RYI4", "B00BQ5RYI4", "B004OVECUA"]}}