{"asin": "B0082E9K7U", "description": "The Ultra-portable Compact Pocket-SizeXBOOM Mini Portable Capsule Speakeris petite in size but massive in sound. TheEnhanced Bass+ Expansion System (BES)is committed to deliver a full-bodied, 360-degree superb sound experience like no other.Long-lasting Embedded Rechargeable BatteryThe built-in battery is rechargeable via USB and offers an impressive 12+ hours of continuous playback time from one single charge.Modular \"Buddy-Plug\" DesignThe integrated stowaway 3.5mm stereo audio jack plug and socket connects multiple XBOOM Mini Portable speakers together to take your music experience to the next level.Available in Multiple ColorsPick an XBOOM that matches your style in Classic Black, Azure Blue, Spring Bud Green, Sweet Pink, Lavender Purple,  la mode Red, Metallic Silver, Snow White, and Cobalt Bumblebee Yellow.Universal Compatibility- All iPods, iPhones, iPads, Blackberry smartphones- Android smartphones - Samsung Galaxy, HTC, Nokia, LG, Motorola, Google Nexus, All Droids- All MP3 players, CD players, PC and Laptops, Tablets and Other Music Devices with a 3.5mm audio socketWhat's in the Box- XBOOM Mini Portable Capsule Speaker with Rechargeable Battery and Enhanced Bass+ Resonator- 3.5mm Male to 3.5mm Male Gold Plated Stereo Audio Extension Aux Cable, 3 Feet | 36 Inch- Splash-Proof Carrying Travel Pouch- USB Charging Y Cable (1 x USB 2.0 A-Male, 1 x Mini-B, 1 x 3.5mm Stereo Audio Jack)- User ManualWarrantyThe XBOOM Mini Portable Capsule Speaker is backed by manufacturer 1 year warranty. Please contact us via email if you have any questions.", "title": "XBOOM Mini Portable Capsule Speaker with Rechargeable Battery and Enhanced Bass+ Resonator - Black", "price": 14.99, "imUrl": "http://ecx.images-amazon.com/images/I/41HA8yq9yVL._SY300_.jpg", "related": {"also_bought": ["B004C51HRY", "B00CP7SWII", "B001UEBN42", "B0043WDNRI", "B007OYAVLI", "B0044QPWGS", "B00BCMI0Q6", "B002MAPT7U", "B004HHICKC", "B004SNDC50", "B0059ERNGG", "B00IHJLAJG", "B006IYD55Y", "B00H9BEC8E", "B005LQZR4M", "B00EE1H7BQ", "B00BLQ9JHM", "B005P5MISM", "B001GXI4LM", "B002ODQJKQ", "B00CBTES9M", "B00FA892IS", "B005FVNGRS", "B004WODP20", "B00H3E5KT2", "B00CXLCMGY", "B00HRLSSKO", "B006JMKL66", "B00DGJJNVO", "B000H3ACGW", "B001NCDE84", "B00F3J9G1W", "B0050SX9I2", "B00JM59JPG", "B002VPE1QG", "B004OA733E", "B004M5KYGY", "B005NF5NTK"], "bought_together": ["B004C51HRY"], "buy_after_viewing": ["B00CP7SWII", "B004HHICKC", "B001UEBN42", "B007OYAVLI"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}