{"asin": "B003YT578O", "related": {"also_bought": ["B002Q7ILDS", "B004286VMW", "B00HZXGC0M", "B00IAAALFG", "B009F1JL5A", "B00EUCNH9A", "B00BD7UL5I", "B00B7JQQQA", "B00BC4QMVE", "B00FFJ0HUE", "B00AKUAWD0", "B008U0310S", "B00FEJ07V4", "B00GWVNK8A", "B006HUMYCO", "B00FOU3KYE", "B009F1II54", "0812063090", "B00C2WA91E", "B008CWLHJQ", "B00CPIF4G0", "B009F1J4QQ", "B00863L2M8", "B009F1I1C4", "B00COQGIPY", "B00BWF5U0M", "B00BEJU5WY", "B0084FPSWS", "B00IVLHJ2M", "B008XKHG9W", "B007TFF2PM", "B009AEYEVS", "B00GSMJDUC", "B002SU4ED4", "B002FFT8Z6", "B008ZGKWQI", "B009F1IHZK", "B00ECDM78E", "B00DBV28TG", "B006Y5UV4A"], "bought_together": ["B004286VMW"], "buy_after_viewing": ["B00DBV28TG", "B006HUMYCO", "B00632SOD4", "B009QBIZ60"]}, "title": "Asus 8X External Slim DVD+/-RW Drive SDRW-08D2S-U - Retail (Black)", "price": 33.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41FnPh4Bu-L._SX300_.jpg", "brand": "Asus", "categories": [["Electronics", "Computers & Accessories", "External Components", "Optical Drives"]], "description": "The ASUS Slim SDRW-08D2S-U is the perfect companion for your Eee family products or other mini-notebooks.The portable and stylish ASUS SDRW-08D2S-U lets you create and read CDs or DVDs with speed, style, and simplicity.Encased inside a slim and elegant diamond-cut design with a shimmering finish, the SDRW-08D2S-U is a joy to carry and pair up with your Eee PC.This slim external DVD re-writer utilizes high-speed USB 2.0 with the ability to record on 8X DVD+R, 8X DVD+RW, 6X DVD-R, 5X DVD-RAM, and access 8X DVD-ROM and 5X DVD-RAM formats. The SDRW-08D2S-U does this by powering the unit through the USB ports so you don't have to carry any big and bulky power adapters, or hunt around for open power outlets.Additionally, it includes user-friendly burning software by Cyberlink. From backing up your songs to encrypting your secret data, it can all be done quickly with the easy to use ASUS Slim SDRW-08D2S-U.The data encryption feature in the provided software gives you a reassured peace of mind by protecting your most sensitive material with secure password protection. It also has the ability to hide file names from unwanted onlookers.The ASUS SDRW-08D2S-U encompasses a wide variety of high-grade features that easily makes it a must-have component for anyone looking to create CDs and DVDs on-the-go or at home.Key FeaturesPortable slim DVD Re-Writer designed to match your Eee family products or mini-notebooksRecord onto DVD-R (SL/DL), DVD+R (SL/DL), CD-R/CD-RW, DVD-RW and DVD-RAM quicklyPowered and connected by high-speed USB 2.0 ports for universal compatibility and convenienceDrag-and-drop software makes recording data simple and fastEncryption software included to help you backup sensitive documentsLearn MoreThe Perfect Companion for Your Eee PC (or any other mini-notebooks)The SDRW-08D2S-U is designed to be the perfect companion for your Eee family products or other mini-notebooks.With a compact and slim design, it is easy to carry, just like your Eee PC.Having the ASUS SDRW-08D2S-U alongside your Eee PC is like having a portable movie player. You can watch your favorite DVD movie anywhere you go.Its glossy surface and diamond-cut design also gives it a radiant shine that is elegant.With the universal USB 2.0 connectivity, you can attach it to any computers that have two USB 2.0 ports and have it work right away. No driver installation is necessary, it is as easy as plug-and-play.Think S.L.I.M.SimpleRecording data is simple with the SDRW-08D2S-U. Easily drag and drop media and files into the Cyberlink&rsquo;s thumbnail to create CDs and DVDs instantly.Low Power ConsumptionSave time while burning CDs and DVDs with low power consumption and high-speed data transfers via USB 2.0.ID DesignThe SDRW-08D2S-U stands out from the crowd with its elegant and eye catching diamond-cut design.MobilityThe ultra-slim design makes it easy to carry. The ability to power via only USB ports also mean that there are no big and bulky power adapters to carry around, just the included USB cable will do the trick.Record onto a Wide Array of Optical MediaThe ASUS SDRW-08D2S-U is slim but powerful. It can read and write to almost all of the DVD and CD formats available.Max. 8X DVD-ROM(SL)(DL)/ DVD+R/DVD+RW - ReadMax. 8X DVD+R/ DVD+RW - WriteMax. 5X DVD-RAM &ndash; Read &amp; WriteFor a complete list of read and write capabilities, please see the specification section.WarrantyASUS 1 Year Limited WarrantyASUS SDRW-08D2S-U External Optical Disk Drive comes with 1 year limited warranty.Please visitSupport.ASUS.comfor more details on ASUS optical storage warranty policy.What's in the BoxASUS SDRW-08D2S-U Black DVD Re-WriterUSB 2.0 Y Cable (dual type A plug and one mini-B plug)Software Disk (CyberLink Power2Go &amp; E-Green)Quick Installation GuideSpecificationsWrite Speed:DVD-R: 8XDVD-RW: 6XDVD+R: 8XDVD+RW: 8XDVD+R(DL): 6XDVD-R (DL): 6XCD-R: 24XCD-RW: 16XDVD-RAM: 5XRead Speed:DVD-R(Single): 8 X max.DVD-RW(single): 8 X max.DVD+R(Single): 8 X max.DVD+RW(single): 8 X max.DVD-R(DL): 6 X max.DVD+R(DL): 6 X max.DVD-ROM (Single): 8 X max.DVD-ROM (Dual): 8 X max.CD-ROM: 24 X max.CD-RW: 24 X max.CD-R: 24 X max.DVD video playback: 4 X max.VCD playback: 10 X max.Audio CD Playback: 10 X max.Access time:DVD: 160ms CD: 140msWriting Mode:DVD-R &amp; DVD-R(DL): DAO(Disc-At-Once)/Incremental Recording (Multi-Border Recording)DVD-RW &amp; DVD-RW (DL): DAO(Disc-At-Once)/Restricted Overwriting/Incremental Recording (Multi-Border Recording)DVD+R &amp; DVD+R (DL): Sequential Recording (Multi-Session Recording)DVD+RW &amp; DVD+RW (DL): Random RecordingCD-R/RW: DAO(Disc-At-Once)/TAO(Track-At-Once)/SAO(Session-At-Once)/Packet Recording (Multi-Session Recording)O/S Compatibility:Windows 7, Windows Vista, Windows XPInterface:USB 2.0Data Buffer:1 MBBundled Software:Cyberlink Power2Go, E-GreenDisc Diameters:12cm/8cmMounting Orientation:Vertical and Horizontal ( +5 &deg; ~ -5 &deg;)Power Requirements:USB Power +5V &plusmn; 5%Dimension(WxHxD):5.59 x 6.18 x 0.83 inchesNet Weight (estimated):0.69 lbs.All specifications are subject to change without notice.Color and bundled software versions are subject to change without notice.Brand and product names mentioned are trademarks of their respective companies.Product may not be exactly as shown in photos.Check out these related ASUS productsASUS External Blu-ray Combo Drive (SBC-06D1S-U)Upgrade to an external Blu-ray combo drive and enjoy the latest in HD entertainment. This ultra-slim external combo drive is easy to carry and does not require any external power sources, just like the SDRW. (Powers off the USB ports on your PC)ASUS WiCast Wireless Full HD Video Transmission KitTurn your PC into the ultimate wireless media center. Display Full HD on your big screen wirelessly with up to 30 ft of range via HDMI plug-and-play with the ASUS WiCast kit.ASUS RT-N13U Wireless N Router (with USB)Upgrade your network to faster performance and broader range with this EZ to setup wireless N router. You can even share an all-in-one printer with the peers in your network.ASUS Eee PC Seashell Optical Mouse (USB)The Seashell Optical Mouse is the ideal companion for your Eee PC Seashell. Its stylish and compact design ensures a hassle-free solution for on-the-go computing."}