{"asin": "B004E1L29Y", "categories": [["Office Products", "Office & School Supplies", "Desk Accessories & Workspace Organizers", "Platforms, Stands & Shelves", "Keyboard Drawers & Platforms"]], "description": "The Fellowes Professional Series Compact Keyboard Tray transforms a flat surface into a space-efficient work zone. Maximize your workspace area and improve your overall comfort and safety with this adjustable keyboard tray. Its lift-and-lock feature lets you move the tray to different heights using one hand, while a manual knob lets you control the tray's angle. This durable keyboard tray features Health-V memory foam wrist cushioning with Microban antimicrobial protection to keep the product cleaner and relieve wrist pressure to help prevent carpal tunnel syndrome.Professional SeriesCompact Keyboard TrayAt a Glance:Lift-and-lock feature lets you adjust the tray's height with one handSingle manual adjustment knob lets you adjust the tray's tilt up to -10 degreesKeyboard platform accommodates both right- and left-handed mousingHealth-V memory foam wrist supports with Microban antimicrobial protection stay cleaner and relieve wrist pressure to help prevent carpal tunnel syndrome.Compact, slim profile complements your workspaceLift-and-lock feature allows for quick, effortless height adjustments.View larger.Keyboard tray can be tilted up to -10 degrees to meet your comfort needs.View larger.Health-V memory foam wrist cushions offer protection from germs and injury.View larger.Adjustment Options Customize Your ComfortThis compact keyboard tray's convenient lift-and-lock feature lets you adjust the tray's height with one hand. A single manual adjustment knob lets you control the tilt of the keyboard tray up to -10 degrees for optimal comfort. The standard platform accommodates both right- and left-handed mousing.The platform's Warning Trak technology keeps your mouse from sliding off the mousing platform. In addition, non-skid pads prevent undesired keyboard movement so you can decrease potential distractions and accidents.Health and Safety Features for an Ergonomic WorkspaceYour work experience should not only be comfortable, but also safe. The Fellowes Professional Series Compact Keyboard Tray features Health-V memory foam supports with Microban antimicrobial protection. Your workspace stays cleaner and your wrists stay supported, relieving wrist pressure to help prevent carpal tunnel syndrome.This ergonomic keyboard tray also promotes a healthy posture by placing keyboard and mouse lower and closer to your body.Durable, Simple Design for Long-Term UseThis durable keyboard tray features a compact 17-3/4-inch glide track and a slim profile. It complements any workspace while staying out of the way. Ideal for smaller workspaces, the Fellowes Professional Series Compact Keyboard Tray lets you maximize your desktop work area.About FellowesFellowes Inc. is a global manufacturer and marketer of workspace products and solutions that enhance security, organization, and productivity in today's workplace. Designed and manufactured to offer superior quality, usefulness, and value, Fellowes' products range from business machines (paper shredders, binder machines, and laminators) to records storage solutions to a full line of accessories.Founded in 1917 by Harry Fellowes and headquartered in Itasca, Illinois, Fellowes Inc. employs more than 2,700 people throughout the world and has operations in 15 countries.What's in the BoxKeyboard tray, wrist supports, and installation guide.Recommended Companion Products and AccessoriesProfessional Series Back SupportFoot Rocker with Microban ProtectionSmart Suites Corner Monitor RiserMid-spinal support with memory foam promotes good postureLower lumbar support with three memory foam sections conforms comfortably to body curvatureTri-Tachment system eliminates the need for readjustmentRocking motion helps improve circulation and reduce fatigueMicroban antimicrobial protection keeps product cleanerFlip product over to adjust height--range is 2-3/4 to 4 inchesUnique shape fits neatly into desk corner to maximize workspaceElevates display to comfortable viewing height to help prevent neck strainThree height adjustments for customizable viewing comfort (from 3-7/8 to 5-1/8 inches)Main Product Benefit", "title": "Fellowes Professional Series Compact Keyboard Tray (8018001)", "price": 144.45, "imUrl": "http://ecx.images-amazon.com/images/I/41oxQC61hnL._SY300_.jpg", "brand": "Fellowes", "related": {"also_bought": ["B00439564O", "B0036FQ23A", "B004E1L25S", "B000ABA428", "B004UQ40IS", "B0010SY3L8", "B001B0BBTW", "B003VANO7C", "B005DPEHNI", "B000WTO52I", "B004V94F5C", "B0035EYGYO", "B00C5H5DN0", "B003V112MU", "B004SUO1GM", "B005ZLTNN4", "B0082DCPQ4", "B001B0DCOO", "B0046ZN8P4", "B004SUIM4E", "B007IP8NNQ", "B00009KH63", "B0006HVM5E", "B005BZNDOO", "B002R9HQLI", "B0043T7FXE", "B00CYX54C0", "B00E3W19MO", "B00BP5KOPA", "B000J09OLM", "B001UBJRFW", "B001E1Y5O6", "B000KZW9WM", "B0036RDOT8", "B000A6PPOK", "B004I2IFEO", "B0013CED4I"], "also_viewed": ["B001B0DCOO", "B00439564O", "B004E1L25S", "B000YTNKK4", "B001B0BBTW", "B001B0F1BQ", "B00006HQQ5", "B0019SY79C", "B00009U175", "B000JE9DUU", "B000TINEFG", "B001ASEZ2K", "B000ABA428", "B000ZPIM00", "B000MUUE86", "B001E0A3XY", "B0002LD0ZY", "B00314UCU0", "B001B09EH8", "B0002LCUNW", "B0006HVLFK", "B0002LCZP0", "B000BF51HG", "B000H0XBIG", "B000JE90G2", "B000AP6O32", "B0000C0XP5", "B001MS6T1I", "B0062MXHCS", "B0002LD0GI", "B00004Z6N4", "B0076O2IHG", "B004XJCJ12", "B001E683EO", "B008PAWG6S", "B001HA4DAK", "B002FAWBCS", "B0051MOFP8", "B0015DRRGQ", "B002YERS32", "B002FL3N5G", "B000PKVV5S", "B001AEND2W", "B000GLXWN0", "B003B430M2", "B00006B8MN", "B0015DVEZQ", "B0062MXHG4", "B000WTYM1M", "B0033UNHQ8", "B00006HQLC", "B001HA4D8C", "B005MDWT2C", "B00006RSX0", "B001LIK6LI", "B002FB3BLM", "BT008UKTMW", "B004E2LXUG"]}}