{"asin": "B001B90Q94", "related": {"also_bought": ["B00004Z5M1", "B005V22492", "B0002ABK8Y", "B000GLOI88", "B006X2FE1O", "B0083J7N78", "B001MSU1HG", "B007ED7V7G", "B005BZNDOO", "B00847UWUE", "B000067SON", "B00DDWT6NY", "B0036TGGW8", "B005V2259G", "B001A3ZH8Q", "B005G4YVNM", "B00450DVDY", "B00863ST92", "B00EO58Z5O", "B00ANX1G0C", "B006M1MFEA", "B007RHU1PS", "B000A6PPOK", "B006X2FDL0", "B0049MPQA4", "B008CJ1MTE", "B003VAHYNC", "B005CT56R6", "B003ZWHTMW", "B003VAGXZC", "B003Y24DEU", "B003HLJW62", "B008ABLJHE", "B00D601UC8", "B000R9AAJA", "B003VANO7C", "B0007T27H8", "B005DWUOXI", "B005S0WW6M", "B002K0TU2C", "B009H0XQRS", "B000BNI8IW", "B00066HJBG", "B003YFHCKY", "B004GHMU5G", "B007B5YUMQ", "B008ABLJC4", "B005ZWP9O0", "B005V225KK", "B005S0WXZM", "B00E3W19MO", "B0074ZN27C", "B008OG5W3M", "B001J8DHV6", "B00ENRLCQW", "B009SM8GJ8", "B001S4OTS6", "B003DXPCGI", "B0027JIIKQ", "B00BQU141C", "B008R7FC74", "B000V7PAWA", "B004KPGPXW", "B000UX21PY", "B0012W9APQ", "B006ZZGDH8", "B007BZ1092", "B00002EQCW", "B005SHQ644", "B004SUO1R6", "B001PPVX8W", "B005V224Q0", "B00439GOL8", "B00D78QCYK", "B002JCSCYS", "B007KPNTSI", "B009SPWJ98", "B001F0R1FG", "B0099F823E", "B003YFHBE6", "B00E3W1726", "B005O55TDO", "B00ECDM78E", "B002YIG9AQ", "B009SPUZCQ", "B008NP76FQ", "B006GTDAE2", "B000JV3CKA", "B002XXEVPW", "B00DSUTWMQ", "B0081TYO72", "B001MSZBNA", "B001F0GASU", "B009QBIZ60", "B00BP5KOPA", "B008Y8E1XC", "B001QUA6RA", "B00009KYCN", "B00006BBIF"], "bought_together": ["B00004Z5M1"], "buy_after_viewing": ["B007TN1J2O", "B008HBFADQ", "B00EO58Z5O", "B00EKW6JZ4"]}, "title": "Epson B11B190011 WorkForce GT-1500 Document Scanner", "price": 183.75, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41AyjAtyO1L._SX300_.jpg", "brand": "Epson", "categories": [["Office Products", "Office Electronics", "Scanners & Accessories", "Scanners", "Document Scanners"]], "description": "From the Manufacturer Get superior image quality and enhanced productivity from the WorkForce GT-1500 color document imaging scanner. This easy-to-use scanner offers the versatility you need to electronically archive important documents or share records with your workgroup. And, with 1200 x 2400 dpi resolution, it delivers truly amazing quality, so you can capture every detail - all with easy, one-touch scanning.This powerful performer makes it easy to scan stacks of records, applications and forms. Use the high-capacity Automatic Document Feeder to quickly scan a variety of sizes up to 8.5x14. The WorkForce GT-1500 speeds through scans up to 20 pages per minute, giving you more time to tackle other tasks. And, it not only offers greater productivity, it ensures more efficient operation. With innovative ReadyScanTM LED technology, there&rsquo;s no warmup time required. Best of all, this  LED technology does not include any mercury, and it reduces power consumption.The smart choice for all your document imaging needs, the WorkForce GT-1500 includes a powerful software package. ABBYY&reg; FineReader&reg; Sprint Plus OCR allows you to create editable text from scans, while ScanSoft&reg; PaperPort&reg; makes it easy to organize all your documents. Use Epson Scan to create multi-page PDFs, or to copy or send scans as e-mail attachments. It&rsquo;s all right at your fingertips with the WorkForce GT-1500, a powerful performer available at an amazing value.The Epson WorkForce GT-1500 uses the innovative ReadyScan&trade; LED technologyThe Epson WorkForce GT-1500 is certified with popular document imaging ISVs such as Kofax and CaptivaReadyScan&trade; LED technologyThis energy-efficient light source uses less power, while ensuring greater productivity. And, there's no warmup time required. Best of all, with no mercury included, this LED technology is better for the environment.Compatible with popular document imaging applicationsThe Epson WorkForce GT-1500 includes both Epson Scan TWAIN and EMC Captiva ISIS drivers for compatibility with popular document imaging applications from independent software vendors. The WorkForce GT-1500 has also been certified by Kofax, one of the leading ISVs.What the press is saying:\"Based on its very good overall performance, and lower than average price, BLI highly recommends the Epson WorkForce GT-1500 for workgroups and office with simplex scanning needs.\"Staff, Buyer&rsquo;s Laboratory (10.01.2008)\"The WorkForce GT-1500 is Epson's answer to the growing need in small businesses for a fast document-focused scanner that can scan multiple pages of text in short order. The results with photos weren't disappointing either, making the scanner more versatile than we expected. Unless you require film- and slide-scanning capabilities, this could be the scanner your home or office needs to eliminate those growing stacks of paper.\"Chris Holt, Macworld (10.23.2008)\"Anyone who needs a reasonably priced simplex document scanner should give serious consideration to the Epson WorkForce GT-1500.\"Richard Jantz, PC World (7.01.2008)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Versatile scanning of documents and photosThe Epson WorkForce GT-1500 features a 40-page automatic document feeder capable of scan speeds up to 20 ppm black-and-white, 12 ppm color (Letter-size, 200 dpi, Speed Priority scanning mode). The ADF handles documents from 5.9x5.9 to 8.5x14 inches at up to 600 dpi.The Epson Scan driver Office Mode provides all the tools for getting the best results from your document scans with text enhancement, color dropout, color enhance and threshold controls. Use Epson Scan to create searchable-text PDF files and double-sided documents with manual duplexing.For scanning photos, simply lift the ADF and place the images on the 8.5x11.7 inch flatbed for reflective scanning up to 1200 dpi. Use Home Mode in Epson Scan for basic scanning controls or Professional Mode with advanced correction tools including histogram and tonal curves. Both Home and Professional Mode allow you to use the Epson Easy Photo Fix&reg; features such as one-touch color restoration for faded photos.The compact WorkForce GT-1500 features six front panel push buttons.One-touch scanning in a compact designThe Epson WorkForce GT-1500 features five front panel push buttons for one-touch scanning: Scan, Copy, E-mail, PDF and Cancel along with a Power button and indicator lights. At only 18.5 inches wide, 12.5 inches deep and 4.8 inches tall, the WorkForce GT-1500 is the perfect scanner for the home or small office where desk space is a premium.Features/BenefitsAchieve superior clarity and detail with remarkable 1200 x 2400 dpi resolutionEnjoy greater productivity with scans up to 20 ppmQuickly scan stacks of documents with the high-capacity Automatic Document Feeder- holds up to 40 pages at one time, for quick and efficient scanningOrganize scanned documents with the easy-to-use document management software includedTake on any project with easy, one-touch scanningScan originals in a variety of sizes &mdash; from 5.9x5.9 to 8.5x14Enjoy more efficient operation with exclusive ReadyScan LED technology &mdash; no warmup time and fast scanning speedsRest easy with  LED technology - no mercury included and lower power consumptionWhat&rsquo;s in the BoxEpson WorkForce GT-1500 document imaging scanner; Scanner installation CD-ROM and Electronic User&rsquo;s Guide; Start Here poster; Hi-Speed USB 2.0 cable; AC power adapter."}