{"asin": "B00004SB92", "categories": [["Electronics", "Computers & Accessories", "Routers"]], "description": "The Linksys EtherFast cable/DSL router connects multiple PCs to a high-speed broadband Internet connection or to an Ethernet backbone. Configurable as a DHCP server, the EtherFast router acts as the only externally recognized Internet device on your local area network (LAN). The router can also be configured to block internal users' access to the Internet. A typical router relies on a hub or a switch to share its Internet connection, but the Linksys EtherFast router channels this connection through the full-duplex speed of its built-in EtherFast 10/100 four-port switch. This combination of router and switch technology eliminates the need to buy an additional hub or switch and serves your network as a completely dedicated, full-duplex backbone. Now your entire network can enjoy broadband Internet connections supported by its switched backbone. This unit requires an external cable or DSL modem with an Ethernet RJ-45 interface. This product comes with a one-year warranty.Note: All Linksys routers now include a special edition of Norton Internet Security! Claim your free CD-ROM by calling (800) 814-0180, 7 a.m. to 7 p.m. Pacific, seven days a week.", "title": "Cisco-Linksys BEFSR41 EtherFast Cable/DSL Router with 4-Port 10/100 Switch", "price": 74.99, "salesRank": {"Electronics": 5713}, "imUrl": "http://ecx.images-amazon.com/images/I/41MYKJ03NAL._SX300_.jpg", "related": {"also_bought": ["B00003006K", "B00005KAC7", "B00005854F", "B001N4ISZ6", "B0001D3K8A", "B000051SGX", "B00006I5XC", "B000BTL0OA", "B00004Z5H3", "B00000JDF5", "B00002EQCW", "B00007KDVJ", "193890818X", "B00006G2OJ", "B004TLIVB6", "B0083J8DKE", "B00000J1V5", "B004T9RR6I", "B0016897GS", "B004MOGVGW", "B00D1FXX96", "B0038ZTZ3W", "B00006RVPW", "B008I647MA", "B0000BVYT3", "B0012BNKC6"], "bought_together": ["B00003006K", "B00000JDF5"], "buy_after_viewing": ["B000BTL0OA", "B004NBZ98K", "B002OMX0XQ", "B003CFATSS"]}}