{"asin": "B0007VMROE", "related": {"also_bought": ["B000BGRRXQ", "B000I1D2M4", "B000WMEC1E", "B0000E0ZM0", "B001653Z1O", "B000BGMZG0", "B004877NLK", "B000BI7NHY", "B000EG4GLY", "B0000DB4D1", "B0001W05IE", "0072263792", "B00487B730", "B0003V577C", "B004879IJK", "B00062GJ8O", "B0007T9IQ6", "B0014C819K", "B00063ZVJQ", "B0007RIXX2", "B00005Y1Z7", "B000BI2180", "B002YMJOFO", "B000ITLZ02", "B00005AWBJ", "B002LAW208", "B000BIFPEC", "B008I638AM"], "bought_together": ["B000BGRRXQ", "B000I1D2M4"], "buy_after_viewing": ["B000BI7NHY", "B000WMEC1E", "B000I1D2M4", "B000BGRRXQ"]}, "title": "Palm Tungsten E2 Handheld", "price": 109.99, "salesRank": {"Electronics": 5934}, "imUrl": "http://ecx.images-amazon.com/images/I/41gvbsK6kAL._SY300_.jpg", "brand": "Palm", "categories": [["Electronics", "Computers & Accessories", "PDAs, Handhelds & Accessories", "PDAs & Handhelds"]], "description": "From the Manufacturer Wherever your life is going, this is the perfect handheld to take along for the ride. The sleek, stylishly designed Tungsten E2 handheld from palmOne brings your entire world to life. Your calendar, contacts, documents, presentations, photos and videos look sharper and more colorful. But just as important, its new flash memory keeps all that information safe -- even if you don't have time to recharge.See adetailed digramof the E2's features.Of course, it wouldn't be a palmOne handheld if we didn't push the boundaries of what a handheld can do. That's why we included Bluetooth wireless technology for wireless connectivity. Now working and communicating will be that much easier. Taking work to go? View and even edit spreadsheets and word processing documents right on your handheld. Plus you can sync your calendar and contacts from Outlook. And don't forget to grab your MP3 tunes. You're going places.Brighter, richer color display:See your information clearly indoors and out. Brighter display, better color saturation brings photos and videos to life.Non-volatile, flash memory:There's more than enough room to hold your calendar, contacts, applications, photos, and even your spreadsheets or presentations. And because it's flash memory, the information on yourhandheld is protected -- even if you're on the go and don't have time to recharge.Built-In Bluetooth: Stay connected. With built-in Bluetooth wireless technology, you can synchronize with yourdesktop without wires getting in the way. Use your Tungsten E2 handheld with a compatiblephone to send email and text messages, or to check news headlines on the Web.Documents To Go:Productivity in your pocket. The Tungsten E2 comes with Documents To Go, which lets youcarry Word, Excel, and PowerPoint files-so you can be more productive wherever you are. And with a simple conversion step, you can even view Acrobat PDFs."}