{"asin": "B000MUUE86", "categories": [["Office Products", "Office & School Supplies", "Desk Accessories & Workspace Organizers", "Platforms, Stands & Shelves", "Keyboard Drawers & Platforms"]], "description": "Improve your comfort and safety with the versatile, adjustable Fellowes Professional Series Executive Keyboard Tray. Designed and manufactured for Fellowes by Humanscale, the keyboard tray features a mouse platform and keyboard tray that are easy to adjust. The Comfort-Lift system lets you slide the mouse platform left or right over the keyboard numeric pad, while height and tilt indicators let you customize the keyboard tray settings. This durable keyboard tray features Health-V memory foam wrist supports with Microban antimicrobial protection to keep the product cleaner and relieve wrist pressure, helping to prevent carpal tunnel syndrome.Professional SeriesExecutive Keyboard TrayAt a Glance:Designed for standard-sized workstationsComfort-Lift system lets you slide mouse platform left or right over keyboard numeric padLift-and-lock feature lets you adjust the tray height with one handHealth-V memory foam wrist supports with Microban antimicrobial protection stay cleaner and relieve wrist pressure to help prevent carpal tunnel syndromeEasy-to-read height and tilt indicators let you customize keyboard tray settingsKeyboard platform accommodates both right- and left-handed mouse useErgonomically designed with Health-V memory foam supports to help relieve wrist pressure.View larger.Fully customizable keyboard height and tilt settings.View Larger.Adjustment Options Customize Your ComfortThe Fellowes Executive Keyboard Tray offers height and tilt controls that help you maximize your comfort while typing. The Comfort-Lift system lets you slide the mouse platform left or right over the keyboard's numeric pad. Additionally, the mouse platform can be tilted forward and backward, and it has two height positions for optimal comfort.The keyboard tray is adjustable as well, and accommodates both right- and left-handed mouse use. Height and tilt indicators help you to position the keyboard where it's most comfortable, and a convenient lift-and-lock feature makes it easy to adjust the tray height with one hand. A single lever adjusts the tilt up to -10 degrees.The mouse platform's Warning Trak technology keeps your mouse from sliding off. In addition, nonskid pads prevent undesired keyboard movement, so you can decrease potential distractions and accidents.Health and Safety Features for an Ergonomic Work SpaceYour work experience should not only be comfortable, but also safe. The Executive Keyboard Tray features Health-V memory foam wrist supports with Microban antimicrobial protection. Your work space stays cleaner, and your wrists stay supported, relieving wrist pressure to help prevent carpal tunnel syndrome.This ergonomic keyboard tray also promotes a healthy posture by placing keyboard and mouse lower and closer to your body.Comfort-Lift system lets you slide mouse platform left or right over keyboard numeric pad.View larger.Durable, Simple Design for Long-Term UseThis durable keyboard tray features a 21-3/4-inch glide track designed for standard-sized work spaces. It complements most any work space while staying out of the way.About FellowesFellowes, Inc. is a global manufacturer and marketer of work-space products and solutions that enhance security, organization, and productivity in today's workplace. Designed and manufactured to offer superior quality, usefulness, and value, Fellowes's products range from business machines (paper shredders, binder machines, and laminators) to records storage solutions to a full line of accessories.Founded in 1917 by Harry Fellowes and headquartered in Itasca, Illinois, Fellowes Inc. employs more than 2,700 people throughout the world and has operations in 15 countries.What's in the BoxKeyboard tray, wrist supports, and installation guide.Recommended Companion Products and AccessoriesProfessional Series Back SupportFoot Rocker with Microban ProtectionSmart Suites Corner Monitor RiserMid-spinal support with memory foam promotes good postureLower lumbar support with three memory foam sections conforms comfortably to body curvatureTri-Tachment system eliminates the need for readjustmentRocking motion helps improve circulation and reduce fatigueMicroban antimicrobial protection keeps product cleanerFlip product over to adjust height--range is 2-3/4 to 4 inchesUnique shape fits neatly into desk corner to maximize workspaceElevates display to comfortable viewing height to help prevent neck strainThree height adjustments for customizable viewing comfort (from 3-7/8 to 5-1/8 inches)Main Product Benefit", "title": "Fellowes Professional Series Executive Keyboard Tray (8036101)", "price": 149.84, "imUrl": "http://ecx.images-amazon.com/images/I/41loHfOAUoL._SX300_.jpg", "brand": "Fellowes", "related": {"also_bought": ["B000TINEFG", "B0036FQ23A", "B000LVJ9W8", "B000JE9DUU", "B0002LD0ZO", "B003VAHYNC", "B00689HXI4", "B004C3ZPEW", "B004SUIM4E", "B003LCITWA", "B003VANO7C", "B003VAGXWK", "B003NR57BY"], "also_viewed": ["B000JE9DUU", "B001B0DCOO", "B000TINEFG", "B004E1L29Y", "B004E1L25S", "B001B0F1BQ", "B0019SY79C", "B000YTNKK4", "B00006HQQ5", "B001B0BBTW", "B00439564O", "B001B09EH8", "B001ASEZ2K", "B00009U175", "B001E0A3XY", "B0006HVLFK", "B000JE90G2", "B000BF51HG", "B00314UCU0", "B0002LCZP0", "B0002LD0ZY", "B0002LCUNW", "B0002LD0GI", "B002YERS32", "B003B430M2", "B000ABA428", "B000ZPIM00", "B000AP6O32", "B0051MOFP8", "B0050K7HGK", "B0000C0XP5", "B008PAWG6S", "B001E683EO", "B0062MXHCS", "B00004Z6N4", "B000GLXWN0", "B0033UNHQ8", "B000H0XBIG", "B0076O2IHG", "B001HA4DAK", "B002FAWBCS", "B00006RSX0", "B00006B8MN", "B004XJCJ12", "B00006HQLC", "B001MS6T1I", "B002FL3N5G", "BT008UKTMW", "B000WTYM1M", "B001LIK6LI", "B001AEND2W", "B00KIF6HGS", "B001949G2E", "B00K5JY6ME", "B008PAWFSM", "B0062MXHG4", "B008PAWIAM", "B004IVJ3UK", "B00JKVFUKA"]}}