{"asin": "B002FB684E", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Network Adapters", "Powerline Network Adapters"]], "description": "From the Manufacturer Turn your home's electrical system into a high-speed network with the NETGEAR XAVB1004 Home Theater Internet Connection Kit. With the ability to connect up to four devices without running new wires or making costly renovations, this kit is the ideal solution for securely connecting your XBox or Playstation, computers, TiVos, and more to your home network and the Internet.Turn any electrical outlet into a high-speed network connection for up to 4 devices.View larger.Plugging your router into the included adapter turns your electrical system into an entertainment-grade network.View larger.&nbsp;The NETGEAR&reg;Home Theater Internet Connection Kit:Turns your home's electrical system into a high-speed network.Lets you connect up to 4 devices to your network via a single electrical outlet.Supports speeds up to 200 Mbps and covers up to a 5,000-square-foot home.&nbsp;View \"Powerline in a Nutshell\" VideoTurn Your Electrical System into a Secure, High-Speed NetworkWith the NETGEAR&reg;XAVB1004 Home Theater Internet Connection Kit, gone are the days of drilling holes in your walls and running cable through your house so you can connect to the Internet. This secure, high-speed, adapter kit turns any standard electrical outlet in your home into a high-speed entertainment-grade network connection.The kit includes one Powerline XAV101 AV Ethernet Adapter, which you plug into your router, and one Powerline XAV1004 AV Adapter with 4-Port Ethernet Switch, which you plug into an outlet in any room where you want a network connection. Once you plug the adapters in, within minutes you'll have a high-speed network throughout your home.The XAV1004 AV Adapter includes four Ethernet ports, letting you connect up to four devices -- such as laptops, network attached storage devices, DVRs, media streamers, Blu-Ray DVD players, or game consoles -- to your network via a single electrical outlet.Port-Based Quality of Service (QOS) Prioritizes your Bandwidth UsageBecause the unit features port-based Quality of Service (QoS), you can decide which devices receive bandwidth priority, ensuring that the performance of your highest priority device is not impeded by any spikes in your bandwidth demand.This means that if you've prioritized your Xbox 360TMor other game console and you're in the middle of an online game, you won't be interrupted or delayed by another user on your network trying to download a video or access the Internet. The system will automatically regulate bandwidth use, prioritizing the Xbox network traffic over other traffic on the same network.By simply pushing a button, without using a PC or Mac, the kit also gives you the option of securing your network connection with 128-bit AES data encryption for privacy and security.Supports Speeds up to 200 MbpsThe Home Theater Internet Connection Kit supports speeds up to 200 Mbps, enough for streaming high-definition video and MP3s, transferring large files, making Internet calls, and more. As long as your electrical outlets in your home are electrically connected, the XAVB1004 will typically provide home-network coverage up to 5,000 square feet.And to help you get the fastest speed out of your connections, NETGEAR Pick-a-Plug technology provides red, yellow and green status LEDs that indicate the signal strength and speed through your house so you can find the best outlets to use.Perfect for Xbox, Playstation, TiVo, ReadyNAS and MorePerfect for creating a connectivity hub by your home theater, by placing the XAV1004 near your television, you can easily connect your Xbox 360 or Playstation 3 to your network, giving you the high-speed connection you need. The adapter can also connect other media devices, such as your TiVo, AppleTVTM, SlingboxTM, DVR, BD Live-enabled Blu-Ray player, Ethernet-enabled TV, and more.By connecting a network attached storage device, such as theReadyNASTMDuo, to the adapter, you can give anyone in your home direct access to the media and other files stored on the device. And, by simply adding additional expansion units, like thePowerline AV Ethernet Adapter Kit (XAV101)orPowerline AV Adapter with Ethernet Switch (XAV1004), you can continue to expand your Powerline network as your needs growNo drilling. No mess. No wires. Creating a high-speed and secure home network couldn't be any easier.The XAV1004 Adapter with Ethernet Switch measures 5.40 x 4.01 x 1.10 inches, and the XAV101 AV Ethernet Adapter measures 3.86 x 2.83 x 1.57 inches. The kit is supported by a NETGEAR 1-year warranty.What's in the BoxOne Powerline AV Adapter with Ethernet Switch (XAV1004); one Powerline AV Ethernet Adapter (XAV101); one 1.82 m (6 ft.) AC power cord; two 1.52 m (5 ft,) Ethernet cables; setup CD and product documentation.View the schematicto see howyour electrical system can become a high-speed network.Port-based Quality of Service prioritizes your bandwidth usage.View larger.Related NETGEAR Products to Enhance Your Home Theater Internet Connection Kit ExperienceNETGEAR Powerline AV Adapter with Ethernet Switch (XAV1004)Ideal way to add high-speed network connections to your home without rewiringConverts standard electrical outlets into high-speed network connectionsConnects up to 4 devicesPerfect for connecting HDTVs, Blu-ray players, and game consoles to your home network&nbsp;NETGEAR Digital Entertainer Elite HD (EVA9150)Plays your digital media from your computer or NAS to your HDTVStreams Internet content, such as YouTube, directly to your HDTV500 GB hard drive for extra storage of music, photos and videoNETGEAR Digital Entertainer Live (EVA2000)Plays your digital media collection directly to your TVStreams Internet video, such as YouTube, Netflix and Hulu, on your TVFor use with analog and high-definition TVs&nbsp;NETGEAR Rangemax Dual Band Wireless-N Gigabit Router (WNDR3700)Top-of-the line router, ideal for serious gamers, videophiles, and small businesses demanding high performanceDual-band Wireless-N operates simultaneously on 2.4 and 5.0 GHz frequencies for highest throughput speed and performance600 Mbps speed, with real throughput of over 350 MbpsPush 'N' Connect feature for easy setupNETGEAR Wireless-N Router (WNR2000)Wireless-N performance for ultra-fast speed and performanceIdeal for streaming videos and other high-bandwidth multi-media filesBackwards compatible with older Wireless-G devicesPush 'N' Connect for easy set-up process&nbsp;NETGEAR ReadyNAS Duo 2-Bay 1TB (1 x 1000GB)Award-winning network attached server streams music, photos and video to network media players without a computer1 TB of storage with GigaBit Ethernet for fast data transferAllows multiple users share files simultaneouslyNETGEAR-exclusive X-RAID technology keeps your digital media and files protected", "title": "NETGEAR XAVB1004-100NAS Home Theater Internet Connection Kit (Black)", "price": 159.99, "imUrl": "http://ecx.images-amazon.com/images/I/41dhMCQm6aL._SY300_.jpg", "brand": "Netgear", "related": {"also_bought": ["B006OOKT3Y", "B004PA9PBQ", "B00000J1V5", "B00000JDF5", "B0046SQ8VW", "B00004Z5AN", "B007ZT1PAI", "B009WG6JJO", "B007SM2EAM", "B008I647AM", "B007ILFFS6", "B00004Z5H3", "B0049SCB2Y", "B0052SCU8U", "B004OVECU0", "B0000BVYT3", "B00870ZHCQ", "B007I5JT4S", "B001TH7GVE"], "bought_together": ["B00000JDF5", "B00000J1V5"], "buy_after_viewing": ["B004PA9PBQ", "B008EQ4BQG", "B009WG6JJO", "B006OOKT3Y"]}}