{"asin": "B00004S99R", "description": "To say thatShenmueis an anticipated title is an understatement;  the game made huge waves in Japan upon its release, and American gamers have  been waiting since then to see what the fuss is all about. It's a game in which  the concept itself is the selling point. What if you could portray a young hero  in a fully realized Japanese city? Would you like to participate in and  influence an over-the-top kung fu-style action-mystery flick in your living  room? What if lots of combat, cinematic flourish, detail, and a dash of romance  were thrown in?The game itself is awash in small details, crammed into a confined space. The  city of Yokusuka circa 1986 is rendered beautifully in a short series of  neighborhoods that are long on detail even if short on variety. The story itself  is ripped straight from a chopsocky flick: you portray the young hero Ryo  Hazuki, whose father (a kung fusensei, naturally) is killed before his  very eyes by a mysterious and frightening villain. Ryo must uncover the identity  of the killer and fight his way through the city in an effort to avenge this  wrongful death.Shenmue's Yokusuka might be short on space--in total, it represents maybe  a square mile--but the detail is overwhelming. You can interact with nearly  every person or object that you see; 300 citizens go about their daily routines,  and whom you encounter is as much determined by where you are as when you are  there.Much of this interaction involves combat that ranges fromDragon's Lair-style reaction tests (such as timing a button press to  dodge an oncoming car) to freeform kung fu fighting. Further, each second of  real time equals about a minute of game time, and Ryo has to be home by 11 p.m.  each evening. The game moves at a brisk pace, and each challenge or battle feels  like a race against time. Some might say that gaming doesn't get shallower than  this (you are essentially performing tasks and exploring, instead of gaming),  but the game feels like no other and is ultimately satisfying by the time that  it all ends. In this way,Shenmueis more than a game--it's an event  that's worth experiencing.--Andrew S. BubPros:Compelling, well-told storyGood action and combatFantastic sound and graphicsCons:Plot is familiar to fans of kung fu action filmsTask-and-exploration gameplay might seem slow to action gamers", "price": 72.99, "imUrl": "http://ecx.images-amazon.com/images/I/617THvy13WL._SX300_.jpg", "related": {"also_bought": ["B00000K2R4", "B00004SA3J", "B00000K3X9", "B00000K125", "B000IVF2VS", "B0000488VP", "B00006IJIS", "B00004S99S", "B00HPU96FI", "B00000K2R6", "B00000K10U", "B00004WLVV", "B000059Z7G", "B002GC5YMY", "B00004S99N", "B00005LOYC", "B00004UDVL", "B00004SWL9", "B00004R8V4", "B00004KHAE", "B00000K10O", "B00000K13K", "B00001P4Y6", "B0000488VO", "B000059Z7H", "B00004KHAG", "B00004SR5M", "B00000K2R5", "B00005A775", "B001QVDSRO", "B00004T4XI", "B000A7I7M6", "B000028U2E", "B000058513", "B000VZICX6", "B00004SA3R", "B000035YBP", "B00002EQAP", "B00002970R", "B00000K4BU", "B00004SA3U", "B00001ZWUQ", "B00004T4XJ", "B00004WMVK", "B00004TEXF", "B00004SR5H", "B000SL4IIG", "B0000488VR", "B00004RBOV", "B00004R9FG", "B00005CDR8", "B00004T4XO", "B008FPMBNG", "B00000SWOY", "B0000488VT", "B00004RC1Y", "B00000K117", "B00002971H", "B0000A09EN", "B004H60Y0E", "B00004SVBP", "B00004R9FI", "B0000568U1", "B00004S99M", "B00000K2R7", "B00005Q8M4", "B00000K2R8", "B00000TBQQ", "B00KVRK39A", "B000059Z7F", "B000038ABO", "B00005NEAG", "B00L3LQ4B4", "B00000K11O", "B00000K4C9", "B00004XONQ", "B00001WQI5", "B00004U62B", "B000055YVY", "B006JW6L7O", "B000038IFX", "B0000296NT", "B00003O9KF", "B00006LELI", "B00004R9FF", "B00002SV0U", "B000FIVC2W", "B00000K4C7", "B000034DLH", "B00001X50M", "B00002STUI", "B00000K115", "B00008VFBV", "B00004TEQD", "B00000K119"], "bought_together": ["B00004SA3J"], "buy_after_viewing": ["B00004SA3J", "B000IVF2VS", "B00000K3X9", "B00000K2R4"]}, "salesRank": {"Video Games": 4872}, "categories": [["Video Games", "More Systems", "Sega Dreamcast", "Games"]]}