{"asin": "B000204SWE", "description": "Amazon.com Product Description Tap into multimedia fun with Philips' broad-format, high-style, and ultra-slim DVP642 DVD player. The DVP642 is not only a high-end progressive-scan DVD player equipped to offer scintillating images on high-definition and HD-ready TVs, it's a tech-savvy player that spins your MP3- and JPEG-encoded recordable CDs (as well as Kodak's and Fuji's variants of the same) and CDs loaded with MPEG-4 and DivX video (3.11, 4.x, and 5.x files), perfect for viewing Internet-sourced content in your home theater. Want more? The player also converts Region 1/All Region PAL-formatted discs (the video standard in Europe) for viewing on standard NTSC televisions (and vice-versa, if only for video CDs).The DVP642's progressive-scan functionality allows compatible TVs to display the even and odd numbered lines of an image in a single pass. This minimizes screen flicker, which is easier on your eyes.Whether your living room is currently home to an HDTV or you're merely thinking of &quot;someday,&quot; the DVP642 stands ready to deliver the full potential of your DVDs. Progressive scanning, referred to as 480p for the number of horizontal lines that compose the video image, creates a picture using twice the scan lines of a conventional DVD picture, giving you higher resolution and sharper images while eliminating nearly all motion artifacts.Playback options include five-disc resume, which lets you pick up where you left off on your five most recently viewed DVDs (not applicable for MP3 or JPEG CDs), disc-lock parental controls, and picture zoom for magnification of select images.The player will play JPEG images one by one automatically, letting you zoom in, rotate, or flip the picture vertically or horizontally. For MP3 playback, the player offers track time display, album and track selection, and repeat (disc/album/track). The DivX media format is MPEG-4 based video compression that lets you save large files like films, movie trailers, and music videos on recordable media.Philips' 4x video upsampling offers smoother images even when viewing interlaced (nonprogressive) signals through the player's component-video, S-video, or standard composite-video outputs. SmartPicture provides optimum picture settings for color, brightness, saturation, contrast, sharpness, etc., to enhance your overall viewing experience at all times.The player will play JPEG images one by one automatically, letting you zoom in, rotate, or flip the picture vertically or horizontally. For MP3 playback, the player offers track time display, album and track selection, and repeat (disc/album/track). The DivX media format is MPEG-4 based video compression that lets you save large files like films, movie trailers, and music videos on recordable media.A set of left/right analog-audio outputs channel audio to Dolby Pro Logic receivers and stereo televisions. Dolby Digital 5.1-channel surround-sound signals can be routed through the player's digital-audio outputs (one each of RCA coaxial and Toslink optical) for direct connection to a full-featuredaudio/video receiver.What's in the BoxDVD-Video player, remote control with batteries, a user's manual, and an analog audio/composite-video interconnect.", "title": "Philips DVP642 DivX-Certified Progressive-Scan DVD Player", "price": 69.8, "imUrl": "http://ecx.images-amazon.com/images/I/31Y30KWTEVL._SY300_.jpg", "related": {"also_viewed": ["B004BI6MVS", "B00FW7ATEI", "B003LWXJ2A", "B0065907GC", "B004SBHSZ2", "B005625SJK", "B0045PKK60", "B00C8SHXKW", "B00GXTUTN0", "B007F9XHBI", "B008PB8XN2", "B007BYLO4E", "B004CYWVAM", "B0012KHNZW", "B00BN9CH26", "B004LNMAAA", "B007F9XHAY", "B004K3C9JI", "B00B83LU70", "B003ZFRA00", "B004612IWM", "B008MWLHX2", "B001IBHUU8", "B00264GMOG", "B004ZP756S", "B004PJLNYE", "B0039XRUBM", "B009CK9H6W", "B003ANVQWU", "B003EX0BVS", "B004AMHA0C", "B003V8SPQE", "B000N23JL2", "B003AJ7ODY", "B004QIPKNY", "B001AXBGZO", "B003E4M4WQ", "B002CO6GUK"], "buy_after_viewing": ["B007BYLO4E", "B007BYLO4E", "B004BI6MVS", "B007F9XHBI", "B0002L5R78"]}, "categories": [["Electronics", "Television & Video", "DVD Players & Recorders", "DVD Players"]]}