{"asin": "B000HJPK0Y", "description": "The versatile, affordable Nikon 18-135mm f3.5-5.6G ED-IF AF-S DX Zoom-Nikkor lens is engineered for use exclusively with Nikon's DX format digital SLR cameras. It has a broad focal length range (providing picture angle performance approximating a 28-200mm lens on a 35mm film SLR camera) that is suitable for a wide variety of shooting situations, ranging from wide-angle landscapes to portraits, recreational sports, action and close-ups. This new lens offers a selection of Nikon's highly regarded technologies such as compact Silent Wave motor (AF-S) for super fast and quiet autofocus operation, Extra-Low Dispersion glass (ED) for minimized chromatic aberrations, and Internal Focusing (IF) for convenient and balanced handling.Features:Versatile, High-power 7.5x Zoom-Nikkor lens (approximates the picture angle performance of a 28-200mm lens on 35mm SLR).A Nikon Extra-Low Dispersion (ED) glass element delivers superior optical performance. ED glass minimizes chromatic aberrations, contributing to superb contrast and resolution performance.Internal Focus (IF) provides fast and quiet auto focusing without changing the length of the lens, retaining subject-working distance through the focus range.Focus as close as 1.47 feet throughout entire zoom range.Non-Rotating front element provides for convenient use of circular polarizing filters and the Nikon Wireless Close-Up Speedlight System.A compact Silent Wave Motor (SWM) enables fast and quiet autofocusing, along with quick switching between autofocus and manual operation (M/A and M).A seven-blade rounded diaphragm opening, out-of-focus elements appear more natural.67mm filter attachment size.", "title": "Nikon 18-135mm f/3.5-5.6G ED-IF AF-S DX Zoom-Nikkor Lens for Nikon Digital SLR Cameras", "price": 598.0, "imUrl": "http://ecx.images-amazon.com/images/I/51QHNX6JN8L._SX300_.jpg", "related": {"also_bought": ["B002K42W6E", "B00004ZCJK", "B00004ZCFQ", "B0069R7FFQ", "B000BY52NK", "B0000BZM56", "B000HGMX5M", "B0042X9LC4", "B004V4IWHY", "B000ZMCILW", "B001EO6W8K", "B00005LEN4", "B003N2THPQ", "B0002EMY9Y", "B001S2PPT0", "B003ZYF3M8", "B005UG3KS8", "B00AXTQQDS", "B00015GYU4", "B0042X9L6A", "B001ET5U92", "B005HTP7MK", "B0046141OA", "B005PREXF6", "B007VGGIB6", "B00BI9X7UC", "B000VJX7DW", "B0001WE6U2", "B008KWSU02", "B0049VZ4XE", "B0009HN57E", "B004LEAYXY", "B005EP26J4", "B004RG7Y16", "B00BXA7N6A", "B001UE6N88", "B00006JN3G", "B004KU827O", "B002VPE1WK", "B003ZSHNCC", "B007VGGFZU", "B0045KGZOG", "B0099XGZXA", "B001D9AYF8", "B003L1ZYZ6", "B004TJ6JH6", "B00004ZCJG", "B0050YG3CU", "B004X7U5N8", "B004XY65WQ", "B0079M711S", "B00906D9YE", "B004Y1AYAC", "B002JCSV8A", "B0090878BW"], "bought_together": ["B00004ZCJK", "B00004ZCFQ"], "buy_after_viewing": ["B001EO6W8K", "B001S2PPT0", "B00004ZCJK", "B00ECGX8FM"]}, "categories": [["Electronics", "Camera & Photo", "Lenses", "Camera Lenses", "Digital Camera Lenses"]]}