{"asin": "B000WXAX6G", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Connectors & Adapters"]], "description": "Connecting Your World Home theater systems are made up of multiple components from sources such as Blu-Ray players and switching playback devices such as AV receivers which allow playing and selecting content, to displays and speakers that bring the content to our eyes and ears. Within a system the distance between sources and switching devices is usually short and pre-terminated cables usually fit the task--but speakers are a different story. Distance to speakers varies and in some cases pre-terminated cables which have ends connected during manufacturing are either too long or too short, using un-terminated cable is the best way to ensure that cables are the proper length. Using bare wire at the amplifier/AV receiver and speakers is not the best connection, as the strands of wire can get separated and the exposure of any copper in the cable can erode over time. In order to make the best connection the bare wire needs to be terminated. The Right Connection Making the right connection is quick and easy with Monster QuickLock connectors; these specially designed connectors give the right termination for all your speaker connections. Simply slip the wire through the specifically designed jacket, bend the wire over and screw the termination. Your wire is now crimp in place and ready to connect to your amplifier and speakers. Terminations are available in Banana Plug, Angled Spades, and FlexiPin to fit whatever type of terminal is on your amplifier and speakers. Each termination is gold plated for long-lasting corrosion protection and to optimize the performance from your speakers by making a solid connection. Should you need to change the termination type, each end is interchangeable with the jacket so the operation is quick and easy.", "title": "Monster QuickLock MKII Gold Banana Connectors For Easy Self Crimping Terminations - 2 pr (Discontinued by Manufacturer)", "price": 11.5, "imUrl": "http://ecx.images-amazon.com/images/I/41iuvHK7jpL._SX300_.jpg", "brand": "Monster", "related": {"also_bought": ["B000WXBY7I", "B0013JUEJ4", "B00006345D", "B0010DLYO2", "B000WX5FB4", "B00006JPTU", "B00005U21H", "B002MBZVFE", "B001A9CFI0", "B00104HKJE", "B00006I5GV", "B000WXAYJW", "B000F1X75E", "B00APEG9M4", "B00108NVYS", "B0010DIWAG", "B00008VFB6", "B0010HEEEU", "B00108UNDK", "B000WX5FCI", "B00009V3RF", "B001H543UA", "B000Y9B1J6", "B00005U21G", "B000WLZSH2", "B000WX7AQM", "B00564BG3U", "B001TK89L2", "B003FVYXY0", "B00GXI12LO", "B006JSR4QU", "B000Y9CP4Q", "B001H543UU", "B000AYDQB6", "B000F20NMI", "B000Y9E9PY", "B0010DK37G", "B003ATKHW4", "B000Y9E9QS", "B000FON3IM", "B006I6FXDY", "B000WLZSGS", "B001EMBKNO", "B001TKE25E", "B0049II7W2", "B00004Y2VV", "B007QUYQSY", "B000YC00OU", "B000F1Z8NI", "B007Z8D3AE", "B00EPDMDZ8", "B002SWK3J6", "B000WXBZSG", "B003FW0WIK", "B000Y99KPI", "B000BMQR36", "B006U3O566", "B008DOAPKU", "B006JSEHJC", "B00DI89I04", "B000BATDZ2", "B00EZB23LE", "B009EADB2Q", "B004EBX5GW", "B0041OOF4I", "B00DIUDLFU", "B00H7L7QMA", "B000X9O8SI", "B00FF3UN72", "B000NHV32Y", "B000UF72E2", "B0044779GI", "B00CRSQZF2", "B0044779G8", "B00170KRFK", "B004UR486G", "B001UNGJF6", "B001UAFJ0K", "B0097JLRZM", "B0006HQ7E0", "B003FW4WMC", "B003L14ZAQ", "B007Z8EFAQ", "B000F5SO3A", "B00005T3FX", "B000IAZ5SO", "B000G67Q00", "B0046L8QHS", "B0009XTONW", "B005FM5WY2", "B00DIU5PJ0", "B000JVCPEY", "B00003CWFA", "B0009VNE0S", "B00422L3GW", "B000F20MTW"], "bought_together": ["B000WXBY7I", "B0013JUEJ4"], "buy_after_viewing": ["B006U3O566", "B00DIUDLFU", "B00005U21H", "B007QUYQSY"]}}