{"asin": "B00006JQ06", "related": {"also_bought": ["B00009QOOO", "B00020S7XK", "B0016BQECA", "B003EM8008", "B00140DBRY", "B0016OEV7C", "B000MSYFW4", "B00IMQL71U", "B00004T8R2", "B0088LEVI0", "B003FO4UHW", "B0006GW46Q", "B003JD6LVW", "B002WQ2HKQ", "B0043L32KC", "B00451SSBI", "B003EXQEUU", "B000IG66VS", "B006T9ZKAQ", "B003DBTAZ4", "B0012YHQVE", "B004LLMAWU", "B000G6M916", "B004XXQI1U", "B00383PB0U", "B004RE3YNA", "B005VEZ4N8", "B00007056H", "B008ASIZR4", "B000092YR6", "B005UB5NOW", "B004WODP20", "B003EMAFQU", "B00009V2QX", "B009IH0BZ0"], "bought_together": ["B003EM8008"], "buy_after_viewing": ["B00020S7XK", "B0016BQECA", "B00140DBRY", "B0043L32KC"]}, "title": "Sony SRF59SILVER AM/FM Walkman Stereo Radio", "price": 16.84, "salesRank": {"Electronics": 317}, "imUrl": "http://ecx.images-amazon.com/images/I/41ZW1WF7M6L._SY300_.jpg", "brand": "Sony", "categories": [["Electronics", "Portable Audio & Video", "Radios", "Personal Radios"]], "description": "The SRF-59 is lightweight, simple-to-use FM/AM stereo receiver. Weighing only 3 ounces (84  grams), this compact player is a perfect companion for the track, bike trail or work area. The FM antenna is part of the headphone cord, so you are sure to receive a strong signal. The AM antenna is a ferrite bar type. The local/distant switch will help you fine tune the reception. Both the volume and tuning buttons are rotary dials, providing a nice sight-free way to make major changes to the Walkman.Sony has included their MDR (micro dynamic receiver) headphones with the SRF-59. These headphones are open air type; the headphones will allow ambient noise to filter into the ear canal, providing a rich sound and keeping you safely aware of events, people and automobiles around you. The headphones provide ample dynamic range and sound. The Walkman requires only one AA battery, keeping the receiver lightweight and inexpensive to operate. When using a Sony alkaline battery, you can expect an impressive 100-140 hours of use. There is also a belt clip included, so you can carry the Walkman on your belt. The color is a sporty silver.What's in the BoxSony SRF-59 Walkman FM stereo, Sony MDR open air headphones, belt clip, user's manual and a ninety day warranty."}