{"asin": "B000234I6C", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Distribution", "Selector Switch Boxes"]], "description": "Why connect and reconnect cables to manually switch between devices. Get rid of the cable hassle, and add flexibility to your home theater system with the 3-Play selector. Plug in this switch and quickly add three toslink, three s-video, and three RCA composite audio/video ports to your system. Great for connecting three of the following: DVD players, satellite receivers, video game consoles or digital video recorders - any devices that have dual channel analog or toslink audio with s-video or composite video. This is an ideal solution for the a/v enthusiast who wants to take full control of an ever-expanding system. Use the wireless remote control or the three front panel input selector buttons to quickly change sources.  Input: Three S-Video Female, Three TOSLINK Female, Three RCA Audio/Video Female. Output: One S-Video Female, One TOSLINK Female, One RCA Audio/Video Female. Please Note: This unit does not convert s-video to composite video, or composite video to s-video; the output signal is always the same as the original input signal. For your convenience, the following replacement parts are available for this item: Item #98009 - AC/DC Adapter, and Item #98014 - IR Wireless Remote Control.", "title": "C2G / Cables to Go 28731 3Play SVideo, Composite Video and TOSLINK Digital Audio High Performance Selector Switch (Black)", "price": 46.32, "imUrl": "http://ecx.images-amazon.com/images/I/41C8cGxzkzL._SX300_.jpg", "brand": "C2G", "related": {"also_bought": ["B001TH7GSW", "B005M4IWNQ", "B0014YXM9M", "B005LJQMCK", "B004LSNF04", "B00G191YL8", "B00CF4SMZ4", "B000812QC6", "B008EPW7O0", "B005LJQMZC", "B0002344GG", "B005LJQNQU", "B000B525DY", "B001V56JDA", "B003UKU9FS", "B00A4V22G0", "B00AEMGGU2", "B008ALA2RC", "B009W857SG", "B005LJQPE0", "B004OVECU0"], "bought_together": ["B001TH7GSW"], "buy_after_viewing": ["B00G188Z7A", "B001TH7GSW", "B00BB0GY1C", "B0032ANC8M"]}}