{"asin": "B00AOHDC6I", "related": {"also_bought": ["B007U7M02C", "B007U7M0KE", "B007CS0U6C", "B00CN8AI2M", "B00CS1WDBI", "B00BGYR39U", "B00AOHDC5E", "B007CS1Z2K", "B007CS1LCE", "B00CN8AGA6", "B00CG0CM3U", "B009PLLFAO", "B007CS1908", "B007U7M14Y", "B008DFT7RQ", "B00CN8AHVY", "B007U7M022", "B00CV7BX9C", "B00CRZXWX8", "B007FDBD92", "B00CN8AGE2", "B004MWP390", "B0038AT564", "B007U7M0WC", "B0084BPZO8", "B00CG0CMEO", "B00BRCNAE8", "B00DSR9X5U", "B007U7M0L8", "B004MWN0Y0", "B00D38UBJ6", "B00BP48U6Q", "B00CN8AI0E", "B0038AJIMK", "B009PLLFAE", "B0038APDAG", "B004Z7H1OW", "B00CG0CL2M", "B004Z7H2EQ", "B007U7M0V8", "B00CG0CMBM", "B00CG0CL1S", "B0038AR53E", "B00CN8AGCO", "B00EDOD5CY", "B007SA2QCA", "B007FDBELY", "B0089RPUHE", "B0089RPUH4", "B00GTCKO90", "B009PLLF9K", "B00CKH6AGE", "B00H5HFEUM", "B004MWL07O", "B0038AR4VM", "B0038APDDS", "B0038AR75K", "B00FAA1QZ8", "B00CP4J7OY", "B0049QNX32", "B00EIBEORM", "B004GJXJLS", "B00EDODR5O", "B004Z7H2EG", "B00F0DPVZQ", "B004MWHZX2", "B00DMA12VQ", "B00555TX76", "B00GSXJIMO", "B00FR6240G", "B004Z7H14M", "B00BDMN3VC", "B007U7M0KY", "B00H5HFEQ6", "B00A152LXI", "B0088LQZOI", "B00FFXWF3C", "B0038ANOC0", "B00CN8AG9C", "B00DM9VJR4", "B000FGCY8K", "B00FFXWJJM", "B00D1HK3S8", "B007U7M0WM", "B00H5HFERA", "B00AZ2Y2EI", "B0038APBDA", "B0090A5EHA", "B00CRZXUZI", "B007U7M0K4", "B0038AJKPU", "B00CRZXSGE", "B007U7M0VS", "B0061J30VU", "B00DNGQSRM", "B0038AJKPK", "B005R1RZUK", "B007U7M0LI", "B00BGYRSTU", "B00CRZXV3O"], "also_viewed": ["B007U7M02C", "B0038AT564", "B00AOHDC5E", "B007CS1Z2K", "B007U7M0KE", "B00BGYR39U", "B007CS0U6C", "B009PLLFAO", "B004MWP390", "B007FDBD92", "B007SA2QCA", "B007CS1LCE", "B007CS1908", "B007U7M0WC", "B004Z7H2EG", "B004Z7H1OW", "B00CG0CMEO", "B007U7M14Y", "B00GSXJIMO", "B007U7M0L8", "B0084BPZO8", "B0038AJIMK", "B007U7M022", "B00CN8AGCO", "B00BRCNAE8", "B00CG0CL1S", "B004MWN0Y0", "B00H5HFEUM", "B009PLLFAE", "B00BP48U6Q", "B0089RPUHE", "B00D38UBJ6", "B00CG0CM3U", "B007FDBELY", "B007U7M0V8", "B0049QNX32", "B004GJXJLS", "B00H5HFEQ6", "B0089RPUH4", "B009PLLF9K", "B00CN8AI2M", "B00CG0CMBM", "B004Z7H2EQ", "B00CRZXWX8", "B0038AJKPU", "B0038AR4VM", "B0038ANOC0", "B0038APDAG", "B00CN8AGA6", "B0038AR75K", "B00CG0CL2M", "B0038APDDS", "B00555TX76", "B0038AR53E", "B004MWL07O", "B00D1HK3S8", "B004MWHZX2", "B00CV7BX9C", "B00FAXPB6K", "B00CS1WDBI"], "bought_together": ["B00CS1WDBI", "B00CN8AI2M"]}, "title": "LeapFrog LeapPad Ultra eBook Mr. Pencil (works with all LeapPad tablets)", "price": 3.06, "salesRank": {"Toys & Games": 10772}, "imUrl": "http://ecx.images-amazon.com/images/I/51Stl-ImwmL._SY300_.jpg", "brand": "LeapFrog Enterprises", "categories": [["Toys & Games", "Electronics for Kids", "Electronic Toys"]], "description": "Get set for an epic reading adventure with the Mr. Pencil The Lost Colors of Doodleburg Ultra eBook! When Dr. Dull steals the colors from Doodleburg, it&#x2019;s up to you to help Mr. Pencil, Dot and Dash save the day using your reading and writing skills. This Ultra eBook is appropriate for kids ages 4-7, and teaches listening and reading comprehension, writing, vocabulary, phonics and word recognition. The cartridge is compatible with all LeapPad learning tablets.The story is written at 3 different levels, progressing from simple to more complex.Letter writing activities guide children through step-by-step stroke order for upper- and lowercase letters.What&#x2019;s an Ultra eBook?Ultra eBooks revolutionize the eBook experience by turning reading into an immersive, interactive adventure kids won&#x2019;t forget!  Ultra eBooks use LeapPad&#x2019;s advanced features to enhance the way kids learn to read. Levels adjust automatically so kids can read at their own pace. If a child gets stuck on a word, he can touch it with the stylus to highlight the letters and hear the word sounded out.  A visual dictionary also helps build vocabulary and comprehension skills. Play six built-in reading games/writing activities to reinforce the learning and three fun mini-games that build reading comprehension and word recognition skills. And children can use LeapPad's built-in microphone to narrate the story!A Custom Fit for Your ChildEach Ultra eBook features a story with three reading levels that adjust automatically from simple to more complex sentences so kids can read at their own pace .Children can also choose the learning mode that&#x2019;s best for them: In the Read to Me mode, children hear the entire text read aloud for a non-stop storytelling experience.  In the Read with Me mode, the story is read with stops on each page, allowing children to listen to the story and pause for the play/learn activities. In the Read on My Own mode, children read the text on their own and can even record and replay their own voice for each page, replacing the narrator&#x2019;s voice. As children play, results of their word-based and comprehension-based activities inform and adjust learning to fit their skill level. At any point, children may choose to engage with text that is above their recommended level, which allows exposure (with audio support) to even richer language and more sophisticated sentence structure while promoting listening comprehension.Innovative Learning ApproachMr. Pencil is the perfect character to guide a child into the world of words. Kids will enjoy helping Mr. Pencil and his friends Dot and Dash pursue Dr. Dull&#x2014;then have fun with letter-writing practice and playing other included writing activities created by educators exclusively for LeapFrog. The handwriting activities embedded in the Mr. Pencil The Lost Colors of Doodleburg Ultra eBook are sequenced in a developmentally appropriate way, allowing children to build on more basic letter strokes as they build writing confidence.  Children begin with letters such as uppercase T and L, made with vertical and horizontal lines and gradually move on to writing letters with curved and angled lines, such as uppercase C and K.  Eventually, they write letters such as lowercase b, m, and r that require retracing.What's In The Box?LeapFrog&#x2019;s Mr. Pencil The Lost Colors of Doodleburg Ultra eBook Explorer game cartridge (compatible with LeapFrog LeapPad1 and LeapPad2 Learning Tablets, sold separately) and Parent Guide.Take advantage of hundreds of game cartridges and downloads that keep kids challenged and inspired. LeapFrog&#x2019;s library of educational entertainment content includes learning games, eBooks, videos, music and more."}