{"asin": "B000U62N1S", "imUrl": "http://ecx.images-amazon.com/images/I/31vB2immZOL._SX300_.jpg", "description": ".caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; }The Toshiba HD-A3 HD DVD Player allows everyone into the HD DVD game with a very affordable price tag. Don't let the price fool you, however; it offers many features and an excellent build quality.A Refined, Slimmer LookThe HD-A3's refined design--with rounded edges, a slim chassis, and a high-gloss black face plate, standing less than two-and-a-half inches tall--looks sleek and elegant in your home theater system without taking up too much real estate.The Toshiba HD-A3 has an Ethernet port to support HD DVD titles with interactive online features, as well as to keep the player refreshed with firmware updates.View larger.In addition to HD DVD, the A3 can also play DVDs, DVD-R/Ws, DVD-VRs, CDs, CD-Rs, and CD-RWs.View larger.Outstanding PerformanceAll of Toshiba's HD DVD players support the enhanced features of the HD DVD format, including picture-in-picture video, audio commentary, and Web-enabled network capabilities. With an Ethernet port, the HD-A3 can connect to the Internet for firmware updates to keep the player up to date on new features, and to support the growing number of HD DVD titles with interactive online features and bonus content.The HD-A3 features an HDMI interface that carries both a video and an audio signal in one cable for the highest quality and convenience. The A3 outputs video at 720p and 1080i for a detailed and sharp image. The HD-A3 has progressive scan capability, which means it eliminates the scan-lines of interlaced video and produces a clean image with no motion distortion and artifacts.Sparkling Surround SoundThe HD-A3's built-in circuitry processes the multi-channel decoding of Dolby TrueHD, Dolby Digital, Dolby Digital Plus, DTS, and DTS-HD (core only).Plays a Variety of FormatsThe HD-A3 is backward-compatible with your DVD collection: It can play and upconvert DVDs to the HD resolution that is being output. It can also play DVD-R/W, DVD-R, DVD-VR, CD, CD-R, and CD-RW formats, so you don't need extra players taking up space.The HD-A3 is backed by a limited 1-year warranty.More resolution than regular DVD (up to 1080i).Upconverts standard DVDs to the output resolution.Tons of new interactive features and bonus content.What's in the BoxHD-A3 HD DVD player, remote control, and power cable.", "categories": [["Electronics", "Television & Video", "DVD Players & Recorders"]], "title": "Toshiba HD-A3 720p/1080i HD DVD Player"}