{"asin": "B005CLHOM4", "description": "NOTE: IOS 7.1 is known to have issue with Bluetooth devices. Apple has fixed the bug in IOS 7.1.1.If you are having issue with paring or connection, please update to IOS 7.1.1 first.Designers at Bear Motion never rest. Now, allow us to bring you the slimmest folio case for iPad Air with detachable Bluetooth keyboard. Super slim folio case + super slim keyboard = your convenience.Keyboard charges via micro USB port. Micro USB cable is included in the package. You can simply connect it to your iPad charger via the included micro USB port to charge it.It is easy to pair and connect with your iPad.1. charge the keyboard2. go to settings and Bluetooth settings in your iPad. Turn on the Bluetooth and it will start searching for nearby devices3. switch on the keyboard and press the pair button (pair is only necessary during the initial set up)4. iPad will see the keyboard and list it on the screen. Press the keyboard name on the screen to pair.5. iPad asks to enter 4 digits pairing code. Enter that on the keyboard and they will be paired, connected and ready to use.6. next time when you switch on the keyboard, it will automatically connect with the iPad.Two reasons to buy Bear Motion:Reason No. 1: Rigorous and relentless quality control \nOne might think that anybody can make these cases that have nothing special in design. While this is true, nobody other than Bear Motion can deliver the quality consistently to every end user.Reason No. 2: Best material guaranteedWe only use the best. Never compromise quality for any reasons.Bear Motion is registered trademark and distributed by Pro Ebiz LLC", "title": "Bear Motion for iPad Air - Ultra thin Folio Case with Detachable Bluetooth Keyboard for Apple iPad Air", "price": 26.99, "imUrl": "http://ecx.images-amazon.com/images/I/41TiayJcijL._SX300_.jpg", "related": {"also_bought": ["B00EL94Z4I", "B00G5N0ZZQ", "B00G2TK76A", "B00G2X1VIY", "B00GP4CW24", "B008MOHLVC", "B00G1YKHH0", "B00G2Y4WNY", "B00G3J8EZ0", "B00G2XRVNS", "B00G4SA1FG", "B00FO0PLXW", "B00G2XSL3C", "B004M5KYEG", "B00FDITKKA", "B002VPE1Q6", "B00BG34UMY", "B004M5OYRY", "B0059KTEBC", "B00CK9DARO", "B004M5KYGY", "B00G2Y5YIG", "B004TLH7C0", "B00FB578OK", "B00DY6KZ2A", "B00IS25H5A", "B00CB7T52O", "B00G3TUL4C", "B00HYQ4XGK", "B009QQMEEY", "B00JWKZPWM", "B008AG097A", "B009AOEN8C", "B00ET9YYS2", "B005F47YDW", "B00752ZKU6", "B00ATM9T2O", "B00GDAGKNM", "B003KWM9BS", "B00G440VEG", "B009FRLE0E", "B003ODVN88", "B009UZ3TF4", "B00GR1I242", "B00KQRSLKI", "B00G43ZVYC", "B00I1ZHY0A"], "bought_together": ["B00EL94Z4I", "B00G2TK76A"], "buy_after_viewing": ["B00CK9DARO", "B00G3TUL4C", "B00GR1I242", "B00HAWW590"]}, "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Cases & Sleeves", "Cases"]]}