{"asin": "B0009V6TL4", "description": "Have the clean, wire-free desk space you've dreamed about. The sleek Logitech Cordless Desktop EX 110 makes it incredibly easy and affordable to go cordless&#x97;in style.Quick and simple to set up, your keyboard and mouse will perform as fast and as reliably as any corded product. An 800-dpi optical mouse responds instantly, tracks precisely, and provides maximum freedom. One-touch media controls make music or video playback easier &#x97; and more fun. Launch your Internet home page, email, or onscreen calculator&#x97;all from the keyboard. Plus, navigate the Web or close your browser with convenient left-hand buttons. The keyboard is spill-resistant too! You'll love the combination of Logitech quality, comfort, convenience, and style.Set up quickly and easily. It's the easiest way to go cordless.Know that your reliable Logitech Cordless Desktop EX110 is the result of Logitech&#xB4;s 10 year cordless technology field testing. Our 5-year limited warranty makes purchasing it an easy decision.Enjoy quick response. 800-dpi cordless optical mouse responds instantly, tracks precisely, and moves more freely.Scroll easily through Web pages and documents with mouse wheel.Easily navigate the web, or close your browser, with convenient left-hand buttons. Distinctive programmable F-keys make everyday simpler and more direct.Adjust or mute music volume quickly. One-touch media controls make music or video functions more convenient &#x97; and more fun.Start your calculator onscreen with a single button. Enhanced F-keys for common tasks instantly launch your Internet home page, email, or your onscreen calculator.Don't worry about spills. Spill-resistant design protects your keyboard and eliminates concern over little accidents.Use with your Notebook or Desktop PC. USB makes connectivity easy. Also works with PS/2.Go with the leader. Logitech sells more cordless desktops worldwide than anyone else for a good reason: we're always working to perfect your experience, by maximizing quality, comfort, and simplicity, with the features you want and expect.", "title": "Logitech Cordless Desktop EX110 (967561-0403)", "price": 23.99, "imUrl": "http://ecx.images-amazon.com/images/I/41NK5TCBFGL._SY300_.jpg", "related": {"also_viewed": ["B003VAGXZC", "B003SVSJ1K", "B00354TYM8", "B001AAK0P4", "B00BJ6XZEM", "B00EUAFQCS", "B000ORZNB0", "B008BW9XTS", "B00CPLILH6", "B004KSQANO", "B0036E8V08", "B00501T8XY", "B006GMLD7A", "B004XLA1R4", "B003VANO7C", "B00BP5KOPA", "B004KNAU0S", "B004SUO1R6", "B003NREDC8", "B006PAY8TS", "B004RJFTKG", "B0053V17DK", "B00I14395A", "B004SUO1QM", "B001S4OTS6", "B005TJRDCA", "B009X1FHRS", "B002JCSCYS", "B00ACC0P0Q", "B00G6IYJHA", "B004Z02XK6", "B003VAHYNC", "B007BPKHJ6", "B000HJOUP0", "B000HCRVSK", "B00064FXGQ", "B00FFJ0ED4", "B0064D5BGK", "B000HX1P8G", "B003NR874S", "B000Q6RETS", "B005S0YO0O", "B002KYA30G", "B00ESB9WF6", "B00DI79YUE", "B001B8CU8U", "B003W0RKM6", "B005NIFB7G", "B004LB5AKY", "B003JZU8DC", "B0012MXZ3Y"], "buy_after_viewing": ["B003VAGXZC", "B00BP5KOPA", "B003VANO7C", "B003SVSJ1K"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Keyboard & Mouse Combos"]]}