{"asin": "B000AOJ7FK", "description": "Blending single elimination, team-based gameplay with the notion of an economy to produce an online action experience of incredible depth and realism,Counter-Strikeis the most played multi-player online action game in the world. WithCounter-Strike: Source, the now legendary game has been given a complete overhaul, with graphic enhancements such as higher polygon models, shadows and reflective water to add dimension to the new characters, items, and environments.Counter-Strike: Sourcealso contains all new maps.In addition to the award-winningCounter-Strikegameplay, this package also includesHalf-Life 2: Deathmatch--featuring fast action gameplay in physically simulated environments--andDay of Defeat: Source, Valve's World War II online action thriller set in the European theater of operations.AboutCounter-Strike: SourceCounter-Strike: Sourceblends Counter-Strike's award-winning teamplay action with the advanced technology of Source technology. Featuring state of the art graphics, all new sounds, and introducing physics,Counter-Strike: Sourceis a must-have for every action gamer.AboutHalf-Life 2: DeathmatchFast multiplayer action set in theHalf-Life 2universe! HL2's physics adds a new dimension to deathmatch play. Play straight deathmatch or try Combine vs. Resistance teamplay. Toss a toilet at your friend today!AboutDay of Defeat: SourceDay of Defeatoffers an intense brand of online gameplay set in the WWII European Theatre of Operations. Players assume the role of light/assault/heavy infantry, sniper or machine-gunner class, and missions are based on historical operations.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/511V9MPJM3L._SY300_.jpg", "related": {"also_bought": ["B000PS2XES", "B00ERDGMSA", "B001440YD4", "B000AOKX3K", "B00005Y0IW", "B000ID1AKI", "B001CC8UBG", "B00004TJCL", "B002BRYXRQ", "B00BMFIXZG", "B000YJ3TR8", "B002NIP2SM", "B007H2V9W2", "B003JVF728", "B00C7103JI", "B000AAL4HI", "B008OQTUKS", "B00009TW6R", "B002IYR0KO", "B00EDJLXHI", "B006JSY3MI", "B000GPVUUS", "B000EOPSJK", "B001Q96ZNU", "B0065NP39E", "B002I0HKRQ", "B000COCAJI", "B001AH8YSW", "B002I0JIQW", "B0095C0I4W", "B001E6DG6Y", "B001AWBYRA", "B00B98HDNO", "B0050SZ836", "B0079NGSDO", "B002BXKJA0", "B002I0KOSI"], "bought_together": ["B000PS2XES"], "buy_after_viewing": ["B00005Y0IW", "B00DU2CHE2", "B000AOKX3K", "B000PS2XES"]}, "salesRank": {"Video Games": 8775}, "categories": [["Video Games", "PC", "Games"]]}