{"asin": "B002K3Y2MM", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Hubs"]], "description": "Add support for seven USB devices on your Mac or PC with the Belkin Seven-Port Desktop USB Hub. Utilizing only a single USB port on your computer, this powered hub allows seven devices to be connected to your computer simultaneously. The hub features USB 2.0 for file transfers up to 480 Mbps, and is backwards compatible to handle USB 1.1 connections as well. Compact and easy to use, the Belkin Seven-Port Desktop USB Hub is ideal for connecting additional devices like printers, digital cameras, hard drives, and more.Seven-Port Desktop USB HubAt a Glance:Instantly adds seven USB ports to your computerCompatible with desktops and laptops for Mac and PCSupports USB 2.0 and USB 1.1Plug and play, no drivers requiredBacked by a one-year limited warrantyInstantly add seven USB 2.0 ports to your computer.View larger.Add Seven USB Ports to Your ComputerThe Belkin Seven-Port Desktop USB Hub instantly expands one USB 2.0 port on your desktop or laptop computer into seven. The hub's compact design features five ports on the back of the hub and two ports on the front. Ideal for connecting printers, keyboards, cameras, hard drives, MP3 players, and other USB devices, the hub keeps you from having to constantly swap out cables.Compatible with Macs and PCsThe Belkin Seven-Port Desktop USB Hub features plug-and-play installation, meaning you can use the device as soon as you plug it in--no additional drivers or software are required. Powered by an AC adapter, the hub is compatible with desktops and laptops for both Macintosh and PC.USB 2.0 and 1.1 CompatibleNot only is the hub compliant with USB 2.0 for fast data transfer rates of up to 480 Mbps, it's also backwards compatible with older USB 1.1 devices.The Belkin Seven-Port Desktop USB Hub is backed by a one-year limited warranty.What's in the BoxBelkin Seven-Port Desktop USB Hub, USB 2.0 cable, power adapter, and user manual.", "title": "Belkin 7 Port Desktop High Speed USB 2.0 Hub with Power Supply", "price": 23.95, "salesRank": {"Electronics": 26423}, "imUrl": "http://ecx.images-amazon.com/images/I/412EAWQDB1L._SY300_.jpg", "related": {"also_bought": ["B000NAXC6Q", "B000NAXC6G", "B003MTTJOY", "B001TH7GUU", "B000TTTJ36", "B00372567A", "B008TCUXLW", "B009SQQF9C", "B000ESN9GA", "B001IAWBIK", "B002N5521W", "B000BK107G", "B000SDZ0K4", "B004ZBFRGC", "B000Q8UAWY", "B000JE9LD4", "B001E1Y5O6", "B000CRFOMK", "B00461G3MS", "B003VNKNEG", "B001TH7GUK", "B008ALA6DW"], "bought_together": ["B003MTTJOY"], "buy_after_viewing": ["B00DQFGJR4", "B003Z4G3I6", "B000TTTJ36", "B00008VFAF"]}}