{"asin": "B001Q3M9PY", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "Take stunning Full 1080p High Definition video at 60fps and amazing 8-megapixel digital photos!   The compact Sanyo Dual Camera Xacti FH1 delivers high-performance results with multiple features normally found on much higher priced video and photo cameras.  The FH1 packs tons of features which are sure to please the most discerning user; including 600fps slow motion mode, face chasing technology which automatically read and corrects focus and lighting for up to 12 different subjects, and 16x optical zoom for video.  Its compact design makes the FH1 extremely portable and easy to use.  Videos, still photos and the various settings and menus can be easily accessed with the user&rsquo;s thumb.  The FH1&rsquo;s convenient design makes sharing videos and photos via social networking web sites, portable video devices like IPod&rsquo;s, TV&rsquo;s and computers, a breeze.Sanyo Xacti FH1 HighlightsHigh Performance and Stylish Design Made SimpleThe Dual Camera Xacti FH1 packs high performance, cutting edge technology into a small, stylish, easy to use camera.  Designed to fit perfectly in the palm of your hand, the Dual Camera FH1 features an easy to navigate menu which make it a great choice for the beginner and the more advanced user.  It is the perfect blend of style, performance, and ease of use.Large, 3-inch Liquid Crystal Display (LCD)The display flips out from the camera and rotates up to 285 degrees on an axis that allows you to take great video or still images from otherwise-difficult-to-view positions, proving to be especially useful when shooting in confined spaces.8-megapixel Still Image QualityIn addition to Full 1080P HD Video the FH1 takes amazing 8 megapixel still photos.  With an 8-megapixel (effective) CMOS image sensor the still images can be interpolated to reach 12 megapixel quality.10x optical zoom (photos)/16x optical zoom (video)The FH1 lens provides a fantastic zooming range for photos with an F=35.7-357mm range (35mm equivalent).  For videos, the zoom ranges from F=41.7-666.9mm (35mm equivalent).12 Subject Face Chaser TechnologyRecognizes up to 12 faces for videos and still pictures and optimizes focus and aperture settings to ensure all subjects are in focus.Sophisticated image stabilizerUsing a proprietary Sanyo algorithm, the FH1 automatically compensates for distracting up-and-down or side-to-side camera movement, keeping your subject steady and easy to follow. It accurately distinguishes between unintentional camera shake and deliberate camera movement. This handy feature operates in both wide-angle and telephoto modes.Sequential photo mode shoots up to 12 frames per secondTake pictures like the pros with sequential shooting up to 12 frames per second.  The perfect solution for action photography.Highly advanced MPEG4 AVC/H.264 video compressionThis feature optimizes the file size and makes sharing movies on social networking sites, or e-mailing them to friends and family, even easier.  In fact, the file size can be up to 25 percent smaller than that of typical MPEG-4 cameras.To accomplish the complexity of encoding AVC/H.264 in real-time on the FH1, a dedicated H.264 video compression IC was incorporated into the camera that was designed specifically for portable consumer devices.  This achieves high video quality while simultaneously reducing the system power consumption.Easily transfer video and still images to your video capable iPodImport video and still image files directly into iTunes software and then port them to your video-capable iPod.  Share your latest masterpiece with friends and family.Record over 5 hours of full motion videoUsing a 16 GB SDHC memory card users can capture over 11 hours and 6 minutes worth of video in standard definition or approximately 1 hour and 28 minutes in full HD video mode.Capture still images while you&rsquo;re shooting videoThe FH1 enables simultaneous shooting of video clips and still images with a simple press of the shutter button during the shooting of a movie clip. You will never need to miss another precious photo opportunity. (Depending on the mode used to take still images, simultaneous video clip shooting may be interrupted. While shooting video clips, using the digital image stabilizer may change the angle of view for still images.)Super-fast start-upReduce your chance of missing the perfect shot. The Dual Camera Xacti FH1 is designed for super fast start-up and shooting. With its tapeless design, the FH1 eliminates the need to queue up a video tape, allowing it to begin shooting in as little as 1.7 seconds! When the FH1 is powered on, closing the LCD display puts it in standby mode. Simply open the display and the FH1 automatically powers up and can begin immediately recording in as little as 1.7 seconds.Includes a high-capacity Sanyo brand lithium-ion batteryThe DB-L50 is a high capacity battery designed to work with the Sanyo Xacti FH1 camera and delivers approximately 135 minutes of video record time.  High-energy density design minimizes the battery size and weight, making it perfect for use in the Sanyo Dual Camera Xacti FH1. The DB-L50 is designed to resist memory accumulation so it provides a full charge every time.Easy playback of recorded video directly on a TVThe FH1 camera features a HDMI output which makes connecting it to a digital TV or DVD recorder a breeze.  The FH1 can also easily be connected to a computer to back-up copies of recorded content. Still images and video clips are played back continuously and in chronological order.  When connected to a PC, simple drag-and-drop operation makes it easy to save recorded video clips and still images onto a computer's hard disk for emailing, editing or archiving.", "title": "Sanyo VPC-FH1 HD 1080p Flash Memory Camcorder w/ 16x advance zoom (Black)", "price": 17.49, "salesRank": {"Camera &amp; Photo": 11428}, "imUrl": "http://ecx.images-amazon.com/images/I/41U6P01MD8L._SX300_.jpg", "related": {"also_viewed": ["B00CQ9T00E", "B006NT43IW", "B003DZ122E", "B00BB4UKOK", "B007261BNU", "B0031RGKZI", "B004H8FNB2", "B00HPZKQJS", "B00HNJWWK2", "B00HNJWWL6", "B00AR95HV6", "B0036TH75I", "B00AR95H0W", "B00HLDFTRS", "B007ROW3KM", "B006K551HQ", "B003DZ1224", "B005LS0ADS", "B00AR95H7U", "B00AR95H4S", "B0032UWTQI", "B005FY0CZY", "B00AW54ZGS", "B00BB4ULZI", "B006UMMP2I", "B00HXE4H28", "B00BOVP4E6", "B0036VO7FE", "B00FF90EZM", "B00EVIBN8U", "B004H8FN94", "B006UMMP8C", "B003GD6EEE", "B00B4ADSMC", "B0090EC5NC", "B00AW54ZF4", "B00AWZFJ22", "B006VFT92S", "B00HUESJJI", "B0090EC5MS", "B00FB465IG", "B00HLDFU6I", "B00AWZFHG0", "B0043D4V8M", "B00HLDFSQK", "B00C3R14J4", "B00CSMB74G", "B00AW54YWS", "B007009JIM", "B001VMQ2PS", "B004ZGN6MY"], "buy_after_viewing": ["B00B7ID99I", "B0049WZGMC", "B0042QBQLA", "B002G12OBO"]}}