{"asin": "B003ZSHNGS", "related": {"also_bought": ["B0069X6N7Q", "B003ZSHNH2", "B0055W2XQM", "B005HNF01O", "B004DM4KMK", "B002OLWITO", "B003VNKNEQ", "0964987562", "B00449F6I4", "B002CXEJAA", "B003VNKNF0", "B0015DNIOG", "B002HZW6YE", "B0037T3634", "B001FA09WI", "B002LITT42", "B0040MTPAU", "B0015DPJCA", "B0037TA83K", "B0049XV5LM", "B005MTME3U", "B005RXH1WU", "B004DKAPQM", "B002WE4HE2", "B007JT1W02", "B0037T6OE2", "B000FCCZ5Q", "B004FEZ9BW", "B004J3YCGM", "B004Q3C98S", "B0046ID0G8", "B005C6H26C", "B003VNKNEG", "B009B0MYSQ"], "bought_together": ["B005HNF01O"], "buy_after_viewing": ["B003VNKNF0", "B009B0MYSQ", "B003VNKNEQ", "B005HNF01O"]}, "title": "Canon PowerShot S95 10 MP Digital Camera with 3.8x Wide Angle Optical Image Stabilized Zoom and 3.0-Inch LCD", "price": 399.99, "salesRank": {"Camera &amp; Photo": 1214}, "imUrl": "http://ecx.images-amazon.com/images/I/519z3AjKzHL._SY300_.jpg", "brand": "Canon", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "One look at Canon's new PowerShot S95 will have you moving \"upgrade my digital camera\" to the top of your to-do list. The ultra-slim, ultra-intelligent S95 is loaded with all a serious photographer's must-haves, including a bright f/2.0 wide-angle lens and professional-style control ring for intuitive manual control. Canon's HS System is on board for spectacular performance and image quality in low light.And, new for a compact, the S95 incorporates Canon's Hybrid IS for blur-free shooting even close-up. You'll shoot stunning 720p HD video with stereo sound, then watch it immediately on your HDTV with the simple HDMI connection. If photography's your passion, now is the perfect time to step up to PowerShot S95.Canon PowerShot S95 HighlightsCanon's HS System for improved low light performance and better image qualityThe PowerShot S95 employs the Canon HS System by combining a powerful 10.0-megapixel CCD sensor and Canon's DIGIC 4 Image Processor. Thanks to this technological advancement, the S95 is dramatically more sensitive than cameras with identical megapixel counts, and delivers spectacular images with minimal noise. Increased sensitivity demands a higher ISO speed, and the PowerShot S95 delivers with a new maximum setting of ISO 12,800. Blur and camera shake are notably reduced for the ultimate in sharpness and clarity.Shoot beautiful 720p HD video in stereo soundThe PowerShot S95 lets you record video in beautiful high definition (1280 x 720 pixels). The camera also makes it easy to enjoy HD videos (and still photos) on your HDTV with a mini-HDMI connector for direct connection to a high-definition TV monitor. You'll enjoy the HD experience with no degradation of image or audio in the signal, plus the ability to display up to 130 still images at once.Control ring for intuitive manual controlFocus, Exposure, ISO, Step Zoom, or White Balance can now be adjusted more precisely than ever with the S95's control ring. It's even more intuitive and quicker than the usual 2-button control and the S95 lets you decide which function the ring will adjust.Bright f/2.0 lensThe S95 sports an f/2.0 aperture, perfect for creating enticing portraits, by drawing attention to the face and blurring the background with its impressively shallow depth-of-field. The Macro setting lets you get even closer. The large aperture also does more. It lets you capture more nuances in low light shooting by using more of the available light. You'll be ready for anything with a lens aperture larger than even many professional sizes.Canon's Hybrid IS to compensate for angular and shift camera shake during close-up shootingThe PowerShot S95 is one of the first compact cameras to be equipped with Canon's highly advanced Hybrid IS function, which corrects camera shake from two sources to deliver sharp, blur-free images even when you zoom in close to your subject.Hybrid IS employs both an angular sensor and an accelerometer, enabling it to suppress both the blur caused by the angle of the camera and the \"shift blur\" that happens when your subject moves parallel to the camera, a problem that is especially noticeable at large zoom factors.With the ability to produce clear, steady images in most situations and at any zoom length, the PowerShot S95 is the camera you'll want to take everywhere.Full range of shooting and recording modesThe PowerShot S95's RAW mode lets you shoot images without JPEG compression. It gives you clearer images and complete creative control in editing. RAW images are transferred directly to the computer where they can then be edited using image adjustment software or a processing application to adjust your images as you please. The camera can also be set to allow the simultaneous recording of both RAW and JPEG images while shooting.Also, with 26 Shooting Modes including 18 Special Scene Modes, you're ready for whatever shot comes your way.3.8x optical zoom with Optical Image Stabilizer, plus a 28mm wide-angle lensThe PowerShot S95 features Canon's precision 28mm wide-angle 3.8x optical zoom lens that allows you to shoot most scenes from wide-angle to telephoto. It lets you capture more in every frame, so everyone fits in a family gathering shot. When it's time to take a closer look, the Canon Optical Image Stabilizer helps minimize camera shake and reveal almost every detail.What's in the BoxPowerShot S95 Camera bodyLithium-ion Battery Pack NB-6LBattery Charger CB-2LYWrist Strap WS-DC9AV Cable AVC-DC400STUSB Interface Cable IFC-400PCUDigital Camera Solution CD-ROM"}