{"asin": "B00AXZWG8Q", "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS"]], "description": "Dependable, Easy-to-use GuidanceWith its bright 5.0\" display, spoken turn-by-turn directions and many  innovative features, the sleek n&uuml;vi 52LM offers dependable, easy to use  driving guidance.Detailed Maps with Free Lifetime UpdatesMaps of the lower 49 states, plus free lifetime&sup1; map updates, let you easily find addresses and millions of points of interest.Innovative FeaturesLane assist with junction view indicates the proper lane for a turn  or exit with brightly colored arrows and detailed pictures. n&uuml;vi 52LM  also displays speed limit and accurate arrival time.One-stop Device ManagementUseGarmin Expressto keep your n&uuml;vi up-to-date. Garmin Express makes it easy to update  maps and software, transfer favorites to and from devices, and install  free custom vehicles and voices.What's in the Box:n&uuml;vi 52LMPreloaded with City Navigator&reg; NT North America - Lower 49 StatesLifetime maps&sup1; (indicated by &ldquo;LM&rdquo; after model number on the box)Vehicle power cableVehicle suction cup mountUSB cableQuick start manual&sup1;If you purchase a n&uuml;Maps Lifetime  subscription (sold separately or bundled together with certain GPS  models), you will receive up to 4 map data updates per year, when and as  such updates are made available on Garmin&rsquo;s website, for 1 compatible  Garmin product until your product&rsquo;s useful life expires or Garmin no  longer receives map data from its third party supplier, whichever is  shorter. A product&rsquo;s &ldquo;useful life&rdquo; means the period during which the  product (a) has sufficient memory capacity and other required technical  capabilities to utilize current map data and (b) is capable of operating  as intended without major repairs. A product will be deemed to be out  of service and its useful life to be ended if no updates have been  downloaded for such product for a period of 24 months or more. Unless  otherwise stated, the updates you receive under the subscription will be  updates to the same geographic map data originally included with your  Garmin product when originally purchased. In some instances, your Garmin  product might not have sufficient memory remaining for you to load an  update to the map data, in which case you will need to either (a) select  reduced map data coverage for your updates, or (b) purchase separately a  microSD&trade;/SD&trade; card (if and as applicable to your Garmin product) and  load all or a portion of the map data coverage for your updates to the  card and insert the card into the microSD/SD card slot contained in your  Garmin product. If neither of the measures in (a) or (b) can be used to  address your product&rsquo;s lack of sufficient remaining memory, then Garmin  may conclude that the &ldquo;useful life&rdquo; of your product has expired. Garmin  may terminate your n&uuml;Maps Lifetime subscription at any time if you  violate any of the terms of this agreement or your subscription. Your  n&uuml;Maps Lifetime subscription may not be transferred to another Garmin  product.", "title": "Garmin n&uuml;vi 52LM 5-Inch Portable Vehicle GPS with Lifetime Maps (US)", "price": 109.99, "imUrl": "http://ecx.images-amazon.com/images/I/51ILaqOofjL._SY300_.jpg", "brand": "Garmin", "related": {"also_bought": ["B004I5BUSO", "B002OL2MU4", "B00BB2NLVQ", "B00INXAVOQ", "B00CO8UKEW", "B0050JJU3E", "B00INXADDK", "B000LRMS66", "B00BXQ0370", "B002I007IA", "B00BB2NM6U", "B0096DM9YC", "B00INXAFL0", "B00CRQUKQ4", "B00DLL97BS", "B009WAAN7E", "B00FES2TU2", "B00HQC4EG6", "B007RC71DS", "B00E03WQA0", "B0035JL4V2", "B001S2R8E0", "B000L3APBK", "B007RMAS1K", "B00GYDYV0C", "B001S2RCWI", "B00CO8WD9C", "B00GYUOLBY", "B00DZXLZDA", "B00B5TELRI", "B009WAAM70", "B00F0CXAF0", "B000BS2V44", "B00HSJMSTC", "B0015A6YN6", "B003RQBKLC", "B0096BH8NQ", "B0055XNWJI", "B00AXX0IEC", "B001M09MUG", "B005DIZWZM", "B009AOCNXY", "B00BGKQHQ4", "B0057OCS9A", "B001EPX7N2", "B00HPM6E5Q", "B0057OCDQS", "B00AXZY42W", "B0041CDPQO", "B000F7857S", "B006SU0SX0", "B007PSPQ7W", "0528011499", "B00I8BIBCW", "B002IUG14O", "B003YJ8TVQ", "B003VNKNF0"], "bought_together": ["B002OL2MU4", "B004I5BUSO"], "buy_after_viewing": ["B0057OCDQS", "B005DIBHCE", "B002OL2MU4", "B005DIBHA6"]}}