{"asin": "B001P1ZE68", "description": "If you've ever found yourself tapping your foot or fingers to an infectious beat, then this game is for you. Get ready to show off your instinctive sense of rhythm as the music of Rhythm Heaven challenges you to demonstrate your percussive prowess. Prove you have what it takes to keep the beat alive in this fun and engaging experience.Fun Mini GamesView larger.Music Composed by TsunkuView larger.Tap to the beatView larger.SynopsisIn Rhythm Heaven, you'll use your stylus to capture the beat of the music in a variety of mini games. Turn your DS system sideways to hold it like a book, and tap, slide or flick the stylus in time with the rhythm. The game's catchy tunes and charming characters make Rhythm Heaven a blast to play, and the array of rhythm games will test your musical abilities in a variety of ways as you do all you can to show that you've got the beat.Key Game Features:Hold your DS system sideways like a book to follow along with the music as you tap out the beat with your stylus just like you would with your feet or fingersTap, slide or flick your stylus to keep the rhythm of the game's musicDemonstrate your rhythmic abilities in a variety of mini gamesFeatures music composed by Japanese music producer TsunkuFor 1 playerEasy-to-play action features catchy tunes and charming charactersExclusive to the Nintendo DSIf you can tap your finger in time to music, you&rsquo;ll get the hang of Rhythm Heaven in no time. Rhythm Heaven is a simple and infectious rhythm game that anyone can play. Players hold the Nintendo DS system sideways like a book and tap their stylus on the touch screen to the rhythm of the music. Players tap, slide or flick the stylus to hit the right beat. Rhythm Heaven features catchy tunes, charming characters, and a wide variety of rhythm games. Well-known Japanese music producer TSUNKU&#x2642; helped direct Rhythm Heaven and composed the music for it.", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/51EovI387iL._SX300_.jpg", "related": {"also_bought": ["B006L1FAK2", "B000HE9LL8", "B0033BJSDI", "B002EE5RD0", "B0050SVOXE", "B001V135P4", "B002AU0HZQ", "B0007D4MVS", "B003O6E7DI", "B00KWFY04A", "B00JM3R6M6", "B003BMJKI2", "B002I0EH6I", "B00I5LMSE2", "B003FBL86Q", "B00KVRK39A", "B002EWD02C", "B000EGELP0", "B001TOMR6Q", "B000U5W3IW", "B003IOGPAO", "B000E9TBRK", "B000R49BSQ", "B002EE7OKE", "B007R4X3AG", "B004K6LQAS", "B0053B0DI0", "B00L3LQ1FI", "B002KA20C4", "B001E27DLM", "B003ZCH7DI", "B004XYQ3M8", "B00AYRJD02", "B002EE5RKI", "B00L3LQ4B4", "B000GABTVS", "B0053BCML6", "B000ERVMI8", "B0058CA4S8", "B00K85X1TE", "B008E6ZXOK", "B000NWAU64", "B000FZ5LA4", "B000P297ES", "B00438XXRM", "B0053BCMAC", "B000GHG9VG", "B00DD0B1R0", "B001TOQ8UW", "B0001JSSLS", "B001C58T46", "B001TOQ8WU", "B000FUWCRY", "B002I08VDI", "B000QTD05W", "B000B8J7K0", "B000HE7KZC", "B002E1P2JM", "B00KI2OZ9M", "B003V63V2O", "B003UVA4KC", "B000GA8UAQ", "B00K278J0Y", "B0006B0O9U", "B0057VWTS8", "B001FS8BDE", "B002I08UPC", "B004CVWETI", "B0050SVGXM"], "bought_together": ["B006L1FAK2"], "buy_after_viewing": ["B000HE9LL8", "B006L1FAK2", "B0050SVOXE", "B003O6E7DI"]}, "salesRank": {"Video Games": 2303}, "categories": [["Video Games", "Kids & Family", "Nintendo DS", "Games"], ["Video Games", "Nintendo DS", "Games"]]}