{"asin": "B0002Y2XXQ", "description": "When the King of All Cosmos accidentally destroys all the stars in the sky, he orders you, his pint-sized princely son, to put the twinkle back in the heavens above. The only way you can do that is by rolling everything on Earth into clumps so that he can replace what's missing in space. \"Everything\" includes cookies, lawn mowers, lamp posts, sumo wrestlers, bulldozers, brontosauruses , cruise ships, and more. Katamari Damacy also includes a two-player battle mode where you and a friend can see who can grow the biggest ball of stuff. For one to two players.Features:Play is controlled with the analog sticks only. No buttons to press. No combos to cause distress. Featuring ball-rolling and object-collecting gameplay mechanics of mesmerizing fluidity, reduced to Pac-Man simplicity, through pure absurdity.Dimensions change drastically as your clump grows from a fraction of an inch to a monstrous freak of nature. Go from rolling along a tabletop to ravaging through city streets, picking up momentum, and skyscrapers along the way.Two-player battle mode lets you compete in a race to grow the biggest ball of stuff. Even the competition can be picked up, if your opponent is unfortunate enough to get in your way.Enjoy quirky, infectious humor throughout--from the insanely cosmic animations, to the wacky and wonderful musical stylings, to the royally contagious storyline that's undoubtedly like no other.", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/51J7SDGJ59L._SY300_.jpg", "related": {"also_bought": ["B000A5K5MI", "B0028A6UUY", "B000P297JI", "B00004YRQA", "B000066TS5", "9629971372", "B000TLU67W", "B001MW91IW", "B0009A4EVM", "B00004YRQ9", "B0000C7GHG", "B00009WAVI", "B0000690ZE", "B00005R5PO", "B00019HNNC", "B0045L3SNQ", "B000BLFE9K", "B0013KW1B2", "B0009XBWY6", "B000A32O4W", "B000093NQC", "B000IZAQD8", "B0013JHKU0", "B000WE8JES", "B00001QED2", "B0000AHRPM", "B000CFWHPY", "B0000A0MDV", "B00KVRK39A", "B0032GTMEE", "B0002IQOOQ", "B002EE7OKE", "B0001LQJSK", "B0015MMN6G", "B000E0OBPQ", "B0015ACX3Q", "B00004TNB0", "B001G3B0HC", "B00005LZNI"], "bought_together": ["B000A5K5MI"], "buy_after_viewing": ["B000A5K5MI", "B000066TS5", "B0028A6UUY", "B000TLU67W"]}, "salesRank": {"Video Games": 3244}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "More Systems", "PlayStation 2", "Games"]]}