{"asin": "B0035JD0DW", "related": {"also_viewed": ["B004HO58NO", "B0081IOD1K", "B003VYB1K0", "B001QENO7A", "B006UD5K2Y", "B0011ZK6ZM", "B004HO58NY", "B006YP41I2", "B006TR0FCQ", "B004HO58OI", "B0035WTVZU", "B0090NZSM8", "B00ATM1NAU", "B00B5MUJTO", "B0035WTVZA", "B001PK8FHE", "B00B46XSC6", "B003IJLKZE", "B001D0G56E", "B00E9R04OW", "B0034XIMG4", "B00ANQD52Q", "B00C6XQXT6", "B006T7QZ02", "B0012Y0BIE", "B00AX12XTC", "B00ATM1NBY", "B00BQU11JW", "B00ATM1MVU", "B008RFA3BQ", "B00H26W7WY", "B00CC9QTA2", "B00ANCZO42", "B006T7QSVS", "B004M8SVGQ", "B0031RGEVS", "B006T7QWGO", "B00HGE3CWG", "B005Q645M2", "B004D1UPFM", "B00AX12W8O", "B00B46XRK4", "B001P06Q66", "B00HGE3CZI", "B00DS9YYDE", "B0015ASYJ8", "B00HGE3C5I", "B0091TC3OC", "B006T7QRN2", "B00HGE3CXU", "B001G5ZTZO", "B000ENN9BK", "B0034XFG86", "B000069092"], "bought_together": ["B003VNKNEQ"], "buy_after_viewing": ["B003VNKNF0", "B003VNKNEQ", "B0039BPG1A", "B00B5MUJTO"]}, "title": "Fujifilm FinePix S1800 12.2 MP Digital Camera with 18x Wide Angle Optical Dual Image Stabilized Zoom and 3-Inch LCD", "price": 302.99, "salesRank": {"Camera &amp; Photo": 3952}, "imUrl": "http://ecx.images-amazon.com/images/I/41-yvkFqVZL._SX300_.jpg", "brand": "Fujifilm", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Sporting a 12-megapixel, 1/2.3-inch CCD, a powerful Fujinon 18x wide-angle optical zoom (28mm-504mm equivalent) and an extra large 3.0-inch high-contrast LCD and electronic viewfinder, the FinePix S1800 is perfect for advanced amateur photographers who want an affordable, step-up digital camera that will still fit in the palm of their hand.Finepix S1800 HighlightsHD Movie CaptureCapture movies in HD quality 720p HD.18x Fujinon Optical Zoom LensThe FinePix S1800 features a Fujinon 18x wide-angle optical zoom lens that produces crisp high resolution results throughout the focal range, from 28mm wide-angle to an astounding 504mm telephoto. It also features Instant Zoom, which enables you to keep their subject in a shot at long distance by offering a wide viewing area around the frame and then immediately cropping to the subject once the photo is taken.18x optical zoom in action.Smile and Blink DetectionIn addition to Fujifilm's signature Face Detection, Fujifilm has added two fun and valuable features:  Smile Detection recognizes the precise moment your subject smiles and releases the shutter only when this happens; and Blink Detection warns you if any of your subjects have blinked so that you can re-take the photo if necessary.Tracking Auto FocusThe FinePix S1800 also has Tracking Auto Focus, which allows users to track a moving subject automatically for still picture capture.Auto Picture RotationThe FinePix S1800 has the useful Auto Picture Rotation that ensures your photos are always viewed the right way in playback. Whether you have taken a landscape or portrait image, you can enjoy your pictures whichever way you are holding the camera, as the image will automatically rotate in the screen for easy viewing.Image RetrievalFujifilm has created a new Picture Search tool which allows you to find photos quickly and easily.  You can search with both digital cameras by whichever Scene Mode the photo was taken.  For instance if you select 'Portrait,' you can view all photos shot in Portrait mode, or 'Macro' to see all close up shots, etc.  It's a time saving feature which means that you will no longer have to waste time searching through all your photos to find the ones you are looking for.Additional Features3.0-inch high-contrast LCD and Electronic View Finder: The FinePix S1800 is fitted with a high-contrast 230K-pixel 3.0-inch LCD and Electronic View Finder. The high-contrast LCD is a considerable benefit in bright light and means that the camera can be pitched at various shooting angles to enable framing of awkward shots, while the Electronic View Finder provides even more flexibility for the user.Dual Image Stabilization: Long-zoom cameras need stabilization more than any other compact, with handshake and subject movement a particular problem in low light at telephoto range. The FinePix S1800 reduces blur to a minimum with a mechanically stabilized CCD sensor and high ISO sensitivity (to ISO 6400), so that blur is reduced to an absolute minimum.Face Detection and Automatic Red-eye Removal: To provide perfectly exposed and focused portrait shots, the FinePix S1800 is fitted with Fujifilm's latest Face Detection technology which is able to track up to 10 faces simultaneously, at almost any angle to the camera. The system instantly corrects red-eye and then saves both the original and the corrected image file automatically.Dual Image Stabilization"}