{"asin": "B0036WT3TS", "categories": [["Electronics", "Television & Video", "Televisions", "LCD TVs"]], "description": "Samsung LN55C650 LCD tv(March 2010)The Samsung LCD 650 HDTV is a smooth operator: 120 Hz Clear Motion Rate technology allows you to see fast action with a smoothness that&rsquo;s clearly ahead of the competition. The AllShare feature even allows you to sync up your entire household: A wired or wireless DLNA connection lets you stream your PC audio and video files to your HDTV using your remote. And Samsung&rsquo;s Touch of Color design combines texture and color that will complement any d&eacute;cor.Key FeaturesScreen Size:55 inchesFull 1080p HD resolution:Enjoy the powerful picture quality, vivid colors and stunning clarityof Full HD 1080p resolution.120 Hz Clear Motion Rate:Samsung 120 Hz technology allows you to see fast action with a smoothness thats clearly ahead of the competition.Touch of Color: ExclusiveredTouch of Color design combines texture and color that can complement any room.ConnectShare Movie:Connect a thumb drive or digital camera quickly and easily. User-friendly interface allows access to videos, a music playlist and pictures via the remote.SAMSUNG SMART TV:Connect to an ever-expanding portal of your favorite digital content. Customizable widgets give you access toBLOCKBUSTER, Facebook, YouTube, Flickr, Amazon Instant Video and more &ndash; all on your HDTV.Exceeds ENERGY STAR Standards:Up to 43% more energy efficient than ENERGY STAR 4.0 minimum standards.Game Modeenhances dark areas, sharpens the picture, speeds up the image processing response and enhances the sounds of your games. Picture and sound quality optimized for the special needs of gaming systems at the touch of a button.Wide Color Enhancer Prodelivers the entire spectrum of color and luminance for rich, saturated images with intense detail.&nbsp;BD Wise:Automatically adjusts all your componets for the best picture and sound quality.AllShare:Sync up your entire household. A wired or wireless DLNA connection lets you stream your PC audio and video files to your HDTV using yoru remote.10 Watts x 2 audio power stereo broadcast reception:Supports multichannel sound (MTS)and second audio program (SAP) with 181-channelcapacity.SRS TheaterSoundWarranty:1 year parts and 1 year labor warranty (90 days parts and labor for commercial use), backed by Samsung toll-free support.Swivel StandConnections4 HDMI (High-Definition Multimedia Interface):&nbsp; 3 back, 1 sideHDMI makes it easy to connect your home theater with one cable per component.Anynet+ (HDMI-CEC): Allows peripheral AV devices such as a DVD player to be controlled by a Samsung TV remote control.USB: 2 sidePC input: 1 backDimensionsTV without stand: 51.2 x 31.5 x 3.4 inches (WxHxD); 61.9 poundsTV with stand: 51.2 x 33.3 x 12.0 inches (WxHxD); 72.1 poundsWhat size TV should you get?Accessories2010 LinkStick:Connect wirelessly to a world of digital content from Samsung. The LinkStick wireless LAN adaptor eliminates the hassle and cluttered look of wires. Learn more about theSamsung WIS09ABGN LinkStick Wireless LAN Adapter.Learn MoreCOMMENT: ==========================================COMMENT: ==========================================Wide Color Enhancer ProDelivers the entire spectrum of color and luminance for rich, saturated images with intense detail. Whereas blue and green shaded areas of the picture are washed out on conventional screens, wide color enhancer lets you experience more brilliant colors. Simply imagine a wider range of colors than you ever thought possible.COMMENT: ==========================================ENERGY STARBy being ENERGY STAR compliant you are assured that your Samsung model is helping the environment by using less energy while saving you money. ENERGY STAR is a joint program of the U.S. Environmental Protection Agency and the U.S. Department of Energy promoting energy efficiency.COMMENT: ==========================================SAMSUNG SMART TVSAMSUNG SMART TV lets you enjoy more with Internet TV, allowing you to receive content via Yahoo!, Flickr, and more on screen. It also includes a content library so you can enjoy pre-loaded content, such as cooking recipes and fitness exercises. Plus, DLNA CERTIFIED connectivity lets you remotely access your PC's personal media so that you can download music, video, and photos and enjoy them anywhere in the home your TV is.11 Internet access and either Ethernet connection or wireless LAN access required.COMMENT: ==========================================COMMENT: ==========================================Which Size HDTV is Right for My Room?With standard-definition TVs, the rule used to be that viewers would feel comfortable watching a set from a distance of 3 to 6 times the screen size in inches. With HDTV, the resolution is so much better that you can sit closer to a larger TV without noticing the pixels. So with HDTVs, the rule tends to be you can sit anywhere from 1.5 to 3 times the screen size (in inches) for the best experience.If you know the size of the room you have already, where you want to sit, and where your new HDTV should go once you get it, you can figure out the size HDTV you should get.Minimum size = Viewing distance/3Maximum size=Viewing distance/1.5", "title": "Samsung LN55C650 55-Inch 1080p 120 Hz LCD HDTV (Black) (2010 Model)", "price": 34.99, "salesRank": {"Electronics": 54454}, "imUrl": "http://ecx.images-amazon.com/images/I/516esIPDnsL._SX300_.jpg", "related": {"also_viewed": ["B004VC1PCA", "B0036WT4JW", "B002HDZNSC", "B007B9PP1C", "B0028YB8MA", "B0036WT4EW", "B00BCGRVX0", "B0077D1LTW", "B00BFDHVAS", "B005FUXD1S", "B00752NJMC", "B00BCGRRZ2", "B00BFRKYVM", "B007BG54A2", "B0036WT3YS", "B0036WT4EC", "B0078LN0K6", "B004LFCYRM", "B00A0EUA2Y", "B00BCGRRWA", "B00I94IPTW", "B009H8JOZS", "B00BCGROJG", "B00BCGROG4", "B00BCGRLUI", "B00HPMCO14", "B00I2MPHM4", "B00II6VW3M", "B00GKKI4IE", "B00BCGROGE", "B00BCGRLX0", "B00BB9OOFG", "B0074FGW5G", "B00BCGRYY6", "B00BCPGOD4", "B00ICDAAXO", "B00GTE0VJ6"], "buy_after_viewing": ["B0079KZZKO", "B00BGGDVOO", "B0074FGSBY", "B00A8MGLAI"]}}