{"asin": "B001TI9F8U", "categories": [["Electronics", "Camera & Photo", "Lighting & Studio", "Photo Studio", "Backgrounds"]], "description": "The CowboyStudio 40in Photo Soft Box Light Tent with 4 Chroma Key Backdrops would be a great addition to your studio. The light tent, which can be used by amateur and professional photographers, makes it easy to take professional digital photos of products and items. It is ideal for online sellers, photography lovers, and collectors. Not only does the material of the tent provide a background for the subject, but it also filters the light from the source, creating a very even, almost shadow-free light across objects inside the tent. This helps to decrease harsh shadows and reflections on shiny objects, such as metal or glass, and gives a clean, crisp backdrop to all items.&nbsp; Its special nylon fabric diffuses the external light, softens shadow, and reduces glare to create the perfect result.Light tents work well with both film and digital cameras. When using a digital camera, your camera must be set for outdoor shooting. Be sure to adjust lighting as needed.Each tent comes with a black, white, dark blue, and red background, as well as a carrying case.&nbsp;SpecificationsBackgrounds fasten to the tent with VelcroMade from translucent light diffusing white nylon fabricDetachable front door cover with slit for camera lensEasy to fold and store in its carry caseOne year manufacturer&rsquo;s warrantyDirectionsSet up the light box on a table or another flat surface.Place the item you are photographing in the photo tent toward the back.Position two lamps on either of the enclosed sides of the photo tent. Turn the lamps on. Point them directly at the box. Move them around until they light the object in a way that is visually pleasing to you. If you want you can add a boom light which is a light that hangs over the top of the box. This light serves to make the object stand out from the background. Don't let the light hang into the box if your photo tent has an open top.Set up your tripod in front of the box. Attach your camera to the tripod.Focus the camera on the object in the box. Make sure you can't see the outside of the box in the viewing area.Take a photograph. If you are using digital, check the photo to see how your lighting arrangement appears. Adjust the lighting as needed.", "title": "CowboyStudio 40-Inch Photo Soft Box Light Tent with 4 Chroma Key Backdrops", "price": 49.99, "imUrl": "http://ecx.images-amazon.com/images/I/31z3Tm%2BcfqL._SX300_.jpg", "brand": "CowboyStudio", "related": {"also_bought": ["B002SOBPH8", "B002PNEDFS", "B0002J2TLC", "B00IEPXJZG", "B005SSMT8A", "B00HX4WLIU", "B0034TUDD8", "B002ZVILLC", "B002ZV82QQ", "B003MU7D0U", "B008SC0DRW", "B0036NSF7I", "B004LONG0W", "B003QA1VEK", "B003WLY24O", "B000W07Y5M", "B001WB02Z4", "B000ASTKWQ", "B001MLBK0U", "B008ND5GS2", "B004AZ38Z0", "B001196MG0", "B002ZIMEMW", "B004TGZ7WM", "B009F37CM2", "B004L75BGQ", "B004U5F3OE", "B002MFLWVM", "B0011GJZXU", "B008ND5FA6", "B0018LQVIA", "157990906X", "B0002ER2YQ", "B000UCOZP4", "B004HR42LK", "B00485ZI6Y", "B0096EA4NO", "B0049XGNKK", "B0019SHZU0", "B00BXA7N6A", "B002SSL920", "B0034WR19Y", "B000PTFDYO", "B000OPWSYM", "B001QUIEIS", "B003Y30334", "B007FH8MS8", "B007FH1KX2", "B0019HZQPM", "B003PQJ6EC", "B0079M711S", "B0031AQ302", "B003TYDBYQ", "B000V7AF8E", "B005FHZ2SI", "B000BFYXGG", "0321749588", "B00004ZCJM", "B004TJ6JH6"], "bought_together": ["B002SOBPH8", "B0002J2TLC"], "buy_after_viewing": ["B002SOBPH8", "B001AZV0BW", "B0002J2TLC", "B000BFYXGG"]}}