{"asin": "B0017HW5LM", "description": "Get your hands dirty in the early stages of the epic battle between UNSC and Covenant. Developed by Ensemble Studios,Halo Warsfor Xbox 360&nbsp;brings all the drama of a real-time strategy game to the popular Halo Universe. Set in the year 2531, before the initial Halo first-person shooter game, this game lets you control the human armies of UNSC in a whole new way..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; }Play as UNSC or Covenant and exploit your faction's unique strengths.View larger.Invade enemy strongholds full of advanced technology.View larger.Find ways to make the detailed environments work for you.View larger.Bring in air support to turn the tide of battle.View larger.Experience the Epic Battle from a New PerspectiveDefense, offense, and the ability to hold down a command center in the face of hostile attacks: there's a lot to think about when laying out tactics for an all-out alien war. Featuring detailed environments and complicated new battle mechanisms, this game demands a different kind of perspective than the first-person shooters from the original Halo series. You'll need to uncover the hidden strengths and weaknesses of each unit and play them to your tactical advantage, and that's just the beginning.UNSC: Be Part of a Legendary ConflictThe story opens with UNSC forces retaking the planet Harvest from the Covenant. At your disposal -- should you choose to take command of UNSC forces -- will be everything from a corps of highly-trained Marines to the Warthogs, Scorpions, and Hornets you'll need for air and land attacks. You'll take stock of the map and decide between holding your ground or advancing on enemy strongholds, all while trying to navigate the local terrain and outsmart Covenant forces. And when you need something extra to tip the tide in your favor, UNSC leaders can provide you with the ability to mobilize highly specialized units or call the Spirit of Fire vessel for support from above.Covenant: A Capable, Playable Enemy FactionThat's right, Covenant is playable in this corner of the Halo universe. This alliance of alien species has manipulated advanced technology, firepower, and tactical prowess into a powerful force that is engaged in a Genocidal war against human race, having branded humans as heretics. With the ability to play as these tough, alien fighters, you'll have advanced shield technology, the modular Citadel at the heart of Covenant's colonizing power, and, of course, the iconic Scarab attack vehicle at your disposal, adding a whole new dimension to your strategic warfare. The Scarab is a terrifying military vehicle crafted from heavy mining equipment. And with a mining laser that delivers massive damage across battlefields large and small, turrets for taking on air attacks, and the ability to clamber over any terrain, what's not to love about commanding Scarabs instead of fighting against them?Developed Exclusively for Xbox 360Most console RTS games are adapted from existing PC games, which can make their controls bulky or awkward, butHalo Warshas been developed for Xbox 360 from the ground up. This means the controls are sensitive, intuitive, and easy-to-operate in the midst of battle. And the UI is just as intuitive, so whether you're managing a unit of marines or a deadly machine, you can focus on creating a battle strategy instead of worrying about how to overcome a clumsy controller.No matter which faction you choose to play as, you can test your skills against those of other players in online skirmishes that allow up to six players with the New Xbox Experience through Xbox LIVE.", "price": 15.47, "imUrl": "http://ecx.images-amazon.com/images/I/51SIob3HnfL._SY300_.jpg", "related": {"also_bought": ["B001HWB68K", "B002BSA20M", "B000FRU0NU", "B0050SYY5E", "B0050SYX8W", "B00008J7NZ", "B0009S4UOA", "B00005NZ1G", "B001AZ7RJ6", "B001F6KSDM", "B000ZK9QD2", "B00269QLI8", "B002WCLG48", "B001AWIP68", "B000K8YAKI", "B000FRS9II", "B000NSH4YY", "B000O5FUQ0", "B002I0H79C", "B000G7YRHO", "B000X25GX6", "B000PE0HBS", "B007XVTR3K", "B00503E8S2", "B003JVKHEQ", "B00GV8QTPU", "B00FKV8AK6", "0761561811", "B00BU3ZLJQ", "B003ZSP0WW", "B0016B28Y8", "B000A0EFJW", "B000XYUVAC", "B002BSA1MQ", "B000WMEEB2", "B00354NAYG", "B003O6G5TW", "B001TORSII", "B001CRQYBO", "B004FYEZMQ", "B008KE95UO", "B00149NCYW", "B0028IBTL6", "B0054OGCS6", "B000UU3SVI", "B000P8WOMO", "B002I0H2AG", "B003S2MXRA", "B000O5DS32", "B003L8HQ7S", "B002I0JK38", "B0047S4642", "B000Q4VK86", "B000930DA0", "B0044SA70M", "B000OLXX86", "B000ZJVDA2", "B000C427NM", "0765367297", "B001NJ293I", "B008QSBDHM", "B000FRVAD4", "B001QXNBJM", "B002DC8GKE", "B000WSE2WM", "B0050SYK44", "B000H94PVO", "B000G7PMXC", "B008E6ZXT0", "B002I098JE", "B0050SY5BM", "B00BGT5TVE", "B002I0JGDM", "B008X5C2MI", "B001ASJISG", "B0034JKYO6", "B0016BVYA2", "B001SH7YMG", "B006G1LJWA", "B004PAGJOC", "B000WMEEAI", "B0002A2S26", "B005YR1VP2", "B00C71034I", "B004PFS9OK", "B000QS1K46", "B00770KR7W", "B000R0URCE", "B0044TD9HY", "B001AWIOYG", "B0037LTTRO", "B0014ULQB2", "B001UWGDC6", "B0025KZV7A", "B0050SYEYK", "B000P46NMK", "B0050SYV70", "B00EFFW0HC", "B000P297E8", "B000O5K3TO"], "bought_together": ["B002BSA20M", "B001HWB68K"], "buy_after_viewing": ["B0034JKYO6", "B001HWB68K", "B002BSA20M", "B000FRU0NU"]}, "salesRank": {"Video Games": 2926}, "categories": [["Video Games", "Xbox 360", "Games"]]}