{"asin": "B0016P5ASK", "description": "Western Digital 1TB My Book Studio Edition II Dual-Drive Storage System with RAID Quad interface, RAID-enabled, about 30% less power consumption, formatted for Mac. The My Book Studio Edition II treads lightly on the earth and carries big performance for creativeprofessionals.   Features: * The speed youneed - Lightning-fast FireWire 800 combined with RAID 0 (Striped) yields the speed you need for smooth video editing, rendering complex 3D objects orspecial effects and saving huge blocks of data inrecord time.  * Cooler, quieter, eco-friendlier- Designed to use only WD's GreenPower drives, this system uses about 30% less energy than standardsystems and runs quietly because it doesn't need a fan.  (* Based on comparison between a 1 TB dual-drive system using 7200 RPM drives and a 1 TB dual-drive system using WD's GreenPower drives.)  * Formatted for Mac - Works with Apple's Time Machine. Includes software and instructions for reformatting to Windows.  * Quad interface - Power your creativity with connections for ultra-fast eSATA and FireWire 800. For flexibility and convenience, FireWire 400 and USB 2.0 are also included.  * User serviceable - Want to upgrade a drive? Simply open the case and replace the existing drive  no screwdriver needed. * Automatic backup software - Back up important projects to multiple destinations including file servers, portable drives andMy Book. Set it and forget it; every time you save a change it's automatically backed up.  * Capacity gauge - See at a glance how much space is available on your storage system.  * Intelligent drive management features - Automatic power-up, SafeShutdown, and LED status and activity lights makethis storage system especially easy to use. (Works with USB and FireWire connections only.)    System Requirements: Available USB port, FireWire 800 or 400 port, eSATA port or eSATA adapter card  Ma", "title": "WD My Book Studio II - 1 TB (2 x 500 GB) USB 2.0/FireWire 800/400/eSATA Desktop External Hard Drive", "price": 184.5, "imUrl": "http://ecx.images-amazon.com/images/I/414-XE9pN5L._SY300_.jpg", "related": {"also_viewed": ["B004QGXOP2", "B004QGXOOI", "B004QGXOOS", "B00F0JXDUU", "B0090A8TWW", "B00F0JXDXM", "B00F0JXE04", "B0090A8TYA", "B004J6JW1Y", "B006W3ZWXE", "B009PK6VWM", "B00F0JXE0Y", "B002LZV0B0", "B0090A8TY0", "B0090A8TX6", "B00CO1HUGU", "B00KU68A1A", "B002QID2NG", "B003FQBJZQ", "B009VQ7KPM", "B00F0JXDCS", "B000VZCEU8", "B00ITI05CS", "B004J6GNUC", "B00AK9ZT98", "B00I2P57TO", "B002RL8IH2", "B00I2P53NY", "B00E6N9HEC", "B00I2P82CS", "B005ELBSWO", "B00I2P56FE", "B000WGJZ44", "B00F0JXDB4", "B003DTK1HC", "B008R7EWF2", "B004E9SGUO", "B00E3RH61W", "B00E6N9GS4", "B0050SI9W8", "B003MVZ60S", "B0064XAJ5I", "B00AGI7I2O", "B00429N16A", "B0064XAIZY", "B0097C4WQU", "B009PK6W08", "B003IT6XBK", "B009AP6X0C", "B009VL9VC2"], "buy_after_viewing": ["B004QGXOOI", "B004QGXOP2", "B004QGXOOS", "B000AAZQJU"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]]}