{"asin": "B000R7X80U", "description": "Stylishly and intelligently designed for mobile professionals, Apple's MacBook Pro gets a serious speed bump with the new, powerful Intel chipset (dubbed Santa Rosa), which provides a faster Core 2 Duo processor, longer battery life, and native support for 802.11n wireless connectivity. This model (MA895LL/A) also includes a new mercury-free, power-efficient LED-backlit display measuring 15.4 inches and a state-of-the art NVIDIA GeForce 8600M GT video card for more realistic graphics for animation and gaming. This MacBook Pro is powered by the new 2.2 GHz Core 2 Duo T7500 processor and 2 GB of 667 MHz DDR2 memory--the fastest portable computer memory currently on the market (June 2007). But some things haven't changed: the trademark stunning aluminum enclosure that's is just one-inch thin, built-in iSight video camera, and Apple's magnetically connected MagSafe power adapter, which safely disconnects when under strain.COMMENT: place in \"specs_1inch20061024.png\"This MacBook Pro measures just 1 inch thin and weighs 5.4 pounds.Other hardware features include a 120 GB hard drive, 8x SuperDrive for burning multiple disc formats, built-in 10/100/1000 BASE-T Gigabit Ethernet for high-speed networking, Bluetooth 2.0+EDR (Enhanced Data Rate), a FireWire 800 and a FireWire 400 port, an ExpressCard/34 expansion card slot for expansion solutions such as 3G wireless networking, and a DVI video output.Intel Core 2 Duo ProcessorThe Intel Core 2 Duo T7500 processor has a 2.2 GHz processor speed, super-fast 800 MHz front-side bus (FSB), and an enormous 4 MB of Smart Cache, an L2 cache that can be shared between the cores as needed. (An L2, or secondary, cache temporarily stores data; and a larger L2 cache can help speed up your system's performance. The FSB carries data between the CPU and RAM, and a faster front-side bus will deliver better overall performance.)The Intel Core 2 Duo's 128-bit SSE3 vector engine handles 128-bit computations in a single clock cycle, accelerating data manipulation by simultaneously applying a single instruction to multiple data. And its two execution cores are designed to share resources and conserve power, helping it to achieve higher levels of performance since it uses fewer wattsCOMMENT: place in \"macbook-rounded-400.jpg\"The new 15-inch MacBook Pro offers a new mercury-free, power-efficient LED-backlit display with an antiglare finish that's perfect for color-minded professionals.Display and GraphicsThe 15.4-inch widescreen TFT (non-glossy) display offers a native resolution of 1440 x 900 pixels and an antiglare widescreen display that's perfect for color-minded professionals. The new MacBook Pro display is backlit by light emitting diodes (LEDs), which gives it a lighter weight and more power efficiency than the cold cathode fluorescent lamps (CCFLs) which most notebooks employ. It's also better for the environment, thanks to its new mercury-free display.Video and graphics are powered by the NVIDIA GeForce 8600M GT card, which is boosted by 128 MB of GDDR3 SDRAM. GDDR3 (Graphics Double Data Rate, version 3) is a graphics card-specific memory technology that's better able to deliver fluid frame rates for even the most advanced games and applications. The GeForce 8600M GT brings a new level of realism to the MacBook Pro with its 16-lane PCI Express architecture, 16x full screen anti-aliasing, 128-bit High Dynamic Range rendering, and a texture fill rate of up to 8.2 billion per second.Hard Drive and MemoryThe 120 GB Serial-ATA (SATA) hard drive (5400 RPM) provides more than enough space to store business-related documents and presentations, as well as offers space for a large digital audio and video library. This SATA hard drive also quickens the pace with a higher speed transfer of data--akin to FireWire and USB 2.0. The 2 GB of PC5300 DDR2 RAM (two SO-DIMMs of 1 GB) have an industry-leading 667 MHz speed, and the RAM capacity can be increased to a whopping 4 GB.Wireless ConnectivityThe built-in 802.11n wireless networking provides up to five times the performance and twice the range of 802.11g, but it's also backward-compatible with 802.11a/b/g routers, enabling you to communicate with the a wide variety of Wi-Fi resources. It works seamlessly with the new AirPort Extreme with 802.11n. Use the built-in Bluetooth wireless technology to connect to your PDA or cell phone, synchronize addresses, or download pictures from your cell phone. You can also use a wireless headset for iChat audio chats and VoIP calls as well as quickly share files with a colleague.Video Conferencing with Built-in iSightArtfully placed in the display bezel is an iSight camera, which enables easy video conferencing as well as allows you to snap pictures of yourself and create video podcasts. Using the iChat AV application, video conferencing is integrated into your iChat buddy list, so initiating a video conference is a breeze. iChat also lets you hold audio chats with up to 10 people and provides high-quality audio compression and full-duplex sound so conversation can flow naturally. For video podcasting, you can record a short clip using the iSight camera, then use iWeb to create a video blog entry or post your GarageBand-recorded podcast.Apple InnovationsCOMMENT: place in \"indexmagplug20061024.png\"The magnetically connected MagSafe power adapter breaks cleanly away, without damage to either the cord or the MacBook Pro, if you trip over the cord..The MacBook Pro is the culmination of years of refining hardware and software design to an integrated art. One of Apple's most celebrated innovations is the MagSafe power adapter connector with offers a magnetic connection instead of a physical one. So, if you happen to trip over a power cord, you won't send MacBook Pro flying off a table or desk--the cord simply disconnects, without damage to either the cord or the system. As an added nicety, this means less wear on the connectors.COMMENT: place in \"design_scrollanim20061024.gif\"Using two-fingered scrolling, you can easily scroll around your documents or open contextual menus with one hand.The trackpad can tell if you've got one finger on the pedal, or two. With two, you can easily scroll around your documents or open contextual menus. When you need right-click functionality, simply open &#xD2;Keyboard and Mouse&#xD3; in System Preferences and enable the secondary click preference.The MacBook Pro has battery life that rivals most notebooks in its class. If you'd like to make that battery last even longer, Mac OS X has a few tricks up its sleeve. Go to System Preferences, click Energy Saver, and change battery optimization from Normal to Better Battery Life. Or tell MacBook Pro to reduce its screen brightness and give yourself a little more time untethered.And with the included Apple Remote and Front Row software, you can show off your latest photos and access your iTunes music and playlists from across the room. You can also use it to watch downloaded movies and TV episodes as well as control playback of DVD movies. The Apple Remote features a minimalist six buttons--just press the Menu button to activate Front Row and begin to navigate through your media. You can even use the remote to control Keynote presentations in iWork '06.Other FeaturesTwo USB 2.0 ports, one FireWire 400, one FireWire 800, ExpressCard/34 slotDVI output port; VGA output using included DVI to VGA adapter8x slot-loading SuperDrive with the following write speeds: 8x DVD-R, DVD+R; 4x DVD-R DL (double layer), DVD+R DL (double layer), DVD-RW, DVD+RW; 24x CD-R; 10x CD-RWBacklit keyboard with ambient light sensors for automatic adjustment of keyboard illumination and screen brightnessInternal omnidirectional microphone and built-in speakersCombined optical digital output/headphone out (minijack)Combined optical digital input/audio line in (minijack)60-watt-hour lithium-polymer battery (with integrated charge indicator LEDs) providing up to 6 hours of battery lifeKensington cable lock slotMeasures 14.1 x 9.6 x 1 inches (WxDxH) and weighs 5.4 pounds (including battery)Included SoftwareMac OS X v10.5 Leopard (includes Spotlight, Dashboard, Mail, iChat AV, Safari, Address Book, QuickTime, iCal, DVD Player, Xcode Developer Tools), iLife '06 (includes iTunes, iPhoto, iMovie HD, iDVD, iWeb, GarageBand), Microsoft Office 2004 for Mac Test Drive, a 30-day trial of iWork '06, Comic Life, FileMaker Pro Trial, OmniOutliner, Photo Booth, and Front Row.What's in the BoxMacBook Pro (15-inch, 2.2 GHz); 85W MagSafe power adapter, AC wall plug, and power cord; lithium-polymer battery; Apple Remote; DVI to VGA adapter; install/restore DVDs; printed and electronic documentation. It's backed by 90 days of telephone support and a one-year limited warranty.", "title": "Apple MacBook Pro MA895LL/A 15.4&quot; Laptop (2.2 GHz Intel Core 2 Duo,  2 GB RAM, 120 GB Hard Drive, DVD/CD SuperDrive)", "imUrl": "http://ecx.images-amazon.com/images/I/41noMmE6jBL._SX300_.jpg", "related": {"also_viewed": ["B0017J7T7A", "B0013FLU96", "B005CWJ1DI", "B002QQ8EKO", "B0037BYQTU", "B002C7458M", "B0017HSZWK", "B001LYX3MQ", "B003GSLU3O", "B003G2ZKLS", "B0064YWOQY", "B0083J8NPE", "B002QQ8H8I", "B002C7446A", "B005CWIVYI", "B001P05NKG", "B0074712UY", "B003GSLU3E", "B005CWJ76O", "B000BNHM0C", "B003G2ZKMC", "B002C7489S", "B0074703CM"], "buy_after_viewing": ["B0064YWOQY", "B0037BYQTU", "B001LYX3MQ", "B0083J8NPE"]}, "categories": [["Electronics", "Computers & Accessories", "Laptops"]]}