{"asin": "B002UAUZQW", "related": {"also_bought": ["B003WQ2MT6", "B00365EE2G", "B0033WSYZU", "B002UATB0I", "B005DWU0VO", "B002YKPX6U", "B0054CFKQI", "B003H26Z34", "B005LXOP8Y", "B00IYHVI02", "B00JL1490G", "B0050SPZKW", "B0063L9UJW", "B001HL84Z4", "B005DWR4A4", "B0054JE64I", "B00F4Q4J1Q", "B007Z419BI", "B008HAD3CW", "B003Q6CSVE", "B0030MHIZ0", "B00ATZJ5YS", "B004OH3S3G", "B007408NSA", "B00DH10ZYA", "B004FNS7DA", "B004O7CWYC", "B002VPE1QG", "B009LENJ90", "B00535CMEE"], "bought_together": ["B003WQ2MT6", "B00365EE2G"], "buy_after_viewing": ["B0054CFKQI", "B0054JE64I", "B00365EE2G", "B0033WSYZU"]}, "title": "Targus Premium Laptop Charger (AC/DC) APM69US (Piano Black)", "price": 31.98, "salesRank": {"Computers & Accessories": 2242}, "imUrl": "http://ecx.images-amazon.com/images/I/415CkmDFikL._SY300_.jpg", "brand": "Targus", "categories": [["Electronics", "Computers & Accessories", "Laptop & Netbook Computer Accessories", "Chargers & Adapters"]], "description": "The Targus Laptop Charger is half the size and weight of typical AD/DC chargers and is about the size of a blackberry. As the smallest adapter on the market, this charger is ideal for travel and includes 9 laptop tips, one mini-USB tip for cell phones, cameras or other compatible devices and one iPod/iPhone tip. Easily power or charge a laptop and one additional item such as a Blackberry or iPod at the same time. For added convenience the charger plugs directly into the wall and the AC prongs rotate 180 degrees, allowing the user to plug the charger into a power strip without blocking other outlets. The prongs also lie flat for added portability. To charge or power multiple devices in the car, the charger includes a portable auto adapter. The thin, lightweight cord packs quickly and easily and includes an elastic band for cable management. The integrated tip storage clips onto the power cord so tips stay with the charger and are readily available when needed. The Premium Laptop Charger also comes with the Tips From Targus Program which supplies users with a free tip* for your 2nd laptop and/or cell phone and free tips for future laptops and cell phones so the charger remains compatible with your devices. Form Factor- Half the size and weight of typical AC/DC chargers; includes integrated cable management and tip storage. Functionality- Power or charge two items simultaneously with the same adapter through an AC outlet or in a car/plane. Convenience- Compatible with leading laptop manufactures; Includes 9 tips for laptops, one mini-USB tip for cell phones or cameras and one iPod/iPhone tip. Tips From Targus Program gives free additional tips to make sure your devices are covered. 60% less materials are used to build this product; One charger can be used to power or charge everything by changing the tip. RoHS Compliant- Yes **Please be advised that new Targus product should arrive in sealed retail packaging as shown in the image gallery."}