{"asin": "B001G3B0HC", "description": "Kingdom Hearts Re: Chain of Memories bridges the gap between the original Kingdom Hearts and the sequel, Kingdom Hearts II. Chain of Memories from Square Enix for the Sony PlayStation 2 is a complete 3D remake of the original Game Boy Advance release from 2004. This \"bridge\" installment was released in Japan in 2007 as part of the Kingdom Hearts II Final Mix+ compilation before finally making its way to North America. Combined with the card battle system of the original Game Boy Advance release, Chain of Memories for PS2 presents Kingdom Hearts fans with an entirely new gameplay experience..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }This remake of the GBA original features improved graphics.View larger.Donald and Goofy will lead you to spectacular adventures.View larger.You'll meet and get advice from many familiar faces.View larger.The PrologueThe story begins with Sora, Donald and Goofy wandering through endless fields. Eventually, they come to a crossroad. Standing in the crossroads, Sora gazes up at the night sky and thinks of his lost friends.From the distance, a mysterious man approaches from one of the roads. \"Ahead lies something you need,\" he says, \"but to claim it you must lose something dear.\" The man vanishes, revealing a single path that leads to the eery Castle Oblivion, which resembles a girl's drawing.The StoryAfter this encounter, Sora, Donald, and Goofy go their separate ways. Soon, on a night when his island home is besieged by a mysterious storm, Sora is whisked away to an unfamiliar burg known as Traverse Town. There he meets Donald and Goofy, and learns that there are strange things happening in the world.Donald and Goofy set off to look for their missing king, and Sora joins them to search for his lost friend, Riku. After a long journey that takes them across numerous worlds, Sora and friends finally find Riku and the lost king. But to save all the worlds, Sora must use his Keyblade to close the door to darkness, even though Riku and the king are on the other side. Believing the king's parting words --there will always be a door to the light-- Sora locks the door, and the trio sets out on yet another journey.The CharactersThe cast of Chain of Memories combines Kingdom Hearts characters with familiar Disney faces. Sora, is a 14-year-old boy and the hero of this tale. Although a little naive, Sora has an uncommon sense of justice. On his journey, Sora is accompanied by Donald, a court wizard who shares a striking resemblance to Donald the Duck of Disney fame, and the clumsy, easy-going captain of the Disney Castle Royal Knights, Goofy.Other characters include the mysterious, shrouded man from the crossroads; Sora's lost friend, Riku, a 15-year-old boy who is cool and collected; the lost King, who bares a striking resemblance to Mickey Mouse; and Kairi, a 14-year-old girl who's friends with Sora and Riku. Almost more strange than the man at the crossroads, a mysterious girl, Namine, draws pictures inside Castle Oblivion under close surveillance of an evil organization. As the story alludes, she may hold the key to Sora's most special memories.", "price": 14.99, "imUrl": "http://ecx.images-amazon.com/images/I/51SEVg71qOL._SY300_.jpg", "related": {"also_bought": ["B0009A4EVM", "B000066TS5", "B000IVIP7G", "B001TD6SK8", "B002I08UPC", "B00008URUA", "B002I0GZ5Y", "B00005TNI6", "B00004YRQA", "9629971372", "B000TLU67W", "B000FDOTIQ", "0744005264", "074400473X", "B000099T1Y", "B001MW91IW", "B006OI3CTS", "B00005R5PO", "B00068O278", "B000F5IH2I", "0744001986", "B00020LZAM", "B0009I6S0O", "B00004YRQ9", "B002ZQDAVI", "B00067MX98", "B008SBZD5U", "B0013JHKU0", "B00000JRSB", "B0000C7GHG", "B0045L3SNQ", "B0013KW1B2", "B00004YUWA", "B004S3KB6S", "B006UO7RUG", "B0045WL026", "B000IONGU4", "B00020LZBG", "B00829H3E2", "B0032GTMEE", "B00006GSNX", "B00004S9AF", "B000056C34", "B0000690ZE", "B002I0GXWO", "B000GACEHQ", "B000099T2E", "B00004ZDFY", "B000XYFB9I", "B0032GPYO6", "B000IZAQD8", "B00008RUYZ", "B000SEU92W", "B000XYAG7K", "B0002GTFIK", "B000TYQL1O", "B002BWS5QG", "B000WE8JES", "B0009F3E1I", "B000N0WBL8", "B00019HNNC", "B00004Y57G", "B000059Z8I", "B0000296O5", "B00007KQC1", "B000G7X5P4", "B000CFWHPY", "B00006F2ZT", "B000E991PC", "B00D875R5K", "B00006FWUU", "B00005MDZD", "B002DGG9KY", "B0015HZLVA", "B0001VNNE8", "B00004TC6E", "B00000IZS1", "B0009O7HVM", "B0009XBWY6", "B0007DFIK2", "B007R1NYPS", "B0002Y2XXQ", "B00004TNB0", "B00097CYZS", "B002J9QIWY", "B001QH17R6", "B0009I6S0Y", "B000E0VMVM", "B0015HZLVK", "B001UIG6M2", "B0001I9YGC"], "bought_together": ["B0009A4EVM", "B000066TS5"], "buy_after_viewing": ["B0009A4EVM", "B000066TS5", "B008SBZD5U", "B008SBZD5U", "B000IVIP7G"]}, "salesRank": {"Video Games": 1739}, "categories": [["Video Games", "More Systems", "PlayStation 2"]]}