{"asin": "B001TK3D4A", "categories": [["Electronics", "Television & Video", "Blu-ray Players & Recorders", "Blu-ray Players"]], "description": "Experience the Blu-ray difference with the Samsung BD-P1600. Enjoy incredibly detailed images and brilliant color in full high definition 1080p resolution. In addition to a fantastic picture, enjoy cutting edge features like support for Netflix and Pandora movie/music streaming; BD-Live support; and two USB connections for updating firmware, adding wireless ability, or playing back MP3/WMA files. Watch your favorite DVDs and Blu-ray Discs, listen to CDs with the highest-quality audio, and plenty more.A sleek, stylish and powerful Blu-ray player.Click to enlarge.Experience vivid, crystal-clear visuals that are more natural, more realistic and simply stunning.Get more out of a Blu-ray Disc than what's on it with BD-Live.Experience billions of colors, high definition audio and improved frame rates with a single cable.Blu-ray full HD playbackDigital imaging is made up of pixels. The more pixels in a picture, the clearer it is. With Blu-ray full HD (and 24 frames-per-second) playback, you get every single pixel out of a film possible. Experience vivid, crystal-clear visuals that are more natural, more realistic and simply stunning.BD-Live readyGet more out of a Blu-ray Disc than what's on it. BD-Live 2.0 lets studios future-proof their Blu-ray titles, so they can add content to BD-Live Ready discs even after they have been shipped. Simply connect your Blu-ray player to the Internet (through the included Ethernet port or using an optional Link Stick USB wireless dongle) to download images, subtitles and more. Text-chat with friends during a movie, or play against others in online trivia games to unlock exclusive video content and earn discounts on other products.Multi Format PlaybackIn addition to Blu-ray discs, you can drop in a normal DVD and watch the picture get upconverted to near HD quality. Your CDs will also sound great, and you can play MP3/WMA audio from CD, DVD or USB. Or enjoy looking at your favorite JPG files from photo CDs.HDMI 1.3Experience billions of colors, high definition audio and improved frame rates even at full 1080p resolution. HDMI 1.3 is a video cable format that delivers it all from your Samsung Blu-ray player without any loss of quality. Since you only need one HDMI cable, there's no ugly mess of tangled-up wires. So your set-up is as clean-looking as the picture.Dolby TrueHD / DTS-HD MABoth of these HD audio technologies deliver the sound of the original audio master to your home, bit-for-bit. Listeners enjoy the same audio that was recorded and mastered. Paired with high-definition video, this means an unprecedented home theater experience.Netflix Instant Streaming ReadyAre you a Netflix member? You no longer have to wait by the mailbox to satisfy your flix fix. Instantly stream from a selection of over 12,000 (and growing) movies and TV shows. The number of titles you can stream per month depends on which Netflix subscription plan you choose.Stream movies instantly from your Netflix account.Upgrade firmware easily via Ethernet or USB.Instantly streaming movies and TV episodes from Netflix is done through a broadband connection and a Netflix Queue-based user interface. Netflix members visit the Netflix Web site to add movies and TV episodes to their individual instant Queues. Those choices will automatically be displayed on members' TVs and available to watch instantly through the Samsung players. Once selected, movies will begin playing in as little as 30 seconds. With the included remote control, Netflix members can browse and make selections right on the TV screen, read synopses and rate movies, and fast-forward or rewind the video stream.Pandora ReadyThe BD-P1600 can stream music though the popular Pandora music service. Enjoy a fresh way to discover new music and stay up-to-date with your favorite artists.Wi-Fi ReadyBy adding Samsung's proprietary Link Stick 802.11b/g/n wireless dongle (not included), users can wirelessly connect to the latest Blu-ray features when the dongle is connected to one of the players' two USB 2.0 ports, or via the traditional wired Ethernet connection.Analog/Digital Audio OutKnow what sounds great when it comes to your Blu-ray Disc player? Having audio output options. For picture-perfect audio there's the HDMI output. If you prefer analog audio, the player comes with a stereo RCA output for two channels of analog audio. An optical output is also included for the happy medium.Firmware UpgradesYour new Samsung Blu-ray Disc player won't be obsolete the moment you bring it home from the store. It's equipped with an Ethernet connection so you can download the latest firmware upgrade and add new features. If your player needs more local storage to take advantage of these features, simply plug in a memory stick with at least 1GB of memory into the USB port.What's in the BoxSamsung BD-P1600 Blu-ray Disc Player, 47-key Remote control, Batteries, AV cable (RCA type), User's Manual, Quick Start Guide", "title": "Samsung BD-P1600 1080p Blu-ray Disc Player (2009 Model)", "price": 5.99, "salesRank": {"Electronics": 37131}, "imUrl": "http://ecx.images-amazon.com/images/I/31LUEHegQnL._SX300_.jpg", "related": {"also_viewed": ["B004N85YBA", "B00KB9VBCQ", "B004ZP756S", "B00FF9SVWA", "B005NEZDUA", "B001URWAYG", "B00I83T0DO", "B0089KJPM2", "B005DII6DC", "B00803FNAG", "B00G4TTQQK", "B00793MIJM", "B00ECQABDY", "B00D8M59QW", "B00ICDAAX4", "B0058VBZ50", "B00FL4EWEK", "B00EUY59Z8", "B0055Q942E", "B0076R7F62", "B009YWN926", "B0076R7FFI", "B00IBR189Q", "B001IBHUU8", "B00BQ3EGPU", "B0036WS4CA", "B00KLG978O", "B004E276Z2", "B00AWX6EYQ", "B00BFDHV9E", "B007B5XPTK", "B0070XF9LA", "B00HPMCPJK", "B00BD7UVKI", "B0076R7F1M"], "buy_after_viewing": ["B003L1ZYYM", "B00EUY59Z8", "B00EUY59Z8", "B005NEZDUA", "B0079KZZKO"]}}