{"asin": "B0013F6HK8", "categories": [["Electronics", "Computers & Accessories", "Routers"]], "description": "Amazon.com Product Description The NETGEAR WGR614L Open Source Wireless-G Router is an 802.11g wireless router that includes open-source code for Linux developers and open-source experts. The WGR614L is designed to let you customize it to your own specifications and create firmware for specialized applications..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The NETGEAR WGR614L Router offers:802.11g wireless router compatible with both Linux and WindowsSwitch with four 10/100 Mbps Ethernet ports.240 MHz CPU and 4 MB Flash, 16 MB RAM running Linux.Open-source code for developing custom firmware.A Gigabit Ethernet connection means fast speeds when the ReadyNAS is connected to your home network.View larger.High-Performance Wired and Wireless ConnectivityThe WGR614L functions as a 802.11g wireless access point, supports speeds up to 54 Mbps, is backwards compatible with 802.11b networks, and is auto-rate capable. The router has both an external antenna and an internal diversity antenna for maximum wireless range and performance. The router also boasts wired connectivity with four 10/100 Mbps (auto-sensing) Ethernet ports.Both static and dynamic routing with TCP/IP is supported, as is VPN pass-through (IPsec, L2TP), NAT, PPTP, PPPoE, DHCP (client and server).Security You Can Depend OnA Stateful Packet Inspection (SPI) firewall protects your network against Denial of Service (DoS) attacks, and the wireless access point supports WPA-PSK and WPA2-PSK encryption, as well as 40/64-bit and 128-bit WEP encryption.Open Source for CustomizationJust because it's Linux doesn't mean it's difficult. The router works with most Internet gaming and instant messaging applications, and automatically detects ISP type, has exposed host (DMZ), MAC address authentication, URL content filtering, and logs and email alerts of internet activity. ADD MOREThe WGR614L features a 240 MHz CPU, 4 MB flash and 16 MB RAM, and runs the Linux operating system. Users can customize and modify the router to achieve special functionality and optimizations, as well as create custom software applications.The router comes with a comprehensive open-source user guide, and for additional development support you, the router has its own active open source Web community (myopenrouter.com), featuring user forums, downloads, and blogs.Windows CompatibilitySometimes you have to boot into Windows, and the WGR614L has you covered there as well. The router features both WPA and WPA2 standards, and is \"Works with Windows Vista\" certified.The router measures 6.9 x 1.1 x 4.7 inches (WxHxD) and weighs a little more than half a pound. It is backed by a 1-year warranty.What's in the BoxWGR614L Open Source Wireless-G Router, setup CD, power adapter, ethernet cable, vertical stand, warranty/support information card.", "title": "NETGEAR WGR614L Open Source Wireless-G Router (Compatible with Linux)", "price": 24.99, "salesRank": {"Electronics": 130995}, "imUrl": "http://ecx.images-amazon.com/images/I/31KbG6jswlL._SX300_.jpg", "related": {"also_viewed": ["B001UI4RTG", "B002RYYZZS", "B000Z3XXR4", "B00008SCFL", "B007CMHILS", "B001AZP8EW", "B0085WN7YQ", "B008A2OG3C", "B00IF0JAIU", "B00BHZLHBI", "B0056NRU3G", "B004N6259G", "B0062KA4VM", "B00AAU54TW", "B004H1PMJC", "B0047106KC", "B00894WP4S", "B008KRLZCW", "B0041LYY6K", "B008GG78FU", "B004XC6GJ0", "B006TZM6XO", "B006IJHK96", "B002FOTH44", "B002HWRJY4", "B001UI2FPE", "B00IJYGICI", "B00BUSDVBQ", "B006J3665A", "B008RV51EE", "B002YLAUU8", "B0063K4NN6", "B008BGYJSO", "B0062K951C", "B0040IUI46", "B00DJ6AGBU", "B006GDTTM0", "B002WBX5ES", "B0098QV038", "B0044YU60M", "B00895BUPC", "B00AJHDZSI", "B000BTL0OA", "B008LTPFG6", "B004N625AA", "B0056VN9M4", "B001FWYGJS", "B0087B6SV4", "B003CFATMY", "B001CN9K6E", "B007FECGS8", "B003Y5RYNY", "B004N6259Q", "B00387G6R8"], "buy_after_viewing": ["B001UI4RTG", "B002RYYZZS", "B004XC6GJ0", "B00IF0JAIU"]}}