{"asin": "B00006HMPK", "categories": [["Electronics", "Computers & Accessories", "Webcams"]], "description": "Amazon Product Description Video enthusiasts, get ready. Logitech's new QuickCam Pro 4000 was made just for you. Combining a digital zoom, built-in microphone, and high-quality VGA CCD sensor, the QuickCam Pro 4000 lets you express your creativity like a pro.Now you can create amazing videos and shoot 1.3-megapixel still photos with ease. Or add live video to Yahoo! Messenger, MSN Messenger, and AIM while you chat. You can also make live video calls, set up a video monitoring system, or send photos and video with your e-mail. Enhance the way you communicate and animate your life.Add live video to your favorite instant messenger: MSN Messenger, AOL Instant Messenger (AIM), Yahoo! Messenger, and Windows MessengerProduct FeaturesEnjoy 640x480 video resolution with the advanced VGA CCD sensor and high-quality 1.3 megapixel photo resolutionZoom in or out, even pan and tilt to get the right shotAdd live video to your favorite instant messenger: MSN Messenger, AOL InstantMessenger (AIM), Yahoo! Messenger, and Windows MessengerSend live video to mobile phones with Logitech Mobile VideoCreate movies like a pro with studio-quality video editing softwareCompatible with USB 2.0 and 1.1Set it up on any monitorThe flexible back lets you shape it to match your monitor's profile. Or use the camera with its base on any flat surface.Send video greetings instantlyRecord a video to congratulate your friend on her new promotion. Just click your mouse once to send her a video e-mail. Isn't that simple?Automatic face-tracking follows your actions!It's easy to stay the center of attention during your video IM or video calling session. It automatically zooms in and follows your movements.Chat face-to-face onlineVideo-chat with your best friend or relative using your instant messenger service. The built-in mic lets you express yourself.The Creative Way to Get CloserAdd live video to your favorite instant messenger: MSN Messenger, AOL Instant Messenger (AIM), Yahoo! Messenger, and Windows MessengerShoot 1.3 megapixel photos and high-quality videosEdit movies and photos with studio-quality softwareMake live video callsEmail video and photos easilyGet closer with a digital zoomConduct online video conferences and calls using Windows Messenger or Microsoft NetMeetingSpeak your mind with the built-in microphoneAdd video to your eBay auctions with SpotLife VideoSnapCreate fun animated filmsCreate web albums, broadcast live video and audio, and set up a web cam2-year limited hardware warrantyCompatible with Windows 98, 2000, Me, and XP, and Mac OS 9.04 and 9.1.&nbsp;Product SpecificationsVideo capture: Up to 640 x 480 pixels (VGA CCD)Still image capture: Up to 1280 x 960 pixels, 1.3 megapixelsFrame rate: Up to 30 frames per second (with recommended system)Included SoftwareFREE Logitech IM Video CompanionLive video-enabled Yahoo! MessengerOne-click video e-mail softwareVideo broadcasting softwareWeb album creator softwareWeb camera softwareMotion detection softwareAnimation software", "title": "Logitech QuickCam Pro 4000", "price": 139.99, "imUrl": "http://ecx.images-amazon.com/images/I/41EDSH50QML._SY300_.jpg", "brand": "Logitech", "related": {"also_viewed": ["B006JH8T3S", "B000BDH2XY", "B00005R098", "B000RZQZM0", "B0096KSBB0", "B003LVZO8S", "B0093VH9UQ", "B00K11RI6W", "B006ZN4VE2", "B004H1MCKY", "B0016JMS90", "B004FHO5Y6", "B002GP7ZTG", "B004YW7WCY", "B000EIIGYU", "B004431UBM", "B004E4M7QI", "B004ABO7QI", "B000UY1OMY", "B00BUJBHGG", "B002MCZJ78", "B0015TJNEY", "B00134VP88", "B0083I7Y8W", "B000BBAKSA", "B003LVZO88", "B000EVM5DK", "B0017ICW4G", "B009C98NQS", "B004ABQAFO", "B009CPC6QA", "B004WO8HQ4", "B0092QJRPC", "B008ZVRAQS", "B003LVZO92", "B000AA2IC8", "B005OUTO1W", "B0093VHAJ6", "B000O9GGLY", "B009H4Q6YY", "B000RZNI4S", "B002DW0VT8", "B0093HLV1I", "B000TTIP40", "B0015BWO5W", "B00001U0AJ", "B0001VNN6G", "B00CRJWW2G", "B002UBPBTC", "B002GP7ZT6", "B0080CE5M4", "B000GP845M", "B00GPUMSMC", "B000GCGB3M", "B000RZSHQM", "B005164018", "B001AOK7KI", "B001EPND18", "B003M2YT96"], "buy_after_viewing": ["B006JH8T3S", "B004YW7WCY", "B004FHO5Y6", "B004WO8HQ4"]}}