{"asin": "B009GKT2Y0", "description": "Hotline Miamiis a high-octane action game overflowing with raw brutality, hard-boiled gunplay and skull crushing close combat. Set in an alternative 1989 Miami, you will assume the role of a mysterious antihero on a murderous rampage against the shady underworld at the behest of voices on your answering machine. Soon you'll find yourself struggling to get a grip of what is going on and why you are prone to these acts of violence.Rely on your wits to choreograph your way through seemingly impossible situations as you constantly find yourself outnumbered by vicious enemies. The action is unrelenting and every shot is deadly so each move must be quick and decisive if you hope to survive and unveil the sinister forces driving the bloodshed. Hotline Miami&#x2019;s unmistakable visual style, a driving soundtrack, and a surreal chain of events will have you question your own thirst for blood while pushing you to the limits with a brutally unforgiving challenge.Key Features:Breakneck gunplay in bloodstained neon corridors combined with an intense, pumping soundtrackA surreal and gritty storyline panned out over 20 brutal multi-level mapsHeart-stopping battles against a bizarre cast of bosses from Miami's undergroundWield 35 different weapons - from shotguns and assault rifles to katanas and lead pipes - everything is at your disposalOver 1,000 different sprites for a fantastic variety of environments, weapons, items, and enemy death animations to keep the killing freshSlip on one of 25 unlockable animal masks to conceal your identity and tweak the gameplay in your favor or crank up the challengeDriving beats and brooding sounds by Sun Araw, Coconuts, M.O.O.N., Jasper Byrne, El Huervo, Perturbator, Scattle, Elliott Berlin and Eirik SuhrkeTough as nails Achievements that test your limits and leaderboards to prove your worthRequiresSteam Clientto activate.", "price": 9.99, "imUrl": "http://ecx.images-amazon.com/images/I/51Hyup%2BF4CL._SY300_.jpg", "related": {"also_bought": ["B005QF1OSG", "B00D3TRMD8", "B00FQPQGSY", "B00917DBUE", "B00K558E1W", "B007VFHGZ4", "B00CIBB0OY", "B00GU0400K", "B00FY3BD0E", "B00D3TOMOA", "B00AR05D5A", "B00ELPMPVC", "B007VFHIHA", "B00DGZDFO4", "B004UHSGUA", "B007VFH3BQ", "B00EIN266Q", "B00D3TT6AK", "B00E0S54BI", "B00DCDTSRI", "B00CSZZ5NC", "B00DQXF8AU", "B00GXHIW2M", "B00FFL0U04", "B009SPZ11Q", "B00HSSBUTM", "B00EOAGRZE", "B009K6YJTS", "B00GXHIRMC", "B00A2Z50KI", "B00D2HVB92", "B00GU041PY", "B00G6YJ60E", "B00GHTP7SS", "B00GXHIL28", "B00GXHIM2M", "B00FEOUHWS", "B00AHH5736", "B00DRO8NCS", "B00GXHIWOK", "B00EZCOJQA", "B00JJYTICE", "B00IFWMVRA", "B00G3K2JEG", "B008FPV7R2", "B00E5QK0E6", "B00DRKJ7VI", "B00FEOUIJ0", "B007W3ZZS0", "B00D2HVB7O", "B00GU043AW", "B008SBHKCY", "B00BMUCCM6", "B008FPV5IS", "B008FPV4N4", "B009IXL5FO", "B00DGD0DUK", "B00FZ20KNU", "B00AEV8IVI", "B00D3TT69G", "B00GXHJGVI", "B00K88T974", "B00EOAGR0O", "B00JMOWVCK", "B00GXHISJE", "B00G5JJBGO", "B0081IOPNG", "B009ZXJTZ0", "B00GJ2HZ7E", "B004UHSH1I", "B009CEM332", "B0085NTITS", "B00CA5CGT6", "B0081IOOZ0", "B00DRKJBC8", "B007V6MQR6", "B007XWH75O", "B00DYBBE1Q", "B00H2008JO", "B00CMSCWEU", "B00GDNT4J6", "B00B29S1JK", "B0047T7UDU", "B008D7EYWC", "B00EZAWS38"], "buy_after_viewing": ["B00D3TRMD8", "B00906A1HM", "B00CA5CGT6", "B009SPZ11Q"]}, "salesRank": {"Video Games": 9582}, "categories": [["Video Games", "Digital Games", "PC Game Downloads"], ["Video Games", "PC", "Games"]]}