{"asin": "B000P0R6LQ", "categories": [["Electronics", "Car & Vehicle Electronics", "Car Electronics", "Car Audio", "Speakers", "Coaxial Speakers"]], "description": "Polk's new 2007 db Series is better than ever with superior looks and even better sound--at prices that make high performance affordable to everyone. The db6501 is a 6.5-inch two-way component system that works well in OEM factory systems, as well as with high-powered aftermarket head units and component power amps.High performance that's affordable to everyone.Click to enlarge.The butyl rubber surround won't fall apart under the stress of extreme temperatures, sunlight or time.A vented crossover housing gives you a choice of hidden wire channels for easier, more professional-looking installs.Marine CertifiedPolk db Series speakers are built tough to withstand the toughest environments so they are perfect for use in boats of all types. That's why Correct Craft offers Polk Audio speakers in their award-winning Nautiques ski and wakeboarding boats.TweetersThe 25mm liquid-cooled silk/polymer composite dome tweeter with neodymium magnet provide clear, detailed highs.Flush and surface mount swivel cups allow placement flexibility for soundstage optimization in your vehicle.Mid/WoofersThe 6.5-inch woofers feature a dynamic balance polymer/mica composite mineral-filled cone, which is stiff yet lightweight, for big sound with little distortion. The butyl rubber surround won't fall apart under the stress of extreme temperatures, sunlight or time, for years of the great Polk sound.The woofer's low-mass, two-layer 25mm Kapton voice coil former ensures high power handling and great reliability. Although Katpon handles plenty of heat, a pole plate heat sink promotes better heat dissipation.A flat spider provides faster, longer excursion linear motion, and the flexible woven leads are sewn directly into Spider for greater reliability.Finally, the backbone--a rock solid, acoustically inert stamped steel basket finished in rustproof Gun Metal Gray.InstallationThe supplied adaptor rings enable the db6501 to fit both 6-1/2-inch and 6-3/4-inch applications, ensuring an easy fit in everything from domestics to imports including VWs and Audis, BMWs and other European imports.The tough-looking ABS Grilles are computer optimized and based on exclusive MOMO designs, and stainless steel mounting hardware is included.CrossoverThe 2nd-order Butterworth outboard crossover helps get you component system sound at a coaxial price. Electronic tweeter protection keeps your tweeters from accidental abuse for reliable, high-output sound, and the vented crossover housing gives you a choice of hidden wire channels for easier, more professional-looking installs.System SpecsOverall Frequency Response: 35Hz-23kHzNominal Impedance: 4 OhmsPower Handling (continuous): 100 WattsPower Handling (peak): 300 WattsEfficiency: 92 dBOne-Year WarrantyThis system is covered by Polk Audio's one year parts & labor warranty.What's in the BoxWoofers (pair), Tweeters (pair), Crossovers (pair), Mounting Hardware, Speaker Cable, User's Manual", "title": "Polk Audio DB6501 6.5-Inch 2-Way Component System (Pair, Silver)", "price": 118.98, "imUrl": "http://ecx.images-amazon.com/images/I/51VZoGQjMaL._SX300_.jpg", "brand": "Polk Audio", "related": {"also_bought": ["B000P0PF9G", "B000P0R6KW", "B000P0NJPS", "B000NWEJWA", "B0050I6KII", "B00E1BRITU", "B000P0LRUM", "B0039Z3SRA", "B0007WTEVM", "B000P0PFA0", "B0002BEPJY", "B000P0NJOO", "B004T0WFVE", "B0002BBP7Y", "B000P0PF8C", "B003VVYL46", "B004T163SY", "B000NWCIE6", "B00020CATC", "B00020CAUG", "B00D7XNQHG", "B002T4XR78", "B000FKP7TY", "B005ZKFZEQ", "B00BLQA9BM", "B004HW6F9M", "B00020CB2S", "B000NWG3S8", "B003TU7L0U", "B00B4PJC9K", "B003TU6066", "B001GQ2QT0", "B001AO2T18", "B00BF6HYAW", "B0007WTE08", "B001U5XKL0", "B001HHP59G", "B0016GV1UU", "B007VSXGOQ", "B000Q8AMC2", "B0007TJDFM", "B000Q6DLTK", "B001JT3NZK", "B0038FNIBW", "B000RN62GQ", "B008KNZ2S4", "B00BF6HYBG", "B000P0R6HA", "B0002BEQWK", "B00786XNS0", "B001CBURLS", "B00BQU1444", "B0016GT6OI", "B007T0NM2M", "B004CTBYGE", "B00BF6HYDE", "B000P0R6GQ", "B006PK9MIA", "B006Y44DAY", "B0002BEQJ8", "B000NWCIEG", "B001U636NQ", "B002WP362U", "B00F6X1ZPK", "B001AO1WR0", "B00B7IR3TK", "B0002IED58", "B000P0XYJ4", "B001ANXP26", "B00GN5K63M", "B006OCBW1Y", "B0039Z3SUM", "B00DJ7JKE8", "B004A7Z3BA", "B0016GX21G", "B0015A8Q7S", "B00H5A8OBK", "B000BFL52Q", "B000P0W5L2", "B001F6W4FW", "B00A9AQPUU", "B000329HEK", "B0016GT6M0", "B003TUNRGM", "B007ZQGZWO", "B00133VQWE", "B002ODEZ1G", "B000VXED54", "B005X0LRYK", "B00EZP84O0", "B0002BEUZ8", "B004UWLRJ2", "B000P0UBOU", "B00BO8O9XQ", "B007TBFCZQ", "B000EZV3T8", "B0002VM8RU", "B00B43LKV0", "B0007TJDFW"], "bought_together": ["B000P0PF9G", "B000P0R6KW"], "buy_after_viewing": ["B000P0PF9G", "B000P0NJPS", "B003KN2TF8", "B000P0PF8C"]}}