{"asin": "B0009SCMKY", "categories": [["Electronics", "Car & Vehicle Electronics", "Vehicle Electronics Accessories", "Radar Detectors"]], "description": "With the best radar performance under $200, drive safely and save money with the Vector 955. Includes features usually found on more expensive detectors: three brightness levels, VG-2 immunity, digital signal processing, sturdy windshield mount, and more. Now you don't have to choose between driving safely and saving money.The perfect radar accessory for the economical driver.Click to enlarge.Superior DetectionThe Vector 955 includes full X, K, SuperWide Ka, and Safety Warning System radar capability, laser detection, patented Mute and AutoMute features, audible and visual band alerts, and all the performance you'd expect from Beltronics.Digital signal processing (DSP) technology and multiple laser sensors give you long-range performance and greatly reduce the number of false alarms. On top of that, the Vector 955 is invisible to VG-2 radar detector detectors, keeping you one step ahead. It also features Highway/City sensitivity settings to tailor performance to your needs.Easy to UseThe rugged Vector 955 gives you control right at your fingertips. Patented Mute and AutoMute technology allows you to quickly silence alerts. Advanced programming lets you customize several features, and all controls are easily accessible on top of the device.Installation is also a snap: use the quick-release windshield mount to attach it to your vehicle's windshield, and remove it in a snap. Don't want to leave it in your vehicle? No problem, Beltronics includes a travel case to keep it secure while you're on foot.AutoScan ModeThe V955's AutoScan mode provides long-range warning, with minimum false alarms. In this mode, the V955's internal computer continuously analyzes all incoming signals and intelligently filters out false alarms.Includes coiled power cable.Easily install with quick-release windshield mount.Ultra-Bright LED DisplayDon't miss a visual alert with the 955's 280-LED alphanumeric display. Exclusive threat display tracks and displays multiple radar signals, including signal strength. You can also view Safety Warning System (SWS) messages about upcoming hazards, construction, and more.Enjoy three different brightness settings or operate in dark mode if you'd prefer only audio alerts.Total Tracking LaserUnlike radar signals, which are highly reflective, laser signals have very poor reflective characteristics. Many of today's laser detectors do not have the high sensitivity necessary to detect laser within a large \"field of view.\" The Vector 955 incorporates Beltronics' best laser detection, which uses twin laser ports to detect energy far outside the main laser beam--including off-axis signals--providing a 360-degree field of view. The alerts provided by your unit are the same whether signals are received from the front or rear.How Safety Radar WorksSafety Warning System, or SWS, uses a modified K-band radar signal to alert users of highway construction or maintenance, highway hazard zone advisories, weather-related hazards, travel information/convenience, and fast-/slow-moving vehicles. The SWS safety radar system has 64 possible messages (60 currently allocated), all of which can be displayed on your Vector 955.What's in the BoxBeltronics V955 Vector radar/laser detector, coiled power cord, quick-release windshield mount, and owner's manual.", "title": "Beltronics Vector V955 Radar Detector", "price": 174.56, "imUrl": "http://ecx.images-amazon.com/images/I/41WJS32n5RL._SX300_.jpg", "brand": "Beltronics", "related": {"also_bought": ["B0063N7HZE", "B002GEBRAK", "B00D3NXM2Y", "B0003NN83U", "B0003NN81M", "B003XQCJZM", "B00AG8EMG4", "B004C2C1UO", "B001DSIMAI", "B00C3UG3LA", "B00B7NUETG", "B002J47Q3O", "B006074LT8", "B000246USU", "B00AWUDEMO", "B003DNSJPE", "B0065LWCYA", "B006G1OHE2"], "bought_together": ["B0003NN83U"], "buy_after_viewing": ["B000246USU", "B000F8XGJO", "B004C2C1UO", "B00DNJU61S"]}}