{"asin": "B0076MBOC8", "related": {"also_bought": ["B003BQ1D4C", "B003BQ0TFQ", "B00593LT2G", "B003G2YZ5K", "B001DQRB9I", "B003G2YZOG", "B007P8HV2K", "B0038SNTY0", "B0000BZLAC", "B007TIYZKC", "0823085651", "B004QC6VAG", "B0000BZL83", "B00004ZCEF", "B000L9OIQC", "B0000BZL68", "B00007LA0T", "B00004WCID"], "bought_together": ["B003BQ1D4C", "B001DQRB9I"], "buy_after_viewing": ["B0016D1I0G", "B003BQ71MA", "B003BQ1D4C", "B001DQRB9I"]}, "title": "VANGUARD BBH-100 Tripod Heads", "price": 129.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/412XQtRYlxL._SY300_.jpg", "brand": "Vanguard", "categories": [["Electronics", "Camera & Photo", "Tripods & Monopods", "Tripod Heads"]], "description": "DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\"vanguard_aplus_html_templateBBH professional ball heads by VANGUARD deliver accuracy, precision, and ease of use, but that&rsquo;s not all. Their many features include a lightweight open body design, innovative leveling system, and universal 38mm release system.VANGUARD BBH-100 ball head highlightsThe next levelVANGUARD&rsquo;s BBH ball heads feature an innovative Rapid Level System that allows users to instantly position their camera level with the base of the head. When the Rapid Level System is engaged by sliding the designated orange switch to the right, an internal guide fixes the ball into place once the level position is achieved. This makes switching from portrait orientation to landscape very simple and quick to do. Used in combination with BBH&rsquo;s two bubble levels, this system ensures a precisely level platform for panoramic shooting. Once fixed, securely lock the ball into place with its oversized locking knob &ndash; which is also handy for panning.Highly compatibleBBH-100 ball head features a universal, 38mm quick release clamp system with large locking knob and VANGUARD&rsquo;s QS-60 quick shoe with 38mm base. This allows for easy compatibility with other heads and release plates using this popular system. Users can further customize their kit with the use of different size or specialty plates with the same 38mm base, such as the larger QS-61 from VANGUARD. They can also conveniently keep their camera mounted to QS-60 when switching to other heads using this system, such as VANGUARD&rsquo;s GH-200 or TBH series ball heads.Other highlightsLightweight, durable magnesium constructionOxidization anodized scratch free surface on ball for smooth movementDedicated panning lock360-degree panningTwo bubble levels&frac14;&rdquo; to 1/8&rdquo; attachment screwOversized locking knob can be repositionedProduct specificationsHeight: 3.875 inchesWeight: 15.9 oz.Maximum Loading Weight: 22 lbs."}