{"asin": "B001NJ0PBG", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]], "description": "A colorful way to enjoy your favorite tunes, the iHome iH15W is a compact, illuminated cube and iPod speaker dock. Set it to one color to match your mood, or cycle through the colors for a little fun.The iH15W is a small 5.5-inch cube with handy carrying handles and internal adjustable lighting. Change the translucent cabinet to match your mood or the current song. Feeling blue Go with blue. Not easy being green Try green. A cowardly yellow Well, you get the idea.Give your favorite music a little color.Click to enlarge.Pick a single color to suit your mood.Click to enlarge.Convenient carrying handles.Click to enlarge.Illuminate Your MoodThe iH15W is a small 5.5-inch cube with handy carrying handles and internal adjustable lighting. Change the translucent cabinet to match your mood or the current song. Feeling blue? Go with blue. Not easy being green? Try green. A cowardly yellow? Well, you get the idea.The cube also features four color change settings for cycling through the colors, which is great for parties and other fun occasions.Enjoy Your MusicThe iH15W charges docked iPods, so when you hit the road, your iPod will be ready to go. Two Reson8 speakers provide great sound, and a passive subwoofer covers the low-end, so you can count on rich sound from a tiny device.What's in the BoxiHome iH15W, AC power adapter, iPod dock adapters, and user's manual.", "title": "iHome iH15 Color Changing 30-Pin iPod Speaker Dock", "price": 99.94, "imUrl": "http://ecx.images-amazon.com/images/I/41rWK-OT7kL._SY300_.jpg", "brand": "iHome", "related": {"also_bought": ["B004I8WH74", "B000EF3QHU", "B007PFX172", "B00JJ9153E", "B002L6HDR4", "B004NBZAI4", "B009A5EIWC", "B0097BEDVU", "B001G5DQAE", "B0097BEDTC", "B0097BEDRY", "B00A4EWPN2", "B0097BEEIW", "B00CXLQIAU", "B00D7UHT0E", "B00DMC6KAC", "B0097BEFEU", "B00A8XAVX0", "B007PG5U0M", "B00BQ4HROG", "B004PLKSSE", "B00C0Z11G0", "B005GS3C9C", "B0083FTVB8", "B008JFUQ16"], "bought_together": ["B004I8WH74"], "buy_after_viewing": ["B004I8WH74", "B004NBZAI4", "B007PFX172", "B0062W0XD4"]}}