{"asin": "B0035LCZSG", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "Compact Camcorder with a 33mm Wide-Angle, 78x Ultra Zoom and More!Featuring the Intelligent 35x Zoom and Power O.I.S Compact Full-HD Shooting Fun for EveryoneThe SD60 Series features a 25x optical zoom and an Intelligent Zoom function that goes all the way up to 35x. When using Intelligent Zoom, Intelligent Resolution technology lets you shoot at high zoom rates while preserving the image resolution. You get sharp images of highly detailed objects -- without the blurry edges. Plus, POWER O.I.S. suppresses even slight hand-shake, which is a must for extreme zooming, because of its high susceptibility to hand-shake.Captures large groups, even when shooting from up close.35.7mm Wide Angle Lens*The 35.7mm wide-angle lens* on the SD 60 Series fits more people and more of the background into the frame than a conventional 44.1mm lens. This is especially handy when you want to take a group photo in a small room. It fits your subjects in even when you shoot from up close, and makes it possible to pick up even small sounds with the mic. It also gives you entirely new ways to enjoy your camcorder, like taking self portraits or capturing sweeping landscapes without losing the sense of scale.* 35mm camera equivalentEverthing fits in the frame even whenshooting in narrow spaces.Even if the subject comes up close to the camera, everything fits in the frame.Recognizes important people's faces and captures them beautifully.Face RecognitionThe Face Recognition function recognizes the faces of registered subjects, and automatically optimizes the focus and exposure for those special people. It continues to track the subject as he or she moves anywhere within the LCD frame, making it ideal for video shooting. It is extremely useful for capturing someone's face in a group. Names can also be registered and displayed on the LCD while shooting. A total of six people can be registered, and the names of up to three people at a time can be displayed in the shooting frame.frame.", "title": "Panasonic HDC-SD60K SD Based Hi-Def Camcorder with 35X Intelligent Zoom (Black)", "price": 17.12, "salesRank": {"Camera &amp; Photo": 6291}, "imUrl": "http://ecx.images-amazon.com/images/I/41FqFHSlcSL._SY300_.jpg", "related": {"also_viewed": ["B004I43MH2", "B00AW54YWS", "B004I43MHW", "B0072B5E4M", "B00HXE4H28", "B006UMMP2I", "B00HPZKQ7U", "B006K551HQ", "B00AR95H7U", "B00AR95H0W", "B00HPZKPX0", "B00AR95FP4", "B00HNJWWL6", "B006UMMP8C", "B00B2NMIXQ", "B004I43MJ0", "B00HNJWWK2", "B0031RGKZI", "B00AW54Z7C", "B00BB4UKOK", "B00AWZFJ22", "B00CQ9T00E", "B007261BNU", "B00HLDFTRS", "B003DZ1224", "B00HPZKQJS", "B003QHXZTC", "B00AWZFIUU", "B00AR95H4S", "B004H8FNB2", "B0072B5CNU", "B0072B5E7Y", "B00AR95FRM", "B00I52L1LW", "B004H8FN9E", "B004I43MJA", "B004I43MGS", "B006K550PY", "B00AW54Z4K", "B0032UWTQI", "B003DZ122E", "B00HPZKQWA", "B00AW54Z2M", "B003FGFKEC", "B0072B5CP8", "B004I43MGI", "B00HNJWVMG", "B00HNJWWGG", "B00449DMXK", "B00HLDFSQK"], "buy_after_viewing": ["B003VNKNF0", "B00AWZFJ22", "B008E8NH4G", "B00B7ID99I"]}}