{"asin": "B002BS47TE", "description": "Metal Gear Solid Peace Walkeris a stealth-action game set between the events ofMetal Gear Solid Portable Opsand the originalMetal Geargame. Revolving around the continuing early adventures of series centerpiece, Snake, it fleshes out the legend of \"Big Boss\" in the days following the Cuban Missile Crisis through a deep single player story mode, featuring a new control system and missions offering extensive replay value, as well as extensive and engaging co-op multiplayer options..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }The legend of \"Big Boss\" continues.View larger.2 and 4-player multiplayer co-op.View larger.Challenging missions &amp; boss battles.View larger.New controls &amp; lush environments.View larger.StoryStories tell of a legendary soldier who once waged war against the world. His name was Naked Snake, a.k.a. Big Boss, and the truth behind this legend will finally be told. The era is the 1970&rsquo;s. Big Boss had stationed his \"Soldiers Without Borders\" in Colombia, South America, where he was approached by visitors from Costa Rica, a \"nation without a military.\" In the wake of the Cuban Missile Crisis, as Latin America became a key to maintaining the power balance between East and West, Costa Rica had miraculously managed to maintain its peace and neutrality. However, in various regions of the country, a mysterious armed force seemed to be engaging in suspicious activities. Now, to preserve peace in this nation without a military, the \"Soldiers Without Borders\" move into action. In time, they would be known as the founders of \"Outer Heaven.\" Forge a new path and live the legend withMetal Gear Solid Peace Walker, the first official Hideo Kojima game on the PSP system.Mission-based GameplayMetal Gear Solid Peace Walkeris a tactical-stealth-action game based around mission based gameplay. Play in single player mode begins with a tutorial in which players square off against Snake himself which serves as a way to familiarize themselves with a control scheme that provides changes as well as improvements over those featured in earlierMGStitles for PSP. These cover both weapons and hand-to-hand combat. In addition, players also gain experience using the controls to chain together moves for maximum impact. Once through with the tutorial players embark on a series of missions, the replaying of which offers new enemy actions, as well as the possibility of new devices and tools. During combat players are able to target specific areas of an enemy's body and performance during each mission is ranked according to elapsed time, number of kills and other criteria.4-player Co-op MultiplayerAlong with a deep single player modeMetal Gear Solid Peace Walkercontains exceptional multiplayer co-op functionality. Co-op action is facilitated via the PSP's local wireless ad-hoc connection and features different types of missions. Missions more dependent on stealth are limited to two-player games, while others--for example, boss battles--are meant for games of up to four players. Players have their choice of different versions of Snake. These not only possess differing appearance, but more importantly, differing strengths. During co-op play players can pull resources by staying within a minimal distance from each other This link is indicated by circles emanating around them. While maintaining this connection resources can be shared, including weapons, supplies and and overall health, indicated by a shared health bar. Players are able to view partner's inventory at a touch of the PSP's left or right face buttons, and when need be can resuscitate a fallen companion. When linked players can also move in unison by virtually tapping your partner's shoulder with a touch of the D-pad and then making your move.Key Game FeaturesThe Latest Title in theMetal Gear SolidSeries- A true continuation of the ever-evolving franchise that stood the test of time and started the stealth action genre,Peace Walkeris the first title on the PSP system in which mastermind Hideo Kojima has fully taken up the reigns to direct, write, and design the game himself.Extensive Content- Arguably one of the deepest PSP games to be released as Kojima Productions pushes the boundaries of the platform to new levels while blending various game styles together in ways that will captivate and engross both veterans and newcomers toMetal Gear.Proven Gameplay, Story, and More- Fans of the series will enjoy the exhilaration of familiar stealth elements of previousMGStitles and will also be enticed by the new gameplay features making their debut inPeace Walker. Those expecting a typical stealth game will be blown away by thePeace Walkerexperience. This game is a blend of action RPG elements, RTS elements for a PSP experience like none other. Staying true toMetal Gearform, the entire game experience is woven together by a gripping story which unfolds through the artwork of Yoji Shinkawa and acclaimed comic book artist, Ashley Wood.Unique Online Multiplayer Support-Peace Walkerprovides up to 4-player co-op gameplay, which is a revolutionary first for the series that introduces the all-new Co-op Ring and \"Snake Formation.\" The Co-op Ring allows gamers to interact and build their camaraderie through the sharing of items, equipment, and life gauges during the heat of battle, while the \"Snake Formation\" lets one player take the lead so the others can focus on defense.Massive Replay Value- Replaying missions inPeace Walkerearns players new stuff and experiences for Snake that can potentially change your experience.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51GTtYzerIL._SY300_.jpg", "related": {"also_bought": ["B000HKMG14", "B003L51GW2", "B000R3BN4M", "B001COTC3E", "B000059TMB", "B002BS47WG", "B001KMRN0M", "B000UKQGA8", "B000R37S00", "B000UZVL9O", "B000HKIPGE", "B000SSPH3E", "B0007UDYU6", "B0007V804U", "B00005A53C", "B001GXI4LM", "B000ASBKHE", "B0045U4U52", "B001HWF1OA", "B0050JN7ZG", "B000G79VKC", "B002I0GXWO", "B0014X7SQ6", "B000HASW0I", "B002BSC57U", "B0007TS24U", "B000E0OCQY", "B0009WPZPY", "B003YVK5T8", "B000G79XQO", "B00005A4X6", "B006JKARNU", "B002EQFXZA", "B004LLRYOY", "B000UHD85C", "B0009VRSS2", "B002F87WEW", "B000HNJ5WE", "B0007TFLLM", "B000FYZS6M", "B00113X7YQ", "B000E0OCR8", "B000FG65EY", "B000R37S78", "B001TOQ8T8", "B002CZ3SEQ", "B002I0GZ5Y", "B002I09830", "B0010EF0UK", "B000CBCVG8", "B000NPTOTK", "B000NPOGWK", "B004OP65CY", "B000AAZC08", "B000CBCVEK", "B00356GVRW", "B00006FSLC", "B003V3O4A0", "B0029ZUPYK", "B00005B5RQ", "B0015A8RQ8", "B000IFRPLO", "B006JKARU8", "B0009350CQ", "B003O21OWY", "B000N0WBJ0", "B0016QCCG2", "B001CB9VSS", "B000QTD05M", "B007M6W36Y", "B008277M2M", "B001TD6SN0", "B0009XBXQ8", "B002DGNLFK", "B0050JN84Q", "B0030CV39M", "B0013AX2JM", "B003Q9RG9K", "B00127VDWY", "B0007VDF2C", "B000G0O6CW", "B000VIUNZI", "B000A8FV3S", "B0010YOQJG", "B0028A8PZM", "B004BV5O0U", "B001TILU88", "B00523VFJU", "B000EZ3FDU", "B000H1R0D2", "B000BXKA38", "B001CM0PJ6", "B001N2EVPE", "B002SD94AY", "B000VIPJ0W", "B002E6XY6K", "B00007KUU8", "B00COUW1BU", "B00001YVBL", "B001F513VO"], "bought_together": ["B003L51GW2", "B001KMRN0M"], "buy_after_viewing": ["B000R3BN4M", "B001KMRN0M", "B003L51GW2", "B0050JN7ZG"]}, "salesRank": {"Video Games": 2408}, "categories": [["Video Games", "Sony PSP", "Games"]]}