{"asin": "B001F7AHXM", "description": "Now you can take it with you. All of it. Available in a 120 GB model that holds up to 30,000 songs, 150 hours of video, 25,000 photos, or any combination, the new iPod classic fills your pocket with sight and sound. Available in quintessential silver or striking new black, iPod classic catches your eye with its sleek, all-metal enclosure composed of anodized aluminum and polished stainless steel. The new Genius Playlist feature creates an on-the-fly playlist of tracks in your library that go great with the song you're listening to. And Cover Flow lets you flip through your music by album artwork. Discovering new music, movies, TV shows, games, audiobooks, and podcasts is easy on the iTunes Store. Even rent a movie from iTunes and watch it on the go. To get everything into your pocket, just connect iPod classic to your Mac or PC, and iTunes transfers your music and more in one seamless sync.With the new iPod classic, you can take it with you...all of it.Click to enlarge.Up to 30,000 songs, 150 hours of video, 25,000 photos, or any combination to fill your pocket with sight and sound.Click to enlarge.120 GB at under a half an inch deep.Click to enlarge.Available in quintessential silver or striking new black.Click to enlarge.Space Available, and Lots of ItMeet a Musical GeniusSay you're listening to a song you really like and want to hear other tracks that go great with it. With a few clicks, the new Genius feature finds the songs in your library that go great together and makes a playlist for you. You can listen to the playlist right away, save it for later, or even refresh it and give it another go. Count on Genius to create a mix you wouldn't have thought of yourself.Hold EverythingiPod classic gives you 120 GB of storage capacity, good for up to 30,000 songs, 150 hours of video, 25,000 photos, or any combination. And you get up to 36 hours of battery life, so you can keep on rocking for a long, long time.*Leave No Tune BehindWith 120 GB of space, iPod classic means you can always have your entire music and movie library with you. Carry it from the living room to a party in the backyard. Or take it on a cross-country road trip and never listen to the same song twice.Click to EnjoyFinding exactly what you want to watch or listen to is easy. Use the Click Wheel to browse by album art with Cover Flow or navigate your songs and videos by playlist, artist, album, genre, and more. You also can search for specific titles and artists. Want to mix things up? Click Shuffle Songs for a different experience every time.Watch Movies and TV ShowsThe vivid 2.5-inch display makes video come alive. Purchase or rent movies, buy TV shows, and download video podcasts from the iTunes Store, then sync them to your iPod classic to watch anywhere, anytime.Play iPod GamesPut hours of fun at your fingertips. iPod classic comes with three games--Vortex, iQuiz, and Klondike--and you can purchase games, such as Monopoly, from the iTunes Store. All iPod games are designed specifically for the iPod interface.Share Your PhotosiPod classic uses iTunes to sync the photos you have in iPhoto on a Mac or Adobe Photoshop Elements and Adobe Photoshop Album on a PC. View photo slideshows complete with music and transitions on iPod classic, or play them on a TV using an optional Apple component or composite AV cable.Reduced Environmental ImpactiPod classic embodies Apple's continuing environmental progress. It is designed with the following features to reduce environmental impact:Arsenic-free glassBrominated flame retardant-freeMercury-freePVC-freeHighly recyclable aluminum and stainless steel enclosureRecycled and bio-based packaging materialsWhat's in the BoxApple iPod classic 120 GB (Black), earphones, USB 2.0 cable, dock adapter, quick start guide", "title": "Apple iPod classic 120 GB Black (6th Generation)  (Discontinued by Manufacturer)", "price": 299.5, "imUrl": "http://ecx.images-amazon.com/images/I/41zt-RXYhfL._SY300_.jpg", "related": {"also_bought": ["B002H9LNGW", "B001F7AHXW", "B000WLXO9Q", "B000WBDD56", "B002AF5184", "B0056BUVES", "B0055D0VVU", "B000JLKIHA", "B002S0O7LI", "B00A36AX80", "B000EPHR0C", "B0037T4WGY", "B002L6HDQA", "B000WGJUD0", "B004HM0PYI", "B001F7AHOG", "B002ICN1GS", "B000A3WS84", "B001F7AHY6", "B0028ND432", "B006YNTJ6I", "B0074R1PI8", "B0047DVWZS", "B000JO1380", "B0097BEF0O"], "bought_together": ["B002H9LNGW", "B000WBDD56"], "buy_after_viewing": ["B001F7AHOG", "B000JLKIHA", "B001F7AHY6", "B001F7AHXW"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}