{"asin": "B000AY0IT4", "description": "Enjoy cordless freedom and laser performance. TheCordless Desktop&#xAE; MX3000 Laseroffers unmatched precision and comfort on surfaces where ordinary optical mice can't go. Control music or video playback, including playlist shuffle, right from your keyboard with the one-touch media buttons, or use the two-handed navigation controls to scroll and zoom spreadsheets, images and large documents. SecureConnect&#x99; wireless technology and extended battery life add the finishing touches to a desktop that will make using your computer more personal and more exciting.FeaturesBluetooth MediaPad &#x97; long range Bluetooth remote commanderA numeric pad, a calculator, and a PC remote control, it can be used to control media on the PC from anywhere in the room. The LCD display alerts you to IM buddy status and incoming emails.Rechargeable MX Laser mouse20x the tracking power of standard optical, the MX Laser mouse delivers record-setting performance on virtually any surface.Bluetooth 2.0 Wireless technologyNow with Enhanced Data Rate, to provide three times the speed of previous Bluetooth revisions. Extended range of up to 60 feet means virtually no interference from other devices.Unique, ultra-flat keyframe technologyIncreases comfort, may reduce stress on your wrists, and delivers smooth, super-quiet performance.Smart power managementAn LED indicator lets you know when your mouse needs recharging. Storing the rechargeable MX Laser mouse in its rapid-charging base station helps keep the mouse fresh and ready to go.Tilt wheel plus ZoomSide-to-side scrolling and in/out zoom.System RequirementsPC with Pentium processor or compatibleWindows XP (Home, Pro, Tablet or Media Center Edition)CD-ROM driveUSB portProduct SpecificationsMX Laser Engine&#x99; with 800-dpi resolution and 5.8-Megapixel image processingMouse with Li-ion batteries and Fast Charging StationUltra-flat keyframe technologyMedia Pad LCD supports Western characters onlyBluetooth 2.0 EDR TechnologySupport for Widcomm BTW 5.0 and Microsoft XPSP2 Bluetooth stacksBluetooth Profiles: Audio Gateway, AV, Basic Imaging, Dial-up Network, File Transfer, Hard Cable Replacement, Headset, Human Interface Device, Local Area Network, Object Exchange, Serial Port, SynchPackage ContentsdiNovo&#x99; keyboard for BluetoothdiNovo&#x99; MediaPad&#x99; remote commander for BluetoothMX&#x99; 1000 Laser mouse for BluetoothUSB mini-receiver for BluetoothRapid-charging base station with AC adapterCD with Media Life software, comfort guidelines and Help Center6 AA alkaline batteriesQuick Start GuideThree-year limited warranty", "title": "Logitech diNovo Media Desktop Laser", "price": 69.99, "imUrl": "http://ecx.images-amazon.com/images/I/414V9TNJSZL._SY300_.jpg", "related": {"also_viewed": ["B0036E8V08", "B000J43HJ8", "B0000UV0JA", "B00I14395A", "B00ACC0P0Q", "B0002XGSS8", "B00DR9V1T0", "B0011FQUQG", "B0000CEPDF", "B001FB55GC", "B0093605PM", "B00CYX54C0", "B0011FOOI2", "B001DJ9GOS", "B006UIACYK", "B003VAGXWK", "B008JGU3YA", "B005MPTN5G", "B00ENF8EL0", "B001M4N956", "B003VANO7C", "B000AY5ZIS", "B001IOHAVO", "B0034XRDU0", "B001BTWOJO", "B001F51G16", "B00BP5KOPA", "B000AY2L3U", "B00DLSEER8", "B002MUYP3E", "B000MAFPVW", "B0040QE97A", "B003VAHYNC", "B001U0WQJM", "B00CYX53QW", "B000HCUTU2", "B007PJ4PN2", "B00CYX26BC", "B000E204LY", "B001NXDBI6", "B003NREDC8", "B001B8EOMU", "B00E4MQODC", "B004MF11MU", "B002HWRJBM", "B00AQMUE30", "B005L38VRU", "B00BCEK2M4", "B002MMY4WY", "B00BFOEY3Y", "B0099SMFVQ", "B003VAGXZC", "B0086UK7IQ", "B003SVSJ1K", "B0082D5660", "B002JCSCYS"], "buy_after_viewing": ["B0036E8V08", "B000J43HJ8", "B002HWRJBM", "B003VAGXWK"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Keyboard & Mouse Combos"]]}