{"asin": "B0025VKUPM", "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Running GPS Units"]], "description": "Finally, a GPS-enabled training device that isn't afraid of the water. The rugged Forerunner 310XT is the triathlete's indispensable training tool--a GPS-enabled, swim-proof trainer that tracks bike and run data and sends it wirelessly to your computer. This multi-sport device has up to 20 hours of battery life, tracks distance, pace and heart rate (optional), and goes from wrist to bike in seconds.A GPS-enabled training device that isn't afraid of the water.Track bike and run data and send it wirelessly to your computer.Click to enlarge.Tracks distance, pace and heart rate.Click to enlarge.Time Your SwimThe swim-proof Forerunner 310XT is waterproof to a depth of 50 meters, so you can wear it in the pool or the lake to time your swim. And its slim design and flexible wristband mean Forerunner is easy to wear in any conditions.Transition EffortlesslyWhen you're ready to jump out of the water and onto the bike, Forerunner 310XT moves easily from wrist to bike with the optional quick release and bike mounts, making the transition between sports effortless. Forerunner 310XT categorizes multisport activities in one workout and can also log transition time in the process, so you can analyze your performance from start to finish.Collect Workout DataForerunner 310XT tracks your position precisely with GPS satellite data and records distance, pace, heart rate (optional), power data (from ANT+-enabled third-party power meters) and more. High-sensitivity GPS and HotFix satellite prediction mean Forerunner acquires satellites quickly and tracks your movement even near tall buildings or under tree cover. And using innovative ANT+ wireless technology, Forerunner 310XT connects seamlessly to an optional heart rate monitor, foot pod and cadence sensor.Heart Rate Monitor BundleThis bundle includes the optional wireless heart rate monitor. Forerunner 310XT continuously tracks beats per minute and uses heart rate data in advanced calorie computation. Train in a certain heart rate zone to improve fitness and monitor your level of exertion.Run, Sync, Store and ShareOnce you've logged the miles, innovative ANT+ wireless technology automatically transfers data to your computer when Forerunner is in range. No cables, no hookups. The data's just there, ready for you to analyze, categorize and share through our online community, Garmin Connect or our optional Garmin Training Center software. You can even plan workouts on your computer and then send them to your Forerunner.What's in the BoxForerunner 310XT, USB ANT stick, AC charger, charging clip, owner's manual, quick start guide, heart rate monitor", "title": "Garmin Forerunner 310XT Waterproof Running GPS With USB ANT Stick and Heart Rate Monitor", "price": 179.99, "imUrl": "http://ecx.images-amazon.com/images/I/41jPsv48JmL._SX300_.jpg", "brand": "Garmin", "related": {"also_bought": ["B00DV6SZWU", "B00INXAFHO", "B003CP0MTO", "B002I05VRM", "B000VK5BMQ", "B00INXANNU", "B00BB2NN8C", "B000BFNOT8", "B00264GKVQ", "B00DTWUYYS", "B0009PUJV6", "B0039YQFA8", "B0042ESTSK", "B00JLMRXCQ", "B00JM6DKUA", "B00AVIT638", "B00G5VOU0Y", "B005ZSYEOK", "B00G06D2OO", "B00BI9X1QM", "B00CQ7QDQA", "1934030198", "B0030DI8NA", "B00LBOQL5M", "B00AOLFDR0", "B004KQFCHQ", "B00FFXZZL6", "B000G687AS", "B004UMQKJ4", "B0096855IO", "B000UOD5QM", "1891369903", "0873229592", "B005C9BUQW", "B005JASX2I", "B004OQ79SW", "B005L8YVRO", "B000MM3EKY", "B00CSI5BN8", "B009NN6S60", "B002NU6J1Y", "B00975EAJ6", "B005I6DA5S", "B0062Y23OE", "B00AJNB5Y8", "B008KG5G0U", "B008OXGOR8", "B000KRGI4K", "1937715116", "B008H5ZORY", "B008UCBMKC", "B004L7P2P6", "B00DQV6L6C", "B000GEDHNM", "B00J08LPFC", "B00AK95UL0", "B003V5G9L0", "B0021AEX3W", "B000PX3BEO", "B00CSHV56G", "B000RLDZG8", "B008EFU5T4", "B006ZT7JMM", "B0011UNTYC", "B0065DMCU2", "B000NZTA8A", "B003LVFS6Q", "B004H4V6GC", "B00AY0DE18", "B005ZQPCCA", "B005DVA57Y", "B00DYQWRC6", "B00DPHDDCM", "0738212547", "B00JBJAQ7I", "B00915FJY2", "B004ELBPTG", "B00FFXZZV6", "B002VTQSR2", "B0017I532E", "B0043839FS", "B008KG5G7S", "B002OM65OC", "B00DPHDEFI", "B00AK8C1HC", "B00GQOW71E", "B003AU5W5K", "B009J0INTM", "B00D86D7ZI", "B00J08J662", "B00LIKQ2YO", "B001AYMJFE", "B007SJLXV6", "B000FI6XGC", "B00AAOIAQC", "B000FIE4AE", "1628600098", "B00FT45ZBQ", "B002YGSPRS"], "bought_together": ["B00INXAFHO"], "buy_after_viewing": ["B003JTLKIA", "B00FBYY5UG", "B008LQPHZI", "B000BFNOT8"]}}