{"asin": "B003V4AK8E", "description": "The POWER A Pro Elite Wireless Controller is a high-performance PS3 controller that will appeal to even the most hardcore gamers. With its unique control layout and ergonomic design, the Pro Elite Wireless will keep you comfortable for hours of gaming. And with its responsive buttons and precise analog sticks, the controller gives PS3 gamers a competitive edge. The Pro Elite Wireless also features dual rumble motors for truly immersive gaming and is compatible with SIXAXIS games.POWER A Pro Elite Wireless ControllerAt a Glance:Wireless PS3 controller with unique control layoutIntuitive, responsive controlsSIXAXIS motion-sensing technologyDual-rumble motors for immersive gamingContoured shape with ergonomic gripsWireless controller features a unique control layout and is compatible with SIXAXIS games.View larger.Backlit buttons are easy to see in the dark.View larger.Intuitive, Inspired Control LayoutIn designing the Pro Elite Wireless Controller, POWER A has taken what's best about other controllers--like the Xbox 360 controller--and recombined these features to give a competitive edge to PS3 users. The Pro Elite Wireless positions its analog sticks asymmetrically, with left analog stick up and the right analog stick down. This design helps prevent cramping during extended gaming sessions and is especially ideal for first-person shooters. The R2 buttons have also been repositioned for greater accessibility while gaming. Additionally, all of the buttons are backlit, so you'll still be able to game in the dark.Ergonomic, Natural DesignErgonomically designed, the Pro Elite Wireless provides optimal comfort for all hand sizes. Its textured rubber grips are soft and breathable, so your gaming won't be ruined by sweaty palms. The palm handles have been expanded to provide a more generous area for gripping the controller. And with its gently contoured edges, the Pro Elite Wireless helps alleviate pressure on your hands to ensure comfort.Precise SIXAXIS Motion ControlNot only is the Pro Elite Wireless comfortable and intuitive, it's also compatible with SIXAXIS games. Using a fine-tuned accelerometer and gyroscope, the Pro Elite Wireless can sense your movements and translate them into the game. This gives you more direct, lifelike control over the events in your game. To get the most out of SIXAXIS-heavy games like Warhawk and Heavenly Sword, you'll need the Pro Elite Wireless Controller.Rumble Feedback for Immersive GameplayFully supporting rumble feedback, the Pro Elite Wireless uses two vibrating motors on either side of the controller to create a rumbling sensation at certain moments during the game. This makes yaour gaming experience even more immersive, as you're able to feel every gunshot and explosion in visceral detail.The Pro Elite Wireless Controller is backed by a two-year warranty. Visit POWER A's website for details.About POWER APOWER A is dedicated to creating high-quality, innovative products that allow consumers to engage with their entertainment on a whole new level. Based in Seattle, the company holds partnerships with some of the most popular consumer electronics and video game companies in the world, including Nintendo, Sony, Microsoft, and Apple. POWER A specializes in video game controllers, kits, chargers, accessories, and more, and the company is committed to preserving the highest standards of safety and energy efficiency across all of its product lines.What's in the BoxWireless controller, USB controller adapter/receiver, and a USB charging cable (mini-B.)", "price": 49.99, "imUrl": "http://ecx.images-amazon.com/images/I/31LVM5LrNUL._SX300_.jpg", "related": {"also_bought": ["B007FVVXXA", "B003VWXV50", "B005764CWO", "B009OAVUOM", "B003VUO6LU", "B008M4BNQG", "B0040NPB84", "B00B15EXJC", "B007SO06O6", "B00F32V9UA", "B009DL2TBA", "B00AF26K0C", "B0080CY4SY", "B008DBJPLS", "B00EI4V3FU", "B009DYCTY4", "B003VUO6H4", "B003NSLGW2", "B004WFM0MU", "B005QVY65I", "B002I0K6X6", "B00GE2JC9S", "B008XWCX6Q", "B002I0K6DG", "B0045Y19IO", "B000S0C2UI", "B008P9IO2Y", "B000VTQ3LU", "B005D7G3LA", "B00JQHU9RC", "B00275A7LI", "B002G9DE24", "B0050SWSQQ", "B00CUKPSGO", "B007SO6USW", "B004VLYIE8", "B00C710AQO", "B00CD90R72", "B0050SX9I2", "B002I0K622", "B005LN5UOC", "B00AY1CT3G", "B00DV16N6U", "B005ZL5XRO", "B006VB2UMI", "B00D73DLRQ", "B006JKARN0", "B00FWWY1V0", "B003O680RM", "B0042R81XU", "B0050SXI6K", "B007A7UJ4S", "B009MFUY96", "B000AA2RCY", "B00JC9SWSC", "B008DBO4UK", "B0072HYRNK", "B003U7WCEM", "B00A750QIE", "B00E5UHSXI", "B00GHJ6X8G", "B000Y1MOIQ", "B0015AARJI"], "bought_together": ["B009OAVUOM"], "buy_after_viewing": ["B003VWXV50", "B00B15EXJC", "B005764CWO", "B007SO06O6"]}, "salesRank": {"Video Games": 1046}, "categories": [["Video Games", "PlayStation 3", "Accessories", "Controllers", "Gamepads"]]}