{"asin": "B00829TIA4", "description": "The Seagate Backup Plus for Mac portable external hard drive simplifies backup for consumers who want to protect their entire digital life locally or on social networks. The drive is formatted for Mac out of the box, making it compatible with Time Machine software to provide the simplest and most efficient way to back up locally. Keep multiple copies of your files in case disaster strikes. With the Save feature, user-generated content can be backed up from your favorite social networks. Many people now use their smartphones to capture priceless moments. While these devices are handy and readily available, storage is not their strong suit. Capture a memory, post it on a social networking site and let the Seagate Dashboard automatically back up any content posted. Even if the file gets accidentally deleted from the device, another copy can be waiting. The Share feature allows multiple files to be uploaded to social networks at once from your computer. The days of uploading individual files without creating a new album are gone! Simply select files to upload, choose where to post them and even add comments. Managing your social profile has never been easier. Install the downloadable HFS+ driver for PC, and use the drive interchangeably between Mac computers and PCs without reformatting. Take advantage of the Seagate Backup Plus design and upgrade from the included USB 2.0 interface to Thunderbolt technology or USB 3.0 with the additional adapter. Ships with: Seagate Backup Plus Drive, Seagate Dashboard pre-loaded on drive, USB 2.0 interface adapter, 18-inch USB 2.0 cable, Quick start guide, 2-year limited warranty. System Requirements: Mac OS X 10.6 or higher or Windows&#xAE; 7, Windows Vista&#xAE;, Windows XP SP3 (32-bit and 64-bit) operating system (HFS+ driver for PC operability available for download; compatibility may vary depending upon user's configuration and operating system) and USB 2.0 port.", "title": "Seagate Backup Plus 500GB Portable External Hard Drive for Mac USB 2.0 (STBW500100)", "price": 69.3, "imUrl": "http://ecx.images-amazon.com/images/I/31PJDGSyuZL._SX300_.jpg", "related": {"also_bought": ["B003WUBIZQ", "B004CJ8DLI", "B004CJ8DNG", "B008I647AM", "B00BOHNYU6", "B00834SJSK", "B006P2R708"], "buy_after_viewing": ["B00H4YGR48", "B00BOHNYU6", "B00CO1I2FS", "B00829THO6"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]]}