{"asin": "B001BTCSI6", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]], "description": "The new D700 digital SLR camera featuring a 12.1-effective megapixel Nikon FX-format sensor that measures 23.9 x 36mm, which is nearly identical to the size of 35mm film. Benefiting from Nikons legacy of imaging technology innovation, the D700 offers both advanced and professional photographers stunning image quality, accurate color reproduction and revolutionary low light performance.Building on the immense success of the Nikon D3 professional D-SLR camera, the D700 offers pro-level performance and an extensive array of features and innovations in a comfortably nimble platform. In addition to the Nikon-original FX-format CMOS sensor, the D700 incorporates Nikon's EXPEED Image Processing System, Nikons renowned 51-point auto focus system with 3D Focus Tracking and two Live View shooting modes that allow photographers to frame a shot using the camera's three-inch high-resolution LCD monitor. The D700 also features Nikons sophisticated Scene Recognition System and a new active dust reduction system.Nikons flagship FX and DX-format cameras, the D3 and D300 respectively, established new benchmarks for digital image quality, speed, and unmatched ISO performance. The D700 maintains this new measure with exceptional overall image quality, broad tonal range and depth, and extremely low noise throughout its native ISO range of 200 to 6400.Nikon D700 Digital SLR HighlightsThe legendary Nikon FX-Format CMOS sensorThe D700s 12.1-megapixel FX-format CMOS image sensor provides exceptional image quality throughout its remarkable ISO sensitivity range. A large pixel size of 8.45 &micro;m allows for an extremely low signal-to-noise ratio and a wide dynamic range. The 12-channel readout enables accelerated information transfer, allowing the D700 to shoot at speeds of up to eight frames per second at full resolution (using the optional MB-D10 Multi Power Battery Pack) and quickly write image data onto the CompactFlash card.The D700 offers a versatile base ISO range from 200-6400 but can be expanded to range from ISO 100 (Lo-1) to 25,600 (Hi-2) affording photographers the new-found confidence to shoot in the widest variety of lighting conditions from the brightest midday sun to dim interiors. Images previously thought to be impossible to create without complex lighting set-ups or lengthy post-processing are now captured easily and faithfully with the D700, unleashing new and diverse shooting possibilities.Also new to the D700 is Nikons first self-cleaning system designed for the FX-format sensor. Utilizing four distinct vibration frequencies, the D700 frees image degrading dust particles from the sensors optical low-pass filter at start-up, shut-down or on demand. As an added benefit, the mirror box and entire shutter mechanism are constructed of materials that resist creating debris that can affect image purity.Fastest speed and autofocus in its classThe D700 starts up in a mere 0.12 seconds and has a nearly imperceptible shutter-lag response time of 0.40 milliseconds, making this an extraordinarily responsive tool for the demanding photographer. The D700 can record full-resolution JPEG images at an astounding five frames per second (fps), or eight fps with the optional MB-D10 battery pack for up to 100 images, or up to 17 lossless 14-bit Nikon NEF (RAW) files. To write images efficiently, the Nikon D700 is also compliant with the next-generation of high-speed UDMA CompactFlash cards that will enable recording speeds up to 35 megabytes/second.The D700 offers one of the fastest and most accurate advanced AF systems on the market today. Nikons Multi-CAM 3500FX autofocus sensor module features 51 AF points and the ability to use 3D tracking to focus and lock-on a moving subject. The 15 cross-type sensors and 36 horizontal sensors can be used individually or in groups, with the option for Single Area AF mode and Dynamic AF modes using groups of either 9, 21 or all 51 focus points. The system also features 3D Focus Tracking with automatic focus point switching that takes advantage of all 51 AF points as it uses scene color content and light information to accurately track the subject.Intelligent features for sophisticated performanceThe D700 relies on a wealth of innovative Nikon technologies to help photographers create superb images. Nikons Scene Recognition System analyzes information from the 1,005-pixel RGB light sensor for use in auto exposure, auto white balance and autofocus calculations. The Scene Recognition System also assists autofocus by tracking subject position and automatically shifts the AF points used to match the subjects movement within the frame. This system also contributes to higher accuracy of auto exposure and auto white balance detection, resulting in sharp landscapes, flattering portraits and engaging action shots.Photographers also have the option to enhance their pictures during or after capture with the Picture Control System and Active D-Lighting. Nikons Picture Control System enables users to adjust their images to pre-set parameters such as Standard, Neutral, Vivid and Monochrome that apply tweaks to image sharpening, tone compensation, brightness, overall tone and saturation. D-Lighting uses localized tone control technology to further optimize highlight and shadow detail while also maintaining natural contrast, giving photographers the ability to capture more perfectly exposed images, even in unusual lighting conditions. Active D-Lighting lets photographers choose from various intensities during capture, while a new Automatic mode also applies varying levels of D-Lighting as, and when needed, to enhance photos while shooting.Enhanced Live View modes and viewfinderIdeal for studio, remote applications and more, Nikons Live View allows the photographer to compose the subject on the bright three-inch, TFT LCD monitor. In Handheld mode, the user is able to recompose the frame prior to actual shooting; familiar TTL phase-detection AF is activated, using all 51 AF points. Tripod mode is designed for precise focus accuracy with still subjects and tripod stabilization. It enables focal-plane contrast-detect AF on a desired point within a specific area. Remote view, focusing and shooting can also be controlled from a PC (via connection or wireless) using the optional Nikon Camera Control Pro 2 software. Additionally, the Virtual Horizon feature on the D700 can now be superimposed over the Live View monitor image to aid composition.While using Live View to compose or review images and settings, users will appreciate the ultra-high resolution 920,000-dot VGA, three-inch TFT LCD monitor with tempered glass that provides a wide 170-degree viewing angle. The large monitor is remarkably effective when confirming the focus with enlarged playback images. The camera also outputs a video signal to an HD television using the new smaller HDMI-C standard, which is an excellent solution for workshop demonstrations or shooting tethered for clients.Photographers will also be able to compose images easily using the wide and bright viewfinder that features an eye-level pentaprism with high refraction index and provides a 95-percent frame coverage with 0.72x magnification. Each of the 51 AF points, as well as a framing grid, can also be superimposed on the finder screen to suit the photographers personal preferences.Rugged construction and durabilityHigh-strength magnesium alloy is used for the construction of the camera body, rear body and mirror box to create a precision platform, reduce weight and provide rugged durability. The camera is tested to stand up to the rigors of the globetrotting photographer and is weather sealed using precision O-rings where connections are made to effectively combat dust and moisture.The shutter unit employs an assembly made of a new composite carbon fiber and Kevlar hybrid material. Tested on fully assembled cameras, the D700s shutter unit has been proven through 150,000 cycles under demanding conditions. The self-diagnostic shutter constantly monitors and maintains shutter precision to ensure peak performance.", "title": "Nikon D700 12.1MP FX-Format CMOS Digital SLR Camera with 3.0-Inch LCD (Body Only)", "brand": "Nikon", "salesRank": {"Camera &amp; Photo": 1874}, "imUrl": "http://ecx.images-amazon.com/images/I/51DKMHkrtrL._SX300_.jpg", "related": {"also_bought": ["B000VDF5RO", "B000BYCKU8", "1598639927", "B000VDCT3C", "B001T9N0RQ", "B001CADQ5I", "B001GCVA0U", "B005DIYQA4", "B002NO7Q26", "B00005LENO", "B0050YG3CU", "B002NO8PTY", "B00EZEBVE6", "B006TAP096", "1933952237", "B002JCSV8U", "B002N694A6", "B004Y1AYAC", "B00D5NLVBQ", "B003ZSHNEA", "B002P370AI", "B000A6EXNO", "B00005LEOC", "B000BWRIE8", "B002NO7PWC", "B001G4VSB4", "B00GUQJZCW", "B004YTCNJY", "B002WE4H8I", "B0045TYDNC", "B001955P8W", "B000EOSHGQ", "B00009MDBQ", "B000KZ70JE", "B0042X9L6A", "B0009PEU3Y", "B0093HGDVG", "B00065F86U", "B000VDCTCI", "B00GGM6LUO", "B0002EMY9Y", "B00005LE72", "B0042X9LB0", "B003ZSHNE0", "B001FO4QHI", "B0009M1O9A", "B001VO83A8", "B001NS0OZ4", "B0029U7PZM", "B002ZIMEMW", "B00005LEN4", "B003RLJVYK", "B00005LE76", "B00A35X8ZG", "B00005LEOH", "B002TXJUJ8", "B0018ZDGAW", "B0037KM0XA", "B006G5ZVA2", "B00005LEOS", "B000CDA802", "B0034WR19Y", "B00127VAW2", "B001CRC1Q6", "B002OL80UK", "B00065ANY2", "B003HC8VA4", "B005PCDSBQ", "B002ODISD2", "B006TF37H8", "B00006I5J7", "B0010Y4RZE", "0321803531", "B0016XIQ1U", "B0093HGEKG", "0470413204", "B0062W02C6", "B001NEK2QO", "B0049VZ4XE", "B0002GFOSU", "B0079M711S", "B002O3KVSC", "0385344783", "B0029LL5IY", "B0093HGD2K", "B004EHJWRW", "B00006I5JC", "B0076AYNXM", "B00005NPW8", "B0012GDOQS", "B002SXNXUG", "B00BXA7N6A", "B00005LE6Z", "B005IMFX2K", "B006NYJNTG", "B002O3MVYO", "B0056MPWZU", "B001G9WAF2"], "bought_together": ["B000BYCKU8"], "buy_after_viewing": ["B000BYCKU8", "B001S2PPT0", "B00FOTF8M2", "B00LAJQVR6"]}}