{"asin": "B001AWBYNE", "description": "Call of Duty: World at War from Activision for the Sony PlayStation 3 completely changes the rules of engagement by redefining World War II gameplay. In this edition, players are thrust into the final, tension-filled battles against a new, ferocious enemy in the most dangerous and suspenseful action ever seen in a WWII title. Building on the Call of Duty 4: Modern Warfare engine, this installment promises to immerse players in gritty, chaotic combat. You'll have to band together to survive harrowing and climactic battles that defined WWII and led to the demise of the Axis powers..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Call of Duty: World at War promises to immerse players in gritty, chaotic combat.View larger.The potent flamethrower will set the battlefield ablaze.View larger.From the remains of Russia and the ruins of Berlin, to the beach and jungles of the deadly Pacific Theater, Call of Duty: World at War's campaign gameplay employs features that were only available in multiplayer gameplay in the previous installments. With this title you can take advantage of perks, rankings, and online stats in an up-to-four-player cooperative gameplay that is sure to revolutionize the way you play Call of Duty. And with new infantry and vehicle-based weapons, such as the potent flamethrower, you'll have the tools you need to set the battlefield ablaze and defeat the enemy.Battle against the fearless Imperial Japanese and elite German soldiers.View larger.Engage in epic infantry, vehicle, and airborne missions across a variety of Pacific and European locations.View larger.Advanced Enemies, New Environments, and Fearless TacticsYou've never encountered combat challenges like those presented in Call of Duty: World at War. Prepare yourself to face off against ruthless enemies who employ advanced tactics. Your foes will stop at nothing to defend their homelands. With swampy ambushes, tree-top snipers, and fearless Kamikaze attacks, there is no safe place to turn. As U.S. Marine and Russian conscripts, you'll battle against the fearless Imperial Japanese and elite German soldiers in epic infantry, vehicle, and airborne missions across a variety of Pacific and European locations. On foot, behind the wheel, or in the air, you'll have to be relentless to achieve victory.Cutting-Edge Technology and Physics-Enabled BattlefieldsCall of Duty: World at War utilizes cutting-edge technology, including highly-detailed character models, self-shadowing, environmental lighting and amazing special effects to deliver best-of-breed visuals. Depth of field, rim-lighting and texture-streaming technology bring the adrenaline-pumping combat to life. And with physics-enabled battlefields and fire that spreads realistically through environments, you'll feel immersed in battles that are both life-like and dynamic.Cooperative Campaign ModeFor the first time in franchise history, Call of Duty introduces cooperative campaign gameplay, bringing a breath of fresh air to \"No One Fights Alone.\" This gameplay mode allows up to four players to meet and play online, or a two-player local split-screen co-op. Now you can share the terrifying experience of campaign missions with your friends for greater camaraderie and improved tactical execution. Co-op mode also incorporates innovative multiplayer components, such as challenges, rankings and online stats, and even features a competitive co-op mode that will identify the best player on your team.Improved Online Multiplayer ActionCall of Duty: World at War once again delivers sophisticated, class-based, online multiplayer action that has made the series famous. New additions include vehicle combat with tanks, and Call of Duty: World at War rounds out the multiplayer experience with improved features, such as persistent stats, player rankings, upgradeable weapons, squad-based gameplay, customized classes, enhanced perks, and more.", "price": 19.82, "imUrl": "http://ecx.images-amazon.com/images/I/51AkDcp%2B8WL._SY300_.jpg", "related": {"also_bought": ["B000GA73O0", "B0016B28WU", "B00269QLH4", "B000TG72TM", "B003JVCA9Q", "B00503E9FY", "B00519C7JC", "B007E5Y8UC", "B002ZJNWWC", "B007XVTR5S", "B000PS4X9G", "B008B3AVPC", "B003O6CBIG", "B000WS97QI", "B000N4MSAS", "B0050SWZHS", "B002I0J82G", "B00EFFVZP0", "B003VWGBBG", "B002I0K6DG", "B00D2EGWDA", "B002ELCV00", "B000FQBF1M", "B00149ILDO", "B00269DX5W", "B00320JAWY", "B00G9DFMDW", "B008E6ZXTA", "B0050SXFKE", "B0050SXX88", "B000P46NMA", "B001QXNBNI", "B0050SX9VO", "B0012FHWX0", "B001TOMQSK", "B001TOMQOY", "B004EDJOYC", "B001SGZL2W", "B001CRM3YQ", "B000X1TC0U", "B001ASJIRC", "B002I0H2G0", "B004L5SJ58", "B002I0J5UQ", "B0045U01OG", "B002BRZ6UE", "B00354NANC", "B001C4DKG4", "B000M4KJ32", "B0076ZQSFI", "B000JLIXIG", "B003L8DXOI", "B001G33V8S", "B007CM0K86", "B00JQHU9RC", "B003Q55YCU", "B000HKP88C", "B0022TNO7I", "B003O6E67A", "B003C1I06U", "B0050SXGU8", "B0050SXKU4", "B000ZK9QCS", "B001JKTC9A", "B004YVOCV4", "B0085L2T0A", "B0085CA8QG", "B002I0JBL4", "B0041OWQTO", "B005EZ5GW8", "B002E1R1TG", "B0088I7L76", "B001NX6GBK", "B001AZFSEW", "B0050SXEM8", "B004EQCCI4", "B00149ND28", "B004918C4M", "B0050SXLQC", "B004FS8LYK", "B0017HPE6K", "B007TYC8MI", "B008CP6MA2", "B0012N94WO", "B0020KZZHG", "B0091KKHJ4", "B001NIP3EG", "B00886WO7A", "B005N4HBIW", "B000HXDKA2", "B00C7103DO", "B000JHMJDA", "B006VB2UMI", "B0037LVW9M", "B002I0F5M8", "B002EZH804", "B00488PZ2S", "B008OQTU6C", "B007SRM5U6"], "bought_together": ["B000GA73O0", "B0016B28WU"], "buy_after_viewing": ["B003O6CBIG", "B0016B28WU", "B000TG72TM", "B00BMFIXKQ"]}, "salesRank": {"Video Games": 1200}, "categories": [["Video Games", "PlayStation 3", "Games"]]}