{"asin": "B00CM1AANW", "categories": [["Electronics", "Computers & Accessories", "Laptops"]], "description": "The Aspire&reg; V5-122P Touch Notebook delivers full PC performance in a thin and mobile package. At less than 1\" slim and just over 3 lbs., it features reliable AMD Quad-Core processing and an 11.6\" HD Touch display that makes the most of Windows 8 letting you touch, swipe and tap your way through the web. With a full-size back-lit keyboard and superb connectivity, you can stay productive wherever you are!Key Features11.6\" HD (1366 x 768) widescreen CineCrystal&trade; LED-backlit displayMulti-touch screen, supporting 10-finger touchAMD A-Series Quad-Core Processor A6-1450 1.0GHzwith TurboCORE Technology up to 1.4GHz (2MB L2 Cache)Windows 8500GB Hard Drive6GB DDR3 MemoryAMD Radeon&trade; HD 8250 graphicswith 512MB of  system memory802.11b/g/n Wi-Fi CERTIFIED&trade;Bluetooth&reg; 4.0 + HSIntegrated HD webcam (1280 x 720)Two integrated speakers1- USB 3.0 Port1- USB 2.0 PortFull-size Acer FineTip back-lit keyboardAcer ZoomPerfect touchpad3-cell Li-ion Battery3.04 lbs.| 1.38 kg(system unit only)Learn MoreMobile PerformanceThe new ultraportable V5-122P Notebook gives your digital lifestyle a fresh personality! The smooth rounded corners make it comfortable to carry. The semi-matte cover has a modern yet classic appeal and comes in Chill Silver and Icy Blue.Less than 1\" slim and just over 3 lbs., this thin &amp; light touch notebook features full performance in an easy to carry package. Its 3-cell battery fits flush into the chassis, further streamlining the notebook's look and providing up to 3.5 hours of cord-free battery life on a single charge!You can extend battery life up to 6 hours with an optional second battery and accomplish all your daily tasks from day to night without having to think about recharging.The Aspire V5-122P features the reliable AMD A6-1450 Quad-Core processor, delivering the performance you want for browsing the web quickly, enjoying online HD entertainment and conquering your everyday computing needs. Plus, it enhances power efficiency and battery life.Discover TouchExperience a new type of navigation on the stunning 11.6\" HD LCD 10-point multi-touch display. The frameless edge-to-edge screen keeps this notebook super slim and provides easy, conventient access to the web, apps, photos, music and more with the touch of a finger.The 10-point multi-touch display makes your digital life more intuitive, more electric, more fun! Experience efficiency hands-on as you open programs and complete tasks, browse online, and breeze through photo albums&mdash;using nothing but your fingers. Simply use scroll, flick, pinch and rotate motions to accomplish your work quickly.Windows 8 has been re-imagined to be all about you. Put what matters most right on your Start screen. Get instant access to your people, apps, sites and more, so you can spend less time searching and more time doing. Windows 8 is smooth, intuitive, and designed to let you do what you want, the way you want, anytime you want.Enhanced ProductivityThe Aspire V5-122P is compact, yet it has full-size features. It's easy to stay productive thanks to the 100% standard-size keyboard with bigger keys for more accurate typing. The ZoomPerfect touchpad enhances sensitivity, accuracy and usability in Windows 8. The intuitive gestures on the touchpad give you the same incredible control as a touch-panel display provides.Backlit Keyboard adds a cool subtle glow to your typing experience that not only looks good, but helps guide your fingers while typing in dimly lit areas.Keep the notebook ultra-slim and super light while adding a VGA port with the included Acer Coverter Dongle.Ultra-thin and light yet powerful, the Aspire V5-122P Series offers excellent performance and great value, making it one of the most affordable, versatile and full-featured notebook with multi-touch capabilities you can buy.", "title": "Acer Aspire V5-122P-0637 11.6-Inch Touchscreen Laptop (Chill Silver)", "price": 394.0, "imUrl": "http://ecx.images-amazon.com/images/I/41svs-i-lAL._SX300_.jpg", "brand": "Acer", "related": {"also_bought": ["B004NY9UV4", "B00G74QJM6", "B002HZW7CK", "B009PIORNE", "B00E3EALXA", "B007KB5V0G", "B00DUGZFA6", "B001UDVUNW", "B007Y91RAC", "B00AQM8586", "B00DBV28TG", "B003WCAX5A", "B006HUMYCO", "B00DRNEV9S", "B005EIGUD4"], "bought_together": ["B004NY9UV4"], "buy_after_viewing": ["B00GB9NUXI", "B00HZT1T5E", "B007Y91QY4", "B004NY9UV4"]}}