{"asin": "B000XSPEPA", "categories": [["Office Products", "Office & School Supplies", "Tape, Adhesives & Fasteners", "Tape Dispensers", "Office Tape Dispensers"]], "description": "In 1930, 3M engineer Richard Drew invented an attractive, moisture-proof material to help grocers and bakers seal up their packages. Over 70 years later, Scotch&reg;tape boasts over 400 varieties sold under the Scotch&reg;and 3M&trade; brands.Now indispensible in homes and offices, Scotch&reg;tapes offer specialty and general solutions for many projects--from crafts and gift-wrapping to mounting and everyday sealing.Scotch&reg;Magic&trade; Tape&nbsp;Frosty on the roll but invisible on paper, Scotch&reg;Magic&trade; Tape features the original matte-finish design for a strong hold and seamless look. This tape pulls off the roll and cuts smoothly, resisting splits and tears for a sturdy piece. Thanks to its gentle adhesive, you can stick then re-stick each piece as your project demands, then jot a helpful note with a pen or pencil on top when you're done.Ideal Use:All home and office needs and craft projects.Scotch&reg;GiftWrap Tape&nbsp;Keep your presents secure and looking fabulous with Scotch&reg;GiftWrap Tape. Featuring a unique satin finish, this tape pulls smoothly from the roll and disappears on most gift-wrap papers for a seamless close. The paper holds together, and your gift takes on a professional appearance.Ideal Use:Gift-wrapping.Scotch&reg;MultiTask Tape&nbsp;For those everyday jobs, Scotch&reg;MultiTask Tape features a strong, moisture-resistant material ideal for a wide range of taping tasks. Thanks to its high-quality performance and unique design with crystal clarity, it's easy to subtly add a strip to a project for a professional look and a secure hold.Ideal Use:General tasks around the home and office, including household mending and sealing.Scotch&reg;Double-Sided Tape&nbsp;Versatile and convenient, Scotch&reg;Double-Sided Tape offers a mess-free alternative to glue sticks for those light-duty attaching and mounting tasks. Featuring a two-sided adhesive, this tape comes in both a permanent and removable style so you can match the proper tape to the task. As a bonus, this tape is photo-friendly so you can keep your memories securely attached and looking good.Ideal Use:Craft projects, mounting, sealing, gift-wrapping, and decorating.Scotch&reg;Removable Tape&nbsp;Scotch&reg;Removable Tape features a unique adhesive that holds papers securely, while allowing you to remove or reposition each strip as needed. Because of its matte-finish, this tape adds a professional touch to layouts or posters. For those moments when you require a little explanation, jot a quick note on top with a pen or pencil.Ideal Use:General tasks around the home and office. Great for art, graphic design, or architectural layout projects.Scotch&reg;Pop-Up Tape&nbsp;Offering handy pre- cut strips, Scotch&reg;Pop-Up Tape puts convenience and organization at your fingertips. With several dispenser types to choose from, you can wear tape on your wrist, stick a tape disk to your desk, or use a mountable or portable dispenser where you need it most. The one-handed dispensing method allows you to work without pausing, so you can finish projects with ease and efficiency.Ideal Use:Gift-wrapping, desk, and home-office use.Scotch&reg;Packaging TapeFor strapping, sealing, and protecting packages, nothing compares to Scotch&reg;Packaging Tapes. Ideal for shipping and storing, each tape is tear- and split-resistant for high-quality containment.Scotch&reg;ScissorsAn ideal tool for home, office, and school, Scotch&reg;Scissors offer high-quality performance and comfortable grip. Featuring titanium-fused or stainless steel blades, each scissor is designed to cut smoothly and accurately.Scotch&reg;Cutting ToolsScotch&trade; Cutters offer a faster, safer way to make clean, straight cuts. Ideal for gift-wrapping, opening mail, or cutting coupons, these tools offer speed and convenience for today's Scotch&reg;users.Post-it&reg;NotesKeep organized with the conveniently compact Post-it&reg;Notes. Featuring a gentle adhesive that won't mar the surface, Post-it&reg;Notes offer a wide variety of colors and sizes to suit your noting needs.", "title": "Scotch PopUp Tape Handband Dispenser, 0.75 x 2 Inches, 75 Strips per Pad, 1 Pad per Pack (Colors May Vary) (96-G)", "price": 3.75, "imUrl": "http://ecx.images-amazon.com/images/I/41vhIxpP4AL._SY300_.jpg", "brand": "Scotch", "related": {"also_bought": ["B002NZG1GC", "B00006IF6E", "B002DHC6FA", "B004E2O8BC", "B001B09GLM", "B0039N3QFQ", "B004S8DN2W", "B00CRMFJOQ", "B004A91TE8", "B00004Z4C8", "B006NDXHP8", "B001GXHH5G", "B0017DF9F0", "B005QOLZU4", "B00B7JIDJ8", "B002WUP268", "B0019IM7FS", "B005P3G7HC", "B002M99EPE", "B0000538AC", "B00974L9TQ", "B0009F3P3U", "B004STNJU2", "B004NSU7KS", "B008J4ZBE4", "B00006IF67", "B00974L9WS", "B00143UIC2", "B009A57L9O", "B00006IF79", "B008OIB4AK", "B002NUPY5G", "B003W0P2SA", "B004Y6NCPQ", "B000JE96PM", "B0006HVKOC", "B0002LCRMG", "B00006IE7L", "B001BKHHGS"], "also_viewed": ["B00006IF6E", "B002NZG1GC", "B006NDXHP8", "B0039N3QFQ", "B00004Z4C8", "B001GXHH5G", "B005P3G7HC", "B004E2O8BC", "B00CRMFJOQ", "B002VPDKSQ", "B004A91TE8", "B002NUPY0Q", "B008ELKXDG", "B000PSAAH0", "B002M99EPE", "B001B09GLM", "B001BM2M8Y", "B0096JZYYS", "B003FHF98S", "B002DHC6FA", "B002VPDKT0", "B002JFYOI8", "B002JFYOGK", "B002NUPY5G", "B0039N7EI6", "B002BSV3OQ", "B000NHZ3IY", "B002WUP268", "B0006HVKOC", "B004S8DN2W", "B0014E6O1U", "B009201ZX0", "B0002LCRMG", "B006CU11KU", "B00D3EWG70", "B000MIQGHG", "B00HELQKPC", "B000CBWWHG", "B00006IF6X", "B001AS8B8E", "B00006IF67", "B0009F3P3U", "B0035FX5MC", "B00J4UQIBC", "B001QAIC08", "B000F8XDV0", "B003W0P2SA", "B007VTQC64", "B0013C7YDK", "B0017D80J2", "B00004YTJF", "B0006JN0ZC", "B00005C3YY", "B00J0BKY24", "B00409NNYM", "B001C851U8", "B00006IF79", "B00143UIC2", "B0039N3QO2", "B007TSAWOU"]}}