{"asin": "B000PS4X7S", "description": "Set in a modern day survival-horror universe, the co-operative gameplay ofLeft 4 Dead(L4D) casts four \"Survivors\" in an epic struggle against hordes of swarming zombies and terrifying \"Boss Infected\" mutants. Developed by Turtle Rock Studios and Valve, creators of theCounter-StrikeandHalf-Lifegames, the latest AI technology allows for multiplayer games of one to eight players.A new and highly virulent strain of the rabies virus emerges and spreads through the human population with frightening speed. The pandemic's victims become grotesquely disfigured widely violent psychopaths, attacking the uninfected on sight. As one of the \"lucky\" few apparently immune to the sickness, you, unfortunately, are also trapped in a city crawling with thousands of the bloodthirsty Infected. Alone, you're dead. But together with a handful of fellow survivors, you might just fight your way to safety.Players can play as a Survivor or as one of four types of Boss Infected, each of whom possess a unique mutant ability, such as a 50-foot tongue lasso or a giant belly full of explosive methane gas. The gameplay ofL4Dis set across four massive campaigns. The zombie population of each mission is choreographed by an AI Director that monitors the human players' actions and creates a unique and dramatic experience for them on the fly.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51-Jik-nBkL._SY300_.jpg", "related": {"also_bought": ["B002BRYXRQ", "B002BSH9J4", "B002BS47YE", "B00503EAG2", "B001AWBYRA", "B00269QLJ2", "B0016BVYAM", "B0019C4MU2", "B002I0JIQW", "B001Q96ZNU", "B000PS2XES", "B000EPP6UA", "B001VJ4DHK", "B003ICGL7I", "B00140P9BA", "B002EE1PBS", "B003O6CB6S", "B000WQ1XIA", "B000UU5T7E", "B00009TW6R", "B003JVF728", "B002V14VOC", "B004FZ9822", "B004PAGJMO", "B004FYKWZU", "B0001X5YN4", "B00006GSO1", "B001O4YSTU", "B002BXKJA0", "B002NINFHM", "B001CC8UBG", "B001AZTU28", "B000NV8F58", "B0007YBJ1S", "B0050SZ0SY", "B005THAX60", "B002I0KOSI", "B0042WXQ62", "B0085A9HU6", "B000MK694E", "B004HYIAPM", "B000ID1AKI", "B003GSZAOY", "B0029ZBZ0I", "B005G4CXPK", "B007LQG9A6", "B0065NP39E", "B0079NGSDO"], "bought_together": ["B002BRYXRQ", "B002I0JIQW"], "buy_after_viewing": ["B002BRYXRQ", "B002BRZ852", "B002BSH9J4", "B000PS2XES"]}, "salesRank": {"Video Games": 10189}, "categories": [["Video Games", "PC", "Games"]]}