{"asin": "B0031KBKLY", "categories": [["Electronics", "Camera & Photo", "Lighting & Studio", "Photo Studio", "Storage & Presentation Materials", "Digital Picture Frames"]], "description": "(please note there is now a newer X08D version available). Why bother turning your frame on and off all the time?  Featuring an inbuilt motion sensor, the frame will turn itself on when it senses any motion and off again when it senses no motion.  This frame is perfect for parents and grandparents who just want a frame that works, without the hassle of having to actually operate it.   As well as it's ease of use; the frame features a high resolution SVGA screen with LED backlighting.  Importantly the frame will also play your MPEG-4 / .AVI video, JPEG photos and MP3 music. The motion sensor is very easily set up and can be set to switch off after sensing no movement in time increments from 30 seconds to 1 hour.  When the frame activates after sensing movement it can play either your photos (from where it left off in the slideshow), videos or music.  The choice is yours. Additional features include an auto rotate sensor that flips your photos 90 degrees when you physically rotate the frame. This optimizes the use of the screen for your portrait (vertical) photos. Ideal for showing off that holiday you just got back from! Remember that connecting the frame to external speakers via the audio jack allows for an even richer sound experience.  Enjoy Peace of mind with a full manufacturers 1 year warranty.", "title": "NIX X08C Hu-Motion: 8 Inch Digital Picture Frame with Motion Detection Sensor.", "price": 59.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/415vGmAjG%2BL._SY300_.jpg", "related": {"also_bought": ["B00200K1SY", "B00200K1SO", "B000OF2F36", "B0021L9BKQ", "B000MX48VM", "B0013AV9TW", "B008MW6Y12", "B003VNKNEG", "B000WQKOQM", "B001W1BSM0", "B000VUVA62", "B000P1O73A", "B003VNKNEQ"], "buy_after_viewing": ["B008MW6Y12", "B000P1O73A", "B008MDOTUE", "B00200K1SY"]}}