{"asin": "B002DMKPQ2", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]], "description": "Don't just hear the music, feel it. With the Remix Audio, you get unparalleled sound clarity and vibrant bass putting you in every song. Combining all-metal craftsmanship with fashion-forward design, the Remix Audio is lightweight and durable, perfect for the mobile lifestyle.Unparalleled SoundA newly tuned 9mm V-MASQUE high definition dynamic driver creates the absolute in clarity and the perfect balance of vibrant bass built in collaboration with pro musicians and DJs. The BEATPORT air flow system delivers a high-definition soundstage, invoking the sense of a live music or club experience. V-MODA's revered BLISS (Bass Level Isolating Soft Silicone) noise-isolating technology further reduces outside noise and enables deep punchy bass for the ultimate audio experience.Ultimate Ergonomic ComfortYour headphones are supposed to be comfortable. With rigorous ergonomic research and development, the Remix Audio gives you an incredible fit for the ultimate music experience. The newly designed medical-grade soft silicone ear tips come in four sizes and are designed for a comfortable and secure fit. For the active lifestyle, the detachable sport earhooks feature patent pending Active Flex technology for maximum stability.Kevlar core for serious durability.Click to enlarge.Built to LastWe're passionate about sound and providing you a durable product. We've spent years of diligent engineering to insure Remix Audio is multiple times stronger than many headphones sold within the same price range. Each component was dissected and analyzed by a team of seasoned engineers to create a high-quality headphone that could withstand the extended use by V-MODA's dedicated listeners. With the dual functionality of today's headphones as headsets, it is paramount that the cable and plug are as precisely engineered as the ear buds. Special attention was given to a custom cable construction comprised of a strong Kevlar core to relieve tension and a uniquely braided copper material that is specially designed to increase flex during use. The gold-plated plug and stainless steel core feature a 45-degree extended strain relief to withstand stress.What It Means to be a \"Lifestyle\" HeadphoneAt the gym, heading to the venue, or walking down the street, the Remix Audio is designed for your mobile lifestyle. Weighing only 13 grams, they are lightweight for comfort. Featuring all-metal construction, the Remix Audio combines sleek design and durability. The patent pending detachable sport earhooks insure you don't miss a beat, even when you're on the go. With the Remix Audio, the pinnacle experience of music is interwoven with supreme style in these premium fashion-phones that sound as amazing as they look.We put years of extra thought and research into the cable. Why is the cable so important? The main cable diameter of 2.2mm and overall cord length of 44\"-46\" work best to prevent \"earphone fallout\". V-MODA's cables are rigorously tested with weights to withstand abuse.", "title": "V-MODA Remix In-Ear Noise-Isolating Metal Headphone (Blush)", "price": 59.66, "imUrl": "http://ecx.images-amazon.com/images/I/41JF-E-ErcL._SY300_.jpg", "brand": "V-MODA", "related": {"also_bought": ["B0018M8L6O", "B005LD275M", "B006DK65A0", "B008MW7SLW", "B0038W0NPE", "B003BYRGJU", "B0038W0NOU", "B003BYRGLI", "B005HFJFK4", "B007TEQNAG", "B0058M3RXW", "B000816CE4", "B000WAHFBK", "B005GOPXRA", "B00178630A", "B007CGULSQ", "B0050SWMCG"], "bought_together": ["B006DK65A0"], "buy_after_viewing": ["B006DK65A0", "B0018M8L6O", "B008MW7SLW", "B005LD275M"]}}