{"asin": "B001QFZMCO", "related": {"also_bought": ["B003EENZVK", "B002KTL706", "B002FL4WYW", "B003VNKNEQ", "B003WFWVSO"], "bought_together": ["B003VNKNEQ"], "buy_after_viewing": ["B00728ZBA2", "B003VNKNF0", "B003VNKNEQ", "B003F7DWH8"]}, "title": "Panasonic Lumix DMC-ZS3 10.1 MP Digital Camera with 12x Wide Angle MEGA Optical Image Stabilized Zoom and 3 inch LCD (Black)", "price": 434.99, "salesRank": {"Camera &amp; Photo": 4506}, "imUrl": "http://ecx.images-amazon.com/images/I/41I9GU-IagL._SX300_.jpg", "brand": "Panasonic", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The new Lumix ZS3 features 10.1-megapixels, a 25mm ultra-wide-angle lens and 12x optical zoom, meaning it has added 2x optical zoom to the award-winning TZ-series camera, yet reduced its size. The ZS3 also features a Leica DC Vario-Elmar lens and High Definition (HD) video recording ability, known as AVCHD Lite.The ZS3 is the world&rsquo;s first digital camera to feature HD video recording in \"AVCHD Lite.\" Compared with the conventional Motion JPEG format, AVCHD Lite allows longer recordings with breathtaking HD visual and audio quality. This combined with a well-considered control interface, which includes a dedicated movie recording button on the camera&rsquo;s back panel, makes the ZS3 a hybrid model that performs admirably for both still and motion image capture.The ZS3 also expands Panasonic&rsquo;s popular Intelligent Auto (iA) mode with the addition of Face Recognition--a feature that \"remembers\" faces from previous shots. When a registered face appears in the frame, the camera will prioritize focus and exposure to capture it beautifully.  With Face Recognition, when a familiar face is recorded several times, the camera will prompt the users to register the face. Once registered, if the face appears into the frame again, the camera will display the name specified for that person and prioritize focus and exposure so that the registered face is bright and sharply focused.New this year to the ZS-Series, iA mode is also available in Movie Mode. It automatically selects the most suitable Scene mode and helps to correct handshake, focus and brightness problems - making iA mode your one-stop solution to capture beautiful still and motion images. In Movie Mode, the ZS3, Optical Image Stabilization (O.I.S.) helps prevent handshake when using the high-powered zoom. Face Detection automatically detects a face in the frame and adjusts focus, exposure, contrast, and skin complexion so it turns out perfectly. Intelligent Exposure continually checks the ambient light level and adjusts the exposure setting as conditions change to prevent blown highlights and blocked shadows. And Intelligent Scene Selector automatically switches between Normal, Portrait, Macro, Scenery, and Low Light modes according to the situation to optimize visual quality.The imaging power of Lumix has further evolved with the Venus Engine HD, which boasts two CPUs to provide approx. 2.4x processing capability and support for AVCHD Lite and HDMI output. It integrates all the advanced functions and camera operations with high performance and low-power consumption. In image processing, luminance noise and chromatic noise are reduced separately before and after signal processing. This is further refined by separating noise two-dimensionally into high-frequency and low-frequency noise. The circuits then effectively reduce only the low-frequency noise to minimize the unwanted noise and help produce beautiful, sharp still and motion images.Playback with the ZS-series is also easy.  Simply insert the camera&rsquo;s SD memory card into the VIERA HDTV&rsquo;s Image Viewer SD Card slot for a photo slideshow. Alternatively, connect the camera via an optional HDMI mini cable, the DMW-HDC2, to a VIERA Link-equipped Panasonic VIERA HDTV and use the television&rsquo;s remote control to run mixed slideshows of photos and videos. The ZS3 features a 3-inch, high resolution 460,000-dot Intelligent LCD with a wide viewing angle, improving visibility during recording and playback.Other features of the Lumix ZS3 include:Increased Scene modes for both still and motion image shooting--optimized for a variety of situations. There are 26 scene modes for still image and 17 for motion image (Portrait, Soft Skin, Transform, Self portrait, Scenery, Low light, Food, Party, Candle light, Sunset, High sensitivity, Beach, Snow, Aerial, Pin hole, Film grain and Underwater)Two new My Scene settings let users assign their two most frequently used Scene modes to the setting, and with a simple switch, allow access to either scene instantly.New Panorama Assist scene mode allows users to shoot a number of consistent photos, either vertically or horizontally, by aligning them according to a guide that overlaps the screen.  Then using those photos and the bundled PanoramaMaker software, users can create dramatic panoramic images.High-Speed Burst (Speed Priority) that fires off approx. 10 shots per second.Menus are clearer and easier to navigate with the Display Size option.Macro Zoom function lets users pull subjects even closer to capture dramatic close-up shots by using the 3x digital zoom in the wide-angle.Bundled Software: The latest version of PHOTOfunSTUDIO 3.0 HD Edition allows users to view, edit and archive captured content with greater ease and fun. Still and motion images can be transferred to the computer via a USB cable for viewing and archiving. Using PHOTOfunSTUDIO 3.0 HD Edition, users can edit and remove unwanted portions of video clips recorded in AVCHD Lite. Contents recorded in AVCHD Lite can be burned directly onto a DVD disc or the software can convert contents to MPEG2 format.  The software also incorporates the Face Recognition function, which recognizes registered faces in photos stored on the computer, making organizing and archiving photos with a specific person much easier.  Additionally, motion pictures can be uploaded directly to YouTube."}