{"asin": "B002XRZ9G8", "categories": [["Electronics", "Computers & Accessories", "Laptop & Netbook Computer Accessories", "Batteries"]], "description": "Maximize your battery life for more games, videos, music, and photo viewing without having to plug in your AC adapter. This high capacity high quality 9-cell battery is 100% OEM compatible! Guaranteed to meet or exceed OEM specifications. It is made with the highest quality battery cells at the most affordable price with an excellent customer service. All batteries are 100% tested to achieve the highest quality control. New Trent is a trademark of New Trent Inc, is exclusively marketed by authorized reseller ideal point on amazon. The premium provider of laptop batteries and iPhone battery on Amazon. New Trent products are manufactured to meet or exceed the quality standard of the original OEM battery. The battery is 100% tested to ensure the highest performance and reliability. We stands behind every product to with an excellent customer service. Remember to look for the New Trent logo on retail box and Battery itself. If you cannot find the New Trent logo on either retail box or battery, please contact idealpoint support team as soon as possible. Buy only from idealpoint to qualify for one full year product warranty. Compatible models: Dell Inspiron 1526 / 1525 / 1545 /PP29L / PP41L", "title": "AGPtek&reg; 7200mAh 9 Cells Replacement Dell Inspiron 1525 1526 series Laptop Battery fits RN873 GP952 M911 X284G series Laptops w/a AGPtek&reg; USB2.0 All In One Card Reader", "price": 26.22, "salesRank": {"Electronics": 15214}, "imUrl": "http://ecx.images-amazon.com/images/I/41AjqEynl5L._SY300_.jpg", "related": {"also_bought": ["B001MQ8BUM", "B005443H7K", "B002N8087C", "B0043CG3QG", "B0041XOHME", "B004EHUR8U", "B001XZ81FC", "B0047XRVWQ", "B00903F1AM", "B004HY6Z2M", "B0018NH8N0", "B005ZK4QAU", "B004EFH6L8", "B001M0JAVC", "B00291NGXQ", "B002U09ZSG"], "bought_together": ["B001MQ8BUM"], "buy_after_viewing": ["B0047XRVWQ", "B001M0JAVC", "B005U2VAW0", "B003E2O3TU"]}}