{"asin": "B000070IWB", "description": "He's the good, the bad and the ugly all rolled into one, and now he's 3D! Wario, Mario's jealous rival, plays the hero--well, kind of--in his first console adventure.Money TroubleIn the depths of Wario's castle lies the plunder of his many adventures on the Game Boy, Game Boy Advance and elsewhere.While Wario kicks back in his crib, enjoying the videogame equivalent of bling-bling, a mysterious black jewel in his trove transforms gems into monsters. His wealth, which was once a source of pride, becomes his greatest foe. Now, Wario must scramble to recover his riches.Cranky CapitalistStep into an alternate world filled with quirky puzzles, swarming enemies and lots and lots of loot. You'll learn a multitude of cool moves as Wario progresses in the game. You can punch, kick, jump, grab monsters and objects and inhale surrounding coins like a two-legged vacuum cleaner. The game even has a wrestling game-ish feel, as you can string together combo attacks that The Rock would give his eyebrow for.Early on, you will learn the significance of special sticky balls that dot the landscape. Wario can cling to these balls to navigate tough spots, reach new areas, and even fight bosses.You can freely bash and manipulate your surroundings to discover secrets. For instance, you can pick up a stone pillar and swing it at your foes or spin a fallen monster to activate a switch that raises a gate.Perplexing PuzzlesThe side-scrolling action remains true to the Game Boy and Game Boy Advance games that made Wario famous, but Wario's incredible range of motion gives him newfound freedom.Finding treasure often calls for flipping a colored switch, then searching high and low for the activated chest. Considering the size of the worlds and the plethora of hiding places, this can be quite a feat. When it comes to moolah, though, no task is too tough for Wario.Trap doors transport you to hidden worlds that offer mind-bending puzzles. Using your noggin' will yield some important items. A colorful band of fairies offers game info and advice throughout your adventure.GraphicsThe development team at Treasure have stamped Wario's Nintendo GameCube debut with colorful and vibrant graphics. Wario's signature look comes to life like never before. From his arrogant waddle to his purple trousers, Wario is immediately recognizable. Charles Martinet, the actor famous as the voice of Mario, brings a special zest to Wario's growls, chortles and guffaws.From gleaming castle walls to gloomy gravestones,Wario Worldis crammed with beautifully realized details. The action is relentless but the frame rate never falters, even when the screen is packed with dozens of enemies that explode into showers of coins when defeated.Wario Worldwill test both your brains and your button-mashing skills.", "price": 295.34, "imUrl": "http://ecx.images-amazon.com/images/I/514DEMK6TTL._SY300_.jpg", "related": {"also_bought": ["B00005Q8LR", "B000066JRN", "B0001JSSLS", "B0007D4MUE", "B00009PS22", "B0002ILS1K", "B001C58T46", "B00006HBTW", "B000641ZC2", "B00009WAUB", "B0002ILS24", "B00005MI42", "B0000A0O28", "B0009PM8V0", "B00009WAUD", "B00006LU9B", "B000EHPQMG", "B000ZEX9OU", "B00006YXLE", "B000AQA9UA", "B00006966U", "B000ARJI88", "B000069BB0", "B00005Q8LY", "B0000DI6BB", "B00009M98D", "B00012D0SG", "B0000VSH4U", "B000A15K0Y", "B00005Q8LV", "B00005YVU2", "B00005QDQ1", "B0009SQFGQ", "B000L9NPGG", "B00006IJJI", "B000B8J7JQ", "B00006FWTX", "B0000A2Y96", "B00006LEMY", "B0009XEC0C", "B00008URUB", "B00005ULXN", "B0007RDM5G", "B000LSKXRQ", "B000CC3IEQ", "B00021HBAE", "B00005QEFD", "B000E36OVM", "B000620PSY", "B0007D4MVS", "B0002OOUWI", "B0000AHOON", "B0002CHIWO", "B0000A1OG4", "B000ARPXU0", "B0001CJCE2", "B0000D9SQ6", "B002L8W5V6", "B000084318", "B000FDOU9E", "B002C5BMFI", "B00L3LQ1FI", "B000090W86", "B00KWEHBAG", "B00KWFY04A", "B00176ZDQW", "9861019731", "B00006IKCD", "B00019AZC8", "B00008DHLV", "B000FW64OY", "B004CHLNWQ", "B00006FWU6"], "bought_together": ["B00005Q8LR", "B000066JRN"], "buy_after_viewing": ["B000066JRN", "B000ARPXU0", "B001C58T46", "B00009WAUD"]}, "salesRank": {"Video Games": 10286}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "More Systems", "GameCube", "Games"]]}