{"asin": "B003ZZSC84", "categories": [["Electronics", "Camera & Photo", "Flashes", "Shoe Mount Flashes"]], "description": "ThePolaroid PL144 Shoe Mount Flashis an economical full-TTL enabled flash with support for digital SLR cameras. It features a powerful Guide Number of 148'/45 m at 85mm position, and features a power-zoom flash head that covers a focal range from 24mm to 85mm.The flash includes a built-in slave function which allows it to be positioned off-camera, and triggered by any second flash. You can also manually adjust the power level of the flash output from full-power down to 1/16th. It is the perfect economical all-purpose flash for any digital or 35mm SLR shooter.Bounce, Zoom & Swivel HeadFlash has vertical bounce of 90 and horizontal swivel of 270, with automatic or manual zoom settings of 24mm, 28mm, 35mm, 50mm, and 85mmAF AssistAutofocus auxiliary lamp helps the camera to focus in low-light situationsRemote TriggeringBuilt-in optical slave function allows for off-camera operationLight ModifiersIncludes \"Self-Storing\" Diffuser and Reflective PanelsPower SavingAuto Sleep mode means less charging time, and more shooting timeSpecs:Type Shoe mountGuide No. 148' (45 m) at 85mm/ISO 100Angle of Coverage 75 to 28 (24-85mm lenses in 35mm/full frame format)Vari-Power 1/1, 1/2, 1/4, 1/8 & 1/16thTTL Dedication YesBounce Head YesSwivel Head YesZoom Head 24-85mm auto-zoom (flash senses focal length & adjusts or manual settings of 24mm, 28mm, 35mm, 50mm, 70, and 85mm)Off Camera Terminal NoRecycle Time 0.5-9.0 secondsPower Source Four \"AA\" batteriesDimensions 5 x 4 x 3\" (125 x 100 x 72mm)Weight 9.5 oz (270g)If you're tired of the uneven and often underpowered illumination produced by your camera's built-in flash, yet don't see the need to overspend for the flashes offered by your camera manufacturer, welcome to lighting solutions from Polaroid.", "title": "Polaroid PL-144AZ Studio Series Digital Power Zoom TTL Shoe Mount AF Flash With LCD Display For The Canon Digital EOS M, Rebel SL1 (100D), T5i (700D), T4i (650D), T3 (1100D), T3i (600D), T1i (500D), T2i (550D), XSI (450D), XS (1000D), XTI (400D), XT (350D), 1D C, 7D, 70D, 6D, 60D, 60Da, 50D, 40D, 30D, 20D, 10D, 5D, 1D X, 1D, 5D Mark 2, 5D Mark 3, G1 X, G16, G15, G12, G11, G10, G9, SX50 Digital SLR Cameras", "price": 104.99, "imUrl": "http://ecx.images-amazon.com/images/I/4170-o8SW3L._SY300_.jpg", "brand": "Polaroid", "related": {"also_bought": ["B0017U0WM8", "B003WD2SLQ", "B002ZIMEMW", "B0046653K6", "B00004WCID", "B002T1OJZU", "B005UFZ7F8", "B003Y60DZO", "B0053V5MF4", "B00007E7JU", "B0076H8VBK", "B003DLE0OU", "B00894YWD0", "B002VPE1WK", "B005IQRMN4", "B00894YP00", "B00009R6TA", "B002K3Z3E8", "B00393THEK", "B004L6I6SM"], "bought_together": ["B0017U0WM8", "B002ZIMEMW"], "buy_after_viewing": ["B00BXA7N6A", "B0079M711S", "B0017U0WM8", "B00B7ID99I"]}}