{"asin": "B0025VKUPW", "related": {"also_bought": ["B00BWF5U0M", "B00CXLCMGY", "B00BP5KOPA", "B001QUA6R0", "B00B332A9C", "B000R9AAJA", "B001MSS6CS", "B00E7LVBCE", "B003VANO7C", "B005B0A6ZS", "B00E3W1726", "B009SPWJ98", "B001HA6KOC", "B003NREDC8", "B005BZNDOO", "B001985SWW", "B008I646WG", "B0092ML0MY", "B00009KYCN", "B000J2EN4S", "B004SUO1QM", "B00DRK73IM", "B00F3ZN2W0", "B0098Y77U0", "B003VAGXZC", "B001QUA6RA", "B00C5H5DN0", "B005BZNDS0", "B00ESM3ISM", "B000ZH98LU", "B000067RWH", "B00C28L6XI", "B005H3Q59U", "B003LVZO8S", "B003M5BIII", "B009W8EWOG", "B00BB9P94Q", "B003M0NURK", "B00EZ9XKCM", "B000OTEZ5I", "B00D601UC8", "B003VAHYNC", "B00E3W15P0", "B00H09BOXQ", "B004FDRMZE", "B000EDRT70", "B0019804U8", "B007B5YUMQ", "B009WA4EBU", "B00EI94JWY", "B00134D3BA", "B00B3P1IGG", "B00CZIQXBA", "B002R9HQLI", "B001TH7GV4", "B00006IF8J", "B00DQFGJR4", "B00C13YSIO", "B003NR57BY", "B001TH7GUU", "B002DPUUL4", "B005LDLVAO", "B00E3W19MO", "B002OO18NS", "B00847UWUE", "B009UEBQIM", "B00G57BN1M", "B00870ZHCQ", "B005EJH6RW", "B009GDHYPQ", "B0088PUEPK"], "bought_together": ["B00BWF5U0M", "B00BP5KOPA"], "buy_after_viewing": ["B003CP0OT2", "B000R9AAJA", "B00CXLCMGY", "B00EZ9XKCM"]}, "title": "Altec Lansing BXR1220 2-Piece Desktop Speaker System", "price": 19.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31r2ZNx2UcL._SX300_.jpg", "brand": "Altec Lansing", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]], "description": "Enjoy your digital music and media to the fullest extent possible with the Altec Lansing BXR1220 Two-Piece Stereo Speaker System. Ideal for desktops and laptops alike, this compact speaker system delivers clear highs and lows while helping to keep your workspace free from clutter. The speakers connect easily to any computer -- just plug them into a USB port and you're ready to go. Thanks to Altec Lansing's Audio Alignment technology, the system's drivers, enclosure, and electronics are perfectly balanced, giving you the full, high-quality stereo sound your digital life demands.Audio Alignment technology ensures optimal sound.View larger.Volume control is conveniently located on the top of the speaker.View larger.One-Cord Connection for Added ConvenienceThe BXR1220 speakers draw power from your computer via its USB port, so you don't need to free up an outlet. The speakers are a perfect way to improve the sound quality of your laptop's speakers, with no extra power cord to pack when you want great sound on the go.Audio Alignment Technology for Superb Accuracy and AlignmentThe BXR1220 relies on Altec Lansing's proprietary Audio Alignment technology to make sure all of the speakers' components work together to deliver your music the way it is meant to be heard. Audio Alignment technology offers the perfect balance of the three elements of the speaker system -- the drivers, enclosure, and electronics -- to ensure a natural, uncolored, and rich sound from your speaker system. The system's two-inch, full-range drivers and separate satellite speakers provide stereo imaging for more realistic sound when you're gaming or watching movies and videos.Designed to Fit Any Computer SystemThe speakers' elegant black enclosures and cloth grills complement your computer and peripherals. The speakers' small size -- each speaker measures only 3.7 inches in height -- saves valuable room on your desk and makes it easy to carry them along with your laptop.The BXR1220 components are also shielded, so you can place them close to your monitor or phone without interference. Conveniently placed power and volume buttons put sound control within easy reach.About Audio AlignmentWhether it's the tiniest of ear buds or the most imposing of subwoofers, Altec Lansing has refined every detail of its speakers to provide you with the most accurate sound reproduction and quality. Audio Alignment ensures that your components work together to deliver your music the way it is meant to be heard, offering the perfect balance of your speaker system's drivers, enclosure, and electronics. For 70 years Altec Lansing has been refining this process, bringing your speakers to life with advanced technologies that make them sing.The BXR1220 speaker system is covered by a one-year limited warranty.What's in the BoxAltec Lansing BXR1220 stereo speakers, user's guide, and quick connect guide.The BXR1220 is simple to set up and eliminates the need for a power outlet."}