{"asin": "B001OTZ8DA", "description": "The Story of the Sennheiser HD800The story of the Sennheiser HD 800 began with a dream: of developing headphones that go way beyond conventional equipment to become music phones, or even perfect sound phones. The dream of creating a hi-fi device that sounds as brilliant, clear, and undistorted as if you were sitting right next to the source. The dream of creating an acoustic experience more incredible than anything ever heard through dynamic headphones: in spheres that no other category is capable of reaching--right there where perfection begins.We couldn&rsquo;t go beyond physical boundaries--but we did cross the boundaries of thought. The HD 800 is equipped with a completely new transducer and only the very finest of materials have been installed: each part carefully inserted by hand. We are talking about manufacture in the truest sense of the word, right from the initial drafts to individual handcrafting \"made in Germany\".Above all, the Sennheiser HD 800 truly personifies the creative force of the company that created it: by displaying the passion for perfect sound that has been driving Sennheiser innovation over 60 years.The Principle of Spatial ListeningThe impression of spatial listening is created by a minute time lapse with which one and the same sound wave arrives at the inner ear. Ideally, the sound waves produced by a hi-fi sound system reach the listener at an angle of 60 degrees. The sound waves do not reach the ear straight on, but through a slightly angled sound front. This causes some of the sound impulses to reach the nerve ends of the inner ear earlier than others. The resulting time lapse is a matter of split seconds, but it is exactly this phenomenon that gives the impression of spatial listening.Wearing the HD 800 you enjoy much more than just a sound experience of out-standing brilliance. You experience a form of spatial listening never heard before. You have the feeling of being in a studio together with Thelonius Monk or actually being present at a rehearsal of the Berlin Philharmonic. The HD 800 makes spatial listening possible through a combination of the large transducer surface and the angle at which it is suspended. The slightly angled sound front effectively simulates the principle of the spatial sound experience. No other manufacturer comes as close to producing a natural sound experience as Sennheiser with the HD 800.Outstanding Technology Provides Outstanding SoundThe lightweight ring transducer precisely delivers sound without harmonic distortionThe superiority of the HD 800 is based on a completely new principle, right at its very heart: The transducer is designed in the shape of a ring. Basically, the larger the surface of the transducer the purer the sound&mdash;particularly when it comes to the low notes. A large surface area, however, also generates disruptive spurious oscillation at higher frequencies, so-called eigenmodes. This is primarily due to the fact that conventional-sized transducers do not have a satisfactory way of controlling high-frequency oscillations. The ringed shape of the new transducer effectively solves this dilemma: Its broad area oscillates in an extremely controlled way due to the large coil and the two supporting surfaces. This results in a previously unheard-of degree of freedom from distortion and thus the greatest purity and brilliance of sound.And when it comes to the naked technical facts, the HD 800 doesn&rsquo;t save on superlatives: The 56-mm-wide transducer is the largest of its type. The same goes for the aluminum coil (40 mm) and the 42-mm magnet system.Ring Transducer vs. a Conventional TransducerIn contrast to a full-sized transducer, the ring-shaped transducer utilized in the HD 800 greatly enhances the control of the oscillating surface. This results in a more voluminous sound wave and thus far greater clarity.In a conventional transducer, unwanted spurious oscillation can occur due to eigenmodes. Even improvements such as increasingly sophisticated Duofol laminations are unable to completely negate these physical limitations.At the heart of the HD 800 is the patent-pending ring-shaped transducer. The wound precision wire that makes up the coil is only 42 micrometers thick. It consists of 3.5 layers of wire in a total of 98 windings. The space between the two magnets, in which the coil oscillates freely, is only 0.6 mm wide. The work of fitting these parts is done by hand&mdash;and the same thing applies to many of the other components of the HD 800. The transducer of the HD 800 transmits in a frequency band from 8 Hz&ndash;50 kHz. Not that anyone is capable of perceiving this sound range, but the pleasant ancillary effect is that the transducer delivers an extremely clean sound in the 16 Hz&ndash;20 kHz range.", "title": "Sennheiser HD 800 Over-Ear Circum-Aural Dynamic Headphone", "brand": "Sennheiser", "imUrl": "http://ecx.images-amazon.com/images/I/41mRUE8SOSL._SY300_.jpg", "related": {"also_bought": ["B008JGWY2Y", "B00BHBWWFW", "B00H8AEZCO", "B001DK1ZVO", "B0006DPNNK", "B00A34TU7W", "B0070U8KSM", "B00HAOSDOO", "B004LPZBD6", "B00AE0IEHM", "B00DIUGW6A", "B0031RD3YY", "B00018MSNI", "B00BHBWW48", "B00CICPTHC", "B00IFEC88U", "B008J26ZL4", "B00B6QXWIY", "B004T335BK", "B0070UFMOW", "B0024NK32Q", "B00JRGLX3G", "B00D648BDA", "B00IIJ6W4S", "B00GYCX2JO", "B00ICJWP6S", "B00I4Q9S32", "B005LTWXK0", "B007G8UMP2", "B004LCH5KG", "B00BE51FOA", "B00AFEMMLG", "B004357WL8", "B00E4WXWBE", "B0028PGXRE", "B00GCDVNHI", "B006KTDXYU", "B00E1UVXHO", "B00004SY4H", "B003USZS8I", "B004DW3YNQ", "B005VQGQE2", "B00EYYVVYW", "B009QV15DU", "B005EV38AE", "B00FBQ84F6", "B000068O6B", "B005N6ZAT2", "B005N8W27I", "B00JB6P7FW", "B0076NA716", "B00DV38SZM", "B00E65QM8O", "B003R6U6HG", "B00BCJWTAM", "B00IWVRGE2", "B00EPDMDZ8", "B00DJ4BIKA", "B00D77UA44", "B00415AHFS", "B00ENO322C", "B003UCC78I", "B00EE9B3LI", "B00AJHBES6", "B006YWRW36", "B00415A3XY", "B00AZZNXOK", "B00862522A", "B004QMH8KI", "B001J9BQP4", "B000PCF8WS", "B00002MXUH", "B005QM5MD2", "B00EY2QPV8", "B004C04P46", "B0042A8CW2", "B00BL8BX7O", "B000F20MW4", "B004QVNS0S", "B009WQA4PO", "B00BQ9PCZW", "B0093VVP0Q", "B00612ZZSS", "B002SKKQZO", "B00DKPXU9A", "B005CNR7B0", "B0002JFN10", "B00A8E1K9S", "B00D73JV6G", "B00AQ5PK6I", "B009X6G646", "B00AFKBIYW", "B00AHFWAQU", "B006IPH5H2"], "bought_together": ["B008JGWY2Y"], "buy_after_viewing": ["B0042A8CW2", "B00HVLUR86", "B004FEEY9A", "B000ULAP4U"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]]}