{"asin": "B0015HZLVA", "description": "This template creates an A+ review that contains an opening paragraph, followed by three columns that cotain a left column for logo and images, a center column for lists and features, and a right column for images that can be clicked through. The last part of the template is a paragraph for more text if necessary.Intro Paragraph (Need at least 250 characters here)A New Generation ofTalesUnfoldA power struggle begins in a civilization dependant on an ancient technology, the blastia, and the Empire that controls it. The fates of two friends traveling separate paths intertwine in an epic adventure that threatens the existence of all. Tales of Vesperia marks the firstTalesRPG release in high-def with detail and graphics never before seen in the series. Now, real-time battles are more exciting than ever with over limits, the ability to unleash fatal strikes, combinations and burst artes. The next evolution of the revered role-playing series comes to the Xbox 360.Left ColumnLogo Image (Assumes a logo of 200ppx)Center ColumnKey FeaturesA classic series returns: The newest installment of theTalesRPG series keeping the established gameplay formula that fans loveNext Gen sights and sounds: First Tales RPG game with high-definition graphics, broadcast quality animation, and Dolby surround soundEvolved real-time battle system: New refinements and additions to the trademark Tales real-time battle engine making for dynamic, action-packed RPG fightingFan favorite character designs: Characters designed by famous manga artist, Kosuke Fujishima, responsible for popular series&#x92; Ah! My Goddess, Sakura Taisen and You&#x92;re Under ArrestImmersive look and feel: Detailed environments, animation and an artistic style so good, it&#x92;s like playing a cartoonDramatic story: Gripping tale of a young hero on a quest for justice, trust and friendship filled with unexpected twists and turns at every stepA decade ofTales: The first game celebrating theTales10 year anniversaryRight ColumnImage 1Characters designed by famous manga artist, Kosuke FujishimaView larger imageImage 2A classic series returns.View larger image", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/51mBzT7XwPL._SY300_.jpg", "related": {"also_bought": ["B000PC4FYK", "B000QW9D14", "B000ZJVDA2", "B001LGFPSY", "B002I0K2J4", "B00149NCYW", "B007NU542O", "B0028A6V7Q", "B000G7X5MM", "B000AVBFU8", "B00D87TCN8", "B001CMJAP6", "B002I08WVY", "B00B67ZTUW", "B002I0J4AM", "B001CRQY1E", "0804163448", "B0015HZLVK", "B003O6EBRA", "B001YI0Z2U", "B00E8RVOFG", "B007UMD1EI", "B00319DX4W", "B0016C3260", "B000FLZEXM", "B003E6VK5Q", "B00KVRK39A", "B0010AYJXI", "B000R0SS3Y", "B002BRWUA8", "B000784XG2", "B006HPLJFC", "B001CMIUYS", "B007IFMFYE", "B003KT0ACG", "B002W5GI9I", "B00946FSJ4", "B004P6IVPQ", "B007CSF3GO", "B004NRN5DU", "B002BRYHY0", "B00ICWO1XA", "B005J5K9EI", "B004CD9X2C", "B004BV5O0U", "B000IONGU4", "B001C4C4KW", "B00B59MXDM", "B00BJH11D8", "B0058VI2LA", "B002I0JA7E", "B001TOMR6Q", "B00C3MKCF6", "B007A7UJ4S", "B00KWFY04A", "B000HCQK0A", "B00354NAYG", "B0001OK7VW", "B008XMSRKC", "B006GHA8EE", "B0042VX73U", "B004Q4EQ4M", "B00K5UZMGM", "B002C0VNVG", "B00B67ZS3U", "B003BE6OZC", "B000ICV996", "B00B2QL2Y4", "B005C2QSDY", "B00BAWXDJM", "B000C427NM", "B000ZK695U", "B002I0GXWO", "B00136MBHA", "B00BAWXD7E", "B004TMGZ9K", "B002I0EH6I", "B00AKIPBNS", "B002AU0HZQ", "B001HB7KAO", "B000OOOISM", "B0002GTFIK", "B00008KTRS", "B00BAWXCP2", "B00K2O4O5G", "B0044SA70M", "B004P7VGF2", "B002I0GKIQ", "B00356GVRW", "B000P8WOMO", "B0065NP6NC", "B0000A09EM", "B007UM59AC", "B000E0VMVM", "B002I0H79C", "B002BRZ8FW", "B00J6DLPLK", "B003VR5PPY", "B002E6XY6U"], "bought_together": ["B000PC4FYK", "B000QW9D14"], "buy_after_viewing": ["B00B67ZTUW", "B001LGFPSY", "B002I0K2J4", "B000PC4FYK"]}, "salesRank": {"Video Games": 1783}, "categories": [["Video Games", "Xbox 360", "Games"]]}