{"asin": "B004I43MJA", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "28mm Wide Angle*28mm Wide The 28mm wide-angle* on the HD 90 Series fits more people and more of the background into the frame than conventional models. This is especially handy when you want to take a group photo in a small room. It fits your subjects in even when you shoot from up close, and makes it possible to pick up even small sounds with the mic. It also gives you entirely new ways to enjoy your camcorder, like taking self portraits or capturing sweeping landscapes without losing the sense of scale.* 35mm camera equivalentIntelligent 40x Zoom and HYBRID O.I.S.40xPower O.I.S. HybridThe HD 90 Series features a an Intelligent Zoom function that goes all the way up to 40x. When using Intelligent Zoom, Intelligent Resolution technology lets you shoot at high zoom rates while preserving the image resolution. You get sharp images of highly detailed objects &ndash; without the blurry edges. Plus, the HD 90 Series is equipped with HYBRID O.I.S., an image stabilizer system that corrects hand-shake blurring by combining the action of its hybrid optical and electrical image stabilization systems. Even when zooming, where hand-shake often occurs, both optical and electrical hand-shake correction make it possible to record beautiful images with approximately 2 times* the hand-shake suppressing effect as conventional models.* Compared with the HDC-SD60, HDC-TM60, and HDC-HS60.O.I.S. (Optical Image Stabilizer) LockThe image-stabilizing effect is increased by pressing and holding the O.I.S. Lock indication on the LCD screen, which maximizes the blur detection sensitivity. This is great for when you want to zoom at a fixed angle, like for bird watching.* Considerable blurring is generated by the shifting of the corrective lens when the camera is panned or tilted.1080/60p Recording (Full-HD 1920 x 1080, 60 Progressive Recording)*Full HD With its transfer rate of 28 Mbps, 1080/60p recording (Full-HD, 1,920 x 1,080, 60 progressive recording)* conveys about twice the information of 1080i (interlace) recording. Whereas interlacing requires two images to produce a complete picture, the progressive method records a single image as a complete picture. Plus, the 60 Progressive Recording of the 900 Series and SD800 produce 60 images per second.** This extremely dense image information creates intricate detail and silky smooth motion. Even when subjects move quickly, afterimages are minimized to create more natural images. The progressive method is most effective when shooting designs where more patterns tend to occur, or when capturing scenes during sports events where the subjects are intensely moving around. Also, the recorded images displayed clearly even when they are made into still images, so it is possible to preserve stunning photos when clipping them from videos.Interlaced Scanning (1080/60i)***Only half of the image data is reproduced in each picture. Fabric patterns run together, and moir&eacute; patterns appears.Interlaced Scanning - Only half of the image data is reproduced in each picture.Interlaced Scanning (1080/60i)***Only half of the image data is reproduced in each picture. Fabric patterns run together, and moir&eacute; patterns appears.Progressive Scanning (1080/60p)*Reproduces all of image data in a single picture. Patterns in fabric are crisp and clear with no color bleeding.* 1080/50p (full-HD, 50 Progressive Recording) in PAL areas.**In NTSC areas. 50 images per second in PAL areas.*** 1080/50i for PAL area.Crystal Engine PROCrystal Engine Pro The Crystal Engine PRO instantly processes the huge amount of data that goes into Full-HD images, and further enhances Full-HD quality. It produces smooth, high-resolution zoom shots even when the range exceeds the limit for optical zooming. Crystal Engine PRO clearly delineates even the tiniest details of your subject, with extremely natural beauty. In addition, its Noise Reduction (NR) technology has been completely redesigned. The low-frequency noise that occurs when recording in dim lighting has been further minimized. Compared to previous Panasonic models, noise has been reduced by approximately 45%.* And Intelligent Resolution Technology ensures sharp and crisp pictures, resulting in bright and beautifully colored motion images.* Compared with the HDC-SD60, HDC-TM60, and HDC-HS60.Intelligent Resolution TechnologyIntelligent Resolution TechnologyThe Intelligent Resolution Technology incorporated in the new Crystal Engine PRO uses edge detection technology to confirm the edges of objects within the image, then emphasizes the edges for optimal clarity. For example, it brings crisp definition to patterns and the outlines of objects like flowers. Conversely, it reduces noise and enhances the natural smoothness of parts without edges, like the sky. The increased sharpness is especially effective for images with delicate details. This highly advanced technology maximizes the beauty of Full-HD images.", "title": "Panasonic HDC-TM90K 3D Compatible Camcorder with 16GB Internal Flash Memory (Black)", "price": 17.12, "salesRank": {"Camera &amp; Photo": 4842}, "imUrl": "http://ecx.images-amazon.com/images/I/41jPxHLOOrL._SY300_.jpg", "related": {"also_bought": ["B004OWWJX6", "B004M5WLLK", "B00724X77A", "B0039BPG1K", "B00512QEJS", "B003VNKNF0", "B006QYXVH8"], "buy_after_viewing": ["B003VNKNF0", "B007LK5S0E", "B00724X77A", "B004M5WLLK"]}}