{"asin": "B000BI2180", "related": {"also_bought": ["B000EHU98M", "B000IQALV4", "B0001W05IE", "B0054NSB8G", "B000IQ5J0C", "B000BI7NGU", "B000BI2162", "B000I1D2M4", "B0007VMROE"], "bought_together": ["B000EHU98M"], "buy_after_viewing": ["B0007VMROE", "B000BI7NHY", "B00005AWBJ", "B00004VWM3"]}, "title": "Palm Z22 Handheld", "price": 154.99, "salesRank": {"Electronics": 10737}, "imUrl": "http://ecx.images-amazon.com/images/I/41TFBQXPCDL._SY300_.jpg", "brand": "PALM", "categories": [["Electronics", "Computers & Accessories", "PDAs, Handhelds & Accessories", "PDAs & Handhelds"]], "description": "If you're still using a paper planner, maybe it's time to catch up with technology and upgrade to the affordable and easy-to-use Palm Z22 handheld. It enables you to keep your entire day-to-day schedule and contact information at hand and in your pocket--no more flipping through  multiple pages, looking for scraps of paper or keeping track of to-do lists. And you won't have to enter the same thing twice--once on the computer and once in your planner, as you can easily make updates on your computer and synchronize data to the Palm Z22 in just a minute or two.This handheld features a 32 MB of flash memory (20 MB accessible for file and software storage), Palm OS 5.4 (Garnet), a fast 200 MHz ARM-based processor, and an internal rechargeable battery (that can be charged via the included AC adapter or via the USB cable connected to your PC).Weighing just over 3 ounces and about the same size as a deck of playing cards, the Palm Z22 is compact and stylish with a white front and translucent blue backing. Small enough to fit into any purse, backpack or back pocket, it boasts a bright, 160 x 160-pixel color touchscreen display, which provides easy readability of names, addresses, and appointments. You can even color-code appointments for improved organization, and view and carry pictures of friends and family wherever you go.Operating System and SoftwareThe installed Palm OS 5.4 uses the intuitive and easy-to-learn Graffiti 2 writing software to input data into the handheld (as well as an on-screen keyboard). Windows users can synchronize their calendar, contacts, tasks, and notes with Microsoft Outlook. The Palm OS features the following organizer applications:Contacts: Lets you store several addresses for each contact, and with new fields for more phone numbers, multiple e-mail addresses, instant messenger IDs, and Web sites.Calendar: Use the new Agenda view to see upcoming calendar events, tasks due, and important e-mail, and color-code your events to provide an easy way to reference your calendar in the Agenda, Day, Week, and Month views. Take more notes, or synchronize more details from your desktop, in the larger Memos and Notes fields.Tasks: Use tasks with alarms and repeating tasks to set reminders for important commients.It also includes AddIt, a program that includes a variety of applications such as CheckSplit, Chess, Carb Counter and Solitaire. The bonus software CD-ROM has an eBook reader with three books and a dictionary, the powerOne Calculator (perfect for basic and advanced mathematics), and SplashShopper (a helpful shopping list application).CompatibilityThe Palm Z22 is compatible with PCs running Windows Windows 2000 (SP4) and XP (Outlook synchronization requires MS Outlook 2000, 2002, or 2003; sold separately), and with Macs running Mac OS 10.2.8 to 10.4.What's in the BoxPalm Z22 handheld, USB sync cable, power adapter, 3-step setup poster, Graffiti 2 sticker, Software Install CD-ROM with Palm Desktop, Tutorial, Getting Started Guide, User Guide, and bonus software."}