{"asin": "B0018P0S1M", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "Capture Life...See it, Shoot it, Share it--all in an instantCapture life&#x92;s entertaining moments on video and share them online with Vado, the slim, lightweight video camcorder that fits in your pocket. Simple to use, just point Vado and press record for great looking video. Sharing videos online is easy too.  Just connect Vado to your computer and built-in software helps you post directly to YouTube or PhotoBucket quickly and easily.Vado Pocket Video Cam HighlightsTake video everywhere you goFree yourself from the hassle of the 'bulky camcorder bag'.  Vado is thinner than a deck of cards and as light as a cell phone so it fits into your pocket or purse and never weighs you down.Get up to 2 hours of great video at the touch of a buttonYou'll never miss a moment with two hours of video capacity and one-button recording that makes capturing life on video effortless. With a 2X zoom and excellent low-light performance you'll get great video quality every time you press record.Super simple video sharingJust connect Vado&#x92;s flexible USB plug to your computer and the built-in software takes over.  Transfer your videos to your computer or post them directly to YouTube or Photobucket or any other video-sharing site, all at the click of a button.Shoot two hours of video to internal memoryCatch the perfect stunt, your baby's first steps or your kid's graduation. With up to two hours of video capacity, you never need tapes, CDs, or extra memory cards.Rechargeable for hours of funEnjoy 2 hours of recording and playback; simply recharge via USB instead of using endless piles of disposable AA batteries.  Need more time?  The rechargeable battery is removable so you can change it out for a fresh one.Large 2-inch antiglare screenView video onscreen or show them off to friends.  Keep the ones you like; delete the ones you don&#x92;t.Accessorize your VadoPick up a customized pouch, a spare battery or external battery charger and do even more with your Vado.", "title": "Creative Labs Vado Pocket Video Camcorder (Pink) OLD MODEL", "price": 59.99, "salesRank": {"Camera &amp; Photo": 12193}, "imUrl": "http://ecx.images-amazon.com/images/I/31IwQSQBlWL._SY300_.jpg", "related": {"also_viewed": ["B002NXGP6U", "B004FLL5AE", "B004GBTLWC", "B001QWKI8K", "B00BF9HZT4", "B009GLINO4", "B0037P5CAI", "B003WOLOLU", "B006KDQFLY", "B000FD8MJS", "B004AP9FSE", "B0055N604M", "B00CQ9T00E", "B001LK8P14", "B002JM1XWQ", "B000V1PXL4", "B000V1MLCI", "B0043D4V8M", "B0031RGKVC", "B003JJEFBY", "B004FLL5AO", "B0029631VI", "B0023B14UE", "B0023B14U4", "B001O94GNS", "B005KEF86M", "B005G81EAQ", "B004H1QCMI", "B000T9U4O4", "B004SNCWJW", "B0047UNI62", "B000P6J77G", "B003JIYNOO", "B006K551HQ", "B004EWGSVU", "B002P3F5D2", "B00GOPTVLE", "B0040702IE", "B0040702HA", "B003VTZE4Y", "B003P2V4OQ", "B006L6ZU84", "B00BB4UKOK"], "buy_after_viewing": ["B004EWGSVU", "B001I44YCC", "B002NXGP6U", "B006KDQFLY"]}}