{"asin": "B00009KO3S", "description": "Lights! Camera! Action! Welcome to the world ofViewtiful Joe!An innovative, super-hero, action game that mixes funky, cartoon-style visuals with classic, side-scrolling, game play and introduces the world's quirkiest, million-dollar, action hero&#133;Joe!Viewtiful Joe is a super hero with all the confidence, punch, and style of a million-dollar action-hero caught in the world of a Hollywood movie. It begins as Joe and his girlfriend, Sylvia, are at the movies watching his favorite superhero, Captain Blue. Somehow Sylvia is warped into the motion picture realm and it is up to Joe to fight the on-screen crime and rescue her. In the effort of saving his damsel in distress, Joe becomes more than just any ordinary dude. He gains new powers to perform special visual techniques that can be utilized to affect time and initiate a variety of devastating combos on foes. Joe's special powers can also be used to solve various inventive puzzles.Progress through various quasi 2D/3D cel-shaded environments, implementing Joe's visual effect abilities to bash enemies with beautiful style. It is up to you to activate the correct view mode, such as \"slow,\" a technique for instantaneously slowing down the action to inflict damage reminiscent of today's films, or \"mach speed\" to destroy enemies using a lighting-fast approach. The blend of a true comic book look and innovative stylized action setsViewtiful Joeapart.FeaturesInnovative platform game actionVividly comic and funky cartoon-style visualsCustomize visual effects by executing stylish and visionary moves while playing:Slow down: \"Slow Power\" inflicts detailed attacks and movesSpeed up: \"Mach Speed\" provides lighting speed fists of furyZoom: enhance the fighting experience by getting up close and person to the actionViewtiful Joeredefines action games by mixing innovative \"viewpoint\" fighting into an amazing stunt-filled, action-movie universe!", "price": 128.41, "imUrl": "http://ecx.images-amazon.com/images/I/61GJ5W67RQL._SY300_.jpg", "related": {"also_bought": ["B0002WYUB6", "B00006IJJK", "B00009PS24", "B00005Q8M4", "B0002A6CQ4", "B0002A6CPK", "B00008H2IS", "B00005QDPZ", "B000070IWB", "B0000657SP", "B0002CHIWO", "B0002ILS1U", "B000B69EAA", "B0002ILS1K", "B000066JRN", "B00005Q8LY", "B0000A09EN", "B00009M98D", "B00009ZVI2", "B00006599U", "B0019SY1D4", "B0009XEC0M", "B00019AZC8", "B00005QDQ1", "B00006FWTX", "B00006LU9B", "B00012D0SG", "B00009KO3Q", "B0002IQOPU", "B0001JSSLS", "B0009Z3I0K", "B00005Q8LR", "B0001OK7VW", "B00005Q8LV", "B000084318", "B0007D4MUE", "B0002ILS24", "9861019731", "B00005Q8M0", "B002EE7OKE", "B000B69EAK", "B000678MBG", "B00007KUUD", "B000X25GW2", "B0009UBR3A", "B00006LELI", "B000069BB0", "B000620PSY", "B00009WAUD", "B002BRZ9AG", "B00009WAUH", "B001HB7K6I", "B00005QEFD", "B000CC5J52", "B000ARPXU0", "B0001B167O", "B000A15K0Y", "B00019HNNC", "B0000A0834", "B00005QEFF", "B0002XCCU6", "B000A28ENI", "B000641ZC2", "B0000E5U6I", "B000B8J7JQ", "B00008G8IA", "B001TOMR0C", "B000095ZHA", "B00024W1U6", "B00005ULXN", "B000090W86", "B00008KTWH", "B0001JXAC0", "B000FQBPDU", "B00008VFBV", "B00007UHDI", "B002I08CSW", "B002EE5SAC", "B000IONGU4", "B00008KTRS", "B0009XBWY6", "B000L9NPGG", "B00006966U", "B000AOEU2K", "B0017KIBAI", "B0000A1OG4", "B00007KQC4", "B00009WAUB", "B00006LEMX", "B00006IJJI", "B00005R5PZ", "B000Z9A95M", "B00009YEKA", "B00009X3V2", "B004CHLNWQ", "B004L9YS22", "B000093NQI", "B0009PM8V0", "B000CC3IEQ"], "bought_together": ["B0002WYUB6", "B00008H2IS"], "buy_after_viewing": ["9861019731", "B002I08CSW", "B00008H2IS", "B000084318"]}, "salesRank": {"Video Games": 9134}, "categories": [["Video Games", "More Systems", "GameCube", "Games"]]}