{"asin": "B000FDOWQK", "description": "The Wireless-N Broadband Router is really three devices in one box. First, there's the Wireless Access Point, which lets you connect to the network without wires. There's also a built-in 4-port full-duplex 10/100 Switch to connect your wired-Ethernet devices together. Finally, the Router function ties it all together and lets your whole network share a high-speed cable or DSL Internet connection.The Access Point built into the Router uses the very latest wireless networking technology, Wireless-N (draft 802.11n). By overlaying the signals of multiple radios, Wireless-N's \"Multiple In, Multiple Out\" (MIMO) technology multiplies the effective data rate. Unlike ordinary wireless networking technologies that are confused by signal reflections, MIMO actually uses these reflections to increase the range and reduce \"dead spots\" in the wireless coverage area. The robust signal travels farther, maintaining wireless connections up to 4 times farther than standard Wireless-G.With Wireless-N, the farther away you are, the more speed advantage you get. It works great with standard Wireless-G and -B equipment, but when both ends of the wireless link are Wireless-N, the router can increase the throughput even more by using twice as much radio band, yielding speeds up to 12 times as fast as standard Wireless-G. But unlike other speed-enhanced technologies, Wireless-N can dynamically enable this double-speed mode for Wireless-N devices, while still connecting to other wireless devices at their respective fastest speeds. In congested areas, the \"good neighbor\" mode ensures that the Router checks for other wireless devices in the area before gobbling up the radio band.To help protect your data and privacy, the Router can encode all wireless transmissions with industrial-strength 256-bit encryption. It can serve as your network's DHCP Server, has a powerful SPI firewall to protect your PCs against intruders and most known Internet attacks, and supports VPN pass-through. Configuration is a snap with the web browser-based configuration utility.The incredible speed of Wireless-N makes it ideal for media-centric applications like streaming video, gaming, and Voice over IP telephony, and gives you plenty of headroom to run multiple media-intense data streams through the network at the same time, with no degradation in performance. With the Linksys Wireless-N Broadband Router at the center of your home or office network, you can share a high-speed Internet connection, files, printers, and multi-player games, and run media-intensive applications at faster than 10/100 wired network speeds, without the hassle of stringing wires!", "title": "Cisco-Linksys WRT300N Wireless-N Broadband Router", "price": 122.39, "imUrl": "http://ecx.images-amazon.com/images/I/41jjCiXj4%2BL._SY300_.jpg", "related": {"also_viewed": ["B000BTL0OA", "B000WG3ZU4", "B000MANHJE", "B0001D3K8A", "B000Z3XXR4", "B00K91DB7Y", "B001AZ01EO", "B003B48UQ8", "B00005ARK3", "B000U78XOS", "B00EXK14S0", "B00KEK4Q5Q", "B004T9RR6I", "B0068ALV8Q", "B0088CJT4U", "B007IL6OR2", "B002YLAUU8", "B000051SGX", "B008RV51EE", "B003Y5RYNY", "B007IL7AKM", "B0081TXJ28", "B007IL764W", "B00695LU5O", "B00DWFPDNO", "B008I21EA2", "B00007KDVI", "B001F7HLRC", "B0028N6VNW", "B0042X3F76", "B000Z3U1P6", "B00KF93N1Y", "B0088EKH08", "B004T9RR7C", "B0002V8KWM", "B001SEL326", "B006TZM6XO", "B004T9RR4A", "B003BEE6ZC", "B003Y2VWXK", "B007IL72CI", "B00BUSDVBQ", "B000LIFB7S", "B001FWYGJS", "B000QD7B6W", "B009RRZ36I", "B00HU7C7Q6", "B000H97UC0", "B004H8FSQM", "B00IGL3L2E", "B00007KDVJ", "B0098QV038", "B001UI4RTG", "B005HFJFHW", "B00JKQZ2LW", "B00DLYD31A"], "buy_after_viewing": ["B006QB1RPY", "B000BTL0OA", "B002YLAUU8", "B007IL7AKM"]}, "categories": [["Electronics", "Computers & Accessories", "Routers"]]}