{"asin": "B000IMYKQ0", "description": "The Wii Nunchuk controller is a secondary controller that adds even more innovation to the next generation of gaming, and does it all with less physical movement.Used in conjunction with the standard Wii remote, certain games need the Nunchuk controller for additional control options. Contoured perfectly to fit a player's hand,The Wii Nunchuk (left) connects directly to the Wii remote.View larger.the Nunchuk controller builds on the simplicity of the Wii Remote controller. The Nunchuk contains the same three-axis motion sensor found in the Wii Remote, but also includes an analog stick, and two buttons to help assist in character movement.Many games will allow you to control your character's movement with the Nunchuk in your left hand, while your right hand is free to execute the action movements with the Wii Remote. For example, the Nunchuk is particularly useful for games like Wii Boxing. You can use the Nunchuk to punch with your weaker hand, while you use the Wii remote to punch and jab with your predominant hand.Take the fun to the next level with two-handed control of your games.View larger.In first-person shooters, the Nunchuk controller carries the burden of movement, freeing you to aim and fire using a more natural motion with the Wii Remote. In a football game, you can make your quarterback elusive with the Nunchuk controller while you search for an open receiver to throw to using the Wii Remote. Serious gamers may even want to use two Nunchuk controllers to gain a fierce competitive edge.Because the Wii Remote and Nunchuk controllers are only relatively dependent on each other, players are free to hold them in whichever hand is most comfortable. Perfectly suitable for either right or left-hand use, the Wii Nunchuk controller grants accessibility not often seen in previous game controllers.Also, the Nunchuk controller doesn't need its own power--it plugs into the Wii Remote controller when it's in use. So there's no need to worry about charging or replacing expensive batteries.Adding a Nunchuk to your Wii system will definitely help you open the doors to the next level of gaming, and seriously step up performance. Just be careful not to knock out your significant other, or bruise the dog, severely, while using one, or two Nunchuk controllers.", "price": 20.29, "imUrl": "http://ecx.images-amazon.com/images/I/31JwRpKaLVL._SY300_.jpg", "related": {"also_bought": ["B000IMWK2G", "B0045FGET2", "B0094X227I", "B001TOQ8NO", "B0094X20IO", "B000FQ9QVI", "B000KRXAGE", "B0013B30SY", "B0094X28J0", "B002I08DQI", "B002BRZ9G0", "B0030BF1QE", "B0094X2066", "B0045FCKVI", "B004W1IX1G", "B0009VXBAQ", "B0045FEE3A", "B0094X221O", "B001GIUWX0", "B00FLYZIM0", "B0017Q4DGI", "B001PO2BJI", "B003ZHMMEM", "B006QYWXX6", "B00FLYZ7NU", "B000R3BNDI", "B002BSA388", "B003FT8GAO", "B002OL1KEI", "B005IGPY48", "B003O6DZSQ", "B000LSJKAM", "B0045FEENK", "B0049WQPOK", "B0013E9HP6", "B003X1R29K", "B005FYJA52", "B0056C2LIG", "B00D7UHT0E", "B002TLTBN0", "B007BKMGEU", "B006ZPAYB4", "B0094X1ZXU", "B002WZH9HS", "B00D6NPFDK", "B002BUUM00", "B001UAAX60", "B004Y2VAVS", "B000PWZKXK", "B001COQW14", "B000ZKBJYG", "B004VPRY04", "B002B7E3B2", "B004IK24MU", "B000LFJNF2", "B002I0GEXM", "B0053BG26C", "B00B5WDMIE", "B003WOFXEY", "B0037US4IA", "B00AXI9WEE", "B0013OL0BK", "B002D2Y3IS", "B002MGPAKU", "B0039XZGXG", "B000SFK0PW", "B0050SVFB0", "B00FEKUNHQ", "B0088MVPRY", "B0042VV5DY", "B00B0W5U66", "B001EAWM56", "B002BSC54I", "B009AFLXQQ", "B004UI3FPA", "B004N3FGHC", "B003LDKIQ4", "B003DSAT0C", "B004HHUNOU", "B004C34D2M", "B001U2BMH2", "B009AGXH64", "B007MM9E42", "B00A878J5I", "B003O6C0V4", "B0026IUSXI", "B002I0I85Y", "B009M72E5Q", "B007VIYQVI"], "bought_together": ["B000IMWK2G", "B002BRZ9G0"], "buy_after_viewing": ["B0094X2066", "B0094X1ZXU", "B0094X28J0", "B002GEKIOG"]}, "salesRank": {"Video Games": 3388}, "categories": [["Video Games", "Wii"]]}