{"asin": "B0000A2MCN", "description": "Star Wars Jedi Knight: Jedi Academyis a dynamic single and multiplayer action experience featuring an all-new epic story. Players are immersed in the role of apprentice at Luke Skywalker's Jedi Academy where they learn the power - and danger - of the Force. Amidst a multitude of complex and richly detailed Star Wars environments, including twice as many unique locales as those inStar Wars: Jedi Outcast, players face a variety of powerful and insidious enemies.For the first time in a Jedi Knight series game,Star Wars Jedi Knight: Jedi Academyallows players to create and customize their own characters by choosing various characteristics including species, gender, clothing, and physical attributes such as hair and facial features. In addition, players can create a custom lightsaber, selecting from hilt design and blade color. As apprentices progress in their training, different lightsabers will become available, such as the double-bladed lightsaber or dual lightsabers.Star Wars Jedi Knight: Jedi Academybegins shortly after the conclusion of events inStar Wars: Jedi Outcast. Players create a Jedi apprentice character and join the Jedi Academy on Yavin 4 to learn the ways of the Force under the tutelage of Luke Skywalker and Kyle Katarn. While the young apprentice embarks on various missions to hone their skills and abilities, a mysterious group is discovered creating havoc throughout the galaxy. Until order is restored, the fate of the Jedi Academy - and the future of the Star Wars galaxy itself - hangs precariously in the balance.While players are able to accomplish more by using the lightsaber inStar Wars Jedi Knight: Jedi Academy, they also will have a variety of weapons - new and old - at their disposal including a blaster, blaster rifle, Wookiee bowcaster, Imperial repeater, and a Destructive Electro-Magnetic Pulse gun. A unique level selection system allows players to choose their own path through the game as well as the missions they undertake to improve their Jedi skills. The game adds new multiplayer modes and bring back the most popular modes fromStar Wars: Jedi Outcast.", "price": 44.5, "imUrl": "http://ecx.images-amazon.com/images/I/51AJ2XJRC9L._SY300_.jpg", "related": {"also_bought": ["B00005LABK", "B00027CXEM", "B00006IR62", "B000AAL4HI", "B000VV9T7S", "B001CWXAP2", "B000SOYG8U", "B003O2182A", "B00784HHUM", "B000VVEMXY", "B000W2MX42", "B000HVTEX6", "B000A2KF3K", "B000063LK3", "B003EKEGIU", "B002LHSGSI", "B0002IWYGI", "B002ABZE8U", "B000056PJE", "B0001XM2HU", "B00006LEMQ", "0345511352", "B0000A1OG8", "B00029P9R8", "B000A76ZNO", "0345511395", "B0002BQN7Q", "B002BXKJA0", "B00013M0OK", "B0001XMA6I", "B000GG1OVW", "B004A7HVTC", "B00000IZ7Q", "B00000K50S", "B000R0URCE", "B0047THYWC", "B000E2D3LC", "B0030EU3TG", "0345511298", "B0018V3JYE", "B00EXPNFUA", "B000HKGD4A", "0761544402", "B0002B90SA", "B0065NP39E", "B000067DPM", "B000U520NK"], "bought_together": ["B00005LABK", "B00006IR62"], "buy_after_viewing": ["B000A2KF3K", "B00005LABK", "B0000A1OG8", "B004A7HVTC"]}, "salesRank": {"Video Games": 5186}, "categories": [["Video Games", "PC", "Games"]]}