{"asin": "B003O996G8", "description": "The Samsung microSDHC Card is Class 6 and rated for uninterrupted, Full HD video recording on Android-powered devices or other smartphones and tablets. The card is also ideal for taking photos on the go with fast speeds that will reduce your wait time between shots.Highest Full HD video recording performance available with class 6 ratingIdeal for Android, other smartphones and tabletsFaster app performance with transfer speeds up to 40MB/s (tested with SD 3.0 or USB 3.0 compatible readers)Ships in Certified Frustration-Free PackagingWater-proof, temperature proof, X-ray proof, shock proofFast Transfer Speeds for Enhanced App PerformanceSmartphone and tablet users will appreciate the card's exceptional app support. Fast transfer speeds improve a wide range of mobile activities, from 3-D gaming to photo editing. With transfer speeds of up to 40 MB/s, the card lets you quickly move files between your PC and smartphone or tablet.Store Videos, Photos, Songs, and MoreWith the Samsung microSDHC UHS-I Card, you can add more storage to your smartphone or tablet and enjoy all the videos, photos, games, and music you love.Designed for DurabilitySamsung designed its microSDHC memory cards to withstand harsh operating conditions. The cards are waterproof; tested to withstand up to 72 hours in salt or fresh water to a depth of one meter.Lifetime is defined as the lifetime of the product on the market. Outdated technology is not covered by lifetime warranty if the item is no longer available on the common market as a new product. Komputerbay is trademarked by Komputerbay LTD. All products branded as Komputerbay are to be sold solely by Komputerbay. Komputerbay does not authorize the use of its trademarked products to third party sellers.", "title": "Samsung MicroSDHC 32GB Class 6 Memory Card High Speed   Ultra 40MB/s Read 15MB/s write with Komputerbay SD adapter and Mobilemate USB Reader", "price": 20.5, "imUrl": "http://ecx.images-amazon.com/images/I/41BffpRufBL._SX300_.jpg", "related": {"also_bought": ["B00FONBG1A", "B00J2OVN74", "B00HMNFWYW", "B00GIDXM5I", "B00GIDXG86", "B00JIPRKO2", "B00F2GMUPU", "B00F2GMVLI", "B00F2GMWCG", "B00HFZZSK0", "B00JJ3L84G", "B00KZ0J452", "B00JWGC29U", "B00K0DDUK4", "B00GBN9PH4", "B00EL9487M", "B0016LE80K", "B00KMSMKRG", "B00LCWPELA", "B00519BEQO", "B004JISIE4", "B001PLIG68", "B009SK58IM", "B008HOBS98", "B00B5HSB44", "B00KB948B2", "B008GAMNBK", "B005SZ4X28", "B00CPW49US", "B00G6UC9MU", "B00E5XDZFU", "B00CY9PFRI", "B001QRSBW0", "B005TUQU0A", "B0053DDNW6", "B00K0NS0P4", "B00AU4F74K", "B004AHADOC", "B004VBA4R8", "B009QZH7BU", "B00E5FMDI8", "B007NLW3C2", "B00KSR396C", "B006QRHZJK", "B0002BGELQ", "B003YJ8TVQ", "B00I0MWPXU", "B000U0Z2L2", "B00JJ3SQRI", "B003RQBKLC", "B004G7D0EG", "B0009JB7GI", "B007BCIJP8", "B000NPUKYS", "B000BKJDKM", "B0046TJG1U", "B005H3Q5E0", "B000SMVQK8", "B005NLQAHS", "B00F474DVG", "B000AM8BLI", "B00K0NRZSW", "B008RBSXJO", "B00IVPU6L4", "B006TUXG5Q"], "bought_together": ["B00FONBG1A"], "buy_after_viewing": ["B00FONBG1A", "B009QZH7BU", "B00IVPU7DQ", "B004G7D0EG"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Memory Cards", "SD & SDHC Cards"]]}