{"asin": "B002MUAEX4", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Compact System Cameras"]], "description": "The LUMIX DMC-GF1 is the latest addition to the award-winning LUMIX G Series, which debuts as the world&rsquo;s smallest and lightest system digital camera with a built-in flash.  The LUMIX DMC-GF1 distinguishes itself from previous models with its elegant, compact design reminiscent of classic film cameras, yet builds on Panasonic&rsquo;s success with the revolutionary LUMIX G Series of digital interchangeable lens system cameras based on the Micro Four Thirds system standard. With its compact size, user-friendly design and ability to record High Definition (HD) video and take professional-quality photos, the LUMIX GF1 continues to redefine digital photography standards.With its lightweight body, the LUMIX GF1 provides experienced photographers with the ideal digital camera to carry with them at all times. Like its predecessors in the LUMIX G Series, the LUMIX GF1 eliminates the pentaprism found in traditional interchangeable lens cameras. Thus, this mirror-free structure allows Panasonic to dramatically reduce both size and weight.Though small in size, the LUMIX GF1 does not compromise in advanced features.  The LUMIX GF1 thoroughly optimizes the advantages of a system camera to ensure high performance, whether capturing photos or HD video.  The LUMIX DMC-GF1 can record 1280 x 720 High Definition video in AVCHD Lite, a format that enables longer recording times. With a dedicated video record button, capturing video is convenient and easy.  The LUMIX GF1 can also record HD Motion JPEG in 1280 x 720 and other video recording formats include: QVGA, VGA and WVGA.  The LUMIX GF1 has a unique Movie Program Mode that allows consumers to adjust the depth-of-field while shooting in HD video, so background and foreground can be blurred to give creative effects--something typically only possible with expensive professional camcorders.The LUMIX DMC-GF1 includes the new My Color mode, which includes seven preset effects--Expressive, Retro, Pure, Elegant, Monochrome, Dynamic Art, Silhouette and Custom--all which let users manually set the color, brightness and saturation levels.  With the Live View function, users can see how these settings will effect the photo before they shoot, making it easier to capture the exact mood or atmosphere desired.  For even more elaborate effects, users can choose from a total of nine Film modes, and set the contrast, sharpness and saturation levels for each. A custom function lets users store their favorite settings in memory. Furthermore, the exposure meter can be displayed in other shooting modes and the correlation between shutter speed and aperture is shown, with a color-coded warning that alerts users when the settings are not in the proper range.For those users not quite comfortable with extensive manual and creative controls, the LUMIX GF1 provides a user-friendly setting that can address a beginner&rsquo;s comfort level, while helping them evolve their photography skills.  For instance, Panasonic&rsquo;s new Scene mode, Peripheral Defocus, lets users take a photo where the foreground is in focus and background is blurred--or vice versa.  This popular effect can be intimidating for a beginner, but in the Peripheral Defocus mode, by simply selecting the objects to be blurred and focused using the camera&rsquo;s keypad, it is simple for photographers of any level.Panasonic Lumix GF1 HighlightsVersatile Functions and Superb ImagesThe GF1 adopts the Micro Four Thirds System standard, which was developed as an extended version of the Four Thirds System standard for digital camera systems. By using this standard and developing a camera body that eliminates the mirror box and optical viewfinder unit, LUMIX was able to achieve a dramatic reduction in both size and weight compared with conventional digital SLR cameras, to create a new-generation system camera that features Full-time Live View, high-speed, high-precision Contrast AF, HD movie recording, and more. The GF1 is small enough to take anywhere yet sophisticated enough to take you as far into photography and movies as you want to go.12.1-Megapixel Live MOS Sensor: Higher Image Quality, Lower Power ConsumptionThe 4/3-type 12.1-megapixel Live MOS sensor featured in the GF1 offers the best of both worlds--the superior image quality of a CCD sensor, and the lower power consumption of a CMOS sensor. This sensor is also advantageous for photo and movie recording with its high S/N, thanks to a new circuit structure that is unaffected by the noise generated in each of the circuits. It results in clear images even when taken at high ISO sensitivity.Extended HD Movie Recording with SLR QualityThe hybrid GF1 lets you take both high-quality photos and HD movies. You can shoot breathtaking HD (1280 x 720) movies in AVCHD Lite format (MPEG-4/H.264) backed by the high sound quality of Dolby Digital Creator. And you can record for a longer time without running out of memory because AVCHD Lite stores data more efficiently than Motion JPEG while maintaining stunning image clarity and detail. A dedicated \"movie record\" button on the top lets you instantly start recording movies while shooting photos, so you don't miss a second of the action.*\"AVCHD Lite\" and \"AVCHD Lite\" logos are trademarks of Panasonic Corporation and Sony Corporation. Dolby and the double-D symbol are trademarks of Dolby Laboratories.A Built-In Flash in a Stylish BodySome compact size cameras reduce weight by not including a built-in flash. With the GF1, the built-in flash is concealed inside the body and out of sight. A single touch pops the flash up for easy shooting anytime you want. You can also adjust the light intensity in the range of &Acirc;&plusmn;2 EV at 1/3 EV steps to match your subject.My Color Mode Puts You in Control of Your ColorsNaturally you want your photos to be unique. My Color mode on the GF1 lets you control each and every photo with eight unique preset modes in all, including a colorful Expressive mode, a soft and moody Pure mode, and a Custom mode that lets you adjust the color, brightness, and saturation just the way you want them. You can dramatically change the images of even familiar subjects to express your own creativity.The Soft Focus of Peripheral Defocus Mode Lets You Achieve Professional ResultsThe GF1 automatically adjusts the focus to match the AF area you positioned while gently defocusing the foreground and background to emphasize the subject. You don't have to change the aperture yourself to take photos with the highly attractive soft focus effect of an SLR camera.iA Mode Helps Prevent Shooting Mistakes in a Variety of SituationsSelect iA mode, and the GF1 automatically activates a host of advanced functions and technologies that make it easy to capture beautiful, clear shots.Face Recognition:This function recognizes the faces of subjects that have been registered in the camera and displays the names of up to three people. The GF1 then optimizes the focus and brightness of the registered faces. Turn Face Recognition item ON and register the person with a full-face portrait on the shooting menu in advance.AF Tracking:Once you've focused on a subject, AF Tracking keeps the subject in focus--even if it moves--until you press the shutter release.Intelligent Exposure:The camera can correct the brightness in parts of the image that are too dark due to insufficient lighting, backlighting or use of the flash.Intelligent Scene Selector:The camera automatically selects whichever of five Scene modes--Portrait, Night Portrait, Scenery, Night Scenery, and Macro--best suits the situation.Face Detection AF/AE:The camera detects when there are faces in the frame and adjusts the focus and exposure to capture them properly. This allows you to shoot beautiful portraits without any hassle.Intelligent ISO Control:If the subject moves as you snap the shot, the camera automatically adjusts the ISO sensitivity and shutter speed to help prevent subject blur.MEGA O.I.S. (Optical Image Stabilizer):Gyrosensors built into the lens detect hand-shake and an O.I.S. shifts to compensate. Assisting you in getting those clear, beautiful, blur-free photos.*Some functions in iA mode will not be available depending on the lens that is mounted.Produce Original HD MoviesUnlike most other cameras, the GF1 allows the use of My Color mode and Scene mode to record HD movies. And Motion Picture P mode lets you change the aperture for more creative HD movie recording.iA Mode: Beautiful HD Movies with Point-and-Shoot EaseSelect iA mode, and the GF1 automatically activates a host of advanced functions and technologies that make it easy to capture beautiful HD movies.Full-time Live View: See How the Image Will Turn Out Before You ShootThe GF1's Full-time Live View lets you see in the LCD how adjusting the exposure, white balance, aperture and even the shutter speed will affect the shot. This makes it easier to capture a special shot or particular kind of image without shooting again and again.Let the Exposure Meter Guide YouThe on-screen meter display indicates the degree of aperture and shutter speed that can be changed within a suitable exposure range. The range in which appropriate exposure is not possible is shown in red, so you can intuitively grasp the corresponding aperture and shutter speed combinations.Take Advantage of Leica and Four Thirds LensesMore than 20 available Leica M/R lenses or 30 Four Thirds lenses can be used with the Micro Four Thirds System standard GF1, simply by mounting a separately purchased lens adaptor.An Optional Live View Finder Mounts to the Hot ShoeYou can equip the GF1 with an optional 202,000-dot equivalent Live View Finder (LVF) featuring a magnification of approximately 1.04x (0.52x*) and 100% field of view. Because it displays the same information as the LCD, it is effectively used in situations where the LCD is difficult to see, such as under bright sunlight. The LVF is also handy for low-angle shots because it can be tilted vertically from 0 to 90 degrees.*35 mm camera equivalentThe High-Speed, High-Performance Venus Engine HDThe Venus Engine HD incorporates two CPUs. This not only boosts image processing speed, it also helps achieve an exceptional noise-reduction performance. Also, the two CPUs of the Venus Engine HD allow long-time movie recording in AVCHD Lite format while maintaining low power consumption. And the Venus Engine HD features HDMI output too.Dust Reduction System Protects the Image SensorIf dust or other foreign matter gets inside the camera when you're changing lenses, it could cling to the image sensor and show up as a spot in photos. The GF1 helps eliminate this possibility by placing a Supersonic Wave Filter in front of the Live MOS sensor. Vibrating around 50,000 times per second, the filter repels dust and other particles. This keeps the image sensor clean at all times and eliminates the need for cumbersome maintenance procedures.HD Photos and HD Movies with VIERA Link NetworkingThe GF1 is equipped with an HDMI output terminal for direct transmission of digital image and sound signals. Just connect the camera to an HDTV using a single HDMI mini cable (optional). It's also easy to enjoy slideshows in which both photos and movies are played according to the recorded timeline. If you have a VIERA TV, you can control the camera's playback functions with VIERA's remote control unit.Easy HD Image Viewing with the SD Card SlotSimply take the SDHC/SD Memory Card from the GF1 and slip it into the card slot of a Panasonic VIERA or Blu-ray Disc player, and you're ready to view HD images. For even greater impact and entertainment fun, you can add background music and image effects to your image slideshows.*To play movies recorded in the Motion JPEG format, you need the included AV cable.PHOTOfunSTUDIO 4.0 HD Edition Makes Photo and Movie Editing EasyAVCHD Lite movies can be transferred to a PC from an SDHC/SD Memory Card or via the USB cable to view or edit them. You can also make a DVD disc from AVCHD Lite files by converting them to MPEG-2. The software makes it easy and fun to edit or organize a collection of photos. It features a Face Recognition function that recognizes the faces in the photos stored in your PC and lets you sort them by face. Also, photos shot with My Color mode can be categorized and viewed by style. The sophisticated interface allows you to enjoy emotion-packed slideshows with a variety of effects and music. And motion images can be directly uploaded to YouTubeSILKYPIX Developer Studio 3.0 SE Adjusts RAW Images Any Way You Want ThemThe GF1 records original image data in RAW file format, which allows images to be developed according to your intention. A number of highly advanced functions can be applied to these RAW images by using the SILKYPIX Developer Studio 3.0 SE software utility, with its unique combination of high resolution and extraordinary color separation.", "title": "Panasonic Lumix DMC-GF1 12.1MP Micro Four-Thirds Interchangeable Lens Digital Camera with LUMIX G 20mm f/1.7 Aspherical Lens", "price": 17.12, "salesRank": {"Camera &amp; Photo": 6720}, "imUrl": "http://ecx.images-amazon.com/images/I/41Q2%2BaMAEQL._SX300_.jpg", "related": {"also_viewed": ["B0031P2HDE", "B002IKLJUK", "B00604YTFM", "B002UXRG8Y", "B004A8ZQIO", "B002IKLJVE", "B004J2LMJ8", "B0054YVA8S", "B004A8ZQJS", "B002CGSYL2", "B0056ENTVC", "B00C97ZZ4S", "B00604YSNK", "B002IKLJUU", "B00FY42JYW", "B00604YTH0", "B001JTQBT0", "B00604YTGG", "B0054YVA5Q", "B00E87OITK", "B00DJS830Y", "B005058BTW", "B0043VE29C", "B003E6RX16", "B00604YSQC", "B007R7HUAM", "B00604YTD4", "B00554Z9G6", "B00F4PQGDG", "B003UES9W4", "B00E87OK84", "B00I3KP33S", "B00I3I0JCK", "B0035LBRJO", "B00IA2E6N2", "B00DJS8322", "B00FYO8U9K", "B007R7DTRK", "B00F4MU0KO", "B00328HR76", "B0058SDGJG", "B008MB719C", "B004A8ZQIY", "B00I2YLIJI", "B002IKLJV4", "B00I3KOW8K", "B00I3KP15I", "B001ISKNKU", "B0058SDG5A", "B0054YV91Q", "B0058SDGW8", "B003WJR69E", "B0054YV934", "B0096WDMGC", "B0043VE28I", "B001CCLBSA", "B00EYTM3FS", "B005J5TZVG", "B0055N2L22"], "buy_after_viewing": ["B003VNKNF0", "B00B7ID99I", "B00DJS830Y", "B00DJS830Y", "B00BF9MUBM"]}}