{"asin": "B000T8CWFE", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Mice"]], "description": "The Logitech MX Air optical mouse tracks motion even after you lift it off the surface, making it great for home theater PC users and presentations. In the air, it works like a cross between a remote control and a wand as you simultaneously wave the mouse in all directions and press its buttons to navigate.It sounds wieldy to use, but I was able to get the hang of it within a few minutes. Holding the mouse in my palm like a remote control, the cursor ably followed my hand movement but it got a little tricky trying to hone in on smaller icons and button selections. Another issue was I'd often catch myself in an awkward hand position while still needing the cursor to go in a certain direction. But with the freeze button, I could hold the cursor steady and recenter my hand into a more comfortable position.For desktop use, optical sensitivity was comparable to other mice and picked up subtle movements, however the mouse did not have any side buttons that I am used to for back and forward browsing. The extra buttons (back, volume, play/pause) are placed in the middle of the mouse, which are easily accessible when you hold the mouse in the air, but not so much for desktop use because your palm sits directly over them. The SetPoint software can customize the buttons into functions that you may ordinarily use, such as copy and undo. I was also able to fine tune the cursor and scroll speed for even greater control.The mouse definitely stands out on your desktop, its sleek black design might fool you into thinking it's something else, but upon touch the buttons light up to display each function. The shiny plastic casing doesn't feel cheap, but the smoothed look seems prone to scratches. The mouse also tracked up dirt pretty easily within a few days of use, however a cleaning cloth is provided. The smooth design is conspicuously missing a scroll wheel. That's because that section of the mouse is a touch panel sensor where you directly slide your finger up and down. It's a surprisingly comfortable and natural feel, and you start to wonder how you ever got by with wheels.The rechargeable lithium ion battery typically provided about 20 hours of use. After placing the mouse onto the base charger, it took about two hours to reach a full charge. I was able to get a workable range of about 30 feet from the receiver before the signal went out. Overall, it's a nifty mouse that shows its stuff in the air, a convenient device for home theater PC's and couch browsing as well as a more versatile tool than a laser pointer in presentations.--Bradley TranPros:Excellent range of up to about 30 feetGood battery life with fast rechargingStylish, black look with display lightsUnique wheel-less scroll designCons:Slight learning curve, requires a good deal of customizationButton placement and selectionOften needed to recenter hand position while in the airNot as accurate tracking movement in air than while on desktop", "title": "Logitech MX Air Rechargeable Cordless Air Mouse", "price": 340.0, "imUrl": "http://ecx.images-amazon.com/images/I/41ytFXXnMoL._SY300_.jpg", "brand": "Logitech", "related": {"also_viewed": ["B001KEGULI", "B007G6HIDI", "B002O0L0GC", "B00CTF8WPE", "B00EQ3XW84", "B005F38WXO", "B00FWLWKLY", "B00K768DHY", "B00E1YBTVU", "B001LDKO60", "B006OW1J1M", "B009FD5CKG", "B00C85BAOA", "B001LDKO74", "B0092KDSQW", "B00BQU9NVK", "B00BJE3V52", "B004SZU0T4", "B00DU7I75K", "B00DHEUBPA", "B000J43HJ8", "B0036VO67I", "B004RF52DO", "B0092IOJF8", "B0098QVVGY", "B0000CEPDF", "B00DIXSPA8", "B00DI4GMVG", "B007F9IP9C", "B00471LVW4", "B000AY5Y5W", "B0011FOOI2", "B0011FCV8W", "B00CR92NY8", "B00AIHYHJA", "B000HCT12O", "B00ESYSBQ4", "B002HWRJBM", "B00K0C4KOA", "B0069CQ7BE", "B00902EGQ8", "B00GNTKC9Q", "B00KVW1TGG", "B002GHBUTK", "B003ZWQXUQ", "B004MKNNGW", "B00H8T6YGK", "B00DR8LA6U", "B0056Y8CRS", "B00KT0S5IA", "B0093HLUTQ", "B009CQTOPK", "B008JGU3YA", "B00276D13I", "B002VR6A9K", "B001B8WA94", "B008JBSMQG", "B0009V5ZS2"], "bought_together": ["B000J43HJ8"], "buy_after_viewing": ["B002HWRJBM", "B001KEGULI", "B007G6HIDI", "B005DKZTMG"]}}