{"asin": "B007G51VEQ", "description": "The ASUS P8Z77-V DELUXE motherboard features the Intel Z77 chipset supporting the Intel LGA1155 3rd/2nd Generation Intel Core i7 Processors. ASUS offers this top-tier platform-leading solution with the exclusive Dual Intelligent Processors 3 technology integrated featuring new SMART DIGI+ Power Control - capable of achieving most precise adjustment, enhanced performance and stability, and O.C. capacity for CPU & RAM. With SMART DIGI+ , users can adjust their system to be highly efficient, providing consistent power delivery to reach higher performance on the Z77 platform than any other vendors out there! EPU conserves energy by intelligently moderating power and load requirements in real-time while TPU provides intelligent system scaling for incredible increases in platform performance while retaining stability. Fan Xpert 2 intelligently provides optimized settings for each fan on your PC and controls fan rotation speeds. Intel 3rd generation Core processors supports PCIe 3.0 for AMD CrossFireX and NVIDIA SLI support. The ASUS P8Z77-V DELUXE provides scalable graphics performance for the gaming and computer enthusiast or the graphical designer wanting to harness additional GPU Compute power in leading media applications. ASUS SSD Caching offers similar functionality as Intel SRT with additional features. There is no SSD capacity limitation, and it is easy as one-click away instead of going through tedious steps to enable this feature! The Z77 Series motherboards features the latest Lucid Virtu MVP software with HyperFormance technology, optimizing graphics performance by providing outstanding gaming responsiveness, sharper visual quality and improved frame rates all with low power consumption. This latest hybrid graphics boost technology fully utilizes fast-computing iGPU and discrete graphics cards in your system to create up to a 60% discrete graphics boost performance!", "title": "ASUS P8Z77-V DELUXE LGA 1155 Intel Z77 HDMI SATA 6Gb/s USB 3.0 ATX Intel Motherboard", "price": 7.92, "imUrl": "http://ecx.images-amazon.com/images/I/51Mzy0jkbjL._SY300_.jpg", "related": {"also_bought": ["B007SZ0EOW", "B004RFBIUU", "B003PJ6QW4", "B006EWUO22", "B0051U7HMS", "B007SZ0E1K", "B0068ZWZY0", "B003S68Q0Y", "B0036Q7MV0", "B007SZ0EHE", "B0083Y6MV6", "B002VKVZ1A", "B007RARHSO", "B006L6ZSWC", "B005O65JXI", "B007KC1R3A", "B000OGX5AM", "B0058J1QYC", "B004CSIG1G", "B005X64OA8", "B003PJ6QVU", "B004UE1W9K", "B004W2JL2A", "B004SUO068", "B004ZMG55I", "B0033Z2BAQ", "B0094NXBZ0", "B00608FKN8", "B007R1FH3K", "B004E0ZKLQ", "B0080I06WQ", "B005E98FVS", "B009ZN2NH6", "B005T3GRLY", "B004MYFODI", "B007YWMCA8", "B004MYFODS", "B00H09BOXQ", "B004O0PAKW", "B0051U1XMI", "B009NB8WRU", "B007ILBJAY", "B004W2JKZI", "B004LB5AZY", "B003ZM7YTA", "B0083YF55U", "B0026FCI2U", "B002FRLEIS", "B0077CR66A", "B006507Q88", "B006VCP9G6", "B005T3GQ0G", "B005T3GRN2", "B005NGGKPU", "B0090I9VZI", "B0040JHMIU", "B004Q0PT3I", "B007KRX3GY", "B004FA8NOQ", "B001KUV2KQ", "B005X3E5BO", "B00004Z5D1", "B001IZ7MHU", "B007PODI1W", "B007Z3HZIA", "B0026ZPFCK", "B005E98EI2", "B001EPUQAE", "B001OV789U", "B008SBX6GI", "B008O0ZKLM", "B007X8TQYI", "B007Z1CVIQ", "B009NHAEXE", "B007TG8QRW", "B002YIG9AQ", "B005E983JW", "B003WOL4VK", "B004DUMQVY", "B002LE8BJA", "B002DHGMK0", "B008O2HOI2", "B0094NY3R0", "B004EBUXHQ"], "buy_after_viewing": ["B007G51UV0", "B000OGX5AM", "B007G51UWY", "B0033Z2BAQ"]}, "categories": [["Electronics", "Computers & Accessories", "Computer Components", "Motherboards"]]}