{"asin": "B0028IBTLG", "description": "Experience all the sights and sounds of fabulous New Vegas, brought to you by Vault-Tec, America's First Choice in Post Nuclear Simulation. Explore the treacherous wastes of the Great Southwest from the safety and comfort of your very own vault: Meet new people, confront terrifying creatures, and arm yourself with the latest high-tech weaponry as you make a name for yourself on a thrilling new journey across the Mojave wasteland.PUBLISHER: Bethesda SoftworksDEVELOPER: Obsidian EntertainmentANTICIPATED RELEASE DATE: 10/19/2010PLATFORMS: Xbox 360&trade; / PLAYSTATION&reg;3 /Games for WindowsGENRE: Post Nuclear Role-PlayingDescription:Welcome to Vegas. New Vegas.It&rsquo;s the kind of town where you dig your own grave prior to being shot in the head and left for dead&hellip;and that&rsquo;s before things really get ugly. It&rsquo;s a town of dreamers and desperados being torn apart by warring factions vying for complete control of this desert oasis. It&rsquo;s a place where the right kind of person with the right kind of weaponry can really make a name for themselves, and make more than an enemy or two along the way.As you battle your way across the heat-blasted Mojave Wasteland, the colossal Hoover Dam, and the neon drenched Vegas Strip, you&rsquo;ll be introduced to a colorful cast of characters, power-hungry factions, special weapons, mutated creatures and much more. Choose sides in the upcoming war or declare &ldquo;winner takes all&rdquo; and crown yourself the King of New Vegas in this follow-up to the 2008 videogame of the year,Fallout 3.Enjoy your stay.KEY FEATURES:Feel the Heat in New Vegas!Not even nuclear fallout could slow the hustle of Sin City. Explore the vast expanses of the desert wastelands &ndash; from small desert towns to the New Vegas strip &ndash; and see the Great Southwest as could only be imagined in Fallout.Feuding Factions, Colorful Characters and a Host of Hostiles! A war is brewing between rival factions that will change the lives of everyone in New Vegas. The choices you make will bring you into contact with friends and foes, and determine the final explosive outcome of this epic power struggle.New Systems!Enjoy new additions such as a Companion Wheel that streamlines communication with companions, a Reputation System that tracks your actions, and the aptlytitled Hardcore Mode. Plus, special melee moves and real-time combat mechanics give you new ways to fight.An Arsenal of Shiny New Guns!With double the amount of weapons found in Fallout 3, you&rsquo;ll have more than enough exciting, new ways to deal with the threats of the wasteland. In addition, a new weapons configuration system that lets you tinker with your toys and see the modifications in real time.Let it Ride!In a huge, open world with unlimited options you can see the sights, choose sides, or go it alone. Peacemaker or Hard Case, House Rules or the Wild Card &ndash; it&rsquo;s all in how you play the game.images and screenshots &copy; 2010 Bethesda Softworks LLC. All Rights Reserved.About Bethesda SoftworksBethesda Softworks, part of the ZeniMax Media Inc. family of companies, is a premier developer and worldwide publisher of interactive entertainment software. Titles from two of the world&rsquo;s top development studios &ndash; Bethesda Game Studios and id Software &ndash; are featured under the Bethesda Softworks label and include such blockbuster franchises as DOOM&reg;, QUAKE&reg;, The Elder Scrolls&reg;, Fallout&reg;, Wolfenstein&trade; and RAGE&trade;. For more information on Bethesda Softworks&rsquo; products, visit www.bethsoft.com.About Obsidian EntertainmentObsidian Entertainment is an entertainment software development company passionately dedicated to making high quality, next generation games for Windows PC and console systems. Obsidian was founded in 2003 by five game development veterans who've produced, programmed, and/or designed award-winning role playing games for a variety of platforms over the last 15 years. The five founders are: Feargus Urquhart, Chris Parker, Darren Monahan, Chris Avellone and Chris Jones. Many of Obsidian's talented employees have worked on award winning products for organizations such as Black Isle Studios, Blizzard Entertainment, Electronic Arts, Neversoft, and others. Obsidian Entertainment's Web site is located at www.obsidian.net.ZeniMax, Bethesda Softworks and related logos are registered trademarks or trademarks of ZeniMax Media Inc. in the U.S. and/or other countries. RAGE, ID, id Software, ID TECH, and related logos are registered trademarks or trademarks of id Software LLC in the U.S. and/or other countries. All Rights Reserved.All other trademarks or trade names are the property of their respective owners. All rights reserved.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/511mxnaNXBL._SY300_.jpg", "related": {"also_bought": ["B000UU7VUC", "B0017Y0332", "B002BXKJ6O", "B00354NANC", "B004HYK8Y8", "B000WMEEBM", "B000GKCI4A", "B001NIP3EG", "B002I0J5YW", "B0050SX9VO", "B004PAGJNS", "B003H0CBYS", "B004FYJFNA", "B003Q55YCU", "B005C2D1YI", "B0050SXX88", "B002I0K5NC", "B001SGZL2W", "B002I0K6DG", "B003O6E67A", "B003JVCA9Q", "B000FQBF1M", "B0065NP05G", "B002I0F5M8", "B000ZK7ZOE", "B00503E9FY", "B001B1W3GG", "B000TVT7U4", "B000FQ2D5E", "B001AWBYNE", "B002I0J5UQ", "B001E8VB6O", "B00269QLH4", "B004NRN5EO", "B000JLIXIG", "B003L8DXOI", "B004QEWVLC", "0307469948", "B001RTCOWA", "B004FUI84G", "B003O6E6NE", "B0085CA8QG", "B004ML44Y6", "B0014UGK8G", "B007CM0K86", "B004EQCCI4", "B002DC8GKO", "B0012NAPNQ", "B000HKP88C", "B00886WO7A", "B003P9FRGA", "B0047TLIBU", "B001NX6GBK", "B00269DX5W", "B0012N3T3Y", "B000HGOHWO", "B00198PO5I", "B001JKTC9A", "B005VBVQDI", "B0050SXGU8", "B003GT8IL0", "B005EZ5GW8", "B0050SXFKE", "B0016PZYLS", "B009DPH880", "B000X1TC0U", "B00309XHD0", "B0012N94WO", "B0016GC9D8", "B005YR308S", "B000UW21A0", "B004918C4M", "B000ZK9QCS", "B001CRM3YQ", "B002I0GX88", "B008E6ZXTA", "B002I0J82G", "B000FQ2DTA", "B0076ZQSFI", "B002BRZ6UE", "B001D7T2VC", "B002NN7AKU", "B0030GBU2I", "B0022TNO7I", "B0056WJA6M", "B000IONGWW", "B001IK5TJI", "B003IEBO9Q", "B004UDB9SA", "B00BGA9V2Q", "B003S2MXQG", "B0021TVYCG", "B008XMSR6G", "B000RHZ9G6", "B0023CBZ70", "B002BSA1C6", "B004EW948E", "B0050SWUTQ", "B0050SXKU4", "B0050SXLQC"], "bought_together": ["B000UU7VUC", "B004HYK8Y8"], "buy_after_viewing": ["B0065NP05G", "B002BXKJ6O", "B000UU7VUC", "B004HYK8Y8"]}, "salesRank": {"Video Games": 3305}, "categories": [["Video Games", "PlayStation 3", "Games"]]}