{"asin": "B002PB2HBW", "related": {"also_bought": ["B002HU086C", "B0009PUQ8M", "B000EH0NLK", "B001LF3FR8", "B0053QUAAG", "B000HBIL9O", "B007ZV6TSE", "B0068REHQC", "B00LM57S3E", "B000HBGSMQ", "B00BB9P94Q", "B00KDWOGI2", "B003R7PUL2", "B00H3BMUKC", "B007Z0H61O", "B00CGQE8UE", "B007HI23PI", "B00CGQE7GE", "B007ZV6SAI", "B00ENDROMW", "B00D6LGN2E", "B00363WZY2", "B00BB9PDGK", "B000HBGSP8", "B000B5MIX6", "B0009PUR4A", "B00363X1IG", "B006JH1NB8", "B002PWFSHG", "B00E0BUFDM", "B000P9F0BA", "B003WZ5C9Y", "B003R7PU1C", "B00GVK738U", "B004Q4K04M", "B00GVKVN0O", "B00GVJDI8A", "B004TKB1Q4", "B0009PUQUA", "B000M7RRU2", "B00C37G8UY", "B0010O748Q", "B00AE31RJQ", "B00DNVPQ3E", "B002IAMCZQ", "B00CHHQAMG", "B00005OU9D", "B00BB9PAQI", "B007JTLKCC", "B00JJL5J3E", "B0018S4XIS", "B00339R0F8", "B0052X7XV4", "B0039PV1QK", "B00CN0FNUC", "B002XF8106", "B007ZV6RQ8", "B004D8MZ6C", "B009UC76VA", "B002BW7QCU", "B0009PUQ6O", "B0013KTADE", "B00F4E7N1G", "B006J3EEHM", "B00LVDZDXY", "B00G4TZG82", "B000LC84PK", "B00COE8PIO", "B00005BAIB", "B000P9IR8I", "B00CGQED9A", "B00363RUII", "B0086FDCTW", "B0000B15HP", "B008G3Z8U0", "B003CSZ62E", "B004EBJLXS", "B00DVA5MXQ", "B0017GZ93O", "B00AYE5EV2", "B002PLWE2E", "B001LRPSUS", "B000HJ7CLY", "B00FHRADQ2", "B001ANYRGE", "B006IYD55Y", "B002K66484", "B00HX2AP9O", "B000VNITQS", "B009M664P8", "B006QF3TW4", "B001DC5HG6", "B00IHX26X6", "B0002YTO7E", "B00363X1M2", "B006E0QAFY", "B0009QFS5W", "B005NGMJLY", "B0047EGT50"], "also_viewed": ["B002PAT60S", "B00C37G8UY", "B00D6LGYBO", "B003R7PTXG", "B00E0BUFDM", "B003R7PU1C", "B003CRVHMS", "B00J53X6K4", "B007G4LD54", "B002PB0DVS", "B00CLYEM9S", "B003R7PTRW", "B005FLN222", "B002LSXFL0", "B00C37G7A0", "B00495I5PY", "B00A8E2GYQ", "B00C37PGK2", "B001TSABLA", "B00BTT0RAO", "B00BAIAMHW", "B00D4157Z0", "B003YG17KY", "B00AML6TE8", "B003IUTHFI", "B000AO3J9A", "B00A8E3O88", "B004LZEXXK", "B004FGPP2I", "B008QWIYIE", "B003V3SFNC", "B00JUJL0LU", "B002PHW6I0", "B007OJW7QU", "B0009PVTLU", "B00J53X2C6", "B0050P22VK", "B00KMPS884", "B00C9TM38C", "B003YFZLTI", "B003YFXJOC", "B000ITX474", "B003S9CSJQ", "B00JAJ0H6O", "B00BB9P7OI", "B004DSXBQ0", "B00J53X104", "B00CV8XKTM", "B003ASVBDY", "B00JR5DP6A", "B00AKHCE5C", "B00C37OKYU", "B006GJ8Q7S", "B00JDDMTMC", "B003R7PU30"], "bought_together": ["B002HU086C", "B0009PUQ8M"]}, "title": "Wenzel Ridgeline 7 X 7-Feet Three-Person Dome Tent (Blue/LightGrey/Red)", "price": 47.77, "salesRank": {"Sports &amp; Outdoors": 6158}, "imUrl": "http://ecx.images-amazon.com/images/I/41O24tc6Z0L._SX300_.jpg", "brand": "Wenzel", "categories": [["Sports & Outdoors", "Outdoor Gear", "Camping & Hiking", "Tents", "Family Camping Tents"]], "description": "Keep your load limber during long hikes and extended cycling excursions with the Wenzel Ridgeline dome tent. Large enough to sleep three people at once yet compact enough to fit conveniently on a backpack or saddle bags, the tent is ideal for all types of camping and conditions. The Ridgeline includes such features as a Dutch D-style door for easy entry, along with a shock-corded fiberglass frame and pin-and-ring system that for quick and easy setup. Campers will also appreciate the Weather Armor polyester fabric, polyurethane coating, and sonic-sealed tub-style floor, all of which are reliably rugged and resist leaks of all kinds. The window, door, and roof vents, meanwhile, do a nice job of ventilating the tent and controlling morning moisture.Additional details include double-stitched, lap-felled seams that provide a shingle effect against water; water-repellent threads, zippers, and webbing; a hooked fly that increases weather protection; a gear loft and hanging pockets for easy-access item; and a handy storage duffel. The Ridgeline caries a 10-year limited warranty.Specifications:Base: 7 by 7 feetCenter height: 50 inchesInterior space: 49 square feetSleeps: 3Door: Dutch D-styleFloor: Welded polyethyleneFrame: FiberglassPegs: SteelCarrying weight: 7.3 poundsAmazon.com Tent GuideSelecting a TentFortunately, there are all kinds of tents for weekend car campers, Everest expeditions, and everything in-between. Here are a few things to keep in mind:Expect the WorstIn general, it's wise to choose a tent that's designed to withstand the worst possible conditions you think you'll face. For instance, if you're a summer car camper in a region where weather is predictable, an inexpensive family or all-purpose tent will likely do the trick--especially if a vehicle is nearby and you can make a mad dash for safety when bad weather swoops in. If you're a backpacker, alpine climber, or bike explorer, or if you like to car camp in all seasons, you'll want to buy something designed to handle more adversity.Three- and Four-Season TentsFor summer, early fall, and late spring outings, choose a three-season tent. At minimum, a quality three-season tent will have lightweight aluminum poles, a reinforced floor, durable stitching, and a quality rain fly. Some three-season tents offer more open-air netting and are specifically designed for summer backpacking or other activities. Many premium tents will also feature pre-sealed, taped seams and a silicone-impregnated rain fly for enhanced waterproofing.For winter camping or alpine travel, go with a four-season model. Because they typically feature more durable fabric coatings, as well as more poles, four-season tents are designed to handle heavy snowfall and high winds without collapsing. Of course, four-season tents exact a weight penalty of about 10 to 20 percent in trade for their strength and durability. They also tend to be more expensive.Domes and TunnelsTents are broadly categorized into two types: freestanding, which can stand up on their own, and tents that must be staked down in order to stand upright. Freestanding tents often incorporate a dome-shaped design, and most four-season tents are constructed this way because a dome leaves no flat spots on the outer surface where snow can collect. Domes are also inherently stronger than any other design. Meanwhile, many three-season models employ a modified dome configuration called a tunnel. These are still freestanding, but they require fewer poles than a dome, use less fabric, and typically have a rectangular floorplan that offers less storage space than a dome configuration. Many one and two-person tents are not freestanding, but they make up for it by being lighter. Because they use fewer poles, they can also be quicker to set up than a dome.Size MattersAsk yourself how many people you'd like to fit in your fabric hotel now and in the future. For soloists and minimalists, check out one-person tents. If you're a mega-minimalist, or if you have your eye on doing some big wall climbs, a waterproof-breathable bivy sack is the ticket. Some bivy sacks feature poles and stake points to give you a little more breathing room. Also, if you don't need bug protection and you want to save weight, check out open-air shelters.Families who plan on car camping in good weather can choose from a wide range of jumbo-sized tents that will accommodate all your little ones with room to spare. A wide range of capacities is available for three- and four-season backpacking and expedition tents. Remember, though, the bigger the tent you buy, the heavier it will be, although it's easy to break up the tent components among several people in your group. It's also helpful to compare the volume and floor-space measurements of models you're considering."}