{"asin": "B009HB2USI", "categories": [["Electronics", "Home Audio", "Stereo Components", "Receivers & Amplifiers", "Component Receivers"]], "description": "View LargerHarman Kardon AVR 1700Network-connected audio/video receiver with 5.1 channels Featuring AirPlay&#xAE;, six HDMI&#xAE; inputs with 3D and Audio Return Channel.Beautiful and Powerful. Harman Kardon AVR 1700 delivers everything you dreamt for in an AVR. Innovative materials and breakthrough engineering have always set Harman Kardon  products at the top. Be prepared for accuracy and detail that may surprise you. The AVR 1700 &#x2013; which incorporates the very best in high-end design and  proven technology &#x2013; is becoming one of the world&#x2019;s most recognized and  admired.Harman Kardon AVR 1700 at a glance:HDMI with 3D, Audio Return Channel, CEC and Deep ColorPowerful 5.1-channel surround systemDolby&#xAE; TrueHD and DTS-HD Master Audio&#x2122; decodingDLNA Certified&#xAE; 1.5 Ethernet connectivityAirPlay enabledFront-panel USB port plays MP3 and WMA files, and connects to iOS&#xAE; devicesControl applications for Apple&#xAE; and Android&#x2122; productsHARMAN headphone surround modeView LargerKey Features5.1-channel sound at 100 watts per channelHarman Kardon engineers have built the AVR 1700 audio/video receiver for a premium home theater experience, with the ability to fill the air with astonishing sound at 100 watts per channel. Speaking of the channels: With 5.1 of them, plus connections for a subwoofer, the AVR 1700 immerses you in a true surround-sound environment.DLNA 1.5 certified connectivityHear your networked media sources as never before in pitch-perfect surround sound. DLNA 1.5 enables the AVR 1700 to stream audio and video from compatible devices onto your home network via Ethernet connection, allowing you to enjoy them at a quality that you would not have thought possible.HARMAN Music Manager (available as a free download)This free, downloadable software enables your AVR 1700 to enjoy DLNA compatibility with your Mac OS devices or Windows&#xAE; operating system. And it helps organize and clean up the cover art on your music files.AirPlayHear how truly amazing your streaming music can sound. AirPlay allows you to stream music wirelessly from your iOS&#xAE; devices and from the iTunes service through your AVR 1700 for superb sound.Eco-friendly designLighter. Greener. Louder. The AVR 1700 uses a custom-designed digital power supply that delivers the amplifier power and superior sound that you expect from Harman Kardon products, without requiring hefty transformers. The result is the same power as conventional designs with a lower overall carbon footprint impact.EzSet/EQ calibrationThe Harman Kardon EzSet/EQ system automatically sets key system parameters and fine-tunes the AVR 1700&#x2019;s sound to your specific listening room with the press of a few buttons.USB port for music-file playback and system upgradesYour AVR 1700 doesn&#x2019;t need a docking station. Instead, its front-panel USB port allows an easy-access connection point for any iOS devices. It even lets you access music stored on a flash drive. Furthermore, the included AVR remote gives you a convenient way to control any connected device.HDMI inputs with 3D and Deep Color3D movies play as vividly and realistically in your home as they would in a movie theater, thanks to the AVR 1700&#x2019;s advanced HDMI connectivity. Experience everything from a 3D TV to a 3D Blu-ray Disc recording with an astonishing level of realism.<./p>Dolby TrueHD and DTS-HD Master Audio decodingHear films on your AVR 1700 the way the filmmakers intended you to hear them &#x2013; no matter which spot you get on the couch. Dolby&#xAE; TrueHD and DTS-HD Master Audio&#x2122; decoding create an immersive, high-resolution sound environment that matches the high-resolution HDMI video from HD sources such as Blu-ray Disc recordings.View LargervTuner Internet radioEnjoy your favorite radio stations, podcasts and Internet-only programming from around the globe in outstanding surround sound on your AVR 1700. vTuner&#xAE; Internet radio gives you quick, easy access to your favorite online stations.HK remote control appDownloadable from the iTunes store, the free Harman Kardon remote control app allows you to transform your smartphone or tablet into an easy-to-use remote control. Compatible with most iOS and Android&#x2122; devices, the app&#x2019;s high-definition graphical user interface gives you full control of your AVR 1700 and all of its connected media through the convenience of your favorite portable device.Exclusive DesignClean and Dynamic, one-of-a-kind look makes a dramatic design statement in  any room. JBL Studio 590 is available in black finish.Product SpecsTechnical Specifications&nbsp;&nbsp;&nbsp;Stereo mode continuous average power100 watts/ch, 1kHz, <0.1% THD, both channels driven @ 8 ohms. 6-ohm certifiedMultichannel power100 watts/ch, 20Hz driven @ 8 ohms, 1kHz <0.1% THDBandwidth @ 1W (+0dB/&#x2013;3dB)10Hz &#x2013; 100kHzInput sensitivity/impedance (line-in)250mV/27 ohmsSignal-to-noise ratio (IHF-A)100dBHigh instantaneous current capability (HCC)&#xB1; 34 ampsTelevision formatNTSCInput and Output level/impedance1Vp-p/75 ohmsPower consumption260W maximumDimensions (H x W x D)17-5/16\" x 6-1/2\" x 13-13/16\" (440mm x 165mm x 350mm)Weight12.8 lb (5.8kg)Powerful and versatile yet easy to use.The Harman Kardon&#xAE; AVR 1700 has virtually everything that you want in an audio/video receiver. Do you want sheer power? The AVR 1700 has 100 watts per channel. Want a variety of entertainment sources? The receiver includes vTuner&#xAE; Internet radio, DLNA&#xAE; 1.5 and AirPlay for wireless reception of your music and HDMI&#xAE; inputs for DVDs, HDTV, Blu-ray Disc&#x2122; media and video games. How about a system that&#x2019;s easy to use? A mobile app, remote control and intuitive menu system offer sheer simplicity. With all of these features and famously superb Harman Kardon audio, the AVR 1700 offers spectacular entertainment.", "title": "Harman Kardon AVR 1700 5.1-Channel Network-Connected Audio/Video Receiver with AirPlay", "price": 279.0, "salesRank": {"Electronics": 2055}, "imUrl": "http://ecx.images-amazon.com/images/I/31LBL4u5hAL._SX300_.jpg", "related": {"also_bought": ["B00GYCZEKO", "B008I64C2A", "B00B8CN8NU", "B00GYCXFM8", "B000O7LEG8", "B0039UUPH6", "B0029HHIDY", "B009CA7G92", "B0002KVQBA", "B006U3O566", "B0049P2000", "B003FVYXY0", "B003EGIE2S", "B000GFPTQY", "B009WVN85C", "B000092TT0", "B00GYCXAA0", "B00006WNKR", "B0052SCU8U", "B00166VDLC", "B001202C44", "B00DIUDLFU", "B0018MY30W", "B000V2UBS8", "B0097JLQVC", "B0018QROM2", "B0093F4ROI", "B001QNBUA4", "B000MFV7XW", "B001XURGSK", "B001AVRD62", "B00006BMQT", "B0046A8R5A", "B003FVX9FO", "B00413OWOC", "B00166VDKS", "B001UNLRGC", "B0030CNHLY", "B0052S7Z8K", "B00005T380", "B004EBX5GW", "B0044YPN0A", "B007QTAWYC", "B003XRD9UK", "B003FW0WIK", "B0018QNYVM", "B009DMFOVG", "B00192KF12", "B00BQ5RYI4", "B007QUYQSY", "B00413OWO2", "B007I5JT4S", "B002JS0CVI", "B003XRD9TG", "B0090CVJZ4", "B000TQ4D8K", "B003N7NTX2", "B00ELJVM5I", "B0002WTK4S", "B00FX6ST8G", "B005FM5WY2", "B00166ZFXO", "B000OG4E1G", "B001TH7GSW", "B0040QMTK4", "B001RQ2CXO", "B00DIU5PJ0", "B00AWKC0JM", "B007MD7AWE", "B008NCD2S4", "B004GW25WY", "B00ILWBLUM", "B009EADB2Q", "B00DG54ARU", "B004LRPXAU", "B002FS7RDI", "B0015A8Y5M", "B001TKE25E", "B006LW0WDQ", "B000069E1H", "B008I64BLM", "B00DYD1WWK", "B005LJQNQU", "B000EI0EB8", "B002C3OK3Q", "B003L1ZYYM", "B000GAQB0W", "B004GZ89N0", "B002FS1NYW", "B00481KO30", "B008NCD2PC", "B0029XW5JA", "B0001XGR1C", "B004L9DGCK", "B00CHKPYM0", "B003FW4XJE", "B008ALA2RC", "B003BKW2K2"], "bought_together": ["B00GYCZEKO"], "buy_after_viewing": ["B00B7X2OV2", "B00CALM2JY", "B00HZE2WW8", "B00B981F1U"]}}