{"asin": "B000EZY19W", "related": {"also_bought": ["B004XOLGG6", "B0001M6K24", "B0036WBWP6", "B00009R72R", "B00009R90W", "B00017LSPI", "B00009R8ZW", "B00009R90O", "B00009R8ZP", "B00009R7XP", "B00009R90A", "1933952695", "B004ABHKZ8", "B00009R8W7", "B00009R7VT", "B0000AE6AG", "B000CAHCQS", "B0036W9XUC", "B00009R90M", "B00009R90P", "B001B0TG26", "B0002ABK8Y", "B00009V39M", "B00EOR07K8", "B0000ALLYO", "B005WEYB0Y", "B00006B7DA", "B00507NEBA", "B0040L67QQ", "B007ED7S92", "B00J3NRAV2", "B004FNRTGG", "B00AI8LI1O", "B001JQVPBM", "B004WBR8C6", "B00009R8ZU", "B00009R90C", "B0047P5TUK", "B004UT0T5S", "159711247X", "B00009R90L", "B004V3I6JY", "B006X2FE1O", "B00004Z6U1", "B0002CWPW2", "B004ABL80G", "B0000AE6AH", "B004DIBTIW", "B0073HCE3O", "B005K08G1U", "B00ATZ9QMO", "B00009R90N", "B0000BZMIH", "B0036TGGW8", "B0000BVYT3", "B009SPWJ98", "B00006B7P5", "B002PLQ7LI", "1449316131", "B007SVFLP8", "B00009R7CD", "B00009V39N", "B00EO58Z5O", "B00005113L", "B005SHQ644", "B000FBK3QK", "B00DSUTVK4", "B003ZWHTMW", "B0000AZK4F", "B00062WV9U", "B002OEBMRU", "B005V22492", "B004IZN3RK", "B00023DRLO", "B00113A2S0", "B0009RENDO", "B00GY2GHAK", "B001F1Q8ZY", "B007R73BI2", "B008RXYOKY", "0823085651", "B005H4GTFE", "0821221868", "B000067SPO", "B007NDL56A", "B00009NDCX", "B007TIYZ3Y", "B003Y24DEU", "B001D1UTC4", "B002MUYOLW", "B00H09BOXQ", "B0009RENDE", "B007ED7V7G", "B00FNQMNCE", "B0019804U8", "B00DZYEXPQ"], "bought_together": ["B004XOLGG6", "B0001M6K24"], "buy_after_viewing": ["B002OEBMRU", "B00AGV7TQG", "B0001M6K24", "B000EZU0WE"]}, "title": "Epson B11B178011 Perfection V700 Photo Scanner", "price": 696.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31KJV7V7GVL._SY300_.jpg", "brand": "Epson", "categories": [["Office Products", "Office Electronics", "Scanners & Accessories", "Scanners", "Flatbed & Photo Scanners"]], "description": "From the Manufacturer Get professional quality results from virtually any photographic original with the Epson Perfection V700 Photo Scanner. With groundbreaking 6,400 dpi resolution, this powerful scanner consistently delivers precision color and detail, whether scanning slides, negatives or medium&ndash;format film. With a 4.0 Dmax optical resolution, it offers exceptional image quality, excellent detail in shadow areas and remarkable tonal range. 48&ndash;bit color and 16&ndash;bit grayscale provide subtle shades and accurate color reproduction for everything from professional slides to simple business documents.Epson Perfection V700 Scanner with built&ndash;in 8&quot; x 10&quot; transparency unit6400 x 9600 dpi resolution for film enlargements up to 17&quot; x 22&quot;The Epson Perfection V700 Photo Scanner goes one step further than typical home scanners. With its Dual Lens System, this innovative product automatically selects from two lenses for the desired scan resolution.One&ndash;stop photo restoration solutionThe V700 Photo also offers a host of powerful tools for photo restoration. Digital ICE&trade;technologies is a unique combination of hardware and software for correcting image defects. Digital ICE for Film uses an infrared sensor to detect dust and scratches on the surface of the film. In a multi&ndash;pass process, the dust/scratch is mapped out and carefully removed from the scanned image, leaving the composition and quality intact. Digital ICE for Prints removes the appearance of many types of surface defects from prints, minimizing costly retouching.DIGITAL ICE for Film &ndash; remove the appearance of dust and scratches for filmBeforeAfterDIGITAL ICE for Prints &ndash; remove the appearance of tears and creases from damaged photosBeforeAfterEpson Easy Photo Fix&reg;Restore faded color photos, slides and negatives, back to their original brilliance with Easy Photo Fix scanning technology, exclusively from Epson. Take those old family photos out of that shoebox in the closet and share precious moments once again. Just scan your photos renew the color with one click. It&rsquo;s just that easy. In seconds, you&rsquo;re ready to print and display those memories for all to enjoy. Along with color restoration, Easy Photo Fix also includes Grain Reduction and Backlight Correction.Epson Easy Photo Fix &ndash; instantly restore color to old, faded photosBeforeAfterIncreased productivityWith the convenient film holders included, you can even batch scan multiple slides and negatives to increase productivity. This powerful performer gives you the industry&rsquo;s leading scanner technologies, all right at your fingertips.The 8&quot; x 10&quot; transparency unit (built into lid) has four film holders: 35mm negatives,35mm slides, medium format and 4&quot; x 5&quot;, 8&quot; x 10&quot; film area guideFlexible Options, Comprehensive SoftwareThe Epson Perfection V700 Photo is compatible with both Macintosh and Windows operating systems, and includes FireWire and hi&ndash;speed USB 2.0 interfaces. Its comprehensive software package includes LaserSoft Imaging SilverFast SE 6, Adobe Photoshope Elements, ABBYY FineReader Sprint Plus OCR, Epson Copy Utility and Epson Scan with Epson Easy Photo Fix Technology. Epson also provides a one&ndash;year warranty covering parts and service.Features/BenefitsOptimize each scan with the exclusive Dual Lens&trade;System from Epson&trade;&mdash; Automatically selects from two lenses for desired scan resolutionAchieve professional quality scans&mdash; Delivers unparalleled performance with 6400 dpi optical resolutionEnjoy remarkable tonal range and greater shadow detail&mdash; Provides a 4.0 Dmax for smooth gradations and fine shadow detailRemove dust and scratches from film and many types of surface defects from prints&mdash; Includes Digital ICE&trade;Technologies, so you can automatically remove dust and scratches, minimizing costly retouchingBatch scan multiple slides, negatives and medium&ndash;format film&mdash; Makes it easy to achieve greater productivity with convenient film holdersDimensions (W x D x H)&mdash; 12&quot; x 20&quot; x 6&quot; and Weight 14.5 lbWhat the press is saying:&quot;Eye&ndash;popping optical resolution of 6400dpi, a high maximum density of 4.0 and true 48&ndash;bit output allow this versatile letter&ndash;format flatbed scanner to deliver top&ndash;notch results at a reasonable price&quot;Staff, American Photo (July/Aug 2006)&quot;Having worked with high&ndash;quality photography throughout my life, I&rsquo;m very demanding in terms of what I want in a final scan, and the V700 not only met, but often exceeded, my demands. It was a professional&ndash;quality scanner and produced extremely high&ndash;quality results &ndash; and thanks to the intelligence incorporated in the design of the scanner and the accompanying software, it also was easy to use.&quot;Ron Lafon, Cadalyst (8.5.2008)What&rsquo;s in the BoxEpson Perfection V700 Photo scanner &ndash; with DIGITAL ICE Technologies8&quot; x 10&quot; transparency unit (built into lid)Four film holders: 35mm negatives, 35mm slides, medium format and 4&quot; x 5&quot;8&quot; x 10&quot; Film Area GuideCD&ndash;ROM with Epson Scan software and productivity applicationsDVD&ndash;ROM with Adobe&reg;Photoshop&reg;ElementsCD&ndash;ROM with LaserSoft Imaging&trade;SilverFast&reg;SE6Hi&ndash;Speed USB 2.0 cableEpson Setup SheetAC adapter and power cable"}