{"asin": "B0090IA3AU", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Hard Drive Enclosures"]], "description": "Take your desktop to the next level. Simple to install and with PCIe 2.0 data transfer speeds up to 400 MB/sec, the Velocity Solo x1 enables you to experience the blazing speed of an SSD in your desktop via a super fast SATA III connection. Utilizing an As media 1061 controller chip, the Velocity Solo X1 is bootable in both PC and Mac systems. Once installed, transfer your OS and applications from your desktop hard drive to your new SSD using Apricorn&#x2019;s EZ Gig cloning software for PC systems, or for the Mac Pro use Apple's built-in Disk Utility. For additional capacity, the Velocity Solo also provides an additional SATA III data connection that can be used to connect to another SSD or hard drive. Running your OS and applications on an SSD provides a measureable performance increase, but the Velocity Solo is also the perfect upgrade for improving gaming performance. As games become too large for their assets to be fully cached on modern graphics cards and main memory, the addition of an SSD for faster disk access during game play results in less in-game pauses and a smoother playing experience. Games are also faster to load and save when using an SSD. Dimensions : Fits Standard Desktop PC Systems and Mac Pro (full size PCI card). System Requirements: DESKTOP PC - Full size desktop system with PCIe x1 card slot or larger . For optimal speeds use with PCIe 2.0 slot or higher. MAC PRO -The Velocity Solo will function in all Mac Pro models, but will only boot in EFI64 machines which are the last 2 models, 2009 and 2010, also known as MacPro4,1 and MacPro5,1, which can be found by doing an About This Mac, and then More Info. The first two models, the 2006, 2007 known as MacPro1,1, MacPro2,1 are EFI32, so won't boot from the Velocity Solo, but will function as high performance storage. The 2008 Mac Pro 3,1 is EFI64 but does not boot reliably, and therefore is not supported.", "title": "Apricorn Velocity Solo x1 Performance SSD Upgrade Kit for Desktop PCs and MacPro (VEL-SOLO-X1)", "price": 49.76, "imUrl": "http://ecx.images-amazon.com/images/I/41xdlhZduDL._SX300_.jpg", "brand": "Apricorn", "related": {"also_bought": ["B00I027GPC", "B00GG5GMKK", "B002Z2QDNE", "B002UR1654", "B000X285AW", "B00BQ8RM1A", "B00E3W1726", "B00E3W19MO", "B0080V73RE", "B009NB8WRU", "B005PZDVF6", "B00BQ4F9ZA", "B00AZ9T3OU", "B003L18WTQ", "B0096P62G6", "B009NB8WR0", "B005MN2GQQ", "B00E3W16OU", "B00E3W15P0", "B00APEG8NO", "B008U3038I", "B00DY5C7AY", "B003X26VV4", "B005HIWDHI", "B00DON2YZO", "B006E2Q64C", "B004E5OR74", "B00DG920R8", "B00A1ZTZOG", "B00G8772CS", "B00B3X72OU", "B00FR6VL50", "B007PNAQZO", "B004W2JL2A", "B00G9WHMHC", "B005DD28XG", "B009NHAEXE", "B007WT9UXA", "B005T3GRLY", "B00B99JU4S", "B008X0UKV8", "B002BH3Z8E", "B008JJLZ7G", "B000KS8S9W", "B008CXFMT6", "B003WSUZH0", "B00000J1V7", "B00BQ8RHJ2", "B005E2XQQY", "B00EHBERSE", "B004WKRU7U", "B009NHAF06", "B00G57BN1M", "B003AI272I", "B001FVI91U", "B0097LG9U8", "B000OGX5AM", "B007R67FNA", "B00APP6694", "B007PODI1W", "B00B3P15M8", "B00067JSM8", "B00030DEQE", "B00AYIDDMA", "B00B3Y4FAS", "B008JJLW4M", "B007Z3T5JC", "B0093HMKVI", "B00683X4PQ"], "bought_together": ["B00E3W1726"], "buy_after_viewing": ["B00E3W19MO", "B00E3W1726", "B00I027GPC", "B0096P62G6"]}}