{"asin": "B0042RA8C2", "categories": [["Electronics", "Television & Video", "Streaming Media Players"]], "description": "NBOX V3 G2 Full-HD digital media player has compact and convenient design. Just connect it to your TV or HDTV as you would a DVD player and enjoy your videos, music, and photos from a USB drive or flash memory card.ConvenienceThe V3 G2 is small, matte black, and completely noiseless. It starts up in less than 2 seconds and has an intuitive and responsive interface, making it effortless to enjoy all your media content without the need for a computer.PerformanceThe V3 G2 is a true next generation digital video device with broad video/audio codec and file format support at up to 1080p and 20mbps. The following is a brief summary:- Support decoding of H.264, H.263, WMV, MPEG1/2/4 and RM/RMVB formats- Audio decode: support MP3, WMA, OGG, AAC, AC3, FLAC, APE, WAV- Picture play: support JPEG, BMP, GIF, PNG- Support component video output (YPbPr)- Features HDMI (up to 720p) and CVBS out put interfaces- Support USB interface with HOST function, can directly play the files stored in USB devices- Support hot swap of the devices- Support SD and MMC cards (32GB max.)- IR remote controller, easy and quick to controlCompatibilityThe V3 G2 can be used with all TVs, HDTVs as well as home theater systems with its extensive connectivity:- Video: HDMI 1.3, YPbPr/Component, CVBS/Composite- Storage Interface: USB 2.0 Host ports, SD/SDHC/MS flash memory card reader- File System: FAT32, NTFS-What's Included- NBOX V3 G2 HD Media Player- Remote control (1*CR2025 battery included)- 100-240V AC adapter- User Guide- AV & Component Cable", "title": "NBOX V3 G2 Full HD 1080P Multimedia Digital TV Media player", "price": 39.95, "salesRank": {"Electronics": 42042}, "imUrl": "http://ecx.images-amazon.com/images/I/41RzX5uNzvL._SY300_.jpg", "related": {"also_bought": ["B002XVBAKI", "B0002L5R78", "B002N3DIC4", "B006FNCWSY", "B003U7MSLE", "B008I640QS", "B00IKMHR3S", "B008NO9RRM", "B006LEYQK4"], "buy_after_viewing": ["B008NO9RRM", "B002XVBAKI", "B00BGGDVOO", "B003L1ZYYM"]}}