{"asin": "B001QFZMBU", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The Panasonic DMC-ZS1 is a members of the new ZS-Series, the successor to the acclaimed LUMIX TZ-Series and one of Panasonic&rsquo;s newest ultimate compact and powerful digital cameras. The ZS1 features a 25mm ultra-wide angle, 12x powerful optical zoom, plus a 10.1-megapixel CCD, a standard iA mode (no Face Recognition) for still image recording and a 2.7-inch, 230,000-dot Intelligent LCD.New this year to the ZS-Series, iA mode is also available in Movie Mode. It automatically selects the most suitable Scene mode and helps to correct handshake, focus and brightness problems - making iA mode your one-stop solution to capture beautiful still and motion images. Face Detection automatically detects a face in the frame and adjusts focus, exposure, contrast, and skin complexion so it turns out perfectly. Intelligent Exposure continually checks the ambient light level and adjusts the exposure setting as conditions change to prevent blown highlights and blocked shadows. And Intelligent Scene Selector automatically switches between Normal, Portrait, Macro, Scenery, and Low Light modes according to the situation to optimize visual quality.The imaging power of Lumix has further evolved with the Venus Engine HD, which boasts two CPUs to provide approx. 2.4x processing capability and support for AVCHD Lite and HDMI output. It integrates all the advanced functions and camera operations with high performance and low-power consumption. In image processing, luminance noise and chromatic noise are reduced separately before and after signal processing. This is further refined by separating noise two-dimensionally into high-frequency and low-frequency noise. The circuits then effectively reduce only the low-frequency noise to minimize the unwanted noise and help produce beautiful, sharp still and motion images.Playback with the ZS1 is also easy.  Simply insert the camera&rsquo;s SD memory card into the VIERA HDTV&rsquo;s Image Viewer SD card slot for a photo slideshow. Alternatively, connect the camera via an optional HDMI mini cable, the DMW-HDC2, to a VIERA Link-equipped Panasonic VIERA HDTV and use the television&rsquo;s remote control to run mixed slideshows of photos and videos.", "title": "Panasonic Lumix DMC-ZS1 10MP Digital Camera with 12x Wide Angle MEGA Optical Image Stabilized Zoom and 2.7 inch LCD (Black)", "price": 9.99, "salesRank": {"Camera &amp; Photo": 3063}, "imUrl": "http://ecx.images-amazon.com/images/I/41yY7QEtwfL._SX300_.jpg", "related": {"also_viewed": ["B001QFZMCO", "B0011Z8CCG", "B00728Z8U0", "B00ATE7SZM", "B00728ZAFS", "B004KKZ0HY", "B00728ZAHG", "B00814CAS2", "B00ATE7TIS", "B00728ZBA2", "B00JWVILUY", "B00ATE7W7G", "B00395WIXA", "B00728Z9JA", "B00ATE7SAM", "B00395YA90", "B00ATE7W0I", "B003960FFM", "B003966MRM", "B004NTO2I0", "B004KKZ0HE", "B00728ZBC0", "B00ATE7VRC", "B007CLW404", "B00ATE7VJU", "B004NBZ8DQ", "B004HW7KC8", "B00ATE7WFS", "B00B3YSW5W", "B001CCLBSA", "B00728Z8TG", "B002XFW62U", "B006UMM1AY", "B003NYRMGA", "B006ZAHN4K", "B003WJR69O", "B004KKZ0H4", "B006ZAHN8Q", "B008MB719C", "B00B2QK2H2", "B006ZAHMPA", "B004KKZ0GA", "B008MB6YAY", "B004BFC260", "B006UMM15O"], "buy_after_viewing": ["B003VNKNEQ", "B00728ZBA2", "B002XFW62U", "B00ATE7W7G"]}}