{"asin": "B00028D778", "related": {"also_bought": ["B0003NN83U", "B003DNSJPE", "B0003NN81M", "B0003NN83K", "B004C2C1UO", "B002QFGM5Y", "B0063N7OZ2", "B001DSIMAI", "B006JJFP56", "B005IQGNCU", "B002J47Q3O", "B003ODHPDA", "B0003NN80S", "B00004YMCA", "B005IQGU0A", "B00CYSHUG8"], "bought_together": ["B0003NN83U", "B003DNSJPE"], "buy_after_viewing": ["B005IQGNCU", "B005IQGU0A", "B004C2C1UO", "B003DNSJPE"]}, "title": "Escort Passport 8500 X50 Radar and Laser Detector (Red Display)", "price": 272.95, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/51WBivZE2JL._SX300_.jpg", "brand": "Escort", "categories": [["Electronics", "Car & Vehicle Electronics", "Vehicle Electronics Accessories", "Radar Detectors"]], "description": "Radar detector manufacturers are constantly playing a game of catch-up with new technologies designed to nab the lead-footed. \"Pop\" radar is a relatively new instant-on technology that may make a whole generation of radar detectors obsolete. These radar guns operate at low frequency until they are switched on to determine a driver's speed with lightning-fast accuracy. This leaves a radar detector little opportunity to scan and detect the radar signal. Pop radar may sound ominous, but a new crop of radar detectors--including the Escort Passport 8500 X50--offer Pop radar detection. Escort claims that the 8500 X50 is the most powerful and advanced radar detector ever, with the supreme sensitivity required to detect low-frequency Pop radar.DesignMounting the 8500 in our test vehicle was easy and straightforward. A small suction cup bracket slides into the unit's release mechanism and easily attaches to the windshield with light pressure. The unit is housed in a sturdy plastic case that's low profile and compact--although it is larger and heavier than Escort's wireless offering, theSolo S2. The rear of the unit is dominated by a receiver window and there's a rear-facing laser detector window designed to detect laser signals emanating from behind the vehicle.Digital Signal Processing (DSP) provides maximum range, with minimum false alarms.The Escort 8500 has a suprisingly simple control layout. Two buttons on the top of the unit control sensitivity settings and display brightness. They also double as selection buttons when the unit is in programming mode. The left side of the unit sports a volume dial. A mute button is positioned on the front panel next to the large, horizontal LCD display which, during normal use, graphs the intensity of the radar and laser signals the unit detects. Power is supplied by an included Escort SmartCord, which plugs into a cigarette-lighter power socket. The SmartCord features an alert LED, as well as a built-in mute button-- two handy additions.FeaturesThe 8500 can detect all of the radar bands currently in use in North America for speed detection, including the X, K and Ka bands. The unit also features detection diodes for laser detection, but for the most powerful protection from laser detection, Escort offers the ZR3 laser jamming system, which is plug-and-play compatible with the 8500.The feature that separates the 8500 from other Escort radar detectors, as well as the entire previous generation of radar detector technologies, is its Pop radar detection capabilities. Pop radar guns, while still relatively rare in police departments, are used to identify speeding vehicles in traffic. They provide little warning as the radar signal idles at a low frequency until it transmits an extremely short, high-frequency burst to \"Pop\" a target. The 8500 is equipped with a highly sensitive receiving system and a digital signal processor designed to pick up Pop signals from a safe distance. Pop detection is not enabled by default in the 8500, however; users must turn it on in the settings menu. Escort probably chose to disable Pop detection by default because its increased sensitivity also increases false alerts. However, first-time radar detector users might be in for a surprise if they neglect to turn it on.The Passport 8500 X50 provides 3 types of warning displays to choose from.Audio alerts are the most important feature of any radar detector, and the 8500 doesn't disappoint in this department. Warning tones get progressively louder as a threat approaches, and users can set the unit to deliver warnings at preprogrammed volume levels. Each radar band--including Pop radar--has a distinct tone, making it easy to quickly discern threats. The 8500's \"AutoMute\" feature automatically lowers the volume level of an alert after a period of time.False alarms are one of the major annoyances of radar detector use. In our tests, the 8500 was surprisingly adept at minimizing false alarms from home garage door systems, as well as home and commercial security systems that commonly operate on X-band radar. The unit's city sensitivity setting decreases sensitivity to X-band sources, while the highway setting does not. We found the unit's powerful \"AutoSensitivity\" mode the most accurate, however, as it dynamically filtered all types of radar signals and identified which sources were a legitimate threat. We got a few false alarms, but for the most part, annoying chirps from bogus X-band sources were uncommon.The 8500 has nine built-in customizable settings. In the settings mode, the LCD acts as a menu system that lets users control display brightness, automatic mute, audio tones, and power-on modes. There are also settings for disabling detection of selected bands. We liked the expert mode settings, which allow a user to get a constant picture of the intensity of all the radar bands in the area. The SpecDisplay, which is a feature exclusive to the 8500, displays the actual numeric frequency of the radar signal being received.For those living in states that prohibit use of a radar detector, the 8500 does include VG-2 radar detector detector protection, which is designed to both alert the driver and shut down the unit's oscillator.On the RoadWe used the 8500 on a 20-mile stretch of busy interstate and were impressed with the low number of false alarms we received. Again, this remarkable level of accuracy is due to the unit's AutoSensitivity feature. While we encountered no police radar,other controlled testsof the 8500's performance have put the reliable range of detection at 2 miles for all bands. Meanwhile, Pop mode tests place the reliable detection range between 500 and 1000 feet.ProsWell-designed controls and display featuresAutoSensitivity feature greatly reduces false alarmsHighly accurate with massive detection rangeConsPop detection not enabled by default"}