{"asin": "B001G5ZTLS", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]], "description": "Compact, lightweight with environmental protection, EOS 5D successor boasts a newly designed Canon CMOS sensor, with ISO sensitivity up to 25,600 for shooting in near dark conditions. The new DIGIC 4 processor combines with the improved CMOS sensor to deliver medium format territory image quality at 3.9 frames per second, for up to 310 frames.Triggered from Live View Mode, HD video capture allows users to shoot uninterrupted at full 1080 resolution at 30fps -- for amazing quality footage with outstanding levels of detail and realism.The integration of HD movie capability into a high-end 21.1-megapixel camera opens a multitude of new possibilities for photojournalists and news photographers. With its full-frame CMOS sensor and outstanding ISO performance, the EOS 5D Mark II will appeal to any photographer in search of the finest camera equipment available -- from studio and wedding to nature and travel photographers.Other improvements to the EOS 5D include:Addition of Canon&#x92;s EOS Integrated Cleaning System, with a new Fluorine coating on the low-pass filterLarger 3.0-inch Clear View LCD with VGA resolution, a 170-degree angle of view and anti-reflective coatingsImproved menu system including Quick Control Screen for more direct access to common settingsAutomatic peripheral illumination correction, utilizing detailed EF lens information to optimize JPEG images straight out of the cameraMagnesium alloy construction with additional environmental protectionUDMA memory card compatibilityEOS 5D Mark II HighlightsNew CMOS sensorThe EOS 5D Mark II&#x92;s newly designed full-frame 21.1-megapixel CMOS sensor features ISO sensitivity from 100-6400, expandable to 50, 12,800 and 25,600. Large 6.4&#xB5;m2 pixels have been redesigned to capture more light and yield a better signal to noise ratio to ensure lower noise images throughout the ISO range. The full frame sensor has the same dimensions as a frame of 35mm film. This means that wide-angle lenses stay wide, without the change in angle of view associated with smaller sensor cameras. As well as benefiting from finer control over depth of field, photographers moving up to the EOS 5D Mark II&#x92;s full frame format will find the newly designed wide, bright 98 percent coverage viewfinder on a joy to work with.New DIGIC 4 processorA new DIGIC 4 processor combined with 14-bit analogue to digital conversion provides smooth gradations in mono-tonal areas such as skies, and highly accurate color rendition. As well as HD movie shooting, DIGIC 4&#x92;s high speed provides for long uninterrupted continuous bursts of large JPEGs, near-instant start-up times and immediate and fast review after shooting. DIGIC 4 also provides for improved noise reduction algorithms, complementing the already low-noise images from the EOS 5D Mark II&#x92;s CMOS sensor.HD video captureThe EOS 5D Mark II is Canon&#x92;s first DSLR to incorporate full HD 1920x1080 video capture. Once filming is started from Live View mode, photographers can fire off either single of continuous stills, with video capture continuing after the final frame is captured.See everythingA new 3.0-inch VGA resolution LCD provides a wide 170 degree angle-of-view, providing plenty of clarity for accurate focus checks in playback. The screen brightness can automatically adjust to suit viewing conditions, extending battery life in low light and improving viewing in bright conditions. A new dedicated Live View button switches modes to display a real-time image on the LCD. This allows EOS 5D Mark II photographers to enjoy simplified shooting from awkward angles. Simple connection to a PC provides easy remote shooting.Precision focus and meteringA 9-point auto focus system is supported by 6 additional invisible Assist AF points, located inside the spot-metering circle to optimise subject tracking performance in AI SERVO AF mode. For accurate exposure readings in tricky lighting conditions, the spot metering circle covers just 3.5 percent of the frame.ControlThe EOS 5D Mark II&#x92;s redesigned menu system includes a new Quick Control screen, for instant access to the most commonly changed settings. A new Creative Auto mode allows photographers to cede control of key settings to the camera, while retaining control over creative variables such background blur, drive mode and image brightness. Custom user settings allow photographers to switch between two completely different camera setups. This is ideal for changing quickly between two different environments, such as switching from working inside a church without flash to outdoors with fill-flash at a wedding.Optional AccessoriesShooting flexibility is enhanced with a range of new accessories. Shooting capacity can be extended with either the high-capacity 1800mAh lithium-ion Battery Pack LP-E6, or Battery Grip BG-E6.A new optional Wireless File TransmitterThe WFT-E4 offers external HDD and GPS compatibility along with ability to transmit images direct to computer or FTP server, or operate the camera wirelessly. Both the BG-E6 and WFT-E4  feature a vertical orientation shutter release and other key controls for comfortable portraiture work, with a substantial grip to help balance the camera when used with long lenses.What's in the BoxEOS 5D Mark II BodyEyecup EbWide Neck Strap EW-EOS5DMKIIStereo Video Cable STV-250NUSB Interface Cable IFC-200UBattery Charger LC-E6Battery Pack LP-E6EOS Digital Solution DiskSoftware Instruction Manual", "title": "Canon EOS 5D Mark II Full Frame DSLR Camera (Body Only) (OLD MODEL)", "brand": "Canon", "salesRank": {"Camera &amp; Photo": 679}, "imUrl": "http://ecx.images-amazon.com/images/I/51A5QiQi9ZL._SY300_.jpg", "related": {"also_bought": ["B003FHNDF4", "B002WE4H8I", "B00009R6WT", "B00009XVCZ", "B0049XGNKK", "B001KBZ3QO", "B00246XB1S", "B000AZ57M6", "B001KELVS0", "B000I1YIDQ", "B000NP3DJW", "B00007GQLU", "B00009R6WY", "B005IRKK7S", "B0041MY32Y", "B00CV9MPG0", "B00006I53S", "B005DEHVC8", "B002NO7PWC", "1435454332", "B00GGM6LUO", "B000053HC5", "B0000A1G05", "B0093HGEKG", "B002WE0QN8", "B005CDSMQE", "B00009XVCU", "B00007E7JU", "B00006I53W", "B001KBZ3P0", "B0033PRWSW", "B005EVPZJQ", "B0093HGDVG", "B002NO8PTY", "B0076BNK30", "B001NS0OZ4", "B000NP46K2", "B0056TYRMW", "B002WE2PW8", "B00CZ16UFQ", "B0018ZDGAC", "B001FO4QHI", "B00A61RWIG", "B006G5ZVA2", "B00005NPOB", "B00CV9MPW4", "B00158QASW", "B005LLUCEM", "B007FH1KX2", "B001CCAISE", "B009JCL55Y", "B00009R6WO", "B0093HGF32", "B004V97MXE", "B006OIG4IE", "B002N694A6", "B0025EWXEU", "B000EW9Y4M", "B000YZGCIU", "B00BXA7N6A", "B0020LB0MO", "B002ZIMEMW", "B00007GQLT", "B002NO7Q26", "B001KBZ3S2", "B00006I53X", "B00CBB5E3Y", "B004K8WPUQ", "B00004ZCJI", "B00009R6WU", "B004LEAYXY", "B002VPE1WK", "B0045JAJR6", "B00EZEBVE6", "B005IMFX2K", "B003TYDBYQ", "B00004ZCJM", "B00009XV3M", "B004TJ6JH6", "B0076BNKOY", "B0079M711S", "B001KBZ3SC", "B001G4QXLE", "B002NEGTTW", "B000053HH5", "B00004ZCK0", "B002O3KVSC", "B0054ENDO2", "B003KIIQYG", "B0019CSVMW", "B008X1C1DC", "B003V1YGT6", "B0082CAWEW", "B001NEK2Q4", "B002K42W4Q", "B002K3X2WS", "B006JINI5G", "B006JSSFZO", "B002NEGTSI", "B0034DUR6W"], "bought_together": ["B002WE4H8I", "B001KELVS0"], "buy_after_viewing": ["B002WE4H8I", "B007FGYZFI", "B001KELVS0", "B0049XGNKK"]}}