{"asin": "B005C95MRA", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "See pictures in a whole new way with the Sony DSC-TX55 camera. Viewing vivid colors on the 3.3-inch OLED touch screen brings photos to life. With 3D still image, amazing Intelligent Sweep Panorama HR mode, superb low light function and full HD video, viewing your pictures just got a lot more exciting.16.2 Megapixel Back-illuminated \"Exmor R\" CMOS Image SensorThe DSC-TX55 features a 16.2 megapixel \"Exmor R\" CMOS image sensor that brings out the full resolving power of the camera's Carl Zeiss Vario-Tessar lens to deliver extremely fast speed, high resolution, and stunning low-light sensitivity with improved image clarity and drastically reduced grain. In addition, the combined \"Exmor R\" CMOS sensor and BIONZ image processor delivers extremely fast up to 10fps, Anti Motion Blur, Hand-held Twilight and 1080i movie modes.Slim and stylish designThinner than AA battery at &frac12; inch, this stylish camera is the perfect size to take along almost everywhere. Slip it into a pocket, purse, or backpack and be ready to shoot memorable moments.Full HD 1080/60iRecord crystal clear movies in high resolution with capabilities for 60i in 1080. This provides stunning, fast motion video with less distortion for playback on your HD TV.Superior Auto modeGet cleaner, more dynamic pictures and fewer missed shots. The camera automatically recognizes the correct scene mode, then quickly shoots and combines up to six shots to produce images with greater clarity, optimum dynamic range using backlight correction HDR technology and lower image noise using 6 shots layering technology. Superior Auto intelligently detects 36 scenes for still images and movies, making it easy to get the best shot.Optical SteadyShot with Active ModeOptical SteadyShot with Active Mode for blur-free movies even while walking. Camera-shake compensation using Optical SteadyShot/Active Mode has been improved with the addition of new electronic image stabilization. Now it's easier than ever to obtain sharp, blur-free movies even when zooming in unsteady situations, such as shooting with one hand while walking.3D still image and 3D Sweep Panorama modeProduce awe-inspiring images with 3D still image and 3D Sweep Panorama capabilities. Images will take on a new dimension to view the world in a whole new way.3.3-inch (1,229K dots) OLED Extra Fine touch screen with wide viewing angle3.3-inch (1,229K dots) OLED Extra Fine touch screen with wide viewing angle delivers brilliant-quality still images and movies while enabling easy focusing operation. The new reinforced-glass touch screen gives the camera a sturdy feeling and prevents color bleed during touch operations.Background DefocusDSLR photographs are often beautiful because they blur the background, putting the emphasis on your subject. Now our point-and-shoot cameras can deliver this signature DSLR benefit. The system takes two shots, identifies the background and applies a defocused background keeping the subject crisp and clear.Clear image digital zoomClear image digital zoom maintains high-resolution feel that is as precise as optical zoom and vastly expands the zoom range without lowering visible quality or pixel count in the final image.Picture Effect for more expressive photosPicture Effect adds a new level of expression to photos, making ordinary landscapes and portraits come to life by heightening mood and emphasizing certain attributes. Seven effects give free reign to your imagination to expand creative horizons. HDR Painting creates a rich painted look. Rich-tone Monochrome produces an artistic black and white image. Miniature transforms mundane landscapes into fascinating works of art. Toy camera transitions an ordinary photo into one with high contrast, tunnel view, and four color shifts. Partial color results in a stunning monochrome photo containing a single designated color. High-key creates photos with heightened brightness for a soft clean look.Intelligent Sweep Panorama HR modeWith Intelligent Sweep Panorama HR mode just press the shutter, pan the landscape and let the camera do the rest. It automatically links together each frame to produce a high resolution panoramic image providing the ability to zoom in on small details. This model even detects faces and moving subjects to stitch intelligently different widths to help avoid subject distortion.High speed shootingThe DSC-TX55 can capture full 16.2 megapixel resolution images at up to 10 frames per second, helping to ensure that the decisive moment is captured such as the soccer ball flying into the goal. In addition, the DSC-TX55 employs a mechanical shutter that helps reduce distortion when continuously shooting moving subjects.Soft Skin modePortrait subjects will love the results. Soft Skin mode recognizes skin tones and reduces the appearance of blemishes and wrinkles without affecting the rest of the shot.Natural Flash Conventional point-and-shoot camera flash shots just don't capture colors the way the eye sees them. Natural Flash mode takes a reference shot without flash and then uses that reference to correct the color, for far more lifelike images.Carl Zeiss Vario-Tessar Lens with 25mm equivalent wide angle 5x Optical ZoomThe high-performance Carl Zeiss Vario-Tessar 5x optical zoom lens brings distant subjects closer for video recording as well as for outdoor, sports, and travel photos, and Close Focus shoots close-ups within a &frac12;\" of the subject. A 25mm equivalent wide-angle lens allows you to take wider shots of the scene or group in crowded spaces.Backlight Correction HDRDon't miss a single detail in high contrast shots. The built in backlight correction analyzes the image and automatically adjusts accordingly to give you a perfectly lit shot.HDMI outputThe High-Definition Multimedia Interface (HDMI) is a compact audio/video connector interface for transmitting uncompressed digital streams. HDMI connects digital audio/video sources such as a compatible camcorder, Blu-ray Disc player, a personal computer, a video game console, or an AV receiver to a compatible digital audio device and/or video monitor such as a digital television (DTV). Easily connect your Cyber-shot camera via HDMI cable (sold separately) to any compatible HDMI device to easily enjoy and upload content.Smile Shutter technologySmile Shutter technology captures a smile the moment it happens. Simply press the Smile Shutter button and the camera does the rest. Also select adult and child priority and indicate the degree of Smile Detection sensitivity. Intelligent Scene Recognition can be used together with Smile Shutter mode. This means that beautiful smiles can be captured with settings optimized for the particular scene, even in difficult conditions such as twilight and backlighting.Face Detection technologySony's Face Detection technology can automatically distinguish between children and adults. Face Detection technology detects up to eight individual faces and adjusts flash, focus, exposure, and white balance to help deliver crisp, properly lit images of family and friends.Motion DetectionMotion Detection, along with Face Motion Detection adjusts ISO sensitivity and increases the shutter speed when movement is detected, reducing blur in moving subjects and faces.Anti-blink FunctionIt's frustrating to capture the perfect shot, only to review it later and discover subjects blinked during the photo. When the camera is set to Soft Snap, the Anti-blink function captures two images, recording only the photo with less squinting or blinking. If a blink is detected in other shooting modes, a warning will be displayed after you take the shot.Sweep Multi Angle modeIn Sweep Multi Angle mode, the camera takes 15 images at different angles as it sweeps across the scene. By tilting the camera during playback, the camera's Gyro Sensor detects motion and displays the image in a 3D-like view on the camera's LCD.Compatible with PC and Mac SystemsThe Full HD video captured with the DSC-TX55 can be used with the provided Picture Motion Browser software for PC and iMovie '09 (sold separately) for Mac systems.Includes Sony PMB (Picture Motion Browser) Software ver. 5.6Sony Picture Motion Browser software offers a simple, intuitive way to transfer, sort, and view your video and still images on your compatible PC. In addition, multiple output options let you burn your memories to DVD using an external DVD burning device, as well as take advantage of one click upload to a number of popular video and photo sharing sites (such as Facebook and Sony's Personal Space site).Includes Sony PMB Portable softwareWith the pre-installed Picture Motion Browser (PMB) Portable software the DSC-TX55 makes it easy to pre-select videos and images in the camera and conveniently upload them from the camera to a compatible PC and popular Internet sharing sites without the need for any additional software or install.;if (typeof amznJQ === \"undefined\") { } else { amznJQ.onReady('JQuery', function() { setTimeout(function() {if(msa.Vowels) { var amzvowels = new msa.Vowels(jQuery,16,[\"ec2.images-amazon.com\",\"ec3.images-amazon.com\", \"ec5.images-amazon.com\"],5,'03XSW8GTNYATT6WGSCGR', [\"z-ec3.images-amazon.com\", \"z-ak.images-amazon.com\" ], \"images-na.ssl-images-amazon.com\", [\"1820\", \"3320\", \"7470\", \"14730\"], [\"1820B\",\"3320B\",\"7470B\",\"14730B\",\"1\",\"2\",\"3\",\"4\",\"5\",\"6\",\"7\",\"8\",\"9\",\"10\",\"14\",\"15\",\"17\",\"18\",\"19\",\"20\",\"21\",\"22\",\"23\"], 50, 50, 100); amzvowels.initializeAndStart(); }}, 8000)}); }", "title": "Sony Cyber-shot DSC-TX55 16.2 MP Slim Digital Camera with 5x Optical Zoom and 3.3-Inch OLED touch screen (black)", "price": 9.95, "salesRank": {"Camera &amp; Photo": 9103}, "imUrl": "http://ecx.images-amazon.com/images/I/41fN0Zne72L._SY300_.jpg", "related": {"also_bought": ["B005KG3KOC", "B003WGJYCY", "B0035FVHJ0", "B0065LTQ6M", "B001PO5VX6", "B00328HR80"], "buy_after_viewing": ["B00BEHQKP2", "B00BEHQKP2", "B0051V7XK8", "B0049VGHOO", "B006K5533I"]}}