{"asin": "B00020BV1A", "description": "Over the years, we have sliced through Imperial forces with twirling lightsabers, given in to the tantalizing power of the Dark Side, and destroyed the Death Star more times than George Lucas has worn his favorite flannel. With a setting that Tom Clancy wouldn't mind endorsing, Republic Commando emerges as a great departure for Star Wars gaming, and a breath of fresh air that fans have been dreaming of since they first watched a squadron of storm troopers obliterate a hapless crew aboard the Tantive IV blockade&nbsp;runner.There are no backdoor drafts in the Republic. Born of the genetic stock of the galaxy's most feared bounty hunter, you were created with the specific intent of serving your people through bloodshed and war. Your appearance is identical to that of your brethren, who number in the millions, but your physical prowess has been heightened far beyond theirs. You are the best of the best. You are one of the Clone Trooper elite. Assigned as the leader of an upper echelon Republic Commando division, you must lead your squad to victory in the face of unyielding&nbsp;adversity.As you unload countless rounds into a Separatist onslaught, you can send your sharpshooter to a sniper point, tell your hacker to open a door, and order your weapons expert to light up the droid forces with a well a placed Thermal Detonator. The on-the-fly squad control may sound fairly complex, but the system that LucasArts has developed couldn't be easier to use. With this said, you won't have complete control over the actions of your cohorts. Outside of simple commands like \"form up\" and \"attack this target,\" you can only send them to areas that are assigned to specific tasks such as sniping or hacking &#8211; all with the click of a button. If you take on too much damage and go down, you can even signal to a teammate to revive you with a quick resuscitation. Thanks to impressive AI, you never really have to worry about your troops doing something stupid. The only flak you can send their way is for being too cowardly when an enemy is clearly not paying attention to them, and for not being able to recognize the greatest threat on the battlefield unless you point it out to them.Although the controls fit as comfortably as Master Chief's glove, the targeting system is too demanding of precision, especially when you are required to unload dozens of rounds into certain enemy types. If you don't have armor-breaking rounds, a Super Battle Droid can be just as annoying as the new dance number in Return of the Jedi.Airborne foes are also quite difficult to tag at a successful rate.While not a sure-fire marksman, Republic Commando still has enough kick in its firepower to knock you off of your feet. From explosive scripted events on the battlefield to harrowing battles that are almost too intense to comprehend, each mission is filled with relentless excitement and moments that you'll cherish for a lifetime. Whether you watch a Wookiee physically dismantle a Super Battle Droid or hold your breath as you rely on your troops to provide over a minute of cover fire as you hack a security terminal, Republic Commando seamlessly blends breathtaking spectacles with uniquely styled and highly contagious gameplay. The sound (sans the metal during the end credits) is remarkable as well.At the same time, however, you can't help but criticize the game for its limited number of enemy types (I seriously felt like I destroyed at least 10,000 Battle Droids), noticeably absent story breaks, and lackluster multiplayer deathmatching. Furthermore, why didn't LucasArts do online co-op? It's a perfect&nbsp;fit.It does tie into the upcoming Revenge of the Sith movie, but the Episode III content is more of a lightsaber tease than anything. General Grievous is literally in the game for two seconds, and just as you are about to join the pivotal battle of Kashyyyk, the game comes to an end, basically saying, \"This looks awesome, doesn't it? Buy a ticket to the movie and you'll see how it unfolds.\"No lightsabers? No problem. A Star Wars game without Jedi may seem like a Jar Jar-sized disaster, but I don't think even Master Yoda could dodge a nicely placed sniper shot by this incredible Republic Commando unit.Concept:Suit up as an elite commando and pulverize Battle Droids as you bark out orders to your Power Ranger-colored squadGraphics:There are few visuals more satisfying than the vibrant green splattering of Geonosian blood on your visorSound:Why do clones have different voices? And what's with the cheesy hair metal at the end? If John Williams hears this, batons will be shoved in uncomfortable placesPlayability:Targeting with the DC-17m is a bit suspect, but the squad commands work well, and the weapon selection is balanced nicelyEntertainment:Has the uncanny ability to rock your world and make you cry like a baby at the same timeReplay:ModerateRated:8.25 out of 10Editor:Andrew ReinerIssue:March 20052nd Opinion:While there are some recognizable technical issues that mar the glossy sheen of Republic Commando, they are only noticeable because everything else has been done with such finesse. Painting Star Wars in a dark and gritty light results in visuals that are both believable and deeply involving. The action sprung to life around me, and the squad mechanic was one of the most enjoyable and flexible I have yet encountered, even if the ally AI was occasionally frustrating. With only a few different enemy types, there really should have been more variety in their tactics, which brings the otherwise gripping combat down a notch in my mind. The voicework and visceral Foley sound effects are uniformly fantastic, and the Episode III score had me chomping at the bit for the big May release. The ending induced in me near physical pain, as it brought me right to the brink of something I'm not going to see until after the opening text scroll of the movie. Regardless, this is a unique take on that most beloved of fictional universes, and true fans would be remiss not to play it in its entirety. Oh, and in case you were wondering, Wookiees in battle are indeed ridiculously sweet.Rated:8.75 out of 10Editor:Matt MillerSubscribe to Game Informer--Amazon.com", "price": 81.3, "imUrl": "http://ecx.images-amazon.com/images/I/519MFA1V8CL._SY300_.jpg", "related": {"also_bought": ["B0001DI6FM", "B0009O7HUI", "B000067DPM", "B0002B90SA", "B0000A1OG8", "B00006LEMQ", "B0007SL202", "B00008DHNZ", "B001ELWMHI", "B0030EU3TG", "B0006BK5AI", "B00008J7NZ", "B00005RCQJ", "B000R0URCE", "0345498003", "B00005NZ1G", "B00006409Y", "0345478274", "B0009351RK", "B00006409Z", "B00020BV0Q", "B00097IA88", "B00005NZ1T", "B00006JN5J", "B00006JC48", "B0000C7GH4", "B0007M226G", "0345490096", "B00019AZA0", "B0001UEHP8", "B000G82DDS", "0345513851", "B0006I5I58", "B002ABVM54", "B00008XKZM", "B000VV9T7S", "B00006C28Y", "B0002SQ0BS", "B0009O7HVM", "B00007E1OB", "B00008KTNW", "B000067DPL", "B00009VE6E", "B00005NZ1I", "B0009S4UOK", "B00008G75X", "B0002735AI", "0345511131", "B000095ZH0", "B00006LEMP", "B00025EJ1E", "B0002A2S26", "B0006ZJPSC", "B000087L4G", "B00009U146", "B000P0QIRE", "B0006SST9U", "B0001NE48U", "B0000ARQN0", "B00005QDPZ", "B00095LEEW", "B00005R6YX", "B00009KX7C", "B000AOEV6A", "B000E61G4O", "B0050SYY5E", "B0009PAUJM", "B000QCU9I0", "B0000A1OG4", "B0006I5FLU", "B000HCQK0A", "B00078W0BM", "B00067AVSS", "B0009UC68U", "B00005TN7U", "B001UWGDC6", "B0002ILSH4", "B00005V9NK", "B000F2JUOK", "B00019HNN2", "B000G80MOU", "B0016CQ0Q4", "B0007PIEAQ", "B000067DPK", "B00005U8TR", "B000B2YR74", "B0008GJRQ4", "B000FDMV9U", "078692876X", "B00006LU9C", "B005DKMC6M", "B000053U3X", "B00002STGQ", "B00005NZ1K", "B00J9RAEAQ", "B00082ZQZY", "B000BC1UZ6", "B00006C296", "B00005OWBL", "B0007ULFAW"], "bought_together": ["B000067DPM", "B0002B90SA"], "buy_after_viewing": ["B000067DPM", "B0001DI6FM", "B0009O7HUI", "B0002B90SA"]}, "salesRank": {"Video Games": 3246}, "categories": [["Video Games", "More Systems", "Xbox", "Games"]]}