{"asin": "B004U78J1G", "description": "Some things are meant to go togetherTransforming the Conventional into the UnconventionalWith a slim, lightweight design and a 10.1-inch WSVGA IPS capacitive display made from durable and scratch-resistant glass that is viewable at angles up to 178&deg;, the versatile Eee Pad Transformer is the perfect tablet for anyone who wants to enjoy multimedia on the move, but still wishes to have easy access to the web, email, and other productivity applications. A custom user interface provides easy access to the many features of the Android 3.2 (Honeycomb) operating system, while the NVIDIA&reg;Tegra&trade;2 chipset provides full support for Adobe&reg;Flash&reg;10.2,1smooth HD video conferencing and playback, a lightning fast web experience, and incredible mobile gaming performance. The optional docking station turns the Eee Pad Transformer into PC mode with a QWERTY keyboard, while extending battery life up to 16 hours.2Front and rear cameras make for easy video chat and digital photography, which can be played back in video on HDTVs via a mini HDMI output port, making it a true mobile entertainment device.Awards Received\"&hellip; the best Android slate we've seen\"&ndash; Computer Shopper\"A convenient keyboard dock, sleek design, and aggressively low price make the Eee Pad Transformer our favorite Wi-Fi-only Honeycomb tablet.\"&ndash; Laptop Magazine\"Of all of these new entrants, the Eee Pad Transformer impresses us most so far&mdash;and not just because of its low price tag. The 10-inch slate is lighter than competing Honeycomb tablets, features an IPS screen for wider viewing angles, and plugs into an optional keyboard dock that adds more battery life. It's this kind of combo that could prove a hit with the back-to-school crowd, as well as mobile professionals who want to take notes in meetings. The dock adds a reasonable $149 to that rock-bottom $399 price.\"&ndash; Laptop Magazine\"&hellip; the Honeycomb tablet to get..\"&ndash; AnandtechKey Features10.1-inch WSVGA IPS capacitive pressure-sensing multi touch displayfor brilliant HD entertainment and intuitive navigation. 178&deg; viewing angle (1280 x 800)Powered by NVIDIA&reg;Tegra&trade;2 mobile processorfor best web experience with up to two times faster browsing, hardware accelerated Flash, and console-quality gaming (Learn more)Front (1.2 MP) and rear (5 MP) camerasfor face-to-face video chats and on-the-go video and picture capturing (Learn more)Mini HDMI portto supersize your entertainment to compatible HDTVs and external displays (Learn more)Optional Docking station with QWERTY keyboardadds additional 6.5 hours of battery life, to instantly turn the Transformer into PC mode with up to 16 hours of battery life2(Learn more)Learn MoreWhen Tablet meets KeyboardView largerBreaking the mold, an optional keyboard docking station designed especially for the Eee Pad Transformer transforms your tablet into PC mode with a 92% sized QWERTY keyboard with unique Android Function (Fn) keys for added convenience.Featuring all of the connectivity you'd expect in your notebook, the Eee Pad Transformer comes complete with 2 USB 2.0 ports, a headphone audio jack and a 4-in-1 card reader when used with the optional docking station. Also to keep you unplugged longer without interruption, the optional keyboard docking station adds an additional 6.5 hours of battery life, allowing the Eee Pad Transformer to last up to an astounding 16 hours.2When Android meets TegraView largerDesigned specifically with tablets in mind, the Android Honeycomb 3.2 operating system provides you with optimized features and functions such as multi-touch and a holographic interface that allows you to access widgets and shortcuts with ease. Get refined multitasking, rich notifications, Home screen customization, widgets, and more. And experience the web with Adobe&reg;Flash&reg;10.21for added convenience.Other Android Features:Customizable Home screensFive customizable Home screens give users instant access to all parts of the system from any context. Each screen offers a large grid that maintains spatial arrangement in all orientations. Users can select and manipulate Home screen widgets, app shortcuts, and wallpapers using a dedicated visual layout mode. Visual cues and drop shadows improve visibility when adjusting the layout of shortcuts and widgets. Each Home screen also offers a familiar launcher for access to all installed applications, as well as a Search box for universal search of apps, contacts, media files, web content, and more.Recent Apps, for easy visual multitaskingMultitasking is central to the Android 3.2 experience. As users launch applications to handle various tasks, they can use the Recent Apps list in the System Bar to see the tasks underway and quickly jump from one application context to another. To help users rapidly identify the task associated with each app, the list shows a snapshot of its actual state when the user last viewed it.Redesigned keyboardThe Android soft keyboard is redesigned to make entering text fast and accurate on larger screen sizes. The keys are reshaped and repositioned for improved targeting, and new keys have been added, such as a Tab key, to provide richer and more efficient text input. Users can touch-hold keys to access menus of special characters and switch text/voice input modes from a button in the System Bar.Improved text selection, copy and pasteWhen entering or viewing text, a new user interface lets users quickly select a word by press-hold and then adjust the selection area as needed by dragging a set of bounding arrows to new positions. Users can then select an action from the Action Bar, such as copy to the clipboard, share, paste, web search, or find.NVIDIA&reg;Tegra&trade;2, world's first mobile super chip, brings the fastest, most visually-rich tablet experience ever seen. The Eee Pad Transformer takes full advantage of this mobile dual-core processor, providing extreme multitasking capability with the best web experience &ndash; up to two times faster browsing, hardware accelerated Flash, and NVIDIA&reg;GeForce&reg;gaming.When Multimedia meets FunctionalityView largerExperience the wonders of video chat and crisp digital photography with front (1.2MP) and rear (5MP) facing cameras, which can be played back in video on HDTVs via a mini HDMI output port. Built in SRS Sound technology also provides a dynamic 3D stereo audio experience with maximum bass response and a wide sound field from the built-in speakers.When the Cloud meets ConvenienceView largerASUS' Waveshare Interface hosts a variety of unique applications that help you easily launch software, manage content and access online services and connect devices with a few simple taps.MyNetAllows users to easily stream digital media wirelessly within home network devices with the Eee pad Transformer. Play HD videos or music on any home network devices such as the HDTV monitor or desktop PCs for an even better experience from the Eee Pad Transformer.MyLibraryConsolidates downloaded books, magazines and newspapers in to one easy to browse profile.MyCloudMyCloud is a total cloud solution, providing access to digital content such as music, videos and files from the cloud anywhere, anytime. Users can even use MyCloud to remotely access and control any PC or Mac system and access applications or files to extend the versatility of the Eee Pad Transformer experience.Relax, ASUS Has You CoveredRanked as the #1 most reliable PC brand by 3 independent sources3, readers and editors alike choose ASUS as their trusted notebook and netbook. We tirelessly strive to exceed expectations of quality to ensure you an unmatched peace of mind every time you start your PC.We also back our commitment with the industry's most comprehensive warranty.1 year North America warrantyFree one-way standard shipping24/7 tech supportWhat's in the BoxASUS EeePad Transformer TF101User manualPower adaptor with USB to 40 pin connectorWarranty cardSpecificationsOperating System:Android 3.2 (Honeycomb) PlatformDisplay:10.1-inch WSVGA IPS capacitive multi touch display built with durable and scratch-resistant glass; 178&deg; viewing angle(1280 x 800)Chipset:NVIDIA&reg;Tegra&trade;2 Mobile ProcessorMemory:1GB DDR2Wireless:802.11b/g/nBluetooth:Bluetooth v2.1 + EDRStorage:16GB eMMC Flash (Memory expansion via microSD card slot with support for optional cards up to 32 GB (functionality requires future software upgrade)Camera:1.2 megapixel (Front); 5.0 Megapixel (Rear)Speakers:SRS SoundCard Reader:Micro SD Card ReaderInput / Output:1 x Mini HDMI, 2-in-1 audio jack (head phone/mic-in jack), internal micBattery Pack:24.4 W/h Li-polymer battery (up to 9.5 hours)1Dimensions:10.67\" x 6.89\" x 0.47\" &ndash;inches (W x D x H)Weight:1.5lbsColor:Espresso&copy; 2011 ASUS Computer International. All Rights Reserved. ASUS is a registered trademark of ASUSTeK Computer. All specifications and terms are subject to change without notice. Please check with your supplier for exact offers on selected models. Products may not be available in all markets. Product may not be exactly as shown in photos. All trademarks are registered to their respective companies. ASUS shall not be liable for technical or editorial errors or omissions contained herein.1Adobe&reg;Flash&reg;10.2 support requires an upgrade available online.2Actual battery life varies with usage. Operation lifetime subject to product model, normal usage conditions and configurations.3Rated number 1 Windows-based PC maker in PCMag.com's Service &amp; Reliability Report 2010. Rated number 1 PC brand according to SquareTrade, the leading direct-to-consumer warranty company (for more information visit http://www.squaretrade.com/pages/laptop-reliability-1109/ ). Rated number 1 reliable PC maker in Q2 2010's RESCUECOM report http://www.rescuecom.com/2010-2nd-Quarter-Computer-Reliability-Report.htmlCheck Out Other Great ASUS ProductsASUS Transformer PortfolioProtect your Eee Pad Transformer with the ASUS Portfolio cover designed to fit the tablet perfectly. The portfolio also has a fold-able cover that turns into a keyboard stand or a reader stand, making it convenient to use your Eee Pad comfortably for hours-on-end.Eee Pad Transformer Docking KeyboardIt is meant to be together. Add a docking keyboard to your Transformer tablet and get up to an amazing 16 hours of battery life. With 2x USB ports, an 4-in-1 card reader, the expansion possibilities are almost limitless. Its full QWERTY keyboard and a row of shortcut keys means you can get what you want done, faster, more efficient.ASUS Index Sleeve - BlackWhen docked, your Eee Pad Transformer is not just a tablet, it is also a very capable notebook style PC. Don't leave home without a sleeve protecting your Transformer. Check out this water-repellant textured leather sleeve with an soft sued interior.ASUS Index Sleeve &ndash; PinkWhen docked, your Eee Pad Transformer is not just a tablet, it is also a very capable notebook style PC. Don't leave home without a sleeve protecting your Transformer. Check out this water-repellant textured leather sleeve with an soft sued interior.", "title": "ASUS Transformer TF101-A1 10.1-Inch Tablet (Dock Sold Separately)", "price": 419.0, "imUrl": "http://ecx.images-amazon.com/images/I/51xOoL8fLoL._SX300_.jpg", "related": {"also_bought": ["B004U78628", "B005OUE8R2", "B005A96Y74", "B005BNWKD6", "B005GYDJ58", "B005G2F3FE", "B005JFIS50", "B00918TZ94", "B005FVDVKA", "B00FNF7PSC", "B007LI1UOE", "B007GJR7GS", "B0058OU7EC", "B005FVDVIW", "B006379D0W", "B008G2GBN4", "B0067PLM5E", "B007P4YAPK", "B00104XCVO", "B007PBGQ6Y", "B005FVDWIQ", "B00CFIDQZG", "B008FOR3Q2", "B0064VN7F4", "B004XZL980", "B007N5YOR0", "B007IFAP6Y", "B0089RLGEA", "B005PAINXQ", "B007Q4VP9I", "B007WAO0AM", "B005EC3REU", "B0056K5CKW", "B009HK30V0", "B0069QZIVU", "B005ELW77E", "B0045FM6SU", "B007Q4WMSG", "B006ENZXCM", "B0056QBXKY", "B00CBYXJ1U", "B007LI2QJW", "B0067PLNRQ", "B009WIW5VS", "B008F4NL04", "B0057IN4N0", "B0058OTXK6", "B004ZMICYA", "B005HIS6Q0", "B006X0ZYQ6", "B007QUHFGY", "B004SBI2PW", "B006XGCQ2U", "B0055D67HW", "B0093OWEOE", "B008O0WQF0", "B005HIS6RO", "B007M50PTM", "B0055UBTSW", "B00BCPIFC2", "B007ZE257U", "B00FA9ACIG", "B0058LUHYA", "B006NVLDKG", "B007P4VOWC", "B0051OKCHG", "B0055D66V4", "B007SHJIP6", "B007Q4W47A", "B008CBUW02", "B005ORQ350", "B002QCGLHQ", "B0051OKO42", "B004V949OO", "B0082PRPIA", "B0074WP29G", "B005IOLZIY", "B004QZASJ8", "B005GYDJEY"], "bought_together": ["B004U78628"], "buy_after_viewing": ["B007GJR7GS", "B00FFJ0HUE", "B007LI1UOE", "B008G2GBN4"]}, "categories": [["Electronics", "Computers & Accessories", "Tablets"]]}