{"asin": "B000EBK3FW", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The Panasonic Leica DMC-FZ7K 6MP Digital Camera with 12x Optical Image Stabilized Zoom features a Leica DC Vario-Elmarit Lens with a remarkable 12x optical zoom, equivalent to a 35 to 430 millimeter lens on a 35mm film camera. While a film camera with an optical zoom this powerful would be so big and heavy you couldn't handle it with one hand, the digital Panasonic Leica DMC-FZ7K small, lightweight and easy to handle. It also has Panasonic's Extended Optical Zoom feature. While causing minimal deterioration by using the center part of the high-resolution CCD, this function magnifies the image to give you total zoom power of 17.5x -- roughly equivalent to a huge 1680 millimeter lens on a 35mm camera.The camera also features Panasonic's advanced MEGA Optical Image Stabilizer, which helps eliminate blurry pictures. Jitter from shaky hands is one of the main reasons why cameras produce blurry images. The Panasonic Leica DMC-FZ7K has a built-in gyrosensor that detects any hand movement and relays a signal to a tiny microcomputer inside the camera, which instantly calculates the compensation needed. A linear motor then shifts the Optical Image Stabilizer lens as necessary to guide incoming light from the image straight to the CCD. You won't even notice it working; all you'll see are the outstanding results!The Panasonic Leica DMC-FZ7K also features a large, 2.5-inch diagonal LCD and a Power LCD function. Simply touch the power LCD button, and the display becomes about 40 percent brighter for easier viewing on sunny days. The camera also has the world's first developed high-angle LCD feature, which makes it easier to check the LCD when you need to hold the camera high over a crowd to take a shot. The large LCD lets you check the focus, frame the shot, and use functions like 25-thumbnail display and calendar view in comfort, with no eye strain. In addition, Panasonic has aligned the electronic viewfinder and LCD along the same line of sight to minimize differences in the images you see when framing shots.With mega-burst consecutive shooting, you can snap off up to 14 consecutive shots at a swift 3 frames per second in standard mode. The camera also has unlimited consecutive shooting, so you can keep on shooting until the SD memory card is full.The joystick on the back of the camera gives you quick, easy and accurate manual focusing. You can also use the manual focus assist function, which helps you set a perfect focus by magnifying the center of the LCD image and displaying a bar graph of the focal distance and depth of field. The joystick also makes it easy to manually adjust the exposure and focus. You can set the aperture, shutter speed and focus with your thumb while framing the shot on the LCD monitor. Press and hold down the joystick, and you can also instantly change four key settings -- white balance, ISO sensitivity, image size, and image quality -- while viewing the subject on the monitor. There's no need to switch to the menu screen.What's in the BoxDMC-FZ7K digital camera, battery charger, battery pack, SD memory card (16 MB), lens cap, lens hood and adapter, AV cable, USB cable, and strap.", "title": "Panasonic DMC-FZ7 6MP Digital Camera with 12x Optical Image Stabilized Zoom (Black)", "price": 396.0, "salesRank": {"Camera &amp; Photo": 10826}, "imUrl": "http://ecx.images-amazon.com/images/I/415QZXNWRTL._SX300_.jpg", "related": {"also_viewed": ["B006ZNYSX6", "B004W4FZJG", "B000MWVMRG", "B002IKLJU0", "B000TM7GD8", "B00DY2Y28M", "B003WJR68U", "B006YP41I2", "B0034XIMG4", "B0011ZK6ZM", "B008MB6YX6", "B003WJR694", "B000GHVZQ0", "B0035WTVZA", "B005F25IL4", "B001G5ZTZO", "B001QFZMCO", "B000A7XSSY", "B008MB6ZX0", "B00176BDD4", "B004HO58NO", "B003ZSHNG8", "B001CCLBSU", "B00168NDQS", "B00141I44I", "B009WS2NGK", "B006ZP42U8", "B0031RGEVS", "B00395WIXA", "B003WJR69E", "B0035JD0DW", "B001PK8FHE", "B0012NYJ1U", "B00ANQD52Q", "B000Q3043Y", "B00HZDAUOQ", "B005058BTW", "B006ZOU9P6", "B005KBB79C", "B001CCNDK4", "B0009JPRE6", "B00ATE7SZM", "B00ATM1NAU", "B0034XFG86", "B008V0H284", "B000ENN9BK", "B00908BQCY", "B0068OPUYI", "B000E0DZH6", "B004J2LMJ8", "B0090NZSM8", "B004FLL53Q"], "buy_after_viewing": ["B004XA9QQW", "B006ZNYSX6", "B004W4FZJG", "B00168NDQS"]}}