{"asin": "B0012GK3MQ", "description": "These elegant portable drives are simple to use, light and easy to carry, and require no power adapter -- they are powered directly through the USB cable.* Works with Windows&reg; and Mac&reg;. Synchronize files between home and office and encrypt everything on the drive for added security.Key FeaturesSleek and colorful- This beautiful portable drive, available in eleven eye-catching colors, is light and easy to carry and fits smoothly in your hand or pocket.USB powered- Powered directly from the USB port on your PC. No separate power supply is needed*.Synchronized and secure- Plug My Passport into any PC, edit files, read e-mail, and view photos. Then sync all of your changes back to your home or office computer. Your data is protected with 128-bit encryption. (Windows only)Compatible- Use with Windows&reg; and Macintosh&reg; computersIncludes Google&trade; software- Search your drive, manage your photos, and simplify Web searches with included Google software. (Windows only)* An optional cable is available for the few computers that limit power from the USB port.Ideal ForStoring or backing up your digital music, videos and photos.Carrying important files and e-mail between work and home or on the road and keeping them in sync.Sharing large files between office and home, between PC and Mac.Pick from multiple colors to express your unique style.System RequirementsWindowsAvailable USB portWindows 2000/XP/Vista&trade;MacintoshAvailable USB portMac&reg; OS X 10.4.11+Compatibility may vary depending on user's hardware configuration and operating system.Package ContentsMy Passport Essential portable hard driveUSB 2.0 cableQuick Install GuideWhich external drive interface is the right choice: USB, FireWire, eSATA, or Gigabit Ethernet? The right choice depends on compatibility with your computer and how you want to use your device. First, look at the connections on your computer.Note:For convenience and flexibility, choose a WD hard drive        with both USB and FireWire interfaces(available in dual and triple interface configurations) or with both USB        and eSATA interfaces.", "title": "Western Digital My Passport Essential 250 GB USB 2.0 Portable External Hard Drive (Midnight Black)", "price": 59.95, "imUrl": "http://ecx.images-amazon.com/images/I/3101Ypm5VhL._SY300_.jpg", "related": {"also_viewed": ["B006B9B2PQ", "B006Y5UV4U", "B004CG4WOI", "B006Y5UV36", "B0012GQZZU", "B006Y5UPZU", "B003ART0LK", "B002KC55OM", "B00A2WV5Z0", "B0085JRRAY", "B009R66E9O", "B005J7YCHG", "B002MQFU3C", "B00CI3BISU", "B002KG2LOA", "B006Y5UQ3G", "B0041OSAZS", "B00EAS8AA0", "B0091G8J5W", "B006Y5UQ3Q", "B00EAS8I3O", "B000EVOOO8", "B0091G9N4S", "B00D695IF4", "B001FA064E", "B00EAS8IYI", "B001FWIDWY", "B00CGUMVHW", "B002JSQ97Y", "B00834SJSK", "B00D4IO24U", "B00CGUMUK0", "B006Y5UV2M", "B00EAYFX54", "B0041OSQ9S", "B006Y5UQ4U", "B002COI60I", "B005J7YA4G", "B005EH0IK6", "B002CZQ4GU", "B005J7YA64", "B00CGUMUIC", "B004SGJCCO", "B0091GA5L8", "B00CO1I29O", "B0062FZ3PY", "B0043C8STG", "B000VZCEUI"], "buy_after_viewing": ["B005J7YCHG", "B00EAS8AA0", "B003LSTD38", "B00CI3BISU"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]]}