{"asin": "B0001G6U5M", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Updating the popular S400 Digital Elph, Canon's PowerShot S410 is both elegant and powerful. It features a 4-megapixel sensor, 3x optical zoom, and movie mode for videos of up to three minutes. Elegantly designed and super compact, the S400 has a protective stainless steel shell with a celabrite finish, which mixes metals and ceramics to produce a tough cool-toned exterior that is visually stunning. It also features Canon's new Print/Share button, which helps you quickly connect directly to a printer or send an image via e-mail.Optics and ResolutionThe 4-megapixel PowerShot S410 can capture 2272 x 1704 images for photo quality 11 x 14 print enlargements. It also has 1600 x 1200, 1024 x 768, and 640 x 480 resolution modes. The 3x optical zoom lens has a focal length of 7.4-22.2mm (35mm equivalent: 36-108mm). It also has a 3.6x digital zoom.Movie ModeThe PowerShot S410 features 3-minute QVGA (320 x 240) or QQVGA (160 x 120) movie clips with sound recording, full playback and in-camera cutting and editing. Individual video clips are limited to three minutes in length.More Camera Features9-point Artificial Intelligence autofocus (AiAF) for fast and sharp images, even with off-center subjects1.5 inch low-temperature polycrystalline silicon  TFT color LCD (118,000 pixels)Real-image optical zoom viewfinderBuilt-in flash with auto, red-eye reduction, and slow sync modesRecord a voice memo of up to 60 seconds and attach to imagesShutter speed: 15 - 1/2,000 secondsWhite balance control: Auto, pre-set (daylight, cloudy, tungsten, fluorescent, fluorescent H), or custom white balanceContinuous shooting: 2.5 frames (maximum 5 images)2x to 10x zoom into captured images while reviewing via the LCDCanon Technology FeaturesDigic Imaging Processor:While much technical discussion of digital cameras centers around the optics and the CCD sensor, the complex task of image rendering is the job of the image processor--the \"brains\" of a digital camera. Canon's latest, exclusive DIGIC Imaging Processor significantly enhances digital camera performance in numerous areas. DIGIC's high-speed signal processing is combined with high-capacity buffering to give Canon digital cameras fast response and continuous shooting capability unmatched by other digital cameras. DIGIC delivers longer battery life and beautiful, rich color rendition with far fewer white saturation problems. And DIGIC's unequaled precision delivers clear, noise-free images that are demonstrably superior.iSAPS Technology:Canon iSAPS (Intelligent Scene Analysis based on Photographic Space) technology dramatically improves the performance of AF (Autofocus), AE (Auto Exposure), and AWB (Auto White Balance). By analyzing a huge volume of photography data, accumulated over 60 years and the manufacture of over 150 million cameras, Canon engineers arrived at statistical relationships among focal length, focus distance, scene brightness, and other factors. Equipped with this \"fore knowledge\" Canon PowerShot cameras can optimize AF/AE/AWB settings for any given scene more rapidly and more effectively.Multi-point AiAF:Canon's wide-area, multi-point AiAF (artificial intelligence autofocus) automatically selects one or more focusing points based on factors, such as subject position and motion. AiAF works in conjunction with iSAPS Technology to more quickly and accurately achieve autofocus under a wide variety of shooting conditions. You get fast, accurate AF whether you hold the camera horizontally or vertically, with stationary or moving subjects, with off-center subjects, and even in low-light/low-contrast lighting.Direct Printing/SharingThe PowerShot S410 introduces a new Print/Share button that speeds and simplifies printing to compatible Canon and PictBridge enabled printers and one-touch image transfer to Windows XP, Me, 2000, and 98 computers for use with image processing programs, uploading to the Internet, or placement in e-mail. When connected to a Canon Compact Photo printer, a Movie Print mode divides the selected clip into equal parts and prints thumbnails of a maximum 63 equally spaced frames onto a single sheet of Postcard Size Paper.Storage and TransferImages and video are stored on CompactFlash memory cards (Type I only) and the included 32 MB card holds approximately 21 images at the Large/Fine setting.  Images can be downloaded to either a Mac or PC via USB 1.1 connectivity, which means the camera can be connected to any USB-based Windows Me/2000/XP and Mac OS 8.6 or later computer without installing any software.Power and SizeThe camera is powered by rechargeable lithium-ion battery (NB-1LH). With the LCD on, you will get approximately 190 shots. It measures 3.43 x 2.24 x 1.09 inches and weighs 6.5 ounces (without batteries).What's in the BoxThis package contains the PowerShot S410 digital camera, 32 MB CompactFlash memory card, rechargeable lithium-ion battery (NB-1LH), battery charger (CB-2LS), USB and A/V cables, and wrist strap. The supplied software on the CD-ROM includes browsing and printing software ZoomBrowser EX (Windows) and ImageBrowser (Mac). Other software includes PhotoStitch, plus photo and movie manipulation software ArcSoft PhotoStudio and VideoImpression.", "title": "Canon PowerShot S410 4MP Digital Elph with 3x Optical Zoom", "price": 14.95, "salesRank": {"Camera &amp; Photo": 9820}, "imUrl": "http://ecx.images-amazon.com/images/I/51XFW3KRQ9L._SY300_.jpg", "related": {"also_viewed": ["B001O1GEU4", "B0075SUJBA", "B0001G6U5W", "B00HLDFPA4", "B00DRG0AKY", "B004M8SVEI", "B000P6I4XO", "B0075SUHA8", "B000Q30420", "B0036ORZBO", "B00AWYN0BU", "B00AWYN0ME", "B003VTZE1M", "B00B5HE2UG", "B00B5HE2MO", "B00I8BIBCW"], "buy_after_viewing": ["B0033ZLS8W", "B003VTZE1M", "B000UZL0YU", "B000P1O73A"]}}