{"asin": "B000062VUO", "related": {"also_bought": ["B0083J8DZE", "B008I648B0", "B004LU1U2M", "B007S3T4O0", "B000JE9LD4", "B00D6BYDGC", "B0007A29UC", "B00CO8TBQ0", "B007WTHGL8", "B000I23TTE", "B007NJ0S1W", "B0036E8V08", "B002HWRJBM", "B000OQ21CA", "B004VM1T5S", "B00E3W1726", "B004LTEUDO", "B0040FJ27S", "B000J2EN4S", "B009UEBQIM", "B0043WCH66", "B00E3W16OU", "B009SJR28W", "B009ZN2NH6", "B0060B7NCG", "B00E3W19MO", "B005T3GRLY", "B001T7QJ9O", "B0098HR0RC"], "bought_together": ["B0083J8DZE"], "buy_after_viewing": ["B003VAHYTG", "B0027VT6V4", "B0030ZLZ5G", "B00CD1PTF0"]}, "title": "Klipsch ProMedia 2.1 THX Certified Computer Speaker System (Black)", "price": 183.98, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41kgImde1TL._SX300_.jpg", "brand": "Klipsch", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]], "description": "The ProMedia 2.1 THX-Certified, three-piece computer audio system from Klipsch transforms your desktop into a high-performance audio entertainment center. Two 35-watt satellite speakers deliver full-bodied stereo sound, while a floor-thumping 130-watt subwoofer provides low-end slam from your favorite music, games, and movies, reaching down to an impressive 31 Hz.The satellites' exclusive Klipsch MicroTractrix horn maximizes clarity and high-frequency dispersion from CDs, MP3s, streaming radio programs, and other audio. The high-output, digital-hybrid-amplifier-driven ProMedia 2.1 offers a convenient headphone jack and dual stereo analog inputs, one for a more or less hard-wired connection from your computer's line or headphone output jack, the second to accommodate a portable audio device such as an MP3 or minidisc player/recorder.Klipsch operates with a philosophy that demands accuracy in every aspect of sound reproduction, which--in the case of the ProMedia 2.1--has resulted in THX Certification. THX is an exclusive set of standards established by the world-renowned film production company, Lucasfilm Ltd., and products undergo rigorous quality and performance tests in order to receive this certification.What's in the BoxTwo satellite speakers, one subwoofer, two 9.5-foot lengths of speaker cable (22 gauge), a user's manual, and warranty information."}