{"asin": "B002I3OZ7G", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]], "description": "Logitech Rechargeable Speaker S315i&#8212;up to 20 hours of music from your iPod or iPhone, at home or on the goDigital music has revolutionized how you listen to music, because you can listen to your favorite songs anywhere. The Rechargeable Speaker S315i will blow you away with 20 hours of music when you use the power-saving mode. That's a full day's (or night's) worth of music without missing a beat. This little beauty powerfully reproduces your favorite songs with accurate highs and every note will be heard loudly and clearly. A custom, full-range driver brings you crisp, sharp sounds. And since it's rechargeable, this is a sleek and stylish speaker and goes with you wherever you go. You can play and charge your iPod or iPhone with a dock connector. The result is a product that makes the most of your music. Go ahead. Play a song or two ... or 300 ... without recharging.Key FeaturesThe battery is rechargeableListen to your music for up to 20 hours (in power-saving mode) without missing a beat. Play hundreds of songs without interruption.Slender, portable designThe slender, portable design makes it easy to take with you&#8212;around your house or around town.Made for iPod and Works with iPhonePlay and charge your iPhone and any iPod model with a dock connector. That's how easy it is to play your favorite songs anywhere you go.Custom, full-range driversAccurately reproduces the highs and lows of your most-played songs, so you'll hear every note loudly and clearly.Auxiliary input is at your fingertipsNo iPod? No worries. Listen to any computer, MP3 or portable DVD player that has a standard 3.5 mm stereo jack.Check Out Other Stylish MP3 Speakers From Logitech:", "title": "Logitech Rechargeable Speaker S315i with iPod Dock", "price": 47.99, "imUrl": "http://ecx.images-amazon.com/images/I/41z6UiyrYmL._SY300_.jpg", "brand": "Logitech", "related": {"also_bought": ["B008R68DFS", "B003VANOI6", "B009A5EIWC", "B001F7AHOG", "B00B9DQ2QI"], "bought_together": ["B008R68DFS"], "buy_after_viewing": ["B003VANOI6", "B009CWRVH2", "B0038W0N8G", "B003SX0NG2"]}}