{"asin": "B001TH7GUU", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Cables & Interconnects", "USB Cables"]], "description": "The AmazonBasics USB 2.0 A-Male to A-Female Extension Cable with Gold-Plated Connectors lets you extend your USB connection by 9.8 feet and offers full performance for all your USB devices. If you need a longer USB 2.0 cable to connect a peripheral that's out of reach of your computer, this extension cable is just what you're looking for.Recommended Uses:Extending USB connections by 9.8 feet between your computer and devices, such as printers, digital cameras, and external hard drivesGives you the added ability to move away from your desktop while using your VoIP phone or mouseTechnical Specifications:Connector Type: USB Type A Male, USB Type A FemaleCable Length: 9.8 ft./3.0 mTransfer Rate: 480 MbpsWarranty: AmazonBasics 1-Year LimitedWarranty[PDF]Documentation:Helpful Hints[PDF]USB Extension Cable for ConvenienceWhether because of space, convenience, or d&eacute;cor, sometimes you need a longer USB 2.0 cable. If you need to extend the reach of your USB peripheral--such as a mouse, VoIP phone, or printer--this 10-foot extension cable from AmazonBasics is the answer. Just add this extension cable for an extra 9.8 feet of convenience.The cable features a Male A connector on one end and a Female A connector on the other. Typically, the Male A connector plugs into your computer and the Female A connects to the cable you need extended. Check your device manuals to make sure this is the connector you need.The AmazonBasics USB 2.0 Extension Cable supports the full 480-Mbps transmission speed of the USB 2.0 standard, so you can take advantage of the full performance of your peripherals and devices.Shielding Maintains Signal QualityThe AmazonBasics USB 2.0 Extension Cable features shielding that provides protection against noise from electromagnetic and radio-frequency signals, keeping your signal clear with less loss of bandwidth for higher performance.Gold-Plated Connectors for PerformanceThe extension cable also features gold-plated connectors that resist corrosion for signal purity.AmazonBasics: Quality Products at Low PricesAmazonBasics is a collection of consumer electronic \"basics\" created by combining quality and low prices for an overall focus on value.Amazon Frustration-Free PackagingThis AmazonBasics product features Amazon Frustration-Free Packaging that is recyclable. It comes without excess packaging materials such as hard plastic clamshell casings, plastic bindings, or wire ties. The packaging is designed to be opened without the use of a box cutter or knife, and it will protect your product just as well as traditional packaging. Products with Amazon Frustration-Free Packaging can frequently be shipped in their own boxes, without an additional shipping box, saving on resources and reducing waste. In addition, the packaging materials that we do use are easily and frequently recycled, composted, or reused by our customers, and all the inks and dyes are biodegradable.Warranty and Helpful HintsThis cable is backed by an AmazonBasics 1-year limited warranty. To view the full AmazonBasics warranty,click here. If you are having trouble connecting your components with this cable,click herefor the AmazonBasics USB Helpful Hints Guide [PDF].What's in the BoxMulti-Shielded USB 2.0 A-Male to A-Female extension cable (9.8 feet / 3.0 meters) and warranty card.", "title": "AmazonBasics USB 2.0 A-Male to A-Female Extension Cable - 9.8 Feet (3 Meters)", "price": 5.79, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41AOpRT%2B4wL._SX300_.jpg", "related": {"also_bought": ["B004OAFO0I", "B006JH8T3S", "B00BWF5U0M", "B003M0NURK", "B001TGTDFM", "B00CRJWW2G", "B008EQYRRY", "B00008NG7N", "B0096KSBB0", "B000165O18", "B00BCWALHM", "B00BFZG3B4", "B001TH7GUK", "B00DQFGJR4", "B003VWU2WA", "B00000JDF8", "B00K11RI6W", "B009UEBQIM", "B006LFL4X0", "B003ES5ZSW", "B001MSU1FS", "B003L137Y6", "B00004Z5UM", "B0001Y7T5Y", "B0069A75JE", "B0083I7Y8W", "B0069A6UNQ", "B002O0KM6G", "B00B3OA7R8", "B00BCWA6TK", "B003LVZO8S", "B002W8EDOM", "B0007UVRVO", "B009WA2NKY", "B007SHJIO2", "B002VA464S", "B001MSZBNA", "B00DH1KTPK", "B003L1ZYYM", "B00C28L5UW", "B00G500AE0", "B004CFDJ2A", "B003N9TYW0", "B00HBN6T1I", "B004QRKWLA", "B003L1ZYYW", "B004AGX4YO", "B00GU8OIYA", "B000KZW9WM", "B004FHO5Y6", "B003VAHYQY", "B00AQUO5RI", "B0073FCPSK", "B005H3I38Q", "B004ABQAFO", "B004W88SBE", "B00CXLCMGY", "B001TH7T2U", "B001MSU1HG", "B004YW7WCY", "B009WA7EVC", "B008R5J51U", "B002NURRL0", "B007NJ0S1W", "B003XN24GY", "B005HKIDF2", "B00BMRSDIQ", "B003M6FDS8", "B00802O1JQ", "B001E1Y5O6", "B00416Q5KI", "B00GLZYG6M", "B0006LSISO", "B00483WRZ6", "B00CJHXY0U", "B00BP5KOPA", "B00BFZ18O6", "B002CSRF9M", "B006Z0Q2SI", "B00005113L", "B00906E03I", "B00E9IF9RI", "B008L3UUPS", "B00001ZWXA", "B004WO8HQ4", "B0051T1SJC", "B004431UBM", "B000Q8UAWY", "B00ELJVM5I", "B005H3Q5E0", "B002YVD3KM", "B00008VFBE", "B002OOWB3O", "B004C9M7UG", "B003MAZY6A", "B002FFT8Z6"], "bought_together": ["B00BWF5U0M"], "buy_after_viewing": ["B003L137Y6", "B00BWF5U0M", "B001MSU1FS", "B008EQYRRY"]}}