{"asin": "B008BH5D6K", "related": {"also_bought": ["B008BH5D56", "B00GFNCX24", "B00B84JQSE", "B00BVY4HCG", "B00BVY4HGM"], "also_viewed": ["B00B84JQSE", "B008BH5D56", "B003JTLKIA", "B00G3YIE2I", "B00BVY4HCG", "B00IXFD7KO", "B00CS0W6X4", "B00FZHUMHY", "B00BT995O8", "B00GFNCX24", "B00IXFD7TK", "B003JNYULA", "B0025VKUPM", "B00DU3DWV8", "B005E8MVXM", "B0011UNMIK", "B00D7LN7M2", "B00FZHUMH4", "B00605HN04", "B0025UHKNS", "B00K2SE3RQ", "B003P65RVI", "B00FFJ2X4W", "B00FBYY5UG", "B003J2V8AC", "B00DU41YQM", "B008LQPHZI", "B00AJZ961A", "B0045ZPVB4", "B00FZHUMQK", "B0071CK2H6", "B00GWBDMW4", "B005IYSAOQ", "B0011UK35K", "B00BNQCSB4", "B005PQZTAA", "B00IJVX0U4", "B00BT6NZJ2", "B0046BTK14", "B00LIKP9RA", "B00LIKQ2YO", "B00FBYY6CI", "B00AHPP84Q", "B004XC3MXI", "B005R4QU26", "B00D7LNAX8", "B00GZJOVA0", "B0090C7A5M", "B005Y77K7A", "B005Y77K3E", "B00LIKPJPM", "B00FZHUGY8", "B00I31USKK", "B00JKUCLNU", "B00JQF6HHU", "B00D7LN7K4", "B00D7LNAN8", "B00D7LN7PO", "B00LIKOFDE", "B0086KP1I2"], "bought_together": ["B008BH5D56", "B00BVY4HCG"]}, "title": "Runtastic GPS Sports Watch with Heart Rate Monitor", "price": 162.0, "salesRank": {"Sports &amp; Outdoors": 99728}, "imUrl": "http://ecx.images-amazon.com/images/I/41V2372OquL._SX300_.jpg", "brand": "Runtastic", "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Running GPS Units"]], "description": "Runtastic GPS WatchThe Runtastic GPS Watch and Heart Rate Monitor offers much more than simply measuring your heart rate. It also has an electronic compass and GPS navigation mode. The watch mode includes a dual time display to view two time zones and an alarm you can set to wake you up in time to get in an early morning workout. Although this watch is packed full of features, it's easy to use and to customize to reach your fitness goals.Choose your sport running, cycling, hiking, sailing, etc. The watch sets up the recommended heart rate zones to achieve the goal. Or, easily customize the heart rate zones for your fitness level and training. Customizing the three training screens for each sport is simple when you connect the watch and use the Runtastic Connect (for Mac or Windows) software on your computer. Pick from 23 different types of data including heart rate and speed averages, maximums, lap times and much more. Track your speed, pace and heart rate and see how it is affected by elevation gain/loss, distance and time. Rechargeable battery lasts up to 16 hours to handle long bike rides, marathons and other all day training. Connect the USB charging/data cable to your computer to easily upload stats to the Runtastic.com where you can track your workout progress.Review Statistics, Routes, and Share Activities on Runtastic.comUsing the Runtastic Connect software, you can review all your workout data on Runtastic.com and share your activities on your favorite social media sites including Facebook, Twitter, and G+.Mapped Routes with StatisticsStats and Charts"}