{"asin": "B00CGVF8E4", "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Cases & Sleeves", "Cases"]], "description": "Fintie, a quality product within your reach.Protect your new Samsung Galaxy Note 8.0 tablet with this Fintie SmartShell Case at all times! The SmartShell Case sports a simple and classy design. The back shell is made from durable polycarbonate material so you do not need to worry about any damages. It offers an easy clip-on application. Because the cover is uniquely designed to flip back and transform the case into a comfortable viewing stand that offers two different viewing angles, this capability allows the viewer to use the tablet hands-free whatever your position may be without strain whether it is being used for viewing or for a keypad. All features of the tablet are accessible even with the case on. It even includes a camera hole so you can take pictures and videos without removing it. Watch movies and listen to music clearly with speaker holes! This one piece case will fit your tablet like a glove. The Fintie SmartShell Case comes in a variety of bright, fun colors, the widest selections to suite your taste. It offers an ideal way to protect your tablet wherever go.PLEASE NOTE:Colors shown in pictures may slightly differ from actual product due to lighting and color settings.This product is sold exclusively by Fintie. Only buy from Fintie to get genuine Fintie(TM) products with manufacturer warranty and superb customer service.", "title": "Fintie Samsung Galaxy Note 8.0 Case Cover - Ultra Slim Lightweight Stand Smart Shell with Auto Sleep/Wake Feature, Black", "price": 14.95, "salesRank": {"Cell Phones & Accessories": 7056}, "imUrl": "http://ecx.images-amazon.com/images/I/51PVQ1G82eL._SY300_.jpg", "related": {"also_bought": ["B00C9V5FGC", "B00C19UTTU", "B00BQH8UEY", "B00C19V4NA", "B00CHPGX5W", "B00DWKCBUM", "B00DWJJVZQ", "B00C9HYRNI", "B00F1U5Z3G", "B00E5L4UFQ", "B00C3V9MJO", "B00BTZGCPM", "B00BLLX9CI", "B0076Z3GMG", "B00DO47NCC", "B00BXQUQOU", "B009QZH6JS", "B00GYTUCW2", "B00JM6L0ZC", "B00EULPX34", "B00DH204KY", "B00C321V2Y", "B00C9HYTVS", "B00BY11I9G", "B00C31VX5A", "B00CXO9O9E", "B00C321TGC", "B00D99UD7E", "B00F0NMDZW", "B009QZH7BU", "B004M5QPBM", "B00IVPU7AO", "B009QW3SGQ", "B00CSMYBFS", "B00GQR329M", "B00DZIV8JQ", "B00C2B7OCW", "B007XZM6VG", "B00E1XI6L2", "B00B4NFEY4", "B00IIHNVF8", "B00IVPU786", "B00JBJ3JAE", "B00JFIO66M", "B00DZOHGJG", "B00ID1HPU6", "B003WGJYCY", "B00DCICXMU", "B00FEYJOTK", "B00DVVJ7BS", "B00BKW2410", "B00GSK46D8", "B00BT7RCEK", "B00CBSDS9Y", "B0089VO7MY"], "bought_together": ["B00C19UTTU"], "buy_after_viewing": ["B00BTZGCPM", "B00C19UTTU", "B00BS25F90", "B00C9V5FGC"]}}