{"asin": "B002A6G3V2", "description": "The Intel Core i7-950 processor combines the power of four 3.06 GHz computing cores into a single processor, guaranteeing enough processing power for the most demanding applications. With 8 MB of smart cache, the Core i7-950 processor ensures that you get maximum responsiveness from your system, even when several intensive programs run simultaneously. Compatible with motherboards based on the Intel X58 Express chipset, the Core i7-950 processor takes your computing and gaming experience to the next level.Intel Core i7-950 Processorfeatures:Four 3.06 GHz cores for better multitasking and multithreaded performance.8 MB of smart cache.Integrated memory controller delivers higher memory bandwidth.Quick Path Interconnect provides fast data transfer between the processor and chipset.With four cores in one processor, users will experience better multitasking and multithreaded performance.The Intel Core i7-950 processor delivers unmatched performance for demanding tasks.View larger.Powerful New Microarchitecture Eliminates SlowdownThe i7 family is Intel's flagship processor, and for good reason. With the i7 family, Intel engineers invented a revolutionary new style of microarchitecture. They replaced the front side bus -- a longtime staple of processor design -- with a new technology called QuickPath Interconnect (QPI). Using QPI, the Intel Core i7-950 processor achieves unprecedented levels of bandwidth, and can use its four computing cores to their maximum potential.To put it simply, users will enjoy faster and more streamlined processing than ever before. Your computer will handle multiple projects and applications without the slowdown you'd experience with a lesser processor.Extremely intensive programs like high-definition media editors will run more smoothly and responsively. And you'll be able to experience next-generation games without frame-rate hiccups and slowdowns.New Technologies Boost PerformanceThe Intel Core i7-950 processor also makes use of several other cutting-edge technologies:Turbo Boost Technology allows the processor to run up to 133 MHz faster when it's operating below power/thermal limits.Hyper-threading Technology enables more efficient use of processor resources, making the most of highly threaded software like media players and next-generation games.Smart Cache Memory increases available RAM resources, leading to less lag while multi-tasking.Media Editing and Sharing Easier than EverWhether editing high-definition videos, touching up family photos, or splicing up music, the Intel Core i7-950 processor provides the processing power needed. The processor's four cores are optimized to keep up with the most advanced digital editing software. It also accelerates DVD encoding and compression, allowing you to easily share your HD home videos with everyone.Unparalleled Gaming PerformanceWith the advent of next-generation games, PC gaming is more immersive than ever. The latest games take advantage of multi-threaded programming, allowing for more realistic graphics, physics, and artificial intelligence (AI). But you need more than just a good graphics card with high GPU output to fully experience all these effects. Underlying the visual realism and advanced AI scripts are thousands of high-speed calculations that your CPU must process.Fortunately, the Intel Core i7-950 processor is specifically designed to handle these calculations. Using multi-thread architecture, it has the ability to process thousands of graphical characteristics at once, resulting in a smooth and lag-free experience. Intel worked closely with CryTek -- the developers of the advanced game engine behind such games as Crysis and Far Cry -- to guarantee that gamers have an immersive and lifelike experience.The Intel Core i7-950 processor is backed by a three-year limited warranty.Intel Core i7-900 Processor SeriesIntel Core i7-975 Processor Extreme EditionIntel Core i7-950 ProcessorIntel Core i7-920 ProcessorProcessor Frequency3.33 GHz3.06 GHz2.66 GHzIntel Smart Cache8 MB8 MB8 MBIntel Turbo Boost TechnologySingle-core performance up to 3.6 GHzSingle-core performance up to 3.33 GHzSingle-core performance up to 2.93 GHzNumber of Simultaneous Threads8 (With Intel HT Technology)8 (With Intel HT Technology)8 (With Intel HT Technology)Processor Integrated Memory ControllerYesYesYesNumber of Memory Channels3 (DDR3 1066 MHz)3 (DDR3 1066 MHz)3 (DDR3 1066 MHz)Intel X58 Chipset MotherboardDX58SODX58SODX58SOSocketLGA1366LGA1366LGA1366", "title": "Intel Core i7-950 3.06 GHz 8 MB Cache Socket LGA1366 Processor", "price": 168.95, "imUrl": "http://ecx.images-amazon.com/images/I/31DNdtDrquL.jpg", "related": {"also_bought": ["B000OGX5AM", "B001NJ0D0Y", "B004CRSM4S", "B00A7WW3E2", "B0020MLPAU", "B007YDJJFS", "B0036Z6GH2", "B0007TOR08", "B004RPS010", "B002W4M0DW", "B000HKDA0U", "B002BH3Z8E", "B009ZN03AA", "B003X242PQ", "B005O65JXI", "B00E3W1726", "B00CXIVEA2", "B006EWUO22", "B0057Q4ADU", "B0088PUEPK", "B005T3GRNW"], "bought_together": ["B000OGX5AM"], "buy_after_viewing": ["B000OGX5AM", "B00CO8TBQ0", "B005O65JXI", "B001H5T7LK"]}, "categories": [["Electronics", "Computers & Accessories", "Computer Components", "CPU Processors"]]}