{"asin": "B000V1XICU", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "From the very first glance, the smooth shape and bold lines of the stylish PowerShot SD870IS Digital ELPH signal that this is no ordinary camera. With 8.0 megapixels of resolution, an Optical Image Stabilizer, and 3.8x optical zooming, the SD870IS Digital ELPH boasts impressive specs as well as a host of convenience features. Face Detection Technology for worry-free people shots. A large 3.0-inch LCD to give you a perfect view of your scene. The Auto ISO Shift and ISO 1600 deliver brilliant images in challenging lighting.PowerShot SD870IS Highlights3.8x optical zoom in actionStylish dual-tone 8.0-megapixel Digital ELPH in two elegant colorsYou deserve a camera as individual as you are. That's why the PowerShot SD870IS Digital ELPH is available in a choice of two head-turning models. Select from your choice of the impressive matte black or the sophisticated chrome silver front-ring design. Both feature a gleaming metallic body whose smooth, simple shape is handsomely contrasted with bold side lines. In addition, both also offer 8.0 megapixels of resolution so you get images with the high-degree of detail and richness of color that enables you to print, crop, and enlarge for maximum self-expression.3.8x wide-angle zoom lens to get more family and friends into one perfect photoWith a wide-angle 3.8x optical zoom lens equipped with Canon's advanced Optical Image Stabilizer Technology, you've got what it takes to capture astonishing, lavishly detailed close-ups with total confidence. Now you don't even have to worry about camera shake getting in the way of perfect pictures. Because even at maximum telephoto, the SD870IS Digital ELPH keeps you rock steady. So you can create images that are sharp, clear, and bright--just like you want them to be. You'll amaze yourself and others with what you can achieve with the SD870IS Digital ELPH.Large high-quality 3.0-inch PureColor LCD screen with wide viewing angleThe camera's 3.0-inch LCD screen gives you the big picture, whether you're shooting, reviewing, or showing off your images. This extra-durable, high-resolution screen with tough scratch-resistant coating on the anti-reflective, PureColor LCD screen offers a crisp, clear picture to make shooting, playback, and using the camera's menu functions especially convenient. Clear and bright, it also features Night Display for easy viewing in low light.Canon technology maximizes quality and performanceGenuine Canon Face Detection Technology sets the focus, exposure, and flash automatically, leaving you free to compose a group, capture an unguarded moment, or coax the perfect smile.Find multiple faces with Canon's improved Face Detection technologyDIGIC III features Face Detection technologies, giving the you best possible results in any shooting situation. Face Detection AF/AE sets the focus point and exposure for the faces of your subjects. Face Detection FE adjusts the flash to correctly illuminate your subject to provide the best balance between your subject and the overall scene, eliminating the common problems of over- and underexposed faces.With DIGIC III, your images boast superior quality, the camera operates at top efficiency and battery life is enhanced. What's more, DIGIC III enables Canon's Face Detection Technology and Red-eye Correction to give you better, more true-to-life people shots. Simply press the Shutter Button halfway down, and the camera automatically pinpoints the faces in the scene and chooses the ideal focus point. The camera controls exposure settings and flash to keep every face looking bright and natural. Red eyes can be corrected during playback.iSAPS Technology is an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the fast DIGIC III Image Processor to improve focus speed and accuracy, as well as exposure and white balance.Red-eye correction detects and corrects red-eye during playback. In unusual cases where red-eye is not automatically detected, it can easily be corrected manually during playback mode.The PowerShot SD870IS Digital ELPH features ISO 1600 and High ISO Auto settings that reduce the effects of camera shake and sharpen subjects in low-light situations, giving you greater shooting flexibility.17 Shooting Modes, Including 10 Special Scene ModesAdvanced presets for the best possible photos under certain conditions.The Complete Print SolutionPrint/Share Button for easy direct printing and downloading, plus ID Photo Print and Movie Print with select PIXMA Photo Printers, CP, and SELPHY Compact Photo Printers.The PowerShot SD870IS Digital ELPH's Print/Share button makes direct printing easier than ever. Simply connect the SD870IS Digital ELPH to a Canon CP, SELPHY, or PIXMA Photo Printer or any PictBridge compatible photo printer, press the lighted Print/Share button, and print! Also use the Print/Share button to transfer images to a computer (Windows and Macintosh).Print your own ID photos in 28 different sizes or use the Movie Print function to output multiple stills from a recorded movie on a single sheet with a Canon SELPHY Compact Photo Printer.What's in the box:PowerShot SD870IS Digital ELPH digital camera, lithium battery pack NB-5L, battery charger CB-2LX, 32MB SD memory card SDC-32M, wrist strap WS-DC2, Digital Camera Solution CD-ROM, USB interface cable IFC-400PCU, AV cable AVC-DC300", "title": "Canon PowerShot SD870IS 8MP Digital Camera with 3.8x Wide Angle Optical Image Stabilized Zoom (Black)", "price": 59.95, "salesRank": {"Camera &amp; Photo": 9366}, "imUrl": "http://ecx.images-amazon.com/images/I/413bE3VPnyL._SX300_.jpg", "related": {"also_viewed": ["B004HW73QQ", "B0012Y6AY8", "B004HW73QG", "B004HW73R0", "B0012YC7AE", "B0035FZJJ4", "B0075SUHKI", "B0075SUHQC", "B0075SUHWG", "B001SER47Y", "B004HW73RA", "B001SER492", "B0075SUI2A", "B000NK6J6Q", "B00B5HE1SY", "B0011ZK6PC", "B00B5HE3IW", "B00C7NX3MK", "B001SER48S", "B0075SUG8Q", "B00B5HE3NW", "B00B5HE3AK", "B0075SUHGC", "B0075SUH5S", "B000Q30420", "B0032JRRXE", "B004HW73OS", "B001PK8FHY", "B0073HSIY8", "B000AYKUUQ", "B0075T7NW2", "B003VTZE1W", "B003VTZE1M", "B000NK6INU", "B001O1GEU4", "B0090SLJ1C", "B00B5HE2MO", "B001SER47O", "B0075SUGQI", "B00AWYN182", "B00B5HE32I", "B001PKAFZO", "B0035FZJM6", "B00AWYN0BU", "B00HLDFPA4", "B004J3V8UU"], "buy_after_viewing": ["B000EVS4YE", "B007JRB0TC", "B00AWYN0BU", "B00C7NX3MK"]}}