{"asin": "B001D0IWEC", "description": "Achieve a fresh-from-the-salon look every day with the TRESemm&eacute; Philips Thermal Creations Hair Dryer. This styling product gives you professional results in the simplest, most user-friendly way without damaging your hair or leaving it frazzled. Designed to dry wet hair quickly and thoroughly, the Thermal Creations Hair Dryer also protects your strands, so your hair will look shiny and healthy after every use..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; }Get salon quality results in your own home with TRESemm&eacute; Philips.View larger.A cold shot lets you set your style.Ionic conditioning keeps your hair shiny.EHD+ Diamond Technology Cuts Hot SpotsThe ideal fusion of salon expertise and technological innovation, the Thermal Creations Hair Dryer features EHD+ Diamond Technology to help protect your strands. A nano-diamond coated air-outlet enables the dryer to distribute heat equally across the airflow. As a result, there are fewer hotspots on the hair. Additionally, hair dries in less time and more evenly. A true ceramic heater also provides gentle, radiant heat, and ionic conditioning reduces frizz and static. The result? An outstanding, get-noticed shine.Powerful Airflow To Save TimePowerful professional airflow achieves ultra-fast results, so you're ready to go in minutes. Boasting 1875 watts and six speed settings, the Thermal Creations hair dryer is an extremely efficient styling aid. There's also a cold shot button to set your style, and an ultra-slim professional concentrator nozzle that makes it easy to focus the heat on different sections, for a smoother, sleeker look.Professional Perks For At-Home UsePacked with features that a salon professional would love, but made for home use, the Thermal Creations dryer is very easy to use. Professional-style rocker switches let you pick the heat and power level that's best for your hair type and style. There's also a comfortable ergonomic handle for easy handling, a removable air inlet grill, and a hanging loop for space-saving storage. And a nine-inch professional cord lets you reach even hard-to-dry areas, for consistently beautiful results.The Thermal Creations hair dryer comes with one slim concentrator nozzle and one bottle of Heat Tamer Spray. It's backed by two-year warranty.What's in the BoxDryer, one slim concentrator nozzle, and one two-ounce bottle of TRESemm&eacute; Thermal Creations Heat Tamer Spray.", "title": "TRESemme Philips HP4990/05 Thermal Creations Hair Dryer", "imUrl": "http://ecx.images-amazon.com/images/I/41HKOV7jG1L._SY300_.jpg", "salesRank": {"Beauty": 540988}, "categories": [["Beauty", "Hair Care", "Styling Tools", "Hair Dryers"]]}