{"asin": "B00006F2MG", "description": "When the aroma of freshly brewed coffee--from freshly ground  beans--wafts into your bedroom in the morning, you won't need your  alarm clock. Preset this coffeemaker for your desired wake-up time, add  coffee beans to the grinder, and in the morning the beans are ground to  a medium grind and hot coffee awaits in the glass 12-cup carafe. You  can also program the machine to start brewing at the end of a dinner  party to avoid having to get up from the table, or to have hot coffee  waiting after a brisk winter walk. When making fewer than five cups of  coffee, use the 1-to-4-cups setting to improve extraction and heat;  coffeemakers without this setting often lack the time to heat up  properly, and coffee comes out cooler. A disposable charcoal filter  removes chlorine and odors from tap water, improving coffee flavor, and  should be changed every few months. Other features include a gold-tone  commercial-style filter (or use No. 4 basket-style paper filters);  capacity to use preground coffee instead of beans; 30-second Brew  Pause, which allows a cup be poured before brewing is complete; and an  audible tone to indicate the pot is ready. The grinder removes for easy  cleaning, and all removable parts can be washed safely in the upper  rack of a dishwasher. The Cuisinart Grind and Brew measures 15 by 8 by  7-1/2 inches, and comes with a three-year warranty.--Ann Bieri", "title": "Cuisinart DGB-500 Grind &amp; Brew, White", "imUrl": "http://ecx.images-amazon.com/images/I/41VDB8EVXJL._SY300_.jpg", "related": {"also_viewed": ["B000VTP45Q", "B001G8Y2X6", "B00006F2MI", "B001G8Y2WW", "B000T9SCZ2", "B000MTMP2K", "B00FO7DZ2Y", "B000TQEDDK", "B0001BMZ3S", "B00005IBX9", "B0000CFNE3", "B000T9XPHC", "B000VVTONW", "B0001IRRLQ", "B001NGO272", "B0000A1ZMS", "B00ISMQI0S", "B001NGO27W", "B000SSTX5M", "B005I72AXA", "B000153ZY2", "B0041847PQ", "B002C3T8Q0", "B002EVOVPI", "B000N22JPE", "B00E9I65HG", "B000TETMVK", "B000FFILPG", "B007G948YW", "B003KYSLMC", "B005IR4W7W", "B004JMZGLI", "B004SOZVQ2", "B002Z1Z79G", "B0047Y0UQO", "B001K66LPQ", "B000TQEDE4", "B000VVO0I6", "B004LOI2RO", "B00DVQI2O6", "B001KBZ95Y", "B00005AQ9K", "B007DKTSWQ", "B00B0QSCPI", "B0000YTYGM", "B0041847TW", "B002IAMOD6", "B0041847SS", "B0041847SI", "B0000X7CMQ", "B000PJ6OVA", "B000FFILRO", "B008YMHASG", "B00EI7DPTY", "B00EXOZGVC"]}, "salesRank": {"Kitchen & Dining": 149982}, "categories": [["Home & Kitchen", "Kitchen & Dining", "Coffee, Tea & Espresso", "Coffee Makers", "Coffee Machines"]]}