{"asin": "B000KU0PCS", "description": "From the Manufacturer Take a listen to Pioneer's latest innovation, the Pioneer inno. Small in size, big on features, it's the first satellite radio that plays MP3s and WMAs. You heard right; now you can select and record from over 170 crystal-clear channels of live XM radio or play your own MP3/WMA mix. Anytime you want, at home or on the road, hear talk radio, college sports, Major League Baseball, NASCAR and any kind of music you choose. That's unheard of variety and options. And innovation, now available with the Pioneer inno.Click to enlarge.Includes a dock and antenna to leave set up for home use and charging.Click to enlarge.Listen to what you want, when you want.Click to enlarge.Get Live XM on the GoEnjoy XM's 170 channels from coast to coast, with over 80,000 hours of entertainment each month. XM offers musical choice, variety, and discovery--worlds beyond your own collection--plus a wide range of news, sports, talk, comedy, kids, and entertainment channels. Hear XM live, or save XM programming on your inno to listen at your leisure. Own one of the world's first portable XM Satellite Radio + MP3 players.Hear it, Click it, Save itRecord your favorite XM channels at home or in the car (no PC required)--music, sports, talk shows, and whatever else you'd like to grab for later. Listen to what you want, when you want.Mix your MP3s/WMAs and XM TracksManage all your music--XM tracks, songs you purchase from Napster, and MP3/WMA files you rip from your CDs--with the easy-to-use XM+Napster program on your Microsoft Windows PC. Mix recorded XM with your MP3s and WMAs, create your own unique and original playlists, and manage playlists and files without computers or the internet.Discover it, Tag it, Own itPioneer has also teamed up with Napster, a leading provider of online music. Discover a new artist on XM and then, with just a few clicks of a mouse, buying high-fidelity tracks and albums by that artist and similar artists. Get recommendations on XM + Napster and explore new music.At Home or on the GoThe inno gives you options. Includes a dock and antenna to leave set up for home use and charging. The belt clip lets you keep it at your side wherever you might take it, and the travel adapter lets you charge up on trips. Wherever you are, you'll be ready to listen to live/recorded XM, MP3 and WMA files, managing your tracks, and more.What's in the BoxPioneer GEX-INNO2BK, home dock, home antenna, AC power adapter, travel adapter, RCA cable, USB cable, belt clip, ear buds, battery", "title": "Pioneer GEX-INNO2BK Inno 2 Portable XM Satellite Radio with MP3 Capability", "price": 399.0, "imUrl": "http://ecx.images-amazon.com/images/I/41fLNwhp3IL._SY300_.jpg", "related": {"also_bought": ["B002L9ISVQ", "B000NVU8NU", "B000E7WI0O", "B000F9NXXC", "B000KTYLNI", "B000E7UFIG", "B00ACTYOQU", "B007NLQ5TE", "B000EM70DY", "B000EM109O", "B001V6QTO8"], "bought_together": ["B002L9ISVQ", "B000E7WI0O"], "buy_after_viewing": ["B002L9ISVQ", "B000MVKCG4", "B000E3ZFSA", "B000NVU8NU"]}, "categories": [["Electronics", "Car & Vehicle Electronics", "Car Electronics", "Car Audio", "Satellite Radio"]]}