{"asin": "B001SER456", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Creating gorgeous images is more fun than ever with the sleek, impressively-equipped PowerShot SX200 IS. Capture close-up, wide-angle shots with stunning 12x optical zoom. Experience the unprecedented image quality and point-and-shoot convenience of Smart AUTO, along with enhanced operability and an intuitive new menu. HD shooting at 1280 x 720 pixels with HDMI output lets you see all the beauty of your HD images and movies on your HDTV.PowerShot SX200 IS Highlights12.1-megapixel resolution, 12x optical zoom with Optical Image StabilizerFor all its easy operability, the PowerShot SX200 IS has a feature set to be reckoned with. 12.1-megapixel resolution delivers a wealth of detail to every image, and allows you to crop and enlarge any portion of your shot freely. With the camera&#x2019;s powerful 12x optical zoom, you&#x2019;ll get up close fast, handy at sports and school events as well as everyday creative shooting. The 28mm wide-angle lens captures more in every frame, and gives your photography a professional edge.The PowerShot SX200 IS is equipped with Canon&#x2019;s acclaimed Optical Image Stabilizer Technology that automatically detects and corrects camera shake--one of the leading causes of fuzzy or blurred shots. Even when zoomed in, you can get the steady, crisp, brilliant images you&#x2019;ll be proud to shoot and share. And Canon&#x2019;s Optical Image Stabilizer Technology is so convenient to use. It functions perfectly with or without a flash.Capture Your Best Shots EasilySmart AUTO intelligently selects the proper settingsJust set the Canon PowerShot SX200 IS to Smart AUTO and you&#x2019;re ready for maximum enjoyment from your picture taking every time. It&#x2019;s a relaxing and satisfying way to shoot because you can completely concentrate on your subject knowing that the camera has the technical details covered. Advanced Canon technology intelligently analyzes your situation and shooting conditions. Then it automatically selects an appropriate setting from 18 specially defined settings. So whether you&#x2019;re photographing flowers, a captivating sunset, or your friends at the park, you can be confident that you&#x2019;re getting dramatic, memorable images.Shooting ModesAdvanced presets for the best possible photos under certain conditions. With 23 Shooting Modes including 11 Special Scene Modes, you&#x2019;re ready for whatever shot comes your wayHD movie shooting capability plus HDMI outputThe PowerShot SX200 IS lets you record video in beautiful high definition (1280 x 720 pixels). The camera also makes it easy to enjoy HD movies (and still photos) on your HDTV with an mini-HDMI connector for direct connection to a high-definition monitor. You&#x2019;ll enjoy the HD experience with no degradation of image or audio in the signal, plus the ability to display up to 130 still images at once.Blink DetectionBlinking subjects can ruin the best shots, and the problem usually isn&#x2019;t detected until it&#x2019;s too late to do anything about it. The PowerShot SX200 IS is equipped with Canon&#x2019;s new Blink Detection to combat this common image flaw. The feature uses the power of Face Detection to determine whether any subject in the previous shot had closed eyes. If closed eyes are detected, a \"blink warning\" icon appears for 3 seconds, allowing you to retake the shot before your subject or subjects move on.3.0-inch LCD with wide viewing angleThe camera&#x2019;s high resolution (230,000 dots) 3.0-inch LCD with gives you the big picture, whether you&#x2019;re shooting, reviewing or showing off your images. This high-resolution screen offers a crisp, clear picture to make shooting, playback and using the camera&#x2019;s menu functions especially convenient. Clear and bright, it also features Night Display for easy viewing in low light. It also has an electronic viewfinder that provides sharp images when you shoot close-up with Super Macro shooting mode.A World of Advantages with Canon&#x2019;s TechnologyDIGIC 4 Image Processor has evolved Face Detection Technology that tracks the faces of moving subjects and lets the shooter enter the frame seamlessly with the Face Detection Self-Timer.DIGIC 4 Image ProcessorCanon&#x2019;s most advanced image processor, DIGIC 4, delivers evolved Face Detection Technology that keeps every face in every photo looking its very best. The technology finds and tracks the faces of moving subjects until you&#x2019;re ready to shoot, then delivers perfect focus. In addition, exposure, flash and white balance are compensated, so that faces exhibit natural skin tones and backgrounds are properly exposed.iSAPS Technologyis an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the advanced DIGIC 4 image processor to improve focus speed and accuracy, as well as exposure and white balance.AFace Detection Self-Timerautomatically detects an increase in the number of faces and makes the appropriate adjustments. For instance, to include the photographer&#x2019;s face in a group shot, there&#x2019;s no need to rush in. Just put the camera on a stand or tripod, specify Face Detection Self-Timer, and the camera will wait for the photographer&#x2019;s face to get on-camera before it takes the shot. Motion Detection tracks moving subjects in a much larger range, and the Servo AF retains focus on a moving subject after the shutter button is pressed halfway--allowing you to wait for the perfect shot without refocusing.Intelligent Contrast CorrectionDIGIC 4 also makes possible the i-Contrast (Intelligent Contrast Correction) system, which controls the compensation level in pixel units to brighten dark areas while leaving bright areas unchanged for better images where the main subject is dark, and more natural transition. The PowerShot SX200 IS can even use i-Contrast in playback mode to adjust images that were shot without the setting activated.Red-eye Correctionprovides three options for removing red-eye from subjects in flash pictures.1) Red-eye Correction during shooting actually identifies and corrects red-eye in human subjects as pictures are taken.2) The PowerShot SX200 IS can be set to automatically detect and correct red-eye during image playback.3) You can manually locate any red eyes in a scene during image playback on the LCD screen, and command the camera to remove them.Life doesn&#x2019;t give you second chances to capture special times. That&#x2019;s why the PowerShot SX200 IS features an ISO 1600 setting that reduces the effects of camera shake and sharpens subjects in low-light situations, giving you greater shooting flexibility. ISO can be expanded to 3200 when you select ISO 3200 Special Scene mode.What's in the BoxPowerShot SX200 IS bodyLithium-ion battery pack (NB-5L)Battery charger (CB-2LX)Wrist strap (WS-DC9)Digital Camera Solution CD-ROMUSB interface cable (IFC-400PCU)AV cable (AVC-DC400)", "title": "Canon PowerShot SX200IS 12.1 MP Digital Camera with 12x Wide Angle Optical Image Stabilized Zoom and 3.0-inch LCD (Blue)", "price": 17.12, "salesRank": {"Camera &amp; Photo": 10070}, "imUrl": "http://ecx.images-amazon.com/images/I/410UtckQDBL._SX300_.jpg", "related": {"also_viewed": ["B0035FZJM6", "B0035FZJMG", "B005I6DVLQ", "B0035FZJMQ", "B0075SUKBO", "B003ZSHNG8", "B005I6DVC0", "B006UMM15O", "B0076W0LNQ", "B006UMM1J0", "B0075SUK14", "B00HLDFQU8", "B00I58M26Y", "B004J3YCGM", "B0075SUK6O", "B006UMM1F4", "B00BW6LTG0", "B008NENG1A", "B00I58M2VE", "B00BW6LUL4", "B009B0MYSQ", "B00HLDIDVM", "B005II5OLY", "B009VXVUGA", "B003CQB39Q", "B00B660GMO", "B00I58LZ80", "B00EFILSOU", "B00EFILR6E", "B00908BQCY", "B002LITT3S", "B0075SUJBA", "B00A2BVCO0", "B005I6DUU8", "B00B5HE45E", "B00EFILPHA", "B000HATNI8", "B00AWYMXZY", "B00908BMVE", "B0075SUG3Q", "B00B5HE2UG", "B0026NVUOE", "B002QCGD1U", "B006UMM1AY", "B00AY6Y1NC", "B00AWYN182", "B008MB70TI", "B00DWIAWQE", "B00HV6KJPM", "B00BINFLK2", "B005KBB79C", "B0075SUJ4W", "B00AQ2BUWY", "B000V1VG4W", "B00FPKDPXY", "B00HV6KJM0", "B00EFILNV8"], "buy_after_viewing": ["B003VNKNF0", "B003VNKNEQ", "B00B7ID99I", "B00HLDIDVM"]}}