{"asin": "B000VU0CQG", "categories": [["Electronics", "Computers & Accessories", "PDAs, Handhelds & Accessories", "PDAs & Handhelds"]], "description": "Designed to help keep your fast-paced life in balance, the HP iPAQ 111 Classic Handheld makes an excellent--and affordable--companion to your cell phone. Just over 1/2-inch thin and just under 4 ounces light, it fits securely in your hand with a non-slip finish. Easily see what you're doing, indoors and out, on the big, bright 3.5-inch touchscreen display.The HP iPAQ 111 features a 3.5-inch screen, Wi-Fi and Bluetooth connectivity, SD/SDIO expansion, and Windows Mobile 6 Classic operating system.With the power of the Windows Mobile 6 Classic operating system, you'll stay easily connected to your business and personal data on the go. And you'll stay productive with familiar software tools at your fingertips--Office Mobile includes Word, Excel, and PowerPoint--and bring your important documents and files from your PC with you wherever you roam.This slim, stylish organizer also lets you go online with Wi-Fi to keep your calendar, contacts, and tasks up to date. The integrated Wi-Fi networking makes it easy to access to Internet and email at the office, home or campus, and at other Wi-Fi hotspots at airports, cafes and hotels. Connect to Bluetooth accessories like headsets and keyboards to be more productive--you can even connect to your Bluetooth mobile phone to go online (requires compatible phone and cellular data plan). The Wireless Connection Manager helps you extend your battery life--check your connections and turn them off when you're not using them.The iPAQ 111 is also a great mobile entertainment companion, allowing you to listen to your music collection and watch videos with the Windows Media Player Mobile. You can store music and video files on optional Secure Digital (SD) memory cards (the SD slot also accepts SDIO cards). You can also view, share, and manage your photos with HP Photosmart Mobile, as well as play pre-installed games or download your favorites from the Internet.Key FeaturesStay productive on the road with familiar software: Windows Mobile 6 Classic OS, Microsoft Office Mobile (Word, Excel, PowerPoint), Microsoft Office Outlook Mobile; you can even view PDF documentsGet things done fast with the powerful Marvell PXA310 624MHz processorArrive at appointments on time by having your calendar and contact information handySynchronize email and documents to take with youCheck email at the office, home, or campus, and at other Wi-Fi hotspots at airports, cafes, and hotelsUse Bluetooth to go online and connect to your Internet-enabled mobile phone when Wi-Fi is not availableConnect Bluetooth peripherals (sold separately) like headphones and keyboardsExtend your battery life by checking your wireless connections and turning them off as neededView, share, and manage photos on the bright 3.5-inch touch screenPlay games and download them from the InternetListen to music and watch videos using Windows Media Player 10 MobileGet peace of mind with the one-year limited warrantySpecificationsWireless: Integrated WiFi (802.11 b/g with WPA2 security); Bluetooth v2.0 with EDROperating system: Microsoft Windows Mobile 6 ClassicMicrosoft programs included: Office Mobile , Office Outlook Mobile, Internet Explorer Mobile, Windows Media Player 10Processor: Marvell PXA310, 624 MHzDisplay: 3.5-inch transflective TFT RGB color 240 x 320 pixel touch screen with LED backlightMemory: 64 MB SDRAM main memory for running applications; 256 MB flash ROMPower: 1200 mAh lithium-ion rechargeable, user changeable batteryConnectivity: Mini-USB 2.0 port for sync/data/charge, SDIO high-capacity card slotAudio: Integrated microphone, receiver, speaker, 3.5mm 4-pin headphone jackHardware buttons: 5-way navigation with press to activate, 4 programmable, voice recorder, power, resetHP exclusive applications: iPAQ Wireless Manager, HP Photosmart Mobile, HP QuickStart Tour, HP iPAQ Setup Assistant, HP Help and Support, Bluetooth Manager, Certificate Enroller, Asset ViewerWarranty One-year parts and labor in most regions; 90 days technical support for software.Dimensions: 4.59 x 2.71 x 0.54 inchesWeight (with battery): 3.68 ouncesWhat's in the BoxHP IPAQ 111, standard battery, stylus, AC Adapter with power cord, mini USB synchronization/charge cable, slip case, documentation, HP iPAQ Companion CDPowered by Windows Mobile 6Microsoft's Windows Mobile 6 Classic updates the Windows Mobile 5 platform with a number of handy features that make searching through email, editing Microsoft Office documents, and staying on top of your most important communications even easier. Emails can now be viewed in their original rich HTML format and now offer the ability to visit embedded links. It also includes Windows Live for Windows Mobile, which provides a full set of Windows Live services, such as the Windows Live Messenger IM application, enabling you to chat with more than one person at one time or send a file.With Windows Mobile 6 Classic, your phone will finally be able to emulate the power and features of your PC's Microsoft Office suite. You'll be able to neatly view, navigate and edit Word documents and Excel spreadsheets in their original formatting--without affecting tables, images or text--as well as view PowerPoint presentations.Microsoft Office Word Mobile features include spell-check, Find and Replace commands, bulleted lists, text formatting, and support for tables for the first time.With Excel Mobile, you&rsquo;re not just confined to editing charts: with the new Chart Wizard you can create charts quickly and easily.PowerPoint Mobile allows you to view the full presentation, rehearse timings, check the order and any live links you may have in your presentation. You can then email comments back to the team or communicate via MSN Messenger for an immediate response.After creating or editing a Word document or Excel spreadsheet, you can synchronize it with your PC and it will automatically be converted to the PC version.All Windows Mobile 6 powered devices include Direct Push Technology for up-to-date email delivery and automatic synchronization of Outlook calendars, tasks and contacts through Microsoft Exchange Server. It also offers a set of important device security and management features that include the capability to remotely wipe all data from a device should it be lost or stolen, helping ensure that confidential information remains that way.", "title": "HP iPAQ 111 Classic Handheld (FA979AA#ABA) (110 Series)", "price": 289.0, "salesRank": {"Electronics": 36994}, "imUrl": "http://ecx.images-amazon.com/images/I/41ibBc9x-2L._SY300_.jpg", "related": {"also_bought": ["B003JQL920", "B0002X2B8O", "B000X6KDXA", "B004AIZMS8", "B000WR0CKE", "B000XMLAI6", "B004AJ5CFU", "B004DYT3RU", "B0010H12G8", "B003T0UX1E", "B000FT1OYM", "B000COJ8NY", "B000PEPCEK", "B001O5XLWO", "B002PUJ45A", "B000AR7RH2", "B0014BMPH0", "B0003099JA", "B002PUDDDO", "B000EUJD3G", "B000AR7QXW"], "bought_together": ["B003JQL920", "B0002X2B8O"], "buy_after_viewing": ["B003JQL920", "B000BI7NHY", "B0002X2B8O", "B000XMLAI6"]}}