{"asin": "B0002GDIII", "description": "Enjoy your iTunes music library in virtually any room of your house. Share a single broadband Internet connection and USB printer without inconvenient and obtrusive cables. Create an instant wireless network on the go. Extend the range of your current wireless network.Featuring AirTunes for playing your iTunes music wirelessly on your home stereo   or powered speakers, AirPort Express brings not only the Internet but your music   to wherever in your home you like to enjoy them most -- whether you use a Mac   or Windows PC. Unmatched in its ease of use, it delivers data rates up to 54   megabits per second, fits in the palm of your hand so you can take it wherever   you go.Driving         the Wi-Fi RevolutionIn 1999, Apple sparked the wireless revolution with the introduction of         AirPort, the first affordable and easy-to-use solution for accessing the         Internet without restrictive cables. In 2003, AirPort Extreme took your         unwired connection to the next level by harnessing the superfast 802.11g         wireless standard for data rates nearly five times those of the 802.11b         standard that the original AirPort used and many current wireless networking         devices still use. With AirPort Express, Apple continues to advance wireless,         delivering the first device to pack wireless networking, audio, printing         and bridging capabilities into a single affordable, portable unit.AirTunes Unleashes Your MusicAirPort Express with AirTunes brings your iTunes music in your Mac or         PC into your living room -- or wherever in your home you have a stereo         or a set of powered speakers. All you have to do is connect your sound         system to the audio port on the AirPort Express Base Station using an         audio cable (included in the optional AirPort Express Stereo Connection         Kit) and AirTunes lets you play your iTunes music through your stereo         or powered speakers -- wirelessly. iTunes automatically detects the connection         of your remote speakers, so you just have to select them in the popup         list that appears at the bottom of the iTunes window and click play.Enjoy your playlists, set iTunes to shuffle through your entire library       or repeat your favorite songs over and overEnjoy your playlists, set iTunes to shuffle through your entire library or   repeat your favorite songs over and over again -- however you like to enjoy   your music on iTunes, you can now enjoy it that way through your stereo speakers,   wherever they're located in your house.Enjoy your iTunes music library in virtually any         room of your houseBuy more than one AirPort Express         Base Station and connect one to every stereo or set of powered speakers         in your house -- one to your stereo in your living room and another to         a pair of powered speakers in your kitchen, for example. Its small size         and affordability make it perfect for having more than one. Imagine being         able to play your iTunes music on whichever speakers in your house you         prefer.Because AirPort Express is so compact, you can also easily take it along         with your laptop to a friend's house and share your unique musical taste         on your friend's stereo.Add Music to Your Current Wireless NetworkIf you already have a wireless network in place, you can use AirPort Express   to add music to its capabilities. Let's say, for example, you have AirPort Extreme   set up in your den. There's no need to scrap this setup and create a whole new   one with an AirPort Express Base Station, your DSL or cable modem, printer and   stereo all in one place. Simply connect AirPort Express to your stereo in your   favorite music room and plug it into an electrical outlet -- it wirelessly links   to your existing network, letting you play your music in your room of choice   without moving anything or connecting anything else.Easy SetupListen wirelessly, connect wirelessly, extend your network wirelessly, print       wirelessly &#8212; no matter what you want to do with AirPort Express or       whether you use a Mac or PC, you can bet it&#8217;s a breeze to set up.With the AirPort Express Assistant, it&#8217;s just a matter of a few         clicks. The software automatically detects what you have connected to         AirPort Express &#8212; whether it&#8217;s your stereo, DSL or cable modem         or printer &#8212; then walks you through the easy steps to complete the         setup.Connect WirelesslyAirPort Express uses the 802.11g wireless standard to deliver blazing         data rates -- up to 54 Mbps. It supports both Macs equipped with an AirPort         Extreme Card and Wi-Fi-compliant 802.11g Windows PCs, as well as Macs         with the older AirPort Card and 802.11b Windows PCs. Everyone in your         family can surf the web wire-free because AirPort Express provides simultaneous         wireless Internet access via your DSL or cable modem for up to 10 computers.Extremely portable, AirPort Express weighs less         than seven ounces and fits in the palm of your handAirPort Express connects you         and everyone in your family not only to the Internet but to each other.         Since it employs the powerful 802.11g standard, you can wirelessly share         photos, movies and other files without having to worry about slow data         transmissions. Nor do you have to concern yourself over a difficult network         setup procedure. AirPort Express uses the revolutionary Rendezvous technology         in Mac OS X to allow your AirPort-equipped Macs running Mac OS X to detect         each other with no effort on your part -- they discover each other just         by virtue of being within the range of the network.Extend Your NetworkIf you already have a wireless network in your home and would like to         extend its range, AirPort Express is your answer. Suppose you want to         connect to the Internet with your PowerBook in an area that lies beyond         the 150-foot range of your AirPort Express or AirPort Extreme Base Station.         You can use AirPort Express as a wireless bridge to extend the range of         your primary base station.There's no need for extra wires or cables -- serving as a bridge, AirPort Express   doesn't have to be physically connected to your primary base station or to your   DSL or cable modem. Simply place AirPort Express within the range of your primary   base station and near the area where you'd like to enjoy your wireless connection.", "title": "Apple AirPort Express with Air Tunes M9470LL/A [OLD VERSION]", "price": 97.93, "imUrl": "http://ecx.images-amazon.com/images/I/112NP30S58L.jpg", "related": {"also_bought": ["B005XXMMFU", "B008ALA2RC", "B0049P6OTI", "B009HC7BL8", "B000UZCR56", "B00I0Z427E", "B0032JAG4G", "B00DB9WCR6", "B005MQ17S6", "B00C2P61FO", "B007I5JT4S", "B00004Z5CP", "B00BS92DCA", "B0002JFN1A", "B001P2VV50", "B00GTGETFG", "B006LW0WDQ", "B0071HZ5LE", "B006BD1K4A", "B00630WKGI", "B000068O3B", "B00BQ5RYI4"], "buy_after_viewing": ["B008ALA2RC", "B00DB9WCR6", "B00FRMAOIO", "B00E98O7GC"]}, "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Wireless Access Points"]]}