{"asin": "B001CRM3RI", "description": "Grand Theft Auto: Chinatown Warsis the highly anticipated first game in theGTAfranchise designed for play on the Nintendo DS. But although it comes in a small package, this is a full-fledged game that stands on its own. With an all-new, deep story that approaches the familiar sights and sounds of the infamous Liberty City from a different perspective, an innovative control system and multiplayer options,Chinatown Warscaptures the tone and flavors of the long-runningGTAseries in unique ways that both longtime players and those coming to it for the first time will find hard to put down..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Grand Theft Auto:Chinatown WarsPlayers:Offline: 1; Online: 2Gameplay Modes:Single player; competitive &amp; coop multiplayer via Nintendo Wi-Fi connection.Kick some tail as Huang Lee.View larger.Use the DS stylus like never before.View larger.Reconquer Liberty via PDA.View larger.The Story: Left for Dead in the Worst Place in AmericaFollowing his father&rsquo;s murder, Huang Lee is given what seems a simple mission: to deliver an ancient sword to his Uncle Kenny to ensure his family retains control of the Triad gangs of Liberty City. Huang is a spoiled rich kid who expects everything to run smoothly, but his trip does not go exactly as planned. Only minutes after arriving at the Liberty City airport at the far end of town, he is robbed and left to die. Only through quickly thinking is he able to survive and make his way back to his neighborhood, but the damage to he and his family has been done. Now his destiny is to search for honor, riches and revenge in the most dangerous and morally bankrupt city in the world.GameplayThe largest DS game to date,Chinatown Warsis set in theGrand Theft Auto IV-imagined version of Liberty City, and contains most of its boroughs and neighborhoods. In exploring and exploiting this vast area, players use the game's rotatable camera to take in a 3D, 360-degree view of their environment, providing an elevated and somewhat skewed third-person perspective, that switches to first-person with the appropriate player action. Assuming the role of Huang Lee your goal is to rise up in the ranks of the underworld to challenge the Triad of Chinatown gangs that have usurped your family's position and recover the stolen heirloom and your lost honor. In trueGTAfashion this entails gameplay that embraces the seedy underbelly that Liberty City is famous for. Throughout the game's 70+ missions -- all of which can be replayed even after completion -- and its myriad of side quests, players earn cash by completing jobs ranging from petty street crime, all the way up to drug dealing and assassination. As in otherGTAreleases, rising competence at crime raises the amount of attention received by police, but unlike previous games here players can not simply outrun alerted authorities. With each additional star added to your 'wanted rating' players must disable or destroy more of the pursuing police units to keep them off your tail. In addition to mission play, the game also contains many opportunities, such as the safe cracking and car hot-wiring mini-games and the various items and weapons hidden throughout the game that demand skill with the DS' touchscreen and stylus for success. By whatever means, once players have attained a certain level of cash and street cred they will also be able to recruit members for their own gang who pledge their loyalty by allowing themselves to be tattooed with the mark of the player's choosing.Cars and ControlsCars and control schemes play a prominent role inChinatown Wars. All cars feature GPS functionality based on available roadways. Directions are shown on the lower of the DS' two screens as part of the in-game PDA interface, but players may take vehicles off roads wherever possible, with the GPS automatically resetting when back on the pavement. While driving players also have access to five in-game radio stations and use of their weapons. Your PDA provides efficient management tools for your growing crime empire, including quick weapons switching, a running total of available cash, in-game e-mail and Internet access and nearly instant game saves any time. The control scheme inChinatown Warsutilizes an easy to use and comfortable to play combination of steering via the D-pad, choice of action through the face buttons and/or stylus taps and manual and automatic weapon locks and unlocks via shoulder buttons.Key Game Features:The Largest DS Game Ever- Contemporary Liberty City is a massive world complete with pedestrians, weather and traffic patterns, five different radio stations and four different sprawling boroughs to explore.Endless Gameplay- Mature storyline with over 70+ story missions; plus dozens of side quests, collectibles, contextual mini-games and the all new mission replay feature.Street Economics- Addictive drug dealing side game with 6 different drug types, 80+ drug dealers and a supply / demand driven narcotics economy.Play with Friends- Nintendo Wi-Fi mode for head-to-head and co-op multiplayer mayhem.Bragging Rights- Chat, trade guns and commodities with your friends, and compete for glory via online tournaments and leaderboards on the Rockstar Games Social Club.PDA Interface- Use the touch screen as a PDA device to set GPS waypoints, change radio stations, communicate via e-mail with in-game characters and order weapons on the Internet.Online Bragging Rights and MultiplayerCare has been taken to ensure that players can share theirChinatown Warsexperiences with friends and fellow players in different ways. First, players will have access to theChinatown Warsas well as the greaterGrand Theft Autocommunities through the Rockstar Games Social Club. Here they can chat, trade commodities, purchase special in-game items with in-game currency, check the leaderboards and compete in online tournaments. The DS' Wi-Fi capabilities also gives players the opportunity to take their game online as they battle for supremacy in their own little corner of Liberty City in both head-to-head and co-op multiplayer battles.", "price": 95.24, "imUrl": "http://ecx.images-amazon.com/images/I/61GtPGEjPML._SX300_.jpg", "related": {"also_bought": ["B000UC5ZEO", "B003WFLGNA", "B000O5I0F8", "B000CBCVFE", "B001AWIP8G", "B001E27DLM", "B000ERVMI8", "B000FRV2UK", "B002I0EJJ8", "B000UZVL58", "B0009Z3K9E", "B002I0EMUO", "B0009XEC02", "B000A2R54M", "B002I0EH6I", "B000HE9LL8", "B001TOQ8UW", "B0012NWBH4", "B003VR5PPY", "B00136MBHA", "B0009Z3MQ0", "B005C2QSDY", "B0050SVLI2", "B001CU4EJ0", "B0029ZMIGS", "B00184219U", "B004K6LQAS", "B000TPTCRS", "B003O6E800", "B000WCE9XK", "B00503EA2G", "B000GIXIPK", "B002EWD02C", "B001H8Y7DA", "B0050SVOXE", "B001TOQ8WU", "B0006B0O9U", "B003IOGPAO", "B004CVWETI", "B001TOMR6Q", "B0088MVPFQ", "B0019SS8H4", "0744010950", "B004L491A6", "B000HE7KZC", "B002I092MM", "B001P1ZE68", "B001FS8BDE", "B0053B0DI0", "B006JSY5EY", "B003FBL86Q", "B0009Z3HR4", "B002I094AC", "B000WMEEC6", "B000U5W3IW", "B002WDL53O", "B002TDIEDG", "B000B69E96", "B004L4G8UC", "B0016BVY8O", "B0009ENA2W", "B0019SY1D4", "B000B8J7K0", "B00008JODN", "B001TOMR0C", "B007FMSDU0", "B000I10PY2", "B000SSQPU8", "B001CBBYKQ", "B000CNESHG", "B00AKIPBNS", "B002VA593A", "B0009K7ESC", "B001DAVSZC", "B002I0IVC4", "B002I0GKIQ", "B002EE5RD0", "B0042YKI3O", "B0052WG9II", "B0053BCML6", "B0017HRZ26", "B0053BCO00", "B0007D4MVS", "B003BMJKI2", "B0058H7AJO", "B0053BCP40", "B001HB7K6I", "B002I0GKA4", "B004Q4PEAM", "B002I0H1DY", "B003KMCILY", "B00GV4V8XC", "B002I08VDI", "B006L16PPG", "B000FIQA8I", "B00GANWVJE", "B0050SVL3M", "B000O5VJRY", "B000FYZS6M", "B009B1D7JK"], "bought_together": ["B000ERVMI8", "B000A2R54M"], "buy_after_viewing": ["B000ERVMI8", "B000A2R54M", "B002WDL53O", "B0053BCO00"]}, "salesRank": {"Video Games": 4562}, "categories": [["Video Games", "Nintendo DS", "Games"]]}