{"asin": "B00685ZCZY", "categories": [["Electronics", "Computers & Accessories", "Laptop & Netbook Computer Accessories", "Docking Stations"]], "description": "Paired for PerfectionThe feature that gives the Eee Pad Transformer Prime its name, the mobile docking station, gives a whole new meaning to the term versatility. Easily switch between tablet and PC mode with the docking station designed especially for the Eee Pad Transformer Prime. The docking station not only extends the tablet's battery life up to 18 hours1but also features added functionalities which include a near full-sized QWERTY keyboard, a multi-touch touchpad, 1 USB 2.0 ports, and a SD card reader.Key FeaturesView largerEnhance productivity with the docking station's 92% sized QWERTY keyboard that adds additional 6 hours of battery life, to instantly turn the Transformer into PC mode with up to 18 hours of battery life.1SD card reader lets users transfer files between their devices and the tablet quickly, easily and safely.Large sized multi-touch touchpad is not only comfortable to use but supports intuitive gesture inputs.Connect mice, keyboards, USB memory sticks and USB HDDs to the tablet with the docking station's 1 USB 2.0 ports for enhanced computing experience.Relax, ASUS Has You CoveredRanked as the #1 most reliable PC brand by 3 independent sources2, readers and editors alike choose ASUS as their trusted notebook and netbook. We tirelessly strive to exceed expectations of quality to ensure you an unmatched peace of mind every time you switch on your Eee Pad Transformer Prime.We also back our commitment with the industry's most comprehensive warranty.1 year North America warrantyFree one-way standard shipping24/7 tech supportWhat's in the BoxEee Pad Transformer Prime TF201 Tablet Docking StationUser manualSpecificationsInput/Output1 x USB 2.0Card ReaderSD Card ReaderBattery22 W/h Li-polymer battery (adds up to 6 hours)1Dimensions10.35\" x 7.12\" x 0.31~0.41\" (W x D x H)Weight1.19lbs (with battery)ColorChampagne Gold&copy; 2011 ASUS Computer International. All Rights Reserved. ASUS is a registered trademark of ASUSTeK Computer. All specifications and terms are subject to change without notice. Please check with your supplier for exact offers on selected models. Products may not be available in all markets. Product may not be exactly as shown in photos. All trademarks are registered to their respective companies. ASUS shall not be liable for technical or editorial errors or omissions contained herein.1Actual battery life varies with usage. Operation lifetime subject to product model, normal usage conditions and configurations.2Rated number 1 Windows-based PC maker in PCMag.com's Service &amp; Reliability Report 2010. Rated number 1 PC brand according to SquareTrade, the leading direct-to-consumer warranty company (for more information visit http://www.squaretrade.com/pages/laptop-reliability-1109/ ). Rated number 1 reliable PC maker in Q2 2010's RESCUECOM report http://www.rescuecom.com/2010-2nd-Quarter-Computer-Reliability-Report.html.Check Out Other Great ASUS ProductsASUS Transformer PortfolioProtect your Eee Pad Transformer with the ASUS Portfolio cover designed to fit the tablet perfectly. The portfolio also has a fold-able cover that turns into a keyboard stand or a reader stand, making it convenient to use your Eee Pad comfortably for hours-on-end.Eee Pad Transformer Docking KeyboardIt is meant to be together. Add a docking keyboard to your Transformer tablet and get up to an amazing 16 hours of battery life. With 2x USB ports, an 4-in-1 card reader, the expansion possibilities are almost limitless. Its full QWERTY keyboard and a row of shortcut keys means you can get what you want done, faster, more efficient.ASUS Index Sleeve - BlackWhen docked, your Eee Pad Transformer is not just a tablet, it is also a very capable notebook style PC. Don't leave home without a sleeve protecting your Transformer. Check out this water-repellant textured leather sleeve with an soft sued interior.ASUS Index Sleeve &ndash; PinkWhen docked, your Eee Pad Transformer is not just a tablet, it is also a very capable notebook style PC. Don't leave home without a sleeve protecting your Transformer. Check out this water-repellant textured leather sleeve with an soft sued interior.", "title": "Asus Transformer Prime TF201 Mobile Docking - Champagne (TF201-DOCK-CG)", "price": 239.0, "salesRank": {"Electronics": 33661}, "imUrl": "http://ecx.images-amazon.com/images/I/51ZdIOgqTsL._SY300_.jpg", "related": {"also_bought": ["B0067PLNRQ", "B008F4NL0O", "B0072XQILS", "B0067PLOW0", "B0062OKDIC", "B008F4NL8G", "B0067PLM5E", "B006QFZ2QA", "B006TOPR72", "B006ULQPTI", "B008F4NL04", "B00GQM36AM", "B006C64C6E", "B00FZ3TGFC", "B006GM57MC", "B008F4NL18", "B008EOK08Q", "B00AHC5RRC", "B007K94I2U", "B005PAINXQ", "B006QG47YW", "B007CAZOIE", "B004ZMICYA", "B006NVLDKG", "B00CFIDQZG", "B004M5OYRY", "B004U78628", "B008D1RMGI", "B007LI2QJW", "B008TO3PSS", "B008G2GBN4", "B007GJR7GS", "B008FH1R0W", "B007QUHFGY", "B007LI1UOE", "B007CAZWC2", "B0079O2C60", "B007WTAJTO", "B003UH0Z9Q", "B0072XQI2W", "B0074QX2BW", "B008O2DT5E", "B007IFAP6Y", "B008J76TE2", "B005ORQ350", "B0087OXSZ0", "B0083P3VFA", "B008MPE58S", "B0087OXSXM", "B00GQM1WYY", "B008M73GOA", "B0093G5I9K", "B004M5KYGY", "B009HK30V0", "B007XZM6VG", "B007Q4WMSG", "B007KFXIDE", "B004G60AD6", "B006GM571S"], "buy_after_viewing": ["B008FH1R0W", "B008F4NL04", "B0067PLM5E", "B008G2GBN4"]}}