{"asin": "B001R23JMQ", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "From the ManufacturerFujifilm's FinePix F200EXR digital camera introduces the world to Super CCD EXR technology. Combining the 12-megapixel, Super CCD EXR with a powerful Fujinon 5.0x wide angle optical zoom lens and a large 3.0-inch high-resolution LCD, the FinePix F200EXR is Fujifilm's most advanced compact digital camera yet.As with previous award-winning F-series models such as the FinePix F10, F31fd, F50fd and F100fd, the F200EXR is a powerful, feature-packed compact digital camera ideal for those looking for the most sophisticated in feature-rich point and shoots.28mm wide-angle lensThe FinePix F200EXR offers 3 selectable modes in one sensor:Fine Capture Mode(High Resolution), which deploys all twelve million pixels, and is designed to offer the finest detail of intricate subjects when light is full and even;Pixel Fusion Mode(High Sensitivity and Low Noise), which caps two adjacent pixels together to produce six million large photodiodes, which are big enough to absorb light in the darkest of conditions, to produce low-light shots of extraordinary quality with minimal noise and grain; andDual Capture(Wide Dynamic Range), which captures different exposures with two sets of six million pixels, which, when combined, gives an excellent level of detail in highlights and low lights that would otherwise be lost.In addition to the new Super CCD EXR sensor, the F200EXR offers the most advanced technologies available, including Dynamic Range Bracketing, Dual Image Stabilization, Face Detection 3.0, and ISO settings of up to an unprecedented ISO 12800, allowing you to capture any shot, any place and at any time with the lowest noise signature to date.With EXR AUTO, the F200EXR recognizes the subject and scene, and automatically decides the optimum EXR shooting mode. With three options of Fine Capture Technology with High Resolution, Pixel Fusion Technology for High Sensitivity and Low Noise, and Dual Capture Technology for Wide Dynamic Range--that users can also select manually--the camera combines the best of EXR selectable sensor modes with SR Auto Automatic Scene Recognition.New to the F200EXR are an extra-large 3.0-inch LCD (the better to see all your great photos), HD Photo to capture still photos at 1920 x 1080, HD output (to view high image quality on your HDTV) and new film simulation modes (based on Fujifilm&rsquo;s legendary Velvia, Provia and Soft lines), including Sepia and Black and White modes.The F200EXR also delivers wider Dynamic Range... by up to 800 percent. Dynamic Range, or the gradations of light that exist between bright and dark in any setting, can be easily detected by the human eye, but not by most cameras. Through a combination of advances in Fujifilm's new Super CCD EXR and Real Photo Processor, this wide dynamic range dramatically broadens tonal capability and guarantees exceptional rendition of photos with both bright highlights and dark shadows. This expansion of sensitivity captures greater detail, and subtle nuances of brightness and tonality that bring the photo closer to what the human eye actually sees.FinePix F200EXR HighlightsExtreme Sensor Super CCD EXR DebutThe new Super CCD EXR in the revolutionary FinePix F200EXR introduces a totally new concept in capturing image quality. Just as your eye seamlessly adapts to any situation, shots in every scene are captured more beautiful than you imagined.Even Closer to the Human Eye - 3-way Capture TechnologyThe new Super CCD EXR provides superior picture quality, enabling a \"3-in-1\" sensor combination of \"Fine Capture Technology\" (High Resolution), \"Pixel Fusion Technology\" (High Sensitivity & Low Noise), and \"Dual Capture Technology\" (Wide Dynamic Range). With an innovative color filter array and image processing technology, the EXR ensures an advanced reproduction in imaging with exceptionally balanced quality.EXR AUTO: Extreme Point-and-ShootThe EXR AUTO not only automatically recognizes the scene and selects the ideal shooting mode, but also \"switches\" the sensor to the perfect capture mode for the conditions.EXR AUTO in Macro Mode (3-way Capture Technology)As soon as you frame the close-up shot, EXR AUTO not only selects Macro mode, but switches the sensor to the appropriate high resolution capturing modes in full 12-megapixels.EXR AUTO: Just \"As Your Eye Sees It\"With the sensor and every settings automatically optimized for the scene, the image can be captured just as your eyes see them.EXR Priority: Extreme CreativityWith EXR Priority, you can manually switch the sensor to one of three capture modes. Just like your eye prioritizes different functions for optimal viewing of different scenes, each EXR mode uses a different approach to change how the sensor captures the image.High resolutionJust as your eye sees the finest detail in bright conditions, \"Resolution Priority\" uses the full 12 megapixel resolution of the unique EXR array to reproduce the smallest detail in bright beautiful color.Wide Dynamic RangeJust as your eye sees the full range of shadows to highlights in high-contrast scenes, \"D-range Priority\" simultaneously captures two images to produce a single image with Wide Dynamic Range up to 800 percent, revealing subtleties in shadow and eliminating washout of the bright areas.High sensitivity and low noiseJust as your eye strives to make dark scenes as bright and detailed as possible, \"High ISO &amp; Low Noise Priority\" takes advantage of high sensitivity and FinePix's original pixel binning technology to capture the subject with exceptional brightness and minimal noise.Priority Shooting ModeFor more hands on control, you can choose Aperture Priority to manually select aperture and control depth of field.Unique Shooting Modes Capture Best of AllThe highly-reputed Film Simulation Mode has evolved for even better results, along with the all-time favorite Face Detection 3.0, a speedy detection of faces 360 degrees in range and profile.Newly Evolved: Film Simulation ModeSimulate the distinctive look of 5 different types with just a touch of a button. Modeled on Fujifilm brands loved by professional photographers, each breathes life into your image with a quality that previously only film could capture.Face Detection 3.0A speedy detection of faces 360&deg; in range and in profile. There are 3 main characteristics of Face Detection 3.0:360 degrees in rangeDetect faces upside down, slanted, and sideways as it automatically optimizes focus, brightness, flash, and white balance.Up to 10 faces detected at any angleFace Detection 3.0 simultaneously recognizes up to 10 faces in a frame no matter which way round the camera is being held.Ultra high-speed detectionAn ultra high-speed detection of faces in a frame to optimize shots clear and crisp for subjects in motion.Red-Eye Correction in Detected FacesAutomatically removes red-eye effects often spoiled by flash reflections.Automatically remove red-eye from detected facesVersatile Playback Functions of Face DetectionVarious playback functions are introduced for you to share great photos with your family and friends!Red-eye removal during playbackThis function corrects red-eyes while playback of close-ups and detected faces.Zoom upPress the Face Detection button to zoom into each of the detected faces in a photo during playback.CroppingWhen you find a perfect smile in a group shot, try cropping it. This zooms up on the detected face, crops and saves as a \"Portrait\" in the camera.Close-Up SlideshowEach detected faces are zoomed in as they are displayed in slideshow-style.28mm Wide Lens x Blur-FreeAll in a compact body - for breathtaking landscape in wide scale, 5x optical zoom for distant subjects up-close, and Dual IS to adjust camera shake for blur-free results.5x optical zoom in actionPowerful functions, all in a compact bodyThis functional compact camera is designed for daily mobility and easy maneuvering with a comfortable grip. Experience the difference not only in photo quality but comfort as well.28mm wide angle to 140mm zoom at your fingertipsWith wide angle, you can capture the breathtaking scale of landscapes. The power of 5x optical zoom brings distant subjects up-close. The F200EXR lets you capture more scenes in more situations with exceptional results.Dual IS (Image Stabilization) for blur-free resultsFinePix sensitivity freezes subjects to defeat motion blur while CCD Shift Image Stabilization compensates for camera shake. Together they prevent image blur-the number one cause of spoilt photos.Dual image stabilization for blur-free results5fps \"burst\" continuous shooting modeA high-speed continuous shooting mode allows you to shoot up to 12 frames in a burst (at 5 frames per second). Perfect for capturing \"the moment\" of moving subjects.Capture up to 5 frames per secondVersatile Shooting FunctionsIntroducing various functions for your photo enhancements - simply select the modes that suit your shooting conditions.Super Intelligent FlashThe new \"Super Intelligent Flash\" lets you take macro shots with the ideal balance of flash output and sensitivity. Integrated in the Auto mode, this next-generation flash system captures both the subject and background in bright, clear details over the full flash range include ultra close-ups.Super Intelligent Flash in actionUnderwater white balance adjustmentsWith the optional waterproof case and Auto White Balance (AWB) mode to adjust color temperature for more beautiful blues, you are ready to dive into another world of photography.Scene Positions and Mode DialsEasy-to-select Scene Positions and Mode Dials. Just choose the shooting mode that matches the scene, and every setting from shutter speed to white balance is optimized to capture an exceptional image.Additional Entertaining FeaturesEnjoy high-resolution images on your HDTVAdd a little spice to your photo-life. Introducing entertaining features such as HD image viewing, micro thumbnail on a large LCD, slideshow, and much more!HD-out functionEnjoy HD image viewing in your living room. High-resolution images can be displayed on HDTV at full screen.3.0-inch large LCD with Micro Thumbnail ViewThe 3.0-inch large, bright LCD monitor of 230,000-dots resolution makes it easy to compose great photos and fun to playback and share the images. Micro Thumbnail View allows you to navigate, view and select from up to 100 photos, displayed in a 10 x 10 array.SlideshowEnjoy your photos in slideshow style with close-ups of face detected radiant smiles!xD/SD compatible slotThe versatile card slot is compatible with ultra-compact xD-Picture Cards and both standard and high-capacity Secure Digital (SD) memory cards.", "title": "Fujifilm FinePix F200EXR 12MP Super CCD Digital Camera with 5x Wide Angle Dual Image Stabilized Optical Zoom", "price": 9.99, "salesRank": {"Camera &amp; Photo": 9015}, "imUrl": "http://ecx.images-amazon.com/images/I/51a57QCH48L._SX300_.jpg", "related": {"also_viewed": ["B0012Y6VQA", "B00B46XSDK", "B006T7QSV8", "B001SEQPGK", "B002LITT42", "B003ZSHNG8", "B0095F5AG0", "B008MB719C", "B005MTME3U", "B00728ZBA2", "B00728ZBC0", "B0095F5AFQ", "B001G5ZTPY", "B001QFZMCO", "B0043RS864", "B003ZSHNGS", "B004J3YCGM", "B006UMM15O", "B00FPKDPXY", "B00BEHQKPM", "B0095F5AFG", "B00BOZCSQE", "B00B5MUJKI", "B000P6I4XO", "B007CLW404", "B002LITT56", "B000UXDHOI", "B004HO58KW", "B002LITT3S", "B004NBZ8DQ", "B00728Z8TG", "B004J3VAYO", "B002LITT3I", "B0075T7NW2", "B003VYB1KK", "B001QFZM4W", "B0075SUK14", "B0075SUHA8", "B009AYJQ2U", "B00BQX5M7Q", "B001CCLBSA", "B0092MD5ZE", "B004HO58KM", "B00FP1HOB2", "B004HO58L6", "B00B3YSW5W", "B00I58M26Y", "B00BW6LTG0", "B00I8BIBCW", "B0075SUHQC", "B004H8FNNK", "B00AQ2BWS6", "B006T7QVJM", "B00B5MUJ58", "B00CBYMWNQ", "B0075SUKBO", "B001SER44W", "B00B46A1A8"], "buy_after_viewing": ["B003VNKNEQ", "B000UXDHOI", "B001SSPNOG", "B0092SX9B8"]}}