{"asin": "B00FNPD1VW", "categories": [["Electronics", "Computers & Accessories", "Laptops"]], "description": "Chromebooks are a unique class of mobile computing devices, designed specifically for Web-based tasks. They differ from traditional laptops in a few important ways:Chromebooks run Web-based apps, not traditional PC applications.Chromebooks are designed to be connected to the Internet. You can create documents and spreadsheets or edit photos on a Chromebook using Google apps designed for these purposes. The Chrome operating system will not load and run traditional PC software like Microsoft Office and Adobe Photoshop. However, files created in these applications can be viewed and edited using Google apps on your Chromebook or cloud-based applications like Microsoft's Office web apps.You store your files in the Cloud, not on the machine.To help make them thin and light, Chromebooks are built without large-capacity drives. So instead of storing your documents, videos, and photos on your computer, you save them to Google Drive (Google's Cloud-based storage service). Your files are password-protected and secure, and you can access them anywhere there's an Internet connection. If you know you'll want access to a file or photo offline, however, you can easily save it to the built-in solid-state drive.Acer introduces its new Chromebook, the C720 -  the best performance 11.6\" Chromebook with speed, simplicity and security all built in. Continually updated, always new, the Acer C7 Chromebook keeps getting better and better.  It starts in seconds, is powered by the new Intel&reg; CeleronTM2955U Haswell micro-architecture processor and has up to 8.5 hours of battery life giving you all day to run your favorite Google apps or access your photos, videos, music and documents from anywhere.Key Features11.6\" Anti-Glare HD Widescreen LED-backlit DisplayIntel&reg; Celeron&reg; Processor 2955U(1.4GHz, 2MB L3 cache)Haswell micro-architectureGoogle Chrome Operating System16GB SSD Drive2048MB DDR3L SDRAM MemoryIntel&reg; HD Graphicswith 128MB of dedicated system memoryAcer InviLinkTM NplifyTM 802.11a/b/g/n(MIMO Dual-Band 2.4Ghz &amp; 5GHz) Wireless LANBluetooth 4.0Built-in HD WebcamTwo built-in stereo speakers1- USB 3.0 Port1- USB 2.0 Port1- HDMI&trade; PortFull-size Acer FineTip KeyboardMulti-Gesture Touchpad3-Cell Li-Polymer BatteryUp to 8.5-hours Battery Life2.76 lbs.| 1.25 kg(system unit only)Learn MoreFast. Light. Portable.The Acer C720 Chromebook, boots in less than 7 seconds, and automatically stays up-to-date (and virus free) without interrupting you. Powered by an Intel Celeron processor, it delivers a great experience on the web. It can load content-rich webpages quickly and easily, provide crisp video playback, and enable you to multitask effortlessly by allowing multiple pages to run at the same time.This third-generation Chromebook has a design that is 30 percent thinner than its predecessor. Your Chromebook slips easily into a bag or purse, weighs just over 2 pounds and has up to 8.5 hours of battery life. It's equally comfortable at home or keeping up with everything you do everyday, even when you're offline.The 11.6\" HD anti-glare display enables students and families to enjoy the Chromebook outside in sunlight for classwork, reading, playing games and more. Crisp resolution brings family closer during video chats, and the HD webcam presents you at your best, too. Want bigger?  Extend your view to your big screen via the HDMI&reg; port.Everyday SecurityChromebooks have multiple layers of security to keep you safe and worry free. Plus with automatic updates, the Chromebook downloads security and software upgrades so you don&rsquo;t have to. No more updates to track.Store and access your photos, music, videos, documents and more from anywhere with Google Drive. It&rsquo;s simple, and all your files are backed up automatically online, safely and securely.  Plus enjoy 100 GB of free storage on Google Drive for two years.Feel safe sharing your C720 Chromebook with friends, family and even the occasional guest. Each user has their own login, files, apps and settings, so you never have to worry about anything getting messed up by someone else.The Best of GoogleChromebooks come with popular Google products built in: Search, Gmail, YouTube, and Hangouts. So you can work, play, and do whatever you want, right out of the box. Create documents, spreadsheets, presentations and drawings with apps like Google Docs, Zoho and SlideRocket. Enjoy full screen video chat with up to nine friends using Google+ Hangouts.The Chrome Web Store offers thousands of free apps, themes, and extensions to help you make the most of your Chromebook. Watch movies, play games or get work done (if you really have to).  The Chromebook will keep it all fresh with automatic updates.The Acer C720 Chromebook stays connected with dual band Wi-Fi. It also comes with 12 free Gogo&reg; Inflight1passes so you can stay online even when you're not on the ground.1Your Chromebook comes with 12 free Gogo&reg;in-air Internet passes (estimated $150 value, redeemable for one year after Chromebook purchase) usable on continental U.S. flights of participating airlines.", "title": "Acer C720 Chromebook (11.6-Inch, 2GB)", "price": 209.8, "imUrl": "http://ecx.images-amazon.com/images/I/41ofJFA6XLL._SX300_.jpg", "brand": "Acer", "related": {"also_bought": ["B00CD8ADKO", "B00JEKFIO0", "B00GRMZ37U", "B00DUN2PBQ", "B00HUWDXLE", "B00HUW23MY", "B00HUWASC6", "B00HUWBPCS", "B00HUW54PM", "B00HUW9KBG", "B00DUGZFA6", "B001ENYQT8", "B00FBJ8BCO", "B00HUWEWNC", "B00FJXVRM8", "B00EZ2E8NO", "B00HUVUWLY", "B005EJH6Z4", "B007ZSP2FI", "B008FU1HE0", "B004NY9UV4", "B00HUWCP36", "B004NY9UUU", "B00DR0PDNE", "B00H7WF22K", "B00KD5RUN2", "B00DHKGAAE", "B00HRO3IBA", "B005EJH6RW", "B00J49ZH1U", "B0034TZONM", "B00FGOTC0Y", "B005HQ514C", "B00484IEJS", "B009PIORNE", "B00I5DFBEO", "B00HIENXYG", "B00CBB6TPQ", "B004AM624C", "B0012YJQWQ", "B00BBD7NFU", "B00IT1WJZQ", "B00DBV28TG", "B00BLY433E", "B001FWYGJS", "B00K74R3AO", "B00K11RI6W", "B00HM0IV98", "B00FHPJRC0", "B00D99FWAM", "B00KMRGF28", "B00FJ92RYO", "B00C7NX884", "B00KLUY4M4", "B004OB0EBQ", "B00GSNNWDA", "B00FTG73SC", "B00CKUBLFQ", "B00BWF5U0M", "B00CX5P8FC"], "bought_together": ["B00CD8ADKO"], "buy_after_viewing": ["B00FJXVRM8", "B00CD8ADKO", "B00KMRGF28", "B00H7WF22K"]}}