{"asin": "B003171CEW", "description": "Welcome to The Show all-star. The best selling and highest rated baseball franchise is back inMLB 10: The Showthrowing you into an unsurpassed baseball experience where big moments come alive. It&rsquo;s all here too. In addition to a wealth of improvements to longtime franchise features this newest release includes the return of the Home Run Derby, MLB All-Star Futures Game, Movie Maker, Catcher Mode, Personalized cheers and yells and Joe Mauer, newly crowned American League MVP, as the new cover athlete. So get ready,The Showis about to begin and you are leading off..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }The return of the Home Run Derby.View larger.Game calling from the catcher position.View larger.New fielding and pitcher training options.View larger.11 new stadiums and 1,250 new gameplay animations.View larger.The Return of Home Run DerbyThe arcade style action of the Home Run Derby returns inMLB 10: The Show. Available through a variety play options, including season modes and a stand-alone mode that can be selected at any time, Home Run Derby is based on the MLB rules and flow of the actual MLB All-star game. In addition, the MLB All-star Futures Game is also available via season modes in its correct timeframe (just before the HR Derby). Will your Road to The Show player be invited to compete in the Home Run Derby or the Futures Game? Swing for the fences and keep your stats high and you may just get the call as the All-star break approaches.Call the Game as CatcherThe catcher is the brains of any defensive squad on the field, and as suchMLB 10: The Showlets you test both your baseball IQ and your skills in the crouch as you call the game, one pitch at a time, from behind the plate. Available during Road to The Show, and exhibition game play options, players cultivate their rookie Minor League catcher and bring him up to the Majors where he can lay down signs to your pitcher, offer additional pitch selections if his first pitch call is shaken off and even change signs at will, all via your controller's face buttons. Pitches are called from a unique first-person perspective, after which the camera angle changes to a standard third-person perspective affording a better view of the entire field. This new functionality defines a whole new level of strategy, demanding knowledge of pitches, opposing batters' tendencies and the state of your own pitcher's well-being, as well as the ability to check runners on base and handle and/or block balls that are in the dirt or wild.New Defensive Training OptionsNo ballplayer becomes a golden glove overnight. With that in mindMLB 10: The Showincludes new fielding and pitching training modes that augment the existing training functionality built into the game's improved Road to the Show mode. Fielding drills focus both on the basics of player's throwing arm, utilizing the new throw meter, as well as the more advanced combination of throwing and decision-making that players will need during game situations. Pitching training consists of a multi-pronged focus designed to improved control and accuracy. Training in these areas is available in isolated one-on-one battles known as \"Knockout,\" as well as simulated game situations, where goals are clearly defined for each drill.Key Game FeaturesA Wealth of New Features Including:MLB All-star Week consisting of the Home Run Derby and MLB All-star Futures Game.Full online season leagues with better multiplayer functionality.Catcher game calling functionality in certain modes.Movie Maker functionality to create personal highlight reels11 new StadiumsNew fielding and pitching training modesCustom music, fan yells, and chants.Improved Stadium Realism and Experience- From crowd ambiance to enhanced presentation system, even transitional daylight.Road to the Show v4.0&ndash; Play the way that you want to with multiple new options settings, a rewards/penalty system based on play and a new, more accessible stat tracking system.Improved Online Gameplay&ndash; This year the online gameplay experience has been vastly improved and will detect and respond better to adverse network conditions along with reduced bandwidth to help the speed and flow of online gameplay.Full Online Season Leagues&ndash; Fully functional online season leagues, save and display MLB Player stats, track player energy, allow for trades/injuries, and offer 40-man roster functionality.Real-time Presentations&ndash; More than 1,250 new gameplay animations, more than 1,000 new presentation animations, and more than 400 personalized pitcher and batter animations.New Stadiums Available&ndash; The PlayStation 3 version ofMLB 10: The Showincludes five new Minor League stadiums, as well as classic parks including Forbes Field, Crosley Field, Polo Grounds, Shibe Park, Sportsman Park, and Griffith Stadium.Additional Features&ndash; Additional features include: multiplayer support, in-game messaging, voice chat, custom soundtracks, add-on content and HD support up to 1080p.", "price": 25.53, "imUrl": "http://ecx.images-amazon.com/images/I/617GS3j7NrL._SY300_.jpg", "related": {"also_bought": ["B001O0EGLE", "B004DI5H26", "B000K9Q5U0", "B003IMGC9U", "B002I0J4FW", "B00386VMWI", "B00127PZCS", "B001CPBLLE", "B001UU1WN8", "B003HFC22Y", "B002W5GIAW", "B00420K18K", "B00647615G", "B0025KZV7U", "B003O6E5OE", "B001S86IRC", "B000FPOJOS", "B000V4TXN0", "B002C7RBFQ", "B001C4DKG4", "B000P0XA34", "B004WL4LP8", "B000JHH85Y", "B004P8CKS8", "B002BCVFRM", "B000P0SETO", "B000QB05A8", "B004CDGFRI", "B0018DE9OG", "B002I0K9I8", "B001AZ7RLY", "B001B0BB42", "B003UT9XI8", "B001LX4BLY", "B0012N7BSI", "B0056WJA4E", "B000QB05AI", "B001AZ7RJQ", "B000JLP02S", "B002I0HIMI", "B003KZJA9Y", "B000OQ3TR6", "B000M5KPY4", "B000TG72OM", "B00386PJRM", "B006VB2UNC", "B001B0BB4W", "B006JKARN0", "B003VKLA8C", "B006VB2UMI", "B0030CYE8O", "B00160HY3E", "B00A750QIE", "B00118T6FK", "B003O6E3QY", "B000JCE30C", "B001R3UX42", "B002WF13AM", "B002BCQ7NE", "B000RHZ9HA", "B002I0K74Y", "B002I0K8JI", "B004Z4ZKL6", "B000LV6PI4", "B007YZ5QOO", "B000JHO4CO", "B003LDKJJ0", "B004X56PWK", "B0012N5MIO", "B0053BG3NY", "B006D3JT1E", "B000WSE3BC"], "bought_together": ["B003IMGC9U", "B002I0J4FW"], "buy_after_viewing": ["B004DI5H26", "B003IMGC9U", "B00420K18K", "B00647615G"]}, "salesRank": {"Video Games": 5097}, "categories": [["Video Games", "Kids & Family", "PlayStation 3", "Games"], ["Video Games", "PlayStation 3", "Games"]]}