{"asin": "B002P8M6DE", "description": "Unleash the power of a live rock and roll concert with the Altec Lansing Stage-Gig amplified speaker. Designed specially for use with Guitar Hero, DJ Hero, Rock Band, and other rhythm games, this portable speaker brings 40 watts of power for thumping bass and thrilling highs at all of your performances. With a tough, road-ready design and additional outlets that let you plug in a second speaker, the Stage-Gig lets you feel the electricity of the stage, wherever you go.The Stage-GigAmplified SpeakerAt a Glance:Designed for Guitar Hero&reg;, DJ Hero&reg;, and Rock Band&reg;Compatible with most game consoles40-watt speaker; 6.5-inch wooferTough, durable design with grab-and-go handleBulit-in AC and RCA connections to link Stage-Gigs togetherRock Band and Guitar Herohave never sounded better.Click for additional features.Amplify the Anthems of Guitar Hero and Rock BandPlayers of Guitar Hero&reg;, DJ Hero&reg;, and Rock Band&reg; know that television speakers don't always capture the thrill of a rock and roll performance. The Stage-Gig provides a solution by recreating the electric feel of a live concert.With the look and feel of a professional stage amp, the Stage-Gig kicks out 40 watts of crushing power as well as monstrous bass, thanks to its 6.5-inch, high-performance sub-woofer. A specially engineered horn-loaded silk tweeter provides wide dispersion to make each player sound like a pro. The Stage-Gig works especially well with multi-instrument games, where the drums and vocals are often lost when heard through traditional TV speakers.Compatible with Most Game ConsolesDesigned for use with just about any gaming systems, including Microsoft&reg; Xbox 360&reg;, Nintendo Wii&reg; and Sony&reg; PlayStation&reg; 2 & 3, the Stage-Gig plugs in to your game console using two sets of RCA cables (one set is included). For ultimate stereo sound, the built-in AC outlet and RCA outputs give you the option of plugging in a second Stage-Gig speaker (sold separately).Durable and Road-ReadyWith a grab-and-go handle, you'll quickly be staging heart-pounding concerts wherever you go. The Stage-Gig features a tough and durable design with corner guards that will withstand the perils of the road. Convenient inputs, rugged knobs, and cool LED lights will turn any room in the house into a live music venue.What's in the BoxStage-Gig portable amplified speaker, 10-inch RCA cable, and quick connect guide.40 watts of power and Audio Alignment&trade; technology ensure that multi-instrument performances come through loud and clear.", "title": "Altec Lansing RM3010 Stage-Gig Amplified Speaker for Rock Band and Guitar Hero (Black)", "price": 76.99, "imUrl": "http://ecx.images-amazon.com/images/I/41b5ulGSKNL._SX300_.jpg", "related": {"also_bought": ["B000067RBT", "B00004Z5CP", "B000068O3V", "B000068O17", "B000UZA7PI", "B000068O3S", "B000068O4W", "B0016LFN2C", "B002K7ULJQ", "B003PNFM7A", "B000V1RLI2", "B00067JSM8", "B000068O1B", "B004YEBK66", "B000068O53", "B005HGM1D6", "B000I23TTE"], "bought_together": ["B000067RBT", "B00004Z5CP"], "buy_after_viewing": ["B002PAW6AU", "B0071V3EBI", "B003VGUGBS", "B002I636XM"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}