{"asin": "B000FPXOJO", "categories": [["Electronics", "Security & Surveillance", "Home Security Systems"]], "description": "Would you like to be alerted when ...\n\nCars are coming up the driveway &#x2022; Children go inside your tool shed &#x2022; Intruders approach the front or backyard &#x2022; Someone enters your garage &#x2022; Visitors are walking to the front door &#x2022; Your parked boat or motor home has been boarded &#x2022; Kids or pets are trampling your flowers\n\n...then you need the Voice Alert System-6.\n\nSystem-6 allows a maximum of six user recorded messages. Each message is specific to one zone. For instance, zone one could be for a driveway alarm -\"Car coming up the driveway\" while zone two could be for a sensor monitoring the back yard- \"Alert! Child by the pool!\" Perhaps a third sensor guards a side entrance against intruders. However, when this PIR detects movement, the base unit plays \"Intruder on patio\" and triggers a floodlight using one of four relays included on the base unit. System-6 can monitor all three zones simultaneously and still have three additional zones available when needed. Users can alter their messages and place the wireless sensors wherever they wish.\n\nVoice Alert System-6 sets up in minutes and can be completely customized to fit their individual needs. The wireless PIRs feature: all weather protection, adjustable mounting and sensitivity, and can send a signal 300 feet through walls and up to 1000 feet in open space.", "title": "Voice Alert System-6 Home/driveway Alarm", "price": 130.45, "imUrl": "http://ecx.images-amazon.com/images/I/417pTyz%2BGlL._SY300_.jpg", "brand": "Cross Point Industries", "related": {"also_bought": ["B0006890KW", "B0000645RH", "B00H0FO6BC", "B008X099PQ", "B004LXZ55W", "B003CWK4JK", "B00FPE6UN2", "B008X099WY", "B00EP6I6QU", "B0033BG3HM", "B003P5KJJO", "B00523AMBC", "B004NKSPR8", "B004D8NZ52", "B00CP7JNIQ", "B002PNI5SY"], "bought_together": ["B0006890KW", "B0000645RH"], "buy_after_viewing": ["B002ISVJL6", "B003CWK4JK", "B0006890KW", "B002ISZD2C"]}}