{"asin": "B002O11LQA", "description": "- NewAltura Photo Camera Body and Rear Lens Caps for Sony Cameras- Designed to fit Sony body and lens.- Body cap will protect your camera's delicate sensors from dust and dirt when a lens is not mounted.- Rear lens caps are for protecting the rear mount of your lenses from accidental scratches or impact when not attached to the camera.- Made of high impact plastic for extra durability.- PremiumMagicFiber Microfiber Cleaning Cloth- Ultra gentle! Extremely fine microfiber leaves zero scratches, streaks or marks. Safe for all lenses.- Features special saw tooth pattern edges. Other sellers' cloths have unfinished edges that will fray easily, the weave becoming undone and threads pulling out easily. Our microfibers are made with premium materials and designed to the highest standard of quality.- Ideal for cleaning oil and dirt off eyeglasses, iPhone/iPad and other touch screens, binocular lenses, digital SLR and other camera lenses, GPS devices, and other delicate optics.- Clean without the need of soaps or detergents. Wipe down kids' toys, cribs, stainless steel counters and other areas you want to keep chemical free.- Great value for your money. Reusable and long lasting. No more paper towel and tissue waste.- Extremely handy! Keep one in your office, home office, laptop bag, camera bag and car.- Size: 6 x 7 inches (15cm x 18cm)- Each microfiber is individually and neatly packed in it's own polyurethane plastic bag for long term safekeeping.", "title": "Altura Photo Camera Body Cover Cap and Rear Lens Cap for SONY Alpha Series AF System in the A99 A77 A65 A58 A57 A55 A33 A900 A850 A700 A580 A560 A550 A500 A450 A390 A380 A330 A300 A290 A230 A100 DSLR Cameras + MagicFiber Microfiber Lens Cleaning Cloth", "price": 5.99, "imUrl": "http://ecx.images-amazon.com/images/I/41ye4nzMlRL._SY300_.jpg", "related": {"also_bought": ["B007PCP47A", "B000JC5GSK", "B003MQWN40", "B001O81FNS", "B00AE8EAW2", "B0042UC5BG", "B000UPNQCY", "B00COR9DWI", "B003Y2PK92", "B007YCA6UG", "B0040RWN0O", "B003URJP5Q", "B0042GHI8U", "B001XWTTOC", "B0094KJUBM", "B008OZU33C", "B005OB2L7U", "B00GSAEN4A", "B003LYKLCO", "B000JC5KCM", "B0094KJTWM", "1133948863", "B00004ZCJH", "B0080JH3YE", "B0046RZUEE", "B000DZH9H4", "B0042JAGY0", "B000JC75Q6", "B0069TIA12", "B002KEWUVG", "B0016120M8", "B0097DFRMC", "B008OMOEO4", "B0097DFR8G", "1133597122", "B0029U0X1A", "B00603RYG4", "B004EHW81Y", "B00EIIM2OW", "B008KYA0GM", "1285838424", "B0029U0X24", "B002G2BTTQ", "B00009R6K1", "B005E8MVDC", "B00ADHLN7O", "B0017U0WM8", "B00B7ID99I", "B004Z4G8AI", "B007PZALFC", "B0054EPPVQ", "B00BJGNRR2", "B005N3TPJQ", "B002VPE1WK", "B001G45VTE", "B002KDQQFI", "B002LU3DLA", "B0012DHL10", "B0001Y6J14", "B0049WBZEK", "B007G5NNOW", "B001G9YEXS", "B0087NBZTM"], "bought_together": ["B007PCP47A", "B000JC5GSK"], "buy_after_viewing": ["B000JC5GSK", "B007PCP47A", "B004NE4OKQ", "B005N3TPJQ"]}, "categories": [["Electronics", "Camera & Photo", "Accessories", "Lens Accessories", "Lens Caps"]]}