{"asin": "B001EQ4C8U", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "From a 10x optical zoom lens to advanced Canon technology that automatically gives you the best shot, the 9.0-megapixel PowerShot SX110 IS packs impressive value. Advanced Face Detection Technology automatically sets focus, exposure, flash and white balance for beautiful portraits and group shots. Sharp, steady close-ups are easy with the powerful zoom and Canon&#x92;s Optical Image Stabilizer Technology. The slim and modern-looking SX110 IS is sized to go everywhere, and you&#x92;ll never miss a detail with the big, bright LCD screen.PowerShot SX110IS Highlights10x optical zoom in actionZoom in for sharp, steady close-ups with Canon&#x92;s 10x Optical Zoom lensThe PowerShot SX110 IS has a 10x optical zoom lens that makes it easy to get the inspiring, emotive close-ups that will make your images lasting keepsakes. This magnificent lens gives you the power to shoot distant subjects with razor-sharp precision and stunning lifelike color. So you can brilliantly capture a bird high atop a tree, a child&#x92;s winning goal from across the stadium or a school play from the last row. Plus, thanks to Canon&#x92;s highly sophisticated Optical Image Stabilizer Technology, even at maximum zoom, every image is rock steady.The PowerShot SX110 IS is equipped with Canon&#x92;s acclaimed Optical Image Stabilizer Technology that automatically detects and corrects camera shake -- one of the leading causes of fuzzy or blurred shots. Even when zoomed in, you can get the steady, crisp, brilliant images you&#x92;ll be proud to shoot and share. And Canon&#x92;s Optical Image Stabilizer Technology is convenient to use. It functions perfectly with or without a flash.DIGIC III Image Processor with Genuine Canon Face Detection AF/AE/FE/WBWith DIGIC III, your images boast superior quality, the camera operates at top efficiency and battery life is enhanced. What&#x92;s more, DIGIC III enables Canon&#x92;s Face Detection, Motion Detection Technologies and Red-eye Correction to give you better, more true-to-life people shots. Simply press the shutter button halfway down, and the camera automatically pinpoints the faces in the scene and chooses the ideal focus point. The camera controls exposure settings and flash to keep every face looking bright and natural. The camera also selects and sets the optimal exposure and ISO settings automatically to keep everything looking sharp and clear. Red-eye Correction can be handled in-camera, in two ways. The Red-eye Correction during shooting uses the Face Detection Technology to recognize and remove red-eye from images as they're taken, before the file is written to the memory card. It's also possible to correct red-eye during image playback, using simple settings in the SX110 IS's menu.iSAPS Technologyis an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the fast DIGIC III Image Processor to improve focus speed and accuracy, as well as exposure and white balance.Capture great shots with Face Detection AF/AE/FEDIGIC III features Face Detection Technologies, giving you the best possible results in any shooting situation. Face Detection AF/AE sets the focus point and exposure for the faces of your subjects. Face Detection FE adjusts the flash to correctly illuminate your subject to provide the best balance between your subject and the overall scene, eliminating the common problems of over and underexposed faces. Face Detection WB means the camera concentrates upon faces when calculating white balance for the best possible skin tones. Face Select and Track lets you highlight one face among several in a scene, and the camera concentrates on that person, even as they move around the scene. Face Detection Technology is a powerful contributing factor in Canon's Motion Detection Technology. Simply press the Face Selector Button, then the selected face is double-framed and tracked when the face moves in the frame.Motion Detection Technologyworks in the background to instantly evaluate how fast your subject is moving. It automatically selects and sets the optimal exposure and ISO settings to keep everything looking sharp and clear. This feature provides higher ISOs when you need it for action-stopping shutter speeds. But when no movement is detected, it sets lower ISOs for excellent color and detail. Life doesn&#x92;t give you second chances to capture special times. That&#x92;s why the PowerShot SX110 IS features ISO 1600 and High ISO Auto settings that reduce the effects of camera shake and sharpen subjects in low-light situations, giving you greater shooting flexibility.Red-eye Correctionprovides three options for removing red-eye from subjects in flash pictures.1) The Red-eye Correction during shooting actually identifies and corrects red-eye in human subjects as pictures are taken.2) The SX110 IS can be set to automatically detect and correct red-eye during image playback.3) You can manually locate any red eyes in a scene during image playback on the LCD screen, and command the camera to remove them.Slim, modern shape and a big LCDTake your camera everywhere with this new slim design and large, bright 3.0-inch LCD. You&#x92;ll want to have your PowerShot SX110 IS with you wherever you go, and a slim new design makes it easy. Subtly rounded for an easy grip, the camera exudes modern elegance and simplicity. The back panel&#x92;s neat, intuitive interface includes a luxuriously big 3.0-inch LCD screen. And the LCD screen&#x92;s quality is as impressive as its size: you&#x92;ll get an exceptionally clear, bright view of all your shots, and enjoy a conveniently wide viewing angle for showing off your pictures to friends and family.AA batteries for power anywhereConveniently, you don&#x92;t need to worry about running out or recharging of batteries. Since AA-size batteries can be purchased at any store, simply get new ones locally -- no special power adapters or chargers are needed wherever you go.A wide range of shooting modes to capture anythingNow you&#x92;re free to concentrate on what really counts -- your subject. With the large simple-to-operate Mode Dial, all you have to do is turn to the setting that best matches the scene you&#x92;re viewing through the lens. The PowerShot SX110 IS does the rest. It chooses the perfect exposure, aperture and flash. Or if you want to flex your creative muscles, choose Manual Control and do it all yourself. You&#x92;ve got Special Scenes Modes to handle a wide range of common shooting situations -- effortlessly.With 20 Shooting Modes including 8 Special Scene Modes, you&#x92;re ready for whatever shot comes your way.The Complete Print SolutionThe PowerShot SX110 IS's Print/Share button makes direct printing easier than ever. Simply connect the SX110 IS to a Canon PIXMA Photo Printer or SELPHY Compact Photo Printer or any PictBridge compatible photo printer, press the lighted Print/Share button and print! Also use the Print/Share button to transfer images to a computer (Windows and Macintosh).Print your own ID photos in up to 28 different sizes or use the Movie Print function to output multiple stills from a recorded movie on a single sheet with a Canon SELPHY Compact Photo Printer.", "title": "Canon Powershot SX110IS 9MP Digital Camera with 10x Optical Image Stabilized Zoom (Black)", "price": 222.07, "salesRank": {"Camera &amp; Photo": 2258}, "imUrl": "http://ecx.images-amazon.com/images/I/414Gp1sib4L._SX300_.jpg", "related": {"also_bought": ["B00006CFDO", "B001NDIZAK", "B0042SA5U6", "B002LITT3S", "B0021XW3YU", "B003ZSHNG8", "B000V1VG4W", "B000HARTYI"], "buy_after_viewing": ["B003VNKNEQ", "B003ZSHNG8", "B00908BQCY", "B003F7DWH8"]}}