{"asin": "B00093IIRA", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Remote Controls", "TV Remote Controls"]], "description": "From the ManufacturerHarmony 880: Power and Versatility in a Universal RemoteThe Logitech Harmony 880 Advanced Universal Remote puts you in control of your entire audio-video system with just one button. It's home entertainment the way it should be--simple.Optimized for complicated HDTV and PVR systems, the Harmony 880 helps you tame tough configurations like switching your television between video aspect ratios depending on the program source. The interactive color display lets you quickly choose a 16:9 ratio for movies and HDTV, or a standard 4:3 ratio for basic television programming.&nbsp;&nbsp;Color displayWhy settle for another boring remote?&nbsp; The Harmony 880&acute;s color LCD is both functional and stylish, with user-customizable backgrounds, activity selections, button icons and text.Ample space for up to eight custom activities or controlsOn-screen battery level indicator shows you charge statusRecharging stationNever replace batteries again. The Harmony 880 includes a sleek docking station that keeps the remote fully charged. Your family will always know where to put the remote&mdash;and you&acute;ll always know where to find it!&nbsp;&nbsp;Lithium-ion battery provides up to a one-week charge under normal useThe horizontal docking station allows remote to be used while chargingAward-winning Logitech Industrial DesignHigh-end systems deserve a high-end remote.&nbsp; Designed with brushed chrome and charcoal accents, a color LCD display and a low-profile recharging station, the Harmony&reg; 880 Remote will match your most advanced audio-video components perfectly.&nbsp;Logitech has won a total of eight Industrial Design Excellence Awards (IDEA) in the past two years, including five of Japan&acute;s prestigious 2004 Good Design Awards. This experience helped us design the Harmony 880.&nbsp; Featuring a comfort grip shape and a centered directional pad, it fits easily in your hand and naturally guides you to the most frequently used controls.&nbsp; Even the buttons are sculpted, to help you locate them by feel not sight.&nbsp;Patented Smart State Technology&reg;Smart State Technology allows the Harmony remote to completely control an entertainment system by knowing how to control each separate component while tracking the current state of up to 15 devices simultaneously.Get the Logitech Harmony Adapter for PLAYSTATION 3. Finally, control movies on your PS3 &mdash; drama free.Wish you could control all your movies, music, games and entertainment gear &mdash; including your PLAYSTATION 3 &mdash; with one remote? Wish granted.Add one touch PS3 control to any Harmony remote with the new Logitech Harmony Adapter for PLAYSTATION 3. Now your entire entertainment system and every PS3 command is at your fingertips. Want to watch a DVD or Blue-ray Disc movie? Play a game? Turn the console on or off? Easy. Just press one button on the remote to experience instant entertainment gratification.Easy to set-upEasy to useEasy to get helpNever out of datePackage ContentsHarmony&reg; 880 remote controlRecharging StationAC adapterUSB cableLithium-ion batteryInstallation CDInstallation guideSystem RequirementsIBM&reg; compatible PCWindows&reg; 98, 2000, Me, XPUSB portCD-ROM driveInternet accessMacintosh&reg;Macintosh&reg; OS X 10.2 or laterUSB portCD-ROM driveInternet access", "title": "Logitech Harmony 880 Advanced Universal Remote Control", "price": 379.99, "imUrl": "http://ecx.images-amazon.com/images/I/51DGYVDFE1L._SY300_.jpg", "brand": "Logitech", "related": {"also_bought": ["B003LZYXYU", "B00729DFEA", "B003TX2N14", "B003LZ4LSS", "B001U5C2EG", "B00267S7XW", "B001U5BY8G", "B007C81JL2", "B00CF3HJS6", "B009ZGK6QS", "B009EIUH6G", "B005FO43OU", "B004OVECU0", "B00DHM30U0", "B003UTBDLS"], "bought_together": ["B003LZYXYU", "B003TX2N14"], "buy_after_viewing": ["B004OVECU0", "B00BQ5RY1G", "B00BQ5RYI4", "B00BQ5RYI4", "B002IC0YLS"]}}