{"asin": "B00005QEFD", "description": "Though it looks like a toy, don't be fooled: the Nintendo GameCube is a powerful video game console that rightly deserves its place among the other next-generation game systems. In fact, its playful, appealing design and small size (the unit is a not-quite-cubed 6 inches) aren't the only features that set it apart from the others.For starters, Nintendo has quite clearly made this a game-only machine. It doesn't try to play your CD collection, run your movies, read your e-mail, or store your MP3 files. The company has concentrated its efforts on games. All the prelaunch titles we've seen play smoothly, with bright, fast graphics and great sound. Nintendo says its engineers have removed traditional bottlenecks that have, in the past, slowed down processing. New components designed by IBM and MoSys, as well as a large-capacity secondary memory cache, keep instructions moving through the system's microprocessor (MPU) at peak levels. In English: the GameCube is optimized to push speed up while pushing costs down; hence its position at the lower end of the price spectrum.The GameCube is the first Nintendo video game system to use a disc-based medium rather than cartridges for its games. Moving the software to disc media generally means lower development costs for the publishers, which, in turn, trickles down to the consumer not only in price, but also in availability and quality, as it's then easier to try out untested game ideas (Pikmin, anyone?). While most other systems likewise have their games stored on discs, the GameCube's 3-inch format is smaller than everyone else's, and is so designed to fit in a shirt pocket as much as to deter would-be software pirates.Of course, the main advantage of the GameCube is that it's the home field of one of the world's premier game designers: Nintendo. While powerhouses Electronic Arts and Sega make games for all systems (including this one), you can play Nintendo games only on a Nintendo system. And Nintendo, you might recall, has been hitting them out of the park since it started withDonkey Kong. In fact, here's a roll call of characters and series you won't find on the other consoles: Mario,Legend of Zelda,Perfect Dark, Metroid, Kirby, and, of course, Pok&#xE9;mon. A few names that the GameCube will share with the other guys: Madden, Tony Hawk, Sonic, Batman, andStar Wars.The system also comes with four built-in controller ports, so you can easily plug in extra controllers and let friends join in for the multiplayer games--it's even got a built-in handle so you can easily move it to a friend's house. It comes with two memory card slots for saving your progress through games, and there's the capacity for future expansion into the world of online gaming.In short, the GameCube isn't an all-in-one entertainment system, and neither is it the most powerful of the modern video game consoles. But for video game enthusiasts who want to stick with their favorite characters, its value cannot be beat.--Porter B. HallUnit SpecificationsMPU (Microprocessor Unit):485 MHz custom IBM PowerPC GekkoGraphics Processor:162 MHz custom ATI/Nintendo FlipperTexture-Read Bandwidth:10.4 GB per second (peak)Main Memory Bandwidth:2.6 GB per second (peak)Pixel Depth:24-bit color, 24-bit Z bufferSound Processor:81 MHz custom Macronix 16-bit DSPSound Performance:64 simultaneous channels, ADPCM encodingPolygon Performance:6 to 12 million polygons per second (peak)System Memory:40 MBMain Memory:24 MB MoSys 1T-SRAMDisc Drive:128 ms CAV (Constant Angular Velocity) systemData Transfer Speed:16 Mbps to 25 MbpsMedia:3-inch, 1.5 GB capacity discController Ports:FourMemory Card Slots:TwoAudio-Video Output:Analog and digitalDimensions:4.3 by 5.9 by 6.3 inches (height by width by depth)", "price": 11.99, "imUrl": "http://ecx.images-amazon.com/images/I/415W1WM4KCL._SY300_.jpg", "related": {"also_bought": ["B000ARPXU0", "B00012D0SG", "B00095KU5G", "B00005Q8M0", "B002FY4AOG", "B00009WAUD", "B002L8W5V6", "B00006DY1M", "9861019731", "B000066JRN", "B000A15K0Y", "B000084318", "B00006FWTX", "B002L93F0A", "B0000E5U6I", "B000L9NPGG", "B000B8J7JQ", "B004CHLNWQ", "B0009XEC0C", "B0000657SP", "B00006IJJK", "B00005Q8LR", "B0009UBR3A", "B0002ILS1K", "B00009WAUF", "B00006LEMY", "B00006HBTW", "B000AQA9UA", "B0009XSMNA", "B002GCJOC0", "B000641ZC2", "B00005QDPZ", "B000UY2TJG", "B000090W86", "B00005QDQ1", "B000067QW2", "B0002A6CQ4", "B000069BB0", "B0017KIBAI", "B000095ZHA", "B0009Z3MGA", "B00006599U", "B0000E5U6K", "B002C5BMFI", "B000094G2O", "B000N1IZOO", "B00005QEFG", "B00009WAUH", "B00005Q8LY", "B00006LU9B", "B00009PS22", "B00008H2IS", "B00005ULXN", "B0000AHOON", "B0000A1OG4", "B000UQCER6", "B00205DV7C", "B0000A2Y96", "B0002Y5180", "B0000A0O28", "B00433XHI2", "B00006966U", "B000E36ONK", "B00006LELI", "B0000DI6BB", "B00009VE5I", "B0000A03CX", "B0001OK7VW", "B00006JN5O", "B0009Z3I0K", "B0001B167O", "B000FDOU9E", "B00008DHLV", "B00009VE6B", "B000ARJI88", "B0002OOUZU", "B00009PS24", "B0002ILS24", "B00AKIVBU0", "B0000A09EN", "B0002ILS1U", "B000AS3AB8", "B0000E5U6M", "B00005BOSF", "B00005Q8LG", "B001AI7CF2", "B000UZPFQ4", "B00009KO3S", "B0000ARQMX", "B00005QEFF", "B00006YXLE", "B00009WAUB", "B00007KUUD", "B00433XWFU", "B00005Q8M4", "B0000E5U6N", "B002TK1PX0", "B00008KTWH", "B000075B64"], "buy_after_viewing": ["B00006IJJI", "B002L8W5V6", "B000ARPXU0", "B00012D0SG"]}, "salesRank": {"Video Games": 910}, "categories": [["Video Games", "More Systems", "GameCube", "Hardware", "Consoles"]]}