{"asin": "B0009GZAGO", "description": "Nikon's D50 interchangeable-lens digital SLR camera is designed to make it easier than ever to enjoy the thrill of outstanding digital SLR picture quality easily and instantly. Combining the outstanding response of Nikon's patented digital and photographic performance with optical performance available only from renowned Nikkor interchangeable lenses and expanded shooting options only available in a quality digital SLR camera, the Nikon D50 makes exceptional digital SLR photography a reality for everyone.The next evolution of Nikon's scene-optimized Digital Vari-Program modes simplifies picture taking, freeing the photographer to concentrate on capturing the evanescence of special moments. Selecting one of the seven easily distinguishable icons from the handy exposure mode dial optimizes otherwise complex settings and ISO-equivalent sensitivity to produce consistently remarkable results. Newly added is Child mode, which makes it easier to take memorable pictures of the little ones complete with ideal vivid color and contrast--ready to print beautifully without the fuss of later adjustments at the computer. Full manual exposure control is also available, allowing more advanced photographers all the creative freedom they desire while also making it possible for all photographers to expand their enjoyment of photography.The D50 features a new 6.1 effective megapixel Nikon DX Format CCD image sensor and a highly advanced image processing engine that team together to create truly faithful image files that are capable of significant enlargement while remaining manageable in overall file size, making it easier to take and store more great pictures. These optimized components produce more consistent results, even under shooting conditions that challenge other digital cameras, such as when working with light-colored subjects or long exposure shots.Distinguishing itself over lesser systems, the Nikon D50 is always ready to shoot when that special moment or expression presents itself. When the power is turned on, the camera is ready to shoot in just 0.2 seconds for near-instant readiness. The shutter's release lag time is also minimized for near-instant response that virtually eliminates a common frustration of digital photography.The D50 is capable of continuous shooting at 2.5 frames per second for bursts of up to 137 pictures.Continuous shooting at 2.5 frames per second can be maintained for bursts of up to 137 pictures, making action photography a reality. Pictures taken are instantly processed and recorded to the photographer's compact SD (Secure Digital) memory card. A new USB 2.0 Hi-Speed interface supports faster transfer of images when connected to a compatible computer.Shutter speed choices extend from 30 seconds to an action-stopping 1/4,000 second. A high-speed flash sync speed up to 1/500 second makes great fill flash photography possible, and Nikon technology makes it automatic. A bulb setting is also included for long exposures. The shutter is designed to ensure fast curtain action for consistent operation and accurate, predictable results, even at high shutter speed settings. Auto ISO maximizes available light by automatically setting ISO-equivalent sensitivity across the available range of 200 to 1600. D50 photographers can also opt to set the ISO sensitivity manually for personal control.The D50's 5-area autofocus system inherits Nikon's proven cross-type center sensor, broad frame coverage, and class-leading low-light detection found only in the award-winning Nikon D70 camera, and it delivers even greater AF precision with fast, more consistent subject acquisition and improved focus tracking. The new system adopts AF-A mode for smooth automated operation that switches between AF-S (single-servo autofocus) and AF-C (continuous-servo autofocus) depending on the movement of the subject in the framed shot. An AF-assist illuminator is also included, which helps maximize performance when shooting in low lighting conditions.The D50 produces consistently natural coloration by measuring the entire frame of the shot and matching white balance to the light source. Advanced auto white balance handles most lighting situations, but the flexible options include a choice of six specific manual settings, white balance bracketing for added creative choice of results, as well as a preset option for using a gray or white object as a calibrating reference under mixed lighting conditions.Nikon's new 3D Color Matrix Metering II ensures accurate exposure control in most types of lighting situations by automatically comparing input from its frame-wide 420-pixel sensor for each scene to a large onboard database of over 30,000 scenes from actual photography. Professionals and amateurs alike rely on Nikon's exclusive light metering technologies that produce ideal exposures instantly. Newly developed exposure evaluation methods detect highlights and shadows in the frame and compensate for them to help minimize under- or over-exposure by comparing the lighting pattern of the frame with the onboard database of scenes, thus enhancing performance for more accurate and consistent exposures.A key advantage and one source of the fun associated with Nikon digital SLR photography is the ability to take advantage of the creative possibilities offered by interchangeable lenses. The new D50 offers seamless compatibility with Nikon's extensive family of high-performance AF Nikkor lenses, as well as the expanding family of digital-dedicated DX Nikkor lenses, providing superb color reproduction, razor-sharp image clarity, and fast and accurate autofocus performance.The compact, lightweight design of the new D50 makes it easy to carry on any outing, while its body contours and easily accessible controls provide handling efficiency and easy operation. Newly designed on-screen menus present clear and helpful user information in plain language on the D50's large 2.0-inch LCD monitor, and intuitive help dialogs are available for on-the-spot reference to the respective menu selections. The high-capacity rechargeable lithium-ion battery helps extend mobility and convenience by delivering the power to shoot up to 2,000 images on a single charge.The D50's 2.0-inch LCD display is larger than the 1.8-inch screens found in cameras such as the Canon Digital Rebel XT.The D50 is an outstanding performer, right down to its diverse playback options, versatile custom settings, USB 2.0 Hi-Speed interface for easy connectivity or direct printing to any PictBridge compatible printer with in-camera page setup, and Nikon's complimentary PictureProject software that will extend anyone's photographic experience with easy image transfers, effective image organization and editing, creative page layout design, plus printing and sharing. PictureProject's new version 1.5 provides customers with an exceptional added value topped only by its excellent performance.These inherent advantages combine with the empowering and creatively inspiring components of Nikon's Total Imaging System, including high-quality AF and DX Nikkor lenses, Speedlights and Nikon's Creative Lighting System, as well as versatile software options, to deliver a new level of operating ease, expanded creative possibilities, and pure enjoyment. The Nikon D50 presents the perfect opportunity for anyone to start enjoying the advantages of Nikon digital SLR photography today.", "title": "Nikon D50 DSLR Camera (Body Only) (OLD MODEL)", "imUrl": "http://ecx.images-amazon.com/images/I/41gmasGSECL._SY300_.jpg", "related": {"also_bought": ["B00005LEN4", "B000LWJ1ES", "B0049VZ4XE", "0471787469", "B000ERDPJ2", "B000O161X0", "B000ZMCILW", "B0009HN57E", "B001ET5U92", "B000HGMX5M", "B00009R6VS", "B000FGNM6I", "B000BY52NK", "B002ZHWW8E", "B004DEKH84", "B0009HN57Y", "B000P5AJXI", "B005DIYQA4", "B0009RGLSE", "B00005LE77", "B0029U7PZM", "B0009I4VE4", "B003ZSHNCC", "B000W05O5O"], "bought_together": ["B00005LEN4"], "buy_after_viewing": ["B002ZHWW8E", "B000BQ7GW8", "B0029U7PZM", "B00006I5J7"]}, "salesRank": {"Camera &amp; Photo": 5867}, "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]]}