{"asin": "B001IOY4Z4", "description": "The Altec Lansing M402SR Moondance Glow packages iPod/MP3-player functionality with an alarm clock, wireless remote snooze, and FM radio--plus a multicolored nightlight function--to create an exceptionally unique bedroom-specific sound system.Altec Lansing packaged its renowned audio performance into an elegant, compact alarm clock, with a unique wireless snooze remote.Click to enlarge.With its two 3-inch full-range drivers and a unique multicolor, diffused illumination system, the Moondance Glow is a genuine delight of sound--and sight!The integrated diffused lighting system allows lets you set the perfect illuminated ambiance with 17 user-definable colors, various brightness intensities, and manually activated on/off.Click to enlarge.A remote control is included.Click to enlarge.Escape to Your Musical OasisThe bedroom has become important personal living space--a sanctuary, an oasis, and a place to recharge. More than just a bedside alarm clock, the Moondance Glow is designed with a feature set that dramatically enhances the bedroom environment. Altec Lansing started with big audio and then added the iPod dock and alarm clock. The system features two 3-inch full-range drivers that deliver exceptional stereo clarity.Adjustable Lighting Sets the MoodUnderstanding that the bedroom is a place with many moods, Altec Lansing added a diffused lighting system that lets you select between 17 colors and any intensity to create the perfect illuminated ambiance. It's perfect for individual use, for entertaining, or as a white-noise-and-nighlight system for a child's bedroom.Innovative Snooze Remote Eases Your MorningThe Moondance Glow has a remote snooze alarm that enables this audio system to be placed anywhere in the bedroom for the best room-filling sound--not just on the bedside table like other alarm clocks. Simply touch the snooze alarm pad on the bedside table and, using a wireless RF signal, the alarm goes off across the room. This remote also serves to pause and play your tunes anytime during the day. The system's dual alarms allow you to wake by iPod, radio, another audio device, or alarm buzz.Full-featured Clock Display and Additional FeaturesThe visual command center is informative, intuitive, and user-adjustable, such as the light intensity and the size of clock digits. The LCD displays scrolling song and FM station data (RDS). The FM tuner has four station presets and wire antenna for superior reception. Back-lit touch capacitive buttons allow control of the system with the whisper press of a fingertip. Or, a remote control (separate from the wireless snooze control) provides across-the-room command of the speaker system functions, FM radio, alarm, and playlist song navigation. An auxiliary input connects a second audio source, including CD, DVD, and other MP3 players. And the Moondance Glow will keep your iPod charged, always ready to take and go.Its compact size (12.2 x 3.1 x 5.3 inches (W x D x H) conserves that precious space in your bedroom. Plus, the Moondance Glow is backed by a one-year warranty.What's in the BoxMoondance Glow stereo alarm clock, snooze remote pad and dongle, wireless remote control, iPod docking adapters, power supply, user's guide, and quick connect instructions.", "title": "Altec Lansing M402SR Moondance Glow Speaker System with Clock Radio, Snooze Remote, and iPod Dock (Black)", "price": 69.0, "imUrl": "http://ecx.images-amazon.com/images/I/51sKlJpFfdL._SY300_.jpg", "related": {"also_viewed": ["B002I636XM", "B0041Q38R6", "B005IVL0UA", "B0038W0N8G", "B005IVL0SM", "B002O3W3Y2", "B003M8HWDA", "B005IVL0U0", "B007PZYBSA", "B003ZQYVVK", "B002I636YG", "B004TS2AP2", "B002I3OZ7G", "B000XPG2YU", "B0040GWXG4", "B00BQ4HROG", "B004TS2AOS", "B0064XTQ98", "B003VX1EF8", "B00BQ4HRG4", "B000Z9UY2K", "B004SKBJ5S", "B007R66TZK", "B00GYHCUXI", "B0009F62GW", "B003SNITOA", "B001S0JZKW", "B001FWXDZQ", "B003XDU4BQ", "B00BQ4HRE6", "B004T0MW7Q", "B004OA6VZ0", "B0014XKQY2", "B005OYR9D8", "B003DZ9Z78", "B003SX0NF8", "B005GUAIJM", "B003B2N9CA", "B00FBJ55DC", "B004OA6VXC", "B003XDU4B6", "B001L9KMTI", "B004NBZAI4", "B003SX0NG2", "B003VWW3Q8", "B00K7FI8D4", "B00DXYDBMY", "B005GUAIBU", "B004TS2AO8", "B0028Y4H1O", "B002OB4BKI", "B00DJ69XFA"], "buy_after_viewing": ["B002I636XM", "B00BQ4HROG", "B00BQ4HROG", "B003WGRUQQ", "B009NZ6SZE"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}