{"asin": "B001TX9P6W", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]], "description": "As children, our imaginations run wild and finger-painted artistic creations are proudly displayed on our family refrigerators. But as we grow older, we learn to color inside the lines, and have less and less time for art. We often lose touch with how satisfying it is to create something uniquely our own. Olympus delivers the E-620 digital single lens reflex (DSLR) camera to bring back that free-style experimenting and the magical feeling of being inspired by our own art.The easy-to-use Art Filters and Multiple Exposures (built right into the camera) are fun for photographers--whether you&rsquo;ve been shooting for years or picked up your first digital camera today. Enjoy capturing creative images on the go--without being tethered to a computer and editing software! Now it is possible to easily customize your images so they&rsquo;re worthy of posting on the gallery wall (or at least the family fridge).The E-620's freedom of expression is matched by its freedom of mobility. First, the camera travels with you to more places, thanks to its compact size and light 18.9-ounce body. Second, as the world&rsquo;s smallest DSLR with in-body Image Stabilization, the E-620 adjusts when your body moves to remove blur caused by camera shake (with any lens attached). Finally, add Live View shooting with a swivel 2.7-inch HyperCrystal LCD that frees you to cover subjects from a range of angles, and this 12.3-megapixel DSLR seamlessly combines motions with emotions--proof that Olympus lets you capture it all.Make Your Vision Come to Life with Art FiltersIf you&rsquo;re hoping to get more out of your camera than simply capturing and documenting a scene, and enjoy enhancing or customizing an image to make it your own, then you will value the camera&rsquo;s Art Filters. The filters, which are built into the camera, provide incredible individual artistic control over an image, and remove the need to spend time altering images on the computer with editing software.This camera was made for free-style shooting, experimenting and engaging with events and subjects. Enjoy the freedom of Autofocus Live View and dramatic effects to transform your day-to-day shots into compositions that you can be proud of with the following in-camera Art Filters:Pop Art:Enhances colors, making them more saturated and vivid, creating high-impact pictures that express the joyful, lighthearted feeling of the Pop Art style of the 1960s;Soft Focus:Creates an ethereal, otherworldly atmosphere that renders subjects in a heavenly light without obscuring details;Pale &amp; Light Color:Encloses the foreground of an image in flat gentle light and pastel colors reminiscent of a flashback scene in a movie;Light Tone:Renders shade and highlight areas softly to lend an elegant air to the subject;Grainy Film:Evokes the feeling of documentary footage shot in monochrome with grainy, high-contrast film; andPin Hole:Reduces the peripheral brightness of an image as though it were shot through a pin hole, connecting the viewer intimately with the subject at the center of the picture.Art Filters are easily activated with the mode dial on the left side of the camera body. The effects are viewable right on the new camera&rsquo;s 100 percent accurate swivel 2.7-inch Live View HyperCrystal III LCD when using the E-620 in Live View mode or when reviewing the captured image.Express Your Inner Artist&rsquo;s Multiple PersonalitiesWith the new camera&rsquo;s Multiple Exposure function you are free to tell a visual story your way, whether in a portrait, a landscape or a combination of both. For instance, capture an image of the spring leaves on a new tree and then overlay an image of your child&rsquo;s face into the leaves for a stunning image that expresses the newness of the season. The image capture options allow you to shoot one shot, then another, or to capture both shots separately and combine them in the camera later. Or superimpose your own portrait with a starry night sky to create a photo with the impact you desire. Let your imagination lead you to new creative discoveries.Ready, Steady, Go with In-Body Image StabilizationThe E-620 travels with you to more places, thanks to its compact size and light 18.9-ounce body. Capture sharp images on the go with the camera&rsquo;s in-body Image Stabilization, which virtually eliminates blur with any lens attached. Three IS modes handle any situation. The IS-1 mode is for general shooting and adjusts the sensor on both the horizontal and vertical planes to compensate for movement by the photographer so images stay sharp in low light even at slow shutter speeds. To capture the motion of moving subjects, the E-620 offers two specialized modes: IS-2 mode is ideal for capturing a runner or cyclist traveling by in the horizontal mode, preserving the sense of motion while panning; IS-3 mode achieves the same effect when the camera is held vertically. In either mode, the artistic effects of panning enhance the shot and render the subject in sharp detail with blurred background. Moreover, the E-620 is the world&rsquo;s smallest DSLR with built-in Image Stabilization, so you&rsquo;ll feel comfortable taking it on the road with you to capture the action.Superior Image QualityThe new camera&rsquo;s high-performance 12.3-megapixel Live MOS image sensor delivers excellent dynamic range, accurate color fidelity, and a state-of-the-art amplifier circuit to reduce noise and capture fine image details in both highlight and shadow areas.Its Live MOS image sensor is complemented by Olympus&rsquo; TruePic III+ Image Processor, which produces clear and colorful photos using all the pixel information for each image to provide the best digital images possible. The new image processor is noted for accurate natural color, true-to-life flesh tones, brilliant blue skies, and precise tonal expression; it also lowers image noise in photos shot at higher ISO settings, enabling great results in low-light situations.Swivel Live View LCD: Freedom to Move YouThe new camera&rsquo;s 100 percent accurate 270 degree swivel 2.7-inch Live View HyperCrystal III LCD can be rotated freely so photographers can compose at any angle, including overhead and down low, without getting bent out of shape. This enables an E-620 photographer to compose a subject in the Live View LCD and see the results of the various creative features--live as they&rsquo;re happening.When viewing the LCD in Live View, settings like white balance and exposure can also be selected, and their impact is seen instantly on the display. Real-time monitoring offers amazing versatility and creative control. The LCD displays 230,000 pixels in vivid color and includes HyperCrystal technology, which offers many times the contrast of conventional LCD monitors for easier viewing in both preview and playback. It also provides a wide viewing angle of 176 degrees, which ensures images can be composed from even the most obscure angles.The 2.7-inch LCD makes icons and text on the camera&rsquo;s menu easy to view. Beyond the camera&rsquo;s bright viewable LCD, the E-620 is equipped with illuminated buttons on its body that are easily viewable in low light to quickly find the settings you want.Two Fast Autofocus SystemsConsumers accustomed to composing and focusing using a point-and-shoot camera&rsquo;s LCD will appreciate that the E-620 offers the same easy, seamless experience (what you see on its LCD is what you get!). The E-620 delivers two fast autofocus options to quickly focus and capture the image in any situation:Fast Imager Autofocus in Live View:When it comes to measuring camera speed, autofocus is a key factor. If a camera&rsquo;s AF system does not meet photographers&rsquo; demands and lock focus accurately and quickly, it&rsquo;s possible to miss a shot. AF Live View on the E-620 allows you to compose, focus, and capture the shot quickly and easily without ever taking your eye off the large 2.7-inch full color LCD.Phase Detection AF:When using the optical viewfinder, the technology behind the new 7-point twin cross AF system provides world-class fast and accurate focusing based on the speed of the E-3. Super sensitive Twin and Twin Cross AF target points can measure focus both vertically and horizontally, so regardless of the subject, focusing is super-simple and fast. With a dedicated Phase Detection AF sensor in the camera body, shooting moving subjects, like a runner crossing the finish line, is lightning fast. In low-light situations, this is the AF option of choice to quickly lock focus, so that a loved one&rsquo;s face illuminated only by candlelight is in sharp focus.Multi-Aspect ShootingSince photography is a form of expression that is essentially based on clipping a scene, framing is an important component of style. The E-620 provides four aspect ratios that serve as masks to frame your image to the desired proportions, including: the standard 4:3 aspect ratio that is perfectly suited for an 8 x 10-inch enlargement; the 16:9 aspect ratio that will display your images beautifully on a widescreen television; and other popular aspect ratios such as 3:2 and 6:6. By enabling you to select the aspect ratio before shooting and easily viewing it on the LCD throughout the shoot, the Multi-Aspect function offers a new way to control your photography and express yourself.Always Find a Face in the CrowdThe new camera&rsquo;s Face Detection reduces the chance of blurred subjects in photography by distinguishing between people&rsquo;s faces and the background. It tracks up to eight faces within the image area, even if people are moving, and automatically focuses and optimizes exposure for sharp, brilliant portrait pictures (ideal for large family or party group photos).In Sunshine or the Shadows, Never Miss a DetailShooting scenes with both highlights and shadows can be tricky because of the extreme contrast between dark and bright areas. The E-620 addresses this challenge with Shadow Adjustment Technology that adjusts for extreme light variations and maintains visible detail in both the shadow and highlight areas of the scene. Now users can see and preview the gradation on the Live View LCD and capture images showing the shadow detail they saw. This feature is also accessible in the Edit menu after the shot has been taken.Preview a Multitude of PossibilitiesPerfect Shot Preview enables users to easily preview and select from a variety of thumbnail previews of the photographic effects of white balance and exposure compensation adjustments live on the LCD before taking the photograph. It is an ideal way for novice users to learn about the effects of different photography techniques, visually, without having to scroll through menu options. With 28 preset scene-select modes for every imaginable shooting scenario, automatic modes and full manual controls, the E-620 offers a world of possibilities to photographers.Wireless Flash CapabilityWireless flashes help you cast the best light on your subjects and capture great images. For this reason, the E-620 is compatible with the Olympus FL-36R and FL-50R wireless electronic flashes that are designed exclusively for digital photography. When these flashes are used in combination with the E-620, multiple-wireless flash photography is both easy and reliable. The E-620 can control up to three wireless flash groups independently, with multiple flash units in each group for dramatic flash effects.Dust Reduction System for Spot-Free ImagesLife moves too fast to spend time worrying about dust ruining the perfect image. Olympus&rsquo; proven Dust Reduction System produces spot-free photos with the exclusive Supersonic Wave Filter. The patented ultrasonic technology vibrates to remove dust and other particles from the front of the image sensor and captures it on a special adhesive membrane every time the camera is turned on. These spot-free photos liberate users from hours spent retouching photographs at the computer or sending their cameras back to the manufacturer to remove dust trapped inside. With Dust Reduction and the new creative features, Olympus continues to liberate users from the computer and editing software, and enables them to have fun capturing it all while on the go.Optional Accessories for Shooting on Land and in the WaterThe new HLD-5 Power Battery Holder (sold separately) can hold up to two Lithium Ion BLS-1 batteries to extend the performance life of the E-620 and its existing BLS-1 battery. It also enables effortless vertical shooting with its own separate shutter button and control dial. Olympus will also offer the PT-E06 optional underwater housing for the E-620. Capable of reaching depths of 130 feet underwater, the housing will ensure that divers will not miss an image during their journeys to the abyss.What's in the BoxE-620 Body14-42mm f/3.5-5.6 Zuiko LensUSB CableVideo CableLi-Ion Battery Pack (BLS-1)Li-Ion Battery Charger (BCS-1)Shoulder StrapOLYMPUS Master 2 Software CD-ROMManuals and Registration card", "title": "Olympus Evolt E620 12.3MP Live MOS Digital SLR Camera with Image Stabilization and 2.7 inch Swivel LCD w/ 14-42mm f/3.5-5.6 Zuiko Lens", "price": 9.99, "salesRank": {"Camera &amp; Photo": 12000}, "imUrl": "http://ecx.images-amazon.com/images/I/41xewEiYbbL._SX300_.jpg", "related": {"also_viewed": ["B0015ASYJ8", "B0042X9MNM", "B001K3JPRA", "B000X1T3IQ", "B000NVXF26", "B0015AUUFY", "B00370X0WA", "B00EQ07PG2", "B000SSLR5Q", "B0066J6EOU", "B0015AOU9Q", "B0073AIXOA", "B0058PL9SO", "B0000TU7I6", "B000BK39DE", "B000Q639S8", "B0035LBRJO", "B002CGSYL2", "B001ISKNKK", "B0073A1EBE", "B009DH437M", "B000X1P5RE", "B0058PL9RK", "B001EZ46F0", "B0074WDDN8", "B002OEBTC8", "B00B3QYBIW", "B000BTFZZA", "B00G237L8I", "B00CI3R726", "B0074WDFHM", "B00I4BI2MU", "B0096WDNZC", "B000XCQ0LI", "B00CI3R7BM", "B004G8QSTO", "B00EY6AV3W", "B000BTFZMS", "B0074WDFOK", "B002GILU44", "B0074WDERI", "B00FZEJ3XG", "B000HJ4YMY", "B005058BTW"], "buy_after_viewing": ["B003VNKNEQ", "B002DQTDTI", "B004EC1YY6", "B000PGCBZG"]}}