{"asin": "B00005ULXN", "description": "Sega's mascot made his 3-D debut on the Dreamcast, but with the demise  of that system the zippy blue hedgehog is popping up everywhere--including on  the GameCube. Unfortunately, his first next-gen appearance,Sonic Adventure  2: Battle, is marred by the same 3-D camera problems that plagued the  Dreamcast version, and the multiplayer \"battle\" component isn't all that it's  cracked up to be.Right out of the gate, players have the option of choosing Hero (Sonic, Tails,  and Knuckles) or Dark (Dr. Eggman, Shadow, and Rouge) quests, which are  completely different. Sonic and his dark counterpart Shadow traverse levels at  warp speed colleting coins and power-ups while fighting enemies in the game's  most exhilarating moments. Unfortunately, the other characters are nowhere near  as fun to play. Dr. Eggman and Tails fight through levels that require little  more than constant button-mashing to shoot an endless procession of enemies, and  Knuckles and Rouge participate in seemingly endless levels that require  searching for a variety of objects.Graphically, the game is a bit of a letdown considering the processing muscle of  GameCube. Models are fairly simplistic, and level textures are sometimes bland.  Game Boy Advance owners can use a link cable to download Chao from the game and  train them on the go, but the rewards for doing so are minor considering the  time investment involved. The main feature this game offers over its Dreamcast  predecessor is the variety of multiplayer modes, which are fun but offer none of  the depth or replayability of standalone multiplayer games likeSuper Smash  Bros. Melee. Still, they are nice additions--especially the racing  games--and round out a flawed single-player component. Sonic addicts who missed this  game the first time around on the Dreamcast will definitely want to check it  out, but the finicky camera, tedious non-Sonic/Shadow levels in single-player  mode, and surprisingly shallow multiplayer components (especially the Chao  games) turn what could have been a great game into a mere good one.--T. Byrl  BakerPros:Plenty of varietySonic/Shadow levels are pure, unadulterated funCons:Knuckles/Rouge levels are tediousMultiplayer aspects could use some more depth", "price": 273.81, "imUrl": "http://ecx.images-amazon.com/images/I/61M0V4EYN9L._SY300_.jpg", "related": {"also_bought": ["B00008URUB", "B0000VSH4U", "B0009PM8V0", "B00006LU9B", "B000E36OVM", "B00012D0SG", "B000ARPXU0", "B000066JRN", "B00006FWTX", "B00005QEFF", "B00005MO5G", "B00009WAUF", "B0009SQFGQ", "9861019731", "B00005QEFD", "B00009WAUD", "B00009WAUB", "B002L8W5V6", "B00006IJJI", "B000AQA9UA", "B00005Q8LR", "B00006966U", "B002L93F0A", "B000L9NPGG", "B00005Q8LY", "B000084318", "B00008DHNU", "B00006LEMY", "B000A15K0Y", "B0002ILS1K", "B0000A0O28", "B00095KU5G", "B0009Z3MGA", "B0009XEC0C", "B000UQCER6", "B0000A03CX", "B000069BB0", "B002C5BMFI", "B0000E5U6I", "B0002ILS24", "B004CHLNWQ", "B000E36ONK", "B0000A09EI", "B00005R5PZ", "B0001615P2", "B0002Y5180", "B000B8J7JQ", "B00019AZC8", "B0000E5U6M", "B000UY2TJG", "B0000E5U6V", "B000070IWB", "B0000A2Y96", "B00006DY1M", "B00433XWFU", "B000A28ENI", "B00008DHLV", "B00005QDQ1", "B00G2F1N80", "B0000AHOON", "B000EHPQMG", "B00006YXLE", "B000PTYKSY", "B0000E5U6N", "B00006HBTW", "B000620PSY", "B0001615OI", "B0000E5U6K", "B002FY4AOG", "B0000VSH40", "B0006I5FKQ", "B0017KIBAI", "B000ZEX9OU", "B002I0IIPY", "B0001YYNL2", "B000090W86", "B005V4IIRW", "B000N1IZOO"], "bought_together": ["B00008URUB", "B0000VSH4U"], "buy_after_viewing": ["B00008URUB", "B0000VSH4U", "B00012D0SG", "9861019731"]}, "salesRank": {"Video Games": 1978}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "More Systems", "GameCube", "Games"]]}