{"asin": "B006UMM15O", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Canon Elph 520 HSAn Ultra-Slim High PerformerIn the twelve years since the original ELPH was instantly and universally proclaimed an icon of style, successive ELPH cameras have remained at the forefront of design even while boasting the very latest in digital technology.Now, opening a new era of ELPH design, the PowerShot ELPH 520 HS digital camera is both homage to the original ELPH and astonishing synthesis of Canon&rsquo;s leadership in technical advancements. A mere 0.76 inches thick, it is the world&rsquo;s thinnest 12x zoom camera. Canon&rsquo;s pursuit of perfection has driven the development of new miniaturization including a new lens and new 10.1 Megapixel CMOS sensor that, powered by Canon&rsquo;s DIGIC 5 Image Processor, create images as breathtakingly beautiful as the camera itself. It&rsquo;s also packed with the latest Canon technologies including Smart AUTO with new Face ID and Full HD Video.Spectacular Lens Power, Amazingly Compact BodyIncredibly Thin DesignCanon&rsquo;s unwavering commitment to equipping an ultra-thin, clean-profiled ELPH with 12x zooming power required a redesign of the lens, sensor and other technologies. This pursuit of perfection paid off, creating the world&rsquo;s thinnest camera* with a 12x zoom. At an astonishingly thin 0.76 inches, it is significantly slimmer than competitors&rsquo; 12x zoom models.12x Optical Zoom and 28mm Wide-Angle LensNewly designed to custom-fit the PowerShot ELPH 520 HS digital camera&rsquo;s incredibly thin profile, the camera&rsquo;s 12x Optical Zoom and 28mm Wide-Angle Lens is a marvel of optical technology. The Wide-Angle lens gives you more to work with in every shot, adding depth, perspective and grandeur as called for. Landscapes, city scenes, family shots and more all benefit from the extra width. With a 12x Optical Zoom, no shot is beyond your reach. You&rsquo;ll love the flexibility it gives you when shooting: from a single vantage point you can capture an unlimited number of different images simply by zooming in and out. It also incorporates the latest in Canon lens technology, suppressing lens aberration for outstanding image quality throughout the entire zoom range. The camera&rsquo;s sensor was specifically designed for this lens, so even at the long end of the zoom images are bright and clear.UA Lens TechnologyPioneered by Canon, UA Lens technology makes possible compact lenses with remarkable optical performance. By using molded glass with an ultra-high refractive index in aspherical lens elements, Canon has succeeded in reducing lens size while significantly reducing image aberrations. Another stellar example of cutting-edge Canon optics, UA Lens technology helps make PowerShot digital cameras pocket-friendly and capable of astounding image quality.Canon HS SYSTEMThe Canon HS SYSTEM lets you take bright, clear photos in an even wider range of shooting situations. Beautiful low-light shots are possible with minimal noise and maximum detail in highlight and shadow areas. The system is the result of two technologies brought together in PowerShot cameras: a high-sensitivity imaging sensor, which is able to capture more light; and the DIGIC 5 Image Processor, which actively reduces noise with high-speed image processing. The 10.1 Megapixel CMOS sensor in the PowerShot ELPH 520 HS digital camera incorporates advanced light reception technology that enhances sensitivity. The DIGIC 5 Image Processor provides a major boost in noise reduction, expanding the usable ISO range to an amazing high of ISO 3200. The Canon HS SYSTEM takes the frustration out of low-light shooting, delivering clear, blur-free images.Canon Full HD Video AdvantageIn addition to the Canon HS SYSTEM, the combination of the advanced CMOS sensor and DIGIC 5 Image Processor in the PowerShot ELPH 520 HS makes it possible to shoot crisp, clear high definition video. Imagine the fun and excitement of being able to shoot spectacular 1080p Full HD video with stereo sound that you can later watch on your HDTV or download to your computer to share with family and friends. In addition to being able to shoot Full HD 1080p video at 24* frames per second, the PowerShot ELPH 520 HS can also shoot 720p HD video at 30** frames per second.* Actual frame rate is 23.976 fps.**Actual frame rate is 29.97 fps.Dedicated Movie Button, Wind filter feature and Optical Zoom for easy video captureIt&rsquo;s never been easier to shoot videos with a PowerShot digital camera. The PowerShot ELPH 520HS has a dedicated movie button that lets you start and stop recording instantly. There is no need to go through layers of menus or operate switches or dials to switch to and from video recording mode. The camera is always ready to shoot stills or video whenever you want. The PowerShot ELPH 520 HS also incorporates an electronic wind filter, which suppresses wind noise that can muffle or distort the sound. And unlike less sophisticated point-and-shoot cameras, the PowerShot ELPH 520 HS lets you use the full range of optical zoom when you&rsquo;re shooting a video.HDTV Playback via HDMI with CEC SupportIt&rsquo;s easy to enjoy and share the videos you shoot with the PowerShot ELPH 520 HS digital camera. Simply connect its HDMI terminal to your HDTV using an HDMI cable. And because the PowerShot ELPH 520 HS supports HDMI-CEC technology, you&rsquo;ll be able to control the playback of your images and videos on any CEC-enabled HDTV using the TV&rsquo;s remote control. (CEC &ndash; Consumer Electronic Control &ndash; is part of the HDMI specification, enabling components in a system to communicate with one another.)iFrame Movie SupportWith the PowerShot ELPH 520 HS, you can also shoot video in the Apple iFrame format, which is a computer-friendly standard that speeds up importing and editing of videos. It keeps file sizes small, making it more convenient to upload or e-mail high-quality videos. The iFrame format enjoys native support in compatible Mac and Windows video applications, making it unnecessary to perform time-consuming and often quality-degrading conversions.PureColor System LCDThe PowerShot ELPH 520 HS digital camera&rsquo;s large and bright 3.0-inch PureColor LCD screen makes it easy toview and frame your shots in high resolution (461,000 dots). Many LCD screens on the market today use a striped arrangement of dots that works great for text and menus, but is not ideal for imagery. The PowerShot ELPH 520 HS digital camera&rsquo;s PureColor System LCD uses a delta arrangement of dots, an arrangement that works better for the organic nature of photos and videos, allowing you to review your images with exceptional clarity with rich, true-to-life color. Moreover, you can view the LCD screen over a surprisingly wide angle &ndash; above, below or to either side &ndash; without color shifts and with minimal reflections.Intelligent ISThe latest advance in Canon Optical Image Stabilization technology, Intelligent IS analyzes camera movement and applies the best shake correction method for the shooting situation. For stills, the system automatically selects among Normal, Panning, Macro (Hybrid) and Tripod IS modes. When shooting video, the system automatically selects among Dynamic, Powered, Macro and Tripod IS modes. With Intelligent IS, you can concentrate on image capture, letting the camera make the most effective IS settings to assure the steadiest possible image.NormalCorrects for a wide range of camera movement when shooting stills.PanningPanning motion is detected so that IS does not interfere with desired camera movement.HybridCorrects for shift-type camera shake, which typically occurs in macro (close-up) shooting.DynamicEffective for video shooting at wide-angle focal lengths, eliminating the unwanted shaking that typically occurs while walking.PoweredCompensates for hand movement when shooting video at the telephoto end of the zoom range, where camera shake is magnified.TripodWhen tripod use is detected, the Image Stabilizer is stopped because it is not needed.Shooting Modes/Special Scene ModesSmart AUTOThe camera automatically selects the best shooting settings for optimal quality based on subjects and environmental factors to provide point-and-shoot simplicity.ProgramAccess advanced exposure compensation features while shooting mostly automatically.Movie DigestRecords a video clip before capturing a still image and then combines one day&rsquo;s worth of clips into a video.Stitch AssistEasy-to-use guidelines simplify the shooting of aligned multiple frames that can later be combined (using bundled software) to create panoramic photos.Low LightFor high quality image capture in an amazing range of dimly-lit situations.PortraitThe camera sets a large aperture, focusing the subject and artistically blurring the background to make your subject &ldquo;pop.&rdquo;Smart ShutterThe camera automatically takes the photo when people smile, wink, or get into frame.High-Speed BurstCaptures rapid action frame by frame, by shooting continuously at a high speed while the shutter button is held down.Handheld Night SceneTake clear and steady pictures at night without the use of a tripod.Super VividSuper Vivid intensifies existing hues, saturating the scene with bright colors.Color AccentChoose to retain a single color in your image while other colors turn monochrome.Color SwapSelect a color and replace it with a color you specify for special effects.UnderwaterCapture underwater images with reduced backscatter effect.Optional Underwater Case required.CustomDefine and store your own settings to achieve the effects you prefer.SnowShoot clear snow scenes without darkened subjects or an unnatural bluish tint.FireworksGrab brilliant images of skyrocketing fireworks.Long ShutterUse to blur moving subjects for artistic effect, ideal for urban night photography.Fisheye EffectAdd a classic photo distortion without a fisheye lens.Miniature EffectGive images a miniature look with an effect that emphasizes perspective by blurring the top and bottom of the image.Toy Camera EffectSimulates photos taken with \"toy\" or pinhole cameras, darkening the image at the edges to create a vignette effect.MonochromeChoose from three single-tone effects: Black-and-White, Sepia, or Blue.Poster EffectPoster Effect combines several similar shades into one color, turning subtle gradations into eye-catching, scene-popping contrasts.iFrame MovieThe Apple&reg; movie format, iFrame, makes it easier and quicker to import and upload videos while retaining high image quality.Super Slow Motion MovieRecord your clips in high speed (approx. 240 fps), and then watch your videos in slow motion.Smooth SkinRemoves dullness, wrinkles, and harsh shadows for beautiful faces.Soft FucusCreates a hazy ambiance that&rsquo;s perfect for portraits and wedding photos.What's in The Box?PowerShot ELPH 520 HS Digital Camera (Body)Wrist Strap WS-DC11Battery Pack NB-9LBattery Charger CB-2LBInterface Cable IFC-400PCUSolution Disk V110Getting Started GuideCustomer Support/Online Registration LeafletPrinter Promotion FlyerWarranty CardPromotional Tag*Memory Card is not included", "title": "Canon PowerShot ELPH 520 HS 10.1 MP CMOS Digital Camera with 12x Optical Image Stabilized Zoom 28mm Wide-Angle Lens and 1080p Full HD Video Recording (Silver)", "price": 169.95, "imUrl": "http://ecx.images-amazon.com/images/I/514pDmrUnhL._SY300_.jpg", "brand": "Canon", "related": {"also_bought": ["B00AYM7YW6", "B0076OEKD6", "B004G60AD6", "B00BC4GTTY", "B00AYMX326", "B003VKYQQA", "B004GHXTKQ", "B00792VLYG", "B009QZH7D8", "B003ASCW7S", "B004W3B3C0", "B0037TA7QS", "B004MT8ECG", "B007P7FPRE", "B007KFXIDE", "B009TEVLBK", "B003ZSHNFE", "B009QZH7BU", "B002HZY5CU", "B004M640YU", "B00F0XRQGS", "B00EVVDX9E", "B007OY9MVI", "B004GI6PCY", "B00HZTCU2A", "B002I03UPW", "B00F0XS1V2", "B002I007CG", "B007P7FTTI", "B003ASCW7I", "B0046VDW86", "B004H3XNB4", "B0048AVBNS", "B004GI6Z8S", "B006JO1YW4", "B003F7DWH8", "B009TEWINA", "B007XZL7PC", "B007P7FNL2", "B007KFXIDO", "B00F29IETI", "B008B0YK6Q", "B004G6002M", "B0075SUJ4W", "B005HNF01O", "B0050051QI", "B006JO1YVU", "B006JO1YY2", "B0075SUJBA", "B005POCF4U", "B003ASCW82", "B007XZM6VG", "B003CJTQJC", "B005RXH1WU", "B00DYQYLQQ", "B00H7L2FAI", "B001GGL7Z4", "B000NSFLM6", "B00BT80QH4", "B00CBD0XSI", "B003ZSHNFO", "B004TA0AUW", "B00CES44EO", "B00488G6P8", "B00BT80PAM", "B00B5HE3AK", "B004G605Q8", "B002JVB44E", "B007BJHETS"], "bought_together": ["B004G60AD6", "B00AYM7YW6"], "buy_after_viewing": ["B00AWYN182", "B003F7DWH8", "B00AYM7YW6", "B009QZH7BU"]}}