{"asin": "B001H9NR7Q", "description": "Optimized performance and as much repair as you need for your PC. You get a full time tech concierge for Windows PCs, laptops, and desktops.What is Clean Machine?Clean Machine provides a unique service that consumers, schools systems, small businesses, and others really want--their very own PC concierge. This is a service that provides relief from the adware, spyware, and viruses that plague PC users. We are a proactive service that prevents bad things from happening to your PC. We will fix your PC's software problems throughout the relationship as well.We Fix Anything and Are There to HelpApart from regular Preventive Maintenances, if you have any questions/clarifications/issues regarding OS repair, application support, etc, you can contact us and we will help you.Your Secret WeaponFor just $119.99/computer you get a full year's worth of unlimited repair, help, security software and 6 preventative maintenance tune-ups. Everything is included.Your Personal PC ConciergeWith Clean Machine, you get a personal PC concierge who checks your computer regularly. They keep your data protected and your computer running at optimal levels.Security ThreatsSecurity threats to your PC are constant, relentless, confusing and increasingly powerful. Anti-virus software and regular system updates aren&rsquo;t enough to keep your PC protected. And it&rsquo;s difficult to know just how effective they really are.Adware, spyware, malware and viruses are lurking everywhere--threatening your data and affecting your PC&rsquo;s performance. And poor performance brings frustration in the form of pop-ups, warnings, lockups and sluggish operation.You&rsquo;ve got better things to do than fix and update your PC.Got Questions?Need repairs or advice? No problem. Your PC concierge takes care of everything--with no hidden upsell agenda.Clean Machine is the best solution on the market to protect your PC and keep it running optimally.Clean Machine Is SaferClean Machine is the safest solution. We have more safeguards than any other solution, like extensive physical, electronic, and managerial processes that are audited and insured by AIG--and designed to keep your information secure.Clean Machine is best way to repair and maintain your PCEasy to UseWe perform preventive maintenance six times a year in an easy-to-schedule format. Pick your day and time and we take it from there.Seamless and TransparentA detailed report from your personal PC concierge explains what was done to protect your PC and improve its performance.Get unlimited support and valuable additional services&mdash;whenever you need them. Plus, there&rsquo;s zero time commitment and no learning curve. You don&rsquo;t have to talk to anyone or watch someone work on your PC. And you don&rsquo;t have to know anything about PC architecture or programs.Don&rsquo;t Interrupt Your Life to Fix Your PC.Just leave your computer on and your personal PC concierge performs routine maintenance at a time that&rsquo;s convenient for you--even while you sleep.Avoid the hassle of going to a repair shop or waiting for a house call.Clean Machine Is the Best ValueJust $119.99 keeps your PC protected and performing at optimal levels.We ensure your PC is updated with all available hardware and software upgrades. Plus, we give you free stuff. Like a USB stick, enhancements, applications and games--all tested in our labs for safety and compatibility.This is the best value anywhere.What We DoYour highly trained PC concierge uses advanced software and tools to:Scan your PC for viruses and spywareRemove offending programsEnhance your PC&rsquo;s security, speed and performanceProvide a detailed report and improvement recommendationsThe result is a frustration-free experience and a protected, high-performing computerOnly Proven and Established Secure ProcessesWith Clean Machine, you can rest assured we use only proven and established secure processes and protocols for your protection.Your PC concierge accesses only your operating system and applications--not your data. We record every keystroke our technicians make. Your PC concierge must clear numerous physical security checkpoints throughout our facility.All PC technicians undergo rigorous background checks and ongoing oversight. We keep a detailed log file of everything we do and store it on your PC--and on our secure servers.Don&rsquo;t wait for your PC to break down or suffer a security breach. Clean Machine is easy, inexpensive and effective.Some Common Tasks Performed as Part of the Preventive Maintenance ServiceSystem inventorySystem tune-upDisk defragmentationMonitoring event viewer logs for any critical updatesWindows hardeningDisk cleanupBroadband speed testSystem scanning with anti-virus &amp; anti-spywareRAM and CPU usage evaluationEvaluation of unnecessary programs and applications.FAQsHow does our service work?On purchasing the service, you will be getting a small software application which has to be installed on your computer. It comes to you from Amazon.com on a small standard USB drive that you plug into your computer. On successful installation, a concierge will schedule the service during your night time. Thereafter the technicians will visit your computer on a regular basis for subsequent services.How do I know if the client installation has been successful?On successful installation of the client, you will find an icon called RADAR on your desktop and also receive a mail from our pcsupport@pccleanmachine.com. In case you don&rsquo;t receive either of the confirmations, please contact us at pcsupport@pccleanmachine.com. A concierge will contact you soon to ensure the client is installed correctly and your computer is ready for the service or provide a backup client for you. Also contact us at 800.987.2410.Do you install any additional tools?If we do not find any anti-virus/anti-spyware tool in your computer, we install and use industry leading open source tools to keep it secure. Not only are these tools cost-free to you, they are rapidly enhanced to combat the latest malware.", "title": "PC Clean Machine Personal PC Concierge Service", "imUrl": "http://ecx.images-amazon.com/images/I/31mvVVHEoML._SX300_.jpg", "salesRank": {"Electronics": 242184}, "categories": [["Electronics", "Computers & Accessories"]]}