{"asin": "B0002WPSBC", "description": "Logitech Z-5500 5.1 Speaker SystemIntensify your entertainment with true cinematic surround soundHear your movies, music and games the way the studio meant them to be heard&mdash;in true THX-certified digital surround sound. From the pitter-patter of rain in your favorite movie to the ground-shaking explosion in your favorite game, this speaker system totally immerses you in a theater-style surround sound experience. You've also got all the power&mdash;505 watts of it&mdash;to make soundtracks come alive in thunderously rich distortion-free detail. If you want to take your home entertainment to a whole new sound level, this is the one.Key FeaturesTHX-certified theater-quality audioOnly a select few PC speaker systems have earned the THX seal of approval. THX certification is your absolute assurance that these speakers accurately recreate the sonic experience of a movie theater.Immersive Dolby digital and DTS 5.1 surround soundExperience the full-resolution digital surround sound the studio intended. Featuring both Dolby Digital and DTS decoding, the Z-5500 speaker system puts you in the middle of the action with true 5.1 surround sound. The system even incorporates Dolby Pro Logic II, transforming your favorite old 2-channel stereo movies, music and games into realistic 5.1 surround sound.Phase Plug drivers reproduce every little detailFrom the soaring high note in a guitar solo to the loud burst of jet engines in an action movie, Logitech Phase Plug drivers make sure you don't miss a sound. A cone-shaped aluminum Phase Plug at the center of the driver helps to accurately reproduce high- and mid-range frequencies with less coloration than standard drivers. And because the Phase Plug acts as a heat sink, the driver is better able to preserve dynamic range. So you hear the quiet of a whisper and the loud, full force of an explosion. The Phase Plug even acts as a reflector, creating a much wider sweet spot of mid to high frequencies compared to conventional speaker designs. The bottom line? The true sonic signature of your movies, music and games comes through loud and clear.505 watts of powerful performanceYou've got more than enough power to surround yourself with thunderous audio clarity. No need to hold back. Crank up the volume&mdash;way up. The high-performance speakers can handle the volume, so you hear every note, voice and sound effect without a hiss or crackle. All that power also comes with integrated digital equalization. Sit back and the system intelligently adjusts frequency response in real-time for cleaner, more accurate and balanced sound.Long-throw subwoofer for deeper bassThe Z-5500's powerful 10-inch, 188 watt subwoofer reproduces low frequencies at their deep, room-shaking best. The long-throw design effortlessly delivers distortion-free bass so full you can feel the rumbles and booms that make movies and games more exciting. And with Logitech's flared side port, the port noise that can occur with conventional subwoofers is eliminated. So you can enjoy those thick, thumping bass notes without distractions.Versatile satellite speakersYou have the options to customize your setup. The cloth grilles can be removed to give your system that pro audio look. And the rotating pedestals made it a cinch to either place the speakers on a desk or mount them to the wall.Audio inputs for multiple componentsEnjoy pro-quality surround sound from virtually any digital or analog source. Plug in up to six devices simultaneously&mdash;PC, iPod, DVD player, game console and more&mdash;and leave them there. With one optical, one coax digital and four stereo inputs, there's plenty of room to connect your gear.Convenient digital control center and wireless remoteThe Digital SoundTouch&#8482; Control Center lets you easily change volume, audio sources, surround sound settings and even mute the system. A separate remote gives you audio control of up to seven different sound sources, from your PC to the game console.Browse For More Logitech ProductsEnhance your listening experience with great Logitech products.Logitech Speaker System Z523Speakers with 360-degree sound help project audio evenly in all directions, so you get a great listening experience throughout the room.Ultimate Ears SuperFi 4 Noise-Isolating EarphonesFeaturing the same speaker technology and sound signatures used in our higher-end products, these compact earphones deliver detailed bass with crisp and clean mids and highs.Ultimate Ears SuperFi 5 Noise-Isolating EarphonesHoused in a sleek, liquid silver body, the top-fire speaker produces a detailed and full soundstage&mdash;ideal for listening to a broad range of music genres.What's In The BoxPackage ContentsSpeakers: 4 satellites, 1 center channel, 1 subwoofer6-channel direct cableDigital SoundTouch&#8482; control centerWireless remote control, batteries includedUser's manual2 year limited warranty", "title": "Logitech Z-5500 THX-Certified 5.1 Digital Surround Sound Speaker System", "price": 306.99, "imUrl": "http://ecx.images-amazon.com/images/I/41yJpETv3LL._SX300_.jpg", "related": {"also_bought": ["B004M18O60", "B0006HQ7HC", "B005LJQOPK", "B0044DEDCA", "B004CANMCC", "B001TH7GSW"], "buy_after_viewing": ["B003VAK1FA", "B003VAHYTG", "B004M18O60", "B0027VT6V4"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]]}