{"asin": "B0006TIEZS", "description": "The ProMedia Ultra 2.0 multimedia speaker system is designed to deliver high-level performance with the simplicity and portability of a two-speaker setup. It was created for consumers who want superior, full-range sound quality but do not want to give up the space or run the wire required for a subwoofer. Each satellite has a sleek appearance, with floating grilles and undercone termination, to provide a cleaner look. This ProMedia Ultra 2.0 speaker system easily connects to Apple iPods and other MP3 players, laptop and desktop computers and to portable audio/video devices, such as televisions, CD and DVD players. Listeners can also feed a laptop PC signal and an MP3 signal simultaneously to the speakers for mixed sound playback, making this system an excellent choice for both multimedia presentations and entertainment.The ProMedia Ultra 2.0 consists of two magnetically-shielded satellite speakers. Each satellite has a highly efficient two-way design that utilizes dual 2.5\" drivers and a 1\" metalized polymer tweeter. An exclusive Klipsch MicroTractrix(TM) Horn is coupled to the tweeter for maximum clarity and efficiency, no matter what format you play. The woofers are long-throw units powered by neodymium motor structures. This audiophile design approach provides rich midrange clarity, extended airy highs and a satisfying bass punch, creating balance throughout the audio spectrum. One of the satellites&#x97;the control speaker&#x97;hosts a bass level control, along with the main volume, a headphone jack and an auxiliary input jack for convenience. The most powerful speaker in its price range, the ProMedia Ultra 2.0 system provides the most satisfying, detailed and dynamic sound reproduction available for two-channel multimedia applications.", "title": "Klipsch ProMedia Ultra 2.0 PC Speaker System- Black", "price": 139.99, "imUrl": "http://ecx.images-amazon.com/images/I/41BZYSWK3AL._SY300_.jpg", "related": {"also_viewed": ["B000062VUO", "B00CD1PTF0", "B001S14DYO", "B001RNOHDU", "B002VK7L04", "B0030ZLZ5G", "B009XGH2HG", "B0041Q9PZ0", "B000HZDF8W", "B008F2YEN4", "B001IWOBA4", "B0051WAM64", "B009JXHTNU", "B0042F3K9W", "B00154H1T8", "B0028N6YH0", "B00113PUJQ", "B003VAHYTG", "B00L4LPTR8", "B00EVWX8R0", "B00DQMJE7E", "B009IBXUNG", "B0041QBAIA", "B0053T4PHC", "B008X1BVH4", "B0038W0NEU", "B004H0MQYW", "B002FU5QMA", "B001S10DDO", "B005FE72Q6", "B0025VKUR0", "B005TLTOLG", "B0051WAM1O", "B000VKEFMS", "B00F8HRSN2", "B003R6U6HG", "B009P8KTPE", "B0080K2KUK", "B0002SQ2P2", "B002BA5JLW", "B00AS3X740", "B000VKEFN2", "B000979TV0", "B00DS5QZYO", "B000WS5VNQ", "B00K5NYNWS", "B00FRKOFIQ", "B00GNHPFRW", "B0027VT6V4", "B001F51G0W", "B007TSRCZM", "B0056BPUQC"], "buy_after_viewing": ["B000062VUO", "B00CD1PTF0", "B001S14DYO", "B001RNOHDU"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]]}