{"asin": "B0039STTVQ", "description": "The iP28 is perfect for music lovers on the move. Dock your iPhone/iPod and wake, sleep, or just listen to your music through a great-sounding system that utilizes iHome's Reson8 speaker technology and EXB expanded-bass circuitry. The iP28 can also operate on 4 AA batteries, for music anywhere--just throw it in the included carry bag and take it along.Universal iPod DockListen to your favorite iPod content from most docking iPod models. The iP28 charges your iPod while you enjoy it, so it's always ready to go when you are.Wake or Sleep to iPodStart or end your day with your favorite music from a docked iPod. If there is a power outage or the iP28 is accidentally unplugged, you'll still make your appointments--just install a backup battery and you're set.Gradual Wake and Gradual SleepThe \"gentle waking\" feature gradually fades in the alarm, so it doesn't jar you out of sleep. The sleep function does the same, with a gradual decrease so you can keep drifting off.Quality SoundThe iP28 delivers great sound with four stereo neodymium drivers (two active, two passive) in Reson8 speaker chambers. Reson8 is iHome's through-body ported speaker chamber technology. Porting speakers gives better bass response characteristics and helps the iP28 deliver sound beyond its size.For a little extra \"oomph,\" EXB sound enhancement provides expanded-bass circuitry for a hefty low-end boost.Serious PortabilityThe iP28 can be powered by four AA batteries, so you can take it most anywhere--thanks to the 100/240 VAC switching power supply--and that means most countries, too. Pack it up with confidence using the included carry bag. Just fold down the speakers, and you're good to go.Line-in JackA rear auxiliary input lets you connect and listen to any audio source, such as MP3 or CD players, for playing through the iP28's speaker.What's in the BoxiP28 System, dock Inserts, universal voltage AC adapter, and carrying case.", "title": "iHome iP28 Portable Travel Alarm Clock for iPod and iPhone (Black)", "price": 71.0, "imUrl": "http://ecx.images-amazon.com/images/I/41Qdtt9N9QL._SY300_.jpg", "related": {"also_viewed": ["B003VWW3Q8", "B003B82R4U", "B004T0MW7Q", "B009NZ6SZE", "B002VJJODM", "B000Z9UY2K", "B001RYK2Q0", "B0035FCWBC", "B00HF5TG8A", "B003GAMD4C", "B001S0JZKW", "B003DZ9Z78", "B00BDS0512", "B00DJ69XFA", "B00BQ4HROG", "B001L9KMTI", "B003VX1EF8", "B00644JO9O", "B004OA6VZ0", "B0055MNH7Q", "B004NBZAI4", "B003M8HWDA", "B0064XTQ98", "B003VANOI6", "B003SNJ4TE", "B00538NGEG", "B004I8WH8I", "B009CWRVH2", "B001FWXDZQ", "B0043M66XQ", "B00CB0M3WK", "B004VFH7G0", "B007ZWJAUC", "B003SX0NG2", "B004T1Y8G8", "B000JPMH2K", "B00AB2OQNO", "B00GYHCUXI", "B007FP4HK2", "B007BGGVAY", "B004NBZA98", "B000N483Y8", "B001G5Z82I", "B007JCNOHI", "B007ZWJA7A", "B00IGD54BS", "B00BQ4HRG4", "B00C6F0BK6", "B000NLLXUM", "B00HBJRV5K", "B0040Z65VO", "B00AWLCJ6K", "B00H1ASWN4", "B002HLDKM0", "B00B7D4CRG"], "buy_after_viewing": ["B003VX1EF8", "B003M8HWDA", "B003VWW3Q8", "B003SNJ4TE"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}