{"asin": "B002J9HCV0", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Headsets & Microphones", "PC Headsets"]], "description": "The Sound Blaster Arena USB Gaming Headset from Creative Labs brings a fully immersive gaming audio experience to any computer. Thanks to Sound Blaster X-Fi technology with EAX support integrated into the headset, you'll get 3D positional surround sound experience regardless of the computer you're using,. And with a comfortable design and detachable noise-canceling microphone, you'll be ready to dominate all-night gaming sessions.Sound Blaster Arena FeaturesAmazing Gaming AudioX-Fi and EAX gaming effects technology gives you 3D surround sound and an unrivaled sense of realism.Suppress Background NoiseSilencer technology suppresses noise so teammates can hear you in noisy gaming environments.Disguise Your VoiceWith VoiceFX, you can alter your voice to disguise yourself or take on different personas.\"We have been reaping the benefits ofSound Blaster X-Fiaudio for years and can't imagine playing without it. Now with the addition ofSilencer, we have the most advanced audio arsenal in competitive gaming. And because it's USB, it's easy to take out on the road to tournaments.\"&ndash;Jason Lake, Founder and CEO of Team Complexity, the premiere competitive gaming brand in North AmericaFeatures inline volume control and USB connectivity.View larger.Built-in X-Fi Technology for 3D Positional Surround SoundThe Sound Blaster Arena is designed to be an all-in-one gaming sound system that will bring an amazing audio experience to your system of choice. Whether connected to a desktop or laptop, the USB connection provides a 100% digital connection for superb audio.And since Sound Blaster X-Fi technology with EAX support is built into the headset, you will be armed with all the power of a Sound Blaster sound card with the portability and convenience of a USB headset. The Sound Blaster Arena will deliver unrivaled 3D positional surround sound no matter what system you're using. With X-Fi technology and EAX gaming effects, you'll even be able to hear the soft footsteps of your enemies walking towards you--no matter where they are in game.Bring the Same Sound EverywhereThe ear cups are reversible for compact storage, letting you take the headset wherever you go so you'll enjoy the same, consistent surround sound and gaming audio no matter where you're playing.Noise-Canceling Microphone Can Disguise Your VoiceGain an advantage on the competition with the Arena's built-in microphone featuring Silencer and VoiceFX technology. Silencer uses an intelligent noise-canceling technology, so when you're giving orders to your teammates, they'll hear you loud and clear even in a noisy gaming environment. And with VoiceFX, you can alter your voice to sound like different characters, whether as a strategic ploy or for fun and amusement.And when your gaming is over, you can remove the microphone boom and use the headset to enjoy some high-quality music.Designed with the Gamer in MindThe Arena headset is designed to meet the needs of even the most competitive gamer. It features a lightweight, flexible headband that reduces fatigue, and ergonomic, cushioned ear pads that remain comfortable even during extended gaming sessions. The contoured ear cups also provide great sound isolation, so you can concentrate on your gaming.An inline volume control pod provides added convenience, letting you quickly change the volume and mute the microphone when needed.The Sound Blaster Arena USB Gaming Headset is backed by a one-year limited warranty.What's in the BoxUSB Headset with detachable microphone and in-line volume control, and X-Fi Installation CD.With X-Fi and EAX surround effects, you'll have such a gaming advantage over others, it'd be almost unfair.Gaming HeadsetsHS-980 Fatal1ty Professional Series MKII Gaming HeadsetHS-800 Fatal1ty Gaming Headset (Analog)HS-1000 Fatal1ty USB Gaming HeadsetSound Blaster Arena Surround USB Gaming HeadsetHeadphone QualityErgonomic ear cups with sound isolationVelvet PaddingVelvet PaddingErgonomic ear cups with sound isolationAudio Speaker Size40mm Drivers(Full-Spectrum)40mm Drivers40mm Drivers40mm Drivers(Full-Spectrum)Removable Microphone?YesYesYesYesConnection Type3.5mm jack3.5mm jackUSB 2.0USB 2.0Inline Volume / MuteYesYesYesYesSound Control LocationAlong the cableAlong the cableAlong the cableAlong the cableSound ControlVolume control /Mute on and offVolume control /Mute on and offVolume control /Mute on and offVolume control /Mute on and offSilencer Tech EnabledYes(with Sound Blaster Titanium Series Sound Card)NoNoYesVoice FX EnabledYesNoNoYesX-Fi EnabledYes(When used with an X-Fi Sound Card)NoYesYesIdeal ForFPS Desktop Gamer / MMO(Recommend Sound Blaster TI Series Sound Card)Everyday Desktop Gamer/ MMO(Recommend Sound Blaster Sound Card)Everyday Desktop or Laptop Gaming / VOIPMMO / FPS / Competitive LAN Gamer", "title": "Creative Labs 51EF0180AA001 Sound Blaster Arena Surround USB Gaming Headset", "price": 44.99, "imUrl": "http://ecx.images-amazon.com/images/I/41cpGQpu6nL._SY300_.jpg", "brand": "Creative Labs", "related": {"also_bought": ["B008I64U2C", "B008Y1KK6Q", "B00DKXXAAQ", "B002DS4HTM", "B005L38QK2", "B00F3L19KQ", "B000OGX5AM", "B0095ONNTC", "B00CQ35C1Q", "B005CPGHAA", "B00906E03I", "B006JH8T3S"], "bought_together": ["B006JH8T3S", "B001TH7GUU"], "buy_after_viewing": ["B002DS4HTM", "B00CQ35C1Q", "B00BFOEY4I", "B00E5UHSX8"]}}