{"asin": "B00006F7S8", "description": "It's hard to believe that creator Will Wright had trouble selling his originalSimCityconcept to publishers. That first game went on to fame, notoriety, and great praise--from critics, gamers, and even educators--and spawned countless imitators, not the least of which include Wright's own smaller-scaleThe Sims, which went on to become a phenomenon in its own right. Now on its fourth edition,SimCityreturns to our hard drives, and would-be city planners everywhere will be busy for a long, long time.SimCity 4functions much like its predecessors. You've got the power to zone land as residential (green), commercial (blue), and industrial (yellow). You control the budget. You decide where to place crucial services like police, fire, medical, and even utilities like power and water. You place schools, parks, roads, water towers, and scenery as you accede to the many demands of your Sim citizens. Do a good job and your city will grow and the money will flow into your coffers. Do a bad job and the people will pack up and move away, leaving your city treasury in horrific debt and landing you what the game cheekily considers to be a far easier job: senator. The game requires a balancing act that takes both planning and a persnickety nature. There are charts to read, reports to watch, and, above all, needs to juggle. It's rewarding when it all comes together, and frustrating when you fail, once again, to build anything worthwhile.That's why I wish the game came with a better manual. The included book glosses over most major information and then neglects important aspects, such as the RCI indicator (which explains zoning needs) and parts of the budget. At the very least, the manual should include tips on handling debt. There are two tutorials which cover the basics, but again, they won't help you get out of trouble once you get in too deep. You can find this information in thestrategy guide, which is sold separately, but you really shouldn't have to go that route.The graphics are amazing, showing a vibrant metropolis with scurrying traffic, wandering Sims, smoking chimneys, and sparkling lights when night falls. Fireworks reward each year of service. And wait until you see the cool disasters you can unleash if the mood strikes you--fire, lightning, tornado, volcano, and giant robot. Oddly, there's a significant performance hit even on fast systems. Thankfully, the stuttery scrolling and slow-to-respond zoom don't hurt the game too much since you can pause it at will or fast forward if you need to wait for your cash reserves to build. The most significant flaw is that the game only offers one save slot, which discourages experimentation.Despite minor imperfectionsSimCity 4is an awesome game. You can build several cities next to each other on the map and make them dependant on each other. (You can build the greater L.A. area, in other words.) You can even import your Sims fromThe Simsto live in your city. Such familiar characters can tell you a lot about what your city needs. Put simply, city planning has never been this fun, this challenging, or this deep.--Andrew S. BubPros:Beautiful graphics and animationDeeper and more realistic than ever beforeCons:Runs slowly on most systemsInadequate manual", "price": 39.99, "imUrl": "http://ecx.images-amazon.com/images/I/51HG17RNBDL._SY300_.jpg", "related": {"also_bought": ["B00029QOQS", "B00009V3NQ", "B000U88UVS", "B00000G16I", "B0000C0YW2", "B0000D12XH", "B007FTE2VW", "B00004T1M7", "B000HKGD4A", "B0000695GX", "B00000K4MC", "B002S1CMHI", "B00005AG1J", "B0026EGO3A", "B005M0KSIM", "B000RHFZTM", "B001BZ2F56", "B000VRH6Y0", "B000O5VJRY", "B00006GF1U", "B00001LDCK", "0761540016", "B006WVR9CI", "B00000JL60", "B004OV8JEA", "B0014UYI6W", "B005UKT826", "B002BXN6GY", "B00029QR7O", "B0019R4VEO", "B000GCH62C", "B00BZOBE78"], "bought_together": ["B00029QOQS", "B001BZ2F56"], "buy_after_viewing": ["B0000C0YW2", "B007FTE2VW", "B004OV8JEA", "B002S1CMHI"]}, "salesRank": {"Video Games": 3345}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "PC", "Games"]]}