{"asin": "B000U0S304", "categories": [["Electronics", "GPS & Navigation", "GPS System Accessories", "Vehicle Mounts"]], "description": "Replace that tired old Garmin suction mount that always falls off with Arkon&#x2019;s suction mount. The GN115 windshield or dashboard suction mounting pedestal is compatible with Garmin nuvi devices, including the 40, 50, 200, 2013, 24x5, and 25x5 Series, as well as Garmin nuvi 1450, 1450T, 1490T, 1200, 1250, 1260T, 1300, 1350, 1350T, 1370T, and 1390T models. This mount package includes the Travelmount Deluxe Mini Windshield Suction Pedestal and an optional 3M adhesive dashboard mounting disk. (The above listed Garmin nuvi devices should include a 17mm swivel ball-compatible mount; replacement mounts and holders sold separately.) The Travelmount Deluxe Mini Windshield Suction Mounting Pedestal is ideal for car dashboards, windshields, and other flat surfaces. The mount features a standard suction mount base made of thermoplastic polyurethane (TPU). This type of suction performs well in hot and especially cold climates. The arm of the windshield suction car dock mount adjusts vertically and provides 360&#xB0; rotation, giving you the ultimate flexibility in viewing the cell phone from any angle. To install, simply clean the mounting area with the included alcohol pad to ensure an optimum grip, then set the pedestal and push down on the one-touch lever to engage the suction. Arkon recommends using the included 3M adhesive mounting disk for dashboard installation.", "title": "Arkon Replacement Upgrade or Additional Windshield Dashboard Suction Mounting Pedestal for Garmin nuvi 40 50 1450 1200 GPS", "price": 12.95, "imUrl": "http://ecx.images-amazon.com/images/I/41bfxRpXj8L._SY300_.jpg", "brand": "Arkon", "related": {"also_bought": ["B0017ZG538", "B000F7857S", "B003N2POXK", "B006JW6IHC", "B00BLSBYPK", "B007WOOMDS", "B003Z59EW2", "B002T0EK64", "B00999B6EM", "B000F78582", "B003FMUP0U", "B004M4TZF6", "B0015A6YN6", "B001PQ97L6", "B002I05VS6", "B002SRW3JY", "B004HW67MW", "B00F0CXAF0", "B000AKX15G", "B0036X8F50", "B004I5BUSO", "B002OL2MU4", "B0090C7A2A", "B0057ODG6Y", "B0097I53RG", "B0057OCDQS", "B001763SRI", "B000PB8CQI", "B000X6HXLA", "B0086CTL5Y", "B005DIBIRS", "B000LRMS66", "B0037V0EW8", "B0002QLDLC", "B000ENYXZ6", "B00AXX0JOQ", "B00AXX0I88", "B001DAT0XE", "B001NDN29O", "B009ABO2N6", "B00IX2VGFA", "B007FHX9OK", "B005DIBHCE", "B004GF8TIK", "B0060JJLYG", "B0051FWA7U", "B001CQT0X4", "B008IOQ3K6", "B0035JL4V2", "B00F4SU6FM", "B009QZH7BU", "B005DIBHA6"], "bought_together": ["B000F7857S"], "buy_after_viewing": ["B000F7857S", "B002OL2MU4", "B002IUG14O", "B0096FT902"]}}