{"asin": "B000ETXOC8", "description": "You can take it with you. Keep your media in your pocket with the SanDisk Sansa e250 flash memory digital audio/video player with 2 GB of storage. This sleek, light device enables you to enjoy music, video, and photo slideshows on-the-go. Features include MP3 and WMA playback, Microsoft PlaysForSure support, FM tuner (with recording ability), voice recorder, and a bright 1.8\" TFT color screen.Sansa e200 series players mix great design and durability with an excellent user interface.View the e200 Series Demo.Choose a Sansa e200-series player with the capacity that's right for you.Form is FunctionThe Sansa e250 has a sleek, thin design with a large 1.8\" TFT color screen for easy viewing. The strong alloy metal casing means the device is durable and scratch resistant. On the front, easy to use, backlit controls let you access what you want quickly and intuitively. The player also includes a microSD slot for expanding your memory capacity, and supports SanDisk TrustedFlash and gruvi content cards, which can be shared with mobile phones. The user-replaceable lithium-ion battery provides up to 20 hours of enjoyment.MP3 PlayerThe Sansa e250 will play MP3, WMA, and secure WMA formats. Other formats can be converted using the Sansa Media Converter (included). The e250 also uses PlaysForSure technology. Look for the PlaysForSure logo if you want to make sure the digital music and video you purchase will play back on it every time. Match the PlaysForSure logo on a large selection of leading devices and online music stores. If you see the logo, you'll know your digital music will play for sure. Choose from a large number of digital music and video stores, including MTV's Urge, Rhapsody, Yahoo!, MSN Music, MusicMatch, MusicNow, Napster, Wal-Mart Music Downloads, and many more.Video PlayerView your favorite video clips anywhere, anytime. Use the included SanDisk Media Converter software to convert most popular video formats (such as MPEG-4, WMV, or DivX) into the MJPEG format playable on the e250.Photo ViewerShare slideshows of your favorite photos with your friends. SanDisk Media Converter also supports most image formats, allowing you to convert and downsize your images for display on the e250.On-Board FM RadioThe e250 includes a digital FM tuner for listening to your favorite radio stations. Keep those favorites readily available by adding them to your presets. You can also record live radio on-the-fly for future listening.Voice RecordingHave a thought you need to get down before it evades you? Use the built-in microphone to record voice memos. Capture interviews, classes, short notes to yourself, or anything else you might feel inspired to record.Choose the Capacity for Your NeedsThe Sansa e200 series is available in capacities of 2, 4, 6, or 8 GB.  Each model contains a the microSD expansion slot, meaning you won't be limited to internal memory capacity.What's in the BoxSansa e250 digital audio player, travel pouch and lanyard, stereo headphones, lithium ion rechargeable battery, USB cable, and quick start guide.", "title": "SanDisk Sansa e250 2 GB MP3 Player with microSD Expansion Slot (Black)", "price": 34.99, "imUrl": "http://ecx.images-amazon.com/images/I/41FMVS6DEZL._SY300_.jpg", "related": {"also_bought": ["B000OS8TWO", "B002SN8ZKO", "B000TFJNV8", "B000P9U22W", "B0041G62TW", "B000O26GJS", "B001U3UBT6"], "buy_after_viewing": ["B002MAPT7U", "B005FVNGRS", "B000OS8TWO", "B00BG13P9K"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}