{"asin": "B001TOD3KK", "description": "Enjoy the freedom of recording directly to DVD with the DR570. Convenient and versatile, this unit offers a built-in digital tuner and 1080p up conversion via HDMI. Built-in ATSC or NTSC or QAM digital or analog tuner allows for tuning of analog or digital channels from over the air, or cable, including &#x201C;cable-in-the-clear&#x201D; digital channels. Multi-format recording and playback provides the utmost in recording media convenience with compatibility with the most popular formats (DVD-R, DVD-RW, DVD+R, DVD+RW). Video up conversion up to 1080p resolution via HDMITM takes your current DVDs to a new level, for an amazing viewing experience on today&#x2019;s HDTVs. One Touch Recording makes recording your favorite show simple. Just connect the DR570 to your cable or satellite box and you are set to record with the push of one button! Front DV Input makes it easy to save your precious memories to DVD. Auto Finalize with Undo simplifies the recording process by automatically finalizing your recording for playback on standard DVD players. REGZA-LINK (HDMITM-CEC) makes controlling multiple components easy. Just connect your recorder to other compatible devices using an HDMITM cable, and then control them using one remote, no additional programming or setup required!", "title": "Toshiba DR570 DVD Recorder/Player - Black", "price": 349.95, "imUrl": "http://ecx.images-amazon.com/images/I/31WxoLLjN2L._SX300_.jpg", "related": {"also_viewed": ["B0038JECKY", "B009WROL6G", "B001415ENM", "B005DC203K", "B0014F7Z94", "B003DPKOKK", "B0031WRG56", "B009L04DCQ", "B004PYDE1E", "B000NWZP5U", "B001T6K7G6", "B0014F9U6U", "B00FMHLIXY", "B004VFHR3I", "B0014176XI", "B007FEEO3S", "B00JQOQCD0", "B00195IURA", "B00D97MCL6", "B008Q60VZ4", "B009D7YMRI", "B00009KXA3", "B008VKZHSG", "B00KVCGV5K", "B00EO3A9A0", "B00CCILYDA", "B004QIPKNY", "B000PGDT8O", "B009D7YMPU", "B008RHTXLA", "B000F4C2AM", "B00AKZ76JS", "B0031WLDWS", "B0030DH1HY", "B001UCJVJI", "B001FTCUW6", "B00092HNOA", "B00G0NFK06"], "bought_together": ["B00GYCZEKO"], "buy_after_viewing": ["B0038JECKY", "B009WROL6G", "B001T6K7G6", "B009L04DCQ"]}, "categories": [["Electronics", "Television & Video", "DVD Players & Recorders", "DVD Recorders"]]}