{"asin": "B000AO3L84", "categories": [["Electronics", "Camera & Photo", "Flashes", "Shoe Mount Flashes"]], "description": "The Speedlite 430EX flash unit replaces the popularSpeedlite 420EX. The Speedlite 430EX improves on many specifications of its predecessor and includes new features to maximize digital image quality when using a flash. These include automatic selection of camera white-balance settings and auto-adjustment of the zoom flash position to match the sensor size of the camera to which the unit is attached. The Speedlite 430EX has increased its guide number to 43 (m/ISO 100 at 105mm) and has approximately 40% faster recycling time than the Speedlite 420EX.An ultra-bright, two-LED configuration focus assist-beam has been designed to be compatible with all focus points within the frame of all EOS AF systems, up to 9-point AF.Optimum flash coverageThe flash head zoom covers the range 24mm to 105mm and an integrated diffusion panel allows extended wide-angle coverage to 14mm. When attached to digital EOS cameras with smaller than full-frame sensors (such as theEOS-1D Mark II NandEOS 20D) the Speedlite 430EX gives a more accurate flash coverage by detecting the model to which it is attached and automatically narrowing the angle of coverage. This has the effect of eliminating light loss in peripheral areas and extending the effective flash range.Ideal white balanceThe Speedlite 430EX automatically transfers color temperature information to recent models of digital SLR cameras . The camera then sets the white balance optimally for the flash shot. This feature works when the camera's white balance mode is set to Auto White Balance (AWB) or Flash white balance mode.E-TTL IIThe Speedlite 430EX is fully compatible with the distance linked E-TTL II system found on recent EOS cameras, and supports other EOS cameras that do not support E-TTL II, when required. For a complete multiple flash system, the Speedlite 430EX serves as a wireless slave when either the Speedlite 580EX, Macro Ring Lite MR-14EX, Macro Twin Lite MT-24EX, or Speedlite Transmitter ST-E2 is used as a master.Upgrade for controlAn intuitive and ergonomic interface includes an LCD panel for clear indication of modes and settings. A single bounce lock release button provides immediate control over the bounce head angle for flexible positioning of the flash head. The flash head can be moved up from 0 to 90 degrees (5 settings), left from 0 to 180 degrees (7 settings), and right from 0 to 90 degrees (4 settings). Six custom functions allow customization of the flash operations. Despite high power and short recycling times, the unit is small and lightweight.Fully synchronizedFeatures include 1st and 2nd curtain flash synchronization, plus manual adjustment of flash output from full to 1/64 power (7 levels).AccessoriesAn optional Speedlite Bracket SB-E1 (not included--must be purchased separately) allows the flash unit to be mounted to one side of the camera. Designed specifically for press and wedding photographers, it eliminates the red-eye that can occur when mounting a flash on the axis of the lens, such as on the camera hot shoe. Flash batteries are replaceable without removing the unit from the bracket.", "title": "Canon 430EX Speedlite Flash for Canon EOS SLR Cameras - Older Version", "price": 399.95, "imUrl": "http://ecx.images-amazon.com/images/I/41XAEKR9D1L._SY300_.jpg", "brand": "Canon", "related": {"also_bought": ["B003Y09H8E", "B000CLNHXY", "B003Y30334", "B0034WR19Y", "B0017U0WM8", "B005IQRMN4", "B003F69JBW", "B007NMMUZQ", "B004H3EVVK", "B0002XQWCK", "B00005K47X", "B005AY9278", "B001WB02Z4", "B0000A1G05", "B002W3IXZW", "B002WE4H8I", "B00009R6WO", "B00004ZCK0", "B00DCY29G4", "B006W2I46M", "B00ENSKUUK", "B00009XVCZ", "B001C6SYR2", "B001FO4QHI", "B002K3Z3E8", "B006Y0YZZ6", "B002VPE1WK", "B00007GQLU", "B001KELVS0", "B0053V5MF4", "B00004ZCJG", "B002ZIMEMW", "B001ENW61I", "B00004ZCJI", "B00004ZCJJ", "B004TJ6JH6", "B00007E7JU", "B00004WCID", "B0080JH3YE"], "bought_together": ["B003Y09H8E", "B003Y30334"], "buy_after_viewing": ["B001CCAISE", "B000CLNHXY", "B003Y30334", "B007NMMUZQ"]}}