{"asin": "B002LEVGMO", "imUrl": "http://ecx.images-amazon.com/images/I/41yk1VEZ35L._SX300_.jpg", "description": "Weighing just over 3 pounds and measures 1.2 inches slim, the Acer Aspire AS1410-8414 makes it easy to roam the globe with a powerful PC. It includes a 6-cell battery that provides up to 6 hours of continuous use and a vividly colorful 11.6-inch LCD screen as well as an HDMI port for connecting it to an external monitor or HDTV for viewing presentations and movies. Presented in a stylishCOLORdiamond black case, the thin and light Aspire 1410 also features a full-size keyboard and Acer's ComfyTouch technology, which uses an innovative Laminar Wall Jet Engine design to air-cool the processor and notebook case.At its slimmest point, the Acer Aspire 1410 measures less than 1 inch thin and the AS3810 weighs just 3.1 pounds.Stylish in sapphire blue, the Aspire 1410 also keeps you powered for up to 6 hours of battery life.The Aspire 1410's full-sized keyboard (blue model shown).A Multi-Gesture Touchpad enables you to pinch, flick and swirl your fingers across the touchpad for more natural photo and video viewing as well as intuitive navigation of websites. The Multi-Gesture Touchpad allows you to scroll, zoom in and out and flip through web pages, photos, spreadsheets and more. An integrated Acer Crystal Eye webcam delivers smooth video streaming and high quality images for online chats and business video conferences, even in low-light situations.Other features include a 1.4 GHz Ultra Low Voltage (ULV) Intel Core 2 Solo SU3500 processor, 250 GB hard drive, 2 GB of installed RAM, Draft-N Wi-Fi networking, and a multi-format memory card reader.Key Features11.6-inch LED-backlight widescreen displaywith 1366 x 768-pixel resolution, 16:9 aspect ratio and 200-nit high brightness (Learn more)Energy efficient 1.4 GHz Intel Core 2 Solo SU3500 processorwith ultra-low voltage uses only 5.5 watts of energy--less than 1/10 that of a normal desktop processor--for extended battery life (Learn more)250 GB SATA hard drive(5400 RPM)2 GB of installed DDR2 RAM(667 MHz; 2 x SODIMM slots; 4 GB maximum capacity)Intel Graphics Media Accelerator 4500MHDwith up to 1700 MB of shared video memory and support for DirectX 10 games (Learn more)Multi-gesture touchpadsupporting circular-motion scrolling, pinch-action zoom, page flip (Learn more)Thermal-efficient cooling innovationensures the notebook achieves comfortable skin temperature during use. (Learn more)Crystal Eye webcamsupports Acer PrimaLite technology, which consists of a premium sensor, firmware and lenses to provide superior video performance under low-light conditions. A built-in digital microphone helps keep background noise levels low and minimizes echoes.Draft-N Wi-Fi wireless networking(802.11a/b/g/n) with SignalUp technology for enhanced antenna efficiencyGigabit Ethernet(10/100/1000)5-in-1 memory card readerHDMI (with HDCP) and VGA video outputStereo speakers with Dolby Sound Room audio enhancementtransforms the experience of movies, music, and games.Microsoft Windows Vista Home Premium (32-bit)operating system (Learn more)Up to 6 hours of battery lifewith included 6-cell batteryDimensions:11.2 x 8 x 1.2 inches (WxDxH)Weight:3.1 poundsWarranty:One-year parts and labor limited warranty with concurrent International Traveler's WarrantyNetworking, Connectivity &amp; ExpansionWith its integrated Draft-N Wi-Fi networking capabilities, this laptop provides up to five times the performance and twice the wireless range using 802.11n-compatible routers as you would with 802.11g networks. It's also backward compatible with 802.11b/g networks (commonly found at Wi-Fi hotspots and in older home routers) as well as 802.11a networks (which has a higher throughput, but more limited range--great for closed office environments). This notebook also provides ultra-fast Gigabit Ethernet networking (10/100/1000).3 USB 2.0 ports for connecting a wide range of peripherals--from digital cameras to MP3 players1 HDMI output for connecting to a compatible HDTV or home theater receiver for uncompressed digital audio and video via a single cableAnalog video output: 1 VGA5-in-1 card reader compatible with MultiMediaCard, Secure Digital card, Memory Stick, Memory Stick PRO and xD-Picture Card1 headphone/line-out jack (with SPDIF digital audio support), 1 microphone jack10/100/1000 Gigabit EthernetWhat's in the boxThis package contains the Acer Aspire AS1410-8414 notebook PC, rechargeable lithium-ion battery, AC adapter, and operating instructionsIt also comes with the following software: McAfee Internet Security Suite (trial version); CyberLink PowerDVD; Google Desktop; Acer Backup Manager; Acer GridVistaLearn MoreCOMMENT: ==========================================11.6-Inch Widescreen Display with True 16:9 Aspect RatioThe 11.6-inch LED-backlit display (1366 x 768 pixels) presents true 16:9 aspect ratio with high-def resolution and fast 8ms (millisecond) response time for high-quality media playback as well as increased readability in low-light conditions. And the LED backlight technology is 33 percent more energy efficient than standard CCFL LCD screens.Video is powered by the Intel Graphics Media Accelerator 4500MHD, which uses shared video memory (providing up to 1700 MB of video memory as allocated by the system memory). This graphics card is built with Intel Clear Video technology, which delivers clearer, more detailed images by eliminating many of the jagged edges and video artifacts seen when viewing interlaced content and features powerful color control to ensure videos are not too dark, overly bright, or washed out.COMMENT: ==========================================Energy Efficient Intel Core 2 Solo ProcessorOffering the latest in ultra-low voltage processing power, the single-core Intel Core 2 Solo SU3500 processor has a has a power consumption rating of just 5.5 watts and a 1.4 GHz speed that's paired with a fast 800 MHz front-side bus (FSB) and extra-large 3 MB L2 cache. (An L2, or secondary, cache temporarily stores data; and a larger L2 cache can help speed up your system's performance. The FSB carries data between the CPU and RAM, and a faster front-side bus will deliver better overall performance.) The Core 2 Solo processor delivers enhanced performance for today's demanding applications such as CAD tools, 3D and 2D modeling, video editing, digital music, digital photography and gaming. And Intel's Smart Cache technology enables smarter, more efficient cache and bus design for enhanced performance, responsiveness and power savings.COMMENT: ==========================================The Multi-Gestured Aspire 1410A Multi-Gesture Touchpad allows you to pinch, flick and swirl your fingers across the touchpad for more natural photo and video viewing as well as intuitive navigation of websites. The Multi-Gesture Touchpad enables you to scroll, zoom in and out and flip through web pages, photos, spreadsheets and more.The TouchPad can also be disabled with a one-touch button, eliminating accidental cursor movement with palms and wrists when using an external mouse.COMMENT: ==========================================Cool to the TouchThe Acer Aspire 1410 notebook includes Acer's ComfyTouch technology, which uses an innovative Laminar Wall Jet Engine design to air-cool the processor and notebook case. Even when running for a full day the notebook remains cool in your hands or on your lap.COMMENT: ==========================================Windows Vista Home Premium Operating SystemWindows Vista Home Premium (32-bit version) is the operating system for users with advanced computer needs, and it includes all of the Windows Media Center capabilities for turning your PC into an all-in-one home entertainment center for watching DVD movies and accessing your digital audio library. You can also use Windows Media Center to record and watch your favorite TV shows (even HDTV) and to access new kinds of online entertainment content. Computers that include Windows Vista Home Premium and an auxiliary Windows SideShow display will also allow you to access key data even when your computer is off. It is also easier than ever to share files between other PCs in your household and to manage your laptop computer settings to more securely connect via Wi-Fi.Every edition of Windows Vista provides the essential tools and technologies to help protect you whether you are browsing the Internet, connecting to a wireless network, or just reading e-mail. All editions of Windows Vista include new tools that can warn you of impending hardware failures long before you have lost any important personal data. And, all Windows Vista editions include parental control features that allow you to manage and monitor your family's use of games, the Internet, instant messaging, and other activities.", "categories": [["Electronics", "Computers & Accessories", "Laptops"]], "title": "Acer Aspire AS1410-8804 11.6-Inch Black Laptop - 6 Hour Battery Life"}