{"asin": "B003WJR68U", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Panasonic's Lumix DMC-FZ100 features a newly-developed Leica DC Vario-ELMARIT lens with powerful 24x optical zoom. As Panasonic's first hybrid compact digital camera with a MOS sensor, the Lumix FZ100 can record full 1080p High Definition (HD) video--giving you a powerful hybrid that can shoot video and still photos with ease and professional-like quality.The Lumix FZ100 has an incredibly fast burst shooting in 14.1-megapixel full resolution at 11 frames per second with a mechanical shutter, and increases the frames per second to 60 in 3.5-megapixel recording. Additionally, the Lumix FZ100 features continuous Auto Focus up to five frames per second at full resolution for great action shots. It also features Intelligent Burst shooting. The digital camera judges the appropriate shutter speed to suppress the motion blur according to the movement of the subject, rising as high as possible, activating the high sensitivity recording.Panasonic Lumix DMC-FZ100 HighlightsIntelligent Auto (iA) modePanasonic's Intelligent Auto (iA) mode, a hallmark on all Lumix digital cameras, now includes Motion Deblur mode. By updating the motion detection (Intelligent ISO Control) and brightness control (Intelligent Exposure) users can gain the highest shutter speed possible. Combined with the outstanding brightness of the lens and the POWER O.I.S. (Optical Image Stabilizer), the Lumix FZ100 prevents any blur created from a handshake or a moving subject. The iA suite of technologies include: POWER O.I.S., Face Recognition, Face Detection, AF Tracking, Intelligent ISO Control, Intelligent Scene Selector and Intelligent Exposure. Panasonic's iA is also available while shooting video.Free-angle 3.0-inch LCDFeaturing a free-angle 3.0-inch large 460,000-dot high-resolution LCD, the Lumix FZ100 features wide-angle viewing with Face Recognition functions that automatically remembers registered faces for future recording.Intelligent Scene SelectorThe Intelligent Scene Selector automatically selects one of 6 Scene modes to best suit the shooting situation.Dolby&reg; Digital Stereo CreatorThe Lumix FZ100 also features Dolby&reg; Digital Stereo Creator. This high-quality stereo sound offers realistic sounds and effects to any movie. For greater sound quality, the Lumix FZ100 has a newly-created port for an optional stereo microphone (DMW-MS1) and a Wind Cut function is available to drastically reduce background wind noise.Record photos and HD video in AVCHD formatThe Lumix FZ100 can record photos and HD video in AVCHD format on SD/SDHC/SDXC memory cards.My Color modeMy Color mode, first introduced in the Lumix G Micro Systems cameras, is a special option that gives freedom to the user's creativity. With a variety of options including new Pin Hole, Film Grain, High Dynamic and High Dynamic B&amp;W, the My Color mode makes it easy to create innovative images and videos using new intensive color, brightness and saturation levels.Additional FeaturesBundled SoftwarePHOTOfunSTUDIO 5.2 HD Edition makes it possible to sort and organize photos. Videos can be uploaded directly to YouTube using the built-in YouTube uploader, while also letting the user create a 360-degree rotation panorama file in .MOV files. The software is compatible with the Windows 7.Happy ModeAn option in iA that optimizes color, saturation and brightness to make both photos and movies more vivid and true to the color of the scene you memorized.What's in the BoxLumis FZ100 digital camera, battery charger, battery pack, AV cable, USB cable, hand strap, CD-ROM", "title": "Panasonic Lumix DMC-FZ100 14.1 MP Digital Camera with 24x Optical Image Stabilized Zoom and 3.0-Inch LCD - Black", "price": 448.89, "salesRank": {"Camera &amp; Photo": 5556}, "imUrl": "http://ecx.images-amazon.com/images/I/41tyIKEIvtL._SX300_.jpg", "related": {"also_bought": ["B0039BPG1A", "B001UE6N74", "B006V4NCKO", "B004FSBIZY", "B003VNKNEQ", "B001LMU76I", "B004DLJNQE", "B004XIB9T6", "B003VNKNF0", "B00004ZCJG", "B002ONSZPI", "B00AXX0IEC"], "bought_together": ["B0039BPG1A", "B003VNKNF0"], "buy_after_viewing": ["B008MB6ZX0", "B008MB6ZX0", "B003VNKNF0", "B0039BPG1A", "B00DY2Y28M", "B00DY2Y28M"]}}