{"asin": "B000FRU1UM", "description": "What does the American Dream mean today?For Niko Bellic, fresh off the boat from Europe, it is the hope he can escape his past. For his cousin, Roman, it is the vision that together they can find fortune in Liberty City, gateway to the land of opportunity. As they slip into debt and are dragged into a criminal underworld by a series of shysters, thieves and sociopaths, they discover that the reality is very different from the dream in a city that worships money and status, and is heaven for those who have them and a living nightmare for those who don&#146;t.Beginning with the 1997 release of the originalGrand Theft Auto, theGTAseries has been one of the most prolific, controversial and down right entertaining franchises in video games history. This pedigree of success guarantees that the highly anticipated eleventh game in the series,Grand Theft Auto IV, will garner at least as much attention if not more.Return to Liberty City.The dream as Niko expected it.View larger.There's always a catch.View larger.But some skills are international.View larger.The PlotGrand Theft Auto IVis a brand new adventure in theGTAuniverse following the experiences of Nikolai \"Niko\" Bellic, a new immigrant from an undisclosed eastern European country whose troubled pa  st and the persuasion of his cousin Roman have brought him to the fictional Liberty City. Unfortunately, Niko&#146;s search for the American Dream and a much needed fresh start, hits an immediate snag when the rags to riches story Roman spun to pique Niko's interest is exposed as not only a complete fabrication, but a ploy to enlist Niko&#146;s well-known skills as a tough guy against the ample list of enemies clamoring for Roman&#146;s debt-ridden blood.Because Roman is the only person Niko knows in Liberty City he begrudgingly accepts his role as Roman&#146;s protector despite the deception. But as time goes on Niko comes into his own, and his experience on the wrong side of the tracks proves more valuable than he could have ever imagined as he fights for survival and later supremacy on the crime ridden streets of Liberty City.Game EnvironmentsBased on several of the boroughs of New York City and parts of New Jersey, Liberty City, familiar to players of previous games in  the series, has been entirely redesigned forGTA IV. Players can expect visible detail down to the weeds growing in the cracks in the sidewalk, cars and buildings of visibly different ages and a much greater level if verticality in the buildings and bridges that they are able to explore as Niko moves through the city streets. In addition, pedestrians inGTA IVare much more realistic. No longer simply moving cardboard cutouts, these NPCs are intelligent, modern, human representations that laugh, cry, eat, drink, use cell phones and ATMs, and talking amongst themselves regardless of Niko&#146;s interaction with them.GameplayHistoricallyGTAgames have focused heavily on mission-based play, requiring successful completion of fixed tasks in order for players to progress through the game, but this has changed to a great extent inGTA IV. Players will experience an entirely new and exciting emphasis centered on the blending of on-mission and off-mission play, resulting not only in an increased sense of realism, but more interesting and unrestricted gameplay.FeaturesAside from the car jacking and a detailed city environment here are the new features forGTA IV:Improved combat system - Now you can use cover and also a target lock system, which allows you to take out targets with greater ease and accuracy. Plus, you can engage in some hand-to-hand combat if you can't get your hands on a piece quick enough.Cell phone - Not just for basic phone calls anymore.  Use your in-game cell phone to receive missions via SMS, snap photos, and ZiT (tag) songs that can be downloaded exclusively on Amazon.com/mp3.Free time - In between missions you can take advantage of \"me\" time.  There are gentleman's clubs, comedy clubs, bowling alleys, and bars, which all house unique activities.Take a break from the storyline - A variety of side missions allow you to help run a car service, \"borrow\" cop cars, assassinate targets, help solve problems for those on the street, or take to the air with stunt jumps that are scattered all over the city.Control your own fate - Throughout the game choice moments will arrive causing you to make a decision that will affect relationships and money.MultiplayerGive Niko a rest and create your own multiplayer \"hero.\"GTAhas added multiplayer modes allowing you to take your creation out to play online in competitive, co-op, and free form modes. Competitive mode has you fighting against the cops, jacking cars, or racing to finish odd jobs.  Co-op challenges you and your friends with various tasks including Hangman's NOOSE where you are responsible for escorting a wanted kingpin to a safe extraction point.  Freeform lets you and 15 others lose on Liberty City.  Use this mode to hit up the bar and play virtual darts versus each other or head out to the streets and set up your own drag races.  If you can dream it, you can do it in Freeform mode.ZiT: We'll Spot The Song For YouWhen playing Grand Theft Auto IV, if you hear a song that you are interested in buying as an MP3, all you have to do is dial ZiT-555-0100 on your in-game mobile phone and a text message will be sent to you with the name of the artist and the title of the track. The next time you log in at theRockstar Games Social Club, you will find 30-second previews of all the songs you have ZiT'ed while playing the game. You can add them to your basket there and click to purchase at Amazon MP3, or you can find them all atwww.amazon.com/gtamusic.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51HI0YOEx9L._SY300_.jpg", "related": {"also_bought": ["B002DC8GMM", "B0050SYILE", "B00503E8S2", "B002MED6F8", "B0022TNO7S", "B0017ZDGWG", "B003O6G5TW", "B002I098JE", "B0050SYX8W", "B006ZTHGCK", "B00D9EPI38", "B000ZK6950", "B0050SY4DG", "B003O6N266", "B002I0H79C", "B003R783IY", "B000FRU0NU", "B0012N3ZXS", "B004QEV0MI", "B000FRS9II", "B002BSA20M", "B006VB2UNM", "B00BMFIXT2", "B002I0K50U", "B003ZSP0WW", "B002I0HBZW", "B007YZ5QQM", "B000ZK9QD2", "B004HYK956", "B007XVTR3K", "B003JVKHEQ", "B002I0JBVY", "B00269QLI8", "B005C2D2MO", "B0050SY5BM", "B00BU3ZLJQ", "B007M6W38W", "B0016B28Y8", "B00269DXCK", "B0076ZPYPI", "B00EVWZHLK", "B000ZK698C", "B003C1I0CO", "B00309S9YW", "B0085CA8NY", "B002I0H8R8", "B004X56OU8", "B0050SYLRK", "B002DC8GKE", "B0088I7KYU", "B007MJSZDQ", "B000QY9C90", "B00273Z9WM", "B0050SYV70", "B000BPLCDI", "B006ZPAYMI", "B002I0J998", "B000ZKDOV2", "B00519C7CE", "B001QXNBJM", "B000G7YRHO", "B001REZLY8", "B001TOQ8J8", "B005OSFUWG", "B001HWB68K", "B0030CV356", "B001G3AZS2", "B00BRQN2EM", "B001SH7YMG", "B001AWIP68", "B002EE5ROO", "B007SRM5MO", "B0025KZV7A", "B00DWXV1DM", "B00309U0M6", "B000TG530M", "B000SQ5LQ4", "B0050SWTAQ", "B006VB2UO6", "B000TI836G", "B002BSA1MQ", "0744009332", "B00FATRKWM", "B007WQOIGW", "B000AX21VI", "B000WSE2WM", "B001D7T2XA", "B0023CBY4E", "B004I5EE46", "B002BSA2LQ", "B007LQG9A6", "B000RHZ9JI", "B00CXTX2YW", "B005N4HBE6", "B004Z4ZJZS", "B008J16AP6", "B002F87WEW", "B007MM9E4C", "B002GN8HU4"], "bought_together": ["B0050SYILE", "B002I098JE"], "buy_after_viewing": ["B0050SYILE", "B0045EI7I4", "B002I098JE", "B00BMFIXT2"]}, "salesRank": {"Video Games": 419}, "categories": [["Video Games", "Xbox 360", "Games"]]}