{"asin": "B004QZASJ8", "categories": [["Electronics", "Computers & Accessories", "Tablets"]], "description": "The Android-based Dell Streak 7 is the ultimate entertainment hub for those craving a rich multimedia and web experience. It features a brilliant 7-inch WVGA multi-touch display made of damage-resistant Gorilla Glass that's ideal for Web browsing, streaming video, watching TV and movies, reading books and magazines, or playing games wherever you roam.The Dell Streak 7 offers a vibrant 7-inch, multi-touch display (seelarger image).Powered by a screaming fast, dual-core 1 GHz NVIDIA Tegra 2 processor, the Streak 7 is loaded full of entertainment and family-friendly apps--from Kindle for Android and Zinio magazines to BrainPOP and Slacker Radio.&nbsp; The Streak 7 also helps you capture and shares favorite moments with the rear-facing 5 megapixel camera for high-definition stills and video recording and a front-facing 1.3 megapixel camera for video-calling using the preloaded Qik Video Chat application.Other features include a 16 GB internal memory that can be expanded via optional microSD memory cards (up to 32 GB in size), Swype virtual keyboard technology, full support for Adobe Flash Player, up to 4 hours of continuous video playback time, and up to 3 days of standby time.Enjoy a rich web and multimedia experience at home or on the go (seelarger image).Android 2.2 OS and Dell Stage User InterfaceThe Streak 7 runs the latest Android operating system--OS 2.2 (aka, Froyo)--which provides a faster overall Android experience as well as greater multitasking capabilities. You'll be able to receive notifications, listen to music, and even record GPS data without keeping the application open. And it features a plethora of new enhancements, including an improved QWERTY keyboard, full push corporate e-mail, and Adobe Flash Player 10.1 for access to the full Web.It also provides easy access to both personal and corporate e-mail, calendars, and contacts supported by Exchange Server and Gmail. And through Android Market, you'll get access to thousands of useful applications, widgets, and fun games to download and install on your phone, with many more apps being added every day.The Streak 7 also features Dell's innovative Stage user interface, which provides a seamless and unified experience for accessing all your favorite content. Later this year, Dell will add syncing to Stage so you can keep your photos, contacts, calendars, and other personal content synchronized across your Dell Stage-equipped devices--from tablets to PCs--connected through your home network.Streak 7 Entertainment and ContentThe Dell Streak 7 comes preloaded with unique content and applications to entertain the whole family, including:Includes a 1.3-megapixel front-facing camera for video chats on popular services such as Qik or Skype (seelarger image).Qik Video Chat.With the Streak 7's front-facing camera paired with Video Chat through Qik, you can hold video conversations with those who have a Streak 7--or other compatible mobile device--and even broadcast your view through the rear-facing camera.BrainPOP:Animated educational content embraced by students and trusted by teachers and parents around the globe. BrainPOP brings learning to your fingertips.Zinio.The largest online newsstand, enabling customers to shop for, search inside, read, share and save digital content in new ways with more than 75,000 digital magazines from 26 countries.Kindle for Android.Lets you shop for hundreds of thousands of books in the Kindle Store, including New York Times Best Sellers and new releases from $9.99. Use Amazon's Whispersync technology to automatically synchronize your last page read, bookmarks, annotations, and more across your various devices--including Kindle, Kindle DX, PC, Mac, iPad, iPhone, iPod touch, BlackBerry and Android phones.BLOCKBUSTER On DemandEnables you to discover and download the latest movie rentals.&nbsp; Blockbuster's first-ever video download application on a smartphone allows you to buy a movie on one device and watch on another connected device through Blockbuster's library.Let's Golf (Gameloft).Discover a fun atmosphere making golf accessible to anyone with 63 holes in 4 environments in 3D and 4 characters to customize. 63 holes in 4 distinct locations remodeled in 3D: Fiji Beach, the American Mountains, the English Countryside, and Scottish Lochs.Slacker Radio.With millions of songs from thousands of artists, Slacker is the best way to discover new artists and hear your favorite music. Listening to Slacker is as easy as selecting one of over 120 DJ-programmed genre stations or searching for your favorite artist or song.Android OSAndroid 2.2 operating system (Froyo)with over-the-air upgrade capability for future OS releasesConnectivityOnboard GPSfor navigation and location servicesIntegrated Google Mapswith voice-activated search, turn-by-turn navigation, street and satellite viewsUltra-fast Wireless-N Wi-Fi networking (802.11b/g/n)for accessing home and corporate networks as well as hotspots while on the goWi-Fi Sharingallows you to use your phone's 3G mobile broadband to connect laptops and other Wi-Fi enabled devices to the Internet.Bluetooth connectivity (version 2.1)for hands-free devices and stereo music streaming.Camera5-megapixel rear camerawith auto focus, multi-shot mode, and LED flash. You can share them with family and friends by sending them to any e-mail address or MyAlbum.1.3-megapixel front-facing camera for video chats(fixed focus) for face-to-face chats on popular services such as Qik or SkypeHD 720p video capture(from rear camera)MultimediaMusic playercompatible with MP3, WMA, and AAC/AAC+/eAAC+Video playercompatible with H.263/H.264, 3GP, MPEG4, WMVMemory16 GB internal memoryMemory expansion via microSD card slotwith support for optional cards up to 32 GB.Design and Hardware1 GHz nVidia Tegra T20 dual core processor7-inch capacitive multi-touch display(800 x 480 pixels) made of ultra-durable, scratch-resistant Corning Gorilla Glass with proximity and light sensors.Onscreen keyboardSwype input systemallows you to input text faster and easier by gliding your finger around the keyboard, moving from letter to letter in one continuous motion.Built-in batteryCommunications &amp; InternetEasy access to favorite social networking sitesincluding Facebook, Twitter, Flickr, and YouTubeText (SMS) and picture/video (MMS) messagingwith threaded messaging viewPersonal and work e-mail(supports Microsoft Exchange corporate e-mail)Instant messaging servicesincluding AOL, Yahoo!, Windows Live Messenger, and Google TalkReal web browsingwith full HTML WebKit browserSupport for Adobe Flash 10.1makes sure that your favorite sites load and look their very bestMore Features3.5mm headphone jackOrganizer toolsincluding calendar, alarm clock, and calculatorUSB 2.0 portwith mass storage capabilities.Vital StatisticsThe Dell Streak 7 weighs 17.6 ounces and measures 7.9 x 4.7 x 0.5 inches. Its 2780 mAh lithium-ion battery is rated at up to 4 hours of continuous video playback, and up to 72 hours (3 days) of standby time.What's in the BoxDell Streak 7 tablet, rechargeable battery, charger, wired stereo hands-free headset, quick start guideAlso Available for This Android DeviceAppstoreAmazon Appstore for AndroidGet a great paid app for free every day.KindleKindleBuy a book once and read it everywhere with our free Kindle Reading App for Android.MP3Amazon MP3Shop 15 million songs and stream your Cloud Drive music directly from your Android device.IMDBIMDBFind local movie showtimes and TV listings, watch trailers, and search the world's largest source of entertainment information.AudibleAudibleDownload audiobooks directly to your Android device, then listen wherever you go, get audiobook news, earn badges, and more.AMZN MobileAmazon MobileShop for millions of products, get product details, and read reviews--right from your mobile device.", "title": "Dell Streak 7 Wi-Fi Tablet", "price": 88.99, "imUrl": "http://ecx.images-amazon.com/images/I/41vb5LExEUL._SX300_.jpg", "brand": "Dell", "related": {"also_bought": ["B005HNG2WK", "B004MWRMXK", "B00EHYCTY0", "B0051XPGXM", "B004PD72J0", "B004OZY9NQ", "B0050E7G1C", "B0058BWWMU", "B004THC3O6", "B004ZI16RO", "B004OU7M5S", "B0077RTFKK", "B007XQREZ8", "B004M9POR4", "B00EKQ9FF6", "B007VLYITK", "B00FFVYSE8", "B00ACGMMN0", "B00J84IJ5C", "B004Q9SVOI", "B00CVD9M3A", "B004OB0EBQ", "B0063IVH1O", "B00DKFF386", "B00B5LADVO", "B00AHEEOII", "B00GCC08FC", "B0062W95R4", "B00CBMTYWK", "B00485CGHS", "B00B5LACEM", "B00HP10PYI", "B008031QKW", "B00CHKK0XS", "B00J1W0NYG", "B00FRRYOQW", "B009PLBLQC", "B00GQNZZAU", "B00E435N1A", "B00I3YPKZA", "B00GM7Z8F2", "B00F64LD4W", "B00A29WCA0", "B009QZH49K", "B00HHPZ9WK", "B00E37T58Y", "B00KMRGF28", "B00D02AGU4", "B00GD4ZCR8", "B00HWMPSL0", "B007UI40NI", "B00CY9EG3C", "B00K6P6MRY", "B00A7K62Z0", "B00IVI3LWM", "B00ALGOQCQ", "B00HAS0VGI", "B000IG3VX4", "B00JU2X5VU", "B00BNR5AWM", "B00FFVYSKW", "B009W49ALA", "B004IIHGZ2", "B00GX05NDU", "B00HP0YD4M", "B00HXB5H8Y", "B00FW320OE", "B00GXHPN1U", "B004HJ3J8K", "B00G3Q46DC", "B00G6BQ31W", "B00IBFA7R2", "B008D902Q2", "B004UL34EY", "B003DIHD6U", "B00DYQYLQQ", "B00GM9MELQ", "B00IYHDYXG", "B001FWYGJS", "B005J7YBRW", "B00B8A43CC", "B004SBJHW4", "B00D7Z5T7E", "B006L9G20Q", "B00E89FFO0", "B00HPTMCRI", "B00J1W0P9O", "B00HWMPSJC", "B002LL4UO8", "B00BUU8RM2", "B0072CYS9I", "B00EV54ZZQ", "B00JTI4X3E"], "bought_together": ["B005HNG2WK", "B004MWRMXK"], "buy_after_viewing": ["B00GX05NDU", "B004M9POR4", "B00DKFF386", "B00C5W16B8"]}}