{"asin": "B001D7T2XK", "description": "The leading sports entertainment video game experience embraces its colorful roots to deliver the definitive elements of WWE from the eighties and nineties. Featuring an impressive lineup of legendary superstars and managers, a new combo fighting system, an authentic presentation and more,WWE Legends of WrestleManiaenables gamers to compete in classic feuds, create history of their own and secure a spot in the WWE Hall of Fame..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }WWE Legends of WrestleManiaPlayers:Offline: 1-4; Online: 2-4Gameplay Modes:Single player, competitive &amp; coop multiplayer.Other:HDTV 720p, stats, leaderboard &amp; online voice support.Relive WrestleMania events.View larger.Replay historic matches.View larger.Battle more recent rivalries.View larger.Stalk the ring as a manager.View larger.Relive, Rewrite and Redefine the History of WrestleManiaSince the first event at Madison Square Garden in 1985, WrestleMania has provided some of the most memorable moments in the history of sports entertainment. These moments continue on an annual basis with each new WrestleMania, but withWWE Legends of WrestleMania, fans both new and familiar with action in the squared circle can not only experience the defining moments and characters of classic matches from the eighties and nineties, but can also change history by reliving, rewriting or redefining them. So, whether classic WrestleMania action for you is the old school showdown between Andre the Giant and Hogan at WrestleMania III, the heated battle between \"Stone Cold\" Steve Austin and The Rock at WrestleMania XV, or anything in between, if you are a professional wrestling fanWWE Legends of WrestleManiais for you.WrestleMania Tour Mode - The 3 \"Rs\"In WrestleMania Tour Mode players are given a choice of how they want to experience the events of the first 15 WrestleManias. After a match is selected a short video plays detailing the history of the feud between the combatants and the outcome of the match at hand. You can choose to relive the match - play as the historic victor and win it exactly as it happened; rewrite the match - play as the historic loser and change history by winning it; or redefine the match - fight through an entirely new series of elements introduced into the match and defeat your opponent. Regardless of your choice you will be fed a series of objectives. Completion of these objectives earns players points, which contribute to the various PSN trophies accessible through the game. Players can also ignore the objectives and win the matches by whatever means available. Victory by either means will unlock the next match in the series. The choice of path to victory is yours inWWE Legends of WrestleMania.More Than 40 Playable CharactersCovering fifteen years of WrestleMania historyWWE Legends of WrestleManiacomes packed with a wealth of characters. All told, players can expect more than 40 playable characters, both wrestlers and managers. Each character will have his own authentic personality, temperament, and signature moves. Just a few of the faces from the past that you can expect to see in action are:Andre the GiantThe marquee wrestler of the 70s and 80s, at 7'4\" and over 500 pounds, Andre was known as the \"Eighth wonder of the world\" and maintained a winning steak for nearly 15 years to prove it.Hulk HoganOne of the most successful sports entertainers of all time, the Hulkster drove the worldwide phenomenon of \"Hulk-a-Mania\" as he captured the World Heavyweight title six times over 20 years.Bobby \"The Brain\" HeenanDebatably the greatest manager of all time, \"The Brain\" guided the careers of some of the best of all time and was a force to be reckoned with both in and out of the ring.Jimmy \"Superfly\" SnukaFijian superstar Jimmy Snuka was one of the most popular and often imitated wrestlers of his day for his mastery of aerial acrobatics off the top rope, which earned him the lofty nickname \"Superfly.\"New Combo Fighting StyleDesigned to be accessible to players at all levels, action inWWE Legends of WrestleManiais built around a new streamlined combination fighting style. The grappling action here is arcade like, quick and easy and controlled primarily through the combined use of the joystick and face button controls with on-screen prompts indicating the exact input necessary to produce character-specific combos, taunts and signature finishing moves.Key Game Features:Distinguished Rosters and Managers- Relive the entertaining lives of more than 40 larger-than-life WWE Legends. Legendary Managers will also have extensive functionality, playing important roles in match outcomes.Absolute Realism- Embrace a historically accurate representation of WWE telecasts from the Eighties and Nineties, including dynamic visual treatments, signature ring entrances, renowned commentators, notable venues and much more.Combo Fighting Style- Explore a new, grapple-based fighting system that captures the high-energy action and drama seen in historic WWE matches. Players will have each Legend's arsenal of grapple moves, strike attacks, reversals and taunts at their disposal throughout a variety of current and nostalgic match types.WrestleMania Tour Mode- Participate in key matches from multiple WrestleMania events. Vintage WWE footage will set up matches, explain feuds and detail the rivalries behind them, situating players in the heart of each contest.Create a Legend- Create the Legends of tomorrow, complete with customizable costumes, entrances, move sets and more.Online Action on PlayStation Network (PSN)- Challenge players around the world to matches on the biggest stages in WWE history, while collecting nearly 20 PSN trophies in the process.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/61h2YptI2IL._SY300_.jpg", "related": {"also_bought": ["B003S2OOC2", "B00175GC3Q", "B003P9C70E", "B0053BQU4G", "B0012RWQ52", "B0085L2T0A", "B002E1OXVU", "B00CMC6HCY", "B000S1MMIO", "B002I0J58I", "B001NJ28SO", "B001D7T2X0", "B003S2OO40", "B005EZ5GYQ", "B00198AZ98", "B0017ZIIK6", "B004P8CKS8", "B00KBZHSVI", "B003IEBO9Q", "B000JHMJDU", "B0000AHOOK", "B00647615G", "B006VB2UMI", "B00FYX65Q6", "B003IMGC9U", "B001UU1WN8", "B00IL7G832", "B00386VMWI", "B00006JBS4", "B000FW87AI", "B0002RQ3KC", "B005EYG6I2", "B002I0J4FW", "B0030CYE8O", "B006VB2UNC", "B0053BSOD6", "B00BU7WVCM", "B005N64U9I", "B000FII8KQ", "B0001AVZ58", "B007SRM5U6", "B00FYX6AD4", "B002E1R1TG", "B005EW61MA", "B000APZ40G", "B00G98716S", "B0048C7S5G", "B004L5SJ58", "B001NQ7GH0", "B00HCR8VEQ", "B001GGO1GG", "B00AJGVIBA", "B002I0K8JI", "B00A750QIE", "B0056WJA3U", "B002I0HIMI", "B000FPOJOS", "B003O680RM", "B000V4TXN0", "B001S86IRC", "B003171CEW", "B004FUI84G", "B004CVQUOI", "B002CYWJWO", "B008E6ZXMM", "B006ZTHFPS", "B0013G0XYI", "B007V9NHMQ", "B004BCZLQ6", "B00C710AQO", "B00198PO5I", "B00005NN5L", "B000LV6PI4", "B005GSRDHO", "B00JQHU9RC", "B00006IJJF", "B001RXB4S6", "B000R39GPA", "B002WSR8CQ", "B00420K18K", "B000JLIYLC", "B0090PX82S", "B005C7R950", "B00HQY8LRM", "B00HRYH7G2", "B007Z3UUDW", "B002I0JBL4", "B002I0J8KS", "B00175GC4U", "B000IONGWW", "B00DNF1STG", "B0050SX1JO", "B004MXM7WU", "B0037TPGHI", "B007M6W3A0", "B003O6E5OE", "B004DI5H26", "B003ZRZW9O", "B002I0K6X6"], "bought_together": ["B00CMC6HCY"], "buy_after_viewing": ["B00CMC6HCY", "B003S2OOC2", "B0085L2T0A", "B0053BQU4G"]}, "salesRank": {"Video Games": 8406}, "categories": [["Video Games", "PlayStation 3", "Games"]]}