{"asin": "B00006HVT4", "categories": [["Electronics", "Computers & Accessories", "Computer Components", "Memory"]], "description": "DDR (Double Data Rate) SDRAM memory is an evolutionary product built upon the foundation of older PC100/PC133 memory technology. Unlike SDRAM memory that supports one operation per the computer's clock cycle, DDR SDRAM memory can do two operations per clock cycle, thereby doubling the memory bandwidth over the corresponding single-data-rate SDRAM.Kingston Technology Company is an active me MBer of JEDEC, the computer industry's standards body which developed and finalized the specifications for the DDR SDRAM modules. Kingston's Director of Technology sits on the Board of Directors of JEDEC, and Kingston's engineers actively participate in the memory technology subcommittees working on current- and next- generation memory products. Kingston's DDR development efforts closely involve leading semiconductor, processor, chipset and motherboard manufacturers as well as PC OEMs.As a result of its aggressive product development efforts, Kingston was the module industry's first-to-market with a complete line of PC1600 DDR memory modules in 2000. Then, in 2001, Kingston was first-to-market with the newest PC2100 DDR DIMMs and PC1600/2100 DDR SO-DIMMs for OEM customers for future DDR notebooks and communications products; Kingston ended 2001 by shipping PC2700 DDR DIMMs to the system builders preparing to launch 333 MHz DDR platforms in 2002. Kingston launched 400 MHz PC3200 DDR modules in November 2002 for the gaming and enthusiast markets.Along with JEDEC and other partners, Kingston's engineers are actively working on future DDR memory products.DDR - The New Mainstream Memory TechnologyDDR memory has been selected by the computer industry to be the mainstream memory technology for 2002 onward. DDR memory will be used in many different platforms, including desktop PCs, servers, notebooks, compact- and sub-compact computers, and networking/communications platforms.DDR memory was selected because of its increased performance as well as its low-cost premium over SDRAM, since DDR can easily be manufactured by existing semiconductor fabrication plants and can be built and tested without significant capital investments. DDR memory delivers increased memory bandwidth and performance over SDRAM memory for many business, multimedia, and entertainment applications. In the second half of 2002, DDR memory represented over 50% of the memory market.", "title": "Kingston ValueRAM 512 MB 333MHz PC2700 DDR DIMM Desktop Memory (KVR333X64C25/512)", "price": 5.5, "imUrl": "http://ecx.images-amazon.com/images/I/51t%2BFqpzQtL._SX300_.jpg", "brand": "Kingston", "related": {"also_bought": ["B00005LLY4", "B003CH8NXY", "B000VRZ7PA", "B0002IP2TY", "B000092TR5", "B002EAAS8S", "B004XN8UHU", "B005CTCD6S", "B002ZOZJK0", "B004LT8MN8", "B001V9LQC0", "B003VSB8UO", "B0001BFJDG", "B000RT77I2", "B00009MVJM", "B00461G3MS", "B000U90DD0", "B003CH6ZR0", "B0000721Z0", "B0002821X4", "B00C53H080", "B000701CJQ", "B005WEYB0Y", "B0010494TS", "B001QMM6NU", "B00006BA9U", "B00006BT1H", "B008D6Y43C", "B0000V1A8A", "B000Q85WOK", "B003CHANJG", "B0031GK3OI", "B001OORMVQ", "B003PJG8K4", "B00GOUBT6E", "B0049MPQA4", "B0096BEJDI", "B001QWWXA6", "B0088PUEPK", "B000W8UIZW", "B00461K1QW", "B0034CSUZ8"], "bought_together": ["B00005LLY4", "B000VRZ7PA"], "buy_after_viewing": ["B0000721Z0", "B003CH8NXY", "B0002IP2TY", "B00C53H080"]}}