{"asin": "B000GHTGES", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The new 10.1-megapixel Panasonic Lumix DMC-FZ50, successor to the popular DMC-FZ30, features a powerful f2.8 Leica DC lens with 12x optical zoom. The lens focal length is equivalent to 35-420mm on a 35mm film camera and is enhanced by Mega O.I.S., Panasonic's exclusive Optical Image Stabilizer system.The DMC-FZ50 boasts a 10.1-megapixel high resolution CCD for its image sensor and Venus Engine III for the image processing LSI, making it possible to record a image at maximum ISO 1600 high sensitivity setting at full resolution. Furthermore, by dramatically reducing the noise levels that challenged its predecessor, the DMC-FZ50 is able to capture 10.1-megapixel full resolution images even in high sensitivity recording.To fight against the major cause of blurred images, Panasonic invented the Mega O.I.S. system taking advantage of its superior lens technology to compensate for handshake--a feature which has long been incorporated into the Lumix range of cameras. In addition, to also compensate for the other major cause of blurred images--movement of the subject--the FZ50 is also equipped with the world's first Intelligent ISO Control (hereafter I.I.C.) and maximum ISO 1600 high sensitivity recording capabilities within the advanced image processing LSI Venus Engine III. When set to the I.I.C., the Venus Engine III detects the subject's movement and adjusts the ISO setting and shutter speed to best suit the subject movement and the light condition automatically. Panasonic's excellent image stabilizing system allows users to take clear, crisp images in any situation automatically, leaving everything to the camera.From a point of view of further improving the usability of its predessor, the DMC-FZ50 is equipped with a new Function Button which serves as a shortcut to quickly set frequently-used settings such as recording image size, light metering, AF area, white balance, and ISO sensitivity. Also, thanks to the newly incorporated custom setting function, your frequent setting patterns can be memorized and it can be instantly applied by simply selecting this function with the mode dial. The 2-inch LCD flips out to 180 degrees, making it easier to view even when shooting from high or low angles. As for optional accessories, the DMC-FZ50 is now compatible with TTL external flashes. Finally, the battery life is greatly extended by approximately 29% compared with its predecessor allowing the FZ50 to shoot approximately 360 images on one charge (CIPA).The Lumix DMC-FZ50 faithfully inherits the well received basic specifications from its predecessor FZ30 such as the manual focus ring and manual zoom ring, yet enhances the image sensor up to 10.1-megapixel. Noise is drastically reduced with this new FZ50 achieving a rendition of even higher quality images.10.1-Megapixel CCD and f2.8 12x Optical Zoom Leica DC LensThe DMC-FZ50 includes a 10.1-megapixel high resolution CCD and the f2.8 Leica DC Vario-Elmarit 12x optical zoom (equivalent to 35mm to 420 mm with a 35mm film camera) lens. The lens unit is comprised of fourteen elements in ten groups including three aspherical lenses and an ED lens, All these are incorporated to generate low distortion and high optical performance while preserving the compactness of the unit. The Extended Optical Zoom, made possible by using the center part of the 10.1-megapixel high resolution CCD, further extends the powerful 12x optical zoom to up to 21x for 3-megapixel image recording (17.1x for 5-megapixel and13.4x for 8-megapixel recording). High resolution images with richer gradation are always assured with these Leica DC 12x optical zoom lens and the 10.1-Megapixel CCD.Lumix's Image Stabilizing System EvolvesTaking advantage of its superior lens technology, Panasonic invented the Mega O.I.S.(Optical Image Stabilizer) system to fight against the major cause of blurred images. It compensates for handshake and is now featured on the entire Lumix range, and has been highly evaluated and appreciated by the users across the world. Every slight hand-shake movement is detected accurately with the sampling frequency at 4,000 times per second and will be compensated to render clear, sharp images. In addition, movement of the subject, the other major cause of blurred images, is suppressed by the advanced image processing LSI Venus Engine III with the Intelligent ISO Control (hereafter I.I.C.) and maximum ISO 1600 high sensitivity recording capabilities. The world's first incorporation of this I.I.C. allows the automatic adjustment of the suitable ISO setting and shutter speed that best suits the situation by analyzing the speed of subject movement. If the subject is moving, the ISO setting would automatically rise to allow high shutter speed. On the other hand, if the subject is still and no movement is detected, you can take beautiful natural images with a low ISO setting.Accordingly the new Lumix automatically takes the best countermeasures against any causes of blurred images with Mega O.I.S. compensating for hand-shake and the I.I.C. compensating for movement of the subject. Image stabilizing system is further evolving with Lumix.Dramatically Reduced Noise with Venus Engine IIIThe DMC-FZ50 adopts the Venus Engine III to realize high sensitivity recording at maximum ISO 1600 at full resolution. The noise reduction system is greatly improved by removing noise at the processing stages in series. First, critical noise is roughly undraped and the chromatic noise and the luminance noise are separated to respectively go through the supplemental noise reduction process so that the remaining noise is appropriately minimized. In addition, chromatic aberration is also reduced so beautiful images are assured even in telephoto shooting.Despite the significantly increased performance of the camera, the Venus Engine III consumes only 80% of the power utilized by the Venus Engine II and is able to achieve a longer battery life of approximately 360 pictures (CIPA) on a single charge. With its multi-task image processing capability, the Venus Engine III also boasts outstanding response time with an industry-leading level of shutter release time lag of as short as 0.009 seconds. minimum and the shutter interval of 0.8 seconds. Together with the fast startup time of approximately 0.7 seconds, the quick response of DMC-FZ50 enables easy capture of those spur-of-the-moment shots. The DMC-FZ50 also allows unlimited consecutive shooting up to the capacity of the SD/SDHC memory card.In Pursuit of Full Manual ControlThe DMC-FZ50 succeeds the high operational ease and the good design that have been highly acclaimed with its predecessor DMC-FZ30. Two exclusive rings on the lens barrel provide manual control of zooming and focusing, allowing quick and fine control that cannot be achieved with button or lever operation. This feature will be highly valued by high-end users not only for its precise controllability but also for the feeling of manual operation. With the two dials located under the index finger and the thumb, you can compensate the exposure directly in addition to the shutter speed and the aperture smoothly and naturally. The newly added Function Button serves as a shortcut exclusively for the commonly used settings such as recording image size, light metering, AF area, white balance, and ISO sensitivity, allowing them to be set easily.For further improvement, your frequent setting patterns can be memorized and can be instantly applied by just selecting the newly incorporated custom setting function. White balance now can be finely adjusted with a reference to the horizontal axis for amber to blue and vertical axis for green to magenta. Furthermore two composition guideline patterns can be overlaid on the normal shooting screen.Free-Angle LCD and High-Resolution EVF to Extend Shooting PotentialThe 2.0-inch flip-out 207K high-resolution LCD is adjustable to 180 degrees both vertically and horizontally. This assists smooth shooting even in high- and low-angle shooting positions. The pixel-mixed readout method performed at the CCD achieves high sensitivity to offer sufficient brightness for easy shooting even in low-light situations. The Power LCD function boosts the brightness level by 40% to secure clear view even in sunny outdoors. The DMC-FZ50 is also equipped with a 235K-pixel high resolution EVF to encourage active shooting. EVF can provide the benefit of being able to check white balance, real-time histogram, and the DOF (depth of field) before shooting.Faster AutofocusThe AF mode can be selected according to the shooting situation: 9-point, 3-point high speed, 1-point high speed, 1-point normal speed, and spot. In the 1-point and 1-point high speed AF mode, the AF area is selectable from the nine focusing areas with the joystick to best fit the composition of the subjects. Also, the AF assist lamp facilitates quick, accurate focusing in situations where focusing is difficult due to the lack of light.Clear, Bright, Wide VGA Motion-Image Recording for Viewing on a Wide-Screen TVIn addition to standard VGA (640 x 480) at 30 frames per second (fps) motion image recording, the DMC-FZ50 also records stunning full-size movies in wide-aspect VGA (848 x 480) at 30 fps. Shooting is one thing but viewing is another, and you will be suitably impressed by the 16:9 moving image when it is displayed on a wide screen TV. The brightness level of these motion images is also enhanced as a result of the pixel-mixed readout method performed by the CCD. Zooming in while recording motion images is also possible with the manual zoom ring, while image clarity is secured by the Optical Image Stabilizer.Included Software and Optional AccessoriesTo edit and develop RAW files, the Silkypix Developer Studio 2.0SE software application is bundled with the DMC-FZ50. Using this software, you can freely adjust various setting such as exposure, white balance, and so on afterward with the RAW files.The DMC-FZ50 is compatible with all the same accessories as the FZ30. In addition to those, the DMC-FZ50 is also compatible with the TTL external flash GN50 or GN36 (not included--must be purchased separately). This expandability enhances the potential of shooting to make DMC-FZ50 a true high-end camera.", "title": "Panasonic DMC-FZ50S 10.1MP Digital Camera with 12x Optical Image Stabilized Zoom (Silver)", "price": 399.99, "salesRank": {"Camera &amp; Photo": 21878}, "imUrl": "http://ecx.images-amazon.com/images/I/41Z999RVQ8L._SX300_.jpg", "related": {"also_viewed": ["B00AX12XTC", "B000EMWBV0", "B008MWQ8QS", "B00DY2Y28M", "B00BQU11JW", "B00HGE3C5I", "B008MB6ZX0", "B002IKLJU0", "B000J6E1LY", "B006T7QRN2", "B00ATM1NAU", "B00B2QK2H2", "B008MB71IS", "B007R7DTRK", "B000TM7GD8", "B00BEHRQB4", "B0009GZSSO", "B000Q3043Y", "B005KYLG0E", "B00EFILHB4", "B00ATM1MVU", "B001SER44W", "B009WS2NGK", "B001CCLBSA", "B005F25IL4", "B008MB70TI", "B00061S2OO", "B0056ENTVC", "B001U3ZUWO", "B004A8ZQIO", "B006K551TO", "B0096WDDY8", "B009B0MZ1M", "B009APFONE", "B0077IO5T0", "B00740MR78", "B009APEUHK", "B00CGY4N7Y", "B003WJR69E", "B0035LBRJO", "B005058BTW", "B00KOUIBZW", "B0091TC3OC", "B000I1ZWRW", "B00B5MUJTO", "B00HZDAUOQ", "B00913NPYK", "B00FRHTSMW", "B00CC9QTA2", "B000EBK3FW", "B003WJR694", "B000V1VG5G"], "buy_after_viewing": ["B008MB6YX6", "B005F25IL4", "B0039BPG1A"]}}