{"asin": "B0043WJRRS", "categories": [["Electronics", "Camera & Photo", "Accessories", "Cleaning Equipment", "Cloths"]], "description": "Our highly rated and very popular MagicFiber Microfiber. Extremely effective, yet safe on all your most delicate items. Our ultra fine premium microfiber cloths are designed to meet the highest standards of quality. Available in multiple quantities and colors, always the same great quality! Simply Amazon search \"GOJASTORE\" for more options. Please see our numerous customer reviews in this or our other microfiber listings for additional testimonials. We promise you will not be disappointed! Thank you!- New PremiumMagicFiber Microfiber Cleaning Cloths (29 Black, 1 Grey)- Ultra gentle! Extremely fine microfiber leaves zero scratches, streaks or marks. Safe for all surfaces and lenses.- Absolutely no threads, strings, or coarse edges are ever used on our microfibers. Do not accept inferior substitutes that can scratch your delicate items.- Features special saw tooth pattern edges. Other sellers' cloths have unfinished edges that will fray easily, the weave becoming undone and threads pulling out easily. Our microfibers are made with premium materials and designed to the highest standard of quality.- Ideal for cleaning oil, fingerprints, smudges, and dirt off eyeglasses, laptops, tablets of all brands, smart phones, and&nbsp; any other LCD or touch screen. Also perfectly safe and effective on DSLR lenses, binoculars, telescopes, and other delicate optics.- Especially effective when used dry to quickly and easily remove oil and fingerprints with just a swipe. Can also be used with or without cleaning solutions. Wipe down kids' toys, cribs, stainless steel counters and other areas you want to keep chemical free.- Great value for your money. Reusable and long lasting. Machine washable (no detergent, no machine dry). No more paper towel and tissue waste.- Size: 6 x 7 inches (15cm x 18cm)- Each microfiber is individually and neatly packed in it's own polyurethane plastic bag for long term safekeeping.", "title": "(30 Pack) MagicFiber&reg; Premium Microfiber Cleaning Cloths - For Tablet, Cell Phone, Laptop, LCD TV Screens and Any Other Delicate Surface (29 Black, 1 Grey)", "price": 19.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41PnDbQzARL._SY300_.jpg", "related": {"also_bought": ["B00GPVQVCO", "B0030E4UIQ", "B003O5FCZ6", "B0030HG054", "B00017LSPI", "B0043WEDUO", "B0050B6CYW", "B000W8OZE2", "B005WKGI3Q", "B007XW8WMQ", "B009DKBBJ2", "B00BWFCOYC", "B0051QFSCI", "B00ANZHG7C", "B0047E8DN6", "B00C924HGK", "B00BC6G5LO", "B009FUF6DM", "B000L9OIQ2", "B004WBR8C6", "B0018CPCT8", "B00404ULFQ", "B009P7XGX2", "B0048IW030", "B00BC6GEMO", "B004PHVQN4", "1612386806", "B001D9AYF8", "B00LGWGGRW", "B007G5NNOW", "B0081ER9KG", "B00006JN3G", "B007OXK4C0", "B005UA3I72", "B000NPUJS0", "B0000BZL47", "B0083WYFWG", "B00004OCK0", "B000BP8QB4", "B0018194QG", "B0007M6GI6", "B001B5JT8C", "B001GN1IQU", "B002SGATH8", "B00EJ8CKPC", "B000UD679U", "B0080JH3YE", "B00KOOF5IO", "B004MMEHKG", "B000E7SY16", "B00CSXOETA", "B003ES61EE", "B00J0O5R2I", "B000NA0HP0", "B00006B7V9", "B0007TOR08", "B00B3Y4FAS", "B0076W9Q5A", "B001J4ZOAW", "B00JHKSL1O", "B005FHWWXQ", "B00A7P2JGQ", "B00D1MDY98", "B003S3RFNQ", "B00IJU0K2Q", "B004B8GTQG", "B001IDAXS2", "B00B3OA7R8", "B001E695FK", "B003X242PQ", "B008JJLZ7G", "B004N96WQ0", "B00EHDNAOE", "B00IRHE892", "B00006IF79", "B00IVPU7AO", "B007XGWQ2Y", "B002DQ6EU4", "B006JH8T3S"], "bought_together": ["B0030E4UIQ", "B00GPVQVCO"], "buy_after_viewing": ["B0030E4UIQ", "B00ANZHG7C", "B0043WEDUO", "B00GPVQVCO"]}}