{"asin": "B0009VXAM0", "description": "As DVD playback made the PlayStation 2 more than just a game machine, hefty multi-media features make the Sony PlayStation 3 an even more versatile home entertainment machine. Features such as video chat, Internet access, digital photo viewing, and digital audio and video will likely make it the central component of your media set-up. Still, it is first and foremost a game console--a powerful one at that.Under the HoodThe PS3 features IBM's \"Cell\" processor and a co-developed Nvidia graphics processor that makes the system able to perform two trillion calculations per second. That's approximately 320 times more calculations per second than the PS2. Along with the traditional AV and composite connections, it also boasts an HDMI port, which delivers uncompressed, unconverted digital picture and sound to compatible high-definition TV and projectors. The system is capable of 128-bit pixel precision and 1080p resolution for a full HD experience.PlayStation 3: Tower of powerA sleek new lookWith the wireless, motion-sensitive controllerBlu-Ray is the New WaySony's PlayStation 3 games are encoded onto the Blu-Ray disc media format, which can hold six times as much data as traditional DVDs. This increase in capacity--combined with the awesome power of its processor and graphics card--promises mind-blowing games once developers have learned how to fully harness the new console's power. The PS3 will also support CD-ROM, CD-RW, DVD, DVD-ROM, DVD-R, DVD+R formats.In addition, PlayStation 3 system software update version 2.20 and up includesBD Live support. With this you can now play discs that support Blu-ray Disc Profile 2.0 (BD-LIVE) and you can also connect to the Internet while playing discs that support this format so that you can obtain additional features. Features that are available vary depending on the software in use.Sensational ControllerNew gamers intuitively move the controller while playing, even though that movement has traditionally had no relation to what's going on in the game. Sony has picked up on this tendency and is using it to bring a new level of control into the PS3. Inside the controller is a high-precision six-axis sensing system that accurately detects fine movements in pitch, roll, and yaw, as well as three dimensions of movement, to control games. This means that future PS3 games will be controlled by the movements of your hands rather than just your thumbs. For example, you might be able to steer a car by holding the controller like a steering wheel.While the PS3 controller looks much like its Dual Shock predecessors, it will lack the force-feedback vibration since that would only interfere with the sensing system. It uses Bluetooth 2.0 wireless technology and can support up to seven wireless controllers at a time. It's a hot-swappable system, so if your controller is running low on power, just pause your game and connect a USB 2.0 cable. You can continue playing while your controller recharges automatically.Plays All PlayStation GamesThe PlayStation 3 will be backward compatible with PlayStation and PlayStation 2 games, which means you'll be able to play all your favorite games without keeping all the old systems. The console will have slots for Memory Stick Duo, an SD slot and a Compact Flash memory slot. It comes with a pre-installed hard disc drive, which allows you to save games as well as download content from the Internet.Gran Turismo HDResistance: Fall of ManA Slew of New GamesA whole host of game publishers are already backing the PS3 and several have even confirmed games for the console. At the 2006 Electronic Entertainment Expo (E3), more than 30 titles were displayed for the system, includingGran Turismo HD,Resistance: Fall of Man, andFinal Fantasy XIII. Previously announced titles includeMetal Gear Solid 4,Devil May Cry 4andTekken 6.OnlineSony has stated that the PS3 will have similar online connectivity and services as the next generation of Xbox Live. Calling it \"an always on, always connected device,\" SCEI's chief technical officer Masa Chatani said the PS3 would be constantly in touch with a \"PlayStation World\" network \"fundamentally based on community, communication commerce, and content.\" Technically, the infrastructure is there to make that connection. The PS3 supports 10BASE-T, 100BASE-TX, 1000BASE-T Ethernet, as well as IEEE 802.11 b/g wireless networking protocols.", "price": 300.0, "imUrl": "http://ecx.images-amazon.com/images/I/31T98094E7L._SY300_.jpg", "related": {"also_bought": ["B002ISCORE", "B001DNGCN2", "B000IZWNLG", "B002TK1Q6Q", "B007A7UJ4S", "B002I0F5M8", "B00KVRK39A", "B003O6E3C8", "B000PD0HQE", "B000JKXC6A", "B000R0PLK2", "B005J730WO", "B004HYK956", "B0014WJ78E", "B0015AARJI", "B008SBZD5U", "B0050SXI6K", "B00CTKHXFO", "B002AB7TX8", "B002I0J5FG", "B006JKAS16", "B000CQ75VY", "B001COU9I6", "B000LOAQNQ", "B008CP6MA2", "B00C3MKCF6", "B007XYBUBE", "B000FQ2D5E", "B00A7QA0XE", "B003WY86L6", "B000FQ2DTA", "B00004W4QJ", "B001C6GVI6", "B000066TS5", "B003IDKR4A", "B00FRESMZE", "B00BY0G0YU", "B0014CN2H6", "B0002CHIUQ", "B009JBFF9C", "B00HK74G2E", "B009WI7VAS", "B000034DBS", "B0009A4EVM", "B000BL6BGA", "B000F5IH2I", "B0016C3260", "B00DJL7LR2", "B00006B5T8", "B000YMQGWU", "B00019HNNM", "B00005BW7Q", "B0055202HE", "B00008URUA", "B00B67ZTUW", "B0050SYZCQ", "B004WL4LOY", "B0081S91CQ", "B00009WAUD", "074401543X", "B0000296O5", "B00KVOVBGM", "B00GV4V8YQ", "B008CP6RWU", "B00008KTRS", "B000V761SM", "0744015170", "B00000K2X5", "B00CJ7IUI6", "B000ZK7ZOE", "B00HVBPRUO", "B0065NP05G", "B000PS1TG6", "B003O680RM", "B008PQU3E4", "B00002STPG", "B0007L8GPI", "B00009KO3L", "1616551607", "B000K1GZIU", "B004EI0XZQ", "B00275A7LI", "B005QVY65I", "B00001ZULE", "B000FIVC2W", "B00J6DLPLK", "B00F6YD2FK", "B001C4C4KW", "B000784XG2", "B0000503MO", "B00GOOSTJ0", "B008277M36", "B00020V5B6", "B000ZK9QCS", "B004XACA60"], "buy_after_viewing": ["B001COU9I6", "B003VUO6H4", "B000XGJH1O", "B00IA2NYT4"]}, "salesRank": {"Video Games": 2952}, "categories": [["Video Games", "PlayStation 3"]]}