{"asin": "B004KCI80I", "description": "The ViewSonic VX2253mh-LED features a mercury free LED backlit 22\" (21.5\" Visible) widescreen display with up to 40% energy savings compared to traditional CCFL backlit LCD monitors. The VX2253mh-LED offers Full HD 1920x1080 resolution, 2ms response time, and an impressive 30,000,000:1 Mega Dynamic Contrast Ratio for incredibly crisp images, and crystal clear SRS Premium Sound. Dual HDMI inputs plus VGA make the VX2253mh-LED one of the most versatile monitors available; use it as a computer monitor or connect it to a game console, cable/satellite box, or Blu-Ray&reg; DVD player. With its beautiful glossy black finish, it is truly a sight to see, on and off the screen. You cannot find a more feature-packed monitor available with a 3-year warranty than the VX2253mh-LED.Key Features:22-Inch LED monitor with super-fast response time for gamers, entertainment enthusiasts, movie producers, and graphic designersUp to 40% power savings over a traditional CCFL 22\" monitor1080p Full HD resolution with 16:9 aspect ratio for perfect image reproductionUltra Fast 2ms response time for virtually blur free motion2 HDMI plus VGA provide diverse connectivity optionsIntegrated stereo speakers with SRS Premium Sound&trade;Highest grade panel with best pixel performance policy in the industryBookstand OptionThe VX2253mh-LED features a very innovative industrial design, which allows it to be utilized with either the traditional base or in a bookstand configuration. Simply remove the base and tilt the neck back, to allow the monitor head to be displayed as a picture frame on the desktop. This allows not only the advantage of having the monitor head at desk level, but also brings a new degree of portability to the monitor. In the bookstand configuration the VX2253mh-LED can easily be carried to meetings as a companion display for your notebook computer!What is a LED monitor?The term \"LED monitor\" generally refers to a monitor with a LCD panel and a LED backlight. A typical LCD monitor uses cold cathode fluorescent lamps (CCFL) as a light source to illuminate the LCD panel. In an LED backlit monitor, white LEDs (Light Emitting Diodes) are used as the light source. LED backlight provide the following benefits:About 40% less power consumption compared to traditional CCFL monitor30,000,000:1 MEGA Contrast RatioMercury-free backlightLow EMI (Electro Magnetic Interference)Slimmer designWeight reduction&nbsp;Cold Cathode Flourescent LampLED: Light Emitting Diode&nbsp;Save cash and save the planetWith its mercury free backlight and low energy consumption, the Energy Star 5.0 certified VX2253mh-LED saves your electricity bill. This can add up to thousands of dollars saved for large install bases, such as big corporate buildings or schools, the savings can be as dramatic as $20,000 in five years!MEGA dynamic contrast ratioOne of the great features of VX2253mh-LED is its ability to dim the backlight completely for pure darkness during dark scenes such as a night shot in a movie. Contrast ratios refer to the ratio of the brightest color to the darkest color. With traditional CCFL backlit displays, contrast ratios are limited to the fluorescent lamp&rsquo;s ability to dim in order to reproduce darkness. However, with the LED backlight, each LED has the ability to completely shut off allowing for a near infinite ratio of black to white contrast. The end result is true blacks that result in greater overall image quality.What is response time?Response time in monitors refer to the amount of time a pixel (dot) takes to go from black to white and back to black again. It is measured in milliseconds (ms). The lower the number, the faster the pixels can change, reducing the ghosting or streaking effect you might see in a moving or changing image such as in games and movies. Common response times range anywhere from 14ms to 5ms. Monitors that are designed for faster applications feature response times as fast as 2ms. These monitors are ideal for gamers, video enthusiasts, engineers and movie production houses.&nbsp;Slow (higher) response timeFast (lower) response timeFull HD 1080p ResolutionThe VX2253mh-LED features a 22\" widescreen with 1920x1080 resolution that is capable of displaying a native Full HD 1080p image. Today, devices that can display Full HD content output are getting more and more common. However, without a native Full HD display, you will not be able to experience the picture clarity and the details of the 1080p content you view.The Power of HDMI&reg;HDMI is one of the most powerful and widely available communication standards that connects digital audio/video sources such as set-top boxes, DVD players, personal computers (PCs, laptops), video game consoles such as the PlayStation&reg; 3 and XBOX 360&reg;, and AV receivers to compatible digital audio devices, computer monitors, and digital televisions. With just one cable, HDMI supports any TV or PC video format, including high-definition video and up to 8 channels of digital audio. This powerful technology comes standard in VX2253mh-LED. This way, you can connect your monitor to your desktop or laptop computer and work, surf the web or play games. Or you can connect it to your gaming console and enjoy the large 22&rdquo; screen, 1ms response time and integrated speakers. You can even connect it to a cable box or a satellite receiver and watch TV on your monitor! Although the monitor doesn&rsquo;t have a tuner to receive the TV signals from the air, HDMI + receiver box combination gives you the same TV experience. And another great example of the countless video sources you connect to is a Blu-ray&reg; DVD/CD player.SRS Premium SoundViewSonic partners with industry leading audio expert, SRS Labs, to provide you with a great sound experience. Now is the time to hear the true nature of sound with SRS Premium Sound&trade; technology on your monitor. SRS Premium Sound delivers a superior audio experience for music, video and games: more natural and immersive, with deeper bass, clearer dialog and outstanding surround sound. SRS Premium Sound software is included in the ViewSonic Wizard CD-ROM. It needs to be installed and should be running on your computer in order to deliver the great sound experience.Diverse connectivityThe VX2253mh-LED features three video inputs, Dual HDMI and VGA. You can connect three different sources at the same time and then toggle from one to another by selecting the input source through the On-Screen-Display (OSD). Also, you can connect your audio source to the VX2253mh-LED and listen through the integrated speakers or you can easily hook up your headphones to the monitor for privacy.&nbsp;Eco-mode for up to 35% energy savingsViewSonic&rsquo;s proprietary Eco Mode function comes standard with the VX2253mh-LED. When you don&rsquo;t need all of the powerful features the VX2253mh-LED has to offer, you have the option to reduce the monitor&rsquo;s brightness, save energy, and prolong the lamp life. You can select one of the &ldquo;Optimize&rdquo; or &ldquo;Conserve&rdquo; options and save up to 35% energy. Especially under low ambient light conditions, adjusting the brightness will improve visibility by reducing eye fatigue. Reducing brightness will also prolong the monitor&rsquo;s lamp life, improving your return on investment.The best pixel performance guarantee and 3 year warrantyOne of the aspects that makes ViewSonic a market leader in displays is its commitment to quality. ViewSonic is committed to using the highest grade panels and offer the best pixel performance policy in the market. We also back our displays with a 3-year warranty for your peace of mind.", "title": "Viewsonic VX2253MH-LED 22-Inch Widescreen LED Monitor (Black)", "price": 144.24, "imUrl": "http://ecx.images-amazon.com/images/I/51hhfvQfkcL._SY300_.jpg", "related": {"also_viewed": ["B008RM235I", "B009F1HUMQ", "B00EZSUWFG", "B008RM23ZI", "B003HFCDLY", "B00CLZ047Q", "B0088PU5Z4", "B00413PHDM", "B003Y3BJ7S", "B00D78QCYK", "B005BZNDOO", "B005S0XYKK", "B005BZNEVQ", "B00EZSUVHK", "B009O847CQ", "B005BZNDS0", "B00AGQ4WHA", "B0058UUR6E", "B0098Y77U0", "B007ILDVBO", "B00D601UC8", "B008DWITHI", "B00ANKMNXO", "B008A3KFB8", "B00AX9Z6MU", "B00AV4NXFY", "B00HPR7JAU", "B00CPZJP7C", "B009V8F700", "B009HNEBLK", "B0043T7FHK", "B004J6BIJ8", "B0045JFTXU", "B00BI3BP34", "B005LJWJSG", "B008MA9OWA", "B006DDGIWM", "B00ARJNJ2A", "B00B2HH7G0", "B006HIKIG0", "B005PYD2RE", "B0043T34RK", "B00AZMLIWW", "B009H0XQPU", "B00C18YUZU", "B00EWSVZAA", "B007BZ1092", "B007ILDUOW", "B008RM1YQW", "B00CM0QW2G"], "buy_after_viewing": ["B008RM235I", "B009F1HUMQ", "B005BZNDS0", "B005BZNDOO"]}, "categories": [["Electronics", "Computers & Accessories", "Monitors"]]}