{"asin": "B0002Z240M", "categories": [["Electronics", "Home Audio", "Stereo Components", "Speakers", "Floorstanding Speakers"]], "description": "The Polk Audio Monitor 50 2-way Floorstanding Speaker, Black Finish (single) is a quality-built, high-performance, yet affordable loudspeaker for music and home theater. The Polk Monitor 50 provides open, spacious and clear audio even when driven by modestly-powered amplifiers and receivers, and is voice matched for lifelike surround-sound environments. This monitor boasts a stylish look that complements today's flat screen technology, with a discreet black finish, beefy stabilizer feet that ensure stability on carpet or hard floors, and a slim tower design that has a footprint of less than one square foot.The Polk Monitor 50 utilizes a one-inch fabric and polymer-composite dynamic-balance dome tweeter with a powerful neodymium magnet structure that delivers a clear and detailed high frequency response for realistic reproduction of vocals and instruments, as well as dual 5.25-inch bi-laminate composite dynamic-balance drivers that are lightweight and stiff with good dampening for high efficiency, excellent bass and lower distortion. This unit's non-resonant all-MDF enclosure construction with 0.75-inch-thick baffles, and front-to-back and side-to-side internal bracing ensures cleaner and more lifelike sound quality. The Monitor 50 features crossovers that use Mylar bypass capacitors for more detailed high frequencies, five-way binding-post connectors for more secure hook-up options and bi-wiring and bi-amping flexibility, and magnetic shielding for safe placement on or near TVs and video monitors without causing video distortion. This unit includes a critically-tuned flared port that minimizes port noise for good low-frequency extension with minimal distortion, resulting in natural, full-bodied and rich-bass sound. Built for speed, sound and value, the Polk Monitor 50 is a great introduction to high-performance sound.", "title": "Polk Audio Monitor 50 AM5025-A 2-Way Floorstanding Speaker (Single, Black)", "price": 169.0, "salesRank": {"Electronics": 74202}, "imUrl": "http://ecx.images-amazon.com/images/I/41ECG77RRVL._SY300_.jpg", "related": {"also_viewed": ["B0018QPSBG", "B009WVN85C", "B009WVIVU4", "B0002Z241Q", "B0002Z2416", "B0018QROHC", "B00007BGSP", "B009WW0YIK", "B009WVVE26", "B00631YX62", "B009WSVRL2", "B000EHHOOE", "B0002MPNLC", "B003XRD9U0", "B0002MPMAE", "B0000SYA8A", "B0009YWCT4", "B000OG4E2U", "B0018QROM2", "B0046A8R3M", "B000OG4E1G", "B001VIXH7I", "B000NW11WQ", "B006RK370M", "B003XRD9TQ", "B004H1M4NO", "B009WVKAXA", "B002JCSG12", "B000V2OQL6", "B008NCD2S4", "B00011KLOI", "B00CHHCBWY", "B00EKJQLSC", "B00CHHCAQQ", "B0000W4U2C", "B000V2OQK2", "B00ALYI3JU", "B00192KF12", "B000V2QVDW", "B000V2QVEQ", "B002ISZEV2", "B003XRD9TG", "B00012F7CI", "B00413OWNI", "B000TD8XG6", "B00011CRZE", "B000V2N310", "B000V2SEX2", "B009WSIGUW", "B000V2N31U", "B003GGXGU6", "B00414ULNM", "B007IWKX14", "B000V2UBS8", "B0002KVQBA", "B0000E6S12"], "buy_after_viewing": ["B0018QROM2", "B0002KVQBA", "B0029HHIDY", "B0018QPSBG"]}}