{"asin": "B0001DQ5YG", "description": "JBL's Creature II three-piece speaker system produces high-quality stereo sound for movies, MP3's and gaming experiences.Featuring a cutting-edge sci-fi design and superior sound performance, JBL Creature II is a unique \"plug-and-play\" solution, compatible with all Mac and PC desktops and portables as well as MP3 players and Walkman units. JBL Creature II offers consumers cool design and exceptional sound, proving that excellence does not have to come in an expensive package.The JBL Creature II speaker system includes a touch volume control.The Creature II audio system utilizes a straightforward interconnect technology.The powerful subwoofer provides clean, low bass.The mini stereo jack connection allows you to enjoy high-quality audio from a variety of devices including digital music players, computers, stereos and portable listening devices.JBL Multimedia speaker systems produce high-quality stereo music and audio experiences for movies, MP3's and gaming, whether you're at work or at play...JBL Multimedia encourages consumers to go beyond the ordinary by offering sound in original and unique packages. These speaker systems, which have been described as futuristic, curvy, sleek and out of this world, provide consumers with sound that is loud and clear.JBL Multimedia speaker systems employ computer-optimized multiband parametric equalization, custom-designed transducers, and unique \"capacitance touch\" control buttons for direct access to volume control.", "title": "JBL Creature II 3-Piece Powered Speaker System", "price": 85.82, "imUrl": "http://ecx.images-amazon.com/images/I/31ZSKRXVGSL._SY300_.jpg", "related": {"also_viewed": ["B002TLSTGA", "B000M39268", "B0062S88OY", "B00F8HRTCC", "B0007XU370", "B008G4SGIK", "B000IS5RG6", "B0001DBEM4", "B00F8HRSN2", "B0042F3K9W", "B00F8HRU2G", "B001IWOBA4", "B00IJ356CM", "B008X1BVH4", "B0025VKUQQ", "B0056BPUQC", "B0092PDT20", "B009XGH2HG", "B00AFQZ4AU", "B00FW3KZNM", "B00K5NYNWS", "B00711MUTA", "B0025VKUR0", "B001IZYV3S", "B000HZDF8W", "B00H3OBPB4", "B0038W0NEU", "B00GXW0LFI", "B004N31D9W", "B001OI2VAY", "B0027VT6V4", "B001OI2VB8", "B008YFD5G4", "B000062VUO", "B000OZCFF4", "B003FWHTTA", "B00DJAP11G", "B007119FCU", "B00DLVUE3I", "B001RNOHDU", "B00EZ9XKDG", "B00646KQOY", "B002HWRZ2K", "B001S10DDO", "B00005BC0J", "B000068P8R", "B005TLTOLG", "B00CN3R8J8", "B00006B9W1", "B003VAHYTG"], "buy_after_viewing": ["B002TLSTGA", "B0027VT6V4", "B008I647MA", "B0042F3K9W"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]]}