{"asin": "B00007GQLU", "related": {"also_bought": ["B0045JAJR6", "B00009R6UI", "B008B7VKLW", "B00004ZCJI", "B0000BZL68", "B00009R6WU", "B002K3X2WS", "B00DMS0GTC", "B00009XVCZ", "B001CCAISE", "B009B0MZ8U", "B002ZIMEMW", "B00823ISBU", "B00007E7JU", "B001KELVS0", "B00894YP00", "B009B0MZG2", "B007FH1KX2", "B00A2BVBTG", "B00I4DXDFE", "B000053HC5", "B000CLNHXY", "B0049XGNKK", "B00AA48GSE", "B007NDL56A", "B007FGYZFI", "B002NEGTTW", "B002WE4H8I", "B002VPE1WK", "B00603RW84", "B00BXA7N6A", "B009EM694G", "B000NP46K2", "B00019AA5K", "B0080JH3YE", "B00BCEJ0E0", "B00GBHF6U0", "B00EHSLYTM", "B000I1X3W8", "B00EE1ZH6I", "B003Y30334", "B003GR6IUK", "B004NROQCE", "B0083WYARG", "B004OVE17Y", "B007B8Y1KO", "B00FP1BQ1Q", "B003PYJA7W", "B00007LA0T", "B00004ZCJM", "B0040JHVCC", "B00AVBDGHM", "B00DMS0LCO", "B00009R6K7", "B004RE3CFU", "B00EU5WBKS", "B00004ZCJG", "B003RLJVYK", "B0045DMA42", "B006Y0YZZ6", "B0000BZLBQ", "B00009R6WY", "B001KNP3MQ", "B004JMZPK0", "B000AZ57M6", "B003USVBTS", "B00GUQJZCW", "B00C1VEQFG", "B002K3Z3E8", "B00AUIBV4G", "B003VSGQPG", "B00ENSKUUK", "B005DL6LKE", "B002C6QC3E", "B0024NKGZK", "B002K42W4Q", "B000EQ5HSK", "B00KF30E6M", "B00007GQLT", "B0090BSSZO", "B001KBZ3P0", "B005BDAR5E", "B003TYDBYQ", "B00E3K94T6", "B0000A1G05", "B00004XOM3", "B00CV9MP1K", "B00004WCID", "B001G5ZTLS", "B004XY65WQ", "B007FH1FZ0", "B0037NX6JY", "B00009R9A1", "B002K42W46", "B005DEHVC8", "B00005K47X", "B0000BZL5A", "B005AYT6R4", "B003PEUA30", "B00009XVA3"], "bought_together": ["B0045JAJR6", "B00004ZCJI"], "buy_after_viewing": ["B00007E7JU", "B0045JAJR6", "B00009XVCZ", "B0000BZL68"]}, "title": "Canon EF 85mm f/1.8 USM Medium Telephoto Lens for Canon SLR Cameras", "price": 419.0, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41XQYPKEBEL._SX300_.jpg", "brand": "Canon", "categories": [["Electronics", "Camera & Photo", "Lenses", "Camera Lenses", "Digital Camera Lenses"]], "description": "A highly practical medium telephoto lens with superb delineation and portability, the Canon EF 85mm lens produces sharp and clear images at all apertures. Through computer simulations, the lens has been designed to give beautiful background blur, thereby bringing your subject into crisp view. The ring-type ultra-sonic monitor (USM) and fast f/1.8 aperture, meanwhile, helps the subject zip into focus in the viewfinder. And because the front lens group does not rotate during focusing, special filter effects are not affected. Best of all, the standard zoom lens--with its natural angle of view and perspective--captures the subject plainly, making it excellent for portraits and images that require a natural depth of field. As with all Canon lenses, the lens carries a one-year warranty.Focal length: 85mmMaximum aperture: 1:1.8Lens construction: 9 elements in 7 groupsDiagonal angle of view: 28 degrees (at 30 feet)Focus adjustment: Rear focusing system with USMClosest focusing distance: 2.8 feetFilter size: 58mmDimensions: 3 inches in diameter, 2.8 inches longWeight: 15 ouncesA highly practical medium telephoto lens with superb delineation and portability. Images are sharp and clear at all apertures. Through computer simulations, the lens has been designed to give beautiful background blur. Since the front lens group does not rotate during focusing special filter effects are not affected.Sharp. Lightweight. Responsive. These are just a few adjectives that describe this terrific portrait-length telephoto lens. With a powerful ring-type USM and fast f/1.8 aperture, subjects zip into focus in the viewfinder. It's great for all types of work calling for moderate telephoto power, but comes into its own in low-light situations, and offers a 1/3-stop speed advantage over the 100mm f/2 USM lens.A medium telephoto lens with a large aperture brings the subject closer, creates excellent background blur, gives a longer flash range, and affords a faster shutter speed to freeze the action. A standard zoom lens, with its natural angle of view and perspective, captures the subject plainly, with no special effects. However, you can use standard lenses in creative ways by varying the subject distance, aperture, and angle."}