{"asin": "B0038KR8WM", "description": "Start watching your favorite high-definition movies almost instantly with the Panasonic DMP-BD85 Blu-ray Disc player, which features an ultra-fast 2-second boot time. You'll also enjoy BD-Live and Panasonic's VIERA Cast functionality for accessing Internet video content thanks to the included Wi-Fi connectivity (via included Wireless LAN adapter) as well as wired Ethernet networking.It also includes both a USB port and a Secure Digital (SD) memory card slot, making it easy for you to view and share both digital still images and HD video recorded with an HD camcorder in the AVCHD format (DivX movie format also supported). Other features include compatibility with a wide variety of disc formats (including standard DVD movie discs), HDMI Jitter Purifier, 7.1-channel audio decode analog output, Energy Star certification, and Panasonic's VIERA Link function--allowing you to operate multiple audio/video components using a single remote via HDMI.Additionally, Panasonic's lineup of 2010 BD Players are designed to reduce power consumption and also feature a slimmer, more efficient design to reduce packaging waste.Key FeaturesHigh-quality image processingvia PHL Reference Chroma Processor Plus technology for clear and vibrant color reproduction that is faithful to the original film (learn more).High-definition audio decoder(Dolby Digital Plus, Dolby TrueHD, DTS-HD Master Audio Essential) takes advantage of the 7.1 channel surround sound now incorporated in Blu-ray Discs.HDMI Jitter Purifierprovides clear, robust bass sounds faithful to the originalDigital Tube Sound Simulatorproduces the warm, realistic sounds associated with a tube amplifier.7.1 channel analog audio outputto produce a true 7.1 surround sound experience that rivals the movie theater.VIERA Linkutilizes HDMI to enable control all VIERA Link combatable products with one remote.SD memory card slotenables you to play your photos and movies taken with digital cameras and camcorders by just sliding in an SD memory card into the SD slot.What's in the BoxBD Player, remote control (with batteries), Wireless LAN adapter, power cord, operating instructionsVIERA Cast Online ContentPanasonic's VIERA Cast service allows you to stream movies, TV shows and music from a variety of sources without the need of either an external box or a PC. Powered up with Netflix and Amazon Instant Video, you can also access YouTube, Picasa, Bloomberg, and other Internet sites from the special VIERA Cast screen. And as additional sites are added to the 2010 VIERA Cast service, they are added automatically. You'll need to be connected to your home network via Ethernet or Wi-Fi (using the included Wireless LAN adapter).SpecificationsWireless LAN system:Wi-Fi enabled with included adapter3:2/2:2 Pull-down progressive processing:YesUp-conversion to 1080p playback:YesVideo D/A converter:148.5MHz/12bitDigital noise reduction:3D-NR/ Integrated NRDeep Color:Yesx.v.Color:YesPicture mode:Yes (Normal/Soft/Fine/Cinema/User)Picture adjustment:Contrast, Brightness, Sharpness, Color, Gamma CorrectionDolby Digital Plus/ Dolby TrueHD:Decode and Bitstream outputAudio D/A converter:192kHz/24bitDialog enhancer:YesAudio/JPEG navigation menu:YesPlayback information window:YesDimensions:16.95 x 2.2 x 9.8 inchesWarranty:1 year parts and laborInput/OutputHDMI outputComponent video output (Y, PB, PR)SD memory card slotUSB portEthernetAnalog audio output (7.1-channel)Optical digital audio outputCoaxial digital audio outputDisc/Media CompatibilityBD-ROM:BD-Live, BONUSVIEWBD-RE / BD-RE DL:Version3; JPEGBD-R/ BD-R DL:Version2; DivX/DivX HDDVD-ROM:DVD Video discDVD-RAM:DVD-VR; JPEG; AVCHDDVD-R/-R DL/-RW:DVD Video; DVD-VR; AVCHD; JPEG; MP3; DivX/DivX HDDVD+R/+R DL/+RW:DVD Video; AVCHDCD:CD audio discCD-R/-RW:CD audio; MP3; JPEG; DivX/DivX HDSD memory card:AVCHD; MPEG2; JPEGUSB:MP3; JPEG; DivX/DivX HDLearn MoreCOMMENT: ==========================================Experience Movies Like Never BeforeThe DMP-BD85 employs the PHL Reference Chroma Processor Plus. Developed in collaboration with Panasonic Hollywood Laboratory, this high image processing technology reproduces clear, vivid colors that are faithful to the original film.Panasonic's Blu-ray Disc players employ high precision 4:4:4 signal technology, which working in tandem with PHL Reference Chroma Processor Plus processes each pixel of the Blu-ray Disc video signal in the horizontal direction to compliment vertical direction processing. P4HD (Pixel Precision Progressive Processing for HD) is another technology that contributes to the superior picture quality of the Blu-ray players. P4HD processes more than 15 billion pixels per second and applies the optimal processing to every pixel.Panasonic's Blu-ray Disc players further utilize 16-level motion detection to categorize the image motion of each pixel into one of 16 levels; diagonal processing to detect diagonals and correct the pixels accordingly; 1080p up-conversion to up-convert content recorded in the 480i/p or 720p format to 1080p.This Blu-ray Disc player also provides 1080/24p output, reproducing cinema images from a Blu-ray Disc and DVD in their original 24p form with no need for conversion--enabling you to enjoy cinema images in the same format used in cinema with a 1080/24p-compatible TV.Complimenting the HD audio codecs, the BD85 Blu-ray Disc player features 96kHz surround re-master, a function that enhances the sound quality of CDs and other sources, and even improves the quality of the multi-channel audio data on Blu-ray Discs and DVDs.", "title": "Panasonic DMP-BD85K WiFi Enabled Blu-Ray Disc Player (Black)", "price": 142.0, "imUrl": "http://ecx.images-amazon.com/images/I/31V%2BH0N6YSL._SY300_.jpg", "related": {"also_viewed": ["B0038KN114", "B001V9LA44", "B00752R4QO", "B006H8WFU2", "B004G8HXXO", "B0038KLM9W", "B004LNFJCQ", "B00AYB3OMG", "B00752R5Z4", "B00752R4PK", "B00B9JR5H2", "B004OF9XMI", "B00AYB3OOY", "B004M8SBFW", "B0036WS4CA", "B00752R4Y6", "B0082NJ5BC", "B004XYJKHI", "B005NEZDUA", "B00752R4S2", "B00F6B3ULE", "B00AWX6EYQ", "B006U1YVZ8", "B0091VAHIO", "B004XYJKHS", "B001GAOYCS", "B00JMNUGSM", "B00HPMCPJK", "B00BFDHVAS", "B00BFRKYVM", "B00HPMCO4Q", "B001VYZVBC", "B007WF1IMK", "B005DII6DC", "B0089KJPM2", "B00HPMCO6O", "B00B9JR5EU", "B00EUY59Z8", "B006U1YUZE"], "buy_after_viewing": ["B00AWKC0JM", "B003L1ZYYM", "B00AWKC0EC", "B00AYB3OMG"]}, "categories": [["Electronics", "Television & Video", "Blu-ray Players & Recorders", "Blu-ray Players"]]}