{"asin": "B00DJNCS6O", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]], "description": "One of our Newest Bluetooth Products! The Power of 2, is better than 1! The AYL BSPK202 comes with a pair speaker system to enhance the power of the bass and sound quality, making it a smart choice for your portable wireless entertainment.The AYLBSPK202 can be connected to listen music with Bluetooth wireless or 3.5mm headphone connector. Its powerful built-in amplifier produces exceptional sound while its high capacity battery facilitates up to 8 hours continuous playback on a single fully charge.Enjoy and share your music, movie and games, presentation, anytime and everywhere.Compatible with all audio player and multimedia devices with a Universal 3.5mm Audio Jack, connects to your multimedia device through the standard 3.5mm Audio SocketThe portable Bluetooth wireless mini speaker can be put into a purse, computer bag, or backpack for easy carry around and travel.Connect to your iPad, iPhone, iPod touch, MP3/MP4/MP5 Player, Mobile Phone, Games Console, Netbook, Desktop, Laptop, Android and other portable devices for a truly remarkable experience indoors and outdoors!Package Includes:1 AYL BSPK202 Bluetooth Speaker1 USB Cable with two 3.5mm Audio Jack1 Universal charging USB Cable1 User Guide1 Soft Black Travel Pouch3 Year Worry Free Warranty!", "title": "Winter Clearance!! AYL BSPK202 Portable Bluetooth Wireless Speaker System with Built in Speakerphone for iPhone/ PC / Cell Phone / Tablet / Car / MP3 Player + 8 hour Rechargeable Battery and Enhanced Bass Resonator", "price": 49.0, "salesRank": {"Cell Phones & Accessories": 136155}, "imUrl": "http://ecx.images-amazon.com/images/I/41e9kfNCbPL._SX300_.jpg", "related": {"also_bought": ["B00BEZEZ1A", "B00ADXW7LO", "B007OYAVLI", "B005Z5HT2M", "B00182CIB8"], "bought_together": ["B00BEZEZ1A"], "buy_after_viewing": ["B00BEZEZ1A", "B007OYAVLI", "B0083UU1OO", "B004HHICKC"]}}