{"asin": "B002NEFXQW", "description": "Navigate in style with the new, ultra-thin Magellan RoadMate 1424 GPS device with a large 4.3-inch color touch screen. Additional premium features include: OneTouch favorites menu, built-in AAA TourBook and Member Roadside Assistance, maps of the United States, Canada and Puerto Rico. QuickSpell with SmartCity search, highway exit POI, spoken street names, and more!With convenient features the Magellan RoadMate 1424 GPS navigator delivers a powerful navigation experience for everyday drivers.FEATURESExclusive OneTouch Favorites MenuEasily bookmark favorite destinations and searches with personalized bookmarks so you can find them anywhere you travel. Find your favorite cafe or restaurant in any city with a single touch. Simple navigation with \"Your favorites at your fingertips.\"Exclusive AAA TourBook GuideNo membership required... Invaluable to anyone who travels, the AAA TourBook guide information with all 50 states and Canada is built right into your Magellan product. Get ratings and descriptions on AAA approved places to stay, play, dine, and save.4.3-inch Touch ScreenThe large, ultra-slim 4.3-inch color touch screen shows your position on the unit including map route, destination, ETA, Points of Interest (POI), OneTouch favorites, street names, and more--all at a glance.Click to view full-size image.6 Million Points of Interest (POI)Easily find whatever service you need. Gas stations, restaurants, hotels, ATMs, and hundreds of other businesses are intuitively categorized and searchable from the built-in POI database.Highway Exit POI SearchSearch for gas stations, restaurants, hotels, and more near upcoming highway exits.QuickSpell with SmartCity SearchEnter destinations with only a few touches. QuickSpell with SmartCity search helps you quickly enter addresses and narrow location searches, making destination entry easy.Multi-destination RoutingPlan a trip with multiple stops in the order you want or have the device optimize it for the most efficient route. Easily reorganize, add, or remove destinations.Spoken Street NamesHear street names and directions for a clear understanding of when to make the next turn while you keep your eyes on the road.&nbsp;What's in the BoxMagellan RoadMate 1424 GPS receiver; pre-loaded maps of United States, Canada, and Puerto Rico; windshield mount; adhesive disc for dash mounting; vehicle power adapter; user handbook.", "title": "Magellan RoadMate 1424 4.3-Inch Widescreen Portable GPS Navigator", "price": 89.99, "imUrl": "http://ecx.images-amazon.com/images/I/51CkXhHn8uL._SX300_.jpg", "related": {"also_viewed": ["B003ZHVBQM", "B0052D38UE", "B0054J8BWQ", "B00BIZ0EY8", "B0015F1L7A", "B00CH3FRG0", "B0015EWMX8", "B007TSERYG", "B001VEIYAC", "B003CYKYUC", "B002LITI70", "B0021L9C0A", "B005HH35EY", "B0057ODOCA", "B00AXZY42W", "B001ELJ9QK", "B003ZUXVQM", "B0057ODG6Y", "B0011ULQNI", "B000OH63MI", "B003CYKYVG", "B0082XN57W", "B00C9W1LT6", "B000PCBVA6", "B000H866BM", "B00HK6CPVY", "B00AY7NUW4", "B005FPT5MY", "B002RL8H1Y", "B005DIBH6A", "B0066IUPS2", "B002771V48", "B0057OCDQS", "B003CYKYU2", "B007W7V5P8", "B006E5WSNW", "B007M52QR6", "B0007LJHVA", "B003FSTAGY", "B001LK6XHM", "B001U0O7T4", "B007PPYXOC", "B003CYKYUW", "B00AY7NSTY", "B00AJXMWP4"], "buy_after_viewing": ["B003ZHVBQM", "B0054J8BWQ", "B0052D38UE", "B0057ODG6Y"]}, "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]]}