{"asin": "B00F54Y6GU", "categories": [["Electronics", "Computers & Accessories", "Laptop & Netbook Computer Accessories", "Batteries"]], "description": "These Bluetooth wireless headphones combine comfort, quality and convenience with a sound quality that demands to be heard. With 6mm driver units, lows are clear and rich whilst highs and trebles stay well defined and sharp. Thick, 12mm ear piece cushions and a padded headband cradle your ears in comfort and make these headphones a pleasure to wear.Connection via its Bluetooth version 4 chip is swift and simple, you'll have them connected to your smartphone or tablet in seconds and no wires means no more tangles.The earpiece remote control allows you to skip back and forth through your track list, answer calls and hang up, and as a microphone is included, you'll be able to sit back and relax knowing that any incoming calls can be answered without having to find your phone. The mic can also be used with VOiP services like Skype and AOL giving you a handsfree headset for internet calling or PC gaming.USB audio in is also enabled, this means that they can be used on desktops with front facing USB ports without having to go round the back to find the audio out socket.The internal battery provides over 10 hours of playback between charges, and a 3.5mm line in socket allows you to continue listening all day without having to find a charger, you can also use it to connect to MP3 players of computers that don't have a Bluetooth connection.Specifications- Bluetooth Specification: Bluetooth V4.0- Operating Range: Up to 30ft- Frequency Response: 60Hz - 20KHz- Speaker Output: 30mW- SNR: &#x2265;85dB- Distortion: &#x2264;1.0%- Battery: 3.7V/220mAh Built-in Li-ion Battery- Working Time: 10 Hours- Charging Time: 2 Hours- Standby Time:\t30 Days- Weight: 8.2oz- Dimensions: 176.6 x 188.6 x 71mm", "title": "August EP650 Bluetooth Wireless Stereo Headphones - Comfortable Leather Cushioned Headset with built-in Microphone, 3.5mm Audio In Socket and Rechargeable Battery - Compatible with Cell Phones, iPhone, iPad, Laptops, Tablets, Smartphones etc. (White)", "price": 44.95, "salesRank": {"Electronics": 1149}, "imUrl": "http://ecx.images-amazon.com/images/I/4177%2BeM-iAL._SY300_.jpg", "related": {"also_bought": ["B007Q45EF4", "B00HTPHK5W", "B009YONZEG", "B00F25Z0FS", "B00DDH4TYA", "B0083J7E9A", "B00DQUNODQ", "B009ZIILLI", "B00GBU0VPC", "B00FBJ55DC", "B00FRZSBQI", "B00AVLOHJ8", "B00APFQ5VS", "B001EBE1LI", "B008ZVQHD0", "B005MMW55O", "B004B8GF7Y", "B00EL0EIGC", "B00EDPW0LA", "B00AWIPITS", "B00DJ83070", "B00CBNG10C", "B008AGQMQC"], "bought_together": ["B007Q45EF4"], "buy_after_viewing": ["B00HTPHK5W", "B00I4C5QQE", "B007Q45EF4", "B00IBCRZ3Y"]}}