{"asin": "B000095ZH6", "description": "Midway captures the disturbing and terrifying nature of the horror genre withThe Suffering, a compelling third-person action/adventure game set in the mature and gritty world of a maximum-security prison.\"The Sufferingredefines terror with a chilling look into a penitentiary invaded by executed prisoners grotesquely reincarnated as the methods of execution that befell them,\" said Helene Sheeler, vice president of marketing, Midway.Unleashing the horror throughout nine levels,The Sufferingfeatures dynamic lighting that illuminates frightening visions of horror-filled exploration and frantic combat sequences. In the dark world ofThe Suffering, creatures attack from the shadows and emerge from jail cells, chambers, the ground and trees, surprising the player in the most disturbing ways possible. As Torque, the main character, players encounter a cast of uniquely hardened criminals, prison guards and grotesque apparitions.Jailed for a murder he may or may not have committed, Torque is next in line for execution when apparitions besiege the prison and inadvertently free him. Utilizing more than ten deadly weapons, Torque sets out to uncover his past and unlock the deadly secrets ofThe Suffering. In the game, players can transform Torque into his monstrous alter ego and unleash the power of his primal fury while battling 12 horrific creatures. Depending on how they play the game, players will arrive at three distinct endings for a unique gaming experience.Stan Winston, renowned creature designer, enhancedThe Suffering's horror-filled experience by creating the disturbing character artwork featured in the game. For more than 30 years Stan Winston has created characters, creatures and monsters for motion pictures and television. The four-time Academy Award winner is responsible for creating many of the most enduring creatures of the big screen, including the dinosaurs ofJurassic Park, the extraterrestrial monstrosities ofAliensand the fanciful character ofEdward Scissorhands. He was nominated for an Academy Award forA.I.and worked on the blockbuster hitT3starring Arnold Schwarzenegger.Key Features:Nine Terrifying Levels &#150;Traverse indoor and outdoor terrain with horror lurking in every dark cornerFrightening Character Morphs &#150; Fill the rage meter and transform Torque into a hideous and powerful creatureDeadly Weapons &#150; More than 10 deadly weapons from the shiv to the tommy gun to aid in the survival of this freakish nightmareHorrific Monsters &#150; A dozen monsters, each representing the methods of execution that befell themGory Detail &#150; Blood and gore, dripping, pooling and splattering at every level of the fright-filled journeyDisturbing Choices &#150; Interact with different hardened criminals and determine their fateUnique Endings &#150; The game ends differently depending on how it is playedTaboo Environments &#150; Explore the deepest recesses of the most wicked prison environment", "price": 16.99, "imUrl": "http://ecx.images-amazon.com/images/I/51W872GX54L._SY300_.jpg", "related": {"also_bought": ["B0009R1TGS", "B0000A8VBZ", "B000NIJ35W", "B000B69E9G", "B00069FK00", "B0011BE3KA", "B00005ME6O", "B0007PLKZM", "B0001Y7404", "B00008XKZZ", "B0001NBNGG", "B000066RKC", "B00019AZB4", "B00097CYZS", "B0009VQANG", "B0009351R0", "B00007LV7Y", "B000FW4YOQ", "B00005J536", "B00005OLX1", "B00005BW7M", "B00005ME6N", "B00020BV2E", "B000XPJ026", "B00020LZAW", "B00005V9NH", "B000A3ON8C", "B0001AVZ5I", "B00004YRQA", "B001UIG6M2", "B000069BD9", "B0009R1T9K", "B0002XL3BA", "B00005NCCR", "B0007L8GPI", "B000TLU67W", "B00009KO3N", "B0000859TO", "B0000TSRA6", "B0009Z3K9O", "B00005ML0X", "B0000A92KX", "B0009SQF0C", "B00008DWT6", "B0000AI1KK", "B00001XDUB", "B000088KH9", "B0000A09EM", "B0009O7HVM", "B000TYQL1O", "B00019HNNM", "B00023B1SU", "B00004U5VK", "B00004YRQ9", "B001CLG6SG", "B00002STJN", "B000KCX9M4", "B00005B70K", "B0002CHJ64", "B00005Q8M4", "B00000I1BY", "B0009Z3HYW", "B0007OGDIC", "B0001ADAME", "B0050SXAIG", "B000038ABO", "B00005NUIZ", "B00008G7DU", "B000034DMG", "B0009O7HVW", "B000099T2G", "B0002ZHDCG", "B0002FQVAQ", "B0001Q5SG4", "B00005UNWB", "9629971372", "B00009YEK1", "B000088KH1", "B00006LEMX", "B001MW91IW", "B002CZ7FW2", "B000G6SPHI", "B0000B0MNH", "B000FIVC2W", "B0009I6S0O", "B0006ZJP8M", "B00005TNI6", "B00002STPL", "B000277J00", "B000CQ75VY", "B00005BIG7", "B00011V8EA", "B00009ZVHY", "B00011V7ZK", "B0009I6S0Y", "B00020BV24", "B0009EHQVI", "B0045L3SNQ", "B000G77X34"], "buy_after_viewing": ["B0000A8VBZ", "B0009R1TGS", "B000NIJ35W", "B001MW91IW"]}, "salesRank": {"Video Games": 9839}, "categories": [["Video Games", "More Systems", "PlayStation 2", "Games"]]}