{"asin": "B0057ODG6Y", "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS", "Trucking GPS"]], "description": "n&uuml;vi 40LM delivers you safely wherever life takes you. Designed to makenavigation   easy, simply enter an address and premium features including lane   assist with junction view, help you make all the right turns!Start   out for your destination and leave the navigating to n&uuml;vi 40LM.  This   device features a 4.3&rdquo; (10.92 cm) touchscreen and provides  accurate,   turn-by-turn directions that speak street names. It also  includes FREE   lifetime map updates.Get Turn-by-Turn Directionsn&uuml;vi 40LM's intuitive interface greets you with two simple choices:    \"Where To?\" and \"View Map.\" Touch the screen to easily look up  addresses   and services and to be guided to your destination with  voice-prompted,   turn-by-turn directions that speak street names. It  comes preloaded  with maps for the lower 49 States.  n&uuml;vi 40LM&rsquo;s  speed limit indicator shows  you how fast you can go on most  major  roads. With its \"Where Am I?\"  emergency locator, you always know  your  location. It also comes  preloaded with more than 8 million points  of  interest (POIs) and offers  the ability to add your own.Enjoy FREE Lifetime Map UpdatesWith FREE lifetime map&sup1; updates, you always have the most up-to-date    maps, POIs and navigation information available at your fingertips.  Map   updates are available for download up to 4 times a year with no    subscription or update fees and no expiration dates.Know the Lane Before It&rsquo;s Too LateNow there&rsquo;s no more guessing which lane you need to be in to make an upcoming turn. Available in select metropolitan areas, lane assist   with  junction view guides you to the correct lane for an approaching   turn or  exit, making unfamiliar intersections and exits easy to   navigate. It  realistically displays road signs and junctions on your   route along with  arrows that indicate the proper lane for navigation.What's in the Boxn&uuml;vi 40LMCity Navigator&reg; NT data with preloaded street maps for the U.S.Lifetime maps&sup1; (indicated by \"LM\" after model number on the box)Vehicle suction cup mount&sup2;Vehicle power cableUSB cableQuick start manualCompare all Garmin n&uuml;visClick the button below to compare by series, user type, and features.All n&uuml;vis come with detailed NAVTEQ maps containing more than 6 million pre-loaded point of interest locations.&sup1; FREE lifetime map updates entitle you to receive up to 4 map   data  updates per year, when and as such updates are made available on   the  Garmin website, for this specific Garmin product only until this    product&rsquo;s useful life expires or Garmin no longer receives map data from    its third party supplier, whichever is shorter. The updates you   receive  will be updates to the same geographic map data originally   included  with your Garmin product when originally purchased. Garmin may   terminate  your lifetime map updates at any time if you violate any of   the terms  of the End User License Agreement accompanying your n&uuml;vi   product.", "title": "Garmin n&uuml;vi 40LM 4.3-Inch Portable GPS Navigator with Lifetime Maps (US)", "price": 81.49, "imUrl": "http://ecx.images-amazon.com/images/I/512nvv9FmeL._SY300_.jpg", "brand": "Garmin", "related": {"also_bought": ["B00BB2NLHA", "B003VL2L6G", "B003DSCU72", "B005DIBIRS", "B00DSRK2DW", "B002OL2MU4", "B00INXAUKQ", "B001M09MUG", "B003FMUP0K", "B00IO299MQ", "B00BB2NLVQ", "B002VPE21A", "B009ABO2N6", "B00865M9QO", "B00HQ9EHES", "B0015A6YN6", "B002IUG14O", "B00269VU0W", "B001EPX7N2", "B00J8YOPPA", "B002VKVK0G", "B00ABBB7RS", "B001QKZ3OQ", "B007RC71DS", "B000LRMS66", "B00721CLN4", "B00999CN30", "B00I9Z7LR8", "B00ELOGAA0", "B001S2RCWI", "B000BS2V44", "B0051FWA7U", "B004I5BUSO", "B00CRQUKQ4", "B00GYDYV0C", "B002X8I27U", "B0057OCDQS", "B009AOCNXY", "B001CZCYBU", "B00BXQ0370", "B000BS6RF8", "B0057OCS9A", "B000L3APBK", "B00INXADDK", "B00C2UBMTO", "B006SU0SX0", "B005DIZWZM", "B000F7857S", "B000U0S304", "B002M3SHXA", "B006QGD996", "B0084PK8CS", "B009RGOGT4", "B00K04C216", "B005DIBHA6", "B002USIV10", "B00AXZWG8Q", "B00EFFVZP0", "B005DIBHCE", "B007PSPQ7W", "B006ZISVSO", "B00BUL4NLU", "B008EH6RJY", "B003VTZE1W", "B0041CDPQO", "B002KO9JB0", "B00488G6P8"], "bought_together": ["B00BB2NLHA"], "buy_after_viewing": ["B0057OCDQS", "B00AXZY42W", "B00AXZWG8Q", "B005DIBHCE"]}}