{"asin": "B003DNS88M", "description": "Compatible with more than 300,000 devices, the Philips Prestigo Universal remote control (SRU6006) lets you replace all the remote controls you have lying around your house with a single, universal remote. The Prestigo offers one-touch control of up to six devices at once. Want to watch a movie? Press one button and your TV, DVD player, and home theater system turn on automatically. Included Philips Configo software and a USB cable let you customize the remote and receive automatic updates for compatibility with the latest devices.Prestigo Universalremote control (SRU6006)At a glance:Easy computer set-up using included USB cable; compatible with Macs and PCsCompatible with 300,000+ devicesActivity buttons let you control multiple devices simultaneously1.5-inch LCD screen for easy navigationIncluded Configo software for automatic updatesActivity-specific buttons let you switch on multiple devices simultaneously.View larger.Connect to your computer via USB cable (included) to customize the remote's functions and receive automatic updates.View larger.Control Virtually any DeviceUtilizing a database that lets you control more than 300,000 devices, the Prestigo Universal remote control is compatible with virtually every brand on the market today. From your TV and DVD player to your game console and MP3 Player Dock, the Prestigo will navigate up to six devices at once with the touch of a button. And Philips' Configo software (included) automatically informs you about updates to ensure that the remote is compatible with the latest devices.Streamline Your Entertainment SystemTired of pressing button after button on your different remote controls when you just want to watch a movie? The Prestigo offers one-touch control with activity-specific buttons. Simply press the \"Watch DVD\" button and your TV, DVD player, and home theater system will switch on simultaneously.1.5-Inch LCD Screen Makes Navigation a SnapStreamline and stay in control of your entertainment action with Prestigo's 1.5-inch LCD screen, which allows you to monitor up to six devices at once. In addition, the LCD screen allows you to customize the remote so you can save the functions you use more frequently, and store the functions you don't use.Easy Setup Using Mac or PCTo get started, simply connect the remote to your PC or Mac computer using the included USB cable. Follow a few simple steps, and select the correct infrared codes from the Prestigo database to make the remote compatible with your devices.The Philips Prestigo Universal remote control requires three \"AA\" batteries (sold separately), and is backed by a one-year limited warranty.About PhilipsPhilips has a brand promise of \"sense and simplicity\" that encapsulates their commitment to understanding and catering to the desires and needs of consumers and customers. By putting end users front and center, Philips creates innovative products that are designed around people's needs and aspirations, and are both advanced and easy to use. With 60,000 registered patents, Philips is a global leader in innovation, and receives numerous international design awards every year.What's in the BoxPrestigo SRU6006 Universal remote control, USB cable, Configo software, and user manual.", "title": "Philips Prestigo SRU6006/27 Universal 6-In-1 Remote Control", "price": 37.62, "imUrl": "http://ecx.images-amazon.com/images/I/31thlSNuCRL._SY300_.jpg", "related": {"also_viewed": ["B003DNS88W", "B001KC08A4", "B00I54C0GA"], "buy_after_viewing": ["B003DNS88W", "B001KC08A4", "B004OVECU0", "B003DNS88C"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Remote Controls", "TV Remote Controls"]]}