{"asin": "B005IHAIDO", "related": {"also_bought": ["B005K8AUMK", "1133597122", "B000DZH9H4", "B000UPNQCY", "B0029U0X1A", "B005OB2L7U", "B008OMOEO4", "B0042GHI8U", "B00004ZCJH", "B00563DBP2", "B000JC5GSK", "B003MQWN40", "B003VNKNF0", "1118243803", "B002MPPRNQ", "B0042UC5BG", "B003VAMZK4", "B0097DFRMC", "B00854NP7S", "B004Z5GPF0", "B0029U0X24", "B0069TIA12", "B002HZY5GG", "B003LYKLCO", "B005K8AU3Y", "1133948863", "B001XWTTOC", "B000VUFDPG", "B00CV9MK4W", "B00CV9MKU6", "B0040RWN0O", "B00440D7S4", "B005K8AUGG", "B002G2BTTQ", "B007PCP47A", "B0082RRKCO", "B00CV9M5CY", "B000B8T6DI", "B000B8GSJ8", "B003URJP5Q", "B001KNDZHQ", "B00C9V5GKC", "B005LFT3QG", "B00AE8EAW2", "B003XJ0FK0", "B00BQKJV94", "B004QQD452", "B00004ZCJJ", "B00BFWWOQ0", "B0097DFR8G", "B001O81FNS", "B0012DHL10", "B002O11LQA", "B007QOX5AK", "B00BEHRQB4", "B00B7ID9CU", "B00B7ID99I", "B002DW99H8", "B007M54E1M", "B00B7ID97A", "B001TZUS98", "B004Q3C98S", "B007NDL56A", "B00688BKWA"], "bought_together": ["B003VNKNF0"], "buy_after_viewing": ["B00B7ID99I", "B005IHAIAW", "B005K8AUMK", "B003VNKNF0"]}, "title": "Sony A65 24.3 MP Translucent Mirror Digital SLR With 18-55mm Lens", "price": 779.99, "salesRank": {"Camera &amp; Photo": 7041}, "imUrl": "http://ecx.images-amazon.com/images/I/51zrVFK5HaL._SX300_.jpg", "brand": "Sony", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]], "description": "a77Best of both worlds, 24.3 megapixel and up to 10 fps. Get action photos, HD Movies and Live View shots that other cameras miss, thanks to Sony's exclusive Translucent Mirror Technology. Enjoy smooth and creative HD video at full 1920 x 1080 resolution &ndash; at either 60p or 24p frame rate - plus the world's first OLED electronic viewfinder.2nd Generation Translucent Mirror DesignOther DSLRs can shoot. Or they can focus with the speed and precision of Phase Detection AF. They cannot do both at once. Sony changes all that with the award-winning Translucent Mirror Technology system. It directs light to both the image sensor and the Phase Detection AF sensor simultaneously.24.3 MP; best-in-class resolutionYou get incredible detail and gorgeous enlargements thanks to an APS-C sensor with 24.3 megapixels. It's the worlds's first 24.3MPAPS-C DSLRUpgraded BIONZ image processorThe brain of the camera is a Sony's BIONZ image processor substantially upgraded for the demands of 24.3 megapixel photography. Chroma noise reduction delivers high-resolution, low-noise photos even at ISO 16000. Also enables fast processing for up to 10 fps continuous shooting of data-intensive 24.3 MP images, 2D/3D Sweep Panorama modes and 6-image layering.Sony Exmor technologyConventional image sensors use only a handful of analog-to-digital (A/D) converters, which can slow you down. The Exmor sensor provides more than 5,600 column-parallel A/D converters. This helps enable continuous shooting at up to 10 frames per second.Ultra-fast up to 10 fps continuousThe translucent mirror makes it far easier to capture the decisive soccer kick or your baby at her absolute cutest. Shoots up to 10 frames per second at full-resolution 24.3 megapixels with continuous auto focus (AE locked after first frame).World's first OLED viewfinderThere's never been anything quite like the Tru-Finder OLED electronic viewfinder. For size, speed and brightness even after sunset, this is a gem. It begins with 2359K dots for amazing resolution and high contrast ratio for incredible depth. OLED reduces motion blur to a bare minimum. You can also see the results of camera adjustments in real time with superb color and detail.Full-Time Live View in LCD or EVFYou can use both the LCD monitor and OLED Electronic Viewfinder for composing shots in Live View. Both provide a what-you-see-is-what-you-get preview of white balance, focus, depth of field, exposure and 100% framing accuracy, plus informative on-screen displays.Tilt/swivel LCD screenTilt it up or down to frame high- and low-angle shots that would otherwise be hit-or-miss. Tilt and swivel under the camera for self-portraits. Finally, the monitor folds flush to the camera with the LCD exposed for shooting or protected for travel.921K dot TruBlack LCD screenSony's 3.0-inch Xtra Fine LCD monitor has 921K dots for superb resolution. The TruBlack screen includes a special resin layer to suppress internal reflections, increasing contrast compared to conventional LCDs. Sunny Weather mode boosts visibility even further.Graphic DisplayClarifies the relationship between aperture and shutter speed, as well as the effect each has on photographic results.HD Movies at 60p, 60i, or 24pCapture spectacular HD Movies. This is the world's first DSLR to offer a choice of super-smooth 60p, standard 60i or cinematic 24p, all at Full HD 1920x1080 resolution. AVCHD Progressive codec delivers stunning picture quality. MP4 codec offers smaller files for easier upload to the web.HD movies with full manual controlNow you don't need to surrender control when you shoot HD movies. Enjoy the full expressive potential of Program, Shutter Priority, Aperture Priority or Manual (P/A/S/M) control in HD movie mode.Full-time Phase Detection AFYou get fast, accurate auto focus in every mode&mdash;even HD Movie and Live View&mdash;thanks to Sony's exclusive Translucent Mirror Technology. While Contrast Detection Auto Focus often hunts for correct focus, Phase Detection AF knows exactly where correct focus is, and goes straight for it.HDMI output for HD viewingEnjoy HD movies and stunning still images on a compatible HDTV. The camera includes an HDMI output. In addition, the BRAVIA Sync system works with compatible Sony BRAVIA HDTVs enabling you to control camera playback using the television's remote."}