{"asin": "B001U0OGQS", "description": "Speedier than ever with the latest Intel dual-core processor, the Apple iMac all-in-one desktop PC packs a complete, high-performance computer into its all-in-one design, sporting a sleek, professional aluminum enclosure that's joined precisely to a 20-inch glass cover to create a virtually seamless front surface. It's powered by a 2.66 GHz Intel Core 2 Duo processor, which includes an amazingly fast 1066 MHz front-side bus speed and super-sized 6 MB L2 cache. This dual-core processor also provides an optimized, multithreaded architecture for improved multitasking, video, and gaming performance. And this iMac also gets a boost in video processing power from the NVIDIA GeForce 9400M integrated graphics chip with 256 MB of DDR3 SDRAM shared with main memory.Designed with a recyclable anodized aluminum frame and glass cover, the iMac is friendlier to the environment.The iMac also features an ultra-thin aluminum Apple Keyboard--with dedicated keys for Mac features such as brightness, volume, eject, play/pause, and Expos&eacute;--as well as the wired Mighty Mouse. It comes pre-loaded with Apple's Mac OS X 10.6 Snow Leopard operating system--an operating system custom-designed for the advanced technology inside--and it also comes with the iLife '09 suite of applications, including iPhoto, iMovie, Garageband, and iTunes.Hardware features include a 320 GB hard drive, 2 GB of RAM (with an 8 GB maximum capacity), 8x SuperDrive for burning movies to DVD and music mixes to CD, integrated 802.11n wireless LAN, Gigabit Ethernet wired networking, and Bluetooth 2.1+EDR connectivity.Power on a PedestalWith its anodized aluminum frame set upon a sleek pedestal, the new iMac instantly transforms your workspace from cluttered desktop to brilliant display podium. Because the iMac's housing is made from a single sheet of aluminum, you won't see any seams or screws except for a single compartment on the bottom that provides easy access to the memory slots. The glossy widescreen 20-inch glass display makes photos and movies come alive with rich color. And the built-in iSight camera and microphone are integrated so neatly you barely notice they're there. Aside from the design details, the iMac is also friendlier to the environment with highly recyclable and durable materials including scratch-resistant glass and professional grade aluminum.The compact keyboard's ultrathin anodized aluminum enclosure features low-profile keys that provide a crisp, responsive feel.With its elegant anodized aluminum enclosure, the new Apple Keyboard looks equally at home in your living room or on your desk. Just connect it to the USB port on your iMac and start enjoying the crisp, responsive feel of its low-profile keys. This compact keyboard also includes special function keys for Mac features such as brightness, volume, eject, play/pause, Expos&eacute;, and more. Two USB 2.0 ports provide high-speed connectivity for your iPod, Mighty Mouse, digital camera, and other USB-based electronic devices.Intel Core 2 Duo ProcessorExperience faster, more nimble application performance and improved energy efficiency with this 2.66 GHz Intel Core 2 Duo processor. Its hafnium-infused circuitry--which reduces electrical current leakage in transistors--helps to reduce power consumption while delivering. powerful processing speeds. This 2.66 GHz Core 2 Duo processor is aided by a 1066 front-side bus speed and a super-sized 6 MB L2 cache. (An L2, or secondary, cache temporarily stores data; and a larger L2 cache can help speed up your system's performance. The FSB carries data between the CPU and RAM, and a faster front-side bus will deliver better overall performance.)The Intel Core 2 Duo's 128-bit SSE3 vector engine handles 128-bit computations in a single clock cycle, accelerating data manipulation by simultaneously applying a single instruction to multiple data. And its two execution cores are designed to share resources and conserve power, helping it to achieve higher levels of performance since it uses fewer watts.Hard Drive and MemoryThe 320 GB Serial-ATA (SATA) hard drive (7200 RPM) quickens the pace with a higher speed transfer of data--akin to FireWire and USB 2.0. The 2 GB of DDR3 RAM (two SO-DIMMs of 1 GB) have an industry leading 1066 MHz speed, and the RAM capacity can be increased to 8 GB.Graphics and VideoThe 20-inch widescreen TFT active-matrix LCD offers a resolution of 1680 by 1050 pixels. It has a brightness rating of 290 cd/m2 (candela per square meter), a contrast ratio of 800:1, and a viewing angle of 160 degrees (both horizontal and vertical). The NVIDIA GeForce 9400M shares 256 MB of DDR3 SDRAM with main memory. You'll notice the difference when you work with high-resolution photos and high-definition video, where graphics-intensive features in iPhoto and iMovie are smoother. And 3D game play--from Spore to Call of Duty--is faster and more responsive.This iMac also enables you to connect a second display in either extended desktop mode or video mirroring mode. The Mini DisplayPort port offers support for DVI, dual-link DVI, and VGA video connections via an optional adapter.Wired and Wireless ConnectivityThe iMac gives you plenty of room to grow, accommodating as many as six peripherals at a time thanks to its four USB 2.0 ports and the two USB 2.0 ports on the Apple Keyboard. It also includes a single powered FireWire 800 port (one of the fastest peripheral standards available)--enabling you to quickly transfer content from compatible digital video cameras, hard drives, and other high-speed devices.Share files around your house with built-in 10/100/1000BASE-T Ethernet as well as the next-generation high-speed wireless 802.11n technology, which is integrated into the latest Apple Airport Extreme Base Station. The iMac is also Wi-Fi Certified to work with base stations and routers that use industry-standard 802.11a, 802.11b, or 802.11g wireless technologies.You get a full complement of ports on the back of the iMac, including four USB 2.0 and one Firewire 800.The integrated Bluetooth wireless connectivity--version 2.1 + Enhanced Data Rate (EDR)--allows you to use a wireless keyboard or mouse, and synchronize peripherals such as cell phones and PDAs. Enjoy high-quality sound on almost any speaker system with double-duty analog/digital audio. Record digital and analog sources through audio line in, perfect for your latest podcast in GarageBand.SuperDriveIntegrated neatly into the iMac is a slot-loading SuperDrive that lets you play and burn your own CDs and DVDs--including double-layer DVDs. And there's no disc tray--just slide the disc right in. It offers the following speeds:Writes DVD+R DL and DVD-R DL discs at up to 4x speedWrites DVD-R and DVD+R discs at up to 8x speedWrites DVD-RW at up to 6x speed and DVD+RW discs at up to 8x speedReads DVDs at up to 8x speedWrites CD-R discs at up to 24x speedWrites CD-RW discs at up to 16x speedReads CDs at up to 24x speedOther FeaturesBuilt-in stereo speakers with internal 24-watt digital amplifierSimultaneously supports full native resolution on the built-in display and up to a 30-inch display (2560 by 1600 pixels) on an external displayHeadphone/optical digital audio output (minijack)Audio line in/optical digital audio input (minijack)Built-in microphoneDimensions: 19.1 x 18.5 x 7.4 inches (WxHxD)Weight: 20 poundsThe Greenest iMac YetThe energy-efficient hardware components in the iMac work hand in hand with Mac OS X to create a system that can dynamically adjust power consumption to reduce the energy used overall. The iMac uses an advanced power management system leveraged from the technology that makes the most of battery life in Apple's MacBook family. To reduce energy consumption, the iMac hard drive spins down automatically when inactive, and it also decides which processor--CPU or GPU--is best suited to perform a task efficiently. That means when iMac is idle, it's using as little power as possible.Apple engineers have worked hard to eliminate many of the toxins that are a common part of desktop computer manufacturing, such as choosing arsenic-free display glass for iMac. They have also removed brominated flame retardants (BFRs) and polyvinyl chloride (PVC) from circuit boards, internal cables, connectors, insulators, adhesives, and more. And the entire iMac computer is integrated into an enclosure made from a single, solid piece of recyclable aluminum, while the display is made of recyclable glass.The Mac mini meets the stringent low power requirements set by the EPA, giving it ENERGY STAR certification. In addition, Mac mini meets the latest efficiency requirements of ENERGY STAR Version 5.0 Specification for Computers before its July 2009 effective date. It has also earned the highest rating of EPEAT Gold. The Electronic Product Environmental Assessment Tool, or EPEAT, evaluates the environmental impact of a product based on how recyclable it is, how much energy it uses, and how it's designed and manufactured.<Pre-Loaded with Mac OS X Snow Leopard and iLife '09Every Mac comes with Mac OS X Snow Leopard, the world's most advanced operating system, and iLife, Apple's innovative suite of applications for managing photos, making movies and creating and learning to play music. Snow Leopard builds on a decade of OS X innovation and success with hundreds of refinements, new core technologies and out of the box support for Microsoft Exchange. iLife features iPhoto, to easily organize and manage photos; iMovie with powerful easy-to-use new features such as Precision Editor, video stabilization and advanced drag and drop; and GarageBand which introduces a whole new way to help you learn to play piano and guitar.Installed softwareMac OS X v10.6 Snow Leopard (includes Time Machine, Quick Look, Spaces, Spotlight, Dashboard, Mail, iChat, Safari, Address Book, QuickTime, iCal, DVD Player, Photo Booth, Front Row, Xcode Developer Tools)iLife '09 (includes iPhoto, iMovie, GarageBand, iWeb, iDVD)What's in the BoxiMac, Apple Keyboard, Mighty Mouse, cleaning cloth, power cord, install/restore DVDs, printed and electronic documentation", "title": "Apple iMac MB417LL/A 20-Inch Desktop", "imUrl": "http://ecx.images-amazon.com/images/I/41Jx%2BJA7JML._SX300_.jpg", "related": {"also_bought": ["B004L257C4", "B005DLDTAE", "B002TLTGM6", "B0013FLU96", "B002C7481G", "B00HQ5OGHK", "B005DLDO4U"], "buy_after_viewing": ["B002C74E9C", "B002TLTGM6", "B004YLCIC4", "B005DLDO4U"]}, "categories": [["Electronics", "Computers & Accessories", "Desktops"]]}