{"asin": "B005TWE6B8", "categories": [["Electronics", "Computers & Accessories", "Computer Components", "Power Supplies"]], "description": "picoPSU-160-XT High power, 24 pin mini-ITX power supply in a small package (picoPSU) High Reliability design, less cables. The picoPSU-160-XT is the toughest plug-in 12V ATX dc-dc power supply. The picoPSU is compatible with an entire range of mini-itx motherboards as well as regular boards. The picoPSU-160-XT provides a cool, silent 160 Watts (200 watt peak) of power for small PC designs using a single 12V power source. By using Patent Pending HyperWatt[TM] technologies , picoPSU-160-XT packs an impressive amount of power relative with its very small footprint. picoPSU-160-XT has several key advantages over traditional power supplies: - Very small , can build unltra-compact PC enclosures and slim server enclosures. - Fits any motherboard equipped with a 24pin ATX connector. - 100% silent, fanless, no moving parts. - Operates at only 12V. - Highly efficient design, does not produce a lot of heat. - Ideal for boards such as D945GCLF2, DG45FC, (Atom, Core 2 Duo) as well as all VIA C7/nano or AMD motherboards. Small computer projects start with small power supplies. picoPSU-160-XT is a crucial key component that unleashes the ultimate power solution for general purpose computing platforms. picoPSU-160-XT is fully ATX compliant PSU, making it an excellent candidate for any silent, fanless and small 12V DC-DC ATX PC power supply project. Reduce space. Eliminate 24 unnecessary wires by plugging in directly into the motherboard ATX connector. The picoPSU-160-XT 12V dc-dc ATX converter was designed from ground up to fit small form factor ATX boards, allowing enclosure designers to save space while not compromising power requirements. Cool power. Operating at only 12V, the picoPSU-160-XT dc-dc ATX power supply delivers 160 Watts of power. picoPSU provides plenty of power (via ATX connector and HDD cable harness) for CPU and an entire range of peripherals. 100% Silent The picoPSU-160-XT mini PSU is a 100% silent fanless dc to dc solution. No fans, no noise, just power", "title": "Mini-Box picoPSU-160-XT High Power 24 Pin Mini-ITX Power Supply", "price": 44.5, "imUrl": "http://ecx.images-amazon.com/images/I/41s6c47KW6L._SX300_.jpg", "brand": "Mini-Box", "related": {"also_bought": ["B00905I1TI", "B003DXI288", "B007XVD452", "B000VE7GQQ", "B006V5SZMI", "B005TX3LA4", "B007XVE11S", "B00GSQMTWM", "B005TWE5E6", "B0087TS1S4", "B00A29FYD2", "B009NQLT0M", "B00K2R6E0Q", "B009VCAJ7W", "B004PLWJCC", "B007HEN2W0", "B00EUVEFEC", "B00D94X4DO", "B009VY1R9O", "B00FYKNEVS", "B005TWE3O8", "B006ICQ3FK", "B009NQMESS", "B00CXIY468", "B000IV6S9S", "B002O1W6ZK", "B0035FIS2O", "B0093H8H8I", "B0064LWISQ", "B003WOL4UG", "B00IAELTAI", "B006GD30UC", "B001OFNLXI", "B005TX3NHU", "B00CO8T9VM", "B00213KDQK", "B002N2EHVQ", "B00316RGD4", "B00DU6RVK8", "B005TX3LEK", "B009JXKQ9O", "B00HWYRYMY", "B00066IO2O", "B00D1A8094", "B00G237CYQ", "B00HWHVOQS", "B00CO8T9VW", "B005SCYHV8", "B003EMJQXI", "B00DRA4F06", "B00E7QCDDA", "B00I1OM8GG", "B003U6XZNU", "B0045WFZSQ", "B00FHG4AHG", "B000S95RWE", "B005TWE4YM", "B00DFGL1NQ", "B005TX3M62", "B00GQV1VFA", "B0058HLEBE", "B00D5ZZZ70", "B00906G97I", "B00958D9LA", "B003AXW2YQ", "B00H7OHW8A", "B007SZ0EOM", "B000O7WFHA", "B005ITOAL8", "B00HF8A30M", "B00E3W15P0", "B003DXV9O2", "B00A14ZT8I", "B003TUMDWG", "B0080ATR2Y", "B00JB40498", "B002TW03X6", "B00CFXZ9VA", "B00AELHI7S", "B002O21XHQ", "B0064SNWXY", "B003HHROBG", "B002P6PBAQ", "B007ZT1FAI", "B002GNU2V6", "B000067SLY", "B0093H8MTW", "B000OGX5AM", "B00A1ZTZOG", "B00A2VJIQE", "B00A35X6GM", "B00A14ZTTM", "B00BQ8RKT4", "B005BCNAWM", "B00EPX2D5I", "B004X9PHFC"], "bought_together": ["B000VE7GQQ", "B003DXI288"], "buy_after_viewing": ["B0045WFZSQ", "B000VE7GQQ", "B003DXI288", "B005TWE5E6"]}}