{"asin": "B000HAOVC6", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Replacing the highly popular PowerShot A620, the PowerShot A630 features a rotating 2.5-inch vari-angle LCD, 4x optical zoom lens, and a vast array of creative shooting modes.The PowerShot A630 packs a vast array of advanced features into a remarkably compact space:8.0 megapixels2.5-inch vari-angle LCD screen and real-image optical viewfinder4x optical zoomDIGIC II, iSAPS, 9-Point AiAF, FlexiZone AF/AEDigital teleconverter and Safety Zoom21 shooting modesQuality controlThe 8.0-megapixel sensor allows for creative cropping while providing enough detail for large, high-quality prints. A new Safety Zoom takes advantage of the camera's high resolution to offer extra zoom magnification without affecting image quality--up to 16x zoom when shooting Small size images. Users can also activate the Digital Teleconverter to add extra telephoto reach on all shots, similar to adding a teleconverter lens to the camera.The 4x optical zoom lens achieves a 35-140mm focal length (35mm equivalent) while allowing the camera to maintain a compact size. The lens construction incorporates 8 elements in 7 groupings, including two aspherical elements to maximize sharpness across the whole image. With a maximum aperture range of f2.8 (wide) to f4.1 (telephoto), the lens is remarkably bright at the telephoto end.ISO 800 mode improves results when shooting in low-light settings and enables flash-free photography indoors. The camera's High ISO Auto setting prioritizes fast shutter speeds by automatically using the higher range of ISO sensitivities, reducing the risk of unwanted image blur.Improved LCD and playbackA larger 2.5-inch vari-angle LCD screen enables accurate framing from unusual angles, such as those encountered when using the 1-centimeter (.4-inch) Macro mode. The enhanced user interface (UI) retains a selectable Grid Line display to assist with rule-of-thirds compositions, while users can also enable a new 3:2 ratio overlay during shooting to view the printable area for standard photo prints. Playback is enhanced with an overexposure warning feature, which indicates overexposed areas in captured images.Flexible shootingThe PowerShot A630 offers users a range of versatile features for creative photography. A choice of 21 shooting modes includes Program, Aperture priority, Shutter priority, and full Manual modes for complete exposure control. A Second Curtain Sync function allows for creative flash exposures, such as light trails. Artistic photo effects can be applied in-camera during and after shooting with My Colors.Filming is also possible at a high standard--VGA quality movies can be captured with sound at a smooth 30 frames per second (fps). The AV-out connection and supplied cable allows for full screen playback on a TV.Full range of accessoriesA comprehensive range of optional lenses and accessories includes wide (0.7x) and telephoto (1.75x) converter lenses. The optional High Power Flash offers further flexibility for night time photography, while an optional waterproof case allows full control at depths of up to 40 meters. (Accessories are not included and must be purchased separately.)Technologies ExplainedDIGIC IICanon's purpose-built DIGIC II (DIGital Imaging Core) image processor links all primary camera functions for maximum efficiency. DIGIC II processes signals at high speeds, resulting in outstanding responsiveness, rapid autofocus, and extended continuous shooting ability. Advanced image processing algorithms deliver superb image detail and color reproduction with accurate white balance and minimal noise. DIGIC II operates efficiently to extend battery life, for longer shooting on a single charge.iSAPSiSAPS (Intelligent Scene Analysis based on Photographic Space) automatically optimizes key camera settings before every shot. Each scene is analyzed and cross-referenced against Photographic Space--a vast in-camera library of photographic data. This enables the camera to make optimal adjustments to autoexposure, autofocus, and auto white balance before image capture occurs.9-Point AiAFCanon's 9-point AiAF (Artificial Intelligence Autofocus) automatically scans and selects subjects from a set of nine focusing areas across the scene. This ensures accurately focused images even when subjects are not in the center of the frame.FlexiZone AF/AEFlexiZone AF/AE lets users manually select the focus point from almost any point in the frame by moving the autofocus window in the viewfinder. Exposure can be linked to the focus point to ensure that the chosen subject is accurately focused and the scene correctly exposed.Digital Teleconverter and Safety ZoomSimilar to placing an accessory lens on the front of the camera, Canon's Digital Teleconverter adds a constant digital zoom to every shot (1.6x/2.0x). While optical converter lenses cause a reduction in aperture and consequently require a slower shutter speed, the Digital Teleconverter maintains aperture size, reducing the risk of image blur.Safety Zoom protects the image from interpolation at high levels of digital zoom, allowing users to extend zoom magnification without sacrificing image quality.What's in the boxPowerShot A630 body, AA-size Alkaline battery x 4, MultiMediaCard-16M, wrist strap WS-200, Digital Camera Solution CD-ROM, USB interface cable IFC-400PCU, AV cable AVC-DC300", "title": "Canon PowerShot A630 8MP Digital Camera with 4x Optical Zoom", "price": 17.12, "salesRank": {"Camera &amp; Photo": 5006}, "imUrl": "http://ecx.images-amazon.com/images/I/51AG8V52PEL._SX300_.jpg", "related": {"also_viewed": ["B000HARTYI", "B000AYJDD6", "B000V20R28", "B0011ZCDKS", "B000HATNI8", "B001SER47Y", "B000NK3H4S", "B005IQGUHS", "B002LITT56", "B0032JRRXE", "B000V1VG2E", "B006T747AM", "B0075T7NW2", "B000AYKV4G", "B000EMWBV0", "B000EMU888", "B005I6DVC0", "B0075SUII4", "B000V1VG4W", "B000MFA1NE", "B002LITT42", "B00009W5FF", "B000ENPDSW", "B005IGVXJS", "B00908BQCY", "B0011ZK6PC", "B001SER4BK", "B000Q30420", "B0041RSPRS", "B001G5ZTPY", "B004HW73S4", "B003ZSHNG8", "B00EFILR6E", "B000Q3043Y", "B00HTTKSZC", "B009B0MY6S", "B000NK6J6Q", "B0034XFG86", "B001SER44W", "B00427ZLRO", "B001SER48S", "B00EFILPHA", "B002LITT3S", "B000AYKUUQ", "B00I58LVKC", "B000V1VG5G", "B009B0MZ1M", "B001CCLBSA", "B008T6OFW6", "B0012YA4YK", "B00AWYMXZY", "B0009GZSSO", "B00IVEHSV6", "B005I6DVLQ", "B004HYFX0C", "B0033VKKB2"], "buy_after_viewing": ["B003VNKNF0", "B003VNKNEQ", "B000HARTYI", "B0033ZB0T4"]}}