{"asin": "B000652SZO", "description": "The bamboo plant grows in single stalks, called culms. An extremely fast growing plant, as much as 39'' in one day, each culm grows to full height and strength within 2 years. Between years 3-5, a fungus begins to grow along the outside of the stalk, eventually overtaking the bamboo and destroying it from the inside out sometime 5-7 years into its life.Harvested, then, during years 2-4, the bamboo plant finds purpose as a food source, a building material, and as a raw product in things like textiles, paper, and musical instruments.Enter theTrue Bamboo Minimus Case, a refined and responsible choice for your device.TheTrue Bamboo Minimus Casefeatures an ultra slim, anti-slip design, fitting like a glove instead of a winter coat: real protection without sacrificing functionality and range of motion.A great combination, the Bamboo backing of the True Bamboo is surrounded by our Jet Black, Winter White or Maroon Minimus Case shell. This shell is constructed using hard plastic and enhanced with our signature SmoothTexture finish. Our SmoothTexture finish is known for its:Strong resistance to oil, grease, and fingerprintsSofter feelAbility to repel surface dustTheTrue Bamboo Minimus Case: Pitch Perfect", "title": "BoxWave True Bamboo Minimus Apple iPhone 5 Case, Genuine Bamboo Wood Backing Shell Case Cover with Durable Plastic Edges with Smooth Matte Finish (Winter White)", "price": 29.95, "imUrl": "http://ecx.images-amazon.com/images/I/418WtBE1PuL._SY300_.jpg", "related": {"also_viewed": ["B00BOMTKW2", "B00C9UZDSS", "B00C9UZC7K", "B00FIKN4JG", "B00C9UZD3I", "B00C9UZER8", "B00BOMO6WQ", "B00GOB63I2", "B00C9UZC5W", "B00GNHGGC0", "B00C9UZH3Y", "B00HY46U40", "B00C9UZES2", "B00IPS3ZGA", "B00IPRX85Y", "B00C9UZD7E", "B00AV177R2", "B00C9UZDTW", "B00C9UZDR4", "B00C9UZESM", "B00C9UZFPE", "B00BRZ3BA8", "B00C2OPZC0", "B00IWKEGO6", "B00CVWMQDE", "B009NA5MR4", "B00C9UZEW8", "B00FHU3J1A", "B00DFPR39S", "B00C9ZA9HS", "B009NBO3UK", "B00C9UZC6Q", "B00C9UZETG", "B0097QJ7Q6", "B00IPS281I", "B00CFUK7X8", "B00AV0HL56"], "bought_together": ["B0093QER4C"], "buy_after_viewing": ["B00BOMTKW2", "B009YCP1LS", "B00C9UZDSS", "B0093QER4C"]}, "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Cases & Sleeves", "Cases"]]}