{"asin": "B003FO4UHW", "description": "Highly-Rated Transmitter from F-S Electronics Revised and Reperfected: Rear RCA Inputs, TNC Antenna Port, and Sleek, Sexy Smooth Black Finish. F-S Electronics' is an Indiana, USA-based company focused on manufacturing and carrying only the best of the best transmitters on the market! This 0.5 W Fail-Safe Dual Mode Stereo FM Transmitter (FSCZH-05B) broadcasts wirelessly in both High and Low Power Output Modes (0.5 Watt or 0.1 Watt). The FSCZH-05B is your answer for wireless music, audio, or voice throughout your house and your whole entire property to any FM Radio in its path--including boomboxes, FM headsets, handheld radios, car stereos, etc.! With reported broadcast ranges of up to 3 miles, this transmitter is by far the most versatile transmitter in its category! So how do the C. Crane and TAW Global's Whole House FM Transmitter 2.0 compare? There is no comparison, the benefits of the FSCZH-05B are endless, but among the key benefits are its durability, design, sound quality, and or course versatility. Whether you are simply trying to broadcast just a cover a small area such as your house in L mode, want to extend to over 100 yards away range by setting it to H mode, or want to significantly boost the range by employing one of F-S Electronics Antenna Upgrades, this transmitter is our most cost effective and versatile solution! The low net project cost and simple plug n playability makes it easy for the FSCZH-05B to be the top selling FM Transmitter in the Low Power Category! Popular Uses: #1) Broadcast from any audio device to any FM Receiver--from MP3/iPod/Cell Phone, Satellite Audio or Music, Computer Audio, Blu-Ray #2) Church Transmitter for Translation or Hearing Impaired, #3) Christmas Light Displays--Animated Lighting, Light-o-Rama, WOW Lights, D-Light, #4) Announcement Transmitter--American Cancer Society's Relay for Life, Fairs and Car Shows, Athletic Events, #5) Business Transmitter--Fitness Center Transmitter, Drive-In Movie Transmitter", "title": "0.5 W Fail-Safe Long Range FM Transmitter - FS CZH-05B - Newly Revised: Dual Mode now with RCA Inputs", "price": 79.99, "imUrl": "http://ecx.images-amazon.com/images/I/41ZQfT5arXL._SX300_.jpg", "related": {"also_bought": ["B000O5MS3S", "B000EA1KXC", "B0013L56OK", "B0013L48XA", "B005GUQ0FI", "B00006JQ06", "B008BF9B1A", "B00CXN4EX6", "B0043L32KC", "B00140DBRY", "B003VZOUX4", "B000058DPL", "B007Q94CZM", "B0096KYDF8", "B00E953OJQ", "B00GHWUHD0", "B003YNYDWQ", "B0096KY9YS", "B004YEFLGQ", "B000I94FAE", "B000BICOO6", "B0013L69D2", "B00HFT4190", "B00CXNRRRG", "B001421ZKM", "B004YEBK66", "B0094O7WR2", "B00EN685PO", "B0001VGFKW", "B000068O3S", "B000068O17", "B0026322V4", "B003M8NVFS", "B007NKOC2W", "B0098NY0MO", "B00713RSE0", "B0051M6J48", "B005G57GIS", "B002HJ61PK", "B00020S7XK", "B000J1H4VI", "B000YK1JAG", "B004LTEUDO", "B000068O3T", "B000LQ905E", "B00030AP48", "B000I23TTE", "B00476B908", "B005HGM1D6", "B003BZWR4S"], "bought_together": ["B000O5MS3S", "B000EA1KXC"], "buy_after_viewing": ["B0096KY9YS", "B008BF9B1A", "B00D826PU6", "B005GUQ0FI"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "FM Transmitters"]]}