{"asin": "B00178HN0O", "related": {"also_bought": ["B00BMEXXMA", "B00000JPPI", "B00000J1QR", "B003IDKR4A", "B003EEMDMC", "B0072A4GQK", "B0007U9SRE", "B00008EM7U", "B00006JHSD", "B00FQFFPZO", "B00HWWUQYY", "B00JL6L4WC", "B0050SWUTQ", "B00J11U4T6", "B00CTNUMPO", "B00HHYF5DY", "B00HEPDLFK", "B0050SX9I2", "B00HW3LCCI", "B002I0J8FI", "B002I0K6X6", "B00E8S2JZ4"], "bought_together": ["B003EEMDMC", "B00000J1QR"], "buy_after_viewing": ["B003EEMDMC", "B0046SPJOE", "B005D82L8S", "B00BMEXXMA"]}, "title": "Maxell BR-LC Blu-ray Lens Cleaner for PS3 (190054)", "price": 11.24, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/51NLTmoNoeL._SY300_.jpg", "brand": "Maxell", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Cleaning & Repair", "Lens Cleaners"]], "description": "Maxell BR-LC Blu-ray Lens CleanerDust and dirt can build-up over time which can degrade picture quality and keep your Blu-ray disc player from running at its optimal performance.&nbsp;&nbsp; Maxell BR-LC with 3 super fine microfiber brushes allows you to clean the delicate lenses of your video and gaming equipment without the use of chemicals.&nbsp;Interactive On-screen InstructionsThe multilingual on-screen interactive program allows you to choose options to explain the cleaning process, equipment performance tests, and other disc features.Equipment Performance TestsTest the performance of your Blu-ray disc player to determine if it is operating at its optimum level. Choose between the speaker and channel test or the polarity verification test.Compatible with Multiple PlayersThe BR-LC works with all Blu-ray players including Playstation 3. You can easily and safely clean all of your media equipment with the BR-LC.Preserve the Life of Your Blu-ray PlayerThe BR-LC Blu-ray Lens Cleaner will ensure you can enjoy the very best your media has to offer. It can maintain the pristine condition of your Blu-ray player by removing excessive build-up and residue and prevent any permanent damage; allowing you to enjoy your Blu-ray player for years on end."}