{"asin": "B008GVETNE", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "FM Transmitters"]], "description": "GOgroove BlueSense TRM - Wireless Audio from ANY Device!Unlimited Bluetooth StreamingThe GOgroove BlueSense TRM is a portable Bluetooth TRANSMITTER allowing wireless streaming from virtually any audio source! Charge via standard USB port & pair with your favorite Bluetooth-enabled speaker system or headset! BlueSense plugs-in to any standard 3.5mm audio-out jack for instant streaming convenience.Easy Set-upBlueSense automatically syncs with your Bluetooth speakers, headsets, & headphones. Simply enter device into \"Pairing Mode,\" hold down BlueSense's power button for 5 seconds, & you're set! With 10 hours of power on a single charge, the uses are endless!Wide-Range CompatibilityIf you have an audio device that isn't Bluetooth capable, the BlueSense is for you! Just sync with a speaker system or headset to enjoy audio at home, or use a portable Bluetooth speaker & stream while camping, tailgating, or at your next party! Do all of this while leaving your device safely locked away! Plug into an audio receiver & pair with a Bluetooth headset for personal audioSpeakers, Headphones, & More!If you're looking for compatible Bluetooth speakers or headsets, GOgroove has you covered! Be sure to check out our speakers like the GOgroove Bluesync MC or GOgroove Bluesync OR3, and headsets like the AirBand or BlueVIBE DLX. For even MORE creativity, pair with the GOgroove BlueGate Bluetooth Receiver and sync practically ANY two media devices! Comes with a Manufacturer's 3-Year Warranty.Stream Audio from:Tablets, MP3 Players, TV's , laptops , desktops, stereos, walkmans, CD players, radios & more*This product is a TRANSMITTER, not a receiver. Bluetooth compression/decompression may cause a delay in audio/video uses", "title": "GOgroove BlueSense TRM Wireless A2DP Bluetooth Transmitter / Adapter for Mp3 Players , Tablets , Laptops , Desktops , Home Theater &amp; More!", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/41nyOiUegUL._SY300_.jpg", "brand": "Accessory Power", "related": {"also_bought": ["B00727FE5U", "B000I23TTE", "B004BW74DO", "B00BOZAU2I", "B0095EL84E", "B004B8GF7Y", "B00H1FCUBY", "B00EZ9VPQ0", "B009Q88W0W", "B004T0CEBK", "B00FV55VXK", "B001B8QUS6", "B00FLKW0JI", "B009XJZ9VY", "B0085HOM4K", "B004GIDV58", "B0087NB53S", "B006BD074O", "B00871DQNC", "B00E174RTS", "B005LLBIJ0", "B006OT2WFM", "B00713RSE0", "B00DQUNODQ", "B008AGQMQC", "B00HHGT0Y2", "B0047T79VS", "B00AWIPITS", "B004Y4XVOK", "B00HTPHK5W", "B009OBCAW2", "B005FVNGRS", "B009F4XM48", "B00DVEJA7G", "B00G4ZYQ8W", "B005XPFYBM", "B000E9U9GC", "B002BH3I9U", "B008OUL1OC", "B00EDPW2Q8", "B002HHLOWC", "B00AVLOHJ8", "B00GWLHZBS", "B000I963FE", "B00ELCP55I", "B00EVMDOMO", "B00H1XKC1Q", "B005FVNH04", "B00001P4XH", "B005HJWWW8", "B00AIRUOI8", "B002MAPS6W", "B000BPS038", "B00F25Z0FS", "B007R6HUEE", "B000SE6IV8", "B00BW6KCTU", "B00HTMSYZU", "B002MAPT7U", "B004NWLX3E", "B00GX71GNO", "B00FGOTBQO", "B000067RC4"], "bought_together": ["B000I23TTE"], "buy_after_viewing": ["B004B8GF7Y", "B00727FE5U", "B00E174RTS", "B00DQUNODQ"]}}