{"asin": "B0038BZ8W8", "related": {"also_bought": ["B003QNVFVG", "B007JGB6TW", "B009APCEFK", "B004GX2GMC", "B009SKNWOY", "B00F361KLO", "B00F361JY2", "B00AHH6UIM", "B00433SOF8", "B007RYL8FI", "B007JGBSCC", "B005K0J3MQ", "B005C2A4DO", "B003QXNA28", "B0038BW3W6", "B004X34EIY", "B001BNCJ5E", "B00AA25WEC", "B004V9F61O", "B00AHH8Q6G", "B008SLDOQ0", "B004QIPH5U", "B009K5ZY6G", "B0094AHQ6S", "B007PRHMOS", "B00843XSGS", "B005GRO0C6", "B009SKNWM6", "B002BBJMO6", "B007IV7KRU", "B007IGRGII", "B005E7KMH0", "B004HT6TS2", "B0013FRNKG"], "bought_together": ["B003QNVFVG", "B009SKNWOY"], "buy_after_viewing": ["B007JGB6TW", "B007RYL8FI", "B007PRHMOS", "B008UHKTCY"]}, "title": "ZAGG InvisibleSHIELD for iPad 2, Screen (APPIPADTWOS)", "price": 16.19, "salesRank": {"Computers & Accessories": 3756}, "imUrl": "http://ecx.images-amazon.com/images/I/41cyyr43HEL._SX300_.jpg", "brand": "ZAGG", "categories": [["Electronics", "Computers & Accessories", "Laptop & Netbook Computer Accessories"]], "description": "Your search for an Apple iPad case, skin, or cover is now over. ZAGG's invisibleSHIELD is an exceptionally clear and virtually indestructible film that will protect your Apple iPad from unsightly scratches. This exclusive, patented film - with nano-memory technology - covers and shields your device, keeping it as pristine as the day you took it out of the box. The precision pre-cut invisibleSHIELD applies directly to your Apple iPad providing the toughest, most durable protection you will find. The invisibleSHIELD has its origins in the military, where it was used to protect high-speed helicopter blades from dust, dirt and debris. Now you can use that same powerful technology to protect your Apple iPad. The invisibleSHIELD is only .2 millimeters thick making it the slimmest Apple iPad skin or Apple iPad cover of its kind. It is so tough that Zagg backs it with a lifetime guarantee. So, if it ever does wear or scratch, they will replace it for free, for the life of your device. And if you ever need to remove the invisibleSHIELD, no problem; it comes off clean and leaves no sticky residue."}