{"asin": "B004FPZ3GM", "description": "KitThe Photographer's Pro Bundle TB01 is the perfect package for even the most demanding photographer. This package consist of the Tenba LE 15&rdquo; messenger bag and the Benro A0570F tripod.&#x2028;The Tenba LE 15&rdquo; Messengeris an urban-inspired laptop bag that&rsquo;s designed to hold everything you need for a day; on vacation or at work; at school or at the gym. A removable photo insert holds camera gear as well. The Messenger bag is all about speed, versatility and stealth. Get at your gear quickly, and do it all without anyone knowing that you have expensive equipment with you.&#x2028;The Benro A0570F Tripod with BH0 Ball Headhas aluminum twist lock legs and now offers improved performance features providing the ultimate in strength, lightweight, rapid setup, and reliability. The BENRO BH-Series Ballheads provide a single action control for smooth movement and stable camera positioning, and feature a snap-in style quick release plate system with dual locks.Tenba Messenger LE 15&rdquo; Messenger Black BagWeight&nbsp;2 lbsInside Dimensions Width 15 inchesInside Dimensions Height&nbsp;11 inchesInside Dimensions Depth 5-8 inchesLaptop Compartment Dimensions HEIGHT 10.5 inchesLaptop Compartment&nbsp;Depth 1.5-2 inchesHolds DSLR body, 2&ndash;3 lenses, flash and accessories, laptop up to 15 inches, books and magazinesBag FeaturesRemovable, padded photo insert holds a camera with 2-3 lenses and a flash.Quick Access zipper lets you get at the contents of the bag without opening the main flap.Padded sleeve holds and protects a laptop up to 15 inches.&nbsp;Over a dozen pockets and compartments to keep mobile hard drives, cell phone, MP3 player, cables, chargers, pens and business cards organized and easily accessible.Special abrasion and moisture resistant panel protects the bottom of the bag from wet surfaces.Benro A0570F Tripod with BH0 Ball Head&nbsp;&#x2028;Benro A0570F Tripod with BH0 Ball HeadMaximum Load&nbsp;8.8lbsMax Height (24&deg; Leg Angle) w/ Column Extended 56.9 inchesFolded Length 23.4Number of Leg Sections 3Leg Lock Type TwistBubble LevelSpiked FeetWeight 2.9 lbsTripod FeaturesIncorporates aluminum twist lock Legs and now offers improved performance features providing the ultimate in strength, light weight, rapid setup, and reliability.Features Patented Dust &amp; Water Resistant Rubber Lock Grips with Anti-Rotation Leg System.Benro&rsquo;s innovative rubberized locking grips combined with anti-rotation legs enable fast and fumble-free set-up plus weather and dust-resistance not found on other tripods.&nbsp;Adjustable Leg AnglesFor an extra measure of flexibility, Benro tripod legs can be independently locked into place at three different angles to enable shooting in cramped quarters, on irregular surface areas, or at ground level&nbsp;Head Mounting SetscrewsSetscrews provide an extra level of security when attaching the head to the tripod&rsquo;s top-plate&nbsp;Closed-Cell Foam GripA thick layer of closed-cell nitrile butadiene rubber (NBR) provides a comfortable yet firm grip when carrying your Benro tripod&nbsp;Wing nut-style Column LockA wing nut-style center column-locking knob allows for secure, intuitive-action height adjustments on the fly&nbsp;Reversible Center ColumnThe center column, which features a ridge-and-groove design to eliminate unwanted column rotation, can be quickly inverted for exacting, lower angle camera positioning&nbsp;Spirit Level and CompassIn or out of the studio, a built-in spirit level helps keep your camera squared-off and level to your subject, and a built-in compass provides orientation coordinates&nbsp;Center-Column HookA hook, located on the bottom of the center-column, allows you to hang additional weight from the tripod&rsquo;s center of gravity for increased stability&nbsp;BH0&#x2028;BENRO BH-Series Ballheads provide a single action control for smooth movement and stable camera positioning, and feature a snap-in style quick release plate system with dual locks.&nbsp;Patented Dual-Lock Quick Release SystemBH-Series ball heads incorporate a patented dual lock-lever that makes it easy to mount your camera to the head, while preventing any chance of accidentally unseating the camera&nbsp;Dual Locking Quick ReleaseSystem &#x2028;patented spring lock combined with manual release provide extra security&nbsp;Single Knob AdjustmentA single, one-touch adjustment knob allows for quick and precise camera positioning", "title": "Benro A0570F Tripod and Tenba 15-inch Black Messenger Bag Bundle", "price": 249.99, "imUrl": "http://ecx.images-amazon.com/images/I/414IsFY6xRL._SY300_.jpg", "related": {"also_viewed": ["B003WKOENO", "B003BQ1D4C", "B0002EXF38", "B002821ESU", "B009A17FOO", "B00IQ7PT50", "B004DGNO78", "B000UMX7FI", "B003XDU2Y0", "B004XC3GWU", "B00COLBNTK", "B003XDU2XQ", "B0016D1I0G", "B000N7VPRW", "B004MKNJ84", "B0076MHH88", "B00FZHWJHU", "B00BETIVWK", "B0015MHY6K", "B002N5NRSC", "B004RCHX0W", "B001D60LG8", "B004K6L3CE", "B001DIKUYE", "B00GYLXBR8", "B00714FK2G", "B00BETIVUM", "B0016D3H1O", "B0076MBOC8", "B00110ENQK", "B008RJP9WA", "B003SQEAY0", "B004AYD32Y", "B00EVVNPZQ", "B0067WUSGQ", "B005Z174EE", "B009YE462G", "B004E51ZLU", "B0036AYTWG", "B003G2YZOG", "B00BETIUL2", "B008JE4S6G", "B001DQL6K8", "B001RNPD42", "B00820A86Q", "B0067WUVF4", "B003U2T9DY", "B00BETIUJY", "B000HZH6W8", "B0040X4PQI", "B007BYLKLG", "B00BETIT68", "B004XC3GZW", "B000BKVNDC", "B001120WQ8", "B003BQ71MA", "B000I6UV1Y", "B0077B3E5S", "B003G2YZNM"], "buy_after_viewing": ["B003WKOENO", "B00007EDZG", "B00IMFMW1U", "B00110ENQK"]}, "categories": [["Electronics", "Camera & Photo", "Tripods & Monopods", "Complete Tripods"]]}