{"asin": "B000P5AJXI", "related": {"also_bought": ["B000ZD0CV4", "B0009RGLSE", "B004MC7SCK", "B002DS7NJI", "B000BQ7GW8", "B000FGNM6I", "B00APQA572", "B00CVED3UC", "B000YH5FOK", "B007FFIF0K", "B00GL4CHM8", "B00ESW9SWW", "B000EOMXM0", "B000XY4AD6", "B0008GMUH2", "B000I5ZC3W", "B00009UH72", "B00BFZOVGI", "B0085DZRDE", "B00BGBDJUK", "B00CHKQ28U", "B002XK2L20", "B0020ZDI5C", "B007JRB0TC", "B002PXLQSK", "B00I8ZHG9C", "B007JRB0SS", "B000WQKOQM", "B007JRB0RE", "B0009VXBAQ"], "bought_together": ["B000ZD0CV4", "B002DS7NJI"], "buy_after_viewing": ["B000FGNM6I", "B0009RGLSE", "B000BQ7GW8", "B002DS7NJI"]}, "title": "SanDisk 2 GB SD Flash Memory Card 2-Pack SDSDB2-2048-A11", "price": 24.14, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/51RDz59L7fL._SY300_.jpg", "brand": "SanDisk", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Memory Cards", "MiniSD Cards"]], "description": "From the ManufacturerSanDisk&reg; Standard SD&trade; 2 GB Card 2-packCapture a memory each day, get the most from your digital camera and jumpstart your photo library with a SanDisk Standard SD&trade; 2 GB memory card kit. Because memorable moments happen when you least expect them, be ready with reliable cards made by the pioneers of flash memory. Our two-card pack is great for launching a digital photo library&#8212;a great way to keep your photos organized for years to come. Plus, SanDisk SD&trade; cards are built for real life&#8212;to handle its bumps and turns while capturing it in all its brilliance.Maximize your camera&#8217;s performanceKeep shooting without fear of running out of spaceGet dependable performance every timeDon&#8217;t come up short, store more photos and videos*1 gigabyte (GB) = 1 billion bytes. Some capacity not available for data storage. **1 megabyte (MB) = 1 million bytes; X = 150 KB/sec; based on internal testing; performance may be lower depending on host device. ***Excludes Germany and other regions which do not recognize limited warranty.Choose SanDisk, the minds behind flash memoryAs the pioneers of flash memory, SanDisk is known all over the planet. Wherever people take pictures, listen to music, use cell phones&#8212;or do much of anything at all with digital devices&#8212;they&#8217;re likely to be using a SanDisk memory card. That&#8217;s because, after 20 years in the business, SanDisk has never stopped innovating."}