{"asin": "B002USUMPI", "description": "Crank up the volume of your Zune HD or Zune player with the Altec Lansing inMotion IM414v2, a powerful portable stereo system that delivers anytime-anywhere listening enjoyment. Featuring twin bass-enhanced neodymium speakers and Audio Alignment technology, the IM414v2 delivers bold, crystal-clear sound. With a built-in FM radio, HD radio technology, and input jacks for CD, DVD, and MP3 players, the IM414v2 is a versatile must-have for your active audio lifestyle.The inMotion IM414v2At a Glance:Full-range stereo sound for Zune and Zune HDNeodymium speakers and Audio Alignment technology for outstanding full-bodied soundIncluded wireless remote and universal input jackBuilt-in FM radioPowerful, Amplified Zune PlaybackYour Zune HD or Zune player is cradled securely as the inMotion IM414v2 delivers a full range of crystal-clear sound. Utilizing Altec Lansing's proprietary Audio Alignment craftsmanship, the IM414v2 delivers a natural, balanced audio performance that lets you hear music the way artists intended. The system's twin neodymium speakers combine with surround effect and bass-enhanced technology to widen the stereo image and boost the bass without the need for a subwoofer. The inMotion IM414v2 immerses you in full-bodied sound--the way your Zune was meant to be heard.Listen to your Zune and Zune HD in full-range stereo sound.View larger.FM and HD Radio TechnologyThe \"Designed for Zune\" stamp means that the IM414v2 is engineered to enable the enhanced capabilities of the Zune HD player, including its HD radio. This allows you to enjoy the crisp, powerful sound of many local HD radio stations at no extra cost with Zune HD. And the IM414v2's built-in digital FM radio provides entertainment even when your Zune player is not handy.Compatibile with All Zune HD and Zune PlayersThe inMotion IM414v2 is compatible with the 4, 8, and 16 GB Scorpion, the 30 GB, the 80 and 120 GB Dragon, and the 16 and 32 GB Zune HD. The IM414v2's sleek black design features a docking station at its center, which securely cradles your Zune and recharges its battery. No additional setup or software is necessary--simply plug in your Zune, and it's ready to play.A Multipurpose Home Audio SystemIn addition to its Zune playback capabilities, the inMotion IM414v2 features an onboard FM radio with a built-in antenna. An included wireless remote gives you the freedom to listen to Zune or radio playback from anywhere in the house.The inMotion features a universal input jack that makes it compatible with a range of other media. Use the system to amplify the sound of your MP3 or CD player, or connect it to your DVD player to watch movies with pristine audio.The Altec Lansing inMotion IM414v2 is backed by a one-year manufacturer's limited warranty.About Audio AlignmentWhether it's the tiniest of earbuds or the most imposing of subwoofers, Altec Lansing has refined every detail of its speakers to provide you with the most accurate sound reproduction and quality. Audio Alignment ensures that the key audio components work together to deliver your music the way it is meant to be heard, offering the perfect balance of your speaker system's drivers, enclosure, and electronics. For 70 years, Altec Lansing has been refining this process, bringing your speakers to life with advanced technologies that make them sing.What's in the BoxIM414v2 digital speaker system, wireless remote, power supply, international plug set (international box only), user's guide, and quick connect instructions.The inMotion IM414v2 is great whether you have guests over or you're relaxing by yourself.", "title": "Altec Lansing inMotion Speaker Dock with FM Radio for Zune (Black)", "price": 7.99, "imUrl": "http://ecx.images-amazon.com/images/I/41-N%2BqdnUSL._SX300_.jpg", "related": {"also_viewed": ["B000VWOKQM", "B000XPG2YU", "B002I636XM", "B002JPITYS", "B002LUEQAC", "B002WB433U", "B002JPITY8"], "buy_after_viewing": ["B000VWOKQM", "B000XPG2YU", "B000VWPULQ", "B002I636XM"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}