{"asin": "B0050SZD18", "description": "Video games just feel bigger and better on a TV screen. Surround Sound. HD. A room full of friends. Console gaming isn&#x2019;t going anywhere, but console games aren&#x2019;t as much fun as they could be.That&#x2019;s why we made OUYA: a new kind of game console, to bring groundbreaking games to the television in an entirely new way.&#x201C;Who wouldn't want a beautiful piece of industrial design that sells for $99, plugs straight into your TV, and gives you access to a huge library of games?\" &#x2013; Jordan Mechner (creator of Prince of Persia, Karateka)Games Only on OUYAYou download OUYA games directly to your console -- no discs to buy or scratch.And the games on OUYA are made by some of the most inventive game developers in the business. Favorite franchises like Final Fantasy, brand new never-before-seen titles and hundreds of other games. Shooters, platformers, role-playing games, action games... You name it.And, best of all, every game on OUYA is free to try. You might end up investing in that coin doubler, buying the healing elixir that extends your life, or unlocking the full version of the game, but everything -- absolutely everything -- is free to try. We believe you shouldn&#x2019;t have to buy it unless you love it.Small... but PowerfulOUYA is about the size of a Rubik&#x2019;s cube, but it plays hard in full-screen HD. It uses an nVIDIA quad-core CPU and outputs via HDMI at up to a stunning 1080p resolution. It powers on instantly.Need more storage? No problem. Just plug in an external hard drive into the USB 2.0 port. Like to hardwire your Internet? That&#x2019;s cool. Jack into OUYA&#x2019;s high-speed ethernet port. WiFi works too. If you want to develop games, just plug your laptop into our micro-USB port -- anyone can release an OUYA game. And the hardware opens so you can customize it if that&#x2019;s your bag.We listen to our supporters, and try to evolve OUYA so it always gets better for them. When you buy OUYA, you become part of our effort to change how console gaming works.Additional RequirementsYou will need a valid credit, debit or prepaid retail card to download OUYA content. Your card will not be charged unless you choose to make a purchase. Though many games on OUYA will not require a purchase to unlock additional content or features, others may offer for purchase in-game products or additional features (like full versions or additional levels).OUYA... lovingly made by a team of gamers who believe that console games will never die.What&#x2019;s in the OUYA Box?&#x25CF; OUYA game console&#x25CF; OUYA wireless controller with removable faceplates&#x25CF; HDMI cable&#x25CF; Two AA batteries&#x25CF; Power adapter", "price": 99.99, "imUrl": "http://ecx.images-amazon.com/images/I/31TMkIcFQBL._SX300_.jpg", "related": {"also_bought": ["B002I0GX38", "B00812F7O8", "B00B9996LA", "B002B9XB0E", "B00FM5IS48", "B00FJRS6QY", "B009CMN3V0", "B003M0NURK", "B005FYNSZA", "B00FB5RBJM", "B002B9FIUU", "B00KVMHSUM", "B00CH643A8", "B00CX5P8FC", "B0034ZOAO0", "B00JO80LUI", "B00C6GLF78", "B004HKIB6E", "B00BWF5U0M", "B00000DMAX", "B00E3667XQ", "B00BB0ETW8", "B0044DEDCA", "B008L3UUPS", "B005DKZTMG", "B00KVMHVQ8", "B0049SCB2Y", "B004C4XNI6", "B000SEU92W", "B003L1ZYYM", "B00DU0ZI8Q", "B008YDUTRO", "B00BALK9CM", "B00L3LQ1FI", "B00DYQYIZU", "B00KWEHBAG", "B0015AARJI", "B004MRZGC4", "B002YVD3KM", "B009SQQF9C", "B00G1PNG54", "B00BGGDVOO", "B00BGAA3S2", "B00K308KF4", "B00840353W", "B00KAI3KW2", "B00DD0B0BM", "B008FO7PQA", "B00BGA9X9W", "B000HZFCT2", "B00F657TXA", "B00DR0PDNE"], "bought_together": ["B002I0GX38", "B00812F7O8"], "buy_after_viewing": ["B00KQQXDES", "B00CX5P8FC", "B00812F7O8", "B002I0GX38"]}, "salesRank": {"Video Games": 773}, "categories": [["Video Games", "More Systems"]]}