{"asin": "B0046RE21G", "description": "MiniStation Stealth USB 2.0 Portable Hard Drive with TurboPCHD-PCTU2High PerformanceCompact and Lightweight2X Faster than Competing DrivesMost Comprehensive Software Utility SuiteThe Buffalo MiniStation Stealth is a high performance portable storage solution in a remarkably compact and lightweight contemporary form.  Simply plug it into any available USB port on your PC or Mac&reg; computer and instantly add capacity or store files to take on the road. The MiniStation  Stealth&rsquo;s compact design occupies minimal space and it's USB powered so there are no additional cables to manage and no need for a separate power source.  Included with the Stealth is Buffalo&rsquo;s multi-purpose Buffalo Tools utility suite designed to enhance Windows&reg; PC performance and user experience. It  features TurboPC, a utility designed to enhance PC performance for up to 2X faster file transfers. Also included, Buffalo's Backup Utility protects  your important files and documents by backing up your PCs to your Buffalo external hard drive and it provides an easy-to-use data restore function.  Store, back up and transport your content instantly with plug and play connectivity.Compact and ConvenientDesigned for mobility, MiniStation Stealth&rsquo;s compact and contemporary design occupies minimal space and offers USB powered mobile storage for  your data and for your on-the-go lifestyle. Plus, the Stealth works with PC and Mac so you can access your files from whichever computer you are on.USB 2.0 powered connectionPreformatted in NTFSAttractive blue LED lets you know when the drive is activeTurboPCUsing high speed RAM on your PC, TurboPC can increase file transfer rates on Windows PCs by up to 2X over competing USB 2.0 portable hard drives.  TurboPC also includes TurboCopy which provides additional system adjustments to increase performance substantially.Back up and Manage Your Files with Buffalo Tools!Buffalo Tools is a feature-rich suite of optional software included on many Buffalo DriveStation and MiniStation storage products.  Any or all of the following components of Buffalo Tools may be installed on Windows PCs.Buffalo's Backup Utility:An easy-to-use and fully featured backup software for Windows PCs thatcan be used to back up one or multiple computers with a single Buffalo external hard drive.ECO Manager:Energy efficiency tool conserves energy and reduces battery consumption by regulating the power usage of the hard drive, cutting power to the drive during extended periods of inactivity.RAMDISK:A simple utility that allows you to create a RAM disk on your Windows PC, creating a small, but extremely fast environment to work on files in.SecureLock:Windows software that provides complete control of the data encryption on your Buffalo external hard drive, providing password protection and software data encryption.TurboPC:Performance enhancement utility providing up to 2x transfer speeds over regular USB 2.0 connectionsOther Key Features and BenefitsCompact and Lightweight:Super-slim, lightweight design saves space for ultimate portabilityTurboPC for Windows:Increase file transfer rates by up to 2X over competing USB 2.0 portable hard drivesConnect and Go:Preformatted hard drive is ready for immediate use with Windows and MacUSB Powered:Perfect companion for your laptop or netbook - No external power supply neededEco-Minded:Included ECO Manager conserves energy by cutting power to the hard drive during extended periods of inactivityTime Machine&reg; Compatibility:Works perfectly with Time Machine to back up your Mac computerThe MiniStation Stealth portable storage solution is backed by a one-year limited warranty and lifetime 24/7 US based technical support.What&rsquo;s in the BoxMiniStation Stealth Portable Hard Drive HD-PCTU2, USB 2.0 Cable, Quick Setup Guide, and Warranty Statement* TurboPC Performance Testing: Time to transfer 1,000 digital photos. Benchmark system: Intel Core i7 860 2.8GHz, DDR3 8GB, Intel P55, WD1600JS-00NCB1, Windows 7 (64-bit)Which Portable Hard Drive Is Right For You?Good&nbsp;Better&nbsp;Best&nbsp;JustStore PortableMiniStation CobaltMiniStation StealthMiniStation MetroMiniStation Cobalt USB 3.0Buffalo Portable Storage &amp; Backup SolutionsEssential storagefor basic needsStylish portable storagefor PC and MacCompact and lightweightstorage for PC and MacShock-proof feature richstorage for on-the-goSuperSpeed USB 3.0 portable storageSuperSpeed USB 3.0&nbsp;&nbsp;&nbsp;&nbsp;Integrated USB Cable Management&nbsp;&nbsp;&nbsp;&nbsp;Shock Absorption Technology&nbsp;&nbsp;&nbsp;&nbsp;Hardware Encryption Security&nbsp;&nbsp;&nbsp;&nbsp;Software Encryption Security&nbsp;&nbsp;Backup Software&nbsp;TurboPC Performance Booster(55% Faster)&nbsp;TurboUSB Performance Booster(25% Faster)&nbsp;&nbsp;&nbsp;&nbsp;Expand Your Data Capacity and Connectivity with Buffalo Storage and Networking Solutions", "title": "BUFFALO MiniStation Stealth 500 GB USB 2.0 Portable Hard Drive - HD-PCT500U2/B", "price": 49.99, "imUrl": "http://ecx.images-amazon.com/images/I/41H225FL72L._SY300_.jpg", "related": {"also_bought": ["B004MT7GGG", "B003WV5DMO", "B00D695IF4", "B003LSTD38", "B005J7YA64", "B003HHK576", "B0051UWCVO", "B0052L77QW", "B005J7YCHG", "B00D695GS8", "B009F1CWZ6", "B00834SJSK", "B004TS1J1I", "B0058TUZYY", "B0037NYQ6Q", "B006Y5UV4U", "B006Y5UV4A", "B00461G3MS", "B0088PUEPK", "B00C9TECFO", "B004TS1J18", "B005J7YA4G", "B005J7YAWI", "B003WIRFD2", "B00BWF5U0M", "B0037NYQ7K", "B008R7FC74", "B005J7YA3W", "B001UHWHO4", "B00829THO6", "B000XPMU1O", "B005J7YBOU", "B0041Q38NU", "B005CT56R6", "B0041Q38SA", "B003SX0ORA", "B0083B6HEQ", "B004LR1RPK", "B0049MPQA4", "B000VRZ7PA", "B003M0NURK", "B005J7YBRW", "B004HFMNGS", "B001R4BBL0", "B006W8U2WU", "B002G1YPHK", "B0009MIP8I", "B00461E7JE", "B004SUO1R6", "B0019804U8", "B0062FZ3PY", "B00EAS8AA0", "B00461K1QW", "B005YR0M0W", "B00834SJS0", "B007FQNLR6", "B00483WRZ6", "B004MU8VCS", "B002JQNXZC", "B003MTTJOY", "B002PY7P4I", "B001R4BT1M", "B00834SJU8", "B001QUA6RA", "B003CKC8W8", "B005CPGHAA", "B00200K1TS", "B002YIG9AQ", "B003WUBIZQ", "B002QEBMCI", "B000Q8UAWY", "B001TH7GUU", "B0036VO632", "B006W8U2MU", "B003YCOMG4", "B005FYNSZA"], "buy_after_viewing": ["B00D695IF4", "B00D695GS8", "B005J7YCHG", "B00E83X9P8"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]]}