{"asin": "B000NF6ZK6", "description": "Thanks to the sleek, low-profile styling by famed Italian car designer Pininfarina, the SimpleDrive Desktop USB 2.0 External Hard Drive isn't just another external hard drive. The recipient of the same magic design touch and attention to fine details that helped turn Ferrari and Maserati into icons of the automotive world, the SimpleDrive Desktop will help turn your work space into a virtual art display while offering you up to 320 GB of backup storage for your computer files..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The SimpleTech&reg; SimpleDriveTMoffers:Slick Ferrari-inspired design by Pininfarina.High-speed USB 2.0 interface for data transfer at up to 480 Mbps.Fabrik Ultimate BackupTMfor 2 GB of free secure online storage.1-year warranty.The SimpleDrive was designed Pininfarina of Ferrari fame.View larger.Ferrari-Inspired Low-Profile Design for your DeskGet used to the staring when your colleagues visit your desk. This compact and elegant sapphire blue drive is as much a piece of fine art as a piece of robust hardware. But don't let the looks fool you. Beneath its cool and sleek exterior is a robust, high-capacity, single-drive solution that gives you the ability to store and backup tons of music, videos, photos and documents in a small footprint.Featuring plug and play simplicity, and Mac and PC compatibility, the SimpleDrive Desktop features a hi-speed USB 2.0 interface for fast transfer of data at up to a 480 Mb/sec data transfer rate. Whether you want to increase the capacity of your desktop, or back up your valuable files quickly and securely, the SimpleDrive Desktop will perform for you with style. A built-in Kensington security lock lets you lock down your drive while you're away, and a built-in capacity meter keeps you abreast of your storage situation at all times.Powerful Local and Online Backup OptionsThe SimpleDrive Desktop includes two backup options that will keep your mind at ease about your important data. With the included OneClick backup software, you have the option of either backing up and protecting all your files and folders, or selected ones, with a single click, or automatically. Either way, you'll have the peace of mind knowing your digital world is safe and protected.But for the ultimate in protection, the SimpleDrive Desktop also offers the Fabrik Ultimate Backup solution that uploads your files to a secure, online server that will protect your data from real-world mishaps and offer near-real time protection without bogging down your computer. Fabrik's Ultimate Backup allows you to store up to 2 GB for free on one of its 448-bit encrypted servers, and for just a few dollars a month, you get unlimited capacity to securely store all of your important files and media collections offsite. Acting just like the drive's local backup software, you simply set Fabrik Ultimate Backup once, and it automatically and regularly backs up your content behind the scenes.The capacity meter shows you how much space is left at a quick glance.View larger.All backups, to the external drive or online service, are unobtrusive. Once your initial content has uploaded, the software performs incremental backups, so only the smallest amount of data that has been changed or modified in your files will be updated. (Although the SimpleDrive Desktop is both Mac and PC compatible, at this time the Fabrik Ultimate Backup solution is only available for Windows-based computers.)To keep your content private and confidential, all files are encrypted with 128-bit SSL encryption while in transit, with an option for a private encryption key. Fabrik's offsite 448-bit Blowfish encrypted servers are housed by a Fortune 500 company, ensuring file protection, security and peace of mind. So no matter what happens to your drive--a curious toddler, a spilled drink or natural disaster--your irreplaceable photos, music, videos and files will be safe and secure both offsite and online.The SimpleDrive Desktop measures a scant 1.50 x 8.25 x 5.0 (WxLxD), is backed by a 1-year warranty, and comes with free, unlimited technical support.What's in the Box3.5 SimpleDrive Desktop External Hard Drive with One-Click Backup Software, USB 2.0 Cable, AC Adapter, Resource CD, and Quick Install Guide.The SimpleDrive comes in different storage capacities for every need.", "title": "SimpleTech SimpleDrive SP-U35/320 320 GB USB 2.0 External Hard Drive (designed by Pininfarina)", "imUrl": "http://ecx.images-amazon.com/images/I/41cX3LVveML._SY300_.jpg", "related": {"also_viewed": ["B000VZCEUI"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]]}