{"asin": "B00008Z0HX", "description": "The President of the United States of America has been assassinated. You wake up on a desolate strip of New England beach. The near-fatal impact of a bullet has left your head pounding, and your memory erased. What's more, the number \"XIII\" has been mysteriously tattooed on your chest, while your pocket holds a key to a New York City bank box. Head swimming in amnesia, you struggle to your feet only to encounter more assailants intent on finishing the job. To your shock, you handle the hitmen with the killing skills of a professional--before heading to the bank in search of any shred of information about your lost identity and your involvement in the President's murder.What lies ahead is a deadly quest not only into your shadowy past, but America's darkest corridors of power.Features:The Ultimate Conspiracy.Unravel a whirling conspiracy plot where your identity, the President's assassination, and the future of America are shrouded in mystery.Unique Visual Style.Graphic novel presentation, flashback graphics, and pop-up windows create a groundbreaking entry into the genre. XIII marshals the power of Unreal II technology and unique comic book visual styles.Groundbreaking Gameplay.Experience a wide variety of gameplay--cunning use of human shields, silent weapons, and XIII's internal \"sixth sense\" that detects approaching enemies. To survive, you'll master techniques ranging from covert infiltration to heavy combat as you battle sinister conspiratorial forces.A Deadly Arsenal of Weapons.Handle a dizzying array of weapons, ranging from silent crossbows to precision sniper rifles, to furious automatic weapons, to chairs, bottles, ashtrays, shovels, and even enemy soldiers' bodies.A New Kind of Multiplayer.Square off against other PlayStation2, Xbox, and PC players in innovative multiplayer modes such as Barfight and the cooperative Cover Me, along with classic modes such as Capture the Flag and Deathmatch.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/519STPKSJRL._SY300_.jpg", "related": {"also_bought": ["B0000663TT", "B00005QX48", "B0000A4F0R", "B007BYWJ8Y", "B00007LVDR", "B000NUQQZ0", "B000R2QSTI"], "bought_together": ["B0000663TT"], "buy_after_viewing": ["B0000663TT", "B000093NQN", "B0000A4F0R"]}, "salesRank": {"Video Games": 33618}, "categories": [["Video Games", "PC", "Games"]]}