{"asin": "B000034DC2", "description": "The feisty little adolescent dragon is back in a sequel that is far superior to the  original. Both Spyro fans and those who didn't play the first game will revel in the  exploratory greatness that isSpyro: Ripto's Rage. Gone are the impossible tasks,  unbeatable enemies, and fragmented game flow. This game sports superior controls, more  colorful and faster graphics, a tighter story, achievable goals, and plenty of gameplay  variety.Don't be fooled by Spyro's cuteness--this isn't a kid's-only game. With multiple goals  and side quests, a fantastic soundtrack by ex-Police band member Stewart Copeland, and  a veneer of understated humor,Spyro: Ripto's Rageis highly addictive. The  playfulness of the main character comes through in the exploration of the otherworldly  levels using the new moves, including super high jumps, rapid underwater swimming,  and extended flight and hovering maneuvers.Determined explorers are always rewarded--sometimes with an ice hockey match or other  sub-game, sometimes with riches enough to learn a new move or uncover a new area.  Simply put,Spyro: Ripto's Rageis one of the best action/adventure games for the  system. Despite the fact that this game is a sequel, it manages to bring a fresh new look  and feel to PlayStation gaming.--Jeff YoungPros:Massive, fun levels are completely navigableCute and quirky sense of humor will appeal to all agesResponsive controls are an extension of Spyro's upbeat and exacting personalityCons:Camera angles can be problematic, but are completely adjustable", "price": 90.0, "imUrl": "http://ecx.images-amazon.com/images/I/61Q98YP16YL._SY300_.jpg", "related": {"also_bought": ["B00004U4R9", "B00000I1BF", "B00000DMAR", "B00000I1BR", "B00000I1BQ", "B0015MMN6G", "B0045L3SNQ", "B00006F2ZP", "B000034DCF", "B0001CJCG0", "B000K6TOK6", "B000TTXL9E", "B000ECX0FQ", "B000637T7S", "B00004U4R8", "B00005MA97", "B00004XOWT", "B00000JNHJ", "B0018YDKB8", "B000PWAAAI", "B00005NCCI", "B001TEYMRI", "B000TLU67W", "B00000I1BS", "B00005R5PO", "B00001QHW9", "B00001QER9", "B000029706", "B000066TS5", "B00001ZWXH", "B0000C7GHG", "B00006F2EP", "B00004YRQA", "B001MW91IW", "B00004YRQ9", "B00004TBGT", "B0015IXKSK", "B000GACEHQ", "B0013JHKU0", "B00005NGLA", "B0007KTBB2", "9629971372", "B0009A4EVM", "B00008NRM7", "B0062DIGA0", "B0013KW1B2", "B0018YDKAY", "B0009F3E1I", "B00001XDK5", "B00127VDVK", "0761526668", "B00000JQQH", "B007UHQO6A", "B0007KTBG2", "B0032GTMEE", "B00005NGLC", "B00002STKH", "B000021Y5T", "B0000690ZE", "B00006LEMY", "B00005NN7B", "B00004SPYF", "B00001QED2", "B00005Y402", "B0001CJEJU", "B00006FWUT", "B00000IG7T", "B00005NCAY", "B000SEU92W"], "buy_after_viewing": ["B00000I1BF", "B00004U4R9", "B00006F2ZP", "B0045L3SNQ"]}, "salesRank": {"Video Games": 2649}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "More Systems", "PlayStation", "Games"]]}