{"asin": "B001D8TQ44", "description": "Dead Rising: Chop 'Til You Drop follows the harrowing tale of Frank West, an overly zealous freelance journalist on a hunt for the scoop of a lifetime. In pursuit of a juicy lead, he makes his way to the small suburban town of Willamette only to find that it has become overrun by zombies. Frank escapes to the local shopping mall, thinking it will be a bastion of safety but it turns out to be anything but. It will be a true struggle to survive the endless stream of enemies, but players will have full reign of a realistic shopping center and its varied stores offering an endless supply of real and makeshift weapons to fight off the flesh-hungry mob. If Frank is running low on health he can pay a visit to one of the many restaurants or cafes for a meal in order to restore his energy and continue the fight. It's a brutal fight, but with no end in sight to this zombie onslaught, Frank bides his time by messing around with a variety of comedic costumes and making use of improvised and sometimes highly ineffective weapons such as a toy sword or a football. Grab environmental objects like umbrellas and benches to use as improvised weapons Snatch items from different stores to use as weapons including golf clubs, lawnmowers, frying pans and more Consume food and drink to revive health.Surviving the Mall CrowdsView larger.Huge hoards of hungry zombiesView larger.Zombies are not the only issueView larger.The StoryWhen you go to the mall, you know what to expect: shoppers, chain stores and ambient music. But when Frank West ducks into the Willamette Park View Mall, what he finds is something very different: a horde of rampaging zombies. Over the course of 72 hours, Frank must determine what has turned the residents of Willamette into the flesh-starved undead, all while fighting off the zombies' advances. Will he be able to escape this former retail oasis with his life intact?Key Game Features:Seek refuge in a shopping mall overrun with hordes of zombiesNavigate the mall with the help of NPCs and gather objects to aid in your survival, whether for food or defenseSearch the mall for survivors and rescue them from the zombiesUse virtually anything as a weapon, from circular saws to laser swords to lawnmowers, and control them with your Wii RemoteDocument the zombie infestation with your camera, taking photos to earn points and new itemsGet to the bottom of the mystery before the zombies can overcome your defensesIt's a Zombie Infestation!Dead Rising: Chop Till You Drop takes you on a deliciously gory chopping spree in a shopping mall run amok. Scour the mall for other survivors of the zombie infestation, and use the resources at your disposal to fortify yourself against attack, whether that means gathering food or amassing unusual weapons. Use your Wii Remote to help you swing a bat, brandish a chainsaw, hurl a bowling ball and use other objects found around the mall as weapons to fight off the encroaching zombies. Keep a level head &mdash; and keep your head, period &mdash; as you fight for your life and try to solve the mystery behind the town's peculiar transformation before it's too late.", "price": 39.99, "imUrl": "http://ecx.images-amazon.com/images/I/51JYAXuXAeL._SY300_.jpg", "related": {"also_bought": ["B000X2RKOO", "B001SI39E2", "B003WOFXEY", "B00503E9UO", "B001RERN30", "B004L5SJ5I", "B0034JKYOG", "B000RF7164", "B001TOMR0C", "B001CU4EMW", "B000ZK6946", "B0037M2SOY", "B001P2IS3I", "B004LM36HW", "B000QAXZYW", "B000WQ1UME", "B000G7PMX2", "B005FJ8OJU", "B002BHSPXO", "B000G7T7JC", "B0024MJ8XC", "B003XDRIYC", "B000ME5B44", "B0030GBU8W", "B002PK7IB2", "B001HKPUKC", "B002BRYXOO", "B000VB800A", "B000N60GTG", "B000F3AADE", "B001AWFIPO", "B002HGE308", "B002EE5SAC", "B000GQ1NK4", "B0030F1DQC", "B004EDJNU2", "B003XLUJ86", "B004I6KDA4", "B003V63V1A", "B002D2Y3IS", "B004C34D2M", "B005FJ8OJ0", "B000RHXD1O", "B004BCXOVU", "B000MUSG4U", "B004WLRQMI", "B0038N9WWI", "B003ESHRVA", "B001BM7A5Y", "B002BSC4ZS", "B007MZUFV0", "B002BSA388", "B000XJD348", "B004FRVDUU", "B001COVME6", "B0040ZTFWK", "B002GEKIOG", "B0088AJQ9A"], "buy_after_viewing": ["B001SI39E2", "B00503E9UO", "B000F3AADE"]}, "salesRank": {"Video Games": 6178}, "categories": [["Video Games", "Wii", "Games"]]}