{"asin": "B00067OF80", "description": "Both serious music fans and professional DJs--in fact, anyone who practically lives with a pair of headphones wrapped around his or her ears--will delight in the Sennheiser EH-150 hi-fi stereo phones. Suitable for professional monitoring applications but also appropriate for casual use, the phones' closed, supra-aural design delivers a superbly natural sound while blocking out ambient noise. The spatial sound reproduction lets listeners accurately hear even the subtlest tones in noisy environments--an ideal feature for clubs or studios. The noise-dampening function also makes the EH-150 a great choice for airplane, train, or bus travel, as the listener won't grow distracted by the roar of combustible engines. The phones owe their audio performance to the \"turbine\" embossed diaphragms, powerful neodymium magnets, and foam damping elements, which combine to ensure strong bass, well-defined mid ranges, and precise treble. In addition, the EH-150 phones are remarkably comfortable, with lightweight diaphragms and soft leatherette ear pads that feel snug whether you're entering the first or ninth hour of use. Additional features include a highly conductive OFC copper cable and a 1/4-inch adapter that fits atop the 3.5 mm stereo plug. The cable measures an impressive 10-feet long, giving listeners greater freedom of movement while still staying connected to the receiver.What's in the BoxEH-150 headphones, 10-foot copper cable, 1/4-inch adapter, user's manual.", "title": "Sennheiser EH-150 Dynamic Sound Evolution Hi-Fi Stereo Headphones (Discontinued by Manufacturer)", "price": 22.55, "imUrl": "http://ecx.images-amazon.com/images/I/41NHWT6Y61L._SY300_.jpg", "related": {"also_viewed": ["B003LPTAYI", "B000065BPB", "B003LRN53I", "B000065BP9", "B002DGTGO0", "B005N8W1MO", "B0001FTVDG", "B0042A68R8", "B0065VKQ34", "B005N8W214", "B0007XJSQC", "B002DGTGNG", "B0001FTVE0", "B005N8W1TM", "B004FEEY9A", "B003LPTAZ2", "B004H1SBK4", "B009SFASAA", "B0013OWPV4", "B000E6G9RI", "B0007N55NW", "B002GHIPYI", "B003V9RWEO", "B0013P3ZOE", "B002DP1FTU", "B001UE6I0G", "B0042A8CW2", "B00004SY4H", "B005SNPTRS", "B002VPDOH8", "B00972M942", "B00067OEPO", "B003LPTB4M", "B00HB3L8T6", "B00AZZNXOK", "B000ZJZ7OA", "B00BB7MS2Y", "B0094R4150", "B003ZLCAW2", "B00007E7C8", "B00HVLUQW8", "B008FWB9XW", "B0007QN180", "B001B1QENY", "B006V386UG", "B005N8W1EW", "B003ZUXX3S", "B005N8W16U", "B000TDXPSC", "B002DP8IEK", "B000AJIF4E", "B002DGTGNQ", "B00FC2R7ZC", "B0028N78J8", "B001RNO8ZW", "B00018MSNI", "B00067OEPE", "B007BY3PO6", "B00A8LZ5GU"], "buy_after_viewing": ["B003LPTAYI", "B0007XJSQC", "B000065BPB", "B000065BPB", "B00007E7C8"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]]}