{"asin": "B001G5Z82I", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]], "description": "Experience sound quality that's rich enough to satisfy your in-home tastes in a form factor compact enough to take with you. Logitech's Pure-Fi Anywhere 2 combines 2-inch active and 3-inch pressure drivers for crystal-clear sound and surprisingly deep bass. Take it with you to school, work, or the park. Stow the speakers, AC adapter, and remote in the included travel case. The speakers include a built-in, rechargeable battery--with a battery life indicator--that lasts for 10 hours on a single charge. Take it anywhere in the world; the AC adapter works on most electrical power grids worldwide.The 2-inch Max-X active, high-excursion drivers with neodymium magnets give you full, balanced audio, while the 3-inch pressure drivers maximize bass response and minimize distortions. The StereoXL technology widens the sound stage beyond the physical boundaries of the speaker. Works with all iPods and iPhones (uses the new Apple Universal Dock Adapter specification).10-hour Rechargeable BatteryNever worry about buying or replacing batteries.Battery Life IndicatorKnow when you need to recharge.Browse and Control iPod with Wireless RemoteAbility to navigate through the iPod menu and change what is playing on your iPod.Protective Travel CaseHolds the speaker, remote, and AC adapter--as well as an iPod nano--in a single, compact, easy-to-carry package.Check Out Other Stylish iPod and MP3 Logitech SpeakersLogitech Pure-Fi Dream Speaker for iPod and iPhoneIt's the ideal music system for the bedroom. With a built-in alarm clock and backlit controls that light up with a wave of your hand, the Pure-Fi Dream brings clear, rich sound to your room.Logitech Pure-Fi Express Plus Omnidirectional Speaker Dock for iPod and iPhoneThe Pure-Fi Express Plus speaker dock features omnidirectional acoustic technology, which provides great sound at a consistent level, throughout the room.Logitech Pure-Fi Anytime Premium Alarm Clock for iPod and iPhoneThe Logitech Pure-Fi Anytime is an iPod/iPhone alarm clock that offers premium sound with innovative features that make it the perfect nightstand companion.Logitech mm32 Portable SpeakersEnjoy high-quality portable sound for your iPod, Zune, or other MP3 player--anywhere you go. And the cradle design makes it easy to recharge while you listen.System SpecificationsSupports iPhone and all iPod models with a 10-pin dock connector. The system supports older iPods (classic 1G, 2G, and 3G models), as well as other portable music players, via a 3.5-mm auxiliary input. Also, the system uses Apple's Universal Dock specification.What's in the BoxLogitech Pure-Fi Anywhere 2 speaker system (black), international voltage AC power adapter, advanced wireless remote, protective travel case, universal Dock adapters, quick-start guide, and 2-year limited warranty.", "title": "Logitech Pure-Fi Anywhere 2 Compact Docking Speakers for iPod and iPhone (Black)", "price": 69.49, "imUrl": "http://ecx.images-amazon.com/images/I/418ZUM%2BJM3L._SX300_.jpg", "brand": "Logitech", "related": {"also_bought": ["B005PWK31Y", "B007M3U1GG", "B007404P50", "B003VANOI6", "B001FWXDZQ", "B002L6HDQA"], "bought_together": ["B005PWK31Y", "B007M3U1GG"], "buy_after_viewing": ["B003VANOI6", "B007404P50", "B005PWK31Y", "B003SX0NG2"]}}