{"asin": "B000V2DLJO", "related": {"also_bought": ["B00L3T1GO6", "B000V2J3ZA", "B00LCSLHPG", "B00LBEJOKG", "B005OLQJGE"], "also_viewed": ["B00LCSLHPG", "B00L3T1GO6", "B000ENU8PK", "B009ND81NS", "B000V2J3ZA", "B004Q8GYES", "B000MANVXG", "B000V2J3ZK", "B000F0GNT2", "B00LD8P2XS", "B005OLPS0W", "B00CYA5E1O", "B00HJRN9NW", "B00GGZRC22", "B00KAC5NTQ", "B004V0SZNO", "B00G88E9DC", "B001SERK9G", "B000F63TW0", "B005OLRDFK", "B00GBXIJFI", "B00KM6ZH00", "B009GIOVLQ", "B00GGXFJ7O", "B004AC6UMG", "B006HT0AK8", "B004NJ8WFO", "B00DQ5R8XI", "B00CNWY1YY", "B00L3T1KT2", "B00FRJKBFI", "B005ZA6K8Q", "B001MURXP2", "B00B2FXLSA", "B00JXMB1EK", "B00GV25KVK", "B000BI3Q20", "B002RG2KIU", "B003N4PN3Y", "B0012BYBG0", "B00CKDEIVC", "B00EQ2HGSC", "B004LE0YW0", "B007VOJJ8C", "B006U1WT66", "B004BASKAC", "B002BWOY02", "B00HNSSPDG", "B00I56ZB2I", "B005LGB0VQ", "B00DLPO6TC"], "bought_together": ["B000V2J3ZA"]}, "title": "Neutrogena Healthy Skin Rejuvenator, The Anti-Aging Power Treatment Kit", "price": 39.99, "salesRank": {"Beauty": 66660}, "imUrl": "http://ecx.images-amazon.com/images/I/31YU1KRKh8L.jpg", "brand": "Neutrogena", "categories": [["Beauty", "Skin Care", "Face", "Sets & Kits"]], "description": ".caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; }The Neutrogena Healthy Skin Rejuvenator Kit reveals noticeably softer skin today for younger looking skin tomorrow. Massaging your skin with the system applicator, this kit delivers the perfect degree of gentle exfoliation with single-use puffs. More effective than professional microdermabrasion, this skin rejuvenator is gentle enough that you can use it up to three times a week.The Rejuvenator Kit reveals noticeably softer skin today for younger looking skin tomorrow.View larger.Single-use rejuvenating puffs are packed with ultra-fine crystals.View larger.Better Skin In Four Easy StepsThis ultimate anti-aging power treatment couldn't be simpler to use. Packed with ultra-fine crystals and mild purifiers, the single-use rejuvenating puffs attach to the attachment head with the blue side facing up. Secure puffs to the head by pressing with your thumb and then wet them thoroughly. Once you snap the attachment head to the system applicator, you're ready to massage each facial area for one to two minutes.The massaging micro-vibrations boost microcirculation and oxygenation for increased radiance, while surface stimulation increases cell turnover. When you're done, fully rinse your face and dispose of the puff, but be sure to keep the attachment head.More Effective Than Professional TreatmentsDermatologist clinical studies have shown the Neutrogena Healthy Skin Rejuvenator helps reduce multiple signs of aging. In addition to helping maintain softer and firmer skin, it decreases pore size, wrinkles, and age spots. Gentle enough to use up to three times a week, this system is more effective than professional microdermabrasion because it allows you to continually build on the benefits of your last treatment. The battery-powered applicator requires two AA batteries (included).The rejuvenator system is more effective than professional microdermabrasion because it allows you to continually build on the benefits of your last treatment.What's in the BoxMicrodermabrasion applicator, 12 rejuvenating puffs, attachment head, and 2 AA batteries."}