{"asin": "B00149IL9I", "description": "Don't know about art but you know what you like? Whether you are a master of the brush or a finger painting fool, just say no way to gray and join with de Blob and his pals as they launch a color revolution on the Nintendo Wii gaming console. A mischievous and unlikely hero, only de Blob can flip, bounce and smash his way past the all-powerful I.N.K.T. Corporation to ignite a revolution and save Chroma City from a future without color.Join the revolutionde Blob dripping with green.View larger.Hopping around in Chroma.View larger.Prof leads the 'Color Revolution'.View larger.de Blob running out of paint.View larger.Battle against massive tank battalions, speedy I.N.K.T. racers and elite Inky soldiers on your quest to free the citizens of Chroma City. Avoid hot plates, electric shocks and inky turrets to create your own path to the impenetrable I.N.K.T. Fortress. Just remember that the struggle to reclaim Chroma City is to be fought on your terms. Remix the city in your own image using custom paints, patterns and soundtracks. Super-size your blob to attack larger and stronger enemies. Join the Color Revolutionaries to refine your skills while making a mess. The race to rescue Chroma City has just begun, and only de Blob can save the world from a black-and-white future.Gameplay: de Blob's Primary Goalde Blobis a 3D platformer where players use the Wii Remote/Nunchuck combo to maneuver their hero, de Blob. Equal parts amorphous blob of paint, struggling artist, revolutionary and juvenile delinquent, de Blob's goal is to replace the drab, lifeless gray coloring that the I.N.K.T. Corporation has imposed on Chroma City and its inhabitants, the Raydians, with a range of vibrant life-giving colors, all the while avoiding and battling the gray-clad forces of the Inkies.Players must acquire paint and hurl de Blob at the buildings, walls, statues, roads and skies above Chroma City. As de Blob bounces around, adding color wherever he lands, his supply of paint is depleted and he begins to dry out. As this happens players must collect more paint and rehydrate in pools and in front of hydrants scattered across the city. As the game starts access is limited to the colors red, blue and yellow, but these can be blended to create a number of other colors. Being able to create and apply these colors becomes important as Chroma City and its inhabitants come to life, and de Blob makes contact with a range of other characters known as the 'Color Revolutionaries' and receives an increasing amount of missions that charge him with splattering color all over town. Success at these mission gains the player point which drives the game forward, eventually leading to a direct assault on Comrade Black's I.N.K.T. fortress guarded by elite Inky soldiers and massive ink turrets.Key Game Features:de Blob- Flip, bounce and paint your way past the all-powerful I.N.K.T. Corporation to launch a revolution and save Chroma City from a future without vibrant color.Long Live Color!- Join the Color Revolutionaries in the resistance against the evil Comrade Black and his diabolical array of hot plates, electric shocks, and ink turrets.Free the Citizens- Free your friends from a black and white world by dodging ink cannons, flattening I.N.K.T. tanks and outsmarting Inky soldiers.Save your City- Remix Chroma City&rsquo;s towering skyscrapers, expansive bridges and massive landmarks in your own style using custom paints, patterns and soundtracks.Make a Mess- Super-size your blob as you splash, spray, and splatter everything you touch in sprint, race and combat challenges.Multiplayer- Compete for control as ink levels rise and wind cannons fire in eight multiplayer-specific gameplay modes.Plenty of Play Modesde Blobfeatures both a deep story-driven singleplayer mode where players get to dig into the Raydian's struggle against all-powerful I.N.K.T. Corporation, as well as a diverse range of multiplayer options. These multiplayer campaigns support up to four players, come with street and sewer maps and include four player split-screen functionality. Just a few of the multiplayer campaigns include:Paint Match- Paint as many buildings as possible and steal points from opponents by re-painting the buildings that they've already covered.Blob on the Run- A variation of 'Capture the Flag,' in this mode only one blob can paint and is pursued by opponents who attempt to slam him into submission and gain the ability to paint and accumulate points themselves.Blob Race- In this mode buildings can only be painted once and are indicated by in-game arrow. With time limited it's a race not only to paint the town but also to keep opponents from doing the same.", "price": 18.99, "imUrl": "http://ecx.images-amazon.com/images/I/51rRPLtfVuL._SY300_.jpg", "related": {"also_bought": ["B003S2SQCQ", "B000JV78XC", "B0017WHQ34", "B000NKRJAG", "B0058CA4S8", "B003JD7QYI", "B003ZCH7DI", "B002FG9MWE", "B000YDIYFG", "B000P297ES", "B001TOMQVM", "B002EE7OKE", "B001TERJD2", "B006L1FAK2", "B002BUQFQA", "B002I0GEXM", "B000R3BNHE", "B0050SVFB0", "B003S2MXNE", "B000NNDN1M", "B003ZHMMEM", "B003M31RN6", "B005EHQJ2C", "B002I0IIPY", "B000XZZ8C2", "B0016OVBG6", "B0050SVGXM", "B001KRPU4S", "B001PU8MVS", "B003M986XE", "B000GHLBUA", "B001TOMQZS", "B007MM9E42", "B000GEDN5E", "B000GJ0J24", "B00282WKEW", "B001TOQ8OI", "B000R39ISA", "B00KWFY04A", "B000RWV17M", "B005FYJA52", "B008GFZV6Y", "B000HE9LL8", "B004FEI752", "B0039QWK0A", "B00I5LMSE2", "B000N0WBMM", "B002BSA388", "B003S2JIBY", "B00166PY5I", "B001C58T46", "B001DO3NEW", "B003WFLGL2", "B001MT4EWI", "B0050SVGW8", "B006JSY5EY", "B00139YHNI", "B001FEO74U", "B000ZK6946", "B002BRZ9G0"], "bought_together": ["B003S2SQCQ", "B003ZCH7DI"], "buy_after_viewing": ["B003S2SQCQ", "B003ZCH7DI", "B0017WHQ34", "B001TOMQZS"]}, "salesRank": {"Video Games": 8871}, "categories": [["Video Games", "Kids & Family", "Wii", "Games"], ["Video Games", "Wii", "Games"]]}