{"asin": "B004J6GMLM", "description": "Buffalo Technology MiniStation Stealth USB 3.0 Portable Hard Drive HD-PCTU3 (Black)MiniStation&trade; Stealth HD-PCTU3SuperSpeed USB 3.0High PerformanceCompact and Lightweight3X Faster than Competing DrivesMost Comprehensive Software Utility SuiteThe Buffalo MiniStation Stealth USB 3.0 is a high performance portable storage solution in a remarkably compact and lightweight contemporary form. With USB 3.0 support and backward compatibility with USB 2.0, MiniStation Stealth USB 3.0 works with nearly any PC or Mac&reg; and provides interface speeds up to five gigabits per second. Simply plug it into any available USB port on your PC or Mac&reg; computer and instantly add capacity or store files to take on the road. The MiniStation Stealth&rsquo;s compact design occupies minimal space and its USB powered so there are no additional cables to manage and no need for a separate power source. Included with the Stealth is Buffalo&rsquo;s multi-purpose Buffalo Tools utility suite designed to enhance Windows&reg; PC performance and user experience. It features TurboPC, a utility designed to enhance PC performance for up to 3X faster file transfers. Also included, Buffalo's Backup Utility protects your important files and documents by backing up your PCs to your Buffalo external hard drive and it provides an easy-to-use data restore function. Store, back up and transport your content with SuperSpeed USB 3.0 plug and play connectivity.Compact and ConvenientDesigned for mobility, MiniStation Stealth&rsquo;s compact and contemporary design occupies minimal space and offers USB powered mobile storage for your data and for your on-the-go lifestyle. Plus, the Stealth works with PC and Mac&reg; so you can access your files from whichever computer you are on.USB 3.0 powered connectionBackward compatible with USB 2.0 for use with nearly any computerPreformatted in FAT32 for compatibility with both PC and Mac - easily reformatted to NTFS or HFS+Attractive blue LED lets you know when the drive is active&nbsp;", "title": "BUFFALO MiniStation Stealth 500 GB USB 3.0 Portable Hard Drive - HD-PCT500U3/B", "price": 49.99, "imUrl": "http://ecx.images-amazon.com/images/I/41TZ9tpVmRL._SY300_.jpg", "related": {"also_viewed": ["B00D695IF4", "B0046RE21G", "B0051UWCVO", "B00D695GS8", "B00D695HU0", "B00822GHEQ", "B0062FZ3PY", "B00B7MZD8E", "B00834SJSK", "B005EWTL7C", "B005MEBYB8", "B00A3U8JV4", "B005EJLFVK", "B005MEDKO2", "B005J7YCHG", "B00BOHNYTW", "B001HO59WM", "B008R7FC74", "B004Z0S7K6", "B0053ORUS8", "B00829THO6", "B005J7YA4G", "B00CGUMSWA", "B00BOHNZ0A", "B005J7YA64", "B00BUMXO3C", "B00CSFCYFY", "B0051UWCH8", "B00H4XH5FY", "B00B4OCYQY", "B00DR8LAE2", "B00JSQV44S", "B00AQRUW4Q", "B005J7YA3W", "B00829TIEU", "B00B4OCYSM", "B0062FZ2WS", "B006B9B2PQ", "B00AO5LNP2", "B009T0FGRE", "B005J7YBRW", "B006Y5UV4U", "B00834SJNA", "B00829THSW", "B00H4XH586", "B007FQNLOY", "B00E83X9P8", "B007FQNLR6", "B00B4OCWE8", "B00A2WV5Z0", "B00BMQ3LKM", "B009F1CXI2", "B00ILALU9G", "B006Y5UV4A", "B005MECL24", "B00BOHNYU6"], "buy_after_viewing": ["B00D695IF4", "B0051UWCVO", "B0046RE21G", "B00E83X9P8"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]]}