{"asin": "B005HSDL4M", "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS", "Trucking GPS"]], "description": "n&uuml;vi 50 delivers you safely wherever life takes you. Designed to makenavigation easy, simply enter an address and premium features including lane assist with junction view, help you make all the right turns!With a big 5&rdquo; (12.7 cm) touchscreen, more than 8 million points of  interest (POIs) and spoken turn-by-turn directions, n&uuml;vi 50 makes  driving fun again.Get Turn-by-Turn Directionsn&uuml;vi 50's intuitive interface greets you with two simple choices:  \"Where To?\" and \"View Map.\" Touch the screen to easily look up addresses  and services and to be guided to your destination with voice-prompted,  turn-by-turn directions that speak street names. It comes preloaded with maps for the 49 States and Canada.  n&uuml;vi 50&rsquo;s speed limit indicator shows you how fast you can go on most  major roads. With its \"Where Am I?\" emergency locator, you always know  your location. It also comes preloaded with millions of POIs and offers  the ability to add your own.Know the Lane Before It&rsquo;s Too LateNow there&rsquo;s no more guessing which lane you need to be in to make an  upcoming turn. Available in select metropolitan areas, lane assist with  junction view guides you to the correct lane for an approaching turn or  exit, making unfamiliar intersections and exits easy to navigate. It  realistically displays road signs and junctions on your route along with  arrows that indicate the proper lane for navigation.What's in the Boxnu&#x308;vi 50, preloaded NAVTEQ  North America maps, vehicle  suction cup mount, vehicle power  cable, and quick start manualCompare all Garmin n&uuml;visClick the button below to compare by series, user type, and features.All n&uuml;vis come with detailed NAVTEQ maps containing more than 6 million pre-loaded point of interest locations.", "title": "Garmin n&uuml;vi 50 5-Inch Portable GPS Navigator(US and Canada)", "price": 131.35, "imUrl": "http://ecx.images-amazon.com/images/I/51CqREu9ByL._SY300_.jpg", "brand": "Garmin", "related": {"also_viewed": ["B0057OCDQS", "B005DIBHCE", "B00AY7NUYC", "B00AY7NSX0", "B00AY7NV0K", "B00AY7NUW4", "B0057OCS9A", "B00AXZWG8Q", "B00AXX0IEC", "B00AY7NT2U", "B00AXZY42W", "B005DIBHA6", "B00AY7NSTY", "B00GD7DCW2", "B00HEGP42C", "B00AXX0I7Y", "B00HEGP44U", "B00AXX0I88", "B006SOLIV2", "B0057ODG6Y", "B0057ODOCA", "B00HEGP332", "B00HEGP45Y", "B00AXX0JP0", "B003ZX8B3W", "B00AXX0JNW", "B003ZX8B2S", "B004MYFTF6", "B003ZX871I", "B004MYFTEW", "B00HEGP40E", "B0091C1840", "B00HEGP2VK", "B007M4Z6FG", "B007M4Z7GO", "B00AXX0I6A", "B00BHAC85W", "B007M4Z60Q", "B006SOLITY", "B00407238G", "B00AJXMWP4", "B00A8TH83A", "B007PPYXOC", "B000LRMS66", "B005DIBH6A", "B00AXX0IC4", "B0015EWMX8", "B003ZHVBQM", "B00AXX0JOQ", "B00A7LULA6", "B00HEGP33C", "B005DIBH4M", "B007M52QEE", "B00A5ZFSZM", "B004MYFTFQ", "B007M52QR6"], "bought_together": ["B002OL2MU4", "B004I5BUSO"], "buy_after_viewing": ["B0057OCDQS", "B004I5BUSO", "B005DIBHCE", "B002OL2MU4"]}}