{"asin": "B003HFCDLY", "categories": [["Electronics", "Computers & Accessories", "Monitors"]], "description": ", incredible picture quality. ViewSonic&rsquo;s VX2250wm-LED features a mercury free LED backlight 22&rdquo; (21.5&rdquo; Vis) widescreen display with up to 40% energy savings compared to traditional CCFL backlit LCD monitors. The VX2250wm-LED offers Full HD 1920x1080 resolution, 5ms response time, an incredible 10,000,000:1 MEGA Dynamic Contrast Ratio, digital and analog inputs and integrated stereo speakers. Ideal for both the home and office with its piano black finish, the VX2250wm-LED is an elegant fit to any d&eacute;cor. Should you choose to mount the display, it can be mounted on a VESA compliant stand or wall mount bracket. Another great feature is the display&rsquo;s automatic aspect ratio adjustment, that allows inputs from 4:3 signals to be accurately represented in the center without stretching. Combined with a 3 year limited warranty, an industry best pixel performance policy and Windows 7 certification, the VX2250wm-LED is a great long term investment for any display user.Key Features:22-Inch (21.5-Inch Vis.) LED monitor with a sleek design and great power savingsUp to 40% power savings over a traditional CCFL 22&rdquo; monitor1080p Full HD resolution with 16:9 aspect ratio for perfect image reproductionDVI and VGA inputs for diverse connectivity optionsIntegrated stereo speakers for multimedia experience100mm x 100mm VESA compliant for wall mount or monitor standsHighest grade panel with the best pixel performance policy in the industryWhat is a LED monitor?The term &ldquo;LED monitor&rdquo; generally refers to a monitor with a LCD panel and a LED backlight. A typical LCD monitor uses cold cathode fluorescent lamps (CCFL) as a light source to illuminate the LCD panel. In an LED backlight monitor, white LEDs (Light Emitting Diodes) are used as the light source.  LED backlights provide the following benefits:About 40% less power consumption compared to traditional CCFL monitor10,000,000:1 MEGA Contrast Ratiomercury-free backlightLow EMI (Electro Magnetic Interference)Slimmer designWeight reductionCold Cathode Fluorescent LampLED: Light Emitting DiodeSave cash and save the planetWith its mercury free backlight and low energy consumption, the Energy Star 5.0 certified VX2250wm-LED is not only  but also friendly on your electricity bill as well. This can add up to thousands of dollars saved for large install bases, such as big corporate buildings or schools, the savings can be as dramatic as $20,000 in five years!MEGA dynamic contrast ratioOne of the great features of VX2250wm-LED is its ability to dim the backlight completely for pure darkness during dark scenes such as a night shot in a movie. Contrast ratios refer to the ratio of the brightest color to the darkest color. With traditional CCFL backlit displays, contrast ratios are limited to the fluorescent lamp&rsquo;s ability to dim in order to reproduce darkness. However, with the LED backlight, each LED has the ability to completely shut off allowing for a near infinite ratio of black to white contrast. The end result is true blacks that result in greater overall image quality.Pair it with a ViewSonic or Mac computerOne of the key advantages of the VX2250wm-LED monitor is its diverse connectivity options, making it flexible to be paired with a PC or a Mac computer. ViewSonic has recently announced a full line of PC products, including notebooks, netbooks, PC Minis and all-in-one PCs. Now you can hook up a Viewsonic ViewBook notebook or a PC Mini as well as a MacBook or a Mac Mini to the VX2250wm-LED and enjoy a full 22\" (21.5\" Vis) widescreen with LED backlight!", "title": "ViewSonic VX2250WM-LED 22-Inch (21.5-Inch Vis) Widescreen Full HD 1080p LED Monitor with Integrated Stereo Speakers", "price": 136.99, "salesRank": {"Computers & Accessories": 1174}, "imUrl": "http://ecx.images-amazon.com/images/I/51Mh5rA4T4L._SX300_.jpg", "related": {"also_bought": ["B00EZSUWFG", "B00D78QCYK", "B00EZSUVHK", "B001TH7T2U", "B00D601UC8", "B003VANO7C", "B005HPSFWI", "B00AGQ4WHA", "B003VAHYNC", "B0013TZRUA", "B007BZ1092", "B003NREDC8", "B007476KRY", "B0080K6WIG", "B00AV4NXFY", "B0036ISPSW", "B007Y8EVH4", "B002TLTGM6", "B008A3KFB8", "B0000BVYT3", "B009SPWJ98", "B003VAGXZC", "B00BP5KOPA", "B0085MPDCU", "B004SUO1QM", "B005DLDTAE", "B008RM235I", "B004SUO3VK", "B0036E8V08", "B00C5H5DN0", "B00H09BOXQ", "B0085MQL3K", "B009F1HUMQ", "B0026RKUBY", "B0019804U8", "B003NR57BY", "B000A6PPOK", "B007RB1O0K", "B00ATZ9QMO", "B0000AAAJA", "B003Y24DEU", "B0006HVM5E", "B005UE3C24", "B001YI0V7O", "B004QWU1H0", "B0044GH27U", "B004DJ99PG", "B003EE12EC", "B007KB0EGC", "B000XJNOXI", "B0088PUEPK", "B001A3ZH8Q", "B003V4TV8O", "B004S4R5CK", "B006JH8T3S", "B007ED7V7G", "B0041BT21M", "B007UQROJC", "B000R9AAJA", "B00CS9AYBQ", "B008ALA6DW", "B009SPUZCQ", "B004C9M7UG", "B000E891P8", "B004SUO1R6", "B0080NQCWY", "B004GHMU5G", "B00358RIRC", "B009F1DYF8", "B004I5UDO6", "B0036TGGW8", "B00683X4PQ", "B00006RVPW", "B005BZNDOO", "B000BUIP6K", "B003ELVLKU", "B005L38VRU", "B000Z80ICM", "B008RM23ZI", "B0049MPQA4", "B008CJ1N5M", "B00FQU7CPU", "B005H3I38Q", "B005CT56XU", "B005C2914C", "B008F0XX10", "B003SG9IOC", "B004XXMUCQ", "B009MPBMVA", "B001S4OTS6", "B005DLDO4U", "B0000X0VCY", "B00C2BG7ZC", "B001MSU1HG", "B001QUA6R0", "B002R9HQLI", "B005CT56R6", "B000UD4LIY"], "buy_after_viewing": ["B00EZSUWFG", "B005BZNDOO", "B00D78QCYK", "B00EZSUVHK"]}}