{"asin": "B00139S3U6", "categories": [["Electronics", "Computers & Accessories", "Monitors"]], "description": "The HP w2207 with BrightView panel provides an elegant flat panel monitor with a wide view for work or play. Adjust the tilt, height and switch between landscape or portrait orientation of the display to suit your needs. Get a high quality widescreen picture with a Brightview panel and high contrast ratio. Maximize desk space with innovative features such as integrated speakers, keyboard parking space and Easy Clip by attaching on photo and flower holders to your monitor. Extreme resolution at 1680 x 1050 and 5 ms response time for bright, awesome graphic quality perfect for videos, photo editing or gaming on your PC. Standard 15-pin D-sub analog and advanced HDMI digital interfaces for optimal graphic performance. Dual inputs support true digital (HDMI) and traditional analog (VGA) signals. HDCP-enabled for optimum viewing of High Definition content (High-Bandwidth Digital Content Protection). Double hinge base allows height adjustment from the youngest to oldest viewer to view comfortably. The HP w2207 provides a BrightView widescreen panel for brilliant picture quality. Dimensions unpacked, max position: 18.95\"(h) x 20.61\"(w) x 11.38\"(d).", "title": "HP W2207H 22-inch Widescreen LCD Monitor", "price": 5.99, "salesRank": {"Computers & Accessories": 4750}, "imUrl": "http://ecx.images-amazon.com/images/I/4116Yf5MTuL._SY300_.jpg", "related": {"also_viewed": ["B000OK6T9W", "B002RW08EC", "B00B332A4C", "B00B3FTM7S", "B00FUTDRWY", "B00CR0JNIG", "B00EC47RYW", "B00EMB4L0I", "B0085H66NU", "B0085H662G", "B00B332A24", "B007JLEEXC", "B00413PHDM", "B00BQ2BYPG", "B009M0TCK8", "B005LN1JEC", "B005BZNDOO", "B003ZX7RL4", "B00KBLIVPO", "B001CN9GEA", "B00BWBEL1U", "B009H0XQPU", "B00C18YRSA", "B005BZNEVQ", "B00COBJ3E2", "B0098Y77U0", "B009H0XQRS", "B00EZSUWFG", "B00B332A9C", "B006OE5JFW", "B006DDGIWM", "B001NPEC5A", "B003D1ADUU", "B00B3329WA", "B002C9FTXU", "B00GJO7GOE", "B00AYA7NBA", "B00347A48O", "B004G8QO5C", "B005BZNDS0", "B00CRZCJKK", "B00EMB4KVS", "B00D78QCYK", "B005S0XYKK", "B005JN9310", "B0091RA8U0", "B00ASHP1CM"], "buy_after_viewing": ["B003L1ZYYM", "B005BZNDOO", "B005LN1JEC", "B001TH7T2U"]}}