{"asin": "B00EAXRVLY", "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Cases & Sleeves", "Cases"]], "description": "The Vault for iPad Mini and iPad Mini with Retina Display is crafted with the same tried-and-true DNA found in all Pelican products. Providing an ultimate suit of armor without sacrificing device functionality, the slim, lightweight CE3180 Pelican ProGear Vault is dustproof, water resistant, shock-absorbent and drop-tested to ensure that a mobile device can handle an active lifestyle, anywhere. Made with engineering-grade aluminum, it is designed to provide vital defense from wind-driven rain, snow and dust - and with its elastomeric copolymer rubber interior to expertly absorb impact, the case can handle a four-foot drop unscathed. As versatile as it is defensive, the Vault for iPad mini protects tablets in a variety of ways: with the lid closed, it prevents impact damage to the screen. Open, the lid provides the freedom of cover-free use, an impact absorbing case (Meets Military Specification MIL-STD-810G) and a protective seal against water and dust (IP54 rated). Additionally, users can flip the cover over the back of the case to use with multiple viewing angles. The product boasts a water-resistant membrane to cover the microphone(s) and speakers, while still providing users with the utmost of high-fidelity audio. Additional features include optical-grade, Dragontrail glass on the rear camera area as well as a full-enclosure design. The CE3180 Vault for iPad mini and iPad mini with Retina display is backed by a lifetime guarantee, comes in black with gray accents, gray with orange accents and magenta with gray accents.", "title": "Pelican ProGear Vault Extreme Protection Case with Stand for iPad Mini with Retina display and iPad mini, Magenta (CE3180MN0AMGN)", "price": 55.66, "imUrl": "http://ecx.images-amazon.com/images/I/410xUbPOMyL._SX300_.jpg", "brand": "Pelican", "related": {"also_viewed": ["B00BHZLDQW", "B00C8OCEC8", "B00DRKXIR2", "B00CMS5O2W", "B00EOZ1GVE", "B00CMS5JR2", "B00GQQNNX8", "B00CMS5MO2", "B005B0SDNK", "B00KQHH7PS", "B00CMS5OIG", "B00CJYA95G", "B00EY9HAUQ", "B00KQHH8YI", "B00HS05RXK", "B00BOIMWYY", "B00I0G8GNY", "B00DW3H4H4", "B00GRSBGRK", "B00G2BXBNO", "B00F85JUL2", "B00H5MLXPM", "B00CMS5T86", "B00K5N5FC0", "B00GISQR14", "B00G2BXBG6", "B00JDHQV4K", "B00IL7BS1E", "B00G8Y7QGI", "B00GFGF4MW", "B008YFT6Q2", "B00FRVDXAQ", "B00HRKZZTM", "B006FR1KHE", "B00CMS5SUU", "B00GFGF4ZY", "B00GDHAT3W", "B00GA2PELW", "B00GRSBGTS", "B00GFV3E0Q", "B00JUDEKC2", "B00GA2PCRS", "B00K2NLXYC", "B00HQE18KY", "B00EQNP9BC", "B00GEA9LEQ", "B00J54NXHO", "B00HRKZZXS", "B00K2NLXOW", "B00IL7BRZQ", "B00G0NDJLI", "B00EWHMAVO", "B00IL7BS1O", "B008YFT6RQ"], "buy_after_viewing": ["B00EL94Z4I", "B008THTWIW", "B009QQMEEY", "B00CB7T52O"]}}