{"asin": "B003IMGC9U", "description": "NBA 2K11 is the latest installment in the best selling, and highest rated NBA videogame series. NBA 2K11 is the best way to plug into NBA culture. It's the most fun, authentic NBA videogame experience and is for any sports fan with that competitive fire who wants to play the best NBA simulation on the market. It's the NBA series that everyone is playing - from the most elite NBA athletes and superstars to the local court gym rats. NBA 2K10 delivered on its promise to TAKE OVER, and NBA 2K11 will build on that momentum by dialing up all of its features - gameplay, AI, presentation, visuals, audio, online and more - to deliver the best basketball videogame experience EVER.When you're the #1 selling NBA videogame two years in a row, the #1 rated NBA videogame 10 years in a row, and have collaborated with back-to-back NBA champions, Kevin Garnett (2K9) and Kobe Bryant (2K10) - what is NBA 2K11 to do for the next act? Simple: Michael Jordan. The greatest basketball player of all time debuts for the first time in this hardware generation and brings his passion for the game to NBA 2K11 with an all new Jordan Challenge mode, historic Bulls teams, and even a MJ: Creating a Legend mode offering gamers the chance to be a rookie Michael and craft a new career for him. This is on top of improvements to core gameplay elements - including an all-new IsoMotion&trade; dribbling controls, deeper My Player mode with new My Career feature, all-new breathtaking visuals, and much more. This year BECOME THE GREATEST with NBA 2K11.Features:Jordan Challenge - Relive 10 different legendary games from Michael Jordan's career and replicate in NBA 2K11 what MJ did on the court. Successfully reenact all 10 game scenarios to unlock the MJ: Creating a Legend mode.Historic Chicago Bulls Teams - Ever wondered how the Lakers of today might fare against the Michael Jordan led Chicago Bulls? Get the chance to play as some of the greatest teams in NBA history as the 1985-86, 1989-90, 1990-91, 1991-92, 1994-95, 1995-96, 1996-97, and 1997-98 Chicago Bulls squads are put at your fingertips in Quick Game mode.My Jordans - While playing through NBA 2K11, users will be awarded pairs of Air Jordans for hitting game milestones and accomplishments. Collect the entire line of Air Jordan shoes that MJ wore throughout his career and gain specific attribute bonuses when you have them equipped.MJ: Creating a Legend - Complete the Jordan Challenge to unlock this special mode where you get to take control of a newly drafted rookie Michael Jordan and craft your own version of Michael's career in the NBA.ALL-NEW IsoMotion&trade; Dribbling Controls - Delivering the most realistic feeling and reacting dribbling system to date with seamless transitions between ankle breaking moves. Coupled with an all-new gesturing system allowing users to intuitively translate thought to motion and dominate like Michael Jordan from the perimeter to the paint.ALL-NEW Dynamic Shot Control - Take your offensive game to the next level with an unprecedented amount of control via the enhanced Shot Stick&trade;. Dozens of new shot types, from layups to jumpshots to dunks and everything in between, are completely under the user's control with the flick of a stick. The new Shot Branching system also allows you to adjust your shots on the fly in mid-air just like MJ and ensures that you're never stuck in long drawn out animations.BEST NBA 2K Soundtrack EVER - The GREATEST soundtrack to date featuring an eclectic mix of upcoming breakout bands and highly acclaimed hip-hop artists such as Big Boi, Drake, and even an original, exclusive track from 12 time Grammy nominee, Snoop Dogg.Full PlayStation&reg;Move Functionality - Look for more details coming soon, but know that NBA 2K11 will be taking full advantage of this exciting new hardware feature.Plus, look for more news soon about great enhancement coming to other core features like My Player and Association modes as well as NBA Today.Historic Chicago Bulls teamsfeaturing Michael JordanView LargerAdditional Screenshots:Who is the greatest?View LargerNo. 1 selling andrated NBA videogameView LargerAll new Iso-Motiondribbling controlsView LargerAll new dynamic shot controlsView Larger", "price": 39.99, "imUrl": "http://ecx.images-amazon.com/images/I/51lxIkZpRuL._SY300_.jpg", "related": {"also_bought": ["B00647615G", "B002I0J4FW", "B002I0HIMI", "B003HFC22Y", "B004DI5H26", "B00420K18K", "B003171CEW", "B002C7RBFQ", "B003O6E5OE", "B006VB2UMI", "B006VB2UNC", "B00386VMWI", "B001CPBLLE", "B004Z4ZKL6", "B000FPOJOS", "B004WL4LP8", "B001C4DKG4", "B001B0BB42", "B000V4TXN0", "B001UU1WN8", "B003KZJA9Y", "B006D3JT1E", "B006JKARN0", "B004P8CKS8", "B008277M36", "B00A750QIE", "B002WF13AM", "B0050SX1JO", "B0012N5MIO", "B002I0K74Y", "B0050SWSQQ", "B007M6W3A0", "B002BCVFRM", "B001AZ7RLY", "B00BBU727W", "B0012N7BSI", "B000QB05AI", "B0043QL2DG", "B005GSRDHO", "B00ARCWQPI", "B001S86IRC", "B0030CYE8O", "B003O6E3QY", "B004X56PWK", "B004M8M30G", "B0025KZV7U", "B008E6ZXWC", "B0053BG3NY", "B002BCQ7NE", "B005UI9BT8", "B00AY1CT3G", "B003R7H5TC", "B000QB05A8", "B0015AARJI", "B000TG72OM", "B0072HYRNK", "B000MUW98O", "B0038MUCPK", "B003O6E2TM", "B0048C7S5G", "B001LX4BLY", "B00C710AQO", "B0047OOEFM", "B000JLP02S", "B0047ORROW"], "bought_together": ["B00647615G", "B006VB2UMI"], "buy_after_viewing": ["B002I0HIMI", "B007M6W3A0", "B00C710AQO", "B00647615G"]}, "salesRank": {"Video Games": 2723}, "categories": [["Video Games", "Kids & Family", "PlayStation 3", "Games"], ["Video Games", "PlayStation 3", "Games"]]}