{"asin": "B0041RRS0I", "description": "They'll Never Know What Hit'emEvery gamer knows that the latest games demands the best performance. But we don&rsquo;t believe in just meeting the minimum requirements, we believe in obliterating them. That&rsquo;s why we made sure that the Republic of Gamers (ROG) G73Jw-XA1 was jam-packed with one-of-a-kind innovation that propel mobile gaming performance to unseen levels.Featuring the new NVIDIA GeForce GTX 460M graphics engine that comes with a massive 1.5GB of GDDR5 VRAM, the ROG G73Jw-XA1 leads in DirectX 11 gaming for advanced tessellation and faster graphics rendering. This gaming powerhouse, powered by the Intel Core i7-740QM quad-core processor, soars while performing several tasks simultaneously. And while others struggle to find the keys in dimly lit areas, the backlit gaming keyboard gives you the edge in the dark to put you ahead of the competition. The ROG G73Jw-XA1 showcases a stealth fighter-inspired design with a unique thermal design that promotes airflow and keeps the air away from you. Plus, its 17.3-inch LED-backlit Full HD display lets you experience the latest in high-definition entertainment brilliant 1080p playback.  The ROG G73Jw-XA1 breaks from the heard of traditional gaming notebooks with built-in overclocking feature through the ASUS Power4Gear Hybrid utility &ndash; instantly giving you extreme power with a push of a button.The ROG G73Jw-XA1 also boasts 750GB 7200RPM hard drive, 8GB DDR3 system memory, high-speed wireless N, Intel Turbo Boost Technology, Super Speed USB 3.0 connectivity, Bluetooth v2.1, HDMI connectivity, 2.0 megapixel camera, and Altec Lansing speakers with EAX Advanced HD 4.0 sound.Key Features17.3-inch LED-backlit Full HD displayfor immersive cinematic experience with resolution up to 1920 x 1080 (Learn more)NVIDIA GeForce GTX 460M graphics with 1.5GB GDDR5 VRAMfor unprecedented DirectX 11 gaming (Learn more)Intel Core i7-DD740QM processor with Intel Turbo Boost technologyto automatically boost speed to your task at hand (Learn more)ASUS Power4Gear Hybridthat innovatively saves battery life and delivers extreme performance (Learn more)SuperSpeed USB 3.0for quicker device charging and up to 10x faster transfers than USB 2.01750GB 7200RPM hard drive and 8GB of DDR3 system memoryfor smooth computing and ample storage for all your games and media files (Learn more)Backlit gaming keyboard with ergonomic tilt-up designfor comfortable control in any lighting environment (Learn more)Altec Lansing speakers and EAX Advanced HD Audiofor premium gaming sound (Learn more)Learn MoreLeading Gaming Power for the Next GenerationView largerThe ROG G73Jw-XA1 features the new NVIDIA GeForce GTX 460M graphics engine for unprecedented visual performance. With unmatched DirectX 11 support, experience a totally new class of virtual interaction for more dynamic gaming.The ROG G73Jw-XA1 also features a fast 750GB 7200RPM SATA hard drive to store your movies, games, and pictures. Plus, the ROG G73Jw-XA1 offers 8GB of DDR3 system memory for incredible multitasking capability.Definitive MultitaskingView largerThe ROG G73Jw-XA1 gives you all the power you need to create digital video, 3D animation, or effortlessly play adrenaline-filled games with Intel&rsquo;s leading-edge processor. Powered by the Intel Core i7-740QM processor, the ROG G73Jw-XA1 outperforms other notebooks with massive memory bandwidth for the ultra-smooth multitasking performance. Featuring Intel Turbo Boost Technology, processor speed is automatically adjusted to your needs by accelerating performance to your task at hand.With a host of power profiles, this gaming powerhouse has a built-in overclocking mode via ASUS Power4Gear Hybrid that activates in a simple push of a button located above the keyboard that turns up system performance above its default level.Enjoy Vibrant MediaView largerFeaturing a 17.3-inch LED-backlit full HD display and Super Multi DVD drive, the ROG G73Jw-XA1 lets you enjoy the latest in HD playback for an immersive experience with sharp images, smooth video transitions, and brilliant clarity.  With HDMI connectivity, turn this gaming powerhouse into your personal media center by connecting to an external monitor or HDTV and enjoy flawless 1080p HD playback on the big screen. The ROG G73Jw-XA1 is complemented with Altec Lansing speakers and EAX Advanced HD 4.0 so you can hear every detail with enhanced acoustics.Aerodynamic DesignView largerBased from the intelligent design of a US stealth fighter, the ROG G73Jw-XA1 showcases sleek design. Its internal components are specially engineered next to the rear air vents to promote air flow and system cooling.Its gaming keyboard also illuminates to give you the competitive edge, so when others are fumbling for keys in the dark you&rsquo;re brightly lit keyboard keeps you a step ahead of the game.  Angled at an ergonomically 5-degree tapered slant, the keyboard is also positioned for an ergonomic typing experience so you&rsquo;re comfortable after the longest gaming sessions.Relax, ASUS Has You CoveredRanked as the#1 most reliable PC brandby 3 independent sources2, readers and editors alike choose ASUS as their trusted notebook and netbook. ASUS relentlessly strive to exceed expectations of quality to ensure you an unmatched peace of mind every time you start your PC.ASUS backs a commitment to quality with the industry&rsquo;s most comprehensive warranty.1 Year ASUS  Global Warranty3Offers a level of coverage that would add hundreds of dollars to  the price of competing laptops:1  year global warranty30 day Flawless Display Guarantee2-way free standard shipping24/7 tech support1 Year Accidental Damage Warranty (ADW)3Whether your notebook is damaged by accidental spills, drops, electrical surges, or fire, ASUS will fix it or replace it for you during the first year after purchase.Covers accidental drops, spills, power surges, and fire damageTarget 3 business day turnaround time for repair / replacement; not including receiving and shipping time1-way shipping (from ASUS to the user) at no additional cost24/7 toll-free phone supportWhat's in the BoxROG G73Jw-XA1AC Adapter8 cell Battery PackWarranty Information CardSpecificationsOperating  System:Windows 7 Home Premium (64-bit)Display:17.3-inch LED-backlit Full HD display (1920 x 1080)Processor:Intel Core i7-740QM quad-core processor (1.73 GHz with Turbo Boost up to 2.93 GHz)Chipset:Intel HM55Graphics:NVIDIA GeForce GTX 460M 1.5GB GDDR5 VRAMWLAN:802.11 b/g/n (@ 2.4GHz), Bluetooth v2.1LAN:10/100/1000 Mbps EthernetMemory:8GB DDR3 1333 MHz RAM, 4 x SODIMM (expandable to 8GB)Storage:750GB 7200RPM hard drive (1x HDD, 2x bays in total)Optical Drive:Super Multi DVDCamera:2.0 megapixelSpeakers:Altec Lansing speakers with EAX 4.0 soundMicrophone:Digital Array MicrophoneCard Reader:8-in-1 card reader (MMC/SD/Mini-SD/XD/Memory stick/MS Pro/MS-Duo/MS-Pro Duo)Input  / Output:1 x Mic-in, 1 x Headphone-out, 1 x VGA port/Mini D-Sub 15-pin for external monitor, 3 x USB 2.0 ports, 1 x USB 3.0 port, 1 x Gigabit LAN,&nbsp; 1 x HDMI, 1 x Kensington LockBattery:8 cellDimensions:16.6 x 12.8 x 0.08 ~ 2.3 &ndash;inchesWeight:8 lbs (with 8 cell battery)Color:&nbsp;Black&copy; 2010 ASUS Computer International. All Rights Reserved. ASUS is a registered trademark of ASUSTeK Computer. All  specifications and terms are subject to change without notice. Please check  with your supplier for exact offers on selected models. Products may not be  available in all markets. Product may not be exactly as shown in photos.1All figures theoretical values compared to USB 2.0 benchmarks for reference purposes. Actual speed depends on device and system status.2Rated number 1 Windows-based PC maker in PCMag.com's Service &amp; Reliability Report 2010. Rated number 1 PC brand according to SquareTrade, the leading direct-to-consumer warranty company (for more information visit http://www.squaretrade.com/pages/laptop-reliability-1109/ ). Rated number 1 reliable PC maker in Q2 2010's RESCUECOM report http://www.rescuecom.com/2010-2nd-Quarter-Computer-Reliability-Report.html3ASUS reserves the right to exclude certain SKUs; check with your retailer to confirm coverage of specific models. Valid for notebooks purchased in the US and Canada only. Certain retailers do not participate in ADW coverage. For complete details, please visit: usa.asus.com/event/ASUS360 and adw.asus.com/.Check Out Other Great ASUS ProductsASUS VW266H LCD MonitorGame on an even bigger screen. 25.5-inch large with 1920x1200 resolution and a 2ms response rate, VW266H is ready to take on your latest games and movies. Comes with HDMI, DVI-D, D-Sub, and Component inputs as well as S/PDIF output.ASUS RT-N16 Wireless N Router (with 2x USB)Featuring FTP server and BT downloader for your USB HDD, the RT-N16 wireless N router is a powerhouse that is also Tomato firmware compatible.ASUS VG236H 23-Inch 120 Hz 3D Ready Panel MonitorExperience a new, exciting 3D world with the immersive 23-inch VG236H 3D Vision Kit featuring NVIDIA&reg;3D Vision&trade;technology that reinvents your movies, videos, and games for the third dimension. This all-inclusive 3D bundle includes four components that provide everything you need to easily connect to your G73Jw-XA1 and start enjoying 3D in brilliant HD splendor.ASUS GX800 3200DPI USB Laser Gaming MouseThe GX800 gaming mouse is your interface to success with selectable &ldquo;gears&rdquo;. Large buttons help customize   macros with ease for favorite game titles, don&rsquo;t waste time fiddling with the   controls, spend it gaming &ndash; or maybe admiring the soft rubberized design, cool   color scheme and backlit logo. For a little device, it sure does a lot.", "title": "ASUS G73JW-XA1 Republic of Gamers 17.3-Inch Gaming Laptop (Black)", "imUrl": "http://ecx.images-amazon.com/images/I/416OcTXFfeL._SX300_.jpg", "related": {"also_viewed": ["B00IKF2H12", "B00COQIKB4", "B009M2XB3U", "B00JI9OHXU", "B00IQ3QE4O", "B00F32ZBN6", "B00IEV85OU", "B00DXFF6EO", "B00IAA5BSS", "B00ISKS4A2", "B00HIY8VLQ", "B00DXFF6QC", "B00KOUILK2", "B00IMTQ5I2", "B00F0RC5O2", "B00CQBQRTE", "B00COQIKKA", "B00EZ8BJNK", "B00HJSDU3U", "B00F0RC4VQ", "B00F0JBJDS", "B00COQGJSK", "B00H7O3SFQ", "B00F4MEGBI", "B00F4MEGYU", "B00COQ4ETG", "B00FJT51LK"], "buy_after_viewing": ["B0065RMJ0Q", "B002I05W2Q", "B00AJY7L4A", "B007MW73C2"]}, "categories": [["Electronics", "Computers & Accessories", "Laptops"]]}