{"asin": "B000ZJVDA2", "description": "Famed game producer Hironobu Sakaguchi of Mistwalker game studio, along with feelplus Inc. and Microsoft Game Studios, leads a staff of gaming masters to bring a truly next-generation role-playing experience to Xbox 360 inLost Odyssey.Lost Odysseyis the story of Kaim, an immortal character who has lived more than 1,000 years and doesn't remember his past and doesn't know where his future lies. Throughout Kaim's journey, a handful of characters will join him on an odyssey to discover their intricate past and destiny, leading players through a dramatic story of massive scale. \"Lost Odyssey\" will feature breathtaking visuals and an epic adventure made possible only by the power of Xbox 360.An Engaging and Unparalleled Emotional StoryWith story sequences penned by award-winning Japanese novelist Kiyoshi Shigematsu in cooperation with producer Hironobu Sakaguchi, \"Lost Odyssey\" sets a new benchmark for the RPG genre with a combination of true-to-life cinematics and the story of an immortal man who has been suffering in many ways for 1,000 years. Players will witness Kaim's life as he lives through many generations, becomes part of numerous families, falls in and out of love, and confronts all of the conflicts that arise. Kaim's struggles are set in a world that is on the verge of a \"mystical industrial revolution,\" where mankind has attained dark powers.Innovative Gameplay FeaturesLost Odysseyblends massively multiplayer online role-playing game (MMORPG) elements into the game's traditional RPG system, enabling players to make strategic decisions for a more immersive and deep gameplay experience.Massive scope and engrossing environmentsThe massively scoped worlds, memorable characters and epic story line ofLost Odysseyplay out like an intense and unsettling blockbuster action film. Heading up the artistic demands of the title is famed Japanese comic artist Takehiko Inoue; renowned composer Nobuo Uematsu has been recruited to create a contemporary soundtrack.Realistic Graphics in Next-Generation GamingPowered by Unreal Engine 3 technology,Lost Odysseyboasts stunning visual fidelity and rendering quality. The Unreal Engine 3 technology pushes high-definition visual designs to a higher level and brings out the smallest details in the largest battles. Gamers will experience a rich dynamic world with an unprecedented level of detail. Users can experience the true-to-life gameplay and facial expressions of emotionally distressed characters in the world ofLost Odyssey.", "price": 21.95, "imUrl": "http://ecx.images-amazon.com/images/I/51kkNdStUwL._SY300_.jpg", "related": {"also_bought": ["B000QW9D14", "B00149NCYW", "B001CMJAP6", "B001LGFPSY", "B0015HZLVA", "B0028A6V7Q", "0761558802", "B000PC4FYK", "B000FUG5WC", "B002BRWUA8", "B007CSF3GO", "B000FLZEXM", "B000P8WOMO", "B003O6EBRA", "B00319DX4W", "B001CMIUYS", "B000R0SS3Y", "B00KVRK39A", "B002BRUTT2", "B004JHJHCC", "B002I0J4AM", "B002W5GI9I", "B0010AYJXI", "B002BRYIJY", "B0019SY1D4", "B002I0H79C", "B001UWGDC6", "B00ICWO1XA", "B004XLA1OW", "B0016C3260", "B00BY0G0YU", "B004NRN5DU", "B004EW7LSY", "B000784XG2", "B00KBD4SJA", "B00D87TCN8", "B000HCQK0A", "B00B2QL2Y4", "B00946FSJ4", "B000FRVAD4", "B0054INKZK", "B003E6VK5Q", "B007RNWUC4", "B002WSR8BC", "B004BV5O0U", "B002GPPPS4", "B000G7X5MM", "B0045ZIENQ", "B007UMD1EI", "B005J5K9EI", "B0043B5SLI", "B000ZK696O", "B002Q21X7Y", "B002I0JGDM", "B000HGMH12", "B00008KTRS", "B00DBCAT3W", "B000ICV996", "B002BRYHY0", "B0044SA70M", "B00024W1U6", "B000AVBFU8", "B0009SQFHA", "B00B59MXDM", "B007IFMEYK", "B007PNBU0Y", "B004CVWETI", "B00K85X1TE", "B0019MLWL4", "B000B6ML1Y", "B003BE6OZC", "B000G77X34", "B000HX1P72", "B003FBL85W", "B0002GTFIK", "B004JSDQPU", "B000WCN7G0", "B003O6E9EK", "B007FQUFC0", "B003O6G6G4", "B00GV4V8XC", "B002I0H2AG", "B00004UDVL", "B001CRQY1E", "B001EOQV9U", "B00C3MKCF6", "B00B67ZTUW", "B001YI0Z2U", "B006GHA8EE", "B003DNH95K", "B007IFMFYE", "B00KWEHBAG", "B001IK1BJ0", "B004ZGYZXS", "B0016NRS8M", "B001D25M1Q", "B002GN8HU4", "B000LY4IDK", "B0047TG2R0", "B00J6DLPLK"], "buy_after_viewing": ["B0015HZLVA", "B001LGFPSY", "B00B59MXDM", "B000QW9D14"]}, "salesRank": {"Video Games": 3598}, "categories": [["Video Games", "Xbox 360", "Games"]]}