{"asin": "B0016BVKAQ", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorder Bundles"]], "description": "Flip Mino: The Power of Self ExpressionFlip Mino provides you the power of self-expression, enabling you to shoot and share your stories with the world.Mino Overview:Super-slim Mino is the sleekest camcorder you can getSuper-simple user interface features one-touch recording and digital zoomHolds 60 minutes of full-VGA-quality video on 2GB of built-in memory; no tapes or additional memory cards requiredConvenient flip-out USB arm plugs directly into your computer to launch built-in FlipShare softwareBuilt-in FlipShareTMsoftware lets you easily email videos, edit individual clips, make custom movies, capture still photos from video, and even upload video to sharing sites like YouTube and MySpaceFlipShare&rsquo;s advanced compression technology allows for quick and easy sharing of high-quality video in compact-sized files (via email or publishing online)Internal Li-ion battery recharges through built-in USB arm while you&rsquo;re plugged into your computerProduces incredible, full-VGA-quality videos that look crisp and clear when played back on a TV (TV connector cable included)Features a flat-back panel with touch-sensitive backlit buttonsInstant playback, pause, fast forward, rewind, zoom, and delete functionsSleek, Simple, &amp; PortableThe super-simple, super-portable Flip Mino makes it easy to capture and share high-quality video anywhere and everywhere. Mino weighs only 3.3 ounces and features a sleek, pocket-sized design, allowing you to take it with you everywhere you go. Mino also boasts a rechargeable battery that powers up automatically while plugged into your computer. And while Mino is 40 percent smaller than its already-pocket-sized brother, the Flip Ultra, it&rsquo;s got all the Flip Video features--simple user interface, one-touch recording, flip-out USB arm, built-in editing and sharing software, instant uploads to YouTube and MySpace--that folks have come to know and love.Click here for an interactive tourThe Power of Video in Your PocketFlip Mino puts the power of video in your pocket. Weighing just over 3 ounces and featuring a super-slim, super-sleek design, Mino barely makes a dent in even the tightest of jeans. Mino&rsquo;s small size is complemented by an interface that&rsquo;s incredibly easy to use. Simply power on and press record--you&rsquo;ll be capturing video in seconds. With a camcorder this small and sleek, there's no limit to where you can take it and what you'll end up shooting. Whether you&rsquo;re creating a short film to enter in your favorite festival or just capturing footage of a hot new band, Mino makes it easy because it's always with you and always ready to go.Incredible QualityWhile small in size, Flip Mino produces video that is unbelievably high in quality. Its 2 GB of on-board flash memory records up to 60 minutes of full-VGA-quality video that looks sharp when played back on your laptop or television (TV cable included). The built-in microphone captures crisp, detailed audio, whether you're paddling down the Amazon or rockin' out at your favorite club. When it&rsquo;s time to edit or share videos from your latest excursion, flip out the USB arm and connect to any Mac or PC to launch the built-in FlipShare software.Click here to learn more about FlipShare softwareBuilt-in FlipShare SoftwareMino comes pre-loaded withFlipShare software, which makes it easy to organize, create and share your videos:Organize your videos.Drag and drop your videos into folders you've created, or use the automatic date-stamped folders.Create custom movies.Make movies featuring your favorite video clips, and add your own music to provide a more personal touch.Capture still-image snapshots.Use enhanced freeze-frame capabilities to grab a snapshot from any of the thirty frames that comprise each second of your video.Share privately.Send videos to your friends and family using attachment-free emails. Or create private Flip Channels to share your videos with specific groups of friends and family.Share with the world.Publish your videos directly to Facebook, YouTube and other sites, all with the click of a button.Recommended Companion Products and Accessories:", "title": "Flip Mino Video Camera - White, 2 GB, 1 Hour (1st Generation)", "price": 199.95, "salesRank": {"Camera &amp; Photo": 7961}, "imUrl": "http://ecx.images-amazon.com/images/I/31nJCBieGkL._SY300_.jpg", "related": {"also_bought": ["B000VJRUKS", "B001B5CVNC", "B0040702IE", "B00272MT3A", "B0023B14TK", "B002R5AM7C"], "buy_after_viewing": ["B001HSOFI2", "B0040702IE", "B00272MT3A", "B000V1PXMI"]}}