{"asin": "B000V1MLBE", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "It&rsquo;s the power of video in your pocket. Capture the everyday moments that happen anywhere, and share them with family and friends everywhere. That&rsquo;s idea behind the new Flip Video Ultra Series. It&rsquo;s portable, simple to use and amazingly affordable. Shoot anything. Share everything.Flip Ultra Series Camcorder HighlightsSimple to UseThe Flip Video Ultra Series&rsquo; simple, one-touch recording and compact size make it the ideal choice for shooting video on the go. Capture memories as they happen - no fiddling around with memory cards, chargers or tapes, With four buttons, it&rsquo;s incredibly simple to record, zoom, playback instantly or delete your videos. Flip Video&rsquo;s internal flash memory holds up to 60 minutes of high-quality video.QualityThe new Flip Video Ultra Series line produces video that rivals that of more expensive camcorders. With 2GB of memory, a high-quality microphone and no-glare display, now anyone can make impressive videos.Built-in FlipShare SoftwareFlip Ultra comes equipped with FlipShare--Flip Video's new video-sharing solution. FlipShare lets you:Save and Organize: Watch your videos on your computer whenever you want, and create your own folders to organize your videos, or simply use the automatic date-stamp system.Publish Online: Upload your videos instantly to YouTube, MySpace, AOL Video and many other websites, all with the click of a button. It&rsquo;s never been this easy to publish online!Email Videos: Send your videos privately to friends and family, and select from a wide assortment of included greeting cards to personalize your message.Edit and Create Movies: Edit individual clips and create custom movies--complete with your favorite music. FlipShare even allows you to capture snapshots from your videos.Please note: Flip Ultra Camcorders manufactured before November 2008 may be pre-loaded with an older version of software. However, if you own one of these units, you&rsquo;ll be prompted to download FlipShare--free of cost--the first time you connect your camcorder to a computer that is connected to the Internet. You may also download the latest version of FlipShare here: www.theflip.com/softwareupdate.Optional AccessoriesCustomize your new Flip Video Ultra Series camcorder with a colorful protective pouch. Add the flexible tripod and action mount to get even better shots. Extra USB Extension Cables give you even more flexibility when uploading video.What&rsquo;s in the BoxTV connector cable, soft carrying case, wrist strap, two AA batteries and instruction booklet.", "title": "Flip Ultra Series Camcorder, 60-Minutes (White)", "price": 369.99, "salesRank": {"Camera &amp; Photo": 1678}, "imUrl": "http://ecx.images-amazon.com/images/I/31jhn4VDrqL._SX300_.jpg", "related": {"also_viewed": ["B001O94GNS", "B0023B14U4", "B0040702IE", "B0040702HA", "B0047UNI62", "B0040702HU", "B000FD8MJS", "B0016BXRB6", "B0023B14UE", "B004KMOVTU", "B003WOLOLU", "B0016BVKAQ", "B0040702HK", "B0023CLK3O", "B0023B14TK", "B0040702IO", "B006L06SCM", "B004FLL5AE", "B0023B14TU", "B006KDQFLY", "B001QWKI8K", "B004AP96FQ", "B003JIYNOO", "B0040702I4", "B0043D4V8M", "B0041LXANI", "B001QWF01K", "B001HSOFI2", "B00GBLJAVC", "B003WOLOM4", "B004FLL5AO", "B008X3NGJ8", "B002R5AM7C", "B0043CWU22", "B001QWGF3W", "B000P6J77G", "B004IIZY9W", "B001BO7R00", "B0055N604M", "B008X3NGHK", "B0040702IY", "B005G81E9M", "B003DZ122O", "B00HEZTFMI", "B0037P5CAI", "B00BF9HZT4", "B009GLINO4", "B004GKLW84", "B003FMUPA0", "B0031RGKVC"], "buy_after_viewing": ["B001O94GNS", "B0023B14U4", "B0040702IE", "B001B5CVNC"]}}