{"asin": "B000QW9DPU", "description": "From the ManufacturerMore than just a wireless music system, Xmod Wireless features X-Fi technology that makes your MP3's and other compressed music files sound better than the original CD. It plays all of the music from your PC wirelessly throughout your house and since it doesn't rely on your home network, there are no delays, dropouts or interference to deal with, and no IP addresses to configure. Simple to setup with no software, or drivers to install and works right out of the box.FeaturesX-Fi Wireless Music SystemConnect the Xmod Wireless transmitter to your PC and desktop speakers to enjoy Xtreme Fidelity music.Play music from your PC wirelessly in any roomMake your MP3s sound better than CDsConnect in seconds--no configuration neededMore than just a wireless music system... way more.Upgrade your PC sound system to Xtreme Fidelity audioRestore the detail and vibrance to compressed music such as MP3s and iTunesExpand stereo music and videos into virtual surround soundConnectConnect the Xmod Wireless transmitter to your PC and desktop speakers in seconds, no drivers needed.EnhanceX-Fi technology breathes life into your songs by restoring detail and expanding your music and movies to surround sound.X-Fi Crystalizer technology restores the detail and vibrance to your compressed music and movies. All the highs and lows are intelligently enhanced so you&#39;ll hear everything in crystal clarity.X-Fi CMSS-3D technology expands your stereo MP3s and digital movies into virtual surround stereo speakers or headphones. Voices are centered in front of you and ambient sounds are moved all around youWireless TechnologyExperience Xtreme Fidelity music throughout your homeEnjoy a wireless system made for music - no delays, no dropouts and no home network neededWireless setup is simple - just connect the X-Fi Wireless Receiver to your home entertainment system or powered speakers in any room up to 100ft. (30m) awayListen to ALL of your music wirelessly in Xtreme Fidelity--even Internet radio, podcasts, subscription music and songs purchased from iTunesControlUse the remote controls with the Xmod Wireless transmitter or the X-Fi Wireless Receiver to play, pause and skip through your music", "title": "Creative Labs Xmod Wireless Music System with X-Fi Technology", "price": 49.99, "imUrl": "http://ecx.images-amazon.com/images/I/41-uSCh02uL._SX300_.jpg", "related": {"also_viewed": ["B002BDU95A", "B001VNBI2E", "B007RFMRBG", "B000IZ96LQ", "B003F7R7SI", "B00GIXRKEM", "B001GXQOUU", "B00I0Z427E", "B00A4V22G0", "B0044DEDC0", "B00EZT7RE4", "B00E953OJQ", "B0044DEDCA", "B00FB1NTP6", "B008TCW2LG", "B002BDU93C", "B008BNO40U", "B007RFLJ92", "B007GGHWZM", "B00IYUI0W8", "B00814NSQ0", "B004275EO4", "B000E5E6KG", "B0036VO2B8", "B0000E2RZN", "B004Q6L6JI", "B003IR7GP4", "B00713RSE0", "B004K6LETQ", "B003U6Y33Q", "B00E7MWA8C", "B005OKA3Z8", "B00BLQCVCC", "B005FKT70O", "B000X1TS54", "B000S56BGY", "B00JZBIBWO", "B00JUEYQR0", "B004K1EO7U", "B00BSHPFZO", "B001CROHX6", "B004UCZZNQ", "B00HZ1CNFM", "B001D1PWGM", "B002LARRDK", "B004UEAJTE", "B00DE4MI2M", "B00EVWX8R0", "B00B7ID99S", "B00JB4YWGO", "B00E7QA9E0", "B0029LHVO6", "B00030099O", "B0006A9M3K", "B000VEP3XO"], "buy_after_viewing": ["B002BDU95A", "B001VNBI2E", "B002BDU93C", "B001RNOHDU"]}, "categories": [["Electronics", "Computers & Accessories", "Computer Components", "Internal Sound Cards"]]}