{"asin": "B001BN6G8A", "related": {"also_bought": ["B001BNCJ5E", "B003QNVFVG", "B002NGEFSC", "B003QXNA28", "B00444VM2S", "B002KCZJ3E", "B005K0J3Q2", "B009APCEFK", "B002SP4FVA", "B005K0J3MQ", "B006SO54DA", "B0055AGUMW", "B003UD9ETW", "B005SN1FOY", "B004GX2GMC", "B0043H2KAY", "B004ZLV50E", "B0024R9PY4", "B00CTVJGKI", "B004QQOJU6", "B007JGBSCC", "B007AJZ7EI", "B003UBEATI", "B005R5S14U", "B006YLWJMQ", "B0092QSQEK", "B009EA550C", "B004ZLV4JG", "B007JGB6TW", "B009SKNWOY"], "bought_together": ["B003QNVFVG"], "buy_after_viewing": ["B0042FV2SI", "B0044WTQVE", "B001BNCJ5E", "B00CTVJGKI"]}, "title": "InvisibleSHIELD for the Apple iPhone 3G (Full Body)", "price": 0.5, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41qurjp5cdL._SY300_.jpg", "brand": "Zagg", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Monitor Accessories", "Screen Protectors"]], "description": "Your search for a Cell Phone/Smart Phone case, skin, or cover is now over. ZAGG's invisibleSHIELD is an exceptionally clear and virtually indestructible film that will protect any Cell Phone or Smart Phone from unsightly scratches. Our exclusive, patented film - with nano-memory technology - covers and shields your device, keeping it as pristine as the day you took it out of the box. The precision pre-cut invisibleSHIELD applies directly to your specific model Cell Phone or Smart Phone, providing the toughest, most durable protection you will find. The invisibleSHIELD has its origins in the military, where it was used to protect high-speed helicopter blades from dust, dirt and debris. Now you can use that same powerful technology to protect your Cell Phone or Smart Phone. The invisibleSHIELD is only .2 millimeters thick making it the slimmest Cell Phone/Smart Phone skin or cover of its kind. It is so tough that we back it with a lifetime guarantee. So, if it ever does wear or scratch, we will replace it for free, for the life of your device. And if you ever need to remove the invisibleSHIELD, no problem; it comes off clean and leaves no sticky residue. If you're still not convinced, check out our demo video and see for yourself how strong ZAGG's invisibleSHIELD really is."}