{"asin": "B0002BJQDY", "description": "Guild Warstakes the best elements of today's massively multiplayer online games and combines them with a new mission-based design that eliminates the tedium of those games. You can meet new friends in towns or outposts, form a party, and then go tackle a quest together. Your party always has its own unique copy of the quest map, so camping, kill-stealing, and long lines to complete quests are all things of the past. Within a quest you have unprecedented freedom and power to manipulate the world around you: your magic can build bridges and open up new pathways, or it can burn down forests and tear the ground asunder.You don't have to spend countless hours on a leveling treadmill to get to the interesting parts of the game, because combat is designed to be strategically interesting and challenging right from the beginning. You don't have to spend hours running around the world to prepare for a quest, because Guild Wars allows you to instantly travel to the beginning of any quest that you've previously unlocked. You'll never spend days playing only to discover that choices you made early on have left you with a permanently uncompetitive character, because the unique skill system in Guild Wars allows infinite experimentation but doesn't allow bad decisions to ruin a character. And you'll never meet new players only to discover that you can't play with them or compete against them because their characters are on a different server than yours; in Guild Wars, all characters live in one seamless world.Built for CompetitionAfter learning the game and building up your first character, you may choose to test your skills in head-to-head competition or guild warfare. The game is designed to reward player skill and teamwork, not time spent playing, so you won't need to spend hundreds of hours leveling up your character to compete.The game includes integrated support for guilds, with guild banners and halls, chat rooms and forums. Guilds can challenge other guilds to battle, compete for control of key parts of the world, and be ranked on a worldwide ladder.Unique Streaming TechnologyArenaNet's unique streaming technology forever eliminates the concept of patching a game. You don't have to wait a month for the next big patch to experience new content. Instead, the game constantly and intelligently streams new content to your computer in the background while you play. The world can change continually. This allows us to build a much more dynamic game world than any that has existed before.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51NTeQ9cxgL._SY300_.jpg", "related": {"also_bought": ["B000ELW4D6", "B001TOQ8X4", "B000WJQXQE", "B000HCU7B8", "B009AYOFI0", "B000RZKZPS", "B001DI6O6C", "B0002BQN7Q", "B00E9I1FPI", "B002W8ZYOK", "0761548904", "B0016O5G26", "B0013LUFJG", "B000YTR8PM"], "bought_together": ["B000ELW4D6", "B000WJQXQE"], "buy_after_viewing": ["B000WJQXQE", "B001DI6O6C", "B000ELW4D6", "B001TOQ8X4"]}, "salesRank": {"Video Games": 19613}, "categories": [["Video Games", "PC", "Games"]]}