{"asin": "B000VJX7DW", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]], "description": "Engineered with pro-level features and performance, the 12.3-effective-megapixel D300 combines brand new technologies with advanced features inherited from Nikon's newly announced D3 professional digital SLR camera to offer serious photographers remarkable performance combined with agility.Similar to the D3, the D300 features Nikon's exclusive EXPEED Image Processing System that is central to driving the speed and processing power needed for many of the camera's new features. The D300 features a new 51-point autofocus system with Nikon's 3D Focus Tracking feature and two new LiveView shooting modes that allow users to frame a photograph using the camera's high-resolution LCD monitor. The D300 shares a similar Scene Recognition System as is found in the D3; it promises to greatly enhance the accuracy of autofocus, autoexposure, and auto white balance by recognizing the subject or scene being photographed and applying this information to the calculations for the three functions.The D300 reacts with lightning speed, powering up in a mere 0.13 seconds and shooting with an imperceptible 45-millisecond shutter release lag time. The D300 is capable of shooting at a rapid six frames per second and can go as fast as eight frames per second when using the optional MB-D10 multi-power battery pack. In continuous bursts, the D300 can shoot up to 100 shots at full 12.3-megapixel resolution. (NORMAL-LARGE image setting, using a SanDisk Extreme IV 1GB CompactFlash card.)The D300 incorporates a range of innovative technologies and features that will significantly improve the accuracy, control, and performance photographers can get from their equipment. Its new Scene Recognition System advances the use of Nikon's acclaimed 1,005-segment sensor to recognize colors and light patterns that help the camera determine the subject and the type of scene being photographed before a picture is taken. This information is used to improve the accuracy of autofocus, autoexposure, and auto white balance functions in the D300. For example, the camera can track moving subjects better and by identifying them, it can also automatically select focus points faster and with greater accuracy. It can also analyze highlights and more accurately determine exposure, as well as infer light sources to deliver more accurate white balance detection.The D300 incorporates Nikon's new Multi-CAM 3500DX autofocus module that features an intelligent array of 15 cross-type sensors and 36 horizontal sensors. These sensors can either be used individually or in groups, with the option for Single area AF mode and Dynamic AF modes using groups of either nine, 21, or all 51 focus points. The system also features 3D tracking with automatic focus-point switching that takes advantage of all 51 AF points as it uses color and light information to accurately track the subject. Nikon's new Scene Recognition System and improved focus algorithms also contribute to the impressive performance of the new 51-point AF system.Nikon's new Picture Control System makes it easy for users of all experience levels to select and apply adjustments to how their pictures are rendered and create optimized settings to suit their individual preferences. The same settings produce consistent picture tone, even when using different camera bodies. The Picture Control System offers four basic setting options--Standard, Neutral, Vivid, and Monochrome. These can be directly modified for easy adjustment and customization of image parameters, such as sharpening, tone compensation, brightness, and saturation. Photographers can customize and store up to nine customized options in the D300 and export up to 99 to a CF memory card, enabling photographers to share settings among multiple cameras that feature Picture Control System.Taking a cue from the popularity of Nikon's D-Lighting technology, the D300 features a new Active D-Lighting mode that, when enabled, provides remarkable real-time highlight and shadow correction with optimized image contrast. Active D-Lighting produces broader tone reproduction in both shadows and highlights by controlling highlights and exposure compensation while applying localized tone control technology to achieve a more pleasing level of contrast across the entire image. And because the advantages of Active D-Lighting are applied as images are captured, image editing time can be shortened.The D300's LiveView feature offers two modes for confirming subjects and composition on the new 920,000-dot, high-resolution 3-inch LCD monitor while shooting. The Tripod mode is designed for precise focus and accuracy when the camera is on a stable platform and the subject is not moving. In this mode, the camera focuses on the subject using focal-plane contrast and any point on the LCD screen can be selected as the focus point for the picture. The second mode, called Handheld mode, allows photographers to use the camera's conventional TTL focusing system with all 51-points and 15 cross-type points available. When using this mode, the camera activates focusing immediately when the shutter button is pressed to ensure accurate focus.The D300 also employs a new self-cleaning sensor unit. Four different resonance frequencies vibrate the optical low-pass filter in front of the image sensor to shake particles free and reduce the appearance of dust.Refined Ergonomics and UsabilityThe D300 inherits one of Nikon's most streamlined, functional, and aesthetically pleasing layouts in a digital SLR camera, designed to enable photographers to take pictures with less fatigue, greater accuracy, and comfort.The camera's viewfinder provides virtually 100 percent coverage so pictures can be framed accurately, while an ultra-high definition 920,000 dot VGA LCD screen on the rear of the camera displays images with vivid color and clarity. Its 170-degree wide viewing angle makes it easy to compose shots using the LCD screen in LiveView mode.The D300 features rugged magnesium alloy construction and the camera's shutter mechanism is tested up to 150,000 cycles. The 3.0-inch LCD is strengthened with tempered glass and the D300's rubber gaskets and seals protect vulnerable entry points from dust and moisture.What's in the boxNikon D300 digital SLR body, EN-EL3e rechargeable li-ion battery, MH-18a quick charger, UC-E4 USB cable, EG-D100 video cable, AN-D300 strap, BM-8 LCD monitor cover, body cap, DK-5 eyepiece cap, DK-23 rubber eyecup, Software Suite CD-ROM", "title": "Nikon D300 DX 12.3MP Digital SLR Camera (Body Only)", "brand": "Nikon", "salesRank": {"Camera &amp; Photo": 1056}, "imUrl": "http://ecx.images-amazon.com/images/I/51vVs93wcSL._SY300_.jpg", "related": {"also_bought": ["B001T9N0RQ", "B000VDF5RO", "1598635344", "B000BYCKU8", "B000VDF5VK", "B001VO83A8", "B005DIYQA4", "B001G9WAF2", "B00HQ4W4PC", "B001EO6W8K", "0470260920", "B00005LEN4", "B001FO4QHI", "B000GBERAM", "B002JCSV8A", "B000BY52NU", "B00ALNA0CE", "B0002EMY9Y", "B001S2PPT0", "B000ZMCILW", "B000W05O5O", "B000LWJ1ES", "B00065F86U", "B000BY52NK", "B003G40EGC", "B004UC9HSA", "B00ECEVE50", "B000O161X0", "B00005LENO", "B00015GYU4", "B003XEOJU2", "B004Y1AYAC", "B0093HGDVG", "B0050YG3CU", "B003L7CMNC", "B002NO7Q26", "B0009PEU3Y", "B000144I2Q", "B002N694A6", "B002O3MVYO", "B000ZZV9BY", "B00017LTFC", "B005LZSRLI", "B0042X9LC4", "1600593054", "B00508ZURU", "B004YTCNJY", "B0013A1XDE", "B00ECGX8FM", "B005CN1Z0O", "B005UM6L92", "B004TEUDOQ", "B00156OZ68", "B00005LE6Z", "B003RLJVYK", "B001BTG3OQ", "B002WE4H8I", "B000KZ70JE", "B008B14VAK", "B004NDEWWW", "B000A2TEWS", "B004WKIG5A", "B000W0BC7I", "B00AUC533M", "B0079M711S", "B001ET5U92", "B00005LEOH", "B000HJPK2C", "1933952342", "B001NS0OZ4", "B002NO8PTY", "B002JCSV6M", "B001G445Q4", "B0049VZ4XE", "B00004ZCJG", "B0015U95SW", "B000VDCT3C", "B000YZGCIU", "0817400028", "B002WR7VSS", "B0093HGD2K", "B00009R8T5", "B000BYCKUI", "B008FJJ66C", "B0009HN57Y", "B0052GZNY0", "B00017LSPI", "B001955P8W", "B000092M1T", "B004Z4G7FE", "B006FS655K", "B0033ZLPG2", "B0099XGZXA", "B00005Y3OM", "B000144I30", "0470521279", "B002HMC7A0"], "bought_together": ["B001T9N0RQ", "B000BYCKU8"], "buy_after_viewing": ["B001S2PPT0", "B0042X9LC4", "B002JCSV6M", "B000BY52NK"]}}