{"asin": "B000I641UQ", "categories": [["Sports & Outdoors", "Outdoor Gear", "Camping & Hiking", "Camping Furniture", "Cots & Hammocks"]], "description": "If you've done a fair amount of camping, you know that sleeping on a cot inside a roomy tent is far more comfortable than sleeping on the ground. Now you can combine both luxuries with the oversize Kamp-Rite tent cot, a fully framed and enclosed cot with nylon sides and tie-up no-see-um mesh doors and windows--just like a personal tent. The legs of the cot are suspended a full 11 inches off the ground, keeping you away from moisture, snakes, and rodents, so you needn't worry about waking up with a mouse inside your sleeping bag. More significantly, the cot is roomy and comfortable, with plenty of space to stretch out and sleep in style. (The oversize version offers 12 inches of additional headroom compared to the original tent cot, with extra elbow room on the sides as well.) Simply situate the tent cot on any piece of level ground, toss in your favorite sleeping bag or blanket, and you're ready for a great night of sleep. As a bonus, you can also collapse the tent cot into a flat cot orientation, letting you take full advantage of the sun's rays on a warm afternoon, or you can convert the cot into a lounge chair by tilting one end upward.The tent cot's frame is made of lightweight yet durable aluminum, with anti-vibration aluminum nuts and bolts that won't loosen over time or rust. The \"tent\" portion of the product features durable 420-denier nylon fabric with no-see-um doors and windows that open on all four sides. When the outer nylon doors are zipped open and the interior no-see-um mesh doors are zipped closed, the tent cot is 100-percent insect-proof yet still encourages 360-degree airflow--a must for warmer climates. The durable one-piece Cordura nylon-fabric sleeping surface, meanwhile, is firm and level, helping you sleep soundly throughout the night. And should you encounter severe stormy weather, simply set up the \"total encapsulation\" rain fly.Easy to set up and transport thanks to the heavy-duty carrying bag, the oversize tent cot measures 90 by 40 by 32 inches (W x H x D) when set up and 34 by 7 by 34 inches when folded. The cot also comes in alternate original and double sizes and is backed by a one-year warranty against defects.", "title": "Kamp-Rite Oversize Tent Cot", "price": 188.49, "imUrl": "http://ecx.images-amazon.com/images/I/41B1OTAd2zL._SX300_.jpg", "brand": "Kamp-Rite", "related": {"also_bought": ["B000BH8W6G", "B000BH46O8", "B004M0X9BQ", "B002KKBSJA", "B000I6420U", "B000BH46MU", "B00J0RC5JI", "B00168XMD2", "B007PAP7OC", "B00LM57S3E", "B000BH2AZU", "B009A80W1K", "B000FIC6R2", "B001LF3FR8", "B00B980YNA", "B002MFTO44", "B002YXITKO", "B00DGQZ0CS", "B008LOW38E", "B00C2E0FVQ", "B0009PUPSS", "B000V1UALM", "B00363PRK6", "B00CGQE3JU", "B001Y8PT5I", "B0009PUR5E", "B00EQF8OGC", "B000N37E9O", "B000BM8RT8", "B00GSMQ36O", "B00B49S6RU", "B00AAQZK5E", "B005CB7XCK", "B0053GV2T4", "B00J2EMDDW", "B00ATSHJ1Q", "B000EH0NLK", "B002PWFSHG", "B006IYD55Y", "B001DC5HG6", "B00CN0FNUC", "B001SAA08I", "B004HKTP32", "B000OP9UY8", "B000P0O12I", "B001CZBKOM", "B0030DBHHO", "B00022OK2A", "B00FHRADQ2", "B005GHMT06", "B001AIBJSI", "B005Z8HAUK", "B001MWMDIW", "B0055DX9JQ", "B006QR1L5O", "B003LDKNZ0", "B002HU086C", "B0010O748Q", "B00GVL5EI0"], "also_viewed": ["B000I6420U", "B009A80W1K", "B000BH46MU", "B002MFTO44", "B00AAQZK5E", "B000BH8W6G", "B00EVBVB70", "B002KKBSJA", "B000BH2AZU", "B00DFMLMNE", "B005GHMT06", "B000BH8W6Q", "B00IUO8PQO", "B004M0X9BQ", "B002QPCUIC", "B003C4Z7W2", "B004M0YXU2", "B002KKBT9Y", "B00IRECJFA", "B00BGU41G2", "B004M0YY0G", "B000BH46O8", "B0054MQ11Q", "B00197JP04", "B000P6BGYI", "B00BA06BRU", "B000EQCVNY", "B006P1BGGU", "B0018ZRMUM", "B0043AK0O4", "B00795TED8", "B005NIAJCS", "B001NI6TBW", "B008O5N4FG", "B00BINO8RY", "B004C6JAEK", "B00AAQZM5W", "B000A8BSJE", "B007IBT9X8", "B002QZXV5S", "B002PB0DZO", "B002PB2HPS", "B0029AAUUY", "B002XJ9UJ8", "B0075D2J2C", "B00AL1KK9Y", "B00J0RC5JI", "B003V3U9JK", "B007GF8XK6", "B00AAQZ644", "B000P9GZZ0", "B00AL1KJP4", "B0018ZRMUC", "B0006V2B2I", "B005EPRNSI", "B00CPLK09S", "B00B980YNA"], "bought_together": ["B000BH8W6G", "B000BH46O8"]}}