{"asin": "B001044RIQ", "description": "Enjoy improved optical performance while retaining close-up ability with the large aperture Sigma 70-200mm macro zoom lens. The lens--which offers a minimum focusing distance of 39.4 inches and a maximum magnification ratio of 1:3.5--is suitable for a variety of subjects, including portraits, landscape shots, and macro photos. The lens offers two special low-dispersion (SLD) and three extraordinary low-dispersion (ELD) glass elements, providing excellent correction for all types of aberrations and creating high-quality images throughout the entire zoom range. The super multi-layer coating, meanwhile, reduces flare and ghosting. Finally, the lens incorporates a Hyper Sonic Motor (HSM), which ensures a quiet and high-speed autofocus (AF) as well as full-time manual focusing ability. Other features include inner focusing and inner zooming systems, a removable tripod collar, and a 77mm filter size.SpecificationsFocal length: 70-200mmMaximum aperture: f/2.8Lens construction: 18 elements in 15 groupsAngle of view: 34.3 to 12.3 degreesNumber of diaphragm blades: 9Minimum aperture: f/22Minimum focusing distance: 39.4 inchesFilter size: 77mmHood: Petal typeCorresponding AF mounts: Sigma, Canon, Nikon, Sony/Minolta, Pentax, Four ThirdsDimensions: 3.4 inches in diameter and 7.3 inches longWeight: 48.3 ouncesWarranty: 4 year", "title": "Sigma 70-200mm f/2.8 EX DG HSM II Macro Zoom Lens for Nikon Digital SLR Cameras", "imUrl": "http://ecx.images-amazon.com/images/I/41kFt0xooML._SY300_.jpg", "related": {"also_viewed": ["B003HC8VA4", "B0012GDOQS", "B003HC8V9A", "B00005LEOH", "B00009MDBQ", "B00A34GP52", "B0013DG08E", "B002JCSV8U", "B0013DCX1C", "B007SRLJCQ", "B0012GFPPG", "B003HC8VB8", "B009VZOK0Q", "B001NEK2QO", "B0012GHSF6", "B003HC8V8Q", "B00A34GQEC", "B0017UYC60", "B00005LEOI", "B00AXZYVNE", "B003HC8VAO", "B003A6NU3U", "B001955P8W", "B0058NYW3K", "B004M18N20", "B000LRL3DU", "B001042Q4S", "B00A49ZOK8", "B000A7B9TE", "B00005LE74", "B001542X64", "B000HJPK2C", "B000CDA7Y4", "B000CMNL52", "B00156OZ68", "B007RZB3KM", "B0000A1G07", "B00021EE4U", "B001542X5K", "B003YH9DZE", "B000VDCT3C", "B0012X61U2", "B000CDA7XA"], "buy_after_viewing": ["B003HC8VA4", "B00004ZCJM", "B0012GDOQS", "B003HC8V9A"]}, "categories": [["Electronics", "Camera & Photo", "Lenses", "Camera Lenses", "Digital Camera Lenses"]]}