{"asin": "B001FWBUUG", "description": "With its sleek design and huge capacity, the FreeAgent&reg; Go portable storage solution makes it easy to take your photos, music, videos, and documents everywhere. Included, easy-to-use software helps keep your information safe with automatic data backup and encryption of your important files and folders. You can sync content between your work and home computers so you&rsquo;ll always have your most current versions. And you can take advantage of the world&rsquo;s first portable drive with a convenient desktop dock accessory. Simply pop your drive into the FreeAgent dock whenever you want to access your files &mdash; no more fumbling for cables!Winner of CNET Editors&rsquo; Choice, September 2008 and PC Magazine Editors&rsquo; Choice, October 2008.&ldquo;The Seagate FreeAgent Go is our favorite portable hard drive to date and takes our award for Editors&rsquo; Choice. The drive is well designed and fast, and you won&rsquo;t find a better value for the price.&rdquo; &mdash; Justin Yu, CNETFreeAgent&reg; Go is the thinnest portablehard drive availableAutomatically back up and sync yourfiles with the included softwareFreeAgent&reg; Go with a convenient docking station&mdash; no more fumbling for cablesSleek Design and Huge CapacityWith its sleek design and huge capacity, the FreeAgent&reg; Go portable storage solution makes it easy to take your photos, music, videos, and documents everywhere. Pocket and carry your data with ease thanks to a sleek design&mdash;the thinnest portable storage solution on the market. Even the cable folds up compactly.Easy-to-use SoftwareIncluded, easy-to-use software helps keep your information safe with automatic data backup and encryption of your important files and folders. You can sync content between your work and home computers so you&rsquo;ll always have your most current versions.Convenient Dock and Travel CaseTake advantage of the world&rsquo;s first portable drive with an optional desktop dock accessory. Simply pop your drive into the FreeAgent dock whenever you want to access your files &mdash; no more fumbling for cables!&nbsp;Key BenefitsPocket and carry your data with ease thanks to a sleek design&mdash;the thinnest portable storage solution on the market. Even the cable folds up compactly.Choose from a variety of colors to complement your style and help you differentiate between multiple drives.Access your files with unparalleled convenience by simply popping your drive into the FreeAgent desktop dock accessory.You&rsquo;ll never fumble for cables again! Even purchase another dock for convenience at home and at the office.Take all your photos, music, videos and documents with you everywhere thanks to large storage capacities of 250GB, 320GB, and 500GBEasily protect your data with automatic backup software.Keep your most important files and folders private with software encryption technology.Sync content between your work and home computers so you&rsquo;ll always have your most current versions.Experience fast data transfer with a USB 2.0 interface.Get started quickly with pre-loaded software. No CDs!Save energy by using one small drive for both mobile and desktop needs, and take advantage of an environmentally smart utility that can power down your drive when it&rsquo;s not in use.Enjoy peace of mind with a 5-year limited warranty from the worldwide leader in storage solutions.What&rsquo;s in the BoxFreeAgent&reg; Go portable hard drive, FreeAgent software pre-loaded on drive (Windows only), Quickstart guide, New and flexible USB travel cable. Optional dock not included", "title": "Seagate FreeAgent Go 250 GB USB 2.0 Portable External Hard Drive ST902503FGA2E1-RK (Silver)", "price": 54.0, "imUrl": "http://ecx.images-amazon.com/images/I/41eOxFN5K1L._SY300_.jpg", "related": {"also_viewed": ["B003BLQHN4", "B003ELOSEG", "B004CG4WOI", "B006Y5UV36", "B006B9B2PQ", "B001FA064E", "B003ELOSFA", "B001UHWHO4", "B0045JLPOM", "B003ELOSI2", "B00834SJSK", "B00BOHNZ0A", "B003ELOSGE", "B0085JRRAY", "B002KC55OM", "B00A2WV5Z0", "B004SGJCCO", "B001CBNH4C", "B00BOHNYTW", "B003ELOSGY", "B006Y5UV4U", "B001GDLYAU", "B0012YW1AU", "B001FWEETK", "B005J7YCHG", "B001SJZV10", "B00H4XH5IG", "B002KC8S3C", "B0028Y4QEC", "B0091G8J5W", "B006Y5UPZU", "B00H4XH5FY", "B001SJVU6K", "B008R7FC74", "B00BOHNYU6", "B006Y5UQ3Q", "B006Y5UQ3G", "B005J7YA64", "B00H4XH5GI", "B00915RWV0", "B00CI3BISU", "B002JSQ97Y", "B001FWCB7C", "B00EAS8AA0"], "buy_after_viewing": ["B00834SJSK", "B00EAS8AA0", "B00H4XH5IG", "B005J7YCHG"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]]}