{"asin": "B000144I2Q", "categories": [["Electronics", "Camera & Photo", "Lenses", "Camera Lenses", "Digital Camera Lenses"]], "description": "Lens-making is an art--Nikon artisans craft Nikkor optics from the finest materials, taking pride in adding their intellect and technique to bring the world's finest lenses to life. They push the leading edge of lens-making in their effort to provide the \"glass\" that makes the world's greatest pictures.The Nikon 17-55mm f2.8G ED-IF AF-S DX is the world's first constant f2.8 3.2x zoom lens developed exclusively for use with Nikon DX Format. The 3.2x zoom covers from a wide angle of 79 degrees to a narrow angle of 28 degrees 50 minutes (equivalent to 25.5mm to 85.5mm for 35mm format) and is ideal for architecture, landscape, groups shots and portraits. DX design enables a combination of wider angle-of-view with optical characteristics that are optimized for Nikon digital SLR camera sensors. Nikon DX design produces a smaller image circle (the size of the image that is projected by the lens on to the sensor) enabling smaller lens diameter, lighter weight, and optimal image quality from center-to edge-to-corner on the image.Three Extra-Low Dispersion (ED) glass elements minimize chromatic aberration and provide higher resolution and superior contrast. Three aspherical lens elements minimize distortion in a lightweight and compact design similar to 17-35mm f2.8 lens. The exclusive Silent Wave Motor enables ultra-high-speed autofocusing with exceptional accuracy and powerful super-quiet operation. [M/A] and [M] modes allow rapid switching between AF and MF operation. Internal Focusing design for smoother focusing and great body balance. Nikon D-type design provides precise distance information for flash and ambient light exposure processes. The rounded diaphragm makes out-of-focus elements appear more natural. The G Type DX Nikkor is designed exclusively for use with Nikon Digital SLR models.ED glass: An essential element of Nikkor telephoto lensesNikon developed ED (Extra-low Dispersion) glass to enable the production of lenses that offer superior sharpness and color correction by minimizing chromatic aberration. Put simply, chromatic aberration is a type of image and color dispersion that occurs when light rays of varying wavelengths pass through optical glass. In the past, correcting this problem for telephoto lenses required special optical elements that offer anomalous dispersion characteristics--specifically calcium fluoride crystals. However, fluorite easily cracks and is sensitive to temperature changes that can adversely affect focusing by altering the lens' refractive index. So Nikon designers and engineers put their heads together and came up with ED glass, which offers all the benefits and none of the drawbacks of calcium fluorite-based glass. With this innovation, Nikon developed several types of ED glass suitable for various lenses. They deliver stunning sharpness and contrast even at their largest apertures. In this way, Nikkor's ED-series lenses exemplify Nikon's preeminence in lens innovation and performance.Nikon Super Integrated Coating ensures exceptional performanceTo enhance the performance of its optical lens elements, Nikon employs an exclusive multilayer lens coating that helps reduce ghost and flare to a negligible level. Nikon Super Integrated Coating achieves a number of objectives, including minimized reflection in the wider wavelength range and superior color balance and reproduction. Nikon Super Integrated Coating is especially effective for lenses with a large number of elements, like our Zoom-Nikkors. Also, Nikon's multilayer coating process is tailored to the design of each particular lens. The number of coatings applied to each lens element is carefully calculated to match the lens type and glass used, and also to assure the uniform color balance that characterizes Nikkor lenses. This results in lenses that meet much higher standards than the rest of the industry.Aspherical lens elementsNikon introduced the first photographic lens with aspherical lens elements in 1968. What sets them apart? Aspherical lenses virtually eliminate the problem of coma and other types of lens aberration--even when used at the widest aperture. They are particularly useful in correcting the distortion in wide-angle lenses. In addition, use of aspherical lenses contributes to a lighter and smaller lens design. Nikon employs three types of aspherical lens elements. Precision-ground aspherical lens elements are the finest expression of lens-crafting art, demanding extremely rigorous production standards. Hybrid lenses are made of a special plastic molded onto optical glass. Molded glass aspherical lenses are manufactured by molding a unique type of optical glass using a special metal die technique.Internal FocusingImagine being able to focus a lens without it changing in size. Nikon's IF technology enables just that. All internal optical movement is limited to the interior of the non-extending lens barrel. This allows for a more compact, lightweight construction as well as a closer focusing distance. In addition, a smaller and lighter focusing lens group is employed to ensure faster focusing. The IF system is featured in most Nikkor telephoto and selected Nikkor zoom lenses.Distance informationD-type and G-type Nikkors relay subject-to-camera distance information to AF Nikon camera bodies. This then makes possible advances like 3D Matrix Metering and 3D Multi-Sensor Balanced Fill-Flash. Note: D-type and G-type Nikkors provide distance information to the following cameras: Auto exposure; F6, F5, F100, F90X, F80, F75, F70, F65, F60, F55, F50, Pronea S, Pronea 600i, D2 series, D1 series, D100 and D70s/D70. Flash control; F6, F5, F100, F90X, F80, F75, F70, D2 series, D1 series, D100 and D70s/D70.G-type Nikkor lensThe G-type Nikkor has no aperture ring; aperture should be selected from camera body.Silent Wave MotorNikon's AF-S technology is yet another reason professional photographers like Nikkor telephoto lenses. AF-S Nikkors feature Nikon's SWM which converts \"traveling waves\" into rotational energy to focus the optics. This enables high-speed autofocusing that's extremely accurate and super quiet.M/A modeAF-S Nikkors feature Nikon's exclusive M/A mode, that allows switching from autofocus to manual operation with virtually no time lag--even during AF servo operation and regardless of AF mode in use.DX NikkorCompact and lightweight DX Nikkor lenses featuring a smaller image circle are specially designed and optimized for Nikon D2-series, D1-series, D100, and D70s/D70 digital SLR cameras. These are ideal options for landscape photographers and others who need to shoot expansive scenes with Nikon DX-Format digital SLRs. Note: We do not recommend use of DX Nikkor with 35mm (135) or IX240 format cameras.What's in the Box:Lens, 77mm snap-on front lens cap LC-77, rear lens cap LF-1, flexible lens pouch CL-1120, bayonet hood HB-31.", "title": "Nikon 17-55mm f/2.8G ED-IF AF-S DX Nikkor Zoom Lens", "brand": "Nikon", "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41DWF9GPKCL._SY300_.jpg", "related": {"also_bought": ["B00007EDYY", "B00004ZCJM", "B00BI9X7UC", "B0000BZLBQ", "B0045KGZOG", "B0042X9L6A", "B00BJ3NGFS", "B00009R9EO", "B0042X9LC4", "B0050YG3CU", "B002JCSV8U", "B00004ZCI3", "B00436G2OU", "193753832X", "B0000BZLAC", "B002L60TTI", "B00309D9JW", "B001S2PPT0", "B0013A1XDY", "B004861IX0", "B004OVE188", "B006TAP096", "B001GCVA0U", "B00017LUOC", "B004YW79F4", "B00005LEOH", "B000EOSHGQ", "B000EU1NAM", "B00017LUNI", "B007NDL56A", "B009VZOK0Q", "B0000BVDG8", "B0030BG8ZC", "B000JLM50I", "B002JCSV6M", "B000KKPN5C", "B00F5JV4NS", "B0049U477Y", "B0095ZKUD8", "B007SXJ26A", "B004Y1AYAC", "B00005LEOM", "B003ZSHNE0", "B00COHAQNI", "B000VDCT3C", "B00603RTC8", "B007VGGIB6", "B000VJX7DW", "B00G9G76PQ", "B004V6BQ3O", "B001F6TXME", "B0098TAGHQ", "B00007EDZG", "B003Y30334", "B00006JN3G", "B0037KM0XA", "B0045TYDNC", "B007M54E1M", "B003L1ZYZ6", "B00344R61K", "B003KIIQYG", "B001BTG3OQ", "B005EP26J4", "B00DN43RCI", "B002WR7VSS", "B00CXM03D2", "B0026FCKC8", "1933952806", "B00009R96C", "B00CKJ0LQC", "B002DW99H8", "B005HWC6PI", "B0095ZLP3C", "B001ET5U92", "B004XUAI8M", "B007VGGIRK", "B000BYCKUI", "B00005LE77", "B001B057U6", "B00AXTQQDS", "B000BYCKU8", "B00009MDBQ", "B0099XGZXA", "B002ZIMEMW", "B00BWYGEC6", "B003ZSHNEA", "B000PH1DL8", "B004TKY4OK", "B001ENW61I", "B004OR15LI", "B00FXYTLIK", "B005C50H2Y", "B00017LSPI", "B000144I30", "B00005LEOS", "B00908A8PK", "B0000BZLAD", "B004QC6VAG"], "bought_together": ["B00004ZCJM"], "buy_after_viewing": ["B001S2PPT0", "B003A6NU3U", "B0000BZLBQ", "B00HQ4W4PC"]}}