{"asin": "B00EDCF0MY", "categories": [["Electronics", "Car & Vehicle Electronics", "Car Electronics", "Car Audio", "Car Stereo Receivers"]], "description": "To truly make a Hi-Fi system wireless you need a reliable Bluetooth Receiver that has two things - range and sound quality. The Bolse NFC Enabled Bluetooth Music Receiver offers both in a neat package and with the ability to pair with multiple devices.Tap To PairWith phones having NFC operating on Android 4.1 or higher NFC is the fastest way to connect with the Bolse NFC Music Receiver. Just tap the two together when prompted on the screen to pair immediately and start using the receiver as your personal wireless service.Equal To CD QualityListening to music through wireless transmissions on the Bolse Bluetooth Receiver and playing directly from a CD make no difference. Sound quality and reproduction of the entire range of frequencies is handled immaculately by the chipset within the Bolse receiver to ensure audiophile quality.FeatureUsing your phone's Bluetooth connection, Bolse Bluetooth Music Receiver lets you play your smartphone's audio through your stereo system or stand-alone speakers. You'll be able to browse your playlist and change music tracks from up to thirty feet away. The receiver stores settings for connecting to up to eight devices - ideal for large households.Package IncludesBolse Bluetooth Music Receiver, power adapter, 3.5mm-to-RCA cable, 3.5mm audio cable, and quick install guide.12 Month Manufacturer Warranty from Bolse", "title": "Bolse&reg; NFC Enabled Bluetooth Music Receiver - Bluetooth wireless audio receiver", "price": 23.99, "salesRank": {"Electronics": 4666}, "imUrl": "http://ecx.images-amazon.com/images/I/41AiHJvqGAL._SY300_.jpg", "related": {"also_bought": ["B00I02DG9M", "B009OBCAW2", "B00CY4SG10", "B00IVUZCOU", "B0049P6OTI", "B00J4E0VNE", "B00IZC34H6", "B00C2P61FO", "B002UL0XH2", "B00B3YTQXY", "B00E3FHXYO", "B00CE3IC74", "B00IVPU88U", "B001N43G6W", "B00IVPU7AO", "B00DR0PDNE", "B00CSJHCH0", "B00CELZD8C", "B00GTGETFG", "B008AGQMQC", "B009ZIILLI", "B005DIRI6I", "B0088U4YAG", "B009NLTW60", "B001CQTLJM", "B00GX71GNO", "B00B3OA7R8", "B0047T79VS", "B004YEBK66", "B00JDAIMQ2"], "bought_together": ["B00DR0PDNE"], "buy_after_viewing": ["B009OBCAW2", "B00IZC34H6", "B00HZVPD72", "B00IQBSW28"]}}