{"asin": "B001D7REIK", "description": "The Iomega Prestige 500GB External Hard Drive is an easy-to-use, affordable, and energy-efficient desktop storage solution. Featuring a stylish and durable aluminum design, plug-and-play functionality, and a secure EMC Retrospect Express software license for easy file backup, the Prestige is the easy way to store your photos, videos, and music, and to protect your important computer files.The included stand lets you place the Prestige both vertically and horizontally.View larger.With a 7200 RPM spindle speed and 8 MB or more cache, you'll have quick access to your data.View larger.Plug-and-Play Simplicity and 500 GB Storage CapacityThe Iomega Prestige uses a USB 2.0 interface for fast data transfers with universal compatibility. The USB 2.0 interface allows for plug-and-play simplicity with a data transfer rate of up to 480 Mbps. Additionally, the drive is already preformatted NTFS, so you don't have to waste time formatting to use it.The Prestige features a drive with 7200 RPM spindle speed and an 8MB or higher cache buffer. This provides performance that results in fast access speeds and low latency.And with 500GB of storage capacity, the Prestige gives you the ability to store up to 2 million photos, over 9,000 hours of music, or 750 hours of video.Stylish Aluminum CaseThe Prestige has durable aluminum construction with a brushed-metal finish that will stylishly complement your desktop or workstation. An included stand gives you the option of either placing the drive horizontally or vertically.Not only does the aluminum design look good, it also works to dissipate heat, allowing the drive to run cooler and quieter.Backup Software IncludedA license for EMC's Retrospect Express software is included (software is available via download), allowing for easy file backup that keeps your data safe. Also included is free MozyHome Online Backup, which provides 2GB of online data storage.Compatible with Macs and PCsWhether you have a Mac or PC, the Prestige will do the job. The drive requires a PC with Windows Vista, Windows XP Home, Windows XP Professional or Windows 2000 Professional, and a Pentium II class processor with 256MB RAM and a USB 2.0 connection, or a Mac (PowerPC or Intel) with OS X 10.3 or above with a USB 2.0 port.The Iomega Prestige 500 GB External Hard Drive is powered by an Energy Star qualified adapter and is backed by a one-year warranty.What's in the BoxIomega Desktop Hard Drive, Connection Cable, Power Adapter Cable, Quick Install Guide, HTML User Manual and Help Files, Backup software license included, software via download (PC only).The stylish aluminum enclosure complements your desktop.", "title": "Iomega Prestige 500 GB USB 2.0 Desktop External Hard Drive 34270", "price": 69.0, "imUrl": "http://ecx.images-amazon.com/images/I/41aqK0lyflL._SY300_.jpg", "related": {"also_viewed": ["B003GALRIA", "B004L9M4C8", "B0041RSHZ8", "B004NIAG5E", "B000HI9O5W", "B001DCELO0", "B004NIDHXC", "B002QEBMB4", "B002BWOO2K", "B009JHI3TA", "B004CF2RT6", "B002LZV0B0", "B008DW96NY", "B003B8PPEY", "B00GQVP9HG", "B005EWTL7C", "B00C0NWAUS", "B001FWCDQG", "B00834SJSK", "B00FPMDQS6", "B006Y5UV4U", "B00EY5C8KC", "B004SH5VQ4", "B0033ZX8K8", "B00EY5APPC", "B001HAMNSY", "B00134BWHW", "B0053ORUS8", "B008DW976A", "B00CI3BISU", "B001UI49XA", "B005J7YCHG", "B002QEBMCI", "B0058VIWUG", "B007FQNLR6", "B0041OSAZS", "B00ESV9QCK", "B001FW9QGQ", "B004TB9JUI", "B004I3VZJK", "B002QID2NG", "B003MVZ60S", "B000VZCEUI", "B00829THO6", "B008R7FC74", "B006Y5UV4A", "B005J7YBRW", "B002JMYCTC", "B00A3U8JV4"], "buy_after_viewing": ["B003GALRIA", "B00E83X9P8", "B009JHI3TA", "B00834SJSK"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "External Hard Drives"]]}