{"asin": "B000WHSFYY", "description": "Speedier than ever with the latest Intel dual-core processor, the Apple iMac all-in-one desktop PC sports a sleek, professional aluminum enclosure that's joined precisely to a 20-inch glass cover to create a virtually seamless front surface. It's powered by a 2.66 GHz Intel Core 2 Duo processor, which includess an amazingly fast 1066 MHz front-side bus speed and super-sized 6 MB L2 cache. Part of Intel's 45-nanometer (nm) Penryn series, this processor boosts both speed and efficiency while helping to reduce power consumption. This dual-core processor also provides an optimized, multithreaded architecture for improved multitasking, video, and gaming performance.The iMac also features an ultra-thin aluminum Apple Keyboard--with an extended layout and dedicated keys for Mac features such as brightness, volume, eject, play/pause, and Expos&eacute;--as well as the wired Mighty Mouse. It's pre-loaded with Apple's Mac OS X 10.5 Leopard operating system, which enables easy backup of your most important data via Time Machine, a redesigned desktop that helps eliminate clutter. It also comes with the iLife '08 suite of applications--including iPhoto, iMovie, Garageband, and iTunes--and the newest version of the fast-loading Safari web browser.Hardware features include a 320 GB hard drive, 2 GB of RAM (with a 4 GB maximum capacity), 8x SuperDrive for burning movies to DVD and music mixes to CD, integrated 802.11n wireless LAN, Gigabit Ethernet wired networking, Bluetooth 2.1+EDR connectivity, and ATI Radeon HD 2600 PRO video card with 256 MB dedicated memory.Power on a PedestalDesigned with a recyclable anodized aluminum frame and glass cover, the iMac is friendlier to the environment..The new keyboard's ultrathin anodized aluminum enclosure features low-profile keys that provide a crisp, responsive feel.With its anodized aluminum frame set upon a sleek pedestal, the new iMac instantly transforms your workspace from cluttered desktop to brilliant display podium. Because the iMac's housing is made from a single sheet of aluminum, you won't see any seams or screws except for a single compartment on the bottom that provides easy access to the memory slots. The glossy widescreen 20-inch glass display makes photos and movies come alive with rich color. And the built-in iSight camera and microphone are integrated so neatly you barely notice they're there. Aside from the design details, the iMac is also friendlier to the environment with highly recyclable and durable materials including scratch-resistant glass and professional grade aluminum. The power-efficient iMac also meets the stringent new Energy Star 4.0 requirements.With its elegant anodized aluminum enclosure, the new Apple Keyboard looks equally at home in your living room or on your desk. Just connect it to the USB port on your iMac and start enjoying the crisp, responsive feel of its low-profile keys. The extended layout has a full complement of keys, including document navigation controls, a numeric keypad, and special function keys for Mac features such as brightness, volume, eject, play/pause, Expos&eacute;, and more. Two USB 2.0 ports provide high-speed connectivity for your iPod, Mighty Mouse, digital camera, and other USB-based electronic devices.Intel Core 2 Duo ProcessorExperience faster, more nimble application performance and improved energy efficiency with this 2.66 GHz Core 2 Duo processor from Intel's 45nm Penryn lineup. The new hafnium-infused circuitry--which reduces electrical current leakage in transistors--helps to reduce power consumption while delivering. powerful processing speeds. This 2.66 GHz Core 2 Duo processor is aided by a 1066 front-side bus speed and a super-sized 6 MB L2 cache--both top-of-the-line for Intel's Penryn processors. (An L2, or secondary, cache temporarily stores data; and a larger L2 cache can help speed up your system's performance. The FSB carries data between the CPU and RAM, and a faster front-side bus will deliver better overall performance.)The Intel Core 2 Duo's 128-bit SSE3 vector engine handles 128-bit computations in a single clock cycle, accelerating data manipulation by simultaneously applying a single instruction to multiple data. And its two execution cores are designed to share resources and conserve power, helping it to achieve higher levels of performance since it uses fewer watts.Hard Drive and MemoryThe 320 GB Serial-ATA (SATA) hard drive (7200 RPM) quickens the pace with a higher speed transfer of data--akin to FireWire and USB 2.0. The 2 GB of PC6400 DDR2 RAM (two 1 GB SO-DIMMs) has an industry-leading 800 MHz speed, and the RAM capacity can be increased to 4 GB.Graphics and VideoThe 20-inch widescreen TFT active-matrix LCD offers a resolution of 1680 by 1050 pixels. It has a brightness rating of 290 cd/m2 (candela per square meter), a contrast ratio of 800:1, and a viewing angle of 160 degrees (both horizontal and vertical). An ATI Radeon HD 2600 PRO graphics processor powers the iMac with 256 MB of dedicated GDDR3 memory. It features some of the most advanced graphics technology available and delivers new levels of visual realism and a huge texture fill rate for smooth surfaces and complex character details. GDDR3 (Graphics Double Data Rate, version 3) is a graphics card-specific memory technology that's better able to deliver fluid frame rates for even the most advanced games and applications.This iMac also enables you to connect a second display in either extended desktop mode or video mirroring mode. The mini-DVI port connects to DVI displays, VGA monitors and projectors, and S-video and composite devices using the appropriate adapter (sold separately).Wired and Wireless ConnectivityYou get a full complement of ports on the back of the iMac, including three USB 2.0 and two flavors of Firewire--400 and 800.The iMac gives you plenty of room to grow, accommodating as many as five peripherals at a time thanks to its three USB 2.0 ports and the two USB 2.0 ports on the Apple Keyboard. It also includes two powered FireWire ports--one FireWire 400 and one FireWire 800 (one of the fastest peripheral standards available)--enabling you to quickly transfer content from digital video cameras, hard drives, and other high-speed devices.Share files around your house with built-in 10/100/1000BASE-T Ethernet as well as the next-generation high-speed wireless 802.11n technology, which is integrated into the latest Apple Airport Extreme Base Station. The iMac is also Wi-Fi Certified to work with base stations and routers that use industry-standard 802.11a, 802.11b, or 802.11g wireless technologies.The integrated Bluetooth wireless connectivity--version 2.1 + Enhanced Data Rate (EDR)--allows you to use a wireless keyboard or mouse, and synchronize peripherals such as cell phones and PDAs. Enjoy high-quality sound on almost any speaker system with double-duty analog/digital audio. Record digital and analog sources through audio line in, perfect for your latest podcast in GarageBand.SuperDriveIntegrated neatly into the iMac is a slot-loading SuperDrive that lets you play and burn your own CDs and DVDs--including double-layer DVDs. And there's no disc tray--just slide the disc right in. It offers the following speeds:Writes DVD+R DL and DVD-R DL discs at up to 4x speedWrites DVD-R and DVD+R discs at up to 8x speedWrites DVD-RW at up to 6x speed and DVD+RW discs at up to 8x speedReads DVDs at up to 8x speedWrites CD-R discs at up to 24x speedWrites CD-RW discs at up to 16x speedReads CDs at up to 24x speedOther FeaturesTwo SO-DIMM slots support up to 4 GB of RAMBuilt-in stereo speakers with internal 24-watt digital amplifierSupport for external display in extended desktop mode: 1920 by 1200 pixels for digital and 2048 by 1536 pixels for analogMeets ENERGY STAR requirements with maximum continuous power rating of 200 wattsDimensions: 19.1 x 18.5 x 7.4 inches (WxHxD)Preloaded with Leopard, you'll enjoy enhanced productivity and a clutter-free desktop (thanks to the the redesigned 3D Dock with Stacks).Preloaded with Leopard and iLife '08The biggest Mac OS X upgrade ever, the Mac OS X 10.5 Leopard operating system features over 300 new features, including:Time Machine, an effortless way to automatically back up everything on a MacA redesigned Finder that lets users quickly browse and share files between multiple MacsQuick Look, a new way to instantly see files without opening an applicationSpaces, an intuitive new feature used to create groups of applications and instantly switch between themA brand new desktop with Stacks, a new way to easily access files from the DockMajor enhancements to Mail and iChatLeopard's new desktop includes the redesigned 3D Dock with Stacks, a new way to organize files for quick and easy access with just one click. Leopard automatically places web, email and other downloads in a Downloads stack to maintain a clutter-free desktop, and you can instantly fan the contents of this and other Stacks into an elegant arc right from the Dock. The updated Finder includes Cover Flow and a new sidebar with a dramatically simplified way to search for, browse and copy content from any PC or Mac on a local network.Time Machine lets you easily back up all of the data on your Mac, find lost files and even restore all of the software on their Mac. With just a one-click setup, Time Machine automatically keeps an up-to-date copy of everything on the Mac. In the event a file is lost, you can search back through time to find deleted files, applications, photos and other digital media and then instantly restore the file.The iMac also comes with the iLife '08 suite of applications that make it easy to live the digital life. Use iPhoto to share entire high-res photo albums with anyone who's got an email address. Break into indie filmmaking with iMovie and iDVD. Then take all the stuff you made on your iMac and share it on the web in one click with iWeb.iLife '08 also features iWeb '08, with live web widgets such as Google Maps that let you create even more dynamic websites, and GarageBand '08, with its new Magic GarageBand feature that makes it fun and easy for both musicians and non-musicians to create great sounding songs.Included SoftwareMac OS X v10.5 Leopard (includes Time Machine, Quick Look, Spaces, Spotlight, Dashboard, Mail, iChat, Safari, Address Book, QuickTime, iCal, DVD Player, Photo Booth, Front Row, Xcode Developer Tools); iLife &#x92;08 (includes iTunes, iPhoto, iMovie, iDVD, iWeb, GarageBand)What's in the BoxiMac, Apple Keyboard, Mighty Mouse, Apple Remote, cleaning cloth, power cord, install/restore DVDs, printed and electronic documentation", "title": "Apple iMac MB324LL/A 20-inch Desktop PC (2.66 GHz Intel Core 2 Duo, 2 GB RAM, 320 GB Hard Drive, DVD/CD SuperDrive)", "price": 65.94, "imUrl": "http://ecx.images-amazon.com/images/I/31Q0eDNUkIL._SX300_.jpg", "related": {"also_viewed": ["B002C74E9C", "B00AP6UM2U", "B004YLCGBC", "B004YLCBRG", "B004YLCH0C", "B004YLCHLQ", "B004YLCFCM", "B004YLCJ5K", "B004YLCJXC", "B0013FK9U2", "B004YLCIC4", "B005CWIN1E", "B005CWIVYI", "B003GSLU3E", "B003XIJ3MW", "B002TMRZOQ", "B00746WPXI", "B007476KRY", "B001AMHWP8", "B004YLCKYA", "B005CWHZP4", "B002QQ8EKO", "B005DLDTAE", "B00EDI0WW6", "B00746YZS6", "B00BQ8RM1A", "B004FK3QWK", "B007TGDXNO", "B002TLTGM6", "B005DLDO4U"], "buy_after_viewing": ["B003XIJ3MW", "B001V63L9E", "B005DLDO4U", "B001AMHWP8"]}, "categories": [["Electronics", "Computers & Accessories", "Desktops"]]}