{"asin": "B00123WZWK", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Cables & Interconnects", "Video Cables", "HDMI Cables"]], "description": "The Cmple Ultra High-Speed HDMI Cable Braided can help you obtain the maximum performance from your latest high-definition electronic devices. Use this cable to connect your HDTV to your cable box, satellite dish, Blu-Ray player, and more, and experience quality audio and video (up to 1080p) from your home.  The cable is backwards compatible with all previous HDMI standards, so you'll be able to use this cable with all your HDMI devices. When you connect two devices with different HDMI standards, they will automatically find the best available connection.  This HDMI cable features shielding with a durable, black PVC outer layer. The shielding provides outstanding defense against outside interference and helps maintain the integrity and purity of the digital signal.  The cable also features gold-plated connectors that resist corrosion while offering optimal signal transfer with lower distortion at the point of contact. The result is sound and picture quality that is faithful to the original. - See more at: http://www.cmple.com/p-464-30awg-high-speed-hdmi-cable-without-ferrite-cores-black-6ft.aspx#sthash.VkeB7nX0.dpuf", "title": "6ft PTC Premium Gold Series Elegant Dual Tone HDMI Cable, Supports Deep Color", "price": 3.13, "imUrl": "http://ecx.images-amazon.com/images/I/31P3vWHwgVL._SY300_.jpg", "brand": "PTC", "related": {"also_bought": ["B00BD7UVO4", "B00AWX6EYQ", "B00B9JR5EU", "B00F9YYHW4", "B00F9YYHSI", "B00B9JR5H2", "B005NEZDUA", "B00FL4EWEK", "B000NJH592", "B00AWKC0JM", "B003A9LH28", "B000M87F0I", "B008I64126", "B00BFDHV9E", "B00068NUOE", "B004OZR3I4", "B00AWKC0EC", "B000O5N5AI", "B00IAELTKI", "B001DBIT08", "B0002L5R78", "B003L1ZYYM", "B00FO12XY6", "B008I640QS", "B00EUY59Z8", "B000AA2RCY", "B001FA1E4U", "B0058O8F7I", "B007F9XHAY", "B000I1GZ6O", "B00IKMHS28", "B00F5NB7JK", "B005KOZNBW", "B002YD8DS2"], "bought_together": ["B00AWX6EYQ"], "buy_after_viewing": ["B000AA2RCY", "B003L1ZYYM", "B000NJH592", "B0014Z29OU"]}}