{"asin": "B003XFWSU4", "related": {"also_bought": ["B003XN24GY", "B00EKQ5ONI", "B0045XRK06", "B00F3J9GLM", "B006L6ZL8I", "B00080G0BK", "B002OJN250", "B001LJXZZG", "B00ITD5NV6", "B0033WSDOM", "B006NWJBZE", "B007ZSBR20", "B002C3IOZG", "B007TLABSY", "B00ELPSEVW", "B009TDIAPG", "B000E19MQ8", "B00DHEK0ME", "B002EK1QUW", "B00BWTYMPM", "B0027LSHMS", "B007WCYT4M", "B0065O6HFC", "B000YKH090", "B000YKC0UY", "B006G4SRXQ", "B0073XMSSE", "B00FQ1R7DG", "B000Q8UAWY", "B00C4QP8KU", "B001TH7GUU", "B003DGPWLK", "B000NSQNOG", "B0031R4OB0", "B00BWF5U0M", "B005NGQWL2", "B002VPE1QG", "B001R1RXUG", "B003ES5ZSW", "B000K6B2DI", "B001TH7GV4", "B00001ZWXA", "B00IBDOB5I", "B0002LLWZY"], "bought_together": ["B003XN24GY", "B0045XRK06"], "buy_after_viewing": ["B003XN24GY", "B00080G0BK", "B003FO0LG6", "B001R1RXUG"]}, "title": "ARCTIC Breeze Pro, USB-Powered 92mm Desktop Fan, Adjustable Fan Speed and Blowing Angle, 4-Port USB Data Hub - Silver/White", "price": 12.86, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31b6N9YtP6L._SY300_.jpg", "brand": "ARCTIC", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "USB Fans"]], "description": "ARCTIC Breeze Pro is a USB-powered desktop fan with adjustable fan speed between 800 to 1800 rpm and an integrated 4-port USB 2.0 data hub. ARCTIC Breeze Pro is designed to deliver gentle breeze to you and your immediate personal workspace quietly without overwhelming wind tunnel-type noise creating unnecessary distraction. ARCTIC Breeze Pro is ideal for areas sensitive to noise such as library, study hall, office cubicle and, meeting room or just a quiet evening at your own living room, constantly delivering gentle breeze circulating the air without overbearing fan noise. You can easily adjust the fan speed from 800 to 1800 rpm for the most comfortable air flow with the simple RPM control. The flexible yet durable gooseneck allows you to adjust ARCTIC Breeze Mobile easily for the best blowing angle. The sturdy base of ARCTIC Breeze Pro not only keeps the unit steady, a 4-port USB 2.0 data hub is also integrated into the base so you may conveniently transfer files from/to your flash drives, power up USB speakers or charging low-power USB devices such as Bluetooth headphone. We recommend charging your power-demanding smartphones and tablets using factory original charger or dedicated USB wall charger for the ideal power performance. ARCTIC Breeze Pro is a great year-round desktop companion delivering continuous refreshing and comfortable breeze quietly. ARCTIC Breeze Pro comes with a 2-year limited warranty."}