{"asin": "B00012BSJ4", "description": "When people ask me what my favorite game of all time is, I always answer the same thing:Metroid. Sure,Super Metroidon SNES took the concept and made it better, andMetroid Fusionwas a fantastic follow-up on the Game Boy Advance, but when push comes to shove the original is where my vote will always go. Then there'sMetroid Prime&#8230;but that's 3D and a story for a different day. This game and this story are all about the glory of 2D gaming.So you can only begin to imagine my excitement when Nintendo's newestMetroidredo appeared on my desk. For those of you that may not know,Zero Missionis a special edition of sorts. It's the originalMetroidwith spruced-up graphics, streamlined level designs and gameplay, plus a whole new chapter.At it's core, it is most definitely the originalMetroid, but as you travel around the world you start to notice differences. Hallways are changed, statues lead you to the next objective, and abilities like Power Grip and Space Jump that never existed in the original iteration pop up in time.Nintendo has been very hush-hush about this title since its announcement, and after playing through the game myself, I must admit I'm a little reluctant to give away too much, but I can give you some interesting facts to whet your whistle. The biggest chunk of new content takes place after you beat Mother Brain (which was where the original ended). Not only is this new zone fairly large (I would say it's bigger than Norfair and Brinstar combined) it incorporates a number of story elements that help tie the whole series together (includingMetroid Prime).In total, the game is still rather short. I beat it in roughly six and a half hours, and I wandered around a lot. But the new content is spectacular, and fans of the series will absolutely adore this special edition. And if you have never experiencedMetroid, then you are in for a treat. My one rip on this title is the fact that the game now holds your hand a little too much, so the title loses some of the wonder and puzzle solving that I loved about the original. But don't let this one setback stop you from picking up one of the greatest titles in the history of gaming.Concept:Update a classic with new graphics and lots of bonus materialGraphics:Crisp 2D sprites jump off your SP or GBA PlayerSound:Fantastic from beginning to endPlayability:Metroid's control set-up is still one of the most simple, yet complex schemes ever created &#8211; brilliantEntertainment:Replaying the original with added content is an 8-bit gamers dream come trueReplay:ModerateRated:9.5 out of 10Editor:Andy McNamaraIssue:February 20042nd Opinion:Much like the extended editions of The Lord of the Rings movies, Nintendo has reworked the originalMetroidto feature bonus content that ties into Samus' continuing adventures. I can't even begin to tell you how amazing this new material is. Let's just say that you're in for a big surprise after the Mother Brain fight. A huge surprise! I don't want to ruin the game for you, but I will say that there's a stretch of the game that I played with my jaw on the floor. Better yet, all of the original content has been extensively overhauled. The shape of the terrain has been altered dramatically, and as you progress through this incredible adventure you'll spot subtle changes every step of the way. With the original NES game included as a bonus, you'll get the chance to compare and contrast. Nintendo took one of the best games of all time and made it better. Buy it immediately.Rated:9.75 out of 10Editor:Andrew ReinerSubscribe to Game Informer--Game Informer Review", "price": 119.94, "imUrl": "http://ecx.images-amazon.com/images/I/61Lgrv%2BnFmL._SY300_.jpg", "related": {"also_bought": ["B00006M3R6", "B00002SVEM", "B00006LELB", "B00030GS80", "B0002Y67Q0", "B00005MDZZ", "B0000A09EP", "B00009WAUO", "B00002SVFV", "B00006FWTW", "B00005UK88", "B000LY4IDK", "B00005MI42", "B00005OARM", "B000070IW6", "B00005B8FZ", "B00027NWRY", "B00008URUF", "B00030GS8A", "B00008DHNU", "B0002TB4CW", "B000090W86", "B0001ZZNME", "B0007D4MW2", "B000AX224Y", "1930206488", "B00008YMZV", "B000238EJ4", "B000B5MV60", "B0002Y67QA", "B00005MDZY", "B000066TS4", "B00009WAUK", "B00008KU9Z", "B0000A9Y11", "B00005ATSM", "B000BI3SIC", "B00022GIYI", "B0001JXACA", "B00000IWYT", "B0009OO6XY", "B000087PM3", "B000BD8FXU", "B000HE9LEK", "B002JEUDX4", "B000087H7T", "B00007KQC3", "B00005MO5G", "B000VBB69M", "B0000BX8M6", "B0001615P2", "B00005B8G3", "B00005V9NJ", "B0009Z3MOW", "B00005ATSN", "B000CNESH6", "B000B69E8W", "B000QTD05W", "B00022EE44", "B0007ZSHOY", "B002CJ8Z04", "B003FBL86Q", "B0001ZZNNI", "B00008KTLZ", "B000HE7KZC", "B00002ST27", "B00712Y28Q", "B00005B8G1", "B0001615OI", "B00004LC81", "B00019HNNC", "B000QJ1NS8", "B00068O278", "B000066TS2", "B000A28ENI", "B00019AZC8", "B0002Y67PG", "B001E27DLM"], "buy_after_viewing": ["B00006M3R6", "B00006LELB", "B000VBB69M", "B00009WAUO"]}, "salesRank": {"Video Games": 6262}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "More Systems", "Game Boy Advance", "Games"]]}