{"asin": "B00005ARK3", "categories": [["Electronics", "Computers & Accessories", "Routers"]], "description": "The EtherFast wireless access point and cable/DSL router features a router, a four-port 10/100 switch, NAT firewall, and an IEEE 802.11b wireless access point (11 Mbps). This all-in-one device allows wireless PCs and wired Ethernet PCs to access a single broadband Internet connection for sharing IP addresses, files, printers, and other network resources while conserving desktop space. The built-in four-port switch enables wireless and wired notebook and desktop PCs to share high-speed Internet access.Configurable as a DHCP server for your existing network, this router acts as the only externally recognized Internet gateway on your LAN and serves as an Internet NAT firewall against unwanted outside intruders. It can also be configured to filter internal users' access to the Internet. The 4-port switch dramatically increases the speed of multimedia and gaming connections.This device comes with a one-year warranty and free 24/7 technical support.Note: All Linksys routers now include a special edition of Norton Internet Security! Claim your free CD-ROM by calling (800) 814-0180, 7 a.m. to 7 p.m. Pacific time, seven days a week.See acomparison         diagramof the different wireless technologies.Wireless networks are rapidly         becoming more popular and coming down in price. Since they don't require         cables, you can use the devices anywhere in an office or home, even out         on the patio. There's no need to roll out an Ethernet network cable to         each room of a house; you can network anywhere--without wires. Outside         the home, wireless networking is available in hotspots at coffee shops,         businesses, and airports--great when you're on the road and need to get         some work done. For convenience, wireless networking is the answer.Which Wireless Standard Is Right for Me?Now that you've decided to create a wireless network, the next step is         to figure out which wireless standard to use.Basically, a standard is a set of specifications for a device. All devices         that follow a specific standard share operating characteristics, such         as the radio frequency used and maximum data transfer speed.For wireless networking, there are three standards to choose from at this         time:802.11b802.11a802.11gTo learn about the differences between the standards and select the right         one for your network,click         herefor an easy-to-understand chart.", "title": "Cisco-Linksys BEFW11S4 Wireless-B Cable/DSL Router", "price": 47.99, "salesRank": {"Electronics": 31404}, "imUrl": "http://ecx.images-amazon.com/images/I/41WN42NEYKL._SX300_.jpg", "related": {"also_viewed": ["B000BTL0OA", "B004NBZ98K", "B00004SB92", "B005HFJFHW", "B0083P4SIE", "B003NZSX7G", "B0036R8FCO", "B001UHMB5O", "B0000TW3RE", "B004CYF0VE", "B005276QSQ", "B0001D3K8A", "B0001MQSB2", "B005YR19UE", "B003CFATMY", "B005EW2GR4", "B00C4OANW0", "B00005T6GZ", "B001UI4RTG", "B00007KDVI", "B00004TRD9", "B007STA9A2", "B0046TRVR6", "B000FDOWQK", "B000WG3ZU4", "B00IF0JAIU", "B009SPNO1K", "B000051SGX", "B004HXK0H4", "B00006HYKM", "B003CFATSS", "B0000D8HK1", "B0034JSYZ2", "B004T9RR6I", "B0028N6VNW", "B0025VZFIO", "B001GF4SME", "B0037DAX9U", "B008PKANT0", "B0088EKH08", "B00DLUVH62", "B00008ZPJU", "B00GG533L6", "B0014IYZDK", "B004N6259G", "B00008SCFL", "B00HC0ZDOE", "B0086UK72C", "B000JV9LUK", "B00005Y7DQ", "B002M3SHXA", "B00BR3XGP0", "B0040IUI46", "B00006B9H9", "B00005854B", "B000WIK61I", "B000O0XW7E"], "buy_after_viewing": ["B000BTL0OA", "B004NBZ98K", "B001FWYGJS", "B00AJHDZSI"]}}