{"asin": "B000Z9A95M", "description": "Okamitells the story of a mythical sun god who sets out to restore a dismal world, decimating the forces of evil who stand in the way by commanding the elements and mythical abilities the deity possesses. Mixing Japanese folklore and a stunning traditional Japanese art style, players must utilize an inventive control scheme to overcome the challenges and evil that await. By enhancing the unique gameplay, visual style and story line ofOkamiwith the control of theWii Remote, it is sure to be the ultimate version of the game.Originally designed for the PlayStation 2 computer entertainment system and released in 2006,Okaminow comes alive in an entirely new way on the Wii with its visually stunning art style and beautiful scenic 3D levels that have the appearance and texture of paper scrolls brushed with watercolor-like calligraphy art. Throughout the vibrant and distinctive surroundings, players must use the Wii remote to interact with a dynamic world and cast of characters. The blend of stylized graphics, movements and unique gameplay will result in a rich and dynamic experience never seen before.Features:Innovative gameplay and control scheme optimized for the Wii - Defeating monsters requires both motion-controlled physical attacks, but also use of the Wii Remote as Amaterasu's 'Celestial Brush' to paint the desired powers for decimating enemies and solving puzzles.Utilize various gameplay styles - In addition to the Celestial Brush, Amaterasu can wield three types of offensive weaponry, each with their own unique abilities and effects. Depending on how a weapon is equipped, it can be used as the main or sub weapon:Reflectors - These well-balanced weapons are suited for close range combat.Rosaries- Sacred magatama beads are great for quick long range attacks.Glaives - These can be charged up to unleash powerful close range attacks.Intriguing main character - Assume the role of the sun god, Amaterasu, who descends upon the earth in the form of a wolf. The Japanese translation of the word wolf is \"Okami\".Original visuals and revolutionary design- Vibrant and inspiring graphics, reminiscent of traditional Japanese art created on paper scrolls, produce a large variety of stages with a watercolor-esque appearance.", "price": 44.94, "imUrl": "http://ecx.images-amazon.com/images/I/51mdwSLef7L._SY300_.jpg", "related": {"also_bought": ["B003IOGPAO", "B001HB7K6I", "B002EE7OKE", "B007CSF3GO", "B0019SY1D4", "B001TOMR0C", "B000X25GW2", "B000P46NKC", "B003ZCH7DI", "B002E6XY6U", "B002BRZ9AG", "B002BSC4ZS", "B004WLRQMI", "B007RNWUC4", "B000P297ES", "B002BRYXOO", "B000FQBPDU", "B002BSC54I", "B002BSA388", "B005EHQJ2C", "B000FQBPCQ", "B001COVME6", "B00B2QL2Y4", "B002I08CSW", "B006QRNKOO", "B002CZ3SLO", "B000FQ9R4E", "B000FQ9QVI", "B002I0IIPY", "B000IONGU4", "B002EE5SAC", "B000NNDN1M", "B002I0GEXM", "1897376022", "B0094X1ZXU", "B003ZHMMEM", "B002FG9MWE", "B002BHSPXO", "B00897Z27C", "B00136MBHA", "B009EWHKAI", "B000GPW2QO", "B0058VI0G2", "B003JD7QYI", "B005FYJA52", "B001TOMR6Q", "B00009KO3S", "B006L1FAK2", "B00BORFD9Q", "B0050SVH18", "B002ATY7JE", "B0094X28J0", "B00KWEHBAG", "B0020H46D8", "B001ET07O0", "B003S2SQCQ", "B003VR5PPY", "B000U34SYQ", "B0016OVBG6", "B00149IL9I", "B002I0GF72", "B008AU4YEA", "B002TLTBN0", "B003K18LT8", "B00269DXXO", "B000G7PMX2", "B00CAY50CW", "B000FQ9YB0", "B001P1ZE68", "B0002ILS1U", "B0009Z3K9E", "B00005Q8M4", "B002BVQNPW", "B0050SVFB0", "B0030GBU8W", "B001E27DLM", "B001HB7KAO", "B005EIIBKY", "B0015HZLVK", "B000TP2UZO", "B001TKK3NE", "B001YI0Z2U", "B001PBDBNQ", "B00GV4V8XC", "B00BMFIXEW", "B0017WHQ34", "B003FBL86Q", "B001C58T46", "B00DC7G0GG", "B000WQ1UME", "B00269DXR0", "B000Q6J51S", "B00DC7G2W8", "B001TOMQVC", "B00CHYOP94", "B001TERJD2", "B0050SWBAE", "B00009PS24", "B001TOQ8K2", "B00B59L9YG"], "bought_together": ["B003IOGPAO"], "buy_after_viewing": ["B00DC7G2W8", "B007CSF3GO", "B003IOGPAO", "B002I08CSW"]}, "salesRank": {"Video Games": 3077}, "categories": [["Video Games", "Wii", "Games"]]}