{"asin": "B00004TSXC", "description": "Neverwinter Nightsisn't simply another computer game. It's aDungeons & Dragonscomputer game, as well as all the tools you'll need to create your own Dungeons & Dragons adventures.Neverwinter Nightsis an achievement. It accomplishes what computer role-playing games set out to do when Wizardry debuted in the late '70s: re-create the social, hands-on experience of tabletop gaming.Neverwinter Nightsuses the Dungeons & Dragons 3rd Edition rules in (nearly) all their complex glory. It's the first game to attempt to fully support D&D; 3E's customizable features, and more significantly, it's the first game designed to re-create the experience of playing tabletop D&D.; You can play BioWare's extensive campaign alone or online with your friends, or you can use the included Aurora toolset to build your own adventure module and run it for your buddies with all the control you'd have if you were running a tabletop game. The powerful Dungeon Master client lets you put words in nonplayer characters' mouths, control monsters, alter the game world, and customize your adventure on the fly. If playing is your thing, you can join other people's games and play through encounters with other gamers around the world.Everything works as it should and the game is beautiful to behold. BioWare has used a limited 3-D engine to allow you to spin your viewpoint around your character and zoom in on the action. During combat, Mages unleash spectacular spells, Priests raise their symbols to drive undead hordes back, and Rogues tinker with locked chests, while Fighters dodge, parry, and strike ferociously at any attacking beasts. The sound is topnotch, with BioWare's typically high-quality voice acting and music from composer Jeremy Soule.But all isn't perfect.The game makes a great effort of implementing the full D&D; 3rd Edition rules, but doesn't quite succeed. InNWN, Paladins lose their Detect Evil and Mount abilities. Druids can shape change into animals, but can't change back to human form at will. Darkvision has no noticeable in-game effect. Troublesome issues for hard-core D&D; fans, but it's understandable that some changes would have to be made in order to shoehorn a freeform tabletop RPG into a computer program.Other issues are not so easy to understand: the camera controls are simple and will not allow the user to lower to decrease the camera angle--you'll never get anything approaching a character's-eye view of the world. Moving to a new section within a building or going from an indoor to an outdoor area takes you out of the game and presents you with a (mercifully short) \"Loading\" screen. There is an artificial limitation on how many henchmen you can hire in the single-player game: you're limited to one hireling, andBaldur's Gatefans will miss the squabbling party from earlier games. More significant are the problems that arise from trying to re-create a social experience like D&D; in a computer game. Multiplayer games with strangers are confusing and not as fun as they sound and, like the tabletop game, they're really only as fun as the players and especially the DM you're playing with. MultiplayerNWNis only worthwhile if you have a dedicated group and a DM that knows what he or she is doing. The last drawback is the documentation. The manual is large and detailed but it omits key help in module creation; you have to buy a separatestrategy guideif you want that information.But though slightly flawed,NWNhas indisputably won the holy grail of RPG gaming: getting the Dungeons & Dragons experience into a personal computer. The included campaign is fascinating and the tools are powerful enough to ensure a steady stream of module content from devoted fans. Make no mistake,Neverwinter Nightsis an achievement and will likely change the way CRPGs are played from now on. It's a game no RPG fan, no D&D; fan, should miss.--Bob AndrewsPros:Almost perfect implementation of D&D; 3E rulesDeep single-player gameIntriguing multiplayer gamePowerful module creation toolsCons:Not quite perfect implementation of D&D; 3E rules\"Loading\" screensInflexible 3-D cameraOnly one henchmanMultiplayer is dependant on quality players and DM", "price": 29.95, "imUrl": "http://ecx.images-amazon.com/images/I/51Qcz9HHoDL._SY300_.jpg", "related": {"also_bought": ["B00009MGVH", "B000E0XX9Q", "B000FGA1US", "B00007M57T", "B000FGBVAC", "B000B8P8RG", "B000R2WIE2", "B00009ECGG", "B00001QEQA", "B000E0TOKI", "B00002EPZ2", "B000WCCURW", "B000B8K7RC", "B00009MGVE", "B002I0JLEQ", "B0002BQN7Q", "B001B5U80K", "B005OGYVKU", "B0045ZB66I", "B000065DGH", "B001AH8YSW", "B001E3ARJ6", "B001V9PTVE", "B00004KHB7", "B004G603E2", "B00004Y7SZ", "B002TOKQH2", "B0000CNUUP", "B00115YMWA", "B005UI8V6C", "B00004KHB3", "B0006FZUHC", "B00001IVBL", "B00006IR62", "B00118SU98", "B00002CF9M", "B001VJ4DHK", "B0012REQZK", "B00001QEQ9", "B000RZLRW8", "B002BXKJA0", "1931886032", "B000067DPM", "B000FAMQ3Y"], "bought_together": ["B00009MGVH", "B000E0XX9Q"], "buy_after_viewing": ["B000FGA1US", "B000B8K7RC", "B000FGBVAC", "B000E0XX9Q"]}, "salesRank": {"Video Games": 12817}, "categories": [["Video Games", "PC", "Games"]]}