{"asin": "B000V1VG2O", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The PowerShot SD950IS Digital ELPH, with its curved sleek titanium body, is as powerful as it is exquisite: There's a high resolution 12.1-megapixel CCD, an Optical Image Stabilizer, and 3.7x optical zoom. Face Detection Technology is also on board to automatically give you just the shot you're looking for. Auto ISO Shift and ISO 1600 let you command low light like a pro. There's even a high-resolution 2.5-inch LCD that makes shooting and playback a delight.High Resolution, Extra DurabiltyPure titanium 12.1-megapixel Digital ELPH redefines elegance and power in an ultra-compact \"perpetual curve\" design.Ultra-durable, ultra-light pure titanium--it's what gives the PowerShot SD950IS Digital ELPH its look of distinction and sets it apart from the crowd. But tasteful good looks are only the beginning of what makes this Digital ELPH so extraordinary. Its powerfully curved design perfectly nestles in the palm of your hand, so you'll want to take this camera everywhere. Plus, the 12.1-megapixel CCD gives you the superior resolution you need to capture the world around you in opulent detail enabling you to print, enlarge, and even crop your images in any fashion you choose.Catch Them in MotionOptical Image Stabilizer Technology with an extended-range 3.7x optical zoom.Life doesn't give you second chances to capture special times. That's why the elegant PowerShot SD950IS Digital ELPH is equipped with Canon's acclaimed Optical Image Stabilizer Technology that automatically detects and corrects camera shake, one of the leading causes of fuzzy or blurred shots. Even when zoomed in, you can get the steady, crisp, brilliant images you'll be proud to shoot and share. And 3.7x optical zoom and Optical Image Stabilizer Technology are so convenient with which to shoot subjects in distance. Just turn it on, it functions perfectly with or without a flash.Canon Technology Maximizes Quality and PerformanceGenuine Canon Face Detection sets the focus, exposure, and flash automatically, leaving you free to compose a group, capture an unguarded moment, or coax the perfect smile.DIGIC III features Face Detection technology, giving you the best possible results in any shooting situation. Face Detection AF/AE sets the focus point and exposure for the faces of your subjects. Face Detection FE adjusts the flash to correctly illuminate your subject to provide the best balance between your subject and the overall scene, eliminating the common problems of over- and underexposed faces.18 Shooting Modes, Including 11 Special Scene ModesShooting ModesAdvanced presets for the best possible photos under certain conditions.AutoThe camera chooses all the settings so you can concentrate on your subject.Camera MThe ultimate in creative control, you set ISO speed, exposure compensation and white balance.Color AccentChoose to retain a single color in your image while other colors turn monochrome.Color SwapSelect a color and replace it with a color you specify for special effects.Digital MacroShoot larger-than-life close-ups with one-button simplicity.Stitch AssistBuild awe-inspiring panoramas by neatly aligning sequential images.MovieShoot in High Resolution (1024 x 768 at 15 frames per second [fps]), VGA (640 x 480 at 30 fps/30 fps LP), and QVGA (320 x 240 at 30 fps) for up to 1 hour or 4GB, QQVGA (160 x 120 at 15 fps) for up to 3 minutes or Time Lapse (640 x 480 at 1 second/2 second intervals) for up to 2 hours.Special Scene ModesPortraitThe camera sets a large aperture, focusing the subject and artistically blurring the background to make your subject \"pop.\"FoliageCapture brilliant shots of autumn foliage, greenery and blossoms.SnowShoot clear snow scenes without darkened subjects or an unnatural bluish tint.BeachGet clear shots of people at a sunny beach without darkened faces.FireworksGrab brilliant images of skyrocketing fireworks.AquariumAchieve proper flash-free exposure and natural hues at indoor aquariums.UnderwaterCapture underwater images with reduced backscatter effect. (Note: Optional Waterproof Case WP-DC19 required for shooting any underwater images. Waterproof case not included--must be purchased separately.)ISO 3200Expands the user's ability to shoot in dark settings without using the flash.IndoorReduce blur and improve color accuracy when shooting handheld indoors.Kids and PetsReduced focusing time freezes fast-moving subjects, so you won't miss those special shots.Night SnapshotGet natural-looking pictures with brighter backgrounds and subjects lit by flash.See the Image in a Big ScreenOptical viewfinder plus large high-quality 2.5-inch PureColor LCD screen for bright, accurate color with great viewing from a wide angle and with an anti-glare, anti-scratch coating.The camera's 2.5-inch LCD screen gives you the big picture, whether you're shooting, reviewing, or showing off your images. This extra-durable, high-resolution screen with tough scratch-resistant coating on the anti-reflective, PureColor LCD screen offers a crisp, clear picture to make shooting, playback, and using the camera's menu functions especially convenient. Clear and bright, it also features Night Display for easy viewing in low light.Canon Innovation Enhances Your ExperienceDIGIC III Image Processor with red-eye correction for sharper images and improved functionality.With DIGIC III, your images boast superior quality, the camera operates at top efficiency and battery life is enhanced. What's more, DIGIC III enables Canon's Face Detection Technology and red-eye correction to give you better, more true-to-life people shots. Simply press the Shutter Button halfway down, and the camera automatically pinpoints the faces in the scene and chooses the ideal focus point. The camera controls exposure settings and flash to keep every face looking bright and natural. Red eyes can be corrected during playback.iSAPS Technology is an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the fast DIGIC III Image Processor to improve focus speed and accuracy, as well as exposure and white balance.Red-eye Correction detects and corrects red-eye during playback. In unusual cases where red-eye is not automatically detected, it can easily be corrected manually during playback mode.The PowerShot SD950IS Digital ELPH features ISO 1600 and High ISO Auto settings that reduce the effects of camera shake and sharpen subjects in low-light situations, giving you greater shooting flexibility.The Complete Print SolutionPrint/Share Button for easy direct printing and downloading, plus ID Photo Print and Movie Print with select PIXMA Photo Printers, CP, and SELPHY Compact Photo Printers.The PowerShot SD950IS Digital ELPH's Print/Share button makes direct printing easier than ever. Simply connect the SD950IS Digital ELPH to a Canon CP, SELPHY, or PIXMA Photo Printer or any PictBridge compatible photo printer, press the lighted Print/Share button, and print! Also use the Print/Share button to transfer images to a computer (Windows and Macintosh).Print your own ID photos in 28 different sizes or use the Movie Print function to output multiple stills from a recorded movie on a single sheet with a Canon SELPHY Compact Photo Printer.What's in the box:Canon PowerShot SD950 Digital ELPH camera, lithium battery pack NB-5L, battery charger CB-2LX, MMC Plus card MMC-32MH, wrist strap WS-700, Digital Camera Solution CD-ROM, USB Interface Cable IFC-400PCU, AV Cable AVC-DC300", "title": "Canon PowerShot SD950IS 12.1MP Digital Camera with 3.7x Optical Image Stabilized Zoom (Titanium)", "price": 349.99, "salesRank": {"Camera &amp; Photo": 8654}, "imUrl": "http://ecx.images-amazon.com/images/I/41O582sxg6L._SX300_.jpg", "related": {"also_viewed": ["B001SER46A", "B000Q30420", "B001SER48S", "B001SER46K", "B000EVLS4C", "B005MTME3U", "B0075SUK14", "B001G5ZTN6", "B002LITT5Q", "B004J3YCGM", "B00KDLK3FS", "B004J41T7Q", "B001G5ZTX6", "B0011ZK6PC", "B00JAQM43G", "B001G5ZTO0", "B00HLDFPA4", "B001SER492", "B00EFILNV8", "B000EN0K94", "B001SER47O", "B000NK8EWI", "B00BOZ1XA6", "B001G5ZTWM", "B00358TPEQ", "B0007TJ5OG", "B004H8FNJY", "B004HW73SO", "B005MTMEKI", "B001SER47Y", "B0012YC7AE", "B00I58M26Y", "B0035FZJJ4", "B009B0MYSQ", "B005IGVXJS", "B006UMM1PO", "B000NK8L6W", "B0035FZJKI", "B00I9OPF2W", "B0075SUII4", "B00AWYN0BU", "B00AWYN0ME", "B001H8DF0G", "B006K553QA", "B000EMWBT2", "B0015DNIKU", "B00EFILPHA", "B0054YVA5Q", "B0054YV934", "B009B0MY6S", "B0075SUIEI", "B0035FZJM6", "B0013TUG5G"], "buy_after_viewing": ["B00358TPEQ", "B003VNKNEQ", "B001SER46A", "B000Q30420"]}}