{"asin": "B000FBSREK", "description": "The WD Caviar SE16 7200 RPM next-generation SATA hard drive features 500 GB of storage and a 16 MB cache for lightning-fast performance. Yes, these reliable drives are fast, but they still deliver technologically advanced acoustics and cool operation. Designed for high-performance computers, multimedia and gaming systems.Key Features16 MB cache- Bigger cache means faster performance. A massive 16 MB cache combined with up to 300 MB/s transfer rate make these ultra-fast drives the perfect solution for the fully loaded PC with a fast processor.Cool operating temperature- WD hard drives are designed to have the lowest power consumption of any high-capacity, desktop-class hard drive which lowers the operating temperature for enhanced drive reliability.Whisper quiet- These highly reliable drives deliver technologically advanced acoustics. With its WhisperDrive and SoftSeek technologies, WD has minimized noise to levels virtually imperceptible to the human ear in home and business environments.How this WD hard drive protects your dataData Lifeguard is an exclusive set of data protection features, including shock protection, an environmental protection system and real-time embedded error detection and repair. WD's Data Lifeguard technology automatically finds, isolates, and repairs problems that may develop over the life of a hard drive.Data Lifeguard Tools are software utilities designed for WD hard drives that work with the embedded Data Lifeguard features to make hard drive installation, diagnostics and repair both simple and worry-free. (Download Data Lifeguard Tools)ShockGuard instantaneously protects the hard drive against damage from bumps and vibrations while it is running. This technology enables WD Caviar drives to achieve industry-leading shock specifications.", "title": "Western Digital WD5000KSRTL/WD5000AAKS Caviar 500 GB SATA Hard Drive", "price": 68.99, "imUrl": "http://ecx.images-amazon.com/images/I/51prszLO7WL._SY300_.jpg", "related": {"also_viewed": ["B00461G3MS", "B000O78HRC", "B000Q82PIQ", "B0088PUEPK", "B00D8X0JUC", "B0046TT9A8", "B00FJRS6FU"], "buy_after_viewing": ["B00461G3MS", "B008968L6M", "B000O78HRC", "B000Q82PIQ"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "Internal Hard Drives"]]}