{"asin": "B001TODUXA", "description": "This spindle of 50 AmazonBasics 8X DVD+R Double Layer disks provides a natural storage solution for video files and other high-capacity data. Each disk offers a capacity of 8.5 GB--enough space to store four hours of DVD quality video. These DVD+R Double Layer disks support fast write speeds from 2.4X to 8X and provide a recording time of up to 240 minutes.Basic Advice for Writing or \"Burning\" CDs and DVDs (Including Dual Layer and Double Layer Discs)1.&nbsp;&nbsp;&nbsp; Check your drive/burner's documentation to confirm speed capabilities and the type of media that is suitable. If you are burning Dual Layer/Double Layer discs your drive/burner must be capable of using this media.2.&nbsp;&nbsp;&nbsp; Make sure your drive/burner's Firmware and your drive/burner's software has been updated to the latest Version Number in order to reliably use the latest and fastest media possible with your drive/burner (check your drive/burner documentation on upgrading your firmware and software).3.&nbsp;&nbsp;&nbsp; Set your burning software rate to an \"Automatic\" setting for burning speed, if possible. If such a setting does not exist, then set the burn speed to half or less of the drive/burner's rated maximum speed, or half of the blank disc's rated speed, whichever is lower.4.&nbsp;&nbsp;&nbsp; The disc's rated speed (as printed on the disc and package) is a maximum speed. When the burn process is set to \"Automatic\" the disc speed will actually fluctuate up and down as needed based on the type of information being burned and only occasionally reach the maximum burning speed. This is why if an \"Automatic\" burn rate setting is not available we recommend setting the disc to burn at half of the rated maximum (as stated in item #3 above).Please refer to thecompatibility chartfor details on what kind of drives will work with this product.The AmazonBasics 8X DVD+R DL disks offer a capacity of 8.5 GB, write speeds from 2.4X to 8X, and a recording time of up to 240 minutes.Recommended Uses:Storing up to four hours of DVD quality video for play on DVD players.Backing up and archiving up to 8.5 GB of data and media.Technical Specifications:Capacity: 8.5 GBFormat: DVD+R Double LayerRecording Speed: 8xRecording Time: 240 minutesWarranty: AmazonBasics 1-Year LimitedWarranty[PDF]Documentation:Helpful Hints[PDF]Compatible Drives:Compatibility List[PDF]DVD+R DoubleLayer Disks: Double the StorageDVD+R Double Layer is a rewriteable disc format with a storage lifetime that's intended for storing videos and archiving important business or personal data. DVD+R Double Layer disks offer a storage capacity of 8.5 GB. Because the disks can hold nearly twice as much data, they are a low-cost, space-saving storage choice that can be used for a wide range of applications.Each AmazonBasics DVD+R Double Layer disk can record up to four hours of DVD quality video programming, so you don't have to split up long programs onto several disks. A single DVD+R Double Layer can also hold six hours of VHS-quality video or more than 120 hours of MP3 audio.DVD+R CompatibilityThere are two types of recordable DVD disks available. Almost all recent DVD players and drives can handle both burned DVD-R and DVD+R disks, but some older players can only read one format or the other. It is important to check your player's manual to determine which DVD type it supports.8X Write Speed and Organic Dye: Built for Fast, Accurate WritingAmazonBasics DVD+R Double Layer disks enable fast write speeds from 2.4X to 8X (8X is maximum. Burning speed will fluctuate.) for quick, clean data transfer. (To take full advantage of these speeds, your DVD burner must burn at speeds of at least 8X. Consult your computer or DVD burner product manual for this information.)At 8X, transfer speed translates up to 11.08 MB/s, which means that you can burn a full disk in less than 14 minutes. The organic dye used on the write side of these DVD+Rs ensures stable writing at high speeds for reliable, accurate finished disks.Warranty and Helpful HintsThese disks are backed by an AmazonBasics 1-year limited warranty. To view the full AmazonBasics warranty,click here. If you are having trouble with these disks,click herefor the AmazonBasics CD/DVD Helpful Hints Guide [PDF].What's in the BoxSpindle of 50 8.5 GB 8X DVD+R Double Layer disks and warranty card.", "title": "AmazonBasics 8.5 GB 8x DVD+R DL (50-Pack Spindle) (Discontinued by Manufacturer)", "price": 29.95, "imUrl": "http://ecx.images-amazon.com/images/I/41-MFIHSe4L._SY300_.jpg", "related": {"also_viewed": ["B000GHWRIK", "B001TOD7MO", "B0026CN0KW"], "buy_after_viewing": ["B002S4027C", "B0013DO3BU", "B008YQAFH0", "B000UWX70S"]}, "categories": [["Electronics", "Accessories & Supplies", "Blank Media", "DVD+R Discs"]]}