{"asin": "B000HATNI8", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The PowerShot G7 features an incredible 10-megapixel CCD. It produces excellent image details even when printed large and also enables several new benefits such as Digital Teleconverter and Safety Zoom.6x Optical Zoom Lens with ISFeatures a 35-210mm equivalent zoom lens with image stabilization. Designed specifically for the 10-megapixel CCD, this lens features a new internal focusing system and an advanced dual-sided aspherical lens element for the best possible results.DIGIC III Image ProcessorTakes the performance and speed of DIGIC II to even higher levels of processing power including new face detection function, up to 1600 speed ISO, high-ISO noise reduction, lower power consumption, increased speed for SD media cards, and higher resolution image processing for enhanced LCD viewing.Face-Priority AF/AEIntelligent Face-Priority AF mode reliably detects faces and focuses on them. Detects three faces when shooting in standby and up to nine when shutter button is pressed halfway. When faces are detected the exposure is also biased for proper facial illumination while maintaining overall scene brightness.Large 2.5-Inch Color LCD MonitorEnjoy composing and reviewing images with wide view 2.5-inch LCD monitor. With this size LCD screen, it is quite easy to navigate through the menu and utilize the direct printing features.Hot ShoeVersatile design allows for use of any current Canon Speedlite including macro flashes and wireless TLL. (Off-camera flashes and accessories not included--must be purchased separately.)Digital Teleconverter and Safety Zoom\"Virtual teleconverter\" simulates the effect of a 1.4x or 2.3x physical teleconversion lens. With Safety Zoom, digital zooming is initially limited to preserve maximum pixel resolution.3:2 Guide and Widescreen ModeHelpful 3:2 guide masks the LCD screen to reveal the printable area of a standard 4 x 6-inch print. Also, capture still images in a 16:9 aspect ratio to view on widescreen computer monitors and televisions.My CategoryImproves playback experience by allowing user to put images into seven categories: People, Scenery, Events, Category 1-3, or To Do. With My Category deleting and protecting images has never been easier.Waterproof CaseExpand creative photo opportunities with the waterproof case WP-DC11. Take up to 130 feet underwater and still utilize all of the controls the camera has to offer. (This case is not included. It must be purchased separately.)", "title": "Canon PowerShot G7 10MP Digital Camera with 6x Image-Stabilized Optical Zoom", "price": 499.0, "salesRank": {"Camera &amp; Photo": 2761}, "imUrl": "http://ecx.images-amazon.com/images/I/51WGMAJ023L._SX300_.jpg", "related": {"also_viewed": ["B00EFILHB4", "B000V1VG5G", "B001G5ZTPY", "B002LITT56", "B001SER47Y", "B00009W5FF", "B0041RSPRS", "B000HAOVC6", "B009B0MY6S", "B00005Q5U5", "B002LITT42", "B00427ZLRO", "B005IQGUHS", "B006UMM2BW", "B000Q3043Y", "B000HARTYI", "B001CCLBSA", "B004G8QSTO", "B001G5ZTZO", "B001SER44W", "B006T747AM", "B00I58M1VK", "B001U3ZUWO", "B00427ZLS8", "B002LITT3I", "B002LITT3S", "B0009GZSSO", "B00908BMVE", "B000JIOG5I", "B0075SUK14", "B006K5521Q", "B003ZSHNG8", "B0090SLE30", "B004HW73S4", "B000V20R28", "B00EFILR6E", "B0002XQI2E", "B000V1VG4W", "B00BIO3AU4", "B009AYJQ2U", "B005IGVXJS", "B0075SUG8Q", "B0072DKWQ0", "B000M4KXK6", "B005I6DVC0", "B0073HSH08", "B00908BQCY", "B004M8SVFM", "B004HW73QG", "B00IVEHTV0", "B000ENN9BK", "B0075T7NW2", "B001QFZMCO", "B00AA00C08", "B004M8SVGG"], "buy_after_viewing": ["B000BO3CW8", "B002A1MLV8", "B00EFILHB4", "B007M51J3I"]}}