{"asin": "B000B6D39I", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Mice"]], "description": "Amazon.com Product Description How do you improve on the mouse that has everything? Remove its tail. Mighty Mouse--the mouse that changed the way you scroll--has gone wireless via fast and secure Bluetooth technology. Now you can take that seamless, touch-sensitive, 360-degree scrolling design with you wherever you go.Like its namesake, Mighty Mouse puts powerful precision in a pint-sized package. With all its clicking capability tucked neatly under the seamless top shell, Mighty Mouse boasts drop-dead good looks and wireless portability, too. And then there&rsquo;s that ingenious Scroll Ball--the tiniest such mechanism ever used in an input device. No wonder it&rsquo;s a wonder.Scroll, zoom, and more easily.The Mighty Mouse is sleek.View larger.Enjoy precision laser tracking.Have a BallTry reading this web page without scrolling. Every day you navigate through files, email and web pages by scrolling horizontally and vertically. Now you can do it all with your fingertip. Mighty Mouse&rsquo;s Scroll Ball features miniature sensors that allow you to manipulate what appears on your screen merely by moving your finger. Scroll up and down to read a long web page or document. Scroll back and forth to follow a timeline in iMovie or keep track of a large spreadsheet in Excel. But getting from point A to point B doesn&rsquo;t always mean traveling in a straight line. Take a spin on the mouse that&rsquo;s not afraid of kitty-corner. With Mighty Mouse&rsquo;s Scroll Ball, you can scroll at a 45-degree angle &mdash; even roll in 360-degree sweeps. Pan across a massive digital image in iPhoto or Adobe Photoshop. Take in a whole PDF in Preview. The Scroll Ball moves the content on your screen just as your eyes might move across a printed page. The Scroll Ball acts as an extra mouse button too, offering you one of a few clever clicking options.All-Terrain MouseThe wireless Mighty Mouse finds its way courtesy of a laser tracking system that boasts 20 times more sensitivity to surface detail than traditional optical tracking engines. So you can glide the wireless Mighty Mouse over more surfaces--metal, wood, plastic, even your denim (or tweed) clad leg.It Squeezes, Not SqueaksIt wouldn&rsquo;t be fair to call Mighty Mouse a two-button mouse with one button. Especially when it responds to pressure from your fingers in four different places. Besides the left- and right-click functions, the Scroll Ball clicks down to act as a third mouse button. And force-sensing buttons on either side of Mighty Mouse respond when you press in with your finger and thumb. Perfect for Mac OS X users, the side buttons are pre-programmed to activate Expos&eacute;, so you can view all your windows with a squeeze. Of course, you can also customize Mighty Mouse to open whatever you choose--Spotlight, Dashboard or any application when you have Mac OS X v10.4.6 or later.The Button That Wasn&rsquo;tAlas the fate of the one-button mouse in today&rsquo;s multibutton world. Who has time for intuitive, elegant design when there is so much clicking to do? Thanks to a smooth top shell with touch-sensitive technology beneath, Mighty Mouse allows you to right click without a right button. Capacitive sensors under Mighty Mouse&rsquo;s seamless top shell detect where your fingers are and predict your clicking intentions, so you don&rsquo;t need two buttons &mdash; just two fingers. Click on the left side to use Mighty Mouse in its simplest, single-button form. Click on the right to access contextual menus within applications and edit, copy, label or download from your mouse. It&rsquo;s simple sleight of hand.The Mighty Mouse offers plenty of functionality.The mouse works with 1 or 2 AA batteries.More Mouse, Less MessPerfectly portable, the wireless Mighty Mouse goes anywhere you do and banishes clutter in its wake. A secure Bluetooth connection keeps you in control from up to 30 feet, and you can forget lugging around a bulky charging dock: the wireless Mighty Mouse works with one or two AA batteries. Two last longer, but one works just as well and packs ultralight.A Mac and Mouse GameBecause Apple engineers designed Mighty Mouse to work in perfect harmony with the operating system, you get the full Mac OS X experience from the comfort of your mouse. Take that Scroll Ball button, for instance. Pre-programmed to launch Dashboard, it gives you access to a world of information in a single click. Mighty Mouse&rsquo;s side buttons show you all your open windows in Expos&eacute; with a squeeze. Of course, you can program both of these buttons--along with Mighty Mouse&rsquo;s right- and left-click functions--to launch Dashboard, Expos&eacute;, Spotlight, Application Switcher or any application you choose. Mac OS X gives you the capability, thanks to an intuitive System Preference pane.Switch Users, Not MiceOnce you set your Mighty Mouse preferences, your Mac will remember them, even if you share your computer with others. Each account on your Mac has its own preferences, so everyone can use Mighty Mouse differently. Program Mighty Mouse as a simple, single-button mouse for a youngster. Set buttons to launch user-specific apps. Limit application access for children by pre-programming Mighty Mouse and locking System Preferences using parental controls. No matter how they work or play, Mighty Mouse makes everybody happy--all from one Mac.X-MouseMighty Mouse helps you make the most of Mac OS X. Pre-configured to launch Dashboard from the Scroll Ball button and Expos&eacute; from the side squeeze buttons, Mighty Mouse gives you lots of other options:Program the Scroll Ball button to launch Application Switcher, then move from one task to another with a scroll.Set any button to start a new Spotlight search and find what you&rsquo;re looking for, fast.Change the side buttons from displaying all windows in Expos&eacute; to displaying only the windows in the current application.Launch any application you choose from any button on Mighty Mouse: Just select \"other\" from the button drop-down menu and browse for applications in the Finder.Designate either top-shell button as your primary--the perfect solution for southpaws.Activate screen zoom with the keyboard and Scroll Ball.What's in the Box:Apple Bluetooth Wireless Mighty Mouse, 2 AA batteries, software CD, instructions.", "title": "Apple Bluetooth Wireless Mighty Mouse", "price": 79.0, "imUrl": "http://ecx.images-amazon.com/images/I/31FAS2XG9AL._SX300_.jpg", "brand": "Apple", "related": {"also_bought": ["B0007Y79E4", "B005DLDO4U", "B005DLDTAE", "B002TMRZOQ", "B0000ACOBI", "B002TLTH7K", "B000V01RLK", "B000V6SSRK", "B002TLTGM6", "B003XIJ3MW", "B00IKMJA3S", "B000ZLRHKA", "B0000DBJ8A", "B008ALA6DW", "B00ESJS72C", "B008ALAHA4", "B009RHS43W", "B004RCY198", "B00DE8EEAM", "B008AL9VXI", "B008RXYOKY", "B001E4XEW2", "B007X3VEX4", "B008ALADKI"], "bought_together": ["B005DLDO4U", "B002TLTGM6"], "buy_after_viewing": ["B002TLTGM6", "B005DLDO4U", "B000V6SSRK", "B007X3VEX4"]}}