{"asin": "B000V6MSRG", "description": "Unleash the picture power of your digital SLR with this remarkable new compact, lightweight all-in-one zoom lens. Covering an impressive 10.7X, wide-to-longtelephotozoom range on both full-frame and APS-C format digital SLRs it gets down to an incredible 0.49m (19.3\") at 300mm in Macro mode for dramatic framefilling close-ups.Zoom in for a macro shotAnd to optimize its outstanding real-world image quality we&rsquo;ve built in our new high-tech, state-of-the-art VC (Vibration Compensation) system. The cutting edge 18-element and 13-group design of the 28-300mm VC lens incorporates XR (extra refractive-index ), LD ( low dispersion) and AD (anomalous dispersion ) glass as well as hybrid and GM (glass molded) aspherical elements to deliver exquisite sharpness and color correction over its extended range. The esteemed Di ( Digitally Integrated ) designation is your assurance of optimum digital and analog imaging performance. Capturing razor sharp handheld images just gotAF28-300mm F/3.5-6.3 XR Di VC FeaturesDi IILenses are designed for exclusive use on digital cameras with smaller-size imagers and inherit all of the benefits of our Di products. These lenses are not designed for conventional cameras and digital cameras with image sensors larger than 24mm x 16mm.Vibration Compensation (VC)Camera shake can ruin your photos, particularly at telephoto or in low light. Tamron's state-of-the-art Vibration Compensation mechanism incorporated into the award-winning 28-300mm zoom gives you blur-free hand-held images for incredible results! Finally, the technology you need in the lens you want.VC delivers blur free - handheld images for incredible resultsVC mechanism employs a three-coil systemLens element compensates for vibration using 3-steel balls (making movement quiet &amp; smooth)Exceptional images at slower shutter speeds &ndash; reduces the need for a tripodBring out contrast to motion &amp; stillnessEliminate the need to shoot with a FlashVC Off - VC OnLow Dispersion (LD)Low dispersion (LD) glass elements in a lens help reduce chromatic aberration; the tendency of light of different colors to come to different points of focus at the image plane. Chromatic aberration reduces the sharpness of an image, but glass with an extremely lowdispersion index, has less of a tendency to separate (defract) a ray of light into a rainbow of colors. This characteristic allows the lens designer to effectively compensate for chromatic aberration at the center of the field (on axis), a particular problem at long focal lengths (the telephoto end of the zoom range), and for lateral chromatic aberration (towards the edges of the field) that often occurs at short focal lengths (the wide-angle end of the zoom range.)Low Dispersion (LD) Glass for Greater Lens SharpnessExtra Refractive Index Glass (XR)Extra Refractive Index (XR) glass can bend light rays at steeper angles, thereby decreasing the physical length of the lens while enhancing imaging performance by minimizing optical aberrations. This has allowed Tamron to develop a line of shorter, smaller-diameter, lighter lenses without sacrificing lens speed, and actually upgrading image quality compared to older designs. XR glass is costlier than conventional glass but it yields enhanced optical power distribution, making possible many of the outstanding and innovative lens designs that bear the XR designation. XR glass, with its superior light-bending power, makes it possible to design a short-barrel lens with the same light-gathering ability (aperture value) as a long-barrel lens&mdash;even with a smaller lens diameter. By using this principle Tamron has been able to shorten the length of the entire optical system and produce lighter, more compact lenses of the same speed, and also to provide greater zoom ranges in lenses that are much more convenient to carry by hand.Special glass for better performance and more compact lens designsAspherical Elements (ASL) Provide the Ultimate in Image Quality and Compactness)Tamron uses several hybrid aspherical lens elements in many lenses bearing the Aspherical designation. These innovative optics allow us to achieve the ultimate in image quality, and at the same time produce lenses that offer remarkable zoom ranges in extraordinarily compact packages. By perfecting theses cutting-edge advances for series production, Tamron has advanced the state of optical design, and virtually eliminated spherical aberration and image distortion from the high-power-zoom series.Through the effective application of Hybrid Aspherical Technology, one lens elemen tcan take the place of multiple elements without compromising performance. This is what allows us to produce remarkably compact long-range lenses that deliver a uniformly high level of image quality at all focal lengths and apertures.Achieve the ultimate in image quality with Asperical (ASL) lensesInternal Focus (IF)Internal focusing (IF) provides numerous practical benefits to photographers including a non-rotating front filter ring that facilitates the positioning of polarizing and graduated filters, and more predictable handling because the lens length does not change during focusing. Even more important, Tamron&rsquo;s Internal Focusing (IF) system provides a much closer minimum focusing distance (MFD) throughout its entire focusing range. In addition, IF improves optical performance by minimizing illumination loss at the corners of the image field, and helps to suppress other aberrations that become more troublesome at different focusing positions.", "title": "Tamron AF 28-300mm f/3.5-6.3 XR Di LD VC (Vibration Compensation) Aspherical (IF) Macro Zoom Lens with Built in Motor for Nikon Digital SLR Cameras (Model A20NII)", "price": 6.25, "imUrl": "http://ecx.images-amazon.com/images/I/41WPiftTNQL._SX300_.jpg", "related": {"also_bought": ["B00004ZCJK", "B00603RV9O", "B0099XGZXA", "B001UE6N88", "B00004ZCFQ", "B0045KGZOG", "B0076AYNXM", "B0095ZLP3C", "B00004ZCL0", "1937538451", "B0009R3IJY", "B001GCVA0U", "B00FOTF8M2", "B00F5JV4NS", "B007RZB3KM", "B000CDA7XA", "B001GN3SGS", "B00HIKBW1G", "B009C08UNS", "B0000BZL8H", "B0009R5NN8", "B009DJ1THW", "B0083WYFWG", "B00AJD15F2", "B007SXJ13E", "B00AN8U0Y0", "B00A35X8ZG", "B0000ZJDYY", "B001542X64", "B00007EDZG", "B007M54E1M", "B00005NPWK", "B0098TAGHQ", "B0099Y1QM4", "B004NNUN02", "B002WE0QN8", "B00009R86L", "B00006JN3G", "B0080JH3YE", "B004Y1AYAC", "B00017LSPI", "B005K08G1U", "B00906D9YE", "B00DN43RCI", "B0098TG67U", "B003Y5T464"], "buy_after_viewing": ["B00004ZCJJ", "B008B4893M", "B004FLJVXM", "B001GN3SGS"]}, "categories": [["Electronics", "Camera & Photo", "Lenses", "Camera Lenses", "Digital Camera Lenses"]]}