{"asin": "B000MP831G", "description": "Apple has updated its highly rated wireless router with faster speed, twice the range, a lower price, and wrapped it all up in a whole new design. The new AirPort Extreme Base Station now has extra Ethernet ports for making wired computer connections and/or sharing network printers. It even has a USB  slot, for connecting a USB printer, external hard drive, or other USB device. Also, it works with both Mac and Windows machines.802.11n is faster, and with a longer range, than 802.11gAbout 802.11nAirPort Extreme Base Station is compatible with the 802.11n draft specification, the new, all-but-finalized (as of February, 2007) standard for wireless networking, or Wi-Fi. Apple says their 802.11n is up to five times faster than the currently ubiquitous 802.11g. It uses three discreet antennas that not only double its range over previous AirPort base stations, but allows up to 50 simultaneous connections. Unless you're an office manager, school principal or a cafe owner, you probably don't care about that much capacity. Still, it's nice to know you can, say, telecommute over the Internet while someone else in your household is streaming video without slowing each other down. Thankfully, AirPort Extreme is backward compatible with 802.11a/b/g devices. Apple does caution, however, that \"speed and range will be less if an 802.11a/b/g product joins the network.\"And while setting up a Wi-Fi network in your home can often be a confusing, frustrating experience, consumers have learned that Apple is adept at painlessly guiding even novice users quickly through a set-up process. Apple promises that their wizard will have you up, running, and secure in the time it takes to brew a cup of coffee. It offers WPA/WPA2 and 128-bit WEP encryption, as well as a built-in firewall, which helps protect you from Internet intruders.Sharing FeaturesOne of the most interesting features of the new AirPort Extreme Base Station is its ability to turn almost any external USB hard drive into a network attached storage (NAS) device. Just plug the disk directly into the AirPort Extreme Base Station's USB port, and it will be accessible through the built-in file sharing capabilities of both Windows and OS X. The AirPort Disk Utility software helps you set up permissions and passwords, keeping the disk (or parts of it) inaccessible from others on your network. You can similarly turn a standard USB printer into a network printer. The AirPort Extreme Base Station only has one USB port, but you will be able to plug both of those devices and more in by using a separately soldUSB hub. Like most wireless routers, AirPort Extreme Base Station lets you create a list of devices allowed to access your network. A new parental control feature in this router, though, lets you lock out specific devices, like a kid's computer, from connecting during certain hours of the day, such as after bed-time.What's in the BoxApple MA073LL/A AirPort Extreme Base Station, AirPort Utility for Mac and Windows, AirPort Disk Utility for Mac and Windows, 802.11n Enabler for Mac, Bonjour for Windows, power cord, printed and electronic documentation.", "title": "Apple AirPort Extreme Base Station MA073LL/A [OLD VERSION]", "price": 184.99, "imUrl": "http://ecx.images-amazon.com/images/I/31A6ezLoKRL._SY300_.jpg", "related": {"also_viewed": ["B00DB9WCR6", "B008ALA2RC", "B001UE8LRY", "B000UZCR56", "B002TLTG9E", "B005MQ17S6", "B0002GDIII", "B0012JJOQO", "B00FTOXP3Q", "B008L2DMZY", "B00AAQ3JE8", "B00006662F", "B009HC7BL8", "B0000899ZB", "B00IRSDKX6", "B00DBA1VYU", "B0012YYITW", "B008BEYP26", "B00GQW5EZ2", "B00FRMAOIO", "B002TLTGGM", "B006DEBYWU", "B00DVK1ITI", "B008H7MFYC", "B003S4ZJW4", "B000MQNMQ6", "B00DBDM934", "B007KZQM9Q", "B005KT2FYK", "B005E5281A", "B00BUSDVBQ", "B006IJJ6VQ", "B0002A9U7M", "B00DWFPDNO", "B00CK2CDLK", "B008RV51EE", "B0042ZYJRY", "B006QB1RPY", "B00007KDVJ", "B008ABOJKS", "B0081TXJ28", "B00BKFYLFO", "B00C9VB318", "B00F0JXDUU"], "buy_after_viewing": ["B00DB9WCR6", "B008ALA2RC", "B001UE8LRY", "B000UZCR56"]}, "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Wireless Access Points"]]}