{"asin": "B0013DCOZC", "related": {"also_viewed": ["B00931S35G", "B00B5P5XUG", "B001W3429E", "B0042VJCXY", "B008FH4L7S", "B007C1KYWE", "B003AMMZRG", "B002RARGOO", "B000J2AB94", "B003AMST8K", "B00CGY4N7Y", "B00BOZ1XA6", "B001CCLBSA", "B0013DCP06", "B00KXNIBPK", "B00GXJ2G7W", "B004W18TI8", "1576874389", "B0043RS864", "B005KBB79C", "B001H8DF0G", "B004G8QSTO", "B005MOWRXM", "B003MPOLX2", "B00DCM0DVE", "B0095F5AFQ", "B003M5H7Q0", "B00200K7SS", "B00AV3XH9W", "B00FPKDPXY", "B003CFB0MM", "B007CO24C4", "B006UMM2BW", "B0076F3RS4", "B00B46A1A8", "B003WJR69E", "B005JRIJWA", "B002NX13QC", "B0092MD5UY", "B00FPKDRVY", "B00ATM1MHO", "B00889ST2G", "B005OGR3QY", "B004HO59M4", "B0013DCP0G", "B00ATM1MVA", "B00604YTFM", "B009AYJQ2U", "B0097CXFCC", "B0092MD5ZE", "B00554Z9G6", "B001BKUTMW", "B001GNC7Q0", "B00DGQMJE0", "B0035LBRJO", "B001G5ZTPY", "B00CFCTDMC"], "bought_together": ["B0013DCP0G"], "buy_after_viewing": ["B003UH0528", "B0013D8V9K", "B0013DCP0G", "B00435UEV8"]}, "title": "Sigma DP1 14MP Digital Camera", "price": 540.0, "salesRank": {"Camera &amp; Photo": 14053}, "imUrl": "http://ecx.images-amazon.com/images/I/4114oJ1F2PL._SX300_.jpg", "brand": "Sigma", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]], "description": "Sigma has developed an integral-lens compact camera with the specs of a full-size, high-end SLR. In other words, the DP1 has all the functions of a full-spec digital SLR, packed into a compact camera with a built-in lens. Here at Sigma, we focused all our resources on achieving the nearly impossible. Sigma is not about creating run-of-the-mill photographs, or pursuing image quality defined by numbers. We give you a compact camera with the potential to capture exactly what you see and what you feel, with no compromise.The DP1 is a completely new type of camera offering the full specifications and high image quality of a DSLR in the body of a compact camera. It is powered by the 14-megapixel Foveon X3 direct-image-sensor, which can reproduce high definition images rich in gradation and impressive three-dimensional detail.It is possible to record images in RAW or the widely used JPEG in four resolution modes. It offers five Exposure modes and three Metering modes as well as being equipped with a built-in flash with the Guide Number of 6, hot shoe, neck strap and 2.5-inch TFT color LCD monitor with approximately 230,000 pixels.The DP1 has the high resolution and functionality of an SLR, plus adaptability in terms of accessories, all built into a small body. A wide range of accessories, optical viewfinder [VF-11], Lens Hood [HA-11], and Electronic Flash [EF-140 DG] are available for the DP1 camera.Sigma DP1 HighlightsSLR-sized image sensorThe size of the image sensor used in the DP1 camera is 20.7mm x 13.8mm. It is approximately seven to twelve times larger than the 1/1.8-inch to 1/2.5-inch image sensors used in ordinary compact digital cameras. The pixel size of the image sensor is 7.8&micro;m. The large photodiodes deployed at a large pixel pitch capture pure, rich light efficiently and give the DP1 its high resolution and richly-graduated tones.Full-color image sensorThe DP1 uses the same 14-megapixel direct image sensor as the SD14. Utilizing the special features of silicon, which is penetrated to different depths by different wavelengths of light, this direct image sensor succeeds in full-color capture with the full RGB in a single-pixel location. Just like film, each photodiode captures all the RGB data, so no final-stage demosaicing is required. The DP1 incorporates the brand-new \"TRUE\" (Three-layer Responsive Ultimate Engine), the world&rsquo;s first image processing engine suited for Foveon three silicon embedded layer direct image sensor. The unique image-processing algorithm, which has been developed throughout the development of the SD9, SD10 and SD14 cameras, is incorporated into \"TRUE\". It enables high-speed image processing and high image quality.16.6mm F4 lens designed exclusively for the DP1The DP1 is equipped with a 16.6mm F4 lens, equivalent to 28mm on a 35mm SLR camera, which has been designed exclusively for DP1. The large-diameter of aspherical glass provides low distortion and high contrast images. It also offers superior peripheral brightness. The super multi-layer coating reduces flare and ghosting. It allows photographers to take pictures in difficult light conditions. This lens and SLR-sized image sensor provides natural shallow depth-of-field.RAW format recordingThe DP1 includes JPEG recording format for convenience plus a RAW data (X3F) recording mode for retaining full image capture detail of the utmost quality. The RAW data format provides pure data for high-resolution images, and uses lossless compression for more compact, yet uncompromised, data files. The RAW data format of the DP1 keeps brightness and color data in a 1:1 ratio without relying on interpolation. Each pixel location captures the full color of RGB data, so in RAW, X3F files, brightness and color data can be kept in a 1:1 ratio without relying on interpolation. When the image is processed in Sigma Photo Pro, it will preserve the balance of the natural data for the best photos with the best image quality.Exclusive Sigma Photo Pro software includedThe DP1 comes complete with Sigma Photo Pro software, a RAW image developer that converts all RAW data quickly and easily. Adjustments can be made in three separate modes. The X3F Mode 3 stores the original settings of the image at the point of capture. In the Auto Adjustment Mode, the software analyzes and automatically makes adjustments to the RAW data. The Custom Mode allows the photographer to make individual adjustments (exposure, contrast, shadow, highlight, saturation, sharpness and fill-light for example).The photographer can make changes easily and quickly by simply adjusting the slider controls within the software. The X3F Mode stores the original settings of the image at point of capture. Photographers` personal modifications can be saved to the RAW, X3F file for future use. Sigma Photo Pro supports 8-bit TIFF, 16-bit TIFF, and JPEG file formats. The JPEG can be saved as YCbCr 4:4:4. It is also possible to half, or double the resolution when processing the image.Compact and lightweight bodyThe DP1 has compact dimensions of 4.5 (W) x 2.3 (H) x 2.0 inches (D) and weighs just 8.5 ounces. Its compact body and lightweight design makes it easy to carry everywhere.Three metering modes and five exposure modesThe DP1 has three metering modes, Evaluative Metering, Center Weighted Average Metering and Spot Metering. It is also possible to select the exposure mode from Auto, Program AE, Aperture Priority AE, Shutter Priority AE or Manual. Exposure compensation can be set in 1/3 stop increments from +3.0 to -3.0 stops and an auto bracketing function is also available.Pop up (manual) built-in flashThe DP1 is equipped with a pop up (manual) built-in flash featuring guide number of 6 (ISO100 / m). It is possible to use Normal Flash, Red-Eye Reduction Flash and Slow Synchro Mode. It also features flash exposure compensation in 1/3 stop increments.AF area selectionThe AF area of the DP1 is equipped with 9 focusing points and it is possible to manually select the desired focusing point. The focusing distance is from 50cm to infinity, however, it is possible to shorten the minimum focusing distance to 30cm.Manual FocusManual Focus is available for photographers who like to take more control, or for use when autofocus or focus lock is not effective. It is also possible to magnify the display to ensure precise focusing.Recording moviesIt is possible to record 30fps movies with QVGA (320 x 240). The digital zoom function can be used during movie shooting. A 1GB memory card (not supplied) allows approximately 30 minutes of movie recording.Large, 2.5-inch TFT color LCD monitorThe DP1 camera features large 2.5-inch, 230,000 pixel TFT color LCD monitor. The LCD monitor displays 100 percent of the images, allowing the photographer to easily and accurately confirm the image compensation.Hot shoeThe DP1 camera is equipped with a hot shoe, allowing use of the dedicated external flashgun EF-140 DG (optional) or high-performance view finder VF-11 (optional). EF-500 DG and EF-530 DG flashgun series can be used in manual mode only.Dedicated lens hoodThis optional lens hood blocks out extraneous light. A hood adapter, designed to accept a 46mm lens filter, is included."}