{"asin": "B000LU8A7E", "description": "The DV-981HD is the latest incarnation in Oppo's highly aclaimed line of upconverting DVD players. It offers an HDMI interface (HDMI Specification 1.1), with HD upconversion ouput resolutions of 720p, 1080i, and full 1080p. This is Oppo's most full-featured player yet, and as such, it's not a DVD player for people with regular analogue sets. While the DV-981HD doesn't offer component output, and doesn't output standard or native resolution, it does represent one of the best (if not the best) upconverting DVD players out there, and it's perfect for people with HDTVs up to full 1080p who aren't ready to jump on the HD DVD or Blu-ray bandwagen. In addition to excellent upconversion, the DV-981HD offers playback of a whole host of formats including DVD-Audio, Super Audio CS (SACD), Audio CDs, HDCD, WMA, Kodak Picture CDs, all version of DivX including DivX6, as well as Xvid, .SRT, .SMI, .IDX, and .SUB file formats.Audio FeaturesThe DV-981HD outputs audio in stereo or in 5.1 channel surround, either via HDMI, or through the included 5.1 analogue outputs. Other connections include S-Video out, and digital coaxial and optical audio outs. It features 24-bit, 192 kHz high resolution audio D/A converters, supports  virtual surround in six settings, and has built-in equalizer, channel trim, and channel delay functions.Farudgja DCDi TechnologyRather than trying to build their own upconversion technology for this machine, the Oppo DV-981HD the DCDi Faruja technology from Genesis Microchips. In addition to upscaling a DVD's native 720x480 interlaced video to 480p, 720p, 1080i, or 1080p, Farudja technology also detects content that has gone through 3:2 pull down to convert film content to NTSC for video, and recreates the original frames by blending the fields back together. It then processes for any edit mistakes and reconstrucs an accurate signal, producing an image free of motion artifacts. The unique DCDi algorithm can also identify moving edges within an image and adjust interpolation at a pixel level to create smooth edges for on-screen objects, eliminating the jaggy edges that commonly result from other upconversion techniques. Farudja processing also uses a proprietary \"TruLife Enhancement\" technology to identify transitions in the image considered to be details such as skin texture, freckles or hair, and enhance those to bring more detail in an image to life on the screen. This approach avoids image artefacts common with the peaking filter approach used by other systems for detail enhancement. The Farudja system uses temporal filtering for noise reduction, and can achieve 6 to 10 dB of Noise reduction without introducing artefacts or losing sharpness in the image.Connections:HDMI - High Definition Multimedia Interface: 1Analog Stereo Audio (Mixed 2-Channel Left/Right): 1 group (2 connectors)Analog 5.1 Channel Audio: 1 group (6 connectors)S/PDIF (IEC-958) Coaxial Digital Audio: 1S/PDIF (IEC-958) Optical Digital Audio: 1Composite Video: 1S-Video: 1No Component Video (YPbPr/YCbCr) on the DV-981HD model. This model is designed for use with a display device with HDMI or DVI digital video input.Compared with Other Oppo DVD player modelsAt the time of this writing, Oppo also has theDV-970HDupconverting player, and their originalOPD971H model. Of these three models, the DV-981HD is the only that upconverts to full 1080p, the other models offer upconversion to 720p or 1080i only. Both the DV-981HD and the DV-970HD offer Super Audio CD (SACD) playback, the OPDV971H does not. The other major difference to consider is that the DV-981HD and the OPDV971H both use Farudja processing for video upconversion. The DV-970HD uses a different upconversion system that may not be as full featured as the Farudja. For this reason Oppo recommends the DV-981HD, or the OPDV971H for use with larger screen HDTVs 50 inches or greater, while the DV-970HD is only recommended for HDTVs smaller than 50-inches. Oppo recommends the DV-970HD for use with external video processors or scalers, and suggests careful calibration of both the DV-981HD and the OPDV971H when used with DLP HDTVs. Both of these players are good for use with DLP HDTVs, but for the best picture, some setup time is required. For disply with a DVI input on your HDTV, an HDMI-DVI adapter is required with both the DV-981HD and the DV-970HD models.What's in the BoxOppo DV-981HD upconveting DVD player, a High-quality certified HDMI cable with gold-plated HDMI connectors, Remote control with \"glow in the dark\" keypad (batteries included), Stereo audio cable, Composite video cable, and User manual and warranty information.", "title": "Oppo DV-981HD Universal DVD Player with HDMI, 1080p Up-Converting, DivX &amp; SACD (2008 Model)", "price": 499.0, "imUrl": "http://ecx.images-amazon.com/images/I/31MGJX41X7L._SX300_.jpg", "related": {"also_viewed": ["B009LRR5AQ", "B00078GLJY", "B004SBHSZ2", "B004BLK24S", "B00817UWQ6", "B00GPFM106", "B008F86F30", "B009AHQ8C8", "B00KQ2EQUM", "B009UXEOIW", "B004BI6MVS", "B00I19TOGS", "B003R7KMTW", "B004UR487A", "B008982LDY", "B00D0EP68Y", "B007F9XHAY", "B00LIQST6W", "B002B97X3K", "B00HUGNN06", "B00021O4V8", "B004QIPKNY", "B002CO6GUK", "B00BN9CH26", "B008HO9VHE", "B001URWAYG", "B003ANVQWU", "B00752R4QO", "B004NQU4YY", "B001A5NGZU", "B005C98484", "B00BI4D8BK", "B0045PKK60", "B00AFKBIYW", "B0038JECKO", "B00BFEF9N8", "B00GXTUTN0", "B0039XRUBM", "B005NEZDUA", "B004LNMAAA"], "buy_after_viewing": ["B009LRR5AQ", "B007F9XHAY", "B007F9XHAY", "B00AWKC0JM", "B003L1ZYYM"]}, "categories": [["Electronics", "Television & Video", "DVD Players & Recorders", "DVD Players"]]}