{"asin": "B0035FZJJ4", "related": {"also_bought": ["B001V9KG0I", "B0035FZJK8", "B00449BNDG", "B003VNKNEQ", "B003F3ZFVS", "B003ZRRE1I", "B00A8M1IEC", "B00065L5SU", "B00CV9MHG8", "B0037TA7Z4", "B00CV9MHYU", "B004J3YCGM", "B00065L5TE", "B005HNF01O", "B0037T6O6A", "B005BACRL4", "B003MTTAXE"], "bought_together": ["B003VNKNEQ"], "buy_after_viewing": ["B00AWYN0BU", "B003VNKNEQ", "B003VNKNF0", "B00AWYN182"]}, "title": "Canon PowerShot SD1400 IS 14.1 MP Digital Camera with 4x Wide Angle Optical Image Stabilized Zoom and 2.7-Inch LCD (Black)", "price": 288.0, "salesRank": {"Camera &amp; Photo": 1810}, "imUrl": "http://ecx.images-amazon.com/images/I/41cLRjlOrNL._SX300_.jpg", "brand": "Canon", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Shy and modest is so yesterday. Get ready for brilliance that's the center of attention once the PowerShot SD1400 IS Digital ELPH camera is in your hands. First glance says it all: nothing moves you like the impact of sleek sculpture, especially when it's drenched in the purest, ripest colors. Inside, Canon engineers defy micro-space with big, brilliant innovation.PowerShot SD1400IS Highlights14.1-megapixel resolution and large, 2.7-inch PureColor System LCDCanon's commitment to innovation defines the excitement of the PowerShot SD1400 IS Digital ELPH. 14.1-megapixel resolution is more than a number, it's your cutting-edge link to the outstanding clarity and quality you've always wanted in your images. Think bold and big, because razor-sharp oversized prints are a breeze. Get the picture? It's absolutely brilliant.The PowerShot SD1400 IS Digital ELPH gives you a large 2.7-inch LCD screen for excellent control when framing your shots. The Canon PureColor System LCD offers spectacular color, resolution and contrast even when viewed at an angle. The screen is highly durable and easy to see in any light with a scratch-resistant, anti-reflective coating. It also features Night Display for easy viewing in low light--a perfect feature for gathering friends and family around to see your images.Sleek, slim, sophisticatedIt takes meticulous engineering to create a camera so slim and stylish and yet so impressively equipped with the most advanced Canon camera features. Cool, assured and ready to hit the road with loads of fashion impact. The PowerShot SD1400 IS Digital ELPH will be your fave fashion accessory. Sleek enough to tuck anywhere. Bold enough to be the center of attention.28mm wide-angle lens, 4x optical zoom and Optical Image StabilizerThe PowerShot SD1400 IS Digital ELPH has a 28mm wide-angle lens with 4x optical zoom lens that makes it easy to get not only breathtaking panoramas, but also the inspiring, emotive close-ups that will make your images lasting keepsakes. This magnificent lens gives you the power to shoot distant subjects with razor-sharp precision and stunning lifelike color. So you can brilliantly capture a closer shot of a landscape, or a child's big smile.The PowerShot SD1400 IS Digital ELPH is equipped with the acclaimed Canon Optical Image Stabilizer, which automatically detects and corrects camera shake--one of the leading causes of fuzzy or blurred shots. Even when zoomed in, you can get the steady, crisp, brilliant images you'll be proud to shoot and share. And the Canon Optical Image Stabilizer technology is so convenient to use. It functions perfectly with or without a flash.720p HD movie shooting capability plus HDMI outputThe PowerShot SD1400 IS Digital ELPH lets you record video in beautiful 720p high definition (1280 x 720 pixels). The camera also makes it easy to enjoy HD movies (and still photos) on your HDTV with a mini-HDMI connector for direct connection to a high definition TV monitor. You'll enjoy the HD experience with no degradation of image or audio in the signal, plus the ability to display up to 130 still images at once.Let Smart AUTO do the work for you by intelligently selecting from 22 settingsJust set the Canon PowerShot SD1400 IS Digital ELPH to Smart AUTO and you're ready for maximum enjoyment from your picture-taking every time. It's a relaxing and satisfying way to shoot because you can completely concentrate on your subject knowing that the camera has the technical details covered. Advanced Canon technology intelligently analyzes your situation and shooting conditions. Then it automatically selects an appropriate setting from 22 specially defined settings. So whether you're photographing flowers, a captivating sunset, or your friends at the park, you can be confident that you're getting dramatic, memorable images.Shooting ModesAdvanced presets for the best possible photos under certain conditions. With 22 Shooting Modes, you're ready for whatever shot comes your way.Bring creativity to your photos with new scene modes such as Miniature Effect and Fisheye EffectThe Canon PowerShot SD1400 IS Digital ELPH offers creative effects similar to those found in certain professional lenses. Miniature Effect creates an illusion where very large objects appear in miniature proportions. Turn soaring cityscapes into a scene in seemingly dollhouse-like proportions.Fisheye Effect uses barrel distortion to warp the image around the center, giving a distinctive curvature effect to the photo. The curvilinear images produced by Fisheye Effect can suggest the curve of the Earth, the inside of a dome, or the image you see through the peephole of a door.ISO of 400-6400 in Low Light modeNow even scenes notorious for having insufficient light, such as those lit by candles, fire, or street lamp, come through in fantastic color and clarity, with less noise. You can keep the feel of the scene intact without adding additional light, so the result will be scenes with the visual accuracy, depth and clarity you expect from a Canon camera.New Smart Shutter technologySmart Shutter, which includes Smile Self-Timer, Wink Self-timer and Face Self-timer, detects faces in the scene and releases the shutter automatically in response to the appearance of an additional face, or when a smile or sassy wink occurs. These technologies take the guesswork out of your photography, allowing you to focus solely on your subject and get the perfect shot.What's in the BoxPowerShot SD1400 IS Digital ELPH BodyLithium-ion Battery Pack NB-4LBattery Charger CB-2LVWrist Strap WS-DC7Digital Camera Solution CD-ROMUSB Interface Cable IFC-400PCUAV Cable AVC-DC400"}