{"asin": "B00006B7DB", "description": "D-Link, the industry pioneer in wireless networking, introduces another performance breakthrough in wireless connectivity - the D-Link PersonalAir series of Bluetooth enabled networking products capable of data transfer among devices such as PDAs, printers, cellular phones, computers, and other emerging electronic devices.The D-Link PersonalAir DBT-120 USB Bluetooth Adapter is a very compact, low-profile solution based on the Bluetooth 1.1 specification, making it compatible with other Bluetooth enabled devices. The DBT-120 was designed and engineered from the ground up to be compact and portable, making it the perfect solution for notebook computers, but also just as easy to use with a desktop computer. The DBT-120 features standard 128-bit encryption that provides you with a higher level of security for your data and communication.The D-Link PersonalAir DBT-120 includes Bluetooth management and connectivity software by WidComm, which enables you to configure and access Bluetooth enabled devices quickly and easily. The Bluetooth software enables your computer to discover and access available Bluetooth services ranging from Internet access to wireless synchronization with your PDA or cellular phone.Compatible with USB 1.1, the DBT-120 supports Windows XP, 2000, Me, 98SE, and Macintosh OS X 10.4.3 and installs quickly and easily to a desktop or notebook computer with an available USB port.", "title": "D-Link DBT-120 Wireless Bluetooth USB Adapter", "price": 12.99, "imUrl": "http://ecx.images-amazon.com/images/I/414NAvPY9mL._SX300_.jpg", "related": {"also_viewed": ["B005Z5HT2M", "B007GFX0PY", "B009ZIILLI", "B001EBE1LI", "B003VX3S3Y", "B000CDWNSW", "B004X8R7HY", "B002AQSTXM", "B00EW3WS9M", "B00AKO7XOW", "B00F25Z0FS", "B007MKMJGO", "B001D8CCYK", "B00I02DG9M", "B00GMFYM8I", "B004LNXO28", "B0002K6RK0", "B00DJ83070", "B007Q45EF4", "B00644FV14", "B0041UJVI2", "B00H8O8CMO", "B000E7UN5G", "B003765X38", "B008BC1U4O", "B002SBF108", "B003KU4DOG", "B00IN2S018", "B0042ZYJRY", "B00HHLAY7E", "B002T9H0XK", "B0000DZET4", "B004VM1T5S", "B005DLDO4U", "B00DTZYHX4", "B00FLKW0JI", "B003XIJ3MW", "B008IFXQFU", "B00IQBSW28", "B001MSS6CS", "B005L38VRU", "B00E9YIFQ4", "B005DLDTAE", "B0047T79VS"], "buy_after_viewing": ["B007Q45EF4", "B005Z5HT2M", "B007GFX0PY", "B009ZIILLI"]}, "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Network Adapters", "USB Network Adapters"]]}