{"asin": "B002O3W3Y2", "description": "While many iPod speakers fall into the dime-a-dozen category, the iGroove SXT iPod Speaker System, with iPhone certification, definitely does not. In fact, this sleek, pint-sized powerhouse fits perfectly into any room, while making your playlists larger than life.Sleek style and performance prowess.Click to enlarge.Re-tuned bass ports remove \"port noise.\"Shielded from cell phone interference to prevent unwanted noise.The original iGroove SXT, introduced in 2007, turned a lot of heads with its sleek style and performance prowess. This latest version takes that success to a whole new level, without costing a penny more. It sounds better than ever and accommodates all of the new iPod and iPhone models, even the iPhone 3G S.TechnologyThe iGroove SXT remains a true stereo sound system that employs dual long-throw 2.5-inch woofers in a ported enclosure and dual 3/4-inch horn-loaded tweeters. Klipsch is the only company in the iPod speaker category to utilize horn technology, a design that delivers lifelike sound as well as produces more output using less energy. The result? Huge stereo sound from a pint-sized package.And unlike before, the iGroove SXT is now bi-amplified, which means each driver is individually amplified, a feature that virtually eliminates distortion and significantly improves sonic performance. Klipsch also re-tuned the bass ports on the sides of the system to remove any \"port noise.\"In addition, the amplifier is shielded from cell phone interference, so you can forget about unwanted noise when you've got an iPhone docked.iPod/iPhone CompatibilityThe iGroove SXT charges any iPod with a 30-pin connector, while the shuffle and other digital devices connect via a rear auxiliary input. Klipsch added a 1000mA rapid charge circuit to the system, so you can quickly recharge your iPod, iPod touch or iPhone.For video-enabled iPods and iPhones, an S-video output lets you watch videos on external monitors.Finally, need an alarm clock? Combine your iPod's alarm clock feature with the iGroove SXT.What's in the BoxiGroove SXT, IR Remote, Power Adapter, Power Cord", "title": "Klipsch iGroove SXT 30-Pin iPod/iPhone Speaker Dock", "price": 113.95, "imUrl": "http://ecx.images-amazon.com/images/I/41qsbLvaynL._SX300_.jpg", "related": {"also_viewed": ["B003VANOI6", "B00BQ4HRG4", "B000P6664I", "B005GUAIJM", "B0038W0N8G", "B003M8HWDA", "B0016BQS12", "B007JCNOHI", "B008G4SEBY", "B00DV7AH1Q", "B009CWRVH2", "B002I636XM", "B005IVL0UA", "B003SX0NFI", "B0064XTQ98", "B000M56304", "B001DLTDQC", "B00BQ4HRE6", "B003SX0NG2", "B004T0MW7Q", "B0046RE00Y", "B004TS2AP2", "B004SKBJ5S", "B005IVL0SM", "B008N73V7G", "B004SKBJP8", "B007PZYBSA", "B0071BAP4M", "B005GUAIBU", "B003ZZWJII", "B0006VX1G8", "B00BQ4HRN2", "B000KE48CM", "B0017XMN7C", "B002I3OZ7G", "B004T1Y8G8", "B009I7XCYM", "B004MME6T8", "B002Y5XQYG", "B003ZQYVVK", "B0060DVYW4", "B00G9BPBIU", "B00FQVNQ22", "B00KMB7OK6", "B00KMFQIEU", "B00B7D4CRQ", "B00FVSF63M", "B00BAQJ94Q", "B003BIFJOA", "B00ALWIV12", "B001EXMEM4", "B00B7D4CS0"], "buy_after_viewing": ["B003VANOI6", "B00B7D4CS0", "B007JCNOHI", "B00BQ4HRG4", "B00BQ4HRG4"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}