{"asin": "B0036KRP3Q", "description": "Monster Hunter 3 (Tri)is an action role-playing game (RPG) from Capcom. The first iteration of the popularMonster Hunterfranchise to make an appearance on the Wii platform, action in it revolves around quest based gameplay involving the hunting and capture of monsters as a means of character development. The game features multiple modes of co-op gameplay&#151;both online and offline&#151;new monsters and weapons classes, multiple controller options and Wii Speak and text chat player communication support. This bundle includes the Wii Classic Controller Pro, developed with input from Capcom..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Exciting co-op play modes.View larger.New monsters and weapon classes.View larger.Classic RPG elements.View larger.Wii Classic controller Pro included.View larger.StoryMonster Hunter Triis set in a massive, sublime land where humans and monsters coexist. You play the role of an up-and-coming hunter who must accomplish various quests to achieve glory and help the residents of their village survive. Do you have the courage to hunt the monsters that roam your world? It won&rsquo;t be easy &ndash; the monsters are strong and numerous. Yet by hunting together with friends, or fighting the good fight solo, there is no monster that cannot be defeated.GameplayMonster Hunter Triis an action RPG centered around players' expertise with the various weapon sets available in-game to take down the plethora of monsters that fill the gameworld, including underwater environments. Hunters can track monsters, set traps for them and either capture or slay them when they are encountered. In single player mode players can select a hunter of either gender, choose from a variety of weapons classes and set off with a crew of AI companions referred to as ChaCha. When a monster is slain, the hunter can carve off their horns, scales and bones, which can be used to create a huge variety of weapons and armor. These items can be bought or crafted by giving the village blacksmith materials and a fee. With success comes upgrades both for yourself and your ChaCha companion.Co-op MultiplayerUtilizing the graphics and wireless capabilities made possible by Wii,Monster Hunter Triallows for a unparalleled co-op gameplay experience, both online and offline. Players can hunt in groups as large as four players online, or two players offline (split-screen). Co-op play is split between two modes: Open-world hunts and Arena mode. Open-world hunts allow players to explore theMonster Hunterworld, taking on the creatures they seek wherever they may be found. The caveat is that within this mode players, as well as monsters, can retreat and even escape bad situations regenerating to fight another day. Players who fall in these clashes will respawn nearby, and as long as one of their party remains alive the monster(s) faced will retain the level of damage inflicted upon them before the player's death. Arena mode is similar in most ways to Open-world hunts except that battles take place in set arena settings where there is no retreat for either side, making it a battle to the death. Communication between players in either mode is facilitated via Wii Speak and text chat support.Multiple Controller SupportMonster Hunter Trifeatures a wide array of controller configurations and options. These include: Wii Remote and Nunchuk, Classic Controller and Classic Controller Pro. Each features in-depth mapping of questing and weapons classes. And finally the Wii Remote allows the ability to save your character&rsquo;s information directly to it, just as is possible with Miis, so you&rsquo;re always ready to play at a friend&rsquo;s house.Key Game FeaturesSpecial Controller Included- Designed with input from the Capcom development team, the Wii Classic Controller Pro is included in this bundle.Hunt Together- In the hunt, you&rsquo;re never alone. Hunt together with up to 4 players online or take on arena quests with 2-player split-screen action. In single player mode, you even have the ability to hunt with AI-controlled characters named ChaCha.Communicate Online- Because communication is key in coordinated huntsMonster Hunter Trisupports Wii Speak and text chat.Monsters with Unique Abilities and Attacks- Monsters have unique and dynamic personalities, abilities and defenses, increasing in complexity as the player progresses. They camouflage themselves to ambush hunters, but will flee or call for help if outmatched.Immense Living, Breathing World with Ecosystem- Monsters interact amongst each other in a living breathing ecosystem, complete with food chain. Monsters have stamina, migrate and even attack one another, the strong feeding on the weak.New Underwater Maps- For the first time ever in anyMonster Huntergame, you will be able explore land and sea and hunt monsters of the deep.Fully Customizable Equipment- With ten weapon categories &ndash; including the all-new Switch Axe &ndash; and new armor and weaponry created from the remains of slain monsters, there are almost limitless opportunities for equipment customization.Choice of Controls- Play with either the Wii Remote and Nunchuk, with the Classic Controller or Classic Controller Pro.Take Your Character with You- The ability to save your character to your Wii Remote lets you engage in multiplayer hunts anytime on a friend's console.", "price": 89.94, "imUrl": "http://ecx.images-amazon.com/images/I/61gHJ%2Bo4xKL._SY300_.jpg", "related": {"also_bought": ["B007CSF3GO", "B001HB7K6I", "B002BSC4ZS", "B002EE7OKE", "B0019SY1D4", "B000P46NKC", "B000FQBPDU", "B00B2QL2Y4", "B001TOMR0C", "B002E6XY6U", "B00KVRK39A", "B002BRZ9AG", "B001HWF1OA", "B007RNWUC4", "B004WLRQMI", "B000Z9A95M", "B0015HZLVK", "B009EWHKAI", "B001COVME6", "B001HB7KAO", "B003O6FW6E", "B001EZ8IBS", "B009B1D7JK", "B002HJYKG2", "B0037US4IA", "B00C1ZBFTW", "B0009VXBAQ", "B002EE5SAC", "B003ZHMMEM", "B000M4KIME", "B000FQ9R4E", "B005TH6BD4", "B002BSC54I", "B0016C3260", "B007A7UJ4S", "B0081716P2", "B000CBCVEU", "B000QTD05M", "B003ZCH7DI", "B006QRNKOO", "B0094X28J0", "B0017WHQ34", "B0089X37NW", "1616550414", "B0067O5SBE", "B000FQBPCQ", "B0087OY17Y", "B001NCARPW", "B002I0EH6I", "B003YVK5T8", "B00BY0G0YU", "B002I0J6KU", "B000F3AACA", "B004CVWETI", "B000VIPJ0W", "B008GFZV6Y", "B007B7BHJ8", "B009LEIUY4", "B0089O4EB0", "B0015HZLVA", "B002BRZ9G0", "B002I0IIPY", "B004EW948E", "B00AKIPBNS", "B00D87TCN8", "B001J2SEY2", "B002FG9MWE", "B007W8S2MG", "B0055202HE", "B002BSA388", "B00D9IM0B2", "B002BSC4RQ", "B009LGO88E", "B0054J1LBO", "B00CTKHXFO", "B000R37S00", "B00136MBHA", "B005FYJA52", "B000UV0DJ2", "B001CTL5GQ", "B00GV4V8XC", "B000FQ2DTA", "B001TOMQVC", "B004W4S1S8", "B003K18LT8", "B003O6JIVE", "B0050SVGW8", "B000GABOTU", "B009LWQ8FE", "B009AFLXQQ", "B003PHLT8W", "B005VBVQDI", "B0058VI0G2", "B002BRYHY0", "B004XYN4NY", "B0050SVLI2", "B002AB7TX8", "B00BKWQA2Y"], "bought_together": ["B007CSF3GO"], "buy_after_viewing": ["B009EWHKAI", "B000FQ9R4E", "B002EE7OKE", "B004WLRQMI"]}, "salesRank": {"Video Games": 7670}, "categories": [["Video Games", "Wii", "Games"]]}