{"asin": "B0043RS864", "related": {"also_bought": ["B001FA09ZA", "B0059VMH5G", "B005FY2DZG", "B004MME698", "B0000BZL2Y", "B004EC20Y4", "B005HNNJXA", "B004NROYUS", "B000GGCHUO", "B005LFT3MA", "B004QBQAXU", "B005CRHM5C", "B004MME69S", "1933952989", "B00CDJSIMS", "B008KFY16Q", "B005FYEUM0", "B0051GN88O", "0964987589", "B00004ZCJF", "B004KU0RJK", "B00CDJT30O", "B0000BZM1F", "B00D86W060", "B00576ANLS", "B00E259GCC", "B00CV9ML5U", "B0001TSSM2", "B007FLQ8D0", "B00AY74JTW", "B004MME6A2", "B0099RPEVU", "B0083F2QP6", "B002O1AH5Q", "B00D62VZBW", "B00GV14H92", "B00BMK9U76", "B00B0N2BZ8", "B002KEYYCE", "B00CDJZ8GM", "B007NDL542", "B002N1WACA", "B004QLHYXU", "B004CFBV6Q", "B004NROYUI", "B00A28O7XQ", "B00CWF63S4", "B0090CF57M", "B007NDL56U", "B00D0O9QC6", "B007A2KCEU", "B005LFT3QG", "B008OD1BNK", "B006UL00R6", "B006UL010W", "B00C9UROH6", "B00ATM1MVA", "B0061ZL4CQ", "B00009R970", "B007M54E08", "B00D86UQWK", "B008S7BPWE", "B005LFT3GG", "B006UV6YMQ", "B00603RXHE", "B00AA48IUA", "B00HA20A9M", "B00GUGL3HM", "B005KBB79C", "0321929500", "B00C7SDLU4", "B003WE9MCI", "B005BTKQTA", "B006W1J3OK", "B005Y1SZSO", "B004TA70SC", "B00HK8Z9AG", "B004Q3C98S", "B0056NC7O8", "B007NDL56A", "B0084G3FKE", "B000H02B6O", "B00009R7ZL", "B00DCM0E5Y", "B005BOSHKU", "B00CV9M6U0", "386521584X", "B0037FLUYU", "B00F5JH9FU", "B004OVE16U", "B00C9USP8I", "B00CNZTPGA", "B004NROYVM", "B007NLU8CE"], "bought_together": ["B001FA09ZA", "B0000BZL2Y"], "buy_after_viewing": ["B00ATM1MVA", "B0000BZL2Y", "B004EC20Y4", "B003VNKNF0"]}, "title": "Fujifilm X100 12.3 MP APS-C CMOS EXR Digital Camera with 23mm Fujinon Lens and 2.8-Inch LCD", "price": 809.0, "salesRank": {"Camera &amp; Photo": 1668}, "imUrl": "http://ecx.images-amazon.com/images/I/41kBoDfzx5L._SX300_.jpg", "brand": "Fujifilm", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The Fujifilm FinePix X100 is a high-precision digital compact camera that combines modern technology with a traditional camera design to deliver the ultimate in image quality.Featuring an APS-C CMOS sensor (12.3 megapixel), a Fujinon 23mm Single Focal Length Fixed F2 lens, a 2.8-inch LCD with 460K pixel, and the world's first Hybrid Viewfinder, the FinePix X100 captures exceptionally high quality images.Fujifilm FinePix X100 HighlightsCustom 12.3-megapixel APS-C CMOS sensorThe FinePix X100 features a custom 12.3-megapixel APS-C CMOS high-performance sensor, internally optimized and developed exclusively for this model.  Optimization of the angle-of-incidence in conjunction with the specially developed lens maximizes light gathering efficiency extending to the perimeter of the sensor for a sharper image with exceptional clarity.  When shooting HD movies, the combination of the large-sized sensor and the large aperture F2 lens, lets users create a soft out-of-focus image--a capability not available in conventional compact cameras.  The ideal combination of a fixed focal length lens, high-sensitivity sensor (approximately 10 times the sensitivity of a conventional compact*) and a high-performance image processor captures extremely high quality images from low sensitivity to high sensitivity.  In standard form, the planned ISO range is from 200 to 6400, but this can be expanded to include 100 and 12800.The newly developed EXR Processor takes EXR processing to new heights. Combined with the high-sensitivity sensor, the EXR Processor achieves the highest resolution, sensitivity and dynamic range ever produced by a FinePix digital camera for the ultimate in image quality.  The high-speed CMOS sensor read-out and the EXR Processor's enhanced focusing system contribute to the high-speed AF performance, while the combination of the optical viewfinder and extremely low shutter lag time enhance the image capture experience.High-performance 23mm F2 Fujinon lensThe FinePix X100 comes with a new Fujinon non-collapsible lens structure that expands the realm of photographic expression with sharper resolution from the center to the corners.  It has a 23mm (135 equivalent: 35mm) F2 lens, with eight elements in six groups.  One aspherical glass molded lens.  The adoption of the non-collapsible lens structure with minimized lens length not only contributes to the compact size, but also eliminates telescoping of the lens when the power is on.  It's ready to start taking photos the moment the user turns it on.  In addition, the lens features not only the large F2 aperture value, but also an optical architecture that maintains a high degree of resolution even when closed by 1 to 2 stops.  The adoption of a 9-blade aperture diaphragm combined with the large F2 aperture and high-quality optics lets users take photos with a beautiful circular soft out-of-focus (bokeh) effect.  With macro shooting capability as close as four inches, users can explore the fun and fascination of close-up photography.  The built-in ND filter (equivalent f-stop reduction of three) can be switched ON/OFF via simple in-camera settings.World's first Hybrid ViewfinderThe true enjoyment of photography begins with the thrill of seeing the world through a viewfinder.  The new Hybrid Viewfinder has been developed to reintroduce users to this essential camera experience.  It combines the window-type \"bright frame\" optical viewfinder found in rangefinder-type film cameras such as the classic 135-size or medium-format cameras, with the electronic viewfinder system incorporated in most compact or mirrorless digital cameras.  By integrating a prism for the 1,440,000 dot LCD panel image on the viewing screen in the reverse-Galilean optical finder, the Hybrid Viewfinder can show both the shooting frame and a variety of electronic shooting data.  It can also be used as a high-quality electronic viewfinder to compose or playback shots.  With this ability to instantly switch between optical and electronic viewfinder modes using the simple \"one touch\" control, the new Hybrid Viewfinder offers users expanded freedom in the composition and enjoyment of photography in a wide range of challenging shooting conditions.The reverse Galilean optical finder with a 0.5x magnification features all-glass elements made from high-refractive index glass and demonstrates low chromatic aberration and distortion.In optical viewfinder (OVF) mode, the brightness of both the \"bright frame\" and text data is automatically adjusted according to the brightness of scene area, ensuring that shooting information is always easily and clearly viewable.  Also, the displayed shooting data is constantly updated according to changes in shutter speed, exposure, sensitivity and other settings, so that the user's eye never has to leave the viewfinder.  In electronic viewfinder (EVF) mode, the photographer can preview the picture or playback the result with the \"through the sensor\" image review and high-resolution 1,440,000-dot quality.  With a flick of the one-touch lever, the user can switch to EVF to preview and confirm exposure settings, depth-of-field, and white balance--an especially useful capability when shooting macro shots and other scenes that are hard to confirm with only an optical viewfinder.Stunning retro designThe FinePix X100 features a beautiful, high-quality design inspired by the classic look and feel of traditional film cameras.  The top cover of the upper control deck and the bottom surface have been die-cast from magnesium alloy (semi-solid metal casting), contributing to a high-precision camera body.  All dials and rings are precision milled from metal.  The ergonomics of the design offer the perfect balance between compact convenience and user-friendly functionality.  Traditional 'manual' dials lets the user confirm the position of the settings without turning on the power.  The camera's controls have been carefully thought out to give the photographer simple and speedy access to aperture, shutter speed, exposure compensation, etc, allowing maximum creative expression with minimum hassle and enabling the user to view settings--even when the power of the camera is turned off.  Custom modes can also be accessed with a one-touch settings change.  The chassis has been finished with high-quality leather-like accents and is both a delight to use and a pleasure to hold.RAW quality for image enhancement functionsCapturing the scene in RAW format is easy with just a press of the readily accessible RAW Button on the back of the camera.  Photographers can use the built-in RAW Development function to process the RAW data in-camera using the camera's image quality settings.  In addition to Fujifilm's original Film Simulation Modes that give photos the distinctive look of Velvia, PROVIA and ASTIA color reversal film emulsions, X100 expands the scope of photo expression with Monochrome Mode that can be fine-tuned with R/Ye/G filter settings.  Separate adjustment of shadow tones and highlight tones lets users reproduce the rich tonality of high-contrast subjects.Additional FeaturesEVF/OVF Focus Area:  The FinePix X100 offers users the choice between the 49-point auto EVF focus area or the 25-point OVF auto focus area as well as the selection of 5 different focus area sizes in EVF mode.  Depending on the needs of each scene, the FinePix X100 offers easy focusing by design.HD Movie mode:  Lets users capture the action in 720p high-definition detail.  Just like taking still photos, users can capture movies with aperture-priority AE and enjoy a soft, defocused background effect. In addition, the built-in HDMI Mini connector allows users to easily and directly connect the FinePix X100 to high-definition TVs for showing stills and movies with plug-and-play ease.Motion Panorama:  With the built-in Motion Panorama function, it is easy to capture 180&deg; and 120&deg; panoramic photos.  Later users can print the results as pin-sharp A3-size (11.7\" X 16.5\") enlargements and share the enjoyment of high-quality panoramic photography.Multi-Bracketing Functions:  The FinePix X100 has four types of bracketing functions: AE, ISO, Dynamic Range and Film Simulation.  One click of the shutter captures 3 bracketed images of the scene so the photographer knows he's captured the moment.    Star Quality--Premium Accessory Lineup"}