{"asin": "B000VRYLU2", "description": "Hewlett-Packard has used its considerable expertise as a computer manufacturer to introduce improvements into the iPAQ-310 that make the company's first dedicated GPS navigation device astand out from the crowd, but help raise the bar for portable GPS navigators in general.At 4.3 inches wide, 3.4 inches high, and 0.7 inches thick, the device is quite small and slim, but fits rich navigation and multimedia features, better than DVD screen resoulation, a unique true 3D display, and robust business support into that little package. HP touts this as \"different and unique for the travel connosieur,\" and it's innovative features certainly make a convincing argument to back up that claim.Unique, high-definitation navigation display&nbsp; with 3D models of buildings.It All Starts Under The HoodThe biggest difference in the iPAQ-310 is one you might not even notice, until you turn the iPAQ-310 on, that is. The iPAQ's processor is much more powerful than any portable device out there right now. It uses a SiRFtitan 600MHz dual core processor with 128Mb of onboard RAM, compared to the 400MHz SIRF III and 64Mb of RAM in other high-end portable GPS navigators. This means faster route calculations and re-routing. It also means more processing power for the graphics display, which leads us to one of the other things that makes the iPAQ-310 unique.An Immersive, High-Definition, Navigation ExperienceThe iPAQ-310's advanced 3D navigation system provides stunning visuals. For select cities, rather than the simple lines and color blocks you see on other navigators, you get actual 3-D models of buildings in space. Nothing else puts you in space and gives you a real feel for where you are and where you need to go than this device. Panning and zooming are smoother and faster. Plus, the 4.3-inch (diagonally) widescreen display has far better resolution than competitive models, 800 x 480 pixels compared to the current standard 420 x 272 pixels, which means all of those 3D maps are clear and detailed.Easy-to-use interfaceFull-Featured NavigationHP developed it's own user interface for the iPAQ-310 based on Windows Mobile 5.0. The interface is clear, intuitive, and easy to use. The device comes with text-to-speech capability, which allows it to offer directions with real street names, as well as Bluetooth for hands-free phone calling.It comes pre-loaded with complete TeleAtlas maps for the United States and Canada, and an astonishing 12 million points of interest.Bluetooth for hands-free calling with your compatible cell phoneBetter than DVD resolution on the 4.3-inch widescreenRich Multimedia FeaturesAt 800 x 480 pixels, the high-definition resolution on the iPAQ-310's screen is better than most dedicated portable video players. Coupled with an SD card, the iPAQ-310 functions as a true premium personal entertainment system with a video player, MP3 music player, photo viewer, and 5 pre-installed games from GameboxClassics.Integrated Web ServicesPlanning a business trip, a vacation, or even just a run of daily errands can sometimes require access to more data than a portable or mobile device can feasibly handle. Hewlett-Packard's answer for this is a website, www.ipaq.com that allows you to download map updates, load custom points of interest, travel reviews, reservation information, and more into your iPAQ-310. You can even synch up with your Microsoft Outlook address book to create custom points of interest based on personal or corporate contact information. You can upload and share your travel plans for others to use and customize, or find trip plans online to help you explore along the way or at your destination.SpecificationsOperating system:Windows&reg; CE 5.0Processor: SiRF Titan 600MHz ARM11 Dual-Core processorMemory: 128 MB SDRAMFlash memory: 2 GB ROMAudio: Large speaker for navigation volume, integrated microphone with echo cancellation, 3.5mm 3-pin stereo headphone jackPorts: 1 mini USB, 1 headphone/line-out, 1 microphone in, 1 GPS antennaSlots: 1 microSDDisplay: 4.3-inch Transflective color TFT with antiglare 800 x 480 pixel touch screen with LED backlightInput devices: touch screen, stylusWireless: Bluetooth 2.0 with EDRGPS: Advanced SiRF embedded GPS receiver with InstantFix time-to-first-fix accelerationSoftware installed: HP navigation software with text to speech guidance and web based trip planning, digital video player, digital music player, picture viewer, games, Bluetooth hands free, calculator, world clock, contacts with Outlook syncDimensions: 4.3 inches w x 0.7 inches d x 3.4 inches h (110.20 x 18.20 x 86.80 mm)Weight: 6.6 oz (187 g)Battery: Removable/rechargeable 1700 mAh Lithium-ionPower supply: AC AdapterWarranty: One-year parts and labor in most regions; 90 days technical support for software in most regions. Additional offers may vary by regionWhat's In The BoxiPAQ-310, car kit, car charger, AC charger, sync cable, slip caseAvailable Optional AccessoriesExternalGPS Antenna (FB058AA#AC3): Enhances GPS reception inside vehicles.Comes with a five meter cable with low profile, non-sliding puck.Traffic Channel Car Charger (FB055AA#AC3): Adds real-time traffic and travel information capabilities to your iPAQ GPS. Integrated traffic data on GPS navigation software provides alternate routing options for traffic jams, road construction, and accidents.Sport Case (FB005AA#AC3): Sport-inspired construction with form-fitting design offers protection from scratches and knocks when on the go. Comes with detachable carabiner clip to easily attach your iPAQ to a backpack or bag. Offers slots to store memory cards.Screen Protector (FB007AA#AC3): Protects your iPAQ screen from scratches. Antiglare coating allows use in bright sunlight. Includes handy cleaning cloth.Bluetooth Stereo Headphones (FA303AA#AC3): Listen to your music from up to 30 feet away from the iPAQ.", "title": "Hewlett-Packard iPAQ 310 Bluetooth 4.3-Inch Widescreen Portable GPS Navigator", "price": 19.12, "imUrl": "http://ecx.images-amazon.com/images/I/51E9CKw7TqL._SY300_.jpg", "related": {"also_viewed": ["B007PPYXOC", "B000VU0CQG", "B000WR0CKE", "B00AXX0IC4", "B00AXZWG8Q", "B005DIBHA6", "B005DIBHCE", "B00AXX0IEC", "B00AXX0I88", "B0057OCDQS"], "buy_after_viewing": ["B002PU7N12"]}, "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]]}