{"asin": "B0000488VP", "description": "If you think it's hard to flag down a cab in a big city, try driving one in Sega's zany straight-from-the-arcade port ofCrazy Taxi. If you're one of the teeming fans who eagerly playedCrazy  Taxiin the arcade at a buck a pop, then this game is a must-buy, if only from a purely economic  standpoint. Even those who don't know the difference betweenCrazy Taxiand the long-running  TV seriesTaxiwill immediately recognize the appeal of this game. In fact, this game is so  impressive and addictive that it should easily convince a whole new wave of buyers to purchase a Sega  Dreamcast.What's so hot aboutCrazy Taxi? For starters, the graphics sport the most impressive re-creation of  a living city ever seen in a video game. The level of detail is astounding and never ceases to surprise the  player as block after unique block speeds by. The city is a distilled version of San Francisco with some  landmarks and neighborhoods left intact. Making it seem all the more real are apparent product placements  of real-world retail locations such as KFC, Tower Records, and Pizza Hut. And just about everything you  see on the screen is interactive: boxes, phone booths, and mailboxes topple when bumped or smashed,  pedestrians leap and tumble out of your path, and the myriad of traffic attempts to avoid your erratic  high-speed antics. While some driving games brag about a lack of boundaries, this one delivers--players  drive on the ocean floor, off the second floor of a parking garage, through parks, and down stairs. A helpful  hovering arrow points drivers in the correct direction, but you can truly drive wherever you want at any  time, making for tons of replay value.While the game is a direct port from the arcade game of the same name, there's plenty more depth in the  home version. In addition to the city that appears in the coin-op version, the Dreamcast version also  includes an entirely new city.Crazy Taxiincludes a trunk-load of mini-games that help to teach  drivers how to perform the special speed boosts and maneuvers in the game.Though this game would be plenty exciting without any sounds at all, it has an adrenaline-pumping  soundtrack supplied by punk crossover bands the Offspring and Bad Religion, as well as some good, if  sometimes monotonous, dialogue between the driver and the passengers.--Jeff YoungPros:Wonderful, realistic graphicsEasy to get into, and full of many long hours of addictive playEven more to offer than the fantastic arcade game upon which this is basedCons:On very few occasions players will encounter some graphic slowdown", "price": 87.99, "imUrl": "http://ecx.images-amazon.com/images/I/616vR966aKL._SX300_.jpg", "related": {"also_bought": ["B00000K3X9", "B00000K2R4", "B000IVF2VS", "B00004SA3J", "B00000K125", "B00004S99S", "B00000K2R6", "B00004S99R", "B002GC5YMY", "B000028U2E", "B00000K10U", "B00000K4BU", "B000059Z7G", "B000059Z7H", "B00004S99N", "B00004R8V4", "B00004T4XJ", "B00005A775", "B00004SR5M", "B00004KHAE", "B00004SWL9", "B00000K10O", "B00004TEXF", "B00000K11O", "B001QVDSRO", "B00000K13K", "B00005LOYC", "B00000K2R5", "B0000488VO", "B00002EQAP", "B00004UDVL", "B000034DLH", "B00000K117", "B00004T4XM", "B00004KHAG", "B00001P4Y6", "B00004R9FG", "B00HPU96FI", "B00004WLVV", "B00005ME69", "B00004T4XI", "B00004T4XO", "B000VZICX6", "B00004SA3U", "B000058513", "B000028U2F", "B00004TEQD", "B00000K4BX", "B00000K4C7", "B00004S99M", "B00002971H", "B00004YMZV", "B00004UFFV", "B00004T4XK", "B000A7I7M6", "B00005AYE6", "B00000K2R7", "B00004SA3R", "B00001ZWUQ", "B00001P4Y9", "B00005ME7V", "B000056Q1E", "B000035YBP", "B00000K3XB", "B00004SR5H", "B00000K115", "B00002970R", "B00004R9FI", "B00005CDR8", "B00004SR5N", "B000028U2D", "B0002J1NWS", "B000059Z7X", "B000SL4IIG", "B00005ME6A", "B00004WMVK", "B00001ZT50", "B00004RC1Y", "B00005LIPF", "B00004UFFP", "B00004YMZY", "B000035XR9", "B00002SV0U", "B00000K4C9", "B00004TTTU", "B00004SA3K", "B00KVRK39A", "B00004RBOV", "B00004KHDM", "B000SP1WLI", "B00KWF803C", "B00000K11D", "B00000TBQQ", "B00000F1GM", "B00008H2IS", "B00000K4CC", "B002FY0CM0", "B0007MZWQS"], "bought_together": ["B00004SA3J"], "buy_after_viewing": ["B00000K2R4", "B00004SA3J", "B002GC5YMY", "B00004T4XJ"]}, "salesRank": {"Video Games": 7748}, "categories": [["Video Games", "More Systems", "Sega Dreamcast", "Games"]]}