{"asin": "B00067TTY0", "description": "The Zen Micro digital music player from Creative Labs packs an incredible 5 GB of storage capacity into a shell small enough to sit comfortably in your jeans pocket. It also rides nicely in your hand, with a palm-fitting profile and thumb-friendly front-panel controls. It's a bit shorter than an Apple iPod Mini, yet its rechargeable lithium-ion battery provides 12 hours of continuous playback--50 percent more than iPod Mini's. The Zen Micro is compatible not merely with MP3s and WAV files, but with WMA as well. Toss in USB 2.0 connectivity and you're looking at one spiffy portable music player.But playing isn't all the Zen Micro does. You can use it to receive FM radio (with 32 station presets to keep your favorites at the ready), and to record, either from the radio or from live sources such as voice dictation or lectures using the Zen Micro's built-in condenser microphone.Trimmed in a luminescent blue glow and with easily visible backlit buttons, this stylish silver player holds up to 1,250 songs (83 hours) at 128 kbps or 2,500 songs (166 hours) at lower-fidelity 64 kbps (MP3/WMA)--that's a solid week's worth of music listening, never playing the same song twice. Compatibility with Microsoft's WMA compressed-audio format grants access to over 2 million downloadable songs offered promotionally or for sale online.Perhaps the Zen Micro's coolest attribute is its DJ feature, which will shuffle not only all the songs you've loaded or all the songs in a given album, but, at your discretion, only the tracks you listen to most, or only those you rarely hear, taking the work out of selecting your favorites or hunting out all the music you're still getting to know.Zen Micro's rechargeable battery is easy to replace.For navigation, the device features a vertical, linear touchpad designed to make searching through songs or playlists easy, quick, and fun. The unit's blue, 160 x 104-pixel, electroluminescent LCD shows key functions and song details at a glance, and you can even customize the main menu to keep right at your fingertips the features that matter most to you.Another of the Zen Micro's handy features is its personal organizer. You'll never forget an important anniversary with the onboard calendar, and it also includes a to-do list and a contacts list, all of which sync seamlessly with Microsoft Outlook (Outlook thus required for use of these features). In addition, the device offers a sleep timer and alarm so you can drift off to sleep to the strains of one playlist and wake to a completely different one.The Zen Micro's removable battery is easy to swap with another fully charged battery (additional batteries sold separately), extending your listening by a half-day per swap.What's in the BoxThe Zen Micro player, stereo earbud headphones, a rechargeable lithium-ion battery, a USB 2.0 cable, an installation CD, a quick- start guide, and Creative MediaSource software.", "title": "Creative Zen Micro 5 GB MP3 Player Silver", "price": 6.99, "imUrl": "http://ecx.images-amazon.com/images/I/41D0JFBT80L._SY300_.jpg", "related": {"also_viewed": ["B002MAPT7U", "B002MAPS6W", "B000CS7U1C", "B0035ZU4G2", "B0076HNNHM", "B009RQW3BC", "B005FVNGRS", "B004M8SSTG", "B007B5TOZY", "B0035PBHRM", "B005FVNGZK", "B00BG13P9K", "B00ECQUY2M", "B002MAPSC6", "B005FVNH04", "B00400TGEC", "B00ECRRWTE", "B00ECRPOKS", "B002MAPRYU", "B001F7AHOG"], "buy_after_viewing": ["B000E40H9G", "B002MAPT7U", "B002MAPS6W", "B001HLFAD8"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}