{"asin": "B0027VT6OG", "description": "Ultra-Small Storage with Huge Personality Lexar offers a comprehensive line of high-performance USB flash drive products designed with a wide variety of features, capacities, and capabilities. With so many options, it's easy to find the perfect Lexar JumpDrive product to fit your needs and lifestyle.  Lexar JumpDrive FireFly is an ultra-portable USB flash drive that provides a convenient solution for storing, transferring, and sharing multimedia and more. It's ideal for storing lots of great pictures, your favorite music, and important files.   The hi-speed USB JumpDrive FireFly has a simple plug-and-play design that allows you to quickly and easily transfer and store digital documents, photos, MP3 files, and video clips. So wherever you go, your information goes with you. The JumpDrive FireFly also has a protective cap for security and a cool blue tail light LED that blinks during data transfer so you have confidence in knowing when the job is done. JumpDrive FireFly also works across platforms, giving you complete flexibility and ease of use.  Includes Valuable Trial Software. Transform your JumpDrive FireFly into your personal PC on the go! The drive comes pre-loaded with a free 30-day trial of Dmailer V7 software, which enables you to easily backup and synchronize all of your files, including Microsoft Outlook and Outlook Express.* And with 128-bit AES encryption, you can work with files and search the web securely, knowing no trace of your session will be left behind. Created to meet your specific needs, JumpDrive FireFly comes in four stylish colors for its four varying capacities-up to 16GB of storage. It comes with a key chain hole so it can be easily tethered onto a key ring, attached to a backpack, or hooked to a purse or briefcase. *Dmailer software is only compatible with Windows 2000, XP, and Vista.", "title": "Lexar JumpDrive FireFly 2 GB USB 2.0 Flash Drive LJDFF2GBASBNA (Black)", "price": 5.99, "imUrl": "http://ecx.images-amazon.com/images/I/41U%2BRjof7AL._SX300_.jpg", "related": {"also_viewed": ["B003O2S080", "B0021AFWL4", "B005FYNSPK", "B00EAMO29Y", "B00D4I0CBM", "B0021AG0QK", "B0021AG2AE", "B00542UYFA", "B00B6OX4SO", "B005IW0APU", "B00E7MJIMI", "B00FOLLANQ", "B007B6YPNY", "B00A361FBY", "B007B6YPNO", "B00A361FBE", "B007B6YPN4", "B002RL8UWU", "B0021AFXMC", "B00A361IMA", "B007JR531I", "B002LVUN6M", "B009CMN3W4", "B00HQWLHKC", "B00JM6X4II", "B005FYNSUA", "B007B6YPAW", "B000FD25P0", "B00CF6XRY8", "B00FWQMKA0", "B002U24S6S", "B005I6JMI2", "B004TS1J18", "B00FOLLAFO", "B000G27E3I", "B003O2S08K", "B00DYQYITG", "B008R6OPJQ", "B002Z58GQI", "B00DYQYJ3Q", "B005FYNSZA", "B00A361IL6", "B001N0RJQO", "B00B6OX4QQ", "B00C3TOR00", "B00FJRS6QY", "B00A361F9G", "B007V9SNNY", "B00A361IK2", "B00B7JLZSE", "B008FQ6GU4", "B002Z5FM74", "B004LFNCSW", "B00BXHJOD8"], "buy_after_viewing": ["B005FYNSUA", "B00DYQYITG", "B004TS1J18", "B005FYNSZA"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "USB Flash Drives"]]}