{"asin": "B00352LSYW", "description": "Keep all your digital files in one place with the LaCie Network Space 2. This portable external hard drive lets you access your photos, music, and videos from any computer in your home, and it also lets you back up multiple computers to ensure your files are safe. For easy setup, this network attached storage device comes with the LaCie Network Assistant, so you'll be ready to go in no time.Network Space 2At a Glance:1 TB of networked storageiTunes Server and media streaming to computers and UPnP/DLNA compliant devicesDownload torrents without a computerRemotely access your files from anywhereSleek, stylish design by Neil PoultonThe sleek design by Neil Poulton blends stylishly with your home decor.View larger.The Gigabit Ethernet offers outstanding access speeds.View larger.1 TB of Fast Storage for All Your Networked ComputersWith the LaCie Network Space 2, you'll have 1 TB of centralized storage that can be accessed by all of your networked computers. Simply connect the Network Space 2 through the Gigabit Ethernet port to a router or computer, and you can then share and store all your files from anywhere in your network at speeds up to 65 MB/sec. You can also connect the Network Space 2 directly to a computer using USB 2.0.The Network Space 2 is also available in a2 GB capacity.Access Your Files from AnywhereIn addition to providing a networked connection to all of your home computers, the Network Space 2 features Remote Access, which allows you to log in to your Network Space 2 from anywhere you have an Internet connection. Next time you're on the road and you need that important document, simply log in to your Network Space 2 and grab what you need, even if you're halfway round the world.Secure Backup for PCs and MacsOne of the most practical features of the Network Space 2 is that it can be used to easily back up your computers. For Mac users, the Network Space 2 offers the convenience of Time Machine compatibility. And for both Mac and PC owners, the Network Space 2 comes with built-in private and public shares, so you can create secure accounts and custom permissions for your users and guests.USB 2.0 Port for Added FunctionalityFor additional functionality, the Network Space 2 includes a USB 2.0 port that allows you to connect an external hard disk or a printer. You can also connect a digital camera, USB flash drive, or USB hard drive and directly import photos to the Network Space 2 without powering on your computer.Stream Music and VideoThe Network Space 2 acts as an iTunes server, which means computers with iTunes can stream music directly from the networked drive. The Networks Space 2 can also stream music and video to any connected computers, as well as to a networked UPnP/DLNA-certified player or adapter, such as a Playstation3 or Xbox.Download Torrents Without a ComputerThe Network Space 2 can automatically download torrents without the need for a computer, so you can leave your computer off to save energy costs.Easy to Set Up, Configure, and UseLaCie designed this portable external hard drive to be easy to set up and easy to use. Getting started is simple thanks to the LaCie Network Assistant, which will have your Network Space 2 up and running right out of the box.For further convenience, the web-based user interface makes it easy to access all the information you need. The user-friendly dashboard lets you easily configure and administer your Network Space 2, and it includes customizable widgets to match your needs. You'll be able to easily manage user accounts, access network and drive information, monitor drive capacity, customize power management, download torrents, manage the USB port, and more.Stylish Design by Neil PoultonThe sleek and stylish Network Space 2 features an all-black, mirror-polished finish and a blue LED strip on the underside that creates an ambient glow. This sophisticated look by renowned designer Neil Poulton blends perfectly with computer workstations and home entertainment setups.The drive is fanless for quiet operation and efficient power usage. Stylish without being obtrusive, it measures 4.6 x 7.6 x 1.8 inches (W x H x D).System RequirementsThe Network Space 2 requires the latest version of Windows XP (SP2 or SP3), Windows Vista, Windows 7, or Mac OS X 10.5 or 10.6. It also requires a router when using an Ethernet connection and UPnP/DLNA-compliant device when streaming media.About LaCieEstablished in France in 1989, LaCie is a leading manufacturer of computer peripherals for Windows, Apple, and Linux users. With offices and plants in the USA, Canada, Japan, Australia, Europe, Singapore, and Hong Kong, LaCie develops and manufactures external storage solutions and color monitors that help professionals and everyday people easily manage their digital lives. LaCie has distinguished its products with original designs and leading-edge technology.The LaCie Network Space 2 is backed by a two-year warranty.What's in the BoxLaCie Network Space 2, Ethernet cable, USB cable, external power supply, utilities CD-ROM with LaCie Network Assistant, and quick-install guide.The user-friendly dashboard gives you access to widgets and lets you manage and download torrents.View full screenshot.", "title": "LaCie Network Space 2 1TB Ethernet Network Attached Storage Desktop Hard Drive 301515KUA", "price": 139.99, "imUrl": "http://ecx.images-amazon.com/images/I/314g42VGNyL._SX300_.jpg", "related": {"also_viewed": ["B00A3U7KDC", "B0038CRQQS", "B00439GMJ2", "B0010YWPZ8", "B00429N16A", "B005PVXH18", "B00EVVGAFI", "B0047FL85U", "B007ZM88MS", "B00A3U8D7O", "B00ARB5FPM", "B003GQGYBY", "B005PVXI0S", "B00EVVGAC6", "B001OC5J9U", "B00ARB5FLQ", "B00365MF5E", "B00ARB5FNE", "B005PVXH2W", "B008IFXRPY", "B00EVVGAD0", "B00AK9ZT98", "B00CO0DIHQ", "B004UBU3SY", "B003IT6YFU", "B00B5Q7AC4", "B0080GPMD6", "B0040NPGP2", "B003STVG80", "B00DW1UNS8", "B00AJJIUKO", "B00DR7ENQA", "B0012GTJXU", "B003NVMG6Y", "B003O85BSQ", "B005YW7OLM", "B0037NYKW6", "B002XVBAKI", "B00D02ASI4", "B007JLDTRY", "B007A1FYBW", "B005XDGJB8", "B005TJLU24", "B00IRUZLSQ", "B006I5MKZY", "B0042KFLJE", "B005EVHH1K", "B00B5Q7ACE", "B00GJYNLKM", "B0058VIXBY", "B007KWLXRK", "B001L1I7C0", "B00B4OCYSM", "B00HRKAYVG"], "buy_after_viewing": ["B00A3U7KDC", "B0042KFLJE", "B00ARB5FPM", "B0038CRQQS"]}, "categories": [["Electronics", "Computers & Accessories", "Data Storage", "Network Attached Storage"]]}