{"asin": "B002WC8PK6", "categories": [["Electronics", "Camera & Photo", "Underwater Photography", "Cameras"]], "description": "The Casio Exilim EX-G1 shock-resistant, waterproof, dustproof digital camera is the first in the company's new Exilim G brand of digital cameras. With its smart design featuring functional beauty, the EX-G1 embodies Casio's endurance-minded features and specifications in a sleek 0.78-inch low-profile camera.The EX-G1 is designed with shock-resistant elements throughout the camera, both inside and out, creating a smart look in a slim-line camera with functional beauty. In addition to capturing high-resolution 12.1 effective megapixel images, the EX-G1 also features modes such as interval shooting and multi-image capture which utilize the camera's endurance qualities. The interval shooting function can automatically take still photos or movies at fixed intervals, enabling users to capture great shots while engaged in active sports such as snowboarding or cycling.Through rigorous testing, the EX-G1 has been designed and created with a shock-resistant shell which passes drop tests including multiple falls from seven feet.  Featuring a two-layer construction with a stainless steel outer-casing, the EX-G1 inner body withstands shock and water damage. The camera's intelligent design is constructed with a resin cover to protect the body side near the shutter and a resin lens ring to protect the lens.The technologically-advanced design features waterproof performance and corresponds to IEC/JIS Protection Class 8 (IPX8) and Protection Class 6 (IPX6) equivalent waterproofing. The EX-G1 can be used at depths up to nine feet for 60 continuous minutes. Water will not penetrate the camera even when directly sprayed with jets of water from every direction. Capable of withstanding temperatures as low as 14 degrees F, Casio's EX-G1 boldly captures images where any adventurer goes.Casio Exilim G1 HighlightsSlim-line Design with Toughness ConstructionShock ResistanceThe Exilim EX-G1 offers the world's thinnest profile of .78 inch (excluding protruding parts) in a shock-resistant digital camera. The camera passed multiple drop tests of seven feet based on Casio's own standard.Waterproof/DustproofThe EX-G1 offers waterproof and dustproof performance corresponding with IEC/JIS Protection Class 6 (IPX6) equivalency, and can be used for 60 continuous minutes at a water depth of three meters. It also withstands water jets based on IEC/JIS Protection Class 8 \"IPX8,\" and can be directly rinsed under running water.FreezeproofWithstanding ever the coldest of temperatures, the EX-G1 endures through temperatures as low as 14 degrees F.Shock resistant/waterproof construction and designExteriorThe outer body of the EX-G1 is made from stainless steel to withstand external shocks while a polycarbonate cover absorbs shocks to the body side near the shutter. The camera's wrist-strap holder is made of die-cast zinc to withstand drops while a rotating lock secures the external memory slot cover. For additional protection, the EX-G1 comes with two types of detachable protectors to absorb shocks.The EX-G1 is built to deliver stunning photos in even the most extreme conditions.Internal constructionThe waterproof inner body of the camera is made from polycarbonate reinforced with fiberglass while a buckle-lock construction is added to absorb impact, using fewer screws to secure the inner body. Additionally, the camera's frame comes equipped with speaker and microphone filters to prevent water from penetrating the camera.LensTo prevent damage to the camera's lens, a resin ring as been added around the glass casing to ease shocks to the lens area. With the addition of a reinforced, glass lens cover, the EX-G1 is tooled with a multi coating that is water-repellent and prevents light reflection from ruining pictures. To further protect the camera from impact, high-performance damping material has been added to protect the lens unit from external shocks.LCD panelThe acrylic plate to protect the LCD from water pressure and shocks is 1.5 times thicker than conventional point-and-shoot cameras. The LCD panel features a resin mount to ease shocks to the LCD panel area.BEST SHOT functions befitting a waterproof, shock-resistant cameraInterval shootingThe interval shooting function allows users to automatically take still photos or movies at fixed intervals while engaged in action sports such as cycling, snowboarding, and wind surfing. With the EX-G1, users can take powerful photos from inside the action, the kind which are usually almost impossible to capture. The shooting interval can be set at 10 seconds, 30 seconds, 1 minute, or 3 minutes, and the capture time for movies may be set at 3, 10, 20, or 30 minutes.Great for a variety of outdoor photography scenesThe BEST SHOT function enables users to take beautiful photos just by selecting the desired subject scene. The EX-G1 includes additional BEST SHOT settings suitable for various outdoor situations, such as \"snow\" and \"beach\" scene settings, which automatically adjust to prevent subject underexposure due to the brightness of snow or sun. There is also an \"underwater\" setting to control the tendency of underwater photos to come out looking too blue.12.1 effective megapixelsThis thin stylish model features a large 2.5-inch monitor with 230,400 dots of high resolution and a non-extending 3X zoom lens ranging from 38-114mm (35 mm film camera equivalent).Intelligent AFWhen the camera is pointed at a desired shot, the Intelligent AF function automatically detects the photo subject even if it is not a human face and determines the focus and exposure area accordingly.Advanced Dynamic Photo functionCasio's original Dynamic Photo function, which creates composite moving images using the camera's own high-speed image processing technology, now does even more.  When a moving subject is cut out of a number of images and combined with a different still shot that forms the background, the size of the subject can be changed to suit the background image.  Additionally, the Dynamic Photo video can easily be converted in-camera into a motion JPEG movie file.  Moving graphics such as hearts and bouquets of flowers are included so that users can have fun decorating their still images using the Dynamic Photo function.  Casio not only allows users to have fun taking and viewing photos, but also provides innovative new ways for them to create original images, right on the camera.Wide Screen MoviesThe camera also features a wide format (16:9) Movie function.  Just press the dedicated Movie button to take beautiful movies at 848x480 pixels.What's in the BoxExilim EX-G1 digital cameraRechargeable lithium ion batterylithium ion battery chargerAC power cordUSB cableAV cable, strapCD-ROM", "title": "Casio Exilim EX-G1 12.1 MP Slim-line Endurance Digital Camera with 3x Optical Zoom (Black)", "price": 295.0, "salesRank": {"Camera &amp; Photo": 8881}, "imUrl": "http://ecx.images-amazon.com/images/I/412Ovu2M1vL._SX300_.jpg", "related": {"also_viewed": ["B00AQDGATQ", "B0030TLL0G", "B0030THPTM", "B002LITT3S", "B002LITT42", "B00AQDG9CO", "B00AQDGAO6", "B002LITT3I", "B00BQX5M7Q", "B002LITT56", "B00AQ2BVTQ", "B001RXYFQY", "B00ATM1M9W", "B00BQX5M9Y", "B00BEHQLP6", "B001QFZM4W", "B00ATM1NBO", "B001P06Q66", "B00BQX5MDA", "B0075SUKIC", "B001QENO7A", "B00ATM1MF6", "B00ATE7TQA", "B004SB1X58", "B00ATE7UFU", "B0073HSJGU", "B0094AYU3A", "B005IGVY92", "B006K552Q6", "B005IGVY6K", "B004SB1X80", "B00HPQ0DDQ", "B00ATE7UUK", "B00AQ2BWP4", "B00IZDKTMI", "B00ATE7TYC", "B001PKEJZQ", "B00ATE7U64", "B00ATM1M92", "B00728ZC4C", "B006K552LG", "B00BW3ZR48", "B004LV44PQ", "B0078KP0SM", "B00B7D8GQO", "B0034JW17E", "B0073HSJLA", "B004SB1X44", "B0032ANBXI", "B00B7D85JC"], "buy_after_viewing": ["B001RXYFQY", "B0024CM45Q", "B0075SUKIC", "B009QZH7BU"]}}