{"asin": "B000EF3D64", "categories": [["Electronics", "Computers & Accessories", "Computer Components", "Internal Sound Cards"]], "description": "Upgrade from Basic Motherboard Audio to Outstanding Music, Movie and Game SoundEnjoy an audio experience that's just not possible with basic motherboard audio. Sound Blaster Audigy SE features high-quality audio that dramatically improves MP3 music listening, support for EAX ADVANCED HD 3.0 effects that make PC games come alive and multichannel 5.1 or 7.1 sound for immersive surround sound in music, movies and games. When it comes to PC Audio nothing compares to Sound Blaster!MusicDramatically improve your MP3 music listening experience with crisp, clear 24-bit ADVANCED HD audio quality.Bring out the best in your music with Bass Boost, Smart Volume Management, Audio Clean-Up, and more!Listen to your favorite MP3 music in breathtaking 7.1 surround with CMSS surround technology.GamesFeel like you're actually in the game with realistic EAX ADVANCED HD 3.0 sound effects.Hear your enemies before they find you with 3D positional audio over multichannel speakers.MoviesEnjoy your blockbuster movies in surround sound with support for everything from headphones to multichannel 5.1 or 7.1 speakers.", "title": "Creative Labs SB0570 PCI Sound Blaster Audigy SE Sound Card", "price": 33.35, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/5100ZAB17GL._SX300_.jpg", "related": {"also_bought": ["B00778G78C", "B001D767GA", "B000LP0R3E", "B00EO6X4XG", "B000JFJZGG", "B000VMSZN6", "B0049MPQA4", "B0000TSJVI", "B00C537BQ6", "B000Q85WOK", "B0088PUEPK", "B005FUGPP4", "B00G57BN1M", "B000OGX5AM", "B003PJG8K4", "B001V9LQC0", "B000W7PNZI", "B003WLZNH4", "B000U90DD0", "B005WEYB0Y", "B00A1ZTZOG", "B003CFATNI", "B00C53831I", "B0033Z2BAQ", "B007EA48MA", "B001QMM6NU", "B003BQSNA4", "B00EOI2TD0", "B00C53H080", "B004Z9XG0I", "B00F3ZN2W0", "B0067I4Z6O", "B005WUUFBW", "B005T3GRN2", "B004N3BH0C", "B0025VKUPW", "B002YIG9AQ"], "bought_together": ["B0088PUEPK", "B0033Z2BAQ"], "buy_after_viewing": ["B000LP0R3E", "B0045JHJSS", "B00EO6X4XG", "B0006I09OS"]}}