{"asin": "B0018DKODQ", "description": "Keep on talking, keep on rocking--the rechargeable Kensington mini battery pack and charger for iPhone and iPod has the power you need to keep the conversations and music going.Keep on talking, keep on rocking.The power you need to keep the conversations and music going.Small and unobtrusive enough to keep connected to your iPhone or iPod while you're using it.Power and charge your iPhone or iPod on the go, and enjoy an extended playtime of up to 30 hours of music; 6 hours of video; or 3 hours of talk. The high-capacity, rechargeable lithium-ion polymer battery pack is small and unobtrusive enough to keep connected to your iPhone or iPod while you're using it.The LED battery meter lets you visualize how much juice you have left, and the included retractable USB charging cable makes powering up the battery pack a snap. Backed by Kensington's one-year warranty.What's in the BoxKensington mini battery extender and charger for iPhone and iPod (black) and USB charging cable.Learn More About Universal Power AdaptersUniversal power adapters are a convenient choice for households and businesses that have multiple brands of laptops/netbooks. More compact and portable than standard OEM bricks, Kensington universal power adapters can be shared between users of different laptop brands simply by exchanging the tips included in the packaging. Also, many of Kensington's universal power adapters offer additional functionality over standard OEM bricks by including a USB port to allow for charging peripheral devices (i.e., smartphone, MP3 player, personal gaming device) while also charging/powering your notebook.Kensington's universal power adapters are a popular replacement to lost or broken OEM adapters. But most often, users enjoy the convenience of having an additional universal power adapter to keep in their travel cases for use on the road.", "title": "Kensington Mini Battery Extender and Charger for iPod; iPhone 1G, 3G (Black)", "price": 16.13, "imUrl": "http://ecx.images-amazon.com/images/I/31WennmYnqL._SY300_.jpg", "related": {"also_viewed": ["B002OEBMZM", "B0035R2QS4", "B003XU5YSM", "B007B7O5TW", "B002OEBMZC", "B00AVS7A8G", "B0049TKVL6", "B00CTFG26A", "B00752TRP0", "B001BF12QO", "B005X1Y7I2", "B00D41CYWO", "B00EYGTB8I", "B00AS9WQVE", "B003XIBC1C", "B00BD390SG", "B0013G8PTS", "B005NF5NTK", "B008ZDM6TW", "B0089DZNS4", "B005OW4BFE", "B002BDU7U2", "B004JXVLRK", "B00HVORET8", "B00AANMVNQ", "B00HV899C4", "B002FU6KFM", "B000R1C42O", "B005K7192G", "B0030HQI10", "B00409E4JK", "B00GJYJFKM", "B0087S9AMG", "B00D5T3QK4", "B00J39QGZC", "B00AANQLRI", "B005WQRMWG", "B005F1YIVG", "B00IP1OTOY", "B00GH0JXAK", "B0085OB0IE", "B00HH7M87W", "B009USAJCC", "B00EET7UHE", "B00BN42G5Y", "B00FIIX394", "B00EF1OGOG", "B00HA6ACW8", "B00FDK2G2C", "B0099SG2WE", "B002FU6KF2", "B00H94DOTE", "B0099TV6WY", "B007WOKBRY", "B00AAP2U4Y", "B00DGJJNVO", "B00EETOTWS", "B003ZBZ64Q"], "buy_after_viewing": ["B002OEBMZM", "B0035R2QS4", "B005X1Y7I2", "B005NF5NTK"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Chargers", "Battery Packs"]]}