{"asin": "B000AOKTJ8", "description": "The Wireless-G MIMO Performance Router & Access Point with High Gain Antenna combines the High Power wireless performance with Buffalo&#x92;s AirStation One-Touch Secure System (AOSS). Uniquely equipped with a built-in signal amplifier, the WHR-HP-G54 produces a true 60% increase in wireless transmit power over a standard 802.11g wireless router. WHR-HP-G54 extends the range of standard 802.11g client devices by up to 70% and improves overall performance by up to 50%. This Smart Router automatically detects and configures your Cable or DSL internet connection. Security features include WPA, WEP, Privacy Separator, Intrusion Detector, and SPI firewall. In addition to fast wireless performance, WHR-HP-G54 features a built-in external switch between wireless router and wireless access point modes. The combination of speed, security, and push-button setup of wireless connections and internet, makes the Buffalo AirStation G54 High Power Wireless Cable/DSL Smart Router the perfect choice for your wireless network.FeaturesBuilt-in Amplifier Improves Wireless Performance and Extends Range802.11g Wireless 125 High- Speed Mode Transfer Rates When Used with 125 High-Speed Mode Adapter (Turbo G)Simple Web Browser ConfigurationSupports WDS To Increase Coverage With Optional RepeaterExternal Switch To Instantly Change Between Wireless Router and Wireless Access PointEasy Setup with AirStation One-Touch Secure System (AOSS)Automatic Channel Support Selects Best Available Wireless Networking ChannelSupports WPA-PSK (TKIP, AES) and 128/64-bit WEP SecurityIncludes NAT and SPI Firewall and Intrusion DetectorDynamic Packet FilteringBuilt-in DHCP ServerBuilt-in 10/100 4-Port Auto-Sensing SwitchOptimized High-Speed Routing, up to 5 Times Faster than Standard RoutersGreat Value. Higher Performance than Standard 802.11g at Comparable PricesRP-SMA to MC coupler required for use with the WLE-DA2, WLE-HG-NDR and WLE-MYG antennas. Coupler not included.Works seamlessly with Nintendo DS", "title": "Buffalo Technology Wireless-G High Power Router and Access Point with High Gain Antenna WHR-HP-G54", "price": 122.39, "imUrl": "http://ecx.images-amazon.com/images/I/31vkZr1mqYL._SY300_.jpg", "related": {"also_viewed": ["B0096239EC", "B005CSOE1G", "B0028ACYEK", "B000AODZQ2", "B00IB8IVDQ", "B0096239FG", "B003ZM17R0", "B004UAL5AU", "B00HK8V0YK", "B00II4QK2W", "B0096239G0", "B00D69747O", "B002WBV2T8", "B0084JFLSK", "B00DZJU6NY", "B00I2N6O0W", "B00DZJU6B6", "B000BTL0OA", "B0001D3K8A", "B001FO2VDO", "B000BNDEZY", "B00DJ6AGBU", "B005UBNH18", "B008WJ6ISY", "B0044GK9YI", "B0002F3G7M", "B004S3OKLK", "B00387G6R8", "B005UBNGY6", "B002WBV37Y", "B003CFATOC", "B005DCP280", "B000R3BTDC", "B005JTTWUG", "B002YLAUU8", "B000Z3XXR4", "B001FWYGJS", "B00I3HBF42", "B00BXBIXIQ", "B006QB1RPY", "B007B5PQBK", "B0068ALV8Q", "B00EK9N80Q", "B00C7NSIO8", "B005SSQHTM", "B003YHYIT0", "B00416M48A", "B001AZ01EO", "B00DWFPDNO", "B0087NZ31S", "B00B7N56XA", "B004T9RR7C", "B003CFATNS", "B005H4CDF4", "B004MDQQ04", "B000WG3ZU4"], "buy_after_viewing": ["B0096239G0", "B006QB1RPY", "B0096239EC", "B005CSOE1G"]}, "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Wireless Access Points"]]}