{"asin": "B003DX3O6I", "description": "With the innovative Eye-Fi 8GB Explore X2 SDHC wireless memory card, you get faster Wi-Fi transfer speeds for photo and video uploads from your camera to your computer  and an online site of your choice. The card's built-in, powerful wireless capability and Class 6 read and write speed provides effortless upload of your photos--even while traveling. And the Explore X2 automatically records the location of each photo, so you'll never forget where your pictures were taken. The Explore X2 works with most cameras on the market today, including Canons, Nikons, Casios, Sanyos, and more.OverviewThe Eye-Fi 8GB Explore X2 Features:Fastwireless transferof your photos and videos from your camera to computer or favorite online site over Wi-Fi.Photo and video sharingwhile traveling; one year of free hotspot access to thousands of locations in the U.S.8GB memory capacitycombined with next generation, Class 6 read and write speeds for faster performance.Photolocation automatically capturedon each image.Endless Memory Modeautomatically frees up space on your card after media is safely delivered to your computer.Streamlinedphoto organization.Quick andeasy set-up.Wireless Photo and Video Transfers from Your CameraWith the Explore X2, you get Class 6 read and write speed supercharged with 802.11n wireless transfers, so you can quickly and easily upload your latest images to your computer and favorite online site.Simply turn your camera on within range of your Wi-Fi network and your photos and videos are automatically transferred to your computer and favorite online sharing site such as Picasa, Flickr, or YouTube--there's over 25 sites to select from. And, by setting up a text message, email account or Twitter alert, you'll automatically receive a message when your images have uploaded.Hotspot Access for Photo Sharing While TravelingNow, you don't have to wait until you're home to share your images with friends and family. Simply upload your photos from a caf&#xE9;, hotel, or airport while you're on the road. The Explore X2 includes one year of free Hotspot access to keep you connected from over 10,000 Wi-Fi locations in the U.S. No cables, no hassles, no delays.Shoot and Store Loads of PhotosThe Explore X2 has a whopping 8GB of storage for all your media. It stores up to 4,000 photos or three hours of video.**[NOTE: 500 photos/GB based on a 7 megapixel camera with a file size of 1.9MB/photo. Video estimates are based on 5 Mbps rate. The actual number of photos and minutes will vary depending on camera model, resolution, compression, usable capacity, and other factors].Photo Location Captured on Each ImageThe Explore X2 can detect surrounding Wi-Fi networks and add location information to each picture. This means that each photo you shoot will contain the location of the shot, so you'll never forget where your pictures were taken. Just take the picture and after wirelessly uploading to your computer, the photo will be labeled with the place where it was taken. It's that easy.Endless MemoryThe Explore X2 can free-up space for you after pictures are safely delivered. You will never have to worry about running out of space.Photo Organization Made EasyTo help you stay organized, the Explore X2 gives you the option of uploading photos and videos to specific folders on your computer (PC & Mac), or even directly into iPhoto (Mac only). You'll save time and eliminate frustration by easily finding that great shot.Simple Set-upSet-up is simple and takes only a matter of minutes. Easy-to-follow instructions are provided with your Explore X2 card.RequirementsSDHC-compatible digital cameraComputer with Windows XP/Vista/Win7 or Mac OS X 10.4, 10.5, 10.6100MB of free spaceWi-Fi network compatible with 802.11 b/g/nBroadband Internet connectionWhat's in the BoxEye-Fi 8GB Explore X2 SDHC wireless memory card; Eye-Fi software; USB card reader; and Setup Guide.Comparison Chart&#xA0;MEMORY CAPACITY4 GB&#xA0;&#xA0;8 GB&#xA0;WIRELESS UPLOADSPhotos&#xA0;&&#xA0;VideosRAW&#xA0;&#xA0;COOL FEATURESOnline SharingGeotagging&#xA0;Hotspot Access&#xA0;Ad Hoc Transfers&#xA0;&#xA0;X2 ENGINESDHC Class 6Endless Memory Mode", "title": "Eye-Fi Explore X2 8 GB Class 6 SDHC Wireless Photo &amp; Memory Uploads EYE-FI-8EX", "price": 129.99, "imUrl": "http://ecx.images-amazon.com/images/I/514pvtGZ9oL._SY300_.jpg", "related": {"also_viewed": ["B002UT42UI", "B00CS4WPD6", "B003DV4234", "B004U5QR62", "B00A659ILQ", "B00FG8PPXI", "B00CS4WPHC", "B00A659IJI", "B00AKONZ3U", "B00DUTJ7JI", "B00CRFK4FC", "B00BN2AJOQ", "B000YZGCIU", "B00CRFK24K", "B00APQ9PVE", "B00G445M36", "B001U0O5QE", "B004JJU6I4", "B004Q3C98S", "B00AARIEVK", "B003JTHMQO", "B007NDL56U", "B0070WU51U", "B004XIB9T6", "B005BB65D4", "B007M54E1M", "B001DKO7R8", "B00720TE1M", "B00GEBTH80", "B00AHZ271I", "B00BKG6ETY", "B00EH5UQDA", "B007NDL56A", "B005OGR1R0", "B00D6Y0U8E", "B003VNKNF0", "B004M170YC", "B0053V5MF4", "B000V5K3FG", "B00FOTF8M2", "B00894YP00", "B00CH6ATMO", "B009D79VH4", "B009B0MYSQ", "B003VNKNEQ", "B0076AYNXM", "B00DMS0LCO", "B0040JHVCC"], "buy_after_viewing": ["B002UT42UI", "B00CS4WPD6", "B003DV4234", "B004U5QR62"]}, "categories": [["Electronics", "Camera & Photo", "Accessories", "Blank Video Media"]]}