{"asin": "B002TDIEEK", "description": "The next chapter in theStreet Fighterfranchise on Next Generation consoles,Super Street Fighter IVincorporates familiar game elements with all-new features. Featuring new game modes designed to enhance online play, re-imagining of classicStreet Fightercharacters as well as a few new faces&#151;one of these, Juri, utilizes the Tae Kwon Do fighting style&#151;and the return of classic bonus stages,Super Street Fighter IVis a fighting game experience not to be missed by longtime fans and players new to the franchise alike..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }TheStreet FighterAdventure ContinuesFollow up toStreet Fighter IV, one of Metacritic.com&rsquo;s highest-rated games of 2009,Super Street Fighter IVhits Next Generation gaming consoles in 2010 with a wide range of improvements, including 10 new characters, new fighting possibilities for everyone, new stages, the return of classic bonus rounds and beefed-up online modes (including the free Tournament Mode downloadable content (DLC) after launch) all for an affordable price on any gaming budget.Jump into a new Street Fighter adventure featuring game elements both familiar and new.View larger.All Your Favorite Characters and MoreSuper Street Fighter IVfeatures the full roster of 25 characters fromStreet Fighter IVsuch as Ryu, Ken, Crimson Viper, Abel, El Fuerte, and Rufus, while adding about eight new characters to the world ofStreet Fighter IV. This impressive new roster includes classic combatants from previousStreet Fightergames like T. Hawk, DeeJay, Guy, Cody and Adon, as well as all-new characters such as the mysterious and deadly female fighter, Juri. The addition of Juri also brings another first to theStreet Fighterfranchise as she is the first fighter in series history to utilize the legendary Tae Kwon Do fighting style. Beyond characters,Super Street Fighter IVadds an enhanced Ultra Combo system as well as major enhancements to the online and offline gameplay modes introduced inStreet Fighter IV.Key Game FeaturesEnhanced online play featuring new modes:Team Battles- Up to eight players can participate in 2 vs. 2, 3 vs. 3, or 4 vs. 4 team elimination battles.Endless Battle- Up to eight players can participate in an endless elimination online match where the winner stays on and plays against the next player in true arcade fashion. Spectators can also chat with each other as they watch the match.Replay Channel- Players can view recorded matches and discuss the match while watching replays of great matches from players around the world.More classicStreet Fightercharacters re-imagined for a new generation of gamers, including favorites DeeJay, T Hawk, Guy, Cody and Adon.Utilize the Tae Kwon Do style for the first time with the new challenger, the mysterious female fighter Juri.Bonus Stages: Return of the classic car and barrel bonus stages made popular inStreet Fighter IIboth available in arcade and challenge modes:Car Stage- Annihilate the car with regular and special moves before the time runs out.Barrel Stage- Players are given 20 barrels and must destroy as many as they can within the time limit.All playableStreet Fighter IVcharacters will be unlocked right out of the box.Gameplay has been rebalanced to provide challenges for both newcomers as well as the most seasonedStreet Fighterpro.Traditional \"2D\"Street Fightersix-button gameplay.Additional Screenshots:", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/61koxOhiocL._SY300_.jpg", "related": {"also_bought": ["B006ZTHFPS", "B000FII8KQ", "B0012N5MIO", "B003IEBO9Q", "B002I0K6Q8", "B000ZK7ZMQ", "B0017ZIIK6", "B006JKARN0", "B005C7R950", "B0012N94WO", "B002I0J5NI", "B007SRM5U6", "B003O6E1JS", "B004X56PWK", "B003O6KWZK", "B008CP6MA2", "B002MED6EO", "B0022TNO7I", "B000IONGWW", "B0015AARJI", "B007TYC8MI", "B0050SWSQQ", "B0045U01OG", "B006KYYOSO", "B0050SWZHS", "B0088I7L76", "B001G33V8S", "B002I0J82G", "B000HKP88C", "B0050SXLQC", "B001NX6GBK", "B000ZK9QCS", "B000TG72TM", "B003C1I06U", "B000FPOJOS", "B002I0K6DG", "B003L8DXOI", "B000FQ2D5E", "B002ZJNWWC", "B007YZ5QOO", "B007H45AZ2", "B00503E9FY", "B00D4AK17A", "B003O6ECOM", "B004UDB9SA", "B003IMGC9U", "B007XYBUBE", "B002I0K74Y", "B007M6W3A0", "B002I0H2G0", "B004FS8LYK", "B003R7H5TC", "B001SGZL2W", "B00269QLH4", "B002I0J8FI", "B008MO6AQO", "B0053OMTVQ", "B00488PZ2S", "B002NN7AKU", "B002I0K2EO", "B007MM9E2E", "B001JKTC9A", "B0050SX9VO", "B00BMFIXKQ", "B0029MAXR2", "B002BH3N2C", "B0053BSOD6", "B002I0J5FG", "B003O680ZY", "B00269DX5W", "B000HCMR8E", "B000P297EI", "B000WQ3838", "B0002B90OE", "B002BRZ7JE", "B004CVQUOI", "B001AZFSEW", "B004HYK8Y8", "B005VBVQDI", "B008E6ZXTA", "B005DVAB0A", "B00309XHD0", "B000F3AACA", "B008CP6RWU", "B004PAGJNS", "B0042GW7BI", "B002I0J6DC", "B004M8M30G", "B0050SX3KG", "B002I0F5M8", "B00198PO5I", "B0037LVW9M", "B002ELCV00", "B003O6CBIG", "B0050SXX88", "B0050SXVK8", "B003H0CBYS", "B000FQBF1M", "B00IA2NYT4", "B001IVPVVS"], "bought_together": ["B006ZTHFPS"], "buy_after_viewing": ["B002I0J5NI", "B0012N5MIO", "B006ZTHFPS", "B002I0K6Q8"]}, "salesRank": {"Video Games": 3019}, "categories": [["Video Games", "PlayStation 3", "Games"]]}