{"asin": "B004UQ05M8", "description": "iVisor for iPad 2 is an advanced screen protector specifically re-designed to protect your iPad 2's gorgeous touch screen from scratches. Unlike other screen protectors that require tedious installation procedures and often result in unwanted air bubbles or hindered touch screen performance, Moshi's proprietary design and patented technology allows the iVisor to be installed in seconds without any air bubbles, making it the easiest screen protector to install on the market today. Further, its special EZ-Glide top layer treatment effectively reduces finger glide friction on the iPad, taking the touch screen maneuverability experience to a higher level. iVisor AG also employs a second generation anti-reflective film where clarity is retained and speckling is minimized. If you are looking for an easy-to-install screen protector, with excellent clarity and anti-smudge properties, then iVisor AG is the perfect solution for you!Moshi, based in Sunnyvale, California, is a purveyor of electronics fashion. Moshi designers are meticulous in their materials selection and form factor design to enhance or preserve the value of high end personal electronic devices. Made with an eye for stylish functionality, Moshi products are designed to fit your lifestyle and not the other way around.", "title": "iVisor for iPad 2 - Black (99MO020908)", "price": 29.95, "imUrl": "http://ecx.images-amazon.com/images/I/41l57L92q-L._SY300_.jpg", "related": {"also_bought": ["B004CUQ2MY", "B004UQ05N2", "B0082CJ25M", "B009C9CG3E", "B00A0LVPM6", "B005AXNHKC", "B009C9BWRK", "B007IWZTN6", "B008P2TYTS", "B0056IKQCS", "B007IWZTWM", "B00GJ51OZA", "B009ES6ON6", "B005GGSKR8", "B0082CFCLA", "B00GJ6V0CG", "B009A6NUG6", "B004QIPH5U", "B00GJ6ITPC", "B00CKG61WI", "B0079UAT0A", "B0085Z9SZA", "B009ES6OV8", "B0098PQ5IE", "B007VLD2GA", "B0047DVWZS", "B00CLDWSQS", "B001J8HOEM", "B00ATM9T2O", "B009A15DU2", "B00ASPBXZS", "B004UQ03P2", "B004R7A9NU", "B0047DVWHQ", "B004N62HZI", "B0013FRNKG", "B0073FE1F0", "B007IV7KRU", "B004XIT4NO", "B004WQVTLC", "B005Y1CYSQ", "B004TLH7C0", "B0052EP1XK", "B00AHPSTRY", "B005B0SDNK", "B0060GEZ0E", "B0053NBLFW", "B0097BEFYA", "B0059KTEBC"], "buy_after_viewing": ["B0082CJ25M", "B007IWZTN6", "B00CKG61WI", "B004WYA852"]}, "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Screen Protectors"]]}