{"asin": "B000JHMJDU", "description": "The king of the virtual ring is back! Garnering high marks from gaming critics, EA SportsFight Night Round 3is now ready for the Playstation 3 entertainment system with new exclusive features.Game StorylineKnocking out the competition, EA SportsFight Night Round 3brings the most intense boxing experience to the virtual ring.Photo realistic graphics make for an amazing experience. You'll see the sweat on your competitors' bodies fly off as you hit them!View larger.Crushing blows can change the tide.View larger.Realistic opponents.View larger.Seeing stars yet?View larger.Multiplayer split-screen action.View larger.Featuring exclusive content including a comprehensive ESPN integration package, film quality graphics, and a new first person mode called Get-in-the-Ring, the Playstation 3 version continues to innovate on the hit franchise.GameplayGet-in-the-Ring mode allows you to experience the fight through the eyes of the boxer. This is the closest you will ever come to getting into the ring and trading blows with the greatest boxers of all time like Oscar De La Hoya, Muhammad Ali and many others. For most people, getting that close is, by far, close enough.For the first time ever, you will truly experience the sensation of the sport with visual and audio effects like ear ringing, restricted vision, flashes of bright light, color shifts, and blur effects that simulate the sense and feeling of getting punched. Imagine trying to recover from Ali's lighting fast jabs when you can barely make out his glove through a blinding barrage of flashes and blur.Key Game FeaturesGet in the Ring: Rely on your instincts in this PlayStation 3-exclusive game mode that allows you to fight through the eyes of your boxer from the moment he enters the ring.ESPN integration: ESPN raises the bar with this all-new level of integration only available on the PlayStation 3. Get the latest scores and news with ESPN Motion's streaming video content, live ticker updates, ESPN Radio and ESPNEWS.Split-screen multiplayer action: Punish your rival and go head to head against your friends in PlayStation 3-exclusive split-screen battles.Super punch: Clench down on that mouth guard, rookie! Players will feel the impact of a devastating punch as the boxer's face ripples from a super punch knockout.One punch can change a fight: Devastating impact punches keep you in the fight. Instantly trigger a Flash KO moment, Stun Punch, or EA Sports Haymaker to take control.Boxing's greatest rivalries: Watch recreations of ESPN Classic footage of bouts or re-create the greatest fights from past and present including Arturo Gatti vs. Mickey Ward, Marco Antonio Barrera vs. Eric Morales, and Ali vs. Frasier. Online gameplay: EA SportsFight Night Round 3features online play with PlayStation 3 online.", "price": 83.98, "imUrl": "http://ecx.images-amazon.com/images/I/51yhHjuhV7L._SY300_.jpg", "related": {"also_bought": ["B00198AZ98", "B001D7T2X0", "B004CVQUOI", "B0030CYE8O", "B003IMGC9U", "B000FPOJOS", "B00386VMWI", "B0025KZV7U", "B0053BSOD6", "B003O6E5OE", "B001UU1WN8", "B002I0J4FW", "B004DI5H26", "B003171CEW", "B003HFC22Y", "B0012N5MIO", "B001D7T2XK", "B007M6W3A0", "B002I0J8KS", "B00420K18K", "B0017ZIIK6", "B0012N94WO", "B000JLIYLC", "B002BS61JS", "B002ELCV00", "B003KZJA9Y", "B00004YROX", "B000FII8KQ", "B001CPBLLE", "B002C7RBFQ", "B001S86IRC", "B001C4DKG4", "B002W5GIAW", "B003JVCA9Q", "B000IONGWW", "B006ZTHFPS", "B0012N7BSI", "B00269QLH4", "B004Z4ZKL6", "B0048C7S5G", "B000MUW98O", "B00647615G", "B001AWDFUY", "B004WL4LP8", "B001QXNBNI", "B00160HY3E", "B000HKP88C", "B000IONGWM", "B001COV1CY", "B00075GLU6", "B002ZJNWWC", "B004P8CKS8", "B001O0EGLE", "B006JKARN0", "B000WJFZEA", "B002BCVFRM", "B001B1W3K2", "B000QB05AI", "B001AZ7RLY", "B0016B28WU", "B001AZFSEW", "B002I0K74Y", "B000ZK9QCS", "B000M4KJ32", "B000S1MMIO", "B003O6ECOM", "B002I0K9I8", "B00127PZCS", "B00269DX5W", "B00386PJRM", "B000ZK7ZMQ", "B001AWBYNE", "B000JHMJDA", "B002E1OXVU", "B002I0J58I", "B000FQBF1M", "B0037LVW9M", "B003R7H5TC", "B00IA2NYT4", "B002BSA1C6", "B00ARCWQPI", "B000HGOHWO", "B006VB2UNC", "B000N4MSAS", "B002I0JBL4", "B002TDIEEK", "B002I0HIMI", "B000QB05A8", "B00503E9FY", "B002DC8GM2", "B000TG72TM", "B005GM3XVA", "B002I0K8JI", "B0047ORROW", "B0006ZJP7S", "B001B0BB4W", "B000P0SETO", "B0010EI6T2", "B001VFYML6"], "bought_together": ["B00198AZ98", "B004CVQUOI"], "buy_after_viewing": ["B004CVQUOI", "B00198AZ98", "B006JKARN0", "B0053BSOD6"]}, "salesRank": {"Video Games": 7965}, "categories": [["Video Games", "PlayStation 3", "Games"]]}