{"asin": "B0007SM8OQ", "description": "Take your favorite tunes on the road or to the park with this portable CD boombox. Sporting a unique, rounded chassis with black highlights that's way more fashionable than standard boxy models, the CX-CD241 is an ideal choice for music fans who want a little extra style with their sounds. Fortunately for listeners, the cool shape doesn't detract from the music, as the CD player still includes all the basics and a few extras. Among the features are standard skip, search, and repeat one and all functions, along with programmable track memory for listeners who want to create a custom soundtrack. When the CDs are played out, listeners can turn to the AM/FM tuner for a less-structured playlist.The CX-CD241 owes its audio performance to its 1-bit digital-to-analog converter, which ensures a clean CD sound, and its pair of wide-ranging side speakers. Rounding out the feature set is a digital two-digit LED display, a telescoping FM antenna, and a flip-up carrying handle. The unit runs on either AC power or six C-size batteries (not included) and measures a compact 8.25 by 5.5 by 8.5 inches (W x H x D). And as with all Coby audio products, the CX-CD241 is backed by a 90-day warranty.What's in the BoxCX-CD241 boombox (with speakers), user's manual.", "title": "Coby CX-CD241 Portable CD Player with AM/FM Stereo Tuner (Black) (Discontinued by manufacturer)", "price": 28.54, "imUrl": "http://ecx.images-amazon.com/images/I/51GJ48B7ZVL._SY300_.jpg", "related": {"also_viewed": ["B007FQNL08", "B00IJSBHN4", "B000G4LW0M", "B000VPE9KQ", "B0001654WC", "B00IJSBJR8", "B007B5QVTG", "B00IJSBHQG", "B002WN21J6", "B00CM6Z1Y0", "B001IAKS3U", "B002WN21IM", "B004HQFPSU", "B002CZQ51E", "B007FQNKX6", "B00FX4I9KQ", "B00G4EUT02", "B00E5FFD8A", "B00I8SQJKG", "B00CROTNGO", "B007T0GF12", "B00BCA40S0", "B001IANWCO", "B00CM6Z046", "B0007KKX0U", "B004CHLHTA", "B002HR8HV8", "B0078SOO1S", "B002WN21IW", "B007V9NGHM", "B004VF4D9E", "B003HIVUE2", "B000V7UOEO", "B000OH56ZS", "B007FI9AWO", "B003O6PXS6", "B0017LT4V2", "B00F4I2A4W", "B00DCEPKJ2", "B0046IIVXK", "B007PU5526", "B0052EECYO", "B00383PB0U", "B00933N58E", "B00DU1ASJY", "B0078SKS7C", "B003JD6LVW", "B00INEG8W4", "B00K5K23J6", "B003XQPK76", "B007FQNK4U", "B00644JO9O", "B004AKN53K", "B00DU1ASX0", "B00EEJWAKG", "B00GNB38EU"], "buy_after_viewing": ["B007FQNL08", "B00383PB0U", "B00IJSBHN4", "B000G4LW0M"]}, "categories": [["Electronics", "Portable Audio & Video", "Boomboxes"]]}