{"asin": "B0016BVY7U", "description": "Command and Conquer: Red Alert 3 from EA brings back the fan-favorite real-time strategy game in its latest incarnation with new features, powers, technologies, and a different world. Now, you can play not just by yourself but also cooperatively with a friend as you take on the enemy in this glorious, over-the-top romp..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Co-operative mode lets you and a friend play together in campaign mode.View larger.Wage battle on sea as well as on land and in air.View larger.There is over an hour of in-game video.View larger.Red Alert 3 introduces new units and a brand new faction.View larger.Intriguing Plot TwistsIn previous games, the war between the Allies and Soviets was coming to a close with the Allies nearing victory. In desperation, the Soviets created a time-travel device that they've used to assassinate Albert Einstein before he is able to develop the weapon technology the Allies later use to defeat the Soviets. Upon returning, they notice a new world, and there is a world war taking place between three groups for control of the world.Play As Three Different Factions for Varied game playIn Red Alert 3, you have the choice to play as the Allies, the Soviets, or the Empire of the Rising Sun. Each faction has its own story-line and distinct units with advantages and disadvantages that you have to master in order to win. The new faction to the series is the Empire of the Rising Sun, derived from Imperial Japan, with an all-new cast of units and characters.The three factions have many differences, exemplified by their wildly different types of units. The Soviets, for example, have armored attack bears, Allies have the Dolphin ship which can high jump and use a sonic attack, and the Empire of the Rising Sun features such quirky units as a giant transforming mecha and ninjas. As they've done with the series, EA injects humor into the game when possible, keeping a smile on your face as you wage war.Fight on Land, in the Air, and on SeaRed Alert 3 has land units, air units, and naval units, all integral parts of the game. Unlike most strategy games that don't bother with naval warfare, Red Alert 3 makes controlling the seas an essential part of the game. Controlling resources in the seas and mounting attacks from all directions are strategies that must be employed to achieve victory.Cooperative Mode Lets You Team Up with Your FriendsRed Alert 3 has a fully co-operative campaign mode where you and a friend can play together to achieve victory. This means that you have to develop a strategy together, as well as execute it in synch in order to win. If your friends aren't online, you can also choose one of several AI commanders as your teammate.Play Against Your Friends in MultiplayerWith the different units and play mechanics of each faction, you and your friends will have a great time playing against each other, perfecting different strategies to best suit the units you have and the maps you play on. And thanks to the balanced game play, no one will have an unfair advantage.For previous fans of Command and Conquer, Red Alert 3 will provide the same light-hearted game play, but with more units, more strategies, and more fun. Newcomers to the game will soon see what all the fuss and laughter is about.Minimum System RequirementsOperating SystemMicrosoft Windows XP / Vista (32-bit)CPUXP: 2.0 GHz (Intel Pentium 4; AMD Athlon 2000+; Multiple Cores) / Vista: 2.2 GHz (Intel Pentium 4/AMD Athlon 2200+/Multiple Cores)Memory512 MB for Windows XP; 1 GB for VistaHard Drive Space6 GB / 12GB for EA LinkDVD Drive8x SpeedGraphics HardwareNVIDIA GeForce 6800, ATI Radeon X1800 or higher end DirectX 9.0c compatible graphics cardSoundDirectX 9.0c compatible (Creative Sound Blaster Audigy cards require a Intel P4 2.6 GHz or similar under Vista, Yamaha Xwave-512 not supported)Online Multiplayer512Kbps or faster Internet connectionInputKeyboard, mouse", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51xzJCKQ3KL._SY300_.jpg", "related": {"also_bought": ["B001FLGEEE", "B002NIP6X8", "B000CPKIT6", "B0009J1JIY", "B000YJ09QW", "B00005QJDS", "B000MG3LDA", "B002BXN6GY", "B00005N7YK", "B000ZKA0J6", "B002SKDIKE", "B0000CE1GK", "B00273Y7V6", "B0095C0I4W", "B00004S653", "B00368PSNC", "B00007LVJD", "B0031MAI10", "B0016Q4UJE", "B00005V9Q1", "B002L6HJCI", "B001Q96ZNU", "B00BQZ5F6C", "B000J18SR2", "B0002Y4T8S", "B0051UMYLW", "B00GS1GWRU", "B002BXKJA0", "B000FJSIUA", "B001D2WUDE", "B004GGO1JA", "B00AQ2BLI2", "B0000CE1J2", "B00001IVRD", "B001AH8YSW", "B000SOYG8U", "B002BS47YE", "B00CJ7IUIQ", "B00001LDCK", "B002I0KP4G", "B0016BVYAM", "B001E0X8HW", "B00ECL58XM", "B0000C0YNT", "B006JSXVA8", "B000002UDG", "B000FNA2QY", "B000EPP6UA", "B000AB603U", "B00009ECGK", "B000PWWL64", "B003GSZAOY", "B000HE9LL8", "B0012LGHZI", "B0049WF6FY", "B000R2WI0G", "B004H48VFQ", "B000COCAJI", "B000YDIYEW", "B002M78NM6", "B001HL3Q70", "B002I0J58I", "B002I0JAJ2", "B000CSKOUQ", "B0050SZ980", "B0018YXM3Y", "B00178630A", "B00HETF2T4", "B001811BTO", "B00AMA4L4E", "B001V9PTVE", "B0012GSHHO", "B000NV8F58", "B005UI8V6C", "B005C2QSDY", "B000FGA1US", "B005EZ5GQY", "B0079NGSDO"], "bought_together": ["B001FLGEEE", "B002NIP6X8"], "buy_after_viewing": ["B001FLGEEE", "B000CPKIT6", "B002NIP6X8", "B000YJ09QW"]}, "salesRank": {"Video Games": 4332}, "categories": [["Video Games", "PC", "Games"], ["Video Games", "Xbox 360", "Games"]]}