{"asin": "B000038IFX", "description": "Square's latest RPG is weird in a lot of ways, especially for Square. Xenogears' reliance on story, subtlety, and mood make it Square's most anime-like RPG thus far, in many ways making the game one of its best.Staged on a human colony far in the future, Xenogears' story centers around the war between the nations and  their endless power struggle.  With the nations constantly dueling for power and resources, warfare has escalated to new levels thanks to enormous humanoid robots called \"Gears.\" Trapped by destiny in the middle of the crisis' latest escalation is the game's stereotypically-named Fei Fong Wong. Exiled from a peaceful burg on the brink of war, Fei scours the world with his allies for clues to his past and the unknown destructive power that dwells within him.Like a number of anime features, Xenogears' story is hard to put a finger on. The game's beautiful introduction sequence explains nothing and, at first glance, bears no relevance to the game. This trend continues throughout the game - when questions are answered, a slew of others open up, leaving one in a constant state of cluelessness. As opposed to a Final Fantasy game's primary goal of defeating the villain and saving the world, the driving force behind Xenogears' is resolving the game's excellent story.  While it has its humorous moments, Xenogears's story is serious - so serious that it was almost never released in the United States.  Rife with religious overtones and criticism, Xenogears often asks us to question our very being.  While a little preachy at times, this is used well to enhance the story and our understanding of the game's deep characterizations.Xenogears plays differently than just about every RPG out there. This is most noticeable within the game's dual battle systems. When Gear-less, one has the standard RPG options at his disposal: attack, defend, magic, item, and run. Attacking is where the game differs most, as you are given a number of attack points for every turn. After opting to attack, the player can perform a series of moves, costing one, two, or three attack points each. Certain combinations of moves will result in more powerful attack combos, learned throughout the game. Additionally, leftover attack points can be stored up and used to string together massively destructive combinations of combos with a sixth battle option.  When riding a Gear, one's attack options are similar but different enough to keep things interesting. Instead of using attack points for player combos, Gears come equipped with a large stash of fuel. Each move requires 10, 20, or 30 fuel points, and super-combos require more. As running out of fuel would be a problem, a \"charge\" move restores a small amount of fuel points but leaves the Gears open to attack. Finally, a \"booster\" option speeds the Gear up for more frequent attacks but sucks 30 fuel points away every turn it's active. A definite change from the Final Fantasy series, spells play a very small role in Xenogears, mostly serving defensive purposes, and are learned through the age-old \"get a level, get a spell\" system.With its different style of game and story, Xenogears is accompanied by an art style vastly different from that seen in other Square games. Each town and dungeon is presented polygonally from an overhead view, where pressing the left or right shoulder buttons will smoothly rotate the scenery. All characters in these scenes are sprite-based. Battles are presented in a combination of 2D and 3D, with most characters in 2D and the Gears in 3D. Xenogears is Square's first game to use actual anime and voice acting, mostly found only in the game's awesome movies. Unfortunately, the concept isn't pulled off as well as similar executions, namely GameArts Japanese RPG hit, Grandia.  The game's character sprites are poorly animated and suffer from terrible pixelation, no doubt due to the PlayStation's limited RAM. Xenogears' robot and town designs are full of detail and panache, but their textures constantly wiggle and distort when the camera pans about, giving the game's geometry a less-than-solid, gelatinous look. The game's color in general is bland and washed out. Finally, the game's spells use the PlayStation's more 2D effects well, much like Final Fantasy Tactics' elaborate spell animations. Xenogears doesn't look bad by any means, just substantially unpolished when placed next to Final Fantasy VII or Tactics. However, the beautiful anime sequences skillfully combine top-notch hand-drawn animation with rendered graphics a la Ghost In The Shell's cinematics.Featuring music from Chrono Trigger's composer, Yasunori Mitsuda, Xenogears expertly uses audio to push the story along. Many tracks include voice or chanting and all are appropriately uppity or low with the game's mood. Much of the game, however, uses silence or ambient noises, making parts of the game's soundtrack a tad sparse. To go along with the anime cutscenes, Xenogears is also Square's first foray into including in-game voice-overs. With a few rare exceptions, the voice outside of the movies is limited to grunts and other attack-type noises and usually end up getting drowned out in the game's music.  Unfortunately, just when you might have thought Square was ready for all-digital sound, the rest of the game's sound effects lamentably follow Square's standard, uninspiring synthesized formula.Xenogears is an excellent, thought-provoking RPG with enough story and original gameplay to warrant a look, even if the gameplay  could use a little graphical polish. --Peter Bartholow--Copyright &copy;1999 GameSpot Inc. All rights reserved. Reproduction  in whole or in part in any form or medium without express written permission of GameSpot is prohibited. GameSpot and the GameSpot logo are trademarks of GameSpot Inc.--GameSpot Review", "price": 79.95, "imUrl": "http://ecx.images-amazon.com/images/I/51CSHM2wtEL._SX300_.jpg", "related": {"also_bought": ["B00004TC6E", "B00004SPW9", "B00004S9AF", "B000038ABO", "B00002SVWG", "B00005LOXE", "B000G82R20", "B00000JRSB", "B0000296O5", "B00000K39I", "B00004Y57G", "B0002CHJAA", "B00004XMRL", "1566868254", "B00002STPG", "B00005BW7Q", "B00004W4QJ", "B000006OVE", "B00004S9AC", "B00008RUYZ", "B00002R28C", "B000034DBS", "B000038AAN", "B00004RBQX", "B00002SWCJ", "B00002STPF", "B00002SVX5", "B00001OWYW", "B00000IM2T", "B00005MA97", "B000LWRMHQ", "B00006LEMK", "B00004U4R4", "B00004SWM0", "B00005OLWB", "B00004WMQB", "B00001X50L", "B00002SV4N", "B00001X50N", "B00001XDUB", "B00001X50M", "B000FPGZUE", "B00000JIUG", "B000CC5CHW", "B00024W1U6", "B00029QQNY", "B0015MMN6G", "B000038I9H", "B00007KQC1", "B00005YO7I", "B001QTW2GY", "B000R2YWEQ", "B007RNWUC4", "B00004WLZ7", "B0045L3SNQ", "B00005Q8M4", "B000784XG2", "B00005T7ZN", "B00008KTRS", "B0009A4EV2", "B0002CHIWO", "B00005ME6O", "B001C6GVI6", "B003YVK5T8", "B00KVRK39A", "B000034DMG", "B00002STPE", "B00002STPH", "B000BKSGH8", "B000G7X5P4", "B000035Y2Q", "B0014CN2H6", "B004BV5O0U", "B000IONGU4", "B000DZTRHE", "B00001ZWMV", "B000F5IH2I", "B000784XGW", "B00001ZUGT", "B001CM62UM", "B000AVBFU8", "B00008URUA", "B000FDOTIQ", "B000G7X5MM", "B0001OK7VW", "B00002SU93", "B00004UDVL", "B00KWFCU4M", "B00001ZUHJ", "B000FIVC2W", "B000784XEE", "B00005T7ZP", "B00007LV7Y", "B00KWF366S", "B00009PS24", "B0002GTFIK", "B00002SVG3", "B00004S99R", "B001NJMMHG"], "bought_together": ["B00004TC6E"], "buy_after_viewing": ["B00004TC6E", "B00004Y57G", "B00005BW7Q", "B00008RUYZ"]}, "salesRank": {"Video Games": 4227}, "categories": [["Video Games", "More Systems", "PlayStation", "Games"]]}