{"asin": "B001IWOBA4", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]], "description": "The Altec Lansing Expressionist Bass FX3022 speakers provide crystal-clear sound in an attractive design that fits comfortably anywhere in today's digital home. Thanks to subwoofers built right into the desktop speakers, you'll enjoy powerful and deep bass from a compact package that doesn't take up your limited space. The FX3022 was optimized for computers, MP3 players, and other digital sources, bringing your music, movies, and games to life..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The Altec Lansing Expressionist Bass FX3022:Builds the subwoofer into the desktop speakers for a compact design.Features 25 watts RMS of total power for large volume capacity.Has an auxiliary input jack to connect additional sources.Downward firing subwoofers are built into the speakers.View larger.The Expressionist Bass combines a compact design with a large, full-range sound.View larger.Controls are conveniently located on the speakers themselves.View larger.Elegant Design for the Modern HomeThe Expressionist Bass FX3022 was designed with today's digital home in mind. With a glossy black high-tech look, the speakers are just as much at home on your computer desk as they are out in your living room with your furniture. And at just 5.25 x 10 x 5.25 inches (WxHxD) and without a subwoofer to lug, you can easily move the system around wherever you need them, be it the living room, computer room, den, or porch.High Performance and Great VersatilityWhether you are watching a video clip on the web or using your notebook computer to DJ your latest party, the FX3022 provides a great multimedia platform for all your digital media needs. Featuring 25 watts RMS of total continuous power, the system can easily fill your room with satisfying sound. With an auxiliary input jack and controls built right into the speaker, you can easily connect and adjust a source other than your computer, such as a CD player, DVD player, or iPod.Bass Built Into the BaseInstead of the subwoofer that most other speaker systems rely on, the Expressionist Bass system builds a four-inch long-throw subwoofer right into the base of each speaker.The system has a downward firing orientation, causing the bass to reflect off the desktop and create a radiating 360-degree sound field for convincing slam in the lower registers. And thanks to psycho-acoustic algorithms from the system's integrated Maxx Bass technology, you get close to an extra octave of lower bass. The end result is that you get twice the bass in half the space.Two 40mm Drivers for Full-Range SoundSpecially engineered 40mm drivers provide the mids and highs with great clarity. The two drivers are compartmentalized in a sealed chamber, ensuring that the pressure of the subwoofer doesn't mix and muddle the sound.The internal chamber features a rounded architecture that decreases harsh diffractions (sound waves that bounce around in otherwise square corners) and standing waves (which get stuck in otherwise square corners) that can \"color\" the audio that you hear. What this means to you is a cleaner, more natural sound.The Expressionist Bass FX3022 is backed by a one-year warranty.What's in the BoxSpeaker system, 3.5mm audio cable, power adapter, user's guide, quick connect guide.Bring your laptop and speakers out to DJ your next party.", "title": "Altec Lansing FX3022 Expressionist BASS 2-Way Speaker for PC and MP3 (Black)", "price": 99.99, "imUrl": "http://ecx.images-amazon.com/images/I/41ox%2BzBJE%2BL._SY300_.jpg", "brand": "Altec Lansing", "related": {"also_viewed": ["B001RNOHDU", "B0025VKUQQ", "B0025VKUR0", "B0038W0NEU", "B001IZYV3S", "B002FU5QMA", "B0025VKUQG", "B00JC31RVC", "B0051U7D0E", "B008X1BVH4", "B009XGH2HG", "B002TLSTGA", "B001S14DYO", "B0028N6YH0", "B00CD1PTF0", "B00AFQZ4AU", "B009JXHTNU", "B00EVWX8R0", "B0041QBAIA", "B00K5NYNWS", "B0042F3K9W", "B0041Q9PZ0", "B000062VUO", "B0056BPUQC", "B003VAHYTG", "B0097OUESI", "B00GMPDAAO", "B007119FCU", "B008F2YEN4", "B0062S88OY", "B00GXW0LFI", "B00JC31RUS", "B0025VKUPW", "B00F8HRSN2", "B007PXV2K2", "B002FU5QLQ", "B001F51G0W", "B0027VT6V4", "B005TLTOLG", "B007PXV2KM", "B00BZ7MATG", "B002Q88CGI", "B00711MUTA", "B001IOZTNK", "B00B40CYL8", "B004N31D9W", "B0051WAM64", "B009IBXUNG", "B000HZDF8W"], "bought_together": ["B006JH8T3S"], "buy_after_viewing": ["B00CD1PTF0", "B001RNOHDU", "B0027VT6V4", "B0025VKUQQ"]}}