{"asin": "B0034XDT0S", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Nikon's style setting, image making Coolpix S3000 combines 12.0 effective megapixels with a 4x optical Zoom-Nikkor glass lens for stunning prints as large as 16x20 inches. The sleek, all-metal design slips right in your pocket or purse, and the incredible, bright 2.7-inch LCD makes it easy to compose and share pictures even in bright sunlight. The Coolpix S3000, with Nikon's EXPEED image processing concept and 4-way Image Stabilization System enables you to take incredible pictures, incredibly easy.  Nikon's Smart Portrait System enables users to get great portraits of smiling faces with smooth skin tones and without red-eye and blink.Ultra-slim styling and fine quality that brings greater satisfaction to photography and to carrying a cameraCombining the precision optics of a Nikkor lens with the image quality and performance benefits of Nikon's innovative EXPEED digital image-processing concept, the Coolpix S3000 places advanced shooting functions comfortably in the hand for greater fun with photography.The 19mm slim Coolpix S3000 features quality materials and construction that are instantly recognizable when taken into the hand. And with the Coolpix S3000 available in a diverse selection of attractive colors, it's the perfect tool to express personal style. Plus simple operation of advanced functions in its slim design makes it a pleasure to carry around anywhere.Outstanding imaging ability begins with 12.0 effective megapixels of sharp resolution with an optimized processing system to faithfully reproduce fine details and subtle tones, deliver quick response, and maintain image quality and clarity when taking advantage of extended light sensitivity settings as high as ISO 3200. The Coolpix S3000 is also equipped with a precision 4x zoom, Nikkor lens that employs six aspherical surfaces ably covers focal lengths from 27-108mm (35mm format equivalent) allowing flexibility in shooting subjects near or far.Nikon Coolpix S3000 Feature HighlightsEXPEED digital imaging technologyNikon's smarter approach to digital imaging technology. From image capture to processing, Nikon's comprehensive EXPEED digital imaging concept encompasses the entire picture-taking operation. EXPEED is much more than a processing engine; it is a revolution in digital photography.VR image stabilization in action.Four advanced image stabilizing features*help ensure sharper resultsNikon's Electronic VR image stabilization compensates for the effects of camera shake. Motion Detection automatically controls shutter speed and the ISO setting to compensate for subject movement as well as camera shake. ISO 3200 capability allows faster shutter speeds when shooting in low light or capturing fast-moving subjects. And, Nikon's original BSS (Best Shot Selector) function automatically shoots a series of sequential frames and saves the one with the sharpest focus.* The camera selects and uses only the features required to optimize each image.Intelligent automation contributes to carefree shootingNikon's Scene Auto Selector eliminates the need to manually select a scene mode to match the shot, and this makes it faster and easier to capture the moment in beautiful fashion. The Coolpix S3000 uses this intelligent function to analyze the subject and its surrounding settings and automatically selects the most appropriate of the following six scene modes to achieve optimal results--Portrait, Landscape, Night Portrait, Night Landscape, Close-up, or Backlight.Nikon's exclusive Smart Portrait SystemAutomatically detecting as many as 12 faces in the shot, Face-priority AF helps produce satisfying portraits by adjusting focus and exposure. Smile Timer automatically releases the shutter when the priority subject smiles and offers the Blink Proof function, which automatically shoots two sequential frames and saves the one in which the subject's eyes are open-wide. Now featuring faster processing speed, In-Camera Red-Eye Fix automatically corrects perceived red-eye effect before saving the image to memory.Subject TrackingSubject tracking automatically detects a human face and then continues to track and focus on that subject. Particularly useful when capturing children as they move naturally, Subject Tracking even functions if the subject moves out of the frame and returns within three seconds.Nikon Coolpix S3000 Other Features16 scene modes for optimized shooting in various settingsScene Auto SelectorD-LightingAuto Sort functionUp to 1.6 hours*of movie shooting at 640 x 480 (30 fps)Quick RetouchApprox. 47 MB of internal memoryUSB charging via Charging AC Adapter EH-68P/EH-68P (AR) or PC* Recording stops automatically after 29 minutes, or after the file size reaches 2 GB. This figure is based on in-house testing standards and stated for recording at 25&deg;C (77&deg;F) with a fully charged EN-EL10 battery. Actual results may vary greatly depending on factors that include differences in ambient temperature, and the amount of zoom and autofocus operations used.What's in the BoxEN-EL10 Rechargeable Li-ion BatteryEH-68P AC Adapter/ChargerUC-E6 USB CableEG-CP14 Audio Video CableAN-CP19 StrapCoolpix Software Suite CD-ROM", "title": "Nikon Coolpix S3000 12.0 MP Digital Camera with 4x Optical Electronic Vibration Reduction (VR) Zoom and 2.7-Inch LCD (Plum)", "price": 149.0, "salesRank": {"Camera &amp; Photo": 2281}, "imUrl": "http://ecx.images-amazon.com/images/I/417vw7m5RVL._SX300_.jpg", "related": {"also_bought": ["B0073HSIY8", "B000OW3524", "B001OBXVXM", "B003D8M4U0", "B003D8I25G", "B000UZL0YU", "B004M8SVDE", "B003BWHLMO", "B000VUVA62", "B001PK6C7Y", "B00B7N9B1S", "B004M8SVBG"], "buy_after_viewing": ["B003D8I25G", "B0055UF6UY", "B000OW3524", "B0000A1VS3"]}}