{"asin": "B0035JJJPA", "description": "The Philips GoGear Muse 8 GB MP3 Player (SA2MUS08S/17) lets you enjoy music and movies with superior sound, even in the noisiest settings. The player's trademarked FullSound technology offers enhanced audio quality, while the included sound isolation headphones make it easy to listen anywhere--regardless of what's going on around you. You can enjoy movies on Muse's 3.2-inch HVGA touch screen, or connect the player to an HDTV and share video clips with friends. The compact GoGear Muse also features easy touch-screen navigation, audio recording capabilities, extended battery life, and FM radio in a durable and stylish brushed-aluminum finish.GoGear Muse 8 GB MP3 Player (Silver) SA2MUS08S/17At a glance:FullSound technology delivers rich, detailed audioNoise-isolating headphones filter out background sounds8 GB memory holds 1800 songs; microSD slot allows memory expansion3.2-inch HVGA color display and touch screenFM radio with RDS and 20 presetsPlays MP3, WAV, WMA, AAC, Real Audio, FLAC, APE, OGG Vorbis, JPG, PNG, GIF, BMP, MPEG, WMV, H.264, and RMVB files directlyFeatures FullSound technology and noise-isolating headphones.View larger.microSD card slot offers added storage capacity.View larger.Intuitive touch-screen lets you navigate video files, photo folders, music playlists, and more.View larger.HDMI output lets you watch high-definition video files on your HDTV.View larger.FullSound Technology Restores Rich Detail to MP3 MusicUsing Philips' innovative FullSound technology, the GoGear Muse allows you to experience distortion-free, CD-quality audio. Combining Philips' expertise in music reproduction with the latest Digital Signal Processor (DSP), FullSound restores details to compressed MP3 music files for an enhanced listening experience that includes rich, full bass, and improved clarity on both vocal and instrumental tracks.High Definition Video Playback and OutputA 3.2-inch HVGA touch-screen color display makes it easy to enjoy videos anywhere, while surround sound for movies puts you in the middle of the action. You can share your favorite flicks and clips with friends using the HDMI output, which makes it easy to watch the High Definition (720p) video that's stored on your Muse--simply plug into an HDTV and play (HDMI cable sold separately). The Muse also offers slide-show playback of photo files, making your favorite albums portable.FM radio with RDS and 20 presetsUnlike many one-trick MP3 players, the Muse gives you access to FM radio, so you can catch the news, get traffic updates, and keep up with tunes that you haven't downloaded yet. The FM radio receiver is RDS-enabled, so it can pick up and display information about what you're listening to, including program details, song titles, and artist names. And the Muse lets you dial in 20 preset radio stations--you'll spend less time searching for signals, and more time listening.Built-in Microphone Convenient for Note TakingWhen you wish to capture and replay your own audio or simply take notes, the Muse includes a built-in microphone that allows you to record audio files in MP3 format.8 GB Memory and microSD Slot for Memory ExpansionThe 8 GB Muse holds up to 1800 songs, 2000 photos, or 32 hours of video. It also features a microSD card slot that allows you to expand the player's memory capacity up to an additional 32 GB to accommodate your growing media library (microSD cards sold separately).Intuitive Touch-Screen ControlsWhether you're skipping through tunes, browsing video selections, or organizing photos, the Muse's intuitive touch-screen interface makes navigation easy. Simply touch the player's screen to navigate files, folders, and playlists.Sound-Isolation, High-Definition HeadphonesThe included headphones offer exceptional sound isolation for uninterrupted listening. Whether you're walking down a windy street or riding crowded public transportation, the sound-isolation earphones minimize environmental noise, even at low volume levels.Designed to match the curvature of your ear canals, these ergonomic headphones come with three interchangeable ear caps to ensure a secure, comfortable fit.Extended Battery LifeThe Muse features an extensive battery life. A single charge offers up to 24 hours of audio playback or 5 hours of video playback, and a convenient low-battery indicator lets you know when it's time to recharge.Click theSongbirdto view a software screenshot.Manage Media Files with Philips Songbird SoftwarePhilips Songbird software is included with the Muse. Philips Songbird makes it easy to organize and play all your media files, and it syncs seamlessly with your Muse player. It's also designed to help you discover new artists and navigate media stores, services, and websites. This software works with PCs running Windows XP (SP3), Vista, or 7.The Philips GoGear Muse 8 GB MP3 Player is backed by a limited 90-day warranty.About PhilipsPhilips has a brand promise of \"sense and simplicity\" that encapsulates their commitment to understanding and catering to the desires and needs of consumers and customers. By putting end users front and center, Philips creates innovative products that are designed around people's needs and aspirations, and are both advanced and easy to use. With 60,000 registered patents, Philips is a global leader in innovation, and receives numerous international design awards every year.What's in the BoxGoGear Muse 8 GB MP3 Player, sound-isolation headphones with three interchangeable ear caps, USB cable, and Quick Start Guide.GoGear MP3 Video PlayersGoGear RagaGoGear VibeGoGear AriazGoGear CamGoGear MuseCapacity4 GB4 GB8 GB8 GB16 GB8 GB8 GB16 GBHighlightsFullSoundFullSoundFullSoundFullSoundFullSound&nbsp;&nbsp;&nbsp;&nbsp;Surround for moviesEar-hook headphonesSoft rubber earbud headphonesSoft rubber earbud headphonesSoft rubber earbud headphonesSound-isolation headphonesLossless codec support (FLAC & APE) AudibleLossless codec support (FLAC & APE) AudibleLossless codec support (FLAC & APE) Audible&nbsp;Lossless codec support (FLAC & APE) Audible1.0-inch full-color display--reverse1.5-inch full-color display2.4-inch full-color display2.0-inch full-color display3.2-inch HVGA color display22 hour music playback24 hour music or 4 hour video playback45 hour music or 5 hour video playback2 hours video recording, 20 hour music playback, or 4 hour video playback24 hour audio or 5 hour video playback&nbsp;&nbsp;&nbsp;Composite TV-outHDMI video out, up to 720pFM radio, 20 presetsFM radio with RDS and 20 presetsFM radio with RDS and 20 presetsFM radio with RDS and 20 presetsFM radio with RDS and 20 presetsVoice recordingVoice recordingVoice recordingVoice recordingVoice recordingPhilips SongbirdPhilips SongbirdPhilips SongbirdPhilips SongbirdPhilips Songbird&nbsp;&nbsp;&nbsp;&nbsp;Touch Screen&nbsp;Album art displayAlbum art displayAlbum art displayAlbum art displayFolder viewFolder viewFolder viewFolder viewFolder view", "title": "Philips GoGear Muse 8 GB MP3 Player (Silver)", "price": 92.95, "imUrl": "http://ecx.images-amazon.com/images/I/41PvgL4AGwL._SX300_.jpg", "related": {"also_viewed": ["B0035JJJQY", "B0035JJJQE", "B00IBR5QJY", "B007B5TOZY", "B00ECRRWTE", "B007B5TO4A", "B007B5TPEY", "B00ECQUY2M", "B00EE1H7BQ", "B0076HNNHM", "B002JPITY8", "B005FVNH04", "B00ECRPOKS", "B002JPITXY", "B004STY2Z8", "B00EYYE60I", "B004M8SSTG", "B003ULP5PG", "B0041MMMWW", "B001B4SUIS", "B00HCMZ19Y", "B007B5TOJK", "B001UAPHXY", "B004WOK2OY", "B0030MZ1NQ", "B004M8STFY", "B007V7XQ7E", "B007M6EYU2", "B006MWB8PQ", "B001PR1ZMY", "B00ECRRB8G", "B002MAPS6W", "B005FVNGRI", "B002MAPT7U", "B005FVNGRS", "B005P1VNDW", "B001NGPAN2", "B002MAPRYU", "B0091PVRIE", "B002MAPSC6", "B0097BEDOC", "B0097BEE9Q"], "buy_after_viewing": ["B009RQW3BC", "B002MAPS6W", "B003C0Z01E", "B003EM6AOG"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}