{"asin": "B002LITT42", "related": {"also_bought": ["B001FA09WI", "B003ZSHNGS", "B002LITT4W", "B002OLWITO", "B003VNKNEQ", "B00449F6I4", "B002MGW4WW"], "bought_together": ["B003VNKNEQ"], "buy_after_viewing": ["B009B0MYSQ", "B003VNKNF0", "B005HNF01O", "B003VNKNEQ"]}, "title": "Canon PowerShot S90 10MP Digital Camera with 3.8x Wide Angle Optical Image Stabilized Zoom and 3-Inch LCD", "price": 559.99, "salesRank": {"Camera &amp; Photo": 3355}, "imUrl": "http://ecx.images-amazon.com/images/I/41zpfU4s-fL._SX300_.jpg", "brand": "Canon", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Canon&rsquo;s storied S Series gets a revitalized new leader in the slimmer, lighter, new PowerShot S90, the perfect everyday camera for people who are serious about great photography. Image quality is superb thanks to the new High Sensitivity System and higher ISO speeds, plus an exceptionally bright f/2.0 lens that makes portraits and low-light shots come to life. Photography enthusiasts will love the new control ring at the base of the lens barrel, designed for intuitive, pro-style manual control.PowerShot S90 HighlightsNew 10-megapixel sensor coupled with Canon&rsquo;s DIGIC 4 Image ProcessorThe PowerShot S90 employs a newly developed, 10-megapixel High Sensitivity System by combining a powerful CCD sensor and Canon&rsquo;s DIGIC 4 Image Processor. Thanks to this technological advancement, the S90 is dramatically more sensitive than cameras with identical megapixel counts, and delivers spectacular images with minimal noise. Increased sensitivity demands a higher ISO speed, and the PowerShot S90 delivers with a new maximum setting of ISO 3,200. Blur and camera shake are notably reduced for the ultimate in sharpness and clarity.In addition, a new Low Light mode lets you capture images in an astonishing range of conditions. The camera automatically adjusts the ISO speed from ISO 320 to ISO 12,800 in relation to ambient brightness, subject movement and camera shake.Compact and pocket-sized camera for everyday use for the advanced amateurSerious photography buffs never want to miss a shooting opportunity, and that means keeping a high-quality camera on hand at all times. With a robust feature set that meets an advanced amateur&rsquo;s exacting standards, the compact PowerShot S90 fits the bill. The S90 boasts an incredibly slim profile and lightweight body for pocket-sized convenience, yet packs in advanced capabilities that make every image memorable. It&rsquo;s the perfect take-along complement to your camera collection.Bright f/2.0 lens, great for shooting in low light conditions or using a shallow depth-of-fieldThe S90 sports an f/2.0 aperture, perfect for creating enticing portraits, by drawing attention to the face and blurring the background with its impressively shallow depth-of-field. The Macro setting lets you get even closer. The large aperture also does more. It lets you capture more nuances in low light shooting by using more of the available light. You&rsquo;ll be ready for anything with a lens aperture larger than even many professional sizes.Customizable control ring for easy access and operation of manual settingsFocus, Exposure, ISO, Step Zoom, or White Balance can now be adjusted more precisely than ever with the S90&rsquo;s new control ring. It&rsquo;s even more intuitive and quicker than the usual 2-button control and the S90 lets you decide which function the ring will adjust.3.8x optical zoom in actionWide-angle 3.8x optical zoom (equivalent to 28-105mm) with Canon&rsquo;s Optical Image StabilizerThe PowerShot S90 features Canon's precision 28mm Wide-Angle Lens that allows you to shoot any scene from wide-angle to telephoto. It lets you capture more in every frame, so everyone fits in a family gathering shot. When it's time to take a closer look, a 3.8x optical zoom (35mm equivalent 28-105mm) greatly minimizes camera shake and maximizes the brilliance of every detail. The camera uses a USM (Ultrasonic Motor) for high-speed, quiet, energy-efficient lens movement with precise control. Focal length is conveniently indicated on the lens barrel.Full range of shooting and recording modes including RAW + JPEGThe PowerShot S90's RAW mode lets you shoot images without JPEG compression. It gives you clearer images and complete creative control in editing. RAW images are transferred directly to the computer where they can then be edited using image adjustment software or a processing application to adjust your images as you please. The camera can also be set to allow the simultaneous recording of both RAW and JPEG images while shooting.Also, with 25 Shooting Modes including 17 Special Scene Modes, you're ready for whatever shot comes your way.Large, 3.0-inch PureColor System LCDLarge 3.0-inch PureColor System LCDWith a high resolution stemming 461,000 dots, a high contrast ratio and a wide viewing angle, the PowerShot S90 captures the more subtle variations of color in a scene to make all your images truer to the real thing. The LCD&rsquo;s multiple coatings prevent visual interference from dust, scratches and reflection.What's in the BoxPowerShot S90 BodyNB-6L Battery PackBattery Charger CB-2LYNeck Strap WS-DC9Digital Camera Solution CD-ROMUSB Interface Cable IFC-400PCUAV Cable AVC-DC400"}