{"asin": "B001S14DYO", "related": {"also_bought": ["B00004Z5CP", "B00EVWX8R0", "B001RNOHDU", "B00K2R6C2G", "B00113PUJQ", "B00AQ5PK6I", "B009ISU33E", "B004275EO4", "B00D34A4BA", "B00EO6X7PG", "B00D94X7WW", "B006JH8T3S", "B00GV7V6EA", "B00E3W19MO", "B004LU1U2M", "B00CO8TBQ0", "B000I1D1HA", "B00E0N49C8", "B0002ZPJZY", "B008I648B0", "B006DDGIWM", "B0044DEDCA", "B009XDWUCQ", "B002VKVZ1A", "B000JE9LD4", "B0083J8DZE", "B004VF4R4U", "B002HWRJBM", "B00CERXJNW", "B0033Z2BAQ", "B000OGX5AM", "B003VAGXWK", "B006YG9EEW", "B00E3W1726", "B004YEBK66", "B008PPUMVY", "B0083J8DS6", "B00IRHE892", "B005H3Q5E0", "B000067RBT", "B001R4BT1M", "B00F3ZN0CC", "B00C9TEC0Y", "B00B6QXWIY", "B000I1IG8Y", "B009C3M7H0", "B00B2HH7G0", "B00F42V83C", "B005BZNDS0", "B000UD4LIY", "B000J2EN4S", "B001OV789U", "B00689HXI4", "B001HXZT14", "B003VANO7C", "B00CD1PTF0", "B004YDUZ22", "B009NB8WR0", "B005H3Q59U", "B000OOYECC", "B0044DEDC0", "B00IF4NGEU", "B004SUO068", "B0036E8V08", "B00BFRKYVM", "B0051UY168", "B005H3Q55E", "B00GMTGJIU", "B005X3E5BO", "B00AAS888S", "B000A6PPOK", "B00819OICI", "B00FJRS628", "B0009Y7AX2", "B003NR57BY", "B001TH7GVE", "B00CO8TBOW", "B004LTEUDO", "B00CO8TBNS", "B000UEZ36W", "B00006B8K2", "B00E3W16OU", "B001TH7T2U", "B009ZN2NH6", "B0000BVYT3", "B008RM23ZI", "B00BZC31WQ", "B00A35X6GM", "B00B3P15M8", "B00H09BOXQ", "B003VAHYNC", "B00ALK3KEM", "B001J4ZOAW", "B009ZN03AA", "B007GMPZ0A", "B008GVOVK0"], "bought_together": ["B00004Z5CP"], "buy_after_viewing": ["B00JJ2C0S0", "B009QZH7BU", "B001RNOHDU", "1612185916"]}, "title": "Creative GigaWorks T40 Series II 2.0 Multimedia Speaker System with BasXPort Technology", "price": 129.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41nXUAdlomL._SY300_.jpg", "brand": "Creative", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]], "description": "Amazon.com Product Description The Creative GigaWorks T40 Series II 2.0 Multimedia Speakers bring rich, full sound to your games, videos, and music in a convenient, compact package. Each speaker uses two midrange drivers and one tweeter to provide a well-rounded reproduction of your favorite audio. Integrated BasXPort technology delivers deep bass tones without a subwoofer, saving you even more precious space.An included adapter gives you total versatility.The woven glass fiber cone drivers and cloth dome tweeters provide broad, crisp audio.These compact speakers house three drivers for a full, accurate sound stage.View larger.Quality Materials Make for Better SoundThe midrange speakers are constructed with woven glass cones for durability and longevity. You get tight, accurate sound, including rich, low tones produced by the integrated BasXPort technology. Each cloth dome tweeter delivers clear highs without being too sharp.Front Controls and Ports for Easy AccessAn array of controls are within easy reach, with front-mounted treble, bass, and volume knobs. Add any MP3 or CD player to the T40 Series II Speakers through the auxiliary input, or connect your headphones when you need to keep outside noise to a minimum.Big Power in a Compact PackageThese speakers have an efficient design and plenty of juice, with an 80 dB signal-to-noise ratio and 32 watts of power. The wide 50 Hz to 20 kHz frequency range means the T40s will deliver all the little aspects of your music that lesser speakers might miss.Each Creative GigaWorks T20 Series II Speaker measures 3.5 x 12.3 x 5.5 inches (WxHxD) and weighs 1.65 pounds (3.3 pounds total).What's in the BoxGigaWorks T40 Series II Speakers (left, right), stereo-to-stereo audio cable (6 ft.), dual RCA-to-stereo audio TV adapter, power supply adapter, Quick Start leaflet.With the included adapter, the speakers connect easily to your computer, gaming console, or TV."}