{"asin": "B001D559Y8", "imUrl": "http://ecx.images-amazon.com/images/I/31k8x64fMnL._SX300_.jpg", "description": "The W2 audio system from iSymphony combines a sleek and compact wall-mountable wireless main unit with wireless speakers for flexibility unrivaled by conventional audio systems. Right out of the box, W2 delivers crystal-clear CD-quality music wherever you want it, without the drawbacks of previous-generation wireless systems--no pops, squeaks, or audio drop-outs; all you hear is your music. Set it up in one room or put speakers in every room of your house; you'll never need to run a single speaker wire again.iSymphony's W2 Audio System with Wireless Speakers combines a sleek and compact wall-mountable wireless main unit with wireless speakers for flexibility unrivaled by conventional audio systems.Click to enlarge.The W2 allows you access to all your favorite music sources. An integrated iPod dock smoothly extends from the front of the main unit. A slot-loading CD player on top lets you play your CDs, and SD/MMC and USB slots on the side support playback of music in MP3 and WMA formats. A built-in FM tuner keeps you up-to-date with the latest hit songs and what's happening in the world.Control your system from the speaker in a different room.No cables and a 100-foot range.W2's wireless speakers fit wherever you need them and can be wall-mounted with the wireless main unit for extra style points. Thirty Watts of audio power ensures a full, rich sound to really bring out the details of your music.The W2 forms the center of the iSymphony wireless audio experience. Included in the package is the wireless main unit with iPod dock, CD player, SD/MMC/USB slots and tuner, one pair of wireless speakers, and a full-function remote control. Additional pairs of speakers areavailable separatelyand allow you to expand the system to fill your home or office.Wireless Main UnitBuilt-in universal dock for iPodSlot-loading CD player with CD/CD-R/RW compatibility and MP3/WMA playbackUSB, SD, and MMC slots supporting MP3 and WMA playbackFM Stereo with digital synthesized tunerFull-function remote control includedWall mountable, compatible with VESA 75 (LCD TV) wall mountWireless SpeakersFully independent wireless speakers allow limitless placement options within 100-foot range30 Watts (RMS) total output powerControl volume and playback from the speakersCompact desktop or wall-mountable designWall mountable, compatible with standard speaker wall mountAdditional Wireless Speakers (Available Separately)Expand your wireless system as you wish for true, whole-home wireless audioIndoor and outdoor speaker designs for ultimate flexibilityControl your music volume and playback from the speakers using the dedicated remote controlWhat's in the BoxiSymphony W2, one pair of wireless speakers, remote control.", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]], "title": "iSymphony W2 120-Watt Wireless Micro Speaker System with Built-in Universal Dock for iPod (Black)"}