{"asin": "B0007LJHVA", "description": "With a simple touch screen interface, automatic route calculation to any destination, and turn-by-turn voice-prompted directions, the StreetPilot c330 GPS navigator is a powerful companion for your adventures on the road. Plus, Garmin has designed the \"c-series\" of car navigation units to be as simple and easy-to-use as possible-- no more intimidating features, just straightforward, basic navigation at your fingertips. Selecting a destination is as simple as a few finger-strokes, and you can choose between a three-dimensional navigation view or the more traditional \"bird's eye\" overhead view.The streetPilot \"c-series\" GPS navigators feature a simple touchscreen interface, with automatic route calculation to any destination.The 3.5-inch diagonal, 16-bit color display makes navigation a snap.The included database features nearly six million points of interests including hotels, restaurants, gas stations, ATMs, and attractions.The c330 keeps track of places that you find and stores the fifty most recent finds in an easy to access list called Recent Selections, placing the most recently viewed at the top of the list. This becomes a very helpful feature if you visit the same places over and over and don't want the inconvenient of reloading the information in the unit multiple times.  Although the c330 boasts distinctive and sleek styling, simplicity is the name of the game. The only buttons are a rotary volume knob and an on/off switch. The device is secured by a suction-mount cradle that fastens to the windshield for easy portability between vehicles. You can customize the unit's appearance with an array of colored faceplates that are sold separately.For the ultimate out-of-the-box convenience, the StreetPilot c330 comes pre-loaded with highly detailed MapSource City Select street data. The database features an industry-leading five million-plus points of interest, including hotels, restaurants, gas stations, ATMs, and attractions. The c330's bright, 3.5-inch diagonal, 16-bit color display makes navigation a snap. The unit also features dual integrated speakers for high-quality voice prompts, and an internal lithium-ion battery for out-of-car route planning.It's also worth mentioning that with some GPS units the manual to use them is as thick as a phone book, but it was a pleasant surprise to find that the c330's manual was very easy to use and provided many screen shots to make sure the user understood the units capabilities.  If you find yourself on the road looking for addresses often and just want a GPS to tell you where to go simply and clearly than this unit was made for you.What's in the BoxStreetPilot c330,Preloaded City Navigator NT for North America or Europe (full coverage), Vehicle suction cup mount with integrated power cable, USB cable, USB drivers disk, Dashboard disk, Quick reference guide", "title": "Garmin StreetPilot c330 3.5-Inch Portable GPS Navigator (Discontinued by Manufacturer)", "price": 79.99, "imUrl": "http://ecx.images-amazon.com/images/I/51MMFESHF1L._SY300_.jpg", "related": {"also_bought": ["B001QDN4BC", "9984988910", "B002T3SCOC", "B000NW12C0", "B00121MYE6", "B002CMOUHI", "B002IUG14O", "B0030HEPRE", "B0037JE8VS"], "buy_after_viewing": ["B0057ODG6Y", "B0057OCDQS", "B002OL2MU4", "B001QDN4BC"]}, "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]]}