{"asin": "B0010Z28XG", "description": "Approximately the size of a postage stamp, SDHC cards offer greater capacity than standard SD cards while maintaining the same form factor.SDHC Class 6 cards offer more capacity and faster transfer rates.Display thousands of high quality photos on SDHC enabled digital photo frames.Ideal for expanding storage capabilities of netbooks and mini laptops with SDHC slots.Store More PhotosWith most point and shoot digital cameras quickly climbing the megapixel ladder, 6,8, and even 10 megapixel ratings are beginning to be commonplace. With Transcend SDHC cards, you can keep up with the larger files these high resolution cameras produce. With 4 GB, 8 GB, and 16 GB capacities, you can store more photos without having to delete old photos on the card before you have the chance to save them to a PC or print them out.Store More of EverythingThe larger capacities of SDHC cards make them more versatile than ever. Use them in all your mobile devices that support the SDHC standard. All that is required is an SDHC compatible slot or reader. SDHC is an extension of the original SD standard that enables capacities greater than 2 GB. It uses the same physical form factor as SD, but SDHC cards only work in SDHC compatible devices. Standard SD cards work in both SD and SDHC devices (backward compatible).Enjoy Faster Transfer SpeedsBasic SD cards transfer data up to six times (6x) the data rate of the standard CD-ROM speed (900 kB/s). Transcend SDHC class 6 cards offer a minimum of 6 MB/s write speeds under the most demanding storage conditions. Some cameras require a high speed card to be able to record video smoothly or capture multiple still photographs in rapid succession. Check your device for maximum compatibility for your intended usage patterns.FeaturesFully compatible with SD 2.0 StandardsSDHC Class 6 compliantCompatible with all SDHC-labeled host devices (not compatible with standard SD)Easy to use, plug-and-play operationBuilt-in Error Correcting Code (ECC) to detect and correct transfer errorsComplies with Secure Digital Music Initiative (SDMI) portable device requirementsSupports Content Protection for Recordable Media (CPRM)Allows In System Programming (ISP) for updating firmwareSupports auto-standby, power-off and sleep modesMechanical write-protection switchRoHS compliantLifetime WarrantyEnsure Your Device is SDHC CompatibleSDHC devices can use both older SD cards and SDHC (high capacity) cards. However older cameras and other devices that were released before the SDHC standard may not support the new SDHC cards. Please check your device documentation to verify compatibility before purchase. If your device is fairly new or states support for 4 GB or greater SD cards, then you already have SDHC support.Digital Camera Storage Capacity TableMemory cards should be purchased according to how high the resolution or DPI (dots per inch) of your digital camera is (i.e. how many megapixels it has), and how many pictures you plan on taking at a time. Transcend has provided the following graph to assist you in buying an appropriate capacity card for your camera:Storage CapacityCamera Type / Approximate Number of Pictures2 MP3 MP4 MP5 MP6 MP8 MP10 MP8 GB910068244096327625602096163216 GB182001364881926552512041923264*The \"File size\" represented here assumes that the highest resolution (DPI) your camera supports is used and that pictures are stored in standard JPEG format. The actual number of pictures you can take will vary depending on your digital camera's resolution and compression settings, composition (complexity) of the images taken, as well as lighting and exposure factors.", "title": "Transcend 16 GB SDHC Class 6 Flash Memory Card with Card Reader TS16GSDHC6-S5W", "price": 39.93, "imUrl": "http://ecx.images-amazon.com/images/I/31RdJ4s3jSL._SX300_.jpg", "related": {"buy_after_viewing": ["B003VNKNEQ", "B007JRB0SS", "B003VNKNF0", "B009D79VH4"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Memory Cards", "SD & SDHC Cards"]]}