{"asin": "B001AWBYRA", "description": "Call of Duty is back, redefining war like you&rsquo;ve never experienced before. Building on theCall of Duty 4: Modern Warfareengine,Call of Duty: World at Warimmerses players into the most gritty and chaotic WWII combat ever experienced. Players band together to survive the most harrowing and climactic battles that led to the demise of the Axis powers on the European and Pacific fronts.&nbsp;The title offers an uncensored experience with unique enemies and combat variety, including Kamikaze fighters, ambush attacks, Banzai charges and cunning cover tactics, as well as explosive on-screen action through the all new four-player cooperative campaign.&nbsp;The addictive competitive multiplayer has also been enhanced with new infantry and vehicle-based action, a higher level cap, more weapons, and a host of new Perks, maps and challenges.Features:New Enemies, Environments and Tactics:&nbsp;Face off against ruthless and tactically advanced enemies that will stop at nothing to defend their homelands, from swamp ambushes and tree-top snipers to fearless Kamikaze attacks.&nbsp;Play as a U.S. Marine and Russian conscript across a variety of Pacific and European locations against the fearless Imperial Japanese and elite German soldiers in epic adrenaline-filled infantry, vehicle and airborne missions.Co-Op Campaign Mode, Call of Duty Style:For the first time in the franchise,Call of Duty: World at Warintroduces co-op play, bringing fresh meaning to &ldquo;No One Fights Alone&rdquo;. Campaign co-op features up to four-players online, or two-player local split-screen, allowing gamers to experience harrowing campaign missions together for greater camaraderie and tactical execution. Co-op mode incorporates innovative multiplayer components such as challenges, rankings and online stats for deeper re-playability and multiplayer experience bonuses. Co-op mode also features Competitive Co-Op that will show who is really the best player on your team.Enhanced Multiplayer:Call of Duty: World at Warcontinues the class-based multiplayer action the series is famous for. The addition of vehicle combat with tanks rounds out the multiplayer experience, and features such as persistent stats, player rankings, upgradeable weapons, squad-based gameplay, customizable classes and Perks, have been further enhanced.The Call of Duty Experience:Call of Duty: World at Warutilizes cutting-edge technology including highly-detailed character models, self-shadowing, environmental lighting and amazing special effects to deliver jaw-dropping visuals.&nbsp;Depth of field, rim-lighting and texture-streaming technology bring the adrenaline-pumping combat to life, while physics-enabled battlefields and fire that spreads through environments realistically immerses players into the harrowing and dynamic combat.", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/51f594q13%2BL._SY300_.jpg", "related": {"also_bought": ["B001CC8UBG", "B003JVF728", "B00503EAG2", "B000B63RSA", "B00269QLJ2", "B007H2V9W2", "B007XVTR12", "B002ZJPYHS", "B003O6CB6S", "B000922E0S", "B002NIP2SM", "B000PS1HMM", "B002I0HJZO", "B001E6DG6Y", "B004FUGKSW", "B002BS47YE", "B000TTFLS8", "B00022Q0RI", "B0050SZ836", "B00K30F1H4", "B003GSZAOY", "B001Q96ZNU", "B004HYIAPM", "B002BRYXRQ", "B003Q55Y5C", "B002SU4QG4", "B002BXKJA0", "B00178631E", "B0079NGSDO", "B000VOSQ0Q", "B0013RC1W4", "B000X9FV5M", "B00EDJLXHI", "B001B5U80K", "B00CPKUV9I", "B00009TW6R", "B003EZ1KGQ", "B001BNFQKO", "B0050SZ0SY", "B003ICGL7I", "B0012LGHZI", "B004QRKWLA", "B005G4CXPK", "B004H80TUC", "B0029ZBZ0I", "B005C2D2H4", "B000YJ3TR8", "B00BMFIXZG", "B0000C6EB4", "B0037M07UG", "B00DC9T2J6", "074401056X", "B000PS2XES", "B002SRP9VI", "B0001OU19K", "B000PS4X7S", "B0009IX7K8", "B00B70WKUK", "B00CJ7IUIQ", "B0016Q4UJE", "B003VOQFOM", "B0018XWLKA", "B001UWGDPS", "B002KYIAJM", "B00CLF839C", "B008OQTUKS", "B0001AO028", "B003ZULWQI", "B000N4JENW", "B000COCAJI", "B005ENCIWG", "B00DSFW5MA", "B002I0IHIM", "B00D02ARRQ", "B002GDRPYI", "B00AEWTSWU", "B001LKM0EW", "B0002V3CPW", "B001E8QA2E", "B008J16APQ", "B0050SWTS8", "B00ERDGMSA", "B004FZ9822", "B00F4H2O6W", "B000AAL4HI", "B000R2QSTI", "B00EPFEUKM", "B003TIVSM4", "B002I0KOSI", "B0001I9YE4", "B0008GJRQ4", "B0096PLB9O", "B0016B28Y8", "B00C7103JI", "B00GS1GWRU", "B0065NP39E", "B004EI0XZQ", "B008E6ZXI6"], "bought_together": ["B003JVF728", "B00503EAG2"], "buy_after_viewing": ["B0041ZZ7UI", "B000B63RSA", "B001CC8UBG", "B001E6DG6Y"]}, "salesRank": {"Video Games": 2340}, "categories": [["Video Games", "PC", "Games"]]}