{"asin": "B000WS204Y", "description": "Enjoy turn-by-turn driving directions--including visual guidance and voice commands--through your existing mobile phone with the Allen Sports Navigator mobile GPS receiver. In addition to offering all the benefits of an expensive standalone navigation system, the unit continually updates your mapping and point of interest (POI) data over your mobile network (so it's always up to date), and tracks anywhere in the world using Google Earth. The map coverage includes street-level maps of the U.S. and Canada, with additional maps available for purchase. The Power Search database, meanwhile, offers more than 20 million POIs, all available in a single search that includes the Yellow Pages, White Pages, Wcities, and Tele Atlas.Thanks to the intuitive menu system, you can quickly and conveniently look up business or residential addresses and navigate your way there. Best of all, every one of these features is available through a device that you already carry wherever you go--your mobile phone. The Allen Sports Navigator bundle comes with a WAAS-enabled, SiRF III Bluetooth GPS Receiver, an AC and car charger, a universal phone/PDA holder with mounting hardware for cars and bicycles, and a software package.Key Features:2D and 3D MapsMap coverage includes street level maps of USA and CanadaMap and Point of Interest (POI) data is delivered over your mobile network, so it's always up to dateNightmode for low light conditionsPower Search database offers over 20 Million POI&#x92;s.Product includes lifetime license on Navigator software, so there are no recurring feesThis Sports Navigator GPS Device includes street-level maps of the U.S. and Canada.", "title": "Allen Sports Navigator Mobile Phone Software and Bluetooth GPS Device", "imUrl": "http://ecx.images-amazon.com/images/I/31iGPewTzcL._SY300_.jpg", "salesRank": {"Sports &amp; Outdoors": 975005}, "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Cycling GPS Units"]]}