{"asin": "B000JVFKH8", "description": "You don't just take the iPod nano on your run. You let it take you. Music is your motivation. But what if you want to go further? Thanks to a unique partnership between Nike and Apple, your iPod nano becomes your favorite workout companion and coach.A complete workout companion. See itin detail.Place the sensor in your Nike+ shoe, plug in the receiver, and you're ready.Learn more.The Nike Sport Music section of the iTunes Music Store features Nike-created content that will keep you moving.Run to your favorite music while getting valuable workout information.Consisting of a wireless sensor and receiver, the the Nike + iPod Sport Kit works exclusively with your Nike+ shoes and iPod nano to give you real-time feedback during workouts. It also lets you track your performance on your Mac or PC.Get in GearMeet the three must-haves for the ultimate synthesis of sport and music: a pair of Nike+ shoes, an iPod nano, and the Nike + iPod Sport Kit. Find out what happens when the leading name in sports and the leading name in digital music team up to take on your workout.First, get a pair of Nike+ shoes. Only Nike+ shoes feature a built-in pocket under the insole specially engineered for the Nike + iPod sensor. For seamless, stylish integration, add Nike+ apparel that holds your iPod nano and receiver.Next, get an iPod nano. Skip-free playback, a brilliant display, and up to 1,000 songs in an impossibly small iPod keep you light on your feet. And only iPod nano syncs your complete workout data with both iTunes and nikeplus.com.Lastly, you'll need the Nike + iPod Sport Kit. The Sport Kit allows your Nike+ shoe to talk to your iPod nano. The sensor uses a sensitive accelerometer to measure your activity, then wirelessly transfers this data to the receiver that's plugged into the dock connector on your iPod nano.Rock 'n' RunSee the minutes tick by. Watch the miles unfold. Hear real-time feedback. All to your favorite music--including the one song that always gets you through the home stretch. As you run or walk, the sensor sends information to your iPod nano, tracking your time, distance, pace, and calories burned. If you choose, real-time, spoken feedback can even alert you to milestones throughout your workout.Stay in SyncSync up after you cool down. Just as seamlessly as it syncs your music, photos, and calendars, the iPod nano also syncs your run. Simply connect your iPod nano to your Mac or PC, and your workout data syncs to both iTunes and nikeplus.com, where you can see your runs, set goals, and challenge friends. The Internet is an open road. Staying in sync is as easy as 1, 2, 3:Connect: Any mere pedometer can show you stats while you run. But thanks to the Nike + iPod sensor and receiver, the iPod nano also transfers your workout data to the Internet as soon as you sync. Connect your iPod, and iTunes takes over, automatically syncing all your run data and sending it to nikeplus.com.Compare: Remember each run. Analyze your performance. Break your last record. Stay in tune with your goals. Nikeplus.com keeps stats on every step. Check your speed, distance, and calories burned--by run, by week, or by month--all from a graphical interface as intuitive as it is stunning.Compete: Nikeplus.com keeps you connected with runners from every corner of the web. And that's where the real race begins. Use nikeplus.com to challenge anyone, anywhere to a virtual race. Run on your own time, on your home turf, then log on to nikeplus.com to retrieve your results.Nikeplus.com keeps track of your performance and workouts, and lets you measure yourself against others.Nike Sport MusicAvailable in the iTunes Music Store, the Nike Sport Music section features Nike-created content that will keep you moving:Continuous Workout Mixes: Workout routines developed for use with Nike + iPod time- or distance-based workouts. Each routine offers coaching, motivational, and training tips over a continuous mix of music.Sport iMixes: Professionally selected playlists designed to motivate you through the most demanding workouts.Athlete Inspirations: Playlists chosen and introduced by top athletes.Video and Audio Podcasts: Shows featuring the most dynamic personalities in the sporting world.AccessorizeComplete your experience with specially designed Nike apparel, including an iPod nano armband that makes it easy to stay tuned to your music during an active workout. Nike also offers jackets, tops, and shorts with waterproof pockets to hold your iPod nano.What's in the BoxWireless sensor for Nike+ shoes, wireless receiver for the iPod nano, and printed documentation.iPod CompatibilityiPod nano 1G,iPod nano 2G", "title": "Apple Nike + iPod Sport Kit for iPod nano 1G, 2G, 3G", "price": 19.0, "imUrl": "http://ecx.images-amazon.com/images/I/41tHTrEFH0L._SY300_.jpg", "related": {"also_bought": ["B001KP3NZS", "B000ID6DTG", "B001KY7YH2", "B001L6LJJS", "B001J7EWA2", "B001RNL3WI", "B00131X9J4", "B002SZRO0Y", "B002503YCE", "B001320XDI", "B0010B4Z68", "B000XS139G"], "buy_after_viewing": ["B001L6LJJS", "B001KP3NZS", "B000ID6DTG", "B001328JBG"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Cases"]]}