{"asin": "B00DSJA3G6", "related": {"also_bought": ["B00C9LABL6", "B008YD80KC", "B000IDCDZY", "B00C7JVS2Q", "B007TPS9PC", "B00BMVRNHE", "B00F3KWZW8", "B00GT1423A", "B006ZP8UOW", "B00C7AV5ZA", "B00AJWLUEE", "B003YUEF0E", "B00GYBIU7O", "B005XU7OL0", "B00GJ12EN0", "B00F4N1BLK", "B008N6X9W4", "B00429NVQA", "B008N6XCNK", "B009WTYK1K", "B008O5BIWW", "B00HJYQE8C", "B00CDT7KPO", "B005QT7ZBC", "B00BJPEB0A", "B00C7JWJRY", "B00FT9VW0O", "B006ZPWS4U", "B003CFATT2", "B00HHGE6PU", "B00EZY7294", "B00F5CTTAU", "B003MWQ30E", "B00BXLZBXQ", "B00CDT4OR6", "B000X23I22", "B005T7AMUW", "B0046SSX56", "B00G7GMEOG", "B00B7QXY0Y", "B001AHAU5M", "B001EVGIYG", "B00B7S5N2Y", "B001PS9E5I", "B0081FLFQE", "B00DHU85NE", "B00HG137OM", "B003BU0EKW", "B0058RLD9C", "B008D5TYGU", "B00B7ID99I", "B00EOEDJ9W", "B004XXMUCQ", "B006QB1RPY", "B007027IVA", "B007JRB0RE", "B00EXK14S0", "B0000BVYT3", "B00HVLDRAQ", "B002G12OBO", "B00H3Q8QB4", "B00BB2MMNE", "B004UBUB7C", "B00EHBERSE", "B000N99BBC", "B00BSN8DN4", "B00F0DD0I6", "B005T3GRLY", "B008JJLW4M", "B00GTGETFG", "B00BQ8RKT4", "B00CL8F98W", "B00DUW3Y7G", "B007XZM6VG", "B007I5JT4S", "B009QZH7BU", "B005DLCJX2", "B001QUA6RA", "B00005115S", "B00IBDOB5I"], "bought_together": ["B000IDCDZY", "B008YD80KC"], "buy_after_viewing": ["B00F3KWZW8", "B00F5CTTAU", "B006ZP8UOW", "B006ZPWS4U"]}, "title": "Foscam FI9821W Indoor Pan/Tilt H.264 720p Wireless IP Camera, 1/4&quot; Color CMOS Sensor, F: 2.8mm F:2.4 (IR Lens), IEEE 802.11b/g/n Wireless Connectivity, Black", "price": 108.99, "salesRank": {"Camera &amp; Photo": 1315}, "imUrl": "http://ecx.images-amazon.com/images/I/41QWgY37waL._SX300_.jpg", "brand": "Foscam", "categories": [["Electronics", "Camera & Photo", "Video Surveillance", "Surveillance Cameras", "Dome Cameras"]], "description": "p.sansserif{font-family:Arial,Helvetica,sans-serif;}The Foscam FI9821W V2Keep an eye on your loved ones &amp; belongings from anywhere, now in High Definition!Watch what you love in 1280 x 720p HD qualityThe FI9821W V2 provides a 1.0 megapixel lens capable of streaming video at 1280 x 720p HD quality. Enjoy the convenience and peace of mind knowing that your loved ones and personal belongings are safe and out of harms way. Stream HD quality video and audio directly to your PC (Windows &amp; Mac), iPhone, Android, or Tablet.Save alarm recordings directly to an SD cardReceive alerts via email/FTP whenever motion is detected. Record snapshots and video when anyone enters or exits your driveway, backyard, home or business. Utilize onsite/offsite network video monitoring and recording capabilities to an SD card (up to 32 GB - not included).H.264 compression for smoother videoThe FI9821W is one of the first Foscam cameras to provide H.264 compression, which allows for HD quality video and also smaller file sizes when recording video. This allows you to store anywhere from 3 - 5 times as much video compared to MJPEG compression cameras, like our FI8910W model.Quick and simple to setup with amazing technical supportNow features a WPS button for easy wireless setupFoscam is designed to work right of the box - simply connect the camera to your wireless network using the new WPS button located on the back of the camera (required WPS compatible router), set up port-forwarding and away you go. Once properly configured, the camera operates independently without the need for a computer.Industry leading tech-supportShould you require any help or assistance, our top-notch technical support team is available to guide you step-by-step through the process via telephone and remote log-in session. In addition, we have a comprehensive set of step-by-step video tutorials which are available on the Foscam US website under the \"Support\" section.Stream video and audio on your iPhone, Android, Blackberry, or PCWith the free app from Foscam titled \"Foscam Viewer\", or other third party apps such as \"Live Cams Pro\" on iOS and \"MyLiveCams\" or \"TinyCam Monitor\" for Android, you can stream live video and audio on the go with your iPhone, iPod, iPad, Android phone, or tablet. As long as you have internet through 3G, 4G, LTE, or wifi, there is no limit on where and when you can stream your Foscam camera.The world's most popular Wi-Fi remote monitoring cameraCatch everything that's going onSee who is pulling into your driveway or who is at the front door. Watch your baby sleeping peacefully in her cradle, or your pet tearing up your sofa! Track visitors within your home. Monitor caregivers with your elderly parents.Night vision up to 26 feet with an IR-cut filterThe Foscam FI9821W V2 uses 11 infrared LEDs to record video in total darkness up to 26 feet away. It also utilizes an IR-cut filter which allows the camera to render true and accurate colors during daytime.Talk and listen with integrated two-way audioListen and respond to what is going on while you watch. Foscam's built-in speaker and mic allow you to keep in touch without the need for a telephone or computer. Take video conference calling and remote baby monitoring to the next level.Direct access to your cameras and video with no monthly feesDirectly linked from your router to your cameraEach Foscam IP camera is outfitted with its own network video server which directly connects the camera and your viewing/recording device. All images and video are stored directly on an SD card (not included) or network video recorder(NVR).No recurring feesYou have complete access and control over your content and can never be locked into paying any monthly fees. Since your Foscam camera is connected directly to your router and runs off of your own network, you are in control of all video recordings as well as who is viewing your camera.Flexible storage optionsIf you wish to store your video on third party servers, that option is available. Foscam is compatible with Dropbox, Sensr.net, iCloud, Camcloud, and most other third party network storage services that allows you to mount the storage service as a hard-drive on your PC.Enhance your experience with Foscam's Blue Iris ProfessionalTake video security to the next level with professional surveillance softwareFoscam's Blue Iris Professional video recording software (sold separately) allows you to convert any existing Windows PC into a full-fledged professional digital video recording solution. Blue Iris enhances existing built-in software by adding the following features:Take advantage of extremely advanced featuresRecord with H.264 compression to further reduce file sizes and increase data transfer speed, view and record up to 64 different cameras simultaneously, and integrate your Foscam cameras with virtually every other IP camera and CCTV camera system on the market.Your own, full-fledged home or business monitoring systemUse zone motion detection to specify which parts of your video stream should detect motion, set a schedule to record your cameras continuously to a hard drive every day, and even use the Blue Iris app on iPhone and Android in conjunction with your software to view your cameras and adjust settings remotely."}