{"asin": "B0009WPZOA", "description": "Wake up to the smell of burnt asphalt as the thrill of illicit street racing permeates the air. From the makers of the hitNeed for Speed: Undergroundseries,Need for Speed: Most Wanted Black Editionchallenges players to become the most notorious and elusive street racer.This collector's edition features exclusive cars, races and specially-tuned rides, as well as a bonus DVD with behind-the-scenes footage of model/actress, Josie Maran, concept art, exclusive videos and much more.Combining illicit street racing and tuner customization with the intensity of strategic police pursuit that surpasses any Hollywood-style chase scene,Need for Speed: Most Wanted Black Editionis on every gamer's \"must-have\" list. Out-race rivals, evade cops and exploit hundreds of miles of open road as gamers make their way up the Blacklist.To become the most wanted racer, players must build up their street cred and Rap Sheet with gripping, white knuckle, head-to-head races with the top drivers on the streets, as well as pull daring, evasive moves to out-run and out-fox the cops that patrol the open road. Players can manage their heat or utilize a number of strategic tactics to keep the cops off their tails as they leave their rivals behind to suck their exhaust fumes.Need for Speed: Most Wanted Black Editionalso features a variety of the hottest cars that range from tuners to super cars. You can customize your ride to race against any class of vehicles. Combining the thrill of open-world street racing and customization with the intensity of strategic police pursuits,Need for Speed: Most Wanted Black Editionis the next release in the hit racing series that challenges players to become the most notorious and elusive street racer.", "price": 76.89, "imUrl": "http://ecx.images-amazon.com/images/I/51E95ZBT6ML._SY300_.jpg", "related": {"also_bought": ["B000GPZSBK", "B001AZFSG0", "B0050SWTAQ", "B0002ILSH4", "B000RI17FM", "B0050SY0L2", "B003R783IY", "B00CTKHYG2", "B003O6N266", "B001TOMQTY", "B00JXDJVBE", "B00488PZ1E", "B00GSR47F8", "B0009WPZMW", "B002MED6F8", "B000B6ML1Y", "B000GPXS5I", "B002I098JE", "B000JHMJDA", "B003ZSP0WW", "B000MUXLOK", "B0000C4M23", "B00BU7WVG8", "B0083RDTXM", "B00BMFIXT2", "B000UKZ20S", "B000CRSBLQ", "B00149Y1G0", "B007XVTR3K", "B0050SYILE", "B003O6E986", "B000IYI8LQ", "B005VR1Q7S", "B0050SYDEQ", "B002ACFZ10", "B001AZFSEW", "B0048C8VKM", "B000OPPR7W", "B00GV8QTPU", "B002I0H8R8", "B00C710AZ0", "B0050SYV70", "B00DNGQQUQ", "B003JVKHEQ", "B001PKHRY6", "B000TP2V3A", "B00503E8S2", "B00BRQP2C2", "B0006SST9U", "B002Q21X7Y", "B0088I7KYU", "B0030MOTNE", "B000B6ML28", "B00AY1CT4U", "B000ZJVDA2", "B00519C7CE", "B000FRU1UM", "B001CRQYBO", "B000FRU0NU", "B003O6E7AG", "B0009Z3HOW", "B001ASJIRM", "B00EFFW0HC", "B008AEOMVG", "B0009S4UOK", "B00BU3ZLJQ", "B002SRSQ72", "B0023CDW9Y", "B0009WPZM2", "B003VKLABE", "B001AWIP68", "B00CHGYUE2", "B0050SYLRK", "B002BRZ8FW", "B000BLM5PG", "B001D7T2VM", "B00CD90R4K", "B000VBIGK4", "B002BSA2LQ", "B008HHTDP6", "B000G0LE0Y", "B00269DXCK", "B003Q53VZC", "B00D9EPI38", "B004MXP600", "B008AEE02M", "B005GM3RRU", "B001NJ6AWO", "B0050SYPV2", "B003P9LE5I", "B004YVOCYG", "B004HX1QFY", "B0009SQFHA", "B000P46NMK", "B000G75AXY", "B00008J7NZ"], "bought_together": ["B000GPZSBK"], "buy_after_viewing": ["B0050SWTAQ", "B000GPZSBK", "B001AZFSG0", "B003R783IY"]}, "salesRank": {"Video Games": 2543}, "categories": [["Video Games", "Xbox 360", "Games"]]}