{"asin": "B000DZHA6O", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Kodak has raised the bar with the Kodak EasyShare Z612 6.1-megapixel zoom digital camera. With a powerful zoom and precision optics, a 6.1 megapixel resolution, and easy-to-use creative manual and custom controls, including video, the Z612 packs a powerful punch into one compact, handy camera.The Kodak Z612 features an all-glass 12x Schneider-Kreuznach Variogon f2.8 to f4.8 optical zoom 35 to 420 millimeter lens that delivers extraordinary performance and sharp pictures, as well as image stabilization that enables improved image quality at longer zoom ranges and slower shutter speeds. This camera includes a 6.1-megapixel sensor that delivers excellent resolution for prints up to 30 x 40 inches, and provides you with five resolution settings that give you the freedom to pick between quality and quantity per what suits you best at the time. The Z612 lets you view your pictures with brilliance and clarity on its high-resolution, indoor/outdoor viewable 2.5-inch color LCD display, or its high-resolution electronic viewfinder, whether you are shooting vertically or horizontally, both views feature auto picture rotation. You can also quick magnify up to 8x, fast scroll through images, or view multi-up in review mode. And with 32MB internal memory and the ability for expanded external memory via the SD/MMC card slot, you can keep shooting pictures. The Z612's Kodak Lithium-ion rechargeable digital camera battery has an outstanding capacity that provides continuous and reliable power and can be recharged easily via the included Kodak Lithium-ion battery charger.The simple-to-use video features on the Z612 let you record VGA video at a resolution of 640 x 480 pixels at 30 frames per second (fps) with sound, and zoom during the video for increased versatility. Image stabilization enables a steady capture, and you can lessen memory use via MPEG-4 compression. This unit also lets you print multiple frames on a 4 x 6-inch print, or save single frames for later e-mail to family or friends. The Kodak Perfect Touch technology on the Z612 makes your pictures as vivid as when you took them, with better, brighter images that show richer detail and clear up dark shadows to reveal brighter smiles. This camera features on-camera cropping, a histogram function that lets you verify the exposure of your picture on live view, quick view, and review. The Kodak Z612 provides you the option of eight different scene modes, including; portrait, landscape, bright, action, close-up, party, text and museum modes, as well as five color modes, including high, low, natural, sepia, and black and white.Kodak's Z612 gives you multiple choices in customizing your controls, such as Program mode, Aperture priority mode, and Shutter priority mode. This camera also lets you manually set your exposure compensation, aperture, shutter speed, and ISO equivalents, and includes auto and manual controls for white balance, flash mode, autofocus, and exposure metering. The exclusive Kodak Color Science image processing chip provides vibrant, true-to-life colors in every picture using advanced algorithms and hardware acceleration features that let it make instantaneous and advanced analysis of collected scene data to influence picture quality. Not dubbed the Easyshare for nothing, this camera lets you share pictures right out the back of the camera using its exclusive share button, or transfer pictures at high speeds to your PC or other devices via the built-in USB 2.0 connection. And with the included Easyshare software, you can organize your pictures to find them instantly, select from a variety of easy-to-use printing options, share pictures with family and friends, as well as get creative with or edit your pictures in a variety of ways. This compact unit weighs 10.6 ounces without batteries, and measures 4.1 x 2.9 x 2.7 inches (W x H x D).What's in the BoxThe Z612 Zoom digital camera, Kodak rechargeable Lithium-ion digital camera battery, Kodak Lithium-ion battery charger or equivalent, USB and AV cables, lens cap with strap, neck strap, Kodak Easyshare software, Getting Started kit, custom camera insert for optional Kodak Easyshare camera and printer docks.", "title": "Kodak Easyshare Z612 6.1 MP Digital Camera with 12xOptical Zoom", "price": 13.5, "salesRank": {"Camera &amp; Photo": 7283}, "imUrl": "http://ecx.images-amazon.com/images/I/41095ADCQ8L._SX300_.jpg", "related": {"also_viewed": ["B000H92BTM", "B000NOQVQK", "B004FLL53Q", "B00CLERWOU", "B008HVZY1E", "B0034XIMG4", "B0035JD0DW", "B00CD7URXI", "B0075SUIEI", "B005T6NJIA", "B004LB4SAM", "B0091TC3OC", "B00HV6KIA8", "B0091T97J6", "B005KG3NSK", "B006YP41I2", "B004MB9UMM", "B00HV6KI8U", "B003IHVEU2", "B004M8SVHK", "B00AWYMXZY", "B004M8SVGQ", "B00DTINK8O", "B000ENN9BK", "B008MB6YX6", "B002POBUKI", "B005I6DVC0", "B00B5MUJTO", "B005KG3NW6", "B0026JQ8AE", "B00HLDFRBQ", "B00ANQD52Q", "B00AQ2BWS6", "B000EMU888", "B000ARAPQW", "B00KOUIBZW", "B00ANCZO42", "B005MTMFHU", "B0084IKKX2", "B0075SUII4", "B00ETAU00C", "B00HQ4W3OE", "B00EFILR6E", "B004HO58NY", "B0007QKMQY", "B00726185Q", "B0021XW3YU", "B003VTZE1M", "B00B46XSC6"], "buy_after_viewing": ["B000H92BTM", "B0041PO1TG", "B005T6NJIA", "B002POBUKI"]}}