{"asin": "B000NK6INU", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Canon's iconic Elph design achieves a stunning new evolution with the PowerShot SD750 Digital Elph. Utterly simple edge lines and cut surfaces gleam subtly with high-grade finishes; now offered in a choice of silver or black and silver. Of course, style means little without substance, and here the SD750 Digital Elph more than delivers. 7.1 megapixels and DIGIC III create magnificent images, while exciting advanced technologies include Face Detection, Red-eye Correction, and time lapse movies. Always sized to go, the SD750 Digital Elph is now extra-durable, with a tough scratch-resistant coating on its anti-reflective, brilliantly colorful 3.0-inch LCD screen.PowerShot SD750 HighlightsStylish 7.1-megapixel Digital Elph with 3x optical zoomCertainly the PowerShot SD750 Digital Elph's design credentials and high-profile beauty are impossible to ignore. But a quick look beyond the iconic design reveals a camera seriously equipped for high-end performance.1x zoom/3x zoomThe 7.1-megapixel CCD captures an extraordinary level of detail. Enlarge and crop as far as your vision takes you - you'll have all the detail you need for sharp, rich prints.The camera's genuine Canon 3x optical zoom lens gives you all the benefits of Canon's legendary optics technologies along with the power to zoom in close. Expect clear, brilliant shots all through the zoom range.DIGIC III image processor with improved Face Detection technology and Red-eye CorrectionWith DIGIC III, you get images of superior quality, the camera functions at top efficiency and battery life is significantly enhanced. What's more, DIGIC III enables Canon's newly improved Face Detection technology and Red-eye Correction to give you better, more true-to-life people shots. Simply press the Shutter Button halfway down, and the PowerShot SD750 Digital Elph automatically pinpoints the faces in the scene and chooses the ideal focus point. To keep every face looking bright and natural - without scary red eyes - the camera controls exposure settings and flash, so every shot is just what you were shooting for.Face Detection AF/AEfinds multiple faces in the frame and sets the most suitable focus point when the shutter button is pressed halfway. And an additional new feature, Face Detection FE, adjusts the flash, based on a person's face on the screen. Exposure and flash are controlled to ensure proper illumination of both the faces and the overall scene, eliminating the common problem of darkened or overexposed faces.Face Detection in actionRed-Eye Correctiondetects and automatically corrects red-eye during playback for both regular and flash photography. In unusual cases where red-eye is not automatically detected, it can easily be corrected manually during playback mode from the LCD screen.iSAPS technologyis an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the fast DIGIC III image processor to improve focus speed and accuracy, as well as exposure and white balance.Extra-large, high-resolution 3.0-inch PureColor LCD with scratch-resistant anti-reflection coating for easy on-camera viewingThe camera's 3.0-inch LCD screen gives you the big picture, whether you're shooting, reviewing or showing off your images. This extra-durable, high-resolution screen with tough scratch-resistant coating on the anti-reflective, PureColor LCD screen offers a crisp, clear picture to make shooting, playback and using the camera's menu functions especially convenient. Clear and bright, it also features Night Display for easy viewing in low light.ISO 1600 and High ISO Auto to reduce image blur and expand low-light shooting capabilityThe PowerShot SD750 Digital Elph features new ISO 1600 and High ISO Auto settings that reduce the effects of camera shake and sharpen subjects in low-light situations, giving you greater flexibility for shooting.Five movie modes including 30 fps VGA, Time Lapse and Fast Frame RateWith a highly flexible movie mode, you can create the movie that's perfect for any application. Select from VGA (640 x 480 pixels) and QVGA (320 x 240 pixels), with frame rates of 30 fps and 15 fps for recording up to 1 hour or 4GB. Also choose from Fast Frame Rate (QVGA; 320 x 240 pixels) recording at 60 fps for up to 1 minute, Compact Movie Mode (QQVGA; 160 x 120 pixels) recording at 15 fps for up to 3 minutes, and Time Lapse (640 x 480) recording at 1 or 2 sec. intervals. The PowerShot SD750 Digital Elph supports the USB 2.0 Hi-Speed standard, so you'll enjoy the fastest possible data transfer speeds when using a USB 2.0 Hi-Speed compatible computer.Print/Share button for easy direct printing and downloadingThe PowerShot SD750 Digital Elph's Print/Share button makes direct printing easier than ever. Simply connect the SD750 Digital Elph to a Canon CP, Selphy or Pixma photo printer or any PictBridge compatible photo printer, press the lighted Print/Share button and print! Also use the Print/Share button to transfer images to a computer (Windows and Macintosh).Print your own ID photos in 28 different sizes or use the Movie Print function to output multiple stills from a recorded movie on a single sheet with a Canon Selphy compact photo printer.Direct photo printersFor desktop large-format printing, try one of the direct photo printers that allow you to print without a computer in one of two ways: plug your compatible PowerShot camera into the direct photo printer using the supplied USB interface cable, or simply insert a memory card into the supplied adapter. You can also connect the printer to your computer for more options. Print high-resolution, borderless images as postcards or 8.5 x 11-inch sheets within minutes.Compact photo printersCompact photo printers let you produce versatile, fun 4 x 6-inch postcards, 4 x 8-inch wide greeting cards or credit card size prints in just two easy steps: connect and press/print. Control the printer right from your camera's LCD screen. You get durable, dye-sublimated prints quickly with or without borders. Assorted paper types let you create mini or credit card size labels. You can even take select compact photo printers to a party or an outdoor picnic using an optional rechargeable battery.", "title": "Canon PowerShot SD750 7.1MP Digital Elph Camera with 3x Optical Zoom (Black)", "price": 6.39, "salesRank": {"Camera &amp; Photo": 6445}, "imUrl": "http://ecx.images-amazon.com/images/I/412e2GGXKIL._SX300_.jpg", "related": {"also_viewed": ["B000NK8EWI", "B001SER48S", "B0012YC7AE", "B0011ZK6PC", "B006UMM1AY", "B005II5OLY", "B000EN0K94", "B001SER492", "B000NK8L6W", "B000ENPDSW", "B00B5HE3YG", "B0015DPJ5W", "B00B5HE3AK", "B0012Y6AY8", "B0075T7NW2", "B00HLDFPA4", "B006UMM1F4", "B006UMM1J0", "B0075SUHKI", "B0012Y6958", "B006UMM15O", "B0036STI56", "B00B5HE3IW", "B006UMM23A", "B002AQ7GO0", "B006UMM1UO", "B00AWYN0ME", "B00B5HE32I", "B004J3V8UU", "B000AYGDIO", "B00B5HE3UU", "B0075SUJ4W", "B0076W0LNQ", "B00BW6LTG0", "B0075SUHWG", "B0007TJ5AK", "B00HLDIDVM", "B00AWYN0BU", "B00AWYN182", "B0011ZCDKS", "B00AWYMXZY", "B00C7NX3MK", "B00EFILSOU", "B0075SUJQK", "B00B5HE45E", "B0075SUFLE", "B000Q30420", "B00I58LZ80", "B0011ZK6OS", "B001SER49M", "B0075SUJBA", "B006UMM1PO", "B0012Y84AG", "B0075SUK14", "B004HW73QG", "B00HLDFQU8"], "buy_after_viewing": ["B002AQ7GO0", "B00065L5TE", "B0036STI56", "B003VNKNF0"]}}