{"asin": "B002RRLQIO", "categories": [["Video Games", "PC", "Accessories", "Gaming Keyboards"]], "description": "The Logitech Gaming Keyboard G110. Time to step up your game.Ready to step up your game? With the Logitech Gaming Keyboard G110 on your side, you've got what you need to play faster, better and longer. Designed for serious gamers, this keyboard puts customizable controls right where you need them. Locate the correct keys&mdash;even in the dark&mdash;with backlighting colors you can select and assign. You also have 12 programmable G-keys to help you execute complex commands more rapidly than your opponents. Whether you're running an epic raid or fragging an enemy soldier, the competition is no match for you and your Logitech Gaming Keyboard G110.Key FeaturesBacklit customizable key colorsLeading a late-night raid in the dark? Locate the correct keys without a second thought, thanks to backlit LED characters in assignable custom colors. Set up your keys in shades of red, blue and purple, plus your choice of light intensities.Headset-ready USB audioIt's a pain hunting for the headphone and microphone jacks behind your computer when you want to use a headset. With the G110, just plug your headset into the keyboard and you'll be strategizing with teammates and trash talking to enemies with crystal clear USB audio.12 fully programmable G-keys with three macros eachSpeed up your response time by pre-setting up to 36 time-slashing commands per game, including single keystrokes or complex macros. Want to add new macros on the fly? The MR key makes it a snap.High-speed USB 2.0 portPlug in your flash drive for lightening-fast data transfers or to quickly connect your high-performance gaming mouse.Handy game mode switchNever get dropped out of the game because you accidently pressed the Windows/Context menu keys. The game/desktop mode switch disables them instantly so your game won't be interrupted until you're ready to call it quits.Check out the G-SERIES&nbsp;&nbsp;from Logitech:", "title": "Logitech Gaming Keyboard G110", "price": 39.5, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41rVmSf993L._SX300_.jpg", "related": {"also_bought": ["B002J9GDXI", "B0055QZ216", "B002Q4U5DK", "B003VAM32E", "B001NTFATI", "B005EWB3AU", "B000UEZ36W", "B006ZS5ATM", "B007SZ0E1K", "B004AM5RAW", "B0036Q7MV0", "B003VANOFY", "B0086UK7IQ", "B005QUQP76", "B007SZ0EOW", "B005TEPB74", "B003ZM7YTA", "B0033Z2BAQ", "B005CPGHAA", "B007VPZR5U", "B004Q0PT3I", "B002R0DX1E", "B004RFBIUU", "B001O5CCQK", "B0051U7HMS", "B0083Y6MV6", "B004CRSM4I", "B004W2JKZI", "B006EWUO22", "B005O65JXI", "B005S0KHIC", "B0036WTBFY", "B007RIFKUS", "B004LB5AZY", "B004MR3QY4", "B001NEK2GE", "B004MYFODI", "B002I3OZB2", "B003S68Q0Y", "B000OGX5AM", "B006WVVA28", "B007R21JJK", "B007G51UWY", "B0026ZPFCK", "B002R0DX0K", "B000UVRU6G", "B001TOQ8X4", "B0080I06WQ", "B007KTY4A6", "B003DKJ44C", "B002LE8BJA", "B005EQE0YM", "B004QRKWLA", "B004EBUXHQ", "B001IZ7MHU", "B00BFOEY3Y", "B0050SYX8W", "B008SBX6GI", "B003DW0GO2", "B006Q67A5U", "B00AAQRNQ8", "B005E98FVS", "B000UEZ37G", "B004QBUL1C", "B002XLR0JI", "B004WK3KKQ", "B008OQTUKS", "B004AM5RB6", "B00CJD4HD2", "B002YIG9AQ", "B003O8J11E", "B005T3GRN2", "B0057FRTPW", "B007KC1R3A", "B003VAK16O", "B001LYWBOM", "B007R1FH3K", "B006W41W7S", "B006B7R9PU", "B001PTH0VW", "B004H1T2DY", "B0088PUEPK", "B002SRQ214", "B002DHGMK0", "B003PJ6QW4", "B001TH7T2U", "B003ZMF26W", "B004W2JL2A", "B000HZFCT2", "B00461LT6S", "B0026FCI2U", "B004W2T2UQ"], "buy_after_viewing": ["B00BBUCCKO", "B009C98NPY", "B000UEZ36W", "B00BCEK2LU"]}}