{"asin": "B000W6EUOE", "description": "Amazon.com Product Description -- November 11, 2007 In the U.S., German-basedNavigon may be the biggest name in GPS you've never heard. Navigon has long been a major provider of navigation software to automotive manufacturers for in-dash gps navigation devices, but only recently did they introduce portable navigation devices under their own name. What they offer up, however, demonstrates immediately that this is a company that knows navigation inside and out.The 2100 is the lowest-priced (and smallest) of Navigon's line of portable GPS navigators. While it lacks some of the features of it's bigger siblings, the7100and 5100, it packs solid navigation and some unique features&nbsp; into its diminutive frame.The Navigon Family of Portable NavigatorsThe 2100 and 5100 have 3.5-inch screens, while the 7100 has a 4.3-inch widescreen. The big difference is that the 5100 and7100come with free lifetime traffic data,&nbsp; while with the 2100 you have to buy an activation code separately. The 5100 and7100have a feature called \"Lane Assistant\" that will suggest which lane you should be driving in, but that's not such a big deal. Another important difference is that the 7100 also adds bluetooth-capability for hands-free mobile phone integration, which is really handy. If you want that feature, do check out the7100. This chart may help as well.Screen Size (diagonally)BluetoothLifetime Traffic Data ServiceLane AssistantReality ViewZagat RatingsPOIs21003.5 inchesRequires Purchase of Activation Code1.3 million51003.5 inchesIncluded Freemillions71004.3 inchesIncluded FreemillionsIntuitive, animated menus offer predictive text input, helping you select your destination quickly.View larger.The reality view guides you with photo-realistic 3D images of junctions.View larger.Navigon decided not to try to add multimedia features like a photo viewer or MP3 player into its devices, but instead focused on navigation-based features. The 2100 provides precise turn-by-turn directions, including spoken road names via text-to-speechReality view guides you with photo-realistic 3D images of junctions, complete with actual sign text and exit ramp guidance. This makes translating what the navigator is telling you to what you see on the road instantaneous.Superior Software and HardwareThe features and functions of the Navigon 2100 are controlled via intuitive, easy-to-use animated menus that use predictive text input to quickly and easily select your city, state and address. Maps and menus appear on its extra-large and elegant, high-contrast 3.5-inch, full-color touch-screen display. The 5100 includes a powerful Samsung 400 MHz processor, a fully integrated SiRF Star III GPS chip, 64 MBs of both RAM and ROM built in, and a rechargeable 1,200 mAh lithium ion battery that is rated for 4.5 hours of continuous use. All this is housed in an ultra-thin, sleek chrome housing that weighs only 6.3 ounces, and measures just 4.2 x 3.3 x 0.9 inches (W x H x D). The Navigon 5200 even comes pre-loaded with complete maps of the U.S. and Canada, providing you with superbly accurate, seamless door-to-door directions wherever your vehicular travels might take you.Note that the 2100 runs on the Microsoft Windows CD Net 5.0 operating system. A PC is required to use additional map data, and in such cases users require Windows 2000, ME, XP or higher, as well as a CD ROM drive and a USB port. An SD/MMC card reader is recommended as the 7100 not only uses SD cards, but also comes with a 2 GB SD card in the package.What's in the BoxNavigon 2100 GPS Navigator,SD card preloaded with software and maps of the continental US, rechargeable 1150 mAH lithium ion battery (rated for up to 4.5 hours),car charger,car mount, quickstart guide, limited warrantyAbout NavigonNAVIGON has been a leader ofGPSnavigation since 1991, and has a long history of industry innovations. NAVIGON created the world's first dynamic personalGPSproduct in 1996, launched the industry's first navigation software for thePocket PCin 2000, and unveiled the first Traffic Message Channel-based (TMC) avoidance feature on mobile navigation product in 2002.NAVIGON has helped revolutionize how consumers get from place to place with software products for practically any navigation-ready hardware. Personal navigation devices (PND), smartphones, and in-dash navigation systems directed by NAVIGON's award-winning MobileNavigator(MN) software delivers reliable information on millions of destinations in an intuitive, easy to use format. NAVIGON is a valued partner to the automotive industry, and in 2006 strengthened its category competency by acquiring NAVTEQ's navigation software business.NAVIGON is a privately-held software company based in Hamburg, Germany, with NAVIGON USA headquarters in Chicago, IL.END i18nPage - contentFrame - right - content - textBEGIN i18nPage - contentFrame - right - content - teasersBEGIN nullBEGIN null", "title": "Navigon 2100 3.5-Inch Portable GPS Navigator", "price": 1.89, "imUrl": "http://ecx.images-amazon.com/images/I/51iACDzmRzL._SY300_.jpg", "related": {"also_bought": ["B000WXQTBO", "B00280D390", "B000WXXINQ", "B002KO4W12", "B001V67SQ6"], "buy_after_viewing": ["B00280D390", "B0057ODG6Y", "B0015EWMX8", "B0028JPEVG"]}, "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]]}