{"asin": "B003EYVEUO", "description": "More than just a supportive cushion for your notebook computer, the Philips SDC5100/27 CushionSpeaker connects via USB to your notebook and delivers exceptional sound through its built-in speakers. Enjoy full digital stereo while you listen to music or watch a video--all with your notebook securely supported on the CushionSpeaker. The hardtop surface of the CushionSpeaker allows airflow for your notebook and protects you from its heat, while the beanbag padding feels soft and comfortable on your lap.Other notebook accessories you might like:Philips Notebook HeadsetPhilips Notebook SleeveDelivers exceptional digital audio to help you get the most out of your music playlists, videos, and movies.View larger.With beanbag-style padding that cushions your lap and a non-slip strip that keeps your notebook in place.View larger.Built-in Speakers Deliver Digital Stereo SoundWith built-in stereo speakers, the Philips SDC5100/27 CushionSpeaker delivers exceptional digital audio to help you get the most out of your music playlists, videos, and movies. Enjoy enhanced audio while you work--or just relax--with your notebook resting securely on the CushionSpeaker in your lap.Keeps You Cool and ComfortableThe innovative CushionSpeaker features a hardtop surface that provides both airflow to reduce the heat build-up of your notebook and protects you from any heat your notebook generates. With beanbag-style padding that cushions your lap and a non-slip strip that keeps your notebook in place, you'll be cool and comfortable for hours.Convenience of Plug and PlayWith the convenience of plug and play, your notebook will automatically recognize the CushionSpeaker as a removable USB mass storage device. Simply connect the speaker to an available USB port and you're ready to hear exceptional audio--no batteries or adapters required. Also, the USB cable is retractable, so it stores easily and won't get tangled.Mac and PC CompatibleThe CushionSpeaker is compatible with Windows Vista, Windows XP; Mac OSX 10.2.8 and above.Winner of the Red Dot Award for DesignThe CushionSpeaker is the recipient of the 2010 red dot award for design. The red dot award recognizes the best in design and business, and is an internationally recognized award for excellence in high quality design. It is the largest and most renowned design competition in the world--there were over 12,000 submissions from more than 60 different countries in 2010. The products are judged on degree of innovation, functionality, ergonomics, self-explanatory quality, formal quality, ecological compatibility, durability, symbolic and emotional content, and product periphery.About PhilipsPhilips has a brand promise of \"sense and simplicity\" that encapsulates their commitment to understanding and catering to the desires and needs of consumers and customers. By putting end users front and center, Philips creates innovative products that are designed around people's needs and aspirations, and are both advanced and easy to use. With 60,000 registered patents, Philips is a global leader in innovation, and receives numerous international design awards every year.The Philips SDC5100/27 CushionSpeaker is backed by a one-year limited warranty.What's in the BoxPhilips SDC5100/27 CushionSpeaker, retractable USB cable, and Quick Start Guide.Notebook and Multimedia SpeakersNotebook CushionSpeakerNotebook SoundBarNotebook USB SpeakersMultimedia Speakers 2.0Multimedia Speakers 2.0Multimedia Speakers 2.0Multimedia Speakers 2.0Multimedia Speakers 2.1Multimedia Speakers 2.1Frequency response100-18,000 Hz&nbsp;&nbsp;&nbsp;100-18,000 Hz85-20,0000 Hz62-20,000 Hz at 10 dB Hz&nbsp;35 - 20,000 HzBass enhancement&nbsp;Bass reflexBass BoostBass reflex&nbsp;Analog Bass Boost, Bass reflexDynamic Bass BoostBass reflexAnalog Bass Boost, Bass reflexWatts&nbsp;&nbsp;&nbsp;10 W&nbsp;10 W40 W44 W20 WSpeaker Drivers&nbsp;&nbsp;2\"2\"x2\"&nbsp;2\"x3\"3/4\" tweeter, 3\"2.5\"2.5\"Subwoofer&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10 W5 WAudio Input&nbsp;&nbsp;3.5-mm stereo3.5-mm stereo3.5-mm stereo3.5-mm stereo3.5-mm stereo3.5-mm stereo3.5-mm stereoPlug and PlayUSB 2.0USB 2.0USB 2.0&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;", "title": "Philips SDC5100/27 CushionSpeaker", "price": 18.99, "imUrl": "http://ecx.images-amazon.com/images/I/3132VKlKWgL._SX300_.jpg", "related": {"buy_after_viewing": ["B0016HW2CA", "B0043TV8QO", "B0002BK7KU", "B007R9RUPU"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]]}