{"asin": "B002P3F5D2", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "See it, shoot it, and share it--all in high definition. Creative Lab's third generation Vado HD Pocket Video Camera (Black) makes it easier than ever to record outstanding video in 720p high-definition quality. Featuring a new, ultra-stylish design, the Vado HD is slim enough to fit in your pocket, yet its 4 GB memory capacity holds up to 120 minutes of widescreen HD-quality video. With instant one-touch recording and included Vado Central 3.0 software, you'll be watching, sharing, and editing outstanding video with ease.Vado HD, 3rd GenerationAt a Glance:4 GB of memory for up to 120 minutes of HD quality video recordingVado Central 3.0 software for easy video posts to Facebook, YouTube, and moreBuilt-in USB cableOne-click video upload support for:The small, stylish Vado HD lets you record up to two hours of HD video.Capture Life in Gorgeous HDThe Vado HD features a unique high-quality lens that lets you capture widescreen HD-quality video in up to 1280 x 720p. It can also take still photos--simply switch into photo mode to capture HD-quality still photos. With 4GB of onboard memory, the Vado HD can hold up to 2 hours of HD video or up to 7000 HD still captures. Because it records in the H.264 and AAC recording formats, you'll get outstanding video quality at ultra-efficient file sizes.Other cutting-edge features include a wide-angle lens that lets you capture more action than other cameras, plus you have full control over manual exposure adjustments, so you can adjust for great video quality no matter if the scene is brightly lit or dim. For recording and instant playback, a bright two-inch LCD screen provides crisp visuals.Vado Central Software Makes it Easy to ShareWith the included Vado Central 3.0 software, you'll have an easy way to view, share, and even edit your videos. The software's user-friendly layout provides you with a clean, organized view of all your videos, as well as quick access to relevant functions such as copying, sharing, and emailing. Creative has made posting videos to websites such as Facebook, YouTube, Photobucket, or Box.net as simple as a single mouse click. Now you can take videos during your vacation and load them onto your Facebook page on the fly.Vado Central 3.0 also includes basic video editing capabilities so you can quickly polish your videos before posting them. The software's trimming function lets you delete raw footage by choosing new starting and ending points for a clip, and then saving the improved version. And since the Vado HD takes videos in standard video formats, you can easily export them to programs such as iMovie and Movie Maker for more advanced editing options.The included Vado Central 3.0 software for both PC (pictured above) and Mac (below) makes posting videos to Facebook and YouTube as easy as clicking a button.Compact, Stylish Design with Rechargeable BatteryWith its glossy black looks and sleek, slim, portable design, the Vado HD ensures that you'll never miss a shot, no matter where you are. The Lithium-ion battery offers up to 2 hours of recording and playback, and is easily recharged via the built-in USB. For added convenience, the removable battery gives you the option of carrying a spare for extended recording and playback.HDMI Output for Easy ViewingWith the Vado HD, video playback is simple, even when you're away from your computer. Simply connect your Vado HD to an HDTV with an HDMI cable (sold separately) and you'll be enjoying your videos in 720p HD quality.Built-In USB CableThanks to Creative Labs' smart design, the Vado HD's flexible, pull-out USB cable is built into the camera so it's always accessible. Connect it to your PC or Mac no matter where you are and you'll be sharing your videos in no time.Multi-Function Port for Extra FlexibilityWith a multi-function port built into the Vado HD, you'll have added flexibility when it comes to recording and playback. For improved audio, a stereo microphone can be connected to better capture sound during recording. For private listening in a public place, you can plug in a pair of headphones. And for playback, you can connect an analog AV cable to output videos onto a non-HDMI display.The Vado HD is compatible with both Macs (Mac OS X 10.4 and later) and PCs (Windows 7, Vista, or XP (SP2)).The Creative Labs Vado HD Pocket Video Camera is backed by a one-year limited warranty.What's in the BoxVado HD video camera, rechargeable Lithium-ion battery, and quick start guide.Accessories for your Vado HDLithium Ion BatteryRechargeable Battery ChargerWaterproof PouchMesh PouchTripod", "title": "VADO VF0624 Camcorder with 2x Optical Zoom and 2-inch LCD Screen - PURPLE", "price": 289.9, "salesRank": {"Camera &amp; Photo": 9349}, "imUrl": "http://ecx.images-amazon.com/images/I/512ilhZgC1L._SY300_.jpg", "related": {"also_bought": ["B0045DR7UE", "B001I44YCC", "B00009W3TY", "189298959X", "B0032GS5OM", "B001SHNEF2", "0325000514", "0131367277", "0325002991", "0325003106", "0814113176", "B002651ZZG", "0415801516", "B002T45WXA", "0756965616", "1571100881"], "buy_after_viewing": ["B004FLL5BI", "B002NXGP6U", "B001I44YCC", "B003VNKNF0"]}}