{"asin": "B001TORSHO", "description": "Get ready toShiftyour game into high gear! Designed to deliver a true driver's experience that reflects contemporary motorsports,Need for Speed: Shiftis built by racers for racers.Need for Speed: Shiftdelivers an authentic and immersive driving experience, replicating the true feeling of racing high-end performance cars like never before. Players are thrust into the heart of the action with immersive and exciting features including a stunningly realistic first-person cockpit view camera and an all-new crash mechanic, providing an unrivaled sensation of the speed and feeling of racing a car on the extreme edge of control..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }A true high-end racing experience.View larger.Imagine the experience of being a race driver. The adrenaline rush of driving at breakneck speeds, the pressure of fierce competition, the fear of losing control, the intense concentration and athleticism needed to harness the power of speeding chrome and steel. This is the true driver&rsquo;s experience ofNeed for Speed: Shift. Through the combination of perception-based G-forces, an ultra-realistic first-person cockpit view, an accurate, accessible physics-based model and the all-new, brutally disorienting crash dynamic, you'll be thrust into the driver&rsquo;s seat amid the chaotic noise, intensity, and physical and emotional demands of the race. Imagine the emotions race drivers go through. The thrill of driving incredibly fast, the pressure of the competition, the fear of losing control, the intense concentration and effort needed to harness the power of a racing car. The all-new driver profile is the ultimate extension of the true driver&rsquo;s experience. This system gives each player a unique persona based on a player&rsquo;s driving skill and style - aggressive or precise. Driver profile impacts how a player unlocks cars, overall career progression and online matchmaking. InNeed for Speed: Shift, how you drive is who you are behind the wheel.For Racers By RacersInNeed for Speed: Shift, EA has brought together some of the world's best racing game talent and real race drivers. Developed in a unique collaboration between Slightly Mad Studios--developers and designers of the critically acclaimedGT LegendsandGTR2games--Michael Mann (executive producer at Black Box) and Patrick Soderlund, senior Vice President of EA Games and part of a racing team that recently competed in the fourth edition of the TOYO Tires 24H Dubai 2009, the result is an authentic driving experience unmatched on any game system.Additional Screenshots:", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/5173Pi%2BEFZL._SY300_.jpg", "related": {"also_bought": ["B00488PZ2S", "B000RI17CA", "B001AZFSEW", "B000JHMJDA", "B003O6ECOM", "B00149V3CU", "B003R7H5TC", "B000FPOJOS", "B0050SWSQQ", "B000JLIYLC", "B006JKARN0", "B002MED6EO", "B000HCMR8E", "B00BJ60LEY", "B004Q8L46G", "B000MUW98O", "B00CTKHZH0", "B001UEN68I", "B003O65TXU", "B002ACFYUM", "B0012N5MIO", "B0056WJA4E", "B0016GABR4", "B000MIP72G", "B000FII8KQ", "B0033PKTCS", "B002I0K6DG", "B004NRN5DA", "B002AQLQM8", "B002BCVFRM", "B003UT9XI8", "B002BSA1C6", "B001AWDFUY", "B008BT80O0", "B000QL0T36", "B003O680ZY", "B00170BV6E", "B000HXDKA2", "B000M4KJ32", "B00BU7WVCM", "B00CRL9TU2", "B0017ZIIK6", "B000G0OJJ2", "B001C4DKG4", "B00JC9SWSC", "B0050SXJXW", "B004UDB9SA", "B005JQ05KA", "B003MUNFW0", "B00JXDJVHS", "B004EQCCI4", "B0093FO2TS", "B000WS97QI", "B001OAKV1S", "B000WOG8N2", "B000IONGWW", "B004K7AOYG", "B003IEBO9Q", "B000GA73O0", "B001C4E0G8", "B004DI5H26", "B0015AARJI", "B002I0J51U", "B0017XFP8G", "B003C1I06U", "B008277M36"], "bought_together": ["B00488PZ2S", "B0050SWSQQ"], "buy_after_viewing": ["B0050SWSQQ", "B003R7H5TC", "B002MED6EO", "B006JKARN0"]}, "salesRank": {"Video Games": 6882}, "categories": [["Video Games", "Kids & Family", "PlayStation 3", "Games"], ["Video Games", "PlayStation 3", "Games"]]}