{"asin": "B0018NWQPK", "categories": [["Electronics", "Computers & Accessories", "Laptop & Netbook Computer Accessories", "Batteries"]], "description": "Ditch your landline service with the XLink BTTN Bluetooth Device, without losing the use of your corded or cordless phone system at home or in your office. Almost any cell phone with Bluetooth wireless technology will work with XLink. The XLink family of products make it possible to send and receive cell phone calls using regular telephones. No more searching for your cell phones - just use regular phones at home or in the office. The XLink can simultaneously connect to three different cell phones - one for each family member. As many standard telephones as desired can be plugged into the back of the XLink. Whenever any of the connected cell phones ring, all the standard telephones ring also. You can also combine your home phone service plus cellular service into one device. Let the XLink BTTN manage your inbound and outbound calls between your phone company and cellular service provider. Caller ID Call Waiting Voice Dialing Speed Dialing Voicemail Access Automatic and Manual Dialing Echo Cancellation Telephone Connector Upgradeable Global Design Suitable for VOIP Gateway/Channel Bank Applications USB 2.0 port Bluetooth - Compliance to class 2 power, Minimum V1.1; Handsfree profile; Output power 0dBm; Frequency 2.4 GHz. Power Adapter Input Voltage: 100V-240V. Output Voltage: 9V. Worldwide use. NOTE: Cell phone network providers do not support FAX, Modem, Satellite TV, Tivo, Credit Card Processor or 911 caller location. This services will function only with active Land Line Phone Service.", "title": "Xtreme Technologies Xlink BTTN Bluetooth Gateway-Black", "price": 65.92, "imUrl": "http://ecx.images-amazon.com/images/I/41uWaHXVvVL._SY300_.jpg", "brand": "Xtreme Technologies", "related": {"also_bought": ["B00135XU7Q", "B000071NYD", "B0043D2IBE", "B002QAUN2M", "B002H29TGA", "B002MUAIP8", "B0015AB3LO", "B002XA8XNQ", "B003DMIGQC", "B001KGSJ74", "B00007M1TZ", "B005T3GRLY"], "bought_together": ["B0043D2IBE", "B000071NYD"], "buy_after_viewing": ["B00135XU7Q", "B0043D2IBE", "B00A0X9X00", "B00BP7SW0C"]}}