{"asin": "B000VAKI60", "description": "Rock with your favorite music, watch crystal clear full-motion video and enjoy your photos on a beautiful color-rich screen with the NWZ-A818BLK Walkman Video MP3 player. The slim-line player lets you see it all on its high-resolution 2\" QVGA LCD screen. Small enough to slip into a bag or pocket, the 8GB NWZ-S818BLK Walkman Video MP3 player can store up to 5,050 songs, 30 hours of video or hundreds of photographs, giving you the delight of multimedia entertainment anytime, anyplace. Also available in silver.8GB Built-in MemoryStore up to 5,050 Songs or up to 30H 40M of video on your Walkman video MP3 Player and never be without your entertainment again.High Quality Video PlaybackPlayback your favorite videos right on the player using MPEG 4 and M4V profile at 30 frames per second.Battery LifeWith up to 33 hours of audio playback and up to 8 hours of video playback you don't have to worry about charging your player.2.0\" QVGA LCD ScreenEasily view your movies, photos and music information on the high quality, 320x240 display.Compatible with Secure Windows Media AudioGiving you more options than ever for downloading and listening to music.MP3/WMA/AAC Audio Codec SupportSupports playback of MP3 and WMA DRM and non-DRM audio files downloaded from multiple sources. Also supports non-DRM AAC content, giving you multiple options for downloading music the way you want.4 Clear Audio TechnologiesDigital Sound Enhancement Engine(DSEE), Clear Bass, Clear Stereo and EX Series Headphones give an enhanced listening experience. Clear Bass enahnces the bass sound, minimizing distortion while Clear Stereo reduces the leaking from one channel to another. DSEE restores the higher sound frequency lost when creating compressed music files, thus reproducing a sound quality closer to the original CD quality.Time Machine ShuffleShuffle play among songs from a randomly selected year. (Information will come from CD information that is downloaded from the Gracenote CDDB)Music SearchSearch for music on your Walkman video player by All Songs, Album, Artist, Genre, Release Year, Folder and Playlists.Initial SearchUse the first letter of the song, album or artist to easily find the music you are looking for.Bi-Directional LCD DisplayWatch your videos and view your photographs either vertically or horizontally by adjusting the screen to the orientation you prefer.What's in the BoxNWZ-A818BLK Walkman Video MP3 player, USB Cable (22 pin to USB), MDR-EX082 Headphones and extension cord, CD-ROM with Windows Media Player 11 and MP3 Conversion Tools, Quick Start Guide, Adaptor Plate (for optional 22 pin cradle).", "title": "Sony 8 GB Walkman Video MP3 Player (Black)", "price": 34.99, "imUrl": "http://ecx.images-amazon.com/images/I/41BmIZ9lU-L._SY300_.jpg", "related": {"also_viewed": ["B009RQW3BC", "B00ECQUY2M", "B00ECRPOKS", "B001F50UIQ", "B00ECRRB8G", "B00ECRRWTE", "B009RQEDXS", "B00EE1H7BQ", "B005EQSB2E", "B001F50UJA", "B002IPHA1W", "B003Z3NGTG", "B000WFZSBE", "B002IPHA3U", "B001BM79JQ", "B002JPITXY", "B001F50UHM", "B001EQ0HAW", "B000ETTFRG", "B002MAPS6W", "B005ER3SCG", "B005FPT5DS", "B004M8ST5O", "B003D2FOOE", "B000VAH8OU", "B005EQS8RM", "B002MAPT7U", "B0035PBHX6", "B008V99972", "B008V998MI", "B00400TGEC", "B001EWDFCI", "B002MAPRYU", "B000VAIMF4", "B00CE3YJCQ", "B0085YLBVK", "B007BGGEOC", "B000EPLP3C", "B004M8STFY", "B002MAPSC6", "B000CS7U1C", "B003ZUGKHY", "B0076HNNHM", "B002IPHA4O", "B00005QBUU"], "buy_after_viewing": ["B002MAPT7U", "B009RQW3BC", "B00ECQUY2M", "B00ECRPOKS"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}