{"asin": "B0001XMA6I", "description": "Star Wars Battlefront, an intense open-ended multiplayer action game set in the Star Wars universe, puts fans and gamers in the heat of the action as they re-live all of the epic battles from the classic and prequel eras of the Star Wars universe.Players participate in the most memorable Star Wars battles set in more than 15 environments across 10 diverse planets including Hoth, Geonosis, Yavin, Tatooine and Naboo. Select one of over 20 different soldier types from four factions: Rebel Alliance, Imperial Army, Clone Army and Droid Army. Each soldier has specialized abilities and the freedom to use ground-based turrets found on the battlefront, as well as more than 15 diverse ground and air vehicles including the AT-ST, X-wing and speeder bike.Star Wars Battlefront PC online play. PC gamers can battle against 32 players over the Internet or 64 via a LAN. The game supports voice chat through headsets.In addition to the single-player and various multiplayer modes offered in Star Wars Battlefront, a unique \"Conquest\" mode adds an innovative and strategic gameplay element to the action. After each battle is completed and the planet is conquered, the winning team will be rewarded with a special \"bonus\" ability that can be deployed in future battles in an attempt to take over the Star Wars galaxy planet-by-planet.", "price": 49.99, "imUrl": "http://ecx.images-amazon.com/images/I/513TPZB08NL._SY300_.jpg", "related": {"also_bought": ["B000AAL4HI", "B000VV9T7S", "B000W2MX42", "B004A7FYX2", "B0001XM2HU", "B000BD6AJG", "B003O2182A", "B000VVEMXY", "B000SOYG8U", "B00006IR62", "B000B63RSA", "B000BNKSVC", "B00005LABK", "B00027CXEM", "B00022Q0RI", "B002LHSGSI", "B001CWXAP2", "B000Q6ZLKM", "B000NV8F58", "B000922E0S", "B0007SL202", "B002ABZE8U", "B0000A2MCN", "B000067DPN", "B0088MVOT8", "B002BXKJA0", "B00009TW6R", "B004QRKWLA", "0553564927", "B002L16OMO", "0553560719", "B0007GBBHI"], "bought_together": ["B000AAL4HI", "B000VV9T7S"], "buy_after_viewing": ["B000AAL4HI", "B000VVEMXY", "B000W2MX42", "B004A7FYX2"]}, "salesRank": {"Video Games": 10360}, "categories": [["Video Games", "PC", "Games"]]}