{"asin": "B002OB4BK8", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]], "description": "Perfect for your bedroom, kitchen, or living room, the ICF-CS10iP speaker dock and clock radio is a great way to listen to your favorite iPod or iPhone tunes. A dual alarm lets you set two separate wake-up times with the option of waking up to the music stored on your iPhone or iPod, the radio, or buzzer. Additional features include a large, easy-to-read LCD and a remote control that lets you access your music from across the room.An iPod dock alarm clock with dual alarms, AM/FM radio, and more.A great way to listen to your favorite iPod or iPhone tunes.Includes Sony \"Remote Commander\" remote control.Dual Alarm with iPod, Radio, or BuzzerSet two separate wake times and enjoy waking up to your iPod/iPhone, radio, or buzzer. \"7-5-2\" alarm settings allow for different wake times on weekdays and weekends, and a programmable snooze time (up to 60 minutes) lets you delay the inevitable with a few more minutes of sweet slumber.Pop in a CR2032 battery and you'll also have battery backup, to make sure you don't miss your alarm in the event of a power outage.Sleep TimerThe sleep timer lets you drift off to your favorite tunes on iPod or radio, adjustable to 15, 30, 60, or 90 minutes.AM/FM RadioTune into that weather forecast, morning show, or traffic report quickly with 10 FM and five AM preset stations.Adjustable BrightnessThe LCD display features a brightness control to adjust to your liking, with three settings (high, medium, low).Sony SoundSony includes some of their audio technologies for enhancing your sound. Mega Xpand effectively expands the sound field, for a more \"surround\" experience. Mega Bass does just what it sounds like, enhancing the low-end, even at low listening levels.Auxiliary InputConnect non-docking iPod devices, CD players, and other MP3 players via the handy line-in jack.What's in the BoxSony ICF-CS10iP speaker dock, remote control, AC cord with AC adapter, audio-in cable, AM loop antenna, dock adapters, and documentation.", "title": "Sony ICF-CS10IP (Discontinued by Manufacturer)", "price": 66.99, "imUrl": "http://ecx.images-amazon.com/images/I/51slbsmmA7L._SY300_.jpg", "brand": "Sony", "related": {"also_viewed": ["B005GUAIJM", "B00BQ4HRG4", "B00BQ4HRE6", "B005GUAIBU", "B004E2K7UI", "B00H1ASWN4", "B002OB4BKI", "B003M8HWDA", "B001RB1XY8", "B004T0MW7Q", "B003DZ9Z78", "B002IT1BFO", "B00BQ4HROG", "B005KQ2O2G", "B001GNC7RY", "B009E6J78C", "B00KPGUJUK", "B004SKBJ5S", "B003E91RE2", "B0064XTQ98", "B001L9KMTI", "B000Z9UY2K", "B009CWRVH2", "B0040GWXG4", "B003LPUU92", "B00CMNZ058", "B0043M66XG", "B00171MWUM", "B003VWW3Q8", "B001S0JZKW", "B003VX1EF8", "B0040Z65VO", "B007JCNOHI", "B004OA6VZ0", "B004T1Y8G8", "B004NEUL2Q", "B005HY4UG4", "B003B82R4U", "B001RYK2Q0", "B00B4MDN1G", "B001FWXDZQ", "B008Q7HHIC", "B007PZYBSA", "B001GNC7RE", "B007BGGVAY", "B007KFEP04", "B00COHALOM", "B00JJY6S4U", "B00CB0M3WK", "B004I8WH7E", "B005AK04IS", "B0035FCWBC", "B004NBZAI4", "B004X69BFW"], "buy_after_viewing": ["B005GUAIJM", "B00BQ4HRG4", "B00BQ4HRG4", "B00BQ4HRE6", "B00BQ4HRE6", "B004T0MW7Q"]}}