{"asin": "B000FTLSR0", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Cameras"]], "description": "The Pentax K100D combines 6.1 effective megapixels with a host of advanced technologies including a Shake Reduction (SR) system to deliver high-quality digital SLR photography and user-friendly operation to all levels of photographers. The ease of use, advanced features, and attractive price also make the Pentax K100D digital SLR a perfect choice for users moving up from a point-and-shoot camera. Both the K100D and theK110Dreflect a new digital SLR naming system that references the reverse compatibility that each body has with the legacy of Pentax K-mount lenses.The Pentax-developed Shake Reduction (SR) system in the K100D effectively offers a two-stop advantage for sharp, blur-free images even under difficult shooting conditions, such as when using a telePhoto lens or shooting in low light without a flash. The SR mechanism is designed to minimize camera shake by oscillating the CCD image sensor vertically and horizontally at high speed using magnetic force, while adjusting the speed of oscillation in proportion to the amount of camera shake detected by a built-in sensor. As a result, the system does not require special anti-shake lenses and can be used with almost all existing Pentax interchangeable lenses.Features:Pentax-original Shake Reduction mechanism for sharp, blur-free imagesThe K100D features a Pentax-developed Shake Reduction (SR) system, which effectively reduces camera shake for sharp, blur-free images even under difficult shooting conditions, such as using a telePhoto lens, shooting in low light conditions without a supplementary flash illumination. The K100D SR mechanism is designed to minimize camera shake by oscillating the CCD image sensor vertically and horizontally at high speed using magnetic force, while adjusting the speed of oscillation in proportion to the amount of camera shake detected by a built-in sensor. This system does not require special anti-shake lenses and may be used with almost all existing Pentax interchangeable lenses. (Lenses compatible with this mechanism are: Pentax K-, KA-, KAF- and KAF2-mount lenses; screw-mount lenses (with an adapter); and 645- and 67-system lenses (with an adapter). Certain camera and/or lens functions may be disabled.)11-point wide-frame AF to capture off-center subjects in crisp focusThe sophisticated K100D SAFOX VIII autofocus system features 11 sensor points (with nine cross-type sensors) to automatically focus on the subject with utmost precision, even when it is positioned off center. The in-focus sensor point is automatically superimposed in red in the viewfinder for at-a-glance confirmation. This high-precision AF system offers a choice of two AF modes: the conventional single AF, and the continuous AF, which maintains focus on the moving subject as long as the shutter release button is pressed halfway down. (The continuous AF mode is selectable by the user only when P, Tv, Av, M, or B is selected as a shooting mode on the mode dial. This mode is automatically activated by the camera when the Auto Picture Program, or one of the Picture or Scene modes, is selected.)Auto sensitivity control up to ISO equivalent 3200The K100D features an auto sensitivity control function, which automatically sets the optimum standard output sensitivity--up to equivalent ISO of 3200, which is the highest automatic setting in its class--based on such data as the subject's brightness level and the lens focal length. Since this function allows the use of higher shutter speeds in poor lighting situations (such as indoor sports events and night scenes), it helps Photographers reduce camera shake and prevent blurred images.Auto Picture Mode for effortless point-and-shoot SLR PhotographyThe K100D offers the exclusive Pentax Auto Picture Mode, which automatically and instantly selects one of the four Picture modes--including Portrait, Landscape and Macro--by calculating various Photographic factors to assure optimum results. Since this advanced shooting mode takes away all the concerns about aperture, shutter-speed, white-balance, saturation, contrast and sharpness settings, the Photographer can concentrate on image composition and shutter opportunity.Large LCD monitor to facilitate image viewing and menu settingThe K100D incorporates a large 2.5-inch color LCD monitor on its back panel that offers a wide-view design that allows views from over 140 degrees vertically and horizontally, ensuring effortless image viewing even from a diagonal position. With a total of approximately 210,000 pixels, the monitor offers digital zooming of playback images up to 12 times for easy confirmation of the image's focusing status and details. The large monitor size allows for large letters, digits, and icons on the menu screens to facilitate menu confirmation and camera operations. In addition, the color scheme between the menu listings and the background is optimized for each menu screen to assure at-a-glance confirmation, even under varying shooting conditions.True-to-life, rich-gradation images assured by 6.1 effective megapixelsThe K100D features a large, high-performance 23.5mm x 15.7mm CCD as its image sensor, assuring the faithful reproduction of the desired Photographic intention in the resulting images--from images with beautiful out-of-focus backgrounds to those with edge-to-edge sharpness. Combining 6.1 effective megapixels with a high-performance imaging engine and advanced image-processing technologies, the K100D is designed to produce beautiful, true-to-life images that are rich in gradation. What's more, it offers a choice of two finishing touches of \"Natural\" or \"Bright\" to create a distinctive atmosphere.Super-compact, ultra-lightweight body, with outstanding rigidityWhile the K100D is designed to be compact and lightweight to enhance operability and portability, it also incorporates a newly developed stainless-steel chassis and a fiber-reinforced engineering plastic housing to reinforce its overall rigidity and durability.Bright, clear viewfinderThe K100D features a lightweight penta-mirror viewfinder, which combines Pentax finder optics and a Natural-Bright-Matte II focusing screen to deliver bright, clear subject image with a 0.85x magnification and a 96 percent field of view.Top shutter speed of 1/4000 secondThe K100D offers a top shutter speed of 1/4000 second to freeze fast-moving subjects and capture decisive moments and features a flash synchronization speed of 1/180 second and a bulb setting (B) for extended exposures.Continuous shooting at approximately 2.8 images per secondTo trace the movement of an active subject or capture a sequence of the subject's expressions, the K100D offers a continuous shooting mode that allows the Photographer to capture multiple images (up to five images at \"Best\" image quality in JPEG format) at a maximum speed of approximately 2.8 images per second.Upgraded standard software packageThe K100D's standard software package consists of the Pentax Photo Laboratory 3 that features the reliable Silkypix image-processing engine (developed by Ichikawa Soft Laboratory) for RAW data processing, and the Pentax Photo Browser 3, which offers faster data processing speed and better operability than the previous version and can convert RAW images to the DNG format. DNG is a public, archival format for digital camera raw data.Save-by-day Storage Capability on an SD memory cardImages may be stored in a standard format where all files are located in one folder, or the images can be stored in folders for each day of shooting automatically on an SD memory card.Additional camera body features:19 custom functions to personalize camera operationsSD memory card compatibilityEight distinctive Scene modes to accommodate specific subjects/applicationsChoice of two depth-of-field preview functions (digital/optical)Choice of 16-segment multi-pattern metering, center-weighted metering, and spot metering to accommodate various photographic applicationsNoise reduction mechanism to reduce digital noise during extended exposuresDual power source (two CR-V3 lithium batteries or four AA-size batteries)USB 2.0 (Hi-Speed) compatibility for speedy data transfer to PCChoice of image format between JPEG (Best, Better, or Good) and RAWFive digital filters (Black-and-white, Sepia, Slim, Soft, and Brightness) for easy editing of recorded imagesPictBridge compatibilityPentax 18-55mm f3.5-5.6 lens includedIdeal for beginners, the Pentax smc P-DA 18-55mm f3.5-5.6 lens provides a focal length covering a wide to moderate wide-angle range. Like all Pentax lenses, the smc P-DA 18-35mm f3.5-5.6 zoom lens is treated with Pentax's acclaimed smc coating for maximum light transmission, sharp definition, and high contrast while minimizing flare and ghost imaging.What's in the boxPentax K100D body (19016), USB cable I-USB17 (39233), video cable I-VC28 (39262), strap O-ST53 (TBA), hotshoe cover FK (31040), eyecup FO (TBA), body mount cover (31016), finder cap for ME (31011), (4) AA alkaline batteries, software (CD-ROM) S-SW53, smc P-DA 18-55mm f3.5-5.6 AL lens (21547), lens hood PH-RBA 52mm (38741), lens cap F 52mm (31515)", "title": "Pentax K100D 6.1MP Digital SLR Camera Shake Reduction and 18-55mm f/3.5-5.6 Lens", "price": 9.99, "salesRank": {"Camera &amp; Photo": 7620}, "imUrl": "http://ecx.images-amazon.com/images/I/41GZM2AHE0L._SX300_.jpg", "related": {"also_viewed": ["B000SKQOSY", "B0009U7MV6", "B0009GZANC", "B000BK39DE", "B00062NT9G", "B0091TC3OC", "B00DBPKAI8", "B009W7WW26", "B003TQN2VG", "B0091T97J6", "B0082OJ33Q", "B000NVXF26", "B00861DI4U", "B007SQB896", "B00DBPKAA6", "B003BR8BE6", "B0015ASYJ8", "B0002XQJFA", "B0007QKN22", "B00DBPKBIM", "B000I1ZWRW", "B0029U0WWU", "B0007QKMQY", "B0043M6F14"], "buy_after_viewing": ["B003VNKNEQ", "B003VNKNF0", "B007M54E1M", "B0039BPG1A"]}}