{"asin": "B00023KG40", "related": {"also_bought": ["B0028Q3EXE", "B0087S9CJ2", "B003ID6XN4", "B000C1Z0HA", "B005HXFARS", "B000069EV0", "B004GW25WY", "B0088HP93A", "B000NPLHTU", "B008DW9H56", "B00F5R9TNM", "B00CQLISDM", "B005BJFDL6", "B003LMN5N8", "B000H50L9S", "B0014A50GE", "B005N6ICXS", "B00B6RZ7MM", "B001R1RF86", "B00GGVPKKC", "B00CJHXY0U", "B009LVVTSQ", "B00E7MWA8C", "B000HDJXNA", "B00006JPE1", "B007K7P6GO", "B000CBZT5I", "B009ZGK6QS", "B00BSDQW78", "B00193U3O0", "B003LZA95W", "B000QKKAPE", "B0049SCB2Y", "B008B7ARRK", "B004Q72PEM", "B003UT7TJS", "B00B7X2OW6", "B00997MYR2", "B001AZX0WO", "B005LJQM3Y", "B000IJY8DS", "B004OVECU0", "B005L9ZZ32", "B008D66RAU", "B0015YRMXI", "B0049S6ZUS", "B008519TOY", "B00474YRE0", "B003XM73P2", "B00BQ5RYI4", "B006U3O566", "B000W8JK5G", "B00870ZHCQ", "B008D5TYGU", "B00B981F2O", "B001TIG36C", "B00AMTRR5K", "B000TUDOQ8", "B0031TRZX2", "B00378KMEG", "B009E6R89C", "B00BW0XXZ6", "B00HHRP11C", "B0081ZBNI4", "B00B46XUQU", "B000WYVBR0", "B0052SCU8U", "B00630WKGI", "B000FI9VU2", "B007B5YUMQ", "B007YV0UQW"], "bought_together": ["B003ID6XN4"], "buy_after_viewing": ["B000C1Z0HA", "B0087S9CJ2", "B00EVVV1TS", "B009ZGK6QS"]}, "title": "X10 Powermid PM5900 Remote Control Extender Kit - Includes a Transmitter and Receiver", "price": 39.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/412dFSJf2eL._SX300_.jpg", "brand": "X10", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Remote Controls", "Remote-Control Extenders"]], "description": "Extend your remote's reach with this two-piece system from X10. It can transmit your remote's signals through walls, floors, and furniture. It's perfect for folks who want to conceal their A/V gear inside a cabinet or closet for a clean, stylish look. And with its 100-foot range, Powermid is also a great option for multi-room audio/video systems.Simple to set up and useGetting started is a snap. First, plug the transmitter into a standard power outlet, and place it in a location where you can comfortably aim your remote - beside your television, for example. Next, plug the receiver into a standard power outlet, and position it in front of the audio/video components you want to control. Once you've set up both units, you can send commands to your gear through using a multi-brand IR (infrared) remote control. You probably already have some of these around the house, from your TV, DVD player, cable box, or other common A/V components.How Powermid worksWhen you press a command like \"play\" on your remote, the transmitter changes the IR signal to an RF (radio frequency) signal, and sends it to the receiver positioned in front of your A/V gear. Unlike IR signals, RF signals don't require line-of-sight, and can travel through floors, walls, and cabinets. Once the receiver picks up the RF signal, it translates it back to IR. Then it passes your \"play\" command on to your A/V gear in one big IR blast.Expanding your PowermidIf you'd like to control components located in multiple areas of your house from one room, you can install additional Powermid receivers. If you'd like to control your A/V gear from multiple rooms around your house,you can install additional Powermid transmittersHighlights:- includes tabletop transmitter and receiver- AC power required- not compatible with components that use RF remotes- 3\"W x 4-3/8\"H x 3\"D (receiver and transmitter)- warranty: 1 year"}