{"asin": "B00004RC2D", "categories": [["Electronics", "Computers & Accessories", "PDAs, Handhelds & Accessories", "PDAs & Handhelds"]], "description": "The Palm IIIxe handheld builds on earlier Palm III models by offering more memory and more options. Its 8 MB of RAM (four times the memory of the popular Palm IIIe) and 2 MB of flash ROM keep track of all your appointments, memos, to-do items, expense items, and e-mail, plus you can add thousands of third-party applications. Although the Palm IIIe and IIIx models have ample memory for many users, the Palm IIIxe better supports users who rely upon their organizer for data-heavy operations.The Palm IIIxe is more powerful than its predecessors, but it retains all of the Palm IIIx's and IIIe's convenience features. It measures a mere 4.7 by 3.2 by 0.7 inches and weighs 6 ounces. Backing up and exchanging information with desktop PCs and popular PIMs requires just a touch of a button on the included HotSync cradle. The infrared port allows you to instantly beam business card information, phone lists, data, and applications to other infrared-equipped devices. It also features a sharp backlit LCD screen, legible in both dim and bright light.The contents of the Palm IIIxe box include the Palm IIIxe handheld, a CD-ROM with an extensive assortment of Palm Desktop software applications, two AAA batteries, a DB-25 adapter, a HotSync cradle, a manual, and a Getting Started quick guide. You may further customize your Palm IIIxe organizer with third-party add-on peripherals such as modems or voice recorders. This device runs for approximately two months on just two AAA batteries and comes with a one-year manufacturer's warranty.What's in the boxPalm IIIxeProtective flip coverStylusPalm Desktop software2 AAA batteriesDB-25 adapterHotSync cradleManualGetting Started guide", "title": "PalmOne IIIxe Personal Handheld Organizer", "price": 49.99, "salesRank": {"Electronics": 68379}, "imUrl": "http://ecx.images-amazon.com/images/I/51698QTKXAL._SX300_.jpg", "related": {"also_viewed": ["B00005AWBJ", "B0007VMROE", "B00000DM9S", "B001CODA9G", "B000BI7NHY", "B000BI2180", "B00009MVFL", "B00008WEHZ", "B00000J4FS", "B0000DBJJT", "B00004VWM3", "B00004WHIL", "B0000DB4D1", "B0000796XL", "B00004DS1N", "B000059MSI", "B00007GPI1", "B000031KIM", "B00000IGBF", "B00005Y1Z6", "B000816CZS", "B00005V63T", "B0000A8VNY", "B00009PLI6", "B000672QAE", "B00008WFVI", "B0002OP856", "B00005Y1Z7", "B000N2X2GO", "B00006J6RN", "B00005O70S", "B00006JKXN", "B00005T3QC", "B00005T3UK", "B00003Q5HV", "B0000AH5N1", "B000GAWAT8", "B00004RIUB", "B001VY9H1W", "B00000J0A2", "B0001KWGOW", "B000YTRXGQ", "B0002ZAEYA", "B00124VOIK"], "buy_after_viewing": ["B00005AWBJ", "B001BPB47Q", "B0007VMROE", "B00000J08C"]}}