{"asin": "B00005ME8S", "description": "Originally released in 1998, the PC version ofHalf-Lifechanged  first-person shooters forever by proving that a compelling story can be told within  the genre. Prior to the game's release, first-person shooters were mindless  action games.Half-Life, while containing its fair share of action, also  contained plenty of exploration, puzzle, and story elements. Now released as a  PlayStation2 game,Half-Lifehas never looked or played better. This  version contains the outstanding single-player story mode, as well as a few new  ones. While the new additions aren't so great, the story mode is one of the best  escapades available on the PS2.The game follows the adventures of Gordon Freeman, a young research associate at  the Black Mesa Federal Research Facility. A typical day at the office goes  completely awry as numerous alien life forms invade the facility. The fate of  the facility, and quite possibly the world, is in the hands of an unlikely hero.The graphics here trump the original's (understandable, as more than three years  have passed). The character models have four times as many polygons, as well as  smoother textures and animations. The sound is also very good, with some of the  funniest voice acting yet heard in a game. Of course, the single-player gameplay  is excellent, thanks to some very well-developed enemy artificial intelligence.Unfortunately, the new modes aren't nearly as brilliant. Decay, the new  cooperative mode, seems like an afterthought and pales in comparison to the  cooperative modes inPerfect DarkandHalo. Deathmatches only  support two players, which is incredibly lame considering many PS2 first-person  shooters support four. Despite these flawed modes, the single-player story is so  superb that it totally warrants a purchase.--Raymond M. PadillaPros:Greatly improved graphics from the originalExcellent storytelling, especially for the genreStrong enemy artificial intelligenceCons:Cooperative mode is dullDeathmatch only supports 2 players", "price": 47.49, "imUrl": "http://ecx.images-amazon.com/images/I/41Q9wZcp4lL._SY300_.jpg", "related": {"also_bought": ["B000PE0HBI", "B000B2YR74", "B000R0PLK2", "B00005NCAM", "B00005BIG7", "B0009351R0", "B000069D39", "B00020LZAW", "B00005ML10", "B00019AZB4", "B00004WKN9", "B00005OLX1", "B00005ME6O", "B0009I6S0O", "B0000A8VBZ", "B0000A92KX", "B0001ADAME", "B000B69E9G", "B00KVMHVQ8", "B0007OGDIC", "B00004YRQ9", "B00004W4QJ", "B003O6E3C8", "B000066RKC", "B000TLU67W", "B0009Z3HYW", "B000F0GX8I", "B00007LV7Y", "B00001KUII", "B00000I1BT", "B0002Y2XXQ", "B0001NBNGG", "B000KCX9M4", "B00005NZ1G", "B0002XL3BA", "B0000690Z9", "B000NIJ35W", "B0009VQANG", "B000E991PC", "B00020BV2E", "B00005NCCR", "B0032GTMEE", "B0009O7HVM", "B00000I1BY", "B0000B0MNH", "B000NGWFX6", "B00000JRSB", "B00009YEJY", "B0019LMXAY", "B000087L4G", "B001MW91IW", "B000006RGS", "B000H94PVO", "B00004YRQA", "B0002RQ3ES", "B0009SQF0C", "B0007PIEB0", "B0006ZJP8M", "B00005J536", "9629971372", "B00005O0I2", "B002CZ3SLO", "B000087L4E", "B0001AVZ5I", "B0001I9YGC", "B001383L36", "B00004WLQV", "B00149ND28", "B000093NQM", "B00005V9NI", "B0000C7GHG", "B000066TS5", "B00004SVYF", "B00C3MK9BS", "B00007E1OA", "B00006GSNX", "B00009ZVHW", "B00005ML0X", "B000034DMG", "B00001XDUB", "B00005LOXE", "B00005Q8IR", "B00006Z7I3", "B001ELWMHI", "B000095ZH6", "B0000AJMPK", "B0001Q5SG4", "B000099T2K", "B00005BW7Q", "B000B6MLZK", "B00006JN5H", "B001CRM3YQ", "B00008J7NZ", "B003JD7QYI", "B0000696CZ", "B00019HNNC", "B00004TNDE", "B00005V6B9", "B00000K10U", "B00A3IAZPY"], "buy_after_viewing": ["B000PE0HBI", "B000R0PLK2", "B0009351R0", "B0002XL3BA"]}, "salesRank": {"Video Games": 6141}, "categories": [["Video Games", "More Systems", "PlayStation 2", "Games"]]}