{"asin": "B0030LO5CU", "description": "Aspire One AO532h: Go Anywhere MobilityBrowse the Web, check email, share photos, keep up with social networks, listen to music and enjoy a wide variety of entertainment with the Aspire One AO532h, which features a small compact design that you can take anywhere. Combining the power of the latest Intel Atom N450 processor and NM10 Express chipset with a 6-cell battery, this Aspire One AO532h model (AO532h-2223) in silver provides up to 8 hours of battery life on the go--enough for a full workday.A great choice for students as well as business travelers who like to travel light, Acer makes it easy to stay productive while on the go with the 10.1-inch CrystalBrite LED-backlit screen as well as its excellent near full-size keyboard. You'll be able to easily video chat wherever you roam thanks to the Crystal Eye webcam integrated into the LCD's bezel, delivering smooth video streaming and high quality images even in low-light situations. Pinch, flick and swirl your fingers on the multi-gesture touchpad for an intuitive navigation to view web pages, photos, spreadsheets and more.It comes pre-installed with the Microsoft Windows 7 Starter operating system, which combines the latest in reliability and responsiveness with the familiarity and compatibility of Windows. It includes new Windows 7 features like Jump Lists to help you to better find and manage files, and connecting to printers and peripherals is easier than ever.Key Features", "title": "Acer AO532h-2223 10.1-Inch Matrix Silver Netbook - Up to 8 Hours of Battery Life", "price": 179.0, "imUrl": "http://ecx.images-amazon.com/images/I/41IXX3VfJWL._SX300_.jpg", "related": {"also_viewed": ["B00EXPEGX0", "B00J2T6RM0", "B0030T17DW", "B00D0SSPOC", "B006ITMC7Q", "B005F0IKHA", "B00EC4QJAU", "B00IUOU6MA", "B007582KGM", "B00KSYR3Y4", "B008D9HZ62", "B00BPMGJJ8", "B004FEQV2S", "B00KSYYXSI", "B00BQH8QTI", "B005J22OLC", "B000UTTJLW", "B003ZYUCDS", "B0080F3B94", "B00IUP7ZLO", "B00IUP7LNG"], "buy_after_viewing": ["B00FNPD1VW", "B00FCK20SI", "B00FCK20SI", "B0059QFU4Q", "B003YMC29I"]}, "categories": [["Electronics", "Computers & Accessories"]]}