{"asin": "B003VYB1KK", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Encased in a beautifully sculpted black metal shell with a double coated lacquer finish and measuring only 23mm thick, the FinePix F300EXR offers a 12-megapixel EXR Super CCD, a large, 3.0-inch high-contrast 460k LCD, Intelligent Image Stabilization and HD movie capture at 720p.Fujifilm FinePix F300EXR HighlightsSharp, Clear 15x Zoom LensThe FinePix F300EXR features a Fujinon 15x Super Wide-Angle optical zoom lens that produces crisp high resolution results throughout the focal range, from 24mm wide-angle to 360mm telephoto.  The lens of the FinePix F300EXR also features Super EBC Coating that keeps ghosting and flare to minimum, allowing for optimal picture quality.1x zoom/ 5x zoom/ 15x zoomEXR Sensor Technology, with Hybrid High Speed AFThe next generation EXR sensor in the FinePix F300EXR incorporates Phase Detection pixels built-in to the CCD to realize Hybrid High Speed Auto Focus.  It has the ability to intelligently decide between the two focusing systems on the camera.  For example, when a bright, high-contrast subject is positioned in the center of the frame, Phase Detection AF works fast and accurately; and in dark scenes, Contrast AF is employed to work accurately.The F300EXR uses both Phase Detection AF and Contrast AF to offer fast auto focus speeds in all scenes.  To achieve an incredible auto focus speed of 0.158 seconds2, Fujifilm engineers placed pairs of phase detection pixels on the EXR sensor, which work like external sensors on DSLRs.  The F300EXR automatically selects the better focus system (Contrast or Phase Detection), by measuring the amount of light or contrast in the scene.  The benefit for the photographer is immediate and obvious--an almost instantaneous capture of the subject in the frame, with no missed shots or subjects half out-of-frame.Intelligent Image StabilizationLong-zoom cameras need stabilization more than any other compact, with handshake and subject movement a particular problem in low light at telephoto range and in movie mode.  With a newly enhanced gyro sensor, the new image stabilization system promises further improved image quality with reduced blurring and noise in still pictures and even when shooting movies at the full 15x optical zoom or in very low-light.  The new sensor is able to overcome handshake and can compensate for both sharp and wide hand movements, therefore increasing ISO to freeze action is no longer so necessary, meaning beautifully sharp low-light pictures can be achieved at 400 ISO, rather than 800 or 1600 ISO at night scenery. The FinePix F300EXR also works to reduce blur to a minimum by deploying high ISO sensitivity to automatically increase shutter speeds, and CCD Sensor Shift Stabilization to counteract the problems of handshake.  By cleverly combining these two, blur is reduced to an absolute minimum.Intelligent Image Stabilization reduces blur and noise.3.0-inch High-Contrast LCD1. Conventional digital camera, 2. FinePix F300EXR,The FinePix F300EXR is fitted with a high contrast 460K-pixel 3.0-inch LCD.  The high contrast LCD is a considerable benefit in bright light, and means that the camera can be directed at various shooting angles to enable framing of awkward shots.  The LCD is bright and clear for beautiful rendition of shots in playback.HD Movie CaptureWith the ability to capture movies in HD quality 720p, the F300EXR also has a Mini HDMI Port, making it quick and easy for users to realize the full benefits of their home theater system and to share all their special moments.Improved Pro Focus ModeIntroduced on the F70EXR, Pro Focus Mode has proved very popular with photographers. Through complex digital imaging technology, several images are combined to create a crisp shot of the subject against a defocused background and foreground.  Ideal for portraits, nature photography or any subject that needs 'lifting' from its background, the FinePix F300EXR Pro Focus Mode provides satisfying professional results at the touch of a button.  Results are even more simple to achieve as Pro Focus Mode has been now been combined with Face Detection and Face Recognition.Motion Panorama 360 for the Perfect All-Round ShotNew to the EXR sensor, the F300EXR extends the sweep range to 360&deg; (shots can also be taken vertically).  Combined with high quality Fujifilm printing, astounding scenes can be taken, showing fine detail, low noise and high resolution at 180, 240&deg; or a full 360&deg; range.Face RecognitionWith Face Recognition, users can register up to eight (8) faces, along with names, birthdays and categories, and the F300EXR will prioritize focus and exposure right on the faces of those special people.  Users can also use Image Search to view images of a registered person.  Compared to models from other manufacturers, Fujifilm's Face Recognition has faster recognition speed, greater number of names displayed, and the ability to recall the most often shot subject.Face Detection in action.Tracking Auto FocusThe F300EXR also has Tracking Auto Focus, which allows users to track a moving subject automatically for still picture capture.Additional FeaturesSuper Intelligent FlashThe FinePix F300EXR offers a flash control system which efficiently controls the level of flash for a given exposure to produce beautifully balanced flash illumination across the foreground and background.  Gone are the ugly washout shots where the subject is blasted with light and the background dark and unexposed.  Super Intelligent Flash is most useful in macro photography where the contrast between subject and background can be especially challenging, but is also effective for night and backlit photography.EXR AUTO TechnologyPrized for bringing a new level of image quality to the consumer compact market, Fujifilm's EXR technology has the unique ability to switch its behavior depending on the shooting conditions by automatically switching sensor modes. The FinePix F300EXR can be left on EXR Auto Mode and the camera will do all the hard work for you, or alternatively, you can manually select one of three EXR Priority modes for high resolution (HR), dynamic range (DR) or high sensitivity and low noise (SN).Face Detection and Automatic Red-eye RemovalTo provide perfectly exposed and focused portrait shots, the FinePix F300EXR is fitted with Fujifilm's latest Face Detection technology which is able to track up to 10 faces simultaneously, at almost any angle to the camera. The system instantly corrects red-eye and then saves both the original and the corrected image file automatically.Photobook AssistPhotobook Assist lets you select and organize images in your camera to create a digital photobook. You can download the photobooks to your computer using MyFinePix Studio software that is included.", "title": "Fujifilm FinePix F300EXR 12MP Digital Camera with 15x Wide-Angle Zoom and 3.0-Inch LCD", "price": 139.9, "salesRank": {"Camera &amp; Photo": 8911}, "imUrl": "http://ecx.images-amazon.com/images/I/41YrQvyhYuL._SX300_.jpg", "related": {"also_viewed": ["B006T7QSV8", "B00728ZBA2", "B00B46XSDK", "B00B46XSC6", "B00FP1HOB2", "B0095F5AFQ", "B00B7VC4IC", "B001R23JMQ", "B00GMTKSOG", "B004HYFX0C", "B0075SUHKI", "B0076W0LNQ", "B00FPKDPXY", "B004HO58KW", "B00ATM1LY8", "B00BW6LTG0", "B006T7QWIM", "B00IS9DZRA", "B00B46XRN6", "B009P975FK", "B0075SUHQC", "B000UXDHOI", "B00E1U9434", "B0075SUK14", "B00ANQD52Q", "B004HO58KM", "B00IA9LMNW", "B00B7VC388", "B00B46XRK4", "B00DY2Y28M", "B00B46XSFI", "B006UMM2BW", "B00728ZAHG", "B004J3YCGM", "B00CC9QTA2", "B00BQU11JW", "B009AYJQ2U", "B00I9OPF2W", "B00CPPRO3Y", "B00EFILHB4", "B00FPKDRVY", "B005IGVY92", "B00IA9LVOC", "B00BEHQKPW", "B008MB719C", "B00CDIK48U", "B006YP41I2", "B00BEHRQB4", "B00B3YSW5W", "B00B5MUJTO", "B00BF9MUBM", "B00ATE7W7G", "B00EFILR6E", "B00HQ4W3OE", "B00B5HE2UG", "B00908BMVE", "B00EFILPHA", "B009B0MZ1M", "B00DM8R866"], "buy_after_viewing": ["B006T7QSV8", "B003VNKNF0", "B00728ZBA2", "B001207YMY"]}}