{"asin": "B000J43HJ8", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Keyboards"]], "description": "An ideal partner for any high-end computer, the ultra-slim Logitech diNovo Edge delivers the   ultimate in feel and response. The revolutionary TouchDisc with hyper-speed   scrolling and&nbsp;pixel-perfect control makes trackpads obsolete.&nbsp;A slim recharging   base doubles as a keyboard stand. Work longer thanks to the longer-lasting   Li-Ion batteries, and&nbsp;more securely via Bluetooth wireless technology.&nbsp;Combine   it with the world's most advanced mouse, the Logitech   MX Revolution, for a premium desktop experience!Features&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;PerfectStroke key systemA precision micro-scissors   mechanism distributes typing force evenly across key surfaces, making every   stroke natural and fluid.&nbsp;Stylishly sleekLaser-cut from a single piece of Plexiglass   and set in a brushed aluminum frame, the diNovo Edge makes a bold statement.&nbsp;   Only 11 mm thick!&nbsp;Elegant charging basePut your keyboard on display while   charging via the slim base/stand.&nbsp; Advanced Li-ion batteries recharge faster and   last longer.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;TouchDisc scrollingA new type of touchpad, the TouchDisc   unifies scrolling, selection, and cursor control. Scroll at hyperspeed with a   touch of your finger.&nbsp;Backlit stealth controlsHidden hot keys light up at a   touch, and fade into the background when not in use. The touch-sensitive volume   slider gives you precise, fingertip audio control.&nbsp;Bluetooth wireless technologyBluetooth wireless   technology ensures seamless, secure operation from up to 30 feet.&nbsp;System RequirementsIBM or Compatible PCWindows XP (SP2) or Windows Vista (all editions)Available USB portCD-ROM DriveHardwareKeyframeFull-sized standard 18 X 18 mm keys, 3.2 mm key travel, 60g activation force10M keystroke supported per keyScissor switch technologyPlexiglas panel with brushed aluminum palm restEnhanced Controls38 mm circular touchpad with horizontal and vertical scrollingAcceleration settings goes from None to 10 times the scrolling speedTouchDisk can be disabled with FN + Left Click on the keyboard17 one-touch access controls with instant backlit feedback57 mm touch sensitive volume slider with instant backlit feedbackConnectivityBluetooth Wireless Technology, version 2.0Supports Widcomm 5.1 Bluetooth stackPower and BatteryBuilt-in rechargeable 950 mA&nbsp;&nbsp;lithium ion batteryFast-charge time: About 5 min for approx. one day usageFull-charge time: About 2 hours for up to 2 months usageDimensions and Weight11&nbsp;mm (H) X 410 mm (W) X 210 mm (D)&nbsp;&nbsp;940 gramsPackage ContentsLogitech diNovo Edge KeyboardCharging baseAC power cordUSB mini-receiverInstallation CD, includes:&nbsp;Logitech SetPoint&nbsp;version 3.10Comfort guidelinesHelp centerUser's guide3-year limited warranty&nbsp;", "title": "Logitech diNovo Edge Keyboard (Black)", "price": 388.99, "imUrl": "http://ecx.images-amazon.com/images/I/41V9aDwUJBL._SX300_.jpg", "brand": "Logitech", "related": {"also_bought": ["B002HWRJBM", "B008J5HEMK", "B000HCT12O", "B000T8CWFE", "B00593DT2E", "B0011FQUQG", "B007M0LY8S", "B003VAGXWK", "B00DR8LA6U", "B006MBP7T0", "B006JH8T3S", "B0011FOOI2", "B002O0L0GC", "B007PJ4Q4A", "B003NR57BY", "B004MF11MU", "B003UT6C9G", "B0043T7FXE", "B002HWRJBC", "B0011FCV8W", "B00IIJ6W4S", "B0099SMFVQ", "B005H3I38Q", "B003Y24DEU", "B009CP4PIW", "B00A45JEX0", "B008I64NZQ", "B003VANO7C", "B0095EFXMC", "B004JU260O", "B000A6PPOK", "B003TG75EG", "B002GHBUTU", "B006ZGWJU2", "B003UFU76Y", "B009NB8WTI", "B003L82R4U", "B00EHBERSE", "B0093H4WT6", "B0006N3EVS", "B002BH3Z8E", "B007QXLIWI", "B00224ZDFY", "B0083I7Y8W", "B001TH7GUU", "B009NB8WRU", "B000Q6UZBM", "B008ZGKWQI", "B005DKZTMG", "B003V4TV8O", "B00BZC31WQ", "B009NHAEXE", "B005JN9310", "B005HMKKH4", "B005H3Q59U", "B00AYNRLFA", "B005GB31PE", "B0045JTAC6", "B002NUYTCA"], "bought_together": ["B002HWRJBM", "B003VAGXWK"], "buy_after_viewing": ["B003VAGXWK", "B005DKZTMG", "B007PJ4PN2", "B003NR57BY"]}}