{"asin": "B003K0QLY6", "description": "ARCHOS' 15 vision is an incredibly light and thin media player, ready for 4GB of your digital media--music, videos, and photos. With a wealth of additional features such as an FM radio, voice recorder, and FM transmitter, it's a solid choice for enjoying and sharing a handful of your favorite media.An incredibly light and thin media player, ready for 4GB of your digital media.Click to enlarge.Ultra-portable player is just 6 mm (1/4\") thick and weighs 18 grams (0.6 ounces).Responsive touch-sensitive controls for easy navigation.Ultra-Slim, Ultra-PortableAs thin as a CompactFlash card (or a cracker, for those who prefer a non-tech comparison), the ARCHOS 15 vision is just 6 mm (1/4\") thick and weighs 18 grams (0.6 ounces). Throw it in your shirt or pants pocket and you'll barely know it's there.Despite its size, ARCHOS fit in a 1.5-inch TFT color screen--just the right size for browsing through your music files, viewing a few pictures, or sharing some short videos with your friends.Innovative Touch Keys and Intuitive InterfaceThe ARCHOS 15 vision is equipped with a perfectly flat, touch-sensitive control surface. With one finger, you can navigate smoothly and rapidly through menus and files to easily access your music, photos, or video content.Enjoy Your MusicThe ARCHOS 15 vision plays standard music file formats such as MP3, WMA (none protected), and WAV files, as well as the more exotic FLAC and APE formats. With a capacity of 4GB, you can store up to 2,000 songs. Browse your music by title, artist or album, or create your own favorites list to play at any time.And syncing is a breeze--just connect it to your computer (PC, Mac or Linux) and copy/paste or drag-and-drop your favorite songs to the \"Music\" folder.FM Radio Playback/RecordingIf you're tired of your own music files, or just want to get caught up on the news, you can always listen to the FM radio. Quickly scan stations, or preset your favorites.Additionally, you can record whatever's playing and save it as a music file for later playback or transfer to another device.Watch a Little VideoWhether you're a fan of music videos or just can't stop watching \"keyboard cat,\" put a few vids on the ARCHOS for sharing them with your friends. Conversion software is included for the supported MPEG-4 AVI format.View PhotosIt's always nice to have your photos with you for sharing. Put your favorite JPEG or BMP formatted photos on the ARCHOS to show pictures of the kids, friends, your latest trip, or anything else. You can view photos one by one, or play a slide show.Record Your MemosIf you need to remember something and you don't have a piece of paper to note it down on, why not just record your voice? The built-in microphone will record your voice memos or any idea that you can't get down on paper.What's in the BoxARCHOS 15 vision Player, USB Cable Mini B/A, Earphones, User Guide", "title": "Archos Vision 15 4 GB MP3 Player with 1.5-Inch Screen (Black)", "price": 34.99, "imUrl": "http://ecx.images-amazon.com/images/I/41Tg2G4A3aL._SY300_.jpg", "related": {"also_viewed": ["B002TGEYOQ"], "buy_after_viewing": ["B002MAPT7U", "B002TGEYOQ", "B0036RA4M8", "B0035PBHX6"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}