{"asin": "B0029631VI", "related": {"also_bought": ["B0031LX6F6", "B003VKR34C", "B004TA0AZM", "B002CS8VCC", "B004TA0AUW", "B0045DR7RM", "B00F0XQ81W", "B00CBD0XSI", "B003M4UC2C", "B00FEA01O6", "B0037P5CAI", "B0012Y2LLE", "B0067I54ZU", "B00A2F422K", "B008KFMVZY", "B000P9ZBFA", "B00I6PXJBI", "B0085EG6OW", "B003BRD9QG", "B00IVPU6GO", "B008EODGHS", "B004AP9FSE", "B009TQ4L5Q", "B00200K1TS", "B00CGTN2N0", "B00F542DQU", "B008J8GGVM", "B00488G6P8", "B000JCN6SW", "B004W86GQS", "B009QZH7D8", "B00CH5U24A", "B00J0BU8IY", "B00D3IIO9A", "B000RZUUWG", "B000WH6H1M", "B000JCQKVM", "B006R3231I", "B00ED3EJ66", "B0032HOH0W", "B00G2TEKM2", "B00JMD17JE", "B00B7733E0", "B00GQPE8WE", "B00J3CL3Q6", "B00CXGFFTU", "B0053DDNW6", "B00DC4IV9I", "B001L1H0SC", "B00G6OMDHC", "B008GAMNBK", "B00FONBG1A", "B004S1PNE0", "B009QZH7BU", "B0018OHNIY", "B005756GYM", "B001TPZ294", "B00B4CYRHA", "B000W22O3W", "B00DYQYLQQ", "B001F7AJKI", "B00009W3TY", "B001VZC5LA", "B00D405BO8", "B0081GZDQQ"], "bought_together": ["B0045DR7RM"], "buy_after_viewing": ["B0037P5CAI", "B009QZH7BU", "B00CH5U24A", "B008GAMNBK"]}, "title": "Veho VCC-003-MUVI-BLK MUVI Micro digital camcorder for Action Sports/Surveillance (Includes 2Gb Memory)", "price": 47.99, "salesRank": {"Camera &amp; Photo": 183}, "imUrl": "http://ecx.images-amazon.com/images/I/31R%2BcvdukyL._SX300_.jpg", "brand": "Veho", "categories": [["Electronics", "Camera & Photo", "Video", "Sports & Action Video Cameras"]], "description": "Perfect for extreme sportsThe Muvi unique micro design enables digital video recording in situations where it may not be possible to use standard camcorders. Coupled with the extreme sports mounting kit the muvi will allow the user to capture high quality digital video and sound footage hands free. With its robust thumb sized alloy metal casing you needn't worry about your Veho Muvi. It features a 2 Megapixel lens and records in AVI format.It&rsquo;s the smallest in the world of its kindThe Veho Muvi comes with a 2GB Micro SD Card, that's enough for 2 hours footage, and with a built in rechargeable battery life of 2-3 hours, you'll never miss a thing. Easily connects to your computer via Micro USB, so you can upload your videos in seconds. It also charges through any USB giving complete portability.Great qualityThe Veho Muvi Micro DV Camcorder is perfect for anyone who wants to capture great quality images whilst on the move. The Muvi DV Cam captures video with a 2 mega pixel image quality, which are then stored in AVI format on the Micro SD Memory card. Powered by the included internal li-ion rechargeable battery the Veho Muvi Digital Video Camera will keep going for up to 3 hours from a full charge, and can be connected to your PC via the included USB cable to both transfer videos and re-charge the battery, or for use as a webcam.Attaches easilyThe Veho VCC-003 DV Camcorder is ideal for those out and about as the included clip allows it to be attached to various items, whilst it also features voice activated start/stop recording function so it can be used completely hands free when you need them for other things. Accessories available include an extreme sports pack for mounting the camera on items such as helmets for when your mountain biking, skateboarding, skiing etc., your then able to capture the action has it happens."}