{"asin": "B000NJH6YG", "description": "The world changed when Aziraal, the god of war, was slain in the huge battle long ago. The hordes of Orcs lost their divine leader and were forced to withdraw to the southern wastelands. Now, thousands of years later, the location of Aziraal's tomb is still unknown, well hidden by other gods who did not dare to entrust the secret to mere mortals.However, now, a fragile peace between the civilized races and the hordes is at stake. When the dwarven mining expedition discovered an ancient temple dedicated to an unnamed deity - all of the world's most powerful factions saw it as a possible clue to the place of Azriaal's burial ground. A silent war has now begun and it will soon ignite the fires that will lead to the holy crusade of the Orcs. However, the real danger lies somewhere else. A powerful force churns silently - weaving a secret plot of fear and destruction. In the end one of the Two Worlds will remain.The story of \"Two Worlds\" begins in an age torn by war. The Orcs have advanced to the south bank of the river Gon and are threatening the Kingdom of Cathalon. While this is happening, the hero, a wandering bounty hunter, is searching for some clue as to the whereabouts of his sister, whom he hasn't seen since her settlement was attacked three years ago. He unexpectedly receives vital information from a mysterious stranger - and immediately joins a Dark Brotherhood (or so it seems). Now the time has come for him to try understanding the game's powerful forces - and to learn how to use them! This is the only way the hero can survive - and get the answers to the questions that are burning in his soul &#x96; Who is behind this secretive kidnapping? Will he ever see his sister again? Where is the Tomb of Aziraal - and what role does the mysterious, yet helpful stranger have to play?", "price": 18.88, "imUrl": "http://ecx.images-amazon.com/images/I/51BNomwjY9L._SY300_.jpg", "related": {"also_bought": ["B003O6E9EK", "B004H0J5S2", "B0043B5SLI", "B000MTF054", "B0065FYG8G", "B000R0SS3Y", "B000KLNLV4", "B002W5GI9I", "B000QW9D14", "B00149NCYW", "B003BU3ZIU", "B001D25M1Q", "B005FYK2PO", "B0032LTVWW", "B00319DX4W", "B000SH3XD6", "B000ZJVDA2", "B000A0EFJW", "B004MXQ3DY", "B00113JSCG", "B003O6EBRA", "B0028A6V7Q", "B000R0RHA4", "B00008XKZM", "B001LGFPSY", "B000LXIO6I", "B000F3AADE", "0804162972", "B000SFK0MU", "B000X25GX6", "B000OLSJLC", "B0015HZLVA", "0744014344", "B000OCXK6A", "B000QCU9I0"], "bought_together": ["B003O6E9EK"], "buy_after_viewing": ["B003O6E9EK"]}, "salesRank": {"Video Games": 15894}, "categories": [["Video Games", "Xbox 360", "Games"]]}