{"asin": "B001IVXI7C", "description": "This template creates an A+ review that contains an opening paragraph, followed by three columns that cotain a left column for logo and images, a center column for lists and features, and a right column for images that can be clicked through. The last part of the template is a paragraph for more text if necessary.Intro Paragraph (Need at least 250 characters here)Imagine a World with no LimitsImagine a world that's yours to shape, build and explore. Imagine the possibilities, then jump head first into the reality. LittleBigPlanet puts the power of absolute creation into your own hands. If you can see it, you can enhance it. If you can't see it, you can invent it.The LittleBigPlanet experience starts with players learning about their character's powers to interact physically with the environment. There are places to explore, creative resources to collect and puzzles to solve - all requiring a combination of brains and collaborative teamwork. As soon as players begin, their creative skills will grow and they will soon be ready to start creating and modifying their surroundings - the first step to sharing them with the whole community.Characters have the power to move anything in this glued and stitched-together 3D landscape; they have the power to design, shape and build both objects and entire locations for others to view and play. There's no complicated level editor; all of these skills can be learned by simply playing the game. Creativity is part of the game play experience and playing is part of the creative experience.Fathom out ways to overcome tricky obstacles as you interact with the surrounding environment, or compose inspirational locations and objects that are totally unique to you. Immerse yourself in an organic world that's just waiting to be personalized.Players can make their world as open or as secretive to explore as they like. When it's ready, they can invite anyone within the LittleBigPlanet community to come and explore their patch - or can go and explore everybody else's.Left ColumnLogo Image (Assumes a logo of 200ppx)Character Image (Assumes a logo of 200ppx)Center ColumnKey FeaturesMeet Sackboy, an iconic new character that you can customize to reflect your own personalityDive into a brand new gaming genre that unleashes the creativity in everyoneExplore over 50 awesome levels which will inspire and teach you the skills to build your own contentShare your creations and enjoy access to unlimited content - a new experience is waiting to happen every single time you go onlineThere&rsquo;s not just one way to play. Players craft their own individual experience based on their own creativityUnlimited possibilities for user-created content - players can customize everything: their characters, the landscape around them and their own patch on LittleBigPlanetOnline and offline multiplayer modes - play alone, work as a team or get competitive.LittleBigPlanet global community for players to get involved with: includes player comments, rankings and easy communication with new and existing friendsRight ColumnImage 1Create Your WorldView larger imageImage 2Customize EverythingView larger image", "price": 59.99, "imUrl": "http://ecx.images-amazon.com/images/I/61nPZmlHfKL._SY300_.jpg", "related": {"also_bought": ["B002I0K780", "B005T5OBWY", "B0050SX00Y", "B004X56PWK", "B002BRZ7JE", "B0015AARJI", "B003O6E3C8", "B000UC5ML0", "B008CP6RWU", "B00JQHU9RC", "B006JKARN0", "B000ZK9QC8", "B003O6E620", "B007MM9E2E", "B0050SX3KG", "B0038MUCPK", "B00IA2NYT4", "B002GJRQSC", "B005187540", "B00JC9SWSC", "B00275A7LI", "B0053BQJVA", "B003VUO6H4", "B0056WJA3U", "B003WY86L6", "B003O680RM", "B0050SXI6K", "B00932F4D4", "B001ASJIS6", "B001H4NMNA", "B001SGZL2W", "B007A7UJ4S", "B002I0J51U", "B002I0K6X6", "B000G0HJ3K", "B00FQSS61Q", "B00BKF5IXS", "B002BSA1C6", "B005JB84GM", "B002GJRQRS", "B00BXTKJ94", "B0040546HY", "B006JKAS16", "B004M8M30G", "B003K23QF6", "B0053WVC20", "B000VTQ3LU", "B001D7T2VC", "B000MUW98O", "B00AEX81SG", "B009GZX49Y", "B006ZPAYD2", "B002ELCUUG", "B008J16AH4", "B00BIZQE10", "B00B98HBTA", "B003YF51RA"], "bought_together": ["B005T5OBWY", "B0050SX00Y"], "buy_after_viewing": ["B002ELCUUG", "B005T5OBWY", "B0050SX00Y", "B002I0K780"]}, "salesRank": {"Video Games": 2678}, "categories": [["Video Games", "PlayStation 3", "Games"]]}