{"asin": "B003ZTKFEE", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Memory Cards", "Micro SD Cards"]], "description": "The Samsung microSDHC UHS-I Card is Class 10 and UHS Speed Class 1 rated for \nuninterrupted, Full HD video recording on Android-powered devices or other \nsmartphones and tablets. The card is also ideal for taking photos on the go with \nfast speeds that will reduce your wait time between shots.Highest Full HD video recording performance available with class 10 ratingIdeal for Android, other smartphones and tabletsUHS-1 enabledFaster app performance with transfer speeds up to 50MB/s (tested with SD 3.0 or \nUSB 3.0 compatible readers)Ships in Certified Frustration-Free PackagingWater-proof, temperature proof, X-ray proof, shock proofFast Transfer Speeds for Enhanced App PerformanceSmartphone and tablet users will appreciate the card's exceptional app support. \nFast transfer speeds improve a wide range of mobile activities, from 3-D gaming \nto photo editing. With transfer speeds of up to 75 MB/s, the card lets you \nquickly move files between your PC and smartphone or tablet.Store Videos, Photos, Songs, and MoreWith the Samsung microSDHC UHS-I Card, you can add more storage to your \nsmartphone or tablet and enjoy all the videos, photos, games, and music you \nlove.Designed for DurabilitySamsung designed its microSDHC memory cards to withstand harsh operating \nconditions. The cards are waterproof; tested to withstand up to 72 hours in salt \nor fresh water to a depth of one meter.Lifetime is defined as the lifetime of the product on the market. Outdated \ntechnology is not covered by lifetime warranty if the item is no longer \navailable on the common market as a new product. Komputerbay is trademarked by \nKomputerbay LTD. All products branded as Komputerbay are to be sold solely by \nKomputerbay. Komputerbay does not authorize the use of its trademarked products \nto third party sellers.", "title": "Samsung 64GB Class 10 MicroSDXC Ultra High Speed Memory Card 50MB/s Read 20MB/s Write with Komputerbay SD Adapter and MobileMate USB Reader", "price": 37.99, "salesRank": {"Cell Phones & Accessories": 5009}, "imUrl": "http://ecx.images-amazon.com/images/I/41dWIDoqwoL._SY300_.jpg", "related": {"also_bought": ["B005VFG06W", "B00698ZUHK", "B00FONBG1A", "B00HZS0MIK", "B00B3JLXSA", "B00IVPU786", "B00CMKS2DI", "B00CES44EO", "B00INQBP7U", "B00B4GGW5Q", "B00AWBHFRI", "B00ELVO898", "B003XKWLSS", "B00IF4OC8Y", "B00DV56J9W", "B00E5XDZFU", "B00HPZZ4DQ", "B00JQR9QHG", "B00DCICYCY", "B00GB39IJE", "B00DLZW7XE", "B00BXF5HOK", "B00B3P15M8", "B009QZH7BU", "B00871Q5PI", "B00IKRHCCY", "B009QZH7D8", "B00IM7DZEG", "B00G7UY3EG", "B009D79VH4", "B00B7ID99I", "B00HWMPRKM", "B0023FTRUO", "B005QX7KYU", "B00ISZ0AFO", "B00GL1I1JY", "B00I3UWD7C", "B00BFYH11Q"], "bought_together": ["B009QZH7BU"], "buy_after_viewing": ["B009QZH6JS", "B00IVPU786", "B00IVPU7AO", "B009QZH7BU"]}}