{"asin": "B0017O3UHI", "description": "The ClearStream 2 Antenna Receives Free Over-The-Air Digital and HD Programming with NO Monthly Cable or Satellite Fees. The ClearStream 2 UHF Antenna is also capable of short range high VHF reception. Stunningly efficient, the ClearStream 2 is ninety percent smaller than legacy antennas, yet has the range and power normally found in antennas up to 10X&#x2019;s the size. Advanced design software allows these 10-Inch X 20-Inch antennas to be smaller and more powerful across the entire UHF DTV spectrum offering consistently high gain. The advanced design allows up to 98% of the available broadcast signal to actually reach the incoming antenna cable rather than being lost to impedance mismatches. The patented ClearStream 2 Tapered Loop design receives UHF channels with a range of up to 50 miles. It is engineered for strength and durability using anodized aluminum for corrosion resistance. The ClearStream 2 delivers DTV signals from widely located (spaced) broadcast towers. It offers forgiving aiming characteristics with a wide, 70 degree beam width, while still providing resistance to multi-path interference. The ClearStream 2 delivers digitally perfect signals without the need for rotation.", "title": "Antennas Direct C2 ClearStream Television Antenna", "price": 59.97, "imUrl": "http://ecx.images-amazon.com/images/I/41HFefOFLDL._SY300_.jpg", "related": {"also_bought": ["B000WOVD1Y", "B001V6QZR4", "B003FVX8GE", "B002E1UNWS", "B004H1NDLG", "B003P92D9Y", "B00I2ZBD1U", "B002GBWLMQ", "B00006JPEA", "B00005T3UD", "B001TK3C82", "B00DQN3R9O", "B002FU60GG", "B00068YUN4", "B007RH5GZI", "B003FW0X6Q", "B001BRXW74", "B004HO58SO", "B0017O5ULM", "B003FVJYF8", "B003MY3F0I", "B001I5610E", "B000I98Z1Y", "B0041OOG9M", "B008PBTPOI", "B0002YE35M", "B003E2W4OG", "B003D1QPHK", "B004QK7HI8"], "bought_together": ["B000WOVD1Y", "B003FVX8GE"], "buy_after_viewing": ["B007RH5GZI", "B0024R4B5C", "B00APPDX86", "B003FVX8GE"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Antennas", "TV Antennas"]]}