{"asin": "B0001B15RA", "description": "Take the power and flexibility of a dedicated computer gaming system and combine it with the easy-to-use, instant-on format of a high-end console system and what do you get? Well, if you also add in DVD playback ability and broadband Internet connectivity, you get Xbox.The advanced components inside Xbox make it the undisputed powerhouse among current game consoles. A 733 MHz Intel main processor and 233 MHz graphics processor from industry leader nVidia deliver photorealistic graphics in real time. A cavernous hard drive stores saved games and characters, making flimsy memory sticks obsolete. The built-in Ethernet port enables super-fast multiplayer online gaming over a broadband Internet connection. Four game controller ports allow you and three of your buddies to play at the same time, or you can use them for other peripherals such as gamepads, light guns, and who knows what else?But Xbox has more going for it than fancy innards. The Xbox's Windows-based operating system is a breeze to program on, earning it grateful accolades from Electronic Arts, Infogrames, THQ, and other game producers. The less time developers spend struggling with the operating system means the more time they spend tweaking gameplay, which ultimately results in better games. And games are what it's all about.Well, games and the fun of owning a green-glowing game console that looks like it came from Darth Vader's living room.--Mike FehlauerThe Xbox Video Game System with Controller S includes the Xbox console, the popular \"S\" style Microsoft controller, and all necessary cables. A DVD kit (sold separately) is required to access DVD playback ability.", "price": 179.0, "imUrl": "http://ecx.images-amazon.com/images/I/415EDFP8CGL._SY300_.jpg", "related": {"also_viewed": ["B001ELWMHI", "B00D9EPI38", "B00005NZ1G", "B002B5FQC4", "B0000C6EDM", "B00004XOWT", "B0000C6EDL", "B00129I75I", "B002K8Y23G", "B00005O0I8", "B00005QEFD", "B00IU3MSF4", "B0000C7GH4", "B00GP0HQ3S", "B000067DPM", "B000HVDEQO", "B0009O7HUI", "B00ALI2OYG", "B000TLU67W", "B00006409Z", "B00005TN7U", "B00005249D", "B0062E3YU6", "B001I020CW", "B00006LELH", "B007N90IG2", "B00000K2R4", "B0050SYY5E", "B000F2JUOK", "B003O6JJKY", "B000GACEHQ", "B00FATRKOK", "B00FATRKLI", "B003O6JKLC", "B0065NP6NC", "B00004YRQA", "B003O6JLZ2", "B00008J7NZ", "B00D9FQAM0", "B000035Y6D", "B00005R6YX", "B005PSTV2K", "B00H08G2N4", "B00BBU8VFY", "B003O6EE4U", "B00309S9YW", "B00004SVYQ", "B0050SXI6K", "B00005QEFF", "B00KAI3KW2", "B002BSA298", "B008FHL56S", "B00CMQTVK0", "B00EQNP8W2", "B00FATRKWM", "B00BU3ZLJQ"], "buy_after_viewing": ["B001ELWMHI", "B00D9EPI38", "B00005NZ1G", "B0062E3YU6"]}, "categories": [["Video Games", "More Systems", "Xbox", "Hardware", "Consoles"]]}