{"asin": "B00ECUF5FE", "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Cases & Sleeves", "Cases"]], "description": "Elevate your entertainment experience with our Stripe Cover with Stand. We've given one of our best-selling favorites a makeover - with the same durable construction and thoughtful design details now in a fresh new look. The Belkin Stripe Cover with Stand is designed first and foremost to keep your tablet safe and secure. Its integrated hard shell frame has protective corners that securely hold your tablet in place. Just bend back the corners when you want to remove it. The Belkin Stripe Cover with Stand is made of a durable material with a pinstripe down the front that adds a hint of contrasting color and touchable texture. It's then molded to the shape of your Galaxy Tab for an incredibly tailored fit. A velvety smooth inner lining keeps your screen safe and cushioned. The Stripe Cover with Stand also folds into a lower, more ergonomic angle that puts less stress on your wrists when typing on your touchscreen. The integrated elastic strap keeps the front cover closed when you're on the go. The same strap can be used to hold the cover back and out of the way while you're using your tablet.", "title": "Belkin Cinema Stripe Cover with Stand for 10.1-Inch Samsung Galaxy Tab 3 (F7P123ttC00)", "price": 36.99, "imUrl": "http://ecx.images-amazon.com/images/I/41jgvBFDAGL._SY300_.jpg", "brand": "BELKIN", "related": {"also_viewed": ["B0093HAAZQ", "B005EJLFXS", "B00E60PZFK", "B00EOE6MHS", "B00EJ8CX1I", "B00E60Q00Y", "B005EJLFXI", "B005EJLG32", "B00G3ZI6WK", "B00EK8THU2", "B00F69PXL6", "B007XDFNB8", "B00G3ZI6NY", "B00JIMO8FY", "B00G3ZI75G", "B007XDFO9O", "B00DZOHGJG", "B005EJLFY2", "B00K9VYFQ0", "B00ELOEXA4", "B00DZI8YDE", "B00BE6D9MK", "B00E41YCXC", "B00EJ8CX04", "B009OVJNCW", "B005EJLFYW", "B00DGXQ21Y", "B00E8CV7VC", "B00COSV10E", "B00DLZW7XE", "B00B2RQB0I", "B007XDFO9E", "B00E56CTKY", "B00JFIO6K8", "B007C1KOEW", "B0079TOI8K", "B00ID1HPU6", "B00JFR8UY2", "B00E3E11XY", "B00EZ81OT4", "B0069EM3J2", "B00D4CX9CC", "B00DOL75XC"], "buy_after_viewing": ["B00K9VYFQ0", "B0093HAAZQ", "B00DZOHGJG", "B00E4B1TW4"]}}