{"asin": "B001OQC0H0", "description": "Manufacturer's Description The compact, lightweight Samsung HMX-H104 16 GB SSD camcorder takes video at the highest digital visual resolution available today, 1920 x 1080 Full HD. 1920 x 1080 Full HD video means much greater clarity, brightness and detail than ever before. It also means that your video will be an exact pixel-by-pixel match for today&rsquo;s very best large screen HDTVs. The result is life-like video with more natural color and clarity, without the blurring or digital noise you might well be used to. Samsung&rsquo;s H-Series of full-HD digital camcorders set a new standard for style and performance. Samsung&rsquo;s renowned SSD technology offers a substantial advantage over the use of Hard Disk Drives (HDD) in a digital camcorder, providing consumers with higher performing and more durable internal memory. Samsung&rsquo;s SSD technology is more lightweight and compact, operates silently with very low heat emission, and features no moving parts, which significantly reduces overall power consumption and enhances reliability. No moving parts also make SSD technology more durable and resistant to shock and vibrations. Additionally, Samsung&rsquo;s SSD technology is faster than HDD, including quicker boot-up and read/write speeds.Samsung H104 Highlights4:3 recording, 6:9 output vs. 16:9 recording, 16:9 outputProgressive HD (1920 x 1080 Full HD)Samsung&rsquo;s HMX-H104 delivers the very highest quality video by using progressive scan technology. It records HD quality video in progressive mode (30fps), so that the video is crisp and clear, regardless of how fast the subject is moving. Progressive scan technology produces smooth images even when videos are played back at 2x, 4x or even 8x the normal speed!37mm wide-angle lens (Schneider's Varioplan-HD lens)A 37mm wide-angle lens, fitted to a camcorder, allows you to experience a new world of images. The world-class Schneider lens is specially designed to produce clear and vivid images by correcting chromatic aberration and distortion. Unlike other camcorders offering a typical angle of view of 40 - 50 mm, a wide angle view of 37mm provides wider and richer images from the same distance. Enjoy the world of dynamic, exceptional images brought to you by 37mm!The wide angle view of 37mm delivers the big pictureTime Lapse RecordingBy setting time intervals for frame capture, you can take full advantage of the Time Lapse Recording function. This feature uses selective frame capture to record over an extended period of time so that you can see the effects of long term recording condensed into a shorter time frame. Imagine seeing the slow passage of clouds through the sky or a sunset over the water in only a few minutes.Time-lapse recordingSwivel Hand-GripSamsung&rsquo;s unique Swivel Hand-Grip design makes shooting difficult angles a snap. With a flick of the wrist, you can change the shoot angle of the camcorder to take the perfect video every time-all with one hand! The ergonomic design will open new doors to the way you shoot video.What's Solid State Drive (SSD)?SSD (Solid State Drive)A data storage device that uses solid-state memory to store data forever.Superior to Hard Drive Camcorders in speed, security, size, reliability, power consumption and noise emission.With no moving parts, solid-state drives are silent and inherently less fragile than Hard Drives.Super StorageLarger flash capacities availableCompact and LightSSD is 7 times smaller and 12 times lighter than 1.8-inch Hard DriveLow Power ConsumptionSSD requires approx. 8 times lower power consumption than a Hard Drive when reading or writing data. This means less energy consumption, and longer battery life.Super SecuritySamsung&rsquo;s SSD has no moving parts, therefore is less fragile and more secure than Hard Drive CamcordersAnti-shock and Vibration Memory camcorders keep recording despite shocks and vibrations long after competitors' camcorders stop.Can repeat write and erase data more than a million times on SSD--4x more than Hard DriveHigh capacity SSD provides longer use utilizing &lsquo;Wear Leveling&rsquo; technologyWear Leveling: a brand new technology arranging data so that erasures and re-writes are distributed evenly across the memoryMaximum life of SSD is 1 million hours, i.e. 134 yearsSuper SpeedFast processing time and reliable data storage utilizing exclusive controller chipsetBoot up and access time of Samsung&rsquo;s SSD camcorder is 3x faster than Hard DrivesFaster access time means managing your files is much easierWorks normally in extreme high or low temperaturesSSD camcorder continues to work even in extreme high/low temperaturesHard Drive camcorders do not operate normally in low temperature below 14&deg;F and in high temperature above 150&deg;FReliabilitySimple structure without any mechanical partsStrong against shock and vibrationLife-long useReliable data storageNo noise, low heat emissionThere is no acoustic noise and little heat emission when the SSD operates.Elimination of noise, vibration and high temperature make for a much more comfortable recording experience.", "title": "Samsung HMX-H104 HD SSD Flash Memory Camcorder with 16 GB Memory and 10x Optical Zoom", "imUrl": "http://ecx.images-amazon.com/images/I/412QgKD3%2B7L._SX300_.jpg", "related": {"also_viewed": ["B0032UWTQI", "B00BB4UKOK"]}, "salesRank": {"Camera &amp; Photo": 20162}, "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]]}