{"asin": "B001ELI4S4", "description": "As DVD playback made the PlayStation 2 more than just a game machine, hefty multi-media features make the Sony PlayStation 3 an even more versatile home entertainment machine. Features such as video chat, Internet access, digital photo viewing, and digital audio and video will likely make it the central component of your media set-up. Still, it is first and foremost a game console--and a powerful one at that..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Under the HoodThe PS3 features IBM's \"Cell\" processor and a co-developed Nvidia graphics processor that makes the system able to perform two trillion calculations per second. That's approximately 320 times more calculations per second than the PS2. Along with the traditional AV and composite connections, it also boasts an HDMI (High-Definition Multimedia Interface) port, which delivers uncompressed, unconverted digital picture and sound to compatible high-definition TV and projectors. The system is capable of 128-bit pixel precision and 1080p resolution for a full HD experience.PlayStation 3 is a powerful gaming and home entertainment machine.Blu-Ray is the New WaySony's PlayStation 3 games are encoded onto the Blu-Ray disc media format, which can hold six times as much data as traditional DVDs. This increase in capacity, combined with the awesome power of its processor and graphics card, promises mind-blowing games once developers have learned how to fully harness the new console's power. The PS3 will also support CD-ROM, CD-RW, DVD, DVD-ROM, DVD-R, DVD+R formats.Use a variety of hand-to-hand combat moves to neutralize enemies.View larger.Explore an exotic locale to find the hidden treasure.View larger.In addition, PlayStation 3 system software update version 2.20 and up includes BD Live support. With this you can now play discs that support Blu-ray Disc Profile 2.0 (BD-LIVE) and you can also connect to the Internet while playing discs that support this format so that you can obtain additional features. Features that are available vary depending on the software in use.Uncharted: Drake's FortuneUncharted: Drake's Fortune is included with this Sony PlayStation 3 bundle pack. The game begins with a 400-year-old clue found in the coffin of famed explorer, Sir Francis Drake. The clue sends modern-day fortune hunter, Nathan Drake, on a quest to find the fabled treasure of El Dorado, leading to the discovery of a long forgotten island in the middle of the Pacific Ocean. The expedition turns deadly when Drake's party becomes stranded on an island and hunted by modern day pirates. Outnumbered and outgunned, Nathan must fight to survive and unravel the terrible secrets of the mysterious island.Adventure, Mystery, and Exploration AboundUsing maps and ancient artifacts you'll uncover clues and unravel mysteries that will reveal a forgotten island a lost treasure. This uncharted world is alive with intrigue and mystery, and you'll revel in the amazing graphics as you explore exotic locations and traverse through living jungles and 400-year-old ruins. Drake's not all on his own -- his companions and allies play an important role in the adventure through cooperative gameplay mechanics, gun play, and exploration.Action-Packed gameplayYour abilities will be tested, challenge after challenge, as you struggle to stay alive by any means necessary. Thrilling high-speed chases over land and water and terrifying gunfire will keep you on the edge of your seat. And if that's not enough, you'll need to employ an array of hand-to-hand combat moves to keep your enemies off balance with haymaker punches and running drop-kicks.Charming, exciting, and adventure-packed, Uncharted: Drake's Fortune is an excellent addition to this Sony PlayStation 3 game console bundle.What's in the BoxGame system with 160 GB HD, Internet-ready built-in Wi-Fi, and 2 USB portsDualshock 3 wireless controllerUncharted: Drake's FortunegameVoucher for downloadablePAINgameFree PlayStation Network membership", "price": 300.0, "imUrl": "http://ecx.images-amazon.com/images/I/41PijJLA9WL._SX300_.jpg", "related": {"also_bought": ["B008XWCX6Q", "B001COU9I6", "B005QVY65I", "B004X56PWK", "B003WY86L6", "B003A0T6YS"], "buy_after_viewing": ["B003VUO6H4", "B002I0J4VQ", "B003VUO6LU", "B001COU9I6"]}, "salesRank": {"Video Games": 13888}, "categories": [["Video Games", "PlayStation 3"]]}