{"asin": "B0046BTK14", "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Running GPS Units"]], "description": "If you&rsquo;re ready to take your training to the next level, Forerunner  410 can get you there. This advanced sport watch is GPS-enabled and  accurately records your time, pace, distance, heart rate, elevation and  more.Easy GoingYour training plan may be  difficult &mdash; your watch shouldn&rsquo;t be.  Forerunner 410 sports an enhanced touch  bezel that lets you quickly  scroll and select features on the run, in all types  of weather.When your workout&rsquo;s done, Forerunner 410 keeps working. It wirelessly  uploads your data to Garmin Connect&trade; when in range of your computer so  you can go back and review your  run on your own time. It works via  ANT+&trade; wireless technology and the USB stick  that comes with your watch.  No wires, no manual uploads &mdash; no sweat.Data, Any Way You Like ItForerunner 410 lets you customize up to 3 training pages  with more than 30 different types of data. You can even determine how  many data fields are shown on each screen &mdash; 1 big field, 2 or 3 smaller  fields.Advanced TrainingFor extra training benefits, you can create detailed workouts or race  the Virtual Partner&reg;, a digital depiction of your goal pace vs. actual  pace. The courses feature allows you to race a previously recorded  activity and try to match or beat it.If you like to explore new paths, you&rsquo;ll appreciate the 410&rsquo;s basic  navigation feature that can guide you back to your starting point. Just  follow the arrow on screen and see how far you have to go.Follow Your HeartSome versions come with our  premium soft strap heart rate monitor&sup1;  to display your heart rate in beats per minute. The watch has 5 heart  rate zones, which you can customize based on your exact zones. Train in a  certain heart rate zone to improve your fitness level or compare your  pace and heart rate to past performance on the same run. Forerunner 410  provides heart rate-based calorie computations so you can more  accurately track your calories burned.Store, Analyze and ShareHaving access to the data recorded by your Forerunner 410 is almost  like having your own personal coach. Make the most of it with wireless  uploads toGarmin Connectfor free data analysis and sharing. Forerunner 410 is compatible with  Windows&reg; or Mac&reg;. With Garmin Connect, you can see the route you  traveled on a map, view a summary of your run, create goals, find new  activities to upload as courses and more.Fast and AccurateForerunner 410 features HotFix&reg; satellite prediction, which means it  locks onto satellites quickly so you can be out the door and on with  your run in no time. It also has a high-sensitivity GPS receiver to stay  locked onto satellites, even near tall buildings or under tree cover.While the 410 can be worn as a watch even when you&rsquo;re not working  out, you can also power it down completely in order to conserve battery  life.What's in the Box:Forerunner 410Premium heart rate monitorUSB ANT Stick2 additional wrist strapsAC chargerCharging clipManuals", "title": "Garmin Forerunner 410 GPS-Enabled Sports Watch with Heart Rate Monitor (Discontinued by Manufacturer)", "price": 209.99, "imUrl": "http://ecx.images-amazon.com/images/I/516vZJbkezL._SY300_.jpg", "brand": "Garmin", "related": {"also_bought": ["B00264GKVQ", "B002I05VS6", "B0029M3NSS", "B000VK5BMQ", "B00INXANNU", "B0025UHKNS", "B004XC3MXI", "B0011UNMIK", "B000BFNOT8", "B002I05VT0", "B0042ESTSK", "B0029Z3RZ4", "B00BI9X1QM", "B000UO9KSY", "B003VKXIXC", "B0011UK35K", "B0025VKUPM", "B003J2V8AC", "B004WONCQE", "B0029LL5IY", "B006H30KAE", "B000UOD5QM", "B0045ZPVB4", "B006H30MF2", "B00AW7JIOA", "B0011UNTYC", "B008KG5EKC", "B003ZX871I", "B0086349IC", "B008KG5G0U", "B0088WT4V8", "B003JNYULA", "B00313JX4W", "B005PQZTAA", "B001GQ2RXK", "B003SV8IGQ", "B006H1CIT2", "B00FBYYC90", "B003JTLKIA", "B004KSQGRO", "B00591UO8S", "B00BPYSMU0", "B00AJNB5Y8"], "bought_together": ["B00264GKVQ"], "buy_after_viewing": ["B003JTLKIA", "B0025VKUPM", "B00FBYY6CI", "B003JNYULA"]}}