{"asin": "B000ESN9GA", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Hubs"]], "description": "Featuring two ultra-convenient top-loading ports, the elegant Belkin Hi-Speed USB 2.0 7-Port Hub (F5U237v1) lets you connect up to seven peripherals through a single open port on your PC or Mac. Ideal for use with all USB devices including printers, storage drives, cameras, and scanners, the Hub supports USB 2.0 and USB 1.1 connections, hot-swapping, and cascading setups. In addition, plug-and-play installation makes adding it to your existing system quick and easy.Hi-Speed USB 2.0 7-Port HubAt a Glance:Slim, stackable design compatible with USB 2.0 and 1.17 high-speed 480Mbps downstream ports including 2 top-loading portsAllows cascading for use with up to 127 USB devicesOver-current protection guards your computer and peripheralsConvenient plug-and-play installationBacked by a lifetime warrantySlim, stackable design looks good and saves space.View larger.Two top-loading ports provide quick access.View larger.High-Speed Convenience with Seven 480Mbps PortsThe Belkin Hi-Speed USB 2.0 Hub features seven downstream USB ports for data transfers at up to 480Mbps. It's built to work seamlessly with both USB 1.1 and USB 2.0 devices, which means you can keep older-generation peripherals up and running while maximizing the high-speed performance of new devices.Two of the Hi-Speed Hub's ports are located on the top of the case for fast, easy access that's ideal for thumb drives, media readers, and other portable devices. The remaining five ports are located on the back for easy cord management. And the elegant, slim-line design is stackable, helping you conserve desk space.Enables Hot Swapping and Cascading for Added VersatilityThe Hi-Speed Hub supports \"hot swapping\" of all your USB devices, which means you can plug-in then unplug peripherals--like printers and storage devices--as you need them. You'll never worry about rebooting, data loss, or the interruption of other system operations.Also, the Hi-Speed Hub allows cascading, so you can use it in a multiple-hub setup to connect up to 127 USB devices using a single open port on your computer.Smart Power Setup with Over-Current ProtectionWhenever possible, the Hi-Speed Hub lowers power consumption for longer battery life, and its design makes power supply optional in laptop applications, keeping you in control of the need for cords and recharges. Convenient LEDs make monitoring individual ports and the Hub's master power status easy.The smart design also helps to prevent damage to your expensive computer and USB devices by providing over-current protection.Plug-and-Play InstallationA plug-and-play setup gets the seven-port Hi-Speed Hub up and running quickly and easily. Simply connect the hub to your computer using the included USB cable, follow the on-screen directions, and start connecting devices.System Requirements and Warranty InformationThe Hi-Speed Hub works with a broad range of systems. For PC Users, it supports Pentium processor-based computers running Windows 98, 2000, ME, XP, or Vista with available USB 2.0 ports. For Mac Users, it supports low- (1.5Mbps), full- (12Mbps), and high-speed (480Mbps) modes on PowerMac computers equipped with a USB 2.0 upgrade card and Mac OS 9 to OS 10.The Belkin Hi-Speed USB 2.0 7-Port Hub is backed by a lifetime warranty.What's in the BoxHi-Speed USB 2.0 7-Port Hub, AC power adapter, 5-pin mini B USB cable, and manual.USB HubsUSB 2.0 4-PortUltra-Mini HubHi-Speed USB 2.04-Port HubHi-Speed USB 2.0 7-Port Lighted Hub (Black)Hi-Speed USB 2.0 7-PortLighted HubHi-Speed USB 2.0 7-PortMobile HubPorts44777USB 2.0YesYesYesYesYesUSB 1.1YesYesYesYesYesUSB PoweredYesNoNoNoNoAC PoweredNoYesYesYesYesUSB HubsUSB 2.04-Port HubUSB 2.0 PlusHub (4 Port)USB 2.0 Plus7-Port HubHigh-Speed USB 2.07-Port Hub2-in-1 USB 2.07-Port HubPorts44777USB 2.0YesYesYesYesYesUSB 1.1YesYesYesYesYesUSB PoweredNoNoNoNoNoAC PoweredYesYesYesYesYes", "title": "Belkin High-Speed USB 2.0 7-Port Hub", "price": 19.0, "imUrl": "http://ecx.images-amazon.com/images/I/31FL2oKEzQL._SY300_.jpg", "brand": "BELKIN", "related": {"also_bought": ["B000SDZ0K4", "B000NAXC6Q", "B00004Z5M1", "B000NAXC6G", "B009AR2MD2", "B000TTTJ36", "B000JE9LD4", "B002K3Y2MM", "B003XN24GY", "B00CUJT7TO", "B009NKNDVG", "B001TH7GUU", "B000EVEH6I", "B000Q8UAWY", "B004XBLDZS", "B008ZGKWQI", "B00C28L6XI", "B002HWRJBM", "B004AJG7P4", "B000FPDGA6", "B00BJE3V52", "B006JH8T3S", "B002PX99D4", "B003VANO7C", "B0036E8V08", "B0028407WW", "B0055MBQOW", "B0051PGX2I", "B009SQQF9C", "B000067RMT", "B00383K03S", "B000CRFOMK", "B0099SMFVQ", "B0000BVYT3", "B00BQHD4B8", "B001E1Y5O6", "B00A83I8G2", "B0097BEFYA", "B003YFIRR6", "B00008VFAF", "B002TLTGM6", "B005A0B4B4", "B002B3YCQM", "B0045JTAC6", "B008RXYOKY", "B001MSZBNA", "B000HPV3RW", "B0043T7FXE", "B00B3P15M8", "B004MF11MU"], "bought_together": ["B00004Z5M1"], "buy_after_viewing": ["B000TTTJ36", "B008ZGKWQI", "B00DQFGJR4", "B00008VFAF"]}}