{"asin": "B000OYMSL6", "description": "Introducing Xbox 360 Elite, the premier Xbox 360 console package that includes a massive 120GB hard drive, a HDMI port and a premium black finish. Xbox 360 Elite also includes a black wireless controller and black Xbox LIVE headset. Xbox 360 Elite has enough space for a whole library of Xbox LIVE Arcade games as well as downloadable high-definition TV shows, movies, music, and more available from Xbox LIVE Marketplace.Features:Xbox 360 Elite console:The console is equipped with a premium black finish and an HDMI port and like all Xbox 360 systems, comes with three powerful core processors, 16:9 cinematic aspect ratio, anti-aliasing for smooth textures, full surround sound, HDMI cable and DVD playback with upscaling capabilities right out of the box.Xbox 360 120GB hard drive:The huge 120GB detachable hard drive allows gamers to save their games and store television shows, movies, music, pictures, trailers, extra game levels, demos and other content available from Xbox LIVE Marketplace. Also sold separately.Xbox 360 Wireless Controller (black):The sleek black finish of this high-performance wireless controller matches the style of the Elite Console. It has a range of up to 30 feet and a battery life of 30 hours on two AA batteries. Also sold separately.Xbox 360 headset (black):Now available in black, the headset lets you strategize while playing together online or trade taunts with your opponents. You can also send voice messages to friends on Xbox LIVE.Xbox 360 HDMI cable:New to Xbox 360, HDMI lets you get HD video (up to 1080p) and multichannel surround sound, all from one cable.Xbox LIVE Silver Membership:With this, gamers can chat with friends online, collect achievements and gamerscores, send and receive voice and text messages, and access Xbox LIVE Marketplace content such as game demos, HD movies and TV, as well as the best in downloadable games from Xbox LIVE Arcade.One-month subscription to Xbox LIVE Gold:An Xbox LIVE Gold Membership provides a complete online entertainment experience. Subscribe to this premium service and engage in competitive online multiplayer matches, tailor your matchmaking via feedback and accomplishments, chat with more than one person at a time, and take advantage of unique privileges in Xbox LIVE Marketplace and Xbox LIVE Arcade.", "price": 261.95, "imUrl": "http://ecx.images-amazon.com/images/I/41Df91F9%2BXL._SX300_.jpg", "related": {"also_viewed": ["B000PD0HQE", "B001F7AAFW", "B000U9XBUM", "B00309S9YW", "B00FATRKOK", "B00D9EPI38", "B000B6MLUA", "B003O6JJKY", "B005YR1VP2", "B000RZXR0S", "B002RTO6DO", "B00EZFVPBE", "B003O6JKLC", "B00FATRKLI", "B00GZ9ESEE", "B003O6JLZ2", "B00FATRKWM", "B00GIUCV12", "B00BBU8VFY", "B001FPFVD0", "B004REDT3A", "B0096KENEO", "B006OV7O8U", "B00D9FQAM0", "B001FPBZBC", "B005M8GSAG"], "buy_after_viewing": ["B000PD0HQE", "B00FATRKOK"]}, "categories": [["Video Games", "Xbox 360", "Accessories"], ["Video Games", "Xbox 360", "Consoles"]]}