{"asin": "B002KSPKRS", "description": "The Ear Force X41 is Turtle Beach&rsquo;s top-of-the-line XBOX 360 headset featuring 7.1 channel Dolby surround sound, XBOX LIVE chat and a digital RF wireless connection for crystal-clear game audio.&nbsp;&nbsp;&nbsp;Overview:Combining outstanding comfort with a stunning 360 degree sound field and enhanced online communication, the X41 puts you in the middle of the action so you&rsquo;ll enjoy a gaming experience that&rsquo;s second to none.Playing your favorite XBOX game with the Ear Force X41 is like having a &ldquo;secret weapon&rdquo; in your arsenal. You&rsquo;ll get a competitive advantage by hearing sound cues that youcan&rsquo;thear with speakers, such as the soft footsteps of an enemy sneaking up behind you, or the loading of a weapon far in the distance, regardless of the direction. By hearing sounds others can&rsquo;t - and by knowing where they&rsquo;re coming from - you&rsquo;ll react faster and take them out before they takeyouout.If you&rsquo;re serious about XBOX 360 gaming, get serious about the sound. Invest in an Ear Force X41 and experience the game the way it was meant to be heard. It will help you to become a better player and you&rsquo;ll have a lot more fun enjoying your XBOX 360.&nbsp;Dolby 7.1 Channel Surround Sound Technology!Click here to enlarge&nbsp;Take your gaming to the next level by experiencing how your Xbox 360 was meant to be heard!Click here to enlarge&nbsp;Enjoy late night gaming without disturbing others!Click here to enlarge&nbsp;&nbsp;Dolby 7.1 Channel Surround SoundThe Ear Force X41 transmitter uses a 150MPS Digital Signal Processor (DSP) to deliver genuine Dolby Digital sound, Dolby Pro Logic IIx, and Dolby Headphone surround sound processing technologies - the industry-standard formats for encoding multi-channel sound in XBOX 360 games and DVD movies. The X41 uses the latest version of Dolby technology to create realistic game sound in 7.1 channels for improved surround sound accuracy.Dolby Pro Logic IIx and Stereo EnhancerThe X41 transmitter incorporates the latest Dolby Pro Logic IIx decoding system for surround sound realism from Dolby Pro Logic II encoded audio. When used with stereo sources, the Dolby Pro Logic Decoder also enhances the sound by spreading the stereo signal to provide a &ldquo;wider&rdquo; effect. This results in a richer, fuller sound than normal stereo - almost as if it originates from outside of the headphones.2.4GHz Wireless Digital RF TechnologyThe Ear Force X41 transmits game audio to the headset with an uncompressed wireless digital radio frequency (RF) signal to deliver CD-quality sound that rivals professional-grade wired headphones. Best of all, the wireless RF signal does not require &quot;line of sight&quot; to operate. That means you can stand anywhere near your XBOX 360 and hear a clear, noise-free signal.Chat Boost&nbsp;Dynamic Talkback&nbsp;ExpanderIf you&rsquo;ve ever had trouble hearing teammates on XBOX LIVE when the game action heats up, then you know how frustrating it can be when you have to keep adjusting the chat volume. Chat Boost fixes this problem by automatically adjusting the XBOX Live chat level when the game gets louder, so chat from teammates isn't lost in the exciting parts of your game. As the game sound gets louder, Chat Boost turns up the chat volume automatically so you can still hear what everyone is saying.It's a simple solution to an annoying problem, and it all happens automatically - so you don't have to adjust anything!Microphone MonitoringIt's hard to hear yourself speak when a headset is covering your ears. The X41 corrects this annoyance with its microphone monitoring feature. The X41 adds a portion of the microphone signal into the headset signal, so you can hear a portion of your voice along with incoming chat and game audio. Microphone monitoring not only prevents you from talking too loud or accidentally yelling into the mic, it also eliminates that annoying &quot;clogged ears&quot; feeling when talking while the headset is covering your ears.Bass BoostThe X41 headset DSP also lets you turn on a Bass Boost feature that produces deep, rich bass tones by increasing the volume of low frequency sounds - just like turning up the volume on the sub-woofer on your home theater system. Bass Boost improves your gaming experience by kicking-up the sound level of explosions, gun shots and other deep-bass sound effects, making them even more dramatic.Wired Headphone ConnectionThe X41 transmitter includes a headphone output jack with volume control to connect an optional pair of wired headphones in addition to the wireless X41 headset. This jack outputs the same high-quality Dolby Headphone 7.1 surround sound that&rsquo;s being transmitted to the wireless X41 headset, which allows two people to hear the game sound at the same time.Independent Chat/Game VolumesSeparate volume controls let you adjust the game and chat levels individually, so you can easily balance them and never have to worry about missing a cue from your teammates.Advanced Battery Booster CircuitryThe X41 has a &ldquo;battery booster&rdquo; circuit that squeezes every last bit of power from the batteries and assures high quality sound until they&rsquo;re completely dead. This allows a pair of AAA Alkaline batteries to last for as long as 25 straight hours of game play. You can also buy standard rechargeable batteries in place of Alkaline batteries.Powered By USBThe transmitter is powered by a single USB port on your XBOX, or from a nearby PC or laptop. So there is no need to fuss with a separate AC power adapter.", "price": 199.99, "imUrl": "http://ecx.images-amazon.com/images/I/41YLpg6NFHL._SY300_.jpg", "related": {"also_bought": ["B0042UQLM0", "B002P35JMO", "B00B08REVE", "B00EQNP8F4", "B003O6N64Y", "B00IAVDOS6", "B003YI458I", "B002WIG4LW", "B006W41W3M", "B0036VO4X4", "B00BTOAFXS", "B00273Z9WM", "B007N90IG2", "B0029LJIFG", "B004VLYIE8", "B00EFRNG0A", "B00EOUL7T0", "B000IZCUTQ", "B001TH7GSW", "B008FHL56S", "B003ZSP0WW", "B00DILMFNS", "B005NJSZ5U", "B00CMQTUSS"], "bought_together": ["B002P35JMO"], "buy_after_viewing": ["B00B08REVE", "B006W41W3M", "B00E5UHSX8", "B00IAVDOS6"]}, "salesRank": {"Video Games": 4224}, "categories": [["Video Games", "Xbox 360", "Accessories", "Headsets"]]}