{"asin": "B001NX4DUQ", "description": "Dante&rsquo;s Infernois an epic single player, third-person action adventure game inspired by \"Inferno\", part one of Dante Alighieri&rsquo;s classic Italian poem, \"The Divine Comedy.\" Featuring nonstop action rendered at 60 frames-per-second, signature and upgradable weapons, attack combos and mana-fueled spells and the choice of punishing or absolving the souls of defeated enemies, it is a classic Medieval tale of the eternal conflict with sin and the resulting horrors of hell, adapted for a new generation and a new medium..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }StoryThe Italian mercenary Dante returns home from the bloodletting that was the Third Crusade to two pieces of soul-crushing news. The first is that although he was assured that he was absolved of mortal sins committed in the form of wartime atrocities in the name of the churches interests in the Holy Land, that is not actually the case and his immortal soul is in grave peril. The second and more terrible is that his beloved Beatrice has been murdered, and her soul pulled down into hell by a dark force. Vowing not to accept the damnation of either souls, he gives chase, vows to get Beatrice back and descends into the infamous nine circles of hell. For weapons, he wields Death's soul-reaping scythe, and commands holy powers of the cross, given to him by Beatrice.Go to hell with Dante's Inferno.View larger.Scythe CombatTo vanquish the foes you encounter on your journey through the hell ofDante's Inferno, you must learn to wield Death's Scythe with precision and deadly force. Mix light attacks with heavy attacks to create combos, then incorporate jumps and grabs to add another layer to your combat. With dodging and Holy Cross moves thrown into the mix, you can truly become a force to be reckoned with. Without using all of your combative skills and techniques, there is no hope of ever reaching Beatrice.Holy PowersDuring your journey, you may collect magic abilities for use against the legions of hell. When you perform the Righteous Path power you make a dash attack and leave a trail of icy shards in your wake. With Martyrdom you sacrifice health and mana to deal a heavy amount of damage to surrounding enemies. Divine Armor regenerates your health and protects you from damage. Add these and other powers to your arsenal to vanquish all who stand in your way and when you need to replenish your mana-fueled abilities, visit the Holy Fountains scattered throughout the gameplay area.Creature TamingAs powerful as weapons and magic are, sometimes surviving the perils of hell requires brute force. With the power of Death's Scythe, you are able to mount the beasts of hell and use them against your enemies. All of this, however, requires ridding the beast of its current rider first. If successful, you will become the beast&rsquo;s new master. Now use its awesome power to pulverize enemies and complete tasks that require a beast's strength.Key Game FeaturesEpic story adapted from the first book of the Medieval Italian classic The Divine Comedy, by Dante Alighieri.Nonstop action as you fight through Dante's allegorical nine circles of hell.Wield the power of Death's soul-reaping scythe.Beautiful fast-paced action and intense combat rendered at 60 frames-per-second.Choice-based finishes with enemies that allow players to punish the damned, or absolve them as they are defeated.Over 60 weapons, magic and combo upgrades and modifications.Huge destructive, ridable mounts that can be taken from defeated enemies.Additional Screenshots:", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/519sLMIUm5L._SY300_.jpg", "related": {"also_bought": ["B001D7T2VM", "B0056WJA30", "B002GPPPS4", "B007UM59AC", "B000P297E8", "B005VBVQAG", "B004FUL9YW", "B004ML7WOK", "B002I0H79C", "B005C2D2MO", "B0044SA70M", "B0030GBUCS", "B000WQWPOQ", "B001YI0Z2U", "B004NRN5DU", "B002I0JA7E", "B00354NAYG", "B0058VI0SU", "B0022TNO7S", "B00309U0M6", "B001UWGDC6", "B00319DX4W", "B003O6HGHM", "B005J5K9EI", "B001E7MMNQ", "B003Q53VZC", "B0009SQFHA", "B0016NRS8M", "B000P46NMK", "B0050SYV70", "B004UDLRMS", "B003GSZ9ZE", "B002I0JGDM", "B00EVWZHLK", "B004CD9X2C", "B004A88W8K", "B003O6G6G4", "B003FBL85W", "B0050SWVIQ", "B0050SY4DG", "B000X1PE16", "B00B59MXDM", "B003DZ4F64", "B000KLNLV4", "B00D7NQP9M", "B000ZK696O", "B004FSE52C", "B000F3AADE", "B000SH3XD6", "B004EW7LSY", "B003S2MXRA", "B002BRZ8FW", "B005DVAB1Y", "B006GHA8EE", "B00BU3WWOS", "B000C427NM", "B0047TG2R0", "B002I0HAC6", "B008LW4SBQ", "B002BSA1MQ", "B003C1I0CO", "B006ZTHGCK", "B0085CA8NY", "B0050SY5BM", "B0076ZPYPI", "B00ENWZAI8", "B000R0SR9E", "B000WCN8IW", "B003L8HQ7S", "B00432O4VM", "B0010AYJXI", "B001CRQYBO", "B002I0HBZW", "B001CMJAP6", "B00886WO5W", "B001CBW18K", "B0050SYLRK", "B0088MVP2Y", "B0050SY77E", "B001ASJISG", "B009WI7V9E", "B000O5DS32", "B001IK1BJ0", "B005N4HBE6", "B000XJNTPG", "B00149NCYW", "B001CMIUYS", "B007SRM5MO", "B000HX1P72", "0307467406", "B003O6EB70", "B002W5GIBQ", "B000TI836G", "B0016BVYA2", "B002EE5ROO", "B004YVOCYG", "B004JHJHCC", "B000GPVUOY", "B00B59L9VO", "B005EZ5GNW"], "bought_together": ["B0056WJA30", "B001D7T2VM"], "buy_after_viewing": ["B001D7T2VM", "B004NRN5DU", "B00BMFIXT2", "B003O6EB70"]}, "salesRank": {"Video Games": 2112}, "categories": [["Video Games", "Xbox 360", "Games"]]}