{"asin": "B0025UHKNS", "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Running GPS Units"]], "description": "The Forerunner 405CX is the evolution of GPS-enabled training. This sleek sport watch tracks your distance, pace and heart rate, then wirelessly sends the data to your PC for later analysis. The 405CX features heart rate-based calorie computation and comes with a second wrist band option suitable for smaller wrists.The evolution of GPS-enabled training.Continuously records your time, distance, pace, calories burned and heart rate.Click to enlarge.Transfer data to your computer when Forerunner is in range--no cables, no hookups.Click to enlarge.Watch ResultsLoaded with serious training features, Forerunner 405CX continuously records your time, distance, pace, calories burned and heart rate. Each workout is stored in memory so you can review and analyze the data to see how you've improved. And advanced training features will challenge you to step up your pace--race against Forerunner's Virtual Partner to improve your times, or set up interval workouts without having to circle the track. You can even download recorded courses to compete against previous workouts. To use the watch, simply tap the touch bezel to change screens without fumbling for a button.Track Heart RateForerunner 405CX comes with a flexible, wireless heart rate monitor to help you make the most out of your training. The digital heart rate monitor continuously tracks heart beats per minute and uses your heart rate for advanced calorie computation, so you know how many calories you're burning. Train in a certain heart rate zone to improve your fitness level or compare your pace and heart rate to past performance on the same run.Share Workouts WirelesslyWith Forerunner 405CX, you can share your locations, advanced workouts and courses wirelessly with other Forerunner 405 users. Send your favorite workout to your friends to try, or compete against someone else's recorded course. Sharing data is easy: just select \"transfer\" to send your information to a nearby device.Run, Sync, Store and ShareOnce you've logged the miles, innovative ANT+ wireless technology automatically transfers data to your computer when Forerunner is in range. No cables, no hookups. The data's just there, ready for you to analyze, categorize and share through our online community, Garmin Connect or our optional Garmin Training Center software. You can even plan workouts on your computer and then send them to your Forerunner.Train Year RoundTake your training inside with the versatile Forerunner 405CX and optional wireless accessories. Pair it with an optional foot pod to track your speed, distance and running cadence indoors when GPS signals are unavailable. The wireless foot pod clips onto your laces for easy removal and automatically turns on when you start moving. Or pair your Forerunner with an optional speed/cadence bike sensor to track the speed and distance of your cycling workouts.What's in the BoxForerunner 405CX, USB ANT stick, Heart rate monitor, Two additional wrist straps, AC charger, Charging clip, Owner's manual on disk, Quick reference guide", "title": "Garmin Forerunner 405CX GPS Sport Watch with Heart Rate Monitor (Blue)", "price": 207.99, "imUrl": "http://ecx.images-amazon.com/images/I/41XurvglYqL._SY300_.jpg", "brand": "Garmin", "related": {"also_bought": ["B00264GKVQ", "B003H7UEKE", "B0011UNMIK", "B002I05VRM", "B00INXAKTC", "B0029LL5IY", "B002I05VS6", "B0046BTK14", "B002I03UVQ", "B004XC3MXI", "B000BFNOT8", "B0046BWRUK", "B0011UK35K", "B000VK5BMQ", "B005IGVY8I", "B005OGQY5U", "B00INXAFHO", "B005IGVY6K", "B005OGQXJW", "B0025VKUPM", "B0048K15G6", "B005OGQZ0Y", "B005IGVY92", "B003JNYULA", "B00AVIT638", "B003ZX871I", "B000UOD5QM", "B003J2V8AC", "B0035WTISU", "B003VKXIR8", "B0029Z3RZ4", "B003JTLKIA", "B00AWC7374", "B00BY2NCEE", "B00CSI5BN8", "B00313JX4W", "B00IA9LTBW", "B00313JX56", "B000KRGI4K", "B000PDR1LS", "B003GSLELC", "B0011UNTYC", "B006H30KAE", "B006SOLITY", "B00B7O1CY6", "B00AW7IF9Y", "B00AW7JIOA", "B00FZW0NQY", "B00B7N99YW", "B001U0O7RQ", "B00AK95UL0", "B008KFCDQ6", "B004WONCQE", "B00BI9X1QM", "B00KGQF120", "B0029M3NSS", "B00AJNB5Y8", "B008KG5EKC"], "bought_together": ["B00264GKVQ", "B000BFNOT8"], "buy_after_viewing": ["B003JTLKIA", "B0025VKUPM", "B003JNYULA", "B003J2V8AC"]}}