{"asin": "B003EYVEVS", "categories": [["Electronics", "Computers & Accessories", "Laptop & Netbook Computer Accessories", "Bags & Cases", "Sleeves & Slipcases"]], "description": "The multi-functional, stylish Philips SLE3100FN/27 Notebook sleeve 10.2-inch with HeatProtect protects your 10.2-inch notebook during travel and also works as a cooling, hardtop surface when you're working with your notebook on your lap. Designed with three protective cooling layers, the Notebook sleeve helps you stay comfortable by insulating the heat buildup that often results from prolonged computer use. In addition, the sleeve's non-slip external surface ensures that your notebook stays securely on your lap. For safe and easy mobility, the sleeve features extra-soft interior padding and rubberized zipper pulleys, so your notebook remains secure and scratch-free.Other notebook accessories you might like:Philips Notebook SoundBarPhilips Notebook HeadsetRubberized zipper pulleys and a soft interior protect your notebook from wear and tear.View larger.HeatProtect provides comfort; the non-slip external surface provides stability.View larger.Protect Your Notebook from Heat BuildupUsing HeatProtect with three insulating layers, the Philips SLE3100FN/27 Notebook sleeve 10.2-inch keeps your notebook safe from potentially damaging heat buildup. It also helps you stay cool and comfortable when you're working with the notebook on your lap. The hardtop surface provides ventilation for your notebook, keeping it nice and cool.Cushioned Support for Your NotebookThe Notebook sleeve features a hardtop surface that supports your notebook in addition to a soft underside that rests on your lap, so you can keep your notebook stable and secure while you're working, listening to music, or checking email.Soft Padding Useful for TravelWith its soft, suede-like interior, the Notebook sleeve protects your notebook from damage while traveling. Rubberized zipper pulleys add extra protection from possible scratches when inserting or removing your notebook.Hidden Handle and Storage CompartmentFor easy transport, the Notebook sleeve features a handle that easily tucks away when not needed. And a hidden storage compartment is handy for stashing important items that you need to keep close at hand.Stylish and DurableThe Notebook sleeve is constructed of durable neoprene on the bottom surface, shock-absorbing EVA on the rigid top surface, and a soft, suede-like material on the inside. The stylish grey color with matching zipper works well in both professional and casual environments.About PhilipsPhilips has a brand promise of \"sense and simplicity\" that encapsulates their commitment to understanding and catering to the desires and needs of consumers and customers. By putting end users front and center, Philips creates innovative products that are designed around people's needs and aspirations, and are both advanced and easy to use. With 60,000 registered patents, Philips is a global leader in innovation, and receives numerous international design awards every year.The Philips SLE3100FN/27 Notebook sleeve 10.2-inch with HeatProtect is backed by a one-year limited warranty.What's in the BoxPhilips SLE3100FN/27 Notebook sleeve 10.2-inch with HeatProtect.Sleeves with HeatProtectSize10.2\"13.3\"14.1\"15.4\"10.2\"10.2\"CompatibilityNotebookNotebookNotebookNotebookNetbookNetbookColorGrey with grey accentsGrey with grey accentsGrey with grey accentsGrey with grey accentsGrey with mango accentsGrey with turquoise accentsHeatProtectSurfaceShock-absorbing EVAShock-absorbing EVAShock-absorbing EVAShock-absorbingEVASoft neopreneSoft neopreneHidden Handle&nbsp;&nbsp;Storage Compartment&nbsp;&nbsp;Three-Sided Opening&nbsp;&nbsp;&nbsp;&nbsp;", "title": "Philips SLE3100FN/27 Notebook Sleeve 10.2-Inch with HeatProtect", "price": 13.99, "imUrl": "http://ecx.images-amazon.com/images/I/41mCG32jNiL._SX300_.jpg", "brand": "Philips", "related": {"also_viewed": ["B003EYVEZ4", "B003EYVEXQ", "B003EYVEX6", "B00AX0CMIU", "B00H4OWPF8", "B003NWJBDY", "B002NU5RNK", "B006P88UQW", "B00E1CPCKG", "B004NY9UV4", "B0017JOW7K", "B007WTAJTO"], "buy_after_viewing": ["B003EYVEZ4", "B003EYVEXQ"]}}