{"asin": "B008467K1E", "categories": [["Electronics", "Accessories & Supplies", "Batteries, Chargers & Accessories", "AC Adapters"]], "description": "Maximal Power Universal Rapid Charger is a device equipped with the best available technology. It charges AA, AAA, C, D, N, 9V, Ni-MH (Nickel Metal Hydride), Ni-CD (Nickel Cadmium), RAM (Rechargeable Alkaline Manganese) and even Alkaline batteries which is previously non-rechargeable. It is Built-In RISC architecture with a 8 bit microprocessor to intelligently monitor and control the charging cycle in each charging port for overcharge and short-circuit protections. It is also built with the latest battery charging technology, \"Negative Delta V\" deletion to charge Ni-MH and Ni-CD batteries first. Once the battery is fully charged, a constant current trickle charge will keep the battery at optimum ca[This charger meets the current requirements of European and National guidelines. It is an excellent choice for providing a comprehensive and versatile solution to keeping batteries charged when needed and minimizing battery waste. Features: It charges AA, AAA, C, D, N, 9V, Ni-MH, Ni-CD, RAM and even Alkaline batteries. With LCD and 8 bit microprocessor, it employs advanced RISC architecture with integrated converters and multi-channels high speed input/output ports to control the whole charge in real time. It can charge up to 4 batteries but only one 9V battery at a time and recharges batteries in SINGLE or Group as the microprocessor monitors each charging bay individually. Individual timers aid in overcharge protection, giving a complete intelligently controlled charging cycle. It is Built-In with \"Negative Delta V\" cut-off function and short-circuit protection. It has both LED and LCD display so that the status of each battery's charging cycle can be easily seen. It has an easy to use, sliding spring loaded negative pole, which makes inserting any type battery a breeze.", "title": "Maximal Power FC999 Universal Rapid Charger for Alkaline, RAM, Ni-MH, Ni-CD, AA, AAA, C, D, N, 9V Batteries", "price": 27.68, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41kAYbT9mfL._SY300_.jpg", "related": {"also_bought": ["B000RB60H4", "B001AX1UQO", "B000FNR726", "B0054USSV4", "B0040IAZ0S", "B00IDU2FK2", "B00A7JEP5K", "B001B31O6O", "B001AYIRH8", "B003VUIXX2", "B0041TF5KQ", "B005G7SBY4", "B0041TEHMS", "B003OR3HBU", "B00408IF1Y", "B003F6TLB0", "B001BKS3Z2", "B00FHVP5OI", "B000NPZ4TO", "B0047UW2UK", "B00H3ZXCNM", "B007F7Q974", "B0031JYRCY", "B007B9NV8Q", "B001CON7PS", "B004057DP6", "B001AMWPHS", "B0002FQWQY", "B00FHVM7GC", "B00405F862", "B00DTE23PY", "B00164BTMC", "B002V8C3W2", "B0030T1NFO", "B003QUNYQI", "B0002FQWWS", "B0050J4ZGQ", "B00410B734", "B003USCDNG", "B00GSUVC1M", "B001B2X43Q", "B00CWNMXQW", "B001Y0Y8C6", "B007OSD9UO", "1616080094", "B000KK7FEY", "B0079UVYI6", "B004H912FC", "B00000JHQC", "B00JHKSMG8", "B003US4L4K", "B007B9NXAC", "B003X87CFW", "B0040ZKD5I", "B006OSQALU", "B00B4JJTIA", "1496092589", "B003WSUPDY", "B000BOBZJ0", "B000BESLQK", "B009RCQWLI", "1495236641", "014218151X", "B00CWNMV4G", "B004J6DLD4", "B00DNPT1A4", "B003OR3H7Y", "B00JHKSN4O", "B002FCNLHK", "B000A6V8FU", "B008RZJHJU", "B00DLKT4OO", "B00419HNW4", "B002V88HFE", "B00FHRADQ2", "B00B4JM0J0", "B0078WMSZ8", "B000068O3T", "0990463109", "B0019QCH3C", "B000EYULIS", "B004QMXX4S", "B00K8FRZRI", "B000G24ZW6", "B009MAKWC0", "B00JHKSN5I", "B0020ML3ES", "B0002YKBV2", "B000BSZBHS", "B000RNENU8", "B00CWNMR5Y", "B006E0QAFY", "7884890364", "B000CD9XGC", "B008X099PQ", "B000EVWDU0", "B0045XRK06", "B000KIR8M0", "B004GW4S0G", "B000RGF29Q"], "bought_together": ["B000RB60H4", "B000FNR726"], "buy_after_viewing": ["B00HA6QDSU", "B000FNR726", "B002FKNPBY", "B006OSQALU"]}}