{"asin": "B0015BYKGI", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]], "description": "Audio-Technica's ATH-ANC3 QuietPoint Active Noise-Cancelling In-Ear Headphones reduce distracting background noise by 85% while offering the superior sound that makes Audio-Technica a world-leading pro audio company. Engineered to create a comfortable listening environment in areas with high ambient noise, these in-ear headphones feature a miniature microphone in each earpiece that picks up ambient noise (such as traffic, air-handling systems, etc.). Electronics in the control box create a noise-cancelling wave that is 180 degrees out of phase with the ambient noise. This wave acts like a noise eraser: it cancels out the annoying sounds that surround you without diminishing the audio you want to hear. The result is a peaceful enclave to enjoy the music or movies of your choice. Wherever you happen to find yourself--on a busy subway, in a noisy office, or settling in for a long flight--there is no better way to experience audio or immerse yourself a quiet environment.Cancel out the annoying sounds that surround you without diminishing the audio you want to hear.Advanced electronics cancel up to 85% (20 dB) of background noise.Click to enlarge.Includes detachable cable, airline adapter, carrying case, replaceable rubber tips, and battery.Click to enlarge.ATH-ANC3 FeaturesUltra-compact in-ear design is ideal for travelAdvanced electronics cancel up to 85% (20 dB) of background noiseInnovative ANC circuitry delivers an exceptionally pure audio signal in noise-cancelling modeIdeal for use with all audio sources, including MP3 & other portable playersSoft interchangeable ear pieces (small, medium & large) provide a custom fitMonitor switch deactivates noise cancellation/audio so you can listen outside when you need toAudio functions (in passive mode) even without batterySleek control box offers on/off and monitor switches and clothing clipTwo-pin airline adapter connects to in-flight entertainmentHard carrying case protects headphones & accessoriesY cable includes an adjustable sleeve and extension for secure, comfortable fitA single AAA battery powers noise-cancelling electronicsGold-plated mini-plug provides exceptional corrosion resistance, superb conductivity and low noiseAbout Active Noise-Cancelling HeadphonesAudio-Technica's ATH-ANC3 QuietPoint in-ear headphones use active noise-cancelling technology to reduce distracting background noise by up to 85%, providing an exceptionally comfortable and restful listening environment in areas with high ambient noise. Active noise-cancelling headphones have components not present in ordinary headphones:Microphone--Noise-cancelling headphones feature a miniature microphone in the earpiece that picks up ambient noise (such as traffic, air-handling systems, etc.)Noise-canceling circuitry--Electronics in the ear piece create a noise-cancelling wave that is 180&deg; out of phase with the ambient noise. This wave acts like a noise eraser: it cancels out the annoying sounds that surround you without diminishing the audio you want to hear. The result is a peaceful enclave to enjoy the music or movies of your choice.Battery--The noise-cancelling electronics are battery-powered.What's in the BoxATH-ANC3 Headphones (black), Detachable .5 m cable with gold-plated 3.5 mm (1/8-inch) stereo mini plug and jack, Gold-plated airline adapter, Protective carrying case, Replaceable rubber tips, Battery", "title": "Audio-Technica ATH ANC3 NoiseCancel Earphone BK!", "price": 67.49, "salesRank": {"Musical Instruments": 14865}, "imUrl": "http://ecx.images-amazon.com/images/I/519vaiWx5EL._SY300_.jpg", "related": {"also_bought": ["B004DRDRNI", "B000EHCYBC", "B004K09H32", "B00083LFW6", "B002HWJT1A"], "buy_after_viewing": ["B004K09H32", "B004K09H32", "B00CL3TAOQ", "B00D429Y12", "B004P7O26W"]}}