{"asin": "B002NU5O8I", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Mice"]], "description": "The Targus Bluetooth Comfort Laser Mouse connects via Bluetooth so no USB cable or receiver are required providing a clutter free workspace. The ergonomic design is ambidextrous and reduces palm strain while the soft, flexible side grips provide unparalleled comfort during use. The mouse comes equipped with 2 high-quality Energizer batteries and is designed to provide up to 6 months of battery life depending on usage. The battery life indicator always lets you know how much power is left, giving advanced notice when an extra set of batteries are needed. Featuring a sleek and comfortable design, the Targus Bluetooth Comfort Laser Mouse provides wireless convenience for seamless functionality in the office or on the go. Bluetooth technology &#x2013; Mouse functions via Bluetooth connection, no USB cable or receiver required. Dual-purpose design &#x2013; Large enough for comfortable desktop use, yet small enough for the mobile user. Ergonomic &#x2013; Ergonomic shape provides support to help prevent palm strain; designed for left and right handed users. Compatibility &#x2013; PC, Mac and Netbook compatible. RoHS Compliant &#x2013; Yes **Please be advised that new Targus product should arrive in sealed retail packaging as shown in the image gallery.", "title": "Targus Bluetooth Comfort Laser Mouse AMB09US (Black with Gray)", "price": 50.2, "imUrl": "http://ecx.images-amazon.com/images/I/41cfbPgR3jL._SX300_.jpg", "brand": "Targus", "related": {"also_bought": ["B0046TAIUI", "B0099SMFVQ", "B005T4HT24", "B004W8EICW", "B009KY58FE", "B002G9J3MO", "B001EBE1LI", "B007Q45EF4", "B005HU0LX4", "B001715BIC", "B005L38VRU", "B000A0C6OS", "B005DLDO4U", "B00AQ2DS8S", "B008TYJC9E", "B0096M8VR2", "B00EPGHEQS", "B000OOYECC", "B00E1HIVG8", "B002Z2QDNE", "B008OEHPKM", "B00DBV28TG", "B003VANO7C", "B00134D3BA", "B00BALK9CM", "B008ALA6DW", "B00000JRRD"], "bought_together": ["B001EBE1LI"], "buy_after_viewing": ["B00BZC31WQ", "B009KY58FE", "B005T4HT24", "B00DR8LA6U"]}}