{"asin": "B002FU5QMK", "related": {"also_bought": ["B008G9MX48", "B005O9RPQE", "B006T0CHLA", "B0083J8DKE", "B002VKVZ1A", "B00D6GINF4", "B0033Z2BAQ", "B00CRJSX5Q", "B005X3E5BO", "B00B9BDWXG", "B009NB8WR0", "B001DTHT6U", "B00D3F7CFK", "B002FU5QM0", "B00CO8TBOW", "B0036Q7MV0", "B00CO8TA4I", "B00ALK3HF4", "B005L38VRU", "B002HWRJBM", "B00EB7UIRS", "B005O65JXI", "B00CJD4HD2", "B00BCXF6O4", "B00CO8TBQ0", "B00AQ5PK6I", "B00H09BB16", "B009H0XQRS", "B003VAGXWK", "B008DWH00K", "B008I647AM", "B006JH8T3S", "B00F42V83C", "B005BZNDS0", "B00FJRS6FU", "B003NR57BY", "B000J2EN4S", "B005DKZTMG", "B003VANO7C", "B0088PUEPK", "B007PJ4PN2", "B000UEZ36W", "B0086UK7IQ", "B004N8ZQKY", "B008A3KFB8", "B00AWKC0JM", "B00004Z5CP", "B00BP5KOPA"], "bought_together": ["B0083J8DKE"]}, "title": "Logitech Speaker System Z523 with Subwoofer", "price": 83.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41IT-XaRi0L._SX300_.jpg", "brand": "Logitech", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]], "description": "Your music. Your movies. Your games. The high-performance Speaker System Z523 brings them all to life in room-filling 360-degree sound. Unlike traditional one-directional speaker systems, Logitech speakers project sound evenly in all directions. No dead spots. You get the full listening experience--not just in front of the speakers--but everywhere in the room. Two satellite speakers deliver rich mids and crisp highs. The down-firing subwoofer with 6.5-inch pressure driver produces deep bass you can feel. RCA and 3.5mm jacks let you easily connect your Logitech Squeezebox network music player, gaming console, iPod or DVD player. 40 watts (RMS) of power fills the room with crystal-clear sound. And convenient on-speaker controls put complete bass and volume control at your fingertips.Feel the music and action in high-performance all-around soundFeel the bass thumps. Hear the enemy creeping toward you. Experience every emotion in the villain's voice. The Speaker System Z523 floods your room with sound so real and detailed, you'll feel like you're right there in the middle of your music, games and movies. It's deep bass and dynamic sound you can feel. Walk across the room and your music stays rich and balanced, thanks to Logitech 360-degree sound technology. Plug in your iPod, game console or DVD player and bring your favorite music and entertainment to life in room-filling audio clarity. Then turn up the volume and treat yourself to 40 watts of pure, clean listening power. This is the way music, movies and games were meant to be heard&#8212;all the way around.Key FeaturesTraditional desktop speakers focus sound in one listening &ldquo;sweet spot&rdquo;Logitech 360-degree sound for an immersive sound experience, everywhere in the roomYou don't just listen to music at your desk. Shouldn't your speakers deliver great sound no matter where you are in your room? That's not the case with most desktop speakers. They're designed to focus all the sound to one fixed &ldquo;sweet spot&rdquo; directly in front of the speakers. Move out of that narrow sweet spot&#8212;say, over to the couch&#8212;and details drop out. Your music starts to sound muddy.Logitech 360-degree speakers project sound evenly in all directions for a full-room sweet spot&nbsp;Logitech solves the problem with 360-degree sound technology. Rather than using only a forward-firing driver, Logitech speakers are acoustically engineered with both forward- and backward-firing drivers. So sound is projected and reflected more evenly and over a wider range of space. Result? Your whole room becomes a sweet spot filled with clear, rich, music&#8212;even if you're behind the speakers.Down-firing subwoofer with 6.5-inch pressure driver for deeper bass without distortionThis is bass at its deepest best&#8212;low, big and clean. With the down-firing subwoofer, you can literally feel the bass at higher volumes. Deep thumps and rumbles make your gaming and movie watching more intense. And Logitech's 6.5-inch pressure driver completely eliminates distortion. So you hear clean, rich bass, even at window-rattling volume.Integrated jacks for easy connections to music, game and movie playersThis speaker system is engineered to play nice with your other entertainment equipment. RCA jacks and a 3.5 mm input make it a snap to plug in your Logitech Squeezebox network music player, gaming console, iPod or DVD player. There's also a headphone output, so you can listen in private whenever you want.40 watts of power for big, rich, detailed soundYou've got a room full of friends&#8212;and the power to fill it with full-out music. Go ahead. Turn up the volume. Your bass notes will boom. Your high notes will sing. A full 40 watts (RMS) of power will do right by your party mix with big, crowd-pleasing 360-degree sound.Convenient on-speaker controls put volume adjustment at your fingertipsSometimes you're in the mood for soft jazz. Other times you're ready to crank up a night of serious high-octane rock. Either way, the on-board controls put total volume and bass control at your fingertips (you know, just in case the neighbors come knockin').Enhance your listening experience with great Logitech products.Logitech Speaker System 520Bring your music to life&#8212;at your desk and around the house. Its 360-degree sound helps project audio evenly in all directions for great sound throughout the room.Ultimate Ears TripleFi 10 Pro Noise Isolating EarphonesThe integrated passive-crossover circuit board directs the low, mid, and high frequencies to the three dedicated speakers for studio-quality clarity and detail.Ultimate Ears 700 Noise Isolating EarphonesUltimate Ears 700 earphones use a custom-tuned dual-armature micro-design that delivers highly accurate sound reproduction in a compact design&#8212;each earphone is smaller than a dime.What's in the BoxPackage Contents2 satellite speakers1 subwooferCable included: power cable and color-corded audio cablesUser documentationSystem RequirementsWorks with:Computer soundcards or audio sources that include a 3.5 mm jackAny major operating systems including Windows, Mac, and Linux"}