{"asin": "B0050VGZLM", "categories": [["Electronics", "Computers & Accessories", "Laptop & Netbook Computer Accessories", "Batteries"]], "description": "FOUR RECEIVERS-ONE TRANSMITTER\nIf you are fed up trying to find lost items, then you need, Where's the Remote? key & remote finder.  Use the receivers for your remotes, keys, ipad or whatever you consistently lose. If you lose your remote, keys, cell phone, pets or any other item, just push the button on the transmitter and the corresponding colored receiver will begin beeping! Its signal will penetrate through drawers, cushions, pillows, or even walls making it easy to find lost items.  I have it on my cell phone, remotes and keys!  Included is a double-sided sticky adhesive, which makes it convenient for attaching the receiver to your remotes or any item you lose or you can use the key ring.  And you won't lose the transmitter, because Velcro is also included: attach the smooth side to the transmitter and the rough side to the back of the TV, side of the refrigerator or wherever it's convenient for you to store your transmitter.  You won't have to look for the transmitter, as it will always be placed where you last stuck it!   \nAll batteries included!\nTransmitter:27A 12 Volt 23-944)\nReceivers:   (3Volt CR-2032), \nOperation:Press and hold one transmitter button. May have to hold up to 5 seconds to \"wake\" up receiver from battery save mode. Listen/Look for receiver to beep/flash. \nSpecifications: \nReceive distance: Up to 60 feet\nReceiver volume: 85-90 DB\nTransmit frequency: 433.92 MHz", "title": "Key Finder- Wireless remote key, RF Transmitter &amp; Receivers Locator, Wallet, Pet, Cell phone, by &quot;Where's the Remote?&quot; LLC", "price": 28.95, "salesRank": {"Electronics": 5922}, "imUrl": "http://ecx.images-amazon.com/images/I/418ksklTfSL._SY300_.jpg", "related": {"also_bought": ["B0042A9UXC", "B00547IVXM", "B003ZBEBJ2", "B009JJKZSK", "B001TLEXES", "B0030F27EO", "B009JJEPJ0", "B0044WA5N2", "B00H0OL04E", "B0091IKGAG", "B00166FZCA", "B00BXBN2PK", "B009JJJ7S4", "B007JVIK1Y", "B001N03WOM", "B004AT21R2", "B004R67DSA"], "bought_together": ["B0042A9UXC"], "buy_after_viewing": ["B009JJKZSK", "B009JJJ7S4", "B009JJEPJ0", "B00547IVXM"]}}