{"asin": "B000MVBHRW", "related": {"also_viewed": ["B004S561V0", "B00HFW1FUK", "B006ZW4HWY", "B002JTX87W", "B000MSDL6K", "B00HFW1E2Y", "B006ZW4H4C", "B006ZW4HA6", "B00HFW1E6K", "B006ZW4HY2", "B00HFW1E1A", "B0012754UG", "B00AIKU34K", "B004M8SSZK", "B0083SHQEE", "B000OSDLEK", "B006ZW4HAQ", "B00HFW1DY8", "B004M8ST2W", "B004M8STL8", "B0090XX0MS", "B0008ESGAY", "B00HFW1DWK", "B006ZW4IVE", "B004M8SU0I", "B00BOK99MU", "B002DSHMA8", "B0093IZSPW", "B003XEC0I0", "B000NPKO4E", "B004T9R3TE", "B009QZH5D0", "B007OXMHDE", "B000068QIT", "B00B8Y18C6", "B005756GYM", "B003IJ3WIW", "B00264TQRG", "B007BD0GYY", "B000NM8DI6", "B00CX28O56", "B001E7LC46", "B002KGV3C6", "B0093IZNMK", "B003QKBVYK", "B004TE5HBU", "B0009XTDHO", "B001DDUV20", "B00DJVLPKG", "B003VWU14E", "B002R56C4O", "B004OU2IQG", "B0009N9PJA", "B001DDT42I", "B001QWBM62", "B0076OY9XC", "B00J580L8E", "B004OA7QXG", "B00387E5BM", "B00007KJWO"], "bought_together": ["B008I638AM"], "buy_after_viewing": ["B000MYPPPE", "B004S561V0", "B00HFW1FUK", "B006ZW4HWY"]}, "title": "Olympus DS-40 Digital Voice Recorder", "price": 369.99, "salesRank": {"Electronics": 29419}, "imUrl": "http://ecx.images-amazon.com/images/I/41pen2P5TqL._SX300_.jpg", "brand": "Olympus", "categories": [["Electronics", "Portable Audio & Video", "Digital Voice Recorders"]], "description": "In addition to capturing stereo sound from meetings, interviews, and important lectures, the Olympus DS-40 allows you to download and create Podcasts for later listening. The DS-40 offers users up to 136 hours of recording time with its 512 MB worth of internal flash memory. For easy organization and storing of files, the player allows users to set up five voice folders, and each folder can save up to 200 messages. Internal files can be easily navigated on the player's high-contrast backlit monochrome LCD panel. Other great features include a built-in variable control voice actuator (VCVA) function, and a timed recording and alarm feature so you can set up automatic recording and playing. Running on two AAA batteries, the player offers up to 30 hours of continuous playback in the following modes: ST XQ mode (8 hour 40 minute capture time), ST HQ mode (17 hour 20 minute capture time), HQ mode (34 hour 45 minute capture time), SP mode (68 hour 30 minute capture time), and LP mode (136 hour 15 minute capture time). For added user convenience, an optional AC adapter can be used with the recorder. Compatible with Microsoft Windows 2000 Professional operating systems and later, the player measures a pocket-friendly 4.37 x 1.48 x 0.63 inches and weighs in at a scant 2.80 ounces.What's in the BoxDS-40 digital voice recorder, stereo microphone, USB cables, stereo earphones, DSS Player v.7 software, instruction manual, strap, and two AAA batteries."}