{"asin": "B000E204LY", "description": "Designed specifically for your Mac, the Cordless Desktop S 530 Laser for Mac has a stylish white and silver design that perfectly matches both consumer and pro Macs. The ultra-flat profile and built-in palm rest bring an amazing level of comfort. Dedicated one-touch controls for iTunes and iPhoto give you instant access to your music and photos. Programmable keys launch Safari, Mail, Spotlight, or any other application with a single press. The sculpted high-performance cordless laser mouse delivers exceptional comfort and enables pixel-precise photo editing. Longer battery life provides up to 6 months or more of standard use.Ready when you need it.With sophisticated battery management technologies, your batteries will last up to 6 months--or longer!Scroll images with precision.Logitech's high performance laser tracking delivers pixel-precise navigation on virtually any surface.Control the volume and move the web browser back and forward without taking your hand off the mouse,with the five re-programmable buttons.Enjoy maximum comfort through unique design.Great looks are matched by the desktop's outstanding quality and feel. The sculpted right-handed mouse follows the natural shape of your hand and delivers outstanding comfort.Gain instant access to digital music and photos,via dedicated one-touch controls specifically designed to work with iTunes and iPhoto. Dedicated keys launch Safari, Mail, Spotlight, or any other application with a single press. And all direct-access keys can be easily reprogrammed with the included software.Launch your favorite applications,websites or folders with programmable keys.Use it at your desk, or on the go.If you use a PowerBook or iBook, you have the option of easily taking the mouse and mini-receiver with you!Rely on the cordless technology.Logitech's cordless technology avoids interference for completely reliable performance. Fast RF technology provides crisp, immediate mouse response.", "title": "Logitech Cordless Desktop S 530 Laser for Mac ( 967664-0403 )", "price": 59.95, "imUrl": "http://ecx.images-amazon.com/images/I/41VEYAXZDTL._SX300_.jpg", "related": {"also_viewed": ["B005L38VRU", "B006UIACYK", "B005L38VPC", "B000A0C6OS", "B0053V17C6", "B006M7IDTA", "B0076M4HPO", "B0000DBJ8A", "B00ITM5S3U", "B005DLDTAE", "B00354TYM8", "B00G3CLLT8", "B001M4N956", "B00ITLENTQ", "B00ACC0P0Q", "B005DLDO4U", "B003VANO7C", "B0009STJIW", "B00F9VPDJI", "B007X3VEAW", "B002KYA30G", "B00ENZRP0G", "B0074CR19K", "B004ZKXXAK", "B00A7Z0WQ0", "B00KTIYNIS", "B005ONMDYE", "B0078FDOOE", "B001U0WQJM", "B007PJ4PN2", "B005IPKU48", "B003XLYAWC", "B00DR8LA60", "B0081TIE64", "B0099SMFP2", "B005DJ2G46", "B00BP5KOPA", "B00I14395A", "B005JR1LXE", "B004MF11MU", "B000AY2L3U", "B00EDI0WW6", "B0053V17DK", "B0036E8V08", "B00G6IYJHA", "B00BTVJUFK", "B007VL8Y2C", "B002TMRZOQ", "B007X3VEX4", "B00FY6ZAK0", "B00BALYWY8", "B001F51G1G", "B00BGKE8Z6", "B0078FDOPS", "B0011FQUQG", "B003VAGXZC"], "buy_after_viewing": ["B005L38VRU", "B003VANO7C", "B005L38VPC", "B006UIACYK"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Keyboard & Mouse Combos"]]}