{"asin": "B0007U00X0", "related": {"also_bought": ["B00004ZCJM", "B00603RTBY", "B00004ZCI3", "B00603RTC8", "B000H2CHHK", "B001LMQM4O", "B0083WYEHC", "B001542X6E", "B001UE6N8S", "B000IOHLLO", "B00BCEJ0E0", "B00004WCID", "B0040JHVCC", "B00603RW48", "B001CCAISE", "B004ZGM5B2", "B00DMS0GTC", "B007SXJ26A", "B004LEAYXY", "B00007E7JU", "B0080JH3YE", "B00009XVCZ", "B004M170YC", "B004GITBSE", "B0079M711S", "B007SXJ1VG", "B008BBKARI", "B008B48AAE", "B00BXA7N6A", "B002VPE1WK", "B004VTAVLE", "B00009R9EO", "B00AI07F1Y", "B00FP1BQ1Q", "B006Y0YZZ6", "B0081EC08M", "B001UE6N2E", "B00009R9EB", "B009IYBR56", "B002L60TTI", "B001KN77RA", "B003Y35VJA", "B00004ZCIC", "B003TYDBYQ", "B0049XGNKK", "B00HK0A6LQ", "B002KDQPWM", "B0045DMA42", "B003Y60DZO", "B002ZIMEMW", "B006XXQRSM", "B0071RT16Y", "B00CH6ATMO", "B00HVT34FG", "B003U9VONA", "B007M54E1M", "B005H25UVU", "B0045DIO7E", "B004J3V90Y", "B00004ZCI2", "B0037NX6JY", "B002NEGTTW", "B00EE1ZH6I", "B002K4IFY2", "B000CD8BIS", "B002CIP12U", "B004NEJ7HQ", "B0020LB0MO", "B001KELVS0", "B00005K47X", "B004WB8EYM", "B002W3IXZW", "B003V1YGT6", "B00009R6LU", "B00007LA0T", "B001D60LG8", "B0076H8VBK", "1435456912", "B002LTXQUE", "B0053V5MF4", "B004GYZ4JI", "B0002Y5WZM", "B000AM7CJ0", "B0000A1G05", "B00004ZCJI", "B0000BZLBQ", "B0018ZDGAC", "B003Y30334", "B00DCY29G4", "B001TZWFBM", "B004TJ6JH6", "B002WE4H8I", "B0048IW030", "B00FFZM8RI", "B00844N5OC", "B00004ZCFQ", "B0081SS5C8", "B00005061C", "B00DZIFWRU"], "bought_together": ["B00004ZCJM", "B00004ZCI3"], "buy_after_viewing": ["B00K899B9Y", "B0002Y5WXE", "B00004ZCI3", "B00BCEJ0E0"]}, "title": "Sigma 10-20mm f/4-5.6 EX DC HSM Lens for Canon Digital SLR Cameras", "price": 399.0, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41QXCTkeJ2L._SY300_.jpg", "brand": "Sigma", "categories": [["Electronics", "Camera & Photo", "Lenses", "Camera Lenses", "Digital Camera Lenses"]], "description": "Designed exclusively for Canon digital SLR cameras, the ultra-wide-angle 10-20mm offers a view from 102.4 to 63.8 degrees, making it ideal for landscape photography and other vast applications. The lens is distinguished by its three special low dispersion (SLD) glass elements, which effectively compensate for color aberration, and its aspherical lenses, which provide maximum correction for distortion and various aberrations. As a result, the lens produces an extremely high image quality throughout the entire zoom range. The HSM-equipped models, meanwhile, produce fast autofocus (AF) speeds and quiet shooting while still letting you perform full-time manual focus. Other details include a minimum focusing distance of 9.4 inches at all focal lengths and an integral petal-type hood to block out extraneous light.Lens Elements and CoatingThe new multilayer lens coating and lens design reduce flare and ghost--a common problem with digital cameras--while also creating an optimal color balance throughout the entire zoom range. At the same time, the lens offers three SLD glass elements that effectively compensate for color aberration, along with a piece of glass mold and two hybrid aspherical lenses that offer excellent correction for distortion and all types of aberration.Inner Focusing System and HSMThe lens incorporates an internal focusing system that eliminates front lens rotation, letting you use a petal-type hood to protect from additional glare. And models equipped with a Hyper-Sonic Motor (HSM) produce silent, high-speed autofocus and full-time manual focus for Sigma, Canon, and Nikon D-mount lenses.Best Consumer LensThe Sigma 10-20mm lens is so respected that it was named the best consumer lens in Europe (2006) by the Technical Image Press Association (TIPA), a collection of 31 publications from 12 countries. According to TIPA, the 10-20mm lens offers a versatile range of wide-angle focal lengths, a good optical performance, and a budget price, making it an excellent investment for owners of DSLRs with APS-C format sensors. Its sharpness remains constant throughout the zoom range, and its compact size makes it an ideal companion for shooting travel, landscapes, or architectural subjects.Lens construction: 14 elements in 10 groupsAngle of view: 102.4 to 63.8 degreesNumber of diaphragm blades: 6Minimum aperture: f/22Minimum focusing distance: 9.4 inchesMaximum magnification: 1:6.7Filter size: 77mmDimensions: 3.3 inches in diameter and 3.2 inches longWeight: 16.4 ounces"}