{"asin": "B000063TJY", "categories": [["Electronics", "Car & Vehicle Electronics", "Car Electronics", "Car Audio", "Subwoofers", "Component Subwoofers"]], "description": "The BassLink line includes everything you need for great bass in your car, with no hassle. This system includes a round 10-inch woofer, a round 10-inch passive radiator and a 200-watt Class D amplifier, plus all the controls you need to integrate its sound with your existing system. It can be mounted vertically or horizontally for easy placement in any car.Everything you need for great bass in your car, with no hassle.Click to enlarge.Remote level control included.Mount BassLink vertically or horizontally.Click to enlarge.Designed to deliver low frequencies in virtually any car audio system, BassLink truly has universal appeal. Small in size but big in output, BassLink requires a mere .75 cubic feet of trunk space yet produces enough bass to wake up the neighborhood.BassLink consists of a 10-inch subwoofer, 10-inch passive radiator and a 200-watt Class D amplifier housed in a rigid polymer enclosure, all carefully engineered to work together as a unique, integrated system. The extremely versatile BassLink accepts both speaker- and line-level inputs, and it provides an internal low-pass filter, proprietary signal processing and abundant amplification.The BassLink system features a servo-control circuit that continually monitors the voice coil's position in the magnetic gap and prevents the distortion that occurs when a conventional woofer is overdriven. By integrating cone-excursion information with the instantaneous demands of the music, BassLink can extract loud and deep bass from an enclosure smaller than any before.BassLink includes a fixed, 2nd-order, high-pass filter that eliminates the possibility of over-excursion below Fb, the resonant (tuned) frequency of the vented box. This allows the excursion-monitoring circuit to focus on the excursion at the more meaningful frequencies at and above Fb. The result is a significant increase in bass output.User-adjustable controls allow listeners to set the system's response to achieve optimum performance based on the vehicle's cabin gain or transfer function. These controls include: a 0- or 180-degree phase switch; a continuously variable electronic low-pass filter that is adjustable between 70 and 100Hz; variable input sensitivity; and Bass EQ that provides for adjustments between +3 and -6dB. BassLink's frequency response in a typical vehicle is 20 to 100Hz (+/-3dB), but this varies according to the vehicle and user adjustments. At maximum gain, the system can accept inputs as low as 250mV.BassLink can accept up to four channels of input--to provide nonfading bass--either from line-level signals through four RCA jacks or from high-level signals through a pair of Molex connectors, allowing BassLink to be easily connected to OEM systems. If using the speaker-level inputs, an audio-sense circuit will turn on the amplifier whenever a signal is present. If the RCAs are used, a 12-volt, remote-turn-on lead is required. The system has barrier strip connections for power, ground and remote turn-on.What's in the BoxInfinity Basslink 200-Watt Powered Subwoofer System (Black), Bass level control, Wiring harnesses, Mounting feet, Mounting bolts, Instructions", "title": "Infinity Basslink 200-Watt, Dual 10-Inch Powered Subwoofer System (Black)", "price": 179.94, "imUrl": "http://ecx.images-amazon.com/images/I/214YT01EK0L.jpg", "brand": "Infinity", "related": {"also_bought": ["B000FKP7TY", "B001EAWS3W", "B0002UPGOI", "B001U5XKL0", "B001TKUYA6", "B001ANXP26", "B005IY3BI6", "B001AV5ZHQ", "B003KN2TF8", "B002BS5YAA", "B00E3KWHPE", "B000P0PF9G", "B002A98OMA", "B000P0PF8C", "B00292XT2I", "B000LP4RMQ", "B007TBYP72", "B00B4PJC9K", "B0017LFSXU", "B000P0R6LQ", "B007NTWY9G", "B00B41LZ1M", "B007T0NM2M", "B0002BEPJY", "B007ZDCGVG", "B0019G2HA0", "B00B5WJHSI", "B007CMB81O", "B003HY4XRM", "B0002BBP7Y", "B002YWZY0I", "B0002VM8RU", "B004T163SY", "B0039Z3SRA", "B0029QI7KI", "B002C8AFEE", "B0039YWT80", "B0065XBGCC", "B002ISZJHQ", "B000BFL52Q", "B000N5T0T4", "B0002BF0DE", "B001OAB6BW", "B0039Z3T4C", "B003VVYL46", "B0072XTFI6", "B002BZFSYA", "B001912A5W", "B004SUO5QS", "B001M2DSEU", "B007SNMQDQ", "B00ED3BHBG", "B008KNZ2S4", "B00AZOGRSK", "B00GN5K5WO", "B00E0EW3ZW", "B004WWNSMO", "B000OT31IU", "B0029Z2WZU", "B00032AY4M", "B0002BEQJ8", "B000NWCIE6", "B002CMUKZY", "B000P0NJPS", "B000Q6DLTK", "B00006346W", "B00BU2M29O", "B00FPU50NW", "B008869XMO", "B0091UW7F6", "B00F50T8GM", "B003KN2TEY", "B007ZREFCA", "B0050I6KII", "B0092YMZJY", "B00020CATC", "B002CMUL30", "B00D7XNQHG", "B00B2DSX7G", "B005HQ4T6I", "B00A0LZHYS", "B0002BEUZ8", "B001P804SO", "B0007WTEVM", "B001AO2T18", "B006CSSKCO", "B00GN5K45C", "B000Q69P40", "B0002UB296", "B004VBIEZW", "B000MIN0NO", "B0002KR9GG", "B000P0PF9Q", "B004CTBYGE", "B007ZQGZWO", "B00CNUFGN6", "B004T0WFVE", "B004MUGI00", "B007C80T3Q"], "bought_together": ["B000FKP7TY", "B001EAWS3W"], "buy_after_viewing": ["B000FKP7TY", "B00BO8O9XQ", "B001EAWS3W", "B004S4XNEO"]}}