{"asin": "B000HGIWN4", "description": "The D80 packs high performance and high resolution into a body that is more compact and slimmer than previous Nikon digital SLR cameras. True to Nikon's commitment to intuitive operation, the size, layout and operation of all buttons and controls are designed for maximum ease of use, and the included 18-55mm ED II AF-S DX Zoom-Nikkor lens allows you to start shooting right away.Nikon D80 Highlights10.2 effective megapixel Nikon DX format CCDOptimized to capture sharp details, the 10.2 effective megapixel CCD image sensor yields extraordinarily high-resolution images, providing plenty of freedom to crop creatively or print impressive enlargements.Included 18-135mm AF-S DX Zoom-Nikkor lensA key advantage and one source of the fun associated with Nikon digital SLR photography is the ability to take advantage of the creative possibilities offered by interchangeable lenses. The new D80 offers seamless compatibility with Nikon's extensive family of high-performance AF Nikkor lenses, as well as the expanding family of digital-dedicated DX Nikkor lenses, providing superb color reproduction, razor-sharp image clarity, and fast and accurate autofocus performance.This D80 camera kit comes with an 18-135mm AF-S DX Zoom Nikkor lens. Ideal as a normal lens designed exclusively for Nikon DX format SLRs, this 7.5x zoom provides superb versatility in a wide variety of shooting situations. Its new compact rod-type Silent Wave Motor (SWM) enables ultra-high speed autofocusing with exceptional accuracy and super-quiet operation, its ED glass element achieves minimized chromatic aberration and superior optical performance, and its non-rotating front design provides for more convenient use with circular polarizing filters and the D80's Wireless Close-up Speed System.The 18-135mm lens also enables quick switching between autofocus and manual operation, plus a seven-blade rounded diaphragm for more natural out-of-focus highlights. In addition, the Internal Focus (IF) system provides fast and quiet auto-focusing without changing the length of the lens, retaining subject-working distance through the focus range.Advanced Auto Exposure systemConsistently dependable exposure is the hallmark of Nikon's exclusive 3D-Color Matrix Metering II. Refinements for the D80 include its inheriting the advanced exposure evaluation system from the Nikon D2Xs and D200 digital SLR cameras. Brightness, color, contrast, selected focus area and camera-to-subject distance information is evaluated, with the results referenced against the expansive onboard database of exposure data from over 30,000 actual photographic scenes, and the final exposure value calculated--instantly. Variable-size center-weighted metering is also available, as are a choice of 11 spot meters linked to each of the 11-area AF system's area sensors.Broad ISO-equivalent sensitivity rangeThe D80 features extensive range for sure performance through diverse lighting conditions. Sensitivity can be set manually between ISO speeds of 100 and 1600 in 1/3-EV increments, or boosted even higher using the HI-0.3, HI-0.7 or HI-1 settings. Automatic sensitivity adjustment (ISO AUTO) is also available offering the freedom to concentrate on composition while the camera selects the right sensitivity for the shot.Precision white balanceAdvanced Auto White Balance (AWB) produces natural coloration by matching white balance to the light source of the shot. Other flexible options include a choice of six specific manual settings with fine-tuning, (Incandescent, Fluorescent, Direct Sunlight, Flash, Cloudy, and Shade), as well as a preset option for using a gray or white object as a reference.An 11-area autofocus system ensures precise focusing under varying shooting conditions11-area AF systemThe D80 inherits Nikon's advanced Multi-CAM 1000 AF Sensor Module that recently debuted in the D200. Refinements to this new 11-area AF system ensure consistently fast and precise focus lock under varying shooting conditions, all while the addition of effective new focusing options instills photographers with greater confidence to get the desired shot. For example, while the system is able to use each of its 11 focus areas individually, the center sensor can also be switched to wide-frame operation for broader coverage. Refinements to the programming algorithms that control lens focus action further improve system response and focus precision, along with subject acquisition and tracking abilities.Auto-area AF modeThis new mode measures all 11 focus areas, automatically determines which of them are on the primary subject, and activates only those areas. During AF measurement, all focus areas that lie within the range of proper focus blink for easier confirmation.Optimized color modesNikon's advanced color reproduction system optimizes the three available color modes to best match the subject or intended use for the image.Mode Ia: Renders natural-looking skin tones out of the camera. (sRGB)Mode II: Realizes a wider color range suitable for processing or retouching. (Adobe RGB)Mode IIIa: Renders vivid landscape and floral colors out of the camera. (sRGB)Instant start-up and immediate responseThe D80 starts up in approximately 0.18 seconds, so it's ready to shoot immediately. Its short shutter release time lag of approximately 80 milliseconds helps ensure instant response while shooting, as does the fast and precise focus of the new 11-area AF system with AF-assist illuminator. Images are processed and recorded extremely quickly. Preview images are displayed instantly.The D80 is capable of shooting a rapid three frames per second in continuous bursts of up to 100 imagesHigh-speed continuous shootingCapable of shooting a rapid 3 frames per second in continuous bursts of up to 100 JPEG (FINE M-size or smaller) or 6 RAW (NEF) images, the D80 makes it easier to stay on top of the action or to capture those unexpected, yet precious picture opportunities. Refinements to achieve this performance include improved processing speed, optimized buffer memory handling, as well as higher data transfer rates.Broad shutter speed optionsShutter speeds from 30 to 1/4,000 seconds can be selected manually or used in conjunction with the automated program modes. Bulb and time options as well as flash-synchronized shutter speeds of up to 1/200 seconds further enhance the digital photo experience.Enjoy easy in-camera optimizationOptimize image optionsEasily accessed optimization options closely tailor results to the scene at hand or the intended use of the image. Image sharpening, tone compensation, color mode, saturation and hue adjustment is controlled by the user-selected choice of Normal, Softer, Vivid, More vivid, Portrait, Custom or Black-and-white options.Multiple exposureThis feature creates a single image within the camera from up to 3 consecutive exposures, producing an effect that resembles multiple exposure techniques used with film.Higher energy lithium-ion batteryThe EN-EL3e rechargeable lithium-ion battery with increased energy capacity delivers enough power to shoot as many as 2,700 images per charge. The battery can be recharged at any time, and it now features an accurate real-time fuel gauge system that displays the percentage of remaining charge, number of shots since last charge and overall status of battery service life.In-camera editing functions include red-eye removalIn-camera image editing functionsExclusive in-camera image editing features under the new Retouch menu help ensure consistently satisfying results and greater creative freedom. D-Lighting automatically brings out detail to enhance results and add creative flair, all while achieving overall exposure balance. In-camera Red-eye correction automatically detects and compensates the annoying red-eye effect sometimes caused by flash. Images can be trimmed within the camera to produce smaller files for easy sharing or greater efficiency for specific end purposes.Greater operating ease with Nikon ergonomicsThe D80 packs high performance and high resolution into a body that is more compact and slimmer than previous Nikon digital SLR cameras. True to Nikon's commitment to intuitive operation, the size, layout and operation of all buttons and controls are designed for maximum ease of use.Large wide-angle 2.5-inch LCD monitor with improved menusThe D80 features a large new 2.5-inch 230,000-dot high-resolution LCD monitor that provides an ultra-wide 170o viewing angle from all directions. To accurately assess sharpness, images can be easily previewed at up to 25 times magnification using new dedicated zoom buttons. A new RGB histogram display aids in evaluating exposures with greater precision. Other playback options include single frame, 4 or 9-image thumbnail display, an improved histogram display and highlight point display. Refinements to the new menu interface make navigation easier on the eye, easier to understand and easier to use. The carefully chosen color scheme helps make the larger font size of menu items remarkably easy to read. Menus can be customized to display only selected items using the new \"My Menu\" set.Automated Digital Vari-Program and Exposure modesA selection of 7 Digital Vari-Programs makes creative photography as simple as rotating the mode dial. Choose from Auto, Portrait, Landscape, Close Up, Sports, Night Landscape, or Night Portrait and the selected program automatically optimizes white balance, sharpening, tone (contrast), color, saturation and hue settings to best match the scene. Greater personal control over camera operation is provided by the Programmed auto [P], Shutter-Priority Auto [S], Aperture-Priority Auto [A] and Manual [M] exposure modes.Large, bright 0.94x viewfinderAnother important new feature of the D80 is the adoption of the pentaprism viewfinder from the D200. This new eye-level optical viewfinder features large magnification (0.94x) that helps ensure a clear view for precise composition. The diopter adjustment control knob also makes it easier to fine-tune the view to match eyesight. The viewfinder's integrated grid display can also be turned on to assist composition.Storage media (SD memory card)The D80 is compatible with SD memory cards. Already widely in use around the world and available in a variety of capacities, SD memory cards feature efficiency and convenience in a slim, compact design.Built-in slideshow functionsBuilt-in slideshow options for the D80 include Standard or Pictmotion, which includes style selections that control transitions and background music. Shows can be enjoyed on the camera's 2.5-inch LCD monitor, or complete with audio on a television when connected via the supplied AV cable.Built-in flash with i-TTL flash controlThe powerful built-in flash does much more than fire when natural lighting is inadequate or effectively add balanced fill flash when there is strong backlighting. Nikon's highly robust i-TTL flash control evaluates flash exposure with greater precision to achieve better automatic flash balance and deliver outstanding results. It also helps realize features such as Repeating flash function for creating stroboscopic effects and the Modeling Flash, which allows photographers to visually check for shadows and reflective objects and assess overall lighting prior to shooting. Full support for the Advanced Wireless Lighting System lets the built-in flash function as a remote commander that provides direct control to wireless SB-800 or SB-600 Speedlights.What's in the BoxD80, 18-135mm AF-S DX Zoom-Nikkor lens, rechargeable lithium-ion battery (EN-EL3e), quick charger (MH-18a), AV cable (EG-D2), USB cable (UC-E4), strap, body cap, eyepiece cap, rubber eyecup, LCD monitor cover, accessory shoe cover, PictureProject software CD-ROM", "title": "Nikon D80 10.2MP Digital SLR Camera Kit with 18-135mm AF-S DX Zoom-Nikkor Lens", "imUrl": "http://ecx.images-amazon.com/images/I/41CAN3SSW0L._SX300_.jpg", "related": {"also_bought": ["B001T9N120", "B000O161X0", "B0012OGF6Q", "B00301I82I", "B000NOEDGK"], "bought_together": ["B001T9N120", "B003VNKNF0"], "buy_after_viewing": ["B003VNKNF0", "0470120517", "B00301I82I", "B003L1ZYZ6"]}, "salesRank": {"Camera &amp; Photo": 8059}, "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Camera Bundles"]]}