{"asin": "B00005B44D", "description": "It's the new millennium. Civilization is near collapse. The world economy is in chaos. The middle class no longer exists. Deadly viruses have ravaged the earth's population. Terrorism runs rampant. From this maelstrom of violence and suffering an ancient conspiracy bent on world domination emerges from the shadows of legend. The conspirators' greatest strength? No one believes they exist. No one but you.InDeus Ex, immerse yourself in an intricate web of betrayal and intrigue as you attempt to uncover power struggles, hidden agendas, and the dark conspiracy behind it all. Travel the globe building a network of allies and create an alternate identity to aid you in your search for the truth. There is no one path to success. It is achieved through various means; employ stealth, strategy, or force--the choice is yours. But remember, trust no one. Even those who you keep as allies may be more than they seem. Question everything.This game incorporates role-playing, action, adventure, and first-person shooter genres into a chaotic blend of real-world conspiracies, cliffhangers, and plot twists. Explore a richly simulated world of unparalleled interactivity, engineered to react logically to your every action. The Game of the Year Edition now includes DX Multiplayer, DeathMatch, and Team DeathMatch, plus five new multiplayer maps and a built-in search engine for multiplayer servers. The bonus soundtrack CD contains 30 tracks remixed for higher audio quality. With the included software development kit, you can create standaloneDeus Exmissions, build 3-D maps from scratch, or modify existingDeus Exmaps; you can also create new conversationsbetween game characters with ConEdit. The package includes aDeus ExWindows desktop theme.", "price": 9.79, "imUrl": "http://ecx.images-amazon.com/images/I/51EGJ4XKGRL._SY300_.jpg", "related": {"also_bought": ["B00009WDLD", "B00002SUOV", "B005EZ5GQO", "B00000K4AX", "B0001NJHH8", "B000H1AGA6"], "buy_after_viewing": ["B002I0HKRQ", "B002XTYK9S", "B001BWEIAE", "B0000CNUUP"]}, "salesRank": {"Video Games": 33842}, "categories": [["Software", "Design & Illustration"], ["Software", "Lifestyle & Hobbies"], ["Video Games", "PC", "Games"]]}