{"asin": "B00006B7HB", "description": "Microsoft has replaced the old-fashioned mouse ball with the Wheel Mouse Optical, featuring an IntelliEye optical sensor to provide smooth and precise motion. Without a mouse ball, there are no moving parts to clean or wear down. The IntelliEye optical sensor is sealed in to keep out the dirt and lint that can cause a traditional mouse to skip or jam.The Wheel Mouse Optical comes with a scroll wheel for scrolling and zooming. Move through documents by simply rolling the wheel forward or backward instead of clicking on a scroll bar. Use the wheel to see either close-up or big-picture views without having to use menus or toolbars (in compatible applications). The mouse also features an ambidextrous design for comfort. Whether you are left-handed or right-handed, have a large or small hand, the design of the Wheel Mouse Optical feels comfortable.The Wheel Mouse Optical's IntelliEye optical sensor scans the desktop 6,000 times per second, delivering smooth, precise motion on virtually any surface, even through dirt, dust, and fingerprints. The IntelliEye sensor performs best on surfaces with detail to track. It will not function on surfaces without visible detail (e.g., glass) or surfaces where it will see its reflection (for example, mirrors or glossy surfaces). The sensor may also have difficulty tracking on highly repetitive patterns (for example, some printed photographs from magazines or newspapers).Microsoft offers a three-year warranty on the Wheel Mouse Optical.", "title": "Microsoft Wheel Mouse Optical", "price": 9.99, "imUrl": "http://ecx.images-amazon.com/images/I/31N7ENCV2ZL._SX300_.jpg", "related": {"also_bought": ["B00005TQ08", "B000V7ARAU", "B009SPWCFY", "B000GOUE7O", "B00A1702Z0", "B00006HTZ0", "B004SUIMGW", "B005058AE8", "B006AR2ULO", "B005058AH0", "B000UEZ36W", "B000A6NUU6", "B000A6PPOK", "B004SUILFO", "B003FOWIXK", "B005058AHU", "B003ELVLKU", "B004SUIM4E", "B0000365QL", "B00000JRRD", "B0068INSUM", "B005DLDTAE", "B005J2F7NE", "B008HD3CTI", "B004JQQDZ2", "B005T3GRNW", "B005BZNDOO", "B005JN9310", "B00H09BOXQ", "B00006BA0V"], "buy_after_viewing": ["B009SPWCFY", "B00005TQ08", "B005EJH6RW", "B002B3YCQM"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Mice"]]}