{"asin": "B00HNWHW9A", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]], "description": "Portable Bluetooth Speaker- Amazing SoundImpressive both in size and in sound, SoundScape 8 is a force to be reckoned with. Clad in a metal housing and equipped with high-efficiency drivers backed up by a passive bass woofer Soundscape 8 is here to blow your socks off. It houses two premium 50 mm drivers and a large sub woofer, which means that it delivers unbelievably rich powerful sound. Small enough to carry around yet big enough for home use as well. Measuring 10 inches long by 3 inches high this Potable Bluetooth Speaker is small enough to carry around yet big enough for home use as well. Keep the party going with its amazing 10 hour battery. Includes a USB charger to power SoundScape 8 up when it runs low on juice. Perfect for watching movies or playing games on you iPhone, iPad or Android deviceFeaturesWireless Bluetooth Speaker - Connect wirelessly up to 33 feet away.Rich Robust Sound &ndash; 10 Watts of power. Fitted with two 50 mm drivers and a sub woofer that can handle a wide range of music/>Incredible Value - Not only is the Soundscape 8 Sleeker and Lighter than the Big Jambox, it cost a fraction of the price.10 Hour lithium Ion Rechargeable Battery- 10 Hours of music with just a single, quick charge.3.5mm Audio Aux input- Dont have Bluetooth? You can easily connect the Soundscape 8 to any 3.5mm audio connectionCompatibilityAll Bluetooth enabled devicesAny Device with an 3.5mm Audio OutputWarranty1 Year Parts &amp; Labor", "title": "Photive SOUNDSCAPE 8 Portable Wireless Bluetooth Speaker with 8 Hour Battery and Built in Speakerphone. 2014 New Release.", "price": 99.95, "imUrl": "http://ecx.images-amazon.com/images/I/41C7CtIzrdL._SY300_.jpg", "brand": "Photive", "related": {"also_bought": ["B00K589F8A", "B00D6OHHEE", "B00D6OHHO4", "B00ES2BQ7M", "B00D6OHHRG", "B00L3YHF6O", "B00HTPHK5W", "B005TAXDPK", "B004C51HRY", "B00D6OHHIA", "B00GZC35YK", "B00GKOZ5DC", "B004LTEUDO", "B00FAAGNLU", "B00E174RTS", "B007Q45EF4", "B00GTGETFG", "B00J3PMU4C", "B000GCLTVG", "B00CYLU1EI", "B0009YDQE4", "B00A35WYBA"], "bought_together": ["B00K589F8A"], "buy_after_viewing": ["B00K589F8A", "B00D6OHHEE", "B00ES2BQ7M", "B00D6OHHRG"]}}