{"asin": "B001OMGXO0", "description": "Built like a shell with high-density padding and rainproof nylon fabric, LA besace is still a fashion icon. Its curves, trendy inner color, and other details make a statement of style wherever you take it.LA besace FeaturesHigh-density padding to protect your computerRainproof nylon exteriorMetal hardware and waterproof zipperHigh-grade nylon shoulder webbingMultiple pockets to organize your gearDid we mention storage?While the main compartment is totally secured by a zipper, you can conveniently store small items on the go in the two fast-access pockets (one on the flap, one hidden on the back). Inside, organize your items between the computer space, the documents folder, the three pockets (two secured by zippers), pen holders, business card holder, and ID tag pocket.Will the LA Besace fit my Laptop?La Besace offers a tailor made solution and is designed to fit most Laptop and Mac computers!Be.ez offers innovative design for everyoneFor users with the greatest mobility needs, be.ez also boasts a complete selection of Sleeves for your Laptop, Mac, or Netbook that embody the same sleek and functional design values, with a certain indefinable charm that makes the range so distinctive. (LA robe)Who is be.ez?be.ez (be easy) is a French brand with a true international approach to design, and manufacture, in order to offer original solutions for &lsquo;mobile life&rsquo;. The adventure of be.ez was born out of a simple observation: there does not exist today a real alternative to the austerity in the computer accessory market. Be.ez thus decided to specialize in the creation of products and accessories, both original functional and well designed.", "title": "Be.ez 100726 LA besace 15 Lime Drop Messenger Bag for Macbook Pro 15 (Grey / Lime)", "price": 44.32, "imUrl": "http://ecx.images-amazon.com/images/I/41FvnVckw4L._SX300_.jpg", "related": {"also_viewed": ["B001ITJFPS", "B0014ISVMG", "B004INRHXS", "B00BQU0ZRG", "B007M4Y4QI", "B00DND5902", "B00DR7H042", "B00GPDJ2O6"], "buy_after_viewing": ["B001ITJFPS", "B005QT6F0E", "B004INN2IC", "B0014ISVMG"]}, "categories": [["Electronics", "Computers & Accessories", "Laptop & Netbook Computer Accessories", "Bags & Cases", "Messenger Bags"]]}