{"asin": "B002I0GZ5Y", "description": "Play as Terra, Ventus, and Aqua &ndash; three friends with a common dream who find themselves in the middle of a crisis affecting worlds far beyond their own. Their destinies will unfold across memorable Disney worlds in three intertwining stories. Secrets will be unraveled and friendships will be tested. The KINGDOM HEARTS saga starts here.View largerView largerView largerView largerView largerKey FeaturesAn essential piece to theKINGDOM HEARTSseries arrives on the PSP system:From world-renowned creator and character designer Tetsuya Nomura comes the latest installment in the belovedKINGDOM HEARTSseries. The vibrant and colorfulKINGDOM HEARTSworld comes to life in 16:9 widescreen presentation, through stunning graphics made possible by the PSP system hardware.Disney worlds and characters new to theKINGDOM HEARTSseries:Disney worlds and characters never before seen inKINGDOM HEARTS, such as Enchanted Dominion (Sleeping Beauty) and Castle of Dreams (Cinderella) will make their first appearances inKINGDOM HEARTS Birth by Sleep.Three distinct gaming experiences through the eyes of three protagonists:Unravel the mystery surrounding the origin of theKINGDOM HEARTSsaga through the tales of three unique characters&mdash;Terra, Ventus and Aqua. The whole story is revealed only after playing through with all three characters.An action-packed combat system with intuitive controls:The familiar action-packed experience thatKINGDOM HEARTSfans have come to embrace returns with an enhanced battle system and all-new features such as Command Styles, Command Decks, Shotlocks and Dimension Links.KINGDOM HEARTS Birth by Sleepis the most advancedKINGDOM HEARTStitle to date.Four exciting multiplayer modes:Experience the excitement and fun with your friends with four brand-new multiplayer modes: Versus Mode, Arena Mode, Command Board and Rumble Racing.New game features:The North American release will include a number of new features including an extra boss, additional multiplayer options, and Crown Stickers: a reward system where players earn prizes by collecting and placing stickers into an album.An outstanding voice cast:KINGDOM HEARTS fans will surely be in for one unforgettable experience, thanks to an impressive voice cast featuring the talents of Mark Hamill, Willa Holland, Jesse McCartney, Leonard Nimoy and James Woods, among others.One of a certain Keyblade Master's three pupils. Beneath Terra's mellow exterior lies a young man with tremendous drive; he is wholly devoted to his training and determined to find greater strength. He relies on brute force in combat.A kind young woman whose sense of right and wrong never wavers. Aqua's dignified bearing belies an inner sensitivity, and she often looks after Terra and Ventus, who study with her under the same Keyblade Master. She is nimble and gifted at magic.A cheerful and likeable boy who studies with the same Keyblade Master as Terra and Aqua. For \"Ven,\" as his friends affectionately call him, every day is a new discovery. He holds his Keyblade with a reverse grip, and fights with incredible speed.", "price": 126.93, "imUrl": "http://ecx.images-amazon.com/images/I/51xBw7TfQwL._SY300_.jpg", "related": {"also_bought": ["B001KMRN0M", "B0014X7SQ6", "B001TD6SN0", "B002I0GXWO", "B001GXI4LM", "B001TD6SK8", "B002I08UPC", "B000SSPH3E", "B000F2DE8S", "B006OI3CTS", "B001G3B0HC", "B000NPTOTK", "B001TOQ8T8", "B004OP65CY", "B000ASBKHE", "B000G79XQO", "B004LLRYOY", "0744012392", "B007ZH9OFI", "B001N2EVPE", "B002DGNLFK", "B000G0O6CW", "B0007V46JI", "B003O21OWY", "B003YVK5T8", "B001CM0PJ6", "B0009A4EVM", "B0050JN84Q", "B000R37S00", "B0045SE9XC", "B000E0OCR8", "B001HWF1OA", "B000AAZC08", "B002BS47TE", "B000QTD05M", "B004BV5O0U", "B001CM62UM", "B0010ZJFKA", "B000CI83LI", "B002BSC5AC", "B002P69VAC", "B001TIFML4", "B0010YOQIW", "B0051TLBKI", "B000AOEUZ2", "B0015A8RQ8", "0744005264", "B0009350CQ", "B002BSC57U", "B008SBZD5U", "B000066TS5", "B000VIUNZI", "B00COUW1BU", "B00068O278", "B002TK3GH8", "B0019C6KAC", "B007M6W36Y", "B0009DPQYI", "B00168PFFK", "B000FZYY3E", "B000VIPJ0W", "B002L2V8LA", "B001V7UX1W", "B005IF00ZM", "B000H1R0D2", "0744014026", "B000R37S78", "B00DUANBQM", "B0013AX2JM", "B000NPOGWK", "B004I8EEMU", "B0007U2CX6", "B000A8FV3S", "B0007UDYTW", "B0009XBXQ8", "B000F4MEKK", "B00829H3E2", "B001TILU88", "B000R39IKI", "B000LEFKXC", "B000CBCVEK", "B00BFU8IFS", "B002DMJ0RM", "B003WTR2QQ", "B000HQG5FG", "B002E6XY6K", "B003ALEWKU"], "buy_after_viewing": ["B001KMRN0M", "B006OI3CTS", "B001TD6SK8", "B002I0GXWO"]}, "salesRank": {"Video Games": 2301}, "categories": [["Video Games", "Kids & Family", "Sony PSP", "Games"], ["Video Games", "Sony PSP", "Games"]]}