{"asin": "B003924UBG", "categories": [["Electronics", "Television & Video", "Televisions", "Plasma TVs"]], "description": "Building on its award-winning 2009 Plasma line, Panasonic's 42-inch VIERA TC-P42G25 Plasma HDTV features a new panel with NeoPDP technologies that provide the best balance of black and white under brighter environments while also offering higher energy efficiency. The new NeoPDP Plasma panel also further reduces reflections and creates sharper pictures with higher contrast in brighter environments. This G25 series model provides 1080p resolution, full-time 1080 TV lines of moving picture resolution, and 600Hz Sub-field Drive for superb motion clarity.This and other models in the G25 line offer Panasonic's improved VIERA Cast functionality, which enables you to stream Internet video and audio programming as well as turn this HDTV into a high-definition, wireless video conference center with Skype capabilities (when using the optional Panasonic communication camera and Wi-Fi adapter accessories). You can also play back JPEG images and AVCHD videos stored on SD memory cards and operate a variety of VIERA Link components--from Blu-ray Disc players to digital cameras--through a single remote.Adhering to Panasonic's commitment to the environment, this VIERA model--as well as all 2010 models--features improved power consumption and meets the new, more stringent Energy Star 4.0 requirements. And you'll get a long Plasma panel life of up to 100,000 hours--more than 30 years of viewing when watched 8 hours a day--before the brightness of the panel decreases to half.Key FeaturesPanasonic's VIERA G25 series Plasma HDTV with streaming content from VIERA Cast partners.VIERA Cast:Enjoy a variety of streaming movies, TV shows, and music, photo slideshows, and home video conferencing with VIERA Cast's assortment of online content--including Amazon Instant Video, Netflix, Pandora, Twitter, YouTube, and Picasa. VIERA Cast's addition ofSkype(requires optional communication camera; model TY-CC10) enables you to connect and communicate through voice and video calls from the comfort of your own living room.This VIERA HDTV includes two USB ports for connecting a keyboard or a Wi-FI LAN adapter (sold separately) as well as an Ethernet port for wired LAN connection. No PC required.&nbsp;VIERA Image Viewer:View full-HD images with the integrated SD card slot, enabling you to view JPEG photos and AVCHD videos captured from your digital camera or camcorder on the big screen. Navigate your images via an easy-to-use thumbnail display, and choose from among five types of background music and five display effects. Plus, messages and memos can be added to photos from a PC to create detailed travelogues and original slideshows with messages.&nbsp;VIERA Link:Allows the interlinked operation of various AV devices--from DVD and Blu-ray Disc players to home theater sound systems to digital cameras and camcorders--using only the VIERA remote control by simply connecting the devices to each other by an HDMI cable (seepop-up illustration).&nbsp;Game Mode:With Game Mode, quicker image response increases the enjoyment of video games when a game console is connected to the TV. What's more, VIERA produces the dark images in video games more clearly. This mode works with the anti-image retention (wobbling) function, too.NeoPDP:By redesigning the Plasma panel's cell structure and developing an innovative new filter, Panasonic has tripled the luminous efficiency (compared to 2007 models) of its VIERA Plasma HDTVS--resulting in stunningly beautiful images while also reducing power consumption.&nbsp;1080 Moving Picture Resolution:With 1080 lines of moving picture resolution and integrated NeoPDP technology's high-speed drive performance, the display time for each image frame is shortened to minimize afterimages, making decisive calls in football matches and delicate motions in figure skating performances appear crystal clear.&nbsp;600Hz Sub-field Drive:600Hz technology lets you view superb full-HD motion and still images with 1080 lines of resolution. For even greater clarity with motion images, Panasonic uses its own unique image-analysis technology, which converts the motion in each scene into data. And each frame is practically displayed for a shorter length of time than in previous systems, to reduce aftereffects (see anillustration of 600Hz technology).&nbsp;Infinite Black:The luminous efficiency of this NeoPDP Plasma panel has been improved by reducing the electrical pre-discharge that causes graying has greatly enhanced black gradation. The result is crisp blacks with no graying--even in living rooms with bright, afternoon lighting. And minimizing the electrical pre-discharge helps to both raise contrast and save energy.&nbsp;THX Certified Display:THX reproduces film images as the filmmakers intended them. To receive THX certification, TVs undergo stringent tests to determine, for example, whether the exact same brightness and color are displayed at all screen locations, and whether black levels satisfy standard criteria.&nbsp;Key SpecificationsSeries:G25Screen type:PlasmaScreen size:42 inchesNative resolution:1920 x 1080 pixelsContrast ratio:Infinite Black with 5,000,000:1 native/dynamic contrastShades of gradation:6,144 equivalentHDTV display capability:1080p, 1080i, 720pEDTV display capability:480pSpeakers:2 full range, 20W total power; surround sound capabilitiesImage viewer:AVCHD, MPEG2, JPEG compatibilityAspect control:Normal, Zoom, Full, Just, H-fill for TV/AV modes 4:3, Full for PC modeOptional wall-mounting bracket:TY-WK4P1RWMulti-lingual menu:English/Spanish/FrenchEnergy Star qualified:YesConnectionsHDMI: 3 (1 side)Component (Y, PB, PR): 2; each with audio inputComposite A/V: 2 (1 side); each with audio inputEthernet: 1USB: 2PC input (15-pin, D-Sub): 1Digital audio output: 1DimensionsTV with stand: 40.6 x 27.3 x 12.2 inches (WxHxD); 70.6 poundsTV without stand: 40.6 x 25.8 x 3.5 inches (WxHxD); 65 poundsWhat size TV should you get?What's in the BoxPanasonic G25 series Plasma HDTV, removable stand, remote control (with batteries), operating instructionsHEADING row -Series:VT25 PlasmaGT25 PlasmaG25 PlasmaS2 PlasmaU2 PlasmaC2 PlasmaU22 LCDX2 LCDC22 LCDSUBHEADING row - linksModels:TC-P54VT2554\"TC-P50VT2550\"TC-P50GT2550\"TC-P42GT2542\"TC-P54G2554\"TC-P50G2550\"TC-P46G2546\"TC-P42G2542\"TC-P65S265\"TC-P58S258\"TC-P54S254\"TC-P50S250\"TC-P46S246\"TC-P42S242\"TC-P50U250\"TC-P42U242\"TC-P50C250\"TC-P46C246\"TC-P42C242\"TC-L42U2242\"TC-L37U2237\"TC-L32U2232\"TC-L37X237\"TC-L32X232\"TC-L22X222\"TC-L37C2237\"TC-L32C2232\"spec rowVIERA CastVT25GT25G25S2--U2--C2--U22--X2--C22--spec rowVIERA Image ViewerVT25(AVCHD/MPEG2/JPEG/MP3 playback)GT25(AVCHD/MPEG2/JPEG/MP3 playback)G25(JPEG)S2(JPEG)U2(JPEG)C2(JPEG)U22(JPEG)X2(JPEG)C22(JPEG)spec rowVIERA LinkVT25webcam capableGT25webcam capableG25webcam capableS2U2C2U22X2C22spec rowNeoPDP PanelVT25--GT25--G25S2U2--C2--U22--X2--C22--spec rowTHX DisplayVT25GT25G25S2--U2--C2--U22--X2--C22--spec rowContrast RatioVT25Infinite Black Pro / 5,000,000:1 NativeGT25Infinite Black / 5,000,000:1 NativeG25Infinite Black / 5,000,000:1 NativeS2Dynamic: 2,000,000:1U2Dynamic: 2,000,000:1C2Dynamic: 2,000,000:1U22Dynamic: 20,000:1X2Dynamic: 20,000:122\": 15,000:1C22Dynamic: 18,000:1spec rowMoving Picture ResolutionVT251080 linesGT251080 linesG251080 linesS21080 linesU2900 linesC2720 linesU22--X2--C22--spec rowAnti-Reflective FilterVT25GT25G25S2U2--C2--U22--X2--C22--spec rowDisplay CapabilitiesVT251080p, 1080i,720p, 480pGT251080p, 1080i,720p, 480pG251080p, 1080i,720p, 480pS21080p, 1080i,720p, 480pU21080p, 1080i,720p, 480pC2720p, 480pU221080p, 1080i,720p, 480pX2720p, 480pC22720p, 480pspec row600Hz Sub-field DriveVT25GT25G25S2U2C2U22--X2--C22--spec rowspec rowGame ModeVT25GT25G25S2U2C2--U22--X2C22--spec rowSpeakersVT253; 30W totalGT252; 20W totalG252; 20W totalS22; 20W totalU22; 20W totalC22; 20W totalU222; 20W totalX22; 20W total22\": 6WC222; 20W totalspec rowSurround SoundVT25GT25G25S2U2C2U22X2C22spec rowHDMI inputVT254 (1 side)GT253 (1 side)G253 (1 side)S23 (1 side)U23 (1 side)C22U223 (1 side)X23 (1 side)22\": 1C222spec rowComponent input(Y, PB, PR)VT252GT252G252S22U22C22U221X21C221spec rowComposite inputVT252 (1 side)GT252 (1 side)G252 (1 side)S22 (1 side)U22 (1 side)C22 (1 side)U222 (1 side)X22 (1 side)22\": 1C222spec rowPC inputVT251 (side)GT251 (side)G251 (side)S2--U2--C2--U221X21C221spec rowUSBVT252GT252G252S2--U2--C2--U22--X2--C22--spec rowEthernet LAN inputVT251GT251G251S2--U2--C2--U22--X2--C22--spec rowDigital Audio outputVT251GT251G251S21U21C21U221X21C221spec rowiPod Universal DockVT25--GT25--G25--S2--U2--C2--U22--X2C22--spec rowEnergy StarVT25GT25G25S2U2C2U22X2C22HEADING row - SeriesSeries:VT25 PlasmaGT25 PlasmaG25 PlasmaS2 PlasmaU2 PlasmaC2 PlasmaU22 LCDX2 LCDC22 LCDWhich Size HDTV is Right for My Room?With standard-definition TVs, the rule used to be that viewers would feel comfortable watching a set from a distance of 3 to 6 times the screen size in inches. With HDTV, the resolution is so much better that you can sit closer to a larger TV without noticing the pixels. So with HDTVs, the rule tends to be you can sit anywhere from 1.5 to 3 times the screen size (in inches) for the best experience.If you know the size of the room you have already, where you want to sit, and where your new HDTV should go once you get it, you can figure out the size HDTV you should get.Minimum size = Viewing distance/3Maximum size=Viewing distance/1.5To learn more about Internet-ready HDTVs, visitInternet-Ready TV 101.", "title": "Panasonic VIERA TC-P42G25 42-Inch 1080p Plasma HDTV", "price": 5.99, "salesRank": {"Electronics": 52071}, "imUrl": "http://ecx.images-amazon.com/images/I/51xnNHCuLML._SY300_.jpg", "related": {"also_viewed": ["B00BB1C140", "B00BCPGMXQ", "B00KQRFLZQ", "B00B2H74G8", "B00CDANKBG", "B003NA1AGM", "B00BBAFUQC", "B00BB0ZSIC", "B00BB9ORUS", "B00B59NYJ4", "B003960G1U", "B009IBXCN4", "B006ZH0INQ", "B00752RAZY", "B00BB9ORW6", "B00BEAFLYK", "B001HA6KOC", "B007BG47BE", "B00BCPGNF8", "B00BB0ZTO0"], "buy_after_viewing": ["B003L1ZYYM", "B001HA6KOC", "B00CX5P8FC", "B00BGGDVOO"]}}