{"asin": "B000VXD2S8", "categories": [["Electronics", "Television & Video", "Streaming Media Players"]], "description": "From the Manufacturer Sling Media released a software update on October 28, 2008 for SlingCatcher that fixes some critical video streaming quality issues from both Slingbox and SlingProjector. All new customers setting up a SlingCatcher on 10/28/08 or later will receive the new software as part of their first time setup process. Existing customers may download the software update over the Internet directly to their SlingCatcher by going to the Settings menu and selecting Software Update.SlingProjector users should have a high-performance PC for the best experience. Minimum requirements are a 1.6 Ghz Intel Core Due or 3.0 GHz Pentium IV/Pentium M CPU with Windows XP or Vista 32-bit.&nbsp; 64-bit Windows Vista is not currently supported. The MAC OS is also not currently supported. As with any video or CPU intensive application, virtual operating systems such as Fusion and Parallels are not recommended.Watch Your Digital Media on Your TVThe SlingCatcher is a universal media player for your TV. SlingCatcher's on-screen interface and remote control provide easy access to TV from your Slingbox, Internet video from your PC, or personal media from your USB hard drive. So sit back, relax, and enjoy the digital age on your TV screen.&nbsp;TV from your SlingboxAccess your Slingbox on another TV in your house or anywhere in the world.Internet video from your PCIf you can watch a video on your PC, you can use SlingProjector to project it wirelessly to your TV.&nbsp;Personal media from your USB hard driveAttach USB storage to SlingCatcher and view your favorite media files on your TV.________________________________________________________________________________________________________________________&nbsp;Access Your Slingbox on Another TVSimulated TiVo interface shown here - Slingbox works with over 5,000 devices.The SlingCatcher allows you to access any device connected to your Slingbox* on another TV in your home or even a TV in another location.DVRs are great, and anyone who has ever used one can't go back to the old way of watching TV. But if you have multiple TVs in your house, your DVR content is usually stuck on one of them. The solution? Hook up a Slingbox to the DVR and a SlingCatcher to another TV. Instantly you can watch and control your DVR and all its programming from that TV too--with no additional monthly fees.Going away to college can be tough. You leave your family, friends, and local sports teams behind. With a SlingCatcher in your dorm room, you can connect to your Slingbox at home, and it's just like having a really, really long cable. You can hijack your parents' TV or watch shows and games together--virtually, of course.* HD Streaming from a Slingbox ProHD is not supported at this time.________________________________________________________________________________________________________________________Project Internet Video from Your PC to Your TVSlingProjector software for 32-bit Windows XP and Vista* lets you select any window on your PC to project full screen onto your TV. This is ideal for watching an ever increasing amount of Internet video content on your TV instead of a laptop screen. Clips from YouTube or Hulu, full episodes from CBS.com or NBC.com, even streaming feature length movies from NetFlix can all be projected to your big screen, so you can sit back on the couch and enjoy. SlingProjector works with most web sites and video players.** Check out a few of these examples:Everyone knows YouTube. Whether you find the millions of hours of user-generated video funny, disgusting, educational, or a good way to veg out on a Sunday afternoon, now you can easily share your favorite moments with family and friends on your big screen TV rather than hunkered around a tiny laptop.Hulu is a popular video Web site with lots of clips, full-length TV episodes, and movies. Using SlingProjector, simply select the video frame and watch away!&nbsp;If you have a NetFlix account, you already know you can stream thousands of full-length TV shows and movies to your computer. That's great if you're a lonely guy living in a 6' x 6' box. But if you want to watch a show or movie with your family, you probably want to sit back on the couch with a bowl of popcorn. Now you can. And you never have to wait for your DVDs to arrive in the mail.* 64-bit Windows XP/Vista and Macintosh support not currently available. SlingProjector is not supported when run in a virtual environment like Parallels, VMware or Microsoft Virtual PC.** Projection of HD-DVD and Blu-ray video from a PC to SlingCatcher is not supported. For more info, visit our support site for details________________________________________________________________________________________________________________________Watch Your Personal Media on Your TV&nbsp;Watch Home Movies from Your USB Hard DriveIf you have kids, you probably have lots of video tapes full of great moments, and you just haven't gotten around to compiling and burning DVDs so you can share with the rest of the family. Now you can store those movies on a portable USB hard drive. Just plug it into the SlingCatcher, and you have instant access to your entire video library -- to share with friends and family.&nbsp;Watch Podcasts from Your USB Hard DriveVideo podcasts let you keep up with the latest on every imaginable or niche topic. From comedy to news to personal health, you can subscribe to podcasts 'til your hard drive is overflowing. The problem, of course, is that you have to watch them on your tiny phone or small computer screen. With SlingCatcher, just plug in your USB drive or memory stick filled with podcasts, and you can sit back on the couch and watch to your heart's content.To get started with SlingCatcher, you&rsquo;ll need at least the following:A television (standard definition or high definition)A broadband Internet connection (DSL/Cable modem)A home networkWatch TV From Your SlingboxAccess live or recorded video from any device connected to your Slingbox.Currently supported streaming resolutions vary from 320x240 to 640x480, depending on network connections and Slingbox in use.Watch Internet Video From Your PCUsing the free SlingProjector software, display any region from your PC screen on your TV (up to 1024x768 based on PC performance)System and network requirements:High performance PC required for best resultsVirtualized PCs such as Parallels, VMware or Microsoft Virtual PC are not supportedMicrosoft Windows Vista or Windows XP with SP2(64-bit Windows Vista and 64-bit Windows XP not currently supported)1.6 GHz+ Intel Core Duo or 3.0 GHz+ Pentium IV/Pentium M CPU1 GB RAM for Windows Vista and 512 MB for Windows XPDisplay resolution of 1024 x 768&nbsp;&nbsp;&nbsp;50 MB available disk space for installationSlingProjector requires a consistent 5 Mbps wired/wireless network connection in your house between your PC, router, and SlingCatcherWatch Personal Media From Your USB Hard DriveRequires optional USB 2.0 hard disk drive or USB 2.0 flash memory stick accessory (all sold separately)Supported media formats:Video: WMV, MPEG-2, MPEG-4, H.264, XvidAudio: MP2, MP3, WMA, AAC, AC3File formats: .avi, .vob, .ifo, .ps, .ts, .mpg, .wmv, .asf, .mov, .mp4,.m4v, .mp3, .wma, .mp4a, .m4a, .wavFor more information on supported file formats and other My Media specifications, visit slingmedia.comComing soon: a file conversion and media management application for Windows XP/Vista PCsSystem RequirementsA television that supports any of the following: 480i (NTSC), 576i (PAL/SECAM), 480p*, 576p*, 720p*, or 1080i* (Note: SlingCatcher supports Standard Definition streaming from any Slingbox regardless of input video format)A broadband Internet connection (DSL/Cable modem)A home network that supports consistent 5 Mbps wired/wireless connection between your PC, router, and SlingCatcher* Requires component or HDMI cable purchased separately&nbsp;&nbsp;&nbsp;Box Contents1 SlingCatcher set-top box1 AC adapter (100-240V, 50-60 Hz)1 Ethernet cable1 Composite AV cable1 Remote control with 2 AAA batteries1 User guide", "title": "Sling Media SlingCatcher SC100-100 Universal Media Player for TV", "price": 499.99, "imUrl": "http://ecx.images-amazon.com/images/I/31QoxBzCzhL._SX300_.jpg", "brand": "Sling Media", "related": {"also_viewed": ["B009FU8BR0", "B009FU8BTI", "B001EZRJZE", "B00LIP10KK", "B000VXKD8K", "B000R3K488", "B004M189OM", "B000IVDIL4", "B0089L4TL8", "B004JOQSEA", "B000HBEKJE", "B000AMLXHW", "B0096KLQN0", "B001Z5140O", "B000IVDTSG", "B0057NBFL8", "B005KOZNBW", "B00AEC9VM2", "B0092U3TKC", "B00JXFM75Y", "B000J56H5I", "B00COJ8FPC", "B003597DYE", "B008YDUTRO", "B00AM0ESC4", "B004HO58SO", "B00DBPU8KS", "B005KY3XN2", "B00J5YUH4G", "B00H9IJ1VU", "B008RWHC0E", "B002AVXDWE", "B00GY0UB6I", "B005L9ZZ32", "B008BDBPTS", "B00GY0UB54", "B004HKIB6E", "B0038JE07O", "B002MCZJ3C", "B00523NUTI", "B000CS7RYM", "B00BUCLVZU", "B003MVZ60I", "B002KKFP9Y", "B008I64C2A", "B009L8ASWM", "B005LS5WS6", "B005MJWGJC", "B00EEOSZK0", "B001JZFQU4", "B009SDNHNW", "B00BN0M0O0", "B008TVSLVC", "B008H7MFX8"], "bought_together": ["B009FU8BR0"], "buy_after_viewing": ["B009FU8BR0", "B009FU8BTI", "B001EZRJZE", "B005KOZNBW"]}}