{"asin": "B002FU5QMA", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]], "description": "From the Manufacturer Now hear this--everything. The Speaker System Z520 transforms your desktop into a room-filling sound experience. Unlike traditional front-firing speakers that focus all the sound only in one direction, Logitech 360-degree sound technology projects sound evenly in all directions. So you hear the full range of sound not just in front of the speakers, but everywhere in the room. High-performance extras like the two-way design (a separate main driver and tweeter in each speaker), deliver detailed lows, mids and highs. 26 watts (RMS) of power let you crank up the volume. There's even a convenient iPod input. So you can turn these self-powered speakers into a standalone system for listening to your favorite tunes in any room.Hear it all, all around the room, with detailed 360-degree soundYou don't miss a beat. You want to hear every waling sax note, subtle background vocal and smooth bass line. And you want to hear it all, not just when you're sitting at your computer, but wherever you are in the room. That's a lot to ask from most desktop speakers, with one notable exception. Engineered with Logitech 360-degree sound technology, the Speaker System Z520 delivers powerful full-spectrum sound all around the room. Combined with 26 watts (RMS) of party-volume power and an input for your iPod, you're in for a music experience that ordinary speakers just can't match.Key FeaturesTraditional desktop speakers focus sound in one listening &ldquo;sweet spot&rdquo;Logitech 360-degree sound for room-filling audio clarity without dead spotsA lot of desktop speakers promise a great sound experience. And that's true&#8212;as long as you sit in the narrow &ldquo;sweet spot&rdquo; directly in front of the speakers. But when you move out of that sweet spot, it can sound more like a dead spot. Details drop out. Your music starts to sound muddy.Logitech 360-degree speakers project sound evenly in all directions for a full-room sweet spot&nbsp;Logitech solved this audio challenge with 360-degree sound technology. Rather than using only a forward-firing driver, Logitech speakers are acoustically engineered with both forward- and backward-firing drivers. Result? Your whole room becomes a sweet spot. That's because sound is projected and reflected more evenly and over a wider range of space. And high, mid-range and low frequencies hold together. So your music sounds full and crisp, even if you're behind the speakers.Amplified two-way design for twice the listening pleasureMany desktop speakers in this price range use only one driver in each speaker. But each of these Logitech speakers has two separate drivers designed to give you a clearer, richer, more textured listening experience. The main driver delivers warm, natural mid-range and deep bass. The tweeter sings with crisp, clear highs. And dual integrated amplifiers keep every sound in perfect balance.&nbsp;26 watts deliver powerful party-level volumeFeel free to crank up the volume. With 26 watts (RMS) of power, you'll have ample sound to wake the neighbors. And high volume doesn't have to mean ear-splitting screeching and crackling. Your music comes across in rich, clear, distortion-free detail, even at volumes loud enough for a Saturday night dance party.&nbsp;On-speaker iPod input for quick and easy connectivityWhy settle for speakers that only work with your computer? The Speaker System Z520 also works with your iPod or any other MP3 player. Just plug your iPod directly into the speaker input and listen to all your favorite songs in 360-degree room-filling sound. These versatile speakers also make a great standalone system for your iPod. So you can easily add music to any room in your house.&nbsp;Clutter-free twin speaker design&#8212;easy on the eyes and simpleto set upYou don't have to take up a lot of room on your desk to have a room full of great-sounding music, movies and games. Your new speakers are small enough to fit easily on your desk without occupying much workspace. They're simple to set up, right out of the box. And they're designed to complement the clean, contemporary style of the latest notebooks and monitors.Enhance your listening experience with great Logitech products.Logitech Speaker System 523Connect your 40-watt (RMS) Logitech Speaker System Z523, and rediscover the art of listening. Speakers with 360-degree sound help project audio evenly in all directions, so you get a great listening experience throughout the room.Ultimate Ears SuperFi 4 Noise Isolating EarphonesFeaturing the same speaker technology and sound signatures used in our higher-end products, these compact earphones deliver detailed bass with crisp and clean mids and highs.Ultimate Ears SuperFi 5 Noise Isolating EarphonesHoused in a sleek, liquid silver body, the top-fire speaker produces a detailed and full soundstage&#8212;ideal for listening to a braod range of music genres.What's in the BoxPackage ContentsLogitech Speaker System Z520Power supplyQuick-start guide2-year limited hardware warrantySystem RequirementsWindows XP, Windows Vista, or Mac OS X 10.3.9 or laterSound card or 3.5 mm audio out", "title": "Logitech Speaker System Z520 (Black)", "price": 61.49, "imUrl": "http://ecx.images-amazon.com/images/I/41Ccz-kg13L._SX300_.jpg", "brand": "Logitech", "related": {"also_bought": ["B00DZPUOU8", "B002FU5QLQ", "B004LTEUDO", "B006JH8T3S", "0060264551", "B003VAHYNC", "B004LU1U2M", "B0011FQUQG"], "bought_together": ["B004LTEUDO"], "buy_after_viewing": ["B00EZ9XKCM", "B003VAHYTG", "B0027VT6V4", "B002FU5QLQ"]}}