{"asin": "B00535CD5C", "related": {"also_bought": ["B00906HNZU", "B005H3Q59U", "B005H3Q5E0", "B001TH7T2U", "B0017U4JAY", "B00DRK716G", "B002XVYZ82", "B00H09BOXQ", "B00D601UC8", "B00FSB799Q", "B00HFRWWAW", "B00EZSUVHK", "B0054ENDO2", "B006FMC348", "B001MIB0SU", "B0001FSCSG", "B003X5LE54", "B005L38VPC", "B006TF37H8", "B007KB0EGC", "B004CAJUCI", "B0000BVYT3", "B008A3KFB8", "B004K2WZS4", "B004071ZX0", "B007UQROJC", "B00ED34G8C", "B000OOYECC", "B00028OP2Y", "B005DLDO4U", "B003Y3BJ7S", "B006JH8T3S", "B004CAGDUA", "B0076W9Q5A", "B004C9P9TM", "B004CAHTCQ", "B0036TGGW8", "B0002AHT0M", "B000I1X3W8", "B003XIJ3MW", "B007PXV2K2", "B005NGQWL2", "B005DLDTAE"], "bought_together": ["B001TH7T2U"], "buy_after_viewing": ["B008RM23ZI", "B009C3M7H0", "B008A3KFB8", "B005JN9310"]}, "title": "Viewsonic VP2765-LED 27-Inch Wide AMVA LED Monitor", "price": 395.15, "salesRank": {"Computers & Accessories": 2195}, "imUrl": "http://ecx.images-amazon.com/images/I/41dQyw3qy1L._SX300_.jpg", "brand": "ViewSonic", "categories": [["Electronics", "Computers & Accessories", "Monitors"]], "description": "The VP2765-LED is one of ViewSonic&rsquo;s new LCD VP professional series monitors that utilize the power of Advanced MVA panel technology. Featuring high contrast ratio and super wide 178/178 viewing angles and coupled with Full HD 1920x1080 resolution, makes the VP2765-LED the ultimate professional grade LCD monitor for medical facilities, scientific design, digital visual art, video production, architecture and any application where true color and total screen viewing is essential. Features VGA, DVI and DisplayPort inputs and 4-port USB hub for cluster free connectivity, ergonomic functions with pivot, height adjust, tilt, swivel and slim bezel make the VP2765-LED an all around amazing monitor.Key Features:27-Inch widescreen LED backlit monitor for photographers, designers, CAD/CAM engineers, and medical applicationsAdvanced MVA panel delivers superior image quality, accurate colors and high contrast ratio even at super wide viewing angles of 178&deg;Eco-mode saves up to 40% energy* while helping reduce your energy billSlim Bezel designed for multi-monitor applications4-port USB hub for easy connectivity of USB devices such as digital cameras, USB flash drives and mice100mmx100mm VESA&reg; compliant for 3rd party wall mount or monitor standsDisplayPort, DVI, and VGA inputs for diverse connectivity optionsHighest grade panel with one of the best pixel performance policy in the industry*Power savings may vary based on actual usage and other factors.What is an AMVA Panel?Advanced MVA (multi-domain vertical alignment) technology is one of the highest performance panel technologies available in LCD displays today. The specifications and details of AMVA panel technology are excellent for high accuracy in color, contrast and wide viewing angles. AMVA panels offer excellent picture reproduction and suitable for photography, graphics design, movie production, CAD/CAM engineering, medical and security applications. Illustrations below represent how an image on your screen will look even at extreme viewing angles of up to 178&deg;. With AMVA panels, you will not have any color shifts or changes in the contrast ratio when you move the image across the screen or change your viewing angle."}