{"asin": "B000FGI970", "description": "Amazon.com Product Description.caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The NETGEAR WNR854T RangeMax Next Wireless-N Router Gigabit Edition offers:Wireless-N protocol for up to 300 Mbps throughput.Four Gigabit RJ-45 Ethernet ports for fast wired connections.WiFi Multimedia technology for optimized audio, video, and voice applications.The NETGEAR WNR854T RangeMax Next Wireless-N Router Gigabit Edition lets you easily set up a wireless network in your home so you can share a single internet connection with everyone in your household at speeds up to 300 Mbps. You can stream music and video, make internet phone calls, videoconference, and surf the web, all at the same time.The WNR854T has a Gigabit Ethernet backbone for maximum speeds.View larger.View back.Easy SetupThe WNR854T makes it easy for even a novice to set up a wireless network: just plug the included Ethernet cable from your LAN into the device and insert the included CD into any computer on the network, which will provide step-by-step instructions. The WNR854T includes a stand for vertical placement.The WNR854T employs a web-based interface for configuration for compatibility with any computer with a web browser. The firmware is also upgradeable via the web interface so you can be sure your router will always be up-to-date.New Technology Means Blazing Speeds and Backwards CompatibilityThe WNR854T complies with the latest 802.11n draft specification which allows for speeds up to 300 Mbps; this maximum speed can be achieved when used with other TopDog devices. By utilizing MIMO (multiple-input, multiple-output) technology, the WNR854T has speed and range far surpassing the older 802.11g standard. The preset internal antennas ensure that the device is always tuned for optimal performance, and NETGEAR's Wi-Fi Multimedia technology optimizes audio, video, and voice applications.If you still have computers that use 802.11g or 802.11b, don't fret as the router is backwards compatible with the older wireless standards and can be set so all your computers can connect to the network. The WNR854T will automatically figure out the connection type and work accordingly.By using Gigabit Ethernet for the backend, you'll be certain that the router is receiving data at the highest possible speeds. The router also has four Gigabit RJ-45 Ethernet ports in the back for connecting computers to the network via a wired connection that will give the fastest performance.Security Made EasyThe WNR854T offers many security options to ensure your data is private. Double firewall protection keeps your network shielded from outside attacks. It also prevents Denial of Service (DoS) attacks.NETGEAR's Touchless WiFi Security makes it quick and easy to set up network security on a WiFi network by asking for a passphrase from the user. The WNR854T supports WiFi Protected Access (WPA2-PSK, WPA-PSK), and 64-bit and 128-bit WEP encryption for 802.11b/g networks. Additionally, you can set security through MAC address authentication, allowing only authorized users onto the network.The NETGEAR WNR854T RangeMax Next Wireless-N Router Gigabit Edition is backed by a 1-year warranty.What's in the BoxWNR854T RangeMax Next Wireless-N Router Gigabit Edition, power adapter, Ethernet cable, stand, setup CD, warranty/support information card.", "title": "NETGEAR WNR854T RangeMax Next Wireless-N Router Gigabit Edition", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/312CDD5FSZL._SY300_.jpg", "related": {"also_viewed": ["B000LIFB7S", "B008HO9DK4", "B001F7HLRC", "B00KWHMR6G", "B005KG44V0", "B0081H8TRA", "B00895BUPC", "B001UI4RTG", "B00EM5UFP4", "B002HWRJY4", "B002YLAUU8", "B0019EQ1RW", "B007B60SCG", "B00DWFPDNO", "B009UZZW1S", "B008IFXQIW", "B008ABOJKS", "B001CNCQO2", "B0041LYY6K", "B001498LIO", "B00C9VB318", "B00C1DN6ZA", "B0085WN7YQ", "B004N6259Q", "B001AZP8EW", "B002RYYZZS", "B00F0DD0I6", "B000N99BBC", "B003Y5RYNY", "B00FB45SI4", "B004T9RR4A", "B006QB1RPY", "B0098QV038", "B000BTL0OA", "B001FWYGJS", "B00A3YN0Z0"], "buy_after_viewing": ["B001498LIO", "B00BVRQEKG", "B000LIFB7S", "B008HO9DK4"]}, "categories": [["Electronics", "Computers & Accessories", "Routers"]]}