{"asin": "B0021L9C00", "description": "The Magellan RoadMate 1340 includes many premier features, starting with Magellan's exclusive OneTouch&#x2122; favorites menu, QuickSpell&#xAE; with SmartCity search, and highway exit point of interest (POI) search, to name a few. Magellan's attention to detail delivers a superior user experience. Intuitive and robust navigation The RoadMate 1340 lets you bookmark your favorite destinations and searches with the OneTouch favorites menu so you can access them anywhere you travel. With a single touch, find your favorite caf&#xE9; or restaurant when you're traveling within any city. QuickSpell with Smart City search help you quickly enter addresses and narrow your address and city searches, making destination entry easy. Multi-destination routing with route optimization lets you plan your trip with multiple stops in the order you want or optimize a trip for the most efficient route, helping you save time and money. Safety first on the road You can keep your eyes on the road as you drive because spoken street name guidance announces the street name along with audible turning cues. Highway lane assist offers visual aids to point you in the right direction and ensure that you'll choose the correct lane well before your next turn. Ready to roll You're ready to travel with preloaded maps and points of interest for the United States, Canada, and Puerto Rico that make the Magellan RoadMate 1340 ideal for both business trips and vacations. When you're traveling down the Interstate and need to find gas, food, or lodging in a hurry, touch the highway exit POI icon to see which upcoming highway exits have the services you need. Do you often find yourself tied up in traffic? The RoadMate 1340 is Traffic Link compatible, offering live onscreen traffic-incident reports. (The Traffic Link accessory is sold separately). Turn it on and go!&#x2122; The Magellan RoadMate 1340 is loaded with premier features you'll need to get you where you want to go.", "title": "Magellan RoadMate 1340 3.5-Inch Portable GPS Navigator", "price": 79.99, "imUrl": "http://ecx.images-amazon.com/images/I/51DzYZH8dxL._SY300_.jpg", "related": {"also_viewed": ["B003ZHVBQM", "B00HK6CPVY", "B001ELJ9QK", "B005HH35EY", "B00BIZ0EY8", "B000W6EUOE", "B0052D38UE", "B0082XN4NW", "B0090C7A2A", "B00AY7NSTY", "B0021L9C0A", "B0057ODG6Y", "B001VEIYAC", "B0015F1L7A", "B0082XN4PA", "B00AXZY42W", "B00C9W1LT6", "B0057OCDQS", "B008P8F30G", "B001U0O7T4", "B003CYKYU2", "B00GOC4R16", "B007X3DAMM", "B0057ODOCA", "B004PNVETE", "B007PPYXOC", "B004HW67MW", "B0021L9BZG", "B0054J8BWQ", "B002LITI70", "B0057O9ABO", "B003FSTAFK", "B006ZOI9OY", "B0011ULQNI", "B00CH3FRG0", "B007M52QR6"], "buy_after_viewing": ["B0057OCDQS", "B0057ODG6Y", "B0057ODOCA", "B0011ULQNI"]}, "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS"]]}