{"asin": "B0011ZCDKS", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The PowerShot A590 IS will astound you with its power-packed performance and impressive value. It&#x92;s got 8 megapixels, a 4x optical zoom, an Optical Image Stabilizer, and a large 2.5-inch LCD. A range of shooting modes -- from manual to automatic, including Canon&#x92;s new Easy Mode -- make picture-taking carefree. A DIGIC III Image Processor with Enhanced Canon Face Detection assures natural-looking results, while Motion Detection Technology reduces blur. For added creativity, attach wide or telephoto converter lenses.Canon PowerShot A590IS Highlights8 megapixels with 4x optical zoom and optical image stabilizerWith the PowerShot A590 IS, dramatic, personal pictures have never been easier to shoot and share. The 8.0-megapixel design lets you create impressive high resolution images of family and friends you&#x92;ll be proud display. The genuine Canon 4x zoom lens moves you in for powerful close-ups -- like a bird in flight or a child&#x92;s winning goal -- at the touch of a button. Plus, Canon&#x92;s highly sophisticated Optical Image Stabilizer keeps every shot absolutely steady even when you&#x92;re not.2.5-inch LCD screenThe camera&#x92;s 2.5-inch LCD screen gives you the big picture, whether you&#x92;re shooting, reviewing or showing off your images. This high-resolution screen offers a crisp, clear and bright picture. It also features Night Display for easy viewing in low light.New Easy Mode simplifies operationEven if you&#x92;ve never picked up a camera before, with Canon&#x92;s new Easy Mode you can take inspiring, dramatic pictures that will impress everyone. Once you choose Easy Mode, the PowerShot A590 IS handles all the details automatically. It automatically sets every camera control including the flash to reduce blur and improve image quality. So you get pictures that are bright, clear and natural just by pushing a button. Best of all, you can relax and concentrate on what really counts -- your subject.Selectable shooting modesWith 19 Shooting Modes including 7 Special Scene Modes, you&#x92;re ready for whatever shot comes your way.DIGIC III Image ProcessorWith DIGIC III, your images boast superior quality, the camera operates at top efficiency and battery life is enhanced. What&#x92;s more, DIGIC III enables Canon&#x92;s Face Detection Technology and Red-eye Correction to give you better, more true-to-life people shots. Simply press the Shutter Button halfway down, and the camera automatically pinpoints the faces in the scene and chooses the ideal focus point. The camera controls exposure settings and flash to keep every face looking bright and natural. Red-eye Correction can be handled in-camera, in two ways. The entirely new Red-eye Correction during shooting uses the Face Detection Technology to recognize and remove red-eye from flash images as they're taken, before the file is written to the memory card. It's also possible to correct red-eye during image playback, using simple settings in the A590 IS's menu.iSAPS Technologyis an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the fast DIGIC III Image Processor to improve focus speed and accuracy, as well as exposure and white balance.Face Detection TechnologyCanon's powerful Face Detection Technology delivers even better results with the new A590 IS. The Face Detection Technology continues to recognize faces in a scene, and concentrate exposure (daylight or flash) and focus upon them. But the A590 IS adds more: Face Detection WB means the camera concentrates upon faces when calculating white balance for the best possible skin tones. Face Select and Track lets the A590 IS user highlight one face among several in a scene, and the camera concentrates on that person, even as they move around the scene. Face Detection Technology is a powerful contributing factor in Canon's new Motion Detection Technology.Red-eye CorrectionRed-eye Correction provides three options for removing red-eye from subjects in flash pictures.The new Red-eye Correction during shooting actually identifies and corrects red-eye in human subjects as pictures are taken.The A590 IS can be set to automatically detect and correct red-eye during image playback.The user can manually locate any red eyes in a scene during image playback on the LCD screen, and command the camera to remove them.High ISOThe PowerShot A590 IS features ISO 1600 and High ISO Auto settings that reduce the effects of camera shake and sharpen subjects in low-light situations, giving you greater shooting flexibility.Motion Detection Technology automatically reduces blurLife doesn&#x92;t stand still for picture-taking. That&#x92;s why Canon included its advanced Motion Detection Technology in the PowerShot A590 IS. This sophisticated feature works in the background to instantly evaluate how fast your subject is moving. Then it automatically selects and sets the optimal exposure and ISO settings to keep everything looking sharp and clear. So whether you&#x92;re shooting a bride walking down the aisle, a ballet recital or even a child&#x92;s soccer game, you can relax and shoot with confidence knowing you&#x92;ve got the picture you intended.Accepts Wide-Angle and Telephoto Converter LensesTo expand your creativity, the PowerShot A590 IS is compatible with shooting accessories such as wide and tele converter lenses, High-Power Flash designed for all of the PowerShot models.The Complete Print SolutionThe A590IS features a Print/Share button for easy direct printing and downloading, plus ID Photo Print and Movie Print with select Pixma photo printers and Selphy compact photo printers.The PowerShot A590 IS's Print/Share button makes direct printing easier than ever. Simply connect the A590 IS to a Canon Pixma photo printer or Selphy compact photo printer or any PictBridge compatible photo printer, press the lighted Print/Share button and print! Also use the Print/Share button to transfer images to a computer (Windows and Macintosh).Print your own ID photos in 28 different sizes or use the Movie Print function to output multiple stills from a recorded movie on a single sheet with a Canon Selphy compact photo printer.", "title": "Canon PowerShot A590IS 8MP Digital Camera with 4x Optical Image Stabilized Zoom", "price": 399.99, "salesRank": {"Camera &amp; Photo": 2832}, "imUrl": "http://ecx.images-amazon.com/images/I/518qVmlYBbL._SX300_.jpg", "related": {"also_bought": ["B000P9ZBFA", "B005GRT6IO", "B001NDIZA0", "B00EFILPHA", "B000EMWBV0", "B000P1O73A", "B000VV4Q26", "B0034XIM82", "B000LXZKQK", "B001P06Q20", "B00176BDD4"], "bought_together": ["B000P9ZBFA"], "buy_after_viewing": ["B003F7DWH8", "B003VNKNF0", "B00AWYMXZY", "B003VNKNEQ"]}}