{"asin": "B000FHD7PI", "description": ".productDescriptionWrapper table{width:auto;}.productDescriptionWrapper *{box-sizing:content-box;-moz-box-sizing:content-box;-webkit-box-sizing:content-box;}Amazon.com Product Description If you need music that you can take with you on any rough and tumble adventure, look no further than the Sony ZS-H10CP CD Boombox. This tough unit is perfect for the job-site, workshop, or backyard, with a rugged and durable design that incorporates a water and dust resistant seal that protects it from the elements.Durable, water-resistant, and rugged, the Sony ZS-H10CP is ready to provide the background music for your toughest jobs.In addition to a big handle that makes it easy carry to any project, the ZS-H10CP features a protective safe guard bar that keeps it safe from stacking items and falling debris. You'll also find large controls for easy operation, even when wearing thick gloves. A high-impact plastic housing is designed for outdoor fun, with rubber gaskets, bushings and waterproof seals that help keep out water, moisture, and dirt. Plus, the boombox's footprint fits most shelves, allowing it to be easily incorporated into any tough environment.But don't let the rugged design fool you; the ZS-H10CP is built to withstand the elements without sacrificing sound quality. A digital AM/FM stereo tuner provides accurate, drift-free tuning of AM and FM radio stations and lets you choose from the wide variety of radio talk shows and music programs, with the added enjoyment of stereo sound. The system also includes a line-in jack for digital music players so you can listen to your entire digital music collection via the boombox. And to really kick the sound up a notch, the ZS-H10CP features Mega Bass sound enhancement.And for those with a big collection of CDs that make the workday more fun, the ZS-H10CP features a CD player with multiple play modes and ESP-2 anti-shock playback protection. Play modes let you listen to songs in sequence as recorded, in program (RMS) order, all tracks in random (shuffle) order, or a single track over and over. A four-line LCD screen keeps tabs on your track information, and SonicStage music software ships with the unit, so you can compile your own mix CDs.What's in the BoxZS-H10CP CD boombox and AC power adapter.", "title": "Sony ZSH10CP Portable Heavy Duty CD Radio Boombox Speaker System (Discontinued by Manufacturer)", "price": 114.94, "imUrl": "http://ecx.images-amazon.com/images/I/514461Z4J1L._SX300_.jpg", "related": {"also_bought": ["B00BM13ZBC", "B00164H4AI", "B00IKML7EI", "B000A6V8FU", "B008Y0P8K0", "B003FS31UK", "B003H9MDK6", "B0033WSDY2", "B005UB3ZNI", "B004YI6N00", "B004LTEUDO"], "buy_after_viewing": ["B004YI6N00", "B003H9MDK6", "B003H9MDK6", "B009W7GB5U", "B009LIPMMS"]}, "categories": [["Electronics", "Portable Audio & Video", "Boomboxes"]]}