{"asin": "B002C1BHIO", "description": "The AmazonBasics Ultra High-Speed HDMI Cable Braided can help you obtain the maximum performance from your latest high-definition electronic devices. Use this two-meter-long cable to connect your HDTV to your cable box, satellite dish, Blu-Ray player, and more, and experience quality audio and video (up to 1080p) from your home.Where's the version number?&nbsp;&nbsp;&nbsp;According to HDMI, version numbers reflect capabilities, but do not correspond to product features. In other words, HDMI does not require manufacturers to implement everything that HDMI can do. HDMI provides a menu of capabilities and allows the manufacturer to choose which of those features make sense for its product line.&nbsp;&nbsp;&nbsp;For example, if you want the new video features called Deep Color, look for Deep Color in the feature set rather than HDMI 1.3, the version of the specification that enabled Deep Color. Why? Because the version of the specification that enables Deep Color (1.3) does not mandate that Deep Color functionality be implemented.&nbsp;&nbsp;&nbsp;As a result, HDMI strongly recommends that consumers look for products with the features they want, rather than the version number of the HDMI components.AmazonBasics HDMI cable (top) features dual-braided shielding to reduce interference and deliver a clean, crisp image vs, lower-quality cables (bottom).High-quality, gold-plated connectors resist corrosion while offering optimal signal transfer for superb audio and video quality.Compatible with 3D TV TechnologyAll current AmazonBasics HDMI cables support the latest HDMI compatible components and 3D TV functionality. The only element they do not currently support is Ethernet over HDMI.Quality Picture and SoundSupports 3D ContentGuaranteed 4K, 1440p, 1080p, 1080i, 720p, 480p, and 480i ResolutionsSupports Audio Return ChannelSupports Highest Refresh Rates AvailableSupports Transfer Rates of Up to 340Mhz or 10.2gbpsSupports True HD Dolby 7.1 and DTS-HD Master AudioHDCP CompliantBackwards Compatible with Previous HDMI StandardsThe cable is backwards compatible with all previous HDMI standards, so you'll be able to use this cable with all your HDMI devices. When you connect two devices with different HDMI standards, they will automatically find the best available connection.Shielding and Gold-Plated Connectors for Signal PurityThis HDMI cable features shielding with a durable, black PVC outer layer. The shielding provides outstanding defense against outside interference and helps maintain the integrity and purity of the digital signal.The cable also features gold-plated connectors that resist corrosion while offering optimal signal transfer with lower distortion at the point of contact. The result is sound and picture quality that is faithful to the original.AmazonBasics: Quality Products at Low PricesAmazonBasics is a collection of consumer electronic \"basics\" created by combining quality and low prices for an overall focus on value.Warranty and Helpful HintsThis cable is backed by an AmazonBasics 1-year limited warranty. To view the full AmazonBasics warranty,click here. If you are having trouble connecting your components with this cable,click herefor the AmazonBasics HDMI Helpful Hints Guide.What's in the BoxQuad-shielded High-Speed HDMI Braided (6.5 Feet / 2.0 meters) and warranty card.&nbsp;Plain Jacket ModelsBraided Jacket ModelsFlat ProfileHDMIHDMI with EthernetHDMIHDMI with EthernetPivot-Head HDMIEthernet Capable&nbsp;&nbsp;&nbsp;4K x 2K Supported&nbsp;&nbsp;1080p&nbsp;&nbsp;3D SupportAudio Return Channel&nbsp;&nbsp;24K Gold Connector&nbsp;&nbsp;Deep Color Supported&nbsp;&nbsp;DTS, DTS-HD Master, Dolby Digital,&amp; Dolby Digital True HD&nbsp;&nbsp;Copper Braided ShieldSingle LayerSingle Layer&nbsp;Dual LayerDual Layer&nbsp;&nbsp;Aluminum Mylar ShieldDual LayerDual Layer&nbsp;Triple LayerTriple Layer&nbsp;Dual LayerBandwidth10.2 Gbit/S10.2 Gbit/S&nbsp;10.2 Gbit/S10.2 Gbit/S&nbsp;10.2 Gbit/S", "title": "AmazonBasics High-Speed HDMI Braided Cable (6.5 Feet/2.0 Meters)", "price": 5.99, "imUrl": "http://ecx.images-amazon.com/images/I/41ZNy-BikTL._SY300_.jpg", "related": {"also_viewed": ["B003L1ZYYM", "B00870ZHCQ", "B00870ZLJ0", "B00C28L51G", "B00FEZFJ5W", "B00FAADBHO", "B004SBBDD0", "B003ES5ZR8", "B001A5PDKQ", "B003L1ZYYW", "B008JR72SO", "B0052SCU8U"], "buy_after_viewing": ["B003L1ZYYM", "B0052SCU8U", "B00870ZHCQ", "B0019EHU8G"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Cables & Interconnects", "Video Cables", "HDMI Cables"]]}