{"asin": "B0033VKKB2", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The DSC-H55's 10x wide (25mm equivalent) lens takes better shots from greater distances and wider landscapes in a compact body. Take breathtaking panoramic shots in one sweeping motion with Sweep Panorama mode and review them on a 3.0-inch LCD screen. Minimize blur with Optical SteadyShot image stabilization.Sony DSC-H55 Cyber-shot Highlights3.0-inch Clear Photo LCD display (230k pixels)Compose and show off your images on the large 3.0-inch (230K) Clear Photo LCD display, which features a special anti-reflective coating for sharp visibility, even in bright sunlight.10x (25mm-equivalent) professional-quality optical zoom G-LensG lenses are used in top of the line digital single lens reflex (DSLR) cameras and advanced pro-sumer HD camcorders. Capture the action up close with the 10x optical zoom, and with the 25mm equivalent wide angle lens the H55 even allows you to capture more of the scenes in landscape or group portraits.14.1-megapixel Super HAD CCD image sensorA powerful 14.1-megapixel, 1/2.3-inch Super HAD CCD image sensor helps you capture gorgeous images with superb contrast and clarity down to the finest detail. With 14.1 megapixels, you can create stunning, photo-quality prints up to A3+ (13 x 19\") size, or crop your images and still come away with high resolution shots.Sweep Panorama modeReach beyond the traditional wide angle lens, and capture more breathtaking shots with Sweep Panorama Mode. Simply press the shutter button and sweep the camera horizontal or vertically and the camera continuously shoots at a high speed, then seamlessly stitches the images together with automatic position adjustment to create one stunning panoramic image. Available in wide and ultra-wide options, the camera can take panoramic shots of up to 243 degrees. Now capturing wide landscapes is as easy as press and sweep.720p HD MP4 Movie Mode720p MP4 is a popular format for high definition video that compresses the size of your audio and video, making your media files small enough to easily transfer to your compatible PC or Mac. MP4 is also highly compatible with the Web, so you can effortlessly upload your media to popular photo or video-sharing Web sites like Photobucket or YouTube. (Compatible PC with internet capability required).BIONZ Image ProcessorThe BIONZ image processor delivers the high resolution and fast performance you expect from a Sony digital camera. Fast processing enables unique Sony features such as Sweep Panorama, Handheld Twilight, Antimotion Blur, HDR, etc to take and combine multiple images in less than a second to create wide panoramic images. Images have reduced grain and appear less washed out.Self-Portrait TimerSelf-Portrait Timer helps take the guesswork out of self portraits by utilizing Face Detection technology to recognize when your face enters the frame. Once the camera detects your face, it triggers a 2-second timer, and then snaps a picture.Intelligent Auto (iAuto) modeUnlike traditional auto mode, Intelligent Auto (iAuto) mode thinks for you, recognizing scenes, lighting conditions, and faces, and adjusts settings resulting in clearer images, faces with more natural skin tone, and less blur. By incorporating advanced features such as Intelligent Scene Recognition, Face Detection technology, and Optical SteadyShot image stabilization, iAuto mode lets you take advantage of the latest Sony Cyber-shot technology without leaving auto mode. Whether you're shooting landscapes, capturing a beautiful flower, or taking pictures at an in-door birthday party or wedding shower, iAuto mode will optimize your camera's settings to help ensure you come away with a great shot.Intelligent Scene Recognition (iSCN) ModeIntelligent Scene Recognition (iSCN) Mode automatically detects eight different types of scenes and, within just 1/30th of a second, selects the appropriate camera settings: Backlight, Backlight Portrait, Twilight, Twilight Portrait, Twilight using a tripod, Portrait, Landscape, and Macro. iSCN has two modes: Auto and Advanced. In Auto Mode, the camera takes a single shot using the optimal settings. In Advanced Mode, the camera takes a photo with the optimal settings and, if in difficult lighting (low light or back light) immediately takes a second photo with another optimized setting so you can choose which to keep.Optical SteadyShot image stabilizationOptical SteadyShot image stabilization uses a built-in gyro sensor to detect camera shake and automatically compensates to help prevent blur without sacrificing image quality.Optical SteadyShot image stabilization w/ Active ModeOptical SteadyShot image stabilization with Active Mode gives you the freedom to shoot movies even while walking or running. By providing up to 10x the correction of standard mode, Active Mode can compensate for excessive camera shake so you can move along with your subject while shooting.High Sensitivity Mode (ISO 3200)High ISO allows for faster shutter speed, so you can take photos indoors or in low light without the need for a flash. In addition to High Sensitivity Mode (ISO), you can select up to seven ISO settings (Auto, 80, 100, 200, 400, 800, 1600, 3200) when shooting in Program Auto Mode to adjust sensitivity to your shooting conditions.Face Detection helps direct the focus to the subject you want.Face Detection technologySony's Face Detection technology can automatically distinguish between children and adults. Face Detection technology detects up to eight individual faces and adjusts flash, focus, exposure, and white balance to help deliver crisp, properly lit images of family and friends.Motion DetectionMotion Detection, along with Face Motion Detection adjusts ISO sensitivity and increases the shutter speed when movement is detected, reducing blur in moving subjects and faces.Anti-blink FunctionIt's frustrating to think you've captured that perfect shot, only to review it later and discover one of your subjects blinked just as you pressed the shutter. When the camera is set to Soft Snap, the Anti-blink function captures two images, recording only the photo with less squinting or blinking. If a blink is detected in other shooting modes, a warning will be displayed after you take the shot.Smile Shutter technologySmile Shutter technology captures a smile the moment it happens. Simply press the Smile Shutter button and the camera does the rest. You can also select adult and child priority and indicate the degree of Smile Detection Sensitivity. Intelligent Scene Recognition can be used together with Smile Shutter mode. This means that beautiful smiles can be captured with settings optimized for the particular scene, even in difficult conditions such as twilight and backlighting.Dynamic Range Optimizer Standard and PlusDynamic Range Optimizer (DRO) Standard and Plus uses a sophisticated algorithm to help recover shadows and highlights. The result is more natural images with clearer details that more closely match what your naked eye sees. DRO is particularly effective when shooting backlit portraits or any scene with a dramatic contrast between background and foreground lighting. DRO Plus allows for even greater optimization by analyzing each region of an image and performing additional image processing.Intelligent AFThanks to Intelligent AF technology, capture fleeting moments like a child's adorable expression with the ultra-quick AF which locks focus in as little as 0.3-sec.Scene modesThe DSC-H55 features 11 convenient scene modes: High Sensitivity, Twilight, Twilight Portrait, Soft Snap, Landscape, Beach, Snow, Fireworks, Advanced Sports, Gourmet, Pet.Easy Shooting ModeWith Easy Shooting Mode, even beginners can take great photos. In Easy Shooting Mode, easy-to-understand basic instructions are displayed on the LCD screen and the camera switches to all automatic settings, removing several function choices and allowing you to focus on just your subject. Since this mode works together with Intelligent Scene Recognition, the camera selects the optimum setting for each scene. In addition the easy mode simplifies preview mode.Function GuideThis beginner-friendly optional function helps navigate through the various functions and settings displaying the description of chosen functions or settings on the LCD screen.PHOTOMUSICPHOTOMUSIC combines images with music (4 tracks, 5 minutes per track) to produce fun and entertaining slide shows with standard visual effects (Simple, Nostalgic, Active, and Stylish). Select from pre-loaded tracks on the camera or transfer your own from your compatible computer (sold separately).Viewing modesFind your photos using the simple folder or calendar viewing modes.In-Camera retouching toolsRetouch and enhance your photos on the go with in-camera Trimming, Red-Eye Correction, and Unsharp Masking functions.PhotoTV HDBring your photos to life and enjoy highly detailed, high definition images with PhotoTV HD-capable Sony BRAVIA HDTVs. PhotoTV HD fine tunes settings on your PhotoTV HD enabled BRAVIA HDTV, such as sharpness, gradation, and color to display images that look more like printed photos.Lithium-ion batteryIncluded lithium-ion battery provides added convenience with longer lasting power than alkaline batteries (capacity of supplied battery is 310 images or 155 minutes for shooting still images). Additional battery available for purchase add more power and informationMedia card slotFor convenient storage and sharing of your images, the DSC-H55 accepts Memory Stick Duo/Memory Stick PRO Duo/Memory Stick PRO-HG Duo media (sold separately) or SD/SDHC media (sold separately).SD Card FunctionalitySony SD memory cards are the perfect solution for storing and sharing your digital content such as high-quality photos, videos, music, and more.Includes Sony PMB (Picture Motion Browser) Software ver. 5.02Sony Picture Motion Browser software offers a simple, intuitive way to transfer, sort, and view your video and still images on your compatible PC. In addition, multiple output options let you burn your memories to DVD using and external DVD burning device (sold separately), as well as take advantage of one click upload to a number of popular video and photo sharing sites.", "title": "Sony Cyber-shot DSC-H55 14.1MP Digital Camera with 10x Wide Angle Optical Zoom with SteadyShot Image Stabilization and 3.0 inch LCD (Black)", "price": 99.95, "salesRank": {"Camera &amp; Photo": 1165}, "imUrl": "http://ecx.images-amazon.com/images/I/41KkUhiLHOL._SX300_.jpg", "related": {"also_bought": ["B00091S0WA", "B000XO2S9Y", "B0013AX2JM", "B003EEK05Y", "B004H8FNEE", "B006K552CU", "B000MDY7K4", "B003F8UWUM", "B0013AV4M4", "B00170MYIS", "B003PVCTWS", "B0041PO3OY", "B0066CYE7G", "B000BOLHH0", "B003EEK03Q", "B004H8FNKI", "B0012TLZNE", "B006K554I2", "B0035FZJM6", "B0013AZ19G", "B005I6DVC0", "B006K551TO", "B00AQDG96K", "B009L8UUZM", "B005MM3WTC", "B004M8SVES", "B004H8FNJO", "B003960FFM", "B001SEQPIS"], "bought_together": ["B0013AX2JM", "B000XO2S9Y"], "buy_after_viewing": ["B003EEK05Y", "B003PVCTWS", "B000XO2S9Y", "B003VNKNF0"]}}