{"asin": "B000P6L92C", "related": {"also_bought": ["B000Z2UEAE", "B000OAK94I", "B003IPQA4Y", "B000NK7LEU", "B000O9UUWA", "B0058PU4DA", "B0033RRYY2", "B00EZPXYP4", "B00188K75Q"], "bought_together": ["B000Z2UEAE", "B000NK7LEU"], "buy_after_viewing": ["B000Z2UEAE", "B009JHIMQY", "B000O9UUWA", "B000NK7LEU"]}, "title": "HP Photosmart C4280 All-in-One Printer/Scanner/Copier (CC210A#ABA)", "price": 206.98, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41aJOTq2lLL._SY300_.jpg", "brand": "HP", "categories": [["Office Products", "Office Electronics", "Other Office Equipment", "Bar Code Scanners"]], "description": "Amazon.com Product Description The HP Deskjet D4280 is a compact color inkjet printer, copier, and scanner that is capable of printing at speeds of up to 30 ppm in black &amp; white and 23 ppm in color. This multifunction printer can also print borderless 8.5 x 11-inch photos that feature vivid color and 4800 x 1200 dpi resolution directly from supported memory cards..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; } img.withlink {border:1px black solid;}The HP Deskjet D4280 offers:The ability to Print, Copy, and ScanPrint and copy speeds up to 30 ppm black &amp; white and 23 ppm color1 USB port and 4 memory card slotsColor print resolution of up to 4800 x 1200 dpiA 100-sheet paper trayThe HP Deskjet D4280 is a true multifunction printer.View larger.Print directly from a wide variety of memory cards.View larger.Print Crisp, Colorful Photos and Image-Rich DocumentsNot only does the HP D4280 print colorful photos and documents at speeds reaching 23 ppm, but it also makes the quality of the imagery a priority, with its use of HP Vivera Inks and optional six-ink color process.With the HP D4280, you can print directly from a variety of supported memory cards, including CompactFlash, Memory Sticks (Duo), SD, MMC, and xD-Picture Cards. No need for the computer; just plug-in a compatible memory card and use the colorful 1.5 inch LCD screen to help guide you through the printing process.Color Copy and Scan With EaseThe D4280 features easy one-button copying in both black &amp; white and full-color with ultra-high resolution capabilities of up to 600 dpi and 4800 x 12000 dpi respectively. It will make as many as 50 copies with the push of a button at speeds of up to 30 cpm in black &amp; white and 23 cpm in color. Reduce or enlarge originals from 25&#37; to 200&#37; for added versatility.Get a full-color preview of your scan in about three seconds before you actually decide to scan any document. Once you decide to scan, it will be quick; in a matter of seconds, you'll have full-color images up to 1200 dpi in dynamic 48-bit color. Use the included software to enhance a scanned image or document to an unbelievable 19,200 dpi for producing large-scale prints and digital documents.Versatile Paper HandlingThis printer will handle a variety of special media, including envelopes, transparencies, photo paper, panoramas, and more. The 100-sheet paper tray provides plenty of paper capacity for small-scale jobs.Compatible with both Windows (some features may not be available with Windows 2000) and Macintosh, the HP Deskjet D4280 measures 17.09 x 11.42 x 6.38 inches and weighs 11.09 pounds. It's backed by a 1-year limited warranty.What's in the BoxHP Photosmart C4280 All-in-One, HP 74 Black Inkjet Print Cartridge (4.5 ml), HP 75 Tri-Color Inkjet Print Cartridge (3.5 ml), power supply, power cord, software CD, setup guide, basics guide, read-iris flyer, registration card, and pen shopping card."}