{"asin": "B004SBI2PW", "description": "The sleek and stylish Acer Iconia Tab W500 delivers the mobility of a Tablet combined with the productivity of a notebook, making it the perfect tool for home or on-the-go. The hybrid design offers the best of both worlds: the convenience of HD multi-touch Tablet portability, and the full productivity of a standard Notebook via a dockable keyboard. Advanced technology such as Windows 7 OS makes this Tab one smooth operator with enhanced usability and the AMD Brazos CPU provides dual-core power to speed through tasks and enables vivid and smooth multimedia playback. You&rsquo;ll be blown away by what the Acer Iconia Tab W500 can do- rethink how you go mobile!Key Features10.1&rdquo; HD Multi-Touch LED-backlit TFT LCD Display:(1280 x 800) resolution, wide viewing angleAMD Dual-Core Processor C-502GB DDR3 Dual-Channel MemoryWindows&reg; 7 Home Premium 32-bitMicrosoft&reg; Office Starter 2010ATI Radeon&trade; HD 6250 Graphics32GB Solid State DriveDual 1.3MP Acer Crystal Eye Webcams(1280 x 1024) resolution802.11b/g/n Wi-Fi CERTIFIED&trade;Bluetooth&reg; 3.0+HSDolby&reg; Advanced Audio&reg; v2 Audio EnhancementHigh-Definition Audio Support2- USB 2.0 Port1- HDMI&trade; Portwith HDCP SupportFull-Size Acer FineTip KeyboardAcer PowerSmart Battery3-cell Li-PolymerLearn MoreFrom Tablet to Notebook in a Snap!Enjoy powerful dual-core performance at home or on-the-go with the unique hybrid design.Choose how you go mobile with the Acer&reg; Iconia Tab W500-BZ467. With the unique hybrid design you have the option to take this Tab on-the-go or insert it into the docking station with full-size chiclet keyboard for convenient two-handed text input.The dockable keyboard offers more than just comfortable typing&hellip; It also features an Ethernet port for fast Internet connections and a USB port for external devices.With the latest Dual-Core AMD C-50 Processor, this hybrid Tab has the power to handle Flash 10.1 HD while also enjoying long battery life. The discrete-class graphics provide rich and vivid colors, sharp images, and smooth multimedia playback anywhere- even on a big screen HDTV via HDMI output.Integrated battery provides 4 hours HD video playback and 6 hours Internet browsing so that you can enjoy the freedom to go anywhere, anytime- without worrying about finding the nearest outlet!32GB of Solid-State Storage provides fast data access, is light and quiet, and features a sturdy design for your ultraportable Tab. 2GB Memory delivers quick system response and fast boot ups.An Absolute Touch ExperienceScroll effortlessly through your favorite applications with your fingertips using the fun and simple Acer Ring Control Interface!The 10.1\" 720p HD capacitive multi-touch display with wide viewing angles enhances your digital world and makes everyday activities simple. From checking email and social networking, to enjoying HD content like movies and games- this Tab lets you experience them in a new and exciting way!The W500-BZ467 optimizes your touch experience in the Windows&reg; 7 Home Premium environment with bigger icons and a dedicated control bar so you can be more productive and interact with your familiar Windows programs easier than ever.The Acer Ring Control Interface is your entry point to entertainment. Simply place all five fingers on the screen in a grab gesture to launch the unique touch portal and scroll effortlessly through your favorite applications and utilities with your fingertips.Connect Like Never BeforeStay fully connected with friends and the latest buzz wherever you go.SocialJogger puts your social life in one place so you can connect to Flickr, Facebook, and YouTube instantly and simultaneously. The 1.3MP HD front and rear-facing cameras offer a special way to keep in touch with family and friends.Acer Clear.fi&trade; allows you to manage, store, share, and enjoy media between any Clear.fi enabled devices, in any room throughout your home.Connect to the Internet reliably with 802.11b/g/n Wi-Fi CERTIFIED&trade; and Gigabit Ethernet LAN conveniently delivering rapid connectivity from your home, at work or on-the-go.", "title": "Acer Iconia Tab W500-BZ467 10.1-Inch Tablet (Silver)", "price": 499.99, "imUrl": "http://ecx.images-amazon.com/images/I/41H9tEDMGiL._SX300_.jpg", "related": {"also_bought": ["B0051C4S78", "B005KK4S3U", "B005TP7ZJK", "B004XZL980", "B004U78J1G", "B0051OKO42", "B002OJ7QXY", "B005GQO24I", "B004U78JT8", "B009LL9U50", "B004M5KYGY", "B004VPLY1E", "B004M5QPNA", "B007BUXY00", "B004MT9S62", "B007BI93IE", "B007QUMK3C", "B004SBG0FQ", "B007BUYZWQ", "B005HN1GBW"], "bought_together": ["B0051C4S78"], "buy_after_viewing": ["B00FEE7B1I", "B00FFJ0HUE", "B00I054WFQ", "B002OJ7QXY"]}, "categories": [["Electronics", "Computers & Accessories", "Tablets"]]}