{"asin": "B000GT5FK0", "description": "OPPO Digital's DV-970HD was developed following the success of the OPDV971H, the award-winning upconverting DVD player which scored the highest against hundreds of brands and models in independent DVD player benchmark tests. With experience garnered from the OPDV971H and insightful input from the A/V enthusiast community, OPPO packs the DV-970HD with high performance and enthusiast grade features, all at an incredible value. Today's traditional DVDs and DVD players are intended for low resolution, standard definition televisions. The DV-970HD, designed for every HDTV owner, up-converts standard DVD to high-definition signal, producing clearer, smoother, and crisper video on HDTV and projectors. Its HDMI output ensures a pure, straight digital path for video and audio. In addition to its up-conversion feature, the DV-970HD can output a native 480i/576i resolution over HDMI, making it an incredible digital transport for use with high-end video processors or scalers. Featuring a stylish, slim, and modern design, the DV-970HD includes an integrated 4-in-1 flash memory card reader to allow viewers to enjoy their digital pictures and music. It also offers a USB interface for expanded connectivity. The DV-970HD is one of the most versatile players on the market, providing support for DVD-Video, DVD-Audio, Super Audio CD (SACD), DVD+/-RW and CD-R/RW. It is also compatible with DivX(R) video, XviD, Audio CD, HDCD, Kodak Picture CD, WMA and other digital audio and video media formats. The DV-970HD supports NTSC or PAL disc and television systems. As video is only part of the equation, the DV-970HD also features excellent audio with Dolby Digital surround sound and Pro Logic II decoding. A high-quality certified HDMI cable with gold-plated connectors is included, adding even more value to the already feature-packed product. The OPPO DV-970HD provides most of the performance of the highest-rated OPDV971H, but at a lower price and includes even more features.", "title": "OPPO DV-970HD Up-Converting Universal DVD Player", "price": 142.0, "imUrl": "http://ecx.images-amazon.com/images/I/316Q6Z4C5AL._SX300_.jpg", "related": {"also_viewed": ["B00078GLJY", "B004BI6MVS", "B009LRR5AQ", "B004SBHSZ2", "B0012KHNZW", "B009AHQ8C8", "B00GPFM106", "B002CO6GUK", "B001IBHUU8", "B004BLK24S", "B004UR487A", "B00817UWQ6", "B003ZFRA00", "B001GAOYCS", "B00GXTUTN0", "B004NQU4YY", "B004QIPKNY", "B00BN9CH26", "B008F86F30", "B00D0EP68Y", "B005NEZDUA", "B008HO9VHE", "B00I19TOGS", "B004LNMAAA", "B00CXNHJAQ", "B00KQ2EQUM", "B00B9MM57E", "B007F9XHAY", "B0045PKK60", "B008982LDY", "B001PBQNPO", "B007BYLO4E", "B00JRH8EY6", "B00752R4QO", "B0038JECKO", "B008PB8XN2", "B005C98484", "B005625SJK", "B007F9XHBI", "B003V8B0VG", "B00HUGNN06"], "buy_after_viewing": ["B007F9XHAY", "B007F9XHAY", "B00AWKC0JM", "B007BYLO4E", "B007BYLO4E", "B003L1ZYYM"]}, "categories": [["Electronics", "Television & Video", "DVD Players & Recorders", "DVD Players"]]}