{"asin": "B0038W0NEU", "description": "Geared for desktop and laptop computers, Altec Lansing's Octane Plus 2.1 Speaker System packs exceptional audio dispersion into a stylish, compact unit. Featuring a powerful subwoofer and down-firing mid-range drivers, the Octane Plus takes up minimal space on your desk, but fills your room with full-spectrum sound for your music, movies, gaming, and more.The Octane Plus2.1 Speaker SystemAt a Glance:Unique downward-firing design for well-balanced sound.Powerful 6-1/2-inch subwoofer for impact bass.Audio Alignment technology for balanced components.Compact, contemporary design takes up little space on the desk.Controls for volume, treble, and bass are conveniently located on the speaker itself.View larger.The Octane Plus features a compact, contemporary design that complements any computer or laptop.View larger.Deep Bass and Full, Accurate SoundTo give you exceptional audio from your desktop or laptop computer, the Octane Plus features down-firing, three-inch, mid-range drivers that blast sound waves onto a hard surface, where they are reflected and evenly distributed throughout your room. The result is clear, well-balanced sound--whether you're watching movies, listening to music, or playing a video game.In addition to the down-firing mid-range drivers, the Octane Plus also features dual one-inch micro-drivers for clear, detailed highs. Filling out the sound is a powerful 6-1/2-inch side-firing, long-throw subwoofer that delivers substantial bass and lets you fully experience loud explosions, kick drums, thunder, and other low-end effects.Elegant Design Looks Great On Your DeskBy incorporating down-firing mid-range drivers into its design, the Octane Plus not only creates well-balanced sound, it also takes up very little space. Featuring a bold, contemporary design, the speakers will complement any computer or laptop.For added convenience, the Octane Plus features separate bass and treble controls that let you fine-tune audio preferences for different music, movies, and games.Auxiliary Input Jack Lets You Connect Other DevicesIn addition to connecting to your computer, the Octane Plus also includes an auxiliary-in jack that lets you connect other devices, such as MP3, CD, and DVD players.A downward-firing mid-range driver and a 6-1/2-inch woofer deliver full-range, well-balanced sound.Audio Alignment Technology for Balanced SoundWhether it's the tiniest of ear buds or the most imposing of subwoofers, Altec Lansing has refined every detail of its speakers to provide you with accurate sound reproduction and quality. Audio Alignment ensures that the key audio components work together to deliver your music the way it is meant to be heard, offering the perfect balance of your speaker system's drivers, enclosure, and electronics.About Altec LansingFor more than 70 years, audiophiles have recognized Altec Lansing as one of the world's most valuable and innovative audio brands. Headquartered in Milford, Pennsylvania, the company boasts a unique history of innovation that includes the introduction of first talkie film speakers, the first iPod docking station, and the first \"Works with iPhone\" speaker system. Altec Lansing makes a wide range of audio systems for the home and office, a line of headphones for personal listening, and the popular line of inMotion speaker systems for portable digital players.The Octane Plus 2.1 Speaker System is backed by a one-year limited warranty.What's in the BoxOctane Plus speaker system, color-coded cables, and quick connect guide.", "title": "Altec Lansing VS4621 Octane 7, 2.1 Computer Speaker", "price": 44.18, "imUrl": "http://ecx.images-amazon.com/images/I/31SLRGQSc8L._SX300_.jpg", "related": {"also_bought": ["B000SE6IV8", "B000I23TTE", "B008I647AM", "B008I646WG", "B0025VKUQQ", "B0083J8D90", "B008I647MA", "B001UW7YDS", "B000067RC4", "B0025VKUQG"], "buy_after_viewing": ["B0025VKUQQ", "B0027VT6V4", "B003VAHYTG", "B0025VKUPW"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Computer Speakers"]]}