{"asin": "B0002R282O", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "Optics and ResolutionFeaturing a 5-megapixel CCD sensor, the DMC-FZ20S delivers a wide range of detail and color with images up to 2560 x 1920 pixels--enough information to make photo-quality prints up to 13 by 17 inches. Leica DC Vario-Elmarit 12x zoom lens, with 3 aspheric elements, combines comfortably small size with superb image rendering. By combining with a 4x digital zoom, users will have an equivalence of a 48x zoom lens in a very compact body, though users should note that digital zoom degrades picture quality.Movie Mode and AudioThe DMC-FZ20S lets you shoot QuickTime Motion JPEG video at resolutions up to 320 x 240 pixels with sound. The amount of video you can capture is limited by space on the memory card; you'll fit more at low quality (10 frames-per-second) than at high quality (30 frames-per-second). The movies aren't camcorder quality, but they're fun and convenient, and they're perfect as e-mail attachments. You can also record audio comments, up to five seconds in length, for your still pictures.More FeaturesFlip Animation: Allows you to create your own frame-by-frame animations.Unlimited Consecutive Shooting: Allows consecutive shooting up to the capacity of the SD memory card.Two-inch diagonal polycrystalline TFT LCD display (130k pixels)Hot shoe for external flash attachmentMega Burst Shooting Mode: Shoot up to seven images at three or two frames-per-second in standard resolution, or up to four images in fine resolution. This option is designed to provide you with the best selection of photos during action, such as a sporting event.Storage and TransferImages and video are stored on Secure Digital (SD) memory cards. A 16 MB SD card is included. Files can be downloaded to either a Mac or PC via USB connectivity, which means it can be connected to any USB-based Windows 98/Me/2000/XP and Mac OS 8.6 or later computer without installing any software.PrintingThis camera supports thePictBridgestandard. PictBridge is a technology that lets you transfer pictures from a digital camera to a compatible printer, without a PC or image-editing software. Because PictBridge is an industry standard, users can connect PictBridge-compatible devices made by many different manufacturers.Learn more about PictBridge.Power and SizeThe camera is powered by lithium-ion battery pack (included with charger). It measures 3.43 by 5.02 by 4.18 inches and weighs 1.14 pounds.What's in the BoxDMC-FZ20S digital camera, battery charger, battery pack, 16MB SD memory card, lens cap, lens hood with adaptor, A/V and USB cables, strap, and CD-ROM", "title": "Panasonic Lumix DMC-FZ20S 5MP Digital Camera with 12x Image Stabilized Optical Zoom (Silver)", "price": 9.99, "salesRank": {"Camera &amp; Photo": 27013}, "imUrl": "http://ecx.images-amazon.com/images/I/41QB80622JL._SY300_.jpg", "related": {"also_viewed": ["B00B5MUJTO", "B008HVZY1E", "B004LB4SBG", "B00ATM1NBY", "B00DY2Y28M", "B00B46XSC6", "B008HVZZUO", "B001CCLBSU", "B00ATM1NAU", "B0056ENTVC", "B004HO58NO", "B00HV6KIDA", "B00001QEMF", "B00AX12XTC", "B00B46XLT6", "B000A7XSSY", "B00CC9QTA2", "B00IA9LUP2", "B0034XFG86", "B00B2QK2H2", "B008MB6YX6", "B00GFYTU4W", "B001G5ZTZO", "B000EMWBV0", "B008MB6ZX0", "B000TM7GD8", "B0007QKN22", "B00728ZBA2", "B0058SDGW8", "B00B7N9D4I", "B00B7N9CWG", "B00ATE7W7G", "B00D0Z83X8", "B00HQ4W3OE", "B0075SUK14", "B00EFILPHA", "B00966J1WC", "B004XIB9T6", "B00EFILR6E", "B00889ST2G", "B003VNKNF0", "B00HQ4W1QE"], "buy_after_viewing": ["B003VNKNEQ", "B0039BPG1A", "B005HNF01O", "B008MB6YX6"]}}