{"asin": "B006UMMPGE", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "Pro Image Quality with Compact Convenience&nbsp;Small and light with a sleek new design, the VIXIA HF M500 camcorder&rsquo;s image quality is unsurpassed, thanks to the camcorder&rsquo;s newly designed, professional-level Canon HD CMOS Pro Image Sensor. The high-sensitivity sensor provides outstanding resolution, better low-light performance, and beautiful, natural detail in both shadow and highlight areas. Intelligent IS and SuperRange Optical Image Stabilization designed for the Genuine Canon 10x HD Video Lens make every scene clear and steady, and new built-in features make it easy to give your videos added creativity. Operation is fun and simple with a Flat Touch Panel LCD you&rsquo;ll control with your fingertips. This camcorder has the flexibility you crave: enjoy the convenience of recording video in either AVCHD or MP4 format or to a removable SD/SDHC/SDXC memory card. &nbsp;Unsurpassed Canon OpticsGenuine Canon 10x HD Video LensBuilding on Canon&rsquo;s decades of optical excellence, the VIXIA HF M500&rsquo;s 10x HD Video Lensproduces extraordinary images. The high-performance Canon HD Video Lens uses low-dispersion glass to suppress chromatic aberration, delivering crystal clear video with excellent resolution, even at the telephoto end of the zoom. Super spectra coating technology lowers flare and ghosting. The lens also features an iris diaphragm. Normally found only on professional-level camcorders, the iris diaphragm produces highly expressive video with sharply focused subjects and beautifully blurred backgrounds.Newly Designed Canon HD CMOS Pro Image SensorEquipped with the same high-powered image sensor found in professional models, the compact VIXIA HF M500 camcorder captures 1080p Full HD video with the rich, vivid quality of a much more upscale camcorder. The professional-level 1/3-inch native 1920 x 1080, HD CMOS Pro Image Sensor has a large pixel size that captures more available light to deliver superb imaging. Technical refinements including a thinner on-chip microlens, improved color filter transmittance and deeper, wider photodiode allow 20% higher light transmittance*. Additional light to the sensor means that video shot in low-light situations is brighter and clearer, with better noise suppression. The newly extended dynamic range is exceptionally wide, producing enhanced gradation and natural, lifelike realism in high-contrast scenes.*20% improved low-light performance compared to the Canon HD CMOS Pro Image Sensor used in Canon&rsquo;s 2011 VIXIA Camcorders.Share Your Videos Quickly and EasilyRecord to Internal Flash Drive or SD Memory CardThe VIXIA HF M500 camcorder records Full HD Video directly to a removable SD memory card. Widely available in several capacities, SD memory cards let you share your videos quickly and easily; simply remove the card and insert it into a PC&rsquo;s SD memory card slot. In addition to SD memory cards, the VIXIA HF M500 lets you use super-high capacity SDXC cards. The same size as a standard SD card, an SDXC card can hold up to 2048 GB, and provides ultra-fast data transfer.VIXIA RECORDING TIME CHART", "title": "Canon VIXIA HF M500 Full HD 10x Image Stabilized Camcorder with One SDXC Card Slot and 3.0 Touch  LCD", "price": 938.0, "salesRank": {"Camera &amp; Photo": 2920}, "imUrl": "http://ecx.images-amazon.com/images/I/41549UBMm5L._SX300_.jpg", "related": {"also_bought": ["B0032MS1B8", "B004QPCKGC", "B008H4JLTC", "B0039BPG1K", "B002K4K39M", "B004XIB9T6", "B0070QPAPM", "B005BHX0A4", "B003VNKNF0", "B0070QPA3Y", "B00824F4VG", "B00009KLAE", "B0012ILNK0", "B007X6711U", "B0070QPSTU", "B001KN6WL2", "B007OX8454", "B002M3ST0Q", "B00805IP36", "B001ELQTTA", "B007NMV9CQ", "B004JNXDH6", "B00F24P30Q", "B0070QNGFS", "B0070WU51U", "B005Y1SYDU", "B002MTU5C0", "B000GE403I", "B000NJD13G", "B00CV9MKJ2", "B002HJ9PTO", "B00006HO3R", "B008I19S88", "B00006JPD8", "B000V7AF8E", "B00E0UM9L4", "B0058CXPO8", "B007X5VS88", "B005C95NMO", "B003PBB4ME", "B0007U9SOC", "B005BI2RMU", "B00139XOCI", "B00AR95ENW", "B002ONSZPI", "B005ONOX2E", "B004Q3C98S", "B008MIMIY8", "B00CV9MK4W", "B0007A1IRC", "B004HW7E3I", "B007M54E1M", "B005JT24ZG", "B006UMMPMI", "B002GYPS3M", "B005GMWNY8", "B002TLT07W", "B00006JPD5", "B002KEYY6K", "B007OX84EA", "B008PGN4O0", "B0002NIP98", "B007Y8428M", "B00CH5LG8G", "B00006I523", "B004ECZJDS", "B003VCW6G0", "B004TJ6JH6", "B007X4QPFU", "B006LWH7CA", "B003P3MCXW", "B003VNKNEQ", "B002S9KDKS", "B004AZ38Z0", "B0039BPG1A", "B004IA8F50", "B000OPB4U6", "B0076PEI46", "B007OX85V2"], "bought_together": ["B003VNKNF0"], "buy_after_viewing": ["B00HLDFTRS", "B00HLDFTRS", "B003VNKNF0", "B0039BPG1K", "B008H4JLTC"]}}