{"asin": "B0002SQ0BS", "description": "Sam Fisher is back for more espionage and intrigue in Splinter Cell: Chaos Theory. All the nail biting about whether to go in \"hot\" with guns blazing, or to use stealth is back in this new version, plus some amazing improvements. Chaos Theory ups the ante with vastly improved graphics, totally open level design, and coop gameplay.Fresh from the East Timor operations, Fisher is now put on the front lines of information warfare. The year is 2008 and the world is suffering from citywide blackouts, stock exchange sabotage, and electronic hijacking of national defense systems. The stakes are high and Fisher, as the NSA's most elite black-ops agent, is inserted in operations to aggressively gather intelligence. A wide range of missions call on a lethal mixture of weapons and close range combat. While Chaos Theory demands the same agility and athleticism required in previous Splinter Cell incarnations, some new weapons, gadgets and moves are available, such as the prototype Land Warrior rifle, and the stealthy, but oh-so-deadly inverted neck break.In addition to an improved graphics engine, physics are enhanced, too. Enhancements like rag doll physics, particle effects, and realistic interaction with the environment make the Splinter Cell experience more immersive than ever. Just as judging your environment was crucial in past Splinter Cell games, Chaos Theory demands that you understand the delicate balance between light and shadow to stay alive.Chaos Theory offers great replayability in single player mode, thanks to its vast, open level design. There's always more than one way to achieve your objectives. At the beginning of each mission you are given your objectives, but you must choose how to go about completing them. Decisions about stealth versus conflict are yours to make, too. Should you enter a mission with non-lethal weaponry, a host of guns and ammo, or a little bit of both? You decide.The Splinter Cell franchise is known for its tense, stealth-driven multi-player modes, and Chaos Theory is no exception. This version adds unique cooperative modes where you and your teammates must complete infiltration missions. Try to keep each other alive. Try to thrive in the dark and strike when the moment is right.", "price": 36.99, "imUrl": "http://ecx.images-amazon.com/images/I/511VFC6J6VL._SY300_.jpg", "related": {"also_bought": ["B00012TIW8", "B00006JZQZ", "B000CBVC0Y", "B000CBZPDO", "B000SQ5LQ4", "B00005NZ1G", "B0086V5V9A", "B00020BV0Q", "B000B2YR74", "B0009UC68U", "B00019HNN2", "B00005RCQ5", "B00008KTNW", "B0000A92KZ", "B0006ZJPSC", "B00008J7NZ", "B0002CHIZ6", "B000067DPM", "B0009351RK", "B000069BCN", "B001ELWMHI", "B0009N1KD4", "B0000DJX7I", "B00008G764", "B000G7PMXC", "B0006I5I58", "B0007P8FN2", "B0001AVSH8", "B0007ZD79E", "B00008G75X", "B000LXIO6I", "B0000C7GH4", "B00006C28W", "B00006JN5J", "B000087L4G", "B000A0EFJW", "B0001UEHP8", "B004AGYHUE", "B00008XKZM", "B000G82DDS", "B0008GJRQ4", "B00020BV1A", "B0009PQ0IM", "B000ZK9QD2", "B00009ZVHU", "B00025EJ1E", "B0002CHJA0", "B000HVDEQO", "B00005RKO7", "B0008JILX6", "B0009SQFHA", "B000FW6MFK", "B0000AI1KE", "B0001ADAMO", "B000IBGV18", "B00005OWBL", "B0000AJMPK", "B000784XIA", "B000AX21VI", "B0009Z3IV4", "B006ZQ85YG", "B000B6MLZK", "B00082ZQZY", "B00006IJIS", "B0001CNRQQ", "B001I020CW", "B00005NZ1K", "B000WSE2WM", "B0007DGB4E", "B0001DI6FM", "B000P46NMK", "B00095LEEW", "B0001JXQ5Q", "B0001I9YE4", "B00006JC48", "B00004S99R", "B000FRS9II", "B00009M7Q8", "B00008H2IU", "B00006LU9C", "B000WEQL02", "B00001X50M", "B0007OGDHS", "B00067AVSS", "B0000C6FKA", "B0002A2S26", "B00069BV5I", "B0006SST9U", "B000HKGIOA", "B000AOEV6A", "B0002IJY2U", "B0002IQC8Y", "B00008RUYR", "B000HCQK0A", "B00006LU9L", "B00006409Z", "B0002IZICK", "B002I0JA7E", "B000930DLE", "B00AA4FDTY"], "bought_together": ["B00012TIW8", "B00006JZQZ"], "buy_after_viewing": ["B0086V5V9A", "B000SQ5LQ4", "B000CBVC0Y", "B00006JZQZ"]}, "salesRank": {"Video Games": 9110}, "categories": [["Video Games", "More Systems", "Xbox", "Games"]]}