{"asin": "B002COJEOU", "related": {"also_viewed": ["B0087NZ31S", "B0092ML8S0", "B008DWCRQW", "B00CCIL9NU", "B0084JFLU8", "B001F7HLRC", "B000LIFB7S", "B00BYRPPAS", "B00C9V0OBI", "B00C9VB318", "B000U78XOS", "B00CL58K0Y", "B0084JFLTY", "B00EXK14S0", "B009V00K3W", "B000QD7B6W", "B007KZQMO6", "B000Z7AKGC", "B0092ML8QW", "B00II4QK2W", "B000NV7K8G", "B009SPNO1K", "B00387G6R8", "B001SEL326", "B005CSOE1G", "B002YLAUU8", "B005DIPWFC", "B009UZZW1S", "B00F0DD0I6", "B0081TXJ28", "B003B48UQ8", "B00FB45SI4", "B006QB1RPY", "B0050SLU6K", "B008OUKZZI", "B0081TXIXI", "B0081H8TRA", "B008HO9DIG", "B008HO9DK4", "B00D69747O", "B0088CJT4U", "B001UI4RTG", "B00B0CQCCC", "B003Y5RYNY", "B0049YQVHE", "B006TZM6XO", "B0041LYY6K", "B00FRMAOIO", "B00BUSDVBQ", "B002HWRJY4", "B00EM5UFP4", "B00IF0JAYE", "B00FK1E46U", "B008I21EA2", "B007IL7AKM", "B008ABOJKS", "B00AJHDZSI", "B001FWYGJS"], "buy_after_viewing": ["B0081TXJ28", "B0092ML8QW", "B0087NZ31S", "B007IL6OR2"]}, "title": "D-Link DIR-685 Xtreme N Storage Router and Photo Frame, 2.5&quot; Drive Bay, 3.2&quot; LCD, Draft 11n", "price": 225.05, "salesRank": {"Electronics": 82788}, "imUrl": "http://ecx.images-amazon.com/images/I/41y5La68CjL._SX300_.jpg", "brand": "D-Link", "categories": [["Electronics", "Computers & Accessories", "Routers"]], "description": "Amazon.com Product Description At first glance, D-Link's Xtreme N Storage Router might be mistaken for a basic digital photo frame. Take a closer look, and you will find that this 2009 winner of the prestigious Red Dot Product Design Award is more than a photo frame. It's also a high-performance router that lets you create a wireless network in your home, so you can share high-speed Internet access with multiple computers, game consoles, and media players. You can also use the Xtreme as a network-attached storage (NAS) device that stores your files and prints and shares photos, iTunes libraries, and more.Behind the digital photo frame hides a network attached storage device and a wireless router.View larger.Behind the photo frame hides Gigabit Ethernet and USB connections.View back.High-Speed Connection and Full Wireless Coverage for Ease of UseWith an integrated 802.11n high-speed band and a 2.4GHz signal, the D-Link Xtreme lets you experience full wireless coverage throughout your network. The powerful MIMO antennae are internal, which means that you can enjoy faster speed and longer range without sacrificing the router's stylish appearance.The Xtreme also includes Ethernet Gigabit ports for file transfer rates up to 10 times faster than the standard 10/100 Ethernet ports. And thanks to the router's touch-sensitive buttons that let you easily add devices to your network, multiple computers, printers, and even game consoles will be available at your fingertips.Network-Attached Storage for Easy File AccessHigh-speed connectivity is only the beginning. The DIR-685 can also double as a network-attached storage device (NAS). It has the ability to hold a compact 2.5-inch hard drive. Simply pop open the cover and slide in the drive (sold separately), and the router's built-in NAS functionality will do the rest.With the Xtreme N Storage Router, you can safely store files on your home network and access them wherever you go. Take your laptop with you, connect to the Internet, and then retrieve your files from the Xtreme using the router's built-in FTP server.BitTorrent Support and Video Streaming for VersatilityThe Xtreme includes the latest BitTorrent software support, so you can access and store digital media directly from the Internet without the need for your computer to be turned on or connected. For extra large files, you can get the download process started and then walk away with the confidence that your video clips or songs will be on the system's hard drive when you return.The built-in Universal Plug-and-Play server allows you to easily stream video files through a compatible media player onto your television. You can even stream files from your Xbox 360 and PlayStation3 gaming systems.Digital Frame Lets You Share Photos, Print Photos, and MoreThe Xtreme also includes FrameChannel software. Once you set up a free account, you can begin sharing your latest photos with family and friends using Flickr, Picasa, Facebook, and other popular photo sharing sites. With two USB 2.0 ports, you can even connect to a printer to print your photos.Better still, you can use the Xtreme to subscribe to your favorite RSS feeds. Get the latest news, stock updates, sports scores, time, date, weather conditions, and more--all directly from your frame.What's in the BoxXtreme N Storage Router, CAT5 Ethernet cable, stand, power adapter, and CD-ROM with Installation Wizard and product documentation."}