{"asin": "B008TCW2LG", "description": "Do you want to watch your satellite/cable feed on two televisions but you only have one receiver? Do you have your DVD player in your living room and you want to watch a DVD on your bedroom television? This device allows you to easily broadcast your DVDs, CDs, MP3s, satellite/cable, gaming console, streaming video and more to any TV or stereo system in your home or office.Wirelessly Send Audio and Video to your TVNow you can easily stream high quality audio and video from one room to another, all without installing wires. Whether it's your cable/satellite, DVD player, game console, or any other audio/video device with standard RCA composite connections, this wireless transmitter and receiver uses radio frequency technology that will allow you to watch it on another TV wirelessly.Powerful Long Range 5.8GHz SignalThis system can broadcast real time audio/video up to 400ft (open space). It also transmits through walls, floors and ceilings with ease. Whether your other TV is in the basement or on the other end of your house, this video sender will broadcast crystal clear sound and full motion video. The powerful 5.8GHz signal will not interfere with Bluetooth or most Wi-Fi networks, which are typically 2.4GHz. The directional antennas ensure an optimal signal and minimize interference from other devices.Control Your Audio/Video Device from another RoomNot only can you watch your audio/video source remotely, you can also control it. The built in IR (infrared) remote extender will send your device's remote control signals over the air. Change channels, pause your movie - any function available on your remote will work using the remote extender. Simply point the IR extender at the device you want to control and your devices can be controlled from a remote location up to 100ft.", "title": "Nyrius NY-GS3200 5.8GHz 6 Channel Wireless Audio/Video Sender Transmitter &amp; Receiver System with IR Remote Extender", "price": 79.99, "imUrl": "http://ecx.images-amazon.com/images/I/31uI3KIcNfL._SY300_.jpg", "related": {"also_bought": ["B0050688Q2", "B003ID6XN4", "B00AMTRUYI", "B00E953OJQ", "B00005T3G9", "B00HLV1KQO", "B001WW0D98", "B000068O4Y", "B009OMYHJU", "B0014KKV7W", "B000C1Z0HA", "B00HTJ78JG", "B003L18YOE", "B00BDYK1Q0", "B004T8KZCM", "B00D96J8IM", "B00BDYJMEC", "B00E0HFKFE", "B003BVVYSM", "B00068IJPO", "B005N0CRT4", "B00FL3URX6", "B00BCGRX9M", "B001EPVOQY", "B0060F1VKC", "B003O1UYHG", "B000HDMUU8", "B001CJOLBW", "B000WDR94U", "B003MHUN7S", "B0018BQR84", "B000V1K7FG", "B00GGVPKKC", "B00004Z5CP", "B008FO7PQA", "B0002J2B9C", "B000H1PGMO", "B003O55U8K", "B0006N61RW", "B00713RSE0", "B00AMTRR5K", "B000QKKAPE", "B00B46XUQU", "B00CJHXY0U", "B001B8QUS6"], "bought_together": ["B0050688Q2", "B003ID6XN4"], "buy_after_viewing": ["B00FB1NTP6", "B00E953OJQ", "B005L9ZZ32", "B009E6R89C"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Remote Controls", "Remote-Control Extenders"]]}