{"asin": "B000HAR8UI", "categories": [["Electronics", "Computers & Accessories", "Monitors"]], "description": "Add more screen real estate to your computer's desktop with the 22-inch Acer AL2216Wbd LCD monitor, which features an elegantly sophisticated, stylish black casing. But more than just a monitor for your desktop or laptop PC, the AL2216Wbd is also an excellent choice for gamers with its blazing fast 5ms (millisecond) response time. It also offers a high level of brightness with a 300 cd/m2 rating and a 700:1 contrast ratio. Other features include a 1680 x 1050-pixel resolution, dual DVI and VGA inputs, VESA compatibility for wall mounting, and user friendly controls on the front.The monitor's 5ms response time is essential for hard-core gamers, and it's also great for watching high-intensity action movies with fast movement. It offers a high level of brightness with a 300 cd/m2 (candela per square meter) rating and a 700:1 contrast ratio. (The higher the contrast ratio, the greater a monitor's ability to display subtle color details and not get washed out by ambient room light.) The screen also has a 170-degree horizontal and 160-degree vertical viewing angle.The AL2216Wbd has a 22-inch screen (measured diagonally) that is framed by a thin, black bezel. The screen housing measures 20.2 inches wide by 16 inches tall. It sits upon a flat stand that measures 7.8 inches deep. Get just the right view with forward and backward tilting. The spare back includes just a power connector and the two video inputs: analog VGA and digital DVI with HDCP, which enables you to hook this monitor up to a cable or satellite set-top box for watching your favorite TV programs. It also supports Kensington locks for added security.What's in the BoxLCD monitor, power cable, VGA/D-Sub cable, DVI cable, printed user guideTech TalkHDCP-- High-Bandwidth Digital Content Protection (HDCP) is a form of copy protection technology designed to prevent transmission of non-encrypted high-definition content as it travels across DVI or HDMI digital connections.Response Time-- The amount of time it takes for a liquid crystal cell to from active (black) to inactive (white) and back against to active (black). It's measured in milliseconds (ms), and the lower the number the faster the response time--translating to a smoother picture with fewer pixilated or ghosted artifacts.", "title": "Acer AL2216Wbd 22&quot; LCD Monitor - Black", "price": 129.99, "salesRank": {"Computers & Accessories": 6183}, "imUrl": "http://ecx.images-amazon.com/images/I/51%2BizhsRHUL._SX300_.jpg", "related": {"also_viewed": ["B00BWBEL1U", "B0098Y77U0", "B00347A48O", "B002RW08EC", "B00JKVJEI4", "B005BZNDOO", "B00CLZ047Q", "B003HFCDLY", "B00BI3BP34", "B009O847CQ", "B00BI37RNG", "B005LJWJSG", "B005PAIVII", "B009POS0GS", "B0098Y77OG", "B00CRZCJKK", "B005BZNEVQ", "B008TYDEJS", "B003N7P6TC", "B00CYOB9W8", "B000FLXW90", "B00GA2OUOY", "B0073C7HJK", "B00JB6HCFA", "B00C8T5KOW", "B00D78QCYK", "B005BZNDS0", "B00EPQZXNE", "B008LE4XU0", "B00AV4NXFY", "B00413PHDM", "B002RW08EM", "B00655B9C2", "B0045JFTXU", "B00B5Q6Y8U", "B0099XBP1M", "B0058UUR6E", "B009HNEBLK"], "buy_after_viewing": ["B005BZNDOO", "B00BWBEL1U", "B0098Y77U0", "B001TH7T2U"]}}