{"asin": "B002MPPHKY", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "An impressive 10.0-megapixel resolution won't miss the finest details of your subject. Images are captured sharp and clear, in vivid colors, even when printed at large sizes. Featuring a 3x optical zoom, this compact performer lets you enjoy a range of picture-taking options, from atmospheric wide-angle scenes to dramatic close-ups.Equipped with evolved 6 scenes SR Auto (Scene Recognition Auto) and Face Detection, scenes and faces can be captured and optimized at its best with this detection functions. Framed scenes are automatically detected and selected into appropriate camera settings: portrait, landscape, night, macro, night portrait, and backlit portrait.ISO3200 sensitivity ensures blur-free photos, even in low light or with rapidly moving subjects. It also lets you shoot without the flash, for attractive, natural-looking pictures that preserve the atmosphere and colors of the scene.The FinePix J28 is sleek and slim, fitting into your purse or pocket so you can take it with you everywhere. The large, bright LCD display makes it easy to compose great photos. And sharing pictures is a pleasure, thanks to a high-impact 230,000-dot resolution.Featuring explanations for each shooting mode, scene position, and control setting, the easy-to-read icon-based interface is designed to take the guesswork out of selecting camera settings. Up to 100 pictures can be viewed at a time in a 10 x 10 array of micro thumbnails. It's convenient for smooth and comfortable playback.3x optical zoom in actionFuji FinePix J28 Features10.0-megapixel resolution captures clarity and vivid colorAn impressive 10.0 megapixels resolution won' t miss the finest details of your subject. Images are captured sharp and clear, in vivid colors, even when printed at large sizes.3x optical zoomFeaturing a 3x optical zoom, this compact performer lets you enjoy a range of picture-taking options, from atmospheric wide-angle scenes to dramatic close-ups.Face detectionNew SR AUTO &amp; Face DetectionEquipped with newly evolved 6 scene SR AUTO (Scene Recognition Auto) and Face Detection, scenes and faces can be captured and optimized at its best with this detection functions.Scene Recognition AutoFramed scenes are automatically detected and selected into appropriate camera settings: Portrait, Landscape, Night, Macro, Night Portrait, and Backlit Portrait.Red-eye removalRed-Eye Removal automatically detects and corrects flash reflection for a perfect end result.The J28 makes it easy to remove red-eyeHigh sensitivity: ISO 3200ISO3200 sensitivity ensures blur-free photos, even in low light or with rapidly moving subjects. It also lets you shoot without the flash, for attractive, natural-looking pictures that preserve the atmosphere and colors of the scene.Picture Stabilization/Anti-blur ModesPicture Stabilization Mode and Anti-blur Mode automatically correct for camera shake and subject blur, helping you to capture fleeting moments in crisp stop-action with background detail intact.Picture Stabilization in actionSlim 17.4mm bodyThe FinePix J28 is sleek and slim, fitting into your purse or pocket so you can take it with you everywhere.2.7-inch LCDThe large, bright LCD display makes it easy to compose great photos. And sharing pictures is a pleasure, thanks to a high-impact 230,000-dot resolution.Versatile shooting modesAn extensive selection of pre-programmed shooting modes ensures great photos in various conditions, eliminating the need to fuss with camera settings while delivering optimum results.On-screen shooting guideFeaturing explanations for each shooting mode, scene position, and control setting, the easy-to-read icon-based interface is designed to take the guesswork out of selecting camera settings.Micro thumbnail viewUp to 100 pictures can be viewed at a time in a 10x10 array of micro thumbnails. Convenient for smooth and comfortable playback.SD/SDHC memory card slotThe versatile card slot is compatible with SD and high-capacity Secure Digital (SDHC) memory cards. Memory card not included.", "title": "Fujifilm FinePix J28 10.2MP Digital Camera with 3x Optical Zoom", "price": 9.99, "salesRank": {"Camera &amp; Photo": 6511}, "imUrl": "http://ecx.images-amazon.com/images/I/41AvAK1-4CL._SX300_.jpg", "related": {"also_viewed": ["B002HEWA1E", "B00C7NX884", "B00ATM1M92", "B00ATM1MF6", "B00B18L7KC", "B00ATM1M9W", "B0073HSJGU", "B00B5MUJKI", "B00ATM1NBO", "B004J41T7Q", "B000EMWBV0", "B00BEHQKP2", "B00AWYN0BU", "B003VTZE1M"], "buy_after_viewing": ["B003VNKNEQ", "B003P9VMXC", "B003D8O264", "B005HNF01O"]}}