{"asin": "B000KIJ0RG", "description": "This Portable USA 10.4-inch digital picture frame features black matting alongside a black wooden frame. As one of the larger digital frames available, it creates a dramatic addition to any decor. Put together your own perpetual slide shows by simply removing the media card from your camera and inserting it into the frame's card slot to display your images -- no PC is needed. The 10.4-inch diagonal LCD screen is clear and bright, and is ideal for home or commercial use. The card slots accept the most popular media: CF/MS/SDMS//MMC/XD. You can even play MPEG video files and MP3 music. A handy remote control is included for pausing or rotating pictures. You can even use 2 media cards at once. The bright LCD screen delivers a 640 x 480 resolution and can be positioned portrait or landscape. It can also be hung on a wall. No batteries needed, and no monthly subscriptions. Simply plug into your electrical outlet, insert your media card, and enjoy.Portable USA PU-10W 10.4 Inch Digital Picture Frame Highlights10.4-inch viewable screenFifty percent larger viewing area than a 7 inch display gives you even more room to enjoy and show off your favorite pictures to family and friends.  The aspect ratio of the screen is 4:3 -- just like a printed photograph. You won&#x92;t see stretching, cropping or big ugly black borders like the widescreen 16:9 format of some other digital picture frames.High-density screen with wide viewing angleThe very best, 640x480 high-density screen displays your favorite photos with the same rich detail and vibrant colors as high-quality photo prints and the wide viewing angle ensures you the best image whether it&#x92;s up high or off to the side. 128MB of on board memory  The PU-10W offers 128MB of on board super-fast flash memory allowing you to store and show your high-resolution pictures, with additional capacity when you use the two available memory card slots. This product also has a USB slot for easy transfer from a PC.Memory Card SupportThe PU-10W has two memory card slots: One slot accepts Compact Flash I (CF) cards, the second accommodates Memory Stick (MS, MS Duo, MS Pro Duo, MS Pro), secure digital (SD) Card and Multi Media Cards (MMC) and xD card. You can store and show all your photos without the use of a PC.The finest materials and elegant design fit for any decorElegant design and the highest-grade materials include a discreet stand and a black wood frame with rich black matting to enhance the look of all of your photos.  Multimedia capabilities The PU-10W frame also supports many formats of movie files as well as provides stereo speakers for mp3 and wav files. All are easily managed with the click of a button on the remote control.Multiple Viewing ModesSeveral display modes give you the freedom to display your photos one image at a time, in thumbnail mode for quick, easy searches, or to create a slideshow of your favorite photos. Access all these options on the frame or with the included remote control. You can also display your frame in portrait or landscape mode and place it on a table, counter, or hang it on your wall.In the boxOne PU-10W digital picture frame, remote control with batteries, desktop stand, AC power supply, and comprehensive owner&#x92;s manual.About Portable USAAt Portable USA our goal is to give you the best quality, features, and service offered in the industry.  We use only the highest grade screens and components available ensuring you an excellent viewing experience with each and every one of our products. We back all of our products with a full one year warranty (parts AND labor) and live customer support, based here in the United States, to ensure your complete satisfaction with our products.", "title": "Portable USA PU-10W 10.4-Inch Digital Picture Frame", "price": 119.99, "imUrl": "http://ecx.images-amazon.com/images/I/41FgSDouqZL._SX300_.jpg", "related": {"also_viewed": ["B00DYQQSSK", "B008MW6Y12", "B00442VXCO", "B00FWDXZIO", "B00H4ZARFC", "B000VEUU5U", "B005GXFH5O", "B00J3TWQ8I", "B008R3875C", "B0051RMWR6", "B0056HNTAU", "B008FC8FJ8"], "buy_after_viewing": ["B00DYQQSSK", "B008MW6Y12", "B009A13IB8", "B002IT3242"]}, "categories": [["Electronics", "Camera & Photo", "Lighting & Studio", "Photo Studio", "Storage & Presentation Materials", "Digital Picture Frames"]]}