{"asin": "B005IHAIJ8", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Compact System Cameras"]], "description": "NEX-5NThe performance of a DSLR, in about half the size and weight. The NEX-5N is the interchangeable lens camera that fits in your pocket. Enjoy Full HD 1080/60p or 24p movies, astounding low-light pictures, continuous shooting up to 10 fps, incredible panorama shots, and 3.0-inch tiltable Live View touch screen LCD.DSLR quality in your pocketThis is the world's smallest interchangeable lens digital still camera using a large APS-C size sensor (as of Aug 2011). The removal of the conventional mirror box and viewfinder results in a camera body that is about half the size and weight of a standard DSLR camera.Up to 10 fps shootingCapture the decisive moment in sports and get the ideal baby photo. Up to 10 fps continuous shooting at full 16.1 MP resolution. Standard continuous shooting speeds vary based upon shooting conditions and memory card speeds.16.1 MP Exmor APS HD CMOS image sensorYou get incredible detail and gorgeous enlargements. Thanks to the APS-C sensor size and Sony Exmor APS HD CMOS technology, the camera achieves high resolution with no penalty in low-light sensitivity or sensor noise.BIONZ image processorThe brain of the camera is a refined version of Sony's BIONZ image processor. Its chroma noise reduction delivers high-resolution, low-noise photos even at ISO 25600 sensitivity. Also enables fast processing for up to 10 fps continuous shooting of data-intensive 16.1 megapixel images, 2D/3D Sweep Panorama modes and 6 image layering.Full HD movie shooting 60p/24pRecord Full HD 1920x1080 video in a variety of frame rates from 60p for super smooth action to 24p for a more cinematic feel. The NEX-5N utilizes the AVCHD codec, the industry standard for high quality HD video capture, as well as the MP4 codec for easy upload to the web due to it's smaller file size.Photo Creativity TouchThe Photo Creativity interface enables you to easily enjoy the creative expression through direct photographic control in an easy to use interface. Changes can be combined/removed and viewed in real time on the LCD making it a breeze to make adjustments.Tiltable 3.0\" Touch LCDSony's 3.0\" Xtra Fine LCD monitor has 921K dots for superb resolution. The TruBlack screen includes a special resin layer to suppress internal reflections, increasing contrast compared to conventional LCDs. Sunny Weather mode boosts visibility even further in bright sunlight. Tilts down 45&deg; and up 80&deg; to frame high- and low-angle shots that would otherwise be hit-or-miss.Object Tracking AF via Touch LCDObject Tracking AF can lock onto a specified object and maintain focus even as the subject moves. This hassle-free mode allows unpredictable subjects to stay in focus even while zooming. Letting you concentrate on the scene and composition without having to worry about focus. The subject on which to lock focus is easily selected via the touch screen or the center button of the control wheel.World's shortest release time lag (0.02 sec)In photography, shutter lag, or release time, is the delay between triggering the shutter by fully depressing the shutter button and when the photograph is actually recorded. By initiating the exposure electronically instead of with the traditional shutter mechanism, release time on the NEX-5N is reduced to just 20 milliseconds - helping you to capture the decisive moment.Optional XGA OLED viewfinder&nbsp;The optional FDA-EV1S OLED Tru-Finder offers a large, bright and wide-view of the scene. With high resolution 2.395K dot, and unprecedented speed, contrast and color accuracy, the FDA-EV1S provides an extraordinary view.11 Picture Effect modesThere are 11 picture effects modes to choose from: Posterization (Color, B/W), Pop Color, Retro Photo, Partial Color (Red, Green, Blue, Yellow), Soft High-key, High Contrast Monochrome, Toy Camera (Normal, Cool, Warm, Green, Magenta), Soft Focus, HDR Painting, Rich-tone Monochrome, and Miniature. Each is unique and each gives you a new and exciting way to make your images and videos pop.Peaking AF displayThe Peaking AF display makes precise manual focusing much easier by highlighting the edges that are in focus in your choice of three colors ( white, red, or yellow). This is especially helpful during macro or portrait photography where your focal plane can make or break your shot.3D Sweep Panorama ModeCapture vast scenic vistas and 16:9 shots in spectacular 3D. As you sweep across the panorama, the camera records separate right-eye and left-eye images that make landscapes come alive on your 3D television. Records both JPEG and MPO file formats.Sweep Panorama ModeCapture expansive landscapes automatically. Press the shutter, sweep vertically or horizontally. The camera does the rest, continuously shooting images and stitching them together. Up to 23 MP image size. Up to 202 degrees maximum sweep angle (16mm focal length).6-image layeringThe camera leverages the large, APS-C image sensor and captures six images in a fraction of a second. The camera then combines the data from the 6 different images to create a single image. This method is used to control blur in Anti-Motion Blur mode or to get cleaner, sharper nighttime pictures in Hand-held Twilight mode.Auto HDRHigh Dynamic Range (HDR) photography captures more scene contrast than a single exposure can handle by combining the best highlight detail from one shot and the best shadow detail from another for one incredible shot. Until recently, you needed a computer and editing software. Sony builds HDR in. Handles severe backlighting and other high-contrast scenes. Captures in a split second. (Recommended for still subjects.)P/A/S/M operating modesThe NEX-5N offers a full range of controls for video and still shooting from the beginner's iAUTO mode to P/A/S/M: Program, Aperture Priority, Shutter Priority and Manual. On-screen prompts help you refine your skills, build your confidence and exercise greater creative control.Intelligent Auto FocusPre-focuses as you compose the shot, further reducing focusing time to a bare minimum.iAUTO modeUnifies and simplifies Sony intelligent technologies. Takes advantage of Intelligent Scene Recognition, Face Detection technology, and Optical SteadyShot image stabilization without leaving auto mode so you always get the best shot.Dynamic Range Optimizer (DRO)Dynamic Range Optimizer improves results with backlit subjects and recovers details hidden in shadows. Settings include Auto, Level with a choice of five operating levels and Off.Accepts Sony E-mount lensesCompatible with Sony's E-mount series of smaller, lighter lenses designed specifically for a compact interchangeable lens cameras. Opens up a world of creative options.Phase Detect AF for E-mount bodies w/ adapterBoth the LA-EA1 and EA2 adapters (sold separately) allow you to attach A-mount lenses to your E-mount camera. However, the LA-EA2 is the world's first adapter to leverage Sony's exclusive Translucent Mirror Technology to provide super fast and accurate Phase Detection AF as well. The LA-EA2 adapter has a translucent mirror built-in between the two mounts that directs a small portion of the light to the phase detection AF sensor in the bottom of the unit.25-point Auto Focus25 sensors cover a very wide area of the scene, for accurate focusing even when the subject is far from the center of the frame.HDMI outputEnjoy HD movies and stunning still images on a compatible HDTV. The camera includes an HDMI output.Stamina battery power for up to 430 shotsTake up to 430 shots on a single charge with Sony lithium ion Stamina battery power. Sony's InfoLITHIUM battery system enables you to see the percent of power remaining, so you can keep shooting in confidence.;if (typeof amznJQ === \"undefined\") { } else { amznJQ.onReady('JQuery', function() { setTimeout(function() {if(msa.Vowels) { var amzvowels = new msa.Vowels(jQuery,16,[\"ec2.images-amazon.com\",\"ec3.images-amazon.com\", \"ec5.images-amazon.com\"],5,'1ZVYDHCZFWP4ZBY5W4A1', [\"z-ec3.images-amazon.com\", \"z-ak.images-amazon.com\" ], \"images-na.ssl-images-amazon.com\", [\"1820\", \"3320\", \"7470\", \"14730\"], [\"1820B\",\"3320B\",\"7470B\",\"14730B\",\"1\",\"2\",\"3\",\"4\",\"5\",\"6\",\"7\",\"8\",\"9\",\"10\",\"14\",\"15\",\"17\",\"18\",\"19\",\"20\",\"21\",\"22\",\"23\"], 50, 50, 100); amzvowels.initializeAndStart(); }}, 8000)}); }", "title": "Sony NEX-5N 16.1 MP Compact Interchangeable Lens Touchscreen Camera with 18-55mm Lens (Black)", "price": 712.8, "salesRank": {"Camera &amp; Photo": 3849}, "imUrl": "http://ecx.images-amazon.com/images/I/41JkpUxOo6L._SX300_.jpg", "related": {"also_bought": ["B004UAF0O2", "B005IHAIKM", "B002I007EY", "B001KNDWRY", "1133590454", "B003U2YCZE", "B006VPJQFS", "B005KG3KNI", "B004EBZZX8", "B003NRHAH8", "B003MQWN40", "B00004ZCJF", "B005IQGMXU", "B003VNKNF0", "B005N3TPJQ", "B007HST6TY", "B005OUQXD4", "B005K8AUOI", "B004DKVRDM", "B003OBUJIK", "B005D6C14Y", "B0078ZYBP0", "B0049WBZEK", "B004GJ4RPU", "B005NX7HY6", "B004G77W4A", "B003WO7MZC", "B0051GXAYQ", "B005K8AUE8", "B003OBUJGW", "B0037T6OE2", "B003X1FSCS", "B004Q3C98S", "B0042JAGY0", "B006VPKJ04", "B00606N9FG", "B004NE4OKQ", "B002N1WACA", "B004LQ1BXE", "B003Y302CG", "B0037U0UF0", "B00478OG2O", "B003ZLISZU", "B003Q0BPC8", "B0047M5A7K", "B0068NVR14", "B00407YLEU", "B006OAKMBC", "B0054I54JU", "B005K8AUYI", "B0061ZL4CQ", "B00698GLT6", "B0000BZL2Y", "B006Q6PB9W", "B007PCP2OU", "B004U28R86", "B004LQ1NSM", "B00009R970", "1435459180", "B005ODKCH4", "B003XQ6FDE", "B007M54E08", "B00CQF4TH2", "B008IYF3SO", "B0085DI6AK", "B0040RWN0O", "B004LQ1BYS", "B006BGSYXC", "B00004ZC9L", "B005K8AU1Q", "B005IHAIHA", "B003VNKNEQ", "B005Y1SYDU", "B004WIK6KU", "B005IKZU8O", "B003X19WZC", "B003Y2YE3A", "B008XKX0D8", "B0042GFYLI", "B002I05VNG", "B005OBCI32", "B004R739ZA", "B0042UC5BG", "B005UOXCBK", "B001T0HXRS", "B007QOX5AK", "B0096W1PG6", "B005POOH6Y", "B00836H2BI", "B006GTQ71U", "B008OXSDZO", "B004QLHYXU"], "buy_after_viewing": ["B0096W1OKS", "B00B7ID99I", "B00BF9MUBM", "B0049WBZEK"]}}