{"asin": "B00176BDD4", "related": {"also_bought": ["B001AGP6FW", "B000P9ZBFA", "B00013M6NK", "B0073HSJR4", "B001PKEJZQ", "B0021XW3YU", "B001PK8FHE", "B0081IOD1K", "B0011ZCDKS", "B0001EY1GY"], "bought_together": ["B000P9ZBFA"], "buy_after_viewing": ["B001C1X5LW", "B001C1V4OM", "B0039BPG1A", "B003HMPF6M"]}, "title": "Nikon Coolpix P80 10.1MP Digital Camera with 18x Wide Angle Optical Vibration Reduction Zoom (Black)", "price": 348.0, "salesRank": {"Camera &amp; Photo": 8759}, "imUrl": "http://ecx.images-amazon.com/images/I/51L9FwmV6CL._SX300_.jpg", "brand": "Nikon", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The new Coolpix P80 combines 10.1 megapixels and an incredible 18x (27mm-486mm) optical Zoom-Nikkor lens for exceptional image quality and stunning prints as large as 20 x 30 inches. Optical VR Image Stabilization minimizes the effect of camera shake, for sharper images. The incredible, bright 2.7-inch high-resolution LCD and electronic viewfinder make composing and sharing pictures easier than ever. Program, Aperture Priority, Shutter Priority and Manual Exposure Modes give you personal control over camera operation. A new Sports Continuous Mode lets you capture up to 30 frames at up to an amazing 13 FPS!Coolpix P80 Highlights10.1 Megapixels for stunning prints as large as 20 x 30 inchesPlenty of sharp resolution to capture the finest details, crop creatively and produce incredible enlargements.Amazing 18x Optical Wide-Angle Zoom-Nikkor LensThis lens is built on Nikon's proud heritage of producing precision camera optics that deliver superb color and razor-sharp results. This amazing lens offers unbeatable compositional freedom with it's wide-angle (27mm) to super-telephoto coverage (486mm). You can photograph sweeping landscapes and zoom in to capture the action on the baseball or soccer field!New EXPEED image processorEnsures high-quality pictures with stunning color and sharpness. Nikon's comprehensive digital imaging processing concept incorporates the know-how and the technologies acquired throughout our long history of photographic and digital imaging development. EXPEED is customer-tuned for Coolpix and renders natual-looking pictures of incredible quality and quick response so you won't miss that special moment.Bright 2.7-inch LCD and electronic viewfinderMakes it easy to compose and share your pictures with friends and family. The incorporation of the high-resolution electronic viewfinder enables you to see through the lens in any type of lighting condition.Optical Vibration Reduction image stabilizationCompensates for camera shake to prevent blur and produce clearer, sharper results in lower light or unsteady conditions. In addition, the benefits of Nikon's VR system extends to faster framing on the monitor as well as smoother action when using the movie mode.Program, Shutter-Priority, Aperture-Priority and Manual Exposure modesGain ultimate control over your pictures. The D-SLR-type mode dial on the top of the camera provides quick access to this greater personal and creative control. Now, you can adjust the camera's settings for any type of lighting conditions and get as creative as you want.Auto Adjusts up to ISO 6400 and lets you keep shooting, even in lower lightWith a light sensitivity range of up to ISO 6400 in manual control, this creates new opportunities to take sharper, more natural-looking photos in lower light conditions. ISO 3200 and ISO 6400 settings are available at 3MP or lower resolution.New Sports Continuous Scene ModeFor shooting up to 13fps, up to 30 frames, when you set the resolution to 3MP or lower. These high-speed capture settings help you stay ahead of the action, whether it's a swift golf or baseball swing, or the speed of the soccer field. At 13fps, you'll capture all the action.Nikon Image InnovationsInclude: In-Camera Red-Eye Fix, that automatically looks for and fixes most instances of red-eye; Face Priority AF, Nikon's face-finding technology that can quickly find and focus on up to 12 faces in a group portrait; and D-Lighting which rescues pictures that are too dark for printing by enhancing the underexposed areas of the picture while not touching the properly exposed areas.High-quality TV movies with soundNow just a press of a button away with your Coolpix P80. Record TV-quality movies with sound whose duration is only limited by the space available on your SD/SDHC card. Connect your camera to your TV, and you have instant home movies."}