{"asin": "B000PS2XDO", "description": "From the makers ofFar Cry,Crysisoffers FPS fans the best-looking, most highly-evolving gameplay, requiring the player to use adaptive tactics and total customization of weapons and armor to survive in dynamic, hostile environments including Zero-G.Earth, 2019. A team of US scientists makes a frightening discovery on an island in the South China Sea. All contact with the team is lost when the North Korean Government quickly seals off the area. The United States responds by dispatching an elite team of Delta Force Operators to recon the situation. As tension rises between the two nations, a massive alien ship reveals itself in the middle of the island. The ship generates an immense force sphere that freezes a vast portion of the island and drastically alters the global weather system. Now the US and North Korea must join forces to battle the alien menace. With hope rapidly fading, you must fight epic battles through tropical jungle, frozen landscapes, and finally into the heart of the alien ship itself for the ultimate Zero G showdown.FEATURESA unique three-act structure forces the player to use real-time armor and weapons customization to adapt constantly to an ever-changing world.Encounter a frightening and totally original alien species&#151;they use their senses intelligently and work together to present the most challenging enemy yet in an FPS.Control of a variety of land, sea, and air vehicles including trucks, tanks, boats, and helicopters.Explore a living, dynamic world where earthquakes, breaking ice, landslides, and tornados pose an ever-present threat.32-player multiplayer with real-time armor and weapons customization, plus an all-new multiplayer mode that combines player modification and tactical objectives.Emergent gameplay means that in-game actions affect future outcomes and give each player a unique experience.Highly robust and easy-to-use mod toolset allows players to create their own expansive levels for both multiplayer and single-player modes.The CryENGINE 2 engine delivers the most realistic environments, spectacular special effects, physics game engine, lighting system, and enemy Al.", "price": 9.45, "imUrl": "http://ecx.images-amazon.com/images/I/51%2BhrLWJJHL._SY300_.jpg", "related": {"also_bought": ["B002BS47YE", "B0000A1VER", "B001ATHKVC", "B0050SZ0SY", "B0019C4MU2", "B000MK694E", "B002I0HKRQ", "B000X9FV5M", "B0013RC1W4", "B002NIP2SM", "B003GSZAOY", "B003ZULWQI", "B000NV8F58", "B0012LGHZI", "B0001X5YN4", "B003JVF728", "B002ZJPYHS", "B003TIVSM4", "B003P9C6EQ", "B002V14VOC", "B00503EAG2", "B002I0HJZO", "B001M4YZ90", "B005G4CXPK", "B001UWGDPS", "B000PS2XES", "B001VJ4DHK", "B002BWONOY", "B000R2XJJK", "B001AWBYRA", "B0050SZ836", "B007BYWJ8Y", "B00009TW6R", "B001AH8YSW", "B0046U6DWO", "B002I0HJ68", "B001CLYL1K", "B002SRP9VI", "B000GPVUUS", "B002I0JA7E", "B0016BVYA2", "B0007GBBHI", "B002BXKJA0", "B0065NP39E", "B00309U0M6", "B0036CCNAO"], "buy_after_viewing": ["B002BS47YE", "B0050SZ0SY", "B002BSA1MQ", "B0050SY77E"]}, "salesRank": {"Video Games": 19853}, "categories": [["Video Games", "PC", "Games"]]}