{"asin": "B000NV8F58", "description": "The entertainment phenomenon that conquered the digital universe is once again out to save the planet as the award-winning, best-sellingHalo 2is coming to theWindows Vistaplatform. Optimized for the advanced gaming features in Windows Vista,Halo 2promises to revolutionize the first-person shooter experience for Windows gamers, as it did for consoles. With its classic story, enhanced visual presentation, multiplayer excitement and all-new Map Editor,Halo 2for Windows Vista offers more game customization and new content than ever before.Windows Vista gamers will be able to experience the epic story ofHalo 2as Master Chief delves further into the mystery of the Covenant in the aftermath of Halo&#146;s destruction. What he discovers will soon threaten the fate not only of Earth, but of the Universe itself.Features:Epic Narrative: The saga continues withHalo 2, the international award-winning sequel to the highly successful and critically acclaimedHalo: Combat Evolved. In this sequel, the battle comes to Earth, and Master Chief, a genetically enhanced super soldier, is the only thing standing between the relentless alien Covenant and the destruction of all humankind.Exciting Single-Player Gameplay: Experience first hand the epic struggle between Master Chief and the Covenant armada. Brandish dual-wield weapons Covenant arms and pilot human and non-human vehicles and aircraft to battle intelligent AI alien enemies.Unmatched Online Gaming:Halo 2for Windows Vista will tap into the power of Live Anywhere, a service similar to Xbox Live, to deliver online matchmaking for PC gamers. The service will enable Windows Vista gamers all over the globe to connect via their PCs and play on an innovative and competitive online forum.New Multiplayer Map Editor: The game will also feature the all-new new Map Editor, guaranteeing additional new, fan-generated content in the future. TheHalo 2community can now tap their endless creative potential to develop an unlimited number of user-created multiplayer levels.Complete Community Freedom:Halo 2for Windows Vista offers gamers the freedom to host their own dedicated servers for maximum multiplayer action.Superior Presentation and Cinematic Excellence: Bring the vast, imaginative world ofHalo 2to life on the Windows Vista platform through higher-resolution textures and improved lighting effects. Experience the unmatched cinematic quality ofHalo 2through the power of Windows Vista.Unprecedented Pedigree: TheHalofranchise is one of the best selling and monumental entertainment experiences in history with more than 14.5 million units sold worldwide, more than 18 Game-of-the-Year awards, 750 million hours and 500 million matches logged over Xbox Live.Halo 2was also one of the most successful entertainment launches of all time &#150; including books, films, graphic novels, games and music.Halo 2for Windows Vista brings this incredible experience to Windows Vista gamers everywhere.", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/51NMqzZggfL._SY300_.jpg", "related": {"also_bought": ["B00009TW6R", "B000VBFW7E", "B00KSQHX1K", "B005G4CXPK", "B0050SYY5E", "B004QRKWLA", "B000FRU0NU", "B000930DA0", "B002BS47YE", "B002BXKJA0", "B000B63RSA", "B004CD9X2W", "B003JVF728", "B0030MOXA8", "B0050SZ0SY", "B007H2V9W2", "B003O2182A", "B001HWB68K", "0765323958", "B00016OYTG", "B0079NGSDO", "B0034JKYO6", "B00604IFBQ", "B004QRKWKQ", "B000922E0S", "0765323982", "B001BNFQKO", "B001E6DG6Y", "1616553251", "0765333074", "B003GSZAOY", "B001CC8UBG", "B005BLAJ68", "B003ZSN600", "B004FUGKSW", "B0042WXQ62", "B000VVEMXY", "B006ZQ85YG", "B00269QLJ2", "B00365R2AM", "B003Q55Y5C", "B000063EKR", "B0054U53O4", "B002I0HJZO", "B002I0JJAW", "B000VV9T7S", "B004FYKWZU", "B000SOYG8U", "B002EE1PBS", "B0014UYI6W", "B002NINFHM", "B003O6CB6S", "B0016BVYAM", "B003R76AIE", "B001AWIP0Y", "B00GV8QTPU", "0765364670", "B001E8QA2E", "B002BSA20M", "B001Q96ZNU", "B0027EV9CA", "B00JVWRNY4", "B0014UGK4U", "B000B7Q4CA", "B000B7Q4BQ", "B00CX9T598", "B00DC9T2J6", "B00BMFIXZG", "B000HZFCT2", "0765323974", "B0046Y1622", "B004A7FYX2", "B002KJ9XE8", "0785165703", "B002QSQ5MQ", "B0096PLB9O", "B00CPKUV9I", "B00001IVRD", "B001D7798A", "B000UB3B3W", "B00B98HDNO", "B00001LDCK", "B0050SZ980", "B0050SYX8W", "B005EZ5GQO", "B002SKDIKE", "B008Q7HUR0", "B000WCCURW", "B002CZ38KA", "B00E9I1FPI", "1465411593", "B005C2D2H4", "B000EPP6UA", "B00005LABK", "B00DB9JYFY", "B00005MDZY"], "bought_together": ["B00009TW6R", "B004QRKWLA"], "buy_after_viewing": ["B00009TW6R", "B0050SYY5E", "B004QRKWLA", "B000FRU0NU"]}, "salesRank": {"Video Games": 2912}, "categories": [["Video Games", "PC", "Games"]]}