{"asin": "B0050SYOOA", "description": "DOCTYPE html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd\"Untitled Documentfunction MM_openBrWindow(theURL,winName,features) { //v2.0   window.open(theURL,winName,features); }Product OverviewFrom the critically acclaimed director, Hideo Kojima, Metal Gear   Solid HD Collection offers a handful of the most popular Metal Gear   Solid titles from    the past in true HD for the first time ever. Featuring three complete   games, Metal Gear Solid 2: Sons of Liberty, Metal Gear Solid: Snake   Eater    and Metal Gear Solid: Peace Walker, the HD Collection offers old and   new fans a chance to experience the epic game play, design and   storytelling of the    MGS franchise.The &quot;Metal Gear Solid (MGS)&quot; series is the seminal work of Hideo   Kojima, Japan's master game creator, and the progenitor of the stealth   action game    genre. The series has become a global phenomenon, with over 27 million   copies sold worldwide. The player controls a secret agent from an elite    special forces unit who is sent on solo sneaking missions through   enemy installations, vast jungles, and sometimes even the thick of   battle.    Alone and surrounded by the enemy, even a special forces agent will   find it tough to come out alive. But that is the secret behind the   series'    popularity-the cerebral challenge of figuring out how to avoid combat,   and the thrill of sneaking through enemy territory undetected.The MGS series is also known for its storyline, which blends   seamlessly with the gameplay. The scenarios are based on extensive   research and    incorporate the drama of actual developments in society.These elements have made MGS what it is today: a mature work of   entertainment that transcends national borders and the confines of video   games, and one    of the leading products of the Japanese content business.FeaturesThe MGS franchise is one of the most important game series of all time with multi-million unit sales globally, and countless awards honoring the vision of Hideo Kojima, a true video game icon.First time for these groundbreaking MGS titles to be in full High-Definition with revamped graphics, menu systems and much more.Play as a new fan or a veteran within Metal Gear Solid universe and experience some of the greatest gaming design, storytelling and presentation of all-timeThree full Metal Gear Solid games featuring endless hours of gameplay within single-player campaignOnline multiplayer modes featured in MGS Peace Walker for even greater replay and value to extend the experience further.&nbsp;Go online in multiplayer modes as well as Co-Op mode.Enjoy smooth, precise controls with right analog stick formatting and Force FeedbackSee the game like you never have with the frame rate boosted to 60 fps and graphics enhanced to 720pComplete your missions and enjoy a new way to play Metal Gear Solid: Peace Walker with the Trophies and Achievements mode&nbsp;&nbsp;&nbsp;", "price": 79.98, "imUrl": "http://ecx.images-amazon.com/images/I/51Xi7AF94nL._SY300_.jpg", "related": {"also_bought": ["B002BRZ8FW", "B00GJSUXLS", "B005VBVQAG", "B00001X50M", "B007IFMFYE", "B005EZ5GNW", "B002I0JA7E", "B00AA4FDTY", "B0000A09EN", "B00HD4R5WC", "B00BU3WWOS", "B003O6EB70", "B004NRN5DU", "B007UM59AC", "B001CMIUYS", "B001YI0Z2U", "B00EVWZHLK", "B00F4GSAYI", "B0050SYBL6", "B003PHLTDC", "B005C2D2MO", "B000FQ2D5E", "B00B59L9VO", "B00EVWYF0E", "B004FSE52C", "B0050SYV70", "B0086V5V9A", "B005N4HBE6", "B0076ZPYPI", "B0050SY77E", "B001REZLY8", "B0022TNO7S", "B0050SY9WC", "B000SQ5LQ4", "B002Z7BE1U", "B00KSQHX1K", "B002V16T0Q", "B001IVPVVS", "B00319DX4W", "B003O6EBRA", "B00BMFIXT2", "B0056WJA30", "B002I0HBZW", "B008LW4SBQ", "B003C1I0CO", "B0044SA70M", "B0050SWVIQ", "B002PJCKUC", "B002I0H79C", "B00320JDWG", "B007SRM5MO", "B006IOAHTQ", "B00DBCAT3W", "B002I0J9M0", "B0050SYK44", "B005GM3Y5U", "B008XMSRKC", "B0050SYILE", "B004FUL9YW", "B00BAWXDJM", "B002GPPPS4", "B00ERDGMT4", "B002I0H2AG", "B000P297E8", "B008AEE02M", "B00309U0M6", "B00C71034I", "B00DNGQQW4", "B0050SY4DG", "B0050SYY5E", "B000R0SR9E", "B000R0PLK2", "B000XJNTPG", "B003O6HGHM", "B00B59MXDM", "B004HYK956", "B006GHA8EE", "B000XJO7A2", "B002I0EMUO", "B008H0CMKG", "B003GSZ9ZE", "B004FYEZMQ", "B0054INKZK", "B006ZTHGCK", "B00F6YD26Y", "B00D7NQP9M", "B003H0CC2O", "B00DFT92EI", "B005J5K9EI", "B0043QSR5C", "B002Q21X7Y", "B000P46NMK", "B003O6G6G4", "B0050SYLRK", "B000FRU0NU", "B000X1PE16", "B00354NAYG", "B005C7R8I8", "B00A8306C6", "B00BRQN2EM"], "bought_together": ["B002BRZ8FW", "B00GJSUXLS"], "buy_after_viewing": ["B00GJSUXLS", "B002BRZ8FW", "B00BMFIXT2", "B0086V5V9A"]}, "salesRank": {"Video Games": 3880}, "categories": [["Video Games", "Xbox 360", "Games"]]}