{"asin": "B00006F2ZQ", "description": "Metal Gear Solid 2: Substanceis the PS2 espionage action gameMetal Gear Solid 2: Sons of Libertywith new playable characters, new VR missions, and a few twists. More than 350 new and moderately interesting VR missions fill in some of the gaps in the original game's story. There are also five separate \"Snake Stories\" that act as new missions. These take place apart from the main story, making them feel less like an expansion to the sprawling events inSons of Libertyand more like an unconnected romp designed to pad the original game. Unfortunately, the \"Snake Stories\" lack the thrill, tension, and exposition that madeSons of Libertyso special.The \"substance\" is nothing more or less than a collection of disconnected additions to the core gameSons of Liberty, which remains unchanged from its original release: you play as Solid Snake in stealthy espionage/assault missions, infiltrating the lairs of bad guys to take down nuclear-powered bipedal creations called Metal Gears. Snake has all kinds of tricks up his sleeves: high tech weapons, the ability to sneak around undetected--he can even flip over the side of a railing to hide (a \"Grip Meter\" counts down, increasing the tension and making you pray the enemy walks away). Both a boon and a detriment to the game is its reliance on cinematic scenes to further the convoluted plot. They're well-rendered and professionally done, but you'll seemingly find yourself spending more time watching the game than playing it.Substanceis worthwhile for anyone who doesn't already ownSons of Liberty. That goes double for Xbox and GameCube fans, because the game looks much better on those consoles than it did on PS2. For those who've already played the original, this reissue just doesn't add enough, pardon me, substance, to merit purchasing it again.--Bob AndrewsPros:New modes and missionsGraphics improvements on Xbox and GameCubeCons:New content too sparse for players who already have the original game.", "price": 14.99, "imUrl": "http://ecx.images-amazon.com/images/I/51YWPYEWR5L._SY300_.jpg", "related": {"also_bought": ["B00005NZ1G", "B00001X50M", "B00006JZQZ", "B00GJSUXLS", "B00008KTNW", "B00005ML10", "B001ELWMHI", "B00008J7NZ", "B0002RQ3ES", "B00019HNN2", "B00005RKO7", "B000AOEV6A", "B000BXKA38", "B0009Z3IV4", "B00008H2IU", "B0001UEHP8", "B000B2YR74", "B004AGYHUE", "B0000AJMPK", "B000CBZPDO", "B0000C4M23", "B0002CHIZ6", "B0009UC68U", "B0001KUE7S", "B00009ZVHR", "B000069BCN", "B000ZK9QD2", "B000FRS9II", "B0000A09EN", "B000E61G4O", "B000AX21VI", "B0009Z3KAI", "B00006IJIS", "B0009Z3HZQ", "B000067DPM", "B000TG530M", "B0002SQ0BS", "B000HCQK0A", "B00069BV5I", "B0009JPV8I", "B000031KJT", "B00006LU9C", "B0000DJX7I", "B0002HDT0O", "B00005V5MZ", "B0009351RK", "B0009VRSJQ", "B00009ZVHU", "B00309U0M6", "B0006SST9U", "B0050SYOOA", "B0007SL202", "B00005RCQ5", "B0000A92KZ", "B000TI836G", "B0001I9YFS", "B00005V6BJ", "B0007P8FN2", "B00019AZAK", "B00007UHEQ", "B0002A2S26", "B00009X3V0", "B00006FDLP", "B0009XSMNA", "B000FRVCAA", "B00006IJIW", "B000F2JUOK", "B00004Y57G", "B0000664JF", "B003XRLI1M", "B002BRZ8FW", "B0002VYPEE", "B001I020CW", "B0019SY1D4", "B0000C6FJ3", "B001JKTC9A", "B00006LELH", "B002BS47TE", "B001JFTDLM", "B0006I5I58", "B00005Q8M4", "B00000K2X5", "B000FRVAD4", "B0008JILX6", "B0001ADAMO", "B0050SY4DG", "B0009N1KD4", "B0002ILS10", "B002BSA20M", "B00008H2IS", "B000G82DDS", "B00005YDNZ", "B00001YVBL", "B0001AVSH8", "B007FQUEZ8", "B000G82KU4", "B000CC3IEQ", "B00007E1OA", "B000C427NM", "B00006LU9L"], "bought_together": ["B00008J7NZ"], "buy_after_viewing": ["B0050SYOOA", "B005PSTTFE", "B00005ML10", "B00001X50M"]}, "salesRank": {"Video Games": 22088}, "categories": [["Video Games", "More Systems", "Xbox", "Games"]]}