{"asin": "B0046HAW7Y", "description": "GeForce your PC with the EVGA GT 430 and get the ultimate performance upgrade. Tap into the horsepower of the GPU for a visually-charged boost on your favorite applications. Edit your photos and HD videos and push the limits of your web experience with a new generation of GPU-accelerated browsers. Level-up your game with the next-generation gaming architecture built from the ground up for DirectX 11. Take the latest 3D movies home with Blu-ray 3D and GeForce. All this and more at an excellent value. The EVGA GT 430 features 96 CUDA Cores, a high speed DDR3 memory interface with 1024MB onboard and full DirectX 11 support providing breathtaking image quality. NVIDIA PhysX and CUDA technologies power realistic effects for an interactive gaming experience. Specifications include 700 MHz core clock, 1024MB (1GB) of DDR3 memory with a 1400 MHz memory clock and 22.4 GB/second memory bandwidth, 128 bit memory bit width, 1400 MHz Shader Clock, 96 CUDA cores, and PCI Express 2.0 compatibility. Additional features include Microsoft DirectX 11 Support, NVIDIA PhysX Technology, Blu-Ray 3D Support, Hardware Video Decode Acceleration, NVIDIA CUDA technology with CUDA C/C++, DirectCompute 5.0, and OpenCL support, PCI-Express 2.0 support, OpenGL 4.0 support, Dual Link HDCP capability, TrueHD and DTS-HD Audio Bitstreaming Support and Microsoft Windows XP/Vista/7 support. Connections are HDMI 1.4a and Dual-Link DVI-I. Package includes the EVGA Driver/software disc with EVGA Precision Tuning utility and a limited 2 year warranty if registered within 30 days at www.evga.com.", "title": "Evga GeForce GT 430 1024 MB DDR3 PCI Express 2.0 DVI/HDMI/VGA Graphics Card, 01G-P3-1430-LR", "price": 32.99, "imUrl": "http://ecx.images-amazon.com/images/I/51q52RCCJKL._SY300_.jpg", "related": {"also_bought": ["B001G0WPLK", "B002G1YPHK", "B003O8J11E", "B004RFBIUU", "B0056RCS8Y", "B002SRQ214", "B00461LT6S", "B004CRSM4I", "B003ZDJ42O", "B0057FRTPW", "B00461G3MS", "B001EYV690", "B002UOR17Y", "B004EBUXHQ", "B004W2T2UQ", "B0033Z2BAQ", "B0049MPQA4", "B0036Q7MV0", "B004A2RKB6", "B004EBUXIA", "B004DDI0IE", "B004PQBT8C", "B004S5CCP4", "B005UBNKWO", "B000OGX5AM", "B004QBUL1C", "B006B7R9PU", "B004Q0PT3I", "B007MKGF82", "B007SZ0E1K", "B0088PUEPK", "B0011A4UZE", "B0009JZSKO", "B005T3GRN2"], "buy_after_viewing": ["B0049MPQA4", "B00847TOLC", "B004X8EO6Q", "B008Y8PON8"]}, "categories": [["Electronics", "Computers & Accessories", "Computer Components", "Graphics Cards"]]}