{"asin": "B001UE8LRY", "description": "The perfect wireless solution for home, school, and business, the AirPort Extreme Base Station blankets your space with a blazing-fast, secure wireless network opening up a world of possibilities for home entertainment, backups, printing, and more. This updated version of the AirPort Extreme now operates in the 2.4 GHz and 5 GHz bands simultaneously to ensure top performance for all your devices, and it provides a new Guest Networking option for easy Internet sharing. It also enables you to share your entire wireless network with up to 50 users at the same time as well as turn a USB hard drive into a shared drive that's accessible wirelessly on your network and now over the Internet.New FeaturesSome Wi-Fi devices use the 2.4GHz wireless band, including iPhone, iPod touch, and devices using 802.11b/g. Other devices can use either 2.4 GHz or the higher-speed 5 GHz band, such as the latest 802.11n-based Mac computers and Apple TV. Instead of choosing one of the bands, AirPort Extreme now operates simultaneously on both bands, and your multiband devices automatically use the best available band. This means all your Wi-Fi devices get the fastest possible wireless performance and the best possible range.And with this updated Airport Extreme, it's easier than ever to allow guests to use your Internet connection without sharing your password or giving them access to the rest of your network. Simply enable the new Guest Networking feature using the AirPort Utility application and create a separate Wi-Fi network just for your friends. You can set up this guest network with a different password or with none at all. Your primary network--including your printer, attached drives, or other devices--remains secure.CompatibilityAirPort Extreme works seamlessly and wirelessly with all your Wi-Fi devices. In fact, it's an incredibly easy way for up to 50 users to share a single broadband Internet connection, USB printer, and external hard drive without messy cables. And you don't have to worry about a difficult network setup. AirPort Extreme uses the Bonjour technology in Mac OS X to allow AirPort-equipped Mac computers running Mac OS X to find each other with no effort on your part--they discover each other just by virtue of being connected to the network.Computers are only part of the wireless story. If you're an Apple TV owner, you can easily integrate it into your AirPort Extreme network and enjoy the fastest possible connection for syncing with your computer's iTunes library and streaming to your widescreen TV. And if you use an iPhone or an iPod touch, they'll connect to your AirPort Extreme network to let you surf the web and more. iPhone automatically switches from the cellular network to your Wi-Fi network as soon as you walk in the front door of your home.AirPort Extreme works effortlessly with any computer that uses Wi-Fi standards, whether it's a Mac or whether it's a Dell, HP, IBM, or any other Windows-based PC. That's because AirPort Extreme is based on a draft 802.11n specification and is compatible with the earlier 802.11a, 802.11b, and 802.11g specifications.Hard Drive SharingAirPort Extreme can turn your external USB hard drive into a drive you can share with all the users on your network and access securely over the Internet. This feature--AirPort Disk--is a simple and convenient way to share files among everyone in your family, office, or class. Just connect the external hard drive to the USB port on the back of your AirPort Extreme and all the documents, videos, photos, and other files on the drive instantly become available to anyone on the secure network, Mac and PC users alike.If you're away from home and need a file on the hard drive connected to your AirPort Extreme back at home, you can now access all the files on your shared drive over the Internet. Simply register your AirPort Extreme with a MobileMe account (subscription required), and your drive appears in your Finder sidebar just like any other attached drive.What if you'd like to exchange files over your wireless network and still have access to a wireless printer? Easy. Just connect a USB hub to AirPort Extreme and attach your devices to the hub. Share both a printer and a hard drive, multiple printers, multiple hard drives, or a combination.Features and SpecificationsCompatible with Wi-Fi Certified 802.11a, 802.11b, 802.11g, or 802.11n enabled Mac computers, iPhone, iPod touch, and Windows-based PCsFrequency bands: 2.4 GHz and 5 GHz simultaneouslyOne Gigabit Ethernet WAN port for connecting a DSL or cable modemThree Gigabit Ethernet LAN ports for connecting computers or network devicesUSB 2.0 port for connecting a USB printer or USB external hard driveSecurity: Wi-Fi Protected Access (WPA/WPA2); Wireless security (WEP) configurable for 40-bit and 128-bit encryption; MAC address filtering; NAT firewallWhat's in the BoxAirport Extreme Base Station; AirPort Utility for Mac and Windows; AirPort Disk Utility for Mac OS X v10.4 Tiger and Windows; 802.11n Enabler for Mac OS X v10.4 Tiger; Bonjour for Windows; power supply with cord; printed and electronic documentation", "title": "Apple AirPort Extreme Dual-band Base Station MB763LL/A [OLD VERSION]", "price": 97.93, "imUrl": "http://ecx.images-amazon.com/images/I/21NkQzoPyfL._SX300_.jpg", "related": {"also_viewed": ["B008ALA2RC", "B000UZCR56", "B002TLTG9E", "B005MQ17S6", "B0002GDIII", "B00FTOXP3Q", "B00DB9WCR6", "B0012JJOQO", "B00IRSDKX6", "B009HC7BL8", "B00DBA1VYU", "B00EYXV65W", "B00AAQ3JE8", "B002TLTGGM", "B00FRMAOIO", "B00CK2CDLK", "B008BEYP26", "B0000899ZB", "B006DEBYWU", "B007KZQM9Q", "B00GPEM9W2", "B0002GDQZI", "B00006662F", "B0085WN7YQ", "B0049YQVHE", "B0098QV038", "B001UI4RTG", "B005S0BYQ6", "B00KCAPAKI", "B003VY83GU", "B00IJYGICI", "B0045HG53K", "B001FWYGJS", "B0085WVQDK", "B00577YF2A", "B005X9XW8K", "B007PTCFFW", "B007KZQM9G", "B00D8BQI5O", "B006QB1RPY", "B00DWFPDNO"], "buy_after_viewing": ["B008ALA2RC", "B00DB9WCR6", "B000UZCR56", "B002TLTG9E"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Input Devices", "Graphics Tablets"]]}