{"asin": "B007ELPQXO", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories"], ["Patio, Lawn & Garden", "Generators & Portable Power", "Generators"]], "description": "The 600w inverter converts DC power stored in 12-Volt batteries or other DC power sources into the AC electrical power that many home appliances and tools need. that is ideal for running home appliances, pumps, and motors. It provides 1600 Watts of peak surge power to get your gear started, and 600 Watts of continuous power to keep it running for your notebook,TV,fan ,refrigeator, games machine, DVD, MD ,light, musical instrument,solar panel and outdoor work. Please make sure that you total reated power usng in this unit is less than 600w.Compact and portable, this inverter is perfect for use at worksites, on boats, or for permanent use in a solar power setup. A power inverter changes the DC power stored in 12-Volt batteries into AC power, which is the same kind of power used in your home.The inverter is attached to one or several batteries, which serve as your power source. The devices that you want to run are then plugged into the outlets on the front of the inverter. An extension cord can be used for devices that are located farther away. Once set up, simply turn on the inverter and then turn on each device.Weighing only 3.5 pounds, this unit is compact, portable and can be easily installed right where you need it. It is equipped with two 110-Volt household electrical outlets, and provides 600-Watts of continuous power with 1600 Watts of surge power capability. It is with numerous safety features to keep you and your gear safe. It comes equipped with an audible overload alarm with LED light, a high-speed cooling fan, and a soft-start system. The unit will automatically shut down in the event of short-circuits, low battery power, DC input voltage overload, output overload, or excessive temperature. And can resume working automatically after these exceptions elimiated.", "title": "BESTEK 600w 12v to 110v inverter power supply 12v battery backup power charger inverter power solor charger battery boat power motor marine inverter power ac supply emergency power pack outdoor unit power source emergency charger power home appliances converters power 12v inverter generator MRI6011U-1", "price": 49.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/51tBKpbkcUL._SY300_.jpg", "related": {"also_bought": ["B00BFCNFRM", "B008D5YG3G", "B00B8L8MD2", "B00BR3KFKE", "B00BCTLIHC", "B00A8TRKJW", "B001VV0318", "B001550DVU", "B0006JO0XI", "B009Z6CW7O", "B00068XCQU", "B000Z0HVHA"], "bought_together": ["B00BFCNFRM"], "buy_after_viewing": ["B004MDXS0U", "B00ATXERNO", "B003R7M4SY", "B000Z0HVHA"]}}