{"asin": "B0009GZSSO", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "From the Manufacturer  Have it all in one ultracompact camera. The canon S2 IS's 5.0 megapixels of imaging power deliver stunning detail and clarity, even to oversized prints and the closest crop-ins. The impressively long 12x optical zoom is a feat of engineering, with Image Stabilizer (IS) technology that eliminates camera shake and a UD lens that provides brilliant color accuracy across the entire zoom range. The 4x digital zoom brings combined zooming power all the way to 48x for superb detail at sporting events, school concerts, and more.The Canon S2 IS's powerful image stabilization compensates for camera shake.Because great shots can happen any timeNow there's no need to interrupt your movie when you see a great shot. With the S2 IS's new MovieSnap feature, you can simply press the shutter to capture a full 5.0-megapixel still image at any time while recording a movie.True motion pictures with high-end optionsWait until you see the difference that 30-frames-per-second VGA continuous movie recording makes in your films. You'll hear the difference, too: the S2 IS is equipped to record in stereo, with a high sampling rate, adjustable microphone level setting, and wind filter option for excellent sound quality. The camera even allows digital zooming and manual focus during movie recording.Advanced imaging technology improves every photoDIGIC II Image ProcessorCanon's DIGIC II Image Processor is designed to improve processing speed and image quality, so the DIGIC II processor provides markedly faster camera startup, autofocus, and playback plus it assures that every image is more colorfully vibrant.iSAPS TechnologyiSAPS Technology is an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the fast DIGIC II Image Processor to improve focus speed and accuracy, as well as exposure and white balance.Fastest performance standardPowerShot S2 IS supports the USB 2.0 Hi-Speed standard, so you'll enjoy the highest possible data transfer speeds when using a USB 2.0 compatible computer. The camera's performance level is high enough to take full advantage of super-high-speed SD memory cards as well.Find just the right angle with the S2 IS's 1.8-inch vari-angle LCD display.See it on the big screenBright and sharp, the camera's power-saving LCD monitor measures a full 1.8 inches with a stunning 115,000 pixel resolution. With it, you can view your scene before and after you shoot it with extraordinary clarity. And when you're shooting at dusk or at night, Night Display function lets you see the display clearly. It brightens the object by reducing the frame rate on the LCD screen.A substantial lineup of available accessoriesPowerShot S2 IS lets you add value and take your photography even further with optional accessories. Wide-angle converter and teleconverter lenses prepare you for capturing any shot perfectly, while a high-power flash doubles your flash range for pro-level illumination.The complete print solutionsCanon Direct Printing Compatibility Chart&#160;Canon Direct Printers", "title": "Canon Powershot S2 IS 5MP Digital Camera with 12x Optical Image Stabilized Zoom", "price": 17.12, "salesRank": {"Camera &amp; Photo": 2182}, "imUrl": "http://ecx.images-amazon.com/images/I/51GXXBZFT8L._SY300_.jpg", "related": {"also_viewed": ["B000EMWBV0", "B000GHVZQ0", "B000Q3043Y", "B000AYJDD6", "B000AYKUUQ", "B00009VT1T", "B001SER44W", "B002LITT3I", "B000V1VG4W", "B002LITT3S", "B000I1ZWRW", "B001G5ZTZO", "B005I6DVC0", "B003ZSHNG8", "B001SER48S", "B005AVLJXQ", "B0007WIC1K", "B0002XQI2E", "B0041RSPR8", "B001OI2LV8", "B0007GIXS8", "B0001G6U5C", "B00EFILPHA", "B009B0MZ1M", "B000069092", "B0009GZAGO", "B005MTMFHU", "B000NOQVQK", "B001PKEJZQ", "B00008O37P", "B0009O6IXA", "B004HO58NY", "B00908BQCY", "B000ENN9BK", "B000EMU888", "B00908BMVE", "B0007QKMQY", "B002IKLJU0", "B0011ZCDKS", "B0011ZK6ZM", "B005I6DVLQ", "B000HATNI8", "B00HQ4W3OE", "B000AYKV4G", "B0034XFG86", "B001EQ4C8U", "B00EFILR6E", "B001QENO7A", "B0007MVHZS", "B0034XIMG4"], "buy_after_viewing": ["B003VNKNF0", "B003VNKNEQ", "B0039BPG1A", "B007JRB0SS"]}}