{"asin": "B007XOQUY6", "description": "Flip, fold and operate. It's as easy as 1-2-3 with KA-01, the ultra-slim microfiber folio case for the new iPad 3 and iPad 2. Perhaps the slimmest iPad case on the market at a mere 4mm thick, KA-01 still manages to provide ample protection for your device. And its unique origami-inspired cover doubles as a stand. KA-01 has attention-grabbing looks and multifunctional utility.Several features set KA-01 apart from other folio cases. It's made from a soft microfiber which resists moisture, acid from fingertips, and stains. This material is great for iPad users looking for an alternative to leather cases, it's easy to spot clean, and its slim profile and feather-light weight mean you never have to settle for another bulky case.Your new iPad 3 as well as iPad 2 fit snugly into KA-01, and with cutouts for the controls, camera lens, charging port, and speaker for either generation, you never have to remove your device. Despite the soft microfiber exterior, KA-01 is plenty sturdy, and will protect against everyday wear and tear and the usual dents and dings. And a magnet inside KA-01 will tell the iPad to go to sleep when the cover is closed for smarter power management.But perhaps KA-01's real claim to fame is its origami-inspired cover. Special folds allow you to intuitively pinch the cover in so that it can support your device as a stand at either a 20-Degree viewing angle or a 70-Degree viewing angle. It's very simple, but very effective. For a fresh alternative to the ordinary when it comes to the new iPad 3 and iPad 2 folio cases, KA-01 is the versatile accessory you've been looking for.", "title": "Ipevo Ultra-Slim Origami Folio Case and Fold-Out Stand for iPad 4 3 and iPad 2 - Honeysuckle (KA-01)", "price": 53.59, "imUrl": "http://ecx.images-amazon.com/images/I/41vASJoM9IL._SY300_.jpg", "related": {"also_viewed": ["B00DR0BCOS"], "buy_after_viewing": ["B00GGWJIO0", "B006R2OH4A", "B004VM0SE6"]}, "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Cases & Sleeves", "Cases"]]}