{"asin": "B001G8M738", "description": "Bejeweled Twist from PopCap is the most ambitious follow-up yet to the Bejeweled franchise of games. The original Bejeweled was the game that launched the \"casual gaming\" craze, with game mechanics that anyone can pick up and enjoy, and now with Bejeweled Twist, PopCap has added more depth and strategy with a twisting maneuver..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Bejeweled Twist's lightning gems result in big scores.View larger.Updated graphics deliver crisp new backgrounds and animations.View larger.Play four different modes: Classic, Challenge, Zen and Blitz.View larger.A New Twist on the Wildly Popular GamePopCap has sold more than 25 million Bejeweled games, with over 350 million copies downloaded, making it one of the most successful game franchises in history. Bejeweled Twist was four years in the making, and brings an exciting spin on the classic gameplay: instead of dragging the jewels around, you rotate them. The goal is still to create a line of three or more identical jewels, and each successive turn in which you do so gives you a multiplier for even more points. A key difference from the older games is that you don't have to make a match with every turn.The graphics have been updated as well, with new backgrounds and animations. The graphics are crisper and more modern while still retaining the fun, colorful look of the old games. The new game exhibits a high level of polish and production values, including nice animations in between levels, fun explosion effects when power-ups are used, and extras like being able to watch an instant replay of high-scoring matches.Four Different Play ModesBejeweled Twist features four different play modes: Classic, Challenge, Zen and Blitz. Classic mode lets you progress through increasingly difficult levels where you try to create jewel chains before a bomb detonates. Challenge mode creates specific tasks for you to complete, such as destroying ten gems in one move. In Blitz mode, you frantically try to accumulate as many points as you can within a certain amount of time. And in Zen mode, you can play a relaxing game without any obstacles or timers.There are various power-ups that can be used for higher scores, such as a lightning gem, which you'll receive by matching five gems at once. The lightning gem then eliminates the entire vertical or horizontal column or row where the gem is located. When a you get consecutive matches to max out the chain meter, you'll receive a fruit gem that destroys all same-colored gems.Like all great puzzle games, you'll be surprised how fast that time flies while playing Bejeweled Twist.System RequirementsMinimumRecommendedOperating SystemPC: Windows XP/VistaCPU1. 2GHz or fasterSoundDirect X 8 compatible sound card and driversDirect X 9. 0c compatible sound card and driversMemory256 MB512+ MBOther RequirementsInternet connection is required to register the game.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51i5mdbadtL._SY300_.jpg", "related": {"also_bought": ["B0006HUH00", "B0047SIUZI", "B001AZSEUW", "B000UQSRMC", "B000UQSRN6", "B003O219ZG", "B001J5QJ0A", "B0032MK90E", "B002KMIE1I", "B000UQSRMM", "B002SQZQ9Y", "B003BKWEHS", "B003LJ6R1I", "B001O3066U", "B00495SS06", "B000UQYA2S", "B003VUKRMC", "B000UQSRRC", "B0016Q00FC", "B0067G55IS", "B0058GMO0A", "B0002T751Q", "B002JVX5V4", "B001QYR7QY", "B000UQSRRM", "B002MFQKSM", "B001ISFKT4", "B001Q24UAM", "B004H0LQO8", "B001H0NPFY", "B004FZ3S4Q", "B00CIVVSIW", "B006R12E1E", "B0028556EU", "B005G2TWT2", "B004IK0M4M", "B002PEPRHA", "B005110Q0C", "B006W41WF0", "B004M5ID9Y", "B004CR0SGI", "B000UQURWA", "B003U3VSG4", "B003SEKO2O", "B004IK0M0G", "B002T6BTGC", "B001231II2", "B005MICTQ8", "B005BLAJ68", "B0012W2MTC", "B0019J2V94", "B000FLYD9I", "B0052U2IEY", "B009X3PBLS", "B004EIJHG2", "B004079BUO", "B00A900EXY", "B0052U2IEO", "B002AUC5ZQ", "B006R12DW4", "B0006GQ7SM", "B006WVR9CI", "B001BSEJ5C", "B0050JNR42", "B000RA778G", "B003RE8DOG", "B00470LIEQ", "B000LBRNDK", "B001J5SFC0", "B009SHV6CC", "B005G2RIIO", "B0049LPV7S", "B005PI17AY", "B00919RM0M", "B00351V9WO", "B002S4BI9I", "B001B5KZE4", "B00AA55K50", "B000APK5LY", "B000B78F72", "B0038IZIBC", "B000UQURVQ", "B000QUXBXM", "B000RA20VU", "B000PYFDC6", "B00B5GZP5S", "B000922DKO", "B001IYR53W", "B0097CUREG"], "bought_together": ["B0047SIUZI", "B0006HUH00"], "buy_after_viewing": ["B0047SIUZI", "B005MICTQ8", "B000UQSRMC", "B001QYR7QY"]}, "salesRank": {"Video Games": 17766}, "categories": [["Video Games", "PC", "Games"]]}