{"asin": "B000021Y5P", "description": "Mortal Kombat, in all its incarnations, has always been about anticipation and mystery - bringing players back time and time again in search of brutal combat, secret moves, and hidden characters. And now in Mortal Kombat Trilogy the entire Mortal Kombat series (and more) is on one disk. Die-hard fans will lose their heads over all-new moves, finishing techniques, and a new secret character - Chameleon. Players won't find any improvement in terms of control, graphics, or sound from the Playstation edition of MK3, but they will find a heck of a lot more game.In addition to the plethora of great-looking backgrounds and digitized characters, Mortal Kombat Trilogy ups the ante in terms of options. Players can do more than simply adjust the level of difficulty and turn off the graphic violence mode; now they can select \"auto\" combos, which make those difficult multi-button attacks much easier to perform. Gone too is the long loading delay from MK3 and UMK3 when Shang Tsung, the morphing character, switches identity. In Mortal Kombat Trilogy, the console loads two additional characters into memory - this means Tsung can now morph without delay. This pre-loading feature gets even faster and deeper when players select characters who are palette swaps. (An example of a palette swap would be the human male ninja character, who takes the form of the blue Sub-Zero, the yellow Scorpion, the green Reptile, and others. In essence this is the same character, but with slightly different attributes.) The new secret character, Chameleon, takes full advantage of palette swapping, and constantly shifts among the human, male ninja character forms. His morphs are ingenious enough, however, that most players will welcome yet another ninja into the fold.While there's little doubt that the Mortal Kombat series is the best 2D fighting-game property ever, there is a bottom line. That is to say, Mortal Kombat Trilogy should be seen as a bonus for loyal fans before Mortal Kombat steps into the 3D arena (in next year's MK4). For these fans, Mortal Kombat Trilogy offers enough added elements to justify purchasing it. However, the Mortal Kombat series does have to move to the next level quickly, or it will become a fatality itself. --Hugh Sterbakov--Copyright &copy;1999 GameSpot Inc. All rights reserved. Reproduction  in whole or in part in any form or medium without express written permission of GameSpot is prohibited. GameSpot and the GameSpot logo are trademarks of GameSpot Inc.--GameSpot Review", "price": 13.47, "imUrl": "http://ecx.images-amazon.com/images/I/51C0Ht8rikL._SX300_.jpg", "related": {"also_bought": ["B000021Y5U", "B000069BD9", "B000K6TOK6", "B00000K2X5", "B001CLG6SG", "B00004TBGT", "B00001X50M", "B00000I1C1", "B000006P0K", "B00000I1C0", "B00004XOWT", "B0009R1T9K", "B000034DMG", "B00000I1BY", "B000034DC6", "B000PWAAAI", "B0045L3SNQ", "B000GPVUQ2", "B001TEYMRI", "B00000DMB6", "B0002B90OE", "B000021Y2F", "B000034DMT", "B00000I1BR", "B00000DMAV", "B000637T7S", "B00000DMAR", "B000006RGS", "B0015MMN6G", "B00000I1BQ", "B00001OWYW", "B00003E4GD", "B0002CHJ8C", "B000029706", "B0015IXKSK", "B00000I1BF", "B000034DCF", "B00005MA97", "B0001Q5SG4", "B00019AZBO", "B00005NOFH", "B00001ZUL7", "B0002TG3Z0", "B00000K1VE", "B00000J9JI", "B00004U5VF", "B000F3AACA", "B00001ZWMV", "B000035XLL", "B00001QHW9", "B00001QED2", "B00002SUM5", "B00004YZAO", "B000038ABO", "B00002SVFM", "B0019LMXAY", "B00004U4R8", "B00000JHPN", "B00000K1VK", "B00002STFP", "B0000296NT", "B00002STFN", "B00004TEXU", "B00000IODY", "B00006LEM1", "B000006OVI", "B000GPXSAS", "B00000I1BZ", "B00002STJN", "B00001QER9", "B00005J536", "B00019HNNC", "B000021Y5J", "B00008G97F", "B000LWHNCK", "B00000K1VA", "B00000K2R4", "0761507329", "B006ZTHFPS", "B00005CF9L", "B00005ME6N", "B00004YRQ9", "B000SEU92W", "B00004XOM1", "B00000K1V2", "B00006FDLP", "1566866278", "B00005NOFJ", "B000035XKJ", "B000038ABK", "B00001QEQL", "B000B69E9G", "B000006RGR", "B000035Y4T"], "buy_after_viewing": ["B001CLG6SG", "B000021Y5U", "B000GPVUQ2", "B000GACEHQ"]}, "salesRank": {"Video Games": 5048}, "categories": [["Video Games", "More Systems", "PlayStation", "Games"]]}