{"asin": "B009N1RV9U", "description": "SHARKK:SHARKK offers consumer accessory solutions across many different categories such as Tablet and phone cases, Keyboards, Batteries, Speakers, Wallets, Cufflinks, Money clips, Collar stays, and various cables. When purchasing a SHARKK product you can expect quality in both the material and performance of the items backed by amazing customer service and support. If at any time you have issues with your item regardless of when or where it was purchased please contact us to get it fixed or replaced.What you get:1 SHARKK Speaker1 Instruction manual1 Carrying bag1 3.5mm AUX and and USB Charging cable1 1 year limited warrantyAdditional Product Details:USB Charging Cable and 3.5mm Cable included to connect your device to the speaker.Can be used with Bluetooth connection or plugged in directly with included AUX chord.Features very loud and clear volume range with amazing bass feature.Frequency Response: 60Hz-18KHz.Output Power: 3.0W.SHARKK speaker can read music off SD cards. Use MP3 file format.Built in battery saving system will allow battery to last 5 hours.Fast and simple Bluetooth connection process. No software installation required.SHARKK Speaker can connect to all iPhones, tablets, Samsung phones, laptops, computers, MP3 players, etcBuilt in Mic allows you to use the speaker for phone calls as well.We offer great 24/7 customer service. Please email us with any questions or concerns.", "title": "SHARKK&reg; Bluetooth Speakers Mini Portable Speaker / Alloy Steel Housing / Powerful Loud and Clear Sound with Bass / Built In Micro SD Card reader / Built in Mic. For Phone Calls / Works With All iPhones / iPhone 5c And 5s / All iPad's / iPad Air And iPad Mini Retina / iTouch and iPod / Nexus / Samsung Glalxy Note And Tab / Samsung Galaxy S4 S3 S2 / And All Phones and MP3 Players. Speaker System Has Built In Rechargeable Battery", "price": 23.99, "imUrl": "http://ecx.images-amazon.com/images/I/41KcMZkGM3L._SY300_.jpg", "related": {"also_bought": ["B00D4CQAS2", "B00DQ7W16U", "B001CQT0X4", "B00HRLS7IM", "B00200K1TS", "B00ES2BQ7M", "B00F8PJ1WK", "B004G7SDES", "B00FUV7OP8", "B00GUXZE6Q", "B00DYQYLQQ", "B00FZ862KY", "B00GG63522", "B003Y6I38I", "B00DR0RBV6", "B009QZH7D8", "B005PMLOPI", "B003TP8HJ4", "B005QRA5IY", "B00FJJ38HY", "B00B1MX9D6", "B0051D3MP6", "B009QZH7BU", "B00KD4748Y", "B00AANQLRI", "B001DNV5CA"], "bought_together": ["B001CQT0X4"], "buy_after_viewing": ["B00DQ7W16U", "B00ES2BQ7M", "B00D4CQAS2", "B009AYLDSU"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}