{"asin": "B001Q6TZ5S", "categories": [["Electronics", "Car & Vehicle Electronics", "Vehicle Electronics Accessories", "Radar Detectors"]], "description": "The XRS 9645 provides total protection and peace of mind with Xtreme Range Superheterodyne Technology, detecting all 15 radar/laser bands with its super-fast lock-on detection circuitry. The unit provides extra detection range and the best possible advance warning to even the fastest of POP mode radar guns. Other features include DigiView Text Display, an 8-point electronic compass, and much more.Total protection and peace of mind.System Ready PromptNotifies the user that the radar detector has correctly completed a self-test and is ready.Spectre I UndetectableProvides complete immunity to Spectre I radar detector-detectors.15-Band DetectionDetects 7 radar, 6 laser and 2 safety signals. Radar signals include X Band, K Band, Ka Superwide, Ku Band, VG-2, Spectre I and Spectre IV+. Laser signals include LTI 20-20, Ultra Lyte, ProLaser, ProLaser III, Stalker LIDAR and Speedlaser. Safety signals include Safety Alert and Strobe Alert.Spectre Alert I/IV+Alerts user when they are under surveillance of Spectre I/IV+ radar detector-detectors.IntelliMute ProRelative speed sensing auto shutdown feature will render your detector undetectable by currently available radar detector-detectors.VG-2 UndetectableProvides complete immunity to VG-2 radar detector-detectors.Ultra PerformanceUltra performance digital radar-laser detector with extra detection range for advance warning.DigiView Data DisplayProvides easily recognizable digital text display.POP Mode Radar Gun DetectionDetects the latest POP Mode Radar Gun (Super-fast Instant-On Mode)UltraBright data display provides easy recognition of band detected by use of band identification icons.View controls, indicators and connections.Click to enlarge.Ku Band DetectionDetects Ku Band Radar Gun currently being used in Europe. Be prepared for future introduction in the U.S.LaserEyeProvides 360-degree detection of laser signals.VG-2 AlertAlerts the user when they are under surveillance of VG-2 radar detector-detectors.Strobe AlertA Cobra exclusive, works with tens of thousands of emergency vehicles currently equipped with traffic light controlling strobe emitters. Provides advance warning of the presence and/or approach of emergency vehicles.Safety AlertWarns drivers of the presence and/or approaching emergency vehicles, railroad crossing, and road hazard locations equipped with Cobra's exclusive Safety Alert transmitters.Auto MuteAutomatically mutes the alert tone for enhanced driver convenience.IntelliMuteRelative-speed-sensing Auto Mute system that virtually elminates false alerts.IntelliShield False Signal Rejection3-Level City Mode offers the best false signal rejection in both urban and rural areas.Digital Signal Strength MeterProvides the driver with relative proximity to the target using 5-level digital signal strength meter.SmartPowerAutomatically shuts off power to the unit when ignition is turned off.City/Highway ModesAllows the user to select operating mode, reducing the frequency of falsing in densely polulated urban areas.Dim ModeAllows the user to dim the radar detector display enhancing night driving visibility.EasySet Programming MenuUser-friendly mode selection/setting with visual guidance.Stay Set Electronic MemoryElectronically remembers radar detector settings for an indefinite period of time even with the power removed.8-Point Electronic CompassAutomatically provides an accurate electronic direction heading.What's in the BoxXRS 9645 Detector Unit, Coiled 12V DC Power Cord, Windshield Mounting Bracker with suction cups, Instruction manual", "title": "Cobra XRS 9645 15 Band Radar/Laser Detector with New DigiView Data Display, Pop Mode Radar Gun Detection Mode and Digital Compass", "price": 99.95, "imUrl": "http://ecx.images-amazon.com/images/I/411c66ix4PL._SY300_.jpg", "brand": "Cobra", "related": {"also_bought": ["B001DSIMAI", "B000FED6NO", "B004AMBW1U", "B0063N82OO", "B002ERZAC0", "B00ANOFPB2", "B00C3UG3LA", "B000BZATW8", "B00BPCLMCM", "B000FED922"], "bought_together": ["B001DSIMAI", "B000FED6NO"], "buy_after_viewing": ["B004RO3QNI", "B004RO3QOM", "B001DSIMAI", "B000FED6NO"]}}