{"asin": "B00009R6N0", "description": "The Bogen-Manfrotto 488RC2 Midi Ball Head answers the needs of the medium format user. It is the same as the 488 but equipped with a 3157N quick-release camera plate with a secondary safety catch. With its solid aluminum construction and phenolic resin ball, this head is also ideal for all 35mm and digital cameras. The 488RC2 features a double-groove for rapid side-to-side movement, and a separate fast-action ratchet lever for 360-degree pan and easy to grip locking knob for +90 to -90-degree tilt movements. Camera attachment is via a 2-inch platform with a 1/4-20-inch male thread, and head to tripod attachment is 3/8-inch female. Optional Plates: 200PL-38, 200 PLARCH-14, 200 PLARCH-38.Features include:Sturdy all-metal construction.The double 90-degree groove (one on each side of the head) means switching from landscape to portrait is convenient however you're set up.The compact, rectangular 200PL quick release plate system fits neatly under small-bodied still cameras up to SLR (even with tele lenses) or small medium format, or under small video cameras or spotting scopes. Its rubber pad gives a good grip without damaging the camera, and its angled sides ensure that it also fits perfectly and tightly into a wide range of Manfrotto heads.This head features a secondary security lock so you can't accidentally release the plate (and camera) without meaning to. The lock stops the quick release lever from opening fully.A repositionable ratchet means that the locking lever's action will never be blocked either open or closed by interference with the camera body, tripod shoulder, etc... simply pull the lever outwards and it's free to be positioned more comfortably without affecting the locking mechanism. Then you can continue tightening or loosening the knob.A separate lock on the panoramic axis allows for rotation adjustment or panning to be carried out without losing framing.", "title": "Manfrotto 488RC2 Midi Ball Head with RC2 Rapid Connect System (3157N)", "price": 86.65, "imUrl": "http://ecx.images-amazon.com/images/I/31jy923EogL._SX300_.jpg", "related": {"also_viewed": ["B002N5NRSC", "B002PWHOYG", "B000UMX7FI", "B002N5CV8Y", "B000N7VPRW", "B003BQ71MA", "B0016D1I0G", "B004K376KK", "B0016D3H1O", "B000JLM50I", "B000JLK5PK", "B00IQ7PT50", "B008H3XZ22", "B000I6UV1Y", "B004MKNJ6G", "B00009R6GE", "B00COLBNTK", "B008I2175E", "B0047FJDXE", "B001GIPR5S", "B004MKNJAM", "B0015MHY6K", "B000FJ4XP4", "B001DQL6K8", "B000N4LJZI", "B001ASU1QO", "B008RJP9WA", "B001TK3ELC", "B002WN2114", "B003G2YZ46", "B004MKNJ6Q", "B002PWDUC6", "B004LTDLIE", "B003CRGZJS", "B001D60LG8", "B004MKNJAC", "B0047FHEMG", "B001TK3EK8", "B004XC3GWU", "B003WKOENO", "B000H0338Y", "B00FZHWJHU", "B001DIKUYE", "B004DGNO78", "B002SXMRUI", "B003UGSL70", "B003AM7V0C", "B000L47AHG", "B001BPE3KQ", "B00IT0AMBU", "B000HAVVFG", "B00006J053", "B004MKNJ84", "B004MKNJCU", "B007HO50NO"], "buy_after_viewing": ["B002N5NRSC", "B002PWHOYG", "B00009R6GE", "B008I2175E"]}, "categories": [["Electronics", "Camera & Photo", "Tripods & Monopods", "Tripod Heads"]]}