{"asin": "B001L8DKJ8", "description": "InPrinny: Can I Really Be The Hero?players are treated to a single player spin-off from the popular role-playing (RPG) universe ofDisgaea. Here players step into the unlucky shoes of a penguin called a Prinny and 999 of his comrades as you slash your way through various Netherworld areas in side-scrolling service to the Demon Lord Etna. Although the mission that you are saddled with is ridiculously comic, the action you face is not, so you're given 1,000 lives to work with and you can use everything you find on the battlefield to help you survive and succeed.Caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Classic side-scrolling action.View larger.Challenging difficulty levels.View larger.Multiple vehicles &amp; aircraft.View larger.The StoryPrinnies are the reincarnated souls of evil humans trapped in purgatory. Summoned by urgent order, the player in the form of the lowly Prinny rushes to meet his boss, Demon Lord Etna in her chamber. You arrive just in time to see Etna beating your fellow prinnies to a pulp. She is definitely in a bad mood, being even more abusive and violent than usual. As it turns out, someone has snatched her favorite dessert from the fridge. Eager to vent her frustration, she orders you to hunt down the ingredients to create a new Ultra Dessert and promises that if you do not deliver the goods by the next morning that you will learn what eternal suffering really means. Since you are at the very bottom of the netherworld food chain, if not its gutter, you have no choice but to snap into action.GameplayPrinnyis a side-scrolling platformer filled with classic flavored gameplay that requires timing of jumps and memorization of the patterns of enemy movements. As non-threatening as dessert making might seem, nothing could be further from the truth. In the game players are given 10 hours and the use of 999 identical comrades from the Prinny Squad to defeat demon bosses spread throughout the game's levels who possess the necessary ingredients to create a new dessert for Etna. Although this may sound like way more than enough help, surprisingly challenging gameplay that consistently has players one blow from either victory or defeat and the nature of the prinnies themselves will quickly change player's perception on this.True to their origins in theDisgaeauniverse where their literal explosive nature makes them perfect cannon fodder to aim at enemies, prinnies are extremely volatile. Players can only only control one prinny at a time because you only possess one red scarf, which not only indicates your status as current game hero, but also keeps you from blowing up. Wave after wave of enemies within the game also conspire to exploit the prinnies' tendency towards combustion, and more often than not are successful, underlining the importance of your 999 friends. This means that players do not actually play as a single prinny. As one meets his end another takes his place and you are kept informed of how many prinnies you have left, as well as how many hours. Prinnies are not defenseless though. Players have use of a variety of attacks and moves like the 'Dual Sword Slash' to deal with enemies in front of you, the 'Hip Pound' which allows you to stun opponents with your bottom and standard platformer jump and sprint functionality for mobility. In addition, prinnies can lift and throw objects like bombs, stomp enemies and even pilot tanks and planes to bombard whatever gets in your way. The game comes with two modes: Standard Mode, which allows you to take damage up to 3 times before losing a life and Hell Mode where one blow means instant death. In this ridiculously comic adventure you will need every advantage if you hope to survive the cost of the ultimate sweet treat.Key Game Features:1,000 Units- Players will get 1000 lives to beat the toughest action of this platforming side-scroller.Lift &amp; Throw- Prinnies are able to lift and throw objects on the battlefield.Vehicles- Steal and control powerful vehicles, like tanks and UFOs.Hip Pound: Jump and pound enemies to stun them. Then you can inflict multiple combo attacks for extra damage.3D World with 2D Characters: InPrinny, character art is created using fluid 2D sprites, giving it a classic look with a comical tone. Battlefields and backgrounds, however, are created with 3D models. This allows for a smooth and unique combat action where certain attacks are rendered in a 3-dimensional view.Boss Battles Galore- 10 Major stages featuring many hidden characters and a boss waiting at the end of each.Music Collection Mode- Find music tracks during game and replay them as background music.Humor- Ridiculously comedic storyline and characters.", "price": 23.25, "imUrl": "http://ecx.images-amazon.com/images/I/51TUm0TsS8L._SY300_.jpg", "related": {"also_bought": ["B00478OSX6", "B000TTZI0E", "B003B3V0TI", "B0029ZUPSQ", "B0045U4U52", "B000G0O6CW", "B000SSPH3E", "B000R37S78", "B008BERJEM", "B004CVR8K8", "B00356GVRW", "B00BJH11F6", "B002DMJ0RM", "B00KVRK39A", "B006O3Z2ZA", "B00477VLZU", "B003Q9RG9K", "B000HKIPGE", "B000CBCVF4", "B00K85X1TE", "B004LLRYOY", "B000CI83LI", "B001ATAIH0", "B00171NYHM", "B007PNBU0Y", "B000LUWHXC", "B00KWEHBAG", "B0014X7SQ6", "B002EQFXZA", "B004TMGZ9K", "B003WIWQF4", "B000NPTOTK", "B001C3N0P6", "B000R39IKI", "B000FG65F8", "B000R37S00", "B003YVK5T8", "B001CM0PJ6", "B001C4C4KW", "B000NPOGWK", "B003O21OWY", "B003S55EXC", "B005EYJ4PO", "B000R3K4CE", "B00ER8I990", "B004XYN4NY", "B003WTR2QQ", "B001OAH0BC", "B000NVKZ06", "B003F1WGT4", "B000GIXIPK", "B0010EF0UK", "B001V7UX1W", "B006YMG92G", "B004BV5O0U", "B0009Z3K9E", "B002I0GXWO", "B0000503QB", "B000TIPWI8", "B001KMRN0M", "B00C1IHB92", "B003S55EX2", "B0009R1T18", "B0031AV9K6", "B002E6XY6K", "B001HWF1OA", "B001CU4EJ0", "B00ANGVX9I", "B001TOQ8T8", "B000809NXW", "B0050SW1WW", "B002BRYHY0", "B000IOM45C", "B001CM62UM", "B00GV4V8YQ", "B000CBCVEK", "B00B2QL2Y4", "B004P7VGF2", "B007B7BHJ8", "B00DZIX39E", "B000G7BPOC", "B00523VFJU", "B003YVP5D4", "B005DVAAZG", "B00H45K6LW", "B0050JN84Q", "B003YVP5DE", "1465414584", "B00C1ZBFTW", "B00GFHTJ6S", "B001QTW2HI", "B009LEIUY4", "B0089X37NW", "B00304SAJQ", "B001TD6SK8", "B0007XTNGW", "B000BNMOFU", "B000E0L41K", "B00BFU8IFS", "B004R0TR0S"], "bought_together": ["B00478OSX6", "B000TTZI0E"], "buy_after_viewing": ["B003YVK5T8", "B000TTZI0E", "B000SSPH3E", "B001KMRN0M"]}, "salesRank": {"Video Games": 10609}, "categories": [["Video Games", "Sony PSP", "Games"]]}