{"asin": "B0007PIEB0", "description": "Following in the footsteps of the award-winning titlesFull ThrottleandGrim Fandango, visionary designer Tim Schafer delivers his newest creation--the bizarre, psychic adventure, Psychonauts.For years, the Psychonauts have deployed their psychically-armed operatives all over the world, but now there is trouble brewing in their own boot camp. A deranged scientist is abducting camp cadets for their brains! One student, a mysterious and powerful new arrival named Raz, stands alone against the lunatic. Raz must develop and unleash an arsenal of paranormal powers, including his most powerful weapon of all--the ability to launch himself telepathically into the minds of others. Ultimately, he must enter the psyche of his worst enemy and destroy his dark plans at their source. Entering the mind of madman has its challenges, and Raz must struggle to preserve his sanity while he battles to save the day.In this third-person shooter, you will explore 13 levels--three that are set in the \"real\" world, and ten that are set inside the mental jungle-gyms and terrifying prisons of dementia. Journeying through the mind of a lunatic, Raz, you will rise through the ranks as you collect figments of imagination, sort emotional baggage, clear out mental cobwebs, and crack open memory vaults. After you complete special training missions, Raz will learn new psychic powers, such as levitation, telekinesis, invisibility, pyrokinesis, clairvoyance, and confusion.With tightropes, trapezes, ladders, poles and other dynamic environmental features, you'll zip through an engrossing story injected with humor, vivid characters, and a spectacular range of wild, imaginative environments. The non-linear plot offers incredible depth of play, loaded with multiple paths and strange sub-challenges like digging up imaginary atomic elements, finding lost brains, and telekinetic canoeing.You'll thoroughly enjoy the journey with Raz as you make your way through weird worlds and the dark recesses of Schafer's creative, squishy gray matter in this oddball, puzzle-game shooter. Psychonauts delivers monsters that slink like cats in the night and puzzles that will bend your brain like string theory--you'll be dazzled, confused, and challenged.", "price": 34.49, "imUrl": "http://ecx.images-amazon.com/images/I/61X64DJSPJL._SY300_.jpg", "related": {"also_bought": ["B00009ZVHW", "B000E991PC", "B0002Y2XXQ", "B00004YUWA", "B0009I6S0O", "B0009SQF0C", "B000A5K5MI", "B0009A4EV2", "B00009ZVHY", "B00004YRQ9", "B00006GSNX", "B00005R5PO", "B0000690ZE", "B001C6GVI6", "B00004ZDFY", "B000066TS5", "B0014CN2H6", "B00009YEJY", "B00005ME6O", "B0002CHJ8C", "B00006Z7HR", "B00004YRQA", "B00020LZBG", "B0009XBWY6", "9629971372", "B0002B90OO", "B000IONGU4", "B0009O7HVM", "B000B69E9G", "B00004TNB0", "B000093NQC", "B0002IQC8E", "B00005MDZD", "B0007OGDIC", "B00005ME8S", "B0009A4EVM", "B00026RFI2", "0744005329", "B00005NCAM", "B0009F3E1I", "B00005UNWC", "B000095ZH5", "B00001XDUB", "B00005MKYZ", "B0001VNNE8", "B0002IQI0Q", "B0000AI1KK", "B001G3B0HC", "B0000A8VBZ", "B00020LZAM", "B00004S9AF", "B000099T1Y", "B0002IBEGO", "B000GABOTU", "B00008NRM7", "B00019HNNC", "B00020BV2E", "B00005Q8M4", "B00007LV7Z", "B00024W1U6", "B000HTWWUU", "B003IOGPAO", "B00005LZNI", "B0000B0MNH", "B000TLU67W", "B00005V6B9", "B0015ACX3Q", "B00001ZWMV", "B0000AHOOJ", "B000FPGZUE", "B00005B70K", "B00009VE6D", "B0001CJEJU", "B0009RG8DW", "B00006F2EP", "B0013JHKU0", "B000G82R20", "B001O1PAMC", "B00004U1R2", "B00008KTRS", "B000G6SPHI", "B00000DMAR", "B0002GTFIK", "B000M9C6VU", "B0002XL3BA", "B00004U4R9", "B002I0J5UQ", "B000784XG2", "B0045L3SNQ", "B0006ZJPSC", "B00008XKZM", "B00007UHPJ", "B001PBDBNQ", "B00002SVG0", "B000OLXX86", "B000059Z8I", "B00005MA97", "B00000DMAT", "B00019HNNM", "B00005TNI6"], "buy_after_viewing": ["B00009ZVHW", "B0009I6S0O", "B0002XL3BA", "B0002Y2XXQ"]}, "salesRank": {"Video Games": 16928}, "categories": [["Video Games", "More Systems", "PlayStation 2", "Games"]]}