{"asin": "B000GYI76Y", "categories": [["Electronics", "Computers & Accessories", "Laptop & Netbook Computer Accessories", "Bags & Cases", "Sleeves & Slipcases"]], "description": "LA robe&rsquo;s slim design fits comfortably in your bag, offering great portability, it&rsquo;s ideal to dress your Notebook or laptop in an original fashion while protecting it from mobile life worries. With over 25 colors and countless special editions, the LA robe from be.ez is quite simply the product that offers consumers a wide range of colors for dressing their precious companion.LA robe Features:A Unique Memory Foam Material--Low Resilience Polyurethane (LRPu) TechnologyRobe protection Thickness 5MM.Trendy, Unique Design.Inner Lip for maximum protection.Stand alone or in your bag.No more scratches for your Laptop!What are LA robe Sleeves made of?Made from a soft, cushioned, memory foam material it offers unique, stylish protection while on the move.Will the LA robe fit my Laptop?The LA robe offers a tailor made solution and is designed to fit most Laptop and Mac computers!Be.ez offers innovative design for everyoneFor users with the greatest mobility needs, be.ez also boasts a complete selection of Netbook Sleeves, Laptop Sleeves and Messenger Bags that embody the same sleek and functional design values, with a certain indefinable charm that makes the range so distinctive. (LE vertigo and LA besace)Who is be.ez?be.ez (be easy) is a French brand with a true international approach to design, and manufacture, in order to offer original solutions for &lsquo;mobile life&rsquo;. The adventure of be.ez was born out of a simple observation: there does not exist today a real alternative to the austerity in the computer accessory market. Be.ez thus decided to specialize in the creation of products and accessories, both original functional and well designed.", "title": "be.ez 100416 LA robe Sleeve for 13.3-Inch Macbooks (Black/White)", "price": 38.77, "imUrl": "http://ecx.images-amazon.com/images/I/31l62SE2tgL._SY300_.jpg", "brand": "be.ez", "related": {"also_viewed": ["B001D8J7CA", "B00DE80OUG", "B0019GMLOW", "B00JO6UGFU", "B004NY9UW8", "B006P88UQW", "B00CD8AF48", "B002W5V8SE", "B001LUK54Y", "B00883QT38", "B001W6PO0C", "B001MB3OFY", "B00BCMILF6", "B005IPKVI8", "B001MXD2ZE", "B004CR7TE2", "B004J13VW0", "B00JQMWT48", "B008DWCPP0", "B0085B772A", "B001LM66BS", "B0065V3J60", "B00FJ6FZXW", "B004NY9UVO", "B0088E39BW", "B00DE8KIBQ", "B006SRYI9S", "B004W3SNPU", "B00DN6NXGQ", "B001NYZ76O", "B008HZSWXW", "B0012FCQGS", "B00GR95I32", "B00B5RAJ9E", "B004YIWTXU", "B003ZDE8N4", "B00JPLCGTS"], "buy_after_viewing": ["B004NY9UW8", "B006P88UQW", "B00AQFFSAG", "B00CD8AF48"]}}