{"asin": "B000NOUP0S", "categories": [["Electronics", "Camera & Photo", "Digital Cameras"]], "description": "Manufacturer Description  The Fujifilm FinePix S700 is for anyone seeking an affordable long-zoom digital camera. The powerful 10x optical zoom lens and 1/2.5-inch, 7-megapixel standard CCD imager helps you capture perfect images. Dual media slots (SD/MMC and xD-Picture Card) give you more storage options, while the 2.5-inch LCD display helps you capture each image perfectly. Other features include multiple exposure modes, auto &amp; manual focus, 8 white balance modes (including a custom hold mode) and a six-mode popup flash. There's plenty in the Fuji FinePix S700 to cater to the needs of advanced amateurs looking to gain maximum control over their photos.Fuji FinePix S700 HighlightsFujinon lens technologyThe S700 features a 10x optical zoom with a 35mm focal range equivalent of 38-380mm. Bring your subject closer and clearer with high-quality Fujinon lens technology.Picture stabilizationFast moving subject? No problem. Fujifilm's Picture Stabilization technology utilizes the heightened sensitivity of the FinePix S700 at ISO 1600 and high-speed shutter settings to prevent camera shake or freeze subject movement, keeping blur to a minimum. This easy to access feature (selectable on the mode dial) let's the FinePix S700 choose the correct light sensitivity and best-matching shutter speed automatically, for the highest quality digital pictures.i-Flash Intelligent Flashi-Flash fine-tunes flash output for shooting with high-sensitivity settings. It recognizes scene conditions and determines the optimum flash output to ensure superb results. Subjects in the foreground appear natural, and background detail is bright and clear. The difference is especially noticeable in the natural facial tones of people in your pictures, in close-ups and group photos alike.2.5-inch LCD display and Electronic ViewfinderThe FinePix S700 features two different ways to frame and view your shot. Choose from either the large, 2.5-inch 230k pixel LCD Display, or the .24-inch 230k pixel Electronic Viewfinder. Both offer a 60/fps refresh rate, and a brilliantly bright and detailed view of your image in either shooting or playback mode.Dual media slot convenienceThe Finepix S700 features a xD/SD compatible slot, allowing the use of either xD Picture Card or SD media to store and transfer your photos. This new capability assures compatibility with a wider variety of applications than ever before, and allows users to choose the media technology that is right for them.", "title": "Fujifilm Finepix S700 7.1MP Digital Camera with 10x Optical Zoom", "price": 129.94, "salesRank": {"Camera &amp; Photo": 5699}, "imUrl": "http://ecx.images-amazon.com/images/I/41ECi4n67zL._SX300_.jpg", "related": {"also_viewed": ["B0012Y0BIE", "B004HO58NO", "B0011ZK6ZM", "B0035JD0DW", "B0084IKKX2", "B00009VS6P", "B001PK8FHE", "B001QENO7A", "B001D0G56E", "B004LB4SAM", "B00E9R04OW", "B006YP41I2", "B003IHVEU2", "B0090NZSM8", "B006UD5K2Y", "B0034XIMG4", "B003VAI89Q", "B00B5MUJTO", "B00E1U9FN8", "B00ATM1NAU", "B000EMWBV0", "B006TR0FCQ", "B0007WIC1K", "B000NOQVQK", "B004HO58NY", "B00ANQD52Q", "B000ENN9BK", "B0081IOD1K", "B005GQ56M0", "B004HO58OI", "B00IITSF2A", "B0035WTVZA", "B00BT1RS3G", "B005Q645M2", "B008V0H284", "B00ANCZO42", "B005I6DVC0", "B00ATM1MVU", "B00B46XSC6", "B006T7QSV8", "B001G5ZTZO", "B006T7QXOA", "B00005OCWN", "B00HGE3CZI", "B002IKLJU0", "B004LB4SBG", "B008HVZY1E"], "buy_after_viewing": ["B00B5MUJTO", "B005GQ56M0", "B00B7ID99I", "B003HMVLJC"]}}