{"asin": "B001DEYVXO", "related": {"also_bought": ["B007JPOX8O", "B00LPESRUK", "B00224ZDFY", "B001DERXV6", "B0014YFC18", "B001LQEEEA", "B00GY0UB6I", "B00GY0UB54", "B00198MYB0", "B007YV0UQW", "B002U6KT8U", "B0018BQR84", "B00GGM0Y66", "B008EQ6QI2", "B00ASJRMT0", "B00BB0ETW8", "B0007LBMR2", "B009SQQF9C", "B002H3BSCM", "B00E1YBTVU", "B00GOILYB6", "B00DIFIP06", "0735684790", "B005DKZTMG", "B005MWQ6WC", "B00HZDLNWO", "B001EZRJZE", "B00DY5C7AY", "B000N7FQB8", "B00DMCVKMU", "B0051YCQ8E", "B00APPDX86", "B00J8QK41M", "B003L1ZYYM", "B004DP2TC0", "B003VANO7C", "B000Y97Q86", "B00DIFIO8E", "B00ELJVM5I", "B00DQFGJR4", "B008B7ARRK", "B003MTTJOY", "B00008VFAF", "B00AGQ4WHA", "B00FDLCTQO", "B00E3W1726", "B00ESG5TQM", "B00B9996LA", "B008ZGKWQI", "B003Z4G3I6", "B001MSU1FS", "B0043T7FHK", "B00F3ZN0CC", "B00310EEO4", "B003FVJYF8", "B00BN5Z2WM", "B0088PUEPK", "B00BV9N3M6", "B00H3YT8CC", "B00CO8TBQ0", "B008EQ4BQG", "B00E3W19MO", "B00BFOEY3Y", "B00H09BOXQ", "B005LDLVAO", "B003DRMKXW", "B008KVUAGU", "B00847TOLC", "B00A378L10", "B008EQYRRY", "B003XM1WE0", "B008JJLZ7G", "B00FJRS6QY", "B006I0KL6Y", "B006LFL4X0", "B003P92D9Y", "B000234UFG", "B007B5S52C", "B00D601UC8", "B00879DM56", "B00DR8LA6U", "B00BWF5U0M", "B001TH7T2U", "B00904JILO", "B0024R4B5C", "B00B7FOQCK", "B00BQ8RFAI", "B002BH3Z8E", "B00E83X9P8", "B001TH7GV4", "B008RJZQSW", "B0007MXZB2", "B007RH5GZI", "B00B3P1IGG", "B00834SJS0", "B00870ZHCQ", "B004S4R5CK", "B004LT8MN8", "B00CX5P8FC"], "bought_together": ["B007JPOX8O"], "buy_after_viewing": ["B002U6KT8U", "B002UOUQ08", "B006PU81QE", "B001DERXV6"]}, "title": "Hauppauge 1191 WinTV-HVR-950Q TV Tuner Stick/Personal Video Recorder with Clear QAM and Remote Control (Black)", "price": 63.99, "salesRank": {"Electronics": 3043}, "imUrl": "http://ecx.images-amazon.com/images/I/41hON2JlQSL._SX300_.jpg", "brand": "Hauppauge", "categories": [["Electronics", "Accessories & Supplies"]], "description": "Amazon.com Product Description The Hauppauge 1191 WinTV-HVR-950Q Hybrid TV Stick External TV Tuner/Video Recorder will bring high-definition television directly to your PC. This handy device lets you watch your favorite TV shows through your computer, and record them digitally for future playback using high quality MPEG-2. More economical and versatile than a DVR, or digital video recorder, this PC Video Recorder, or PVR, gives you virtually unlimited options for saving and playing back your favorite TV broadcasts and clips..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The Hauppauge 1191 WinTV-HVR-950Q Hybrid TV Stick External TV Tuner/Video Recorder offers:Ability to watch television on your PC in a window or full screen.Portable, small size for on-the-go television viewing on your laptop.Compatibility with digital and analog signals.Acceptance of video feeds from a camera or satellite box.The small, pocketable size lets you easily take it everywhere.View larger.Play and Record Television DigitallyThe WinTV-HVR-950Q is a simple-to-use device that brings over-the-air high definition ATSC digital TV as well as analog cable TV directly to your PC desktop or laptop. With the additional included antenna, it can also receive analog TV broadcasts, and it can also accept video feeds directly from a camera or satellite box.More versatile than a DVR, the WinTV-HVR-950Q is a pocket-sized device that simply plugs into your PC's USB port. It features a built-in digital ATSC over-the-air TV receiver. If you live in one of the more than 200 cities in the United States that receives ATSC digital TV, you'll have immediate access to as many as 1500 digital TV stations. ATSC digital TV is the over-the-air HDTV standard for North America. ATSC broadcasts range in resolution from standard definition up to the high definition 1080i format. (To check the ATSC digital transmissions in your area, input your zip code at titantv.com.)A portable digital TV antenna, which can be used to receive digital TV up to 10 miles from an ATSC transmitter, is included with the PVR . (To check the ATSC digital transmissions in your area, input your zip code at titantv.com) If you live in an area where you can't currently receive ATSC digital TV, the WinTV-HVR-950 can still be used to watch and record analog TV from cable TV or a TV antenna. (The WinTV-HVR-950 cannot receive digital cable TV or digital satellite TV.) With the included credit-card-sized remote control, navigating all these channels is easy.Watch Clear QAM Digital TVThe WinTV-HVR-950Q also has a built-in QAM tuner, allowing you to watch and record QAM programming. Clear QAM digital TV channels are digital cable channels which can be watched on a TV set without a cable TV set top box. are Many cable operators transmit the local high definition ATSC channels using clear QAM.. Some cable operators transmit additional non-premium TV programs using clear QAM. With the WinTV-HVR-950Q, you can watch these channels for free. Clear QAM channels range from standard definition to the highest 1080i definition.Once the WinTV-HVR-950Q is connected, you can begin to record your favorite shows in high-quality MPEG-2 directly to your hard disk using the Hauppauge SoftPVR MPEG-2 encoder. Television recordings will typically consume 5 GB of disk space per hour for ATSC high definition, while analog recordings will typically consume 1.5 GB of disk space per hour. You can also use the included WinTV-Scheduler to program your compute to record your favorite analog or digital TV shows for play back at any time.Compatibility with Microsoft's Windows Media Center means that you can watch TV as well as your recordings with Windows Media Center. The included WinTV application also lets you watch your shows in a window or on full screen.The WinTV application offers an elegant interface to watch TV in a window or full screen.View larger.More about PVR TechnologyPVR stands for PC Video Recorder. The WinTV-HVR-950 is a PVR that allows you to play television through your computer and record the broadcasts digitally. PVR doesn't use standard videocassettes; instead, it uses your computer's hard disk to store the broadcasts.Once you record a television show to your PC's hard drive, you can burn a CD or DVD that will allow you to play the show back on another computer or on your television. With video editing software (not included with the WinTV-HVR-950), you can even edit the shows. This is a great feature if you want to save clips from movies or sitcoms, or keep your favorite player's grand slam or TD kick-off return for posterity.And just like a typical VCR, the WinTV-HVR-950 offers you several recording options, depending on your play back needs. If you want the highest quality recording for playback through your HDTV, all you need is enough hard drive space to support high-quality recording. By using the lowest recording option, you can use your WinTV-HVR-950, along with an inexpensive video camera, as a low-cost on-site video surveillance system. In fact, the possibilities of how you can take advantage of the WinTV-HVR-950 are endless.What's in the BoxWinTV-HVR-950 USB 2.0 TV stick with cable TV or ATSC antenna connection; USB extension cable; portable antenna; software on CD-ROM; remote control; and quick installation guide."}