{"asin": "B004M3BICU", "categories": [["Electronics", "Car & Vehicle Electronics", "Aviation Electronics", "Aviation GPS"]], "description": "The XGPS150 is a global and universal Bluetooth GPS Receiver, which not only works with a wide variety of today's most popular electronics, but also comes with the necessary accessories to be used for a variety of lifestyle activities. The included non-slip pad is very useful for GPS navigation in a car or a boat. The two-piece strap which works as an armband and to secure the receiver to a backpack strap, for example, is great for outdoor activities such as golfing, geocaching, cycling, hiking and more. The XGPS150 measures about 2.25\" square, which makes it very easy to take it with you wherever you go. Set up is a breeze. Like with any other Bluetooth electronics, you will first have to pair the GPS Receiver with the device you intend to use it with. This will take less than a minute and then you can begin using your device (iPad2, iPad, iPod, etc.) with apps that require GPS. The XGPS150 is certified to work with all Bluetooth-enabled iPad2, iPad, iPod touch and iPhone models. The XGPS150 also works with other Bluetooth-enabled smart phones, tablets and laptops, including Blackberry, Android and Windows devices that support Bluetooth SPP (Serial Port Profile). There is a Free App available which shows satellite signal strength, current location, the battery level of the XGPS150A, connectivity status and a few other device-specific tidbits. This app can be downloaded through iTunes.", "title": "Dual Electronics XGPS150 Universal Bluetooth GPS Receiver for iPad 2, iPad, iPod touch, iPhone and Other Smartphones, Tablets and Laptops (Discontinued by Manufacturer)", "price": 98.6, "imUrl": "http://ecx.images-amazon.com/images/I/51FcZY5%2B5CL._SY300_.jpg", "brand": "Dual Electronics", "related": {"also_bought": ["B003N7NO4Q", "B004V4N3NW", "B0042HJOOA", "B006M49G80", "B00470C35E", "B0098QTFTO", "B00AJND7IU", "B00BCTY9BY", "B002KO5XVU", "156027994X", "B0018YZ836", "1560279494", "B00A4NPJA4", "0070648409", "B008BXB76Y", "B00E65TNYE", "B00AC0K3PU", "B003CEODQI", "B000056SPM", "B006IVQKRW", "B00G2BX616", "B006OQQ27E", "B0035Y7ZJ2", "B002IV6OHC", "B008FRGQT4", "B0013KX2K6", "B000I4JG26", "B004M8ST36", "B000WJA5ZY", "B0049U3ZCW", "B00BMEIE7Y", "B000PKX2KA", "0071475354", "B005PHXJD8", "B000AURZ08", "B003IS4G7O", "B00BY5IRF0", "B003455YF4", "B005HGLXDK", "B003XQPODG", "B00LJV9XR0", "B004TG67YY", "B00AAZ8OS0", "B0000512IE"], "bought_together": ["B003N7NO4Q", "B0042HJOOA"], "buy_after_viewing": ["B006M49G80", "B00E65TNYE", "B008VWNBBE", "B00AYAZENY"]}}