{"asin": "B0017ZDGWG", "description": "Mortal Kombat vs. DC Universeis a fighting game merging the worlds and characters of theMortal Kombatvideo game universe and that of DC comics. Featuring a deep storyline developed by top writing talent, iconic fighting arenas from both universes, character specific attacks and moves, two all-new fighting mechanics and single player and multiplayer support, it has something for every fan of the video game arcade fighting genre..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Match-ups you never thought possible.View larger.Character-specific abilities.View larger.Combine abilities into Fusion powers.View larger.50%+ damage in Rage Mode.View larger.New Klose Kombat mechanic.View larger.StoryThe story of how the heroes and villains ofMortal Kombatand the DC universe could find themselves not only existing on the same plain, but battling each other revolves around coincidental victories in the respective realms by Raiden and Superman. In Raiden's case it was a victory over Shao Kahn, while Superman bested Darkseid. These occurred at the exact same time and involved inter-dimensional elements, which somehow merged their two enemies into one being, Dark Kahn, while allowing the characters of the two universes to interact. In this merging the powers of the heroes and villains are scrambled as well, making some stronger than they ever were, and leaving others vulnerable for the first time in their lives, allowing each to battle on more or less equal footing. And battle they do without realizing that the uncontrollable rage that they feel for each other is actually the work of Dark Khan.GameplayMortal Kombat vs. DC Universebeing a fighter, gameplay consists of one-on-one battles, both in local play and online, in which players can choose a character from either side who will face off against a counterpart from the other. Each character has unique attacks and special finishing moves, and fighting arenas vary depending on whether your character comes from theMortal Kombator DC universe. Keeping with the reputation for brutality in theMortal Kombatfranchise, characters from this side will have access to fatalities, while the historically less overly violent DC Comics characters will execute \"heroic brutalities,\" which are end moves where the opponent while beaten, is not killed. The game also features new gameplay mechanics such as: Freefall Kombat, in which players can engage in extended combat while in midair; Klose Kombat, during which the play angle moves to a close-up view of the action; The \"Test Your Might\" mini-game where you smash your opponent through walls; and Rage Mode, which increases the power of a character's attack by 50% and provides protection against being stunned by an opponent.Playable CharactersPlayable characters inMortal Kombat vs. DC Universeconsist of some of the most popular heroes and villains from both universes, with most being available from the beginning of the game and some unlockable throughout. They include the following:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;", "price": 71.56, "imUrl": "http://ecx.images-amazon.com/images/I/51lB6MkZ32L._SY300_.jpg", "related": {"also_bought": ["B006ZTHGCK", "B0088I7KYU", "B003IE9V28", "B000FRU1UM", "B002I0J998", "B003R783IY", "B004X56OU8", "B007SRM5MO", "B003ZSP0WW", "B002MED6F8", "B0012N3ZXS", "B005C7R8I8", "B003C1I0CO", "B001PB9J14", "B003O6G6RI", "B00DWXV1DM", "B00821HMDM", "B002I0H79C", "B0050SWTAQ", "B008J16AP6", "B00FJWNSWQ", "B00BU3ZLJQ", "B002I098JE", "B001G3AZS2", "B00CMC6HZ6", "B0050SY4DG", "B0050SYILE", "B0050SYX8W", "B008FU489G", "B006ZPAYMI", "B00019AZAK", "B0042YM9GI", "B00BURPOZ8", "B006ZPAYGE", "B00C710AZ0", "B003O6N266", "B0050SY77E", "B007M6W38W", "B0030CV356", "B003O6E986", "B0053BSNZU", "B003VJKJG2", "B003O6EA4E", "B0038N0A24", "B006VB2UNM", "B00D9EPI38", "B0050SYLRK", "B00AY1CT4U", "B001989B4S", "B00273Z9WM", "B007WQOIGW", "B00D8S4GNS", "B003O6CACS", "B001AWIP68", "B005C2D2MO", "B00B98HF1O", "B004HYK956", "B00E20STAC", "B002BSA2LQ", "B004M8NR7E", "B00006FDLP", "B00C71034I", "B0050SYV70", "B000ZK6950", "B00503E8S2", "B000ZKDOVW", "B000P297E8", "B008J16ARY", "B007MJSZDQ", "B00BMFIXT2", "B004BD1DWG", "B002DC8GKE", "B00CXTX2YW", "B004T7PWZ8", "B00FATRKLI", "B007H45BSI", "B004I5EE46", "B005DVAB1Y", "B007LQG9A6", "B005UDTTS6", "B002TDIEE0", "B003O6G5TW", "B003O6EB70", "B002DC8GMM", "B00CTKHYG2", "B002I0JAVK", "B003VKLABE", "B0050SY0L2", "B00D4AK5TY", "B002I0HEI6", "B0024H5S7M", "B008LW4SBQ", "B0022TNO7S", "B008OQTRYW", "B00EFRNG0A", "B001PKHRVE", "B006VB2UO6", "B0050SY5BM", "B00149Y1G0", "B0016B28Y8"], "bought_together": ["B006ZTHGCK", "B003ZSP0WW"], "buy_after_viewing": ["B006ZTHGCK", "B0088I7KYU", "B00FJWNSWQ", "B002I098JE"]}, "salesRank": {"Video Games": 1151}, "categories": [["Video Games", "Xbox 360", "Games"]]}