{"asin": "B006VHF9TI", "categories": [["Electronics", "GPS & Navigation", "GPS Trackers"]], "description": "MasTrack OBD tracker is a small GPS tracking device that plugs directly into the OBD port of any vehicle. No tools or wiring required. Simply plug the tracker in and your set to go. All passenger vehicles and lightweight trucks manufactured after 1995 are equipped with an OBD port that can be easily found within 3 feet of the steering wheel. The MasTrack system is used by businesses tracking their vehicles and personnel for verification of employee time sheets and customer billing. This system gives peace of mind to parents keeping an eye on their teen drivers or monitoring the location of an aging loved one. Features: Speeding Excessive idling Zone alerts (when the vehicle enters or leaves specific locations)Ignition status Voltage Maintenance Reminders (Oil Change ...etc.)*Check Engine Alerts (Provides Triggered Engine Codes)*You receive unlimited email and text message notifications on all features. Select the Plan that fits your needs:15 Min $14.99 5 Min $19.992 Min $24.991 Min $34.99MasTrack GPS tracking requires a monthly subscription with no long term contracts so you can cancel at any time. There are no hidden fees or additional charges.*Available on select plans", "title": "MasTrack OBD Real Time GPS Vehicle Tracker + Live Engine Diagnostic Notification", "price": 78.0, "imUrl": "http://ecx.images-amazon.com/images/I/31dDbgxNgAL.jpg", "brand": "Mobile Asset Solutions", "related": {"also_bought": ["B00EECXAY8", "B000SBCHCA", "B00GGLVXG2", "B007PBHF8M", "B000TMCX72", "B0085WMKU8", "B00INXADDK", "B00BB2NLVQ", "B00EEDOWU8", "B00HJAMBI8", "B00GNJAE9E", "B00INXAVOQ", "B00C6SLP94", "B00CH5U24A", "B00FKZYE70", "B007PAHHWM", "B004XZKYAO", "B004X17BIQ", "B00GGPSK0U", "B008OI46FU", "B00CIXAF8O", "B008FLOWAU", "B0013CC3M2", "B00GFW1CRM", "B000H9E9UG", "B008GT8C7K", "B00ATGRJ9K", "B005LI78YM", "B000BGRS8K", "B003DW6XPS", "B00JFBLCYS", "B001JBSAQ0", "B00B7733E0", "B004YK66NM", "B009TQ4L5Q", "B000VRL632", "B000BQS5GO", "B00FEA01O6", "B008GULDD4", "B00F0DD0I6"], "bought_together": ["B000SBCHCA"], "buy_after_viewing": ["B008FLOWAU", "B006TZGJDC", "B00JG8KCLO", "B00GFW1CRM"]}}