{"asin": "B000R805L4", "description": "Redefining Apple's signature all-in-one desktop PC, the newly redesigned iMac now sports a sleek, professional aluminum enclosure that's joined precisely to a 24-inch glass cover to create a virtually seamless front surface. It also features new ultra-thin aluminum Apple Keyboard--with an extended layout and dedicated keys for Mac features such as brightness, volume, eject, play/pause, and Expos&eacute;--as well as the wired Mighty Mouse. The iMac is preloaded with Apple's latest suite of digital media applications--iLife '08--and also comes with the Apple Remote and Front Row media display software, which enables you to easily play your music, enjoy photo slideshows, and watch DVDs, iMovies, music videos and television shows from across the room.It's powered by a 2.4 GHz Intel Core 2 Duo processor from the newest \"Santa Rosa\" chips, which offer a top-of-the-line 800 MHz front-side bus speed and a huge 4 MB L2 cache. This 24-inch iMac also features a 320 GB hard drive, 1 GB of RAM (with a 4 GB maximum capacity), 8x SuperDrive for burning movies to DVD and music mixes to CD, integrated 802.11n wireless LAN, Gigabit Ethernet wired networking, Bluetooth connectivity, ATI Radeon HD 2600 video card with 256 MB dedicated memory, and the Mac OS X v10.5 Leopard operating system.The iMac, TransformedRedesigned with a recyclable anodized aluminum frame and glass cover, the iMac is friendlier to the environment..The new keyboard's ultrathin anodized aluminum enclosure features low-profile keys that provide a crisp, responsive feel.The its anodized aluminum frame and glass cover, the new iMac instantly transforms your workspace from cluttered desktop to brilliant display podium. Because it's made from a single sheet of aluminum, you won't see any seams or screws except for a single compartment on the bottom that provides easy access to the memory slots. The glossy widescreen 20-inch display makes photos and movies come alive with rich color. And the built-in iSight camera and microphone are integrated so neatly you barely notice they're there. Aside from the design details, the iMac is also  friendlier to the environment with highly recyclable and durable materials including scratch-resistant glass and professional grade aluminum. The power-efficient iMac also meets the stringent new Energy Star 4.0 requirements.With its elegant anodized aluminum enclosure, the new Apple Keyboard looks equally at home in your living room or on your desk. Just connect it to the USB port on your iMac and start enjoying the crisp, responsive feel of its low-profile keys. The extended layout has a full complement of keys, including document navigation controls, a numeric keypad, and special function keys for Mac features such as brightness, volume, eject, play/pause, Expos&eacute;, and more. Two USB 2.0 ports provide high-speed connectivity for your iPod, Mighty Mouse, digital camera, and other USB-based electronic devices.Preinstalled with iLife '08Every iMac includes iLife '08, the latest version of Apple's award-winning suite of digital media applications, with major upgrades to iPhoto, iDVD, iWeb, and GarageBand and a completely reinvented iMovie. iPhoto '08 now automatically organizes photo libraries into Events that let you more easily manage your growing photo collections, and iMovie '08 can import video from the latest AVCHD, HDV and DV camcorders, as well as from digital cameras, and displays your entire video library whether it's stored on internal or external drives. Both iPhoto and iMovie integrate seamlessly with the new .Mac Web Gallery, Apple's new service for .Mac members to instantly create and host websites for their photos and videos.The pre-installed iLife '08 software suite includes a completely redesigned iMovie, which makes it even easier to share your videos on the Internet.iLife '08 also features iWeb '08, with live web widgets such as Google Maps that let you create even more dynamic websites, and GarageBand '08, with its new Magic GarageBand feature that makes it fun and easy for both musicians and non-musicians to create great sounding songs.Intel Core 2 Duo ProcessorIt's powered by the 2.4 GHz Intel Core 2 Duo T7700 processor from the newest \"Santa Rosa\" chips, which offer a top-of-the-line 800 MHz front-side bus speed and 4 MB L2 cache. (An L2, or secondary, cache temporarily stores data; and a larger L2 cache can help speed up your system's performance. The FSB carries data between the CPU and RAM, and a faster front-side bus will deliver better overall performance.) With such a substantial L2 cache, data instructions can be kept close to the two processor cores, greatly increasing performance and allowing the entire system to work more efficiently.The Intel Core 2 Duo's 128-bit SSE3 vector engine handles 128-bit computations in a single clock cycle, accelerating data manipulation by simultaneously applying a single instruction to multiple data. And its two execution cores are designed to share resources and conserve power, helping it to achieve higher levels of performance since it uses fewer watts.Graphics and VideoThe 24-inch TFT active-matrix LCD offers a panoramic resolution of 1920 by 1200 pixels--30 percent more screen real estate than the 20-inch model. It has a brightness rating of 380 nits, a contrast ratio of 750:1, and a viewing angle of 178 degrees (both horizontal and vertical). An ATI Radeon HD 2600 graphics processor powers the iMac with 256 MB of dedicated GDDR3 memory. It features some of the most advanced graphics technology available and delivers new levels of visual realism and a huge texture fill rate for smooth surfaces and complex character details. GDDR3 (Graphics Double Data Rate, version 3) is a graphics card-specific memory technology that's better able to deliver fluid frame rates for even the most advanced games and applications.This iMac also enables you to connect a second display in either extended desktop mode or video mirroring mode. The mini-DVI port connects to DVI displays, VGA monitors and projectors, and S-video and composite devices using the appropriate adapter (sold separately).Wired and Wireless ConnectivityYou get a full complement of ports on the back of the iMac, including three USB 2.0 and two flavors of FireWire--400 and 800.The iMac gives you plenty of room to grow, accommodating as many as five peripherals at a time thanks to its three USB 2.0 ports and the two USB 2.0 ports on the Apple Keyboard. It also includes two powered FireWire ports--one FireWire 400 and one FireWire 800 (one of the fastest peripheral standards available)--enabling you to quickly transfer content from digital video cameras, hard drives, and other high-speed devices.Share files around your house with built-in 10/100/1000BASE-T Ethernet as well as the next-generation high-speed wireless 802.11n technology, which is integrated into the latest Apple Airport Extreme Base Station. The iMac is also Wi-Fi Certified to work with base stations and routers that use industry-standard 802.11a, 802.11b, or 802.11g wireless technologies.The integrated Bluetooth wireless connectivity--version 2.0 + Enhanced Data Rate (EDR)--allows you to use a wireless keyboard or mouse, and synchronize peripherals such as cell phones and PDAs. Enjoy high-quality sound on almost any speaker system with double-duty analog/digital audio. Record digital and analog sources through audio line in, perfect for your latest podcast in GarageBand.SuperDriveIntegrated neatly into the iMac is a slot-loading SuperDrive that lets you play and burn your own CDs and DVDs--including double-layer DVDs. And there's no disc tray--just slide the disc right in. It offers the following speeds:Writes DVD+R DL and DVD-R DL discs at up to 4x speedWrites DVD-R and DVD+R discs at up to 8x speedWrites DVD-RW at up to 6x speed and DVD+RW discs at up to 8x speedReads DVDs at up to 8x speedWrites CD-R discs at up to 24x speedWrites CD-RW discs at up to 16x speedReads CDs at up to 24x speedOther FeaturesTwo SO-DIMM slots support up to 4 GB of RAMBuilt-in stereo speakers with internal 24-watt digital amplifierSupport for external display in extended desktop mode: 1920 by 1200 pixels for digital and 2048 by 1536 pixels for analogMeets ENERGY STAR requirements with maximum continuous power rating of 200 wattsDimensions: 20.5 x 22.4 x 8.1 inches (WxHxD)Included SoftwareMac OS X v10.5 Leopard operating system (includes Spotlight, Dashboard, Mail, iChat AV, Safari, Address Book, QuickTime, iCal, DVD Player, Xcode Developer Tools); iLife '08 (includes iTunes, iPhoto, iMovie, iDVD, iWeb, GarageBand); Microsoft Office 2004 for Mac Test Drive; iWork (30-day trial); and Front RowWhat's in the BoxiMac, Apple Keyboard, Mighty Mouse, Apple Remote, cleaning cloth, power cord, install/restore DVDs, printed and electronic documentation", "title": "Apple iMac Desktop with 24&quot; Display  MA878LL/A (2.4 GHz Intel Core 2 Duo, 1 GB RAM, 320 GB Hard Drive, SuperDrive)", "price": 78.79, "imUrl": "http://ecx.images-amazon.com/images/I/41DFhk-ZucL._SY300_.jpg", "related": {"also_viewed": ["B004YLCBRG", "B00AP6UM2U", "B002C74E9C", "B004YLCFCM", "B004YLCIC4", "B007476KRY", "B004YLCJXC", "B005DLDO4U", "B00DB9WCR6", "B0058UUR6E"], "buy_after_viewing": ["B000K1KTNW", "B008AL9VXI", "B000PMGZDO"]}, "categories": [["Electronics", "Computers & Accessories", "Desktops"]]}