{"asin": "B0013FLTNS", "description": "Stylishly and intelligently designed for mobile professionals, Apple's MacBook Pro now includes Apple's Multi-Touch technology (which debuted with the MacBook Air), allowing you to pinch, swipe, or rotate to enlarge text, advance through photos, or adjust an image. And it gets a serious speed bump from Intel's latest 2.5 GHz 45-nanometer Penryn series Core 2 Duo processor (with 6 MB L2 cache), which also helps to reduce power requirements and save on battery life. This model (MB134LL/A ) also has a mercury-free, power-efficient LED-backlit display measuring 15.4 inches and a state-of-the art NVIDIA GeForce 8600M GT video card with 512 MB of GDDR3 video RAM.The 15-inch MacBook Pro offers a mercury-free, power-efficient LED-backlit display with an antiglare finish that's perfect for color-minded professionals.Meticulously designed and encased in sleek and sturdy aluminum, the MacBook Pro measures just 1 inch thin and weighs 5.4 pounds. Your hands have room to spread out on the full-size keyboard with crisp, responsive keys, and the MacBook Pro has a built-in ambient light sensor that adjusts the keyboard and display brightness so it&rsquo;s easy to work in low-light settings. Other standard Apple \"extras\" includes a built-in iSight video camera and Apple's magnetically connected MagSafe power adapter, which safely disconnects when under strain.It's pre-loaded with Apple's Mac OS X 10.5 Leopard operating system, which enables easy backup of your most important data via Time Machine, a redesigned desktop that helps eliminate clutter. It also comes with the iLife '08 suite of applications--including iPhoto, iMovie, Garageband, and iTunes--and the newest version of the fast-loading Safari web browser. Other hardware features include a 250 GB hard drive, 2 GB of installed RAM (which can be upgraded to 4 GB), an 8x combo Superdrive (for burning dual-layer DVDs as well as CDs), built-in Gigabit Ethernet for high-speed networking, Bluetooth 2.1+EDR (Enhanced Data Rate), FireWire 400 and 800 ports, DVI video output, and an ExpressCard/34 expansion card slot for expansion solutions such as 3G wireless networking.Apple InnovationsThe MacBook Pro is the culmination of years of refining hardware and software design to an integrated art, and Apple's Multi-Touch technology is just the latest innovation to be added to it. The advanced trackpad now allows you to flip through photos, enlarge text, and adjust an image using just your fingers. It also comes with a MagSafe power adapter connector, which offers a magnetic connection instead of a physical one. So, if you happen to trip over a power cord, you won't send MacBook Pro flying off a table or desk--the cord simply disconnects, without damage to either the cord or the system.The magnetically connected MagSafe power adapter breaks cleanly away, without damage to either the cord or the MacBook Pro.The MacBook Pro has battery life that rivals most notebooks in its class. If you'd like to make that battery last even longer, Mac OS X has a few tricks up its sleeve. Go to System Preferences, click Energy Saver, and change battery optimization from Normal to Better Battery Life. Or tell MacBook Pro to reduce its screen brightness and give yourself a little more time untethered.Intel Core 2 Duo ProcessorExperience improved energy efficiency, expanded wireless connectivity, and amazing battery life with the 45nm Penryn series Intel Core 2 Duo T9300 processor, which has a 2.50 GHz processor speed, super-fast 800 MHz front-side bus (FSB), and a super-sized 6 MB L2 cache. (An L2, or secondary, cache temporarily stores data; and a larger L2 cache can help speed up your system's performance. The FSB carries data between the CPU and RAM, and a faster front-side bus will deliver better overall performance.)The new hafnium-infused circuitry--which reduces electrical current leakage in transistors--conserves even more energy, giving you more time away from the wall outlet. With a whopping 6 MB of shared L2 cache, data and instructions can be kept close to the two processor cores, greatly increasing performance and allowing the entire system to work more efficiently. And, because the processor cores share the L2 cache, either can use the entire amount if the other happens to be idle.Your hands have room to spread out on the full-size keyboard with crisp, responsive keys.Hard Drive and MemoryThe 250 GB Serial-ATA (SATA) hard drive (5400 RPM) quickens the pace with a higher speed transfer of data--akin to FireWire and USB 2.0. The 2 GB of PC5300 DDR2 RAM (two SO-DIMMs of 1024 MB) have an industry-leading 667 MHz speed, and the RAM capacity can be increased to 4 GB.Wireless ConnectivityThe built-in 802.11n wireless networking provides up to five times the performance and twice the range of 802.11g, but it's also backward-compatible with 802.11a/b/g routers, enabling you to communicate with the a wide variety of Wi-Fi resources. It works seamlessly with the new AirPort Extreme with 802.11n. Use the built-in Bluetooth wireless technology to connect to your PDA or cell phone, synchronize addresses, or download pictures from your cell phone. You can also use a wireless headset for iChat audio chats and VoIP calls as well as quickly share files with a colleague.Display and GraphicsThe 15.4-inch widescreen TFT display offers a native resolution of 1440 x 900 pixels and an antiglare widescreen display that's perfect for color-minded professionals. The display is backlit by light emitting diodes (LEDs), which gives it a lighter weight and more power efficiency than the cold cathode fluorescent lamps (CCFLs) which most notebooks employ. It's also better for the environment, thanks to its new mercury-free display.Video and graphics are powered by the NVIDIA GeForce 8600M GT card, which is boosted by 512 MB of GDDR3 SDRAM. GDDR3 (Graphics Double Data Rate, version 3) is a graphics card-specific memory technology that's better able to deliver fluid frame rates for even the most advanced games and applications. The GeForce 8600M GT brings a new level of realism to the MacBook Pro with its 16-lane PCI Express architecture, 16x full screen anti-aliasing, 128-bit High Dynamic Range rendering, and a texture fill rate of up to 8.2 billion per second.Video Conferencing with Built-in iSightArtfully placed in the display bezel is an iSight camera, which enables easy video conferencing as well as allows you to snap pictures of yourself and create video podcasts. Using the iChat AV application, video conferencing is integrated into your iChat buddy list, so initiating a video conference is a breeze. iChat also lets you hold audio chats with up to 10 people and provides high-quality audio compression and full-duplex sound so conversation can flow naturally. For video podcasting, you can record a short clip using the iSight camera, then use iWeb to create a video blog entry or post your GarageBand-recorded podcast.Connect to your network, a desktop monitor and all your peripherals with two USB 2.0, one FireWire 400, one FireWire 800, one DVI video output, and one Gigabit Ethernet.Other FeaturesTwo USB 2.0 ports, one FireWire 400, one FireWire 800, ExpressCard/34 slotDVI output port; VGA output using included DVI to VGA adapter8x slot-loading SuperDrive with the following write speeds: 8x DVD&plusmn;R; 4x DVD&plusmn;R DL (double layer); 4x DVD&plusmn;RW; 24x CD-R; 10x CD-RWBacklit keyboard with ambient light sensors for automatic adjustment of keyboard illumination and screen brightnessInternal omnidirectional microphone and built-in speakersCombined optical digital output/headphone out (minijack)Combined optical digital input/audio line in (minijack)60-watt-hour lithium-polymer battery (with integrated charge indicator LEDs) providing up to 6 hours of battery lifeKensington cable lock slotMeasures 14.1 x 9.6 x 1 inches (WxDxH) and weighs 5.4 pounds (including battery)Preloaded with Leopard, you'll enjoy enhanced productivity and a clutter-free desktop (thanks to the redesigned 3-D Dock with Stacks).Preloaded with Leopard and iLife '08The biggest Mac OS X upgrade ever, the Mac OS X 10.5 Leopard operating system features over 300 new features, including:Time Machine, an effortless way to automatically back up everything on a MacA redesigned Finder that lets users quickly browse and share files between multiple MacsQuick Look, a new way to instantly see files without opening an applicationSpaces, an intuitive new feature used to create groups of applications and instantly switch between themA brand new desktop with Stacks, a new way to easily access files from the DockMajor enhancements to Mail and iChatLeopard's new desktop includes the redesigned 3-D Dock with Stacks, a new way to organize files for quick and easy access with just one click. Leopard automatically places web, e-mail and other downloads in a Downloads stack to maintain a clutter-free desktop, and you can instantly fan the contents of this and other Stacks into an elegant arc right from the Dock. The updated Finder includes Cover Flow and a new sidebar with a dramatically simplified way to search for, browse and copy content from any PC or Mac on a local network.Time Machine lets you easily back up all of the data on your Mac, find lost files and even restore all of the software on their Mac. With just a one-click setup, Time Machine automatically keeps an up-to-date copy of everything on the Mac. In the event a file is lost, you can search back through time to find deleted files, applications, photos and other digital media and then instantly restore the file.The MacBook also comes with the iLife '08 suite of applications that make it easy to live the digital life. Use iPhoto to share entire high-res photo albums with anyone who's got an e-mail address. Record your own songs and podcasts with GarageBand. Break into indie filmmaking with iMovie and iDVD. Then take all the stuff you made on your MacBook and share it on the web in one click with iWeb.Included SoftwareMac OS X v10.5 Leopard (includes Time Machine, Quick Look, Spaces, Spotlight, Dashboard, Mail, iChat, Safari, Address Book, QuickTime, iCal, DVD Player, Photo Booth, Front Row, Xcode Developer Tools); iLife '08 (includes iTunes, iPhoto, iMovie, iDVD, iWeb, GarageBand); Microsoft Office 2004 for Mac Test Drive; iWork '08 (30-day trial)Certified Frustration-Free PackagingAmazon.com has certified this product is Frustration Free. A Frustration-Free Package is easy-to-open and comes without hard plastic \"clamshell\" casings, plastic bindings, and wire ties. It's designed to be opened without the use of a box cutter or knife and will protect your product just as well as traditional packaging during shipping. Products with Frustration-Free Packaging can frequently be shipped in their own boxes, without the need for an additional shipping box.Learn moreabout Frustration-Free Packaging.What's in the BoxMacBook Pro, 85W MagSafe Power Adapter, AC wall plug, and power cord, lithium-polymer battery, DVI to VGA adapter, display cleaning cloth, install/restore DVDs, printed and electronic documentation", "title": "Apple MacBook Pro MB134LL/A 15.4-inch Laptop (OLD VERSION)", "imUrl": "http://ecx.images-amazon.com/images/I/41PFaAVktUL._SX300_.jpg", "related": {"also_viewed": ["B002C7446A", "B0017J7T7A", "B002C7458M", "B001P05NKG", "B003GSLU3E", "B002C7489S", "B002QQ8EKO", "B002QQ8H8I", "B00578N1JM", "B004FK3QWK", "B005CWIVYI", "B0047DVVZO", "B003G2ZKLS"], "buy_after_viewing": ["B002QQ8EKO", "B0064YWOQY"]}, "categories": [["Electronics", "Computers & Accessories", "Laptops"]]}