{"asin": "B000WR0CKE", "categories": [["Electronics", "Computers & Accessories", "PDAs, Handhelds & Accessories", "PDAs & Handhelds"]], "description": "Whether you're an IT manager or a mobile professional, you can maximize your business results with an organizer that makes the most of your on-the-go style. HP's powerful iPAQ 211 Enterprise Handheld will run your work applications and a broad range of third-party solutions. Just over 2/3-inch thin and just under 7 ounces light, it fits securely in your hand and you'll be able to see what you're doing, indoors and out, on the big, bright 4-inch touchscreen display.The HP iPAQ 211 Enterprise Handheld features a 4-inch screen, Wi-Fi and Bluetooth connectivity, both SD/SDIO and CompactFlash HC expansion, and Windows Mobile 6 Classic operating system.The SDIO and CompactFlash slots on the top.24-pin connector, mini-USB and 3.5mm headphone jack on the bottom.The iPAQ 211 also offers robust enterprise features such as dual expansion slots for SD/SDIO cards and CompactFlash HC (High Capacity) cards, as well as convenient input/output of headphone, microphone, and voice recordWith the power of the Windows Mobile 6 Classic operating system, you'll stay easily connected to your business and personal data on the go. And you'll stay productive with familiar software tools at your fingertips--Office Mobile includes Word, Excel, and PowerPoint--and bring your important documents and files from your PC with you wherever you roam.This slim, stylish organizer also lets you go online with Wi-Fi to keep your calendar, contacts, and tasks up to date. The integrated Wi-Fi networking makes it easy to access to Internet and email at the office, home or campus, and at other Wi-Fi hotspots at airports, cafes and hotels. Connect to Bluetooth accessories like headsets and keyboards to be more productive--you can even connect to your Bluetooth mobile phone to go online (requires compatible phone and cellular data plan). The Wireless Connection Manager helps you extend your battery life--check your connections and turn them off when you're not using them.The iPaq 111 is also a great mobile entertainment companion, allowing you to listen to your music collection and watch videos with the Windows Media Player Mobile. You can store music and video files on optional Secure Digital (SD) memory cards. You can also view, share, and manage your photos with HP Photosmart Mobile, as well as play pre-installed games or download your favorites from the Internet.Key FeaturesView easily in a variety of environments on the large, 4-inch, TFT touch screenUse familiar applications including Microsoft Word, PowerPoint, and ExcelSynchronize email and data with your PC via mini-USB or an Exchange server with Wi-Fi connectivityStore business-critical information with high-capacity SDIO and CompactFlash expansionUse headphones, a microphone, and other USB devices via convenient in/out portsConnect Bluetooth peripherals such as headsets and keyboards with the Bluetooth 2.0 with Enhanced Data Rate (EDR)Get peace of mind with the one-year limited warrantyRely on HP: the planned three-year product life cycle will support your enterprise testing and deployment effortsSpecificationsWireless: Integrated WiFi (802.11 b/g) with WEP through WPA2-Enterprise (EAP-TLS and PEAP) and WiFi Multimedia) Bluetooth v2.0 with EDROperating system: Microsoft Windows Mobile 6 ClassicMicrosoft programs included: Office Mobile , Office Outlook Mobile, Internet Explorer Mobile, Windows Media Player 10Processor: Marvell PXA310, 624 MHzDisplay: 4-inch transflective TFT RGB color 480 x 640 pixel touch screen with LED backlightMemory: 128 MB SDRAM main memory for running applications; 256 MB flash ROMPower: 2200 mAh lithium-ion rechargeable, user changeable batteryConnectivity: 24 pin connector, mini USB, high-capacity SDIO slot, CompactFlash HC slotAudio: Integrated microphone, receiver, speaker, 3.5mm 4-pin headphone jackHardware buttons: 5-way navigation with press to activate, 4 programmable, voice recorder, power, resetHP exclusive applications: iPAQ Wireless Manager, HP Photosmart Mobile, HP QuickStart Tour, HP iPAQ Setup Assistant, HP Help and Support, Bluetooth Manager, Certificate Enroller, Asset ViewerWarranty One-year parts and labor in most regions; 90 days technical support for software.Dimensions: 5.27 x 2.97 x 0.69 inchesWeight (with battery): 6.7 ouncesWhat's in the BoxHP IPAQ 211, standard 2200 mAh battery, AC Adapter with power cord, sync/charge cable, stylus, slip case, documentation kit, HP iPAQ Companion CDPowered by Windows Mobile 6Microsoft's Windows Mobile 6 Classic updates the Windows Mobile 5 platform with a number of handy features that make searching through email, editing Microsoft Office documents, and staying on top of your most important communications even easier. Emails can now be viewed in their original rich HTML format and now offer the ability to visit embedded links. It also includes Windows Live for Windows Mobile, which provides a full set of Windows Live services, such as the Windows Live Messenger IM application, which now enables you to chat with more than one person at one time or send a file.With Windows Mobile 6, your phone will finally be able to emulate the power and features of your PC's Microsoft Office suite. You'll be able to neatly view, navigate and edit Word documents and Excel spreadsheets in their original formatting--without affecting tables, images or text--as well as view PowerPoint presentations.Microsoft Office Word Mobile features include spell-check, Find and Replace commands, bulleted lists, text formatting, and support for tables for the first time.With Excel Mobile, you&rsquo;re not just confined to editing charts: with the new Chart Wizard you can create charts quickly and easily.PowerPoint Mobile allows you to view the full presentation, rehearse timings, check the order and any live links you may have in your presentation. You can then email comments back to the team or communicate via MSN Messenger for an immediate response.After creating or editing a Word document or Excel spreadsheet, you can synchronize it with your PC and it will automatically be converted to the PC version.All Windows Mobile 6 powered devices include Direct Push Technology for up-to-date email delivery and automatic synchronization of Outlook calendars, tasks and contacts through Microsoft Exchange Server. It also offers a set of important device security and management features that include the capability to remotely wipe all data from a device should it be lost or stolen, helping ensure that confidential information remains that way.", "title": "HP iPAQ 211 Enterprise Handheld (210 Series)", "price": 480.0, "salesRank": {"Electronics": 16028}, "imUrl": "http://ecx.images-amazon.com/images/I/51oNt812EML._SY300_.jpg", "related": {"also_bought": ["B000XMLAI6", "B00330J8KM", "B002PUH6OG", "B00178UWWU", "B0015GFAWQ", "B002JEEIE4", "B002G92BSW", "B0047VKLSO", "B000OLAEHO", "B000VU0CQG", "B0087YCYMI", "B00FIX126K", "B0002X2B8O", "B001CBXY54", "B00BK834H2", "B000X6KDXA", "0072260920", "B002PUH6NC", "B002833G76", "B002MHN4A2", "B004861QA0", "B0006L30YG", "B008IL87Y4", "B000EUJD3G", "B0014BMPH0"], "bought_together": ["B000XMLAI6", "B002PUH6OG"], "buy_after_viewing": ["B00330J8KM", "B000XMLAI6", "B000VU0CQG", "B003JQL920"]}}