{"asin": "B000GHD73Y", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Switches"]], "description": "Expand your wired home network with the D-Link 5-Port 10/100Mbps Desktop Switch. This Desktop Switch fits virtually anywhere because of its compact size. Its power connector and ports are conveniently located in the rear to avoid messy cables on the desk. This Desktop Switch can also be mounted on a wall or underneath a desk with the included wall mounting kit. By connecting this Desktop Switch to your router, you can add up to four more computers to your home network. A game console, printer, print server, Network-Attached Storage (NAS) or Internet camera can also be added. The Desktop Switch receives and forwards traffic seamlessly with its non-blocking wire-speed architecture. Every port simultaneously supports up to 200Mbps of bandwidth, totaling 1Gbps of switching capacity. This Desktop Switch requires no configuration and installation is simple. Whether you are connecting the Desktop Switch to another switch or a computer, there is never a need for crossover cables with Auto-MDI/MDI-X support. Additionally, the Desktop Switch auto-senses if the network device it is connected to is running at 10Mbps or 100Mbps and adjusts accordingly. Equipped with a comprehensive LED display, you can monitor the status and activity of every port at a glance. With outstanding performance, quality, and features packed in a compact sized device, the D-Link 5-Port 10/100Mbps Desktop Switch (DES-1105) is a great selection for expanding your home network.Features and BenefitsEasy to install and even easier to useSuper smooth traffic managementMinimizes bottlenecks, allowing your network to run smoothly even during heavy traffic volumeMonitor the status and activity of every port at a glanceIncredible value and performance", "title": "D-Link DES-1105 5-Port 10/100 Desktop Switch", "price": 25.0, "imUrl": "http://ecx.images-amazon.com/images/I/31G7fBN2DTL._SX300_.jpg", "brand": "D-Link", "related": {"also_viewed": ["B003WOWB5S", "B000FNFSPY", "B003X7TRWE", "B000N99BBC", "B002N17ZSE", "B003X7TRWO", "B003WOWB62", "B003C2QS90", "B002BVQF5A", "B000M2TAN4", "B008BGXZUC", "B0019WDZUU", "B00002EQCW", "B000Q5UMEI", "B006C2DV5G", "B0092KZBCQ", "B00000J4M9", "B0062K5JAI", "B0000BVYT3", "B00006B9H8", "B004TLIVBQ", "B004TLIVB6", "B0034CL3MA", "B001EVGIYG", "B00C83KNSQ", "B0092KZBD0", "B00C2CBBAM", "B00C1DN6ZA", "B00C2DL96W", "B002EP30EM", "B000BC7QMM", "B003L170QC", "B00BZQLBG0", "B00E5I7UAG", "B000FIVDIA", "B003ULOZ5W", "B000JG3ABQ", "B0000AHO92", "B00E5I7T9I", "B00FX38A56", "B0090DX8O8", "B000BCC0LO", "B007KTH73C", "B00BI06G1S", "B0056VP0KS", "B00009X6PH", "B004FMI3DA", "B003CNZ9WG", "B0002A9U7M", "B00C4U030G", "B001AMUI7W", "B00G9BN7TK", "B000FW60FW", "B00A121WN6", "B001CN9K6E", "B000069K98"], "bought_together": ["B00000JDF5"], "buy_after_viewing": ["B003WOWB5S", "B000FNFSPY", "B003X7TRWE", "B000N99BBC"]}}