{"asin": "B0098F5W0Q", "description": "Protect your Amazon Kindle Fire HD 7\" in style! Fintie cases are built from durable PU (synthetic) leather with a soft interior to prevent scratches. Quickly sleep or wake your device with the integrated magnetic auto wake/sleep feature that activates when you open or close the case cover. The case also contains flip capability to readily transform into a horizontal viewing stand. Device insertion could not be simpler, as the interior pocket opens for easy insertion of your device and includes a velcro flap to secure it in place. A smart holder for a stylus/pen comes built-in with every case (stylus NOT included). Cut-outs and openings offer unrestricted access to all ports and controls. Many different colors and styles are available!Instruction:When inserting the Kindle Fire HD7 into the case, please be sure to insert the camera end first so the charging port sits at the spine. One thing also VERY important is that you need to unlock the kindle fire so it can rotate freely.PLEASE NOTE: This case is designed for Kindle Fire HD 7\" 1st Generation (2012 Release) only. It will not fit the original Kindle Fire, Kindle Fire HDx 7 (2013 Release) or All-New Kindle Fire HD 7(2013 Release).This product is sold exclusively by Fintie. Only buy from Fintie to get genuine Fintie(TM) products with manufacturer warranty and superb customer service.", "title": "Fintie Kindle Fire HD 7&quot; (2012 Old Model) Slim Fit Leather Case with Auto Sleep/Wake (will only fit Amazon Kindle Fire HD 7&quot;, Previous Generation) - Orange", "price": 13.99, "imUrl": "http://ecx.images-amazon.com/images/I/51JYkNyAvfL._SY300_.jpg", "related": {"also_bought": ["B00AFKC6KC", "B008THTOKS", "B009G4M20M", "B00C5W16B8", "B008SYWFNA", "B009N8F23A", "B006GWO5WK", "B00951UZPA", "B00951ULKO", "B00AMAKBDE", "B00FP93XIW", "B009GF0K14", "B00FJ8JGIA", "B00G6NSCIM", "B006GWO5NE", "B0074EH1UM", "B009TBTJCG", "B00FIYHGKU", "B00FGH1V0A", "B00BWYQ9YE", "B005QBK5V2", "B005BUXRUO", "B007R6OWGI", "B00DQGIHNW", "B00AXE96X0"], "bought_together": ["B00C5W16B8"], "buy_after_viewing": ["B00C5W16B8", "B00AFKC6KC"]}, "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Cases & Sleeves", "Cases"]]}