{"asin": "B001XURGTO", "description": "From the Manufacturer Offering one of the smallest footprints in a wireless client, the Nfiniti&trade; Wireless-N Ultra Compact USB 2.0 Adapter is a lightweight, compact USB adapter that was made for your active style. When connected, the WLI-UC-GN measures in at a mere half inch, helping to prevent accidental disconnection or damage by virtue of its unique design. The Nfinit&trade; Wireless-N Ultra Compact USB 2.0 Adapter is the ideal choice for those wanting to upgrade their Netbook wireless connectivity to 802.11n or to add wireless connectivity to legacy notebooks.View larger imageView larger imageGet ConnectedWhether you want great range and speed on your Netbook or you&rsquo;re adding a desktop computer to your wireless network, the Nfiniti&trade; Wireless-N Ultra Compact USB 2.0 Adapter WLI-UC-GN is an easy and powerful solution.AirStation OneTouch Secure System (AOSS&trade;)Other advanced features include Buffalo&rsquo;s AirStation One-Touch Secure System (AOSS&trade;) and multiple levels of wireless and wired security. With AOSS, users can easily set up a wireless network with the highest level of security possible. AOSS automatically detects and configures other AOSS enabled wireless devices and clients and seamlessly negotiates the most secure connection possible between your wireless devices.Make it a Matched Set.The Nfiniti&trade; Wireless-N Router & Access Point WHR-G300N is the ideal solution in a home or small office environment to connect your desktop PCs and laptops wirelessly to the internet. Perfect for streaming multimedia content, such as HD movies or music, the Nfiniti&trade; Wireless-N Router lets you download images or send and receive e-mail from multiple PCs with ease.The Nfiniti Wireless-N solutions are backed by a two-year limited warranty and lifetime 24/7 technical support.Key Features and BenefitsWi-Fi CERTIFIED&trade; to ensure compatibility with other certified devicesFaster speed and greater range than standard 802.11gUltra-compact - smaller than a quarterPush-button secure wireless setup with AOSS&trade;Supports WPA2, WPA-PSK (TKIP, AES), and 128/64-bit WEP SecurityUSB 2.0 supportBackward compatible with 802.11g and 802.11bFor best performance, use with a Buffalo Nfiniti Wireless-N Router WHR-G300NWhat&rsquo;s in the BoxNfiniti&trade; Wireless-N Ultra Compact USB 2.0 Adapter, Quick Setup Guide, Setup CD-ROM, and Warranty Statement", "title": "Buffalo Technology Nfiniti Wireless-N Ultra Compact Client USB 2.0 Adapter WLI-UC-GN", "price": 13.99, "imUrl": "http://ecx.images-amazon.com/images/I/31AMgatQaAL._SY300_.jpg", "related": {"buy_after_viewing": ["B003ZM17RA", "B002VFWY9M", "B001P9XHHS", "B002RM08RE"]}, "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Network Adapters", "USB Network Adapters"]]}