{"asin": "B0007XXU3E", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Network Antennas"]], "description": "D-Link introduces the ANT24-0700 Omni-Directional 7dBi Indoor Antenna designed to provide extended coverage for an existing 802.11b/g wireless network. The omni-directional design of the ANT24-0700 offers dramatically increased wireless signal coverage in all directions. With 360&#xB0; of better signal reception, this high-gain antenna will also improve data throughput at further distances. The D-Link ANT24-0700 Omni-Directional 7dBi Indoor Antenna connects to a variety of wireless PCI adapters, wireless routers and access points on the market today. Whether the wireless router or access point has a SMA or TNC connector, the ANT24-0700 comes with a RP-SMA to RP-TNC conversion adapter to accommodate either connector type. For maximum flexibility in placement, the ANT24-0700 comes with a magnetic base unit with 1.5m (4.9 feet) extension cable, and a mounting kit. The magnetic base unit has an incredible strong hold onto any metal surface. Avoid the cost and complexity of adding additional wireless access points or wireless repeaters when you can easily use the ANT24-0700. Enjoy the benefits of wireless connectivity at greater distances throughout your home or small office.Features and BenefitsPowerful signal reception in all directionsWorks with virtually any 802.11b/g compliant devices with a SMA or TNC connectorAnother example of D-Links incredible engineering, quality construction, and reliabilityIncrease signal access in rooms on the opposite end of your house", "title": "D-Link  ANT24-0700 2.4 GHz Omni-Directional 7 dBi Indoor Antenna", "price": 89.0, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/21XKde6UzmL._SY300_.jpg", "related": {"also_bought": ["B00428R89M", "B005C8AYG0", "B00403NC6C", "B000SEQGT2", "B00CHXI44M", "B0085HXUWA", "B000FICJ8S", "B000MAXYHY", "B000EREM6C", "B002FRFB5U", "B000LIFB7S", "B0054MLMLA", "B0039ORBLK", "B000VIA4CA"], "bought_together": ["B00428R89M"], "buy_after_viewing": ["B00403NC6C", "B0034CQSKW", "B004UBUE2O", "B000SEQGT2"]}}