{"asin": "B0014F9U6U", "description": "1080p Up-ConversionBy  interpolating video data using proprietary algorithms, SD format data  is up-converted to 1080 x 1920p HD format video data. This conversion  increases the richness of the original data by almost six fold,  producing the highest possible image quality when viewing content on a  large-screen HDTV.Digital Tuner CapableThe  high-performance hybrid digital tuner is capable of receiving both  digital and analog broadcasts. And even when digital signals drop out  because of interference with direct signal access, which makes the  picture either disappear or become filled with block noise, the Digital  Tuner still produces a beautiful picture.Easy Operation with VIERALink&trade;Connect  your Panasonic DVD recorder to your VIERA flat-panel HDTV via an HDMI  cable, and the TV channel setting information is automatically  downloaded to the recorder. Once the Auto Preset Download is complete,  the DVD recorder will keep whichever TV channel you're watching as its  receiving channel. This means you can record the program you're watching  by just pressing the Record button on the VIERA remote. With  VIERALink&trade;, you don't have to worry about setting the recorder to the  right channel every time you want to record something.Expansion of UsagesThe  Panasonic DMR-EZ48VK DVD recorder is equipped with an SD Memory Card  slot and USB terminal, which makes it easy to view photos from your  digital camera. Just slip the SD card into the slot or use the cable to  connect the camera to the USB terminal, and you're ready to enjoy a  spectacular big-screen slideshow with family and friends. You can even  listen to music recorded onto a USB device while viewing your photos.Universal DesignAll  of our DVD recorder models are designed in compliance with Panasonic's  Universal Design principles. Frequently used buttons (Power, Open/Close)  are located at the top of the main unit to make them easier to see when  the unit is placed in a rack and you need to look down when operating  it. Both the remote control and graphical user interface (GUI) were  designed for easy use by everyone, based on the results of a Panasonic  survey.", "title": "Panasonic DMR-EZ48VP-K 1080p Upconverting VHS DVD Recorder with Built In Tuner", "price": 155.26, "imUrl": "http://ecx.images-amazon.com/images/I/41E70fkxHXL._SX300_.jpg", "related": {"also_bought": ["B00000J1F3", "B00195IURA", "B0014F7Z94", "B002YOKXHU", "B0007PN5MS", "B000ASGFRE", "B000001ON6", "B001T6K7G6", "B009NXOKOM", "B00001OWYM", "B00065L5SU", "B000PGDT8O"], "buy_after_viewing": ["B001T6K7G6", "B0038JECKY", "B008Q60VZ4", "B009WROL6G"]}, "categories": [["Electronics", "Television & Video", "DVD Players & Recorders"]]}