{"asin": "B000H866BM", "description": "Amazon.com Product Description Coming to the United States after making a splash across Europe, the TomTom ONE is a complete portable GPS vehicle navigation device with an incredible range of features. A sleek design, comprehensive wireless capabilities, and a sharp display combine to make the TomTom ONE a vital companion on the road. Like TomTom's other navigation systems, ONE gives you coverage in all fifty of the United States.The TomTom ONE's 3D driving view offers a clear picture of the road and maneuvers ahead.See the ONE in detail.TomTom PLUS services give you the latest traffic and weather conditions. You can also download additional city maps, voices, points of interest, and much more.The device's icon-driven menu system makes using the ONE a snap.View larger.Once you've input your destination, the ONE quickly calculates the best route.View larger.You can even change your route to avoid traffic and roadblocks.View larger.But it's not just the broad geographical coverage that makes the TomTom ONE special. The user-friendly design also puts it a step above other navigation systems. The crystal-clear multicolor display makes for exceptionally easy viewing of maps, routes, driving directions, and other traveling information, such as mileage and distance. Measuring 3.5 inches, the TFT display offers a resolution of 320 x 240 to provide brilliant two- and three-dimensional graphics. The device also features 32 MB RAM and 380 MHz CPU, making it responsive and zippy. Using the USB port and the provided cable, you can use your PC to add your own points of interest.ONE provides clear and accurate turn-by-turn voice instructions, so that you don't have to take your eyes off the road while your vehicle is on the move. Voice instructions are issued at a speed-sensitive volume, so as your vehicle's engine becomes louder or quieter as your speed changes, the volume adjusts itself accordingly, guaranteeing clear and easy listening. And because voice instructions are available in over 30 languages, just about anyone will find the TomTom ONE to be an invaluable system.With its touch-sensitive screen, the TomTom ONE puts programming and operation literally at your fingertips to make sophisticated technology simple. The built-in database offers thousands of points of interest for you to use as destinations or reference points as you plan your trip. ONE will also provide a selection of available routes, giving you the option of avoiding toll roads or choosing between the quickest or the most scenic routes. The database includes zip codes to simplify your route selection, and for extra convenience, the TomTom ONE lets you save the addresses of frequent destinations, making route planning easier and faster than ever. Other display features include a compass mode to assist you with directional orientation, and an anti-glare screen for optimal viewing even in direct sunlight.For additional navigational features to assist with trip planning, the built-in Bluetooth connection provides access to TomTom PLUS subscription-based services, so that you can tune in to the latest traffic and weather conditions, as well as download additional city maps, voices, points of interest, and much more.Weighing less than 10 ounces and measuring 4.33 x 3.5 x 1.34 inches, the TomTom ONE can be easily installed in any vehicle. An included windshield suction mount holds it in place. Plus, with an operating temperature range of an icy -10 degrees to a sweltering 55 degrees Celsius (14 to 131 degrees Fahrenheit), the navigator is durable enough for New England winters or Arizona summers. The TomTom ONE is powered by an internal lithium ion battery that can be charged from your vehicle's cigarette lighter with the included 12-24V adapter.What's in the BoxTomTom ONE device, suction mount, car charger, USB 2.0 data cable, and installation CD with connection software and manual.", "title": "TomTom ONE Portable GPS Vehicle Navigator", "price": 79.99, "imUrl": "http://ecx.images-amazon.com/images/I/51t7trVm4qL._SX300_.jpg", "related": {"also_viewed": ["B000U9WVW6", "B001H9O72K", "B000PCBVA6", "B0014GXCBI", "B001VEJEGK", "B002OL2NT4", "B007M52QR6", "B004J4VYG2", "B003FSTAFK", "B001H9NR2Q", "B004MYFTEW", "B000OH63MI", "B0021L9C0A", "B001VEJEG0", "B0015F1L7A", "B001LK6XHM", "B007M52QEE", "B007M4Z7GO", "B0011ULQNI", "B00160GOR6", "B004W1GQ92", "B0007LJHVA", "B001U0O7QW", "B004J4VYGM", "B003B3P2CY", "B007PPYXOC", "B007M4Z60Q", "B00BHSTWOY", "B00AJXMWP4", "B001U0O7T4", "B003WNOOFE", "B004MYFTFQ", "B000NVZE5M", "B00BHAC85W", "B007M52EXM", "B00HK6CPVY", "B00HTAUEUK", "B0015EWMX8", "B00BIZ0EY8", "B004MYFTEC", "B0057ODG6Y", "B001H9O71Q", "B00C9W1LT6", "B004MYFTFG"], "buy_after_viewing": ["B0057OCDQS", "B0037BVSCI", "B007M52QR6", "B000U9WVW6"]}, "categories": [["Electronics", "GPS & Navigation", "Vehicle GPS"]]}