{"asin": "B00CRZXSGE", "related": {"also_bought": ["B00CRZXUZI", "B00CRZXV16", "B00CV7BX7E", "B00CRZXV3O", "B009WICGWQ", "B001W3MMHI", "B009WICH0M", "B007U7LZQE", "B00CRZXSH8", "B00CRZXV52", "B007U7LZQO", "B00C6SFC5W", "B007U7LZQ4", "B00CI6J1ZO", "B0058CT33K", "B005GJSRAK", "B005ZCY36K", "B001W2WKS0", "B00CG0CL3G", "B0085TZRMY", "B003H5174S", "076967559X", "B007U7M02C", "B001W32F02", "B0089U3VDQ", "B004MWL0J2", "B003H4ZVH8", "B0085TZRNI", "B00555TXMG", "B0038AT564", "B00H9DI8YG", "0887431453", "B004MWP3FO", "B00FPTMJ7I", "B007U7LZOG", "477430705X", "B00AOHDC4A", "B003GIS8TS", "B00C6SFC5C", "B002BJGYJO", "4774307033", "B00B7YJ7NE", "1601591160", "B0036ZBEFG", "B0089U3VPY", "B0085TZRME", "B00CN8AI0E", "B00BRCMYLI", "4774307084", "B000RZTYOG", "B000P9WBLM", "B0044WVH5M", "4774307076", "B007U7M00E", "B003JQV9LG", "B0064MT1NK", "B007U7M0L8", "B007U7M0KE", "B00CP4J7OY", "B00BQYQZZS", "B00DCWM1N2", "B00BRCN9TO", "B00AOHDC6I", "B00HVPR0JG", "B001U7NW20", "B0041CJM6G", "0811860019", "B00AZ2Y2EI", "B003Z6HSL0", "B0038ALXZ0", "B0084BPZO8", "B00134V4I4", "B004MWJLDY", "B002LYD2M6", "B00138UY6I", "B00AHUKP9E", "B00CMCCAH0", "B00F83782M", "B00ASJHKE2", "B002I7N7C6", "B0088LQZOI", "B001TKUXUC", "0316083771", "B004Z7H14M", "B00AOHDC5E", "B001W30E2S", "1620574489", "B00AWVNRUC", "0736430512", "B00HHYF5AC", "B001NFSXIW", "B000ICNR78", "B003GIS8TI", "B005V1GYNA", "0979042038", "B00CRZXS8W", "B004Z7H2EQ", "B00ASJHH68", "B007U7LZOQ", "4774307068"], "also_viewed": ["B00CRZXV3O", "B00CRZXUZI", "B00CV7BX7E", "B00AOHDC4U", "B00CRZXV16", "B00DW1TUY6", "B00CRZXV52", "B00DW1U3CY", "B00GTCKOCM", "B00DSE1ZJK", "B00CG0CL3G", "B00CRZXSH8", "B001W2WKS0", "B00DGXTC2K", "B00H5HFEUM", "B005ZCY36K", "B007U7LZQO", "B007U7LZQ4", "B00GTCKO90", "B004MWN1AS", "B007U7LZOG", "B00CRZXX1Y", "B001W3MMHI", "B00804BEB2", "B0084BQ02E", "B00804BDCM", "B007U7LZQE", "B004MWN0G8", "B0089U3VDQ", "B007U7M0L8", "B00DCWM2ZE", "B003JQV9LG", "B001W32F02", "B0038AT564", "B00804BE8A", "B00FVGVWU0", "B004MWL0J2", "B003H5174S", "B00CRZXWZG", "B00B7YJ7NE", "B00AOHDC5Y", "B00DCWM1N2", "B001W35I8I", "B00D38UBJ6", "B004MWJLDY", "B009WICGWQ", "B003GIS8TS", "B0089RPUH4", "B00AOHDBRI", "B0038AJYSS", "B0089U3VPY", "B00ALB41MQ", "B00CS1WDBI", "B00AK0AC9Y", "B00BP48U6Q", "B0084BPZO8", "B004MWL0H4", "B0084BPZJ8", "B009PLLF9K", "B00CG0CL1S"], "bought_together": ["B00CRZXUZI", "B00CRZXV16"]}, "title": "LeapFrog Learn to Write with Mr. Pencil Stylus &amp; Writing App (works with iPhone 4/4s/5, iPod touch 4G &amp; iPad)", "price": 10.0, "salesRank": {"Toys & Games": 3935}, "imUrl": "http://ecx.images-amazon.com/images/I/51vDRI1f2iL._SY300_.jpg", "brand": "LeapFrog Enterprises", "categories": [["Toys & Games", "Electronics for Kids", "Electronic Toys"]], "description": "Learn how to write letters, numbers and shapes in a new, interactive way with the Mr. Pencil stylus and writing app for your iPad, iPhone and iPod touch.  Enjoy an engaging way to interact with the world of Mr. Pencil while learning to write upper- and lowercase letters, and numbers 1-20 with interactive writing guidance.  Use the easy-grip stylus to unlock more than 85 writing activities in the town of Doodleburg&#x2015;and help Dot and Dash decorate 24 parade floats for Doodleburg&#x2019;s Art Appreciation Day Parade.  Turn your iPhone, iPad or iPod touch into the ultimate learn-to-write tool with the LeapFrog Learn to Write with Mr. Pencil App! Works with iPhone 4/4s/5, iPod touch (4th & 5th generation) and iPad (sold separately). Does not work with LeapPad or Leapster Explorer systems. Appropriate for children ages 3-6 years.Learn to write letters, numbers and shapes with instant accuracy feedback.Use the easy-grip stylus to unlock more than 85 writing activities in the town of Doodleburg.Learning SkillsLearn how to write letters, numbers and shapes in a new, interactive way with the Mr. Pencil Stylus and App. Practice basic handwriting skills with stroke-by-stroke animation and instant accuracy feedback. Unlock exciting animation and interactive rewards by completing writing tasks. Mr. Pencil and the citizens of Doodleburg provide encouragement and support as you learn to master upper- and lowercase letters and numbers 1&#x2013;20, draw 12 simple shapes and lines, and refine basic motor skills. The Mr. Pencil comfort-grip stylus features an innovative, capacitive touch tip designed to glide easily without scratching your device screen. Save and keep track as your child makes strides with the progress tracker feature and reinforce and celebrate those writing milestones!LeapFrog DifferenceLeapFrog has created a learning/play environment that is developmentally appropriate for children ages 3-6 years. The Mr. Pencil Stylus & Writing App helps lay the foundation for handwriting development in a delightfully rewarding environment. \"Learn to Write with Mr. Pencil combines a lovable stylus with an app designed to teach handwriting with stroke-by-stroke animations and instant accuracy feedback. The progress tracker feature allows parents to track their children&#x2019;s writing and reinforce their learning.\"  -Clement C., LeapFrog Learning ExpertInnovative Learning ApproachLearn to Write with Mr. Pencil is an engaging app toy that teaches writing letters, numbers and shapes through interactive games and activities played from your iPhone, iPod touch or iPad (sold separately). Together, they create a learn-to-write tool that helps teach letters, numbers and shapes with a stylus that won&#x2019;t scratch device screens. Parents can enjoy the progress tracker feature that allows them to save and check their child&#x2019;s writing and progress as he or she continues to play the app.What's In The Box?The LeapFrog Learn to Write with Mr. Pencil stylus and Parent Guide & Instruction Book.Check out other LeapFrog App Toys like the Creativity Camera Protective Case & App that turns your iPhone and iPod touch into the ultimate kid-fun camera and creativity center with the included app."}