{"asin": "B00009WNZA", "description": "The Simswas one of the most popular games ever made. In it, players micromanage the lives of a family of virtual people, or Sims, and influence their paths toward success or something akin to a nervous breakdown. Its open-ended blend of cartoonish behavior and everyday living is unique in an art form otherwise obsessed with carnage and sports. WithThe Sims 2, long-time fans now have a deeper game with lots of ways to customize and share their experiences. The game will also attract first-timers because the goal-oriented gameplay and the luridly fun starter families make it easier to get into the action right out of the box.Now Sims are born with the traits of their parents, families grow, and Sims grow old.The People in Your NeighborhoodThe game starts at the neighborhood level. Here you can create a housing development from scratch or start with one of three premade neighborhoods, each with its own theme. From there, you'll settle on a house and a family of Sims to control.Create your own Sim (above) or your own house (below) from scratch with advanced tools.Aside from the basic needs carried over from the previous game, Sims now have aspirations, wants, and fears. The wants and fears are the day-to-day things that occupy their minds, like wanting to see friends or get married and fearing death or being rejected for a kiss. Satisfy their wants, and they become more efficient at completing tasks you assign them. Realize their fears, and Sims become lethargic, cranky, and unresponsive to your commands. Aspirations are the big-picture things, like raising a family, becoming wealthy, and gaining knowledge. Succeed here and you'll be able to buy odd gifts for your Sim to improve his or her life, like a money tree that pays dividends or a \"fountain of youth\" water cooler.What Else Is New?Of course, you wouldn't be able to juggle all that if it weren't for the improved \"Free Will\" option, which makes it easier for Sims to fulfill their basic needs. The artificial intelligence of the game is noticeably improved; they won't turn on radios just as a family member is going to bed but, strangely, they do occasionally put their dishes on the floor.Another big change in the series is the concept of the lifespan. Now Sims are born with the traits of their parents, families grow, and Sims grow old. Not only does this go hand in hand with aspirations (growing up is the first aspiration that a baby Sim will have), it provides a limited time with which your Sims can achieve their goals.The Universal Control Panel helps you manage your Sim family.A Family AffairThe Sims 2not only lets you create just about any type of Sim in any type of family, build elaborate houses, and even create a neighborhood from scratch, but it also allows you to start the gamein medias res, with premade households. These families all have backstories that are smart spoofs of soap-opera plots--lots of scheming, romance, ghosts, and family fighting. Parents of teens shouldn't worry, though, because nudity is tastefully blurred out and \"woo-hoo\" between Sims takes place completely under the covers. The ESRB has given this a Teen rating. IfThe Sims 2were a film, it would likely land between PG and PG-13.The makers have included some nice tools to help share the universe you've created. For example, you can capture in-game stills and video to show friends the private moments, family interactions, and house parties of your Sims. You can even package a household to share as a blog or an album on a special Web site.The Sims 2is for patient gamers. Like life itself, the game is filled with mundane details, like getting ready for work and doing dishes. The game also demands a level of creativity from its players that the run-and-gun game genres wouldn't know what to do with. But those who stick with it will be rewarded with an absorbing, amusing diversion and a virtual family history that they've created themselves.--Porter B. HallSet Up aSims 2Machinima StudioAmazon.com contributor Porter Hall reveals how you can make movies using the Sims as your actors. See his guide tosetting up aSims 2Machinima Studio.", "price": 44.0, "imUrl": "http://ecx.images-amazon.com/images/I/51H5RJZ61FL._SY300_.jpg", "related": {"also_bought": ["B00077VDS4", "B0009E3U4K", "B000GPXS94", "B000KQQUMQ", "B000E52P8Q", "B000PS1HNQ", "B001AIR1F8", "B000CR27OS", "B002SMJ414", "B000040OEI", "B002OPZTHI", "B002IAX4PI", "B001444IN6", "B0019HXJ5Q", "B000VSEF52", "B000TPTCPU", "B000KQ51XA", "B000OPOCB4", "B000EHIXJY", "B000GHK3TA", "B001GGS6VW", "B0012GUAII", "B000N24EO8", "B000O5DY0E", "B00166N6SA", "B000BAVN14", "B000HAWCFE", "B0009RWHSW", "B00004UE0I", "B00005N6ZL", "B00006CRUN", "B007850IM0", "B003WU3CDW", "B003AMOK9M", "B007NUQICE", "B000BMCYB0", "B0054IV0A2", "B004Y3C6RY", "B000HAWCEK", "B006VB2UQ4", "B00009V3KM", "B00008LUMU", "B00006CRVB", "B00000K4MC", "B00C0K4YL4", "B00A39IEMY", "B004UJNN5G", "0761557210", "B002NILFB0", "B006D3JT0U", "B0000ARQMW", "B00C4PCCL4", "B00CTKHYEE", "B008QLUTHO", "B0051MRVHW", "B004DU0XHI", "B0006VSLF4", "B002WF12XK", "B002I0KOLA", "B00BGGIWZM", "B000QAY00A", "B006FBFNBE", "B00005V3TH", "B003TS6Q8A", "B00006GSO0", "B0000A2TPE", "B0050SZ0AW", "B008AT68UE", "B0027C8M8G", "B0000ARQMZ", "B005UI8V6C", "B00CTKHYIA", "B000O5DYFO", "B003KM38EK", "B00AJTPUKW", "B0081QBR7K", "B0000C0YW2", "B008N7TTLS"], "bought_together": ["B00077VDS4", "B000GPXS94"], "buy_after_viewing": ["B000O5DY0E", "B001444IN6", "B002SMJ414", "B002IAX4PI"]}, "salesRank": {"Video Games": 2729}, "categories": [["Video Games", "PC", "Games"]]}