{"asin": "B002JPITXY", "description": "Zune is the premium digital experience that gives you access to the latest in entertainment and technology, allowing you to enjoy, connect, and discover content in a whole new way--the way you like it. Browse, stream, buy, and play all you want, including music, HD video, podcasts, games, and much more. Gain the freedom to enjoy your entertainment. Zune brings your content up front, so you're always in control.Instant entertainment that you control.Click to enlarge.Browse, stream, buy, and play all you want, including music, HD video, podcasts, games, and much more.Click to enlarge.With a 3.3-inch size and vivid 16:9 display, truer and brighter entertainment is at your fingertips.Click to enlarge.Weighs just 2.6 ounces and is only 8.9 mm thick.Click to enlarge.Instant Entertainment that You ControlHD Radio Technology:More Stations, better sound, no feesHD-compatible Video:High-quality video on the go or on your HDTVInternet Browsing:News, email, traffic? It's all in your pocket.OLED Touchscreen:Wide view with a special touchGames:More games, more funZune HDPortable perfectionThe new Zune HD wireless media player takes you closer and connects you to a whole new world of entertainment. With a built-in HD Radio receiver, HD-compatible video, multi-touch navigation, OLED screen, and games, Zune HD delivers the next level in music and video experiences.Zune HD 16 GB: holds up to 5 hours of high-definition video; 24 hours of standard definition video; 4,000 songs; or 25,000 pictures. Available in black.HD Radio TechnologyThe new Zune HD gives you access to many local HD Radio stations with crystal-clear digital sound at no extra cost. Receive additional channels from your local stations and get more of the content you love, including sports, news, and music, in various genres and formats.Like something you hear on HD Radio? Song tagging technology allows you to buy the song if you are connected to a Wi-Fi network or to tag it for later purchase.Click herefor more information about HD Radio.HD-compatible VideoWatch HD movies, TV shows, and more on your HDTV directly from your Zune HD. Just connect via the Zune HD &amp; AV Dock to your HDTV (both sold separately) to watch 720p HD video. The Zune HD also will play your videos on the go in its sharp, brilliant OLED screen. Videos on the player are downscaled to fit the screen at 480 x 272--not HD resolution.QuickplayGet instant access to your stuff with shortcuts to favorites, recently downloaded or played music, videos, and more. Quickplay cuts through the clutter and brings up front the content that you care about most.GamesLoaded with multi-touch and accelerometer, the Zune HD player makes portable gaming even more exciting. Download from Zune's catalog of free games and popular titles--play them all to the sound of your favorite music.OLED TouchscreenGet instant access to your content with multi-touch navigation. With a 3.3-inch size and vivid 16:9 display (480 x 272 resolution), truer and brighter entertainment is at your fingertips.WirelessZune HD allows you to buy, stream, and update your music--and download free games--wirelessly via a Wi-Fi connection. Feeling entangled? Wirelessly sync your Zune HD to your home PC via your home network. You also can stream millions of songs over Wi-Fi directly to your Zune HD and turn it into a portable digital jukebox.Internet BrowsingSurf the web anytime, anywhere you have a Wi-Fi connection. Enjoy your favorite websites with a well-featured web browser, including tap-to-zoom technology, built-in accelerometer, and touchscreen QWERTY keyboard.Zune MarketplaceDownload free Zune software to access Zune Marketplace from your PC. Download or stream new music, rent the latest movies, buy TV shows, and watch free trailers and previews--plus thousands of audio and video podcasts. You also can download from our catalog of free games including classic and other popular titles.Expand Your Entertainment with Xbox 360Zune features movies, TV shows, and more in both high and standard definition. Browse and watch from thousands of titles for rent, or purchase available instantly through Microsoft's Smooth Streaming technology. Buy videos once and watch on multiple screens: on your Xbox 360, Zune player, and PC. See www.xbox.com/live for system requirements. The convenience of on-demand, only on Xbox 360.Accessories (Sold Separately)Zune HD AV DockThis all-in-one package enables Zune HD players to charge, sync, and play supported 720p HD videos on HDTVs. Send music to your home audio systems and control it all via a wireless remote.Zune Premium Car PackCharge and play music, podcasts, and HD Radio stations from your Zune HD while you drive. The FM transmitter/car charger auto-seeks the best available frequency on your car stereo. A USB port located on the transmitter/car charger allows you to charge a second Zune player simultaneously.Zune Sync CableCharge your Zune player and sync with your collection on your PC.Zune Charge PackThe Zune AC Adapter fast-charges your Zune player up to 70% within an hour. Folding blades make it easy to travel with. Use the included USB cable to sync with a PC.Zune Power PackConnect your AV cable to your docked Zune HD to play music, HD Radio broadcasts, and audio podcasts through your home audio system. The HDMI cable connects your docked Zune HD to HDTVs to view movies and videos. Also includes Zune AC Adapter; Zune HD player and Zune HD AV Dock sold separately.Zune Sync DockConnect to your PC and sync your collection while you charge your Zune in style. Control from a distance with the included wireless remote, which gives you full access to your Zune player from anywhere in the room.", "title": "Zune HD 16 GB Video MP3 Player (Black)", "price": 93.99, "imUrl": "http://ecx.images-amazon.com/images/I/31PxMUF9S-L._SY300_.jpg", "related": {"also_bought": ["B002SKVYZA", "B002WB433U", "B003JYZE0A", "B00308O75S", "B000VWOKQM", "B000IXNEI4", "B002JPITYS", "B000VWPULQ", "B002JPITZ2", "B002URXRI8", "B003D2DUZ4", "B003OOBH56", "B000MUBEDU", "B000IXQPJO", "B002YT5THY", "B006R6CT1O", "B000VWOKRG", "B002TKJ2G2", "B002RWJDPC", "B003MJQX0W", "B000IXP96Y", "B00308CRDM", "B000VWKSHM", "B000IXP946", "B004798MKA", "B0037T4WIM", "B000IXP932", "B002YE0P6E", "B000H0QDCC", "B00166QHKE", "B000EPLP3C", "B001EQ0HAW", "B00ADF0WDW", "B000WFZSBE", "B0017HEZDS", "B002RL8VB0", "B000OP8BVG", "B00176AX6W", "B000IXQPNK", "B001XYBWXQ", "B000WG6XW6", "B000IXLHOM", "B002SNCSKC", "B002VD4FSW", "B006Y3IKSQ", "B007M6EYU2"], "buy_after_viewing": ["B00ECQUY2M", "B002MAPS6W", "B002MAPT7U", "B000VWPULQ"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}