{"asin": "B003KPBRRW", "related": {"also_bought": ["B000V1PB2K", "B000V1LX4A", "B005H1A2BE", "B00JHJPRMG", "B00B981F1U", "B004UAKCS6", "B007CO5DZ4", "B00CALM2JY", "B00BWQBKWI", "B00BIPE8WM", "B00IKMJWY0", "B000V1LX4K", "B009FU8BTI", "B00BKXCKRC", "B006U3O566", "B005QBXG18", "B00CALM2KS", "B0046HMI94", "B004NNULYU", "B00B7X2OV2", "B002DVWNK4", "B003IKNJRU", "B003FW0WIK", "B001PS9E5I", "1890087475", "B00KWHMR6G", "B003UNK3J2", "B003UNK3I8", "B007Q87KP2", "B0056VP0KS", "B006OOKT3Y", "B000FJ89UO", "B002YHV7MC", "B004HIGV5O", "B00C4U030G", "B001EJ3DOG", "B008I64CC0", "B00IKMJE0M", "B003CFATT2", "B005H4CDF4", "B004XXMUCQ", "B003FVYXY0", "B009SPNLUE", "B002CT0822", "B000M2TAN4", "B00006I9ZT", "B008HO9D7M", "B00HC2XTMA", "B0000AI0N1", "B0052SCU8U", "B004PFJYNA", "B00005111L", "B00C2CBBAM", "B002XITVCK", "B000CRFOMK", "B00C2DLI9A", "B003EE12EC", "B000N20668", "B00IKMJ9B6", "B00CPRVF5K", "B005SHQ644", "B00EORV53G", "B0000BVYT3", "B00H09BOXQ", "B003Y24DEU", "B0036TGGW8", "B000J2EN4S", "B00B3X72OU", "B00B7X2OTY", "B00870ZHCQ", "B004C3ZPEW", "B00006RVPW", "B001UI4RTG", "B000P9SXTG", "B009SPWJ98", "B001EUE808", "B0019804U8", "B0002DJU0G", "B003L1ZYYM", "B00FB45SI4", "B00429N192", "B003XM73P2", "B0002KVQBA", "B000UD4LIY", "B007ED7V7G", "B005EORRBW", "B004Q7K3XM", "B0000DD6C2", "B00002EQCW", "B00APEG9M4", "B001202C44", "B000JV3CKA", "B004LT2C5W", "B005LJQM3Y", "B00F0H88SY", "B00870ZLJ0", "B00004Z5M1", "B00IJU0K2Q"], "bought_together": ["B000V1PB2K", "B000V1LX4A"], "buy_after_viewing": ["B007CO5DZ4", "B004UAKCS6", "B00E9CEBZU", "B00FRMAOIO"]}, "title": "NETGEAR Universal N300 Wi-Fi to Ethernet Adapter (WNCE2001)", "price": 54.79, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41V54jsfAjL._SY300_.jpg", "brand": "Netgear", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Network Adapters", "USB Network Adapters"]], "description": "Connect any Ethernet-enabled device to your wireless home network with the NETGEAR WNCE2001 Universal WiFi Internet Adapter. The adapter is perfect for home theater devices such as the Xbox 360, PS3, TiVo, Blu-ray player, and more. And thanks to its elegant, compact design, you'll save space and have a lot of flexibility in choosing where to place it.Universal WiFi Internet AdapterAt a Glance:Adds wireless capability to any Ethernet-enabled deviceWorks with Xbox 360, PlayStation 3, TiVo, Internet-enabled TVs, and moreWireless-N for fast performancePush 'N' Connect provides easy securityThe easy-to-setup WNCE2001 brings wireless-N capability to any Ethernet-enabled device.View larger.Dynamic LEDs display real-time network connection status.View larger.Wireless Connectivity for Your Ethernet-Enabled DevicesMore and more of today's home theater devices are Ethernet enabled, including TiVo, VUDU, Blu-ray players, Xbox 360, PlayStation 3, Internet TVs, and more. With this NETGEAR adapter, you'll be able to cut the cord and use a wireless connection to network your devices.Universal CompatibilityWith the WNCE2001 Universal WiFi Internet Adapter, you will no longer need to buy individual proprietary WiFi dongles for the TV, Xbox, etc. because WNCE2001 works with all of them. You can simply plug it into the device when you need to and share it among multiple gadgets.Wireless-N Technology for Fast PerformanceThe WNCE2001 adapter supports Wireless-N (2.4 GHz 802.11n) technology for outstanding speed and performance, keeping pace with your home theater devices. In addition, it is also backwards compatible with 802.11g and 802.11b networks.The adapter can also repeat 2.4 GHz WiFi signals from devices made by NETGEAR and other brands, and it features dynamic LEDs that display real-time network connection status.Push 'N' Connect for Easy SecuritySetting up a secure connection couldn't be easier with NETGEAR's Push 'N' Connect technology. Push 'N' Connect using WiFi Protected Setup (WPS) offers true plug-and-play simplicity by requiring you to simply push the Push 'N' Connect button on your router. In addition, the adapter also supports WiFi Protected Access (WPA2-PSK, WPA-PSK) and WEP encryption.Compact, Smart Design Can Use USB for PowerThe Universal WiFi Internet Adapter is a compact device that measures just 3.2 x 2.4 x 0.7 inches, giving you flexibility in choosing where to place it. In addition, the adapter can be powered by either the included power adapter or with the USB port. By using the USB port, you can avoid using an additional power outlet, and reduce exposed wires in your home.The NETGEAR WNCE2001 Universal WiFi Internet Adapter works with Windows 7/Vista/XP/2000, Mac OS, UNIX, or Linux. It is backed by a one-year warranty.What's in the BoxUniversal WiFi Internet Adapter (WNCE2001), power adapter, and mounting kit.Related NETGEAR Products to Enhance Your ExperienceNETGEAR RangeMax Dual Band Wireless-N Gigabit Router (WNDR3700)Top-of-the line router, ideal for serious gamers, videophiles, and small businesses demanding high performanceDual-band Wireless-N operates simultaneously on 2.4 and 5.0 GHz frequencies for highest throughput speed and performance600 Mbps speed, with real throughput of over 350 Mbps&nbsp;NETGEAR RangeMax Dual Band Wireless-N Router (WNDR3300)Wireless N dual band router operates on both 5 GHz and 2.4-GHz bands for optimal performanceBackwards compatible with Wireless-G devicesQuality of Service for automatic prioritization of tasksNETGEAR RangeMax Wireless-N Gigabit Router with USB (WNR3500L)Open-source and customizable Wireless-N routerFast performance with a 480 MHz processor and 64 MB RAMReadyShare lets you easily share storage via built-inUSB portFour wired Gigabit Ethernet ports&nbsp;NETGEAR Wireless-N Router (WNR2000)Provides blazing fast Wireless-N networksIs backwards compatible with older Wireless-G networksHas push-button connectivityAutomatically configures your router for virtually all ISP connectionsNETGEAR RangeMax 150 Wireless Router (WNR1000)Wireless-N technology for great speed and coverageBackwards compatible with 802.11b/g devicesFour 10/100 ports for fast wired connections&nbsp;NETGEAR Wireless-G Router (WGR614)Wireless-G provides speeds up to 54 MbpsFour 10/100 ports for fast wired connectionsConfigurable network security including double wirewall"}