{"asin": "B000FKKWVM", "description": "Serious professional photographers who demand one of the fastest, most rugged, and most durable memory cards on the market should choose the SanDisk Extreme III SD card. Built to work under the most challenging conditions, with SanDisk Extreme III you&#x92;ll get more speed, better performance, and unmatched reliability.That&#x92;s because only SanDisk Extreme III memory cards feature innovative ESP Technology for the fastest speeds and highest performance. ESP stands for \"Enhanced Super-Parallel Processing\". Simply put, it means you are getting the fastest read/write speeds available &#x96; an amazing minimum 20MB per second sequential read and write speed &#x96; speed you&#x92;ll definitely appreciate whenever you find yourself shooting and storing pictures in harsh environments, extreme temperatures or at high altitudes.Every SanDisk Extreme III SD card comes with RescuePRO so you can recover images, documents, mail, video, music &#x96; just about any digital file, with ease. Built with leading-edge media recovery algorithms, RescuePRO lets you preview recoverable data before you try to retrieve it. With RescuePro&#x92;s unique recovery algorithm for MPEG audio and MPEG video recovery (MPEG-1/2/3) what you see, and what you hear, is what you can recover.Advanced Features:Designed to meet the critical speed and performance needs of serious professional photographers&#x97;lets you quickly capture, view, upload and transfer large image filesIdeal for demanding photo shoots under severe weather conditions&#x97;heat, cold, wind, rain, snow, etc.Built to perform in the most extreme environments and temperatures&#x97;from -13 to 185 degrees FMin 20MB/second sequential read and writeDurable, reliable and thoroughly tested&#x97;temperature tested (heat and cold); shock and vibration testedData recovery software&#x97;ensures your photos will always be there (even if you delete them accidentally)Dedicated, priority technical support hotline for direct customers of SanDisk Extreme productsIncluded travel case keeps your memory cards organizedLifetime limited warranty", "title": "SanDisk 2 GB SDSDX3-2048-901 Extreme III SD Memory Card (Retail Package)", "price": 21.88, "imUrl": "http://ecx.images-amazon.com/images/I/51YDM35R8ZL._SY300_.jpg", "related": {"also_bought": ["B000E7WMOQ"], "buy_after_viewing": ["B00154CV6G", "B000E7WMOQ", "B007M54E08", "B007M54E1M"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Memory Cards", "Memory Sticks"]]}