{"asin": "B003O6G1L4", "description": "For centuries legionnaires have protected the nation of Ehb until they were betrayed and all but driven to the brink of extinction. Now that evil has returned to Ehb the people turn to the few remaining Legionnaires for the protection of the past . As an heir to the legion will you accept this plea for help? How it will all be resolved is up to you!View largerView largerView largerDungeon Siege 3is an Action RPG that seamlessly blends intuitive fast-paced gameplay, a robust RPG system featuring a large selection of abilities, loot galore and the depth of story Square Enix and Obsidian Entertainment are known for creating. Players will be able to adventure by themselves, on the couch with friends, or online in a fully multiplayer experience.View largerView largerView largerView largerLucas MontbarronLucas Montbarron is the son of the former Grand Master of the Legion. He is the last of a noble and respected line. Raised in a series of safehouses by families loyal to his father's memory, Lucas will not rest until the Legion is rebuilt, and his family's honor is restored. Lucas has been taught the art of combat in the ancient and deadly style of the Legion. Lucas is a skilled swordsman, and a master of two combat stances. He can fight with a sword and shield, which allows him to attack quickly, deal heavy damage, and interrupt and stun single targets. When outnumbered, he wields a massive two-handed sword. While slower to swing and less practical for one-on-one combat, it can strike multiple foes and knock them back, making it an ideal weapon for crowd control.AnjaliAnjali is an archon - a legend, come to life. In the old stories, archons were spirits of fire, who served the long-lost creator gods. But Anjali was raised by friends of the Legion, and she does not know how she came to this world, or what happened to the others of her kind.Anjali can shift freely between her human form and an incarnation of elemental fire. In human form, she fights with a staff or a spear, allowing her to fend off multiple attackers while leaping in and out of the fray. In her fiery incarnation, she can hurl bolts of flame at ranged targets, flood areas with heat and fire, or inflict searing wounds that injure her foes over time.KatarinaKatarina is the daughter of a Legion commander and a Lescanzi witch. Her mother's people are nomads and wanderers, skilled in both warfare and magic, Katarina has been trained in their ways. At long range, she fights with ensorcelled bullets and deadly curses. When foes get close, they fare no better, as they come face-to-muzzle with her pistol and her shotgun &ndash; or perhaps the jaws of her faithful black hound. Katarina is mischievous and unpredictable, but she is also devoted to the Legion's cause...ReinhartReinhart descended from a great line of Legion mages, but he spent most of his life in Stonebridge, studying magic at the Collegium. As a scholar of arcane magic, Reinhart bends the forces of creation and destruction to his will. He can channel Dynamic magic through his gauntlet, shocking or stunning his foes. Or he can use Entropic magic to warp time and space, destroying large numbers of enemies from afar. Reinhart is known for his unconventional thinking and innovative magical techniques...and for his eccentricity, too.", "price": 9.98, "imUrl": "http://ecx.images-amazon.com/images/I/619lJBq8%2BJL._SY300_.jpg", "related": {"also_bought": ["B0021TVYCG", "B001BTPRKC", "B003FBL85M", "B000HCJD68", "0307890376", "B0047TLIBU", "B0044SA734", "B004A87506", "B002I0J6KU", "B003DNLDUC", "B000G7X5Q8", "B0057PERNE", "B004WL4LOY", "B00B59MXGY", "B001D7T2VC", "B00KAEITQ8", "B00BGA9V2Q", "B000ZK695U", "B00J22636W", "B00KS7UF96", "B0056WJA6M", "B002I0J4AM", "B002BRZ744", "B00KM66W54", "B000K9OR4Q", "B0014QAO4Q", "B007FMSH4M", "B00319DX4M", "B001IK5TJI", "B004NRN5EO", "B005185SDA", "B0045ZIEPY", "B0032LTVX6", "B004ML44Y6", "B00K5UZMJO", "B003P9FRGA", "B00JUFT3HW", "B009VURUYE", "B007V9QKH0", "B002AB7TX8", "B002BXJ9VA", "B00J226358", "B00KVR4HEC", "B004EW948E", "B00KWEHBAG", "B003DLQTYY", "B0016GC9D8", "B001UWGCW2", "B006Y76HXM", "B000K9OP2A", "B00320J6W8", "B001NX6GBK", "B002DC8GKO", "B00KF7BEFS", "B005C2D1YI", "B004LWEK7C", "B003GT8IL0", "B001CBW18U", "B007UM599S", "B005TH6BD4", "B00JUFT3I6", "B00GLZQR96", "B003A6X0H6", "B00354NANC", "B002BRYIJY", "B00320JAWY", "B00576U7W8", "B000UW1YBW", "B002I0K5NC", "B000R3CIV4", "B0050SX9VO", "B003O6HDRU", "B00CJ7IUI6", "B000TVT7U4", "B008XMSR6G", "B0023CBZ70", "B002I0J6DC", "B00IODWOQS", "B006GVLNV2", "B0030GBU2I", "B000FQ2DTA", "B0043QQNXK", "B004FYJFNA", "B004HYK8Y8", "B009VURQDE", "B000KLNLUK", "B00GMFKYK8", "B004L9YS22", "B0050SXZ7W", "B005VBVQDI", "B001ASJIS6", "B0016C3260", "B003O6E6EI", "B000XJM2AE", "B003S2MXQG", "B0050SXGU8", "B004FS8LYK", "B004BCZLQ6", "B000WCT1KQ"], "bought_together": ["B0021TVYCG", "B0044SA734"], "buy_after_viewing": ["B0044SA734", "B0047TLIBU", "B00BGA9V2Q", "B00B59MXGY"]}, "salesRank": {"Video Games": 4304}, "categories": [["Video Games", "PlayStation 3", "Games"]]}