{"asin": "B000MUW98O", "description": "InBurnout Paradiseplayers are treated to a rarity in the video games universe: a complete reinvention of an established franchise that equals, if not betters any of the previous games in the series. Yes, this is a large claim, but one that can be explained in a single phrase: Next-Gen Freedom.Driver's heaven is a wide open worldIn Paradise City even cars can fly.View larger.Go for broke in 'Marked Man' Mode.View larger.Nothing is off limits, even head-on crashes.View larger.Start a race any time with 'Easy Drive.'View larger.Although theBurnoutseries&#146; over the top mobile action has been its calling card since it ignited audiences on the PS2 in 2001, and later on the first generation Xbox console,Burnout Paradiseis the first game in the series that has been designed specifically for play on Next Generation consoles. This has allowed game developer Criterion to rip the training wheels off the game and rebuild it from scratch. The result is a new, expansive world that players can roll through at will. And what a world it is.Enter Paradise CityHeaven on Earth, at least to road-raging, crash-causingBurnoutfanatics, Paradise City is your domain and ultimate proving ground inBurnout Paradise. This expansive driver&#146;s playground stretches across 250 miles and encompasses all sorts of road driving conditions, from fun-in-the-sun seaside cruising boulevards, to mountain roads and downtown gridlock. But regardless of what stretch of asphalt you find yourself on, the beauty of this place is that nothing is blocked off and your wits are at least as important as the horsepower under your hood when it comes to racing here. Check out Paradise City&#146;s five sub areas (click the links for sample images):Downtown Paradise CityHarbor TownPalm Bay HeightsSilver LakeWhite MountainBurnout Your WayUnlike in previousBurnoutgames,Burnout Paradisenot only puts the keys to your ride in your hands, but places you squarely in the driver&#146;s seat when it comes to where you can go and what you can do.Along with wide avenues and crowded highways, the open game design of Paradise City is also jammed full of hidden side streets, back roads and alley ways. These can be used as short cuts in races, that is, if you know where they are. As you explore, commit these potential short cuts to memory because they will definitely come in handy in a tight race. And since we are talkingBurnouthere, players should not expect uneventful, genteel contests of speed and precision driving. In Paradise City players are always free to slam, shunt and wreck opponents in their bids for supremacy and they will. Also, new to theBurnoutseries, races can now start anywhere, anytime. Just pull up to a stoplight and spin your wheels to start one in one of five different event classes:Classic RaceRoad RageBurning RouteStunt Run (new)Marked Man (new)Instant OnlineBurnout Paradisealso keeps the mobile carnage coming while simultaneously setting the new standard in online social gameplay. With the new &#145;Easy Drive&#146; feature you can find friends online and with the click of a button invite them to a race. Once they&#146;ve accepted the race will start immediately. That's right, no more annoying wait times at online lobbies and servers. And keeping in touch with friends is easier than ever.Team up or TakedownIn the winner-take-all universe ofBurnoutteaming up usually isn&#146;t the first option that comes to mind, but on these rough and tumble streets it's a good option to keep in mind. With more than 300 FreeBurn Challenges packed into the game, players always have the choice of going it alone against the field as a whole or joining forces with up to seven of your buddies in user-created race routes. Either way, if you are victorious in your takedown you'll get the chance to talk some trash as you exchange Mugshots with your victim via an optional camera hooked to your gaming system or your gamertag/PSN avatar if you prefer to keep your identity on the down-low.Showtime: Crash Anywhere, Any TimeAnd finally since a newBurnoutrelease wouldn't be complete without a little something special in the wreckage department,Burnout Paradisecontinues the carnage with an update of its familiar 'Crash Mode.' Renamed 'Showtime Mode,' players can now crash, bounce and scatter their ride in any location and replay the wreckage over and over in slow motion. One of the most addictive and down right fun features of the game, players activate the mode by simply pulling both triggers on their controller and if they are good enough can also immortalize their Showtime moments on the leaderboards for all to see.Driving fans this is Next-Gen at its best and definitely theBurnouttitle you have been waiting for.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51gog06lURL._SY300_.jpg", "related": {"also_bought": ["B002MED6EO", "B0050SWSQQ", "B003O6ECOM", "B002ACFYUM", "B003R7H5TC", "B000JLIYLC", "B003O65TXU", "B000HCMR8E", "B003O680ZY", "B000RI17CA", "B00488PZ2S", "B000930DIM", "B001TORSHO", "B000JHMJDA", "B00149V3CU", "B0002IQC8E", "B004Q8L46G", "B001G33V8S", "B000FPOJOS", "B00CTKHZH0", "B0012N5MIO", "B004X56PWK", "B0017ZIIK6", "B0093FO2TS", "B002I0K6Q8", "B002AQLQM8", "B000FII8KQ", "B006JKARN0", "B000OCXK6K", "B0050SXJJG", "B009GZX49Y", "B00CMC6HCY", "B00170BV6E", "B00JQHU9RC", "B002BRZ7JE", "B00EV0IIV8", "B003O6E3C8", "B003MUNFW0", "B008CP6RWU", "B00CRL9TU2", "B000IONGWW", "B001811BTO", "B002I0K5W8", "B008YTAJLO", "B000WS97QI", "B006KYYOSO", "B009GWLSFY", "B004M8M30G", "B001AZFSEW", "B003O680RM", "B003ESHRL0", "B004P8CKS8", "B0016GABR4", "B000HCJD68", "B00BU7WVCM", "B001OAKV1S", "B000K9OR4Q", "B000WJFZEA", "B000ZK7ZMQ", "B002QHDKB6", "B001UEN68I"], "bought_together": ["B002MED6EO", "B003O6ECOM"], "buy_after_viewing": ["B002MED6EO", "B003O65TXU", "B006JKARN0", "B0050SWSQQ"]}, "salesRank": {"Video Games": 1714}, "categories": [["Video Games", "Kids & Family", "PlayStation 3", "Games"], ["Video Games", "PlayStation 3", "Games"]]}