{"asin": "B001RCTA8I", "categories": [["Electronics", "Computers & Accessories", "Data Storage", "USB Flash Drives"]], "description": "Verbatim&rsquo;s TUFF-&lsquo;N&rsquo;-TINY&trade; USB drive offers secure storage in one of the most compact, durable USB flash drives available.&nbsp; Resistant to everyday handling, dust, moisture and static discharges, Verbatim&rsquo;s TUFF-&rsquo;N&rsquo;-TINY&trade; USB drive is small enough and tough enough to handle all the thrills and spills of modern life. Just drag and drop your folders and files...everything from presentations and documents to photos and video clips..&nbsp; It&rsquo;s compatible with Windows PCs and Macs and can be used with all USB ports. The TUFF-&lsquo;N&rsquo;-TINY&trade; USB drive comes with key ring lanyard to attach to mobile phones or key rings.Rugged design is water resistant.&nbsp;View largerSystem in Package (SIP) technology enclosure resists dust and dirt.&nbsp;View largerFeaturesSize:&nbsp;The TUFF-&lsquo;N&rsquo;-TINY&trade; USB drive measures about 1 inch long, a half inch wide, and is about the thickness of a penny!Durability:&nbsp;This drive is designed for the rigors of everyday use and is resistant to dust, water and static discharges.Compatibility:&nbsp;Compatible with Windows PCs and Macs, this USB drive is also compatible with all USB connections.Capacity:The TUFF-&lsquo;N&rsquo;-TINY&trade; drive comes in 5 capacity sizes: 2 GB, 4 GB, 8 GB, 16 GB and 32 GB.Attaches easily to a key ring or fits conveniently in your wallet.&nbsp;View largerAbout Verbatim&nbsp;For 40 years, Verbatim has been providing technology you can trust with an impressive selection of removable storage media and computer peripherals, including a wide range of CD, DVD and High Definition video products. Verbatim also offers an array of lightning fast desktop and portable hard drives, USB flash drives, stylish, feature-rich mice and keyboards, and a broad range of replacement laser toner cartridges. Buy Verbatim and you get innovation, security, and reliability &ndash; and that means peace of mind.Lifetime WarrantyVerbatim&rsquo;s USB drives are fully backed by a Limited Lifetime Warranty. If you experience technical issues that out support team cannot resolve--rest assured we&rsquo;ll replace thedrive! Verbatim stands behind the quality of our products--we&rsquo;ve done sofor over 40 years!A Greener Shade Of BlueConsumers choose to spend their money in more eco-conscious ways, and Verbatim gives them the option to get high-tech without being highly wasteful. Verbatim&rsquo;s new packaging for USB drives and Memory Cards is greener than ever. Our new package design reduces the amount of plastic used by up to 93.9% on Memory Cards and 90.9% on USB drives by substituting paperboard material for the plastic clamshell. Now, the only plastic part of our packaging surrounds the product, thus optimizing the use of renewable resources and keeping un-necessary plastic out of landfills.Material ComponentsThe paperboard structure is MWV Natralock&trade; material. This offers greater sustainability and also greater security and safety than a traditional clamshell package. A tear-resistant layer requires scissors to open but won&rsquo;t cut the consumer with sharp edges.These packages offer additional benefits that are a side-effect of going green. They are designed to withstand over 25-lbs. of downward pressure without tearing--which also ensures the packaging cannot be torn off a display hook. Verbatim used this redesign opportunity to eliminate the plastic case previously included with Memory Cards. Since most consumers discarded the case, all unnecessary elements have been eliminated.More Green Packaging BenefitsVerbatim now adds an icon to packaging meeting our &ldquo;More Green&rdquo; standards; we want to highlight the environmental benefits of this new packaging structure to customers and the industry alike. Look for the &ldquo;More Green&rdquo; logo on Verbatim products as well as the specific benefits on the back.Plastic reduction up to 93.9%*Overall packaging weight reduction up to 54.7%Almost double the freight efficiencyMaterial health increase of up to 274% (carcinogen material reduction by gram)Safer for consumers - No sharp edges!*2009 COMPASS analysis of packaging material systems. Results differ by procut.", "title": "Verbatim TUFF 'N' TINY 4 GB USB 2.0 Flash Drive, Green 96815", "price": 12.67, "imUrl": "http://ecx.images-amazon.com/images/I/41OKpPSZ2WL._SY300_.jpg", "brand": "Verbatim", "related": {"also_bought": ["B004896ZE4", "B004BLIQFU", "B007LLYBVK", "B004BLIQE6", "B007IOHPKY", "B0062IM9EY", "B009FWMZ2K", "B006W8U2MU"], "bought_together": ["B004896ZE4"], "buy_after_viewing": ["B004896ZE4", "B00DYQYJ3Q", "B005FYNSZA", "B00DYQYITG"]}}