{"asin": "B001O94GNS", "categories": [["Electronics", "Camera & Photo", "Video", "Camcorders"]], "description": "Ultra OverviewEasy-to-use, pocket-sized camcorder featuring one-touch recording and digital zoomSimple user interface lets you start capturing video just seconds after powering onCaptures 120 minutes of full-VGA-quality video on 4GB of built-in memory; no tapes or additional memory cards requiredConvenient flip-out USB arm plugs directly into your PC or Mac to launch FlipShare softwarePre-installed FlipShare software lets you easily email videos, edit individual clips, make custom movies, capture still photos from video, and even upload video to sharing sites like YouTube and MySpaceFlipShare&rsquo;s advanced compression technology allows for quick and easy sharing of high-quality video in compact-sized files (via email or publishing online)Large 2-inch anti-glare color LCD screen to play back and delete videosWatch videos instantly on TV with included connector cablePowered by standard AA batteries (included); also supported by rechargeable Flip Video Battery Pack (not included)Video: Full VGA at 30 frames per second (fps) progressive scan; recorded as MP4 filesUltra HighlightsIt&rsquo;s the Camcorder, UncomplicatedThe Flip Ultra camcorder makes it easier than ever to shoot and share video. Ultra features Flip Video&rsquo;s signature shoot-and-share simplicity: just power on and press record to start capturing high-quality video in seconds.Ultra-Spontaneous, Ultra-FunWith 120 minutes of record time, you&rsquo;ll never miss another minute again. And because it&rsquo;s super-portable, Ultra lets you capture spontaneous video anytime, anywhere. Whether it&rsquo;s a busy evening at your kids&rsquo; soccer match; a weekend camping trip; or simply an unplanned, everyday event, your Ultra will let you capture the moment. So you never have to say, \"You should have been there.\"Incredible QualityWhile it may be small, Flip Ultra packs a big punch. Ultra produces video that rivals that of far more expensive camcorders. Its 4 GB of built-in memory lets you capture 120 minutes of crystal-clear video, even in low-light situations. Premier AAC audio compression means your videos will sound crisper than ever, too. The included connector cable makes it incredibly easy to watch your videos on your TV.Pre-Installed FlipShare SoftwareUltra comes pre-loaded withFlipShare software, which makes it easy to organize, create and share your videos:Organize your videos.Drag and drop your videos into folders you've created, or use the automatic date-stamped folders.Create custom movies.Make movies featuring your favorite video clips, and add your own music to provide a more personal touch.Capture still-image snapshots.Use enhanced freeze-frame capabilities to grab a snapshot from any of the thirty frames that comprise each second of your video.Share privately.Send videos to your friends and family using attachment-free emails. Or create private Flip Channels to share your videos with specific groups of friends and family.Share with the world.Publish your videos directly to Facebook, YouTube and other sites, all with the click of a button.Recommended Companion Products and Accessories:", "title": "Flip Ultra Video Camera - White, 4 GB, 2 Hours (2nd Generation)", "price": 369.99, "salesRank": {"Camera &amp; Photo": 1261}, "imUrl": "http://ecx.images-amazon.com/images/I/31mz1qlqGPL._SY300_.jpg", "related": {"also_bought": ["B000VJRUKS", "B001B5CVNC", "B002DM6W2I", "B0041LXANI", "B00272MT3A", "B0040702IE", "B0023B14TK", "B00272MT3U", "B0019I2AYG", "B0040702HA", "B0023B14TU", "B00009RUCH", "B0040702HK", "B001U5R9YE", "B0040702HU", "B002OT4NN0", "B004IIZY9W", "B003ZHV978", "B002R5AM7W", "B002R5AM7C", "B0043D4V8M", "0486433811"], "buy_after_viewing": ["B0023B14TK", "B0040702HA", "B0040702IE", "B00272MT3A"]}}