{"asin": "B000QJ3DZE", "description": "Hyper-fast scrolling and laser precision.Fly through   even the longest documents in mere seconds with a revolutionary hyper-fast   scroll wheel that shifts to precise, click-to-click scrolling for navigating   lists, slides, and image collections. Advanced laser technology outperforms   optical mice, delivering smoother cursor control on surfaces where optical mice   can&acute;t go.Advanced power management techniques extend battery life to up to 1 year or   longer. Logitech&reg; 2.4 GHz Digital Cordless ensures uninterrupted connection,   even in the busiest wireless environments.Features&nbsp;&nbsp;&nbsp;Revolutionary hyper-fast scroll wheelFly through long   documents at hyperspeed with the nearly frictionless alloy scroll wheel. Shift   to precise, click-to-click scrolling for navigating lists, slides, and image   collections.&nbsp;Laser precisionEnjoy pixel-perfect precision and smoother   cursor control on virtually all surfaces.&nbsp;Extended battery lifeUp to a year of battery life&mdash;longer if   you use the on/off button. A battery power indicator eliminates surprises.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Uninterrupted cordless performanceLogitech 2.4 GHz Digital   Cordless ensures uninterrupted connection, even in the busiest wireless   environments.&nbsp;Advanced search and navigationHighlight a word or phrase   and press the search button to display results from your favorite search engine   instantly. Universal forward/back buttons speed up Web browsing and paging   through large documents.&nbsp;Ergonomic comfortSoft&nbsp;rubber grip, finger grooves, and   contoured shape offer support and effortless control.&nbsp;System RequirementsPCWindows&reg; XP, Windows Vista&trade;USB portMacMac OS&reg; X (10.2.8 or later)USB portPackage ContentsLogitech&reg; MX&trade; 620 Cordless Laser Mouse2.4 GHz micro-receiver2 AA batteriesInstallation Guide5-year limited hardware warranty", "title": "Logitech MX620 Cordless Laser Mouse (Black)", "price": 24.99, "imUrl": "http://ecx.images-amazon.com/images/I/41jYQVz0zIL._SX300_.jpg", "related": {"also_viewed": ["B003NR57BY", "B002HWRJBM", "B003TG75EG", "B000HCRVUS", "B001DJ64C0", "B000HCT12O", "B0002UM0JW", "B000UHE8YM", "B0034XRDUA", "B000BFO4OC", "B000TKHBDK", "B003VAM32E", "B006JRIDHK", "B002B3YCQM", "B005KSAHZU", "B000V05248", "B00DR8LB4Q", "B000GABCY2", "B0082D5660", "B003VAGXWK", "B000AY5Y5W", "B00I14395A", "B003I4FHNA", "B002HWRJBC", "B00165XQWW", "B000BFNT2A", "B007XZXS4A", "B005GB31PE", "B0036E8V08", "B00G5T8DJ0", "B005KSAJXK", "B000KA7PD0", "B007PJ4Q4A", "B000EXRSWG", "B000ODN7VM", "B008XB0JNG", "B0014TJSMM", "B0058TDROE", "B009ZPS3WS", "B001NTFATI", "B000K2CQGE", "B006OT2LVW", "B000ZH7E5M", "B0011FQUQG", "B00BIULEJC", "B00J9769DC", "B00E4MQODC", "B005KSAOKI", "B001FA1SIM", "B00BFOEY3Y", "B000AY5ZIS", "B00EO2ECUY", "B008RMY4JQ", "B0011F19CG", "B005058AGQ", "B00D68ZVY8", "B000UHE8Y2", "B000TG4BA0", "B002J9GDXI", "B00GX0ANIA"], "buy_after_viewing": ["B003NR57BY", "B002HWRJBM", "B003TG75EG", "B003VAGXWK"]}, "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Mice"]]}