{"asin": "B00AEZIESG", "description": "The CAN is a portable, modern-day Boom Box plus speakerphone that is ideal for parties, gatherings and your own personal listening. The CAN is the best way to free your music but still keep it in a tight package. Enjoy deeper, more powerful advanced audio performance from this tiny, yet mighty, portable Bluetooth speaker. It will work with all Smartphone's, MP3 players, PC's, tablets, and more. Choose to use the device wirelessly (Works with any Apple, Android, BlackBerry or any other Bluetooth-enabled device.) or through its 3.5mm, AUX-IN, wired stereo connection. Listen to music, make & receive calls or just share the excitement when you want, where you want. The CAN delivers audio in all of its clarity with booming sound unusual for a Bluetooth speaker this size. Its specific audio cavity structure and Super Shock technology with 3D Digital Dynamic Bass engine allows the small, lightweight speaker to reproduce deep, full sound. The speaker is tiny enough (only 8.5 ozs.) to carry in one hand or fit in a pocket. You can control almost everything with your Bluetooth device - playlists, streaming music, volume, etc. And you'll find power switches and volume buttons on the speaker. No need for a remote control. Place the CAN where you want, and the 50-foot wireless range lets you keep your phone, tablet or other device close at hand. The included travel pouch makes it safe to carry and allows instant playing anywhere.", "title": "Tonez Audio Corp. CAN Portable Bluetooth Speaker/Speakerphone (Stealth/Black)", "price": 59.99, "imUrl": "http://ecx.images-amazon.com/images/I/418lDbSaF-L._SY300_.jpg", "related": {"also_viewed": ["B00EFS120A", "B00IOIJD5I", "B00EH5TWT4", "B00EFS121Y", "B004R29UVM", "B00EFS0ZK8", "B00CTE0U5K", "B008VMT2HQ", "B0096T7U04", "B00HJSEJY4", "B006K3IE36", "B00CY0MRYG", "B00F4EONWS", "B00IQ92L4K", "B00313JD06", "B00GUY2KOO", "B00A44RLRW", "B00J3O9YRY", "B00COC606A", "B0096T7TQE", "B00A44RLWC", "B00DJNCS6O", "B00CM0XHRE", "B009AYLDSU", "B0093IZZ7I", "B0071AKB38", "B004HHICKC", "B00JST4VHW", "B00IDXV5GO", "B00HFFDDLG", "B009Y2W8UA", "B00DQAPJSY", "B00FJILVDS", "B004R26IYE", "B005T25ZQS", "B00BLCLVBS", "B00F566ADU", "B00HHDLMEQ", "B00HWSXXKC", "B00BYOEHGE", "B00BCSYZTQ", "B00DDW2JU6", "B00GYFGCOI", "B00A44RLS6", "B004NM6RPS", "B0089ZV1WY", "B0093IZSGG", "B00J3O9DYI"], "buy_after_viewing": ["B00EFS120A", "B0093IZSGG"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}