{"asin": "B002EEP3MK", "description": "From the Manufacturer(June 29, 2009)The OPPO BDP-83 Blu-ray Disc Player with SACD and DVD-Audio combines several audio- and video-disc playing functions into one convenient system. This universal Blu-ray player operates not only Blu-ray, but also SACD, DVD-Audio, DVDs, and CDs. So you can put in any disc, sit back, and enjoy--all without the clutter of multiple players, remotes, and wires.Replace all your other media players.View larger.There are connections for all the latest home theater components.View larger.TheBDP-83 Blu-ray Disc Playersupports the following formats:Blu-ray Disc (Profile 2.0), DVD, SACD, DVD-Audio, CD, Kodak Picture CD, AVCHD, MKV.and has these connections:HDMI 1.3, component video, composite video, 7.1 analog audio, analog stereo, optical digital audio, coaxial digital audio, 2 x USB, Ethernet RJ-45, external IR, RS232.One Player to Rule Them AllInstead of using separate players for your Blu-ray discs, DVDs, CDs, SACDs, and DVD-Audio discs, use the OPPO BDP-83 player to do the job in a single, handsome package. If you have videos, music, or photos on your computer, you can burn them to a CD or copy them to a USB flash drive, and the BDP-83 will play them without a hitch.With a sleek, black design that features a brushed aluminum front, the OPPO BDP-83 will fit your home decor. And by replacing a myriad of other players, the OPPO BDP83 will save you space and will reduce clutter and cables.Latest Blu-ray Specs for Outstanding Video QualityThe OPPO BDP-83 Blu-ray Disc Player incorporates an award-winning processing chip by Anchor Bay that provides outstanding picture quality that is clean and true to life. The player provides full 1080p HD output, and can also provide output at 480i, 480p, 720p, and 1080i. It also supports Blu-ray discs that are recorded at 24 frames per second, so you can have a cinema-like experience anytime you want it.The BDP-83 supports Blu-ray Profile 2.0, which means that it has special hardware, such as an audio/video decoder and one gigabyte of internal storage. This allows it to support BD-Live features such as Internet chats, scheduled chats with the director, Internet games, and more. Please note that BD-Live requires an Internet connection to work.Up-converts DVDs for a Clearer Picture; Converts Between PAL and NTSCThe same Anchor Bay chip that provides the Blu-ray processing also provides up-converting of standard-definition DVDs. By de-interlacing and scaling, the chip will make your DVDs look great on your HDTV, giving your DVD library new life.The BDP-83 supports both NTSC and PAL systems, providing disc playback and video output. It also allows you to watch the content of one system in the output of the other; for example, you can watch a PAL movie on an NTSC TV (please note that this is subject to DVD and BD region restrictions).Award-winning VRS technology by Anchor Bay delivers outstanding picture quality.View logic board.High-Fidelity Audio for a Cinema-Like ExperienceIt isn't just the BDP-83's visual quality that will thrill you; you'll also love the sound the BDP-83 creates. With support for Dolby TrueHD and DTS-HD Master Audio, you'll experience loss-free sound that is studio-master quality. The player supports bit-stream output via HDMI 1.3, and it can decode TrueHD or DTS-HD audio into LPCM and yield sound via HDMI or 7.1-channel analog outputs.Support for Audio-Only Formats Will Thrill Sound LoversSound lovers will be elated by the BDP-83, thanks to its support for both DVD-Audio and SACD, two audio-only formats that provide stereo and multi-channel audio. These formats provide sound quality that is far superior to that of CDs, and they have greater sound depth and higher sound resolution. And with a dedicated two-channel analog audio output with optimized DACs and output driving stage, sound lovers will be sure they're getting the best audio they can.Multiple Connections to Work With Your Home TheaterThe BDP-83 has plenty of connections to interface with your home theater system. On the front of the player, there is a USB port that lets you quickly connect a flash drive to view movies, music, or photos. On the rear, there is another USB port, along with connections for HDMI, component video, composite video, 7.1 analog audio, analog stereo output, and optical and coaxial digital audio. Whether you have a state-of-the-art home theater system or one with legacy connections, the BDP-83 won't have any problems interfacing with your equipment. There is also an Ethernet jack for use with BD-Live, as well as a hardwired IR in-and-out jack.Backlit Remote Control and Universal Power SupplyWith clear labeling and an ergonomic layout, the included remote makes playback of all your audio and video discs easy. And because the remote control has a back light, you'll have no problems when using it in your dark home theater.The BDP-83 has a universal power supply, making it compatible with the AC power of every region, so you won't have to worry about damaging your player with incorrect voltage.The OPPO BDP-83 Blu-ray Disc Player measures 17.0 x 3.0 x 13.25 inches (WxHxD).", "title": "OPPO BDP-83 Blu-ray Disc Player with SACD, DVD-Audio, and VRS Technology (2009 Model)", "price": 499.0, "imUrl": "http://ecx.images-amazon.com/images/I/31b46itJxXL._SX300_.jpg", "related": {"also_viewed": ["B009LRR5AQ", "B004BLK24S", "B00817UWQ6", "B00GPFM106", "B009AHQ8C8", "B00HUGNN06", "B00I19TOGS", "B005C98484", "B00KQ2EQUM", "B00LIQST6W", "B00AFKBIYW", "B009UXEOIW", "B008982LDY", "B008HO9VHE", "B001A5NGZU", "B00B9MM57E", "B00752R4QO", "B003V8B0VG", "B008F86F30", "B0089KJPM2", "B00078GLJY", "B002K8Q41Y", "B00BFEF9N8", "B00JRH8EY6", "B00HUGP9EY", "B00DB8MLK0", "B002AQ51VK", "B0092MMXI4", "B002B97X3K", "B00GSZ5ISK", "B00AYB3OOY", "B00CP76N7U", "B00BFRKYVM", "B001J6N8BW", "B00752R4PK", "B003R7KMTW", "B00021O4V8", "B00AN92LXM", "B0081YCU28", "B00AWKC0JM"], "buy_after_viewing": ["B009LRR5AQ", "B00AWKC0JM", "B003L1ZYYM", "B00BFEF9N8"]}, "categories": [["Electronics", "Television & Video", "Blu-ray Players & Recorders", "Blu-ray Players"]]}