{"asin": "B000ER5G58", "description": "The TiVo Series2 DT does something that only DirecTV TiVo users have enjoyed up till now--the ability to record two shows at once. This dual-tuner (DT) TiVo Series2 is the first standalone DVR that's optimized for households with cable television. Now, you'll never have to miss any of your favorite shows--even if they're on at the same time. It also offers the same entertainment services as other TiVo Series2 DVRs, including digital music, digital photos, remote scheduling, and hassle-free favorites recording. All this and the famed luxury of being able to pause and view instant replays of live television, too. TiVo DVRs record television programming directly to an onboard digital ATA/IDE hard drive, eliminating the hassles of videotape (imprecise tape searching, head cleaning, steadily degrading picture, fuzzy sound, etc.).This TiVo Series2 DT model (TCD649080) offers an 80-hour recording capacity. It offers the ability to simultaneously record programming from two basic cable channels, or one basic cable channel and one digital cable channel. It also includes built-in Ethernet and USB ports, making it easier than ever to add the TiVo box to your home network. This enables you to take advantage of the TivoToGo feature, which allows you to transfer programs from the TiVo box to a Windows-based desktop or laptop PC so you can watch your favorite programs on the go or while others are watching live or recorded programing on the TV.The Series2 has a USB port and an Ethernet connection, offering users with home networks the ability to stream photos and music to their TiVo, or send programs from one TiVo to another. This connectivity also lets TiVo subscribers access exciting entertainment services through the TiVo Home Media Features, which consists of the TiVo Digital Music Player, TiVo Digital Photo Viewer, and Multi-Room Viewing.The TiVo Digital Music Player lets you enjoy your computer's MP3 collection through your home entertainment sound system. Access and control your entire digital music collection via your TV; shuffle your music library by artist, album, or type of music; and create a custom playlist on your computer or use third-party software to develop playlists for every mood.The TiVo Digital Photo Viewer accesses digital photos stored on your computer and showcases them on your TV. View photo albums and slideshows on your TV screen, easily navigate, search, and view your computer's entire digital photo library, play and control slideshows of photo albums, and use the remote control to select and view individual photos.TiVo's Series2 DVR allows users to view photos and listen to music stored on their computer or other peripheral device.With the Multi-Room Viewing feature, users can pause live TV and resume viewing in another room.Multi-Room Viewing is designed for households with two Series2 DVRs and allows you to record a show on one DVR and send it to another if your kids are watching in the living room, say, and you're watching in the bedroom. You can also start a program on one DVR and pick up where you left off on your other DVR, as well as access the Now Playing list of a connected Series2 DVR at any time.You can also find and schedule recordings even when you're away from home. With Online Scheduling, you'll have the freedom to schedule programs from anywhere you have a computer with an Internet connection. Just sign in to TiVo Central Online to access the same recording options you have at home. Broadband connected Series2 subscribers can also view both their own photo slideshows and those shared by friends with Yahoo! Photos, and check local weather and traffic from Yahoo!. Additionally, subscribers can browse and buy movie tickets from Fandango, discover new music on Live365, and listen to entertaining podcasts.The Series2 DVR is compatible with virtually every television available. It also works with VCRs, TV antennas, cable systems, and satellite systems. A patented universal remote control simplifies program recording and controls multiple TiVos within the home (2 devices can share your existing phone line). Connections include: 3 video inputs and outputs (S-video, composite-video, and RF coaxial), 1 set of stereo RCA analog audio inputs, and 2 sets of stereo audio outputs.TiVo service requires a monthly subscription fee; see tivo.com for current rates. Other benefits of TiVo service include but are by no means limited to: Season Pass (TiVo automatically finds and records every episode of a series all season long, even if the network schedule changes), WishList (TiVo finds and records programs that feature your favorite actor, director, team, or even topic), Smart Recording (TiVo detects line-up changes for you and suggests programs to match your interests, if desired), and Showcases (exclusive entertainment plus recording shortcuts from some of the most popular networks on TV). You can even train TiVo to autorecord more shows you'll love when you use the Thumbs Up and Thumbs Down buttons on the supplied remote. Parental controls let you lock channels or set ratings limits based on content.What's in the Box80-hour TiVo Series2 DT (TCD649080) DVR, user's manual, 1 stereo analog audio/video interconnect, 1 RJ-11 phone \"Y\" splitter, 1 dual IR blaster cable, 1 AC power cord, one 25-foot RJ-11 telephone cable, 2 AA batteries, 1 RG-6 coaxial cable, 1 DB-9 serial cable, a user's manual, and warranty information.", "title": "TiVo TCD649080 Series 2 80-Hour Dual Tuner Digital Video Recorder (2008 Model)", "price": 37.33, "imUrl": "http://ecx.images-amazon.com/images/I/31Z111M2W4L._SX300_.jpg", "related": {"also_bought": ["B000ER5G6C", "B0054MAVXA", "B00DYYKA04", "B0036OR924", "B000I1D0BW", "B002Z1JCP6", "B000ER1G3E", "B003H3A2NM", "0764569236"], "buy_after_viewing": ["B00I2ZBD1U", "B00EEOSZK0", "B00DYYKA04", "B0054MAVXA"]}, "categories": [["Electronics", "Television & Video", "Streaming Media Players"]]}