{"asin": "B001ELJ9Q0", "description": "Get lots of feaures and maps to keep your travels stress-free with the transatlantic n&uuml;vi 275T. It takes you there with preloaded maps for both North America and Europe and turn-by-turn directions that call out streets by name. The 275T comes with lifetime traffic and hands-free calling to simplify life on the go. Like the rest of the n&uuml;vi 205-series, this portable navigator is priced right and ultra-easy to use.Get voice-prompted, turn-by-turn directions that speak street names to your destination.Get Turn-by-Turn Directionsn&uuml;vi 275T's intuitive interface greets you with two simple questions: \"Where to?\" and \"View Map.\" Touch the color screen to easily look up addresses and services and get voice-prompted, turn-by-turn directions that speak street names to your destination. It comes preloaded with detailed City Navigator&reg; NT street maps for both North America and Europe, over 6 million points of interest (POIs), 2-D or 3-D maps and smooth map redraw rates as you navigate. Its digital elevation maps show you shaded contours at higher zoom levels, giving you a big picture of the surrounding terrain. In addition, n&uuml;vi 275T accepts custom points of interest (POIs), such as school zones and safety cameras and lets you set proximity alerts to warn you of upcoming POIs. With HotFix&reg; satellite prediction, n&uuml;vi calculates your position faster to get you there quicker.Make Hands-free CallsFor hands-free calling, n&uuml;vi 275T integrates Bluetooth&reg; wireless technology with a built-in microphone and speaker. Just pair it with your compatible Bluetooth phone and talk hands-free through the 275T while staying focused on the road. Simply dial numbers with n&uuml;vi's touchscreen keypad to make a call. To answer calls, just tap the screen and speak into its built-in microphone. Enjoy convenient one-touch dialing for contacts and points of interest.Avoid Traffic Tie-upsSteer clear of traffic with n&uuml;vi 275T's integrated FM traffic receiver. Receive alerts about traffic delays and road construction that lie ahead on your route. Next, simply touch n&uuml;vi's screen to view traffic details or detour around the problem area.Take It With YouLike the rest of the n&uuml;vi 205-series, n&uuml;vi 275T sports a sleek, slim design and fits comfortably in your pocket or purse. Its rechargeable lithium-ion battery makes it convenient for navigation by car or foot. With its \"Where Am I?\" emergency locator, you always know your location. Simply tap the screen to get your exact latitude and longitude coordinates, the nearest address and intersection, and the closest hospitals, police stations and fuel stations.Go Beyond NavigationNavigation is just the beginning. n&uuml;vi 275T includes many travel tools including JPEG picture viewer, world travel clock, automatic time zone transition, currency converter, unit converter, calculator and more. With photo navigation, you can download pictures from Garmin Connect&trade; Photos and navigate to them. The 275T is compatible with our free Garmin Garage where you can download animated vehicles that show your location on the map. It also comes with Garmin Lock&trade;, an anti-theft feature. Enhance your travel experience with optional plug-in microSD&trade; cards such as Garmin Travel Guides for detailed data on attractions.What's in the Boxn&uuml;vi 275, Preloaded City Navigator&reg; NT North America (U.S. and Canada), Lifetime traffic&sup1;, FM traffic receiver with vehicle power cable (indicated by \"T\" after model number on the box), Vehicle suction cup mount, USB cable, and Quick start manualCompare all Garmin n&uuml;visClick the button below to compare by series, user type, and features.Visit Garmin.com athttps://www8.garmin.com/support/download.jspto get the latest firmware updates for your n&uuml;vi to keep it current and performing at its best.&sup1;Lifetime traffic extends for the useful life of your Garmin traffic receiver (as long as you own a compatible Garmin GPS) or as long as Garmin receives traffic data from its traffic supplier, whichever is shorter. Traffic content not available for all areas. See www.navteq.com/rdstraffic for traffic coverage areas and www.garmin.com/traffic/fm/navteq.html for program License Agreement containing complete terms and conditions.", "title": "Garmin n&uuml;vi 275/275T 3.5-Inch Bluetooth Portable GPS Navigator with Traffic", "price": 179.99, "imUrl": "http://ecx.images-amazon.com/images/I/51nuMwsxo1L._SX300_.jpg", "related": {"also_viewed": ["B00BHSTWOY", "B001U0O7RQ", "B00407238Q", "B005DIBH4M", "B005DIBH6A", "B0055XNWJI", "B002ACBNXO", "B00BHT7AT2", "B00AXX0I7Y", "B008JWSTC2", "B000MNA3BG", "B00AXX0JNW", "B003B3P2CO", "B002X8I27U", "B003ZX8AZQ", "B00AD5EOAO", "B001UO0RKS", "B003B3P2CY", "B000L3APBK", "B003B3P2D8", "B004MYFTEW", "B004MYFTDI", "B001U0O7QC", "B000WJ67UQ", "B00AXX0JP0", "B001PKTDMU", "B00AXX0IEC", "B00GD7DCW2", "B001ELJ9P6", "B000F007K8", "B000BS2V44", "B005LO3SS6", "B0088HSMHK", "B000NVZE5M", "B004W1GQ92", "B001U0O7QW", "B0030E6I4K", "B00AXX0I88", "B001JBOK5K", "B007M4Z7GO", "B0015F1L7A", "B006OJZNEE", "B00AXZWG8Q", "B005DIBHCE", "B0057ODG6Y", "B0057OCDQS", "B000BS6RF8", "B000MN8R5A"], "buy_after_viewing": ["B00BHSTWOY", "B001U0O7RQ", "B00AXX0JNW", "B004I5BUSO"]}, "categories": [["Electronics", "GPS & Navigation", "Sports & Handheld GPS", "Handheld GPS Units"]]}