{"asin": "B000CS1TLE", "description": "Imagine&hellip; controlling all your devices using only one remote - without a direct line of sight to the components! With the Harmony 890 Remote, you can wirelessly control your home entertainment system&nbsp;while hiding all those unsightly wires and components behind cabinet doors or&nbsp;a wall.&nbsp;Logitech's Harmony 890, an upgrade to the Harmony 880 remote control, usesboth radio frequency (RF) and infrared (IR) wireless signalsto deliver powerful complete control of your home-entertainment system that may be hidden behind cabinets. With a wireless range of up to 100 feet, the Harmony 890 remote sends RF commands to a wireless receiver, which then blasts infrared signals to&nbsp;the components.&nbsp;The Harmony 890 remote makes universal control for home entertainment and advanced lighting systems simple.Using Your Harmony Remote1. Easy to set up:Just connect your Harmony remote to your computer and the Web wizard walks you step-by-step through a simple set up. Enter the model numbers of your components, then answer a few easy questions about how you &quot;Watch TV&quot; or &quot;Watch a DVD.&quot;&nbsp; Harmony lets you control even the most complex system without the hassle of programming complicated macros.2. Easy to use:The Harmony Remote is the world's only remote with Smart State Technology&reg;. Simply press an Activity button, such as &quot;Watch TV&quot; or &quot;Listen to Music,&quot; and your Harmony Remote automatically sets up each of the devices required for that activity.3. Easy to get help:With the Harmony remote, you don't have to know anything about your entertainment system to operate it. No sound? No picture? No problem! There's even a handy &quot;HELP&quot; button to guide you through simple troubleshooting and get you back in control.4. Never out of date:The Harmony&nbsp;device database includes 5,000+ manufacturers and 175,000+ devices, everything from HDTVs to DVRs, VCRs to lighting controls.&nbsp; It's constantly updated with new components and fine-tuned settings, so your remote will never be out-of-date.&nbsp;&nbsp;&nbsp;&nbsp;Features&nbsp;&nbsp;Color display&nbsp;&nbsp;&nbsp;&nbsp;Both functional and stylish, with user-customizable backgrounds, button icons and text.&nbsp;Comfort-grip shapeFor easy control.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Fully backlitEasily navigate in the dark.&nbsp;Harmony RF Wireless ExtenderServes as a bridge receiver which converts RF signals to IR commands, for control without a direct line of sight!&nbsp;Control your entire home entertainment system with just one button.&nbsp; Effortlessly switch between watching home theater and listening to music, by selecting a single activity button. Colorful icons accompany text on the LCD screen to allow for quick and easy command of home-entertainment equipment and household appliances that may be out of range for a traditional infrared remote.Integrate up to 15 devices&mdash;including lighting and household appliances.Save energy! Each time a new activity is selected, the remote establishes the proper state of all of the components needed for the current activity, and turns off the components that are not needed.Set it up in a snapwith an advanced setup wizard. The online setup also makes it easy to update a remote when&nbsp;upgrading your home-entertainment system. The Harmony setup wizard does the programming, so you don't have to. Just connect your remote to your computer and answer a few questions about how you currently use your home theater. Logitech's patented Smart State Technology&reg; does the rest.Don't worry about using up batteries&nbsp;with the rechargeable lithium ion battery. Store the remote on the attractive charging&nbsp;station when not in use.Easily view and select.Color display icons and 8 on-screen activity buttons make it easy.&nbsp;Effortlessly switch between watching HDTV and listening to music,by selecting a single activity button.Which Harmony Is Right For You?Find out what other Logitech Harmony Advanced Universal Remotes fit your audio &amp; video set-ups. Browse more Harmony remotes and see which one is right for you.Harmony 700Simple control that's always charged and ready for your entertainment.Harmony OneSimple, stylish touch-screen control of your entertainment.Harmony 890Control out of sight home entertainment devices.Harmony 900Complete control of devices you can't see.Harmony 1100Personalized control of your home theater system.Control FeaturesHarmony 700Harmony OneHarmony 890Harmony 900Harmony 1100Number of devices supportedUp to 6Up to 15Up to 15Up to 15Up to 15LCD displayColor screenColor touch-screenColorColor touch-screen3.5&quot; color touch-screenActivity-based   controls&nbsp;Layout optimized for DVD/TiVo&nbsp;Contoured design to fit comfortably in your hand&nbsp;&nbsp;&nbsp;Customizable screen for more powerful personalization&nbsp;&nbsp;&nbsp;&nbsp;RF   support for control of devices inside cabinets&nbsp;&nbsp;Easy-to-install   RF System for RF connection&nbsp;&nbsp;&nbsp;&nbsp;RF   wireless extender for RF connection&nbsp;&nbsp;&nbsp;Available separatelyPower ManagementHarmony 700Harmony OneHarmony 890Harmony 900Harmony 1100Battery operated&nbsp;&nbsp;&nbsp;&nbsp;RechargeableWith cableWith docking stationWith cradleWith docking stationWith docking stationWith Every Harmony RemoteHarmony 700Harmony OneHarmony 890Harmony 900Harmony 1100Simple online setup with PC or MacGrowing database of 225,000+ entertainment devices so you know Harmony will work with your devices today and tomorrowLive support if you hit a snagA handy help button so you're never stuck1-year warrantySystem SupportHarmony 700Harmony OneHarmony 890Harmony 900Harmony 1100Windows XP, Vista, 7Does not support Windows&nbsp;7Mac OS X (10.3 or later)Supports Mac OS&nbsp;X (10.2 and above)System RequirementsIBM&reg; or compatible PCMicrosoft&reg; Windows&reg; 98SE, 2000, Me or XPUSB portCD-ROM driveInternet accessMacintosh&reg; PCMacintosh&reg; OS X 10.2 or laterUSB portCD-ROM driveInternet accessPackage ContentsHarmony&reg; 890 remote controlRecharging&nbsp;stationAC adapter for recharging baseUSB cableLithium-ion rechargeable batteryHarmony RF Wireless ExtenderInstallation CDInstallation guide1-year limited warranty", "title": "Logitech Harmony 890 Advanced Universal Remote Control (Discontinued by Manufacturer)", "price": 326.0, "imUrl": "http://ecx.images-amazon.com/images/I/41SKVX803NL._SY300_.jpg", "related": {"also_bought": ["B003LZYXYU", "B006Q6QHDG", "B001U3Z6YG", "B002IC0YL8", "B003TX2N14", "B001HT0PB2", "B00BQ5RY1G", "B001M5U5AC", "B00729DFEA", "B007C81JL2", "B003LZ4LBK", "B004GW25WY"], "bought_together": ["B003LZYXYU"], "buy_after_viewing": ["B00BQ5RY1G", "B004OVECU0", "B00BQ5RYI4", "B00BQ5RYI4", "B003LZYXYU"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Remote Controls", "TV Remote Controls"]]}