{"asin": "B001IYCMNA", "related": {"also_bought": ["B007RLFM7G", "B004H8FSQM", "B007UQROJC", "B007SU0L7C", "B007RB1LQM", "B007I59CN6", "B0000ZI1FG", "B008CWW6VY", "B004GHMU5G", "B001PS9E5I", "B004ZMXE66", "B004GHMU5Q", "B00DGH08OC", "B0001XU8BW", "B004OA6VUA", "B008B8CVTQ", "B0041ORNC4", "B0002I7288", "B0000C20XG", "B0000BVYT3", "B00006RVPW", "B004C3ZPEW", "B007SU0LBS", "B000GQXFUK", "B0041W55YE", "B0085RTD3U", "B007RLFLN6", "B004GHMU4M", "B0019804U8", "B000JVTTPW", "B0041ORNFQ", "B004OA721C", "B004GHMU6A", "B000O0Z8GC", "B00DMLKQPS", "B00006HYT5", "B00GAIMXR4", "B003AVN1LG", "B0041ORN6U", "B0002CWPW2", "B004GHMU60", "B00H09BOXQ", "B003EE12EC", "B00008AWL3", "B0093CBTOM", "B00461G3MS", "B009SPWJ98", "B00AHSNQNS", "B00H09CF70", "B003Y24DEU", "B009Z7US24", "B005EORRBW", "B000H97UC0", "B002MZW5KE", "B0028H1G9C", "B0001AC2P0", "B0089QB1SC", "B0000AAAJA", "B0093HC0D6", "B003CNZ9WG", "B0038ZTZ3W", "B008X3JHJQ", "B007ED7V7G", "B002U0DJH4", "B00077INZU", "B00DJERLFG", "B004XXMUCQ", "B003V4TV8O", "B00GHRGNPQ", "B00DESAOV0", "B0000ANEX9", "B00JC5Y6YA", "B00BS92DCK", "B0048U3FMS", "B00002EQCW", "B0049KV52E", "B005LDLVAO", "B0092TG310", "B00D601UC8", "B003VANO7C", "B003D3MFHC", "B002JE7FBW", "B00006HXTB", "B00062WV9U", "B004TLIVBG", "B00BK0YRZS", "B0041ORNCY", "B000FAKFNC", "B005ORP1JO", "B007VPKLBU", "B002MZW5JU", "B001OZFCI0", "B007RB1MZM", "B003BU0EKW", "B0000AZK72", "B003AVN1RU", "B00C2DLI9A", "B007ZT2KKM", "B00AI8LI1O", "B00655D2P4"], "bought_together": ["B007RLFM7G"], "buy_after_viewing": ["B004XXMUCQ", "B005H4CDF4", "B008WJ6ISY", "B006QB1RPY"]}, "title": "Cisco WAP4410N Wireless-N Access Point - PoE/Advanced Security", "price": 108.0, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/31qohlfCT7L._SX300_.jpg", "brand": "Cisco", "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Wireless Access Points"]], "description": "From the Manufacturer The Cisco WAP4410N Wireless Access Point delivers highly secure, high-performance wireless network access to your employees. Expanded coverage helps ensure that employees can access the network anywhere in the workplace. The 802.11n standard is designed to support even the most bandwidth-intensive applications, such as voice and video. Enhanced security protects your business information and gives you control over who can access your network. With an easy-to-use web interface, you can provide wireless connectivity in no time at all. Adding wireless access to your existing business network is the best way to keep your employees productive and connected wherever work occurs in the workplace.Cisco WAP4410N Wireless-N Access Point with PoE enablement and Advanced SecurityFeatures 1 Gigabit Ethernet port to transfer data at high speedsThe Cisco WAP4410N Wireless-N Access Point lets you connect Wireless-N (802.11n), Wireless-G (802.11g), and Wireless-B (802.11b) devices to your wired network, making it easy to provide wireless access in the workplace. Power over Ethernet (PoE) support makes the access point easy to install - you can mount it anywhere, even without ready access to a power plug. With appropriate PoE support at the other end, such as a PoE switch, you need to run only one cable to the access point to deliver both data and power. Of course, you can also use the included AC adapter if power is available nearby or you are not connecting to a PoE switch or injector. Configuration is a snap with the web browser-based configuration utility. This intuitive tool allows you to take full advantage of all the access point security and quality of service features with an easy to use management interface.Secure WirelessTo protect your data and privacy, the Cisco Wireless-N Access Point supports the industrial-strength wireless security of Wi-Fi Protected Access (WPA), encoding all your wireless transmissions with powerful encryption. The MAC address filter lets you decide exactly who has access to your wireless network, and advanced logging keeps you apprised of access attempts. The rogue access point detection capability notifies the administrator when an unauthorized access point is detected in the airspace. The WPS (Wi-Fi Protected Setup) feature facilitates simple and secure deployment of security in the wireless network.Cisco Small Business Access Points - A Complete PortfolioCisco Small Business Access Points offer a complete portfolio of affordably priced products, purpose-built for small businesses that deliver, reliable connectivity with easy to use products. Choose from N, B or G standards as well as access points that can be placed indoor or outdoor. Review the product table to determine which product best meets your wireless connectivity needs, including the Cisco WET200 Wireless-G Business Ethernet Bridge if you need to connection between buildings.Cisco Small Business Wireless Access Point PortfolioModelType802.11x StandardAntennaPlacement/CasingLAN PortsWAP4410NAPN, G, B3 DetachableIndoor/Plastic1 Gigabit EthernetWAP2000APG, B3 DetachableIndoor/Metal1 Fast EthernetWAP200APG, B2 DetachableIndoor/Plastic1 Fast EthernetWAP200EAPG, BInternalOutdoor/Weatherproof roof1 Fast EthernetWET200BridgeG, B2 DetachableIndoor/plastic5 Fast EthernetCisco WAP4410N features 3 adjustable and removable dipole antennas with MIMO technologyHigh Performance You Can TrustWireless-N is not only the fastest wireless protocol, but also it&rsquo;s backwards compatible for users running 802.11b and 802.11g devices. The access point includes 3 adjustable and removable antennas with MIMO (multiple-in, multiple-out) technology, which increases wireless throughput and expands the range to reduce &ldquo;dead spots&rdquo; providing more efficient coverage of your small business. Embedded quality-of-service (QoS) functionality maintains excellence in video and voice communications. The access point includes a Gigabit Ethernet LAN interface to transfer data at high speeds. The combination of the high performance Gigabit Ethernet interface and the increased speeds delivered by the 802.11n standard makes this access point ideal for applications such as high-bandwidth data or video.Securely, Extend your NetworkSupports high-bandwidth applications with the 802.11n standard; backward compatible with 802.11b and g devicesConnects to Power over Ethernet devices, simplifying installation and eliminating the need for and cost of installing external power suppliesProtects business information with enhanced security, including rogue access point detection, advanced encryption, and select access filtersSimplifies installation and configuration with easy-to-use web interfaceWi-Fi Multimedia (WMM) wireless QoS supportWhat&rsquo;s in the BoxCisco WAP4410N Wireless-N Access Point with PoEUser guide on CD-ROMEthernet network cablePower adapterProduct standsRegistration card"}