{"asin": "B000EPJL1A", "description": "The Apple 1 GB Shuffle is the world's smallest digital music player that lets you wear up to 240 songs on your sleeve, or your lapel, or your belt--it's so small you can wear it just about anywhere. Clip on iPod Shuffle and wear it as a badge of musical devotion. And the shuffle's anodized aluminum enclosure comes in a variety of colors.About the size of a matchbook, the iPod Shuffle measures up nicely.Just clip it and go.It comes with a teeny little docking station.Although the Shuffle comes in a small package, 1.62 inches long and about half an ounce, it still holds a lot of music, and you can count on your Shuffle to keep on rocking for up to 12 continuous hours. Use iTunes to import your CDs, shop for songs on the iTunes Store, and then sync them to your iPod Shuffle. And if you have more than 240 songs in your iTunes library, let iTunes autofill your Shuffle and get a new musical experience every time.Controls and Headphone JackiPod Shuffle pays respect to its bigger siblings with a thumb-friendly, circular control pad that puts the \"go\" in ergonomic. Click the center button to play and pause, and click the outer buttons to move back, skip forward, and adjust the volume. The Shuffle's headphone jack does double-duty as a dock connector. Flip the iPod Shuffle upside-down and drop it into the included dock. Then connect the dock to your Mac or Windows PC via the USB for a quick sync and charge. And if you're away from your computer, you can charge on the go with the optional USB adapter.Battery Indicator, Clip, and Shuffle SwitchThe battery indicator light displays three power levels with three different colors--green means go, amber means you're low, and red means you've almost hit zero. But with up to 12 hours of battery life, iPod Shuffle may keep on rockin' even longer than you do. Thanks to the sturdy, built-in clip, iPod Shuffle goes with just about any outfit. Clip it to your sleeve, lapel, coin pocket or backpack--no matter where you wear it, iPod shuffle speaks volumes about your style and the clip guarantees that it'll stay put right where you want it. Lastly, the Shuffle encourages you to embrace your inner rebel. Flip the Shuffle's Shuffle switch to mix up your iPod's contents--pop follows jazz, rock follows rap, the iPod Shuffle loves to improvise. Then flip the switch again to get back to your hand-picked playlists and albums in the order you synced them from iTunes.What's in the BoxApple 1 GB Shuffle, earphones, USB dock, and quick start guide.", "title": "Apple iPod shuffle 1 GB Metal (2nd Generation)  (Discontinued by Manufacturer)", "price": 66.0, "imUrl": "http://ecx.images-amazon.com/images/I/31NvV1ZV63L._SX300_.jpg", "related": {"also_bought": ["B001FA1NR8", "B000IHGJ50", "B000EPHQNA", "B000NU4OTA", "B001FA1NRI", "B000H0QIRC"], "buy_after_viewing": ["B000IHGJ50", "B0097BEEDM", "B0097BEEW8", "B000QHHBRC"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Players"]]}