{"asin": "B008NENG1A", "related": {"also_bought": ["B008NF8CEK", "B00D9BKWEQ", "B00D1W5MM0", "B00CJZDL0K", "B00CXJWE28", "B00GFWBOFC", "B008NF8BKK", "B008NFWDCM", "B00009KLAE", "B009SS0FZK", "B00CJZDO1G", "B00C32SPDW", "B009YD3ZT2", "B00A2LD3AQ", "B009W3WHDO", "B008NFWAO8", "B008OQUZEI", "B008NF8998", "B000KZATWY", "B00ACYTWFI", "B00C32SNK2", "B008NFWC3M", "B00489L6RA", "B00013J6IS", "B009W3YB56", "B003USVBKM", "B00A2XII9A", "B00GXLWAZI", "B008NFWA52", "B001KN6WL2", "B008NF8BRI", "B00009KLAG", "B00H5XGOUA", "B009YR4IW6", "B00F4KS27E", "B009I561TW", "B009YD3Z8S", "B005WQTDT6", "B007M54E1M", "0321907485", "B00K899B9Y", "B00B2A1KEC", "B008NFWB0Q", "B00AD7XWGE", "B00017LRLS", "1285459237", "B001G45FH2", "B00AD7XQJM", "B008OQUYDA", "B00GU1HSEY", "B00GGN7ZIA", "B00AD7EO7U", "B007M54E08", "B005ERKVDU", "B00C1DJYD8", "B00CV9MIEE", "B00CV9MITY", "B0000AQJAN", "B00GCGGNBQ", "B008NFWCVY", "B00CDK0BOA", "B00BYA15YU", "B00B7ID99I", "B00B13QQGM", "B00A2X2OUY", "B00AG6U04O", "B00AY2PSB0", "B00CV9M2JU", "B0083WY8TQ", "B0045JAJR6", "B006TOHWN4", "B00EA71PVM", "B00H5XDVG0", "B00F87A7W6", "B007NDL56A", "B00A8O6P7U", "B00FG8PPXI", "B009YD40A0", "B00C9ESK2K", "B00CV9M3GW", "B00004ZCJG", "B00GBATPFO", "B005HY4U46", "B00A341ER6", "B00DIWY558", "B007BZRXJ8", "B00A341ETO", "B0000BZL47", "B00D62VZQC", "B000932GFA", "B001G4QXLE", "B0037NX6JY", "B00HJFBUCQ", "B00D9BL1MS", "B000ANGNN0"], "bought_together": ["B008NF8CEK", "B008NFWDCM"], "buy_after_viewing": ["B00D1W5MM0", "B008NF8BRI", "B00GFWBOFC", "B00B2A1KEC"]}, "title": "Canon EOS M 18.0 MP Compact Systems Camera with 3.0-Inch LCD and EF-M 22mm STM Lens", "price": 329.0, "salesRank": {"Camera &amp; Photo": 289}, "imUrl": "http://ecx.images-amazon.com/images/I/51vdbZNoJ8L._SX300_.jpg", "brand": "Canon", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Compact System Cameras"]], "description": "True HD Performance | EOS Full HD Movie Mode with Movie Servo AFFor those looking to capture superb quality Full HD video, the EOS M Digital Camera offers a number of advantages. Offering a large APS-C sized sensor, the camera is able to deliver shallow depth-of-field for achieving impressive cine-style results and the ability to capture clean, high-quality video, even under very low-light conditions.&nbsp;&nbsp;With the optional Mount Adapter EF-EOS M, the camera is also compatible with Canon's extensive family of EF lenses for boundless creativity.&nbsp;Capable of shooting in a number of recording sizes and frame rates, the EOS M Digital Camera continues Canon's tradition of performance, quality and simplicity.&nbsp; The EOS M Digital Camera enables easy manual control of focus and exposure. It also automatically splits files greater than 4GB (FAT specifications) for extended recording without interruption.&nbsp;Movie Servo AF allows continuous autofocus tracking of moving subjects while recording video.&nbsp; When shooting video with one of Canon&rsquo;s new STM lenses, Movie Servo AF takes advantage of the lens&rsquo; stepping motor for smooth and quiet continuous AF.Resolution &amp; Recording SizesFrame RatesRecording Time Based on 8 GB Memory Card&nbsp;&nbsp;Full HD1920 x 108016:9 format30 fps (29.97)Maximum Recording Time29 min. 59 sec.25 fps &ndash; PAL standardTotal Recording Time (approximately)1920 x 1080 (Full HD)22 min.24 fps (23.976)1280 x 720 (HD)22 min.HD1280 x 72016:9 format60 fps (59.94)640 x 480 (SD)1 hr. 32 min.50 fps &ndash; PAL standardRecording Time Based on 16 GB Memory CardStandard Definition (SD)640 x 48030 fps (29.97)Maximum Recording Time29 min. 59 sec.25 fps &ndash; PAL standardTotal Recording Time (approximately)1920 x 1080 (Full HD)44 min.1280 x 720 (HD)44 min.640 x 480 (SD)3 hr. 4 min.Built-in stereo microphone, manual audio level adjustmentThe EOS M Digital Camera has an internal stereo microphone for high-quality audio capture and a wind filter feature to reduce wind noise when shooting outdoors. Sound recording levels can be manually (up to 64 different levels) or automatically controlled. A built-in attenuator is also provided to reduce audio clipping. For more advanced audio recording, the EOS M Digital Camera is compatible with many third-party electret condenser microphones with a 3.5mm diameter plug.Video SnapshotWith the Video Snapshot feature, the EOS M Digital Camera can capture short video clips (of 2, 4 or 8 seconds) then combine them automatically into one video file as a snapshot or highlights &ldquo;album.&rdquo; With no editing required after shooting, the compiled video is perfect for sharing online or displaying directly on an HDTV via the camera's HDMI port. Additionally, stills can be recorded during video shooting simply by pressing the camera&rsquo;s shutter button. During playback, video clips in an album can now be reordered or deleted.&nbsp;Extraordinary Image Quality and Processing Power&nbsp;18.0 Megapixel CMOS (APS-C) sensorThe EOS M Digital Camera features Canon&rsquo;s amazing 18.0 Megapixel CMOS (Complementary Metal Oxide Semiconductor) sensor.Perfect for enlargements or for cropping detailed portions of the composition, the EOS M Digital Camera&rsquo;s sensor captures images with exceptional clarity and tonal range. This first-class sensor features many of the same new technologies used by professional Canon cameras to maximize each pixel's light-gathering efficiency and has center pixels that aid in the EOS M Digital Camera&rsquo;s accurate AF performance. This APS-C size sensor creates an effective 1.6x field of view (compared to 35mm format).Versatile ISO Range for shooting in a wide variety of lighting conditionsThanks to its DIGIC 5 Image Processor, the EOS M Digital Camera features a versatile ISO range of ISO 100&ndash;6400 (expandable to 12800 in H mode) for video recording and ISO100&ndash;12800 (expandable to 25600 in H mode) for still image shooting. The EOS M Digital Camera, with the DIGIC 5 Image Processor's remarkable noise-reduction technology, delivers outstanding performance in low light for incredible video and photos.DIGIC 5 Image ProcessorThe EOS M Digital Camera features Canon&rsquo;s DIGIC 5 Image Processor. The DIGIC 5 Image Processor works with the camera&rsquo;s CMOS sensor to deliver images with incredible detail in more situations, without the need for artificial light sources. With the power of the DIGIC 5 Image Processor the EOS M Digital Camera can achieve higher ISO sensitivity and even perform advanced functions like HDR Backlight Control, art filters, lens correction and much more. The brilliant &ldquo;brain&rdquo; of the camera, this engine supercharges every facet of image capture.Hybrid CMOS AF delivers fast autofocus speed for video and photos.The EOS M Digital Camera uses a hybrid AF system to deliver incredibly speedy and accurate focus. Its CMOS sensor has center-mounted pixels that are used for phase-difference AF. Phase difference AF is incredibly fast for general distance determination, while contrast AF is incredibly accurate, no matter the location of the focus point. By capitalizing on the strengths of phase-difference and contrast AF systems, the EOS M Digital Camera achieves precise AF, fast.Sharp and Clear, with Tactile Controls&nbsp;Touch Screen 3.0-inch Clear View LCD monitor II with multi-touch operation and Touch AFThe EOS M Digital Camera comes with a newly engineered, Touch Screen 3.0-inch Clear View LCD monitor II.Using the same capacitive technology as today&rsquo;s popular mobile devices, this new screen is touch-sensitive and delivers intuitive touch panel operation. Two finger touch gestures (multi-touch) can be used for zooming or changing images, menu and quick control settings can be accessed, and focus point and shutter release can be activated with the touch of a fingertip. The additional benefit of Touch AF makes it fast and easy to focus on any subject, by simply touching it on the screen. Displaying fine detail (at approximately 1.04 million pixels), this screen is perfect for composing and reviewing images. Thanks to a new, solid construction between the monitor&rsquo;s resin-coated cover and the liquid crystal display, reflections are minimized, and the display can be viewed, without glare, from any number of angles. The LCD&rsquo;s surface is treated with a smudge-resistant coating to minimize fingerprints and maintain a bright, clear image display.A Comprehensive System Of EOS Optics&nbsp;Compatible with the full line of Canon EF and EF-S lenses (optional Mount Adapter EF-EOS M is required)The EOS M Digital Camera features a new style lens mount, called EF-M. Besides the dedicated EF-M lenses, the camera is compatible with the entire family of Canon EF and EF-S lenses by attaching the optional Mount Adapter EF-EOS M. When the adapter is used, the image quality of the lens is preserved, with no light loss or change to image stabilization.&nbsp;From fisheye to telephoto and everywhere in between, Canon offers the most comprehensive lens collection on the planet, with the finest optics and most advanced technologies for whatever application is at hand.&nbsp;When shooting video with one of Canon&rsquo;s new STM lenses, the camera&rsquo;s Movie Servo AF feature takes advantage of the lens&rsquo; stepping motor for smooth and quiet continuous AF.&nbsp;Effects for Dramatic and Gorgeous ResultsHandheld Night Scene modeAccessible right on the EOS M Digital Camera&rsquo;s Mode Dial, Handheld Night Scene mode captures nightscapes with bright highlights and detailed dark areas, delivering results previously impossible without the use of a tripod. By shooting and combining four consecutive shots at a shutter speed fast enough to avoid camera shake, the EOS M Digital Camera&rsquo;s Handheld Night Scene mode makes dramatic nighttime photography simple.HDR Backlight Control modeThe EOS M Digital Camera&rsquo;s HDR Backlight Control mode ensures that backlit subjects are not recorded too dark. By shooting three consecutive shots at different exposures (underexposed, correctly exposed and overexposed) and then combining the images, the final result maintains detail in both the shadow and highlight areas, ensuring the backlit subject is properly exposed.Seven Creative Filters, plus new Art Bold Effect and Water Painting EffectAdding to the fun and creative possibilities available with the EOS M Digital Camera are seven different creative filters that can dramatically alter the mood and visual effect of any particular scene. Creative Filters include Grainy Black and White, Soft Focus, Fish-eye Effect, Toy Camera Effect, Miniature Effect and new filters: Art Bold Effect (makes the photos look like an oil painting, with subjects appearing three-dimensional), and Water Painting Effect (photos are altered to look like a water-colored painting). Since the filters can be applied to the image after shooting, it&rsquo;s easy to try several effects on the same shot. These creative effects can also be applied to video, for additional imaginative fun.Multi Shot Noise ReductionTo enhance its already admirable high ISO shooting capabilities, the EOS M Digital Camera features an intelligent Multi Shot Noise Reduction tool thatreduces noise even further than the camera&rsquo;s sensor and the DIGIC 5 Image Processor alone. With Multi Shot Noise Reduction activated, the camera takes four consecutive shots, merges and aligns them. This eliminates more noise than the traditional Noise Reduction filter, with little or no apparent resolution loss. Moving subjects are even optimized to minimize subject blur! Thanks to this clever new feature, high ISO shooting has never looked better.&nbsp;EOS M Digital Camera BodyEF-M 22mm f/2 STM LensNeck Strap EM-100DBBattery Pack LP-E12Battery Charger LC-E12USB Interface Cable IFC-130UEOS Digital Solution Disk, Camera Instruction Manual and Software Instruction Manual CD;if (typeof amznJQ === \"undefined\") { } else { amznJQ.onReady('JQuery', function() { setTimeout(function() {if(msa.Vowels) { var amzvowels = new msa.Vowels(jQuery,16,[\"ec2.images-amazon.com\",\"ec3.images-amazon.com\", \"ec5.images-amazon.com\"],5,'0QMACQ90NQJ3Q0J4ZF95', [\"z-ec3.images-amazon.com\", \"z-ak.images-amazon.com\" ], \"images-na.ssl-images-amazon.com\", [\"1820\", \"3320\", \"7470\", \"14730\"], [\"1820B\",\"3320B\",\"7470B\",\"14730B\",\"1\",\"2\",\"3\",\"4\",\"5\",\"6\",\"7\",\"8\",\"9\",\"10\",\"14\",\"15\",\"17\",\"18\",\"19\",\"20\",\"21\",\"22\",\"23\"], 50, 50, 100); amzvowels.initializeAndStart(); }}, 8000)}); }"}