{"asin": "B00004S9AF", "description": "Talk about going out with a bang! Sony Computer Entertainment released  its four-discThe Legend of Dragoonfor the PlayStation only months  before the release of that console's successor, the PlayStation2. This very  absorbing role-playing game, with hours upon hours of story and inventive  gameplay, might just be the last great title for the glorious PSX.The copious story begins with Dart, a vengeful young man with spiky hair and red  armor who embarks on a desperate rescue mission to break his childhood  sweetheart out of a castle prison. The two join forces with a knight who is  trying to end a war that's destroying the region. Dart soon learns that he is a  Dragoon--a human who's privy to the spiritual power of dragons. Like all RPG  heroes, Dart is up against impossible odds, but his newfound Dragoon magic and  battle skills go a long way toward making the bet even money.And that's just the beginning. Grab a spare memory card and a comfy chair and be  prepared to spend at least 20 hours getting through the first disk (there are  three others just like it in the double-wide case). It's hard to sustain a  player through this kind of time span, butThe Legend of Dragoontakes  chances and wins. For example, its battle system is turn based, so you can  actually use some strategy, but it also features special \"additions,\" or  fighting combos that unfold if you match the X button to that addition's timing.  When handling three players' additions, each with unique sequences, it can be  quite challenging. You can increase the potency of the elemental magic up to 160  percent by quickly tapping X during your cast. Also, the perspectives often  change between battles--players will direct the action from behind the heroes,  behind the villains, looking down from above, and off to the side.There are a couple downsides to the game. First, the stylized transitions into  and out of battle mode, while initially cool, quickly become  exhausting--especially when running the gauntlet through lesser foes in the wilderness or  lower ramparts of a castle. The game's story is built such that you're watching  the sometimes goofy dialog as a spectator rather than participating in it. There  are a few occasions when the game will prompt you to choose from two different  responses, but often either response will bring about the same conclusion. That  tightly controlled narrative, however, often works in the player's favor by  keeping the game flowing instead of the wandering common in other RPGs, where  players waste time looking to each townsperson for direction.Overall, the game's wonderfully illustrated sets, light exploration and problem  solving, and a handful of jaw-dropping full-motion video scenes makeThe  Legend of Dragoonfun to play and hard to put down.--Porter HallPros:Hours upon hours of story and gameplayTurn-based battle made more exciting by combo-attack-style \"additions\"Many different monsters, spells, weapons, and itemsCons:Very linear gameplay offers no chance to affect outcomeStylish pre- and postbattle sequences quickly grow tiresome", "price": 126.92, "imUrl": "http://ecx.images-amazon.com/images/I/61VSBSPlQtL._SY300_.jpg", "related": {"also_bought": ["B00004TC6E", "B0000296O5", "B00004Y57G", "B000038IFX", "B00000JRSB", "B00004SPW9", "B0045L3SNQ", "B000K6TOK6", "B000038ABO", "B00000IM2T", "076153007X", "B0015MMN6G", "B00005LOXE", "B00004XOWT", "B00002SVWG", "B00002R28C", "B00008RUYZ", "B000637T7S", "B00000K39I", "B00004W4QJ", "B00002STPG", "B00004S9AC", "B000006OVE", "B00005MA97", "B00005TNI6", "B00004XMRL", "B00002SVX5", "B000034DBS", "B00005BW7Q", "B00006LEMK", "B00004U4R4", "B001TEYMRI", "B00002SWCJ", "B00008URUA", "B00000I1BF", "B000FDOTIQ", "B00004ZEEH", "B000G7X5P4", "B00006C28X", "B00005T7ZN", "B00000JNHJ", "B00001OWYW", "B00004S4YD", "B0002GTFIK", "B00002SV4N", "B0015IXKSK", "B00004SWM0", "B0009A4EV2", "0761537430", "B000F5IH2I", "B000006OVJ", "B000TLU67W", "B000LWRMHQ", "B00000K1VE", "B00029QQNY", "B00004ZDFY", "B00000JHPN", "B00000DMAR", "B00007KQC1", "B00008W2R8", "B00001IVCC", "B000G77X34", "B00004S9AD", "B00000I1C1", "B000G82R20", "B000034DC6", "B000R2YWEQ", "B000034DCF", "B00005YO7I", "B000034DC2", "B0019LMXAY", "B00001XDUB", "B0002CHJAA", "B00024W1U6", "B00000JIUG", "B000066TS5", "B000038AAN", "B0009A4EVM", "B001G3B0HC", "B00004RBQX", "B001C6GVI6", "B00001ZWMV", "B00001X50M", "B000BKSGH8", "B00000I1BK", "B000G7X5MM", "B00008KTRS", "B0014CN2H6", "B00000I1BR", "B00002STJO", "B0009XBWY6", "B00001X50L", "B000GACEHQ", "B00000I1C0", "B00001X50N", "B00005Y402", "B00000K2X5", "B000038I9H", "156686903X"], "bought_together": ["B00004Y57G", "B0000296O5"], "buy_after_viewing": ["B00004TC6E", "B0045L3SNQ", "B00004Y57G", "B00005TNI6"]}, "salesRank": {"Video Games": 6831}, "categories": [["Video Games", "More Systems", "PlayStation 2"], ["Video Games", "More Systems", "PlayStation", "Games"]]}