{"asin": "B000HHYEKI", "description": "Amazon.com Product Description The Mio DigiWalker C310x is a stylish, pocket sized device which combines GPS based portable navigation with a fully featured MP3 audio player. Whether you're heading across town or across the country, the Mio DigiWalker C310x is the perfect travel companion. Wherever the road ahead takes you, the C310x makes it easy to get where you're going.The C310x is a stylish and powerful handheld personal navigation and digital entertainment device. See more detail:Back-Memory Slot. You can alsosee it in action.Large icons and a bright display make it a snap to use.Built in audio player plays mp3s or audio books.User friendly menus in 16 languages.DesignOne of the most striking features of the C310x is its stylish design, which invites you to take the device with you no matter where you're going. Completely self contained and ultra portable, the C310x slips easily into pocket or purse and truly adds a new dimension to the concept of portable navigation. The unit is also easy to use; large, easy-to-read icons, a bright 3.5-inch display, and a user-friendly touch screen make it simple to set your destination.The C310x weighs only six ounces and measures 4.33 x 2.76 x 0.79 inches (W x H x D). Under the hood, the unit features a WAAS-enabled, SiRFstarIII GPS chipset for extreme accuracy, 1 GB of onboard ROM and 64 MB of RAM, as well as an SD/MMC card slot for memory expansion. The unit connects to your PC via USB, and the included lithium-ion battery lasts up to five hours.NavigationThe C310x comes complete with preloaded maps of the entire U.S. (Alaska and Hawaii included) to make sure that you're up and running right away. You also get a huge database of preloaded points of interest (POIs) so you can easily locate restaurants, hotels, gas stations and more. The device guides you every step of the way with clear voice instructions and user-friendly menus in 16 languages, including English, French, and Spanish.EntertainmentTo make sure your road trips are complete, the C310x also features a full-featured MP3 player. Great for listening to your favorite albums or audio books while you're on the road (or on the plane before you get on the road) the C310x MP3 player boasts a number of customized EQ settings, a built in speaker and a 3.5-millimeter headphone jack. And for the ultimate in convenience, you can use the integrated SD memory card slot to easily carry your music collection with you.What's in the BoxC310x, USB cable, car charger, mapping DVD, device holder, mount", "title": "Mio C310x 3.5-Inch Portable GPS Navigator", "price": 79.99, "imUrl": "http://ecx.images-amazon.com/images/I/512y5Fhd5%2BL._SX300_.jpg", "related": {"also_viewed": ["B00HK6CPVY", "B007N6K3AG", "B00BIZ0EY8", "B00C9W1LT6", "B0015F1L7A", "B000OH63MI", "B0015EWMX8", "B00HLYAI4Q", "B0066IUPS2", "B0011ULQNI", "B003WNOOFE", "B0007LJHVA", "B004E59I00", "B000H866BM", "B002Y3IAVC", "B001S2RDGS", "B0048A8TTW", "B0057ODOCA", "B002ACBNXO", "B00GRS8NYO", "B0050JJU3E", "B0052D38UE", "B001U0O7T4", "B001ELJ9P6", "B003ZHVBQM", "B007T9LDU6", "B000PCBVA6", "B0057OCS9A"], "buy_after_viewing": ["B0057ODG6Y", "B002I8VLAK", "B004I5BUSO", "B0057ODOCA"]}, "categories": [["Electronics", "Car & Vehicle Electronics", "Car Electronics", "Car Video", "In-Dash DVD & Video Receivers"]]}