{"asin": "B00000I1BF", "description": "Spyro is a cute purple dragon in a bit of a pickle. Each of Spyro's dragon friends has fallen victim to the nefarious Gnasty Gnorc, who has turned them into crystals. Accompanied by Sparx the dragonfly, Spyro sets out to free his buddies, while collecting gems and dragon eggs. Sparx also serves as Spyro's health-o-meter, glowing gold when Spyro is healthy and turning dusky green as he tires. To boost his energy, Spryo can blast docile creatures with fire, turning them into butterflies, which Sparx transforms into much-needed fuel.This title has bright graphics in six well-developed worlds, each with several subworlds, including bogs, deserts, and ice worlds. Unlike some action games, inSpyro the Dragonthe enemies are more fun than frightening. In the Peace Keepers world, for example, Spyro must burn down the monster soldiers' tent, sending one of the minions running out, quaking with fear or, if you're lucky, dropping his drawers and shooting a moon.Spyro's movements (fire breathing, gliding, jumping, and climbing) require entry-level gaming skills. For this reason,Spyro the Dragonis an excellent title for youngsters or less experienced players, who want to play without having to master complex movement combinations.--Kasty ThomasPros:Large worlds provide hours of game playingVariety of scenariosEngaging graphicsCons:Low game skill requirements may prove less challenging for expert players", "price": 90.0, "imUrl": "http://ecx.images-amazon.com/images/I/61v4CXiLksL._SX300_.jpg", "related": {"also_bought": ["B000034DC2", "B00004U4R9", "B00000I1BQ", "B00000I1BR", "B00000DMAR", "B000K6TOK6", "B0045L3SNQ", "B0015MMN6G", "B000034DCF", "B00006F2ZP", "B00004XOWT", "B00005MA97", "B00004U4R8", "B00001QHW9", "B000637T7S", "B0001CJCG0", "B000PWAAAI", "B00000JNHJ", "B00000I1BS", "B0015IXKSK", "B000029706", "B000ECX0FQ", "B0062DIGA0", "B00000IG7T", "B000TTXL9E", "B000TLU67W", "B001TEYMRI", "B0018YDKB8", "B00000K1VK", "B000GACEHQ", "B00004TBGT", "B00002STIW", "B00004YRQ9", "B00004YRQA", "B00005NCCI", "B000021Y5T", "B0000690ZE", "B00001XDK5", "9629971372", "B00001QED2", "B00005NISJ", "B001DIFV98", "B00EEFDNJ2", "B001MW91IW", "B00001QER9", "B007UHQO6A", "B00005R5PO", "B00004SPYF", "B000SEU92W", "B0000C7GHG", "B000066TS5", "B00001ZWXH", "B00005Y402", "0761518606", "B00004YZAO", "B0013JHKU0", "B000034DJ5", "B002DGG9KY", "B0015ACX3Q"], "bought_together": ["B00004U4R9"], "buy_after_viewing": ["B00004U4R9", "B0045L3SNQ", "B000034DC2", "B00000I1BQ"]}, "salesRank": {"Video Games": 2059}, "categories": [["Video Games", "Kids & Family"], ["Video Games", "More Systems", "PlayStation", "Games"]]}