{"asin": "B002I0GXWO", "description": "DescriptionThe innovative, fast-paced combat ofDISSIDIA FINAL FANTASYreturns with all-new and enhanced features, adding characters from classic FF titles, new tactical possibilities using Assist Characters, a fully immersive world map setting, and much more. Pit your favorite characters from the FINAL FANTASY series against one another in this follow-up to the best-selling PSP&reg; game of 2009!View largerView largerView largerKey FeaturesNew characters join the roster- The star-studded roster fromDISSIDIA FINAL FANTASYis expanded, adding new fan-favorites including Kain fromFINAL FANTASY IV, Tifa fromFINAL FANTASY VII, and Yuna fromFINAL FANTASY X. Over thirty characters come together for the greatest assembly in the series' historyEnhanced battle system- The groundbreaking blend of frenetic fighting and character progression first introduced inDISSIDIA FINAL FANTASYreturns, now with all-new gameplay additions. Call in a second character to assist during battle, counter your opponent's EX moves, and use EX Revenge to slow time and pummel your opponent! New costumes, new play styles, and new environments come together for a fully updated experience!Immersive RPG elements- True to its heritage,DISSIDIA 012[duodecim] FINAL FANTASYfeatures an enthralling single-player experience. Wage the endless war between Cosmos and Chaos across a world map replete with quests, characters, and shops. With RPG Mode, you can even play out battles in the command style of classic FINAL FANTASY installments.Product DescriptionCosmos, the goddess of harmony. Chaos&mdash;god of discord. Two divine powers locked in an endless struggle, each seeking to reign supreme.Long has the world played stage to their violent conflict, now at peace, now teetering on the verge of annihilation, but never for a moment striking a balance between the two.The scars of war run deep across the realm. And still these battles rage on, a tempest the eons cannot quell.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/51cte3LUKBL._SY300_.jpg", "related": {"also_bought": ["B001TD6SN0", "B0014X7SQ6", "B004LLRYOY", "B002I0GZ5Y", "B000SSPH3E", "B001KMRN0M", "B0045U4U52", "B000NPTOTK", "B000NPOGWK", "B003YVK5T8", "B00356GVRW", "B000G0O6CW", "B000R37S00", "B001GXI4LM", "B002BS47TE", "B001HWF1OA", "B004BV5O0U", "B000CBCVEK", "B005EYJ4PO", "B000R37S78", "B000HKMG14", "B0010YOQIW", "B007ZH9OFI", "B000ASBKHE", "B003L51GW2", "B004OP65CY", "B003O21OWY", "B000R3BN4M", "B003LDKJEA", "B003WTR2QQ", "B000G79XQO", "B003VMWR14", "B00523VFJU", "B000SSQPU8", "B000CI83LI", "B000VIPJ0W", "B002E6XY6K", "B003Q9RG9K", "B002P69VAC", "B000F2DE8S", "B001V7UX1W", "B001COTC3E", "B000FDOTIQ", "B001CM0PJ6", "B002TK3GH8", "B001TILU88", "B000UKQGA8", "B001CM62UM", "B000CBCVF4", "B00002R28C", "B0045SE9XC", "B000A8FV3S", "B002I09830", "B00184219U", "B002EQFXZA", "B0010EF0UK", "B002AB41IE", "B00BFU8IFS", "B00004Y57G", "B004R0TR0S", "B001TIFML4", "B001YYQ9SS", "B001CB9VSS", "B000R39IKI", "B00BY0G0YU", "B000QTD05M", "B000GABOTU", "B002BS47WG", "B0050JN7ZG", "B0007V804U", "B000HNJ5WE", "B00KVRK39A", "B008SBZD5U", "B000CBCVEU", "B002I08UPC", "B000F5IH2I", "B004I8EEMU", "B001F513VO", "B002DGNLFK", "B000FG65EY", "B001TOQ8T8", "B0013AX2JM", "B00136MBHA", "B0009XBXQ8", "B0029ZUPYK", "B001RTCOW0", "B0010YOQIM", "B00D87TCN8", "B001G3B0HC", "B00005TNI6", "B003O6JIVE", "B000E0OCQY", "B000UZH7P6", "B007R4X3AG", "B0015HZLV0", "B006JKARU8", "0744008379"], "bought_together": ["B001TD6SN0", "B001KMRN0M"], "buy_after_viewing": ["B003YVK5T8", "B000SSPH3E", "B0014X7SQ6", "B002I0GZ5Y"]}, "salesRank": {"Video Games": 1844}, "categories": [["Video Games", "Sony PSP", "Games"]]}