{"asin": "B001FWXDZQ", "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]], "description": "Amazon.com Product Description -- Posted October 19, 2008  Get great sound throughout the room with Logitech's Pure-Fi Express Plus Speaker Dock for your iPod or iPhone. The Pure-Fi Express Plus features omnidirectional acoustic technology, which provides great sound at a more consistent level throughout the room. It also includes the ability to run on AC or battery power, which--along with an integrated handle--makes it easy to take your music from room to room. Other features include a clock with alarm, so you can rest assured that you&rsquo;ll wake on time; and a wireless remote control that works from up to 30 feet (10 meters) away, and stores neatly in an integrated compartment. In all, it's a great way to dock, play, and charge your iPod or iPhone.Logitech&rsquo;s Omnidirectional Advantage: Make Any Spot in Your Room a Sweet SpotYou don't sit in one spot when you&rsquo;re listening to music from your iPod. Shouldn&rsquo;t your speakers produce great sound no matter where you are in your room? Most of today's speakers for the iPod are designed to deliver the highest-quality sound immediately in front of the speakers. If you move from what audiophiles call the sweet spot on the couch to the impromptu dance floor, the sound you hear can easily become distorted, and you might find yourself out of step.The Logitech Pure-Fi Express Plus omnidirectional speakers are designed to transmit sound more consistently over a wider range of space, so you never miss a beat--no matter where you are in the room.Traditional Versus Omnidirectional LoudspeakersMost speakers are designed to radiate sound in a fixed direction. As shown in Figure 1, traditional speakers optimize sound for a sweet spot located directly in front of the speakers. In other words, the sweet spot is limited to a constrained sound field that fans outward in one direction. If you&rsquo;re outside the sweet spot, you&rsquo;ll hear unbalanced sound due to loudspeaker directionality.Logitech Audio Labs' omnidirectional speakers differ from traditional speakers. Designed to radiate sound more uniformly over a wider range of frequencies and angles, Logitech&rsquo;s omnidirectional speakers create a broad sweet spot that is not dependent on a fixed listening position, as shown in Figure 2. The true hallmark of omnidirectional speakers, however, is the increased sound quality that comes from tonally balanced direct and reflected sound. The increased reverberant sound field also increases the sensation of spaciousness and listener envelopment. By designing loudspeakers to radiate sound more uniformly, Logitech delivers great sound to any spot in the room.iPod/iPhone Speaker DockLets you dock, play and charge your iPod or iPhone.Omnidirectional Acoustic TechnologyNormal stereo desktop speakers deliver sound from discrete sound locations, making a more focused sweet spot. Logitech&rsquo;s omnidirectional speakers transmit sound consistently across the room and create a much larger sweet spot, allowing for great sound anywhere in the room.Portable PlayerPlugs in or runs on batteries, so you can take your music from room to room. Integrated handle included.Clock with AlarmHelps you rest assured that you'll wake on time.Wireless Remote ControlGives you control from up to 30 feet (10 meters) away, and it stores neatly in an integrated compartment.Check Out Other Stylish iPod and MP3 Logitech SpeakersLogitech Pure-Fi Dream Speaker for iPod and iPhoneIt's the ideal music system for the bedroom. With a built-in alarm clock and backlit controls that light up with a wave of your hand, the Pure-Fi Dream brings clear, rich sound to your room.Logitech Pure-Fi Express Plus Omnidirectional Speaker Dock for iPod and iPhoneThe Pure-Fi Express Plus speaker dock features omnidirectional acoustic technology, which provides great sound at a consistent level, throughout the room.Logitech Pure-Fi Anytime Premium Alarm Clock for iPod and iPhoneThe Logitech Pure-Fi Anytime is an iPod/iPhone alarm clock that offers premium sound with innovative features that make it the perfect nightstand companion.Logitech mm32 Portable SpeakersEnjoy high-quality portable sound for your iPod, Zune, or other MP3 player--anywhere you go. And the cradle design makes it easy to recharge while you listen.System SpecificationsSupports iPhone and all iPod models with a 10-pin dock connector. The system supports 1st through 3rd generation iPod models (and other portable music players) via a 3.5-mm auxiliary input. Also, it uses the Apple Universal Dock specification.What's in the BoxLogitech Pure-Fi Express Plus speaker dock, wireless (IR) remote control, iPod/iPhone Universal Dock adapter trays, quick-start guide, warranty and safety guidelines, and 2-year limited hardware warranty.", "title": "Logitech Pure-Fi Express Plus Omnidirectional Speaker Dock for iPod and iPhone", "price": 67.55, "imUrl": "http://ecx.images-amazon.com/images/I/41P4nkFG9BL._SX300_.jpg", "brand": "Logitech", "related": {"also_viewed": ["B003VANOI6", "B001G5Z82I", "B002I3OZ7G", "B00170IBF8", "B005KQ2O2G", "B002I3OZ6W", "B002I636XM", "B003Z9L390", "B000UPBUP4", "B005IVL0UA", "B0038W0N8G", "B003M8HWDA", "B005OYR9D8", "B003SX0NG2", "B004TS2AP2", "B007PZYBSA", "B008N73V7G", "B000ARSLB8", "B002Y5XQYG", "B0064XTQ98", "B004SKBJP8", "B00BQ4HRG4", "B007PZYBR6", "B009E6J78C", "B004T0MW7Q", "B001V5OCCK", "B001S0JZKW", "B000UPA82U", "B007JCNOHI", "B002M78L6E", "B009CWRVH2", "B005GUAIJM", "B00BQ4HRE6", "B005KSZ430", "B0017IZ8ZQ", "B003ZQYVVK", "B0015AQLJI", "B00475Y24E", "B000F49RAA", "B004T1Y8G8", "B004SKBJ5S", "B004SKBJYE", "B009I7XCYM", "B0060DVYW4", "B008BLDI4U", "B009UFG4W4", "B00462QC2I", "B002OB4BK8", "B004I8WH7E", "B002IT1BFO", "B00538NGEG", "B003SX0NFI"], "bought_together": ["B000SE6IV8"], "buy_after_viewing": ["B003VANOI6", "B001G5Z82I", "B002I3OZ7G", "B003SX0NG2"]}}