{"asin": "B002BSA20M", "description": "&nbsp;&nbsp;Product Overview&ldquo;Halo: Reach,&rdquo; developed exclusively for Xbox 360, is theblockbuster prequel to the landmark &ldquo;Halo&rdquo; video game franchise and is the biggest game yet in the Halo series.&ldquo;Halo&rdquo; is one of the biggest video game series in history, and is the top selling franchise on Xbox. It has defined a generation of gamers and changed how people view video games.&ldquo;Halo: Reach&rdquo; tells the tragic and heroic story of Noble Team, a group of Spartans, who through great sacrifice and courage saved countless lives in the face of impossible odds. The planet Reach is humanity&rsquo;s last line of defense between the encroaching Covenant and their ultimate goal, the destruction of Earth. If it falls, humanity will be perched on the brink of destruction.Product FeaturesWelcome to Noble Team. &ldquo;Halo: Reach&rdquo; immerses you in the ominous and heroic story of &ldquo;Halo: Reach&rdquo; as you play as a member of Noble Team, a squad of iconic Spartan soldiers, each with deadly talents as unique as their individual personalities and customized gear.An Intense and Epic Campaign. Live the events that set the stage for the &ldquo;Halo&rdquo; trilogy as the UNSC and Covenant clash at the height of their military power. New weapons, vehicles, and abilities complement the familiar &ldquo;Halo&rdquo; arsenal for the largest-scale battles ever witnessed in the &ldquo;Halo&rdquo; universe. Fiercely cunning artificial intelligence (AI) adds depth and complexity to each encounter, helping make every play-through a unique and challenging experience, whether players go it alone or connect with up to three friends to launch a cooperative assault.The Definitive Multiplayer Experience. The &ldquo;Halo&rdquo; series has set the gold standard for the multiplayer experience in video games. &ldquo;Halo: Reach&rdquo; continues that rich tradition by introducing a dramatically expanded suite of multiplayer offerings that promise once again to redefine the landscape of online gaming.Stunning Technical Advancements. &ldquo;Halo: Reach&rdquo;takes a significant leap forward with all-new enginetechnology representing the next generation of art,audio, AI, animation and Hollywood-style specialeffects. Power through massive scale combat across sweeping open environments and fight up close and personal along side new characters and creatures as you unravel mysteries buried deep in the &ldquo;Halo&rdquo;universe.New social settings for match making enable you to play with the people you want, find like-minded teammates, vote on preferred maps and game types and also keep an active roster.Matchmaking is now integrated across every facet of &ldquo;Halo: Reach,&rdquo; including campaign mode and Firefight.The next generation of Firefight mode lets players go head-to-head in versus mode and allows for an incredibly deep level of customization and replay ability by allowing players to change game rules and settings.New multiplayer game modes like &ldquo;Invasion&rdquo; and &ldquo;Arena&rdquo; offer competitive players a chance to show off their skills like never before.Forge tools and the advent of the Forge World space enable players to construct entirely new maps and game modes and share them with the &ldquo;Halo&rdquo; community over Xbox LIVE. The future of &ldquo;Halo&rdquo; multiplayer experiences will continue to grow and be shaped by the people who play it for years to come.Player Customization &amp; Reward. &ldquo;Halo: Reach&rdquo; gives you the ability to customize and personalize your Spartan with a staggering array of armor accessories that will appear in both multiplayer and campaign play. Across every game mode, you&rsquo;re rewarded for everything you do, for every style of play, earning valuable credits that can be used to unlock additional cosmetic upgrades via the Armory.", "price": 19.99, "imUrl": "http://ecx.images-amazon.com/images/I/518gBIgB%2BRL._SY300_.jpg", "related": {"also_bought": ["B001HWB68K", "B000FRU0NU", "B0050SYX8W", "B0050SYY5E", "B0034JKYO6", "B00008J7NZ", "B00FKV8AK6", "B002I0H79C", "B00D9EPI38", "B003ZSP0WW", "B00503E8S2", "B0017HW5LM", "B00005NZ1G", "B004HYK956", "B004JSDQPU", "B002I0H2AG", "B007XVTR3K", "B00BU3ZLJQ", "B003JVKHEQ", "B00269QLI8", "B000FRU1UM", "B002I098JE", "B00BMFIXT2", "B0050SYLRK", "B000ZK9QD2", "B0050SYK44", "B0050SYILE", "B004GWW0H4", "B000TG530M", "B003O6G5TW", "B000FRS9II", "B003C1I0CO", "B0030HIULQ", "B0050SWVIQ", "B00BRQN2EM", "B0050SYV70", "B000MUXLOK", "B005YR1VP2", "B00309U0M6", "B003R783IY", "0765367297", "B000QY9C90", "B000RHZ9JI", "B000OLXX86", "B00936K09S", "B0050SY77E", "B000K8YAKI", "B00CXTX2YW", "B002BRZ852", "B002I0HD9G", "B002I0JGDM", "B00269DXCK", "B002BSA1MQ", "B00CHGYUE2", "B0019MLWL4", "B006ZTHGCK", "B002DC8GKE", "B004Y3951E", "B003K1IJW2", "B00FATRKOK", "B001YI0Z2U", "B001E93IWI", "B0037LTTRO", "B003L8HQ7S", "B00273Z9WM", "B00EVWZHLK", "0765367300", "B003O6E67A", "B00DC9SWWE", "B002I0J9M0", "B00FT88K9G", "B002DC8GMM", "B005VQ77PY", "B0002A2S26", "B0016B28Y8", "B000TI836G", "B003O6EB70", "B008I629WU", "B002I0JAVK", "B00309S9YW", "B000SQ5LQ4", "B004FUL9YW", "B007WQOIGW", "B0043B5SKE", "B003O6E986", "B008B3AVNE", "B000P46NMK", "B0022TNO7S", "B003O6JJKY", "B005C2D2MO", "B002I0JDC6", "B000R0PLK2", "B007MJSZDQ", "B002MED6F8", "B004EW948E", "B00E6X5S7W", "B001CMIUYS", "B00C71034I", "B00EQNP8F4", "B004U9T6FM"], "bought_together": ["B0050SYX8W", "B000FRU0NU"], "buy_after_viewing": ["B0050SYX8W", "B000FRU0NU", "B001HWB68K", "B0050SYY5E"]}, "salesRank": {"Video Games": 162}, "categories": [["Video Games", "Xbox 360", "Games"]]}