{"asin": "B000VOU91U", "related": {"also_bought": ["B000SMVQK8", "B000HCGAFK", "B001C79R3Q", "B000J45BK6", "B000N3LL02", "B000PC62O6", "B000TLXCDW", "B000OLC64I", "B0052MHQM6", "B000JL4Y3Y", "B004QYM55O", "B000VX6XL6", "B001658JLA", "B000OT94PO", "B006DX0K0I", "B000LTN8CC", "B00CODYQTM", "B00COE5ITI", "B0028R3NCU", "B0046TJG1U", "B007K7I83C", "B0002JJU50", "B00COE5IRU", "B004S464WM", "B006J4FZW4", "B00BQA5BWU", "B001CQT0X4", "B000Q8623U", "B00H7KTRO6", "B000FGNM6I", "B009QOYK2U", "B0094AE0XU", "B001C0DJL4", "B008L1JKAG", "B00200K1TS", "B00C3IK7I2", "B00488G6P8", "B009QZH7D8", "B0040DEI9M", "B006DWR2HI", "B0015R2NUW", "B00B95MZ44", "B001R1ZQKU", "B003WGJYCY", "B001R6SRMO", "B00AFY2S56", "B00A6SOGC4", "B000WH6H1M", "B001F6YRNO", "B00CS9AYBQ", "B000WPDKRI", "B002LZSXE2", "B0012Y2LLE", "B000WQKOQM"], "bought_together": ["B000SMVQK8"], "buy_after_viewing": ["B000HCGAFK", "B00488G6P8", "B000LTN8CC", "B000PC62O6"]}, "title": "SanDisk 2GB MicroSD / TransFlash Card w/SD Adapter camcorder", "price": 5.16, "salesRank": {"Cell Phones & Accessories": 24077}, "imUrl": "http://ecx.images-amazon.com/images/I/413ro8RlBpL._SY300_.jpg", "brand": "SanDisk", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Memory Cards", "Micro SD Cards"]], "description": "2 GB Memory (SDSDQ-2048-A10) in TransFlash/ Micro SD/ Mini SD/ SDIO format is an ideal way for you to add more memory to your cell phone!2 GB Memory Card: will Easily expand and customize your cell phone entertainment experience and share content with other personal electronic devices. You are no longer constrained by embedded cell phone memory limitations.How much Memory do you need? Click here for a Storage Chart.WHAT YOU GET2 GB Micro SD memory carda (May be SanDisk Kingston or Dane-Elec). SD/ SDIO adapter to hold TransFlash/ Micro SD in other devices using SDIO slots. Mini SD adapter to hold TransFlash/ Micro SD in other devices using MINI SD slots. Jewel case. Lifetime warranty applies. Motorola TransFlash/ Micro SD 2 GB Memory Card + MINI SD adapter + SD/ SDIO Adapter can be used with USB SD Card Readers to Easily transfer files from your cell phone to your computer or other memory device. Be certain you have the correct Memory card desired as Memory cannot be returned unless replacing a defective memory card.If you cannot locate your cell phone owner's manual refer to SanDisk cell phone compatibility chart here. Supported Models and Categories:Audiovox SMT-5600 / SPV-C500 (HTC Typhoon) Cell Phone AccessoriesUTStarcom SMT5800 Cell Phone AccessoriesUTStarcom XV6800/ PPC6800/ HTC Titan Cell Phone AccessoriesAudiovox CDM-8940 Cell Phone AccessoriesUTStarcom CDM8945 Series AccessoriesAudiovox PPC4100 PDA Series AccessoriesAudiovox PPC5050/ HTC Falcon AccessoriesAudiovox PPC6600/HTC Harrier AccessoriesAudiovox PPC6700/ HTC Apache AccessoriesAudiovox Sharp TM150 Series AccessoriesDanger Sidekick 1 Series AccessoriesDanger Sidekick Slide Series AccessoriesPalm Centro 690 Series AccessoriesPalm Treo 600 Series AccessoriesPalm Treo 650 Series AccessoriesPalm Treo 680 Series AccessoriesPalm Treo 700 Series AccessoriesPalm Treo 750 Series AccessoriesPalm Treo 755 Series AccessoriesHitachi G1000 AccessoriesHP 510 Series AccessoriesHP 6300 Series AccessoriesHP iPAQ hw"}