{"asin": "B001989B4S", "description": "EA SPORTSFight Night Round 4is truly the return of the champ. Building offFight Night Round 3, one of the best-selling and most critically acclaimed games to come out at the onset of the Xbox 360 hardware launch,Fight Night Round 4promises to be equally as groundbreaking and revolutionary. With an all new physics based fighting engine, new physics driven animations, truly unique and differentiated boxer styles, and the most impressive boxer roster ever, including the return of the legendary Iron Mike Tyson, EA SPORTSFight Night Round 4takes video game boxing and fighting to an entirely new level..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Rivalries both old and new.View larger.Fighters from different eras &amp; weight classes.View larger.Improved damage system.View larger.New defensive block system.View larger.Realistic ring environments.View larger.New Physics EngineFeaturing a dramatically improved physics engine,Fight Night Round 4brings players closer to the sweet science than ever before. Through these upgrades fighters are rendered more vividly than ever and action is animated as it happens, meaning that not only are no two rounds the same, but no two punches are the same either. This variety in punches is most evident at the point of impact, where players will see everything from the sweat splatter of devastating shots, to the energy-sucking effects of solid body blows and the virtual lack of impact glancing blows may have on a determined opponent. But when enough of any punches land the damage system built into the new physics system will allow players to clearly see the impact on opponents exactly when and where you hit them. A bloody nose or lip, a cut or swelling over the eye, a bruised forehead or shoulder; players will see them all, and it's their choice whether to take advantage and go for the stoppage.In addition, the improved physics also makes for a significantly faster gameplay experience. Along with the game's controller and overall movement tweeks this allows player's to string together punches into devastating combinations. Although a single punch still has the potential to take down a rival, just as in real boxing match, combinations and the ability to avoid them are the key inFight Night Round 4.Height, Reach and Styles MatterAs in real boxing, where height and reach have advantages and disadvantages depending on your opponent and your skill,Fight Night Round 4forces players to use their fighters' physical characteristics and styles to their advantage, or suffer the consequences. these consequences come by way of fighters ability to now fight effectively in close, as well as from a distance. For example, shorter fighters are often faster than taller opponents and tend to do better on the inside against taller fighters, but they must get inside first. If they choose to fight at a distance, the advantage is lost. Similarly, height and the assumed longer reach that goes with it is a sizable advantage, but only if a fighter \"fights tall,\" that is stand up straight and utilizes the jab and other punches to maintain the optimal distance to from opponent that allows him to hit and not be hit in return. Slouch and/or abandon the jab, and the reach advantage is lost.New Heads Up Display Adds Blocking AbilityIn addition to the traditional Heads Up Display (HUD), which has always providedFight Nightplayers with a visual representation of the changing health and stamina or their fighters,Fight Night Round 4adds blocking to its HUD. Designed to both provide an ongoing way to monitor your fighter's ability to defend himself when not punching and facilitate action during rounds by encouraging players to develop additional defensive and offensive skills, blocking is yet another realistic addition introduced byFight Night Round 4. When players lose the ability to block punches they can not avoid punches thrown by opponents and must go on the offensive or take the punches. Blocking ability, as well as health and stamina can be replenished between rounds by assigning points accumulated for action in the ring to any of the three physical states/abilities.Roster of FightersFight Night Round 4features a large roster of fighters from multiple eras and weight classes. Made up of more than 40 fighters this elite group provides players with the ability to not only relive past and current rivalries, but to also create new ones across time to solve the question of who is really the greatest of all time. Just a few of the fighters that players can expect to take into the ring include: Mike Tyson, Muhammad Ali, Joe Frazier, George Foreman, Roy Jones Jr., Manny Pacquiao, Lennox Lewis, Sugar Ray Leonard, Winky Wright, Eddie Chambers, Ricky Hatton, James Toney.Key Game Features:Physics Based Gameplay Engine- No fight will be the same with an all-new physics-based gameplay engine that recreates the full spectrum of true-to-life punch impacts, giving boxers a devastating arsenal of punches, blocks and ring movement. the new physics system allows for missed punches, glancing punches, knockout blows and for the first time ever, rough and tumble inside fighting.Realistic Boxer Styles-Fight Night Round 4emulates the styles of history&rsquo;s greatest boxers like never before. Pressure your opponent with the brawling inside style of young Mike Tyson, bobbing and weaving to set up powerful hooks and uppercuts. Capitalize on Muhammad Ali&rsquo;s reach, hand speed and fleetness of foot to bewilder your opponent with lightning fast jabs and straights from the outside.Extensive Boxer Roster- the greatest of all time, fighting in their prime.Fight Night Round 4lets you create fantasy matchups, such as Tyson versus Ali, and finally settle who is king of the ring. With a boxer roster spanning both history and modern times, the matchup possibilities are endless.Online Support Through Xbox LIVE-Fight Night Round 4features full Xbox LIVE support including 2-player multiplayer options and LIVE achievements and gamer points.Legacy ModeLegacy Mode isFight Night Round 4's career mode. Through it players develop their fighter from the ground up, starting in amateur competition which progresses into a career as a pro and may even include steps up or down into multiple weight classes to take on new challenges. Within this mode players can either accept the fights made for them, or create their own schedule of opponents. Either way, the goal is to rise in the ranks from contender, to champ, hall of famer, superstar and eventually the greatest ever. To do this players must not only win their bouts, but gain popularity and additional prestigious matches by winning them convincingly.", "price": 75.72, "imUrl": "http://ecx.images-amazon.com/images/I/51vybi6t1xL._SY300_.jpg", "related": {"also_bought": ["B004CVQUGQ", "B000CRSBLQ", "B0030CV356", "B0053BSNZU", "B002BS61X4", "B003IMGC2C", "B006VB2UNM", "B000FRU1UM", "B0017ZDGWG", "B002I0JK38", "B007M6W38W", "B003O6EAM6", "B001D7T2XA", "B00C710AZ0", "B003R783IY", "B0016BRKJG", "B001SH7YMG", "B00647630Y", "B003IE9V28", "B002MED6F8", "B0048C8VKM", "B000MAFXUA", "B0043QL2FE", "B003JVKHEQ", "B001GJ306U", "B00075GLW4", "B001PKHRVE", "B006VB2UO6", "B0012N3ZXS", "B002W5GIBQ", "B0022TNO7S", "B00386ZE6I", "B003KZOXZ0", "B00AY1ALTU", "B00AY1CT4U", "B004WL4LWQ", "B000WQ4KHQ", "B000MUXLOK", "B006KYYP06", "B00CMC6HZ6", "B003ZSP0WW", "B005GSRCZ2", "B00386VN0E", "B000ZKDOVW", "B0047OK31Q", "B000P297JS", "B005GWU0FM", "B000QU1CDS", "B001PB9J14", "B0083RDT8C", "B001AZFSG0", "B002WDL5L6", "B0013Y1G8C", "B003O6G6RI", "B000FRS9II", "B002VAWXO8", "B001TOMQTY", "B002SRSQ72", "B00ARCWQOO", "B002BCXALQ", "B0086V5V9A", "B004Z4ZJZS", "B002I0HBZW", "B003HF4QIM", "B0050SYILE", "B000MAFXTQ", "B000UKZ20S", "B0042GW7C2", "B000ZK9QD2", "B004LLVW42", "B004BD1DWG", "B001LX4BMI", "B004P8GL60", "B003O6EA4E", "B004YVOCYG", "B000ZK696O", "B000EXZALC", "B001AWIOYG", "B006ZTHGCK", "B0007SL202", "B002I0H95E", "B0018RWMPK", "B0023CBY4E", "B0053BQREE", "B0050SYV70", "B006D3JWR0", "B002I0HAOO", "B00175GC4U", "B0076ZPYPI", "B0009WPZOA", "B0043B5SKE", "B004HYK956", "B008277M0Y", "B002TDIEE0", "B002QHDKE8", "B001UU1WTC", "B002I0JB6E", "B003O6E986"], "bought_together": ["B004CVQUGQ", "B0053BSNZU"], "buy_after_viewing": ["B004CVQUGQ", "B000CRSBLQ", "B0053BSNZU", "B00C710AZ0"]}, "salesRank": {"Video Games": 7323}, "categories": [["Video Games", "Xbox 360", "Games"]]}