{"asin": "B000034DMG", "description": "Resident Evil 2 is the first really big, ultrahyped blockbuster of '98, and what Capcom has pulled off is more an interactive, cinematic experience than a video game. Seriously. Picking up a few months after the events of the first game, RE2 sees the entire town of Raccoon City hit with the devastating virus that zombified only a few dozen folks in the original Resident Evil. It's up to rookie cop Leon Kennedy, and Claire Redfield, sister of one of the main RE characters, to save not only themselves but any and all survivors, to boot. The gameplay remains basically the same as before: As one of two characters, you solve puzzles and shoot monsters. The original Resident Evil featured two playable personas as well, although the differences between the two weren't incredibly significant. One could carry more items than the other could, while the other was easier to play, and they both had their own distinct storylines. In Resident Evil 2 the differences between the two are a bit more interesting. For example, Claire starts off with a lock pick, while Leon begins with a lighter, which alone changes the order in which the game's puzzles must be solved. Each character also finds different weapons along his or her quest. For instance, Claire will find a grenade launcher, however when playing as Leon, a shotgun will be in its place. In addition, Leon and Claire encounter a string of different characters throughout the game, so naturally their stories don't unfold in nearly the same way. The subtle changes between Claire and Leon don't make each character's story feel completely different, but they're enough to make you want to know what happens further into the game.  On top of that, once you play through the game as one character, a second scenario is opened up for the other - for instance, win the game with Claire and you'll unlock Leon's alternative scenario. (It's kind of like Quentin Tarantino's Jackie Brown, where you see how one situation or scenario looked from another character's perspective.) And since both characters are supposedly running through the many locations of Raccoon City at the same time, the things you do in the first scenario will affect the other character in his or her second scenario. For instance, if you pick up the submachine gun with Leon the first time out and you later go to the same place with Claire, the submachine gun won't be there. Admittedly, it's mostly cool in concept, since it really doesn't come into play that much. What really makes Resident Evil 2 so amazing is simple: It has more of what people liked about the first Resident Evil - weapons, ammo, creatures, and most importantly, many, many instances when you'll be genuinely scared. If you played the first game, you're sure to remember that your first encounter with a zombie took your breath away, and that you ran scared from the game's boss. These types of terrifying moments are commonplace in Resident Evil 2, and the effect is awesome. How does it scare you? Well, as in the great classic horror movies, it's a combination of eerie low-key mood music and sound effects such as a lone dog howling at the moon in the distance (that could just be right in the next room), followed by loud, shrieking music played perfectly on cue and sudden jolts of terror, like the arms of a zombie bursting through a boarded up window, right as you happen to be walking by. Things like that.  Of course Resident Evil 2 comes with all of the trimmings: 3D-rendered backgrounds with 3D polygonal characters running through them. Visually, it looks a lot like the first Resident Evil game, except with incredibly improved graphics and character animations. For example, the heroes, zombies, and other creatures now all move with true realism, with head-tracking effects that make them look at what is near them (like a rabid dog or a zombie eating a dead policeman). Also improved over the original is that you can tell the extent of your character's injuries simply by looking at his or her body language instead of having to repeatedly check the status screen to see how hurt your character is. There are one of three states: perfectly functioning, holding the side in pain but still functioning properly, and unable to run and in horrible pain. This damage system is both effective and cool. This isn't to say Resident Evil 2 is flawless though, as there are some points that could have been improved. Some of the puzzles just seem a little out of place and might make more sense in a different setting... a police station that has a room with three large statues, one with a ruby in its hand, and some sort of pressure-sensitive floor that triggers the ruby to fall out of the statue's hand? C'mon! It's not as much a problem as the inventory management system, which hasn't been changed at all. As in the first RE, you are only allowed to carry eight items at any time (except for an item that allows you to carry a few more items). You must mindlessly keep bringing items to and retrieving them from these \"magical\" storage bins that somehow share contents with aother bins, and always seem to be really, really far from where you are. If realism is what the developers were shooting for, as it seems to be in RE2, then you should have the ability to set items down wherever and pick them back up again at your leisure, and you should be able to carry more things, too. Really, a key and a rocket launcher don't take up the same space or weigh nearly the same.  But in the end, Resident Evil 2 is one of the most entertaining games I've ever played. With its unique camera angles, storyline, graphics, sound effects, and music, Resident Evil 2 seems more like a product out of Hollywood than the video game industry. Resident Evil 2 surpasses its predecessor in nearly every aspect of gameplay, and in short, Capcom has outdone itself.--Ryan Mac Donald--Copyright &#169; 1998 GameSpot Inc. All rights reserved. Reproduction in whole or in part in any form or medium without express written permission of GameSpot is prohibited.--GameSpot Review", "price": 125.0, "imUrl": "http://ecx.images-amazon.com/images/I/51q7Lmr4fGL._SX300_.jpg", "related": {"also_bought": ["B00000I1BY", "B0019LMXAY", "B00000K1VA", "B00005ME6N", "B00000K1VE", "B00001XDUB", "B000B69E9G", "B00001X50M", "B000038ABO", "B000006RGS", "B0045L3SNQ", "B0000TSRA6", "B0000657SP", "B0015MMN6G", "B00001OWYW", "B00004WMVL", "B000K6TOK6", "B00006LELI", "B00005ME6O", "B00004Y57G", "B0000296O5", "B00000JRSB", "B00005MA97", "B000637T7S", "B00000I1C1", "B000021Y5P", "B0007L8GPI", "B00004XOWT", "B00000K2X5", "B00000IODY", "B00004W4QJ", "B00002R28C", "B00002SVWG", "B00004TC6E", "B00009KO3N", "B000006RGR", "B000TLU67W", "B00269DXR0", "B00004XOM1", "B000006P0K", "B00004YRQA", "B00001ZUGT", "B00269DXXO", "B00000I1C0", "B0001Y7404", "B0011BE3KA", "B00007LV7Y", "B00005LOXE", "B00008RUYZ", "B00007KQC5", "B00000I1BF", "B001TEYMRI", "B00004TEXU", "B000QTD05C", "B00005NCCR", "B00004U4R9", "B0020H46D8", "B000P297F2", "B00000DMAR", "B001383L36", "B000034DC6", "B00000I1BR", "0671024418", "B00005ML10", "B00001ZWMV", "B00001QED2", "B000034DCF", "B00004R9IG", "B00000DMB4", "0671024396", "B00000DMAV", "B000038IFX", "B00004SPW9", "B000034DMT", "B00000K10U", "B00B59L9T6", "B0012N94WO", "B000PWAAAI", "B00000K39I", "B00004TBGT", "B00000I1BQ", "B0009I6S0O", "B00000I1BK", "B00000I1BG", "B00001QER9", "B0002RQ3ES", "B000CBCVFE", "B00002STJN", "B000034DC7", "067102440X", "B00000I1BJ", "B00000DMB6", "B00004YRQ9", "B004UDB9SA", "B00019HNNC", "B00005OLX1", "B0050SXLQC", "B000059Z7Q"], "buy_after_viewing": ["B00000I1BY", "B000B69E9G", "B00000I1BJ", "B00005ME6N"]}, "salesRank": {"Video Games": 2937}, "categories": [["Video Games", "More Systems", "PlayStation", "Games"]]}