{"asin": "B00JP7R7DC", "description": "High quality craftsmanship using sturdy Microfibril PU Leather Cover Case, effective protection of your Kindle screenThe surface of this Inateck Kindle cover is made using fine and high quality Microfibril PU Leathe, it is dirt-repellent, water and sweat resistant. The material feels comfortable and natural to the touch, possible friction between screen and cover surface is minimised. Your Kindle is thoroughly protected when choosing this protection cover.Better TogetherThe cover automatically puts your Paperwhite to sleep when it is closed and wakes your device upon opening making it so easy to jump back into your latest book. The magnetic button ensured that the cover remains firmly shut, but can be opened without much effort, without using cumbersome hooks or nubs.&nbsp;Closing and opening can be realised effortless, while your Paperwhite is effectively protected from most external adversities, be it at home, abroad or in the office.On the GoThin, Simple &amp; Lightweight, Compact and durable, this cover is perfect for taking Kindle Paperwhite wherever you go. When you are finished enjoying your content, simply close the cover to put your Kindle Paperwhite to sleep and you are good to go. The integrated magnetic closure will ensure your cover stays shut while in a backpack, purse, or briefcase.Lose Yourself in Your Readingits precise, form-fitting frame ensures a seamless fit, allowing you to focus on reading without being distracted.&nbsp; Reliable enough to endure long-time use, so you can get lost in your reading.", "title": "Inateck Compact Kindle Paperwhite Cover Microfibril PU Leather Protection Cover Case - Sleep Mode Control Through Magnetic Induction for New 2014 &amp; 2013 &amp; 2012 Amazon Kindle Paperwhite 6&quot; 3G / Wi-Fi + 3G - Simple &amp; Lightweight - Blue (will only fit Amazon Kindle Paperwhite)", "price": 9.99, "imUrl": "http://ecx.images-amazon.com/images/I/51OfddYsatL._SY300_.jpg", "related": {"also_viewed": ["B00GIY960C", "B00KKDITJQ", "B00JZVZTGU", "B00IQMW85E", "B00LSD51I4", "B00JZVZTHO", "B00KD7ZRJ4", "B00KD7V2KW", "B00IN0QKAI", "B009S2CXLK", "B00EYW9DSU", "B009LB2V3I", "B00E4RWIM8", "B00LHRYV9G", "B00KA27ZX8", "B00H1ORFBK", "B00IJPLMQO", "B00IQMUCA2", "B00FVU5VJE", "B00H1ORBJQ", "B00IN0VE0O", "B00H1ORHW2", "B00GALESHE", "B00AF1B3YG", "B00IGAF0YW", "B00H9XFU3S", "B00FGOMG2A", "B00IGU7FTU", "B00HA02RGS", "B00G8ZFP24", "B00JGPJKVU", "B009UHC7H8", "B00H9XFUVK", "B00H1ORGMS", "B00H1OR9RK", "B009S2CWX4", "B00IGU7FUO", "B00IGAF0YM", "B00J3G4D3W", "B00J3G4D00", "B00JGPJKZQ", "B00IJPLMRS", "B00B0I6D20", "B00E4S314Q", "B00LHS0BVM", "B00IGU7FU4", "B00FGOM66Q", "B00K727WUW", "B00EY850WW", "B00ITIQI88", "B00E4RWHNI", "B0098QDA7W", "B00FXJFEN6", "B00ITIQI92"], "buy_after_viewing": ["B00GIY960C", "B00JG8GOWU", "B00BGIQS1A", "B00EYW9DSU"]}, "categories": [["Electronics", "Computers & Accessories", "Touch Screen Tablet Accessories", "Cases & Sleeves", "Cases"]]}