{"asin": "B000JLIXI6", "description": "Set three years after the last chapter of Genkuro Yoshitsune's life,Genji: Days of the Blade, continues to expand on the historical accounts of feudal Japan.Days of the Bladeunveils beautiful next generation visuals and sword slashing gameplay as an exclusively developed title for the Playstation 3.Stunning visuals that take advantage of the PlayStation 3's next generation power.View larger.Pulse-pounding sword fighting.View larger.Can you handle all these enemies?View larger.Swap characters and weapons during gameplay to conquer your enemies.View larger.Deliver devastating attacks.View larger.Game StorylineThree years have passed since the young swordsman, Yoshitsune Minamoto, and his warrior-monk companion, Benkei Musashibo, defeated the Heishi Clan and their leader in a brutal battle over the possession of \"Hinaishi\"-- divine jewels that bring their owners godlike powers. With that success, it had finally seemed that peace, however temporary, had arrived.During this time, Yoritomo Minamoto, Yoshitsune's older brother and leader of the Genji clan, tracked the remnants of the Heishi to the South of Japan where he and his army were preparing to eliminate their weakened numbers.However, rumors begun to spread of new, ungodly creatures appearing within the Heishi ranks and their evil force re-strengthening, even without the use of the Hinaishi.Now, with the aid of his closest friends and some unlikely allies, Yoshitsune must once again wield his fierce blades and summon the powers of the Hinaishi in and epic battle to save all of Japan.GameplayPrepare for a next generation action/adventure that combines dramatic and fluid martial arts combat with an ancient historical tale of feudal Japan.Execute gracefully articulated swordplay while pulling off lightning quick lunges, multi-strike combos, and spectacular special moves that differ depending on the characters you are playing and the weapons the wield.Instantly swap between the four playable characters; young samurai Yoshitsune Minamoto, mighty warrior-monk Benkei Musashibo, Tamayori priestess lady Shizuka, and Lord Buson, the God of War who has taken up the earthly form of Kagekiyo Taira, the antagonist from the original Genji game, Dawn of the Samurai. Take advantage of each of their unique fighting styles and weapons, or pull off devastating team-based combos by interchanging characters between attacks.Partake in massive battles against hundreds of enemies simultaneously with no loss of frame rate or detail. Melee your way through entire armies on the battlefield while an epic war rages on around you.Equip and instantly switch between to different weapons at any time. Begin a move with one weapon, and finish off with another for devastating combination attacks. Each character has their own signature-specific weapons to choose from, of which you're certain to develop favorites.Collect Amahagane and Mashogane crystals, and then use them to strengthen your characters and weapons. You choose which warriors and weapons to upgrade, making each and every game experience unique.", "price": 14.9, "imUrl": "http://ecx.images-amazon.com/images/I/61Y09BCHJDL._SY300_.jpg", "related": {"also_bought": ["B000K9OR4Q", "B000HCJD68", "B000K9OP2A", "B00319DX4M", "B001ASJIS6", "B002X9KYFW", "B003O6HLOK", "B0030GBU2I", "B000ZK695U", "B000UW1YBW", "B00KWEHBAG", "B004WL4LOY", "B00D87TCN8", "B005185SDA", "B001D7T2VC", "B003O6G1L4", "B002I0J5FG", "B002I0J4AM", "B00IIB2JQG", "B002W5GI9I", "B005DVAB0A", "B003A6X0H6", "B00149NCYW", "B000JLIYLC", "B00BJH11FQ", "B00170823O", "B002BRYHY0", "B000R39GPA", "B000FQ2DTA", "B00ANGVX9I", "B000KLNLUK", "B0016C3260", "B000SQ5LQE", "B002DC8GKO", "B00B67ZTUW", "B000SQ5LNM", "B003171CEW", "B0007OGVXO", "B002BXJ9VA", "B0058VI2LA", "B000QAVV6G", "B006JKAS16", "B00BJH11D8", "B003O6JIVE", "B00BY0G0YU"], "bought_together": ["B000K9OR4Q", "B000K9OP2A"], "buy_after_viewing": ["B004WL4LOY", "B000K9OP2A", "B002I0J4AM", "B003O6G1L4"]}, "salesRank": {"Video Games": 6653}, "categories": [["Video Games", "PlayStation 3", "Games"]]}