{"asin": "B000YEKM0U", "categories": [["Electronics", "Portable Audio & Video"]], "description": "The ultra-portable iM207 Orbit by Altec Lansing lets you easily share your music with those around you. With a unique design that produces a full-bodied, 360-degree sound, you will hear the music loud and clear. And with a tiny footprint that easily fits in your purse or pocket, you can get the music started for an impromptu party at any time..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The Altec Lansing Orbit Speaker:projects sound in all directions;can tilt on its edge for personal listening;provides 24 hours of listening on three AAA batteries; andhas built-in cord management.The unique round design offers a 360-degree sound.View larger.Tipped on its edge, the speaker can be directed for personal listening.View larger.Unique, Round Design with 360-Degree SoundWith just a quick look at the Orbit, you know you're in for something special. Its round form uses a cone design integrated with a custom Altec Lansing speaker to project full, distortion-free sound in every direction. All your friends will hear the music and wonder where the great sound is coming from. If you would like a more personal listening experience, just put the Orbit on its edge for a more focused and directed sound.At just 3.5 inches in diameter and 1.6 inches tall, the Orbit will go wherever you go. Throw it in your pocket or purse and pull it out wherever you are: on a park bench, on the street corner, waiting for the bus. To turn it on, simply twist the entire speaker; this prevents it from accidentally turning on in your bag or pocket. And don't worry about damaging the Orbit; it's built to handle even the most reckless travelers.A smartly designed integrated cable management lets you wrap the cable around the speaker and keeps the stereo mini-plug out of the way when not in use.Outstanding Battery LifeYou don't have to worry about battery life with the Orbit; with three AAA batteries, the Orbit will play for up to 24 continuous hours, more than enough to keep the party going all night long.The Altec Lansing Orbit is backed by a one-year warranty.What's in the BoxOrbit speaker (with 3.5-inch cable attached) and user's manual.Get the party started no matter where you are.", "title": "Altec Lansing Music Speaker", "price": 18.0, "imUrl": "http://ecx.images-amazon.com/images/I/51fAweg8GPL._SX300_.jpg", "brand": "Altec Lansing", "related": {"also_bought": ["B008Y5GHCI", "B004CYKEBK", "B006KZ0R1Q", "B001ELK2NY", "B000KIPT30"], "bought_together": ["B008Y5GHCI", "B004CYKEBK"], "buy_after_viewing": ["B008Y5GHCI", "B004CYKEBK", "B006KZ0R1Q", "B0043ZWJHU"]}}