{"asin": "B000O8ENQK", "description": "From the ManufacturerWhat 80 Years of Audio Experience Sounds Like TodayIf you&rsquo;re as passionate about audio as the musicians who use our microphones, you deserve the legendary performance of Shure earphones. As a leader in the professional audio industry for over 80 years, we&rsquo;re proud to bring you personal listening products that reflect our experience and ongoing pursuit of audio perfection--and the new SE line of sound-isolating earphones is the latest step in approaching that perfection.Isolation, not CancellationShure Sound Isolating Earphones are unlike headphones that feature noise canceling technology. For listeners seeking maximum audio fidelity, the differences are key. Noise cancellation technology uses active circuitry to counteract background noise, which may introduce artifacts into your audio. Sound isolating earphones comfortably fill the ear canal and naturally block most background noise for a clear, detailed listening experience--all without the need to listen at high volumes which may risk damaging your hearing.Legendary Performance At Any LevelEach model has its own unique sound characteristic, providing increased range and detail as you move up the line:SE210 (white) / SE210-k (black):High-quality on-the-go audio utilizing Hi-Definition MicroSpeakers to deliver full range audio, the ergonomic design of the SE210 is ideal for premium on-the-go listening. The SE210 also offers a flexible design for multiple wearing positions.SE310 (white) / SE310-k (black):Breathtaking sound and style featuring Hi-Definition MicroSpeakers with a Tuned BassPort, the SE310 delivers extended range audio and optimized low-end performance. The SE310 also offers a flexible design for multiple wearing positions.SE420 (white) / SE420-k (black):Heart-pounding performance featuring Dual TruAcoustic MicroSpeakers, the SE420 uses a dedicated tweeter and woofer to provide a detailed sound stage. Lows, mids, and highs are distinct and defined for accurate reproduction of all the details of your music.SE530/SE530PTH:Pure audio precision--the SE530 uses Triple TruAcoustic MicroSpeakers to create an expansive sound stage. A dedicated tweeter ensures that highs and mids are incredibly accurate and detailed, while dedicated dual woofers provide balanced, full-bodied bass. The Push-To-Hear Control (included with the SE530PTH) adjusts levels of external sound for maximum intelligibility.", "title": "Shure SE530 Sound Isolating Earphones (Discontinued by Manufacturer)", "price": 437.8, "imUrl": "http://ecx.images-amazon.com/images/I/41gr702VgLL._SY300_.jpg", "related": {"also_viewed": ["B003NSBKT6", "B003NSBKSM", "B003NSBKSW", "B00EANUQ4S", "B00426DND4", "B004CXBJ6A", "B0000CE1UO", "B005Y7TTRE", "B003YOH8RW", "B00DIUGW6A", "B0019RBJOE", "B001MBLBXQ", "B00373PE9Y", "B004PNZFZ8", "B002LWOKJ2", "B001DCBBHK", "B000NDR2PA", "B004M4RTUY", "B005N8W27I", "B0000CE1VP", "B006K556L2", "B0094S35W4", "B0013JH30M", "B000NDHIHW", "B002QL3CX8", "B000VHUE0S", "B00FKY205O", "B005W1DSU6", "B0050L5VO4", "B00EXN4GK0", "B00A34TU7W", "B00C1DULJE", "B005OEN3EM", "B0007XGOTG", "B0007WZLDC", "B00ELAM8NC", "B001DX9EDW", "B00JB66VX4", "B00GB2YASO", "B00GAUBOK4", "B00D429Y12", "B003R0FJKG", "B0052HYAT8", "B000WAHFBK", "B000NIOVWC", "B0035JKJ7C", "B00JRPVO90", "B0001NNLHK", "B006K556FI", "B004P0ZEYI", "B00D42A16E", "B001NTFAOS", "B00573S3RC", "B000NDHIKY", "B0042BXSMU", "B00A16BT4E"], "buy_after_viewing": ["B004PNZFZ8", "B003NSBKT6", "B001DX9EDW", "B003NSBKSM"]}, "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]]}