{"asin": "B00126R3P6", "description": "Amazon.com Product Description.caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: 20px; } table.callout { font-family: Verdana, Helvetica, Arial, serif; margin: 10px; width: 250; } td.callout { height: 100 percent; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding: 10px; width: 250px; } ul.callout { list-style: inside disc; text-indent: -12px; font-size: 12px; line-height: 1.5em; } h5.callout { text-align: center; }The NETGEAR HD/Gaming 5 GHz Wireless-N Networking Kit WNHDEB111 offers:Use of the 5 GHz frequency for less interference.Works with: XBox, Playstation, Wii, TiVo HD, Slingbox, digital set-top boxes, NETGEAR's Digital Entertainer HD, Apple TV, network attached storage, and more!Automatic Quality of Service (QoS) that prioritizes voice, video, and gaming traffic.The NETGEAR HD/Gaming 5 GHz Wireless-N Networking Kit WNHDEB111 enables super-fast file transfers at the highest possible Wireless-N speeds, making it an ideal solution for network gaming and streaming HD videos. By utilizing patented metamaterial antenna technology, the WNHDEB111 offers a speed and range far surpassing the old Wireless-G standard.By operating on the less crowded 5 GHz frequency, wireless connections are stronger and faster.View larger.Easy SetupThe WNHDEB111 kit includes two access point/bridges, preconfigured to securely connect to each other. Setting it up is as easy as connecting one access point to your router/gateway, and connecting the other to your networkable device, such as your XBox, Playstation, Wii, TiVo HD, Slingbox, digital set-top boxes, NETGEAR's Digital Entertainer HD, Apple TV, network attached storage, and more. Setup is easily and securely done with a simple \"Push 'N Connect\" feature using Wi-Fi Protected Setup (WPS), which eliminates the need to remember or input security password keys. It automatically configures to access point or bridge mode depending on the type of Ethernet enabled device it connects to.To add another HD Bridge to your HD network, theNETGEAR 5 GHz Wireless-N HD Access Point/Bridgeis available.Minimal Interference = Outstanding PerformanceMost wireless devices today, such as Wi-Fi devices, cordless phones, Bluetooth devices, microwaves, and baby monitors, operate on the 2.4 GHz frequency, thus creating a lot of traffic and interference. The WNHDEB111, however, operates on the 5 GHz band which has up to 23 free channels and avoids the interference that most other devices must contend with.The WNHDEB111 complies with the latest Wireless-N draft specification for the fastest possible Wireless-N speeds. Automatic Quality of Service (QoS) ensures lag-free gaming and jitter-free HD streaming. It supports wireless \"ad-hoc\" mode for wireless LAN peer-to-peer gaming and supports multicast point-to-multi-point HD video streaming.The WNHDEB111 supports WiFi Protected Access (WPA2-PSK, WPA-PSK), and 64-bit and 128-bit WEP encryption and is backed by a 1-year warranty.What's in the BoxTwo 5 GHz Wireless-N HD Access Point/Bridges, two stands, two Ethernet cables, setup CD, two power adapters, and warranty/support information card.The WNHDEB111 avoids interference from 2.4 GHz wireless devices.Adding Wireless-N to your existing home network is simple.View larger.", "title": "NETGEAR WNHDEB111-100NAS Wireless N Access Point", "price": 79.99, "imUrl": "http://ecx.images-amazon.com/images/I/31NfZfuyGbL._SY300_.jpg", "related": {"also_viewed": ["B002HWRJY4", "B001498LIO", "B006V72AHC", "B00HQ883QW", "B002RYYZZS", "B0056VP0KS", "B008HO9DK4", "B008WJ6ISY", "B00GEBZJ00", "B00BK0YRZS", "B006FRKX5E", "B008LTPFG6", "B00EM5UFP4", "B001MVKZOC", "B005N6XBDO", "B003VWZE7S", "B004UBU8IE", "B0081H8TRA", "B0058X0TFA", "B008HO9DIG", "B001UI4RTG", "B002YETVXC", "B0085WN7YQ", "B0049YQVHE", "B001FWYGJS", "B004XXMUCQ", "B006QB1RPY", "B00416Q5KI", "B003Y5RYNY", "B0087NZ31S"], "buy_after_viewing": ["B002HWRJY4", "B006QB1RPY", "B001498LIO", "B0087NZ31S"]}, "categories": [["Electronics", "Computers & Accessories", "Networking Products", "Wireless Access Points"]]}