{"asin": "B002OOWC3I", "categories": [["Electronics", "Computers & Accessories", "Cables & Accessories", "Input Devices", "Graphics Tablets"]], "description": "The Bamboo Pen Tablet turns your computer into a virtual canvas, allowing you to create digital artwork with the touch of a pen. With its textured surface, the tablet simulates the intuitive feeling of pen on paper. Using the easy-grip pen, you'll be able to add hand-drawn embellishments to your favorite photos, add life to digital sketches, and add personal touches to scrapbook pages with ease.Included pen features 512 levels ofpressure sensitivity for precise drawings.View largerLarge, textured work surface and customizable keys give you artistic control.View larger.Sleek, Stylish, and Easy to UseMeasuring 9.8 by 6.9 inches, the Bamboo Pen is compact enough to store comfortably in a laptop case. It features a large and responsive active area, providing enough workspace for even your most ambitious projects. The tablet comes with a battery-free pen with an easy-grip design, so you can have maximum control over your drawing. The work surface is textured, providing a pen-on-paper feel. It's also reversible, so you can use it comfortably whether you're right- or left-handed.The Bamboo Pen is simple to set up, using a plug-and-play mechanism. Simply plug the tablet into your computer via a USB port, install the provided drivers, and you're ready to go. You'll be doodling, writing, and painting in minutes.Expand Your Creative Horizons with Precise Pen TechnologyWith the Bamboo Pen, digital drawing and painting are easier than ever. The tablet surface is designed to emulate the organic feel of working with traditional media, whether you're making fine dashes or wide, arching brush strokes.The pen features 512 levels of pressure sensitivity, giving your artwork a level of nuance that just isn't possible when you're using a mouse. You can use the pressure-sensitive control to vary line thickness, add shading, and control boldness. When used in combination with the included Corel Painter Essentials 4.0, the tablet becomes an even more powerful artistic tool.Bamboo Pen is compatible with Windows 7, Windows Vista, Windows XP (Service Pack 2) and Mac OS X (10.4.8 or higher.) It requires a powered USB drive, a colored screen, and a CD/DVD drive.What's in the BoxBamboo Pen tablet, Bamboo Pen pen, Quick Start guide, installation CD (includes driver software, interactive tutorial, and user's manual), software CD.", "title": "Wacom Bamboo Pen Tablet", "price": 59.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/41MFQW3V8yL._SY300_.jpg", "related": {"also_bought": ["B001NK395Y", "B003XQO38I", "B005S2FNC0", "B009D3CJCW", "B0089VGPII", "B0043SK9QU", "B008I647AM", "B004FK7MYS", "0077332113"], "buy_after_viewing": ["B00EN27U9U", "B00EN27TCI", "B005HGBEZ2", "B00EN27UC2"]}}