{"asin": "B005FVDTAW", "categories": [["Electronics", "Accessories & Supplies", "Audio & Video Accessories", "Headphones"]], "description": "Hear only what you want to with background noise on mute. Featuring Sony's advanced digital signal processing technology, ambient noise is reduced by up to 98.2% with these mdr-nc200d premium digital noise canceling headphones. Whether you're at the office, on a plane or train, built-in artificial intelligence (AI) technology automatically adjusts to your surroundings to offer the optimal level of noise canceling customized to the environment and sound conditions. High quality audio is yours with 40mm driver units, full digital amplification and a high performance digital equalizer delivering the highest highs and lowest lows for incredible-sounding music. Cushy, feather-soft ear cushions provide maximum comfort, plus an ultra-compact, collapsible design makes these headphones perfect for travel. General information manufacturer Sony corporation: general information manufacturer part number mdrnc200d: general information manufacturer website address Sony: general information brand name Sony: general information product model mdr-nc200d: general information product name mdr-nc200d headphone: general information product type headphone: miscellaneous package contents mdr-nc200d headphone1 x operating instructions1 x 1.5m connecting cord1 x warranty card1 x Sony lr03 (size AAA) battery1 x in-flight plug adapter (single/dual)carrying case: warranty limited warranty 90 day: technical information connectivity technology wired: technical information cable length 4.92 ft.: technical information sound mode stereo: technical information impedance 68 ohm: technical information minimum frequency response 8 Hz: technical information maximum frequency response 23 kHz: technical information connector plating gold plated: technical information features noise cancelling, noise reduction: battery information battery size AAA: battery information maximum battery run time 22 hour: earpiece design earbud: earpiece type binaural: e", "title": "Sony MDRNC200D Digital Noise-Canceling Headphones (Discontinued by Manufacturer)", "price": 170.19, "imUrl": "http://ecx.images-amazon.com/images/I/41ZcD23ndTL._SY300_.jpg", "brand": "Sony", "related": {"also_bought": ["B000067RC4", "B0031RG832", "B002HWJT1A", "B005LA53BK", "B004GXBY48"], "bought_together": ["B000067RC4"], "buy_after_viewing": ["B001EYU3L2", "B002HWJT1A", "B00H0PWF06", "B0054JJ0QW"]}}