{"asin": "B001O1OBFY", "description": "Following the vast popularity of Pok&eacute;mon Diamond and Pok&eacute;mon Pearl, Pok&eacute;mon Platinum is the newest in the core series of Pok&eacute;mon games. Pok&eacute;mon Platinum features a new story full of adventure, never-before-seen forms of powerful Pok&eacute;mon &ndash; including the legendary Giratina's Origin Forme &ndash; and the Distortion World, a mysterious new world that suddenly appears in the Sinnoh region. In addition, with Pok&eacute;mon Platinum up to 20 players can interact with other Pok&eacute;mon fans from around the world in the new Wi-Fi Plaza, featuring mini-games and activities. Players can also enjoy the new features in the Global Terminal, such as posting battle videos using the new &quot;Vs. Recorder.&quot;&nbsp; In addition, Pok&eacute;mon Platinum features a new Battle Frontier, where the toughest Trainers can test their skills in new ways. Pok&eacute;mon Platinum already has broken previous Nintendo DS sales records in Japan, selling more than 1 million copies in its first two days of release.Pokemon Battle!View larger.1 to 20 Players via Wi-FiView larger.New amusement park-style Wi-Fi PlazaView larger.The StoryTeam Galactic is up to its old tricks. This time, they've set their sights on the three Legendary titans of Sinnoh: Dialga, Palkia and Giratina. In this thrilling new Pok&eacute;mon adventure, you'll encounter new characters, new schemes and new locations. Prepare yourself for an exciting excursion into the Pok&eacute;mon world as you do your best to thwart Team Galactic's sinister plot.Key Game Features:Put a stop to Team Galactic's plan involving the three Legendary titans of SinnohLeap from a piece of land suspended in midair and walk sideways or upside-down in the new Distortion World, where the powerful Giratina residesChallenge yourself in new ways in the Battle Frontier's five new Battle Facilities, each with its own rules and each run by one of five new &quot;Frontier Brains,&quot; similar to Gym LeadersMeet new Team Galactic Commander Charon and the undercover detective Looker, who's pursuing Team GalacticGather up to 20 players from around the world in the new amusement park-style Wi-Fi Plaza, and compete with up to three other players in a variety of new mini gamesFor 1 player, or for up to 20 players via the Wi-Fi Plaza featureExclusive to the Nintendo DSPok&eacute;mon Platinum Version comes bursting with new locations to explore and new characters to encounter, adding to the overall excitement of this fun-filled world. The game's enhanced storyline introduces you to Charon, a new Commander of Team Galactic, and an undercover detective nicknamed &quot;Looker&quot; who's investigating Team Galactic. Discover fascinating new locations, such as Distortion World, in which the normal rules of time and space don't apply, allowing you to walk sideways or even upside-down, as well as the Battle Frontier, containing five new Battle Facilities in which you can encounter thrilling new challenges. Connect with friends from around the world in the amusement park-style fun of the new Wi-Fi Plaza, where you can play games, take part in parades and even watch fireworks.", "price": 274.58, "imUrl": "http://ecx.images-amazon.com/images/I/61tUzhiY0UL._SX300_.jpg", "related": {"also_bought": ["B0038MTE7C", "B0038MVFYC", "B000MJB1WU", "B000MJB0H6", "B004EW2PC6", "B004EVWYYG", "B0050SVNSU", "B0050SVNP8", "0761562087", "B000MRNUBC", "B002CJ8Z04", "B00A1AQJAO", "B000I10PY2", "B0053B66KE", "B000VXJEW6", "B0053B5RGI", "B00BGID6QK", "B005LUUWL6", "B000FO4KO8", "0307468038", "B0006SSR24", "B000084314", "B0006GBD04", "B0006GBCZU", "B00KI2OZ9M", "B00K848IH0", "B007RUY1NS", "0307895610", "B001290A3U", "B0013B30SE", "B00554I09Y", "B002FCEVYM", "B0009Z3MGA", "B00CQ9L1Z6", "B00554KF7O", "B001DO5BWY", "B001T8W2LW", "0804162573", "B00IVJ1M7M", "B00005LBHM", "B00DTCYCAU", "B002C1TJP2", "B000FW9NE2", "B001TOMR6Q", "B00028S9P8", "B00E1A1SP6", "B00078ZGTA", "B000LLUXDW", "0307890600", "0307468054", "B000G75AXE", "B001O1PAMC", "0804163219", "B008GEH9HO", "B00AYABWYE", "0307895602", "B000NUBY0C", "B004K6LQAS", "B001TD6SK8", "B00000IYEQ", "B000OAJKI4", "B00GANWVJE", "B003O6E800", "B007QVG3LG", "B00AYBVB44", "B0002TB4CW", "B006OI3CTS", "0761556346", "B002I0EH6I", "B001TH8HAS", "B001C6H8LA", "3940643610", "B002I096AA", "B00009WAUF", "B000B69EA0", "B002I08UPC", "B00000IYER", "B000CNESHG", "B00004TEYR", "B0000E5U6M", "B005NJVQ60", "B00004TCT3", "B0014DHIL6", "B003X0CGJW", "B000087PM3", "B002I094AC", "B000047GEI", "B000FW57OC", "B001C58T5U", "B007PX6MFM", "B00005J53A", "B000U5W3IW", "B0053BCO00", "B002I0GU2M", "B001A01FD0", "B000ERVMI8"], "bought_together": ["B0038MTE7C", "B0050SVNP8"], "buy_after_viewing": ["B0050SVNP8", "B0023ZJMZY", "B0053B66KE", "B0038MTE7C"]}, "salesRank": {"Video Games": 2379}, "categories": [["Video Games", "Kids & Family", "Nintendo DS", "Games"], ["Video Games", "Nintendo DS", "Games"]]}