{"asin": "B002LZUY8A", "categories": [["Electronics", "Car & Vehicle Electronics", "Vehicle Electronics Accessories", "Radar Detectors"]], "description": "Escort's team of engineers has created one of the most sensitive radar/laser detectors on the market. RedLine provides the longest range for every signal out there. Its twin-antenna design allows it to maximize performance by band, giving you the longest warning possible. The RedLine includes full X, K, SuperWide Ka, and Safety Warning System radar capability, front and rear laser detection, dual antenna with varactor-tuned (VTO) microwave receiver, digital signal processing (DSP) for superior range and reduced false alarms, Escort's patented Mute and AutoMute, audible and visual band alerts, and all the performance you'd expect from Escort.Twin-antennadesign maximizes performance by band, giving you the longest warning possible.Click to enlarge.RedLine. Dual Antenna. Incredible Range.Superior DetectionThe RedLine includes full X, K, SuperWide Ka, and Safety Warning System radar capability, front and rear laser detection, complete with digital signal processing (DSP) for superior long-range ability and reduced false alarms. The exclusive AutoMode intelligently reduces false alarms, plus Highway and Auto NoX settings. And no need to worry about range: dual antenna with a varactor-tuned receiver provide the longest range possible against all radar threats.Ultra-bright 280-LED alphanumeric display.Click to enlarge.Includes quick-release windshield mount with suction cups, coiled SmartCord, travel case.Click to enlarge.Ultimate UndetectabilityBeltronics' TotalShield RF Technology provides the ultimate in undetectability. The exclusive technology makes the RedLine invisible to radar detector detectors, including the latest technologies like VG-2 and Spectre.Mute and AutoMuteEscort's patented AutoMute feature automatically reduces the alert volume after initially alerting you at your selected volume. This keeps you informed without the annoyance of a continuous full-volume alert. If you'd prefer, you can turn the AutoMute feature off.Easy to UseEnjoy control right at your fingertips using the included SmartPlug power cord. Patented Mute and AutoMute technology on the cord allows you to quickly silence alerts without reaching for the detector. Simple preference settings lets you customize up to 8 features.Installation is also a breeze: use the quick release mount to attach it to your vehicle's windshield, and remove it in a snap. A durable zipper travel case is included to take the unit with you, or neatly conceal it in your vehicle.Ultra-Bright Text DisplayDon't miss a visual alert with the Redline's 280-LED alphanumeric display. With five levels of brightness viewable from any angle, it's easy to track and display multiple radar signals, including signal strength. The new SpecDisplay provides actual numeric radar frequency for any radar signal, and you can also view Safety Warning System (SWS) messages about upcoming hazards, construction and more.Safety RadarSafety Warning System, or SWS, uses a modified K-band radar signal to alert users of Highway Construction or Maintenance, Highway Hazard Zone Advisories, Weather Related Hazards, Travel Information/Convenience, and Fast/Slow Moving Vehicles. The SWS safety radar system has 64 possible messages (60 currently allocated), all of which can be displayed on your C65.One Year Limited WarrantyGet extra peace of mind with Escort's one-year limited warranty. The company also offers a two year extended service plan.What's in the BoxEscort Redline Radar Detector (Black), Owner's manual, Quick reference card, Quick-release windshield mount with suction cups, Coiled SmartCord, Travel case.", "title": "Escort RedLine Radar Detector", "price": 499.95, "imUrl": "http://ecx.images-amazon.com/images/I/41Z8Ac2RpqL._SY300_.jpg", "brand": "Escort", "related": {"also_bought": ["B0063N7OZ2", "B00CYSHUG8", "B001DSIMAI", "B006JJFP56", "B0003NN83U", "B001ODDBSU", "B0003NN83K", "B00I4GT5XK", "B002J47Q3O", "B003DNSJPE", "B0003NN81M", "B006JJFPVA", "B006074LT8", "B00JG5ZMVC", "B00C3UG3LA", "B002GEBRAK", "B003PJ6QPQ", "B00D3NXM2Y", "B00B7NOMTY", "B00HSVIOKC", "B004C2C1UO", "B00E40QPX8", "B0063N7HZE", "B00B7NUETG", "B003RQBKLC", "B005LA0RES", "B0065LZ19I", "B003LL1JUA", "B004AHADOC", "B00HPM6E5Q", "B005VFXT2U", "B001F0RPGG", "B0052ZI4WY", "B00F474DVG", "B00BGWD6EI", "B0016LE80K", "B0073WDPEQ", "B008L2XYZC", "B00AWRHW6G", "B000BKJDKM", "B004S22KFE", "B000GKEXK2", "B00IH5VVHQ", "B0002BGELQ", "B000T28DT4", "B009Y7MJVS", "B00AXX0IC4", "B002M3HO0M", "B00F3F0GLU", "B004QJVU78"], "bought_together": ["B001DSIMAI"], "buy_after_viewing": ["B001F0RPGG", "B00E40QPX8", "B0063N7OZ2", "B001TE5V0U"]}}