{"asin": "B00DSW9D7S", "categories": [["Beauty", "Skin Care", "Face", "Exfoliators & Scrubs", "Exfoliators"]], "description": "Your Search For the BEST, Most Effective All Natural Facial Scrub is Over!Bid a long overdue farewell to rough, dry patches.Break up with dead, flaky skin.Put the kibosh on the signs of aging. Say hello to brighter, tighter, smoother skin.All with one product?Yes!'Get Refreshed'Jojoba Facial Scrub, only from Vi-Tae, is a rich and powerful exfoliant that will buff, polish and perfect your skin starting from the very first use.The best skincare ingredients come from Mother Nature, and we can't argue with that.What separates'Get Refreshed'from the myriad of other exfoliants out there? It's about what we put inandwhat we leave out.We've packed this purified water-based formula with amazing natural exfoliants like jojoba seed powder (these antioxidant seeds protect against free radicals and block the damaging effects of toxins in the air, thus slowing down signs of aging caused by environmental stress).Get that youthful glow and touchable feel your face has been craving!We've bolstered this superior formula with silt, one of the planet's most natural substances, and one of nature's very best skincare stars. Rich in mineral-packed sea salt (an amazing exfoliator), oxygen and healing clay, the European Freshwater Colloidal Silt featured in'Get Refreshed'is deeply nourishing and highly rejuvenating, penetrating deep down below the pores to reveal fresh, toned skin.Aloe leaf juice powder is a powerful skin healer and moisturizer. And that's not all! We've topped it off with bentonite - an omnipotent, regenerative, clay.To sum it all up with a pretty satin bow,'Get Refreshed'is a must-have for vibrant, gentle exfoliation, in a luxurious serum form that won't scratch or irritate your skin.Try'Get Refreshed'Jojoba Facial Scrub today! Money Back Guarantee EXTENDED for 1 Year!", "title": "Jojoba Facial Scrub, Exfoliating &amp; Smoothing Serum, Gentle, All Natural - &quot;Get Refreshed&quot; - For all Skin Types. Great for Oily/Sensitive/Acne Skin. Organic Ingredients &amp; Bentonite To Clean, Smooth &amp; Tighten Your Skin. You'll LOVE This! Money Back Guarantee EXTENDED For 1 Year!", "price": 32.95, "salesRank": {"Beauty": 77839}, "imUrl": "http://ecx.images-amazon.com/images/I/41AnbZ8-1-L._SY300_.jpg", "related": {"also_bought": ["B00DHOUZ92", "B00FZESMKG", "B00G0EJYFW", "B00DTEYUEQ", "B00IKD3MX6", "B00IMLLW6A", "B00HKLFZI4", "B00ES0Z206", "B00AG4QCAM", "B00DTEX2NQ", "B00H4M38NS", "B00G75X158", "B00DSXU52O", "B00BCMNRZK", "B001ABLKK2", "B00EKLPLU4", "B00GZ0WFQG", "B001ELX290", "B005584GCK", "B00JSLULNI", "B00DS842HS", "B0019LVFSU"], "also_viewed": ["B009D6ZMPU", "B00DHOUZ92", "B00GSSDHCG", "B00FZESMKG", "B00DTEYUEQ", "B002ZIZHCQ", "B00HKLFZI4", "B00IMLLW6A", "B00IMHXI1Q", "B00JAPRZPE", "B00DTEX2NQ", "B00DTEZIXI", "B00H4M38NS", "B00KNJOLSA", "B003435JWY", "B001ABLKK2", "B00JMBKI7I", "B00DMD4QBG", "B003JLOE0O", "B00IVPWOAK", "B000QUJ1O0", "B00ES0Z206", "B005LR8KDG", "B005MWYSOK", "B00CKF3NS4", "B00DSXU52O", "B00B4C35IW", "B00IBS9QC6", "B004MJIL92", "B003607ZNG", "B00C8YCFU4", "B003WYKQQO", "B00G0EJYFW", "B002FU07YM", "B005LR8KA4", "B0057B30FO", "B000XA0R32", "B005MWWW48", "B00JQ12U0M", "B00BDEZ0J8", "B00J9SUTWS", "B00GNGFBO0", "B0040ZHUH2", "B00K32VXTW", "B00J5D8BY0", "B00IWH6MH8", "B00JE26DSI", "B003JLL3NK", "B00K5ZN0CU", "B00A6XM16M", "B003XUMQ7E", "B001LFI71W", "B00JH1D0SM", "B00GCZ9VPC", "B00I1ISDZM", "B00AACC0AG", "B0072CXUDI", "B00IMHN0B4", "B000US25IW"], "bought_together": ["B00DHOUZ92"]}}