{"asin": "B001UWGCW2", "description": "Singularityis a first-person shooter developed by the legendary Raven Software and utilizing the power and flexibility of the Unreal 3 game engine. Set in an alternate present of 2010, players take on the role of a US Air Force pilot who while investigating an extreme radiation signature, stumbles upon a top secret Cold War era Soviet program, run amok which not only causes monstrous mutations, but also threatens to alter nature of time itself..caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(http://images.amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; }Speed up time to reduce enemies to dust.View larger.Or gain from turning back the clock.View larger.Classic FPS gameplay.View larger.A revisionist Cold War storyline.View larger.StoryIn the dark, Cold War winter of 1949-50 Stalin, the brutal leader of the Soviet Union, had two super weapons: long range missiles and the atomic bomb. But even if his teams of forced labor managed to build a missile powerful enough to carry an atomic payload, Stalin still faced encirclement by the United States and the Strategic Air Command. He knew that he needed another advantage over the United States, one that would ensure Soviet security and superiority. Then came the chance discovery on the remote island of Katorga-12 off the wild Kamchatka peninsula, of a previously unknown material, Element 99 (E99). E99 became the new source of Stalin's hope: a new energy source of unparalleled power. Unfortunately, the new element also yielded a new kind of contamination risk. But these were acceptable risks to Stalin - anything for the advancement of the Soviet people. Even so, on September 21, 1950, driven to complete the project, and in violation of the safety protocols, a Russian scientist, Viktor Barisov, personally triggered a device powered by E99 that caused a catastrophic event that affected the entire island. What happened next is unclear. However, there are reports that Stalin's final dying order was a handwritten scrawl to quarantine Katorga-12. And so the knowledge of the island remained buried...until 2010, when intelligence reports in the west confirm activity on a remote atoll in the Russian Federation's shadow. The world has no memory of Katorga-12. No concept of what may be on the island off the southeast coast of Russia. It is deemed that the world can't afford another Chernobyl - or worse. America's answer is to scramble a stealth flyby of the area. They need recon - and they need it now.Gameplay and WeaponsAction inSingularityis a mix of combat mission gameplay and puzzle-solving. Combat is against both modern and 50s era Russian forces, as well enemies mutated through exposure to E99. In this players have their choice of conventional weapons including: pistols, shotguns, machine guns, sniper rifles, rocket launchers, etc., as well as as few Sci-fi weapons very specific to the game. These include the TMD (Time Manipulation Device) and the E99 pistol. The TMD is a gauntlet, which players acquire early in the game that can be integrated with conventional weapons. Its main function though relates it its ability to alter time within a small specific area. The major examples of this are:Reversion- The ability to alter encounters by rewinding the history of an item or entity to the time of your choosing. This can be used to repair broken items, render enemies harmlessly embryonic, etc.Aging- The ability to alter encounters by fast-forwarding the history of objects or entities, rendering the former rusted and worn and the latter decrepit with age or simply dust.Stasis- The ability to freeze time and thus dangerous situations in order to gain an advantage.Impulse- The ability to propel objects frozen in time in a targeted direction.Chronolite- Functionality that allows the player to look back to a time associated with a place, person or object.Players can also utilize the TMD in conjunction with the E99 pistol, a gun that shoots bullets infused with Element 99, to hit targets unreachable due to distance and otherwise indestructible cover. In addition, to the TMD's combat uses, it is also indispensable as a tool for solving the spatial-oriented and other types of puzzles that players will face on the island of Katorga-12.MultiplayerSingularitycontains multiplayer gameplay options, that just as in its single player campaign, integrate conventional combat tactics and weapons with the time manipulation elements.Key FeaturesAn engrossing storyline blending Cold War history and science fiction elements.An arsenal of first-person weapons, including conventional firearms and upgradeable, time altering gadgets.Mission progressing puzzle-solving gameplay.Advanced graphics built on the Unreal 3 game engine.Multiplayer gameplay options.PlayStation Network support including PlayStation Trophies.", "price": 29.99, "imUrl": "http://ecx.images-amazon.com/images/I/51nTYsraXDL._SY300_.jpg", "related": {"also_bought": ["B0050SX2MK", "B003H0CBYS", "B000NGP1R8", "B004EW948E", "B00354NANC", "B003P9FRGA", "B002I0K5NC", "B003GT8IL0", "B00170823O", "B00163LW7K", "B001CRM3YQ", "B004ML44Y6", "B000KLNLUK", "B00319DX4M", "B003S2MXQG", "B0016GC9D8", "B0014UGK8G", "B002BRZ6UE", "B002BRZ744", "B004LWEK7C", "B008E6ZXTA", "B00309XHD0", "B0050SXGU8", "B00432O50W", "B00320JAWY", "B0056WJA6C", "B000SQ5LQE", "B004FUI84G", "B0012N3T3Y", "B003Q55YCU", "B0043M64GK", "B0022TNO7I", "B002DC8GKO", "B000R3CIV4", "B000HKMPVA", "B000JLIXIG", "B00149ILDO", "B008XMSR6G", "B003O6HDRU", "B003FBL85M", "B005185SDA", "B005C2D1YI", "B0023CBZ70", "B00104KCF8", "B000X1TC0U", "B0050SWUTQ", "B00BU3WVM6", "B003O6HE0Q", "B003O6E67A", "B007UM599S", "B00320J6W8", "B0050SXZ7W", "B00576U7W8", "B001D7T2VC", "B005TH6BD4", "B0056WJA6M", "B000K9OR4Q", "B000HWX418", "B0021TVYCG", "B00DJ42BUQ", "B0085CA8QG", "B00B59L9T6", "B004NRN5EO", "B000WQWPP0", "B00109KMQC", "B003O6G1L4", "B0050SXX88", "B002I0JBL4", "B003PHLT8W", "B001NIP3EG", "B005THAX6K", "B000XJK40O", "B0076ZQSFI", "B001NX6GBK", "B001YHX4B0", "B0044SA734", "B001E7MMNG", "B000QU1BEI", "B002I0J5YW", "B000XJLQ24", "B005VBVQDI", "B004UDB9SA", "B009WI7VAS", "B003O6HDHA", "B003O6E6NE", "B001TOMQSK", "B004EDJOYC", "B003BE6OYS", "B002I0H2G0", "B002ELCV00", "B001B1W3GG", "B002BXJ9VA", "B0086V5V8G", "B002BRYHY0", "B003O6FXFY", "B0050SWZHS", "B008PQU3E4", "B004A87506"], "bought_together": ["B0050SX2MK", "B004EW948E"], "buy_after_viewing": ["B0050SX2MK", "B00354NANC", "B004EW948E", "B002I0K5NC"]}, "salesRank": {"Video Games": 3490}, "categories": [["Video Games", "PlayStation 3", "Games"]]}