{"asin": "B0036UMQX0", "categories": [["Electronics", "Car & Vehicle Electronics", "Vehicle Electronics Accessories", "Radar Detectors"]], "description": "The XRS 9970G provides total protection and peace of mind with Super-Xtreme Range Superheterodyne Technology, detecting all 15 radar/laser bands with super-fast lock-on detection circuitry. The unit provides extra detection range and the best possible advance warning of even the fastest of POP mode radar guns. It comes with a GPS Locator and Lifetime updates to the AURA Database, to alert you to verified Speed and Red Light Camera locations, dangerous intersections, and reported Speed Trap locations for entire United States and Canada. Other features include touchscreen operation, a full-color ExtremeBright DataGrafix Display, an 8-point electronic compass, Voice Alert, car battery voltage display/low car battery warning and much more.15-Band DetectionDetects 7 radar, 6 laser and 2 safety signals. Radar signals include X Band, K Band, Ka Superwide, Ku Band, VG-2, Spectre I and Spectre IV+. Laser signals include LTI 20-20, Ultra Lyte, ProLaser, ProLaser III, Stalker LIDAR and Speedlaser. Safety signals include Safety Alert and Strobe Alert.Spectre I UndetectableProvides complete immunity to Spectre I radar detector-detectors.Spectre Alert I/IV+Alerts user when they are under surveillance of Spectre I/IV+ radar detector-detectors.VG-2 UndetectableProvides complete immunity to VG-2 radar detector-detectors.AURA Camera & Driving Database (included)GPS-based technology warns the driver of fixed speed and red light cameras, speed traps and dangerous intersections across North America. The AURA database is updated daily and provides the industry's most complete and accurate coverage and reliability. GPS Locator and Lifetime subscription included.Touchscreen InterfaceThe XRS 9970G features a 1.5-inch full color graphic interface that makes setting up the radar detector fast and easy. Simply tap on the menu screen tab and scroll through the menus to set user settings such as the display colors, city/highway modes, IntelliMute, Frequency Display Mode and other preferences, as well as the alert settings including turning on or off POP Mode, the detection of certain Bands and Low Car Battery Warning.The display provides enhanced data display in easy-to-read vivid colors, and allows user to select from 5 different color schemes to match dash illumination (Full Color, Blue, Orange, Green and Red).Includes USB GPS locator and lifetime subscription to AURA camera & driving database.1.5-inch full color graphic interface with touchscreen control.Suction mounting bracket included.Dim ModeAllows the user to dim the radar detector display enhancing night driving visibility.Auto MuteAutomatically mutes the alert tone for enhanced driver convenience.IntelliViewPicture-in-picture shows radar/laser alerts simultaneously with GPS locator based alerts.Voice AlertWarns driver with specific voice annunciation of the signal being detected.IntelliScopeThis Patent-Pending Techonology provides information about the direction of Location Based Alerts relative to your moving vehicle using Global Positioning System.IntelliShield False Signal Rejection3-Level City Mode offers the best false signal rejection in both urban and rural areas.Safety AlertWarns drivers of the presence and/or approaching emergency vehicles, railroad crossing, and road hazard locations equipped with Cobra's exclusive Safety Alert transmitters.Strobe AlertA Cobra exclusive, works with tens of thousands of emergency vehicles currently equipped with traffic light controlling strobe emitters. Provides advance warning of the presence and/or approach of emergency vehicles.SmartPowerAutomatically shuts off power to the unit when ignition is turned off.IntelliMute ProRelative speed sensing auto shutdown feature will render your detector undetectable by currently available radar detector-detectors.Digital SpeedometerProvides accurate, current vehicle speed using Global Positioning System.8-Point GPS CompassProvides accurate, 8-point directional reading using Global Positioning System.8-Point Electronic CompassAutomatically provides an accurate electronic direction heading.Stay Set Electronic MemoryElectronically remembers radar detector settings for an indefinite period of time even with the power removed.EasySet Programming MenuUser-friendly mode selection/setting with visual guidance.Digital Signal Strength MeterProvides the driver with relative proximity to the target using 5-level digital signal strength meter.Latitude/Longitude InformationProvides accurate latitude/longitude information using Global Positioning System.POP Mode Radar Gun DetectionDetects the latest POP Mode Radar Gun (Super-fast Instant-On Mode)Programmable Up to 1,000 Location AlertsAdd up to 1,000 location-based alerts of your choice.S-XRS Maximum Performance TechnologyNew and improved Super-Xtreme Range Superheterodyne (S-XRS) detection technology, with its super-fast radar lock-on detection circuitry, provides maximum detection range and best possible advance warning to even the fastest of POP mode radar guns.Car Battery Voltage Display/Low Car Battery WarningProvides approximate voltage of your car's battery and also alerts user whenever car battery voltage falls below 11.9 volts.What's in the BoxCobra XRS-9970G Radar and Laser Detector Bundle (XRS-9965 Detector Unit and GPS Locator that Includes Lifetime Subscription to AURA Database), Mini-USB to USB Type-A Adapter Cable (for Database Updates), Coiled 12V DC Power Cord, Windshield Suction Mounting Bracket, Instruction Manual", "title": "Cobra XRS 9970G Voice Alert 15 Band Radar and Laser Detector", "price": 249.0, "imUrl": "http://ecx.images-amazon.com/images/I/41iSBQxBQYL._SY300_.jpg", "brand": "Cobra", "related": {"also_bought": ["B001DSIMAI", "B0063N82OO", "B000FED6NO", "B004AMBW1U", "B001ODDBSU", "B00C3UG3LA", "B00KQ1IVT0", "B002ERZAC0", "B0003NN81M", "B00ANOFPB2", "B00ELO8BPC", "B00CMVCTAO", "B0036UJWM8", "B00G9227ZE", "B003RQBKLC", "B004VBA4R8", "B001TUYQT6", "B008AT6BZQ", "B000BZATW8", "B0002BGELQ", "B001F0RPGG", "B009NOZ4RI", "B00AXX0JOQ"], "bought_together": ["B001DSIMAI", "B000FED6NO"], "buy_after_viewing": ["B004RO3QNI", "B004RO3QOM", "B001TE5V0U", "B000FED6NO"]}}