{"asin": "B000Q5APCC", "categories": [["Electronics", "Portable Audio & Video", "Radios", "Shortwave Radios"]], "description": "Talk about easy listening. The Grundig Et&oacute;n S350 shortwave radio is brimming with style, portability, and functionality. With the S350, you aren't limited to shortwave signals--you get FM and AM radio, too. Shortwave enables you to hear stations from around the world. Get first-hand news and other programs direct from their sources. Listen to the BBC, CDC, Voice of America, DW Deutsche Welle, Radio Taipei International, and dozens of other broadcasting organizations. The S350 receives continuous coverage from 3 to 28 MHz, including 13 international broadcast bands: 11, 13, 15, 16, 19, 22, 25, 31, 41, 49, 60, 75 and 90 meters.Use the S350's manual gain control to compensate for atmospheric and other conditions. With its excellent sensitivity and selectivity, the S350 can receive stations most radios can't, including weak daytime shortwave signals. Other features include a backlit multifunction LCD, a telescoping FM antenna, antenna jacks for SW, AM, and FM, as well as sleep and wake timers (wake to radio and use the S350 as an alarm clock).The radio features a single speaker designed for clear sound. A .125-inch headphone jack (compatible with stereo or monaural headphones, not included) lets you listen in private, or you can route the unit's stereo analog (left/right) RCA outputs to your home stereo system, a tape deck, powered speakers, or other devices.The S350 runs on 4 D batteries (not included), the supplied AC/DC power adapter, or an optional DC vehicle power adapter (12V to 6V DC).Grundig's design-driven Et&oacute;n line of portable-audio offers a graceful combination of form and function. Unique product design is the basis for all models, as well as functionality above and beyond other products in the same category. With features that satisfy high-tech, style-conscious listeners, Et&oacute;n products have an added flare that will attract people seeking distinctive portable audio.What's in the BoxRadio, AC power adapter, leather carrying strap, a user's guide, and warranty information.", "title": "Grundig/Eton S350 AM/FM/Shortwave Field Radio with Alarm Clock and Sleep Timer, Variable RF Gain Control, Full-Range Speaker, Bass and Treble Controllers - Black (NGS350DLB)", "price": 147.45, "salesRank": {"Electronics": 4405}, "imUrl": "http://ecx.images-amazon.com/images/I/51rSbTJdRdL._SX300_.jpg", "related": {"also_bought": ["B000023VW2", "0955548144", "B001PNNXGO", "0955548152", "B004FV4ND0", "B0014T7W8Y", "0945053592", "0914941801", "B001QTXKF6", "B001QTXKFG", "B004H912FC", "B000M9EREE", "B000H7NVX4", "B000EFHPKO", "B003SVGJ9Y", "B00006IS4X", "B004QJKO52", "B0000228GF", "B0009ZAA42", "B00B4PJ524", "B008MPKAPK", "B00164H4AI", "B00020S7XK", "1478376651", "B004H9C4JK"], "bought_together": ["B000023VW2"], "buy_after_viewing": ["B004FV4ND0", "B000023VW2", "B00006IS4X", "B004H9C4JK"]}}