{"asin": "B002LITT56", "related": {"also_bought": ["B004PX56TI", "B001G5ZTRM", "1600596878", "B008515KOM", "B001NJHZM8", "B001Q3VFHC", "B001E3XLZS", "B0018M256G", "B000V1VG5G", "B002LITT5G", "047056508X", "B002CXIA78", "B008514RSC", "B009B0MY6S", "B003VNKNF0", "B002ONUUYC"], "bought_together": ["B004PX56TI", "B003VNKNF0"], "buy_after_viewing": ["B003VNKNF0", "B00EFILHB4", "B008514RSC", "B008515KOM"]}, "title": "Canon PowerShot G11 10MP Digital Camera with 5x Wide Angle Optical Stabilized Zoom and 2.8-inch articulating LCD", "price": 578.38, "salesRank": {"Camera &amp; Photo": 4149}, "imUrl": "http://ecx.images-amazon.com/images/I/51yxYiIsa6L._SX300_.jpg", "brand": "Canon", "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Point & Shoot Digital Cameras"]], "description": "The G Series comes full circle. You asked, and Canon not only listened, but delivered big-time. Advanced amateurs who have overwhelmingly embraced the G Series will be delighted with PowerShot G11, which features RAW mode for unlimited editing options, a 28mm wide-angle lens, and a 2.8-inch Vari-Angle PureColor System LCD. Add to that Canon&rsquo;s new High Sensitivity System and high-speed ISO for incredible image quality, and Canon&rsquo;s top-range compact digital camera is a truly groundbreaking successor.PowerShot G11 HighlightsNew 10-megapixel sensor coupled with Canon&rsquo;s DIGIC 4 Image ProcessorThe PowerShot G11 employs a newly developed, 10-megapixel High Sensitivity System by combining a powerful CCD sensor and Canon&rsquo;s DIGIC 4 Image Processor. Thanks to this technological advancement, the G11 is dramatically more sensitive than cameras with identical megapixel counts, and delivers spectacular images with minimal noise. Increased sensitivity demands a higher ISO speed, and the PowerShot G11 delivers with a new maximum setting of ISO 3200. Blur and camera shake are notably reduced for the ultimate in sharpness and clarity.In addition, a new Low Light mode lets you capture images in an astonishing range of conditions. The camera automatically adjusts the ISO speed from ISO 320 to ISO 12800 in relation to ambient brightness, subject movement and camera shake.Full range of shooting and recording modes including RAW + JPEGThe PowerShot G11&rsquo;s RAW mode lets you shoot images without JPEG compression. It gives you clearer images and complete creative control in editing. RAW images are transferred directly to the computer where they can then be edited using image adjustment software or a processing application to adjust your images as you please. The camera can also be set to allow the simultaneous recording of both RAW and JPEG images while shooting.Also, with 26 Shooting Modes, you're ready for whatever shot comes your way.Large, bright 2.8-inch Vari-Angle LCDThe PowerShot G11 gives you a large 2.8-inch PureColor System LCD screen for excellent control when framing your shots. But size is only part of the story. Canon&rsquo;s PureColor System LCD offers spectacular color, resolution and contrast even at an angle. The screen is durable and easy to see. It is a perfect feature for gathering friends and family around to see your images.Optional accessories including Speedlite flashes, underwater housing and Tele-Converter LensThe PowerShot G11 is compatible with the Speedlite flash series intended for all EOS series SLR cameras. Attach a Speedlite flash to the hot shoe, then you can set and control the flash on the \"Flash Control\" menu in the camera. With a Speedlight, the G11 is given extra functions such as autoflash metering, FE lock and Flash exposure compensation; continuous shooting with external flash. Also Canon&rsquo;s Speedlite Transmitter ST-E2 enables you to have multiple slave flashes and wireless control. A Tele-Converter lens designed for the G11 and WP-DC34 Waterproof Case are also available.Wide-angle 5x optical zoom (equivalent to 28-140mm) with Canon&rsquo;s Optical Image Stabilizer5x optical zoom in actionThe camera is equipped with a long, 5x Optical Zoom, and Canon&rsquo;s own Optical Image Stabilizer Technology keeps images steady and blur-free all through the zoom range--even in low light--by detecting motion and generating a corrective signal. Because it is an optical system, more corrective movement is allowed and there is no degradation of image quality.The G11 is a highly versatile camera with a wide-angle zoom lens that reaches all the way from 28mm at the wide end to 140mm at the telephoto end (35mm format equivalent). You&rsquo;ll capture more image in every shot, and add greater depth to your overall photography.DIGIC 4 Image ProcessorCanon&rsquo;s proprietary DIGIC Image Processors have long set its cameras apart from the competition, and the new DIGIC 4 sets the bar even higher. Faster, more accurate noise reduction delivers better image quality, even at high ISO speeds.iSAPS Technologyis an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the advanced DIGIC 4 Image Processor to improve focus speed and accuracy, as well as exposure and white balance.A newFace Self-Timerautomatically detects an increase in the number of faces and makes the appropriate adjustments. For instance, to include a photographer&rsquo;s face in a group shot, there&rsquo;s no need to rush in. Just put the camera on a stand or tripod, select the Face Self-Timer, and the camera will wait for the photographer&rsquo;s face to get on-camera before it takes the shot. Motion Detection now tracks moving subjects in a much larger range, and the new Servo AF retains focus on a moving subject after the shutter button is pressed halfway &ndash; allowing you to wait for the perfect shot without refocusing. Also, Face Detection and Motion Detection are markedly improved.i-Contrast in actionIntelligent Contrast CorrectionDIGIC 4 also makes possible the new i-Contrast (Intelligent Contrast Correction) system, which controls the compensation level in pixel units to brighten dark areas while leaving bright areas unchanged for better images where the main subject is dark, and more natural transition. The PowerShot G11 can even use i-Contrast in playback mode to adjust images that were shot without the setting activated.Red-eye Correctionprovides options for removing red-eye from subjects in flash pictures.1) The Red-eye Correction during shooting actually identifies and corrects red-eye in human subjects as pictures are taken.2) The G11 can be set to automatically detect and correct red-eye during image playback.Life doesn&rsquo;t give you second chances to capture special times. That&rsquo;s why the G11 features ISO 3200 to reduce the effects of camera shake and sharpen subjects in low-light situations, giving you greater shooting flexibility.HDMI output for viewing still images on an HDTVWith the advanced PowerShot G11, you can capture breathtaking, high-resolution still images and impressive standard definition movies with ease. The camera also makes it simple to enjoy and share your stills and SD movies with a mini-HDMI connector for direct connection to a high-definition monitor or HDTV, so every color and nuance can be appreciated like you intended them to be.Improved Smart AUTO intelligently selects the proper settingJust set the Canon PowerShot G11 to Smart AUTO and you're ready for maximum enjoyment from your picture taking every time. It's a relaxing and satisfying way to shoot because you can completely concentrate on your subject knowing that the camera has the technical details covered. Advanced Canon technology intelligently analyzes your situation and shooting conditions. Then it automatically selects an appropriate setting from specially defined settings. So whether you're photographing flowers, a captivating sunset, or your friends at the park, you can be confident that you're getting dramatic, memorable images.What's in the BoxPowerShot G11Lithium Battery Pack NB-7LBattery Charger CB-2LZNeck Strap NS-DC9Digital Camera Solution CD-ROMUSB Interface Cable IFC-400PCUAV Cable AVC-DC400"}