{"asin": "B001DZVS52", "description": "Hear what you've been missing by turning ordinary MP3 sound into something extraordinary with the Kanto SYD 5 iPod speaker system. This 2.1 sound system has a built-in subwoofer for deep, resounding bass. Additionally, two wide-range drivers offer exceptional audio quality across the spectrum, producing clear, crisp highs that sing. The sleek, rectangular acoustic wood cabinet speaker system lets you dock and charge your iPod, and you can even output video from an iPod to your flat panel screen. The SYD 5 is compatible with the latest iPod and iPhone models, and works with all MP3 players.SYD 5At a Glance:Handcrafted wooden cabinet speaker system and charging dock designed for the iPod and iPhoneDelivers powerful 2.1 sound with two full-range Kevlar cone drivers and built-in subwoofersHigh-efficiency acoustic MDF and interior reinforcement designed to absorb vibration for deep, clear soundWatch video from your iPod on any monitor via the S-video output portConnects to other devices, including MP3 players, televisions, computer sound cards, and CD playersIncludes 21-function remote control for convenient operationBacked by a limited one-year warranty2.1 sound system with built-in subwoofers delivers powerful sound.View larger.Handcrafted Wood Delivers Enhanced Sound ClarityUnlike the plastic components of most conventional iPod docking speaker systems, this quality handcrafted wood cabinet speaker utilizes a special high-efficiency acoustic MDF and interior reinforcement. The system is specifically designed to absorb the excessive vibration and impact sometimes generated under extreme sound conditions.Built-in Subwoofers Deliver Strong BassOnce you dock your iPod, you can use the included remote to crank up the bass--built-in subwoofers ensure that you'll get full-bodied sound. On the front of the unit, two 3-inch, magnetically shielded full-range Kevlar cone drivers and two 5-1/4-inch, magnetically shielded low-range Kevlar cone drivers deliver a forceful 80 watts of power for soaring audio performance that fills any room. On the back, two bass reflex ports aid in the reproduction of low frequencies below 80 hertz, helping to create a fuller soundscape.Watch Video from Your iPod or iPhone on Your TVThe SYD 5 offers more than exceptional audio--it also has an S-video output so you can output video to a monitor. Take advantage of music videos stored on an iPhone or iPod by connecting to a big-screen TV with the included 5-foot S-video cable for an impressive audio visual experience.Control Your iPod or iPhone from Across the RoomIn addition to the manual volume knob and input button on back, this speaker features a convenient 21-function remote control. Adjust the volume, treble, bass, song selection, and input from across the room. The front panel features an LED that tells you whether the speaker power is on or off.Compatible with iPhone and iPodThe SYD 5 is compatible with a wide range of iPod players, including the iPod classic (4G through 6G), iPod mini, iPod nano (1G through 5G), iPod touch (1G through 4G), and iPod 5G. Universal iPod adapters are included with the speaker system to ensure stable iPod docking for most models. The SYD 5 works with all iPhone models.Accepts Additional DevicesIn addition to working with your iPod and iPhone, the versatile SYD 5 also supports any MP3 player via an auxiliary input line that connects to the 3.5-millimeter jack of the audio device. A standard RCA line input is also included to allow you to connect a CD player, computer sound card, television, or other source.Product and Warranty InformationThe Kanto SYD 5 measures 7-1/4 by 22 by 8 inches (H x W x D), and weighs an impressive 22 pounds. It is backed by a limited one-year warranty. Kanto offers a full 30 day money back guarantee on all online purchases.Kanto also offers theiPair 5 iPod speaker systemfor music lovers who want separate speakers for true stereo sound.What's in the BoxSYD 5 speaker, AC power adapter, remote control, magnetically detachable grill, universal dock adapters, S-video cable, 3.5-millimeter stereo mini headphone jack to RCA audio cable, foam pad feet for speaker, and user manual.The SYD 5 is available in a variety of colors. Click your favorite.", "title": "Kanto SYD 5 Powered Speakers (Black)", "price": 379.0, "imUrl": "http://ecx.images-amazon.com/images/I/31Kfsq2AH9L._SX300_.jpg", "related": {"also_viewed": ["B006PH6LO6", "B00AMAJG94", "B00HQWRTRM", "B00AMAJG8U", "B00GMPDAAO", "B00AMAJG9O", "B00JPJ24MO", "B00KONGN3Q", "B00JPJ22SA", "B00GMPDAHM", "B00HQWRTS6", "B002IB4KWI", "B00GMPD9IW", "B00AMAJG80", "B00JPJ22MQ", "B00AWLI7E8", "B00DS5QZYO", "B00JPJ22BW", "B00HQWRULW", "B00KONGN86", "B00JPJ1YAM", "B00KONGN1S", "B00AWLI7DO", "B00I3I5VL4", "B00006JPDI", "B005OA3BSY", "B0040NPHLA", "B005OSR1C8", "B005SE6QBU", "B00B2IRI1S", "B00DQMJE7E", "B00JPJ20EQ", "B00AWLI6QW", "B00DS5QZSU", "B00AWLI6P8", "B005KTNV70", "B00AXYKF30", "B001S14DYO", "B001RQ4IA4", "B002QQ7TLY", "B0051WAM64", "B008KEPX1O", "B005VR0PQQ", "B00JPJ20A0", "B002BA5JLW", "B00ANJIBL8", "B000BKBYY0", "B001RNOHDU", "B0036C288Q"], "buy_after_viewing": ["B001DLTDQC", "B0046RE00Y", "B004E0ZLZQ", "B006PH6LO6"]}, "categories": [["Electronics", "Portable Audio & Video", "MP3 Players & Accessories", "MP3 Player Accessories", "Speaker Systems"]]}