{"asin": "B000DZDTKU", "description": "The Canon EOS 30D replaces the award-winningEOS 20D. It brings proven EOS technology to a new level, giving photographers an unbeatable photographic experience. The EOS 30D incorporates a host of new features with Canon's highly acclaimed 8.2-megapixel CMOS sensor and DIGIC II Image Processor. The EOS 30D includes enhanced operational features such as a new 2.5-inch LCD monitor, true spot metering, a durable new shutter mechanism, and Canon's Picture Style pre-sets (Canon's in-camera image processing standard), all in an sturdy, magnesium-clad body. The maximum number of images in a folder is increased from 100 to 9,999, while the in-built flash has been upgraded to match the 100,000 shutter cycle durability, an increasingly important feature in the digital age. With all these new features the EOS 30D is truly perfection, refined.Canon's CMOS sensor technology allows for a wide dynamic range with reduced noise.Speed and image qualityThe EOS 30D features Canon's award winning CMOS sensor technology, with large 6.4&#181;m2 pixels for wide dynamic range with low noise. Any remaining fixed pattern and random noise is dealt with by on-chip noise-elimination circuitry. A low-pass filter in front of the sensor reduces false color and moir&#233; effects, while an infrared filter suppresses red fringing caused by sensor reflections and fog. The camera features Canon's DIGIC II processor now found across the digital EOS range. DIGIC II maximizes speed and image quality by processing uncompromisingly complex color rendition algorithms, clearing the buffer at high speed.The 30D's 9-point wide area AF system provides versatility in focusing.Sharp, fast focusThe EOS 30D has a high-precision, 9-point wide area AF system that uses both normal and high-precision focus depending on the aperture and available light. The 9 focus points can be chosen automatically or manually-selected using the 30D's intuitive, thumb-operated multi-controller.The 2.5-inch LCD display is viewable at angles up to 170 degrees.A new level of clarity for reviewThe EOS 30D has a brilliant 2.5-inch LCD monitor with approximately 230,000 pixels. Adopted from Canon's professional EOS SLRs, this monitor not only displays more information, it can also be viewed at a greater angle (170 degrees) than many conventional LCD monitors. The full-featured shot information screen not only provides an RGB histogram, it can display the AF frame used. Magnification has never been faster. Magnification zooms to the focus point rather than the center of the image to check exposure and critical focus. It is also simple to jump quickly in image intervals up to 100. Menus are accessed at the touch of a button and feature larger text that is easier to read. Whether changing color parameters, setting up custom functions, organizing folders or setting white balance, the EOS 30D helps photographers get to their information quickly, so they never miss a shot.Every function optimized for fast RAW and JPEG captureThe EOS 30D is one of the fastest cameras Canon has ever produced. Incorporating the fast operation of the EOS 20D, the 30D allows users to specify high-speed 5 frames per second (fps) or a new low-speed 3 fps continuous shooting for more controlled shooting and/or to save space on the CF card. And it can capture up to 30 JPEG and 11 RAW (or 9 RAW + JPEG) files in one burst. Whether it's the 0.15-second startup time, the high-speed mirror drive, the nearly instant 65-millisecond shutter release lag time or the predictive AF focusing at speeds up to 5.0 frames per second, the EOS 30D will amaze and delight photographers who don't want to wait for their camera when they're ready to shoot.Shoot continuously at 3 or 5 frames per second.Direct printing with PictBridge compatible printersThe EOS 30D lets you print beautiful photos with minimum time and effort - directly from the camera. It's compatible with Canon's SELPHY Compact Photo Printers, desktop PIXMA Photo Printers, and even third-party PictBridge-compatible printers.EOS: The systemOne of the EOS 30D's greatest advantages is the EOS system: compatibility with all Canon EF and EF-S lenses, EX-series Speedlites, and EOS accessories such as theWireless File Transmitter WFT-E1. (Wireless file transmitter and lenses not included--must be purchased separately.) For high-speed processing of lossless RAW images and complete capture-to-print workflow management, the EOS 30D also comes with Canon's latest Digital Photo Professional software.Battery gripTo extend the EOS 30D's 750-shot (CIPA standard) battery life and increase handling options, the camera is compatible with theBG-E2 battery grip. (Not included; must be purchased separately.) The BG-E2 takes two Lithium-Ion battery packs for up to 2,200 frames or six AA batteries in the supplied BGM-E2 battery magazine. (Shooting capacity with AA batteries is lower when compared with the Battery Pack BP-511A.) For easy vertical shooting, the BG-E2 provides additional shutter release, main dial, AE lock/FE lock, and AF point selection controls.SoftwareAs well as the latest Digital Photo Professional RAW image processing software, the EOS 30D comes with Canon EOS Solution Disk, containing the new EOS Utility (integrating remote capture software), plus the latest versions of ZoomBrowser/ImageBrowser and PhotoStitch.The EOS 30D includes membership of Canon's online photo album, Canon iMAGE Gateway with 100 MB of space for image uploads and photo sharing. (Canon iMAGE Gateway is not available in all European countries.)Technologies ExplainedPicture StylePicture Style pre-sets simplify in-camera control over image quality. Picture Style pre-sets can be likened to different film types--each one offering a different color response. Within each easily selectable pre-set, photographers have control over sharpness, contrast, color tone, and saturation. The camera's factory default configuration is set to deliver immediately-usable JPEG images without need for additional menu settings. Picture Style presets applied to a RAW image do not degrade the image in any way and can be revised with Canon's Digital Photo Professional software.The six pre-sets include:Standard: for crisp, vivid images that don't require post-processingPortrait: optimizes color tone and saturation and weakens sharpening to achieve attractive skin tonesLandscape: for punchier greens and blues with stronger sharpening to give a crisp edge to mountain, tree, and building outlinesNeutral: ideal for post-processingFaithful: adjusts color to match the subject color when shot under a color temperature of 5200KMonochrome: for black and white shooting with a range of filter effects (yellow, orange, red, and green) and toning effects (sepia, blue, purple, and green)The User Defined pre-set can be used to store up to three customized pre-sets, or any of the pre-sets available for download from Canon's web site.DIGIC IINow found across the EOS range, DIGIC II is a purpose-built, dedicated image processor responsible for the high speed calculations necessary in order to providing exceptionally accurate color reproduction in real time. Canon's second generation imaging engine, DIGIC II performs the duties of a number of separate processing units to speed processing, save space, and optimize battery life.To avoid the trade off faced by other manufacturers between camera responsiveness and image quality, Canon has created a processor so fast it can read, process, compress, and write image data back to the buffer between exposures. This allows for longer continuous bursts at maximum frame rates before the buffer fills. Moreover, each image can be subjected to the full complex processing algorithms required in order to deliver superb image quality.CMOSCanon's award winning CMOS technology is one of the company's key competitive advantages. With noise reduction circuitry at each pixel site, Canon's CMOS sensors have lower noise and lower power consumption characteristics than CCD sensors.CCD sensors use a bucket relay system to transfer each pixel's accumulated electrical charge to a corresponding gutter. The operation is time consuming and draws considerable power, which limits battery life and generates unwanted heat, further increasing noise and lowering image quality.By contrast, signal conversion in Canon's CMOS sensors is handled by the individual amplifiers at each pixel site. Unnecessary charge transfer operations are avoided, vastly speeding up the process of getting signal to the image processor. Noise generation is reduced and power consumption limited.Digital Photo Professional SoftwareDigital Photo Professional software provides high-speed processing of lossless RAW images. Processing with Digital Photo Professional allows real-time display and immediate application of image adjustments, giving control over RAW image variables such as white balance, dynamic range, exposure compensation, and color tone. The camera JPEG images can be recorded in sRGB or Adobe RGB color space, and the Digital Photo Professional application supports sRGB, Adobe RGB and Wide Gamut RGB color spaces. An ICC (International Colour Consortium) profile attaches automatically to RAW images converted to TIFF or JPEG images. This allows faithful reproduction of colors in software applications that support ICC profiles, such as Adobe Photoshop. For improved efficiency, a set of image adjustments can be saved as a recipe and applied to multiple images.", "title": "Canon EOS 30D 8.2MP Digital SLR Camera (Body Only)", "imUrl": "http://ecx.images-amazon.com/images/I/41jwrgTShxL._SX300_.jpg", "related": {"also_bought": ["B000W05O5O", "B000V5K3FG", "B00007E7JU", "B003MACYGS", "B000BNY64C", "B002WE4H8I", "B001FO4QHI", "B00194VYR4", "B002NO7Q26", "B00006I53S", "B00065ANYW", "B00005K47X", "B000T9251O", "B0002Y5WXO", "B002YVRGPA", "B000HDZAUA", "B00894YP00", "B0007WK8MQ", "B002AQBJX4", "B000YZGCIU", "B003CQD3B2", "B0002YE6G8", "B0040JHVCC", "B005IMFX2K", "B002VPE1WK", "B00004ZCJG"], "buy_after_viewing": ["B00007E7JU", "B0002XQI2E", "B000V5K3FG", "B003VNKNEQ"]}, "salesRank": {"Camera &amp; Photo": 6841}, "categories": [["Electronics", "Camera & Photo", "Digital Cameras", "Digital SLR Camera Bundles"]]}