{"asin": "B001E25KDK", "categories": [["Electronics", "Computers & Accessories", "Computer Components", "Internal Sound Cards"]], "description": "The Creative PCI Express Sound Blaster X-Fi Titanium sound card delivers exceptional audio performance to your PC. With realistic environmental effects and 3-D positional audio, you'll be able to locate opponents by sound whether you're using surround speakers or stereo headphones. In addition, the X-Fi Titanium uses a powerful audio-processing engine that will outperform other motherboard audio options.PCI Express Sound BlasterX-Fi Titanium Sound CardAt a Glance:Powerful audio processing for better game performanceX-Fi CMSS-3D creates nine virtual speakers when using stereo headphonesX-Fi Crystalizer restores lost detail in compressed music and audioRealistic gaming effects with EAX 5.0Dolby Digital Live and DTS Connect (Windows Vista only) EncoderWith a powerful audio processing engine, you'll have a boost of up to 15 percent in real-game performance.View larger.Powerful Audio Processing Boosts Game PerformanceThe PCI Express Sound Blaster X-Fi Titanium employs a powerful audio-processing engine. Unlike other motherboard audio solutions that task the computer processor, the X-Fi Titanium performs the heavy lifting and leaves your processor free to work on other tasks. This boosts real-game performance by up to 15 percent, while still delivering all audio effects with outstanding 24-bit sound quality.Realistic Gaming Effects with EAX 5.0 TechnologyWith support for EAX ADVANCED HD technology, the X-Fi Titanium delivers rich environmental effects for a more immersive gaming experience. You'll hear bullets whizzing by your head, feel earth-shattering explosions, and experience other sound effects that bring you closer to the game.Positional 3-D AudioWith X-Fi CMSS-3D technology, the X-Fi Titanium delivers outstanding surround sound whether you're using headphones or speakers. When used with a regular pair of stereo headphones, X-Fi CMSS-3D creates nine virtual speakers for exceptional surround effects, letting you feel like you're sitting in the best seat of a movie theater. You'll get an advantage in games, too, with the ability to locate enemies by sound before they see you.And with multichannel speakers, you'll be able to hear exactly where the audio cues are--even between speakers. Voices will be right in front of you and ambient sound will surround you, just like a live performance. CMSS-3D works with both desktop stereo speakers and full surround speaker systems.X-Fi Crystalizer Restores Lost DetailsRecover lost detail with X-Fi Crystalizer technology. This technology restores the audio detail that is lost in compressed audio files so you'll regain vibrancy and clarity in your music and movies. Highs and lows that were lost are enhanced, so whether you're listening to cymbal crashes or wailing guitars, you'll hear the music as it was meant to be heard.High-Quality Voice ChatWith high-quality inputs and hardware audio processing, the X-Fi Titanium ensures great vocal quality in your voice chats, so your teammates will hear you loud and clear. Plug in your headset or microphone, and you'll hear the difference instantly.Intense Cinematic Sound for MoviesThe X-Fi Titanium delivers THX-certified surround sound for a cinematic experience right at your computer. Cyberlink PowerDVD software is included (via free download) and supports DTS and Dolby Digital-EX decoding for an unmatched DVD movie-watching experience.The X-Fi Titanium also supports Dolby Digital Live and DTS Connect encoding (Windows Vista only), so you can connect directly to your home-theater system through a single digital cable for fantastic 5.1 surround sound.Advanced Features for Audio and Music CreationFor those in the audio- and music-creation business, the X-Fi Titanium offers advanced features for outstanding results. A dedicated mode supports near transparent conversion between any resolutions, digital-matched recording, low-latency ASIO support, and more.System RequirementsMicrosoft Windows 7, Vista, or XP; Intel Pentium 4 1.6 GHz or AMD Athlon XP 2000+ processor or equivalent; available PCI Express (x1, x4, x8, or x16) slot; 256MB RAM (512 MB RAM for Vista); 600MB of free hard-disk space; CD or DVD-ROM for software installation; headphones or amplified speakers; Internet connection to download PowerDVD player software.What's in the BoxPCI Express Sound Blaster X-Fi Titanium sound card, Quick Start leaflet, and installation CD.Creative Sound Blaster Sound Cards (Internal)Looking for external sound cards from Creative?Clickhere.Sound Blaster X-Fi Xtreme Audio PCI Sound CardSound Blaster X-Fi Xtreme Audio PCI Express Sound CardSound Blaster X-Fi Titanium PCI Express Sound CardSound Blaster X-Fi Titanium Fatal1ty Professional Series PCI Express Sound CardSound Blaster X-Fi Titanium HD Internal Sound Card with THX SB1270General Info:Connection TypePCIPCI ExpressPCI ExpressPCI ExpressPCI ExpressSNR for Playback108 dB104 dB109 dB109 dB122 dBSpeaker/Headphone SupportStereo to 7.1Stereo to 7.1Stereo to 7.1Stereo to 7.1Stereo, with dedicated 115dB 24-bit/96kHz HD headphone outputMusic and Movies:24-bit Sound QualityX-Fi CrystalizerX-Fi CMSS-3DDTS & Dolby Digital Decoding via free PowerDVD DownloadDolby Digital Live and DTS Connect (Win Vista Only) EncoderSwappable Op-AmpsTHX TruStudio ProGames:EAX SupportEAX 4.0EAX 4.0EAX 5.0EAX 5.0EAX 5.0X-Fi CMSS-3D Headphone SurroundHardware Accelerated for Better PerformanceHardware OpenAL and DirectSound3D Support64MB X-RAMMusic Creation:Dedicated Creation Mode with ASIO 2.0 and 3D Midi Support", "title": "Creative Labs SB0880 PCI Express Sound Blaster X-Fi Titanium Sound Card", "price": 82.99, "salesRank": {}, "imUrl": "http://ecx.images-amazon.com/images/I/51C8l31PAJL._SX300_.jpg", "related": {"also_viewed": ["B000W7PNZI", "B00EO6X4XG", "B00EO6X7PG", "B00654PUPA", "B0018EFGTM", "B00B1I0QYK", "B000IZC0GO", "B005JFCS92", "B0093L6SCG", "B00198DM2K", "B009ISU33E", "B0060SXDRI", "B00654PTT2", "B007TMZ1MY", "B000J1F1BI", "B007TMZ1BK", "B000IZAN4K", "B0045JHJSS", "B009XDWUCQ", "B00AQ5PK6I", "B001OV789U", "B000CFSL4A", "B002UVME88", "B002VAD716", "B00COA2A7A", "B0000CG4DI", "B00778G78C", "B0044DEDCA", "B001EZQ8YC", "B001BS1OQY", "B005DBOPD4", "B000LP0R3E", "B004275EO4", "B007ZT1Q3E", "B00E3RH61C", "B005OQ0XIO", "B00FWFNY92", "B00GNHV0LM", "B007ZW0VNM", "B0011BC1FO", "B009SRHGFS", "B002DH3IKM", "B002I9L3X4", "B00EZT7RE4", "B001H4ZCS8", "B0017QQQAE", "B007WLRK2Q", "B00KTFJ0Z2", "B002BZIZ04", "B000FJR1EY", "B00064ABSG", "B002NJT9KI"], "buy_after_viewing": ["B009ISU33E", "B000W7PNZI", "B00EO6X4XG", "B00EO6X7PG"]}}